{"result_id": "002032", "URL": "https://21stcenturywire.com/2022/02/11/get-ready-for-it-the-return-of-aids-new-vaccine-moderna-fauci/", "timestamp": "2023-04-25 11:45:01 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://21stcenturywire.com/wp-content/themes/magazine/images/favicon.ico", "canonical": "https://21stcenturywire.com/2022/02/11/get-ready-for-it-the-return-of-aids-new-vaccine-moderna-fauci/", "encoding": "UTF-8"}, "image": null, "domain": "21stcenturywire.com", "title": "Get Ready for It: The Return of AIDS (and a new vaccine)", "cleaned_text": "In the past few days the topic of HIV/AIDS has been thrust back into the spotlight. On 27 January, it was announced that Moderna is launching clinical trials for a new HIV vaccine using mRNA technology. A few days later on 3 February, Oxford University researchers published a study in the journal Science claiming discovery of the “VB variant” of HIV, and describing it as “highly virulent”.\n\nThis news about the VB variant’s higher virulence was a point that mainstream news media made sure to repeat and amplify. Here are a selection of headlines covering the story:\n• New Scientist: ‘VB’ is a new and more infectious variant of HIV – but it is treatable\n• Daily Mail: New HIV super-strain is found in the Netherlands: Highly infectious variant makes people ill twice as quickly\n\nWhile the study found viral loads of those infected with VB could be up to 5.5 times higher, the large number of mutations caused several MSM outlets to declare it a ‘super-mutant’ or ‘super-strain’.\n\nThat some of the MSM are calling this variant “new” is problematic, however. The study makes very clear that this variant of HIV has been circulating since at least 1992, that the most recent case was diagnosed in 2014, and that in total only 109 individuals with the strain could be found. The variant is not new; the only new part is the research identifying this variant as distinct from other strains of HIV. But fear sells.\n\nLuckily, this scary ‘new’ variant of HIV has been identified just in time to make Moderna’s HIV vaccine trials seem more relevant. This particular vaccine candidate, known as IAVI G002, was developed in conjunction with Scripps Research and the International AIDS Vaccine Initiative (IAVI), and the trial is being partially funded by the Bill & Melinda Gates Foundation.\n\nOn social media and in certain populist corners, the frequency of AIDS mentions has also increased. Part of this increase has been fueled by evidence (both anecdotal and scientific) that COVID vaccinations are harming recipients’ immune systems. The term “VAIDS” (Vaccine-Induced Acquired Immune Deficiency Syndrome) is being used to refer to an ostensible AIDS-like deterioration of the immune system that is caused not by HIV but by vaccination for COVID.\n\nAmerica’s Frontline Doctors state that “Doctors are calling this phenomena in the repeatedly vaccinated “immune erosion” or “acquired immune deficiency”, accounting for elevated incidence of myocarditis and other post-vaccine illnesses that either affect them more rapidly, resulting in death, or more slowly, resulting in chronic illness.”\n\nThis theory rests at least partially on a Lancet study conducted late last year, which concluded that the level of protection afforded by COVID vaccination decreases over time, eventually even passing the point where the vaccinated are at greater risk than the unvaccinated.\n\nIncidentally, this is not the first time there has been a connection between COVID and HIV. In December 2020 it was reported that an Australian COVID vaccine candidate was abandoned during trials after some recipients falsely tested positive for HIV. That suggests at least the possibility of a connection between the two things.\n\nFurther evidence of this possible connection comes via the Indian scientists who in January 2020 published and quickly withdrew a scientific study paper documenting that the SARS-CoV-2 virus contained 4 unique genetic insertions from HIV.\n\nLuc Montagnier, the French virologist who won the 2008 Nobel Prize in medicine for discovering HIV, also claimed that SARS-CoV-2 contained insertions from HIV. He had also previously urged caution regarding COVID vaccines, and warned of the danger of antibody-dependent enhancement.\n\nSadly, by some strange coincidence, Luc Montagnier passed away this week, just at the very time HIV is coming back into the public’s consciousness. He was 89.\n\nThe essay below from author Karen Hunt provides a further discussion on the ‘Resurrection of HIV‘…\n\n\n\n \n\n “It is an indescribable experience knowing that what you are doing will have an impact on the lives… of millions of people.” ~ Dr. Anthony Fauci\n\nHe is the victim of liars, scammers and jealous rivals who wish to destroy his reputation and his career, when all he is doing is humbly and selflessly trying to save the world.\n\nAnd he has saved the world. He has!\n\nVaccine and mask mandates are being dropped. Even that most rigid of communist propagandist, Dr. Leana Wen, now tells us that “the science has changed” (what, again???) and she supports lifting some pandemic restrictions and that “the decision to wear a mask should shift from a government mandate to an individual choice.”\n\nWow, did we just hear the words individual choice drop from Wen’s mouth?\n\nThe science can change, that’s a beauty of it. It can change at any time. The key, of course, is in who interprets the changing science for us. And that person is Dr. Anthony Fauci.\n\nWhat has not changed during this interlude of falsified freedom is the government’s ability to do this again. And again. This bowing down to the will of those above us has been normalized.\n\nAny time Fauci deems it necessary, for our own good, he can change the science. After all, he is the world’s #1 infectious disease expert. For almost three years, this phrase has been repeated over and over until it is engrained in our minds.\n\nDiminutive, bespectacled Tony, the guy with the feisty New York accent, has risen from a behind the scenes manipulator to become the most influential and listened to health expert in history. Thanks to his overarching influence, the power of pharmaceutical companies have risen with him. Pfizer heads them all, having raked in a whopping 36,800,000,000 in COVID vaccine sales in 2021. $50 billion is expected from the vaccine and Paxlovid therapeutics in 2022.\n\nCompare that to the once top-selling drug, Humira, which brought in a mere 19.9 billion in 2019.\n\nDo you really think Anthony Fauci and his Mafioso gang are going anywhere anytime soon? Even if they did, they would simply be replaced.\n\nThose of us looking on from the sidelines with horror have a hard time understanding how most people, and certainly those in high places, are one hundred percent behind this tyranny and are doing all they can to ensure that it continues. Mind you, I am not saying they believe in its benevolence, that has nothing to do with it. They are behind it because either they want to be on the winning side or they are terrified of opposing it, or both.\n\nFauci’s policies and the experimental gene therapies that he inflicted upon the masses are being lauded as the reason why we are coming out of this pandemic at last. He won Time magazine’s 2021 Person of the Year, because his “courage and candor have earned our trust. We are all fortunate to have a man of his wisdom, experience and integrity to help us navigate these difficult waters.”\n\nFauci’s father was a pharmacist in Brooklyn New York. Fauci’s mother and sister ran the front of store while Anthony delivered prescriptions on his bike. The family lived upstairs in the second-floor apartment. “Each block in my neighborhood had the smells of rich, thick Sunday sauce and the music of Frank Sinatra and Dean Martin,” he said in the interview with the US World Herald, “My very best memories as a child are of the house being full with aunts, cousins, and uncles with a table of good food.”\n\nFauci had the perfectly idyllic Italian American childhood, all while delivery life-saving drugs to families in the neighborhood.\n\nWe all tell ourselves the stories of our lives. This is how we create our identities, how we decide who we are. We pluck out certain events from our pasts, as I have done, for example, when weaving the stories of my childhood into these essays. We tell ourselves those stories over and over, choosing to remember them in a certain way. Without our memories, who would we be? How would we know ourselves?\n\nPerhaps Anthony Fauci truly believes he is saving the world. Perhaps he can easily sit at the head of the dinner table on Sundays and look around at his family with satisfaction, assured that he will leave behind a legacy as one of the greatest, if not the greatest, medical men in history.\n\nFauci’s mentor was a man named Sheldon Wolf, who gave him his first job at the NIH. Wolf encouraged Fauci to explore the things he was most curious about. The WSJ article, The Mentor Who Made Dr. Fauci describes how “Fauci chose a rare inflammatory disease with a 100% fatality rate and went searching for inspiration. He found it two floors away. NIH researchers upstairs were testing immunosuppressive drugs on cancers, and Fauci tried experimenting with low doses on his patients. It was highly unorthodox. It was also highly effective. This pioneering use of anti-cancer drugs for a non-cancerous disease was essentially its cure.\n\n“I’ve always wanted to be involved with diseases that were very, very serious,” Fauci once said. “I would rather be involved with patients who have fatal diseases than those with diseases that are just an annoyance. That just happened to be my bent. I wanted to be where the action was.”\n\nIt is interesting to note that Fauci had this great success early on by using anti-cancer drugs for a non-cancerous disease and he went on to repeat this with AIDS, which I will come back to later in the essay.\n\nThis man who started off as an idealistic boy, delivering drugs on his bicycle, who wanted to be “where the action was,” grew and grew beyond his critics, beyond those who dared to challenge him, learning to maneuver his way in and out of controversy, telling himself and then the world, bigger and bigger stories to justify drugs, mountains of drugs representing untold wealth and power, until he stood at the very top of the vast medical complex looking out upon a sea of humanity that he no doubt firmly believed it was his job to save.\n\nThis medical empire has now grown so big, that when it falls, and surely it will one day for that is the nature of things, that they grow and they die, it will bring down our entire civilization with it. So, think long and hard before calling for its downfall, for what will happen on that day is an apocalypse…a subject for another essay.\n\nMany have sought to defy the vast machine. The latest is Joe Rogan. He is perhaps the most notable example, because he is just an “ordinary guy” like the rest of us, who rose to fame and fortune through an insatiable curiosity and genuine interest in talking to all different kinds of people.\n\nI’ve heard it said with great enthusiasm, that Fauci should go on The Joe Rogan Experience. Wow, he should debate Dr. Malone. How great would that be?\n\nOld fox that he is, Fauci would never fall for that. Why should he? People like Rogan and his guests are so far beneath Fauci in credibility it would be farcical for him to stoop to their level.\n\nRogan is a morality tale of what happens to the most defiant of sinners. He must now atone for his sins. And he has tried to do so. He started with one apology and the floodgates opened. His apologies are growing ever sadder and more embarrassing, the latest having him defend his “missteps” and saying that his “dedicated listeners know” he’s “just trying to be funny.”\n\nSpotify has removed over 100 episodes of Joe Rogan’s podcast and it will not end there. The hit pieces keep on coming. Howard Stern is now telling Joe Rogan to apologize for COVID-19 misinformation and publicly endorse the vaccine. Grovel more. Humiliate yourself. Take that walk of shame. Come on, everyone wants to see it. You know all about MMA, let’s see the blood flow.\n\nThe message is clear. We can and we will destroy anybody who dares to defy the medical empire.\n\nFauci survived the controversies of the AIDS epidemic and, like a serial killer who leaves behind his calling card with each murder, he is repeating the same playbook. How is this possible?\n\nBecause just like we learned with Andrew Cuomo, nobody goes down for the really bad stuff. Attention had to be diverted away from those embarrassing deaths of the elderly in care homes, so a parade of women surfaced with stories of his shocking behavior, such as placing “unwanted kisses” on the cheeks of two women, one a state trooper.\n\nThe day Fauci is accused of “demeaning” his subordinates or being a “racist” or a “white supremacist” or a purveyor of “misinformation,” will be the day we know he’s going down. But I very much doubt that day will ever come, or my name isn’t Karen. Which it is.\n\nEvery person is complex and none more complex than Anthony Fauci. A professional assassin can be a loving family man and still raise his gun, look through the lens and shoot a stranger, happily pocketing his pay afterward. How many SS guards went home to their families after herding their fellow humans into gas chambers, kissed their children good-night and went to church on Sundays?\n\nThirty years ago, Dr. Robert Willner, author of Deadly Deception and noted for his role in AIDS research, accused Fauci of genocide during the AIDS epidemic. Below are his words, chilling to read today:\n\nAnd by the way, you can buy Dr. Willner’s book, Deadly Deception, but it will cost you $693.70 because it’s that hard to find.\n\nWhat Buroughs Wellcome did that so incensed Dr. Willner is oddly similar to what Merck did by destroying ivermectin’s reputation in favor of its “new” Molnupiravir antivirus pill. You can learn more in my essay The People’s Medicine vs Merck’s Billion $ Pill.\n\nReflect back on what I told you about Fauci’s first big success, “pioneering use of anti-cancer drugs for a non-cancerous disease” that turned out to be “essentially its cure.”\n\nBurroughs Wellcome took an old cancer drug that hadn’t worked out very well, AZT, or azidothymidine, and repurposed it for AIDS. In 1987, Wellcome obtained FDA approval to market the drug, after a rushed and bogus trial. But no matter, this was an emergency, and something was better than nothing. The company called the “new” drug Retrovir and sold it for $188 for a hundred 100mg capsules. The price was so high most people could not afford it.\n\nA hundred times worse than Wellcome’s price-gouging were the side effects of AZT, including severe intestinal problems, damage to the immune system, nausea, vomiting and headaches. People taking AZT soon began showing rising virus levels — but the virus was no longer the same, having mutated to resist the drug. More drugs were needed.\n\nMore and more drugs. Endlessly more drugs.\n\nAnd as we now see with drug companies like Pfizer and Moderna, once Burroughs Wellcome’s drug was approved, as described in Celia Farber’s Spin’s 2015 article AIDS and the AZT Scandal, big profits ensued:\n\n“Stock went through the roof when the announcement was made. At a price of $8.000 per patient per year (not including bloodwork and transfusions), AZT is the most expensive drug ever marketed. Burroughs Wellcome’s gross profits for next year are estimated at $230 million. Stock market analysts predict that Burroughs Wellcome may be selling as much as $2 billion worth of AZT, under the brand name Retrovir, each year by the mid-1990s — matching Burroughs Wellcome’s total sales for all its products last year.”\n\nAs now, with people being bullied and fearmongered into taking an experimental gene therapy, Gene Fedorko, President of Health Education AIDS Liaison (HEAL). Farber described the same methods used on AIDS patients:\n\n“I’m convinced that if you gave AZT to a perfectly healthy athlete,” says Fedorko, “he would be dead in five years.”\n\nThese words of Fedorko come back to haunt us when we look at what is happening to so many athletes who have taken the mRNA vaccines. Here is a list of 17 high-level athletes who have collapsed, had heart issues or died. This is just one list, there are many others.\n\nDeaths matter little when that much money is involved. The flow cannot be stopped. The fountainhead, the impetus that keeps it all flowing, is Dr. Fauci.\n\nAs head of NIAID, Fauci controls more than $6 billion in funding for scientific research. For decades, Fauci has been the mastermind behind the decisions on which direction medical research should go. With a yah or a nay, Fauci decides who gets money for what research and who doesn’t. It is “thanks” to Fauci that Retrovir was funded, just as it was thanks to Fauci that the mRNA vaccines were funded.\n\nCelia Faber interviewed PCR inventor Kerry Mullis in a Spin 1995 story who had this to say about Fauci and his gang:\n\nGoing back to why Fauci will never talk to Joe Rogan, we have the answer right here, told to us in 1995 by Kary Mullis. Fauci will never allow his carefully crafted facade to slip by exposing himself to the hard questions.\n\nIn the first chapter of Inventing the AIDS Virus Dr. Peter Duesberg had this to say:\n\nIt’s a cutthroat game, hunting viruses. Creating this Covid pandemic was the creme de la creme. It has opened the door to more and more drugs, vaccines, implants under our skin, the introduction of a social credit system and so much more.\n\nFar from returning to normal as they are trying to claim, the media has recently been inundating us with warnings about the next virus or variant. The hype is that this surge in acquired immune deficiency is not the drugs, but it has something to do with HIV.\n\n“We have known what causes acquired immunity deficiency diseases for at least 70 years. It’s in the medical textbooks. It’s there for you to read.\n• Number one cause on the face of this Earth, is malnutrition and starvation. That’s Africa. Look to the headlines of the October 3rd issue of the London Times, Sunday Times last year [1993]. And inside headlines that screamed across 2 pages “The Plague That Never Was”.\n• Number two is drugs. And don’t just think of street drugs. Because the number one cause of AIDS today is actually TWO medical drugs! AZT. A drug that was discovered in the 60’s as a chemotherapeutic drug for cancer. And was shelved because it was too toxic to treat cancer. A drug worse than cancer. Is being used to treat people who are immuno-suppressed.”\n• Number three cause of AIDS is radiation. Whether they worry about Chernobyl and Nagasaki and Hiroshima.\n\nDr. Duesberg warned that “science took a wrong turn” with AIDS.\n\nDr. Duesberg seemed to believe that the tide would turn. That surely science would redirect itself and become honest again.\n\nIt did not.\n\nWe are still on this mad path of chasing viruses; of being “where the action is.” It has proved to be too lucrative and the public too gullible. Why stop?\n\nFauci has told us the story and he is the master storyteller. The majority nods and says, ah, yes, it must be so.\n\nWhat happens next time? What if we are told we must now get vaccinated against HIV? It doesn’t have to be that, of course. It could be something else. What happens if we are ordered to get an mRNA vaccine every year against Covid? And against the flu? Against a new strain of smallpox? And against the next illness and the next?\n\nLike Rogan’s apology, once billions of people submitted to the first one, it’s virtually impossible to stop the next, and the next. No matter how cocky or tough, diminutive Fauci will avoid your punches and get you to submit instead.\n\nModerna is beginning a trial of an mRNA vaccine for HIV.\n\nThe race is on. I can just see those CEOs rubbing their hands together with glee. So much to do. So much more money to be made.\n\nStories are popping up about WHO discovering a highly virulent variant of HIV-1 circulating in the Netherlands. But don’t worry. It poses no risk to the general public. Then why are we seeing stories like this all over the news? We’ve learned to look out for such stories; the ones that MSM repeats across all platforms in an orchestrated fashion. It doesn’t happen by chance.\n\nArticles published outside of the accepted narrative are quickly discredited and discarded. One such article was published by a group of medical scientists in India in the medical science journal BioRXiv in January 2020, entitled “Uncanny similarity of unique inserts in the 2019-nCov spike protein to HIV-1 and Gag.”\n\nIn a highly controversial finding, they reported: “We found 4 insertions in the spike glycoprotein (S) which are unique to the 2019-nCoV and are not present in other coronaviruses. Importantly, amino acid residues in all 4 inserts have identity or similarity to those in the HIV-1 gp120 or HIV-Gag, all of which have identity/similarity to amino acid residues in key structural proteins of HIV-1 is unlikely to be fortuitous in nature.”\n\nThe article almost immediately was withdrawn after ‘disinformation experts’ recognized the Indian medical scientists were suggesting that COVID-19 was created by inserting the particular glycoprotein from the HIV-1 disease that involve patents held by or applied for by Fauci. Even more upsetting to disinformation operatives was the suggestion that the insertion of these 4 inserts into a SARS virus is not likely to occur in nature.\n\nThe clear suggestion was that COVID-19 was laboratory-created, possibly as a bioweapon, and that the creator of the virus used GP120 to do so, a glycoprotein from the HIV-1 1990s era that tied back to Fauci.”\n\nSuch “fringe” articles are overshadowed by mainstream articles nudging HIV into people’s consciousness and encouraging them to get tested for it.\n\nOne of the oddest examples I have seen was of UK MP Maria Caulfield who put up a video on Twitter during HIV Testing week of her getting an HIV test. She warns her constituents that “Viruses don’t discriminate – anyone can get HIV so I’d encourage anyone who hasn’t yet to find out your HIV status to help achieve our goal to end HIV transmission in England by 2030.”\n\nKeep in mind, the PCR test that was used to identify HIV was once again used for Covid—the very test that the inventor Kary Mullis warned us about! Fauci knew all of this. He knew in the 1980s that the tests were faulty. They all did back then, and they all do now. But they kept on insisting that we take these tests. I have written so much about tests, and I encourage people not to take them.\n\nBillions of people are now quite used to the process and think nothing of testing being a part of their daily lives.\n\nThese tests are bringing us full circle. Back to HIV. Back to AIDS. Back to testing for it.\n\nLong before Rogan arrived on the scene, a smear campaign was used against Kary Mullis, the crazy inventor of the PCR test. In Celia Farber’s interview, she describes:\n\n“At a recent community forum meeting in New York, a leading AIDS activist, when asked about whether Mullis shouldn’t be taken seriously, answered that he should not, for he is a ‘sexist pig.’ This was based on something Mullis allegedly said upon receiving the Nobel prize – that the prize would be “a great way to pick up babes.” I present Mullis with this logic.\n\n“‘They just want to show that I’m not politically correct,’ he says. ‘Well, I’m not. And the reason is that I already got my money from the Swedes, right? I’m done, I’m fixed. I’m a free agent, and it is the most wonderful feeling. There is nobody on the planet that can fuck with me. And I can say exactly what I feel about any issue and I’m going to do that.’”\n\nI admire Kary Mullis for his honesty. I admired Joe Rogan for his honesty. He should have taken a lesson from Mullis. But who these days has any hutzpah left?\n\nIn Fauci’s dystopian world of obey the Science or else, Fauci’s patience is running thin. He has been forgiving and understand for long enough. The anti-vaccination movement must be obliterated before it gains any more momentum.\n\nFauci recently told Stephanie Ruhle on MSNBC, that the movement was “very disturbing.”\n\nHe wants everyone to know that the size of the anti-vaccination movement in the US is being “underestimated.” And that he is being “villainized” and how stressful it is for him and his family.\n\nYes, yes, of course it’s been stressful for him and his family, but he assures us that his work is “too important” for him to back down. When Kentucky Senator Rand Paul dared question him, Fauci complained, “What happens when [Paul] gets out and accuses me of things that are completely untrue is that it kindles the crazies out there and I have threats upon my life, harassment of my family and my children with obscene phone calls because people are lying about me.”\n\nFauci fails to recall that Rand Paul is an actual victim of violence. He and his wife were attacked by a mob of Black Lives Matter protestors outside of the 2020 Republican National Convention. Mrs. Paul took issue with some media coverage saying activists “confronted” her and her husband when she retorted:\n\n“No @politico, we were not ‘confronted’ by protestors. We were circled by a hateful mob shouting vile expletives, preventing us from moving. Being swarmed by a threatening, screaming mob is violence.”\n\nFauci’s wife is frightened by the threats against her family and rightly so. I am sure, however, when talking about her safety concerns, neither she nor Fauci gets the irony:\n\n“I don’t understand the hate that people have, and the hate that leads them to do something that could hurt somebody or kill somebody. It sort of reduces my trust in humanity.”\n\nWhat could possibly lead anyone to hurt or kill somebody else? I don’t know.\n\nClearly, Dr. Fauci’s wife has her own stories she tells herself, just as her husband does, just as we all do. I am sure she believes that she and her husband are the victims here, not the millions of people whose lives have been destroyed by Fauci’s policies and the drugs he has forced upon them. The Faucis could not smile so happily at family gatherings otherwise.\n\nRecently Sen. Ron Johnson moderated a panel discussion, COVID-19: A Second Opinion, where “a group of world-renowned doctors and medical experts provide a different perspective on the global pandemic response, the current state of knowledge of early and hospital treatment, vaccine efficacy and safety, what went right, what went wrong, what should be done now, and what needs to be addressed long term.”\n• Substantial Data Showing Miscarriages increased by over 279% since the Covid-19 vaccine. The data was compared to a 5 year average of miscarriages.\n• Substantial Data Showing Cancers increased by over 296% over the 5 year average.\n• * An Extreme Increase in Neurological Issues since the vaccine (which would impact our pilots.) The Whistleblower DOD data shows a 1048% increase. Neurological Cases went from 82K a year to 863K in just 1 year…the year of the Covid-19 vaccine.\n• * Whistleblower data shows U.S. Military are being experimented on, injured, and in some cases possibly killed.\n• *Allegations of doctored Department of Defense data on the number of cases of myocarditis. Last August myocarditis cases were up 20+%. The number in Jan. 2022 now only shows a 2+% increase.\n• *DOD Project Salus says that the 71% of new cases were in the vaccinated and a 60% of hospitalizations comes from fully vaccinated people. Not the unvaccinated as Fauci stated on Television multiple times. (The DOD removed this data from their once public website when Renz first revealed it last year. We have screenshots at www.Renz-Law.com)\n\nJust as doctors and scientists spoke out in the 1980s about HIV-AIDS—that the cure was causing the disease, they are speaking out now.\n\nHow could Fauci and his policies be so vilified when his only motivation is “for the protection of the individual, of their family and of society?”\n\nOne of my favorite bad guys in literature is Count Fosco from Wilkie Collins’ masterpiece, The Woman in White. Fosco is an Italian spy who is out to steal the fortune of an innocent young woman. To all outward appearances, Fosco is charming, charismatic and so sensitive he wouldn’t hurt a fly. On the inside, he is a murdering monster who takes delight in controlling the lives of others, especially women.\n\nCount Fosco has a talent for “taming” wild creatures—he keeps a family of white mice and several birds that he has proudly gotten to do his bidding. He has “tamed” his wife, Madame Fosco, who used to be an independent, outspoken woman and who is now an obedient servant to her husband and bases her every opinion on his advice.\n\nCount Fosco really gets off on his power and so does Dr. Fauci.\n\nWe are Fauci’s mice. And yet, just like the devious Count, Fauci has managed to turn it all around so that he is the victim, and the mice who object to being put into cages and experimented on are his abusers.\n\nThere are heroes who are standing up. I have quoted from Members of the European Parliament Cristian Terhes, Christine Anderson and Ivan Vilibor Sincic.\n\nMislav Kolakusic, MEP of Serbia, is one more who speaks fearlessly, a warrior for freedom. In one speech, he talks directly to Ursula von der Leyen, President of the EU Commission in the European Parliament. Under Leyen, in April 2021, European Union signed what was the largest deal with Pfizer and BioNTech for 1.8 billion doses of their mRNA Covid vaccine.\n\n“In the last 80 years since Nazism, fundamental human rights have never been so severely violated. The right to freedom of movement, the right to work, the right to health care, the right to ban medical experiments conducted on more than 500 million people in the European Union. It is the right of every citizen to make decisions about their own health and about their own lives. We have trampled on several centuries of science and the medical profession. We are now introducing measures that have no end in sight.”\n\nI keep quoting these MEPs because they know what they are talking about. It wasn’t long ago that their countries were overrun by armies, they have experienced Nazism first-hand. The iron fist of communism.\n\nDr. Anthony Fauci and his Mafioso gang have built a medical empire of tyranny the likes of which the world has never known. It has no signs of collapsing. Quite the contrary. Yet within that empire there are countless decent, ordinary people who want freedom and will surely fight for it to the end. That is what the human spirit is all about. We cannot lose that spirit.\n\nI started with Agatha Christie and her wonderful book, Destination Unknown. And I will end with her. I love her books. No matter how wildly unbelievable the plots might be, it is easy to suspend one’s disbelief because she creates such believable worlds and such wonderfully colorful and eccentric characters. And she speaks of underlying truths that never change.\n\nKaren Hunt aka KH Mezek is an artist, writer and kickboxer who spent the last four years traveling the world to gain inspiration for her books. She started the first boxing club for girls in Luxor, Egypt and was living there when the “pandemic” struck. The experience opened her eyes to the lies of the media and inspired her to start writing about it. Subscribe to her Substack here.", "opengraph": {"image:width": "610", "image:height": "415", "locale": "en_US", "type": "article", "title": "Get Ready for It: The Return of AIDS (and a new vaccine) - 21st Century Wire", "description": "21WIRE + Karen Hunt | There's a 'super-mutant' HIV strain lurking and an HIV vaccine in trials. Why is this happening now?", "url": "https://21stcenturywire.com/2022/02/11/get-ready-for-it-the-return-of-aids-new-vaccine-moderna-fauci/", "site_name": "21st Century Wire", "article:publisher": "http://www.facebook.com/pages/21st-Century-Wire/182032255155419", "article:published_time": "2022-02-11T07:15:41+00:00", "article:modified_time": "2022-02-12T11:45:52+00:00", "image": "https://21stcenturywire.com/wp-content/uploads/2022/02/Dr-Anthony-Fauci-HIV_AIDS.jpeg", "image:type": "image/jpeg"}, "tags": ["AIDS", "immune system", "Moderna", "Pfizer", "Coronavirus", "Big Pharma", "COVID", "Vaccines", "variant", "COVID 19", "immune erosion", "virus", "HIV", "VAIDS", "fauci", "SARS-COV-2", "Karen Hunt"], "tweets": [], "movies": [], "links": ["https://commons.wikimedia.org/wiki/File:Dr._Anthony_S._Fauci_Delivers_Lecture-_30_Years_of_HIV-AIDS-_A_Personal_Journey_(5890993394).jpg", "https://21stcenturywire.com/2022/02/11/get-ready-for-it-the-return-of-aids-new-vaccine-moderna-fauci/", "https://abcnews.go.com/Health/moderna-launches-clinical-trial-hiv-vaccine-mrna-technology/story?id=82510807", "https://www.science.org/doi/10.1126/science.abk1688", "https://www.newscientist.com/article/2307232-vb-is-a-new-and-more-infectious-variant-of-hiv-but-it-is-treatable/", "https://www.dailymail.co.uk/health/article-10473495/New-HIV-strain-Netherlands-Highly-infectious-variant-makes-people-ill-twice-quick.html", "https://www.independent.co.uk/news/science/hiv-variant-netherlands-treatment-drugs-vb-b2007713.html", "https://americasfrontlinedoctors.org/news/post/vaccine-acquired-immune-deficiency-syndrome-vaids-we-should-anticipate-seeing-this-immune-erosion-more-widely/", "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3949410", "https://www.bbc.co.uk/news/world-australia-55269381", "https://www.opindia.com/2021/06/indian-scientists-had-found-unique-insertions-in-covid-19-virus-genome/", "https://www.youtube.com/watch?v=-a7nld57f2M", "https://21stcenturywire.com/2022/02/11/rip-luc-montagnier-im-outraged-by-the-fact-that-we-want-to-vaccinate-children/", "https://khmezek.substack.com/p/the-victimization-of-dr-fauci-and", "https://khmezek.substack.com/p/the-victimization-of-dr-fauci-and", "https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F961dfe44-3cc9-472d-b93f-fb4d2d8952cd_880x440.png", "https://www.timesofisrael.com/liveblog_entry/pfizer-says-it-raked-in-36800000000-in-covid-19-vaccine-sales/", "https://www.pharmaceutical-technology.com/features/top-selling-prescription-drugs/", "https://time.com/collection/100-most-influential-people-2020/5888309/anthony-fauci/", "https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F351d2f2d-97ae-4b9f-a810-5b842d2954d5_800x867.jpeg", "https://www.wsj.com/articles/the-mentor-who-made-dr-anthony-fauci-11587040520", "https://www.msn.com/en-us/news/world/joe-rogan-defends-missteps-says-listeners-know-he-is-trying-to-be-funny/ar-AATEaTF?ocid=msedgntp", "https://nypost.com/2022/02/05/spotify-has-removed-over-100-episodes-of-joe-rogans-podcast/", "https://www.msn.com/en-us/lifestyle/weddings/howard-stern-tells-joe-rogan-to-apologize-for-covid-19-misinformation-and-publicly-endorse-the-vaccine/ar-AATEcTB?ocid=msedgntp", "https://www.thealpenanews.com/uncategorized/2021/12/da-no-charges-for-cuomo-from-allegations-by-2-women/", "https://www.expandingawarenessrelations.com/history-is-repeating-itself-fauci-was-accused-of-genocide-almost-30-years-ago/#:~:text=Deadly%20Deception%20by%20Robert%20Willner%20%E2%80%9CTHERE%20IS%20NO,pharmaceutical%20industry%20and%20agencies%20of%20the%20U.S.%20Government.", "https://www.expandingawarenessrelations.com/history-is-repeating-itself-fauci-was-accused-of-genocide-almost-30-years-ago/#:~:text=Deadly%20Deception%20by%20Robert%20Willner%20%E2%80%9CTHERE%20IS%20NO,pharmaceutical%20industry%20and%20agencies%20of%20the%20U.S.%20Government.", "https://www.expandingawarenessrelations.com/history-is-repeating-itself-fauci-was-accused-of-genocide-almost-30-years-ago/#:~:text=Deadly%20Deception%20by%20Robert%20Willner%20%E2%80%9CTHERE%20IS%20NO,pharmaceutical%20industry%20and%20agencies%20of%20the%20U.S.%20Government.", "https://khmezek.substack.com/p/mercks-molnupiravir-vs-the-peoples", "https://www.spin.com/2015/10/aids-and-the-azt-scandal-spin-1989-feature-sins-of-omission/", "https://brightlightnews.com/list-of-vaccinated-high-level-athletes-who-collapsed-developed-heart-issues-or-died/", "http://virusmyth.com/aids/hiv/cfmullis.htm", "https://www.expandingawarenessrelations.com/history-is-repeating-itself-fauci-was-accused-of-genocide-almost-30-years-ago/#:~:text=Deadly%20Deception%20by%20Robert%20Willner%20%E2%80%9CTHERE%20IS%20NO,pharmaceutical%20industry%20and%20agencies%20of%20the%20U.S.%20Government.", "https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F45e02293-dcc2-419a-b555-1f8d465eae8a_1710x900.jpeg", "https://q107.com/news/8543179/moderna-hiv-vaccine-trial/", "https://www.science.org/doi/10.1126/science.abk1688", "https://www.biorxiv.org/content/10.1101/2020.01.30.927871v1.full", "https://www.organiclifestylemagazine.com/anthony-fauci-holds-patents-on-hiv-component-used-to-create-covid-19", "https://www.organiclifestylemagazine.com/anthony-fauci-holds-patents-on-hiv-component-used-to-create-covid-19", "https://twitter.com/mariacaulfield/status/1490740201488007175?s=20&t=zeuqN9VaUYsWhc1OZbIoxw", "https://twitter.com/mariacaulfield/status/1490740201488007175?s=20&t=zeuqN9VaUYsWhc1OZbIoxw", "https://khmezek.substack.com/p/the-nefarious-goal-behind-covid-testing", "https://www.msnbc.com/stephanie-ruhle/watch/covid-cases-will-start-to-turn-around-in-a-few-weeks-dr-anthony-fauci-131553349776", "https://www.washingtontimes.com/news/2020/aug/28/sen-rand-paul-threatened-by-protesters-after-the-r/", "https://rumble.com/vt62y6-covid-19-a-second-opinion.html", "http://www.renz-law.com/", "https://cdn.substack.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F4465889a-a4ca-416e-a83e-ae5617ac757f_432x432.jpeg", "https://twitter.com/CristianTerhes", "https://twitter.com/AndersonAfDMdEP", "https://twitter.com/SincicMEP", "https://twitter.com/mislavkolakusic", "https://twitter.com/vonderleyen", "https://khmezek.substack.com/p/the-victimization-of-dr-fauci-and", "https://21stcenturywire.com/tag/vaccines/", "https://21wire.tv/membership/plans/", "https://21w.co/shop-clive", "https://21w.co/shop-clive", "https://www.facebook.com/sharer.php?u=https%3A%2F%2F21stcenturywire.com%2F2022%2F02%2F11%2Fget-ready-for-it-the-return-of-aids-new-vaccine-moderna-fauci%2F", "https://twitter.com/intent/tweet?text=Get%20Ready%20for%20It%3A%20The%20Return%20of%20AIDS%20%28and%20a%20new%20vaccine%29&url=https://21stcenturywire.com/2022/02/11/get-ready-for-it-the-return-of-aids-new-vaccine-moderna-fauci/&via=21stCenturyWire"], "authors": ["Featured News"], "publish_date": "2022-02-11T07:15:41+00:00"}