{"result_id": "002039", "URL": "https://21stcenturywire.com/2021/11/28/new-study-vaccine-induced-cellular-ageing/", "timestamp": "2023-04-25 11:45:05 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://21stcenturywire.com/wp-content/themes/magazine/images/favicon.ico", "canonical": "https://21stcenturywire.com/2021/11/28/new-study-vaccine-induced-cellular-ageing/", "encoding": "UTF-8"}, "image": null, "domain": "21stcenturywire.com", "title": "Revealed: Vaccine Induced Cellular Ageing", "cleaned_text": "In prior articles we discussed the increased risk of Sars Cov2 infection after Covid vaccination and introduced concepts of immune tolerance and immune training. In this article I want to introduce the topic of cellular senescence, specifically as it relates to Covid vaccination.\n\nFrom Cellular Senescence: What, Why, and How we learn:\n\nCellular senescence is a process that results from a variety of stresses and leads to a state of irreversible growth arrest. Senescent cells accumulate during aging and have been implicated in promoting a variety of age-related diseases.\n\nCellular senescence may play an important role in tumor suppression, wound healing, and protection against tissue fibrosis; however, accumulating evidence that senescent cells may have harmful effects in vivo and may contribute to tissue remodeling, organismal aging, and many age-related diseases also exists\n\nEffectively, the process of senescence is synonymous with cell ageing, and for simplicity we can assume that inducing cellular senescence will promote accelerated ageing. With caveats, there appears to be a plus side to that, potential tumour suppression. Indeed, pharmaceutical research, is interested in that. But nothing is ever that simple, and as Gonzalez-Meljem et al. point out in Paracrine roles of cellular senescence in promoting tumourigenesis, it’s a double-edged sword:\n\nAlthough senescence has historically been considered a protective mechanism against tumourigenesis, the activities of senescent cells are increasingly being associated with age-related diseases, including cancer. An important feature of senescent cells is the secretion of a vast array of pro-inflammatory cytokines, chemokines, and growth factors collectively known as the senescence-associated secretory phenotype (SASP). Recent research has shown that SASP paracrine signalling can mediate several pro-tumourigenic effects, such as enhancing malignant phenotypes and promoting tumour initiation.\n\nWhat of the mechanisms and why are they important for us to Know? In Management of multicellular senescence and oxidative stress Haines & colleagues explain:\n\nThe first stage of cellular senescence is damage-induced cell cycle arrest, also called replicative senescence (RS). Typically, this growth arrest is triggered by stress-induced DNA damage responses (DDR), and also may be induced as a result of effects of telomere erosion – a phenomenon that produces stress-related metabolites 27.\n\nFrom the above we clearly see that certain stressors can cause damage to DNA that induce responses in the cell that can lead to the cell cycle arrest. Because DNA damage can lead to cancer, attempting to ‘switch it off’ (cycle arrest) may be a good idea. Of course, when cellular senescence happens on a larger scale, as stressors accrue over time, it is recognised as ageing.\n\nBut what of vaccination? In SARS-CoV-2 Spike Protein Induces Paracrine Senescence and Leukocyte Adhesion in Endothelial Cells Meyer & colleagues explore a relationship of cellular senescence and virus Sars Cov2 infected cells. Their findings are concerning.\n\nVirus-infected or spike-transfected human epithelial cells exhibited an increase in senescence, with a release of senescence-associated secretory phenotype (SASP)-related inflammatory molecules.\n\nThe key point is both Sars Cov2 virus infected cells and spike protein transfected cells induce cellular senescence.\n\nThat is troubling considering we are currently in a global campaign to vaccinate up to three or more doses to all ages, barring the very young, and all indications are they also will be vaccinated. And those vaccinations will be given repeatedly each year. All of which, per dose, produce in the order of billions or trillions of spike proteins. And remembering that animal studies demonstrated efficient distribution of the vaccine carriers (of the mRNA to produce those spike proteins) by varying amounts throughout the body, is a serious concern.\n\nBut let us continue with another paper released recently: Integrated Stochastic Model of DNA Damage Repair by Non-homologous End Joining and p53/p21- Mediated Early Senescence Signalling, where Yang & Mei demonstrated another part of the puzzle:\n\nTo determine how the spike protein inhibits both NHEJ and HR repair pathways, we analyzed the recruitment of BRCA1 and 53BP1, which are the key checkpoint proteins for HR and NHEJ repair, respectively. We found that the spike protein markedly inhibited both BRCA1 and 53BP1 foci formation (Figure 3 D–G). Together, these data show that the SARS–CoV–2 full–length spike protein inhibits DNA damage repair by hindering DNA repair protein recruitment.\n\nThat was a bench study using cell models that demonstrated full length spike protein was expressed in the nucleus of the cell. It is important to note that spike protein should not be found in the VIP compartment of the cell – the nucleus.\n\nOnce there, the spike protein prevented other proteins, for example BRCA1, from being recruited for NHEJ repair – preventing repair of damaged DNA. Now, the body has back-up mechanisms but we know from oncology that damage to key proteins such as BRCA1 lead to significant increase in cancer risk and shortened life-span.\n\nThe literature demonstrates that DNA damage left unrepaired or not repaired properly can also lead to cellular senescence.\n\n[P]ostmitotic cells rely on NHEJ for repairing DSBs. Failure to faithfully repair DSBs can result in point mutations, deletions and large genome rearrangements.\n\nWhere else could this be a serious problem? Mitosis.\n\nMitosis is cell division that is a vital part of repair, growth and embryo development.\n\nMitosis is a type of cellular division where the cell divides into two equal halves. This type of division is very important in fetal development as this forms the basis of embryology.\n\nWith nanoparticles up to 500nm being taken up by the placenta; and Covid19 vaccine lipid nanoparticles being in the order of 60-100nm, what of the risk to the developing foetus if it crosses the placenta and gains access to the developing foetus?\n\nWhat we are witnessing here is burgeoning evidence of spike protein induced DNA damage and cellular senescence, with all their related sequelae and consequences: dysfunctional cellular repair, cancer and premature ageing – death.\n\nThThe adage Sola dosis facit venenum or the dose makes the poison is a basic tenet in toxicology, and will be no different here with Covid vaccines. Apart from all the other serious effects that have already been demonstrated as a result of vaccination heavily implicating spike protein, repeatedly dosing human beings with Covid 19 vaccines, potentially inhibiting DNA repair and causing cellular senescence, with the attended risks of cancer and decreased life-span do not bear thinking about. In the case of the developing foetus, would that risk entail never having a life to span?\n\nAll the above is deeply concerning because the bench work is being done now revealing those serious problems; why wasn’t that basic science done before the release of the vaccines?\n\nAs we close this discussion on cellular senescence, analysis of the currently available all cause mortality reveals a death rate amongst the vaccinated twice that of the unvaccinated.\n\nI chose all cause rather than the Covid data due to the unreliability of Covid data. All cause mortality is much cleaner and less corruptible. As it is age standardised and expressed as per 100,000 it removes a lot of the normal confounders.\n\nThose data are very worrying coming from legitimate scientific work both from the laboratory and pure statistical analysis. Mechanisms are now being discovered that may help explain the paradoxical results of mass Covid 19 vaccination as partly evidenced by the all cause mortality data.\n\nOr more aptly Consectetuer est venenum – the dose is the poison.\n\nPLEASE HELP SUPPORT OUR INDEPENDENT MEDIA PLATFORM HERE", "opengraph": {"image:width": "610", "image:height": "407", "locale": "en_US", "type": "article", "title": "Revealed: Vaccine Induced Cellular Ageing - 21st Century Wire", "description": "Dr Mike Williams | The signs are worrying: mechanisms are now being discovered which could help explain the increasingly problematic results of the Covid-19 mass-vaccination campaign.", "url": "https://21stcenturywire.com/2021/11/28/new-study-vaccine-induced-cellular-ageing/", "site_name": "21st Century Wire", "article:publisher": "http://www.facebook.com/pages/21st-Century-Wire/182032255155419", "article:published_time": "2021-11-28T14:54:38+00:00", "article:modified_time": "2021-11-30T13:47:52+00:00", "image": "https://21stcenturywire.com/wp-content/uploads/2021/11/Covid-Vaccine-aging.jpg", "image:type": "image/jpeg"}, "tags": ["Coronavirus", "Big Pharma", "Vaccines", "social engineering", "COVID 19"], "tweets": [], "movies": [], "links": ["https://21stcenturywire.com/wp-content/uploads/2021/11/Covid-Vaccine-aging.jpg", "https://21stcenturywire.com/2021/11/28/new-study-vaccine-induced-cellular-ageing/", "https://www.ukcolumn.org/article/stabilising-the-code", "https://www.ukcolumn.org/article/what-explains-rising-cases-among-the-vaccinated", "https://pubmed.ncbi.nlm.nih.gov/28682291/", "https://pubmed.ncbi.nlm.nih.gov/17027159/", "https://pubmed.ncbi.nlm.nih.gov/29670296/", "https://onlinelibrary.wiley.com/doi/full/10.1111/jcmm.12074", "https://onlinelibrary.wiley.com/doi/full/10.1111/jcmm.12074#jcmm12074-bib-0027", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8354225/", "https://21stcenturywire.com/wp-content/uploads/2021/11/COVID-VACCINE-induced-aging.png", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8354225/", "https://regenerativemc.com/biodistribution-of-pfizer-covid-19-vaccine/", "https://www.docdroid.net/xq0Z8B0/pfizer-report-japanese-government-pdf#page=4", "https://www.mdpi.com/1999-4915/13/10/2056/htm", "https://www.mdpi.com/1999-4915/13/10/2056/htm#fig_body_display_viruses-13-02056-f003", "https://www.nature.com/articles/1210451", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4447392/", "https://www.sciencedirect.com/science/article/pii/B978012803309800029X", "https://www.reference.com/science/human-body-mitosis-occur-edada8b225631215", "https://www.pregnancy-baby-care.com/askquestion/3483/what-is-the-role-of-mitosis-in-fetal-development.html", "https://pubmed.ncbi.nlm.nih.gov/26526105/", "https://research-information.bris.ac.uk/en/publications/the-sars-cov-2-spike-protein-alters-human-cardiac-pericyte-functi", "https://www.uptodate.com/contents/covid-19-vaccine-induced-immune-thrombotic-thrombocytopenia-vitt#!", "https://www.ukcolumn.org/article/clotting-and-covid-science", "https://21stcenturywire.com/wp-content/uploads/2021/11/COVID-Vaccine-aging.png", "https://21stcenturywire.com/tag/vaccines", "https://21w.co/support", "https://21stcenturywire.com/ads/surfshark-vpn-for-in-content/", "https://www.facebook.com/sharer.php?u=https%3A%2F%2F21stcenturywire.com%2F2021%2F11%2F28%2Fnew-study-vaccine-induced-cellular-ageing%2F", "https://twitter.com/intent/tweet?text=Revealed%3A%20Vaccine%20Induced%20Cellular%20Ageing&url=https://21stcenturywire.com/2021/11/28/new-study-vaccine-induced-cellular-ageing/&via=21stCenturyWire"], "authors": ["NEWS WIRE"], "publish_date": "2021-11-28T14:54:38+00:00"}