{"result_id": "002018", "URL": "https://21stcenturywire.com/2021/12/01/more-professional-athletes-careers-ended-by-heart-damage-from-covid-vaccine/", "timestamp": "2023-04-25 11:44:52 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://21stcenturywire.com/wp-content/themes/magazine/images/favicon.ico", "canonical": "https://21stcenturywire.com/2021/12/01/more-professional-athletes-careers-ended-by-heart-damage-from-covid-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "21stcenturywire.com", "title": "More Professional Athletes' Careers Ended by Heart Damage From COVID Vaccine", "cleaned_text": "While health officials remain silent about COVID-19 injection reactions, the growing number of reports of adverse reactions cannot be silenced forever\n\nVeteran triathlete Antoine Méchin, 32, is also facing the potential end to his career after receiving Moderna COVID-19 injections and developing a pulmonary embolism\n\nIn another instance, 34-year-old Jeremy Chardy, a professional tennis player ranked 73rd in the world, suspended his season due to a severe adverse reaction to the COVID-19 shot\n\nA cardiologist diagnosed him with myocarditis and pericarditis, both recognized adverse effects linked to the shots\n\nAfter receiving his second dose of Pfizer’s COVID-19 injection, he experienced increased heart rate and a reduction in his breath-holding capacity\n\nAnother elite athlete has experienced devastating injuries after receiving COVID-19 shots.\n\nFlorian Dagoury is a world record holder in static breath-hold freediving. The freediver — from France and now based in Thailand — held his breath for an astonishing 10 minutes and 30 seconds.\n\nAfter receiving his second dose of Pfizer’s COVID-19 injection, he experienced increased heart rate and a reduction in his breath-holding capacity. A cardiologist diagnosed him with myocarditis, or inflammation of the heart muscle, and pericarditis, which is inflammation of the outer lining of the heart.1 Both are recognized adverse effects linked to the shots.\n\nWhile the U.S. Centers for Disease Control and Prevention continues to claim that these effects are “rare” after COVID-19 injections, as of November 10, 2021, 1,793 reports of myocarditis or pericarditis among people ages 12 to 29 years who received COVID-19 injections have been reported to the Vaccine Adverse Event Reporting System (VAERS).2\n\nWorld Record Holder May See End of His Career\n\nAs a result of the shots, Dagoury’s career may be over. He shared his experience with Pfizer’s COVID-19 shots in his own words on Instagram:3\n\n“Myocarditis, Pericarditis and Trivial Mitral regurgitation! Thank you Pfizer.Just want to share my annoying experience after vaccination and perhaps have some testimonials and similar stories around Freedivers. Did you get better? After my 2nd dose I noticed that my heart rate was way higher than normal and my breath hold capacities went down significantly. During sleep, I’m at 65-70bpm instead of 37-45bpm. During the day I’m now always over 100bpm instead of 65bpm, even when I sit down and relax. I once even reached 177bpm while having dinner with friends !!!! 10 days after my 2nd jab, I went to see a cardiologist and he told me it’s a common side effect of Pfizer vaccine, nothing to worry about, just rest it will pass. 40 days after 2nd jab, I had no progress so I went to see another cardiologist and got diagnosed with Myocarditis, Pericarditis and Trivial Mitral regurgitation! Which is basically an inflammation of the heart muscles caused by the immune system and some tiny leaks of blood from the valves that no longer close properly. I’m now struggling to reach 8min breath hold, 150m dyn and I even have a strong urge to breathe doing 40m dives. 30% decrease on my diving performance roughly. My first thought and recommendation to Freedivers around the world is to choose a vaccine which is done the old fashion way like Sputnik, Sinovac, Sinopharm etc…instead of those new mRNA vaccines.”\n\nIn another instance, 34-year-old Jeremy Chardy (pictured above), a professional tennis player ranked 73rd in the world, suspended his season due to a severe adverse reaction to the COVID-19 shot, which left him unable to engage in intense activity. Speaking with The COVID World, Chardy said:4\n\n“Since I had my vaccine (between the Olympics and the US Open), I have a problem. I am struggling. I can’t train, I can’t play. In my head, it’s difficult because I don’t know how long it will last. For now, my season is over and I don’t know when it will resume. It’s frustrating because I started the year really well. I was playing very good and then I went to the Olympic Games where I also felt very good. It’s frustrating, especially that I don’t have ten years left to play. I regret having the vaccine, but I could not have known that this would happen. I’ll be 35 in February so right now I might be a bit negative but this is the first time I have ever thought that this season might be my last. I don’t want to think about it … it’s difficult because I was having fun and I want to play longer.”\n\nTriathlete’s Career May Be Over Due to COVID-19 Injections\n\nVeteran triathlete Antoine Méchin, 32 (pictured above), is also facing the potential end to his career after receiving Moderna COVID-19 injections. After his second dose, he began to experience shortness of breath and low-back pain, which turned out to be a pulmonary embolism.\n\nThe symptoms, which included breathing problems and arm pain, started after the first dose, but doctors brushed off his shortness of breath as related to stress and fatigue. About a month after his second dose, shortness of breath and body pain returned. Only after testing at a sports clinic was the pulmonary embolism revealed. Méchin said:5\n\nKyle Warner is another example of healthy people in peak physical condition being harmed by COVID-19 injections. Warner, a 29-year-old professional mountain bike racer, got his second dose of Pfizer’s COVID-19 shot in June 2021. He suffered a reaction so severe that, as of October, he was still spending days in bed, easily overwhelmed by too much mental or physical exertion.6\n\nWithin seconds of the second dose, Warner experienced a metallic saline taste in his mouth, which can be an indication that the shot went into a vessel instead of the muscle.7 About two weeks later he started having strange reactions in his heart. Throughout the day, he started experiencing periods of accelerated heart rate.\n\nAs is often the case, an ER doctor completely brushed off his symptoms, telling him that he’s not having a reaction to the shot but instead was having an anxiety attack. Days after being sent home from the ER — and still experiencing heart problems, including cramping and burning — Warner went to a different hospital, where he was diagnosed with pericarditis along with postural orthostatic tachycardia syndrome (POTS) and reactive arthritis.\n\nPOTS is a blood circulation disorder that affects the autonomic nervous system and can be triggered by injections, including mRNA COVID-19 shots.8 One of the key symptoms of POTS is a significant increase in heart rate when a person stands up, and the elevated heart rate remains elevated for a longer than normal period. Fatigue, nausea, dizziness, heart palpitations and exercise intolerance can also occur.\n\nWhile his symptoms of pericarditis have cleared, he’s still struggling with the symptoms of reactive arthritis and POTS, which can last for 12 to 18 months or more. And Warner, being very fit and accustomed to listening to his body, caught the problem early — many others may not.\n\n“I believe where there is risk, there needs to be choice,” he said.9 But right now, people are being misled. “People are being coerced into making a decision based on lack of information versus being convinced of a decision based on total information transparency.”10\n\nMyocarditis and pericarditis cause symptoms such as chest pain, shortness of breath and a fluttering or pounding heart. Cases have occurred most often after mRNA COVID-19 injections (Pfizer-BioNTech or Moderna), particularly in male adolescents and young adults, according to the CDC. Further, myocarditis occurs more often after the second injection, usually within a week.11\n\nA large study from Israel12 revealed that the Pfizer COVID-19 mRNA jab is associated with a threefold increased risk of myocarditis,13 leading to the condition at a rate of one to five events per 100,000 persons.14 Other elevated risks were also identified following the COVID jab, including lymphadenopathy (swollen lymph nodes), appendicitis and herpes zoster infection.15\n\nThe real-world case-control study from Israel included a mean of 884,828 people, aged 16 years and older, in each of two groups: one vaccinated and one control.16 The increased risk of myocarditis was clear, with researchers noting:17\n\nWhen myocarditis occurs, it reduces your heart’s ability to pump and can cause rapid or abnormal heart rhythms that can be deadly. In severe cases, myocarditis can cause permanent damage to the heart muscle and lead to heart failure, heart attack, stroke and sudden cardiac death.18\n\nIn August 2021, New Zealand reported the death of a woman following Pfizer’s COVID-19 jab, which they believe was due to vaccine-induced myocarditis.19 Another devastating report in VAERS states that a 15-year-old boy from Colorado, with no preexisting conditions or allergies, died from cardiac failure two days after receiving Pfizer’s COVID-19 vaccine.20\n\nUnlike in the U.S., where the CDC has recommended Pfizer’s COVID-19 shot for children 5 years and up, the U.K. is taking a more cautious and sensible approach. Due to myocarditis risks in youth, Britain’s Joint Committee on Vaccination and Immunization (JCVI) recommended against COVID-9 injections for healthy 12- to 15-year-olds.\n\nWei Shen Lim, COVID-19 chair for JCVI, stated, “The margin of benefit is considered too small to support universal Covid-19 vaccination for this age group at this time.”21\n\nCOVID-19 Injection Victims Need To Be Heard\n\nWhile health officials remain silent about COVID-19 injection reactions, the growing number of reports of adverse reactions cannot be silenced forever. Websites like C19 Vax Reactions,22 started by former Green Bay Packers offensive lineman Ken Ruettgers, whose wife Sheryl suffered a severe neurological reaction to Moderna’s COVID-19 shot, exist online for people to share their stories.\n\nThere you can read over 500 real testimonies of adverse reactions to the shots and view dozens of videos detailing individuals’ reactions. The Real, Not Rare website has also collected dozens of stories from people who have been injured by COVID-19 shots,23 and there’s a good chance you know someone personally who’s been injured by the injections as well.\n\nIt’s important that these voices are heard, so if you or a loved one has been injured by a COVID-19 injection, please share your story with us and encourage others you know who have a story to share theirs as well.\n\n***\n\n This article was originally published at Mercola.com.\n\nAuthor Dr. Joseph Mercola is the founder of Mercola.com. An osteopathic physician, best-selling author and recipient of multiple awards in the field of natural health, his primary vision is to change the modern health paradigm by providing people with a valuable resource to help them take control of their health. Among his qualifications, he is a licensed physician and surgeon in State of Illinois.\n\nPLEASE HELP SUPPORT OUR INDEPENDENT MEDIA PLATFORM HERE", "opengraph": {"image:width": "610", "image:height": "406", "locale": "en_US", "type": "article", "title": "More Professional Athletes' Careers Ended by Heart Damage From COVID Vaccine - 21st Century Wire", "description": "Dr Joseph Mercola | The casualties continue to mount. At what point will the penny finally drop?", "url": "https://21stcenturywire.com/2021/12/01/more-professional-athletes-careers-ended-by-heart-damage-from-covid-vaccine/", "site_name": "21st Century Wire", "article:publisher": "http://www.facebook.com/pages/21st-Century-Wire/182032255155419", "article:published_time": "2021-12-01T14:42:22+00:00", "article:modified_time": "2021-12-02T18:24:54+00:00", "image": "https://21stcenturywire.com/wp-content/uploads/2021/12/ad67df49b4-e1638369596434.jpeg", "image:type": "image/jpeg"}, "tags": ["Moderna", "Pfizer", "Tennis", "Big Pharma", "Vaccines", "COVID 19", "mRNA", "sports"], "tweets": [], "movies": [], "links": ["https://21stcenturywire.com/wp-content/uploads/2021/12/ad67df49b4.jpeg", "https://news.in-24.com/news/258750.html", "https://21stcenturywire.com/wp-content/uploads/2021/12/1024px-Chardy_RG19_16_48199372621.jpeg", "https://21stcenturywire.com/wp-content/uploads/2021/12/Antoine-Mechin.jpeg", "https://21stcenturywire.com/wp-content/uploads/2021/12/Kyle-Warner_podcast.jpeg", "https://21stcenturywire.com/ads/surfshark-vpn-for-in-content/", "https://www.mercola.com/", "https://www.mercola.com/", "https://21stcenturywire.com/tag/vaccines", "https://21w.co/support"], "authors": ["NEWS WIRE"], "publish_date": "2021-12-01T14:42:22+00:00"}