{"result_id": "002049", "URL": "https://21stcenturywire.com/2021/12/09/petty-tyrants-vaccine-mandates-a-brief-history-lesson/", "timestamp": "2023-04-25 11:45:09 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://21stcenturywire.com/wp-content/themes/magazine/images/favicon.ico", "canonical": "https://21stcenturywire.com/2021/12/09/petty-tyrants-vaccine-mandates-a-brief-history-lesson/", "encoding": "UTF-8"}, "image": null, "domain": "21stcenturywire.com", "title": "Petty Tyrants & Vaccine Mandates: A Brief History Lesson", "cleaned_text": "Yesterday, the US Senate voted to roll-back President Biden’s authoritarian executive vaccine and testing mandate for businesses. The move may eventually force a vote in the House – which will place considerable pressure on Congressional Democrats to break ranks with Biden over his highly unpopular decree. Politically, this is shaping up to be Biden and the Democrats’ biggest defeat yet, which doesn’t bode well for the crucial 2022 mid term elections.\n\n“The United States of America is a free country,” said Senate GOP Leader Mitch McConnell, R-Ky. “The federal government elites in Washington cannot micromanage citizens’ personal choices without a legitimate basis in law and the Constitution … President Biden’s absurd private-sector vaccine mandate is blatant overreach.”\n\nBiden’s executive power-play has already been blocked by multiple high court rulings following a wave of litigation by large employers and states. If the issue eventually goes to the Supreme Court, which is very likely now, most legal scholars are in agreement that the vaccine mandate will be defeated – which would be a devastating precedent for Biden and the Democrats, but also for Big Pharma and the pandemic industrial complex who have recorded record profits ever since the hysteria was unleashed in February 2020.\n\nA brief look at history shows just how thin the legal ice is underneath Biden’s executive overreach.\n\nVaccine mandates are nothing new. Nor are petty tyrants. Nor is Joe Biden the first person to try to use the police powers of the state to compel Americans to violate their own personal convictions and take a vaccine they find to be unnecessary if not dangerous.\n\nMore than 125 years ago, a Brooklyn, N.Y., commissioner of health named Z. Taylor Emery demanded that two men who worked in delivery services be locked up until they “submitted to vaccination” for smallpox. William Smith and his employee Thomas Cummings had no known exposure to smallpox, but they were nonetheless put into a weeks-long quarantine lockdown by Emery, whom they promptly sued for false imprisonment.\n\nThe facts of this 1894 case (read here, starting at original page 325) provide a fascinating mirror in microcosm of what we as a nation are undergoing today. Not too many months ago, President Biden and Dr. Anthony Fauci agreed that vaccine mandates were immoral and unconstitutional, but since then they apparently have realized that medical mandates are also the easiest way to corral and control the American public into obedience.\n\nForget that vaccination doesn’t protect you from becoming ill from COVID-19. Forget that CDC data shows the vaccine itself has caused thousands of deaths and countless injuries. Forget that the latest variant of the virus — the so-called omicron strain — actually appears to be considerably less severe than the prior versions. (Symptoms are about equivalent to that other famous virus, the common cold!) None of that matters as long as free people can be trained to line up dutifully like Pavlov’s dogs every time the government rolls out a new booster shot. Woof! Woof!\n\nFortunately, after a month of victories in lower courts, the proponents of liberty and specifically medical autonomy have the upper hand. The Biden administration’s arbitrary mandates have all been temporarily halted, but as the story of Dr. Emery’s crusade against smallpox warns us, what one court forbids, another will happily allow…\n\nPLEASE HELP SUPPORT OUR INDEPENDENT MEDIA PLATFORM HERE", "opengraph": {"image:width": "610", "image:height": "406", "locale": "en_US", "type": "article", "title": "Petty Tyrants & Vaccine Mandates: A Brief History Lesson - 21st Century Wire", "description": "21WIRE + Real Clear Politics | A brief look at history shows just how thin the legal ice is underneath Biden's executive overreach.", "url": "https://21stcenturywire.com/2021/12/09/petty-tyrants-vaccine-mandates-a-brief-history-lesson/", "site_name": "21st Century Wire", "article:publisher": "http://www.facebook.com/pages/21st-Century-Wire/182032255155419", "article:published_time": "2021-12-09T12:54:24+00:00", "article:modified_time": "2021-12-09T18:40:54+00:00", "image": "https://21stcenturywire.com/wp-content/uploads/2021/12/biden-vaccine-mandates-osha.png", "image:type": "image/png"}, "tags": ["Vaccine Passports", "Coronavirus", "Vaccines", "COVID 19", "Joe Biden", "Smallpox"], "tweets": [], "movies": [], "links": ["https://eu.usatoday.com/story/news/politics/2021/12/08/bidens-covid-vaccine-mandate-blocked-senate-now-heads-house/6423221001/", "https://eu.usatoday.com/story/news/politics/2021/12/08/bidens-covid-vaccine-mandate-blocked-senate-now-heads-house/6423221001/", "https://21stcenturywire.com/ads/surfshark-vpn-for-in-content/", "https://www.nytimes.com/2021/11/16/us/politics/biden-vaccine-mandate-osha-ohio.html", "https://21stcenturywire.com/2020/12/31/covid-19-the-emergence-of-the-pandemic-industrial-complex/", "https://www.realclearpolitics.com/articles/2021/12/06/a_history_lesson_about_petty_tyrants__vaccine_mandates_146837.html", "https://books.google.com/books/download/Report.pdf?id=F_MTAAAAIAAJ&hl=en&capid=AFLRE7391rwkUaw4WfMYsmrVD2qiJsVE9EXHFcG21fLRmomRBayTMyyEey7stB-EQe9g9uZ66pIAWg_qY_Z_U4sGZjQOhl0XPQ&continue=https://books.google.com/books/download/Report.pdf%3Fid%3DF_MTAAAAIAAJ%26output%3Dpdf%26hl%3Den", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/adverse-events.html", "https://www.realclearpolitics.com/articles/2021/12/06/a_history_lesson_about_petty_tyrants__vaccine_mandates_146837.html", "https://21stcenturywire.com/tag/vaccines", "https://21w.co/support", "https://www.facebook.com/sharer.php?u=https%3A%2F%2F21stcenturywire.com%2F2021%2F12%2F09%2Fpetty-tyrants-vaccine-mandates-a-brief-history-lesson%2F", "https://twitter.com/intent/tweet?text=Petty%20Tyrants%20%26%20Vaccine%20Mandates%3A%20A%20Brief%20History%20Lesson&url=https://21stcenturywire.com/2021/12/09/petty-tyrants-vaccine-mandates-a-brief-history-lesson/&via=21stCenturyWire"], "authors": ["NEWS WIRE"], "publish_date": "2021-12-09T12:54:24+00:00"}