{"result_id": "002016", "URL": "https://21stcenturywire.com/2022/01/20/bmj-pharma-must-release-of-all-vaccine-and-treatment-data-immediately/", "timestamp": "2023-04-25 11:44:51 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://21stcenturywire.com/wp-content/themes/magazine/images/favicon.ico", "canonical": "https://21stcenturywire.com/2022/01/20/bmj-pharma-must-release-of-all-vaccine-and-treatment-data-immediately/", "encoding": "UTF-8"}, "image": null, "domain": "21stcenturywire.com", "title": "BMJ: 'Pharma Must Release All Vaccine and Treatment Data Immediately'", "cleaned_text": "The British Medical Journal (BMJ), one of the world’s oldest and most prestigious medical journals, has now called for the full and immediate release of all data relating to the COVID-19 experimental vaccines and treatments. According to the BMJ, ‘Data should be fully and immediately available for public scrutiny.’\n\n \n\n Will the pharmaceutical cartel members Pfizer, AstraZeneca, Moderna and others, along with their allies in government regulatory bodies like the FDA comply with this crucial request?\n\nIn the pages of The BMJ a decade ago, in the middle of a different pandemic, it came to light that governments around the world had spent billions stockpiling antivirals for influenza that had not been shown to reduce the risk of complications, hospital admissions, or death. The majority of trials that underpinned regulatory approval and government stockpiling of oseltamivir (Tamiflu) were sponsored by the manufacturer; most were unpublished, those that were published were ghostwritten by writers paid by the manufacturer, the people listed as principal authors lacked access to the raw data, and academics who requested access to the data for independent analysis were denied.1234\n\nThe Tamiflu saga heralded a decade of unprecedented attention to the importance of sharing clinical trial data.56 Public battles for drug company data,78 transparency campaigns with thousands of signatures,910 strengthened journal data sharing requirements,1112 explicit commitments from companies to share data,13 new data access website portals,8 and landmark transparency policies from medicines regulators1415 all promised a new era in data transparency.\n\nProgress was made, but clearly not enough. The errors of the last pandemic are being repeated. Memories are short. Today, despite the global rollout of covid-19 vaccines and treatments, the anonymised participant level data underlying the trials for these new products remain inaccessible to doctors, researchers, and the public—and are likely to remain that way for years to come.16 This is morally indefensible for all trials, but especially for those involving major public health interventions.\n\nPfizer’s pivotal covid vaccine trial was funded by the company and designed, run, analysed, and authored by Pfizer employees. The company and the contract research organisations that carried out the trial hold all the data.17 And Pfizer has indicated that it will not begin entertaining requests for trial data until May 2025, 24 months after the primary study completion date, which is listed on ClinicalTrials.gov as 15 May 2023 (NCT04368728). \n\n Clive de Carle's Natural Health essentials of the finest quality, including vitamin & mineral supplements here. The lack of access to data is consistent across vaccine manufacturers.16 Moderna says data “may be available … with publication of the final study results in 2022.”18 Datasets will be available “upon request and subject to review once the trial is complete,” which has an estimated primary completion date of 27 October 2022 (NCT04470427). As of 31 December 2021, AstraZeneca may be ready to entertain requests for data from several of its large phase III trials.19 But actually obtaining data could be slow going. As its website explains, “timelines vary per request and can take up to a year upon full submission of the request.”20 Underlying data for covid-19 therapeutics are similarly hard to find. Published reports of Regeneron’s phase III trial of its monoclonal antibody therapy REGEN-COV flatly state that participant level data will not be made available to others.21 Should the drug be approved (and not just emergency authorised), sharing “will be considered.” For remdesivir, the US National Institutes of Health, which funded the trial, created a new portal to share data (https://accessclinicaldata.niaid.nih.gov/), but the dataset on offer is limited. An accompanying document explains: “The longitudinal data set only contains a small subset of the protocol and statistical analysis plan objectives.” We are left with publications but no access to the underlying data on reasonable request. This is worrying for trial participants, researchers, clinicians, journal editors, policy makers, and the public. The journals that have published these primary studies may argue that they faced an awkward dilemma, caught between making the summary findings available quickly and upholding the best ethical values that support timely access to underlying data. In our view, there is no dilemma; the anonymised individual participant data from clinical trials must be made available for independent scrutiny. Journal editors, systematic reviewers, and the writers of clinical practice guideline generally obtain little beyond a journal publication, but regulatory agencies receive far more granular data as part of the regulatory review process. In the words of the European Medicine Agency’s former executive director and senior medical officer, “relying solely on the publications of clinical trials in scientific journals as the basis of healthcare decisions is not a good idea … Drug regulators have been aware of this limitation for a long time and routinely obtain and assess the full documentation (rather than just publications).”22 Among regulators, the US Food and Drug Administration is believed to receive the most raw data but does not proactively release them. After a freedom of information request to the agency for Pfizer’s vaccine data, the FDA offered to release 500 pages a month, a process that would take decades to complete, arguing in court that publicly releasing data was slow owing to the need to first redact sensitive information.23 This month, however, a judge rejected the FDA’s offer and ordered the data be released at a rate of 55 000 pages a month. The data are to be made available on the requesting organisation’s website (phmpt.org). In releasing thousands of pages of clinical trial documents, Health Canada and the EMA have also provided a degree of transparency that deserves acknowledgment.2425 Until recently, however, the data remained of limited utility, with copious redactions aimed at protecting trial blinding. But study reports with fewer redactions have been available since September 2021,2425 and missing appendices may be accessible through freedom of information requests. Even so, anyone looking for participant level datasets may be disappointed because Health Canada and the EMA do not receive or analyse these data, and it remains to be seen how the FDA responds to the court order. Moreover, the FDA is producing data only for Pfizer’s vaccine; other manufacturers’ data cannot be requested until the vaccines are approved, which the Moderna and Johnson & Johnson vaccines are not. Industry, which holds the raw data, is not legally required to honour requests for access from independent researchers. Like the FDA, and unlike its Canadian and European counterparts, the UK’s regulator—the Medicines and Healthcare Products Regulatory Agency—does not proactively release clinical trial documents, and it has also stopped posting information released in response to freedom of information requests on its website.26 As well as access to the underlying data, transparent decision making is essential. Regulators and public health bodies could release details 27 such as why vaccine trials were not designed to test efficacy against infection and spread of SARS-CoV-2.28 Had regulators insisted on this outcome, countries would have learnt sooner about the effect of vaccines on transmission and been able to plan accordingly.29 Big pharma is the least trusted industry.30 At least three of the many companies making covid-19 vaccines have past criminal and civil settlements costing them billions of dollars.31 One pleaded guilty to fraud.31 Other companies have no pre-covid track record. Now the covid pandemic has minted many new pharma billionaires 32, and vaccine manufacturers have reported tens of billions in revenue… Continue this article at the BMJ PLEASE HELP SUPPORT OUR INDEPENDENT MEDIA PLATFORM HERE", "opengraph": {"image:width": "610", "image:height": "412", "locale": "en_US", "type": "article", "title": "BMJ: 'Pharma Must Release All Vaccine and Treatment Data Immediately' - 21st Century Wire", "description": "21WIRE + BMJ | The lack of access to data is consistent across vaccine manufacturers - indicating fraud and a criminal cover-up.", "url": "https://21stcenturywire.com/2022/01/20/bmj-pharma-must-release-of-all-vaccine-and-treatment-data-immediately/", "site_name": "21st Century Wire", "article:publisher": "http://www.facebook.com/pages/21st-Century-Wire/182032255155419", "article:published_time": "2022-01-20T20:19:08+00:00", "article:modified_time": "2022-01-21T15:35:58+00:00", "image": "https://21stcenturywire.com/wp-content/uploads/2021/10/FDA-mRNA-Pharma-Lobby.jpg", "image:type": "image/jpeg"}, "tags": ["Moderna", "Pfizer", "Big Pharma", "Vaccines", "COVID 19", "AstraZeneca", "Tamiflu"], "tweets": [], "movies": [], "links": ["https://www.bmj.com/content/376/bmj.o102", "https://www.bmj.com/content/376/bmj.o102#ref-1", "https://www.bmj.com/content/376/bmj.o102#ref-2", "https://www.bmj.com/content/376/bmj.o102#ref-3", "https://www.bmj.com/content/376/bmj.o102#ref-4", "https://www.bmj.com/content/376/bmj.o102#ref-5", "https://www.bmj.com/content/376/bmj.o102#ref-6", "https://www.bmj.com/content/376/bmj.o102#ref-7", "https://www.bmj.com/content/376/bmj.o102#ref-8", "https://www.bmj.com/content/376/bmj.o102#ref-9", "https://www.bmj.com/content/376/bmj.o102#ref-10", "https://www.bmj.com/content/376/bmj.o102#ref-11", "https://www.bmj.com/content/376/bmj.o102#ref-12", "https://www.bmj.com/content/376/bmj.o102#ref-13", "https://www.bmj.com/content/376/bmj.o102#ref-8", "https://www.bmj.com/content/376/bmj.o102#ref-14", "https://www.bmj.com/content/376/bmj.o102#ref-15", "https://www.bmj.com/content/376/bmj.o102#ref-16", "https://www.bmj.com/content/376/bmj.o102#ref-17", "https://www.bmj.com/lookup/external-ref?link_type=CLINTRIALGOV&access_num=NCT04368728&atom=%2Fbmj%2F376%2Fbmj.o102.atom", "https://21w.co/shop-clive", "https://21w.co/shop-clive", "https://www.bmj.com/content/376/bmj.o102#ref-16", "https://www.bmj.com/content/376/bmj.o102#ref-18", "https://www.bmj.com/lookup/external-ref?link_type=CLINTRIALGOV&access_num=NCT04470427&atom=%2Fbmj%2F376%2Fbmj.o102.atom", "https://www.bmj.com/content/376/bmj.o102#ref-19", "https://www.bmj.com/content/376/bmj.o102#ref-20", "https://www.bmj.com/content/376/bmj.o102#ref-21", "https://accessclinicaldata.niaid.nih.gov/", "https://www.bmj.com/content/376/bmj.o102#ref-22", "https://www.bmj.com/content/376/bmj.o102#ref-23", "about:blank", "https://www.bmj.com/content/376/bmj.o102#ref-24", "https://www.bmj.com/content/376/bmj.o102#ref-25", "https://www.bmj.com/content/376/bmj.o102#ref-24", "https://www.bmj.com/content/376/bmj.o102#ref-25", "https://www.bmj.com/content/376/bmj.o102#ref-26", "https://www.bmj.com/content/376/bmj.o102#ref-27", "https://www.bmj.com/content/376/bmj.o102#ref-28", "https://www.bmj.com/content/376/bmj.o102#ref-29", "https://www.bmj.com/content/376/bmj.o102#ref-30", "https://www.bmj.com/content/376/bmj.o102#ref-31", "https://www.bmj.com/content/376/bmj.o102#ref-31", "https://www.bmj.com/content/376/bmj.o102#ref-32", "https://www.bmj.com/content/376/bmj.o102", "https://21stcenturywire.com/tag/vaccines", "https://21w.co/support", "https://t.me/My21wire", "https://21stcenturywire.com/ads/surfshark-vpn-for-in-content/", "https://www.facebook.com/sharer.php?u=https%3A%2F%2F21stcenturywire.com%2F2022%2F01%2F20%2Fbmj-pharma-must-release-of-all-vaccine-and-treatment-data-immediately%2F", "https://twitter.com/intent/tweet?text=BMJ%3A%20%E2%80%98Pharma%20Must%20Release%20All%20Vaccine%20and%20Treatment%20Data%20Immediately%E2%80%99&url=https://21stcenturywire.com/2022/01/20/bmj-pharma-must-release-of-all-vaccine-and-treatment-data-immediately/&via=21stCenturyWire"], "authors": ["NEWS WIRE"], "publish_date": "2022-01-20T20:19:08+00:00"}