{"result_id": "002023", "URL": "https://21stcenturywire.com/2021/12/23/confirmed-uk-govt-already-planning-push-for-fourth-covid-jab-in-new-year/", "timestamp": "2023-04-25 11:44:54 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://21stcenturywire.com/wp-content/themes/magazine/images/favicon.ico", "canonical": "https://21stcenturywire.com/2021/12/23/confirmed-uk-govt-already-planning-push-for-fourth-covid-jab-in-new-year/", "encoding": "UTF-8"}, "image": null, "domain": "21stcenturywire.com", "title": "CONFIRMED: UK Gov't Already Planning for FOURTH Covid Jab in New Year", "cleaned_text": "It’s all but confirmed. Governments are now revealing their true objective: endless boosters for an endless pandemic.\n\nThis week the UK government admitted they are already in the planning stage for the next round of experimental Covid booster injections. Public Health mavens are citing the alleged “Omicron” viral invasion, as well as aggressive vaccine policies in Israel and Germany, as a pretext to move ahead with jab number four.\n\nIsrael announced that citizens over 60 yrs-old and healthcare workers are now eligible for a fourth Covid jab. “The world will follow in our footsteps,” said Israeli Prime Minister Naftali Bennett in a recent tweet.\n\nIn Germany, health minister Karl Lauterbach has warned a fourth dose will be necessary to ‘tackle the Omicron variant.’ German officials have also shortened the period between a second Covid shot and a booster to just three months – down from six.\n\nBritain is considering the rollout of a fourth round of vaccinations against Covid-19 after both Israel and Germany gave the green light to a second set of boosters. Experts on the Joint Committee on Vaccination and Immunisation (JCVI) will examine evidence on levels of immunity given by three jabs as well as data on hospitalisations for the new omicron variant before making any decision on a fourth.\n\nThe government’s new booster push will also be targeting children, including a modified multiple injection schedule for ‘vulnerable’ children:\n\nAs it turns out, the government have already been quietly testing their four jab policy, initially to cater for those whom the state deems as having a ‘weakened immune system’:\n\nIf approved, the government can roll-out their second booster drive immediately, as the only stipulation is that the fourth jab be given just months after that last booster. The first boosters were given in mid September 2021.\n\nAnother very interesting development in all this, is that after a year of pretending that the fake Relative Risk Reduction (RRR) number being touted by pharmaceutical firms (ie. “our vaccine was 95% effective in clinical trials”) as some sort of legitimate measure of actual vaccine effectiveness, the government are sheepishly admitting that statistically the vaccines provide absolutely no benefit for young children. In a shrewd damage control move, the JCVI have suddenly conceded that vaccinating 1 million children between 5 and 11 yrs-old would only prevent two children from ending up in ICU care. This bombshell admission indicates that in this instance at least, the government are relying on a more accurate Absolute Risk Reduction (ARR) metric, instead of the fraudulent RRR figure routinely peddled by drug cartel members Pfizer, AstraZeneca, Moderna and others, and dutifully repeated by government and media. The Telegraph reports:\n\nMoreover, the JCVI’s tacit admission that the vaccines do nothing for children is a signal that the state may be hedging against the legal and political blowback which is sure to come following a reckless government attempt to turn their entire population into a giant GMO pharmaceutical clinical experiment by rushing the experimental injection through under an ’emergency use’ license. The increased risk of a myocarditis heart condition and other vaccine injuries in children shows that the children may be at a higher risk of a vaccine event than from Covid itself – a horrific irony which seems to be lost on mainstream media and censorship departments at Twitter and Facebook. Clearly, the public were lied to from day one about nearly ever major aspect of the crisis.\n\nAll of this amounts to a stunning development which shows that the government may be trying to compensate for its inability to implement the draconian vaccine passport medical apartheid laws currently in place in major European countries, by instead fast-tracking a new round of experimental corporate injections.\n\nStill, few are asking the fundamental question: if you need FOUR vaccines in a year, then doesn’t that mean the ‘vaccine’ isn’t very effective at all?\n\nThe further their agenda presses forward, the clearer it seems that the push for endless vaccines is really designed to preserve the need for Vaccine Passports as a tool of social and political control.\n\nUK officials have been using the “Omicron” variant brand to sell the current round of boosters on behalf of the pharmaceutical industry, despite that fact that scientists and medical experts have been saying how weak the alleged variant is.\n\nOfficials in Westminster are claiming that they haven’t made a decision yet, and that they are still waiting for a fuller picture on ‘The Science.’\n\nThe recent visit to government officials by vaccine mogul Bill Gates should indicate that there is tremendous pressure from the pharmaceutical drug cartels to push the next round of experimental vaccines through, as drug firms are certainly keen to record their guaranteed sales for the next financial quarter. Every government mandate or campaign translates into billions in guaranteed profit for the vaccine industry.\n\nPLEASE HELP SUPPORT OUR INDEPENDENT MEDIA PLATFORM HERE", "opengraph": {"image:width": "610", "image:height": "405", "locale": "en_US", "type": "article", "title": "CONFIRMED: UK Gov't Already Planning for FOURTH Covid Jab in New Year - 21st Century Wire", "description": "21WIRE | The governments are now revealing their true objective: endless boosters for an endless pandemic. ", "url": "https://21stcenturywire.com/2021/12/23/confirmed-uk-govt-already-planning-push-for-fourth-covid-jab-in-new-year/", "site_name": "21st Century Wire", "article:publisher": "http://www.facebook.com/pages/21st-Century-Wire/182032255155419", "article:published_time": "2021-12-23T17:03:26+00:00", "article:modified_time": "2021-12-27T00:43:14+00:00", "image": "https://21stcenturywire.com/wp-content/uploads/2021/12/covid-booster-vaccine.png", "image:type": "image/png"}, "tags": ["Moderna", "Pfizer", "Vaccine Passports", "Boris Johnson", "Big Pharma", "GMO", "Vaccines", "COVID 19", "AstraZeneca", "Germany", "OMICRON", "Bill Gates"], "tweets": [], "movies": [], "links": ["https://21stcenturywire.com/ads/surfshark-vpn-for-in-content/", "https://www.reuters.com/business/healthcare-pharmaceuticals/german-vaccine-committee-recommends-booster-after-three-months-2021-12-21/", "https://www.telegraph.co.uk/news/2021/12/22/britain-consider-fourth-covid-vaccination-israel-germany-press/", "https://www.telegraph.co.uk/news/2021/12/22/covid-booster-jab-book-vaccine-dose-third-explained/", "https://www.telegraph.co.uk/news/2021/12/22/omicron-symptoms-covid-variant-vaccine-coronavirus-booster/", "https://www.telegraph.co.uk/pfizer/", "https://www.england.nhs.uk/2021/09/nhs-begins-covid-19-booster-vaccination-campaign/", "https://21stcenturywire.com/2021/08/23/video-everything-you-need-to-know-about-informed-consent-its-your-right/", "https://www.thelancet.com/journals/lanmic/article/PIIS2666-5247(21)00069-0/fulltext", "https://www.telegraph.co.uk/news/2021/12/22/mass-vaccination-children-young-five-delayed-despite-regulators/", "https://ca.childrenshealthdefense.org/home-page/risks-of-myocarditis-are-covid-vaccines-in-our-childrens-best-interest/", "https://www.reuters.com/business/healthcare-pharmaceuticals/hospital-stay-risk-omicron-is-40-45-lower-than-delta-uk-study-2021-12-22/", "https://21stcenturywire.com/tag/vaccines", "https://21w.co/support", "https://t.me/My21wire", "https://www.facebook.com/sharer.php?u=https%3A%2F%2F21stcenturywire.com%2F2021%2F12%2F23%2Fconfirmed-uk-govt-already-planning-push-for-fourth-covid-jab-in-new-year%2F", "https://twitter.com/intent/tweet?text=CONFIRMED%3A%20UK%20Gov%E2%80%99t%20Already%20Planning%20for%20FOURTH%20Covid%20Jab%20in%20New%20Year&url=https://21stcenturywire.com/2021/12/23/confirmed-uk-govt-already-planning-push-for-fourth-covid-jab-in-new-year/&via=21stCenturyWire"], "authors": ["NEWS WIRE"], "publish_date": "2021-12-23T17:03:26+00:00"}