{"result_id": "002014", "URL": "https://21stcenturywire.com/2021/09/25/united-airlines-employees-sue-over-covid-vaccine-mandate/", "timestamp": "2023-04-25 11:44:50 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://21stcenturywire.com/wp-content/themes/magazine/images/favicon.ico", "canonical": "https://21stcenturywire.com/2021/09/25/united-airlines-employees-sue-over-covid-vaccine-mandate/", "encoding": "UTF-8"}, "image": null, "domain": "21stcenturywire.com", "title": "United Airlines Employees Sue Over COVID Vaccine Mandate", "cleaned_text": "The plaintiffs, on behalf of a class of what attorneys believe will be around 2,000 employees, are asking for a temporary restraining order against United’s plan to put unvaccinated employees on six years of unpaid leave. Attorneys argue United Airlines’ handling of its new vaccine rule violates the Civil Rights Act of 1964.\n\nUnited in August said that more than half of its 67,000 U.S.-based employees who weren’t vaccinated in August would be required to get the vaccine by Sept. 27, but made an exception for those with medical and religious reasons, which employees argue has not been the case.\n\nThe six employee plaintiffs say United Airlines has failed to approve accommodation requests regarding the vaccine and instead offered six years of unpaid leave for those wishing not to get the vaccine.\n\n“We filed this lawsuit to protect the rights of honest, hardworking United Airlines employees who have religious or medical reasons not to receive the COVID-19 vaccine. United has refused to grant any accommodations and these employees are scared by United’s draconian mandate that forces them to either get the vaccine or lose their job. That’s unacceptable in America,” Mark Paoletta, a partner at Schaerr-Jaffe representing the plaintiff, said in a statement to FOX Business.\n\nWorkers who routinely come in contact with passengers, such as flight attendants, gate agents and pilots, and whose exemptions are approved will face indefinite unpaid leave starting Oct. 2. They won’t be allowed back on the job until the pandemic “meaningfully recedes,” according to a memo obtained by The Associated Press.\n\nEmployees who rarely deal with passengers — examples include baggage handlers and mechanics — and whose exemptions are approved will also be put on leave, but only until the airline comes up with a plan for weekly testing and mandatory mask-wearing for them.\n\nHeadquarters employees whose exemptions are approved will be placed on leave until United decides on safety measures, including whether the person needs to come into the office.\n\n“The most effective thing we can do as an airline to protect the health and safety of all our employees is to require the vaccine – excluding the small number of people who have sought an exemption, more than 97% of our U.S. employees are vaccinated,” a United spokesperson told FOX Business. “And we’ve been encouraged by the overwhelmingly positive response from employees across all work groups, since we announced the policy last month. We’re reviewing this complaint in greater detail but at this point, we think it’s without merit.”\n\nUNITED AIRLINES CEO: ‘WE’RE PREPARED’ FOR PASSENGER VACCINE MANDATE IF BIDEN SAYS SO\n\nLawyers argue that under the Civil Rights Act, United must make reasonable accommodations for employees, which could include requiring masks and testing for unvaccinated employees. Lawyers note that even the Biden administration’s recent vaccine mandate accepts COVID-19 testing as an alternative to getting vaccinated.\n\n“This is not about how effective the vaccines are or whether United may mandate vaccination. The fact is that some people have sincere religious objections to the COVID-19 vaccine, and the Civil Rights Act of 1964 requires employers to respect and accommodate those beliefs. United has failed to do this,” Paoletta said, adding that some United employees “also have special medical conditions” and physicians’ notes not to get vaccinated…\n\nPLEASE HELP SUPPORT OUR INDEPENDENT MEDIA PLATFORM HERE", "opengraph": {"image:width": "610", "image:height": "405", "locale": "en_US", "type": "article", "title": "United Airlines Employees Sue Over COVID Vaccine Mandate - 21st Century Wire", "description": "21WIRE | Attorneys argue United Airlines' handling of its new vaccine rule violates the Civil Rights Act of 1964.", "url": "https://21stcenturywire.com/2021/09/25/united-airlines-employees-sue-over-covid-vaccine-mandate/", "site_name": "21st Century Wire", "article:publisher": "http://www.facebook.com/pages/21st-Century-Wire/182032255155419", "article:published_time": "2021-09-25T18:48:49+00:00", "article:modified_time": "2021-09-25T20:05:25+00:00", "image": "https://21stcenturywire.com/wp-content/uploads/2021/09/United-Airlines-staff.png", "image:type": "image/png"}, "tags": ["COVID 19", "Vaccine Passports", "Vaccines"], "tweets": [], "movies": [], "links": ["https://www.activistpost.com/2021/09/airline-employees-sue-over-covid-vaccine-mandate.html", "https://www.foxbusiness.com/lifestyle/united-employee-rules-vaccine-requirement", "https://www.foxbusiness.com/politics/united-airlines-ceo-passenger-vaccine-mandate-biden", "https://www.activistpost.com/2021/09/airline-employees-sue-over-covid-vaccine-mandate.html", "https://21stcenturywire.com/tag/vaccines", "https://21w.co/support", "https://www.facebook.com/sharer.php?u=https%3A%2F%2F21stcenturywire.com%2F2021%2F09%2F25%2Funited-airlines-employees-sue-over-covid-vaccine-mandate%2F", "https://twitter.com/intent/tweet?text=United%20Airlines%20Employees%20Sue%20Over%20COVID%20Vaccine%20Mandate&url=https://21stcenturywire.com/2021/09/25/united-airlines-employees-sue-over-covid-vaccine-mandate/&via=21stCenturyWire"], "authors": ["NEWS WIRE"], "publish_date": "2021-09-25T18:48:49+00:00"}