{"result_id": "002029", "URL": "https://21stcenturywire.com/2023/02/12/sunday-screening-silent-epidemic-the-untold-story-of-vaccines-2013/", "timestamp": "2023-04-25 11:44:59 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://21stcenturywire.com/wp-content/themes/magazine/images/favicon.ico", "canonical": "https://21stcenturywire.com/2023/02/12/sunday-screening-silent-epidemic-the-untold-story-of-vaccines-2013/", "encoding": "UTF-8"}, "image": null, "domain": "21stcenturywire.com", "title": "SUNDAY SCREENING: 'Silent Epidemic - The Untold Story of Vaccines' (2013)", "cleaned_text": "Our weekly documentary film curated by the editorial team at 21WIRE.\n\nA stunning independent film by ward-winning director Gary Null – the first documentary to investigate thoroughly the true medical record and the historical evidence about alleged ‘vaccine marvels’. For over a century, conventional medicine has heralded the invention of vaccines as some sort of “miracle cure” of modern science. However, it appears that Big Pharma and the medical institutions which it funds – have made repeated false claims about both the effectiveness and safety of vaccines, and have yet to prove that these dangerous cocktails actually prevent and eradicate infectious diseases. The public have been told that vaccines are “safe and effective”, and that they somehow offer “herd immunity” if a high percentage of the population are injected with their substance. However, it begs the questions: does the science support these claims, and what are the untold consequences? Today developed countries, particularly the US, are experiencing unprecedented increases in childhood illnesses: neuro-developmental disorders, diabetes, autism, asthma and allergies, and auto-immune diseases. Simultaneously, children are being exposed to more vaccinations than at any other time in history. Interviewing leading private physicians, pediatricians, immunologists, biomolecular chemists, parents of vaccine-injured children, and legal experts voicing opposition to ‘human rights’ violations over mandated vaccination, the film deconstructs the conventional vaccine hypothesis. What goes into the making of a vaccine that is being injected directly into the blood stream? Far from being worthy of praise, vaccine health risks have become a scourge injuring untold numbers of children, adults, and families. Viewers will be introduced into the primitive technology for making vaccines, their life-threatening ingredients, and the hidden story which the government’s so-called ‘public health’ agencies don’t want you to know. For people who have blindly accepted the Establishment’s popular vaccine mythology, ‘Silent Epidemic’ will certainly make them rethink its mythology. Watch:\n\nSEE MORE SUNDAY SCREENINGS HERE\n\nSUPPORT OUR INDEPENDENT MEDIA PLATFORM – BECOME A MEMBER @21WIRE.TV\n\n \n\nGet Clive de Carle's Natural Health essentials of the finest quality, including vitamin & mineral supplements here.", "opengraph": {"image:width": "610", "image:height": "405", "locale": "en_US", "type": "article", "title": "SUNDAY SCREENING: 'Silent Epidemic - The Untold Story of Vaccines' (2013) - 21st Century Wire", "description": "SUNDAY SCREENING | Here is the hidden story which the government's so-called 'public health' agencies don't want you to know.", "url": "https://21stcenturywire.com/2023/02/12/sunday-screening-silent-epidemic-the-untold-story-of-vaccines-2013/", "site_name": "21st Century Wire", "article:publisher": "http://www.facebook.com/pages/21st-Century-Wire/182032255155419", "article:published_time": "2023-02-12T14:55:46+00:00", "image": "https://21stcenturywire.com/wp-content/uploads/2023/02/SS-Vaccines.jpg", "image:type": "image/jpeg"}, "tags": ["Pfizer", "Big Pharma", "Vaccines"], "tweets": [], "movies": [], "links": ["http://www.21stcenturywire.com/category/sunday-screening", "http://www.21stcenturywire.com/tag/vaccines", "https://21wire.tv/membership/plans/", "https://21w.co/shop-clive", "https://21w.co/shop-clive", "https://www.facebook.com/sharer.php?u=https%3A%2F%2F21stcenturywire.com%2F2023%2F02%2F12%2Fsunday-screening-silent-epidemic-the-untold-story-of-vaccines-2013%2F", "https://twitter.com/intent/tweet?text=SUNDAY%20SCREENING%3A%20%E2%80%98Silent%20Epidemic%20%E2%80%93%20The%20Untold%20Story%20of%20Vaccines%E2%80%99%20%282013%29&url=https://21stcenturywire.com/2023/02/12/sunday-screening-silent-epidemic-the-untold-story-of-vaccines-2013/&via=21stCenturyWire"], "authors": ["NEWS WIRE"], "publish_date": "2023-02-12T14:55:46+00:00"}