{"result_id": "002022", "URL": "https://21stcenturywire.com/2023/01/23/mind-blowing-cdc-forced-to-reveal-how-deadly-the-covid-jab-is/", "timestamp": "2023-04-25 11:44:54 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://21stcenturywire.com/wp-content/themes/magazine/images/favicon.ico", "canonical": "https://21stcenturywire.com/2023/01/23/mind-blowing-cdc-forced-to-reveal-how-deadly-the-covid-jab-is/", "encoding": "UTF-8"}, "image": null, "domain": "21stcenturywire.com", "title": "Mind Blowing: CDC Forced to Reveal How Deadly the COVID Jab Is", "cleaned_text": "\n• None In September 2022, The Epoch Times asked the U.S. Centers for Disease Control and Prevention to release its Proportional Reporting Ratio (PRR) data mining results. The CDC refused. A Freedom of Information Act (FOIA) request has now forced the release of these data, and they are stunning\n• None The CDC’s PRR monitoring has identified several hundred safety signals, including for Bell’s palsy, blood clots, pulmonary embolism and death. In individuals aged 18 and older, there are 770 safety signals for different adverse events, and more than 500 of them have a stronger safety signal than myocarditis and pericarditis\n• None In the 12- to 17-year-old age group there are 96 safety signals, and in the 5- to 11-year-old group there are 66, including myocarditis, pericarditis, ventricular dysfunction, cardiac valve incompetency, pericardial and pleural effusion, chest pain, appendicitis and appendectomies, Kawasaki’s disease and vitiligo\n• None The proportions of deaths, which were only provided for the 18-plus age group, was 14% for the COVID jabs compared to 4.7% for all other vaccines\n• None The FDA is also required to perform safety monitoring, using empirical Bayesian data mining. The Epoch Times asked the FDA to release its monitoring results in July 2022 but, like the CDC, the FDA refused, only to admit in December 2022 they’d confirmed the Pfizer shot was linked to pulmonary embolism\n\nIn September 2022, The Epoch Times asked the U.S. Centers for Disease Control and Prevention to release its Proportional Reporting Ratio (PRR) data mining results. PRR1 measures how common an adverse event is for a specific drug compared to all the other drugs in the database.\n\nAccording to the standard operating procedures2,3 for the Vaccine Adverse Event Reporting System (VAERS), which is run jointly by the CDC and the Food and Drug Administration, the CDC is required to perform these data mining analyses.\n\nNot only did the CDC refuse to release the data, but it also provided false information — twice — in response to The Epoch Times’ questions about the monitoring being performed. As reported by The Epoch Times back in September 2022,4 the CDC initially claimed PRR analyses were “outside the agency’s purview” and that no monitoring was being done by them.\n\nEventually, the agency admitted it was doing PRRs, starting in February 2021, only to later claim they didn’t perform any PRRs until March 2022. The Epoch Times also cited several papers in which the FDA and/or CDC claimed their data mining efforts had come up empty handed.5 Now, we find that was all a pack of lies.\n\nIn reality, the CDC’s PRR monitoring reveals HUNDREDS of safety signals, including Bell’s palsy, blood clots, pulmonary embolism and death — all of which, according to the rules, require thorough investigation to either confirm or rule out a possible link to the shots. As reported by The Epoch Times in early January 2023:6\n\nMyopericarditis Is Far From the Only Problem\n\nOne of the few side effects of the COVID jabs that the CDC has actually acknowledged is myocarditis (heart inflammation), and a related condition called pericarditis (inflammation of the heart sack). Alas, the PRR monitoring results reveal there are more than 500 other adverse events that have stronger warning signals than either of those conditions.\n\nJosh Guetzkow, an Israeli professor trained in statistics at Princeton University told The Epoch Times:7\n\nGuetzkow expanded on his commentary in a January 4, 2023, Substack article.8 Below is a summary list of some of the key findings from the CDC’s PRR analysis. Guetzkow goes deeper in his article, so for more details, I suggest reading it in its entirety.\n\nFor even more analyses and commentary, see Fenton’s Substack article, “The CDC’s Data on COVID Vaccine Safety Signals.”9 If you want to investigate the PRR data for yourself, you can download them from The Epoch Times’ January 3, 2023, article.10 You can also find them here.11\n\n– In individuals aged 18 and older, there are safety signals for 770 different adverse events, and two-thirds of them (more than 500) have a stronger safety signal than myocarditis and pericarditis. Of those 770 signals, 12 are brand-new conditions that have not been reported following other vaccines. – Topping the list of safety signals are cardiovascular conditions, followed by neurological conditions. In third and fourth place are thromboembolic conditions and pulmonary conditions. Death is sixth on the list and cancer is 11th. Considering the uptick we’ve seen in aggressive cancers, the fact that death tops cancer really says something. – The number of serious adverse events reported between mid-December 2020 and the end of July 2022 (just over 19 months) for the COVID jabs is 5.5 times greater than all serious reports for vaccines given to adults in the U.S. over the last 13 years (approximately 73,000 versus 13,000). – Twice as many COVID jab reports were classified as serious compared to all other vaccines given to adults (11% vs. 5.5%), which meets the definition of a safety signal. – The proportions of reported deaths, which was only provided for the 18+ age group, was 14% for the COVID jabs compared to 4.7% for all other vaccines. As noted by Fenton, “If the CDC wish [sic] to claim that the probability a COVID vaccine adverse event results in death is not significantly higher than that of other vaccines the onus is on them to come up with some other causal explanation for this difference.” – In the 12- to 17-year-old age group, there are 96 safety signals, including myocarditis, pericarditis, Bell’s Palsy, genital ulcerations, high blood pressure, menstrual irregularities, cardiac valve incompetency, pulmonary embolism, cardiac arrhythmia, thrombosis, pericardial and pleural effusion, appendicitis and perforated appendix, immune thrombocytopenia, chest pain and increased troponin levels (indicative of heart damage). – In the 5- to 11-year-old group, there are 66 safety signals, including myocarditis, pericarditis, ventricular dysfunction, cardiac valve incompetency, pericardial and pleural effusion, chest pain, appendicitis and appendectomies, Kawasaki’s disease, menstrual irregularities and vitiligo.\n\n.\n\n It’s worth noting that the CDC didn’t perform its first safety signal analysis until March 25, 2022 — 15 months after the shots were rolled out. Why the long wait — especially since the CDC had announced it would begin monitoring in early 2021? Just consider, for a moment, how many lives have been lost because the CDC failed to properly monitor safety, and still drags its feet when it comes to warning people about the risks involved.\n\nThe FDA is also required to perform safety monitoring using another technique called Empirical Bayesian data mining. The Epoch Times first asked the FDA to release its monitoring results back in July 2022,13,14 but like the CDC, the FDA refused and insisted the data showed no evidence of serious adverse effects. In other words, “Just trust us. We’re experts.”\n\nAccording to the FDA, the only potential signal they’d found through April 16, 2021, was for raised body temperature.15 Then, in mid-December 2022 — just four months after The Epoch Times tried to get these data — the FDA announced that pulmonary embolism (blood clots that block blood flow in the lungs) had met the threshold for a statistical signal, and continued to meet the criteria after in-depth evaluation, but it was only linked to the Pfizer jab.16\n\nAs noted by The Epoch Times,17 pulmonary embolism is also identified as a signal in the CDC’s PRR analysis for individuals as young as 12, which really ought to strengthen concerns.\n\nThe FDA also admitted it had already evaluated three other warning signals: lack of oxygen to the heart, immune thrombocytopenia (a blood platelet disorder) and intravascular coagulation (a type of blood clotting), but none of these continued to meet the threshold after analysis.\n\nIf the FDA was evaluating four warning signals, why did they tell The Epoch Times there was no evidence of ill effects, and why did they claim the only potential signal they’d found was slight fever? Are we to believe they discovered these signals after The Epoch Times asked for the monitoring results and then completed four in-depth investigations in four months?\n\nWhatever the truth, it’s clear that both the CDC and FDA are not being transparent. Worse, they’ve hidden data, knowing it could mean the difference between life and death for hundreds of thousands of people.\n\nThe CDC ignoring a clear signal for death is probably the most egregious example of its failures as a public health institution. As early as July 2021, Matthew Crawford published a three-part series18,19,20 detailing how the CDC was hiding safety signals by using a flawed formula. In August that year, Steve Kirsch informed the agency of these problems, but was ignored.\n\nThen, in an October 3, 2022, article,21 Kirsch went on to show how “death” should have triggered a signal even when using the CDC’s flawed formula (which is described in its VAERS standard operating procedures manual22). Here’s an excerpt:23\n\nA ‘safety signal’ is defined on page 16 in the CDC document as a PRR of at least 2, chi-squared statistic of at least 4, and 3 or more cases of the AE [adverse event] following receipt of the specific vaccine of interest. This is the famous ‘and clause.’ Here it is from the document:", "opengraph": {"image:width": "610", "image:height": "405", "locale": "en_US", "type": "article", "title": "Mind Blowing: CDC Forced to Reveal How Deadly the COVID Jab Is - 21st Century Wire", "description": "Dr. Joseph Mercola | Not only did the CDC refuse to release the data, but it also provided false information. But eventually, the real information was revealed.", "url": "https://21stcenturywire.com/2023/01/23/mind-blowing-cdc-forced-to-reveal-how-deadly-the-covid-jab-is/", "site_name": "21st Century Wire", "article:publisher": "http://www.facebook.com/pages/21st-Century-Wire/182032255155419", "article:published_time": "2023-01-23T12:07:22+00:00", "article:modified_time": "2023-01-23T12:10:01+00:00", "image": "https://21stcenturywire.com/wp-content/uploads/2022/08/COVID-vaccine.jpg", "image:type": "image/jpeg"}, "tags": ["FDA", "Moderna", "Pfizer", "Big Pharma", "Vaccines", "Eugenics", "COVID 19", "CDC"], "tweets": [], "movies": [], "links": ["https://articles.mercola.com/sites/articles/archive/2023/01/23/cdc-aware-hundreds-safety-signals-covid-jab.aspx", "https://public.tableau.com/app/profile/t.coddington/viz/VAERSDataSummary-12142020-07292022/VaersDataSummary", "https://allaboutpharmacovigilance.org/42-data-mining-proportional-reporting-ratio/", "https://www.documentcloud.org/documents/22119655-cdc-vaers-sop-2021", "https://www.documentcloud.org/documents/22278999-vaers-sop-2022", "https://www.theepochtimes.com/exclusive-fda-refuses-to-provide-key-covid-19-vaccine-safety-analyses_4722586.html?utm_source=News&utm_campaign=breaking-2022-09-10-3&utm_medium=email&est=s%2F4YX3V9Tw9sJ8WDdqYt4B5XpYkhZgW3Oe%2FoB1StPegh4hPyvuGTMgSrIinl", "https://archive.ph/gBfcw", "https://jackanapes.substack.com/p/cdc-finally-released-its-vaers-safety", "https://wherearethenumbers.substack.com/p/the-cdcs-data-on-covid-vaccine-safety", "https://public.tableau.com/app/profile/t.coddington/viz/VAERSDataSummary-12142020-07292022/VaersDataSummary", "https://jackanapes.substack.com/p/fda-refuses-to-make-its-vaers-safety", "https://archive.ph/cCvep#selection-525.35-525.183", "https://roundingtheearth.substack.com/p/defining-away-vaccine-safety-signals", "https://roundingtheearth.substack.com/p/the-chloroquine-wars-part-xlix", "https://roundingtheearth.substack.com/p/defining-away-vaccine-safety-signals-572", "https://stevekirsch.substack.com/p/unassailable-proof-of-incompetence", "https://www.cdc.gov/vaccinesafety/pdf/VAERS-v2-SOP.pdf", "https://pubmed.ncbi.nlm.nih.gov/15317031/", "https://www.wispolitics.com/2022/u-s-sen-johnson-says-any-attempt-to-alter-dod-database-without-preserving-records-will-undermine-congressional-oversight", "https://stevekirsch.substack.com/p/this-medical-data-from-the-us-dod", "https://www.mercola.com/", "https://www.mercola.com/", "http://www.21stcenturywire.com/tag/vaccines", "https://21w.co/support", "https://21w.co/shop-clive", "https://21w.co/shop-clive", "https://www.facebook.com/sharer.php?u=https%3A%2F%2F21stcenturywire.com%2F2023%2F01%2F23%2Fmind-blowing-cdc-forced-to-reveal-how-deadly-the-covid-jab-is%2F", "https://twitter.com/intent/tweet?text=Mind%20Blowing%3A%20CDC%20Forced%20to%20Reveal%20How%20Deadly%20the%20COVID%20Jab%20Is&url=https://21stcenturywire.com/2023/01/23/mind-blowing-cdc-forced-to-reveal-how-deadly-the-covid-jab-is/&via=21stCenturyWire"], "authors": ["NEWS WIRE"], "publish_date": "2023-01-23T12:07:22+00:00"}