{"result_id": "002036", "URL": "https://21stcenturywire.com/2021/02/14/germany-whistleblower-in-nursing-home-says-elderly-dying-after-covid-vaccine/", "timestamp": "2023-04-25 11:45:02 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://21stcenturywire.com/wp-content/themes/magazine/images/favicon.ico", "canonical": "https://21stcenturywire.com/2021/02/14/germany-whistleblower-in-nursing-home-says-elderly-dying-after-covid-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "21stcenturywire.com", "title": "German Nursing Home Whistleblower: 'Elderly Dying After COVID Vaccine'", "cleaned_text": "Since the public release of the controversial mRNA vaccine, many disturbing reports of adverse reactions and untimely deaths have been mounting, including deaths following receipt of the experimental Pfizer/BioNTech shot are also emerging from , , , , and .\n\nAccording to (CHD) board chairman Robert F. Kennedy Jr, “Coincidence is turning out to be quite lethal to recipients.” Kennedy adds, “If the clinical trials are good predictors, the rate of coincidence is likely to increase dramatically after the second shot.”\n\nAccording to records from the it is suggested that almost all the supposed benefits of COVID vaccination and the vast were associated with the of the experimental mRNA vaccine.\n\nAnother case which is emerging out of Germany is particularly disturbing, and involves a cover-up by officials in what clearly appears to be linked to the administration of the Pfizer/BioNTech genetic product.\n\nFor the first time, there is an eyewitness report from a Berlin nursing home on the situation after the vaccination. It comes from the AGAPLESION Bethanien Havelgarten retirement home in Berlin-Spandau. There, within four weeks after the first vaccination with the BioNTech/Pfizer vaccine Comirnaty, eight of 31 seniors, who suffered from dementia but were in good physical condition according to their age before the vaccination, died. The first death occurred after only six days, and five other seniors died approximately 14 days after vaccination. The first symptoms of the disease had already appeared shortly after the vaccination.\n\nFrom information available to 2020News the patients have not been duly informed about the risks of this vaccine. One reason being that no detailed information about the novelty of this mRNA vaccine which has only conditionally been certified in the European Union have been provided.\n\nAttorney at Law Viviane Fischer and Attorney at Law Dr. Reiner Füllmich of the Corona Committee spoke in a video interview with the whistleblower about the closer circumstances of the vaccination, the symptoms that occurred and the different nature of the deaths in temporal connection with the vaccination.\n\nOn January 3, 2021, 31 female and male residents of the dementia ward “ground floor/protected area” had been vaccinated with Comirnaty. Relatives of another three seniors had objected to vaccination, and two residents were in terminal care, so no vaccination was given.\n\nThe residents of this ward are very active, “self defending” dementia patients who are physically in good condition. They are allowed to move around the ward all day without restriction. The day before the vaccination, the 31 vaccinated persons were all in good health. A few days earlier, all had tested negative for Corona, according to the whistleblower report.\n\nAccording to the whistleblower, the first vaccination event with Comirnaty on January 3, 2021, took place in such a way that all residents were gathered in the recreation room of the first floor area. A vaccination team consisting of an aged vaccinator, three aides and two federal soldiers in camouflage uniforms performed the vaccinations. The home staff as well as the home physician assisted in the process. The role of the soldiers, who at no time moved away from the vaccine, has not been conclusively determined.\n\nWhat the whistleblower was able to establish, however, was that the presence of the uniformed men greatly intimidated the seniors. The group, which normally shows a “strong defensive behavior” in the case of unfamiliar treatments, was hardly recognizable, so predominantly “lamblike” they had let the vaccination with Comirnaty pass over them. The whistleblower suspects that this could also be related to the fact that the elderly seniors, who had still experienced the war, could not properly assess the role of the soldiers and possibly felt reminded of war-traumatic circumstances.\n\nDuring the first vaccination, a resisting senior citizen was detained by a nurse under the watchful eyes of the German soldiers, the eyewitness reported. A judicial decision for the detention, which as such represents a coercion and therefore requires in principle a judicial evaluation in the individual case, had not been issued.\n\nAccording to the whistleblower’s account, the administration of the second vaccination dose took place without warning always on the spot where the person to be vaccinated was found. For example, an elderly lady lying unsuspecthe ingly in bed who began to resist the second dose was restrained by two members of tnursing staff in order to overcome her resistance – again without the necessary court order. The swabbing for the PCR test, which some seniors tried to resist, is also regularly done with the use of physical force against the seniors resisting the unwanted treatment, the whistleblower said.\n\nAccording to the whistleblower, the vaccination education of the caregivers and relatives – the seniors are unable to effectively consent to vaccination due to their dementia – was based on outdated information sheets from the RKI/Grünes Kreuze. In particular, the information required by Regulation (EC) No. 507/2006 on the fact the vaccine Comirnaty has only been granted conditional marketing authorization and why this is the case is missing. In particular, the information should have been provided that from the point of view of the regulatory authority EMA, the data situation still needs to be improved with regard to various aspects, e.g. the interaction of Comirnaty with other drugs.\n\nAlready on the day of vaccination, four of the vaccinated seniors began to show unusual symptoms. In the evening of that day they were fatigued and extremely tired, some of them fell asleep at the table during dinner. A sharp drop in blood oxygen saturation was noted. In the further course, the leaden fatigue continued, the oxygen saturation in the blood remained insufficient, in some cases gasping breathing occurred, and fever, edema, skin rash, a yellowish-gray discoloration of the skin, and a (characteristic) muscle tremor of the upper body and arms occurred.\n\nThe seniors also showed a change in demeanor, were partially unresponsive, and refused to eat or drink. One vaccinated senior, who had previously been “in great shape” for her age and suffered from no serious previous illnesses, died as early as January 9, 2021, just six days after vaccination. Deaths among vaccinated seniors and senior citizens occurred on January 15, January 16, January 19 (2 deaths), January 20, February 2, and February 8, 2021. The most recently deceased senior citizen was a former opera singer who had been playing the piano the day before vaccination. The whistleblower reports on the state of health that the old gentleman regularly went jogging, danced, played music and was otherwise very dynamic and active.\n\nOf the seniors who tested negative before vaccination, various suddenly showed a positive test result after vaccination. However, all of these seniors did not show any of the known COVID-19 symptoms, i.e., symptoms of colds such as cough, cold, loss of sense of smell and taste, etc.\n\nOn January 24, 2021, the second dose of Comirnaty was applied to 21 seniors. After this vaccination, according to the whistleblower, eleven seniors are now showing persistent extreme fatigue, partially gasping for breath, partially edema, skin rash, and the yellowish-grayish skin discoloration. As of February 10, 2021, none of the seniors who received the second dose of Comirnaty has died, but the health of some of the seniors in this group is steadily deteriorating…\n\nPLEASE HELP SUPPORT OUR WINTER FUNDRAISING DRIVE HERE", "opengraph": {"image:width": "610", "image:height": "415", "locale": "en_US", "type": "article", "title": "German Nursing Home Whistleblower: 'Elderly Dying After COVID Vaccine' - 21st Century Wire", "description": "21WIRE + 2020 News | Disturbing reports of injuries and deaths is being ignored by government and mainstream press.", "url": "https://21stcenturywire.com/2021/02/14/germany-whistleblower-in-nursing-home-says-elderly-dying-after-covid-vaccine/", "site_name": "21st Century Wire", "article:publisher": "http://www.facebook.com/pages/21st-Century-Wire/182032255155419", "article:published_time": "2021-02-14T12:57:38+00:00", "article:modified_time": "2021-02-14T12:58:35+00:00", "image": "https://21stcenturywire.com/wp-content/uploads/2020/12/1-Vaccines-Safety.png", "image:type": "image/png"}, "tags": ["Pfizer", "Coronavirus", "Big Pharma", "Vaccines", "COVID 19", "Germany"], "tweets": [], "movies": [], "links": ["https://www.prnewswire.com/news-releases/government-database-shows-7-844-injuries-and-181-deaths-following-covid-vaccine-as-of-jan-15-says-childrens-health-defense-301217037.html", "https://c212.net/c/link/?t=0&l=en&o=3048395-1&h=2431835793&u=https%3A%2F%2Fwww.israelnationalnews.com%2FNews%2FNews.aspx%2F293865&a=%C2%A0Israel", "https://c212.net/c/link/?t=0&l=en&o=3048395-1&h=1805940957&u=https%3A%2F%2Fnypost.com%2F2021%2F01%2F07%2Fnorway-investigating-two-deaths-of-people-who-took-pfizer-vaccine%2F&a=%C2%A0Norway", "https://c212.net/c/link/?t=0&l=en&o=3048395-1&h=890142537&u=https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-9111311%2FPortuguese-health-worker-41-dies-two-days-getting-Pfizer-covid-vaccine.html%3Fito%3Dsocial-facebook&a=%C2%A0Portugal", "https://c212.net/c/link/?t=0&l=en&o=3048395-1&h=656979174&u=https%3A%2F%2Fwww.theepochtimes.com%2Ffour-deaths-in-elderly-reported-from-3-countries-during-first-days-of-vaccine-rollout-authorities-urge-calm_3639786.html&a=%C2%A0Sweden", "https://c212.net/c/link/?t=0&l=en&o=3048395-1&h=3882944233&u=https%3A%2F%2Fwww.reuters.com%2Farticle%2Fus-health-coronavirus-swiss-death-idUSKBN29413Y&a=%C2%A0Switzerland", "https://c212.net/c/link/?t=0&l=en&o=3048395-1&h=3818129731&u=https%3A%2F%2Fchildrenshealthdefense.org%2F&a=%C2%A0Children%27s+Health+Defense", "https://c212.net/c/link/?t=0&l=en&o=3048395-1&h=1395348597&u=https%3A%2F%2Fchildrenshealthdefense.org%2Fdefender%2Fdeath-by-coincidence%2F&a=%C2%A0COVID+vaccine", "https://c212.net/c/link/?t=0&l=en&o=3048395-1&h=3544841933&u=https%3A%2F%2Fwww.fda.gov%2Fmedia%2F144245%2Fdownload&a=%C2%A0clinical+trials", "https://c212.net/c/link/?t=0&l=en&o=3048395-1&h=1159944610&u=https%3A%2F%2Fwww.fda.gov%2Fmedia%2F144452%2Fdownload&a=%C2%A0majority+of+injuries", "https://c212.net/c/link/?t=0&l=en&o=3048395-1&h=1842070070&u=https%3A%2F%2Fchildrenshealthdefense.org%2Fdefender%2Fpfizer-covid-vaccine-trial-pathogenic-priming%2F&a=%C2%A0second+dose", "https://2020news.de/en/whistleblower-from-berlin-nursing-home-the-terrible-dying-after-vaccination/", "https://corona-ausschuss.de", "https://2020news.de/wp-content/uploads/2021/01/Verordnung-EG-Nr.-507-2006.pdf", "https://2020news.de/en/whistleblower-from-berlin-nursing-home-the-terrible-dying-after-vaccination/", "https://21stcenturywire.com/tag/vaccines", "https://21w.co/support", "https://www.facebook.com/sharer.php?u=https%3A%2F%2F21stcenturywire.com%2F2021%2F02%2F14%2Fgermany-whistleblower-in-nursing-home-says-elderly-dying-after-covid-vaccine%2F", "https://twitter.com/intent/tweet?text=German%20Nursing%20Home%20Whistleblower%3A%20%E2%80%98Elderly%20Dying%20After%20COVID%20Vaccine%E2%80%99&url=https://21stcenturywire.com/2021/02/14/germany-whistleblower-in-nursing-home-says-elderly-dying-after-covid-vaccine/&via=21stCenturyWire"], "authors": ["NEWS WIRE"], "publish_date": "2021-02-14T12:57:38+00:00"}