{"result_id": "002011", "URL": "https://21stcenturywire.com/2022/08/27/the-startling-history-of-polio-vaccination/", "timestamp": "2023-04-25 11:44:49 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://21stcenturywire.com/wp-content/themes/magazine/images/favicon.ico", "canonical": "https://21stcenturywire.com/2022/08/27/the-startling-history-of-polio-vaccination/", "encoding": "UTF-8"}, "image": null, "domain": "21stcenturywire.com", "title": "The Startling History of Polio Vaccination", "cleaned_text": "‘Doctors trying to promote vaccines often claim that the disease poliomyelitis was eradicated by the use of a vaccine. This is, to put it politely, a barefaced lie. I know facts are unfashionable with the medical establishment these days but the hard evidence shows quite conclusively that the polio vaccine has endangered vast numbers of healthy people, still kills healthy people and played no part in eradicating the disease.\n\nProof that the introduction of the polio vaccine wasn’t the success it is often made out to be isn’t difficult to find. In Tennessee, USA, the number of polio victims the year before vaccination became compulsory was 119. The year after vaccination was introduced the figure rose to 386. In North Carolina, the number of cases before vaccination was introduced was 78, while the number after the vaccine became compulsory rose to 313. There are similar figures for other American states. If you don’t believe me, check out the figures. The evidence isn’t that hard to find. In America, as a whole, the incidence of polio increased dramatically (by around 50 per cent) after the introduction of mass immunisation. The number of deaths from polio had fallen dramatically before the first polio vaccine was introduced.\n\nThe truth is that as with other infectious diseases the significance of polio dropped as better sanitation, better housing, cleaner water and more food were all made available in the second half of the 19th century. It was social developments rather than medical ones which increased human resistance to infectious diseases.\n\nBut the profitable vaccine is still popular. Today, paralysis caused by poliomyelitis is unheard of in many countries. But every year there are cases of paralysis probably caused by the oral polio vaccine.\n\nHowever, whether or not the polio vaccine actually works is, for many people, a relatively unimportant health issue.\n\nOf far more significance is the fact (revealed in my book Why Animal Experiments Must Stop in 1991) that millions of people who were given polio jabs as children in the 1950s and 1960s may now be at a greatly increased risk of developing cancer.\n\nThe problem is that although the first breakthrough in the development of a poliomyelitis vaccine was made in 1949 with the aid of a human tissue culture, when the first practical vaccine was prepared in the 1950’s monkey kidney tissue was used because that was standard laboratory practice. Researchers didn’t realise that one of the viruses commonly found in monkey kidney cells can cause cancer in humans.\n\nIf human cells had been used to prepare the vaccine (as they could and should have been and as they are now) the original poliomyelitis vaccine would have been much safer.\n\nBone, brain, liver and lung cancers have all been linked to the monkey kidney virus SV40 and something like 17 million people who were given the polio vaccine in the 1950s and 1960s are probably now at risk (me included). Moreover, there now seems to be evidence that the virus may be passed on to the children of those who were given the contaminated vaccine. The SV40 virus from the polio vaccine has already been found in cancers which have developed both in individuals who were given the vaccine as protection against polio and in the children of individuals who were given the vaccine. It seems inconceivable that the virus could have got into the tumours other than through the polio vaccine.\n\nThe American Government was warned of this danger back in 1956 but the doctor who made the discovery was ignored and her laboratory was closed down. Surprise, surprise. It was five years after this discovery before drug companies started screening out the virus. And even then Britain had millions of doses of the infected polio vaccine in stock. There is no evidence that the Government withdrew the vaccine and so it was almost certainly just used until it had all gone. No one can be sure about this because in Britain the official records which would have identified those who had received the contaminated vaccine were all destroyed by the Department of Health in 1987. Oddly enough the destruction of those documents means that no one who develops cancer as a result of a vaccine they were given (and which was recommended to their parents by the Government) can take legal action against the Government. Gosh. The world is so full of surprises. My only remaining question is a simple one: How do these bastards sleep at night?\n\nOh, I do have one other question.\n\nDid your doctor, practice nurse or eager health visitor mention any of this when extolling the virtues of vaccination?’", "opengraph": {"image:width": "610", "image:height": "411", "locale": "en_US", "type": "article", "title": "The Startling History of Polio Vaccination - 21st Century Wire", "description": "Dr. Vernon Coleman | Granted, facts are unfashionable with the medical establishment these days, but the hard evidence shows that these particular jabs were never effective, much less 'safe'.", "url": "https://21stcenturywire.com/2022/08/27/the-startling-history-of-polio-vaccination/", "site_name": "21st Century Wire", "article:publisher": "http://www.facebook.com/pages/21st-Century-Wire/182032255155419", "article:published_time": "2022-08-27T12:25:52+00:00", "article:modified_time": "2022-09-01T22:36:23+00:00", "image": "https://21stcenturywire.com/wp-content/uploads/2021/03/Dr_Vernon_Coleman_Vaccines.jpg", "image:type": "image/jpeg"}, "tags": ["Big Pharma", "Vaccines", "Cancer", "Bill Gates", "Polio"], "tweets": [], "movies": [], "links": ["https://21w.co/shop-clive", "https://21w.co/shop-clive"], "authors": ["NEWS WIRE"], "publish_date": "2022-08-27T12:25:52+00:00"}