{"result_id": "002045", "URL": "https://21stcenturywire.com/2021/12/06/is-there-a-link-between-cancer-and-covid-19-vaccine/", "timestamp": "2023-04-25 11:45:08 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://21stcenturywire.com/wp-content/themes/magazine/images/favicon.ico", "canonical": "https://21stcenturywire.com/2021/12/06/is-there-a-link-between-cancer-and-covid-19-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "21stcenturywire.com", "title": "Is There a Link Between Cancer and COVID-19 'Vaccine'?", "cleaned_text": "Several months ago, we expressed at least “theoretical reservations” about vaccinating cancer patients or former patients who had been cured, because of the underlying mechanism of the gene injection on immunity.\n\nSeveral geneticists had also expressed their concerns about the possible interference between active or dormant cancer cells and the activity of gene therapy on lymphocytes in particular.\n\nMonths have passed, and the vaccine madness has amplified, leading to the refusal of patients without a passport in hospitals (which, as is well known, are intended to receive only healthy people) and to the demand that patients be vaccinated before receiving any treatment, including cancer patients.\n\nWe are in a world gone mad and yet these stories are multiplying, such as this young man of 22 years who had a chronic cough leading to an X-ray discovering a mediastinal mass. The two big Paris hospitals that received him refused to start the treatment (without it being explained in detail) if the patient refused the experimental injection, of absolutely unknown effects on the development of cancers.\n\nThe doctors’ justification? None: “that’s the way it is”, and we have accepted it!\n\nSilence on the colleagues suspended for lack of obedience and even more on the objective reasons that made them prefer to lose their jobs, their remuneration, their houses, their families intolerant to these decisions as well, rather than submit to the presidential ukase to accept experimental drugs…\n\nWould more than three hundred thousand caregivers (a figure that is probably highly underestimated given the number of hospitals and clinics currently forced to close beds and postpone interventions due to lack of personnel) be crazy, conspiratorial or delusional to the point of putting themselves in great personal, social, family, professional and psychological danger?\n\nHave the doctors who claim that vaccination is safe taken the time to look at the statistics of the effects reported and accepted by the official agencies? Are the FDA, EMA, MHRA also “conspiratorial” when they release statistics as in the case of VAERS, which is entity of the CDC:\n\nMore than 726,000 Covid vaccine-related adverse events reported to VAERS as CDC and FDA overturn advisory committee recommendations on Pfizer’s third vaccine.\n\nVAERS data released by the CDC included a total of 726,965 adverse event reports from all age groups following Covid vaccines, including 15,386 deaths and 99,410 serious complications between December 14, 2020, and September 17, 2021.[1]\n\nOr Eudra Vigilance pharmacovigilance body of the European Medicines Agency\n\nOr even the ANSM, our French agency, which shows more than 1200 deaths accepted as at least possibly related to these experimental injections.\n\nAll therapeutic trials for fifty years were stopped after a few deaths for investigation (53 deaths stopped the H1N1 vaccine). Here, thousands of deaths throughout the world and children are shamelessly attacked[2]. How can we continue to believe that this is a health policy?\n\nWhy this denial of the most solid sects on the part of theoretically educated doctors, capable of obtaining information directly from reliable sources and equipped with a brain?\n\nFear of the boss, of the director, who in a few months’ time will inevitably be called into question, since many countries are backtracking and even Germany wants to get out of vaccine terrorism, perhaps on the occasion of Mrs Merkel’s departure[3].\n\n“The leading organizations of contracted physicians in Germany are demanding an immediate end to the “anti-corona” measures and an end to the “horror rhetoric and panic politics”. Obviously, French hospital doctors in Paris and elsewhere do not read German newspapers and are terrorized by the threats of their professional association, their minister, and become kapos[4] and terrorize their patients.\n\nMore and More Testimonies are Coming In\n\nWhatever their unacceptable reasons, testimonies are multiplying.\n\nA young girl accompanies her friend to her mother’s funeral… such a mother, mother of a high school friend, 34 years old, in remission from breast cancer for two years, who is injected with the vaccine and collapses a few days later in a coma and dies after three days of hospitalization… Politically correct explanation: the cancer exploded and took her away. Close the chapter and the coffin.\n\nWhat would Maigret have said? [Historic Police Investigator]\n\nBut too many coincidences shock the police investigators in front of a corpse. Only doctors would not have the right to think about coincidences of time, for example: “temporality” is their key word…\n\nLike the misleading slogan, “the numbers are always right”. Yes, if they are true and observed in the real world.\n\nBut how much confidence can we have in the rigged simulations that the government and the media feed us without ever specifying that they are only predictions or estimates? 5] But one can do what one wants with the figures, when one chooses them, or creates them to justify the chosen hypothesis, and the the results are totally blurred.\n\nIn any case, as far as “cancer and gene injection” is concerned, the vagueness unfortunately dissipates in front of the multitude of terrible stories.\n\nFrom the colleague who sees multiple “balls” appearing under her armpits, which the check-ups in the hospital do not explain… Obviously no possible link with the vax. And yet the ganglions that appear some time after the injection are a frequent observation after these vax.\n\nSo clearly there seems to be three situations:\n• The appearance of a cancer rapidly after the injection (two weeks to a few months) and very progressive, in a person who was previously free of known carcinological pathologies.\n• The resumption of cancer in a patient who has been in complete remission for several months or years.\n• The rapid, even explosive, evolution of a cancer that is not yet controlled.\n\nBeyond the testimonies that are pouring in from relatives and friends and on social networks, a Swiss newspaper has finally addressed the subject in a broader way.\n\nHere are some excerpts from their article[6] and their references[7]:\n\nThus the authors conclude that it is quite possible that these immune changes could have unintended consequences on the condition of the recipient of the gene injection. A matter of common sense indeed!\n\nPost-vaccination reactivation of latent viral infections, including shingles virus, EBV (Epstein-Barr) and hepatitis virus, has also been observed.\n\nThere are already a few thousand observations in official adverse event reporting and online patient groups. There are certainly true coincidences or diagnostic delays due to delayed diagnosis related to containment. But we should not dismiss the huge problems that these real people affected in their daily lives and even more the responsibility that cancer doctors take by imposing the injection before any treatment or protocol continuation. Their main argument: “we did it right, without discussion” does not seem worthy of a once thoughtful profession.\n\nIn August 2021, Dr. Ryan Cole,[8] an American pathologist for many years, described a significant increase in certain types of cancer (e.g. endometrial cancer, uterine cancer) since the beginning of the covid mass vaccination campaign. More recently, German pathologists have also noted the problem of post-vaccination immune dysregulation and sudden tumor growth in some patients.\n\nOn the French networks, several testimonies coincide with the reappearance of vaginal hemorrhages in women over 85 years of age leading to the diagnosis of endometrial cancer and rapid death… The spike protein produced by the body following the injection is particularly attracted to the genitals, and this would be a new demonstration of this.\n\nSo until we know more, let’s be careful, both doctors and caregivers, and not play the sorcerer’s apprentice!\n\nCaution is required with all experimental treatments and even more so when they are the result of a technique never used before in infectious pathology. First, do no harm must guide the decisions of any physician faithful to his Hippocratic oath.\n\nDr. Nicole Delépine: Pediatrician, oncologist, former head of the pediatric oncology department at the R Poincaré Garches Hospital APHP France\n\nWebsite www.docteurnicoledelepine.fr and ametist.org for the defense of children with cancer\n\n[1] More Than 726,000 COVID Vaccine Injuries Reported to VAERS as CDC, FDA Overrule Advisory Committees’ Recommandations on Third Pfizer Shot\n• Children’s Health Defense (childrenshealthdefense.org)\n\n[3] Les médecins libéraux allemands pour la fin de « la politique de la panique »\n\n le 27/09/2021 Dr Stephan Hofmeister, Dr Andreas Gassen, Dr Thomas Kriedel\n\n KBV Lopata/axentis.de France-Soir\n\n Les principales organisations de médecins conventionnés en Allemagne exigent la fin immédiate des mesures « anti-corona » et la fin de « la rhétorique de l’horreur et la politique de la panique ».\n\n Lors de la convention des délégués des médecins conventionnés allemands, le directeur adjoint de la Kassenärztlichen Bundesvereinigung (KBV, association nationale des médecins de l’assurance maladie) le Dr Stephan Hofmeister, et le président, le Dr Andreas Gassen, ont exigé la fin des mesures dites « anti-Corona » en Allemagne et la fin de la « politique de la panique et la rhétorique de l’horreur ».\n\n Le communiqué de presse de la KBV déclare : « tous ceux qui souhaitent se faire vacciner ont la possibilité de le faire. Désormais ce n’est plus une décision qui revient à l’État : chacun doit décider à titre individuel pour lui-même. » Selon le Dr Hofmeister les sondages indiquent que plus insistantes se font les pressions politiques, plus les gens refusent toute vaccination en signe de protestation. « C’est une confusion malsaine », a-t-il dit en exigeant que l’on arrête cette politique de la peur.\n\nThe original source of this article is Nouveau Monde.\n\nAlso published by mondialisation.ca. Translated from French by Global Research.\n\nPLEASE HELP SUPPORT OUR INDEPENDENT MEDIA PLATFORM HERE", "opengraph": {"image:width": "610", "image:height": "400", "locale": "en_US", "type": "article", "title": "Is There a Link Between Cancer and COVID-19 'Vaccine'? - 21st Century Wire", "description": " Dr. Nicole Delépine | Caution is required with all experimental treatments, and even more so when it's a technology never used before in what is supposed to be a ‘fight’ against a viral pandemic.", "url": "https://21stcenturywire.com/2021/12/06/is-there-a-link-between-cancer-and-covid-19-vaccine/", "site_name": "21st Century Wire", "article:publisher": "http://www.facebook.com/pages/21st-Century-Wire/182032255155419", "article:published_time": "2021-12-06T14:06:11+00:00", "article:modified_time": "2021-12-07T23:52:26+00:00", "image": "https://21stcenturywire.com/wp-content/uploads/2021/12/Cancer-cells.png", "image:type": "image/png"}, "tags": ["COVID 19", "Cancer", "Vaccines"], "tweets": [], "movies": [], "links": ["https://www.globalresearch.ca/the-incidence-of-cancer-triggered-by-the-covid-19-vaccine/5758110", "http://www.docteurnicoledelepine.fr/", "http://ametist.org/", "https://www.flickr.com/photos/nihgov/24149024512", "https://childrenshealthdefense.org/defender/vaers-cdc-covid-vaccine-injuries-deaths-fda-third-pfizer-shot/?itm_term=home", "https://docteur.nicoledelepine.fr/les-simulations-alibi-truque-de-la-vaccination-extorquee-aux-enfants/", "https://www.kbv.de/html/2021_54465.php", "https://docteur.nicoledelepine.fr/retour-sur-la-manipulation-via-des-simulations-au-cours-de-la-plandemie-covid/", "https://swprs.org/covid-vaccines-and-cancer/", "https://www.europereloaded.com/the-testimonies-project-israeli-jab-victims-speak-out-video/", "https://www.europereloaded.com/the-testimonies-project-israeli-jab-victims-speak-out-video/", "https://profidecatholica.com/2021/09/29/le-docteur-ryan-cole-constate-une-recrudescence-de-cas-de-cancers-comme-jamais-auparavant-video/", "https://nouveau-monde.ca/cancers-et-vaccins-anti-covid/", "https://21stcenturywire.com/ads/surfshark-vpn-for-in-content/", "https://21stcenturywire.com/tag/vaccines", "https://21w.co/support", "https://www.facebook.com/sharer.php?u=https%3A%2F%2F21stcenturywire.com%2F2021%2F12%2F06%2Fis-there-a-link-between-cancer-and-covid-19-vaccine%2F", "https://twitter.com/intent/tweet?text=Is%20There%20a%20Link%20Between%20Cancer%20and%20COVID-19%20%E2%80%98Vaccine%E2%80%99%3F&url=https://21stcenturywire.com/2021/12/06/is-there-a-link-between-cancer-and-covid-19-vaccine/&via=21stCenturyWire"], "authors": ["NEWS WIRE"], "publish_date": "2021-12-06T14:06:11+00:00"}