{"result_id": "004002", "URL": "https://369news.net/2019/06/19/urgent-breaking-news-that-effect-us-all/", "timestamp": "2023-04-25 11:45:27 CEST+0200", "meta": {"description": "New York State following California, lost there right to “Religious Exemptions” that protected our right to choose when, how many, and if you wanted to vaccinate your child.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/369news.net/wp-content/uploads/2018/03/cropped-369-3.png?fit=32%2C32&ssl=1", "canonical": "https://369news.net/2019/06/19/urgent-breaking-news-that-effect-us-all/", "encoding": "UTF-8"}, "image": null, "domain": "369news.net", "title": "Urgent Breaking News that Effect Us All !!!", "cleaned_text": "New York State following California, lost there right to “Religious Exemptions” that protected our right to choose when, how many, and if you wanted to vaccinate your child.\n\nNew York State following California, lost there right to “Religious Exemptions” that protected\n\n our right to choose when, how many, and if you wanted to vaccinate your child. The right a\n\n woman has to choose what to do with her body, and unborn child applies. However, this choice\n\n does not apply with your live child. My body my choice except with vaccines.\n\nThere are several other Bills on the table as well that may pass. Bill to vaccinate all adults. Bill\n\n for insurance companies to collect all vaccine records of every citizen. If these two Bills pass as\n\n well, then it is check mate. If you’re not educated on what vaccines consist of what chemicals\n\n and heavy metal ingredients, along with the side effects they cause, both short term, and long\n\n term then you owe it to yourself and your loved ones to do so.\n\nThere are currently many law suits against the state of New York. One of the biggest is Robert F\n\n Kennedy Jr, and his legal team. If the people of New York loose this lawsuit then all states will\n\n follow, and it will be a full blown communist country over night. We should all fight for our\n\n rights and donate to his cause for the future of humanity.\n\nIn addition, there is a US Navy ship quarantined for over a month because of a Mump outbreak\n\n onboard. The latest breaking news on this, is the US Navy acknowledges MMR vaccine caused\n\n viral mumps outbreak!\n\nHPV which has been banned in France for about a decade due to all the deaths and injuries it\n\n caused, is legal, and mandated here in the US. A sexually naïve girl tested positive for HPV after\n\n Gardasil vaccine. Merck and FDA confirmed no HPV DNA in Gardasil.\n\nDr. Sin Lee tested a sealed vial and found HPV DNA. 16 more sealed Gardasil vials were tested\n\nfrom Australia, and India to France, and US. HPV DNA in everyone!\n\nAll Democratic states have these bills, and more in motion! Please see link below for all Bills\n\n passed by state along with descriptions, dates, and where they currently stand.\n\nIf the Democratic states successfully take these fundamental rights away from us with there\n\n false propaganda, and we loose presidential election to Democrats along with 5G\n\n implementation, simply intended to radiate us to death – then it’s the endgame and there will\n\n be a revolution.\n\nPennsylvania Republican lawmakers canceled a vote Tuesdays on proposed legislation that\n\n would make it easier and cheaper for wireless carriers to blanket cities, towns, and rural areas\n\n with thousands of small cell antennas on utility poles for 4G and next –generation 5G wireless\n\n services.\n\nThe Capitol of Washington D.C. has legislation protecting it from 5G implementation.\n\n So you see that we can unify and legally take action successfully.\n\nThe Wi-Fi we currently have along with the 5G implementation of these radiation frequencies\n\n will interact with the heavy metals in these vaccines – frying us from the inside out. Just as their\n\n microwave beam 5G test satellites then sent into the upper atmosphere last year, which caused\n\n all the fires in California. 1200 homes burnt from the inside out, leaving trees with complete\n\n foliage in between homes. These satellite connect with the cell towers that connect with our\n\n home routers and smart meters!!! It’s a “smart” telecommunication system.\n\nWe need to wake up and take back our power from the elite monarchs that delegate their\n\n powers to there paid politicians, that carry out their agendas for us. That’s how the system\n\n really works, sadly for thousands of years.\n\nThe Santa Fe Alliance for Public Health and Safety filed a lawsuit to stop 5G in U.S. District\n\n Court in New Mexico on December 21, 2018. We are asking the court to declare that city, state,\n\n and federal laws which deprive citizens of the right to protect themselves from harm, and\n\n deprive injured persons of any remedy for their injuries, are unconstitutional and void.\n\nThese laws violate the First Amendment rights to free speech and to petition the government\n\n for redress of grievances. These laws violate the Fifth and Fourteenth Amendments because\n\n they deprive people of life, liberty and property without due process of law, and because they\n\n are a taking of property without just compensation. Our First Amended Complaint can be seen\n\n here: http://www.cellphonetaskforce.org/wp-content/uploads/2019/01/Doc-19-First-\n\n Amended-Complaint.pdf.\n\nSignatures as of June 6, 2019\n\n \n\n These are the approximate numbers of people to date who have signed the International\n\n Appeal to Stop 5G on Earth and in Space:\n\n 2,000 scientists\n\n 1,400 medical doctors\n\n 4,000 engineers\n\n 2,200 nurses\n\n 2,500 psychologists\n\n 1,200 organizations\n\n 100,000 total individuals and organizations from 187 countries.\n\n \n\n Please Circulate the Appeal\n\nIt is time to push this Appeal hard. Please send the Appeal (www.5gSpaceAppeal.org), and also\n\n forward this email, to everyone you know. Every person on Earth has a stake in our future. We\n\n need as many signatures from as many different kinds of people as possible.\n\n While we were working on the website, some people had problems accessing the signature\n\n form. That is now fixed, and everybody should be able to sign. Please do not sign more than\n\n once. If you sign for the first time now, your name will appear on the website within a few days.\n\n If you signed between December and April, your name will be appear on the list within a few\n\n weeks. Signatures are now processed automatically, but I still have to review all the\n\n submissions before making them live. I am working as fast as I can to keep up.\n\n \n\n Donations Are Needed\n\n \n\n Donations are needed to support every aspect of this work — the federal lawsuit, the\n\n International Appeal to Stop 5G on Earth and in Space, a media campaign, lobbyists to present\n\n the Appeal to governments, etc. I need a secretary and a bookkeeper. Donations can be made\n\n on the Appeal website and are tax-deductible for U.S.\n\ncitizens: https://www.5gspaceappeal.org/donate. For large donations or stock transfers, please\n\n contact me. A big thank you to those who have already contributed.\n\nThis work is also supported by sales of my book, The Invisible Rainbow: A History of Electricity\n\n and Life (AGB Press 2017). It gives the background history and science that is necessary in order\n\n to understand what is happening today. It is the first book ever published that tells the history\n\n of electricity from an environmental point of view. It is available for sale\n\n here: http://www.cellphonetaskforce.org/buy-the-invisible-rainbow. All proceeds go into the\n\n effort to stop 5G.\n\nPlease review links and share information far, and wide. This is a silent weapons used in a silent\n\n war.\n\nArthur Firstenberg, Administrator\n\n International Appeal to Stop 5G on Earth and in Space", "opengraph": {"locale": "en_US", "type": "article", "title": "Urgent Breaking News that Effect Us All !!! - 369news.net", "description": "New York State following California, lost there right to “Religious Exemptions” that protected our right to choose when, how many, and if you wanted to vaccinate your child.", "url": "https://369news.net/2019/06/19/urgent-breaking-news-that-effect-us-all/", "site_name": "369news.net", "article:publisher": "https://www.facebook.com/369UNIVERSE/", "article:tag": "Health", "article:section": "HEALTH", "updated_time": "2020-01-12T15:48:37+00:00", "image": "https://i0.wp.com/369news.net/wp-content/uploads/2019/06/p07djl2n.jpg", "image:secure_url": "https://i0.wp.com/369news.net/wp-content/uploads/2019/06/p07djl2n.jpg", "image:width": "720", "image:height": "405", "image:alt": "Breaking News", "image:type": "image/jpeg", "article:published_time": "2019-06-19T12:44:39+00:00", "article:modified_time": "2020-01-12T15:48:37+00:00"}, "tags": ["Health"], "tweets": [], "movies": [], "links": ["https://www.addtoany.com/add_to/reddit?linkurl=https%3A%2F%2F369news.net%2F2019%2F06%2F19%2Furgent-breaking-news-that-effect-us-all%2F&linkname=Urgent%20Breaking%20News%20that%20Effect%20Us%20All%20%21%21%21", "https://www.addtoany.com/add_to/tumblr?linkurl=https%3A%2F%2F369news.net%2F2019%2F06%2F19%2Furgent-breaking-news-that-effect-us-all%2F&linkname=Urgent%20Breaking%20News%20that%20Effect%20Us%20All%20%21%21%21", "https://www.addtoany.com/share", "https://369news.net/2019/06/19/urgent-breaking-news-that-effect-us-all/?share=telegram", "https://369news.net/2019/06/19/urgent-breaking-news-that-effect-us-all/?share=facebook", "https://369news.net/2019/06/19/urgent-breaking-news-that-effect-us-all/?share=twitter", "https://369news.net/2019/06/19/urgent-breaking-news-that-effect-us-all/?share=pinterest", "https://369news.net/2019/06/19/urgent-breaking-news-that-effect-us-all/?share=reddit", "https://369news.net/2019/06/19/urgent-breaking-news-that-effect-us-all/?share=jetpack-whatsapp", "mailto:?subject=%5BShared%20Post%5D%20Urgent%20Breaking%20News%20that%20Effect%20Us%20All%20%21%21%21&body=https%3A%2F%2F369news.net%2F2019%2F06%2F19%2Furgent-breaking-news-that-effect-us-all%2F&share=email", "https://369news.net/2018/07/07/increasing-human-energy-by-harnessing-the-suns-energy-according-to-nikola-tesla/"], "authors": [], "publish_date": "2019-06-19T12:44:39+00:00"}