{"result_id": "005023", "URL": "https://911truth.org/fbi-lab-reports-on-anthrax-attacks-suggest-another-miscue/", "timestamp": "2023-04-25 11:45:59 CEST+0200", "meta": {"description": "Buried in FBI lab reports about the anthrax attacks that killed five in 2001 is data suggesting expertise beyond that of the presumed killer.", "lang": "en", "keywords": "", "favicon": "https://911truth.org/wp-content/uploads/Liberty-head-icon.png", "canonical": "https://911truth.org/fbi-lab-reports-on-anthrax-attacks-suggest-another-miscue/", "encoding": "UTF-8"}, "image": null, "domain": "911truth.org", "title": "FBI lab reports on anthrax attacks suggest another miscue", "cleaned_text": "Originally published at McClatchy Newspapers by Greg Gordon on 5/20/11\n\nWASHINGTON — Buried in FBI laboratory reports about the anthrax attacks that killed five people in 2001 is data suggesting that a chemical may have been added to try to heighten the powder’s potency, a move that some experts say exceeded the expertise of the presumed killer.\n\nThe lab data, contained in more than 9,000 pages of files that emerged a year after the Justice Department closed its inquiry and condemned the late Army microbiologist Bruce Ivins as the perpetrator, shows unusual levels of silicon and tin in anthrax powder from two of the five letters.\n\nThose elements are found in compounds that could be used to weaponize the anthrax, enabling the lethal spores to float easily so they could be readily inhaled by the intended victims, scientists say.\n\nThe existence of the silicon-tin chemical signature offered investigators the possibility of tracing purchases of the more than 100 such chemical products available before the attacks, which might have produced hard evidence against Ivins or led the agency to the real culprit.\n\nMore at The Real News\n\nBut the FBI lab reports released in late February give no hint that bureau agents tried to find the buyers of additives such as tin-catalyzed silicone polymers.\n\nThe apparent failure of the FBI to pursue this avenue of investigation raises the ominous possibility that the killer is still on the loose.\n\nA McClatchy analysis of the records also shows that other key scientific questions were left unresolved and conflicting data wasn’t sorted out when the FBI declared Ivins the killer shortly after his July 29, 2008, suicide.\n\nOne chemist at a national laboratory told McClatchy that the tin-silicone findings and the contradictory data should prompt a new round of testing on the anthrax powder.\n\nA senior federal law enforcement official, who was made available only on the condition of anonymity, said the FBI had ordered exhaustive tests on the possible sources of silicon in the anthrax and concluded that it wasn’t added. Instead, the lab found that it’s common for anthrax spores to incorporate environmental silicon and oxygen into their coatings as a “natural phenomenon” that doesn’t affect the spores’ behavior, the official said.\n\nTo arrive at that position, however, the FBI had to discount its own bulk testing results showing that silicon composed an extraordinary 10.8 percent of a sample from a mailing to the New York Post and as much as 1.8 percent of the anthrax from a letter sent to Democratic Sen. Patrick Leahy of Vermont, far more than the occasional trace contamination. Tin — not usually seen in anthrax powder at all — was measured at 0.65 percent and 0.2 percent, respectively, in those letters.\n\nAn FBI spokesman declined to comment on the presence of tin or to answer other questions about the silicon-tin connection.\n\nSeveral scientists and former colleagues of Ivins argue that he was a career biologist who probably lacked the chemistry knowledge and skills to concoct a silicon-based additive.\n\n“There’s no way that an individual scientist can invent a new way of making anthrax using silicon and tin,” said Stuart Jacobsen, a Texas-based analytical chemist for an electronics company who’s closely studied the FBI lab results. “It requires an institutional effort to do this, such as at a military lab.”\n\nMartin Hugh-Jones, a world-renowned anthrax expert who teaches veterinary medicine at Louisiana State University, called it “just bizarre” that the labs found both tin — which can be toxic to bacteria such as anthrax during lab culturing — and silicon.\n\n“You have two elements at abnormally high levels,” Hugh-Jones said. “That reduces your probability to a very small number that it’s an accident.”\n\nThe silicon-tin connection wasn’t the only lead left open in one of the biggest investigations in FBI history, an inquiry that took the bureau to the cutting edge of laboratory science. In April, McClatchy reported that after locking in on Ivins in 2007, the bureau stopped searching for a match to a unique genetic bacterial strain scientists had found in the anthrax that was mailed to the Post and to NBC News anchor Tom Brokaw, although a senior bureau official had characterized it as the hottest clue to date.\n\nFBI officials say it’s all a moot point, because they’re positive they got the right man in Ivins. A mentally troubled anthrax researcher at the U.S. Army Medical Research Institute of Infectious Diseases at Fort Detrick, Md., Ivins overdosed on drugs not long after learning that he’d soon face five counts of capital murder.\n\nIn ending the inquiry last year, the Justice Department said that a genetic fingerprint had pointed investigators to Ivins’ lab, and gumshoe investigative techniques enabled them to compile considerable circumstantial evidence that demonstrated his guilt.\n\nAmong these proofs, prosecutors cited Ivins’ alleged attempt to steer investigators away from a flask of anthrax in his lab that genetically matched the mailed powder — anthrax that had been shared with other researchers. They also noted his anger over a looming congressional cut in funds for his research on a new anthrax vaccine.\n\nHowever, the FBI never found hard evidence that Ivins produced the anthrax or that he scrawled threatening letters seemingly meant to resemble those of Islamic terrorists. Or that he secretly took late-night drives to Princeton, N.J., to mail them.\n\nThe FBI declared Ivins the killer soon after paying $5.8 million to settle a suit filed by another former USAMRIID researcher, Steven Hatfill, whom the agency mistakenly had targeted earlier in its investigation.\n\nAnthrax is one of the deadliest and most feared biological weapons. Once inhaled, microscopic anthrax spores germinate into rapidly multiplying, highly toxic bacteria that attack human tissue. The resulting illnesses are lethal within days if untreated.\n\nThe letters, mailed just weeks after the Sept. 11 terrorist attacks, not only went to the New York Post, Leahy and Brokaw, but also to American Media Inc. in Boca Raton, Fla., and to Democratic then-Sen. Tom Daschle of South Dakota. Five people died, 17 were sickened and about 31,000 were forced to take powerful antibiotics for weeks. Crews wearing moon suits spent several weeks eradicating the spores from a Senate office building and a central Postal Service facility in Washington.\n\nThe FBI guarded its laboratory’s finding of 10.8 percent silicon in the Post letter for years. New York Democratic Rep. Jerrold Nadler asked FBI Director Robert Mueller how much silicon was in the Post and Leahy letters at a hearing before the House Judiciary Committee in September 2008. The Justice Department responded seven months later that silicon made up 1.4 percent of the Leahy powder (without disclosing the 1.8 percent reading) and that “a reliable quantitative measurement was not possible” for the Post letter.\n\nThe bureau’s conclusions that silicon was absorbed naturally drew a gentle challenge in February from a panel of the National Academy of Sciences, which evaluated the investigation’s lab work.\n\nWhile finding no evidence that silicon had been added to the mailed anthrax, the panel noted deep in its report that the FBI had provided “no compelling explanation” for conflicts in silicon test results between the Sandia National Laboratories and its own lab.\n\nSandia — which used electron microscopes, unlike the FBI — reported only a tenth as much silicon in the New York Post letter as the bureau’s lab did. Sandia said it was all embedded in the spore coatings, where it wasn’t harmful.\n\nThe Armed Forces Institute of Pathology ran a third set of tests and found pockets of heavy silica concentrations, but it couldn’t say whether they were inside or outside the spores.\n\nJacobsen, the Texas chemist, suspects that the silica pockets represented excess material that went through a chemical reaction and hardened before it could penetrate the spores.\n\nThe National Academy of Sciences panel wrote that the varying composition of the powder might have accounted for the differing findings.\n\nWhile finding no evidence that silicon was added, the panel said it “cannot rule out the intentional addition of a silicon-based substance … in a failed attempt to enhance dispersion” of the New York Post powder.\n\nTufts University chemistry professor David Walt, who led the panel’s analysis of the silicon issue, said in a phone interview that “there was not enough silicon in the spores that could account for the total silicon content of the bulk analysis.”\n\nHe said it was unclear whether the “trace” levels of tin were significant.\n\nDuring the FBI’s seven-year hunt, the Department of Homeland Security commissioned a team of chemists at the Lawrence Livermore National Laboratory in California to grow anthrax-like spores under varying conditions to see how much silicon would end up naturally in the final product.\n\nThey found little, if any, silicon in most cases, far less than was in the New York Post letter, said Stephan Velsko, one of the two researchers. He called the tin readings from the FBI’s anthrax data “baffling.”\n\nPeter Weber, Velsko’s co-researcher, said the academy panel’s focus on the conflicting data “raises a big question,” and “it’d be really helpful for closure of this case if that was resolved.”\n\nHe suggested that further “micro-analysis” with a highly sophisticated electron microscope could “pop the question marks really quickly.”\n\nIn a chapter in a recently updated book, “Microbial Forensics,” Velsko wrote that the anthrax “must have indeed been produced under an unusual set of conditions” to create such high silicon counts. That scenario, he cautioned, might not be “consistent with the prosecution narrative in this case.”\n\nAbout 100 tin-catalyzed silicone products are on the market, and an even wider array was available in 2000 and 2001, before the mailings, said Richie Ashburn, a vice president of one manufacturer, Silicones Inc., in High Point, N.C.\n\nMike Wilson, a chemist for another silicone products maker, SiVance, in Gainesville, Fla., said that numerous silicon products could be used to make spores or other particles water-repellent. He also said that the ratios of silicon to tin found in the Post and Leahy samples would be “about right” if a tin-catalyzed silicone had been added to the spores.\n\nJacobsen, a Scottish-born and -educated chemist who once experimented with silicon coatings on dust particles, said he got interested in the spore chemistry after hearing rumors in late 2001 that a U.S. military facility had made the killer potions. He called it “outrageous” that the scientific issues haven’t been addressed.\n\n“America, the most advanced country in the world, and the FBI have every resource available to them,” he said. “And yet they have no compelling explanation for not properly analyzing the biggest forensic clue in the most important investigation the FBI labs had ever gotten in their history.”\n\nAs a result of Ivins’ death and the unanswered scientific issues, Congress’ investigative arm, the Government Accountability Office, is investigating the FBI’s handling of the anthrax inquiry.", "opengraph": {"locale": "en_US", "type": "article", "title": "FBI lab reports on anthrax attacks suggest another miscue - 911Truth.Org", "description": "Buried in FBI lab reports about the anthrax attacks that killed five in 2001 is data suggesting expertise beyond that of the presumed killer.", "url": "https://911truth.org/fbi-lab-reports-on-anthrax-attacks-suggest-another-miscue/", "site_name": "911Truth.Org", "article:published_time": "2011-05-21T07:35:02+00:00", "article:modified_time": "2019-04-25T06:57:31+00:00", "image": "https://911truth.org/wp-content/uploads/anthrax-letters.jpg", "image:width": "300", "image:height": "198", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.mcclatchydc.com/2011/05/19/114467/fbi-lab-reports-on-anthrax-attacks.html", "http://therealnews.com/"], "authors": ["", "Staff"], "publish_date": "2011-05-21T07:35:02+00:00"}