{"result_id": "005019", "URL": "https://911truth.org/the-u-s-government-is-the-real-bioterror-threat/", "timestamp": "2023-04-25 11:45:53 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://911truth.org/wp-content/uploads/Liberty-head-icon.png", "canonical": "https://911truth.org/the-u-s-government-is-the-real-bioterror-threat/", "encoding": "UTF-8"}, "image": null, "domain": "911truth.org", "title": "The U.S. Government Is the Real Bioterror Threat", "cleaned_text": "Assuming the federal government has, after almost seven years, finally identified\n\n the perpetrator of the anthrax attacks in 2001–admittedly a generous assumption\n\n given that for most of those years, it pursued, hounded, embarrassed, and ruined\n\n the career of the wrong man–larger dangers remain. As is normally the\n\n case with issues surrounding terrorism, the average citizen will probably be\n\n shocked to learn that their government is often a bigger threat than the terrorists.\n\n Remember the CIA’s creation of the 9/11 threat by supporting the most\n\n radical Islamist groups fighting the Soviets in Afghanistan during the 1980s\n\n and then the U.S. government’s provocation of terrorist attacks from those\n\n same militants by its non-Islamic military presence in Islamic Persian Gulf\n\n countries in the 1990s, which had continued unnecessarily subsequent to the\n\n first Gulf War.\n\nSimilarly, in the case of bioterrorism, the threat from the government is greater\n\n than from foreign groups such as al Qaeda. Although U.S. intelligence has created\n\n fear among the U.S. public by saying that al Qaeda has made efforts to obtain\n\n biological weapons, the capabilities of small terrorist groups to make, handle,\n\n weaponize, and disperse biological agents is very limited. Even Aum Shinrikyo,\n\n a well-funded Japanese terrorist group that hired Ph.D. scientists, could not\n\n successfully carry out a biological weapons attack. (Even their chemical attacks,\n\n which are technologically easier to accomplish, were ham-handed and did not\n\n result in mass deaths.) The sophisticated weaponization and dispersion of biological\n\n agents are difficult for technologically challenged and relatively poor terrorist\n\n groups to master; they usually require the resources and technology of governments.\n\nWhether Bruce Ivins, a government bioscientist, is the real culprit in the\n\n anthrax attacks or not, it seems that the FBI has traced the perpetrator to\n\n the U.S. government’s own research facility, which has plenty of people\n\n qualified to carry out such an attack. And apparently some employees would have\n\n a motive to do so. The FBI insinuated that Ivins had a motive because his anthrax\n\n vaccine research program was in trouble. What better way to get more money for\n\n your project that to generate a non-hypothetical threat to combat?\n\nIt’s true that the vast majority of people on the government’s\n\n payroll working on lethal biological agents would not stoop to perpetrate such\n\n a heinous crime. Yet the 9/11 attacks and the anthrax attacks the same year\n\n had the effect that Ivins allegedly desired. An avalanche of government funding\n\n went into countering the minimal threat from a terrorist group capable of using\n\n biological weapons. To capture some of the governmental windfall, many medical\n\n and infectious disease programs tried to tie their efforts to battling bioterrorism.\n\n It worked.\n\nBefore 9/11, only five laboratories existed that were equipped to study the\n\n most lethal bioagents—biosafety level 4 labs. Now there are fifteen in\n\n operation or being built. Combined, there are now 400 biosafety 3 and 4 facilities,\n\n which can produce lethal anthrax. In all, nationwide, 14,000 scientists can\n\n work on such lethal biological agents, many of which are researchers at non-governmental\n\n universities.\n\nAccording to experts, security at such facilities is lax; the government merely\n\n requires them to have locked doors but no video surveillance. And government\n\n background checks of employees would not prevent a person who had homicidal\n\n tendencies or a sociopathic personality—allegedly exhibited by Ivins—from\n\n working in them. Even if Ivins is not the perpetrator of the anthrax attacks,\n\n he made homicidal threats to a therapist a year before the attacks and was allowed\n\n to continue to work in a lab with dangerous bioagents for years after he exhibited\n\n mental problems. (Not to mention that the FBI seems to have ignored such information\n\n for years while erroneously pursuing an innocent suspect.)\n\nThus, to combat a minimal bioterror threat from ragtag terrorist groups, the\n\n government has actually dramatically increased the probability of another bioattack\n\n from a trained scientist—whether because of malicious criminal intent,\n\n mental illness, or a desire to increase funding for his or her antidote or vaccine\n\n program—who could competently carry out such an attack. This counterproductive\n\n effect resembles what the government did to remedy coordination problems among\n\n security agencies that caused a failure to detect and prevent the 9/11 attacks:\n\n its creation of the Department of Homeland Security and reorganization of the\n\n intelligence community added more bureaucracy, thus making coordination even\n\n more difficult. In short, the anthrax case illustrates few security problems\n\n exist that the government doesn’t create or make worse.\n\nIvan Eland is Director of the Center on Peace & Liberty at The Independent\n\n Institute. Dr. Eland is a graduate of Iowa State University and received an\n\n M.B.A. in applied economics and Ph.D. in national security policy from George\n\n Washington University. He has been Director of Defense Policy Studies at the\n\n Cato Institute, and he spent 15 years working for Congress on national security\n\n issues, including stints as an investigator for the House Foreign Affairs Committee\n\n and Principal Defense Analyst at the Congressional Budget Office. He is author\n\n of the books, The Empire Has No Clothes: U.S. Foreign Policy Exposed, and Putting “Defense” Back into U.S. Defense", "opengraph": {"locale": "en_US", "type": "article", "title": "The U.S. Government Is the Real Bioterror Threat - 911Truth.Org", "description": "August 8, 2008 Ivan Eland Independent Institute Assuming the federal government has, after almost seven years, finally identified the perpetrator of the anthrax attacks in 2001–admittedly a generous assumption given that for most of those years, it pursued, hounded, embarrassed, and ruined the career of the wrong man–larger dangers remain. As is normally the case […]", "url": "https://911truth.org/the-u-s-government-is-the-real-bioterror-threat/", "site_name": "911Truth.Org", "article:published_time": "2008-08-12T14:38:35+00:00", "article:modified_time": "2012-09-29T05:22:14+00:00"}, "tags": ["Afghanistan"], "tweets": [], "movies": [], "links": ["http://www.independent.org/newsroom/article.asp?id=2288", "http://www.independent.org/research/copal/", "http://www.independent.org/store/book_detail.asp?bookID=74", "http://www.independent.org/store/book_detail.asp?bookID=19", "http://www.independent.org/newsroom/article.asp?id=2288"], "authors": ["", "Staff"], "publish_date": "2008-08-12T14:38:35+00:00"}