{"result_id": "005020", "URL": "https://911truth.org/breaking-through-wall-of-police-protection-for-international-crime/", "timestamp": "2023-04-25 11:45:55 CEST+0200", "meta": {"description": "When Splitting the Sky broke through police lines in his attempt to conduct a citizen's arrest of former US President, George W. Bush, the Mohawk Freedom Fighter pierced a thick wall of tyranny.", "lang": "en", "keywords": "", "favicon": "https://911truth.org/wp-content/uploads/Liberty-head-icon.png", "canonical": "https://911truth.org/breaking-through-wall-of-police-protection-for-international-crime/", "encoding": "UTF-8"}, "image": null, "domain": "911truth.org", "title": "Breaking Through Wall of Police Protection for International Criminals", "cleaned_text": "The Trial of Splitting the Sky as a Trial of the Cheney-Bush-Rumsfeld Cabal of War Profiteers\n\nby Anthony J. Hall,\n\n Professor of Globalization Studies, University of Lethbridge, Alberta, Canada\n\n December 3rd, 2009\n\n printable version (pdf)\n\nWho and what is on trial ?\n\nWhen Splitting the Sky broke through police lines in his attempt to conduct a citizen’s arrest of former US President, George W. Bush, the Mohawk Freedom Fighter pierced a thick wall of tyranny. He broke through a tight phalanx of state protection for the perpetrators of War Crimes, Crimes Against Humanity, and Crimes Against the Peace.\n\nWith his courageous act, Splitting the Sky announced the unwillingness of millions of global citizens to tolerate any longer the culture of impunity that places a small, interlinked global plutocracy above the law. By breaking police lines, the Attica Brother and American Indian Movement activist scouted a route of liberation for those of us seeking to get out from under the weight of complicity in International Crime committed in our name. We are all deeply implicated in the state terror permeating the 9/11wars because it is our tax dollars that fund these imperial assaults.\n\nSplitting the Sky’s action in Calgary highlights the abject failure of law enforcement agencies to do their job. It highlights the unwillingness of police and those who direct them to apply the law equitably and independently.\n\nWhen he broke through police lines last march, Splitting the Sky built on the message of Muntadarar al-Zaidi, the Baghdad journalist who fired his shoes at the departing US President. Al-Zaidi’s symbolic shot was seen and applauded around world. By dramatizing the role of so-called law enforcers as protectors of international crime, Splitting the Sky highlighted that many millions of global citizens have seen more than enough evidence to understand that George W. Bush and his war cabinet are credibly accused war criminals. If we lived in a world where the integrity of law prevailed over the power of money, political corruption and military might, the Cheney-Rumsfeld-Bush Syndicate of War profiteers would have been apprehended long ago to face charges in a properly constituted Court of International Law.\n\nWhen Splitting the Sky presents himself this coming march to a Provincial Court in Calgary Alberta to face a criminal charge for Obstruction of Justice, who and what is really on trial? Whose sense of justice was really obstructed? I predict that the light of future history will cast the trial of Splitting the Sky as an important point of departure for a process of people’s jurisprudence directed at bringing to justice those responsible for the highest order of International Crime.\n\nThe trial of Splitting the Sky calls attention to the partnership linking Barack Obama’s presidency to the Cheney-Bush-Rumsfeld brand of organized crime headquartered in the military superpower’s apparatus of so-called National Security. It highlights the current US President’s expansion of his predecessor’s policies of aggressive warfare aimed at appropriating natural resources from Indigenous peoples the world over. Conducted in the name of an implausible official interpretation of what transpired on September 11, 2001, the ongoing 9/11 wars widen and accelerate the imperial onslaught that has gathered force ever since Christopher Columbus initiated a new world order in 1492.\n\nThe trial of Splitting the Sky places a spotlight on the ruthless of state terror as manifest in torture, genocide, and aggressive warfare. more than six decades ago the judges sentencing the convicted Nazi war criminals at Nuremberg deemed that aggressive warfare constitutes the supreme crime against the entire human family because it encompasses such a broad array of tributary international crimes.\n\nThe police lines that Splitting the Sky briefly breached in Calgary Alberta were set up to protect the person whose blood-soaked hands signed the executive orders for an orgy of state-sponsored criminality. Thus the Calgary Police Force, the RCMP and those that direct them chose to make themselves, as well their agencies, accomplices in horrific crimes – crimes that have transformed words like Abu Ghraib, Guantánamo Bay, Bagram, Dark Sites, Black Sites, Ghost Prisoners and Extraordinary Rendition into household phrases.\n\nAs the Nuremberg Principles make clear, the implicated law enforcement officers cannot claim in their defense that they were merely following orders in deciding to arrest Splitting the Sky rather than George W. Bush. Who gave the police their orders? What was the chain of command? What was the content of the directives given the police? The Crown Prosecutors have a responsibility to make public this crucial information in presenting their case against Splitting the Sky.\n\nWhy did George W. Bush and his handlers choose Calgary, Alberta as the site of the former Commander in Chief’s first major speaking engagement after leaving the us presidency? Calgary is a key colonial capital of the Texas-based oil and gas empire that resides at the very core of the world’s most powerful Military-Industrial Complex.\n\nCalgary is the political heartland of the Minority Government of Canadian Prime Minister Stephen Harper. Harper’s ascent to power was as the Canadian franchise holder of the Bush brand of Neocon governance whose machinations regularly subordinate the rule to law to jack-booted displays of law and order. This Neocon approach has seen officers of the Canadian government hand over civilians convicted of nothing to the Afghani puppet regime for certain torture. As illustrated by the treatment of Omar Khadr, the lawlessness of the current Canadian government makes Harper and Bush partners in victimizing child soldiers contrary to many international treaties.\n\nA major sponsor of Bush’s talk in Calgary was the Bennett Jones law firm, one of the key agencies engaged in the fire sale of western Canada’s natural resources. the foreign colonization of Alberta’s resources often takes place in complete defiance of Canada’s constitutional affirmation of Aboriginal and Treaty Rights.\n\nWill the Alberta judiciary’s handling of Splitting the Sky’s trial continue the slide of my home province away from the sovereignty of Canada? Will the court extend Splitting the Sky a fair trial or will the judge railroad the accused at the behest of political masters in Washington, Dallas, Houston, Ottawa and Calgary? Will Splitting the Sky’s right to present a full defense be respected? Or will the judge demean his or her court to decide, say, that George Bush’s real or imagined “misdeeds” have no place in the proceedings.\n\nWill the Provincial Court of Alberta rise to the responsibilities invested in this instrument of Canadian sovereignty? Or will the trial of Splitting the Sky take place in a kangaroo court putting on full display Calgary’s colonial function in the American Empire? Will the court encourage, embrace and even demand a full airing of the real legal issues inherent in the decisions made by Splitting the Sky and those of the police officers that arrested him? Will it illuminate or obfuscate the responsibility of citizens when we see agents of the law unwilling to enforce statutes like Canada’s Crimes Against Humanity and War Crimes Act? Is Canada’s international reputation to be that of a haven for the most recent crop of credibly accused War Criminals?\n\nWhatever happens with the Crown’s trial, Calgary will be the site of a people’s process aimed at delivering some measure of justice in a world too often starved of it. Among those who have agreed to take part in both the Crown’s and the people’s processes are Ramsey Clark and Cynthia McKinney. A former Attorney General of the United States, Ramsey Clark has a long history of representing Splitting the Sky as his lawyer. This history began when prominent figures in the United States intervened to cover up the lies and crimes of the Attica prison debacle of 1971. This event changed Splitting the Sky’s life forever.\n\nIn the US election of 2008 Cynthia McKinney ran as the Green Party’s candidate. She is widely recognized as an inheritor of the quest for domestic and international justice advanced in different ways by both martin Luther King Jr. and Malcolm X. Ms. McKinney served for four terms as a us Congresswoman representing a constituency in Georgia. She has stood bravely for the principle that Universal Human Rights extend to the Palestinian people. With her words and actions, Ms. McKinney epitomizes the necessary merger of the global Anti-War Coalition and the international movement of those committed to the quest for the truth of what really happened on September 11, 2001. In order to stop the otherwise never ending 9/11 wars, we must make reason and science prevail over fear mongering, superstition and disinformation in determining who was really responsible for the originating acts of the Global War on Terror.\n\nI propose that the convergence of events and personalities, character and circumstance, on the frontiers of so much contested power offers an important opening to a new era of juridical development. I propose that the trial of Splitting the Sky presents a platform for the elaboration of a new set of juridical rules and protocols to be known as the Calgary Principles.\n\nIt has been six decades since the UN General Assembly agreed to a succinct refinement of the principles that emerged from the trial of some of the top Nazis as well as their juridical, medical and industrialist accomplices. During those decades there has been an intensification of the culture of impunity that immunizes those at the top of the hierarchy of wealth and power from any legal accountability for their crimes.\n\nLike the Tokyo Trials of the defeated leadership of imperial Japan, the Nuremberg Trials were a classic example of “victors’ justice”. The trend that began in the aftermath of the Second World War has never been preempted. Again and again only those on the losing side of international conflicts face legal consequences for their crimes.\n\nEven the International Tribunal dealing with the Rwandan genocide of 1994 restricts its proceedings to dealing with the crimes of only one side in the conflict. Only Hutus are targeted for prosecution. The jurists empowered by the UN security council consistently veer away from any reckoning with the many serious crimes of Paul kagame’s Tutsi-dominated Rwandan Patriotic Front.\n\nWith Anglo-American backing channelled through Uganda, this Tutsi-dominated military force conquered its externally manipulated foes to become the core unit of the Rwandan armed forces. Kagame’s army was built up to become a key pillar of the Central African branch of the American Empire. this empire includes many Canadian mining companies, including Barrick Gold, that operate with warlord and child soldier protection in one of the most war-torn zones on the planet.\n\nThe immunity from prosecution of President Kagame’s Tutsi-dominated army contributes significantly to the ongoing genocide that plagues the people of the resource-rich Eastern Congo to this day. The inflicted deaths of millions of displaced and brutalized Congolese clears the way for illicit flows of blood diamonds, coltan, gold and soon oil. These operations, that expose the utter ruthlessness of imperial capital’s heart of darkness, epitomize the severity of the enforced lawlessness that enriches a few at the lethal expense of the many.\n\nThe inequities of victors’ justice were on full display last March 17 when the police decided to protect credibly accused war criminal George W. Bush and to arrest and incarcerate Splitting the Sky. Like a disproportionately large proportion of other native Americans and African Americans, Splitting the Sky has spent too much of his life locked up by the state.\n\nOn the other side of the ledger is George W. Bush. Bush epitomizes the class that is, with some few exceptions, above the law. In his life’s journeys Bush has drawn on the kind of privilege that is rooted in generations of colonization and conquest. The former US President accelerated these trajectories of violence and theft when he and Dick Cheney were at the controls of the most formidable war machine ever assembled.\n\nIn Calgary we saw close up the extraordinary protections regularly extended this “credibly accused” war criminal. In my view Bush as well as his patrons and clients will not be brought to trial until humanity finds a way to withdraw the license to kill afforded by the institutionalized inequities of victors’ justice.\n\nA core precept of the Calgary Principles, therefore, must deal with the need to move beyond the kind of victors’ justice that became institutionalized following the second world war. A central principle of the rule of law is the need to enforce its authority equitably and uniformly. This basic principle must be made to apply to those who commit the highest order of international crime, no matter whether they are on the winning or losing side of international or domestic conflicts.\n\nAs long as the power politics of victors’ justice continues to protect the likes of George W. Bush and Richard Cheney, the rule of law remains a fraud. Under present conditions the rule of law is a sad hoax designed to disguise the role of law enforcement agencies as protectors of the ill-gotten wealth often stripped from the branches of humanity that Franz Fanon once labelled the wretched of the earth.\n\nThe elaboration of the Calgary principles will have to entail the quest for new language and juridical concepts to capture the full extent and complexity of International Crime in the Twenty-first Century. In moving this process forward we could do worse than to look for inspiration to the example set by the great Polish and Jewish jurist, Raphael Lemkin. In 1944 Lemkin coined the term “genocide” in an attempt to identify the outer extremes of the state terror then underway in Axis occupied Europe.\n\nLemkin’s juridical contribution was not the last word in the process of making International Law reflect the expanding scope of International Crime. In more recent decades the technology of mass destruction has become so much more powerful and many-faceted than it was in Lemkin’s day that we need new terms and procedures to deal with the moving frontiers of criminality.\n\nConsider, for instance, the nature of the crime that takes place when whole populations are sentenced to endless futures of disproportionately high rates of genetic deformity through the saturation of their mother lands with depleted uranium. Consider the nature of a crime that would see a drug company covertly introduce a new disease strain in order to market a prepared antidote or vaccine to cure the disease it had disseminated.\n\nWhat names, what prohibitions and what punishments do we need to respond to and discourage crimes that infect populations, deform populations, and even destroy whole ecosystems making the renewal of all kinds of life, including human life, impossible to sustain?\n\nThe makers of the Calgary principles will have to pay particular attention to the role of media conglomerates, public relations firms and public broadcasters in creating the psychological environment that allows international crime to thrive in the Age of Elite Immunity from Prosecution. The sophisticated propaganda of the global war on terror presents a text book example of how mainstream media venues often play major roles in the perceptual dehumanization of population groups whose natural resources are targeted for appropriation in aggressive war.\n\nWe saw a small sample of the role of mainstream media as thought police in the censorship that characterized most of the coverage of George W. Bush’s visit to Calgary the journalists assigned to cover the event almost uniformly directed attention away from Splitting the Sky’s attempt to conduct a citizen’s arrest of George w. Bush.\n\nThe trial of Khalid Sheik Mohamed (KSM) that will take place in New York City in the months ahead will help to establish the geopolitical framework for the formulation of the Calgary principles and the trial of Splitting the Sky. For many months key venues of the mainstream media have been advertising KSM as the so-called “mastermind” of the 9/11 attacks. After having been tortured dozens of times in us custody, the demented KSM apparently agrees with the label given him even as he boasts outlandishly of the role he has imagined for himself in many more alleged terrorist incidents.\n\nFor millions of observers who do not accept the official conspiracy theory of 9/11, KSM and those who will be tried with him are obvious patsies. KSM’s own history of double, triple and quadruple dealing illustrates that the history of al-Qaeda was internal, and remains internal, to that of the National Security State. The operatives of the National Security State once did their complex business transactions with their pet Islamic theocrats such as CIA asset, Osama bin Laden, through the Lahore-based bank of Credit and Commerce International.\n\nThe treatment of KSM is but one small part of the application of torture not to unearth information about future terrorist attacks, but rather to create a false record to support the specious claims on which the 9/11wars are premised. This propensity was put clearly on public display with news of the torture in Egypt of Ibn al-Shaykh al-Libi. The purpose of al-Libi’s torture, which Dick Cheney directed, was to produce false testimony subsequently presented at the United Nations in 2003 of a non-existent connection between Osama bin Laden and Saddam Hussein.\n\nThe purpose of the Anglo-American resort to torture has recently been described by Craig Murray, the former British ambassador to Uzbekistan who has become a whistle blower exposing the underlying fraud of the Global War on Terror. Murray was removed from his job when he began to pay attention to what was happening in his posting to prisoners flown in through illegal renditions from many parts of the world.\n\nHere is how Murray describes the patterns of torture in Uzbekistan, a key polity in the region’s multi-trillion dollar political boondoggle of oil and gas extraction as well as pipeline construction. Murray asserts,\n\n“the whole point of the intelligence being obtained under torture was to actually exaggerate the terrorist threats and to exaggerate the strength of al-Qaeda that was the whole point of why people were being tortured, to confess that they were members of al-Qaeda when they weren’t members of al-Qaeda and to denounce long lists of names of people as members of al-Qaeda who weren’t members of al-Qaeda”\n\nBy putting a focus on the lies and crimes of the Cheney-Bush-Rumsfeld Cabal of War Profiteers the trial of Splitting the Sky, together with the formulation of the Calgary Principles, is shaping up as a counterpoint to the upcoming show trial of KSM and others in New York\n\nWe invite broad participation in the Calgary proceedings this coming March from jurists, academics, students and concerned citizens from around the world. The convergence of interest in and around Splitting the Sky’s trial should be seen as one part of a global upsurge of popular will flowing from the growing recognition that our formal machineries of domestic law and international relations are leading humanity into a blind ally of death and destruction. The ugly imperatives of might is right will prevail over the rule of law until the people and peoples of the world find a way to overcome the inequities of “victors’ justice”.\n\nThe core corporations of the Military-Industrial-Complex have achieved such a lock grip on the executive, legislative and judicial branches of most of the world’s governments that humanity’s slender achievements in instituting democracy are being quickly negated. What meaning does an “X” on an election ballot have if voters have been duped by disinformation and smear campaigns even as they have been drawn into realms of public mythology that are completely disconnected from the realities of how power is exercised? The citizens of Afghanistan are far from alone in suffering the fate of what I call ballot box colonialism.\n\nHence, it can be said that these days the most important agencies of the Military-Industrial-Complex and the National Security State are the media conglomerates. These agencies of propaganda for Aggressive War bombard us on a daily basis with mental missiles of Psychological Warfare.\n\nThe constant barrage of messages we receive that peace is to be found in war, that freedom is to found in slavery, that wealth is to be found in indebtedness, and that truth is to be found in lies, is pulling humanity away from our fragile inheritance of reason, rationality, and enlightened discourse on the real menaces we face.\n\nEarth’s endangered biosphere is the real source of humanity’s health, sustainability and security. That is where we must point much of our remedial attention and creativity. To do so we must find a way to pull back from the oblivion of the modern-day Indian Wars that are depriving so many global citizens of both “Life, Liberty and Happiness” and “Peace, Order and Good Government”, as we move into the second decade of the New Millennium.\n\nDelivering the Bush/Cheney Gang to a Contemporary Equivalent of Nuremberg…\n\nOn March 17, 2009 Splitting the Sky performed his civic duty, acting with respect of the Law and integrity from the heart – persuing to arrest a credibly suspected war criminal and former US President, George W. Bush. Using the principles of Kaianereh’ko:wa Splitting the Sky proved his loyalty and integrity, upholding the Great Law. He was arrested and charged with Obstruction of Justice to which he will face his day in court on March 8th 2010 in Calgary Alberta.\n\nFormer US Attorney General Ramsey Clark former Georgia State Representative Cynthia McKinney have accepted to testify in his defence. Leading 9/11 author Dr. David Ray Griffin has provided him with an eighteen page affidavit to be read before the court and former Canadian diplomat,retired professor and political writer Peter Dale Scott has also accepted to testify if requested.\n\nLocation: Centre St-Pierre, 1212 Rue Panet (corner Rene Levesque east), salle 100, 5mins from Beaudry metro. Admission: suggested donation of $10.00. The event is to raise awareness and help raise funds for his legal defence after he was arrested and charged with Obstruction of Justice to which he will face his day in court on March 8th 2010 in Calgary Alberta.", "opengraph": {"locale": "en_US", "type": "article", "title": "Breaking Through Wall of Police Protection for International Criminals", "description": "When Splitting the Sky broke through police lines in his attempt to conduct a citizen's arrest of former US President, George W. Bush, the Mohawk Freedom Fighter pierced a thick wall of tyranny.", "url": "https://911truth.org/breaking-through-wall-of-police-protection-for-international-crime/", "site_name": "911Truth.Org", "article:published_time": "2009-12-04T15:18:37+00:00", "article:modified_time": "2012-10-07T19:33:12+00:00", "image": "https://i88.photobucket.com/albums/k188/ArthurTopham/450_cp_protest_090317-1.jpg"}, "tags": ["Afghanistan", "American Empire", "Abu Ghraib", "United Nations", "Saddam Hussein", "Iraq", "Cynthia McKinney", "David Ray Griffin", "New York City"], "tweets": [], "movies": [], "links": ["pdf/breaking_through_a_wall.pdf", "http://en.wikipedia.org/wiki/Ramsey_Clark", "http://en.wikipedia.org/wiki/Cynthia_McKinney", "http://www.consortiumnews.com/2009/102409b.html", "http://www.mtl911truth.org/?p=2702#more-2702"], "authors": ["", "Staff"], "publish_date": "2009-12-04T15:18:37+00:00"}