{"result_id": "005018", "URL": "https://911truth.org/veteran-wages-war-against-pentagon-over-mandatory-anthrax-vaccine/", "timestamp": "2023-04-25 11:45:52 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://911truth.org/wp-content/uploads/Liberty-head-icon.png", "canonical": "https://911truth.org/veteran-wages-war-against-pentagon-over-mandatory-anthrax-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "911truth.org", "title": "Veteran Wages War Against Pentagon Over Mandatory Anthrax Vaccine", "cleaned_text": "By Thomas D. Williams\n\n The Public Record\n\n May 26, 2008\n\nUS Air Force Reserve Maj. Thomas “Buzz” Rempfer, a 43-year-old Connecticut native, is hoping he is nearing the end of nearly a decade’s perpetual and unprecedented battle with the Pentagon over the legality, safety and effectiveness of mandatory anthrax vaccinations.\n\nHis and others’ efforts have already netted favorable federal court rulings. They invalidated the original Department of Defense mandate and the vaccine’s initial licensing.\n\nNow Rempfer, formerly of West Suffield, Connecticut, and now of Tucson, Arizona, awaits a ruling from the Air Force Board for Correction of Military Records. The board could award him back pay for lost time and promotions in the Air National Guard. If the board does not, he is likely to appeal back to the federal court. It was that court which decided in his favor by forcing another ruling from the Air Force panel.\n\nHowever, much more significant to Rempfer is a broader public service goal. Rempfer and his deceased close friend, US Air Force Reserve Maj. Russell “Russ” E. Dingle, both pilots, fought their battle for others adversely affected by the vaccine. It was their belief that any victory, legally, must become a crucial military servicewide precedent, clearing all other vaccine-resisting veterans from punishment. Rempfer is acting as a representative of Dingle’s estate.\n\nIn more than five years of research, Dingle and Rempfer concluded the anthrax vaccine was improperly licensed and ineffective. They found it created thousands of adverse reactions and was unnecessary. The threat of a foreign anthrax attack is extremely remote, they discovered. And, if there ever is such an attack, those exposed can take antibiotics afterward, they confirmed. That would avoid six anthrax vaccinations over 18 months as well as annual booster shots.\n\nSignificantly, the infamous 2001 anthrax powder attacks, killing five people and sickening 17 others after 9/11, were domestic and not foreign in nature. They were allegedly inspired by laboratory insiders who mailed the powder to the offices of two US senators, a number of national news offices in New York City, and elsewhere. The incidents are still under active FBI investigation.\n\nThat probe, says Fox News, recently identified three or four new suspects at an Army bioweapons lab intricately involved in helping to support the need for the mandated vaccine. They include a deputy commander, an anthrax scientist and a microbiologist. Curiously, at that point in time, the vaccine’s continued use was being threatened by closer scrutiny from the US Department of Defense and other Bush administration officials. That review withered away after the attacks. However, the DOD then used the domestic incidents to claim the foreign threat was “real.”\n\nIn the years before and after those episodes, Dingle’s and Rempfer’s findings that the vaccine was improperly licensed and thus unnecessarily mandated were eventually vindicated by a combination of a federal judge’s rulings and subsequent events. After the two officers’ initial investigations, the US Government Accounting Office (GAO) reported that the vaccine’s systemic adverse reaction rate was 100 times higher than the 0.2 percent rate reported on the product’s label.\n\nAdverse vaccine reactions include immune disorders, muscle and joint pains, headaches, rashes, fatigue, nausea, diarrhea, chills and fever. At least half a dozen deaths and a warning against birth defects were listed on the vaccine’s January 31, 2002, package insert, but they have never been proven to be vaccine-related. The vaccine is not recommended for use by pregnant women or for those who have experienced a history of Guillain-Barre Syndrome. And, last October, the GAO identified a potential $100 million in government waste annually. The anthrax vaccine stockpile for civilian emergencies had been improperly administered by the Department of Health and Human Services, the GAO report said.\n\nRempfer said he does not want to comment about the prospective Air Force panel’s ruling. He said full attention now must be on restoring the honor and the health of all the dedicated servicemen and women who were either punished for refusing to comply with the illegal order to take the vaccine, or who became sick from it. If the Air Force panel rules in Rempfer’s favor, the simple, overwhelming legal question will be: how can two military officers win damage awards and nullify their punishments for refusing the vaccine without all others similarly disciplined being cleared as well?\n\nDespite scores of protests against the vaccine nationwide, hundreds of military service members have been punished to varying degrees for failing to obey orders to be vaccinated. Some have been court-martialed, others fined or demoted and still others removed from the service. Most prolonged attempts to resist or overturn the penalties have met with failure. And yet, a federal survey in 2002 indicated that two-thirds of the Guard and reserve pilots and air crew members did not support DOD’s mandatory (anthrax vaccinations) or any future immunization programs planned for other biological warfare agents.”\n\nMeanwhile, thousands of service members have developed sicknesses, some extremely debilitating, that have been linked by them or others to one or more of the six-shot vaccine series or the annual boosters.\n\nRempfer’s and Dingle’s efforts marked one of the most prolonged, persistent high-level bureaucratic military policy fights waged in modern times. Three other former military service members, Paul A. Sullivan of Cedar Park, Texas; Doug Rokke of Rantoul, Illinois, and Denise Nichols, a North Carolina resident, all veterans of the first Iraq war, are known likewise for incredible persistence in the face of the powerful and intractable federal bureaucracy. They, as well, continue, after more than a decade of work, to lobby the Pentagon and the US Department of Veterans Affairs for failing to recognize veterans’ hazardous exposures to deadly chemicals as well as the dust from explosions of US depleted uranium munitions.\n\nIn their own struggle, Rempfer and Dingle pressed and complained their way through almost every branch of state and federal government during two presidential administrations. They were supported by others, including retired Air Force Lt. Col. John Richardson, of Pittsboro, North Carolina, Maine’s Dr. Doctor Meryl Nass and Washington, DC, attorneys John J. “Lou” Michaels and Mark S. Zaid. As their mission progressed, they picked up the continuing support of Connecticut’s Democratic attorney general, Richard Blumenthal, and US Rep. Christopher Shays, a Stamford, Connecticut, Republican. Both Blumenthal and Shays attempted unsuccessfully to block use of the controversial vaccine.\n\n“Two federal judges have now confirmed the Pentagon broke the law by forcing service members to take anthrax vaccine from 1998 to late 2005,” said Richardson, a 1991 Gulf War F-16 pilot. “The military could have lawfully used the vaccine all along simply by asking the president to waive service members’ right to informed consent about the risks of this dangerous vaccine,” he said. “Instead, military and civilian leaders willfully misled the troops to protect Presidents Clinton and Bush – not the troops.”\n\n“Since 2005,” Richardson said, “mandating the vaccine is now lawful only because of the FDA’s willingness to ignore clear evidence in military medical records of the deaths and disabilities associated with the anthrax vaccine. Just as the government misled the American people about the threat from Iraqi anthrax and the source of the anthrax letter attacks, it continues to mislead the troops about the safety and efficacy of the anthrax vaccine.”\n\nBlumenthal jumped into the vaccine fray again three years ago by filing a friend of the court brief in a federal lawsuit brought by six anonymous service members challenging the drug. At that time, he said: “Major Rempfer has performed an extraordinary public service, a very noble and significant service in alerting the nation to the dangers of the anthrax vaccine at a time of tremendous stress on our military. He has selflessly stepped forward and volunteered to serve his country…. He has unquestioned expertise and skill as well as impressive dedication and patriotism.”\n\nBut Rempfer, who is writing a book on the vaccine dispute, has always credited Dingle with the critical research, ultimately leading to federal court rulings temporarily blocking mandatory vaccine use. “Lt. Col. Dingle’s career,” Rempfer wrote in an obituary, “was uniquely distinguished by his noble advocacy for soldier’s health rights, testifying as an expert witness for the US Congress in 1999, as well as serving as an expert for the Government Accountability Office and the Connecticut Attorney General’s Office. He is missed dearly, but we will eternally benefit from his life’s accomplishments, courage, service, leadership, and most importantly, his honor.”\n\nDingle considered the vaccine program and its punishments incredibly unjust. He wrote: “When the US military no longer allows for professional dissent within its ranks; when the US military mandates that any and all orders be obeyed regardless of their moral or legal basis; when the US military allows its members to defend themselves with ‘I was just following orders,’ then the US military will cease to attract men and women of principal and honor…. It will end up resembling the military organizations that we have fought for the last 60 years.”\n\nIn October 1998, Dingle and Rempfer first became “Tiger Team Alpha.” Col. Walter Burns, a former commander of the 103rd Fighter Wing of the Connecticut Air National Guard, created the two-man team to investigate the history, safety and legality of the anthrax vaccine. The antigens stimulating immunity had been mandated for all 2.4 million military service members only weeks earlier. After a couple of months’ of intensive research, Dingle and Rempfer concluded the vaccine was improperly licensed, and potentially a health danger to the troops. Those findings are still supported by many today.\n\nHowever, BioPort Corporation, now Emergent BioSolutions, the vaccine’s manufacturer, insists the drug is safe and effective. That position is fully endorsed by the US Food and Drug Administration and the Pentagon. Nonetheless, the manufacturer’s health warnings and precautions are intricate, including what are characterized as rare, unproven serious reactions.\n\nThe vaccine has a long history of controversy over its safety and licensing dating back to before the 1991 Gulf War, and especially in the years after the conflict, when scores of service members taking it complained of adverse reactions. BioPort purchased the vaccine and its plant in 1998 from the former Michigan Biologics Products Institute, created in 1996 by the State of Michigan. That purchase inspired its own public flak.\n\nTwo of the purchasers were formerly part of the state operations. A third was former US Adm. William Crowe, first head of the Joint Chiefs of Staff under former President George H.W. Bush, then ambassador to Great Britain in the presidential administration of Bill Clinton. Crowe was said by ABC News to have acquired his interest without investing a penny of his own money.\n\nHis influential ownership interest was useful politically and security-wise, since Fuad El-Hibri, a Lebanese Arab with German and US citizenship with lengthy business experience became the company’s CEO.\n\nDespite the Tiger Team’s thumbs down on injections, Colonel Burns decided it was unwise to oppose the across-the-board mandate announced by then-Secretary of Defense William Cohen. Ironically, it was US Senator Cohen who ten years earlier had participated in a Congressional investigation deeming that the very same vaccine had classically created too many adverse reactions and was ineffective for inhalation exposures.\n\nAs a result of Burns’s decision, half a dozen pilots, rejecting the vaccine in light of Dingle’s and Rempfer’s probe, were forced out of the National Guard in January 1999. Rempfer and Dingle were then pressured to resign. Despite their loss of National Guard status, Rempfer and Dingle switched to the Air Force Reserve where their superiors promoted them. Rempfer continues to fly today.\n\nDingle, 49, died of cancer in September 2005 after retiring from the Reserve. His double career included more than 16 years of service as a pilot and captain for American Airlines in the Boeing 767 and 737 and the McDonnell-Douglas S-80, and 21 years as an instructor pilot and flight commander in the Air Force.\n\nEleven months after Burns banished them, Blumenthal tried to force reinstatements for all of the pilots. But then State Adjutant Gen. William Cugno denied the request, and Republican Connecticut Gov. Jodi Rell refused to back up Blumenthal’s opinion.\n\nRempfer and Dingle began their complaint to clear their names in the US Court of Claims three years ago. It ultimately moved into the federal court and finally to Air Force adjudicators. The two men insisted they were “coerced” out of the Guard in the spring of 1999 by Colonel Burns, their former commander, after their vaccine inquiry. Yet, it was an investigation Burns himself had requested, and it showed the vaccine was improperly licensed. At the time, Burns insisted Rempfer, Dingle and six other pilots resigned on their own with “no bad blood.” But Rempfer has produced a transcript of Burns’s comments saying the word “traitor” came to mind when Burns thought about their resistance to taking the vaccine. Burns nonetheless simultaneously admitted the vaccine had its problems.\n\nOn March 14, Washington, DC, US District Judge James Robertson remanded Rempfer’s and Dingle’s complaint back to the Air Force panel, which had rejected Rempfer’s appeal to rescind his and Dingle’s punishment. The panel failed to properly consider the evidence before it, Robertson ruled. Robertson’s decision followed an April 2005 finding from US District Judge Emmet Sullivan, inspired in part by Rempfer’s, Dingle’s and their colleagues’ extensive research. Sullivan temporarily halted the Defense Department mandatory anthrax vaccine inoculations for all 2.4 million service members. They had been initially ordered in 1998 by former US Secretary of Defense William Cohen.\n\nSullivan declared that the anthrax vaccine is being used for an unapproved purpose and thus is “an investigational drug.” It was initially approved for combating anthrax obtained through human skin contact with animals, yet it is instead being used for manufactured anthrax spores inhaled through the nose, he said. It thus requires consent from those vaccinated, he wrote. However, the judge left untouched an emergency authorization from federal health officials which allowed voluntary vaccinations. Sullivan’s edict required that service members be told about the unlicensed drug’s possible side effects, and ordered the consent of those soldiers, sailors and airmen if they were to be vaccinated. He decided the vaccine was not licensed property for its intended military use and remanded the complaint back to the FDA for remedial action. His final order was issued April 6, 2005.\n\nLater, the FDA made vaccine licensing adjustments to comply with Sullivan’s orders, and after a mandatory vaccine hiatus, allowed mandatory vaccinations to be restarted. The forced inoculations continue today, even though Rempfer and seven other servicemen brought still another federal court lawsuit challenging the FDA’s remedial license changes. Their challenge was rejected February 29 by Washington, DC, Judge Rosemary M. Collyer, who ruled the FDA had not acted “arbitrarily or capriciously.”\n\nFour decades ago, the vaccine was largely used by agricultural workers, veterinarians and some in the wool industry. It had been scientifically tested and manufactured to protect veterinarians and those in the leather industry against skin-to-skin wound contact with infected farm animals. An initial scientific study in 1962 included an insufficient number of inhalation exposures of those working in goat hair mills to reach any conclusions of the vaccine’s effectiveness.\n\nYet, once the military began to use it, the vaccine was aimed at protecting service members against inhalation of manufactured anthrax spores spread by enemy explosions or devices. Defense Secretary Cohen and other federal officials supporting the vaccine pointed to its successful scientific tests with animals. But the laboratory animals’ health, ultimately, was not closely observed for as long a time as armed service veterans claiming sicknesses from inoculations were. Also, some of animal tests were inconclusive.\n\nDespite the forced vaccinations, history reveals no successful enemy attacks worldwide – only an unsuccessful Tokyo spore release from a building laboratory by the terrorist group known as the Aum Shinrikyo cult in June 1993. The US mail and other anthrax spore attacks soon after the 9/11 terror attacks were reported by the FBI to be inspired by a domestic lab operation. Anthrax powder is very expensive and dangerous to manufacture, while some other unrelated biological agents are more easily created in the lab. Those exposed to the US spores in 2001 were successfully treated with ciprofloxacin or doxycycline antibacterial drugs. Yet, government officials still insisted some exposed to the deadly anthrax powder should be vaccinated, even though the vaccine is not said to be effective after spore exposure.\n\nThe attacks came at a time when the vaccine’s effectiveness was being questioned on a number of fronts. For instance, at the time, the GAO’s inquiry found: “Diplomatic security officials in the State Department and Central Intelligence Agency analysts agree that they have no clear evidence that US missions or interests overseas are threatened by foreign state or terrorist attacks using biological or chemical agents at this time.”\n\nWhile the vaccine is the only one to be mandated by the Pentagon and other US agencies to protect against such attacks, there are twenty to thirty known similar potentially deadly, infective biological agents available in many countries. And, the anthrax vaccine is inappropriate for all of them. Some 18 of them are listed by the Federation of American Scientists.\n\nThomas “Dennie” Williams is a former state and federal court reporter, specializing in investigations, for the Hartford Courant. Since the 1970s, he has written extensively about irregularities in the Connecticut Superior Court, Probate Court systems for disciplining both judges and lawyers for misconduct, and failures of the Pentagon and the VA to assist sick veterans returning from war. (He can be reached at denniew@optonline.net).", "opengraph": {"locale": "en_US", "type": "article", "title": "Veteran Wages War Against Pentagon Over Mandatory Anthrax Vaccine - 911Truth.Org", "description": "By Thomas D. Williams The Public Record May 26, 2008 US Air Force Reserve Maj. Thomas “Buzz” Rempfer, a 43-year-old Connecticut native, is hoping he is nearing the end of nearly a decade’s perpetual and unprecedented battle with the Pentagon over the legality, safety and effectiveness of mandatory anthrax vaccinations. His and others’ efforts have […]", "url": "https://911truth.org/veteran-wages-war-against-pentagon-over-mandatory-anthrax-vaccine/", "site_name": "911Truth.Org", "article:published_time": "2008-05-27T14:46:47+00:00", "article:modified_time": "2012-10-16T05:17:53+00:00"}, "tags": ["Bill Clinton", "Air Force", "Iraq"], "tweets": [], "movies": [], "links": [], "authors": ["", "Staff"], "publish_date": "2008-05-27T14:46:47+00:00"}