{"result_id": "005017", "URL": "https://911truth.org/important-information-from-peers-and-wanttoknow-info/", "timestamp": "2023-04-25 11:45:51 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://911truth.org/wp-content/uploads/Liberty-head-icon.png", "canonical": "https://911truth.org/important-information-from-peers-and-wanttoknow-info/", "encoding": "UTF-8"}, "image": null, "domain": "911truth.org", "title": "Important information from PEERS and WantToKnow.info", "cleaned_text": "Editor’s Note:\n\n This excellent newsletter is sent by the team at WantToKnow.info. Here is the latest. Subscription information is at the end.\n\nBelow are key excerpts of important news articles you may have missed. These articles include revealing information on US government plans to launch swine flu vaccinations in the fall, a report of widespread torture at the US secret prison at Bagram, Afghanistan, revelations that weapons inspector David Kelly’s mysterious death may have been related to his intention to expose a worldwide black market in weaponized anthrax, and more. Each excerpt is taken verbatim from the major media website listed at the link provided. If any link fails to function, click here. The most important sentences are highlighted for those with limited time. By choosing to educate ourselves and to spread the word, we can and will build a brighter future.\n\nWith best wishes,\n\n Tod Fletcher and Fred Burks for PEERS and the WantToKnow.info Team\n\nImportant Note: We’ve been hit hard by the ecomonic downturn. Donations this year are less than half what they were at this time last year. We would deeply appreciate support from any of you that can afford it. To help further this work, please click here.\n\nU.S. to vaccinate millions against swine flu\n\nSchool-age children will be a key target= population for a pandemic flu vaccine in the fall, and they may be vaccinated at school in a mass campaign not seen since the polio epidemics of the 1950s. The federal government should get about 100 million doses of vaccine by mid-October, if the current production by five companies goes as planned. But enough vaccine for wide use by the 120 million people especially vulnerable to the newly emerged strain of H1N1 influenza virus will not be available until later in the fall. Those were among the messages administration officials delivered to about 500 state, territorial, city and tribal health officials yesterday at a “flu summit” at the National Institutes of Health’s Bethesda campus. President Obama, speaking by audio link from the Group of Eight summit in L’Aquila, Italy, urged “complete ownership” of preparations for what he termed a “significant outbreak” of H1N1 flu in the next few months. “We want to make sure that we are not promoting panic, but we are promoting vigilance and preparation,” he said. He added that “the most important thing for us to do is to make sure that state and local officials prepare now to implement a vaccination program in the fall.” Children, pregnant women, adults with chronic illnesses, and health-care workers would probably be first in line for the vaccine, Health and Human Services Secretary Kathleen Sebelius told the gathering. Education Secretary Arne Duncan said “we would absolutely welcome” the idea that the nation’s schools be a principal venue for delivering the vaccine. He called them “natural sites” and said that “to open our doors and be part of the solution really makes sense.”\n\nNote: The fear-mongering and vaccination plan continues. Note the Post’s claim that “more than 1 million Americans have become ill from it.” Where did they get this number? The CDC website at this link as of July 10th claims around 40,000 cases in the US. Could this mistake have been intentional? For lots more on this, see this link. And to watch a powerful segment from CBS 60 Minutes showing how government propoganda killed and maimed thousands during the swine flu scare of 1976, click here.\n\nMIA may be a quarantine site in pandemic\n\nMiami International Airport [MIA] and 18 other major American airports have been lined up to handle a future pandemic that could require them to quarantine international flights. The U.S. Centers for Disease Control and Prevention has set up stand-by quarantine/screening facilities at the 19 airports to which all flights from affected countries would be diverted. Nationally, airline and airport lobbyists predict chaos, saying there is no way the air-traffic system can handle such extensive rerouting. Now, new proposals are emerging in Washington, including one that would designate Fort Lauderdale-Hollywood, Orlando International and four other major airports as potential second-tier quarantine sites. Local officials say they understand the CDC will approve the new designations only if the airports pay for the quarantine facilities themselves. The CDC would pay for the quarantine stations at the 19 primary airports. The facilities are not cheap. A 2008 study by the Federal Aviation Administration concluded that setting aside space for health screenings and a quarantine of up to 200 people could cost $15,000 a month, with costs of an actual quarantine running into the hundreds of thousands of dollars. Fort Lauderdale-Hollywood officials began developing a plan to handle quarantined passengers and flights several years ago during the bird flu scare. It calls for erecting air-conditioned tents on the runway ramps to screen or quarantine passengers before they enter the terminal. Quarantined passengers might have to remain for days to show they are not infectious.\n\nNoor Habib’s hands shake as he draws a picture of how he says he was abused. He claims that he was taken to a small, darkened cell where his arms were tied to the ceiling and he was made to stand in waist-deep water for six hours at a time. He says he was beaten, threatened with dogs, and deprived of sleep. Habib was an inmate at the Bagram Theater Internment Facility, an American military detention centre outside Kabul. Over a period of more than two months, we tracked down 27 former detainees. There were others, but they were afraid to speak or had been warned not to. Many allegations of ill-treatment appear repeatedly in the interviews; physical abuse, the use of stress positions, excessive heat or cold, unbearably loud noise, being forced to remove clothes in front of female soldiers and in four cases, being threatened with death at gunpoint. All the men who spoke to us were interviewed in isolation and they were all asked the same questions. They were held at times between 2002 and 2008 and they were all accused of belonging to or helping al-Qaeda or the Taliban. None of the inmates were charged with any offence or put on trial. The camp has held thousands of people over the last eight years. Most of the inmates are Afghans but some were captured abroad and brought here under a process known as “extraordinary rendition”, including at least two Britons. The Obama administration says they are dangerous men and it classifies them as “terrorist suspects” and “enemy combatants” rather than “prisoners of war”. It is a legal classification that critics say deliberately denies inmates access to lawyers or the right to appeal or even complain about their treatment.\n\nNote: For more revelations from reliable, verifiable sources of the horrific abuses carried out under US direction at secret prisons worldwide, click here.\n\nJuly 5, 2009, Daily Express (One of the UK’s largest-circulation newspapers)\n\nWeapons inspector David Kelly was writing a book exposing highly damaging government secrets before his ­mysterious death. He was intending to reveal that he warned Prime Minister Tony Blair there were no weapons of mass destruction anywhere in Iraq weeks before the ­British and American invasion. He had several discussions with a publisher in Oxford and was seeking advice on how far he could go without breaking the law on secrets. Following his death, his computers were seized and it is still not known if any rough draft was discovered by investigators and, if so, what happened to the material. Dr Kelly was also intending to lift the lid on a potentially bigger scandal, his own secret dealings in germ warfare with the apartheid regime in South Africa. US television investigators have spent four years preparing a 90-minute documentary, Anthrax War, suggesting there is a global black market in anthrax and exposing the mystery “suicides” of five government germ warfare scientists from around the world. Director Bob Coen said: ‘‘The deeper you look into the murky world of governments and germ warfare, the more worrying it becomes. We have proved there is a black ­market in anthrax. David Kelly was of particular interest to us because he was a world expert on anthrax and he was involved in some degree with assisting the secret germ warfare programme in apartheid South Africa.” Dr Kelly was found dead in woods near his Oxfordshire home on July 17 2003. His apparent suicide came two days after he was interrogated in the Commons over his behind-the-scenes role in exposing the flaws in the “sexed-up” Number 10 dossier which justified Britain going to war with Iraq. Conspiracy theorists have claimed he was murdered.\n\nNote: For more on the CBC documentary Anthrax War, click here. And to read about the strange deaths of 13 renowned microbiologists in the space of less than five months, click here.\n\nThe Alarming Record of the F.B.I.’s Informant in the Bronx Bomb Plot\n\n July 7, 2009, Village Voice (A progressive New York City street newspaper)\n\n http://www.villagevoice.com/2009-07-08/news/the-alarming -record-of-the-f-b-i…\n\nLast month, police and the FBI arrested four Newburgh men on charges that they had plotted to bomb synagogues in the Riverdale neighborhood of the Bronx and fire a missile at a military jet. As more details emerged, however, the less the four defendants sounded like men with the skills to plan a sophisticated terror plot. They were small-time crooks, felons with long criminal records. What the indictment didn’t say, and what the initial news reports didn’t fill in, was the extent to which the fifth man in the plot, an unnamed FBI informant, had provided the glue to hold the Newburgh 4 together. That informant was a Pakistani man named Shahed Hussain, code-named “Malik,” who agreed to work for the FBI to obtain leniency after he was arrested in 2002 for fraud. Over a period of about a year, Malik met with [the] defendants … while under FBI surveillance. The Newburgh bomb plot isn’t the first of Malik’s operations for the government. He played a similar role four years ago in an Albany case, in which he helped the FBI arrest a man named Mohammed Hossain, a cash-poor pizzeria owner, and his imam, Yassin Aref, after persuading them to launder $50,000 in a made-up plot to bring a missile to the U.S. and assassinate the Pakistani prime minister. In both cases, Malik did not stumble upon active terror cells plotting to bring destruction on American soil. Instead, in both Newburgh and Albany, he needed long periods of time to recruit his Muslim contacts, spin elaborate tales about his terror contacts, and develop solid plans of action, all the while providing the defendants with large amounts of resources and cash incentives. In each case, the question remains: Would either set of defendants have done anything remotely like plant bombs or launder money for terrorists if not for the prodding and plotting and encouragement of Malik and the FBI?\n\nNote: For lots more from major media sources on the hidden realities behind the never-ending “war on terror”, click here.\n\nAs rumours swell that the government staged 7/7, victims’ relatives call for a proper inquiry\n\n July 3, 2009, Daily Mail (One of the UK’s largest-circulation newspapers)\n\n http://www.dailymail.co.uk/news/article-1197419/Conspira cy-fever-As-rumours-swell…\n\nThe country’s worst-ever terrorist atrocity during London’s morning rush hour on July 7, 2005, shattered for ever the heady euphoria in which the capital was basking the morning after winning the bid for the 2012 Olympics. That afternoon, Tony Blair – who was hosting the G8 summit on global poverty in Gleneagles, Scotland – returned to Downing Street to pronounce that the attack was an act in the ‘name of Islam’. Later, at a meeting of the Government’s national emergency committee COBRA, London’s anti-terror police chief Andy Hayman told senior ministers that he suspected suicide bombers. And so the story of 7/7 that we have come to accept was pieced together: four British Muslims … blew themselves up using home-made explosives, killing 56 and injuring 700 on three Tube trains and a double-decker bus. But families of the dead victims and an increasing number of 7/7 survivors claim there are inconsistencies and basic mistakes in the official accounts that need explanation. And they are demanding a full public inquiry to answer key questions about what the Intelligence Services and the police did and did not know before the bombings. Meanwhile, the Government’s determined refusal to meet their demands is having a very dangerous side-effect – fuelling myriad conspiracy theories about 7/7. Books, blogs and several video documentaries point to oddities in the official accounts. [Some] of them suggest that the attacks were not the work of Muslim terrorists at all, but were carried out by the Government to boost support for the Iraq war. The survivors are so intent on an independent inquiry that they are now taking legal action in the High Court.\n\nNote: The evidence laid out in this article of government complicity is quite strong. For revealing reports from reliable sources on the unexplained circumstances surrounding the London Bombings on 7/7/05, click here.\n\nMissing Moon-Landing Videotapes May Have Been Found\n\n June 30, 2009, Fox News\n\n http://www.foxnews.com/story/0,2933,529476,00.html\n\nJust in time for the 40th anniversary of the first moon landing, NASA may have found the long-lost original Apollo 11 videotapes. Back on July 20, 1969, the raw video feed from the moon was beamed to the Parkes Observatory radio telescope in southeastern Australia, and then compressed and sent to Mission Control in Houston. Because of technical issues, NASA’s images couldn’t be fed directly to the TV networks. Instead, the grayish, blotchy images Americans saw on their TV sets were the result of a regular TV camera pointed at the huge wall monitor in Houston – a copy of a copy, in effect. Those images survive, and anyone can see them on YouTube. But the original, sharp, black-and-white tapes that were recorded at Parkes vanished. NASA had thought they’d been shipped to the Goddard Space Flight Center in Greenbelt, Md., But a search there a couple of years ago turned up nothing. Around the same time, though, a cache of tapes containing data from moon-surface experiments from the entire Apollo program was discovered in a university basement in Perth, Western Australia, on the other side of the country from Parkes. According to the Sunday Express, NASA has combed through those tapes and found the original Apollo 11 video footage. “We’re talking about the same tapes,” an unnamed NASA spokesman told the newspaper, though he added that “at this point, I’m not prepared to discuss what has or has not been found.”\n\nNote: Isn’t it amazing that NASA could lose these invaluable tapes? There are many strange questions surrounding this issue.\n\nA written exam administered by the Pentagon labels “protests” as a form of “low-level terrorism” – enraging civil liberties advocates and activist groups who say it shows blatant disregard of the First Amendment. The written exam, given as part of Department of Defense employees’ routine training, includes a multiple-choice question that asks: “Which of the following is an example of low-level terrorism?” – Attacking the Pentagon – IEDs – Hate crimes against racial groups – Protests. The correct answer, according to the exam, is “Protests.” “Its part of a pattern of equating dissent and protest with terrorism,” said Ann Brick, an attorney with the American Civil Liberties Union, which obtained a copy of the question after a Defense Department employee who was taking the test printed the screen on his or her computer terminal. “It undermines the core constitutional values the Department of Defense is supposed to be defending,” Brick said, referring to the First Amendment right to peaceably assemble. She said the ACLU has asked the Defense Department to remove the question and send out a correction to all employees who took the exam. “There were other employees who were unhappy with it and disturbed by it,” Brick said. Anti-war protesters, who say they have been target=s of federal surveillance for years, were livid when they were told about the exam question. “That’s illegal,” said George Martin, national co-chairman of United for Peace and Justice. “Protest in terms of legal dissent has to be recognized, especially by the authorities. It’s not terrorism or a lack of patriotism. We care enough to be active in our government.”\n\nNote: For lots more on the continually-escalating government threats to civil liberties, click here.\n\nUsed in yards, farms and parks throughout the world, Roundup has long been a top-selling weed killer. But now researchers have found that one of Roundup’s inert ingredients can kill human cells, particularly embryonic, placental and umbilical cord cells. The new findings intensify a debate about so-called “inerts” – the solvents, preservatives, surfactants and other substances that manufacturers add to pesticides. Nearly 4,000 inert ingredients are approved for use by the U.S. Environmental Protection Agency. Glyphosate, Roundup’s active ingredient, is the most widely used herbicide in the United States. About 100 million pounds are applied to U.S. farms and lawns every year, according to the EPA. Until now, most health studies have focused on the safety of glyphosate, rather than the mixture of ingredients found in Roundup. But in the new study, scientists found that Roundup’s inert ingredients amplified the toxic effect on human cells – even at concentrations much more diluted than those used on farms and lawns. One specific inert ingredient, polyethoxylated tallowamine, or POEA, was more deadly to human embryonic, placental and umbilical cord cells than the herbicide itself — a finding the researchers call “astonishing.” “This clearly confirms that the [inert ingredients] in Roundup formulations are not inert,” wrote the study authors from France’s University of Caen. “Moreover, the proprietary mixtures available on the market could cause cell damage and even death [at the] residual levels” found on Roundup-treated crops, such as soybeans, alfalfa and corn, or lawns and gardens.\n\nNote: Monsanto, Roundup’s manufacturer, is the same company that has been using a corrupt judicial system to bankrupt farmers who won’t use their seeds. For more on this important topic, click here.\n\nFor the first couple of years I lived in Britain, I was an illegal immigrant from the United States, visaless with an expired passport and looking over my shoulder all the time. Even so, from the very first day I arrived at Victoria Station in London, suffering from bronchitis, I was accepted in the NHS — the national health scheme, we called it — no questions asked and no ID required. After I’d become a legal resident, I asked my doctor why he had taken me, almost literally off the boat, with so little fuss. Weren’t foreigners a drain on his time and the National Health Service? He shrugged. “If you come here with a contagious disease, we don’t want you infecting the rest of us. So of course we give you medical care. Purely selfish on our part.” For three decades I used and, being of a hypochondriacal nature, exploited the British medical system without paying a farthing except for the taxes taken out of my wages as a working journalist. And that single-payer, socialistic, government-run, bureaucratized, heavily used, nationalized health system served me — and 50 million others — very well. In need, I saw many doctors, with no money ever changing hands. There was nothing to sign, hardly any papers to shuffle. My primary-care physician ran his “surgery,” his office, with the help of only one receptionist whose job it was to arrange appointments. It was all free, including specialists, and I came to believe that healthcare is a right, not an entitlement I had paid for. This “free” part sometimes puzzled my visiting American friends. When they got ill in London, I’d send them to my doctor, who would smile bemusedly when offered money.\n\nCosta Rica is the happiest place in the world, according to an independent research group in Britain with the goal of building a new economy, “centered on people and the environment.” Costa Rica is known for its lush rain forests and pristine beaches. In a report released [on July 4], the group ranks nations using the “Happy Planet Index,” which seeks countries with the most content people. In addition to happiness, the index by the New Economics Foundation considers the ecological footprint and life expectancy of countries. “Costa Ricans report the highest life satisfaction in the world and have the second-highest average life expectancy of the new world (second to Canada),” the organization said in a statement. They “also have an ecological footprint that means that the country only narrowly fails to achieve the goal of … consuming its fair share of the Earth’s natural resources.” This year’s survey, which looked at 143 countries, featured Latin American nations in nine of the Top 10 spots. The runner-up was the Dominican Republic, followed by Jamaica, Guatemala and Vietnam. Most developed nations lagged in the study. While Britain ranked 74th, the United States snagged the 114th spot, because of its hefty consumption and massive ecological footprint. The United States was greener and happier 20 years ago than it is today, the report said. Other populous nations, such as China and India, had a lower index brought on by their vigorous pursuit of growth-based models, the survey suggested. The report, which was first conducted in 2006, covers 99 percent of the world population.\n\nColorful Outsider Is Named No. 3 at the CIA\n\n March 17, 2001, Washington Post\n\n http://washingtonpost.com/wp-dyn/articles/A16570-2001Mar 16.html\n\nA.B. “Buzzy” Krongard, a … former investment banker … was named yesterday executive director of the CIA, bringing a fast-paced management style to the agency’s No. 3 job. Central Intelligence Agency Director George J. Tenet announced the appointment, saying he treasures Krongard’s “wise counsel and ‘no-nonsense’ business-like views.” Krongard, 64, former head of Alex. Brown & Co., an investment bank based in Baltimore, joined the agency three years ago as a counselor to Tenet. He switched careers shortly after helping engineer the $2.5 billion merger of Alex. Brown and Bankers Trust New York Corp., gaining $71 million in Bankers Trust stock. Few of his former colleagues were surprised by his decision to trade a $4 million salary and stock options for the far less remunerative job of Tenet’s consigliere. A graduate of Princeton and the University of Maryland Law School, Krongard has a fondness for extreme military-style activities. Even as a banking executive, he trained with police SWAT teams for recreation and worked out with a kung fu master. He maintained a shooting range on the park-like grounds of his home on the northern edge of Baltimore. In an interview yesterday, Krongard described his past duties as those of a “minister without portfolio” whom senior managers felt comfortable talking to about “sticky subjects.” But Krongard exhibited the requisite secretiveness when asked to explain his interest in intelligence and how he came to land a job in Tenet’s inner circle. If you go back to the CIA’s origins during World War II in the Office of Strategic Services, he explained, “the whole OSS was really nothing but Wall Street bankers and lawyers.”\n\nNote: Buzzy Krongard was the executive director of the CIA on 9/11. His past ties to the investment firm which placed most of the extraordinarily high volume of “put options” on United and American Airlines stocks the week before the attacks is one of many strange “coincidences” unexplained by the official story of what happened on that horrific day. For more on this, click here. To read the entire article free of charge, click here.\n\nSpecial note: For a fascinating three-minute CBS video clip on how major global events may affect global consciousness, click here. More can be found at the Global Consciousness Project website available here.\n\nFinal Note: WantToKnow.info believes it is important to balance disturbing cover-up information with inspirational writings which call us to be all that we can be and to work together for positive change. Please visit our Inspiration Center at http://www.WantToKnow.info/inspirational for an abundance of uplifting material.\n\nSee our archive of revealing news articles at www.WantToKnow.info/indexnewsarticles\n\nYour tax-deductible donations, however large or small, help greatly to support this important work.\n\n To make a donation by credit card, check, or money order: www.WantToKnow.info/donationswtk\n\nExplore the mind and heart expanding websites managed by the nonprofit PEERS network:\n\nwww.peerservice.org – PEERS websites: Spreading inspiration, education, & empowerment\n\n www.momentoflove.org – Every person in the world has a heart\n\n www.personalgrowthcourses.net – Dynamic online courses powerfully expand your horizons\n\n www.WantToKnow.info – Reliable, verifiable information on major cover-ups\n\n www.weboflove.org – Strengthening the Web of Love that interconnects us all\n\nTo respond to this message, visit www.WantToKnow.info/contactus.php\n\n To subscribe to or unsubscribe from the WantToKnow.info list (one email every few days):\n\n www.WantToKnow.info/subscribe", "opengraph": {"locale": "en_US", "type": "article", "title": "Important information from PEERS and WantToKnow.info - 911Truth.Org", "description": "This excellent newsletter is sent by the team at WantToKnow.info. Here is the latest. Subscription information is at the end.", "url": "https://911truth.org/important-information-from-peers-and-wanttoknow-info/", "site_name": "911Truth.Org", "article:published_time": "2009-07-13T17:12:22+00:00", "article:modified_time": "2014-05-13T23:25:20+00:00"}, "tags": ["Taliban", "Afghanistan", "New York City", "Wall Street", "Iraq", "Vietnam"], "tweets": [], "movies": [], "links": ["http://www.washingtonpost.com/wp-dyn/content/article/200%209/07/09/AR2009070900353.html", "http://www.miamiherald.com/business/story/1089929.html", "http://www.sundayherald.com/international/shinternationa%20l/display.var.2518245.0.0.php", "http://www.express.co.uk/posts/view/111971/Kelly-s-book-%20of-secrets"], "authors": ["", "Staff"], "publish_date": "2009-07-13T17:12:22+00:00"}