{"result_id": "005003", "URL": "https://911truth.org/in-memoriam-janice-ann-matthews-1960-2021/", "timestamp": "2023-04-25 11:45:31 CEST+0200", "meta": {"description": "Janice Ann Matthews, age 60, cherished mother and grandmother, sister, daughter, and friend, passed away unexpectedly on February 27th, 2021", "lang": "en", "keywords": "", "favicon": "https://911truth.org/wp-content/uploads/Liberty-head-icon.png", "canonical": "https://911truth.org/in-memoriam-janice-ann-matthews-1960-2021/", "encoding": "UTF-8"}, "image": null, "domain": "911truth.org", "title": "In Memoriam: Janice Ann Matthews (1960 - 2021)", "cleaned_text": "Janice Ann Matthews, age 60, cherished mother and grandmother, sister, daughter, and friend, passed away unexpectedly on February 27th, 2021 while visiting her hometown of Kansas City, Kansas.\n\nJanice’s life and legacy will be remembered though her six children; Andrea, Emily, Lucas, Cheyenne, Samantha, and Matthew, her five grandchildren; Brayden, Kellen, Elizabeth Ann, Tiller, and Nova, and the countless others whose lives were transformed by her kindness and generosity. Janice is also survived by her two sisters, two brothers, and her caring mother, Bonnie Matthews.\n\nJanice will be remembered most, perhaps, for the sound of her joyous laughter, a chord which rang through the air and filled the hearts of those around her. Janice’s hands were a symbol of her strength—calloused and roughened over time as those of a builder, a gardener, an editor, a writer, a musician, and most of all, a mother. Her strong hands held her children through the scraped knees and broken hearts of life, always lifting them from their pain and wiping their tears. Janice cared not only for her own children, but for every single soul she was graced to meet. Whether it be a screaming toddler on her last midnight flight home or a cooing infant at church, Janice exuded an energy that allowed children trust her, for their innocence enabled them to see the divine aura that the Lord had placed around her.\n\nThrough her work with the National Alliance on Mental Illness, Janice transformed the lives of many. She knew, deep within her soul, that we are all God’s children, no matter our struggle and believed that we all deserve grace and acceptance. Janice was a lover of music, a dancer of whacky rhythms—her moves never failing to embarrass her children in the exact right way. Her voice sang the praises of the Lord, the melodies of The Beatles and Neil Young, and the lullabies which so sweetly soothed her babies’ in times of need.\n\nJanice was a gifted and creative woman, expressing her love of nature and the dirt of the Earth in her garden—a passion she first learned from her very dear grandmother, Gran-Gran.\n\nJanice would want us to rejoice now, in the love and light that so filled her soul. She would ask us to dance and sing for her, and to be silly. She would ask us to embarrass our children any chance we get. She would ask us to let our tears fall so they may cleanse our spirit, which is so hurt at this time. She would ask us to accept the grace of God through this pain we all feel. She would ask us to lean on one another, never allowing time or space to create distance. She would ask us to love one another—to be strong for each other when we are able, but also to accept when we are weak.\n\nWe, her children, ask these things of all of you who knew and loved our mother.\n\nJanice was a hero to many, and as her final selfless gift, five lives have been saved through her incredible decision to be an organ donor. Five lives will flourish, allowing their family and friends more time with the ones they love. While our time with Janice has been forever changed, she would feel great relief that she was able to give this final gift.\n\nTo register to become an organ, tissue, and eye donor in honor of Janice Matthews, please visit www.sharelifemidwest.com or call 888.744.4531.\n\nJanice Matthews was a fearless activist who shined light on diverse issues that a more conventional person would blot out to avoid the pain. She demonstrated boundless courage in speaking truth to power. Janice wrote, edited, or curated the majority of the thousands of articles and scholarly papers at this site. The wide range of topics reflect her insatiable curiosity and incurable hope to contribute to waking our collective conscience. She applied her knowledge of people’s movements to facilitate activism and encourage ordinary people to become participants and leaders in their own lives and communities. She challenged false divisions by building and strengthening connections with people from all walks of life and points of view. Janice encouraged us to take personal responsibility for creating a more just world that restores power to the people. She embodied impeccable integrity. I was fortunate to call her my friend and comrade-in-arms.\n\nMay her memory be a blessing.\n\n–Mike Berger\n\nShe was a co-founder and a board member of the 9/11 Visibility Project, one of the first 9/11 grassroots groups in the country at the time. She was an administrator of the 9/11 Truth Activists’ Forum and worked primarily on outreach to other groups, toward restoring America’s core principles of truth and justice.\n\nJanice also served in various community groups wherever she called home. Her particular passion for building awareness and facilitating change concentrated on veterans’ issues, abuse and the effects of depleted uranium and vaccinations, and media reform.\n\nShe was a part of 911Truth.Org from its inception as a switchboard and events calendar under the name of “9/11 Truth Alliance.” When 911Truth.Org became a formal organization in June, 2004, Janice became the Outreach Coordinator mindful of the needs of a growing national truth movement.\n\nBy the end of 2005, she brought her considerable talents and skills to the role of Executive Director of 911Truth.Org with the following mission:\n\nYou can see many of the accomplishments she brought to life here. Under her direction the national 9/11 grassroots groups expanded to include hundreds of activist hubs across 39 states and more than a dozen nations. She was instrumental in organizing the 2006 Chicago Conference that was covered by the New York Times, attended by more than 500 activists, and produced hundreds of 9/11 truth groups and websites.\n\nThe following interview with her friend Carol Brouillet on The People’s Radio Network took place in September, 2007, as 911Truth.Org called for a Global Day of Action with events in more than 60 cities across 4 continents. (This interview has been condensed).\n\nIf you listen to the interview, you’ll understand why this David Rovics song meant so much to Janice.\n\nIf you have thoughts or memories you would like to share, you can record a voicemail at 646 434-0911. Or send us an email.\n\nDoggerel for an Earth Mother Down\n\nAlert to the planet: we have a big problem.\n\nYour fierce fragrant daughter Janice just left.\n\nShe’d scorched vast frauds, soothed bruised babes,\n\nhelped thousands recover from sanity theft.\n\nShe held her world in a fast embrace\n\nof valor, care and conscientiousness.\n\nJust funny as hell & generous to a fault.\n\nShe seamlessly wed moxie & tenderness.\n\nWhatever the outrage or tragedy\n\nquick calls to J could preempt despair.\n\nShe cauterized wounds of political strife\n\nwith salty wisdom and irreverent flare.\n\nFor all who came to give or ask help,\n\nbe they batshit, bold or hopeless,\n\nshe’d hear them out with patient respect\n\nand nudges toward clearer awareness.\n\nChickens got troubles? Kids in a bind?\n\nYour gov gone’ flat out totalitarian?\n\nA few words with J could mute alarms\n\nand reboot dreams Aquarian.\n\nI owe her too much and recall too well\n\nall the priceless insights she gifted me.\n\nI loved her as a comrade, icon and friend.\n\n(She was easy to love holistically.)\n\nAll who knew her will miss her terribly\n\nand regret the lost autobiography.\n\nShe’d swum the raging truth era seas\n\nand relished their wild demography.\n\nShe knew everyone, saw everything,\n\nfelt both the horrors & absurdities\n\nand could’ve fully fully humanized\n\nthe whole of truther tragi-comedy.\n\nShe gave so much to so many of us\n\ncan we just skip the church grief litany,\n\nthe aching moments of reverent hush,\n\nand loudly roar thanks for her epiphany.\n\nBut please keep sending us artful visions\n\nas we strive to fulfill thy sacred missions.\n\nYou stay strong as earthly yearnings soften.\n\nWe’ll light herb torches and check back often.\n\nA really courageous Kansas City woman passed away last week … Janice Matthews … perhaps the most courageous human being I have ever met. She stood up against the most powerful institutions and machines in the world … with a fragile peace sign.\n\nLike me, she was threatened for her work … but she stood undaunted … you will never read about her in history books … but, the universe knows what she did … what she sacrificed … and how it changed the world …\n\nI just sent this below message to Janice’s kids …\n\nI just heard about your mother, Janice, passing away. I wanted to tell you about how I met your mother, it was a profound moment in my life.\n\nI had been working alone since September 11, 2001, organizing a worldwide campaign to demand a NEW 9/11 investigation … after spending months connecting with a US Consulate officer named Michael Springmann, who said the CIA had FORCED the US Consulate office to let “known terrorists” into the United States.\n\nI had been collecting email addresses of 9/11 truth activists, and urging them to contact the United Nations and Media worldwide, and government, etc., and had gotten the UN flooded with demands for a 9/11 investigation.\n\nThen, I began receiving threats at my home … it was terrifying.\n\nSo, I went to the local peace and justice meetings I had been attending as part of my anti-Iraq War efforts. I told the group what I had been doing, and none of them responded.\n\nI didn’t want to be alone anymore … and appealed to them … I said I have been getting threats. The moment I said threats, EVERYONE in that room started grabbing their coats or checking their watches and saying, “Oh, time to go. Meetings over.” And they all walked out, quickly …\n\n… except for ONE person … your mother, Janice Matthews, one of the most courageous human beings I have, or will ever meet in my life. She not only stayed to hear my story … she dedicated herself to this movement for truth, justice, and peace … and eventually became THE head of the movement. Your mother changed the world in ways that you may never fully comprehend. She awakened millions of people, as her efforts echoed out. She may have prevented future wars.\n\nI feel so proud to have known such a person as Janice Matthews … and to have stood with her, for what was … not convenient, or safe … but, for what was right.\n\nI truly believe Janice was given a ticker-tape parade when she went to the other realms, and God knows she deserved it.\n\nGod bless you, and your mother.\n\nBill Douglas, co-founder of 911truth.org\n\nI first met Janice Matthews on this site’s forum. She moderated what people were posting. Our friendship started there. It was a “base of operations” for activists to share ideas and information.\n\nAt the time, people like me were posting 9/11 information on Howard Stern’s Bulletin Board (HSBB). Howard had over 300k users and posted a bad “9/11 Conspiracy Film” to his site one day. So, we tried to bring attention to the issue on his site.\n\nBecause I am who I am, I posted more than most. The “Republicans” (this is who we were dealing with before “debunkers”) hated me. Eventually, they figured out that activists gathered at septembereleventh.org. I had made it known that I dedicated my 9/11 work to my deceased Grandfather. The “Republicans” from Howard’s site signed up with usernames like “GoldsDeadGrandfather,” etc… they were causing enormous headaches for poor Janice. So much so that she had to shut down the forum. Because of that, I felt horrible. I started up my own site to give people a place to congregate because of it.\n\nOver the years, she helped me through a lot of things as a friend, and as an activist. She was a sounding board for me. Eventually, we worked together on 911truth.org’s Steering Committee.\n\nJanice and Mike Berger (also from 911truth.org) opened up a publishing company. I paid for them to publish my first book. Janice also edited the book. I was thrilled that she was the one to do it because of her knowledge concerning the issue and because of how well she knew me.\n\nWe lost touch over the years, and very recently (just a few weeks ago) reconnected. Finding out that she is gone so quickly after reconnecting is devastating.\n\nThere was a time when she was like a big sister to me. I will forever miss her and cherish the fact that she was a part of my life.", "opengraph": {"locale": "en_US", "type": "article", "title": "In Memoriam: Janice Ann Matthews (1960 - 2021) - 911Truth.Org", "description": "Janice Ann Matthews, age 60, cherished mother and grandmother, sister, daughter, and friend, passed away unexpectedly on February 27th, 2021", "url": "https://911truth.org/in-memoriam-janice-ann-matthews-1960-2021/", "site_name": "911Truth.Org", "article:published_time": "2021-03-05T09:51:20+00:00", "article:modified_time": "2022-09-16T03:03:51+00:00", "image": "https://911truth.org/wp-content/uploads/matthews-janice-cropped-pic-for-obit-100x70-1.jpg", "image:width": "100", "image:height": "70", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://web.archive.org/web/20051108102328/http://www.septembereleventh.org/", "https://web.archive.org/web/20041206090536/http://www.septembereleventh.org/forum/ubbthreads.php", "https://www.911truth.org/ancien/index2.html", "https://911truth.org/achievements/", "https://911truth.org/911rtt/", "https://www.nytimes.com/2006/06/05/us/05conspiracy.html", "https://911truth.org/91107-global-day-of-action-an-open-letter-from-donna-marsh-oconnor/", "mailto:mike@911truth.org"], "authors": ["", "Staff"], "publish_date": "2021-03-05T09:51:20+00:00"}