{"result_id": "005016", "URL": "https://911truth.org/assessing-911-evidence-a-reliable-source-for-a-media-under-pressure/", "timestamp": "2023-04-25 11:45:49 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://911truth.org/wp-content/uploads/Liberty-head-icon.png", "canonical": "https://911truth.org/assessing-911-evidence-a-reliable-source-for-a-media-under-pressure/", "encoding": "UTF-8"}, "image": null, "domain": "911truth.org", "title": "Assessing 9/11 Evidence: A Reliable Source for a Media Under Pressure", "cleaned_text": "October 19, 2011 — Increasingly the media is having to deal with evidence emerging against the official story of the 9/11 attacks.\n\nFor example, on October 10th, the New York Times revised its earlier reports on the source of the anthrax spores used in the frightening attacks on members of the media and the Senate, following 9/11.\n\nThe letters carrying the spores seemingly originated from a Muslim hand, and the spores were considered by the FBI to be low-tech.\n\nThe longest investigation in the FBI’s history finally traced the spores to a deranged “lone-nut” working in the Fort Dietrick, Maryland, bioweapons laboratory.\n\nThe alleged culprit, Dr. Bruce Ivins, apparently committed suicide in 2008 following intensive FBI allegations against him, and the FBI closed the case.\n\nHowever, it transpired that Dr. Ivins was a respected vaccine researcher with many publications to his credit, and a following of loyal colleagues.\n\nAn 18-month National Academy of Science investigation into the case has recently found that the weaponized spores were far too high-tech for one person to have made, and is suggesting a new investigation to replace the inadequate FBI account.\n\nIn a different news story, on October 17th, Britain’s BBC’s Today Programme interviewed FBI whistleblower Ali Soufan,\n\nSoufan revealed — as had White House former anti-terror chief Richard Clarke some weeks before him — that the CIA deliberately blocked FBI warnings of impending hijacker attacks — warnings that could have prevented the attacks.\n\nThese press reports lean towards evidence of domestic complicity in the attacks, long believed by independent researchers. But some pundits say that journalists are not qualified to challenge the government’s technical reports on the building collapses and the Pentagon attack — that expert opinion must be engaged if these reports are to be meaningfully challenged.\n\nSuch opinion is now available from the new 9/11 Consensus Panel, an international body of 21 experts in physics, engineering, chemistry, and other disciplines.\n\nThe Panel, in reviewing the evidence, selected the Delphi Method, which is used by medical panels to develop consensus statements that guide doctors towards “best-evidence” state-of-the-art treatment guidelines.\n\nIn a Delphi study, proposed statements are mailed to recipients who remain blind to one another and who rank and provide feedback on the statements being considered. When successive rounds of feedback have refined a statement to a high level of consensus, the statement is considered to be the “best evidence” on that topic.\n\nThe 9/11 Consensus Panel’s 21 experts spent nearly a year developing its first group of 13 Consensus Points of evidence relating to the official account of the events of September 11, 2001.\n\nThe Points achieved consensus of 90-100%, and are available at consensus911.org.\n\nThis truth is not a conspiracy theory or the speculation of uninformed people.\n\nIt is scientifically derived evidence and offers the media the confidence it needs to address the expanding cracks in the 9/11 narrative — which don’t seem likely to go away soon.", "opengraph": {"locale": "en_US", "type": "article", "title": "Assessing 9/11 Evidence: A Reliable Source for a Media Under Pressure - 911Truth.Org", "description": "FOR IMMEDIATE RELEASE October 19, 2011 — Increasingly the media is having to deal with evidence emerging against the official story of the 9/11 attacks. For example, on October 10th, the New York Times revised its earlier reports on the source of the anthrax spores used in the frightening attacks on members of the media […]", "url": "https://911truth.org/assessing-911-evidence-a-reliable-source-for-a-media-under-pressure/", "site_name": "911Truth.Org", "article:published_time": "2011-10-20T13:35:47+00:00", "article:modified_time": "2020-09-27T22:37:02+00:00"}, "tags": ["White House"], "tweets": [], "movies": [], "links": ["http://www.consensus911.org", "http://www.consensus911.org", "http://www.consensus911.org/media-contacts/"], "authors": ["", "Staff"], "publish_date": "2011-10-20T13:35:47+00:00"}