{"result_id": "005009", "URL": "https://911truth.org/former-fbi-translator-bin-laden-worked-for-u-s-right-up-until-911/", "timestamp": "2023-04-25 11:45:40 CEST+0200", "meta": {"description": "Bin Laden worked for the U.S. right up to 9/11 and that fact is being covered up. US outsourced terror operations to al Qaeda and the Taliban", "lang": "en", "keywords": "", "favicon": "https://911truth.org/wp-content/uploads/Liberty-head-icon.png", "canonical": "https://911truth.org/bin-laden-911-inside-job/", "encoding": "UTF-8"}, "image": null, "domain": "911truth.org", "title": "Former FBI Translator: Bin Laden Worked for U.S. Right Up Until 9/11", "cleaned_text": "Before you hear what she has to say, you should know a little about Sibel Edmonds’ background.\n\nEdmonds is a former FBI translator, who the Department of Justice’s Inspector General and several senators have called extremely credible (free subscription required).\n\nSome of Edmonds allegations’ have been confirmed in the British press.\n\nNow, Edmonds is saying that Osama Bin Laden worked for the U.S. right up until 9/11, and that that fact is being covered up because the US outsourced terror operations to al Qaeda and the Taliban for many years.\n\nIs there are confirmation of Edmonds’ claim?\n\nAccording to one of the most reputable French papers, CIA agents met with Bin Laden two months before 9/11, when he was already supposedly wanted for the bombing of the U.S.S. Cole.\n\nTwo days before 9/11, Bin Laden called his stepmother and told her “In two days, you’re going to hear big news and you’re not going to hear from me for a while.” US officials later told CNN that “in recent years they’ve been able to monitor some of bin Laden’s telephone communications with his [step]mother. Bin Laden at the time was using a satellite telephone, and the signals were intercepted and sometimes recorded.” Indeed, before 9/11, to impress important visitors, NSA analysts would occasionally play audio tapes of bin Laden talking to his stepmother.\n\nSo American forces had many opportunities to capture Bin Laden, and yet failed to do so.\n\nIndeed, even after 9/11, the U.S. military consciously let Bin Laden evade caputre:\n• The CIA commander in charge of the capture of Bin Laden during the invasion of Afghanistan said that the U.S. Bin Laden escape from Afghanistan\n• A retired Colonel and Fox News military analyst said:\n\n “We know, with a 70 percent level of certainty — which is huge in the world of intelligence — that in August of 2007, bin Laden was in a convoy headed south from Tora Bora. We had his butt, on camera, on satellite. We were listening to his conversations. We had the world’s best hunters/killers — Seal Team 6 — nearby. We had the world class Joint Special Operations Command (JSOC) coordinating with the CIA and other agencies. We had unmanned drones overhead with missiles on their wings; we had the best Air Force on the planet, begging to drop one on the terrorist. We had him in our sights; we had done it ….Unbelievably, and in my opinion, criminally, we did not kill Usama bin Laden.”\n• French soldiers insist that they easily could have captured or killed Bin Laden, but that the American commanders stopped them.\n\nThis is how a government treats its own agents, not foreign terrorists.\n\nFor background, you may wish to note that the Congressional Joint Inquiry into 9/11 discovered that an FBI informant had hosted and rented a room to two hijackers in 2000 and that, when the Inquiry sought to interview the informant, the FBI refused outright, and then hid him in an unknown location, and that a high-level FBI official stated these blocking maneuvers were undertaken under orders from the White House (confirmed here by the Co-Chair of the Joint Inquiry and former Head of the Senate Intelligence Committee, Bob Graham; and see this Newsweek article).\n\nAnd that a key Al Qaeda trainer actually worked with the Green Berets and the CIA and was an FBI informant.\n\nAnd that the CIA may have helped most of the 9/11 hijackers get their visas to the U.S.\n\nAnd that the government heard the hijackers’ plans from their own mouths.", "opengraph": {"locale": "en_US", "type": "article", "title": "Former FBI Translator: Bin Laden Worked for U.S. Right Up Until 9/11 - 911Truth.Org", "description": "Bin Laden worked for the U.S. right up to 9/11 and that fact is being covered up. US outsourced terror operations to al Qaeda and the Taliban", "url": "https://911truth.org/bin-laden-911-inside-job/", "site_name": "911Truth.Org", "article:published_time": "2009-08-01T12:18:29+00:00", "article:modified_time": "2021-09-09T13:39:03+00:00"}, "tags": ["Taliban", "Sibel Edmonds", "Afghanistan", "White House", "Air Force", "Al Qaeda", "Osama Bin Laden"], "tweets": [], "movies": [], "links": ["http://www.nytimes.com/2005/01/15/national/15translate.html?ex=1153886400&en=13842175814b8e8c&ei=5070", "http://blogs.guardian.co.uk/greenslade/2008/01/us_journalists_ignore_sunday_t.html", "http://www.dailykos.com/storyonly/2009/7/31/63124/3823", "http://www.guardian.co.uk/waronterror/story/0,1361,584444,00.html", "http://www.historycommons.org/context.jsp?item=a090901stepmother#a090901stepmother", "http://web.archive.org/web/20060217051331/http://www.msnbc.msn.com/id/8853000/site/newsweek/", "http://www.foxnews.com/story/0,2933,304306,00.html", "http://www.juancole.com/2008/11/afghan-article-says-us-bin-ladin-hunt.html", "https://web.archive.org/web/20140125100617/http://www.buzzflash.com/contributors/05/11/con05439.html", "http://www.nytimes.com/2004/09/08/politics/08graham.html", "http://www.newsweek.com/id/65649", "http://www.washingtonsblog.com/2009/06/triple-cross-or-inside-job.html", "http://www.historycommons.org/context.jsp?item=a1987springmann#a1987springmann", "http://georgewashington.blogspot.com/2007/04/government-heard-911-plans-from.html", "http://www.reddit.com/r/politics/comments/96ewe/dear_reddit_here_is_background_for_the_sibel/", "http://www.reddit.com/r/politics/comments/96f5j/bombshell_bin_laden_worked_for_us_till_911_he_al/", "http://www.reddit.com/r/politics/comments/96bko/former_fbi_translator_sibel_edmonds_dropped_a/", "http://www.reddit.com/r/politics/comments/96f5j/bombshell_bin_laden_worked_for_us_till_911_he_al/"], "authors": ["", "George Washington"], "publish_date": "2009-08-01T12:18:29+00:00"}