{"result_id": "005006", "URL": "https://911truth.org/the-anthrax-case-reopens-why-did-the-fbi-let-the-fort-detrick-scientists-investigate-themselves/", "timestamp": "2023-04-25 11:45:36 CEST+0200", "meta": {"description": "FBI Director Robert Mueller found himself under fire for not having answers to their questions. Republican Arlen Specter was furious at Mueller for his unwillingness", "lang": "en", "keywords": "", "favicon": "https://911truth.org/wp-content/uploads/Liberty-head-icon.png", "canonical": "https://911truth.org/the-anthrax-case-reopens-why-did-the-fbi-let-the-fort-detrick-scientists-investigate-themselves/", "encoding": "UTF-8"}, "image": null, "domain": "911truth.org", "title": "The Anthrax Case Reopens: Why Did the FBI Let the Fort Detrick Scientists Investigate Themselves?", "cleaned_text": "The Congressional anthrax hearings of September 16-17 revealed that public pressure is keeping the doors open in the anthrax case. FBI Director Robert Mueller promised that the FBI will provide their evidence to a panel of experts for scientific evaluation. The battle will now turn to the independence of this panel, and whether “all evidence” or merely “scientific evidence” will be under review.\n\nDuring the hearings, Mueller found himself under fire by Senator Patrick Leahy and Congressman John Conyers for not having answers to their questions. Republican Arlen Specter was furious at Mueller for his unwillingness to assure them that Congress would have a role in determining the panel’s composition.\n\nMeanwhile, new evidence shows just how deeply wrong ABC and Washington Post reporters have been over the years on their coverage of the anthrax attacks. They can’t have it both ways: Either they made repeated “mistakes” by relying on their sources, or several people deliberately lied in order to advance war on Iraq.\n\nIn his recent book Taking Heat, former White House secretary Ari Fleischer wrote that Bush was more shook up by the anthrax attacks than by any other event. White House officials repeatedly pressed Mueller to prove it was a second-wave assault by al-Qaeda or Iraq. After days of provocative statements designed to scare the American people, Cheney himself believed that he had been exposed to anthrax. Although the test results were negative, October 18, 2001 , was the moment when Cheney decided to withdraw to an “undisclosed location” and carry biodefense protection during all of his mysterious travels.\n\nValuable light was shed on the case recently by the admission of acclaimed scientist Peter Jahrling that he had made an “honest mistake” when he told the White House on October 24, 2001, that he saw signs that silica had been added to the anthrax that had arrived at Senator Daschle’s office the previous week. If silica or another anti-clumping substance had been artificially added or coated onto this anthrax, it would have made it more buoyant and easier to penetrate the lungs. Jahrling, a virologist, said that he had been “overly impressed” by what he thought he had seen, and added that “I should never have ventured into this area .”\n\nJahrling’s error was seized upon just two days later on October 26, 2001, when Gary Matsumoto, Brian Ross, and other members of ABC News issued a national story asserting that Iraqi-made bentonite was coating the anthrax. It took until the 29th for the head of Fort Detrick to state authoritatively that Matsumoto and ABC had gotten it wrong. Even then, Matsumoto continued to argue that either Fort Detrick was wrong about the bentonite or the story about the presence of silica provided an alternative theory for “state-sponsored terrorism.”\n\nDuring this same time period, Matsumoto was in the midst of conducting FOIA requests for the anthrax records (see page 15) maintained by Bruce Ivins. Matsumoto had been researching Ivins for some time, as he believed that Ivins’ experimental anthrax vaccine was the cause of many injuries among veterans during and after the 1991 Gulf War. Years later, Matsumoto wound up writing a book on the subject, Vaccine A, accusing Ivins and his fellow inventors of being responsible for Gulf War Syndrome. This controversy caused the FDA to suspend further production of the anthrax vaccines for the market.\n\nMatsumoto’s theory that the attack anthrax contained “additives and coatings” was thoroughly rebutted in a Scientific American article printed last Friday , which detailed Sandia National Labs’ investigation in early 2002. The Department of Justice had asked Sandia to see if Matsumoto and Jahrling’s claims of an anti-clumping additive coating the anthrax were correct. It was already undisputed that this anthrax was ultra-pure, and the finding that they contained a trillion spores per gram was a sign that it was of US origin.\n\nIn February 2002, Sandia materials scientist Joe Michael and his team found that silicon was indeed present in the anthrax. Then the team stepped it up a notch with the use of highly sensitive microscopes not available to earlier researchers. Everyone was stunned by what they saw: The silicon was growing naturally within the anthrax spores – it was not artificially added, and there was no coating or residue of silicon anywhere outside the anthrax. The team could find no way for the silicon to enter the spores without leaving any residue.\n\nBy March of 2002, Michael was convinced that there was no additive or coating in the anthrax. However, Michael and his team were forced to keep silent until last month, when their promise to keep silent was lifted. Even when the Armed Forces Institute of Pathology mistakenly identified a finding of silicon and water in the anthrax as “silica” (silicon dioxide) in late 2002, and Matsumoto used this story as the centerpiece of his Washington Post article on the anniversary of the attacks, Michael had to maintain silence.\n\nThe irony of the current situation is that although the FBI appears to have correctly analyzed the contents of the anthrax, many observers simply don’t believe the agency. It’s understandable when one considers the FBI’s track record in this case. Just last month, without revealing any supporting evidence, US Attorney Jeff Taylor and FBI official Joseph Persichini announced their conviction that not only was Bruce Ivins the anthrax attacker, but that “he acted alone.” A Leahy aide said that law enforcement agencies make such statements “to make people feel better.”\n\nSenator Leahy told Director Mueller at the Wednesday hearing that ” I believe there are others involved , either as accessories before or accessories after the fact … I just want you to know how I feel about it, as one of the people who was aimed at in the attack.” FBI investigator Thomas Dellafera has stated in his search warrant affidavit (See page 15) that he believes Leahy and Daschle were targeted by the anthrax attacker as revenge for their roles – while they served as judiciary committee chief and majority leader – in opposing swift passage of the PATRIOT Act.\n\nAs noted above, the immediate assumption during the initial days of the investigation was that Iraq was the anthrax source. However, on October 5, 2001, Dr. Paul Keim at Northern Arizona University told the Federal Centers for Disease Control that reporter Robert Stevens had been stricken by the Ames strain of anthrax (Philadelphia Inquirer, 9/1/2008); such a finding is very strong evidence of US origin. Five days later, the FBI allowed what was mistakenly believed to be the original batch of the Ames strain of anthrax to be destroyed by Iowa University officials who had it in their custody. The FBI claimed it never approved the destruction and merely failed to oppose it. (New York Times, 11/9/2001)\n\nDuring this period, the FBI was relying on Fort Detrick for scientific advice. Bruce Ivins handled the anthrax shortly after it arrived at Democratic majority leader Tom Daschle’s office on October 15. In 2002, Judith Miller wrote that “when Fort Detrick scientists attempted to place it on a scale, many of the spores drifted away, depriving investigators of critical evidence.” (Germs, p. 325) Ivins’ supervisor, Jeffrey Adamovicz, claims that the envelope was placed in a double-sealed bag before it was opened, but admits that Ivins was present and that the floating anthrax was “very scary.” (New York Times, 8/7/2008).\n\nIvins then went to the Pentagon to discuss the results. ” It puts us in a difficult position ,” one senior law enforcement official admitted in December 2001. “We’re working with these people and looking at them as potential suspects.”\n\nIn the aftermath of the anthrax scare, the FBI got together with a number of renowned scientists and made a plan for a battery of tests on the composition of the spores. By December, it was clear that the anthrax strain used in the attacks was identical with a strain originating from Dugway Proving Grounds in Utah , that Dugway and four other labs had material with the same genetic fingerprint, and that all five labs received their strain from Fort Detrick . (Rick Weiss & Susan Schmidt, Washington Post, 12/16/01) A BBC investigation concluded that Fort Detrick was the focus of the FBI’s investigation ( Newsnight, 3/14/02 ), while the Wall Street Journal’s sources concluded the FBI was looking at Fort Detrick and Dugway .\n\nProfessor Barbara Hatch Rosenberg, a former bioterrorism consultant to President Clinton, said publicly during February 2002 that the FBI was focusing on a former Fort Detrick scientist who now worked for a Washington, DC-area military contractor for the CIA. Although she did not reveal the name at the time, she was referring to virologist Dr. Steven Hatfill. This marked a shift from her stated belief just two months earlier that the culprit was a microbiologist working at Fort Detrick. A few days later, other government sources affirmed to the Washington Times that Hatfill was the prime suspect .\n\nDuring this time, the FBI made a very puzzling decision. Although the evidence was pointing to a scientist within Fort Detrick as the probable culprit, they continued to send anthrax investigation samples to that facility for testing. Forensic expert Henry C. Lee stated that unless the FBI was convinced that the\n\nFort Detrick scientists were innocent, the agency wouldn’t be sending them any samples.\n\n“These last two months, [FBI agents] have probably interviewed everyone at Fort Detrick and didn’t find a suspect … They don’t want to publicly rule anyone out, but their actions suggest that’s what’s going on. They don’t think it’s anybody who currently works at Detrick.” ( Anthrax Story: Detrick Cleared , Frederick News-Post, 3/6/02)\n\nBetween September 11 and March, Fort Detrick received 24,000 samples of potential bioterrorism evidence for Ivins and 90 other scientists to analyze. About a dozen members of Fort Detrick’s bacteriological division ultimately testified before the grand jury .\n\nThe FBI admits that Ivins helped them to design the protocol for proceeding with future examinations of the anthrax during February 2002. Accordingly, within five days of the issuance of the subpoena that month, Ivins was the first scientist to provide a sample from his lab. However, it was not in full compliance with the protocol . “He didn’t use the proper medium … there was no guarantee that he prepared it in the way that the instructions directed.”\n\nFor that reason, the FBI claims that they destroyed their February 2002 sample, and asked him to provide a second one in April 2002. The second sample was improper, as Ivins allegedly did not take it from the right flask. The FBI admits that the destruction of this first sample marks the only destruction of any anthrax material obtained during this investigation. In a stroke of good luck, the aforementioned Dr. Keim at Northern Arizona University kept a copy of this sample, and provided it to the FBI in 2006 when a new team of investigators re-examined the evidence .\n\nIn May 2002, it was reported that the FBI had previously conducted polygraphs of 10 Fort Detrick scientists. FBI affidavits reveal that Ivins was among that group. The agency then expanded the polygraphs to 200 employees of Fort Detrick and Dugway. The next month, the FBI’s questioning of a former government microbiologist indicated their working theory: A Fort Detrick insider produced the spores at the lab, and then refined them into a powder at an unknown location . On June 25, the FBI conducted its first search of Hatfill’s home and property, the first in a series of a four year investigation.\n\nFrom that point on, the four-year wild goose chase of Steven Hatfill as a suspect began in earnest . During this time, Fort Detrick’s former bacteriology chief Gerry Andrews stated that “for years … Dr. Ivins himself worked directly with the evidence. The FBI asked Dr. Ivins to help them with the forensics in the case by analyzing the contents of suspicious letters.”\n\nFBI investigator Dellafera’s affidavit (See page 15) states that by this time “the FDA had re-approved [Ivins’] vaccine for human use, production at Bioport resumed, and anthrax research at [Fort Detrick] continued without interruption … Dr. Ivins thereafter received ‘the highest honor given to Defense Department civilians at a Pentagon ceremony … for his work in getting the anthrax vaccine back into production.'” A multi-billion dollar bioterrorism industry was jump-started, making anthrax readily accessible to thousands of new employees.\n\nDuring late 2002, Ivins was on the scene at one of the searches at Hatfill’s pond . During that search, a homemade glove box and a biological safety device with hand-holes to protect someone working with dangerous germs were found in the pond . The box yielded no forensic evidence. The pond was subsequently drained, to no avail. The discovery of the box is not proof that Ivins planted the box on Hatfill’s property, or that Hatfill hid it there. It is, of course, highly provocative.\n\nA break in the case came in 2003 , when a handful of genetic mutations – distinguishing marks in the DNA – were noticed in cultures created from spores from the attack envelopes. Four mutations were turned into tests for the 1,070 samples. Seven samples tested positive for all four mutations. Notebooks revealed that all seven samples originated from two flasks in Ivins’ lab, known as RMR-1029. The FBI moved in 2004 and seized the RMR-1029 flasks. Like the seven samples, these flasks tested positive for all four mutations.\n\nBy late 2005 or so, this positive finding was proven scientifically sound. The bureau then turned to a new phase : Who had access to these flasks and their seven descendents? The next three years were spent looking at Ivins and the “100 scientists” that the FBI estimates had such access. The FBI did not ask Dr. Keim for his copy of Ivins’ original sample from February 2002 until late 2006, when a new team of FBI agents re-examined the evidence. In April 2007, the DOJ prosecutors mailed a letter to Ivins telling him that he was “not a target” in the investigation. (New York Times, 9/6/2008)\n\nFor the last year of his life, the FBI violated their guidelines by openly surveilling Ivins in their cars. (New York Times, 8/4/2008) FBI head investigator Robert Roth admitted in the Hatfill affair that this tactic violated agency guidelines. “Generally, it’s supposed to be covert,” Roth said. (Associated Press, 8/5/2008)\n\nIvins’ security clearance at Fort Detrick was not taken away until November 2007, and he continued to work at Fort Detrick until three weeks before his death. (Herald-Mail, 8/8/2008)\n\nLook at this curious story, drawn from the public record. The Bush administration wanted to pin the blame for the anthrax attacks on Iraq. Gary Matsumoto and other members of ABC and the Washington Post helped strengthen that story – then and later – even though it was unsupported by the evidence. Matsumoto is a man obsessed with the belief that Ivins killed or injured thousands of Gulf War vets due to errors that were made in the production of his experimental anthrax vaccine.\n\nDuring the first days of the case, one or more FBI agents permitted the destruction of an anthrax sample that made it more difficult to trace the identity of the culprit. The FBI turned to Fort Detrick to review the anthrax evidence in this case, even though the Fort Detrick scientists were central among the prime suspects. Ivins was with the first group to handle the anthrax evidence, may have destroyed some of the evidence under his care, and proceeded to report to the Pentagon.\n\nThe FBI continued to rely on Ivins for developing the protocol for the handling of the anthrax evidence, and to examine suspicious letters for a period of years. Of the two samples obtained from Ivins in 2002, one or more FBI agents caused the destruction of the one that pointed strongly to his guilt, and Ivins allegedly provided the second sample from the wrong flask. Two years later, in 2004, the FBI seized two key evidence flasks from Ivins’ custody that proved to contain the ancestor of all seven samples that matched the attack anthrax. Although this analysis was proven to be scientifically sound by late 2005, Ivins did not lose his security clearance until November 2007, and even then was allowed access to Fort Detrick until three weeks before his death.\n\nIt is curious that Ivins maintained his security clearance for two years, and access to Fort Detrick for three years, while in the cross-hairs of this investigation.\n\nIt is curious that the FBI ever relied on Fort Detrick for evidence testing, since many of its scientists were also under suspicion from day one.\n\nMore must be learned about the stories of repeated destruction or fabrication of evidence:\n• The FBI’s permission to destroy what was believed to be the original Ames strain;\n• Ivins’ alleged loss of much of the Daschle anthrax;\n• Matsumoto’s sources’ claims of bentonite and other coated additives pointing to Iraqi origin;\n• The FBI agents who caused the destruction of Ivins’ February 2002 sample;\n• Rosenberg being “tipped” away from a Fort Detrick microbiologist to a DC-area employee for a CIA contractor by February 2002 (Hatfill);\n\nMore must be learned about why the Department of Justice told Ivins that he was not a target in April 2007. Perhaps it was to lull Ivins into a false sense of security.\n\nMore must be learned about why the FBI hounded Ivins and his family with overt surveillance for the last year of his life until he committed suicide. Hatfill received a settlement of 5.8 million dollars, in part for similar conduct in his case. Such overt surveillance was in defiance of the established agency guidelines. Such intense surveillance can cause a suspect to commit suicide.\n\nIt’s good that the scientific evidence will be reviewed, but that is not enough. A special prosecutor must be appointed in a neutral fashion who can review every aspect of the FBI’s work in this case. Congressman Rush Holt is calling for a national commission that would assess the investigation and Ivins’ culpability, but a prosecutor might have better horse-sense . There is no way to be certain of Ivins’ guilt at this point. Based only on what has been publicly released, the claim that the perpetrator “acted alone” may prove to be an obstruction of justice.\n\nBill Simpich is a civil rights attorney in the San Francisco Bay Area. He can be contacted at bsimpich@gmail.com.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Anthrax Case Reopens: Why Did the FBI Let the Fort Detrick Scientists Investigate Themselves? - 911Truth.Org", "description": "FBI Director Robert Mueller found himself under fire for not having answers to their questions. Republican Arlen Specter was furious at Mueller for his unwillingness", "url": "https://911truth.org/the-anthrax-case-reopens-why-did-the-fbi-let-the-fort-detrick-scientists-investigate-themselves/", "site_name": "911Truth.Org", "article:published_time": "2008-10-01T00:57:28+00:00", "article:modified_time": "2015-09-04T22:06:28+00:00", "image": "https://911truth.org/wp-content/uploads/director-robert-s.-mueller-iii.jpg"}, "tags": ["Robert Mueller", "Dick Cheney", "FOIA", "White House", "Patriot Act", "Iraq"], "tweets": [], "movies": [], "links": ["http://www.truthout.org/093008A", "http://www.lasvegassun.com/news/2008/sep/20/overcoming-anthrax-doubts/", "http://www.nydailynews.com/news/us_world/2008/08/02/2008-08-02_fbi_was_told_to_blame_anthrax_scare_on_a.html", "http://abcnews.go.com/print?id=5368813", "http://www.latimes.com/news/nationworld/world/mideastemail/la-na-anthrax17-2008sep17,0,5244105.story", "http://www.anthraxinvestigation.com/abc.html#abc11101", "http://www.fbi.gov/page2/amerithrax-affidavits/08-431Affidavit07524.pdf", "http://www.sciam.com/article.cfm?id=sandia-anthrax-mailing-investigation", "http://www.usdoj.gov/opa/pr/2008/August/08-opa-697.html", "http://www.huffingtonpost.com/2008/09/18/leahy-anthrax-suspect-did_n_127410.html", "http://www.fbi.gov/page2/amerithrax-affidavits/08-431Affidavit07524.pdf", "http://anthraxinvestigation.com/nyt.html#nyt20130", "http://www.ph.ucla.edu/epi/bioter/UStriedfailediraqanthraxlink.html", "http://www.anthraxinvestigation.com/balt-sun.html", "http://www.ph.ucla.edu/epi/bioter/capitalhillanthraxarmy.html", "http://www.ph.ucla.edu/epi/bioter/anthraxattacks.html", "http://www.ph.ucla.edu/epi/bioter/FBIhonesinlabs.html", "http://www.ph.ucla.edu/epi/bioter/anthraxsuspectid.html", "http://www.ph.ucla.edu/epi/bioter/anthraxsususlab.html", "http://www.anthraxinvestigation.com/misc2.html#tn020228", "http://www.ph.ucla.edu/epi/bioter/anthraxprobemuddledinfo.html", "http://www.nytimes.com/2008/08/10/washington/10anthrax.html?pagewanted=3&_r=1", "http://docs.google.com/View?docid=dc3wqmd7_33d2tjs5ct", "http://www.nytimes.com/2008/08/21/science/21anthrax.html?pagewanted=all", "http://www.ph.ucla.edu/epi/bioter/fbipolygraphworkers.html", "http://www.ph.ucla.edu/epi/bioter/anthraxtheoryemerges.html", "http://www.latimes.com/news/nationworld/nation/la-na-probe29-2008jun29,0,6698711,full.story", "http://www.nytimes.com/2008/08/10/opinion/10andrews.html", "http://www.fbi.gov/page2/amerithrax-affidavits/08-431Affidavit07524.pdf", "http://www.nytimes.com/2008/08/08/washington/08scientist.html?_r=2&hp=&oref=slogin&pagewanted=print&oref=slogin", "http://www.ph.ucla.edu/epi/bioter/frederickpond.html", "http://www.philly.com/inquirer/health_science/weekly/20080901_Cracking_the_anthrax_case.html", "http://www.nytimes.com/2008/08/21/science/21anthrax.html?pagewanted=3", "http://www.nytimes.com/2008/09/24/washington/24anthrax.html?_r=1&adxnnl=1&oref=slogin&ref=us&adxnnlx=1222264801-jw7WZ3pNn3RHXuVnQXvrcQ", "http://www.truthout.org/093008A"], "authors": ["", "Staff"], "publish_date": "2008-10-01T00:57:28+00:00"}