{"result_id": "005002", "URL": "https://911truth.org/bringing-the-bio-war-home/", "timestamp": "2023-04-25 11:45:30 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://911truth.org/wp-content/uploads/Liberty-head-icon.png", "canonical": "https://911truth.org/bringing-the-bio-war-home/", "encoding": "UTF-8"}, "image": null, "domain": "911truth.org", "title": "Bringing the (Bio) War Home", "cleaned_text": "The 2001 anthrax attacks underscore the dangers posed to our health and safety\n\n by the Bioweapons-Industrial Complex.\n\nThe killer(s) employed a military-grade version of the deadly pathogen, a four-mutation\n\n blend of anthrax prepared at the government’s test site at the remote Dugway\n\n Proving Ground in Utah. Based on available evidence it’s a near certainty that\n\n the weapon came from stockpiles at the U.S. Army Medical Research Institute\n\n of Infectious Diseases (USAMRIID) in Ft. Detrick, Maryland.\n\nBefore the dust cleared prominent opposition politicians had been attacked,\n\n five people were murdered, 10,000 more were exposed and representative government\n\n ground to a halt as panic set in.\n\nAccording to multiple media reports, federal investigators concluded that the\n\n anthrax spores in the letters addressed to former Senate leader Tom Daschle\n\n (D-SD) and Senate Judiciary Chairman Patrick Leahy (D-VT) could only have been\n\n produced in a state-run lab. The weaponized version of the pathogen contained\n\n as many as one trillion spores per gram, a concentration sufficient enough\n\n to kill half the American population if widely distributed.\n\nBut rather than giving pause to Pentagon weaponeers, Big Pharma who profit handsomely\n\n from vaccine production, the $100 billion agribusiness empire that drives research\n\n and the politicians who do their bidding, decades-long U.S. biowar programs\n\n have miraculously morphed overnight into a new growth industry: “biodefense.”\n\nWhat had once been Washington’s dirty little secret has now blossomed into a\n\n $50 billion cash-cow for academic and corporate grifters, according to the Washington,\n\n D.C.-based Center\n\n for Arms Control and Non-Proliferation.\n\nAs the Bulletin\n\n of the Atomic Scientists pointed out last year, “massive U.S. biodefense\n\n spending and a buildup of high-containment laboratories throughout the country\n\n might have created an internal security risk that no outside terrorist group\n\n could ever duplicate. Nearly two dozen new federal and many more new private\n\n biosafety level 3 and 4 laboratories have been built in recent years, meaning\n\n a large cadre of scientists has access to extraordinarily lethal material.”\n\nIndeed, under the auspices of the Department of Homeland Security (DHS), the\n\n new National Biodefense Analysis and Countermeasures Center (NBACC)\n\n opened in 2008 at USAMRIID. The center conducts inherently dual-use classified\n\n research and is currently managed by the spooky Battelle National Biodefense\n\n Institute.\n\nUnder the rubric of preventing bioterrorism, one question that DHS has not answered\n\n is whether or not government scientists and private contractors will conduct\n\n illicit experiments that violate the Biological Weapons Convention?\n\nWe may never know. Claiming that research will not breach the BWC, DHS avers\n\n that a “Compliance Review Group” overseen by senior Homeland Security officials\n\n will monitor NBACC operations. However information, including the Review Group’s\n\n reports on Center operations or accidents at the facility may not be available\n\n under the Freedom of Information Act under cover of national security.\n\nWhile it is reasonable to protect the nation’s food supply from mischief, including\n\n sabotage by terrorists or deranged individuals armed with dangerous pathogens,\n\n work on animal diseases should be done transparently and safely. This however,\n\n is not the approach favored by the Department of Homeland Security.\n\nA culture of secrecy and cover-up permeates the agency; after all DHS answers\n\n to the militarized Office of the Director of National Intelligence (ODNI), the\n\n so-called security “czar” who oversees the 16-agency U.S. intelligence complex.\n\n“Food security” under such conditions is hardly amenable to public accountabilty;\n\n it is however, a formula that can be highly detrimental to our health, safety\n\n and well-being.\n\nWhen the Department of Homeland Security announced plans to phase out the Plum\n\n Island Animal Disease Center (PIADC) by 2015, the agency cited\n\n the need to “enhance our nation’s capacity to assess potential threats to humans\n\n and animals alike.”\n\nAverring that the Plum Island facility “is near the end of its lifecycle” and\n\n “is too small to meet the nation’s research needs,” DHS now plans to open the\n\n National Bio and Agro-Defense Facility (NBAF) on the campus of Kansas State\n\n University in Manhattan, Kansas. Estimated to cost taxpayers some $700 million\n\n to construct, the department plans to have the site up-and-running by 2014.\n\nThe authority for building the new facility comes from Homeland Security Presidential\n\n Directive 9 (HSPD-9):\n\n Defense of Agriculture and Food. HSPD-9 mandates that the secretaries of Homeland\n\n Security, Agriculture, and Health and Human Services; the administrator of the\n\n Environmental Protection Agency and the heads of other “appropriate” federal\n\n departments and agencies “in consultation” with the director of the Office of\n\n Science and Technology Policy, “accelerate and expand the development of countermeasures\n\n against the intentional introduction or natural occurrence of catastrophic animal,\n\n plant, and zoonotic diseases.”\n\nAccording to a 2007 report\n\n by the Congressional Research Service:\n\nA zoonotic disease is one that can easily be transmitted from animals to humans; examples include Rift Valley fever, Lyme Disease, West Nile virus, H1N1 and H5N1 influenza. These pathogens however, can also be deployed as plausibly deniable bioweapons, a point not addressed by government investigators.\n\n“Countermeasure licensure” of course, is a formula for handing over the fruit of publicly funded research to unaccountable private corporations who stand to make hefty profits from the manufacture of vaccines.\n\nMore pertinently, will America’s expanding “biodefense” industry serve as a cover for the manufacture of new weapons of war? As Watergate-era congressional investigations and multiple media reports have conclusively demonstrated, for decades the Central Intelligence Agency and the Pentagon employed far-right Cuban mercenaries to attack the economic and agricultural infrastructure of socialist Cuba. Indeed, Newsday reported as far back as 1977, that “operatives linked to anti-Castro terrorists introduced African swine fever virus into Cuba in 1971. Six weeks later, an outbreak of the disease forced the slaughter of 500,000 pigs to prevent a nationwide epidemic.” The African swine fever virus deployed in the attack according to participants, was believed to have originated from stockpiles stored at the Plum Island Animal Disease Center and handed over to CIA-trained terrorists at Ft. Gulick, an Army base in the former Panama Canal Zone. And in 1981 according to researcher William H. Schaap, Cuba was struck by a devastating epidemic of Dengue fever, “one of some 250 arthropod-borne viruses, or ‘arboviruses,’ diseases transmitted from one vertebrate to another by hematophagous arthropods–blood eating insects, usually mosquitoes.” “Dengue and other arboviruses” Schaap wrote, “are ideal as biological weapons for a number of reasons. Dengue, especially hemorrhagic dengue, is highly incapacitating; it can be transmitted easily through the introduction of infected mosquitoes; it will spread rapidly, especially in highly populated and damp areas.” Citing the simultaneous outbreak of the disease in three widely separated parts of Cuba and that it is “extremely unusual that such an epidemic would commence in three localities at once,” and the absence of the disease on adjacent islands such as Haiti and the Dominican Republic, Schaap concludes that the pathogen was purposely introduced into Cuba as a bioweapon. Indeed, Army researchers at Ft. Detrick had conducted dispersal studies of the Aedes aegypti mosquito–and Dengue fever–used in the 1981 attack against the island nation. The epidemic which hit Cuba in May 1981 was of type 2 dengue with hemorrhagic shock. Except for the type 1 epidemic reported in 1977, this was the first major dengue outbreak in Cuba since 1944, and, most importantly, the first in the Caribbean since the turn of the century to involve hemorrhagic shock on a massive scale. From May to October 1981 there were well over 300,000 reported cases, with 158 fatalities, 101 involving children under 15. At the peak of the epidemic, in early July, more than 10,000 cases per day were being reported. More than a third of the reported victims required hospitalization. By mid-October, after a massive campaign to eradicate Aedes aegypti, the epidemic was over. (William H. Schaap, “The 1981 Cuba Dengue Epidemic,” Washington, D.C.: Covert Action Information Bulletin, Number 17, Summer 1982) And if the past is any guide to future actions by the Pentagon and the so-called Intelligence Community, what can we infer from DHS’s stated goal of standing-up NBAF as a center for assessing “potential threats to humans and animals alike”? As it turns out, quite a lot. Government Accountability Office (GAO) investigators charge that DHS relied on “a rushed, flawed study” to justify its decision to locate the $700 million research facility for highly infectious pathogens “in a tornado-prone section of Kansas, according to a government report,” The Washington Post reported July 26. The dubious report in question, United States Department of Agriculture Biocontainment Feasibility Studies, Study Report: Plum Island Animal Disease Center, was commissioned by the U.S. Department of Agriculture (USDA) and prepared by the giant defense and security firm Science Applications International Corporation (SAIC). Talk about feathering one’s own nest! SAIC’s Frederick, Maryland advanced technology division (near Ft. Detrick) has partnered-up with with a host of federal agencies including the U.S. Army Medical Research Institute for Infectious Diseases, the Pentagon’s primary biowarfare research center. Needless to say, the spooky firm has considerable clout in Washington. According to Washington Technology’s “2009 Top 100 Federal Prime Contractors” list, SAIC clocks-in at number 7 (just behind KBR Inc.) with some $4,811,194,800 in revenue, the bulk of earnings coming from defense and security contracts with the federal government. Last year however, a preliminary GAO report was unveiled during hearings before Congress’ Subcommittee on Oversight and Investigations, Committee on Energy and Commerce. It was highly critical of the flawed reasoning behind DHS’s NBAF decision and SAIC’s report. Relying on USDA’s 2002 study, GAO auditors found that the agency, has neither conducted nor commissioned any study to determine whether work on foot-and-mouth disease (FMD) can be done safely on the U.S. mainland. Instead, in deciding that work with FMD can be done safely on the mainland, DHS relied on a 2002 U.S. Department of Agriculture (USDA) study that addressed a different question. The study did not assess the past history of releases of FMD virus or other dangerous pathogens in the United States or elsewhere. It did not address in detail the issues of containment related to large animal work in BSL-3 Ag facilities. It was inaccurate in comparing other countries’ FMD work experience with that of the United States. Therefore, GAO believes DHS does not have evidence to conclude that FMD work can be done safely on the U.S. mainland. (Nancy Kingsbury, Managing Director Applied Research and Measurements, Government Accountability Office, High-Containment Laboratories: DHS Lacks Evidence to Conclude That Foot-and-Mouth-Disease Research Can Be Done Safely on the U.S. Mainland, Testimony Before the Subcommittee on Oversight and Investigations, Committee on Energy and Commerce, House of Representatives, May 22, 2008, GAO-08-821T) The SAIC review addressed a different issue: whether or not it is “technically feasible” to conduct such research on the U.S. mainland. GAO averred, “This approach fails to recognize the distinction between what is technically feasible and what is possible, given the potential for human error.” Citing “methodological problems” in SAIC’s study, GAO auditors found that the report: “(1) did not assess the history of releases of FMD virus or other dangerous pathogens, (2) did not address in detail the issues related to large animal work in BSL-3 Ag facilities, and (3) was inaccurate in comparing other countries’ FMD work experience with that of the United States.” GAO concluded that among the report’s more glaring and obvious problems, “(1) the study used an ad hoc method to select its expert panel that was not necessarily free from bias; (2) the study report was written by a single third-party person under contract for that purpose who was not present during the panel discussions; and (3) no concern was taken to ensure that the expert panel members reviewed either the draft or the final version of the report. At least one expert panel member expressed disappointment with the slant of the report.” Indeed, the SAIC review failed to address the issue of past releases of FMD or other pathogens, nor did it assess “the general history of accidents within biocontainment facilities.” No small matter when it comes to potential mischief or lax safety standards known to exist at such facilities. According to GAO, “the study panel members we interviewed said that no data on past accidents with or releases of either FMD or other pathogens was systematically presented or discussed. Rather, the panel members recalled that they relied on their own knowledge of and experience with the history of releases in a general discussion.” In a follow-up report published in July 2009, GAO discovered that DHS’s Environmental Impact Statement (EIS) was wholly inadequate and in fact, relied on flawed and outdated methodology to arrive at their conclusions. According to GAO auditors “Comments on the NBAF draft EIS included the following concerns:” * the ability of DHS and the federal government in general to safely operate a biosafety facility such as the proposed NBAF;\n\n* the potential for a pathogenic release through accidents, natural phenomena, and terrorist actions;\n\n* our May 2008 testimony that concluded that DHS had not conducted or commissioned a study to determine whether FMD research could be conducted safely on the U.S. mainland;\n\n* natural phenomena such as tornadoes, earthquakes, and hurricanes that could cause catastrophic damage to the NBAF and result in the release of a pathogen;\n\n* the possibility that an infected mosquito vector could escape, allowing a pathogen such as Rift Valley Fever virus to become permanently established in the United States;\n\n* the economic effects of a release or a perceived release on the local, state, and national livestock industry. (United States Government Accountability Office, Report to Congressional Committees, Biological Research: Observations on DHS’s Analyses Concerning Whether FMD Research Can Be Done as Safely on the Mainland as on Plum Island, July 2009, GAO-09-747) Indeed similar to the earlier USDA study, DHS’s EIS failed to include even a cursory analysis of multiple releases of the FMD virus at Plum Island itself. No matter, full speed ahead! Leading the charge to site NBAF at Kansas State University is the Kansas Bioscience Authority (KBA), a business and academic consortium chaired by former Democratic governor John Carlin. Plush with industry heavy-hitters such as the Midwest Research Institute (MRI), the lobby shop KansasBio, Symark LLC, a technology commercialization firm specializing in the biosciences industry, KBA is hell-bent on bringing NBAF to Kansas despite serious health and safety concerns. According to a Kansas City Star report, Tom Thornton, the President and CEO of the Kansas Bioscience Authority told the newspaper “This nation needs to have one modern biocontainment lab that conducts research into these diseases to protect agriculture and protect public health.” Claiming that the GAO report was “biased,” KBA’s John Carlin asserted that “aside from using Dorothy as their science, they don’t have much going for them.” Thornton said the project would be built as a “vault inside a vault inside a submarine” to protect against the accidental release of germs and diseases. DHS and USDA assert, despite historical evidence, that Foot-and Mouth-Disease (FMD) as well as research with other dangerous pathogens can be safely conducted on the U.S. mainland at its new agro-defense center. But if evidence from Britain is any guide on what to expect, the explosive growth of Biosafety Level 3 and 4 laboratories in the United States will only compound the problem. In 2001 and 2007, FMD releases at Britain’s Institute for Animal Health at Pirbright were traced to a leaking drain which allowed the disease to escape containment. Crumbling infrastructure is only one of a constellation of issues that led to the outbreaks, investigators discovered. Lax oversight and a culture of secrecy nearly devastated Europe’s livestock. According to Britain’s National Audit Office, the direct cost of the 2001 outbreak to the public sector was estimated at over $5.71 billion and the cost to the private sector clocked-in at over $9.51 billion. Indeed, when tourism and supporting industries were factored into the equation, total losses ballooned from $8.56 billion to $10.27 billion when movement into the countryside was restricted by the state, UK auditors estimated. By the time FMD was eradicated in September 2001, more than six million animals had been slaughtered and the disease had spread to France, the Republic of Ireland, the Netherlands and Northern Ireland. A similar outbreak in 2007 fueled calls to close the facility. This is not a problem confined to Britain, but is endemic to the entire bioweapons and “biodefense” complex globally, particularly here in the heimat. Bioweapons research, secrecy and contamination go hand in hand. Despite soothing bromides from defense corporations, the military, the scientific community and the politicians who do their bidding, the accidental or planned release of selected pathogens into the environment for “research purposes” is an enduring legacy of America’s Cold War biowar programs. The experimentation on witting and unwitting subjects in a score of top secret Army and CIA programs underscore the sinister nature of the Bioweapons-Industrial Complex. Indeed, a 1994 GAO report, documented: During World War II and the Cold War era, DOD and other national security agencies conducted or sponsored extensive radiological, chemical, and biological research programs. Precise information on the number of tests, experiments, and participants is not available, and the exact numbers may never be known. However, we have identified hundreds of radiological, chemical, and biological tests and experiments in which hundreds of thousands of people were used as test subjects. These tests and experiments often involved hazardous substances such as radiation, blister and nerve agents, biological agents, and lysergic acid diethylamide (LSD). In some cases, basic safeguards to protect people were either not in place or not followed. For example, some tests and experiments were conducted in secret; others involved the use of people without their knowledge or consent or their full knowledge of the risks involved. (Frank C. Conahan, Assistant Comptroller General, National Security and International Affairs Division, Human Experimentation, An Overview on Cold War Era Programs, General Accounting Office, September 28, 1994, GAO/T-NSIAD-94-266) Despite efforts since the Watergate-era to uncover the extent of these programs, many remain classified to this day. The GAO found that the Central Intelligence Agency, more concerned with shielding their corporate partners’ participation in illicit experiments with LSD and other psychoactive compounds “have made little effort to assist test participants by identifying test locations and participants in experiments conducted by contractors.” The Agency “in fact, has not released the names of 15 of the approximately 80 organizations that conducted experiments under the … MKULTRA program because the organizations do not want to be identified.” One sinister Pentagon project, Operation WHITECOAT, was a secret U.S. Army weapons’ testing program carried out between 1954-1973 on Seventh-day Adventist Church conscientious objectors who consented to the experiments, and over 2,300 Army soldiers who almost certainly were not provided anything approaching informed consent. Similar to cattle, sheep or pigs on Plum Island, test subjects were infected with agents such as Q Fever, yellow fever, Rift Valley fever, Hepatitis A, bubonic plague, Tularemia (rabbit fever) and Venezuelan Equine encephalitis. Indeed, the range of experimentation on human subjects carried out by the U.S. biological weapons program makes for a very grim read. As Boston College sociologist Jeanne Guillemin wrote in her disturbing exposé, The entire experimental legacy is dismaying, from the hundreds of dead monkeys at Fort Detrick to the spectacle of Seventh Day Adventist soldiers, the vaccinated volunteers in Project Whitecoat, strapped to chairs amid cages of animals in the Utah sunlight as Q fever aerosols are blown over them. Most chilling are the mock scenarios played out in urban areas: light bulbs filled with simulated BW agents being dropped in New York subways, men in Washington National Airport spraying pseudo-BW from briefcases, and similar tests in California and Texas and over the Florida Keys. (Jeanne Guillemin, Anthrax: The Investigation of a Deadly Outbreak, Berkeley: University of California Press, 1999, pp. 176-177.) revealed, multiple releases of highly-contagious pathogens including Foot-and-Mouth-Disease and Rift Valley Fever, were systematically covered-up by the USDA and DHS. As Michael Christopher Carroll’s stunning investigation of Plum Island,revealed, multiple releases of highly-contagious pathogens including Foot-and-Mouth-Disease and Rift Valley Fever, were systematically covered-up by the USDA and DHS. Will it be any different at the new National Bio and Agro-Defense Facility? If one were to believe DHS, it would represent the triumph of hope over experience. This is not a rational starting point when it comes to experiments with highly-contagious pathogens. America’s corporate media however, seemingly impermeable to anything other than celebrity scandals and the crimes of official enemies, refuse to conduct in-depth investigations into the expansion of America’s Bioweapons-Industrial Complex. Despite government pronouncements, faithfully regurgitated by media stenographers to the public, available evidence suggests that the United States, as in the past, is pursuing the development of biological agents for use in a score of clandestine weapons programs. Under cover of conducting research on the highly-contagious Foot-and-Mouth-Disease pathogen, a new and improved national laboratory equipped with BSL-3 and BSL-4 containment facilities, like their cohorts at the U.S. Army Medical Institute of Infectious Diseases at Ft. Detrick, Maryland in all probability will continue to investigate the efficacy of waging aggressive biological warfare on an adversary’s food supply. Sound far-fetched? If the evidence from Cold War-era CIA and Pentagon programs, well-documented accidents, illicit human experimentation as well as numerous examples of biological attacks against socialist Cuba are a guide to Washington’s future behavior, better think again! Since 2004, 911Truth.Org has educated the public about the suppressed realities of the September 11 attacks. We worked with the 9/11 Families to pressure the Bush administration to convene an investigation into the deadliest attacks on US soil since Pearl Harbor. We attended many of the commission hearings and questioned commissioners and bird-dogged elected officials to get answers to the Unanswered Questions that remain so to this day. We reported the contradictions, lies and omissions on the public record. 911Truth.Org staff have given hundreds of interviews on radio and mainstream network TV. We cover a wide range of 9/11-related issues in publishing academic papers, original research, and opinion pieces. We wish to thank our donors who have kept us on the web since 2004! We appreciate your continued support! We continue to update the website to make the nearly 3000 articles easier to find, read and share. Thanks for visiting us! We continue to update the website to make the nearly 3000 articles easier to find, read and share. Thanks for visiting us! CIA and Saudi Arabia Conspired To Keep 9/11 Details Secret", "opengraph": {"locale": "en_US", "type": "article", "title": "Bringing the (Bio) War Home - 911Truth.Org", "description": "By Tom Burghardt August 2, 2009 Antifascist Calling The 2001 anthrax attacks underscore the dangers posed to our health and safety by the Bioweapons-Industrial Complex. The killer(s) employed a military-grade version of the deadly pathogen, a four-mutation blend of anthrax prepared at the government’s test site at the remote Dugway Proving Ground in Utah. Based […]", "url": "https://911truth.org/bringing-the-bio-war-home/", "site_name": "911Truth.Org", "article:published_time": "2009-08-03T16:03:54+00:00", "article:modified_time": "2012-09-29T04:16:34+00:00"}, "tags": [], "tweets": [], "movies": [], "links": ["http://antifascist-calling.blogspot.com/2009/08/bringing-bio-war-home.html", "http://www.armscontrolcenter.org/policy/biochem/articles/fy09_biodefense_funding/", "http://www.thebulletin.org/web-edition/columnists/laura-h-kahn/biosecurity-lessons-the-bruce-ivins-case", "http://www.nbacc.net/index.html", "http://www.dhs.gov/files/labs/editorial_0762.shtm", "http://www.dhs.gov/xabout/laws/gc_1217449547663.shtm", "http://www.dtic.mil/cgi-bin/GetTRDoc?AD=ADA481366&Location=U2&doc=GetTRDoc.pdf", "http://www.thepeoplesvoice.org/TPV3/Voices.php/2009/04/28/cia-link-to-cuban-pig-virus-reported", "http://www.washingtonpost.com/wp-dyn/content/article/2009/07/26/AR2009072602857.html", "http://www.saic.com/", "http://washingtontechnology.com/toplists/top-100-lists/2009.aspx", "http://energycommerce.house.gov/images/stories/Documents/Hearings/PDF/Testimony/OI/110-oi-hrg.052208.Kingsbury-Testimony.pdf", "http://www.gao.gov/new.items/d09747.pdf", "http://www.kansasbioauthority.org/", "http://www.mriresearch.org/", "http://www.kansasbio.org/", "http://www.symarkllc.com/", "http://www.kansascity.com/637/story/1349759.html", "http://www.nao.org.uk/publications/0102/the_2001_outbreak_of_foot_and.aspx", "http://archive.gao.gov/t2pbat2/152601.pdf", "http://www.harpercollins.com/books/9780060781842/Lab_257/index.aspx", "https://www.facebook.com/sharer.php?u=https%3A%2F%2F911truth.org%2Fbringing-the-bio-war-home%2F", "https://twitter.com/intent/tweet?text=Bringing+the+%28Bio%29+War+Home&url=https%3A%2F%2F911truth.org%2Fbringing-the-bio-war-home%2F&via=911Truth.Org", "https://reddit.com/submit?url=https://911truth.org/bringing-the-bio-war-home/&title=Bringing+the+%28Bio%29+War+Home", "mailto:?subject=Bringing the (Bio) War Home&body=https://911truth.org/bringing-the-bio-war-home/", "#", "https://911truth.org/panetta-reality-of-911-excuses-bush-scandals/", "https://911truth.org/ny-supreme-court-appoints-referee-to-oversee-revalidation-of-rejected-signatures/", "https://911truth.org/author/josep34a/", "https://911truth.org/", "#", "#", "https://911truth.org/aa-flight-77-crashed-pentagon/", "https://911truth.org/aa-flight-77-crashed-pentagon/", "https://911truth.org/conference-9-11-pentagon-evidence/", "https://911truth.org/conference-9-11-pentagon-evidence/", "https://911truth.org/cia-saudi-conspired-keep-9-11-details-secret/", "https://911truth.org/cia-saudi-conspired-keep-9-11-details-secret/", "#", "#"], "authors": ["", "Staff"], "publish_date": "2009-08-03T16:03:54+00:00"}