{"result_id": "005013", "URL": "https://911truth.org/rally-for-the-nyc-911-ballot-initiative-may-28-2008/", "timestamp": "2023-04-25 11:45:45 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://911truth.org/wp-content/uploads/Liberty-head-icon.png", "canonical": "https://911truth.org/rally-for-the-nyc-911-ballot-initiative-may-28-2008/", "encoding": "UTF-8"}, "image": null, "domain": "911truth.org", "title": "Rally for the NYC 9/11 Ballot Initiative May 28, 2008", "cleaned_text": "When: Wednesday May 28th, 7:30 pm\n\n Where: St. Mark’s Church, 2nd Avenue @ 10th Street\n\n(New York, May 22, 2008) – The New York City 9/11 Ballot Initiative Campaign,\n\n a non-profit, citizens based organization, whose goal is the creation of an independent\n\n commission to lead a new investigation into the tragedy of 9/11, will be holding\n\n a rally on Wednesday, May 28th at 7:30 PM at St. Mark’s Church in the Bowery.\n\n The campaign hopes to put the issue of a new investigation of 9/11 on the November\n\n 2008 NYC ballot as a public referendum. Come and learn about this historic effort!\n\n Visit www.nyc911initiative.org for full campaign details.\n\nWayne Madsen, investigative reporter, retired NSA analyst\n\n John Feal, 9/11 first responder, Director of the Feal Good Foundation\n\n William Rodriguez, 9/11 hero and last survivor of WTC1\n\n Sander Hicks, 9/11 author/researcher, founder of Voxpop.net\n\n Jesse Richard, founder of TVNewsLies.org\n\n Karen Johnson, state senator from Arizona (by phone)\n\nThe event will be moderated by the Reverend Frank Morales.\n\nThe rally will be an opportunity for the press and public to learn about the 9/11\n\n Ballot Initiative Campaign and to fill out petitions. Upon reaching 30,000 valid\n\n signatures which are lawfully required to put the Initiative on the ballot, NYC\n\n voters will be enabled to create a fact-driven investigation of 9/11, which will\n\n be distinct from the former Kean-Hamilton Commission because this will go beyond\n\n political agendas by exploring all possible scenarios, following the evidence\n\n wherever it may lead. We have the potential to redirect the course of related\n\n political events which have had and will continue to have global repercussions\n\n just through exercising our constitutional right to create this public referendum\n\n calling for truth, accountability and justice.\n\nThis is now the time of reckoning. In just the past year Japanese and Italian\n\n political officials have challenged the official account of 9/11 and called for\n\n a new investigation. Jesse Ventura was recently on Howard Stern explaining that\n\n the towers had to be the result of controlled demolition. Karen Johnson, state\n\n senator from Arizona, has gone public supporting the work of Richard Gage and\n\n Steven Jones. Also, Steven Jones just had a second paper peer-reviewed. Now imagine\n\n the impact there will be if the voters of NYC show that we cannot accept the seriously\n\n flawed 9/11 Commission Report and are calling for a impartial, through investigation.\n\n This is totally possible!\n\nA current count will be done over the next few days. We estimate having approximately\n\n 7,500 signatures. With just 300 people willing to spend 25-30 hours spare time\n\n with petitioning teams throughout NYC over the next 4-5 weeks, we can reach\n\n another 50-60,000 signatures! If you’re in or near NYC, please sign the Guest\n\n Book at www.nyc911initiative.org to get started. If you are outside of the area,\n\n we still need your support. Please direct anyone you know to our site and urge\n\n them to download the petition and mail it in today. Also, we are asking for\n\n your financial support. We ask everyone throughout the country to donate at\n\n least $25, the cost of an average meal for two. This will enable us to pay for\n\n advertising, materials, and staff. Obviously, the need is urgent. Just go to\n\n the Donate section on our site.\n\nNow is the time to support this campaign for a new, honest and authentic investigation\n\n of 9/11! This is a culmination of all the work done by researchers and activists\n\n to expose the discrepancies in the official account and the nature of 9/11 as\n\n what PNAC described as a \"New Pearl Harbor\". We owe it to the victims,\n\n the first responders, ourselves, and future generations.", "opengraph": {"locale": "en_US", "type": "article", "title": "Rally for the NYC 9/11 Ballot Initiative May 28, 2008 - 911Truth.Org", "description": "When: Wednesday May 28th, 7:30 pm Where: St. Mark’s Church, 2nd Avenue @ 10th Street (New York, May 22, 2008) – The New York City 9/11 Ballot Initiative Campaign, a non-profit, citizens based organization, whose goal is the creation of an independent commission to lead a new investigation into the tragedy of 9/11, will be […]", "url": "https://911truth.org/rally-for-the-nyc-911-ballot-initiative-may-28-2008/", "site_name": "911Truth.Org", "article:published_time": "2008-05-27T15:49:52+00:00", "article:modified_time": "2012-09-29T05:29:26+00:00"}, "tags": ["Richard Gage", "PNAC"], "tweets": [], "movies": [], "links": [], "authors": ["", "Staff"], "publish_date": "2008-05-27T15:49:52+00:00"}