{"result_id": "006002", "URL": "https://www.abovetopsecret.com/forum/thread1328622/pg3", "timestamp": "2023-04-25 11:46:01 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.abovetopsecret.com/touch-icon-iphone.png", "canonical": "https://www.abovetopsecret.com/forum/thread1328622/pg3", "encoding": "utf-8"}, "image": null, "domain": "www.abovetopsecret.com", "title": "New Study Shows Fully Vaccinated Will Lose 25 Years From Life Span, page 3", "cleaned_text": "edit on 4-4-2023 by Narvasis because: (no reason given)\n\n\n\nSorry Virtuoso but this one is a no go. As someone who owned a life insurance company through the pandemic I can tell you with certainty that none of my agents were required to mark on a persons application whether or not they had gotten the covid shots (just a reminder, these aren’t vaccines, changing the definition of one to fit your ideology doesn’t change what it isn’t). The most they would be required to mark on an application in regards to covid or shots is if the person had been in the hospital recentlyNow, let’s say they had medical records from the passed 5 years (some people don’t, we would send a nurse out to these people to give them a physical) then MAYBE, yes, having gotten a covid shot would be in their medical records. BUT that is if they got it from an ATTENDING PHYSICIAN!People don’t realize the absolute F**kery that has happened here. Do you all not realize how many people just went to drive-up sites, Walmart’s, CVS’s, ect to get these shots? A whole lot. Want to know how many of those people DON’T see a doctor regularly? A whole lot. This is inevitably going to lead to problems for tracking data, which was of course done on purpose. This point I am making should be a thread in and of itself because like I said, people just don’t realize what happened here.The only way this “analyst” could have possibly known for sure, is by having the covid shots as Cause of Death on their death certificate. Then when family or whoever is filing the death claim for that person would the analyst be able to tell that it was specifically cause by that after an autopsy, which most refuse to put on a death certificate. Only underwriters have access to medical records and that’s to determine approval then also during a “look-back period” on a policy which is usually about two years.Point is, in such a short amount of time the analyst can’t say such things for sure. Just like you can’t inject something experimental into a persons body and expect it to be, or claim it to be “safe and effective” in such a short amount of time. If you got the shot(s) you took an idiotic, unnecessary risk to your health and overall life, when it was for a virus with a 99+% survival rate.Statistically speaking.a reply to: v1rtu0s0", "opengraph": {"image": "https://files.abovetopsecret.com/images/ats16.jpg", "title": " New Study Shows Fully Vaccinated Will Lose 25 Years From Life Span, page 3", "description": " New Study Shows Fully Vaccinated Will Lose 25 Years From Life Span, page 3", "site_name": "AboveTopSecret.com"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}