{"result_id": "006001", "URL": "https://www.abovetopsecret.com/forum/thread1328706/pg2", "timestamp": "2023-04-25 11:46:00 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.abovetopsecret.com/touch-icon-iphone.png", "canonical": "https://www.abovetopsecret.com/forum/thread1328706/pg2", "encoding": "utf-8"}, "image": null, "domain": "www.abovetopsecret.com", "title": "What Russia destroys all stocks of Mrna vaccine., page 2", "cleaned_text": "News within Russia wouldn't go well for Putin, the hesitant nature of the African nations was back in 2021. It seems the sputnik vaccine was under the radar of foreign nations well before this supposed news came out. \n\n \n\n It's honestly almost impossible for people to know what is really going on in Russia. I find it kind of strange how when you search about latest news on Russian vaccine programs all the fact checking says opposite of the claims, yet in 2021 a lot of nations were rejecting sputnik vaccines. a reply to: putnam6 News within Russia wouldn't go well for Putin, the hesitant nature of the African nations was back in 2021. It seems the sputnik vaccine was under the radar of foreign nations well before this supposed news came out.It's honestly almost impossible for people to know what is really going on in Russia. I find it kind of strange how when you search about latest news on Russian vaccine programs all the fact checking says opposite of the claims, yet in 2021 a lot of nations were rejecting sputnik vaccines. \n\n\n\n\n\n\n\n \n\n I have been looking to find out what is actually happening in Russia with regard to their rollout. For that matter China as well. There appears to be nothing with regard to any data. If we were in a world depopulation event, then we should be seeing the same things in these countries as well. But all we have is silence. \n\n When the Russian troll was on I asked him, and instead of saying that everything was rosy he said nothing. Then we find that the bad boy Astra Zenaka was the main formula for the Sputnik vaccine, which was evidently rolled out in Russia before the West. That suggests that Russia is having the same problems. The validity of all information subject to any censorship is questionable so finding any resemblance of the true situation can in reality come from observed anecdotal dialogue. Which is made worse by the current geopolitical situation. So I doubt anyone would be game to put their name to anything these days that disturbed the narrative. It just looks like the West is going the same way as these more authoritarian countries. \n\n What we do know is that dicey gene therapy has been mandated for the whole of the defense force, which seems either a mistake made by idiots or an act of treason. It has caused irreparable economic harm, which does not seem to be improving. a reply to: Turquosie I have been looking to find out what is actually happening in Russia with regard to their rollout. For that matter China as well. There appears to be nothing with regard to any data. If we were in a world depopulation event, then we should be seeing the same things in these countries as well. But all we have is silence.When the Russian troll was on I asked him, and instead of saying that everything was rosy he said nothing. Then we find that the bad boy Astra Zenaka was the main formula for the Sputnik vaccine, which was evidently rolled out in Russia before the West. That suggests that Russia is having the same problems. The validity of all information subject to any censorship is questionable so finding any resemblance of the true situation can in reality come from observed anecdotal dialogue. Which is made worse by the current geopolitical situation. So I doubt anyone would be game to put their name to anything these days that disturbed the narrative. It just looks like the West is going the same way as these more authoritarian countries.What we do know is that dicey gene therapy has been mandated for the whole of the defense force, which seems either a mistake made by idiots or an act of treason. It has caused irreparable economic harm, which does not seem to be improving. \n\n\n\n\n\n\n\n \n\n Well, it's hard to tell whats going on. So much misinformation and misleading info out there regarding the various vaccines. You have quack docs telling people that millions will soon be dying. And then others that say there has been no harmful affects beyond a few miniscule instances. \n\n \n\n I really don't know what to think - especially when it comes to other country's vaccines as well. If it was a worldwide depopulation agenda, it must be part of a long game that nobody has detected yet. \n\n \n\n Or perhaps its more simple and vaccines do work, but potential harmful affects are being brushed under the bed to protect corporate profits. \n\n \n\n With so much misinformation and agendas, I gave up on trying to decide. \n\n \n\n If it is a depopulation agenda, i'd imagine the best method would be for the vaccines to steralize and prevent births. As just harming a small percentage of the population likely means that this wasnt depopulation but rather greed. a reply to: anonentity Well, it's hard to tell whats going on. So much misinformation and misleading info out there regarding the various vaccines. You have quack docs telling people that millions will soon be dying. And then others that say there has been no harmful affects beyond a few miniscule instances.I really don't know what to think - especially when it comes to other country's vaccines as well. If it was a worldwide depopulation agenda, it must be part of a long game that nobody has detected yet.Or perhaps its more simple and vaccines do work, but potential harmful affects are being brushed under the bed to protect corporate profits.With so much misinformation and agendas, I gave up on trying to decide.If it is a depopulation agenda, i'd imagine the best method would be for the vaccines to steralize and prevent births. As just harming a small percentage of the population likely means that this wasnt depopulation but rather greed. \n\n\n\n\n\n\n\noriginally posted by: strongfp \n\n a reply to: putnam6 \n\n \n\n News within Russia wouldn't go well for Putin, the hesitant nature of the African nations was back in 2021. It seems the sputnik vaccine was under the radar of foreign nations well before this supposed news came out. \n\n \n\n It's honestly almost impossible for people to know what is really going on in Russia. I find it kind of strange how when you search about latest news on Russian vaccine programs all the fact checking says opposite of the claims, yet in 2021 a lot of nations were rejecting sputnik vaccines. \n\n \n\n Respectfully just like all these theories it's human nature to look for connections to this and that. If you want to entertain that Russia is throwing away vaccine because it causes AIDS, have at it. \n\n \n\n All I suggest is after watching Tass and Pravda since the invasion Russia doesn't ignore stories, they put thier spin on them. \n\n \n\n Hell doesn't it sound more likely that a suspect source ran with the end of official COVID in Russia, and embellished the rest for clicks and hits?\n\n \n\n Throw in some buzzwords COVID vaccines AIDS Russia Putin, and hey we got a breaking news story.... \n\n \n\n moderndiplomacy.eu... \n\n \n\n \n\n \n\n Due of delays in international vaccine deliveries, Africa lags behind the rest of the world in Covid vaccination rates, and is the only continent where less than 50% of the population is fully vaccinated. Currently, just more than 800 million doses of vaccines have been administered in Africa, or 80% of the total received. About a third of the vaccinations have been made with Johnson & Johnson’s vaccine, followed by Pfizer (22%), AstraZeneca (17%), China’s Sinopharm (15%) and Sinovac (7%). \n\n \n\n Several reports monitored by this authored show that Russia has played a minimal role in the entire health sector in Africa. With the Covid-19 vaccination, Russia randomly sprinkled few thousands as humanitarian assistance among its “Soviet friends” including Egypt, Ethiopia, Guinea, Angola, Mozambique, Zimbabwe and South Africa. Nevertheless, the worse was Russia’s sudden failure to supply the 300 million vaccines through the African Union (AU) especially during the times of health crisis. \n\n \n\n \n\n edit on 5-4-2023 by putnam6 because: (no reason given)\n\n Respectfully just like all these theories it's human nature to look for connections to this and that. If you want to entertain that Russia is throwing away vaccine because it causes AIDS, have at it.All I suggest is after watching Tass and Pravda since the invasion Russia doesn't ignore stories, they put thier spin on them.Hell doesn't it sound more likely that a suspect source ran with the end of official COVID in Russia, and embellished the rest for clicks and hits?Throw in some buzzwords COVID vaccines AIDS Russia Putin, and hey we got a breaking news story.... \n\n\n\n\n\n\n\n \n\n But then again we have this debunking my original starter article in this thread. \n\n \n\n The author claims that the Russian government is on board with the Q codes and all the rest the same as the West, and I noticed in one of the articles a commentator says that the average death rate is well over what it was in the nineties after the fall of the Soviet Union. \n\n \n\n If this author is to be believed then Russia has experienced the same lockstep NWO as the rest of us have. The vaccination was compulsory during the mobilization so it is fairly recent. \n\n edit on 6-4-2023 by anonentity because: (no reason given)\n\n a reply to: vNex92 But then again we have this debunking my original starter article in this thread.The author claims that the Russian government is on board with the Q codes and all the rest the same as the West, and I noticed in one of the articles a commentator says that the average death rate is well over what it was in the nineties after the fall of the Soviet Union. edwardslavsquat.substack.com... If this author is to be believed then Russia has experienced the same lockstep NWO as the rest of us have. The vaccination was compulsory during the mobilization so it is fairly recent. edwardslavsquat.substack.com... \n\n\n\n\n\n\n\n \n\n \n\n \n\n lol you are in for a shock. \n\n \n\n \n\n Not that that's true, but if it was why would you find that funny? \n\n \n\n Sounds like you would like to see people become sick to satify your own doom porn senario. \n\n \n\n \n\n \n\n t cell damage is a real thing and furthered with every jag taken. \n\n \n\n \n\n I think you may find mRNA vaccines do not damage T cells. In fact mRNA vaccines have been shown to stimulate the immune system to produce both T cells and antibodies that can recognize and neutralize the SARS-CoV-2 virus. \n\n \n\n \n\n \n\n Hence the increase in death rates across the western world. \n\n \n\n \n\n Aye, that had nothing to do with being locked down for a year and the subsequent knock-on effects associated with a change to somewhat of a sedentary and inactive lifestyle. \n\n \n\n And even then i think you associate any increase in death rates across the world to be far worse than they are. a reply to: purplemer Not that that's true, but if it was why would you find that funny?Sounds like you would like to see people become sick to satify your own doom porn senario.I think you may find mRNA vaccines do not damage T cells. In fact mRNA vaccines have been shown to stimulate the immune system to produce both T cells and antibodies that can recognize and neutralize the SARS-CoV-2 virus.Aye, that had nothing to do with being locked down for a year and the subsequent knock-on effects associated with a change to somewhat of a sedentary and inactive lifestyle.And even then i think you associate any increase in death rates across the world to be far worse than they are.", "opengraph": {"image": "https://files.abovetopsecret.com/images/ats3.jpg", "title": "What Russia destroys all stocks of Mrna vaccine., page 2", "description": "What Russia destroys all stocks of Mrna vaccine., page 2", "site_name": "AboveTopSecret.com"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "550", "height": "344", "embed_code": "<iframe width=\"550\" height=\"344\" src=\"https://www.youtube.com/embed/7hm7mXkNmAk?rel=0&amp;autoplay=0\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/7hm7mXkNmAk?rel=0&autoplay=0"}, {"embed_type": "iframe", "provider": "youtube", "width": "550", "height": "344", "embed_code": "<iframe width=\"550\" height=\"344\" src=\"https://www.youtube.com/embed/7hm7mXkNmAk?rel=0&amp;autoplay=0\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/7hm7mXkNmAk?rel=0&autoplay=0"}], "links": ["../mem/strongfp", "../thread1328706/pg2#pid26949675", "../mem/anonentity", "../thread1328706/pg2#pid26949677", "../mem/Turquosie", "../thread1328706/pg2#pid26949702", "../mem/anonentity", "../thread1328706/pg2#pid26949721", "../mem/putnam6", "../thread1328706/pg2#pid26949740", "https://moderndiplomacy.eu/2023/03/17/how-russias-sputnik-disappears-from-africas-radar/", "https://moderndiplomacy.eu/2023/03/17/how-russias-sputnik-disappears-from-africas-radar/", "../mem/v1rtu0s0", "../thread1328706/pg2#pid26949748", "../mem/Terpene", "../thread1328706/pg2#pid26949933", "../mem/vNex92", "../thread1328706/pg2#pid26949935", "../mem/anonentity", "../thread1328706/pg2#pid26949946", "https://edwardslavsquat.substack.com/p/why-do-people-think-putin-dislikes", "https://edwardslavsquat.substack.com/p/russia-begins-vaccinating-mobilized", "../mem/Dalamax", "../thread1328706/pg2#pid26950002", "../mem/strongfp", "../thread1328706/pg2#pid26950008", "https://www.africanews.com/2021/10/18/south-africa-rejects-russian-sputnik-vaccine-over-hiv-fears/", "../mem/andy06shake", "../thread1328706/pg2#pid26950011", "../mem/andy06shake", "../thread1328706/pg2#pid26950012", "../mem/andy06shake", "../thread1328706/pg2#pid26950014", "../mem/Thrumbo", "../thread1328706/pg2#pid26950025", "https://rumble.com/v2ferek-yelling-radical-muslim-operation-warp-speed-architect-hanged-at-gitmo-realr.html", "../mem/andy06shake", "../thread1328706/pg2#pid26950029", "../mem/purplemer", "../thread1328706/pg2#pid26951086", "../mem/andy06shake", "../thread1328706/pg2#pid26951151", "../mem/purplemer", "../thread1328706/pg2#pid26952320", "../mem/andy06shake", "../thread1328706/pg2#pid26952521"], "authors": [], "publish_date": null}