{"result_id": "006028", "URL": "https://www.abovetopsecret.com/forum/thread1326078/pg2", "timestamp": "2023-04-25 11:46:14 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.abovetopsecret.com/touch-icon-iphone.png", "canonical": "https://www.abovetopsecret.com/forum/thread1326078/pg2", "encoding": "utf-8"}, "image": null, "domain": "www.abovetopsecret.com", "title": "Mind boggling vaccine statistics: Risks from vaccination often outweighs benefits, page 2", "cleaned_text": "As Dr Malhotra said and if take a look at the tables someone who is young and healthy has much more to loose by getting vaccinated. It's clear in the numbers in most cases and if you factor the various cardiac related health issues that are linked to the mRNA products and the myriad of other problems associated with them then the risks of vaccination far outweigh any benefits. \n\n \n\n These products must be immediately withdrawn and there must be legal cases against the pharmaceuticals. \n\n\n\n\n\nOne in eight hundred having a severe reaction to the vaccine? That means that if there are ten thousand in a town, twelve people would have a severe reaction to the vaccine....around here, not many people actually wound up dying or having serious consequences from the virus itself, most had accompanying problems that put them in the hospital or caused their death....mostly if they were on meds that caused a susceptability to lung diseases or they had poor immunity were the ones that wound up having bad cases of the virus. \n\n \n\n Those that had severe problems with the vaccines around here were at little risk of having the virus go covid 19. They would have handled the virus with probably mild symptoms. \n\n \n\n The vaccine sort of puts those who have good immune systems more at risk of side effects than those who have improper immune systems. I personally know half a dozen people who had pretty bad side effects off the covid vaccine None of them died, but they had months of issues from their body reacting improperly to the vaccine. Two younger guys are presently being tested for heart disorders that they did not have before the vaccine....of course the heart problems will be proven real but they will never say it was caused by vaccination. \n\n\n\n\n\n\n\noriginally posted by: tanstaafl \n\n \n\n Nope... I know you're trying to be funny, but my point stands. \n\n \n\n Yes, for some of us, their malfeasance is well known and has been for many decades. \n\n \n\n I'm talking about the mainstream. They have now been exposed to the entire world as frauds, liars and criminals to the point that no one can reasonably argue otherwise. \n\n \n\n I don't find this funny at all. \n\n \n\n I can't wrap my head around how you think the \"mainstream\" media would ever publicize this record of grievances and offenses when they literally are owned by the companies who are the offenders... it would be akin to self-incrimination. \n\n \n\n Nevertheless, the history of their trustworthiness has been in the public domain for a great long while. \n\n \n\n When (hopefully not \"if\") the picture finally coalesces in the public understanding the public won't obligingly tolerate the politically expedient 'go to' excuse of \"who could have known?\" and \"We were never aware of this.\" \n\n \n\n Which is why I made clear that the posture and behavior of the industry is not something we are just learning 'now.' \n\n \n\n Sadly, the COVID event is only a relatively recent entry in the litany of their \"profit over everything else\" sins. They are still doing it... and no one we trust to keep this kind of abuse in check seems even remotely inclined to actually intercede. I don't find this funny at all.I can't wrap my head around how you think the \"mainstream\" media would ever publicize this record of grievances and offenses when theyare owned by the companies who are the offenders... it would be akin to self-incrimination.Nevertheless, the history of their trustworthiness has been in the public domain for a great long while.When (hopefully not \"if\") the picture finally coalesces in the public understanding the public won't obligingly tolerate the politically expedient 'go to' excuse of \"who could have known?\" and \"We were never aware of this.\"Which is why I made clear that the posture and behavior of the industry is not something we are just learning 'now.'Sadly, the COVID event is only a relatively recent entry in the litany of their \"profit over everything else\" sins. They are still doing it... and no one we trust to keep this kind of abuse in check seems even remotely inclined to actually intercede. \n\n\n\n\n\nI got J&J , wife moderna (i had just moved 4k miles on my dime for a job and got ambushed with jab or get fired, she wanted to finish her military career) neither one of us were especially careful we are both just over 1 year since the jab and she finally popped positive (got tested because she was exposed at the unit). \n\n \n\n This entire process was a money making scam at best for anyone not at serious risk (Obese, and or additional co-morbidities), depopulation agenda at worst. \n\n \n\n If you got stuck hope you have a good doctor that actually listens when you say something isnt right. \n\n\n\n\n\nTable 4b: NNV for prevention of severe hospitalisation for patients in a risk group \n\n \n\n Age group Autumn 2022 booster \n\n 20 to 29 59,500 \n\n \n\n \n\n You need to vaccinate 59,500 individuals to prevent one severe hospitalisation in that age group. But how many people can be harmed or harmed seriously to prevent this severe hospitalisation? It's more of a rhetorical question. \n\n \n\n I think the UK Government is finally coming to terms with reality and that's why they have decided not to offer anymore of these jabs for the under 50s. Which was the original plan by the way but was hijacked by the evil forces that control the health sector and the Government. \n\n\n\n\n\nyoutu.be... \n\n \n\n The video can also be found on YouTube under the title: \n\n \n\n The Weaponisation of Anti-vaxxer \n\n \n\n Dr Malhotra describes the term which has been coined by vested interests to attack and defame anyone and especially scientists who don't agree with the narratives and dogma. \n\n \n\n In the rest of the video he describes the statistics given by the UK Government which you can find in the first page under the title that I have linked. \n\n \n\n He argues strongly that the vaccination program must be paused given that the risks often outweigh the benefits of vaccination. The statistics show clearly his case is correct. The video can also be found on YouTube under the title:The Weaponisation of Anti-vaxxerDr Malhotra describes the term which has been coined by vested interests to attack and defame anyone and especially scientists who don't agree with the narratives and dogma.In the rest of the video he describes the statistics given by the UK Government which you can find in the first page under the title that I have linked.He argues strongly that the vaccination program must be paused given that the risks often outweigh the benefits of vaccination. The statistics show clearly his case is correct.", "opengraph": {"image": "https://files.abovetopsecret.com/images/ats6.jpg", "title": "Mind boggling vaccine statistics: Risks from vaccination often outweighs benefits, page 2", "description": "Mind boggling vaccine statistics: Risks from vaccination often outweighs benefits, page 2", "site_name": "AboveTopSecret.com"}, "tags": [], "tweets": [], "movies": [], "links": ["../mem/Asmodeus3", "../thread1326078/pg2#pid26883000", "../mem/Asmodeus3", "../thread1326078/pg2#pid26883023", "../mem/rickymouse", "../thread1326078/pg2#pid26883077", "../mem/Maxmars", "../thread1326078/pg2#pid26883082", "../mem/Irishhaf", "../thread1326078/pg2#pid26883098", "../mem/Asmodeus3", "../thread1326078/pg2#pid26883119", "../mem/Asmodeus3", "../thread1326078/pg2#pid26884078", "../mem/Asmodeus3", "../thread1326078/pg2#pid26884117", "https://youtu.be/eH7NGLQBWyI"], "authors": [], "publish_date": null}