{"result_id": "006042", "URL": "https://www.abovetopsecret.com/forum/thread1326584/pg1", "timestamp": "2023-04-25 11:46:21 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.abovetopsecret.com/touch-icon-iphone.png", "canonical": "https://www.abovetopsecret.com/forum/thread1326584/pg1", "encoding": "utf-8"}, "image": null, "domain": "www.abovetopsecret.com", "title": "Family in Singapore receives $225K in compensation after family member dies due to Covid-19 vaccine, page 1", "cleaned_text": "The family of a 28 year old man of Bangladeshi origin will receive $225,000 in compensation, the highest amount a person can receive, under the Vaccine Injury Financial Assistance Program provided by the Ministry of Health.The 28 year old man who was young and healthy with no known medical conditions until this point developed myocarditis around three weeks after his first Moderna dose and collapsed in his workplace on July 9 2021.The coroner has ruled that his death is likely to be related to the Covid-19 mRNA product and that this is an unfortunate event.At least the coroner in Singapore was sensible enough not to blame climate change, Donald Trump, the Republicans, 'anti-vaxxers', cosmic rays, or rule that his death was 'mysterious and unexplained' and that the unfortunate individual died of suddenitis...The article also discusses the case of a 16 year old healthy boy who collapsed 5 days after his first Pfizer shot after he has suffered a cardiac arrest due to myocarditis. The very good news is that the boy survived and he is now well. In the article there is no discussion of the cause of the collapse of the boy but I am sure it is not climate change, neutrinos coming from the sun, the orbital speed of Earth, or the alignment of the planets.", "opengraph": {"image": "https://files.abovetopsecret.com/images/ats13.jpg", "title": "Family in Singapore receives $225K in compensation after family member dies due to Covid-19 vaccine, page 1", "description": "Family in Singapore receives $225K in compensation after family member dies due to Covid-19 vaccine, page 1", "site_name": "AboveTopSecret.com"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.straitstimes.com/singapore/man-s-death-from-heart-inflammation-likely-related-to-covid-19-vaccine-jab-coroner"], "authors": [], "publish_date": null}