{"result_id": "006050", "URL": "https://www.abovetopsecret.com/forum/thread1328622/pg2", "timestamp": "2023-04-25 11:46:25 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.abovetopsecret.com/touch-icon-iphone.png", "canonical": "https://www.abovetopsecret.com/forum/thread1328622/pg2", "encoding": "utf-8"}, "image": null, "domain": "www.abovetopsecret.com", "title": "New Study Shows Fully Vaccinated Will Lose 25 Years From Life Span, page 2", "cleaned_text": "originally posted by: vNex92 \n\n \n\n I do believe most got a saline. \n\n \n\n \n\n What I find interesting is whether they have ever found a batch of saline anywhere. We keep hearing this and has a single university or clinic brought forth a smoking gun in this. One would think there are billions of vials with only saline in them so not hard to find and actually prove. This would mean that both the vaccine and diluent are the same and the vaccine is faked to be an off-white color to represent the real stuff. What I find interesting is whether they have ever found a batch of saline anywhere. We keep hearing this and has a single university or clinic brought forth a smoking gun in this. One would think there are billions of vials with only saline in them so not hard to find and actually prove. This would mean that both the vaccine and diluent are the same and the vaccine is faked to be an off-white color to represent the real stuff. \n\n\n\n\n\n\n\n \n\n I couldn't help but notice that the source doesn't give any actual reference to an original article by the supposed researcher. No data. No discussion of the \"analysis\" by which the supposed \"researcher\" processed the data and arrived at conclusions. No discussion of alternative explanations as is common in scientific articles. No error analysis. Just some random lunatic saying we're all going to die. \n\n \n\n However, a little internet research comes up with an interesting statement by Josh Stirling: \n\n \n\n \"According to UK statistics, the people of that nation “who took the vaccine have a 26% higher mortality rate,” he said. “The people who are under the age of 50 who took the vaccine now have a 49% higher mortality rate. And worst of all, the people who only took one dose of the vaccine have an approximately 145% worse mortality rate.” \n\n \n\n He acknowledged “that last data point is, on its face, confusing” that this group of people, who likely had an injury on the first dose, and decided to discontinue, were disproportionately harmed.\" \n\n \n\n www.lifesitenews.com... \n\n \n\n In other words, according to this \"expert\" if you took only one dose of the mRNA vaccine, you have a 145% worse mortality rate, but if you take the full course, your mortality rate goes down to 26%. \n\n \n\n That doesn't sound very logical, does it? a reply to: v1rtu0s0 I couldn't help but notice that the source doesn't give any actual reference to an original article by the supposed researcher. No data. No discussion of the \"analysis\" by which the supposed \"researcher\" processed the data and arrived at conclusions. No discussion of alternative explanations as is common in scientific articles. No error analysis. Just some random lunatic saying we're all going to die.However, a little internet research comes up with an interesting statement by Josh Stirling:\"According to UK statistics, the people of that nation “who took the vaccine have a 26% higher mortality rate,” he said. “The people who are under the age of 50 who took the vaccine now have a 49% higher mortality rate. And worst of all, the people who only took one dose of the vaccine have an approximately 145% worse mortality rate.”He acknowledged “that last data point is, on its face, confusing” that this group of people, who likely had an injury on the first dose, and decided to discontinue, were disproportionately harmed.\"In other words, according to this \"expert\" if you took only one dose of the mRNA vaccine, you have a 145% worse mortality rate, but if you take the full course, your mortality rate goes down to 26%.That doesn't sound very logical, does it? \n\n\n\n\n\n\n\n \n\n But another powerful person did: \n\n \n\n \n\nIn September 2021, the employees of all federally-funded Medicaid and Medicare-certified health care facilities, and Head Start program facilities, were required to be vaccinated, as ordered through the United States Department of Health and Human Services (HHS). \n\n \n\n And 'or else' policies were put in place by many government agencies and businesses after January 2021. \n\n \n\n \n\n Executive Order 14043 of September 9, 2021 \n\n \n\n Requiring Coronavirus Disease 2019 Vaccination for Federal Employees \n\n \n\n \n\nQ: What steps may an agency take if a Federal employee refuses to be vaccinated or provide proof of vaccination? \n\n \n\n A: Employees covered by Executive Order 14043 who fail to comply with a requirement to be fully vaccinated or provide proof of vaccination and have neither received an exception or extension nor have an exception or extension request under consideration, are in violation of a lawful order. Employees who violate lawful orders are subject to discipline, up to and including termination or removal. \n\n \n\n Consistent with the Administration’s policy, agencies should initiate an enforcement process to work with employees to achieve their compliance. Accordingly, agencies should initiate the enforcement process with an appropriate period of education and counseling, including providing employees with information regarding the benefits of vaccination and ways to obtain the vaccine. If the employee does not demonstrate progress toward becoming fully vaccinated through completion of a required vaccination dose or provision of required documentation by the end of the counseling and education period, agencies may issue a letter of reprimand, followed by a short suspension (generally, 14 days or less). Continued noncompliance during the suspension can be followed by proposing removal. \n\n \n\n www.saferfederalworkforce.gov...#:~:text=To%20protect%20the%20health%20and,of%20where%20they%20are%20working. \n\n edit on 0630202300000030bMon, 03 Apr 2023 23:14:06 -05002023000000x by StoutBroux because: (no reason given)\n\n Whoever it was, they weren't God and would have no way of knowing if the research data supplied was accurate or not, especially since their capacity was limited by time, and quite frankly, truth from the developers. And the person I believe you're referring to NEVER forced, coerced or mandated in any way to partake of the poison being pushed by money hungry 'vaccine' providers.But another powerful person did:And 'or else' policies were put in place by many government agencies and businesses after January 2021.Executive Order 14043 of September 9, 2021Requiring Coronavirus Disease 2019 Vaccination for Federal Employees \n\n\n\n\n\n\n\n \n\n And the rest of the quote is: \n\n \n\n \n\nRegardless, he affirmed these are “the best statistics we have … at least through today, [and] maybe it will get better,” but at this point, “we’ve got to assume this is now the baseline. There’s going to be 145% higher mortality.” \n\n \n\n I believe with more time it will make sense. The other thing is, more people took the first vaccine, while many of the first time vaccinated did not take follow up vaccines. \n\n \n\n I don't know, it made sense when I typed lol. But really, we have so much yet to learn and discover about the afflictions associated with the Covid19 shot, much has come to light but I believe so far, it is only the tip of the iceberg. a reply to: 1947boomer And the rest of the quote is:I believe with more time it will make sense. The other thing is, more people took the first vaccine, while many of the first time vaccinated did not take follow up vaccines.I don't know, it made sense when I typed lol. But really, we have so much yet to learn and discover about the afflictions associated with the Covid19 shot, much has come to light but I believe so far, it is only the tip of the iceberg. \n\n\n\n\n\nHave had 4 shots already. \n\n \n\n Just turned 65. \n\n \n\n \n\n Sooooo.... I should be dead already. \n\n \n\n But my doctor just gave me a \"clean bill of health\" at my check up this afternoon. \n\n \n\n \n\n And I know I received doses of the real vaccine because I experienced the expected mild side effects each time (although they were milder with each successive dose). \n\n \n\n \n\n I think I look pretty good for a supposed Zombie. \n\n \n\n \n\n At least, I still got all of my original \"parts\"! \n\n\n\n\n\n\n\noriginally posted by: CriticalStinker \n\n a reply to: vNex92 \n\n \n\n Who helped quarterback the government funding of all of them and help rush it through to emergency approval making it impossible to sue them? I can’t remember. \n\n \n\n if we can't sue the manufactures, can we then sue governments, both for making it so you couldn't sue the company (and is that only in the US, since it was the only country i recall doing so?), as well as for forcing people to get vaccinated? thus holding the governments responsible for any related problems. and of course for the government mandating only the more risky vaccines were allowed to be used, and were acceptable if vaccinated in another country. (i could probably sue at least three country's governments over that)\n\n edit on 4-4-2023 by generik because: (no reason given)\n\n if we can't sue the manufactures, can we then sue governments, both for making it so you couldn't sue the company (and is that only in the US, since it was the only country i recall doing so?), as well as for forcing people to get vaccinated? thus holding the governments responsible for any related problems. and of course for the government mandating only the more risky vaccines were allowed to be used, and were acceptable if vaccinated in another country. (i could probably sue at least three country's governments over that) \n\n\n\n\n\n\n\n \n\n that's the whole point of everyone being guinea pigs, its the age old reason of reason the ultra rich white men funded it all.. to live forever. its also why they won't take a backseat in favour of younger people. \n\n \n\n and its the thing that'll get those who pushed the vax a pass and rehabilitate their positions in society, like blaire you can get away with the deaths of millions if it is profitable to neoliberal capitalism. \n\n \n\n **i was an unfortunate who had a vaX clot, when i was at school in the 70s, we were taught we'd live to 75ish, my own learning curve in terms of recovery places me in the same space as having another 75 to go, not only start again with a clot learning to walk and not fall off the loo but also start again in terms of life.. \n\n \n\n why on earth does everyone think they are pushing up retirement ages alongside pushing expanded euthanasia services added bonus of pushing a hatred for the elderly.. \n\n \n\n or as in the case of the uk pushing the evolution of a national health service into a national care service, the labour party in the uk expect it'll take a decade to make the shift from healthcare to social care only marry an expanded euthanasia service and you have the bones of our real issues.\n\n \n\n france is trying to crowbar both in at once increase pension age and roll out a national euthanasia service.. \n\n \n\n as we saw with covid if the gov can convince people they are killing the wrong kinds of people it'll be cheered on.. especially if they think they'll get to profit from killing all those they dislike.. \n\n \n\n it's through that lens the west will tear itself apart rather than vax damage as at the end of the day its the other stuff that'll do them the biggest harms, letting the elderly die and sterilising the young while trying to lockdown, starve and freeze the middle.. \n\n \n\n how long this version of society has its limited.. in the uk labour know they can't win an election without so called stevenage woman voting for them.. stevenage women is basically the majority of the uk, socially conservative and economically liberal.. this is the group that got brexit over the line and johnson in power.. no election can be won without this group.. \n\n \n\n into that mix the likes of posie parker stand as a new Farrage.. and is through those harms that society will pivot again.. the vax injuries are not a pivot point of note its the other harms wrought on society that'll pivot us from this nightmare of harms inflicted on us by our own govs.\n\n edit on 4-4-2023 by nickyw because: (no reason given)\n\n \n\n edit on 4-4-2023 by nickyw because: (no reason given)\n\n on the other hand everyone reading this could live to 140 or 150**that's the whole point of everyone being guinea pigs, its the age old reason of reason the ultra rich white men funded it all.. to live forever. its also why they won't take a backseat in favour of younger people.and its the thing that'll get those who pushed the vax a pass and rehabilitate their positions in society, like blaire you can get away with the deaths of millions if it is profitable to neoliberal capitalism.**i was an unfortunate who had a vaX clot, when i was at school in the 70s, we were taught we'd live to 75ish, my own learning curve in terms of recovery places me in the same space as having another 75 to go, not only start again with a clot learning to walk and not fall off the loo but also start again in terms of life..why on earth does everyone think they are pushing up retirement ages alongside pushing expanded euthanasia services added bonus of pushing a hatred for the elderly..or as in the case of the uk pushing the evolution of a national health service into a national care service, the labour party in the uk expect it'll take a decade to make the shift from healthcare to social care only marry an expanded euthanasia service and you have the bones of our real issues.france is trying to crowbar both in at once increase pension age and roll out a national euthanasia service..as we saw with covid if the gov can convince people they are killing the wrong kinds of people it'll be cheered on.. especially if they think they'll get to profit from killing all those they dislike..it's through that lens the west will tear itself apart rather than vax damage as at the end of the day its the other stuff that'll do them the biggest harms, letting the elderly die and sterilising the young while trying to lockdown, starve and freeze the middle..how long this version of society has its limited.. in the uk labour know they can't win an election without so called stevenage woman voting for them.. stevenage women is basically the majority of the uk, socially conservative and economically liberal.. this is the group that got brexit over the line and johnson in power.. no election can be won without this group..into that mix the likes of posie parker stand as a new Farrage.. and is through those harms that society will pivot again.. the vax injuries are not a pivot point of note its the other harms wrought on society that'll pivot us from this nightmare of harms inflicted on us by our own govs.", "opengraph": {"image": "https://files.abovetopsecret.com/images/ats4.jpg", "title": " New Study Shows Fully Vaccinated Will Lose 25 Years From Life Span, page 2", "description": " New Study Shows Fully Vaccinated Will Lose 25 Years From Life Span, page 2", "site_name": "AboveTopSecret.com"}, "tags": [], "tweets": [], "movies": [], "links": ["../mem/CriticalStinker", "../thread1328622/pg2#pid26947103", "../mem/Xtrozero", "../thread1328622/pg2#pid26947107", "../mem/StoutBroux", "../thread1328622/pg2#pid26947109", "../mem/vNex92", "../thread1328622/pg2#pid26947111", "../mem/CriticalStinker", "../thread1328622/pg2#pid26947117", "../mem/1947boomer", "../thread1328622/pg2#pid26947136", "https://www.lifesitenews.com/news/covid-vaccines-raise-mortality-rate-by-26-analyst-reveals-at-sen-ron-johnsons-roundtable/", "../mem/JDmOKI", "../thread1328622/pg2#pid26947143", "../mem/StoutBroux", "../thread1328622/pg2#pid26947146", "https://www.saferfederalworkforce.gov/faq/vaccinations/", "../mem/StoutBroux", "../thread1328622/pg2#pid26947165", "../mem/Xtrozero", "../thread1328622/pg2#pid26947172", "../mem/Peeple", "../thread1328622/pg2#pid26947177", "../mem/Xtrozero", "../thread1328622/pg2#pid26947183", "../mem/Xtrozero", "../thread1328622/pg2#pid26947184", "../mem/Xtrozero", "../thread1328622/pg2#pid26947187", "../mem/CriticalStinker", "../thread1328622/pg2#pid26947191", "../mem/carewemust", "../thread1328622/pg2#pid26947196", "../mem/Mantiss2021", "../thread1328622/pg2#pid26947210", "../mem/whiteblack", "../thread1328622/pg2#pid26947255", "../mem/generik", "../thread1328622/pg2#pid26947267", "../mem/nickyw", "../thread1328622/pg2#pid26947285"], "authors": [], "publish_date": null}