{"result_id": "006039", "URL": "https://www.abovetopsecret.com/forum/thread1325010/pg1", "timestamp": "2023-04-25 11:46:20 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.abovetopsecret.com/touch-icon-iphone.png", "canonical": "https://www.abovetopsecret.com/forum/thread1325010/pg1", "encoding": "utf-8"}, "image": null, "domain": "www.abovetopsecret.com", "title": "Interview with Dr Campbell: If I knew what I know now I would not have taken the vaccine , page 1", "cleaned_text": "As far as I am concerned Dr John Campbell has been a star during the pandemic and a very good, very reliable and very credible source of information, always taking the time and putting a lot of effort to explain the various research developments and the science behind a range of complicated research papers that a lot of people would not have been able to read & understand ok their own. \n\n \n\n \n\n Hats off to Dr Campbell!!! \n\n Hats off to Neil Oliver!!! \n\n \n\n \n\n A very Interesting point to be made. Neil Oliver said that he is not vaccinated with any of the products that have been available in the market and Dr Campbell says that if he knew what he knows more about the 'vaccines' he would not have taken them. \n\n \n\n I think Dr Campbell now represents a very large audience. Not only those who watch his videos but an increasing number of citizens all over the world who had they known about the potential dangers from these products and the serious adverse reactions they could cause, they would had never taken them. \n\n \n\n Considering that we have only started seeing the short term effects and we don't know either the medium or long terms effects and the benefit to risk ratio in all age groups. \n\n \n\n \n\n The video is here \n\n \n\n youtu.be... \n\n \n\n edit on 19-1-2023 by Asmodeus3 because: (no reason given)\n\n A very interesting and lengthy interview where Neil Oliver interviews Dr John Campbell. Very informative I would say too, as Dr Campbell gives an account of his life as a nurse and as an academic, his experience in the field of nursing and teaching as well as in science and what motivated him so far.As far as I am concerned Dr John Campbell has been a star during the pandemic and a very good, very reliable and very credible source of information, always taking the time and putting a lot of effort to explain the various research developments and the science behind a range of complicated research papers that a lot of people would not have been able to read & understand ok their own.Hats off to Dr Campbell!!!Hats off to Neil Oliver!!!I think Dr Campbell now represents a very large audience. Not only those who watch his videos but an increasing number of citizens all over the world who had they known about the potential dangers from these products and the serious adverse reactions they could cause, they would had never taken them.Considering that we have only started seeing the short term effects and we don't know either the medium or long terms effects and the benefit to risk ratio in all age groups.The video is here \n\n\n\n\n\n\n\n \n\n a reply to: \n\n \n\n A point that I continue to bring up and that continues to baffle me: \n\n \n\n I am not and \"educated\" man in terms of knowing much about biology and medicine, yet the moment these injections were announced, I (like many others) absolutely knew beyond any shadow of a doubt that these things were . Many of us stood against it, tried to sound the alarm, decried the villany, the fraud, the evil. We were shouted down, persecuted, called names, threatened, and in many cases deprived of basic human rights. Most of us were like me, run of the mill people uneducated in the field, but we knew. Everything we knew then is being proven accurate. \n\n \n\n But people like Campbell and Malone lined up, rolled up their sleeves and took the injection. These were \"educated\" people, people who one would think would have known better. I mean, if I did, they sure as hell should have. \n\n \n\n But they didn't. \n\n \n\n I've seen the explantations of being blinded by their own \"education\", etc., but I still don't get it. \n\n \n\n I still don't understand it. a reply to: Asmodeus3 a reply to: Asmodeus3 A point that I continue to bring up and that continues to baffle me:I am not and \"\" man in terms of knowing much about biology and medicine, yet the moment these injections were announced, I (like many others)that these things were. Many of us stood against it, tried to sound the alarm, decried the villany, the fraud, the evil. We were shouted down, persecuted, called names, threatened, and in many cases deprived of basic human rights. Most of us were like me, run of the mill people uneducated in the field, but we knew. Everything we knew then is being proven accurate.But people like Campbell and Malone lined up, rolled up their sleeves and took the injection. These were \"\" people, people who one would think would have known better. I mean, if I did, they sure as hell should have.But they didn't.I've seen the explantations of being blinded by their own \"\", etc., but I still don't get it.I still don't understand it. \n\n\n\n\n\n\n\noriginally posted by: all2human \n\n a reply to: v1rtu0s0 \n\n \n\n He's doing his best with the available data \n\n an honorable man,with good intentions \n\n but he knew of the lab to market timeline \n\n the fuzzy math, the omissions and inconsistencies from health authorities \n\n he should have promoted much more caution. \n\n \n\n \n\n Precisely! \n\n \n\n This is what I say too. \n\n \n\n He has changed his mind according to the available data. And the data is quite revealing. There is no nothing wrong changing your views given new data and evidence. However nobody should have been ready to accept these products as safe and effective as most knew nothing about them. \n\n \n\n Personally, as I am not a layman, couldn't get a medical product for which nothing was known, such as the short, medium, and long terms effects and the benefit to risk ratio in all age groups when at the same time it was pushed through mandates, coercion, pressure, intimidation, and threats of dismissal by the employers. \n\n \n\n It's time the mRNA products are withdrawn from the market just as the other vaccines have been quitely withdrawn from most markets. Precisely!This is what I say too.He has changed his mind according to the available data. And the data is quite revealing. There is no nothing wrong changing your views given new data and evidence. However nobody should have been ready to accept these products as safe and effective as most knew nothing about them.Personally, as I am not a layman, couldn't get a medical product for which nothing was known, such as the short, medium, and long terms effects and the benefit to risk ratio in all age groups when at the same time it was pushed through mandates, coercion, pressure, intimidation, and threats of dismissal by the employers.It's time the mRNA products are withdrawn from the market just as the other vaccines have been quitely withdrawn from most markets. \n\n\n\n\n\n\n\n \n\n I had in the early days, more than one discussion with doctors that I liked and trusted, regarding the emergency use approved vaccine that was being pushed. It always came to be the subject that we agreed to disagree on. \n\n \n\n There are still some doctors and nurses that continue to support the vaccine. Just like there are some that still enforce the wearing of masks. \n\n \n\n I watched Dr. Campbell's videos in the beginning, and we butted heads quite frequently. That is why I was a bit surprised to see his gradual distancing of himself from the vaccine, with each new negative report. I started to develop some respect for him, because it was obvious to me that he acted in good faith, based on the information that he was provided and had access to. \n\n \n\n He did not obfuscate, lie, or downright hide the information when it started to become clear that the vaccine is not what they claimed it was. I think it took a lot of courage and integrity to admit that he was wrong. \n\n edit on 19-1-2023 by NightSkyeB4Dawn because: Clean up.\n\n I work in the medical field. There were many doctors and nurses that believed the information they were given, and trusted the WHO, the CDC, and the government. They faithfully took their guidance to heart, and were willing to coerce staff and patients to follow their instruction.I had in the early days, more than one discussion with doctors that I liked and trusted, regarding the emergency use approved vaccine that was being pushed. It always came to be the subject that we agreed to disagree on.There are still some doctors and nurses that continue to support the vaccine. Just like there are some that still enforce the wearing of masks.I watched Dr. Campbell's videos in the beginning, and we butted heads quite frequently. That is why I was a bit surprised to see his gradual distancing of himself from the vaccine, with each new negative report. I started to develop some respect for him, because it was obvious to me that he acted in good faith, based on the information that he was provided and had access to.He did not obfuscate, lie, or downright hide the information when it started to become clear that the vaccine is not what they claimed it was. I think it took a lot of courage and integrity to admit that he was wrong. \n\n\n\n\n\n\n\n \n\n These are super smart people. They had all the access to information I had and more. \n\n \n\n I knew then what he just figured out. Not by guess or because I’m just a conspiracy theorist but because I read and listened. \n\n \n\n How is that possible? \n\n \n\n What fauci said and his support of the vaccination wasn’t stupidity. He knows it’s all crap. How did Dr chambell and smart people like him not know? \n\n \n\n People, trust yourself because these people are not as smart as you think they are or they think they are. My cardiologist told me to take it because he did. I didn’t. Haven’t seen him at work in his office or the hospital since. I can’t get an appointment to see him, only his PAs. When I do get one they cancel it a few days before. \n\n \n\n Why did it take him so long? a reply to: Asmodeus3 These are super smart people. They had all the access to information I had and more.I knew then what he just figured out. Not by guess or because I’m just a conspiracy theorist but because I read and listened.How is that possible?What fauci said and his support of the vaccination wasn’t stupidity. He knows it’s all crap. How did Dr chambell and smart people like him not know?People, trust yourself because these people are not as smart as you think they are or they think they are. My cardiologist told me to take it because he did. I didn’t. Haven’t seen him at work in his office or the hospital since. I can’t get an appointment to see him, only his PAs. When I do get one they cancel it a few days before.Why did it take him so long? \n\n\n\n\n\n\n\noriginally posted by: iwanttobelieve70 \n\n a reply to: Asmodeus3 \n\n \n\n These are super smart people. They had all the access to information I had and more. \n\n \n\n I knew then what he just figured out. Not by guess or because I’m just a conspiracy theorist but because I read and listened. \n\n \n\n How is that possible? \n\n \n\n What fauci said and his support of the vaccination wasn’t stupidity. He knows it’s all crap. How did Dr chambell and smart people like him not know? \n\n \n\n People, trust yourself because these people are not as smart as you think they are or they think they are. My cardiologist told me to take it because he did. I didn’t. Haven’t seen him at work in his office or the hospital since. I can’t get an appointment to see him, only his PAs. When I do get one they cancel it a few days before. \n\n \n\n Why did it take him so long? \n\n \n\n \n\n \n\n I think Dr Campbell distanced himself not that long after the vaccines were rolled out and given the evidence he was seeing. It was clear that he thought the vaccines were not safe and effective and it was clear most young and healthy adults together with children did not need these products. \n\n \n\n He was always in favour kg natural immunity for these groups. \n\n \n\n If your cardiologist told you to get vaccinated it's probably because he also fell into the same trap as many others. \n\n \n\n One thing has come out of this which is really positive. There are serious discussions on whether the pharmaceuticals could operate the way they do in the future and whether society needs them. Imagine the same pharmaceutical companies trying to promote products for cancer on the basis of new untested and potentially dangerous 'treatments'. It's a long and serious discussion but public health and medicines should never be again dependent on pharma. \n\n \n\n The pharmaceuticals have to be dismantled. \n\n \n\n I know this is a message that some members don't like given they are vaccine apologists, denialists of reality and defenders of the pharmaceuticals. But I think Dr Campbell distanced himself not that long after the vaccines were rolled out and given the evidence he was seeing. It was clear that he thought the vaccines were not safe and effective and it was clear most young and healthy adults together with children did not need these products.He was always in favour kg natural immunity for these groups.If your cardiologist told you to get vaccinated it's probably because he also fell into the same trap as many others.One thing has come out of this which is really positive. There are serious discussions on whether the pharmaceuticals could operate the way they do in the future and whether society needs them. Imagine the same pharmaceutical companies trying to promote products for cancer on the basis of new untested and potentially dangerous 'treatments'. It's a long and serious discussion but public health and medicines should never be again dependent on pharma.The pharmaceuticals have to be dismantled.I know this is a message that some members don't like given they are vaccine apologists, denialists of reality and defenders of the pharmaceuticals. But \n\n\n\n\n\n\n\noriginally posted by: NightSkyeB4Dawn \n\n \n\noriginally posted by: Asmodeus3 \n\n a reply to: NightSkyeB4Dawn \n\n \n\n The medical profession after three years on this absurd situation, has lost most of its integrity and credibility. It is very unlikeky that they will be trusted again or let's say blindly trusted in the future. It's something very positive imo and they need to come to terms with what the pharmaceutical companies represent and that they have no place in society. Responsible Governments cannot empower these companies or trust them to provide solutions to the needs humans have. We cannot rely on them. \n\n \n\n \n\n The COVID BS is not the cause of the demise of the medical industry. That started years ago when it was bought up by the pharmacuetical companies and the insurance companies. \n\n \n\n It was so easy to see the hand writing on the wall, except for those that chose not to see. \n\n \n\n COVID just pulled back the curtain on what anyone that has ever worked in the medical industry for more than 20 years, already knew. \n\n \n\n Many of the young folk can fall under the category of plausible deniability. Most never saw what the medical industry was before the infestation, so they can claim they did not know anything else. \n\n \n\n \n\n \n\n That is true. The medical industry and the pharmaceuticals & insurance companies are entangled with each other. It is not in the best interest of our society to rely on the or being dependent on the pharmaceuticals for medical treatments and medicines and cures. Public health, science, and medicine, cannot be the exclusive and privileged areas of only a 'few'. That should be the discussion from now on. Society should not be at the mercy of these companies and neither should be given such powers again which they use to influence legislation, politicians, lawmakers, and buy everyone and everything. That is true. The medical industry and the pharmaceuticals & insurance companies are entangled with each other. It is not in the best interest of our society to rely on the or being dependent on the pharmaceuticals for medical treatments and medicines and cures. Public health, science, and medicine, cannot be the exclusive and privileged areas of only a 'few'. That should be the discussion from now on. Society should not be at the mercy of these companies and neither should be given such powers again which they use to influence legislation, politicians, lawmakers, and buy everyone and everything.", "opengraph": {"image": "https://files.abovetopsecret.com/images/ats3.jpg", "title": "Interview with Dr Campbell: If I knew what I know now I would not have taken the vaccine  , page 1", "description": "Interview with Dr Campbell: If I knew what I know now I would not have taken the vaccine  , page 1", "site_name": "AboveTopSecret.com"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "550", "height": "344", "embed_code": "<iframe width=\"550\" height=\"344\" src=\"https://www.youtube.com/embed/H7inaTiDKaU?rel=0&amp;autoplay=0\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/H7inaTiDKaU?rel=0&autoplay=0"}], "links": ["../mem/Asmodeus3", "../thread1325010/pg1#pid26853335", "https://youtu.be/vM6TSWzw66U", "../mem/v1rtu0s0", "../thread1325010/pg1#pid26853341", "https://www.abovetopsecret.com/forum/thread1324997/pg1", "../mem/all2human", "../thread1325010/pg1#pid26853360", "../mem/v1rtu0s0", "../thread1325010/pg1#pid26853364", "../mem/Kenzo", "../thread1325010/pg1#pid26853387", "../mem/incoserv", "../thread1325010/pg1#pid26853401", "../mem/all2human", "../thread1325010/pg1#pid26853404", "../mem/Asmodeus3", "../thread1325010/pg1#pid26853411", "../mem/all2human", "../thread1325010/pg1#pid26853451", "../mem/RMFX1", "../thread1325010/pg1#pid26853469", "../mem/Asmodeus3", "../thread1325010/pg1#pid26853503", "../mem/Asmodeus3", "../thread1325010/pg1#pid26853515", "../mem/Asmodeus3", "../thread1325010/pg1#pid26853516", "../mem/NightSkyeB4Dawn", "../thread1325010/pg1#pid26853547", "../mem/iwanttobelieve70", "../thread1325010/pg1#pid26853582", "../mem/Asmodeus3", "../thread1325010/pg1#pid26853611", "../mem/Asmodeus3", "../thread1325010/pg1#pid26853621", "../mem/Asmodeus3", "../thread1325010/pg1#pid26853727", "../mem/NightSkyeB4Dawn", "../thread1325010/pg1#pid26853921", "../mem/Asmodeus3", "../thread1325010/pg1#pid26854001"], "authors": [], "publish_date": null}