{"result_id": "006015", "URL": "https://www.abovetopsecret.com/forum/thread1278204/pglastpost", "timestamp": "2023-04-25 11:46:08 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.abovetopsecret.com/touch-icon-iphone.png", "canonical": "https://www.abovetopsecret.com/forum/thread1278204/pglastpost", "encoding": "utf-8"}, "image": null, "domain": "www.abovetopsecret.com", "title": "Just a thought about the vaccines, page 2", "cleaned_text": "Vaccines are mostly about money making now a days, like most everything else. As for whats in the vaccine. Ah who knows, they put all kinds of crap in things, if your lucky its just a placebo so the drug companies can sell billions and make hundreds of billions, and have the tax payers pay for it all. \n\n \n\n If your not lucky. you still would be somewhat fine. But your kids may feel the effects down the line. \n\n \n\n \n\n But if you die of the corona virus. Then your immune system is severely compromised to begin with. As for the upcoming new corona strain? Well its more oxymoronic things such as the fact that wearing masks helps is keeping the spread of viruses down. But the virus is spreading like wildfire or so the TV says. \n\n \n\n So that right there is a contradictions. Masks either work and the virus is dwindling and you would not see the constant raving about it on the TV, or they don't work, and the virus is spreading. So which is it? Quite a mystery eh? Of the ever so effective masks, which are ever so noneffective. After all wasn't there supposed to be some one million new cases in the US by the end of the year. \n\n \n\n Or so the TV said when I watched it a month or so ago. \n\n \n\n \n\n What I am trying to get at is. Of-course there will be more worse things coming out next year and the year after that, and the year after that. \n\n \n\n Most of it will not be televised. So you need not be worried, as we all know. If its not televised. Then it does not exists. Out of sight, out of mind. Unless off course for the many who will be getting a first hand course in things. Or? Well guess time will tell. \n\n \n\n So no society wont fall apart. It will continue to limp on into the sunset like always. Simply because the money is in curing the symptoms, not the diseases. And well there is always the unforeseen of what the future will come to tell. And if there was an actual virus or something out there that would be that deadly? \n\n \n\n Well off-course you would all die. Simple as that. But there isn't, so you all are still alive and kicking to talk chat about it on the net. The rest is just more stupid stuff. a reply to: ADUB77 Vaccines are mostly about money making now a days, like most everything else. As for whats in the vaccine. Ah who knows, they put all kinds of crap in things, if your lucky its just a placebo so the drug companies can sell billions and make hundreds of billions, and have the tax payers pay for it all.If your not lucky. you still would be somewhat fine. But your kids may feel the effects down the line.But if you die of the corona virus. Then your immune system is severely compromised to begin with. As for the upcoming new corona strain? Well its more oxymoronic things such as the fact that wearing masks helps is keeping the spread of viruses down. But the virus is spreading like wildfire or so the TV says.So that right there is a contradictions. Masks either work and the virus is dwindling and you would not see the constant raving about it on the TV, or they don't work, and the virus is spreading. So which is it? Quite a mystery eh? Of the ever so effective masks, which are ever so noneffective. After all wasn't there supposed to be some one million new cases in the US by the end of the year.Or so the TV said when I watched it a month or so ago.What I am trying to get at is. Of-course there will be more worse things coming out next year and the year after that, and the year after that.Most of it will not be televised. So you need not be worried, as we all know. If its not televised. Then it does not exists. Out of sight, out of mind. Unless off course for the many who will be getting a first hand course in things. Or? Well guess time will tell.So no society wont fall apart. It will continue to limp on into the sunset like always. Simply because the money is in curing the symptoms, not the diseases. And well there is always the unforeseen of what the future will come to tell. And if there was an actual virus or something out there that would be that deadly?Well off-course you would all die. Simple as that. But there isn't, so you all are still alive and kicking to talk chat about it on the net. The rest is just more stupid stuff. \n\n\n\n\n\n\n\noriginally posted by: Phage \n\n a reply to: rickymouse \n\n \n\n And eating strawberries will cure stage IV cancer. \n\n \n\n \n\n I will believe doctors that witnessed it and doctors who have degrees in medicine before I believe you. I have this intolerance listed on my records and every doctor checked the records before putting it on their record. Three of the doctors said I have the reaction since I have had a flu that gave me resistance, they have told my granddaughter the same thing and all of them mentioned I should not take the flu shot...my granddaughter has had this verified since she was sixteen and it is listed on her medical records too. Ask your doctor next time you see him or her about this. It is even listed on the site of the pharma companies that make the fluvent vaccines. \n\n \n\n You are not a doctor, I am going to believe a doctor before you. \n\n \n\n Also, you evidently did not even bother to look up the strawberry thing, it is in at least three research articles, but only applies to esophogeal, stomach, and colon cancer. Don't be lazy, try to prove me wrong. I at one time knew the name of the compound that actually triggered the destruction of the chemical. But I do not need to know that. \n\n \n\n A link other than the two I gave you before that showed that it works in humans too....up to stage four in esophogeal cancer. There are plenty of research articles on that subject, but you would have to eat a minimum of a quart a day or use freeze dried powder. \n\n \n\n www.ncbi.nlm.nih.gov... \n\n \n\n This study is not alone and it has been evaluated in human trials. Note, it also says Breast cancer, but from human trials, it does not do too much in cancers other than in the digestive system. I will believe doctors that witnessed it and doctors who have degrees in medicine before I believe you. I have this intolerance listed on my records and every doctor checked the records before putting it on their record. Three of the doctors said I have the reaction since I have had a flu that gave me resistance, they have told my granddaughter the same thing and all of them mentioned I should not take the flu shot...my granddaughter has had this verified since she was sixteen and it is listed on her medical records too. Ask your doctor next time you see him or her about this. It is even listed on the site of the pharma companies that make the fluvent vaccines.You are not a doctor, I am going to believe a doctor before you.Also, you evidently did not even bother to look up the strawberry thing, it is in at least three research articles, but only applies to esophogeal, stomach, and colon cancer. Don't be lazy, try to prove me wrong. I at one time knew the name of the compound that actually triggered the destruction of the chemical. But I do not need to know that.A link other than the two I gave you before that showed that it works in humans too....up to stage four in esophogeal cancer. There are plenty of research articles on that subject, but you would have to eat a minimum of a quart a day or use freeze dried powder.This study is not alone and it has been evaluated in human trials. Note, it also says Breast cancer, but from human trials, it does not do too much in cancers other than in the digestive system. \n\n\n\n\n\n\n\noriginally posted by: Phage \n\n a reply to: rickymouse \n\n \n\n And eating strawberries will cure stage IV cancer. \n\n \n\n \n\n I will believe doctors that witnessed it and doctors who have degrees in medicine before I believe you. I have this intolerance listed on my records and every doctor checked the records before putting it on their record. Three of the doctors said I have the reaction since I have had a flu that gave me resistance, they have told my granddaughter the same thing and all of them mentioned I should not take the flu shot...my granddaughter has had this verified since she was sixteen and it is listed on her medical records too. Ask your doctor next time you see him or her about this. It is even listed on the site of the pharma companies that make the fluvent vaccines. \n\n \n\n You are not a doctor, I am going to believe a doctor before you. \n\n \n\n Also, you evidently did not even bother to look up the strawberry thing, it is in at least three research articles, but only applies to esophogeal, stomach, and colon cancer. Don't be lazy, try to prove me wrong. I at one time knew the name of the compound that actually triggered the destruction of the chemical. But I do not need to know that. \n\n \n\n A link other than the two I gave you before that showed that it works in humans too....up to stage four in esophogeal cancer. There are plenty of research articles on that subject, but you would have to eat a minimum of a quart a day or use freeze dried powder. \n\n \n\n www.ncbi.nlm.nih.gov... \n\n \n\n This study is not alone and it has been evaluated in human trials. Note, it also says Breast cancer, but from human trials, it does not do too much in cancers other than in the digestive system. I will believe doctors that witnessed it and doctors who have degrees in medicine before I believe you. I have this intolerance listed on my records and every doctor checked the records before putting it on their record. Three of the doctors said I have the reaction since I have had a flu that gave me resistance, they have told my granddaughter the same thing and all of them mentioned I should not take the flu shot...my granddaughter has had this verified since she was sixteen and it is listed on her medical records too. Ask your doctor next time you see him or her about this. It is even listed on the site of the pharma companies that make the fluvent vaccines.You are not a doctor, I am going to believe a doctor before you.Also, you evidently did not even bother to look up the strawberry thing, it is in at least three research articles, but only applies to esophogeal, stomach, and colon cancer. Don't be lazy, try to prove me wrong. I at one time knew the name of the compound that actually triggered the destruction of the chemical. But I do not need to know that.A link other than the two I gave you before that showed that it works in humans too....up to stage four in esophogeal cancer. There are plenty of research articles on that subject, but you would have to eat a minimum of a quart a day or use freeze dried powder.This study is not alone and it has been evaluated in human trials. Note, it also says Breast cancer, but from human trials, it does not do too much in cancers other than in the digestive system. \n\n\n\n\n\n\n\noriginally posted by: kwakakev \n\n It is playing out as part of a depopulation agenda. Treatments are restricted and censored as lock downs encouraged. Masks mandated as the risks ignored. The flu has disappeared as all the funding is directed towards covid. \n\n \n\n As for the vaccination, there has been a lot of difficulties in attempts to produce a vaccination for corona viruses in the past. Antibody production can be achieved, but when reinfection occurs the impacts are much more severe. \n\n \n\n As for this new mRNA vaccination, I will pass. The whole thing looks a bit silly to produce an naturally occurring spike protein used in ACE2 regulation to engage the immune system to attack it. \n\n \n\n \n\n \n\n This is the part I've been trying to get clarity on. The spike protein latches on to ACE2 - they're like a match made in heaven, which is why those with higher ACE2 expression are at higher risk (and why certain medications, like ibuprofen, which increase ACE2 should be avoided.) \n\n \n\n It seems to be there must be some relation - a same or similar protein which interacts with ACE2 under normal circumstances, but which the virus is throwing into overdrive. Programming the body to react to the protein as an invader seems as though it could cause long-term auto-immune dysregulation in some way. \n\n \n\n Trials have not shown this. However, have trials been done on prepubescent children, and have we determined that they are not rendered sterile 3 years down the road, or that their offspring will not develop properly? Obviously not, but is there good science which tells us that will not be the case? (Just throwing out an example of potential here.) \n\n \n\n I need to understand ACE2 and the spike protein, and know that the body will not be attacking or dysregulating anything it shouldn't be in the future (meaning only the virus and nothing else will be affected. \n\n \n\n Nobody who I've seen is addressing that. Concerns about auto immune problems are dismissed based on the vaccine being fragile. The answer to that is the doses need to be kept cold. Nobody addresses how long that effect will persist in the cells of the human body. This is the part I've been trying to get clarity on. The spike protein latches on to ACE2 - they're like a match made in heaven, which is why those with higher ACE2 expression are at higher risk (and why certain medications, like ibuprofen, which increase ACE2 should be avoided.)It seems to be there must be some relation - a same or similar protein which interacts with ACE2 under normal circumstances, but which the virus is throwing into overdrive. Programming the body to react to the protein as an invader seems as though it could cause long-term auto-immune dysregulation in some way.Trials have not shown this. However, have trials been done on prepubescent children, and have we determined that they are not rendered sterile 3 years down the road, or that their offspring will not develop properly? Obviously not, but is there good science which tells us that will not be the case? (Just throwing out an example of potential here.)I need to understand ACE2 and the spike protein, and know that the body will not be attacking or dysregulating anything it shouldn't be in the future (meaningthe virus and nothing else will be affected.Nobody who I've seen is addressing that. Concerns about auto immune problems are dismissed based on the vaccine being fragile. The answer to that is the doses need to be kept cold. Nobody addresses how long that effect will persist in the cells of the human body. \n\n\n\n\n\n\n\n \n\n There are way too many unknowns to expect people to take this risk. \n\n \n\n As long as it is completely their choice, I have nothing to say about it. But I don't understand why they are patting people on the back for what they are pushing as a successful vaccine, five years ahead of schedule..... \n\n \n\n A vaccine rushed through, under duress I might add, and which has not been put through the main test, the test of time. \n\n \n\n I don't have a lot of time left, and I have enough obstacles and hurdles I have to deal with. I don't choose to play guinea pig for another medication or procedure. I plan to just take one day at a time, and take my chances with fate. \n\n \n\n That is my choice. Others will make their choices and will do what they think is best for them. \n\n \n\n Cue music. \"Don't Cry For Me Argentina\"....... a reply to: dogstar23 There are way too many unknowns to expect people to take this risk.As long as it is completely their choice, I have nothing to say about it. But I don't understand why they are patting people on the back for what they are pushing as a successful vaccine, five years ahead of schedule.....A vaccine rushed through, under duress I might add, and which has not been put through the main test, the test of time.I don't have a lot of time left, and I have enough obstacles and hurdles I have to deal with. I don't choose to play guinea pig for another medication or procedure. I plan to just take one day at a time, and take my chances with fate.That is my choice. Others will make their choices and will do what they think is best for them.Cue music. \"Don't Cry For Me Argentina\"....... \n\n\n\n\n\n\n\n \n\n I still suspect my father had COVID back in November of 2019. He had developed an autoimmune blood disorder a couple years prior, which was well in control. When he got sick 13 months ago, it was at least 6 months of absolute hell and near death multiple times. He's still recovering. \n\n \n\n They still don't know what set it off - and they know so little about this vaccine that it could well kill someone like my father. If this was killing like Smallpox, I'd say rush that vaccine, but as it stands - and a WHOLE NEW TYPE of vaccine, I think its conpletely reckless. \n\n \n\n They're going to do it anyhow. I think since there's zero liability, all vaccine candidates should be nationalized. Pay a fair sum for the research to develop it, but there should be zero profit motive if there's zero liability. Our government funded university labs can develop these vaccines. Rushing billions into corporations with something that may or may not decimate the future health of the nation is insane. a reply to: NightSkyeB4Dawn I still suspect my father had COVID back in November of 2019. He had developed an autoimmune blood disorder a couple years prior, which was well in control. When he got sick 13 months ago, it was at least 6 months of absolute hell and near death multiple times. He's still recovering.They still don't know what set it off - and they know so little about this vaccine that it could well kill someone like my father. If this was killing like Smallpox, I'd say rush that vaccine, but as it stands - and a WHOLE NEW TYPE of vaccine, I think its conpletely reckless.They're going to do it anyhow. I think since there's zero liability, all vaccine candidates should be nationalized. Pay a fair sum for the research to develop it, but there should be zero profit motive if there's zero liability. Our government funded university labs can develop these vaccines. Rushing billions into corporations with something that may or may not decimate the future health of the nation is insane.", "opengraph": {"image": "https://files.abovetopsecret.com/images/ats8.jpg", "title": "Just a thought about the vaccines, page 2", "description": "Just a thought about the vaccines, page 2", "site_name": "AboveTopSecret.com"}, "tags": [], "tweets": [], "movies": [], "links": ["../mem/Phage", "../thread1278204/pg2#pid25627638", "../mem/galadofwarthethird", "../thread1278204/pg2#pid25627693", "../mem/rickymouse", "../thread1278204/pg2#pid25627732", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3468438/", "../mem/rickymouse", "../thread1278204/pg2#pid25627733", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3468438/", "../mem/dug88", "../thread1278204/pg2#pid25627920", "../mem/ADUB77", "../thread1278204/pg2#pid25628528", "../mem/schuyler", "../thread1278204/pg2#pid25628630", "../mem/Nothin", "../thread1278204/pg2#pid25629986", "../mem/RoScoLaz5", "../thread1278204/pg2#pid25629998", "../mem/carewemust", "../thread1278204/pg2#pid25630016", "https://twitter.com/freep/status/1338122711671910401", "https://www.freep.com/story/news/health/2020/12/13/pfizer-covid-19-vaccines-kalamazoo-michigan/6529215002/", "../mem/djz3ro", "../thread1278204/pg2#pid25630028", "../mem/carsforkids", "../thread1278204/pg2#pid25630061", "../mem/dogstar23", "../thread1278204/pg2#pid25630661", "../mem/NightSkyeB4Dawn", "../thread1278204/pg2#pid25631050", "../mem/dogstar23", "../thread1278204/pg2#pid25631466", "../mem/Ophiuchus1", "../thread1278204/pg2#pid25632054", "https://www.researchgate.net/profile/Anna_Nikalje/publication/274837597_Nanotechnology_and_its_Applications_in_Medicine/links/5535e76e0cf20ea35f1", "https://www.researchgate.net/profile/Anna_Nikalje/publication/274837597_Nanotechnology_and_its_Applications_in_Medicine/links/5535e76e0cf20ea35f1\n0ecce/Nanotechnology-and-its-Applications-in-Medicine.pdf?origin=publication_detail", "../mem/wdkirk", "../thread1278204/pg2#pid25632057", "../mem/Ophiuchus1", "../thread1278204/pg2#pid25632163", "https://news.google.com/articles/CBMic2h0dHBzOi8vdGhlaGlsbC5jb20vaG9tZW5ld3MvYWRtaW5pc3RyYXRpb24vNTMwMTUxLXdoaXRlLWhvdXNlLXNlY3VyaXR5LW9mZmljaWFs\nLWxvc3QtZm9vdC1hbmQtcGFydC1vZi1sZWctYmF0dGxpbmfSAXdodHRwczovL3RoZWhpbGwuY29tL2hvbWVuZXdzL2FkbWluaXN0cmF0aW9uLzUzMDE1MS13aGl0ZS1ob3VzZS1zZWN1cml0eS1vZm\nZpY2lhbC1sb3N0LWZvb3QtYW5kLXBhcnQtb2YtbGVnLWJhdHRsaW5nP2FtcA?hl=en-US&gl=US&ceid=US%3Aen", "../mem/tanstaafl", "../thread1278204/pg2#pid25633521"], "authors": [], "publish_date": null}