{"result_id": "006045", "URL": "https://www.abovetopsecret.com/forum/thread1329168/pg2", "timestamp": "2023-04-25 11:46:23 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.abovetopsecret.com/touch-icon-iphone.png", "canonical": "https://www.abovetopsecret.com/forum/thread1329168/pg2", "encoding": "utf-8"}, "image": null, "domain": "www.abovetopsecret.com", "title": "Switzerland no longers recommends any Covid vaccines for all age groups , page 2", "cleaned_text": "originally posted by: Albert999 \n\n \n\noriginally posted by: 1947boomer \n\n \n\noriginally posted by: Asmodeus3 \n\n This is directly from the Federal Office of Public Health of Switzerland. \n\n \n\n They have already translated the page to English for our own convenience. \n\n \n\n www.bag.admin.ch... \n\n \n\n \n\n \n\n \n\n \n\n In principle, no COVID-19 vaccination is recommended for spring/summer 2023 . Nearly everyone in Switzerland has been vaccinated and/or contracted and recovered from COVID-19. Their immune system has therefore been exposed to the coronavirus. In spring/summer 2023, the virus will likely circulate less. The current virus variants also cause rather mild illness. For autumn 2023, the vaccination recommendation will be evaluated again and adjusted accordingly \n\n \n\n \n\n What applies to people at especially high risk? \n\n \n\n In principle, it is also not currently recommended for people at especially high risk to receive a COVID-19 vaccination . They can, however, receive a vaccination following an individual consultation with their doctor. Vaccination may be wise in individual cases, as it improves protection against developing severe COVID-19 for several months. This applies regardless of the number of vaccinations you have already received. \n\n \n\n \n\n \n\n \n\n More news on this topic \n\n \n\n wlos.com... \n\n \n\n Switzerland not recommending COVID vaccines, even for high risk individuals, during spring and summer \n\n \n\n \n\n \n\nSwitzerland's decision to rescind its COVID-19 vaccine recommendations follows other European countries that have severely loosened their recommendations since the COVID-19 vaccine was released. \n\n \n\n Earlier this year, France stopped recommending COVID-19 vaccines for the general public, which came almost a full year after it lifted the requirement that foreign tourists be vaccinated. Denmark halted its COVID-19 vaccine recommendations all the way back in 2022. \n\n \n\n \n\n There are several questions that can be asked but not in relation to what Switzerland decided to do. For example, was it always the case that children, teenagers, and young and healthy adults, didn't really need any of these Covid vaccines, especially when a large number were already exposed to the virus and developed robust and superior natural immunity. From the moment the first cases of the virus were detected to the moment the first young adults received the vaccines, at least 16 months passed. \n\n \n\n Recommending untested, experimental, and potential hazardous products to young and healthy populations, including children, is at least criminal and medical negligence, and given the number of severe adverse reactions and deaths among young and healthy people due to these products, maybe the greatest medical scandal in history as a number of medical doctors and scientists have said. \n\n \n\n I will emphasize the part where the Swiss Medical Authorities discuss about those who have already been infected and recovered from Covid-19 and I will add to this the very large amount of those who were asymptomatic. When you are infected and deal with the virus then the show for the virus is over. Why previously there were many recommendations to get vaccinated regardless of age group and Covid status?? It seems irrational at the very least. \n\n \n\n This seems irrational, only if you don't understand the mathematics of pandemic growth. \n\n \n\n The mathematical parameter that determines the severity of an epidemic is the basic reproduction number, R. R is the average number of people that an infected person will infect. If R is exactly 1, then every infected person will infect exactly one other person, on the average. In that case, the epidemic will neither grow nor shrink. For every person that gets infected and adds to the population of infected, another person will either recover or die and subtract from the population of infected. If R is greater than one, the population of infected will grow larger over time and if R is less than one, the population of infected will shrink over time. One of the main factors that determines how big R is is the percentage of the population that has specific antibodies to the virus in question. \n\n \n\n 3 years ago at this time, when the virus was just getting started, much less that 1% of the population had been infected and recovered or died. That means that practically everyone that an infected person would meet had no specific immunity to Covid and the probability of an infected person transmitting the virus to someone else would be very high. In the first half of 2020 in Northern Europe, R had an average value of about 4.22: \n\n \n\n www.ncbi.nlm.nih.gov... \n\n \n\n That's why we saw very rapid growth of the case numbers at that time. \n\n \n\n In early 2021, when the vaccines were first introduced, only about 7% of the population in the US had developed natural immunity from having recovered from infection, so R was still a large positive number, which is why vaccination could make a lot of difference at that time. By the end of 2021, about 10 times as much of the population (75%) had gained some level of immunity from vaccination: \n\n \n\n Now fast forward to today. About 97% of the Swiss population has some level of immunity from either infection, vaccine, or both. The current best estimate of R for Switzerland is 0.38 and a year ago it was 1.38: \n\n \n\n www.theglobaleconomy.com... \n\n \n\n In other words, a year ago the population of infected was still growing rapidly but now it is shrinking rapidly. Furthermore, there is not much more herd immunity to be gained in the population by either vaccination or infection. \n\n \n\n Specific individuals who might be immunocompromised due to cancer treatment, etc. might be at higher risk and want to continue vaccination, but that's on a case-by-case basis. In other words, Covid has gone from a public health issue to a private health issue. \n\n \n\n \n\n \n\n The usual word salad 😆 \n\n \n\n Bla bla bla and the usual vaccine apologetics. \n\n \n\n The last few days we had even more vaccine apologetics and complete denialism of reality in relation to the Astrazeneca vaccine. \n\n \n\n Withdrawn from most countries that have used it \n\n Seriously Injured and killed many people \n\n Legal action has been taken by a group of people against Astrazeneca \n\n \n\n A failed vaccine! But yet desperate attempts to support the... withdrawn vaccine. \n\n \n\n Some sort of psychosis. \n\n edit on 14-4-2023 by Asmodeus3 because: (no reason given)\n\n Bla bla bla and the usual vaccine apologetics.The last few days we had even more vaccine apologetics and complete denialism of reality in relation to the Astrazeneca vaccine.Withdrawn from most countries that have used itSeriously Injured and killed many peopleLegal action has been taken by a group of people against AstrazenecaA failed vaccine! But yet desperate attempts to support the... withdrawn vaccine.Some sort of psychosis. \n\n\n\n\n\n\n\n \n\n Some people were remunerated with donuts, some with a day off work and some with that feeling of righteous superiority that only double masking and zero effort end game can provide. \n\n \n\n As for myself music is my memory. \n\n \n\n \n\n \n\n a reply to: So there was a nice big invitation to participate in a global experiment of diabolical proportions.Some people were remunerated with donuts, some with a day off work and some with that feeling of righteous superiority that only double masking and zero effort end game can provide.As for myself music is my memory.a reply to: Asmodeus3 \n\n\n\n\n\n\n\noriginally posted by: Oldcarpy2 \n\n a reply to: Asmodeus3 \n\n \n\n Maybe, you might want to answer a direct question? You constantly ask other posters about their qualifications and background. I have given you mine. \n\n \n\n About time you did the same. \n\n \n\n If you go back and see the long reply someone else said we don't know mathematics and hence my reply. \n\n \n\n I think you are able to read what the thread is about. \n\n \n\n No more Covid vaccines for the time being for all age groups in Switzerland. Wise choice? \n\n \n\n F*** yeah!!! If you go back and see the long reply someone else said we don't know mathematics and hence my reply.I think you are able to read what the thread is about.No more Covid vaccines for the time being for all age groups in Switzerland. Wise choice?F*** yeah!!! \n\n\n\n\n\nI have just seen the mistake, the title of the thread should have been: Switzerland no longer recommends any Covid vaccines for all age groups. \n\n \n\n There is an additional 's' added to the word longer.. \n\n I don't know if any mod can fix it. \n\n\n\n\n\n\n\n \n\n \n\n \n\n \n\n They can, however, receive a vaccination following an individual consultation with their doctor. \n\n \n\n \n\n That's how it should have been from the beginning. Doctors should have been allowed to consider this on an individual risk/benefit basis. Based on the real data, not the scare mongering nonsense we were bombarded with. a reply to: Asmodeus3 That's how it should have been from the beginning. Doctors should have been allowed to consider this on an individual risk/benefit basis. Based on the real data, not the scare mongering nonsense we were bombarded with. \n\n\n\n\n\n\n\noriginally posted by: ironfistdragon \n\n It makes sense. By now covid-19 is just like any other covid. A mere common cold. \n\n \n\n You meant any other coronavirus. But that was pretty much the case from the beginning for the vast majority of the population that either was asymptomatic or had minor symptoms. This kind of advise should have been given from the beginning and it should have been just like this without employing the most absurd tactics to deal with the infection and subsequent disease. You meant any other coronavirus. But that was pretty much the case from the beginning for the vast majority of the population that either was asymptomatic or had minor symptoms. This kind of advise should have been given from the beginning and it should have been just like this without employing the most absurd tactics to deal with the infection and subsequent disease. \n\n\n\n\n\n\n\noriginally posted by: Oldcarpy2 \n\n a reply to: Asmodeus3 \n\n \n\n \"I see you immediately got a star in your post\". \n\n \n\n So what? \n\n \n\n You are engaging in vaccine apologetics, denialism of reality and defending of the pharmaceuticals when the reality is that Switzerland no longer recommends any type of vaccine for all age groups. They have apparently realised vaccines are not safe and effective and this is a safe, quite, and methodic way to pull them from the market. You are engaging in vaccine apologetics, denialism of reality and defending of the pharmaceuticals when the reality is that Switzerland no longer recommends any type of vaccine for all age groups. They have apparently realised vaccines are not safe and effective and this is a safe, quite, and methodic way to pull them from the market.", "opengraph": {"image": "https://files.abovetopsecret.com/images/ats15.jpg", "title": "Switzerland no longers recommends any Covid vaccines for all age groups , page 2", "description": "Switzerland no longers recommends any Covid vaccines for all age groups , page 2", "site_name": "AboveTopSecret.com"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "550", "height": "344", "embed_code": "<iframe width=\"550\" height=\"344\" src=\"https://www.youtube.com/embed/RJ44q_5uMM4?rel=0&amp;autoplay=0\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/RJ44q_5uMM4?rel=0&autoplay=0"}, {"embed_type": "iframe", "provider": "youtube", "width": "550", "height": "344", "embed_code": "<iframe width=\"550\" height=\"344\" src=\"https://www.youtube.com/embed/RJ44q_5uMM4?rel=0&amp;autoplay=0\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/RJ44q_5uMM4?rel=0&autoplay=0"}], "links": ["../mem/Asmodeus3", "../thread1329168/pg2#pid26961694", "../mem/Asmodeus3", "../thread1329168/pg2#pid26961706", "https://www.bag.admin.ch/bag/en/home/das-bag/aktuell/news/news-30-01-2023.html", "https://wlos.com/news/nation-world/switzerland-not-recommending-covid-vaccines-even-for-high-risk-individuals-during-spring-and-summer", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7359536/", "https://www.theglobaleconomy.com/rankings/covid_reproduction_rate/", "../mem/Oldcarpy2", "../thread1329168/pg2#pid26961714", "../mem/Dalamax", "../thread1329168/pg2#pid26961793", "../mem/Asmodeus3", "../thread1329168/pg2#pid26961825", "../mem/Asmodeus3", "../thread1329168/pg2#pid26961915", "../mem/Oldcarpy2", "../thread1329168/pg2#pid26961942", "../mem/Asmodeus3", "../thread1329168/pg2#pid26961948", "../mem/Oldcarpy2", "../thread1329168/pg2#pid26961951", "../mem/Asmodeus3", "../thread1329168/pg2#pid26961956", "../mem/xuenchen", "../thread1329168/pg2#pid26961969", "../mem/Asmodeus3", "../thread1329168/pg2#pid26961996", "../mem/Quintilian", "../thread1329168/pg2#pid26962162", "../mem/ironfistdragon", "../thread1329168/pg2#pid26962436", "../mem/Asmodeus3", "../thread1329168/pg2#pid26962478", "../mem/Asmodeus3", "../thread1329168/pg2#pid26962481", "../mem/Oldcarpy2", "../thread1329168/pg2#pid26962786", "../mem/Asmodeus3", "../thread1329168/pg2#pid26962798", "../mem/Oldcarpy2", "../thread1329168/pg2#pid26962799", "../mem/Itisnowagain", "../thread1329168/pg2#pid26962856"], "authors": [], "publish_date": null}