{"result_id": "006013", "URL": "https://www.abovetopsecret.com/forum/thread1328996/pg11", "timestamp": "2023-04-25 11:46:07 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.abovetopsecret.com/touch-icon-iphone.png", "canonical": "https://www.abovetopsecret.com/forum/thread1328996/pg11", "encoding": "utf-8"}, "image": null, "domain": "www.abovetopsecret.com", "title": "Husband of BBC presenter killed by the Covid vaccine is suing Astrazeneca , page 11", "cleaned_text": "originally posted by: Oldcarpy2 \n\n a reply to: Asmodeus3 \n\n \n\n \"A huge story unfolding in the UK despite the very little or no coverage in the mainstream media on the subject of vaccine injuries and deaths. According to reports online others will join the legal action launched against Astrazeneca and so far this concerns 75 people whose relatives died or suffered serious injuries from the vaccine.\" \n\n \n\n Apart from in the Daily Mail, the BBC and the Telegraph? \n\n \n\n Just three MSMs, from your own sources? \n\n \n\n 75 people, out of how many millions of doses? \n\n \n\n From your source: \n\n \n\n \"Its not about Covid, it's not about how many lives the Covid vaccination has saved, it's about what this vaccination has done to Lisa and other families,' he told the BBC. \" \n\n \n\n Quite agree. Good luck to them. They have good claims, rare, but good. \n\n \n\n \n\n Before you accuse me of the usual robotic response, just a bit of context and proportionality for you. \n\n \n\n Much needed, I'm afraid. \n\n \n\n \n\n \n\n Your \"proportionality\" is totally skewed. It's pretty easy to see how this is a fraction of actual such cases. Minimize and dismiss all you like. They explain how they are made to feel like they shouldn't say anything, which speaks to the untold amount of other people who aren't saying anything, OR the untold amount of people who died but haven't related it to the vaccine, because none of the information that would allow them to make the connection, is being shared. How many of those people who died from the vaccine, would have died if they hadn't gotten the vaccine. Few IF ANY! \n\n \n\n A logical person would say this needs more investigation, instead of desperately trying to make it look insignificant. Your \"proportionality\" is totally skewed. It's pretty easy to see how this is a fraction of actual such cases. Minimize and dismiss all you like. They explain how they are made to feel like they shouldn't say anything, which speaks to the untold amount of other people who aren't saying anything, OR the untold amount of people who died but haven't related it to the vaccine, because none of the information that would allow them to make the connection, is being shared. How many of those people who died from the vaccine, would have died if they hadn't gotten the vaccine. Few IF ANY!A logical person would say this needs more investigation, instead of desperately trying to make it look insignificant. \n\n\n\n\n\n\n\noriginally posted by: thebtheb \n\n \n\noriginally posted by: Oldcarpy2 \n\n a reply to: Asmodeus3 \n\n \n\n \"A huge story unfolding in the UK despite the very little or no coverage in the mainstream media on the subject of vaccine injuries and deaths. According to reports online others will join the legal action launched against Astrazeneca and so far this concerns 75 people whose relatives died or suffered serious injuries from the vaccine.\" \n\n \n\n Apart from in the Daily Mail, the BBC and the Telegraph? \n\n \n\n Just three MSMs, from your own sources? \n\n \n\n 75 people, out of how many millions of doses? \n\n \n\n From your source: \n\n \n\n \"Its not about Covid, it's not about how many lives the Covid vaccination has saved, it's about what this vaccination has done to Lisa and other families,' he told the BBC. \" \n\n \n\n Quite agree. Good luck to them. They have good claims, rare, but good. \n\n \n\n \n\n Before you accuse me of the usual robotic response, just a bit of context and proportionality for you. \n\n \n\n Much needed, I'm afraid. \n\n \n\n \n\n \n\n Your \"proportionality\" is totally skewed. It's pretty easy to see how this is a fraction of actual such cases. Minimize and dismiss all you like. They explain how they are made to feel like they shouldn't say anything, which speaks to the untold amount of other people who aren't saying anything, OR the untold amount of people who died but haven't related it to the vaccine, because none of the information that would allow them to make the connection, is being shared. How many of those people who died from the vaccine, would have died if they hadn't gotten the vaccine. Few IF ANY! \n\n \n\n A logical person would say this needs more investigation, instead of desperately trying to make it look insignificant. \n\n \n\n I have already mentioned the same and that the claim concerns 75 people who relatives have been injured of died due to the AZ vaccine. By no means this implies the only people who were killed and injured were actually 75. It's a desperate attempt to downplay the issue as if the summer is small. A handful of deaths is more than enough for a vaccine to be withdrawn. Many examples in the past. \n\n \n\n The AZ vaccine has failed, has been withdrawn from most countries that have used it including the UK where it was produced, it has killed and seriously injured many people, and there are legal proceedings against the Astrazeneca. \n\n \n\n The facts speak for themselves. \n\n \n\n The irony is that the poster you replied claimed he has fought for justice against those who have been injured or affected by medical negligence. I have already mentioned the same and that the claim concerns 75 people who relatives have been injured of died due to the AZ vaccine. By no means this implies the only people who were killed and injured were actually 75. It's a desperate attempt to downplay the issue as if the summer is small. A handful of deaths is more than enough for a vaccine to be withdrawn. Many examples in the past.The AZ vaccine has failed, has been withdrawn from most countries that have used it including the UK where it was produced, it has killed and seriously injured many people, and there are legal proceedings against the Astrazeneca.The facts speak for themselves.The irony is that the poster you replied claimed he has fought for justice against those who have been injured or affected by medical negligence. \n\n\n\n\n\n\n\n \n\n I still think you are getting very frustrated trying to argue the AZ vaccine was successful when in reality it has been withdrawn from most countries that have used it and has failed. On the top of this there are upcoming legal actions against Astrazeneca. a reply to: ScepticScot I still think you are getting very frustrated trying to argue the AZ vaccine was successful when in reality it has been withdrawn from most countries that have used it and has failed. On the top of this there are upcoming legal actions against Astrazeneca. \n\n\n\n\n\n\n\noriginally posted by: alldaylong \n\n a reply to: Asmodeus3 \n\n \n\n Do you realise that before anyone is given the vaccine, they have to sign a consent. It points out that there could be possible side efects. \n\n \n\n No one has a gun pointed at their head to make them sign. \n\n \n\n Lets get some reality here. \n\n \n\n No gun, just threats to lose your job while msm pundits and politicians were spreading propaganda that you should be excluded from all sorts of public activities. \n\n \n\n My 23 yr old niece died from a blood clot shortly after, so did a family friend who was 43. My 43 yr old sister was forced or she would lose her job at the school district and the doctors just found a huge blood clot in her leg. \n\n \n\n Maybe you need a reality check. No gun, just threats to lose your job while msm pundits and politicians were spreading propaganda that you should be excluded from all sorts of public activities.My 23 yr old niece died from a blood clot shortly after, so did a family friend who was 43. My 43 yr old sister was forced or she would lose her job at the school district and the doctors just found a huge blood clot in her leg.Maybe you need a reality check. \n\n\n\n\n\n\n\noriginally posted by: alldaylong \n\n a reply to: Asmodeus3 \n\n \n\n You do realise that any vaccine can cause serious side effects, including death. Covid Vaccine is no diferent. \n\n \n\n Maybe you should actually do reaserch. As for being dismissed for not having the vaccine, then :- \n\n \n\n \n\n \n\n \n\n Employers should support staff in getting the covid vaccine. There's currently no law in England, Scotland or Wales that says people must have the vaccine. There may be some people who are advised not to have the vaccine, for example for health reasons. \n\n \n\n \n\n www.acas.org.uk... \n\n \n\n Maybe you should do some research on how few deaths occur before other vaccines have been pulled, then look up the numbers for any of the COVID shots. Then ask yourself why much of it is covered up and people censored. Maybe you can at least be honest with yourself without admitting it here. Maybe you should do some research on how few deaths occur before other vaccines have been pulled, then look up the numbers for any of the COVID shots. Then ask yourself why much of it is covered up and people censored. Maybe you can at least be honest with yourself without admitting it here. \n\n\n\n\n\n\n\n \n\n If you believe the Covid vaccines have saved millions of lives then you are welcome to make a thread of yours giving some evidence rather than your own opinion and the propagation of official narratives. \n\n \n\n This is a thread about the deaths and serious injuries caused by the AZ vaccine and the upcoming legal proceedings against Astrazeneca. \n\n Perhaps you can go to the court and claim what you have said in these threads. \n\n \n\n But it looks like you haven't created any thread so far for as long as you have been on this platform. \n\n Well... \n\n \n\n edit on 14-4-2023 by Asmodeus3 because: (no reason given)\n\n a reply to: ScepticScot If you believe the Covid vaccines have saved millions of lives then you are welcome to make a thread of yours giving some evidence rather than your own opinion and the propagation of official narratives.This is a thread about the deaths and serious injuries caused by the AZ vaccine and the upcoming legal proceedings against Astrazeneca.Perhaps you can go to the court and claim what you have said in these threads.But it looks like you haven't created any thread so far for as long as you have been on this platform.Well...", "opengraph": {"image": "https://files.abovetopsecret.com/images/ats16.jpg", "title": "Husband of BBC presenter killed by the Covid vaccine is suing Astrazeneca , page 11", "description": "Husband of BBC presenter killed by the Covid vaccine is suing Astrazeneca , page 11", "site_name": "AboveTopSecret.com"}, "tags": [], "tweets": [], "movies": [], "links": ["../mem/Itisnowagain", "../thread1328996/pg11#pid26960310", "../mem/ScepticScot", "../thread1328996/pg11#pid26960317", "../mem/thebtheb", "../thread1328996/pg11#pid26960341", "../mem/Asmodeus3", "../thread1328996/pg11#pid26960356", "../mem/Asmodeus3", "../thread1328996/pg11#pid26960359", "../mem/Cymatic", "../thread1328996/pg11#pid26960645", "../mem/Cymatic", "../thread1328996/pg11#pid26960652", "https://www.acas.org.uk/working-safely-coronavirus/getting-the-coronavirus-vaccine-for-work", "../mem/Asmodeus3", "../thread1328996/pg11#pid26961292", "../mem/Asmodeus3", "../thread1328996/pg11#pid26961297", "../mem/ironfistdragon", "../thread1328996/pg11#pid26962438", "../mem/anonentity", "../thread1328996/pg11#pid26962447", "../mem/Asmodeus3", "../thread1328996/pg11#pid26962476", "https://www.gov.uk/vaccine-damage-payment", "../mem/chris_stibrany", "../thread1328996/pg11#pid26968067", "../mem/Asmodeus3", "../thread1328996/pg11#pid26971914"], "authors": [], "publish_date": null}