{"result_id": "006018", "URL": "https://www.abovetopsecret.com/forum/thread1328957/pg1", "timestamp": "2023-04-25 11:46:10 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.abovetopsecret.com/touch-icon-iphone.png", "canonical": "https://www.abovetopsecret.com/forum/thread1328957/pg1", "encoding": "utf-8"}, "image": null, "domain": "www.abovetopsecret.com", "title": "Banned in Switerland now, page 1", "cleaned_text": "Oh did you? As an expert on pandemics and public health? Why don't you fill me in on all the data that supports that from prior to 2020. Please pull up some of the documents that propose this method of pandemic management.You're as full of crap as the thread title. Talking like it's established science to vaccinate a population that's in the middle of a pandemic. The plebians just don't understand, you cry. But you, the seasoned expert, knew that the plebians wouldn't understand the complicated science you mastered. You have foretold this outcome, which is clear proof of your scientific acumen. You're thinking months ahead of all the poor stupid anti-vaxers, years even, to predict their ignorant reactions. Bravo.None of you that fell for the lies and felt the need to crusade against others ever understood the mathematics of pandemics nor the science. You knew exactly what pharma beneficiaries told you from 2020 on. I know this because my job included the maintenance and execution of these plans under federal contracts. None of the nonsense that you have all defended was ever part of pandemic planning prior to 2020 because science already told us those didn't work. Masking the healthy, social distancing, lockdowns, and leaky \"vaccines\", were never ever a part of the plans for a respiratory virus roughly as dangerous as a bad flu strain.I just ran into the accountant from my last health department at the grocery store for the first time since COVID hit. Even she knew all this. I know because she mentioned it to me when we were talking. She was our accountant and knows more than every single one of you that got your expertise from pharma PR. Self-righteous fans of The Science never had a clue. You believe all of the lies you've been told because they conveniently support a political agenda you've attached your beliefs to. In 15 minutes you could go look up some of the thousands of emergency planning documents that existed for public health prior to 2020, but why bother when you've already been fed your \"correct\" opinion from the same highly reliable sources that have already lied to you dozens of times in the past three years.", "opengraph": {"image": "https://files.abovetopsecret.com/images/ats9.jpg", "title": "Banned in Switerland now, page 1", "description": "Banned in Switerland now, page 1", "site_name": "AboveTopSecret.com"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "550", "height": "344", "embed_code": "<iframe width=\"550\" height=\"344\" src=\"https://www.youtube.com/embed/42q5QrwCJ9o?rel=0&amp;autoplay=0\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/42q5QrwCJ9o?rel=0&autoplay=0"}], "links": [], "authors": [], "publish_date": null}