{"result_id": "006022", "URL": "https://www.abovetopsecret.com/forum/thread1329168/pg1", "timestamp": "2023-04-25 11:46:11 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.abovetopsecret.com/touch-icon-iphone.png", "canonical": "https://www.abovetopsecret.com/forum/thread1329168/pg1", "encoding": "utf-8"}, "image": null, "domain": "www.abovetopsecret.com", "title": "Switzerland no longers recommends any Covid vaccines for all age groups , page 1", "cleaned_text": "This seems irrational, only if you don't understand the mathematics of pandemic growth.The mathematical parameter that determines the severity of an epidemic is the basic reproduction number, R. R is the average number of people that an infected person will infect. If R is exactly 1, then every infected person will infect exactly one other person, on the average. In that case, the epidemic will neither grow nor shrink. For every person that gets infected and adds to the population of infected, another person will either recover or die and subtract from the population of infected. If R is greater than one, the population of infected will grow larger over time and if R is less than one, the population of infected will shrink over time. One of the main factors that determines how big R is is the percentage of the population that has specific antibodies to the virus in question.3 years ago at this time, when the virus was just getting started, much less that 1% of the population had been infected and recovered or died. That means that practically everyone that an infected person would meet had no specific immunity to Covid and the probability of an infected person transmitting the virus to someone else would be very high. In the first half of 2020 in Northern Europe, R had an average value of about 4.22:That's why we saw very rapid growth of the case numbers at that time.In early 2021, when the vaccines were first introduced, only about 7% of the population in the US had developed natural immunity from having recovered from infection, so R was still a large positive number, which is why vaccination could make a lot of difference at that time. By the end of 2021, about 10 times as much of the population (75%) had gained some level of immunity from vaccination:Now fast forward to today. About 97% of the Swiss population has some level of immunity from either infection, vaccine, or both. The current best estimate of R for Switzerland is 0.38 and a year ago it was 1.38:In other words, a year ago the population of infected was still growing rapidly but now it is shrinking rapidly. Furthermore, there is not much more herd immunity to be gained in the population by either vaccination or infection.Specific individuals who might be immunocompromised due to cancer treatment, etc. might be at higher risk and want to continue vaccination, but that's on a case-by-case basis. In other words, Covid has gone from a public health issue to a private health issue.", "opengraph": {"image": "https://files.abovetopsecret.com/images/ats13.jpg", "title": "Switzerland no longers recommends any Covid vaccines for all age groups , page 1", "description": "Switzerland no longers recommends any Covid vaccines for all age groups , page 1", "site_name": "AboveTopSecret.com"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.bag.admin.ch/bag/en/home/das-bag/aktuell/news/news-30-01-2023.html", "https://wlos.com/news/nation-world/switzerland-not-recommending-covid-vaccines-even-for-high-risk-individuals-during-spring-and-summer", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7359536/", "https://www.theglobaleconomy.com/rankings/covid_reproduction_rate/"], "authors": [], "publish_date": null}