{"result_id": "006038", "URL": "https://www.abovetopsecret.com/forum/thread1326078/pg1", "timestamp": "2023-04-25 11:46:19 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.abovetopsecret.com/touch-icon-iphone.png", "canonical": "https://www.abovetopsecret.com/forum/thread1326078/pg1", "encoding": "utf-8"}, "image": null, "domain": "www.abovetopsecret.com", "title": "Mind boggling vaccine statistics: Risks from vaccination often outweighs benefits, page 1", "cleaned_text": "Independent report \n\n Appendix 1: estimation of number needed to vaccinate to prevent a COVID-19 hospitalisation for primary vaccination, booster vaccination (3rd dose), autumn 2022 and spring 2023 booster for those newly in a risk group \n\n Updated 27 January 2023\n\nJust take a look at the tables at the bottom for example. For those who are not in any risk group and at the age group 20-29 you need to vaccinate 706,500 people (Autumn 2022 booster) to prevent one severe hospitalisation due to Covid-19\n\nIf you are in the 50-59 age group you need to vaccinate around 256,400 people to prevent one severe hospitalisation (Autumn 2022 booster).\n\nin general you need thousands or even tens and hundreds of thousands of vaccinations to prevent one hospitalisation or severe hospitalisation in all age groups with or without risks. Just take a look at the tables\n\nedit on 10-2-2023 by Asmodeus3 because: (no reason given)\n\n\n\nHere is another crucial development in understanding the benefit to risk ratio of vaccination with the mRNA products in different age groups and the results are mind boggling as most people who are not at risk from Covid-19 benefit very little or not at all from these products and it seems that in many cases the risk of serious adverse reactions from the vaccine is higher than getting hospitalised due to Covid-19. The risk of serious adverse reactions is at least 1 in 800Here is the report from the official website of the UK Government www.gov.uk... -needed-to-vaccinate-to-prevent-a-covid-19-hospitalisation-for-primary-vaccination-booster-vaccination-3rd-dose-auLink doesn't seem to work but use the title provided aboveRemember that the risk of serious adverse reactions due to mRNA products is at least 1 in 800. (original trials by Pfizer and Moderna)Dr Malhotra agues that the anti-vaxxer term has been weaponized by vested interests to attack those who disagree with the mass vaccination campaign and the vaccine dogma. He has been doubled jabbed and has been arguing in favour of traditional vaccines.In the interview he also argues that traditional vaccines take years to go through trial and error and all safety checks. This isn't the case with the mRNA products for which the safety and effectiveness has not been established and on the contrary there are several health and safety issues associated with these products.Given the rate of severe adverse reactions and the several health issues that could be caused by these products, that gave not been seen with other vaccines in the past, Dr Malhotra argues that the Covid-19 vaccination program must be suspended and the products must be withdrawn from the market.Take a look at the interview.", "opengraph": {"image": "https://files.abovetopsecret.com/images/ats1.jpg", "title": "Mind boggling vaccine statistics: Risks from vaccination often outweighs benefits, page 1", "description": "Mind boggling vaccine statistics: Risks from vaccination often outweighs benefits, page 1", "site_name": "AboveTopSecret.com"}, "tags": [], "tweets": [], "movies": [], "links": ["https://twitter.com/DrAseemMalhotra", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9428332/", "https://www.gov.uk/government/publications/covid-19-vaccination-programme-for-2023-jcvi-interim-advice-8-november-2022/appendix-1-estimation-of-number"], "authors": [], "publish_date": null}