{"result_id": "006040", "URL": "https://www.abovetopsecret.com/forum/thread1329309/pg1", "timestamp": "2023-04-25 11:46:20 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.abovetopsecret.com/touch-icon-iphone.png", "canonical": "https://www.abovetopsecret.com/forum/thread1329309/pg1", "encoding": "utf-8"}, "image": null, "domain": "www.abovetopsecret.com", "title": "Covid 19 Shots Have Caused 45 Times More Deaths In 2 Years Than Flu Vaccines In 33 Years, page 1", "cleaned_text": "It's harder to discount the all this data however, when you start doing comparison of every major system around the world and they all match up.\n\nI find it interesting that once upon a time VAERs was considered to be a valid system of data collection for vaccine adverse effects. For years it was an imperfect system that was at times acceptable to use in clinical studies. While imperfect it could still provide a signal for when there was an issue with an existing or novel vaccine product, and this would show up on a line graph as a huge spikes denoting an unacceptable number of adverse effects. This statical signal actually came to pass but the result was to demonize the system, and ignore the data instead of taking action.Since then, every public data system that provided an unfavorable result was criticized and the data was deemed in accurate or not reliable. Instead of attempting to ever reconcile these issues, they were swept under the rug, but the system was left in place, unchanged. If one report was invalid, then all reports were invalid. And this doesn't even take into account the under reporting factor which many have calculated between 10-100 times what actually shows up. From all accounts it's harder to enter a record in VAERs than it is to submit a police report and carries the same penalties for forgery. Many doctors don't have the huge amount of time it takes to submit reports and many have also been discouraged in doing so. For anyone who has been paying attention and calculating the number of people who have died or have been injured from the Covid 19 shots, the number is astronomical and is larger than what Covid is alleged to have killed.For the detractors of VAER's there were 3 other key databases that were both released and leaked in the last few years, the DMED data, and the CDC V-safe data, and the Social Security records. These databases are seen to be far more accurate than VAER's and yet paint exactly the same picture. Once again, they are swept aside and logical fallacies are used to \"debunk\" their legitimacy. When you're not looking for something you won't find it, and if you do, you can just ignore it. This has been the playbook the whole time.", "opengraph": {"image": "https://files.abovetopsecret.com/images/ats11.jpg", "title": "Covid 19 Shots Have Caused 45 Times More Deaths In 2 Years Than Flu Vaccines In 33 Years, page 1", "description": "Covid 19 Shots Have Caused 45 Times More Deaths In 2 Years Than Flu Vaccines In 33 Years, page 1", "site_name": "AboveTopSecret.com"}, "tags": [], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/defender/deaths-covid-shots-versus-flu-vaccines-vaers-dmed/"], "authors": [], "publish_date": null}