{"result_id": "006044", "URL": "https://www.abovetopsecret.com/forum/thread1324819/pg1", "timestamp": "2023-04-25 11:46:22 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.abovetopsecret.com/touch-icon-iphone.png", "canonical": "https://www.abovetopsecret.com/forum/thread1324819/pg1", "encoding": "utf-8"}, "image": null, "domain": "www.abovetopsecret.com", "title": "40 year old man from Canada receives $124,000 in compensation after paralysed by Covid-19 vaccine, page 1", "cleaned_text": "bc.ctvnews.ca... \n\n \n\n \n\n\"I have basically no muscle or nerve movement or activity below my knees at this point,” he said. His hands also have nerve damage. \n\n \n\n “Both hands… they’re curled in,” he explained during an interview with CTV News. “That makes doing pretty much everything a challenge,” added the 40-year-old former pilot and realtor from Lake Country. \n\n \n\n “I’m constantly dropping things on the floor. Phones, cutlery, you name it, I drop it.” \n\n \n\n More than a year after becoming partially paralyzed following his COVID-19 vaccine, he has become one of the first in the country to be approved for compensation through the federal Vaccine Injury Support Program. \n\n \n\n “It’s vindicating. That’s kind of the first thought that came to mind,” he said. \n\n \n\n “I had full facial paralysis. I couldn’t smile, show my teeth or anything like that. I could barely close one of my eyes,” \n\n \n\n “I had no leg function. I was paralyzed from the waist down\" \n\n \n\n \n\n The 40 year old from Canada has received compensation for this injury which was caused by the Astrazeneca vaccine. He developed a neurological disorder called Guillain-Barre Syndrome after receiving the AstraZeneca vaccine back in April of 2021. \n\n \n\n The maximum compensation that could be awarded in vaccine injury cases is around $248,000 in Canada through the Vaccine Injury Support Program. In this case the amount is undisclosed but the victim himself said he was awarded something close to the middle so we can assume around $124,000 which in my opinion is a small amount given his ordeal and the injury by the Astrazeneca vaccine that has been withdrawn from most countries that have ever used it, including the the UK which is the country of origin of the AZ vaccine. \n\n \n\n \n\n \n\n His ordeal has been recorded in this video on YouTube and he explains how this debilitating condition has changed his life. \n\n \n\n youtu.be... \n\n \n\n \n\n He is one of the first to receive a compensation in relation to a vaccine injury and it is quite obvious that the ludicrous Canadian Government together with their cronies have made it very difficult even to recognise and accept injuries can be caused by the vaccines, let alone awarding compensation for those vaccine induced injuries. \n\n \n\n \n\n I have made another thread with a case where a Canadian women died shortly after receiving her booster . \n\n \n\n www.abovetopsecret.com... \n\n \n\n The verdict from the coroner was that she died from 'natural causes' which are 'unspecified' and 'unexplained' prompting an outrage from family, citizens and poliricians given that the circumstances point it was the vaccine that caused the death. \n\n edit on 16-1-2023 by Asmodeus3 because: (no reason given)\n\n The 40 year old from Canada has received compensation for this injury which was caused by the Astrazeneca vaccine. He developed a neurological disorder called Guillain-Barre Syndrome after receiving the AstraZeneca vaccine back in April of 2021.The maximum compensation that could be awarded in vaccine injury cases is around $248,000 in Canada through the Vaccine Injury Support Program. In this case the amount is undisclosed but the victim himself said he was awarded something close to the middle so we can assume around $124,000 which in my opinion is a small amount given his ordeal and the injury by the Astrazeneca vaccine that has been withdrawn from most countries that have ever used it, including the the UK which is the country of origin of the AZ vaccine.His ordeal has been recorded in this video on YouTube and he explains how this debilitating condition has changed his life.He is one of the first to receive a compensation in relation to a vaccine injury and it is quite obvious that the ludicrous Canadian Government together with their cronies have made it very difficult even to recognise and accept injuries can be caused by the vaccines, let alone awarding compensation for those vaccine induced injuries.I have made another thread with a case where a Canadian women died shortly after receiving her booster .The verdict from the coroner was that she died from 'natural causes' which are 'unspecified' and 'unexplained' prompting an outrage from family, citizens and poliricians given that the circumstances point it was the vaccine that caused the death. \n\n\n\n\n\n\n\n \n\n I have lurked here for a long time, many years but your post today (as well as some others' previous posts about this topic) have prompted me to make an account. \n\n \n\n I have to say I frequent other forum type websites and every single time an Astra Zeneca vaccine injury is reported on, it is always met with derision by the pro-vaccine crowd. They always say that everyone knows the Astra Zeneca vaccine is not as safe as Pfizer or Moderna and that is why it wasn't approved in the US and why in other countries it is only approved for age 65+. So I feel that the free reporting of Astra Zeneca and to a lesser extent Janssen vaccine injuries is just a set up for those who are pro-vaccine to comment about how safe the Pfizer and Moderna are in comparison, like an advertisement for Pfizer and Moderna. Maybe I'm just paranoid though.\n\n edit on 16-1-2023 by Antimony because: (no reason given)\n\n a reply to: Asmodeus3 I have lurked here for a long time, many years but your post today (as well as some others' previous posts about this topic) have prompted me to make an account.I have to say I frequent other forum type websites and every single time an Astra Zeneca vaccine injury is reported on, it is always met with derision by the pro-vaccine crowd. They always say that everyone knows the Astra Zeneca vaccine is not as safe as Pfizer or Moderna and that is why it wasn't approved in the US and why in other countries it is only approved for age 65+. So I feel that the free reporting of Astra Zeneca and to a lesser extent Janssen vaccine injuries is just a set up for those who are pro-vaccine to comment about how safe the Pfizer and Moderna are in comparison, like an advertisement for Pfizer and Moderna. Maybe I'm just paranoid though. \n\n\n\n\n\nI believe that there will be a revelation soon that the vaccine, through no fault of the pharmaceutical companies or the government, came with unintended consequences that are severe and long lasting. They have done irreparable harm to people but now we are stuck. We must continue to take them until we find a safe way to safely come off the vaccination. \n\n \n\n This will explain the deaths and continue the process. Our supply lines will be cut and our rights will be crippled. \n\n\n\n\n\n\n\n \n\n I'm American and I always hear about how great Canada's health care is. I hear that it is free and world class health care. Way better than America's. And I always read that sure there are long waits sometimes but that is only because the problem isn't too serious. This guy's story is awful. Not only was it months waiting, he couldn't even work because of his symptoms but also it wasn't even free! He had to get a loan from his dad in order to even pay and get a doctor's appointment to begin with. What a system! Guess it's not actually \"free universal health care\". a reply to: fernalley I'm American and I always hear about how great Canada's health care is. I hear that it is free and world class health care. Way better than America's. And I always read that sure there are long waits sometimes but that is only because the problem isn't too serious. This guy's story is awful. Not only was it months waiting, he couldn't even work because of his symptoms but also it wasn't even free! He had to get a loan from his dad in order to even pay and get a doctor's appointment to begin with. What a system! Guess it's not actually \"free universal health care\". \n\n\n\n\n\n\n\noriginally posted by: Antimony \n\n a reply to: Asmodeus3 \n\n \n\n I have lurked here for a long time, many years but your post today (as well as some others' previous posts about this topic) have prompted me to make an account. \n\n \n\n I have to say I frequent other forum type websites and every single time an Astra Zeneca vaccine injury is reported on, it is always met with derision by the pro-vaccine crowd. They always say that everyone knows the Astra Zeneca vaccine is not as safe as Pfizer or Moderna and that is why it wasn't approved in the US and why in other countries it is only approved for age 65+. So I feel that the free reporting of Astra Zeneca and to a lesser extent Janssen vaccine injuries is just a set up for those who are pro-vaccine to comment about how safe the Pfizer and Moderna are in comparison, like an advertisement for Pfizer and Moderna. Maybe I'm just paranoid though. \n\n \n\n Hi, thanks for the reply and welcome to the site. I am new myself and have been here for a little over three months. However I have created a range of threads with actual cases of people who have been injured or died by the Covid-19 vaccines of all types and have been verified by coroners and medical examiners. \n\n \n\n From all the information around its seems that the Astrazeneca and J&J vaccines are benign in comparison to the mRNA products and given the recorded and suspected cases of injuries from these products the pro-vaccination crowd or commonly known as vaccine apologists have no arguments in favour of either of them. \n\n \n\n If you take a look at my threads through the posting history you will find all the cases covered so far in which Pfizer and Moderna have a special place. I have even created a thread with title: \n\n Pfizer: Six scandals to remember. \n\n \n\n There are numerous of actual and suspected vaccine injuries online caused or allegedly caused by the mRNA products, with cases ranging from myocarditis, pericarditis, myopericarditis, heart failure, heart attacks, blood clots, autoimmune disorders, allergic reactions, strokes, etc. \n\n \n\n If you take a look there are several threads on the pathogenesis of the mRNA 'vaccines' and a major factor as one might suspect is free spike protein that can travel everywhere in the body and affect a range of organs. \n\n \n\n If anything the vaccine apologists are not keen in recognising that the Astrazeneca and J&,J vaccines have been quitely but methodically been withdrawn from most countries that have used them. Especially in the case of the AstraZeneca vaccine, the UK which is the country of origin of the vaccine is no longer using it. Most other countries have dropped the roll out. So not safe and effective. \n\n \n\n Next in line are the mRNA products which have caused and are still causing a range of debilitating conditions and deaths. Hi, thanks for the reply and welcome to the site. I am new myself and have been here for a little over three months. However I have created a range of threads with actual cases of people who have been injured or died by the Covid-19 vaccines of all types and have been verified by coroners and medical examiners.From all the information around its seems that the Astrazeneca and J&J vaccines are benign in comparison to the mRNA products and given the recorded and suspected cases of injuries from these products the pro-vaccination crowd or commonly known as vaccine apologists have no arguments in favour of either of them.If you take a look at my threads through the posting history you will find all the cases covered so far in which Pfizer and Moderna have a special place. I have even created a thread with title:Pfizer: Six scandals to remember.There are numerous of actual and suspected vaccine injuries online caused or allegedly caused by the mRNA products, with cases ranging from myocarditis, pericarditis, myopericarditis, heart failure, heart attacks, blood clots, autoimmune disorders, allergic reactions, strokes, etc.If you take a look there are several threads on the pathogenesis of the mRNA 'vaccines' and a major factor as one might suspect is free spike protein that can travel everywhere in the body and affect a range of organs.If anything the vaccine apologists are not keen in recognising that the Astrazeneca and J&,J vaccines have been quitely but methodically been withdrawn from most countries that have used them. Especially in the case of the AstraZeneca vaccine, the UK which is the country of origin of the vaccine is no longer using it. Most other countries have dropped the roll out. So not safe and effective.Next in line are the mRNA products which have caused and are still causing a range of debilitating conditions and deaths. \n\n\n\n\n\n\n\noriginally posted by: v1rtu0s0 \n\n 120k seems pretty low for being paralyzed. Need to add a few more zeros and stop the vaccines. \n\n \n\n The maximum amount awarded in Canada seems to be $248,000 and this in Canadian dollars. The amount he was awarded was as he said somewhere in the middle so let's say $124,000. It's obviously undisclosed but this is obviously very low. \n\n \n\n According to today's exchange rate 1 Canadian dollar = 0.75 US dollars \n\n \n\n So it's around $93,000 US dollars. Very low amount which has come out of the compensation scheme in Canada. I think all those who have been injured must take the Pharmaceuticals in court and ask for millions in compensation. I am sure it will have the support of a lot of citizens, lawyers, doctors, and politicians. The maximum amount awarded in Canada seems to be $248,000 and this in Canadian dollars. The amount he was awarded was as he said somewhere in the middle so let's say $124,000. It's obviously undisclosed but this is obviously very low.According to today's exchange rate 1 Canadian dollar = 0.75 US dollarsSo it's around $93,000 US dollars. Very low amount which has come out of the compensation scheme in Canada. I think all those who have been injured must take the Pharmaceuticals in court and ask for millions in compensation. I am sure it will have the support of a lot of citizens, lawyers, doctors, and politicians.", "opengraph": {"image": "https://files.abovetopsecret.com/images/ats1.jpg", "title": "40 year old man from Canada receives $124,000 in compensation after paralysed by Covid-19 vaccine, page 1", "description": "40 year old man from Canada receives $124,000 in compensation after paralysed by Covid-19 vaccine, page 1", "site_name": "AboveTopSecret.com"}, "tags": [], "tweets": [], "movies": [], "links": ["../mem/Asmodeus3", "../thread1324819/pg1#pid26848799", "https://bc.ctvnews.ca/it-s-vindicating-b-c-man-to-receive-compensation-for-covid-19-vaccine-injury-1.5928990", "https://youtu.be/DBnTtaWado8", "https://www.abovetopsecret.com/forum/thread1324193/pg1", "../mem/Antimony", "../thread1324819/pg1#pid26848809", "../mem/fernalley", "../thread1324819/pg1#pid26848816", "https://www.cbc.ca/news/canada/ottawa/covid-vaccine-moderna-side-effect-government-help-1.6294908", "../mem/fernalley", "../thread1324819/pg1#pid26848822", "../mem/iwanttobelieve70", "../thread1324819/pg1#pid26848841", "../mem/Antimony", "../thread1324819/pg1#pid26848847", "../mem/Notabot12345666", "../thread1324819/pg1#pid26848855", "../mem/DAVID64", "../thread1324819/pg1#pid26848866", "../mem/Antimony", "../thread1324819/pg1#pid26848868", "../mem/Asmodeus3", "../thread1324819/pg1#pid26848875", "../mem/Asmodeus3", "../thread1324819/pg1#pid26848877", "../mem/Notabot12345666", "../thread1324819/pg1#pid26848899", "../mem/Asmodeus3", "../thread1324819/pg1#pid26848916", "../mem/drongosrevenge", "../thread1324819/pg1#pid26848925", "../mem/v1rtu0s0", "../thread1324819/pg1#pid26848940", "../mem/Asmodeus3", "../thread1324819/pg1#pid26848962", "../mem/Lysergic", "../thread1324819/pg1#pid26848977", "../mem/Asmodeus3", "../thread1324819/pg1#pid26849088", "../mem/Asmodeus3", "../thread1324819/pg1#pid26849116", "https://www.abovetopsecret.com/forum/thread1321098/pg1", "../mem/Irishhaf", "../thread1324819/pg1#pid26849125"], "authors": [], "publish_date": null}