{"result_id": "006020", "URL": "https://www.abovetopsecret.com/forum/thread1323537/pg1", "timestamp": "2023-04-25 11:46:10 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.abovetopsecret.com/touch-icon-iphone.png", "canonical": "https://www.abovetopsecret.com/forum/thread1323537/pg1", "encoding": "utf-8"}, "image": null, "domain": "www.abovetopsecret.com", "title": "Family take legal action after son dies following Covid vaccine, page 1", "cleaned_text": "www.fbcmb.co.uk... \n\n \n\n 18 May 2022 \n\n \n\n A 26-year-old Midlands man who was given the Astra Zeneca Covid vaccine died less than two weeks later after developing blood clots on the brain. \n\n \n\n \n\n \n\nAutomotive design graduate Jack Hurn received the first dose of the jab on May 29 2021 after he and his girlfriend were told there was none of the alternative Pfizer vaccine available at the Dudley vaccine centre. \n\n \n\n Jack, who was originally from Devon but was living in Redditch, began suffering headaches within days and died on June 11 at Birmingham’s Queen Elizabeth Hospital after doctors described him as having “catastrophic” blood clots on the brain. \n\n \n\n Jack’s devastated family have instructed clinical negligence specialists at Midlands law firm FBC Manby Bowdler, after raising concerns about advice given at the vaccine clinic and the standard of care received in hospital once Jack fell ill. \n\n \n\n \n\n An inquest was held at the end of May \n\n \n\n www.standard.co.uk... \n\n \n\n \n\nBirmingham area coroner Emma Brown ruled that Jack Hurn’s death was caused by a rare complication of the AstraZeneca vaccine \n\n \n\n A week-long inquest at Birmingham Coroner’s Court was told a GP informed Mr Hurn the risk of blood clots on the brain for his age group was one in 250,000, when the latest NHS guidance estimated it to be one in 50,000. \n\n \n\n The inquest heard the Coventry University automotive design graduate opted to go ahead with his first dose of the AstraZeneca vaccine on May 29 2021, after being told the Revival Fires vaccination hub in Dudley had no stock of the Pfizer jab. \n\n \n\n \n\n Another very sad story about a young person aged 26 who died as a result of the Astrazeneca vaccine after developing blood clots in his brain. \n\n \n\n According to the advice at that time those under the age of 30 should avoid the Astrazeneca vaccine and instead opt for the other ones such as Pfizer's or Moderna's vaccines. \n\n \n\n They admit directly that the Astrazeneca vaccine is potentially dangerous for young and healthy people and that's why the vaccine is no longer used in the UK. Instead the advice is to get vaccinated with the Pfizer or Moderna vaccines as they are 'safe and effective'. This is where the irony meter breaks... \n\n \n\n In a few words the argument here which is presented in the press, and there are numerous papers that have covered the story, is that the young person died as a result of out-of-date advice. They didn't have anymore of the safe and effective Pfizer vaccine and they had to go with that Astrazeneca one. 18 May 2022An inquest was held at the end of MayAnother very sad story about a young person aged 26 who died as a result of the Astrazeneca vaccine after developing blood clots in his brain.According to the advice at that time those under the age of 30 should avoid the Astrazeneca vaccine and instead opt for the other ones such as Pfizer's or Moderna's vaccines.They admit directly that the Astrazeneca vaccine is potentially dangerous for young and healthy people and that's why the vaccine is no longer used in the UK. Instead the advice is to get vaccinated with the Pfizer or Moderna vaccines as they are 'safe and effective'. This is where the irony meter breaks...In a few words the argument here which is presented in the press, and there are numerous papers that have covered the story, is that the young person died as a result of out-of-date advice. They didn't have anymore of the safe and effective Pfizer vaccine and they had to go with that Astrazeneca one. \n\n\n\n\n\n\n\n edit on q000000401231America/Chicago3939America/Chicago12 by quintessentone because: (no reason given)\n\n So AstraZeneca and Johnson and Johnson's vaccines are not mRNA and AstraZeneca's adverse effects have been widely published and warnings have been put out to the public. I am sorry this family suffered such a tragic event but why did they choose AstraZeneca? My country suspended AstraZeneca use in March 2021 due to problems with this vax, that poor man opted for his first vax in May 2021. EDIT: Oh that was the only type of vax left, but he still could have said \"no\". \n\n\n\n\n\n\n\noriginally posted by: Oldcarpy2 \n\n a reply to: butcherguy \n\n \n\n No, it is \"rare\", not normal. \n\n \n\n From the OPs quote: \n\n \n\n \"Birmingham area coroner Emma Brown ruled that Jack Hurn’s death was caused by a rare complication of the AstraZeneca vaccine\". \n\n \n\n This is the narrative you are referring to. Everything seems to be 'rare' and 'unusual'. But it looks like it isn't so rare given the cases of vaccine injuries and deaths. If it was so rare then the Astrazeneca vaccine would not have been pulled out of the market. \n\n \n\n It's time now to withdraw all other vaccines from the market just as Dr Malhotra said who is also from the UK. Actually he argued that the vaccination campaign must be paused given that the risks may outweigh the benefits of vaccination. \n\n edit on 21-12-2022 by Asmodeus3 because: (no reason given)\n\n This is the narrative you are referring to. Everything seems to be 'rare' and 'unusual'. But it looks like it isn't so rare given the cases of vaccine injuries and deaths. If it was so rare then the Astrazeneca vaccine would not have been pulled out of the market.It's time now to withdraw all other vaccines from the market just as Dr Malhotra said who is also from the UK. Actually he argued that the vaccination campaign must be paused given that the risks may outweigh the benefits of vaccination. \n\n\n\n\n\n\n\noriginally posted by: quintessentone \n\n If the warnings about a vaccine are out there in the public realm and countries are discontinuing it's use, when does it become an individual's responsibility to inform themselves? \n\n \n\n I don't think most of those who went to get vaccinated knew the risk to benefit ratio for all age groups and the side effects of each vaccine. Many of them were coerced, pressured, intimidated, and threaten with dismissal by their employers. \n\n \n\n There is no informed consent in this case. \n\n \n\n The campaign will do down in history as the greatest medical scandal. \n\n \n\n Personally, I followed common sense and the basics in immunology. Having been infected and developed superior natural immunity early on the pandemic, I didn't even care about going to get vaccinated. It's irrational to get vaccinated after being infected. You will get an F in Biology if you write a test arguing this. I don't think most of those who went to get vaccinated knew the risk to benefit ratio for all age groups and the side effects of each vaccine. Many of them were coerced, pressured, intimidated, and threaten with dismissal by their employers.There is no informed consent in this case.The campaign will do down in history as the greatest medical scandal.Personally, I followed common sense and the basics in immunology. Having been infected and developed superior natural immunity early on the pandemic, I didn't even care about going to get vaccinated. It's irrational to get vaccinated after being infected. You will get an F in Biology if you write a test arguing this.", "opengraph": {"image": "https://files.abovetopsecret.com/images/ats12.jpg", "title": "Family take legal action after son dies following Covid vaccine, page 1", "description": "Family take legal action after son dies following Covid vaccine, page 1", "site_name": "AboveTopSecret.com"}, "tags": [], "tweets": [], "movies": [], "links": ["../mem/Asmodeus3", "../thread1323537/pg1#pid26817515", "https://www.fbcmb.co.uk/media-hub-area/family-take-legal-action-after-son-dies-following-covid-vaccine/", "https://www.standard.co.uk/news/uk/jack-hurn-graduate-died-covid-jab-astrazeneca-out-of-date-advice-vaccine-hub-b1002892.html?amp", "../mem/TzarChasm", "../thread1323537/pg1#pid26817538", "../mem/quintessentone", "../thread1323537/pg1#pid26817542", "../mem/ColeYounger", "../thread1323537/pg1#pid26817543", "https://www.cnbc.com/2021/08/12/blood-clots-linked-to-astrazeneca-shot-have-22percent-mortality-rate-study.html", "../mem/butcherguy", "../thread1323537/pg1#pid26817545", "../mem/Asmodeus3", "../thread1323537/pg1#pid26817546", "../mem/quintessentone", "../thread1323537/pg1#pid26817552", "../mem/Asmodeus3", "../thread1323537/pg1#pid26817583", "../mem/HUBE007", "../thread1323537/pg1#pid26817584", "https://www.fbcmb.co.uk/media-hub-area/family-take-legal-action-after-son-dies-following-covid-vaccine/", "../mem/v1rtu0s0", "../thread1323537/pg1#pid26817597", "../mem/Asmodeus3", "../thread1323537/pg1#pid26817603", "../mem/Oldcarpy2", "../thread1323537/pg1#pid26817608", "../mem/Asmodeus3", "../thread1323537/pg1#pid26817617", "../mem/Oldcarpy2", "../thread1323537/pg1#pid26817621", "https://www.bmj.com/content/379/bmj.o2592", "../mem/Asmodeus3", "../thread1323537/pg1#pid26817625", "../mem/Asmodeus3", "../thread1323537/pg1#pid26817626", "https://www.bmj.com/content/379/bmj.o2592", "../mem/Oldcarpy2", "../thread1323537/pg1#pid26817645", "../mem/Asmodeus3", "../thread1323537/pg1#pid26817653", "../mem/Asmodeus3", "../thread1323537/pg1#pid26817709", "https://www.theguardian.com/uk-news/2022/aug/16/no-plans-for-uk-to-order-more-supplies-of-astrazeneca-covid-vaccine", "https://www.bbc.com/news/world-europe-56744474", "../mem/quintessentone", "../thread1323537/pg1#pid26817716"], "authors": [], "publish_date": null}