{"result_id": "006014", "URL": "https://www.abovetopsecret.com/forum/thread1329084/pg1", "timestamp": "2023-04-25 11:46:07 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.abovetopsecret.com/touch-icon-iphone.png", "canonical": "https://www.abovetopsecret.com/forum/thread1329084/pg1", "encoding": "utf-8"}, "image": null, "domain": "www.abovetopsecret.com", "title": "CDC Partners With 'Social And Behavior Change' Initiative To Silence Vaccine Hesitancy, page 1", "cleaned_text": "edit on 4/13/2023 by Maxmars because: formatting\n\n\n\nThis time, as we watch the initiative unfold, we can see exactly which tools are selected to 'convince' the citizens that there is no need to 'hesitate' to be vaccinated. We'll see which contracted 'service' becomes the clarion call to continue to support the last pharmaceutical company's 'venture into commerce.'I recall this story at the time... with every talking head commentator relaying the characterization provided by the institution. They ate it up, and delivered it en masse every time the subject was spoken of. Of course, and not to diminish the grief it caused Dr. Bowden, her story is not hers alone... dozens... hundreds... maybe even more, suffered the same fate, some even more, some less.A very angry pharmacist who also happened to be a prolific YouTube poster became very cross with her, after being confronted about refusing to dispense ivermectin, she apparently made a video about it, ... and it led toWell... that is bad. Of course, this is all organic right? I mean this happens to just everybody from time to time, right? Or is this something darker... is this some kind of 'retaliation' for not toeing the line? It could never be that, right?One of the connections in the YouTube wildfire was a nurse practitioner, who posted that Dr. Bowden, as an ENT shouldn't be treating COVID, and should have her license to practice medicine removed.But interestingly, that nurse practitioner is a member of a curious organization...This group \"Shots Herd\" is an initiative under The Public Good Projects (PGP), a “public health nonprofit specializing in large-scale media monitoring programs, social and behavior change interventions, and cross-sector initiatives.”Something you should know about PGP... one of their \"initiatives' is the Public Health Communications Collaborative (PHCC), which sits within the CDC Foundation—a nonprofit arm of the Centers for Disease Control and Prevention (CDC) established by Congress.Having laid all that out... you must see how this \"initiative works\" ...Even the PGP CEO fits into the mold of 'cabal driven' executor... (just my opinion)When they engage in \"DEBUNKING\"Excuse me... isn't that pretty much NOT debunking? Debunking is supposed to be removing the \"bunk\" not just replacing it with your own 'bunk.'I think we may have found exactly what's wrong with allowing your public servants to be beholden to another interest.In the end these people destroyed lives... to promote a specific experimental vaccine... and they are willing to pay 'consultants' to do something, under the color of law, that doesn't seem very lawful to me.If you read it, you'll see.", "opengraph": {"image": "https://files.abovetopsecret.com/images/ats8.jpg", "title": "CDC Partners With 'Social And Behavior Change' Initiative To Silence Vaccine Hesitancy, page 1", "description": "CDC Partners With 'Social And Behavior Change' Initiative To Silence Vaccine Hesitancy, page 1", "site_name": "AboveTopSecret.com"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/cdc-partners-with-social-and-behavior-change-initiative-to-silence-vaccine-hesitancy_5175172.html"], "authors": [], "publish_date": null}