{"result_id": "006032", "URL": "https://www.abovetopsecret.com/forum/thread1326448/pg1", "timestamp": "2023-04-25 11:46:16 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.abovetopsecret.com/touch-icon-iphone.png", "canonical": "https://www.abovetopsecret.com/forum/thread1326448/pg1", "encoding": "utf-8"}, "image": null, "domain": "www.abovetopsecret.com", "title": "John Campbell - Pieces Of Destroyed Brain Tissue - Analysis Of Vaccine Victim Autopsy Case Report, page 1", "cleaned_text": "No, the conclusion that spike protein was found at the sites of lesions and inflammatory responses and that the spike proteins came from vaccination, not infection, is clear:Here's a pointer to the actual article, in case anyone wants to read it:\"Immunohistochemistry for SARS-CoV-2 antigens (spike protein and nucleocapsid) revealed that the lesions with necrotizing encephalitis as well as the acute inflammatory changes in the small blood vessels (brain and heart) were associated with abundant deposits of the spike protein SARS-CoV-2 subunit 1. Since the nucleocapsid protein of SARS-CoV-2 was consistently absent, it must be assumed that the presence of spike protein in affected tissues was not due to an infection with SARS-CoV-2 but rather to the transfection of the tissues by the gene-based COVID-19-vaccines. Importantly, spike protein could be only demonstrated in the areas with acute inflammatory reactions (brain, heart, and small blood vessels), in particular in endothelial cells, microglia, and astrocytes. This is strongly suggestive that the spike protein may have played at least a contributing role to the development of the lesions and the course of the disease in this patient.\"Interestingly, the author goes on to state:\"In the case reported here, it may be noted that the spike protein was primarily detected in the vascular endothelium and sparsely in the glial cells but not in the neurons. Nevertheless, neuronal cell death was widespread in the encephalitic foci, which suggests some contribution of immunological bystander activation, i.e., autoimmunity, to the observed cell and tissue damage.\"It has seemed to me for some time that the acute myocarditis that is sometimes observed in people vaccinated with the mRNA vaccines is essentially an autoimmune reaction. Some people seem to be predisposed to develop autoimmune reactions and some aren't. Those who are predisposed can develop strong reactions to any vaccine or any virus infection. Anything that stimulates the immune system to become active can be the trigger for the immune system to mistakenly attack healthy tissue. This guy could have been one of those.In any case, and for this guy with pre-existing brain damage from Parkinson's, the spike protein seems to have pushed him over the edge He probably would have died if he had gotten Covid-19 also, since both the infection and the vaccines produce equivalent amounts of spike protein.", "opengraph": {"image": "https://files.abovetopsecret.com/images/ats7.jpg", "title": "John Campbell - Pieces Of Destroyed Brain Tissue - Analysis Of Vaccine Victim Autopsy Case Report, page 1", "description": "John Campbell - Pieces Of Destroyed Brain Tissue - Analysis Of Vaccine Victim Autopsy Case Report, page 1", "site_name": "AboveTopSecret.com"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9611676/"], "authors": [], "publish_date": null}