{"result_id": "008038", "URL": "https://latitudes.org/forums/topic/1571-thimerosal-free-vaccines/", "timestamp": "2023-04-25 11:46:52 CEST+0200", "meta": {"description": "All Its really LONG since I posted.... things got hectic but still I have always made it a point to scan through all the posts in this forum. Really grateful to the members of this forum. Chemar especially has been of great help to all of us. The knowledge that I have gained from this forum is am...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://latitudes.org/forums/topic/1571-thimerosal-free-vaccines/", "encoding": "utf-8"}, "image": null, "domain": "latitudes.org", "title": "thimerosal free vaccines", "cleaned_text": "Its really LONG since I posted.... things got hectic but still I have always made it a point to scan through all the posts in this forum.\n\nReally grateful to the members of this forum. Chemar especially has been of great help to all of us. The knowledge that I have gained from this forum is amazing.\n\nWell, the good news is that my son's tics are practically gone.. He has been tic free in spite of TV, milk, cheese, chocolates, Pizza etc for around a year now..\n\nHis DT vaccination was due last year.. Was postponing it for more than a year.. But then decided to go ahead with a thimerosal free combo (DT-Polio since the DT alone had thimerosal and my doctor suggested the additional polio is harmless). The details of the vaccination are as follows.\n\nAvailable from October 2004, for children aged 14-15 years and adults when travelling.\n\nUndesirable effects (as reported by Dept of Health and Aventis Pasteur®):\n\nGuillain-Barré syndrome has been reported after vaccination containing tetanus toxoid\n\nSide effects of the vaccine include adverse reactions to all components\n\nNow, my doubt is - Is there any tic aggravating ingredient in the above list??? After being tic-free for more than a year, just in a week's time after the above vaccination, I notice some very mild but constant eye twitches resurfacing.. Your thoughts would be appreciated.\n\nIs there any other ingredient OTHER THAN THIMEROSAL in the above vaccine that can induce tics?", "opengraph": {"title": "thimerosal free vaccines", "type": "website", "url": "https://latitudes.org/forums/topic/1571-thimerosal-free-vaccines/", "description": "All Its really LONG since I posted.... things got hectic but still I have always made it a point to scan through all the posts in this forum. Really grateful to the members of this forum. Chemar especially has been of great help to all of us. The knowledge that I have gained from this forum is am...", "updated_time": "2006-03-28T11:21:00Z", "site_name": "ACN Latitudes Forums", "locale": "en_US"}, "tags": ["Report", "Posted March 21, 2006", "Share", "Posted March 27, 2006", "Posted March 17, 2006", "Posted March 28, 2006", "Posted March 18, 2006"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "March 17, 2006"}