{"result_id": "008048", "URL": "https://latitudes.org/forums/topic/5271-igg-subclasses-and-pneumococcal-titers/", "timestamp": "2023-04-25 11:46:58 CEST+0200", "meta": {"description": "My suspected 15-year-old PANDAS son has his IGG and other immune functions tested. His IGG was found to be slightly lower than a reference range. More problematic were pneumococcal titer results. 12 out of 14 serotypes for the son's pneumococcal titers were almost zero, meaning, according to the ...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://latitudes.org/forums/topic/5271-igg-subclasses-and-pneumococcal-titers/", "encoding": "utf-8"}, "image": null, "domain": "latitudes.org", "title": "IGG subclasses and pneumococcal titers", "cleaned_text": "I may be wrong but I believe my daughter was the first one on this forum to fail the titers test and receive a dx of a Primary Immune Deficiency Disease and therefore start receiving the monthly IVIG. She also failed 12 of the 14. I think there are a couple of other kids who failed before her but their immuno doctors were unconcerned about the results. As far as this being fairly common with Pandas kid I think it is too soon to say. We are discovering that more and more of them seem to have some underlying immune issue. I believe the count is now up to somewhere around 15 who have the blood work done and who have failed.\n\nIt is very confusing to try and wrap your head around the different concepts. The low IgG levels means your child makes antibodies but not enough. The failed pneumococcal titers test means that your child's immune system does not use the antibodies that he is making and then the Pandas side of it means that the antibodies he does make are attacking his brain. Our all his immune system is just messed up.\n\nThe medical community will tell you that the streptococcus pneumonae and strep A are different strains and therefore the results of the Pneumococcal titers test really aren't conclusive as to how your child will respond to strep A. Obviously, what you do know is that your child's body is not fighting infection properly-whether it be strep A or another infection. I personally say baloney to the part that they are not in anyway the germ.\n\nYour child may have received a dx of a Specific Antibody Deficiency (SAD) or Common Variable Immune Deficieny (CVID). Both of these fall under the spectrum of Primary Immune Deficiency Diseases (PIDD). There are approx. 150 different PIDD's. The good news is that a dx of SAD is one of the lease invasive of the PIDD's. The other good news is that it is a recognized disease for insurance purposes and that IVIG is the standard treatment plan. The bad news is that IVIG may be required for life. Since your child is 15-his immune system has already stopped \"growing\" Average age for a mature immune system is around 5.\n\nIt is common practice for Immunologist's to revaccinate with the Pneumovax vaccine and then retest the titers again in 3-4 weeks. Please be aware that this vaccine does have various strains of streptococcus in it-but not Strep A from what the doctor's will tell you. Our doctor did not feel it was necessary to revax our daughter at this time because she had a full course of Prevnar during her regular vaccine schedule. If he had wanted to, I probably would not let him do it because of the PANDAS.\n\nI have to pick my kids from school now but I'll post some links for you when I return.", "opengraph": {"title": "IGG subclasses and pneumococcal titers", "type": "website", "url": "https://latitudes.org/forums/topic/5271-igg-subclasses-and-pneumococcal-titers/", "description": "My suspected 15-year-old PANDAS son has his IGG and other immune functions tested. His IGG was found to be slightly lower than a reference range. More problematic were pneumococcal titer results. 12 out of 14 serotypes for the son's pneumococcal titers were almost zero, meaning, according to the ...", "updated_time": "2011-01-09T01:42:02Z", "site_name": "ACN Latitudes Forums", "locale": "en_US"}, "tags": ["Report", "Share", "Posted September 9, 2009", "Posted January 9, 2011", "Posted September 8, 2009"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "September 8, 2009"}