{"result_id": "008019", "URL": "https://latitudes.org/forums/topic/8857-immunizations/", "timestamp": "2023-04-25 11:46:40 CEST+0200", "meta": {"description": "Hello, Anthony will be turning 11 the end of summer--looks like there are some immunizations coming up: tetanus, pertussis, chickenpox and meningitis?? any thoughts on what I should do?? Don't think I am doing chickenpox what about the other ones? Deanna", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://latitudes.org/forums/topic/8857-immunizations/", "encoding": "utf-8"}, "image": null, "domain": "latitudes.org", "title": "Immunizations", "cleaned_text": "Check out the ad for that vaccine....notice the line under the 2nd picture?\n\nIt is unknown whether immunizing adolescents and adults against pertussis will reduce the risk of transmission to infants.\n\nThis SIXTH combo of DtaP/ TDaP/DPT etc. is being recommended for exactly that reason Peg. Babies are still getting Pertussis. I suspect there have been many cases in older kids too, which were probably diagnosed as asthma. If the kid was fully immunized it couldn't be Pertussis right? I had a Dr. tell me this herself. She said she had to take swabs and prove to the CDC that it was Pertussis. How well has this vax ever worked? It wasn't dangerous (annoying yes) to the older children, but they didn't belong on a steroid for asthma either. It was pertussis.\n\nAs far as the tetanus part goes, I read in one of the vax inserts that the annual incidence of tetanus in the US was around 560 (that's close not exact) prior to widespread routine use of the vaccine.\n\nThe package insert for the vax in the ad above says protection from the tetanus portion generally lasts for 10 years. If you look at the vax schedules, would your child even need the tetanus portion yet (assuming you believe the benefit out ways the risk of the vaccine).\n\nThis vaccine contains aluminum as an adjuvant (immune system booster). No one really knew how that worked. Recently, a team figured out that it was activating inflammasomes. Hummmm...could that be a problem for some?\n\nI could go on and on, but I'm rusty on this subject to begin with, so I'll stop here.\n\nI do hope that every parent does some research in this area. We need parents to understand what's going on here, and make their Dr.s accountable for knowing what they're talking about when they push these vaccines.\n\nWe also need reactions reported!!!!!\n\nThese are some excerpts from an article that I had saved. When I read the supposed adverse events #'s reported after widespread use of a new vaccine, I almost want to laugh or vomit depending on the day. I know how hard it is to get an adverse event recognized as being linked to a vaccine.\n\n'You have to Google Guillain-Barre.'\" It was against the rules, for fear of feeding a patient's anxiety, but the nurse checked. \"Within two hours, a new doctor was doing tests and checked me into the hospital.\"\n\nAccording to his neurologist, Mr. Pehanic said the cause for his case is unknown. \"I think that my neurologist suspected that the numerous vaccines I had in a short period of time may have sent my immune system into overdrive,\" he said.\n\nIn September, Mr. Pehanic and his wife, Stacie, who live in Broadview Heights, had been preparing to travel to China on Oct. 28 to adopt Chloe. They both had vaccines for hepatitis A and B, tetanus and typhoid, and they had a seasonal flu shot.\n\nMr. Pehanic's doctor advised him to see a psychiatrist. \"She saw me twice and thought it was a conversion disorder,\" in which no physical reason can explain the paralysis. \"She told me that the mind does weird things to the body and I started to believe that,\" he said.\n\nThe psychiatrist prescribed anti-anxiety drugs, \"but I felt no anxiety,\" he said. \"We had been planning the adoption for three years.\" In fact, the Pehanics had applied for a child with special needs to speed up the process. Chloe has a cleft lip and palate, which are scheduled to be corrected by surgery later this month.\n\n\"Eventually, the psychiatrist put me into the emergency room and checked me into a psychiatric ward. They took my shoes, shoelaces and sweat-pants string.\" That happened on Oct. 15. \"At this point, I couldn't walk and was in a wheelchair. I was there a few days and went to group therapy. No one was allowed to talk to me because that could feed a patient's anxiety.\"\n\n\"It was frustrating,\" he said. \"You know it's not anxiety, but no one was listening.\" He remembered what he had read about Guillain-Barre in a pamphlet when getting his vaccinations.\n\n\"On Oct. 17, I finally wheeled myself to the front desk,\" he said. That task was difficult because the numbness had moved up to his arms. He could not even grip a pen or write his name. \"I said to the nurse, 'You have to Google Guillain-Barre.'\" It was against the rules, for fear of feeding a patient's anxiety, but the nurse checked. \"Within two hours, a new doctor was doing tests and checked me into the hospital.\"\n\nA spinal tap confirmed that he had Guillain-Barre, he said. \"From that point on, it was a matter of time. I was so happy. At least I knew what it was and what it wasn't.\"", "opengraph": {"title": "Immunizations", "type": "website", "url": "https://latitudes.org/forums/topic/8857-immunizations/", "description": "Hello, Anthony will be turning 11 the end of summer--looks like there are some immunizations coming up: tetanus, pertussis, chickenpox and meningitis?? any thoughts on what I should do?? Don't think I am doing chickenpox what about the other ones? Deanna", "updated_time": "2010-08-05T00:52:19Z", "site_name": "ACN Latitudes Forums", "locale": "en_US"}, "tags": ["1", "Report", "Jul 3 2010 8 posts", "Jun 30 18", "Jun 30 2010 18 posts", "Share", "Prev", "Jul 3 8", "Next", "Jul 2 2010 5 posts", "3", "Jul 1 4", "Jul 2 5", "Posted June 30, 2010", "2", "Jul 1 2010 4 posts"], "tweets": [], "movies": [], "links": ["http://www.adacelvaccine.com/index.cfm?FA=protect/adacel/content&S=HOME&P=HowS_pread", "http://www.cdc.gov/vaccines/recs/schedules/downloads/child/2010/10_0-6yrs-schedule-pr.pdf", "http://www.cdc.gov/vaccines/recs/schedules/downloads/child/2010/10_7-18yrs-schedule-pr.pdf", "http://checkorphan.getreelhealth.com/grid/news/people/cause-is-unknown-for-local-teacher-s-rare-illness"], "authors": [], "publish_date": "June 30, 2010"}