{"result_id": "008043", "URL": "https://latitudes.org/forums/topic/25845-covid-vaccine/", "timestamp": "2023-04-25 11:46:55 CEST+0200", "meta": {"description": "Does anyone have experience with the COVID vaccine for kids with PANDAS? My son’s neurologist advised against it based on really bad flares for PANDAS kids after the flu vaccine , and the similarities between the vaccines. I heard about one young adult who ended up in a really bad flare a couple ...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://latitudes.org/forums/topic/25845-covid-vaccine/", "encoding": "utf-8"}, "image": null, "domain": "latitudes.org", "title": "COVID vaccine?", "cleaned_text": "My PANS kid (DS21) and I are very happy that he's had the COVID vaccine series. He's just had both Pfizer shots and did OK. Unpleasant headache and some fatigue for ~36 hours starting the day after the second shot, as well as a bad arm ache. He's more sensitive to pain due to chronic pain. I treated it with NSAID.\n\nFWIW, we timed his vaccine jabs to be 2 days before his regular anti-MCAS mast-cell-stabilizing infusions. Those include hydration plus meds like Benadryl and an IV NSAID. \n\n \n\n It was somewhat scary, but I would do it again in a heartbeat. For us is a huge feeling of relief, because the risk of getting COVID is still high with the more infectious variants still popping up (see the SA, Brazil and India strains, ones that haven't really had time to spread in the US yet).\n\nMy thinking is that a COVID vaccine flare is likely to be way less than the flare from COVID itself!\n\nMy (obsessively) careful ex and his autoimmune gf both got COVID in Oregon this spring, a few months after they'd taken a long Airbnb vacation from California and its surge. His gf's adult daughter was high-risk as well, and they all tried to be VERY careful to avoid infection. Unfortunately even with the California or UK strains, the aerosol dispersion of the virus is efficient enough and the infectiousness high enough that the old CDC guidelines of 2-layer cotton masks and surgical masks weren't good enough. And those strains are still better than the Brazil, So Africa or India strains. So I am VERY happy that if my DS were to get infected come this summer or fall, he's likely to have a mild case. \n\n \n\n PANS kids are different. My PANS kid (DS21) used to flare with every infection, no matter how small, as well as with intense cognitive or emotional stress. He stopped flaring with infections after we gave four cycles of IVIG and treated his tick-borne infections.\n\nI'd not been giving him flu shots since PANS onset, but he was too ill for school, nobody in our house was attending school, so we figured the risk was low. Still, *I* got influenza three years ago, and that sure was scary. I went to urgent care, got an antiviral, so did he as prophylaxis, we both masked indoors, I wore gloves and washed my stuff as soon as I brought them to the kitchen -- and he stayed healthy, or asymptomatic.\n\nUnlike the flu vaccine, I would approve the COVID vaccine even if he were still flaring now with infections.\n\nI have that much respect for the virus that causes COVID and what it can do to people with wonky immune systems. \n\n However I would likely give NSAIDs right after w/o waiting for side effects, and have steroids ready. Above all, I would do what I didn't have access to then -- consult an integrative MD to see how to best guide the immune system to make immunity w/o shifting into overdrive.\n\nPANS is hard on the body. So is COVID.\n\nGood luck with your decision. If the decisions were obvious, none of us would have to post, right?", "opengraph": {"title": "COVID vaccine?", "type": "website", "url": "https://latitudes.org/forums/topic/25845-covid-vaccine/", "description": "Does anyone have experience with the COVID vaccine for kids with PANDAS? My son’s neurologist advised against it based on really bad flares for PANDAS kids after the flu vaccine , and the similarities between the vaccines. I heard about one young adult who ended up in a really bad flare a couple ...", "updated_time": "2021-10-24T02:35:55Z", "site_name": "ACN Latitudes Forums", "locale": "en_US"}, "tags": ["Report", "Posted May 1, 2021", "Posted June 7, 2021", "Posted September 3, 2021", "Share", "Posted May 25, 2021", "Posted April 25, 2021", "Posted May 3, 2021", "Posted June 9, 2021", "Posted September 1, 2021", "Posted October 24, 2021", "Posted April 26, 2021", "Posted June 23, 2021", "Posted June 6, 2021"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "April 25, 2021"}