{"result_id": "008036", "URL": "https://latitudes.org/hydrogen-peroxide-as-protection-against-covid-19/", "timestamp": "2023-04-25 11:46:51 CEST+0200", "meta": {"description": "Editor, Sheila DeMare: As this is being written, the public is learning that the latest variant of Covid-19, BA.5, is easily transmitted and spreading rapidly", "lang": "en", "keywords": "", "favicon": "https://acn-latitudes-acn.netdna-ssl.com/wordpress/wp-content/uploads/2013/07/acn-favicon-16.ico", "canonical": "https://latitudes.org/hydrogen-peroxide-as-protection-against-covid-19/", "encoding": "UTF-8"}, "image": null, "domain": "latitudes.org", "title": "Hydrogen Peroxide as Protection Against Covid-19", "cleaned_text": "Editor, Sheila DeMare: As this is being written, the public is learning that the latest variant of Covid-19, BA.5, is easily transmitted and spreading rapidly in many parts of the USA and elsewhere. The protective benefits of a prior infection, and/or immunizations including boosters, are reportedly less effective as preventatives for BA.5 than for earlier variants. (See here) While basic CDC recommendations used during the height of the pandemic have not changed, and vaccines are still expected to help prevent severe disease, the scientific community is examining the current situation for updated guidance.\n\nMeanwhile, an interesting press release popped into my inbox several days ago from the Orthomolecular Society. Founded in the 1970s, this nonprofit shares health-related press releases through the Orthomolecular Medicine News Service. The report I received highlights evidence systematically collected by medical practitioners in Ghana for thousands of patients and some front-line staff.\n\nThe proposed concept is that hydrogen peroxide—used in a very low, safe dilution—can deactivate the virus in the mouth and nose, thereby preventing infection. (Shai-Osudoku District Hospital, one of the participating facilities, is shown in this article’s photo.) Low concentration levels of hydrogen peroxide have been used orally for decades in many dental practices.\n\nCovid-19 did not spare Ghana (World Health Organization report) and the positive results reported here are remarkable. There was surely no conflict of interest by the authors, as hydrogen peroxide is easy to obtain and costs less than 20 cents an ounce (USA). The protocol can also be self-administered, requiring no professional assistance. We are sharing the simple approach for informational purposes.\n\nThe journal report below is comprehensive, and some readers may want to skip past the compelling technical justification for the use of hydrogen peroxide and focus on the subtitle Clinical Use of Hydrogen Peroxide to Protect Healthcare Workers and Patients for an explanation of study results.\n\nHospital studies support daily mouth-washing and throat-gargling with 1% hydrogen peroxide and 0.5% for nasal cleansing\n\n(July 08, 2022) Dilute hydrogen peroxide has been demonstrated to be effective in preventing COVID-19, deactivating SARS-COV-2 variants and their subvariants. No cases of COVID-19 were recorded after hydrogen peroxide prophylaxis was introduced. There was not a single case of COVID-19 among a total of 10,220 inpatients on hydrogen peroxide between August 2020 and June 2022.\n\nTo date, the COVID-19 coronavirus pandemic has affected 535 million people and claimed over 6.3 million lives globally. [1] New estimates from the World Health Organization (WHO) show that the full death toll associated directly or indirectly with the COVID-19 pandemic and described as “excess mortality” between 1 January 2020 and 31 December 2021, is approximately 14.9 million, ranging from 13.3 million to 16.6 million. [2] The current pandemic, therefore, is the world’s worst catastrophic event since the Spanish pandemic influenza that resulted in at least 50 million deaths between 1918 and 1919. [3]\n\nAs of December 22nd 2020 when vaccinations against the disease had begun to be rolled out in Russia, China, the US and the UK, the estimated number of COVID-19 cases globally was 75 million, with 1.6 million deaths. [4] Since then, an estimated 11.8 billion doses of vaccines have been administered, with 4.7 billion people fully vaccinated. [5] In countries with more robust healthcare systems such as Israel, Denmark, Sweden and Norway, up to four booster doses of vaccines have been given to vulnerable groups in an effort to abate the severity of clinical outcomes of the disease from infections caused by the new and more virulent and transmissible variants of SARS-CoV-2. [6]\n\nEstablished public health protocols to prevent spread of the disease, such as nose and mouth coverings, use of alcohol-based sanitizers, frequent handwashing and safe distancing, have also been opted for in Ghana [7], and most likely in many other countries over the first 24 months of the pandemic.\n\nDespite these interventions and the enforcement of standard public health preventive measures, the number of COVID-19 cases continues to increase. Since November 2019 when the Wuhan strain of the virus first emerged, several variants of concern have also emerged. [8]\n\nThe COVID-19 pandemic continues to have profound effects on health care and other societal systems, as well as the global economy. As is the case in most humanitarian emergencies, the poorer developing nations have taken the hardest hits, and disadvantaged groups, particularly people living in poverty and subject to marginalization and exclusion, have suffered the most. [9]\n\nThat is why the effort to identify more effective public health control measures must continue, with advocacy for trial use of oral and nasal antiseptics which include hydrogen peroxide, a known effective bactericidal and fungicidal agent. [10,11]\n\nIn-vitro studies have shown that 3% hydrogen peroxide inactivates SARS-CoV-2 and other respiratory viruses. [12,13] Since the emergence of COVID-19, additional studies have demonstrated that even lower concentrations of hydrogen peroxide (1% and 0.5%) inactivate the virus within one minute in-vitro. [14-16] Povidone has also been shown in in-vitro studies to inactivate the virus. These comparative in-vitro studies suggest that povidone and hydrogen peroxide are most effective against the virus when the virus is exposed to them. [15]\n\nClinical evidence of efficacy and safety of oral antiseptics against SARS-CoV-2, had been lacking until recently. [16-19] Oral antiseptics including hydrogen peroxide had not featured in the preventive measures against previous coronavirus infections such as the SARS-CoV and the Middle East Respiratory Syndrome (MERS) epidemics.\n\nIn this brief review, we have considered the scientific basis of the effectiveness of hydrogen peroxide antisepsis against SARS-CoV-2, providing clinical evidence that this solution even in low concentrations protects against COVID-19.\n\nEmphasis is being placed by researchers on oral antiseptics in the search for a solution to prevent COVID-19 because of the potential of these solutions to inactivate SARS-CoV-2. From the results of in-vitro studies as noted above, it had been rightly assumed that viruses in the oronasal cavities and their adjacent pharyngeal spaces could be inactivated before they attach to and penetrate the mucosal barriers in these regions to infect deeper lying cells to cause infection and disease. Critical in this consideration is the membrane wall of the virus and the spike proteins found on it. This nature of the virus has recently been reviewed. [20-22]\n\nTo be effective against an enveloped virus, the oral antiseptic must affect either the membrane wall of the virus or its spike proteins to prevent the S-protein from binding to the human Angiotensin Converting enzyme (h-ACE) receptor which is present in the mucus membrane of all parts of the respiratory system. [21] That is how the antiseptic inactivates the virus to prevent it from attaching to the mucosa and to penetrate to infect deeper lying cells to cause infection.\n\nBeing a powerful oxidant, hydrogen peroxide has a great potential to achieve the above. The released reactive oxygen species (ROS) products of hydrogen peroxide rapidly modify the acyl chain by lipid peroxidation of the unsaturated chains in the membrane wall to destabilize the virus. [11,23] By that action, hydrogen peroxide directly limits and even destroys the ability of the virus to attach to ACE receptors. The ROS also directly affect amino acid chains of proteins [24], and would, therefore, interfere with the structure of the spike proteins of the virus in the process of peroxidation, rendering them ineffective.\n\nOral antiseptics and the Incubation Period of the Coronavirus\n\nEven when a more transmissible variant or sub-variant of the virus enters the oronasal cavities, there is sufficient time for hydrogen peroxide deactivation to happen, if it is used daily. It must be noted, however, that the virus could escape residence in the oral and nasal cavities and their pharyngeal spaces to directly affect other parts of the trachea-bronchial tree including the alveolar pneumocytes, causing early disease with dire consequences. [27]\n\nThis is why the recommendation for early intervention with hydrogen peroxide nebulization is vital in such cases to inactivate the virus before it causes disease directly involving the alveoli. This subject has been extensively dealt with. [28-30] For that reason, those at greater risk of direct invasion of the lungs with viruses such as healthcare workers, athletes, and those with lifestyle activities requiring hyperventilation, must also boost their immune system with adequate levels of micronutrients such as Vitamin C, D and E, folic acid, zinc, and magnesium. [31]\n\nOther Rationale for Hydrogen Peroxide use in the Oronasal, and Oropharyngeal Cavities\n\nThe rationale for topical use of hydrogen peroxide in the oral cavity is that the mucosa of the oral cavity and the oropharynx has a robust epithelium that is not easily corroded. The stratified squamous keratinized and non-keratinized epithelial nature of the oral cavity and the oropharynx help to prevent damage. Noting that the reactive oxygen species generated by hydrogen peroxide has mutagenic properties, the epithelium of the oropharyngeal mucosae is even keratinized in some parts, [32] making those areas less vulnerable to mutagenicity.\n\nThe nasal cavity and its postnasal space, on the other hand, present a challenge: the mucosa here is less robust, except in the nasal vestibule which has stratified squamous keratinized epithelium. The mucosal lining of the main nasal cavity as well as the nasopharynx is pseudo-stratified columnar type of epithelium interspersed with mucus secreting goblet cells [32], except in its roof including the adjacent surfaces of the superior conchae where olfactory epithelium exits. To limit corrosion of these less robust types of epithelia in the nasal cavity, a lower concentration of hydrogen peroxide (0.5%) has been recommended. [18,33] That is the reason why only 2-3 drops of the 0.5% hydrogen solution per day are required and for a period of one minute.\n\nMutagenicity of Hydrogen Peroxide and other Adverse Effects\n\nWe have referred to this already but must address it more fully, as it is of the utmost importance in any recommendation of hydrogen peroxide topical use. In a publication in the British Medical Journal, we addressed that challenge [33], drawing attention to an extensive review on the subject by Walsh [34] and Marshall et.al. [35]\n\nSo far, no evidence has been found in human studies of cellular mutation in oral use of hydrogen peroxide at concentrations of 3%. Even hydrogen peroxide use at concentrations of 6% for whitening of teeth has not shown any evidence of mutagenicity. In their review of hydrogen peroxide safety, it was noted that some individuals had used hydrogen peroxide daily for 6 years without deleterious effects. [35]\n\nIt is also to be noted that hydrogen peroxide is an essential product in the metabolism of innate immune cells to destroy pathogens through peroxidation. The ROS released in that process are quickly detoxified to protect body cells by enzymes such as catalase, superoxide dismutase, and glutathione peroxidase. [36] Saliva has been found to contain peroxidase, catalase and glutathione reductase. [37] Any excess of hydrogen peroxide in the oral cavity and oropharynx would therefore be detoxified by these enzymes in saliva.\n\nAccidental swallowing of 3% hydrogen peroxide, however, is known to cause gastric irritation in some individuals. In the two-year period of study of hydrogen peroxide use to prevent COVID-19, our attention has not been drawn to any such deleterious effect in those using the hydrogen peroxide solution.\n\nProphylactic Use of Oral Antiseptics in Dental Practice to Protect Patients and Staff from COVID-19\n\nRecent data on the use of hydrogen peroxide in dental clinics suggests that it is useful in reducing SARS-CoV-2 viral load [16], corroborating the use of oral antiseptics employed in dental practice as an antidote to SARS-CoV-2 transmission. [38]\n\nIn Ghana, both povidone and hydrogen peroxide are in use clinically for patients before non-surgical and surgical dental procedures (Personal communication – Dr. Mary Ayettey-Adamafio, co-author). This practice is intended to protect both patients and staff from contracting the coronavirus. It is helpful too for the patient, as the oral antiseptic inactivates other microbial organisms that might otherwise escape into the blood stream to cause disease. [4]\n\nClinical Use of Hydrogen Peroxide to Protect Healthcare Workers and Patients\n\nThis is the crux of our current research published to date. [17,18] From our observations that very low concentrations of hydrogen peroxide protect hospital staff who are most at risk of contracting COVID-19, from the strong anecdotal evidence of hydrogen peroxide protection from the disease, and from the growing international interest in the use of oral antiseptics to prevent the disease, we recognize a providential guidance in March 2020 to investigate the relationship between hydrogen peroxide and coronaviruses. Indeed, since then, other investigators have also shared anecdotal evidence of hydrogen peroxide benefits even in treatment of COVID-19. [28,30]\n\nWhile preparing a protocol for clinical investigation of the efficacy of hydrogen peroxide protection against COVID-19, we were fortuitously presented with an opportunity to observe eight emergency care nurses at the Shai-Osudoku District Hospital who, on their own volition, had been using hydrogen peroxide since May 2020 to protect themselves from the disease. At that time, the only preventive protocols were the established public health measures including mouth and nose covers, frequent washing of hands with soap under running water, and use of hand sanitizers. Only those who were managing confirmed COVID-19 cases wore the full personal protective equipment clothing suit. These emergency-care nurses wore ordinary scrubs; there were no vaccines available at the time; neither were there fail-proof therapeutic remedies for the disease.\n\nUnknown to us, these eight healthcare workers had heard about our advocacy for 1% hydrogen peroxide daily use for mouth-washing and throat-gargling for one minute and 0.5% for nasal cleansing through several social platforms to save lives, and were using it. The reason for promoting hydrogen peroxide use was that team members and their relatives using the solution and who had been exposed to the disease had been protected. By May 2020, anecdotal evidence of hydrogen peroxide protection against COVID-19 had already become strong. Faced with the real challenge of rapid spreading of the disease, and without fail-proof preventive measures and therapeutic interventions, we were obliged to share more widely the anecdotal evidence of hydrogen peroxide protection with the wider family, friends, colleagues, neighbors and others including religious bodies, recognizing also that this antiseptic is an off-the-counter solution that had been in use in dental practice for decades. [35]\n\nIt was observed that these eight nurses remained free of COVID-19, even though they attended to several patients at the facility who were later diagnosed with COVID-19. RT-PCR tests on them remained negative. We followed them closely till December 2020. While they remained free of the disease, 62 of their colleagues working in less risky areas of the hospital and clothed in scrubs like those at the emergency department but not using hydrogen peroxide, had COVID-19 by the end of December 2020.\n\nBetween December 2020 and January 2021, Ghana recorded two new variants of SARS-CoV-2 (the Alpha and Beta variants) which caused a spike in COVID-19 cases till March 2021. [40] Realizing that their eight colleagues who managed patients, before they were diagnosed as COVID-19 and transferred to COVID-19 treatment centers, remained protected from the disease because they were using hydrogen peroxide, 86 other colleagues at that hospital decided to try it. From January to end of March 2021, none of these 86 healthcare workers now using hydrogen peroxide plus the 8 emergency nurses contracted COVID-19, while 10 of their colleagues not using hydrogen peroxide had the disease.\n\nNew information from the Shai-Osudoku District Hospital reveals that there were 21 new cases of COVID-19 recorded among the healthcare staff in June 2022. Prior to that, no new cases of COVID-19 were recorded since January 2022. All the twenty-one (21) affected healthcare workers were fully vaccinated and not using hydrogen peroxide.\n\nAt the Mount Olives Hospital which is a private facility in the Bono East Region of Ghana, another opportunity presented for observation of hydrogen peroxide protection against COVID-19. Twenty-two (22) cases of COVID-19 were recorded at this hospital for the first time in July 2020 and before hydrogen peroxide intervention. Seventeen (17) of these were healthcare workers, and five (5) were inpatients.\n\nHydrogen peroxide prophylactic use among inpatients and staff at Mount Olives Hospital was introduced in August 2020. Hydrogen peroxide use was also recommended for the healthcare staff on voluntary basis.\n\nBetween August 2020 and March 2021, no cases of COVID-19 were recorded among a total of 3,375 inpatients on hydrogen peroxide prophylaxis twice a day. Of the members of staff, no cases of COVID-19 were recorded among those (32) not using hydrogen peroxide. Of the 52 on hydrogen peroxide prophylaxis, two travelled outside the town for a week and did not use hydrogen peroxide during that period; those two contracted COVID-19. The rest were free from disease.\n\nFrom April 2021 to December 2021 no cases of COVID-19 were recorded among inpatients (total 4726). Within the same period too, no cases of the disease were found among the healthcare staff, all of whom were fully vaccinated and using hydrogen peroxide, except one who stopped using hydrogen peroxide in the month of December and contracted the disease. Again, this has been captured in our recent publications. [18] Recent information from this hospital is that no cases of COVID-19 have been recorded among healthcare workers and inpatients from January to June 2022. All healthcare workers (current total 89), and all inpatients (total 2,484 for the period) have continued on hydrogen peroxide prophylaxis, the staff remaining fully vaccinated.\n\nA summary of the observations so far is that none at both institutions using hydrogen peroxide on a regular daily basis had COVID-19 over a period of 26 months since the study began. At the Mount Olives Hospital, three staff members who stopped or interrupted hydrogen peroxide use over the period of the study had COVID-19. Otherwise, no cases of COVID-19 were recorded after hydrogen peroxide prophylaxis was introduced. There was not a single case of COVID-19 among a total of 10,220 inpatients on hydrogen peroxide between August 2020 and June 2022.\n\nThat the 32 members of healthcare staff at the Mount Olives Hospital who in the first phase of the study (between August 2020 and March 2021) did not use hydrogen peroxide and yet remained free of COVID-19 is not entirely surprising. They most likely were protected by the large number of staff and patients using hydrogen peroxide prophylaxis, even though they could have come into contact with SARS-CoV-2 in the community. That observation may indicate that hydrogen peroxide antiseptics curtails nosocomial spread SARS-CoV-2.\n\nWe have also argued that if hydrogen peroxide protects individuals from being infected with the virus, it would also protect COVID-19 patients from infecting others, should these patients use it regularly. [18] Clinical studies should be conducted to establish that convincingly. By that same logic, hydrogen peroxide use among COVID-19 patients including those with ‘long COVID’ and those convalescing from the disease, could be expected to protect such patients from being reinfected with the viruses they are shedding. In the current study, our attention was drawn to three individuals who became re-infected and had the disease within a period of three months of the first infections. Likely, this could have been avoided, if these individuals had used hydrogen peroxide after the first infection.\n\nThese convincing clinical observations should encourage the use of hydrogen peroxide on a wider scale, especially among healthcare workers. It is noted that some individuals might not be able to gargle or mouthwash effectively, such as children and those with neurological challenges like stroke. For these individuals, mouth, throat and nasal swabs or spray with hydrogen peroxide should suffice. Finally, based on the growing evidence of hydrogen peroxide protection against COVID-19, we recommend its wider use to mitigate the pandemic.\n\n*Andrews S. Ayettey. MB. ChB. PhD (Cambridge). Emeritus Professor, Department of Anatomy, University of Ghana Medical School, College of Health Sciences, University of Ghana, Legon. Ghana. Email: seth.ayettey@gmail.com\n\nKwamena W. Sagoe. MSc PhD. Associate Professor, Department of Medical Microbiology, University of Ghana Medical School, College of Health Sciences. University of Ghana, Legon. Ghana. Email: kwsagoe@ug.edu.gh\n\nAlbert G.B. Amoah. MB ChB, PhD, FWACP, FGCP, FGA. Emeritus Professor, Department of Medicine and Therapeutics, University of Ghana Medical School, College of Health Sciences, University of Ghana, Legon, Ghana. Email: agbamoah@hotmail.com\n\nIsabella A. Quakyi. PhD. FGA. Emerita Professor, Department of Biological Environmental and Occupational Health Sciences, School of Public Health, College of Health Sciences, University of Ghana, Legon, Ghana. Email: profquakyi@gmail.com\n\nMerley Newman-Nartey. BDS MClD FGCS. Associate Professor, Department of Orthodontics and Pedodontics, University of Ghana Dental School, College of Health Sciences, University of Ghana, Legon, Ghana. Email: merleynn@hotmail.com\n\nNii Otu Nartey. BDS MSc FAAOP MRCD FWACS FGCS Associate Professor, Department of Oral Pathology and Oral Medicine, University of Ghana Dental School, College of Health Sciences, University of Ghana, Legon, Ghana. Email: n.niiotu@gmail.com\n\nFelix I. D. Konotey-Ahulu. MD (Lond) FRCP (Lond & Glasg) DTMH (L’pool). FGA, Distinguished Professor of Human Genetics, Faculty of Science, University of Cape Coast, Ghana. Email: fkonoteyahulu@gmail.com\n• None World Health Organization (2022) 14.9 million excess deaths associated with the COVID-19 pandemic in 2020 and 2021. Geneva, Switzerland: World Health Organization. https://www.who.int/news/item/05-05-2022-14.9-million-excess-deaths-were-associated-with-the-covid-19-pandemic-in-2020-and-2021\n• None Nickol ME, Kindrachuk J. (2019) A year of terror and a century of reflection: perspectives on the great influenza pandemic of 1918-1919. BMC Infect Dis 19:117. https://pubmed.ncbi.nlm.nih.gov/30727970\n• None World Health Organization (2020) Background paper on Covid-19 disease and vaccines: prepared by the Strategic Advisory Group of Experts (SAGE) on immunization working group on COVID-19 vaccines. Geneva, Switzerland: World Health Organization. https://apps.who.int/iris/handle/10665/338095\n• None Watson C. (2022) Three, four or more: what’s the magic number for booster shots? Nature 602:17-18. https://pubmed.ncbi.nlm.nih.gov/35091715\n• None Bonful HA, Addo-Lartey A, Aheto JMK, et al. (2020) Limiting spread of COVID-19 in Ghana: Compliance audit of selected transportation stations in the Greater Accra region of Ghana. PLoS One 15(9):e0238971. https://pubmed.ncbi.nlm.nih.gov/32915888\n• None Tyagi N, Sardar R, Gupta D. (2022) Natural selection plays a significant role in governing the codon usage bias in the novel SARS-CoV-2 variants of concern (VOC). PeerJ 2022;10:e13562. https://pubmed.ncbi.nlm.nih.gov/35765592\n• None Sumner A, Hoy C, Ortiz-Juarez E. (2020) Estimates of the impact of COVID-19 on global poverty. Helsinki, Finland: UNU-WIDER. https://www.wider.unu.edu/sites/default/files/Publications/Working-paper/PDF/wp2020-43.pdf\n• None Tan EL, Johari NH. (2021) Comparative in vitro evaluation of the antimicrobial activities of povidone-iodine and other commercially available antiseptics against clinically relevant pathogens. GMS Hyg Infect Control 16:Doc05. https://pubmed.ncbi.nlm.nih.gov/33643772\n• None Vereshchagin AN, Frolov NA, Egorova KS, et al. (2021) Quaternary Ammonium Compounds (QACs) and Ionic Liquids (ILs) as Biocides: From Simple Antiseptics to Tunable Antimicrobials. Int J Mol Sci 22:6793. https://pubmed.ncbi.nlm.nih.gov/34202677\n• None Caruso AA, Del Prete A, Lazzarino AI. (2020) Hydrogen peroxide and viral infections: A literature review with research hypothesis definition in relation to the current covid-19 pandemic. Med Hypotheses 2020;144:109910. https://pubmed.ncbi.nlm.nih.gov/32505069\n• None Kampf G, Todt D, Pfaender S, Steinmann E. (2020) Persistence of coronaviruses on inanimate surfaces and their inactivation with biocidal agents. J Hosp Infect. 104:246-251. https://pubmed.ncbi.nlm.nih.gov/32035997\n• None Reis INR, do Amaral G, Mendoza AAH, et al. (2021) Can preprocedural mouthrinses reduce SARS-CoV-2 load in dental aerosols? Med Hypotheses 146:110436. https://pubmed.ncbi.nlm.nih.gov/33288313\n• None Burgos-Ramos E, Urbieta IR, Rodríguez D. (2022) Is hydrogen peroxide an effective mouthwash for reducing the viral load of SARS-CoV-2 in dental clinics? Saudi Dent J. 34:237-242. https://pubmed.ncbi.nlm.nih.gov/35136326\n• None Amoah GB, Quakyi IA, Sagoe KW, et al. (2021) Re: Oral antiseptics against coronavirus: in-vitro and clinical evidence. J Hosp Infect. 118:108-109. https://pubmed.ncbi.nlm.nih.gov/34487774\n• None Amoah AGB, Sagoe KW, Quakyi IA, et al. (2022) Further observations on hydrogen peroxide antisepsis and COVID-19 cases among healthcare workers and inpatients. J Hosp Infect. 126:103-108. https://pubmed.ncbi.nlm.nih.gov/35594985\n• None Mateos-Moreno MV, Mira A, Ausina-Márquez V, et al. (2021) Oral antiseptics against coronavirus: in-vitro and clinical evidence. J Hosp Infect. 113:30-43. https://pubmed.ncbi.nlm.nih.gov/33865974\n• None Gonzalez MJ, Miranda-Massari JR, McCullough PA, et al. (2022) An International Consensus Report on SARS-Cov-2, COVID-19, and the Immune System: An Orthomolecular View. J Orthomolecular Med. 37(1) https://isom.ca/article/an-international-consensus-report-on-sars-cov-2-covid-19-and-the-immune-system-an-orthomolecular-view\n• None Yurkovetskiy L, Wang X, Pascal KE, et al. (2020) Structural and Functional Analysis of the D614G SARS-CoV-2 Spike Protein Variant. Cell 183(3):739-751.e8. https://pubmed.ncbi.nlm.nih.gov/32991842\n• None O’Donnell VB, Thomas D, Stanton R, et al. (2020) Potential Role of Oral Rinses Targeting the Viral Lipid Envelope in SARS-CoV-2 Infection. Function 1(1):zqaa002. https://pubmed.ncbi.nlm.nih.gov/33215159\n• None Eze MO. (1992) Membrane fluidity, reactive oxygen species, and cell-mediated immunity: implications in nutrition and disease. Med Hypotheses 37:220-224. https://pubmed.ncbi.nlm.nih.gov/1625597\n• None Marik PE, Iglesias J, Varon J, Kory P. (2021) A scoping review of the pathophysiology of COVID-19. Int J Immunopathol Pharmacol 35:20587384211048026. https://pubmed.ncbi.nlm.nih.gov/34569339\n• None Lauer SA, Grantz KH, Bi Q, et al. (2020) The Incubation Period of Coronavirus Disease 2019 (COVID-19) From Publicly Reported Confirmed Cases: Estimation and Application. Ann Intern Med. 172:577-582. https://pubmed.ncbi.nlm.nih.gov/32150748\n• None Carcaterra M, Caruso C. (2021) Alveolar epithelial cell type II as main target of SARS-CoV-2 virus and COVID-19 development via NF-Kb pathway deregulation: A physio-pathological theory. Med Hypotheses 146:110412. https://pubmed.ncbi.nlm.nih.gov/33308936\n• None Levy T. (2021) Rapid Virus Recovery: No need to live in fear. MedFox Publishing, 2021. ISBN-13: 9780998312415 https://www.medfoxpub.com/medicalnews/product/RVR/Rapid-Virus-Recovery-No-need-to-live-in-fear\n• None Cervantes Trejo A, Castañeda ID, Rodríguez AC, et al. (2021) Hydrogen Peroxide as an Adjuvant Therapy for COVID-19: A Case Series of Patients and Caregivers in the Mexico City Metropolitan Area. Evid Based Complement Alternat Med 2021:5592042. https://pubmed.ncbi.nlm.nih.gov/34335827\n• None Cheng RZ. (2020) Protected Population Immunity, Not A Vaccine, Is The Way To Stop Covid-19 Pandemic. J Clin Immunol Immunother. 6:1-4.\n• None Ayettey AS, Quakyi IA, Ayettey-Annie HN-G, et al. (2020) A Case for Hydrogen Peroxide Mouthwash and Gargle to Limit SARS-CoV-2 Infection. BMJ 368 https://www.bmj.com/content/368/bmj.m1252/rr-27\n• None Walsh LJ. (2000) Safety issues relating to the use of hydrogen peroxide in dentistry. Aust Dent J. 45:257-269. https://pubmed.ncbi.nlm.nih.gov/11225528\n• None Marshall MV, Cancro LP, Fischman SL. (1995) Hydrogen peroxide: a review of its use in dentistry. J Periodontol. 66:786-796. https://pubmed.ncbi.nlm.nih.gov/7500245\n• None Bhattacharyya A, Chattopadhyay R, Mitra S, Crowe SE. (2014) Oxidative stress: an essential factor in the pathogenesis of gastrointestinal mucosal diseases. Physiol Rev. 94:329-354. https://pubmed.ncbi.nlm.nih.gov/24692350\n• None Maciejczyk M, Zalewska A, Ladny JR. (2019) Salivary Antioxidant Barrier, Redox Status, and Oxidative Damage to Proteins and Lipids in Healthy Children, Adults, and the Elderly. Oxid Med Cell Longev. 2019:4393460. https://pubmed.ncbi.nlm.nih.gov/31885792\n• None Jamal M, Shah M, Almarzooqi SH, et al. (2021) Overview of transnational recommendations for COVID-19 transmission control in dental care settings. Oral Dis. 27 Suppl 3:655-664. https://pubmed.ncbi.nlm.nih.gov/32428372\n• None Morang’a CM, Ngoi JM, Gyamfi J, et al. (2022). Genetic diversity of SARS-CoV-2 infections in Ghana from 2020-2021. Nat Commun. 13:2494. https://pubmed.ncbi.nlm.nih.gov/35523782\n• None Wilkinson E, Giovanetti M, Tegally H, et al. (2021) A year of genomic surveillance reveals how the SARS-CoV-2 pandemic unfolded in Africa. Science 374:423-431. https://pubmed.ncbi.nlm.nih.gov/34672751\n\nOrthomolecular medicine uses safe, effective nutritional therapy to fight illness. For more information: http://www.orthomolecular.org\n\nTo locate an orthomolecular physician near you: http://orthomolecular.org/resources/omns/v06n09.shtml\n\nThe peer-reviewed Orthomolecular Medicine News Service is a non-profit and non-commercial informational resource.", "opengraph": {"locale": "en_US", "type": "article", "title": "Hydrogen Peroxide as Protection Against Covid-19 | ACN Latitudes", "description": "Editor, Sheila DeMare: As this is being written, the public is learning that the latest variant of Covid-19, BA.5, is easily transmitted and spreading rapidly", "url": "https://latitudes.org/hydrogen-peroxide-as-protection-against-covid-19/", "site_name": "ACN Latitudes", "article:publisher": "http://www.facebook.com/ACNLatitudes", "article:tag": "hydrogen peroxide", "article:section": "General", "updated_time": "2022-07-25T10:27:27-04:00", "image": "https://latitudes.org/wordpress/wp-content/uploads/2022/07/Hospital-Ghana1.png", "image:secure_url": "https://latitudes.org/wordpress/wp-content/uploads/2022/07/Hospital-Ghana1.png", "image:width": "1200", "image:height": "628", "image:alt": "Shai-Osudoku District Hospital", "image:type": "image/png", "article:published_time": "2022-07-24T01:34:22-04:00", "article:modified_time": "2022-07-25T10:27:27-04:00"}, "tags": ["hydrogen peroxide", "General", "COVID-19"], "tweets": [], "movies": [], "links": ["#", "#", "#", "https://www.linkedin.com/shareArticle?mini=true&ro=true&trk=EasySocialShareButtons&title=Hydrogen+Peroxide+as+Protection+Against+Covid-19&url=https%3A%2F%2Flatitudes.org%2Fhydrogen-peroxide-as-protection-against-covid-19%2F", "#", "https://health.ucdavis.edu/coronavirus/covid-19-information/omicron-variant", "https://www.newswise.com/coronavirus/newer-covid-19-subvariants-are-less-vulnerable-to-immunity-induced-by-vaccination-and-previous-infection-researchers-find/?article_id=773335&sc=mwhn&user=10009061", "https://isom.ca/", "https://latitudes.org/protocol-for-hydrogen-peroxide-mouthwash-and-nasal-cleanse/", "https://covid19.who.int/region/afro/country/gh", "http://orthomolecular.org/subscribe.html", "http://orthomolecular.org/resources/omns/index.shtml", "#", "#"], "authors": [], "publish_date": "2022-07-24T01:34:22-04:00"}