{"result_id": "008007", "URL": "https://latitudes.org/forums/topic/17499-vaccine-exemptions/", "timestamp": "2023-04-25 11:46:33 CEST+0200", "meta": {"description": "Ok, so, I am really starting to freak out. We live in Mississippi, one of only two states that doesn't allow for any type of vaccine exemption except the medical exemption for school vaccines. My son is entering the seventh grade in the fall and is required by law to get another vaccination. I be...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://latitudes.org/forums/topic/17499-vaccine-exemptions/", "encoding": "utf-8"}, "image": null, "domain": "latitudes.org", "title": "Vaccine exemptions", "cleaned_text": "Ok, so, I am really starting to freak out. We live in Mississippi, one of only two states that doesn't allow for any type of vaccine exemption except the medical exemption for school vaccines. My son is entering the seventh grade in the fall and is required by law to get another vaccination. I believe it is the Tdap vaccine. The only other state that doesn't offer a religious or personal exemption is West Virginia. I have already asked my pediatrician about giving my son an exemption but he declined saying that the shot should not do any harm. We do have an apt. With a ped. Neurologist in July, and I will beg her for an exemption but I don't know what I will do if she declines. Getting a medical exemption seems like a very long complicated process. Do any of you have any experience with this? Any suggestions about what information I could print out and bring with me in July to try to convince a doctor to sign off on this? What can I do in the meantime? Should I seek out a DAN dr. I was thinking they may be more receptive to this type of thing, although my son is not autistic. If there are any other Mississippi moms on this forum who have any names of any doctors please pm me. Any advice is appreciated... Have any of you gotten this vaccine for your children after the pandas diagnosis and not had a problem? Maybe I am freaking out over nothing... Just more to worry about.\n\nI agree about having titers done. If they're high enough that should eliminate your problem completely. If not I do suggest seeing a DAN doctor and getting a letter. Or what about seeing one of the PANDAS specialists? My DD has had high titers on all her vaccines since she was 5. Through the years the only vaccine the school pushed back on was tetanus. They said high titers wasn't enough so our integrative doctor wrote a letter saying she could not have ANY vaccines because it would be harmful to her immune system.\n\nMissmom, as a Mom of a PANDAS child who was severely injured by vaccines, my advice to you is to do whatever you can to get the medical exemption. Seek out a DAN doc if necessary. We have a DAN doc who has been willing to write medical exemption letters for both of my sons (one has severe PANDAS with a recent schizophrenic presentation and the other has severe allergies, asthma, a high CamKinase, and very mild tics, but no real PANDAS symptoms, probably because we stopped vaccines for him and he is on prophylactic Zithromax, prescribed by the DAN). Our DAN has been so helpful to us in many many ways. I can tell you that my severe PANDAS son is not doing well and has been in the hospital for many months. He was a once very normal, high achieving boy who presented with OCD after a strep five years ago, but severe OCD along with psychotic features and many other bizzare and unusual symptoms started after he had the Chicken Pox and Hep A vaccines seven months following the strep. Since the vaccines he has never been the same. Back then there was nobody to warn me about the risk of vaccines for kids with PANDAS, so all I can do is warn others by sharing our tragic story. My husband and I are both certain that the vaccines played a major role in causing his PANDAS to go from mild to severe. If I were you, I would keep searching to find someone willing to do this exemption, and from my experience, I know that DANS can be very helpful with this and you don't need to have an autistic child to get an exemption. Ok, so, I am really starting to freak out. We live in Mississippi, one of only two states that doesn't allow for any type of vaccine exemption except the medical exemption for school vaccines. My son is entering the seventh grade in the fall and is required by law to get another vaccination. I believe it is the Tdap vaccine. The only other state that doesn't offer a religious or personal exemption is West Virginia. I have already asked my pediatrician about giving my son an exemption but he declined saying that the shot should not do any harm. We do have an apt. With a ped. Neurologist in July, and I will beg her for an exemption but I don't know what I will do if she declines. Getting a medical exemption seems like a very long complicated process. Do any of you have any experience with this? Any suggestions about what information I could print out and bring with me in July to try to convince a doctor to sign off on this? What can I do in the meantime? Should I seek out a DAN dr. I was thinking they may be more receptive to this type of thing, although my son is not autistic. If there are any other Mississippi moms on this forum who have any names of any doctors please pm me. Any advice is appreciated... Have any of you gotten this vaccine for your children after the pandas diagnosis and not had a problem? Maybe I am freaking out over nothing... Just more to worry about.\n\nI agree about having titers done. If they're high enough that should eliminate your problem completely. If not I do suggest seeing a DAN doctor and getting a letter. Or what about seeing one of the PANDAS specialists? My DD has had high titers on all her vaccines since she was 5. Through the years the only vaccine the school pushed back on was tetanus. They said high titers wasn't enough so our integrative doctor wrote a letter saying she could not have ANY vaccines because it would be harmful to her immune system. Ditto. A DAN doctor would be a good bet. Even though your child is not Autistic, DAN docs are regular docs (ours is a Family Practice), but they practice the DAN protocol for Autistic kids. They understand the medical complications of all these things that affect our kids' immune systems. Alternatively, is the neurologist a PANDAS specialist? I believe those are good options. I can understand your pediatrician's hesitancy, because this is out of his/her realm of practice, but the other 2 should be able to help you. The neuro is not a pandas specialist but was listed on the pandas resource network list as a treating doctor, we had a three month wait to get in to see her so we will have to wait and see how it goes. I just checked the autism sites and the only Dan dr. Listed in ms is not a MD. So that will not work for us. The state requirements for exemptions seem very strict. I may call our district rep. And see what I can do.\n\nMissmom, as a Mom of a PANDAS child who was severely injured by vaccines, my advice to you is to do whatever you can to get the medical exemption. Seek out a DAN doc if necessary. We have a DAN doc who has been willing to write medical exemption letters for both of my sons (one has severe PANDAS with a recent schizophrenic presentation and the other has severe allergies, asthma, a high CamKinase, and very mild tics, but no real PANDAS symptoms, probably because we stopped vaccines for him and he is on prophylactic Zithromax, prescribed by the DAN). Our DAN has been so helpful to us in many many ways. I can tell you that my severe PANDAS son is not doing well and has been in the hospital for many months. He was a once very normal, high achieving boy who presented with OCD after a strep five years ago, but severe OCD along with psychotic features and many other bizzare and unusual symptoms started after he had the Chicken Pox and Hep A vaccines seven months following the strep. Since the vaccines he has never been the same. Back then there was nobody to warn me about the risk of vaccines for kids with PANDAS, so all I can do is warn others by sharing our tragic story. My husband and I are both certain that the vaccines played a major role in causing his PANDAS to go from mild to severe. If I were you, I would keep searching to find someone willing to do this exemption, and from my experience, I know that DANS can be very helpful with this and you don't need to have an autistic child to get an exemption. Ok, so, I am really starting to freak out. We live in Mississippi, one of only two states that doesn't allow for any type of vaccine exemption except the medical exemption for school vaccines. My son is entering the seventh grade in the fall and is required by law to get another vaccination. I believe it is the Tdap vaccine. The only other state that doesn't offer a religious or personal exemption is West Virginia. I have already asked my pediatrician about giving my son an exemption but he declined saying that the shot should not do any harm. We do have an apt. With a ped. Neurologist in July, and I will beg her for an exemption but I don't know what I will do if she declines. Getting a medical exemption seems like a very long complicated process. Do any of you have any experience with this? Any suggestions about what information I could print out and bring with me in July to try to convince a doctor to sign off on this? What can I do in the meantime? Should I seek out a DAN dr. I was thinking they may be more receptive to this type of thing, although my son is not autistic. If there are any other Mississippi moms on this forum who have any names of any doctors please pm me. Any advice is appreciated... Have any of you gotten this vaccine for your children after the pandas diagnosis and not had a problem? Maybe I am freaking out over nothing... Just more to worry about. Sorry, don't meant to hijack the thread. Ellen- I'm always thinking of your son and your family. Sending prayers.\n\nI think if you could connect with some parents of autistic kids in your state, they may have navigated the system and have advice for you. I would look for parent groups for kids on the spectrum, or look on Jenny McCarthy's website and contact an \"angel\" in your area. My kids are not autistic- but I was fortunate enough to connect with a mom of a son with autism and pandas (ugh!) who had been through this. She encouraged me to write the letter for religious exemption, and talked me through the wording a bit. Autism is not (in my state) acceptable as an exemption- so I am thinking it may be the same in your state. Is there no religious exemption? No there is no religious or personal exemption. Only a medical exemption... I am researching online right now and feeling helpless and screwed.... I called our district representatives office in the state dept. of health and they said that they have to receive all of the relevant information from our treating doctor and then will make a decision based on the circumstances. I am just highly perturbed right now that there is some beaurocrat sitting in his desk somewhere deciding who is worthy of his exemptions....why should the health and well being of our children ultimately be decided by one man. My son seems to be doing ok right now and is recovering from a recent strep infection, so if I take him into see a new doctor they would look at him right now and figure he was doing fine. I even asked if an exemption could be written by a doctor from outside of Mississippi and she said no it had to be a physician licensed in Mississippi. I had thought about paying for a phone consult from dr.k or dr.b. but that would be useless now as well. My options are very limited. I could not live with myself if I made him get this vaccine and it ultimately caused major damage. Especially knowing what I know now. I did get him fully vaccinated before kindergarten but that was before I knew of the pandas.", "opengraph": {"title": "Vaccine exemptions", "type": "website", "url": "https://latitudes.org/forums/topic/17499-vaccine-exemptions/", "description": "Ok, so, I am really starting to freak out. We live in Mississippi, one of only two states that doesn't allow for any type of vaccine exemption except the medical exemption for school vaccines. My son is entering the seventh grade in the fall and is required by law to get another vaccination. I be...", "updated_time": "2012-05-17T13:00:47Z", "site_name": "ACN Latitudes Forums", "locale": "en_US"}, "tags": ["1", "Report", "Share", "Prev", "Next", "Posted May 15, 2012", "Posted May 16, 2012", "2"], "tweets": [], "movies": [], "links": ["https://latitudes.org/forums/profile/14993-Missmom/", "https://latitudes.org/forums/profile/14993-Missmom/badges/", "https://latitudes.org/forums/profile/14993-Missmom/", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139710", "https://latitudes.org/forums/profile/14993-Missmom/", "https://latitudes.org/forums/profile/14993-Missmom/", "https://latitudes.org/forums/profile/14993-Missmom/content/", "#elControls_139710_menu", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=reportComment&comment=139710", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139710", "http://twitter.com/share?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139710", "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139710", "http://www.reddit.com/submit?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139710&title=Vaccine+exemptions", "mailto:?subject=Vaccine%20exemptions&body=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139710", "http://pinterest.com/pin/create/button/?url=https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment%26comment=139710&media=", "https://latitudes.org/forums/profile/14993-Missmom/", "https://latitudes.org/forums/profile/14993-Missmom/badges/", "https://latitudes.org/forums/profile/14993-Missmom/", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139722", "https://latitudes.org/forums/profile/14993-Missmom/", "https://latitudes.org/forums/profile/14993-Missmom/", "https://latitudes.org/forums/profile/14993-Missmom/content/", "#elControls_139722_menu", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=reportComment&comment=139722", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139722", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139722", "http://twitter.com/share?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139722", "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139722", "http://www.reddit.com/submit?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139722&title=Vaccine+exemptions", "mailto:?subject=Vaccine%20exemptions&body=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139722", "http://pinterest.com/pin/create/button/?url=https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment%26comment=139722&media=", "https://latitudes.org/forums/profile/3207-dut/", "https://latitudes.org/forums/profile/3207-dut/badges/", "https://latitudes.org/forums/profile/3207-dut/", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139725", "https://latitudes.org/forums/profile/3207-dut/", "https://latitudes.org/forums/profile/3207-dut/", "https://latitudes.org/forums/profile/3207-dut/content/", "#elControls_139725_menu", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=reportComment&comment=139725", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139725", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139725", "http://twitter.com/share?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139725", "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139725", "http://www.reddit.com/submit?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139725&title=Vaccine+exemptions", "mailto:?subject=Vaccine%20exemptions&body=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139725", "http://pinterest.com/pin/create/button/?url=https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment%26comment=139725&media=", "https://latitudes.org/forums/profile/3983-NancyD/", "https://latitudes.org/forums/profile/3983-NancyD/badges/", "https://latitudes.org/forums/profile/3983-NancyD/", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139727", "https://latitudes.org/forums/profile/3983-NancyD/", "https://latitudes.org/forums/profile/3983-NancyD/", "https://latitudes.org/forums/profile/3983-NancyD/content/", "#elControls_139727_menu", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=reportComment&comment=139727", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139727", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139727", "http://twitter.com/share?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139727", "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139727", "http://www.reddit.com/submit?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139727&title=Vaccine+exemptions", "mailto:?subject=Vaccine%20exemptions&body=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139727", "http://pinterest.com/pin/create/button/?url=https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment%26comment=139727&media=", "https://latitudes.org/forums/profile/3721-tpotter/", "https://latitudes.org/forums/profile/3721-tpotter/badges/", "https://latitudes.org/forums/profile/3721-tpotter/", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139732", "https://latitudes.org/forums/profile/3721-tpotter/", "https://latitudes.org/forums/profile/3721-tpotter/", "https://latitudes.org/forums/profile/3721-tpotter/content/", "#elControls_139732_menu", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=reportComment&comment=139732", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139732", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139732", "http://twitter.com/share?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139732", "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139732", "http://www.reddit.com/submit?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139732&title=Vaccine+exemptions", "mailto:?subject=Vaccine%20exemptions&body=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139732", "http://pinterest.com/pin/create/button/?url=https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment%26comment=139732&media=", "https://latitudes.org/forums/profile/14993-Missmom/", "https://latitudes.org/forums/profile/14993-Missmom/badges/", "https://latitudes.org/forums/profile/14993-Missmom/", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139733", "https://latitudes.org/forums/profile/14993-Missmom/", "https://latitudes.org/forums/profile/14993-Missmom/", "https://latitudes.org/forums/profile/14993-Missmom/content/", "#elControls_139733_menu", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=reportComment&comment=139733", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139733", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139733", "http://twitter.com/share?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139733", "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139733", "http://www.reddit.com/submit?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139733&title=Vaccine+exemptions", "mailto:?subject=Vaccine%20exemptions&body=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139733", "http://pinterest.com/pin/create/button/?url=https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment%26comment=139733&media=", "https://latitudes.org/forums/profile/3747-dcmom/", "https://latitudes.org/forums/profile/3747-dcmom/badges/", "https://latitudes.org/forums/profile/3747-dcmom/", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139734", "https://latitudes.org/forums/profile/3747-dcmom/", "https://latitudes.org/forums/profile/3747-dcmom/", "https://latitudes.org/forums/profile/3747-dcmom/content/", "#elControls_139734_menu", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=reportComment&comment=139734", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139734", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139734", "http://twitter.com/share?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139734", "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139734", "http://www.reddit.com/submit?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139734&title=Vaccine+exemptions", "mailto:?subject=Vaccine%20exemptions&body=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139734", "http://pinterest.com/pin/create/button/?url=https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment%26comment=139734&media=", "https://latitudes.org/forums/profile/4018-Ellen/", "https://latitudes.org/forums/profile/4018-Ellen/badges/", "https://latitudes.org/forums/profile/4018-Ellen/", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139744", "https://latitudes.org/forums/profile/4018-Ellen/", "https://latitudes.org/forums/profile/4018-Ellen/", "https://latitudes.org/forums/profile/4018-Ellen/content/", "#elControls_139744_menu", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=reportComment&comment=139744", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139744", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139744", "http://twitter.com/share?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139744", "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139744", "http://www.reddit.com/submit?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139744&title=Vaccine+exemptions", "mailto:?subject=Vaccine%20exemptions&body=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139744", "http://pinterest.com/pin/create/button/?url=https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment%26comment=139744&media=", "https://latitudes.org/forums/profile/14993-Missmom/", "https://latitudes.org/forums/profile/14993-Missmom/badges/", "https://latitudes.org/forums/profile/14993-Missmom/", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139749", "https://latitudes.org/forums/profile/14993-Missmom/", "https://latitudes.org/forums/profile/14993-Missmom/", "https://latitudes.org/forums/profile/14993-Missmom/content/", "#elControls_139749_menu", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=reportComment&comment=139749", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139749", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139749", "http://twitter.com/share?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139749", "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139749", "http://www.reddit.com/submit?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139749&title=Vaccine+exemptions", "mailto:?subject=Vaccine%20exemptions&body=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139749", "http://pinterest.com/pin/create/button/?url=https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment%26comment=139749&media=", "https://latitudes.org/forums/profile/3860-philamom/", "https://latitudes.org/forums/profile/3860-philamom/badges/", "https://latitudes.org/forums/profile/3860-philamom/", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139753", "https://latitudes.org/forums/profile/3860-philamom/", "https://latitudes.org/forums/profile/3860-philamom/", "https://latitudes.org/forums/profile/3860-philamom/content/", "#elControls_139753_menu", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=reportComment&comment=139753", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139753", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139753", "http://twitter.com/share?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139753", "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139753", "http://www.reddit.com/submit?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139753&title=Vaccine+exemptions", "mailto:?subject=Vaccine%20exemptions&body=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139753", "http://pinterest.com/pin/create/button/?url=https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment%26comment=139753&media=", "https://latitudes.org/forums/profile/4018-Ellen/", "https://latitudes.org/forums/profile/4018-Ellen/badges/", "https://latitudes.org/forums/profile/4018-Ellen/", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139754", "https://latitudes.org/forums/profile/4018-Ellen/", "https://latitudes.org/forums/profile/4018-Ellen/", "https://latitudes.org/forums/profile/4018-Ellen/content/", "#elControls_139754_menu", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=reportComment&comment=139754", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139754", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139754", "http://twitter.com/share?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139754", "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139754", "http://www.reddit.com/submit?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139754&title=Vaccine+exemptions", "mailto:?subject=Vaccine%20exemptions&body=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139754", "http://pinterest.com/pin/create/button/?url=https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment%26comment=139754&media=", "https://latitudes.org/forums/profile/3747-dcmom/", "https://latitudes.org/forums/profile/3747-dcmom/badges/", "https://latitudes.org/forums/profile/3747-dcmom/", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139756", "https://latitudes.org/forums/profile/3747-dcmom/", "https://latitudes.org/forums/profile/3747-dcmom/", "https://latitudes.org/forums/profile/3747-dcmom/content/", "#elControls_139756_menu", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=reportComment&comment=139756", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139756", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139756", "http://twitter.com/share?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139756", "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139756", "http://www.reddit.com/submit?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139756&title=Vaccine+exemptions", "mailto:?subject=Vaccine%20exemptions&body=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139756", "http://pinterest.com/pin/create/button/?url=https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment%26comment=139756&media=", "https://latitudes.org/forums/profile/14993-Missmom/", "https://latitudes.org/forums/profile/14993-Missmom/badges/", "https://latitudes.org/forums/profile/14993-Missmom/", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139768", "https://latitudes.org/forums/profile/14993-Missmom/", "https://latitudes.org/forums/profile/14993-Missmom/", "https://latitudes.org/forums/profile/14993-Missmom/content/", "#elControls_139768_menu", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=reportComment&comment=139768", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139768", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139768", "http://twitter.com/share?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139768", "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139768", "http://www.reddit.com/submit?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139768&title=Vaccine+exemptions", "mailto:?subject=Vaccine%20exemptions&body=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139768", "http://pinterest.com/pin/create/button/?url=https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment%26comment=139768&media=", "https://latitudes.org/forums/profile/3860-philamom/", "https://latitudes.org/forums/profile/3860-philamom/badges/", "https://latitudes.org/forums/profile/3860-philamom/", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139769", "https://latitudes.org/forums/profile/3860-philamom/", "https://latitudes.org/forums/profile/3860-philamom/", "https://latitudes.org/forums/profile/3860-philamom/content/", "#elControls_139769_menu", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=reportComment&comment=139769", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139769", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139769", "http://twitter.com/share?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139769", "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139769", "http://www.reddit.com/submit?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139769&title=Vaccine+exemptions", "mailto:?subject=Vaccine%20exemptions&body=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139769", "http://pinterest.com/pin/create/button/?url=https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment%26comment=139769&media=", "https://latitudes.org/forums/profile/3860-philamom/", "https://latitudes.org/forums/profile/3860-philamom/badges/", "https://latitudes.org/forums/profile/3860-philamom/", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139770", "https://latitudes.org/forums/profile/3860-philamom/", "https://latitudes.org/forums/profile/3860-philamom/", "https://latitudes.org/forums/profile/3860-philamom/content/", "#elControls_139770_menu", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=reportComment&comment=139770", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139770", "https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment&comment=139770", "http://twitter.com/share?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139770", "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139770", "http://www.reddit.com/submit?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139770&title=Vaccine+exemptions", "mailto:?subject=Vaccine%20exemptions&body=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F17499-vaccine-exemptions%2F%3Fdo%3DfindComment%26comment%3D139770", "http://pinterest.com/pin/create/button/?url=https://latitudes.org/forums/topic/17499-vaccine-exemptions/?do=findComment%26comment=139770&media="], "authors": [], "publish_date": "May 15, 2012"}