{"result_id": "008041", "URL": "https://latitudes.org/vaccine-research-thimerosal-tics/", "timestamp": "2023-04-25 11:46:54 CEST+0200", "meta": {"description": "As our readers would know, Latitudes.org is not an anti-vaccine site. Yet, we review studies that could be relevant for those concerned with neurological", "lang": "en", "keywords": "", "favicon": "https://acn-latitudes-acn.netdna-ssl.com/wordpress/wp-content/uploads/2013/07/acn-favicon-16.ico", "canonical": "https://latitudes.org/vaccine-research-thimerosal-tics/", "encoding": "UTF-8"}, "image": null, "domain": "latitudes.org", "title": "Vaccines as a Trigger for Tics and Tourette Syndrome", "cleaned_text": "As our readers would know, Latitudes.org is not an anti-vaccine site. Yet, we review studies that could be relevant for those concerned with neurological conditions. Everyone is biologically different, and people need to be able to make educated decisions on vaccines for themselves and loved ones.\n\nStudies have not been completed on specific vaccines and tics, with or without thimerosal, which has now been phased out of most, but not all, vaccines in the USA. See ingredients in vaccines here and CDC info on vaccines and thimerosal here.\n\nThis article summarizes four studies on the use of thimerosal in vaccines and its effect on neurodevelopmental delays.\n\nThe research was published between 2004 and 2008.\n\nIt is striking that the development of tics was the most common consequence of thimerosal exposure based on the study of select conditions. We should point out that there is some controversy regarding the statistical approaches used in the different studies, particularly because some studies do not show a link to autism while others do.\n\nTo read the abstracts for each study, click on the links below. Our short summary is provided to show the consistent tic connection. As you will see, other neurological conditions were also found to be negatively affected by the thimerosal.\n\nThis discovery on the relationship between the toxin methylmercury and the development of tics is hugely important. First, it highlights the relationship between tics and neurotoxins. This should put families on alert that they should not only avoid all exposures to toxins but should also consider evaluation for toxic overload, with follow-up treatment plans developed as needed. Second, given the results of this research, thimerosal exposure should be avoided by those with tics and Tourette syndrome as well as pregnant women. It is currently standard in flu vaccines, but you can request to have the vaccine without the preservative thimerosal.\n\nDon’t believe it? Read for yourself\n\nRelative risks for neurodevelopmental disorders were calculated per increase of 12.5 micro g of estimated cumulative mercury exposure from TCVs in the first, third, and seventh months of life. Results: In phase I at HMO A, cumulative exposure at 3 months resulted in a significant positive association with tics. Verstraeten, Davis, DeStefano et al; Pediatrics. 2003 Nov;112(5):1039-48\n\nThimerosal exposure in infants and developmental disorders: a retrospective cohort study in the United kingdom does not support a causal association.\n\nThimerosal exposure in infants and developmental disorders: a retrospective cohort study in the United kingdom does not support a causal association. With the possible exception of tics, there was no evidence that thimerosal exposure via DTP/DT vaccines causes neurodevelopmental disorders. Andrews, Miller, Grant et al Pediatrics. 2004 Sep;114(3):584-91\n\nThimerosal exposure in infants and neurodevelopmental disorders: an assessment of computerized medical records in the Vaccine Safety Datalink.\n\nSummarized results: Consistent significantly increased rate ratios were observed for autism, autism spectrum disorders, tics, attention deficit disorder, and emotional disturbances with Hg exposure from TCVs. Geier & Geier J Neurol Sci. 2008 Aug 15;271(1-2):110-8. Epub 2008 May\n\nA two-phased population epidemiological study of the safety of thimerosal-containing vaccines: a follow-up analysis.\n\n. . . significant associations between cumulative exposures to thimerosal and the following types of NDs: unspecified developmental delay, tics, attention deficit disorder (ADD), language delay, speech delay, and neurodevelopmental delays in general. Geier & Geier Med Sci Monit. 2005 Apr;11(4):CR160-70. Epub 2005 Mar 24\n\nNote:\n\n To stay current on vaccine issues see the website for the National Vaccine Information Center", "opengraph": {"locale": "en_US", "type": "article", "title": "Vaccines as a Trigger for Tics and Tourette Syndrome | ACN Latitudes", "description": "As our readers would know, Latitudes.org is not an anti-vaccine site. Yet, we review studies that could be relevant for those concerned with neurological", "url": "https://latitudes.org/vaccine-research-thimerosal-tics/", "site_name": "ACN Latitudes", "article:publisher": "http://www.facebook.com/ACNLatitudes", "article:author": "http://facebook.com/ACNLatitudes", "article:tag": "vaccines", "article:section": "Tics and Tourette Syndrome", "updated_time": "2021-08-17T15:30:53-04:00", "image": "https://latitudes.org/wordpress/wp-content/uploads/2013/11/vaccines-tics-timerosal-2.jpg", "image:secure_url": "https://latitudes.org/wordpress/wp-content/uploads/2013/11/vaccines-tics-timerosal-2.jpg", "image:width": "528", "image:height": "325", "image:alt": "Vaccines as a Trigger for Tics and Tourette Syndrome", "image:type": "image/jpeg", "article:published_time": "2014-09-04T23:20:26-04:00", "article:modified_time": "2021-08-17T15:30:53-04:00"}, "tags": ["pregnancy", "Tourettes Prevention & Treatment", "Tourettes Resources & Research", "tics", "vaccines", "Tics and Tourette Syndrome", "thinerosal", "tourette"], "tweets": [], "movies": [], "links": ["#", "#", "#", "https://www.linkedin.com/shareArticle?mini=true&ro=true&trk=EasySocialShareButtons&title=Vaccines+as+a+Trigger+for+Tics+and+Tourette+Syndrome&url=https%3A%2F%2Flatitudes.org%2Fvaccine-research-thimerosal-tics%2F", "#", "https://www.cdc.gov/vaccines/pubs/pinkbook/downloads/appendices/B/excipient-table-2.pdf", "https://www.cdc.gov/vaccinesafety/concerns/thimerosal/index.html", "http://www.ncbi.nlm.nih.gov/pubmed/14595043", "http://www.ncbi.nlm.nih.gov/pubmed/15342825", "http://www.ncbi.nlm.nih.gov/pubmed/18482737", "http://www.ncbi.nlm.nih.gov/pubmed/15795695?ordinalpos=1&itool=EntrezSystem2.PEntrez.Pubmed.Pubmed_ResultsPanel.Pubmed_DefaultReportPanel.Pubmed_RVDocSum", "https://thevaccinereaction.org", "#", "#"], "authors": [], "publish_date": "2014-09-04T23:20:26-04:00"}