{"result_id": "008050", "URL": "https://latitudes.org/forums/topic/3754-vaccines/", "timestamp": "2023-04-25 11:46:59 CEST+0200", "meta": {"description": "My teen just came home from the doctor, and came out with \"recommendations\" for 3 vaccines! Honestly, I thought we were done. They are for meningococcal meningitis, Hepatitis A, and MMR. Anyone else out there with older kids. I am pretty sure these weren't on the list a few years ago (maybe the m...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://latitudes.org/forums/topic/3754-vaccines/", "encoding": "utf-8"}, "image": null, "domain": "latitudes.org", "title": "Vaccines", "cleaned_text": "My understanding is that it is very difficult to get a medical exemption across the board, even from a DAN Dr. You may be able to get one for a particular vaccine for a period of time, but not one that will exempt medically indefinitely. Personally, I feel a religious exemption is the best way to go, if you are not in a state where they are drilling parents, sometimes in front of a \"panel\" regarding their beliefs, which I thought was totally illegal. I have read in several places that religious beliefs were not to be questioned, nor should you volunteer any info in that area. Just a brief statement like \" Due to our strictly held religious beliefs, we are opting out of the vaccination program at this time. \" The child's name etc. has to be included. You can use the link that someone posted here, to get the form from your state, and change the format to something that you are more comfortable with. Our state form says something like, \"I understand that not vaccinating is placing my child and others at risk.\" This is a statement that I would NOT sign, but would use some of the language from the state letter as a guide, if I were filing philosophical.\n\nMy boys records were checked when entering Jr. High and High school, which happened for both boys last year. We JUST made it, without having to file. We had just a couple of months before the TdaP was required. It will not be checked this year as a 7th grader and sophomore. If the 2nd varicella is mandatory, we will be flagged tho, and the dreaded note will come home. I should get our exemption in place too.\n\nI think a philosophical exemption is easier in states that allow it, but if the \"powers that be,\" have their way and philosophical exemptions are no longer accepted in the future, my feeling is that religious exemptions may be grandfathered in (possibly).\n\nTalk about human rights violations. If I had a daughter that was being required to complete the Gardisil series (HPV vaccine) I have no doubt, I would be sitting in jail! That statement goes for many of the vaccines that are now mandatory. If I could turn back time, there are maybe two, that I would consider at an older age than the current schedule, and I'm not even certain I would do those. Just my personal feelings.\n\nYou can read posts from others discussing exemptions here", "opengraph": {"title": "Vaccines", "type": "website", "url": "https://latitudes.org/forums/topic/3754-vaccines/", "description": "My teen just came home from the doctor, and came out with \"recommendations\" for 3 vaccines! Honestly, I thought we were done. They are for meningococcal meningitis, Hepatitis A, and MMR. Anyone else out there with older kids. I am pretty sure these weren't on the list a few years ago (maybe the m...", "updated_time": "2008-08-25T15:49:24Z", "site_name": "ACN Latitudes Forums", "locale": "en_US"}, "tags": ["Posted August 25, 2008", "Share", "Report", "Posted August 23, 2008"], "tweets": [], "movies": [], "links": ["http://www.mothering.com/discussions/forumdisplay.php?f=47"], "authors": [], "publish_date": "August 23, 2008"}