{"result_id": "008011", "URL": "https://latitudes.org/forums/topic/18077-meningococcal-vaccination/", "timestamp": "2023-04-25 11:46:36 CEST+0200", "meta": {"description": "DS 14 has been in PANDAS symptom remission for 100 days (yay!). Pediatrician wants to know when he will get meningitis vaccine. I know some kids get recurrence of PANDAS symptoms from vaccines. I also know that a lot of teens get meningitis and it can be very serious. If you were us, would you go...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://latitudes.org/forums/topic/18077-meningococcal-vaccination/", "encoding": "utf-8"}, "image": null, "domain": "latitudes.org", "title": "Meningococcal Vaccination", "cleaned_text": "Let me just share my menigitis vaccine story with you.\n\nMy daugther had to get it before entering 6th grade. I was ok with it as I felt the need to \"protect her brain\" after she'd had a severe pandas/chorea episode and had been symptom free for about 3 months. She got the vaccine, and in less than a week began showing symptoms of another pandas/chorea episode, which got rapidly worse within a week. To be fair, at this point, within a week of her getting the vaccine, both of my kids tested positive for strep, which was quite obvious at that point, even before they rapid tested them, which were both immediately highly positive. Ped immediately put them both on suprax, which cured little one, but older pandas kid declined rapidly to the point where she was immobile with severe almost total body chorea. Neuro immediately put her on clindamycin and prednisone, and ped threw in some valium. She was back to normal within a week.\n\nI'll never know if it was the strep that touched off that episode, but the timing was so coincidental I still wonder about it. Dr. T said absolutely no more vaccines, which is a moot point now as she's had them all, but I'd never get her another vaccine.", "opengraph": {"title": "Meningococcal Vaccination", "type": "website", "url": "https://latitudes.org/forums/topic/18077-meningococcal-vaccination/", "description": "DS 14 has been in PANDAS symptom remission for 100 days (yay!). Pediatrician wants to know when he will get meningitis vaccine. I know some kids get recurrence of PANDAS symptoms from vaccines. I also know that a lot of teens get meningitis and it can be very serious. If you were us, would you go...", "updated_time": "2012-07-31T08:04:42Z", "site_name": "ACN Latitudes Forums", "locale": "en_US"}, "tags": ["Report", "Share", "Posted July 28, 2012", "Posted July 30, 2012", "Posted July 31, 2012", "Posted July 29, 2012"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "July 28, 2012"}