{"result_id": "008003", "URL": "https://latitudes.org/forums/topic/22842-pertussiswhooping-cough/", "timestamp": "2023-04-25 11:46:31 CEST+0200", "meta": {"description": "Anyone have any experience with Whooping Cough exposure/infection in their Pandas/Pans kids????? We have 3 kiddos exposed to a cousin that is confirmed infected. One dd is severely coughing as of late and she is vaccinated prior. She is 8yso. Just trying to figure out a protocol if any, things we...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://latitudes.org/forums/topic/22842-pertussiswhooping-cough/", "encoding": "utf-8"}, "image": null, "domain": "latitudes.org", "title": "Pertussis/Whooping Cough", "cleaned_text": "I wasn't going to scare you but I can tell you exactly what it's like. Starts like a cold that turns into a bad coughing cold. I had no diarrhea. ANYTHING can set the coughing spasms off. Starting to laugh, for one. When they start, you CANNOT catch your breath. You cough out all the air in your lungs. The 'whoop' you hear is the person trying to draw in air. It's VERY difficult to do. You feel you will not get enough air, which makes it all that much harder to draw it in. It's VERY SCARY.\n\nAt the worst of it, one night, I could not get my breath and I tried to tell my husband to call 911. I had NO air and could only mouth it. To my horror, he got up out of bed and wandered off to the kitchen. I collapsed on the floor, preparing to die but telling myself to relax and remain calm. Slowly and I mean slowly, I could start taking tiny bits of air. He returned with a glass of water, which I laugh about now.\n\nThat's when I was diagnosed. Had no idea I had whooping cough. Too late for anything to help me and I had explored untold numbers of people. I learned to relax through the coughing fits.\n\nI got it from my friend who gave it to her husband, me and my husband. Of the three, I had it the worst and the longest. It started in late May and I was still having coughing fits set off from laughter or clearing my throat, etc.... for three months. It gradually faded away. We were all late 30's/early 40's. We figure my friend got it from one of her high school students.\n\nBe vigilant during coughing fits and encourage a child to relax and stay calm.", "opengraph": {"title": "Pertussis/Whooping Cough", "type": "website", "url": "https://latitudes.org/forums/topic/22842-pertussiswhooping-cough/", "description": "Anyone have any experience with Whooping Cough exposure/infection in their Pandas/Pans kids????? We have 3 kiddos exposed to a cousin that is confirmed infected. One dd is severely coughing as of late and she is vaccinated prior. She is 8yso. Just trying to figure out a protocol if any, things we...", "updated_time": "2014-06-19T15:49:30Z", "site_name": "ACN Latitudes Forums", "locale": "en_US"}, "tags": ["Share", "Posted June 18, 2014", "Posted June 19, 2014", "Report"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "June 18, 2014"}