{"result_id": "008051", "URL": "https://latitudes.org/forums/topic/16283-pandas-vaccine-injury/", "timestamp": "2023-04-25 11:47:00 CEST+0200", "meta": {"description": "Well I haven't been here for a while. My dd is almost 10 and doing quite well. We are weaing abx at this time and holding steady. Daily epsom baths have been great!! Anyway,I don't want to ramble but I feel I have been enlightened and want to share. Quick review: DD had \"quirks\"since about 1 1/2 ...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://latitudes.org/forums/topic/16283-pandas-vaccine-injury/", "encoding": "utf-8"}, "image": null, "domain": "latitudes.org", "title": "PANDAS vaccine injury?", "cleaned_text": "Hmmm. I looked at the website. The creator (Marcella) is NOT a neuropsychiatrist (no medical degree). She does have a MS in psychology.\n\nI was looking at this blog she wrote in regards to the Le Roy girls http://vaxtruth.org/2012/01/the-leroy-twelve-is-now-fifteen-students-set-to-see-pandas-doctor-today-are-vaccines-involved/\n\nShe seems to have a key misunderstanding about PANDAS...she keeps writing about bacterial and viral infection gaining access to the brain (eg. \"Bacterial and viral infections do not gain access to the brain unless the blood brain barrier is damaged.\" and in a related blog \"I have complete confidence that Dr. Triffiletti will be able to tell the parents of The LeRoy Twelve exactly which infectious bacteria has invaded their children’s brains...\" and \"Bacteria are larger than viruses. If bacteria can get through the holes created in the BBB...\" and \"PANDAS has been identified as the result of an autoimmune attack on particular brain structures as a result of bacteria that crosses the BBB.\" ) I get the impression (am I reading it wrong?) that she thinks the BACTERIA itself (eg. strep)actually enters the brain in PANDAS. There is NO MENTION of antibodies, no mention of molecular mimicry.\n\nIt kind of makes me nervous that somebody who is supposedly an \"expert\" (treats children with PANDAS and has a child with PANDAS, blogs about PANDAS) is missing out on this really important concept! (What else is she missing out on? Certainly I'm not going to spend lots more time examining her website...)\n\nIf anybody is going to quibble with me, saying \"well, we don't know, maybe the strep DOES enter the brain\"...don't forget the mouse models. (To quote Scientific American) \"Then they purify the antibodies from those mice, inject them in another mouse that never had strep, and that mouse gets the neuropsychiatric symptoms, too. That shows it's the antibodies doing the damage.\" We have really good evidence the antibodies cross the BBB. There's really nothing to show that Strep itself crosses the BBB. Plus, if it were the STREP in the brain itself, then Plasmapheresis wouldn't work (since it just removes the anti-bodies, it doesn't suck strep out of the brain.)\n\nShe's also pretty heavy-handed, anti-long term antibiotics. And seems convinced that vaccines are the PRIMARY cause of PANDAS (okay folks, remember, those mice didn't get ANY vaccines).\n\nNow, I am not going to argue that vaccines (and even the STRESS of the vaccines, esp. in a small child) aren't going to cause problems or trigger an exacerbation ONCE THE WHEELS OF PANDAS ARE SET IN MOTION. But she is taking it to the next level. (NOTE: I am talking about PANDAS, I don't have enough information to really speak in terms of Autism...but this is the PANDAS/PITANDS section of the forum, and my child isn't autistic, so I'm not speaking to that).\n\nI guess you could accuse me of being a stickler for getting one's science correct (to the best of our ability). That is why I also have issues with Beth Maloney (eg \"ASO is THE test for PANDAS\"). I think it's okay for a NEWBIE to be getting these concepts wrong. By the time someone is a self-proclaimed expert (writing books, making your own website or organization), well, it's time to get your facts straight.\n\nOkay, call me mean...\n\nBut, I really hate to see these wonderful caring intelligent parents (you guys) beating themselves up over having given early childhood vaccines. Honestly, if I could turn back time (11-12 years), I would STILL give my dd's her baby/childhood vaccines (without Tylenol of course). I probably wouldn't do any extra vaccines (eg flu shots). The thing I would have done ABSOLUTELY differently, is every time my child came in with a FEVER or Vomiting or was otherwise SICK (including strange behavior), I would have demanded a strep test. To me, that is the real cause of my dd's PANDAS, not vaccines. My dd did NOT receive ONE single strep test at ANY of her sick visits. EVERY single FEVER was presumed to be viral (by multiple doctors). Even when she came in with a classic early PANDAS sign (frequent urination) which preceded a FEVER by 3 days, she didn't receive a strep test. I have not idea how many times (or years) she had chronic untreated strep. It took my dh threatening the hospital staff (while my dd at age 7 was in the hospital for acute food refusal/severe OCD) to get our first strep test (\"gee, her throat doesn't look sore\"), which turned out to POSITIVE (as was her sister's).\n\nI know others may disagree, but I can not honestly say, that my dd's PANDAS was in any way percipitated by her vaccinations. Will I vaccinate her now (Whooping cough, HPV) for non-critical vaccines...NO. Did I vaccinate her for H1N1 (nope!--but when she actually got H1N1 from disneyland exposure it resulted in a pretty \"nice\" exacerbation--would the vaccine have been any better or worse? who knows). But that is something else. That's me not wanting her exposed to triggers while she's healing. I completely agree that a child who already has PANDAS should be extremely leary of vaccines and that vaccines can cause problems in that situation. But, that is not the same as saying, it was the vaccines that caused it all in the first place. To me that's Strep (or even Mycoplasma or Lyme for those with those diagnoses). Period.", "opengraph": {"title": "PANDAS vaccine injury?", "type": "website", "url": "https://latitudes.org/forums/topic/16283-pandas-vaccine-injury/", "description": "Well I haven't been here for a while. My dd is almost 10 and doing quite well. We are weaing abx at this time and holding steady. Daily epsom baths have been great!! Anyway,I don't want to ramble but I feel I have been enlightened and want to share. Quick review: DD had \"quirks\"since about 1 1/2 ...", "updated_time": "2012-05-08T19:29:40Z", "site_name": "ACN Latitudes Forums", "locale": "en_US"}, "tags": ["Share", "Prev", "Feb 15 2012 15 posts", "Feb 14 2012 9 posts", "Feb 3 2012 20 posts", "Next", "Feb 14 9", "1", "Report", "Feb 2 11", "Posted February 2, 2012", "Feb 2 2012 11 posts", "3", "Posted February 3, 2012", "Feb 3 20", "5", "6", "4", "Feb 15 15", "2"], "tweets": [], "movies": [], "links": ["http://vaxtruth.org/2012/01/the-leroy-twelve-is-now-fifteen-students-set-to-see-pandas-doctor-today-are-vaccines-involved/"], "authors": [], "publish_date": "February 2, 2012"}