{"result_id": "008025", "URL": "https://latitudes.org/forums/topic/25882-my-23-year-old-who-is-13-years-pandas-free-with-likely-recent-pans-episode-has-had-covid-vaccine/", "timestamp": "2023-04-25 11:46:43 CEST+0200", "meta": {"description": "I don’t post much but am a long time member. I first posted in 2010 over a year after my daughter recovered from a severe 1 year long episode of PANDAS anorexia. That post is still available if you do a search. She was 10 and had overnight sudden onset severe anorexia /OCD. She had high aso titer...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://latitudes.org/forums/topic/25882-my-23-year-old-who-is-13-years-pandas-free-with-likely-recent-pans-episode-has-had-covid-vaccine/", "encoding": "utf-8"}, "image": null, "domain": "latitudes.org", "title": "My 23 year old who is 13 years PANDAS free with likely recent PANS episode (has had COVID vaccine)", "cleaned_text": "I don’t post much but am a long time member. I first posted in 2010 over a year after my daughter recovered from a severe 1 year long episode of PANDAS anorexia. That post is still available if you do a search. She was 10 and had overnight sudden onset severe anorexia /OCD. She had high aso titers for almost a year. There were very few people who could help us at the time so it took 3 months to even figure out the issue. She eventually returned to normal almost as suddenly as it came on. She has been great ever since. I posted another update in 2016 when she was starting college. She had no further PANDAS related issues until this year. She rarely was sick (probably because of her over reactive immune system) but we always continued to have her tested for strep even with a slight sore throat.\n\nShe graduated from college in May of 2020. She was accepted to medical school later in 2020 and started in July of this year (2021). Her school was very pushy with the COVID vaccine which we did not want her to get but she got it anyway because she felt she was going to be prevented from fully participating in everything without the vaccine. I am not anti vax at all. We did delay her 12 y/o vaccines until she was 15 and she got them all separately. I just felt like the COVID vaccine risk vs benefit for her did not warrant it at all. Nevertheless, she received the vaccine in early June. When she started school in July she was loving school! She had met many new friends and was doing great.\n\nFast forward to the last weekend of August, I received a call at 3 am from my daughter. She said for the last 24 hours she has had very severe anxiety and could not sleep at all. She said it started in the middle of the night before so she had not slept in almost 2 days. Things were getting really bad and we had to fly her home. She proceeded to be unable to sleep as well as unable to study. She said she was having trouble concentrating on even simple usually easy tasks. She was completely non functional as a medical student and after a few days took a short term leave from school.\n\nBefore we even flew her home she had seen a psychiatrist who immediately put her on buspirone and gave her something to help her sleep. She was able to get small blocks of sleep at least but the anxiety was unchanged. She was able to eat but not eating very well. My normally super independent grown daughter was unable to make any decision and she was also frequently coming in my room at night and sleeping on the floor as if she were a child. She was a completely different person and we felt it had to be a PANDAS type situation.\n\nFortunately a lot has changed in 13 years and we were able to get her in with an autoimmune neurology specialist. She typically saw pediatric patients but agreed to see my daughter due to her past history and her current situation. We did extensive blood work. This time the strep was negative. She had a positive monospot test (no recent illnesses) but her Epstein Barr numbers came back negative. She tested positive for both IgG and IgM antibodies for micoplasma (again no recollection of feeling poorly). She was given a course of antibiotics. We weren’t seeing any changes for the better. The buspirone was not seeming to help her anxiety/OCD at all. She said the only difference was she was not experiencing the physical symptoms she was the first week or so like the racing heart rate.\n\nThe difficult part of this happening to your grown child is that they get to make their medical decisions. She was convinced that this was not autoimmune related and was annoyed I was asking the doctor about the vaccine. She kept blaming herself for everything. It was very hard to watch my typically positive energetic confident daughter turn into a self doubting mess. The doctor wanted to put her on a 5 week course of steroids but she was pushing back saying it would make her gain weight. She was not getting better and started getting pretty depressed. About 8 weeks into this (and 9 pounds lighter) with no improvement she made the difficult decision to take an extended leave from school and she agreed to start the steroid.\n\nAt the same time, her psychiatrist put her on a low dose antidepressant. Literally a day after starting the steroid I noticed some changes in her mood and she seemed to be doing a little better. She was sleeping better too. She still was definitely having struggles but there was a definite improvement. Some time during about the third week of the steroid she became much better…almost to baseline. It has now been almost another 3 weeks and I feel her demeanor is mostly back to her normal happy self. She is eating well and has put back on a few needed pounds).\n\nThis was, however, a big blow to her confidence as a medical student. She still believes it might have just been her being stressed but her dad and I know better. She will continue with counseling that we started to help her get her confidence back so she can hopefully return to school as the same caliber student they admitted. We still do not know for sure what caused this to happen after so long. My guess is that it was either the micoplasma or the COVID vaccine or perhaps both. Something turned her monospot positive too but it was not mono.\n\nWe will be seeing her doctor in another couple of weeks and hopefully get blood work done again. I can tell you one thing is for sure. As they say…”out of abundance of caution” she will not be getting any COVID boosters. I just wanted to reiterate that I’m not antivax. I think the COVID vaccine has saved many lives. I just think that there is a possibility that it could play some role in autoimmunity. We just don’t know the answer yet. Until then everyone has to do that they think is best for their own situation. I just wanted to add my daughter’s story as just another case history.", "opengraph": {"title": "My 23 year old who is 13 years PANDAS free with likely recent PANS episode (has had COVID vaccine)", "type": "website", "url": "https://latitudes.org/forums/topic/25882-my-23-year-old-who-is-13-years-pandas-free-with-likely-recent-pans-episode-has-had-covid-vaccine/", "description": "I don’t post much but am a long time member. I first posted in 2010 over a year after my daughter recovered from a severe 1 year long episode of PANDAS anorexia. That post is still available if you do a search. She was 10 and had overnight sudden onset severe anorexia /OCD. She had high aso titer...", "updated_time": "2022-10-02T05:34:26Z", "site_name": "ACN Latitudes Forums", "locale": "en_US"}, "tags": ["1", "Report", "Posted January 2, 2022", "Posted December 10, 2021", "Posted January 3, 2022", "Posted July 15, 2022", "Posted June 13, 2022", "Share", "Posted April 5, 2022", "Posted May 10, 2022", "Posted December 7, 2021", "Posted April 13, 2022", "Posted May 11, 2022", "Posted October 2, 2022", "Posted April 12, 2022", "Posted January 4, 2022", "Posted May 17, 2022", "2"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "December 7, 2021"}