{"result_id": "008001", "URL": "https://latitudes.org/forums/topic/23596-vaccine-exemptions-in-ca/", "timestamp": "2023-04-25 11:46:29 CEST+0200", "meta": {"description": "A bill has been proposed in CA to eliminate the personal belief and religious exemption for vaccines (SB277). If you live in CA and feel it's important that parents maintain the right to refuse or choose the timing of vaccines and other medical procedures/medicines for their children, please join...", "lang": "en", "keywords": "vaccines, personal belief exemption, religious exemption", "favicon": "", "canonical": "https://latitudes.org/forums/topic/23596-vaccine-exemptions-in-ca/", "encoding": "utf-8"}, "image": null, "domain": "latitudes.org", "title": "Vaccine Exemptions in CA", "cleaned_text": "Posted on babycenter, I'm copying here just in case:\n\nBetween December 17-20, 2014, measles arrived at the happiest place on earth and all broke loose. Anti-vaxxers were shamed and maligned by everyone from Jon Stewart, Jimmy Kimmel to Dr. Richard Pan.\n\nAccording to the California Department of Public Health's latest measles surveillance report (3/6/15), since December of 2014, there have been 132 confirmed measles cases reported in California residents out of a population of 38.8 million.\n\n40 cases visited Disneyland during the period in question.\n\n56% were over the age of twenty.\n\n18% were between the ages of five to nineteen.\n\n19 cases were between the ages of one through four.\n\n15 cases were under the age of one.\n\nThis affected exactly 34 kids from birth to age four.\n\nSince the Sandy Hook elementary school shooting in December of 2012, there have been 109 school shootings and no legislation.\n\nThere is no measles epidemic. There is, however, an epidemic of vaccine legislation.\n\nCurrently, there are three bills in the California state legislature regarding vaccines: SB-277, SB-792 and AB-1117.\n\nSB-277 focuses on eliminating personal belief exemptions which in California includes religious exemptions.\n\nIts aim is listed below:\n\n(a) A means for the eventual achievement of total immunization of appropriate age groups against the following childhood diseases:\n\nOnly one company manufactures the polio vaccine and that's Sanofi. Only one company manufactures the varicella vaccine and that's Merck. Only one company has a monopoly on the mumps vaccine in the United States and that's Merck. Only one pharmaceutical company profits from the sale of all the vaccines on this list and that's Merck (Merck and Sanofi Pasteur are a global joint venture).\n\nThe proposed legislation has nothing to do with a measles epidemic. There is no public health crisis that requires ten mandated vaccines, with an eleventh option of any vaccine \"deemed appropriate.\"\n\nThis is an attempt by Merck and the politicians they fund to capitalize on a measles outbreak, one they may actually be responsible for and can profit from.\n\nCalifornia's Political Reform Act of 1974 is designed to ensure that:\n\n- State and local government serve all citizens equally, without regard to status or wealth.\n\n- Public officials perform their duties impartially, without bias because of personal financial interests or the interests of financial supporters.\n\n- Public officials disclose income and assets that could be affected by official actions and disqualify themselves from participating in decisions when they have conflicts of interest.\n\n- Public officials and private citizens are given the means to vigorously enforce political reforms.\n\n\"No public official at any level of state or local government shall make, participate in making, or in any way attempt to use his official position to influence a governmental decision in which he knows or has reason to know he has a financial interest.\" Even though the Supreme Court's decision on Citizens United upheld political spending as a form of protected speech under the First Amendment, it did not legalize financial conflicts of interest.\n\nSB-277 was introduced by Senators Dr. Richard Pan and Ben Allen.\n\nWe analyzed Merck's annual reports on corporate contributions from 2006-2014.\n\nHighlighted in green are legislators whose campaigns received contributions from Merck.\n\nListed below are some of the campaigns that received funding by year:\n\n2006 - Ed Hernandez for Assembly 2006, Wolk for Assembly 2006 and Dr. Ed Hernandez, O.D., Democrat for Assembly 2006.\n\n2008 - Kevin DeLeon for Assembly 2008, Friends of Bill Monning, Carol Liu for Senate\n\n2009 - Wolk for Senate 2012, Holly J. Mitchell for Assembly, Jerry Hill for State Assembly 2010, Tax Fighters for Anderson 2010\n\n2010 - Dr. Richard Pan for Assembly 2010, Friends of Bill Monning for Assembly 2010, Holly J. Mitchell for Assembly 2010, Kevin de Leon for Assembly 2010, Dr. Ed Hernandez, O.D., Democrat for Senate 2010, Wolk for Senate 2012\n\n2011 - Feinstein for Senate, Jerry Hill for Assembly 2012, Kevin De Leon for Senate 2014, Dr. Ed Hernandez, O.D., Democrat for Assembly 2014, Wolk for Senate 2012\n\n2012 - Bill Monning for Senate 2012, Jerry Hill for Senate 2012,Dr. Ed Hernandez for Senate 2014, Major General Richard D. Roth USAF (Ret.) for Senate 2012, Taxpayers for Bob Huff 2012, Feinstein for Senate\n\n2013 - Dr. Richard Pan for Senate 2014, Anthony Rendon for Assembly 2014, Hertzberg for Senate 2014, Holly J. Mitchell for Assembly 2014, Jerry Hill for Senate 2016, Kevin de Leon for Senate 2014, Dr. Ed Hernandez, O.D., Democrat for Senate 2014, Major General Richard D. Roth USAF (Ret,) for Senate 2016\n\n2014 - Jim Cooper for Assembly 2014, Holly J. Mitchell for Assembly for 2014, Kevin De Leon for Senate 2014, Vidak for Senate 2014\n\nNote how many Democrats currently in high positions of power were funded by Merck since the beginning of their careers and the ambitious titles of their committee names. Merck either had a way of predicting the winner of future elections or determined the winner of future elections.\n\nSB-277 is now in the Health, Education and Judiciary Committees.\n\nSenators without any known conflicts of interest with Merck and aren't sponsoring the bill are highlighted in yellow. Note that they are the minority in every single committee.\n\nThis isn't surprising considering Merck's long history of unethical and fraudulent behavior. They have paid out billions of dollars in settlements over Vioxx, NuvaRing, Fosamax and Vytorin among others.\n\nCurrently, in the state of Pennsylvania, case #2:10-cv-04374-cdj UNITED STATES VS MERCK is pending. The Department of Justice is involved. Former virologists now whistleblowers allege that Merck falsified data with the MMR II vaccine in order to meet the 95% efficacy rate which is the benchmark required by the FDA to maintain its monolopy on the mumps vaccine which extends to the MMR II. This suggests vaccine failure and fraud, not unvaccinated kids, as the reason for the outbreaks.\n\nFalsely stating that all vaccines are safe and that the science is settled when this case exists is either an example of gross ignorance or evidence of a cover up. If either is the case, one should not be legislating vaccine mandates on Merck's behalf.\n\nDr. Richard Pan and the medical establishment tout herd immunity as the reason for the need to mandate vaccines with 95% being the magic number. California is already at a 2.54% exemption rate for the state overall. Dr. Pan claims there are pockets with higher percentages and these pockets are putting everyone else at risk. However, there have been no outbreaks or deaths in these unvaccinated, wealthy and educated areas. The only risk is Dr. Pan using his authoritative role as a pediatrician to benefit politically.\n\nAccording to the Sacramento Bee, Dr. Pan opened a campaign committee to raise money for his Senate campaign, the day after his Assembly win. As a Senator, he owes \"paramount loyalty to the public.\" Instead, he has been violating the First Amendment rights of California voters by either blocking them on social media in order to silence their legitimate concerns or allowing out of state astrosurfing trolls to harass them, including parents of vaccine injured children.\n\nDuring Dr. Pan's public media tour and on social media, he's been calling out \"anti-vacciners.\" His pejorative use of the term shows that he has no interest in the actual concerns of constituents, the majority of whom aren't anti-vacciners but parents who are pro-choice when it comes to making medical decisions on behalf of their children.\n\nInformed consent is to medical ethics as freedom of speech is to a democracy. Using fear and propaganda to create a manufactured epidemic and using that epidemic to do away with informed consent is unethical, dangerous and sinister.\n\n1. We ask that all three bills are dismissed immediately.\n\n2. We ask for the resignation of Dr. Richard Pan, who has abused his authoritative roles as Senator and Physician. We also ask that Richard Pan's medical license #84883 be revoked.\n\n3. We ask for an investigation into the members of the Health Committee in regards to their financial ties with Merck and how it may have affected past legislation. If there is evidence of any wrongdoing, we ask that they resign.\n\n4. We ask for greater regulation and transparency with regards to campaign finance in the state of California.\n\n5. We ask that Merck be held responsible for acting unethically.", "opengraph": {"title": "Vaccine Exemptions in CA", "type": "website", "url": "https://latitudes.org/forums/topic/23596-vaccine-exemptions-in-ca/", "description": "A bill has been proposed in CA to eliminate the personal belief and religious exemption for vaccines (SB277). If you live in CA and feel it's important that parents maintain the right to refuse or choose the timing of vaccines and other medical procedures/medicines for their children, please join...", "updated_time": "2015-06-29T20:06:46Z", "site_name": "ACN Latitudes Forums", "locale": "en_US"}, "tags": ["personal belief exemption", "religious exemption", "vaccines"], "tweets": [], "movies": [], "links": ["http://community.babycenter.com/post/a55654141/epic_response_to_sb-277_in_california?cpg=1"], "authors": [], "publish_date": "March 3, 2015"}