{"result_id": "008039", "URL": "https://latitudes.org/dont-vaccinate-without-vitamin-c/", "timestamp": "2023-04-25 11:46:53 CEST+0200", "meta": {"description": "Helen Saul Case", "lang": "en", "keywords": "", "favicon": "https://acn-latitudes-acn.netdna-ssl.com/wordpress/wp-content/uploads/2013/07/acn-favicon-16.ico", "canonical": "https://latitudes.org/dont-vaccinate-without-vitamin-c/", "encoding": "UTF-8"}, "image": null, "domain": "latitudes.org", "title": "Don't Vaccinate without Vitamin C", "cleaned_text": "My husband and I chose to have our children vaccinated. We think some immunizations are worthwhile. We are not in favor of others, but the law is not set up in such a way where doctors and parents can make decisions together about which particular vaccines children receive. Only with our continued insistence did our children’s pediatricians separate the administration of the shots. Otherwise our kids would have been exposed to as many as seven diseases at a clip. And unless your child has a sound medical reason not to get a particular shot, such as a known allergy to certain vaccine ingredients or he or she has a compromised immune system, it is unlikely a doctor will allow a medical exemption. So in many cases a reaction must occur first, and only then might a child be excused from further dosages of a particular vaccine. That’s like putting up a traffic light at a dangerous intersection only after people are seriously hurt. Right now, it’s a ready, fire, aim approach. It feels like a game of trial and error-of wait and see. That’s simply not good enough, and that’s why I give my kids vitamin C, and lots of it.\n\nAt fifteen months old, hours after she received two shots for four diseases, DPT (diphtheria, pertussis, and tetanus) and Hib (Haemophilus influenzae type b), my baby daughter was screaming, falling over and uncoordinated, and spiked a fever that registered as high as 103.5 degrees on our temporal thermometer. Knowing that in large doses, vitamin C is an antipyretic (fever reducer) in addition to being an antibiotic, antiviral, and antitoxin,[1] I acted fast and got the fever under control with very large doses of ascorbic acid and calcium ascorbate, or buffered vitamin C, to bowel tolerance, and a tepid bath. At bowel tolerance of vitamin C, she was no longer screaming and uncoordinated. Within the first hour her fever was down by a degree; in the second hour, another degree. For the remainder of the evening her fever hovered around 100.5.\n\n“When it happens to your child, the risks are 100 percent.” – Barbara Loe Fisher, National Vaccine Information Center\n\nHer severe reaction was not recorded in her medical record by her doctor. It simply stated “Called service last pm with fever.”None of her other symptoms were recorded. During the call, they recommended that I give her children’s Tylenol (acetaminophen), especially if her fever went above 101 degrees. Seeing as her fever was below 101, I put her to bed and continued to monitor her temperature each hour. Her fever fluctuated inversely with her intake of vitamin C, so I continued to give her regular doses, (250-500 mg every two hours or so), keeping the Tylenol handy just in case. By the next morning, her temperature registered normal and she was a normal, happy little girl again. While a mild fever indicates the body’s natural immune response is in good working order combating vaccines, a high fever that spikes during a vaccine reaction is very serious and must be brought down right away. Acetaminophen can do this, but so can high-dose vitamin C. We watched it work.\n\nIt would be years later before we were told which vaccine was to blame for our daughter’s severe vaccine reaction at fifteen months of age. Her third, and hopefully last, pediatrician determined based on my detailed written record of her severe reaction (the only record we had) that it was due to the pertussis component of the DPT shot.\n\nVitamin C makes shots safer and more effective\n\nI believe every doctor should be telling parents to give kids vitamin C when they get vaccinations. In addition to vitamin C’s antitoxin properties (for example, its ability for “neutralizing the toxic nature of mercury in all of its chemical forms”) Thomas E. Levy, MD, says “there is another compelling reason to make vitamin C an integral part of any vaccination protocol: Vitamin C has been documented to augment the antibody response of the immune system. As the goal of any vaccination is to stimulate a maximal antibody response to the antigens of the vaccine while causing minimal to no toxic damage to the most sensitive of vaccine recipients, there would appear to be no medically sound reason not to make vitamin C a part of all vaccination protocols.”[2]\n\nOver forty years ago, Archie Kalokerinos, MD, found that giving infants doses of vitamin C stopped them dying from complications of inoculations.[3] Over forty years ago, Frederick R. Klenner, MD, recommended children under ten take daily “at least one gram [1,000 mg of ascorbic acid] for each year of life.”[4] In preparation for immunizations, Dr. Levy recommends “[i]nfants under ten pounds can take 500 mg daily in some fruit juice, while babies between ten and twenty pounds could take anywhere from 500 mg to 1,000 mg total per day, in divided doses. Older children can take 1,000 mg daily per year of life (5,000 mg for a five year-old child, for example, in divided doses).”[5] A sick child, or one suffering vaccine side effects, would require much more.\n\n“Ideally, the vitamin C would be given prior to vaccination and continue afterwards”, says Levy. “For optimal antibody stimulation and toxin protection, it would be best to dose for three to five days before the shot(s) and to continue for at least two to three days following the shot…. Even taking a one-time dose of vitamin C in the dosage range suggested above directly before the injections can still have a significant toxin-neutralizing and antibody-stimulating effect. It’s just that an even better likelihood of having a positive outcome results from extending the pre- and post-dosing periods of time.”[6]\n\nAs for the kind of vitamin C to give little ones, our children have done well with a mixture of about 80% ascorbic acid crystals buffered with 20% calcium ascorbate powder added to their favorite juice. As infants, we gave it to them using a dropper.\n\n“When I was in active pediatric practice, I wish I had known what I know now about vitamin C’s ability to greatly modify vaccination side effects. The 103 degree fever worried me much less than the screaming and unsteadiness, which are markers of cerebral irritation.” – Ralph Campbell, MD\n\nGiving vitamin C before, during, and after vaccinations\n\nMy kids take vitamin C every day, and always have. Now, in preparation for shots, they receive numerous, regular doses of vitamin C before, during (yes right at the doctor’s office), and for weeks after administered immunizations. This is what experience and our daughter’s vaccine reaction has taught us. While we had given her vitamin C all along, we weren’t nearly as diligent about frequent, timely dosing at vaccination time. We thought we were doing enough. As many folks come to find out, what they think is “a lot” of vitamin C isn’t always enough vitamin C. You take enough to get the job done.\n\nTo avoid vaccine reactions and side effects, days before, the day of, and for days after vaccination, we give our children enough vitamin C to get them just to the point of saturation. After immunizations, their immune system needs all the help it can get. They will get C as often as every hour until they get gassy, a telltale sign that they are getting adequate amounts. The goal is to get them to the point just before “bowel tolerance,” or loose bowels. For example, when our daughter was four, we started her with a relatively large loading dose in the morning, 2,000 mg or so, then gave her 1,000-2,000 mg every couple of hours throughout the day. We wait until there is a rumbling tummy or softened or loose stool. Once that point is reached, we throttle back the dose. We continue to give C, but give less. The next day, we do it again.\n\nAmazingly, the day of and for several days after our four-year-old daughter’s last vaccination, the first shot she had received since her severe reaction years before, she comfortably held fifteen to twenty grams, that’s 15,000 to 20,000 milligrams, of vitamin C each day. She had no reaction whatsoever to the vaccination. No swelling. No fever. No redness. Nothing. She was happy. We were happy. That may sound like a lot of C for a child who only weighed about 33 pounds, but it got the job done. Perhaps your child won’t need that much.\n\nYou might be surprised how much vitamin C a three-month-old can hold after a couple of vaccinations. I was. We don’t allow the kids to get diarrhea and dehydrate, but we do want them to have the vitamin C their bodies require when tackling sickness or immunization side effects. Since gassiness comes before loose bowels, it’s a helpful indicator. If bowel tolerance is reached and stools become frequent, liquid, or, as was the case for my breastfed three-month-old, frequent and greenish in color (since they are always liquid-like), we reduced the frequency and dose, but continued to give it regularly, ramping the frequency and dose up and down as the situation requires. This takes a little practice, but we know we’re not hurting our children with extra C. It is a very, very safe vitamin.\n\nVitamin C is incredibly safe and effective. We are very comfortable giving both of our kids high doses of C. Older, bigger children may hold more C, and younger ones not as much. Saturation becomes a helpful indicator of how much your child can hold.\n\nI don’t believe it is fair to let children get vaccines without vitamin C. I also do not believe it is it fair to let them acquire natural immunity through exposure to disease without vitamin C. Always give C. As to the quantity of C to give, when in doubt, give more.\n\nDr. Levy is convinced of vitamin C’s safety. He says, “Except in individuals with established, significant renal insufficiency, vitamin C is arguably the safest of all nutrients that can be given.”[7] And it works. Over forty years ago, Robert F. Cathcart, MD, discovered that bowel tolerance of vitamin C resolved illness more quickly.[8] Neither of our children has yet to need an antibiotic. We use vitamin C instead.\n\nFor any parent worried about vaccine reactions and side effects, knowing about vitamin C should provide some real comfort. It sure does for us.\n\nSee below for references.\n\nOrthomolecular medicine uses safe, effective nutritional therapy to fight illness. For more information: http://www.orthomolecular.org\n\nTo locate an orthomolecular physician near you: http://orthomolecular.org/resources/omns/v06n09.shtml\n\nFor a free subscription to the Orthomolecular News Service click here. Find archive articles also.\n• Orthomolecular Medicine News Service. “Antibiotics Put 142,000 into Emergency Rooms Each Year. U.S. Centers for Disease Control Waits 60 Years to Study the Problem.” (Oct 13, 2008.):http://www.orthomolecular.org/resources/omns/v04n14.shtml(accessed Oct 2015). Also: Saul, A. W. “Notes On Orthomolecular (Megavitamin) Use of Vitamin C.” http://www.doctoryourself.com/ortho_c.html(accessed Oct 2015).\n• Klenner, F. R. “Observations on the Dose and Administration of Ascorbic Acid When Employed Beyond the Range of a Vitamin in Human Pathology.” Journal of Applied Nutrition, 1971, Vol. 23, Nos. 3 and 4, pp. 61-87. http://www.doctoryourself.com/klennerpaper.html(accessed Oct 2015).\n• Cathcart, R. F. Vitamin C, titration to bowel tolerance, anascorbemia, and acute induced scurvy.Medical Hypotheses, 1981 7:1359-1376. http://www.doctoryourself.com/titration.html(accessed Oct 2015).", "opengraph": {"locale": "en_US", "type": "article", "title": "Don't Vaccinate without Vitamin C | ACN Latitudes", "description": "Helen Saul Case", "url": "https://latitudes.org/dont-vaccinate-without-vitamin-c/", "site_name": "ACN Latitudes", "article:publisher": "http://www.facebook.com/ACNLatitudes", "article:tag": "vitamin C", "article:section": "General", "updated_time": "2021-08-17T15:31:27-04:00", "image": "https://latitudes.org/wordpress/wp-content/uploads/2015/11/Dont-Vaccinate-without-Vitamin-C-WordPress.jpg", "image:secure_url": "https://latitudes.org/wordpress/wp-content/uploads/2015/11/Dont-Vaccinate-without-Vitamin-C-WordPress.jpg", "image:width": "1200", "image:height": "627", "image:alt": "Don't Vaccinate without Vitamin C", "image:type": "image/jpeg", "article:published_time": "2015-11-01T09:36:56-05:00", "article:modified_time": "2021-08-17T15:31:27-04:00"}, "tags": ["vaccine safety", "vaccines", "General", "vitamin C"], "tweets": [], "movies": [], "links": ["#", "#", "#", "https://www.linkedin.com/shareArticle?mini=true&ro=true&trk=EasySocialShareButtons&title=A+Must-Read+Article+for+All+Parents%3A+Don%5C%26%23039%3Bt+Vaccinate+without+Vitamin+C.&url=https%3A%2F%2Flatitudes.org%2Fdont-vaccinate-without-vitamin-c%2F", "#", "https://latitudes.org/wordpress/wp-content/uploads/2015/11/Dont-Vaccinate-without-Vitamin-C-Pinterest.jpg", "http://orthomolecular.acemlnb.com/lt.php?s=aa93d0c085929ecfa55235a6eae9c8db&i=21A25A1A519", "http://orthomolecular.acemlnb.com/lt.php?s=aa93d0c085929ecfa55235a6eae9c8db&i=21A25A1A520", "http://orthomolecular.org/subscribe.html", "http://orthomolecular.org/resources/omns/index.shtml", "http://orthomolecular.acemlnb.com/lt.php?s=aa93d0c085929ecfa55235a6eae9c8db&i=21A25A1A523", "http://orthomolecular.acemlnb.com/lt.php?s=aa93d0c085929ecfa55235a6eae9c8db&i=21A25A1A524", "http://orthomolecular.acemlnb.com/lt.php?s=aa93d0c085929ecfa55235a6eae9c8db&i=21A25A1A525", "http://orthomolecular.acemlnb.com/lt.php?s=aa93d0c085929ecfa55235a6eae9c8db&i=21A25A1A526", "http://orthomolecular.acemlnb.com/lt.php?s=aa93d0c085929ecfa55235a6eae9c8db&i=21A25A1A525", "http://orthomolecular.acemlnb.com/lt.php?s=aa93d0c085929ecfa55235a6eae9c8db&i=21A25A1A527", "#", "#"], "authors": [], "publish_date": "2015-11-01T09:36:56-05:00"}