{"result_id": "008037", "URL": "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/", "timestamp": "2023-04-25 11:46:52 CEST+0200", "meta": {"description": "My 4 year old is due for her annual well child check up. I am still undecided about vaccinations. I live in a state where I can take a philosophical exemption. I think I am on the fence about this because my older kids are up to date since PANDAS didn't surface in our family until they were both ...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/", "encoding": "utf-8"}, "image": null, "domain": "latitudes.org", "title": "Vaccinations and the non-PANDAS child", "cleaned_text": "My 4 year old is due for her annual well child check up. I am still undecided about vaccinations. I live in a state where I can take a philosophical exemption. I think I am on the fence about this because my older kids are up to date since PANDAS didn't surface in our family until they were both up to date for kindergarten. Since then, I have opted not to do flu vaccines, second chicken pox, etc for my older kids. What's your opinion on this? Would you opt out of immunizations for the 4 year old, would you just space them out more, would you get antibody tests done to see if the previous ones still show immunity? Would would you do? I'll add that my 4 year did have strep before without any PANDAS symptoms surfacing. However, I do believe we caught the strep very fast. She does not get symptoms. She was only tested for strep because my PANDAS son had strep. That was in March 2009. Her last strep test was in May 2010. Rapid and cuture were negative. She was tested because her non-PANDAS brother exposed and the ped didn't run a culture on him, so we couldn't be sure he didn't have strep.\n\nMy 4 year old is due for her annual well child check up. I am still undecided about vaccinations. I live in a state where I can take a philosophical exemption. I think I am on the fence about this because my older kids are up to date since PANDAS didn't surface in our family until they were both up to date for kindergarten. Since then, I have opted not to do flu vaccines, second chicken pox, etc for my older kids. What's your opinion on this? Would you opt out of immunizations for the 4 year old, would you just space them out more, would you get antibody tests done to see if the previous ones still show immunity? Would would you do? I'll add that my 4 year did have strep before without any PANDAS symptoms surfacing. However, I do believe we caught the strep very fast. She does not get symptoms. She was only tested for strep because my PANDAS son had strep. That was in March 2009. Her last strep test was in May 2010. Rapid and cuture were negative. She was tested because her non-PANDAS brother exposed and the ped didn't run a culture on him, so we couldn't be sure he didn't have strep. I just went through this with my 15 year old non PANDAS daughter. I don't know if I did the right thing, but I decided to continue her immunizations, but ONLY immunize in the summer, when she is feeling well, and to allow several weeks between shots. I am hoping I don't regret it. I guess I could regret it either way.\n\nThis is such a personal decision, so I can only answer based on the information you provided and what I would do if I were in your shoes. Given the fact that there is a history of PANDAS in your family and your DD has had strep (even without getting PANDAS symptoms), I would err on the side of caution. I would definitely get her titers done. You may be having angst over nothing if her titers are high enough. I have checked my DD's titers ever since she was 5 and she has not needed one vaccination since. If, however, she is not immune, then I would look at each vaccination individually. What is the risk of her getting each disease? Can you get the immunization broken out if it is a combined immunization? Certainly space them out and make sure your DD is in perfect health if you do administer any vaccinations. Ken Bock is my DD's primary doctor and he is very wise in what he says in his book. My 4 year old is due for her annual well child check up. I am still undecided about vaccinations. I live in a state where I can take a philosophical exemption. I think I am on the fence about this because my older kids are up to date since PANDAS didn't surface in our family until they were both up to date for kindergarten. Since then, I have opted not to do flu vaccines, second chicken pox, etc for my older kids. What's your opinion on this? Would you opt out of immunizations for the 4 year old, would you just space them out more, would you get antibody tests done to see if the previous ones still show immunity? Would would you do? I'll add that my 4 year did have strep before without any PANDAS symptoms surfacing. However, I do believe we caught the strep very fast. She does not get symptoms. She was only tested for strep because my PANDAS son had strep. That was in March 2009. Her last strep test was in May 2010. Rapid and cuture were negative. She was tested because her non-PANDAS brother exposed and the ped didn't run a culture on him, so we couldn't be sure he didn't have strep.\n\nI think I could say we would not be on this forum if it had not been for a vaccine on March 30. My daughter probably had PANDAS lying dormant for a while with no symptoms, but a Hep A vacinne has changed our lives dramatically to say the least. We did the Hep A vax for the whole family b/c of our adopting twin 3 year olds from Ethiopia. Dr k says this was the trigger for our dear daughter. The exacerbation was immediate. The choice must be yours of course after weighing the risks and benefits. This was our experience and I wish it could be undone. Unlike many children from Ethiopia, ours did not come home with Hep A. My 4 year old is due for her annual well child check up. I am still undecided about vaccinations. I live in a state where I can take a philosophical exemption. I think I am on the fence about this because my older kids are up to date since PANDAS didn't surface in our family until they were both up to date for kindergarten. Since then, I have opted not to do flu vaccines, second chicken pox, etc for my older kids. What's your opinion on this? Would you opt out of immunizations for the 4 year old, would you just space them out more, would you get antibody tests done to see if the previous ones still show immunity? Would would you do? I'll add that my 4 year did have strep before without any PANDAS symptoms surfacing. However, I do believe we caught the strep very fast. She does not get symptoms. She was only tested for strep because my PANDAS son had strep. That was in March 2009. Her last strep test was in May 2010. Rapid and cuture were negative. She was tested because her non-PANDAS brother exposed and the ped didn't run a culture on him, so we couldn't be sure he didn't have strep.\n\nI have opted not to vaccinate either of my boys b/c they both displayed early signs of autism. But the thing I wanted to mention is that I don't see why you can't \"pick and choose\" when it comes to exemption. The exemption is something that you get through the state health dept. then you turn it into the school. At your ped's office, you get the shots and they don't have to know anything about what you turn into the school. Are you concerned that the state will compare your shot records to your exemption? If that is the case then I would go get the shot(s) and then go get the exemption. I don't think there has to be any time period between the last shot and the exemption. Some PANDAS kids do have exacerbations with vaccinations, esp if the child has an active infection or isn't full recovered. I do not plan on doing anymore vaccinations on my older boys (one PANDAS, one not). What my concern is what if she has the predisposition for PANDAS and it just didn't surface the last time she had strep. I'm also wrried about activating an immune system in a girl who has a family history of autommmune disorders and PANDAS in particular. Also, the MMR is one vaccine scheduled. I'm worried about that one. If she did get that one, that one is live, right? Does it shed and would my PANDAS son be exposed? Am I worrying too much? My husband said it's my decision what we do. I don't think you can pick and choose when it comes to declaring an exemption.\n\nDon't have an opinion, but I do have the same question! -- so I decided to throw my story into this mix. My sons are now 11 and 9, so most of the mandatory vaccinations are behind us. However, I will not allow either boy to receive another vaccination without careful consultation with an expert doctor or doctors whom we truly know and trust. (I plan to ask Dr. K. and Dr. L. about this, but at the moment I'm still waiting to hear back about precisely which Tetanus shot my PANDAS-stricken son should receive, since I've been advised that all vaccinations other than Tetanus are out for him, at least until adulthood). My 11-year-old was stricken in January 2007 (@ his 8th birthday) by what I now know should have been readily recognized as PANDAS, but was not. He suffered a series of infectious illnesses in the fall or 2006 (which were nasty, but came and went, so no blood tests were done) -- then come January, it was like a lightning bolt from @#$%&*! (hallucinations, suicidal ideation, etc.). He was promptly misdiagnosed with early-onset bipolar disorder, struggled for three years (yes, a saw-tooth pattern -- always attributed to bipolar disorder), and finally seemed to be getting better. Then, at his well-child annual check-up in September 2009, he received a flu vaccination, and once again all @#$%&*! broke loose -- even worse this time. He has been incapacitated for nearly a year now. Movement disorders, can't speak, read, write, draw.... It took months and months to find a doctor to listen to us, to look at the overall health history, and to \"connect the dots.\" Ironically, the bipolar diagnosis, which -- considered in context -- should have served as a neurological and immunological clue -- was used by a long series of awful doctors as an excuse to dismiss every word that came out of our mouths, including our suggestions that the flu shot had done something to our child. Why on earth would you listen to anything a family full of crazy, hysterical people has to say?... PANDAS and the immune system and neuroscience in general are all so complex and so incompletely understood, even by the experts. Nevertheless, I figure the \"real\" experts must be in a better position to answer questions such as this one, so I plan to rely on them to help me make good decision(s).", "opengraph": {"title": "Vaccinations and the non-PANDAS child", "type": "website", "url": "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/", "description": "My 4 year old is due for her annual well child check up. I am still undecided about vaccinations. I live in a state where I can take a philosophical exemption. I think I am on the fence about this because my older kids are up to date since PANDAS didn't surface in our family until they were both ...", "updated_time": "2010-07-29T18:36:16Z", "site_name": "ACN Latitudes Forums", "locale": "en_US"}, "tags": ["1", "Report", "Share", "Prev", "Posted July 29, 2010", "Next", "Posted July 28, 2010", "2"], "tweets": [], "movies": [], "links": ["https://latitudes.org/forums/profile/3861-thereishope/", "https://latitudes.org/forums/profile/3861-thereishope/badges/", "https://latitudes.org/forums/profile/3861-thereishope/", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77293", "https://latitudes.org/forums/profile/3861-thereishope/", "https://latitudes.org/forums/profile/3861-thereishope/", "https://latitudes.org/forums/profile/3861-thereishope/content/", "#elControls_77293_menu", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=reportComment&comment=77293", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77293", "http://twitter.com/share?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77293", "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77293", "http://www.reddit.com/submit?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77293&title=Vaccinations+and+the+non-PANDAS+child", "mailto:?subject=Vaccinations%20and%20the%20non-PANDAS%20child&body=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77293", "http://pinterest.com/pin/create/button/?url=https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment%26comment=77293&media=", "https://latitudes.org/forums/profile/4834-saidie10/", "https://latitudes.org/forums/profile/4834-saidie10/badges/", "https://latitudes.org/forums/profile/4834-saidie10/", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77294", "https://latitudes.org/forums/profile/4834-saidie10/", "https://latitudes.org/forums/profile/4834-saidie10/", "https://latitudes.org/forums/profile/4834-saidie10/content/", "#elControls_77294_menu", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=reportComment&comment=77294", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77294", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77294", "http://twitter.com/share?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77294", "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77294", "http://www.reddit.com/submit?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77294&title=Vaccinations+and+the+non-PANDAS+child", "mailto:?subject=Vaccinations%20and%20the%20non-PANDAS%20child&body=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77294", "http://pinterest.com/pin/create/button/?url=https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment%26comment=77294&media=", "https://latitudes.org/forums/profile/3861-thereishope/", "https://latitudes.org/forums/profile/3861-thereishope/badges/", "https://latitudes.org/forums/profile/3861-thereishope/", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77297", "https://latitudes.org/forums/profile/3861-thereishope/", "https://latitudes.org/forums/profile/3861-thereishope/", "https://latitudes.org/forums/profile/3861-thereishope/content/", "#elControls_77297_menu", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=reportComment&comment=77297", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77297", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77297", "http://twitter.com/share?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77297", "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77297", "http://www.reddit.com/submit?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77297&title=Vaccinations+and+the+non-PANDAS+child", "mailto:?subject=Vaccinations%20and%20the%20non-PANDAS%20child&body=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77297", "http://pinterest.com/pin/create/button/?url=https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment%26comment=77297&media=", "https://latitudes.org/forums/profile/4729-kimballot/", "https://latitudes.org/forums/profile/4729-kimballot/badges/", "https://latitudes.org/forums/profile/4729-kimballot/", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77298", "https://latitudes.org/forums/profile/4729-kimballot/", "https://latitudes.org/forums/profile/4729-kimballot/", "https://latitudes.org/forums/profile/4729-kimballot/content/", "#elControls_77298_menu", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=reportComment&comment=77298", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77298", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77298", "http://twitter.com/share?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77298", "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77298", "http://www.reddit.com/submit?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77298&title=Vaccinations+and+the+non-PANDAS+child", "mailto:?subject=Vaccinations%20and%20the%20non-PANDAS%20child&body=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77298", "http://pinterest.com/pin/create/button/?url=https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment%26comment=77298&media=", "https://latitudes.org/forums/profile/4488-MomWithOCDSon/", "https://latitudes.org/forums/profile/4488-MomWithOCDSon/badges/", "https://latitudes.org/forums/profile/4488-MomWithOCDSon/", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77299", "https://latitudes.org/forums/profile/4488-MomWithOCDSon/", "https://latitudes.org/forums/profile/4488-MomWithOCDSon/", "https://latitudes.org/forums/profile/4488-MomWithOCDSon/content/", "#elControls_77299_menu", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=reportComment&comment=77299", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77299", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77299", "http://twitter.com/share?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77299", "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77299", "http://www.reddit.com/submit?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77299&title=Vaccinations+and+the+non-PANDAS+child", "mailto:?subject=Vaccinations%20and%20the%20non-PANDAS%20child&body=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77299", "http://pinterest.com/pin/create/button/?url=https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment%26comment=77299&media=", "https://latitudes.org/forums/profile/3983-NancyD/", "https://latitudes.org/forums/profile/3983-NancyD/badges/", "https://latitudes.org/forums/profile/3983-NancyD/", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77305", "https://latitudes.org/forums/profile/3983-NancyD/", "https://latitudes.org/forums/profile/3983-NancyD/", "https://latitudes.org/forums/profile/3983-NancyD/content/", "#elControls_77305_menu", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=reportComment&comment=77305", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77305", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77305", "http://twitter.com/share?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77305", "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77305", "http://www.reddit.com/submit?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77305&title=Vaccinations+and+the+non-PANDAS+child", "mailto:?subject=Vaccinations%20and%20the%20non-PANDAS%20child&body=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77305", "http://pinterest.com/pin/create/button/?url=https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment%26comment=77305&media=", "https://latitudes.org/forums/profile/4762-airial95/", "https://latitudes.org/forums/profile/4762-airial95/badges/", "https://latitudes.org/forums/profile/4762-airial95/", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77311", "https://latitudes.org/forums/profile/4762-airial95/", "https://latitudes.org/forums/profile/4762-airial95/", "https://latitudes.org/forums/profile/4762-airial95/content/", "#elControls_77311_menu", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=reportComment&comment=77311", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77311", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77311", "http://twitter.com/share?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77311", "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77311", "http://www.reddit.com/submit?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77311&title=Vaccinations+and+the+non-PANDAS+child", "mailto:?subject=Vaccinations%20and%20the%20non-PANDAS%20child&body=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77311", "http://pinterest.com/pin/create/button/?url=https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment%26comment=77311&media=", "https://latitudes.org/forums/profile/5404-pandasmcnuggetswfrycoke/", "https://latitudes.org/forums/profile/5404-pandasmcnuggetswfrycoke/badges/", "https://latitudes.org/forums/profile/5404-pandasmcnuggetswfrycoke/", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77312", "https://latitudes.org/forums/profile/5404-pandasmcnuggetswfrycoke/", "https://latitudes.org/forums/profile/5404-pandasmcnuggetswfrycoke/", "https://latitudes.org/forums/profile/5404-pandasmcnuggetswfrycoke/content/", "#elControls_77312_menu", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=reportComment&comment=77312", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77312", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77312", "http://twitter.com/share?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77312", "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77312", "http://www.reddit.com/submit?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77312&title=Vaccinations+and+the+non-PANDAS+child", "mailto:?subject=Vaccinations%20and%20the%20non-PANDAS%20child&body=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77312", "http://pinterest.com/pin/create/button/?url=https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment%26comment=77312&media=", "https://latitudes.org/forums/profile/3747-dcmom/", "https://latitudes.org/forums/profile/3747-dcmom/badges/", "https://latitudes.org/forums/profile/3747-dcmom/", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77315", "https://latitudes.org/forums/profile/3747-dcmom/", "https://latitudes.org/forums/profile/3747-dcmom/", "https://latitudes.org/forums/profile/3747-dcmom/content/", "#elControls_77315_menu", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=reportComment&comment=77315", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77315", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77315", "http://twitter.com/share?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77315", "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77315", "http://www.reddit.com/submit?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77315&title=Vaccinations+and+the+non-PANDAS+child", "mailto:?subject=Vaccinations%20and%20the%20non-PANDAS%20child&body=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77315", "http://pinterest.com/pin/create/button/?url=https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment%26comment=77315&media=", "https://latitudes.org/forums/profile/4137-stephanie2/", "https://latitudes.org/forums/profile/4137-stephanie2/badges/", "https://latitudes.org/forums/profile/4137-stephanie2/", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77321", "https://latitudes.org/forums/profile/4137-stephanie2/", "https://latitudes.org/forums/profile/4137-stephanie2/", "https://latitudes.org/forums/profile/4137-stephanie2/content/", "#elControls_77321_menu", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=reportComment&comment=77321", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77321", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77321", "http://twitter.com/share?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77321", "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77321", "http://www.reddit.com/submit?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77321&title=Vaccinations+and+the+non-PANDAS+child", "mailto:?subject=Vaccinations%20and%20the%20non-PANDAS%20child&body=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77321", "http://pinterest.com/pin/create/button/?url=https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment%26comment=77321&media=", "https://latitudes.org/forums/profile/5016-tenacity/", "https://latitudes.org/forums/profile/5016-tenacity/badges/", "https://latitudes.org/forums/profile/5016-tenacity/", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77340", "https://latitudes.org/forums/profile/5016-tenacity/", "https://latitudes.org/forums/profile/5016-tenacity/", "https://latitudes.org/forums/profile/5016-tenacity/content/", "#elControls_77340_menu", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=reportComment&comment=77340", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77340", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77340", "http://twitter.com/share?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77340", "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77340", "http://www.reddit.com/submit?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77340&title=Vaccinations+and+the+non-PANDAS+child", "mailto:?subject=Vaccinations%20and%20the%20non-PANDAS%20child&body=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77340", "http://pinterest.com/pin/create/button/?url=https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment%26comment=77340&media=", "https://latitudes.org/forums/profile/5094-norcalmom/", "https://latitudes.org/forums/profile/5094-norcalmom/badges/", "https://latitudes.org/forums/profile/5094-norcalmom/", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77343", "https://latitudes.org/forums/profile/5094-norcalmom/", "https://latitudes.org/forums/profile/5094-norcalmom/", "https://latitudes.org/forums/profile/5094-norcalmom/content/", "#elControls_77343_menu", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=reportComment&comment=77343", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77343", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77343", "http://today.msnbc.msn.com/id/38447752/ns/health-infectious_diseases/", "http://twitter.com/share?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77343", "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77343", "http://www.reddit.com/submit?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77343&title=Vaccinations+and+the+non-PANDAS+child", "mailto:?subject=Vaccinations%20and%20the%20non-PANDAS%20child&body=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77343", "http://pinterest.com/pin/create/button/?url=https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment%26comment=77343&media=", "https://latitudes.org/forums/profile/4959-tapiash/", "https://latitudes.org/forums/profile/4959-tapiash/badges/", "https://latitudes.org/forums/profile/4959-tapiash/", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77365", "https://latitudes.org/forums/profile/4959-tapiash/", "https://latitudes.org/forums/profile/4959-tapiash/", "https://latitudes.org/forums/profile/4959-tapiash/content/", "#elControls_77365_menu", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=reportComment&comment=77365", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77365", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77365", "http://twitter.com/share?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77365", "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77365", "http://www.reddit.com/submit?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77365&title=Vaccinations+and+the+non-PANDAS+child", "mailto:?subject=Vaccinations%20and%20the%20non-PANDAS%20child&body=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77365", "http://pinterest.com/pin/create/button/?url=https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment%26comment=77365&media=", "https://latitudes.org/forums/profile/4137-stephanie2/", "https://latitudes.org/forums/profile/4137-stephanie2/badges/", "https://latitudes.org/forums/profile/4137-stephanie2/", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77384", "https://latitudes.org/forums/profile/4137-stephanie2/", "https://latitudes.org/forums/profile/4137-stephanie2/", "https://latitudes.org/forums/profile/4137-stephanie2/content/", "#elControls_77384_menu", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=reportComment&comment=77384", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77384", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77384", "http://twitter.com/share?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77384", "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77384", "http://www.reddit.com/submit?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77384&title=Vaccinations+and+the+non-PANDAS+child", "mailto:?subject=Vaccinations%20and%20the%20non-PANDAS%20child&body=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77384", "http://pinterest.com/pin/create/button/?url=https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment%26comment=77384&media=", "https://latitudes.org/forums/profile/2331-colleenrn/", "https://latitudes.org/forums/profile/2331-colleenrn/badges/", "https://latitudes.org/forums/profile/2331-colleenrn/", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77393", "https://latitudes.org/forums/profile/2331-colleenrn/", "https://latitudes.org/forums/profile/2331-colleenrn/", "https://latitudes.org/forums/profile/2331-colleenrn/content/", "#elControls_77393_menu", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=reportComment&comment=77393", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77393", "https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment&comment=77393", "http://twitter.com/share?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77393", "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77393", "http://www.reddit.com/submit?url=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77393&title=Vaccinations+and+the+non-PANDAS+child", "mailto:?subject=Vaccinations%20and%20the%20non-PANDAS%20child&body=https%3A%2F%2Flatitudes.org%2Fforums%2Ftopic%2F9233-vaccinations-and-the-non-pandas-child%2F%3Fdo%3DfindComment%26comment%3D77393", "http://pinterest.com/pin/create/button/?url=https://latitudes.org/forums/topic/9233-vaccinations-and-the-non-pandas-child/?do=findComment%26comment=77393&media="], "authors": [], "publish_date": "July 28, 2010"}