{"result_id": "008021", "URL": "https://latitudes.org/forums/topic/13630-middle-school-vaccines/", "timestamp": "2023-04-25 11:46:41 CEST+0200", "meta": {"description": "Our PANDAS son will be entering middle school in the fall. 3 vaccines were added for boys and girls ages 11-19. 2nd Varicella (Chicken Pox), Tdap booster (Pertussis - whooping cough) and MCV4 (Meningococcal conjagate). Any older PANDAS children receive these vaccines yet and if so how did he/she ...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://latitudes.org/forums/topic/13630-middle-school-vaccines/", "encoding": "utf-8"}, "image": null, "domain": "latitudes.org", "title": "Middle School Vaccines", "cleaned_text": "My DS, now 14, received all of his standard immunization boosters before entering sixth grade. Let me say, though, that this was before a PANDAS diagnosis, and before the massive exacerbation that brought us to the PANDAS diagnosis. Also, his shots were administered a good 14 months before he \"lost his mind,\" so I cannot connect the immunizations temporily with his PANDAS.\n\nThat being said, if immune health is about \"the total load\" our kids are capable of withstanding, then everything we've given him from birth on may have contributed to his current condition, so I'm not ready to take anything off the table.\n\nIf I had it to do over again, I think I would be much more judicious about it. If your DS has already had a chicken pox vaccine and been exposed, does he really need another vaccine now? I know chicken pox can have some major ramifications for adults, but if you could hold off until his immune system is more mature before \"boostering\" that, it would seem safer. As for the others, I'm told pertussis is \"making a comeback,\" and I know meningitis is a concern among preteens and teens. I keep recalling what I heard Dr. Kenneth Bock say at the AO Conference last year: \"I'm not anti-immunization. I'm for proper, appropriate and timely immunizations.\" In other words, maybe immunizations would be more beneficial and less toxic to our kids (mercury and thimerasol notwithstanding) if they were administered across a reasonable time frame, instead of having these massive doses lumped together because that's more \"convenient\" for the pharmaceutical industry and the administering doctors.\n\nAt a minimum, in your shoes, I would make sure my DS was in good health before agreeing to any immunizations, and then I would probably advocate for taking it slow: one shot at a time, with plenty of time in between to make sure his immune system is not being sent into overdrive by them.", "opengraph": {"title": "Middle School Vaccines", "type": "website", "url": "https://latitudes.org/forums/topic/13630-middle-school-vaccines/", "description": "Our PANDAS son will be entering middle school in the fall. 3 vaccines were added for boys and girls ages 11-19. 2nd Varicella (Chicken Pox), Tdap booster (Pertussis - whooping cough) and MCV4 (Meningococcal conjagate). Any older PANDAS children receive these vaccines yet and if so how did he/she ...", "updated_time": "2011-05-19T12:54:41Z", "site_name": "ACN Latitudes Forums", "locale": "en_US"}, "tags": ["Report", "Posted May 19, 2011", "Share", "Posted May 17, 2011", "Posted May 18, 2011"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "May 17, 2011"}