{"result_id": "008035", "URL": "https://latitudes.org/forums/topic/25342-please-help-my-daughter-what-is-happening-with-her-catatonia-symptom/", "timestamp": "2023-04-25 11:46:50 CEST+0200", "meta": {"description": "Hello to all. My daughter 14 yo after vaccination DTaP and HPV, after it she changed a lot. Doctors dont want recognize brain injury after vaccine.The worst symptoms started 4 weeks ago, trouble with speaking, attention, walking, catatonia, mutism, all function regression. Now we are in hospital,...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://latitudes.org/forums/topic/25342-please-help-my-daughter-what-is-happening-with-her-catatonia-symptom/", "encoding": "utf-8"}, "image": null, "domain": "latitudes.org", "title": "Please help my daughter!!! What is happening with her? Catatonia symptom", "cleaned_text": "Where are you? What hospital is your daughter currently in? Any more new with respect to test results?\n\nDid these symptoms come on suddenly? Is your daughter otherwise neurotypical, or has she previously presented with autism or another neural disorder or \"difference\"?\n\nYes, these symptoms are ones that can show up in severe episodes of auto-immune disorders, but not every medical professional is going to recognize the signs for what they are. When you had blood tests, what tests were included? You mention having an \"immunity test.\" Via blood panels? What testing is included there? Make sure you're testing for ASO and anti-d-nase b (strep antibodies). Catatonia (even narcolepsy) has been associated with untreated strep infections, and many people are classically asymptomatic for strep -- no fever or sore throat, but raging antibody levels nonetheless.\n\nIf you're spending time in the hospital, waiting, you might try getting a copy (it's available in digital format as well as paper) of a memoir by Susannah Cahalan called \"Brain on Fire.\" Susannah suddenly developed all sorts of bizarre neuro symptoms, some of which your daughter is also displaying. She was studied and poked and prodded and tested, and they couldn't find the culprit; a set of doctors decided that she had a multitude of illnesses, both physical (seizure disorder) and mental (psychosis), but then one out-of-the-box thinking doctor noticed a few atypical behaviors and kept studying her and ultimately determined that she had developed some auto-immune reaction to some unknown microbe. It's been a while since I read the book, but I don't think they ever found out definitively what it was. I believe Susannah was treated with multiple interventions, but infusions were definitely in the mix, and she recovered. She was in New York, and the doctor who essentially saved her was Dr. Souhel Najjar.", "opengraph": {"title": "Please help my daughter!!! What is happening with her? Catatonia symptom", "type": "website", "url": "https://latitudes.org/forums/topic/25342-please-help-my-daughter-what-is-happening-with-her-catatonia-symptom/", "description": "Hello to all. My daughter 14 yo after vaccination DTaP and HPV, after it she changed a lot. Doctors dont want recognize brain injury after vaccine.The worst symptoms started 4 weeks ago, trouble with speaking, attention, walking, catatonia, mutism, all function regression. Now we are in hospital,...", "updated_time": "2018-06-01T17:27:52Z", "site_name": "ACN Latitudes Forums", "locale": "en_US"}, "tags": ["1", "Report", "Posted April 4, 2018", "Posted April 11, 2018", "Posted April 27, 2018", "Share", "Posted March 31, 2018", "Posted June 1, 2018", "Posted May 28, 2018", "Posted March 30, 2018"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "March 30, 2018"}