{"result_id": "008016", "URL": "https://latitudes.org/aluminum-levels-abnormal-in-autism-spectrum-disorder/", "timestamp": "2023-04-25 11:46:38 CEST+0200", "meta": {"description": "Autism is assumed to involve both genetic and environmental factors, including exposure to environmental toxins. The disorder is neurodevelopmental and causes", "lang": "en", "keywords": "", "favicon": "https://acn-latitudes-acn.netdna-ssl.com/wordpress/wp-content/uploads/2013/07/acn-favicon-16.ico", "canonical": "https://latitudes.org/aluminum-levels-abnormal-in-autism-spectrum-disorder/", "encoding": "UTF-8"}, "image": null, "domain": "latitudes.org", "title": "Aluminum Levels Abnormal in Autism Spectrum Disorder", "cleaned_text": "Autism is assumed to involve both genetic and environmental factors, including exposure to environmental toxins. The disorder is neurodevelopmental and causes are unknown, although human exposure to aluminium, a neurotoxin, has been linked to autism spectrum disorder.\n\nThe 2020 study highlighted below, involving the study of brains donated to science, is an open access article that may be shared freely. It builds on a 2018 published research article, “Aluminium in brain tissue in autism.”\n\nThe sample size was small, and the findings became controversial, particularly because many people pointed out that aluminum is used in vaccines.\n\nThe CDC says: “Aluminum-containing adjuvants are vaccine ingredients that have been used in vaccines since the 1930s. Small amounts of aluminum are added to help the body build stronger immunity against the germ in the vaccine.” Aluminum exposure can also occur through occupational exposures, the environment, and diet, as well as aluminum pans and utensils. The question is, what does it mean that levels are so high in specimens of those with autism.\n\nIn the research below, for the first time, aluminum levels from donor brains of people who did not have a neurodegenerative disease were compared with Alzheimer’s, multiple sclerosis, and autism.\n\nAluminium in human brain tissue from donors without neurodegenerative disease: A comparison with Alzheimer’s disease, multiple sclerosis and autism\n\nA burgeoning number of studies are demonstrating aluminium in human brain tissue. While research has both quantified and imaged aluminium in human brain tissue in neurodegenerative and neurodevelopmental disease there are few similar data for brain tissue from non-neurologically impaired donors.\n\nWe have used . . . spectrometry to measure aluminium in twenty brains from donors without recognisable neurodegenerative disease. The aluminium content of 191 tissue samples was invariably low with over 80% of tissues having an aluminium content below 1.0 μg/g dry weight of tissue.\n\nThe data for these control tissues were compared with data (measured using identical procedures) for sporadic Alzheimer’s disease, familial Alzheimer’s disease, autism spectrum disorder and multiple sclerosis.\n\nFurther research is required to understand the role played by high levels of aluminium in the aetiology of human neurodegenerative and neurodevelopmental disease.", "opengraph": {"locale": "en_US", "type": "article", "title": "Aluminum Levels Abnormal in Autism Spectrum Disorder | ACN Latitudes", "description": "Autism is assumed to involve both genetic and environmental factors, including exposure to environmental toxins. The disorder is neurodevelopmental and causes", "url": "https://latitudes.org/aluminum-levels-abnormal-in-autism-spectrum-disorder/", "site_name": "ACN Latitudes", "article:publisher": "http://www.facebook.com/ACNLatitudes", "article:tag": "neurotoxins", "article:section": "Autism Resources & Research", "updated_time": "2020-08-07T11:09:55-04:00", "image": "https://latitudes.org/wordpress/wp-content/uploads/2020/08/Copy-of-7-mistakes-parents-make-with-tourette-syndrome-wordpress.png", "image:secure_url": "https://latitudes.org/wordpress/wp-content/uploads/2020/08/Copy-of-7-mistakes-parents-make-with-tourette-syndrome-wordpress.png", "image:width": "1200", "image:height": "628", "image:alt": "aluminum brain autism latitudes", "image:type": "image/png", "article:published_time": "2020-08-06EDT21:00:39-04:00", "article:modified_time": "2020-08-07EDT11:09:55-04:00"}, "tags": ["aluminum", "Environmental Medicine", "Autism Resources & Research", "neurotoxins"], "tweets": [], "movies": [], "links": ["#", "#", "#", "https://www.linkedin.com/shareArticle?mini=true&ro=true&trk=EasySocialShareButtons&title=Aluminum+Levels+Abnormal+in+Autism+Spectrum+Disorder&url=https%3A%2F%2Flatitudes.org%2Faluminum-levels-abnormal-in-autism-spectrum-disorder%2F", "#", "https://www.nature.com/articles/s41598-020-64734-6", "https://www.nature.com/articles/s41598-020-64734-6", "#", "#"], "authors": [], "publish_date": "2020-08-06EDT21:00:39-04:00"}