{"result_id": "009008", "URL": "https://www.activistpost.com/2021/12/hr-550-house-passes-bill-to-fund-federal-vaccination-database.html", "timestamp": "2023-04-25 11:47:05 CEST+0200", "meta": {"description": "Even a blind person could see that the only purpose to track vaccinations is to identify the unvaccinated.", "lang": "en", "keywords": "", "favicon": "https://www.activistpost.com/wp-content/uploads/2018/04/cropped-icon-32x32.jpg", "canonical": "https://www.activistpost.com/2021/12/hr-550-house-passes-bill-to-fund-federal-vaccination-database.html", "encoding": "UTF-8"}, "image": null, "domain": "www.activistpost.com", "title": "HR 550: House Passes Bill To Fund Federal Vaccination Database", "cleaned_text": "Even a blind person could see that the only purpose to track vaccinations is to identify the unvaccinated. Technocrats have turned the unvaccinated into an enemy that must be dealt with by physical means. Today that could be fines, quarantines and criminal records. Tomorrow, it could mean mass expulsion and even genocidal purging. Tyranny never retreats on its own; it must be forcefully pushed back and definitively conquered. — Technocracy News & Trends Editor Patrick Wood\n\nEighty House Republicans voted with Democrats on Tuesday to pass the Immunization Infrastructure Modernization Act, which if passed by the Senate and signed into law would fund a federal vaccination database.\n\nAccording to the bill, also called H. R. 550, the government would provide $400 million in taxpayer dollars to fund “immunization system data modernization and expansion,” a system otherwise defined as “a confidential, population-based, computerized database that records immunization doses administered by any health care provider to persons within the geographic area covered by that database.”\n\nThe text specifically outlines an expansion of Centers for Disease Control and Prevention (CDC) and Public Health Department capabilities and the ability for state and local health departments, as well as public and private health care providers, to share health data with the federal government.\n\nIn a statement, the bill’s main sponsor, Democrat Rep. Ann Kuster (NH), said the system would be used to “remind patients when they are due for a recommended vaccine” and identify areas with low vaccination rates to “ensure equitable distribution of vaccines.” Notably, the bill has four Republican co-sponsors: Reps. Larry Bucshon (R-IN), James Baird (R-IN), David McKinley (R-WV), and Brian Fitzpatrick (R-PA). Not one Democrat voted in opposition to the bill.\n\nRep. Mary Miller (R-IL), who was one of the 130 Republicans to vote “no,” told Breitbart News exclusively on Wednesday that the legislation would enable the federal government to “track” unvaccinated Americans who “will be targeted and forced to comply with Biden’s crazy ‘global vaccination’ vision.”\n\n“These systems are designed to allow for the sharing of crucial information and maintenance of records. Do we really trust the government to protect our medical records?” Miller said. “The bill’s author even bragged in her press release that these systems will help the government remind patients when they are due for a recommended vaccine and identify areas with low vaccination rates to ensure equitable distribution of vaccines. This was clearly a legislative tool to enforce vaccine mandates and force their Orwellian rules onto those who do not comply.”\n\nRep. Byron Donalds (R-FL) also voted “no” on the bill, citing “Democrats’ habitual pattern of reckless and wasteful spending” in an exclusive statement to Breitbart News. The congressman said the legislation only serves to expand the power of the federal government and trample individual rights.\n\n“This legislation would unnecessarily appropriate millions of taxpayer funds intended to expand bureaucracy in Washington. A database solely created to record and collect confidential vaccination information of Americans explicitly encroaches upon individuals’ fundamental right to medical privacy,” Donalds said. “As a fiscal conservative, I cannot in good faith support legislation that contributes to the Democrats’ habitual pattern of reckless and wasteful spending and the intrusive heavy hand of government.”\n\nMiller noted that the legislation paves the way for the government to give blue states millions in taxpayers funds to enforce vaccine mandates. According to the bill’s text, the government could award grants and cooperative agreements to health departments or other local governmental entities for agreeing to adopt the new data collection guidelines set by the CDC. Any agencies hoping to receive a grant must agree to comply with security standards to protect personal health information.\n\nThe government may also develop “public-private partnerships” to help with “technical assistance, training, and related implementation support.” When Breitbart News asked Miller if public-private partnerships could potentially obscure data collection activities from the public, she said the government cannot be trusted to be transparent.\n\n“…The government has become so large, you cannot expect them to keep anything private anymore. There is hardly any congressional oversight into studies these agencies conduct,” she added.\n\nKuster is urging the Senate to quickly pass the legislation, saying the pandemic showed just how underprepared the country’s “vaccine infrastructure” is. She emphasized that the legislation would help better prepare healthcare systems for “future public health crises.” She said in part:\n\nMiller contended that the government has “no reason” to collect more vaccination data on Americans.\n\nBecome a Patron!\n\n Or support us at SubscribeStar\n\n Donate cryptocurrency HERE\n\nSubscribe to Activist Post for truth, peace, and freedom news. Follow us on Telegram, HIVE, Flote, Minds, MeWe, Twitter, Gab and What Really Happened.\n\n\n\nProvide, Protect and Profit from what’s coming! Get a free issue of Counter Markets today.", "opengraph": {"locale": "en_US", "type": "article", "title": "HR 550: House Passes Bill To Fund Federal Vaccination Database - Activist Post", "description": "Even a blind person could see that the only purpose to track vaccinations is to identify the unvaccinated.", "url": "https://www.activistpost.com/2021/12/hr-550-house-passes-bill-to-fund-federal-vaccination-database.html", "site_name": "Activist Post", "article:publisher": "http://www.facebook.com/activistpost", "article:published_time": "2021-12-02T15:22:34+00:00", "image": "https://www.activistpost.com/wp-content/uploads/2021/12/vax-database.jpg", "image:width": "953", "image:height": "526", "image:type": "image/jpeg"}, "tags": ["Patrick Wood", "Katherine Hamilton", "Privacy", "Congress", "Vaccine Database", "Technocracy"], "tweets": [], "movies": [], "links": ["https://www.activistpost.com/wp-content/uploads/2021/12/vax-database.jpg", "https://www.activistpost.com/product/0986373907/US/permacultucom-20/?cart=y", "https://www.breitbart.com/politics/2021/12/01/exclusive-tool-to-enforce-orwellian-rules-80-house-republicans-help-pass-bill-to-fund-federal-vaccination-database/", "https://www.congress.gov/bill/117th-congress/house-bill/550/text", "https://kuster.house.gov/news/documentsingle.aspx?DocumentID=4115", "https://smartlivingshopper.clickfunnels.com/webinar-registrationtp09jgx5", "https://smartlivingshopper.clickfunnels.com/webinar-registrationtp09jgx5", "https://www.breitbart.com/politics/2021/12/01/exclusive-tool-to-enforce-orwellian-rules-80-house-republicans-help-pass-bill-to-fund-federal-vaccination-database/", "https://www.technocracy.news/hr-550-house-passes-bill-to-fund-federal-vaccination-database/", "https://www.patreon.com/bePatron?u=5719077", "https://www.subscribestar.com/activist-post", "https://www.activistpost.com/support", "https://www.activistpost.com/survive-job-automation-apocalypse", "https://t.me/activistpost", "https://hive.blog/@activistpost", "https://flote.app/ActivistPost", "https://www.minds.com/ActivistPost", "https://mewe.com/i/activistpost", "https://twitter.com/ActivistPost", "https://gab.com/activist", "https://www.whatreallyhappened.com/?q=users/activistpost", "http://countermarkets.com/"], "authors": ["Activist Post"], "publish_date": "2021-12-02T15:22:34+00:00"}