{"result_id": "009040", "URL": "https://www.activistpost.com/2021/04/vaccine-passports-one-passport-to-rule-them-all.html", "timestamp": "2023-04-25 11:50:44 CEST+0200", "meta": {"description": "Here is a brief list of the vaccine passport schemes that are either proposed, about to be rolled out or already in existence.", "lang": "en", "keywords": "", "favicon": "https://www.activistpost.com/wp-content/uploads/2018/04/cropped-icon-32x32.jpg", "canonical": "https://www.activistpost.com/2021/04/vaccine-passports-one-passport-to-rule-them-all.html", "encoding": "UTF-8"}, "image": null, "domain": "www.activistpost.com", "title": "Vaccine Passports: One Passport to Rule Them All", "cleaned_text": "THE STORY: Vaccine passports have arrived in many nations in various forms. They have different names but one thing in common: discrimination against those who stand for bodily autonomy and medical sovereignty.\n\nTHE IMPLICATIONS: If humanity continues to buy into the COVID op and allows the widespread rollout of this control scheme, life will become even more restrictive for those who have seen through the agenda.\n\nVaccine passports are a major goal of those orchestrating Operation Coronavirus, though not the ultimate end goal of the COVID agenda. The purpose of vaccine passports is clear, despite whatever flimsy and mealy-mouthed excuses given to justify them: to restrict the movement of the unvaccinated; or in plainer terms, to restrict the movement of those who have seen through the agenda. There are no clever legal arguments that can distract from this basic truth: vaccine passports are inherently discriminatory. In a sane society, no nation that even pays lip service to caring about human rights could claim that vaccine passports are in alignment with their existing laws on individual rights, freedom of choice, freedom of movement, informed consent and medical sovereignty. However, it hardly bares stating that we do not live in a sane world. Below is a brief list of the vaccine passport schemes that are either proposed, about to be rolled out or already in existence. This is a worldwide agenda being rapidly promoted and implemented.\n\nLong before the word ‘coronavirus’ become a household world, or the term ‘COVID’ even existed, the European Union (EU) was planning for a vaccine passport scenario. The European Commission (the executive arm of the EU) published a proposal for vaccine passports on April 26th 2018 in a document entitled “Proposal for a Council Recommendation on Strengthened Cooperation against Vaccine Preventable Diseases”. It lays out the plan for a “vaccine passport” or “vaccine card” and “vaccine portals”:\n\n17. Examine issues of insufficient vaccine coverage caused by cross-border movement of people within the EU and look into options to address them, including developing a common EU citizens’ vaccination card/passport, compatible with electronic immunisation information systems and recognised for use across borders. HEREBY WELCOMES THE COMMISSION’S INTENTION TO TAKE THE FOLLOWING ACTIONS, IN CLOSE COOPERATION WITH THE MEMBER STATES: 10. Aim at establishing a European Vaccination Information Sharing (EVIS) system, coordinated by the European Centre for Diseases Prevention and Control (ECDC), in order to: a. Together with the national public health authorities, i. examine the options of establishing, by 2020, guidelines for a core EU vaccination schedule, aiming to facilitate the compatibility of national schedules and promote equity in Union citizens’ health protection, and subsequently ensuring broad uptake of the core schedule as well as a common vaccination card; ii. strengthen the consistency, transparency, and methodologies in the assessment of national and regional vaccination plans, by sharing scientific evidence and tools with the support of National Immunization Technical Advisory Groups (NITAGs); iii. design EU methodologies and guidance on data requirements for better monitoring of vaccination coverage rates across all age groups, including healthcare workers, in cooperation with the World health Organisation (WHO). Collect such data and share them at EU level; b. By 2019, establish a European vaccination information portal, with the support of the European Medicines Agency, to provide online objective, transparent and updated evidence on vaccines, their benefit and safety, and the pharmacovigilance process. c. Monitor online vaccine misinformation and develop evidence-based information tools and guidance to support Member States in countering vaccine hesitancy, in line with the Commission Communication on tackling online disinformation.”\n\nInterestingly, on pg.13, this document also mentions the term vaccine hesitancy as it recommends a “Joint Action on Vaccination, co–funded by the third Programme for the Union’s action in the field of health … to address vaccine hesitancy.” Vaccine hesitancy has also become a theme in the COVID op because so many people have become aware of just how toxic vaccines can be and how experimental these ones are in particular; in my article from August 2020 I revealed how a Yale study was analyzing how to combat vaccine hesitancy and increase vaccine uptake through a variety of psychological techniques and manipulation.\n\nThe Ultimate Privacy Phone and Laptop from Purism (Ad)\n\nGiven the above documents, it’s no great surprise that Europe is at the forefront of implementing vaccine passports. The UK and many European countries are getting close to rolling out their passport scheme; on March 17th 2021, the European Commission proposed the following draft legislation to create a “Digital Green Certificate” as you can see from this document. In a classic example of doublespeak, Commissioner for Justice, Didier Reynders, said:\n\nNo pre-condition for movement? Not discriminate in any way? The very essence of the vaccine passport is regulate and restrict movement, as well as to discriminate. Otherwise, what is the point of it? This is a constant theme of the COVID op. Politicians make rules to control your life, and right when they announce these rules, they claim they are not controlling you. Black is white, up is down and tyranny is freedom.\n\nThey’re coming to America too. The US state of New York was the first state to introduce a pilot program. Authorities have said it’s optional, but that’s how all these schemes of control initially work; first they’re optional to break down resistance and get people accustomed, and then they’re mandatory. New York is calling its vaccine passport the “Excelsior Pass” and the official announcement states:\n\nOn the upside, there are certain states which have preemptively banned vaccine passports in some form or another, including Florida, Texas, Arizona, Montana and Idaho. As for much of the duration of the COVID op, support or resistance to vaccine passports is mostly following party lines, with the left-wing Democratic states supporting it and the right-wing Republican states resisting it.\n\nIsrael has earned itself another dubious distinction by leading the world in COVID vaccination rates, and by already implementing its vaccine passport program. Unvaccinated Israelis are being banned from going to so-called non-essential places. Tyrannical Israeli Health Minister Yuli Edelstein warned:\n\nThe tyranny doesn’t stop there. Israel has also issued “Freedom Bracelets” to be worn by those entering the country from abroad. Israel’s parliament joined action taken previously by the Spanish government in approving a law to create a registry of people refusing the COVID vax. Interestingly, UK Cabinet Office minister Michael Gove was recently seen arriving in Israel for what they say was “vaccine passport talks” but in reality, from those who know the backstory of the Zionist New World Order (NWO), was likely his marching orders.\n\nChina and India have both joined the vaccine passport game. China called their version the “International Travel Health Certificate” (downloadable from its WeChat mobile app) while India has a QR code certificate version.\n\nOne Passport to Rule Them All\n\nNo matter what fancy and different names these passports, apps and QR codes have, there are plans afoot to link them all via a common software or framework. The leading developers of this technology include AOK Pass, Common Pass, the Vaccination Credential Initiative, Good Health Pass Collaborative and the IATA Travel Pass. This is a clear manifestation of the NWO Agenda of a One World Government with detailed information on every single person (except for the ruling elite) on Earth, who are planned to be its subjects or slaves.\n\nThis has been a long time coming. It seems like a long time ago now – over a year ago – when Bill Gates started mouthing off about the need for immunity certificates and digital vaccine passports. The plan is not hidden, but rather wide out in the open. Of course, there is a distinct lack of logic about the whole issue. First of all, as I have exhaustively documented, there is no evidence that the virus SARS-CoV-2 exists. But putting that inconvenient truth aside for a moment, why couldn’t natural immunity to the virus qualify you for the vaccine passport? Mainstream brainwashed medical authorities may say it’s because you can still get re-infected. However the same goes for the vaccine … hence all the talks of a 2nd and 3rd shot (actually the plan is to give people countless shots as they upgrade and rewire their DNA operating system). This is the very same group of vaccines which by the way don’t give you proper immunity and are even admitted to only protect against mild symptoms and not to stop transmission.\n\nIt’s not about actual real immunity to disease. It’s about finding out who is vaccinated and who is unvaccinated, and subsequently punishing the non-compliant, disobedient, recalcitrant unvaccinated ones.\n\nFor those who want their shiny new vaccine passport – think about this. What happens when the authorities say that you have to keep getting vaxxed … and vaxxed … and vaxxed … every year … just to keep your passport and privileges? Are we going to stand in our inherent soveriegn rights or grovel beneath the slavemasters for government-bestowed privileges?\n\nThe truth is that vaccine passports are a scheme to force people into getting vaxxed so that they become genetically modified humans. The vaccine is the real bioweapon, not an imaginary virus. The vaccine passports will function to make life uncomfortable for the unvaccinated, and also as a registration system to distinguish between the vaccinated and unvaccinated, so the NWO controllers know exactly which citizens have certain nanotechnology embedded inside of them – which you can be sure will be used to further whatever nefarious goals the NWO manipulators have in mind.\n\nMakia Freeman is the editor of alternative media / independent news site The Freedom Articles, author of the book Cancer: The Lies, the Truth and the Solutions and senior researcher at ToolsForFreedom.com. Makia is on Steemit and LBRY.", "opengraph": {"locale": "en_US", "type": "article", "title": "Vaccine Passports: One Passport to Rule Them All - Activist Post", "description": "Here is a brief list of the vaccine passport schemes that are either proposed, about to be rolled out or already in existence.", "url": "https://www.activistpost.com/2021/04/vaccine-passports-one-passport-to-rule-them-all.html", "site_name": "Activist Post", "article:publisher": "http://www.facebook.com/activistpost", "article:published_time": "2021-04-22T16:53:16+00:00", "image": "https://www.activistpost.com/wp-content/uploads/2021/04/health-passport-fa.jpg", "image:width": "1184", "image:height": "695", "image:type": "image/jpeg"}, "tags": ["Vaccine Passport", "Human Rights", "Travel", "Makia Freeman"], "tweets": [], "movies": [], "links": ["https://www.activistpost.com/wp-content/uploads/2021/04/health-passport-fa.jpg", "https://thefreedomarticles.com/author/makia/", "https://ec.europa.eu/transparency/regdoc/rep/1/2018/EN/COM-2018-244-F1-EN-MAIN-PART-1.PDF", "https://thefreedomarticles.com/toxic-vaccine-adjuvants-the-top-10/", "https://thefreedomarticles.com/10-things-to-know-experimental-covid-vaccines/", "https://thefreedomarticles.com/same-fake-pandemic-similarities-1976-swine-flu-2020-covid/", "https://shop.puri.sm/?wpam_id=87", "https://ec.europa.eu/commission/presscorner/detail/en/ip_21_1181", "https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:52021PC0130", "https://www.governor.ny.gov/news/governor-cuomo-announces-pilot-program-testing-excelsior-pass-madison-square-garden-and", "https://www.nbcnews.com/news/us-news/these-states-are-attempting-ban-or-curtail-use-vaccine-passports-n1264665", "https://www.timesofisrael.com/government-plans-to-punish-businesses-that-serve-unvaccinated-customers-report/", "https://youtu.be/qgd_mVbZBcU", "https://www.politico.eu/article/spain-coronavirus-vaccine-refusal-registry-with-eu-countries/", "https://www.cbsnews.com/news/covid-vaccine-israel-law-personal-information-privacy/", "https://jewishnews.timesofisrael.com/michael-gove-arrives-in-israel-for-vaccine-passport-talks/", "https://thefreedomarticles.com/israel-planned-home-of-new-world-order/", "https://asia.nikkei.com/Spotlight/Coronavirus/China-rolls-out-vaccine-passport-aiming-to-revive-foreign-travel", "https://www.hindustantimes.com/cities/others/got-covid-19-vaccine-you-ll-get-qr-code-certificate-on-phone-101610479579084.html", "https://www.aokpass.com/", "https://thecommonsproject.org/commonpass", "https://vaccinationcredential.org/", "https://www.goodhealthpass.org/", "https://www.iata.org/en/programs/passenger/travel-pass/", "https://thefreedomarticles.com/digital-vaccine-certificates-bill-gates-plan-post-coronavirus/", "https://thefreedomarticles.com/10-reasons-sars-cov-2-imaginary-digital-theoretical-virus/", "https://thefreedomarticles.com/", "https://www.amazon.com/dp/B08FBQQQ8X/", "http://toolsforfreedom.com/", "https://steemit.com/@makiafreeman", "https://lbry.tv/@makiafreeman:8", "https://ec.europa.eu/transparency/regdoc/rep/1/2018/EN/COM-2018-244-F1-EN-MAIN-PART-1.PDF", "https://thefreedomarticles.com/toxic-vaccine-adjuvants-the-top-10/", "https://thefreedomarticles.com/10-things-to-know-experimental-covid-vaccines/", "https://thefreedomarticles.com/same-fake-pandemic-similarities-1976-swine-flu-2020-covid/", "https://ec.europa.eu/commission/presscorner/detail/en/ip_21_1181", "https://eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:52021PC0130", "https://www.governor.ny.gov/news/governor-cuomo-announces-pilot-program-testing-excelsior-pass-madison-square-garden-and", "https://www.nbcnews.com/news/us-news/these-states-are-attempting-ban-or-curtail-use-vaccine-passports-n1264665", "https://www.timesofisrael.com/government-plans-to-punish-businesses-that-serve-unvaccinated-customers-report/", "https://www.youtube.com/watch?v=qgd_mVbZBcU", "https://www.politico.eu/article/spain-coronavirus-vaccine-refusal-registry-with-eu-countries/", "https://www.cbsnews.com/news/covid-vaccine-israel-law-personal-information-privacy/", "https://smartlivingshopper.clickfunnels.com/webinar-registrationtp09jgx5", "https://smartlivingshopper.clickfunnels.com/webinar-registrationtp09jgx5", "https://jewishnews.timesofisrael.com/michael-gove-arrives-in-israel-for-vaccine-passport-talks/", "https://thefreedomarticles.com/israel-planned-home-of-new-world-order/", "https://asia.nikkei.com/Spotlight/Coronavirus/COVID-vaccines/China-rolls-out-vaccine-passport-aiming-to-revive-foreign-travel", "https://www.hindustantimes.com/cities/others/got-covid-19-vaccine-you-ll-get-qr-code-certificate-on-phone-101610479579084.html", "https://www.aokpass.com/", "https://thecommonsproject.org/commonpass", "https://vci.org/", "https://www.goodhealthpass.org/", "https://www.iata.org/en/programs/passenger/travel-pass/", "https://thefreedomarticles.com/digital-vaccine-certificates-bill-gates-plan-post-coronavirus/", "https://thefreedomarticles.com/10-reasons-sars-cov-2-imaginary-digital-theoretical-virus/", "https://truthunmuted.org/vaccine-passports-and-medical-martial-law/", "https://thefreedomarticles.com/vaccine-passports-one-passport-to-rule-them-all/", "https://www.patreon.com/bePatron?u=5719077", "https://www.subscribestar.com/activist-post", "https://www.activistpost.com/support", "https://www.activistpost.com/survive-job-automation-apocalypse", "https://t.me/activistpost", "https://somee.social/profile/activist-post/timeline", "https://hive.blog/@activistpost", "https://flote.app/ActivistPost", "https://www.minds.com/ActivistPost", "https://mewe.com/i/activistpost", "https://twitter.com/ActivistPost", "https://gab.com/activist", "https://ruqqus.com/@ActivistPost", "http://countermarkets.com/"], "authors": ["Activist Post"], "publish_date": "2021-04-22T16:53:16+00:00"}