{"result_id": "009036", "URL": "https://www.activistpost.com/product/151070843X/US/permacultucom-20/", "timestamp": "2023-04-25 11:50:39 CEST+0200", "meta": {"description": "Master Manipulator: The Explosive True Story of Fraud, Embezzlement, and Government Betrayal at the CDC [Grundvig, James Ottar, Kennedy Jr., Robert F., Attkisson, Sharyl] on Amazon.com. *FREE* shipping on qualifying offers. Master Manipulator: The Explosive True Story of Fraud, Embezzlement, and Government Betrayal at the CDC", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.amazon.com/Master-Manipulator-Explosive-Embezzlement-Government/dp/151070843X", "encoding": "utf-8"}, "image": null, "domain": "www.activistpost.com", "title": "Master Manipulator: The Explosive True Story of Fraud, Embezzlement, and Government Betrayal at the CDC: Grundvig, James Ottar, Kennedy Jr., Robert F., Attkisson, Sharyl: 9781510708433: Amazon.com: Books", "cleaned_text": "I wanted to spend some time praising James Ottar Grundvig's wonderful new book, \"Master Manipulator: The Explosive True Story of Fraud, Embezzlement, and Government Betrayal at the CDC\" because I think it is something unique in the canon of autism literature.\n\n\n\nWe have had the personal stories of families dealing with autism, and we have had some fine books dealing with various medical and scientific issues, but we haven't really had a book which examines at length the political culture in which this epidemic has been allowed to happen. Many of you are aware of Poul Thorsen, the Danish researcher who worked for the CDC and is now a federal fugitive for embezzling more than a million dollars to generate studies exonerating vaccines from causing autism. But what you don't know is how that happened behind the scenes at the CDC.\n\n\n\nThe Thorsen depicted in this book is certainly an intelligent man, figuring out how to data-mine a rich vein of medical information in the Danish health registry. But there is also something else in Thorsen's personality, a need to ingratiate himself to powerful patrons, and give them what they want. It is not an uncommon failing, and may be something particularly American. Grundvig makes the argument that more than anything else, Thorsen wanted to make it big in America, and saw pleasing his superiors at the CDC as just the way to do it. And he also wanted to live large, buying a limited edition Harley, Audi Quattro, Honda SUV, as well as a half-million dollar home in a tony suburb of Atlanta. That money should have been spent doing honest autism research.\n\n\n\nGrundvig has a nice, easy to read style, and at a little more than 250 pages it is a quick read. I believe this is an important story which needs to be widely read in our community and beyond. I encourage people to read it, not to be depressed about how we have been betrayed, but to understand how fragile the facade is which keeps our children in their autism prisons. I'm reminded of what one teacher jokingly told me one day. She said, \"You know, there's more than a thousand kids at this school, and only fifty of us. If they decided to stop listening to us, we'd be screwed.\"\n\n\n\nPeople should read this book to understand one simple fact: Our enemies aren't that strong. They have been flailing for years, trying to keep this story from breaking, and I don't think anybody is more surprised at their success than they are. They know that eventually they will lose. We just need to keep the pressure on. I also have to commend Grundvig for his easy-going, even humorous story-telling. He seems like the kind of guy you'd want to hang out with, have a beer, and swap some stories. If Thorsen represents the worst of America, Grundvig's honest reporting represents the best of American traditions.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["javascript:void(0)"], "authors": [], "publish_date": null}