{"result_id": "009038", "URL": "https://www.activistpost.com/2022/01/defeat-the-mandates-an-american-homecoming.html", "timestamp": "2023-04-25 11:50:43 CEST+0200", "meta": {"description": "About 50,000 Americans met at the Washington Monument at 10:30 AM. They marched peacefully...", "lang": "en", "keywords": "", "favicon": "https://www.activistpost.com/wp-content/uploads/2018/04/cropped-icon-32x32.jpg", "canonical": "https://www.activistpost.com/2022/01/defeat-the-mandates-an-american-homecoming.html", "encoding": "UTF-8"}, "image": null, "domain": "www.activistpost.com", "title": "Defeat The Mandates: An American Homecoming", "cleaned_text": "Defeat The Mandates: An American Homecoming was a two-hour rally on January 23 in the nation’s capital which was part of The Worldwide Rally For Freedom. The event was organized by Vaccine Safety Research Foundation, along with Children’s Health Defense, Front Line Covid-19 Critical Care Alliance, Global Covid Summit, World Council for Health and JP Sears.\n\nThe rally was in response to nearly two years of increasing governmental overreach in the form of mandates at local, state, and federal levels. The goal of the rally was to peacefully protest vaccine mandates, vaccine passports, COVID vaccines for children, and censorship. It celebrated the principles of freedom and liberty upon which our nation was founded. Participants marched in support of informed consent, natural immunity and the doctor-patient relationship that should exist free of government interference..\n\nAbout 50,000 Americans met at the Washington Monument at 10:30 AM. They marched peacefully at 11:30 to the Lincoln Memorial (approximately 1 mile) where the program started around 1:30 PM. The event was held where Dr. Martin Luther King, Jr. gave his historic “I Have a Dream” speech in 1963. The Highwire and Children’s Health Defense live streamed the event which was emceed by J.P. Sears, comedian and self-described “freedom fighter”.\n\nDEFEAT THE MANDATES IN D.C.: AN AMERICAN HOMECOMING (Video)\n\n The speakers start about 3:50 in the video.\n\nMany prominent pro-science anti-mandate advocates addressed the crowd including Robert F. Kennedy, Del Bigtree, Lara Logan, Dr. Paul Marik, Dr. Pierre Kory, Chris Martenson, Steve Kirsch, Dr. Robert Malone, Dr. Peter McCullough, Dr. Christina Parks, Dr. Paul Alexander, Attorney Tricia Lindsay, Kevin Jenkins, Rev. Aaron Lewis, Rabbi Epstein, Tramell Johnson, Jo Rose (Jo Speaks Truth), Angela Stanton King, Kwame Brown, Trahern Crews. Music was also a part of the event with performances by Jimmy Levy and Hi-Rez the rapper, Five Times August, and Matt Brevner.\n\nSeveral of the speakers spoke about the safety of COVID vaccines in addition to objecting to COVID vaccine mandates on democratic principles. The latest data from the U.S. government’s Vaccine Adverse Event Reporting System (VAERS) reports 1,033,994 adverse events, including 21,745 deaths, following COVID vaccination. They challenged the official narrative that the COVID shots are “safe and effective”.\n\n“The rise of tyranny can be stopped only if Americans rise up against it while they still have enough freedom left to do so. Once governments take away the rights of individuals, they are nearly impossible to regain.”\n\nRobert F. Kennedy Jr.’s book The Real Anthony Fauci was published on November 16, 2021. It now has over 8,400 reviews on Amazon with 4.8 stars. The book is a best seller on the lists of The New York Times, Wall Street Journal, USA Today, and Amazon.\n\nNew Findings Will ‘Dismantle the Entire Vaccine Industry’\n\nIn a January 1, 2022 video announcement, Dr. Reiner Fuellmich — a U.S.-German consumer protection trial lawyer and cofounder of the German Corona Extra-Parliamentary Inquiry Committee launched July 10, 2020 — announced the data they now have in their possession is “enough to dismantle the entire vaccine industry.”\n\nFuellmich is heading up the committee’s corona crisis tort case. Initially, the committee focused on exposing the PCR test fraud, but now they also have evidence that the vaccine makers were using different lot numbers to carry out an experiment within an experiment, unbeknownst to the public. According to Fuellmich, it looks like an experiment to determine the dosage needed to kill and/or maim people. In other words, people have not been getting identical products. Different lots or batches contain different dosages and even different ingredients.\n\n“According to Dr. Wolfgang Wodarg, former chair of the Parliamentary Assembly of the Council of Europe Health Committee, they have ‘hard evidence’ of this. He points to an investigation published in late 2021 showing only 5% of the lots were responsible for 100% of the rapid deaths.”\n\n“Everyone who is a part of this – including the doctors who do the pricks, the people who run the place, the people who profit from this, and the governments who encourage people to get vaccinated – is responsible. These are really crimes against humanity. I think we need an international coroner’s court to clean up this mess. This is worse than what happened in the Third Reich. We have to do something, because the people responsible for this know no empathy and are extremely dangerous. They only care about money and power.”\n\nThe following articles show a growing case against those who implemented the COVID “health” policies:\n• Why Joe Rogan’s Interviews on Mass Psychosis “Broke The Internet”\n\nOn June 2, 2020, The British Expose announced: “COVID FRAUD – Big lawsuits to start in next few weeks against WHO, WEF, CDC, PHE and World Leaders for ‘Crimes against Humanity’.\n\n“Since early 2020 much of the western world has been subjected to one of the greatest frauds ever committed against humanity, an alleged pandemic of a new coronavirus which authorities have told us develops into a new disease known as Covid-19. You’ve been lied to, and thanks to hundreds of lawyers and medical professionals who have been working together worldwide gathering evidence on the largest crime committed against humanity since World War II, big lawsuits are set to start on three different continents.\n\nSince July 2020, the Corona Investigative Committee in Germany has taken testimony from a large number of international scientists and experts. The committee has been led by Attorney Dr. Reiner Fuellmich [who]said the WHO, WEF, and people like Bill Gates, Dr Fauci, and Professor Neil Ferguson’s real agenda is “population reduction and population control, which is probably going to be achieved through these vaccinations, which already have extremely serious adverse effects. Another part of the agenda is the destruction of the middle class”.\n\nFuellmich added that you won’t read anything about this in the mainstream media because people like “Klaus Schwab and Bill Gates have invested a lot of money in media companies”.\n\nTHE NARRATIVE IS CRUMBLING – 16 REASONS WHY (video)\n\nThoreau: There Is a Time For Civil Disobedience\n\nThe ripple effect across America of this historic march is going to be gigantic! National Fox News, Local Fox News, USA Today, Forbes, Local NBC, and many other news outlets covered the massive protest. There will probably additional coverage this week. FOX News reported the crowd to be just 35,000 people. However, the event organizers estimated it to be 40,000 to 50,000. As expected, much of the coverage was hostile, but that does not matter. Much of the corporate media was also hostile when Dr. Martin Luther King gave his historic speech at the Lincoln Memorial in 1963. Yet, that changed history.\n\nThere is a time for civil disobedience as Henry David Thoreau wrote in the 19th century in his historic Civil Disobedience and On the Duty of Civil Disobedience. The US Founding Fathers told us in The Declaration of Independence that there is a time to replace governments that don’t serve the needs of the people.\n\nAs America becomes more like Nazi Germany and Communist China every day, the only question now is the one that was asked in the beginning of our republic: “Does the star-spangled banner yet wave o’er the Land of the Free and the Home of the Brave?”\n\nNothing Changes As Long As You Obey\n\nExceptionally Cruel and Insensitive Health Officials by Dr. Mark Sircus should be read in full. Much of it is quoted here. Dr. Sircus says:\n\n“Not only are they cruel and insensitive but they are outright liars (they love scary predictions that do not come true) and do not want to listen to anyone who disagrees with their insensible plans to destroy human civilization. They are destroyers of human existence, human activity, human happiness and even human health. To be in favor of lock-downs is to be for death of the world economy, increased death by suicide, increased death by over a million from tuberculous, vastly increased homelessness, and for millions to die of starvation. That is the short list.\n\nIt has not completely sunk in yet but the real nightmare is just getting started. More than four out of five people in the global labor force of 3.3 billion have been hit by full or partial workplace closures, according to the International Labor Organization, which says 1.6 billion workers in the informal economy “stand in immediate danger of having their livelihoods destroyed.” How a few men got the politicians of the world to do this is something that history will have to eventually answer.\n\nMore than 36 million have filed for unemployment in the United States since mid-March. It is not a depression we are entering but a collapse that could halt most human activity. If the coronavirus pandemic continues to drive unemployment levels as high as predicted, homelessness will increase 40% to 45% by the end of the year, according to an analysis by a Columbia University economics professor. That would mean 250,000 more people in the US would experience homelessness compared with last year, bringing the total number of those experiencing homelessness to above 800,000.\n\nHow can we possibly measure the human suffering as a consequence of what is being done following the orders of health care officials? For those who oppose the orders it might be a good time to revisit the teaching of Martin Luther King Jr. “Martin King, was a minister who exposed the truth that obedience keeps us in chains. His crucial synthesis was to combine disobedience with goodness. His crucial work (and this is greatly under-appreciated) was to hold disobedience and goodness together.”\n\nThere is open lockdown rebellion in Pennsylvania and demonstrations in England and Germany…. World health officials are not practicing medicine or public health, they are practicing cold-hardheartedness. They along with politicians are acting like the original communists and fascists who believed that their way was the only way, killing or censoring anyone who disagrees. Certain epidemiologists have said there is very little sturdy evidence to base lockdown policies on, but this has not prevented politicians from acting as if everything they say or do is based on solid science….\n\nWhile many European cities begin the process of reviving their economies, the Big Apple — America’s coronavirus epicenter — remains shut as authorities fear sparking another wave of COVID-19 infections. So let the city die and long live fear! Sweden never closed down in the first place and they are not having more difficulties with the virus than countries that have locked down their people. We have let the fears of health authorities choke the world and create a form of hysteria never seen before.”\n\n\n\nThe article links to an article about Dr. King: Nothing Changes As Long As You Obey. Also see Dr. Sircus’ articles Greatest Civilization Collapse in History and Medical Coup D’état – The Culling of Humanity.\n\nThe Power of The Powerless\n\nHow can each person help defend America now?\n\nThe Power of the Powerless: Citizens Against the State in Central Eastern Europe book by Vaclav Havel (1985).\n\n The Power of the Powerless book by Vaclav Havel (2018).\n\nAmazon says: “Written in 1978, Václav Havel’s meditation on political dissent – the rituals of its suppression, and the sparks that re-ignite it – would prove the guiding manifesto for uniting Solidarity movements across the Soviet Union. A portrait of activism in the face of falsehood and intimidation,\n\n The Power of the Powerless remains a rousing call against the allure of apathy.”\n\nThe Power of The Powerless\n\nAudio synopsis of the book which shows the power of living your truth.\n\n“This book was once famous, but was mostly forgotten when Communism died and so-called liberal democracy seemed ascendant. It is increasingly famous again, and relevant, in these days of a new creeping totalitarianism, this time in the West itself.\n\nHavel, for a time one of the most famous men in the world, was a Czech playwright, and an opponent of its Soviet-installed Communist system. He shot to prominence in the mid-1970s, although he had been involved in opposition to Communism since the late 1960s. As viewed from the West, he became one of the key voices of dissent, and he had a political career after the fall of Communism. But when he wrote this long essay, he was relatively obscure outside Czechoslovakia, and this essay, The Power of the Powerless, was the catalyst and skeleton for much of the subsequent internal opposition to Communism in Central Europe.”\n\nPresident of Czechoslovakia\n\n December 29, 1989 — July 20, 1992President of the Czech RepublicFebruary 2, 1993 February 2, 2003\n\n“Václav Havel 1936–2011) was a Czech statesman, playwright, and former dissident, who served as the last President of Czechoslovakia from 1989 until the dissolution of Czechoslovakia in 1992 and then as the first President of the Czech Republic from 1993 to 2003. He was the first democratically elected president of either country after the Fall of Communism. As a writer of Czech literature, he is known for his plays, essays, and memoirs.\n\nHavel first rose to prominence as a playwright. …After participating in the Prague Spring and being blacklisted after the Warsaw Pact invasion of Czechoslovakia, he became more politically active and helped found several dissident initiatives, including Charter 77 and the Committee for the Defense of the Unjustly Prosecuted. His political activities brought him under the surveillance of the StB secret police, and he spent multiple periods as a political prisoner, the longest of his imprisoned terms being nearly four years, between 1979 and 1983.\n\nHavel’s Civic Forum party played a major role in the Velvet Revolution that toppled the Communist system in Czechoslovakia in 1989. He assumed the presidency shortly thereafter, and was re-elected in a landslide the following year and after Slovak independence in 1993. Havel was instrumental in dismantling the Warsaw Pact and enlargement of NATO membership eastward….\n\nHe received numerous accolades during his lifetime, including the Presidential Medal of Freedom, the Gandhi Peace Prize, the Philadelphia Liberty Medal, the Order of Canada, the Four Freedoms Award, the Ambassador of Conscience Award, and the Hanno R. Ellenbogen Citizenship Award. The 2012–2013 academic year at the College of Europe was named in his honour. He is considered by some to be one of the most important intellectuals of the 20th century. The international airport in Prague was renamed to Václav Havel Airport Prague in 2012.”\n\n\n\nThe Power Of The Powerless (1978) – Vaclav Havel\n\nHavel says “dissidents” are not always famous people. They are also unknown people who have the courage to live their truth.\n\nBecome a Patron!\n\n Or support us at SubscribeStar\n\n Donate cryptocurrency HERE\n\nSubscribe to Activist Post for truth, peace, and freedom news. Follow us on Telegram, HIVE, Flote, Minds, MeWe, Twitter, Gab, What Really Happened and GETTR.\n\n\n\nProvide, Protect and Profit from what’s coming! Get a free issue of Counter Markets today.", "opengraph": {"locale": "en_US", "type": "article", "title": "Defeat The Mandates: An American Homecoming - Activist Post", "description": "About 50,000 Americans met at the Washington Monument at 10:30 AM. They marched peacefully...", "url": "https://www.activistpost.com/2022/01/defeat-the-mandates-an-american-homecoming.html", "site_name": "Activist Post", "article:publisher": "http://www.facebook.com/activistpost", "article:published_time": "2022-01-24T15:34:43+00:00", "article:modified_time": "2022-01-25T00:00:36+00:00", "image": "https://www.activistpost.com/wp-content/uploads/2022/01/mandates.jpg", "image:width": "919", "image:height": "517", "image:type": "image/jpeg"}, "tags": ["Protest", "Neenah Payne", "Mandatory vaccines"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "777", "height": "437", "embed_code": "<iframe loading=\"lazy\" title=\"The Power of the Powerless\" width=\"777\" height=\"437\" src=\"https://www.youtube.com/embed/2Dk9J4trZaI?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/2Dk9J4trZaI?feature=oembed"}], "links": ["https://www.activistpost.com/wp-content/uploads/2022/01/mandates.jpg", "https://www.activistpost.com/tag/neenah-payne", "https://defeatthemandatesdc.com/", "https://worldwidedemonstration.com/", "https://www.vacsafety.org/", "https://childrenshealthdefense.org/", "https://covid19criticalcare.com/", "https://globalcovidsummit.org/", "https://worldcouncilforhealth.org/", "https://awakenwithjp.com/", "https://childrenshealthdefense.org/defender/supreme-court-vaccine-mandates-false-claims/", "https://childrenshealthdefense.org/defender/digital-vaccine-passports-surveillance-capitalism-covid-gates/", "https://childrenshealthdefense.org/defender/physicians-scientists-kids-should-not-get-covid-vaccine/", "https://childrenshealthdefense.org/defender/lives-destroyed-government-failure-natural-immunity/", "https://kinginstitute.stanford.edu/king-papers/documents/i-have-dream-address-delivered-march-washington-jobs-and-freedom", "https://thehighwire.com/", "https://live.childrenshealthdefense.org/dc-defeat-the-mandates-livestream", "https://thehighwire.com/watch", "https://childrenshealthdefense.org/defender/paul-marik-lawsuit-hospital-remdesivir-ban-life-saving-drugs/", "https://childrenshealthdefense.org/defender/covid-ivermectin-could-have-saved-millions-lives/", "https://childrenshealthdefense.org/defender/joe-rogan-robert-malone-interview-covid-vaccine/", "https://childrenshealthdefense.org/transcripts/truth-with-rfk-jr-and-dr-peter-mccullough-the-age-of-covid-and-abrogation-of-hippocratic-oath/", "https://childrenshealthdefense.org/defender/vaers-cdc-myocarditis-tops-list-covid-vaccine-injuries-teens/", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=CAT&EVENTS=ON&VAX=COVID19", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes", "https://www.activistpost.com/product/1510766804/US/permacultucom-20/?cart=y", "https://www.activistpost.com/wp-content/uploads/2022/01/defeat-m.jpg", "https://www.bitchute.com/video/v1xfTeZMOdR7/", "https://dailyexpose.uk/2021/10/31/100-percent-of-covid-19-vaccine-deaths-caused-by-just-5-percent-of-the-batches-produced/", "https://www.activistpost.com/wp-content/uploads/2022/01/truth-mlk.jpg", "https://www.activistpost.com/2022/01/will-shocking-discovery-end-covid-coup-now.html", "https://www.activistpost.com/2022/01/congress-demands-info-on-faucis-covid-funding-role.html", "https://www.activistpost.com/2022/01/covid-premeditated-mass-murder-case-against-big-pharma.html", "https://www.activistpost.com/2022/01/why-joe-rogans-interviews-on-mass-psychosis-broke-the-internet.html", "https://dailyexpose.uk/2021/06/02/covid-fraud-big-lawsuits-to-start-in-next-few-weeks-against-who-wef-cdc-phe-and-world-leaders-for-crimes-against-humanity/", "https://celebsaga.com/dr-reiner-fuellmich-wikipedia/", "https://www.bitchute.com/video/kf0bUOw8MDsr/", "https://www.foxnews.com/politics/washington-dc-defeat-mandates-march-covid-vaccine", "https://live.childrenshealthdefense.org/dc-defeat-the-mandates-livestream", "https://www.usatoday.com/picture-gallery/news/nation/2022/01/23/defeat-mandates-rally-washington/6629955001/", "https://www.forbes.com/sites/brucelee/2022/01/23/defeat-the-mandates-rally-against-covid-19-precautions-held-during-omicron-surge/?sh=40c60f7065cf", "https://www.nbcwashington.com/news/coronavirus/demonstrators-march-to-defeat-the-mandates/2945510/", "https://en.wikipedia.org/wiki/Henry_David_Thoreau", "https://www.activistpost.com/product/1619490927/US/permacultucom-20/?cart=y", "https://www.activistpost.com/product/1546438696/US/permacultucom-20/?cart=y", "https://www.ncregister.com/blog/guest-blogger/the-declaration-of-independence-of-the-united-states-of-america?utm_source=google&utm_medium=cpc&utm_campaign=ncrtraffic&gclid=EAIaIQobChMIqv71yvbC6QIVUPDACh2twAc4EAAYAyAAEgK6B_D_BwE", "https://www.activistpost.com/wp-content/uploads/2022/01/linc-jeff.jpg", "https://drsircus.com/general/exceptionally-cruel-and-insensitive-health-officials/", "https://apnews.com/15c1c419c1c84f705a9be337222b812f", "https://edition.cnn.com/2020/05/15/us/homelessness-unemployment-increase-report-pandemic-trnd/index.html", "https://freemansperspective.com/nothing-changes-as-long-as-you-obey/", "https://mises.org/wire/shutdown-may-soon-collapse-pennsylvania-thanks-local-resistance", "https://www.youtube.com/watch?v=JdF-p97NdaY", "https://freemansperspective.com/nothing-changes-as-long-as-you-obey/", "https://drsircus.com/general/greatest-civilization-collapse-in-history/", "https://drsircus.com/general/medical-coup-detat-the-culling-of-humanity/", "https://www.activistpost.com/product/B01LXW30DK/US/permacultucom-20/?cart=y", "https://www.activistpost.com/product/178487504X/US/permacultucom-20/?cart=y", "https://theworthyhouse.com/2018/05/18/book-review-power-powerless-vaclav-havel/", "https://smartlivingshopper.clickfunnels.com/webinar-registrationtp09jgx5", "https://smartlivingshopper.clickfunnels.com/webinar-registrationtp09jgx5", "https://www.activistpost.com/wp-content/uploads/2022/01/vaclav-havel.jpg", "https://en.wikipedia.org/wiki/Dissident", "https://en.wikipedia.org/wiki/President_of_Czechoslovakia", "https://en.wikipedia.org/wiki/Dissolution_of_Czechoslovakia", "https://en.wikipedia.org/wiki/President_of_the_Czech_Republic", "https://en.wikipedia.org/wiki/Fall_of_Communism", "https://en.wikipedia.org/wiki/Prague_Spring", "https://en.wikipedia.org/wiki/Warsaw_Pact_invasion_of_Czechoslovakia", "https://en.wikipedia.org/wiki/Charter_77", "https://en.wikipedia.org/wiki/Committee_for_the_Defense_of_the_Unjustly_Prosecuted", "https://en.wikipedia.org/wiki/StB", "https://en.wikipedia.org/wiki/Political_prisoner", "https://en.wikipedia.org/wiki/Civic_Forum", "https://en.wikipedia.org/wiki/Velvet_Revolution", "https://en.wikipedia.org/wiki/Slovak_independence", "https://en.wikipedia.org/wiki/Warsaw_Pact", "https://en.wikipedia.org/wiki/Enlargement_of_NATO", "https://en.wikipedia.org/wiki/Presidential_Medal_of_Freedom", "https://en.wikipedia.org/wiki/Gandhi_Peace_Prize", "https://en.wikipedia.org/wiki/Philadelphia_Liberty_Medal", "https://en.wikipedia.org/wiki/Order_of_Canada", "https://en.wikipedia.org/wiki/Four_Freedoms_Award", "https://en.wikipedia.org/wiki/Ambassador_of_Conscience_Award", "https://en.wikipedia.org/wiki/Hanno_R._Ellenbogen_Citizenship_Award", "https://en.wikipedia.org/wiki/College_of_Europe", "https://en.wikipedia.org/wiki/Airport", "https://en.wikipedia.org/wiki/Prague", "https://en.wikipedia.org/wiki/V%C3%A1clav_Havel_Airport_Prague", "https://aatayyab.wordpress.com/2020/10/21/the-power-of-the-powerless-1978-vaclav-havel/", "https://www.activistpost.com/wp-content/uploads/2022/01/dissident.png", "https://www.patreon.com/bePatron?u=5719077", "https://www.subscribestar.com/activist-post", "https://www.activistpost.com/support", "https://www.activistpost.com/survive-job-automation-apocalypse", "https://t.me/activistpost", "https://hive.blog/@activistpost", "https://flote.app/ActivistPost", "https://www.minds.com/ActivistPost", "https://mewe.com/i/activistpost", "https://twitter.com/ActivistPost", "https://gab.com/activist", "https://www.whatreallyhappened.com/?q=users/activistpost", "https://gettr.com/user/activistpost", "http://countermarkets.com/"], "authors": ["Activist Post"], "publish_date": "2022-01-24T15:34:43+00:00"}