{"result_id": "009037", "URL": "https://www.activistpost.com/2021/10/cops-resist-chicago-could-lose-50-of-police-force-over-vaccine-mandate.html", "timestamp": "2023-04-25 11:50:43 CEST+0200", "meta": {"description": "The police union is preparing a lawsuit against the city if Mayor Lori Lightfoot’s administration attempts to enforce the mandate.", "lang": "en", "keywords": "", "favicon": "https://www.activistpost.com/wp-content/uploads/2018/04/cropped-icon-32x32.jpg", "canonical": "https://www.activistpost.com/2021/10/cops-resist-chicago-could-lose-50-of-police-force-over-vaccine-mandate.html", "encoding": "UTF-8"}, "image": null, "domain": "www.activistpost.com", "title": "Cops Resist: Chicago Could Lose 50% Of Police Force Over Vaccine Mandate", "cleaned_text": "The pressure of COVID vaccine dictatorship is creating battle lines in the oddest places, like Chicago’s police force. It is risking a mass firing over employees refusing to take the gene therapy injections, which could be catastrophic to law and order in an already troubled city. — Technocracy News & Trends Editor Patrick Wood\n\nThe head of the Chicago police officers union on Tuesday called on its members to refuse to comply with the city’s COVID-19 vaccine mandate, which is set to take effect on Friday.\n\n“Do not fill out the portal information,” Chicago Fraternal Order of Police President John Catanzara said in a video to officers posted on YouTube. “I’ve made my status very clear as far as the vaccine, but I do not believe the city has the authority to mandate that to anybody—let alone that information about your medical history.”\n\nAccording to Catanzara, the police union is preparing a lawsuit against the city if Mayor Lori Lightfoot’s administration attempts to enforce the mandate, which requires city workers to report their vaccine status by Friday or be placed on a “no-pay” status.\n\n“It’s safe to say that the city of Chicago will have a police force at 50 percent or less for this weekend coming up,” Catanzara said.\n\nThe Epoch Times has contacted Lightfoot’s office for comment.\n\n“I can guarantee you that no-pay status will not last more than 30 days,” Catanzara said on Tuesday. “There’s no way they’re going to be able to sustain a police department workforce at 50 percent capacity or less for more than seven days without something budging.”\n\n“This is very clearly not a job action,” he added, “not a call for a strike.”\n\nThe police union head in his video instructs members to file for exemptions to receiving the COVID-19 vaccine but to not enter that information into the city’s vaccine portal.\n\nResponding to Cantanzara’s video during a press briefing on Wednesday, Lightfoot accused him of spreading false information, dismissing most of his statements as “untrue or patently false.”\n\n“What we’re focused on is making sure that we maximize the opportunity to create a very safe workplace,” Lightfoot told reporters. “The data is very clear. It is unfortunate that the FOP leadership has chosen to put out a counter narrative. But the fact of the matter is, if you are not vaccinated, you are playing with your life, the life of your family, the life of your colleagues, and members of the public.”\n\nBecome a Patron!\n\n Or support us at SubscribeStar\n\n Donate cryptocurrency HERE\n\nSubscribe to Activist Post for truth, peace, and freedom news. Follow us on Telegram, HIVE, Flote, Minds, MeWe, Twitter, Gab and What Really Happened.\n\n\n\nProvide, Protect and Profit from what’s coming! Get a free issue of Counter Markets today.", "opengraph": {"locale": "en_US", "type": "article", "title": "Cops Resist: Chicago Could Lose 50% Of Police Force Over Vaccine Mandate - Activist Post", "description": "The police union is preparing a lawsuit against the city if Mayor Lori Lightfoot’s administration attempts to enforce the mandate.", "url": "https://www.activistpost.com/2021/10/cops-resist-chicago-could-lose-50-of-police-force-over-vaccine-mandate.html", "site_name": "Activist Post", "article:publisher": "http://www.facebook.com/activistpost", "article:published_time": "2021-10-14T18:20:15+00:00", "image": "https://www.activistpost.com/wp-content/uploads/2021/10/Chicago-police.jpg", "image:width": "768", "image:height": "432", "image:type": "image/jpeg"}, "tags": ["Chicago", "Police", "Employment", "Mandatory vaccines"], "tweets": [], "movies": [], "links": ["https://www.activistpost.com/wp-content/uploads/2021/10/Chicago-police.jpg", "https://www.activistpost.com/product/0986373982/US/permacultucom-20/?cart=y", "https://www.theepochtimes.com/t-chicago", "https://www.theepochtimes.com/t-covid-19-vaccine-mandate", "https://www.youtube.com/watch?v=uWPl--cAG7I&t=7s", "https://www.theepochtimes.com/t-lori-lightfoot", "https://smartlivingshopper.clickfunnels.com/webinar-registrationtp09jgx5", "https://smartlivingshopper.clickfunnels.com/webinar-registrationtp09jgx5", "https://www.theepochtimes.com/chicago-police-union-head-calls-on-members-to-defy-vaccine-mandate_4048489.html", "https://www.technocracy.news/cops-resist-chicago-could-lose-50-of-police-force-over-vaccine-mandate/", "https://www.patreon.com/bePatron?u=5719077", "https://www.subscribestar.com/activist-post", "https://www.activistpost.com/support", "https://www.activistpost.com/survive-job-automation-apocalypse", "https://t.me/activistpost", "https://hive.blog/@activistpost", "https://flote.app/ActivistPost", "https://www.minds.com/ActivistPost", "https://mewe.com/i/activistpost", "https://twitter.com/ActivistPost", "https://gab.com/activist", "https://www.whatreallyhappened.com/?q=users/activistpost", "http://countermarkets.com/"], "authors": ["Activist Post"], "publish_date": "2021-10-14T18:20:15+00:00"}