{"result_id": "009051", "URL": "https://www.activistpost.com/2021/08/nyc-unions-protest-covid-vaccine-mandate.html", "timestamp": "2023-04-25 11:50:49 CEST+0200", "meta": {"description": "Organizer Michael Kane explained that the protest is not “anti-vaxx”. It is pro choice. Many people who got the shots support the protest.", "lang": "en", "keywords": "", "favicon": "https://www.activistpost.com/wp-content/uploads/2018/04/cropped-icon-32x32.jpg", "canonical": "https://www.activistpost.com/2021/08/nyc-unions-protest-covid-vaccine-mandate.html", "encoding": "UTF-8"}, "image": null, "domain": "www.activistpost.com", "title": "NYC Unions Protest COVID “Vaccine” Mandate (Updated)", "cleaned_text": "UPDATE: You will find an update about crowd size and media coverage, as well as two additional videos of the rally in the “Event Day” section.\n\nNew York becomes first U.S. city to order COVID vaccines for restaurants, gyms reports:\n\n“New York City will become the first major U.S. city to require proof of COVID-19 vaccination at restaurants, gyms and other businesses, Mayor Bill de Blasio said on Tuesday. New York City’s policy requires proof of at least one dose and will be enforced starting Sept. 13. Like mask mandates and last year’s stay-at-home orders, the plan will likely meet stiff resistance. In France, government imposition of a nationwide health passport proving vaccination has touched off large protests, often dispersed by police using tear gas.”\n\nThere are 2,572 unions in New York City, and resistance to the new measures has begun. Union leaders taking de Blasio’s vaccine mandate for DOE staffers to court explains:\n\n“Union leaders representing 350,000 city workers plan to file a legal action to stop Mayor de Blasio from implementing a vaccine mandate for Department of Education employees without their input. ‘Many of the unions support and urge their members to be vaccinated. However, the city is required to collectively bargain the steps to be taken for implementing this policy’ said Harry Nespoli, chair of the Municipal Labor Committee. His group is filing an unfair labor practices complaint over the new directive. ‘Our members’ bargaining rights in this situation must be preserved. We are willing to discuss the steps for implementation as well as situations where accommodations would be appropriate,’ Nespoli said in the statement released just a few hours after de Blasio announced the new policy.”\n\nAll 148,000 Department of Education workers, including people who are employed in the DOE’s central offices and contractors who work in schools, will be required to have at least one shot by Sept. 27, the mayor said at his daily press briefing Monday morning. De Blasio said he’d implement the policy with or without the support of unions. But Nespoli threatened Monday afternoon that ‘unilateral action by the city will only lead to a delay in the implementation of a policy that is designed to protect the public and its employees.’ Henry Garrido, head of District Council 37 that represents school crossing guards, lunch aides and other DOE staff, said he does not believe the city has the legal authority ‘to change the terms and conditions of employment without bargaining.’\n\nDe Blasio hinted Monday that he may soon require all city workers to get vaccinated as opposed to the current policy of getting the shot or weekly testing.”\n\nN.Y.C. Union Leaders Say Mayor’s Covid Mandate Took Them by Surprise reports:\n\n“Municipal union leaders bristled at Mayor Bill de Blasio’s announcement that workers must get vaccinated or tested weekly, while city workers had mixed reactions. Mayor Bill de Blasio’s declaration on Monday that more than 300,000 municipal workers in New York City must get vaccinated against the coronavirus or agree to weekly testing was an unwelcome surprise to many of the city’s municipal unions.\n\nUnions representing a diverse city work force of firefighters and paramedics have come out against the mayor’s mandate. Some unions have made demands: Exemptions for workers who have antibodies after recovering from Covid-19; workplace testing paid for by the city; overtime for workers who get tested outside work. And just about every major union has argued that the mayor cannot unilaterally impose the mandate without first negotiating with labor leaders.\n\n‘The unions are really, really aggravated that the mayor sprung this on everybody,’ said Harry Nespoli, the president of the sanitation workers’ union….The opposition from unions — based in part on a general reluctance to force members, many of whom are Black and Latino, to get the vaccine — is more rooted in the logistics of offering vaccines or weekly tests, and the discipline for those who do not comply. For now, it seems unlikely that it could lead to lawsuits or strikes….\n\nThe Police Department appears to have one of the lowest vaccination rates among city agencies. The department has administered the vaccine to 43 percent of workers, though other officers have likely received the vaccine on their own. The city’s largest police union, the Police Benevolent Association, has so far declined to comment on the new mandate. Other unions have made their opposition clear: The firefighters’ union said the city should allow members who test positive for antibodies to receive exemptions from the mandate. The paramedics’ union said the city was disregarding its members’ civil liberties, and asked for overtime if workers must get tested outside of work hours.\n\n‘You’re going to have people that are going to resent it,’ Mr. Nespoli said, adding that his sanitation workers — many of whom got sick as they kept working during the pandemic — took specific umbrage at the mayor’s threat that those who did not comply would be put on leave without pay…..\n\nOren Barzilay, the president of a union of emergency medical workers that opposes the mandate, said that some of his 4,300 members have expressed concerns about side effects or complications from the vaccine …. ‘There’s so many questions unanswered,’ he said. ‘How’s it going to be implemented? How are we going to get them tested? What happens to us if we have a side effect? It was just a blanket statement without any action plan.’…\n\nTimmy, a municipal worker who declined to give his last name, said he has been ‘wary’ about getting the vaccine and worried about complications from the shot. ‘I didn’t take it and I’m not going to take it,’ he said, adding that city workers should be able to decide for themselves whether they want to get vaccinated….. ‘I’ll take a test every day if I have to,’ he said.\n\nLeaders of the city’s largest municipal union, District Council 37, had insisted on Monday that the new rules had to be part of collective bargaining negotiations, emphasizing that New York was still a ‘union town.’”\n\nEducators Are First NYC Workers To Face “Vaccine” Mandate\n\nEducators Will Be First N.Y.C. Workers to Face Full Vaccine Mandate reports:\n\n“Mayor Bill de Blasio announced on Monday that all Department of Education employees must have received at least one dose of a coronavirus vaccine by Sept. 27.\n\nThe city’s vaccine requirement, which applies to roughly 148,000 education workers, is also almost certain to be a harbinger of future mandates around the country for school districts, municipal employees, private businesses and federal government agencies in the days and weeks to come, following the Food and Drug Administration’s approval of the Pfizer-BioNTech vaccine for those 16 and older on Monday.\n\nSchools open at full capacity for the city’s roughly 1 million students on Sept. 13. The requirement applies to almost all adults in city school buildings, including teachers, principals, custodians, school safety agents and central staff.\n\nEducation employees are now the first group of New York City workers to face a full vaccine mandate. Last month, the city issued a mandate for all municipal workers that allowed those who were unvaccinated to opt into weekly testing, an option that remains in place for those who don’t work in schools. But Monday’s announcement opens the door to a broader vaccine mandate for city workers, including police officers, which the mayor said the city was considering. About 69 percent of adults in New York City are fully vaccinated.\n\nMr. de Blasio announced last month that educators who did not comply with the vaccination or testing requirement would be suspended without pay, and a similar consequence is likely for those who refuse to be vaccinated under the new mandate. On Monday evening, District Council 37, the union that represents classroom aides, school lunch staff and other school employees, said that it would file a formal complaint against the city over the vaccine mandate….\n\nStill, at least some D.O.E. employees who have resisted getting the vaccine said they were thinking about quitting before the start of the school year. Carlotta Pope, a high school English teacher in Brooklyn who has not been vaccinated, said she would consider teaching in a district that did not have vaccine mandates. “You’re telling me now I have to remove my right” to decide whether to be vaccinated, she said. ‘Me personally, I won’t be a part of that.’ Ms. Pope said she was considering getting vaccinated but she was frustrated that she would no longer have a choice if she wished to keep her job.”\n\nNYC Orders 150,000 Teachers & School Staff To Either Get Vaccinated Or Find A New Job; NJ Orders Jabs For State Workers reports:\n\n“NYC announced a new, revised vaccine mandate for all NYC public school teachers: either get the jab, or go find somewhere else to work…. NYC teachers, as well as principals, other administrators, custodians and central-office staff will no longer have the option of submitting to weekly testing instead of getting the vaccine. The new mandate will impact some 148,000 employers (NYC is home to the largest school district in the country, with more than 1MM students, who we suspect will all be required to get the vaccine once it’s approved for their age groups).”\n\nOn August 25, NY Unions For Choice held a protest at City Hall in Manhattan to demonstrate against medical mandates. It was the largest protest of rank and file union members in NYC history and included unions for firefighters, teachers, nurses, healthcare workers, EMTs, EMS, police, detectives, sanitation, postal workers, federal workers, and more.\n\nNOTE: Pfizer does not mandate COVID jab for its employees, internal documents revealed: “at least 20 percent of its employees have chosen not to receive the jab.”\n\nWatch Michael Kane Promote AUGUST 25th PROTEST in NYC, CITY HALL, 4pm on CROWD SOURCE THE TRUTH HERE. Kane explains that the protest is not “anti-vaxx”. It is pro choice. That’s why even many people who got the shots support the protest.\n\nThere was just a scattering of people when I arrived at 4 p.m., but the street was packed by the time I left a short time later. My guess is that there were at least 500 people, but more were streaming in.\n\nKane announced to the crowd that he is leaving his union after 14 years and called on others to do likewise since the unions are not supporting their rights. He said that 2,000 teachers have signed a Google doc to sue NYC about the vaccine mandate.\n\nI was surprised to see the press out in full force with about five cameras. Channels 4 and 7 were there, so it will be interesting to see how they decide to frame their coverage of this event.\n\nUPDATE: You can see a new interview here with Michael Kane, as well as comments from a pro-vax teacher who is still not pleased by the review process for safety protocols conducted by the unions and a lack of communication. An estimate of three thousand people in attendance was also noted in this reasonably balanced report from PIX11 news:\n\nA report from CBS2 includes a video with brief interviews of attendees and noted “more than a thousand people protested” but their article title says only hundreds.\n\nHere you can see the Associated Press coverage of the event which framed the rally as only a “group” but did also give voice to those in opposition to these mandates.\n\nKane has consistently stated that he is not anti-vaxx. He is pro choice. He also said this is not about a vaccine because there are already discussions about biometric IDs, etc.\n\nA truck went by with a supportive panel on the side and back. A bus driver honked in support of the rally and the crowd roared back. It was great to see so many New Yorkers stand up finally! The crowd extended for about two blocks facing Kane and one block behind him.\n\nAll photos below are courtesy of Neenah Payne unless otherwise noted as Elba Cornier:\n\nCDC Director Rochelle Walensky just reversed policy reports that the “new data” shows the COVID injections don’t stop infection or prevent transmission. So, getting the shot doesn’t protect the people who get it or others. She says we should expect tens of thousands of breakthrough cases.\n\nSo, how does forcing NYC workers to get the shots protect anyone?\n\nSee Del Bigtree demonstrate why natural immunity is vastly superior to COVID shots, as well as ICAN’s NY Vaccinated vs. Unvaccinated Study revealing “staggering statistics which the department of health refuses to acknowledge.\n\nAlso see Why War On Unvaccinated Is So Dangerous For Everyone.\n\nYou can watch an interview with TEACHERS FOR CHOICE Attorney Michael Sussman and Michael Kane discussing vaccination, religious & medical exemptions, in-school COVID testing, censorship and more with (censored) NYU Professor Mark Crispin Miller here.\n\nRFK Jr.’s New Book: The Real Anthony Fauci: Bill Gates, Big Pharma, and the Global War on Democracy and Public Health reveals key additional details about how Fauci misled the federal and state governments to be obsessed with COVID “vaccines”.\n\n“Finally, readers will see how Dr. Fauci and Bill Gates, asserting biosecurity rationales, worked together to finance and promote the very gain-of-function experiments in Wuhan that may have released the COVID-19 pathogen.”\n\nA wealth of research about the censored science on Covid injections can also be found at Natural Blaze here.\n\nBecome a Patron!\n\n Or support us at SubscribeStar\n\n Donate cryptocurrency HERE\n\nSubscribe to Activist Post for truth, peace, and freedom news. Follow us on Telegram, SoMee, HIVE, Flote, Minds, MeWe, Twitter, Gab, Ruqqus , GETTR and What Really Happened.\n\n\n\nProvide, Protect and Profit from what’s coming! Get a free issue of Counter Markets today.", "opengraph": {"locale": "en_US", "type": "article", "title": "NYC Unions Protest COVID “Vaccine” Mandate (Updated) - Activist Post", "description": "Organizer Michael Kane explained that the protest is not “anti-vaxx”. It is pro choice. Many people who got the shots support the protest.", "url": "https://www.activistpost.com/2021/08/nyc-unions-protest-covid-vaccine-mandate.html", "site_name": "Activist Post", "article:publisher": "http://www.facebook.com/activistpost", "article:published_time": "2021-08-28T01:05:01+00:00", "article:modified_time": "2021-08-28T01:10:20+00:00", "image": "https://www.activistpost.com/wp-content/uploads/2021/08/blas-reuters.jpg", "image:width": "1305", "image:height": "657", "image:type": "image/jpeg"}, "tags": ["Mandatory vaccines", "New York", "Employment", "Neenah Payne", "Protest"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "777", "height": "437", "embed_code": "<iframe loading=\"lazy\" title=\"NY Teachers for Choice Not Backing Down CIty Hall Protest August 25\" width=\"777\" height=\"437\" src=\"https://www.youtube.com/embed/XUBZoahmcKA?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/XUBZoahmcKA?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "777", "height": "437", "embed_code": "<iframe loading=\"lazy\" title=\"NYC teachers protest vaccine mandate\" width=\"777\" height=\"437\" src=\"https://www.youtube.com/embed/g521LRLFJZo?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/g521LRLFJZo?feature=oembed"}], "links": ["https://www.activistpost.com/wp-content/uploads/2021/08/blas-reuters.jpg", "https://www.activistpost.com/tag/neenah-payne", "https://www.reuters.com/world/us/nyc-require-proof-vaccination-indoor-activities-mayor-2021-08-03/", "https://nypost.com/2021/08/23/union-leaders-taking-de-blasios-doe-vaccine-mandate-to-court/", "https://nypost.com/2021/08/23/shot-and-awe-nyc-schools-staff-now-required-to-be-vaxxed-by-september/", "https://nypost.com/2021/08/23/shot-and-awe-nyc-schools-staff-now-required-to-be-vaxxed-by-september/", "https://nypost.com/2021/07/26/nyc-expanding-covid-vaccine-or-test-mandate-to-all-city-workers/", "https://www.nytimes.com/2021/07/27/nyregion/vaccine-mandate-nyc-unions.html", "https://www.nytimes.com/2021/07/26/nyregion/covid-vaccine-ny-ca-mandatory.html", "https://www.nytimes.com/2021/07/26/nyregion/covid-vaccine-ny-ca-mandatory.html", "https://www.nytimes.com/2021/08/23/nyregion/nyc-schools-vaccine-mandate.html", "https://www.nytimes.com/2021/08/23/us/politics/fda-approval-pfizer-vaccine.html", "https://www.nytimes.com/2021/08/19/nyregion/nypd-covid-vaccine.html", "https://www.zerohedge.com/political/nyc-orders-150000-teachers-school-staff-either-get-vaccinated-or-find-new-job?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+zerohedge%2Ffeed+%28zero+hedge+-+on+a+long+enough+timeline%2C+the+survival+rate+for+everyone+drops+to+zero%29", "https://teachersforchoice.org/2021/08/07/ny-unions-for-choice-protest/", "https://www.naturalhealth365.com/no-covid-jab-mandate-for-pfizer-3947.html", "https://www.activistpost.com/wp-content/uploads/2021/08/ny-unions-for-choice.jpg", "https://www.youtube.com/watch?v=XUBZoahmcKA", "https://pix11.com/news/coronavirus/thousands-in-nyc-protest-covid-vaccine-mandates-outside-city-hall/", "https://newyork.cbslocal.com/2021/08/25/nyc-covid-vaccine-mandate-protest/", "https://www.activistpost.com/wp-content/uploads/2021/08/IMG_2166-1-rotated.jpg", "https://www.activistpost.com/wp-content/uploads/2021/08/IMG_2200-rotated.jpg", "https://www.activistpost.com/wp-content/uploads/2021/08/IMG_2175.jpg", "https://www.activistpost.com/wp-content/uploads/2021/08/IMG_2185-1.jpg", "https://www.activistpost.com/wp-content/uploads/2021/08/IMG_9565-rotated.jpg", "https://www.activistpost.com/wp-content/uploads/2021/08/IMG_9567-1.jpg", "https://www.activistpost.com/wp-content/uploads/2021/08/IMG_2183-rotated.jpg", "https://www.activistpost.com/wp-content/uploads/2021/08/IMG_2169-rotated.jpg", "https://www.activistpost.com/wp-content/uploads/2021/08/IMG_9569-rotated.jpg", "https://www.activistpost.com/wp-content/uploads/2021/08/IMG_9586-rotated.jpg", "https://www.activistpost.com/wp-content/uploads/2021/08/IMG_9588-rotated.jpg", "https://www.activistpost.com/wp-content/uploads/2021/08/IMG_9592-rotated.jpg", "https://www.activistpost.com/wp-content/uploads/2021/08/IMG_9611.jpg", "https://www.activistpost.com/wp-content/uploads/2021/08/IMG_2179.jpg", "https://www.activistpost.com/wp-content/uploads/2021/08/IMG_2198.jpg", "https://www.activistpost.com/wp-content/uploads/2021/08/IMG_2202-rotated.jpg", "https://www.activistpost.com/wp-content/uploads/2021/08/IMG_2208.jpg", "https://www.activistpost.com/wp-content/uploads/2021/08/IMG_2173.jpg", "https://www.activistpost.com/wp-content/uploads/2021/08/IMG_2194-rotated.jpg", "https://www.ktvu.com/news/cdc-new-data-suggests-vaccinated-people-could-transmit-delta-variant", "https://www.activistpost.com/wp-content/uploads/2021/08/delta-var.jpg", "https://thehighwire.com/videos/episode-226-ahead-of-the-curve/", "https://www.icandecide.org/ican_press/ny-vaccinated-vs-unvaccinated-study-reveals-staggering-statistics-which-the-ny-doh-refuses-to-acknowledge/", "https://www.naturalblaze.com/2021/08/why-war-on-unvaccinated-is-so-dangerous-for-everyone.html", "https://www.activistpost.com/2020/12/nyu-professor-under-fire-for-mask-comments-files-libel-lawsuit.html", "https://rumble.com/vjb89l-the-legal-battle-for-americans-most-basic-rights-with-special-guests-michae.html", "https://www.activistpost.com/product/1510766804/US/permacultucom-20/?cart=y", "https://www.activistpost.com/wp-content/uploads/2021/08/real-fauci.jpg", "https://www.naturalblaze.com/2021/08/film-seeing-2020-the-censored-science.html", "https://www.reuters.com/world/us/nyc-require-proof-vaccination-indoor-activities-mayor-2021-08-03/", "https://www.patreon.com/bePatron?u=5719077", "https://www.subscribestar.com/activist-post", "https://www.activistpost.com/support", "https://www.activistpost.com/survive-job-automation-apocalypse", "https://t.me/activistpost", "https://somee.social/profile/activist-post/timeline", "https://hive.blog/@activistpost", "https://flote.app/ActivistPost", "https://www.minds.com/ActivistPost", "https://mewe.com/i/activistpost", "https://twitter.com/ActivistPost", "https://gab.com/activist", "https://ruqqus.com/@ActivistPost", "https://gettr.com/user/activistpost", "https://www.whatreallyhappened.com/?q=users/activistpost", "http://countermarkets.com/"], "authors": ["Activist Post"], "publish_date": "2021-08-28T01:05:01+00:00"}