{"result_id": "009011", "URL": "https://www.activistpost.com/2021/07/alien-vaccines-with-mutant-spikes.html", "timestamp": "2023-04-25 11:47:06 CEST+0200", "meta": {"description": "The mRNA sequences in the coronavirus vaccines use non-natural genetics to hack the immune system.", "lang": "en", "keywords": "", "favicon": "https://www.activistpost.com/wp-content/uploads/2018/04/cropped-icon-32x32.jpg", "canonical": "https://www.activistpost.com/2021/07/alien-vaccines-with-mutant-spikes.html", "encoding": "UTF-8"}, "image": null, "domain": "www.activistpost.com", "title": "Alien Vaccines with Mutant Spikes", "cleaned_text": "The mRNA sequences in the coronavirus vaccines use alien genetics to hack the immune system. The non-natural genetic sequences and the pre-fusion design turn them into mutant spikes that could damage almost any part of the body, including the brain, ovaries and testes! In fact, according to the 2021 report from the European Medicines Agency, the mRNA in the Moderna vax were found to spread to all tissues in the body, and remained in the brain for 25 hours!\n\nMany conscientious doctors have spoken out publicly about the vaccines and the horrors taking place; they include Dr Peter McCullough, Dr Roger Hodkinson and Dr Byram Bridle, who has pointed out the spike is potentially pathogenic since it could inflame cells in very sensitive areas of the body, especially those that express the ACE2 protein.\n\nInstead of dying from infection, people die from the injections.\n\nSARS-CoV-2 seems to be a lab-made construct, fashioned from viruses that normally live in bats and pangolins. The mRNA coronavirus vaccines are supposed to contain a copy of the genetic code for the spike protein, but instead of recreating the spike, the vaccines reinvent it. Like all genetic interventions created using synthetic biology, the coronavirus vaccines are playing God with genetics by:\n• using different ingredients (a bit like using artificial sweeteners instead of sugar)\n• changing the recipe by altering the words and the way they’re spelled\n• including bits from other recipes (i.e. sequences from unrelated genes)\n• putting a ridiculously long tail on the end to prolong the production of spike proteins\n\nWhen a recipe is delivered to a cell in the form of mRNA, a taskforce is ready to inspect the recipe and decide what to do with it. If the recipe was issued by our own DNA, it might get modified a little bit, and then it’ll probably get sent to the kitchen to be made by the chefs. If, however, it looks as if the mRNA came from a virus, there’s a chance the taskforce will mark the recipe for destruction, so it never reaches the kitchen at all. This is the last defence mechanism we have in terms of our immune system but the alien genetics in the vaccine-mRNA make the recipe seem safe enough so it gets sent to the kitchen, where the chefs make whatever they’re told to make. But what if they don’t understand the recipe? They’ve never seen recipes like this before so what if they get it wrong?\n\nFor that matter, what happens if they do make the spike proteins? Being fortified by the pre-fusion design makes them extra spikey, extra strong, and permanently battle-ready. The NIH considers them to be very potent, and an advert they posted in 2018 said they could induce 10x more antibodies than a wild-type virus!\n\nWhen the structure of a lab-made coronavirus is studied using cryo-EM, the spikey bits on the coronavirus are seen to be regularly popping in and out. These are the bits that attach to ACE2 receptors but this only happens when they’re in the ‘out’ position (as observed in blood samples in the lab). It’s as if the virus only flashes its swords now and again, whereas the vaccine-spikes have been locked into the ‘out’ position with proline, so it’s as if their swords are permanently on show. This pre-fusion version of spike is like an alien warrior on the warpath looking for ACE2. What’s more, there’s a really long tail on the end of the vaccine-mRNA that makes sure lots of spikes get made, so it’s like an army of super-soldiers has been released. This could be a real shock to the body because there’s been no warning of an invasion; the use of unnatural genetic code ensures none of the usual alarms go off – there’s just a sudden onslaught of spikes.\n\nChanging the Language of DNA and RNA\n\n[This section is intended to help explain what XNA is, as well as other mRNA modifications that will be described below. It’s also useful for understanding various other things, such as the gain-of-function research the NIH did with the Chinese, and why SARS-CoV-2 seems to be man-made, which will be covered in more detail in future articles!]\n\nNature uses 20 amino acids to create life – every living thing in the whole wide world uses combinations of these 20 amino acids to make proteins. DNA churns out code for proteins all the time. It does this by using a language that only has four letters: A, T, C, G. These letters stand for Adenine, Thymine, Cytosine, Guanine. A and T go together to make one base pair, and C and G go together to make another base pair.\n\nRNA is a bit different because it uses uridine instead of thymine, so it uses A, U, C, G. (Thymine is also called methyluracil.)\n\nAdenine, thymine, cytosine, guanine and uridine are nucleotides that incorporate phosphates and sugars to form a ‘backbone’. Combining these letters or nucleotides makes ‘words’, or codons, and each codon specifies a particular amino acid should be created. When the amino acids are combined together, they make a particular type of protein. All of this happens inside the cell.\n• Examples: the three nucleotides AAG form a codon which spells out the amino acid Lysine, whilst AGG forms a codon which spells out the amino acid Arginine.\n• Most amino acids can be made using more than one codon. For example, Lysine can also be made with the codon AAA, whilst Arginine can be made with any of these six codons: AGG, CGT, CGC, CGA, CGG, AGA.\n• Even though there are hundreds of amino acids, every living thing on earth is made from the same set of 20 amino acids.\n\nUnfortunately, some bright spark worked out that the two base-pairs formed by DNA and RNA could be represented in computer code by using ones and zeros. This allows scientists to play around with genetic sequences more easily and even invent new versions using stuff that doesn’t occur naturally. There’s no end to what they can do with genetics so a huge amount of effort has been invested in building the industry in a ‘behind the scenes’ kind of way. The idea has been floated that mRNA could be used for ANYTHING, as if it could end up replacing modern medicine entirely despite the fact that most of the human genome is not understood! A whopping 85% of our DNA is dismissed as worthless junk, but new discoveries that prove this wrong are being made all the time.\n\nHow to play God with genetics\n\nStrands of DNA and RNA are formed by stringing together long chains of molecules called nucleotides. A nucleotide is made up of three chemical components: one of the bases (either adenine, guanine, cytosine, thymine or uridine), a phosphate, and a five-carbon sugar group. It’s possible to tinker with all three of these components by using different chemicals; the mRNA vaccines are altering the base by changing the uridine to pseudouridine, and there’s a possibility that changes have been made to some of the phosphate and sugar components as well. Altering any of the three components that make up a nucleotide creates what is known as a nucleic acid analogue, and when the sugar component is swapped for a chemical that’s never used in nature, it’s usually referred to as XNA (xeno nucleic acid). According to Wikipedia:\n\n“Nucleic acid analogues are compounds which are analogous (structurally similar) to naturally occurring RNA and DNA, used in medicine and in molecular biology research. Nucleic acids are chains of nucleotides, which are composed of three parts: a phosphate backbone, a pentose sugar, either ribose or deoxyribose, and one of four nucleobases. An analogue may have any of these altered. …. Nucleic acid analogues are also called Xeno Nucleic Acid and represent one of the main pillars of xenobiology, the design of new-to-nature forms of life based on alternative biochemistries.”\n\nXeno means ‘alien’ or ‘not of this world’ and xeno nucleic acids are classed as alien because they use chemicals that nature never uses. Several types of XNA have been invented so far[i], and these include:\n\nMost (perhaps all) of Moderna’s patents refer to the possibility of using various types of XNA to make their products, in addition to using DNA and RNA. For example, the patent for Moderna’s Betacoronavirus mRNA vaccine was filed in February, 2020, and it describes the possibility of using: “threose nucleic acids (TNAs), glycol nucleic acids (GNAs), peptide nucleic acids (PNAs), locked nucleic acids (LNAs)[iii], ethylene nucleic acids (ENA), cyclohexenyl nucleic acids (CeNA) or chimeras or combinations thereof.”\n\nThe motivation for using XNA is because it helps to stabilize mRNA, and because it protects it from RNases. All types of RNA are vulnerable to degradation because there are lots of RNase enzymes flying around all over the place. They’re literally everywhere – floating around in the air and coursing through our veins. This means precautions have to be taken to limit the effect of RNases during manufacturing; similarly, RNases in people’s bodies can totally destroy mRNA within minutes. Locked nucleic acid (LNA) does not activate RNase enzymes, so it would limit degradation of the mRNA. It’s said that locked nucleic acid (LNA) can be used to modify mRNA in order to stabilize it and get more of it get translated . Overall, LNA prolongs the half-life of mRNA which means more of it gets translated, and more proteins get made. LNA can also be used to stabilize the cap of mRNA, which is the very first bit of a mRNA sequence. (A cap made with LNA is available for sale here.) Another option is to incorporate some LNA nucleotides “at the ends of RNA and DNA sequences to form chimeric oligonucleotides…”\n\nThe EMA and the FDA have previously approved three types of non-natural nucleic acids for various diseases. These include Eteplirsen and Golodirsen which both have a morpholino phosphoramidate backbone, whilst others have a phosphorothioate and 2′ methoxyethyl backbone. The package insert for Golodirsen says every sugar has been replaced with a morpholino ring and every phosphate has been replaced with phosphorodiamidate, whilst the bases remain the same as normal. These modifications are a key feature of Golodirsen, whereas the most prominent modification of the mRNA in the coronavirus vaccine involves changing one of the bases. Instead of using uridine, the vaccines are using pseudouridine, as stated in all their documents. None of the documents refer to using LNA in the cap or anywhere else in the sequence, but it’s perhaps possible that there’s no requirement to report the use of LNA if it’s not a prominent feature. Golodirsen is a tiny construct compared to the mRNA in the vaccines, and a smidge of LNA in the cap might be shrugged off as a technicality.\n\nThe vaccines are heavily modified with pseudouridine\n\nInstead of using uridine to make nucleotides, the Moderna and Pfizer vaccines both use N1mΨ, which is short-hand for the chemical formula ‘N1-methyl-pseudouridine’. Ψ is the symbol for pseudouridine which has different chemical properties to uridine so it affects the way the nucleotides function. Vaccine makers are saying it’s a natural thing because we sometimes make Ψ ourselves, but that doesn’t mean it’s normal for a virus to contain Ψ. What’s more, it’s not clear if humans ever make N1mΨ, which is a methylated version of Ψ, although it has been found now and then in the genetic sequence of some kinds of archaea.\n\nThe first part of the mRNA code for the spike protein of SARS-CoV-2 is:\n\nBut the mRNA vaccines have changed all the uridines to the N1mΨ version of pseudouridine, which is written like this:\n\nThe two researchers who came up with this idea were Katalin Kariko and Drew Weissman from the University of Pennsylvania. They published a paper in 2005 describing how mRNA made with pseudo-U was more likely to work than normal mRNA. Most scientists had given up on using mRNA for gene therapy because the immune system was able to destroy it but pseudo-U could trick the immune system into ignoring the mRNA, meaning it was more likely to get translated. A few years later, Kariko and Weissman made another discovery – using HPLC to remove bacterial residues from mRNA also helped it get translated. The production of mRNA involves using a bacterial plasmid, and this bacteria was contaminating the mRNA to such an extent that it triggered the immune system, which then destroyed the mRNA as well as the bacteria. Using HPLC to purify the mRNA made this less likely to happen, and in 2010, Moderna was founded and immediately began filing patents for mRNA made with pseudouridine. The pseudo-U technique was patented by the University of Pennsylvania and the patents were later assigned to the NIH.\n\nPseudo-U is epigenetic. So is methylation.\n\nEpigenetics is the term used to describe various chemical modifications that are made to DNA and RNA. These changes are influenced by diet, lifestyle, age, etc., and they affect the way our genes work without actually changing the sequence. One of the most common modifications that’s classed as epigenetic involves methylating DNA.\n\nMethylation is the transfer of one carbon atom and three hydrogen atoms (written as ‘CH3’). It plays an important role in health, because it’s involved in the production of DNA and neurotransmitters and the metabolism of histamines and oestrogen. It’s important for the health of the liver and the eyes, and it helps protect a baby while in the womb because it affects the role of syncytin. Usually, humans methylate syncytin genes and this has the effect of silencing them, i.e. preventing them from being expressed, but it’s different in the placenta, where syncytin genes are not methylated and therefore remain active. This stops women having an immune response to being pregnant!\n\nPseudouridine (Ψ) is an isomer of uridine that forms an “unusual carbon-carbon bond between base and sugar” and also adds a hydrogen bond donor. “Thus, Ψ’s chemical properties are distinct from those of uridine, or, indeed, those of any other known nucleotides.” Ψ can change RNA by making its backbone more rigid and altering its structure. This natural modification is also an epigenetic mechanism which is said to be more common in mammals than bacteria, but is still quite rare.\n\nEpigenetic modifications are undertaken by a team of readers, writers and erasers which proofread the RNA and sometimes adds little tweaks here and there. These tweaks involve making small chemical changes without altering the actual sequence of the RNA. There are hundreds of different kinds of modification, and some of them, including Ψ, can occur in response to stress such as heat shock or nutrient deprivation\n\n“The importance of RNA modifications is highlighted by recent studies showing that abnormal RNA modification patterns can have devastating physiological consequences: mutations in RNA-modifying enzymes have been associated with human disorders such as intellectual disability, neuroma-degeneration, obesity and diabetes.”\n\nOur bodies also need to be able to spot when DNA is not methylated; for instance, viruses and bacteria usually contain unmethylated ‘CpG motifs’. These motifs consist of a pair of nucleotides, which is a Cytosine and a Guanine linked by a phosphate. We’ve got special immune cells that can recognize this CpG pattern as being foreign DNA:\n\n“…. bacterial or viral DNA containing CpG dinucleotides is a ‘danger signal’ to vertebrate immune cells, indicating invasion by a pathogen.”\n\nHumans also have DNA with CpG motifs but we tend to methylate them:\n\n“The majority of DNA methylation occurs on cytosines that precede a guanine nucleotide or CpG sites.”\n\nIt’s a very carefully controlled system that’s exploited by the mRNA in the vaccines; being able to use methylated pseudouridine is like having the password to hack our systems and insert new code without us knowing, because it bypasses the immune system and we don’t even know it’s there.\n\nWe hardly ever make pseudo-U, and when we do it more than normal, it can be a sign of disease. For example, elevated pseudouridine levels are linked to prostate cancer. Apart from pseudo-U (Ψ), there are hundreds of other modifications we might make, e.g. methylating cytosine so it turns into m5C or methylating adenine so it becomes m6A (which stands for N6-methyladenosine).\n\nm6A is the most common modification, but it’s still pretty rare: “Around 0.1 to 0.4% of all mRNA adenines are methylated, representing approximately 3-5 modifications per mRNA.” Pseudo-U is classed as one of the “rarer modifications”, with a Ψ/U ratio of around 0.2 – 0.6%. To put this into some perspective, there may be as few as one m6A per 1,000 nucleotides (possibly up to three per 1000 . However, in the small section of code for the spike protein (shown above), there are 10 pseudo-Us in a sequence of just 52 nucleotides. The spike protein contained in the vaccines is 1273 amino acids long and therefore the mRNA code consists of 3819 nucleotides (1273 x 3). It’s not clear if humans ever create N1mΨ but the mRNA vaccines have added hundreds of molecules of it, forming a sequence that is so alien, it might as well be XNA. The whole world is being polluted with this stuff, and the full effects may never be known.\n\nAnother thing the mRNA vaccines may do is modify the phosphate backbone of some of the nucleotides. Most, if not all, of Moderna’s patents describe doing this, just like they do with XNA. It’s described in this patent by Moderna and in this patent by Curevac. The most common change involves replacing the oxygen atom with a sulphur atom to make a phosphorothioate backbone. This modification passes for ‘natural’ based on the results of an unusual discovery in the 1980s. A group of researchers noticed something that happened quite by accident: they had some bacteria in the lab and it spontaneously changed the oxygen to a sulphur. However, this only happened because of the peculiar circumstances – the DNA of the bacteria was partially degraded, it was in a buffer made of Tris-acetate, and it had an electric current applied to it!\n\nUsing a phosphorothioate backbone can help a lab-made genetic construct last longer in the body because it stops it being recognized by enzymes known as nucleases, so there’s less chance of the construct being destroyed by the immune system. It’s been used extensively in a type of adjuvant that contains an unmethylated CpG motif, which, as described above, is associated with bacteria and viruses. The little ‘p’ that links the cytosine and the guanine nucleotides is normally a phosphate, but it’s been turned into a phosphorothioate backbone to make it more stable. This type of adjuvant is called a CpG ODN, and is already in use in the Hepislav vaccine by Dynavax, who say it can stick around in tissues for weeks. An experiment with a similar type of CpG ODN revealed it could play a role in blood clot formation. This experiment compared CpG 2395 with a natural phosphate backbone to CpG 2395 with a phosphorothioate backbone (i.e. the unnatural version). The unnatural CpG was found to induce platelet binding, platelet activation, and platelet aggregation (whilst binding to leukocytes was low). The ones with a natural backbone did not bind or activate platelets. The phosphorothioate version also caused “rapid and extensive thrombus formation” but the natural form did not.\n\nWhen unmethylated CpG ODNs are used as adjuvants, it’s done with the aim of deliberately activating specific immune cells. In direct contrast to this, the vaccine mRNA is modified to avoid activating the immune system at all. For example, it can get past a sensor called TLR-7, which is located in the endosome, and another type called RIG-I, which is located in the cytoplasm. Some of these TLR immune cells also interact with human endogenous retroviruses (HERVs) that are part of our genome.\n\nHERVs comprise about 8% of the human genome. One of these, HERV-W, has two genes which play a pivotal role in the formation of the placenta. These two genes are syncytin-1 and syncytin-2. HERV-W also contains an “immunosuppressive region” that may prevent the mother’s immune system from ‘rejecting’ her growing baby.\n\nThe main aim of the mRNA vaccines is to make sure the mRNA gets translated into spike protein$ and pseudo-U seems to be a quick-fix approach to making that happen. A company called Curevac makes mRNA without using pseudo-U, and one of their research papers pointed out that, “artificial pseudouridylation dramatically affects mRNA function – it changes the genetic code by facilitating non-canonical base pairing in the ribosome decoding center”. In other words, the nucleotide ingredients are combined in an abnormal way when the recipe is made in the kitchen! The paper continues, “…. such an unnatural modification may raise safety concerns and increase regulatory hurdles.” Curevac also claims their method helps to minimize the “side effects” associated with pseudo-U, so presumably Someone Somewhere knows what those side effects could be.\n• The first part of the Pfizer code contains a sequence from the human alpha globin gene. Alpha globin helps make haemoglobin (this is found in red blood cells; it carries oxygen round the body).\n• Two amino acids have been mutated to proline in order to lock the protein into a more rigid position by clamping the two subunits of spike together. This S2P pre-fusion design is being used in several coronavirus vaccines and is patented by the NIH. Similar pre-fusion techniques have been applied to lots of other vaccine-viruses, such as RSV.\n• According to a WHO document, the Pfizer sequence contains bits of genes from the amino-terminal enhancer of split, which may be of human origin, as well as part of the mitochondrial gene mtRNR1, which is linked to the way we regulate insulin and metabolic homeostasis. Adding these gene sequences is said to prolong protein expression.\n• Another way to increase the production of spike proteins is to increase the length of the ‘tail’ of the mRNA, by adding lots and lots of Adenines. The more ‘A’s there are, the more spikes get made. The poly(A) tail in the Pfizer vaccine contains 100 A’s!\n\nIt’s difficult to see how this can be passed off as ‘mRNA’ when it’s really nothing like it. The Reset Crew are scrambling desperately to cover up the effects of the vaccines, perhaps with the knowledge that they have to get us all hooked up with a global vax-ID in time for the roll-out of the Central Bank Digital Currencies, and well before the Global Holodomor that’s currently being orchestrated. After that, the genetic potions would be used to control everyone with a never-ending supply of variant-specific ‘boosters’!\n\nThe antidote to all this is being sure of who we are.\n\n[i] It’s also possible to create entirely new ‘letters’ with XNA – so far, four letters have been discovered that can bind with DNA!\n\n[ii] Other types of LNA are also mentioned in this list, including, “LNA having a β-D-ribo configuration, α-LNA having an α-L-ribo configuration (a diastereomer of LNA), 2′-amino-LNA having a 2′-amino functionalization, and 2′-amino-α-LNA having a 2′-amino functionalization”.\n\nRead much more about the science behind the coronavirus injections at Julie Beal’s archive.\n\nBecome a Patron!\n\n Or support us at SubscribeStar\n\n Donate cryptocurrency HERE\n\nSubscribe to Activist Post for truth, peace, and freedom news. Follow us on Telegram, SoMee, HIVE, Flote, Minds, MeWe, Twitter, Gab, Ruqqus and What Really Happened.\n\n\n\nProvide, Protect and Profit from what’s coming! Get a free issue of Counter Markets today.", "opengraph": {"locale": "en_US", "type": "article", "title": "Alien Vaccines with Mutant Spikes - Activist Post", "description": "The mRNA sequences in the coronavirus vaccines use non-natural genetics to hack the immune system.", "url": "https://www.activistpost.com/2021/07/alien-vaccines-with-mutant-spikes.html", "site_name": "Activist Post", "article:publisher": "http://www.facebook.com/activistpost", "article:published_time": "2021-07-03T00:52:46+00:00", "image": "https://www.activistpost.com/wp-content/uploads/2020/09/dna-corona-vax-pix.jpg", "image:width": "1900", "image:height": "1182", "image:type": "image/jpeg"}, "tags": ["Vaccines", "Science", "Julie Beal", "Genetics"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "777", "height": "437", "embed_code": "<iframe loading=\"lazy\" title=\"Dr Byram Bridle at Derek Sloans press conference &#x2013; June 17, 2021\" width=\"777\" height=\"437\" src=\"https://www.youtube.com/embed/ByW3WrU_Xxs?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/ByW3WrU_Xxs?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "777", "height": "437", "embed_code": "<iframe loading=\"lazy\" title=\"CAN WE CREATE ALIENS? : XENOBIOLOGY AND XNA\" width=\"777\" height=\"437\" src=\"https://www.youtube.com/embed/tkPc7fOa_4k?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/tkPc7fOa_4k?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "777", "height": "437", "embed_code": "<iframe loading=\"lazy\" title=\"How Sacred Geometry is embedded in Your DNA - Secrets of Geometric Art\" width=\"777\" height=\"437\" src=\"https://www.youtube.com/embed/Mynr7uik5-0?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/Mynr7uik5-0?feature=oembed"}], "links": ["https://www.activistpost.com/wp-content/uploads/2020/09/dna-corona-vax-pix.jpg", "https://www.activistpost.com/tag/julie-beal", "https://www.ema.europa.eu/en/documents/assessment-report/spikevax-previously-covid-19-vaccine-moderna-epar-public-assessment-report_en.pdf", "https://www.bitchute.com/video/RC5EDsCSlnJx/", "https://www.bitchute.com/video/XB50xDxuOoPr/", "https://www.youtube.com/watch?v=ByW3WrU_Xxs", "https://en.wikipedia.org/wiki/DNA_synthesis", "https://en.wikipedia.org/wiki/DNA_synthesis", "http://algoart.com/aatable.htm", "https://pubmed.ncbi.nlm.nih.gov/26673725/", "https://en.wikipedia.org/wiki/Xeno_nucleic_acid", "https://en.wikipedia.org/wiki/Nucleic_acid_analogue", "https://patents.justia.com/patent/20170204152", "https://www.modernatx.com/sites/default/files/US10702600.pdf", "https://patents.justia.com/patent/10702600", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7072586/", "https://molecular-cancer.biomedcentral.com/articles/10.1186/s12943-021-01311-z", "https://molecular-cancer.biomedcentral.com/articles/10.1186/s12943-021-01311-z", "https://www.mdpi.com/1999-4923/12/2/102/htm", "https://pubmed.ncbi.nlm.nih.gov/19385620/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7072586/", "https://link.springer.com/article/10.1186/s12915-020-00803-6#ref-CR201", "https://www.accessdata.fda.gov/drugsatfda_docs/label/2019/211970s000lbl.pdf", "https://pubmed.ncbi.nlm.nih.gov/28334758/", "https://www.ema.europa.eu/en/documents/assessment-report/comirnaty-epar-public-assessment-report_en.pdf", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6401265/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3285930/", "https://patents.google.com/patent/EP2600901B1/en", "https://www.thorne.com/take-5-daily/article/what-is-methylation-and-why-should-you-care-about-it", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6401265/", "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1002/wrna.1375", "https://www.repository.cam.ac.uk/bitstream/handle/1810/291098/NCB%20review%20accepted%20revised%20version%20DEC2018.pdf;jsessionid=6F9C222A8828328709F6D3B358BA88B6?sequence=1", "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1002/wrna.1375", "https://dev.biologists.org/content/develop/143/21/3871.full.pdf", "https://journals.biologists.com/dev/article/143/21/3871/47623/Post-transcriptional-modifications-in-development", "https://jlb.onlinelibrary.wiley.com/doi/full/10.1189/jlb.0104034", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3521964/", "https://www.sciencedirect.com/science/article/abs/pii/S1078143920302969", "https://www.repository.cam.ac.uk/bitstream/handle/1810/291098/NCB%20review%20accepted%20revised%20version%20DEC2018.pdf;jsessionid=6F9C222A8828328709F6D3B358BA88B6?sequence=1", "https://www.repository.cam.ac.uk/bitstream/handle/1810/291098/NCB%20review%20accepted%20revised%20version%20DEC2018.pdf;jsessionid=6F9C222A8828328709F6D3B358BA88B6?sequence=1", "https://onlinelibrary.wiley.com/doi/pdfdirect/10.1002/wrna.1375", "https://mbio.asm.org/content/11/5/e02131-20#ref-106", "https://royalsocietypublishing.org/doi/pdf/10.1098/rsob.170077", "https://patents.justia.com/patent/20160024547", "https://patents.google.com/patent/WO2018115527A2/en", "https://pubmed.ncbi.nlm.nih.gov/21203994/", "https://smartlivingshopper.clickfunnels.com/webinar-registrationtp09jgx5", "https://smartlivingshopper.clickfunnels.com/webinar-registrationtp09jgx5", "https://www.fda.gov/media/109802/download", "https://rupress.org/jem/article-pdf/212/2/129/1214535/jem_20140391.pdf", "https://rupress.org/jem/article-pdf/212/2/129/1214535/jem_20140391.pdf", "https://www.frontiersin.org/articles/10.3389/fimmu.2018.02039/full", "https://pubmed.ncbi.nlm.nih.gov/19407656/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5648897/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5648897/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4817881/", "https://medlineplus.gov/genetics/gene/hba1/#conditions", "https://berthub.eu/articles/posts/reverse-engineering-source-code-of-the-biontech-pfizer-vaccine/", "https://www.origene.com/catalog/proteins/recombinant-proteins/tp312475/amino-terminal-enhancer-of-split-aes-nm_001130-human-recombinant-protein", "https://en.wikipedia.org/wiki/MT-RNR1", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6453560/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3597572/", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/944544/COVID-19_mRNA_Vaccine_BNT162b2__UKPAR___PFIZER_BIONTECH__15Dec2020.pdf", "https://www.naturalblaze.com/2021/06/global-famine-why-bioengineered-tiny-humans-for-a-zero-carbon-future.html", "http://www.pixabay.com", "https://www.wired.com/2015/07/chemists-invent-new-letters-natures-genetic-alphabet/", "#_ednref3", "https://www.activistpost.com/tag/julie-beal", "https://www.patreon.com/bePatron?u=5719077", "https://www.subscribestar.com/activist-post", "https://www.activistpost.com/support", "https://www.activistpost.com/survive-job-automation-apocalypse", "https://t.me/activistpost", "https://somee.social/profile/activist-post/timeline", "https://hive.blog/@activistpost", "https://flote.app/ActivistPost", "https://www.minds.com/ActivistPost", "https://mewe.com/i/activistpost", "https://twitter.com/ActivistPost", "https://gab.com/activist", "https://ruqqus.com/@ActivistPost", "https://www.whatreallyhappened.com/?q=users/activistpost", "http://countermarkets.com/"], "authors": ["Activist Post"], "publish_date": "2021-07-03T00:52:46+00:00"}