{"result_id": "009012", "URL": "https://www.activistpost.com/2021/12/vatican-issues-vaccine-mandate-for-all-employees.html", "timestamp": "2023-04-25 11:47:07 CEST+0200", "meta": {"description": "This follows a decree requiring anyone entering Vatican City State to show either proof of vax, a negative test, or proof of recovery.", "lang": "en", "keywords": "", "favicon": "https://www.activistpost.com/wp-content/uploads/2018/04/cropped-icon-32x32.jpg", "canonical": "https://www.activistpost.com/2021/12/vatican-issues-vaccine-mandate-for-all-employees.html", "encoding": "UTF-8"}, "image": null, "domain": "www.activistpost.com", "title": "Vatican Issues Vaccine Mandate for All Employees", "cleaned_text": "As COVID cases continue to rise in Italy due to the new Omicron variant, the Vatican on Thursday imposed a vaccine mandate, issuing a decree requiring all employees to possess a “Green Pass” proving vaccination against the coronavirus.\n\nThis follows a previous decree from the Vatican in September requiring anyone entering Vatican City State to show either proof of full vaccination, a negative COVID test, or proof of recovery from the virus.\n\nAccording to the Dec. 23 decree signed by Vatican Secretary of State Italian Cardinal Pietro Parolin, regular negative tests are no longer enough, and those who do not possess a vaccination pass or proof of recovery from COVID-19 will be barred from coming to work and will not be paid.\n\nPersonnel without a valid Green Pass or proof of recovery “will not be able to access the workplace and must be considered unjustly absent, with the consequent suspension of salary for the duration of the absence,” the decree said.\n\nEmployees who become subject to this “unjustified prolongation of absence” from work could face further consequences according to rules spelled out in the general norms of the Roman Curia for anyone who misses work without authorization.\n\nThese new rules, which go into force as of Jan. 31, 2022, apply to everyone across the board, from department heads and officials to regular employees, external collaborators, contractors, and anyone who has any sort of contact with the public as part of their job.\n\nEach Vatican office is required to verify compliance with the new measures by appointing someone to be in charge of regular checks to identify any breaches. In major departments, this task has been given to the undersecretaries.\n\nAny exemptions from the rules must be evaluated by either the general affairs section or the diplomatic personnel section of the Vatican’s Secretariat of State, after consulting with the Holy See’s health office.\n\nFurther restrictions may be applied by competent health authorities on people who arrive to Rome from countries with a high level of contagion.\n\nWhen Vatican City became the first country to offer COVID-19 vaccines to all of its citizens and employees in January, including Pope Francis and Pope emeritus Benedict XVI, there was no mandate, so several employees opted not to get the jab.\n\nThe Green Pass requirement to enter the Vatican Museums remains unchanged, but it is still unclear whether a Green Pass will now be required to attend papal events such as the Wednesday general audiences and the pope’s Christmas liturgies.\n\nBecome a Patron!\n\n Or support us at SubscribeStar\n\n Donate cryptocurrency HERE\n\nSubscribe to Activist Post for truth, peace, and freedom news. Follow us on Telegram, HIVE, Flote, Minds, MeWe, Twitter, Gab and What Really Happened.\n\n\n\nProvide, Protect and Profit from what’s coming! Get a free issue of Counter Markets today.", "opengraph": {"locale": "en_US", "type": "article", "title": "Vatican Issues Vaccine Mandate for All Employees - Activist Post", "description": "This follows a decree requiring anyone entering Vatican City State to show either proof of vax, a negative test, or proof of recovery.", "url": "https://www.activistpost.com/2021/12/vatican-issues-vaccine-mandate-for-all-employees.html", "site_name": "Activist Post", "article:publisher": "http://www.facebook.com/activistpost", "article:published_time": "2021-12-24T17:00:45+00:00", "article:modified_time": "2021-12-24T17:17:19+00:00", "image": "https://www.activistpost.com/wp-content/uploads/2019/09/vatican-sex-crimes-1024x572-1-1024x572-1024x572-1024x572.jpg", "image:width": "1024", "image:height": "572", "image:type": "image/jpeg"}, "tags": ["Mandatory vaccines", "Vatican", "Religion", "Elise Ann Allen"], "tweets": [], "movies": [], "links": ["https://www.activistpost.com/wp-content/uploads/2019/09/vatican-sex-crimes-1024x572-1-1024x572-1024x572-1024x572.jpg", "https://cruxnow.com/author/elise-ann-allen", "https://cruxnow.com/vatican/2021/12/vatican-issues-vaccine-mandate-for-all-employees", "https://smartlivingshopper.clickfunnels.com/webinar-registrationtp09jgx5", "https://smartlivingshopper.clickfunnels.com/webinar-registrationtp09jgx5", "https://truthunmuted.org/vatican-issues-vaccine-mandate-for-all-employees/", "http://www.pixabay.com", "https://www.patreon.com/bePatron?u=5719077", "https://www.subscribestar.com/activist-post", "https://www.activistpost.com/support", "https://www.activistpost.com/survive-job-automation-apocalypse", "https://t.me/activistpost", "https://hive.blog/@activistpost", "https://flote.app/ActivistPost", "https://www.minds.com/ActivistPost", "https://mewe.com/i/activistpost", "https://twitter.com/ActivistPost", "https://gab.com/activist", "https://www.whatreallyhappened.com/?q=users/activistpost", "http://countermarkets.com/"], "authors": ["Activist Post"], "publish_date": "2021-12-24T17:00:45+00:00"}