{"result_id": "009045", "URL": "https://www.activistpost.com/2021/10/creighton-university-applies-stricter-vaccine-requirements-for-students-than-for-staff.html", "timestamp": "2023-04-25 11:50:47 CEST+0200", "meta": {"description": "Religious exemptions are not accepted for any immunization required by the school for students despite being a religious university.", "lang": "en", "keywords": "", "favicon": "https://www.activistpost.com/wp-content/uploads/2018/04/cropped-icon-32x32.jpg", "canonical": "https://www.activistpost.com/2021/10/creighton-university-applies-stricter-vaccine-requirements-for-students-than-for-staff.html", "encoding": "UTF-8"}, "image": null, "domain": "www.activistpost.com", "title": "Creighton University Applies Stricter Vaccine Requirements for Students Than for Staff", "cleaned_text": "Religious exemptions are not accepted at Creighton University for any immunization required by the school for students despite being a religious university.\n\nAn August email to a student states that, “The University is no longer allowing new medical exemptions.”\n\nOn October 21, Creighton changed policy so that only staff and faculty could get religious and medical exemptions.\n\nCreighton University required all students “to be fully vaccinated against COVID-19 prior to their arrival on campus.” But the same policy stated that faculty and staff were only “strongly encouraged to be vaccinated.”\n\nCampus Reform spoke with Patrice Quadrel, a former senior who was forcibly unenrolled from Creighton because she chose to not comply with the school’s vaccination policy.\n\nOn Sept. 9 Quadrel said she received a notice, informing her that she was, “in violation of the Creighton University Standards of Conduct: #L.2. Failure to Comply: interfering or failing to comply with the directives of University officials acting in the performance of their duties.” She was removed from her classes effective the following day.\n\nAs a result of this violation and subsequent withdrawal, Ms. Quadrel is banned from campus and not allowed to attend any Creighton events without exception.\n\nShe told Campus Reform that she attempted to apply for a religious exemption because, “My faith does not align with the manufacturing and testing process that was used to create these vaccines. Taking this vaccine is against my religious beliefs.” She was denied and told Creighton does not accept religious exemptions.\n\nTake Control of Your Family’s Health — Immune System Support Kit (Ad)\n\nThe schools posted policy confirms that “Creighton does not grant religious waivers.”\n\nAn email sent to Quadrel on August 26, informed her that Creighton would no longer allow new medical exemptions. Whether this was only referring to the COVID-19 vaccine or all immunization requirements was not specified in the email. However, on the school’s official website under the tab “Can I be granted a medical exemption from an immunization?”, it states that students still can submit medical exemptions to the university.\n\nOn October 21, updated the policy to require staff and faculty to get the COVID-19 vaccine by Dec. 8 unless they submit and are granted a religious or medical exemption.\n\nCreighton still states on their immunization requirements page that it does not accept religious exemptions for students.\n\nWhen asked if she would comment on the sudden policy change and why students were not also given the chance to acquire a religious and or medical exemption, Director of Public Relations Cindy Workman, “I have your name, your number, and your email. The policy is on the internet, go read it there.” Not long after she abruptly ended the call.\n\nBecome a Patron!\n\n Or support us at SubscribeStar\n\n Donate cryptocurrency HERE\n\nSubscribe to Activist Post for truth, peace, and freedom news. Follow us on Telegram, HIVE, Flote, Minds, MeWe, Twitter, Gab and What Really Happened.\n\n\n\nProvide, Protect and Profit from what’s coming! Get a free issue of Counter Markets today.", "opengraph": {"locale": "en_US", "type": "article", "title": "Creighton University Applies Stricter Vaccine Requirements for Students Than for Staff - Activist Post", "description": "Religious exemptions are not accepted for any immunization required by the school for students despite being a religious university.", "url": "https://www.activistpost.com/2021/10/creighton-university-applies-stricter-vaccine-requirements-for-students-than-for-staff.html", "site_name": "Activist Post", "article:publisher": "http://www.facebook.com/activistpost", "article:published_time": "2021-10-29T18:10:42+00:00", "image": "https://www.activistpost.com/wp-content/uploads/2021/10/school-vax-cr.jpg", "image:width": "983", "image:height": "612", "image:type": "image/jpeg"}, "tags": ["Religion", "School", "Mandatory vaccines"], "tweets": [], "movies": [], "links": ["https://www.activistpost.com/wp-content/uploads/2021/10/school-vax-cr.jpg", "https://campusreform.org/article?id=18388", "https://studentlife.creighton.edu/wellness/health-and-counseling/student-health-education-and-compliance/immunization-requirements", "https://www.campusreform.org/article?id=18338", "https://store.thegrownetwork.com/products/immunity-support-kit?oid=72&affid=154", "https://www.campusreform.org/article?id=18307", "https://studentlife.creighton.edu/wellness/health-and-counseling/student-health-education-and-compliance/immunization-requirements", "https://www.creighton.edu/publicrelations/newscenter/news/2021/october2021/october212021/newfederalvaccinemandate/", "https://studentlife.creighton.edu/wellness/health-and-counseling/student-health-education-and-compliance/immunization-requirements", "https://smartlivingshopper.clickfunnels.com/webinar-registrationtp09jgx5", "https://smartlivingshopper.clickfunnels.com/webinar-registrationtp09jgx5", "https://www.campusreform.org/article?id=18312", "https://www.campusreform.org/article?id=18185", "https://www.patreon.com/bePatron?u=5719077", "https://www.subscribestar.com/activist-post", "https://www.activistpost.com/support", "https://www.activistpost.com/survive-job-automation-apocalypse", "https://t.me/activistpost", "https://hive.blog/@activistpost", "https://flote.app/ActivistPost", "https://www.minds.com/ActivistPost", "https://mewe.com/i/activistpost", "https://twitter.com/ActivistPost", "https://gab.com/activist", "https://www.whatreallyhappened.com/?q=users/activistpost", "http://countermarkets.com/"], "authors": ["Activist Post"], "publish_date": "2021-10-29T18:10:42+00:00"}