{"result_id": "009006", "URL": "https://www.activistpost.com/2023/03/ny-red-alert-recently-passed-bill-clears-the-way-for-a-mandatory-adult-vaccine-database.html", "timestamp": "2023-04-25 11:47:04 CEST+0200", "meta": {"description": "Please join us on a zoom call at 7:30 pm on Wednesday, March 22, for more information on this bill and what we MUST do to stop it.", "lang": "en", "keywords": "", "favicon": "https://www.activistpost.com/wp-content/uploads/2018/04/cropped-icon-32x32.jpg", "canonical": "https://www.activistpost.com/2023/03/ny-red-alert-recently-passed-bill-clears-the-way-for-a-mandatory-adult-vaccine-database.html", "encoding": "UTF-8"}, "image": null, "domain": "www.activistpost.com", "title": "NY Red Alert: Recently Passed Bill Clears the Way for a Mandatory Adult Vaccine Database", "cleaned_text": "Both houses of the New York legislature passed an alarming bill (A4132/S837) on Wednesday. The bill itself is not especially dangerous. What is very alarming though is the fact that it was passed indicates that the legislature is getting ready to try and pass another bill (S1531) that will make mandatory reporting of all adult vaccines, and perhaps vaccines refused, to the New York State Immunization Information System or the New York City Citywide Immunization Registry. Currently, if a medical worker follow the law, permission must be obtained to put a person’s information in the database.\n\nWe believe that S1531 has the best chance of passing this session out of all the many very bad vaccine-related bills.\n\nThe State wants this database for two simple reasons: to know who is and who is not complying with vaccine directives, and, therefore, identify targets for enforcement measures. As we all know, this is exactly what school vaccine databases are used for.\n\nPlease join us on a zoom call at 7:30 pm on Wednesday, March 22, for more information on this bill and what we MUST do to stop it. Click HERE to register for the call.\n\nA mandatory vaccine database is an essential part of any vaccine passport system. As we have already seen, New York State and City will use this information to decide who can work, go to school, attend college, travel, operate a business, enter public places, shop, attend worship services, receive medical care, and on and on. This is an essential tool for a vaccine police state, and they want it badly.\n\nLast year, a strong effort was made to pass a mandatory database bill. We fought hard to stop it. Quite unexpectedly, opposition to the database bill emerged from advocates for illegal immigrants. They were afraid that information from the database could be used by federal immigration enforcement agencies to find and deport people. A law was rammed through Albany that among other things said that the federal government could not get access to, or even subpoena, information from the database.\n\nStates do not make laws that bind the federal government. Anyone who passed high school civics knows that, but not our legislature. They went ahead and passed the bill that was blatantly unconstitutional and could not stand legal scrutiny by a court. But this was all posturing anyway because the law included a clause allowing the Governor and the Commissioner of Health to give information from the database to anyone at their discretion, including immigration enforcement agencies.\n\nThe law passed on Wednesday (A4132/S837) removes this blatantly unconstitutional language and clears the way for S1531, the mandatory database bill. The bill was introduced by the Chairs of the Health Committees of the respective Houses which shows that this is something leadership definitely wants. And now they can move ahead on S1531.\n\nThe mandatory database is just part of the growing vaccine police state apparatus. Just days ago, Attorney General Leticia James and Gov. Hochul filed an appeal to resurrect their quarantine-camp regulation that would allow seizing and imprisoning for an indefinite time anybody who is suspected of having been exposed to a communicable disease. Under Hochul’s regulation no due process is required, no hearing, no trial, no legal representation, and no proof required showing that you are even infected. As we learned with COVID, everybody was exposed, and almost everybody infected, which means that according to this regulation anybody could be arrested at any time. They want the power to pull you off the street or from your home and throw you in jail and hold you for as long as they want.\n\nS1531, the mandatory database bill, was introduced by Sen. Brad Hoylman, the drug industry’s most loyal shill in the New York State Senate. Right now, there is no identical bill in the Assembly. But we expect that to change very soon, possibly this week. This bill has been around for several sessions and its earlier version was introduced by Richard Gottfried, the just-retired former Chair of the Assembly Health Committee. Amy Paulin, the new Chair of the Assembly Health Committee, was a co-sponsor in the past and we expect her to re-introduce the bill.\n\nOne question is what will the illegal immigrant advocates do now that the pretense that the federal immigration agencies would not be able to get the data has been exposed for the lie it always was?\n\nIf we all fight, we can stop the mandatory database but the efforts of thousands will be required.\n\nPlease share this link to register for the Zoom call on Wednesday, March 22 at 7:30 pm.\n\nPlease share this message with friends and family, and please share on social networks while we still can.\n\nBecome a Patron!\n\n Or support us at SubscribeStar\n\n Donate cryptocurrency HERE\n\nSubscribe to Activist Post for truth, peace, and freedom news. Follow us on SoMee, Telegram, HIVE, Flote, Minds, MeWe, Twitter, Gab, What Really Happened and GETTR.\n\n\n\nProvide, Protect and Profit from what’s coming! Get a free issue of Counter Markets today.", "opengraph": {"locale": "en_US", "type": "article", "title": "NY Red Alert: Recently Passed Bill Clears the Way for a Mandatory Adult Vaccine Database - Activist Post", "description": "Please join us on a zoom call at 7:30 pm on Wednesday, March 22, for more information on this bill and what we MUST do to stop it.", "url": "https://www.activistpost.com/2023/03/ny-red-alert-recently-passed-bill-clears-the-way-for-a-mandatory-adult-vaccine-database.html", "site_name": "Activist Post", "article:publisher": "http://www.facebook.com/activistpost", "article:published_time": "2023-03-21T12:50:11+00:00", "article:modified_time": "2023-03-22T00:02:37+00:00", "image": "https://www.activistpost.com/wp-content/uploads/2023/03/vax-data-tfc.jpg", "image:width": "871", "image:height": "512", "image:type": "image/jpeg"}, "tags": ["New York", "Vaccines", "Privacy", "Michael Kane", "Surveillance"], "tweets": [], "movies": [], "links": ["https://www.activistpost.com/wp-content/uploads/2023/03/vax-data-tfc.jpg", "https://www.activistpost.com/tag/michael-kane", "https://www.votervoice.net/BroadcastLinks/YsEyWMAKfcBCDnf4ai7iCw", "https://smartlivingshopper.clickfunnels.com/webinar-registrationtp09jgx5", "https://smartlivingshopper.clickfunnels.com/webinar-registrationtp09jgx5", "https://us06web.zoom.us/meeting/register/tZEsdeiqrD8rE9L5uuvC1XTmGqHPfSV6Hy8w", "https://teachersforchoice.org/2023/03/19/ny-red-alert-recently-passed-bill-clears-the-way-for-a-mandatory-adult-vaccine-database/", "https://www.patreon.com/bePatron?u=5719077", "https://www.subscribestar.com/activist-post", "https://www.activistpost.com/support", "https://www.activistpost.com/survive-job-automation-apocalypse", "https://somee.social/?ref=activist.post", "https://t.me/activistpost", "https://hive.blog/@activistpost", "https://flote.app/ActivistPost", "https://www.minds.com/ActivistPost", "https://mewe.com/i/activistpost", "https://twitter.com/ActivistPost", "https://gab.com/activist", "https://www.whatreallyhappened.com/?q=users/activistpost", "https://gettr.com/user/activistpost", "http://countermarkets.com/"], "authors": ["Activist Post"], "publish_date": "2023-03-21T12:50:11+00:00"}