{"result_id": "009027", "URL": "https://www.activistpost.com/2015/02/what-investigative-journalist-sharyl.html", "timestamp": "2023-04-25 11:50:35 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.activistpost.com/wp-content/uploads/2018/04/cropped-icon-32x32.jpg", "canonical": "https://www.activistpost.com/2015/02/what-investigative-journalist-sharyl.html", "encoding": "UTF-8"}, "image": null, "domain": "www.activistpost.com", "title": "What investigative journalist Sharyl Attkisson told me about vaccines", "cleaned_text": "“The complete failure of this year’s flu vaccine, even by conventional standards, is a major scandal at the CDC. To distract the press and public, we now have a fake epidemic of measles, and pressure to take the vaccine, take all vaccines all the time. This is called a psyop. Psyops build fake realities.” (The Underground, Jon Rappoport)\n\nAs my readers know, I’ve written many articles about vaccines, covering: mandatory shots; the pseudoscience of vaccination; severe adverse effects; poisons in shots; disastrous vaccination campaigns, and so on.\n\nThis article is about something else. It’s about who is allowed to speak fully in mainstream media.\n\nIf truth were the objective of news, you would see reasoned debates between pro and anti-vax proponents on major networks—-but that’s a joke because no reasoned debates are permitted on any sensitive subject.\n\nWhen it comes to vaccines, major media are all about “what doctors tell us.” If I may be so bold, who cares what doctors say?\n\nWhy are doctors a privileged class? Why do they get a free pass?\n\nLet’s see…oh yes, it’s because government and drug companies back them up. The last time I looked, this has nothing to do with the truth.\n\nIt has to do with monopoly, though.\n\n“I’m a doctor, and of course I’m pro-vaccine.”\n\n“Welcome, Doctor, good to have you on the show.”\n\nOr: “I’m a doctor, and I’m against vaccines.”\n\n“You’re suffering from a mental disorder, Doctor, and you’re a traitor to your profession and a threat to the future of the human race.”\n\nMedia construct this premise: the pro-vaccine “experts” are truthtellers, and the people who question vaccines are “denialists.” That’s how the issue is framed. Ahead of time. On purpose.\n\nThe millions of brainwashed people who watch the news every night and genuflect and live inside that dream are content to believe “the good doctors.” They have to believe someone, because they have no opinion of their own. They don’t have the tools to form a reasoned opinion. If a doctor told them that four shots of bull sperm would protect their children from a virus floating in from the Orion Belt, they’d line up their kiddies at clinics and drug stores for the “free” jab.\n\nAn anti-vaccine reporter at a local TV station once told me she’d been labeled “trouble.” She wasn’t permitted to air any vaccine story, for fear that through word or gesture she might trigger a scandal.\n\nPart of that scandal? Scores of viewers would contact the station and side with the anti-vaccine reporter. The execs knew those viewers were out there and were also “trouble.”\n\nOn August 27, 2014, a long-time researcher at the CDC, William Thompson, confessed in print that he and his colleagues had cooked a vital vaccine study to “prove” the MMR vaccine had no connection to autism…when in fact that was a lie. The vaccine did have a connection.\n\nA media storm should have followed. A respected researcher coming out of the woodwork and saying, “I lied”? That’s a huge story for major media and medical media.\n\nBut? There was a virtual blackout on the story. There still is.\n\nThe vaccine establishment must be protected.\n\nIn the fall of 2009, Sharyl Attkisson, working at CBS News, blew the doors open on a huge Swine Flu scandal at the CDC:\n\nThe CDC, whose job it was to accurately report the number of Swine Flu cases in the US, had stopped counting. Stopped counting.\n\nWhy? Because the overwhelming number of blood samples from diagnosed or likely Swine Flu patients, coming back from testing labs, showed these people didn’t have Swine Flu or any flu.\n\nThat fact torpedoed the entire CDC propaganda- fear campaign aimed at convincing Americans to take the Swine Flu vaccine.\n\nSo…Sharyl Attkisson’s effort to move this story from the CBS News website on to the national nightly-news television broadcast was shot down.\n\nHere is a piece from a 2014 interview I did with Attkisson:\n\nQ: In 2009, you spearheaded coverage of the so-called Swine Flu pandemic. You discovered that, in the summer of 2009, the Centers for Disease Control, ignoring their federal mandate, stopped counting Swine Flu cases in America. Yet they continued to stir up fear about the “pandemic,” without having any real measure of its impact. Wasn’t that another investigation of yours that was shut down? Wasn’t there more to find out?\n\nA: The implications of the story were even worse than that. We discovered through our FOI efforts that before the CDC mysteriously stopped counting Swine Flu cases, they had learned that almost none of the cases they had counted as Swine Flu was, in fact, Swine Flu or any sort of flu at all! The interest in the story from one [CBS] executive was very enthusiastic. He said it was “the most original story” he’d seen on the whole Swine Flu epidemic. But others pushed to stop it and, in the end, no broadcast wanted to touch it. We aired numerous stories pumping up the idea of an epidemic, but not the one that would shed original, new light on all the hype. It was fair, accurate, legally approved and a heck of a story. With the CDC keeping the true Swine Flu stats secret, it meant that many in the public took and gave their children an experimental vaccine that may not have been necessary.\n\nQ: You’ve revealed serious problems caused by vaccines. Have you run into opposition as a result of covering these stories?\n\nA: This is a long discussion but yes, it is one of the most well funded, well orchestrated efforts I’ve ever seen on a story. Many reporters, if not all, who have tried to factually cover this topic have experienced the same opposition as have researchers who dared to uncover vaccine side effects. Those who don’t want the stories explored want to censor the information from the public entirely, lest the public draw the “wrong” conclusions about the facts. The media has largely bought into the conflicted government, political and medical complex propaganda on the topic that marginalizes researchers, journalists and parents who dare to speak to the scientific facts they’ve uncovered or to their own experiences. It’s a giant scandal of its own.\n\nQ: I know you’ve had problems with your Wikipedia page. What happened there?\n\nA: Long story short: there is a concerted effort by special interests who exploit Wikipedia editing privileges to control my biographical page to disparage my reporting on certain topics and skew the information. Judging from the editing, the interest(s) involved relates to the pharmaceutical/vaccine industry. I am far from alone…\n\nDoes that tell you something about the way major media cover vaccine stories?\n\nThere is even more.\n\nThe staggering capper on this tale? Roughly three weeks after Attkisson’s Swine Flu revelations appeared in print, the CDC, obviously in great distress over the exposure, decided to double down. The best lie to tell would be a huge lie.\n\nHere, from a November 12, 2009, WebMD article is the CDC’s response: “Shockingly, 14 million to 34 million U.S. residents — the CDC’s best guess is 22 million — came down with H1N1 swine flu by Oct. 17 [2009].” (“22 million cases of Swine Flu in US,” by Daniel J. DeNoon)\n\nThe CDC had no facts or stats or lab tests to confirm ANY of their reported numbers of Swine Flu cases in America. So they said: 22 MILLION CASES.\n\nBut don’t worry. Be happy. Everything the government tells you about disease and the need to take vaccines is perfectly true.\n\nThe author of three explosive collections, THE MATRIX REVEALED, EXIT FROM THE MATRIX, and POWER OUTSIDE THE MATRIX, Jon was a candidate for a US Congressional seat in the 29th District of California. He maintains a consulting practice for private clients, the purpose of which is the expansion of personal creative power. Nominated for a Pulitzer Prize, he has worked as an investigative reporter for 30 years, writing articles on politics, medicine, and health for CBS Healthwatch, LA Weekly, Spin Magazine, Stern, and other newspapers and magazines in the US and Europe. Jon has delivered lectures and seminars on global politics, health, logic, and creative power to audiences around the world. You can sign up for his free emails at NoMoreFakeNews.com or OutsideTheRealityMachine.", "opengraph": {"locale": "en_US", "type": "article", "title": "What investigative journalist Sharyl Attkisson told me about vaccines - Activist Post", "description": "Jon Rappoport Activist Post “The complete failure of this year’s flu vaccine, even by conventional standards, is a major scandal at the CDC. To distract...", "url": "https://www.activistpost.com/2015/02/what-investigative-journalist-sharyl.html", "site_name": "Activist Post", "article:publisher": "http://www.facebook.com/activistpost", "article:author": "http://www.facebook.com/activistpost", "article:published_time": "2015-02-11T17:31:00+00:00", "article:modified_time": "2015-08-10T20:38:51+00:00", "image": "https://www.activistpost.com/wp-content/uploads/2015/07/corporate-news.jpeg.jpg", "image:width": "381", "image:height": "296", "image:type": "image/jpeg"}, "tags": ["Media", "Jon Rappoport", "Vaccines", "Sharyl Attkisson", "Government"], "tweets": [], "movies": [], "links": ["http://1.bp.blogspot.com/-Yaf4LHbu6xc/VNt-aL0m9EI/AAAAAAAAkvQ/l6txYR55P-I/s1600/corporate-news.jpeg", "https://www.activistpost.com/2015/02/what-investigative-journalist-sharyl.html", "https://jonrappoport.wordpress.com/2013/02/05/dumbed-down-populations-accept-outrageous-vaccine-logic/", "https://jonrappoport.wordpress.com/2014/10/25/cdc-whistleblower-oh-my-god-what-we-did/", "https://jonrappoport.wordpress.com/2014/11/10/depopulation-vaccine-in-kenya-and-beyond/", "https://jonrappoport.wordpress.com/2014/11/07/watch-out-genetically-engineered-ebola-vaccine/", "http://www.bloggersecret.com/", "https://jonrappoport.wordpress.com/2014/08/27/the-big-one-cdc-whistleblower-goes-public-now/", "https://www.ncbi.nlm.nih.gov/pubmed/14754936", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4128611/", "https://jonrappoport.wordpress.com/2014/04/25/exclusive-an-interview-with-investigative-reporter-sharyl-attkisson/", "https://smartlivingshopper.clickfunnels.com/webinar-registrationtp09jgx5", "https://smartlivingshopper.clickfunnels.com/webinar-registrationtp09jgx5", "http://activistpost.net/vaccineexempt.html", "http://www.webmd.com/cold-and-flu/news/20091112/over-22-million-in-us-had-h1n1-swine-flu", "http://marketplace.mybigcommerce.com/the-matrix-revealed-vol-1-cd-by-jon-rappoport-mega-info/", "http://marketplace.mybigcommerce.com/exit-from-the-matrix/", "http://marketplace.mybigcommerce.com/power-outside-the-matrix/", "http://nomorefakenews.com/", "http://outsidetherealitymachine.wordpress.com/", "http://activistpost.net/miraclecure.html"], "authors": ["ActivistPost"], "publish_date": "2015-02-11T17:31:00+00:00"}