{"result_id": "009053", "URL": "https://www.activistpost.com/2021/12/connecticut-launching-controversial-vaccine-passport-system.html", "timestamp": "2023-04-25 11:50:50 CEST+0200", "meta": {"description": "Lamont said they're working with an existing provider for the digital vax cards because they have the database of everyone vaccinated.", "lang": "en", "keywords": "", "favicon": "https://www.activistpost.com/wp-content/uploads/2018/04/cropped-icon-32x32.jpg", "canonical": "https://www.activistpost.com/2021/12/connecticut-launching-controversial-vaccine-passport-system.html", "encoding": "UTF-8"}, "image": null, "domain": "www.activistpost.com", "title": "Connecticut Launching Controversial Vaccine Passport System", "cleaned_text": "The vaccine passport system that would allow private businesses to verify your vaccine status is already here. Republicans are calling for public hearings, but the governor says the system will officially launch next week.\n\n“What I would like to start with is a public hearing,” House Minority Leader Vincent Candelora said.\n\nAs of Monday Connecticut residents can request a smart health card QR code through the Connecticut Department of Public Health website.\n\n“When people come in here to CVS they ought to be able to say somebody has been vaccinated. We leave it up to the store owners,” Gov. Ned Lamont said.\n\nLamont said the system is voluntary for businesses and individuals. Some venues like the Bushnell in Hartford already require proof of vaccination.\n\n“We leave it up to the store owners, it’s totally at their discretion. And you as an individual don’t have to get the digital health card if you don’t want it,” Lamont said.\n\nLamont said he was open to hearings when the legislature convenes in February but he’d rather have it on the ground when it’s needed.\n\n“Before he leaps ahead with a program, I think there needs to be more thought and deliberation put into it and I find it disturbing they’re not willing to have that thought and deliberation occur,” Candelora said.\n\nCandelora wants to know what happens if a dentist’s office or grocery store in a rural area requires a vaccine card for entry.\n\n“Is somebody going to be denied access to that grocery store without having the conversation about what is essential for residents and what is not essential?” he added.\n\n“We’re trying to make it a little easy, more verifiable, more secure. Your QR code – as Mark points out – we’ve been testing this now for a week or so in public health. We’re doing this alongside Delaware and few other states,” Lamont said.\n\nLamont said they are working with an existing provider for the digital vaccine cards because they have the database of everyone who has been vaccinated.\n\nEnvision Technology Partners, which runs CT Wiz, the state’s immunization reporting website, has updated its existing software to include the QR code, according to Chief Operating Officer Josh Geballe. The QR code is universal so it will be able to be read by software in other states.\n\nGeballe said there are about 14 states that use Envision Technology Partners for their immunization systems and Delaware is one of them.\n\n“We’re taking privacy very seriously, that’s what this process is about. I think we’ll be ready to go in a week or so. It depends on the final test,” Lamont said.\n\nBecome a Patron!\n\n Or support us at SubscribeStar\n\n Donate cryptocurrency HERE\n\nSubscribe to Activist Post for truth, peace, and freedom news. Follow us on Telegram, HIVE, Flote, Minds, MeWe, Twitter, Gab and What Really Happened.\n\n\n\nProvide, Protect and Profit from what’s coming! Get a free issue of Counter Markets today.", "opengraph": {"locale": "en_US", "type": "article", "title": "Connecticut Launching Controversial Vaccine Passport System - Activist Post", "description": "Lamont said they're working with an existing provider for the digital vax cards because they have the database of everyone vaccinated.", "url": "https://www.activistpost.com/2021/12/connecticut-launching-controversial-vaccine-passport-system.html", "site_name": "Activist Post", "article:publisher": "http://www.facebook.com/activistpost", "article:published_time": "2021-12-16T15:12:01+00:00", "image": "https://www.activistpost.com/wp-content/uploads/2021/12/ct-vax-pass.jpg", "image:width": "1031", "image:height": "513", "image:type": "image/jpeg"}, "tags": ["Vaccine Passport", "Jesse Smith", "Connecticut"], "tweets": [], "movies": [], "links": ["https://www.activistpost.com/wp-content/uploads/2021/12/ct-vax-pass.jpg", "https://www.nbcconnecticut.com", "https://ctwiz.dph.ct.gov/ctwiz_public/Application/PublicPortal", "https://smartlivingshopper.clickfunnels.com/webinar-registrationtp09jgx5", "https://smartlivingshopper.clickfunnels.com/webinar-registrationtp09jgx5", "https://www.nbcconnecticut.com/news/local/controversial-vaccine-passport-system-already-launched/2673021/", "https://truthunmuted.org/connecticut-launching-controversial-vaccine-passport-system/", "https://www.patreon.com/bePatron?u=5719077", "https://www.subscribestar.com/activist-post", "https://www.activistpost.com/support", "https://www.activistpost.com/survive-job-automation-apocalypse", "https://t.me/activistpost", "https://hive.blog/@activistpost", "https://flote.app/ActivistPost", "https://www.minds.com/ActivistPost", "https://mewe.com/i/activistpost", "https://twitter.com/ActivistPost", "https://gab.com/activist", "https://www.whatreallyhappened.com/?q=users/activistpost", "http://countermarkets.com/"], "authors": ["Activist Post"], "publish_date": "2021-12-16T15:12:01+00:00"}