{"result_id": "009034", "URL": "https://www.activistpost.com/2022/12/bidens-vaccine-mandate-for-military-defeated-new-bill-restores-basic-rights-for-soldiers.html", "timestamp": "2023-04-25 11:50:38 CEST+0200", "meta": {"description": "The vaccine mandate to get fully vaccinated or face discharge resulted in more than 8,000 troops being kicked out of the military.", "lang": "en", "keywords": "", "favicon": "https://www.activistpost.com/wp-content/uploads/2018/04/cropped-icon-32x32.jpg", "canonical": "https://www.activistpost.com/2022/12/bidens-vaccine-mandate-for-military-defeated-new-bill-restores-basic-rights-for-soldiers.html", "encoding": "UTF-8"}, "image": null, "domain": "www.activistpost.com", "title": "Biden’s Vaccine Mandate for Military Defeated, New Bill Restores Basic Rights for Soldiers", "cleaned_text": "This week, the US Congress has unveiled an $858 billion defense bill which would terminate President Biden’s mandate that all members of the military submit to the experimental mRNA Covid injection. The move comes as a massive blow to Democrats and the pharmaceutical lobby who were relying on Biden to lock in profits for the coming financial year.\n\nThe decision is being hailed as the first major victory for the new Republican House. Rep. Kevin McCarthy of California, the minority leader who is campaigning for speaker, has made the issue a priority and has gathered substantial support for the move which is being seen as a fatal blow to the White House’s plans to extend the ‘pandemic emergency’ for a further two years until the 2024 election.\n\nThe new bill authorises a pay raise for American troops, and according to McCarthy it’s “a victory for our military and for common sense.”\n\nRepublicans are also pushing the Biden administration to re-enlist all service members who were unlawfully discharged for refusing to take the experimental ‘vaccine’ gene therapy injection…\n\nA defense bill released Tuesday would force the Biden administration to rescind its COVID-19 vaccine mandate for troops in a huge victory for Republicans, military advocates, and families who pushed hard for it to be included in the bill.\n\n“Not later than 30 days after the date of the enactment of this Act, the Secretary of Defense shall rescind the mandate that members of the Armed Forces be vaccinated against COVID-19,” the bill says.\n\nThe Biden administration’s military vaccine mandate to get fully vaccinated or face discharge resulted in more than 8,000 troops being kicked out of the military.\n\nHowever, the mandate also threatened the livelihoods of at least 60,000 more service members who did not wish to take the vaccine.\n\nThousands of those had filed for religious exemption from the vaccine, but their requests were largely dismissed, prompting a warning from the Pentagon inspector general.\n\nDespite the pushback from troops and Republicans in Congress, the Biden administration had dug in its heels, saying as recently as this week that it opposed repealing the mandate.\n\nThe bill must be passed by Congress and sent to be signed by President Joe Biden to become law, but it is likely it passes since it was worked out over weeks by both Republicans and Democrats on the House and Senate Armed Services Committee.\n\nThe language did not include reinstatement of troops discharged over the mandate, but Rep. Thomas Massie (R-KY), a key House member opposing the mandate tweeted that the “next steps” are to “reinstate all members of the military wrongfully terminated due to vax.”\n\nThe Real Anthony Fauci: Bill Gates, Big Pharma, and the Global War on Democracy and Public Health (Children’s Health Defense)\n\nRep. Chip Roy (R-TX), who also pushed for rescinding the mandate tweeted, “The @freedomcaucus has been fighting to #EndVaxMandates for 2 years – this is a giant step, at least within the military.”\n\nRepublican Sens. Marsha Blackburn (TN), Roger Marshall (KS), Cindy Hyde-Smith (MS), Mike Braun (IN), Deb Fischer (NE), Joni Ernst (IA), Tommy Tuberville (AL), Mike Crapo (ID), Steve Daines (MT), John Hoeven (ND), and Jim Risch (ID) said in a joint statement:\n\nAnother group of Republican senators also made a high-profile push last week — threatening to vote against the NDAA if it did not include a repeal of the vaccine mandate, as reported by Breitbart News.\n\nTroops fighting the vaccine mandate expressed gratitude and hope for further steps.\n\nAir Force Master Sergeant Nick Kupper, who has fought for troops opposing the vaccine mandate, told Breitbart News in a statement:\n\nA group of grassroots military community activists told Breitbart News called on the Pentagon to reinstate service members who were forced out, and for Congress to continue holding leaders accountable:\n\nThe repeal of the COVID vaccine mandate in the NDAA is a step in the right direction. However, it is only a small step towards rebuilding the trust between service members and their leadership, both uniformed and civilian. To continue the journey towards reestablishing trust, the DOD must reinstate those forced out and deprived their livelihoods. The legislature must stop standing idly by as a rogue DOD flagrantly violates its own UCMJ and federal laws. Congress is duty bound to leverage the power of the purse as well as subpoena authority to force accountability of the executive branch. Policy needs to be written to ensure the protection of service members and their rights.\n\nThey added, “We are thankful to the representatives and senators who fought for us, especially the few members who stood for us when few would. We as a community are not satisfied and want to assure the 118th Congress that this issue is not going away.”\n\nPLEASE HELP SUPPORT OUR INDEPENDENT MEDIA PLATFORM HERE\n\nBecome a Patron!\n\n Or support us at SubscribeStar\n\n Donate cryptocurrency HERE\n\nSubscribe to Activist Post for truth, peace, and freedom news. Follow us on SoMee, Telegram, HIVE, Flote, Minds, MeWe, Twitter, Gab, What Really Happened and GETTR.\n\n\n\nProvide, Protect and Profit from what’s coming! Get a free issue of Counter Markets today.", "opengraph": {"locale": "en_US", "type": "article", "title": "Biden’s Vaccine Mandate for Military Defeated, New Bill Restores Basic Rights for Soldiers - Activist Post", "description": "The vaccine mandate to get fully vaccinated or face discharge resulted in more than 8,000 troops being kicked out of the military.", "url": "https://www.activistpost.com/2022/12/bidens-vaccine-mandate-for-military-defeated-new-bill-restores-basic-rights-for-soldiers.html", "site_name": "Activist Post", "article:publisher": "http://www.facebook.com/activistpost", "article:published_time": "2022-12-08T12:28:23+00:00", "image": "https://www.activistpost.com/wp-content/uploads/2022/12/viden-vax-21st.jpg", "image:width": "952", "image:height": "546", "image:type": "image/jpeg"}, "tags": ["Military", "21st Century Wire", "Mandatory vaccines"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">The military COVID vaccine mandate will end!</p>\n<p>Page 407 &amp; 408 of NDAA text just released.</p>\n<p>Next steps: end all COVID vax mandates (healthcare workers and foreign visitors), and reinstate all members of military wrongfully terminated due to vax.<a href=\"https://t.co/hRVftUh6yl\">https://t.co/hRVftUh6yl</a> <a href=\"https://t.co/o8noBxngGe\">pic.twitter.com/o8noBxngGe</a></p>\n<p>— Thomas Massie (@RepThomasMassie) <a href=\"https://twitter.com/RepThomasMassie/status/1600319478746578945?ref_src=twsrc%5Etfw\">December 7, 2022</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">The <a href=\"https://twitter.com/freedomcaucus?ref_src=twsrc%5Etfw\">@freedomcaucus</a> has been fighting to <a href=\"https://twitter.com/hashtag/EndVaxMandates?src=hash&amp;ref_src=twsrc%5Etfw\">#EndVaxMandates</a> for 2 years – this is a giant step, at least within the military.  The <a href=\"https://twitter.com/hashtag/NDAA?src=hash&amp;ref_src=twsrc%5Etfw\">#NDAA</a> remains highly flawed – and we need reinstatement, cleared records, &amp; anti-retaliation language… but HOPEFULLY this step stays in the bill. <a href=\"https://t.co/JjAIGHg5YY\">pic.twitter.com/JjAIGHg5YY</a></p>\n<div class=\"code-block code-block-2\" style=\"margin-bottom: 10px;\"><p class=\"ml-form-embed\" data-account=\"2509525:y3w4e8u5d5\" data-form=\"2876563:m0e8z3\">\n                </p>\n            </div>\n<p>— Chip Roy (@chiproytx) <a href=\"https://twitter.com/chiproytx/status/1600319033647038467?ref_src=twsrc%5Etfw\">December 7, 2022</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">We’re putting an end to Joe Biden’s COVID vaccine mandate in this year’s National Defense Authorization Act. <a href=\"https://t.co/R4YtM13YVm\">https://t.co/R4YtM13YVm</a></p>\n<p>— Sen. Marsha Blackburn (@MarshaBlackburn) <a href=\"https://twitter.com/MarshaBlackburn/status/1600319502675501056?ref_src=twsrc%5Etfw\">December 7, 2022</a></p></blockquote>\n"], "movies": [], "links": ["https://www.activistpost.com/wp-content/uploads/2022/12/viden-vax-21st.jpg", "https://21stcenturywire.com/author/21wire/", "https://www.breitbart.com/politics/2022/12/06/defense-bill-require-pentagon-rescind-military-vaccine-mandate-major-gop-victory/", "https://t.co/hRVftUh6yl", "https://t.co/o8noBxngGe", "https://twitter.com/RepThomasMassie/status/1600319478746578945?ref_src=twsrc%5Etfw", "https://www.activistpost.com/product/1645020886/US/permacultucom-20/?cart=y", "https://www.activistpost.com/product/1510766804/US/permacultucom-20/?cart=y", "https://twitter.com/freedomcaucus?ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/EndVaxMandates?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/NDAA?src=hash&ref_src=twsrc%5Etfw", "https://t.co/JjAIGHg5YY", "https://twitter.com/chiproytx/status/1600319033647038467?ref_src=twsrc%5Etfw", "https://t.co/R4YtM13YVm", "https://twitter.com/MarshaBlackburn/status/1600319502675501056?ref_src=twsrc%5Etfw", "https://www.breitbart.com/politics/2022/11/30/republican-senators-demand-vote-end-military-vaccine-mandate/", "https://smartlivingshopper.clickfunnels.com/webinar-registrationtp09jgx5", "https://smartlivingshopper.clickfunnels.com/webinar-registrationtp09jgx5", "https://21stcenturywire.com", "http://www.21stcenturywire.com/tag/vaccines", "https://t.me/My21wire", "https://21w.co/support", "https://www.patreon.com/bePatron?u=5719077", "https://www.subscribestar.com/activist-post", "https://www.activistpost.com/support", "https://www.activistpost.com/survive-job-automation-apocalypse", "https://somee.social/?ref=activist.post", "https://t.me/activistpost", "https://hive.blog/@activistpost", "https://flote.app/ActivistPost", "https://www.minds.com/ActivistPost", "https://mewe.com/i/activistpost", "https://twitter.com/ActivistPost", "https://gab.com/activist", "https://www.whatreallyhappened.com/?q=users/activistpost", "https://gettr.com/user/activistpost", "http://countermarkets.com/"], "authors": ["Activist Post"], "publish_date": "2022-12-08T12:28:23+00:00"}