{"result_id": "009021", "URL": "https://www.activistpost.com/2021/08/shocking-and-dehumanizing-discrimination-against-the-unvaccinated-is-about-to-make-life-very-difficult.html", "timestamp": "2023-04-25 11:47:11 CEST+0200", "meta": {"description": "Once the vaccines are FDA-approved, you can bet that it will become a more widespread requirement in many workplaces.", "lang": "en", "keywords": "", "favicon": "https://www.activistpost.com/wp-content/uploads/2018/04/cropped-icon-32x32.jpg", "canonical": "https://www.activistpost.com/2021/08/shocking-and-dehumanizing-discrimination-against-the-unvaccinated-is-about-to-make-life-very-difficult.html", "encoding": "UTF-8"}, "image": null, "domain": "www.activistpost.com", "title": "Shocking and Dehumanizing Discrimination Against the Unvaccinated Is About to Make Life Very Difficult", "cleaned_text": "All over the world, the hot-button subject of the moment is the Covid vaccination. Many governments discuss making it mandatory, a terrifying concept for people who believe that the vaccine is unsafe. But perhaps even more appalling are the shocking things that people are saying about those who are unvaccinated.\n\nThis article isn’t about whether the vaccine is safe or not. I’m not urging anyone to get the vaccine, nor am I urging anyone to avoid it. I believe that my health decisions are my choice, and yours are your choice.\n\nI hope that when you read these comments, whatever side of the debate you are on, you stop and think about your humanity. If this were done to any other group of people, it would be considered hate speech. Because the mainstream media and the narrative are tightly controlled right now, this isn’t just thought of as acceptable but a signal of superior virtue.\n\nWe already talked about how people would be “encouraged” to get the vaccine through a loss of liberty “privileges.” By now, those eager to get the vaccine have done so. Also, those with valid reasons (like loss of income) have also gotten the jab. Therefore, holdouts who remain adamant they won’t get the vaccine are now being exposed to a whole new level of “encouragement” via extreme social pressure.\n\nA phenomenon called “othering” is used in both the violence dynamics world and in brainwashing. Othering is when a person determines that another person is unworthy, threatening, or all-around inadequate and hardly even the same species.\n\nOthering is a process whereby a group of people is made to seem fundamentally different, even to the point of making that group seem less than human. This process can trigger instinctive emotional reactions towards members of that group. In many instances, othering has been used to degrade, isolate, and render possible a group’s discrimination, abuse, or persecution. (source)\n\nThose who don’t learn from history…\n\nIt has happened many times in history: when human beings were used as slaves and property, when human beings were the subject of horrific experiments when the media and people in power deliberately manipulated human beings to believe that other humans weren’t like them and, therefore, it was permissible to mistreat or abuse them.\n\nAs the saying goes, those who don’t learn from history are doomed to repeat it. And repeat it, they are. I think, regardless of our stance, we can all agree that fervently wishing for bad things to happen to those who believe differently and dehumanizing them for their beliefs is pretty awful.\n\nPeople have come out with appalling suggestions for those who aren’t vaccinated.\n\nDon Lemon of CNN believes the unvaccinated should not be allowed to buy food or work. Does this mean he believes that they should starve to death?\n\nIf you had any doubt, Lemon also thinks people who are unvaccinated are idiots.\n\nCNN medical analyst Dr. Jonathan Reiner says that unvaccinated people shouldn’t go to bars and restaurants. A doctor pondered the ethics of whether he could refuse to see unvaccinated patients in The New York Times.\n\nIt’s becoming popular to blame the unvaccinated for all future cases of Covid\n\nDr. Anthony Fauci, the nation’s Big Kahuna of Covid, blames those not vaccinated for a new spike in cases.\n\n“We have 100 million people in this country … who are eligible to be vaccinated, who are not vaccinated,” Fauci said in an interview with “Face the Nation.” “We’ve really got to get those people to change their minds, make it easy for them, convince them, do something to get them to be vaccinated because they are the ones that are propagating this outbreak.” (source)\n\nColumnist Leana Wen of Washington Post believes the unvaccinated are dishonorable. Wen called upon the CDC to mandate masks for everyone because of it.\n\nAlabama Governor Kay Ivey wants everyone to blame the unvaccinated for any cases of Covid that happen to occur.\n\n“Folks are supposed to have common sense. But it’s time to start blaming the unvaccinated folks, not the regular folks. It’s the unvaccinated folks that are letting us down,” Ivey told reporters in Birmingham. (source)\n\nThat’ll really be helpful if someone unhinged loses a loved one to Covid and decides to seek vengeance on some “unvaccinated folk.” After all, the governor said it was their fault.\n\nHow far should “blame” be allowed to go?\n\nSpeaking of which, Nick Cohen of The Guardian said that it was only a matter of time before “we turn on the unvaccinated.”\n\nDr. William Schaffner, a professor in the Division of Infectious Diseases at Vanderbilt University Medical Center, says that unvaccinated people are “variant factories.”\n\nPeople want to impose financial penalties\n\nAndy Slavitt, a former medical advisor for President Biden, believes that anyone unvaccinated should be required to be tested daily at their own expense until they finally give in.\n\nSome employers are docking peoples’ paychecks, according to Forbes.\n\nWesleyan College in West Virginia is charging an even more outrageous amount.\n\nAnd, in the UK…\n\nSanctimonious pundit Piers Morgan of England tweeted that people who don’t get the vaccine should be denied medical care.\n\nUmm…considering that the UK has government healthcare – it’s already at their own expense, Piers.\n\nThey want to literally ruin the lives of the unvaccinated.\n\nThe only reason employers cannot (yet) legally force people to be vaccinated as a term of employment is that none of the vaccines have gained more than temporary FDA approval. None of them. Once the vaccines are FDA-approved, you can bet your sweet bootie it will be a requirement in many workplaces.\n\nPam Keith, an attorney from Florida suggests that the unvaccinated be denied access to any federal benefits…including things they’ve paid into their entire working lives like Social Security.\n\nOther “tolerant” people chimed in eagerly with replies containing all sorts of other ideas for punishing the unvaccinated:\n• None Or even better, deny any Medicare, Medicaid, or private insurance coverage for Covid treatments or meds for unvaccinated. Set a date, say 9/11/21, for vaccination coverage or no insurance. (\n• None That’s a great idea! Also, add employment, suspension of gun and driving licenses, access to loans. Sporting events, dining out concerts should also require proof of vaccine. It will not be popular, but it is the only way to get people vaccinated. (\n• None I still love the idea that every unvaxed person that gets the disease is held personally financially responsible for all testing & if they contract Covid. Not private insurance or Medicare/Medicaid. Only excuse: documented allergy to vaccines/components. (\n• None How about if all the health insurance companies just said we’ll raise your premiums by, say, $5000/year for each unvaccinated adult on a policy? The chances of getting sick if someone is unvaccinated are much greater than those that are. Make it a financial decision. (\n• None I’d rather see their health care suspended for all covid-related treatments. (\n\nWhat a bunch of stellar human beings. Imagine walking around thinking these things are justified. Imagine having that much hatred and disdain for those who don’t share your opinion.\n\nWhat are your thoughts?\n\nSeeing our country at each other’s throats yet again is heartbreaking. The rabid contempt for those who think differently can lead nowhere good. For those who believe we should all get vaccinated or not, are you okay with this kind of dehumanization? For those who are not planning to get the vaccination, have you faced any discrimination yet? Share your thoughts on this divisive behavior in the comments.\n\nDaisy Luther is a coffee-swigging, globe-trotting blogger. She is the founder and publisher of three websites. 1) The Organic Prepper, which is about current events, preparedness, self-reliance, and the pursuit of liberty on her website, 2) The Frugalite, a website with thrifty tips and solutions to help people get a handle on their personal finances without feeling deprived, and 3) PreppersDailyNews.com, an aggregate site where you can find links to all the most important news for those who wish to be prepared. She is widely republished across alternative media and Daisy is the best-selling author of 5 traditionally published books and runs a small digital publishing company with PDF guides, printables, and courses. You can find her on Facebook, Pinterest, Gab, MeWe, Parler, Instagram, and Twitter.\n\nBecome a Patron!\n\n Or support us at SubscribeStar\n\n Donate cryptocurrency HERE\n\nSubscribe to Activist Post for truth, peace, and freedom news. Follow us on Telegram, SoMee, HIVE, Flote, Minds, MeWe, Twitter, Gab, Ruqqus , GETTR and What Really Happened.\n\n\n\nProvide, Protect and Profit from what’s coming! Get a free issue of Counter Markets today.", "opengraph": {"locale": "en_US", "type": "article", "title": "Shocking and Dehumanizing Discrimination Against the Unvaccinated Is About to Make Life Very Difficult - Activist Post", "description": "Once the vaccines are FDA-approved, you can bet that it will become a more widespread requirement in many workplaces.", "url": "https://www.activistpost.com/2021/08/shocking-and-dehumanizing-discrimination-against-the-unvaccinated-is-about-to-make-life-very-difficult.html", "site_name": "Activist Post", "article:publisher": "http://www.facebook.com/activistpost", "article:published_time": "2021-08-13T12:45:02+00:00", "article:modified_time": "2021-08-13T14:29:15+00:00", "image": "https://www.activistpost.com/wp-content/uploads/2021/08/op-singled-out.jpg", "image:width": "1101", "image:height": "566", "image:type": "image/jpeg"}, "tags": ["Vaccine Passport", "Daisy Luther", "Mandatory vaccines"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Those who refuse to be vaccinated, with no medical reason not to, should be refused NHS care if they then catch covid. I’m hearing of anti-vaxxers using up ICU beds in London at vast expense to the taxpayer. Let them pay for their own stupidity &amp; selfishness.</p>\n<p>— Piers Morgan (@piersmorgan) <a href=\"https://twitter.com/piersmorgan/status/1420116018433859588?ref_src=twsrc%5Etfw\">July 27, 2021</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Here’s a good way to move people into getting vaccinated:</p>\n<p>Condition all federal benefits on proof of vaccination. </p>\n<p>That includes Social Security, Medicare, Medicaid, military pensions, VA benefits, fed subsidized housing… ALL OF IT! </p>\n<p>I bet THAT will move things along.</p>\n<p>— Pam Keith, Esq. (@PamKeithFL) <a href=\"https://twitter.com/PamKeithFL/status/1421321244151107584?ref_src=twsrc%5Etfw\">July 31, 2021</a></p></blockquote>\n"], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "777", "height": "437", "embed_code": "<iframe loading=\"lazy\" title=\"Don Lemon says unvaccinated should not be able to go to grocery stores, entertainment, or work...\" width=\"777\" height=\"437\" src=\"https://www.youtube.com/embed/EhlGC4EZ4Is?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/EhlGC4EZ4Is?feature=oembed"}], "links": ["https://www.activistpost.com/wp-content/uploads/2021/08/op-singled-out.jpg", "https://www.activistpost.com/product/1631583913/US/permacultucom-20/?cart=y", "https://www.theorganicprepper.com/covid-vaccine/", "https://museeholocauste.ca/en/resources-training/the-process-of-othering/", "https://www.forbes.com/sites/markjoyella/2021/07/24/cnns-don-lemon-on-the-unvaccinated-their-behavior-is-idiotic-and-nonsensical/?sh=7ad1123a4b76", "https://www.cnn.com/2021/07/26/health/us-coronavirus-monday/index.html", "https://www.nytimes.com/2021/07/13/magazine/vaccination-patients-ethics.html", "https://www.cbsnews.com/news/anthony-fauci-covid-19-unvaccinated-americans-delta-variant-face-the-nation/", "https://www.washingtonpost.com/opinions/2021/07/29/leana-wen-cdc-mask-guidance-unvaccinated-problem/", "https://edition.cnn.com/2021/07/23/politics/alabama-governor-kay-ivey-unvaccinated-covid/index.html", "https://www.nature.com/articles/d41586-020-00502-w", "https://www.theguardian.com/commentisfree/2021/feb/27/it-is-only-a-matter-of-time-before-we-turn-on-the-unvaccinated", "https://www.cnn.com/2021/07/03/health/unvaccinated-variant-factories/index.html", "https://www.newsweek.com/topic/anderson-cooper", "https://www.newsweek.com/former-biden-adviser-suggests-making-unvaccinated-people-pay-their-own-covid-testing-1612629", "https://www.mercer.com/#", "https://www.mmc.com/about/our-people/wade-symons.html", "https://www.forbes.com/sites/brucejapsen/2021/08/08/coming-soon-for-the-unvaccinated-a-50-monthly-paycheck-deduction-from-your-employer/?sh=4a78783147ae", "https://www.wvwc.edu/about/covid-19-update/", "https://www.wdtv.com/2021/08/05/west-virginia-wesleyan-college-charge-unvaccinated-students-750-covid-fee-fall-2021-semester/", "https://twitter.com/piersmorgan/status/1420116018433859588?ref_src=twsrc%5Etfw", "https://smartlivingshopper.clickfunnels.com/webinar-registrationtp09jgx5", "https://smartlivingshopper.clickfunnels.com/webinar-registrationtp09jgx5", "https://twitter.com/PamKeithFL/status/1421321244151107584?ref_src=twsrc%5Etfw", "https://twitter.com/Rustycard44/status/1421559926560862208", "https://twitter.com/MarlonH23627179/status/1421475866836619269", "https://twitter.com/Heydontshoot61/status/1421502866238451714", "https://twitter.com/bidnessdice/status/1421591238697000962", "https://twitter.com/VonduykeLinda/status/1421322598219239428", "https://www.theorganicprepper.com/unvaccinated-discrimination/", "https://www.theorganicprepper.com/sign-daily-newsletter", "https://thefrugalite.com/", "http://preppersdailynews.com/", "http://amzn.to/2h3c5S1", "https://learn.theorganicprepper.com/", "http://www.facebook.com/TheOrganicPrepper?ref=hl", "http://pinterest.com/daisyluther/boards/", "https://gab.com/daisyluther", "https://mewe.com/p/theorganicprepper", "https://parler.com/profile/daisyluther/posts", "https://www.instagram.com/theorganicprepper/", "https://twitter.com/DaisyLuther", "https://www.patreon.com/bePatron?u=5719077", "https://www.subscribestar.com/activist-post", "https://www.activistpost.com/support", "https://www.activistpost.com/survive-job-automation-apocalypse", "https://t.me/activistpost", "https://somee.social/profile/activist-post/timeline", "https://hive.blog/@activistpost", "https://flote.app/ActivistPost", "https://www.minds.com/ActivistPost", "https://mewe.com/i/activistpost", "https://twitter.com/ActivistPost", "https://gab.com/activist", "https://ruqqus.com/@ActivistPost", "https://gettr.com/user/activistpost", "https://www.whatreallyhappened.com/?q=users/activistpost", "http://countermarkets.com/"], "authors": ["Activist Post"], "publish_date": "2021-08-13T12:45:02+00:00"}