{"result_id": "009052", "URL": "https://www.activistpost.com/2021/07/vaccine-lobby-vs-the-unvaccinated-the-global-covid-19-faultline-may-now-be-unbridgeable.html", "timestamp": "2023-04-25 11:50:50 CEST+0200", "meta": {"description": "Big Tech’s digital pogroms against undesirable questions and expert opinions have only reinforced suspicions further.", "lang": "en", "keywords": "", "favicon": "https://www.activistpost.com/wp-content/uploads/2018/04/cropped-icon-32x32.jpg", "canonical": "https://www.activistpost.com/2021/07/vaccine-lobby-vs-the-unvaccinated-the-global-covid-19-faultline-may-now-be-unbridgeable.html", "encoding": "UTF-8"}, "image": null, "domain": "www.activistpost.com", "title": "Vaccine Lobby vs the Unvaccinated: The Global COVID-19 Faultline May Now Be Unbridgeable", "cleaned_text": "When the global COVID-19 vaccination drive kicked off earlier this year, two distinct faultlines gradually emerged, separating the relatively monolithic pro-vaxxer camp from the more heterogeneous assemblage of fence-sitters, sceptics and outright vaccine refuseniks. The new divide reflected a larger chasm that has prevailed since the watershed event of Sept 11 2001. It was a divide between those who lapped up mainstream narratives and those who instinctively questioned them.\n\nDoubts over the novel coronavirus were sown from the onset by scientific data which appeared sketchy, contradictory and outright dodgy. Big Tech’s digital pogroms against undesirable questions and expert opinions reinforced suspicions further. It was clear that earnest scientific inquiry, which thrives on vigorous debates, will not be tolerated.\n\nThis ironically resulted in the “free world” resorting to the likes of TikTok – a Chinese platform once targeted by the Trump administration – to post their opinions and grievances, including a litany of adverse reactions to various vaccines. Despite this, Western elites still have the gall to view themselves as champions of “free speech” even as mass protests against the New Normal roil their cities.\n\nThe hypocritical actions of countless leaders, celebrities and “influencers” worldwide who routinely flouted the very lockdowns they had advocated inevitably hardened public scepticism. If there are different sets of norms for the ruling and the ruled, why shouldn’t there be space for divergent opinions over the coronavirus?\n\nA recent MIT study revealed that coronavirus sceptics were generally better-informed and scientifically literate vis-a-vis their vaccinated counterparts. The unvaccinated cohort also appeared more “sophisticated” in the use of “datasets from official sources” as well as “state-of-the-art visualization methods” to interpret the COVID-19 conundrum. The qualitative contrasts between the pro-vaxxer and unvaccinated camps are nicely encapsulated in this video clip.\n\nMainstream tirades against vaccine holdouts – including profanity-laden epithets such as “morons” and calls to “remove them from society” – further alarmed the unvaccinated. Faced with such gratuitous hostility, vaccine refuseniks can be forgiven for regarding the growing inoculation divide as one between septic tanks and sceptic camps.\n\nOne set is fuelled by an intractable Wokist dogma that seeks to undermine every society along its path of contagion. Information is curated by anonymous fact-checkers with little or no domain-level expertise. Obedience is demanded in its totality; otherwise every molehill will be raised to the level of a Mt. Everest through a hyper-trolled hissy fit. Trying to understand the Wokist mindset is like data-mining a bottomless sewer.\n\nVaccine sceptics, as the author observed, are generally informed by caution, a spirit of inquiry and a prophylactic approach to the pandemic. They have been boosting their immune systems through a variety of means since the outbreak. The author himself spends up to 3 hours a day on jungle treks!\n\nTake Control of Your Family’s Health — Immune System Support Kit (Ad)\n\nSceptics can also quote an impressive array of experts ranging from mRNA technology pioneer Dr Robert Malone, Harvard epidemiologist Dr. Martin Kulldorff to Nobel Prize-winning virologist Dr. Luc Montagnier as well as expert testimonies before US state and federal authorities. Big Tech and Big Media have not only censored these viewpoints, they may have also played a role in removing cheap, prophylactic drugs like hydroxychloroquine, colchicine and ivermectin from over-the-counter (OTC) pharmacy shelves worldwide. It is considered a heresy to even mention these drugs in the social media. Stricter prescription regimens meant that it was sometimes easier to procure illicit drugs. If one follows the science of statistics, the results are as predictable as they are depressing: Drug overdoses killed 93,000 Americans in 2020, registering a 30% year-on-year increase.\n\nThe global medical gulag ushered in by the New Normal inadvertently brought together like-minded individuals across borders, ethnic divides and language barriers, particularly via the exchange of information that were constantly supressed by Big Tech and Big Media. Examples of successful prophylactic treatment regimens (e.g. Armacao dos Buzios in Brazil) were discovered via these interactions.\n\nThere are many reasons behind rising pushbacks against an aggressive global vaccine lobby.\n\nTo begin with, the approval process for new drugs and medical devices in the United States may take 12 and 7 years respectively while vaccine development traditionally involved a long, complex process that may span 10-15 years. Nearly all Covid-19 injections flogged worldwide today are experimental vaccines that were developed in less than a year. Tragic cases like thalidomide babies and the Cutter Incident continue to serve as a cautionary reminder to the unvaccinated. Negative testimonies from families and friends, or from dying patients themselves, are available on TikTok or YouTube alternatives such as BitChute and Brighteon.\n\nAs a result, trust in governments has reached an all-time low. Leaders who parrot the ethos of the New Normal cannot reverse course and face the consequences. By the end of 2020, billionaires made US$3.9 trillion during the pandemic while workers lost US$3.7 trillion. How can politicians justify this silent transfer of wealth? The figures for 2021 are likely going to be much worse. A prolonged medical emergency, backed by repressive state actions, is the only way this ungodly momentum can be maintained.\n\nDistrust towards official COVID-19 statistics was also fuelled by irrefutable counter-trends. Sweden which had never imposed mandatory lockdowns, masking or mass inoculations is faring much better than its vaccine-obsessed counterparts. Schools were kept open and tourists flowed in. Did Sweden just prove the primacy of herd immunity over vaccines?\n\nAs of July 29, the cumulative COVID-19 death toll in Sweden stood at a relative low of 14,617. Yet, during the initial outbreak of the pandemic early last year, the global Ministry of Truth was livid at Sweden’s laissez-faire response. The Nordic redoubt was prophesied to become a “catastrophe” and “an example of how not to handle COVID-19.” Swedish experts were carefully cherry-picked by left-wing bastions to be an echo chamber for the New Normal agenda. For a while, it seemed that the only real science coming out of Sweden were the ones vetted by the incomparably erudite Greta Thunberg.\n\nIn the United States, a White House plan for door-to-door vaccination appeared hypocritical in light of a stubborn refusal to reveal the number of “breakthrough” COVID-19 cases among its vaccinated staff. Was contact tracing activated to check on people who may have been infected by these individuals?\n\nWith such shocking deficits in government transparency, can one blame sceptics for hypothesizing whether it is the vaccines that are actuating the new coronavirus variants? According to a whistleblower who reportedly accessed raw data from the Vaccine Adverse Events Reporting System (VAERS), a mind-blowing 45,000 people have allegedly died from Covid-19 vaccines in the United States. Surely, this figure cannot be true? It is nonetheless a fact that less than 1% of adverse vaccine events are actually reported to the Food and Drug Administration (FDA). This leak has sparked a lawsuit led by attorney Thomas Renz against the US federal government. Since a suit has been filed, allegations must be proven in a court of law under the threat of perjury. At the very least, this action may shed some light on how the opaque VAERS functions. If the lawsuit has any merit – which remains doubtful – another charge may be warranted against the grossly misnamed “fact-checking” industry for being complicit in many deaths.\n\nThe renewed COVID-19 surge worldwide has necessitated a predictable scapegoat, going by prevalent liberal logic. CNN’s cherry-picked experts are now labelling the unvaccinated as “variant factories” because “the only source of new coronavirus variants is the body of an infected person.” This leap of logic can also be used to hypothesize whether the LGBTQK community may act as “variant factories” for more contagious HIV strains in the future. After all, as the CNN-channelled logic goes: “All it takes is one mutation in one person.” But one can just hear the accusatory shrieks of “intolerance”, “bigotry”, and “hate” when a specious argument is countered by a more politically-sensitive one.\n\nAs for “variant factories”, whatever happened to those pangolins or bats that were allegedly the source of the novel coronavirus? Bats can travel up to 800kms and may live for more than 20 years. Bats are also the ultimate “variant factories”. If the zoonotic theory of COVID-19 was correct, bats from southern China should have devastated the northern reaches of neighbouring Southeast Asia last year. However, the worst affected nations in the region are further to the south. Coincidentally, these are the countries that unquestioningly follow WHO recommendations. Calls by former Malaysian Prime Minister Najib Razak to learn from India’s successful pandemic management have fallen on deaf ears. India had quietly reinstated hydroxychloroquine and ivermectin into the COVID treatment protocol in the face of subtle opposition from its Silicon Valley diaspora.\n\nScapegoating the unvaccinated as “variant factories” is not only scientifically unproven and ethically deplorable but it criminally likens them to rats carrying a plague. How soon should we wait before the unvaccinated are targeted by mobs inflamed by the “science” of incentivised experts and anonymous fact-checkers? For a historical precedent, think of the centuries-spanning mob lynching of “plague-carrying Jews”?\n\nIn an ironic twist, nearly 84% of new COVID cases in Israel are among vaccinated individuals – as US Senator Ron Johnson pointed out in a recent interview. Even if this figure is contestable, how come Sweden does not have a problem with the Delta variant? The efficacy of the Pfizer vaccine in Israel has steadily dropped from a purported 90% to just 39% in a matter of months.\n\nAt the end of the day, the vaccine Rubicon has just widened. If current vaccines aren’t working against new variants, why should the unvaccinated jump headlong into the inoculation bandwagon? Coercive vaccination campaigns may have also permanently eroded trust in healthcare systems worldwide.\n\nBecome a Patron!\n\n Or support us at SubscribeStar\n\n Donate cryptocurrency HERE\n\nSubscribe to Activist Post for truth, peace, and freedom news. Follow us on Telegram, SoMee, HIVE, Flote, Minds, MeWe, Twitter, Gab, Ruqqus , GETTR and What Really Happened.\n\n\n\nProvide, Protect and Profit from what’s coming! Get a free issue of Counter Markets today.", "opengraph": {"locale": "en_US", "type": "article", "title": "Vaccine Lobby vs the Unvaccinated: The Global COVID-19 Faultline May Now Be Unbridgeable - Activist Post", "description": "Big Tech’s digital pogroms against undesirable questions and expert opinions have only reinforced suspicions further.", "url": "https://www.activistpost.com/2021/07/vaccine-lobby-vs-the-unvaccinated-the-global-covid-19-faultline-may-now-be-unbridgeable.html", "site_name": "Activist Post", "article:publisher": "http://www.facebook.com/activistpost", "article:published_time": "2021-07-31T00:50:20+00:00", "article:modified_time": "2021-07-31T00:57:01+00:00", "image": "https://www.activistpost.com/wp-content/uploads/2019/06/vaccine-police-state-1024x586-1-1024x586-1024x586-1024x586.jpg", "image:width": "1024", "image:height": "586", "image:type": "image/jpeg"}, "tags": ["Mathew Maavak", "Vaccines"], "tweets": [], "movies": [], "links": ["https://www.activistpost.com/wp-content/uploads/2019/06/vaccine-police-state-1024x586-1-1024x586-1024x586-1024x586.jpg", "https://www.activistpost.com/tag/mathew-maavak", "https://www.telegraph.co.uk/technology/2020/05/16/coding-led-lockdown-totally-unreliable-buggy-mess-say-experts/", "https://jacobinmag.com/2021/05/big-tech-censorship-science-covid-19-debate", "https://www.rt.com/usa/496822-tiktok-trump-ban-china/", "https://www.rt.com/news/530171-covid-health-pass-protest-rome/", "https://www.rt.com/op-ed/517342-new-normal-techno-voodooism/", "https://www.rt.com/news/530164-clashes-paris-protests-vaccination-certificates/", "https://www.heritage.org/public-health/commentary/hypocrisy-lockdown-orders-deserves-exposure", "https://news.mit.edu/2021/when-more-covid-data-doesnt-equal-more-understanding-0304", "https://www.nationalreview.com/2021/07/convincing-the-skeptics/", "https://www.bitchute.com/video/YbvlNUaPzAxh/", "https://www.bitchute.com/video/i02u2ZnyjWK1/", "https://www.verywellhealth.com/what-is-the-meaning-of-prophylactic-3157145", "https://store.thegrownetwork.com/products/immunity-support-kit?oid=72&affid=154", "https://www.bitchute.com/video/84K04msS2qUQ/", "https://www.aier.org/article/twitter-censors-famed-epidemiologist-martin-kulldorff/", "https://www.bitchute.com/video/dLxzh6dwPZVQ/", "https://www.youtube.com/watch?v=QAHi3lX3oGM", "https://www.reuters.com/article/us-health-coronavirus-usa-pharmacies-idUSKBN2190XC", "https://www.npr.org/2021/07/14/1016029270/drug-overdoses-killed-a-record-number-of-americans-in-2020-jumping-by-nearly-30", "https://www.bitchute.com/video/YmaOmiahNiB6/", "https://noticias.r7.com/jr-na-tv/videos/buzios-rj-registra-taxa-de-0-de-ocupacao-nos-leitos-pela-segunda-semana-seguida-25022021", "https://reader.elsevier.com/reader/sd/pii/S2452302X1600036X?token=ED9DCE6AB814EA33A0BC616B21EE5DEA895797245073A80336F134E048DF910AA39A8806012A8A5C049D23F1E0671DA7&originRegion=eu-west-1&originCreation=20210725024842", "https://www.historyofvaccines.org/content/articles/vaccine-development-testing-and-regulation", "https://pubmed.ncbi.nlm.nih.gov/21507989/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1383764/", "https://www.rt.com/op-ed/514054-covid-pandemic-billionaires-richer/", "https://fee.org/articles/daily-covid-deaths-in-sweden-hit-zero-as-other-nations-brace-for-more-lockdowns/", "https://www.worldometers.info/coronavirus/country/sweden/", "https://fee.org/articles/daily-covid-deaths-in-sweden-hit-zero-as-other-nations-brace-for-more-lockdowns/", "https://www.theguardian.com/world/2020/mar/30/catastrophe-sweden-coronavirus-stoicism-lockdown-europe", "https://www.cbsnews.com/news/sweden-covid-coronavirus-deaths-make-sweden-example-of-how-not-to-deal-with-covid-19/", "https://www.bitchute.com/video/vXtRggJjFxkc/", "https://www.usatoday.com/story/news/politics/2021/07/23/white-house-refuses-release-number-breakthrough-covid-cases/8074172002/", "https://www.eurasiareview.com/05052021-a-case-of-graphical-correlations-making-sense-of-indias-covid-19-surge-oped/", "https://dailyexpose.co.uk/2021/07/19/vaers-whistleblower-45000-dead-from-covid-19-vaccines-within-3-days-sparks-lawsuit-against-federal-government/", "https://digital.ahrq.gov/sites/default/files/docs/publication/r18hs017045-lazarus-final-report-2011.pdf#:~:text=Adverse%20events%20from%20drugs%20and,and%20Drug%20Administration%20(FDA)", "https://edition.cnn.com/2021/07/03/health/unvaccinated-variant-factories/index.html", "https://blogs.ntu.edu.sg/hp3203-2018-13/general-information/", "https://apnews.com/article/business-health-asia-coronavirus-pandemic-southeast-asia-742d432d930641bd5f3dd7f33d471579", "https://www.freemalaysiatoday.com/category/nation/2021/07/14/look-to-india-for-help-in-battling-pandemic-says-najib/", "https://smartlivingshopper.clickfunnels.com/webinar-registrationtp09jgx5", "https://smartlivingshopper.clickfunnels.com/webinar-registrationtp09jgx5", "https://link.springer.com/chapter/10.1057%2F9780230235427_6", "https://rumble.com/vk4uvm-senator-johnson-discusses-vaers-numbers-reports-84-of-new-covid-in-israel-a.html", "https://www.rt.com/usa/529996-cdc-vaccine-booster-israel/", "https://www.rt.com/usa/530109-poll-unvaccinated-americans-entrenched/", "https://www.patreon.com/bePatron?u=5719077", "https://www.subscribestar.com/activist-post", "https://www.activistpost.com/support", "https://www.activistpost.com/survive-job-automation-apocalypse", "https://t.me/activistpost", "https://somee.social/profile/activist-post/timeline", "https://hive.blog/@activistpost", "https://flote.app/ActivistPost", "https://www.minds.com/ActivistPost", "https://mewe.com/i/activistpost", "https://twitter.com/ActivistPost", "https://gab.com/activist", "https://ruqqus.com/@ActivistPost", "https://gettr.com/user/activistpost", "https://www.whatreallyhappened.com/?q=users/activistpost", "http://countermarkets.com/"], "authors": ["Activist Post"], "publish_date": "2021-07-31T00:50:20+00:00"}