{"result_id": "009050", "URL": "https://www.activistpost.com/2021/09/hospital-stops-delivering-babies-because-staff-quit-over-vaccine-mandate-and-other-dystopian-weekly-news.html", "timestamp": "2023-04-25 11:50:49 CEST+0200", "meta": {"description": "Student banned from online courses for being unvaxxed; scientists who censored lab leak theory have connections to the lab; and much more...", "lang": "en", "keywords": "", "favicon": "https://www.activistpost.com/wp-content/uploads/2018/04/cropped-icon-32x32.jpg", "canonical": "https://www.activistpost.com/2021/09/hospital-stops-delivering-babies-because-staff-quit-over-vaccine-mandate-and-other-dystopian-weekly-news.html", "encoding": "UTF-8"}, "image": null, "domain": "www.activistpost.com", "title": "Hospital Stops Delivering Babies Because Staff Quit Over Vaccine Mandate - And Other Dystopian Weekly News", "cleaned_text": "Here’s our weekly roll-up of the most ridiculous stories from around the world that are threats to your liberty, risks to your prosperity… and on occasion, inspiring poetic justice.\n\nLewis County General Hospital in the State of New York announced it will stop delivering babies after September 24.\n\nNo, they aren’t overwhelmed by COVID patients. It’s because too many maternity unit workers have resigned in protest of vaccine mandates.\n\nIn August, New York issued a decree that all health workers must be vaccinated by September 27.\n\nA total of 165 hospital employees, a full 27% of the staff are not vaccinated against COVID-19.\n\nSo far 30 have resigned, which includes six employees in the maternity unit, plus another seven unvaccinated maternity workers possibly being pushed out before the vaccination deadline.\n\nLast year they were front line heroes in the fight against COVID. This year they are social outcasts, discriminated against by employers and the government because of a personal health decision.\n\nThese are health professionals— you’d think people would respect their expert opinions on personal health.\n\nClick here to read the full story.\n\nAfter Rutgers University required all students returning to campus to be vaccinated, a student opted to take all online classes.\n\nAs a healthy 22 year old who works out, Logan Hollar is in an extremely low risk category for severe COVID, and in the highest risk category to suffer the serious side effects of Myocarditis and Pericarditis— enlargement of the heart.\n\nBut when he went online in late August to pay his tuition, Logan found that he was locked out of his Rutgers email account.\n\nWhen he contacted the school administration, they told him that even though he was taking all virtual classes, he still needed to ask for a vaccine exemption.\n\nSo, Logan ask for the exemption… but the university denied his request.\n\nClick here to read the full story.\n\nHALF Of “COVID Hospitalizations” Aren’t Serious— Or Even Related To COVID\n\nCOVID hospitalizations are seen as a major indicator of how bad the COVID pandemic is in the US.\n\nBut a study conducted at US Department of Veterans Affairs hospitals has found that about half of the 47,742 “COVID hospitalizations” examined were not severe, or even due to COVID.\n\nWhen people are admitted to a VA hospital, for any reason, they are generally given a COVID test for precaution. This brings back some positive test results for people who were asymptomatic, or barely affected by the virus.\n\nTake Control of Your Family’s Health — Immune System Support Kit (Ad)\n\nBut because they are in the hospital, and have tested positive for COVID, they become a COVID hospitalization.\n\nThe study found that, “Disease severity in the vaccine era among hospitalized patients was lower among both unvaccinated (55.0%…) and vaccinated patients (42.6%…).”\n\nCases were considered severe if a patient required oxygen, or dropped below a 94% blood oxygen saturation.\n\nThat means 45% of unvaccinated patients, and 57% of vaccinated patients in the study had a mild case of COVID.\n\nClick here to read the full study.\n\n26 Of 27 Scientists Who Helped Censor The Lab Leak Theory Have Links To The Lab\n\nLast year a zoologist named Peter Daszak wrote a letter, signed by 27 scientists, denouncing the theory that COVID-19 leaked from the Wuhan Institute of Virology.\n\n, and Facebook used the letter as evidence of a “scientific consensus” that the theory was unfounded.\n\nOh and, by the way, Peter Daszak’s job is to hand out federal grants, some of which he sent to the Wuhan Institute of Virology.\n\nBut that wasn’t the only massive conflict of interest.\n\nTurns out, 26 of the 27 scientists who signed Daszak’s letter have links to researchers who worked for the Wuhan Institute of Virology, or organizations which funded it.\n\nAlthough The Lancet, the peer-reviewed medical journal which published the letter, eventually added an addendum declaring Daszak’s conflict of interest, it did not retract the letter, or force the other scientists to disclose their conflicts of interest.\n\nRemember this whenever someone talks about a scientific consensus, tells you to blindly trust the experts, or puts “the” in front of “science”.\n\nClick here to read the full story.\n\nUS Drone Bombed An Aid Worker And His Family In Afghanistan, Not “ISIS-K”\n\nAll it takes to be assassinated by a US drone is for some anonymous military commander to deem someone “suspicious.”\n\nThe military admits it did not know the identity of the man in the vehicle it was tracking when it fired a missile from a drone. Officials said he “possibly” visited an ISIS safe house, and what he loaded in to his car “might” have been explosives.\n\nIn fact, the man driving the car was Zemari Ahmadi, a worker for a US-based aid company. The New York Times investigated independently, and its evidence shows Ahmadi simply drove colleagues to work, and loaded water canisters into his vehicle.\n\nThe US military admits the strike could have killed three civilians. The New York Times says it killed ten civilians, including seven children. Some had applied to immigrate to the US.\n\nWhen Senator Rand Paul questioned Secretary of State Antony Blinken on whether the strike killed a member of ISIS-K or an aid worker, Blinken answered, “I don’t know because we’re reviewing it.”\n\nPaul replied, “See, you’d think you’d kind of know before you off somebody with a Predator drone whether he’s an aid worker or in ISIS-K.”\n\nClick here to read the full story.\n\nBecome a Patron!\n\n Or support us at SubscribeStar\n\n Donate cryptocurrency HERE\n\nSubscribe to Activist Post for truth, peace, and freedom news. Follow us on Telegram, HIVE, Flote, Minds, MeWe, Twitter, Gab, Ruqqus, and What Really Happened.\n\n\n\nProvide, Protect and Profit from what’s coming! Get a free issue of Counter Markets today.", "opengraph": {"locale": "en_US", "type": "article", "title": "Hospital Stops Delivering Babies Because Staff Quit Over Vaccine Mandate - And Other Dystopian Weekly News - Activist Post", "description": "Student banned from online courses for being unvaxxed; scientists who censored lab leak theory have connections to the lab; and much more...", "url": "https://www.activistpost.com/2021/09/hospital-stops-delivering-babies-because-staff-quit-over-vaccine-mandate-and-other-dystopian-weekly-news.html", "site_name": "Activist Post", "article:publisher": "http://www.facebook.com/activistpost", "article:published_time": "2021-09-18T23:21:38+00:00", "article:modified_time": "2021-09-18T23:21:27+00:00", "image": "https://www.activistpost.com/wp-content/uploads/2019/03/truthstream-censorship-1024x576-1.jpg", "image:width": "1024", "image:height": "576", "image:type": "image/jpeg"}, "tags": ["Science", "Simon Black"], "tweets": [], "movies": [], "links": ["https://www.activistpost.com/wp-content/uploads/2019/03/truthstream-censorship-1024x576-1.jpg", "https://www.sovereignman.com/trends/hospital-stops-delivering-babies-because-staff-quit-over-vaccine-mandate-33482/", "https://www.wwnytv.com/2021/09/10/hospital-stop-delivering-babies-maternity-workers-resign-over-vaccine-mandate/", "https://www.nj.com/coronavirus/2021/09/rutgers-student-says-hes-being-stopped-from-taking-virtual-classes-because-hes-not-vaccinated.html", "https://store.thegrownetwork.com/products/immunity-support-kit?oid=72&affid=154", "https://www.researchsquare.com/article/rs-898254/v1", "https://www.sovereignman.com/trends/why-is-this-even-a-controversial-statement-32657/", "https://www.telegraph.co.uk/news/2021/09/10/revealed-scientists-dismissed-wuhan-lab-theory-linked-chinese/", "https://smartlivingshopper.clickfunnels.com/webinar-registrationtp09jgx5", "https://smartlivingshopper.clickfunnels.com/webinar-registrationtp09jgx5", "https://www.nytimes.com/2021/09/10/world/asia/us-air-strike-drone-kabul-afghanistan-isis.html", "https://www.thedailybell.com/all-articles/news-analysis/hospital-stops-delivering-babies-because-staff-quit-over-vaccine-mandate/", "https://www.patreon.com/bePatron?u=5719077", "https://www.subscribestar.com/activist-post", "https://www.activistpost.com/support", "https://www.activistpost.com/survive-job-automation-apocalypse", "https://t.me/activistpost", "https://hive.blog/@activistpost", "https://flote.app/ActivistPost", "https://www.minds.com/ActivistPost", "https://mewe.com/i/activistpost", "https://twitter.com/ActivistPost", "https://gab.com/activist", "https://ruqqus.com/@ActivistPost", "https://www.whatreallyhappened.com/?q=users/activistpost", "http://countermarkets.com/"], "authors": ["Activist Post"], "publish_date": "2021-09-18T23:21:38+00:00"}