{"result_id": "009002", "URL": "https://www.activistpost.com/2020/09/a-guide-to-the-ronavax-understanding-the-experimental-coronavirus-vaccines.html", "timestamp": "2023-04-25 11:47:02 CEST+0200", "meta": {"description": "This comprehensive guide to the 7 vaccines known to be in development can help make informed choices about your health.", "lang": "en", "keywords": "", "favicon": "https://www.activistpost.com/wp-content/uploads/2018/04/cropped-icon-32x32.jpg", "canonical": "https://www.activistpost.com/2020/09/a-guide-to-the-ronavax-understanding-the-experimental-coronavirus-vaccines.html", "encoding": "UTF-8"}, "image": null, "domain": "www.activistpost.com", "title": "A Guide to the Ronavax - Understanding the Experimental Coronavirus Vaccines", "cleaned_text": "Around 150 vaccines are being developed for the alleged* rona virus, but the ones that deserve the most attention are the ones winning contracts and/or being trialled already, because their success is almost guaranteed. Some people want them, some never think about it, and others worry they could be coerced or physically forced to get them. The thing is, everyone should have access to information so they can make informed choices about what is right.\n\nTwo of these ronavax are vaguely similar to the kind of vaccines that have been licensed in the past. One is made by Sanofi/GSK – selected for Operation Warp Speed in the U.S., this vaccine contains proteins that are made in a bioreactor, using genetically engineered baculoviruses and insect cells. This is a method of protein engineering. Novavax, also funded by the US government uses a similar technique, but packages the proteins in nanoparticles. The idea behind these vax is the same as ‘normal’ vaccines, because the proteins are designed to look like the ones the rona is said to make (usually referred to as the spike or ‘S’ protein) so that your body reacts to them as if they were ‘the real thing’.\n\nBecome an Activist Post Patron for $1 per month at Patreon.\n\nAll the others are genetic vaccines, or ‘genvax’. They are very experimental, because they gain access to your cells and get you to be the bioreactor and make the proteins yourself.\n\nThis is done by smuggling genetic instructions into your cells, using one of three methods:\n• Adenoviruses which have been genetically modified to contain or ‘express’ the gene of interest (used by AstraZeneca and J&J/Janssen)\n• Lipid nanoparticles with mRNA (used by Pfizer/BioNTech, Curevac, and Moderna)\n• DNA plasmids (used by INOVIO, a company worth noting because of its novel techniques, strategic partnerships and product pipeline)\n\nThey are all ‘delivery vehicles’ or ‘vectors’ – a way to get the DNA/mRNA into your cells.\n\nThey are all methods used in gene therapy. If the ronavax are licensed, not only could gene therapy become very big business, but restrictions on genetic patents could be loosened. Most current gene therapy products are for very specific conditions, e.g. LUXTURNA which uses the RPE65 gene for patients with an inherited retinal disease. However, because genvax use the same techniques, getting the ronavax to market could begin a new era of busy production lines in bio-factories, meaning they could also churn out some of the other ‘therapeutics’ that have been planned.\n\nDNA and mRNA are said to be ‘the software of life’ and the possibilities are endless. So, perhaps, are the dangers. Because, whilst the platform or vector remain the same, the software doesn’t. For each new application, or disease, a new genetic code is designed on computers. Then, the new code is added to the chosen vector, whether it’s synthetic adenoviruses, bacterial plasmids, or nanoparticles. And each new code is a new risk. So, perhaps, is combining the codes – having more than one genetic vaccine, or drug, could create unforeseen effects.\n\nSome of these platforms have patents which describe the use of XNA (xeno nucleic acids), as well as the lab-made DNA/mRNA – and all sorts of other things you might not realise!\n\nSince they are all genetic vaccines, let’s call them ‘genvax’. They are very hard to understand when nobody has explained anything, but this series of articles will give information on some of the basics so you can wrap your head around it all!\n\n[*The rona virus can only be ‘alleged’ because no causal link between what the rona tests are detecting, and any illness deemed to be ‘covid’, has been established. All we have to go on is ‘the news’, anecdotal reports, guesses, and a genetic sequence of ‘the rona’ provided by Zhang and Holmes by January 10th, 2020, and the abomination of ‘involving covid’ in the statistics. Be sure, at least, to check the mortality figures provided by your government and compare them to previous years! Most of the people who died in the beginning were already ill and old, and the lockdown meant their level of care was substantially reduced.]\n\nThe top seven ronavax, in terms of contracts awarded, are described below. Bear in mind that all of these vaccines:\n• Are genetically modified or engineered (and some of them also contain genetic instructions for the body).\n• Have been in development for a range of diseases for over 30 years.\n• Received funding and support from the big boys.\n• Can be tested and produced at enormous scale, according to the companies that make them (although hardly anyone is trained to do this because it’s never been done before).\n• Have NEVER been licensed.\n\nOnly a handful of DNA vaccines have ever been licensed but they are all for veterinary use (e.g. for pigs and chickens).\n• AZD1222; replication-deficient chimpanzee adenovirus vector; developed with Oxford University, and originally called ChAdOx1 nCoV-19; this vector has been used in trials for others vaccines, e.g. RSV vax; uses fetal cells in production; to be sold at cost; agreements with CEPI, GAVI and the Serum Institute of India to manufacture the vax.\n• About 60% of 1,000 participants in the phase 1/2 trial experienced side effects, and the study was put on hold because someone developed transverse myelitis, which is an inflammation of the spinal cord. It was later said to be an “unrelated neurological illness”.\n• Phase 3 trials were also put on hold due to an adverse event for a UK participant. An informed consent form for this trial stated that effects would probably be mild to moderate, but could be severe, and that “you might experience pain resulting in some difficulty moving your arm, but this should resolve within a few days.” Other concerns were also stated, such as the possibility of enhanced disease and Guillain-Barré syndrome.\n• More trials planned in America and Russia.\n• A trial of ChAdOx1 85A prime with MVA85A boost (for tuberculosis) reported unsolicited adverse events, which included lymphopaenia, neutropaenia leukopaenia, eosinophilia and thrombocytopaenia, as determined by blood tests. One participant got shingles a month after the trial, but this was considered unrelated.\n• Robert F. Kennedy Jr. reported: “Lead developer Andrew Pollard juggles scandalous conflicts that allow him to license, register, and mandate his own untested vaccines to the masses. Pollard is Senior Advisor to Britain’s MRHA Panel which licenses vaccines, chairs Britain’s JVCI committee that mandates them, and advises the European Medicine Agency (EMA). He takes payments from virtually all the big vaccine makers.”\n• Struck a deal with Ethris in 2017 to use their proprietary mRNA technology for respiratory diseases.\n• AstraZeneca may also be using, or planning to use, XNA in some of their products, e.g. modified mRNA and anti-sense oligonucleotides, as well as modified proteins, peptides and recombinant enzymes.\n• NVX-CoV2373; recombinant nanoparticle vax using Matrix M™ adjuvant; $1.6 billion in funding from Operation Warp Speed plus funding from Dept of Defense, HHS and CEPI; doses for US citizens supplied at no cost; research trial with mice for MERS-COV vax in 2014 with funding from the NIH; flu vax called NanoFlu being trialled (the next step is to file for approval!) but gave up on their Ebola glycoprotein vax after phase 1; trials for their RSV vax called ResVax were also unsuccessful.\n• In 2013, Novavax filed a patent application for a vax using an “immunogenic composition comprising a MERS-CoV nanoparticle”.\n• BNT162b2; using BioNTech’s nucleoside-modified messenger RNA (modRNA) platform which encodes an optimized SARS-CoV-2 receptor binding domain (RBD) antigen, and Acuitas Therapeutics’ lipid nanoparticles; several constructs being tested.\n• In the phase I/II trial, one of the twelve participants who received the 100 µg dose (the highest dose) experienced severe pain at the injection site, and this group did not receive a second dose as planned.\n• A fifth construct was announced at the start of September, and they all “use different mRNA formats and target antigens. Like its latest addition, dubbed BNT162b3, the two fast-tracked candidates use a nucleoside-modified RNA, or modRNA, while another prospect uses a uridine-containing mRNA, or uRNA, and the fourth uses self-amplifying mRNA.”\n• Phase III trials are to include people with HIV and Hepatitis.\n• Early attempts used naked RNA, and were aimed at cancer.\n• Founded in 2008, BioNTech’s partners have included Pfizer, Sanofi, Roche, Eli Lilly and Bayer.\n• Product pipeline: 19 cancer vax, one for flu, one for covid, one undisclosed, others to follow, e.g. a HIV vaccine with the Bill and Melinda Gates Foundation.\n• This technology produces an exact genetic match to proteins found on the surface of the virus, which are then expressed using Sanofi’s insect (baculovirus) expression platform. The technology is used for Sanofi’s licensed recombinant influenza vaccine and a SARS vaccine.\n• Funding of up to $2.1 billion from the U.S. government as part of Operation Warp Speed.\n• Supported by CEPI and Gates Foundation, funded by BARDA; agreement with TranslateBio since 2018 to deliver mRNA vax for up to five infectious diseases; busy building manufacturing facilities; Sanofi Pasteur has four genvax ‘in discovery’, meaning they have not yet begun trials; TranslateBio has four vax that can be inhaled.\n• The baculovirus expression platform is protein engineering in a bioreactor, i.e. producing genetically modified proteins in insect cells.\n• This platform is used to make Cervarix® and Flublok®.\n• RNActive platform with mRNA and lipid nanoparticles (LNPs); backed by Gates Foundation; partnered with CEPI; has “an extensive in-house nucleotide sequence library” and has developed a portable RNA printer; product pipeline includes CV7202 rabies vaccine, several others in pre-clinical development including cancer vax and CAS-9 gene editing.\n• Their leading program, for prostate cancer vax CV0104, encoded six antigens, and is detailed in this research paper from 2014. It failed a phase II trial in 2017 and appears to have been discontinued. The only one being trialled now is CV7202 (phase I). Trials for ronavax have not yet begun.\n• Based on its AdVac and PER.C6 platform technologies; funding from BARDA; manufacturing capacity is being increased;\n• The AdVac platform has been used in a number of clinical trials. According to this WHO document from 2016, vaccines for meningitis, RSV, ebola, prostate cancer, and Staph. Aureus had reached phase I trial, whilst vaccines for malaria, TB, HCV, HIV, and pandemic flu, had reached phase II trials.\n• mRNA1273; Moderna’s mRNA is delivered in lipid nanoparticles, description of its platform also serves to describe mRNA platforms by other companies: “… an entirely new in vivo drug technology that produces human proteins, antibodies and entirely novel protein constructs inside patient cells, which are in turn secreted or active intracellularly. This breakthrough platform addresses currently undruggable targets”\n• funding from ? partnered with Merck and AstraZeneca in ? https://ir.serestherapeutics.com/news-releases/news-release-details/four-boston-biotech-firms-worth-watching\n• delivered the first “clinical-grade batch” of mRNA-1273 just 42 days after sequence selection\n• “Why are we so passionate about messenger RNA?” Moderna President Stephen Hoge asked the attentive audience. “It starts with the question of life,” he explained. “And in fact, all life that we know flows through messenger RNA. … In our language, mRNA is the software of life.”\n• Lots of investment has been raised since it was founded in 2012 and included partnerships with DARPA, AstraZeneca and Merck and funding from the Gates Foundation.\n• Generally perceived to have been operating “in stealth mode” until its plans were revealed at the J.P. Morgan Healthcare Conference in 2017.\n• Moderna was the first company to publish results of a phase I study for the alleged rona, on the 18th of May, 2020. The study was conducted by the NIH.\n• The results announced by the company have received criticism, plus three people experienced systemic symptoms after receiving a second injection of the high dose.\n• Funding for mRNA-1273 from BARDA; manufacturing contracts with Lonza and Catalent.\n• A full round up of Moderna’s product pipeline is in their SEC report, and there are tons of updates here. Their ventures include Onkaido (oncology), Valera (infectious diseases), Elpidera, (rare diseases), and Caperna, (personalized cancer vaccines).\n• Moderna is using Amazon Cloud Services to help deliver personalized cancer vax.\n• The phase III trial of mRNA-1273 is due to be completed in October 2022.\n• Moderna has done a $1.525 billion deal to supply the US government with 100 million doses.\n• The sobering reality that nobody likes to talk about is the legal bit at the end of some of the press releases: “The forward-looking statements in this press release are neither promises nor guarantees, and you should not place undue reliance on these forward-looking statements because they involve known and unknown risks, uncertainties, and other factors, many of which are beyond Moderna’s control and which could cause actual results to differ materially from those expressed or implied by these forward-looking statements. These risks, uncertainties, and other factors include, among others: the fact that there has never been a commercial product utilizing mRNA technology approved for use; the fact that the rapid response technology in use by Moderna is still being developed and implemented; the fact that the safety and efficacy of mRNA-1273 has not yet been established; potential adverse impacts due to the global COVID-19 pandemic such as delays in regulatory review, manufacturing and clinical trials, supply chain interruptions, adverse effects on healthcare systems and disruption of the global economy; and those other risks and uncertainties described under the heading “Risk Factors” in Moderna’s most recent Quarterly Report on Form 10-Q filed with the U.S. Securities and Exchange Commission (SEC) and in subsequent filings made by Moderna with the SEC, which are available on the SEC’s website at www.sec.gov”\n• INO-4800; DNA plasmids are injected, then electrical pulses are administered to the injection site. This is called electroporation, and it’s to help the DNA get into the cells – mRNA vaccines only need to enter the cell, while DNA vaccines have to reach the cell nucleus.\n• Funding from the US Dept of Defense to develop the proprietary CELLECTRA 2000 device, used for electroporation; as well as funding from Gates Foundation and CEPI.\n• “To develop a new vaccine, Inovio first converts the virus’ RNA into DNA and identifies short sections that will, according to computer simulations, generate the greatest immune response. The plasmids are then produced in large quantities using bacteria”.\n• The first company, partnered with GeneOne, with a MERS vaccine (GLS-5300) to get to phase II in clinical trials; the initial phase I study was conducted in partnership with the Walter Reed Army Institute of Research, and the results presented to the WHO-IVI Joint Symposium for MERS-CoV Vaccine Development in 2018.\n• Development of the MERS vax was supported by a $34 million grant from the Samsung Foundation through the International Vaccine Institute, and $56 million from CEPI.\n• Inovio’s pipeline includes INO-5151 for prostate cancer, INO-1800 for hepatitis B virus, GLS-6150 for hepatitis C virus, INO-4212 for Ebola virus, GLS-5300 for Middle East respiratory syndrome, GLS-5700 for Zika virus infection, PENNVAX-GP for human immunodeficiency virus and INO-4500 for Lassa fever virus.\n• Development of a prophylactic vaccine has been hampered by the lack of MERS-CoV infections, “as well as sourcing suitable small animal models [75, 97, 104]. These factors complicate the definition of a target population for mass prophylactic vaccination and pre-clinical demonstration of vaccine efficacy.”\n• Like the other genvax, INOVIO’s DNA plasmid vax claim to be “off-the-shelf” products, i.e. cold storage is not required, as well as rapid development times, plus they’re relatively cheap to manufacture, and large quantities can be produced.\n• Partners include ApolloBio, Astra Zeneca, DARPA, National Cancer Institute, Regeneron, CEPI, Gates Foundation, and a host of others.\n• INOVIO’s lead candidate is said to be VGX-3100 (for precancerous cervical dysplasia).\n• INOVIO uses HEK-293t cells (this is a fetal cell line).\n• The company are currently faced with lack of manufacturing facilities, but they have some strategic partnerships and plenty of products in the pipeline.\n\nRead Part 1: We Need to Talk About Proteins — The Ronascam, The Vaccines, and Genetic Patents\n\nRead Part 4: Ronavax Roulette — No Cure, No Control: The Risks of Genetic Vaccines\n\nJulie Beal is a UK-based independent researcher who has been studying the globalist agenda for more than 20 years, focusing on a wide range of information around Agenda 21, Communitarianism, Ethics, Bioscience, and much more.\n\nSubscribe to Activist Post for truth, peace, and freedom news. Send resources to the front lines of peace and freedom HERE! Follow us on SoMee, HIVE, Parler, Flote, Minds, and Twitter.\n\nProvide, Protect and Profit from what’s coming! Get a free issue of Counter Markets today.", "opengraph": {"locale": "en_US", "type": "article", "title": "A Guide to the Ronavax - Understanding the Experimental Coronavirus Vaccines - Activist Post", "description": "This comprehensive guide to the 7 vaccines known to be in development can help make informed choices about your health.", "url": "https://www.activistpost.com/2020/09/a-guide-to-the-ronavax-understanding-the-experimental-coronavirus-vaccines.html", "site_name": "Activist Post", "article:publisher": "http://www.facebook.com/activistpost", "article:published_time": "2020-09-27T03:00:56+00:00", "article:modified_time": "2020-11-07T15:30:02+00:00", "image": "https://www.activistpost.com/wp-content/uploads/2020/09/corona-vax-drugdiscoverytrends.jpg", "image:width": "1187", "image:height": "745", "image:type": "image/jpeg"}, "tags": ["Julie Beal", "Covid-19", "Vaccines", "DNA", "Nanotechnology", "Science", "Genetics"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "777", "height": "437", "embed_code": "<iframe loading=\"lazy\" title=\"The Science Behind Gene Therapy\" width=\"777\" height=\"437\" src=\"https://www.youtube.com/embed/PVYxepYxfw8?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/PVYxepYxfw8?feature=oembed"}], "links": ["https://www.activistpost.com/wp-content/uploads/2020/09/corona-vax-drugdiscoverytrends.jpg", "https://www.activistpost.com/tag/julie-beal", "https://www.technologyreview.com/2020/02/15/844752/biologists-rush-to-re-create-the-china-coronavirus-from-its-dna-code/", "https://www.technologyreview.com/2020/02/15/844752/biologists-rush-to-re-create-the-china-coronavirus-from-its-dna-code/", "https://markets.businessinsider.com/news/stocks/race-for-covid-19-vaccine-who-are-the-key-players-1029305455?op=1", "https://www.livescience.com/most-promising-coronavirus-vaccine-candidates.html", "https://www.raps.org/news-and-articles/news-articles/2020/3/covid-19-vaccine-tracker", "https://www.nature.com/articles/d41587-020-00005-z", "https://relief.unboundmedicine.com/relief/view/Coronavirus-Guidelines/2355056/all/Coronavirus_COVID_19_Vaccines", "https://www.sanofi.com/en/media-room/press-releases/2020/2020-09-03-07-00-00", "https://www.gsk.com/en-gb/media/press-releases/sanofi-and-gsk-selected-for-operation-warp-speed-to-supply-united-states-government-with-100-million-doses-of-covid-19-vaccine/", "https://www.medicalcountermeasures.gov/newsroom/2020/psc-sanofi-recombinant/", "https://pubmed.ncbi.nlm.nih.gov/21590393/", "http://www.processdevelopmentforum.com/articles/can-vaccine-development-be-safely-accelerated/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7159335/", "https://en.wikipedia.org/wiki/Protein_engineering", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4058772/", "https://www.covidx.eu/NVX-CoV2373", "https://www.hhs.gov/about/news/2020/07/07/hhs-dod-collaborate-novavax-produce-millions-covid-19-investigational-vaccine-doses-commercial-scale-manufacturing-demonstration-projects.html", "https://www.patreon.com/activistpost", "https://www.who.int/biologicals/areas/vaccines/dna/en/", "https://bio.libretexts.org/Bookshelves/Microbiology/Book%3A_Microbiology_(Boundless)/7%3A_Microbial_Genetics/7.24%3A_Transgenic_Organisms/7.24A%3A_Genetically_Engineered_Vaccines", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4507798/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5609467/", "https://pdfs.semanticscholar.org/91fa/c962b3faa7de7287751b669e202756a04efc.pdf", "https://www.nature.com/articles/s41541-020-0159-8", "https://www.biochain.com/general/cdna-vs-genomic-dna/", "https://www.biopharminternational.com/view/plasmid-dna-based-vaccines-combating-infectious-diseases", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5609467/", "https://ghr.nlm.nih.gov/primer/therapy/genetherapy", "https://www.frontiersin.org/articles/10.3389/fonc.2019.00297/full", "http://www.pharmatimes.com/magazine/2018/december_2018/a_record-breaking_year_for_biotech_funding", "https://learn.genetics.utah.edu/content/genetherapy/tools/", "https://luxturna.com/", "https://www.researchgate.net/publication/260441203_Adenovirus-Based_Vaccines_for_Fighting_Infectious_Diseases_and_Cancer_Progress_in_the_Field/download", "https://www.amadeuscapital.com/the-future-of-cell-and-gene-therapy-manufacturing-just-got-brighter/", "https://www.biopharmadive.com/news/novartis-amazon-aws-manufacturing-supply-chain/568572/", "https://www.cobrabio.com/News/March-2020/Cobra-Jenner-Institute-consortium-COVID-19-vaccine", "https://www.cobrabio.com/News/March-2020/Cobra-Karolinska-Institutet-COVID-19-Vaccine", "https://cen.acs.org/business/start-ups/mRNA-disrupt-drug-industry/96/i35", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4507798/", "https://www.cell.com/molecular-therapy-family/molecular-therapy/fulltext/S1525-0016(16)32623-5", "https://www.thermofisher.com/uk/en/home/life-science/cell-culture/transfection/choosing-a-transfection-reagent.html", "https://www.sciencedirect.com/science/article/pii/S0169409X20300727", "https://pmj.bmj.com/content/postgradmedj/80/948/560.full.pdf", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6190509/", "https://www.biorxiv.org/content/10.1101/401612v1.full", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4292072/", "https://www.bitchute.com/video/5pSu7erAb4vi/", "https://www.youtube.com/watch?v=LYo9oK-Giso", "https://www.bma.org.uk/media/2843/bma-verification-of-death-vod-july-2020.pdf", "https://www.ncbi.nlm.nih.gov/nuccore/MN908947", "https://virological.org/t/novel-2019-coronavirus-genome/319", "https://jamanetwork.com/journals/jama/fullarticle/2759815", "https://jamanetwork.com/journals/jama/fullarticle/2759815", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/weeklyprovisionalfiguresondeathsregisteredinenglandandwales", "https://pubmed.ncbi.nlm.nih.gov/9652427/", "https://pmj.bmj.com/content/80/948/560", "https://www.blogger.com/#page=32&zoom=auto,-107,214", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4494247/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4494247/", "https://www.bovinevetonline.com/article/agrilabs-licenses-first-dna-vaccine-chickens", "https://www.immunology.ox.ac.uk/covid-19/covid-19-immunology-literature-reviews/chadox1-ncov-19-vaccination-prevents-sars-cov-2-pneumonia-in-rhesus-macaques", "https://virologyj.biomedcentral.com/articles/10.1186/1743-422X-10-349", "https://www.voanews.com/covid-19-pandemic/australian-religious-leaders-criticize-immoral-covid-19-vaccine-deal", "https://www.astrazeneca.com/media-centre/press-releases/2020/astrazeneca-takes-next-steps-towards-broad-and-equitable-access-to-oxford-universitys-covid-19-vaccine.html", "https://www.astrazeneca.com/content/astraz/media-centre/press-releases/2020/development-of-covid-19-vaccine-azd1222-expands-into-us-phase-iii-clinical-trial-across-all-adult-age-groups.html", "https://www.astrazeneca.com/media-centre/press-releases/2020/covid-19-vaccine-azd1222-showed-robust-immune-responses-in-all-participants-in-phase-i-ii-trial.html", "https://www.nature.com/articles/d41586-020-02594-w", "http://www.isrctn.com/editorial/retrieveFile/960f6bf9-e9e9-420f-b719-9071368f0c06/38245", "https://www.statnews.com/2020/09/08/astrazeneca-covid-19-vaccine-study-put-on-hold-due-to-suspected-adverse-reaction-in-participant-in-the-u-k/", "http://www.isrctn.com/editorial/retrieveFile/d5d41992-c90f-4c8b-97ec-cd85ddfe12fa/38245", "https://clinicaltrials.gov/ct2/show/NCT04516746?term=AZD1222&draw=2&rank=1", "https://clinicaltrials.gov/ct2/show/NCT04540393?term=AZD1222&draw=2&rank=2", "https://www.blogger.com/#t0005", "https://childrenshealthdefense.org/news/another-gates-vaccine-bites-the-dust-sick-monkeys-everywhere/", "https://www.blogger.com/%E2%80%A2%09https:/www.astrazeneca.com/media-centre/articles/2017/astrazeneca-and-medimmune-enter-strategic-collaboration-with-ethris-to-develop-mrna-therapies-for-respirator-diseases-17082017.html", "https://www.astrazeneca.com/what-science-can-do/drug-modalities/modified-rna.html", "https://www.astrazeneca.com/what-science-can-do/drug-modalities/antisense-oligonucleotides.html", "https://www.future-science.com/doi/10.4155/bio-2019-0037", "https://www.covidx.eu/NVX-CoV2373", "https://www.covidx.eu/NVX-CoV2373", "https://www.hhs.gov/about/news/2020/07/07/hhs-dod-collaborate-novavax-produce-millions-covid-19-investigational-vaccine-doses-commercial-scale-manufacturing-demonstration-projects.html", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7079582/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4058772/", "https://www.fool.com/investing/2020/08/02/better-coronavirus-stock-novavax-vs-quidel.aspx", "https://www.markmanadvisors.com/blog/2020/7/21/which-patents-cover-the-covid-19-vaccine-candidates-for-moderna-astrazeneca-jampj-and-novovax", "https://www.pfizer.com/news/press-release/press-release-detail/pfizer-and-biontech-announce-data-preclinical-studies-mrna", "https://biontech.de/how-we-translate/mrna-therapeutics", "https://biontech.de/how-we-translate/mrna-therapeutics", "https://www.pfizer.com/news/press-release/press-release-detail/pfizer-and-biontech-announce-early-positive-data-ongoing-0", "https://www.biopharmadive.com/news/biontech-pfizer-start-phase-3-coronavirus-vaccine-trial/582405/", "https://clinicaltrials.gov/ct2/show/NCT04368728?term=vaccine&cond=covid-19&draw=3", "https://clinicaltrials.gov/ct2/show/NCT04368728?term=vaccine&cond=covid-19&draw=3", "https://www.pfizer.com/news/press-release/press-release-detail/pfizer-and-biontech-announce-early-positive-data-ongoing-0", "https://www.fiercebiotech.com/biotech/pfizer-biontech-quietly-usher-a-5th-covid-19-jab-into-clinic-analyst", "https://trialbulletin.com/lib/trials/spons=Biontech+RNA+Pharmaceuticals+GmbH&spons_ex=Y", "https://www.fiercepharma.com/manufacturing/biontech-buys-novartis-plant-for-covid-19-vaccine-eyes-capacity-up-to-750m-doses", "https://clinicaltrials.gov/ct2/show/NCT01684241", "https://www.businesswire.com/news/home/20190617005320/en/BioNTech-Genmab-Initiate-First-In-Human-Phase-IIIa-Trial", "http://www.pmlive.com/pharma_news/biontech_raises_290m_for_mrna_cancer_vaccine_platform_1294244", "https://biontech.de/science/pipeline", "https://www.sanofi.com/en/media-room/press-releases/2020/2020-04-14-13-00-00", "https://www.gsk.com/en-gb/media/press-releases/sanofi-and-gsk-selected-for-operation-warp-speed-to-supply-united-states-government-with-100-million-doses-of-covid-19-vaccine/", "https://www.medicalcountermeasures.gov/newsroom/2020/psc-sanofi-recombinant/", "https://translate.bio/pipeline/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7159335/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7159335/", "https://www.bioworld.com/articles/350318-curevac-s-prostate-cancer-vaccine-falls-short-in-phase-iib-study", "http://www.processdevelopmentforum.com/articles/can-vaccine-development-be-safely-accelerated/", "https://endpts.com/curevacs-lead-mrna-program-flunks-a-critical-phiib-study-raising-questions-for-high-profile-biotech-unicorns/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4514038/", "http://www.processdevelopmentforum.com/articles/can-vaccine-development-be-safely-accelerated/", "http://www.processdevelopmentforum.com/articles/can-vaccine-development-be-safely-accelerated/", "https://www.who.int/medicines/ebola-treatment/WHO_R-DBlueprintJanssenVaccines.pdf?ua=1", "https://smartlivingshopper.clickfunnels.com/webinar-registrationtp09jgx5", "https://smartlivingshopper.clickfunnels.com/webinar-registrationtp09jgx5", "https://investors.modernatx.com/news-releases/news-release-details/moderna-therapeutics-through-valera-its-infectious-disease", "https://ir.serestherapeutics.com/news-releases/news-release-details/four-boston-biotech-firms-worth-watching", "https://www.sec.gov/Archives/edgar/data/1682852/000119312520049112/d891209dex991.htm", "https://cen.acs.org/business/start-ups/mRNA-disrupt-drug-industry/96/i35", "https://www.vcnewsdaily.com/Moderna%20Therapeutics/venture-funding.php", "https://fortune.com/2015/01/08/the-3-billion-startup-that-wants-to-help-you-to-make-medicines-in-your-own-cells/", "https://www.fiercebiotech.com/special-report/flagship-ventures", "https://investors.modernatx.com/news-releases/news-release-details/moderna-closes-450-million-financing-support-growth-messenger", "https://www.sec.gov/Archives/edgar/data/1682852/000119312520049112/d891209dex991.htm", "https://www.fiercepharma.com/vaccines/once-secretive-moderna-reveals-its-first-human-data-from-avian-flu-vaccine-trial", "https://cen.acs.org/pharmaceuticals/vaccines/Moderna-provides-cursory-glance-first-COVID-19-vaccine-data/98/i20", "https://www.sec.gov/Archives/edgar/data/1682852/000119312520049112/d891209dex991.htm", "https://www.biospace.com/employer/397613/moderna-inc-/", "https://www.pharmalive.com/j-p-morgan-healthcare-conference-2020-roundup-day-4-moderna-berkeley-lights-sanofi-pfizer-and-more/", "https://clinicaltrials.gov/ct2/show/NCT04470427", "https://edition.cnn.com/2020/08/11/health/moderna-vaccine-government-deal/index.html", "https://www.businesswire.com/news/home/20200714006042/en/Moderna-Announces-Publication-New-England-Journal-Medicine", "https://www.marketscreener.com/quote/stock/MODERNA-INC-47437573/news/MODERNA-MANAGEMENT-S-DISCUSSION-AND-ANALYSIS-OF-FINANCIAL-CONDITION-AND-RESULTS-OF-OPERATIONS-for-31073998/", "https://clinicaltrials.gov/ct2/show/NCT04336410", "https://www.frontiersin.org/articles/10.3389/fimmu.2013.00354/full", "https://endpts.com/covid-19-roundup-trump-pushes-untested-malaria-drugs-again-covid-19-positive-british-pm-goes-to-hospital/", "https://www.prnewswire.com/news-releases/inovio-adds-thermo-fisher-scientific-to-global-manufacturing-consortium-301125241.html", "https://www.inovio.com/about-inovio/partnerships/foundations/", "http://www.processdevelopmentforum.com/articles/can-vaccine-development-be-safely-accelerated/", "https://www.insights.bio/immuno-oncology-insights/journal/article/437/recent-advances-in-non-viral-vectors-for-gene-therapy-vaccination", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7079582/", "https://www.fiercepharma.com/vaccines/first-clinical-mers-vaccine-shows-by-inovio-and-geneone-shows-promise-phase-1", "https://clinicaltrials.gov/ct2/show/NCT02670187", "https://www.globenewswire.com/news-release/2018/06/27/1530265/0/en/Inovio-s-MERS-Vaccine-Generates-High-Levels-of-Antibodies-and-Induces-Broad-based-T-Cell-Responses-in-Phase-1-Study.html", "https://www.frontiersin.org/articles/10.3389/fmicb.2019.00569/full", "https://clarivate.com/wp-content/uploads/dlm_uploads/2020/01/CORONAVIRUS-REPORT-1.30.2020.pdf", "https://www.blogger.com/%E2%80%A2%09https:/www.streetwisereports.com/article/2019/12/23/coverage-initiated-on-immunotherapies-developer-with-catalyst-rich-2020.html", "https://www.inovio.com/dna-medicines-pipeline/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7185789/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7079582/", "https://www.inovio.com/dna-medicines-technology/", "https://www.inovio.com/dna-medicines-pipeline/", "http://ir.inovio.com/news-releases/news-releases-details/2020/INOVIO-Receives-71-Million-Contract-From-US-Department-of-Defense-To-Scale-Up-Manufacture-of-CELLECTRA-3PSP-Smart-Device-and-Procurement-of-CELLECTRA-2000-for-COVID-19-DNA-Vaccine/default.aspx", "https://www.nature.com/articles/s41467-020-16505-0.pdf", "https://www.fool.com/investing/2020/05/05/is-inovio-pharmaceuticals-a-buy.aspx", "https://www.activistpost.com/2020/09/we-need-to-talk-about-proteins-the-ronascam-the-vaccines-and-genetic-patents.html", "https://www.activistpost.com/2020/09/ronavax-rundown.html", "https://www.activistpost.com/2020/11/ronavax-roulette-no-cure-no-control-the-risks-of-genetic-vaccines.html", "https://www.drugdiscoverytrends.com/novel-dna-vaccine-design-offers-broad-protection-against-influenza-a-h3n2/", "https://www.patreon.com/bePatron?u=5719077", "https://www.activistpost.com/survive-job-automation-apocalypse", "https://www.activistpost.com/support", "https://somee.social/profile/activist-post/timeline", "https://hive.blog/@activistpost", "https://parler.com/profile/ActivistPost/posts", "https://flote.app/ActivistPost", "https://www.minds.com/ActivistPost", "https://www.twitter.com/ActivistPost", "http://countermarkets.com/"], "authors": ["Activist Post"], "publish_date": "2020-09-27T03:00:56+00:00"}