{"result_id": "009020", "URL": "https://www.activistpost.com/2021/05/american-public-schools-hold-events-to-convince-students-to-take-covid-shot-encourage-friends-to-get-vaxxed.html", "timestamp": "2023-04-25 11:47:11 CEST+0200", "meta": {"description": "Vaccine side effects, injuries, deaths have been ongoing among adults and children for decades, but the push only increases.", "lang": "en", "keywords": "", "favicon": "https://www.activistpost.com/wp-content/uploads/2018/04/cropped-icon-32x32.jpg", "canonical": "https://www.activistpost.com/2021/05/american-public-schools-hold-events-to-convince-students-to-take-covid-shot-encourage-friends-to-get-vaxxed.html", "encoding": "UTF-8"}, "image": null, "domain": "www.activistpost.com", "title": "American Public Schools Hold Events to Convince Students to Take COVID Shot, Encourage Friends to Get Vaxxed", "cleaned_text": "Vaccine side effects, injuries, deaths have been ongoing among adults and children for decades (see 1, 2, 3). They continue to be reported about all COVID vaccines as well, including by celebrity recipients (see 1, 2). Nevertheless, every day there seems to be some kind of new gimmick introduced to convince hesitant Americans to “take the shot”.\n\nVaccine lotteries are being held in 4 states. Businesses continue to offer freebies to customers who show proof of inoculation. Schools are also getting in on the action to persuade kids ages 12 and up to “roll up their sleeves”.\n\nSchools Try Pep-Rally Tactics to Get Students Vaccinated + More\n\nSchools Try Pep-Rally Tactics to Get Students Vaccinated\n\nA growing number of public schools are using mascots, food trucks and prize giveaways to create a pep-rally atmosphere aimed at encouraging students to get vaccinated against the coronavirus before summer vacation.\n\nDistricts from California to Michigan are offering free prom tickets and deploying mobile vaccination teams to schools to inoculate students 12 and up so everyone can return to classrooms in the fall. They are also enlisting students who have gotten shots to press their friends to do the same.\n\nUnited Airlines is offering vaccinated customers a shot at winning free travel as the carrier joins a national effort to get more Americans immunized against COVID-19 and derail a pandemic behind the deaths of nearly 590,000 Americans.\n\n“We’re proud to do our part to incentivize people to get their shot,” United CEO Scott Kirby stated in a news release. “Thanks to the vaccine, more and more destinations are opening up for travel — and we know our customers are eager to fly.”\n\n18 Connecticut Teens Hospitalized for Heart Problems After COVID Vaccines, White House Says Young People Should Still Get the Shots\n\nOne week after the Centers for Disease Control and Prevention (CDC) announced it was investigating heart inflammation in recently vaccinated young adults, Connecticut reported 18 new cases of heart problems among teens who had received a COVID vaccine.\n\nAll 18 cases resulted in hospitalization — the vast majority for a couple of days, reported NBC Connecticut. The cases were reported to the Connecticut Department of Public Health by vaccine providers, said Deirdre Gifford, acting health commissioner.\n\nBefore COVID Vaccine, Her Son Was a Healthy Athlete — Now He Can ‘Barely Walk,’ Mom Says\n\nOne day after getting the Pfizer-BioNTech COVID vaccine, Everest Romney became sick. Five days after being vaccinated, the 17-year-old was hospitalized when doctors discovered two blood clots in his brain.\n\nEverest’s mother, Cherie Romney, told Children’s Health Defense Chairman Robert F. Kennedy, Jr. on the “RFK Jr. The Defender Podcast” her son, a varsity basketball player at Corner Canyon High School in Draper, Utah, was a very healthy athletic child who was in the middle of recruiting season for his school basketball team.\n\nNow, the teen can barely walk.\n\nNumber of Kids Hospitalized for COVID Inflated by at Least 40%, New Research Suggests\n\nThe reported number of COVID hospitalizations — one of the primary metrics for tracking the severity of the COVID pandemic — was grossly inflated for children in California hospitals, according to two research papers published May 19.\n\nBoth papers, published in the journal of Hospital Pediatrics, found pediatric hospitalizations for COVID were overcounted by at least 40%, carrying potential implications for nationwide figures used to justify vaccinating children.\n\nZogby Poll: 38% of Americans ‘Infuriated’ After Fauci Admits Nearly Half of NIH Staff Refused Vaccine\n\nA new nationwide online poll conducted by Zogby Strategies in conjunction with Children’s Health Defense (CHD) shows an increasing number of Americans are “infuriated” after learning only about 60% of employees at the National Institutes of Health (NIH) have been vaccinated for COVID.\n\nIn a U.S. Senate hearing last week, Dr. Anthony Fauci said a little more than half to 60% of NIH employees had received the COVID-19 vaccine. Dr. Peter Marks confirmed a similar percentage of employees at the U.S. Food and Drug Administration had been vaccinated.\n\nExperts Say Those Who Are Not Inoculated Against COVID-19 Shouldn’t Rely on Protection From Those Who Are\n\nThe U.S. is hitting major COVID-19 vaccination milestones, but health experts say those who are not inoculated should not rely on protection from those who are, as their infection risk hasn’t gone down in response to declining cases.\n\n“The work ahead of us Is going to be really challenging because while the people who are fully vaccinated are well protected, we still have to keep on convincing individuals who are not yet vaccinated that they are not safe,” CNN medical analyst Leana Wen told Wolf Blitzer. “The pandemic is not over for them.”\n\nResistance to Vaccine Mandates Is Building. A Powerful Network Is Helping.\n\nThe Americans lodging complaints against coronavirus vaccine mandates are a diverse lot — a sheriff’s deputy in North Carolina, nursing home employees in Wisconsin and students at the largest university in New Jersey.\n\nBut their resistance is woven together by a common thread: the involvement of a law firm closely tied to the anti-vaccine movement.\n\nAttorneys from Siri & Glimstad — a New York firm that has done millions of dollars of legal work for one of the nation’s foremost anti-vaccination groups — are co-counsel in a case against the Durham County Sheriff’s Office. They’ve sent warning letters to officials in Rock County, Wis., as well as to the president of Rutgers University and other schools.\n\nHalf of U.S. Adults Are Now Fully Vaccinated, CDC Says\n\nHalf of adult Americans have received all of their COVID-19 vaccine doses, according to figures published Tuesday by the CDC. The figures mark what Biden administration officials are touting as a key sign of progress in the country’s immunization campaign.\n\n“This is a major milestone in our country’s vaccination efforts. The number was 1% when we entered office January 20th,” White House senior adviser Andy Slavitt told reporters at a press briefing on Tuesday.\n\nThe milestone also comes as the nationwide nationwide pace of people receiving their first dose has slowly picked up, after plummeting to a record low last month not seen since the earliest weeks of the COVID-19 vaccination effort in January.\n\nAmid the Centers for Disease Control and Prevention’s (CDC) updated mask guidance and new information coming to light about the origins of COVID-19, experts and Americans alike are questioning the credibility of those calling the shots throughout the pandemic — including the high-profile Dr. Anthony Fauci.\n\n“The agency [CDC] has lost all credibility,” Dr. Marty Makary, Fox News medical contributor and professor of health policy and management at Johns Hopkins University School of Public Health, said. “They have been consistently delinquent, misrepresenting COVID risk levels. The public sees through the CDC’s flawed guidance on schools, travel and summer camps that use the guise of science. That’s why 52% of Americans no longer trust the CDC.”\n\nCan Teens Get Vaccinated if Their Parents Object?\n\nMost states require a parent’s or legal guardian’s consent for anyone under 18 to get a vaccine, including the COVID-19 shot. So what happens when a teen wants the vaccine but their parents won’t allow it? And when should a minor have the right to get any recommended vaccines their parents oppose?\n\nThe first answer depends on the state. But the second raises a host of thorny issues at the intersection of bioethics, the law, individual risk of disease, public health, and community responsibility. And it’s an issue that potentially millions of teens may face.\n\nThis Is Why Vaccine Lottery Prizes May Work for Some, According to Psychology Experts\n\nMaryland drew a winner for its first $40,000 vaccine lottery prize Tuesday, kicking off 40 days of drawings meant to encourage state residents to get the COVID-19 vaccine.\n\nThe campaign, called VaxCash, will automatically enter vaccinated Marylanders into daily $40,000 lotteries from May 25 until July 4, when a $400,000 prize will be randomly awarded. To be eligible, residents must have received the vaccine in the state and be 18 years old or older.\n\nModerna to Seek Authorization for Use of Its COVID-19 Vaccine in Adolescents\n\nHalf of all U.S. adults are now fully vaccinated against the coronavirus and millions of adolescents may be next. As Mola Lenghi reports, Moderna will soon seek approval for its vaccine in children ages 12 to 17. Then, Dr. Sejal Hathi, a physician and clinical fellow at Massachusetts General Hospital and the host of the Civic RX podcast, joins CBSN’s Elaine Quijano to discuss the latest.\n\nTeens Experience Side Effects After Pfizer’s Shot Slightly More Than Adults Do. A Chart Shows the Most Common.\n\nDuring the initial week of Pfizer’s vaccine rollout for 12- to 15-year-olds, roughly 600,000 adolescents received their first shots.\n\nScientists expected the vaccine to be effective in young people even before trial results were released – our immune systems get weaker with age, so children and adolescents typically develop strong protection from vaccines. Indeed, Pfizer’s clinical trials showed that the vaccine was 100% effective among 12- to 15-year-olds: Out of more 1,100 adolescents who received the shot, none developed COVID-19.\n\nModerna, meanwhile, announced on Tuesday that its vaccine was also found to be 100% effective among 12- to 15-year-olds in clinical trials. The immune responses among adolescents appeared comparable to that in adults.\n\nBut adolescents seem to develop side effects more frequently after Pfizer’s shot than adults. That’s likely because kids’ immune systems do an excellent job of revving up quickly.\n\nBecome a Patron!\n\n Or support us at SubscribeStar\n\n Donate cryptocurrency HERE\n\nSubscribe to Activist Post for truth, peace, and freedom news. Follow us on Telegram, SoMee, HIVE, Flote, Minds, MeWe, Twitter, Gab, Ruqqus and What Really Happened.\n\n\n\nProvide, Protect and Profit from what’s coming! Get a free issue of Counter Markets today.", "opengraph": {"locale": "en_US", "type": "article", "title": "American Public Schools Hold Events to Convince Students to Take COVID Shot, Encourage Friends to Get Vaxxed - Activist Post", "description": "Vaccine side effects, injuries, deaths have been ongoing among adults and children for decades, but the push only increases.", "url": "https://www.activistpost.com/2021/05/american-public-schools-hold-events-to-convince-students-to-take-covid-shot-encourage-friends-to-get-vaxxed.html", "site_name": "Activist Post", "article:publisher": "http://www.facebook.com/activistpost", "article:published_time": "2021-05-29T01:05:42+00:00", "image": "https://www.activistpost.com/wp-content/uploads/2021/05/school-bus-pix.jpg", "image:width": "1269", "image:height": "770", "image:type": "image/jpeg"}, "tags": ["Vaccines", "Child health", "BN Frank", "School"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "777", "height": "437", "embed_code": "<iframe loading=\"lazy\" title=\"Schools try pep-rally tactics to get students vaccinated\" width=\"777\" height=\"437\" src=\"https://www.youtube.com/embed/OcUHKeun24A?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/OcUHKeun24A?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "777", "height": "437", "embed_code": "<iframe loading=\"lazy\" title=\"States announce lotteries for vaccinated residents l GMA\" width=\"777\" height=\"437\" src=\"https://www.youtube.com/embed/MhwqL8MDDYM?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/MhwqL8MDDYM?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "777", "height": "583", "embed_code": "<iframe loading=\"lazy\" title=\"Deja Vu: The Swine Flu Vaccination Fraud of 1976\" width=\"777\" height=\"583\" src=\"https://www.youtube.com/embed/f1jV3tJ2Lqw?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/f1jV3tJ2Lqw?feature=oembed"}], "links": ["https://www.activistpost.com/wp-content/uploads/2021/05/school-bus-pix.jpg", "https://www.activistpost.com/tag/bn-frank", "https://www.activistpost.com/2020/04/cbs-the-swine-flu-fraud-of-76-covers-u-s-govt-vax-campaign-and-lawsuits-by-vaccine-injured-americans.html", "https://www.activistpost.com/2020/07/smithsonian-magazine-reports-about-u-s-govt-swine-flu-vaccine-that-injured-thousands-in-1976.html", "https://www.activistpost.com/2020/07/1986-the-act-exposes-u-s-congressional-act-that-made-drug-companies-not-liable-when-vaccines-hurt-kids.html", "https://childrenshealthdefense.org/defender_category/covid", "https://www.rollingstone.com/music/music-news/eric-clapton-disastrous-vaccine-propaganda-1170264/", "https://www.thegatewaypundit.com/2021/03/ben-stein-issues-warning-suffers-severe-side-effects-covid-vaccine-days-getting-shot-video/", "https://www.activistpost.com/2021/05/american-vaccine-lotteries-now-in-3-states.html", "https://www.activistpost.com/2021/03/vaccine-marketing-u-s-businesses-offering-freebies-to-vax-recipients-despite-ongoing-reports-about-side-effects.html", "https://childrenshealthdefense.org/defender/schools-try-pep-rally-tactics-to-get-students-vaccinated/?utm_source=salsa&eType=EmailBlastContent&eId=a2379038-53a9-4f82-827e-2ce29d293daa", "https://www.foxnews.com/health/schools-pep-rally-tactics-students-covid-19-vaccinated", "https://childrenshealthdefense.org/defender/ohio-offers-college-scholarships-entice-people-get-vaccinated/", "https://www.foxnews.com/category/health/infectious-disease/vaccines", "https://childrenshealthdefense.org/defender_category/covid/", "https://www.msn.com/en-us/travel/news/united-airlines-offers-vaccinated-shots-at-free-travel/ar-AAKkzRx?ocid=hplocalnews", "https://www.cbsnews.com/feature/coronavirus/?ftag=MSFd61514f", "https://coronavirus.jhu.edu/map.html?ftag=MSFd61514f", "https://childrenshealthdefense.org/defender_category/covid/", "https://childrenshealthdefense.org/defender/18-connecticut-teens-hospitalized-heart-problems-covid-vaccines/", "https://childrenshealthdefense.org/defender/cdc-investigating-reports-heart-problems-teens-adolescents-covid-vaccine/", "https://patch.com/connecticut/weston-ct/18-ct-teens-report-heart-problems-after-coronavirus-vaccine", "https://www.nbcconnecticut.com/news/coronavirus/connecticut-confirms-at-least-18-cases-of-apparent-heart-problems-in-young-people-after-covid-19-vaccination/2494534/", "https://portal.ct.gov/DPH", "https://childrenshealthdefense.org/defender/rfk-jr-the-defender-podcast-cherie-romney-17-year-old-pfizer-vaccine-blood-clots/", "https://childrenshealthdefense.org/defender/teen-hospitalized-brain-blood-clots-after-pfizer-vaccine/", "https://ksltv.com/461827/teen-hospitalized-with-rare-blood-clotting/?", "https://childrenshealthdefense.org/", "https://anchor.fm/rfkjr", "https://childrenshealthdefense.org/defender/number-kids-hospitalized-covid-grossly-inflated/", "https://nymag.com/intelligencer/2021/05/study-number-of-kids-hospitalized-for-covid-is-overcounted.html", "https://childrenshealthdefense.org/defender_category/covid/", "https://childrenshealthdefense.org/defender/warnings-vaccinating-kids-covid-dangerous-gamble/", "https://childrenshealthdefense.org/defender/zogby-poll-fauci-admits-nih-staff-refused-vaccine/", "https://johnzogbystrategies.com/wp-content/uploads/2021/05/X-COVID-052021.pdf", "https://childrenshealthdefense.org/", "https://www.c-span.org/video/?c4963284/user-clip-fauci-admits-50-60-cdc-nih-employees-vaccinated", "https://childrenshealthdefense.org/defender/truth-rfk-jr-david-martin-fauci-moderna-vaccine/", "https://childrenshealthdefense.org/defender_category/covid/", "https://www.cnn.com/2021/05/26/health/us-coronavirus-wednesday/index.html?fbclid=IwAR3XXYDW5Hk5qSkXBFXMkT_quWstxPfLssI2BNiV_mRDrBuBODo44iNCr20", "http://www.cnn.com/world/live-news/coronavirus-pandemic-vaccine-updates-05-25-21/index.html", "http://www.cnn.com/2021/05/24/health/us-coronavirus-monday/index.html", "https://childrenshealthdefense.org/defender_category/covid/", "https://www.washingtonpost.com/health/2021/05/26/vaccine-mandate-litigation-siri-glimstad-ican/", "https://www.washingtonpost.com/coronavirus/?itid=lk_inline_manual_2", "https://childrenshealthdefense.org/defender/vaccine-mandates-an-erosion-of-civil-rights-chd-e-book-available-now/", "https://www.cbsnews.com/news/covid-19-vaccine-half-american-adults/?fbclid=IwAR384oxAUQmPDAUJNPeg6xD1IhqauX8wtA4mfU6te371JZFVrypPpxvLHpk", "https://childrenshealthdefense.org/defender_category/covid/", "https://covid.cdc.gov/covid-data-tracker/#vaccinations", "https://covid.cdc.gov/covid-data-tracker/#vaccination-trends", "https://www.foxnews.com/health/lawmakers-fauci-resignation-firing-immediately-covid-flip-flops?fbclid=IwAR2shM8fNByMPvTJ7boYCeDfaHX3AB0n7z6inpA3Ze43Yor-Pp-uQCcdtdw", "https://www.foxnews.com/health/former-cdc-head-kids-covid-19-vaccinations-rare-heart-issues", "https://www.foxnews.com/politics/house-intel-republicans-say-significant-circumstantial-evidence-of-covid-wuhan-lab-leak", "https://childrenshealthdefense.org/defender_category/covid/", "https://www.foxnews.com/health/covid-warnings-public-health-experts-dr-marty-makary", "https://childrenshealthdefense.org/defender/truth-rfk-jr-david-martin-fauci-moderna-vaccine/", "https://www.foxnews.com/person/m/dr-marty-makary-m-d-m-p-h", "https://www.foxnews.com/us/teachers-union-randi-weingarten-biden-cdc-language", "https://www.nationalgeographic.com/science/article/can-teens-get-vaccinated-if-their-parents-object", "https://childrenshealthdefense.org/defender_category/covid/", "https://abcnews.go.com/Health/vaccine-lottery-prizes-work-psychology-experts/story?id=77891540", "https://smartlivingshopper.clickfunnels.com/webinar-registrationtp09jgx5", "https://smartlivingshopper.clickfunnels.com/webinar-registrationtp09jgx5", "https://abcnews.go.com/alerts/lottery", "https://abcnews.go.com/health/coronavirus", "https://www.mdlottery.com/promotion/2-million-vaxcash-promotion/", "https://childrenshealthdefense.org/defender_category/covid/", "https://www.cbsnews.com/video/moderna-to-seek-authorization-for-use-of-its-covid-19-vaccine-in-adolescents/", "https://childrenshealthdefense.org/defender_category/covid/", "https://childrenshealthdefense.org/defender/pfizer-moderna-vaccines-life-threatening-blood-disorder/", "https://www.msn.com/en-us/health/medical/teens-experience-side-effects-after-pfizers-shot-slightly-more-than-adults-do-a-chart-shows-the-most-common/ar-BB1gUDdW?ocid=uxbndlbing", "https://childrenshealthdefense.org/defender/pfizer-vaccine-higher-risk-covid-variants/", "https://www.businessinsider.com/children-weaker-antibody-response-coronavirus-milder-cases-study-2020-11", "https://www.pfizer.com/news/press-release/press-release-detail/pfizer-biontech-announce-positive-topline-results-pivotal", "https://childrenshealthdefense.org/defender_category/covid/", "https://www.businessinsider.com/moderna-covid-19-vaccine-succeeds-in-teens-study-2021-5", "http://www.pixabay.com", "https://www.patreon.com/bePatron?u=5719077", "https://www.subscribestar.com/activist-post", "https://www.activistpost.com/support", "https://www.activistpost.com/survive-job-automation-apocalypse", "https://t.me/activistpost", "https://somee.social/profile/activist-post/timeline", "https://hive.blog/@activistpost", "https://flote.app/ActivistPost", "https://www.minds.com/ActivistPost", "https://mewe.com/i/activistpost", "https://twitter.com/ActivistPost", "https://gab.com/activist", "https://ruqqus.com/@ActivistPost", "https://www.whatreallyhappened.com/?q=users/activistpost", "http://countermarkets.com/"], "authors": ["Activist Post"], "publish_date": "2021-05-29T01:05:42+00:00"}