{"result_id": "009013", "URL": "https://www.activistpost.com/2022/01/czech-republic-abolishes-plan-to-mandate-covid-19-vaccines.html", "timestamp": "2023-04-25 11:47:07 CEST+0200", "meta": {"description": "\"We do not want to deepen fissures in society,\" Fiala said.", "lang": "en", "keywords": "", "favicon": "https://www.activistpost.com/wp-content/uploads/2018/04/cropped-icon-32x32.jpg", "canonical": "https://www.activistpost.com/2022/01/czech-republic-abolishes-plan-to-mandate-covid-19-vaccines.html", "encoding": "UTF-8"}, "image": null, "domain": "www.activistpost.com", "title": "Czech Republic Abolishes Plan To Mandate COVID-19 Vaccines", "cleaned_text": "By Isabel van Brugen via The Epoch Times (emphasis ZeroHedge)\n\nThe new Czech government on Wednesday threw out the previous administration’s plan to mandate COVID-19 vaccines for over-60s and people in key professions.\n\nUnder the former government, older adults, health care workers, firefighters, police officers and medical students would have been required to be vaccinated against COVID-19, effective March.\n\nBut Prime Minister Petr Fiala scrapped his predecessor Andrej Babis’s decree, which was issued in early December. He told reporters Wednesday that his new center-right government did not see the need for mandatory vaccination.\n\n“We’ve agreed that vaccination against COVID-19 won’t be mandatory,” Fiala said. ”This does not change our stance on vaccination. It is still undoubtedly the best way to fight COVID-19 … however, we do not want to deepen fissures in society.”\n\nOpponents of a vaccine mandate had staged several protests in Prague and elsewhere in the country.\n\nSo far, 62.9 percent of Czechs are considered fully vaccinated, below the European Union average, according to the European Center for Disease Prevention and Control. Almost 3.4 million people in the nation of 10.5 million also have received a booster shot.\n\nFiala said about 90 percent of people who would have been covered by the mandate have already received vaccines.\n\nThe new government’s decision came as the Czech Republic is facing a surge in COVID-19 infections largely fueled by the highly contagious Omicron variant of the novel coronavirus.\n\nThe seven-day infection rate was 950 new cases per 100,000 residents on Tuesday compared to 799 a day earlier.\n\nDespite the record numbers, the number of COVID-19 patients in hospitals dropped to 1,635 on Tuesday with 252 needing intensive care.\n\nResearchers and health experts are hopeful that the Omicron variant, while highly transmissible, is less severe, and poses milder symptoms in infected people, compared with other strains such as the Delta variant.\n\nElsewhere, in Austria residents are set to be fined if they flout a COVID-19 vaccine mandate the country is aiming to introduce in February for all residents aged 14 and over.\n\nLast month, Austria’s health minister announced that those who flout the vaccine mandate will face fines of up to 3,600 euros (around $4,000).\n\nAnd in Greece, a vaccination mandate has been imposed on all over-60s. Those who refuse to be vaccinated will be fined by the government, health minister Thanos Plevris said. Fines start this month at 50 euros ($57), followed by a monthly fine of 100 euros ($114).\n\nPlevris said the penalties would be collected through the tax office and used to fund state hospitals.\n\nThe Associated Press contributed to this report.\n\nBecome a Patron!\n\n Or support us at SubscribeStar\n\n Donate cryptocurrency HERE\n\nSubscribe to Activist Post for truth, peace, and freedom news. Follow us on Telegram, HIVE, Flote, Minds, MeWe, Twitter, Gab, What Really Happened and GETTR.\n\n\n\nProvide, Protect and Profit from what’s coming! Get a free issue of Counter Markets today.", "opengraph": {"locale": "en_US", "type": "article", "title": "Czech Republic Abolishes Plan To Mandate COVID-19 Vaccines - Activist Post", "description": "\"We do not want to deepen fissures in society,\" Fiala said.", "url": "https://www.activistpost.com/2022/01/czech-republic-abolishes-plan-to-mandate-covid-19-vaccines.html", "site_name": "Activist Post", "article:publisher": "http://www.facebook.com/activistpost", "article:published_time": "2022-01-21T14:36:14+00:00", "image": "https://www.activistpost.com/wp-content/uploads/2017/05/mandatory-vaccines.jpg", "image:width": "800", "image:height": "530", "image:type": "image/jpeg"}, "tags": ["Isabel van Brugen", "Europe", "Mandatory vaccines"], "tweets": [], "movies": [], "links": ["https://www.activistpost.com/wp-content/uploads/2017/05/mandatory-vaccines.jpg", "https://www.theepochtimes.com/czech-republic-abolishes-plan-to-mandate-covid-19-vaccines_4224817.html?utm_source=partner&utm_campaign=ZeroHedge", "https://www.theepochtimes.com/t-covid-19-vaccine-mandate", "https://smartlivingshopper.clickfunnels.com/webinar-registrationtp09jgx5", "https://smartlivingshopper.clickfunnels.com/webinar-registrationtp09jgx5", "https://www.theepochtimes.com/author-isabel-van-brugen", "https://www.zerohedge.com/covid-19/czech-republic-abolishes-plan-mandate-covid-19-vaccines", "https://www.patreon.com/bePatron?u=5719077", "https://www.subscribestar.com/activist-post", "https://www.activistpost.com/support", "https://www.activistpost.com/survive-job-automation-apocalypse", "https://t.me/activistpost", "https://hive.blog/@activistpost", "https://flote.app/ActivistPost", "https://www.minds.com/ActivistPost", "https://mewe.com/i/activistpost", "https://twitter.com/ActivistPost", "https://gab.com/activist", "https://www.whatreallyhappened.com/?q=users/activistpost", "https://gettr.com/user/activistpost", "http://countermarkets.com/"], "authors": ["Activist Post"], "publish_date": "2022-01-21T14:36:14+00:00"}