{"result_id": "010003", "URL": "https://www.actualized.org/insights/got-my-covid-vaccine-part-2", "timestamp": "2023-04-25 11:50:53 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://www.actualized.org/articles/got-my-covid-vaccine-part-2", "encoding": "utf-8"}, "image": null, "domain": "www.actualized.org", "title": "Got My Covid Vaccine - Part 2", "cleaned_text": "So, I got the second dose of the Pfizer Covid vaccine. I’m now fully vaccinated and I wanted to share my direct experiences of it, for those of you who are hesitant or cynical.\n\nThe only side-effect I got from the first dose was a sore arm for a few days.\n\nThe only side-effect I got from the second dose was a sore arm for a few days and 1 day of fatigue where I slept longer than usual. I needed about 12 hours of sleep that day. But I had zero flu-like symptoms. Just fatigue. It lifted on the 2nd day.\n\nAside from that, there is no difference in how I feel or my level of consciousness. In fact, I’ve been feeling more conscious, clear-headed, inspired, and energetic than usual lately. So those who sow seeds of doubt that this vaccine will somehow interfere with your spirituality or your consciousness are talking out of their ass. If anything will interfere with your spiritual work, it’s catching Covid unimmunized.\n\nSo at least from my direct experience the vaccine is harmless. Of course some people may still experience stronger side-effects. But the side-effects of Covid itself are way worse and more common.\n\nDon’t let ignorant people fear-monger you. Get your vaccine today.\n\nClick Here to see ALL of Leo's juicy insights.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://pinterest.com/pin/create/button/?url=https%3A//www.actualized.org/insights/got-my-covid-vaccine-part-2&media=", "mailto:?subject=&body=Check this out: %0A%0A https://www.actualized.org/insights/got-my-covid-vaccine-part-2 %0A", "/insights"], "authors": [], "publish_date": null}