{"result_id": "010005", "URL": "https://www.actualized.org/insights/pbd-vs-neil-degrasse-tyson", "timestamp": "2023-04-25 11:50:57 CEST+0200", "meta": {"description": "", "lang": "de", "keywords": "", "favicon": "", "canonical": "http://www.actualized.org/articles/pbd-vs-neil-degrasse-tyson", "encoding": "utf-8"}, "image": null, "domain": "www.actualized.org", "title": "PBD vs Neil deGrasse Tyson", "cleaned_text": "I am no fan of Neil deGrasse Tyson’s materialistic notions of science, but he does a great job trying to reason with PBD in the following conversation. What’s disturbing is that in the comment section, most of the audience thought PBD wiped the floor with Tyson when the opposite is the case. That comment section is seriously disturbing and shows you the power of fandom, group-think, and online echochambers.\n\nThe government wasn’t wrong about Covid. The government saved millions of lives, but people are too brainwashed with anti-mainstreamism to understand this. As much as I criticize science, my criticisms of science are from above, and what you see on display in this video is criticism of science from below. Anti-vax is criticism of science from below, and it is dangerously wrong. If guys like PBD were in charge of public health, millions of people would be dead. Which is why, yes, we talk down to the masses, because the masses are too ignorant to do proper risk analysis for themselves. Talking down to the masses is not a mistake, it is not “elitism”, it is a natural consequence of mass ignorance. Your average business/YouTube bro is incapable of doing public health risk analysis. We live in an era were average people on social media — especially if they have a million subs — think they are smarter than experts with PhD’s. Don’t kid yourself. Your typical social media influencer is an idiot, and the more subscribers he has the bigger idiot he is. I will take a materialist scientist over a social media influencer or businessman any day.\n\nDoes it surprise you that I defend science? It shouldn’t. Most humans have a lot of growing to do just to reach the point of appreciating basic science, never mind transcending it. All the crazy spiritual shit I say does not for one minute undermine the relative validity of basic scientific research. God exists and medical science is good. There is nothing contradictory about that statement. Of course medical science is still missing many things, but that doesn’t invalidate the whole field. And as imaginary as death is, you still don’t want to end up with Covid in a hospital that’s all out of beds and ventilators because millions just like you thought they were too cool for school.\n\nCovid is not a serious political issue in America. Overall the American government’s response was good, excluding Trump’s early denial efforts, the lack of funding for basic pandemic preparedness, and the reaction of the ignorant masses with their conspiracy theories. There was no government failure with the Covid response, there was failure with the masses of people and the non-mainstream media who fed into their deluded skepticism. The people who cry that Covid is politicized are actually the ones politicizing it! This is gaslighting 101. The science on the vaccines was clear and accurate. Those who claim otherwise are the ones politicizing it because they need to justify their twisted anti-mainstream worldview. I swear, this anti-mainstreamism has become a disease in its own right. Railing against the mainstream does not make you intelligent. That’s fool’s gold.\n\nWhen you live in a society you have a responsibility to get vaccinated for potentially serious diseases in the same way that you have a responsibility to fight in war if you are invaded by Nazis. If you cannot understand this, you fundamentally do not understand what society is, and your politics are trash. Covid killed more Americans than Nazis killed Americans in WW2. And yet, people like PBD and Joe Rogan are crying about not being able to eat at his fave restaurant for a few months. Where is the manliness in this? Imagine if in WW2 I had a radio show and I said that fighting the Nazis was an infringement on my right to dine at The Cheesecake Factory. That’s effectively what anti-vaxxers did with Covid, and it is deeply unpatriotic, irresponsible, and cowardly. Anti-vax isn’t just unscientific, it is cowardice unbefitting of a man. What kind of man are you that you cannot deal with a few months of lock down and mask-wearing? People whined less when there was a draft.\n\nSide-effects from a vaccine are NOT a valid excuse not to take it, just like side-effects from war are not a valid excuse not to defend your country when it is under attack. When I took antibiotics 2 years ago for an infection, I had a really negative reaction with bad side-effects. But I did not blame my doctor or Big Pharma, I knew there were risks. You rarely get a cure to a health problem risk-free. Yes, of course there are costs to handling a pandemic. Some people will die in that battle, never mind inconvenienced. The federal government has a responsibility to pass policy that protects 350 million people, many of whom are sick, old, fat, poor, and dumb as doorknobs.\n\nAmericans have become spoiled, selfish children. It is the height of ignorance for PBD to suggest that freedom of choice is somehow “American” while vaccine mandates are not. George Washington mandated everyone in the US Army to get vaccinated. That’s a historical fact. So vaccine mandates are as American as apple pie. So any right-winger trying to claim the mantle of patriotism or “Americanism” on this point is full of shit. If you really wanna stick it to a right-winger, show him how his politics are anti-American — in many cases it is. It’s not so easy to be truly American. Wearing a red hat isn’t it. Just like with religion, there is genuine spirituality and then there is religious fakery and virtue-signaling. So it is with patriotism. The genuine thing is rare and those who cry the loudest about being “American” are not. If you want to be truly American, do that which will save a million American lives at very little risk to yourself. If you got vaccinated, congrats! You are a true patriot. Thank you for your service. Thank you for saving a hospital bed for someone else who really needed it. Thank you for not politicizing a global emergency by acting like a spoiled crybaby. Thank you for wearing your mask quietly like a mature adult. These are the natural sacrifices of living in a community which allow us to have nice things.\n\nIt is time for the left-wing to recapture the language and ethos of patriotism. The right-wing has bastardized it long enough. If you don’t care about paying your taxes to ensure that people don’t go hungry, homeless, uneducated, and sick, you are not a true patriot, and no size arsenal of firearms will make you one. Buying a gun is easy, sacrificing some of your personal comfort to assist people who are less fortunate than you is hard.\n\nWhat the right-wing got wrong on Covid is very simple: A pandemic is not about you. But you took it as such. Sorry to break the news, but your petty freedoms — like the freedom to walk your dog wherever you please — are not our highest priority. This is not a bug, it’s a feature. A virus is fundamentally different from all other personal risks in that it rapidly spreads and destroys the whole community. Therefore it requires a collective lens to address, not an individualistic one. In this respect a virus is most similar to war and requires a war-like collective mobilization. If this virus was something more serious than a flu, the loss of life from our lack of a cohesive, collective response would have been staggering, worse than the Holocaust. Not because the government failed, but because the people failed to listen to the government. When you fail to mount a cohesive response in war, the result is conquest by your enemy. Which is why in the military you don’t get to eat at The Cheesecake Factory. And if you whine about it, they will mock and beat you.", "opengraph": {}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "655", "height": "367", "embed_code": "<iframe src=\"https://www.youtube.com/embed/CquiSjgJNc8?rel=0&amp;vq=hd720\" width=\"655\" height=\"367\" allowfullscreen=\"\" frameborder=\"0\"></iframe>", "src": "https://www.youtube.com/embed/CquiSjgJNc8?rel=0&vq=hd720"}], "links": ["https://pinterest.com/pin/create/button/?url=https%3A//www.actualized.org/insights/pbd-vs-neil-degrasse-tyson&media=", "mailto:?subject=&body=Check this out: %0A%0A https://www.actualized.org/insights/pbd-vs-neil-degrasse-tyson %0A", "/insights"], "authors": [], "publish_date": null}