{"result_id": "011010", "URL": "https://www.additudemag.com/non-stimulant-adhd-medication/", "timestamp": "2023-04-25 11:55:04 CEST+0200", "meta": {"description": "Non-stimulant ADHD medications come in many varieties: FDA-approved non-stimulants, antidepressants, blood pressure medications, and more. These are second-line treatment options for ADHD patients who don’t respond to stimulant medication, or experience too many side effects.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.additudemag.com/wp-content/uploads/2020/02/cropped-additude-favicon-512x512-1.png?resize=480%2C270px&ssl=1", "canonical": "https://www.additudemag.com/non-stimulant-adhd-medication/", "encoding": "UTF-8"}, "image": null, "domain": "www.additudemag.com", "title": "Non-Stimulant ADHD Medication Overview", "cleaned_text": "ADHD clinicians prescribe two main types of medication that treat ADHD symptoms:\n\nStimulant medications are typically the first choice to treat ADHD symptoms because they work for 70-80% of people with attention deficit hyperactivity disorder (ADHD or ADD)1. When stimulants don’t work, or patients experience severe side effects, non-stimulant ADHD medication is the most common second-line treatment.\n\nNon-stimulant ADHD medications are considered second-line or third-line treatments because the level of benefits and response rates are significantly lower. Meaning, stimulant medications are more effective at relieving symptoms for a larger percentage of people. Some non-stimulant ADHD medications, like blood pressure medications, work best when used in addition to stimulant medications.\n\nUnlike quick-acting stimulants, non-stimulant ADHD medications may take up to a week to attain full effectiveness. As a result, it can take much longer to titrate non-stimulant medications — that is, to find the best dosage for maximum symptom control with minimal side effects.\n\nThe non-stimulant medication used to treat ADHD fall into several categories:\n\nThese non-stimulant ADHD medications were created to treat symptoms of attention deficit hyperactivity disorder and are approved by the U.S. Food and Drug Administration (FDA) as safe, proven treatments.\n\nStrattera (atomoxetine) was the first non-stimulant ADHD medication. Its generic name is atomoxetine. It is a norepinephrine (noradrenaline) reuptake inhibitor. Strattera works similarly to selective serotonin reuptake inhibitors (SSRIs) that are used to treat depression by raising levels of the neurotransmitter norepinephrine in the brain. This can help the primary symptoms of ADHD: hyperactivity, inattention, and impulsivity.\n\nStrattera is considered a third-line treatment for ADHD by the American Academy of Child and Adolescent Psychiatry (AACAP) because the response rate to atomoxetine is only approximately 50%. Meaning, it works for roughly half of the people who take it.\n\nThe most common side effects of Strattera include decreased appetite, nausea, vomiting, fatigue, dyspepsia (indigestion), dizziness, and mood swings.\n\nIntuniv (guanfacine) is a time-release version of the central alpha2A-adrenergic receptor agonist guanfacine. It is taken once daily and is thought to affect receptors in the brain in a way that improves ADHD symptoms such as emotional sensitivity, hyperarousal, and social aggression with limited side effects. It is not a controlled substance, and has a low risk of abuse or dependence. It can be used as a monotherapy, or as a complementary treatment alongside ADHD stimulant medications.\n\nThe response rate to alpha agonist medications is beteween 55% and 60%. Alpha-adrenergic agonists, like guanfacine, work best when used in addition to stimulant medications.\n\nThe most common side effects of Intuniv are sleepiness, dry mouth, tiredness, difficulty sleeping, nausea, stomach pain, dizziness, irritability, slow heart rate, and low blood pressure.\n\nKapvay (clonidine) is an extended-release alpha-agonist medication used to relax blood vessels and reduce blood pressure. It can also trigger the release of norepinephrine in the brain, which, in turn, improves ADHD symptoms. It can be used as a monotherapy, or as a complementary ADHD treatment alongside stimulant medications.\n\nThe response rate to alpha agonist medications is beteween 55% and 60%. Alpha-adrenergic agonists, like clonidine, work best when used in addition to stimulant medications.\n\nThe most common side effects of Kapvay are tiredness, cough, runny nose, sneezing, irritability, sore throat, nightmares, change in mood, constipation, increased body temperature, and ear pain.\n\nQelbree (i.e. SPN-812) is a nonstimulant ADHD medication containing a serotonin norepinephrine modulating agent approved by the FDA to treat attention deficit hyperactivity disorder (ADHD or ADD) in patients 6 to 17 years of age. Its active ingredient, viloxazine hydrochloride, was previously marketed as an antidepressant in Europe. It is the first nonstimulant ADHD medication to receive FDA approval for use in children since Intuniv was approved in 2009.\n\nThe most common side effects of Qelbree include drowsiness or somnolence, decreased appetite, fatigue, nausea, vomiting, trouble sleeping, irritability. Qelbree may also increase suicidal thoughts and actions.\n\nThese medications sometimes work to increase dopamine and norepinephrine, two neurotransmitters that exist in low levels in the ADHD brain. As a result, some physicians prescribe them “off-label” to treat ADHD symptoms, meaning they are not FDA-approved to treat attention deficit hyperactivity disorder. They can be a good treatment choice for people with ADHD and depression, but are not generally as effective as Strattera or stimulant medications.\n\nIn research literature, the benefits of antidepressants for ADHD are not clinically significant. Meaning, their efficacy is either unknown or the responses are so small that a patient may not notice a difference in symptoms.\n\nThe most commonly prescribed antidepressant for ADHD is Wellbutrin.\n\nWellbutrin (bupropion) is a norepinephrine dopamine reuptake inhibitor (NDRI), meaning it slows down the reabsorption of dopamine and norepinephrine after these chemicals are released into the brain. This action makes these neurotransmitters more available to send messages in the brain. Wellbutrin was first approved by the FDA in 1985 to treat depression. Other brand names of bupropion include Aplenzin, Forfivo, and Zyban.\n\nEffexor XR (venlafaxine) is part of a newer class of antidepressant medications called serotonin-norepinephrine reuptake inhibitor (SNRI). It is sometimes, but not commonly, used to treat ADHD because it works to increase levels of norepinephrine and serotonin in the brain, which can improve mood or concentration. One small study found that treatment with Effexor improved ADHD symptoms for adults2.\n\nTricyclic antidepressants have been shown to improve ADHD symptoms for some children, adolescents, and adults who don’t respond to stimulants. The options include Tofranil (imipramine), desipramine (Norpramin, Pertofrane), and Nortriptyline (Aventyl, Pamelor). There is the most evidence for ADHD symptom control with desipramine, but tricyclic antidepressants can cause side effects that some find intolerable3.\n\nMonoamine oxidase inhibitors (MAOIs) such as Nardil (phenelzine) or Parnate (tranylcypromine) have been shown to improve ADHD symptoms in adolescents and adults in a small number of studies. However, they are rarely used because they have serious and sometimes dangerous side effects and interactions4.\n\nThe most common side effects of antidepressants are nausea and vomiting, weight gain, diarrhea, sleepiness, and sexual problems. Wellbutrin XR and Effexor XR generally do not cause as many side effects as tricyclic antidepressants and MAOIs5.\n\nThese medications have the same active ingredient as FDA-approved non-stimulant ADHD medications6.\n\nTenex (Guanfacine) is an immediate-release central alpha2A-adrenergic receptor agonist with the same active ingredient as Intuniv. Because the medication is released more quickly into the bloodstream, some patients report more side effects with Tenex than when taking Intuniv.\n\nClonidine (Catapres) is an alpha-agonist medication used to relax blood vessels and reduce blood pressure. The extended-release formulation, Kapvay, is FDA-approved to treat ADHD.\n\nWakefulness-promoting medications are not approved by the FDA to treat ADHD, but some physicians prescribe them because they have similar mechanisms of action in the body.\n\nProvigil (modafinil) is the most commonly used in this class of medications. Some research has shown improvement in ADHD symptoms for adults taking Provigil when compared to a placebo7. However, there is a lack of substantial evidence that modafinil can effectively improve symptoms of ADHD.\n\nThe most common side effects of modafinil are headache, back pain, nausea, nervousness, stuffy nose, diarrhea, feeling anxious, trouble sleeping, dizziness, and upset stomach.\n\nSymmetrel (amantadine) is an antiviral drug used to prevent certain types of the flu by stopping the virus’s growth, and to treat respiratory symptoms of the flu. It is not a substitute for a flu vaccination. The Centers for Disease Control and Prevention (CDC) does not recommend treating the flu with amantadine in the U.S. because of a developed resistance caused by the circulating strains8.\n\nSymmetrel is also used to alleviate symptoms of Parkinson’s Disease such as tremors. It is thought to work by stimulating the production of dopamine. Increased dopamine can also help symptoms of ADHD; it is sometimes used off-label to treat ADHD symptoms in some patients.\n\nThis use is not approved by the FDA, but studies suggest that treatment plans developed by William Singer, M.D., and Roger Cohen, M.D., effectively improved executive functioning and sensory integration with low doses of amantadine9. A study found some beneficial effects of amantadine for children with ADHD, as well10. However, there is a lack of substantial evidence that amantadine can effectively improve symptoms of ADHD.\n\nThe most common side effects of amantadine are blurred vision, nausea, dry mouth, dizziness when standing, and insomnia.\n\nHow to Treat ADHD in Children: Next Questions\n• What ADHD medications are used to treat children?\n• What are all of my ADHD medication options?\n• What are the most popular ADHD medications?\n• How do ADHD medication formulations and delivery systems differ?\n• What are the benefits and risks of ADHD medication?\n• Is ADHD medication right for my child?\n• What are common side effects associated with ADHD medication?\n• What natural treatments help kids with ADHD?\n• How can I find an ADHD specialist near me?", "opengraph": {"type": "article", "title": "Non-Stimulant ADHD Medication Overview", "url": "https://www.additudemag.com/non-stimulant-adhd-medication/", "description": "Non-stimulant ADHD medications come in many varieties: FDA-approved non-stimulants, antidepressants, blood pressure medications, and more. These are second-line treatment options for ADHD patients who don’t respond to stimulant medication, or experience too many side effects.", "article:published_time": "2019-06-27T13:30:59+00:00", "article:modified_time": "2023-02-08T21:08:50+00:00", "site_name": "ADDitude", "image": "https://i0.wp.com/www.additudemag.com/wp-content/uploads/2019/06/Non-stimulant-ADHD-medication_GettyImages-1132224424.jpg", "image:width": "1200", "image:height": "675", "image:alt": "A woman holds a prescription for non stimulant ADHD medication.", "locale": "en_US"}, "tags": ["treating kids", "treating teens", "treating adults"], "tweets": [], "movies": [], "links": ["https://www.additudemag.com/how-to-treat-adhd-with-medication-therapy-diet-coaching/", "https://www.additudemag.com/stimulant-medications-for-adhd/", "https://www.additudemag.com/adhd-symptoms-checklist/", "https://www.additudemag.com/adhd/", "#footnote1", "https://www.additudemag.com/strattera-adhd-medication-faq/", "https://www.additudemag.com/medication/strattera/", "https://www.additudemag.com/medication/intuniv/", "https://www.additudemag.com/medication/kapvay/", "https://www.additudemag.com/medication/qelbree/", "https://www.additudemag.com/medication/wellbutrin/", "https://www.additudemag.com/medication/effexor-xr/", "#footnote2", "https://www.additudemag.com/medication/tofranil/", "#footnote3", "#footnote4", "#footnote5", "#footnote6", "https://www.additudemag.com/medication/guanfacine/", "https://www.additudemag.com/intuniv-adhd-nonstimulant-medication/", "https://www.additudemag.com/medication/kapvay/", "https://www.additudemag.com/medication/modafinil/", "#footnote7", "https://www.additudemag.com/medication/amantadine/", "#footnote8", "#footnote9", "#footnote10", "https://www.additudemag.com/adhd-medications-for-children/?src=embed_link ", "https://www.additudemag.com/download/adhd-medications-stimulants-nonstimulants-comparison-chart/?src=embed_link", "https://www.additudemag.com/adhd-medications-strattera-concerta-adderall-vyvanse-evekeo-ritalin-focalin-dexedrine/?src=embed_link", "https://www.additudemag.com/how-does-adhd-medication-work-common-treatment-qs/?src=embed_link", "https://www.additudemag.com/adhd-medication-list-treatments-children-adults/?src=embed_link", "https://www.additudemag.com/adhd-medication-treatment-guide-for-parents/?src=embed_link", "https://www.additudemag.com/adhd-medication-side-effects-questions/?src=embed_link", "https://www.additudemag.com/adhd-medication-side-effects/?src=embed_link", "https://www.additudemag.com/slideshows/treating-adhd-without-medication/?src=embed_link", "https://directory.additudemag.com/listing/guide/adhd-centers-clinics", "https://doi.org/10.3389/fnins.2013.00082", "https://europepmc.org/abstract/med/8626348", "https://doi.org/10.1002/14651858.CD006997.pub2", "https://doi.org/10.1017/S1461145703003973", "https://my.clevelandclinic.org/health/drugs/12959-attention-deficit-hyperactivity-disorder-adhd-nonstimulant-therapy-strattera--other-adhd-drugs", "https://doi.org/10.3389/fpsyt.2017.00229", "https://doi.org/10.1586/14737175.6.4.455", "https://www.cdc.gov/flu/professionals/antivirals/antiviral-dosage.htm", "https://www.amazon.com/gp/product/0345442318/ref=as_li_qf_sp_asin_il_tl?ie=UTF8&tag=nhm00-20&camp=1789&creative=9325&linkCode=as2&creativeASIN=0345442318&linkId=aea0434ecb378330155e6cb2ea14ec05", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3565716/", "https://www.additudemag.com/study-methylphenidate-effective-adhd-treatment/", "https://www.additudemag.com/stimulant-adhd-medication-adhansia-xr/"], "authors": [], "publish_date": "2019-06-27T13:30:59+00:00"}