{"result_id": "011044", "URL": "https://www.additudemag.com/lost-items-adhd-adults/", "timestamp": "2023-04-25 11:56:04 CEST+0200", "meta": {"description": "Lost items and ADHD go hand in hand. Here, readers share stories of the personal things they’ve misplaced, and where they ended up.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.additudemag.com/wp-content/uploads/2020/02/cropped-additude-favicon-512x512-1.png?resize=480%2C270px&ssl=1", "canonical": "https://www.additudemag.com/lost-items-adhd-adults/", "encoding": "UTF-8"}, "image": null, "domain": "www.additudemag.com", "title": "“My Keys Were in the Fridge!” ADHD Stories of Wildly Misplaced Items", "cleaned_text": "Keys, wallet, meds, cell phone — the list of our frequently used and easy-to-misplace items stretches on and on. Poor working memory makes it difficult for adults with ADHD to hold information temporarily, which means the milk might end up in the cupboard and the cereal in the laundry room.\n\nIn a recent survey, ADDitude asked “What’s the most recent wildly misplaced personal item you’ve rediscovered, and where? Was it funny or frustrating?” Here are some of our favorite answers; share your best lost item story in the Comments section below.\n\n“I was in the airport with my family and I started to panic because I lost track of my phone. I was frantically moving my hand around the seat, looking for it. It was in my other hand.” — Anonymous\n\n“I took the TV remote with me to the grocery store in my shirt pocket. The remote was as oblivious as I was.” — Steve\n\n“I have left my wallet at gas stations or driven off with it on my roof so many times in so many cities that it is now funny when strangers drop it off. One time I didn’t even know it was missing yet!” — Miranda\n\n[Do You Have a Working Memory Deficit? Take This Test]\n\n“I left a carton of eggs in my mailbox. The mailman must have been surprised.” — Liz\n\n“I garden almost daily, and find my reading glasses in a pot or in a bed of flowers. Luckily I have 10 pairs from the dollar store.” — Anonymous\n\n“I lose my wallet, the remote control, and my glasses several times a day. I always check the laundry and fridge first. I would try to write stuff down if I could find the darn day planner…” — Donald\n\n“I found our house phone in my car. I had kept talking on it as I left the house, probably thinking it was my cell phone. Eventually the call cut off, so I turned on the radio (assuming they would call me back) and then completely forgot about the conversation. Later in the week I stumbled across the phone in the car and realized what happened. When I tell people about these events, they just look at me like I’m crazy.” — Kim\n\n“I’ve found my cell phone in the freezer and the microwave. I just laugh and keep moving — it’s a part of who I have always been.” — Sandra\n\n[Read This Next: “I Can’t Cure Their Forgetfulness. I Can Accept It.”]\n\n“We have a small remote device to open our garage, which I put in my pocket as I garden. One day, my partner asked where the garage opener was. You know that ‘brain-rush’ feeling that comes with a flurry of images, like life flashing before your eyes? I tried to calmly think through my actions and soon realized I had zero recollection, so I said (in my best ‘responsible grown-up voice’), ‘I buried it, darling.’ A week later, my partner found it in a pile of soil at the bottom of the hill.” — Jane\n\n“I left my car keys in the closet… and found them two years after I had traded in the car.” — Sara\n\n“I’ve put the milk in the cupboard and the cereal in the fridge on multiple occasions.” — MJ\n\n“I left my phone in the refrigerator last night. I only found it because my watch can ping my phone.” — Amanda\n\n“I always misplace my phone — usually at the bottom of my super-messy handbag — but more times than I’d like to admit, I have searched frantically for my phone when I am actually talking on it.” — Beth\n\n“It’s always frustrating, but I’ve learned to not get my heart rate up over initially misplacing something. Recently, I took my teen daughter’s vaccine card so she wouldn’t lose it — I never saw it again, but the clinic kindly gave us another.” — Anonymous\n\n“One time I removed my hearing aids, put them in their case, and into the freezer. After looking behind several major appliances, multiple old suitcases, and bags of chips in a desperate quest to find them, I gave up and made an appointment with the audiologist to get replacements. It was a couple of weeks later that the nicely chilled hearing aids turned up somewhere between the frozen peas and the chicken breasts.” — Anonymous\n\n“I once lost my phone for three hours and eventually found it in the fridge. When I told my flatmate he replied ‘Did you get any cold calls?’” — Sharon\n\n“Recently, I found a Tupperware of pasta sauce from the week before in my cupboard. The spaghetti made it into the fridge but the sauce container ended up in the cupboard. My husband and I laughed and laughed — it was that or beat myself up about it and that gets me nowhere.” — Anonymous\n\n“December is always a busy time with routine changes which makes it more difficult to keep track of everyday items. I find myself offering a cash prize to any child that can find my misplaced items. Two years ago I lost my glasses and we spent weeks looking for them. Then this past year I opened the box with the Christmas decorations and there they were!” — Sherri\n\n“One time my husband opened our linen cupboard and found that I had left an empty takeaway cup there. He confronted me about leaving my trash there. I had no idea why I did it so all I could do was laugh until I literally fell over.” — Anonymous\n\n“I found my car keys in the deep freezer a couple of days after I lost them. It was kind of funny but frustrating at the same time since we spent days looking for them.” — Anonymous\n\n“Once, while doing an inventory count, I was on a ladder checking the highest shelf in the warehouse for missing items. I didn’t find the items, but I did find a clipboard I had left up there a full 18 months earlier!” — David\n\n“My son with ADHD is going to a wilderness adventure camp next month so we bought him hiking boots and other supplies. We got home and unpacked our purchases. He threw the empty bags and boxes into the recycle bin. Two days later — a day before trash pick-up — I went to throw something away and saw the brand new boots in the bin.” — Anonymous\n• Download: How to Tidy Up Your Home Like a Pro\n• Read: “I Misplace at Least One Thing a Day.”\n\nSUPPORT ADDITUDE\n\n Thank you for reading ADDitude. To support our mission of providing ADHD education and support, please consider subscribing. Your readership and support help make our content and outreach possible. Thank you.", "opengraph": {"type": "article", "title": "“My Keys Were in the Fridge!” ADHD Stories of Wildly Misplaced Items", "url": "https://www.additudemag.com/lost-items-adhd-adults/", "description": "“It was a couple of weeks later that the nicely chilled hearing aids turned up somewhere between the frozen peas and the chicken breasts.” Here are funny, and occasionally frustrating, stories from adults with ADHD who rediscovered their lost items in bizarre locations. ", "article:published_time": "2021-07-02T09:50:14+00:00", "article:modified_time": "2022-04-07T14:58:14+00:00", "site_name": "ADDitude", "image": "https://i0.wp.com/www.additudemag.com/wp-content/uploads/2021/06/GettyImages-949464102-e1624985321412.jpg", "image:width": "1200", "image:height": "800", "locale": "en_US"}, "tags": ["organization", "executive functions", "from readers", "treating adults"], "tweets": [], "movies": [], "links": ["https://www.additudemag.com/i-keep-losing-things-adhd-and-misplaced-possessions/", "https://www.additudemag.com/i-keep-losing-things/", "https://www.additudemag.com/working-memory-deficit-weak-short-term-memory-symptoms-test-adults/?src=embed_link", "https://www.additudemag.com/forgetfully-yours/", "https://www.additudemag.com/parenting-adhd-forgetfulness/?src=embed_link", "https://www.additudemag.com/slideshows/how-to-declutter-adhd/", "https://www.additudemag.com/how-to-stop-beating-yourself-up-about-adhd-symptoms/", "https://www.additudemag.com/what-is-adhd-symptoms-causes-treatments/", "https://www.additudemag.com/lost-keys-how-to-find-adhd/?src=embed_link", "https://www.additudemag.com/download/organize-your-adhd-home/?src=embed_link", "https://www.additudemag.com/stop-losing-things/?src=embed_link", "http://additu.de/subscribe/", "https://www.additudemag.com/gaslighting-shame-adhd-adults-blog/", "https://www.additudemag.com/eating-disorders-adhd-research-treatments/"], "authors": [], "publish_date": "2021-07-02T09:50:14+00:00"}