{"result_id": "011014", "URL": "https://www.additudemag.com/trauma-coronavirus-adhd/", "timestamp": "2023-04-25 11:55:12 CEST+0200", "meta": {"description": "Past trauma may cause the ADHD brain to trigger unhealthy emotional and physical responses to COVID-19. Learn how to counterbalance that instinct.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.additudemag.com/wp-content/uploads/2020/02/cropped-additude-favicon-512x512-1.png?resize=480%2C270px&ssl=1", "canonical": "https://www.additudemag.com/trauma-coronavirus-adhd/", "encoding": "UTF-8"}, "image": null, "domain": "www.additudemag.com", "title": "How This Pandemic Triggers Trauma Responses in the ADHD Brain", "cleaned_text": "We’ve all been in a state of high alert during the last six weeks as a pandemic rages somewhere outside our windows. During this time, I have continued to work with patients virtually, and they are reporting overwhelming anxiety:\n• “I can’t breathe through this mask. It’s suffocating me and I’m just not wearing it!”\n• “Seeing empty supermarket shelves made me buy enough snacks for two weeks; I ate them all today and now I hate myself.”\n• “I was binge-watching this Netflix series and the next thing I know, it’s 3 a.m. My kids will be up in three hours.”\n• “I’m not used to having my husband around all the time; if he interrupts me one more time with a stupid question, I’ll…”\n• “There’s no way I can entertain and control these kids every day. I’m already desperate, exhausted, and resentful.”\n• “I can’t stop watching the news. The facts keep changing, and I sit here, petrified. The wine doesn’t help anymore.”\n• “Sometimes I’m sure I’m going to die — and sometimes I think it’ll be fine. It’s like ping-pong: I go from one extreme to the other in minutes.”\n\nFor most people, the word trauma connotes an acute tragedy. But our shared, lingering ordeal today is the epitome of chronic trauma.\n\nCOVID-19 has transformed everything we considered safe, predictable, and comprehensible about our lives. Each day is traumatic, as we battle vulnerabilities, uncertainty, and real danger. Derailed routines put constant demands on our executive functions to plan, prioritize, and organize new solutions for isolation.\n\nWith the frightening pandemic outside, nothing at home feels urgent, so ADHD brains may refuse to engage. People are shocked by how much harder it is to self-motivate now, and by how distressed they feel.\n\nMany adults with ADHD have already experienced chronic trauma, even if they never thought of it that way. In ADHD homes, it isn’t unusual to grow up with a parent who is impulsive, physically aggressive, emotionally abusive, down, or abusing substances. Daily life can be unpredictable and children may not feel safe.\n\n[Click to Read: “Is It Selfish, Shallow, or Frivolous to Worry About Your Own State of Mind During a Pandemic?”]\n\nOne of the effects of early trauma is that brain and body are in a perpetual state of high alert, flooded with cortisol, always on the lookout for danger. For those with ADHD who have experienced trauma, feelings and actions may be more intense and reactive because they are primed to perceive threat.\n\nIn this pandemic, the danger is real — and it triggers the body to engage the fight-or-flight survival mechanisms needed in the past. The fact that so many facets of our lives seem out of our control right now elicits feeling of helplessness and foreboding from childhood. The impact of our global situation is traumatic for all, making it more difficult to control our emotions, anxiety, and behavior. Those diagnosed with ADHD, and especially those with a history of trauma, find that their stability is threatened, so support and healing strategies are essential.\n\nFortunately, there are many ADHD-friendly, proactive ways to help yourself during this traumatic time:\n\n1. Set an alarm to help you get up at the same time each day. Normalize what you can: get out of your pajamas, take a shower, and get dressed. If you take ADHD medication, don’t stop. Try for consistency with mealtimes and bedtimes (use alarms). In a crisis, predictability is comforting.\n\n2. Create a written schedule, even if it starts with only one “appointment,” like “laundry at 10” or “call Pam at 3.” Tell someone about your plan, so you feel accountable. Any sense of productivity can break through the fog and settle ADHD restlessness.\n\n3. Self-care is key for keeping body and brain healthy. Most important is to connect with family and friends to remind yourself that you’re not alone. Suggest a COVID-19 moratorium for some conversations. Use a video platform. Seeing faces is more immediate and engaging for the ADHD brain. Encourage children to visit friends and family on FaceTime. Do things it’s hard to make time for: Take a walk, play with the dog, bake a cake, do yoga, play board games. Don’t feel pressured to organize your whole house. Your wellbeing has to be the priority.\n\n4. Limit the negative news. Set an alarm for 15-20 minutes, twice a day. Any longer and you risk getting sucked into the black hole of the numbers — new cases, the death toll. Like a strong undertow, the news commentary becomes difficult to escape, because projections and statistics are very high-stim for ADHD brains.\n\n5. Tune out the call of the carbs. Our brains crave carbs to increase serotonin and calm us. Confronted with empty supermarket shelves, many feel compelled to hoard food. Fighting those urges and making a healthy meal offers a sense of control and is a great self-esteem boost.\n\n6. Watch for signs of self-medicating. If you drink alcohol, choose a bottle of beer or cider; it’s a self-limiting amount versus an open bottle of wine. There is online support to help resist substance urges; connecting with a sponsor is a great reset.\n\n7. Loosen the grip of anxiety. ADHD’s emotional reactivity can create sky-high stress levels and interfere with sleep. Some may feel tearful, and others irritable. The relentless sense of danger triggers trauma, especially in those who may have experienced it in their younger years. As a result, ADHD symptoms could worsen.\n\nIf necessary, allow two minutes of catastrophizing each day, and then remember that you’re safe. Instead, focus on gratitude for first-line responders, and delivery and supermarket workers. If you start to panic, take five slow deep breaths to interrupt hyperventilation. And, of course, seek support from family, friends, and/or a therapist.\n\nThe pandemic is a great equalizer. No one is immune, and those with ADHD are on equal footing with everyone else. We are all using our unique strengths to improvise. Be generous with your compassion, ask for help, offer help, and definitely watch your favorite comedies.\n\n[Read This Next: On Piloting My ADHD Brain Through This Pandemic]\n\nTHIS ARTICLE IS PART OF ADDITUDE’S FREE PANDEMIC COVERAGE\n\n To support our team as it pursues helpful and timely content throughout this pandemic, please join us as a subscriber. Your readership and support help make this possible. Thank you.", "opengraph": {"type": "article", "title": "How This Pandemic Triggers Trauma Responses in the ADHD Brain", "url": "https://www.additudemag.com/trauma-coronavirus-adhd/", "description": "ADHD’s emotional reactivity can create sky-high stress levels in the face of a global pandemic. Some may feel tearful, and others irritable. The relentless sense of danger triggers those who might have experienced trauma in their younger years. Here are some rules for calming, healing, and moving forward positively.", "article:published_time": "2020-04-24T09:40:53+00:00", "article:modified_time": "2022-07-09T23:44:11+00:00", "site_name": "ADDitude", "image": "https://i0.wp.com/www.additudemag.com/wp-content/uploads/2020/04/woman-sitting-covered-in-pink-smoke-1581444.jpg", "image:width": "1200", "image:height": "800", "image:alt": "Woman with smoke representing trauma", "locale": "en_US"}, "tags": ["ADHD in a Pandemic", "treating adults", "stress"], "tweets": [], "movies": [], "links": ["https://www.additudemag.com/childhood-trauma-adhd-behavior-problems/", "https://www.additudemag.com/what-is-adhd-symptoms-causes-treatments/", "https://www.additudemag.com/mental-health-adhd-pandemic-worry/?src=embed_link", "https://www.additudemag.com/types-of-anxiety/", "https://www.additudemag.com/adhd-medication-for-adults-and-children/", "https://www.additudemag.com/adhd-coronavirus-anxiety-coping-strategies/?src=embed_link", "https://www.additudemag.com/adhd-symptoms-checklist/", "https://www.additudemag.com/adhd-in-a-crisis-pandemic/?src=embed_link", "/tag/coronavirus/", "/tag/coronavirus/", "http://additu.de/subscribe/", "https://www.additudemag.com/how-to-get-organized-adhd-quarantine/", "https://www.additudemag.com/akili-adhd-video-game-treatment-release-pandemic/"], "authors": [], "publish_date": "2020-04-24T09:40:53+00:00"}