{"result_id": "011006", "URL": "https://www.additudemag.com/adhd-medication-reminder-routines-alarms/", "timestamp": "2023-04-25 11:51:59 CEST+0200", "meta": {"description": "Medication reminders help people with ADHD and working memory problems. Use these ideas for creating visual cues, routines, and alarms.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.additudemag.com/wp-content/uploads/2020/02/cropped-additude-favicon-512x512-1.png?resize=480%2C270px&ssl=1", "canonical": "https://www.additudemag.com/adhd-medication-reminder-routines-alarms/", "encoding": "UTF-8"}, "image": null, "domain": "www.additudemag.com", "title": "Q: \"How Can I Remember to Take the ADHD Medication That Helps Me Remember Things?\"", "cleaned_text": "Q: “I’m an adult woman who was recently diagnosed with ADHD and other medical issues. I have to remember to take my meds, test my blood pressure, keep up with doctors’ appointments, and perform other medical tasks. It’s a lot and I’m not doing well with it. How can I remember to do the things I need to do?” – ADHDMom\n\nYou are not alone! Juggling a daily medical to-do list along with home and family responsibilities can overwhelm even the most organized person. Though you might be struggling now, I believe you can create systems and strategies that may help streamline your health management. Here are a few tips and tools to get you started.\n\nWhat’s Your Style? Recognize how you prefer to remember tasks and tap into those practices that work for you. For example, perhaps you like your reminders fun and visual, so leaving yourself colorful notes (Take your meds!) on your bathroom mirror might work. If you are comfortable and familiar with technology, then timers and smart watches with alarms might work better. It doesn’t matter what your personal style is as long as it helps to get those memory juices flowing.\n\nPro Tip: If you spend a good part of your day in front of your computer, set an alarm on your desktop calendar. A notification will pop up on your screen without making any noise, so your work or virtual meet-ups won’t be disrupted!\n\nRoutine. Ritual. Repeat. The beauty of routines or rituals is that they take away the need to “remember to remember.” Think of a routine as “I plan it once and I’m done.” The ability to move through your tasks without thinking about what’s next is truly freeing.\n\nThink about the routines and rituals you already have in place that ARE working for you. Perhaps you always charge your phone in the kitchen and never forget it since you pass through the kitchen often. Or you leave a tote bag by the front door so you literally must step over it to leave your home. If you have a system or routine that is already working for you, consider pairing it with another task you want to remember. For example, if you never miss your morning brew, place your oral medications or pill box in your “coffee drawer” and voila! Every morning you will be presented with a gentle visual reminder to take your medication.\n\nPro Tip: One of my favorite apps for habit building is The Habit Hub. The app is customizable and encourages you to create daily habits by reminding you to perform your tasks and track when you complete them. The app creates a visual “chain” when tasks are completed. As the chain gets longer, it serves as an incentive for you to persist, so you don’t break the chain.\n\nPut the item front and center! If you are prescribed oral medications (or routinely take vitamin and mineral supplements), you can use the bottle or container as a visual reminder. Place the bottles where you’ll see them at the time of day you have to take them. Turn the bottles upside down when you take them. Then, at the end of the day, turn them right-side up. This will act not only as a visual reminder that you need to take your medications but also that the task was completed. If you take certain medications twice a day and are in two different locations when doing so, then separate out the medications into two containers.\n\nPro Tip. Ask your local pharmacy if they can provide you with medicine bottles that have lids with built-in alarms.\n\nUse photo prompts. Research shows that we remember images more effectively than we do words, which ask our brains to work a lot harder to process. This explains why, after a while, we stop “seeing” to-do lists. So try this out-of-the-box idea instead: Have someone take pictures of you moving through your necessary routines. Post the photos in the areas of your home where you perform these tasks.\n\nPro Tip: Many pharmacies now offer a month of your medications pre-packed by dosage, date, and time at no extra cost. This is a great way to reduce time spent sorting out medications and reducing counter-top clutter.\n\nSet alarms or timers. The beauty of an alarm is that it puts the responsibility of remembering on something else! In other words, it holds future time — allowing you to free up your brain to be completely in the present. If you are feeling overwhelmed with your daily medical to-do list, try using an electronic timer or cell phone reminder. The routine aspect of using these types of reminders can help make these practices habitual and therefore seamless.\n\nWear a watch with a built-in alarm feature. There are many medical watches that can provide reminders as well as alarms. Websites such as EPill.com and Amazon carry medical watches. These allow you to set alarms multiple times a day.\n\nMedication Reminders for Adults with ADHD: Next Steps\n• Read: 7 Habits That Will Simplify Your Life\n\nADHD Family Coach Leslie Josel, of Order Out of Chaos, will answer questions from ADDitude readers about everything from paper clutter to disaster-zone bedrooms and from mastering to-do lists to arriving on time every time.\n\nSubmit your questions to the ADHD Family Coach here!\n\nSUPPORT ADDITUDE\n\n Thank you for reading ADDitude. To support our mission of providing ADHD education and support, please consider subscribing. Your readership and support help make our content and outreach possible. Thank you.", "opengraph": {"type": "article", "title": "Q: \"How Can I Remember to Take the ADHD Medication That Helps Me Remember Things?\"", "url": "https://www.additudemag.com/adhd-medication-reminder-routines-alarms/", "description": "Creative medication reminders can help people with ADHD, who often have working memory problems. Use these ideas for creating visual cues, building routines, and utilizing alarms.", "article:published_time": "2021-04-13T09:11:06+00:00", "article:modified_time": "2021-12-04T04:09:13+00:00", "site_name": "ADDitude", "image": "https://i0.wp.com/www.additudemag.com/wp-content/uploads/2021/04/GettyImages-1140881598.jpg", "image:width": "1200", "image:height": "801", "image:alt": "Man taking daily supplements from plastic pill organizer box", "locale": "en_US"}, "tags": ["medication", "Dear ADHD Family Coach", "ask the experts"], "tweets": [], "movies": [], "links": ["https://www.additudemag.com/adhd-time-management-tools-make-to-do-lists-work-for-you/", "https://www.additudemag.com/ohh-i-forgot/", "https://www.additudemag.com/starting-a-routine-that-works/", "https://www.additudemag.com/strategies-memory-distraction-when-sticky-notes-lose-their-power/?src=embed_link", "https://www.additudemag.com/improve-working-memory/?src=embed_link", "https://www.epill.com/", "https://www.additudemag.com/always-losing-things-adhd-memory-gadgets-tile-motivaider/?src=embed_link", "https://www.additudemag.com/simplify-your-life-habits-reduce-overwhelm/?src=embed_link", "https://www.additudemag.com/download/adhd-medication-monitoring-log/?src=embed_link", "https://www.orderoochaos.com/", "https://www.additudemag.com/dear-organizing-coach/", "http://additu.de/subscribe/", "https://www.additudemag.com/staying-connected-teens-pandemic/", "https://www.additudemag.com/back-to-normal-pandemic-adhd/"], "authors": [], "publish_date": "2021-04-13T09:11:06+00:00"}