{"result_id": "011036", "URL": "https://www.additudemag.com/covid-timeline-adhd-brains-mental-health/", "timestamp": "2023-04-25 11:55:50 CEST+0200", "meta": {"description": "For ADHD brains, the COVID timeline includes an increase in anxiety and overwhelm. Will we continue to feel the lasting mental-health impact of the pandemic for years?", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.additudemag.com/wp-content/uploads/2020/02/cropped-additude-favicon-512x512-1.png?resize=480%2C270px&ssl=1", "canonical": "https://www.additudemag.com/covid-timeline-adhd-brains-mental-health/", "encoding": "UTF-8"}, "image": null, "domain": "www.additudemag.com", "title": "Two Years Inside a Pandemic: A COVID Timeline of ADHD Brains in Distress", "cleaned_text": "Two years ago today, the World Health Organization formally characterized COVID-19 as a pandemic. Inside a week, workplaces, schools, places of worship, and most unessential stores had shuttered; we were all thrown into psychological vertigo. Then, on April 5, 2020, ADDitude fielded its first of 15 pandemic check-in surveys — and the results took our breath away.\n\nThe COVID Timeline Begins (and Remains) with Anxiety\n\nIn those early, uncertain, highly disruptive weeks of the pandemic, 95% of our 3,561 survey respondents reported “significant life upheaval.” Nearly 100% of your children were at home, trying to figure out how (or whether) to learn on a screen. And 38% of you were suddenly working from home for the first time; 13% of you continued to work in person as essential employees. Either way, the situation was impossible and inescapable.\n\nADHD brains require predictable routines. The detonation of our daily patterns was particularly difficult for adults and children with ADHD, whose emotional regulation was further taxed by serious health fears, isolation, and no end in sight. The early signs of a mental health crisis were clear in that first pandemic survey of 2020:\n• 88% of ADDitude readers said they were concerned with their mental, emotional, and physical health\n• 67% said they felt overwhelmed or exhausted\n• Many were feeling all of the above, plus loneliness and anger\n\nAs vaccines became available, schools reopened, and new routines developed, we saw overall concern about the coronavirus flatten out and begin to fall. However, reported anxiety and overwhelm remained quite high. In April 2021 — after the first wave of vaccinations and before the Delta or Omicron variants emerged — 69% of you reported sustained exhaustion and 64% of you reported ongoing anxiety and worry. Those numbers were high — but not nearly as high as they are today.\n\nTwo weeks ago, ADDitude deployed its 15th pandemic survey and, though 62% of you tell us you feel less concerned about coronavirus than you did a year ago, the vast majority of the survey’s 4,080 respondents say their mental health is worse than ever.\n• 74% of ADDitude readers are feeling exhausted and overwhelmed today\n• More than half are feeling sad or depressed\n\nWhy have anxiety and overwhelm risen as COVID-19 fears have dropped? The pandemic has scarred us deeply over the last two years, and those wounds will take time to heal.\n\n“This is the longest I have gone without maintaining a consistent workout routine; I can’t exercise without having a class to go to,” wrote one mother with ADHD in Texas. “It’s also the longest I’ve gone without attending and volunteering at church. Zoom calls, online church services, and YouTube workout channels have not been able to fill the void these core activities have left in my life. As a result, I have never struggled with depression, anxiety, and anger as much as I have these last 12 months. Now that I’m starting to return to these activities, I fear it will be a long time before my mental and emotional health returns to a good state.”\n\nWhile it’s true that a third of people say their mental health has improved over the last two years, 31% report it’s a little worse and 24% say it’s a lot worse. Only ‘screen usage’ scored worse with 37% of readers calling it ‘a lot worse’ since early 2020.\n\n[My Kids Are on Screens All Day: Is That Okay?]\n\n“I feel like I’m not the same person anymore, and I will never get her back,” wrote one woman who was recently diagnosed with ADHD in her 50s.\n\n“I am now addicted to screens; this was never the case before,” wrote a teacher with ADHD, anxiety, and depression in California. “I don’t paint, write, or draw now, even though I had done so for 45 years before the pandemic. This is so sad. I also feel incapable of being ‘normal’ in any social situation even with friends.”\n\nMore than half of adult survey respondents say they’ve been diagnosed with ADHD or a comorbid condition since March 2020. Nearly a third of diagnosed adults have started taking ADHD medication for the first time, nearly 20% have increased their dosage, and 14% have switched medication. That’s a lot of change, especially on top of COVID-19.\n\n“The pandemic has forced me to realize and deal with some issues, so some good has come of that,” wrote one woman who was diagnosed with ADHD during the pandemic and began taking stimulant medication for the first time. “However, my general mood and depression have worsened, and it feels harder to overcome.”\n\nThe Pandemic’s Impact on Your Professions and Relationships\n\nOver the last two years, 14% of ADDitude readers resigned from their job and 13% embarked on a new career, while 7% lost their job due to the pandemic. The factors contributing to career change are varied and the outcomes mixed. Several parents reported quitting their jobs to homeschool children struggling with remote or hybrid learning. Many others reported burning out and reassessing their priorities.\n\n“I quit my job of 10 years this past summer,” wrote one respondent who was recently diagnosed with ADHD. “The pandemic really showed how my company didn’t value their employees’ health.”\n\nFor most adults, though, the lowest moments of the last year were not sparked by job loss or even sickness (27% of respondents say they’ve had COVID-19), but rather by strained relationships and equally strained mental health. Emotional dysregulation was a common fuel — fanning the flames of discontent and making a bad situation worse. A staggering 90 survey respondents reported experiencing suicidal thoughts or responding to a child’s suicidal thoughts or behaviors at some point during the pandemic.\n\n“My lowest moments came when I was not managing my emotions in front of my children or feeling like I was the best parent I can be to them,” wrote the mother of a 3rd-grade student with ADHD and a kindergartener in Missouri. “And when I was not managing my emotions in front of my husband and letting my inner critic lie to me about our relationship.”\n\n“I struggle with maintaining friendships and relationships when not physically around others (when I’m not actively ‘reminded’ of their presence by seeing them). So, I feel much more distant from friends now,” wrote an adult diagnosed with ADHD during the pandemic. “While I’m closer with my immediate family, I feel like my social circle has shrunk, and it makes me miss who I was in 2019. I felt like I used to be much more fun and sociable, and now I feel less confident in things I was good at.”\n\n“My lowest moment was crying on my bathroom floor wondering how it will ever feel safe enough again to let my lonely, isolated child see other children,” wrote the mother of a 5thgrader with ADHD in Utah.\n\nFor students with ADHD, the spring 2020 semester was best summed up with one word: Disaster.\n\nRemote learning was almost universally a bad fit for ADDitude families, however, the return to in-person school last spring and this fall was not without stress and worry — about COVID-19, masks, impaired social skills, academic lost ground, and much more. Now that the dust has settled, caregivers are taking stock and calling the pandemic’s impact on learning slightly negative (27%) or distinctly negative (38%). Only 6% said they’ve seen positive academic growth these last two years.\n\n“Virtual learning set him back so much; it did more harm than good,” wrote the mother of a 3rd-grade student with ADHD. “I had a very hard time teaching him myself. He basically lost nearly two years of school. It has had a very bad impact on his academics, and it is so sad to see how much he now struggles in the classroom.”\n\n“My son graduated high school in 2020, followed by three semesters of online college courses,” wrote a California mother who was diagnosed with ADHD at the same time as her teen. “He recently dropped out of school because he was so tired of online learning.”\n\nFor students who receive services through a 504 Plan or IEP, the impact of remote learning appears particularly harsh. More than half of caregivers report that the delivery of their child’s accommodations has been poor or very poor over the last two years. Initially, hurdles with remote learning were to blame; now parents are citing resourcing and staffing shortages as the primary problem.\n\n“There is not enough staff. Not enough support. Not enough resources. Not enough time in the school day,” wrote one educator in Wisconsin.\n\n“The enrollment at my son’s school dropped below projected numbers as families moved their kids to private school or opted to continue with virtual learning,” wrote the mother of a 2nd-grade student with ADHD in Canada. “This enrollment decrease resulted in the letting go of the school’s dedicated resource teacher, who was supposed to help support my son. Even though he has an IEP, he hasn’t received all the support we were expecting him to receive this year.”\n\nFurther impeding access to services is the fact that ADHD diagnoses appear to have risen significantly during the pandemic. Roughly 35% of survey respondents say their child was diagnosed with ADHD in the last two years, and nearly 23% report their child was diagnosed with a co-existing condition such as a learning difference or anxiety. Living, learning, and working together 24/7 during the lockdown helped many caregivers recognize the symptoms and challenges of ADHD in their children — and themselves.\n\n“Myself, my daughter, and my granddaughter have all been diagnosed with ADHD in the past two years,” wrote the grandmother of a kindergarten student in Nevada.\n\nFor families like this one who are getting up to speed on ADHD and navigating the IEP or 504 Plan process for the first time in a pandemic, real gains are few and far between. For other families, a discontinuity in services during the pandemic has proven difficult to remedy even with the return to in-person learning.\n\n“I believe the teachers and administrators are dealing with such a tremendous increase in the kids that have special needs that it’s harder for them to track and implement the plans that are in place,” wrote the mother of middle and high school students with ADHD.\n\n“Some accommodations were not available during remote learning and re-establishing the plans now that we’re back to in-person learning has been difficult because some accommodations are no longer applicable since kids have moved from elementary to middle and high school.”\n\nThe Social and Psychological Impact of COVID\n\nOf course, not all challenges are academic. Nearly 55% of ADDitude readers report that their kids’ social skills and friendships are worse now than they were two years ago. Half say mental health has deteriorated. And a whopping 80% report that screen usage has worsened during the pandemic.\n\n“He has struggled to hang out with friends in person, and he has taken to gaming online with his friends instead,” wrote the mother of a high school senior with ADHD. “All of that has led to his lack of sleep, his increased screen time, and his lack of physically hanging out with his friends.”\n\n“It’s become painfully apparent to me that my kids are now lost without screens,” wrote one Canadian mother of two. “I spend my days kicking them off one screen only to find them on another. My 6th grader has experienced a big loss of initiative (entertaining himself without a screen) and patience, and he’s gained 30 pounds.”\n\nOnly 17% of parents report an improvement in their kids’ physical health over the last two years. For most, limited access to sports and other recreational activities in 2020 and 2021 set a bad precedent that’s been difficult to break. Thankfully, the outlook for this coming summer vacation is improved. Only 11% of survey respondents feel their child’s summer will be significantly different from pre-pandemic summers; 7% expect it to be completely back to normal and 40% predict it will be more normal than not. Likewise, 56% of parents believe that the 2022-2023 school year will be nearly or totally back to normal.\n\n“I want this to be over so badly, and I want to stop worrying about it, and I want to go back to normal — but I also don’t want us to live in denial and avoid dealing with a situation that requires ongoing attention and vigilance,” wrote one mother of two in Canada. “It’s an exhausting load of contradictory thoughts and feelings and desires and worries to live with every day, on top of the ongoing demands of parenting small children during a global pandemic.”\n• Read This: All the Joys I Never Knew I Was Missing\n• Understand: How the Pandemic Triggered Trauma Responses in ADHD Brains\n\nSUPPORT ADDITUDE\n\n Thank you for reading ADDitude. To support our mission of providing ADHD education and support, please consider subscribing. Your readership and support help make our content and outreach possible. Thank you.", "opengraph": {"type": "article", "title": "Two Years Inside a Pandemic: A COVID Timeline of ADHD Brains in Distress", "url": "https://www.additudemag.com/covid-timeline-adhd-brains-mental-health/", "description": "“Why have anxiety and overwhelm increased as COVID fears have dropped? The pandemic has scarred us deeply over the last two years, and those wounds will take time to heal.”", "article:published_time": "2022-03-10T21:05:29+00:00", "article:modified_time": "2023-04-18T18:01:46+00:00", "site_name": "ADDitude", "image": "https://i0.wp.com/www.additudemag.com/wp-content/uploads/2022/03/pexels-will-mu-3810141-scaled.jpg", "image:width": "1200", "image:height": "814", "image:alt": "COVID Timeline for ADDitude readers", "locale": "en_US"}, "tags": ["ADHD in a Pandemic", "Best of 2022", "ADDitude's Pandemic Surveys"], "tweets": [], "movies": [], "links": ["https://www.additudemag.com/pandemic-anxiety-adhd-survey/", "https://www.additudemag.com/adhd-rules-for-life-pandemic-lessons/", "https://www.additudemag.com/back-to-normal-reentry-anxiety-adhd-adults-children/", "https://www.additudemag.com/tag/survey/?src=embed_link", "https://www.additudemag.com/screen-time-limits-during-pandemic/?src=embed_link", "https://www.additudemag.com/category/adhd-add/related-conditions/", "https://www.additudemag.com/adhd-emotional-dysregulation-stories/", "https://www.additudemag.com/remote-learning-loss-adhd-students/", "https://www.additudemag.com/category/parenting-adhd-kids/school-learning/ieps-504-plans/", "https://www.additudemag.com/coronavirus-adhd-families-one-year-report/?src=embed_link", "https://www.additudemag.com/joy-in-isolation-adhd-woman/?src=embed_link", "https://www.additudemag.com/trauma-coronavirus-adhd/?src=embed_link", "http://additu.de/subscribe/", "https://www.additudemag.com/road-trip-hacks-adhd-families/", "https://www.additudemag.com/resilience-child-strengths-responsibility-adhd/"], "authors": [], "publish_date": "2022-03-10T21:05:29+00:00"}