{"result_id": "011029", "URL": "https://www.additudemag.com/coronavirus-adhd-families-one-year-report/", "timestamp": "2023-04-25 11:55:39 CEST+0200", "meta": {"description": "One year after the NBA shut down and Tom Hanks’ coronavirus infection, parents of children with ADHD are feeling cautiously optimistic about the summer ahead.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.additudemag.com/wp-content/uploads/2020/02/cropped-additude-favicon-512x512-1.png?resize=480%2C270px&ssl=1", "canonical": "https://www.additudemag.com/coronavirus-adhd-families-one-year-report/", "encoding": "UTF-8"}, "image": null, "domain": "www.additudemag.com", "title": "Cautious Optimism is Making a Comeback", "cleaned_text": "One year ago today, the United States ground to an abrupt and shocking halt. Tom Hanks announced he had coronavirus, the NBA canceled everything, and the World Health Organization declared a global pandemic. By Friday the 13th, most schools and workplaces were emptied. Shortly thereafter, ADDitude deployed the first of 13 community check-in surveys, all of which began the same way: ADHD brings emotional intensity. Please check all of the following emotions you are feeling now.\n\nNotably — and not surprisingly — the headline emotions among ADHD adults and caregivers were:\n• Overwhelmed or exhausted: 48% to 75% of ADDitude readers selected this option over the last year\n• Worried or anxious: 48% to 70% of ADHD adults and caregivers\n• Sad or depressed and lonely: 35% to 50% of respondents\n\nHowever, in ADDitude’s latest survey of 3,134 families and individuals living with ADHD, deployed March 1, we noticed one emotion making a comeback: optimism. Though it peaked briefly at 31% late last April, optimism has been in free-fall for most of the last year, hitting a low of 15% in late July. Now, one-quarter of ADDitude readers report feeling cautiously optimistic about the future and 37% of readers say they feel less concerned about the pandemic than they did one month ago — up significantly from a dismal 8.4% in July.\n\nIn America, hope is following on the heels of a nationwide vaccine rollout — despite many reports of long waits and frustrating web sites. One-quarter of ADDitude readers are partially or fully vaccinated now, and another 61% say they plan to get vaccinated when eligible to do so. Still, caution levels remain high.\n\n“Even with being fully vaccinated I am continuing to follow all CDC safety guidelines,” wrote an adult newly diagnosed with ADHD in Texas. “My spouse is an unvaccinated essential worker, so I am trying to keep them safe and also I believe it’s important to model mask-wearing because community people can’t tell I’m vaccinated just by looking at me. I feel like it’s irresponsible to ignore the safety guidelines, and we don’t know yet how well the vaccines can prevent infection from variant strains.”\n\n[Read the Results of ADDitude’s First Pandemic Survey from April 2020]\n\nSummer: Less Different Than Last Year, But Not ‘Normal’\n\nThe scientific community knows far more about COVID-19 than it did one year ago, however new, unanswered questions continue to appear and fuel this caution: Can vaccinated people still ‘shed’ the virus? Will all of the vaccines protect against all of the strains? Will we need booster shots? When will children become eligible for a safe vaccine? Will communities see spikes as mask mandates are ended? Can we ever truly reach herd immunity?\n\nPersistent uncertainty is, perhaps, becoming a more familiar emotion. But that doesn’t mean it’s any less unsettling. For most ADDitude readers, that means taking baby steps toward a return to ‘normalcy.’\n\nWe asked both caregivers and adults with ADHD this question: On a scale of 1 to 10, how close to ‘back to normal’ do you expect your summer will be? (1 = vastly different than pre-pandemic summers; 10 = no different than pre-pandemic summers) And the results were very consistent: 4.57 for adults and 4.94 for parents. In other words, we are planning to do some of the things, but not all of the things. And we will still be doing them with masks and hand sanitizer.\n\n[Read: 10 Rules for Life That Have Emerged from the Pandemic]\n\n“I used to be highly social, attending large gatherings several times a week plus get-togethers with friends,” wrote one parent with ADHD in North Carolina. “I used to take multiple beach trips with friends. This year I’m anticipating seeing a friend a week or so. No group beach trips or large gatherings. I hate it.”\n\n“We have been extremely careful during the pandemic — no visits with family, trips, etc.,” wrote one woman with ADHD in Michigan. “If my husband and I are able to get the vaccine, I am hoping we can visit people and take some small trips this summer, though we will still likely avoid crowds and inside activities as a vaccine won’t be available to our children by then.”\n\n“Travel is a distant dream now,” wrote one young adult with ADHD and anxiety. “I will have to first replenish what meager savings I had that were depleted and wait for herd immunity to set in before any travel plans are formulated.”\n\nFinances are a limiting factor for many adults and families heading into the spring and summer. Due to job loss, sickness, and reduced hours, many survey respondents said money is tight this year. And this may partially explain why only 21% of children with ADHD are currently enrolled in a summer camp or program for 2021.\n\n“I don’t know if we will be able to send our child to camp, given our lack of funds from having to shut down our business during the pandemic,” wrote one adult with ADHD who said her child’s summer in Delaware will be vastly different than years past. “Our summer plans will be cleaning out our household and selling everything we can to save our house. Our 11-year-old son is going around the neighborhood looking for jobs with our neighbors to help save our house instead of being able to play and have fun like children should.”\n\nHalf of children with ADHD will not attend summer camp or programs this year — some because of the cost, some because they’ve aged out of camp, but many because they just don’t feel comfortable yet with in-person activities — especially in regions of the U.S. that have held only remote school for the last year.\n\n“We are not comfortable having our children engaged in social activities until they can be vaccinated,” wrote a parent with ADHD raising a 3rd and 6th grader with ADHD in California. “They are too easily distracted to stay mindful of health and safety concerns.”\n\n“Our son is already enrolled in remote therapeutic boarding school to try and remediate anything from this disaster year,” wrote the parent of 6th and 10th graders with ADHD. “There is no room or disposable income for summer camp, plus we doubt summer camps would be safe at any rate.”\n\nDo We Need to Worry About ‘Catching Up?’\n\nAccording to ADDitude surveys, at least 36% of students with ADHD have remained at home learning for the last 12 months — down from nearly 90% one year ago. One-quarter have participated in a hybrid model with one or more days in school each week. And about 29% are currently in school in person — most after months of hybrid or remote learning.\n\nAs we’ve documented in past reports, online learning is ineffective and frustrating for many children and adolescents with ADHD. Attention is strained, motivation is bottoming out, assignments are missing, and grades are falling for many. Still, only 11% of parents plan to enroll their students in summer school or another academic program this summer; 17% will integrate informal learning into their summer days; and 42% said they will focus on “non-academic pursuits and priorities” instead.\n\n“So far, the only offering is for summer school in person ‘for students who struggled remotely and wish to improve their grades from prior classes,’ which sounds like a great opportunity,” wrote the parent of a high school freshman with autism spectrum disorder. “Her school is currently hybrid, but she is 100% remote and high risk so… I’m not sure if improving her straight Fs is worth exposing her to COVID and apparently I have to make the choice.”\n\n“I’d like her to be able to catch up on the subjects she’s missed out on, but it would be good if there was a less intense way of teaching her (i.e not at a screen all day, or in front of a teacher who doesn’t know how to make a subject interesting),” wrote the parent of an 8th grader with ADHD in the UK.\n\n“I believe that students need a mental break from the demands of school and life this summer,” wrote the parent of an 11th grader with ADHD in New York. “We as adults are overwhelmed. Our children do not live in sheltered boxes and, no matter how well we continue to adapt, they feel stress (sometimes not knowing why) just like we do but without the benefit of wisdom.”\n\nFor other families, enrollment in an ADHD specialty camp is a better investment for the summer — an opportunity to work on social skills and executive functions away from the house. About 6% of families say they plan to enroll in just such a camp, though some are waiting to read formal safety protocols and mask policies first.\n\nOther families are following the advice of countless ADHD experts and empowering their kids to follow their passions (which are, ideally, not exclusively video games) this summer.\n\n“The summer and vacations are when one of my ADHD children (the more inattentive one) really enjoys life. She takes art, sports, animal husbandry, drone flying, whatever she likes!” wrote the mother of 3rd and 6th graders with ADHD. “My other child (the more hyper one) struggles with the social aspects of vacation programs and has been kicked out on occasion. He is happiest in school and at home.”\n\n“Last summer, because camp was closed, we let him start a new hobby: go-karting,” wrote the mother of a 9th grader with ADHD in New York. “He is actually awesome at it, so that ended up filing our entire summer and fall. We will be racing again this year May to November. Thank goodness. It has saved him and my husband with something to do four days a week.”\n\n“It will be different this year in the sense that I will be home for the first time in her 10 years,” wrote a mother of three who was formally diagnosed with ADHD during the pandemic. “I also struggle with ADHD and, though I don’t always see eye-to-eye with my daughter, I’m hoping we can build a better bond and work together to learn as much as we can about how ADHD affects us.”\n• Read: Healthy Habits Forged in a Pandemic: The Lifestyle Changes We Will Keep\n• Download: How to Choose the Best Summer Program for Your Child\n\nTHIS ARTICLE IS PART OF ADDITUDE’S FREE PANDEMIC COVERAGE\n\n To support our team as it pursues helpful and timely content throughout this pandemic, please join us as a subscriber. Your readership and support help make this possible. Thank you.", "opengraph": {"type": "article", "title": "Cautious Optimism is Making a Comeback", "url": "https://www.additudemag.com/coronavirus-adhd-families-one-year-report/", "description": "One year after the WHO pandemic declaration, nearly 37% of ADHD families are feeling more hopeful than they did a month ago — a stark improvement over the bleak 8.4% optimism rate of last summer. Still, just one-fifth of children with ADHD are registered for a summer camp or program right now. More than a quarter of parents remain undecided, as normalcy still feels a long way off. ", "article:published_time": "2021-03-11T16:36:09+00:00", "article:modified_time": "2022-07-09T23:37:43+00:00", "site_name": "ADDitude", "image": "https://i0.wp.com/www.additudemag.com/wp-content/uploads/2021/03/pexels-tetyana-kovyrina-1879288-e1649383494350.jpg", "image:width": "1084", "image:height": "687", "image:alt": "Child smells spring daffodil flower", "locale": "en_US"}, "tags": ["ADHD in a Pandemic", "Summer Learning Ideas for Kids with ADHD", "Pandemic Parenting", "ADDitude's Pandemic Surveys", "treating kids", "treating adults"], "tweets": [], "movies": [], "links": ["https://www.additudemag.com/tag/survey/", "https://www.additudemag.com/coronavirus-update-adhd-anxiety/", "https://www.additudemag.com/feeling-depressed-adhd-youth-quarantine/", "https://www.additudemag.com/adhd-introvert-extrovert-social-isolation/", "https://www.additudemag.com/tag/late-diagnosis/", "https://www.additudemag.com/lessons-learned-quarantine-adhd-brain/?src=embed_link", "https://www.additudemag.com/signs-of-anxiety-enduring-adhd-pandemic/", "https://www.additudemag.com/adhd-rules-for-life-pandemic-lessons/?src=embed_link", "https://www.additudemag.com/adhd-camp-and-school-guide/", "https://www.additudemag.com/tag/remote-learning/", "https://www.additudemag.com/quarantine-adhd-teens-learning/", "https://www.additudemag.com/screen-time-limits-during-pandemic/", "https://www.additudemag.com/webinar/teen-stress-adhd-podcast-342/", "https://directory.additudemag.com/listing/guide/adhd-ld-camps", "https://www.additudemag.com/vaccines-addadhd-and-autism/", "https://www.additudemag.com/healthy-habits-pandemic-adhd-adults/?src=embed_link", "https://www.additudemag.com/download/choosing-an-adhd-summer-camp/?src_embed_link", "https://www.additudemag.com/bouncing-off-the-walls-activities-adhd-kids/?src=embed_link", "/tag/coronavirus/", "/tag/coronavirus/", "http://additu.de/subscribe/", "https://www.additudemag.com/why-i-hate-grocery-shopping-adhd/", "https://www.additudemag.com/screen-time-tv-adhd-news-report/"], "authors": [], "publish_date": "2021-03-11T16:36:09+00:00"}