{"result_id": "011025", "URL": "https://www.additudemag.com/homeopathy-for-adhd-popular-remedies-scientific-evidence/", "timestamp": "2023-04-25 11:55:32 CEST+0200", "meta": {"description": "What are the best homeopathic remedies for ADHD? Read scientific research — along with reader reviews — on the most popular natural treatments from homeopathy.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.additudemag.com/wp-content/uploads/2020/02/cropped-additude-favicon-512x512-1.png?resize=480%2C270px&ssl=1", "canonical": "https://www.additudemag.com/homeopathy-for-adhd-popular-remedies-scientific-evidence/", "encoding": "UTF-8"}, "image": null, "domain": "www.additudemag.com", "title": "Homeopathic Remedies for ADHD: Research and Reviews of Natural Treatments", "cleaned_text": "What Are the Homeopathic Remedies for ADHD?\n\nIf you’ve ever wondered why ADHD — a condition often characterized by excessive hyperactivity — is best treated by medications that further stimulate the brain, then you’re already familiar with the concept of “like cures like,” the premise behind the alternative treatment homeopathy.\n\nHomeopathy has been around for more than 200 years; it was invented in 1796 by German physician Samuel Hahnemann. It involves taking substances that cause undesired symptoms in healthy people — like arsenic or tuberculosis bacteria — and diluting them hundreds or thousands of time in alcohol or water. The final product, known as a homeopathic, is primarily water — only miniscule amounts of the active ingredient remain. According to Hahnemann’s theory, this small amount works much like a vaccine would, triggering a symptom-reducing reaction in people who present with the disease already. Homeopathy rose to prominence in the 19th century, and though its popularity has since dwindled, it remains in use — in various forms — in countries all over the world.\n\nDespite its widespread popularity, homeopathy is considered little more than pseudoscience by many in the international medical community. Most well designed studies conclude that any positive effects seen from homeopathic remedies are the result of the placebo effect or the regression fallacy.\n\nIn 2009, the World Health Organization (WHO) issued an official statement1 specifically warning against the use of homeopathy for serious diseases like HIV, tuberculosis, or malaria. The Australian National Health and Medical Research Council, the United Kingdom’s House of Commons Science and Technology Committee, and the Swiss Federal Health Office have all separately concluded that homeopathic remedies are not effective, and have recommended that they not receive government funding. The UK National Health Service no longer funds homeopathic medicine, declaring it a “misuse of resources.”\n\n[Get Free Download: The ADDitude Guide to Alternative ADHD Treatment]\n\nNo specific statements have been issued regarding the use of homeopathy to address non-life-threatening conditions like ADHD, however, and some small studies have reported positive effects on ADHD symptoms from homeopathic remedies. Since homeopathics are mostly water, the risk of side effects is low — particularly when compared to stimulant medications.\n\nThat said, the American Academy of Pediatrics (AAP) recommends treating ADHD in children and adolescents aged 6 to 18 with FDA-approved medications, plus parent training in behavior modification and behavioral classroom interventions. Research studies like this one conducted by scientists at McGill University have found that “stimulant medications are most effective, and combined medication and psychosocial treatment is the most beneficial treatment option for most adult patients with ADHD.” All ADHD treatment decisions should be made in consultation and coordination with a licensed medical provider.\n\nStill, some with ADHD — especially those who wish to avoid or reduce their use of prescription medications — swear by homeopathic remedies for distractibility, impulsivity, and more symptoms.\n\nWhat Homeopathic Treatments for ADHD Are Best?\n\nA prominent feature of homeopathic medicine is that each patient will ideally receive an individualized treatment plan, tailored to his or her symptoms and biology. The homeopath (a professional specializing in homeopathy) assesses each patient with ADHD, and works to create a personalized mix of homeopathic substances designed to target his or her unique symptoms of inattention, hyperactivity, anxiety, or sleeping disorders. As such, it’s difficult to predict exactly which homeopathic remedies will work best for you or your child — or if they’ll work at all.\n\nBelow, we’ve outlined several of the most common homeopathic remedies used by individuals with ADHD; to find out more or to start a homeopathic treatment plan, seek out a trained homeopath in your area.\n\nMade from unroasted coffee beans, the homeopathic remedy coffea cruda claims to have the exact opposite effect as a cup of joe: it unwinds the mind instead of revving it up, and is most often used to combat sleeplessness and racing thoughts in children and adults with ADHD.\n\nADDitude blogger Kristen Caven describes coffea cruda as a “magic bullet” for herself and for her son, both of who have ADHD. “I take coffea cruda in the middle of the night when my heart is beating fast because I drank coffee at a dinner party,” she writes in a blog post. “My little guy, from about age 9 or 10, self-administers this remedy (it’s very safe) on nights when his thoughts race like sports cars in his head as he lies there in the dark.”\n\nCoffea cruda has been tested in a few small studies, including one that found that young adults with anxiety and trouble sleeping demonstrated less fatigue following nights that they were treated with coffea cruda, when compared to a placebo.2 The same study, however, found that the subjects woke up more frequently during the night when taking coffea cruda, and cycled between sleep stages more rapidly than they normally would. Other studies3 have found coffea cruda to be more effective than a placebo at managing chronic sleep problems, and one small Iranian study4 claimed that coffea cruda was more effective at managing sleep problems in young men than valerian, a popular herb used to treat sleeplessness.\n\n[Read This Next: All-Natural Ways to Improve Your Focus]\n\nSynaptol is a homeopathic liquid specially formulated for the treatment of ADHD in children and adults age 2 and older. It’s a mix of green oat grass (avena sativa), sweet violet (viola odorata), skullcap (scutelaria lateriflora), and several other herbs claimed by the manufacturer to improve attention and limit hyperactivity. Synaptol contains no alcohol or sugar, and advertises itself as gluten-free — a potential plus for anyone with ADHD whose symptoms are sensitive to certain foods or other similar triggers.\n\nADDitude reader “DrJoe” says Synaptol helped his son, who struggled with inattention and fatigue. “I think the prescription medications had made him worse because of the harsh side effects,” he writes. “He was always in a fog, tired, etc. I tried Synaptol, dropped the prescription drugs, and he got a lot better. It helped him focus without all the bad side effects… I asked him for an honest assessment, and he said that he was a lot better with Synaptol than with the prescription medication.”\n\nNo clinical studies have been done on Synaptol as a whole. Each separate component has been listed in the Homeopathic Materia Medica, a compilation of the results of Hahnemann’s “pathogenetic trials.” At least two small studies — both published in 20115 6 — found that green oat grass, in particular, can boost cognitive skills and concentration in adults. However, both of these studies used non-homeopathic levels of green oat grass; it’s unclear if the low levels present in Synaptol would have the same effect.\n\nDerived from a plant in the lily family, verat alb is used to “soothe the nerves,” and is often used for children with ADHD and comorbid anxiety. It has also been claimed to reduce the potential for temper tantrums in children who struggle to control their emotions. Like other plants used in homeopathy, verat alb is highly dangerous in large doses; in fact, recent hypotheses suggest7 that Alexander the Great was killed with verta alb, as opposed to arsenic — though historians remain divided on the issue.\n\nVerat alb is present in several homeopathic remedies designed to treat ADHD, including BrightSpark, a popular compound produced by the company Native Remedies. No studies have been conducted on either BrightSpark or verta alb on its own, and while anecdotal evidence is mixed, some patients report that verat alb helped their child manage his or her emotions and temper over-excitability.\n\n“For over 6 months I had my son on BrightSpark… I also added Triple Complex Mood Tonic to help ease irritability and mood swings,” says ADDitude reader “nessa.” “These products are in chewable, tiny pill form. I saw noticeable differences in son’s mood and hyperactivity levels in four days! (Although some children can take up to a few weeks to notice changes.)… These tabs have to be taken 3 times a day, since the body processes and eliminates as used. Therefore, the school will have to administer one to two of the daily doses. At my son’s school, I had to provide a script from our family doctor stating it was OK for son to take these natural meds, and directions on how to administer.”\n\nStramonium, derived from the herb Datura stramonium — also known as Devil’s snare — is intended to reduce aggressive or violent behavior, a common occurrence in children with ADHD or comorbid oppositional defiant disorder. Proponents also claim that it can be useful for children with post-traumatic stress disorder, or other forms of anxiety, in homeopathic doses. At high doses, however, stramonium can cause illusions, delirium, or, in rare cases, death.\n\n[You Might Also Like: 10 Foods (and Supplements and Vitamins!) to Boost Your ADHD Brain]\n\nA small 1997 study8 found that of several homeopathic remedies tested on children with ADHD, stramonium was among the most effective when compared to a placebo. However, the study was not truly double-blind, as it claimed; researchers were aware which subjects had been assigned to the homeopathic treatment and which were assigned to the placebo. Additionally, a large number of the children in the study were simultaneously taking Ritalin or other stimulant medications, potentially confounding the results.\n\nHyoscyamus — also known as hen-bane — is a nightshade that is a close relative of stramonium; it was found in the same 1997 study to be effective on ADHD symptoms. Like other members of the nightshade family, it is known to cause delusions or sickness when consumed in large amounts. In tiny homeopathic amounts, it is specifically recommended for fidgety, restless children — particularly those who struggle to control their outbursts.\n\nA 2005 randomized, double-blind study9 on 62 children with diagnosed ADHD found that a homeopathic blend — of which hyoscyamus was a significant part — showed improvement in symptoms of impulsivity, attention, and visual perception when compared to a placebo. However, the study excluded children who failed to respond to homeopathic remedies during a pre-trial evaluation period, indicating a potential bias in the final results.\n\nDo you have experience with a homeopathic remedy for ADHD? Share your feedback with the ADDitude community in the comments section below.\n\n1 Mashta, O. “WHO Warns Against Using Homoeopathy to Treat Serious Diseases.” BMJ, vol. 339, 24 Aug. 2009, doi:10.1136/bmj.b3447. \n\n 2 Bell, Iris R., et al. “Effects of Homeopathic Medicines on Polysomnographic Sleep of Young Adults with Histories of Coffee-Related In-somnia.” Sleep Medicine, vol. 12, no. 5, 2011, pp. 505–511., doi:10.1016/j.sleep.2010.03.013. \n\n 3 Harrison, C. C., et al. “The Effect of a Homeopathic Complex on Psychophysiological Onset In-somnia in Males: A Randomized Pilot Study.” Alternative Therapies in Health and Medicine, vol. 19, no. 5, 2013, pp. 38–43. \n\n 4 Hejazi, S., et al. “The Effects of Herbal Medicin and Homeopathic Remedy on In-somnia.” European Psychiatry, vol. 27, 2012, p. 1., doi:10.1016/s0924-9338(12)75515-3. \n\n 5 Berry, Narelle M., et al. “Acute Effects of an Avena Sativa Herb Extract on Responses to the Stroop Color-Word Test.” The Journal of Alternative and Complementary Medicine, vol. 17, no. 7, 2011, pp. 635–637., doi:10.1089/acm.2010.0450. \n\n 6 Dimpfel, Wilfried, et al. “Ingested Oat Herb Extract (Avena Sativa) Changes EEG Spectral Frequencies in Healthy Subjects.” The Journal of Alternative and Complementary Medicine, vol. 17, no. 5, 2011, pp. 427–434., doi:10.1089/acm.2010.0143. \n\n 7 Schep, Leo J., et al. “Was the Death of Alexander the Great Due to P0is0ning? Was It Veratrum Album?” Clinical Toxi(ology, vol. 52, no. 1, 2013, pp. 72–77., doi:10.3109/15563650.2013.870341. \n\n \n\n 9 Frei, Heiner, et al. “Homeopathic Treatment of Children with Attention Deficit Hyperactivity Disorder: A Randomised, Double Blind, Placebo Controlled Crossover Trial.” European Journal of Pediatrics, vol. 164, no. 12, 2005, pp. 758–767., doi:10.1007/s00431-005-1735-7.", "opengraph": {"type": "article", "title": "Homeopathic Remedies for ADHD: Research and Reviews of Natural Treatments", "url": "https://www.additudemag.com/homeopathy-for-adhd-popular-remedies-scientific-evidence/", "description": "Homeopathy has its critics, but many with ADHD believe it helps relieve symptoms of hyperactivity, inattention, and anxiety. Here, read scientific research — and ADDitude reader reviews — on some of the most popular homeopathic remedies for ADHD symptoms. ", "article:published_time": "2017-08-28T16:06:11+00:00", "article:modified_time": "2022-11-29T20:12:34+00:00", "site_name": "ADDitude", "image": "https://i0.wp.com/www.additudemag.com/wp-content/uploads/2017/08/Explore-Treatments_Homepathic-Remedies-for-ADHD_homeopathy-plants-bottle-dropper-illustration_ts-672546050-cropped.jpeg", "image:width": "1200", "image:height": "675", "image:alt": "Homeopathy tools used for the treatment of ADHD", "locale": "en_US"}, "tags": ["treating kids", "supplements", "treating adults"], "tweets": [], "movies": [], "links": ["https://www.additudemag.com/does-homeopathy-help-with-adhd-symptoms/", "#footnote1", "https://www.additudemag.com/download/alternative-adhd-treatment-guide/?src=embed_link", "https://www.cdc.gov/ncbddd/adhd/guidelines.html", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2518387/", "https://www.additudemag.com/why-my-kids-drink-wait-for-it-coffee/", "#footnote2", "#footnote3", "#footnote4", "https://www.additudemag.com/adhd-natural-remedies-for-focus/?src=embed_link", "https://www.additudemag.com/treatment/synaptol/", "#footnote5", "#footnote6", "#footnote7", "https://www.additudemag.com/adhd-supplements-foods-vitamins/?src=embed_link", "#footnote8", "#footnote9", "https://www.additudemag.com/new-study-omega-3s-improve-attention-hyperactivity-cognitive-function/", "https://www.additudemag.com/adhd-diet-plan-children/"], "authors": [], "publish_date": "2017-08-28T16:06:11+00:00"}