{"result_id": "011040", "URL": "https://www.additudemag.com/reviews/post/adhd-neurodiversity-in-the-workplace/", "timestamp": "2023-04-25 11:55:57 CEST+0200", "meta": {"description": "Reviews & Comments: Some companies embrace the benefits of neurodiversity in the workplace, but many do not. Here's what happened at the office when I revealed my ADHD.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.additudemag.com/wp-content/uploads/2020/02/cropped-additude-favicon-512x512-1.png?w=32&crop=0%2C0px%2C100%2C32px&ssl=1", "canonical": "https://www.additudemag.com/reviews/", "encoding": "UTF-8"}, "image": null, "domain": "www.additudemag.com", "title": "Reviews", "cleaned_text": "\n• Dear Tornadosiren87,\n\n Thank you for your cordial and considered response. You are very articulate and write well. You are very fortunate to have coworkers and who are accepting of ADHD. I am a guy in his pre-geezer years. Not to brag, but I believe that my best attribute is my IQ, which is a few points shy of Mensa qualification. I have a STEM education, an engineering degree. I am proud of it and worked damned hard to earn it. I have these things IN SPITE OF, NOT BECAUSE OF ADD. I have 40+ years of experience in the electrical power industry. I’ve worked for some 6 or 7 companies. In EVERY school and workplace there is always a bunch of jealous @$$holes who will weaponize an ADD confession. These are the same people who think that COVID is a hoax and that vaccines are dangerous. You will never be able to convince them otherwise. A sensible person will not tell his peers and colleagues how much he is being paid. A sensible person will not regale his friends and neighbors with details of his intimate life. So why take a chance and reveal your private health information, especially when no law requires you to? It’s no one else’s business.\n• I don’t usually reply to comments on my comments (yep, that looks just as confusing typed out as it did in my head. Oh well!), but I am going to respond to this one. ADDSecret, it sounds like you have had a bad experience with telling others about your diagnosis. My original post was from before I got my first job. Now that I am part of the workforce, as well as being an essential worker during the pandemic, I understand better where you are coming from. There are definitely people out there who will criticize you very harshly for having a diagnosis that makes it harder for you to pay attention. I have been blessed with an awesome team of coworkers (not just blowing smoke!), and almost all of them have been extremely supportive of my abilities. However, there are several (mostly older) coworkers who have not been as gracious. After I told them about my\n\n ADHD, there were several people that began to treat me as though I was a child, and as though I did not know how to do my job. That may not be the same as the way that your coworkers treated you, but the loss of respect was still hurtful. On the whole, though, I would say that many of my coworkers actually gained respect after hearing that I had ADHD and still worked very hard. My ADHD is somewhat beneficial in a faster-paced and physically involved job like mine, and I would like to think that my team members notice and appreciate that about me. I’m sorry that your experience has been different from mine.I know from experience that living in that kind of anger and bitterness is painful. I will pray for you to find peace, and that your coworkers will learn to appreciate the incredible qualities of a team mate with ADHD.\n• I want to add to my post above. From what I’ve seen there are very few lines of work and employers who will be understand and accepting anyone who has an mental illness problem. Maybe non-profit/charity organizations? Medicine? Education? I have always worked at for-profit high tech companies and I know WTF I’m talking about. These companies do not tolerate incompetence, mistakes, missed deadlines or any kind of mealy-mouth dissembling about mental illness problems. Their focus is solely on the bottom line. Because of ADD it was so hard to get my engineering degree but I had enough motivation and determination to do it. I have worked for over 40 years as an engineer and by dint of hard work I have gotten somewhere in this world. I am no PoS. I am high-functioning and have earned some respect by now. I’ve always known I’ve had a problem with being able to concentrate on whatever I was reading, especially deep technical stuff. Just last year at age 59 I was formally diagnosed with a double whammy of BP2 and ADD. Now I know the name of this honky mo-fo that’s been dwelling inside my own brain like a terrorist sleeper cell agent. I’m struggling to accept it but I don’t think I can. And this experience has left me feeling ashamed, insulted, bitter and angry, angry. There’s no cure for it. I am struggling to live with it. My goals are more modest. I very much appreciate ADDitude’s advice on how to recognize and squelch it before I do something stupid, although that is a work in progress. And I always appreciate advice on how to hide it; I’ve been doing that all my life. If I can accomplish these two goals I will be at peace with it. So, my advice is if you need help, get help. (I am seeing a mental health professional). Read ADDitude for their sympathetic ear and good advice. And don’t out yourself unless you want to sign the death warrant on your own career.\n• Yeah, for me it HAS been an embarrassing condition. Nothing good has happened to me because of it. This is no ****ing gift! Back in my terrible high school years I was the male class nerd and it was a miserable existence. My classmates thought I was eccentric but if my condition were to be publicly known my life would have been impossible; I would have had to transfer to a different school under an assumed name. College was tough. It took the average student 4 years but it took me 4 1/2 years to earn a BS in Mechanical Engineering. Professors assigned homework that they said would take only one hour but it usually took me twice as long. I was willing to stay up beyond midnight because I wanted a STEM education. Yes I have an above average IQ and have had a successful career as an engineer. I am the go-to guy for certain product lines but I’m not about to risk my hard won reputation by revealing a secret that would launch a whispering campaign, so get real. What if somebody has incurable gonorhea? Huh? HUH? Would anyone with any common sense wear a t-shirt that proclaims “I have gonorhea!” Uh, I didn’t think so.\n• ADHD is nothing that anyone should have to be ashamed of. It is not an “embarrassing condition” nor is it something that should ever be considered an “affliction” in any sense of the word.\n\n As a teenager with ADHD, I can tell you firsthand how painful it is when you trust someone with the knowledge of your diagnosis, and then experience rejection because of it. To me though, my ADHD is a God-given gift. My ability to hyperfocus gives me an immense amount of patience for tasks that would drive most people crazy. Being distractible means I can come up with creative solutions for mundane issues. And my hypersensitivity and high empathy mean I can see a two-faced person a mile away. ADHD is a gift, something to be proud of. Thank you, Mr Surratt, for a great article.\n• It’s a rare company that accepts and tolerates any sort of mental illness. I have had this ADD $#!+ and also BP2 since I was 6 years old and it has caused me many disasters in my business and social life. I got fired at least once because of this. Take it from someone who has BTDT, publicly revealing this to your boss will sign the death warrant on your career. And to add to the sting you will be ostracized and marginalized by your coworkers. To admit my condition at my workplace will wreck the good reputation that I have worked so hard to build over the years. I revealed to one of my neighbors that I have both ADD and BP2. Big mistake! He used to be friendly and cordial but now wants nothing to do with me. And, dig this: both he and his wife are psychiatrists!! If you need help, get help. There is no cure for this embarrassing condition. Read ADDitide for their wise counsel and excellent advice on how to compensate for and hide this affliction. So, keep a lid on it. Don’t be stupid and don’t be reckless. YOU WILL REGRET IT.", "opengraph": {"type": "article", "title": "Reviews", "url": "https://www.additudemag.com/reviews/", "article:published_time": "2022-12-14T15:51:56+00:00", "article:modified_time": "2022-12-14T15:51:56+00:00", "site_name": "ADDitude", "image": "https://i0.wp.com/www.additudemag.com/wp-content/uploads/2020/02/cropped-additude-favicon-512x512-1.png?w=512&crop=0%2C0px%2C100%2C512px", "image:width": "512", "image:height": "512", "locale": "en_US"}, "tags": ["Free ADHD Webinars", "Free Downloads", "Free Webinars", "New Issue!"], "tweets": [], "movies": [], "links": ["#comment-144220", "#comment-120663", "#comment-103362", "#comment-97428", "#comment-81263", "#comment-58162"], "authors": [], "publish_date": "2022-12-14T15:51:56+00:00"}