{"result_id": "011021", "URL": "https://www.additudemag.com/mentally-exhausted-pandemic-surge-capacity-adhd/", "timestamp": "2023-04-25 11:55:25 CEST+0200", "meta": {"description": "Feeling out of it and mentally exhausted by the ongoing pandemic? You may be experiencing surge capacity depletion, especially if you have ADHD.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.additudemag.com/wp-content/uploads/2020/02/cropped-additude-favicon-512x512-1.png?resize=480%2C270px&ssl=1", "canonical": "https://www.additudemag.com/mentally-exhausted-pandemic-surge-capacity-adhd/", "encoding": "UTF-8"}, "image": null, "domain": "www.additudemag.com", "title": "\"I Hit a Wall During the Pandemic — and I Climbed Over It.\"", "cleaned_text": "If you’re feeling psychologically and mentally exhausted right now, you’re not alone.\n\nAs a therapist who has ADHD, I felt a calling at the beginning of the pandemic. I told my colleagues, “I was born for times like these!” As my practice rose to and remained in overload, I threw myself into writing, building, and training. I reached out to frontline workers, volunteering my services to those in need. I worked week after week, feeling the exhilaration of being part of the solution to massive suffering. I was determined to overcome feelings of helplessness and fear by responding to the pandemic chaos in a productive way.\n\nThen it all came to a grinding halt. I grew weary and experienced something akin to burnout. My mood and energy drooped lower, and I decided to take some time off to figure out how I got to this point — and how to get myself out of it.\n\nFeeling Out of It: Surge Capacity Depletion\n\nDuring my self-reflective hiatus, I came across an article about something called “surge capacity depletion” (SCD). The article helped me get back on track, and it also helped me see how people with ADHD might fall prey to this malady and have even greater difficulty pulling out of it.\n\nAnn Masten, Ph.D., a psychologist at the University of Minnesota, described what she calls “surge capacity” as “…a collection of adaptive systems — mental and physical — that humans draw on for short-term survival in acutely stressful situations, such as natural disasters.” These adaptive systems are the personal and finite resources that sustain us in times of crisis and typically replenish once the crisis has passed.\n\n[Read: Why ADHD Brains Become Paralyzed in Quarantine]\n\nMost natural disasters have a relatively brief beginning, middle, and end. So, during a natural disaster, surge capacity is tapped for a relatively short period of time and, soon after, the restoring process begins. Until effective vaccines began to emerge, we were stuck for months at the beginning of the crisis, wondering where the middle was. We remained in the surge fight-or-flight mode for almost a year. For many, the capacity to cope deteriorated until the fuel gauge was empty.\n\nThat said, this pandemic has impacted different people in wildly different ways. As one popular meme says, “We aren’t all in the same boat; but we are all in the same storm.” Unemployed workers fare worse than those who kept their jobs. Parents working at home with children face stresses unlike those with no or grown children. Those living alone face a different social deprivation than do individuals in large households.\n\nFor nearly everyone, social distancing, quarantine, and other pandemic restrictions eliminated our typical “go-to” options for leisure, socialization, and restoration. We were depleted and had few ways to rejuvenate. This is surge capacity depletion. SCD hits at the greatest vulnerabilities of people diagnosed with ADHD.\n\nBy and large, the pandemic has exacerbated ADHD impulsivity, distractibility, and stimulation-seeking behaviors. College students lost traction and failed near the end of the semester, coming home exhausted and depleted. Secondary school students became overwhelmed and shut down from the stressful challenges of online classes. Parents experienced burnout, struggling to balance working at home with the academic needs of their children learning at home. Add ADHD to any one of these situations, and it goes from bad to worse.\n\n[Read: What Have You Learned About Your ADHD During the Pandemic?]\n\nFeeling Out of It: How I Snapped Back\n\nUnderstanding the surge capacity depletion principle, I began to regain control of my life and my energy.\n\nI set limits on my work. I established a waiting list and referred clients to colleagues. I began a disciplined practice of yoga, meditation, and breath work. I spent time and effort engaging in new pandemic-proof leisure opportunities — outdoor cookouts in covered park locations and socially distanced hikes. I set up regular Zoom meetings and other safe socialization with friends. I developed better sleep hygiene and nutritional habits.\n\nI heeded my own teachings. Self-care and management of personal resources are as important to success as are motivation, planning, and organization. I used these three strategies to address my needs:\n\n1. Establish “energy” check-ins. Video games feature a “life bar” that lets the player check their energy status at any time. I followed suit and started checking my real “life bar” several times a day. I’d ask myself questions like “Is my energy level going up or down? Is my energy going to the most important activities?” And “What will I do today to restore my energy?” I established breaks when I turned off my phone and did nothing.\n\n2. Conduct a stress inventory. Imagine objects are being dropped silently into a wagon you are pulling. Unless you turn around and look, you don’t know what you’re pulling or what they weigh. These objects can build up until you are unable to take another step. Stress works on us in this way. I added a “Stress Wagon Inventory” to my daily regimen that included naming the activities in my “wagon” and questioning whether I was pulling the most important objects. As a result, I dropped the habit of reading anxiety-inducing news feeds 15 to 20 times a day and set aside just one chunk of time at the end of the day.\n\n3. Tune in with emotions. Because unprocessed emotion can become a significant stressor, I began practicing an emotional check-in. Thousands of feeling words representing our emotions can be grouped under the heading of five basic categories: glad, sad, mad, afraid, and ashamed. The bane of human existence is that we can experience many of these emotions at once. Scaling them from one (least intense) to 10 (most intense) gives us an opportunity to sort emotions. Naming feelings in this way prevents a stressful buildup. I checked in with myself, a coworker, or a family member several times a day.\n\nThough we see the faint light at the end of the pandemic tunnel, we are months away from a return to normalcy. This may tempt some of us to surge anew. But surging again over a period of months is like trying to sprint a marathon. Focusing on managing and rebuilding resources is the best path to enjoying normalcy when it returns after the pandemic.\n• Read: “When Mental Fatigue Sinks Its Claws in to My ADHD Brain…”\n• Read: Healthy Habits Forged in a Pandemic — the Lifestyle Changes We Will Keep\n• Read: ADHD Fatigue in the Pandemic — What It Looks Like, How to Motivate\n\nTHIS ARTICLE IS PART OF ADDITUDE’S FREE PANDEMIC COVERAGE\n\n To support our team as it pursues helpful and timely content throughout this pandemic, please join us as a subscriber. Your readership and support help make this possible. Thank you.", "opengraph": {"type": "article", "title": "\"I Hit a Wall During the Pandemic — and I Climbed Over It.\"", "url": "https://www.additudemag.com/mentally-exhausted-pandemic-surge-capacity-adhd/", "description": "Pandemic fatigue is tangible and persistent. Many of us are feeling “out of it” and mentally exhausted right now, and with good reason: it’s called “surge capacity depletion,” or what happens when we endure stress for too long. Here’s how I learned how to restore my energy and mood.", "article:published_time": "2021-04-28T09:34:57+00:00", "article:modified_time": "2022-07-09T23:35:57+00:00", "site_name": "ADDitude", "image": "https://i0.wp.com/www.additudemag.com/wp-content/uploads/2021/04/Emotional-Tank_Thomas_1920x1080.jpg", "image:width": "1200", "image:height": "675", "locale": "en_US"}, "tags": ["Summer 2021 Issue of ADDitude Magazine", "ADHD in a Pandemic", "stress"], "tweets": [], "movies": [], "links": ["https://www.additudemag.com/adhd-rules-for-life-pandemic-lessons/", "https://www.additudemag.com/quarantine-burnout/", "https://elemental.medium.com/your-surge-capacity-is-depleted-it-s-why-you-feel-awful-de285d542f4c", "https://twin-cities.umn.edu/", "https://www.additudemag.com/polyvagal-theory-adhd-brain-cant-get-anything-done/?src=embed_link", "https://www.additudemag.com/what-is-adhd-symptoms-causes-treatments/", "https://www.additudemag.com/how-to-focus-adhd-child-homeschool/", "https://www.additudemag.com/adhd-life-pandemic-reflections/?src=embed_link", "https://www.additudemag.com/how-to-meditate-for-adhd-symptoms/", "https://www.additudemag.com/self-care-adhd-brains-quarantine/", "https://www.additudemag.com/after-the-pandemic-women-adhd/", "https://www.additudemag.com/mental-fatigue-adhd/?src=embed_link", "https://www.additudemag.com/healthy-habits-pandemic-adhd-adults/?src=embed_link", "https://www.additudemag.com/adhd-fatigue/?src=embed_link", "/tag/coronavirus/", "/tag/coronavirus/", "http://additu.de/subscribe/", "https://www.additudemag.com/family-communication-strategies-adhd-conflict-resolution/", "https://www.additudemag.com/doing-laundry-tips-adhd/"], "authors": [], "publish_date": "2021-04-28T09:34:57+00:00"}