{"result_id": "011003", "URL": "https://www.additudemag.com/back-to-normal-pandemic-adhd/", "timestamp": "2023-04-25 11:51:57 CEST+0200", "meta": {"description": "Returning back to normal is producing anxiety in adults with ADHD who feel calmer and more in control at home. A 9-point plan for re-entry with ADD.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.additudemag.com/wp-content/uploads/2020/02/cropped-additude-favicon-512x512-1.png?resize=480%2C270px&ssl=1", "canonical": "https://www.additudemag.com/back-to-normal-pandemic-adhd/", "encoding": "UTF-8"}, "image": null, "domain": "www.additudemag.com", "title": "What If ‘Back to Normal’ Is Terrifying?", "cleaned_text": "As a woman with ADHD, I’m a study in opposites. I love to experience life’s joys, travel the world, and talk to interesting people, but I am also an introverted recluse who is more than a little cozy in leggings and slippers all day. Confident that I’m not missing out on much these days, I am happy and secure at home.\n\nAnd, so, as the availability of vaccines shines a brighter light on our collective horizon, I am both cautiously optimistic and suffering from a serious case of F.O.O.N. — fear of the old normal.\n\nIn the old normal, time management was a mountain I climbed daily. Nestled at home, however, I don’t waste an hour choosing my outfit each day. That frantic feeling of rushing and worrying — about what I have to do or haven’t done — has practically disappeared. If I forget something important, chances are it’s just upstairs or, at worst, outside in my car. My ADHD brain has, for maybe the first time, found calm and at peace in a locked-down world with no choices, no decisions, no travel.\n\nThe tradeoff: I fear that I have become not only agoraphobic, but also anthropophobic. People, in general, make me jittery. When I’m walking my dog and see a person coming in my direction, I turn my back and cross the street. A trip to the grocery store provokes undue anxiety. I now almost exclusively order online for delivery. I watch movies from 2019 and cringe when I see crowds of people on airplanes, at sporting events, and dancing at weddings. And talking to my doctors on my cell phone without the hassle of parking lots and waiting rooms is the greatest. I jump out of bed, grab a coffee, and work while I wait. I feel genuinely calm, relaxed, and stress-free. The pandemic has given my ADHD a break.\n\nBut I can’t hide in my house forever. As more signs of reopening appear, it’s time to access my resilience and to create a plan to ease my ADHD brain back into the real world while not necessarily accepting the old normal as a foregone conclusion. Here is my list of rules for getting back to normal.\n\n[Healthy Habits Forged in a Pandemic: The Lifestyle Changes We Will Keep]\n\nPreparations are comforting. So is routine. Yet as a woman with ADHD, neither of these come naturally to me. I typically procrastinate or spend hours deciding how to move forward (without moving anywhere). But as a resident of hurricane territory, I have enough experience to know that taking action to prepare for an upcoming event eases discomfort. Formulating a plan provides me with a stabilizing sense of being in control, even if (and when) circumstances change in a blink.\n\nThis method is so simple and effective; it almost doesn’t make sense. When you name the emotion you’re experiencing, that uncomfortable feeling no longer has power over you. You’re the boss. The psychologist Dan Siegel calls this method “name it to tame it.” With ADHD, emotions appear fierce and without warning. When I slow down and name my feelings, I reclaim the reins.\n\nAfter you name your emotion, take the next step by sharing what you’re feeling. Expressing (in words) clarifies and lessens the unease of the negative emotion, which is a phenomenon we often see in talk therapy. Whether you write in a journal or talk to a friend, get the fears out of your head. With ADHD, we’re often the outsiders, thinking others are judging us for our quirky thoughts. When we share what we’re thinking, we realize we’re not so different. Our normal friends are feeling just as anxious as we are.\n\nMost of us take our breath for granted. We breathe without realizing how we can utilize a simple inhale and exhale to bring calm. Various breathing techniques are designed to help you slow down your heart rate or racing thoughts. My favorites are pranayama, QiGong, 4/7/8, or box breathing.\n\n[Read: How Could This Pandemic Change Me for Good?]\n\nIf your anxiety is high, enlist the help of a compassionate friend. If you’re worried about receiving the vaccine or navigating a more crowded store, find a supportive, cautious, vaccinated friend who can help you visualize success and lessen your fears.\n\nIf your anxiety is severe, hire a licensed professional. If not, consider practicing desensitization on your own. First, measure your anxiety on a scale of 1 to 10. Then slowly expose yourself to the discomfort. Every day, I force myself to go to the grocery store, the pharmacy, or Target. I do this because I’ve lost the energy and motivation to leave my home, but I know that’s not sustainable or healthy. Walking through those doors with my mask and a deep breath is my baby step.\n\nI know that meaningful gains come from pushing myself and my boundaries, but I also know that I have to be gentle with myself. It’s been a long, challenging year. Each person has navigated a distinct personal experience, emotionally and physically. Don’t judge yourself harshly; do be respectful of others. Be kind. Show empathy. Go slow.\n\nAt the outset of the pandemic, my home office was overflowing with paper piles. I used the time in my more flexible schedule to clear out the mess so I could get motivated again. It worked! To get my ADHD to work for me, I know I need to follow a structured program with deadlines. Since I prefer analog to digital, my system consists of notebooks, calendars, corkboards, and alarms. Your productivity system may look very different and that is fine, so long as it works for you and you can stick with it over the long haul.\n\nThe time I’ve had at home has been insightful and thought-provoking. Relationships have been tested. Others have improved. I’ve had the opportunity to take an honest look in the mirror — to see who I was, how I was functioning, and what I wanted to improve. One year later, I have a clearer picture of who I want to be and how to get there. As the old normal creeps back in, I resolve not to lose sight of this new, better me — and to resist the urge to fall back on old, unhelpful habits. This will be hard, and totally essential as I stare down my F.O.O.N.\n\nThe past year has allowed me time for a rare and precious activity: introspection without distractions from the outside world. I realized the old normal needed some upgrades — especially in regard to my ADHD. My new mindset is to focus on becoming more organized and structured with a maintenance plan. My relationships are my priority. Kindness and compassion have replaced ego desires. To be honest, I don’t want to go back to the way it was; I want to make it better after the pandemic. These “rules of life” are the start to my better me, what’s yours?\n\nBack to Normal with ADHD: Next Steps\n• Read: 7 Daily Intentions for Brains In Search of Structure and Purpose\n• Read: 11 Self Care Strategies for ADHD Brains in Quarantine\n• Read: 10 Rules for Life Crystallized by the Pandemic: ADHD Lessons Learned\n\nTHIS ARTICLE IS PART OF ADDITUDE’S FREE PANDEMIC COVERAGE\n\n To support our team as it pursues helpful and timely content throughout this pandemic, please join us as a subscriber. Your readership and support help make this possible. Thank you.", "opengraph": {"type": "article", "title": "What If ‘Back to Normal’ Is Terrifying?", "url": "https://www.additudemag.com/back-to-normal-pandemic-adhd/", "description": "“I feel genuinely calm, relaxed, and stress-free for perhaps the first time. The pandemic has given my ADHD a break, but I can't hide in my house forever. As more signs of reopening appear, it's time to access my resilience and to create a plan to ease my ADHD brain back into the real world while not necessarily accepting the old normal as a foregone conclusion.”", "article:published_time": "2021-04-14T09:25:56+00:00", "article:modified_time": "2022-07-09T23:48:43+00:00", "site_name": "ADDitude", "image": "https://i0.wp.com/www.additudemag.com/wp-content/uploads/2021/04/GettyImages-1139934778.jpg", "image:width": "1200", "image:height": "712", "image:alt": "Woman hiding behind wall a watching", "locale": "en_US"}, "tags": ["ADHD in a Pandemic", "routines"], "tweets": [], "movies": [], "links": ["https://www.additudemag.com/coronavirus-adhd-families-one-year-report/", "https://www.additudemag.com/time-management-skills-adhd-brain/", "https://www.additudemag.com/change-your-life-pandemic-adhd-advice/", "/back-to-normal-reentry-anxiety-adhd-adults-children/", "https://www.additudemag.com/healthy-habits-pandemic-adhd-adults/?src=embed_link", "https://www.additudemag.com/slideshows/adhd-emotions-understanding-intense-feelings/", "https://www.additudemag.com/deep-breathing-exercises-for-adhd-meditation/", "https://www.additudemag.com/women-adhd-pandemic-change/?src=embed_link", "https://www.additudemag.com/types-of-anxiety/", "https://www.additudemag.com/screener-generalized-anxiety-disorder-symptoms-test-adults/", "https://www.additudemag.com/self-compassion-adhd-adults/", "https://www.additudemag.com/slideshows/productivity-tips/", "https://www.additudemag.com/adhd-clutter-piles-paperwork-organization-help/", "https://www.additudemag.com/what-is-adhd-symptoms-causes-treatments/", "https://www.additudemag.com/after-the-pandemic-women-adhd/", "https://www.additudemag.com/adhd-rules-for-life-pandemic-lessons/", "https://www.additudemag.com/daily-structure-intentions-adhd-brain/?src=embed_link", "https://www.additudemag.com/self-care-adhd-brains-quarantine/?src=embed_link", "https://www.additudemag.com/adhd-rules-for-life-pandemic-lessons/?src=embed_link", "/tag/coronavirus/", "/tag/coronavirus/", "http://additu.de/subscribe/", "https://www.additudemag.com/adhd-medication-reminder-routines-alarms/", "https://www.additudemag.com/the-power-of-words-language-adhd/"], "authors": [], "publish_date": "2021-04-14T09:25:56+00:00"}