{"result_id": "011011", "URL": "https://www.additudemag.com/slideshows/what-are-learning-disabilities/", "timestamp": "2023-04-25 11:55:08 CEST+0200", "meta": {"description": "Learning disabilities are not linked to low intelligence or autism. They're not caused by neglect, vaccinations, or TV. Separate fact from fiction here.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.additudemag.com/wp-content/uploads/2020/02/cropped-additude-favicon-512x512-1.png?resize=480%2C270px&ssl=1", "canonical": "https://www.additudemag.com/slideshows/what-are-learning-disabilities/", "encoding": "UTF-8"}, "image": null, "domain": "www.additudemag.com", "title": "10 Damaging Myths About Learning Disabilities", "cleaned_text": "Myth 1: Learning disabilities are more common in people with low intelligence. False! By definition, a learning disability can only be diagnosed in someone with average or above-average intelligence. Those with learning disabilities often have a high IQ — however, the LD is holding them back from demonstrating their true intelligence in daily achievements.\n\nMyth 2: LD is only a problem in school settings. Not true. While learning disabilities certainly make school more difficult, their influence can extend beyond the classroom. Difficulties expressing yourself verbally can lead to social problems, and LD can hold people back in the workplace — particularly if their job is heavily linked to reading, writing, or math.\n\nThis is a common myth, but it simply isn’t true. Dyslexia comes in many forms, and while some people may experience word reversal (seeing “bat” as “tab,” for instance), not all dyslexics experience this. Some struggle with single letter reversal (reading “does” as “dose,” for example), while others have difficulties telling single letters apart or stringing multiple sounds together to form a word.\n\nMyth 4: Children with LD are just lazy or unmotivated. This myth plagues children with ADHD, too. A learning disability is not a character flaw, and children who struggle with LD are often trying as hard — or harder — than their peers. It’s important that parents and teachers offer support and understanding; otherwise, children with learning disabilities can develop low self-esteem or set low expectations for themselves and become apathetic about school and their future.\n\nMulti-ethnic teacher (20s) and preschool children (4 years) in classroom working with colorful wooden shapes. Myth 5: Accommodations give kids an unfair advantage; that’s why so many claim to have LD. Accommodations for LD mirror those for any other legal disability — they exist to level the playing field and help children with LD stand eye-to-eye with their peers. In reality, only 24 percent of college students with LD inform their schools about their condition — indicating that students are not eager to self-disclose, even when doing so would provide them with much-needed accommodations.\n\nJapanese woman (40s) showing daughter (6 years) how to fold paper into a flower. While researchers aren’t exactly clear what causes LD, they know what doesn’t cause it — and parental involvement in early childhood is not a factor. Other mythical causes of LD include vaccinations, bad teachers, or too much television.\n\nThis one is tricky. While more boys are diagnosed with learning disabilities (66 percent of children receiving accommodations in the United States are boys), experts believe that they actually affect both genders at the same rate. Girls may be flying under the radar, and may require closer observation and more proactive intervention.\n\nMyth 8: Glasses can help fix learning disabilities, particularly dyslexia. Learning disabilities have nothing to do with vision. Many parents assume that their child struggles with reading because he can’t make out the letters — and certainly vision tests should be conducted on all children to rule out potential problems — but dyslexia is a brain-based disorder, not a vision-based one.\n\nA woman with ADHD overcomes her learning disability and climbs mountains This is far from the truth! Many successful people have LD, including some famous folks — like Whoopi Goldberg, Jennifer Aniston, and Steven Spielberg. Success stories like these prove that LD challenges need not preclude a person from achieving the highest levels in society.\n\nMyth 10: Medication can be used to treat LD. Many people wrongly believe that learning disabilities can be treated with stimulant medications, much like ADHD. However, medications have no effect on learning disabilities. If the child also suffers from ADHD, stimulants can help control attention-related symptoms, but it’s important for the learning disability to be separately diagnosed — and treated.", "opengraph": {"type": "article", "title": "10 Damaging Myths About Learning Disabilities", "url": "https://www.additudemag.com/slideshows/what-are-learning-disabilities/", "description": "Learning disabilities are not linked to low intelligence or to autism. They aren't caused by parental neglect, vaccinations, or too much TV, either. Here, learn what are learning disabilities, and what absolutely are not.", "article:published_time": "2016-11-28T22:54:59+00:00", "article:modified_time": "2022-01-28T10:09:41+00:00", "site_name": "ADDitude", "image": "https://i0.wp.com/www.additudemag.com/wp-content/uploads/2016/12/171_6_Diagnose_Diagnosis_LD-Myths_SS_171_teacher-with-kids.jpg", "image:width": "1200", "image:height": "799", "image:alt": "A woman works with two children with learning disabilities", "locale": "en_US"}, "tags": ["diagnosing kids", "comorbid diagnoses"], "tweets": [], "movies": [], "links": ["https://www.additudemag.com/category/understand-conditions/related-conditions/learning-disabilities/", "https://www.additudemag.com/learning-disability-symptoms-test/", "https://www.additudemag.com/adult-adhd-learning-disabilities-dyslexia/", "https://www.additudemag.com/dyslexia-success-story-edward-hallowell/", "https://www.additudemag.com/i-believe-in-you-how-to-vanquish-a-childs-low-self-esteem/", "https://www.additudemag.com/slideshows/504-plan-accommodations-for-adhd/", "https://www.additudemag.com/adhd-in-girls-women/", "https://www.additudemag.com/category/understand-conditions/related-conditions/learning-disabilities/dyslexia/", "https://www.additudemag.com/slideshows/famous-people-with-adhd/", "https://www.additudemag.com/adhd-medication-for-adults-and-children/"], "authors": [], "publish_date": "2016-11-28T22:54:59+00:00"}