{"result_id": "011002", "URL": "https://www.additudemag.com/summer-camp-adhd-covid-2021/", "timestamp": "2023-04-25 11:51:56 CEST+0200", "meta": {"description": "Summer camps, including programs serving kids with ADHD and special needs, are planning to open in 2021. Learn about safety protocols and program information.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.additudemag.com/wp-content/uploads/2020/02/cropped-additude-favicon-512x512-1.png?resize=480%2C270px&ssl=1", "canonical": "https://www.additudemag.com/summer-camp-adhd-covid-2021/", "encoding": "UTF-8"}, "image": null, "domain": "www.additudemag.com", "title": "ADHD Summer Camps Will Likely Open – Safely and Differently – in 2021", "cleaned_text": "Summer camp — a universal rite of childhood — feels simultaneously decadent and essential, risky and healthy to many families this year.\n\nOne year after COVID-19 shut down everything, families are once again wondering how the summer season will shake out and hoping desperately for day and overnight camps to safely open again. Many families stressed by remote and hybrid learning are now seeing specialized camps — specifically those those serving children with ADHD, learning disabilities, and other conditions — as a lifeline and a reset for hopeful campers with Zoom fatigue.\n\nLast year, many U.S. camps chose to cancel in-person programming almost immediately, regardless of local regulations. At the same time, many residential summer camps that had been optimistic about operating with new safety protocols were ultimately forced to change course. Day camps and virtual programming comprised the vast majority of 2020 summer options.\n\nThis year, the outlook is sunnier. As COVID-19 vaccines become available to more and more adults and guidance improves on virus mitigation procedures, most summer camps – and families – are feeling more confident about in-person programming. Notably, overnight camp is a real possibility this summer season.\n\nWill Summer Camps Open in 2021? Largely, Yes.\n\nWho decides whether and how in-person summer camps, especially overnight ones, will operate this summer? In short, camps must comply with regulations set by their respective state, county, or local health departments. These regulations vary by region. Camps are also abiding by guidelines and best practices set by the American Camp Association (ACA) and the Centers for Disease Control and Prevention (CDC).\n\n[What Happened to ADHD Summer Camps in 2020? Read More Here]\n\nIn 2020, virtually all states permitted day camps to operate, albeit with strict health and safety protocols. While many states also permitted sleep-away camps to run, a handful of them — including New York, New Jersey, Connecticut, Illinois, and Oregon — did not. According to a survey conducted by the ACA, close to 60 percent of overnight camps did not open their doors in the summer of 2020, in large part due to state regulations such as these.\n\nSome states have already announced camp regulations for the 2021 summer season. Among those, New York has announced that it will allow overnight camps to operate – an early indication that other states with strict 2020 camp restrictions may follow suit.\n\nThis is not to say that all overnight camps will receive a green light to open. Local regulations hinge on factors like hospitalization and COVID-19 infection rates, and respective state reopening plans. The country continues to reach grim milestones and new cases hover around 70,000 per day — more than twice the number reported when ADDitude began reporting on summer camp cancellations last year. But as COVID-19 infection rates continue to drop, and the vaccine becomes available to more people, it is likely that in-person camps, including overnight camps in places previously restricted, will be allowed to operate by summer.\n\nThis is the overwhelming sentiment among the ADHD and specialized summer camps that discussed 2021 plans with ADDitude. With a year to plan, to devise alternative activities, and to learn from programs that successfully operated last summer, these camps are charging full steam ahead.\n\nWhat Will Summer Camp Look Like in 2021?\n\nMany camps are registering campers and finalizing their operating and contingency plans for 2021. Aiding camps this year are extensive, up-to-date guidelines from local authorities, the CDC, and the ACA – a significant difference compared to last year, when these guidelines were released near or after the start of the summer camp season.\n\nWhile camp approaches and timelines differ, many are outlining plans and having internal discussions with respect to:\n• Camper and counselor health screenings prior to arrival and symptom monitoring during the course of summer camp\n• Limiting the number of campers and staff on site, as well as movement in and out of campgrounds\n• Protocols in the event of a suspected or confirmed COVID-19 case\n\nSOAR, a specialty camp for children with ADHD and learning disabilities, is planning to run most of its overnight summer camp programs across the U.S, including in Wyoming and in North Carolina, its largest location.\n\nSOAR initially planned to open its summer camp last year but ultimately chose to cancel the 2020 program. “With the lack of information that we had, and the population we serve, we felt it was safest for our staff and our campers to not run,” said Andrea Wackerle, director of North Carolina programs for SOAR. While overnight camps were allowed to open statewide in 2020, guidelines stipulated that camps only accept campers from North Carolina and neighboring states. Since up to 40 percent of SOAR campers come from out-of-state, this regulation factored heavily.\n\nOver the past year, SOAR’s internal COVID task force has created and revised an operations manual for 2021. The camp is currently requiring campers and staff to complete a 14-day symptom monitoring document prior to arrival, and to provide proof of a negative COVID-19 test or of vaccination. Daily health checks will be the norm. Campers will be divided into small cohorts of eight campers to two staff members. Face masks are required when interacting with members of other cohorts and when social distancing isn’t possible. Multi-use areas and shared equipment will be sanitized with more frequency.\n\nSOAR is restructuring its programs to include more backcountry and camping activities rather than public-facing events like field trips to museums. “We want to create and provide a space for our campers where they can be kids and have fun, and where parents are not worrying about whether their campers are going to be safe,” Wackerle said.\n\nCamp Nuhop, based in Ohio and serving children with special needs, also plans on running its residential camp this summer. The state permitted overnight camps last year, but the non-profit ultimately chose not to open in 2020. “We’ve been able to put our toes in the water and think about operations,” said Trevor Dunlap, Camp Nuhop’s executive director, about camp this year. “The great thing is that we’ve been at this for 11 months.”\n\nThe camp is still creating its operating plan based on available guidance, but some measures are already in place. The camp, which sees up to 525 campers a summer from more than 20 states, will be cutting about 155 spots to encourage social distancing. A pre-camp health screening is also planned, and campers and staff will have to test for COVID-19 prior to arrival and pass a temperature and symptom screening on site. Staff will arrive well before programming starts and will manage strict on-site cleaning and hygiene protocols. Session dates, meanwhile, have also shifted to create a tighter “bubble” on campus. The camp’s operations plan will be posted in full on its website once finalized.\n\nWhat Happens If a Camper Gets Sick?\n\nCamps are no strangers to planning for sick campers and instilling procedures to mitigate disease transmission on campgrounds. With COVID-19, camps have ramped up these efforts and outlined protocols to follow in the event of exposure.\n\nSummit Camp & Travel, which operates a sleep-away summer camp in Pennsylvania for youth with social and emotional learning challenges, has outlined four alert levels ranging from one positive case to a camp-wide outbreak. If one camper in a bunk/cohort is suspected of having COVID-19, the Level One protocols would require all campers in the bunk to be isolated and tested while the bunk is disinfected and sanitized.\n\nSummit Camp took in about 220 campers last summer and saw no positive cases. Shepherd Baum, the camp’s director, is confident that Summit can achieve the same results this year. “It wasn’t easy, but we did it,” he said. “The same thing I keep coming back to is to have a plan for every scenario you can imagine.”\n\nThis year, the camp will mail at-home tests, which the campers must complete and submit before arrival. Upon arrival, campers will be tested again. In-person visiting days have been cancelled and replaced with video check-ins. Day trips out of camp are also off the table, and camp staff are not permitted to leave campgrounds – their off-days will be spent at a designated cabin, with an entertainment and recreational program created uniquely for them.\n\nWill Canadian Camps Allow U.S. Residents?\n\nCamp Kodiak welcomes campers with ADHD, autism, and learning disabilities to its base in Ontario, Canada. It is anticipating that the province will reverse course and permit overnight camps to run in 2021. “All signs point to go,” said Ilana Stoch, director of the camp.\n\nStoch is also hopeful that Canadian border policies will change to allow foreign nationals, including U.S. citizens, to enter the country for leisure activities. About 35 percent of Camp Kodiak participants are from the U.S. “We are really hopeful that we’ll be in a good place for the start of the summer,” she said.\n\nShould I Send My Child to Camp This Summer? What to Know\n\nAcross the board, camps are confident that local authorities will permit day and overnight programs this year, and that they can operate safely while keeping campers engaged and happy. At the same time, camps are seeing a surge in registrations, signaling that families are also more comfortable and confident this summer. “We’re seeing the highest enrollment at this point in time that we have ever had,” Wackerle said.\n\nIf socializing and screen-free, outdoor activities were important for children in 2020, they are doubly or triply important this year – especially for children who have been home-bound since March 2020. “I think it’s the most vital summer for kids with special needs to get out and to be at a camp,” said Baum. “It’s also great for the parents’ sanity as well.”\n\nThe decision to send your child to summer camp is deeply personal. Here are some factors to consider.\n• No two states, counties, or local health departments may have the same regulations for camp opening and operations.\n• Wondering if camp staff will be vaccinated? Vaccine rollout is also dictated by local authorities – one state may extend eligibility to camp workers well before summer, while others may not. Camps are keeping a close eye on vaccine eligibility in their states, and hiring staff based on this, too.\n• Some states may have mandatory quarantine guidelines for travelers outside of the state. Check before sending your camper, and consider what testing and screening may be needed before the trip back home.\n• Many camps have increased prices to compensate for the additional resources needed to mitigate COVID-19 risks and the registration reductions needed to allow for greater social distancing.\n• Camps have varying cancellation and refund policies. Some are offering full refunds until certain dates, while others are refunding a portion of payments depending on proximity to the camp start date.\n• Guidelines from local authorities, the ACA, and the CDC are just that – guidelines. It’s ultimately up to the camps to implement them as they see fit. The “best” camps will opt for practices that put the camp at the lowest risk for COVID-19 spread.\n• Camps are updating their websites with COVID-19 mitigation plans. Read through these plans (check for updated dates), and reach out camps with any questions. Attend online information sessions if available.\n• While many overnight camps saw few COVID-19 cases in 2020, some did see outbreaks (face masks are thought to have played a major role in keeping outbreaks to a minimum).\n\nTHIS ARTICLE IS PART OF ADDITUDE’S FREE PANDEMIC COVERAGE\n\n To support our team as it pursues helpful and timely content throughout this pandemic, please join us as a subscriber. Your readership and support help make this possible. Thank you.", "opengraph": {"type": "article", "title": "ADHD Summer Camps Will Likely Open – Safely and Differently – in 2021", "url": "https://www.additudemag.com/summer-camp-adhd-covid-2021/", "description": "Will summer camps open this year? In short, yes. Most day, overnight, and specialized ADHD camps are confident they will welcome campers — with COVID tests, face masks, and other safety protocols — in a few months. Learn more about how camps are planning a fun, safe summer for kids (and parents) who desperately need a break.", "article:published_time": "2021-02-24T20:34:12+00:00", "article:modified_time": "2022-07-09T23:37:45+00:00", "site_name": "ADDitude", "image": "https://i0.wp.com/www.additudemag.com/wp-content/uploads/2021/02/GettyImages-1268430668.jpg", "image:width": "1200", "image:height": "799", "image:alt": "Summer camp for kids with ADHD – Children wearing face masks", "locale": "en_US"}, "tags": ["Summer Learning Ideas for Kids with ADHD", "activities"], "tweets": [], "movies": [], "links": ["https://www.additudemag.com/tag/remote-learning/", "https://www.additudemag.com/slideshows/adhd-summer-camps-checklist-for-kids/", "https://www.acacamps.org/", "https://www.cdc.gov/", "https://www.additudemag.com/summer-camp-adhd-coronavirus/?src=embed_link", "https://www.acacamps.org/sites/default/files/resource_library/research/CampCounts2020-Report_2-12.pdf", "https://www.nytimes.com/2021/02/21/us/coronavirus-deaths-us-half-a-million.html", "https://www.additudemag.com/adhd-summer-camps/?src=embed_link", "https://soarnc.org/", "https://www.additudemag.com/slideshows/types-of-learning-disabilities-overview/", "https://nuhop.org/", "https://www.summitcamp.com/", "https://www.campkodiak.com/", "https://www.additudemag.com/what-is-adhd-symptoms-causes-treatments/", "https://www.additudemag.com/what-is-autism-spectrum-disorder-asd/", "https://www.cdc.gov/mmwr/volumes/69/wr/mm6935e1.htm", "https://www.cdc.gov/mmwr/volumes/69/wr/mm6931e1.htm", "https://www.additudemag.com/slideshows/adhd-summer-camps-checklist-for-kids/?src=embed_link", "https://www.additudemag.com/adhd-camp-and-school-guide/?src=embed_link", "https://www.additudemag.com/help-choosing-summer-camp/?src=embed_link", "/tag/coronavirus/", "/tag/coronavirus/", "http://additu.de/subscribe/", "https://www.additudemag.com/adhd-depression-link-symptoms-diagnosis-treatments/", "https://www.additudemag.com/college-students-with-adhd-risks-outcomes/"], "authors": [], "publish_date": "2021-02-24T20:34:12+00:00"}