{"result_id": "011017", "URL": "https://www.additudemag.com/slideshows/travel-tips-for-adhd-families-make-vacation-fun-again/", "timestamp": "2023-04-25 11:55:16 CEST+0200", "meta": {"description": "Forgot your passport? Got lost on the way to the hotel—twice? ADHD can quickly turn any vacation from fun to torture. Stay on track with these travel tips.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.additudemag.com/wp-content/uploads/2020/02/cropped-additude-favicon-512x512-1.png?resize=480%2C270px&ssl=1", "canonical": "https://www.additudemag.com/slideshows/travel-tips-for-adhd-families-make-vacation-fun-again/", "encoding": "UTF-8"}, "image": null, "domain": "www.additudemag.com", "title": "Vacations Are Supposed to Be Fun, Right?!?", "cleaned_text": "You've earned this vacation. You've worked incredibly hard for this one precious week away from your everyday stress. So don't blow it by sending your ADHD family members into a tailspin. Build structure and clear expectations into your holiday with these traveling tips, plus learn to keep track of everything you'll need along the way.\n\nIf you're not traveling to visit family, pick a destination that fits your children's interests. Make sure the location incorporates activities that everyone can enjoy – with lots of outdoor running-around opportunities for kids with ADHD. Involve your kids in the planning process. Give them a map, and have them research one interesting place to visit at your destination or on the way.\n\nMark the calendar with your departure date, and tell kids in advance. Give your children an itinerary. Include a schedule that covers meals, bathroom breaks, and naps. Children with ADHD do best with structure and routine; travel will go the most smoothly when you create it. Explain if you'll be spending the night, where your child will sleep, and how long you'll stay.\n\nThree women wearing red and baking together If you're going to stay with relatives during the holidays, print out pictures of who you'll be visiting. Tell your child stories about them to ease anxiety about new people, and make everyone feel more comfortable once you arrive. Prepare your relatives by explaining typical ADHD issues, and how you'll respond so they will be more understanding of any behavior troubles.\n\nMake sure that kids know that your usual behavior rules apply, even on vacation. Then, add additional rules just for the trip, like Gameboy is allowed during the ride, but not during family dinners. Teach kids strategies to cope when problems occur, like \"Stop, Think and Relax.\" Remind them of your relatives' house rules. Role-play any potential problem areas so kids are equipped with a plan for how to react. [Read This Next: The Best Vacation Spots for ADHD Families]\n\nUse one main packing checklist that covers all the documents, clothing, toiletries, miscellaneous items, and gadgets you'll need so you don't leave anything behind. Make sure not to overpack – stick to one suitcase per person for each week you're away. Pare down the clothes you'll need by bringing versatile items like black pants, and stain removal pens instead of extra sweaters. Keep items you always need like a travel umbrella, first-aid kit, and a lint brush stored in your suitcase all year round.\n\nUse the U.S. State Department web site to learn any visa and vaccination information you'll need to know before you go. Pack your travel and reservation information, credit cards, money, passport, medications and a change of clothes in a carry-on for easy access. Make copies of important items and prescriptions in case they're lost or stolen.\n\n7. Use Your Cell Phone to Remind You Use your cell phone as your personal reminder system. Leave yourself voice messages with PIN numbers, where you parked at the airport, or hotel address and booking information. Don't identify the information. If you want to remember a PIN of 1795, leave a message that you found the shoes Suzie wanted on sale for $17.95. Then, just delete the information when you don't need it anymore.\n\nFamily With Two Young Children Checks in at an Airport If you're flying, dress to make security easy, and give each person a gallon-sized Ziploc bag to use so emptied pocket items don't go missing. Use the sandwich technique with Dad or an older child going first, then younger children, followed by Mom so no one wanders off. Use the time before boarding to burn off extra ADHD energy walking around the airport. Put a copy of your itinerary and cell phone number in kids' pockets in case you get separated.\n\nThree girls (6-8 years) sitting on rear seat of car during road trip Pack an entertainment bag, and have kids help pick out items like books, puzzles, and hand-held games to include. Bring snacks. Add a ball or Frisbee so you can give kids physical activity during rest stops. If your son can't stop talking, give him a tape recorder to talk into, and make a verbal diary of the trip. Use a reward chart that shows the rules of the road, and award stars or treats for good behavior. Offer up praise for good behavior early. Don't wait until the acting out starts to chime in.\n\nOvertired kids are cranky kids, and not getting enough sleep can exacerbate ADHD symptoms. You might be staying up later on vacation, but try to stick to normal bedtimes and go-to-sleep routines whenever possible. Make sure to remember the times of day that your child is usually tired, and plan accordingly to avoid meltdowns. Avoid unnecessary trips to the store by having supplies shipped to your destination or ordering groceries to be delivered.", "opengraph": {"type": "article", "title": "Vacations Are Supposed to Be Fun, Right?!?", "url": "https://www.additudemag.com/slideshows/travel-tips-for-adhd-families-make-vacation-fun-again/", "description": "\"The passports should be in this bag!\" \"What confirmation code?\" \"Can we just turn around and go home?\" Sound familiar? Vacations aren't always perfect. In fact, they can be downright exhausting and stressful — especially when ADHD comes along for the ride. It doesn't have to be this way, though, with these sure-fire travel tips!", "article:published_time": "2016-11-28T22:50:53+00:00", "article:modified_time": "2022-04-14T00:52:16+00:00", "site_name": "ADDitude", "image": "https://i0.wp.com/www.additudemag.com/wp-content/uploads/2016/11/146_1_Adult_Travel_Family-Vacation_SS_146_Toy-car-on-map-scaled.jpg", "image:width": "1200", "image:height": "800", "image:alt": "A depiction of a family on vacation and benefiting from smart travel tips.", "locale": "en_US"}, "tags": ["activities", "Summer Learning Ideas for Kids with ADHD"], "tweets": [], "movies": [], "links": ["https://www.additudemag.com/great-escapes/", "https://www.additudemag.com/get-packing/", "https://www.additudemag.com/treating-adhd-with-exercise/", "https://www.additudemag.com/download/adhd-schedules-family-routines/?src=embed_ss", "https://www.additudemag.com/best-vacation-spots-adhd-families/", "https://travel.state.gov/content/travel.html", "https://www.additudemag.com/download/master-packing-list/?src=embed_ss", "https://www.additudemag.com/slideshows/adhd-summer-schedule-gone-haywire-how-to-survive-a-vacation/?src=embed_ss"], "authors": [], "publish_date": "2016-11-28T22:50:53+00:00"}