{"result_id": "011022", "URL": "https://www.additudemag.com/staying-connected-teens-pandemic/", "timestamp": "2023-04-25 11:55:26 CEST+0200", "meta": {"description": "Staying connected socially during the pandemic is difficult for many teens with ADHD. Here, learn how parents can help relieve isolation.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.additudemag.com/wp-content/uploads/2020/02/cropped-additude-favicon-512x512-1.png?resize=480%2C270px&ssl=1", "canonical": "https://www.additudemag.com/staying-connected-teens-pandemic/", "encoding": "UTF-8"}, "image": null, "domain": "www.additudemag.com", "title": "Q: My Teen Is Increasingly Isolated. How Can I Help Foster Social Connections?", "cleaned_text": "Q: “My son seems much less engaged in his life and with us since the pandemic started. He spends most of his free time in his room on TikTok or playing games on his phone. How can I help him practice and keep up his social skills during social isolation?”\n\nA: Adolescents are trying to figure out who they are, where they belong, and what’s most important to them. These tasks are often aided by engaging with other people. Interacting with peers allows them to try on different identities or personas to develop a sense of self. During the pandemic and its social isolation, parents are noticing that teens with ADHD are spending a lot of time in their rooms, don’t come down for meals, and aren’t staying connected with peers as they did before. Many kids with and without ADHD are floundering, whether they are energetic extroverts or independent introverts.\n\nYour teen is experiencing intense disappointment and discouragement. Adolescents have lost the social contexts that helped define who they are and the main way they’re able to connect with peers is now online. But being online in school or social gatherings increases a person’s visibility, which can make some kids feel more self-conscious and insecure. Your face is big and everybody can see what you are doing and how you’re reacting.\n\nTeens who are normally tentative or uncomfortable with their social skills may well shut themselves off rather than deal with the exposure from online communication. We need to help brainstorm ways they can connect with friends in meaningful ways online and in-person. Kids are tired and worn down and may not be able to rally on their own. Work with them instead of telling them what to do. Small steps may be all they can handle right now. Explore whether there is a Google Hangout group they can join, or a Facebook group of teens interested in similar hobbies. The site playingcards.io lets a group of people play virtual card games, chess, and checkers, for example.\n\nIf your teen struggles with social anxiety or making friends, set up a couple of “have-tos” during the week. This list could include calling someone outside of your household, like a grandmother or a cousin. Or they could choose someone with whom they’ve had a connection in the past — on a sports team, in a club, or during summer camp — and brainstorm how they could reach out to them now. Setting up virtual interactions with extended family can be a good option for more socially anxious teens that still allows them to do something on their own and practice social skills.\n\nAnother daily practice that can boost the confidence of an anxious or insecure teen is self-care. Right now, many teens are thinking, “What’s the point? Who cares if I don’t take a shower? Who cares if I wear the same clothes to bed that I wore all day?” Try to encourage your teen to meet a bare minimum of self-care and hygiene. That might include showering once a day or putting on clean clothes that are different from their pajamas. Managing these small tasks will help them feel better about themselves.\n\nIt’s important to remind your teen that there’s a light at the end of the tunnel. Make plans for activities that can happen after your teen has been vaccinated. Until then – keep looking for the happy medium.\n\nThe content for this Q&A came from the ADHD Real-Time Support Group session hosted by Dr. Saline titled Click here“No Teen Is an Island.”\n• Read: “When the Lazy Days of Summer Are Too Lazy”\n• Learn: Will My Child Ever Have a Best Friend?\n\nSUPPORT ADDITUDE\n\n Thank you for reading ADDitude. To support our mission of providing ADHD education and support, please consider subscribing. Your readership and support help make our content and outreach possible. Thank you.", "opengraph": {"type": "article", "title": "Q: My Teen Is Increasingly Isolated. How Can I Help Foster Social Connections?", "url": "https://www.additudemag.com/staying-connected-teens-pandemic/", "description": "The social lives of teens can be dizzying, often fraught with drama, and yet critical to personal growth and development. Staying connected with their peers amid a pandemic has been particularly challenging. If your teen with ADHD is struggling to cement and maintain relationships, learn how to help them build social skills now. ", "article:published_time": "2021-04-12T09:57:49+00:00", "article:modified_time": "2022-07-08T16:28:44+00:00", "site_name": "ADDitude", "image": "https://i0.wp.com/www.additudemag.com/wp-content/uploads/2021/04/GettyImages-1227410089-e1617273931875.jpg", "image:width": "1200", "image:height": "801", "locale": "en_US"}, "tags": ["ADHD in a Pandemic", "ask the experts", "treating teens", "ADHD experts", "Celebrate Their Spark"], "tweets": [], "movies": [], "links": ["https://www.additudemag.com/adhd-symptoms-in-teens/", "https://www.additudemag.com/what-is-adhd-symptoms-causes-treatments/", "https://www.additudemag.com/i-believe-in-you-how-to-vanquish-a-childs-low-self-esteem/", "https://www.additudemag.com/cool-kids-adhd/", "https://playingcards.io/", "https://www.additudemag.com/adhd-teenage-social-anxiety/", "https://www.facebook.com/295157883845/videos/258064419061847", "https://www.additudemag.com/inside-the-mind-teen-with-adhd/?src=embed_link", "https://www.additudemag.com/summer-activities-for-teens/?src=embed_link", "https://www.additudemag.com/help-your-child-make-friends/?src=embed_link", "http://additu.de/subscribe/", "https://www.additudemag.com/hybrid-learning-school-transitions-adhd/", "https://www.additudemag.com/adhd-medication-reminder-routines-alarms/"], "authors": [], "publish_date": "2021-04-12T09:57:49+00:00"}