{"result_id": "011038", "URL": "https://www.additudemag.com/vaccine-rates-children-with-autism-siblings/", "timestamp": "2023-04-25 11:55:53 CEST+0200", "meta": {"description": "Despite no link between vaccines & autism, research finds that children with autism, as well as their siblings, are missing out on critical vaccinations.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.additudemag.com/wp-content/uploads/2020/02/cropped-additude-favicon-512x512-1.png?resize=480%2C270px&ssl=1", "canonical": "https://www.additudemag.com/vaccine-rates-children-with-autism-siblings/", "encoding": "UTF-8"}, "image": null, "domain": "www.additudemag.com", "title": "Children with Autism — and Their Siblings — May Be Less Likely to Get Critical Vaccines, Study Says", "cleaned_text": "The medical and scientific communities agree: vaccinations do not cause autism spectrum disorder (ASD). Still, anti-vaccination sentiments persist in the U.S., and a new study1 finds that children with ASD and their siblings are less likely than others to be vaccinated, placing them at greater risk for dangerous — but highly preventable — diseases.\n\nThe large study looked at vaccination records for nearly 600,000 children in Colorado, California, Oregon, and Washington who were born between 1995 and 2010. Of those children, almost 4,000 had been diagnosed with autism. Researchers also tracked and reviewed the vaccination records for the subjects’ younger siblings, born between 1997 and 2014.\n\nOnly 82 percent of the children with autism spectrum disorder received their recommended vaccinations between the ages of 4 and 6, compared to about 94 percent of the children without autism. The younger siblings of children with ASD fared even worse: only 76 percent of that group received all of their critical first year shots, compared to 84 percent of children whose older siblings didn’t have autism. The younger siblings were comparatively less likely to receive shots during any time period, in fact, starting from birth and continuing up until age 12.\n\nA 12-point difference on a measure like this is highly significant, the researchers said, given the large sample size and widespread accessibility to vaccines in the U.S. Children who aren’t vaccinated face significantly higher risk of preventable diseases, the researchers said, but they’re not the only ones put in danger by a missed vaccination. “Herd immunity,” which requires most members of a community to be vaccinated, protects its most vulnerable members — including those who are unable to be vaccinated for legitimate health reasons.\n\n“In order to disrupt the chains of infection in a population, a large portion of the population needs to be immune to the infection,” said Ousseny Zerbo, Ph.D., the lead author of the study. “A higher vaccination rate can break those chains of infection. This is why it is important for a large proportion of the population to be vaccinated.”\n\nThe anti-vaccination movement relies heavily on a single study, published more than 20 years ago. The study was later retracted — and the lead researcher, Andrew Wakefield, struck from the United Kingdom’s medical register — as it was determined much of its data had been falsified. Anti-vaccination sentiments stemming from this study have been linked to outbreaks of measles, whooping cough, and other preventable diseases across the United States. While some states allow parents to exempt their child from vaccines for any reason, others — including California — have moved to require parents to seek legal exemptions if they want to avoid vaccinating their children.\n\nThough the researchers can’t say for sure why parents of children with autism are choosing not to vaccinate their children, it’s likely that anti-vaccination ideas play a role, they said. The next step will be to determine the exact cause for the vaccine disparity — and figure out how to improve vaccination rates among children with autism, their siblings, and other at-risk groups.\n\n“We need to better understand how to improve vaccination levels in children with autism spectrum disorder and their siblings, so they can be fully protected against vaccine-preventable diseases,” said co-author Frank DeStefano, a researcher at the Center for Disease Control and Prevention, which funded the study. It was published March 26 in JAMA Pediatrics.\n\n1 Zerbo, Ousseny, et al. “Vaccination Patterns in Children After Autism Spectrum Disorder Diagnosis and in Their Younger Siblings.” JAMA Pediatrics, 26 Mar. 2018, doi:10.1001/jamapediatrics.2018.0082.", "opengraph": {"type": "article", "title": "Children with Autism — and Their Siblings — May Be Less Likely to Get Critical Vaccines, Study Says", "url": "https://www.additudemag.com/vaccine-rates-children-with-autism-siblings/", "description": "Despite numerous, peer-reviewed studies finding no link between childhood vaccines and autism spectrum disorder, alarming new research finds that children with autism, as well as their siblings, may be missing out on childhood vaccinations, thanks in large part to widespread vaccine skepticism.", "article:published_time": "2018-03-30T06:00:06+00:00", "article:modified_time": "2022-02-17T22:07:21+00:00", "site_name": "ADDitude", "image": "https://i0.wp.com/www.additudemag.com/wp-content/uploads/2017/02/understand-conditions-adhd-research-and-news.png", "image:width": "1200", "image:height": "675", "image:alt": "The latest information, research, and news on conditions related to ADHD", "locale": "en_US"}, "tags": ["treating kids", "autism", "related conditions"], "tweets": [], "movies": [], "links": ["https://www.additudemag.com/autism-spectrum-disorder-symptoms-test-children/", "#footnote1", "https://jamanetwork.com/journals/jamapediatrics/article-abstract/2676070", "https://www.cbsnews.com/news/vaccine-myth-persists-as-families-affected-by-autism-refuse-shots/", "https://www.bmj.com/content/342/bmj.c5347", "https://www.washingtonpost.com/national/health-science/despite-measles-outbreak-anti-vaccine-activists-in-minnesota-refuse-to-back-down/2017/08/21/886cca3e-820a-11e7-ab27-1a21a8e006ab_story.html?utm_term=.df493cca9b3e", "https://www.dailytelegraph.com.au/news/nsw/antivaxxers-anger-parents-amid-whooping-cough-outbreak-on-nsw-north-coast/news-story/b0f07635b3fca13ada570eba1862af99", "https://www.cbsnews.com/news/california-governor-signs-strict-new-vaccination-law/", "https://www.eurekalert.org/pub_releases/2018-03/kp-cwa032218.php", "https://www.cdc.gov/", "https://www.additudemag.com/brain-scans-preschoolers-adhd-study/", "https://www.additudemag.com/shire-scholarship-deadline-college-adhd/"], "authors": [], "publish_date": "2018-03-30T06:00:06+00:00"}