{"result_id": "011043", "URL": "https://www.additudemag.com/reviews/post/homeopathy-for-adhd-popular-remedies-scientific-evidence/", "timestamp": "2023-04-25 11:56:03 CEST+0200", "meta": {"description": "Reviews & Comments: What are the best homeopathic remedies for ADHD? Read scientific research — along with reader reviews — on the most popular natural treatments from homeopathy.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.additudemag.com/wp-content/uploads/2020/02/cropped-additude-favicon-512x512-1.png?w=32&crop=0%2C0px%2C100%2C32px&ssl=1", "canonical": "https://www.additudemag.com/reviews/", "encoding": "UTF-8"}, "image": null, "domain": "www.additudemag.com", "title": "Reviews", "cleaned_text": "\n• It seems most of the people are not able to come out of the hype of allopathic medicine for the cure of the disease, which can be easily argued. My mother is diabetic and was diagnosed 20 years back. Initially she was put on 1 tablet a day for the problem which has gone up to 15 tablets a day plus insulin injections. This shows how much deterioration has been done by these chemicals which are feed to her. My son 12 is an ADHD. As a typical ADHD its is difficult for him to stay at one place and focus. We struggled almost for 10 years with different allopathic medicines with less desired results. His hyperactivity increased with age and a time came it was practically impossible for us to control him during meltdowns which was result of the medicines. I took an desperate step of complete shifting to homeopathic treatment last year and has seen positive change in my son. at least the best part is without sedations tablets his hyperactivity has come down by more then 70%.\n• how can anyone say anecdotal evidence doesn’t count?\n• Whoever wrote this article was obviously not a homoeopath (or maybe some layperson transcribed it. There is no homoeopathic remedy called ‘Verta alb’. Judging from the Alexander the Great reference the remedy referred to would be Veratrum album (Abbrev. Verat alb).\n\n Also: Most of these remedies I are the kind to be prescribed only by a qualified practitioner who knows what they are doing.\n• “Whoever wrote this article was obviously not a homoeopath (or maybe some layperson transcribed it. There is no homoeopathic remedy called ‘Verta alb’.” It appears there is: VERTA ALB AND ARSEN IOD: HOMEOPATHIC TREATMENT FOR ADHD\n• I’m really sorry but this advice makes me hesitate to explore the rest of your website. Stating that homeopathy has its critics is like saying that the belief in a flat earth is not fully accepted. Homeopathy has been shown over and over again to be exactly equivalent to placebo, because it does not have any active ingredient. You have a responsibility to provide helpful and accurate information, as there is a real lack of resources for people with ADD or ADHD and their families. How can be confident in this website if there isn’t a basic respect for scientific accuracy. “And regardless of research, many with ADHD — especially those who wish to avoid or reduce their use of prescription medications — swear by homeopathic remedies for distractibility, impulsivity, and more symptoms.” Regardless of research????? Do you mean to say that this website values anecdotal evidence over actual research? If so, then you need to reevaluate your approach to providing advice couched in scientific language. Anecdotal evidence is only valuable as a starting point for more rigorous research. In the case of homeopathy, this has already been conducted ad infinitum, and where the studies are large enough and high quality enough to be trusted, no benefit to homeopathy has ever been demonstrated.\n• Thank you for explaining that homeopathy is no more than water. However, shame on you for presenting the “false balance” that there is any credence to homeopathy. This article only clouds the discussion on ADHD treatment my inserting pseudoscience and adding to the stigma of treating ADHD with medicine. Homeopathy is nothing like a vaccine and it is not “primarily” water. Even IF the “active” ingredient in a homeopathic remedy were proven effective, the dilutions are ridiculous. Any dilution past 12C, means it is mathematically unlikely or impossible for even a molecule of the ingredient to remain.\n• Great article, and long overdue! Homeopathy is such a different paradigm than Western Medicine, which dismisses alternatives and controls the narrative by not studying remedies that do not have corporate money behind them. Yet, because homeopathy is so effective, so inexpensive, and so easily administered, it has become more widely available in the marketplace, as witnessed by the changes in the cough and cold remedy aisles in drug stores over the past decade… common OTC drugs have become more controlled or banned for their dangers, and homeopathics are evident in nearly half of the remedies. There are many books that go into greater depth on treating ADHD with homeopathy, such as Ritalin Free Kids. Here’s my blog on coffee & coffea cruda: https://www.additudemag.com/why-my-kids-drink-wait-for-it-coffee/ and another one on sleep remedies: https://www.additudemag.com/child-adhd-sleep-routine-bedtime-help/", "opengraph": {"type": "article", "title": "Reviews", "url": "https://www.additudemag.com/reviews/", "article:published_time": "2022-12-14T15:51:56+00:00", "article:modified_time": "2022-12-14T15:51:56+00:00", "site_name": "ADDitude", "image": "https://i0.wp.com/www.additudemag.com/wp-content/uploads/2020/02/cropped-additude-favicon-512x512-1.png?w=512&crop=0%2C0px%2C100%2C512px", "image:width": "512", "image:height": "512", "locale": "en_US"}, "tags": ["Free ADHD Webinars", "Free Downloads", "Free Webinars", "New Issue!"], "tweets": [], "movies": [], "links": ["#comment-40840", "#comment-27915", "#comment-40839", "#comment-7555", "#comment-7578", "#comment-7321", "#comment-7233", "https://rationalwiki.org/wiki/Homeopathy", "#comment-7212", "https://www.additudemag.com/why-my-kids-drink-wait-for-it-coffee/", "https://www.additudemag.com/child-adhd-sleep-routine-bedtime-help/", "#comment-7579"], "authors": [], "publish_date": "2022-12-14T15:51:56+00:00"}