{"result_id": "011020", "URL": "https://www.additudemag.com/reviews/post/toys-everywhere-kids-clean-up", "timestamp": "2023-04-25 11:55:22 CEST+0200", "meta": {"description": "Reviews & Comments: A mom can dream, but when raising three children with ADHD, a “little bit less messy” is the ultimate goal in her house.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.additudemag.com/wp-content/uploads/2020/02/cropped-additude-favicon-512x512-1.png?w=32&crop=0%2C0px%2C100%2C32px&ssl=1", "canonical": "https://www.additudemag.com/reviews/", "encoding": "UTF-8"}, "image": null, "domain": "www.additudemag.com", "title": "Reviews", "cleaned_text": "I laughed at the memories your comment enlisted, that came cascading through my mind, of Saturday mornings in my house full of kids (8) and the Saturday morning clean up.. Boys Toys were not part of it as they never made it up from the basement , too dangerous with two sets of stairs. Each of us were allowed one toy in our shared room as there were only 4 bedrooms. Toys found elsewhere disappeared for months at a time.\n\n Youngest, my job at age four began with dusting the upper stairs which had picket railings and each picket had to be individually cleaned. Competition at least among the boys was used repeatedly to motivate, that and praise. Finish first and subject to inspection there were always rewards if nothing more than going outside to play and a pat on the ego. As soon as I aced the raillings, dusting my mom and dads dresser and makeup table and mirror set were added. As we aged, sweeping the kitchen, dusting the tables in the other rooms, vacuuming the stairs, wiping down the lamps, and light switches, and scores of other chores were added. At least 2 or 3 of the others were ADHD as I was.\n\n The girls would be gathering the bed linens for wash day and remaking the beds with fresh linen. They were also washing down everything in the kitchen and bathroom. My next older sister had died in 1944 of Scarlet fever as it was known then (strep throat ) In an age of no effective anti biotics or vaccines, that was the real consequence of communicable diseases like Measles, Tuberculosis, Polio, etc. Mom was driven to make sure it didnt take another one of us.\n\n Breakfast for all of us included coffee which I was constantly told would stunt my growth. Apparently it helped us concentrate. Dad was 5’9’ and I ended up tallest 6’1. Mom, who organized this, had learned a thing or two in her youth on the farm caring for three different hard to corral groups of chickens, pigs, and cows and two younger brothers.\n\n We numbered 12 in total and i am sure each one had added something to the routine. Corporal punishment was still a reward 65 years ago and the distractions of TV, internet, video games and cell phones didnt exist. Dad, who at one time was a semi-professional baseball pitcher in his youth, while working at anything that paid in the depression and mom were quick to box our ears if we sassed . Believe me it was something we learned quickly to avoid.\n\n As I look back I cant imagine any of these focus and concentrate routines would work in todays world . BUT we were known in the neighborhood as maintaining a pristine house .", "opengraph": {"type": "article", "title": "Reviews", "url": "https://www.additudemag.com/reviews/", "article:published_time": "2022-12-14T15:51:56+00:00", "article:modified_time": "2022-12-14T15:51:56+00:00", "site_name": "ADDitude", "image": "https://i0.wp.com/www.additudemag.com/wp-content/uploads/2020/02/cropped-additude-favicon-512x512-1.png?w=512&crop=0%2C0px%2C100%2C512px", "image:width": "512", "image:height": "512", "locale": "en_US"}, "tags": ["Free ADHD Webinars", "Free Downloads", "Free Webinars", "New Issue!"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2022-12-14T15:51:56+00:00"}