{"result_id": "011026", "URL": "https://www.additudemag.com/medication/amantadine/", "timestamp": "2023-04-25 11:55:34 CEST+0200", "meta": {"description": "Amantadine is an antiviral drug used to prevent certain types of the flu, treat Parkinson's disease, and off-label to treat symptoms of ADHD in some patients.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.additudemag.com/wp-content/uploads/2020/02/cropped-additude-favicon-512x512-1.png?resize=480%2C270px&ssl=1", "canonical": "https://www.additudemag.com/medication/amantadine/", "encoding": "UTF-8"}, "image": null, "domain": "www.additudemag.com", "title": "Amantadine", "cleaned_text": "Amantadine (brand name: Symmetrel) is an antiviral drug used to prevent certain types of the flu by stopping the virus’s growth, and to treat respiratory symptoms of the flu. It is not a substitute for a flu vaccination. The CDC does not recommend treating the flu with amantadine in the U.S. because of a developed resistance caused by the circulating strains1.\n\nAmantadine is also used to alleviate symptoms of Parkinson’s Disease such as tremors. It is thought to work by stimulating the production of dopamine. Increased dopamine can also help symptoms of ADHD; it is sometimes used off-label to treat ADHD symptoms in some patients. This use is not approved by the FDA, but studies suggest that treatment plans developed by William Singer, M.D. and Dr. Roger Cohen effectively improved executive functioning and sensory integration with low doses of amantadine2. A study found some beneficial effects of amantadine for children with ADHD, as well3.\n\nHow to Use Amantadine\n\nBefore starting or refilling an amantadine prescription, read the medication guide included with your pills, as it may be updated with new information.\n\nThis guide should not replace a conversation with your doctor, who has a holistic view of your medical history, other diagnoses, and other prescriptions. If you have questions, ask your doctor or pharmacist before you begin taking the medication.\n\nAs with all medications, follow your amantadine prescription instructions exactly. Amantadine is available in two formulations:\n• Tablets are available in 100mg dosages. Tablets should be swallowed whole with water or another liquid.\n• Syrup: A clear, raspberry flavored liquid. The liquid should be measured with the included device and swallowed entirely with water or another liquid. Every 5mL (teaspoonful) contains 50mg of amantadine.\n\nThe optimal dosage varies by age, weight, and condition treated. That said, the typical dose for adults is 100mg, twice daily. A reduced dose is recommended for pediatric patients under age nine, and elderly patients with renal or liver impairment.\n\nHowever, for patients with ADHD, Dr. Singer found that starting with a 25mg dosage, and then increasing gradually by 25mg increments until you or your child reaches the best response — that is, the lowest dosage at which you experience the greatest improvement in symptoms without side effects2. Work with your physician to determine the correct dosage.\n\nThe most common side effects of amantadine are blurred vision, nausea, dry mouth, dizziness when standing, and insomnia.\n\nOther serious side effects include fatigue and increased intense sexual or gambling urges.\n\nTaking amantadine may impair your ability to drive, operate machinery, or perform other potentially dangerous tasks. If side effects are bothersome, or do not go away, talk to your doctor. Most people taking this medication do not experience any of these side effects.\n\nReport to your doctor any heart-related problems or a family history of heart problems. Patients with congestive heart failure or peripheral edema have developed heart failure while taking amantadine. Call your doctor immediately if you experience warning signs such as chest pain, shortness of breath, or fainting while taking amantadine.\n\nShare a history of seizures with your physician. Patients with epilepsy or other seizure conditions can experience an increase in seizure activity when taking amantadine.\n\nAlso disclose to your physician all mental health issues including any family history of suicide or depression. Amantadine may create new or exacerbate existing mental health problems or suicidal ideation. Call your doctor immediately if you experience new or worsening mental health symptoms including confusion, depression, agitation, hallucinations, paranoia, or other psychotic reactions.\n\nPatients being treated for Parkinson’s disease should not stop taking amantadine abruptly. It can cause delirium, agitation, delusions, hallucinations, paranoid reaction, stupor, anxiety, depression, and slurred speech.\n\nDose reduction or withdrawal from amantadine therapy can also cause neuroleptic malignant syndrome (NMS). This is a rare, but serious condition that can cause a stroke resulting in death. If you experience high fever, sweating, rigid muscles, confusion, or changes in breathing or heartbeat, these could be warning signs of NMS and you should seek medical help at a hospital immediately.\n\nThe above is not a complete list of potential side effects. If you notice any health changes not listed above, discuss them with your doctor or pharmacist.\n\nStore amantadine in a secure place out of the reach of children, and at room temperature. Do not share your amantadine prescription with anyone. Sharing prescription medication is illegal, and can cause harm.\n\nYou should not take amantadine if you are allergic to amantadine or have untreated angle closure glaucoma.\n\nIf you’re thinking of becoming pregnant, discuss the use of amantadine with your doctor. The effect of amantadine on fertility is unknown. Animal studies suggest potential risk to the fetus when taken during pregnancy. It is recommended that mothers do not nurse while taking amantadine, as it is unsafe for infants, and amantadine passes into breastmilk.\n\nBefore taking amantadine, discuss all other active prescription medications with your doctor.\n\nAmantadine can have a serious interaction with the inhaled flu vaccination.\n\nAmantadine can interact with: stimulant medications, anticholinergic agents, thioridazine, quinine, and quinidine.\n\nShare a list of all vitamin or herbal supplements, prescription, and non-prescription medications you take with the pharmacist when you fill your prescription, especially any drugs that cause drowsiness. Let all doctors and physicians know you are taking amantadine before having any surgery or laboratory tests.\n\nThe above is not a complete list of all possible drug interactions.\n\nMore Information on Adhansia XR and ADHD Medicaitons\n• Free Download: Take Charge of Your Child’s Medication\n• Free Download: How Do We Know the Medication Is Working?\n• Find: ADHD Specialists and Clinics Near You\n\n\n\n 2Hallowell, Edward M, and John J. Ratey. (2005). Delivered From Distraction.pp.251-253. New York, NY. Ballantine Books. \n\n 3Sheik Hosenbocus, M.D., FRCPC, and Raj Chahal, MSW. “Amantadine: A Review of Use in Child and Adolescent Psychiatry.” Journal of the Canadian Academy of Child and Adolescent Psychiatry. 2013 Feb; 22(1): 55–60.\n\nMore Information on Amantadine and ADHD Medications\n\nA Parent’s Guide to ADHD Medications\n\n Free Resource: How Do We Know the Medication is Working?\n\n Making the Switch: Trying a New ADHD Medication", "opengraph": {"type": "article", "title": "Amantadine", "url": "https://www.additudemag.com/medication/amantadine/", "description": "Brand Name: Symmetrel", "article:published_time": "2017-11-15T22:20:09+00:00", "article:modified_time": "2023-01-22T02:30:45+00:00", "site_name": "ADDitude", "image": "https://i0.wp.com/www.additudemag.com/wp-content/uploads/2017/11/Amantadine.jpg", "image:width": "300", "image:height": "225", "image:alt": "Amantadine: Uses, Side Effects and Dosage", "locale": "en_US"}, "tags": ["treating kids", "ADHD Etc.", "treating adults"], "tweets": [], "movies": [], "links": ["#footnote1", "#footnote2", "#footnote3", "#footnote2", "https://www.additudemag.com/download/adhd-medications-a-parents-guide/?src=embed_link", "https://www.additudemag.com/download/a-parents-guide-to-adhd-medications/?src=embed_link", "https://www.additudemag.com/download/adhd-medication-monitoring-log/?src=embed_link", "https://directory.additudemag.com/listing/guide/adhd-centers-clinics", "https://www.cdc.gov/flu/professionals/antivirals/antiviral-dosage.htm", "https://www.amazon.com/gp/product/0345442318/ref=as_li_qf_sp_asin_il_tl?ie=UTF8&tag=nhm00-20&camp=1789&creative=9325&linkCode=as2&creativeASIN=0345442318&linkId=aea0434ecb378330155e6cb2ea14ec05", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3565716/", "http://www.npr.org/templates/story/story.php?storyId=4749307", "https://www.additudemag.com/stimulant-medications-for-adhd/", "https://www.accessdata.fda.gov/drugsatfda_docs/label/2009/016023s041,018101s016lbl.pdf", "https://www.additudemag.com/download/adhd-medications-a-parents-guide/?src=embed_link", "https://www.additudemag.com/download/adhd-medication-monitoring-log/?src=embed_link", "https://www.additudemag.com/making-the-switch-trying-a-new-adhd-medication/?src=embed_link"], "authors": [], "publish_date": "2017-11-15T22:20:09+00:00"}