{"result_id": "012048", "URL": "https://www.ageofautism.com/2020/06/uk-government-hosts-gavi-vaccine-pledging-conference-prevent-protect-prosper-and-profit.html", "timestamp": "2023-04-25 11:56:52 CEST+0200", "meta": {"description": "The UK government will host Gavi’s third donor pledging conference to mobilise at least US$ 7.4 billion in additional resources to protect the next generation with vaccines, reduce disease inequality and create a healthier, safer and more prosperous world. https://www.gavi.org/investing-gavihttps://www.gavi.org/investing-gavi...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.ageofautism.com/2020/06/uk-government-hosts-gavi-vaccine-pledging-conference-prevent-protect-prosper-and-profit.html", "encoding": "utf-8"}, "image": null, "domain": "www.ageofautism.com", "title": "UK Government Hosts GAVI Vaccine Pledging Conference. Prevent. Protect. Prosper. And Profit.", "cleaned_text": "The UK government will host Gavi’s third donor pledging conference to mobilise at least US$ 7.4 billion in additional resources to protect the next generation with vaccines, reduce disease inequality and create a healthier, safer and more prosperous world. https://www.gavi.org/investing-gavihttps://www.gavi.org/investing-gavi \n\n\n\nBelow is a post from May, 2019 by John Stone. Remember, Prevent. Protect. Prosper. And they forgot one - Profit.\n\n\n\nBy John Stone\n\nSeth Berkley, the director of Gavi, who led the call for a clamp down on vaccine criticism in social media two years ago in the British mainstream journal the Spectator had a few months before been named in the Mail on Sunday as the worst charity fat cat. Ian Birrell had written an article entitled 'The fattest charity fat cat of them all: Foreign aid boss made Millions out £1.5 billion handed to his charity by British taxpayers' (actually nearly £2.5 million, heading for $4million). He reports:\n\n\n\n\"Seth Berkley has taken home more than £2 million over the past four years as chief executive officer of Global Alliance for Vaccines and Immunisation (Gavi), which has been given £1.5 billion by Britain...Another official at the Geneva-based group collects a pay package of more than £500,000 a year...Incredibly, Dr Berkley was given a housing allowance on top of his £623,370 pay package... Like others at Gavi, he is also offered help with school fees and is exempt from paying Swiss income taxes under a deal struck by the organisation.\"\n\nIn November 2017 I wrote in evidence to the UK House of Commons media committee (DCMS) inquiry into Fake News:\n\n\"In this regard it is disquieting to look at the global campaign by vaccine lobbyists which reached these shores this summer advocating compulsory vaccination, having scored recent successes in Australia, Italy, France and parts of the United States. The British Medical Association jettisoned its traditional opposition to compulsory vaccination... – dismissed only a few years ago by a former chairman, Hamish Meldrum, as “Stalinist” ... - and called for the matter to be discussed. Just a few days before an article appeared in the on-line Spectator by the CEO of GAVI, a global agency promoting vaccination, calling for “anti-vaxxers” to be excluded from “social media”... It must be emphasised that anyone remotely critical or informed about the vaccine lobby and its products, is placed under the general pejorative label “anti-vaxxer”: it is the vaccine/pharmaceutical lobby that polarises the debate – anyone who is not in favour of their entire open-ended agenda is subject to opprobrium and ad hominem attack. Complex health issues are being reduced in the mainstream arena to “Four legs good, two legs bad” type arguments.\"\n\nGavi's partners include the Bill and Melinda Gates Foundation, UNICEF, the WHO, the World Bank and the International Federation of Pharmaceutical Manufacturers and Associations (notably Johnson & Johnson, GlaxoSmithKline, Merck & Co., Novartis, Sanofi Pasteur, the vaccines division of Sanofi-Aventis and Pfizer), a network which surely leads back to the Global Health Security Agenda launched in the White House by Barack Obama in September 2014 in the wake of the William Thompson affair.\n\nWe have to ask whether it was ever the welfare of humanity which was at stake, or just the welfare of a certain class?\n\n\n\nJohn Stone is UK Editor for Age of Autism.", "opengraph": {"title": "UK Government Hosts GAVI Vaccine Pledging Conference. Prevent. Protect. Prosper. And Profit.", "site_name": "AGE OF AUTISM", "type": "blog", "url": "https://www.ageofautism.com/2020/06/uk-government-hosts-gavi-vaccine-pledging-conference-prevent-protect-prosper-and-profit.html", "description": "The UK government will host Gavi’s third donor pledging conference to mobilise at least US$ 7.4 billion in additional resources to protect the next generation with vaccines, reduce disease inequality and create a healthier, safer and more prosperous world. https://www.gavi.org/investing-gavihttps://www.gavi.org/investing-gavi...", "image": "https://www.rescuepost.com/.a/6a00d8357f3f2969e20240a4af054b200b-600wi"}, "tags": [], "tweets": [], "movies": [], "links": ["https://pbs.twimg.com/profile_images/484016414789865472/rGqMpfud.jpeg", "https://www.gavi.org/investing-gavi", "https://health.spectator.co.uk/anti-vaxxers-have-embraced-social-media-were-paying-for-fake-news-with-real-lives/", "https://www.dailymail.co.uk/news/article-4078904/amp/The-fattest-charity-fat-cat-Foreign-aid-boss-MILLIONS-1-5billion-handed-charity-British-taxpayers.html", "http://data.parliament.uk/writtenevidence/committeeevidence.svc/evidencedocument/digital-culture-media-and-sport-committee/fake-news/written/73097.html", "https://www.gavi.org/about/gavis-partnership-model/", "https://www.gavi.org/about/partners/industrialised-country-vaccine-industry/", "https://www.ageofautism.com/2018/12/smart-power-reasons-for-disaffection-in-italy-and-the-destruction-of-the-post-war-liberal-order.html", "https://www.bmj.com/content/364/bmj.l981/rr", "https://www.ageofautism.com/2014/08/statement-from-william-thompson-re-pediatrics-mmr-african-american-males-data.html"], "authors": [], "publish_date": null}