{"result_id": "012038", "URL": "https://www.ageofautism.com/2021/01/california-demonstrates-a-paucity-of-caution-allowing-moderna-vaccine-back-into-citizens.html", "timestamp": "2023-04-25 11:56:41 CEST+0200", "meta": {"description": "Well jump into your Pinto and get your shots! California has opted to allow the Moderna vaccine that was temporarily halted due to severe adverse reactions back into the Covid game. Suit up, kid! If a bag of lettuce sickened...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.ageofautism.com/2021/01/california-demonstrates-a-paucity-of-caution-allowing-moderna-vaccine-back-into-citizens.html", "encoding": "utf-8"}, "image": null, "domain": "www.ageofautism.com", "title": "California Demonstrates a Paucity of Caution Allowing Moderna Vaccine Back into Citizens", "cleaned_text": "Well jump into your Pinto and get your shots! California has opted to allow the Moderna vaccine that was temporarily halted due to severe adverse reactions back into the Covid game. Suit up, kid! If a bag of lettuce sickened four people in Montana, the company would pull the bags from every shelf from sea to shining sea in the abundantly cautious version of America. That's the America where companies are liable for injury. We're abundantly cautious when it comes to spreading Coronavirus. Masks. Closures. Businesses wiped out. Families separated as elderly are locked in their facilities and the disabled in theirs, as cruel as any cage on the border. We're abundantly cautious even as we throw kids' mental health and educations into the toilet. And as if under a spell, even those injured are racing back to Stockholm for a second dose. In fact, the woman quoted in the article below, whose throat closed faster the crocodile's mouth on Captain Hook's hand, says that she is willing to risk a worse reaction to the second dose for her husband, because he has underlying conditions. I understand love and sacrifice. I am the 3 shift group home manager for 3 adults with autism. I would crawl through hell for my children. In fact, I have. But to take a product that has already hurt you badly is masochism. \n\n\n\n###\n\n\n\nCalifornia: OK to use Moderna vaccine after illness reports\n\n\n\nCalifornia says it’s safe to resume using a batch of coronavirus vaccine after some people fell ill and a halt to injections was recommended\n\nSACRAMENTO, Calif. -- California on Wednesday said it’s safe to resume using a batch of Moderna coronavirus vaccine after some people fell ill and a halt to injections was recommended.\n\nThe decision frees up more than 300,000 doses to counties, cities and hospitals struggling to obtain supplies. The state Department of Public Health on Sunday urged a pause in the use of a specific lot after fewer than 10 people who received shots at a San Diego vaccination site needed medical care, possibly due to rare but severe allergic reactions.\n\nBut after a safety review and consultation with Moderna and local and federal health agencies, the state “found no scientific basis to continue the pause” and said vaccinations can “immediately resume,” state epidemiologist Dr. Erica Pan said in a statement.\n\n“These findings should continue to give Californians confidence that vaccines are safe and effective, and that the systems put in place to ensure vaccine safety are rigorous and science-based,” Pan said, adding that some of her own family members had received it.\n\nAbout 330,000 doses from the lot had been distributed to nearly 300 providers in California this month. Most had halted using it until receiving the all-clear.\n\nCheryl Brennan of Fallbrook was among those who fell ill shortly after being injected last week at Petco Park, home of the San Diego Padres.\n\n“At 18 minutes, it was like my throat started closing,” she told KSWB-TV. “My blood pressure went to 185 over 125, which I guess is very life-threatening.” Help came immediately.\n\n“They hooked up electrodes. They put ice packs on me. I had four EMTs and two nurses helping me and they brought my blood pressure back down within 45 minutes,” Brennan said.", "opengraph": {"title": "California Demonstrates a Paucity of Caution Allowing Moderna Vaccine Back into Citizens", "site_name": "AGE OF AUTISM", "type": "blog", "url": "https://www.ageofautism.com/2021/01/california-demonstrates-a-paucity-of-caution-allowing-moderna-vaccine-back-into-citizens.html", "description": "Well jump into your Pinto and get your shots! California has opted to allow the Moderna vaccine that was temporarily halted due to severe adverse reactions back into the Covid game. Suit up, kid! If a bag of lettuce sickened...", "image": "https://www.rescuepost.com/.a/6a00d8357f3f2969e20278800f5893200d-600wi"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.rescuepost.com/.a/6a00d8357f3f2969e20278800f5893200d-pi"], "authors": [], "publish_date": null}