{"result_id": "012015", "URL": "https://www.ageofautism.com/2022/12/the-defender-congress-set-to-end-military-covid-vaccine-mandate-no-sign-biden-will-veto.html", "timestamp": "2023-04-25 11:56:21 CEST+0200", "meta": {"description": "Yesterday morning, I was listening to Julie Mason on Sirius XM's POTUS channel - Politics of the United States. I like her. She's from Massachusetts and about my age, even attended a rival prep school. She interviews people from both...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.ageofautism.com/2022/12/the-defender-congress-set-to-end-military-covid-vaccine-mandate-no-sign-biden-will-veto.html", "encoding": "utf-8"}, "image": null, "domain": "www.ageofautism.com", "title": "The Defender: Congress Set to End Military COVID Vaccine Mandate, No Sign Biden Will Veto", "cleaned_text": "The Defender: Congress Set to End Military COVID Vaccine Mandate, No Sign Biden Will Veto\n\nYesterday morning, I was listening to Julie Mason on Sirius XM's POTUS channel - Politics of the United States. I like her. She's from Massachusetts and about my age, even attended a rival prep school. She interviews people from both sides of the aisle. Yesterday, she had on Senator Tim Kaine, from Virginia, and they discussed rescinding the Covid vaccine mandate for our military. Many of our readers and some of those close to us had to deal with the military mandate. It was difficult. The Defender, from Children's Health Defense, ran an article on the topic last week: Miss a day, miss a lot. Subscribe to The Defender's Top News of the Day. It's free.\n\n\n\nCongress Set to End Military COVID Vaccine Mandate, No Sign Biden Will Veto The U.S. House of Representatives is expected to vote later this week to rescind the Pentagon’s COVID-19 vaccine mandate, after Republican lawmakers threatened to withhold votes for the $858 billion National Defense Authorization Act. The U.S. House of Representatives is expected to vote later this week to rescind the Pentagon’s COVID-19 vaccine mandate, after Republican lawmakers threatened to withhold votes for the $858 billion National Defense Authorization Act (NDAA) unless the bill included removal of the mandate. The news was confirmed Tuesday night, according to The Washington Post, which also reported that Rep. Mike Rogers (R-Ala.), the ranking Republican on the House Armed Services Committee, said the removal of the vaccination requirement “was essential for the defense policy bill to move forward.”\n\nThe legislation must pass the U.S. Senate before heading to President Biden. Biden, who along with U.S. Defense Secretary Lloyd Austin opposes repealing the mandate, has not indicated that he will veto the bill, Politico reported. The Pentagon would have 30 days to rescind the mandate of the bill passes as is. Thousands of active duty service members have been discharged for refusing the shots since the Pentagon instituted the mandate in August 2021. The proposed legislation will not reinstate discharged service members or compensate those who lost benefits for refusing vaccination. According to The Hill’s “Rising,” Tulsi Gabbard, a politician and U.S. Army Reserve officer, slammed the mandate: “I know people personally who have been kicked out of the military, some who have served 10 years, 20 years, 25 years, all because of this mandate that makes no sense and frankly is based on a lie that [Dr. Anthony] Fauci and others continue to propagate as they have throughout this whole thing, which is these vaccines will prevent you from catching COVID, that it will prevent you from spreading COVID. “The fact that it is even a question at this point whether or not to lift this DOD [Department of Defense] mandate, and that Secretary Austin is opposing it is just absolute madness.” Read more at The Defender HERE.\n\n\n\nFrom Skyhorse Publishing:\n\n\n\nThe Wuhan Cover-Up pulls back the curtain on how the US government's increase in biosecurity spending after the 2001 terror attacks—facilitated by Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases (NIAID)—set in motion a plan to transform the NIAID into a de facto Defense Department agency. Lies My Government Told Me And The Better Future Coming\n\nRobert Malone, MD\n\nDr. Malone is the signature dissident voice telling the other side of the story about COVID, the role of corporate media, censorship, propaganda, and the brave new world of transhumanism promoted by the World Economic Forum and its acolytes.", "opengraph": {"title": "The Defender: Congress Set to End Military COVID Vaccine Mandate, No Sign Biden Will Veto", "site_name": "AGE OF AUTISM", "type": "blog", "url": "https://www.ageofautism.com/2022/12/the-defender-congress-set-to-end-military-covid-vaccine-mandate-no-sign-biden-will-veto.html", "description": "Yesterday morning, I was listening to Julie Mason on Sirius XM's POTUS channel - Politics of the United States. I like her. She's from Massachusetts and about my age, even attended a rival prep school. She interviews people from both...", "image": "https://www.rescuepost.com/.a/6a00d8357f3f2969e202af14aad339200b-600wi"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.ageofautism.com/2022/12/the-defender-congress-set-to-end-military-covid-vaccine-mandate-no-sign-biden-will-veto.html", "https://www.rescuepost.com/.a/6a00d8357f3f2969e202af14aad339200b-pi", "https://childrenshealthdefense.org/about-us/sign-up/?utm_source=top_of_article&utm_medium=the_defender&utm_campaign=sign_ups", "https://childrenshealthdefense.org/defender/united-states-pentagon-covid-vaccine-mandate/", "https://www.washingtonpost.com/politics/congress-set-to-rescind-covid-19-vaccine-mandate-for-troops/2022/12/06/a48796cc-75d9-11ed-a199-927b334b939f_story.html", "https://www.armed-services.senate.gov/imo/media/doc/fy23_ndaa_agreement_summary.pdf", "https://thehill.com/policy/defense/3762315-white-house-opposes-repealing-military-vaccine-mandate-through-ndaa/", "https://www.politico.com/news/2022/12/06/ndaa-pentagon-coronavirus-vaccine-mandate-00072668", "https://www.rga.org/wp-content/uploads/2022/11/Joint-Letter-to-Congress-on-the-Military-Vaccine-Mandate-11.30.2022.pdf", "https://www.axios.com/2021/08/09/military-covid-vaccine-mandate", "https://www.amazon.com/Real-Anthony-Fauci-Democracy-Childrens/dp/1510766804/ref=sr_1_1", "https://childrenshealthdefense.org/defender/united-states-pentagon-covid-vaccine-mandate/", "https://amzn.to/3j2UZc1", "https://amzn.to/3hmpuJN"], "authors": [], "publish_date": null}