{"result_id": "012005", "URL": "https://www.ageofautism.com/us-italian-courts-award-millions-for-vaccine-autism-cases.html", "timestamp": "2023-04-25 11:56:12 CEST+0200", "meta": {"description": "It's been a banner week for the fact that vaccines are responsible for the autism epidemic. As David Kirby reported HERE, \"The federal Vaccine Injury Compensation Program, better known as \"vaccine court,\" has just awarded millions of dollars to two...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.ageofautism.com/us-italian-courts-award-millions-for-vaccine-autism-cases.html", "encoding": "utf-8"}, "image": null, "domain": "www.ageofautism.com", "title": "U.S., Italian Courts Award Millions for Vaccine-Autism Cases", "cleaned_text": "It's been a banner week for the fact that vaccines are responsible for the autism epidemic. As David Kirby reported HERE, \"The federal Vaccine Injury Compensation Program, better known as \"vaccine court,\" has just awarded millions of dollars to two children with autism for \"pain and suffering\" and lifelong care of their injuries, which together could cost tens of millions of dollars.\"\n\nThe Autism Action Network issued a statement that says, in part: \"It happened again. The federal Vaccine Injury Compensation Program (VICP) has awarded Ryan Mojabi and his family a multi-million dollar settlement for autism as the result of an injury from the Measles Mumps Rubella (MMR) vaccine. Ryan’s family joins Hannah Poling and at least 85 others who have received judgments for vaccine-induced autism from the VICP. These people aren’t supposed to exist. We are told again and again that vaccines cannot cause autism, vaccines have never causedautism, and vaccines never will cause autism. Except when they do.\" They urged people to let Congress know about this, especially in light of the Congressional hearing on autism in November at which AOA's own Mark Blaxill testified.\n\nHere is the link to the settlement document.\n\nMeanwhile, in Italy, a court has ruled that in an MMR-autism case, the evidence \"has conclusively established that the young child is suffering from AUTISTIC DISORDER ASSOCIATED WITH MEDIUM COGNITIVE DELAY ascribed with reasonable scientific probability due to the administration of the vaccine MMR.\" See HERE.\n\n100 more cases are said to be in the pipeline in Italy.\n\nThe days of calling Andy Wakefield a fraud, the MMR and thimerosal theories of autism \"debunked\" and media outlets like Age of Autism \"crank sites\" are waning. We would advise the medical and journalism establishments around the world to enjoy their hegemony while it lasts. -- Dan Olmsted", "opengraph": {"title": "U.S., Italian Courts Award Millions for Vaccine-Autism Cases", "site_name": "AGE OF AUTISM", "type": "blog", "url": "https://www.ageofautism.com/us-italian-courts-award-millions-for-vaccine-autism-cases.html", "description": "It's been a banner week for the fact that vaccines are responsible for the autism epidemic. As David Kirby reported HERE, \"The federal Vaccine Injury Compensation Program, better known as \"vaccine court,\" has just awarded millions of dollars to two..."}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.huffingtonpost.com/david-kirby/post2468343_b_2468343.html", "http://www.uscfc.uscourts.gov/sites/default/files/CAMPBELL-SMITH.MOJABI-PROFFER.12.13.2012.pdf", "http://www.thedailydigest.org/?p=1212"], "authors": [], "publish_date": null}