{"result_id": "012016", "URL": "https://www.ageofautism.com/2020/11/there-is-a-race-to-get-the-public-vaccinated-so-we-are-willing-to-take-more-risks.html", "timestamp": "2023-04-25 11:56:22 CEST+0200", "meta": {"description": "The article below buried the lede, if you'll pardon the grim phrase. In this article from The Jerusalem Post about the Modern mRNA vaccine that includes its risks, you find out Professor Michal Linial of Hebrew University of Jerusalem is...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.ageofautism.com/2020/11/there-is-a-race-to-get-the-public-vaccinated-so-we-are-willing-to-take-more-risks.html", "encoding": "utf-8"}, "image": null, "domain": "www.ageofautism.com", "title": "\"There is a race to get the public vaccinated, so we are willing to take more risks\"", "cleaned_text": "The article below buried the lede, if you'll pardon the grim phrase. In this article from The Jerusalem Post about the Modern mRNA vaccine that includes its risks, you find out Professor Michal Linial of Hebrew University of Jerusalem is in no hurry to try the vaccine herself. But when asked if she would take the vaccine right away, she responded: “I won’t be taking it immediately – probably not for at least the coming year,” she told the Post. “We have to wait and see whether it really works.”\n\n###\n\n\n\nCould mRNA COVID-19 vaccines be dangerous in the long-term?\n\n\n\n\"Israelis celebrated on Friday when Prime Minister Benjamin Netanyahu announced that the country had signed a deal with Pfizer Inc. to buy its novel coronavirus vaccine. But the fact remains that if Pfizer succeeds – or Moderna, with whom Israel also has a contract – these will be the first-ever messenger RNA (mRNA) vaccines brought to market for human patients.\n\nIn order to receive Food and Drug Administration approval, the companies will have to prove there are no immediate or short-term negative health effects from taking the vaccines. But when the world begins inoculating itself with these completely new and revolutionary vaccines, it will know virtually nothing about their long-term effects.\n\n“There is a race to get the public vaccinated, so we are willing to take more risks,” Tal Brosh, head of the Infectious Disease Unit at Samson Assuta Ashdod Hospital, told The Jerusalem Post.... Could mRNA COVID-19 vaccines be dangerous in the long-term?", "opengraph": {"title": "\"There is a race to get the public vaccinated, so we are willing to take more risks\"", "site_name": "AGE OF AUTISM", "type": "blog", "url": "https://www.ageofautism.com/2020/11/there-is-a-race-to-get-the-public-vaccinated-so-we-are-willing-to-take-more-risks.html", "description": "The article below buried the lede, if you'll pardon the grim phrase. In this article from The Jerusalem Post about the Modern mRNA vaccine that includes its risks, you find out Professor Michal Linial of Hebrew University of Jerusalem is...", "image": "https://www.rescuepost.com/.a/6a00d8357f3f2969e20263e97bd9a5200b-600wi"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.rescuepost.com/.a/6a00d8357f3f2969e20263e97bd9a5200b-pi", "https://www.jpost.com/health-science/could-an-mrna-vaccine-be-dangerous-in-the-long-term-649253", "https://www.jpost.com/health-science/netanyahu-defends-pfizer-deal-this-is-a-very-good-investment-649180", "https://www.jpost.com/health-science/could-an-mrna-vaccine-be-dangerous-in-the-long-term-649253"], "authors": [], "publish_date": null}