{"result_id": "012004", "URL": "https://www.ageofautism.com/2020/05/webmd-.html", "timestamp": "2023-04-25 11:56:11 CEST+0200", "meta": {"description": "By Dennis Thompson HealthDay Reporter Don't clean your screen or call your optometrist, you read that correctly: WebMD is questioning the safety of a rushed COVID vaccine. A COVID-19 Vaccine by Fall Is Possible, But at What Cost? MONDAY, May...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.ageofautism.com/2020/05/webmd-.html", "encoding": "utf-8"}, "image": null, "domain": "www.ageofautism.com", "title": "WebMD: A COVID-19 Vaccine by Fall Is Possible, But at What Cost?", "cleaned_text": "Don't clean your screen or call your optometrist, you read that correctly: WebMD is questioning the safety of a rushed COVID vaccine.\n\n\n\nA COVID-19 Vaccine by Fall Is Possible, But at What Cost?\n\n\n\nMONDAY, May 11, 2020 (HealthDay News) -- Efforts to create a COVID-19 vaccine are proceeding at an unprecedented pace, with eight different candidates now being tested in humans around the world.\n\nBut to have a vaccine available for widespread use by early next year could entail bending some rules regarding safety and testing -- actions that might put the health, and possibly the lives, of test volunteers at risk.\n\n\"It is possible to have a vaccine by the fall or winter,\" said Dr. Greg Poland, director of the Vaccine Research Group at the Mayo Clinic in Rochester, Minn. \"It is not possible to have a vaccine by fall or winter that has gone through the usual safety testing. Speed is a tradeoff with safety.\"\n\nThe government's leading vaccine expert -- Dr. Anthony Fauci, director of the U.S. National Institute of Allergy and Infectious Diseases -- raised eyebrows in late April when he declared it \"doable\" to have millions of doses of coronavirus vaccine ready for distribution by January.\n\n\"We have to remember that the fastest we've ever seen this really being done is four years,\" said Dr. David Shulkin, former secretary of Veterans Affairs and former president and CEO of Beth Israel Medical Center in New York City. \"The traditional methods and processes for developing vaccines take a great deal of time.\"\n\nHowever, Shulkin and other experts agree that a COVID-19 vaccine could be ready for public distribution earlier than the 12- to 18-month development timetable that has been suggested.\n\nThe holdup isn't in creating a vaccine. The World Health Organization lists eight candidate vaccines currently in human clinical trials, and 100 more candidates are undergoing preclinical evaluation in laboratories worldwide.\n\nRather, testing each vaccine to make sure it's safe and effective is what eats up months and years, Shulkin said during a HealthDay Live Stream interview.\n\n\"It's likely we will see vaccine approvals outside the United States -- where the regulatory approvals may not necessarily be as stringent -- in a quicker time period than even the 18-month period we've discussed,\" Shulkin said. Read more here.", "opengraph": {"title": "WebMD: A COVID-19 Vaccine by Fall Is Possible, But at What Cost?", "site_name": "AGE OF AUTISM", "type": "blog", "url": "https://www.ageofautism.com/2020/05/webmd-.html", "description": "By Dennis Thompson HealthDay Reporter Don't clean your screen or call your optometrist, you read that correctly: WebMD is questioning the safety of a rushed COVID vaccine. A COVID-19 Vaccine by Fall Is Possible, But at What Cost? MONDAY, May...", "image": "https://www.rescuepost.com/.a/6a00d8357f3f2969e20263ec197f34200c-600wi"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.rescuepost.com/.a/6a00d8357f3f2969e20263ec197f34200c-pi", "https://www.webmd.com/lung/news/20200511/covid-19_vaccine_by_fall_possible_but_at_what_cost?fbclid=IwAR3i86LzuI3XhR1ouBlZxbOzDW4Z2crMdCpYE8oiwzvpBqw5crwvkVmKjM8#1", "https://www.webmd.com/lung/news/20200511/covid-19_vaccine_by_fall_possible_but_at_what_cost?fbclid=IwAR3i86LzuI3XhR1ouBlZxbOzDW4Z2crMdCpYE8oiwzvpBqw5crwvkVmKjM8#1"], "authors": [], "publish_date": null}