{"result_id": "012013", "URL": "https://www.ageofautism.com/2021/01/pfizer-moderna-et-al-covid-products-are-medical-devices-not-vaccines-.html", "timestamp": "2023-04-25 11:56:20 CEST+0200", "meta": {"description": "Thank you to Anne Dachel for working with Dr. Ken Stoller for this most interesting piece on AofA: ### Dr. Ken Stoller of San Francisco, a longtime advocate for medical freedom, recently sent me his opinion on mandating the COVID-19...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.ageofautism.com/2021/01/pfizer-moderna-et-al-covid-products-are-medical-devices-not-vaccines-.html", "encoding": "utf-8"}, "image": null, "domain": "www.ageofautism.com", "title": "Pfizer, Moderna et al Covid Products are Medical Devices Not \"Vaccines\"", "cleaned_text": "Thank you to Anne Dachel for working with Dr. Ken Stoller for this most interesting piece on AofA:\n\n\n\n###\n\n\n\nDr. Ken Stoller of San Francisco, a longtime advocate for medical freedom, recently sent me his opinion on mandating the COVID-19 vaccine.\n\nBelow is his advice as a physician. You’ll notice that his opening argument is that it’s not really a vaccine. The COVID-19 ‘injection’ does not do what we all assume a true vaccine should do.\n\nYou are not antivax if you are against the COVID-19 injections\n\nYou are not anti-vax because the COIVD injections are not vaccines.\n\nYes, they are being called vaccines, but this is to bypass the regulatory requirements for a medical device.\n\nThis ‘vaccine’ is actually a medical device that has never been used in humans before and rushed to market without any appreciation for what it will do either in the short term or long term.\n\nThis injection is also being called a vaccine to gain more acceptance, because most people assume that all vaccines are safe and effective. That’s what the CDC tells us. So if it is a vaccine, it must be safe and effective for ending the pandemic.\n\nSome sources have indicated the adverse event rate for COVID-19 injections is as high as 80 percent, and that would include all the minor adverse events.\n\nBut if the short-term adverse event rate is 80 percent, what is in store for the long term?\n\nThey honestly don’t know and really don’t care.\n\nPolitics and eugenics, not science or good public health practices, are what is driving this grand medical experiment dwarfing the Tuskegee incident by a billion-fold.\n\nWhile this is an over simplification, a vaccine, as defined by the CDC & FDA, is procedure that introduces into the body a foreign protein or weakened virus or bacteria and activates the immune system to make antibodies to same. In theory, to be effective, those antibodies actually have to perform in a useful manner.\n\nIf it works as advertised, a vaccine gets in your body and programs itself to attack the infection should it cross your path. It has to stimulate both immunity and disrupt transmission by definition, but the COVID-19 injection does not encourage your body to program your immune system. Instead, it is the program.", "opengraph": {"title": "Pfizer, Moderna et al Covid Products are Medical Devices Not \"Vaccines\" ", "site_name": "AGE OF AUTISM", "type": "blog", "url": "https://www.ageofautism.com/2021/01/pfizer-moderna-et-al-covid-products-are-medical-devices-not-vaccines-.html", "description": "Thank you to Anne Dachel for working with Dr. Ken Stoller for this most interesting piece on AofA: ### Dr. Ken Stoller of San Francisco, a longtime advocate for medical freedom, recently sent me his opinion on mandating the COVID-19...", "image": "https://www.rescuepost.com/.a/6a00d8357f3f2969e20263e986bd38200b-600wi"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.rescuepost.com/.a/6a00d8357f3f2969e20263e986bd38200b-pi"], "authors": [], "publish_date": null}