{"result_id": "012041", "URL": "https://www.ageofautism.com/2022/08/15-week-course-on-how-uncle-forgives-forgave-pharmas-vaccine-liability-debt-.html", "timestamp": "2023-04-25 11:56:45 CEST+0200", "meta": {"description": "We need you to know about this 15 week University level course beginning on September 13 from IPAK-EDU on the National Vaccine Injury Compensation Program and the Countermeasures Injury Compensation Program used for emergency authorized biologics. In this course, students...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.ageofautism.com/2022/08/15-week-course-on-how-uncle-forgives-forgave-pharmas-vaccine-liability-debt-.html", "encoding": "utf-8"}, "image": null, "domain": "www.ageofautism.com", "title": "15 Week Course on How Pharmaceutical Vaccine Liability Falls to the Consumer Courtesy of Uncle Sam", "cleaned_text": "15 Week Course on How Pharmaceutical Vaccine Liability Falls to the Consumer Courtesy of Uncle Sam\n\nWe need you to know about this 15 week University level course beginning on September 13 from IPAK-EDU on the National Vaccine Injury Compensation Program and the Countermeasures Injury Compensation Program used for emergency authorized biologics. \n\n\n\nIn this course, students will learn the structure, function and defects of the programs in the US created by Congress to award compensation to adults and children potentially and actually harmed or killed by vaccines. We will review a variety of important topics, review case histories. This course is for parents and lawyers new to US vaccine injury compensation programs.\n\n\n\nRead the course description and register here. \n\n\n\nTaught by Wayne Rohde, author of Vaccine Court, this class is available through The Online private University, IPAK-EDU. Many of us KNOW what these programs are - but we don't know the details of their inception and execution. The knowledge can boost your conversations with, trolls, BOTS, family and friends - just THINK of the Thanksgiving table arguments you can start! You might just get the whole pumpkin pie to yourself. XOX\n\n\n\n###\n\n\n\nRead More and Register HERE. 15-week, 1 hour course, both live and on demand\n• reading list will be provided 2 weeks prior to each week’s topic of discussion.\n• Q&A will be reserved for the last 15 minutes of each class\n• Weekly topics can be changed, added or removed by class suggestion.\n• Understanding of Terms and Acronyms within Program.\n• Basic understanding of legal recourse of injury prior to NVICP.\n• Why did Congress pass NCVIA of 1986 and components of the Act?\n• Early years of the NVICP and amendments to the Act.\n• 1995 & 1997 – radical changes to the Program.\n• Courts use of Omnibus proceedings. Not just Autism.\n• Mechanisms to add vaccines to the Program.\n• What is the Advisory Commission for Childhood Vaccines (ACCV).\n• When did adult vaccines become part of the Program?\n• How to access court decisions, appeals and opinions.\n• Basic review of The PREP Act and Public Health Emergency declarations Week 1 – General Overview of the NVICP, the purpose and what did the Act establish. Brief review of why Congress passed the NCVIA.\n\nWeek 2 – Components of the Program. Who is the defendant? Who administers the Program? What is a Special Master? Are you really suing anyone? Week 3 – The PREP Act, The CounterMeasures Injury Compensation Program and adding COVID-19 vaccine injuries to a compensation program. Week 6 – Filing a petition in NVICP, the pathway thru the Program and the adjudication of each case to final decision including appeals (Robert Krakow) Week 7 – The Trust Fund, the failure to publicize the Program Week 8 – Vaccine Injury Table and how it is revised, Year 1995 & 1997 and the fallout of Sec’y of HHS actions Week 10 – Rolf Hazlehurst, father of Yates. 2nd petition in OAP & Nick Kottenstette, father to child who was compensated in NVICP. Week 13 – Why SIDS, POI, Epilepsy, POTS and other medical conditions are not compensated Week 14 – The effort to remove SIRVA and Sec 17 from the Program. Reforms Needed. To repeal the Act or to reform. Week 15 – Review of the NVICP and the CICP", "opengraph": {"title": "15 Week Course on How Pharmaceutical Vaccine Liability Falls to the Consumer Courtesy of Uncle Sam", "site_name": "AGE OF AUTISM", "type": "blog", "url": "https://www.ageofautism.com/2022/08/15-week-course-on-how-uncle-forgives-forgave-pharmas-vaccine-liability-debt-.html", "description": "We need you to know about this 15 week University level course beginning on September 13 from IPAK-EDU on the National Vaccine Injury Compensation Program and the Countermeasures Injury Compensation Program used for emergency authorized biologics. In this course, students...", "image": "https://www.rescuepost.com/.a/6a00d8357f3f2969e202a30d4abc16200b-600wi"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.ageofautism.com/2022/08/15-week-course-on-how-uncle-forgives-forgave-pharmas-vaccine-liability-debt-.html", "https://www.rescuepost.com/.a/6a00d8357f3f2969e202a30d4abc16200b-pi", "https://ipak-edu.org/registration/?store-page=Vaccine-Injury-Compensation-Programs-in-the-US-p482519020", "https://ipak-edu.org/registration/?store-page=Vaccine-Injury-Compensation-Programs-in-the-US-p482519020", "https://ipak-edu.org/", "https://ipak-edu.org/registration/?store-page=Vaccine-Injury-Compensation-Programs-in-the-US-p482519020", "mailto:wrohde@comcast.net"], "authors": [], "publish_date": null}