{"result_id": "012003", "URL": "https://www.ageofautism.com/2018/11/the-supreme-court-did-not-deem-vaccines-unavoidably-unsafe-congress-did.html", "timestamp": "2023-04-25 11:56:10 CEST+0200", "meta": {"description": "By Ginger Taylor, MS There is an error that is often made when we talk about the \"Unavoidably Unsafe\" status of FDA approved vaccines. It may seem like a small point, but it is important to be accurate. Someone, somewhere,...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.ageofautism.com/2018/11/the-supreme-court-did-not-deem-vaccines-unavoidably-unsafe-congress-did.html", "encoding": "utf-8"}, "image": null, "domain": "www.ageofautism.com", "title": "The Supreme Court Did Not Deem Vaccines \"Unavoidably Unsafe,\" Congress Did.", "cleaned_text": "By Ginger Taylor, MS\n\n\n\nThere is an error that is often made when we talk about the \"Unavoidably Unsafe\" status of FDA approved vaccines. It may seem like a small point, but it is important to be accurate.\n\n\n\nSomeone, somewhere, sometime, long, long ago and far away, said that, \"The US Supreme Court has ruled that vaccines are unavoidably unsafe,\" referencing the use of the term in Bruesewitz v. Wyeth. And it has been repeated over and over. But it is not accurate.\n\n\n\nCongress placed vaccines in that category, and SCOTUS was merely referencing the already established status of the products.\n\n\n\nIt is correct to say that \"US Law regards vaccines as unavoidably unsafe.\"\n\n\n\nBut Congress itself did that, not the Supreme Court. \n\n\n\nFeel free to remind a member of Congress of that fact if he makes the false claim that, \"Vaccines Are Safe.\"\n\n\n\nFrom Mary Holland JD, Director of the Graduate Legal studies program at NYU Law School:\n\n\"The key language about “unavoidable” side effects comes from the National Childhood Vaccine Injury Act, 42 USC 300aa-22, re manufacturer responsibility (see highlighted text below).\n\nThat language was based on language from the Second Restatement of Torts (a legal treatise by tort scholars), adopted by most state courts in the mid-1960’s, that considered all vaccines as “unavoidably unsafe” products. The Restatement opined that such products, “properly prepared, and accompanied by proper directions and warnings, is not defective, nor is it unreasonably dangerous.”\n\nThe Bruesewitz v. Wyeth case interpreted the highlighted text below from the National Vaccine Injury Act to find that it did not permit design defect litigation – that issue had been unclear since 1986, and different state high courts and federal circuits had decided the issue differently. So, [it] is correct that the US Supreme Court never decided that vaccines are “unavoidably unsafe” directly, but it acknowledged that Congress considers them to be so.", "opengraph": {"title": "The Supreme Court Did Not Deem Vaccines \"Unavoidably Unsafe,\" Congress Did.", "site_name": "AGE OF AUTISM", "type": "blog", "url": "https://www.ageofautism.com/2018/11/the-supreme-court-did-not-deem-vaccines-unavoidably-unsafe-congress-did.html", "description": "By Ginger Taylor, MS There is an error that is often made when we talk about the \"Unavoidably Unsafe\" status of FDA approved vaccines. It may seem like a small point, but it is important to be accurate. Someone, somewhere,...", "image": "https://www.rescuepost.com/.a/6a00d8357f3f2969e2022ad3a09dc5200d-600wi"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.rescuepost.com/.a/6a00d8357f3f2969e2022ad3a09dc5200d-pi"], "authors": [], "publish_date": null}