{"result_id": "012029", "URL": "https://www.ageofautism.com/2021/08/us-covid-19-vaccines-proven-to-cause-more-harm-than-good-based-on-pivotal-clinical-trial-data-analyzed-using-the-proper-scien.html", "timestamp": "2023-04-25 11:56:33 CEST+0200", "meta": {"description": "New paper FDA are expected to vote today to fully license the Pfizer vaccine while hiding the hideous fallout https://www.scivisionpub.com/pdfs/us-covid19-vaccines-proven-to-cause-more-harm-than-good-based-on-pivotal-clinical-trial-data-analyzed-using-the-proper-scientific--1811.pdf ABSTRACT Three COVID-19 vaccines in the US have been released for sale by the FDA under Emergency Use Authorization (EUA)...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.ageofautism.com/2021/08/us-covid-19-vaccines-proven-to-cause-more-harm-than-good-based-on-pivotal-clinical-trial-data-analyzed-using-the-proper-scien.html", "encoding": "utf-8"}, "image": null, "domain": "www.ageofautism.com", "title": "US COVID-19 Vaccines Proven to Cause More Harm than Good Based on Pivotal Clinical Trial Data Analyzed Using the Proper Scientific Endpoint, “All Cause Severe Morbidity” J. Bart Classen, MD*", "cleaned_text": "FDA are expected to vote today to fully license the Pfizer vaccine while hiding the hideous fallout\n\nThree COVID-19 vaccines in the US have been released for sale by the FDA under Emergency Use Authorization (EUA) based on a clinical trial design employing a surrogate primary endpoint for health, severe infections with COVID-19. This clinical trial design has been proven dangerously misleading. Many fields of medicine, oncology for example, have abandoned the use of disease specific endpoints for the primary endpoint of pivotal clinical trials (cancer deaths for example) and have adopted “all cause mortality or morbidity” as the proper scientific endpoint of a clinical trial. Pivotal clinical trial data from the 3 marketed COVID-19 vaccines was reanalyzed using “all cause severe morbidity\", a scientific measure of health, as the primary endpoint. “All cause severe morbidity” in the treatment group and control group was calculated by adding all severe events reported in the clinical trials. Severe events included both severe infections with COVID-19 and all other severe adverse events in the treatment arm and control arm respectively. This analysis gives reduction in severe COVID-19 infections the same weight as adverse events of equivalent severity. Results prove that none of the vaccines provide a health benefit and all pivotal trials show a statically significant increase in “all cause severe morbidity\" in the vaccinated group compared to the placebo group. The Moderna immunized group suffered 3,042 more severe events than the control group (p=0.00001). The Pfizer data was grossly incomplete but data provided showed the vaccination group suffered 90 more severe events than the control group (p=0.000014), when only including “unsolicited” adverse events. The Janssen immunized group suffered 264 more severe events than the control group (p=0.00001). These findings contrast the manufacturers’ inappropriate surrogate endpoints: Janssen claims that their vaccine prevents 6 cases of severe COVD-19 requiring medical attention out of 19,630 immunized; Pfizer claims their vaccine prevents 8 cases of severe COVID-19 out of 21,720 immunized; Moderna claims its vaccine prevents 30 cases of severe COVID-19 out of 15,210 immunized. Based on this data it is all but a certainty that mass COVID-19 immunization is hurting the health of the population in general. Scientific principles dictate that the mass immunization with COVID-19 vaccines must be halted immediately because we face a looming vaccine induced public health catastrophe.", "opengraph": {"title": "US COVID-19 Vaccines Proven to Cause More Harm than Good Based on Pivotal Clinical Trial Data Analyzed Using the Proper Scientific Endpoint, “All Cause Severe Morbidity” J. Bart Classen, MD*", "site_name": "AGE OF AUTISM", "type": "blog", "url": "https://www.ageofautism.com/2021/08/us-covid-19-vaccines-proven-to-cause-more-harm-than-good-based-on-pivotal-clinical-trial-data-analyzed-using-the-proper-scien.html", "description": "New paper FDA are expected to vote today to fully license the Pfizer vaccine while hiding the hideous fallout https://www.scivisionpub.com/pdfs/us-covid19-vaccines-proven-to-cause-more-harm-than-good-based-on-pivotal-clinical-trial-data-analyzed-using-the-proper-scientific--1811.pdf ABSTRACT Three COVID-19 vaccines in the US have been released for sale by the FDA under Emergency Use Authorization (EUA)..."}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.scivisionpub.com/pdfs/us-covid19-vaccines-proven-to-cause-more-harm-than-good-based-on-pivotal-clinical-trial-data-analyzed-using-the-proper-scientific--1811.pdf"], "authors": [], "publish_date": null}