{"result_id": "012046", "URL": "https://www.ageofautism.com/vaccines/page/2/", "timestamp": "2023-04-25 11:56:50 CEST+0200", "meta": {"description": "News and opinion relevant to families raising children with autism into adulthood and beyond.", "lang": "en", "keywords": "autism, health, choice, disability, adulthood, education, autistic", "favicon": "", "canonical": "https://www.ageofautism.com/vaccines/", "encoding": "utf-8"}, "image": null, "domain": "www.ageofautism.com", "title": "AGE OF AUTISM", "cleaned_text": "By Anne Dachel\n\n\n\nBelow I transcribed a brilliant recent interview of Dr. Anthony Fauci by actor, director, producer, Eugenio Derbez.\n\nI have to think that Fauci agreed to this 30 minute talk in order to give himself an opportunity to promote the COVID 19 vaccine to Hispanic Americans.\n\nThe big surprise was that Derbez knew what to bring up about the development and safety of the COVID19 vaccines. He actually asked questions you will never hear from anyone in the mainstream media.\n\nDerbez wanted to know why we should trust vaccines with only months of trials, not years and only Emergency Use Authorization from the FDA.\n\nWhat about the lack of liability on the part of vaccine makers and side effects that don’t show up 5 to 10 years down the road? Derbez pressed these points repeatedly.\n\nWhat about the new mRNA vaccines? Derbez wanted to know if this “technology [has] ever been injected into humans before.”\n\nFauci had to admit it hadn’t, but he wasn’t worried because “the results are really, really good.”\n\nFauci was equally untroubled when Derbez questioned the controversial use of aborted fetal cell lines in vaccine manufacture. Derbez said it was of concern to many Hispanic Catholics.\n\nFauci noted that only “some” bishops advised against the Johnson and Johnson COVID vaccine because of fetal cell use.\n\nDerbez brought up asymptomatic spread of the virus, along with the effectiveness of the COVID19 vaccines.\n\nFauci danced around the possibility that these vaccines stop transmission, provide immunity or merely reduce symptoms. If you listen to the end, he seems to say they do all three. If everyone in the family is vaccinated, or if only grandma is, you can gather “in the home” without masks, hugging and kissing everyone.\n\nI was left with the overwhelming feeling that the COVID 19 vaccines pose lots of questions with few answers.\n\nDerbez: Let’s get straight to the point. I was telling people I was a little bit concerned, so I had a lot of doubts about this vaccine, and then I got the invitation to talk to you.\n\nIt would be very helpful for all of us to learn and to understand about the vaccine.\n\nSo, first question: which of the COVID 19 vaccines have been officially approved by the FDA?\n\nFauci: Three of them. One from Moderna, which is the mRNA vaccine.\n\nOne from Pfizer, which is another mRNA vaccine.\n\nAnd the other one is from J and J, Johnson and Johnson, which is a little bit different. It gives the same kind of response, but it’s a little bit different.\n\nSo there are three vaccines that have gotten emergency use authorization from the FDA so far.\n\nThere are a couple of others that are still being tested to determine if they’re safe and effective, but the three that I just mentioned, have been shown in very large clinical trials involving anywhere from 30,000 to 44,000 people per trial, were shown to be not only very efficacious, but quite safe.\n\nDerbez: …What is the difference between emergency use authorization and an official approval by the FDA?", "opengraph": {"title": "AGE OF AUTISM", "site_name": "AGE OF AUTISM", "type": "blog", "url": "https://www.ageofautism.com/", "description": "Age of Autism provides daily insights into the autism epidemic. Part of the Autism Age 501c3 non-profit organization, our mission is to share information with families facing the daily challenges & joys that surround autism. For more than 15 years, AofA has been a lone voice discussing even the most controversial subjects - because THAT'S what journalists do. Freedom of speech is alive and well here. Join us.", "image": "https://up1.typepad.com/6a00d8357f3f2969e20263e9886624200b-220si"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "460", "height": "315", "embed_code": "<iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/NiB3eK3btOE\" width=\"460\"/>", "src": "https://www.youtube.com/embed/NiB3eK3btOE"}], "links": ["https://www.rescuepost.com/.a/6a00d8357f3f2969e20263e997543c200b-pi", "https://www.youtube.com/watch?v=NiB3eK3btOE"], "authors": [], "publish_date": null}