{"result_id": "012026", "URL": "https://www.ageofautism.com/2023/03/chd-exclusive-mother-sues-dc-doctor-who-gave-kids-covid-vaccines-without-consent.html", "timestamp": "2023-04-25 11:56:30 CEST+0200", "meta": {"description": "Parental consent has always been on our watch list. Recently, as transsexual ideation has swept through schools, the topic has reached a heated level. Even hotter than abortion. The push to allow minors to make healthcare decisions continues, disregarding parental...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.ageofautism.com/2023/03/chd-exclusive-mother-sues-dc-doctor-who-gave-kids-covid-vaccines-without-consent.html", "encoding": "utf-8"}, "image": null, "domain": "www.ageofautism.com", "title": "CHD Exclusive: Mother Sues D.C. Doctor Who Gave Kids COVID Vaccines Without Consent", "cleaned_text": "The lawsuit alleges Rethy, director of the mobile clinic, held the children in the examination room longer than necessary for a regular check-up and vaccinated them against COVID-19 over their objections and without consulting their mother.\n\nAccording to the complaint, on Sept. 2, 2022, McNeil took her two older children, ages 15 and 17, to the KIDS Mobile Medical Clinic/Ronald McDonald Care Mobile clinic, operated by Georgetown Hospital, to complete their required annual physical exam for the 2022-2023 school year.\n\nAn attorney representing NaTonya McNeil last week filed a lawsuit in Superior Court for the District of Columbia against Janine A. Rethy, M.D., M.P.H.\n\nThe mother of two children who were given COVID-19 vaccines without the mother’s consent is suing the doctor who administered the vaccines.\n\nChildren’s Health Defense is funding a lawsuit by a D.C. mother alleging a doctor vaccinated two of her children for COVID-19 without her consent after falsely telling the teens the shots were required for school.\n\nParental consent has always been on our watch list. Recently, as transsexual ideation has swept through schools, the topic has reached a heated level. Even hotter than abortion. The push to allow minors to make healthcare decisions continues, disregarding parental input. But remember the inverse has been true as well. Parents who choose not to approve a medical procedure or product or tretment are quickly judged and can be punished. Perhaps the erosion of parental healthcare rights has been marching in this direction for decades. As a teen, I thought I was grown up enough to make my own healthcare choices. That's just the teen brain. Smarter than everyone, until about age 25, right? From Children's Health Defense's The Defender: Please subscribe today .\n\nIn order to attempt to obtain the children’s consent — which they are not legally able to provide without a parent or guardian — the doctor falsely informed the children the COVID-19 vaccine was mandatory for school attendance and told them they could not lawfully decline it if they wanted to attend school.\n\nThe suit, filed by D.C. attorney Matthew Hardin, seeks damages for false imprisonment, battery and fraud.\n\nChildren’s Health Defense (CHD) is financing the lawsuit because, according to CHD President and General Counsel Mary Holland, “CHD couldn’t just sit still and not allow this wrong to go unpunished and not bring this to the public’s attention.”\n\nIn an exclusive conversation with The Defender, McNeil explained why she is suing the the doctor:\n\n“I just feel like people shouldn’t be able to do whatever they want to do to other people and especially not to children. As a mother, I feel like, ‘You all just took all my rights away from me to do what you wanted to do to my kids.’\n\n“I do want justice to be done in this case. I feel like something needs to be done. This can’t just continue to happen.”\n\nAccording to the complaint, Rethy’s stated goal is to vaccinate all children against COVID-19. The complaint quotes her statement to the press:\n\n“Our goal is to increase vaccination rates in children here in D.C. … For more than 30 years our role has been to be in the community to help address the problem of health disparities, bringing families care where they are.\n\n“For this particular effort, we are glad to be partnering with DC Health to provide both regular childhood vaccines and COVID-19 vaccines to all children.”\n\nIn addition to her role as director of the mobile clinic, Rethy is chief of MedStar Georgetown University Hospital’s Division of Community Pediatrics and assistant professor of pediatrics at Georgetown University School of Medicine.\n\nMcNeil said that when she took her older children to the clinic, she stayed outside the examination room to care for her infant. As soon as the children entered the doctor’s office, she called her daughter’s cellphone to let Rethy know she was just outside the door if the doctor needed to consult her for anything.\n\nAccording to McNeil, the doctor did not ask or inform her about any vaccinations, and did not ask her to sign anything. At the end of the physical, Rethy came out to talk to her.\n\nMcNeil said the doctor explained her son’s asthma treatment plan, but that’s all they discussed.\n\nAs they were heading home, McNeil said she was shocked when her daughter complained that her arm hurt “pretty bad.” When McNeil asked her why it hurt, her daughter said she was given the COVID-19 shot, even though she told the doctor she didn’t want it.\n\nWhen McNeil asked her why she allowed the doctor to administer the shot, her daughter said:\n\n“When she had the needle in her hand and she was coming towards me, I backed up and I asked her what is that needle, and she said it was the COVID shot and I … told her I didn’t want it and she said, ‘Well it is mandatory, you have to get it in order to go to school.’”\n\nRethy allegedly administered the shot to her daughter, and then to her son. McNeil said:\n\n“He’s 14 and he said they didn’t even ask him if he wanted it or not, but when they gave it to him, he said he thought he had to get it because his sister got it.”\n\nAccording to the complaint, both children received the Pfizer/BioNTech vaccine, authorized for emergency use, and the meningococcal vaccine. Her son was also injected with TDaP.\n\nBoth children were upset and angry they had been coerced into vaccination, the complaint says.\n\nNo school mandate, despite what clinic and doctor alleged\n\nWhen she got home, McNeil said she called the doctor’s office, and asked them why they vaccinated her children without her consent.\n\n“I would have never consented to you all vaccinating my children,” she said. “I’m not vaccinated and I’m not getting vaccinated and my kids were never supposed to be vaccinated for COVID period, under no circumstances.”\n\nShe said the person on the phone said they were supposed to get them for school.\n\nAfter hanging up, McNeil said she was “so irritated I even started crying” because she couldn’t believe “they put this poison” into her children’s bodies.\n\nIn July 2022, D.C. public schools imposed a vaccine mandate for schoolchildren ages 12 and up for the 2022-2023 school year. But on Aug. 26, just weeks after imposing the mandate, officials walked it back, postponing it until 2023.\n\nThat means when McNeil’s children saw the doctor, there was no school vaccine mandate in place, despite what the Rethy allegedly told the children.\n\nThe District of Columbia in March 2021 enacted the D.C. Minor Consent for Vaccination Amendment Act of 2020 (D.C. Minor Consent Act), allowing children 11 and older to consent to the administration of any vaccine — including COVID-19 shots — recommended by the Advisory Committee on Immunization Practices (ACIP) — without parental knowledge or consent if the medical provider believed “the minor is capable of meeting the informed consent standard.”\n\nThe law also required healthcare personnel to provide accurate immunization records to the Department of Health and to the student’s school, but not to parents with religious exemptions.\n\nCHD and Parental Rights Foundation filed a lawsuit seeking a court order to declare the D.C. Act unconstitutional.\n\nA judge for the U.S. District Court for the District of Columbia on March 18, 2022, granted a preliminary injunction prohibiting the D.C. mayor, Department of Health and public schools from enforcing the law.\n\nThat means at the time McNeil’s children visited the clinic, they could not legally provide consent to be vaccinated without their mother’s consent.\n\n“To do that to my little children, my innocent children. They took her rights. When she backed away from you [the doctor] and said she didn’t want it, that should have been the end of it.\n\n“Or you [the doctor] should have called me on the phone to find out what I feel about the situation. But you [the doctor] basically told my child a lie so you [she] could do what you [she] wanted to do to my kid.”\n\nAn Enemy of the People\n\nIn his foreword, Kennedy alerts readers to the undeniable fact that the persecution of those who tell uncomfortable truths, which Ibsen described over one hundred years ago, continues to this day and is as relevant now as ever. We face environmental deregulation and degradation, politicians in lobbyists’ pockets, attacks on facts that are agreed upon by reputable scientists, corporate funded and controlled research, and attempts to impede and suppress whistleblowers. The battle continues and Kennedy joins Ibsen on the front lines.\n\nROAR by Bruce Wagner\n\n\n\nThe myth of an epic, public life—its triumphs and tragedies—is a particularly American obsession. ROAR is a metafictional exploration of such a life and attendant fame of an extraordinary, and completely made up, man.", "opengraph": {"title": "CHD Exclusive: Mother Sues D.C. Doctor Who Gave Kids COVID Vaccines Without Consent", "site_name": "AGE OF AUTISM", "type": "blog", "url": "https://www.ageofautism.com/2023/03/chd-exclusive-mother-sues-dc-doctor-who-gave-kids-covid-vaccines-without-consent.html", "description": "Parental consent has always been on our watch list. Recently, as transsexual ideation has swept through schools, the topic has reached a heated level. Even hotter than abortion. The push to allow minors to make healthcare decisions continues, disregarding parental...", "image": "https://www.rescuepost.com/.a/6a00d8357f3f2969e202b6852c5bde200d-600wi"}, "tags": [], "tweets": [], "movies": [], "links": ["https://hardinlawpllc.com/", "https://childrenshealthdefense.org/", "https://childrenshealthdefense.org/defender/", "https://osse.dc.gov/release/osse-encourages-families-receive-required-immunizations", "https://childrenshealthdefense.org/defender/dc-schools-dc-government-covid-vaccine-mandate/", "https://na01.safelinks.protection.outlook.com/?url=https%3A%2F%2Fcode.dccouncil.us%2Fus%2Fdc%2Fcouncil%2Flaws%2F23-193&data=05%7C01%7C%7C6e94dabf658841dea19b08db102023ea%7C84df9e7fe9f640afb435aaaaaaaaaaaa%7C1%7C0%7C638121502474199195%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C3000%7C%7C%7C&sdata=ib2BG7tfCCdtvLrFt7raymfy7QwMcfl1M4jpKwDK9c4%3D&reserved=0", "https://childrenshealthdefense.org/defender/doctors-tell-drug-regulators-vaccinating-kids-covid-irresponsible-unethical-unnecessary/", "https://childrenshealthdefense.org/wp-content/uploads/31-AMENDED-COMPLAINT-against-All-Defendants-filed-by-SHANITA-WILLIAMS-SHAMEKA-WILLIAMS-VICTOR-M.-BOOTH-JANE-HELLEWELL.-AttachmentsHazlehurst-Rolf.pdf", "https://childrenshealthdefense.org/wp-content/uploads/PI-memo-opinion-DC-minor-case.pdf", "https://www.rescuepost.com/.a/6a00d8357f3f2969e202b751747d39200b-pi", "https://amzn.to/3YBzQ8h", "https://www.rescuepost.com/.a/6a00d8357f3f2969e202b6852c5bde200d-pi", "https://amzn.to/3F3JsBr"], "authors": [], "publish_date": null}