{"result_id": "012033", "URL": "https://www.ageofautism.com/2021/12/no-red-card-for-the-covid-vaccine-even-as-footballers-are-collapsing.html", "timestamp": "2023-04-25 11:56:37 CEST+0200", "meta": {"description": "Daily Mail UK: Why Are So Many Footballers Collapsing? Why are so many footballers collapsing? There has been a worrying spike in cardiac arrests and stars retiring with heart-related issues, but leading sports cardiologist insists it is NOT to do...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.ageofautism.com/2021/12/no-red-card-for-the-covid-vaccine-even-as-footballers-are-collapsing.html", "encoding": "utf-8"}, "image": null, "domain": "www.ageofautism.com", "title": "No Red Card for the Covid Vaccine Even As Footballers Are Collapsing", "cleaned_text": "Daily Mail UK: Why Are So Many Footballers Collapsing?\n\n\n\nWhy are so many footballers collapsing? There has been a worrying spike in cardiac arrests and stars retiring with heart-related issues, but leading sports cardiologist insists it is NOT to do with Covid vaccine. \n\n\n\nSimple question. Does the above look familiar? Replace cardiologists with pediatricians. Drop \"Covid\" and pluralize vaccines. Autism. Autism. Autism. Same playbook being used to gaslight, heck, to poison gas the population into disbelieving what is happening before their very eyes. Healthy men at the peak of fitness, men who have been required to get a Covid vaccine with heart issues as a side effect - required to work/play their sport - are collapsing.\n\nNine years separated Marc-Vivien Foe's death from a heart attack on a pitch in Lyon to Fabrice Muamba's near-fatal collapse at Tottenham, and another nine passed before Christian Eriksen was brought back to life at Euro 2020 this summer.\n\nThree of the most harrowing in-game episodes that football has seen were spread over more than 18 years, yet it feels that barely a week goes by at the moment without news of another cardiac-related incident in the game.\n\nThe sad confirmation on Wednesday that Sergio Aguero has been forced to retire at the age of 33 due to an arrhythmia followed news that Victor Lindelof has been wearing a heart monitor this week after leaving Manchester United's game at Norwich on Sunday clutching his chest.", "opengraph": {"title": "No Red Card for the Covid Vaccine Even As Footballers Are Collapsing", "site_name": "AGE OF AUTISM", "type": "blog", "url": "https://www.ageofautism.com/2021/12/no-red-card-for-the-covid-vaccine-even-as-footballers-are-collapsing.html", "description": "Daily Mail UK: Why Are So Many Footballers Collapsing? Why are so many footballers collapsing? There has been a worrying spike in cardiac arrests and stars retiring with heart-related issues, but leading sports cardiologist insists it is NOT to do...", "image": "https://www.rescuepost.com/.a/6a00d8357f3f2969e20282e1391cd4200b-600wi"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.rescuepost.com/.a/6a00d8357f3f2969e20282e1391cd4200b-pi", "https://www.dailymail.co.uk/sport/sportsnews/article-10314165/Football-seen-worrying-spike-cardiac-arrests-heart-related-issues-2021.html"], "authors": [], "publish_date": null}