{"result_id": "012018", "URL": "https://www.ageofautism.com/2021/08/pregnancy-risk-summary-in-pfizer-covid-vaccine.html", "timestamp": "2023-04-25 11:56:24 CEST+0200", "meta": {"description": "Imagine you're 16 and just crashed your parents' car into the neighbor's mailbox. You might start like this, \"Look, many new drivers have minor accidents as part of their learning curve. It's common. It happens.\" The Bloomberg article I screensnapped...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.ageofautism.com/2021/08/pregnancy-risk-summary-in-pfizer-covid-vaccine.html", "encoding": "utf-8"}, "image": null, "domain": "www.ageofautism.com", "title": "Pregnancy Risk Summary in Pfizer Covid Vaccine", "cleaned_text": "Imagine you're 16 and just crashed your parents' car into the neighbor's mailbox. You might start like this, \"Look, many new drivers have minor accidents as part of their learning curve. It's common. It happens.\" The Bloomberg article I screensnapped is cruel and inflammatory. Covax shaming at its nadir. OBs don’t have enough data to tell their patients with certainty what they face from Covid or the vaccine. The tone of blame is shameful.\n\nHere is the package insert from the Pfizer vaccine. They named it Comirnaty. I guess Qwerty was taken.\n\n\n\nhttps://www.fda.gov/media/151707/download\n\n\n\n1) Read the very first sentence of package insert information on pregnancy risk from the newly approved Pfizer jab: All pregnancies have a risk of birth defect, loss, or other adverse outcomes. \n\n\n\n2) When you read, \"...no evidence of harm,\" you can perk up your ears. Vaccination en mass did not begin until January or later in 2021. A full term pregnancy is considered 40 weeks. Babies born to the very first vaccination cohort have not been born yet. The package insert says that a developmental toxicity study was performed on rats. In reality, we have no idea the impact of Covid vaccination on mother or child yet.\n\n\n\n3) NPR quotes CDC: The vaccine is also safe later in a pregnancy and while breastfeeding, the agency's new analysis indicates. Package insert reads: It is not known whether COMIRNATY is excreted in human milk. Data are not available to assess the effects of COMIRNATY on the breastfed infant or on milk production/excretion.\n\nRisk Summary \n\n\n\nAll pregnancies have a risk of birth defect, loss, or other adverse outcomes. In the US general population, the \n\nestimated background risk of major birth defects and miscarriage in clinically recognized pregnancies is 2% to 4% and 15% to 20%, respectively. Available data on COMIRNATY administered to pregnant women are insufficient to inform vaccine-associated risks in pregnancy. A developmental toxicity study has been performed in female rats administered the equivalent of a single human dose of COMIRNATY on 4 occasions; twice prior to mating and twice during gestation. These studies revealed no evidence of harm to the fetus due to the vaccine (see Animal Data)", "opengraph": {"title": "Pregnancy Risk Summary in Pfizer Covid Vaccine", "site_name": "AGE OF AUTISM", "type": "blog", "url": "https://www.ageofautism.com/2021/08/pregnancy-risk-summary-in-pfizer-covid-vaccine.html", "description": "Imagine you're 16 and just crashed your parents' car into the neighbor's mailbox. You might start like this, \"Look, many new drivers have minor accidents as part of their learning curve. It's common. It happens.\" The Bloomberg article I screensnapped...", "image": "https://www.rescuepost.com/.a/6a00d8357f3f2969e20282e11b59fc200b-600wi"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.rescuepost.com/.a/6a00d8357f3f2969e202788042dc03200d-pi", "https://www.fda.gov/media/151707/download", "https://www.rescuepost.com/.a/6a00d8357f3f2969e20282e11b59fc200b-pi", "https://www.npr.org/sections/health-shots/2021/08/11/1026555595/pregnant-cdc-urges-covid-vaccination-icus-fill-unvaccinated-delta", "https://www.npr.org/sections/health-shots/2021/08/11/1026555595/pregnant-cdc-urges-covid-vaccination-icus-fill-unvaccinated-delta"], "authors": [], "publish_date": null}