{"result_id": "012017", "URL": "https://www.ageofautism.com/2020/05/further-anomalies-of-the-oxford-coronavirus-vaccine.html", "timestamp": "2023-04-25 11:56:23 CEST+0200", "meta": {"description": "by John Stone On 27 April a New York Times article reported excitedly the result animal trials of the Oxford Coronavirus vaccine: \"Scientists at the National Institutes of Health’s Rocky Mountain Laboratory in Montana last month inoculated six rhesus macaque...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.ageofautism.com/2020/05/further-anomalies-of-the-oxford-coronavirus-vaccine.html", "encoding": "utf-8"}, "image": null, "domain": "www.ageofautism.com", "title": "Further Anomalies of the Oxford Coronavirus Vaccine", "cleaned_text": "On 27 April a New York Times article reported excitedly the result animal trials of the Oxford Coronavirus vaccine:\n\n\"Scientists at the National Institutes of Health’s Rocky Mountain Laboratory in Montana last month inoculated six rhesus macaque monkeys with single doses of the Oxford vaccine. The animals were then exposed to heavy quantities of the virus that is causing the pandemic... But more than 28 days later all six were healthy, said Vincent Munster, the researcher who conducted the test..\"\n\nThis would have been just as well because just four days earlier on 23 April Oxford Vaccine Group under the leadership of Andrew Pollard amid immense publicity had begun experimenting on human subjects. On 30 April a contract was announced with AstraZeneca to manufacutre the vaccine, promising to deliver an entirely new vaccine to the market at unprecedented speed by September. The only trouble was that when the results of the animal trial came to light in mid-May it was disclosed that on the contrary all the monkeys had become ill. The Daily Mail reported:\n\n\"In the latest animal trials of the vaccine carried out on rhesus macaques, all six of the participating monkeys went on to catch the coronavirus.\n\n\"Dr William Haseltine, a former Harvard Medical School professor, revealed the monkeys who received the vaccine had the same amount of virus in their noses as the three non-vaccinated monkeys in the trial.\n\nThis suggests the treatment, which has already received in the region of £90 million in government investment, may not halt the spread of the deadly disease.\"\n\n\"There is a second troubling result of the Oxford paper. The titer of neutralizing antibody, as judged by inhibition of virus replication by successive serum dilutions as reported is extremely low. Typically, neutralizing antibodies in effective vaccines can be diluted by more than a thousand fold and retain activity. In these experiments the serum could be diluted only by 4 to 40 fold before neutralizing activity was lost.\"\n\nManifestly, human testing proceeded both against an entirely misleading background, and prematurely - which poses the most serious ethical questions. And now that we know that though the product was defective everything ploughs on regardless - Oxford/AstraZeneca now have contracts for hundreds of millions of rounds of the vaccine from both the British and the United States government.The British government has both a huge financial investment in the product and a reputational one, but it may help that Prof Pollard is both an adviser to the British regulator and chair of the committee recommends vaccine for public use.\n\nJohn Stone is UK Editor for Age of Autism.", "opengraph": {"title": "Further Anomalies of the Oxford Coronavirus Vaccine", "site_name": "AGE OF AUTISM", "type": "blog", "url": "https://www.ageofautism.com/2020/05/further-anomalies-of-the-oxford-coronavirus-vaccine.html", "description": "by John Stone On 27 April a New York Times article reported excitedly the result animal trials of the Oxford Coronavirus vaccine: \"Scientists at the National Institutes of Health’s Rocky Mountain Laboratory in Montana last month inoculated six rhesus macaque...", "image": "https://www.rescuepost.com/.a/6a00d8357f3f2969e20264e2dd8b08200d-600wi"}, "tags": [], "tweets": [], "movies": [], "links": ["https://upload.wikimedia.org/wikipedia/commons/thumb/c/cf/High_Street%2C_Oxford%2C_England%2C_1890s.jpg/220px-High_Street%2C_Oxford%2C_England%2C_1890s.jpg", "https://www.nytimes.com/2020/04/27/world/europe/coronavirus-vaccine-update-oxford.html", "https://www.independent.co.uk/news/health/coronavirus-vaccine-oxford-trial-university-volunteers-covid-19-a9527636.html", "http://www.ox.ac.uk/news/2020-04-23-oxford-covid-19-vaccine-begins-human-trial-stage", "https://www.dailymail.co.uk/sciencetech/article-8331709/Oxford-coronavirus-vaccine-does-not-stop-infection-experts-warn.html", "https://www.forbes.com/sites/williamhaseltine/2020/05/16/did-the-oxford-covid-vaccine-work-in-monkeys-not-really/#1bd6296b3c71", "https://www.ageofautism.com/2020/04/british-government-plays-with-fire-over-covid-19-enter-prof-pollard.html"], "authors": [], "publish_date": null}