{"result_id": "012035", "URL": "https://www.ageofautism.com/the-vaccine-autism-link.html", "timestamp": "2023-04-25 11:56:39 CEST+0200", "meta": {"description": "Age of Autism embraces the belief expressed by the great Bernie Rimland that “the autism epidemic is real, and excessive vaccinations are the cause.” This carefully calibrated statement reflects several of our core beliefs: The autism epidemic is real. This...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.ageofautism.com/the-vaccine-autism-link.html", "encoding": "utf-8"}, "image": null, "domain": "www.ageofautism.com", "title": "The Vaccine Autism Link", "cleaned_text": "Age of Autism embraces the belief expressed by the great Bernie Rimland that “the autism epidemic is real, and excessive vaccinations are the cause.”\n\nThis carefully calibrated statement reflects several of our core beliefs:\n• The autism epidemic is real. This fundamental truth has been established time and again, completely independent of any concern about vaccination as the cause. Yet there are epidemic deniers in medicine and the media who keep claiming otherwise. This pernicious nonsense detracts from the effort to find out why there has been a twenty-fold increase in the past two decades. Since the rise in autism is real, the cause can only be environmental, and finding that cause becomes the clear priority for all honest research.\n• Vaccines are causing the autism epidemic. Exactly how that is taking place is subject to much discussion both within and without the vaccine safety community – again, vaccine injury denialists claim it never happens. But far too many parents, families, and an increasing number of independent journalists and medical professionals know the truth. Vaccines that are untested and unsafe when given individually or in combinations – whether a mercury-laden flu shot in utero, as many as nine vaccinations at 6 months, or the MMR at age 1 – are clearly implicated. Because that threatens many powerful interests and comfortable orthodoxies, confronting the vaccine-autism link is assiduously avoided.\n• A delayed or less aggressive vaccination schedule would reduce the autism rate significantly. Parents should find ways to educate themselves and each other about the risks. They also must be free to choose which vaccinations they want their child to receive and when, and they must be free to reject vaccination entirely.\n• Yet the whole debate over vaccine safety and parental choice has been framed in terms of infectious disease and declared too dangerous to be allowed. We don’t buy that, and we exist to give voice to those whose concerns have been suppressed, denied or lied about.\n• Children who have never been vaccinated can develop autism. That seems to be rare, but it probably points to other toxic exposures such as pesticides, certain medications in infancy or childhood, or genetic vulnerabilities that are triggered in ways not yet understood. Also, vaccination has become so widespread and intrusive that some children may have been vaccinated at birth or later without their parents’ knowledge. Vaccination of parents and grandparents can cause epigenetic changes affecting their offspring that have not been adequately studied.\n• The idea that vaccines might trigger autism “in a small subset of children,” and that is somehow okay or inevitable, is the wrong way to look at the issue. What subset? What children? Why? At 1 in 68, that is not a small subset, and while there are certain risk factors that parents should look for – including auto-immune disease in the mother or the family, mitochondrial anomalies, a child being unwell at the time of a scheduled vaccination, a history of previous reactions by the child, siblings or other family – there are too many unknowns to decide “the coast is clear” for all but some imagined group that medical authorities like to suggest would have developed autism anyway. There is no effort being made to identify such a subset or subsets, and it’s unlikely to happen as long as the CDC holds tight to vaccine safety monitoring at the same time as it recommends the childhood immunization schedule. This conflict of interest alone ought to make careful parents realize that, on this issue as on many others, they simply cannot trust the government. A safer vaccination schedule, no mandates, and a respect for parental choice are the real solutions.\n• The current crisis in children’s health is much broader than autism. Over half have a chronic or developmental condition, and that is also mostly the result of vaccine zealotry run amok along with excessive interventions like too many antibiotics and pain relievers, often given in conjunction with vaccination.\n• Autism is the defining disorder of our Age and points to the terrible state of health care in America, the suppression of free speech and the triumph of a kind of political correctness that is essentially a smiling mask for good old-fashioned bullying.\n\n9. Nobody should have the power to ruin your life simply because they think it will make someone else’s better.\n\nFor further information: Vaccines 2.0 – A Careful Parent’s Guide to Making Safe Vaccination Choices for Your Children, by Mark Blaxill and Dan Olmsted.\n\nDenial: How Refusing to Face the Facts about Our Autism Epidemic Hurts Children, Families, and Our Future, by Mark Blaxill and Dan Olmsted.", "opengraph": {"title": "The Vaccine Autism Link", "site_name": "AGE OF AUTISM", "type": "blog", "url": "https://www.ageofautism.com/the-vaccine-autism-link.html", "description": "Age of Autism embraces the belief expressed by the great Bernie Rimland that “the autism epidemic is real, and excessive vaccinations are the cause.” This carefully calibrated statement reflects several of our core beliefs: The autism epidemic is real. This...", "image": "https://www.rescuepost.com/.a/6a00d8357f3f2969e201b8d1ecec8b970c-600wi"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.rescuepost.com/.a/6a00d8357f3f2969e201b8d1ecec8b970c-pi", "https://www.amazon.com/Vaccines-2-0-Careful-Parents-Vaccination/dp/1629147311?ie=UTF8&keywords=vaccines%202.0&qid=1462377824&ref_=sr_1_1&sr=8-1", "https://www.amazon.com/Denial-Refusing-Epidemic-Children-Families/dp/1510716947"], "authors": [], "publish_date": null}