{"result_id": "012012", "URL": "https://www.ageofautism.com/2020/10/triumph-and-ambush-vaccines-to-be-rolled-up-in-the-uk-next-month.html", "timestamp": "2023-04-25 11:56:18 CEST+0200", "meta": {"description": "by John Stone A news story in the Sun newspaper suggests that coronavirus vaccines will be rolled out in the UK as early as next month: “VACCINE BOOST:NHS ready to roll out covid jab from next month with tens of...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.ageofautism.com/2020/10/triumph-and-ambush-vaccines-to-be-rolled-up-in-the-uk-next-month.html", "encoding": "utf-8"}, "image": null, "domain": "www.ageofautism.com", "title": "\"Triumph\" and \"Ambush\" vaccines to be rolled out in the UK next month?", "cleaned_text": "A news story in the Sun newspaper suggests that coronavirus vaccines will be rolled out in the UK as early as next month: “VACCINE BOOST:NHS ready to roll out covid jab from next month with tens of thousands of people being vaccinated before Christmas”. While this runs against so many apparently informed reports that vaccines may not be available until way into next year it coincides with the consultation last month to suspend licensing regulations to allow roll out this year.The report states:\n\n“The first mass vaccination centres are planned for sites in major cities including Leeds, Hull and London...They will be supported by hundreds of mobile vaccination units dotted nationwide, while roving teams will visit care homes and vulnerable Brits.”\n\n“Mass vaccination sites and mobile facilities are being commissioned as part of as a \"fairly massive exercise\"...According to the document, the two vaccines are called Ambush and Triumph...Ambush needs to be stored at -70C (-94F) and kept in hospitals due to regulations set down by the Medicines Health Regulatory Authority.” ”Triumph” is thought to be the Oxford Astra Zeneca vaccine which requires two vaccinations within 28 days and the one requiring extreme refrigeration is likely the Moderna vaccine which has novel RNA engineering which has been closely backed by Bill Gates. Neither of the products is likely to prevent the disease at a useful level as even articles in the New York Times and the Washington Post highlight. According to the Daily Mail: Under the proposed ranking by the Joint Committee on Vaccination and Immunisation, the vaccines will be rolled out in the following order:\n• all those 80 years of age and over and health and social care workers\n• all those 75 years of age and over\n• all those 70 years of age and over\n• all those 65 years of age and over\n• high-risk adults under 65 years of age with underlying health woes\n• moderate-risk adults under 65 years of age with underlying health woes\n• all those 60 years of age and over\n• all those 55 years of age and over\n• all those 50 years of age and over\n• rest of the population (priority to be determined) The Joint Committee on Vaccination and Immunisation is chaired by Andrew Pollard who is also lead developer of the Oxford vaccine. Both vaccines are already known to have unpleasant side-effects. The Oxford Astra Zeneca Vaccine is still under investigation by the FDA.", "opengraph": {"title": "\"Triumph\" and \"Ambush\" vaccines to be rolled out in the UK next month?", "site_name": "AGE OF AUTISM", "type": "blog", "url": "https://www.ageofautism.com/2020/10/triumph-and-ambush-vaccines-to-be-rolled-up-in-the-uk-next-month.html", "description": "by John Stone A news story in the Sun newspaper suggests that coronavirus vaccines will be rolled out in the UK as early as next month: “VACCINE BOOST:NHS ready to roll out covid jab from next month with tens of...", "image": "https://www.rescuepost.com/.a/6a00d8357f3f2969e20263e96c4e55200b-600wi"}, "tags": [], "tweets": [], "movies": [], "links": ["https://news.images.itv.com/image/file/2221908/article_update_img.jpg", "https://www.thesun.co.uk/news/12872851/nhs-gear-up-covid-jab-roll-out-next-month/", "https://www.ageofautism.com/2020/09/response-to-the-british-government-proposal-to-roll-out-a-covd-19-vaccine-before-christmas.html", "https://www.thesun.co.uk/news/12834691/coronavirus-vaccine-roll-out-uk-months-easter/", "https://www.bbc.co.uk/news/uk-england-birmingham-54375643", "https://www.nytimes.com/2020/09/22/opinion/covid-vaccine-coronavirus.html", "https://www.washingtonpost.com/opinions/2020/09/22/beware-covid-19-vaccine-trials-designed-succeed-start/", "https://www.dailymail.co.uk/news/article-8816703/Covid-vaccine-rolled-MONTH-tens-thousands-getting-jab-day-Christmas.html?ito=push-notification&ci=39104&si=7211781", "https://www.ageofautism.com/2020/09/response-to-the-british-government-proposal-to-roll-out-a-covd-19-vaccine-before-christmas.html", "https://www.wired.com/story/covid-19-vaccines-with-minor-side-effects-could-still-be-pretty-bad/", "https://www.foxbusiness.com/markets/fda-widens-safety-inquiry-astrazeneca-us-coronavirus-vaccine-report"], "authors": [], "publish_date": null}