{"result_id": "012036", "URL": "https://www.ageofautism.com/2020/11/the-problem-with-the-covid-vaccine-robert-f-kennedy-jr-explains-to-theo-von.html", "timestamp": "2023-04-25 11:56:39 CEST+0200", "meta": {"description": "\"The Moderna vaccine was completely developed by Tony Fauci, he hands it to a private group, they put 2 billion dollars of federal money into allowing them to develop it, and then Tony Fauci’s agency keeps half the profits from...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.ageofautism.com/2020/11/the-problem-with-the-covid-vaccine-robert-f-kennedy-jr-explains-to-theo-von.html", "encoding": "utf-8"}, "image": null, "domain": "www.ageofautism.com", "title": "The Problem With the COVID Vaccine Robert F. Kennedy Jr. Explains to Theo Von", "cleaned_text": "The Problem With the COVID Vaccine Robert F. Kennedy Jr. Explains to Theo Von\n\n\n\n \n\n\"The Moderna vaccine was completely developed by Tony Fauci, he hands it to a private group, they put 2 billion dollars of federal money into allowing them to develop it, and then Tony Fauci’s agency keeps half the profits from the vaccine. I’ve sued EPA many times for being a captured agency, but what would it be like if EPA made half of its profits selling coal?\" \n\n\n\nBy Anne Dachel The Problem With the COVID Vaccine | Robert F. Kennedy Jr. Explains to Theo Von Robert Kennedy, Jr.: \n\n\n\nThe problem with the COVID vaccine, here’s the problem. They have all these vaccines, and they recognize that it’s going to be really hard to get a vaccine that does what people think it’s going to do. They have been reducing the standards to make it so they can pass a vaccine no matter what. Theo Von: And what they think it’s going to do is make it so they don’t have to worry about COVID at all. Kennedy: Right. If you get a shot, you’re protected, and you’re not going to transmit it. Particularly we want to make sure that the people who are vulnerable, so people with co morbidities and fragile elderly, that it’s going to keep them from dying. What they did is—the testing protocols that they’re using do not require them to show any of those things. I’ll tell you how it works. They take 22,000 people and they give them the Pfizer vaccine. And they take 22,000 people and give them a placebo. Then they wait. It’s double blind, so the way it’s supposed to work is neither the patients, the test subjects, the volunteers or the researchers know who got what. Then you wait till a hundred people get sick from COVID. That takes a while because you had 40,000 people and it’s kind of hard nowadays to get sick from COVID. You’re not going to have the majority of those people exposed, so after a 100 people get sick, they stop the study and look at it. Then they say, how many of those people got the vaccine and how many got the placebo? And if 50 percent of them got the vaccine and 50 percent got the placebo means there’s zero efficacy, and the vaccine doesn’t work. In this case with Pfizer everybody’s excited because they stopped the study when 95 people got sick. Apparently 85 of those people were in the placebo group, which means the vaccine appears to be 90 percent effective. Here’s the problem: The way they measure whether you have COVID is you have one positive PCR test and you have one symptom. That could be a cough, it could be a fever, it could be a chill, it could be a headache. Then you have COVID. So what they’re testing the vaccine for IS NOT what we want to know: DOES IT PREVENT YOU FROM DYING? Does it prevent you from being hospitalized? We will never know because they have geared back the studies—Peter Doshi who’s the editor of the British Medical Journal, he said this in a New York Times editorial, he said, “These studies were designed to succeed. You cannot fail.” No matter how bad the vaccine is, it’s going to pass. \n\n\n\nVon: Because we want a vaccine, right? Kennedy: Everybody wants a vaccine so we can restart the economy. The big problem with this vaccine—there’s two problems. ONE is it does not prevent transmission. That means I can get the vaccine, and then I get exposed to COVID, I still give COVID to you and everybody on the airplane. Von: You just don’t experience it. \n\n\n\nKennedy: I don’t experience it, but it makes it even more dangerous— \n\n\n\nVon: No one even knows you have it.\n\nKennedy: Normally if I got sick, then I’d stay home and I wouldn’t infect anybody, but if I’m feeling like a million bucks I become a super spreader like Typhoid Mary. That’s what apparently this vaccine does. If stops you from knowing it, but you continue to transmit it. THE OTHER PROBLEM is they’re only testing them for a month, two months. You’re not going to see bad side effects till maybe a year out. A lot of these injuries that you get from vaccines have very long incubation periods: autoimmune disease like diabetes, rheumatoid arthritis, Graves’ disease, Crohn’s disease, IBS, or food allergies. And what Pfizer is doing which is very dishonest, is as soon as it finishes the study, it unblinds it, so everybody knows you got the vaccine, you got the placebo. Then it takes all the people in the placebo group, and it gives them the real vaccine. So now we completely are unable to tell whether there’s long term injuries— \n\n\n\nVon: It’s like cover your future tracks. \n\n\n\nKennedy: Exactly. It’s a trick that they’ve used in the vaccine industry. That’s the same thing that they did with the Gardasil vaccine. It makes it impossible for anybody to ever know whether the reason they’re getting sick is because of that vaccine or whether it was just bad luck. \n\n\n\nVon: Is it our government that’s giving so much power to these companies and less thoughtfulness to the safety of humanity? \n\n\n\nKennedy: The problem is the entire sort of medical cartel is now feeding at the tit of Big Pharma. The universities are getting all their money from sponsoring clinical trials. The regulatory agencies are subject to what we call regulatory capture. They’ve become sock puppets for the industry that they’re supposed to regulate. You see that everywhere. I’ve been suing regulatory agencies for 40 years, EPA and the state agency, for example, famously in Louisiana is utterly run by the oil industry and is corrupt. The corruption is particularly acute in HHS [Health and Human Services] and the reason for that is that the agencies are really part of the industry. Half of CDC’s budget goes to buying and selling vaccines. FDA, half of its budget comes from the pharmaceutical companies. And with NIH [National Institutes of Health] which is the other big agency, they are collecting tens of millions or hundreds of millions of dollars on vaccine patents. So they work on the vaccine at the outset, they transfer the patent to Gilead or Pfizer. The Moderna vaccine was completely developed by Tony Fauci, he hands it to a private group, they put 2 billion dollars of federal money into allowing them to develop it, and then Tony Fauci’s agency keeps half the profits from the vaccine. I’ve sued EPA many times for being a captured agency, but what would it be like if EPA made half of its profits selling coal? It’s the same thing. These agencies are not independent agencies. They’re completely captured. All of the other institutions of government that should stand between a greedy corporation and a vulnerable child have been compromised. Congress gets more money, lobby money, from the pharmaceutical industry than any other industry. They give them double what oil and gas does. I’m talking about lobbyists. There’s more pharma lobbyists on Capitol Hill than there are Congressmen, Senators and Supreme Court justices combined. The regulatory agencies have been captured. The press is utterly captured, and that’s because in 1997 we passed a law in this country, or the FDA changed the regulation to make it legal for the first time for television and radio and newspapers to advertise pharmaceutical products on the air direct to consumer. There’s only two countries in the world that allow that. Everybody agrees, it’s a terrible thing to do. Von: It’s half of our commercials as well. Kennedy: Roger Ailes who founded Fox told me that there are 22 commercials on his average evening news show and 17 of those are pharmaceutical. Von: Yeah, I’m just trying to get through half of Family Guy, and the next thing you know I have HIV by the end of the episode. A lot of it is fear too. And they give you pictures like, oh here’s a happy family, but you might have this looming in the distance. You might have scoliosis …", "opengraph": {"title": "The Problem With the COVID Vaccine Robert F. Kennedy Jr. Explains to Theo Von ", "site_name": "AGE OF AUTISM", "type": "blog", "url": "https://www.ageofautism.com/2020/11/the-problem-with-the-covid-vaccine-robert-f-kennedy-jr-explains-to-theo-von.html", "description": "\"The Moderna vaccine was completely developed by Tony Fauci, he hands it to a private group, they put 2 billion dollars of federal money into allowing them to develop it, and then Tony Fauci’s agency keeps half the profits from...", "image": "https://www.rescuepost.com/.a/6a00d8357f3f2969e2026bdea61b55200c-600wi"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "460", "height": "315", "embed_code": "<iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/9sW0OmzcmL0\" width=\"460\"/>", "src": "https://www.youtube.com/embed/9sW0OmzcmL0"}], "links": ["https://www.ageofautism.com/2020/11/the-problem-with-the-covid-vaccine-robert-f-kennedy-jr-explains-to-theo-von.html", "https://www.rescuepost.com/.a/6a00d8357f3f2969e2026bdea61b55200c-pi"], "authors": [], "publish_date": null}