{"result_id": "012047", "URL": "https://www.ageofautism.com/2022/11/the-defender-14-year-old-leads-miserable-life-after-being-injured-by-vaccines-as-an-infant.html", "timestamp": "2023-04-25 11:56:52 CEST+0200", "meta": {"description": "From The Defender: Exclusive: 14-Year-Old Leads ‘Miserable Life’ After Being Injured by Vaccines as an Infant This will not be an easy article to read, so many of us know the heartache all too well. We trusted. We did not...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.ageofautism.com/2022/11/the-defender-14-year-old-leads-miserable-life-after-being-injured-by-vaccines-as-an-infant.html", "encoding": "utf-8"}, "image": null, "domain": "www.ageofautism.com", "title": "The Defender: 14-Year-Old Leads ‘Miserable Life’ After Being Injured by Vaccines as an Infant", "cleaned_text": "From The Defender: Exclusive: 14-Year-Old Leads ‘Miserable Life’ After Being Injured by Vaccines as an Infant\n\nThis will not be an easy article to read, so many of us know the heartache all too well. We trusted. We did not know we were gambling. You can subscribe to The Defender from CHD HERE.\n\nLaura Chicos, now 14, leads “a miserable life,” according to her mother, with allergic reactions to “almost everything,” including but not limited to food, dust and environmental contaminants.\n\nOver a period of 15 years, Ines Chicos, Ph.D., a research coordinator with a doctoral degree in psychology, built a bright scientific career.\n\nToday, Chicos primarily stays at home in Queens, New York, taking care of her daughter, Laura, who at the age of 2 months first experienced adverse events following a DTP (diphtheria, tetanus and pertussis, or whooping cough) vaccine.\n\nLaura, now 14, leads “a miserable life,” according to her mother, with allergic reactions to “almost everything,” including but not limited to food, dust and environmental contaminants. This forces Laura, who experiences difficulty eating, to follow a strict diet. The allergies also interfere with Laura’s studies.\n\nIn an exclusive interview with The Defender, Chicos discussed her daughter’s injuries and the challenges she faces today.\n\nShe also detailed her family’s mostly unsuccessful efforts to obtain justice and get answers for Laura. Extensive documentation provided to The Defender corroborates the family’s claims.\n\nFirst symptoms appeared two months after birth\n\nLaura was born on Dec. 4, 2007, and was, by all accounts, healthy at birth and up until her first injection of the DTP vaccine on Feb. 9, 2008, when she was just over 2 months old.\n\nLaura previously had received the hepatitis B vaccine and Vitamin K at birth — the former without her parents’ knowledge, according to documentation provided by her family.\n\nAccording to her mother, Laura “got a rash on [her] body within one week of vaccination, bloody eczema on the face and elbow creases within three weeks of vaccination.” Her eczema would then flare up over time.\n\nA medical history provided by Laura’s family stated that she experienced a “severe skin reaction after the 2 months vaccine and probably became allergic to [the] injected ingredients,” adding that she tested allergic to cow’s milk, yeast protein and eggs prior to reaching age 1.\n\nAlthough stopping cow’s milk and eggs “helped her symptoms,” according to another medical report, she continued experiencing allergy flares “on and off.”\n\nChicos continued to allow Laura to be vaccinated despite her being allergic to some of the ingredients in the vaccines, particularly Pediarix. According to a medical history provided by Laura’s family though, “as per pediatrician, no allergy test was done [at the age of 4 months] because she was too small.”\n\nLaura received DTP doses at 4 and 6 months old, and four total hepatitis B doses. When she was 6 months old, Laura again received the DTP and hepatitis B vaccines and she was introduced to solid food. Allergy symptoms were still “waxing and waning.”", "opengraph": {"title": "The Defender: 14-Year-Old Leads ‘Miserable Life’ After Being Injured by Vaccines as an Infant", "site_name": "AGE OF AUTISM", "type": "blog", "url": "https://www.ageofautism.com/2022/11/the-defender-14-year-old-leads-miserable-life-after-being-injured-by-vaccines-as-an-infant.html", "description": "From The Defender: Exclusive: 14-Year-Old Leads ‘Miserable Life’ After Being Injured by Vaccines as an Infant This will not be an easy article to read, so many of us know the heartache all too well. We trusted. We did not...", "image": "https://www.rescuepost.com/.a/6a00d8357f3f2969e202af1c8f17bd200d-600wi"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.rescuepost.com/.a/6a00d8357f3f2969e202af1c8f17bd200d-pi", "https://childrenshealthdefense.org/defender/laura-chicos-allergic-reactions-vaccines-injuries/", "https://childrenshealthdefense.org/vaccinesafety/", "https://childrenshealthdefense.org/defender/", "https://childrenshealthdefense.org/defender/parents-questioning-routine-childhood-vaccines-covid/", "https://childrenshealthdefense.org/wp-content/uploads/medical-history-summary.pdf", "https://childrenshealthdefense.org/wp-content/uploads/medical-history-summary.pdf", "https://childrenshealthdefense.org/wp-content/uploads/Kalz-Feb-2021.pdf", "https://childrenshealthdefense.org/defender/petition-fda-inconsistent-labeling-childhood-vaccines-aluminum/", "https://childrenshealthdefense.org/wp-content/uploads/Kalz-Feb-2021.pdf"], "authors": [], "publish_date": null}