{"result_id": "012028", "URL": "https://www.ageofautism.com/2023/02/truth-be-told-by-lou-conte-on-pfizers-veterinarian-vaccine-maker.html", "timestamp": "2023-04-25 11:56:32 CEST+0200", "meta": {"description": "Please check out Lou Conte's SubStack called \"Truth Be Told.\" Lou's super power (one of them) is that his decades of law enforcement work in the Westchester County (NY) Sex Offender Probations department gave him a keen insight into LIARS....", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.ageofautism.com/2023/02/truth-be-told-by-lou-conte-on-pfizers-veterinarian-vaccine-maker.html", "encoding": "utf-8"}, "image": null, "domain": "www.ageofautism.com", "title": "Truth Be Told by Lou Conte on Pfizer's Veterinarian Vaccine Maker and Flying Pigs?", "cleaned_text": "Truth Be Told by Lou Conte on Pfizer's Veterinarian Vaccine Maker and Flying Pigs?\n\nPlease check out Lou Conte's SubStack called \"Truth Be Told.\" Lou's super power (one of them) is that his decades of law enforcement work in the Westchester County (NY) Sex Offender Probations department gave him a keen insight into LIARS. And that comes in handy in the autism vaccine injury world. After his retirement, Lou became a LIE DETECTOR. He's a forensic Psychophysiologist (Polygraph Examiner). In his recent article on Substack, he takes on Albert Bourla of Pfizer. \n\n\n\nSubscribe for free, or with a paid subscription, to his SubStack today. Louis Conte’s The Truth be Told: Exploring corruption, controversy, and deception in today’s world from the perspective of a forensic psychophysiologist (Polygraph Examiner). Louis Conte is a professional Polygraph Examiner, investigator, and writer. In addition to the thousands of offenders he interviewed over his thirty-three years in law enforcement, Conte has conducted over fourteen hundred polygraph examinations. He uses well-honed observation skills to ferret out the truth. Observation and careful attention to words and behavior often reveal the truth. Dr. Albert Bourla, the CEO of Pfizer is regarded as the strong, relentless leader who pushed his staff to develop and produce the Covid vaccine, Comirnaty, in partnership with a German company, BioNTech. Bourla has made Pfizer’s mRNA Covid vaccine the most profitable vaccine in history. Pfizer’s revenues doubled in 2021. Bourla is a veterinarian and, according to Wikipedia, his doctoral thesis (1991) is titled \"Effect of melatonin implants on sperm characteristics and on the freeze-ability of Karagouniki Ram semen.\" Bourla is also a noteworthy figure in the pork industry for his work on a pharmaceutical product which eradicated “Boar Taint.” This is the offensive odor or taste produced during the cooking of pork products derived from non-castrated male pigs once they reach puberty. In other words, Albert Bourla made pigs smell and taste better. Under Bourla’s leadership, a vaccine that should have taken ten years to bring to market was ready in just eight months. The man who began his career doing pharmaceutical research on goats and pigs is portrayed as the brilliant CEO who made the impossible, possible. The old Scottish idiom - When pigs fly - comes to mind. When Bourla claimed his vaccine’s effectiveness was 96% in November of 2020, the pigs actually flew. Many industry experts raised concerns about a vaccine that was brought to market in just eight months. Bourla insisted no safety corners were cut. He even found time to write a New York Times Bestseller about the project - Moonshot: Inside Pfizer's Nine-Month Race to Make the Impossible Possible.\n\nIn the mainstream media, Bourla is portrayed as a heroic figure and Comirnaty is described as being a monumental success. In most of his public appearances, Bourla seems to be a commanding executive. He is never asked tough questions by journalists; he speaks publicly under controlled settings. Bourla’s comfort level is clearly evident when he appeared on the CBS Morning Show. He is asked questions for which he was clearly prepared. Bourla handles the question about vaccine equity with aplomb. His use of his hands to illustrate his command of his answers reflects excellent preparation and training with public relations professionals. Bourla describes the miracle of producing a vaccine in just eight months when vaccines normally take ten years to develop. He announces that Comirnaty is “96% effective.” The interview ends with CBS News Anchor Gayle King announcing that she “is a Pfizer girl.” It should be pointed out, however, that the CBS Morning show is actually sponsored by Pfizer. So are several other legacy media outlets, according to Children’s Health Defense. One could say that Bourla’s interviews with journalists at CBS, CNN, ABC, and other media outlets are nothing more than pleasant chats with de facto employees. It is now clear, two years on, that the Pfizer Covid vaccine is not 96% effective. Vaccine mandates are falling by the wayside. The profit projections for Pfizer are headed downward. One analyst stated that Pfizer is struggling to escape its dependence on Covid drugs. Recently, Bourla has had to deal with some uncomfortable moments, including one at the 2023 World Economic Forum in Davos. In the video below, Bourla, accompanied by his security detail, is asked a number of difficult questions by independent journalists. Please watch as Albert Bourla’s does his walk of shame. Bourla, is clearly uncomfortable. He does not address the journalists from Rebel News. Bourla looks down and avoids eye contact. His only comments are, “Thank you” and “Have a nice day.” The journalists pepper him with questions about why he withheld information that the vaccine was unsuccessful in preventing Covid transmission. Why did he claim such high rates of effectiveness when the vaccine performed so poorly? The journalists ask Bourla about how Pfizer could take so much money from people for a vaccine that did not work. They question him about the reports of healthy people suddenly dropping dead. Bourla is walking quickly to avoid interacting with the journalists. He avoids eye contact and is so focused on the ground that he and his security team lose their bearings. Bourla is clearly flustered. Eventually, he and his entourage make a wrong turn and practically walk into a wall before correcting their route. As the walk continues Bourla remains silent as more tough questions are directed at him. When he is asked, “Who did you meet with here in secret? Will you disclose who you met with?” Bourla says nothing but gives a sly “Duper’s delight smile” – an inappropriate flashing smile that indicates the pleasure of being able to manipulate someone. The journalist then notes that Pfizer has paid 2.3 billion dollars in the past for deceptive advertising. He is asked, “Have you engaged in that same conduct again?” Bourla begins buttoning his jacket and tucking in his scarf, an indication of self-comforting behaviors. “Are you being investigated?” the journalist asks. The video ends with Bourla speeding up his pace and finding the correct entrance to the conference as the journalists shout, “Shame on you!” And, truth be told, an investigation is clearly needed. Legacy media outlets, who are “sponsored by Pfizer” have not demonstrated a willingness to do so. In response to the gentle treatment that Bourla and other pharmaceutical representatives have been receiving, independent journalists have started to play by different rules. Many people are questioning vaccine effectiveness and safety. There are serious questions looming about high excess death rates in heavily vaccinated nations. Could it be that those flying pigs have crashed landed? If you enjoy my articles about how body language often reveals truth, please consider enrolling in my Truth and Deception Course at Dr. Jack Lyons-Weiler’s IPAK.EDU. FREE on the Kindle app\n\n\n\nLies My Gov't Told Me: And the Better Future Coming (Children’s Health Defense) By Dr. Robert Malone \n\n\n\nGovernments intentionally weaponized fear to mold behavior. The media smeared anyone who objected to the narrative. FREE on the Kindle app\n\n\n\n \n\n\n\nCause Unknown What is causing this historic spike in deaths among younger people? What is causing the shift from the elderly to younger people?", "opengraph": {"title": "Truth Be Told by Lou Conte on Pfizer's Veterinarian Vaccine Maker and Flying Pigs?", "site_name": "AGE OF AUTISM", "type": "blog", "url": "https://www.ageofautism.com/2023/02/truth-be-told-by-lou-conte-on-pfizers-veterinarian-vaccine-maker.html", "description": "Please check out Lou Conte's SubStack called \"Truth Be Told.\" Lou's super power (one of them) is that his decades of law enforcement work in the Westchester County (NY) Sex Offender Probations department gave him a keen insight into LIARS....", "image": "https://www.rescuepost.com/.a/6a00d8357f3f2969e202b751725498200b-600wi"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.ageofautism.com/2023/02/truth-be-told-by-lou-conte-on-pfizers-veterinarian-vaccine-maker.html", "https://www.rescuepost.com/.a/6a00d8357f3f2969e202b751725498200b-pi", "https://louisconte.substack.com/subscribe?simple=true&next=https%3A%2F%2Flouisconte.substack.com%2Fp%2Fin-vino-veritas-in-wine-there-is", "https://louisconte.substack.com/p/albert-bourla-the-veterinarian-vaccine", "https://www.google.com/search?q=Pfizer+CEO+Albert+Bourla+on+combating+vaccine+hesitancy+and+his+new+book+%22Moonshot%22+-+YouTube&sxsrf=AJOqlzXQCjdEv2cmEsHKOHDF98w59Sf7kw%3A1676943094922&source=hp&ei=9h70Y4iWNoSf5NoP5oOo2Ac&iflsig=AK50M_UAAAAAY_QtBuDg7L8MO9iYYT1qz6q0SL0-fkPR&ved=0ahUKEwiI6erru6X9AhWED1kFHeYBCnsQ4dUDCAo&uact=5&oq=Pfizer+CEO+Albert+Bourla+on+combating+vaccine+hesitancy+and+his+new+book+%22Moonshot%22+-+YouTube&gs_lcp=Cgdnd3Mtd2l6EAM6BwgjEOoCECc6DQguEMcBENEDEOoCECdQ8BBY8BBggSBoAXAAeACAATKIATKSAQExmAEAoAECoAEBsAEK&sclient=gws-wiz#fpstate=ive&vld=cid:840cb541,vid:fNMGK3O2OZI", "https://nypost.com/2023/01/31/pfizer-forecasts-big-drop-in-revenue-after-record-100m-covid-led-haul/", "https://rumble.com/v2658gm-caught-him-rebel-news-pummels-pfizer-ceo-with-questions-at-world-economic-f.html", "https://ipak-edu.org/registration/", "https://amzn.to/3YHYu7T", "https://amzn.to/3YHYu7T", "https://amzn.to/3YHYu7T", "https://www.amazon.com/Lies-My-Govt-Told-Me-ebook/dp/B09R4Y6YKJ?_encoding=UTF8&qid=&sr=&linkCode=li3&tag=ageofautism0c-20&linkId=0cea2a935084e2a22a8a3dfa77978f3b&language=en_US&ref_=as_li_ss_il", "What%20is causing this historic spike in deaths among younger people? What is causing the shift from the elderly to younger people?", "https://www.amazon.com/Cause-Epidemic-Sudden-Childrens-Defense-ebook/dp/B0BB8JTNJZ?crid=35X7M6QC61GYM&keywords=cause+unknown+ed+dowd&qid=1676992447&s=digital-text&sprefix=cause+unknown+ed+dowd%2Cdigital-text%2C201&sr=1-1&linkCode=li3&tag=ageofautism0c-20&linkId=722e9db086e1d2090f7e484f596cc674&language=en_US&ref_=as_li_ss_il"], "authors": [], "publish_date": null}