{"result_id": "012009", "URL": "https://www.ageofautism.com/2021/03/patricia-finn-wins-new-battle-against-ny-state-over-disability-vaccine-exemptions-and-school-attende.html", "timestamp": "2023-04-25 11:56:16 CEST+0200", "meta": {"description": "In these alarming times it is pleasant to note the latest in a string of legal victories by Patricia Finn against New York State. In this case a Supreme Court judge granted a restraining order against the state for preventing...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.ageofautism.com/2021/03/patricia-finn-wins-new-battle-against-ny-state-over-disability-vaccine-exemptions-and-school-attende.html", "encoding": "utf-8"}, "image": null, "domain": "www.ageofautism.com", "title": "Patricia Finn Wins New Battle Against NY State Over Disability, Vaccine Exemptions and School Attendence", "cleaned_text": "This is a big win for all school kids in the state, and the second time a New York Court has restrained a school district from excluding non-vaccinated children in two separate lawsuits brought by Patricia Finn Attorney, P.C.\n\nThe Law Offices of Patricia Finn Attorney, P.C., has just obtained another temporary restraining order in another New York State Medical Exemption case. Last week, a Supreme Court Judge Ordered a defendant school district to immediately readmit a medically fragile child back into school although the child is not fully vaccinated. The student had a certified medical exemption from the family physician waiving the school required vaccinations that had been declined by the school district, and the student's remote learning access was shut off. The parent filed an appeal to the New York State Commissioner of Education seeking a Stay of the school’s decision that was denied. The §310 Appeal to the Commissioner was then withdrawn, and the student’s parent refiled in state court obtaining a temporary restraining order permitting the student back into school while the case is pending in the Supreme Court.\n\nIn these alarming times it is pleasant to note the latest in a string of legal victories by Patricia Finn against New York State. In this case a Supreme Court judge granted a restraining order against the state for preventing a medically fragile child, who had not been fully vaccinated from attending school remote school attendance. Finn’s site reports ( HERE ):\n\nAs you may recall, in June of last year, this firm obtained a preliminary injunction allowing Young Thorn Schwartz, a boy with autism, back into school after his medical exemption was denied by the school principal. Thorn’s case is now on appeal in the Appellate Division Fourth Department in New York, and we hope to prevail again. Our goal is to restore medical freedom in this state especially for children who are being deluged with school required vaccinations, and we need your support.\n\nIn Schwartz v NYSDOH, the Hon. Daniel J. Doyle, Supreme Court Yates County, enjoined a respondent school district from denying child petitioner’s medical exemption under PHL§ 2164(8) and held “It does not necessarily appear that the Legislature intended for the medical exemption to be restricted only to contraindications and precautions specific to an individual immunization, and not also to include a certification consistent with the standard of medical care for a child’s particular medical condition.”\n\nTwo other students represented by our firm were allowed back into school in the past year after lawsuits were filed to restore their medical exemptions that were denied after NYSDOH amended its medical exemption regulations in August of 2019, virtually eliminating the statutory exemption. These two case came on the heels of another important win in NYS Supreme Court in Doe v Day. In April of 2019, in Doe v Day, this firm proved there was no measles epidemic in Rockland County, enjoining an Executive Order that excluded non-vaccinated children from public places.\n\nWe hope to continue this winning trend, and are in the process of filing another lawsuit to prove there is currently no deadly covid epidemic in New York State, relying on the precedent in Doe v Day, using the same standard set by the Court. In the case MF v Cuomo, we are challenging the state restrictions requiring children to wear masks to attend school, by once again proving there is no deadly covid epidemic, and moving to have the Executive Orders of Governor Cuomo overturned as arbitrary and capricious. It follows no epidemic than no mask mandate required in the absence of an emergency.\n\nIn Doe v Day, the Court defined an “epidemic” and then determined no epidemic existed:\n\n\"As the definition of 'disaster' set forth in Executive Law §20(2)(a) includes 'epidemic' Respondent argues that Mr. Day was well within his authority to issue the Emergency Declaration.\n\nAs ‘epidemic' is not defined within Executive Law §24, the Court must look to its ordinary meaning. See, People v. Aleynikov, N.Y.3d 383, 397 (2018) ('When a word used in a statute is not defined in the statute, dictionary definitions serve as 'useful guideposts' in determining the word's 'ordinary' and 'commonly understood' meaning.') Thus, an ‘epidemic’ is defined as \"an outbreak of disease that spreads quickly and affects many individuals at the same time.' ‘Epidemic’ is also defined as 'affecting or tending to affect a disproportionately large number of individuals within a population, community, or region at the same time.' Id.\n\n\n\nIn a population of roughly 330,000 people, 166 cases is equal to .05% of the population, which does not appear, on the record before the Court, to rise to the level of an 'epidemic' as included in the definition of 'disaster' under Executive Law §24. Petitioner has thus demonstrated that Mr. Day's reliance on Executive Law §24 in issuing the Emergency Declaration may have been misplaced.”\n\nWHY IS THIS IMPORTANT?\n\nThese cases are important because they demonstrate with the right legal strategy your rights to refuse vaccinations can be restored, even in the midst of a perceived epidemic. Every child we represent that has their exemption restored brings us one step closer to stopping the mandatory vaccine train wreck heading our way with the experimental covid vaccine.\n\nPlease consider a donation to help us continue this important work securing your right to refuse unnecessary and unwanted mandatory vaccinations. For more information check out www.patriciafinnattorney.com and the links below where to donate.", "opengraph": {"title": "Patricia Finn Wins New Battle Against NY State Over Disability, Vaccine Exemptions and School Attendence", "site_name": "AGE OF AUTISM", "type": "blog", "url": "https://www.ageofautism.com/2021/03/patricia-finn-wins-new-battle-against-ny-state-over-disability-vaccine-exemptions-and-school-attende.html", "description": "In these alarming times it is pleasant to note the latest in a string of legal victories by Patricia Finn against New York State. In this case a Supreme Court judge granted a restraining order against the state for preventing...", "image": "https://www.rescuepost.com/.a/6a00d8357f3f2969e20263e99a920f200b-600wi"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}