{"result_id": "012001", "URL": "https://www.ageofautism.com/2021/06/v-is-for-vaccine-protests-outside-springsteen-on-broadway-irking-covidphobic-howard-stern.html", "timestamp": "2023-04-25 11:56:08 CEST+0200", "meta": {"description": "Note: When I turned on The Howard Stern Show at about 7:30 yesterday morning, he began his non-stop fear of Covid, and love for the vaccinations the moment I tuned in. Imagine my surprise when he began talking about the...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.ageofautism.com/2021/06/v-is-for-vaccine-protests-outside-springsteen-on-broadway-irking-covidphobic-howard-stern.html", "encoding": "utf-8"}, "image": null, "domain": "www.ageofautism.com", "title": "V Is For Vaccine Protests Outside Springsteen On Broadway Irking Covidphobic Howard Stern", "cleaned_text": "Note: When I turned on The Howard Stern Show at about 7:30 yesterday morning, he began his non-stop fear of Covid, and love for the vaccinations the moment I tuned in. Imagine my surprise when he began talking about the V Is For Vaccine protest outside the Springsteen on Broadway - which was for vaccinated only. He hates the unvaccinated and fears Covid with all his heart and soul and OCD. He used to turn his cruelty into comedy. I was so annoyed, I snapped a screen shot. \n\n\n\n###\n\n\n\nProtest Against Segregation at Bruce Springsteen Concert for \"Vaccinated Only\" Attendees\n\n\n\nNew York, NY - On June 26, 2021 the largest public vaccine risk education organization, V is for Vaccine, protested what they are calling discrimination and modern segregation outside the first show of the new Bruce Springsteen concert series at the St. James Theater. Springsteen's shows are open to \"vaccinated only\", allowing only attendees who have received the COVID-19 vaccine. Concert goers were required to show proof of vaccination for COVID-19 to enter the venue.\n\nThe protest aimed to highlight how segregating vaccinated and unvaccinated individuals is a violation of civil and equal rights, with activists holding signs that replicated protest signs from the Civil Rights era. One such sign read \"Segregation is morally wrong!\"\n\nSegregation is defined as the action or state of setting someone or something apart from other people, or things being set apart. There and many reasons people do not vaccinate, including previous vaccine injury or medical or genetic predisposition to an adverse reaction.\n\nSpringsteen isn't the first performer to impose this requirement. Just last week V is for Vaccine also organized a protest at the The Foo Fighters concert on the west coast, which was the very first full capacity \"vaccinated only\" concert in the country.\n\nV is for Vaccine co-founder Joshua Coleman stated, \"Our goal is to point out how this medically and scientifically unjustified discrimination is setting a dangerous precedent. We are supposed to be in an age where we have moved past treating others unfairly based upon prejudices and unfounded fears. It seems in this case history is repeating itself.\"", "opengraph": {"title": "V Is For Vaccine Protests Outside Springsteen On Broadway Irking Covidphobic Howard Stern", "site_name": "AGE OF AUTISM", "type": "blog", "url": "https://www.ageofautism.com/2021/06/v-is-for-vaccine-protests-outside-springsteen-on-broadway-irking-covidphobic-howard-stern.html", "description": "Note: When I turned on The Howard Stern Show at about 7:30 yesterday morning, he began his non-stop fear of Covid, and love for the vaccinations the moment I tuned in. Imagine my surprise when he began talking about the...", "image": "https://www.rescuepost.com/.a/6a00d8357f3f2969e202788033ce07200d-600wi"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.rescuepost.com/.a/6a00d8357f3f2969e2026bdedbf055200c-pi", "https://www.rescuepost.com/.a/6a00d8357f3f2969e202788033ce07200d-pi"], "authors": [], "publish_date": null}