{"result_id": "012007", "URL": "https://www.ageofautism.com/2020/10/fake-placebo-meningitis-vaccine-may-have-killed-healthy-28-year-old-brazilian-covid-vaccine-voluntee.html", "timestamp": "2023-04-25 11:56:14 CEST+0200", "meta": {"description": "That's the headline Reuters should have written, instead of AstraZeneca COVID-19 vaccine trial Brazil volunteer dies, trial to continue. If you ask anyone with middle school grasp of science what is a \"placebo,\" they will likely say, \"a sugar pill.\"...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.ageofautism.com/2020/10/fake-placebo-meningitis-vaccine-may-have-killed-healthy-28-year-old-brazilian-covid-vaccine-voluntee.html", "encoding": "utf-8"}, "image": null, "domain": "www.ageofautism.com", "title": "Fake Placebo Meningitis Vaccine May Have Killed Healthy 28 Year Old Brazilian Covid Vaccine Volunteer", "cleaned_text": "That's the headline Reuters should have written, instead of AstraZeneca COVID-19 vaccine trial Brazil volunteer dies, trial to continue.\n\n\n\n If you ask anyone with middle school grasp of science what is a \"placebo,\" they will likely say, \"a sugar pill.\" A placebo has always meant an inert, benign substitute for the drug being tested. How many Earthlings understand that with this Covid vaccine, the placebo is another vaccine? And in this case, it may well have killed a healthy, altruistic 28 year young man. Our sincere condolences to his grieving family. He volunteered to help others. And what of every parent whose child needs a meningitis vaccine for school? Are they to feel comforted?\n\na harmless pill, medicine, or procedure prescribed more for the psychological benefit to the patient than for any physiological effect.\n\n\"his Aunt Beatrice had been kept alive on sympathy and placebos for thirty years\"\n\na substance that has no therapeutic effect, used as a control in testing new drugs.\n\na measure designed merely to calm or please someone.\n\n\"pacified by the placebos of the previous year, they claimed a moral victory\"\n\nSAO PAULO/FRANKFURT (Reuters) - Brazilian health authority Anvisa said on Wednesday that a volunteer in a clinical trial of the COVID-19 vaccine developed by AstraZeneca and Oxford University had died but added that the trial would continue.Oxford confirmed the plan to keep testing, saying in a statement that after careful assessment “there have been no concerns about safety of the clinical trial.”\n\nA source familiar with the matter told Reuters the trial would have been suspended if the volunteer who died had received the COVID-19 vaccine, suggesting the person was part of the control group that was given a meningitis jab. Read more here.", "opengraph": {"title": "Fake Placebo Meningitis Vaccine May Have Killed Healthy 28 Year Old Brazilian Covid Vaccine Volunteer", "site_name": "AGE OF AUTISM", "type": "blog", "url": "https://www.ageofautism.com/2020/10/fake-placebo-meningitis-vaccine-may-have-killed-healthy-28-year-old-brazilian-covid-vaccine-voluntee.html", "description": "That's the headline Reuters should have written, instead of AstraZeneca COVID-19 vaccine trial Brazil volunteer dies, trial to continue. If you ask anyone with middle school grasp of science what is a \"placebo,\" they will likely say, \"a sugar pill.\"...", "image": "https://www.rescuepost.com/.a/6a00d8357f3f2969e2026be41c817b200d-600wi"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.reuters.com/article/us-health-coronavirus-brazil-vaccine-idUSKBN2762MO", "https://www.rescuepost.com/.a/6a00d8357f3f2969e2026be41c817b200d-pi", "https://www.reuters.com/article/us-health-coronavirus-brazil-vaccine-idUSKBN2762MO"], "authors": [], "publish_date": null}