{"result_id": "012032", "URL": "https://www.ageofautism.com/2023/03/andrew-mitchell-and-the-dangerous-entanglements-of-the-british-state.html", "timestamp": "2023-04-25 11:56:36 CEST+0200", "meta": {"description": "By John Stone This is a commentary to one of the oddest events in modern British politics which occurred in the House of Commons last week when MP Andrew Bridgen got up to give a speech on the Covid shot...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.ageofautism.com/2023/03/andrew-mitchell-and-the-dangerous-entanglements-of-the-british-state.html", "encoding": "utf-8"}, "image": null, "domain": "www.ageofautism.com", "title": "Andrew Mitchell and the British State as Vaccine Manufacturer", "cleaned_text": "By John Stone \n\n\n\nThis is a commentary to one of the oddest events in modern British politics which occurred in the House of Commons last week when MP Andrew Bridgen got up to give a speech on the Covid shot fallout and the entire chamber emptied - involving the unusual behaviour of veteran Foreign Office minister and long time Bill Gates familiar Andrew Mitchell. In only a few seconds there were only seven MPs left out of a potential 643: these included four government representatives, the deputy Speaker and just one person supporting Andrew Bridgen, Christopher Chope. No one was present from any of the opposition parties to hear Bridgen’s meticulously documented speech.\n\nWhile it is hard determine exactly what Mitchell was up to he certainly provides an interesting thread to tug at, since as well as being Minister for International Development and Africa he is also a ‘Polio Eradication Gender Champion’, an honour bestowed by the Global Polio Eradication Initiative, a project of the WHO, Rotary International, the US CDC, UNICEF, Bill and Melinda Gates Foundation, and GAVI. Of course, as we have seen these things can go wrong. Despite this interest in vaccination Mitchell did not stop to listen to what Andrew Bridgen had to say, and consider it on its merits.\n\nWhen it comes to African polio vaccines the British state is peculiarly conflicted: it is not only that as Andrew Bridgen and many others have pointed out the MHRA (the UK licensing authority) is largely paid for by the industry and therefore not remotely independent from it, it is actually through its subsidiary National Institute for Biological Standards and Control part of a partnership with the Bill and Melinda Gates Foundation and the WHO manufacturing the products. Last year I transcribed some passages from an MHRA meeting (courtesy of UK Column) involving the interim director of NIBSC Mark Bailey and the Chairman of the MHRA Stephen Lightfoot:\n\nSignificant investment by NIBSC and also its partners the Gates foundation and of course its part of the WHO lab in (indecipherable) and of course basically premiere eradication. There are three strains of polio and the team at NIBSC developed three different vaccines. It happens that strain two is the one that has been deployed most in clinical trials in Africa and it's listed product by the WHO which mean it can be used in emergency situations even though it is not proved. We are now moving to clinical trials with the other two strains as well, so it's very exciting: it's a huge huge combination: its effect is that this vaccine cannot revert. So the Salk vaccine which was used with most of us as kids there was always a low chance of it reverting back to wild type which means things like polio begins to appear in the population. This is a great leap forward here because it can't revert so basically its much safer.", "opengraph": {"title": "Andrew Mitchell and the British State as Vaccine Manufacturer", "site_name": "AGE OF AUTISM", "type": "blog", "url": "https://www.ageofautism.com/2023/03/andrew-mitchell-and-the-dangerous-entanglements-of-the-british-state.html", "description": "By John Stone This is a commentary to one of the oddest events in modern British politics which occurred in the House of Commons last week when MP Andrew Bridgen got up to give a speech on the Covid shot...", "image": "https://www.rescuepost.com/.a/6a00d8357f3f2969e202b7519c0424200c-600wi"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.rescuepost.com/.a/6a00d8357f3f2969e202b7519bdf0f200c-pi", "https://www.rescuepost.com/.a/6a00d8357f3f2969e202b7519c0424200c-pi", "https://www.rescuepost.com/.a/6a00d8357f3f2969e202b7519bdf0f200c-pi", "https://www.youtube.com/watch?v=SpGcEf2yCok", "https://www.youtube.com/watch?v=JvSHD_n3Lyg%20", "https://polioeradication.org/", "https://www.ageofautism.com/2023/03/822-children-developed-paralytic-polio-from-the-vaccines.html", "https://pubmed.ncbi.nlm.nih.gov/22591873/", "https://www.ageofautism.com/2022/06/british-drug-regulator-mhra-develops-manufactures-and-sells-its-own-biological-products-including-va.html"], "authors": [], "publish_date": null}