{"result_id": "012006", "URL": "https://www.ageofautism.com/vaccines/", "timestamp": "2023-04-25 11:56:12 CEST+0200", "meta": {"description": "News and opinion relevant to families raising children with autism into adulthood and beyond.", "lang": "en", "keywords": "autism, health, choice, disability, adulthood, education, autistic", "favicon": "", "canonical": "https://www.ageofautism.com/vaccines/", "encoding": "utf-8"}, "image": null, "domain": "www.ageofautism.com", "title": "AGE OF AUTISM", "cleaned_text": "Why were ingredients known to be associated with clots permitted in Covid injections?: the British regulator stonewalls\n\nThis is a matter I first wrote about a year ago: as reports began to accumulate of clotting in recipients of the Oxford/AstraZeneca Covid injection a well-known biochemist pointed out to me that adenovirus component present in this product (as well as the Johnson & Johnson and Sputnik) had been a known risk for thrombocytopenia for two decades before these products were assembled at breakneck speed in February 2020. This presented a simpler issue than the mRNA products of Pfizer and Moderna where many of the potential risks - though not all - were relatively speculative, since our governments had apparently authorised these products either knowing exactly what was likely to occur, or with alarming incompetence having failed to spot it. Back in April last year was the first time I asked had the MHRA (the British regulator) done due diligence.\n\nUltimately, in November 2021 I wrote to the CEO of the MHRA, June Raine, asking her point blank:\n\n‘Can you explain why the MHRA permitted the use of adenovirus in Covid vaccines bearing in mind that it was known to be associated with clots?’\n\nI did not hear back for a long while, and then on 22 February 2022 I received the following acknowledgement from someone signing himself “Peter”:\n\nThank you for your email.\n\nWe have reviewed your enquiry and this has been passed on to our Licensing colleagues for further input.\n\nIt was an interesting day for this to occur because it was the day the Metropolitan Police announced that they would not be pursuing further criminal investigations into the Covid affair. I thanked “Peter” and waited a month and in place of an answer re-submitted my enquiry as a Freedom of Information request (which received an automatic acknowledgement). Then when the statutory 20 days for answering such a request had elapsed, earlier this week, I enquired again and received neither answer or acknowledgement. We have perhaps to conclude that we have reached the end of the line and the MHRA cannot explain in any shape of form why they allowed so many people to be hurt, injured or even killed.\n\nThe MHRA’s first assessed the connection between between the AZ product and thrombocytopenia as likely on 7 April 2021 but what they failed to acknowledge was that they were only geared to receiving a small fraction of reports as stated in a notice of 2018:\n\nIt is estimated that only 10% of serious reactions and between 2 and 4% of non-serious reactions are reported.\n\nThey knew therefore the risk to patients on which they continued to roll out the product was likely in the region of ten times worse than stated in their published reports, while fatalities were also reported at a much higher rate than for Pfizer and again might be ten times worse according to their own rule of thumb.\n\nThe issue of how far the British regulator which is an agency of UK Department of Health and Social Care and is 100% funded by the industry, works for the public rather than the industry is more than ever moot, and this instance is complicated by the fact that the Secretary of State for Health and Social Care - at the time the controversial World Economic Forum advocate Matt Hancock - was also a sponsor of the development of the product.\n\nAs long ago as 2005 the House of Commons Health Committee remarked:\n\nThe Department of Health has for too long optimistically assumed that the interests of health and of the industry are as one. This may reflect the fact that the Department sponsors the industry as well as looking after health. The result is that the industry has been left to its own devices for too long.... The industry is by no means solely to blame for the difficulties we describe. The regulators and prescribers are also open to criticism. The regulator, the Medicines and Healthcare products Regulatory Agency (MHRA), has failed to adequately scrutinise licensing data and its post-marketing surveillance is inadequate. The MHRA Chairman stated that trust was integral to effective regulation, but trust, while convenient, may mean that the regulatory process is not strict enough.\n\nAnd in 2020 I wrote in BMJ on-line:\n\nTwo years ago officers of the MHRA were defensive of their inability to detect the narcolepsy risk with the Pandemrix vaccine in the swine flu scare of 2009 nine years before…, despite heavy criticism..In 2020 they face a much more daunting task of assessing for licensure and monitoring a plethora COVID-19 vaccines, each of apparently novel design. I hope they are now able to give the public assurances that important lessons have been learned, and not just that they always get it right…\n\nYet nothing which has gone before seems to compare with the present recklessness over human life, and it is urgent government and regulator are held to account. There are many complex questions that the Covid episode has thrown up, but this one is as simple as it gets. Asked the most basic question they cannot, will not answer and manifestly there is something to hide.", "opengraph": {"title": "AGE OF AUTISM", "site_name": "AGE OF AUTISM", "type": "blog", "url": "https://www.ageofautism.com/", "description": "Age of Autism provides daily insights into the autism epidemic. Part of the Autism Age 501c3 non-profit organization, our mission is to share information with families facing the daily challenges & joys that surround autism. For more than 15 years, AofA has been a lone voice discussing even the most controversial subjects - because THAT'S what journalists do. Freedom of speech is alive and well here. Join us.", "image": "https://up1.typepad.com/6a00d8357f3f2969e20263e9886624200b-220si"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.rescuepost.com/.a/6a00d8357f3f2969e20282e1517249200b-pi", "https://www.bmj.com/content/373/bmj.n954/rr-2", "https://www.bmj.com/content/371/bmj.m4654/rr-28", "https://www.bmj.com/content/373/bmj.n961/rr-0", "https://www.gov.uk/government/publications/coronavirus-covid-19-vaccine-adverse-reactions/coronavirus-vaccine-summary-of-yellow-card-reporting", "https://www.gov.uk/drug-safety-update/yellow-card-please-help-to-reverse-the-decline-in-reporting-of-suspected-adverse-drug-reactions", "https://newhampshirebulletin.com/2022/04/21/anti-vaccine-legislation-puts-health-care-organizations-in-an-impossible-situation-commentary/", "https://www.gov.uk/government/speeches/the-4th-industrial-revolution", "https://www.ageofautism.com/2020/05/a-letter-to-my-member-of-parliament-.html", "https://www.ageofautism.com/2020/05/further-anomalies-of-the-oxford-coronavirus-vaccine.html", "https://publications.parliament.uk/pa/cm200405/cmselect/cmhealth/42/42.pdf", "https://www.bmj.com/content/363/bmj.k4152/rr-29"], "authors": [], "publish_date": null}