{"result_id": "012040", "URL": "https://www.ageofautism.com/2019/07/open-letter-to-editor-of-huffington-post-on-removal-of-vaccine-related-content.html", "timestamp": "2023-04-25 11:56:44 CEST+0200", "meta": {"description": "Note: Thank you to Laura for her letter below. I'll have more to say about the removal of my own entries on HuffPo soon. I cut my teeth as a public writer on Huffington Post. Huffington Post cut me off....", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.ageofautism.com/2019/07/open-letter-to-editor-of-huffington-post-on-removal-of-vaccine-related-content.html", "encoding": "utf-8"}, "image": null, "domain": "www.ageofautism.com", "title": "Open Letter to Editor of Huffington Post On Removal of Vaccine Related Content", "cleaned_text": "Open Letter to Editor of Huffington Post On Removal of Vaccine Related Content\n\nNote: Thank you to Laura for her letter below. I'll have more to say about the removal of my own entries on HuffPo soon. I cut my teeth as a public writer on Huffington Post. Huffington Post cut me off. Stay tuned. We can't be shut down. We won't be shut down. They can lock us out. They can't shut us up. KIM\n\n\n\nBy Laura Hayes\n\n\n\nDear Lydia Polgreen, I just read to Huffington Post readers regarding your decision to “remove dozens of blogs that perpetuate the unfounded opinion that vaccines pose a health risk to the public.” I am wondering if you happened to even read as evidence of vaccine safety? If you did, you seemingly missed the CDC’s own admission, albeit woefully inadequate, that vaccines come with myriad risks and do indeed cause harm, and fail, and have since their inception. It seems you did not bother to investigate whether or not the CDC is influenced by, to the point of accepting money from, pharmaceutical companies. If you had, you would have learned that the CDC those who will profit when the CDC endorses and recommends their products. In layman’s terms, we call that a huge, undeniable, unacceptable conflict of interest. Additionally, it appears that you neglected to read even one . If you had, you would have noticed that pharmaceutical companies are permitted by the FDA to do their own safety and efficacy testing for their vaccine products, without external, independent verification of their findings. You would have learned that when these companies test the vaccine products they hope to greatly profit from: inert placebos are not used for controls; control groups are not always used; studies are as short as 4 days in duration; only healthy individuals are selected as test subjects; the vaccine-targeted age group is not necessarily the age group tested; many test subjects are harmed, some killed, by the vaccines being tested, both during the testing period, and after; and, many injuries and deaths are reported post-marketing (which reportedly reflect a mere 1-10% of actual injuries and deaths), but are rarely, if ever, followed up on by the vaccine makers, those who administer the vaccines, the FDA, the CDC, the NIH, or HHS. You would hopefully also have noted that vaccine-making pharmaceutical companies do not test their vaccine products for carcinogenic effects, mutagenic effects, or impairment of fertility…and that the FDA permits such egregious omissions.\n\nSeeing as I have a severely and permanently vaccine-injured young adult son, I decided to give your method a try. I noted that your strategy was to remove evidence of vaccine injury in an attempt to make it disappear. So, I tried something similar here at home. I shut my eyes, in great hopes that when I reopened them my son’s debilitating, brain-damaging, communication-stealing, independence-robbing vaccine injuries would disappear. To my dismay, but not to my surprise, it didn’t work…in the very same way that your deleting information pertinent to vaccine-induced injuries and deaths, and to the vast web of corruption that underlies, enables, and perpetuates such unacceptable and unethical devastation to continue to occur, doesn’t work. Your deleting pertinent and damning information does not eliminate the horrific havoc that vaccines continue to wreak from fetus to grave. There is not one vaccine currently on the market that has been properly or ethically tested or approved. Furthermore, the CDC, which you seem to hold in high regard, continues to refuse to conduct or commission a vaccinated versus unvaccinated study…be it for one vaccine, or for the scores that are now recommended from gestation to death…for both short- and long-term effects on health, development, fertility, and longevity, Without such a study, no claims about vaccine safety or efficacy can be made…not one. Thus, if you sincerely want to stop the spread of vaccine misinformation, you would willingly and eagerly publish information on Huffington Post that challenges and disproves claims that vaccines have been tested and approved both properly and ethically. You would willingly and eagerly publish information that challenges and disproves claims that vaccines are safe (meaning that they don’t cause harm or kill), effective (meaning that they don’t fail, they don’t cause the infection they are purported to prevent, they don’t cause that which is worse than that which they are to prevent, and they don’t leave the recipient worse off than before the invasive medical procedure), and needed (meaning that there are not common-sense, time-proven, risk-free ways to protect, maintain, and enhance health, without the use of risk-laden vaccines). Additionally, you would willingly and eagerly publish uncensored, unfettered truths about vaccines, many of which can be found in these 3 articles of mine. “Regaining Our Right to Refuse Vaccinations” by Laura Hayes “Vaccines: What Is There to Be ‘Pro’ About?” by Laura Hayes “Why Is This Legal?” by Laura Hayes I’ll be looking for such truths on Huffington Post, as a litmus test regarding the veracity of your publication’s reporting.", "opengraph": {"title": "Open Letter to Editor of Huffington Post On Removal of Vaccine Related Content", "site_name": "AGE OF AUTISM", "type": "blog", "url": "https://www.ageofautism.com/2019/07/open-letter-to-editor-of-huffington-post-on-removal-of-vaccine-related-content.html", "description": "Note: Thank you to Laura for her letter below. I'll have more to say about the removal of my own entries on HuffPo soon. I cut my teeth as a public writer on Huffington Post. Huffington Post cut me off....", "image": "https://www.rescuepost.com/.a/6a00d8357f3f2969e20240a46de2e6200c-600wi"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.ageofautism.com/2019/07/open-letter-to-editor-of-huffington-post-on-removal-of-vaccine-related-content.html", "https://www.rescuepost.com/.a/6a00d8357f3f2969e20240a46de2e6200c-pi", "https://www.huffpost.com/entry/letter-from-the-editor-vaccines_n_5d0cefd6e4b0aa375f4ba1c6?9ok&guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuaHVmZnBvc3QuY29tL3N0YXRpYy9lZGl0b3JzLW5vdGUtdmFjY2luZQ&guce_referrer_sig=AQAAADd_26QepFL2FsMLtWREnpo-v9vHVh5xgNFdhCLDPrroT88TkHSoGprLJsOYE_PUrWSRf9vktBlFwv_rvyxecQHBZY7KUBTgyKGeW6JYrJs4jbsCrgVm5yo2BSQDbWZ7rAjS0iz-vT9Ogh3-mdCI2YsZUPjzZMWSVz9sQVbL1Ls8", "https://www.cdc.gov/vaccinesafety/concerns/index.html", "https://www.cdcfoundation.org/partner-list/corporations", "https://www.minnpost.com/second-opinion/2015/05/revelations-cdcs-industry-funding-raise-questions-about-some-its-decisions/", "http://www.vaccinesafety.edu/package_inserts.htm", "https://www.ageofautism.com/2019/06/regaining-our-right-to-refuse-vaccinations.html", "https://www.ageofautism.com/2019/06/regaining-our-right-to-refuse-vaccinations.html", "https://www.ageofautism.com/2016/12/vaccines-what-is-there-to-be-pro-about-laura-hayes-to-weston-a-price-foundation-conference.html", "https://www.ageofautism.com/2016/12/vaccines-what-is-there-to-be-pro-about-laura-hayes-to-weston-a-price-foundation-conference.html", "https://www.ageofautism.com/2018/11/why-is-this-legal-presentation-on-vaccines-by-laura-hayes.html", "https://www.ageofautism.com/2018/11/why-is-this-legal-presentation-on-vaccines-by-laura-hayes.html"], "authors": [], "publish_date": null}