{"result_id": "012010", "URL": "https://www.ageofautism.com/2019/11/a-serious-lawsuit-an-experimental-vaccine-was-given-to-hundreds-of-thousands-babies-in-israel.html", "timestamp": "2023-04-25 11:56:17 CEST+0200", "meta": {"description": "A serious lawsuit: \"An experimental vaccine was given to hundreds of thousands babies in Israel\" Dr. Yaffa Shir-Raz Dr. Yaffa Shir-Raz (Ph.D., The University of Haifa, Israel) is a health and risk communication researcher, as well as a health journalist,...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.ageofautism.com/2019/11/a-serious-lawsuit-an-experimental-vaccine-was-given-to-hundreds-of-thousands-babies-in-israel.html", "encoding": "utf-8"}, "image": null, "domain": "www.ageofautism.com", "title": "A serious lawsuit: \"An experimental vaccine was given to hundreds of thousands babies in Israel\"", "cleaned_text": "The recall was announced on July 29, 2015, and applied to all the batches distributed since1.1.2012. According to the recall notice, the reason for the recall, was \"a technical failure in packaging\". The notice emphasized that the recall was only conducted as a precautionary measure only and that there were no reports of concerns regarding the efficacy and safety of the vaccine. Two weeks later, in response to Ynet's investigation, the Ministry of Health issued a clarification notice, stating that the nature of the problem was \"a concern about possible cracks in the vials, claimed to be the result of \"a problem of a lack of synchronization at the rate of feeding the vials and labels into the machine.\" However, the later explanation did not reassure parents. In fact, the clarification notice may have increased parents' anxiety, especially given a recall announcement published online at the same time, by the Hong Kong Ministry of Health, where several hundred batches of the vaccine were sold. The latter announcement warned of a risk of infection and sepsis, and instructed the public to consult their healthcare professional, if in doubt or feeling unwell.\n\nAccording to an opinion that accompanies the statement of claim, by Prof. Avinoam Shofer, a pediatric neurologist, there is a reasonable basis to determine that Sci-B-Vac is the cause of the functional-developmental impairment in the two children for whom the lawsuit was filed, in the absence of any other known possible cause. With respect to plaintiff A, the statement of claim alleges that he suffers from Suffers from a severe seizures disease, epilepsy, and a developmental delay. He has multiple seizures, up to 40 a day. At the age of four, he does not speak yet, and apart from the word \"father\", he does not even make syllables, only sounds. As for plaintiff B, according to Prof. Shofer's opinion, his symptoms and test results indicate that he suffered from a vaccine-associated encephalitis, and today suffers from a developmental delay.\n\nThe lawsuit, for bodily injuries allegedly caused as a result of the vaccine, was filed on behalf of two children and their parents. At the same time, a motion for certification of a class action was filed against Scivac last Thursday, by attorneys David Or-Chen and Ahuva Ticho, in the amount of NIS 1,879,500,000. The class action alleges misrepresentation, loss of autonomy, exploiting distress and breach of duty to inform consumers. The motion for certification of a class action was filed on behalf of the two children and their parents.\n\nAn experimental, flawed, dangerous and harmful vaccine was given to newborns and infants in Israel, without informing their parents and without obtaining their informed consent. These serious allegations were raised last Wednesday in a lawsuit filed by Attorney Dr. Ahuva Ticho against the Israeli Ministry of Health and Scivac, the manufacturer of Sci-B-Vac. Between 2011 and 2015, Sci-B-Vac, a Hepatitis B vaccine made in Israel, was given, to 428,000 newborns and infants in Israel.\n\nDr. Yaffa Shir-Raz Dr. Yaffa Shir-Raz (Ph.D., The University of Haifa, Israel) is a health and risk communication researcher, as well as a health journalist, and her interdisciplinary work in this field draws from both professions. She is a researcher at the University of Haifa Health and Risk Communication Research Center, and a lecturer of health communication in the International Communication Program, Sammy Ofer School of Communication, IDC Herzliya, Israel .\n\nIt was later revealed that the defect leading to the recall was only the tip of the iceberg. To date, Scivac has not received approval from any Western regulatory agency, such as the FDA or EMA. The company's documents show that the company's clinical studies, which the Israeli Ministry of Health relied upon to approve the vaccine and introduce it into the routine immunization schedule for infants, included only two phase III studies in neonates, with a scant number of participants.\n\nFollowing the publication of the Ynet's report on the recall, Ynet and the Movement for Freedom of Information in Israel, and later on lawyers and parents whose children received the vaccine, submitted numerous requests under the Freedom of Information Act. They sought access to documents, protocols and company's clinical trials that would allow the public and clinicians to understand the basis for the vaccine's approval for marketing and its inclusion in routine immunization schedules for infants, as well as understanding the cause of the recall.\n\nHowever, all Freedom of Information requests were refused. The Ministry of Health has repeatedly claimed that the clinical trials were \"the manufacturer's trade secret\" and that the protocols of committee discussions in which the vaccine was approved and included in the routine immunization schedule for infants \" were not in the possession\" of the Israeli Ministry of Health.\n\nScivac did not provide any answers either. In response to a request by Attorney Ticho, which was forwarded to Scivac's attorneys, Perl Cohen et al, it was claimed that \"Sci-B-Vac marketed by our client was not defective. The reason for conducting the recall… was a specific failure in the vaccination package - which does not affect the efficacy and / or safety of the vaccine; and without any implications for those vaccinated in the past and / or in the future. Your request for information and documents is rejected. \"\n\nOver the past three years, in an attempt to find answers, dozens of documents that reveal additional details regarding the decisions to approve the vaccine and include it in the immunization schedule, and regarding the recall, were collected.\n\nOn what basis was the vaccine approved?\n\nIn the year 2000, the Sci-B-Vac vaccine was registered in Israel by the Ministry of Health. At that time, it was called Bio-Hep-B. The vaccine is based on the development of the Weizmann Institute, in cooperation with the Hadassah Medical Center and Bio-Technology General (BTG). The vaccine was later sold to SciGen, a Singaporean company.\n\nAccording to the financial press, in 2014, 45% of Scivac's shares were sold to OPKO, a pharmaceutical company whose CEO and controlling shareholder, Philip Frost, was charged by the U.S. Securities and Exchange Commission, on September 7 2018, with participating in pump-and-dump schemes. In October 2015, about two months after the Sci-B-Vac recall, Scivac was merged with VBI Vaccines Inc.. Today, OPKO holds 10.4% of VBI.\n\nThe vaccine leaflet was approved in February 2009; and, in 2011, the vaccine was introduced into the routine immunization schedule for newborns and infants. At the time, GSK's Hepatitis B vaccine – Engerix B, had already been approved and had been used in Israel for years. Engerix B was approved by the FDA as early as 1989 and, in 1992, it was introduced into the infants' immunization schedule in Israel. Like Engerix B, Sci-B-Vac is given in three doses: immediately after birth, at the age of one month, and at the age of six months.\n\nAccording to a protocol of the Advisory Committee on Infectious Diseases and Immunization, dated July 4, 2013, the Committee decided to divide the country in two: districts in which all infants were to receive Engerix B, and districts where all infants would receive Sci-B-Vac.\n\nThe lawsuit alleges that the decision to approve the vaccine and include it in the infant immunization schedule was made \"without the approval of a recognized Western regulatory authority, such as the FDA or EMA\" - a puzzling decision that contradicts the Ministry of Health's previously declared policy. In a Knesset, document on vaccinations for children, dated December 2000, Dr. Emilia Anis, the Director of the Epidemiology Division at the Israeli Ministry of Health, reported that \"the field of immunization is under the close supervision of the Ministry of Health… The approval for every vaccine is given only after it has been widely used in the world\".\n\nThe rationale behind this policy is that the international regulatory authorities have available resources, professional personnel, laboratories and equipment, control departments, procedures and budgets necessary for drug approval. In contrast, the statement of claim argues, the Israeli Ministry of Health does not have \"the capabilities, skills, personnel, knowledge, experience and resources to examine and confirm the safety\" of a new vaccine.\n\nHow many newborns were included in Phase 3 trials?\n\nIn a response to Ynet's investigative report, the Israeli Ministry of Health stated that \"the State of Israel is a sovereign state and has an advanced drug registration system, at a level that is not inferior to large and well-respected health authorities, such as the FDA and the EMA, and therefore is able to examine and evaluate the data submitted to it\".\n\nEven if this were true, the question is why, in this particular case, when it came to immunizing neonates and infants – the most vulnerable population, the Ministry of Health found it appropriate to stray from its policy? This is particularly puzzling when a vaccine which did have both FDA and EMA approval and a recognized safety profile was available, and had been in use for years, in Israel and throughout the world.\n\nFurthermore, the question arises whether the safety and efficacy studies were indeed carried out in accordance with the FDA and EMA standards. The lawsuit alleges that, the decision to introduce the vaccine into the routine immunization schedule for infants was made \"without the defendant 2 (Scivac) conducting safety studies worthy of Phase III, in infants and newborns, prior to its approval and introduction for use, as opposed to what is required by its procedures\".\n\nPhase 3 is the crucial stage in clinical trials, designed to ensure the efficacy and safety of drugs and vaccines in a large number of patients. According to scientific sources attached to the statement of claim, \"the FDA requires phase III studies involving thousands, if not tens of thousands of subjects\". The Ministry of Health has argued in response to Ynet that \"Phase III trials of the vaccine included more than 3,000 people. Of these, more than 1,000 were infants\".\n\nHowever, based on a May 1, 2015 official Scivac document, this claim seems to be incorrect. A table in the document, summarizes the main clinical studies carried out by the company. The table shows that four studies were defined by the company as Phase 3, of which only two were in newborns, totaling 276 newborns only.\n\n\"Comparisons of the data indicate that the scope of participants in the clinical trials conducted by Scivac is not the same at all, and in fact thousands of times smaller than the scope of GSK's trials for marketing approvals by the major authorities, for its Engerix vaccine,\" explains Dr. Dario Vertnik, an expert in analytical chemistry and a toxicological consultant, whose opinion accompanies the statement of claim.\n\nIn an effort to convince the public that the research infrastructure for approving the vaccine in newborns and infants was strong, the Israeli Ministry of Health published another table, \"which includes the list of experiments carried out among infants and received from the company\".\n\nHowever, examining the numbers of the research protocols in the Ministry of Health table and comparing them to the company's own document, clearly shows that, apart from the two studies with 276 infants, the remaining studies were defined by the company itself as Phase 1-2 trials. Dr. Vertnik states that, in fact, all the studies presented in the two tables do not meet basic FDA and EMA requirements, nor meet the requirements of the Ministry of Health.\n\n\"The product is safe and effective in 300,000 Israeli babies\" \n\nIn Dr. Veretnik's opinion, even the company itself has stated that it was not sure that its clinical trials would suffice to persuade the FDA to approve the vaccine for marketing: \"Our research and clinical approaches may not lead to biologics that the FDA considers safe for humans and effective for the indicated uses we are studying\".\n\nIn fact, the company has just recently begun Phase 3 trials on its vaccine, in order to market it in the US and in Europe, after receiving a green light from the FDA and the EMA in 2017. These are randomized, double-blinded and comparative trials, conducted in large number of medical centers (with about 4,764 participants).\n\nYet the company, which for years has been announcing its desire to obtain FDA and EMA approval, had another convincing card – that Sci-B-Vac has been approved by the Israeli Ministry of Health and given to hundreds of thousands of babies in Israel. In an interview with the Wall Street Analyzer, on June 23, 2017, VBI’s CEO, Jeff Baxter, said: \"So the product was invented in Israel and has been used very successfully in over 300,000 individuals in Israeli hospitals, newborn children. In this group, in those 300,000, the vaccine was proven to be very safe and, most importantly, highly effective\".\n\nThe statement, boasting hundreds of thousands of \"patients\" or infants who received the vaccine and in whom the \"safety and efficacy were proven\" is regularly highlighted in the company's publications. It should be noted that in some of the company's publications, including VBI's website, it is claimed that the vaccine was given to 500,000 patients. In a September 40, 2015 document, it states: \"In Israel, where more than 500,000 persons have already been vaccinated with our vaccine, Sci-B-Vac™, is considered the standard of care. We have sold more than 1.5 million units in Israel\". According to the data contained in the Ministry of Health's response to Ynet, on August 12, 2015, most of the doses were administered to children: \"In total (since 2011 and up until the recall, at the end of July 2015), about 1,285,500 children-doses were issued\".\n\nHow exactly has the safety and effectiveness of the vaccine been proven in the hundreds of thousands of Israeli babies who received it and how many babies did indeed receive it in Israel? These questions remain unanswered, in view of the contradictions in the publications and in light of the refusal by Ministry of Health and the company to disclose their documents.\n\nIn response to Ynet's inquiring why the company was not required to provide large-scale safety studies before the vaccine was approved, the Ministry of Health claimed that there was no need for them, since \"this is a vaccine similar to the existing vaccine.\"\n\nBut is that in fact so? It seems that this claim is contradicted by the way in which the company itself presents the vaccine.\n\nIn an interview with the Wall Street Analyzer, on June 23, 2017, VBI’s CEO, Jeff Baxter, said: \"I mean, I always summarize Sci-B-Vac as a diamond in a bucket of coal, i.e., it’s every biotech CEO’s dream to find a scientifically and clinically differentiated product, which is licensed in a highly regulated market and has the opportunity to be approved in North America and Northern Europe. And that’s exactly what we have with Sci-B-Vac, i.e., that it’s clinically and scientifically differentiated\", said Baxter in another interview with the Wall Street Analyzer in April 2018.\n\nFurthermore, in its studies, the company calls Sci-B-Vac an \"a novel\" vaccine, and presents it as a \"third-generation vaccine\". This is in contrast to hepatitis B second-generation vaccines, such as Engerix B.\n\nAccording to the lawsuit, Sci-B-Vac \"is a new vaccine, which is not an alternative and/or not a generic and/or not an improved vaccine, compared to Engerix\" and is \"substantially different by a number of technological-scientific parameters, each of which in itself increases the risk for contamination and/or morbidity\".\n\nFirst, Sci-B-Vac contains three surface-antigens compared with just one surface-antigen, contained in Engerix. Second, per Dr. Veretnik’s opinion, the company significantly reduced the amount of the antigenic material in the vaccine, that it is four times smaller than that included in Engerix, but according to Dr. Veretnik, \"due to a serious design failure in the production of the vaccine\", the amount of aluminum adjuvant was not reduced accordingly. As a result, \"the ratio between the amount of adjuvant and the antigenic material in the Sci-B-Vac vaccine is four times greater than that of Engerix\".\n\nBecause the aluminum adjuvant involves a risk for neurotoxicity, such a high ratio \"has direct implications for the safety of the vaccine,\" Dr. Veretnik stated, adding that the manufacturer itself declared that the acquired immune defense in Sci-B-Vac was higher and achieved faster, following its injection. \"This claim alone means that this is an innovative vaccine with a stronger effect on the immune system, so it had to be investigated extensively for safety, like any other new vaccine\", an expert opinion, attached to the lawsuit stated. \"This powerful effect may potentially put vaccinated people, especially newborns and infants, at high risk of injury\".\n\nAnother difference is that, while Engerix is produced in yeasts, Sci-B-Vac is produced in mammalian cells, i.e. Chinese hamster ovary cells (CHO), and therefore is \"prone to contamination\". According to the expert’s opinion, the Israeli Ministry of Health was the first in the world to approve the use of a Hepatitis B vaccine produced in mammalian cells. \"The use of mammalian cells in drugs and vaccines is considered problematic, because of their increased risk compared to plant cells, such as yeast cells. Animal cells are susceptible to many viruses, germs and genetic mutations that can be the source of contamination\", Dr. Veretnik wrote. Because of these concerns, \"American and European regulators require that pharmaceutical companies follow strict guidelines to ensure the safety of products produced from living tissue\".\n\nMoreover, the mere fact that the company is now conducting Phase 3 trials in order to get the FDA and the EMA's approval serves as clear evidence to the fact that Sci-B-Vac is not generic to Engerix or to any other hepatitis B vaccine. If the vaccine was really generic, the company would not have had to carry out phase 3 trials, and it would have been defined as an Abbreviated New Drug Application (ANDA). According to the FDA, \"generic drug applications are termed \"abbreviated\" because they are generally not required to include preclinical (animal) and clinical (human) data to establish safety and effectiveness. Instead, generic applicants must scientifically demonstrate that their product is performs in the same manner as the innovator drug\". In contrast to the studies that led to the MOH approval in Israel, those Phase 3 trials currently carried out by VBI are IND (Investigational New Drug) studies, ie, studies conducted and submitted to the FDA in order to get its approval for a new drug – an innovator drug.\n\nThe statement of claim and the motion for certification of a class action also reveal new details of the recall announced on July 29, 2015, and the nature of the recall. The recall announcement included a list with 27 batches to return, each includes 33,000 vials, and a total of 891,000 vials. In fact, according to the company's declaration, all the products sold since January 1, 2012 has been retrieved from the market; and the Ministry of Health has ordered a halt to the use of vials, Full and general until further notice.\n\nAs noted, the MOH recall announcement stated that the reason for the recall was \"only a technical malfunction\". Later on, the wording changed, and the ministry clarified that there was a fear of cracking in vials. From the company's defect reporting form (July 28, 2015), it turns out now that the essence of the defect was actually broken vials were found, with \"partial or complete leakage of the vial content\". In addition, according to an MOH conference call summary document regarding the defect (no date specified on the document) it was also reported by the company, that in the packaging process an empty vial and a wet cardboard box were found. According to the document, the company notified the Ministry of Health \"of suspicion of contamination of vials and of a lower volume of liquid vials\".\n\nThese findings, it was argued in the lawsuit, indicate fluid flow and damage to the sterility of the product, which causes \"infection of the vaccine and risk and damage to vaccinated persons\". From Dr Veretnik's opinion: \"According to basic technological and professional logic, fluid loss proves that there is an opening in the packaging bottle through which material passes from the packaging to the outside, and vice versa. Each particle, including microbial particles of viruses, bacteria and chemicals can pass through the opening, penetrate the product and / or leave it. Since the product must be sterile, the immediate and clear conclusion is that the product is contaminated\".\n\nHe said that the recall announcement was published late on Sunday, July 26, 2015, when the company reported to the Ministry of Health only on Tuesday, July 28, at 6:00 pm – \"ie, a negligible range of two days after the company discovered Malfunction\", and the Ministry of Health published the announcement to the public only on Wednesday at 14:10. \"The arrest of the vaccine was therefore delayed 4 days after the case, during which the defective vaccine was given to thousands of newborns.\"\n\nSecond, the company and the Ministry of Health \"made do with only a visual examination of the crack in the packaging, without imaging testing and without examining the presence of microbiological contamination in vials\".\n\nAccording to the MOH conference call summary document regarding the defect - to the MOH question, \"Is there a fear that they will use a cracked wail?\" The company replied that the nurse measures a 0.5 mL volume syringe and if the volume will be smaller than that, than this specific vial will not be used. \"This answer is illogical and unreasonable, and demonstrates the superficiality of the investigation and the lack of necessary precautions to prevent giving a defective vaccine to babies\", Dr. Veretnik wrote.\n\nAccording to him, \"In the process of controlling industrial production ... the volume of the product is tested in the laboratory ... Any deviation of 10% above or below the volume of the product listed on the label disqualifies the product for marketing and use. A deviation of 10% of the product volume of 0.5 mm means 0.05 ml - a quantity that would be difficult for a human eye to detect... The nurse, especially under the conditions of working with infants, should not be expected to notice a deficiency of 0.05 ml\". \n\n\"The lawsuit constitutes a serious indictment against the Ministry of Health\", says Plainfiff’s counsel, Dr. Ahuva Ticho, \"The Ministry of Health failed in its role to protect public health. The Ministry of Health must answer to the public as to how it had approved and introduced vaccinations in babies, with a vaccine that has never been approved in any Western country and without proper trials in infants, and that it itself declares that it has more side effects\".It (the Ministry) must explain why it hid from the parents that the vaccine was defective and dangerous, why it failed to warn them and physicians about the risk of contaminated vials and why it did not instruct them to come and have their children examined. Scivac must explain how it manufactured and marketed a vaccine for infants, without proper clinical studies.\"\n\n\"The vaccine was marketed with the deception of physicians and the public, without informing the parents that it was experimental and without their informed consent\", says attorney Or-Chen. \"By doing so, the company has turned newborns into 'guinea pigs'. Even when the vaccine was found to be defective, the company concealed it and did not act properly to correct it and inform the parents in time, thus endangering the babies and causing great anxiety among the parents.\"\n\nThe Ministry of Health said in response: \"the Ministry of Health will study the lawsuit and will respond in court, as is customary. We note that this is a safe and effective vaccine that has prevented great morbidity in Israel.\"\n\nJeff Baxter, VBI’s CEO, issued the following statement: “We are always sorry to hear about any developmental complications in young children and about the difficulties experienced by their families. However, there is no evidence in the extensive clinical study experience and usage history of Sci-B-Vac® that such complications are a result of vaccination with Sci-B-Vac®. SciVac is still reviewing the content and nature of these claims, given they were filed so recently. That said, we take these claims and allegations very seriously and will respond and investigate accordingly. SciVac holds itself to the highest standards of integrity and compliance in its commitment to safely and effectively address public health unmet medical needs.”\n\nThe writer holds a Ph.D. in Health Communication from the University of Haifa, Israel, and is a health communication researcher. The Hebrew version of this article was published on Ynet, September 19, 2018.\n\nhttps://www.ynet.co.il/articles/0,7340,L-5348495,00.html", "opengraph": {"title": "A serious lawsuit: \"An experimental vaccine was given to hundreds of thousands babies in Israel\"", "site_name": "AGE OF AUTISM", "type": "blog", "url": "https://www.ageofautism.com/2019/11/a-serious-lawsuit-an-experimental-vaccine-was-given-to-hundreds-of-thousands-babies-in-israel.html", "description": "A serious lawsuit: \"An experimental vaccine was given to hundreds of thousands babies in Israel\" Dr. Yaffa Shir-Raz Dr. Yaffa Shir-Raz (Ph.D., The University of Haifa, Israel) is a health and risk communication researcher, as well as a health journalist,...", "image": "https://www.rescuepost.com/.a/6a00d8357f3f2969e20240a4cb1077200d-600wi"}, "tags": [], "tweets": [], "movies": [], "links": ["about:blank"], "authors": [], "publish_date": null}