{"result_id": "012039", "URL": "https://www.ageofautism.com/vaccines/page/5/", "timestamp": "2023-04-25 11:56:42 CEST+0200", "meta": {"description": "News and opinion relevant to families raising children with autism into adulthood and beyond.", "lang": "en", "keywords": "autism, health, choice, disability, adulthood, education, autistic", "favicon": "", "canonical": "https://www.ageofautism.com/vaccines/", "encoding": "utf-8"}, "image": null, "domain": "www.ageofautism.com", "title": "AGE OF AUTISM", "cleaned_text": "Maine is small. It is really hard to get away with stuff here without anyone noticing. And our legislators don't have offices, so you can just walk up to them while they are milling around in the hallways. (No one can accomplish a #PanRan here.) So news travels fast, and it didn't take long for everyone to hear that lobbyist Peter Michaud wrote LD 798, the single worst vaccine exemption removal bill ever introduced in the US.\n\nI have been super busy fighting this bill, so apologies that I have not gotten around to telling non-Mainers about it.\n\nRight now Maine has all three exemptions, but our medical exemption is severely restricted as of 2016. It is near impossible to get one now, but no need, right? We have both religious and philosophical. \n\n\n\nEnter LD 798, sponsored by democratic representative Ryan \"Every Child In Maine Should Have The Opportunity To Receive An Excellent Education\" Tipping of Orno, Maine, which removes the religious and philosophical vaccine exemptions from all Maine education and health care law. Throwing thousands of Mainers out of daycare, preschool, k-12 (public and private, kids with 504s, all incoming kids with IEPs), colleges and universities, and all medical professions. Also any new groups, such as EVERY ADULT IN MAINE, for whom they decide to issue new mandates. (No I don't know how they plan to violate federal law and keep 504 and IEP kids out of school. They don't either. But apparently it MUST be done for the good of society.)\n\nIt is a complete eradication of 1st Amendment vaccine rights in the state of Maine if you want to fully participate in society.\n\n\n\nAnd it was written by Peter Michaud, Esq. RN, lawyer and lobbyist for the Maine Medical Association (MMA) which is the Maine branch of the American Medical Association (AMA.)\n\nPeter is trying a Reverse Pan here in Maine. California first ditched their Personal Belief Exemptions in 2015, and is now going for restricting medical. Poor Pete had to wait on messing with the PBEs in Maine because we had a Governor who vetoed it in 2015, so he and his hit squad first restricted the medical exemption by fiat (because the law allows the Maine DHHS to do it with the wave of a pen,) and had to wait for new Governor that would allow this. He got one in Janet Mills. Sister to Dora Mills, pediatrician and primary vaccine PR Queen in Maine for as long as I can remember.\n\nRegular AoA readers will remember Pete. He is the guy who testified against our bill to educate health care providers on the Vaccine Injury Compensation Program, while testifying that he didn't know anything about the Vaccine Injury Compensation Program? Did I mention that he is also an RN? Which is a health care provider?\n\nHe is the guy same guy who offered the the super scientific and legally air tight case for coerced vaccination to our Health and Human Services Committee because, sure there might be some risk, but, “At some point you have to trust somebody.”\n\n\n\nAdditionally, and I have never highlighted this before, Michaud testified, speaking on behalf of the MMA no less, that he didn't believe the women telling the Committee about the poor treatment they were receiving in pediatricians offices.\n\n\"As you know I represent the Maine Medical Association. I have heard a lot of horrible things about doctors today. And you'll believe what you believe based on what you've heard. I refuse to believe that so many doctors in this state are unfeeling, are horribly rude, are bullies, don't have the best interests of their patients in mind.”\n\nThe MMA officially not believing women would explain a lot.\n\nBut Peter Michaud has topped himself this year.\n\nWhen I heard that he had actually written the bill, I, as I am want to do, flipped out and made a loud video announcing it. Me and all my friends then wrote to and called the MMA and pretty much demanded confirmation from them. No such confirmation or denial was forthcoming.\n\nBut we did ask our legislators to ask good ol' Pete what the deal was. And we mentioned in a flier distributed on the floor of the Maine House of Representatives that, “LD 798 is a vaccine sales bill sponsored by the pharmaceutical industry.” \n\n\n\nApparently that was enough to get him to respond. And his response was stunning.\n\nPeter Michaud is General Counsel and a registered Lobbyist for the Maine Medical Association. On March 13, 2019, in his testimony in support of LD 798, and in opposition to LD 987 to expand medical exemptions, before the Joint Standing Committee on Education and Cultural Affairs, made the admission that he is the co author of LD 798, and then made the bizarre claim that he is not sponsored by the pharmaceutical industry:\n\n“There was a claim made in a floor sheet that was distributed in the house... That, “LD 798 is a vaccine sales bill sponsored by the pharmaceutical industry.” I can assure you, that is not the case. The the bill was written in part by Representative Tipping, and in part by me. My authorship was pretty simple. X Y Z is repealed, but neither one of us is sponsored by the pharmaceutical industry.”\n\nExcept that he IS sponsored by the pharmaceutical industry. Very, very sponsored. Not by pejorative “Big Pharma,” in some roundabout way, but by actual PhRMA. The Pharmaceutical Research and Manufacturers of America®, who proudly represents “the country’s leading biopharmaceutical researchers and biotechnology companies.”\n\nMerck as in MMR II Merck.\n\n\n\nBCG Vaccine, Gardasil, Gardasil 9, MMR II, PedvaxHIB, Pneumovax 23, ProQuad, Recombivax HB, RotaTeq, Vaqta, Varivax, and Zostavax Merck.\n\nAs in #CDCWhistleblower in that Vaxxed movie with William Thompson and Frank DeStefano, Merck.\n\nMerck as in US v. Merck, and Chatom v. Merck, and Robi v. Merck, and Everyone Who Took Zostavax v. Merck.\n\nActual friggin' Merck & Co., Incorporated. \n\n\n\n(Begging the question... should he now be “PhRMA Pete” or “Merck Michaud”?” Vote in the comments.)\n\n\n\nThe following are entities listed as \"Corporate Affiliates” on the Maine Medical Association's website:\n\nABBVIE\n\nALEXION PHARMACEUTICALS, INC.\n\nALKERMES PLC.\n\nALLERGAN PLC\n\nAMGEN INC.\n\nASTELLAS AMERICAS\n\nASTRAZENECA PHARMACEUTICALS LP\n\nBAYER CORPORATION\n\nBIOGEN\n\nBIOMARIN PHARMACEUTICAL INC.\n\nBOEHRINGER INGELHEIM PHARMACEUTICALS, INC.\n\nBRISTOL-MYERS SQUIBB COMPANY\n\nCELGENE CORPORATION\n\nDAIICHI SANKYO, INC.\n\nEISAI INC.\n\nELI LILLY AND COMPANY\n\nEMD SERONO\n\nGENENTECH\n\nGILEAD SCIENCES, INC.\n\nGLAXOSMITHKLINE\n\nIPSEN BIOPHARMACEUTICALS, INC.\n\nLUNDBECK INC.\n\nNOVARTIS PHARMACEUTICALS CORPORATION\n\nOTSUKA AMERICA PHARMACEUTICAL, INC. (OAPI)\n\nOTSUKA PHARMACEUTICAL DEVELOPMENT & COMMERCIALIZATION, INC. (OPDC)\n\nPFIZER INC.\n\nPURDUE PHARMA L.P.\n\nSANOFI\n\nSANOFI PASTEUR\n\nSUNOVION PHARMACEUTICALS INC.\n\nTEVA US SPECIALTY MEDICINES\n\nUCB\n\nI am exceedingly proud to report that I sat perfectly still and quiet as Pharma Pete said these words to the committee not 30 feet away from me. I didn't even jump up, point at him and yell, “ARE YOU SERIOUSLY KIDDING ME! WHAT THE HELL ARE YOU TALKING ABOUT!”\n\nFor this act of restraint I expect your high praise. (Leave in the comments.)\n\nNo one on the committee seemed to notice or question the claim, but why would they really. They have probably never visited the MMA website, and they assume that of course, the MMA represents doctors, not pharmaceutical companies. Why wouldn't they?\n\n\n\nBut one dad did notice. He was sitting in the overflow room listening to Michaud's testimony in the afternoon and was all, “That doesn't sound right.” And he checked the MMA website. \n\n\n\nHis daughter is vaccinated, but he cares about choice, so he put him self on the list to speak and waited until 2:10am, testifying very last from his hand written notes. He asked the most important question of the day:\n\n“How is this just not disclosed?”", "opengraph": {"title": "AGE OF AUTISM", "site_name": "AGE OF AUTISM", "type": "blog", "url": "https://www.ageofautism.com/", "description": "Age of Autism provides daily insights into the autism epidemic. Part of the Autism Age 501c3 non-profit organization, our mission is to share information with families facing the daily challenges & joys that surround autism. For more than 15 years, AofA has been a lone voice discussing even the most controversial subjects - because THAT'S what journalists do. Freedom of speech is alive and well here. Join us.", "image": "https://up1.typepad.com/6a00d8357f3f2969e20263e9886624200b-220si"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/cNyyOLx4Pes?start=464\" width=\"560\"/>", "src": "https://www.youtube.com/embed/cNyyOLx4Pes?start=464"}, {"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/MnAXZ_g8byE?start=3928\" width=\"560\"/>", "src": "https://www.youtube.com/embed/MnAXZ_g8byE?start=3928"}], "links": ["https://www.rescuepost.com/.a/6a00d8357f3f2969e20240a49924c0200b-pi", "http://legislature.maine.gov/housedems/tippingr/index.html", "https://www.rescuepost.com/.a/6a00d8357f3f2969e20240a47494f0200d-pi", "https://www.ageofautism.com/2015/05/maine-doctors-testify-that-they-are-unqualified-to%20-vaccinate-patients.html%20", "https://www.ageofautism.com/2015/05/vaccines-at-some-point-you-have-to-trust-somebody.html", "https://www.facebook.com/morepuppies/videos/vb.526473386/10156588037933387/?type=3", "https://www.mainemed.com/personel/michaud-peter", "http://www.mainelegislature.org/legis/bills/getTestimonyDoc.asp?id=101111", "https://www.phrma.org/", "https://www.mainemed.com/member-services/corporate-affiliates"], "authors": [], "publish_date": null}