{"result_id": "012019", "URL": "https://www.ageofautism.com/2022/12/how-to-cheat-and-lie-with-vaccine-science-a-review-of-turtles-all-the-way-down.html", "timestamp": "2023-04-25 11:56:25 CEST+0200", "meta": {"description": "By Dr. William H. Gaunt, NMD Turtles All the Way Down: Vaccine Science and Myth was first published in Israel in early 2019. It was written in Hebrew. It has now been published in English. The authors are anonymous because...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.ageofautism.com/2022/12/how-to-cheat-and-lie-with-vaccine-science-a-review-of-turtles-all-the-way-down.html", "encoding": "utf-8"}, "image": null, "domain": "www.ageofautism.com", "title": "How To Cheat and Lie with Vaccine Science: A Review of Turtles All The Way Down", "cleaned_text": "A valid safety trial should compare an Experimental Group which gets the vaccine with a Control Group that gets an Inert placebo (which is harmless). If trials are done in this way and the vaccine group has more adverse events (injuries and deaths) than the control group, those adverse events can be attributed to the vaccine being tested. In order to hide the adverse events caused by vaccines, the trials are now arranged so the “control group” gets a different vaccine instead of an inert placebo. The result is that a similar number of adverse events occur in both groups because one toxic vaccine is being compared to another toxic vaccine. The claim is then made that the vaccine being tested is safe. Doing safety trials in this way is clever but it is clearly cheating. On page 52, the authors state: “Vaccine trials in general and childhood vaccine trials specifically, are purposely designed to obscure the true incidence of adverse events of the vaccine being tested.”\n\nOn page 37, the authors make this clear: “Clinical trials of vaccines are rigged to hide their true (and high) rate of side effects, which means that the medical establishment’s longstanding claim that vaccines are safe has no scientific merit.” This is a serious claim and the authors back it up with solid evidence as you will see.\n\nTurtles All the Way Down: Vaccine Science and Myth was first published in Israel in early 2019. It was written in Hebrew. It has now been published in English. The authors are anonymous because doctors and scientists who question the veracity of the vaccine agenda get crushed. This is the most important book ever written about vaccines. It was written pre-Covid. Covid-19 vaccines are not covered in this book. What this book does show is clear and compelling evidence of cheating and lying with the vaccines on the CDC schedule for children. It was written, first and foremost, for parents and future parents. It is also a great resource for all others who want to know the truth about vaccines. In the introduction on page 29, the authors state: “If you choose to continue reading, you will have to gather the courage required for a journey to the other side of reality, courage to face new facts and examine them objectively, courage to ask hard questions when you are expected to merely obey, and courage to stand your ground in the face of pressure from family, friends, doctors, government officials, and what will probably feel like everyone else.” If you are ready for this challenge, read on.\n\nIn a safety trial for the new DTaP (diphtheria, tetanus, and pertussis) vaccine, the “control group” received the older DTP vaccine. 1 in every 22 subjects in the experimental group became so ill that they were admitted to the hospital. A similar rate of hospitalization was also reported in the control group. This trial does not show that the DTaP vaccine is safe as claimed. A more logical interpretation would be that the DTaP vaccine and the older DTP vaccine both have a high rate of adverse events which caused a significant number of children to be hospitalized. Doing this safety trial with a control group which received an inert placebo would have clearly shown that the DTaP vaccine is not safe. The authors describe this safety trial on page 78.\n\nWhy Doesn’t the CDC Prevent these Shenanigans?\n\nRegulatory capture is when an industry gains control of the government agency which regulates it and is supposed to protect the public. This has been accomplished with the CDC and other agencies. After they are captured, they function to promote and protect the industry rather than protect the public. This situation is widespread across many industries. The CDC is firmly on the side of big pharma and the vaccine companies.\n\nImagine That You Are a Scientist at a Major University\n\nLet’s say that you get a multimillion dollar grant to safety test a new vaccine. If you do a safety trial and find out that this vaccine causes serious adverse events and you publish that conclusion, what do you think your chances would be to get another multimillion dollar grant in the future? Probably slim to none. There is a lot of money on the line and there is great pressure to conclude that new vaccines are safe regardless of the facts.\n\nWhat Is the Takeaway for Chapter One?\n\nA summary of chapter one appears on pages 81 and 82: “Vaccine trials are designed and performed in such a way as to ensure that the true extent of adverse events is hidden from the public. There is not a single vaccine in the U.S. routine childhood vaccination program whose true rate of adverse events is known. The assertion that vaccines cause serious side effects in “one in a million” vaccines disregards the results of numerous clinical trials in which serious adverse events were reported in 1 in 40, 30, or even as few as 20 vaccinated infants.”\n\nVAERS is the Vaccine Adverse Events Reporting System. Why does it pick up only between 1 and 10 percent of vaccine injuries? One reason is that most parents are completely unaware that they can report their child’s post-vaccination adverse health events directly. Another reason is that medical professionals only report a tiny fraction of vaccine injuries and there is no consequence for not reporting. In a government funded study, a system was developed by researcher Ross Lazarus and his team that would automatically indicate a likely vaccine injury. This system would identify a much larger percent of vaccine injuries. The CDC rejected this more efficient system. Who benefits when only a small percentage of vaccine injuries and deaths are reported? The current system only helps perpetuate the false narrative that vaccine adverse events are very rare. The authors comment on page 125: “Health authorities appear quite comfortable with deficient and unreliable-by-design reporting systems, whose data cannot be used to challenge their “Vaccines are safe” message, as exemplified by the CDC inexplicably blocking a government-funded project to improve VAERS.” The CDC does not want VAERS to be more efficient at detecting vaccine injuries and deaths. Remember regulatory capture.\n\nAt the beginning of chapter 5, the authors state: “In this chapter we will look at how medical and scientific bodies make use of biased epidemiological research to present an illusion of vaccine safety to the public … a coherent picture emerges of a deliberate and systemic process used to generate a complex of misleading scientific research designed to cover up the truth about vaccine safety.” On pages 162-199, the authors provide a detailed analysis of five “doctored” vaccine studies. The details of these studies are too voluminous to be included in this article but interested readers are encouraged to read about these studies to see how biased and dishonest vaccine science can be. The authors describe these studies as deeply flawed, misleading science that serves the vested interests of the funders of the medical journals (big pharma) in which they were published instead of the truth. On pages 191-192, they state: “The obvious question, then, is how did this quintet of purposely flawed studies ever make it through that rigorous screening process [peer review]? Why and how did prestigious journals such as NEJM [New England Journal of Medicine] and Pediatrics print studies with such glaring faults? Why would leading medical journals put their hard-earned reputations at risk by publishing flawed research?” Part of the answer is that big pharma is quite powerful and generally gets what it wants. Is this not cheating and lying?\n\nWhy are Epidemiological Studies So Popular?\n\nIn the summary of chapter 5 on pages 198 and 199, the authors answer this question: “Epidemiological studies are the tool of choice for health authorities and pharma companies to maintain a façade of vaccine safety science. They are cheap, relatively simple to conduct, and, above all, their results are easily manipulated … Would you expect pharmaceutical companies and government agencies to fund vaccine safety studies that could potentially find serious faults in the vaccines they manufacture, license, and recommend to the public?”\n\nStudies That the CDC and Big Pharma Will Never Fund\n\nVaccinated versus unvaccinated studies (VU studies) will apparently never be funded despite parents demanding these studies for more than 30 years. Imagine a large study which compared fully vaccinated children with never vaccinated children. Why are such studies avoided like the plague? Answer: The results would show that completely unvaccinated children are far healthier than fully vaccinated children. On page 206 and 207, the authors address this issue: “…the overall health impact of routinely administering an ever-increasing number of vaccines to American infants has never been studied. In other words, the fundamental question that bothers every vaccine-informed parent – “Will my child be better off fully vaccinated, partially vaccinated, or unvaccinated?” – has never been adequately answered by science. No study that compares the overall health of vaccinated children to that of unvaccinated children has ever been done by the medical establishment.” [A few VU studies not mentioned in this book have been privately funded and published in less well-known scientific journals. If you click this link: Article 1, you will be instantly teleported through a black hole to my article titled “Unvaccinated Children Are Healthier”. You will see that the unvaccinated children in these studies are substantially healthier than the vaccinated children. Enjoy.] If the authorities who control money for vaccine research wanted to settle the “vaccines cause autism” accusation, they would fund a VU study. Which group would have a much higher rate of autism?\n\nOn page 209, the authors describe the sad state of autism research: “Over the past 15 years, dozens of epidemiological studies have been conducted examining the association between vaccines and autism, but not even one compared the rate of autism in fully vaccinated versus fully unvaccinated children. Despite the fact that autism has become a huge social and financial burden on American society, the U.S. medical establishment has stubbornly rejected every opportunity to dive deeper into its root causes by investigating the rates of autism in unvaccinated populations.” Here are a few of the situations that have been ignored instead of investigated: (1) In 2005, Dan Olmsted discovered that the large Amish population in Lancaster County, Pennsylvania had a strikingly low rate of autism. They also had a low rate of vaccination. This was an excellent opportunity to investigate the causes of autism, but the authorities looked the other way. (2) Olmsted also investigated the Homefirst clinic of Dr. Mayer Eisenstein and colleagues near Chicago. They did home births and many of their patients choose to avoid vaccines. These doctors said they had zero cases of autism among the thousands of unvaccinated children they’d had under their care over more than 30 years. This is another situation that cries out to be investigated, but the CDC did nothing. (3) In 2004, the Ruppin Academic Center in Israel compared the rate of autism among Israeli children of Ethiopian descent born in Ethiopia with those born in Israel. The children born in Israel had an autism rate equal to the Israeli national rate while those born in Ethiopia had an autism rate of zero. Israel’s vaccine schedule is very similar to the U.S. schedule. It is not surprising that the Ruppin study was not investigated. (4) In 2008, there were news stories reporting a high rate of autism in children of Somali descent born in Minnesota. The rate of autism in the children born in Somalia who got far fewer vaccines was zero. Again, no investigation. Another missed opportunity to do a naturally occurring vaccinated/unvaccinated autism study. The authors discuss these cases on pages 209 through 213. There are lots of excuses claiming that VU studies cannot be done but the authors disagree. Less than one percent of children born in the U.S. are completely unvaccinated but that still adds up to at least 30,000 unvaccinated children born each year. Many of their parents would be happy for these children to be the unvaccinated part of a VU study.\n\nVU Studies Have Most Likely Been Done Then Buried\n\nThe authors speculate on this possibility on page 233: “If these internal VU studies were indeed quietly performed, as seems very likely, why weren’t they published? … There can be only one explanation: The results were markedly in favor of the unvaccinated … If those informal VU studies showed a positive result for vaccines, they would have been published faster than you can say “vaccines are safe and effective!” – no doubt about it.”\n\nMore and More Vaccines à More and More Chronic Diseases\n\nOn page 206, the authors point out: “…No VU studies have been conducted for cancer, asthma, diabetes, learning disorders, ADHD, Crohn’s disease, and many other life-altering conditions, although all of them have become increasingly common in recent decades.” [If you click this link: Article 2, you will be beamed up to my article titled “Chronic Diseases in Vaccinated Versus Unvaccinated” to see the results of a pilot study which shows much higher rates of chronic diseases in vaccinated children and adults compared to an unvaccinated control group.]\n\nDid Vaccines Save Us All from Deadly Infectious Diseases?\n\nOn page 267, the authors address this widely believed misconception: “The idea that vaccines have freed humanity from the deadly diseases of yore is deeply ingrained in our collective consciousness … Everyone knows we have the medical profession and vaccines to thank for our (relatively) disease-less lives … Unfortunately, everyone is wrong … Historical evidence uncovered in the second half of the 20th century shows, clearly and unequivocally, that the narrative of “life-saving vaccines” is largely fictitious.” For example, mortality from measles dropped almost 99% before the measles vaccine was introduced. The authors point out on page 270: “nearly 90% of the decline in infectious disease mortality among U.S. children occurred before 1940 when few antibiotics or vaccines were available.” So, what did cause this drastic decrease in infectious disease mortality if it wasn’t vaccines and antibiotics? Sanitation in many forms and improved nutrition are the real heroes that deserve credit for most of the decrease in infectious disease mortality. The authors sum this up on page 306: “Although they are well aware that the bulk of the reduction in the burden of infectious disease cannot be attributed to vaccines, and that extensive research literature and rock-solid scientific evidence have proven that fact, health authorities around the world continue to promote the largely false “vaccines eradicated the great diseases of yore” myth.” Let’s end with this quote on page 509-510: “…One must inevitably conclude that all parties involved are engaged in deliberate and systematic efforts to hide the painful, astonishing, and earth-shattering truth regarding the “safety” of vaccines from the public.”\n\nDr. Gaunt’s conclusion: Many chronic diseases are being caused by vaccine ingredients. Cheating and lying by vaccine companies, the CDC, and others is clearly described in this book. Greed by big pharma and vaccine companies is the primary motivation. This article covers only the highest of highlights. Please read this book for yourself and spread the word far and wide. We need to help people wake up to the tragedy of great harms being caused by vaccines.\n\nAbout the author: Dr. William H. Gaunt is a retired Doctor of Naturopathic Medicine. He is a graduate of the University of South Florida in Tampa. He was a U.S. Navy helicopter pilot and later an instructor pilot for the Iranian Navy and the Saudi Arabian Air Force before attending medical school at Bastyr University near Seattle, Washington. Dr. Gaunt graduated with honors in 1983. He has also taught chemistry, biology, and anatomy at high school and college levels and published several articles related to vaccines. Dr. Gaunt and his wife have a blended family of 8 boys plus a girl adopted from China.\n\n\n\n\n\nAlso available from Skyhorse Publishing:\n\n\n\nLies My Government Told Me. \n\nA guide for the times—breaking down the lies about COVID-19 and shedding light on why we came to believe them. \n\n\n\n \n\n\n\nThe Truth About Wuhan\n\nShocking new insider information that shows what really happened in Wuhan, China, at the start of the COVID-19 outbreak and in the ensuing cover-up.", "opengraph": {"title": "How To Cheat and Lie with Vaccine Science: A Review of Turtles All The Way Down", "site_name": "AGE OF AUTISM", "type": "blog", "url": "https://www.ageofautism.com/2022/12/how-to-cheat-and-lie-with-vaccine-science-a-review-of-turtles-all-the-way-down.html", "description": "By Dr. William H. Gaunt, NMD Turtles All the Way Down: Vaccine Science and Myth was first published in Israel in early 2019. It was written in Hebrew. It has now been published in English. The authors are anonymous because...", "image": "https://www.rescuepost.com/.a/6a00d8357f3f2969e202af14877e90200c-600wi"}, "tags": [], "tweets": [], "movies": [], "links": ["https://jennifermargulis.net/unvaccinated-children-are-healthier", "https://jennifermargulis.net/incidence-of-chronic-diseases-in-vaccinated-versus-unvaccinated", "https://amzn.to/3gZUlf7", "https://amzn.to/3BfDMlU"], "authors": [], "publish_date": null}