{"result_id": "013003", "URL": "https://newsinstact.com/global-elite-plans-to-down-90-of-new-9119/", "timestamp": "2023-04-25 11:56:55 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://newsinstact.com/wp-content/uploads/2019/11/cropped-logo-yt-32x32.jpg", "canonical": "https://newsinstact.com/global-elite-plans-to-down-90-of-new-9119/", "encoding": "UTF-8"}, "image": null, "domain": "newsinstact.com", "title": "Global Elite Plans to Exterminate 90% of the Earth’s Population, According to Some Theories", "cleaned_text": "Beyond global political scandals, the corporate elite (financial, military, industrial elite) plans to exterminate 90% of the world’s earth’s population to save the earth from the ecological disaster of overpopulation and to secure the elite a brilliant future at the cosmic level. These plans are helped by these two favorable situations:\n\n1. The first is the informatization of government and corporate administrations and the robotization of industrial processes.\n\nInformatization and robotization will lead to the replacement of human workers with robots and smart computer programs. From the point of view of corporations, man is regarded as a cheap and easy to manipulate who worked on small wages and vote for politicians sponsored by corporations.\n\nAs additional information, I say that all politicians, irrespective of their so-called political and doctrinal orientation, are sponsored by the corporate elite to make laws in their favor.\n\nRobotization will eliminate human work from production processes; under these conditions corporations will no longer need people. Because of this, the vast majority of the Earth’s population will become jobless and useless. And what do you do with some people you can not exploit anymore because you just do not need them !?\n\nHowever, robots are inexpensive and they do not require meals and medical insurance, nor leave holidays. For all the reasons I have listed before, robots are the perfect obedient tools for this criminal elite.\n\nIf you are not convinced that robots will take your job means you do not understand the trend that is going on globally.\n\n2. The second situation favorable to the elite’s plans is that financial aid and unemployment benefits, and all kinds of pensions, will put increasing financial pressure on governments, and governments will borrow more money and will accumulate more debts that will be so great that in the end, no government will pay them anymore.\n\nThis scenario will get worse as robots will take more and more jobs from humans and people will be out of jobs and governments will have to pay financial aid.\n\nFinally, governments, which serve the elite, will accept that the population will be exterminated so that they will no longer have problems with their financial debts in the future. Believe me, when I say to you, mankind is on the brink of collapse.\n\nOn the other hand, the elites believe it is better than money earned from industrial, commercial, and service activities are geared towards space colonization programs and not to unemployed people.\n\nElite believes that the future of human civilization is in space by colonizing other planets. Of course, when it comes to human civilization, the elites refer to themselves, without taking into account the remaining few billion people who are their slaves right now.\n\nIn other terms, elites consider the billions of ordinary people who are their slaves as useless eaters and consider that these useless eaters consume the resources of the planet, resources that are limited.\n\nElite believe that these useless eaters must be exterminated like cockroaches so that the planet survives in the future. Globalist elites believe they need to focus on the following points:\n\n– To colonize other planets and not just planets in our solar system, but especially planets from other solar systems.\n\n-Build spacecraft with faster-than-light technology engines to quickly travel beyond our solar system.\n\n-To build defense systems, weapons, based on revolutionary and exotic technologies to defend the planet from the possible attacks of extraterrestrial civilizations that this elite knows exists.\n\n-To make breakthroughs in artificial intelligence, in quantum computer technology, and in building materials engineering to build station and spacecraft as well as colonies on Mars and other planets.\n\nGlobalists believe that the current situation where governments money is spent mostly on financial aid and pensions of these useless eaters is not sustainable and sees the elimination of the population as a necessary evil to save the planet.\n\nIn essence, every dollar spent on pensions of retired government officials, unemployment workers, and stamp food will be better spent on colonizing Mars and space. All pro-migration policies are designed to undermine state sovereignty, eliminate borders, and give control to the UN which is under the control of the Elite and will install a global government.\n\nWhat means will the globalist elite use to exterminate us?\n\nThe elite will create one or more viruses that will infect us in different ways. When this happens, governments will declare it was just an accident and no one is to blame, but we know better what’s going on.\n\nSome news websites speculate that a pandemic occurs almost every 100 years. I want to remind you of the 1720 plagues, 1820 cholera outbreak, 1920 Spanish Flu, and now in 2020 the Coronavirus Pandemic.\n\nWhy viruses?\n\n Because they are invisible and can not be detected, because once released in populated areas they propagate very quickly and because they will allow the global government installed in the meantime by elites to declare pandemic and urgency and to adopt mass vaccination which, of course, will secure the elites that no one will escape.\n\nOf course, the elites will isolate themselves from the virus, and anyway, they will have the real antidote available to them if they need it. Before releasing the virus, the elites are working to weaken the useless eater’s immune system through various criminal methods, and the plans are already in motion:\n\n1. Chemical contamination of soil and food.\n\n 2. Use vaccines and toxic drugs.\n\n 3. To produce toxic food that destroys human immunity.\n\n 4. Use propaganda against vitamins that help strengthen human immunity, vitamin D, zinc, and selenium.\n\n 5. Promote sexual contraception and deviant sexual behavior and anal sex so that women do not become pregnant.\n\n 6. Government and private debt collapse are close.\n\nTake a look at the following videos.", "opengraph": {"locale": "en", "type": "article", "title": "Global Elite Plans to Exterminate 90% of the Earth’s Population, According to Some Theories", "description": "Beyond global political scandals, the corporate elite (financial, military, industrial elite) plans to exterminate 90% of the world’s earth’s population to save the earth from the ecological disaster of overpopulation and to secure the elite a brilliant future at the cosmic level. These plans are helped by these two favorable situations: 1. The first is the informatization of government and corporate administrations and the robotization of industrial processes. Informatization and robotization will lead to the replacement of human workers with robots and smart computer programs. From the point of view of corporations, man is regarded as a cheap and easy …", "url": "https://newsinstact.com/global-elite-plans-to-down-90-of-new-9119/", "site_name": "Alien News", "article:published_time": "2020-05-05T19:17:32+00:00", "article:modified_time": "2020-07-13T17:41:15+00:00", "image": "https://newsinstact.com/wp-content/uploads/2019/03/agenda-21.png", "image:width": "600", "image:height": "315", "image:type": "image/png", "image:url": "https://newsinstact.com/wp-content/uploads/2019/03/agenda-21.png", "image:secure_url": "https://newsinstact.com/wp-content/uploads/2019/03/agenda-21.png"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/6l79Qa92DeU\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/6l79Qa92DeU"}], "links": ["https://newsinstact.com/wp-content/uploads/2019/03/robot-police.jpg", "https://newsinstact.com/wp-content/uploads/2019/03/banking.jpg", "https://newsinstact.com/wp-content/uploads/2019/03/Coronavirus-global-epidemic-agenda-21.jpg"], "authors": ["admin"], "publish_date": "2020-05-05T19:17:32+00:00"}