{"result_id": "013002", "URL": "https://newsinstact.com/youre-still-alive-30-years-might-live-1000-years-old-965/", "timestamp": "2023-04-25 11:56:54 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://newsinstact.com/wp-content/uploads/2019/11/cropped-logo-yt-32x32.jpg", "canonical": "https://newsinstact.com/youre-still-alive-30-years-might-live-1000-years-old-965/", "encoding": "UTF-8"}, "image": null, "domain": "newsinstact.com", "title": "If You’re Still Alive in 30 Years, you Might Live to be 1,000 Years Old", "cleaned_text": "For years, the human race has been fearful of the concept that ends us all. Sometimes it comes slowly with age, and other times it can come out of the blue by some uglier means: heart attacks, drownings, and other maladies can all work to bring us closer to death.\n\nCould the Average Human Lifespan Increase More Than Tenfold in 30 Years?\n\nHowever, since our existence, the average length of human life has increased drastically. Even up to a few hundred years ago, maladies such as the plague and cholera wiped out astounding amounts of humans. Women had to give birth to upwards of a dozen children to keep the population in check, like disease or the non-trivial risk of having a stillborn baby made most of their children die before they could reach a respectful age.\n\nToday, thanks to advancements in technology such as vaccinations against the diseases that once plagued us and our more sanitary lifestyle, some people such as Jeanne Calment have been able to live up to 123 years old (en.wikipedia.org/…).\n\nBut what if we could live even longer than that? Scientists have come up with plans to create anti-aging medicine so powerful that it would be able to extend life until 1000 years of age? Ray Kurzweil, Google’s main engineer, is predicting that technology will become powerful enough to enable humans to live up to 200, or even 500 years of age.\n\nHowever, the age-old question lies: do we even want to live that long? There won’t be issues such as supporting the increasing amounts of humans as we will no longer need to compete for finite resources. Even still, after a few hundred years life can get pretty boring.\n\nSo would you folks want to live to be 1000 years if you had the option, or would you see a future world similar to Wall-E’s where humans sit on automatic wheelchairs and stare at their tablets for their entire lives? The choice is yours, and the deadline is rapidly approaching.", "opengraph": {"locale": "en", "type": "article", "title": "If You’re Still Alive in 30 Years, you Might Live to be 1,000 Years Old", "description": "For years, the human race has been fearful of the concept that ends us all. Sometimes it comes slowly with age, and other times it can come out of the blue by some uglier means: heart attacks, drownings, and other maladies can all work to bring us closer to death. Could the Average Human Lifespan Increase More Than Tenfold in 30 Years? However, since our existence, the average length of human life has increased drastically. Even up to a few hundred years ago, maladies such as the plague and cholera wiped out astounding amounts of humans. Women had to give …", "url": "https://newsinstact.com/youre-still-alive-30-years-might-live-1000-years-old-965/", "site_name": "Alien News", "article:published_time": "2020-11-29T10:00:38+00:00", "article:modified_time": "2020-11-29T12:49:54+00:00", "image": "https://newsinstact.com/wp-content/uploads/2018/01/age-future.png", "image:width": "1200", "image:height": "630", "image:type": "image/png", "image:url": "https://newsinstact.com/wp-content/uploads/2018/01/age-future.png", "image:secure_url": "https://newsinstact.com/wp-content/uploads/2018/01/age-future.png"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/jPmUGq25KBk\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/jPmUGq25KBk"}, {"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/5tn4P7IBqoQ\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/5tn4P7IBqoQ"}], "links": [], "authors": ["admin"], "publish_date": "2020-11-29T10:00:38+00:00"}