{"result_id": "015041", "URL": "https://anh-usa.org/the-future-of-covid-vaccines/", "timestamp": "2023-04-25 11:57:17 CEST+0200", "meta": {"description": "Will we get the data necessary to be able to make informed choices about COVID vaccination? Action Alert! A number of weeks ago, our friends at ANH International released a white paper detailing how autoimmune patients are at an increased risk of serious adverse events from COVID vaccination. As such, autoimmune patients have a legitimate", "lang": "en", "keywords": "", "favicon": "https://anh-usa.org/wp-content/uploads/2021/09/ANH-leaf-200-100x100.png", "canonical": "https://anh-usa.org/the-future-of-covid-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "anh-usa.org", "title": "The Future of COVID Vaccines - Alliance for Natural Health USA - Protecting Natural Health", "cleaned_text": "Will we get the data necessary to be able to make informed choices about COVID vaccination? Action Alert!\n\nA number of weeks ago, our friends at ANH International released a white paper detailing how autoimmune patients are at an increased risk of serious adverse events from COVID vaccination. As such, autoimmune patients have a legitimate medical reason to seriously consider not receiving the COVID vaccine, despite strong societal pressure to do so in order to fully participate in the re-opening of the country. Part of the reason for this caution is that there is still so much we don’t know, as these vaccines were developed and authorized under an accelerated timeframe. This lack of data makes informed decisions about risk and benefit difficult, if not impossible, for many patients, including autoimmune patients.\n\nThis position is reinforced by a petition submitted to the FDA by a group of highly respected, credentialed experts asking for at least two years of data before the FDA considers granting full approval to COVID vaccines (current COVID vaccines are currently operating under emergency use authorization, or EUA). Among other things, the petition urges the FDA to ensure that there is substantial evidence for safety and effectiveness that outweighs harms in special populations such as infants, children, adolescents, the immunocompromised, those with cancer, pregnant women, frail older adults, and patients with autoimmune disorders. These patients were excluded from the ongoing phase III trials of COVID vaccines, and the experts point out that “there is reason to believe the effects of the product may differ from the populations enrolled in the trial.”\n\nOur white paper explains the danger of COVID vaccines sparking an autoimmune disease through the process of molecular mimicry: the modified spike protein of the vaccine shares 26 peptide sequences with the human genome, which can cause a compromised immune system to attack “friendly” cells. This can take months or years to manifest, and we simply need more data and follow-up to know more about these dangers.\n\nOn the subject of needing more data, others have similarly pointed out that it is incumbent upon health authorities to acknowledge and follow up with large studies regarding the trends in adverse events we’re seeing related to COVID vaccines, including clusters cases of low platelets (thrombocytopenia); noninfectious myocarditis, or heart inflammation, especially for those under 30; deep-vein thrombosis; and death. Closer scrutiny can bring results that benefit patients safety: the FDA just indicated it will add a warning about the risk of heart inflammation to the Moderna and Pfizer vaccines for adolescents and young adults.\n\nYet despite the lack of data, the CDC, while falling short of recommending the vaccine to above-mentioned populations, largely says that these patients “may receive” the COVID vaccine.\n\nThe petition also calls for additional study of the safety of the spike protein, which the COVID vaccines instruct human cells to produce. This is in light of recent evidence of systemic circulation of the lipid nanoparticles we reported on recently. These nanoparticles carry the instructions for cells to make the spike protein of the COVID virus. There is evidence that the spike protein on its own can damage endothelial cells (the cells that line blood vessels). There may be differences in how wild virus spike proteins and vaccine-induced spike proteins behave in the body, but to dismiss the concern without further evidence would be irresponsible.\n\nThese and many other questions must be answered before the FDA even considers granting full approval to COVID vaccines, which Pfizer and Moderna have already applied for. There seems to be a consensus that, while it is an open question as to whether the government or businesses can mandate COVID vaccines while they operate under EUA, full approval from the FDA could spur more businesses, schools, and other entities to require the shot. We’ve already seen a number of universities say that they will require the shots for students only after they receive full approval.\n\nMandates usually come with exemptions for religious or medical reasons. But medical exemptions are notoriously narrow. According to the CDC’s guidelines, they are mostly limited to having a serious allergic reaction to a previous vaccine. It is unlikely that autoimmune patients would qualify for exemptions should mandates go into effect.\n\nWe don’t need mandates, though, to create a discriminatory environment for patients who have medical concerns about receiving the COVID vaccine. We’ve mentioned the example of Israel, where the government issues “green passes” allowing access to social, cultural, sporting events, gyms, restaurants, etc., to individuals who have either recovered from COVID or have had the vaccine. Green passes must be renewed every six months. More and more we’re seeing businesses, sports venues, and cruise lines fully open to vaccinated individuals, sometimes excluding the unvaccinated. This places undue pressure on those with legitimate medical concerns.\n\nPart of ANH’s core mission and identity are the principles of bodily autonomy and freedom of choice. There are not mandates for the COVID vaccine that eliminate choice. Choice in this instance for autoimmune patients is being more subtly undermined by a society that is increasingly conferring more privileges to the vaccinated than the unvaccinated. That isn’t right, particularly when safety and efficacy data for patient populations like the autoimmune are incomplete, and what data there is points to increased danger and reduced effectiveness.\n\nIt isn’t anti-science to ask for more data on vaccines that were approved on an abbreviated timeline, particularly when there are danger signals for certain populations of patients. More data gives us a more complete profile of their safety and efficacy, which allows true informed consent—a basic tenet of medical ethics.\n\nAction Alert! Write to the FDA, telling them you support the petition calling for more data before COVID vaccines receive full approval. Please send your message immediately.", "opengraph": {"locale": "en_US", "site_name": "Alliance for Natural Health USA - Protecting Natural Health - ANH Protects Free Speech About Natural Health Modalities, Bioidentical Hormone Replacement Therapy, Homeopathy and Access To Natural Therapies.", "type": "article", "title": "The Future of COVID Vaccines - Alliance for Natural Health USA - Protecting Natural Health", "description": "Will we get the data necessary to be able to make informed choices about COVID vaccination? Action Alert! A number of weeks ago, our friends at ANH International released a white paper detailing how autoimmune patients are at an increased risk of serious adverse events from COVID vaccination. As such, autoimmune patients have a legitimate", "url": "https://anh-usa.org/the-future-of-covid-vaccines/", "image": "https://anh-usa.org/wp-content/uploads/2021/09/ANH-logo300.png", "image:secure_url": "https://anh-usa.org/wp-content/uploads/2021/09/ANH-logo300.png", "image:width": "300", "image:height": "88", "article:published_time": "2021-06-24T14:31:38+00:00", "article:modified_time": "2021-06-24T18:02:07+00:00", "article:publisher": "https://www.facebook.com/ANHUSA"}, "tags": ["Latest News"], "tweets": [], "movies": [], "links": ["http://aahf.convio.net/site/Advocacy?pagename=homepage&id=3853", "https://sandbox.anh-usa.org/will-you-be-a-second-class-citizen/", "https://downloads.regulations.gov/FDA-2021-P-0521-0001/attachment_1.pdf", "https://sandbox.anh-usa.org/wp-content/uploads/2021/05/210513-Covid-19-vaccination-and-the-autoimmune_white-paper_executive-summary_ANH-USA.pdf", "https://www.wsj.com/articles/are-covid-vaccines-riskier-than-advertised-11624381749?st=tmqvr3nfp8fwzfd&reflink=article_copyURL_share", "https://www.reuters.com/business/healthcare-pharmaceuticals/us-panel-review-heart-inflammation-cases-after-pfizer-moderna-vaccines-2021-06-23/", "https://www.cdc.gov/vaccines/covid-19/clinical-considerations/covid-19-vaccines-us.html", "https://sandbox.anh-usa.org/double-whammy-for-autoimmune-patients/", "https://www.ahajournals.org/doi/epub/10.1161/CIRCRESAHA.121.318902", "https://www.npr.org/sections/coronavirus-live-updates/2021/05/07/994839927/pfizer-seeks-full-fda-approval-for-covid-19-vaccine", "https://www.cnbc.com/2021/06/01/covid-vaccine-moderna-applies-for-full-fda-approval.html", "https://www.kff.org/coronavirus-covid-19/issue-brief/key-questions-about-covid-19-vaccine-mandates/", "https://www.nationalgeographic.com/science/article/how-full-fda-approval-could-pave-the-way-for-covid-19-vaccine-mandates", "https://sandbox.anh-usa.org/universities-fail-discrimination-test/", "https://jamanetwork.com/journals/jama/fullarticle/2777686", "https://www.msg.com/calendar/madison-square-garden-june-2021-foo-fighters", "https://sandbox.anh-usa.org/double-whammy-for-autoimmune-patients/", "http://aahf.convio.net/site/Advocacy?pagename=homepage&id=3853"], "authors": [], "publish_date": "2021-06-24T14:31:38+00:00"}