{"result_id": "015021", "URL": "https://anh-usa.org/have-the-pediatricians-lost-their-minds/", "timestamp": "2023-04-25 11:57:10 CEST+0200", "meta": {"description": "The American Academy of Pediatrics, whom we have previously criticized for industry ties, now says all boys between the ages of 11 and 12 should receive the HPV vaccine—the same one that has harmed so many girls. Action Alert!", "lang": "en", "keywords": "", "favicon": "https://anh-usa.org/wp-content/uploads/2021/09/ANH-leaf-200-100x100.png", "canonical": "https://anh-usa.org/have-the-pediatricians-lost-their-minds/", "encoding": "UTF-8"}, "image": null, "domain": "anh-usa.org", "title": "Have the Pediatricians Lost Their Minds? - Alliance for Natural Health USA - Protecting Natural Health", "cleaned_text": "The American Academy of Pediatrics, whom we have previously criticized for industry ties, now says all boys between the ages of 11 and 12 should receive the HPV vaccine—the same one that has harmed so many girls. Action Alert!\n\n \n\n During the Republican Party presidential debates, Michelle Bachman questioned the safety of this vaccine and was roundly ridiculed, especially by the media. Commentator after commentator noted that the government said this vaccine was safe. But let’s look at the facts.\n\n No other vaccine lists and thereby acknowledges the serious side effects that the HPV vaccine does. One particularly alarming side effect, acknowledged by the manufacturer Merck even in advertisements, is the risk of seizure. Of the twelve other vaccines recommended by the CDC for children, only two—the controversial MMR combination vaccine and the HiB vaccine—list “seizure” as a safety concern. Pain at the injection site, headache, fever—these are fairly commonplace reactions. But none of the others has the acknowledged serious side effects that the HPV vaccine does. We have created a graphic (click for larger view) showing the side effects side-by-side.\n\nWe are emphasizing these side effects (acknowledged in writing by the manufacturer) because Merck, the Centers for Disease Control, the Institute of Medicine, and the American Academy of Pediatrics all seem determined to stonewall and deny any significance to the 20,096 adverse events and 1,498 “serious adverse events” associated with the vaccine and reported by physicians. We reported on this sorry state of affairs a number of times last year, most recently in October. These adverse events include blood clots, the neurological disorder Guillain-Barre Syndrome, and death.\n\n Our readers will note the irony of this. One reported adverse event for a supplement is enough to get the FDA’s full attention. But when it comes to drug and especially vaccine adverse events, everyone in government looks the other way.\n\n Wouldn’t you think that 34 associated deaths (there were actually 71 deaths reported through September 15 of last year, but 37 of the reports didn’t have enough information for the report to be independently confirmed) would be worth looking into by somebody? But no. The official party line is that the adverse events are not peer-reviewed research and therefore may be ignored. And the government isn’t about to do any peer-reviewed research into this frightening data.\n\n The American Academy of Pediatrics (AAP) now recommends the HPV vaccine for boys aged 11 to 12. This mirrors a recommendation released last October by the CDC’s Advisory Committee on Immunization Practices.\n\n This is truly Alice in Wonderland medicine, and can only be explained by close—indeed, tight—financial ties between vaccine makers, government, and researchers. For more on the financial ties between Big Pharma and the AAP, please see our previous stories on heat exhaustion and sports drinks, and on cholesterol screenings for pre-pubescent children.\n\n To say that the HPV vaccine is of dubious benefit is really an understatement. Although touted as a cancer vaccine, it is still very possible to develop cervical and other cancers even after being vaccinated. As we noted last September, of the 100 different types of HPV, only fifteen might someday develop into cancer, the vaccine targets only two; moreover, the relationship between infection with HPV at a young age and later development of cancer is unknown.\n\n Unlike the HPV vaccine, other cancer prevention strategies are free or low-cost. The standard for cervical cancer screening, regular Pap smears, carries no side effects and when performed regularly can easily catch cervical cancer in time for a simple removal without complication. Women who have been vaccinated against HPV must still submit to regular Pap smears since the vaccine does not protect against all causes of cervical cancer. Most insurance plans cover an annual Pap smear, and programs funded by the National Breast and Cervical Cancer Early Detection Program offer free or low-cost Pap tests to women in need throughout the US.\n\n Another really powerful prevention strategy is to eat cruciferous vegetables or take the supplement DIM (diindolylmethane, a plant compound found in cruciferous vegetables), as explained by Dr. Jonathan Wright in the December 2011 issue of his newsletter Nutrition and Healing. DIM may also be used therapeutically for those with cervical cancer or pre-cancer.\n\n \n\n The most effective combination prevention strategy both for viruses and for cancer (and certainly for cancer-linked viruses) is to maintain optimal levels of vitamin D. Vitamin D comes from the sun for free, and vitamin D3 supplements are inexpensive. Most Americans are deficient in the vitamin.\n\n Virginia is currently the only state requiring that all children be vaccinated with the HPV vaccine, and Virginia legislators have introduced a bill to repeal the HPV vaccine requirement—HB1112.\n\n Please send a message to the American Academy of Pediatrics and the CDC denouncing their recommendations. Point out the major problems with the HPV vaccine—both its dangers and its ineffectiveness—and ask them to withdraw it from recommendation. Please keep in mind that these kinds of messages can also lay the groundwork for congressional or legal action.\n\nIn addition, if you are a Virginia resident, please contact your legislators and support the repeal of the HPV vaccine requirement. Together let’s pass this bill.", "opengraph": {"locale": "en_US", "site_name": "Alliance for Natural Health USA - Protecting Natural Health - ANH Protects Free Speech About Natural Health Modalities, Bioidentical Hormone Replacement Therapy, Homeopathy and Access To Natural Therapies.", "type": "article", "title": "Have the Pediatricians Lost Their Minds? - Alliance for Natural Health USA - Protecting Natural Health", "description": "The American Academy of Pediatrics, whom we have previously criticized for industry ties, now says all boys between the ages of 11 and 12 should receive the HPV vaccine—the same one that has harmed so many girls. Action Alert!", "url": "https://anh-usa.org/have-the-pediatricians-lost-their-minds/", "image": "https://anh-usa.org/wp-content/uploads/2021/09/ANH-logo300.png", "image:secure_url": "https://anh-usa.org/wp-content/uploads/2021/09/ANH-logo300.png", "image:width": "300", "image:height": "88", "article:published_time": "2012-02-07T22:00:34+00:00", "article:modified_time": "2012-02-07T22:00:34+00:00", "article:publisher": "https://www.facebook.com/ANHUSA"}, "tags": ["Latest News"], "tweets": [], "movies": [], "links": ["https://sandbox.anh-usa.org/wp-content/uploads/2012/02/hpv-immunization-300x200.jpg", "http://aahf.convio.net/site/Advocacy?pagename=homepage&id=1045", "https://sandbox.anh-usa.org/wp-content/uploads/2012/02/Screen-shot-2012-02-07-at-3.43.21-PM.png", "../../../../../hpv-vaccine-linked-deaths/", "../../../../../cdc-has-just-recommended-routine-hpv-vaccinations-for-boys/", "../../../../../crony-capitalist-pediatricians/", "../../../../../starting-children-on-drugs/", "../../../../../new-federal-vaccine-plan-and-a-bad-state-bill/", "http://www.medicinenet.com/pap_smear/article.htm", "https://womenshealth.gov/publications/our-publications/fact-sheet/pap-test.cfm#q", "http://www.vitamindcouncil.org/health-conditions/cancer/", "../../../../../about-vitamin-d/", "http://lis.virginia.gov/cgi-bin/legp604.exe?121+ful+HB1112", "http://aahf.convio.net/site/Advocacy?pagename=homepage&id=1045", "https://secure3.convio.net/aahf/site/Advocacy?cmd=display&page=UserAction&id=1048"], "authors": [], "publish_date": "2012-02-07T22:00:34+00:00"}