{"result_id": "015005", "URL": "https://anh-usa.org/annual-covid-shot-moves-forward/", "timestamp": "2023-04-25 11:57:03 CEST+0200", "meta": {"description": "Government health officials are plowing ahead with plans for all Americans to get yearly COVID boosters—but what does the science say? Action Alert! Recently, an FDA advisory committee voted to update the COVID shots Americans receive to include the updated bivalent shot instead of the original formula. This is part of the FDA’s plan to", "lang": "en", "keywords": "", "favicon": "https://anh-usa.org/wp-content/uploads/2021/09/ANH-leaf-200-100x100.png", "canonical": "https://anh-usa.org/annual-covid-shot-moves-forward/", "encoding": "UTF-8"}, "image": null, "domain": "anh-usa.org", "title": "Annual COVID Shot Moves Forward - Alliance for Natural Health USA - Protecting Natural Health", "cleaned_text": "Government health officials are plowing ahead with plans for all Americans to get yearly COVID boosters—but what does the science say? Action Alert!\n\nRecently, an FDA advisory committee voted to update the COVID shots Americans receive to include the updated bivalent shot instead of the original formula. This is part of the FDA’s plan to make COVID shots a yearly occurrence like flu shots, where each year we try to guess which strain will be the most prevalent. This comes just as the CDC admits there are side effects and studies are now showing that booster shots are inhibiting the innate immune response against the virus. There are also big question marks about the efficacy of the new bivalent shots. Despite these and other warning signals, the FDA seems determined to make COVID shots a yearly occurrence. Why? As we’ve been saying for some time, it’s about guaranteeing profits while also making sure the vaccine-makers are shielded from liability.\n\nLike the vaccines recommended by the CDC for routine administration to children, COVID vaccine makers are largely immune from legal liability for the damage they cause to our health, but through a different mechanism. COVID vaccine makers cannot be held liable because they were granted protection under the PREP Act when COVID was declared a public health emergency. But that liability protection expires when there is no longer a public health emergency; President Biden has said that he plans to end the COVID public health emergency on May 11 of this year.\n\nBut if COVID vaccines are recommended by the CDC for routine administration to children, they will be granted the permanent protection from liability afforded to all the other childhood vaccines. The CDC currently recommends that all children over six months of age get COVID vaccines and that all children ages 5 and up get boosters, but these shots have not yet been added to the childhood immunization schedule.\n\nThe FDA is clearly maneuvering COVID vaccines to be added to the childhood immunization schedule. At a recent meeting of its advisors, the agency outlined its plan for annual COVID boosters similar to the approach taken with the seasonal flu—which is one of the vaccines on the childhood schedule. COVID vaccines need to become routine to get full liability protection, which is exactly what the FDA is proposing. It would mean billions in sales for vaccine manufacturers (especially due to the price hikes for the shots being considered) and complete liability protection for when children or adults are harmed by the vaccines. Liability protection for vaccines that are routinely given as part of the CDC’s schedule applies when adults and children receive the vaccines.\n\nThe FDA’s plans are meeting some resistance. The advisory committee meeting last week that approved the updated shots raised doubts about shifting to a yearly regimen. Committee members raised a number of important questions. Unlike the flu, which runs rampant in the winter months, COVID’s ebbs and flows have been harder to predict. COVID springs new variants at a different rate than the flu and they spread less uniformly across the world. Advisory members stressed that it was too early to tell if annual shots would be necessary.\n\nSome data on the newer bivalent shots demonstrates that their efficacy leaves much to be desired. We reported recently that some experts have compared the efficacy of current COVID booster shots to flu shot efficacy, which has ranged from 19 percent to about 52 percent over the last ten years. According to a CDC study from December 2022, the updated boosters protect against symptomatic infection in the range of 40-60 percent. Other research from the CDC has found that the updated COVID boosters were less than 50 percent effective at preventing mild illness compared to people who are unvaccinated.\n\nA new research paper calls attention to important safety issues with COVID vaccines, including the subversion of innate immunity and disruption of intracellular communication. The CDC has also said that a “safety signal” has been identified linking the bivalent shots with an increased risk of ischemic stroke in people 65 and older.\n\nTo recap: experts have significant doubts as to whether COVID behaves like the flu; the bivalent shots have shaky, at best, efficacy, and have been linked with some troubling health concerns. With all of this, the FDA thinks annual shots are a good idea because…?\n\nTo us it seems clear that this has more to do with protecting vaccine makers’ profits than with public health. It is crony medicine at its finest: special interests using the power and clout of the federal government to guarantee massive vaccine sales, all while being shielded from the responsibility of paying for the damage their products cause.\n\nAction Alert! Write to Congress and the FDA telling them to reject annual COVID shots. Please send your message immediately.", "opengraph": {"locale": "en_US", "site_name": "Alliance for Natural Health USA - Protecting Natural Health - ANH Protects Free Speech About Natural Health Modalities, Bioidentical Hormone Replacement Therapy, Homeopathy and Access To Natural Therapies.", "type": "article", "title": "Annual COVID Shot Moves Forward - Alliance for Natural Health USA - Protecting Natural Health", "description": "Government health officials are plowing ahead with plans for all Americans to get yearly COVID boosters—but what does the science say? Action Alert! Recently, an FDA advisory committee voted to update the COVID shots Americans receive to include the updated bivalent shot instead of the original formula. This is part of the FDA’s plan to", "url": "https://anh-usa.org/annual-covid-shot-moves-forward/", "image": "https://anh-usa.org/wp-content/uploads/2021/09/ANH-logo300.png", "image:secure_url": "https://anh-usa.org/wp-content/uploads/2021/09/ANH-logo300.png", "image:width": "300", "image:height": "88", "article:published_time": "2023-02-02T16:26:48+00:00", "article:modified_time": "2023-02-10T14:40:34+00:00", "article:publisher": "https://www.facebook.com/ANHUSA"}, "tags": ["Latest News"], "tweets": [], "movies": [], "links": ["https://www.votervoice.net/ANHUSA/Campaigns/96138/Respond", "https://www.politico.com/news/2023/01/26/fda-advisers-annual-covid-immunizations-00079749", "https://www.foxnews.com/health/cdc-identifies-possible-safety-concern-certain-people-receiving-covid-vaccines", "https://anh-usa.org/annual-covid-vax-for-kids/", "https://www.phe.gov/Preparedness/legal/prepact/Pages/10th-Amendment.aspx", "https://www.statnews.com/2023/01/30/president-biden-to-end-covid-19-emergencies-on-may-11/?utm_campaign=morning_rounds&utm_medium=email&_hsmi=243843876&_hsenc=p2ANqtz-_PBfS-ivGkjIxIhwmrfswJTPqta0JeYV6Y_mxe6Qx1PlImywjwEddiDAtwkk4vVZOqiL_vz3m18a0z8hGPnWCO8zxzfA&utm_content=243843876&utm_source=hs_email", "https://www.hrsa.gov/vaccine-compensation/covered-vaccines#:~:text=For%20a%20vaccine%20to%20be,excise%20tax%20by%20federal%20law.", "https://www.cdc.gov/vaccines/covid-19/planning/children.html#:~:text=CDC%20recommends%20COVID%2D19%20vaccines,Pfizer%2DBioNTech%20COVID%2D19%20vaccines", "https://www.cdc.gov/vaccines/schedules/hcp/imz/child-adolescent.html#vaccines-schedule", "https://www.nytimes.com/2023/01/23/health/covid-boosters-fda.html", "https://anh-usa.org/you-paid-for-covid-vax-megaprofits/", "https://www.hrsa.gov/vaccine-compensation", "https://www.nature.com/articles/d41586-023-00234-7", "https://www.nbcnews.com/health/health-news/fda-advisers-raise-doubts-moving-yearly-covid-boosters-rcna67491", "https://www.cnn.com/2022/11/22/health/vaccine-effectiveness-bivalent-boosters-cdc/index.html", "https://www.cdc.gov/flu/vaccines-work/effectiveness-studies.htm", "https://www.cdc.gov/mmwr/volumes/71/wr/mm7148e1.htm?s_cid=mm7148e1_w", "https://www.cdc.gov/mmwr/volumes/71/wr/mm7148e1.htm?s_cid=mm7148e1_w#T2_down", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9012513/", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/bivalent-boosters.html"], "authors": [], "publish_date": "2023-02-02T16:26:48+00:00"}