{"result_id": "015019", "URL": "https://anh-usa.org/new-study-reveals-just-how-badly-vaccine-mandates-failed/", "timestamp": "2023-04-25 11:57:09 CEST+0200", "meta": {"description": "New data on natural immunity and the safety of COVID vaccines cast doubt on the wisdom of mass vaccination campaigns. Action Alert! The public health response to the COVID pandemic, particularly at the outset, boiled down to: stay at home, wash your hands, and wait for the vaccines. Once the vaccines were sped through emergency", "lang": "en", "keywords": "", "favicon": "https://anh-usa.org/wp-content/uploads/2021/09/ANH-leaf-200-100x100.png", "canonical": "https://anh-usa.org/new-study-reveals-just-how-badly-vaccine-mandates-failed/", "encoding": "UTF-8"}, "image": null, "domain": "anh-usa.org", "title": "New Study Reveals Just How Badly Vaccine Mandates Failed - Alliance for Natural Health USA - Protecting Natural Health", "cleaned_text": "New data on natural immunity and the safety of COVID vaccines cast doubt on the wisdom of mass vaccination campaigns. Action Alert!\n\nThe public health response to the COVID pandemic, particularly at the outset, boiled down to: stay at home, wash your hands, and wait for the vaccines. Once the vaccines were sped through emergency approval, vaccine passports and mandates soon followed suit. If you didn’t get the vaccine, you were being selfish—so went the conventional wisdom. We were constantly told by public health representatives that we should all get vaccinated because the COVID shots were safe and effective at preventing infection, transmission, and death. Yet the data that has accumulated to date does not support these bold conclusions. Still, many Americans have been coerced into receiving these shots. We must follow the science and support Americans’ right to choose the medical procedures they receive. Help us support an important bill that dismantles vaccine mandates for many foreign travelers entering the US.\n\nAn important part of this story is the evolving nature of the virus, and the inability of vaccines to keep up. Early promises that the COVID shots reduced infection and transmission were shown to be overblown.\n\nFurther, some experts have compared the efficacy of the updated COVID bivalent shots to flu shot efficacy, which has ranged from 19 percent to about 52 percent over the last ten years. According to a CDC study from December 2022, the updated boosters protect against symptomatic infection in the range of 40-60 percent. Other research from the CDC has found that the updated COVID boosters were less than 50 percent effective at preventing mild illness compared to people who are unvaccinated. Is it wise, or even ethical, to compel Americans to receive shots with such shaky effectiveness?\n\nA study looked at the relationship between the percentage of the population fully vaccinated and new COVID-19 cases across 68 countries, including the US. The authors found “no discernable relationship between percentage of population fully vaccinated and new COVID-19 cases.” There was one “marginally positive” association: countries with higher percentages of fully vaccinated individuals had a higher number of COVID-19 cases.\n\nThe most recent data show that the immunity generated from a previous infection with COVID is at least as protective, if not more protective, than two doses of a COVID vaccine. About half of US adults have already been infected with COVID. Again, we ask the question: is it right to compel Americans with previous infection to risk the dangers of vaccination (see below) when their previous infection gives them just as much if not better protection than the shots?\n\nThe point is that the performance of the vaccine against an evolving virus must be weighed against the risks of receiving the shot, and that our right to make this choice should not be restricted by mandates or public pressure.\n\nAnd make no mistake, the risks of COVID vaccination can be serious. In May of 2021, we launched a campaign with our colleagues at ANH-International calling attention to data showing that autoimmune patients were at an increased risk for adverse events following COVID vaccination. The most recent data from the CDC’s Vaccine Adverse Event Reporting System contain 13,875 reports of death, along with 938,176 other adverse events. Several safety signals have emerged since the vaccine rollout, including an increased risk of myocarditis (an inflammatory condition of the heart) for adolescents and young men. The CDC has also said recently that a “safety signal” has been identified linking the bivalent shots with an increased risk of ischemic stroke in people 65 and older. Other safety issues include strokes and neurological problems. No vaccine in modern history has come with such a host of side effects.\n\nThere’s even data to show that mandates do not achieve their intended purposes. Some of the largest US cities—New York City, San Francisco, Los Angeles, Seattle, Philadelphia, and Boston—implemented COVID vaccine mandates with the goal of increasing vaccine uptake and thus reducing COVID cases and deaths. These were among the most restrictive and polarizing policies ever enacted in the US, preventing millions of people from entering restaurants, bars, gyms, theaters, or arenas without proof of vaccination. Researchers at George Mason University used a statistical analysis to assess the success of vaccine mandates to increase vaccine uptake and reduce COVID cases and deaths. Their findings:\n\n“We find that indoor vaccine mandates had no significant impact on COVID-19 vaccine uptake, cases, or deaths across all nine cities that implemented the policy.”\n\nThis is quite an indictment of these policies given the level of economic harm they inflicted on cities. The paper cites several statistics from New York City that demonstrate this impact. New York City fired 1,430 city workers for failing to comply with the vaccine mandate; over 90 percent of restaurants in the city reported having customer-related challenges, like losing customers who objected to the mandate; 75 percent of restaurants reported having staffing challenges stemming from the mandate; the city’s mandate also reduced the healthcare workforce by 3 percent, or 34,000 workers. Nationwide, 5 percent of unvaccinated adults reported leaving a job due to a vaccine mandate.\n\nMandate proponents tried to argue at the time that these costs were outweighed by the public health benefits of a mandate in the form of reduced infections and deaths from COVID. It appears that these benefits were imaginary.\n\nThis all emphasizes why we need to be able to make medical decisions for ourselves and our families, not have state or city governments make these decisions for us. Senator Mike Lee (R-UT) is taking a significant step in dismantling ineffective and coercive vaccine mandates by introducing the Fair Removal of Existing and Enforced Bans on Immunization Relating to Destination (FREEBIRD) Act to end the COVID-19 vaccine mandate placed on international air visitors to the United States. Foreign travelers, including family members, friends, and business relations, are being kept off U.S. soil due to the air travel vaccine mandate, which remains for nonimmigrant, noncitizen foreign travelers. The United States is one of the only countries that still impose this mandate. It’s time for this and other vaccine mandates to disappear.\n\nAction Alert! Write to Congress in support of the FREEBIRD Act. Please send your message immediately.", "opengraph": {"locale": "en_US", "site_name": "Alliance for Natural Health USA - Protecting Natural Health - ANH Protects Free Speech About Natural Health Modalities, Bioidentical Hormone Replacement Therapy, Homeopathy and Access To Natural Therapies.", "type": "article", "title": "New Study Reveals Just How Badly Vaccine Mandates Failed - Alliance for Natural Health USA - Protecting Natural Health", "description": "New data on natural immunity and the safety of COVID vaccines cast doubt on the wisdom of mass vaccination campaigns. Action Alert! The public health response to the COVID pandemic, particularly at the outset, boiled down to: stay at home, wash your hands, and wait for the vaccines. Once the vaccines were sped through emergency", "url": "https://anh-usa.org/new-study-reveals-just-how-badly-vaccine-mandates-failed/", "image": "https://anh-usa.org/wp-content/uploads/2021/09/ANH-logo300.png", "image:secure_url": "https://anh-usa.org/wp-content/uploads/2021/09/ANH-logo300.png", "image:width": "300", "image:height": "88", "article:published_time": "2023-03-07T16:04:08+00:00", "article:modified_time": "2023-03-07T19:03:28+00:00", "article:publisher": "https://www.facebook.com/ANHUSA"}, "tags": ["Latest News"], "tweets": [], "movies": [], "links": ["https://www.votervoice.net/ANHUSA/Campaigns/102161/Respond", "https://pubs.acs.org/doi/10.1021/acsinfecdis.1c00557", "https://www.scientificamerican.com/article/the-risk-of-vaccinated-covid-transmission-is-not-low/", "https://www.cnn.com/2022/11/22/health/vaccine-effectiveness-bivalent-boosters-cdc/index.html", "https://www.cdc.gov/flu/vaccines-work/effectiveness-studies.htm", "https://www.cdc.gov/mmwr/volumes/71/wr/mm7148e1.htm?s_cid=mm7148e1_w", "https://www.cdc.gov/mmwr/volumes/71/wr/mm7148e1.htm?s_cid=mm7148e1_w#T2_down", "https://link.springer.com/article/10.1007/s10654-021-00808-7", "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(22)02465-5/fulltext", "https://www.hks.harvard.edu/faculty-research/policy-topics/health/half-us-population-has-had-covid-many-cases-are-going#:~:text=About%20half%20of%20American%20adults%20surveyed%20say%20they%20have%20been,positive%20for%20COVID%2D19%20before.", "https://anh-usa.org/will-you-be-a-second-class-citizen/", "https://cdc.gov/coronavirus/2019-ncov/vaccines/safety/myocarditis.html#:~:text=When%20reported%2C%20the%20cases%20have,Pfizer-BioNTech%20or%20Moderna).&text=Most%20patients%20with%20myocarditis%20or,rest%20and%20felt%20better%20quickly.", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/bivalent-boosters.html", "https://drhoffman.com/article/what-they-got-wrong-about-covid/", "https://www.mercatus.org/research/working-papers/indoor-vaccine-mandates-and-covid-19", "https://www.lohud.com/story/news/coronavirus/2021/10/14/how-many-health-workers-lost-jobs-due-ny-vaccine-mandate/8449413002/", "https://www.cnbc.com/2021/10/28/covid-vaccine-some-5percent-of-unvaccinated-adults-have-quit-their-jobs-over-a-mandate-survey-shows.html", "https://www.lee.senate.gov/2023/3/lee-bill-makes-travelers-free-as-a-bird"], "authors": [], "publish_date": "2023-03-07T16:04:08+00:00"}