{"result_id": "015029", "URL": "https://anh-usa.org/new-bill-to-update-vaccine-court/", "timestamp": "2023-04-25 11:57:13 CEST+0200", "meta": {"description": "A new bill would reform the Vaccine Injury Compensation Program (VICP), but falls far short of fixing this broken program. The bill includes many important reforms, like increasing the cap on compensations and extending the statute of limitations on injuries from three to five years, among other things we will detail below. But there is", "lang": "en", "keywords": "", "favicon": "https://anh-usa.org/wp-content/uploads/2021/09/ANH-leaf-200-100x100.png", "canonical": "https://anh-usa.org/new-bill-to-update-vaccine-court/", "encoding": "UTF-8"}, "image": null, "domain": "anh-usa.org", "title": "New Bill to Update Vaccine Court - Alliance for Natural Health USA - Protecting Natural Health", "cleaned_text": "A new bill would reform the Vaccine Injury Compensation Program (VICP), but falls far short of fixing this broken program.\n\nThe bill includes many important reforms, like increasing the cap on compensations and extending the statute of limitations on injuries from three to five years, among other things we will detail below. But there is no escaping that VICP is a fundamentally broken system that leaves many vaccine-injured families in the lurch. We must push for more robust reforms to VICP so real justice can be served to families who need it.\n\nVICP was created by Congress in 1986 to create a no-fault compensation system for children injured by vaccines. Lawsuits against vaccine makers were dramatically increasing in number after a spate of injuries related to the DTP vaccine. Vaccine manufacturers wanted to be shielded from liability, and the government wanted to create the infrastructure for a national immunization program.\n\nVICP accomplished these goals by setting up a separate adjudication process for the vaccine injured. Rather than hold vaccine manufacturers accountable for the damage caused by their products, those injured by vaccines would take their case to the vaccine court, presided over by eight “Special Masters,” experts (supposedly) who would work exclusively on vaccine cases. Successful cases would be compensated from a fund created by a 75-cent tax on all vaccines sold. A Vaccine Injury Table was created to help simplify determinations of causation. The Table lists all covered vaccines, as well as the injuries widely recognized as caused by each vaccine, alongside a specific timeframe for each injury’s onset. If a claimant could show that their injury matched with the criteria on the Table (an “on-Table” injury), compensation would be automatic; otherwise, claimants would need to litigate through the court.\n\nPetitioners to the court may receive a maximum of $250,000 for a vaccine-related death and $250,000 for pain and suffering—amounts that have not changed since 1986. The law also requires that claims be filed no later than three years after the injury.\n\nVICP has been plagued with issues from the very beginning. Aspects of the program meant to increase speed, efficiency, predictability, and fairness have failed miserably, as detailed by a 2015 analysis. On average, only a quarter of claims are compensated, and not in a timely manner. Decisions from Special Masters were supposed to be delivered within 240 days, as stipulated by Congress. Less than 5 percent of petitions satisfy this statutory deadline, with most exceeding it by a wide margin—39 percent took between two and five years, and 19 percent took five years or more. Even if a petition is successful, it can take years for VICP to determine the amount that will be awarded. In the meantime, families struggle to deal with increasing medical bills for their injured children.\n\nThe new bill seeks to address these abysmal time lags by increasing the number of Special Masters from eight to ten. It also increases the maximum award from $250,000 to $600,000 for both death and pain and suffering—an improvement, but hardly just compensation. It increases the statute of limitations for filing cases from three to five years; it also adds adults and pregnant women to the Vaccine Injury Table (currently it only includes children) and requires the table be updated by the CDC within six months when a new vaccine is added, rather than two years.\n\nThese are welcome improvements but fall far short of making the VICP a just system for the vaccine injured. The Vaccine Injury Table, for example, is in dire need of reform. The 1986 law gave federal health authorities discretionary power to update the table—power which has been used not to expand the list of injuries eligible for compensation, but to restrict it. The most glaring example came in 1995 when federal authorities eliminated residual seizure disorder related to DTP vaccines from the table and narrowed the definition of encephalopathy from a broad, inclusive definition to a technical, narrow definition that is extremely difficult, if not impossible, to satisfy. Nine vaccines have been added to the Table since 1986, but only one new injury: anaphylaxis within four hours of receiving the Hepatitis B vaccine.\n\nThese changes have made compensation through VICP even more of an uphill battle: between 1989 and 1992, more than 90 percent of petitions asserted on-table injuries; in recent years, 90 percent of petitions assert non-table injuries requiring extensive, lengthy, often-unsuccessful litigation.\n\nThe table should be updated more frequently with public participation. Residual seizure disorder should be added back to the table, along with a broader definition of encephalopathy. The law should include a presumption that death within 72 hours of receipt of a vaccine may be causally related to vaccination unless an obvious, alternate cause of death exists.\n\nFurther, the addition of future vaccines to the table should be prohibited until further independent research is done to elucidate vaccine-related adverse events. Independent research is critical: the same federal agency that is responsible for developing, licensing, and promoting the use of vaccines cannot be expected to be an impartial investigator of vaccine risks. The National Academies of Science, Engineering, and Medicine (then known as the Institute of Medicine), has acknowledged the lack of data on vaccine-related adverse events: “The lack of adequate data regarding many of the [vaccine-related] adverse events under study was of major concern to the committee.”\n\nOthers have pointed out that the VICP should adopt a more relaxed standard of proof for petitioners; currently petitioners must prove that a vaccine “more likely than not” caused an injury. Any reasonable doubt should favor petitioners, not the government.\n\nThe new bill is a decent first step, but further reforms like those outlined above must be implemented to further fix VICP so it can accomplish its mission, stated by Senator Paula Hawkins at the time of the Act’s passing in 1986, of dispensing “simple justice quickly” to vaccine-injured individuals.\n\nAction Alert! Write to Congress in support of HR 3655, but urge further reforms to fix this broken vaccine court system. Please send your message immediately.", "opengraph": {"locale": "en_US", "site_name": "Alliance for Natural Health USA - Protecting Natural Health - ANH Protects Free Speech About Natural Health Modalities, Bioidentical Hormone Replacement Therapy, Homeopathy and Access To Natural Therapies.", "type": "article", "title": "New Bill to Update Vaccine Court - Alliance for Natural Health USA - Protecting Natural Health", "description": "A new bill would reform the Vaccine Injury Compensation Program (VICP), but falls far short of fixing this broken program. The bill includes many important reforms, like increasing the cap on compensations and extending the statute of limitations on injuries from three to five years, among other things we will detail below. But there is", "url": "https://anh-usa.org/new-bill-to-update-vaccine-court/", "image": "https://anh-usa.org/wp-content/uploads/2021/09/ANH-logo300.png", "image:secure_url": "https://anh-usa.org/wp-content/uploads/2021/09/ANH-logo300.png", "image:width": "300", "image:height": "88", "article:published_time": "2021-07-07T15:50:41+00:00", "article:modified_time": "2021-11-30T16:34:27+00:00", "article:publisher": "https://www.facebook.com/ANHUSA"}, "tags": ["Latest News"], "tweets": [], "movies": [], "links": ["https://energycommerce.house.gov/sites/democrats.energycommerce.house.gov/files/documents/BILLS-117hr3655ih.pdf", "https://digitalcommons.pace.edu/cgi/viewcontent.cgi?referer=&httpsredir=1&article=1681&context=pelr", "https://www.hrsa.gov/sites/default/files/vaccinecompensation/vaccineinjurytable.pdf", "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2623756", "https://www.nvic.org/barbaraspeaksout/failedexperiment/congressionaltestimony.aspx", "http://www.administrativelawreview.org/wp-content/uploads/2014/04/Fixing-the-Flaws-in-the-Federal-Vaccine-Injury-Compensation-Program.pdf", "https://www.ncbi.nlm.nih.gov/books/NBK236287/", "http://www.administrativelawreview.org/wp-content/uploads/2014/04/Fixing-the-Flaws-in-the-Federal-Vaccine-Injury-Compensation-Program.pdf", "https://www.law.gwu.edu/sites/g/files/zaxdzs2351/f/downloads/Bruesewitz%20Amicus%20Brief.pdf"], "authors": [], "publish_date": "2021-07-07T15:50:41+00:00"}