{"result_id": "015004", "URL": "https://anh-usa.org/are-unvaccinated-children-healthier/", "timestamp": "2023-04-25 11:57:02 CEST+0200", "meta": {"description": "A re-examination of an unfairly retracted study casts doubt on the official narrative that vaccines are safe and effective for all children. We’ve all heard the mantras recited faithfully by government health bureaucrats, the agencies they work for, and the medical associations tied into the conventional medical system: vaccines are safe and effective, and there", "lang": "en", "keywords": "", "favicon": "https://anh-usa.org/wp-content/uploads/2021/09/ANH-leaf-200-100x100.png", "canonical": "https://anh-usa.org/are-unvaccinated-children-healthier/", "encoding": "UTF-8"}, "image": null, "domain": "anh-usa.org", "title": "Are Unvaccinated Children Healthier? - Alliance for Natural Health USA - Protecting Natural Health", "cleaned_text": "A re-examination of an unfairly retracted study casts doubt on the official narrative that vaccines are safe and effective for all children.\n\nWe’ve all heard the mantras recited faithfully by government health bureaucrats, the agencies they work for, and the medical associations tied into the conventional medical system: vaccines are safe and effective, and there is no evidence that they cause adverse effects in significant numbers. Because these messages are coming from people in positions of authority, many in the public believe that such assertions are backed by credible science. Or are they? A recent study examines data on the need for doctors’ visits for unvaccinated versus vaccinated children. They found that vaccination increased the need for visits to the doctor for vaccine-related health outcomes, meaning vaccinated children suffer from far more chronic illness than those who are unvaccinated.\n\nBefore we say more about the study, it is necessary to explain its origins because that story speaks to the difficulty in pinning down the truth about vaccine safety. The original data set was published in a peer-reviewed journal in 2020. This was ten years’ worth of data from the pediatric practice of Dr. Paul Thomas, an Oregon physician. The study found that unvaccinated children had fewer doctors’ visits and diagnoses of chronic disease than vaccinated children, suggesting that unvaccinated children have fewer health problems than those who are vaccinated.\n\nFive days after the study was published, Dr. Thomas’ license was suspended. A month later, the study was retracted, reportedly because an anonymous reader expressed concerns about the study, arguing that the reason unvaccinated children appeared to have fewer visits was probably because parents of unvaccinated children weren’t showing up to well visits, so there was no opportunity for a diagnosis, thus skewing the results. This wasn’t based on data; it was an unsubstantiated opinion. It was, apparently, enough for the journal to retract the study, though.\n\nThis type of capitulation shouldn’t shock us. Medical journals rely on compensation from pro-vaccine government agencies and (often pharmaceutical) advertisers for financial support. As such, there is tremendous pressure either not to publish studies questioning vaccine safety in the first place, or to retract them at the first sign of pushback. Look at what happened to Dr. Andrew Wakefield for merely suggesting more study of the possible link between the MMR vaccine and autism.\n\nIt takes no small amount of bravery even to study the subject of vaccine safety, a subject for which there is frighteningly scant research for the obvious reasons—that is, journals won’t publish it, and as a researcher or physician you’re putting your reputation and medical license in jeopardy. Government regulators, when dealing with natural medicine, insist on the “gold-standard” of research, the placebo-controlled, randomized clinical trial (RCT). Yet long-term RCTs on vaccine safety haven’t been done due to the perceived unethical nature of conducting a trial in which some children do not receive the claimed benefits of vaccination. In fact, as the Institute of Medicine (now known as the National Academies of Sciences, Engineering, and Medicine) acknowledged in a 2013 review, “No studies have compared the differences in health outcomes … between entirely unimmunized populations of children and fully immunized children.”\n\nAs the new study’s authors point out, even the studies held up by government health authorities as proof positive of vaccine safety do not universally support that narrative:\n\nThe accuracy of claims published on the CDC website, such as “Vaccines Do Not Cause Autism”, are impossible to assess because the question of association has not been addressed for most of the pediatric vaccines in the CDC schedule, nor have the interactions between them been systematically addressed. Likewise, most such studies base their conclusions on a “lack of a mechanism” to explain such a link.\n\nHence, there is a pressing need for brave researchers to ask important questions about vaccine safety. Which brings us to the new study. Authors James Lyons-Weiler, Ph.D., and Dr. Russell Blaylock looked at the original data to see if the anonymous reader’s assertion was correct, that unvaccinated children only appeared healthier because they simply did not go visit the doctor.\n\nTheir results demonstrated the opposite: unvaccinated pediatric patients kept their health check visits with higher regularity and frequency than vaccinated patients. Further, the analysis confirmed the original study’s findings that vaccinated pediatric patients have a higher disease burden.\n\nWe at ANH have always been clear about our position on vaccines. We are not anti-vaccine. We support everybody’s right to choose what is best for themselves and/or their families. We should be able to ask questions and let the science guide us. When those answers are inconvenient, that is even more reason for them to be published and discussed, not censored.", "opengraph": {"locale": "en_US", "site_name": "Alliance for Natural Health USA - Protecting Natural Health - ANH Protects Free Speech About Natural Health Modalities, Bioidentical Hormone Replacement Therapy, Homeopathy and Access To Natural Therapies.", "type": "article", "title": "Are Unvaccinated Children Healthier? - Alliance for Natural Health USA - Protecting Natural Health", "description": "A re-examination of an unfairly retracted study casts doubt on the official narrative that vaccines are safe and effective for all children. We’ve all heard the mantras recited faithfully by government health bureaucrats, the agencies they work for, and the medical associations tied into the conventional medical system: vaccines are safe and effective, and there", "url": "https://anh-usa.org/are-unvaccinated-children-healthier/", "image": "https://anh-usa.org/wp-content/uploads/2021/09/ANH-logo300.png", "image:secure_url": "https://anh-usa.org/wp-content/uploads/2021/09/ANH-logo300.png", "image:width": "300", "image:height": "88", "article:published_time": "2022-10-18T16:20:11+00:00", "article:modified_time": "2022-10-19T16:04:10+00:00", "article:publisher": "https://www.facebook.com/ANHUSA"}, "tags": ["Latest News"], "tweets": [], "movies": [], "links": ["https://ijvtpr.com/index.php/IJVTPR/article/view/59/91", "https://www.mdpi.com/1660-4601/17/22/8674", "https://childrenshealthdefense.org/defender/state-medical-board-shut-down-dr-paul-thomas-pediatrician/", "https://anh-usa.org/deborah-rays-blog-a-medical-mavericks-fate/", "https://doi.org/10.17226/13563", "https://doi.org/10.17226/13563"], "authors": [], "publish_date": "2022-10-18T16:20:11+00:00"}