{"result_id": "015035", "URL": "https://anh-usa.org/vax-mandates-for-air-travel-appear-imminent/", "timestamp": "2023-04-25 11:57:15 CEST+0200", "meta": {"description": "Federal legislation and executive action could institute vaccine mandates for air travel. Two federal bills would mandate vaccination for air travel in the United States. One bill includes an option to provide a negative COVID test, but this provision could be removed by the time the bill becomes law. Separately, the Biden administration has said", "lang": "en", "keywords": "", "favicon": "https://anh-usa.org/wp-content/uploads/2021/09/ANH-leaf-200-100x100.png", "canonical": "https://anh-usa.org/vax-mandates-for-air-travel-appear-imminent/", "encoding": "UTF-8"}, "image": null, "domain": "anh-usa.org", "title": "Vax Mandates for Air Travel Appear Imminent - Alliance for Natural Health USA - Protecting Natural Health", "cleaned_text": "Federal legislation and executive action could institute vaccine mandates for air travel.\n\nTwo federal bills would mandate vaccination for air travel in the United States. One bill includes an option to provide a negative COVID test, but this provision could be removed by the time the bill becomes law. Separately, the Biden administration has said that they are not ruling out the possibility of issuing an order mandating COVID vaccination as a condition for air travel. Given the massive mandate for two-thirds of the American workforce recently issued by the Biden administration, another mandate for air travel seems likely. We must voice our opposition to these mandates.\n\nThere have been efforts in Congress to head off vaccination mandates for air travel that have so far been unsuccessful. Among dozens of amendments proposed to a transportation spending bill, one sought to block the money from being spent if COVID-19 vaccine requirements became a condition of entering federal buildings; another amendment extended this to vaccine requirements for flights. Both were rejected. They could be added to later bills, but it is good to see some in Congress standing for freedom of choice.\n\nBut as we saw with the recent vaccine mandates for the American workforce, the most likely scenario for air travel mandates seems to be executive action from the Biden administration. In an interview, Dr. Anthony Fauci, Director of the National Institute of Allergy and Infectious Diseases and the Chief Medical Advisor to the President, said he would support such a mandate. Former President Obama’s Transportation Secretary also said the Biden administration should issue a vaccine requirement for air travel.\n\nSome airlines have mandated that employees be vaccinated, but only the Australian airline Qantas has said that it will require passengers to be vaccinated for international flights. The airline industry has voiced opposition to a vaccine requirement for passengers, saying that it would be “logistically impractical” and would “bottleneck the domestic travel system.”\n\nWhat exemptions would apply in the event of an air travel vaccine mandate? As we described previously, the Americans with Disabilities Act (ADA) and the Civil Rights Act prohibit employers, but also businesses serving the public, from discriminating against someone with a disability or based on their religion, race, and sex. Note, though, that those who qualify for these exemptions would not necessarily be granted the right to walk on any flight they choose; they should be entitled to “reasonable accommodation,” unless doing so would pose “undue hardship” on the business. For instance, a grocery store may prohibit unvaccinated patrons from entering the store but provide curbside pickup to those who qualify for exemptions under the ADA or the Civil Rights Act. What “reasonable accommodation” for air travel would mean is unclear; airlines could argue that accommodating unvaccinated passengers, for example with dedicated flights for the unvaccinated, would be an “undue hardship,” so they would be banned. Employees who are subject to the mandates announced last week who qualify for exemptions are also entitled to reasonable accommodation of their disability or religious belief.\n\nThe medical exemption provided by the ADA is quite limited, as we explained previously. We also recently covered religious exemptions to mandates provided by the Civil Rights Act. Additional protections are guaranteed by the Religious Freedom Restoration Act of 1993, which prohibits the federal government from substantially burdening a person’s exercise of religion except in limited circumstances. Once an individual establishes that a law caused a substantial burden, the government would need to show that the burden imposed furthers a “compelling governmental interest” and is “the least restrictive means” of furthering that interest. It could be argued that a vaccine mandate is not the “least restrictive means” of containing the spread of COVID in these cases.\n\nSome numbers may help provide perspective on the effectiveness of the COVID vaccines. We often hear the stat that the COVID vaccines are 95 percent effective. This means that, in the conditions of a clinical trial, when a vaccinated person was exposed to the virus, their likelihood of developing serious COVID disease and hospitalization was 95 percent less than that of an unvaccinated person. But this doesn’t communicate the overall (“absolute,” in statistical terms) reduction in risk of serious COVID illness from taking one of the vaccines, which is about 1 percent. The vaccines, in other words, worked well to prevent serious COVID disease in the clinical trials, but at the same time the overall risk of developing serious COVID disease was only one percent. (See here and here for more explanation).\n\nThe mandates imposed by the Biden administration, and any future mandates for air travel, also irrationally exclude the natural immunity that is conferred by having contracted COVID. Some studies suggest that this immunity is actually stronger and longer lasting than that which is conferred by the vaccines. The only possible explanation for excluding natural immunity is that nobody makes money from it.\n\nANH has been, and remains, firmly opposed to vaccine mandates. We are not anti-vaccine. We believe each individual has the right to make decisions about the medical procedures they receive. All medical procedures come with risks and benefits, and the COVID vaccine is no exception. To us, it is unreasonable to force individuals, particularly those who are at increased risk—like autoimmune patients—to undergo a procedure that could do them harm.\n\nContaining the spread of the virus is undoubtedly an admirable goal, but a better balance must be struck between adopting measures to contain the virus’ spread and the preservation of personal autonomy—especially given that the overall risk reduction from the vaccines is 1 percent.\n\nAction Alert! Write to Congress and President Biden, opposing federal bills that mandate vaccines for air travel and against any future mandates for flights. Please send your message immediately.", "opengraph": {"locale": "en_US", "site_name": "Alliance for Natural Health USA - Protecting Natural Health - ANH Protects Free Speech About Natural Health Modalities, Bioidentical Hormone Replacement Therapy, Homeopathy and Access To Natural Therapies.", "type": "article", "title": "Vax Mandates for Air Travel Appear Imminent - Alliance for Natural Health USA - Protecting Natural Health", "description": "Federal legislation and executive action could institute vaccine mandates for air travel. Two federal bills would mandate vaccination for air travel in the United States. One bill includes an option to provide a negative COVID test, but this provision could be removed by the time the bill becomes law. Separately, the Biden administration has said", "url": "https://anh-usa.org/vax-mandates-for-air-travel-appear-imminent/", "image": "https://anh-usa.org/wp-content/uploads/2021/09/ANH-logo300.png", "image:secure_url": "https://anh-usa.org/wp-content/uploads/2021/09/ANH-logo300.png", "image:width": "300", "image:height": "88", "article:published_time": "2021-09-23T12:51:55+00:00", "article:modified_time": "2021-10-19T19:02:19+00:00", "article:publisher": "https://www.facebook.com/ANHUSA"}, "tags": ["Latest News"], "tweets": [], "movies": [], "links": ["https://www.congress.gov/bill/117th-congress/house-bill/4980", "https://www.congress.gov/bill/117th-congress/house-bill/5204?q=%7B%22search%22%3A%5B%22H.+R.+5204+2021%22%5D%7D&s=1&r=1", "https://www.washingtonpost.com/travel/2021/09/13/fauci-vaccine-mandate-air-travel/", "https://twitter.com/RepThomasMassie/status/1437841205258293264/photo/1", "https://anh-usa.org/biden-issues-sweeping-vaccine-mandate-for-u-s-workers/", "https://thehill.com/policy/healthcare/571902-fauci-says-he-would-support-vaccine-requirements-for-air-travel", "https://www.politico.com/news/2021/09/15/biden-mandate-vaccine-airline-travel-511976", "https://www.forbes.com/sites/roberthart/2021/08/18/australias-flagship-airline-qantas-mandates-covid-vaccines-for-workers-joining-united-major-us-firms/?sh=51f6bbcf52db", "https://www.cnn.com/travel/article/qantas-coronavirus-vaccination-intl-hnk-scli/index.html", "https://www.washingtonpost.com/travel/2021/09/13/fauci-vaccine-mandate-air-travel/", "https://www.nextinsurance.com/blog/right-to-refuse-service-to-rude-customers/", "https://uscode.house.gov/view.xhtml?hl=false&edition=prelim&req=granuleid%3AUSC-prelim-title42-section12102&f=treesort&num=0&saved=%7CKHRpdGxlOjQyIHNlY3Rpb246MTIxMDEgZWRpdGlvbjpwcmVsaW0pIE9SIChncmFudWxlaWQ6VVNDLXByZWxpbS10aXRsZTQyLXNlY3Rpb24xMjEwMSk%3D%7CdHJlZXNvcnQ%3D%7C%7C0%7Cfalse%7Cprelim", "https://crsreports.congress.gov/product/pdf/LSB/LSB10573", "https://www.thelancet.com/journals/lanmic/article/PIIS2666-5247(21)00069-0/fulltext", "https://www.wired.com/story/the-statistical-secrets-of-covid-19-vaccines/", "https://www.wusa9.com/article/news/verify/absolute-risk-reduction-formula-covid19-vaccine-versus-relative-risk-reduction-formula/65-e3b7a521-f2f6-46b9-a3cb-450765b49863", "https://www.medrxiv.org/content/10.1101/2021.08.24.21262415v1"], "authors": [], "publish_date": "2021-09-23T12:51:55+00:00"}