{"result_id": "015036", "URL": "https://anh-usa.org/you-paid-for-covid-vax-megaprofits/", "timestamp": "2023-04-25 11:57:15 CEST+0200", "meta": {"description": "COVID vaccines are going up, up, up in price…but what do the numbers say about their safety and effectiveness? State-based Action Alerts! Moderna recently announced that it is considering charging between $110 and $130 per dose for its COVID vaccine as the US government decreases its pandemic spending, matching what Pfizer has signaled it plans to charge for", "lang": "en", "keywords": "", "favicon": "https://anh-usa.org/wp-content/uploads/2021/09/ANH-leaf-200-100x100.png", "canonical": "https://anh-usa.org/you-paid-for-covid-vax-megaprofits/", "encoding": "UTF-8"}, "image": null, "domain": "anh-usa.org", "title": "You Paid for COVID Vax Megaprofits - Alliance for Natural Health USA - Protecting Natural Health", "cleaned_text": "COVID vaccines are going up, up, up in price…but what do the numbers say about their safety and effectiveness? State-based Action Alerts!\n\nModerna recently announced that it is considering charging between $110 and $130 per dose for its COVID vaccine as the US government decreases its pandemic spending, matching what Pfizer has signaled it plans to charge for its vaccines. Yet again, Big Pharma is cashing in on products that originated in government labs, supported by taxpayers. There are serious questions as to whether these vaccines are worth the price tag given the most recent data on their efficacy.\n\nThe fact that drug companies are essentially stealing from us is nothing new. Of the 210 medicines approved by the FDA between 2010 and 2016, every one originated in government labs, or university labs funded by the government. Taxpayers foot the bill for early research into these therapies which are then handed off to Big Pharma to charge those same taxpayers exorbitant sums. Reportedly, the government was paying $15.25 per dose, which eventually went up to $26.36 per dose. The mRNA technology that underpins the COVID vaccines was developed at the National Institutes for Health. Moderna got nearly $1 billion in research aid from the US government in 2020 before receiving a $1.525 billion deal to deliver 100 million doses of its vaccine. Now that the government gravy train is coming to a halt, Big Pharma is trying to eke every bit of profit they can from COVID vaccines.\n\nThis is the cronyism we have come to expect from the government. Taxpayers pay for the research and Big Pharma reaps the reward, courtesy of our federal government. The system isn’t broken—it’s functioning just as it’s supposed to, by lining the coffers of pharmaceutical companies.\n\nThe price hike may be a response to the fact that many people are not getting booster shots recommended by the CDC after the initial two doses of the vaccine. Eighty percent of people have received at least one dose of the vaccine; 68 percent of Americans are fully vaccinated, and 34 percent have been boosted, according to the CDC. As of November 24 of last year, just 14 percent of adults over the age of 18 received the booster updated to combat the omicron variant.\n\nThis low uptake may be due to people being “done” with the pandemic, but it could also be fueled by the less than stellar protection offered by the updated boosters. Some experts have compared the efficacy of current COVID booster shots to flu shot efficacy, which has ranged from 19 percent to about 52 percent over the last ten years. According to a CDC study from December 2022, the updated boosters protect against symptomatic infection in the range of 40-60 percent.\n\nCompared with unvaccinated adults, those aged 18-49 who got the updated boosters were 43 percent less likely to get sick from COVID; boosted adults aged 50-64 were 28 percent less likely to get sick than the unvaccinated. The boosters offer a modest amount of protection to those who have already received two doses of the vaccine. If a person was two to three months past their last vaccine dose, the bivalent booster added an average of 30 percent protection for 18-49 year-olds, 31 percent more protection for 50-64 year-olds, and 28 percent more for those 65 and older.\n\nOther research from the CDC has found that the updated COVID boosters were less than 50 percent effective at preventing mild illness compared to people who are unvaccinated.\n\nIt has also recently come to light that the government’s vaccine advisers, when making the decision to authorize the new boosters, were not presented with data suggesting the updated shots were not any more effective at preventing infections than the original shots. Taxpayers then spent $5 billion on the new boosters.\n\nThe decision to get vaccinated and/or boosted is surely being weighed by many Americans against the dangers of the vaccination itself. The FDA and CDC just announced a possible link between Pfizer’s bivalent shot and a type of brain stroke in older adults. The CDC’s Vaccine Adverse Event Reporting System lists a staggering 918,508 adverse events, including over 13,000 deaths, 2,899 cases of myocarditis, 123,280 cases of pyrexia (fever), and a host of other scary effects as a result of COVID vaccines. We, in conjunction with our friends at ANH-International, sounded the alarm early on about the increased risks of vaccination for the millions of people with autoimmune conditions.\n\nBoosters offer limited protection and can come with serious side effects, but, to keep things in perspective, the overall risk of dying from COVID is still pretty low for most people. Infection isn’t without risk; one in five adults who have had COVID still have “long COVID” and some combination of the 200 symptoms that have been associated with it. We still don’t know what causes long COVID, but there are some theories. One is that COVID infection leads to the reactivation of dormant Epstein-Barr virus, the most common cause of mononucleosis, which would explain the fatigue and brain fog many long COVID patients feel. COVID infection may also trigger an autoimmune response in some individuals. But again, the shots offer modest (at best) protection against infection, leaving boosted populations still vulnerable to breakthroughs.\n\nAll of this underscores that the decision to vaccinate, or not, should be left to the individual and their doctor, not state governments, employers, or any other authorities. As ever, ANH will be closely monitoring state legislatures for bills that either promote or threaten vaccine choice. See if your state is listed below and click the link to take action in your state.", "opengraph": {"locale": "en_US", "site_name": "Alliance for Natural Health USA - Protecting Natural Health - ANH Protects Free Speech About Natural Health Modalities, Bioidentical Hormone Replacement Therapy, Homeopathy and Access To Natural Therapies.", "type": "article", "title": "You Paid for COVID Vax Megaprofits - Alliance for Natural Health USA - Protecting Natural Health", "description": "COVID vaccines are going up, up, up in price…but what do the numbers say about their safety and effectiveness? State-based Action Alerts! Moderna recently announced that it is considering charging between $110 and $130 per dose for its COVID vaccine as the US government decreases its pandemic spending, matching what Pfizer has signaled it plans to charge for", "url": "https://anh-usa.org/you-paid-for-covid-vax-megaprofits/", "image": "https://anh-usa.org/wp-content/uploads/2021/09/ANH-logo300.png", "image:secure_url": "https://anh-usa.org/wp-content/uploads/2021/09/ANH-logo300.png", "image:width": "300", "image:height": "88", "article:published_time": "2023-01-17T17:02:22+00:00", "article:modified_time": "2023-01-17T17:37:48+00:00", "article:publisher": "https://www.facebook.com/ANHUSA"}, "tags": ["Latest News"], "tweets": [], "movies": [], "links": ["https://www.reuters.com/business/healthcare-pharmaceuticals/moderna-considers-pricing-covid-vaccine-110-130-wsj-2023-01-09/", "https://anh-usa.org/drug-companies-are-stealing-from-you/", "https://www.statnews.com/pharmalot/2023/01/09/moderna-covid19-vaccine-pfizer-patents/?utm_source=STAT+Newsletters&utm_campaign=5ec58e9dfc-dc_diagnosis_rachel_COPY_01&utm_medium=email&utm_term=0_8cab1d7961-5ec58e9dfc-149846845", "https://www.fiercepharma.com/pharma/after-nearly-1b-research-funding-moderna-takes-1-5b-coronavirus-vaccine-order-from-u-s", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/stay-up-to-date.html", "https://www.nytimes.com/interactive/2020/us/covid-19-vaccine-doses.html", "https://morningconsult.com/2022/12/01/covid-19-vaccines-booster-shot-survey-data/", "https://www.cnn.com/2022/11/22/health/vaccine-effectiveness-bivalent-boosters-cdc/index.html", "https://www.cdc.gov/flu/vaccines-work/effectiveness-studies.htm", "https://www.cdc.gov/mmwr/volumes/71/wr/mm7148e1.htm?s_cid=mm7148e1_w", "https://www.cdc.gov/mmwr/volumes/71/wr/mm7148e1.htm?s_cid=mm7148e1_w#T2_down", "https://www.cnn.com/2023/01/11/health/moderna-bivalent-transparency/index.html", "https://www.reuters.com/business/healthcare-pharmaceuticals/us-says-pfizers-bivalent-covid-shot-may-be-linked-stroke-older-adults-2023-01-13/", "https://wonder.cdc.gov/controller/datarequest/D8", "https://anh-usa.org/will-you-be-a-second-class-citizen/", "https://www.cdc.gov/coronavirus/2019-ncov/covid-data/investigations-discovery/hospitalization-death-by-age.html", "https://www.cdc.gov/nchs/pressroom/nchs_press_releases/2022/20220622.htm", "https://www.thelancet.com/journals/eclinm/article/PIIS2589-5370(21)00299-6/fulltext", "https://www.the-scientist.com/news-opinion/long-covid-likely-doesn-t-have-just-one-cause-70559", "https://www.votervoice.net/ANHUSA/campaigns/91656/respond", "https://www.votervoice.net/ANHUSA/campaigns/99739/respond", "https://www.votervoice.net/ANHUSA/campaigns/91113/respond", "https://www.votervoice.net/ANHUSA/campaigns/91114/respond", "https://www.votervoice.net/ANHUSA/campaigns/99738/respond", "https://www.votervoice.net/ANHUSA/campaigns/99740/respond", "https://www.votervoice.net/ANHUSA/campaigns/90276/respond", "https://www.votervoice.net/ANHUSA/campaigns/88824/respond", "https://www.votervoice.net/ANHUSA/Campaigns/98832/Respond", "https://www.votervoice.net/ANHUSA/campaigns/88192/respond", "https://www.votervoice.net/ANHUSA/campaigns/99871/respond", "https://www.votervoice.net/ANHUSA/campaigns/88255/respond", "https://www.votervoice.net/ANHUSA/campaigns/90468/respond", "https://www.votervoice.net/ANHUSA/campaigns/91027/respond"], "authors": [], "publish_date": "2023-01-17T17:02:22+00:00"}