{"result_id": "015003", "URL": "https://anh-usa.org/our-methodology/", "timestamp": "2023-04-25 11:57:02 CEST+0200", "meta": {"description": "We wish to present the most accurate picture of the extent of the US Food and Drug Administration’s culpability in the number of serious adverse events—deaths in particular—connected to FDA-approved drugs and products. But to do that, we couldn’t rely solely on the government’s own data for one major reason: the problem of underreporting. For", "lang": "en", "keywords": "", "favicon": "https://anh-usa.org/wp-content/uploads/2021/09/ANH-leaf-200-100x100.png", "canonical": "https://anh-usa.org/our-methodology/", "encoding": "UTF-8"}, "image": null, "domain": "anh-usa.org", "title": "Our Methodology - Alliance for Natural Health USA - Protecting Natural Health", "cleaned_text": "We wish to present the most accurate picture of the extent of the US Food and Drug Administration’s culpability in the number of serious adverse events—deaths in particular—connected to FDA-approved drugs and products. But to do that, we couldn’t rely solely on the government’s own data for one major reason: the problem of underreporting.\n\nFor example, the FDA’s Vaccine Adverse Event Reporting System (VAERS) website states, “Underreporting is one of the main limitations of passive surveillance systems, including VAERS….VAERS receives reports for only a small fraction of actual adverse events.” But what is that fraction?\n• In 1993, Dr. David Aaron Kessler, FDA Commissioner from 1990 to 1997, told the Journal of the American Medical Association that only 1% of serious adverse events are reported.\n• An analysis by Wald and Shojania found that only 1.5% of all adverse events result in an incident report, and only 6% of adverse drug events are identified properly.\n• Jerry Phillips, associate director of the FDA’s Office of Post Marketing Drug Risk Assessment, wrote in JAMA, “In the broader area of adverse drug reaction data, the 250,000 reports received annually probably represent only 5% of the actual reactions that occur.”\n• Jay Cohen, who has extensively researched adverse drug reactions, notes that because only 5% of adverse drug reactions are reported, there are in fact 5 million medication reactions each year.\n• A Japanese team investigating data mining of the FDA Adverse Event Reporting System determined that the average reporting rate was only 6%.\n• Gary Null, in his book Death by Medicine, reported that as few as 5% and no more than 20% of iatrogenic acts—that is, adverse events induced unintentionally in a patient by a physician—are ever reported.\n\nAccordingly, we take the government’s data—pulled directly from three official FDA databases—and present the numbers reported to the database, plus four multipliers to compensate for the underreporting factor. Because the highest underreporting percentage we could find was 20%, our lowest multiplier is five times (5x) the “official” numbers. But because other experts say only 5% or even 1% of adverse events are reported, we also offer 20x and 100x multipliers.\n\nOur interactive meter allows you to pick and choose which adverse events you want to see reports on, and which FDA-approved products (drug, vaccine, or medical device) you want included. You may come up with very different totals depending on the data you wish to see—which, we hope, will give you a much deeper understanding of the way data can be used and what the issues really are. We hope it will allow the American public to ask their elected officials pointed questions about the safety of the FDA approval process.\n\nPlease see our in-depth article on the problem of underreporting for more information.\n\nOne of the most common challenges we hear about laying all these adverse events at the feet of the FDA is the familiar saying, “Correlation does not imply causation.” For example, they say that just because there were between 35,000 and 701,000 serious adverse event reports (AERs)—events that caused death or were life-threatening, required hospitalization, or caused the patient to be disabled—after Americans received an FDA-approved vaccine, it doesn’t mean that the vaccine actually caused the adverse event.\n\nOften there are complicating factors, certainly. There may have been other conditions that provoked the event. Some adverse events have nothing whatsoever to do with the drug but merely happened at the same time and may have had another direct cause. It could be that a doctor incorrectly prescribed it, or someone took too much, whether on purpose or by mistake—so not always does a drug directly cause an illness or death. We acknowledge that it’s impossible to quantify how often that occurs.\n\nOn the other hand, when there are thousands—or hundreds of thousands!—of hospitalizations and deaths after taking the same drug, especially when we know how grievously underreported these adverse events are, it really does imply causation: an overwhelming amount of data all saying the same thing is more indicative of cause than small numbers might be. (As Yale scientist and statistician Edward Tufte famously wrote, “Correlation is not causation, but it sure is a hint!”)\n\nFor more information, please see our in-depth article the correlation/causation question.\n\nEven if some AERs are attributable to user error, the numbers of AERs from the drugs themselves are still overwhelmingly high. That’s why we created this user-interactive approach: by playing with and manipulating the data, and seeing numbers change with the different parameters, you are able to come to whatever conclusions you think are appropriate about the FDA’s culpability.\n\nOur bottom line: the FDA Death Meter tells a more complete story than the as-reported number of severe adverse events from FDA-approved drugs and products. The government’s own data is shocking enough, but when you see the true numbers, compensating for the underreporting, we think you’ll agree that the FDA is in desperate need of reform (please sign our petition!).", "opengraph": {"locale": "en_US", "site_name": "Alliance for Natural Health USA - Protecting Natural Health - ANH Protects Free Speech About Natural Health Modalities, Bioidentical Hormone Replacement Therapy, Homeopathy and Access To Natural Therapies.", "type": "article", "title": "Our Methodology - Alliance for Natural Health USA - Protecting Natural Health", "description": "We wish to present the most accurate picture of the extent of the US Food and Drug Administration’s culpability in the number of serious adverse events—deaths in particular—connected to FDA-approved drugs and products. But to do that, we couldn’t rely solely on the government’s own data for one major reason: the problem of underreporting. For", "url": "https://anh-usa.org/our-methodology/", "image": "https://anh-usa.org/wp-content/uploads/2021/09/ANH-logo300.png", "image:secure_url": "https://anh-usa.org/wp-content/uploads/2021/09/ANH-logo300.png", "image:width": "300", "image:height": "88", "article:published_time": "2019-07-19T14:46:04+00:00", "article:modified_time": "2019-07-19T14:46:04+00:00", "article:publisher": "https://www.facebook.com/ANHUSA"}, "tags": ["Latest News"], "tweets": [], "movies": [], "links": ["https://web.archive.org/web/20190403025857/https://vaers.hhs.gov/data/index", "https://web.archive.org/web/20190403025857/http://www.fda.gov/downloads/Safety/MedWatch/UCM201419.pdf", "https://web.archive.org/web/20190403025857/http://archive.ahrq.gov/clinic/ptsafety/pdf/ptsafety.pdf", "https://web.archive.org/web/20190403025857/http://jama.jamanetwork.com/article.aspx?articleid=187431", "https://web.archive.org/web/20190403025857/http://www.medicationsense.com/pages/overdose.php", "https://web.archive.org/web/20190403025857/http://www.medsci.org/v10p0796.htm", "https://web.archive.org/web/20190403025857/http://www.praktikosinstitute.org/praktikos-books/death-by-medicine/", "https://web.archive.org/web/20190403025857/https://anh-usa.org/microsite-subpage/the-problem-of-underreporting/", "https://web.archive.org/web/20190403025857/https://anh-usa.org/microsite-subpage/correlation-does-not-imply-causation/", "https://web.archive.org/web/20190403025857/https://anh-usa.org/reform-fda/"], "authors": [], "publish_date": "2019-07-19T14:46:04+00:00"}