{"result_id": "015043", "URL": "https://anh-usa.org/biden-issues-sweeping-vaccine-mandate-for-u-s-workers/", "timestamp": "2023-04-25 11:57:18 CEST+0200", "meta": {"description": "President Biden issued orders covering two-thirds of the American workforce requiring millions of Americans to get vaccinated. President Biden recently signed an Executive Order requiring all federal executive branch employees to be vaccinated, in addition to contractor employees that do business with the government. Other mandates for healthcare workers and private employers with more than", "lang": "en", "keywords": "", "favicon": "https://anh-usa.org/wp-content/uploads/2021/09/ANH-leaf-200-100x100.png", "canonical": "https://anh-usa.org/biden-issues-sweeping-vaccine-mandate-for-u-s-workers/", "encoding": "UTF-8"}, "image": null, "domain": "anh-usa.org", "title": "Biden Issues Sweeping Vaccine Mandate for U.S. Workers - Alliance for Natural Health USA - Protecting Natural Health", "cleaned_text": "President Biden issued orders covering two-thirds of the American workforce requiring millions of Americans to get vaccinated.\n\nPresident Biden recently signed an Executive Order requiring all federal executive branch employees to be vaccinated, in addition to contractor employees that do business with the government. Other mandates for healthcare workers and private employers with more than 100 employees were issued as part of the President’s COVID-19 Action Plan. Separately, the Department of Health and Human Services will require vaccinations for employees in the Head Start program, affecting about 300,000 workers. Together, these orders issue vaccine mandates for over 100 million workers, over two-thirds of the American workforce.\n\nNote that these orders only provide a negative test option to the private employers with 100 or more employees. For the others, there is no testing option—they must receive the shots.\n\nThis is an unprecedented exercise of federal power. Vaccine exemptions and mandates have, up to this point, been left to the states. The order is expected to be challenged by both employers and states.\n\nPresident Biden is using the Occupational Safety and Health Administration (OSHA) to institute the private employer mandate. The legality of OSHA passing a rule to mandate a vaccine or testing for private employers is in serious question and will have to be decided in court. OSHA can legally issue an Emergency Temporary Standard (ETS), which takes effect as soon as it is released. OSHA can only issue an ETS if it determines that “employees are exposed to grave danger” from exposure to harmful substances or agents; further, the ETS must be determined to be “necessary to protect employees from such danger.” It is of course highly contestable that COVID vaccines meet these standards. As constitutional legal expert Jonathan Emord, Esq. points out, a large number of workers telecommute, work outside, have naturally-acquired immunity, or are in a low-risk category (young and healthy), meaning that the legal requirements for OSHA to issue an ETS are not met. States and other groups have indicated plans to challenge the forthcoming rule in court.\n\nPresident Biden’s Executive Order states that the mandates are “subject to such exceptions as required by law.” The law allows for a medical exemption under the Americans with Disabilities Act (ADA) and a religious exemption under Title VII of the Civil Rights Act of 1964. The White House has confirmed that these exemptions will apply to the federal employee mandate.\n\nThe medical exemption provided by the ADA is quite limited. It is unlikely that those with autoimmune conditions would qualify for an exemption under the ADA. It also seems that people who have had an allergic reaction to an ingredient in the COVID vaccine (like polysorbate or PEG) will also qualify for a medical exemption, as the CDC states that those who have had such reactions to an ingredient in the COVID vaccine, even if the reaction wasn’t severe, should not get either shot.\n\nReligious exemptions are likely a better option for those looking to avoid mandatory vaccination. “Religion” is defined broadly for these purposes in the statute to the benefit of employees. Employees stating that the vaccination violates a religious belief—as opposed to a social or political belief—are supposed to be given the benefit of the doubt by their employers. Employers can, however, request additional supporting information.\n\nStill, a religious exemption is not guaranteed, and the difficulty in claiming a religious exemption varies by state and by entity. In Tucson, Arizona, four administrators were assigned to sort through nearly 300 requests for religious exemptions to the city’s vaccine mandate for its public employees; just over half have been approved so far and 15 have been denied. We can likely expect the same level of scrutiny from the federal government in individually assessing requests for religious exemptions.\n\nNevertheless, religious exemptions may be the only option for most individuals seeking to avoid the mandates, given the restrictive medical exemption.\n\nNote, though, that being vaccinated doesn’t make you less likely to spread the virus. In people who have actually contracted COVID, the mucous membranes release antibodies to protect the nose and mouth, and this helps reduce viral spread. COVID vaccination is largely ineffective at stimulating this secretion of antibodies in the nose. Further, all COVID vaccines currently in use have reduced effectiveness against the delta variant that is the dominant strain now.\n\nThe point is that vaccination status is not a guarantee that an individual is not infected and capable of spreading the virus to others, meaning that vaccine mandates are not only coercive, they do not accomplish one of the main goals – preventing the spread of disease – that they set out to achieve.\n\nAction Alert! Write to the President and Congress and tell them to reverse these vaccine mandates. Please send your message immediately.", "opengraph": {"locale": "en_US", "site_name": "Alliance for Natural Health USA - Protecting Natural Health - ANH Protects Free Speech About Natural Health Modalities, Bioidentical Hormone Replacement Therapy, Homeopathy and Access To Natural Therapies.", "type": "article", "title": "Biden Issues Sweeping Vaccine Mandate for U.S. Workers - Alliance for Natural Health USA - Protecting Natural Health", "description": "President Biden issued orders covering two-thirds of the American workforce requiring millions of Americans to get vaccinated. President Biden recently signed an Executive Order requiring all federal executive branch employees to be vaccinated, in addition to contractor employees that do business with the government. Other mandates for healthcare workers and private employers with more than", "url": "https://anh-usa.org/biden-issues-sweeping-vaccine-mandate-for-u-s-workers/", "image": "https://anh-usa.org/wp-content/uploads/2021/09/ANH-logo300.png", "image:secure_url": "https://anh-usa.org/wp-content/uploads/2021/09/ANH-logo300.png", "image:width": "300", "image:height": "88", "article:published_time": "2021-09-16T17:35:59+00:00", "article:modified_time": "2021-10-19T19:19:57+00:00", "article:publisher": "https://www.facebook.com/ANHUSA"}, "tags": ["Latest News"], "tweets": [], "movies": [], "links": ["https://www.whitehouse.gov/briefing-room/presidential-actions/2021/09/09/executive-order-on-requiring-coronavirus-disease-2019-vaccination-for-federal-employees/", "https://www.whitehouse.gov/covidplan/#vaccinate", "https://eclkc.ohs.acf.hhs.gov/about-us/coronavirus/vaccination-head-start-staff", "https://www.nytimes.com/2021/09/09/business/osha-vaccine-biden-mandate.html", "https://soundcloud.com/katedalleyradio/091321-jonathan-emord-constitutionality-expert-on-biden-mandate-and-courts", "https://www.whitehouse.gov/briefing-room/presidential-actions/2021/09/09/executive-order-on-requiring-coronavirus-disease-2019-vaccination-for-federal-employees/", "https://www.eeoc.gov/newsroom/eeoc-issues-updated-covid-19-technical-assistance", "https://www.reuters.com/legal/government/how-will-bidens-vaccine-mandate-impact-workers-companies-2021-09-13/", "https://www.eeoc.gov/laws/guidance/your-employment-rights-individual-disability", "https://anh-usa.org/will-you-be-a-second-class-citizen/", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/recommendations/specific-groups/allergies.html", "https://www.law.cornell.edu/cfr/text/29/1605.1", "https://www.nytimes.com/2021/09/11/us/covid-vaccine-religion-exemption.html", "https://www.nature.com/articles/s41586-020-2798-3", "https://medical.mit.edu/covid-19-updates/2021/07/deltas-here"], "authors": [], "publish_date": "2021-09-16T17:35:59+00:00"}