{"result_id": "016006", "URL": "https://altermedzentrum.com/wie-sicher-sind-die-impfungen/", "timestamp": "2023-04-25 11:57:25 CEST+0200", "meta": {"description": "", "lang": "de", "keywords": "", "favicon": "https://altermedzentrum.com/wp-content/uploads/2018/10/cropped-ay-32x32.jpg", "canonical": "https://altermedzentrum.com/wie-sicher-sind-die-impfungen/", "encoding": "UTF-8"}, "image": null, "domain": "altermedzentrum.com", "title": "Wie sicher sind die Impfungen?", "cleaned_text": "Wie sicher sind die Impfungen?\n\nEine Auswertung amtlicher Zahlen aus den USA und der EU zeigt: Bei den neuartigen mRNA-Präparaten sind die Risiken für Nebenwirkungen im Vergleich zur Grippeschutzimpfung relativ pro behandelter Person je nach Nebenwirkung 20 bis 400-fach erhöht. Das Risiko von Fehlgeburten bei Schwangeren ist 300-fach erhöht. Von Regierungen und Gesundheitsbehörden werden die alarmierenden Zahlen ignoriert.\n\nDer erste Teil dieses Faktenchecks, der sich mit der unbelegten Wirksamkeit der neuen Präparate und der mangelhaften diesbezüglichen Datenerhebung durch das Robert Koch-Institut befasst, wurde am 2. Januar 2022 veröffentlicht. Zur Sicherheit der Stoffe publizierten wir darüberhinaus im November eine Analyse der amtlichen Zahlen, die sich auf die Situation in Deutschland bezieht. Im vorliegenden Faktencheck ist der Fokus auf die EU und die USA erweitert.\n\nSowohl die oberste Gesundheitsbehörde der USA, die Centers for Disease Control and Prevention (CDC), als auch die Europäische Arzneimittel-Agentur (EMA) sammeln Meldungen zu Verdachtsfällen von Nebenwirkungen durch Impfungen in eigenen Datenbanken. In den USA ist dies das Vaccine Adverse Event Reporting System (VAERS), und in der EU die Europäische Datenbank gemeldeter Verdachtsfälle von Arzneimittelnebenwirkungen.\n\nUm zu verdeutlichen, welche Gefahren möglicherweise von den COVID-19-Impfungen – die aus medizinischer Sicht Gentherapien entsprechen –, ausgehen, eignet sich der Vergleich mit einer anderen Impfung, die jährlich verabreicht wird und deren Impfquote ähnlich hoch ist wie bei der COVID-19-Impfung: die Grippeschutzimpfung. In den USA lag die Quote der Impfungen gegen die Influenza in der Grippesaison 2020/21 bei 52,1 Prozent, und aktuell liegt die Quote der mindestens einmal verabreichten COVID-19-Impfung bei 73 Prozent. Analog für die Europäische Union liegt die Quote für die Grippeschutzimpfung bei circa 43 Prozent und die Quote für die mindestens einmal verabreichten COVID-19-Impfungen bei 72 Prozent.\n\nAnhand der Nebenwirkungen aus den Datenbanken sowie den Impfquoten lassen sich die jeweiligen Impfnebenwirkungen je 10 Millionen Geimpfte gegenüberstellen. Die folgende Abbildung zeigt die Impfnebenwirkungsereignisse wie Praxisbesuche, Krankenhauseinlieferungen und Todesfälle in den USA.\n\nDeutlich zu erkennen ist die im Vergleich zur Grippeschutzimpfung um den Faktor 30 bis 90 höhere Anzahl von Verdachtsfällen (90 mal mehr Krankenhauseinlieferungen, 75 mal mehr lebensbedrohliche Ereignisse). Ähnlich sieht es beim Vergleich der Nebenwirkungen selbst aus.\n\nHier liegt die Anzahl der Verdachtsfälle um den Faktor 21 bis 133 höher als bei der Grippeschutzimpfung (zum Beispiel 90 mal mehr Fälle von Atemnot). Die Fälle von Nebenwirkungen aus der Europäischen Datenbank gemeldeter Verdachtsfälle von Arzneimittelnebenwirkungen bestätigen die Zahlen aus den USA.\n\nIm Europäischen Wirtschaftsraum liegt die Anzahl der Verdachtsfälle sogar um den Faktor 25 bis 400 höher als bei der Grippeschutzimpfung (über 200 mal mehr Fälle von Atemnot, über 400 mal mehr Fälle von Schüttelfrost).\n\nObwohl die Verdachtsfälle von Nebenwirkungen explizit erhoben werden, um von verantwortlichen Regulierungsbehörden bei der Prüfung der Sicherheit eines Arzneimittels herangezogen zu werden, finden sie sich kaum in den Studien zur Sicherheit der COVID-19-Impfstoffe wieder. Dies soll im Folgenden anhand einer auffallend hohen Anzahl von Fehlgeburten nach der COVID-19-Impfung näher dargestellt werden.\n\nInsgesamt wurden seit Beginn der Impfungen in den USA 1.167 Verdachtsfälle von Fehlgeburten nach einer COVID-19-Impfung sowie 1.930 Fälle in Europa gemeldet.\n\nIn den USA wurden 2019 circa 3,75 Millionen Kinder geboren. Rechnet man noch die Fehlgeburten, die jährlich bei 11 bis 16 Prozent aller Schwangerschaften auftreten, hinzu, ergeben sich aktuell etwa 4,5 Millionen Schwangerschaften pro Jahr. Gemäß der obersten Gesundheitsbehörde CDC sind 35 Prozent der schwangeren Frauen vor oder während der Schwangerschaft doppelt gegen COVID-19 geimpft worden. Bei circa 1,5 Millionen doppelt geimpften Schwangeren ergeben 1.167 Verdachtsfälle einer Fehlgeburt durch die Impfung ein potentielles Risiko von circa 0,1 Prozent.\n\nIm Vergleich dazu wurden in den USA im Jahr 2020 nur sieben Verdachtsfälle einer Fehlgeburt nach einer Grippeschutzimpfung gemeldet. Bei einer Impfquote der schwangeren Frauen von 61 Prozent liegt das Risiko eines Verdachtsfalls einer Fehlgeburt nach einer Grippeschutzimpfung lediglich bei 0,0003 Prozent und damit 300-fach unter demjenigen nach einer COVID-19-Impfung.\n\nIn Europa wurden nach einer Grippeschutzimpfung im Jahr 2020 lediglich zwei Verdachtsfälle einer Fehlgeburt gemeldet. Somit bestätigt sich das geringe Risiko von Verdachtsfällen einer Fehlgeburt nach Grippeschutzimpfungen auch durch die Zahlen in Europa.\n\nStudien können den Verdacht des erhöhten Fehlgeburtsrisikos nicht entkräften\n\nMehrere Forschergruppen sind der Frage nachgegangen, ob eine COVID-19-Impfung vor oder während der Schwangerschaft die Gefahr einer Fehlgeburt erhöht. Ihre Studien vergleichen die Fehlgeburten von geimpften Schwangeren mit denen von nicht geimpften Schwangeren. Aufgrund des relativ hohen allgemeinen Risikos einer Fehlgeburt von 11 bis 16 Prozent in den ersten 20 Wochen geht das aus der VAERS-Datenbank ermittelte Risiko nach einer Impfung von 0,1 Prozent selbst in einer Studie mit sehr vielen Teilnehmerinnen unter.\n\nDie von Elyse O. Kharbanda et al. im September 2021 veröffentlichte Studie „Spontaneous Abortion Following COVID-19 Vaccination During Pregnancy“ (zu Deutsch: „Fehlgeburten nach einer COVID-19-Impfung während der Schwangerschaft“) hat 105.446 individuelle Schwangerschaften im Zeitraum zwischen Ende 2020 und Mitte 2021 untersucht. Davon sind 13.160 als Fehlgeburten geendet. Das sich daraus ergebene Risiko für eine Fehlgeburt von 12,5 Prozent liegt im Rahmen des allgemeinen Risikos einer Fehlgeburt von 11 bis 16 Prozent.\n\nLeider ist der Studie nicht die Anzahl der Fehlgeburten von individuellen Schwangerschaften mit COVID-19-Impfungen zu entnehmen. Stattdessen wurden Schwangerschaften in jeweils vierwöchigen Zeitabschnitten beobachtet, so dass doppelte Zählungen über den gesamten Beobachtungszeitraum auftreten. Das macht es unmöglich, das tatsächliche Risiko einer Fehlgeburt in der Gruppe der geimpften Schwangeren zu berechnen. Zwar stellt die Studie am Ende fest, dass das Risiko einer Fehlgeburt nach einer COVID-19-Impfung über alle Teilnehmerinnen minimal höher sein soll als ohne. Jedoch sei dies durch die unterschiedliche Altersstruktur der Teilnehmerinnen in der geimpften und ungeimpften Gruppe erklärbar. Zu erwähnen ist, dass drei der Co-Autoren der Studie für den Pharmakonzern Pfizer tätig waren oder Forschungsgelder von dem Unternehmen erhalten haben.\n\nDie Studie von Lauren Head Zauche et al. „Receipt of mRNA COVID-19 vaccines preconception and during pregnancy and risk of self-reported spontaneous abortions“ (zu Deutsch: „Erhalt von mRNA COVID-19-Impfungen vor der Empfängnis und während der Schwangerschaft und das Risiko einer selbst gemeldeten Fehlgeburt“) vom August 2021 basiert auf Daten aus einem Smartphone-basierten CDC-Projekt namens „v-safe“ mit freiwilligen Teilnehmern und hat mit einer enorm großen Dunkelziffer hinsichtlich des Schwangerschaftsstatus von 253 der ursprünglich 2.456 teilnehmenden geimpften Schwangeren nach 20 Wochen zu kämpfen. Mit einem unsicheren Anteil von über zehn Prozent lässt sich ein vermutlich um 0,1 Prozent erhöhtes Risiko einer Fehlgeburt nach einer COVID-19-Impfung nicht ausfindig machen.\n\nAuch die bereits im Juni 2020 von Tom T. Shimabukuro et al. veröffentlichte Studie „Preliminary Findings of mRNA Covid-19 Vaccine Safety in Pregnant Persons“ (zu Deutsch: „Vorläufige Ergebnisse zur Sicherheit von mRNA-Covid-19-Impfstoffen bei Schwangeren“) basiert auf den Daten des Projektes v-safe. Von 5.230 geimpften Schwangeren konnte der Schwangerschaftsstatus von 912 am Ende des Beobachtungszeitraums nicht ermittelt werden. Dies entspricht einer Unsicherheit von 17 Prozent. Bemerkenswert ist, dass keine der Studien zu diesem Thema der im Vergleich zu anderen Impfstoffen außerordentlich hohen Anzahl von gemeldeten Fehlgeburten nachgeht, geschweige denn diese überhaupt erwähnt.\n\nIm Bericht über Verdachtsfälle von Nebenwirkungen und Komplikationen nach der COVID-19-Impfung des Paul-Ehrlich-Instituts vom 26. Oktober 2021 verweisen die Autoren hinsichtlich der Sicherheit von Impfungen von Schwangeren auf die gemeinsame Studie des Instituts mit dem Pharmakovigilanz- und Beratungszentrum für Embryotoxikologie der Charité in Berlin. Wie in den Studien aus en USA werden Häufigkeiten unerwünschter Ereignisse zwischen geimpften und nicht-geimpften Teilnehmern verglichen. Zwar sind noch keine Ergebnisse verfügbar, jedoch ist davon auszugehen, dass aufgrund des hohen allgemeinen Risikos einer Fehlgeburt in den ersten 20 Wochen einer Schwangerschaft auch von dieser Studie keine signifikanten Erkenntnisse zu Fehlgeburten nach einer COVID-19-Impfung zu erwarten sind.\n\nBei allen Diskussionen um Lockdowns, 3G- und 2G-Regelungen sowie Pflichtimpfungen darf man eines niemals vergessen: Bis heute ist nicht eindeutig erwiesen, dass es aufgrund von COVID-19 in Deutschland zu einer außerordentlichen Belastung des Gesundheitssystems und höheren Sterbefallzahlen gekommen ist. Die Auswertungen der Abrechnungsdaten der Krankenhäuser haben gezeigt, dass es in Deutschland seit Beginn der Corona-Krise Anfang 2020 zu einer Rekordunterauslastung der Krankenhäuser gekommen ist. Auch die Auswertung der wöchentlichen Sterbefallzahlen der letzten 19 Jahre zeigt keinen außerordentlichen und unerwarteten Anstieg der Sterbefälle in Deutschland.\n\nAus Abbildung 6 lassen sich drei Schlüsse ziehen:\n• Erstens steigt die Anzahl der Sterbefälle in Deutschland seit Anfang der 2000er Jahre kontinuierlich an. Auch die kurzfristigen Spitzen während der Grippesaisons werden höher. Dies liegt jedoch nicht an schwereren Krankheitswellen, sondern an einer anhaltenden Überalterung der deutschen Gesellschaft.\n• Zweitens kann man an dem Anstieg der Sterbefallzahlen im Winter 2020/21 erkennen, dass die Lockdowns ganz offensichtlich kaum einen senkenden Einfluss auf das Sterbegeschehen in Deutschland hatten.\n• Drittens lässt sich am aktuellen Anstieg der Sterbefallzahlen ablesen, dass auch die Impfungen keine entlastenden Auswirkungen auf das Sterbegeschehen haben. Bei einer Impfquote von über 88 Prozent unter den über 60-jährigen, die den Großteil der Sterbefälle ausmachen, hätte man bei einer hohen Impfeffektivität eine deutliche Auswirkung auf die Sterbefallzahlen in Deutschland erwarten können.\n\nDiese einfachen Schlüsse reichen im Grunde aus, um zu erkennen, wie unangebracht und wenig wirksam die deutsche Coronapolitik ist. Stattdessen werden Menschen, die aufgrund ihres Alters und Gesundheitszustandes kaum etwas von der Krankheit befürchten müssen, sowie auch ungeborenes Leben den nicht ausreichend erforschten Risiken von nur bedingt zugelassenen, neuartigen Präparaten ausgesetzt.", "opengraph": {"type": "article", "url": "https://altermedzentrum.com/wie-sicher-sind-die-impfungen/", "title": "Wie sicher sind die Impfungen?", "description": "Eine Auswertung amtlicher Zahlen aus den USA und der EU zeigt: Bei den neuartigen mRNA-Präparaten", "site_name": "altermed zentrum", "image": "https://altermedzentrum.com/wp-content/uploads/2022/01/3ET8-1024x512.jpg", "image:width": "2000", "image:height": "1000"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Faltermedzentrum.com%2Fwie-sicher-sind-die-impfungen%2F&t=Wie+sicher+sind+die+Impfungen%3F", "https://wonder.cdc.gov/vaers.html", "https://www.adrreports.eu/de/", "https://www.cdc.gov/flu/fluvaxview/coverage-2021estimates.htm", "https://ourworldindata.org/covid-vaccinations?country=OWID_WRL", "https://www.derstandard.de/story/2000093842379/eu-bevoelkerung-laesst-sich-immer-weniger-gegen-grippe-impfen", "https://ourworldindata.org/covid-vaccinations?country=OWID_WRL", "https://www.researchsquare.com/article/rs-798175/v1", "https://covid.cdc.gov/covid-data-tracker/#vaccinations-pregnant-women", "https://jamanetwork.com/journals/jama/fullarticle/2784193", "https://www.researchsquare.com/article/rs-798175/v1", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/vsafe.html", "https://www.nejm.org/doi/full/10.1056/nejmoa2104983", "https://www.pei.de/SharedDocs/Downloads/DE/newsroom/dossiers/sicherheitsberichte/sicherheitsbericht-27-12-20-bis-30-09-21.pdf", "https://www.embryotox.de/das-institut/aktuelles/details/ansicht/news/beobachtungsstudie-zu-covid-19-impfungen-in-der-schwangerschaft/", "https://multipolar-magazin.de/artikel/erwartbare-sterbefalle", "https://multipolar-magazin.de", "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Faltermedzentrum.com%2Fwie-sicher-sind-die-impfungen%2F&t=Wie+sicher+sind+die+Impfungen%3F", "https://api.whatsapp.com/send?text=Wie%20sicher%20sind%20die%20Impfungen%3F https%3A%2F%2Faltermedzentrum.com%2Fwie-sicher-sind-die-impfungen%2F", "https://www.instagram.com/", "https://altermedzentrum.com/wie-sicher-sind-die-impfungen/", "https://api.whatsapp.com/send?text=Wie%20sicher%20sind%20die%20Impfungen%3F https%3A%2F%2Faltermedzentrum.com%2Fwie-sicher-sind-die-impfungen%2F", "https://www.instagram.com/", "https://altermedzentrum.com/wie-sicher-sind-die-impfungen/"], "authors": [], "publish_date": "Januar 4, 2022"}