{"result_id": "016003", "URL": "https://altermedzentrum.com/turbo-krebs-und-impf-aids-die-liste-ueber-zum-teil-toedliche-impfschaeden-wird-immer-laenger/", "timestamp": "2023-04-25 11:57:21 CEST+0200", "meta": {"description": "", "lang": "de", "keywords": "", "favicon": "https://altermedzentrum.com/wp-content/uploads/2018/10/cropped-ay-32x32.jpg", "canonical": "https://altermedzentrum.com/turbo-krebs-und-impf-aids-die-liste-ueber-zum-teil-toedliche-impfschaeden-wird-immer-laenger/", "encoding": "UTF-8"}, "image": null, "domain": "altermedzentrum.com", "title": "Turbo-Krebs und Impf-Aids: Die Liste über zum Teil tödliche Impfschäden wird immer länger!", "cleaned_text": "Turbo-Krebs und Impf-Aids: Die Liste über zum Teil tödliche Impfschäden wird immer länger!\n\nHerzmuskelentzündungen, Fehlgeburten, Turbo-Krebs, Impf-Aids, Herzmuskelentzündungen – die Liste der Horrormeldungen reißt nicht ab. Seit Monaten schießen die Zahlen der zum Teil tödlichen Nebenwirkungen der Corona-Injektionen durch die Decke. Jetzt meldet sich ein Bestatter zu Wort, der „noch nie so viele Babys in den Kühlkammern gesehen” hat.\n\nErschreckende Daten der US-Regierung, herausgegeben vom Center for Disease Control and Prevention (CDC), basierend auf den Meldungen im “Vaccine Adverse Event Reporting System” (VAERS), belegen einen massiven Anstieg von Krebsfällen im zeitlichen Zusammenhang mit den Gen-Spritzen um 143.233%. Mittlerweile ist mehrfach dokumentiert, dass die mRNA-Präparate Eierstock-, Bauchspeicheldrüsen- und Brustkrebs verursachen können.\n\nDabei trifft es keineswegs nur die Alten und Schwachen. Auffällig viele junge Menschen, Sportler und Berufstätige finden sich in den Statistiken. Vor allem ihr Herz ist angegriffen.\n\nIn Thailand finden sich drei von 1000 mRNA-geimpften Jugendlichen mit einer Myokarditis auf der Intensivstation wieder. Im Rahmen einer Studie wurden 202 Jungen und 99 Mädchen über mehrere Wochen nach der zweiten Dosis begleitet und mit Hilfe von Elektrokardiogrammen und Biomarkern auf Herzprobleme untersucht. Die Ergebnisse der Autoren sind haarsträubend: 17,9% der mRNA-gespritzten Jugendlichen zwischen 13 und 18 Jahren litten unter Herzrhythmusstörungen, 29,2% von ihnen klagten über Herzprobleme.\n\nIn England sind die Todesfälle unter Mädchen, nachdem sie einen Covid-19-Impfstoff erhalten hatten, um 57% gestiegen, zeigen die vom Office for National Statistics veröffentlichten Zahlen. Im September 2021 hatte die britische Regierung den Impfstoff von Pfizer mit sofortiger Wirkung für alle Kinder über 12 Jahren eingeführt. Seitdem ist die Zahl der Todesfälle bei Kindern im Alter von 10 bis 14 Jahren im Vergleich zum Fünfjahresdurchschnitt um 44% gestiegen. Nachweislich verloren 22 junge Mädchen bis zur 44. Kalenderwoche 2021 ihr Leben wegen der “Impfung”.\n\nViele Länder verzeichnen eine deutliche Übersterblichkeit im Vergleich zu den Vorjahren. Selbst im „Pandemie-Jahr“ 2020 starben weniger Menschen als in 2021 und 2022, in denen doch eigentlich die gelobte “Impfung” die Freiheit und den Segen bringen sollte. Stattdessen zeichnet sich ein Massenmord an der Bevölkerung ab, hervorgerufen durch experimentelle Präparate, die von skrupellosen und profitgierigen Herstellern, Politikern und Ärzten unters Volk gebracht werden.\n\nSpanien verzeichnet in den ersten sieben Monaten 2022 bei einer Bevölkerung von 47 Millionen Menschen etwa 20.000 zusätzliche Todesfälle, berichtet der Anwalt Aitor Guisasola. Man kann davon ausgehen, dass die wahren Todeszahlen vertuscht werden und generell beim Thema Impfschäden massive Verharmlosung und Desinformation betrieben wird. So lässt der deutsche Publizist Kai Rebmann eine Insiderin der Deutschen Rentenversicherung zu Wort kommen, die über Patienten berichtet, die vorsätzlich mit Falschinformationen zur Impfung gedrängt wurden, und von Ärzten, “die Nebenwirkungen der Impfung partout nicht als solche anerkennen wollen”.\n\nDemnach seien Desinformationen “über die Zusammensetzung der Impfstoffe” in den Arztpraxen scheinbar “immer noch sehr weit verbreitet”. Bei der Rentenversicherung landen immer mehr Impfkrüppel auf dem Tisch: Ein Beispiel ist ein Mann, der seit der Spritze unter “Beinlähmung, Inkontinenz und Blasenlähmung“ leidet und auf den Rollstuhl angewiesen ist. Darüber hinaus wurde bei ihm eine Lähmung der Skelettmuskulatur der Arme und Beine diagnostiziert, weshalb dem Patienten ein Behinderungsgrad von 80% anerkannt wurde.\n\nJunge Menschen berichten von geschwächter Leistungskraft, Schwäche, Müdigkeit und reduzierter Belastbarkeit seit den “Impfungen”. Viele Frauen klagen zudem über Störungen ihres Menstruationszyklus. Was bisher als „Hirngespinst“ abgetan wurde, ist nun wissenschaftlich in Stein gegossen: “Studie belegt: Corona-Impfung beeinflusst Menstruation“ titelt die Epoch Times. Laut einer in der Fachzeitschrift Science Advances veröffentlichten Studie haben 42% der rund 35.660 befragten Frauen gestörte Monatsblutungen.\n\nDen Herstellern sind diese Tatsachen schon länger bekannt, klagt die Autorin Naomi Wolf an: „Die Arzneimittelzulassungsbehörde hat den Kopf in den Sand gesteckt, als schwangere Studienteilnehmerinnen Fehlgeburten erlitten.“ Aus einem nach gerichtlicher Anordnung freigegebenen Dokument gehe hervor, dass 44% der schwangeren Frauen, die an einer COVID-Impfstoffstudie von Pfizer teilgenommen hatten, Fehlgeburten erlitten.\n\n„Schon vor über einem Jahr erhielten die Behörden den Bericht, dass von 50 schwangeren Frauen 22 ihre Babys verloren. Man wusste also schon Anfang April 2021 von der erschreckenden Rate der fetalen Todesfälle und hat geschwiegen”, so Wolf.\n\nDie israelische Journalistin Etana Hecht hat mit einem der größten Sarghersteller Nordamerikas gesprochen. Die Firma liefert Särge ins ganze Land. Die Betreiber geben an, dass die Bestellungen von normalen Särgen um 20% und seit Dezember 2021 die Verkäufe von Kindersärgen um 400% gestiegen sind.\n\nJohn O´Looney ist seit 15 Jahren Eigentümer des Bestattungsunternehmens in Milton Keynes in Großbritannien. Früher seien vor allem Menschen in Pflegeheimen gestorben, doch nach Einführung der Gen-Präparate habe sich dies “dramatisch geändert”: Plötzlich sterben junge und gesunde Menschen an Blutgerinnseln und Organversagen.\n\nBeim Einbalsamieren der Leichname habe er “noch nie dagewesene arterielle Veränderungen” gesehen. Seine Kollegen bestätigen dies. Looney spricht in einem Interview mit Transition TV darüber, dass Krankenhäuser tote Babys mittlerweile ohne ordentliche Bestattung sofort kremieren. “Auf diese Weise sollen die Todesfälle von Neugeborenen vertuscht werden”, meint Looney. Er habe “noch nie so viele Babys in den Kühlkammern” gesehen.", "opengraph": {"type": "article", "url": "https://altermedzentrum.com/turbo-krebs-und-impf-aids-die-liste-ueber-zum-teil-toedliche-impfschaeden-wird-immer-laenger/", "title": "Turbo-Krebs und Impf-Aids: Die Liste über zum Teil tödliche Impfschäden wird immer länger!", "description": "Herzmuskelentzündungen, Fehlgeburten, Turbo-Krebs, Impf-Aids, Herzmuskelentzündungen – die Liste der Horrormeldungen reißt nicht ab. Seit Monaten", "site_name": "altermed zentrum", "image": "https://altermedzentrum.com/wp-content/uploads/2022/10/34rz72.jpg", "image:width": "730", "image:height": "410"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Faltermedzentrum.com%2Fturbo-krebs-und-impf-aids-die-liste-ueber-zum-teil-toedliche-impfschaeden-wird-immer-laenger%2F&t=Turbo-Krebs+und+Impf-Aids%3A+Die+Liste+%C3%BCber+zum+Teil+t%C3%B6dliche+Impfsch%C3%A4den+wird+immer+l%C3%A4nger%21", "https://ibizakurier.de", "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Faltermedzentrum.com%2Fturbo-krebs-und-impf-aids-die-liste-ueber-zum-teil-toedliche-impfschaeden-wird-immer-laenger%2F&t=Turbo-Krebs+und+Impf-Aids%3A+Die+Liste+%C3%BCber+zum+Teil+t%C3%B6dliche+Impfsch%C3%A4den+wird+immer+l%C3%A4nger%21", "https://api.whatsapp.com/send?text=Turbo-Krebs%20und%20Impf-Aids%3A%20Die%20Liste%20%C3%BCber%20zum%20Teil%20t%C3%B6dliche%20Impfsch%C3%A4den%20wird%20immer%20l%C3%A4nger%21 https%3A%2F%2Faltermedzentrum.com%2Fturbo-krebs-und-impf-aids-die-liste-ueber-zum-teil-toedliche-impfschaeden-wird-immer-laenger%2F", "https://www.instagram.com/", "https://altermedzentrum.com/turbo-krebs-und-impf-aids-die-liste-ueber-zum-teil-toedliche-impfschaeden-wird-immer-laenger/", "https://api.whatsapp.com/send?text=Turbo-Krebs%20und%20Impf-Aids%3A%20Die%20Liste%20%C3%BCber%20zum%20Teil%20t%C3%B6dliche%20Impfsch%C3%A4den%20wird%20immer%20l%C3%A4nger%21 https%3A%2F%2Faltermedzentrum.com%2Fturbo-krebs-und-impf-aids-die-liste-ueber-zum-teil-toedliche-impfschaeden-wird-immer-laenger%2F", "https://www.instagram.com/", "https://altermedzentrum.com/turbo-krebs-und-impf-aids-die-liste-ueber-zum-teil-toedliche-impfschaeden-wird-immer-laenger/"], "authors": [], "publish_date": "Oktober 29, 2022"}