{"result_id": "016011", "URL": "https://altermedzentrum.com/im-jahr-1987-auf-der-titelseite-der-london-times-pocken-impfung-ausloeser-fuer-aids-virus/", "timestamp": "2023-04-25 11:57:31 CEST+0200", "meta": {"description": "", "lang": "de", "keywords": "", "favicon": "https://altermedzentrum.com/wp-content/uploads/2018/10/cropped-ay-32x32.jpg", "canonical": "https://altermedzentrum.com/im-jahr-1987-auf-der-titelseite-der-london-times-pocken-impfung-ausloeser-fuer-aids-virus/", "encoding": "UTF-8"}, "image": null, "domain": "altermedzentrum.com", "title": "Im Jahr 1987 auf der Titelseite der London Times: „Pocken-Impfung Auslöser für Aids-Virus“", "cleaned_text": "Im Jahr 1987 auf der Titelseite der London Times: „Pocken-Impfung Auslöser für Aids-Virus“\n\nBevor wir das glauben konnten, haben wir sorgfältig recherchiert. Es ist die Wahrheit. Pearce Wright, Wissenschaftsredakteur der renommierten London Times, verfasste den am 11. Mai 1987 erschienenen Artikel „Smallpox vaccine ‚triggered Aids virus’“. Dieser erschien auf der Titelseite des international anerkannten Leitmediums. Er beschrieb, wie der Pockenimpfstoff den „schlafenden“ HIV-Virus erweckte und belegte dies präzise: Aids brach in den sieben Ländern aus, in denen geimpft wurde.\n\nPearce Wright (1933 – 2005) war ein bedeutender britischer Wissenschaftsjournalist, dem im Jahr 1974 die Ehre zuteil wurde, das Wissenschaftsressort der weltberühmten London Times zu leiten. Er verblieb 16 lange Jahre – bis 1990 – in dieser Funktion. Wright war Vorsitzender der Vereinigung britischer Wissenschaftsautoren. Die Financial Times würdigte ihn als einen der drei Giganten des Wissenschaftsjournalismus seiner Zeit.\n\nEben dieser Pearce Wright, ein in diesem Jahr bereits hoch angesehener Journalist, veröffentlichte am 11. Mai 1987 in der damals vielleicht angesehensten Zeitung der Welt auf der Titelseite einen Text mit dem Titel: „Smallpox vaccine ‚triggered Aids virus‘, der weiter innen in der Zeitung um zwei lange Textspalten ergänzt wurde. Wir präsentieren Ihnen diesen Text wertungsfrei in englischer und in deutscher Sprache. Mögen sich doch die „Faktenchecker“ in Wertungen ergießen, dafür werden sie unter anderem von George Soros sehr gut bezahlt.\n\nDie Übersetzung in deutscher Sprache\n\nDie Aids-Epidemie könnte durch die Massenimpfkampagne ausgelöst worden sein, welche die Pocken ausrottete. Die Weltgesundheitsorganisation, die die 13-jährige Kampagne leitete, untersucht neue wissenschaftliche Beweise, die darauf hindeuten, dass die Immunisierung mit dem Pockenimpfstoff Vaccinia die unerwartete, schlafende Infektion mit dem menschlichen Immundefekt-Virus (HIV) geweckt hat.\n\nEinige Experten befürchten, dass durch die Auslöschung einer Krankheit eine andere Krankheit von einer kleinen endemischen Krankheit der Dritten Welt in die aktuelle Pandemie umgewandelt wurde. Während Ärzte inzwischen akzeptieren, dass Vaccinia andere Viren aktivieren kann, sind sie sich uneins darüber, ob es der Hauptauslöser der Aids-Epidemie war.\n\nAber ein Berater der WHO, der das Problem offenlegte, sagte gegenüber The Times: „Ich dachte, es sei nur ein Zufall, bis wir die neuesten Erkenntnisse über die Reaktionen untersucht haben, die durch Vaccinia verursacht werden können. Jetzt glaube ich, dass die Theorie des Pockenimpfstoffs die Erklärung für die Explosion von Aids ist. „Indem eine Krankheit ausgelöscht wurde, wurde eine andere transformiert.“\n\nWeitere Beweise stammen vom Walter Reed Army Medical Center in Washington. Während der Pockenimpfstoff nicht mehr für Zwecke der öffentlichen Gesundheit aufbewahrt wird, werden neue Rekruten der amerikanischen Streitkräfte als Vorsichtsmaßnahme gegen eine mögliche biologische Kriegsführung immunisiert. Die routinemäßige Impfung eines 19-jährigen Rekruten war der Auslöser für die Stimulierung des ruhenden HIV-Virus zu Aids.\n\nDiese Entdeckung, dass Menschen mit subklinischer HIV-Infektion dem Risiko einer raschen Entwicklung von Aids als durch Impfung verursachte Krankheit ausgesetzt sind, wurde von einem medizinischen Team gemacht, das mit Dr. Robert Redfield bei Walter Reed zusammenarbeitete. Der Rekrut, der nach der Impfung an Aids erkrankte, war während der gesamten Schulzeit gesund gewesen. Er erhielt mehrere Immunisierungen, gefolgt von seiner ersten Pockenimpfung.\n\nZweieinhalb Wochen später bekam er Fieber, Kopfschmerzen, Nackensteifigkeit und Nachtschweiß. Drei Wochen später wurde er bei Walter Reed mit Meningitis aufgenommen und entwickelte schnell weitere Aids-Symptome und starb, nachdem er für kurze Zeit auf die Behandlung angesprochen hatte. Es gab keine Hinweise darauf, dass der Rekrut an homosexuellen Aktivitäten beteiligt war.\n\nBei der Beschreibung ihrer Entdeckung in einem Artikel, der vor zwei Wochen im New England Journal of Medicine veröffentlicht wurde, warnte das Team von Walter Reed vor einem Plan, modifizierte Versionen des Pockenimpfstoffs zur Bekämpfung anderer Krankheiten in Entwicklungsländern einzusetzen.\n\nAndere Ärzte, die den Zusammenhang zwischen der Anti-Pocken-Kampagne und der Aids-Epidemie akzeptieren, sehen jetzt Antworten auf Fragen, die sie verwirrt hatten. Wie zum Beispiel der Aids-Organismus, der zuvor von Wissenschaftlern als „schwach, langsam und verletzlich“ angesehen wurde, begann, sich wie ein Typ zu verhalten, der eine Seuche hervorrufen kann.\n\nViele Experten zögern, die Theorie öffentlich zu unterstützen, weil sie glauben, dass sie zu Unrecht als Kritik an der WHO interpretiert würde. Darüber hinaus sind sie besorgt über die Auswirkungen auf andere öffentliche Gesundheitskampagnen mit Impfstoffen, beispielsweise gegen Diphtherie und die fortgesetzte Verwendung von Vaccinia in der potenziellen Aids-Forschung.\n\nDie Koinzidenz zwischen der Anti-Pocken-Kampagne und dem Anstieg von Aids wurde letztes Jahr privat von Experten der WHO diskutiert. Die Möglichkeit wurde aufgrund unzureichender Beweise verworfen. Berater der Organisation glaubten damals, dass Aids in den Medien zu viel Aufmerksamkeit geschenkt werde.\n\nEs wird jetzt angenommen, dass Zweifel früher aufkommen würden, wenn die Gesundheitsbehörden in Afrika bereitwilliger Infektionsstatistiken an die WHO gemeldet hätten. Stattdessen ignorierten einige afrikanische Länder weiterhin die Existenz von Aids, selbst nachdem US-Ärzte die Welt alarmiert hatten, als sich die Infektion auf die Vereinigten Staaten ausbreitete.\n\nAls Epidemiologen jedoch mehr Informationen über Aids aus zurückhaltenden zentralafrikanischen Ländern sammelten, begannen sich Hinweise aus den neuen Erkenntnissen zu ergeben, wenn man sie mit der Fülle von Details verglich, die über Pocken bekannt sind, wie sie im Abschlussbericht der Globalen Kommission zur Zertifizierung der Pockenausrottung aufgeführt wurden.\n\nDie Pockenimpfstoff-Theorie würde die Position jedes der sieben zentralafrikanischen Staaten erklären, die die Rangliste der am stärksten betroffenen Länder anführen; warum Brasilien das am stärksten betroffene lateinamerikanische Land wurde; und wie Haiti zur Route für die Verbreitung von Aids in die USA wurde. Es liefert auch eine Erklärung dafür, wie sich die Infektion in Afrika gleichmäßiger auf Männer und Frauen ausbreitete als im Westen und warum es in Zentralafrika bei den Fünf- bis Elfjährigen weniger Anzeichen einer Infektion gibt.\n\nObwohl keine detaillierten Zahlen verfügbar sind, weisen WHO-Informationen darauf hin, dass die Aids-Rangliste von Zentralafrika mit der Konzentration von Impfungen übereinstimmt. Die größte Ausbreitung der HIV-Infektion fällt mit den intensivsten Impfprogrammen zusammen, wobei die Zahl der geimpften Personen wie folgt lautet: Zaire 36.878.000; Sambia 19.060.000; Tansania 14.972.000; Uganda 11.616.000; Malawai 8.118.000; Ruanda 3.382.000 und Burundi 3.274.000.\n\nBrasilien, das einzige südamerikanische Land, das von der Ausrottungskampagne betroffen ist, weist die höchste Aids-Inzidenz in dieser Region auf. Rund 14.000 Haitianer, die von den Vereinten Nationen nach Zentralafrika entsandt wurden, wurden von der Kampagne erfasst. Sie begannen zu einer Zeit nach Hause zurückzukehren, als Haiti zu einem beliebten Spielplatz für Homosexuelle aus San Francisco geworden war.\n\nDr. Robert Gello, der das Aids-Virus erstmals in den USA identifizierte, sagte gegenüber The Times: „Die Verbindung zwischen dem WHO-Programm und der Epidemie in Afrika ist eine interessante und wichtige Hypothese. „Ich kann nicht sagen, dass es tatsächlich passiert ist, aber ich sage seit einigen Jahren, dass die Verwendung von Lebendimpfstoffen, wie sie für Pocken verwendet werden, eine ruhende Infektion wie HIV aktivieren kann. „Der WHO kann keine Schuld gegeben werden, aber wenn die Hypothese richtig ist, ist dies eine tragische Situation und eine Warnung, die wir nicht ignorieren können.“\n\nAids wurde erstmals 1981 offiziell aus San Francisco gemeldet, und es dauerte etwa zwei Jahre, bis zentralafrikanische Staaten involviert waren. Es ist heute bekannt, dass diese Staaten bereits Ende der 1970-er Jahre zu einem Aids-Reservoir geworden waren.\n\nObwohl detaillierte Zahlen von Aids-Fällen in Afrika schwer zu erheben sind, konzentrieren sich die mehr als zwei Millionen Träger und 50.000 Todesfälle, die von der Weltgesundheitsorganisation geschätzt werden, auf die Länder, in denen das Pocken-Impfprogramm am intensivsten war. Die 13-jährige Ausrottungskampagne endete 1980 mit der Rettung von zwei Millionen Leben pro Jahr und 15 Millionen Infektionen. Die weltweiten Einsparungen durch die Ausrottung wurden auf 1.000 Millionen Dollar pro Jahr geschätzt.\n\nMitarbeiter im Wohltätigkeits- und Gesundheitsbereich sind davon überzeugt, dass Millionen neuer Aids-Fälle das südliche Afrika treffen werden. Nach einem Treffen von 50 Experten in der Nähe von Genf in diesem Monat wurde bekannt, dass bis zu 75 Millionen, ein Drittel der Bevölkerung, innerhalb der nächsten fünf Jahre an der Krankheit erkranken könnten.\n\nEinige Organisationen, die Afrika genau studiert haben, wie War on Want, glauben, dass die schwarze Bevölkerung Südafrikas, die bisher weitgehend vor der Krankheit geschützt war, am stärksten betroffen sein könnte, da Wanderarbeiter sie aus den am stärksten betroffenen Gebieten weiter nördlich ins Land bringen. Sie sagen voraus, dass die Apartheid-Politik ihren Ausbruch verstärken wird, indem sie die Gruppen auf vergleichsweise kleine, dicht besiedelte Städte beschränkt, wo es fast unmöglich sein wird, ihre Ausbreitung einzudämmen.\n\nThe Aids epidemic may have been triggered by the mass vaccination campaign which eradicated smallpox. The World Health Organization, which masterminded the 13-year campaign, is studying new scientific evidence suggesting that immunization with the smallpox vaccine Vaccinia awakened the unsuspected, dormant human immuno defence virus infection (HIV).\n\nSome experts fear that in obliterating one disease, another disease was transformed from a minor endemic illness of the Third World into the current pandemic. While doctors now accept that Vaccinia can activate other viruses, they are divided about whether it was the main catalyst to the Aids epidemic.\n\nBut an adviser to WHO who disclosed the problem, told The Times: ‚I thought it was just a coincidence until we studied the latest findings about the reactions which can be caused by Vaccinia. Now I believe the smallpox vaccine theory is the explanation to the explosion of Aids.‘ ‚In obliterating one disease, another was transformed.‘\n\nFurther evidence comes from the Walter Reed Army Medical Centre in Washington. While smallpox vaccine is no longer kept for public health purposes, new recruits to the American armed services are immunized as a precaution against possible biological warfare. Routine vaccination of a 19-year-old recruit was the trigger for stimulation of dormant HIV virus into Aids.\n\nThis discovery of how people with subclinical HIV infection are at risk of rapid development of Aids as a vaccine-induced disease was made by a medical team working with Dr Robert Redfield at Walter Reed. The recruit who developed Aids after vaccination had been healthy throughout high school. He was given multiple immunizations, followed by his first smallpox vaccination.\n\nTwo and a half weeks later he developed fever, headaches, neck stiffness and night sweats. Three weeks later he was admitted to Walter Reed suffering from meningitis and rapidly developed further symptoms of Aids and died after responding for a short time to treatment. There was no evidence that the recruit had been involved in any homosexual activity.\n\nIn describing their discovery in a paper published in the New England Journal of Medicine a fortnight ago, the Walter Reed team gave a warning against a plan to use modified versions of the smallpox vaccine to combat other diseases in developing countries.\n\nOther doctors who accept the connection between the anti-smallpox campaign and the Aids epidemic now see answers to questions which had baffled them. How, for instance, the Aids organism, previously regarded by scientists as ‚weak, slow and vulnerable,‘ began to behave like a type capable of creating a plague.\n\nMany experts are reluctant to support the theory publicly because they believe it would be interpreted unfairly as criticism of WHO. In addition, they are concerned about the impact on other public health campaigns with vaccines, such as against diptheria and the continued use of Vaccinia in potential Aids research.\n\nThe coincidence between the anti-smallpox campaign and the rise of Aids was discussed privately last year by experts at WHO. The possibility was dismissed on grounds of unsatisfactory evidence. Advisors to the organization believed then that too much attention was being focussed on Aids by the media.\n\nIt is now felt that doubts would have risen sooner if public health authorities in Africa had more willingly reported infection statistics to WHO. Instead, some African countries continued to ignore the existence of Aids even after US doctors alerted the world when the infection spread to the United States.\n\nHowever, as epidemiologists gleaned more information about Aids from reluctant Central African countries, clues began to emerge from the new findings when examined against the wealth of detail known about smallpox as recorded in the Final Report of the Global Commission for the Certification of Smallpox Eradication.\n\nThe smallpox vaccine theory would account for the position of each of the seven Central African states which top the league table of most-affected countries; why Brazil became the most afflicted Latin American country; and how Haiti became the route for the spread of Aids to the US. It also provides an explanation of how the infection was spread more evenly between males and females in Africa than in the West and why there is less sign of infection among five to 11-year-olds in Central Africa.\n\nAlthough no detailed figures are available, WHO information indicated that the Aids league table of Central Africa matches the concentration of vaccinations. The greatest spread of HIV infection coincides with the most intense immunization programmes, with the number of people immunised being as follows: Zaire 36,878,000; Zambia 19,060,000; Tanzania 14,972,000; Uganda 11,616,000; Malawai 8,118,000; Ruanda 3,382,000 and Burundi 3,274,000.\n\nBrazil, the only South American country covered in the eradication campaign, has the highest incidence of Aids in that region. About 14,000 Haitians, on United Nations secondment to Central Africa, were covered in the campaign. They began to return home at a time when Haiti had become a popular playground for San Francisco homosexuals.\n\nDr Robert Gello, who first identified the Aids virus in the US, told The Times: ‚The link between the WHO programme and the epidemic in Africa is an interesting and important hypothesis. ‚I cannot say that it actually happened, but I have been saying for some years that the use of live vaccines such as that used for smallpox can activate a dormant infection such as HIV. ‚No blame can be attached to WHO, but if the hypothesis is correct it is a tragic situation and a warning that we cannot ignore.‘\n\nAids was first officially reported from San Francisco in 1981 and it was about two years later before Central African states were implicated. It is now known that these states had become a reservoir of Aids as long ago as the later 1970s.\n\nAlthough detailed figures of Aids cases in Africa are difficult to collect, the more than two million carriers, and 50,000 deaths, estimated by the World Health Organization are concentrated in the Countries where the smallpox immunization programme was most intensive. The 13-year eradication campaign ended in 1980, with the saving of two million lives a year and 15 million infections. The global saving from eradication has been put at dollars 1,000 million a year.\n\nCharity and health workers are convinced that millions of new Aids cases are about to hit southern Africa. After a meeting of 50 experts near Geneva this month it was revealed that up to 75 million, one third of the population, could have the disease within the next five years.\n\nSome organizations which have closely studied Africa, such as War on Want, believe that South Africa’s black population, so far largely protected from the disease, could be most affected as migrant workers bring it into the country from the worst hit areas further north. The apartheid policy, they predict, will intensify its outbreak by confining the groups into comparatively small, highly populated towns where it will be almost impossible to contain its spread.", "opengraph": {"type": "article", "url": "https://altermedzentrum.com/im-jahr-1987-auf-der-titelseite-der-london-times-pocken-impfung-ausloeser-fuer-aids-virus/", "title": "Im Jahr 1987 auf der Titelseite der London Times: „Pocken-Impfung Auslöser für Aids-Virus“", "description": "Bevor wir das glauben konnten, haben wir sorgfältig recherchiert. Es ist die Wahrheit. Pearce Wright,", "site_name": "altermed zentrum", "image": "https://altermedzentrum.com/wp-content/uploads/2022/06/34rc.jpg", "image:width": "672", "image:height": "467"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Faltermedzentrum.com%2Fim-jahr-1987-auf-der-titelseite-der-london-times-pocken-impfung-ausloeser-fuer-aids-virus%2F&t=Im+Jahr+1987+auf+der+Titelseite+der+London+Times%3A+%E2%80%9EPocken-Impfung+Ausl%C3%B6ser+f%C3%BCr+Aids-Virus%E2%80%9C", "https://en.wikipedia.org/wiki/Pearce_Wright", "https://report24.news/", "https://en.wikipedia.org/wiki/Pearce_Wright", "https://timetotimes.com/im-jahr-1987-auf-der-titelseite-der-london-times-pocken-impfung-ausloser-fur-aids-virus/", "https://www.hivireland.ie/wp-content/uploads/1987_Print_Media_005_May_11th_to_15th-WebSize.pdf", "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Faltermedzentrum.com%2Fim-jahr-1987-auf-der-titelseite-der-london-times-pocken-impfung-ausloeser-fuer-aids-virus%2F&t=Im+Jahr+1987+auf+der+Titelseite+der+London+Times%3A+%E2%80%9EPocken-Impfung+Ausl%C3%B6ser+f%C3%BCr+Aids-Virus%E2%80%9C", "https://api.whatsapp.com/send?text=Im%20Jahr%201987%20auf%20der%20Titelseite%20der%20London%20Times%3A%20%E2%80%9EPocken-Impfung%20Ausl%C3%B6ser%20f%C3%BCr%20Aids-Virus%E2%80%9C https%3A%2F%2Faltermedzentrum.com%2Fim-jahr-1987-auf-der-titelseite-der-london-times-pocken-impfung-ausloeser-fuer-aids-virus%2F", "https://www.instagram.com/", "https://altermedzentrum.com/im-jahr-1987-auf-der-titelseite-der-london-times-pocken-impfung-ausloeser-fuer-aids-virus/", "https://api.whatsapp.com/send?text=Im%20Jahr%201987%20auf%20der%20Titelseite%20der%20London%20Times%3A%20%E2%80%9EPocken-Impfung%20Ausl%C3%B6ser%20f%C3%BCr%20Aids-Virus%E2%80%9C https%3A%2F%2Faltermedzentrum.com%2Fim-jahr-1987-auf-der-titelseite-der-london-times-pocken-impfung-ausloeser-fuer-aids-virus%2F", "https://www.instagram.com/", "https://altermedzentrum.com/im-jahr-1987-auf-der-titelseite-der-london-times-pocken-impfung-ausloeser-fuer-aids-virus/"], "authors": [], "publish_date": "Juni 6, 2022"}