{"result_id": "016005", "URL": "https://altermedzentrum.com/impfstoffe-seit-30-jahren-nicht-mehr-kontrolliert-robert-kennedy-jr-gewinnt-prozess-gegen-die-regierung/", "timestamp": "2023-04-25 11:57:23 CEST+0200", "meta": {"description": "", "lang": "de", "keywords": "", "favicon": "https://altermedzentrum.com/wp-content/uploads/2018/10/cropped-ay-32x32.jpg", "canonical": "https://altermedzentrum.com/impfstoffe-seit-30-jahren-nicht-mehr-kontrolliert-robert-kennedy-jr-gewinnt-prozess-gegen-die-regierung/", "encoding": "UTF-8"}, "image": null, "domain": "altermedzentrum.com", "title": "Impfstoffe seit 30 Jahren nicht mehr kontrolliert: Robert Kennedy Jr. gewinnt Prozess gegen die Regierung!", "cleaned_text": "Impfstoffe seit 30 Jahren nicht mehr kontrolliert: Robert Kennedy Jr. gewinnt Prozess gegen die Regierung!\n\nDel Bigtree, Gründer des Informed Consent Action Network (ICAN), schloss sich mit Robert F. Kennedy Jr. zusammen, um gegen die US-Regierung Klage zu erheben. Sie verklagten das Ministerium für Gesundheitspflege und Soziale Dienste (HHS) wegen Impfschutzverletzungen und sie gewannen.\n\nDies sind wichtige Neuigkeiten für alle, die sich mit der Impfstoffsicherheit beschäftigen, denn es stellte sich heraus, dass die Bundesbehörde ihren Impfschutzverpflichtungen seit über 30 Jahren nicht Sachgerecht nachkam. Dieser wichtige Erfolg beweist, dass die Impfstoffsicherheit ein Betrug ist und primär Marketingzwecken dient.\n\nDie Klausel fordert das HHS ausserdem auf, dem Kongress alle zwei Jahre einen Bericht über Verbesserungen in diesen Bereichen vorzulegen. Berichten zufolge hatten RFK Jr. und ICAN den Verdacht, dass das HHS dieser Verantwortung nicht nachkam. Sie stellten entsprechend einen Antrag, um die Aufzeichnungen dieser zweijährlichen Berichte zu erhalten. Erwartungsgemäss versuchte das HHS acht Monate lang, die Anfrage zu blockieren und lehnte die Bereitstellung von Informationen kategorisch ab. Letztendlich musste eine Klage eingereicht werden.\n\nDas Gericht hielt fest: ICAN war daher gezwungen, eine Klage zu erheben, in der DHHS gezwungen wurde, dem Kongress entweder Kopien seiner zweijährigen Impfstoffsicherheitsberichte zur Verfügung zu stellen oder zuzugeben, dass diese Berichte niemals eingereicht wurden (Impfungen schaden – das wurde bereits 1971 offiziell bestätigt (Videos)).\n\nDas schockierende Ergebnis der Klage ist, dass HHS endlich zugeben musste, dass es dem Kongress keinen einzigen Bericht vorgelegt hat, in dem die Verbesserungen der Impfstoffsicherheit beschrieben werden. Dies spricht Bände für die Ernsthaftigkeit, mit der die Impfstoffsicherheit bei HHS behandelt wird und bekräftigt die Sorge, dass HHS keine Ahnung über das tatsächliche Sicherheitsprofil der Impfstoffe hat.\n\nAn diesem Beispiel erkennen wir, wie lasch und unwirksam die Behörden ihrer Kontrollpflicht nachkommen. In diesem Fall ging es um die Impfstoffsicherheit, die aufgrund der explodierenden Impfschäden sonst schon massiv in der Kritik steht.\n\nNebst Impfstoffen gibt es noch viele andere Pharmazeutika, die offensichtlich unzureichend geprüft werden. Sonst wären sie nämlich nicht die dritthäufigste Todesursache.\n\nDer Gipfel ist, dass pharmazeutische Medikamente meistens von den Herstellern selbst geprüft werden und brisante Studien nachweislich verheimlicht werden, wie beispielsweise beim Infanrix-Skandal, als unzählige Säuglinge aus wirtschaftlichen Gründen sterben mussten.\n\nDie Hersteller des Impfstoffs GlaxoSmithKline (GSK) gaben in einem vertraulichen Bericht an die Regulierungsbehörde bekannt, dass etwa 72 Babys innerhalb von 20 Tagen nach Infanrix hexa starben. Sie berichteten, dass der Tod dieser Kinder auf das plötzliche Kindstodsyndrom (Sudden Infant Death Syndrome – SIDS) und die plötzliche unerwartete Todesstörung (Sudden Unexpected Death Syndrome – SUDS) zurückzuführen war. Video\n\nEin italienischer Richter, Nicola Di Leo, hat jedoch angeordnet, dass die verheimlichte Studie zu veröffentlichen sei. Nun ist sie im Internet verfügbar: (http://autismoevaccini.files.wordpress.com). Die Analyse der Daten zeigt, dass mindestens 69 von 72 gemeldeten Todesfällen wahrscheinlich durch den Impfstoff verursacht wurden.\n\nInfanrix hexa kombiniert Impfstoffe gegen 6 Krankheiten [nämlich Diphtherie, Tetanus und Acelluar Pertusis (Keuchhusten), Hepatitis B, inaktivierte Poliomyelitis und Haemophilus Influenza Typ B] in einem einzigen Impfstoff.\n\nDer DPT-Impfstoff, Hepatitis B, Hib und injizierbare Polio wurden in der Vergangenheit getrennt verabreicht. Der neuere Kombinationsimpfstoff wird mit der Begründung gefördert, dass er die Anzahl der Injektionen für Babys reduziert. Die Sicherheit der Kombination wird jetzt in Frage gestellt.\n\nBesonders empörend ist in diesem Zusammenhang auch, dass die subventionierten Mainstream Medien diese brisanten Themen systematisch ausblenden. Dieses kriminelle Verhalten lässt sich unter anderem damit erklären, dass die Pharma Millionen für ihre zweifelhaften Werbekampagnen ausgibt.\n\nDie “Leitmedien” können es sich offensichtlich nicht leisten, ehrlich zu informieren. Stattdessen feiern sie Jens Spahn, der deutsche Bundesminister für Gesundheit, der Heilpraktiker-Therapien verbieten will.\n\nMenschen wie Robert F. Kennedy Jr., die ihre Macht sinnvoll nutzen und sich seit Jahren unermüdlich gegen die Korruption im Gesundheitswesen engagieren, damit weniger betuchte Menschen eine Chance auf Gerechtigkeit haben, sind die wahren Hoffnungsträger.\n\nWer seinem Kind eine Impfung trotzdem zumuten will, sollte zuerst abklären, wie es auf Pertussis-Toxoid, Tetanustoxoid, Diphtherietoxoid, Aluminiumphosphat, Aluminiumhydroxid, Formaldehyd, Neomycin, Polymyxin, VERO-Zellen (Affennierenzellen), Latex oder Hefe reagiert. Nebst dem Tod können Impfungen auch bleibende Schäden verursachen. In Anbetracht der vielen verheimlichten Studien dürfte die Dunkelziffer massiv alarmierender sein, als die bislang bekannten Fälle.", "opengraph": {"type": "article", "url": "https://altermedzentrum.com/impfstoffe-seit-30-jahren-nicht-mehr-kontrolliert-robert-kennedy-jr-gewinnt-prozess-gegen-die-regierung/", "title": "Impfstoffe seit 30 Jahren nicht mehr kontrolliert: Robert Kennedy Jr. gewinnt Prozess gegen die Regierung!", "description": "Del Bigtree, Gründer des Informed Consent Action Network (ICAN), schloss sich mit Robert F. Kennedy", "site_name": "altermed zentrum", "image": "https://altermedzentrum.com/wp-content/uploads/2018/11/ffrtt.jpg", "image:width": "640", "image:height": "350"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Faltermedzentrum.com%2Fimpfstoffe-seit-30-jahren-nicht-mehr-kontrolliert-robert-kennedy-jr-gewinnt-prozess-gegen-die-regierung%2F&t=Impfstoffe+seit+30+Jahren+nicht+mehr+kontrolliert%3A+Robert+Kennedy+Jr.+gewinnt+Prozess+gegen+die+Regierung%21", "https://www.law.cornell.edu/uscode/text/42/300aa-27", "http://icandecide.org/government/ICAN-HHS-Stipulated-Order-July-2018.pdf", "https://www.youtube.com/watch?v=yfaAtdTgBGk", "https://www.youtube.com/watch?v=rBMO1kE5s6E", "https://autismoevaccini.files.wordpress.com/2012/12/vaccin-dc3a9cc3a8s.pdf", "https://www.ncbi.nlm.nih.gov/pubmed/24004825#cm24004825_8656", "https://www.apotheken-umschau.de/Medikamente/Beipackzettel/INFANRIX-hexa-Fertigspr.Plv.u.Susp.z.H.e.Inj.Susp.-6340665.html", "https://www.pravda-tv.com/2018/11/impfstoffe-seit-30-jahren-nicht-mehr-kontrolliert-robert-kennedy-jr-gewinnt-prozess-gegen-die-regierung/", "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Faltermedzentrum.com%2Fimpfstoffe-seit-30-jahren-nicht-mehr-kontrolliert-robert-kennedy-jr-gewinnt-prozess-gegen-die-regierung%2F&t=Impfstoffe+seit+30+Jahren+nicht+mehr+kontrolliert%3A+Robert+Kennedy+Jr.+gewinnt+Prozess+gegen+die+Regierung%21", "https://api.whatsapp.com/send?text=Impfstoffe%20seit%2030%20Jahren%20nicht%20mehr%20kontrolliert%3A%20Robert%20Kennedy%20Jr.%20gewinnt%20Prozess%20gegen%20die%20Regierung%21 https%3A%2F%2Faltermedzentrum.com%2Fimpfstoffe-seit-30-jahren-nicht-mehr-kontrolliert-robert-kennedy-jr-gewinnt-prozess-gegen-die-regierung%2F", "https://www.instagram.com/", "https://altermedzentrum.com/impfstoffe-seit-30-jahren-nicht-mehr-kontrolliert-robert-kennedy-jr-gewinnt-prozess-gegen-die-regierung/", "https://api.whatsapp.com/send?text=Impfstoffe%20seit%2030%20Jahren%20nicht%20mehr%20kontrolliert%3A%20Robert%20Kennedy%20Jr.%20gewinnt%20Prozess%20gegen%20die%20Regierung%21 https%3A%2F%2Faltermedzentrum.com%2Fimpfstoffe-seit-30-jahren-nicht-mehr-kontrolliert-robert-kennedy-jr-gewinnt-prozess-gegen-die-regierung%2F", "https://www.instagram.com/", "https://altermedzentrum.com/impfstoffe-seit-30-jahren-nicht-mehr-kontrolliert-robert-kennedy-jr-gewinnt-prozess-gegen-die-regierung/"], "authors": [], "publish_date": "November 28, 2018"}