{"result_id": "016010", "URL": "https://altermedzentrum.com/impfen-27-zerschmetternde-fakten-ueber-die-pharmaindustrie-und-ihre-impfstoffe/", "timestamp": "2023-04-25 11:57:30 CEST+0200", "meta": {"description": "", "lang": "de", "keywords": "", "favicon": "https://altermedzentrum.com/wp-content/uploads/2018/10/cropped-ay-32x32.jpg", "canonical": "https://altermedzentrum.com/impfen-27-zerschmetternde-fakten-ueber-die-pharmaindustrie-und-ihre-impfstoffe/", "encoding": "UTF-8"}, "image": null, "domain": "altermedzentrum.com", "title": "Impfen: 27 zerschmetternde Fakten über die Pharmaindustrie und ihre Impfstoffe!!", "cleaned_text": "Impfen: 27 zerschmetternde Fakten über die Pharmaindustrie und ihre Impfstoffe!!\n\nWährend des jüngsten Masernausbruchs machten die Mainstream-Medien ausschließlich nicht geimpfte Kinder für die Epidemie verantwortlich, obwohl sich auch Geimpfte ansteckten und obwohl sich einige Impfstoffe in der Vergangenheit als unwirksam erwiesen. Völlig undifferenziert werden alle, die zögern, sich jeden Impfstoff verabreichen zu lassen, als »Impfgegner« bezeichnet.\n\nSie seien unverantwortlich und schlecht informiert, von irrationalen Ängsten getrieben und beriefen sich auf eine einzige »fehlerhafte« Studie von Andrew Wakefield, die Autismus mit Impfstoffen in Verbindung bringt. In Wirklichkeit sind viele so genannte »Impfgegner« gar nicht grundsätzlich gegen Impfstoffe. Es mag zwar Menschen geben, die Impfungen prinzipiell ablehnen, aber viele – auch Ärzte und Gesundheitsspezialisten – stellen nur bestimmte Impfstoffe, Inhaltsstoffe und/oder Impfpläne infrage. Diese Aussage basiert nicht auf einer Umfrage, sondern auf meinem eigenen Eindruck nach der Lektüre vieler Artikel über Impfstoffe und die Pharmaindustrie, die ich als Journalistin in den letzten fünf Jahren in die Hände bekam. Viele Ärzte und Gesundheitsspezialisten, die unabhängig nachgeforscht haben, stehen Impfungen kritisch gegenüber und stützen sich dabei auf wissenschaftliche Studien und handfeste Beweise.\n\nWarum sind die Medien so darauf erpicht, Menschen, die Big Pharma kritisieren, als verrückt, ungebildet, unwissenschaftlich oder unverantwortlich darzustellen? Dr. Marcia Agnell war 20 Jahre lang Redakteurin des New England Journal of Medicine. Sie wurde gefeuert, nachdem sie kritisierte, dass die Pharmaindustrie einen übermäßigen, negativen Einfluss auf die wissenschaftliche Literatur bekommen hatte. Sie schrieb:\n\nViele Journalisten sagen, dies gelte für die Mainstream-Medien ganz genauso. Wir präsentieren im Folgenden 27 Fakten, die nur einen Auszug aus unabhängigen wissenschaftlichen Untersuchungen und Artikeln über Impfstoffe und Pharmaindustrie darstellen.\n\nDarunter sind auch einige Mainstream-Artikel, als Beweis dafür, wie die Medien Storys übergehen, die sie in der Vergangenheit veröffentlicht haben, nur weil sie nicht in das Bild der angeblichen »Impfgegner« passen.\n\nDie Liste gibt einen Überblick über unabhängige Forschung und nennt Informationsquellen über Impfung und Big Pharma – die bei den Mainstream-Medien unter den Tisch fallen, weil die blind den Vorgaben und Absichten von Big Pharma folgen.\n\n1. In China kommt es zu Ausbrüchen von Masern, obwohl 99 Prozent geimpft sind.\n\nEine kürzlich auf PLoS [Public Library of Science] veröffentlichte Studie zum Thema »Schwierigkeiten bei der Ausrottung von Masern und der Eindämmung von Röteln und Mumps: eine Querschnittsstudie nach einer Erstimpfung gegen Masern und Röteln und einer zweiten Impfung gegen Masern, Mumps und Röteln«, zeigte, dass zwei Masernimpfstoffe (Masern-Röteln [MR] oder Masern-Mumps-Röteln [MMR]) völlig unwirksam waren. Beide erfüllten nicht das Versprechen, Ausbrüche bei einer Bevölkerung, die die empfohlenen Impfungen vornehmen lässt, zu verhindern. (»Warum kommt es in China zu Ausbrüchen von Masern, wenn 99% Prozent geimpft sind?«)\n\n2. Studie zeigt: Trotz obligatorischer Windpockenimpfung mehr Erkrankungen.\n\nDie Impfung gegen Windpocken ist in Südkorea seit 2005 Pflicht. Laut Gesetz müssen Kinder im Alter von zwölf bis 15 Monaten geimpft werden. 2011 wurde dies fast vollständig erfüllt, trotzdem gab es nicht weniger Windpockenpatienten; die Zahl ist sogar seit Erreichen der vorgesehenen Impfrate gestiegen.\n\nDie Zahl der Windpockenpatienten, die der koreanischen Gesundheits- und Seuchenschutzbehörde gemeldet wurde, ist von 22,6 Fällen pro 100 000 Einwohner im Jahr 2006 auf 71,6 Fälle pro 100 000 im Jahr 2011 gestiegen. Das ist ein gewaltiger Unterschied und der Beweis dafür, dass die Verbreitung der Krankheit durch das Impfprogramm nicht eingedämmt wird. (»Auch bei 97 Prozent Compliance verursacht der Windpockenimpfstoff noch Ausbrüche«), Natural Society, 8. Januar 2015.)\n\n3. Bei einem Masernausbruch in Québec (Kanada) im Jahr 2012 waren 50 Prozent der Erkrankten geimpfte Teenager.\n\nNachforschungen über den Ausbruch in einer Oberschule in einer Stadt, in der das Virus grassierte, ergaben, dass 50 Prozent der Erkrankten Teenager waren, die in der Kindheit die empfohlene zweifache Impfung erhalten hatten – mit anderen Worten: Teenager, die nach der Erwartung der Behörden eigentlich vor dem Masernvirus hätten geschützt sein sollen.\n\nGenerell geht man davon aus, dass der Masernimpfstoff bei einer zweimaligen Impfung in früher Kindheit zu 99 Prozent vor einer Maserninfektion schützt. Die Entdeckung, dass 52 der 98 an Masern erkrankten Kinder voll geimpft waren, war ein echter Schock für die Forscher, die die Untersuchung durchführten. (The Canadian Press, »Fragen zu Masern unter geimpften Kindern in Québec«)\n\nEine 1987 im New England Journal of Medicine (NEJM) veröffentlichte Studie dokumentierte einen Masernausbruch in der texanischen Stadt Corpus Christi vom Frühjahr 1985. In einer Schule hatten sich 14 geimpfte Jugendliche angesteckt, obwohl ihnen der MMR-Impfstoff gespritzt worden war. Wie die Forscher betonten, waren 99 Prozent ihrer Mitschüler – also praktisch alle – ebenfalls geimpft, bei über 95 Prozent von ihnen wurden Masern-Antikörper nachgewiesen. (Ethan A. Huff, »Masernausbruch unter vollständig immunisierten Kindern dokumentiert«)\n\n5. Die eigenen Zahlen der US-Gesundheits- und Seuchenschutzbehörde CDC (Centers for Disease Control and Prevention) weisen auf eine Verbindung zwischen Impfstoffen und plötzlichem Kindstod hin. Was passiert, wenn die Beweise aus der wissenschaftlichen und klinischen Literatur, die diese Behörde selbst herausgibt, ihrer eigenen Impfpolitik widersprechen?\n\nGenau das passierte nämlich mit der Veröffentlichung einer neuen Studie in der Zeitschrift Journal of Pediatrics:»Unerwünschte Zwischenfälle nach Verabreichung von Impfstoffen gegen Haemophilus influenzae Typ B im Vaccine Adverse Event Reporting System, 1990-2013«). Darin identifizieren die Forscher der US-Seuchenschutzbehörde und der Arzneimittelsicherheitsbehörde FDA (Food and Drug Administration) 749 Todesfälle im Zusammenhang mit der Verabreichung des HiB-Impfstoffs, 51 Prozent waren plötzlicher Kindstod im Zusammenhang mit einer HiB-Impfung. (Sayer Ji, »Eigene Daten der US-Gesundheitsbehörde zeigen Verbindungen zwischen Impfstoffen und Plötzlichem Kindstod(SIDS)«)\n\n6. Japan hat den MMR-Impfstoff 1993 verboten, »nachdem 1,8 Millionen Kinder zwei Arten von MMR erhalten hatten und eine Rekordzahl nicht-viraler Meningitis und anderer schwerer Reaktionen zu verzeichnen war«.\n\nKurz nach der Einführung des MMR-Impfstoffs im April 1989 stellte die japanische Regierung ein Problem fest; damals bestand eine Impfpflicht. Eltern, die eine Impfung verweigerten, wurden zu hohen Geldstrafen verurteilt.\n\nEine Analyse von Impfungen in einem Zeitraum von drei Monaten ergab, dass bei einem von 900 Kindern Probleme auftraten. Das war 2000 Mal mehr als die erwartete Rate von einem Kind unter 100 000 bis 200 000. (Jenny Hope, »Warum Japan den MMR-Impfstoff verbot«),\n\n7. Eine Studie kam zu dem Schluss: In Ländern, in denen mehr geimpft wird, ist die Kindersterblichkeit eher höher. Der Impfplan in den USA sieht für Kinder unter einem Jahr 26 Impfdosen vor, das ist der weltweit höchste Wert. Dennoch ist die Rate der Kindersterblichkeit in 33 Ländern niedriger.\n\nIn einigen Ländern ist die Kindersterblichkeit (IMR, nach dem englischen »Infant Mortality Rate«) nur halb so hoch wie in den USA: Singapur, Schweden und Japan liegen unter 2,80. Nach Angabe der US-Gesundheitsbehörde CDC (Centers for Disease Control and Prevention) »scheint sich die relative Position der Vereinigten Staaten im Vergleich zu Ländern mit der niedrigsten Kindersterblichkeit der Welt zu verschlechtern«.\n\nDiese Ergebnisse zeigen ein der Intuition widersprechendes Verhältnis: In Ländern, die mehr Impfungen verlangen, ist die Kindersterblichkeit tendenziell höher. (Neil Z. Miller und Gary S. Goldman, »Kindersterblichkeit sank im Verhältnis zu routinemäßig verabreichten Impfdosen: Hinweis auf eine biochemische oder synergistische Toxizität?«)\n\n8. In den USA existiert ein Impfgericht, das offenbar darauf angelegt ist, »Hersteller vor Haftungsansprüchen zu schützen«.\n\nJahrelang wollten die Medien nicht zugeben, dass es überhaupt existierte. Aber das spezielle Gerichtssystem, das über Impfschäden verhandeln – und sie letztendlich so schnell wie möglich unter den Teppich kehren – soll, wurde trotzdem zum Thema, weil Familienimpfgeschädigter Kinder nicht angemessen entschädigt wurden. (Ethan A. Huff, »Geheimnisvolles Impfgericht soll Hersteller vor Haftungsansprüchen schützen«)\n\n9. Der Wissenschaftler Dr. William Thompson gestand nicht nur Schwindel bei einer CDC-Studie von 2004, die den MMR-Impfstoff von allen Vorwürfen freisprach, sondern er behauptet auch, es gebe eine Verbindung zwischen Quecksilber (Thimerosal/Thiomersal) in Impfstoffen und Autismus. (Ethan Huff,»CDC-Wissenschaftler sagt, er würde seine schwangere Frau niemals gegen Grippe impfen, weil der Impfstoff Quecksilber enthält«)\n\n10. Schon 2002 kannte William Thompson die Ergebnisse von Studien, die den MMR-Impfstoff mit erhöhtem Autismusrisiko bei afroamerikanischen Kindern in Verbindung brachten. Der Aufsatz von Brian Hooker enthält eine Analyse von Daten der CDC, die ein um 340 Prozent erhöhtes Autismusrisiko bei afroamerikanischen Kindern nach einer MMR-Impfung zeigen. (Mike Adams, »Impfstoff-Skandal! Whistleblower bei der CDC enthüllt: Verbindung zwischen MMR-Impfstoffen und Autismus bei Afroamerikanern wurde vertuscht«)\n\n11. Nach Ansicht des CDC-Epidemiologen Tom Verstraeten, der die umfangreiche behördeneigene Datenbank der Krankengeschichten von 100 000 Kindern analysierte, war offenbar ein quecksilberbasierter Konservierungsstoff in den Impfstoffen – Thimerosal – für eine drastische Zunahme von Autismus und anderen neurologischen Störungen bei Kindern verantwortlich. (Robert F. Kennedy Jr,»Impfungen: Tödliche Immunität, Vertuschung eines Quecksilber/Autismus-Skandals durch die Regierung«)\n\n12. Anstatt die Öffentlichkeit umgehend zu warnen und Thimerosal aus Impfstoffen zu entfernen, haben Behörden und Direktoren [diskutiert], wie sie die belastenden Daten vertuschen konnten. (Ebenda.)\n\nDie CDC bezahlten das Institute of Medicine für eine neue Studie, um die Risiken von Thimerosal schönzureden, und wiesen die Forscher an, eine Verbindung der Substanz zu Autismus »auszuschließen«.\n\nVerstraetens Ergebnisse wurden von der Behörde zurückgehalten, obwohl sie eigentlich umgehend hatten veröffentlicht werden sollen. Anderen Wissenschaftlern wurde erzählt, seine Originaldaten seien »verlorengegangen« und könnten nicht wiederhergestellt werden. Und um das Gesetz auf das Recht auf Datenfreigabe zu umgehen, übergab die Behörde ihre riesige Datenbank mit Unterlagen über Impfungen an ein Privatunternehmen, zu dem die Forscher keinen Zugang bekamen. Als Verstraeten seine Studie 2003 endlich veröffentlichte, hatte er bereits eine Stelle beiGlaxoSmithKline angetreten und hatte die Daten so überarbeitet, dass die Verbindung zwischen Thimerosal und Autismus nicht mehr zu erkennen war.\n\n13. Seit 1991, als die CDC und die FDA empfahlen, extrem jungen Kindern drei zusätzliche Impfstoffe zu geben, die die Konservierungsstoffe enthielten […], war die geschätzte Zahl der Fälle von Autismus [2005] auf das 15-Fache gestiegen, von einem pro 2500 Kinder auf eines unter 166 Kindern. (Ebenda.)\n\nHier ist die CDC-Tabelle, die heute auf ihrer Website zu finden ist:\n\nEin MIT-Wissenschaftler hat Autismus mit Glyphosat in Verbindung gebracht, dem chemischen Unkrautkiller, der in Roundup von Monsanto verwendet wird.\n\n14. Impfstoffhersteller verkauften ihre quecksilberbelasteten Impfstoffbestände noch bis letztes Jahr [2004].\n\nCDC und FDA kauften die belasteten Impfstoffe für den Export in Entwicklungsländer und gestatteten Pharmafirmen, den Konservierungsstoff in einigen amerikanischen Impfstoffen auch weiterhin zu verwenden – darunter verschiedene Grippeimpfstoffe für Kinder und Impfstoffe für die Tetanus-Auffrischung, die routinemäßig an Elfjährige verabreicht werden. (Ebenda.)\n\n15. Bill Frist, der Mehrheitsführer im US-Senat, der von der Pharmaindustrie Spenden in Höhe von 873 000 Dollar erhalten hat, will Impfstoffhersteller in 4200 Gerichtsverfahren, die von den Eltern geschädigter Kinder angestrengt wurden, vor Haftungsansprüchen schützen.(Ebenda.)\n\n16. Impfstoffe gegen saisonale Grippe enthalten immer noch Thimerosal/Thiomersal.\n\nSchauen Sie sich die Produktbeschreibungen an. Zum Beispiel die über Vaxigrip von Sanofi Pasteur. Dort heißt es auf Seite 4 über den quecksilberbasierten Konservierungsstoff in ihrer Mehrfachampulle:\n\n17. Dr. Scott Reuben, ehemaliger Mitarbeiter im Büro des Firmensprechers von Pfizer, veröffentlichte in medizinischen Fachzeitschriften Dutzende gefälschte Studien.\n\n2005 erhielt Dr. Reuben von Pfizer 75 000 Dollar an Forschungsgeldern für eine Studie über Celebrex … Seine Arbeit, die in einer medizinischen Fachzeitschrift veröffentlicht wurde, wird seither von Hunderten anderer Ärzte und Forscher als »Beweis« dafür zitiert, dass Celebrex helfe, postoperative Schmerzen zu lindern. Kein Patient war je an dieser Studie beteiligt! Außerdem fälschte er Studiendaten über die Medikamente Bextra und Vioxx… Die von Experten begutachtete Medizinzeitschrift Anesthesia & Analgesia musste zehn von Reuben verfasste »wissenschaftliche« Aufsätze zurückziehen… 21 von Dr. Reuben geschriebene Artikel, die in medizinischen Zeitschriften veröffentlicht wurden, waren offenbar fingiert. (Mike Adams, »Big-Pharma-Forscher gibt zu, Dutzende Studien für Pfizer und Merck gefälscht zu haben (Meinung)«\n\n18. Bis heute wird Thimerosal in Grippeimpfstoffen verwendet.\n\nIn der Produktbeschreibung über Vaxigrip beispielsweise heißt es: »Die Mehrfachampulle dieses Impfstoffs enthält Thimerosal als Konservierungsstoff. Thimerosal wird mit allergischen Reaktionen in Zusammenhang gebracht.«\n\n19. Mindestens 97 Studien zeigen Verbindungen zwischen Impfstoffen und Autismus.\n\n20. Die CDC behaupten: »Es gibt keinen überzeugenden Beweis für Schäden durch die geringen Mengen von Thimerosal in Impfstoffen«, aber Gesundheitsbehörden »sind sich einig, dass Thimerosal in Impfstoffen vorsichtshalber reduziert oder ganz entfernt werden sollte«. Über Thimerosal schreiben die CDC auf ihrer Website:\n\n21. Bei von der Industrie gesponserten und in medizinischen Fachzeitschriften veröffentlichten Studien schneiden die Sponsoren immer gut ab.\n\n»Angesichts der Interessenkonflikte in der gesamten Branche ist es nicht verwunderlich, dass industriegesponserte Studien, die in medizinischen Fachzeitschriften veröffentlicht werden, für den Sponsor immer gut ausfallen – schon allein deswegen, weil negative Ergebnisse nicht veröffentlicht werden, positive dagegen wiederholt in leicht veränderter Form, und selbst negativen Ergebnissen wird ein positiver Anstrich gegeben.\n\nSo ergab eine Überprüfung von 74 klinischen Studien über Antidepressiva, dass 37 von 38 positiven Studien veröffentlicht wurden. Aber von den 36 negativen Studien wurden 33 entweder überhaupt nicht veröffentlicht, oder in einer Form, die wie ein positives Ergebnis wirkte.« – Maria Angell, MD. (Dr. Gary G. Kohls, »Vorsicht vor den Pharmafirmen, wie sie uns täuschen: ›Kritik an Big Pharma‹«)\n\n22. Fast die Hälfte aller in wissenschaftlichen Zeitschriften veröffentlichten Artikel enthalten falsche Ergebnisse. (Ebenda.)\n\n23. Bei den meisten medizinischen Fachzeitschriften stammt mindestens die Hälfte der Einnahmen aus Anzeigen oder von der Pharmaindustrie bestellten Nachdrucken. Dutzende andere [Zeitschriften] gehören Firmen wie Wolters Kluwer, einem Medizin-Verlag, der auch Marketingdienste für die Pharmaindustrie anbietet. – (Helen Epstein, Autorin von»Grippewarnung: Vorsicht vor den Pharmafirmen«).\n\n24. Auf der eigenen Website gibt die US-Arzneimittelsicherheitsbehörde FDA zu, dass die Medikamente, die sie als sicher zertifiziert, zu über 100 000 Todesfällen im Jahr beitragen.(»Korruption, Falschinformation and Vertuschen gesundheitlicher Gefahren«)\n\n25. Die FDA lässt regelmäßig Medikamente zu, obwohl ihre medizinischen Gutachter Einwände erheben. (Ebenda.)\n\n26. Die FDA führt keine eigenen unabhängigen medizinischen Tests durch.\n\nDas System ist auf Interessenkonflikten aufgebaut und lässt Verbraucher darüber im Dunkeln, welche Folgen die Einnahme der Big-Pharma-Produkte in Wirklichkeit haben kann. (Ebenda.)\n\n27. Im Jahr 2005 bekannte sich GlaxoSmithKline schuldig und zahlte drei Milliarden Dollar, um Betrugsvorwürfe beizulegen. Außerdem war das Unternehmen der Pflicht, Sicherheitsdaten zu übermitteln, nicht nachgekommen. Laut einer Mitteilung des US-Justizministeriums:", "opengraph": {"type": "article", "url": "https://altermedzentrum.com/impfen-27-zerschmetternde-fakten-ueber-die-pharmaindustrie-und-ihre-impfstoffe/", "title": "Impfen: 27 zerschmetternde Fakten über die Pharmaindustrie und ihre Impfstoffe!!", "description": "Während des jüngsten Masernausbruchs machten die Mainstream-Medien ausschließlich nicht geimpfte Kinder für die Epidemie verantwortlich,", "site_name": "altermed zentrum", "image": "https://altermedzentrum.com/wp-content/uploads/2020/09/xd39.jpg", "image:width": "630", "image:height": "350"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Faltermedzentrum.com%2Fimpfen-27-zerschmetternde-fakten-ueber-die-pharmaindustrie-und-ihre-impfstoffe%2F&t=Impfen%3A+27+zerschmetternde+Fakten+%C3%BCber+die+Pharmaindustrie+und+ihre+Impfstoffe%21%21", "http://www.globalresearch.ca/beware-the-drug-companies-how-the-deceive-us-criticizing-big-pharma/5431517", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3930734/", "http://www.greenmedinfo.com/anti-therapeutic-action/vaccination-mumps-measles-rubella-mmr", "http://info.kopp-verlag.de/medizin-und-gesundheit/natuerliches-heilen/sayer-ji/warum-kommt-es-in-china-zu-masern-ausbruechen-wenn-99-prozent-der-menschen-geimpft-sind-.html", "http://www.greenmedinfo.com/blog/chickenpox-vaccine-when-mandated-increases-disease-outbreak-south-korean-study-0", "http://www.globalresearch.ca/with-97-compliance-chicken-pox-vaccine-still-causes-outbreaks/5423535", "http://www.cbc.ca/news/health/story/2009/08/27/f-vaccines-childhood-school-immunization.html", "http://www.cbc.ca/news/health/measles-among-vaccinated-quebec-kids-questioned-1.1086151", "http://www.globalresearch.ca/measles-outbreak-documented-among-fully-immunized-group-of-children/5431567", "http://www.ncbi.nlm.nih.gov/pubmed/25598306", "http://www.globalresearch.ca/centers-for-disease-controls-cdc-own-data-shows-links-between-vaccines-and-sudden-infant-death-syndrome-sids/5426990", "http://www.dailymail.co.uk/health/article-17509/Why-Japan-banned-MMR-vaccine.html#ixzz3S328emMQ", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3170075/", "http://www.globalresearch.ca/secretive-vaccine-court-exposed-designed-to-shield-manufacturers-from-liability/5414964", "http://info.kopp-verlag.de/medizin-und-gesundheit/gesundes-leben/ethan-a-huff/cdc-wissenschaftler-sagt-er-wuerde-seine-schwangere-frau-niemals-gegen-grippe-impfen-weil-der-impf.html", "http://www.naturalnews.com/046535_mmr_vaccines_autism_cdc_whistleblower.html", "http://www.translationalneurodegeneration.com/content/3/1/16", "http://info.kopp-verlag.de/medizin-und-gesundheit/was-aerzte-ihnen-nicht-erzaehlen/mike-adams/impfstoff-skandal-whistleblower-bei-der-cdc-enthuellt-verbindung-zwischen-mmr-impfstoffen-und-auti.html", "http://www.globalresearch.ca/author/robert-f-kennedy-jr", "http://www.globalresearch.ca/vaccinations-deadly-immunity/14510?print=1", "https://de.sott.net/image/s11/231224/full/0000.jpg", "http://www.globalresearch.ca/monsanto-glyphosate-roundup-herbicide-triggers-autism-in-children-mit-scientist/5433023", "https://www.vaccineshoppecanada.com/document.cfm?file=vaxigrip_e.pdf", "https://plus.google.com/u/0/108002809946749848449?rel=author", "http://www.naturalnews.com/028194_Scott_Reuben_research_fraud.html", "https://www.vaccineshoppecanada.com/document.cfm?file=vaxigrip_e.pdf", "http://www.scribd.com/doc/220807175/86-Research-Papers-Supporting-the-Vaccine-Autism-Link#scribd", "http://www.cdc.gov/vaccinesafety/Concerns/thimerosal/", "http://www.globalresearch.ca/beware-the-drug-companies-how-the-deceive-us-criticizing-big-pharma/5431517", "http://aaci-india.org/COI/Flu_web_final.pdf", "http://www.fda.gov/Drugs/DevelopmentApprovalProcess/DevelopmentResources/DrugInteractionsLabeling/ucm114848.htm", "http://www.globalresearch.ca/constitutional-attorney-on-us-federal-drug-administration-fda-corruption-disinformation-and-cover-up-of-health-dangers/5430348", "http://www.globalresearch.ca/constitutional-attorney-on-us-federal-drug-administration-fda-corruption-disinformation-and-cover-up-of-health-dangers/5430348", "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Faltermedzentrum.com%2Fimpfen-27-zerschmetternde-fakten-ueber-die-pharmaindustrie-und-ihre-impfstoffe%2F&t=Impfen%3A+27+zerschmetternde+Fakten+%C3%BCber+die+Pharmaindustrie+und+ihre+Impfstoffe%21%21", "https://api.whatsapp.com/send?text=Impfen%3A%2027%20zerschmetternde%20Fakten%20%C3%BCber%20die%20Pharmaindustrie%20und%20ihre%20Impfstoffe%21%21 https%3A%2F%2Faltermedzentrum.com%2Fimpfen-27-zerschmetternde-fakten-ueber-die-pharmaindustrie-und-ihre-impfstoffe%2F", "https://www.instagram.com/", "https://altermedzentrum.com/impfen-27-zerschmetternde-fakten-ueber-die-pharmaindustrie-und-ihre-impfstoffe/", "https://api.whatsapp.com/send?text=Impfen%3A%2027%20zerschmetternde%20Fakten%20%C3%BCber%20die%20Pharmaindustrie%20und%20ihre%20Impfstoffe%21%21 https%3A%2F%2Faltermedzentrum.com%2Fimpfen-27-zerschmetternde-fakten-ueber-die-pharmaindustrie-und-ihre-impfstoffe%2F", "https://www.instagram.com/", "https://altermedzentrum.com/impfen-27-zerschmetternde-fakten-ueber-die-pharmaindustrie-und-ihre-impfstoffe/"], "authors": [], "publish_date": "September 28, 2020"}