{"result_id": "016002", "URL": "https://altermedzentrum.com/deutsche-studie-bye-bye-lauterbach-hirnschaeden-durch-long-covid/", "timestamp": "2023-04-25 11:57:21 CEST+0200", "meta": {"description": "", "lang": "de", "keywords": "", "favicon": "https://altermedzentrum.com/wp-content/uploads/2018/10/cropped-ay-32x32.jpg", "canonical": "https://altermedzentrum.com/deutsche-studie-bye-bye-lauterbach-hirnschaeden-durch-long-covid/", "encoding": "UTF-8"}, "image": null, "domain": "altermedzentrum.com", "title": "Deutsche Studie: Bye bye, Lauterbach?", "cleaned_text": "Die stetige Doppelmoral, mit der Ungesundheitsminister Karl Lauterbach die deutschen Bürger zu belehren versucht, mutet zunehmend peinlich an: Während Impfnebenwirkungen konsequent bagatellisiert werden, wird die Gefahr von Long Covid auf eine faktenferne Weise überdramatisiert, dass man eine unbehandelte Panikstörung dahinter vermuten könnte. Zuletzt behauptete Lauterbach, viele Menschen würden infolge von Covid-19 langfristig Hirnschädigungen durch Entzündungsvorgänge erleiden. Eine aktuelle Studie der Uni Duisburg-Essen widerspricht dieser Behauptung.\n\nVor Kurzem berichteten wir über eine neue Mainstream-Reportage, die Opfer von Impfnebenwirkungen zu Wort kommen ließ. Darin wurde nicht nur Karl Lauterbachs Verharmlosung von Impfnebenwirkungen gezeigt, die seiner Ansicht nach viel schwächer und unbedeutender sein sollen als Long Covid: Auch die Reaktionen der Betroffenen waren zu sehen. Diese Menschen waren erschüttert darüber, wie Deutschlands angeblicher Gesundheitsminister die Folgen der politisch auf undemokratischste Weise forcierten Impfkampagnen negierte – ganz so, als würde er in Wahrheit immer noch an seiner Lüge der “nebenwirkungsfreien” Impfung festhalten.\n\nDabei war schon bei den klinischen Studien der mRNA-Präparate ersichtlich, dass die Vakzine ein großes Potenzial schwerer Nebenwirkungen aufweisen: Eine aktuelle Analyse mit abgeschlossenem Peer Review, publiziert im Wissenschaftsmagazin “Vaccine”, weist darauf hin, dass das Risiko schwerer Reaktionen bei der Pfizer-Studie in der Gruppe der Impflinge um 36 Prozent höher lag als in der Placebo-Gruppe. Diese detaillierten Untersuchungen der verfügbaren Studiendaten kommen faktisch zwei Jahre zu spät – mit verheerenden Folgen für viele Impflinge. Schwere Nebenwirkungen wie Thrombosen und Myokarditis sind mittlerweile dennoch längst von offizieller Seite bestätigt worden und somit harte Fakten.\n\nWeit weniger überzeugend zeigen sich dagegen die Daten zu Long Covid, das laut Pseudo-Koryphäen wie Karl Lauterbach brandgefährlich sein soll und entsprechend als Rechtfertigung für nutzlose Freiheitseinschränkungen herhalten darf. Schon in der Vergangenheit wiesen Experten darauf hin, dass diese mutmaßliche Erkrankung übertrieben dargestellt wird – tatsächlich klagen sogar Menschen über Long Covid, die nie an Covid-19 erkrankt waren. Aus Deutschland weiß man mittlerweile, dass 96 Prozent der sogenannten Long Covid-Patienten unter Vorerkrankungen leiden und sich schon zuvor in ärztlicher Behandlung befanden: Das größte Risiko für Long Covid sind psychiatrische Erkrankungen, mahnen Neurologen.\n\nDas hinderte Karl Lauterbach nicht, am 29. August den folgenden Tweet abzusetzen:\n\nViele Menschen zwischen 20 und 50 Jahren (das ist die Klientel, für die die STIKO zu Lauterbachs Empörung noch keine Empfehlung für die Viertimpfung ausgesprochen hat) werden also unter neurologischen Beeinträchtigungen durch entzündetes Hirngewebe leiden, prophezeit er. Er bezieht sich dabei auf einen Artikel in der Washington Post, verfasst von einem Mediziner, der in einem Zentrum für Long Covid-, Deliriums-, und Depressionsforschung arbeitet (und für dieses wirbt). Diese Schwerpunkte sprechen wohl bereits Bände.\n\nWelche Daten legt der Artikel zugrunde? Der Autor behauptet beispielsweise freimütig, eine Studie hätte belegt, dass mindestens 12.5 Prozent aller Covid-Infizierten Long Covid bekämen – das beruht auf einer Fragebogenstudie aus den Niederlanden, die selbst im Abstract darauf hinweist, dass die von den Befragten selbst geschilderten Symptome vielleicht mit Covid zusammenhängen könnten. Bewiesen ist hier gar nichts. Auch weist der Mediziner auf eine Studie hin, bei der fest davon ausgegangen wird, dass Auffälligkeiten im Hirngewebe von fünf Leichnamen, die “an” Covid gestorben sein sollen, aber offenbar mehrheitlich Vorerkrankungen aufwiesen, rein auf SARS-CoV-2 zurückzuführen seien – und mehr noch, dass diese Befunde sich einfach so auf die Testdaten von Covid-infizierten Lebenden übertragen lassen, die kognitive Beeinträchtigungen zeigten. Derartig fragwürdige Methoden und Studien-Interpretationen ziehen sich wie ein roter Faden durch die Long Covid-Forschung.\n\nEine neue Studie der Universität Duisburg-Essen, publiziert am 26. August in “Neurology and Therapy”, verfolgte einen anderen Ansatz: Hier wurde eine Kohorte von 171 Patienten, die die Post-Covid-Konsenskriterien von WHO-Delphi erfüllten, umfassend neurologisch untersucht. Auch Anzeichen für Entzündungen wurden geprüft. Das (für Karl Lauterbach wohl überaus ernüchternde) Ergebnis: “Obwohl häufig von Patienten berichtet, ist eine objektivierbare Beeinflussung des Nervensystems beim Post-COVID-19-Syndrom selten. Stattdessen deuten erhöhte Somatisierungsgrade auf eine Pathogenese hin, die möglicherweise psychosomatische Faktoren einbezieht.” In Zahlen: Bei knapp 86 Prozent waren keine objektivierbaren pathologischen Befunde nachweisbar. Wenn doch, waren diese gewöhnlich auf andere zugrundeliegende Erkrankungen zurückzuführen. Das könnte Long Covid als psychosomatische Erkrankung entlarven – die Autoren weisen aber explizit darauf hin, dass selbstverständlich dennoch jeder Patient eingehend medizinisch untersucht werden sollte.\n\nDas Leid Betroffener soll durch derartige Studien nicht beschönigt werden: Auch psychosomatische Erkrankungen sind Krankheiten, die zu hohem Leidensdruck führen können. Allerdings bedarf eine psychosomatische Erkrankung einer anderen Therapie als eine neurologische Störung, die auf zugrundeliegende Hirnschädigungen zurückzuführen ist. Auch kann man einer psychosomatischen Störung keinesfalls mit massiver Impfpropaganda und dem Verhängen von für die Psyche schädlichen Maßnahmen beikommen: Im Gegenteil. Deutschlands Gesundheitsminister befördert mit seiner krankhaften Panikmache noch die Entstehung von psychischen Erkrankungen bei empfänglichen Bürgern.\n\nLauterbachs Argumentationsbasis ist lange zerplatzt, sein letzter Strohhalm in Form von Long Covid verloren. Der Hashtag #LauterbachRücktrittSofort trendet aus guten Gründen beinahe täglich auf Twitter: Auch Lauterbachs Beliebtheitswerte sind längst im Sinkflug. Seine Installation als Gesundheitsminister wurde seinerzeit gern als Folge seiner angeblichen Popularität bei den Bürgern betrachtet. Geht man danach, ist seine Absetzung nun tatsächlich überfällig…", "opengraph": {"type": "article", "url": "https://altermedzentrum.com/deutsche-studie-bye-bye-lauterbach-hirnschaeden-durch-long-covid/", "title": "Deutsche Studie: Bye bye, Lauterbach?", "description": "Die stetige Doppelmoral, mit der Ungesundheitsminister Karl Lauterbach die deutschen Bürger zu belehren versucht, mutet", "site_name": "altermed zentrum", "image": "https://altermedzentrum.com/wp-content/uploads/2022/09/hhfr-1024x576.jpg", "image:width": "1920", "image:height": "1080"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"de\">Nikolaus ist, wenn Wünsche erfüllt werden. Ihr wolltet ihn – ihr kriegt ihn.</p>\n<p>Gesundheitsminister <a href=\"https://twitter.com/Karl_Lauterbach?ref_src=twsrc%5Etfw\">@Karl_Lauterbach</a>! 💉</p>\n<p>— Kevin Kühnert (@KuehniKev) <a href=\"https://twitter.com/KuehniKev/status/1467784897221865476?ref_src=twsrc%5Etfw\">December 6, 2021</a></p></blockquote>\n"], "movies": [], "links": ["https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Faltermedzentrum.com%2Fdeutsche-studie-bye-bye-lauterbach-hirnschaeden-durch-long-covid%2F&t=Deutsche+Studie%3A+Bye+bye%2C+Lauterbach%3F", "https://dgn.org/neuronews/journal_club/post-covid-19-kaum-handfeste-befunde-trotz-subjektiver-neurologischer-beschwerden/", "https://report24.news/emotionale-mdr-reportage-zu-impfschaeden-betroffene-sind-erschuettert-ueber-karl-lauterbach/", "https://www.sciencedirect.com/science/article/pii/S0264410X22010283", "https://report24.news/neue-daten-belegen-gefahr-von-longcovid-wird-massiv-uebertrieben/", "https://report24.news/deutschland-fast-alle-long-covid-patienten-schon-vorher-in-behandlung/", "https://www.thelancet.com/action/showPdf?pii=S0140-6736(22)01214-4", "https://www.pnas.org/doi/10.1073/pnas.2200960119", "https://link.springer.com/article/10.1007/s40120-022-00395-z", "https://report24.news/hirnschaeden-durch-long-covid-deutsche-studie-zerlegt-lauterbach-panikmache/#", "https://clck.mgid.com/ghits/13996513/i/57669805/0/pp/1/1?h=FIrW009EEnMANKQjRWegsikFYBfKwHa0WkkvIxZdVrJT86sttCRXrwv9vsHQ5JjNvaWil2cpadELahYsMIZTRA**&rid=c46b9d75-2d2e-11ed-a97a-e43d1a2a04aa&tt=Direct&att=3&cpm=1&gbpp=1&abd=1&iv=11&ct=1&gdpr=1&consent=CPeQ1MAPeQ1MAAKArADECdCsAP_AAH_AAACYI8Nd_X__bW9j-_5_aft0eY1P9_r37uQzDhfNk-8F3L_W_LwX52E7NF36pq4KmR4Eu1LBIQNlHMHUDUmwaokVrzHsak2cpyNKJ7JEknMZOydYGF9Pn1tjuYKY7_5_9_bx2D-t_9_-39T378Xf3_dp_2_-_vCfV599jfn9fV_789KP9_78v-_8__________3_7BHYAkw1biALsyxwZtAwigRAjCsJCqBQAQUAwtEFgA4OCnZWAT6whYAIBQhGBECHEFGDAIABBIAkIgAkCLBAIgCIBAACABEAhAAxMAgsALAwCAAEA0LFEKAAQJCDIgIjlMCAqBIKCWysQSgr0NMIA6zwAoNEbFQAIkkBFICAkLBwDBEgJWLJA0xRvkAIwQoBRKgAAAAA.YAAAAAAAAAAA&st=120&mp4=1&k=1337404fcffYMOQF.gfYMOQMCQffODYx*DExNg%3D%3Df!fJjfR%3DfN*ffMzA5*DE2LjU%3Dffa8WKxAffof%3AfaHR0cHM6Ly9yZXBvcnQyNC5uZXdzL2hpcm5zY2hhZWRlbi1kdXJjaC1sb25nLWNvdmlkLWRldXRzY2hlLXN0dWRpZ%2416ZXJsZWd0LWxhdXRlcmJhY2gtcGFuaWttYWNoZ%248%3DfaHR0cHM6Ly9yZXBvcnQyNC5uZXdzLw%3D%3Dff%2BfODYx*DUzODZ8NjEx*DUzNzU%3DffMHwwf!fcfMTZ8MzA5*DYxMXwxMDU%3DfZAfOEfYMOQFp3f!fTW96aWxsY%2481LjAgKFdpbmRvd3MgTlQgMTAuMDsgV2luNjQ7IHg2NDsgcnY6MTA0LjApIEdlY2tvLzIwMTAwMTAxIEZpcmVmb3gvMTA0LjA%3DfUERGVmlld2Vy*ENocm9tZVBERlZpZXdlcnxDaHJvbWl1bVBERlZpZXdlcnxNaWNyb3NvZnRFZGdlUERGVmlld2Vy*FdlYktpdGJ1aWx0LWluUERGffV2luMzI%3DfMTIwfLTF8LTE%3DfMTYwMHw4NjA%3DfdW5rbm93bnx1bmtub3du*DA%3DfIfIfoff*f*(ImPmq~&crst=1662391446&wrst=1662391448&muid=m7pAvPtgmDwb", "https://clck.mgid.com/ghits/13996513/i/57669805/0/pp/1/1?h=FIrW009EEnMANKQjRWegsikFYBfKwHa0WkkvIxZdVrJT86sttCRXrwv9vsHQ5JjNvaWil2cpadELahYsMIZTRA**&rid=c46b9d75-2d2e-11ed-a97a-e43d1a2a04aa&tt=Direct&att=3&cpm=1&gbpp=1&abd=1&iv=11&ct=1&gdpr=1&consent=CPeQ1MAPeQ1MAAKArADECdCsAP_AAH_AAACYI8Nd_X__bW9j-_5_aft0eY1P9_r37uQzDhfNk-8F3L_W_LwX52E7NF36pq4KmR4Eu1LBIQNlHMHUDUmwaokVrzHsak2cpyNKJ7JEknMZOydYGF9Pn1tjuYKY7_5_9_bx2D-t_9_-39T378Xf3_dp_2_-_vCfV599jfn9fV_789KP9_78v-_8__________3_7BHYAkw1biALsyxwZtAwigRAjCsJCqBQAQUAwtEFgA4OCnZWAT6whYAIBQhGBECHEFGDAIABBIAkIgAkCLBAIgCIBAACABEAhAAxMAgsALAwCAAEA0LFEKAAQJCDIgIjlMCAqBIKCWysQSgr0NMIA6zwAoNEbFQAIkkBFICAkLBwDBEgJWLJA0xRvkAIwQoBRKgAAAAA.YAAAAAAAAAAA&st=120&mp4=1&muid=m7pAvPtgmDwb", "https://clck.mgid.com/ghits/13996513/i/57669805/0/pp/1/1?h=FIrW009EEnMANKQjRWegsikFYBfKwHa0WkkvIxZdVrJT86sttCRXrwv9vsHQ5JjNvaWil2cpadELahYsMIZTRA**&rid=c46b9d75-2d2e-11ed-a97a-e43d1a2a04aa&tt=Direct&att=3&cpm=1&gbpp=1&abd=1&iv=11&ct=1&gdpr=1&consent=CPeQ1MAPeQ1MAAKArADECdCsAP_AAH_AAACYI8Nd_X__bW9j-_5_aft0eY1P9_r37uQzDhfNk-8F3L_W_LwX52E7NF36pq4KmR4Eu1LBIQNlHMHUDUmwaokVrzHsak2cpyNKJ7JEknMZOydYGF9Pn1tjuYKY7_5_9_bx2D-t_9_-39T378Xf3_dp_2_-_vCfV599jfn9fV_789KP9_78v-_8__________3_7BHYAkw1biALsyxwZtAwigRAjCsJCqBQAQUAwtEFgA4OCnZWAT6whYAIBQhGBECHEFGDAIABBIAkIgAkCLBAIgCIBAACABEAhAAxMAgsALAwCAAEA0LFEKAAQJCDIgIjlMCAqBIKCWysQSgr0NMIA6zwAoNEbFQAIkkBFICAkLBwDBEgJWLJA0xRvkAIwQoBRKgAAAAA.YAAAAAAAAAAA&st=120&mp4=1&muid=m7pAvPtgmDwb", "https://www.focus.de/politik/insa-umfrage-lauterbach-jetzt-sogar-unbeliebter-als-scholz_id_137577887.html", "https://twitter.com/Karl_Lauterbach?ref_src=twsrc%5Etfw", "https://twitter.com/KuehniKev/status/1467784897221865476?ref_src=twsrc%5Etfw", "https://report24.news/hirnschaeden-durch-long-covid-deutsche-studie-zerlegt-lauterbach-panikmache/", "https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Faltermedzentrum.com%2Fdeutsche-studie-bye-bye-lauterbach-hirnschaeden-durch-long-covid%2F&t=Deutsche+Studie%3A+Bye+bye%2C+Lauterbach%3F", "https://api.whatsapp.com/send?text=Deutsche%20Studie%3A%20Bye%20bye%2C%20Lauterbach%3F https%3A%2F%2Faltermedzentrum.com%2Fdeutsche-studie-bye-bye-lauterbach-hirnschaeden-durch-long-covid%2F", "https://www.instagram.com/", "https://altermedzentrum.com/deutsche-studie-bye-bye-lauterbach-hirnschaeden-durch-long-covid/", "https://api.whatsapp.com/send?text=Deutsche%20Studie%3A%20Bye%20bye%2C%20Lauterbach%3F https%3A%2F%2Faltermedzentrum.com%2Fdeutsche-studie-bye-bye-lauterbach-hirnschaeden-durch-long-covid%2F", "https://www.instagram.com/", "https://altermedzentrum.com/deutsche-studie-bye-bye-lauterbach-hirnschaeden-durch-long-covid/"], "authors": [], "publish_date": "September 5, 2022"}