{"result_id": "016014", "URL": "https://translate.google.com/translate?hl=en&sl=de&u=https://altermedzentrum.com/impfungen-haben-keine-einzige-erkrankung-zum-verschwinden-gebracht/&prev=search&pto=aue", "timestamp": "2023-04-25 11:57:34 CEST+0200", "meta": {"description": "", "lang": "de", "keywords": "", "favicon": "https://altermedzentrum.com/wp-content/uploads/2018/10/cropped-ay-32x32.jpg", "canonical": "https://altermedzentrum.com/impfungen-haben-keine-einzige-erkrankung-zum-verschwinden-gebracht/", "encoding": "UTF-8"}, "image": null, "domain": "translate.google.com", "title": "„Impfungen haben keine einzige Erkrankung zum Verschwinden gebracht\"", "cleaned_text": "„Impfungen haben keine einzige Erkrankung zum Verschwinden gebracht”\n\nWas geschah wirklich in der Geschichte der Impfungen? Konnten die Pocken und Poliomyelitis tatsächlich nur mittels Impfung besiegt werden, oder hat dieses Narrativ viel mehr mit Lobbyismus und Pharmaindustrie zu tun? Wie liegt der Fall bei den Masern? Der Medizinhistoriker Dr. Gerd Reuther nimmt den Zuhörer in seinem Vortrag mit auf eine kleine Zeitreise und stellt dabei eine gänzlich andere Sichtweise als die in den Büchern vermittelte dar. Bilden Sie sich selbst ein Urteil …\n\nUniv. Doz. Dr. med. Gerd Reuther ist Facharzt für Radiologie und Buchautor. In seinen Werken\n\n… stellt er die Frage, ob tatsächlich immer aufwändigere Behandlungen nötig sind, um Krankheiten zu heilen und gesund alt zu werden – die Statistik zeigt, dass Medizin mehr Schäden als Erfolgsgeschichten verursacht. Er deckt auf, dass sie häufig nicht auf das langfristige Wohlergehen von Patienten abzielt, sondern in erster Linie bestrebt ist, die Kassen von Kliniken und Praxen zu füllen. Denn Ärzte, Apotheker und Pharmaindustrie wollten schon immer das Beste der Menschen – ihr Geld. Dabei werden gesundheitliche Schäden nicht nur billigend in Kauf genommen, sondern, wie etwa mit den Impfungen gegen Covid-19, auch absichtlich herbeigeführt. “Die Blutspur der Schulmedizin” zieht sich bis in die heutige Zeit, wobei speziell seit Entstehung der Pharmaindustrie das körpereigene Immunsystem von Ärzten zunehmend als lästige Konkurrenz betrachtet wird.\n• Dr. Gerd Reuther: Die Selbstheilung ist einfach kein Geschäftsmodell\n\nAnlässlich der Gesundheitstage der Gesellschaft für Gesundheitsberatung im Frühjahr 2021 beleuchtete Reuther nicht nur die Frage, ob Impfungen gegen Covid-19 das entscheidende Element für ein Ende der Corona-Pandemie und der mit ihr verbundenen Maßnahmen sein können. Der Medizinhistoriker analysierte die Vergangenheit der Impfungen per se, von ihren ersten Anfängen bis hin zu ihrem heutigen Status als vermeintliche Rettung vor den schwersten Seuchen.\n• „Impfungen haben keine einzige Erkrankung zum Verschwinden gebracht. Das wollen viele Menschen nicht wahrhaben, auch viele meiner Kollegen nicht. Aber die Fakten sind erdrückend. Jeder, der sich eine Stunde mit Impfungen beschäftigt hat, wird das feststellen.“\n• „Polio war eine Erfindung der Chemie-Industrie, um Schäden durch Pestizide zu verschleiern. Ein natürlicher Erreger musste dafür herhalten.“\n\nSehen Sie Dr. Reuthers Vortrag „Impfungen – Segen oder Fluch? Eine historische Perspektive“ auf der Webseite der GGB oder hier im Artikel. Er wird im Folgenden zusammengefasst wiedergegeben.\n\nDer Begriff des Impfens, erklärt Reuther, stammt ursprünglich aus dem Gartenbau: Man pfropft einer Pflanze etwas ein, um sie zu verändern. Der allgemeine Hauptgrund, weswegen geimpft wird – so hat das jeder im Kopf – ist die Verhütung infektiöser Krankheiten. Als jedoch Ende des 19. Jahrhunderts die Pharmaindustrie in das Impfen einstieg, kam bald auch die Therapie von Krankheiten auf den Plan: Geimpft wird, um eine vorhandene Erkrankung wie etwa Krebs oder Diabetes zu besiegen. Im Zuge von Corona kam der Ansatz aus dem Gartenbau auf die Agenda, nämlich ein Lebewesen durch die Impfung zu beeinflussen. Dies ist, so die Überzeugung des Radiologen, grundsätzlich abzulehnen.\n\nBei der Betrachtung des Impfens als Teil einer medizinischen Behandlung geht es um die Verhütung infektiöser Krankheiten. Dabei wird zwar pauschal von „Impfen“ gesprochen, jedoch bestehen sehr große Unterschiede.\n\nGeimpft wird durch die Gabe modifizierter Erreger, das heißt, von Erregern, die „irgendwie so abgeschwächt / modifiziert sein sollen, dass sie nicht mehr wirklich krank machen und vor allem keinen Tod produzieren können“, so Reuther. Oder man verabreicht keinen Erreger, sondern genetisches Material. Dieses soll dann im Impfling die Produktion von einzelnen Komponenten dieses Erregers bewerkstelligen, die dann wiederum als Reiz für eine Immunantwort zur Verfügung stehen: „Was bei dieser Differenzierung und bei dieser Diskussion jetzt auch der neuen Impfstoffe nicht wirklich gesagt wird, ist, dass wir von einer ganz unterschiedlichen Risikokategorie reden.\n\nWarum? Weil die Gabe der modifizierten Erreger, wie wir sie jetzt die letzten, sagen wir, 150 Jahre gekannt haben – das ist die Gabe von Material in unseren Extrazellulärraum. Das heißt, das Gewebewasser zwischen den Zellen. Und es kommt nichts in die Zellen. Und damit haben wir natürlich ein geringeres Risikopotenzial, als wenn Stoffe in das intrazelluläre Wasser, in unsere Zellen hineinkommen. Und das wird ja bewusst gewünscht bei diesen mRNA-Impfstoffen. Die müssen dort hinein kommen, weil nur in der Zelle die genetische Information, die man transferiert, abgelesen werden kann. Wir befinden uns plötzlich im Inneren einer Zelle. Da kann einfach viel mehr passieren.“\n\nDie Impfstoffe gegen Covid-19 wurden lediglich bedingt zugelassen. Eine Vollzulassung kann es nur geben, wenn entsprechende Daten zur Produktsicherheit von den Herstellern in ein, zwei, drei Jahren nachgeliefert werden. Das, so Reuther, sollte man wissen.\n\nImpfungen stehen der Homöopathie näher als der Allopathie\n\nImpfungen gelten als Klassiker der Schulmedizin. Sie zählen zur Allopathie wie etwa Chemotherapie, Schmerztherapie und dergleichen. „Aber wenn wir es uns genau anschauen“, macht Reuther aufmerksam, „sind die Impfungen nichts, was zur Allopathie passt. Denn die Allopathie behandelt üblicherweise ohne oder sogar gegen die körpereigene Abwehr. Während das, was die Impfungen machen – einen Reiz setzen, um die körpereigene Abwehr zu stimulieren, zumindest in der Planung, eigentlich homöopathisch ist. (…) Wir geben eine Information, die die körpereigene Gegenkraft stimuliert.“ Dies wurde bereits vom deutschen Arzt und Begründer der Homöopathie, Samuel Hahnemann, so formuliert. Er setzte sogenannte Nosoden – Krankheitserreger in einer sehr hohen Verdünnung, die zu einer Stärkung des Immunsystems führen sollten – ein.\n\nDer Haupterreger im Impfstoff – nur unwirksames Kürprogramm?\n\nBei der Hormesis handelt es sich um eine Theorie, die davon ausgeht, dass Gesundheit durch die Aufnahme von Giften in geringer Menge gestärkt wird, weil man dadurch gegen sie resistent werden kann. Im weitesten Sinn, beschreibt Reuther, ist das Prinzip des Impfens ein Teil davon. Jedem Impfstoff sind biologisch inkompatible, nicht abbaubare Substanzen, sogenannte Adjuvantien bzw. Hilfsstoffe hinzugefügt. Beispielsweise Aluminiumhydroxid, Polysorbat 80 oder auch „andere Partikel, die vor wenigen Jahren italienische Forscher im Elektronenmikroskop gefunden haben und die sie zugeordnet haben, als wären das Partikel aus Müllverbrennungsanlagen. Also tatsächlich giftiges Material, was zusätzlich mit den Impfstoffen eingebracht wird, und Impfstoffhersteller konzidieren auch, dass ohne dieses giftige Material, was ja von Impfgegnern immer wieder kritisiert wird, die Impfungen gar nicht wirken würden. Und deswegen natürlich die Frage auch entstehen muss: Wenn wir sehr viele spezifische Impfstoffe haben, wirkt da eigentlich immer nur dieses kleine Arsenal von Giftsubstanzen, was beigemengt ist? Und ist der Haupterreger, den man beigibt, eigentlich nur ein Kürprogramm?“ Es lohnt, ist der Radiologe überzeugt, darüber nachzudenken und fügt hinzu, dass auch die neuartigen Covid-Impfstoffe Hilfsstoffe enthalten. Und zwar – trotz des völlig unterschiedlichen Prinzips – die gleichen, wie den klassischen Impfstoffen bisher beigegeben wurden.\n\nAls Impfziele werden stets zum einen die möglichst langanhaltende Immunisierung gegen eine Infektionskrankheit, sowie zum anderen die Prävention der Weitergabe eines Erregers angeführt.\n\nBeide wurden jedoch in den Zulassungsstudien der Hersteller der Covid-Impfstoffe gar nicht untersucht. Sie können, so Reuther, derzeit nicht beantwortet werden, obwohl es eigentlich die Hauptziele der klassischen Impfstoffe sind: „Und auch in der Geschichte werden wir sehen, ist es nicht so, dass selbstverständlich diese Ziele immer erfüllt würden. Mehr oder weniger häufig werden die gar nicht erfüllt und trotzdem gelten diese Substanzen als Impfstoffe.“\n\nSeuchenbeseitigung durch Impfungen? Kann so nicht stimmen.\n\nBei Impfungen handelt es sich um ein bewährtes Verfahren, heißt es, weil es Impfungen bereits relativ lange gibt, so der Medizinhistoriker. Man spricht von einer in Europa 300 Jahre zurückreichenden Tradition, wobei sich allerdings die Art des Impfens erheblich geändert hat. Aus diesem Grund ist besagte 300-jährige Tradition für keinen einzigen Impfstoff gegeben.\n\nDen Anfang machten die Pocken – zunächst ging es ausschließlich um die Pockenimpfung. 1721 Inokulation mit Pockenlymphe, gefolgt von der auf den englischen Landarzt Edward Jenner zurückgehende Vakzination mit Kuhpockenlymphe (1796). Ohne dass weitere Impfungen hinzukamen, wurde am 1. April 1875 das Deutsche Reichsimpfgesetz erlassen. Nach der Entdeckung von Krankheitserregern 1884 kam ein Impfstoff gegen Cholera hinzu. Reuther: „Der allerdings, als es zu einer Cholera-Epidemie 1892 in Hamburg kam, offensichtlich keinerlei Wirkung entfalten konnte und auf den auch gar nicht gesetzt wurde.“ Es folgte 1894 ein Impfstoff gegen die Pest, der jedoch erst viele Jahrzehnte später zum Einsatz kam. Gegen Diphtherie gab es bereits gegen Ende der 1890-er Jahre eine passive Immunisierung, der eigentliche aktive Impfstoff kam erst 1923 zur Anwendung.\n\nReuther: „Sie sehen bei dieser Abfolge, dass, wenn es häufig heißt, die Seuchen im 19. Jahrhundert seien zunehmend durch die Impfungen beseitigt worden, das nicht so ganz stimmen kann. Außer der Pockenimpfung sind ja diese Impfungen erst so langsam fabriziert worden. Die standen also gar nicht zur Verfügung. Und deswegen, wenn man sich so eine Kurve anschaut – Zahlenmaterial aus dem 19. Jahrhundert ist ja meistens schwierig – das ist eine Statistik der Stadt Wien, wo der Verlauf von Sterbefällen an Pocken, Typhus und Cholera eingezeichnet ist …\n\n… dass Sie sehen, dass es immer wieder Spitzen der Sterblichkeit gab. Und das heißt, es gab immer wieder Epidemien an Pocken. Und zwar nach 1800 etwas weniger, aber Typhus und Cholera ist immer wieder aufgetreten. Und wenn es zum Schluss des Jahrhunderts nach 1875 weniger geworden ist, dann kann man auch nicht automatisch eine Kausalität mit den Impfungen daraus ableiten. Erstens mal, weil eben Typhus – und Choleraimpfungen zu dem Zeitpunkt noch gar nicht funktioniert hatten. Sondern auch, weil es ja andere wichtige Maßnahmen gab. Der Ernährungs– und Gesundheitszustand der Bevölkerung ist besser geworden. Es gab Kanalisationen und es gab eben Wasserleitungen, die sauberes Trinkwasser auch in die Großstädte transportiert haben. Und das waren die wesentlichen Faktoren, die eigentlich zu einem Verschwinden dieser Seuchen geführt haben, bevor die Impfungen so Anfang Mitte des 20. Jahrhunderts allmählich überhaupt weitere Verbreitung fanden.“ Den ersten Impfstoff gab es doch meistens deutlich früher als seine breite Anwendung:\n\nGegen eine „Geißel der Menschheit“, wie die Lungentuberkulose bisweilen genannt wird, gibt es bis heute keinen wirksamen Impfstoff. Und trotzdem spielt die Tuberkulose seit vielen Jahrzehnten eigentlich keine Rolle – jedenfalls nicht in den Industrieländern. Deswegen lohnt es, so Reuther, den Verlauf, die Häufigkeit von Erkrankungen und die Sterblichkeit gemeinsam mit der Einführung der Impfungen zu betrachten.\n\nBereits vor Einführung der Masern-Impfung wurde nicht mehr an Masern gestorben\n\nDie Masern gelten dabei als Klassiker. Der Impfstoff wurde 1963 in den USA lizensiert und im Verlauf der späten 1960er / 1970er Jahre in den Industrieländern nahezu bevölkerungsweit eingeführt. Angeblich ist er maßgeblich dafür verantwortlich, dass die Masern heutzutage dort eine seltene Kinderkrankheit sind. Reuther: „Wenn man sich diese Grafik von 1950 bis 1992 ansieht, kann man durchaus zum Eindruck kommen, dass zwar die Zahlen vorher schon etwas zurückgegangen sind, aber so der entscheidende Schwung eigentlich erst mit der Lizenzierung des Masernimpfstoffs kam. Blenden wir aber auch da mal die Zeitachse ein bisschen weiter zurück, dann sehen wir, dass die Sterblichkeit vorher massiv höher gewesen ist. Oder nochmals etwas weiter zurück – dass die Spritze mit der Einführung der Impfung zu einem Zeitpunkt kam, als die Sterblichkeit schon fast an der Nulllinie war. Der Rückgang der Sterblichkeit an Masern hat vor der Einführung bereits 98,5% betragen.“\n\n„Und trotzdem“, fährt der Medizinhistoriker fort, „ist es in den Köpfen vieler Menschen immer noch verankert, dass die Masern deswegen heute keine Rolle spielen, weil wir impfen. Aber es stimmt einfach nicht. Es ist auch kein amerikanisches Phänomen. Diese Zahlen gibt’s auch für Deutschland.“\n\nDie Einführung der Impfung geschah dort um 1972 / 73. Und hier kann bereits vorher ein drastischer Abfall der Zahlen beobachtet werden. Dr. med. Gerhard Buchwald (Autor des Buches „Impfen. Das Geschäft mit der Angst“; Anm. d. Red.) arbeitete zudem heraus, dass dieser Abfall mathematisch betrachtet eigentlich hätte schneller ablaufen müssen bzw. sich nach Einführung der Impfung eher verlangsamte. Der Rückgang der Masernsterblichkeit in Deutschland von 1906-1972, notiert Reuther, betrug vor Einführung der Impfung bereits 99,6 Prozent.\n\nEinführung der Masern-Impfpflicht ist nur durch Impflobbyismus zu erklären\n\nDennoch wurde 2020 die Masernimpfpflicht eingeführt. „Und wenn wir uns die Zahlen anschauen von 2001 bis jetzt, dann sehen wir einen drastischen Rückgang der Masernfälle von 6.000 auf 123 im Jahr 2004.“\n\nDas bedeutet, dass in den letzten Jahren die Zahl der Masernfälle ohnehin drastisch niedrig war und somit durch eine Impfpflicht kaum mehr zu verringern ist. „Es ist keine wirklich rationale Überlegung, die man aus diesem Kurvenverlauf ableiten kann, sondern das ist etwas, das man tatsächlich nur durch Impflobbyismus erklären kann“, betont Reuther. Dieser Impflobbyismus kommt die Gesellschaft nicht zuletzt auch wegen der Schäden teuer zu stehen. Diese werden vergleichsweise immer größer, je geringer der Nutzen ist. Und der Nutzen ist dann gering, wenn die Erkrankung selten ist. Bei den Masern lässt sich, so der Radiologe, das sehr einfach vorrechnen:\n\n„Wir haben 500 Masernfälle pro Jahr. Dazu sollte man wissen, dass von den 500 Fällen nur die Hälfte etwa bei Kindern auftritt. 250 sind ältere Jugendliche und Erwachsene, die von einer Impfpflicht gar nicht erfasst werden. Also man kann nur 250 Fälle pro Jahr bei Kindern verhindern. Nach den Zahlen des RKI ein Todesfall pro 1000 Erkrankungen – bedeutet ein kindlicher Todesfall alle vier Jahre. Um diesen einen Todesfall zu verhindern, müssen wir vier Jahre lang alle Neugeborenen – das sind etwa 800.000 in D – impfen. Unter der Voraussetzung, dass der Impfstoff tatsächlich einen Impfschutz von 100% hätte. Was nicht mal das RKI behauptet. Und 4 x 800.000 sind 3,2 Millionen Impfungen. Und selbst Impfbefürworter geben zu, dass gut verträgliche Impfungen zu mindestens einem Todesfall pro einer Million Impfungen führen. Das wären dann mindestens drei Todesfälle in den vier Jahren, um einen einzigen Todesfall durch Masern zu verhindern. Sie sehen, die Bilanz kann gar nicht stimmen. Und es ist völlig irrational oder eben nur durch Lobbyismus zu erklären, dass man hier eine Masernimpfpflicht eingeführt hat. Und das gilt nicht nur für die Masern, sondern diese Relationen gelten natürlich auch für Mumps, Diphtherie, Röteln, Hämophilus influenzae B“, führt Reuther aus.\n\n„Das sind alles Erkrankungen mit einer Häufigkeit, die kleiner als 100.000 ist. Und damit kann eine populationsweite Impfung keinen Nutzen, sondern ausschließlich Schaden bringen. Die Hepatitis B ist ein bisschen häufiger, aber die ist bei Kindern kein Thema. Keuchhusten bisschen häufiger. Und auf die Poliomyelitis gehe ich nachher noch ein“, so der Radiologe.\n\nDie Impfungen können Todesfälle bei Kindern nicht verhindern\n\nFür zahlreiche Erkrankungen, die viel häufiger sind und auch Kinder betreffen, existieren hingegen keine Impfstoffe. Im Gegensatz zu den Bestrebungen bei Covid-19 werden bei diesen auch keine großen Anstrengungen unternommen, welche zu entwickeln. Weder besteht diesbezüglich ein Wettbewerb, noch stellt die Bundesregierung nennenswerte Mittel zur Verfügung. Man erinnere sich, so Reuther, an EHEC vor einiger Zeit: „Das ging dann auch wieder mal vorbei und niemand hat weiter darüber geredet.“ Zu beachten ist auch, dass sich 93 Prozent der Sterbefälle bei Kindern in der EU trotz des empfohlenen Impfstatus ereignen – also obwohl die Kinder den im Land jeweils vorgeschriebenen Impfstatus hatten. Das bedeutet, dass die Impfungen diese 93 Prozent Todesfälle nicht verhindern, betont er. Abseits der sich bereits jetzt ergebenden Fragen und Widersprüche empfiehlt es sich, in der Geschichte zurückzugehen und speziell die Pocken und die Poliomyelitis zu betrachten. Die Impfstoffe gegen diese beiden Erkrankungen gelten als besonders große Impferfolge und haben, so das Narrativ, schlagartig zu einer weitgehenden Beseitigung dieser Krankheiten geführt. Beleuchtet werden folgende Fragen:\n\nAls die Pockenimpfung lukrativ wurde, wandelten sich Ärzte von Impfgegnern zu Impfbefürwortern\n\nDie Pocken waren der Beginn des Impfens und sind eine sehr erschreckende Erkrankung. Angst, so Reuther, hatte man gar nicht so sehr vor dem Sterben, sondern vor einer bleibenden Entstellung. Die Narben entstellen den Betroffenen ein Leben lang, vor allem bei Frauen wurde dadurch der „Marktwert“ gesenkt: „Da wurden ja auch viele Frauen zum Beispiel im Bereich des Vorderen Orients, Kaukasus, in den Harem abgegeben. Da war natürlich makellose Schönheit gefragt.“ Hinzukommt, dass man auch erblinden konnte.\n\nLange vor den Europäern wurde bereits von Naturvölkern versucht, Impfungen gegen Pocken einzuführen. Es handelte sich um keine ärztliche Aktivität, sondern wurde von den Menschen selbst durchgeführt. Die Bläschen bei Pockenerkrankten wurden angestochen und dieses Material vorsichtig zur Verimpfung in die Haut eingeritzt. Meistens erledigten dies spezialisierte Großmütter. Man wusste, dass die Pocken sehr ansteckend sind und dass man sich auch an Stoffen infizieren kann. Entsprechend wurden die Menschen, um sie gegen Pocken zu immunisieren, in die Bettwäsche oder Kleidung von Erkrankten gehüllt. „Dass das nicht immer gut ausgegangen ist, kann man sich vorstellen. (…) Einige Prozent derjenigen, die auf diese Art und Weise geimpft hat, haben das nicht überlebt“, notiert Reuther.\n\nDennoch scheint die Quote so weit erfolgreich gewesen zu sein, dass sich diese Methoden verbreiteten. Lady Mary Wortley Montagu, die Gattin des englischen Botschafters in Konstantinopel – sie erkrankte als Kind auch an Pocken, das Gemälde ist geschönt – brachte sie nach England.\n\nDabei stieß sie, führt der Medizinhistoriker aus, „erst mal auf großen Widerstand, vor allem bei der Ärzteschaft. (…) Die Ärzte waren erst mal keine Impfbefürworter, sondern waren Impfgegner gewesen, weil sie gefürchtet haben, dass sie dann viele Dienstleistungen, die sie bei Pockenkranken erbracht haben, nicht mehr erbringen können. Ganz nüchtern.“ Als sich jedoch die vornehmen Kreise für die Immunisierung gegen Pocken zunehmend erwärmen konnten, wurde ein gewisser Durchbruch erzielt. Die Mitglieder des englischen Königshauses ließen sich impfen bzw. inokulieren. Nachdem bereits eine einzelne Inokulation sehr lukrativ war – sie wurde mit einem Adelstitel und 10.000 Pfund abgegolten – begann auch die Ärzteschaft, sich dafür stark zu machen.“ Zunächst wurde nicht flächendeckend, sondern nur bei Epidemien immunisiert. „Was ja auch sehr verständlich war, denn die Bedrohung war ganz klar. Man konnte auch an dieser Inokulation versterben, obwohl man nie die Pocken bekommen hätte. Und das ohne Bedrohungsszenario einer Epidemie – da fand sich kaum jemand bereit“, so Reuther. Als in Amerika 1721 zum wiederholten Mal die Pocken mit einem Schiff in Boston angelandet sind, inokulierten zwei Ärzte, denen die Methode aus England bekannt war, jenen Teil der Menschen, die das wünschten. Damit hatte man das erste Mal in der Medizin eine statistische Auswertung einer medizinischen Maßnahme, weil die beiden Ärzte auch in Rechtfertigungspflicht standen.", "opengraph": {"type": "article", "url": "https://altermedzentrum.com/impfungen-haben-keine-einzige-erkrankung-zum-verschwinden-gebracht/", "title": "„Impfungen haben keine einzige Erkrankung zum Verschwinden gebracht\"", "description": "Was geschah wirklich in der Geschichte der Impfungen? Konnten die Pocken und Poliomyelitis tatsächlich nur", "site_name": "altermed zentrum", "image": "https://altermedzentrum.com/wp-content/uploads/2022/07/3et67-1024x576.jpg", "image:width": "1280", "image:height": "720"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe loading=\"lazy\" title=\"YouTube video player\" src=\"https://www.youtube.com/embed/pVxGyEMmj38\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"\" data-mce-fragment=\"1\"/>", "src": "https://www.youtube.com/embed/pVxGyEMmj38"}], "links": ["https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://www.facebook.com/sharer/sharer.php?u%3Dhttps%253A%252F%252Faltermedzentrum.com%252Fimpfungen-haben-keine-einzige-erkrankung-zum-verschwinden-gebracht%252F%26t%3D%25E2%2580%259EImpfungen%2Bhaben%2Bkeine%2Beinzige%2BErkrankung%2Bzum%2BVerschwinden%2Bgebracht%2522", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://report24.news/dr-gerd-reuther-die-medizin-strebt-gesundheitsschaeden-von-patienten-bewusst-an", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://report24.news/dr-gerd-reuther-die-selbstheilung-ist-einfach-kein-geschaeftsmodell", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://gesundheitsberater.de/", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://gesundheitsberater.de/impfungen-segen-oder-fluch-univ-doz-wien-dr-med-gerd-reuther", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://youtu.be/pVxGyEMmj38", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://youtu.be/pVxGyEMmj38", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://de.m.wikipedia.org/wiki/Samuel_Hahnemann", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://www.deutsche-apotheker-zeitung.de/daz-az/2007/daz-19-2007/nosoden-in-der-isopathie-und-homoeopathie", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://youtu.be/pVxGyEMmj38", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://de.m.wikipedia.org/wiki/Hormesis", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://de.m.wikipedia.org/wiki/Aluminiumhydroxid", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://de.m.wikipedia.org/wiki/Polysorbat_80", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://youtu.be/pVxGyEMmj38", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://youtu.be/pVxGyEMmj38", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://de.m.wikipedia.org/wiki/Edward_Jenner", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://youtu.be/pVxGyEMmj38", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://youtu.be/pVxGyEMmj38", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://youtu.be/pVxGyEMmj38", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://youtu.be/pVxGyEMmj38", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://gesundheitsberater.de/zum-tod-von-dr-med-gerhard-buchwald-1920-2009", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://www.thalia.at/shop/home/artikeldetails/A1001069173", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://youtu.be/pVxGyEMmj38", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://youtu.be/pVxGyEMmj38", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://youtu.be/pVxGyEMmj38", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://youtu.be/pVxGyEMmj38", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://youtu.be/pVxGyEMmj38", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://youtu.be/pVxGyEMmj38", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://youtu.be/pVxGyEMmj38", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://youtu.be/pVxGyEMmj38", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://de.m.wikipedia.org/wiki/Mary_Wortley_Montagu", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://youtu.be/pVxGyEMmj38", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://youtu.be/pVxGyEMmj38", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://report24.news/dr-gerd-reuther-impfungen-haben-keine-einzige-erkrankung-zum-verschwinden-gebracht/", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://report24.news/dr-gerd-reuther-impfungen-haben-keine-einzige-erkrankung-zum-verschwinden-gebracht/", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://www.facebook.com/sharer/sharer.php?u%3Dhttps%253A%252F%252Faltermedzentrum.com%252Fimpfungen-haben-keine-einzige-erkrankung-zum-verschwinden-gebracht%252F%26t%3D%25E2%2580%259EImpfungen%2Bhaben%2Bkeine%2Beinzige%2BErkrankung%2Bzum%2BVerschwinden%2Bgebracht%2522", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://api.whatsapp.com/send?text%3D%25E2%2580%259EImpfungen%2520haben%2520keine%2520einzige%2520Erkrankung%2520zum%2520Verschwinden%2520gebracht%2522+https%253A%252F%252Faltermedzentrum.com%252Fimpfungen-haben-keine-einzige-erkrankung-zum-verschwinden-gebracht%252F", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://www.instagram.com/", "https://altermedzentrum-com.translate.goog/impfungen-haben-keine-einzige-erkrankung-zum-verschwinden-gebracht/?_x_tr_sl=de&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://api.whatsapp.com/send?text%3D%25E2%2580%259EImpfungen%2520haben%2520keine%2520einzige%2520Erkrankung%2520zum%2520Verschwinden%2520gebracht%2522+https%253A%252F%252Faltermedzentrum.com%252Fimpfungen-haben-keine-einzige-erkrankung-zum-verschwinden-gebracht%252F", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://www.instagram.com/", "https://altermedzentrum-com.translate.goog/impfungen-haben-keine-einzige-erkrankung-zum-verschwinden-gebracht/?_x_tr_sl=de&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc"], "authors": [], "publish_date": "Juli 14, 2022"}