{"result_id": "016008", "URL": "https://translate.google.com/translate?hl=en&sl=de&u=https://altermedzentrum.com/virale-impfung-stell-dir-vor-du-wirst-geimpft-und-weisst-gar-nichts-davon/&prev=search&pto=aue", "timestamp": "2023-04-25 11:57:27 CEST+0200", "meta": {"description": "", "lang": "de", "keywords": "", "favicon": "https://altermedzentrum.com/wp-content/uploads/2018/10/cropped-ay-32x32.jpg", "canonical": "https://altermedzentrum.com/virale-impfung-stell-dir-vor-du-wirst-geimpft-und-weisst-gar-nichts-davon/", "encoding": "UTF-8"}, "image": null, "domain": "translate.google.com", "title": "Virale Impfung: Stell‘ Dir vor Du wirst geimpft und weißt gar nichts davon", "cleaned_text": "Virale Impfung: Stell‘ Dir vor Du wirst geimpft und weißt gar nichts davon\n\nUnvorstellbar? Mitnichten. Die Entwicklung von viralen Impfstoffen, die sich selbstständig verbreiten, die von Mensch zu Mensch überspringen, ohne dass Mensch etwas davon bemerkt, ist so gut wie abgeschlossen:\n\n“This concept may sound like science fiction, but the oral polio vaccine already does this to a limited extent [8], and transmissible vaccines have now been developed and deployed in wild animal populations [6]. For instance, recombinant transmissible vaccines have been developed to protect wild rabbit populations against myxomatosis [9] and to interrupt the transmission of Sin Nombre hantavirus in reservoir populations of deer mice [10,11]. In addition, a transmissible vaccine is currently being developed to control Ebola within wildlife reservoirs [12]. Given the current pace of technological advance in genetic engineering, it is only a matter of time before transmissible vaccines can be easily developed for a wide range of infectious diseases.”\n\nDas schreiben Scott L. Nuismer und seine sechs Ko-Autoren in einem gerade erschienenen Beitrag für die Proceedings B der Royal Society. Die Verbreitung viraler Impfstoffe, die sich wie ein Krankheitserreger von Mensch zu Mensch ausbreiten, nur dass sie ihn nicht krank machen, sondern resistent gegen Viren, ist nach den Ergebnissen von Nuismer ein lohnendes Unterfangen, mit dem es gelingen kann, selbst mit sehr schwachen Impfstoffen, die mehrfach verbreitet werden müssen, Geißeln der Menschheit wie Polio oder die Masern auszurotten, so wie das z.B. mit den Pocken gelungen ist:\n\nNuismer et al. haben ihr Modell absichtlich mit einem schwachen Impfstoff gerechnet, denn letztlich ist ein Impfstoff nichts anderes als ein Virus in abgeschwächter Form, auf den der aufnehmende Organismus durch die Ausbildung einer Resistenz reagiert bzw. reagieren soll, denn wenn der Impfstoff zu stark bemessen ist, bewirkt er sein Gegenteil, er schützt nicht vor z.B. Masern, er hat Masern zur Folge. Die Polio-Schluckimpfung hatte solche negativen Konsequenzen.\n\nDer Vorteil von viralen Impfstoffen, die ein Man Hopping betreiben, liegt auf der Hand: Impfverweigerer, die z.B. die Ausrottung von Kinderlähmung oder Masern verhindern und den entsprechenden Viren Rückzugsorganismen bereitstellen, so dass die Viren überleben können, könnten trotz Verweigerung und ohne ihre Wissen und Zutun, geimpft werden. Die Ausrottung der entsprechenden Viren hätte dann zur Folge, dass zukünftige Generationen keine Impfung gegen z.B. Masern mehr benötigen.\n\nDerartige Aussichten sind für Wissenschaftler, für Genforscher insbesondere, natürlich verlockende Aussichten. Man kann quasi die Welt über die Köpfe anderer hinweg und nur dadurch verändern, dass man einen Impfstoff im wahrsten Sinne des Wortes in die Welt setzt.\n\nNur für die, über deren Köpfe hinweg, entschieden wird, dass sie nun per viraler Impfung, gegen ihren Willen und ohne ihr Wissen geimpft werden, für die hat das Idyll, sagen wir: einen bitteren Beigeschmack, denn ihr Recht auf Selbstbestimmung wird schlicht ignoriert.\n\nNun kann man sagen, die Ausrottung einer Krankheit wie Masern rechtfertige es, die Impfmuffel gegen ihren Willen zu impfen, wegen dem größeren Guten, das der Allgemeinheit in einer masernfreien Welt winkt. Aber hat die Allgemeinheit ein Recht auf eine masernfreie Welt? Ist es statthaft, Menschen gegen ihren Willen einer Behandlung zu unterziehen, von der sie nicht einmal etwas wissen?\n\nDie ethischen Fragen, die sich mit viralen Impfstoffen verbinden, sind erheblich und rühren an der Grundlage von Gesellschaften, die durch das derzeit so modische Nudging, also das Schubsen von Bürgern in die nach Ansicht von Regierungen richtige Richtung, sowieso schon Abstand vom Liberalismus und vor allem von der Achtung des Einzelnen genommen haben.\n\nLetztere gebietet es natürlich, dass man niemanden ohne sein Wissen, sein Einverständnis und vor allem nicht gegen seinen Willen impft. Ein derartiger Übergriff auf die Integrität anderer ist auch dann nicht zulässig, wenn sich damit ein angebliches gesamtgesellschaftliches Gutes erreichen lässt. Er ist deshalb nicht zulässig, weil damit ein Präzedenzfall geschaffen wird, der es Regierungen erlaubt, regelmäßig Individualismus und Selbstbestimmung mit Füßen zu treten, und zwar mit der Begründung, das sei notwendig für ein höheres Gutes (wohin das führt, ist hinlänglich bekannt, anhand des regelmäßigen Kampfes für das Wohl des Vaterlands, dem Millionen individueller Leben ohne Sinn und ohne Zweck geopfert wurden). Letzten Endes ist individuelle Selbstbestimmung ein Wert, der mehr wiegt als die Aussicht auf eine masernfreie Welt.", "opengraph": {"type": "article", "url": "https://altermedzentrum.com/virale-impfung-stell-dir-vor-du-wirst-geimpft-und-weisst-gar-nichts-davon/", "title": "Virale Impfung: Stell‘ Dir vor Du wirst geimpft und weißt gar nichts davon", "description": "Unvorstellbar? Mitnichten. Die Entwicklung von viralen Impfstoffen, die sich selbstständig verbreiten, die von Mensch zu", "site_name": "altermed zentrum", "image": "https://altermedzentrum.com/wp-content/uploads/2019/03/uub-1024x536.jpg", "image:width": "1200", "image:height": "628"}, "tags": [], "tweets": [], "movies": [], "links": ["https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://www.facebook.com/sharer/sharer.php?u%3Dhttps%253A%252F%252Faltermedzentrum.com%252Fvirale-impfung-stell-dir-vor-du-wirst-geimpft-und-weisst-gar-nichts-davon%252F%26t%3DVirale%2BImpfung%253A%2BStell%25E2%2580%2598%2BDir%2Bvor%2BDu%2Bwirst%2Bgeimpft%2Bund%2Bwei%25C3%259Ft%2Bgar%2Bnichts%2Bdavon", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=http://rspb.royalsocietypublishing.org/content/royprsb/283/1841/20161903.full.pdf", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://sciencefiles.org/2016/10/27/virale-impfung-stell-dir-vor-du-wirst-geimpft-und-weisst-gar-nichts-davon/", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=http://www.anonymousnews.ru/2016/10/28/virale-impfung-stell-dir-vor-du-wirst-geimpft-und-weisst-gar-nichts-davon/", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://www.facebook.com/sharer/sharer.php?u%3Dhttps%253A%252F%252Faltermedzentrum.com%252Fvirale-impfung-stell-dir-vor-du-wirst-geimpft-und-weisst-gar-nichts-davon%252F%26t%3DVirale%2BImpfung%253A%2BStell%25E2%2580%2598%2BDir%2Bvor%2BDu%2Bwirst%2Bgeimpft%2Bund%2Bwei%25C3%259Ft%2Bgar%2Bnichts%2Bdavon", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://api.whatsapp.com/send?text%3DVirale%2520Impfung%253A%2520Stell%25E2%2580%2598%2520Dir%2520vor%2520Du%2520wirst%2520geimpft%2520und%2520wei%25C3%259Ft%2520gar%2520nichts%2520davon+https%253A%252F%252Faltermedzentrum.com%252Fvirale-impfung-stell-dir-vor-du-wirst-geimpft-und-weisst-gar-nichts-davon%252F", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://www.instagram.com/", "https://altermedzentrum-com.translate.goog/virale-impfung-stell-dir-vor-du-wirst-geimpft-und-weisst-gar-nichts-davon/?_x_tr_sl=de&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://api.whatsapp.com/send?text%3DVirale%2520Impfung%253A%2520Stell%25E2%2580%2598%2520Dir%2520vor%2520Du%2520wirst%2520geimpft%2520und%2520wei%25C3%259Ft%2520gar%2520nichts%2520davon+https%253A%252F%252Faltermedzentrum.com%252Fvirale-impfung-stell-dir-vor-du-wirst-geimpft-und-weisst-gar-nichts-davon%252F", "https://translate.google.com/website?sl=de&tl=en&hl=en&prev=search&u=https://www.instagram.com/", "https://altermedzentrum-com.translate.goog/virale-impfung-stell-dir-vor-du-wirst-geimpft-und-weisst-gar-nichts-davon/?_x_tr_sl=de&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc"], "authors": [], "publish_date": "März 1, 2019"}