{"result_id": "017020", "URL": "https://thealternativedaily.com/the-plague-is-here-now-124-are-dead-and-1200-infected-in-madagascar/", "timestamp": "2023-04-25 11:58:08 CEST+0200", "meta": {"description": "The plague in Madagascar has now become airborne, meaning it can spread from person to person, into surrounding countries and perhaps beyond.", "lang": "en", "keywords": "", "favicon": "https://s41998.pcdn.co/wp-content/uploads/2017/07/favicon-1.png", "canonical": "https://thealternativedaily.com/the-plague-is-here-now-124-are-dead-and-1200-infected-in-madagascar/", "encoding": "UTF-8"}, "image": null, "domain": "thealternativedaily.com", "title": "The Plague Is Here, With 124 Dead. Are Americans At Risk?", "cleaned_text": "Most, only know the “black death” from history books. So, it’s hard to imagine an infectious disease that once killed 50 million people re-emerging in parts of the world. But the truth is, the plague never left. Madagascar, for instance, regularly experiences outbreaks each year. But, this time, experts warn things are very different. The plague has now become airborne. Meaning it can spread from person to person, into surrounding countries and perhaps beyond.\n\nIn early history when the plague was widespread and without treatment, it often turned limbs black, which is why it was dubbed the “black death.” Yersinia pestis is the bacteria behind the “black death.” It typically spreads through the bite of infected fleas, often carried by rats, causing the plague.\n\nWhile many have heard of the plague, they assume it’s merely a dark part of human history, never to return. But the truth is, this potentially deadly bacteria still lingers throughout the world — even in the U.S. Now, an outbreak in Madagascar has become an even bigger threat to the region. It’s spreading faster than in previous years, according to reports, and threatening nine surrounding countries.\n\nHere’s what we know about Madagascar so far\n\nCNN reports that the plague outbreak in Madagascar is continuing to spread at extraordinary speed, with 124 deaths and more than 1,200 infected, and those figures are growing daily. The outbreak is considered a larger threat to the region than in previous years because it has advanced to pneumonic form. That means it has become airborne and can spread from person to person, through sneezes and coughs. The incubation period is short, and an infected person, if not treated quickly, can die within 12 to 24 hours. While the country experiences regular outbreaks, with an estimated 400 cases of plague each year, this time things are very different, warn experts.\n\nThis year, the plague arrived earlier than expected, and the infection began spreading to urban centers and in areas that until now had not been affected, according to the World Health Organization (WHO). Dr. Ashok Chopra, a professor of microbiology and immunology at the University of Texas, told The Sun that the crisis in Madagascar had not yet peaked, and warned that it was possible for the deadly plague to move further into the region since regular flights were moving in and out of the country.\n\nIn fact, warnings by WHO have been issued for nine countries surrounding Madagascar amid fears the disease could spread via sea trade and flight routes. These countries include Kenya, Ethiopia, South Africa, Mozambique, Tanzania, Reunion, Mauritius, Seychelles and Comoros. Tourists have been warned to stay away from Madagascar after the outbreak.\n\nThere are two main forms of plague infection, say WHO, either bubonic or pneumonic, depending on the route of infection. Luckily, all forms are treatable and curable if detected early enough. The Bubonic plague is most common globally, and is caused by the bite of an infected flea. The mortality rate is 30 to 60 percent. The bacteria enter at the bite and travel through the lymphatic system to the nearest lymph node where it spreads. Symptoms include painful and inflamed lymph nodes that can lead to open sores filled with pus. Additionally, the plague brings fever, chills, head and body aches, weakness, vomiting and nausea.\n\nHuman to human transmission of bubonic plague is rare. But when the bubonic plague advances and spreads to the lungs, a more severe type of plague is born called pneumonic plague, which is what we’re now seeing in Madagascar. Left untreated and undiagnosed in early stages, the disease leads to death. But, recovery rates are high, says WHO, if it’s detected and treated within 24 hours of onset of symptoms.\n\nWhat are the chances of the plague spreading to the U.S.?\n\nThe plague was first introduced into the United States in 1900, according to the Center for Disease Control (CDC). Between 1900 and 2012, 1,006 confirmed cases of plague occurred in the U.S. Over 80 percent of the cases were the bubonic form. Recently, there has been an average of seven cases reported each year. Plague occurs in rural and semi-rural areas of the western United States, with the most common states being southwestern states, particularly New Mexico, Arizona and Colorado.\n\nMeanwhile, the risk of further spread within Madagascar, nationally, remains very high, according to a report from WHO. And the risk of regional spread is moderate due to neighboring islands and southern and east African countries. However, “the risk of international spread is currently low, because generally, people with plague are too sick to travel,” reports CNN. WHO is also working closely with Madagascar’s airport authorities to ensure sanitary measures are in place at airports and ports to prevent the spread of infection outside the country.\n\nThe plague is a disease of poverty, because it thrives in places with poor sanitary conditions and health services,” says Dr. Arthur Rakotonjanabelo, for WHO in Madagascar. While there is currently no vaccinations for the plague, antibiotics are extremely helpful.\n\nSo, does this mean Americans should be concerned that pneumonic plague will soon spread to the U.S. Probably not, but you should certainly stay well informed and avoid visiting countries with current outbreaks and rising death tolls.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Plague Is Here, With 124 Dead. Are Americans At Risk?", "description": "The plague in Madagascar has now become airborne, meaning it can spread from person to person, into surrounding countries and perhaps beyond.", "url": "https://thealternativedaily.com/the-plague-is-here-now-124-are-dead-and-1200-infected-in-madagascar/", "site_name": "The Alternative Daily", "article:publisher": "https://facebook.com/thealternativedaily", "article:published_time": "2017-10-27T19:11:18+00:00", "article:modified_time": "2017-10-27T19:14:47+00:00", "image": "https://s41998.pcdn.co/wp-content/uploads/2017/10/madagascarplague_featured_960x540.jpg.optimal.jpg", "image:width": "960", "image:height": "540", "image:type": "image/jpeg"}, "tags": ["Black death", "Madagascar plague", "Bubonic Plague", "pneumonic plague"], "tweets": [], "movies": [], "links": ["javascript:void(0);", "http://www.cnn.com/2017/10/25/health/madagascar-pneumonic-plague-outbreak/index.html", "http://www.who.int/features/qa/plague/en/", "https://www.thesun.co.uk/news/4765804/black-death-warning-in-nine-countries-including-brit-holiday-hotspots-amid-fears-plague-could-spread-on-flights-from-madagascar/", "https://www.cdc.gov/plague/faq/index.html", "http://apps.who.int/iris/bitstream/10665/259281/1/Ex-PlagueMadagascar20102017.pdf", "javascript:void(0);"], "authors": ["", "Katherine Marko"], "publish_date": "2017-10-27T19:11:18+00:00"}