{"result_id": "017039", "URL": "https://thealternativedaily.com/3-alternative-cancer-treatments-to-ask-your-doctor-about/", "timestamp": "2023-04-25 11:58:34 CEST+0200", "meta": {"description": "This article looks at several developments in the fight against cancer including immunotherapy, stem cell vaccines and plant-based diets.", "lang": "en", "keywords": "", "favicon": "https://s41998.pcdn.co/wp-content/uploads/2017/07/favicon-1.png", "canonical": "https://thealternativedaily.com/3-alternative-cancer-treatments-to-ask-your-doctor-about/", "encoding": "UTF-8"}, "image": null, "domain": "thealternativedaily.com", "title": "Here Are 3 Alternative Cancer Treatments To Ask Your Doctor About", "cleaned_text": "Cancer has proven to be a crafty adversary. So far, the disease has found ways to circumvent the body’s defenses and many sophisticated medical treatments. Nevertheless, patients and doctors are increasingly finding ways to outwit this deadly malady. Here is an amazing story and some recent developments, which provide hope that people will ultimately get the upper hand.\n\nOriana Sousa, now 28, was diagnosed with a rare form of ovarian cancer seven years ago. Doctors tried everything (surgery, radiation and chemotherapy), but her tumors kept coming back.\n\nIn desperation, Sousa asked her doctors about a new class of immunotherapy drugs, but she was told that they would not work against her type of cancer. With nothing left to lose, however, Sousa’s physicians relented and the young woman finally received a round of immunotherapy. To the astonishment of everyone, her cancer went into remission and she is now back to leading a normal life.\n\nSousa is not the only one to benefit from this form of treatment. At least three other women with this rare form of ovarian cancer were told by their physicians that immunotherapy would not help with their hypercalcemic small cell ovarian cancer, but in each case, the immunotherapy treatment shrank their tumors immediately. This finding is leading oncologists to reconsider how they approach this type of cancer and many others.\n\nImmunotherapy works by dismantling a “protective molecular shield” that cancer cells manufacture to circumvent the white blood cells that are trying to eradicate them.\n\nThe principle behind immunotherapy seems reasonable enough, but immunotherapy actually fails more often than not. That fact has led researchers to ask, “Why does it work for a patient like Sousa (and on cancer that it’s not supposed to work for at all), but not for others?”\n\nMany researchers are concluding that it’s the unique genetic makeup of the patient that is key, not the type of cancer that they have. In other words, some patients have a genetic mutation that makes them better candidates for immunotherapy. This shift towards treating a patient based on their genetic makeup (as opposed to the form of cancer they have) is very likely to represent the future of oncology.\n\nIn a similar vein, scientists at Stanford University are using stem cell technology to create vaccines that will prime a person’s immune system to recognize tumors and destroy them.\n\nInstead of a one-size-fits-all vaccine, however, scientists expect to harness a patient’s unique genetic material in order to craft a personalized induced pluripotent stem cell (iPSC) vaccine that will present immune T cells with a “more accurate and representative panel of [a] patient’s tumor immunogens.” Presumably, this will help the body’s immune system target and destroy tumors that are gene specific to the patient.\n\nSo far, the Stanford scientists pursuing this approach have only tested their cancer vaccine on mice, but the results have been very encouraging. As Dr. Joseph Wu explains, “What surprised us most was the effectiveness of the iPSC vaccine in re-activating the immune system to target cancer […] This approach may have clinical potential to prevent tumor recurrence or target distant metastases.”\n\nPreventing tumor recurrence and preventing cancer altogether are important medical goals. But relying on science to develop cures and vaccines is risky. There’s overwhelming evidence that eating processed foods and the Standard American Diet (SAD) can dramatically increase a person’s risk of getting cancer.\n\nFor example, a recent study published in the British Medical Journal found that a ten-percent increase in consuming processed food leads to 12 percent increased risk for cancers overall. Unfortunately, many Americans are eating way more processed foods than the subjects in this study. No wonder rates of obesity, diabetes and cancer are reaching epidemic proportions.\n\nConversely, the American Cancer Society estimates that at least 42 percent of cancers could be prevented by simple diet and lifestyle changes. Health organizations, nutritionists and naturopathic physicians agree that the following tips are the best way to prevent cancer:\n• None Get lots of fresh fruits and vegetables\n\nIn particular, plant-based foods are loaded with phytonutrients (including antioxidants that help prevent the kind of cellular damage that can lead to tumors). Spices, herbs and essential oils are also rich in cancer-busting free radical scavengers too. Make sure to season your meals with herbs and spices like garlic, cayenne pepper, turmeric, ginger and oregano to get the benefits of cancer prevention compounds.", "opengraph": {"locale": "en_US", "type": "article", "title": "Here Are 3 Alternative Cancer Treatments To Ask Your Doctor About", "description": "This article looks at several developments in the fight against cancer including immunotherapy, stem cell vaccines and plant-based diets.", "url": "https://thealternativedaily.com/3-alternative-cancer-treatments-to-ask-your-doctor-about/", "site_name": "The Alternative Daily", "article:publisher": "https://facebook.com/thealternativedaily", "article:published_time": "2018-03-25T05:20:31+00:00", "article:modified_time": "2018-03-26T14:29:39+00:00", "image": "https://s41998.pcdn.co/wp-content/uploads/2018/03/23.jpg.optimal.jpg", "image:width": "960", "image:height": "540", "image:type": "image/jpeg"}, "tags": ["alternative medicine", "cancer", "chemo", "stem cell", "plant-based diet", "diet", "oncology", "health", "cancer vaccine"], "tweets": [], "movies": [], "links": ["javascript:void(0);", "https://www.nytimes.com/2018/02/19/health/ovarian-cancer-immunotherapy.html", "https://www.medicalnewstoday.com/articles/320941.php", "http://www.bmj.com/content/360/bmj.k322", "https://nypost.com/2018/02/15/processed-foods-linked-to-higher-risk-of-cancer-study/", "https://www.medscape.com/viewarticle/888976#vp_2", "https://thealternativedaily.com/daily-anti-cancer-menu/", "https://thealternativedaily.com/herbal-essential-oils-cancer-cells/", "javascript:void(0);"], "authors": ["", "Scott O’Reilly"], "publish_date": "2018-03-25T05:20:31+00:00"}