{"result_id": "017028", "URL": "https://links.thealternativedaily.com/a/75/click/9416987/742415649/_38b79af01977d838620b992ce185d3316decb7f5/1d499a21ab28b7d25a4aa8c4693164587e6aecd1", "timestamp": "2023-04-25 11:58:18 CEST+0200", "meta": {"description": "Nearly two years ago, it showed up like a tsunami...and a wave of disease, death, and destruction swept over all of us. According to Statista, as of Septem", "lang": "en", "keywords": "", "favicon": "https://s42004.pcdn.co/wp-content/uploads/2017/04/cropped-tropicalhealthlogo512x512-1-1-32x32.png", "canonical": "https://tropicalhealth.com/covid-19-vaccine-update-9-things-you-should-know-before-getting-vaccinated/", "encoding": "UTF-8"}, "image": null, "domain": "links.thealternativedaily.com", "title": "COVID 19 Vaccine Update (9+ Things You Should Know Before Getting Vaccinated)", "cleaned_text": "Nearly two years ago, it showed up like a tsunami…and a wave of disease, death, and destruction swept over all of us. According to Statista, as of September 1, 2021, the number of confirmed and presumptive positive cases of COVID-19 disease surpassed 40 million in America, with 657,910 deaths reported.\n\nThere is not one corner of the globe that this pandemic’s immensity and darkness have not impacted. It might be hard to imagine any good news coming out of such a real-life horror story – but, there is a glimmer of hope and light.\n\nAs life seemed to be spinning out of control, something was happening backstage. The best and brightest researchers in the world were pouring everything they knew into developing a vaccine that would protect us from the enemy novel virus. Now, it is here!! As of September 1, 2021, 53% of all Americans are fully vaccinated and about 63% have recieved one dose.\n\nHowever, as with anything new – especially vaccines – there are always lots of questions and plenty of considerations. As of September 1, 2021 – this is what we know about the available vaccines in America.\n\nEarly in the pandemic, it became clear that older people and those with chronic conditions, including obesity, were at greater risk for more serious disease if they contracted COVID-19. That remains true, but new science has shown that individual who are overweight or obese now have a new problem to worry about. Obesity may hamper the effectiveness of Covod vaccines.\n\nA new study suggests that lean or normal weight individuals have a more robust antibody response after COVID vaccine. This may result in shorter duration of protection and/or lower vaccine effectivness in obese or overweight individuals.\n\nAdditional studies demonstrate that elevated blood pressure and excessive abdominal fat lead to suboptimal antibody responses after vaccination.\n\nIf you needed another reason to lose weight and get your blood pressure in control… this is it.\n\nSIDE EFFECTS UPDATE: Heart inflammation after vaccine – reports on the rise\n\nAccording to the Centers for Disease Control and Prevention (CDC), there have been more than one thousand reports of heart inflammation reported following the administration of mRNA Covid-19 vaccination. As of August 25, 2021, CDC and FDA have confirmed 788 cases of myocarditis or pericarditis. These cases appear to be concentrated in young men, 16 years of age and older, typically after the second dose.\n\nMyocarditis involves inflammation of the heart muscle with symptoms of fever, fatigue, shortness of breath, palpitations, and chest pain that hurts when leaning forward. Pericarditis involves the lining outside of the heart with similar symptoms to myocarditis.\n\nThe Vaccines and Related Biological Products Advisory Committee June 10, 2021 meeting presentation outlined the early safety data of Pfizer-BioNTech vaccination in persons aged 12-15-year-old and myocarditis and pericarditis following mRNA vaccination.\n\nAccording to the CDC, patients who have presented for medical care have responded well and rapidly to medications and rest. At this time, the CDC is still recommending Covid-19 vaccinations for everyone 12 years of age and older.\n\nThe CDC has recommended that the following groups of people be offered the vaccine first.\n• None Essential persons like first responders and teachers\n• None Other essential persons who work in industries such as food service and construction\n\nNote: Keep in mind that guidelines may vary by state.\n\nVaccines are FREE, here’s how to get yours\n\nVaccines are now widely available to anyone who wants one. The federal government is providing vaccines free to anyone living in America regardless of their health insurance or immigration status. Check with your local pharmacy to see if they have appointments for vaccines available or go online here to find out whether your local pharmacy is participating in The Federal Retail Pharmacy Program. You can also contact your state health department to find other vaccination locations.\n\nThere are presently three vaccines that are authorized for use in America:\n• Pfizer-BioNTech COVID-19 vaccine – , this vaccine is available for persons 16 years or older. Recipients receive two injections 21 days apart.\n• Moderna’s COVID-19 vaccine – , against the alpha variant and 66% against delta, this vaccine is available for people 18 years or older. Recipients received two injections 28 days apart.\n• Janssen vaccine by Johnson & Johnson – The CDC and the FDA are currently recommending the use of this single dose vaccine after a temporary pause to investigate reports of blood clots.\n\nBoth the Pfizer and Moderna vaccines use messenger RNA technology while the J&J vaccine uses a more traditional virus-based technology.\n\nMessenger RNA ( mRNA)vaccines do not use the live virus that causes COVID-19. Contrary to what you may have heard about these vaccines, mRNA does not enter the cells’ nucleus, which means it can’t alter DNA. Cells receive instruction on how to make a harmless protein unique to the virus. Once copies of the protein are made, the genetic material from the vaccine is destroyed. In response to the protein, the body makes T-lymphocytes and B-lymphocytes that fight off the COVID-19 virus if an infection happens.\n\nAccording to Dr. Joshua Levitt, there are two pieces of welcome news about mRNA vaccines:\n• None Adjuvants: Chemical adjuvants are ingredients that are added to traditional vaccines to stimulate a stronger immune response. Because mRNA vaccines work differently than traditional vaccines, they do not require the same adjuvants, so the ingredient list is actually “cleaner” than many traditional vaccines.\n• None Preservatives: mRNA is an unstable molecule that requires extremely cold temperatures to maintain its integrity. Those cold temperatures reduce the need for extra preservatives which are required in traditional vaccines.\n\nAccording to The Centers for Disease Control (CDC), persons with the following should not be vaccinated with an mRNA vaccine\n• None If you have had a serious allergic reaction or immediate reaction to any vaccine ingredient, you should not get the vaccine. This includes a reaction to polyethylene glycol (PEG) and polysorbate. Although polysorbate is not in either of the vaccines mentioned above, it is closely related to PEG, which is in the vaccines.\n• None If you have a severe allergic reaction or an immediate allergic reaction after the first dose, you should not get another injection even if the reaction was not severe. Examples of an immediate reaction include hives, swelling, or wheezing occurring within four hours of vaccination.\n\nNote: If you have had a severe allergic reaction to injectables in the past, you can still get the vaccine, but you need to be monitored for 30 minutes after getting the vaccine.\n\nWhat if I have an underlying condition?\n\nIf you have an underlying medical condition, the CDC states that you can get the vaccine as long as you have not had a reaction to a COVID-19 vaccine or any of its ingredients. There is, however, very little information about the safety of the vaccine in people who have autoimmune disorders or a weakened immune system.\n\nWhat if I am pregnant or breastfeeding?\n\nBecause there is limited data on the safety of the COVID-19 vaccines in pregnant or breastfeeding women, it is best to speak with your healthcare provider before considering the vaccine.\n\nThose that have already had COVID-19\n\nIf you have already had COVID-19, a vaccine may help prevent re-infection in the future. Because it is unknown how long immunity after getting COVID-19 lasts, the CDC is recommending vaccination 90 days after an initial diagnosis.\n\nThe following reactions are possible after the first or second vaccine injection.\n• None Swelling, pain, or redness at the injection site\n• None Fever (remember, this is a sign that your immune system is working)\n\n* An important note for women: It is common for axillary (armpit) lymph nodes to become enlarged on the side where the COVID vaccine was administered. The enlargement can persist for several weeks after the vaccine. Because axillary lymph node enlargement can also occur in breast cancer, this otherwise minor side effect can strike fear in many women after the vaccine. As a result, many experts are now recommending that women avoid unnecessary testing and delay mammograms and for one month after getting a COVID vaccine to allow time for enlarged lymph nodes to subside.\n\nIt is important to note that getting the COVID-19 vaccine may cause some side effects similar to symptoms of the virus. If you have been exposed to COVID-19 and you develop symptoms more than three days after being vaccinated – or if your symptoms persist for two or more days – quarantine and get tested.\n\nBoth the Pfizer-BioNTech and Moderna COVID-19 vaccine trials started in the summer of 2020. Because of this, it is impossible to know what long-term side effects, if any, may occur. To stay current with all of the safety data surrounding vaccines, you can visit the Vaccine Adverse Event Reporting System. This site provides data available to the public.\n\nDo I need to prepare for a COVID-19 vaccine?\n\nThere is a lot of information circling out there about what to do before a COVID-19 vaccination – it is imperative to sort through what is credible and just talk. Are you wondering about how best to prepare for a COVID-19 vaccination? Here is what the experts are saying.\n• None According to Aaron E. Glatt, MD and hospital epidemiologist and chief of infectious diseases at Mount Sinai South Nassau in Oceanside, NY, there is nothing specific a person needs to do before taking the vaccine apart from reporting any previous serious allergic reactions.\n• None Blanka Kaplan, MD, is a specialist in adult and pediatric allergy and immunology at Northwell Health in Great Neck, NY. According to Kaplan, if you take allergy medicine, you should not stop taking it before being vaccinated.\n• None Kaplan also advises against taking any kind of non-steroidal anti-inflammatory drugs such as ibuprofen or aspirin before and 2 hours after vaccination – unless instructed otherwise by your physician. These may cause an allergic reaction in some people.\n• None Kaplan’s additional advice includes avoiding alcohol 24 hours after vaccination and avoiding strenuous exercise 2 hours before and 2 hours after vaccination. Also, skip the hot shower 2 hours before and 2 hours after vaccination as it can cause allergic reactions in some people.\n\nWhat you should do to support a healthy immune system\n\nAccording to the experts, there are a few things that you can do to support your immune system doing its job.\n\nStay hydrated – The first one is to stay well-hydrated. Hydration is fundamental to keeping your immune system healthy. It is recommended to drink a minimum of half their body weight in ounces of water. If you are a coffee drinker, drink one cup of water extra for every cup of coffee you drink. Choose purified water and herbal tea.\n\nEat right – Eating a whole food diet is a great way to stay healthy and keep your immune system in top shape. Skip the sugar-laden drinks, refined vegetable oil snacks, and munch on some carrots and hummus instead. The more colorful your diet, the better – include delicious fruits, vegetables, nuts, seeds, whole grains, and healthy fat.\n\nSleep well – For your immune system to do what it needs to do, you need to adopt a healthy sleeping routine. Studies show that people who do not get enough sleep are more likely to get sick when exposed to a common cold virus. Additionally, a lack of sleep can also impact how fast you recover if you do get sick. Try to go to bed early and get at least 7-9 hours of quality sleep. Put away the electronics an hour before bed and sleep in a dark and cool room.\n\nStay active – Regular exercise is vital to overall health and wellbeing and a robust immune system. Exercise helps increase circulation, allowing cells and substances of the immune system to circulate through the body and do their job.\n\nManage stress – Being in a constant state of stress can take its toll on your mental and physical health and impede proper immune function. Although small bouts of stress may induce immune function, chronic stress does the opposite by increasing inflammation and lowering lymphocytes, which are white blood cells that help keep infection at bay. If you battle with chronic stress, try to adopt some health stress-beating habits like journaling, exercising, deep breathing, yoga, and spending time in nature.\n\nAs more vaccines are approved, and data flows in from the current vaccines being administered, new information will follow. Just as COVID-19 is unique, so are the approaches underway to protect us against the virus. Continue to practice good hygiene, social distancing, and wear a mask in public. And always get your information from credible, expert sources. If you have questions or concerns about the COVID-19 vaccine, speak with your healthcare provider.\n\n\n\nPoop & Your Immune Health [FREE REPORT]\n\n\n\nDid you know that your poop shape and color can tell you a lot about your overall health? In some cases, it can provide an early warning sign of a weakened immune system. Knowing your “poop score” can be critical in identifying a problem before it gets too serious.\n\n\n\nTake this 30-sec quiz to receive your FREE poop score today =>\n\n(get immediate results, a personalized action plan, AND a FREE gut health report)", "opengraph": {"locale": "en_US", "type": "article", "title": "COVID 19 Vaccine Update (9+ Things You Should Know Before Getting Vaccinated)", "description": "Nearly two years ago, it showed up like a tsunami...and a wave of disease, death, and destruction swept over all of us. According to Statista, as of Septem", "url": "https://tropicalhealth.com/covid-19-vaccine-update-9-things-you-should-know-before-getting-vaccinated/", "site_name": "Tropical Health", "article:tag": "vaccine", "article:section": "Popular", "article:published_time": "2023-04-18T22:21:03+00:00", "image": "https://s42004.pcdn.co/wp-content/uploads/2021/02/hakan-nural-Z2n-r7pg6kM-unsplash-scaled.jpg.optimal.jpg", "image:width": "2560", "image:height": "2242"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.facebook.com/sharer.php?u=https://tropicalhealth.com:443/covid-19-vaccine-update-9-things-you-should-know-before-getting-vaccinated/", "https://twitter.com/intent/tweet?text=COVID%2019%20Vaccine%20Update%20%289%2B%20Things%20You%20Should%20Know%20Before%20Getting%20Vaccinated%29&url=https://tropicalhealth.com:443/covid-19-vaccine-update-9-things-you-should-know-before-getting-vaccinated/&counturl=https://tropicalhealth.com:443/covid-19-vaccine-update-9-things-you-should-know-before-getting-vaccinated/&", "javascript:pinIt();", "http://www.linkedin.com/shareArticle?mini=true&title=COVID%2019%20Vaccine%20Update%20%289%2B%20Things%20You%20Should%20Know%20Before%20Getting%20Vaccinated%29&url=https://tropicalhealth.com:443/covid-19-vaccine-update-9-things-you-should-know-before-getting-vaccinated/&summary=Nearly%20two%20years%20ago%2C%20it%20showed%20up%20like%20a%20tsunami...and%20a%20wave%20of%20disease%2C%20death%2C%20and%20destruction%20sw...", "https://www.statista.com/page/covid-19-coronavirus", "https://www.medrxiv.org/content/10.1101/2021.02.24.21251664v1.full-text", "https://www.fda.gov/media/150054/download", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/recommendations.html#:~:text=CDC%20recommends%20that%20initial%20supplies,long%2Dterm%20care%20facility%20residents.", "https://www.fda.gov/media/144414/download", "https://www.nejm.org/doi/full/10.1056/NEJMoa2034577", "https://www.fda.gov/media/144638/download", "https://www.nejm.org/doi/full/10.1056/NEJMoa2035389", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/facts.html", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/allergic-reaction.html", "https://www.mayoclinic.org/diseases-conditions/coronavirus/in-depth/coronavirus-vaccine/art-20484859", "https://vaers.hhs.gov/", "https://pages.upwellness.com/healthy-poop-quiz/?cid=thblog_vaccine", "https://www.facebook.com/sharer.php?u=https://tropicalhealth.com:443/covid-19-vaccine-update-9-things-you-should-know-before-getting-vaccinated/", "https://twitter.com/intent/tweet?text=COVID%2019%20Vaccine%20Update%20%289%2B%20Things%20You%20Should%20Know%20Before%20Getting%20Vaccinated%29&url=https://tropicalhealth.com:443/covid-19-vaccine-update-9-things-you-should-know-before-getting-vaccinated/&counturl=https://tropicalhealth.com:443/covid-19-vaccine-update-9-things-you-should-know-before-getting-vaccinated/&", "javascript:pinIt();", "http://www.linkedin.com/shareArticle?mini=true&title=COVID%2019%20Vaccine%20Update%20%289%2B%20Things%20You%20Should%20Know%20Before%20Getting%20Vaccinated%29&url=https://tropicalhealth.com:443/covid-19-vaccine-update-9-things-you-should-know-before-getting-vaccinated/&summary=Nearly%20two%20years%20ago%2C%20it%20showed%20up%20like%20a%20tsunami...and%20a%20wave%20of%20disease%2C%20death%2C%20and%20destruction%20sw..."], "authors": ["Susan Patterson"], "publish_date": "2023-04-18T22:21:03+00:00"}