{"result_id": "017024", "URL": "https://thealternativedaily.com/healthy-drink-deadly-neurotoxin", "timestamp": "2023-04-25 11:58:13 CEST+0200", "meta": {"description": "Contrary to popular belief, fluoride isn't actually something you should be putting in your body. This neurotoxin is hiding in many of your favorite drinks.", "lang": "en", "keywords": "", "favicon": "https://s41998.pcdn.co/wp-content/uploads/2017/07/favicon-1.png", "canonical": "https://thealternativedaily.com/healthy-drink-deadly-neurotoxin/", "encoding": "UTF-8"}, "image": null, "domain": "thealternativedaily.com", "title": "This \"Healthy\" Bottled Drink Contains a Deadly Neurotoxin: Here's What You Should Do", "cleaned_text": "Before I even knew all the damage that fluoride was capable of, it just felt wrong to me. I was one of those weird mothers in the dentist office with a special note on my kid’s charts that read – NO FLOURIDE. They would always look at me a little strange when it was time for cleanings. Here comes Mrs. No Flouride, they must have thought, what a wingnut.\n\nYep, that was me, the same granola chick that cringed at the thought of my children drinking soda or being vaccinated. I was weird before it was cool to be weird, but I was determined to raise healthy children which meant keeping as many dangerous toxins away from them as possible.\n\n“Flouride” refers to any compound that contains a fluorine ion. Fluorine with a chemical symbol “F” and an atomic number of 9 can be found on the periodic table. In pure gas form, fluorine is ” the most reactive and electronegative of all elements.” It has very destructive impacts on any living organism with which it comes in contact.\n\nCalcium fluoride ( CaF2) exists in nature and is found in soil and water. In spring water areas, where there are no industries that use fluoride, the water usually contains about 01 – 03 parts per million of calcium fluoride naturally. Seawater contains about 1.3 parts per million. However, these amounts can vary immensely depending on the location. In water supplies in some parts of the world, calcium fluoride can be found in amounts as high as 10-20 parts per million. This is considered an unsafe amount to consume.\n\n\n\nContrary to what you might think, calcium fluoride is not the same compound that is added to drinking water. The fluoride that is added to our drinking water comes from hydrofluorosilicic acid and sodium fluorosilicate — unprocessed byproducts from the production of fertilizer. Recent research is now suggesting that the use of fluoride in drinking water can also elevate exposure to both arsenic and lead.\n\nDamaging effects of fluoride can’t be ignored\n\nDid you know that it would take less than 5 mg of fluoride per kilogram of body weight to kill a human? According to The World Health Organization (WHO), fluoride is more toxic than lead and only slightly less toxic than arsenic.\n\nAnd you wanted to put that in my child’s mouth?? NOT\n\nFluoride use was first documented in Nazi Germany. High levels of fluoride were known to “dull the brain” and damage both male and female reproductive systems. Conspiracy theories state that it was added to the drinking water in Jewish ghettos and concentration camps as a way to gain control of the Jewish population and reduce reproduction.\n\nSince then, scientists have uncovered further damaging effects of this toxic substance. It does not appear to support a reduction in tooth decay, and actually bio-accumulates within the body. Just consider the warning label that the FDA requires on toothpaste sold in America. Not to mention the tens of thousands of children in China and India who suffer from painful and crippling bone disease as a result of drinking water with elevated levels of fluoride.\n\nLong-term exposure has been associated with a possible increased risk of cancer, reduced neurological function, increased bone fractures, degenerative joint disease, and more.\n\nMany people are not aware of the fact that in the early 20th century, fluoride was used medicinally as an anti-thyroid drug, to slow the thyroid in people with hyperthyroidism. It is no surprise that studies have found changes in the thyroid in patients who are exposed to fluoride including:\n\nIt’s everywhere, not just in toothpaste. Flouride can be found in pots and pans, antibiotics and drinking water. However, there are a number of other places where fluoride is hiding as well, including:\n\nAccording to the USDA National Flouride Database of Selected Beverages and Foods, tea contains 5-10 more times fluoride than a can of soda. This includes any tea the belongs to the camellia sinensis family – black, oolong and green.\n\nTea plants take fluoride and aluminum from the ground into their leaves. Older leaves have more fluoride than younger leaves. There is also the issue of pesticides, herbicides, and fertilizers, all of which contain fluoride along with industrial waste which also contains fluoride. The fairly small amount of natural fluoride taken up by the leaves is then compounded in conventional growing practices by farming practices.\n\nAccording to a study from the Medical College of Georgia, black tea could have as much as 9mg of fluoride per liter – a much higher number than was once thought. To put this in perspective, you would need to drink 3 quarts of fluoridated water to get the same amount of fluoride as found in one 8-ounce cup of tea.\n\nTip: According to the World Health Organization, there are areas in the world where the groundwater is naturally high in fluoride. These areas include Africa, The Middle East, China, and southern Asia. Source organic tea from Japan and be sure to brew with non-fluoridated water. Better yet, switch to herbal teas such as ginger, sage, mint lemon balm or chamomile. These are delicious teas and have powerful therapeutic properties.\n\nThis is not good news for those of us who drink bottle Kombucha. The base of Kombucha is generally black or green tea. There is no way to know where the tea came from or if the water used to make the drink is fluoridated. For these reasons, it is safer to avoid bottled Kombucha.\n\nTip: The good news is that you can make your own Kombucha using non-fluoridated water and Yerba mate or red tea. Allow your Kombucha to ferment as long as possible and drink no more than 12 ounces per day. You can also learn to make and enjoy other healthy fermented beverages such as fermented lemonade and water kefir.\n\nNon-organic fruits and vegetables are also tainted with fluoride. The Environmental Protection Agency (EPA) tells us that cryolite, fluoride-based pesticide, is used on fruits and vegetables – mostly on grapes, potatoes, and citrus fruits, However, the Fluoride Action Network ( FAN) states that it is also used on Brussels sprouts, broccoli, apricots, cabbage, collards, eggplant, kiwifruit, lettuce, melon, collards, cauliflower, peach, pumpkin, peppers, plum, tomato, and berries. If you’re a wine drinker, beware. Wine not made from organic grapes is also very high in fluoride\n\nTip: Buy only organic fruits, veggies and wine – no exception\n\nFluoride is stored in the bones of animals. This means that non-organic meat, which is sold and cooked on the bone is high in fluoride. This includes broth, soups, and stews made from animals that were fed conventional feed. Conventionally raised animals are fed food that is high in corn and soy, two crops that are heavily sprayed with fluoride-based pesticides. Meats that are deboned and separated mechanically like chicken nuggets, bologna, and meat sticks are made from a mix of meat and other animal byproducts including bones, skin, and cartilage. These byproducts are high in fluoride.\n\nProcessed foods such as cereal, chips, crackers, and cookies all contain fluoride. In addition, food in cans such as soup, salsa, and beans is generally made using fluoridated water.\n\nTip: Limit processed meat and soups and bone broth unless made with animals raised organically. Eat fewer packaged/processed/canned foods. Cook with whole, organic foods as much as possible.\n\nHere is some good news! A study published in the Pharmacognosy Magazine found evidence to support that curcumin, found in turmeric, may have protective effects on the health impacts of fluoride. Just another reason in the long list of reasons to eat more turmeric.\n\nCurcumin has clearly demonstrated its amazing brain-saving properties. There are hundreds of peer-reviewed studies that show it has powerful neuroprotective properties.\n\nAccording to research from the UCLA School of Medicine, curcumin boosts memory and stimulates the production of new brain cells. \n\n\n\nAre you ready to take a stand against fluoride?", "opengraph": {"locale": "en_US", "type": "article", "title": "This \"Healthy\" Bottled Drink Contains a Deadly Neurotoxin: Here's What You Should Do", "description": "Contrary to popular belief, fluoride isn't actually something you should be putting in your body. This neurotoxin is hiding in many of your favorite drinks.", "url": "https://thealternativedaily.com/healthy-drink-deadly-neurotoxin/", "site_name": "The Alternative Daily", "article:publisher": "https://facebook.com/thealternativedaily", "article:published_time": "2018-11-21T14:00:51+00:00", "article:modified_time": "2022-02-01T14:54:35+00:00", "image": "https://s41998.pcdn.co/wp-content/uploads/2018/11/Fotolia_183265900_Subscription_Monthly_M.jpg.optimal.jpg", "image:width": "960", "image:height": "640", "image:type": "image/jpeg"}, "tags": ["dentist", "vegetables", "meat", "toxic", "water", "tea", "flouride", "processed food", "fruits"], "tweets": [], "movies": [], "links": ["javascript:void(0);", "https://pubchem.ncbi.nlm.nih.gov/compound/fluoride", "http://www.mosaicco.com/products/industrial_products_hfs.htm", "http://www.who.int/", "https://www.sciencedirect.com/science/article/pii/S2213453013000165", "https://www.ewg.org/news/news-releases/2006/04/06/harvard-study-strong-link-between-fluoridated-water-and-bone-cancer", "https://www.ncbi.nlm.nih.gov/pubmed/19102839", "http://fluoridealert.org/issues/health/bone-fracture/", "http://fluoridealert.org/issues/health/thyroid/", "https://thealternativedaily.com/make-your-own-toothpaste/", "http://www.fluoridealert.org/wp-content/uploads/usda.2004.f.database.pdf", "https://www.sciencedaily.com/releases/2010/07/100714104059.htm", "http://www.who.int/", "https://thealternativedaily.com/coconut-kefir-water-a-probiotic-powerhouse/", "http://fluoridealert.org/researchers/pesticide/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3969660/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4851520/", "https://thealternativedaily.com/turmeric-spice/", "https://www.ncbi.nlm.nih.gov/pubmed/19433889", "javascript:void(0);"], "authors": ["", "Susan Patterson"], "publish_date": "2018-11-21T14:00:51+00:00"}