{"result_id": "017001", "URL": "https://thealternativedaily.com/report-monkeys-subjected-to-vaccines-develop-symptoms-of-autism/", "timestamp": "2023-04-25 11:57:44 CEST+0200", "meta": {"description": "For years, the Centers for Disease Control and doctors have sworn up and down that childhood vaccines have no connection to the development of autism in", "lang": "en", "keywords": "", "favicon": "https://s41998.pcdn.co/wp-content/uploads/2017/07/favicon-1.png", "canonical": "https://thealternativedaily.com/report-monkeys-subjected-to-vaccines-develop-symptoms-of-autism/", "encoding": "UTF-8"}, "image": null, "domain": "thealternativedaily.com", "title": "Report: Monkeys Subjected To Vaccines Develop Symptoms of Autism", "cleaned_text": "For years, the Centers for Disease Control and doctors have sworn up and down that childhood vaccines have no connection to the development of autism in children. However, recent research findings from researchers at the University of Pittsburgh are now throwing those assertions into question.\n\nThe Centers for Disease Control never required vaccine makers to conduct rigorous research on the effects of their drugs on children, including whether or not they could result in autism symptoms. The researchers at the University of Pittsburgh, lead by Linda Hewitson, decided to conduct testing on monkeys as part of a research project. They took monkeys on subjected them to the standard vaccine schedule recommended for children in the United States. Vaccinations included MMR (measles, mumps and rubella) and other standard vaccinations that contain the additive Thimerosal. Monkeys receiving the vaccinations displayed symptoms of autism. In contrast, the control group of monkeys not receiving the vaccinations showed no signs of the developmental condition.\n\nAutism is a pervasive developmental disorder that appears early in childhood. It is more common in boys than girls and it is not well understood. The spectrum of autism varies from extremely mild to severe and includes Asperger’s Syndrome, a high-functioning form of the condition. It is thought that autism is a sensory processing disorder in which a person has difficulty coping with normal sensory information and interactions with others and withdraws internally. There is no known cure for autism and it is a lifelong condition.\n\nAlthough the University of Pittsburgh study is awaiting publication in a scientific peer-reviewed journal, the mere presentation of findings has thrown the assertions and practices of the CDC regarding vaccinations and autism into question. For the millions of parents with children who have autism, it may finally be the beginnings of validation about their concerns about childhood vaccinations for all these years.", "opengraph": {"locale": "en_US", "type": "article", "title": "Report: Monkeys Subjected To Vaccines Develop Symptoms of Autism", "description": "For years, the Centers for Disease Control and doctors have sworn up and down that childhood vaccines have no connection to the development of autism in", "url": "https://thealternativedaily.com/report-monkeys-subjected-to-vaccines-develop-symptoms-of-autism/", "site_name": "The Alternative Daily", "article:publisher": "https://facebook.com/thealternativedaily", "article:published_time": "2012-05-08T19:05:25+00:00", "article:modified_time": "2016-04-07T18:52:47+00:00"}, "tags": ["vaccines", "natural health"], "tweets": [], "movies": [], "links": ["http://vactruth.com/2012/04/29/monkeys-get-autism/"], "authors": ["", "The Alternative Daily"], "publish_date": "2012-05-08T19:05:25+00:00"}