{"result_id": "017004", "URL": "https://thealternativedaily.com/natural-remedies-mentioned-in-the-bible/", "timestamp": "2023-04-25 11:57:48 CEST+0200", "meta": {"description": "It’s pretty remarkable that the natural remedies mentioned in the Bible are still being used thousands of years later. Here’s a few you should know.", "lang": "en", "keywords": "", "favicon": "https://s41998.pcdn.co/wp-content/uploads/2017/07/favicon-1.png", "canonical": "https://thealternativedaily.com/natural-remedies-mentioned-in-the-bible/", "encoding": "UTF-8"}, "image": null, "domain": "thealternativedaily.com", "title": "10 Natural Remedies Mentioned In The Bible", "cleaned_text": "The original accounts in the Bible were not generally written, but rather told repeatedly — handed down generation after generation — before eventually being written down. So, it’s pretty remarkable that the natural remedies mentioned in the Bible are still being used thousands of years later. Let’s have a look at some ancient medicinal plants recorded in scriptures, and their power to heal various conditions, many of which still apply today.\n\nIt’s no surprise that aloe is mentioned in the Bible since it’s one of the oldest plants on record due to its medicinal properties and health benefits. When the Bible speaks of aloe, it’s likely referring to an aromatic extract used for healing and embalming. Today, however, you’re more apt to find aloe sitting on a kitchen counter, ready to be used topically for burns, sunburns, cuts and skin irritations. When applied, aloe gel promotes healing, and has anesthetic and antibacterial properties that increase blood or lymph flow in the small vessels surrounding the wound.\n\nBut, aloe juice is also used orally. According to research published in The British Journal of General Practice, aloe juice may be helpful for lowering blood glucose in diabetic patients as well as for reducing blood lipid levels in those with abnormally high fat in the blood. Other research published in the Journal of Environmental Science and Health suggests that aloe contains antibacterial, antiviral and antifungal properties that help rid the body of toxins and invading pathogens.\n\nIn the Bible, frankincense was bestowed upon the baby Jesus. Because of this, frankincense was best known for ceremonial offerings and ancient rituals. Today, it’s still regarded as an important spiritual incense.\n\nFrankincense comes from the gummy sap that oozes out of the Boswellia trees when the bark is cut. The resin hardens and is scraped off the trunk in tear-shaped droplets. Interestingly, it’s edible and often chewed like gum, according to The History Channel.\n\nFrankincense oil is used by either inhaling it or absorbing it through the skin and is usually mixed with a carrier oil. It has powerful healing properties and when inhaled can be used to calm and improve anxiety. Other benefits of frankincense include:\n\nAnd, according to a study published in Biomed Central, it may even contain potential cancer-fighting properties.\n\nHebrews relied on garlic, believing that it increased virility. Therefore, as directed by Genesis, they used it to “be fruitful and multiply.” In fact, there are five properties to garlic that hold particular significance to those of the Jewish faith. It is consumed on Fridays (Shabbat) for these reasons:\n• None It keeps the body warm\n\nBut garlic has been used as both food and medicine in many cultures for thousands of years. Today, garlic is used to help prevent a number of diseases such as hardening of the arteries, high cholesterol and high blood pressure. It’s also thought to boost the immune system and even protect against cancer.\n\nWhile anise does appear in the Bible, some scholars believe the word “anise” actually refers to “dill.” Nevertheless, in biblical times, anise was so highly prized that it was often used as a payment of taxes in Palestine.\n\nToday, anise is commonly used in herbal remedies to break up congestion and ease coughing. It can also be used to help with digestion and as an anti-flatulence agent. It’s usually taken by crushing the seeds into a tea.\n\nCassia, as written in the Bible, resembled modern day cinnamon. It was generally used as a holy anointing oil, but it was also used in perfumery and even as a precious commodity. Today, cassia is ground into cinnamon. And, according to a British study, it’s been shown to reduce fasting blood sugar levels. It also harbors great potential as an anti-diabetic.\n\nLike frankincense, gum was collected from myrrh and pressed into cakes and used in perfumery. Myrrh was sold as a spice, a stimulant and expectorant. It was also sold as incense and as an ingredient in salve, for the purification of the dead.\n\nToday, myrrh is highly valued in aromatherapy for its sedative and antidepressant properties, and as a promoter of spiritual feelings. Myrrh oil works well against coughs, colds and sore throats. It also helps relieve congestion and expels phlegm. Other benefits include:\n• None Immune boosting properties that help protect your body from infections\n\nOne of Jesus’ most famous parables referred to the mustard seed, most likely because mustard grew so abundantly in Palestine. Today, according to Organic Facts, mustard can be used to relieve muscular pains, psoriasis, ringworm, contact dermatitis and respiratory disorders.\n\nIn Biblical times, mint was used in the domestic economy as a condiment and also as a medicine, according to BibleHub. Today, mint is used as a breath freshener, a palate cleanser and it promotes digestion. In fact, if you have a digestive upset, a cup of mint tea provides fast relief. According to research, mint can soothe nausea and even help against motion sickness. It’s also effective for clearing congestion and loosening phlegm, suggests the University of Maryland Medical Center.\n\nBitter herbs are essentially any herb or plant that possesses a bitter taste. Historically, people have used bitter herbs for ceremony, cooking and medicine. The Bible speaks of bitter herbs accompanying lamb and unleavened bread. Bitter herbs consisted of plants such as chicory, bitter cresses, hawkweeds, sow-thistles and wild lettuces, which grew abundantly in the peninsula of Sinai, Palestine and Egypt. Today, bitter herbs are used medicinally to help treat urinary tract infections, kidney stones, fluid retention, achy joints and gout.\n\nIn the Bible, balm was highly prized and celebrated for its medicinal qualities. Extracted from the balsam tree, it was extremely fragrant and extremely valuable. It was actually referred to as the “Balm of Gilead” and held major ceremonial, economic and political importance. The gum was used as incense, and its leaves and berries were used in medicine. Today, according to ISA Ontario, balm can be made into a tea to relieve respiratory congestion and sore throats.\n\nThere you have it! There are 10 of the most popular medicinal plants of Biblical times, used for ceremony, perfumery, sustenance and remedies. Some things never change.", "opengraph": {"locale": "en_US", "type": "article", "title": "10 Natural Remedies Mentioned In The Bible", "description": "It’s pretty remarkable that the natural remedies mentioned in the Bible are still being used thousands of years later. Here’s a few you should know.", "url": "https://thealternativedaily.com/natural-remedies-mentioned-in-the-bible/", "site_name": "The Alternative Daily", "article:publisher": "https://facebook.com/thealternativedaily", "article:published_time": "2017-05-12T05:30:16+00:00", "article:modified_time": "2022-08-10T19:17:30+00:00", "image": "https://s41998.pcdn.co/wp-content/uploads/2017/05/Natural-remedies-in-the-bible.jpg.optimal.jpg", "image:width": "720", "image:height": "410", "image:type": "image/jpeg"}, "tags": ["frankincense", "aloe vera", "biblical remedies", "garlic", "mustard", "bible", "anise", "mint", "ancient herbs", "scripture", "ancient remedies"], "tweets": [], "movies": [], "links": ["javascript:void(0);", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1313538/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1313538/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2664784/", "https://www.thealternativedaily.com/garlic-ultimate-detoxifier/", "https://www.thealternativedaily.com/killer-superbug-end-antibiotics/", "http://biblehub.com/topical/a/anise.htm", "https://www.ncbi.nlm.nih.gov/pubmed/19930003", "https://www.organicfacts.net/health-benefits/herbs-and-spices/mustard.html", "http://biblehub.com/topical/m/mint.htm", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3560544/", "http://www.umm.edu/health/medical/altmed/herb/peppermint", "javascript:void(0);"], "authors": ["", "Katherine Marko"], "publish_date": "2017-05-12T05:30:16+00:00"}