{"result_id": "017012", "URL": "https://thealternativedaily.com/people-who-have-survived-superbugs/", "timestamp": "2023-04-25 11:57:58 CEST+0200", "meta": {"description": "Superbugs — bacteria-resistant infections — are a growing health threat. Here are three patients who survived battles against deadly bacteria.", "lang": "en", "keywords": "", "favicon": "https://s41998.pcdn.co/wp-content/uploads/2017/07/favicon-1.png", "canonical": "https://thealternativedaily.com/people-who-have-survived-superbugs/", "encoding": "UTF-8"}, "image": null, "domain": "thealternativedaily.com", "title": "Surviving Superbugs: 3 Amazing People Who Battled Deadly Bacteria", "cleaned_text": "“Things were so bad for so long, we needed something to go right, and this new procedure was the first piece of good news in a long time. We needed this chance,” explained Chris Benoit about the extraordinary medical miracle that saved his wife’s life.\n\nWoman survives without lungs for six days\n\nJust days before, Melissa Benoit, just 32 and the mother of a three-year-old daughter, lay dying from a combination of bacterial-resistant infections and septic shock that were a consequence of lungs ravaged by cystic fibrosis, a rare genetic disorder.\n\nHowever, a team of Canadian doctors at Toronto General Hospital undertook an extraordinary and undoubtedly risky operation that would ultimately give Benoit a new lease on life. Amazingly, they would remove her diseased lungs while using a state-of-the-art respirator, which would keep her blood oxygenated for six days until she could receive a transplant.\n\nCystic fibrosis is a genetically-based medical condition that adversely impacts the health of the lungs, pancreas, liver and digestive system. Essentially, chromosomal mutations lead to mucus build-up, which makes breathing difficult while leaving individuals significantly more vulnerable to opportunistic infections. In Benoit’s case, a bout with swine flu had left her lungs so debilitated and inflamed that she was literally gasping for air.\n\nBenoit’s lungs were more vulnerable, to begin with, because of her CF. However, antibiotic resistant superbugs are a growing hazard that can strike healthy people too. Doctors treating Benoit has tried using the most advanced medications to kill the bacteria that had invaded her respiratory system, but to little avail. Indeed, her lungs were so full of pus, mucus and blood that it felt as if she was drowning. The medical team treating her reckoned that Benoit’s weakened state meant that she could not survive long enough to receive a lung transplant.\n\nA last-ditch effort to save her life, a thirteen-member team led by Dr. Shaf Keshavjee performed a nine-hour operation to remove Benoit’s diseased lungs. Because a suitable transplant was not yet available, they put Benoit into an induced coma and attached her to two state-of-the-art machines — a Novalung and an EMCO — which essentially oxygenated her blood and pumped it through her body until donor lungs could be surgically implanted. For six days, the artificial medical apparatus did what Benoit’s diseased lungs could no longer do — they “breathed” for her.\n\nSix days later, doctors were able to perform a successful transplant. It would take months before Benoit regained consciousness and was gradually weaned off a ventilator, but she is now breathing on her own. Undoubtedly, she has a long recovery ahead of her, but her new lungs are presently clear of the bacteria, inflammation and impairments caused by CF. Beforehand, she was too weak to even hug her daughter, but now she is walking on her own. Reflecting on how far she’s come Benoit says, “You really come from the brink of death to back living at home. But I’m just so grateful, so happy to be home.”\n\nBenoit had a medical condition made her more vulnerable to bacterial infections. However, the so-called “superbugs” — antibiotic-resistant bacteria — can strike healthy individuals any time. For example, each year two million people are infected with these deadly microbes, 23,000 of them fatally.\n\nAddie Rerecich, from Tuscon, Arizona, was just 11 years old when she suffered a mysterious staph infection that nearly took her life. One day, she was just like any normal child her age. She had just arrived home from a school track meet where she experienced a minor injury. Later that evening she complained of pain in her hip. By the next day, she was in the hospital.\n\nDoctors initially thought Rerecich had a virus. But within days it appeared something was very, very wrong. Despite antibiotics, she developed pneumonia and infected boils all over her body. Her caregivers soon suspected MRSA, a bacterially-based staph infection that caused septic shock. Rerecich may have contracted the antibiotic-resistant strain from a simple scrape or picking her skin. In any event, she was now fighting for her life.\n\nBefore long, bacteria had found its way into Rerecich’s blood stream and she was put on life-support, including a lung bypass machine known as an EMCO. Unfortunately, by this stage, Rerecich had contracted a particularly virulent bacterial strain, known as stenotrophomonas, which may have originated in some of the equipment used to sustain her life. The bacteria that were consuming her life were now pan-resistant, meaning that even the strongest antibiotics were ineffective. Doctors believed that Rerecich’s chances of survival were virtually zero. Her only hope lay in a longshot lung transplant.\n\nThankfully, Rerecich survived her brush with death. Physicians were able to perform a successful double lung transplant, but the young girl’s life will never be the same. In fact, Rerecich requires dozens of pills daily to help prevent the deadly bacteria from ever getting a foothold again. There is no guarantee that she won’t have to fight the same battle again.\n\nA little boy beats all odds in fight against deadly bacteria\n\nBrock Wade was a healthy nine-year-old boy. In the summer of 2009, the youngster was enjoying his last days of summer camp when he suffered a minor scooter accident. His “road rash” amounted to little more than a few cuts and scrapes, but nothing major — so it seemed.\n\nA few weeks later, however, Wade began complaining of severe arm pain following a football practice. It seemed like a minor sport-related injury, but the next day he passed out several times and was rushed to the hospital.\n\nOnce there, doctors discovered Wade had a severely enlarged liver. They initially suspected leukemia, but subsequent tests revealed he had antibiotic resistant MRSA that was attacking his bones. It was so advanced that fluid was filling up his heart and lungs. Wade endured five invasive surgeries, and against all odds, he managed to survive. He left the hospital one month after he was first admitted.\n\nAntibiotic-resistant bacteria have been described as the ultimate medical nightmare. Paradoxically, antibiotics are becoming less effective the more they are prescribed. That’s because the casual and unnecessary use of these drugs has allowed bacteria to evolve ways of beating them.\n\nBenoit, Rerecich and Wade were fortunate. They managed to overcome deadly bacteria, which are proving implacably resistant to our state-of-the-art medicines. Unfortunately, health officials believe the threat from superbugs will only grow worse.\n\nThere are several factors compounding the challenges humanity faces from these especially virulent microorganisms. To begin, health care providers and government agencies are not adequately reporting and tracking superbug outbreaks. After all, many hospitals and health facilities have a vested interest in hiding cases involving contaminated equipment.\n\nSecond, the overuse of antibiotics, both in the practice of medicine and adding it to the feed of livestock, has set the stage for an evolutionary “arms race” between bacteria and humanity’s antibiotics. Right now, it seems that it’s the bacteria that have the edge.\n\nWe can’t keep up with evolving bacteria\n\nAt the same time, pharmaceuticals are not investing in the next generation of antibiotics because the economics don’t add up. After all, the drug makers reason, “Why invest a fortune in a class of drugs that is designed to be used as sparingly as possible?” In other words, where’s the profit in it?\n\nIt is becoming clear that we need to rethink the way we treat bacterial infections. Novel therapeutic approaches, including probiotics, vaccines and the use of live viruses (called bacteriophages, which can kill targeted bacteria) need to be considered.\n\nIn addition, alternate ways of funding pharmaceutical research need to be tried. For instance, Senator Bernie Sanders’ proposal for scrapping for-profit patents in favor of funding medicinal research through cash prizes for successful therapies is an idea that could incentivize drug makers to develop the new generation of antibiotics the world needs.\n\nMedical experts and health officials insist that superbugs represent an extraordinary public health threat. In the past, bacterial resistant infections were usually picked up in hospitals. However, increasingly they have been traced to community type environments such as playgrounds, gyms and other public spaces. One thing is clear: we need to develop defenses faster than bacteria can evolve immunities to our treatments.", "opengraph": {"locale": "en_US", "type": "article", "title": "Surviving Superbugs: 3 Amazing People Who Battled Deadly Bacteria", "description": "Superbugs — bacteria-resistant infections — are a growing health threat. Here are three patients who survived battles against deadly bacteria.", "url": "https://thealternativedaily.com/people-who-have-survived-superbugs/", "site_name": "The Alternative Daily", "article:publisher": "https://facebook.com/thealternativedaily", "article:published_time": "2017-02-06T10:00:04+00:00", "article:modified_time": "2017-02-03T17:23:03+00:00", "image": "https://s41998.pcdn.co/wp-content/uploads/2017/02/Surviving-Superbugs.jpg.optimal.jpg", "image:width": "720", "image:height": "410", "image:type": "image/jpeg"}, "tags": ["cystic fibrosis", "superbugs", "disease", "mrsa", "antibiotics", "inflammation", "sickness", "bacteria", "antibiotic resistant infections"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe src=\"https://www.youtube.com/embed/YADccXOv7V4\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/YADccXOv7V4"}, {"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe loading=\"lazy\" src=\"https://www.youtube.com/embed/plVk4NVIUh8\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/plVk4NVIUh8"}], "links": ["javascript:void(0);", "https://www.washingtonpost.com/news/to-your-health/wp/2017/01/27/they-brought-me-back-from-death-how-a-woman-survived-six-days-without-lungs/", "https://www.cff.org/What-is-CF/About-Cystic-Fibrosis/", "http://www.nbcnews.com/health/health-news/who-labels-drug-resistant-superbugs-fundamental-threat-humans-n651981", "http://www.pbs.org/wgbh/frontline/film/hunting-the-nightmare-bacteria/transcript/", "http://www.idsociety.org/Templates/nonavigation.aspx?Pageid=12884901901&id=12884901905", "http://harvardmagazine.com/2014/05/superbug", "http://www.reuters.com/investigates/special-report/usa-uncounted-surveillance/", "https://www.scientificamerican.com/article/what-are-the-consequences-of-antibiotic-overuse/", "https://www.elsevier.com/atlas/story/people/new-ways-to-beating-superbugs", "https://www.statnews.com/2016/03/14/sanders-hiv-aids-prize/", "javascript:void(0);"], "authors": ["", "Scott O’Reilly"], "publish_date": "2017-02-06T10:00:04+00:00"}