{"result_id": "017018", "URL": "https://thealternativedaily.com/study-finds-connection-narcolepsy-autoimmunity/", "timestamp": "2023-04-25 11:58:06 CEST+0200", "meta": {"description": "When the swine flu swept the world a few years ago, hitting China particularly hard, the nation saw a significant increase in the cases of narcolepsy.", "lang": "en", "keywords": "", "favicon": "https://s41998.pcdn.co/wp-content/uploads/2017/07/favicon-1.png", "canonical": "https://thealternativedaily.com/study-finds-connection-narcolepsy-autoimmunity/", "encoding": "UTF-8"}, "image": null, "domain": "thealternativedaily.com", "title": "Study Finds Connection Between Narcolepsy and Autoimmunity", "cleaned_text": "When the swine flu swept the world a few years ago, hitting China particularly hard, the nation saw a significant increase in the cases of narcolepsy. This disorder is rather mysterious and involves sudden, uncontrollable urges to fall asleep.\n\nIt turns out that not so coincidentally, in Europe about 1 in 800 children who were given a flu vaccine known as Pandemrix, which contained fragments of the virus, were also reported to have developed this chronic disease. Europe’s drug regulator ruled that the vaccine should no longer be used in anyone who is under the age of 20.\n\nA Stanford University sleep disorder specialist and leading expert in narcolepsy, Emmanuel Mignot, said that there was no doubt in his mind whatsoever that Pandemrix was responsible for the increased occurrence of narcolepsy in children in most countries.\n\nSince then, Mignot and immunologist Elizabeth Mellins have discovered the answer to the mystery behind the events, confirming a hypothesis that was long thought to be true in that narcolepsy is an autoimmune disease in which the immune system attacks healthy cells.\n\nTheir study was reported in a recent online issue of Science Translational Medicine, revealing how in genetically susceptible individuals, the disorder can be triggered in part due to a wakefulness protein known as hypocretin which is said to be very similar to part of a protein from the 2009 swine flu virus.\n\nMignot remarked, “The relationship between H1N1 infection (swine flu), vaccination and narcolepsy gave us some interesting insight into possible causes of the condition. In particular, it strongly suggested to us that T cells of the immune system primed to attack H1N1 can occasionally also cross-react with hypocretin and somehow cause the destruction of hypocretin-producing neurons.”\n\nUp until now, this idea was only a hypothesis but their research has found the first direct evidence of autoimmunity. Narcolepsy has been around long before the 2009 swine flu pandemic and as new cases of the disorder also tend to show up shortly after winter and the seasonal peak of flu, it’s thought that other strains or viruses are probably involved as well.\n\nMany autoimmune diseases such as narcolepsy as well as multiple sclerosis are considered life-long disabilities for which there is no known cure. Medications are prescribed only for symptom management.\n\nBut some patients have found they are better able to manage symptoms and even reverse progress of the disease through diet modification including the exclusion of gluten and grains, while consuming foods similar to what are found on the paleo diet that is rich in leafy greens.\n\nFor anyone with an autoimmune disease, a transformation to a healthier lifestyle including a nutritious diet, regular exercise, and practicing stress reduction techniques can make a significant difference in quality of life. While it may take some effort, returning to a “normal” much more enjoyable life is a huge payoff.", "opengraph": {"locale": "en_US", "type": "article", "title": "Study Finds Connection Between Narcolepsy and Autoimmunity", "description": "When the swine flu swept the world a few years ago, hitting China particularly hard, the nation saw a significant increase in the cases of narcolepsy.", "url": "https://thealternativedaily.com/study-finds-connection-narcolepsy-autoimmunity/", "site_name": "The Alternative Daily", "article:publisher": "https://facebook.com/thealternativedaily", "article:published_time": "2014-02-02T08:13:58+00:00", "article:modified_time": "2016-04-02T21:08:17+00:00", "image": "https://s41998.pcdn.co/wp-content/uploads/2014/02/asleep.jpg.optimal.jpg", "image:width": "424", "image:height": "283", "image:type": "image/jpeg"}, "tags": ["narcolepsy and autoimmunity", "narcolepsy", "sleeping", "narcolepsy and vaccinations", "flu vaccine"], "tweets": [], "movies": [], "links": ["javascript:void(0);", "http://www.medicalnewstoday.com/articles/270481.php", "javascript:void(0);"], "authors": ["", "The Alternative Daily"], "publish_date": "2014-02-02T08:13:58+00:00"}