{"result_id": "017029", "URL": "https://thealternativedaily.com/future-without-malaria-near/", "timestamp": "2023-04-25 11:58:20 CEST+0200", "meta": {"description": "In the developed world, malaria means taking some pills when travelling to a foreign country or, worst-case, time spent in a hospital receiving treatment.", "lang": "en", "keywords": "", "favicon": "https://s41998.pcdn.co/wp-content/uploads/2017/07/favicon-1.png", "canonical": "https://thealternativedaily.com/future-without-malaria-near/", "encoding": "UTF-8"}, "image": null, "domain": "thealternativedaily.com", "title": "A Future Without Malaria Nearer Than Ever", "cleaned_text": "In the developed world, malaria means taking some pills when travelling to a foreign country or, worst-case, time spent in a hospital receiving treatment. In developing nations, however, the mosquito-borne illness sickness often means the loss of a parent, sibling, spouse or, most commonly, a child.\n\nAccording to the Center for Disease Control (CDC), malaria is one of the most critical health issues worldwide. More than 300 million people suffer from the disease each year, and it is the leading cause of death in many developing nations. Perhaps even more alarming is that the disease kills one child every thirty seconds worldwide. That is about 3,000 children a day, every day.\n\nThe widespread pervasiveness of malaria is a known cause of poverty, while preventing the disease is relatively cheap. Simply sleeping under a repellant-treated mosquito net, which costs $2, could reduce child mortality by 20% in malaria affected regions. Once contracted, life-saving malaria treatment costs between $2 and $3. Unfortunately, most people infected with the disease do not have enough money to afford effective medical treatment. Likewise, many living in malaria-ridden regions are not adequately educated on preventative measures or treatment programs.\n\nThankfully, the World Health Organization forecasts that 21 countries could be malaria-free by 2020, including six African nations, where 90% of the world’s malaria deaths occurred last year. The disease’s projected eradication is largely attributed to the WHO’s initiative to have malaria completely wiped out in at least 10 countries by the end of this decade.\n\nRecognizing the growing global severity of malaria, disease prevention funding has increased tenfold in the past 12 years. Money contributed toward malaria eradication programs are used for patient diagnosis and treatment plans, insecticides to kill malaria-carrying mosquitos and the purchase of mosquito bed nets. These efforts have helped reduce malaria deaths by 42% over the past decade, according to the Gates Foundation.\n\nThe foundation, initiated by computer giant Bill Gates and his wife Melinda, has allotted a vast amount of its funds to the prevention and eradication of malaria worldwide. In fact, their malaria-targeted program Accelerate to Zero has been a top priority since the foundation’s beginning in 2013.\n\nEradicating malaria is a time-sensitive effort. The mosquito-borne parasite has begun to develop treatment-resistant strains. This makes constant research a critical step in wiping out the aggressive disease. Fortunately, many NGOs and nonprofits such as the Gates Foundation have poured billions of dollars into research, treatment and prevention plans over the past several years. It is estimated that these malaria-fighting programs have come to cost several billion dollars annually.\n\nOn the forefront of the agenda to fight malaria is an anti-malaria vaccine, which has been funded by the Gates Foundation and pharmaceutical company GlaxoSmithKline. Still in the trial phase, the vaccine is currently being used in 11 sites across 7 African countries on children aged 6 weeks to 17 months. The outlook is promising; malaria cases are down by 53% for children between the ages of 5 and 17 months in these trial regions.\n\nDespite the efforts of many companies, nonprofits and NGOs, the sad reality is that more money has been spent on developing cures for baldness than it has for malaria prevention and treatment.\n\nAs expressed by Bill Gates at the Technology, Entertainment and Design conference in 2009, “baldness is a terrible thing and rich men are afflicted. That is why the priority has been set. The market does not drive scientists, thinkers or governments to do the right things. Only by paying attention and making people care can we make as much progress as we need to.”\n\nWe may feel so far removed from the preventable tragedies occurring worldwide that it seems pointless to make efforts to help. But are we really so alienated from absolute poverty that we have become more concerned with vanity than saving the lives of millions of children? Gates sees this first world problem as a “flaw in the pure capitalistic approach” where money drives medical research rather than morality or ethics.\n\nDo you see an ethical problem with the developed world spending more money on baldness research than malaria? Or do you believe that it is not our responsibility to help developing nations?\n\nStephanie Catudal is a mother, writer, hiker and outdoor enthusiast. She can often be found exploring the Ponderosa pine forests of Northern Arizona, or splashing in the cool waters of Sedona’s red rock canyons with her husband and two daughters. Steph is a holistic health enthusiast and finds strength in her personal pursuit of fitness and wellness. She has degrees in Media, Peace and Conflict studies and is passionate about building peace both abroad and within her community.", "opengraph": {"locale": "en_US", "type": "article", "title": "A Future Without Malaria Nearer Than Ever", "description": "In the developed world, malaria means taking some pills when travelling to a foreign country or, worst-case, time spent in a hospital receiving treatment.", "url": "https://thealternativedaily.com/future-without-malaria-near/", "site_name": "The Alternative Daily", "article:publisher": "https://facebook.com/thealternativedaily", "article:published_time": "2016-05-11T05:20:47+00:00", "article:modified_time": "2016-05-10T23:14:21+00:00", "image": "https://s41998.pcdn.co/wp-content/uploads/2016/05/AFutureWithoutMalariaNearerThanEver_640x359.jpg.optimal.jpg", "image:width": "640", "image:height": "359", "image:type": "image/jpeg"}, "tags": ["WHO", "developing nations", "malaria", "Malaria prevention", "Gates foundation"], "tweets": [], "movies": [], "links": ["javascript:void(0);", "http://www.care2.com/causes/more-money-has-been-spent-on-treating-baldness-than-on-malaria.html#ixzz47cnOZkPL", "http://www.care2.com/causes/more-money-has-been-spent-on-treating-baldness-than-on-malaria.html", "http://indianexpress.com/article/world/world-news/twenty-one-countries-six-from-africa-free-of-malaria-by-2020-2769261/", "http://www.cdc.gov/malaria/malaria_worldwide/impact.html", "http://www.unicef.org/media/media_20475.html", "http://www.gatesfoundation.org/What-We-Do/Global-Health/Malaria", "http://www.cdc.gov/malaria/features/vaccines.html", "javascript:void(0);"], "authors": ["", "The Alternative Daily"], "publish_date": "2016-05-11T05:20:47+00:00"}