{"result_id": "017011", "URL": "https://thealternativedaily.com/costa-ricas-land-of-the-strays/", "timestamp": "2023-04-25 11:57:57 CEST+0200", "meta": {"description": "Territorio de Zaguates is the Spanish name for “Land of the Strays.” Adopters can find dogs of every size and type. Between 900 and 1,000 dogs live in", "lang": "en", "keywords": "", "favicon": "https://s41998.pcdn.co/wp-content/uploads/2017/07/favicon-1.png", "canonical": "https://thealternativedaily.com/costa-ricas-land-of-the-strays/", "encoding": "UTF-8"}, "image": null, "domain": "thealternativedaily.com", "title": "Costa Rica’s Land Of The Strays", "cleaned_text": "Territorio de Zaguates is the Spanish name for “Land of the Strays.” Adopters can find dogs of every size and type. Between 900 and 1,000 dogs live in this open-air shelter at any given time. They are all spayed or neutered, vaccinated and given names. Shelter staff gives every dog an individual “breed” name, based on the animal’s appearance and the staff member’s fancy. If a dog requires special veterinary care, he is treated and then stays in quarantine until he’s ready to go into the general canine population.\n\nDogs have indoor and outdoor bedding and feeding areas, along with places for volunteers to bathe and groom them. Since this is a no-kill shelter, they stay at Territorio de Zaguates for as long as it takes them to find a new home, or for the rest of their lives if it works out that way. It truly is a canine paradise. Check out this video explaining more about Land of The Strays:\n\nWhat better place in the world to go for a long hike with a dog — or several hundred? Volunteers lead dogs on scenic hikes daily. On specific days, anyone considering adoption is welcome along. One caveat: the trail is steep, so only fairly fit folks should attempt it. Don’t worry if you aren’t up to the hike, there are plenty of other opportunities to mingle with the mutts.\n\nAlthough Territorio de Zaguates is just an hour from San Jose, Costa Rica’s capital, the property is rural, lush and mountainous. Dogs can drink from streams or water troughs located along the hiking route. And yes, dog poop is picked up every day and disposed of properly — it happens to be one of the visitors’ most frequently asked questions.\n\n“When you adopt a mutt, you adopt a unique breed,” read the billboards advertising the shelter. Potential adopters don’t see dogs in cages, as in traditional animal shelters; they don’t get together for individual “meet and greets.” Instead, adopters view hundreds of dogs at one time — and making a choice is tough. There are dogs of every size, shape, color and hair length. However, there is no pressure on anyone to adopt a dog, and people are welcome to come back again and again until they find that perfect match. Since the shelter runs entirely on donations, contributions on every visit are appreciated.\n\nFor all the good work done by Territorio de Zaguates, it’s just a drop in the bucket in dealing with Costa Rica’s stray dog problem. One thousand is a lot of dogs, but it’s estimated that one million stray dogs roam the country. These homeless animals are often the victims of motor vehicles, or get into fights with other canines. While the dogs of Territorio de Zaguates are rescued from the streets, most Costa Rican street dogs aren’t so lucky.\n\nNot all of the loose dogs in Costa Rica are strays. Costa Ricans often let pet dogs run wild, without collars or any form of identification. The Costa Rica Star reports that other strays are considered community dogs, fed by people in their neighborhoods. Owned pets and community dogs often form packs. While these packs are a scary sight to tourists, most of the dogs ignore people. The true feral dogs look unhealthy and thin, and appear afraid of humans.\n\nAccording to Costa Rica Dog Rescue (CRDR), there is no governmental agency in the country dealing with stray dogs, so it is up to charities and private foundations to rescue these needy animals. The CRDR and other organizations rescue dogs off the street, have them spayed and neutered, dewormed and vaccinated, and make them available for adoption for people in Costa Rica, the United States, Canada and elsewhere. The fee for the dog includes flight expenses and a travel kennel.\n\nJane Meggitt graduated from New York University and worked as a staff writer for a major New Jersey newspaper chain. Her work on pets, equines and health have appeared in dozens of publications, including The Daily Puppy, The Nest Pets, Horse News, Hoof Beats and Horseback magazines.", "opengraph": {"locale": "en_US", "type": "article", "title": "Costa Rica’s Land Of The Strays", "description": "Territorio de Zaguates is the Spanish name for “Land of the Strays.” Adopters can find dogs of every size and type. Between 900 and 1,000 dogs live in", "url": "https://thealternativedaily.com/costa-ricas-land-of-the-strays/", "site_name": "The Alternative Daily", "article:publisher": "https://facebook.com/thealternativedaily", "article:published_time": "2016-04-21T05:35:56+00:00", "article:modified_time": "2016-04-20T18:54:17+00:00", "image": "https://s41998.pcdn.co/wp-content/uploads/2016/04/CostaRicasLandOfTheStrays_640x359-1.jpg.optimal.jpg", "image:width": "640", "image:height": "359", "image:type": "image/jpeg"}, "tags": ["adoption", "dogs", "canine", "Costa Rica", "Territorio de Zaguates", "shelters"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "vimeo", "width": "640", "height": "427", "embed_code": "<iframe src=\"https://player.vimeo.com/video/68726839\" width=\"640\" height=\"427\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://player.vimeo.com/video/68726839"}], "links": ["javascript:void(0);", "https://www.thealternativedaily.com/let-hiking-new-wellness-tool/", "http://www.mnn.com/earth-matters/animals/blogs/700-rescued-mutts-live-life-costa-ricas-land-strays", "http://www.peoplepets.com/2016/03/31/article/stray-dogs-costa-rica-photos", "http://dogtime.com/trending/36737-land-strays-outdoor-sanctuary-adoptable-dogs-costa-rica", "http://www.goodhousekeeping.com/life/a37691/costa-rica-dog-sanctuary/", "http://www.dailymail.co.uk/news/article-3523048/Doggy-Heaven-canine-paradise-Land-Strays-Costa-Rica-nearly-1-000-pooches-allowed-run-free.html", "http://news.co.cr/million-dogs-roam-streets-costa-rica/22622/", "http://news.co.cr/animal-rights-pet-rescue-costa-rica/2043/", "http://www.crdogrescue.com/adoption.html", "javascript:void(0);"], "authors": ["", "The Alternative Daily"], "publish_date": "2016-04-21T05:35:56+00:00"}