{"result_id": "017038", "URL": "https://thealternativedaily.com/superfruit-banana-5-quick-reasons-you-should-be-eating-this-superfood/", "timestamp": "2023-04-25 11:58:33 CEST+0200", "meta": {"description": "I have a funny history with bananas.  When I was younger I loved banana flavored things but did not like fresh banana. I know it's weird.  When I was in", "lang": "en", "keywords": "", "favicon": "https://s41998.pcdn.co/wp-content/uploads/2017/07/favicon-1.png", "canonical": "https://thealternativedaily.com/superfruit-banana-5-quick-reasons-you-should-be-eating-this-superfood/", "encoding": "UTF-8"}, "image": null, "domain": "thealternativedaily.com", "title": "Superfruit Banana: 5 Quick Reasons You Should Be Eating This Superfood", "cleaned_text": "I have a funny history with bananas. When I was younger I loved banana flavored things but did not like fresh banana. I know it’s weird. When I was in college I worked with an older man who I guessed was in his late 50’s. The more I got to know him, he revealed that he was 70! What was his secret weapon to feel and look 20 years younger?\n\nOne day he dramatically revealed his health secret….Bananas! I was surprised to find out he ate 2 bananas a day, one for breakfast and one after dinner.\n\nA few years later I hired a personal trainer. Like any good personal trainer he gave my diet a makeover and had me eat a banana before and after I worked out. He explained eating a banana before my workout would give me energy and helps my muscles to contract and expand smoothly, and after eating a banana will replace crucial vitamins and minerals lost during my workout.\n\nSo began my affection for real fresh banana’s.\n\nHere’s the 411 on this superfruit:\n\n1. Loaded with 400 mg of Potassium. Foods high in potassium are critical nutrition for your heart, nerves, bones, and kidney health. The potassium suppresses calcium excretion, which decreases your risk of kidney stones and minimizes the loss of calcium which can reduce the risk of osteoporosis\n\n2. An excellent source of fiber, a medium banana contains 16% of your DRV\n\n3. It contains 20% of your DRV of vitamin B6. Vitamin B6 helps your body make hemoglobin which is excellent for nourishing your blood. Vitamin B6 benefits your body for antibody production to maintain healthy immune response.\n\n4. A medium size Banana contains only about 110 calories and is fat free, naturally!\n\n5. It also has 16% of your DRV of Vitamin C. Vitamin C protects the body against oxidative stress.\n\nBananas are one healthy food for your body that you should eat at least one a day. You can find them in any grocery store and they are really inexpensive.\n\nHere is my family’s favorite way to eat bananas. Blend some low-fat yogurt (any flavor), a banana, some frozen strawberries, and orange juice or milk together; insert straw, enjoy!\n\nAs a Health and Wellness expert, Angela is helping people unleash their super-power ability to prevent their bodies from getting sick in the future. Angela is also a Children’s Health Advocate and founder of the popular Change Your Food Change Your Future program, proving of all the things we control and make decisions about every single day…. there is one that you absolutely must get right.", "opengraph": {"locale": "en_US", "type": "article", "title": "Superfruit Banana: 5 Quick Reasons You Should Be Eating This Superfood", "description": "I have a funny history with bananas.  When I was younger I loved banana flavored things but did not like fresh banana. I know it's weird.  When I was in", "url": "https://thealternativedaily.com/superfruit-banana-5-quick-reasons-you-should-be-eating-this-superfood/", "site_name": "The Alternative Daily", "article:publisher": "https://facebook.com/thealternativedaily", "article:published_time": "2012-05-08T18:50:42+00:00", "article:modified_time": "2016-04-07T18:53:15+00:00", "image": "https://s41998.pcdn.co/wp-content/uploads/2012/05/5reasonsbanana.png", "image:width": "610", "image:height": "250", "image:type": "image/png"}, "tags": ["diet", "superfoods", "natural health"], "tweets": [], "movies": [], "links": ["javascript:void(0);", "http://changeyourfoodchangeyourfuture.com/", "javascript:void(0);"], "authors": ["", "Susan Patterson"], "publish_date": "2012-05-08T18:50:42+00:00"}