{"result_id": "017035", "URL": "https://thealternativedaily.com/protect-pets-against-rabies/", "timestamp": "2023-04-25 11:58:29 CEST+0200", "meta": {"description": "Rabies, also known as hydrophobia, is a fatal viral disease transmitted via the bite of a rabid animal. While most cases occur in wild mammals, domestic", "lang": "en", "keywords": "", "favicon": "https://s41998.pcdn.co/wp-content/uploads/2017/07/favicon-1.png", "canonical": "https://thealternativedaily.com/protect-pets-against-rabies/", "encoding": "UTF-8"}, "image": null, "domain": "thealternativedaily.com", "title": "Protect Your Pets Against The Scourge Of Rabies", "cleaned_text": "Rabies, also known as hydrophobia, is a fatal viral disease transmitted via the bite of a rabid animal. While most cases occur in wild mammals, domestic animals can contract rabies through a bite.\n\nIf you own the following species, a rabies vaccination is necessary:\n\nSwine can contract rabies, but there is currently no approved vaccine for pigs. Smaller rodents and lagomorphs, such as hamsters, gerbils and rabbits, very rarely have rabies. More importantly, these smaller species are not known to transmit the virus to humans. Fish, birds and reptiles are not susceptible to the disease. Bats, however, are often victims and transmitters of rabies.\n\nRabies appears in two forms: dumb and furious. Symptoms are most recognizable in the furious form because odd behavior and aggression are apparent. Signs of furious rabies include:\n• None Behavioral changes, especially a friendly animal becoming shy or vice versa\n• None No interest in food or water\n\nNot long before the animal dies, the classic “foaming at the mouth” occurs, caused by paralysis of the throat and inability to swallow.\n\nAnimals with dumb rabies may not show aggression but quickly become extremely lethargic, disoriented and lose coordination. Paralysis and death follow.\n\nBeware of any nocturnal wildlife out during the day. That’s a classic sign of rabies.\n\nThe Centers for Disease Control (CDC) reports that 247 cats and 89 dogs were reported as rabid in 2013 (that’s the last year for which the CDC provides statistics). For both species, the majority of cases occurred on the East Coast. Texas was overrepresented for its share of rabid domestic animals.\n\nIn most places, the law requires that only a licensed veterinarian administer a rabies vaccination. It’s not a vaccine you can order online or pick up at your local farm supply store. The recommended vaccination schedule for puppies and kittens involves an initial dose at the age of four months. At the age of one, the young animal should have a booster shot and then receive additional boosters every three years. If an adult dog or cat is found with an unknown vaccination history, the animal should receive the first dose promptly, a booster one year later and then go on the every-third-year schedule. Laws regarding rabies vaccination vary by state, and the mandated ages for the first vaccination depend on local statutes.\n\nMost animals do not have any reactions to the rabies vaccination, but there are always exceptions. Mild reactions may include pain or swelling at the injection site. In a worst-case scenario, the animal goes into anaphylactic shock as a result of the injection. Fortunately, such reactions usually occur just moments after the shot, so the vet can administer emergency drugs and stabilize the animal.\n\nRarely, cats may develop a sarcoma, or cancerous tumor, at the site of the rabies injection. For that reason, felines receive the shot in the left hind leg. If a tumor does develop, the vet can amputate the leg and save the animal’s life.\n\nIf vaccinating your pet “poses an unacceptably high risk to the health of the individual animal,” some states allow your veterinarian to sign and submit a waiver form, which is sent to public health authorities. You and the vet must file this form annually. Do not approach your vet about a rabies exemption waiver simply because you do not like vaccines; a demonstrable health risk to your pet must exist or the veterinarian could lose her license.\n\nIf your pet bites someone and isn’t up to date on his vaccination, he’ll require quarantine. The only way to accurately determine whether an animal has rabies is by euthanizing him, then having the state health department exam the brain tissue. You don’t want that happening to Fido or Fluffy, so quarantine is the only alternative. Although quarantine laws vary by state, generally the animal must be quarantined by the owner for a minimum of 10 days. This means not leaving the property and not coming into contact with any other animals.\n\nIf your pet is unvaccinated and is exposed to an animal with rabies, euthanasia is recommended. If you can’t tolerate that, most states will permit a strict six-month quarantine, but that’s not at your home. Your pet is held in confinement at a special veterinary facility, and you are responsible for boarding and related fees.\n\nAlthough the chances of your pet contracting rabies is slim, it is still possibility. It’s best to be proactive and protect your beloved pet — and yourself — from this deadly disease.\n\nJane Meggitt graduated from New York University and worked as a staff writer for a major New Jersey newspaper chain. Her work on pets, equines and health have appeared in dozens of publications, including The Daily Puppy, The Nest Pets, Horse News, Hoof Beats and Horseback magazines.", "opengraph": {"locale": "en_US", "type": "article", "title": "Protect Your Pets Against The Scourge Of Rabies", "description": "Rabies, also known as hydrophobia, is a fatal viral disease transmitted via the bite of a rabid animal. While most cases occur in wild mammals, domestic", "url": "https://thealternativedaily.com/protect-pets-against-rabies/", "site_name": "The Alternative Daily", "article:publisher": "https://facebook.com/thealternativedaily", "article:published_time": "2016-04-19T05:35:09+00:00", "article:modified_time": "2022-01-10T10:31:58+00:00", "image": "https://s41998.pcdn.co/wp-content/uploads/2016/04/Fotolia_67564132_Subscription_Monthly_M.jpg.optimal.jpg", "image:width": "640", "image:height": "359", "image:type": "image/jpeg"}, "tags": ["vaccinations", "dogs", "hydrophobia", "cats", "horses"], "tweets": [], "movies": [], "links": ["javascript:void(0);", "https://www.thealternativedaily.com/cdc-reveals-flu-vaccine-effective-season/", "https://www.avma.org/Advocacy/StateAndLocal/Pages/rabies-vaccination.aspx", "http://www.cdc.gov/rabies/exposure/animals/domestic.html", "http://www.cdc.gov/rabies/", "http://www.vetmed.ucdavis.edu/vmth/small_animal/internal_medicine/newsletters/vaccination_protocols.cfm", "https://www.vetinfo.com/rabies-vaccine-side-effects-for-cats.html", "https://www.vetinfo.com/canine-rabies-vaccine-side-effects.html", "http://csu-cvmbs.colostate.edu/Pages/rabies-vaccine.aspx", "https://njaes.rutgers.edu/pubs/fs1228/", "http://www.merckvetmanual.com/mvm/nervous_system/rabies/overview_of_rabies.html", "http://www.cdc.gov/rabies/exposure/animals/domestic.html", "http://www.petmd.com/blogs/thedailyvet/dr-coates/2015/february/new-recommendation-rabies-quarantine-32461", "javascript:void(0);"], "authors": ["", "The Alternative Daily"], "publish_date": "2016-04-19T05:35:09+00:00"}