{"result_id": "017016", "URL": "https://thealternativedaily.com/will-you-be-getting-the-flu-shot-this-year-video/", "timestamp": "2023-04-25 11:58:03 CEST+0200", "meta": {"description": "If you spend any time watching television, going to a drug store, or even going to your local Target, you have probably seen advertisements for getting a", "lang": "en", "keywords": "", "favicon": "https://s41998.pcdn.co/wp-content/uploads/2017/07/favicon-1.png", "canonical": "https://thealternativedaily.com/will-you-be-getting-the-flu-shot-this-year-video/", "encoding": "UTF-8"}, "image": null, "domain": "thealternativedaily.com", "title": "Will You Be Getting the Flu Shot This Year? [Video]", "cleaned_text": "If you spend any time watching television, going to a drug store, or even going to your local Target, you have probably seen advertisements for getting a flu shot. However, many people are confused about whether they should get one or if it is a good idea at all.\n\nThere are mixed conclusions about the effectiveness of flu shots. The truth is there are usually several strains of the flu that go around every year, throughout the year. Flu shots only target specific flu strain types. As a result, even if you get a shot, you may not be protected against a form of the flu that is not contained in the vaccine you receive.\n\nDr. James Mahoney, Founder of the the Center for Hope and Healing, discusses the ins and outs of the flu shot in the video below…\n\nAs Dr. Mahoney points out, if you are allergic to egg products, speak to your health care practitioner about the flu shot, since they contain egg products in the ingredients. Also, if you have an infection or are running a fever you should avoid a shot until that health problem is resolved. Other people who should not get flu shots include people with low vitamin D levels or who already have potentially compromised immune systems.\n\nThe vaccine also contains formaldehyde as a preservative. Many people question whether it is a good idea to inject this chemical into their bodies and decide against the annual shot.\n\nOnly you can decide if getting a flu shot is a good idea for you and your family. If you have questions about the vaccination, talk to your doctor and become educated about the benefits and disadvantages before making a choice.", "opengraph": {"locale": "en_US", "type": "article", "title": "Will You Be Getting the Flu Shot This Year? [Video]", "description": "If you spend any time watching television, going to a drug store, or even going to your local Target, you have probably seen advertisements for getting a", "url": "https://thealternativedaily.com/will-you-be-getting-the-flu-shot-this-year-video/", "site_name": "The Alternative Daily", "article:publisher": "https://facebook.com/thealternativedaily", "article:published_time": "2012-10-25T21:18:59+00:00", "article:modified_time": "2016-04-06T01:08:55+00:00", "image": "https://s41998.pcdn.co/wp-content/uploads/2012/10/flushot.png", "image:width": "200", "image:height": "200", "image:type": "image/png"}, "tags": ["flu", "vaccine", "video"], "tweets": [], "movies": [], "links": ["javascript:void(0);", "http://www.naturalhealthcoach.com", "javascript:void(0);"], "authors": ["", "The Alternative Daily"], "publish_date": "2012-10-25T21:18:59+00:00"}