{"result_id": "017042", "URL": "https://www.thealternativedaily.com/what-is-cruise-ship-sickness/", "timestamp": "2023-04-25 11:58:38 CEST+0200", "meta": {"description": "In February 2010, the Celebrity Mercury cruise ship departed from Charleston, S.C. The 1,800-plus passengers on board were looking forward to a fun-filled", "lang": "en", "keywords": "", "favicon": "https://s41998.pcdn.co/wp-content/uploads/2017/07/favicon-1.png", "canonical": "https://thealternativedaily.com/what-is-cruise-ship-sickness/", "encoding": "UTF-8"}, "image": null, "domain": "www.thealternativedaily.com", "title": "What is Cruise Ship Sickness?", "cleaned_text": "In February 2010, the Celebrity Mercury cruise ship departed from Charleston, S.C. The 1,800-plus passengers on board were looking forward to a fun-filled vacation in the sunny Caribbean. Instead, more than 400 of them spent their vacation in their cabin bathrooms, plagued by severe stomach pains, vomiting, and diarrhea. The following year, more than 1,300 passengers on 14 cruise ships were stricken with the same gastrointestinal woes.\n\n\n\n The illness that’s often described as the “cruise ship sickness” is norovirus–a group of viruses that infect the stomach and intestines. Though norovirus has earned a reputation as a cruise-wrecker, it doesn’t just strike at sea. It can spread wherever you share food or a confined space with a group of people, including restaurants, hospitals, nursing homes, and the airplane that transports you to your summer vacation destination.\n\nThe U.S. Centers for Disease Control and Prevention estimates that 1 in 15 Americans of all ages will become infected with norovirus each year.\n\nYou can catch norovirus by coming into direct contact with someone who is sick, or pick it up by touching surfaces or eating foods that have been contaminated with the virus. Norovirus also spreads through airborne droplets. A little bit of norovirus goes a long way. It takes just a small amount of the virus–only 10 microscopic particles–to make you sick.\n\nIf you’ve been exposed to norovirus, it will take a day or two for the symptoms to show. Those hallmark symptoms–which include vomiting, watery diarrhea, and stomach cramps–are due to stomach inflammation, called gastroenteritis. Norovirus is sometimes described as “food poisoning,” which is accurate, although other viruses can also cause food poisoning.\n\nIt’s hard to tell strictly by appearance whether someone has norovirus. A person can stay contagious for at least three days after fully recovering, so someone can look completely healthy yet still harbor the virus.\n\nBecause it’s impossible to know where norovirus is lurking, your best defense is to follow a few simple precautions whenever you travel, eat out, or share close quarters with other people:\n\n1. Wash your hands with warm water and soap, or use an alcohol-based hand sanitizer throughout the day, especially before eating and after using the bathroom or touching other people or common surfaces.\n\n2. Wash fruits and vegetables and cook oysters and other shellfish thoroughly before eating them. Raw fruits, vegetables, and seafood can all harbor the norovirus.\n\n3. Keep your hands away from your eyes, nose, and mouth.\n\n4. If you catch norovirus, stay home until you’re feeling better. Don’t prepare food for anyone else until at least three days after you’ve recovered.\n\nIf You Get Sick\n\nResearchers are working on a vaccine that would protect against norovirus, but it’s not available just yet. Right now, you can’t turn to your medicine cabinet for relief because there are no medicines that treat norovirus. That includes antibiotics, which only work against bacterial illnesses–not viruses.\n\nThe best way to treat norovirus is to rest until you feel better. Drink plenty of fluids or suck on ice cubes so you don’t get dehydrated. A sports drink or oral rehydration solution can replace the electrolytes you’ve lost through vomiting and diarrhea.\n\nThe bad news is that norovirus can put you totally out of commission. The good news is the misery should only last for a day or two, and if you’re otherwise healthy you shouldn’t have any serious, long-term effects from the virus.\n\n(C) 2012. PRESIDENT AND FELLOWS OF HARVARD COLLGE. ALL RIGHTS RESERVED DISTRIBUTED BY TRIBUNE MEDIA SERVICES, INC.", "opengraph": {"locale": "en_US", "type": "article", "title": "What is Cruise Ship Sickness?", "description": "In February 2010, the Celebrity Mercury cruise ship departed from Charleston, S.C. The 1,800-plus passengers on board were looking forward to a fun-filled", "url": "https://thealternativedaily.com/what-is-cruise-ship-sickness/", "site_name": "The Alternative Daily", "article:publisher": "https://facebook.com/thealternativedaily", "article:published_time": "2012-07-06T05:32:53+00:00", "article:modified_time": "2016-04-07T18:04:51+00:00", "image": "https://s41998.pcdn.co/wp-content/uploads/2012/07/cruiseship.png", "image:width": "610", "image:height": "250", "image:type": "image/png"}, "tags": ["vacation", "norovirus"], "tweets": [], "movies": [], "links": ["javascript:void(0);", "javascript:void(0);"], "authors": ["", "The Alternative Daily"], "publish_date": "2012-07-06T05:32:53+00:00"}