{"result_id": "017009", "URL": "https://thealternativedaily.com/ways-protect-you-your-family-from-deadly-coronavirus/", "timestamp": "2023-04-25 11:57:54 CEST+0200", "meta": {"description": "Is the media sensationalizing this virus or is it a global emergency? What exactly is a coronavirus and how can you protect your family from this threat?", "lang": "en", "keywords": "", "favicon": "https://s41998.pcdn.co/wp-content/uploads/2017/07/favicon-1.png", "canonical": "https://thealternativedaily.com/ways-protect-you-your-family-from-deadly-coronavirus/", "encoding": "UTF-8"}, "image": null, "domain": "thealternativedaily.com", "title": "5 Ways to Protect You and Your Family From Deadly Coronavirus", "cleaned_text": "Unless you’ve been living under a rock for the past few weeks, you’ve likely heard about and been sufficiently terrorized by reports of a new, deadly coronavirus that is sweeping the globe. Is the media sensationalizing this virus, or is it a legitimate global emergency? What exactly is a coronavirus, and how can you protect your family from this invisible threat? Read on as we unmask the truth behind the outbreak.\n\nFirst detected in late December in the Chinese city of Wuhan, this coronavirus, or 2019-nCoV, has now infected an estimated 4,565 people and caused at least 106 deaths. Though officials have enacted a quarantine and are restricting air travel, the disease has already spread to other countries, including the United States, Germany, Australia, Japan, Thailand, France, South Korea, Vietnam, and Canada. There have been five reported cases in America with all of the infected patients having recently traveled to Wuhan, China, which is the epicenter of the outbreak.\n\nWhat exactly is the coronavirus?\n\nThough this is a “novel” or unstudied illness that has never been seen before, it very clearly affects the respiratory system and can lead to pneumonia in certain cases. Coronaviruses are not new; however, this particular strain acts differently than many other upper respiratory tract illnesses since it is accompanied by a fever, cough, and shortness of breath but not other hallmarks of respiratory illness such as sneezing or runny nose.\n\nCoronaviruses, according to the World Health Organization (WHO), are a large family of viruses that can cause a range of illnesses, from the common cold to Severe Acute Respiratory Syndrome (SARS). In 2002-2003 there was a massive outbreak of the coronavirus SARS which originated in China and spread to other countries, leading to at least 770 deaths around the world.\n\nWhere did it come from?\n\nThis coronavirus began at an animal and seafood market in the city of Wuhan and has since spread to several other countries, including the United States. The illness is now said to be transferable between humans, and it is zoonotic, meaning it can spread between animals and people.\n\nWhat is being done about this scary virus?\n\nThe United States public health officials have taken the containment of this virus very seriously, and the U.S. is coordinating evacuation efforts of Americans who are currently in Wuhan, China. Officials are now screening for the virus at 20 airports in the united states. These screenings will involve a questionnaire about travelers’ time in China and a non-contact thermostat to check for fever.\n\nThis screening is used to help monitor potential cases coming into the United States and to help experts understand how quickly the virus works and detect early symptoms. Since the coronavirus is so new and so rapidly spreading, it is essential to garner as much information as possible to get an accurate diagnosis and begin treatment as soon as possible while avoiding further contamination.\n\nWith such a long incubation period (experts estimate 2-14 days), continued monitoring of those who have potentially come in contact with the virus is critical. In two of the confirmed coronavirus cases in the U.S., the patients were not exhibiting symptoms when they returned from Chia, but only developed symptoms once they had been home for a few days. Though there have been no reported cases of human to human transmission in the U.S., little is known about this virus, so it is important to take precautions to protect you and your family. However, do not panic and keep in mind that your chances of developing this coronavirus aren’t high at the moment unless you have traveled to Hubei Province in China recently and contracted it from the source.\n\nWuhan and over a dozen other Chinese cities have adopted transport restrictions, affecting 56 million people to help prevent the spread of the virus during the busy Lunar New Year travel season. China is also now allowing experts from WHO into the country to help study and contain the epidemic.\n\nWhy is it such a problem?\n\nUnlike other viruses that have been studied for years, this particular coronavirus has taken scientists by surprise. They know very little about how it works and have not yet been able to develop a vaccine or specific medication to target this virus. Plus, each coronavirus is different, which means that even if you were exposed to another one, you would not have immunity against this strain. That leaves the entire population vulnerable to infection. However, like most viruses, the elderly or others with a compromised immune system are more likely to contract the virus.\n\nAre you at risk?\n\nThe CDC maintains that the threat of infection in the United States is low. However, it has been confirmed that human to human transmission is possible. Unless you have been to China recently or been in contact with someone infected with the virus, a normal cough or cold symptoms should not be cause for concern, according to the NHS.\n\nTo put things into perspective and take a little bit of the mystery out of this hyped-up story, according to the Centers for Disease Control and Prevention, there have been at least 15 million cases of the flu and 8,200 deaths in the United States this season. That just goes to show that you are far more at risk from traditional influenza than this most recent coronavirus.\n\nHow to protect you and your family\n\nThe single best way to protect you and your family from a variety of illnesses is to wash your hands properly and frequently. Wash hands with soap and water before eating, after using the bathroom, after blowing your nose, coughing or sneezing, and before and after caring for a sick friend or a family member. Scrub for at least 20 seconds and dry with a clean towel.\n\nNaturally, the closer in proximity you are to an infected person, the more likely you are to catch the same illness. Avoid spending time around anyone with flu or cold-like symptoms.\n\nAlong with staying away from any animal market and avoiding contact with live animals, (especially if you are in the affected area of China), be sure to practice proper food safety guidelines at home.\n\nAvoid touching anywhere on your face, including your nose, eyes, and mouth, as any bacteria or virus can survive on your hands and enter your body through these vulnerable locations.\n\nThough this is more about kindness and protection for other people than yourself, if you are sick with the flu, sneeze and cough into your elbow to help avoid spraying bacteria all over nearby surfaces.\n\nThe World Health Organization (WHO), has acknowledged that the respiratory illness is an emergency in China but has also maintained that it is too early to declare the outbreak a public health emergency of international concern. However, is has also described the global risk from the virus as high.", "opengraph": {"locale": "en_US", "type": "article", "title": "5 Ways to Protect You and Your Family From Deadly Coronavirus", "description": "Is the media sensationalizing this virus or is it a global emergency? What exactly is a coronavirus and how can you protect your family from this threat?", "url": "https://thealternativedaily.com/ways-protect-you-your-family-from-deadly-coronavirus/", "site_name": "The Alternative Daily", "article:publisher": "https://facebook.com/thealternativedaily", "article:published_time": "2020-01-28T23:15:05+00:00", "article:modified_time": "2020-02-03T17:06:11+00:00", "image": "https://s41998.pcdn.co/wp-content/uploads/2020/01/AdobeStock_317756581.jpeg.optimal.jpeg", "image:width": "960", "image:height": "540", "image:type": "image/jpeg"}, "tags": ["flu", "pneumonia", "news", "outbreak", "deadly virus", "virus", "sick", "breaking", "repiratory illness", "coronavirus"], "tweets": [], "movies": [], "links": ["javascript:void(0);", "https://www.washingtonpost.com/world/asia_pacific/coronavirus-china-live-updates/2020/01/28/da7664f2-414d-11ea-b503-2b077c436617_story.html", "https://www.foxnews.com/health/how-to-protect-yourself-from-coronavirus", "https://www.digitaltrends.com/news/cdc-expands-coronavirus-screenings/", "https://www.nbcnews.com/health/health-news/more-100-tested-coronavirus-u-s-just-5-cases-confirmed-n1123401", "https://www.nbcnews.com/health/health-news/how-does-new-coronavirus-spread-n1121856", "https://www.nhs.uk/conditions/cough/", "https://www.washingtonpost.com/world/asia_pacific/coronavirus-china-live-updates/2020/01/28/da7664f2-414d-11ea-b503-2b077c436617_story.html", "https://www.cdc.gov/handwashing/when-how-handwashing.html", "javascript:void(0);"], "authors": ["", "The Alternative Daily"], "publish_date": "2020-01-28T23:15:05+00:00"}