{"result_id": "017008", "URL": "https://thealternativedaily.com/legitimate-concerns-about-vaccinations/", "timestamp": "2023-04-25 11:57:53 CEST+0200", "meta": {"description": "Most of us grew up being vaccinated and our parents didn’t question it because everyone simply followed what they thought was the “science behind it.”", "lang": "en", "keywords": "", "favicon": "https://s41998.pcdn.co/wp-content/uploads/2017/07/favicon-1.png", "canonical": "https://thealternativedaily.com/legitimate-concerns-about-vaccinations/", "encoding": "UTF-8"}, "image": null, "domain": "thealternativedaily.com", "title": "Legitimate Concerns About Vaccinations", "cleaned_text": "Most of us grew up being vaccinated and our parents didn’t question it because everyone simply followed what they thought was the “science behind it.” Some of us even have dent-like scars on our upper arms. However, in our ever-changing world where everyone is trying to live as healthily as possible, vaccines are being scrutinized, especially with new scientific evidence surfacing and doctors who are backing the evidence.\n\nDr. Ulrich H. von Andrian at Harvard Medical School is one whose research might not be well received by pharmaceutical and vaccine industries. In the journal Immunity he was quoted,\n\nOur findings contradict the current view that antibodies are absolutely required to survive infection with viruses like VSV (vesicular stomatitis virus), and establish an unexpected function for B cells as custodians of macrophages in antiviral immunity. It will be important to further dissect the role of antibodies and interferons in immunity against similar viruses that attack the nervous system, such as rabies, West Nile virus and Encephalitis.\n\nThe definition of vaccine is, “a substance used to stimulate the production of antibodies and provide immunity against one or several diseases, prepared from the causative agent of a disease, its products or a synthetic substitute, treated to act as an antigen without inducing the disease.” Dr. Russell Blaylock, a retired neurosurgeon, is a reason that definition could soon be changing. He believes that vaccines actually reduce the immune system’s ability to create TH2-type cytokines, and restrain cellular immunity, which is how the body protects itself against deadly viruses and bacteria.\n\nOur innate immune system should be given more credit according to this new research. The research suggests the possibility that in the future, vaccine popularity will subside and people will turn to their immune systems to adjust and fend off new viruses and bacteria. In the mean time, it is best to do your research and speak to your health care provider about all of the concerns you have regarding vaccinations.", "opengraph": {"locale": "en_US", "type": "article", "title": "Legitimate Concerns About Vaccinations", "description": "Most of us grew up being vaccinated and our parents didn’t question it because everyone simply followed what they thought was the “science behind it.”", "url": "https://thealternativedaily.com/legitimate-concerns-about-vaccinations/", "site_name": "The Alternative Daily", "article:publisher": "https://facebook.com/thealternativedaily", "article:published_time": "2012-03-31T18:06:52+00:00", "article:modified_time": "2016-04-07T19:17:16+00:00", "image": "https://s41998.pcdn.co/wp-content/uploads/2012/03/vaccines.png", "image:width": "610", "image:height": "250", "image:type": "image/png"}, "tags": ["vaccine", "natural health", "immune system"], "tweets": [], "movies": [], "links": ["javascript:void(0);", "http://www.naturalnews.com/035371_vaccine_theory_antibodies_viruses.html", "http://www.naturalnews.com/035371_vaccine_theory_antibodies_viruses.html", "javascript:void(0);"], "authors": ["", "The Alternative Daily"], "publish_date": "2012-03-31T18:06:52+00:00"}