{"result_id": "017026", "URL": "https://thealternativedaily.com/aluminum-toxicity-you-might-need-more-magnesium/", "timestamp": "2023-04-25 11:58:16 CEST+0200", "meta": {"description": "Chances are that you’ve heard of mercury poisoning, food poisoning and possibly even hemlock poisoning, but have you ever heard of aluminum poisoning? Not", "lang": "en", "keywords": "", "favicon": "https://s41998.pcdn.co/wp-content/uploads/2017/07/favicon-1.png", "canonical": "https://thealternativedaily.com/aluminum-toxicity-you-might-need-more-magnesium/", "encoding": "UTF-8"}, "image": null, "domain": "thealternativedaily.com", "title": "Aluminum Toxicity? You Might Need More Magnesium", "cleaned_text": "Chances are that you’ve heard of mercury poisoning, food poisoning and possibly even hemlock poisoning, but have you ever heard of aluminum poisoning? Not many people have heard of this type of poisoning, so they are not aware of how common it is and the detrimental effects it can have on a person. There are many different ways you can get aluminum poisoning. While everyone has some aluminum in their system, anything over 9000 units is considered to be extremely high, creating a huge health risk.\n\nThe ways that aluminum poisoning is acquired include; using aluminum cookware, canned food, canned soda, aluminum sulfate baking powder, soft water, deodorants and more. Aluminum poison has also been linked to various vaccines as aluminum is used as an ingredient in some.\n\nThe reason certain people are more likely to get poisoned than others is because magnesium helps fight off aluminum from the body. Those who have normal amounts of magnesium are able to excrete the aluminum from the body easily, so levels stay normal and buildup doesn’t occur. However, those without enough magnesium in the body will retain the aluminum.\n\nWhen the body cannot get rid of aluminum it stores within the brain and causes anatomical changes to the nerve centers. Those who suffer with aluminum poisoning often suffer from physical symptoms such as; muscle pain, appetite loss, colic, convulsions, excessive dry mouth, stomach pain, stomach ulcers, hardened stools and pain in the spleen. By getting more magnesium in your body, you can get rid of the aluminum poisoning and get yourself back to normal. However, if you let the aluminum stay in the brain it can lead to long-term problems such as early Alzheimer’s and dementia.\n\nA blood test at your doctor’s office can check your levels of aluminum. While this test is not standard, it is something you should have done if you have concerns about the level of aluminum in your body. Your doctor can also test your magnesium levels and place you on a supplement to excrete the aluminum.\n\nIf you’re deficient in magnesium you’ll often experience anxiety, disorientation, hyperactivity, insomnia and sound sensitivity. Almonds, cashews, walnuts, flax seeds and sunflower seeds are all great sources to naturally get magnesium throughout the day. By becoming more aware of this type of poisoning and the conditions it can cause, you can take the steps to treat or prevent it from occurring. Other than magnesium, vitamins E,C and Metaline can help protect your body against high levels of aluminum.\n\nHave you had your aluminum checked? Do you feel like you are getting enough magnesium to combat it?", "opengraph": {"locale": "en_US", "type": "article", "title": "Aluminum Toxicity? You Might Need More Magnesium", "description": "Chances are that you’ve heard of mercury poisoning, food poisoning and possibly even hemlock poisoning, but have you ever heard of aluminum poisoning? Not", "url": "https://thealternativedaily.com/aluminum-toxicity-you-might-need-more-magnesium/", "site_name": "The Alternative Daily", "article:publisher": "https://facebook.com/thealternativedaily", "article:published_time": "2013-02-16T00:30:07+00:00", "article:modified_time": "2016-04-05T23:52:56+00:00", "image": "https://s41998.pcdn.co/wp-content/uploads/2013/02/magnesium.png", "image:width": "200", "image:height": "144", "image:type": "image/png"}, "tags": ["alternative remedies", "vitamins", "supplements", "magnesium"], "tweets": [], "movies": [], "links": ["javascript:void(0);", "http://www.whale.to/vaccine/west_edda.html", "javascript:void(0);"], "authors": ["", "The Alternative Daily"], "publish_date": "2013-02-16T00:30:07+00:00"}