{"result_id": "017019", "URL": "https://thealternativedaily.com/6-reasons-essential-oils-are-not-a-fad/", "timestamp": "2023-04-25 11:58:07 CEST+0200", "meta": {"description": "Your average health practitioner would roll their eyes if they saw the title of this post. They’d pass it off as just another pseudo-health fanatic who’s", "lang": "en", "keywords": "", "favicon": "https://s41998.pcdn.co/wp-content/uploads/2017/07/favicon-1.png", "canonical": "https://thealternativedaily.com/6-reasons-essential-oils-are-not-a-fad/", "encoding": "UTF-8"}, "image": null, "domain": "thealternativedaily.com", "title": "6 Reasons Essential Oils Are Not A Fad", "cleaned_text": "Your average health practitioner would roll their eyes if they saw the title of this post. They’d pass it off as just another pseudo-health fanatic who’s raving on about something they know nothing about, and something which modern medicine has only a tentative grasp on.\n\nAnd if you stumbled across many of the amateur lifestyle/health/wellness websites littering the net, you’d probably be inclined to agree. From the impression some of these websites give, essential oils are the solution to all our problems — the cure-all that mankind has been seeking all these years, the one great remedy which can heal all ailments.\n\nAnd while I admire the fervor and devotion these people have to essential oils, I would also be the first to take them aside and give them a stern telling-off for spreading wild exaggerations and proliferating untruths. No, essential oils cannot cure all ailments. And no, essential oils are not the answer to every single problem besetting modern medicine.\n\nEssential oils are, however, a health force to be reckoned with. There’s a reason why they’ve been used by humanity for thousands of years, with many of those earlier civilizations being arguably healthier on the whole than modern day Americans.\n\nWhen it comes down to it, those who are passing essential oils off as “just a fad” are either doing the only thing they know how (criticizing), or they simply don’t know enough about how essential oils work to say any different. So, for all those oil haters out there, here’s some solid reasons why essential oils are the real deal.\n\n1. They’re literally just the essence of plants\n\nFor those who aren’t yet in the know, an essential oil is a volatile liquid painstakingly extracted through the process of distillation from the seed, root, bark, stem, leaf, fruit, flower, resin or wood of a plant. In literal terms, essentials oils are the ultra-concentrated essence of that plant. Once extracted, these oils can then be used for inhalation, ingestion, absorption and for creating all kinds of products. You’d be surprised to learn about all the everyday products in your life which contain these essential oils.\n\nAs humans, we seem to be increasingly under the illusion that we’re removed from nature, that we have somehow evolved beyond the world of plants, animals and elements around us. But as this illusion has solidified over the years following the agricultural revolution, the collective health of humanity has steadily declined. While modern science is working hard to extend our lives and solve all the diseases that seem to keep cropping up, it doesn’t seem to be enough — mortality rates in America from conditions like heart disease and cancer continue to rise year after year.\n\nThe point is, we’re still a part of nature, and as such, we rely on nature to feed and nurture us. It stands to reason, then, that something which is the pure essence of a plant well known and studied for its medicinal properties would be good for our health. Who could argue otherwise? If a particular plant has been shown to reduce inflammation and lower swelling in joints, why would distilling the essence of that plant and putting it in a bottle not be a good thing?\n\n2. There’s actually plenty of scientific evidence to support them\n\nEssential oil critics are quick to point out that there isn’t much in the way of hard, scientific evidence to back up health claims relating to essential oils. Actually, there is.\n\nTake frankincense, for example. A simple Google Scholar search with the keywords “frankincense essential oil” brings up a wide range of peer-reviewed studies, which are reputable, up to date and appear to scientifically prove that this particular essential oil is kind of a big deal when it comes to the human body. One study shows how frankincense essential oil kills cancer cells in the bladder, another examines frankincense’s ability to prevent the growth of tumors and a third explores the role of this essential oil in fighting prostate cancer. The list goes on.\n\nThe problem lies in the sheer number of essential oils out there — last time I checked, there were 90 different essential oils available on the market. It might not seem like much, but that’s a heck of a lot of different oils, each of which would need several (at minimum) large-scale, peer-reviewed studies to keep the essential oil critics quiet.\n\nThat’s some serious money spending. And who’s going to spend the money? Normally, it’s the pharmaceutical industry that forks out the big bucks to fund studies, but they only do it if they have a profitable interest in a particular product, not because that product can actually help people’s health and wellness.\n\nWhat studies have been completed are generally positive, and with more interest in essential oils, more studies will be undertaken.\n\nSome of those studies I talked about previously have revealed almost miraculous effects from using certain essential oils. Melaleuca alternifolia (tea tree), for example, has been shown to prevent the influenza virus from entering human host cells. This means we can forget about the flu shot, and all the health risks that come with it, and look to the pure oil of a small Australian tree for our natural flu vaccine. Incidentally, Melaleuca can also inhibit fungal growth, prevent infection, and do some serious damage to your Candida problem. Enough said.\n\nAnd it doesn’t stop there. Lavender essential oil has been proven through clinical trials to be a viable natural alternative to pharmaceutical antidepressant medications. Meanwhile, peppermint essential oil has been shown to effectively treat irritable bowel syndrome (IBS) symptoms. And I believe I’ve already mentioned frankincense.\n\nOkay, everything in moderation, of course. If you were to put too much oregano essential oil on your skin, for example, or apply it to sensitive skin without a carrier oil, there would be side effects — a burning sensation, some skin irritation, perhaps a mild rash. But that’s the case with anything, be it natural or synthetic.\n\nWhere essential oils really show their mettle is when compared to the side effects of mainstream pharmaceuticals. Take antidepressants, as an example. A visit to WebMD informs me that the side effects of common antidepressants include:\n\nThose last side effects really get me going: someone takes an antidepressant to treat their depression, and instead they become anxious and angry. Interesting. Lavender essential oil, on the other hand, has been suggested as a viable replacement for antidepressants and it’s possible side effects are:\n\n… and you’d need to be using a lot of lavender oil to experience these side effects. The takeaway from all this is that essential oils can do many of the things conventional drugs can do, and they won’t ruin your health in the process. That’s a win-win in my books.\n\nI’m not even over-exaggerating when I say that there’s an oil for almost any ailment. And while pharmaceutical drugs are produced for one purpose in mind, be that to reduce joint inflammation, alleviate depression or kill off bacteria, your average bottle of essential oil has a wide range of health benefits.\n\nLet’s revisit lavender essential oil. We’ve already discussed the fact that it can be used as an antidepressant, but it can also significantly lower inflammation in the body, relieve pain, treat insomnia, be used as a topical disinfectant, promote healing, improve blood circulation and treat respiratory conditions. Can your average over-the-counter drug do all those things? I think not!\n\n6. They’ve been used for thousands of years\n\nOkay, I know I mentioned this earlier, but it’s central to the argument against essential oils as a fad. A fairly accurate definition of a fad is “an intense and widely shared enthusiasm for something, especially one that is short-lived.” The keyword there is “short-lived.”\n\nIf we follow essential oil records back through time, we arrive as far back as the time of the Ancient Egyptians. A scroll discovered by archaeologists dating back to around 1500 BCE was deciphered and found to list hundreds of remedies employing the use of essential oils.\n\nFast forward to the turn of the millennium, and we find the Bible describing essential oils in a number of instances, most notably when baby Jesus was given frankincense and myrrh, and later when he was anointed with spikenard. Then, of course, there were the Ancient Greeks and Romans, who would diffuse essential oils inside their homes, public buildings and steam baths to maintain good health and keep things smelling splendid.\n\nEssential oils have been valued by countless civilizations across the world, and here we find ourselves valuing them once more, over three thousand years later. It’s fair to say, then, that essential oils are not a fad!\n\n— Liivi Hess\n\n \n\n Now that you’re convinced that essential oils are the real deal, you might be interested in some of the many uses you can put them to!", "opengraph": {"locale": "en_US", "type": "article", "title": "6 Reasons Essential Oils Are Not A Fad", "description": "Your average health practitioner would roll their eyes if they saw the title of this post. They’d pass it off as just another pseudo-health fanatic who’s", "url": "https://thealternativedaily.com/6-reasons-essential-oils-are-not-a-fad/", "site_name": "The Alternative Daily", "article:publisher": "https://facebook.com/thealternativedaily", "article:published_time": "2016-08-28T05:09:09+00:00", "article:modified_time": "2022-08-11T15:30:42+00:00", "image": "https://s41998.pcdn.co/wp-content/uploads/2016/08/essential-oils-are-not-a-fad.jpg.optimal.jpg", "image:width": "720", "image:height": "410", "image:type": "image/jpeg"}, "tags": ["frankincense", "perscription drugs", "reasons", "depression", "fad", "lavendar", "cancer", "oil", "benefits", "essential", "side effects", "uses", "essential oils", "lavendar essential oil", "health"], "tweets": [], "movies": [], "links": ["javascript:void(0);", "http://thenutritionwatchdog.com/4-essential-oils-that-are-more-powerful-than-antibiotics/", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC4086286/", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2664784/", "https://www.organicfacts.net/health-benefits/essential-oils/list-of-essential-oils.html", "https://www.thealternativedaily.com/big-pharmas-strategy-to-create-customers-not-cures/", "http://articles.mercola.com/sites/articles/archive/2012/09/18/flu-shot-increases-flu-illness.aspx", "http://www.complementarytherapiesinmedicine.com/article/S0965-2299(13)00193-3/abstract", "http://www.aafp.org/afp/2005/1215/p2501.html", "https://www.thealternativedaily.com/stop-stressing-try-essential-oils/", "http://www.webmd.com/depression/features/coping-with-side-effects-of-depression-treatment", "http://www.sciencedirect.com/science/article/pii/S0278691505001298", "http://www.sciencedirect.com/science/article/pii/S1744388110000381", "http://www.sciencedirect.com/science/article/pii/S0167527307012612", "https://www.thealternativedaily.com/top-essential-oils/", "javascript:void(0);"], "authors": ["", "The Alternative Daily"], "publish_date": "2016-08-28T05:09:09+00:00"}