{"result_id": "017007", "URL": "https://thealternativedaily.com/junk-items-to-never-buy-at-whole-foods/", "timestamp": "2023-04-25 11:57:51 CEST+0200", "meta": {"description": "If you love shopping at Whole Foods or other healthy grocery stores, you might want to avoid these ten junk foods disguised as nourishing choices.", "lang": "en", "keywords": "", "favicon": "https://s41998.pcdn.co/wp-content/uploads/2017/07/favicon-1.png", "canonical": "https://thealternativedaily.com/junk-items-to-never-buy-at-whole-foods/", "encoding": "UTF-8"}, "image": null, "domain": "thealternativedaily.com", "title": "10 Junk Items You Should NEVER Buy At Whole Foods", "cleaned_text": "There’s nothing quite like a Whole Foods shopping experience. Rows of organic food, loads of eco-friendly products and people stopping in the cozy aisles just to have a chat. Yet even “America’s Healthiest Grocery Store” isn’t immune to sneaky junk food. Just because your favorite snacks are organic and vegan doesn’t always mean they’re good for you. Don’t be fooled! Here are some addictive junk foods masquerading as healthy options at Whole Foods.\n\nFood marketers work hard to compete with other food items on shelves and convince you that they’re product is the best. They may use persuasive labels such as:\n• Organic . May still be harvested with herbicides. Livestock may still be given aspirin, vaccines and oxytocin. Processing may still include refined sugar, white flour, corn, palm oil and more.\n• GMO-free: or less than .9 percent. May still contain , herbicides, sludge and livestock treated with antibiotics with no welfare standards.\n• Gluten-tree: . May still include boat loads of sugar and other addictive chemicals. For example, Butterfingers and Reese’s Peanut Butter cups technically gluten-free. But does that make them good for you? No way!\n• Vegetarian: made without meat, but still may contain processed cheese and milk, unsustainable eggs, chemicals, preservatives and more.\n• Vegan: made without any animal products (meat, dairy, eggs, sometimes honey), but may include harmful chemicals, preservatives, sugar and sugar substitutes.\n• Sugar-free: made without real sugar, but may be replaced with a damaging artificial sweetener, like aspartame.\n• Low-fat: must contain less than three grams of fat per 100 grams. In order to keep it “low-fat,” it may still include loads of fake sugar, preservatives, artificial flavors and more.\n• All-natural : this does not mean anything. found that 60 percent of people believe this means a food contains no artificial ingredients. In reality, the FDA has no regulations regarding this term. You’ll notice this label often appears on foods that can’t tout any other benefits.\n\nTrying to keep up with food labels is a dizzying task. In general, all of these labels are still better than items with no labels at all. But as you can see, not one of these labels means that a food is 100 percent healthy for you. It’s always best to practice moderation with processed foods in general, no matter how many flashy labels it contains.\n\nTo help clear things up even more, here are ten items to avoid the next time you shop at Whole Foods:\n\nMac and cheese it still mac and cheese — carbs and dairy, plus loads of preservatives. Just because it’s organic, doesn’t make it good for you. At 490 calories and 20 grams of fat (10 grams of saturated fat), this is one entree to skip entirely. With 700 milligrams of sodium, that’s half your daily recommended intake of salt in one meal.\n\nWhat to eat instead: zoodles (zucchini noodles) with homemade pasta sauce and salad.\n\nThey may say “all-natural” on the label, but that’s not the whole truth. These sweet treats contain canola oil and eight grams of sugar per serving — that’s just 12 fries, and can you really stop yourself at that many? They also contain glucano delta lactone, a stabilizer which may come from genetically modified products. It is metabolized as sugar in the body; one gram yields the same amount of metabolic energy as one gram of sugar.\n\nWhat to eat instead: homemade sweet potato “fries” baked in the oven.\n\nGluten-free doesn’t mean a whole lot when you’re filling your body with processed additives. These snacks contain glucose (another name for sugar), fruit concentrate and caramel coloring, the same colorant added to sodas that may actually be derived from wheat — does that mean this is still gluten-free? Additionally, these donuts are made with palm oil, the production of which is killing off endangered orangutans at an unprecedented rate.\n\nWhat to eat instead: vegan “energy balls” with flaxseeds, dark chocolate, oats, raw honey and dates.\n\nThese non-GMO veggie chips are more potato than anything else, not unlike regular old potato chips. They contain potato flour and powdered veggies — what on earth are those? There’s 130 calories for 28 chips, still fewer than Lay’s Classic Potato Chips at 160 calories per 15 chips. But in case you haven’t figured it out yet, chips are still chips.\n\nWhat to eat instead: popcorn with sea salt and lime juice or homemade kale chips\n\nThis Cheez-It alternative is non-GMO, but it still has some off-putting ingredients. On the box it says that it’s “plant-based diet friendly” but nothing about the ingredient list is plant-based, unless you count sugar, palm oil, canola oil, cornstarch and “natural flavor.” In general, it’s a good idea to avoid fake cheese products and go for the real stuff instead.\n\nWhat to eat instead: homemade cheese crackers with almond flour, yeast, sea salt, egg, coconut oil and lemon juice.\n\nHere’s a great example of why organic doesn’t always mean “better.” This cereal is the Whole Food’s version of Cocoa Puffs. However, there are better ways to get your morning energy. In each cup, this cereal contains seven grams of sugar. Put two cups in your bowl and you’re halfway to your recommended sugar intake for the entire day. They also contain the all-questionable “natural flavor” ingredient — and we don’t even want to know what that means.\n\nWhat to eat instead: banana slices topped with peanut butter and cinnamon\n\nOh, the sugar. In one serving (two bars), there are ten grams of the sweet stuff. For your reference, women are only supposed to be eating 25 grams of sugar per day, and 36 grams for men. Two tiny fig bars take up a big chunk of that pie. There’s also canola oil, caramel coloring and natural flavoring. Manufacturers aren’t very clear about ingredients when it comes to natural flavoring, and sometimes they don’t even come from food at all. On the bright side, at least these bars are 100 percent whole grain.\n\nWhat to eat instead: homemade oatmeal fig bars, though we recommend trying the recipe without brown sugar.\n\nAt 300 calories per pint, this doesn’t seem like a bad deal. However, there are several kinds of sweetness including cane sugar, sugarcane fiber and monk fruit concentrate, which is 200 times sweeter than regular sugar. In 1/2 a cup of this ice cream, there’s 10 grams of sugar. The pints also contain soy, natural flavors and guar gum, which has been linked to digestive issues. Other than that, the ingredient list is loads better than any conventional ice cream product.\n\nWhat to eat instead: full-fat Greek yogurt or a fruit smoothie.\n\nIf you’re craving ranch, this is definitely better than brands like Hidden Valley Ranch and others. However, you still might want to skip it. It contains pressed vegetable oil, which would be highly-processed canola oil or sunflower oil. Canola oil is always one to watch out for, since it’s one of the most altered products in the American diet and it’s been linked to toxic trans fats. Canola oil is actually registered with the EPA as an insecticide — not something you want on top of your salad, right? We’d much prefer it this product was made with heart-healthy olive oil instead.\n\nWhat to eat instead: creamy tahini-based dressing or real caesar salad dressing.\n\nWhile not exactly junk food, unsustainable eggs should always be on the “no-go” list. With so many varieties of eggs to choose from, why shortchange yourself and the animals that produced them? Cage-free doesn’t necessarily mean cruelty-free. The hens may not have had enough space to engage in any natural behaviors and the conditions were probably unsanitary. Can you spring an extra $2 for a better variety? It’s worth it, we promise.\n\nWhat to eat instead: free-range, organic and pasture-raised eggs.\n\nHow to shop at Whole Foods\n\nAs you can see, junk food has infiltrated even the healthiest of shopping establishments. To keep your waistline and wallet in check, try shopping around the outer perimeters of the grocery store. This is where the fresh fruits and vegetables can be found, and they should be the base of every meal. From there, find sustainably sourced meats, dairy and egg products. Venture around to find the dry goods you’ll need to supplement your meals, like brown rice, quinoa, nuts and more.\n\nIf you’re still in need of processed goods, try counting the ingredients as a general rule. Five or less? In the shopping cart it goes. Six or more? Skip it — your body is probably better off without it anyway.", "opengraph": {"locale": "en_US", "type": "article", "title": "10 Junk Items You Should NEVER Buy At Whole Foods", "description": "If you love shopping at Whole Foods or other healthy grocery stores, you might want to avoid these ten junk foods disguised as nourishing choices.", "url": "https://thealternativedaily.com/junk-items-to-never-buy-at-whole-foods/", "site_name": "The Alternative Daily", "article:publisher": "https://facebook.com/thealternativedaily", "article:published_time": "2017-03-25T05:30:11+00:00", "article:modified_time": "2017-03-24T23:01:06+00:00", "image": "https://s41998.pcdn.co/wp-content/uploads/2017/03/Junk-Food-never-to-buy-at-Whole-Foods.jpg.optimal.jpg", "image:width": "720", "image:height": "410", "image:type": "image/jpeg"}, "tags": ["processed", "chemicals", "cane sugar", "food", "preservatives", "whole foods", "sugar", "calories", "diet", "artificial sweetener"], "tweets": [], "movies": [], "links": ["javascript:void(0);", "http://www.wholefoodsmarket.com/", "https://www.ams.usda.gov/rules-regulations/organic/national-list", "https://www.nongmoproject.org/", "http://www.huffingtonpost.com/entry/non-gmo-vs-organic_us_57a36208e4b0e1aac9150854", "https://www.fda.gov/Food/GuidanceRegulation/GuidanceDocumentsRegulatoryInformation/Allergens/ucm362880.htm", "http://www.cbsnews.com/news/what-does-natural-really-mean-on-food-labels/", "http://www.befoodsmart.com/ingredients/glucono-delta-lactone.php", "https://www.thealternativedaily.com/reduce-cancer-risk-with-sweet-potato-burger-and-fries/", "https://www.thealternativedaily.com/how-you-can-help-this-endangered-species-orangutan/", "https://www.thealternativedaily.com/can-potatoes-cause-cancer/", "https://www.thealternativedaily.com/ditch-unhealthy-microwave-popcorn-now/", "https://wholenewmom.com/recipes/homemade-cheez-it-crackers-cracker-recipe/", "https://www.thealternativedaily.com/naturalflavoring-made-from-the-anal-secretions-of-beavers/", "http://alidaskitchen.com/2013/04/15/oatmeal-fig-bars-homemade-fig-newtons/", "http://monkfruit.org/faqs/", "http://www.webmd.com/vitamins-supplements/ingredientmono-919-guar%20gum.aspx?activeingredientid=919", "https://www.thealternativedaily.com/3-reasons-leave-canola-oil-shelf/", "https://www.thealternativedaily.com/1-oil-promotes-blindness/", "http://onlinelibrary.wiley.com/doi/10.1111/j.1745-4522.1994.tb00244.x/abstract", "https://www.thealternativedaily.com/7-fabulous-healthy-diy-salad-dressings/", "http://www.humanesociety.org/issues/confinement_farm/facts/cage-free_vs_battery-cage.html?referrer=https://www.google.com/", "https://www.thealternativedaily.com/worlds-oldest-person-eats-eggs-every-day/", "javascript:void(0);"], "authors": ["", "The Alternative Daily"], "publish_date": "2017-03-25T05:30:11+00:00"}