{"result_id": "017036", "URL": "https://thealternativedaily.com/should-we-torture-animals/", "timestamp": "2023-04-25 11:58:30 CEST+0200", "meta": {"description": "Animal testing has paved the way for countless scientific breakthroughs. But is the treatment of animals in labs unethical?", "lang": "en", "keywords": "", "favicon": "https://s41998.pcdn.co/wp-content/uploads/2017/07/favicon-1.png", "canonical": "https://thealternativedaily.com/should-we-torture-animals/", "encoding": "UTF-8"}, "image": null, "domain": "thealternativedaily.com", "title": "Should We Torture Animals?", "cleaned_text": "Animals are remarkable in their ability to process complex information, react to physical and emotional stressors, respond to social cues and even mimic human behavior. It’s precisely for these reasons that scientists use animals — large and small — for a broad array of research purposes. From cosmetic testing to pharmaceutical trials, it’s estimated that 115 million animals are used each year in scientific labs around the world. But are we taking it too far?\n\nIt’s difficult to discount the scientific breakthroughs that have occurred as a result of animal testing, also known as “in vivo” testing. The polio vaccine, tested on mice and monkeys, helped reduce worldwide cases from 350,000 in 1988 to little over 200 in 2012. Scientists are closer than ever to eradicating the disease entirely as a result of tests on animals. The same is true for countless others; animal testing has paved the way for advances in cancer, leukemia, malaria and more.\n\nChris Abee, the Director of University of Texas’ Anderson Cancer Center told the Houston Chronicle that we wouldn’t have developed a vaccine for hepatitis B without experiments on chimpanzees, who share 99 percent of our DNA. He went on to say that our best hope for a hepatitis C vaccine is continued research on chimps, since there’s no other animal model available.\n\n“If a loved one of yours is one of the 150,000 people in the United States who die annually of hepatitis C, the research might be more important to you,” he said.\n\nAnimals are similar, but are they similar enough?\n\nAnimal testing is on the rise by 73 percent in the U.S., despite the critics who say it doesn’t necessarily lead to scientific advancement.\n\n“Despite new research technology, evidence that animal experiments often don’t faithfully translate to humans, and the fact that a growing majority of the public opposes experiments on animals, laboratories are abusing more animals than ever before,” said Justin Goodman, PETA Director of Laboratory Investigations, on his study results.\n\nIt turns out, animal tests can’t always predict outcomes on humans, a sobering fact that more and more government officials and researchers are forced to acknowledge. In fact, nine out of every 10 medicines that are deemed “safe” after animal experiments end up failing on humans. Scientists simply can’t replicate all of the human factors in an animal model.\n\nThe result of these failed experiments is wasted resources and countless animal deaths. Registration of just one pesticide can require more than 50 studies and the use of 12,000 animals before it’s allowed to hit the marketplace. Imagine all of the ones that never even make it public.\n\nScientists conduct experiments on all types of live animals, including dogs, cats, mice, rats, pigs, frogs, guinea pigs, monkeys and apes. They are kept in small cages, often devoid of social interaction. They are subject to cruel surgeries and safety tests without the use of anesthesia. Common animal experiments include:\n\nAnimals are burned, implanted, suspended, shocked, starved, maimed, blinded and more. Some are put into restraining devices, completely unable to move for days on end. As a result of physical and psychological trauma, most animals must be euthanized at the conclusion of the experiment. Lab rats, for example, are often decapitated or gassed when they are no longer needed.\n\nHow many animals are being tested?\n\nNo one knows exactly how many animals are used for testing every year. People For The Ethical Treatment of Animals (PETA) estimates 100 million in the U.S. alone, while the Humane Society of the United States says that figure is closer to the worldwide estimate.\n\nThe discrepancy may be due to the fact that the most commonly used animals for scientific experimentation — rats and mice — do not need to be reported by scientists. They are exempt from the Animal Welfare Act, so labs do not need to disclose how many animals they go through. Fish, amphibians and birds are also not counted under the Animal Welfare Act.\n\nEven outside of the medical community, animal testing is on the rise in the commercial sector. Check the label on your favorite mascara. You’ll see a wealth of ingredients, some recognizable, some not. But there’s always one thing missing: any mention of the animals that were tortured and poisoned to bring that product to the shelves.\n\nThere are thousands of companies that test on animals, including many big names you’ll recognize. Some of the large corporations include Johnson & Johnson, Air Wick, Almay, Arm & Hammer, Axe, Band-Aid, Blue Buffalo, Chapstick, Clorox, Crest, Febreze, Listerine, M.A.C. Cosmetics, Old Spice, Pantene, Revlon, the list goes on and on. Reach for any cleaning or beauty product in your home and chances are you’ll find its parent company on that list.\n\nSo, how can you ditch companies that test on animals? Buy from companies who don’t! Yes, the list of companies that test on animals is daunting. But here’s the beautiful thing: we can help change the course of animal testing by buying into the “cruelty-free” product market.\n\nThese are hundreds of consumer choices that have not been tested on animals, in everything from surface cleaners to shaving products. Here are some cruelty-free cosmetic brands you may see at the store:\n\nIf you’re curious about where a certain product stands, look for “Not Tested On Animals” or “Cruelty-Free” on the label. You may also see products with the “Leaping Bunny” program logo, an internationally recognized symbol of cruelty-free production. See a complete list of cruelty-free companies here.\n\nCruelty to animals aside, your conventional products are probably full of dozens of harmful chemicals and known carcinogens anyway. The best way to know exactly what goes into your products and where they’ve been tested is to make them yourself at home. Why not test these homemade concoctions on the animal that you have the most in common with? You!\n• None for stains, mold and more\n• None for dishes, mildew and more\n• None for dry and split ends in hair\n\nBy reducing your reliance on traditional cleaners and cosmetics, you can sway the market towards a cruelty-free future. Animals can’t speak, so we have to speak for them and prove there’s a better way.", "opengraph": {"locale": "en_US", "type": "article", "title": "Should We Torture Animals?", "description": "Animal testing has paved the way for countless scientific breakthroughs. But is the treatment of animals in labs unethical?", "url": "https://thealternativedaily.com/should-we-torture-animals/", "site_name": "The Alternative Daily", "article:publisher": "https://facebook.com/thealternativedaily", "article:published_time": "2016-12-05T23:55:30+00:00", "article:modified_time": "2017-07-27T21:55:42+00:00", "image": "https://s41998.pcdn.co/wp-content/uploads/2016/12/Animal-testing.jpg.optimal.jpg", "image:width": "720", "image:height": "410", "image:type": "image/jpeg"}, "tags": ["mice", "cleaning products", "animal testing", "chemicals", "chimpanzees", "animals", "peta", "animal rights", "rats"], "tweets": [], "movies": [], "links": ["javascript:void(0);", "http://www.sciencemag.org/news/2015/03/rats-see-pain-other-rats-faces", "http://www.hsi.org/campaigns/end_animal_testing/qa/about.html", "http://www.understandinganimalresearch.org.uk/why/human-health/polio-vaccine/", "http://scienceblog.cancerresearchuk.org/2011/06/21/animal-research-is-helping-us-beat-cancer/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3568447/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3271056/", "http://www.houstonchronicle.com/news/houston-texas/houston/article/Once-invaluable-research-chimps-now-devalued-4677223.php", "http://www.cbsnews.com/news/peta-study-finds-animal-testing-in-federal-labs-on-the-increase/", "http://www.cbsnews.com/news/peta-study-finds-animal-testing-in-federal-labs-on-the-increase/", "http://www.fda.gov/NewsEvents/Newsroom/PressAnnouncements/2006/ucm108576.htm", "http://www.humanesociety.org/assets/pdfs/animals_laboratories/cosmetic_product_testing/end_animal_testing.pdf", "https://www.crueltyfreeinternational.org/why-we-do-it/what-animal-testing", "http://www.neavs.org/research/harm-suffering", "http://www.peta.org/issues/animals-used-for-experimentation/animals-used-experimentation-factsheets/animal-experiments-overview/", "http://www.hsi.org/campaigns/end_animal_testing/qa/about.html", "https://www.nal.usda.gov/awic/animal-welfare-act", "https://www.crueltyfreeinternational.org/why-we-do-it/what-animal-testing", "http://www.mediapeta.com/peta/PDF/companiesdotest.pdf", "http://www.leapingbunny.org/", "http://www.mediapeta.com/peta/PDF/companiesdonttest.pdf", "https://www.thealternativedaily.com/is-your-shampoo-toxic/", "https://www.thealternativedaily.com/5-green-home-cleaning-solutions/", "https://www.thealternativedaily.com/9-foods-put-hair-coconut-oil-olive-oil-avocado/", "https://www.thealternativedaily.com/homemade-cleaning-spray-with-sage/", "https://www.thealternativedaily.com/natural-vinegar-cleaner-can-kill-cancer/", "https://www.thealternativedaily.com/29-surprising-uses-for-hydrogen-peroxide/", "https://www.thealternativedaily.com/soap-nuts-natural-laundry-soap-doubles-hair-shampoo-household-cleaner/", "https://www.thealternativedaily.com/21-extraordinary-uses-lemons/", "https://www.thealternativedaily.com/homemade-cleaning-spray-with-sage/", "https://www.thealternativedaily.com/make-your-own-moisturizing-soap/", "https://www.thealternativedaily.com/avocado-cucumber-soap-recipe/", "https://www.thealternativedaily.com/rosemary-peppermint-shampoo/", "https://www.thealternativedaily.com/nontoxic-shampoo/", "https://www.thealternativedaily.com/easy-dry-shampoo-recipes/", "https://www.thealternativedaily.com/4-natural-hair-treatments-shiny-gorgeous-locks/", "https://www.thealternativedaily.com/natural-hair-conditioner-with-apple-cider-vinegar/", "https://www.thealternativedaily.com/use-honey-fix-damaged-hair-heres/", "https://www.thealternativedaily.com/4-natural-hair-treatments-shiny-gorgeous-locks/", "https://www.thealternativedaily.com/diy-easy-safe-natural-toxin-free-deodorant/", "https://www.thealternativedaily.com/magnesium-lotion-reduces-anxiety/", "https://www.thealternativedaily.com/homemade-lip-balm-recipe-peppermint-wild-orange/", "https://www.thealternativedaily.com/exfoliate-naturally-with-lemon-salt-scrub/", "https://www.thealternativedaily.com/natural-vapor-rub-for-congestion/", "https://www.thealternativedaily.com/soothing-natural-booby-butter/", "javascript:void(0);"], "authors": ["", "The Alternative Daily"], "publish_date": "2016-12-05T23:55:30+00:00"}