{"result_id": "017031", "URL": "https://thealternativedaily.com/antibiotics-vs-antivirals-unraveling-misconceptions/", "timestamp": "2023-04-25 11:58:23 CEST+0200", "meta": {"description": "To unravel the misconceptions surrounding antibiotics and antivirals, you’ll need to understand the difference between bacterial infection viral infection", "lang": "en", "keywords": "", "favicon": "https://s41998.pcdn.co/wp-content/uploads/2017/07/favicon-1.png", "canonical": "https://thealternativedaily.com/antibiotics-vs-antivirals-unraveling-misconceptions/", "encoding": "UTF-8"}, "image": null, "domain": "thealternativedaily.com", "title": "Antibiotics vs. Antivirals (Unraveling Misconceptions)", "cleaned_text": "You’ve been diagnosed with coronavirus. Now what? Can you take antibiotics? What about an antiviral? It’s all so confusing…But to unravel the misconceptions, you’ll need to understand the difference between a bacterial infection and a viral infection. You’ll also need to keep in mind that antibiotics will never be antivirals, and antivirals will never be antibiotics. So, what’s the difference?\n\nIn the beginning, there were antibiotics\n\nIn 1942, Anne Miller, a 33-year-old woman from New Haven, Conn., was brought back from the brink of death, thanks to the antibiotic penicillin. Following a miscarriage, Miller contracted a streptococcal infection that almost killed her, according to Chemical & Engineering News. If it wasn’t for the penicillin, she may never have survived. Instead, she lived to a ripe old age of 90. A few years later, after entering World War ll, the U.S. government became interested in penicillin. They were anxious for a new drug that could reduce casualties of war. So, they quickly made penicillin a priority and ramped up production.\n\nBy June 1944, when the invasion of Normandy followed, companies were already producing 100 billion units of the antibiotic per month. As the end of the second world war approached, mass production of penicillin provided life-saving treatment for bacterial infections in wounded soldiers. Since then, penicillin and numerous other antibiotics have been used to treat a wide range of bacterial infections successfully. So much that between 1945 and 1972, the average human life expectancy jumped by eight years, according to the Microbiology Society. Antibiotics now treat the same infections that were previously deadly.\n\nAfter the introduction of antibiotics came antivirals. The first antiviral drug, idoxuridine, was approved in June 1963 for the topical treatment of herpes simplex virus (HSV) keratitis. According to research, it’s taken almost 60 years for antiviral development to reach where it is today. Developing antiviral drugs is a very complex process. At the present moment, there are only 50 drugs approved for human use against viruses. Since the outbreak of the coronavirus pandemic, drug companies and researchers have struggled to find an antiviral that can treat the virus that causes COVID-19. So, why can’t we just use antibiotics to fight Covid-19? For the simple reason that antibiotics only treat bacterial infections…they can’t treat viruses — only antivirals can.\n\nBacteria are self-contained microorganisms that can live independently, without a host cell in many different types of environments, including extreme cold and heat — or even your intestines. They are similar to human cells but have features that humans don’t have. In fact, it’s those differences — between bacterial and human cells — that make antibiotics possible. Meaning, they can stop the bacteria from thriving without hurting the human taking the drug.\n\nOn the other hand, unlike bacteria, viruses cannot duplicate solely on their own, outside of a host cell. Instead, viruses enter your cells and take over. Once inside, some viruses lie dormant, while others duplicate slowly and spill from cells. However, others duplicate so fast and furiously that the host cell explodes and dies. The newly replicated virus then repeats the process by infecting new host cells. This could explain why coronavirus seems to present itself differently in various people, with illnesses ranging from asymptomatic or mild to severe disease and even death.\n\nHere’s where things get even trickier…Remember how antibiotics work? They can stop the bacteria from thriving without hurting the human taking the drug. Well, when it comes to antivirals, although they can be successful in stopping the virus from replicating, they can also unintentionally target a replication process critical to the host cell, making it toxic to the human.\n\nBacterial and viral infections may cause similar symptoms\n\nWhen you’re feeling ill, it can be hard to distinguish between a bacterial infection and a viral infection since both may cause similar symptoms like sneezing, fever, coughing, fatigue, and diarrhea. Therein lies the confusion, with so many of us wondering why can’t we just take an antibiotic when we’re symptomatic. Basically, similar symptoms don’t necessarily mean it’s the same infectious disease. This fact becomes very clear when your body responds (or doesn’t respond) to antibiotics for a viral infection.\n\nAntibiotics are medications that stop infections caused by bacteria. They work two ways:\n• None They kill the harmful bacteria causing the infection.\n• None They keep the harmful bacteria from multiplying into more and more harmful bacteria.\n\nHere’s the thing, taking too many antibiotics during your life could make you antibiotic-resistant. This happens because while the antibiotic is killing most of the bacteria, a small group may survive. Over time, certain groups of bacteria may then adapt to the antibiotics. Of course, resistant bacteria can spread in the same manner as non-resistant bacteria. So, the best way to prevent resistance to antibiotics is to use antibiotics properly. That means only taking them when necessary and never taking them for viral infections such as a cold, flu, or coronavirus.\n\nAntivirals are medications that reduce the ability of viruses to replicate, suggests Harvard Health. For instance, if you’ve ever had the flu shot, you’ve had an antiviral drug designed to:\n• None Interfere with an important enzyme of the influenza virus.\n• None And, prevent the virus from escaping one host cell to infect a neighboring cell.\n\nThey are most effective when administered within a day or two of the onset of symptoms.\n\nAs mentioned, developing antiviral drugs is a very complex process, so a COVID-19 vaccine may take time to create. So much depends on understanding the workings of the SARS-CoV-2 virus and its interactions with human cells. Therefore, it is a misconception to believe that antibiotics could be used in place of antivirals to treat the novel coronavirus — or any virus, for that matter.", "opengraph": {"locale": "en_US", "type": "article", "title": "Antibiotics vs. Antivirals (Unraveling Misconceptions)", "description": "To unravel the misconceptions surrounding antibiotics and antivirals, you’ll need to understand the difference between bacterial infection viral infection", "url": "https://thealternativedaily.com/antibiotics-vs-antivirals-unraveling-misconceptions/", "site_name": "The Alternative Daily", "article:publisher": "https://facebook.com/thealternativedaily", "article:published_time": "2020-07-17T10:00:35+00:00", "article:modified_time": "2020-07-11T20:55:13+00:00", "image": "https://s41998.pcdn.co/wp-content/uploads/2020/07/AdobeStock_274131656.jpeg.optimal.jpeg", "image:width": "953", "image:height": "540", "image:type": "image/jpeg"}, "tags": ["flu", "antivirals", "cold", "antiviral", "antibiotic", "viral infections", "coronavirus"], "tweets": [], "movies": [], "links": ["javascript:void(0);", "https://cen.acs.org/articles/83/i25/Penicillin.html#:~:text=During%20World%20War%20II%2C%20penicillin,to%20combat%20infections%20in%20soldiers.&text=LIFE%20SAVER-,During%20World%20War%20II%2C%20penicillin%20was,to%20combat%20infections%20in%20soldiers.", "https://microbiologysociety.org/members-outreach-resources/outreach-resources/antibiotics-unearthed/antibiotics-and-antibiotic-resistance/what-are-antibiotics-and-how-do-they-work.html", "https://www.sciencedirect.com/topics/pharmacology-toxicology-and-pharmaceutical-science/idoxuridine#:~:text=In%201963%2C%20idoxuridine%20became%20the,simplex%20virus%20(HSV)%20keratitis.", "https://www.elsevier.es/es-revista-medicina-universitaria-304-articulo-history-progress-antiviral-drugs-from-S166557961500037X", "https://www.health.harvard.edu/drugs-and-medications/what-you-should-know-about-antiviral-drugs", "javascript:void(0);"], "authors": ["", "Katherine Marko"], "publish_date": "2020-07-17T10:00:35+00:00"}