{"result_id": "017022", "URL": "https://thealternativedaily.com/cannabis-cookies-for-autism/", "timestamp": "2023-04-25 11:58:11 CEST+0200", "meta": {"description": "Autism is one of the most heartbreaking and mysterious medical conditions. Why does edible marijuana appear to help some autistic children?", "lang": "en", "keywords": "", "favicon": "https://s41998.pcdn.co/wp-content/uploads/2017/07/favicon-1.png", "canonical": "https://thealternativedaily.com/cannabis-cookies-for-autism/", "encoding": "UTF-8"}, "image": null, "domain": "thealternativedaily.com", "title": "Cannabis Cookies For Kids With Autism?", "cleaned_text": "Autism is one of the most mysterious neurodevelopmental disorders. The condition is characterized by deficits in social skills, a lack of emotional bonding and repetitive behaviors. It is usually diagnosed by the age of two when parents notice that their children have not reached developmentally appropriate verbal, emotional and inter-social milestones. In short, autistic children usually appear emotionally constricted and prone to obsessive-type behaviors. However, many autistic individuals exhibit exceptional savant-type talents like the ability to remember train schedules, guess heights or calculate probabilities.\n\nWhy are rates of autism rising?\n\nRates of autism have been steadily increasing over the last two decades and nobody seems to know why. Some parents and few medical practitioners have singled out vaccinations as a possible culprit, but studies and statistical analysis have found no empirical basis for that hypothesis.\n\nWhatever the cause, autism now affects one out of every 68 school age children, with boys four times as likely to be diagnosed as girls. For parents, having a child with the condition can be a frustrating journey into emotionally harrowing territory. Forty percent of autistic children do not communicate verbally. In addition, autistic individuals appear to suffer from sensory overload, which can precipitate emotional and physical fits of rage. This can make many kids extremely difficult for parents or traditional schools to manage.\n\nConventional treatments are spotty at best, though developmental experts insist that early intervention is essential if social skill deficits are to be addressed and progress made. Behavioral therapy, medication and special hypoallergenic diets are a few of the most common approaches to managing the disorder. Auditory-integration techniques, animal therapy and anti-inflammatory medications can help autistic kids improve too. No two cases of autism are exactly alike, so a trial and error approach to treatments is the rule rather than the exception.\n\nRecently, however, anecdotal evidence has stirred interest in a new form of treatment for autism. Parents and researchers do not know why, but medical marijuana in the form of cannabis cookies or tinctured oils appears to calm autistic kids down and improve their behavior.\n\nNeedless to say, giving pot to grade school age kids is controversial, but listening to parent stories is likely to make you a lot more sympathetic. For example, Marie Myung-Ok Lee’s nine-year old son is a case in point. His behaviors included violent rages — sometimes as many as 300 a day — where he would literally eat his clothes, bang his head against walls or tables, and scratch others.\n\nNone of the conventional treatment options appeared to work. Finally, psychiatrists recommended a drug called Risperdal, which entails severe side effects such as tremors, extreme weight gain and elevated insulin levels. Once again, success rates for this medication were not impressive. In addition, many adults with autism taking it describe the drug as a “chemical lobotomy.” So, Marie and her husband decided to pass on Risperdal and try something else they read about — cannabis.\n\nA neurologist agreed that marijuana was worth a try. Still, Marie and her husband were worried that cannabis could potentially do more harm than good, They consulted Harvard psychiatrist, Lester Grinspoon, who assured them that the risks were minimal. After all, there has never been a single documented case of a dose-related fatality when it comes to marijuana.\n\nMarie wanted to make absolutely sure marijuana would be safe for her son, so she did a fair amount of digging on her own. She later summed her findings when she wrote that “research has shown that cannabis is not physically addictive, as many illicit drugs are, and that it could make life better for people with a range of ailments, such as Tourette’s, irritable bowel syndrome, anxiety, glaucoma, spasticity, Huntington’s disease, chronic pain and intractable epilepsy.”\n\nUltimately, cannabis cookies and an oil tincture made from marijuana made a tremendous difference to Marie’s son. Not every strain of marijuana worked and Marie and her husband had to do a fair amount of experimenting before they found a variety that delivered reliable results, but the outcome has been very positive. In Marie’s words, “It seemed like a miracle. And seven years later, it’s still working. But unlike with other wonder drugs, we can’t just pop into the pharmacy for refills.”\n\nMarijuana needs to be reclassified\n\nOther parents have shared similar success stories. Unfortunately, most have also reported incredible frustrations and hassles when it comes to getting the medication that actually helps their autistic children. That’s largely because the federal government still classifies marijuana as a Schedule I drug that has a high potential for abuse and no recognized medical value.\n\nThat designation is hard to take seriously, either scientifically or medically. For instance, doctors can prescribe OxyContin (a schedule II drug), which is highly addictive and potentially lethal, to children. However, they cannot prescribe marijuana despite the fact that one of the DEA’s own administrative judges once wrote that “nearly all medicines have toxic, potentially lethal effects. But marijuana is not such a substance. There is no record in the extensive medical literature describing a proven, documented cannabis-induced fatality.”\n\nParents and their autistic children urgently need more research and treatment options. No one knows why, but anecdotal reports suggest that cannabis is helping at least some kids with the disorder. It’s about time that the federal government reclassified cannabis so that the current impediments to research and treatments do not compound the difficulties and challenges parents and autistic children face.", "opengraph": {"locale": "en_US", "type": "article", "title": "Cannabis Cookies For Kids With Autism?", "description": "Autism is one of the most heartbreaking and mysterious medical conditions. Why does edible marijuana appear to help some autistic children?", "url": "https://thealternativedaily.com/cannabis-cookies-for-autism/", "site_name": "The Alternative Daily", "article:publisher": "https://facebook.com/thealternativedaily", "article:published_time": "2017-01-18T10:00:57+00:00", "article:modified_time": "2017-07-27T21:36:01+00:00", "image": "https://s41998.pcdn.co/wp-content/uploads/2017/01/Parents-give-cannabis-cookies-to-child-with-autism.jpg.optimal.jpg", "image:width": "720", "image:height": "410", "image:type": "image/jpeg"}, "tags": ["cannabis", "autism", "legalization", "medical marijuana", "marijuana", "autistic", "edibles", "treatment", "medicine"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe loading=\"lazy\" src=\"https://www.youtube.com/embed/nwi--2aXhnU\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/nwi--2aXhnU"}], "links": ["javascript:void(0);", "https://www.autismspeaks.org/what-autism", "https://www.washingtonpost.com/opinions/i-made-my-son-cannabis-cookies-they-changed-his-life/2017/01/06/699b1d20-d1ef-11e6-a783-cd3fa950f2fd_story.html?hpid=hp_no-name_opinion-card-b%3Ahomepage%2Fstory&utm_term=.c8491e74a530", "http://www.mintpressnews.com/MyMPN/marijuana-reconsidered-an-interview-with-doctor-lester-grinspoon/", "http://www.collective-evolution.com/2015/02/17/what-happened-when-they-treated-autistic-children-with-medical-cannabis/", "http://www.ibtimes.com/why-marijuana-schedule-i-drug-1821426", "https://www.leafly.com/news/health/how-does-cannabis-consumption-affect-autism", "javascript:void(0);"], "authors": ["", "Scott O’Reilly"], "publish_date": "2017-01-18T10:00:57+00:00"}