{"result_id": "017021", "URL": "https://thealternativedaily.com/inmates-training-dogs-good-thing/", "timestamp": "2023-04-25 11:58:10 CEST+0200", "meta": {"description": "If you’re a fan of the TV show Orange Is the New Black, you’ll recall the character Big Boo, played by Lea DeLaria, was training a dog in the first", "lang": "en", "keywords": "", "favicon": "https://s41998.pcdn.co/wp-content/uploads/2017/07/favicon-1.png", "canonical": "https://thealternativedaily.com/inmates-training-dogs-good-thing/", "encoding": "UTF-8"}, "image": null, "domain": "thealternativedaily.com", "title": "6 Reasons Why Inmates Training Dogs Is A Good Thing", "cleaned_text": "If you’re a fan of the TV show Orange Is the New Black, you’ll recall the character Big Boo, played by Lea DeLaria, was training a dog in the first season. Inmates all over the country are enrolled in similar programs to train dogs for adoption and therapy work.\n\nFor the dogs and the inmates, these programs are a win-win situation. The dogs receive the training necessary to make them good adoption candidates, while the prisoners receive a sense of purpose and pride in their accomplishments.\n\nCanine benefits\n\n Dogs in inmate training programs come from the canine version of incarceration — animal shelters. Without intervention, some of them face the death penalty, as euthanasia rates are high at many shelters. Many of these dogs are turned into the shelter because owners can’t bother to train them and can’t deal with high energy animals. Young, rambunctious dogs — especially large ones — are the not the type of pet most people want to adopt. However, an intensive training program makes these dogs very adoptable. They learn how to work one-on-one with a person. During the course, they change from out-of-control hellions into canine good citizens.\n\nInmate benefits\n\n The dog gives the inmate unconditional love, even though the prisoner knows the two of them must part. For many prisoners, that kind of love has been missing in their lives. For people with little or no contact with family and friends, the dog fills a void. Offenders in the dog training program report less anxiety. They are no longer just prisoners — they are now dog handlers, and their charges live with them 24/7.\n\nMany inmates say their attitudes changed after working with the dogs. Although the inmate may or may not become a professional dog trainer or other animal service provider upon release, the work offers job and life skills training. Some programs teach inmates how to groom dogs, and help with placement when the person is released.\n\nShelter benefits\n\n Animal shelters participating in prison dog retraining programs benefit from additional adoptions. The prison programs help relieve overcrowding in many shelters. Experienced shelter personnel know that many dogs that come through their doors could make good pets with proper socialization and training, but few shelters have the resources to train these dogs. There are also insurance issues when using volunteers. Inmate dog training programs help overwhelmed shelters reduce euthanasia rates.\n\nService dog benefits\n\n The demand for service and therapy dogs is high, but these animals require between 12 and 18 months of specialized, intense training. The cost of these trained animals is prohibitively expensive for many people whose quality of life would improve with the addition of a service or therapy dog. Dogs trained through an extensive prison program are not cheap, but they are not nearly as costly as privately trained canines. Prisons running service and therapy dog training programs allow more people with disabilities to gain independence with these animals. Inmates take pride knowing they are helping children and adults with disabilities. The lives of dogs, inmates and the disabled are all transformed by such programs.\n\n \n\n Adopter benefits\n\n When a person adopts a dog directly from a shelter, he often receives little or no information about the animal because there’s not much information available. When someone adopts a dog trained through an inmate program, they receive plenty of details about the dog’s personality and habits, his likes and dislikes. That’s besides the fact they know the dog is housebroken, crate-trained, has learned basic commands, and walks well on a leash. All dogs are already spayed or neutered and vaccinated.\n\nCommunity benefits\n\n Former inmates returning to the outside world have a lower rate of recidivism after participating in the dog training program. That benefits their families and communities. It’s not easy to tell how many dogs in need of hope and care have changed the lives of incarcerated people for good — such statistics are impossible to keep. It’s safe to assume that the love of a needy dog has transformed the lives of many imprisoned men and women, giving them a sense of respect and responsibility they may have never known before.", "opengraph": {"locale": "en_US", "type": "article", "title": "6 Reasons Why Inmates Training Dogs Is A Good Thing", "description": "If you’re a fan of the TV show Orange Is the New Black, you’ll recall the character Big Boo, played by Lea DeLaria, was training a dog in the first", "url": "https://thealternativedaily.com/inmates-training-dogs-good-thing/", "site_name": "The Alternative Daily", "article:publisher": "https://facebook.com/thealternativedaily", "article:published_time": "2016-05-29T05:00:08+00:00", "article:modified_time": "2022-09-12T18:12:25+00:00", "image": "https://s41998.pcdn.co/wp-content/uploads/2016/05/dogs.jpg.optimal.jpg", "image:width": "640", "image:height": "359", "image:type": "image/jpeg"}, "tags": ["prisons", "therapy dogs", "correctional facilities", "canine", "featured", "shelters", "adoptions", "prisoners", "service dogs"], "tweets": [], "movies": [], "links": ["javascript:void(0);", "https://www.thealternativedaily.com/yes-dog-make-better-person-heres/", "http://www.post-gazette.com/local/north/2016/05/16/For-inmates-at-SCI-Mercer-dog-training-program-has-mutual-benefits/stories/201605160006", "https://www.coloradoci.com/serviceproviders/puppy/index.html?p=aboutDogsDiv", "http://4pawsforability.org/mission-pawsible", "javascript:void(0);"], "authors": ["", "The Alternative Daily"], "publish_date": "2016-05-29T05:00:08+00:00"}