{"result_id": "017030", "URL": "https://thealternativedaily.com/big-tobacco-gave-researchers-370-million-cover-cancer-link/", "timestamp": "2023-04-25 11:58:22 CEST+0200", "meta": {"description": "The startling but very real results of an investigation published in Independent Science News, confirms what many have thought for years, there is", "lang": "en", "keywords": "", "favicon": "https://s41998.pcdn.co/wp-content/uploads/2017/07/favicon-1.png", "canonical": "https://thealternativedaily.com/big-tobacco-gave-researchers-370-million-cover-cancer-link/", "encoding": "UTF-8"}, "image": null, "domain": "thealternativedaily.com", "title": "Big Tobacco Gave Researchers $370 Million to Cover up Cancer Link", "cleaned_text": "The startling but very real results of an investigation published in Independent Science News, confirms what many have thought for years, there is collusion between industry, government and scientists to downplay or even ignore the social and environmental origins of human disease.\n\nFor twenty years, media has presented genetic research that has convinced the public that genetic factors drive most disease and human behavior despite a lack of scientific evidence of the sort.\n\nA Look at the Tobacco Industry\n\nWith a rise in lung cancer happening, the tobacco industry figured that they had better think of something to save their profits fast. They needed to shift blame for cancer from their cigarettes to the consumer.\n\nFrom 1960 to 1988 the tobacco industry provided 1,000 American and British genetic researchers with over 370 billion dollars to conduct research. The aim of the industry was to create science that would show lung cancer as having its roots in a genetic weakness not in cigarettes. Although no predisposing genes were found, the search to connect genes and lung cancer confounded understanding of the negative health effects of cigarettes and transformed the industry’s efforts to escape liability regulation.\n\nIt Did not Stop with Tobacco\n\n“Governments and industry discovered they had a common interest in disguising the failures of public policies and the harms of commercial products,” says author Jonathan Latham, Ph.D. “Genetics has become the go-to science of polluters and governments disinclined to address politically challenging social and environmental issues.”\n\nScience Director at the Bioscience Resource Project, Allison Wilson, Ph.D. states that weak evidence in support of genetic influences seems to be seized upon while strong evidence for environmental influences is pushed away. As research against genetics grows, the funding stream only seems to grow. Sounds more than suspicious to us.\n\nAccording to Allison Wilson, Ph.D., “The search for meaningful and replicable genetic predispositions to common diseases (such as lung cancer, heart disease and diabetes) has been almost wholly unsuccessful. Regardless, however, the PR project to use the public profile of this genomic research to persuade the public that genetics is central to life expectancy and mental health has triumphed.”\n\nScientific findings can be exploited to represent a genetic reason for any human disease or condition. Take autism, for example, if it can be shown or suggested even to have a partial link to genetics then accused vaccine makers, polluters, food manufacturers and policy makers could escape blame legally and from public perception.\n\nSo, in fact, a scapegoat is created. According to Geneticist Richard Lewontin, author of The Doctrine of DNA: Biology as Ideology, “The notion that the lower classes are biologically inferior to the upper classes……..is meant to legitimate the structures of inequality in our society by putting a biological gloss on them”.\n\nOver the last fifteen years close to half of the budget of the NIH has gone to analysing genetics in the human population and this appears to be growing. John Horgan, a science writer noted that searches have been made for genes connected to the following conditions without success:\n\nResearch continues within the disciplines of medicine, social science, public health and even economics to find causes of negative human outcomes somehow related to a genetic fault, not circumstances.\n\nWhat About BRCA and Other Exceptions?\n\nAccording to the Bioscience Resource Project, another example of misuse of scientific data comes into play with breast cancer. The BRCA1 gene which is said to cause cancer is the most cited example of genetic contribution to a commonly occurring disease, however, it play only a 10% role in all breast cancers. It is one of the most oversold genetic findings in existence today. Even more disturbing is the fact that the “predisposing” genes that have been reported in the media are actually false positives.\n\nThere are, however, a few real exceptions for rare disorders such as cystic fibrosis or Huntington’s disease where a clear genetic link can be made.\n\nCommon physical and mental health conditions such as cancer, autism and heart disease all lack epidemiological and solid genetic evidence but huge amounts of taxpayer’s money continues to flood the field of genetic research while public relations campaigns for large companies flourish.\n\nRemember, science is now a mostly top-down driven project, even though most scientists believe that science is a process of free enquiry. Only a very small amount of research takes place outside the chains of the funding agencies.\n\nResearchers design their projects specifically around funding programs and universities organize hiring around them and each and every experiment is done with the next grant application in mind. So, not only do individual scientists have very little control; but there is plenty of room for political and commercial forces to set the science agenda from on high.\n\nThis top down science model has distorted our view of human nature and public money has bought a domination of the intellectual enquiry process rather than real true scientific progress.\n\nDo not become discouraged when you see the fatalistic headlines about your genes on every media stream. Our DNA is not the sole determiner and an understanding of this means change. We have good reason to want pesticides removed from our food and water, toxins from the workplace, subsidies from junk food and and end to economic injustice – don’t give up or lose hope because mass media and warped science with a political and economic agenda tells you it is all your fault!", "opengraph": {"locale": "en_US", "type": "article", "title": "Big Tobacco Gave Researchers $370 Million to Cover up Cancer Link", "description": "The startling but very real results of an investigation published in Independent Science News, confirms what many have thought for years, there is", "url": "https://thealternativedaily.com/big-tobacco-gave-researchers-370-million-cover-cancer-link/", "site_name": "The Alternative Daily", "article:publisher": "https://facebook.com/thealternativedaily", "article:published_time": "2013-09-25T08:24:22+00:00", "article:modified_time": "2016-04-03T00:17:18+00:00", "image": "https://s41998.pcdn.co/wp-content/uploads/2013/09/cigarrettes.jpg.optimal.jpg", "image:width": "384", "image:height": "243", "image:type": "image/jpeg"}, "tags": ["genetics", "genes and science", "science", "tobacco industry", "cancer", "lung cancer", "scientific research", "smoking"], "tweets": [], "movies": [], "links": ["javascript:void(0);", "http://www.independentsciencenews.org/science-media/science-and-social-control-political-paralysis-and-the-genetics-agenda/", "http://www.pnas.org/content/109/21/8026.short", "http://www.plosmedicine.org/article/info%3Adoi%2F10.1371%2Fjournal.pmed.1000347", "javascript:void(0);"], "authors": ["", "The Alternative Daily"], "publish_date": "2013-09-25T08:24:22+00:00"}