{"result_id": "017014", "URL": "https://thealternativedaily.com/horseshoe-crab-endangered-over-profits/", "timestamp": "2023-04-25 11:58:00 CEST+0200", "meta": {"description": "The horseshoe crab, Limulus polyphemus, is very, very old. It is not the most aesthetically pleasing animal in the ocean, and if you saw one swim by your", "lang": "en", "keywords": "", "favicon": "https://s41998.pcdn.co/wp-content/uploads/2017/07/favicon-1.png", "canonical": "https://thealternativedaily.com/horseshoe-crab-endangered-over-profits/", "encoding": "UTF-8"}, "image": null, "domain": "thealternativedaily.com", "title": "Ancient Horseshoe Crab Endangered Over Blue Blood Profits", "cleaned_text": "The horseshoe crab, Limulus polyphemus, is very, very old. It is not the most aesthetically pleasing animal in the ocean, and if you saw one swim by your feet, you might panic and run for dry land. However, this creature has survived for a long time and it continues to play an essential role in our ecosystem.\n\nThe horseshoe crab has had plenty of predators, but none as fierce as the human race. What makes the horseshoe crab so unique and attractive to humans is its majestic-looking blue blood. This blue blood is highly prized by drug companies as it has special properties in detecting endotoxins.\n\nEndotoxins, which are pathogenic molecules found in the outer membranes of certain bacteria, can cause organ failure and death in humans. Therefore, their detection is vital, specifically in the use of human vaccines and surgical instruments. The blue blood of the horseshoe crab contains limulus amebocyte lysate (LAL), which “has been widely used for ~30 years for the detection of endotoxin in the quality assurance of injectable drugs and medical devices,” according to a study published in Subcellular Biochemistry (2010). Detecting those endotoxins using LAL from the horseshoe crab’s unique and valuable blue blood is “crucial” to preventing endotoxemia, according to the study.\n\nCrucial, yes… but for whom? Humans? Drug companies? Or how about the horseshoe crab that has become a threatened species as a result, according to the International Union for Conservation of Nature (IUCN) Red List for Threatened Species (2015). After more than 300 million years of survival, the horseshoe crab may have finally met its end at the hands of humans, and profit margins.\n\nRoughly half a million horseshoe crabs are caught in the shallows of the sea each year. They are brought to a blood collection facility where 30 percent of their blue blood is extracted, according to a 2014 article published by The Atlantic. The laboratory looks like a science fiction horror film. The horseshoe crabs are pierced near their heart and the blood draining begins as the animal is strapped upright by metal and rubber. One quart of LAL extracted from the blue blood of the horseshoe crab goes for $15,000, according to The Atlantic.\n\nOf course the drug companies reassure that the whole process is harmless and that it is similar to humans giving blood. Unfortunately, being captured on the street while enjoying your coffee, thrown into a van by strangers, taken to a undisclosed laboratory, and then having 30 percent of your blood drawn unwillingly while being strapped to a metal slab does not feel similar at all.\n\nThe horseshoe crabs are released after 24 to 72 hours, but only 70 to 90 percent of the crabs survive after being set free from such a traumatic experience. Furthermore, many of the horseshoe crabs are caught when they return to the shallows of the beach to mate, which may be a significant contributing factor to the decreasing population.\n\nAs the horseshoe crab population dwindles, instead of searching for a more sustainable way to protect one of the oldest species on the planet, drug companies begin their search for a replacement animal. If not stopped, the drug companies will bring the ancient horseshoe crab to extinction and then move on to its next victim, an African Frog, according to Princeton University. It is vital to hold drug companies accountable for their negligent practices, because humans have come to represent the most dangerous threat to the survival of many species that have been around for a very, very long time.\n\nWhat do you think can be done to save animals from negligent testing and procedures?\n\nStephen Seifert is a writer, professor, adventurer and a health & fitness guru. His flair for travel and outdoor adventure allows him to enjoy culture and traditions different than his own. A healthy diet, routine fitness and constant mental development is the cornerstone to Stephen’s life.", "opengraph": {"locale": "en_US", "type": "article", "title": "Ancient Horseshoe Crab Endangered Over Blue Blood Profits", "description": "The horseshoe crab, Limulus polyphemus, is very, very old. It is not the most aesthetically pleasing animal in the ocean, and if you saw one swim by your", "url": "https://thealternativedaily.com/horseshoe-crab-endangered-over-profits/", "site_name": "The Alternative Daily", "article:publisher": "https://facebook.com/thealternativedaily", "article:published_time": "2016-01-05T19:58:17+00:00", "image": "https://s41998.pcdn.co/wp-content/uploads/2016/01/Fotolia_95671497_Subscription_Monthly_M.jpg.optimal.jpg", "image:width": "640", "image:height": "359", "image:type": "image/jpeg"}, "tags": ["endotoxin detection", "Horseshoe crab", "blue blood", "drug company testing", "vaccines"], "tweets": [], "movies": [], "links": ["javascript:void(0);", "http://www.ncbi.nlm.nih.gov/pubmed/20593268", "http://www.iucnredlist.org/details/11987/0", "http://www.theatlantic.com/technology/archive/2014/02/the-blood-harvest/284078/", "http://www.eurekalert.org/pub_releases/2010-10/pues-nsd101910.php", "javascript:void(0);"], "authors": ["", "The Alternative Daily"], "publish_date": "2016-01-05T19:58:17+00:00"}