{"result_id": "020032", "URL": "https://althealthworks.com/9-year-autistic-boy-explains-what-its-really-like-living-with-autism/", "timestamp": "2023-04-25 11:59:31 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://althealthworks.com/wp-content/uploads/2015/07/favicon-32x321.png", "canonical": "https://althealthworks.com/9-year-autistic-boy-explains-what-its-really-like-living-with-autism/", "encoding": "UTF-8"}, "image": null, "domain": "althealthworks.com", "title": "9-Year-Old Autistic Boy Explains What It’s REALLY Like Living with Autism", "cleaned_text": "At only nine years old, George is in most ways like all kids: he loves playing the video game Minecraft, making music, and drawing. He is silly, friendly, and likes to do exciting things. There is just one thing that makes him a little different — George has autism. And he is happy to honestly share what that is like (video at the end of the article).\n\nAutism or autism spectrum disorder (ASD) is a developmental disability that severely affects one’s behavior, communication abilities, and ways in which one is able (or unable) to socialize.\n\nAt the moment, about 1 in 68 children are diagnosed with ASD. The prevalence of this disorder grew from 1 in 150 just barely over a decade ago, and the numbers are predicted to climb. Boys like George are 4.5 times more likely to be affected than girls.\n\nThe medical community has not yet come to any conclusion as to what causes ASD: it could be in part genetic; some cases are due to older age of the parents; and prescription drugs (even a common Tylenol is real threat) and environmental causes such as toxins, pesticides, and chemicals in our world can be a trigger. Likely it is all of these, and different things might trigger different autism cases.\n\nWhile science is trying to catch up in understanding this epidemic, kids like George and their parents have to find a way to live fulfilling lives with this condition.\n\nAutism can have different levels of severity and can cause different social, emotional, and behavioral problems. No case is the same, but many will find similarities between cases.\n\nIn George’s case, he went from being non-vocal until the age of three, to a very talkative, outgoing kid. But he knows that sometimes he acts a little different, in a way that his classmates do not understand.\n\nFor them, he recorded a six-minute video explaining what it is like for him to live with autism.\n\nThe video, which has been edited by George’s father, was made for George’s classmates; but it has been shared all over the web since, and touched many adults and children alike. Medical professionals have commented that George’s honest explanation helped them understand more about autism than any textbook ever had.\n\nWhat It’s Like Living with Autism\n\nHere are few ways autism has affected George’s life:\n• He could not speak until the age of 3; his parents were worried that he’d never speak.\n• He could not make eye contact with people for years of his life (now he can!)\n• His unique hearing allows him to hear all of the sounds around him at the same time, which can make it hard to concentrate.\n• His mind takes things very literally; he doesn’t understand idioms or sarcasm.\n• He loves touching and feeling different textures.\n• His sense of smell allows him to smell things from across the room…even yogurt.\n• When he is excited, he gets a strong urge to bounce, flap his hands, or chew on things.\n• He can get easily frustrated and start crying or screaming if he is interrupted, when he makes a mistake, or when things do not go the way he thought they would (even in a book).\n\nIn the end, he says, “I am a kid just like you. Because all of us kids are different in our own way, right? Sometimes I get so frustrated that I get more upset than most people would, for longer than most people should. I might get too loud, or I might scream! Don’t be afraid to come ask me about it.”\n\nYou can connect with George (monitored by his mother) through a Facebook page George -DJGeoYio.\n\nWatch a video on George’s (now-viral) message to his classmates:\n\nWhat do autism, ADHD, Alzheimer’s, Dementia, Depression, Anxiety, and Brain Fog have in common? (CLICK HERE to watch an eye-opening documentary series for FREE).\n\nEvery autism case is different. You can read about a couple of other cases (more on a holistic healing) in the following stories:\n\nRussian Doctor Found a Way to Reverse Autism, Learning Problems with THIS Diet\n\n“There is No Better Feeling:” Child’s Autistic Symptoms Miraculously Disappear after His Doctor Does THIS\n\nThanks for installing the Bottom of every post plugin by Corey Salzano. Contact me if you need custom WordPress plugins or website design.", "opengraph": {"image": "https://althealthworks.com/wp-content/uploads/2018/01/autism-boy-2.jpg"}, "tags": ["autism symptoms", "george autism", "video living with autism", "Autism", "autism hearing", "Remove term: autism sense of small autism sense of smell", "characteristics of autism", "autistic behavior", "autism story", "how an autistic person thinks", "autistic boy", "autism senses", "george with autism", "living with autism", "what is autism like for a child", "what it's like to have autism video", "boy explains autism", "what's it like being autistic", "how an autistic person sees the world"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe loading=\"lazy\" src=\"https://www.youtube.com/embed/WNu4-PK6BhM\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/WNu4-PK6BhM"}], "links": ["http://www.facebook.com/sharer.php?u=https%3A%2F%2Falthealthworks.com%2F9-year-autistic-boy-explains-what-its-really-like-living-with-autism%2F&t=9-Year-Old%20Autistic%20Boy%20Explains%20What%20It%E2%80%99s%20REALLY%20Like%20Living%20with%20Autism", "http://twitter.com/share?text=9-Year-Old%20Autistic%20Boy%20Explains%20What%20It%E2%80%99s%20REALLY%20Like%20Living%20with%20Autism&url=https%3A%2F%2Falthealthworks.com%2F9-year-autistic-boy-explains-what-its-really-like-living-with-autism%2F&via=AltHealthWorks.com", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Falthealthworks.com%2F9-year-autistic-boy-explains-what-its-really-like-living-with-autism%2F&title=9-Year-Old%20Autistic%20Boy%20Explains%20What%20It%E2%80%99s%20REALLY%20Like%20Living%20with%20Autism", "#", "https://althealthworks.com/10434/warning-tylenol-is-not-safe-prenatal-use-linked-to-increased-autism-and-adhd-risky/", "https://www.instagram.com/p/BcYhcdNgE7Z/?taken-by=ohsojolley", "https://go.thetruthaboutvaccines.com/?a_bid=9dd5b084&a_aid=56fbdd4295177", "https://www.facebook.com/georgeautism/", "https://brokenbrain.com/trailer/?oprid=8913", "https://brokenbrain.com/trailer/?oprid=8913", "https://althealthworks.com/10374/reverse-autism-learning-and-mental-problems-with-this-diet/", "https://althealthworks.com/10294/childs-autistic-symptoms-disappear-after-the-doctor-does-this/", "http://wordpress.org/extend/plugins/bottom-of-every-post/", "http://www.tacticaltechnique.com/wordpress/"], "authors": ["AltHealth Admin"], "publish_date": null}