{"result_id": "020036", "URL": "https://althealthworks.com/report-glyphosate-found-in-over-80-percent-of-breast-milk-samples-in-brazilian-study/", "timestamp": "2023-04-25 11:59:32 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://althealthworks.com/wp-content/uploads/2015/07/favicon-32x321.png", "canonical": "https://althealthworks.com/report-glyphosate-found-in-over-80-percent-of-breast-milk-samples-in-brazilian-study/", "encoding": "UTF-8"}, "image": null, "domain": "althealthworks.com", "title": "Cancer-Linked Monsanto Chemical Found in 80 Percent of Breast Milk Samples, South American Study Shows", "cleaned_text": "If you’ve been following the most recent news involving the Monsanto/Bayer behemoth lately, you’ve probably heard about the monumental court victory of groundskeeper Dewayne Johnson, who’s been suffering from non-Hodgkin’s lypmhoma and has been given only months to live by doctors.\n\nJohnson recently won a $289 million court victory over the Monsanto Company after it was determined they acted with “malice or oppression” toward him in light of his use of the “probable human carcinogen” glyphosate (according to the IARC of the World Health Organization).\n\nThe Johnson case has many wondering what the fallout will be, since the chemical can be found virtually everywhere from our drinking water to two of the world’s most popular breakfast foods and even in childhood vaccines.\n\nAnd now, as fate would have it, recent research shows it may be more prevalent in breast milk than ever before.\n\nOver 80 Percent of Milk Samples Tainted with Glyposate, Study Shows\n\nAccording to a new study from Inacio Pereira Lima, a master’s student in Women’s Health at the Federal Univesity of Piaui’s (UFPI) Center of Health and Sciences, 83.4% of the breast milk samples were found to contain either glyphosate or aminomethylphosphonic acid (AMPA), or both, as reported by Telesur, a Latin American media outlet.\n\n“The presence of glyphosate in breast milk indicates direct contamination by this agro-toxin or that the quantities utilized in agricultural activity in the region must be so high that the plant metabolism or microbiology did not degrade the excess,” Lima said according to GMWatch.org.\n\n“Nearby regions where agricultural activity is not present, we suspect that agro-toxins have contaminated the water.”\n\nIn this case the samples were taken from one of the largest soy-producing areas in the state, in the municipality of Urucui in the Brazilian state of Piauí.\n\nBrazil and Argentina in particular are two of the largest GM-soy producing countries in the world, where Roundup with its active ingredient glyphosate is routinely sprayed on these crops, which are created in a lab by Monsanto to withstand large doses of chemical sprayings.\n\nIn 2016, 10.1 million kilos total were consumed in the state, which amounts to an average of 3.18 kilograms per person.\n\nAccording to the article Brazil has become the primary consumer of pesticides on the planet with a 20 percent stake in the world’s total consumption since 2008, the report said.\n\nScience Still Unsettled on Glyphosate in Breast Milk?\n\nThe controversy over glyphosate in breast milk has been brewing for years, especially since 2014 when a Moms Across America study found “high” levels of glyphosate in 3 out of 10 breast milk samples.\n\nSince then, Washington State University researchers closely tied to Monsanto instead found mothers’ breast milk to be glyphosate-free.\n\nA 2015 German study of 16 mothers disagreed, however, stating that levels found were much higher than in safe drinking water concentrations.\n\nIn the comments section of the 2018 Telesur article, research scientist Anthony Samsel, who unsealed a treasure trove of EPA documents showing a link to cancer in EPA tests going back decades, had the following to say about the new results out of Brazil:\n\n“This confirms previous breast milk analysis in the USA that were refuted by Monsanto with a study done by Washington State that was (deliberately) fudged to show no contamination. Washington State and Monsanto lied. FACT: If you eat a diet contaminated with glyphosate, all of your tissues will contain glyphosate without exception including expressed milk.”\n\nMonsanto has said its glyphosate-containing herbicide is safe based on government regulatory agency approvals and studies, but critics counter that their products are often approved in biased safety studies in concert with federal officials.\n\nAt any rate, the results are worth noting for mothers, especially those who eat glyphosate heavy, non-organic diets, because of the sensitive nature of developing babies.\n\nThanks for reading! For more articles like these in your inbox (plus a free eBook), click here. You can also learn about the first-ever glyphosate-free certified baby formula by clicking here.\n\nThanks for installing the Bottom of every post plugin by Corey Salzano. Contact me if you need custom WordPress plugins or website design.", "opengraph": {"image": "https://althealthworks.com/wp-content/uploads/2018/08/AFP-Breast.jpg"}, "tags": ["breast milk roundup contamination", "breast milk cancer samples", "brazil breast milk samples", "gmos in breast milk", "roundup in breast milk", "glyphosate is it in breast milk", "breast milk monsanto", "breast cancer milk samples", "breast milk roundup"], "tweets": [], "movies": [], "links": ["http://www.facebook.com/sharer.php?u=https%3A%2F%2Falthealthworks.com%2Freport-glyphosate-found-in-over-80-percent-of-breast-milk-samples-in-brazilian-study%2F&t=Cancer-Linked%20Monsanto%20Chemical%20Found%20in%2080%20Percent%20of%20Breast%20Milk%20Samples%2C%20South%20American%20Study%20Shows", "http://twitter.com/share?text=Cancer-Linked%20Monsanto%20Chemical%20Found%20in%2080%20Percent%20of%20Breast%20Milk%20Samples%2C%20South%20American%20Study%20Shows&url=https%3A%2F%2Falthealthworks.com%2Freport-glyphosate-found-in-over-80-percent-of-breast-milk-samples-in-brazilian-study%2F&via=AltHealthWorks.com", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Falthealthworks.com%2Freport-glyphosate-found-in-over-80-percent-of-breast-milk-samples-in-brazilian-study%2F&title=Cancer-Linked%20Monsanto%20Chemical%20Found%20in%2080%20Percent%20of%20Breast%20Milk%20Samples%2C%20South%20American%20Study%20Shows", "#", "https://althealthworks.com/16792/breaking-news-monsanto-found-guilty-in-roundup-cancer-trial-ordered-to-pay-289-million-to-dying-california-man/", "https://althealthworks.com/16792/breaking-news-monsanto-found-guilty-in-roundup-cancer-trial-ordered-to-pay-289-million-to-dying-california-man/", "https://althealthworks.com/16845/high-levels-of-cancer-linked-monsanto-chemical-found-in-almost-70-of-breakfast-foods-tested/", "https://www.telesurtv.net/english/pages/about.html", "https://www.gmwatch.org/en/news/latest-news/18404-brazil-glyphosate-found-in-over-80-of-breast-milk-samples", "https://www.momsacrossamerica.com/glyphosate_testing_results", "https://www.momsacrossamerica.com/glyphosate_testing_results", "https://www.thelocal.de/20150626/concerns-over-safety-of-german-breast-milk", "https://althealthworks.com/6119/6119glyphosateepacancerdocuments/", "https://www.althealthworks.com/ebook-submit", "https://althealthworks.com/15625/little-known-baby-formula-company-is-the-first-to-become-certified-free-of-cancer-linked-monsanto-chemical/", "http://wordpress.org/extend/plugins/bottom-of-every-post/", "http://www.tacticaltechnique.com/wordpress/"], "authors": ["Nick Meyer"], "publish_date": null}