{"result_id": "020034", "URL": "https://althealthworks.com/cant-get-enough-sunlight-here-are-five-great-sources-of-natural-vitamin-d/", "timestamp": "2023-04-25 11:59:32 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://althealthworks.com/wp-content/uploads/2015/07/favicon-32x321.png", "canonical": "https://althealthworks.com/cant-get-enough-sunlight-here-are-five-great-sources-of-natural-vitamin-d/", "encoding": "UTF-8"}, "image": null, "domain": "althealthworks.com", "title": "Can’t Get Enough Sunlight? Here Are the Five Best Food Sources of Vitamin D", "cleaned_text": "Vitamin D, aka the “sunshine vitamin,” is required in a multitude of bodily processes, making it one of if not the most important vitamins for your body to produce.\n\nThe crucial vitamin is produced within the body after we’ve exposed our skin to the sun’s rays, particularly of the ultraviolet B variety.\n\nDespite the importance of this vitamin for key functions such as regulating blood sugar, supporting healthy bones, cardiovascular and immune system health, many of us don’t get enough of it because we spend less time in the sunlight than at any point in human history, leading over 1 billion people worldwide to become deficient.\n\nWhile getting vitamin D from diet isn’t ideal, it can be an excellent way to supplement our vitamin D production via sunlight exposure, especially if you live in a colder climate during the fall and winter months.\n\nMost of the top food sources of vitamin D are fish, ranging from larger breeds to smaller ones that aren’t eaten often by much of the population. There are also some plant forms of vitamin D such as mushrooms, and plenty of vitamin D fortified foods on the market like cereals and breakfast foods (we don’t recommend eating these foods because of the difficulty the body has absorbing synthetic vitamins, though).\n\nFoods with vitamin D are relatively rare, however, so be sure to get a good 20 minutes of sunlight or more whenever you can and consult with a naturopathic doctor to get your levels tested in the fall or winter if you feel you may be deficient.\n\nWith that in mind, here are five of the top foods containing natural vitamin D:\n\n1. Cod Liver Oil or Fermented Cod Liver Oil- Often used in natural cavity healing protocols, the natural vitamin D and other nutrients in cod liver oil or fermented cod liver oil can help to support healthy teeth and bone production.\n\nIt is believed that one serving of this oil can help the body produce several times the daily value of vitamin D that is needed, making it an especially worthwhile supplement for people living in northern climates to take during the winter months.\n\n2. Salmon- Regarded as the top food source of vitamin D by the popular food nutrient site WHFoods.com, it is of particular importance to make sure you’re buying your salmon wild caught as opposed to farmed.\n\nMost farmed salmon in the United States is fed an unnatural diet of GMO corn pellets and other odds and ends, whereas wild caught salmon eats a natural diet and gets plenty of sunlight as well.\n\nIt may be no surprise then that wild caught salmon (3.5 oz) has 600-1,000 international units (IU) of vitamin D while farmed has only 100-250 on average according to sunshinevitamin.org (the daily recommended value for Americans is 400 IU; many doctors recommend more though).\n\n3. Portobello (and other) Mushrooms- Probably the best vegan option out there, portobello mushrooms can have over half of your daily value of vitamin D or more; 493 international units when grilled according to USDA data which is actually more than the DRV of 400.\n\nOther mushrooms with high levels include maitake and morels, the latter of which is often found on mushroom hunts by foragers and prized by restaurants for its flavor.\n\n4. Sardines- Small and not too appetizing to many, these tiny fish are a wellspring of nutrition including vitamin D.\n\nSardines have more than 43% of your vitamin D requirement per serving meaning you can get by on less sunlight and still thrive by working these into your diet.\n\n5. Eggs- With over 10% of the daily value, fresh pastured eggs are an excellent way to supplement vitamin D in your diet (just don’t get suckered into buying “cage free” and go for truly pastured or organic from a trusted local farmer).\n\nThe high quality organic eggs will have a deeper yellow color, of course.\n\nOther options: If you believe you may be deficient in vitamin D, check with a naturopathic doctor and consider taking a supplement; vitamin D’s absorption is also enhanced with vitamin K2.\n\nThanks for installing the Bottom of every post plugin by Corey Salzano. Contact me if you need custom WordPress plugins or website design.", "opengraph": {"image": "https://althealthworks.com/wp-content/uploads/2020/09/aa.jpg"}, "tags": ["vitamin d food sources", "vitamin d best food sources", "vitamin d top food sources", "vitamin d top sources"], "tweets": [], "movies": [], "links": ["http://www.facebook.com/sharer.php?u=https%3A%2F%2Falthealthworks.com%2Fcant-get-enough-sunlight-here-are-five-great-sources-of-natural-vitamin-d%2F&t=Can%E2%80%99t%20Get%20Enough%20Sunlight%3F%20Here%20Are%20the%20Five%20Best%20Food%20Sources%20of%20Vitamin%20D", "http://twitter.com/share?text=Can%E2%80%99t%20Get%20Enough%20Sunlight%3F%20Here%20Are%20the%20Five%20Best%20Food%20Sources%20of%20Vitamin%20D&url=https%3A%2F%2Falthealthworks.com%2Fcant-get-enough-sunlight-here-are-five-great-sources-of-natural-vitamin-d%2F&via=AltHealthWorks.com", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Falthealthworks.com%2Fcant-get-enough-sunlight-here-are-five-great-sources-of-natural-vitamin-d%2F&title=Can%E2%80%99t%20Get%20Enough%20Sunlight%3F%20Here%20Are%20the%20Five%20Best%20Food%20Sources%20of%20Vitamin%20D", "#", "http://www.sunshinevitamin.org/", "https://althealthworks.com/wp-content/uploads/2014/09/mushroooo.jpg", "https://althealthworks.com/1703/feature-interview-cure-tooth-decay-author-ramiel-nagel-on-healing-cavities-naturally-the-problem-with-modern-dentistry-and-more/", "http://www.healthaliciousness.com/articles/high-vitamin-D-foods.php", "https://althealthworks.com/2168/product-review-fermented-cod-liver-oil-skate-liver-oil-and-high-vitamin-butter-oil-from-green-pastures-for-natural-cavity-healing/", "http://whfoods.org/genpage.php?tname=nutrient&dbid=110", "https://tinyurl.com/y7hrvavf", "http://www.healthaliciousness.com/articles/high-vitamin-D-foods.php", "http://mushroominfo.com/all-about-vitamin-d/", "https://althealthworks.com/3714/six-reasons-why-you-shouldnt-waste-your-money-on-cage-free-eggs/", "http://wordpress.org/extend/plugins/bottom-of-every-post/", "http://www.tacticaltechnique.com/wordpress/"], "authors": ["Nick Meyer"], "publish_date": null}