{"result_id": "020005", "URL": "https://althealthworks.com/26-carcinogens-according-to-the-world-health-organization-you-need-to-know-about/", "timestamp": "2023-04-25 11:59:19 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://althealthworks.com/wp-content/uploads/2015/07/favicon-32x321.png", "canonical": "https://althealthworks.com/26-carcinogens-according-to-the-world-health-organization-you-need-to-know-about/", "encoding": "UTF-8"}, "image": null, "domain": "althealthworks.com", "title": "26+ Carcinogens according to the World Health Organization, You NEED to Know About", "cleaned_text": "As the cancer rates have continued to rise to 1-in-2 for men, and 1-in-3 for women, I have personally seen many people hopelessly say, “Everything now causes cancer.”\n\nOverwhelmed by information overload and contradicting research, it’s no surprise that it is hard not to get discouraged when trying to eat healthy. The good news is – there are significantly more things that are not carcinogenic or capable of healing the body and defective cells, than there are those that are carcinogenic.\n\nAnd even then, all carcinogenic items have different levels of toxicity and may never cause cancer unless the person’s body is absorbing a high number of these carcinogens, whether it is through food, chemicals, or environmental pollution.\n\nThis is, of course, not the complete picture of what causes cancer. However, being aware of things that we, as society, are pretty sure lead to cancer gives us the knowledge to decide if each item if worth the risk, and if so, to use it in moderation.\n\nA list of known human carcinogens by The International Agency for Research on Cancer (IARC) – a part of the World Health Organization (WHO) – comes in handy. Here are some of the most common carcinogens, and how to avoid them.\n\nWhen analyzing carcinogenetic foods or toxins, WHO uses five groups for classification:\n\nWhat we are looking at is group 1, because all items in it are almost 100% proven to be carcinogenic.\n\nAcetaldehyde: this carcinogen is produced in the liver after it breaks down alcohol, and is greatly responsible for feeling hangover.\n\n Alcoholic beverages\n\n Ethanol (in alcoholic drinks)\n\n Tobacco, smokeless\n\n Tobacco smoke, secondhand\n\n Tobacco smoking\n\n Vinyl chloride is used to make a polymer for plastic products such as packaging materials, wire insulation, and pipes. It can also be found in cigarette fillers.\n\nAzathioprine is a pharmaceutical used for arthritis, Crohn’s disease, and ulcerative colitis.\n\n Lindane: pharmaceutical products including a shampoo used to treat lice and scabies\n\n Melphalan: chemotherapy drug\n\n Semustine: chemotherapy drug\n\n Estrogen-progestogen oral contraceptives\n\n Sulfur mustard: formerly used in warfare, now is a cancer drug under the names of Mechlorethamine and Mustargen\n\n Tamoxifen is a drug used to treat breast cancer.\n\n Thiotepa is an alkylating cancer drug.\n\n Treosulfan is a cancer drug in the group of alkylating agents.\n\n X-radiation and gamma radiation: sometimes x-rays are given when not medically necessary. Talk to your doctor to make sure you absolutely need an x-ray. X-rays add to the risk of developing cancer later in life.\n\nAflatoxins: these are fungi toxins that are used on crops. The foods that may be contaminated with aflatoxins are: peanuts, corn, milk products, nuts, grains, soybeans, and figs. While these foods are not carcinogens themselves, it what is done to them that makes the final product less healthy. It is important to petition for and buy foods made from crops that are treated with only natural substances that do not hide health hazards whenever possible.\n\n Arsenic and inorganic arsenic: the FDA allows some amounts of arsenic to be in food. It is commonly found in rice, apple juice, and chicken.\n\n Cadmium is a toxic metal, and it can be found in shellfish, and organ meat.\n\n Processed meat: hot dogs, ham, bacon, sausage, and some deli meats\n\n Salted fish (Chinese-style): levels of N-nitrosodimethylamine were detected in studies of uncooked fish, which has been linked to digestive tract cancers when eaten excessively.\n\nAsbestos and substances containing it: the most important one to know is talc – often found in makeup and baby powder (One popular company, Johnson and Johnson, recently got sued because their baby powder caused cancer). Instead, always choose talc-free baby powder.\n\n Formaldehyde is found in many household items from paper towels and pillows to furniture and toothpaste. Always get natural household cleaners. Formaldehyde is also found in some vaccines.\n\n Trichloroethylene is found in some adhesives, rug cleaners, paint removers, spot removers, and typewriter correction fluids. Check the labels on those products to see if this chemical is present.\n\nSilica dust: is dust that is created during construction when working with concrete, drywall, masonry, and some countertops, and can lead to lung cancer. If you are remodeling or building your home, make sure whoever is working on it is aware of this hazard and is following safety guidelines by the Occupational Safety and Health Administration (OSHA).\n\n Wood dust: follow safety guidelines when working with wood, decorative hardwood veneer, plywood and engineered wood flooring.\n\nUltraviolet-emitting tanning devices\n\n The full list of human carcinogens can be found the American Cancer Society website.\n\nFDA Bans 3 Cancer-Causing Chemicals, Ignores Dozens More – Here Are the Products You Need to Avoid\n\nThe Rainbow You Should Never Eat! THESE Artificial Colors Can Raise Your Cancer Risk…\n\nPotential Carcinogens, Neurotoxins, and Seizure-Causing Chemicals in the Flu Vaccine (full breakdown of ingredients)\n\nreport this adThanks for installing the Bottom of every post plugin by Corey Salzano. Contact me if you need custom WordPress plugins or website design.", "opengraph": {"image": "https://althealthworks.com/wp-content/uploads/2017/07/WHO-carcinogens-2.jpg"}, "tags": ["arsenic in food", "carcinogens list", "carcinogenic foods cancer-causing foods", "construction and cancer", "what causes cancer", "carcinogens in my home", "toxins in our food", "carcinogen list", "chemical carcinogens", "household items that cause cancer", "list of foods that cause cancer", "arsenic and cancer", "chemo drugs and cancer", "processed meat causes cancer", "household items cancer", "cancer causing foods you should avoid", "hidden carcinogens in food", "carcinogen list according to WHO", "hidden carcinogens in household items", "drugs that cause cancer", "Cadmium in shellfix", "carcinogenic foods", "food that causes cancer", "who carcinogen list", "carcinogens in food", "pharmaceuticals that cause cancer", "examples of carcinogens", "alcohol and cancer", "top causes of cancer", "major causes of cancer", "Ultraviolet-emitting tanning devices cancer", "things that cause cancer list", "arsenic in chicken", "tobacco and cancer", "salted fish cancer", "Formaldehyde cancer", "Formaldehyde vaccine", "heavy metals in food", "hidden carcinogens", "common things that cause cancer"], "tweets": [], "movies": [], "links": ["http://www.facebook.com/sharer.php?u=https%3A%2F%2Falthealthworks.com%2F26-carcinogens-according-to-the-world-health-organization-you-need-to-know-about%2F&t=26%2B%20Carcinogens%20according%20to%20the%20World%20Health%20Organization%2C%20You%20NEED%20to%20Know%20About", "http://twitter.com/share?text=26%2B%20Carcinogens%20according%20to%20the%20World%20Health%20Organization%2C%20You%20NEED%20to%20Know%20About&url=https%3A%2F%2Falthealthworks.com%2F26-carcinogens-according-to-the-world-health-organization-you-need-to-know-about%2F&via=AltHealthWorks.com", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Falthealthworks.com%2F26-carcinogens-according-to-the-world-health-organization-you-need-to-know-about%2F&title=26%2B%20Carcinogens%20according%20to%20the%20World%20Health%20Organization%2C%20You%20NEED%20to%20Know%20About", "#", "http://www.menshealth.com/health/1-in-2-people-will-get-cancer", "https://lu370.isrefer.com/go/grfv/yelenas", "http://health.howstuffworks.com/wellness/drugs-alcohol/hangover4.htm", "https://www.verywell.com/vinyl-chloride-in-cigarettes-2824726", "http://go.thetruthaboutcancer.online/2017-live-event/?a_aid=56fbdd4295177&a_bid=a73f4a2e", "https://www.fda.gov/Radiation-EmittingProducts/ResourcesforYouRadiationEmittingProducts/ucm252766.htm", "https://althealthworks.com/7422/these-foods-come-with-a-free-side-of-arsenic-fda-approvedyelena/", "https://althealthworks.com/9586/johnson-forgot-to-tell-consumers-that-their-products-cause-cancer-lost-72-million-court-case-more-on-the-wayyelena/", "http://amzn.to/2tq1dbG", "https://branchbasics.com/blog/2015/04/23-sources-of-formaldehyde-to-remove", "http://amzn.to/2vC0DnJ", "https://www.angieslist.com/articles/worried-about-dust-remodeling.htm", "https://www.cancer.gov/about-cancer/causes-prevention/risk/substances/wood-dust", "https://www.cancer.org/cancer/cancer-causes/general-info/known-and-probable-human-carcinogens.html", "https://althealthworks.com/9427/your-pizza-box-is-toxic-fda-bans-3-cancer-causing-packaging-chemicals-approves-20-moreyelena/", "https://althealthworks.com/12892/the-rainbow-you-should-never-eat-these-artificial-colors-that-could-raise-your-cancer-riskyelena/", "https://althealthworks.com/11089/carcinogens-neurotoxins-and-seizure-causing-chemicals-in-the-flu-vaccine-full-break-down-of-ingredientsyelena/", "https://www.ezoic.com/what-is-ezoic/", "http://wordpress.org/extend/plugins/bottom-of-every-post/", "http://www.tacticaltechnique.com/wordpress/"], "authors": ["AltHealth Admin"], "publish_date": null}