{"result_id": "020015", "URL": "https://althealthworks.com/release-of-over-20-million-genetically-modified-mosquitoes-officially-begins-in-florida-by-bill-gates-backed-company/", "timestamp": "2023-04-25 11:59:23 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://althealthworks.com/wp-content/uploads/2015/07/favicon-32x321.png", "canonical": "https://althealthworks.com/release-of-over-20-million-genetically-modified-mosquitoes-officially-begins-in-florida-by-bill-gates-backed-company/", "encoding": "UTF-8"}, "image": null, "domain": "althealthworks.com", "title": "Release of 20 Million GMO Mosquitoes Officially Begins in Florida By Bill Gates-Backed Company", "cleaned_text": "Florida is widely known for its natural beauty including sunshine, beaches, and wildlife, but the state is also home to large numbers of disease-carrying mosquitoes.\n\nNow, Florida has also become known for a different type of far-less-natural wildlife that has been added to its ecosystem: genetically modified mosquitoes from the Bill Gates-backed British biotech corporation Oxitec, which have just now been released for the first time.\n\nThe mosquitoes have been released throughout the Florida Keys region in undisclosed locations Oxitec says is to protect against potential vandalism, and now the world waits as the experiment is expected to resume later this year with over 20 million additional GMO mosquitoes expected to join the first brood.\n\nWhile the company continues to insist that the mosquitoes are safe, activists in the region have long opposed the lab-created mosquitoes on the grounds that the jury is still out.\n\nAccording to a team of scientists from Yale and other universities, the first GMO mosquitoes released in Brazil did not do what they intended to do and “unintended effects” were found.\n\nThe supposedly sterile mosquitoes are genetically engineered to mate with females leading to the death of their offspring, but Yale professor Jeffrey Powell said things didn’t appear to go as planned in the South American country.\n\n“The idea would be that when these males mated with females, the offspring would die. And therefore the overall population size of the mosquitoes would decline.” Powell said.\n\n“What we found was unexpected. Unpredicted,” he added.\n\n“We don’t know what the effect of having this hybrid population is…These could be stronger mosquitoes, harder to control.”\n\nThe mosquitoes were created through a $4.1 million grant from the Bill & Melinda Gates Foundation, an entity widely known for supporting GMO technology in both food and vaccines across the world, along with toxic farming chemicals like Roundup and companies like Monsanto.\n\n“Florida Keys physicians have expressed concerns that the genetically engineered mosquitoes, which are raised in tetracycline, could spread antibiotic-resistant bacteria. Tetracycline is a much relied upon antibiotic needed to treat MRSA and many other bacterial infections,” the non-profit continued.\n\n“Tests could be done to allay these concerns but Oxitec has refused to do so.”\n\nA different type of GMO mosquito was also found to increase the spread of malaria, the organization said.\n\n“The many concerns, all science-based, are too numerous to list here.”\n\nAccording to a report from Nature, the mosquitoes will be released in numbers of 12,000 males for 12 weeks straight, before leading to the grand finale later this year: the release of up to 20 million GMO mosquitoes over a period of 16 weeks.\n\nThe mosquitoes will be monitored during the experiment and are distinguishable due to “a fluorescent marker gene that makes them glow when exposed to a specific color of light,” Nature reported.\n\nActivists in the region remain concerned as to what potential complications could arise, especially considering there are millions of dollars at stake and long term research still hasn’t been done on what the effects could be on the health of animals, humans, and the ecosystem of the Keys, which prides itself on its gorgeous natural landscape, purity, and tourism industry.\n\nPreviously, Monroe County, Florida voted against the novel GMO mosquitoes and community members have spoken out against them for a decade, but the end result did not change from its original course.\n\nFlorida Keys officials voted 4-1 in favor of their release despite protests and demonstrations against the lab created insects.\n\n“What people should realize is that this is not just a Florida Keys issue. It’s a national issue,” said Barry Wray, Executive Director of the Florida Keys Environmental Coalition in a press release.\n\nHe added that experts from the Gates-funded company admitted the lack of “proper scientific rigor and prudence,” and also that they were willing to “risk unnecessary outcomes and mistakes.”\n\nWray and fellow activists are demanding that Oxitec end the experiment until the community’s scientific questions and concerns are answered and proper safety testing is done before releasing them unchecked into the ecosystem — although that seems virtually impossible now with the release of millions of the Gates-funded GMO mosquitoes on the horizon.\n\n“All this risk to benefit a for-profit company getting to market quicker with a product that has yet to actually prove anything other than failure in all of its historical field trials.”\n\nThanks for installing the Bottom of every post plugin by Corey Salzano. Contact me if you need custom WordPress plugins or website design.", "opengraph": {"image": "https://althealthworks.com/wp-content/uploads/2021/05/gates-1.jpg"}, "tags": ["gmo mosquitoes released in florida", "gmo mosquitoes released", "first gmo mosquitoes released", "first ever gmo mosquitoes released in florida", "gmo mosquitoes bill gates", "gmo mosquitoes florida"], "tweets": [], "movies": [], "links": ["http://www.facebook.com/sharer.php?u=https%3A%2F%2Falthealthworks.com%2Frelease-of-over-20-million-genetically-modified-mosquitoes-officially-begins-in-florida-by-bill-gates-backed-company%2F&t=Release%20of%2020%20Million%20GMO%20Mosquitoes%20Officially%20Begins%20in%20Florida%20By%20Bill%20Gates-Backed%20Company", "http://twitter.com/share?text=Release%20of%2020%20Million%20GMO%20Mosquitoes%20Officially%20Begins%20in%20Florida%20By%20Bill%20Gates-Backed%20Company&url=https%3A%2F%2Falthealthworks.com%2Frelease-of-over-20-million-genetically-modified-mosquitoes-officially-begins-in-florida-by-bill-gates-backed-company%2F&via=AltHealthWorks.com", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Falthealthworks.com%2Frelease-of-over-20-million-genetically-modified-mosquitoes-officially-begins-in-florida-by-bill-gates-backed-company%2F&title=Release%20of%2020%20Million%20GMO%20Mosquitoes%20Officially%20Begins%20in%20Florida%20By%20Bill%20Gates-Backed%20Company", "#", "https://www.csrwire.com/press_releases/721676-coalition-against-gmo-mosquito-condemns-release-genetically-engineered?fbclid=IwAR1lNkHvhy_qG0mGc24UihSEZ19H4awqeWp3l1CzIvBKyuPcGpALkES5MQc", "http://wordpress.org/extend/plugins/bottom-of-every-post/", "http://www.tacticaltechnique.com/wordpress/", "https://www.ezoic.com/what-is-ezoic/"], "authors": ["Nick Meyer"], "publish_date": null}