{"result_id": "020016", "URL": "https://althealthworks.com/bill-gates-funded-company-given-epa-approval-to-release-thousands-of-gmo-mosquitoes-in-two-u-s-states-2/", "timestamp": "2023-04-25 11:59:24 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://althealthworks.com/wp-content/uploads/2015/07/favicon-32x321.png", "canonical": "https://althealthworks.com/bill-gates-funded-company-given-epa-approval-to-release-thousands-of-gmo-mosquitoes-in-two-u-s-states-2/", "encoding": "UTF-8"}, "image": null, "domain": "althealthworks.com", "title": "Bill Gates-Funded Company Given EPA Approval to Release Thousands of GMO Mosquitoes in Two U.S. States", "cleaned_text": "Former Microsoft Founder Bill Gates has been interviewed extensively in the news recently, mostly about his viewpoints on the ongoing coronavirus situation, which ultimately involve his professed plans to “vaccinate virtually the entire world population.”\n\nGates has said that he will need legal protection from governments should his plan go the way he anticipates, and has also estimated that hundreds of thousands of people may experience adverse events from the vaccine.\n\nDespite these concerns, the industry and Gates continue to push on undeterred.\n\nGates has also donated millions of dollars to several other wide-ranging causes, many of which have drawn controversy from those who believe his influence goes way too far.\n\nIn recent years Gates has donated millions of dollars to outfit small farmers with genetically engineered seeds, invested in a project to create lab grown meat from GMO yeast, and has even worked with Harvard University on a project to block out the sun’s rays using geoengineering, according to a report from Forbes.com.\n\nNow, it has come to light that Gates has also funded GMO mosquitoes, which have been given the go-ahead by the United States EPA be released in two states despite previous reports of unintended consequences from Yale University and other scientists.\n\nReport: Gates Foundation Funded GMO Mosquitoes Approved for Release in Two States\n\nAccording to a “fact checking” report from USA Today released earlier this year, alternative media reports of a forthcoming GMO mosquito release in two states have proven to be true.\n\nThe release, which will be conducted by Bill Gates funded company Oxitec, has been granted an “experimental use permit” to release the novel GMO mosquitoes in the Florida Keys and Harris County, Texas, where Houston is located.\n\n“To meet today’s public health challenges head-on, the nation needs to facilitate innovation and advance the science around new tools and approaches to better protect the health of all Americans,” a news release from the EPA said.\n\nThe permit will last for two years and will require the British company to monitor and sample the new population of novel GMO mosquitoes.\n\nPrevious attempts to release the lab-created insects have been met with opposition in Monroe County, Florida (the Florida Keys), where city officials ultimately voted against them.\n\nBut a vote in the Florida Keys earlier this August by a tally of 4-1 allowed for the release of millions of genetically modified mosquitoes in a yet-to-be-disclosed area of the island chain.\n\nAs is the case with most GMOs, the mosquitoes have not been tested for long-term safety, either in regards to their effects on humans or the local ecosystem.\n\nThe mosquitoes were originally created through a $4.1 million grant by the Bill & Melinda Gates Foundation, which led to a new strain of male GMO mosquitoes of the Anopheles albimanus species.\n\nThe EPA believes they are safe, but environmental activists aren’t so sure.\n\n“We have repeatedly asked for Oxitec to work with us to prove the technology is safe,” Barry Wray, executive director of the Florida Keys Environmental Coalition, said in a statement in 2018 after Oxitec applied for its second permit.\n\n“Instead of receiving Oxitec’s cooperation to provide this confidence, we have witnessed a pattern of avoidance, misrepresentations, obfuscations and using marketing and political influence to persuade the regulatory and community stakeholders to proceed with what is truly a poorly designed experiment on our public and ecosystems,” Wray said.\n\nThe Texas releases aren’t scheduled to happen some time in 2021, but the Florida ones could happen sooner.\n\nDespite the presumably positive intentions of the mosquitoes to combat disease, there is much doubt of whether the experiment will be effective or not, along with potential health and environmental ramifications of releasing a novel organism into an ecosystem.\n\nreport this ad“The idea would be that when these males mated with females, the offspring would die. And therefore the overall population size of the mosquitoes would decline.” said Yale professor Jeffrey Powell.\n\nThat didn’t appear to go as planned in practice, Powell added.\n\nRecently, scientists at Yale and other universities found that hybrids of the GMO mosquitoes and native mosquitoes were produced in Brazil, where millions of them were released by the aforementioned company, meaning some offspring were not sterile as expected.\n\nIn other words, the jury is still out on whether the experiment will backfire or not. The mosquitoes haven’t been tested for long-term safety or environmental impact, and they may actually be causing native mosquito populations to become stronger and more menacing in the long run.\n\n“What we found was unexpected. Unpredicted,” Powell said.\n\n“We don’t know what the effect of having this hybrid population is,” “These could be stronger mosquitoes, harder to control.\n\nThanks for installing the Bottom of every post plugin by Corey Salzano. Contact me if you need custom WordPress plugins or website design.", "opengraph": {"image": "https://althealthworks.com/wp-content/uploads/2020/06/gates-1.jpg"}, "tags": ["mosquitoes bill gates", "mosquitoes gates foundation are gmo", "bill gates gmo mosquitoes", "gmo mosquitoes released by bill gates oxitec", "bill gates gmos"], "tweets": [], "movies": [], "links": ["http://www.facebook.com/sharer.php?u=https%3A%2F%2Falthealthworks.com%2Fbill-gates-funded-company-given-epa-approval-to-release-thousands-of-gmo-mosquitoes-in-two-u-s-states-2%2F&t=Bill%20Gates-Funded%20Company%20Given%20EPA%20Approval%20to%20Release%20Thousands%20of%20GMO%20Mosquitoes%20in%20Two%20U.S.%20States", "http://twitter.com/share?text=Bill%20Gates-Funded%20Company%20Given%20EPA%20Approval%20to%20Release%20Thousands%20of%20GMO%20Mosquitoes%20in%20Two%20U.S.%20States&url=https%3A%2F%2Falthealthworks.com%2Fbill-gates-funded-company-given-epa-approval-to-release-thousands-of-gmo-mosquitoes-in-two-u-s-states-2%2F&via=AltHealthWorks.com", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Falthealthworks.com%2Fbill-gates-funded-company-given-epa-approval-to-release-thousands-of-gmo-mosquitoes-in-two-u-s-states-2%2F&title=Bill%20Gates-Funded%20Company%20Given%20EPA%20Approval%20to%20Release%20Thousands%20of%20GMO%20Mosquitoes%20in%20Two%20U.S.%20States", "#", "https://www.newsbreak.com/news/0OjuVPdQ/bill-gates-indemnification-from-lawsuits-needed-in-order-to-vaccinate-the-global-population", "https://althealthworks.com/14353/increasingly-urgent-bill-gates-ups-the-ante-donates-millions-to-push-gmos-on-small-farmers-around-the-world/", "https://althealthworks.com/14431/the-truth-about-lab-grown-meat-author/", "https://althealthworks.com/17769/harvard-researchers-begin-work-on-bill-gates-funded-project-to-block-out-the-sun-with-geoengineering/", "https://www.wshu.org/post/genetically-modified-mosquitoes-yield-unintended-consequences-yale-study-finds?fbclid=IwAR373CFI8-H9LIci8A9ddOY23RcGbUcBPQOyZx4ekMHdQyteQfLiI7whSAI#stream/0", "https://www.usatoday.com/story/news/factcheck/2020/06/09/fact-check-epa-clears-genetically-modified-mosquitoes-us-release/5327840002/", "https://www.epa.gov/pesticides/epa-approves-experimental-use-permit-test-innovative-biopesticide-tool-better-protect", "https://www.ezoic.com/what-is-ezoic/", "http://wordpress.org/extend/plugins/bottom-of-every-post/", "http://www.tacticaltechnique.com/wordpress/"], "authors": ["Nick Meyer"], "publish_date": null}