{"result_id": "020028", "URL": "https://althealthworks.com/gates-funded-an-implantable-device-that-would-embed-vaccination-records-into-a-childs-skin-scientific-american-reported-in-2018/", "timestamp": "2023-04-25 11:59:29 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://althealthworks.com/wp-content/uploads/2015/07/favicon-32x321.png", "canonical": "https://althealthworks.com/gates-funded-an-implantable-device-that-would-embed-vaccination-records-into-a-childs-skin-scientific-american-reported-in-2018/", "encoding": "UTF-8"}, "image": null, "domain": "althealthworks.com", "title": "Gates Funded an Implantable Device That Would “Embed Vaccination Records Into a Child’s Skin,” Scientific American Reported in 2018", "cleaned_text": "Do the so-called “conspiracy theories” against Bill Gates carry any validity, or are they simply the product of an obsessive social media-driven society with too much time on their hands and an imagination gone wild?\n\nA quick Google search on “Bill Gates conspiracy” brings up page after page of Gates taking his turn in the media spotlight, “debunking” these alleged conspiracies through countless interviews.\n\nFact-checking organizations and newspapers have also rushed to Gates’ defense over these alleged conspiracies, many of which center around the potential side effects of the vaccines Gates has stated he wants to give to the entire world, and/or his purported desire to utilize microchip technology as part of his vaccine deployment strategy.\n\nRecently, Gates was invited on the ‘CBS News with Norah O’Donnell’ program, during which the topic of microchips came up, as well as whether or not Gates wants to include some sort of tracking device in any potential COVID-19 vaccines.\n\nAs usual, Gates was given the greenlight to “debunk” popular conspiracies against him, but what Gates said about microchips should be a cause for concern for anyone with basic reasoning skills who’s ever had the chance to poke around the Bill & Melinda Gates Foundation website for a few minutes.\n\nGates States He’s Never Been Involved in Microchips — But His Foundation Certainly Has Been\n\nDuring the interview, which was published on BusinessInsider.com, Gates attempted to refute conspiracy theories against him by saying the following.\n\n“I’ve never been involved in any sort of microchip-type thing,” Gates said, adding: “It’s almost hard to deny this stuff because it’s so stupid or strange.”\n\nBut these alleged conspiracy theories against Gates are actually rooted in facts, as a simple search on the Bill & Melinda Gates Foundation website reveals.\n\nA quick search of the word “microchips” on the Foundation’s website reveals that the Gates Foundation has in fact funded microchip-related projects, including a conditional grant they awarded to Microchips Biotech, Inc., a company that has now become Daré Bioscience, worth over $20 million.\n\nA screenshot of the grant can be seen below.\n\nAccording to an article from the website Xconomy.com, the purpose of the grant was “to design a microchip-based implant for the purposes of birth control.”\n\n“The contraceptive implant would be gridded with tiny compartments, each containing a small dose of medication—in this case, the hormone levonorgestrel—to be released on a predetermined schedule.\n\nPatients would be able to halt and resume the dosing regimen as needed.\n\n“That would give the product an advantage over existing methods of contraception because of the increased control it would give for family planning purposes,” Daré Bio CEO Sabrina Martucci Johnson said.\n\nSuch a product would enable women to avoid extra visits to the doctor’s office to have the implant removed as is often with the case with traditional implantable birth control devices.\n\nBut the proposed technology would likely be far more advanced and far more intrusive, as this particular implantable device “could be controlled wirelessly,” according to the article, bringing a “smartphone” type of technology directly into women’s sexual and reproductive health.\n\nGates Foundation Has Also Funded Embeddable Vaccine IDs for Children\n\nAlong with the above technology, the Gates Foundation has previously funded a type of embeddable vaccination ID for children, according to a 2018 article published by Scientific American.\n\nThe vaccination ID is a high-tech, implantable device that can be read via a smartphone, and looks suspiciously like a microchip according to the picture below provided by Second Bay Studios, an organization that has designed over 100 covers for several leading scientific journals.\n\nThe proposed device was created by Massachusetts Institute of Technology scientists with funding from the Gates Foundation, and utilizes a “quantum dot dye that is delivered, along with a vaccine, by a microneedle patch,” the article states, along with tiny crystalline microneedles that deliver the dye into the skin.\n\n“The dye, which is invisible to the naked eye, can be read later using a specially adapted smartphone.”\n\nIn other words, if either of these technologies come to fruition, the Gates Foundation will have funded two separate implantable devices to be placed inside the human body to be read or controlled through outside forces, and the above technology aimed at children provides a foundation that would easily allow for microchips and vaccines to be used simultaneously, if the Gates Foundation and its many medical and pharmaceutical companies choose to go forward with it.\n\nTaking this information into account, it’s easy to see why so many “theories” are popping up as to how Gates and his Foundation could use them in the future.\n\nDigital IDs and Vaccinations are a Very Real Possibility According to Gates Technology\n\nAs the United States, and the global community at-large, continue to “mask up,” “shelter in place” and wait for an end to the coronavirus situation that has dominated world news headlines, the question of whether or not a digital ID is being developed has remained outside of the scope of the mainstream media, and the public consciousness.\n\nBut behind-the-scenes, the pace of development is expanding rapidly, as the aforementioned technologies demonstrate.\n\nSeveral states are also considering whether or not to administer mandatory COVID-19 vaccines in the upcoming months.\n\nMeanwhile, Gates and other global thought leaders continue to push for some type of digital vaccine identification system, according to various reports.\n\n“Biometric digital IDs can be a gamechanger,” said Prashant Yadav, a senior fellow at the US-based Center for Global Development. “They can help governments target population segments, verify people who have received vaccination, and have a clear record.”\n\nAnd while it is not known according to the current media reports, or lack thereof, as to whether or not Gates himself has been involved in this microchip-based “gold rush” toward digital IDs and vaccinating the entire world (perhaps in tandem), he’s not shy about admitting his plans to create digital vaccine IDs.\n\n“We will have some digital certificates,” Gates told Reuters in March.\n\nThe certificates will be designed show who has received vaccines and who hasn’t, according to a report from BBC.com.\n\nWhether or not Gates himself will be involved in their production, as is the question with his foundation’s microchip-related endeavors, remains to be seen, but one thing’s for certain: the Gates Foundation has been involved in microchip-type technologies after all, and the information is widely available for anyone to see on its website.\n\nRelated Reading: Bill Gates funds birth control microchip that lasts 16 years inside the body and can be turned on or off with remote control\n\nThanks for installing the Bottom of every post plugin by Corey Salzano. Contact me if you need custom WordPress plugins or website design.", "opengraph": {"image": "https://althealthworks.com/wp-content/uploads/2021/05/bill-1.png"}, "tags": ["bill gates microchips", "bill gates implants", "the truth about bill gates and microchips", "fact checking bill gates and microchips", "fact checked bill gates microchips", "bill gates implantable device"], "tweets": [], "movies": [], "links": ["http://www.facebook.com/sharer.php?u=https%3A%2F%2Falthealthworks.com%2Fgates-funded-an-implantable-device-that-would-embed-vaccination-records-into-a-childs-skin-scientific-american-reported-in-2018%2F&t=Gates%20Funded%20an%20Implantable%20Device%20That%20Would%20%E2%80%9CEmbed%20Vaccination%20Records%20Into%20a%20Child%E2%80%99s%20Skin%2C%E2%80%9D%20Scientific%20American%20Reported%20in%202018", "http://twitter.com/share?text=Gates%20Funded%20an%20Implantable%20Device%20That%20Would%20%E2%80%9CEmbed%20Vaccination%20Records%20Into%20a%20Child%E2%80%99s%20Skin%2C%E2%80%9D%20Scientific%20American%20Reported%20in%202018&url=https%3A%2F%2Falthealthworks.com%2Fgates-funded-an-implantable-device-that-would-embed-vaccination-records-into-a-childs-skin-scientific-american-reported-in-2018%2F&via=AltHealthWorks.com", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Falthealthworks.com%2Fgates-funded-an-implantable-device-that-would-embed-vaccination-records-into-a-childs-skin-scientific-american-reported-in-2018%2F&title=Gates%20Funded%20an%20Implantable%20Device%20That%20Would%20%E2%80%9CEmbed%20Vaccination%20Records%20Into%20a%20Child%E2%80%99s%20Skin%2C%E2%80%9D%20Scientific%20American%20Reported%20in%202018", "#", "https://www.youtube.com/watch?v=EjgbMib36do", "https://www.gatesfoundation.org/", "https://xconomy.com/san-diego/2019/11/15/dare-to-add-microchip-based-birth-control-to-womens-health-portfolio/", "https://www.scientificamerican.com/article/invisible-ink-could-reveal-whether-kids-have-been-vaccinated/", "https://www.ezoic.com/what-is-ezoic/", "https://www.bbc.com/news/52847648", "https://nationalpost.com/news/bill-gates-funds-birth-control-microchip-that-lasts-16-years-inside-the-body-and-can-be-turned-on-or-off-with-remote-control", "http://wordpress.org/extend/plugins/bottom-of-every-post/", "http://www.tacticaltechnique.com/wordpress/"], "authors": ["Nick Meyer"], "publish_date": null}