{"result_id": "020025", "URL": "https://althealthworks.com/this-is-what-america-looked-like-before-the-epa-shocking-photo-gallery/", "timestamp": "2023-04-25 11:59:27 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://althealthworks.com/wp-content/uploads/2015/07/favicon-32x321.png", "canonical": "https://althealthworks.com/this-is-what-america-looked-like-before-the-epa-shocking-photo-gallery/", "encoding": "UTF-8"}, "image": null, "domain": "althealthworks.com", "title": "THIS Is What America Looked Like Before the EPA (Shocking Photo Gallery)", "cleaned_text": "The Environmental Protection Agency is far from perfect, but few people realize just how bad of shape the United States was in, environmentally speaking, prior to its creation in 1970 (and before cleanup efforts were completed).\n\nAs the world waits for corporations and society to transition from dirty, polluting industries like oil, coal and plastics to cleaner “green” forms of energy and building materials, there’s a battle going on behind the scenes.\n\nNeedless to say, these industries are doing everything they can to hold on to their position of power.\n\nThe oil & gas industry spent over $117,000,000 lobbying Congress in the year 2016, and new President Donald Trump has been a vocal proponent in the name of helping the economy. He’s also not exactly a “huge” fan of the EPA.\n\nTrump recently repealed a crucial transparency law that requires energy companies to disclose their payments to foreign governments, and his administration is ready to tackle tens of thousands of regulations that it says are holding back the natural gas and mining industries.\n\n“We’re bringing back jobs big league. We’re bringing them back at the plant level, we’re bringing them back at the mine level. The energy jobs are coming back,” Trump said recently about the repealing of regulations. “A lot of people going back to work now.”\n\nAnd according to key presidential aide Myron Ebell in The Guardian, Trump’s campaign trail pledge to abolish the EPA (or “leave a little bit” as he put it) could still happen “incrementally,” starting with a round of potential cuts and executive orders that could be announced soon.\n\nExecutive Orders Could “Suck the Air Out of the Room” at EPA\n\nWhile repealing regulations might be good for the economy, advocates of clean energy and the environment have been left out in the cold — and they may have bigger problems to contend with now.\n\nRecently Rep. Matt Gaetz of Florida introduced legislation that would completely abolish the EPA. While it seems like a longshot to pass, it’s well worth noting that Trump himself may be in Gaetz’s corner if Ebell’s assertions (read the interview here) are true.\n\nTrump’s new head of the EPA, Scott Pruitt, has said that he supports the agency, which has about 4,800 workers in Washington, D.C. and 11,000 nationally, but said believes it has become too bloated under the the Obama administration. A round of Trump executive orders and cuts that could “suck the air out of the room” is expected to happen soon, according to one EPA official as mentioned by Grist.org.\n\nMany possible changes are likely to revolve around climate change and/or carbon emissions. Pruitt also has a track record of paving the way for a more toxic environment: he worked to eliminate restrictions on airborne mercury emissions and cross-state smog, according to State Rep. Susan Collins of Maine. He has also sued the EPA a whopping 14 times — and now he’s actually leading it.\n\nThe EPA is responsible, among other things, for enforcing the Clean Air Act, the Clean Water Act, and the Superfund Act (which helps clean up hazardous environmental disaster sites caused by companies like Monsanto). While the agency has been accused of kowtowing to chemical corporations on issues like glyphosate and cancer, its work in protecting the environment cannot be discounted.\n\nThe EPA was created 46 years ago and works with a budget of more than $8 billion. Soon after it began in 1970, the agency announced its ‘Documerica’ initiative to capture “images relating to environmental problems, EPA activities, and everyday life,” undertaken by more than 100 freelance photographers.\n\nFrom 1972 to 1977, more than 81,000 photos were taken relating to “environmental problems, EPA activities, and everyday life;” many were taken before the EPA instituted programs to clean up the country’s air, waterways, and landscapes.\n\nAs you may have guessed, these pictures of America don’t look too inviting; in fact, they’re downright “filthy,” as the Huffington Post put it.\n\n“By the late 1960s, the American landscape was ravaged by decades of unchecked land development, blighted by urban decay in the big cities, and plagued by seemingly unstoppable air, noise, and water pollution,” C. Jerry Simmons, an archivist and historian at the National Archives in Washington, is quoted as saying in 2009. “The project takes rightful credit for the United States’ first serious examination of its rapidly decaying natural environment.”\n\nWhat will happen as Trump’s new EPA takes shape is anyone’s guess, but it’s important to know the true history of the United States before the EPA was able to carry out its mission.\n\nTake a good, hard look at the pre-EPA America, courtesy of these photos shared from the U.S. National Archives:\n\nThe former World Trade Center buildings tower over piles of garbage in New York City in this spring 1973 photo. Not exactly the most inviting picture of the Big Apple, is it?\n\nThe Cuyahoga River in Ohio literally “caught fire” in 1969. Extensive coverage from Time Magazine led to the signing of the National Environment Protection Act (NEPA) into law on Jan. 1, 1970, creating the EPA and leading to the river’s cleanup. Below is a sample of the suffocating pollution residents faced.\n\nWhile the skyline above the New York metropolitan area is far from clear, this picture shows just how bad it was in the 1970s, with smog not unlike that of modern-day China.\n\nPeople across the country have suffered, including these residents in Birmingham, Alabama.\n\nreport this adHouston, Texas is the subject of this shocking photo of unchecked pollution.\n\nThe EPA oversees cleanup programs aimed at removing debris, illegal dumping, and other environmental hazards such as this one in Queens.\n\nSince the EPA was created, “aggregate national emissions of the six common pollutants alone dropped an average of 70 percent” according to the EPA’s website.\n\nWithout the EPA or with a scaled-back one, big-time polluters will have free reign, advocates fear.\n\nWhether the EPA is “bloated” or not is up for interpretation, but the truth remains: we need to remember our roots if we have any hopes of creating a better future.\n\nSerious issues like the pending Dakota Access Pipeline, pollution, fracking in general, the plague of toxic agrochemicals decimating bee and monarch populations, and many more all need our attention, and the natural world is suffering as big oil and gas continue to pollute everything in sight.\n\nThanks for installing the Bottom of every post plugin by Corey Salzano. Contact me if you need custom WordPress plugins or website design.", "opengraph": {"image": "https://althealthworks.com/wp-content/uploads/2017/02/3679279416_b2e072f3ec_z.jpg"}, "tags": ["trump wants to disband the epa", "trump epa", "stop trump epa", "trump disband the epa", "trump epa bad law", "trump epa new ban", "trump epa climate change", "why does trump want to disband the epa", "trump epa law", "america pre epa"], "tweets": [], "movies": [], "links": ["http://www.facebook.com/sharer.php?u=https%3A%2F%2Falthealthworks.com%2Fthis-is-what-america-looked-like-before-the-epa-shocking-photo-gallery%2F&t=THIS%20Is%20What%20America%20Looked%20Like%20Before%20the%20EPA%20%28Shocking%20Photo%20Gallery%29", "http://twitter.com/share?text=THIS%20Is%20What%20America%20Looked%20Like%20Before%20the%20EPA%20%28Shocking%20Photo%20Gallery%29&url=https%3A%2F%2Falthealthworks.com%2Fthis-is-what-america-looked-like-before-the-epa-shocking-photo-gallery%2F&via=AltHealthWorks.com", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Falthealthworks.com%2Fthis-is-what-america-looked-like-before-the-epa-shocking-photo-gallery%2F&title=THIS%20Is%20What%20America%20Looked%20Like%20Before%20the%20EPA%20%28Shocking%20Photo%20Gallery%29", "#", "https://www.opensecrets.org/lobby/top.php?showYear=2016&indexType=i", "http://thehill.com/policy/energy-environment/319488-trump-signs-repeal-of-transparency-rule-for-oil-companies", "http://thehill.com/policy/energy-environment/319488-trump-signs-repeal-of-transparency-rule-for-oil-companies", "http://“", "https://www.congress.gov/bill/115th-congress/house-bill/861", "https://www.theguardian.com/us-news/2017/feb/02/donald-trump-plans-to-abolish-environmental-protection-agency", "http://grist.org/article/trump-plans-to-target-the-epa-with-new-executive-orders/", "https://www.theatlantic.com/science/archive/2017/02/the-epa-officially-gets-a-new-leader-scott-pruitt/517176/", "http://www.ecowatch.com/abolish-epa-bill-pruitt-2267818117.html", "https://althealthworks.com/3951/man-travels-across-u-s-documents-destruction-for-monsanto-a-photographic-investigation/", "https://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=4&cad=rja&uact=8&ved=0ahUKEwiywoD155rSAhWBOCYKHb0lDjAQFgg9MAM&url=http%3A%2F%2Fwww.huffingtonpost.com%2Fcarey-gillam%2Fepa-bows-to-chemical-indu_b_12563438.html&usg=AFQjCNFS-dwPKXQd97KFmSExYZFyjYLW5g&sig2=fNzb5O_VclrtIeXRI3ZZxA", "http://www.huffingtonpost.com/entry/america-before-the-epa-documerica_us_5886ebc5e4b070d8cad5211d", "http://www.huffingtonpost.com/entry/america-before-the-epa-documerica_us_5886ebc5e4b070d8cad5211d", "https://www.ezoic.com/what-is-ezoic/", "https://www.epa.gov/clean-air-act-overview/progress-cleaning-air-and-improving-peoples-health", "https://althealthworks.com/12274/monarch-butterfly-population-in-extreme-peril-as-nearly-one-third-of-population-dies-over-80-decline-recorded-since-the-1990s/", "https://althealthworks.com/12171/trumps-decision-to-study-vaccine-safety-with-controversial-activist-backed-by-undeniable-scienceyelena/", "https://althealthworks.com/11615/denied-federal-judge-strikes-down-monsanto-claims-orders-trial-for-massive-environmental-damage-to-proceed/", "http://wordpress.org/extend/plugins/bottom-of-every-post/", "http://www.tacticaltechnique.com/wordpress/"], "authors": ["Nick Meyer"], "publish_date": null}