{"result_id": "020006", "URL": "https://althealthworks.com/native-american-leader-calls-out-bill-gates-billionaire-class-in-powerful-letter-he-now-owns-more-farmland-than-my-entire-nation/", "timestamp": "2023-04-25 11:59:20 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://althealthworks.com/wp-content/uploads/2015/07/favicon-32x321.png", "canonical": "https://althealthworks.com/native-american-leader-calls-out-bill-gates-billionaire-class-in-powerful-letter-he-now-owns-more-farmland-than-my-entire-nation/", "encoding": "UTF-8"}, "image": null, "domain": "althealthworks.com", "title": "Native American Leader Calls Out Bill Gates, Billionaire Class in Powerful Letter: “He Now Owns More Farmland Than My Entire Nation”", "cleaned_text": "A quick online search for the term “climate change” reveals an onslaught of news on the topic, most of it focusing on emissions and the shift away from “carbon-based fossil-fuel energy projects.”\n\nWhat the mainstream media refuses to focus on, however, is the solution staring them right in the face: the shift in agricultural policy from GMOs and pesticide-intensive monoculture to the worldwide change that would net the biggest positive impact: a return to organic, regenerative agriculture, which the UN pushed for in its landmark 2013 report ‘Wake Up Before It’s Too Late.’\n\nRegenerative agriculture is not only highly productive and chemical-free, it also helps to replenish the vitally important, lost layers of topsoil that have recently gone missing from farms across the United States, which can help stave off droughts, sequestering both water and carbon, while provide more nourishing, mineral, and antioxidant-rich food.\n\nWhile the potential of organic, regenerative agriculture has gone mostly unrealized in recent decades, there’s at least one major obstacle standing in the way of its implementation: corporate actors like Monsanto, Bayer, and Bill Gates, the latter of which is now the largest owner of farmland in the United States.\n\nNative American Author Takes “Farmer Bill” Gates to Task Over Lack of Farming Knowledge\n\nAs a professor in the American Studies Department at the University of New Mexico, co-founder of The Red Nation (an Indigenous resistance organization), citizen of the Lower Brule Sioux Tribe, and author of several books, Nick Estes knows a thing or two about land ownership, and what he’s seen in recent months with former Microsoft Chairman Bill Gates becoming the largest owner of private land in the United States does not sit well with him, to say the least.\n\n“Gates has been buying land like it’s going out of style,” Estes wrote in a wide-ranging letter to Gates published by The Guardian.\n\n“He now owns more farmland than my entire Native American nation.”\n\nWhile the collective wealth of the world’s billionaires rose a whopping 54% since the beginning of the coronavirus situation in March 2020 (Gates’ net worth rose by 29%), Estes is focused on an entirely different kind of wealth, namely the power that comes with land ownership.\n\nGates has a long history of pushing genetically engineered crops and pesticides on farmers in third world countries, while supporting the same system here. Much like his positioning as an expert on the coronavirus in the mainstream media, Gates is out of his element yet again, Estes said.\n\n“Bill Gates has never been a farmer,” Estes notes in the article. “So why did the Land Report dub him ‘Farmer Bill’ this year?\n\n“The third richest man on the planet doesn’t have a green thumb. Nor does he put in the back-breaking labor humble people do to grow our food and who get far less praise for it.”\n\nGates currently owns about 242,000 acres of farmland with more than $690 million in assets, Estes notes in The Guardian.\n\n“To put that in perspective, that’s nearly the size of Hong Kong, and twice the acreage of the Lower Brule Sioux Tribe, where I’m an enrolled member,” Estes said.\n\n“A white man owns more farmland than my entire Native American nation!”\n\nEstes on Gates: “The Billionaire Knows Best Mentality Has to Go”\n\nWhile the demand for organic food, supplements, clothing, materials, and personal hygiene and beauty items continues to rise, Gates and the world’s ruling class continue to push for GMOs and Roundup-drenched crops.\n\nBecause of the lack of organic farmland, the United States actually imports a large majority of crops used in its organic products, while refusing to adjust and continuing to poison its land, air, water, and soil.\n\n“The United States is defined by the excesses of its ruling class. But why do a handful of people own so much land?” Estes asks in the letter.\n\n“Land is power, land is wealth, and more importantly, land is about race and class.”\n\nEstes cited an example of billionaire Ted Turner, who currently owns two million acres and has the world’s largest privately owned buffalo herd.\n\n“Those animals, which are sacred to my people and were nearly hunted to extinction by settlers, are preserved today on nearly 200,000 acres of Turner’s ranchland within the boundaries of the 1868 Fort Laramie Treaty territory in the western half of what is now the state of South Dakota, land that was once guaranteed by the U.S. government to be a ‘permanent home’ for Lakota people.”\n\nEstes said that small farmers are far more careful with the land, and noted that Gates has said his farmland purchases had nothing to do with climate change — adding that the decision came from his “investment group.”\n\nWill Gates and his group take care of the land in accordance with his stated goals of “combating climate change,” or will he continue to destroy it over time like other monoculture farms have been doing throughout the Midwest?\n\nThe prospects don’t look good, based on Gates’ track record.\n\nWhile his firm, Cascade Investment, has said it is “very supportive of sustainable farming,” different things have different meanings to different people, and entities like Gates, Monsanto and Bayer have long pushed the notion that GMOs, Roundup, and increasingly larger and stronger amounts of toxic, synthetic chemicals are and should be part of a “sustainable system,” despite their clearly destructive nature in contrast with regenerative, organic farming.\n\nThe Sioux leader is among a growing movement of people concerned about increasing corporate control of agriculture in the U.S.\n\nreport this ad“Like wealth, land ownership is becoming concentrated into fewer and fewer hands, resulting in a greater push for monocultures and more intensive industrial farming techniques to generate greater returns,” he writes.\n\n“One percent of the world’s farms control 70% of the world’s farmlands, one report found. The biggest shift in recent years from small to big farms was in the U.S.\n\n“The third richest man on the planet doesn’t have a green thumb,”\n\n“Nor does he put in the back-breaking labor humble people do to grow our food and who get far less praise for it.\n\nThe best thing these billionaires can do for saving the planet is to give the land back to its rightful owners for growing food the way nature intended, Estes says in the letter, which can be read in full here,\n\nIn other words, he writes, the “billionaire knows best” mentality has to go.\n\n“The average person has nothing in common with mega-landowners like Bill Gates or Ted Turner. The land we all live on should not be the sole property of a few.\n\n“These billionaires have nothing to offer us in terms of saving the planet – unless it’s our land back.”\n\nThanks for reading! Nick Estes has written several books, including ‘Our History Is the Future: Standing Rock Versus the Dakota Access Pipeline, and the Long Tradition of Indigenous Resistance.’\n\nThanks for installing the Bottom of every post plugin by Corey Salzano. Contact me if you need custom WordPress plugins or website design.", "opengraph": {"image": "https://althealthworks.com/wp-content/uploads/2021/04/gates-1-1.jpg"}, "tags": ["nick estes bill gates", "bill gates and nick estes", "nick estes sioux nation", "bill gates nick estes native american leader", "bill gates land owner"], "tweets": [], "movies": [], "links": ["http://www.facebook.com/sharer.php?u=https%3A%2F%2Falthealthworks.com%2Fnative-american-leader-calls-out-bill-gates-billionaire-class-in-powerful-letter-he-now-owns-more-farmland-than-my-entire-nation%2F&t=Native%20American%20Leader%20Calls%20Out%20Bill%20Gates%2C%20Billionaire%20Class%20in%20Powerful%20Letter%3A%20%E2%80%9CHe%20Now%20Owns%20More%20Farmland%20Than%20My%20Entire%20Nation%E2%80%9D", "http://twitter.com/share?text=Native%20American%20Leader%20Calls%20Out%20Bill%20Gates%2C%20Billionaire%20Class%20in%20Powerful%20Letter%3A%20%E2%80%9CHe%20Now%20Owns%20More%20Farmland%20Than%20My%20Entire%20Nation%E2%80%9D&url=https%3A%2F%2Falthealthworks.com%2Fnative-american-leader-calls-out-bill-gates-billionaire-class-in-powerful-letter-he-now-owns-more-farmland-than-my-entire-nation%2F&via=AltHealthWorks.com", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Falthealthworks.com%2Fnative-american-leader-calls-out-bill-gates-billionaire-class-in-powerful-letter-he-now-owns-more-farmland-than-my-entire-nation%2F&title=Native%20American%20Leader%20Calls%20Out%20Bill%20Gates%2C%20Billionaire%20Class%20in%20Powerful%20Letter%3A%20%E2%80%9CHe%20Now%20Owns%20More%20Farmland%20Than%20My%20Entire%20Nation%E2%80%9D", "#", "https://althealthworks.com/wake-up-before-its-too-late-new-un-report-calls-for-dramatic-shift-toward-natural-agriculture/", "https://althealthworks.com/new-study-finds-that-organic-topsoil-is-missing-from-a-vast-number-of-midwestern-farms/", "https://althealthworks.com/forgetten-studies-show-organic-tomatoes-offer-more-health-benefits-than-conventional/", "https://amzn.to/3nl7f5N", "https://www.theguardian.com/commentisfree/2021/apr/05/bill-gates-climate-crisis-farmland", "https://althealthworks.com/increasingly-urgent-bill-gates-ups-the-ante-donates-millions-to-push-gmos-on-small-farmers-around-the-world/", "https://althealthworks.com/6-shocking-reasons-why-you-can-never-trust-organic-from-china/", "https://althealthworks.com/new-study-finds-that-organic-topsoil-is-missing-from-a-vast-number-of-midwestern-farms/", "https://www.ezoic.com/what-is-ezoic/", "https://www.theguardian.com/commentisfree/2021/apr/05/bill-gates-climate-crisis-farmland", "https://amzn.to/3nl7f5N", "https://althealthworks.com/colorado-landowner-returns-sacred-ancestral-land-to-tribal-leaders/", "http://wordpress.org/extend/plugins/bottom-of-every-post/", "http://www.tacticaltechnique.com/wordpress/"], "authors": ["Nick Meyer"], "publish_date": null}