{"result_id": "020038", "URL": "https://althealthworks.com/hillary-clintons-foundation-arranged-for-chinese-vaccine-makers-to-avoid-u-s-scrutiny-world-health-organization-report-reveals-2/", "timestamp": "2023-04-25 11:59:33 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://althealthworks.com/wp-content/uploads/2015/07/favicon-32x321.png", "canonical": "https://althealthworks.com/hillary-clintons-foundation-arranged-for-chinese-vaccine-makers-to-avoid-u-s-scrutiny-world-health-organization-report-reveals-2/", "encoding": "UTF-8"}, "image": null, "domain": "althealthworks.com", "title": "Hillary Clinton’s Foundation Arranged for Chinese Vaccine Makers to Avoid U.S. Scrutiny, World Health Organization Report Reveals", "cleaned_text": "Editor’s note: This article was first written in 2016. It does not reference COVID-19 or COVID-19 vaccines, but it does shed light on the multi-billion dollar global vaccine market and how business is conducted, along with concerns about vaccine oversight, quality control, adverse events and safety testing.\n\nBecause of a 2014 classification change, Chinese manufactured vaccines were given the greenlight to be shipped in bulk to as many as 152 low and middle-income countries and can now bypass any inspection from any other country, including the U.S. — all because of the work of the Clinton Foundation.\n\nThe World Health Organization (WHO) reported that year that vaccines will be pre-qualified, meaning they are so “confident in the quality, safety and effectiveness of vaccines that are made in China” that other countries would no longer require additional safety testing.\n\nThe Clinton Foundation, which is heavily involved in vaccine programs across the world, has reportedly been working with the Chinese vaccine manufacturers to give them pre-qualification, which was achieved in 2014 with little mention by the mainstream media.\n\nCan we trust China to manufacture vaccines?\n\nThat may be hard for many people to do after the recent Chinese vaccine scandal.\n\nChinese vaccine manufacturers, wholesale sellers, and buyers came under fire in 2016 over improperly transported and expired vaccines. The vaccinations were not refrigerated, and sold near their expiration dates, which made them virtually useless.\n\nMore than 130 people were arrested, (although the link now says 37) but most importantly it shed light on flaws within the system.\n\nAnother situation occurred in 2013 after 17 children, including 8 infants, passed away after receiving a Hepatitis B vaccine. Officials said the deaths were not linked to the vaccines, but the incident raised eyebrows over the safety of vaccines in China.\n\nThere is weak oversight in the process, leaving the vaccine makers and distributors to escape regulation from outside of China even when vaccines are being shipped to other countries. Liability for those who may be hurt from such vaccines shipped across the world is also a bigger concern.\n\nLance Rodewald, head of WHO’s expanded program on immunization (EPI) in China, had this to say – “(the new regulations) have made it possible for the United Nations and other agencies to procure life-saving vaccines for countries without the capacity to make high quality vaccines or the resources to purchase them.”\n\nBut while many surely do follow the regulations, the lack of oversight is troubling to others, especially considering that more and more vaccines from China could make their way to the U.S. in the coming years.\n\nU.S. Pharmaceuticals are Already Made in China\n\nAn estimated of 80% of major ingredients used in U.S. pharmaceuticals are manufactured overseas according to a 2019 report from the Council on Foreign Relations, with most materials coming from India and China. This is already a serious problem, as there is a lack of inspections of these ingredients.\n\nWhen the FDA tests these ingredients, they often do not comply to safety standards.\n\nIn one instance, the active ingredients for the drug Makena (seven samples were Chinese and three from U.S.-based repackagers) were tested by the drug’s manufacturer, USA Today reported, and the company found that eight samples did not comply, and one Chinese sample was actually just made of glucose.\n\nIn this new vast global medicine shipping operation, the concern is that mistakes like these are more commonplace than people realize.\n\nCan this happen to vaccines? Because of their recent pre-qualification status, many vaccines will not require inspection outside of China.\n\nAnd the FDA rarely visits pharmaceutical manufacturing sites in other countries.\n\nAccording to a U.S. Government Accountability report, “up to two-thirds of foreign pharmaceutical sites have never undergone an FDA inspection.”\n\nHillary Clinton was a part of the Clinton Foundation (originally started by her husband Bill Clinton in 1997) between 2013 and 2015. The WHO reported China’s pre-qualification of vaccines in 2014.\n\nClinton has also been accepting the most donation money from the pharmaceutical companies compared to other recent presidential candidates, which shows the industry’s support for her.\n\nUnfortunately rather than focusing on “greening our vaccines” and removing or at least further studying the additives that have been causing serious health problems, those who support the pharmaceutical industry continue to focus on profit over safety and accountability.\n\nEven though Hillary herself once questioned the safety of vaccines (including a possible link to autism) in this quote included in a campaign questionnaire: “(We are) committed to make investments to find the causes of autism, including possible environmental causes like vaccines,” her namesake foundation has now paved the way for China to become one of the top vaccine manufacturers globally.\n\nCurrently it is not known whether Chinese vaccines are making their way to the U.S. or not, but huge pharmaceutical companies such as Merck have facilities in China and are already establishing partnerships with Chinese companies.\n\nFor now, the only way to know for sure is to ask plenty of questions (and be sure to read the full insert before considering a vaccine as well).\n\nStill have questions about vaccines? Don’t miss this year’s biggest and most important event, the investigative 7 part docu-series: The Truth About Vaccines, playing FREE online. Click HERE To Watch Now.\n\nThanks for installing the Bottom of every post plugin by Corey Salzano. Contact me if you need custom WordPress plugins or website design.", "opengraph": {"image": "https://althealthworks.com/wp-content/uploads/2021/05/Nick-.jpg"}, "tags": ["clintons world health organization", "clinton foundation vaccine deal", "clinton foundation chinese vaccines", "clinton foundation vaccines", "clinton foundation china"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"500\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">The science is clear: The earth is round, the sky is blue, and <a href=\"https://twitter.com/hashtag/vaccineswork?src=hash&amp;ref_src=twsrc%5Etfw\">#vaccineswork</a>. Let's protect all our kids. <a href=\"https://twitter.com/hashtag/GrandmothersKnowBest?src=hash&amp;ref_src=twsrc%5Etfw\">#GrandmothersKnowBest</a></p><p>— Hillary Clinton (@HillaryClinton) <a href=\"https://twitter.com/HillaryClinton/status/562456798020386816?ref_src=twsrc%5Etfw\">February 3, 2015</a></p></blockquote>"], "movies": [], "links": ["http://www.facebook.com/sharer.php?u=https%3A%2F%2Falthealthworks.com%2Fhillary-clintons-foundation-arranged-for-chinese-vaccine-makers-to-avoid-u-s-scrutiny-world-health-organization-report-reveals-2%2F&t=Hillary%20Clinton%E2%80%99s%20Foundation%20Arranged%20for%20Chinese%20Vaccine%20Makers%20to%20Avoid%20U.S.%20Scrutiny%2C%20World%20Health%20Organization%20Report%20Reveals", "http://twitter.com/share?text=Hillary%20Clinton%E2%80%99s%20Foundation%20Arranged%20for%20Chinese%20Vaccine%20Makers%20to%20Avoid%20U.S.%20Scrutiny%2C%20World%20Health%20Organization%20Report%20Reveals&url=https%3A%2F%2Falthealthworks.com%2Fhillary-clintons-foundation-arranged-for-chinese-vaccine-makers-to-avoid-u-s-scrutiny-world-health-organization-report-reveals-2%2F&via=AltHealthWorks.com", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Falthealthworks.com%2Fhillary-clintons-foundation-arranged-for-chinese-vaccine-makers-to-avoid-u-s-scrutiny-world-health-organization-report-reveals-2%2F&title=Hillary%20Clinton%E2%80%99s%20Foundation%20Arranged%20for%20Chinese%20Vaccine%20Makers%20to%20Avoid%20U.S.%20Scrutiny%2C%20World%20Health%20Organization%20Report%20Reveals", "#", "http://www.who.int/bulletin/volumes/92/9/14-020914/en/", "http://www.who.int/bulletin/volumes/92/9/14-020914/en/", "http://www.bbc.com/news/world-asia-china-35878624", "http://www.who.int/bulletin/volumes/92/9/14-020914/en/", "https://www.cfr.org/blog/us-dependence-pharmaceutical-products-china#:~:text=While%20the%20Department%20of%20Defense,and%20other%20countries%20like%20India.", "http://www.usatoday.com/story/news/2012/10/21/global-drug-manufacturing-oversight/1646487/", "http://www.thevaccinereaction.org/2016/04/should-we-be-concerned-about-vaccines-made-in-china/", "https://twitter.com/hashtag/vaccineswork?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/GrandmothersKnowBest?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/HillaryClinton/status/562456798020386816?ref_src=twsrc%5Etfw", "http://www.usatoday.com/story/news/2012/10/21/global-drug-manufacturing-oversight/1646487/", "https://scentses4d.wordpress.com/2019/05/01/over-4-billion-paid-for-vaccine-injuries-and-deaths/", "https://althealthworks.com/7943/top-10-toxic-fake-food-items-produced-in-chinayelena/", "https://althealthworks.com/9079/6-shocking-reasons-why-you-can-never-trust-organic-from-chinayelena/", "https://althealthworks.com/9577/big-pharma-is-betting-on-this-presidential-candidate-to-win-millions-of-donations-are-pouring-inyelena/", "http://www.huffingtonpost.com/2015/02/02/2016-candidates-child-vaccinations_n_6598186.html", "http://www.huffingtonpost.com/2015/02/02/2016-candidates-child-vaccinations_n_6598186.html", "http://www.reuters.com/article/china-pharmaceuticals-idUSL3N0YY36F20150612", "http://www.mercknewsroom.com/press-release/corporate-news/merck-opens-new-manufacturing-facility-hangzhou-china", "https://scentses4d.wordpress.com/2019/05/01/ingredients-of-vaccines/", "https://go.thetruthaboutvaccines.com/?a_bid=9dd5b084&a_aid=56fbdd4295177", "http://wordpress.org/extend/plugins/bottom-of-every-post/", "http://www.tacticaltechnique.com/wordpress/", "https://www.ezoic.com/what-is-ezoic/"], "authors": ["Nick Meyer"], "publish_date": null}