{"result_id": "020002", "URL": "https://althealthworks.com/the-truth-about-lab-grown-meat-author/", "timestamp": "2023-04-25 11:59:18 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://althealthworks.com/wp-content/uploads/2015/07/favicon-32x321.png", "canonical": "https://althealthworks.com/the-truth-about-lab-grown-meat-author/", "encoding": "UTF-8"}, "image": null, "domain": "althealthworks.com", "title": "GMO Pusher Bill Gates Teams Up With Richard Branson, Hopes to End the Meat Industry As We Know It With Lab-Grown Beef", "cleaned_text": "Meat grown in labs has been a hot topic of conversation for the last seven years, with some media outlets hailing it as the future of food and a “cleaner” way to do meat.\n\nBut when the real thing hits supermarket shelves, will customers be kept in the dark about how it’s really made, and perhaps more importantly, will anybody actually want to eat it?\n\nReady or not, lab-grown meat from stem cells is on its way, and it’s being propped up by one of the most controversial names in the world of genetically modified food (GMOs) — Microsoft founder and long-time Monsanto supporter Bill Gates, along with another wealthy investor, Sir Richard Branson, founder of the Virgin Group.\n\nIn recent years, the two famous figures placed a big-time bet on the self-proclaimed “clean” lab-grown meat company Memphis Meats, to the tune of $17 million.\n\nBut will customers flock to this new so-called “murder free” meat, or are Gates and Branson making a mistake in betting on a an under-tested technology with big claims and unknown effects on human health?\n\nStartup Companies to Grow Meat in the Lab\n\nMemphis Meats and Hampton Creek (recently accused of labeling lies with its other products aimed at reducing animal agriculture) are the most commonly-heard of, but not the only companies who are working on creating lab-grown meat.\n\nMosaMeat of the Netherlands, founded by Professor Mark Post, first started with a product with a $325,000 price tag. Since then, “cultured meat” has become much more affordable — but has continued to avoid conversations on whether these products are actually healthy or not, and whether consumers will know if they have been made with GMO ingredients or not.\n\nAnother company is SuperMeat in Israel. Also founded by a professor, its goal is to create lab-grown chicken meat. The company raised $229,269 on Indiegogo to begin its efforts.\n\nThese companies are just the tip of the iceberg for what industry insiders hope becomes the new standard for meat eaters everywhere.\n\nAll of the lab-grown meat companies have a similar mission, as evidenced by these slogans and promises:\n• “A method that doesn’t require raising and slaughtering animals.” – Memphis Meats (now known as Upside Foods)\n• “Let’s change the way meat gets to the plate.” – Memphis Meats\n\nBesides their pledge to save animals, lab-grown meat companies make big claims when it comes to helping the environment.\n\nUpside Foods says they expect the following results from their products:\n• An up to 90% reduction in greenhouse gas emissions compared to conventional meat\n• The same reduction of land and water use\n\nMosaMeat says they will help solve the food crisis and combat climate change, but doesn’t say much about animal welfare. Their main technique requires one sample of muscle cells to be taken from live animals for every 20,000 tons of lab-grown meat, saying the biopsy is harmless and noting that the animal survives the procedure.\n\nSuperMeat promises to be humane, eco-friendly, to fight world hunger, and to create meat that is supposedly healthier and cheaper.\n\nHow the meat is actually grown, however, is another story entirely (and one these companies don’t exactly seem eager to reveal to future customers).\n\nWhile a humane, environmentally friendly and even “healthy” burger sounds like a dream come true for meat lovers, there are plenty of misconceptions here that the public is being kept in the dark about.\n\nThe first issue with lab-grown meat is how the meat cells are being harvested.\n\nClick Here to Receive a Discount on Your First Box of Organic, Grass-fed Meat\n\nSlate recently reported that most lab-grown beef comes from a surprising, and highly unappetizing source — fetal bovine serum (also known as FBS).\n\nWhat happens is as follows: if a cow in a slaughterhouse is pregnant, when she is slaughtered, the fetus is removed and brought into a blood collection facility. While still alive, the fetus is drained of its blood until it dies by a process of sticking a needle in its heart. It takes about five minutes, and this is what produces FBS, and ultimately, these so-called healthier burgers.\n\nEven though cows and bulls are kept separately, the percentage of dairy cows who are pregnant is between 17 and 31 percent. As a result the number of fetuses being slaughtered is in the millions.\n\nThe FBS from these slaughtered fetuses can then be used in the lab, grown in a petri dish into a meat-like substance by feeding the cells nutrients for about a month. Fetal bovine serum is the easiest to grow, because cells when separated from the body are suicidal. The FBS contains growth factors that prevent them from killing themselves.\n\nThis process is not the only way to make lab-grown meat, but it is the fastest way. It can be used on other types of meat cells as well, and may be added to a petri dish with chicken cells to create a similar product.\n\nreport this adAt the end of the day, this reliance on FBS means some animals are still being killed for lab-created meat; cultured meat is definitely not vegetarian as some may hope.\n\nThe ethical question of killing animals still remains: is slaughtering fetuses to make this highly unnatural product really any better than killing adult farm animals?\n\nThe controversial FBS is also used in creating vaccines for people, and it also comes with about a 1 in 40 billion chance of contracting mad cow disease. This low risk is much higher in cultured meat, which is why the Food and Drug Administration discouraged its use for the past 25 years (before wealthy investors like Gates and Branson decided to bring it to the forefront of the food industry, that is).\n\nIs Lab Grown Meat Really A Better Choice?\n\nWhat will the cultured meat companies do, and can Gates and Branson steer clear of the controversy that is sure to arise when people find out how these meats are actually made (much like genetically modified organisms from Monsanto)?\n\nEach company ends up hiding its true plans because their products have to be licensed, and there are plenty of proprietary issues that come into play. It seems that they are trying to avoid FBS, but there are no conclusions to be drawn yet.\n\nHampton Creek says they will try to create meat using plant-based products to make the cells grow using bioreactors or giant tanks, using a process that will look similar to beer brewing.\n\nUpside Foods said they have developed the first product without FBS, and are now working on applying it further.\n\nThey are now focusing on lab-grown chicken made from chicken cells, and have had Sir Richard Branson in to test their lab grown products.\n\nIt seems as if these companies are all about their image and reputation rather than being fully transparent with their processes, as shown by the vague nature of their new website.\n\nCultured meat companies are oftentimes mum about the processes they are using. There’s a strong chance these processes will end up using GMO yeast, at least according to a representative from the company Finless Fish as quoted by Gizmodo.\n\nThe environmental claims made by lab grown meat companies may not be what they seem, either. Hampton Creek for example says its lab-meat will be up to ten times more environmentally efficient than conventional meat, but the evidence is lacking.\n\nA 2011 study concluded that this type of meat product might produce less greenhouse gas, yet that it uses the same amount of energy as the pork industry. Another 2015 study estimated that it will require the same amount of energy as the conventional meat industry.\n\nDespite the controversies, It seems that many animal rights groups are supporting lab-grown meat.\n\nPeople for the Ethical Treatment of Animals (PETA) offered a one-million dollar prize to the first company who can produce a commercially successful cultured meat. However, the deadline of the contest has passed as commercial lab-grown meat is still in the works.\n\nIt seems that company gave up on inspiring everyone to cut out animal products and is willing to compromise.\n\nMercy for Animals also supports “meat that is produced through cellular agriculture instead of slaughter.”\n\nIt might not be much better for the environment after all.\n\nMeanwhile, the consumers are being fed an eerily-hypnotizing ads to hype up our expectations.\n\nAmerica’s biggest meat corporation is also jumping on the bandwagon:\n\nThe Future Is Here: Vegans Can Now Eat a Plant Burger That “Bleeds.” But There Is A Catch…\n\nYou Are Eating Fermented Mold — Popular Vegetarian Meat Company Settles False Advertising Lawsuit; Product Linked to Serious Health Risks\n\nThis article was first written in December 2017 and updated in June 2022.\n\nClick on this link if you’d like to order grass-fed, organic and pasture-raised beef and chicken from our friends at Wild Pastures.\n\nGet a special deal on your first box of grass-fed meat (no discount code needed), click here to place your order today, On Sale Now!\n\nThanks for installing the Bottom of every post plugin by Corey Salzano. Contact me if you need custom WordPress plugins or website design.", "opengraph": {"image": "https://althealthworks.com/wp-content/uploads/2019/04/COVID.png"}, "tags": ["lab grown burger 2017", "lab grown meat price", "lab grown meat ethics", "is lab grown meat vegetarian", "fetal bovine serum", "supermeat", "lab grown meat pros and cons", "lab grown beef", "lab grown meat", "When will lab grown meat be available", "fake meat", "lab grown meat cost", "in vitro meat controversy", "gmo meat", "is cultured meat safe", "Memphis meats", "lab meat companies", "why lab grown meat is bad", "is lab grown meat ethical", "mosameat", "lab grown meat vegan", "Hampton creek"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "500", "height": "281", "embed_code": "<iframe loading=\"lazy\" title=\"Meat from the Test Tube | Tomorrow Today\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/I7I2echB5uE?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/I7I2echB5uE?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "520", "height": "315", "embed_code": "<iframe loading=\"lazy\" src=\"https://www.youtube.com/embed/e7qr2sK9GIE\" width=\"520\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/e7qr2sK9GIE"}], "links": ["http://www.facebook.com/sharer.php?u=https%3A%2F%2Falthealthworks.com%2Fthe-truth-about-lab-grown-meat-author%2F&t=GMO%20Pusher%20Bill%20Gates%20Teams%20Up%20With%20Richard%20Branson%2C%20Hopes%20to%20End%20the%20Meat%20Industry%20As%20We%20Know%20It%20With%20Lab-Grown%20Beef", "http://twitter.com/share?text=GMO%20Pusher%20Bill%20Gates%20Teams%20Up%20With%20Richard%20Branson%2C%20Hopes%20to%20End%20the%20Meat%20Industry%20As%20We%20Know%20It%20With%20Lab-Grown%20Beef&url=https%3A%2F%2Falthealthworks.com%2Fthe-truth-about-lab-grown-meat-author%2F&via=AltHealthWorks.com", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Falthealthworks.com%2Fthe-truth-about-lab-grown-meat-author%2F&title=GMO%20Pusher%20Bill%20Gates%20Teams%20Up%20With%20Richard%20Branson%2C%20Hopes%20to%20End%20the%20Meat%20Industry%20As%20We%20Know%20It%20With%20Lab-Grown%20Beef", "#", "http://www.businessinsider.com/hampton-creek-ceo-complaints-2015-7", "http://mosameat.eu/", "https://www.indiegogo.com/projects/supermeat-real-meat-without-harming-animals-food-technology#/", "https://l.facebook.com/l.php?u=https%3A%2F%2Ftinyurl.com%2Fmrx9426f%3Ffbclid%3DIwAR284hsKsFqiQjvXokPr4Qz1RgeptOHnfpckkVyf5_E8QJYX3X3ExSSYQHc&h=AT2-qDbROl3WV-9gvQRO2P-ADwE7IkJn7GiPkxxCq5tuhX5QfQYsTh4qCOGf8CVRrOvnHXa8-rlwxK3j3NMo8UkvxAY4j2EsKtV7Q_1xgoybY33nJDJ1lQRi_j9QjEQl9MyNNfdJVf9nq77H&__tn__=R]-R&c[0]=AT1_Pp7jwZvlBjBrl6G1Ah5XYIv00MRJnV5Bc8BnT5wjdG2uYhk7umlt0w-F_oEFQaDPoaHoAjbhkLp6YJ20gfp-Hq4-9LM8fuwT4dMu7dmNgEp8Pr-QFsfTYQzRv9UTntwNzy-Xus6cocpMjViEweamvrV-Gmm8qbf2zev3Krz-n4LVIf5p41lVBlXcb7k_cFPJgwDkbVU8t1lQYn060n9kLP-sIg9V", "https://l.facebook.com/l.php?u=https%3A%2F%2Ftinyurl.com%2Fmrx9426f%3Ffbclid%3DIwAR284hsKsFqiQjvXokPr4Qz1RgeptOHnfpckkVyf5_E8QJYX3X3ExSSYQHc&h=AT2-qDbROl3WV-9gvQRO2P-ADwE7IkJn7GiPkxxCq5tuhX5QfQYsTh4qCOGf8CVRrOvnHXa8-rlwxK3j3NMo8UkvxAY4j2EsKtV7Q_1xgoybY33nJDJ1lQRi_j9QjEQl9MyNNfdJVf9nq77H&__tn__=R]-R&c[0]=AT1_Pp7jwZvlBjBrl6G1Ah5XYIv00MRJnV5Bc8BnT5wjdG2uYhk7umlt0w-F_oEFQaDPoaHoAjbhkLp6YJ20gfp-Hq4-9LM8fuwT4dMu7dmNgEp8Pr-QFsfTYQzRv9UTntwNzy-Xus6cocpMjViEweamvrV-Gmm8qbf2zev3Krz-n4LVIf5p41lVBlXcb7k_cFPJgwDkbVU8t1lQYn060n9kLP-sIg9V", "http://www.slate.com/articles/health_and_science/science/2017/07/why_is_fetal_cow_blood_used_to_grow_fake_meat.html", "http://www.piscltd.org.uk/fbs/", "https://www.ezoic.com/what-is-ezoic/", "https://upsidefoods.com/our-science/", "https://gizmodo.com/behind-the-hype-of-lab-grown-meat-1797383294", "http://www.sciencedirect.com/science/article/pii/S2095311914608911", "http://pubs.acs.org/doi/10.1021/acs.est.5b01614", "https://www.peta.org/blog/lab-meat-tastes-like-million-bucks/", "https://www.peta.org/blog/lab-meat-tastes-like-million-bucks/", "https://www.youtube.com/watch?time_continue=6&v=DgdFjy1DTjA", "https://althealthworks.com/12163/the-future-is-here-vegans-can-now-eat-a-plant-burger-that-bleeds-but-there-is-a-catch/", "https://althealthworks.com/9448/you-are-eating-mold-vegan-company-lies-to-the-consumers-new-lawsuit-alleges/", "https://l.facebook.com/l.php?u=https%3A%2F%2Ftinyurl.com%2Fmrx9426f%3Ffbclid%3DIwAR284hsKsFqiQjvXokPr4Qz1RgeptOHnfpckkVyf5_E8QJYX3X3ExSSYQHc&h=AT2-qDbROl3WV-9gvQRO2P-ADwE7IkJn7GiPkxxCq5tuhX5QfQYsTh4qCOGf8CVRrOvnHXa8-rlwxK3j3NMo8UkvxAY4j2EsKtV7Q_1xgoybY33nJDJ1lQRi_j9QjEQl9MyNNfdJVf9nq77H&__tn__=R]-R&c[0]=AT1_Pp7jwZvlBjBrl6G1Ah5XYIv00MRJnV5Bc8BnT5wjdG2uYhk7umlt0w-F_oEFQaDPoaHoAjbhkLp6YJ20gfp-Hq4-9LM8fuwT4dMu7dmNgEp8Pr-QFsfTYQzRv9UTntwNzy-Xus6cocpMjViEweamvrV-Gmm8qbf2zev3Krz-n4LVIf5p41lVBlXcb7k_cFPJgwDkbVU8t1lQYn060n9kLP-sIg9V", "https://l.facebook.com/l.php?u=https%3A%2F%2Ftinyurl.com%2Fmrx9426f%3Ffbclid%3DIwAR284hsKsFqiQjvXokPr4Qz1RgeptOHnfpckkVyf5_E8QJYX3X3ExSSYQHc&h=AT2-qDbROl3WV-9gvQRO2P-ADwE7IkJn7GiPkxxCq5tuhX5QfQYsTh4qCOGf8CVRrOvnHXa8-rlwxK3j3NMo8UkvxAY4j2EsKtV7Q_1xgoybY33nJDJ1lQRi_j9QjEQl9MyNNfdJVf9nq77H&__tn__=R]-R&c[0]=AT1_Pp7jwZvlBjBrl6G1Ah5XYIv00MRJnV5Bc8BnT5wjdG2uYhk7umlt0w-F_oEFQaDPoaHoAjbhkLp6YJ20gfp-Hq4-9LM8fuwT4dMu7dmNgEp8Pr-QFsfTYQzRv9UTntwNzy-Xus6cocpMjViEweamvrV-Gmm8qbf2zev3Krz-n4LVIf5p41lVBlXcb7k_cFPJgwDkbVU8t1lQYn060n9kLP-sIg9V", "http://wordpress.org/extend/plugins/bottom-of-every-post/", "http://www.tacticaltechnique.com/wordpress/"], "authors": ["AltHealth Admin"], "publish_date": null}