{"result_id": "020020", "URL": "https://althealthworks.com/breaking-news-the-name-monsanto-is-officially-history-after-117-years-of-poisoning-people-around-the-globe/", "timestamp": "2023-04-25 11:59:25 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://althealthworks.com/wp-content/uploads/2015/07/favicon-32x321.png", "canonical": "https://althealthworks.com/breaking-news-the-name-monsanto-is-officially-history-after-117-years-of-poisoning-people-around-the-globe/", "encoding": "UTF-8"}, "image": null, "domain": "althealthworks.com", "title": "BREAKING NEWS: The Name Monsanto is Officially History After 117 Years", "cleaned_text": "For over 117 years, the Monsanto Company has unleashed practically every form of poison known to mankind on virtually ever corner of the globe.\n\nBut now, it looks as though the Monsanto name is officially on its way out, following an announcement from its prospective new parent company Bayer that will put an end to one of the most tarnished names in the history of American business.\n\nThanks to the help of millions of Marchers, alternative news publications, and even a select few mainstream reporters who actually had the guts to report on Monsanto’s misdeeds over the years, the oft-voted “Most Evil Company in the World” is officially no more.\n\nBut, as you may have guessed, the fight is far from over.\n\nBayer Set to Officially Kill Monsanto Name for PR Purposes\n\nAccording to various mainstream newspaper reports, Bayer is pushing to officially complete its $63 million merger (some have also reported $66 million) with Monsanto by June 7, and all Monsanto products will now officially be brought under the umbrella of the German pharmaceutical, GMO and pesticide giant.\n\nAfter years and millions of people protesting against it, the Monsanto Company appears to be no more.\n\n“Bayer will remain the company name. Monsanto will no longer be a company name. The acquired products will retain their brand names and become part of the Bayer portfolio,” a prepared statement by Bayer read.\n\nMonsanto India is expected to remain, even though that division is facing many struggles of its own including losing the ability to patent seeds recently.\n\nThe new merger is expected to create a resurgent Bayer company that will now control over a quarter of the world’s seeds and pesticides market, believe it or not. Despite that, neither U.S. or European regulators thought it was necessary to deem the merger a monopoly.\n\nBauer will now create an agricultural supplies company with sales of about 20 billion euros based on 2017 figures, which compares to 12.4 billion euros of Dow DuPont’s Corteva Agriscience unit, 11 billion euros for ChemChina’s Syngenta, and 7.9 for BASF, completing a new cycle of mega-mergers that will continue to push GMOs and chemicals on unsuspecting consumers at rates never before seen.\n\nBayer seems hell-bent on continuing down the same path as Monsanto, therefore, it is now time to start our March Against Bayer.\n\n“We aim to deepen our dialogue with society. We will listen to our critics and work together where we find common ground. Agriculture is too important to allow ideological differences to bring progress to a standstill,” Bayer Chief Executive Werner Baumann said in the statement according to CNBC.\n\nIn other words, expect more GMOs and toxic pesticides from the former Nazi war machine collaborating company.\n\nBayer Also has a GMO Division (and an Equally Dark History)\n\nWhile it comes as welcome news that Monsanto appears to be officially gone, a whole new fight has now begun.\n\nBayer is just as dangerous as Monsanto with an equally dark history (learn more here), and as noted in the quote above they look poised to carry on Monsanto’s mission, which will include the production of the “probable human carcinogen” Roundup that is being found in our air, water, foods and even childhood vaccines.\n\nThe next step is to continue to raise awareness so that we can mobilize to support organics and help defeat the new Bayer machine the same way we did with Monsanto.\n\nFor starters, it is vitally important to note that Bayer’s GMO division is called CropScience — this is the “New Monsanto” we must expose for the world to see.\n\nAnd as usual it will be the farmers, consumers, and yes, the protesters on the front lines of this “fight for our lives.”\n\nWe hope you will continue to show us your support because we need it now more than ever.\n\nAnd thank you for all that you have done in helping to put an unofficial end to the company responsible for countless deaths and untold sickness worldwide.\n\nThis article was shared with permission via March Against Monsanto. For more articles like these in your inbox, click on this link.\n\nThanks for installing the Bottom of every post plugin by Corey Salzano. Contact me if you need custom WordPress plugins or website design.", "opengraph": {"image": "https://althealthworks.com/wp-content/uploads/2018/06/Dr.-Rath-health.jpg"}, "tags": ["monsanto changes name", "end of monsanto", "the end of the monsanto corporation", "RIP monsanto", "the end of the monsanto company", "the end of monsanto"], "tweets": [], "movies": [], "links": ["http://www.facebook.com/sharer.php?u=https%3A%2F%2Falthealthworks.com%2Fbreaking-news-the-name-monsanto-is-officially-history-after-117-years-of-poisoning-people-around-the-globe%2F&t=BREAKING%20NEWS%3A%20The%20Name%20Monsanto%20is%20Officially%20History%20After%20117%20Years", "http://twitter.com/share?text=BREAKING%20NEWS%3A%20The%20Name%20Monsanto%20is%20Officially%20History%20After%20117%20Years&url=https%3A%2F%2Falthealthworks.com%2Fbreaking-news-the-name-monsanto-is-officially-history-after-117-years-of-poisoning-people-around-the-globe%2F&via=AltHealthWorks.com", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Falthealthworks.com%2Fbreaking-news-the-name-monsanto-is-officially-history-after-117-years-of-poisoning-people-around-the-globe%2F&title=BREAKING%20NEWS%3A%20The%20Name%20Monsanto%20is%20Officially%20History%20After%20117%20Years", "#", "https://www.march-against-monsanto.com/monsanto-stripped-of-its-ability-to-patent-gmo-pesticide-producing-cotton-seeds-in-india/", "https://www.cnbc.com/2018/06/04/with-deal-to-close-this-week-bayer-to-retire-monsanto-name.html", "https://www.march-against-monsanto.com/eight-reasons-why-any-human-being-with-a-conscience-should-boycott-monsanto-and-bayer/", "https://www.ezoic.com/what-is-ezoic/", "https://www.dr-rath-foundation.org/2018/03/european-regulators-approve-bayers-purchase-of-gmo-pesticide-goliath-monsanto/", "https://www.march-against-monsanto.com/breaking-news-the-name-monsanto-is-officially-history-after-117-years-of-poisoning-people-around-the-globe/", "https://www.althealthworks.com/ebook-submit", "http://wordpress.org/extend/plugins/bottom-of-every-post/", "http://www.tacticaltechnique.com/wordpress/"], "authors": ["Nick Meyer"], "publish_date": null}