{"result_id": "020039", "URL": "https://althealthworks.com/a-public-health-disaster-merck-drug-that-killed-38000-people-may-be-back-on-the-market-soon/", "timestamp": "2023-04-25 11:59:33 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://althealthworks.com/wp-content/uploads/2015/07/favicon-32x321.png", "canonical": "https://althealthworks.com/a-public-health-disaster-merck-drug-that-killed-38000-people-may-be-back-on-the-market-soon/", "encoding": "UTF-8"}, "image": null, "domain": "althealthworks.com", "title": "Warning: Deadly Arthritis Drug That Killed Thousands Could Be Back on the Market Again Soon", "cleaned_text": "It is not uncommon for a pharmaceutical company to create a drug with side effects far out-weighing the potential benefits. After a number of patients get hurt, the company gets sued and is forced to pay damages (while still pocketing a large sum of money) and to remove the product from the market. Some cases do more damage than the others.\n\nThe arthritis, anti-inflammatory drug Vioxx by Merck was one of the cases that shook the medical field, raising a lot of questions about drug safety, exposing drug makers’ lies, and highlighting the FDA’s failure to protect consumers.\n\nBefore Vioxx got pulled from the market in 2004, it wreaked havoc on the health of many and killed an estimated 38,000 people.\n\nSome sources say that the numbers are much higher and up to 140,000 people experienced heart attacks, and as many as 44% of them died.\n\nAccording to a 2019 article by statnews.com, its maker Merck was forced to pay up as part of a nearly $5 billion settlement related to the drug.\n\nAnd now, 14 years later, a different company is trying to bring this risky drug back on the market. While some support this move, others are concerned that history may repeat itself.\n\nVioxx was approved by the FDA in May 1999 after Merck presented nine studies with 5,400 subjects to showcase its medical usage a year prior. From first glance the drug seemed promising to this community with fewer side effects than its competitor drugs (though gastrointestinal bleeding sometimes still happened).\n\nWhat the health panel discussing the drug did not foresee is that this pharmaceutical came with another side effect, and this one killed patients. It was soon evident that Vioxx may cause serious heart problems leading to deaths. This was first discovered in November 1999, just six months after the drug’s approval.\n\nWhat happened next was years of Merck purposefully trying to buy more time. They promised to study cardiovascular problems concerning the drug, but the results were not submitted until a year after. The submitted information only discussing about 17 out of 20 cases of heart attacks that they said they had available. Moreover, Merck failed to disclose other adverse cardiovascular events that they knew about.\n\nMerck finally removed Vioxx from the market after numerous independent studies came out between 2002 and 2004 outlining the cardiovascular issues. Yet, the drug was removed too late. Between 1999 and 2004, about 20 million people have were prescribed this pharmaceutical.\n\nDuring these years, it caused an estimated 88,000 heart attacks and 38,000 deaths. Research shows that people who have taken the drug remain having risks of heart problems long after they stop taking it.\n\nMerck later faced 13,000 lawsuits and paid $3.85 billion in damages, yet the pharmaceutical company never admitted fault.\n\nThe drug caused so much damage that its successor Arcoxia was rejected from the market by an almost unanimous vote, 20-1 against the drug’s approval.\n\nRemembering Vioxx as such a disaster, why risk getting it re-approved?\n\nIf past history is any indication, Vioxx is a highly risky drug in any shape or form to say the least. Besides heart issues, it has been associated with:\n\nDespite all of these risks, a startup company called Tremeau Pharmaceuticals is working on bringing Vioxx back. Their reasoning is that it may be beneficial for patients of hemophilia, a bleeding disorder that cause severe pain and has few treatment options.\n\nHowever, here is what Dr. Sidney Wolfe, director of the Health Research Group at Public Citizen, had to say about Vioxx and similar drugs and their risky potential uses:\n\nWhile patients not seeing other options may choose to rely on this risky drug, another issue with Vioxx’s re-approval is that doctors may then prescribe it for off-label uses, even if the company itself will not be legally able to advertise it for these uses.\n\nOff-label prescription is common in the medical field, and with these drug in particular, it is no wonder that many are concerned for patients’ safety.\n\nIn 2009, a Merck representative blew the whistle about the drug and the system:\n\nKaplan who also appeared on a reality show Survivor did not censor her feelings toward the drug:\n\nIf drug representatives know it is dangerous, what hope is there for the drug to not kill more people if it is approved again?\n\nMany patents, doctors, and researchers conclude that the hope is minuscule.\n\nThe Dangerous Truth About Flu Meds That’s Being Hidden From You (NOT a vaccine!)\n\nThe Deadliest Over-the-Counter Drug Is Still in Your Medicine Cabinet\n\nOhio Sues Big Pharma for One of the Biggest Health Epidemics of Our Time\n\nThis article was first written in January 2018 and updated in February 2020.\n\nThanks for installing the Bottom of every post plugin by Corey Salzano. Contact me if you need custom WordPress plugins or website design.", "opengraph": {"image": "https://althealthworks.com/wp-content/uploads/2018/01/Vioxx-2.png"}, "tags": ["fda fail", "vioxx story", "Merck sales rep", "merck vioxx case summary", "merck and vioxx ethical issues", "merck lies", "vioxx recall", "vioxx scandal", "vioxx deaths", "vioxx", "dangerous drugs", "most dangerous drug is coming back", "drug deaths", "recalled drug", "most dangerous painkiller", "vioxx is coming back", "most dangerous drug", "merck", "is vioxx still available", "Merck drug", "dangerous painkiller", "Merck drug recalled"], "tweets": [], "movies": [], "links": ["http://www.facebook.com/sharer.php?u=https%3A%2F%2Falthealthworks.com%2Fa-public-health-disaster-merck-drug-that-killed-38000-people-may-be-back-on-the-market-soon%2F&t=Warning%3A%20Deadly%20Arthritis%20Drug%20That%20Killed%20Thousands%20Could%20Be%20Back%20on%20the%20Market%20Again%20Soon", "http://twitter.com/share?text=Warning%3A%20Deadly%20Arthritis%20Drug%20That%20Killed%20Thousands%20Could%20Be%20Back%20on%20the%20Market%20Again%20Soon&url=https%3A%2F%2Falthealthworks.com%2Fa-public-health-disaster-merck-drug-that-killed-38000-people-may-be-back-on-the-market-soon%2F&via=AltHealthWorks.com", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Falthealthworks.com%2Fa-public-health-disaster-merck-drug-that-killed-38000-people-may-be-back-on-the-market-soon%2F&title=Warning%3A%20Deadly%20Arthritis%20Drug%20That%20Killed%20Thousands%20Could%20Be%20Back%20on%20the%20Market%20Again%20Soon", "#", "https://www.npr.org/templates/story/story.php?storyId=5470430", "https://www.statnews.com/2019/10/09/vioxx-relaunched-treat-hemophilia-rare-disease/", "https://www.npr.org/templates/story/story.php?storyId=5470430", "https://www.npr.org/templates/story/story.php?storyId=5039151", "https://www.npr.org/templates/story/story.php?storyId=5470430", "http://www.nytimes.com/2004/11/14/business/despite-warnings-drug-giant-took-long-path-to-vioxx-recall.html", "http://abcnews.go.com/Health/Healthday/story?id=4506740&page=1", "brokenbrain.ontraport.com/t?orid=27581&opid=1", "https://www.rxlist.com/vioxx-side-effects-drug-center.htm", "https://www.cbsnews.com/news/merck-rep-who-was-on-survivor-said-of-vioxx-i-knew-damn-well-it-was-dangerous/", "http://industry.bnet.com/pharma/10001791/new-merck-allegations-a-fake-journal-ghostwritten-studies-vioxx-pop-songs-pr-execs-harass-reporters/", "https://althealthworks.com/13911/common-flu-medication-is-a-dangerous-and-deadly-scam-caused-deaths-suicides-and-over-1800-psychiatric-episodes/", "https://althealthworks.com/10447/how-did-this-happen-too-many-people-are-dying-from-tylenol-when-there-are-natural-alternatives/", "https://althealthworks.com/13085/ohio-sues-big-pharma-for-one-of-the-biggest-health-epidemics-of-our-time-calls-out-drug-makers-on-purposefully-misleading-doctors-and-downplaying-the-drugs-dangers/", "http://wordpress.org/extend/plugins/bottom-of-every-post/", "http://www.tacticaltechnique.com/wordpress/"], "authors": ["AltHealth Admin"], "publish_date": null}