{"result_id": "020007", "URL": "https://althealthworks.com/doctor-sells-his-practice-in-new-york-buys-organic-farm-begins-treating-patients-himself/", "timestamp": "2023-04-25 11:59:20 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://althealthworks.com/wp-content/uploads/2015/07/favicon-32x321.png", "canonical": "https://althealthworks.com/doctor-sells-his-practice-in-new-york-buys-organic-farm-begins-treating-patients-himself/", "encoding": "UTF-8"}, "image": null, "domain": "althealthworks.com", "title": "Doctor Sells His Practice in New York, Buys Organic Farm & Begins Treating Patients Himself", "cleaned_text": "Deaths from correctly taken prescription drugs number above 100,000 every year, which is just one of the main reasons why the popularity of natural medicine has surged lately.\n\nBut even as Americans’ attitudes about medicine have begun to change and realign with the classic Hippocrates mantra of “First, Do No Harm…” our doctors haven’t quite gotten the message.\n\nThe classic “pills, surgery and vaccines” method that most doctors utilize first and foremost hasn’t changed a whole lot, but some individual doctors have adjusted and begun putting more stock in natural methods again.\n\nOne particular doctor on the east coast has done the previously unthinkable: he’s spending less time in his New York office and more time reconnecting with the roots of what it means to be healthy.\n\nDr. Ronald Weiss has spent over 25 years taking care of Hudson County residents according to this article from the website NJ.com, but now he’s exploring a whole new way to them become, and stay, healthy: a full-fledged “farmacy” built on the power of plant-based “food as medicine” rather than drugs or surgery.\n\nWeiss has officially started the state of New Jersey’s first farm-based medical practice 55 miles away from his New York office, where owns a 348-acre, 18th century-style farm in Long Valley.\n\n“Plant-based whole foods are the most powerful disease-modifying tools available to practitioners — more powerful than any drugs or surgeries.” he told NJ.com.\n\nWeiss was quick to point out that you can’t fix a broken ankle or other physical ailments by simply using plant tinctures, but he did say in the article that the correct plant-based medicine can fix, treat, prevent and even cure the most menacing modern diseases, even cancer.\n\nIn order to make the leap, Weiss sold his practice, although he still sees patients three days a week there, in order to buy his farm.\n\nHe also launched Ethos Health, a community-supported agriculture product focusing on regenerative agriculture, a system that helps nourish the soil and builds it up to the point where it retains considerably more water and nutrients.\n\n“Human health is directly related to the health of the environment, the production of food and how it is grown,” said Weiss to NJ.com. “I see this farm as an opportunity for me to take all the biology and chemistry of plants I have studied, and link them to the human biological system.”\n\nHis peers haven’t always been on board with his ideas, he added, but Ronald remains convinced that he’s doing the right thing. The revolutionary Ethos Primary Care now holds open houses, potlucks, and Farm Days Festivals to feed the community and educate people on the importance of farm-to-table based healthcare.\n\nAnd as always, the proof ultimately lies in the impact he’s had on his patients, like Angie Rotella-Suarez, whose mother’s life was essentially saved by Weiss’ food recommendations of a plant-based diet comprised of organic grains (including sweet potatoes), steamed vegetables, fruit (especially lots of blueberries), and water.\n\nSuarez prepared the meals for her mother and after just 2 weeks she stopped taking her blood pressure medication, left her wheelchair (and 40 pounds) behind, and began doing chores around the house every day again, regaining her energy and sense of purpose in life.\n\nDespite not receiving the full support of his peers for changing his philosophy, his patients feel differently.\n\nWeiss is the “the best of what the medical profession has to offer,” Suarez said, and after he what he did for her mother, it’s no wonder why she would feel that way.\n\nThanks for reading! To learn more about the practical benefits and solutions offered by regenerative farming, check out the book ‘Farming on the Wild Side.’ You can also learn more about my favorite regenerative farming based meal service, Nutrition for Longevity, here.", "opengraph": {"image": "https://althealthworks.com/wp-content/uploads/2015/09/Ronald-Weiss-1.png"}, "tags": ["doctor organic ethos farm", "doctor organic farming", "doctor creates organic farm", "doctor owned organic farm", "robert weiss dr. organic farm", "doctor ethos health organic", "doctor goes organic"], "tweets": [], "movies": [], "links": ["http://www.facebook.com/sharer.php?u=https%3A%2F%2Falthealthworks.com%2Fdoctor-sells-his-practice-in-new-york-buys-organic-farm-begins-treating-patients-himself%2F&t=Doctor%20Sells%20His%20Practice%20in%20New%20York%2C%20Buys%20Organic%20Farm%20%26%20Begins%20Treating%20Patients%20Himself", "http://twitter.com/share?text=Doctor%20Sells%20His%20Practice%20in%20New%20York%2C%20Buys%20Organic%20Farm%20%26%20Begins%20Treating%20Patients%20Himself&url=https%3A%2F%2Falthealthworks.com%2Fdoctor-sells-his-practice-in-new-york-buys-organic-farm-begins-treating-patients-himself%2F&via=AltHealthWorks.com", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Falthealthworks.com%2Fdoctor-sells-his-practice-in-new-york-buys-organic-farm-begins-treating-patients-himself%2F&title=Doctor%20Sells%20His%20Practice%20in%20New%20York%2C%20Buys%20Organic%20Farm%20%26%20Begins%20Treating%20Patients%20Himself", "#", "https://althealthworks.com/wp-content/uploads/2015/01/weiss.jpg", "http://www.nj.com/politics/index.ssf/2014/08/hudson_county_physician_open_farm-based_practice_in_long_valley.html", "http://www.nj.com/politics/index.ssf/2014/08/hudson_county_physician_open_farm-based_practice_in_long_valley.html", "https://www.myethoshealth.com/", "https://amzn.to/3cSvjWR", "https://tinyurl.com/ybpntp78", "https://tinyurl.com/ybpntp78", "https://www.ezoic.com/what-is-ezoic/"], "authors": ["Nick Meyer"], "publish_date": null}