{"result_id": "021024", "URL": "https://www.altleft.news/2020-10-23-hunter-biden-also-did-business-with-kazakhstan.html", "timestamp": "2023-04-25 11:59:50 CEST+0200", "meta": {"description": "Corruption apparently runs deep in the Biden family, as yet another bombshell is now circulating headlines concerning Hunter Biden’s alleged dealings in Kazakhstan. In addition to running deals under the cover of his father in both China and the Ukraine, Hunter also kept busy in Kazakhstan being the go-between to Kenes Rakishev, a Kazakh oligarch […]", "lang": "en", "keywords": "Alexandra Forbes Kerry,corruption,emails,hunter,Hunter Biden,John Kerry,Kazakhstan,Kenes Rakishev,laptop,lies,Nursultan Nazarbayev,pay to play", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.altleft.news/2020-10-23-hunter-biden-also-did-business-with-kazakhstan.html", "encoding": "UTF-8"}, "image": null, "domain": "www.altleft.news", "title": "Hunter Biden also did business with Kazakhstan", "cleaned_text": "Hunter Biden also did business with Kazakhstan\n\nCorruption apparently runs deep in the Biden family, as yet another bombshell is now circulating headlines concerning Hunter Biden’s alleged dealings in Kazakhstan.\n\nIn addition to running deals under the cover of his father in both China and the Ukraine, Hunter also kept busy in Kazakhstan being the go-between to Kenes Rakishev, a Kazakh oligarch with close ties to the country’s longtime kleptocratic leader Nursultan Nazarbayev, reports indicate.\n\nEmails allegedly obtained from “anti-corruption campaigners” suggest that Hunter first made contact with Rakishev in an attempt to facilitate a parking spot for cash that he wanted to invest. Hunter was able to engineer a $1 million investment from Rakishev to filmmaker Alexandra Forbes Kerry, for instance, the daughter of ex-Sen. and failed presidential candidate John Kerry.\n\nThere were not many more deals to be had, however, as the origins of Rakishev’s wealth are questionable, to say the least. International Finance Corp, a respected investment company, actually pulled out of a deal with Rakishev due to “liabilities” stemming from his connections to the country’s rulers.\n\nThis did not keep Hunter from maintaining a chummy relationship with Rakishev, which also included Joe, as evidenced by a photo showing the three that was obtained from the “Kazakhstani Initiative on Asset Recovery.”\n\n“I’m on vacation with family [at] Lake Michigan … trying to spend some much needed time with my wife and daughter,” a leaked personal email sent by Hunter to Rakishev back in 2013 reads. “It’s my 20th anniversary of marriage tomorrow.”\n\nMore related news about Biden family corruption can be found at Corruption.news.\n\nPhoto evidence proves Joe Biden spoke to his son about overseas business dealings\n\nIn one photograph, published at this link, Joe and Hunter Biden are seen standing next to Rakishev and former Kazakhstan Prime Minister Karim Massimov.\n\nThe undated photo serves as evidence that Hunter was regularly meeting and dining with Rakishev as part of his overseas investment deals. The fact that Joe is also pictured in the photo further proves that the Democrat presidential candidate lied to the American people when he claimed that he has “never spoken to my son about his overseas business dealings.”\n\nWhile the photo has not been independently verified, it appears to be legitimate and comes at a time when the Biden family, just a few weeks before the election, is finding itself in quite the quagmire.\n\nThis could explain why Joe called a lid early this week and has not appeared since. Hunter is likewise nowhere to be found, even as the Biden campaign struggles to come up with an excuse for these latest revelations.\n\nWhile early on denying that Joe had met with Hunter’s Ukrainian business partners simply because no scheduled meetings appeared on Joe’s official schedule at the time, the Biden campaign is now admitting that it cannot rule out that a meeting may have happened.\n\nOther emails that have since surfaced from the infamous abandoned laptop also show that Hunter used his father’s influence while vice president within the Obama administration to boost his pay on the board of the Ukrainian energy company Burisma, where he was already raking in some $50,000 per month in salary.\n\n“It sounds like Joe likens himself as the Godfather,” wrote one commenter at The Sun. “He got a piece of every child’s action as they got rich off of name and introductions – and probably lots of influence where it was needed.\n\n“Fredo, I mean Hunter went on a crack addled trip to the computer repair place and then when he woke up, he forgot. WE HAVE NO DOUBT IT ALL HAPPENED, while the MSM will work to hide it. This is a BIDEN disinformation campaign.”", "opengraph": {"title": "Hunter Biden also did business with Kazakhstan", "type": "article", "url": "https://www.altleft.news/2020-10-23-hunter-biden-also-did-business-with-kazakhstan.html", "site_name": "Alt-Left News", "description": "Corruption apparently runs deep in the Biden family, as yet another bombshell is now circulating headlines concerning Hunter Biden’s alleged dealings in Kazakhstan. In addition to running deals under the cover of his father in both China and the Ukraine, Hunter also kept busy in Kazakhstan being the go-between to Kenes Rakishev, a Kazakh oligarch […]", "image": "https://www.altleft.news/wp-content/uploads/sites/352/2020/10/Hunter-Biden-Joe-Biden-Barack-Obama.jpg"}, "tags": ["John Kerry", "Kazakhstan", "emails", "Kenes Rakishev", "Hunter Biden", "corruption", "laptop", "Nursultan Nazarbayev", "pay to play", "lies", "Alexandra Forbes Kerry", "hunter"], "tweets": [], "movies": [], "links": ["https://nypost.com/2020/10/17/hunter-biden-reportedly-also-had-business-ties-in-kazakhstan/", "https://www.naturalnews.com/2020-10-15-joe-biden-lied-about-meeting-with-hunters-ukrainian-business-partners.html", "http://corruption.news", "https://nypost.com/2020/10/20/photo-biden-meets-hunters-alleged-partner-from-kazakhstan/", "https://www.the-sun.com/news/1663620/hunter-joe-biden-kazakhstan-oligarch-meeting-ukraine-business/", "https://nypost.com/2020/10/17/hunter-biden-reportedly-also-had-business-ties-in-kazakhstan/", "https://www.naturalnews.com/2020-10-15-joe-biden-lied-about-meeting-with-hunters-ukrainian-business-partners.html", "https://nypost.com/2020/10/20/photo-biden-meets-hunters-alleged-partner-from-kazakhstan/", "https://www.the-sun.com/news/1663620/hunter-joe-biden-kazakhstan-oligarch-meeting-ukraine-business/"], "authors": [], "publish_date": null}