{"result_id": "021032", "URL": "https://altleft.news/2022-08-18-minneapolis-teachers-union-white-educators-fired-first.html", "timestamp": "2023-04-25 11:59:56 CEST+0200", "meta": {"description": "In the event that the Minneapolis Public School (MPS) system needs to lay off a teacher or administrator due to cutbacks, the first employees to go will be those with “white” skin. A new contract between the Minneapolis Federation of Teachers union and MPS stipulates that even if a white teacher has been there longer […]", "lang": "en", "keywords": "anti-white,campus insanity,culture wars,discrimination,identity politics,layoffs,left cult,Minneapolis,Minneapolis Federation of Teachers,Minneapolis Public Schools,past discriminations,political correctness,race relations,race wars,racism,Teachers,union,woke", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://altleft.news/2022-08-18-minneapolis-teachers-union-white-educators-fired-first.html", "encoding": "UTF-8"}, "image": null, "domain": "altleft.news", "title": "Minneapolis teachers’ union negotiates clause requiring “white” educators to be laid off first as reparations for “past discriminations”", "cleaned_text": "Minneapolis teachers’ union negotiates clause requiring “white” educators to be laid off first as reparations for “past discriminations”\n\nIn the event that the Minneapolis Public School (MPS) system needs to lay off a teacher or administrator due to cutbacks, the first employees to go will be those with “white” skin.\n\nA new contract between the Minneapolis Federation of Teachers union and MPS stipulates that even if a white teacher has been there longer than a non-white teacher and has seniority, he or she will be let go first in order to give preferential treatment to non-white employees who may have faced “past discriminations.”\n\nStrikingly unconstitutional and flat-out racist, the new protocol was spearheaded by Greta Callahan, a white-looking woman who says she loves yoga, sriracha, and “black lives,” as shown in her “Teachers 4 Black Lives” Twitter banner.\n\n“If excessing a teacher who is a member of a population underrepresented among licensed teachers in the site, the district shall excess the next least senior teacher, who is not a member of an underrepresented population,” the new deal reads.\n\nThis same anti-white protocol may also apply to the rehiring of teachers following layoffs, meaning white teachers who used to work in the system will be passed over in favor of non-white teachers. (Related: The American Psychoanalytic Association has said that “whiteness” is a “parasitic-like condition”.)\n\nOne lawsuit and it’s all over for Callahan and her white-hating friends\n\nIt turns out that Callahan is buddies with Ilhan Omar, Rashida Tlaib, Cori Bush, and Ayanna Pressley, all white-hating women on the left who have a history of anti-white racism.\n\nCallahan seems to get a kick out of her own self-hatred and is committed to imposing new policies within MPS that openly discriminate against people with white skin.\n\nThe good news is that all it will take to put an immediate end to this new protocol is for someone – or better yet, everyone – to sue Callahan, her union and MPS for violating the “race-based layoff provision” of the Civil Rights Act.\n\n“When it comes to termination, an employer can’t racially discriminate even against whites,” says constitutional lawyer Hans Bader. “The Third Circuit Court of Appeals ruled in 1996 that a school district can’t consider race even as a tie-breaker, in deciding who to lay off, even to promote diversity.”\n\nOn Facebook, Republican representative to the Minnesota House of Representatives Jeremy Munson added that Callahan’s efforts are “racist,” and that such provisions “have no place in our society.”\n\n“Sounds like discrimination lawsuits are on the horizon,” responded one of Munson’s followers.\n\nUntil a lawsuit, or series of lawsuits, tears down this new provision, it will make Minneapolis the only city in the country to engage in what its promoters call “seniority-disrupting.”\n\nThey are proud, in other words, to be openly discriminating against white people because they believe this to be “virtuous.”\n\n“This is the inevitable endpoint of ‘equity,'” says public school reform activist Christopher Rufo.\n\nIn an appearance with Sean Hannity of Fox News, contributors Leo Terrell and Clay Travis both called the new provisions “racist” and “discriminatory,” not to mention “illegal.”\n\n“They said they want students to have teachers that look like them. Wrong,” said Terrell, a civil rights attorney with black skin. “The students need teachers who will educate them. Educate. Not what they look like!”\n\nTravis, a sports writer, agreed. He says Democrats continue to badger America with the false message that everyone who is white is evil, and that America will be an awful place until “whiteness” is dismantled.\n\n“That is basically everything that the Democrats believe, and if you drill down essentially every policy that they advocate for, that’s what it is at its essence,” he added.\n\nThe latest news about the anti-white agenda of those controlling media and education can be found at RaceWar.news.", "opengraph": {"title": "Minneapolis teachers’ union negotiates clause requiring “white” educators to be laid off first as reparations for “past discriminations”", "type": "article", "url": "https://www.altleft.news/2022-08-18-minneapolis-teachers-union-white-educators-fired-first.html", "site_name": "Alt-Left News", "description": "In the event that the Minneapolis Public School (MPS) system needs to lay off a teacher or administrator due to cutbacks, the first employees to go will be those with “white” skin. A new contract between the Minneapolis Federation of Teachers union and MPS stipulates that even if a white teacher has been there longer […]", "image": "https://www.altleft.news/wp-content/uploads/sites/352/2022/08/Racism-Race-Chalkboard-Writing.jpg"}, "tags": ["racism", "woke", "past discriminations", "layoffs", "campus insanity", "Minneapolis Public Schools", "Minneapolis Federation of Teachers", "discrimination", "culture wars", "anti-white", "political correctness", "Teachers", "union", "race wars", "race relations", "identity politics", "Minneapolis", "left cult"], "tweets": [], "movies": [], "links": ["https://12ft.io/proxy?q=https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-11114637%2FFury-Minneapolis-teachers-union-says-WHITE-teachers-laid-regardless-seniority.html", "https://twitter.com/greta_callahan", "https://naturalnews.com/2021-06-13-american-psychoanalytic-association-promotes-anti-white-racism.html", "http://racewar.news", "https://12ft.io/proxy?q=https%3A%2F%2Fwww.dailymail.co.uk%2Fnews%2Farticle-11114637%2FFury-Minneapolis-teachers-union-says-WHITE-teachers-laid-regardless-seniority.html", "https://naturalnews.com/2021-06-13-american-psychoanalytic-association-promotes-anti-white-racism.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Faltleftnews%2F2022-08-18-minneapolis-teachers-union-white-educators-fired-first.html&linkname=Minneapolis%20teachers%E2%80%99%20union%20negotiates%20clause%20requiring%20%E2%80%9Cwhite%E2%80%9D%20educators%20to%20be%20laid%20off%20first%20as%20reparations%20for%20%E2%80%9Cpast%20discriminations%E2%80%9D", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}