{"result_id": "021006", "URL": "https://altleft.news/2022-09-07-la-judge-declares-mistrial-sleepless-robbery-suspect.html", "timestamp": "2023-04-25 11:59:39 CEST+0200", "meta": {"description": "A California judge, who is linked to a family that endorsed Los Angeles County District Attorney George Gascon in the past election, granted a mistrial for a robbery suspect because the defendant was sleepy in court and couldn’t take proper notes. Daniel Lowenthal, a judge of the Los Angeles County Superior Court and the scion of […]", "lang": "en", "keywords": "absurd,big government,California,Collapse,crime,culture wars,Daniel Lowenthal,insanity,left cult,Libtards,politics,social justice,soft on crime,stupid,woke judge,woke policies,wokies", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://altleft.news/2022-09-07-la-judge-declares-mistrial-sleepless-robbery-suspect.html", "encoding": "UTF-8"}, "image": null, "domain": "altleft.news", "title": "Woke LA judge declares MISTRIAL for robbery suspect who did not get comfy sleep in jail", "cleaned_text": "Woke LA judge declares MISTRIAL for robbery suspect who did not get comfy sleep in jail\n\nA California judge, who is linked to a family that endorsed Los Angeles County District Attorney George Gascon in the past election, granted a mistrial for a robbery suspect because the defendant was sleepy in court and couldn’t take proper notes.\n\nDaniel Lowenthal, a judge of the Los Angeles County Superior Court and the scion of a powerful Democratic family, said a mistrial is given because the alleged criminal apparently did not get a good night’s rest before the trial after spending the night in a prison cell without a bed or blanket.\n\nThe suspect Vamazae Elgin Banks, 24, appeared in court for reportedly pointing a gun at the head of a McDonald’s cashier and threatening to kill her if she did not hand over cash quickly enough.\n\n“Hurry up or I’ll blow your brains out,” he allegedly told the victim. He ran off with less than $100 from the fast-food chain on East 4th Street in Long Beach. (Related: Flash mob of looters ransack a convenience store in Los Angeles.)\n\nBank’s lawyer Alan Nakasone argued before the judge that his client could not focus properly due to inadequate housing the night before. Despite the suspect having two prior violent robbery convictions, Lowenthal quickly declared a mistrial.\n\nThe alleged robber faces up to life in prison if convicted on three counts of robbery and one account of assault with a semi-automatic firearm for the crime under California’s three-strikes sentencing laws.\n\nThe judge deferred answering when Deputy District Attorney (DDA) Tricia Halstead pushed back on Nakasone’s argument in court. Instead, he directed the question to the defense.\n\n“My client was nodding,” the defense lawyer reiterated and with that, Lowenthal made his ruling.\n\n“Essentially this Court has lost complete confidence in the Sheriff Department’s ability to provide proper housing arrangements. A mistrial is declared,” Lowenthal said.\n\nThe “woke” judge’s father, Alan, who was first elected to Congress in 2012, endorsed Gascon, the county’s controversial “soft-on-crime prosecutor” who narrowly survived a recall bid this month. Lowenthal’s brother, Josh, is running for a state Assembly seat, while his mother, Bonnie, was a member of the California Assembly from 2008 to 2012.\n\nOut of the ordinary ruling of a “woke” judge\n\nLegal experts called the mistrial out of the ordinary.\n\n“In my 27 years of experience, I have not seen a mistrial declared because a defendant who was in the trial was deprived of the ability to sleep,” Anthony Falangetti, who worked as a Los Angeles County prosecutor for 14 years, told Fox News.\n\nThe prosecution team led by Halstead pointed out that the afternoon session lasted less than an hour and consisted of an investigating officer describing her training and the playing of surveillance footage without audio.\n\n“I don’t believe that a lack of note-taking during a number of surveillance videos, that simply showed the defendant walking to McDonald’s which is an uncontested action, is enough to result in there being prejudice to him and to his potential defense,” she argued.\n\nShe added that a mistrial was not only extreme but premature given that the judge had not probed if Banks’ jailhouse behavior had contributed in any way to the bedding denials.\n\nThe DDA also stated that after Lowenthal declared a mistrial, the decision would compel the victims to relive their trauma once again at a new proceeding.\n\n“All three victims showed emotion during their testimony. It was put on the record that it was difficult for them to watch this evidence,” Halstead said. “It’s just incredibly unfair of the court to punish the people and specifically the victims in this case, based on a lack of sleep, when we do not have more information.”\n\nBanks is due back in court for a new trial on September 13.\n\nVisit Wokies.news for more stories about woke people like Judge Daniel Lowenthal.\n\nWatch the below video that talks about how an armed customer protected a gas station clerk’s life against a robbery suspect.\n\nThis video is from the zolnareport.com channel on Brighteon.com.\n\nLos Angeles boutique bans mask-wearers on its premises to prevent crime.\n\nLos Angeles police tell robbery victims to “cooperate and comply” with thieves.\n\nFlash mob robberies set to explode across America as mass money printing drives the poor into desperation.\n\nHundreds of looters RANSACK a Walmart in Tampa, Florida and make off with merchandise worth over $100,000.", "opengraph": {"title": "Woke LA judge declares MISTRIAL for robbery suspect who did not get comfy sleep in jail", "type": "article", "url": "https://www.altleft.news/2022-09-07-la-judge-declares-mistrial-sleepless-robbery-suspect.html", "site_name": "Alt-Left News", "description": "A California judge, who is linked to a family that endorsed Los Angeles County District Attorney George Gascon in the past election, granted a mistrial for a robbery suspect because the defendant was sleepy in court and couldn’t take proper notes. Daniel Lowenthal, a judge of the Los Angeles County Superior Court and the scion of […]", "image": "https://www.altleft.news/wp-content/uploads/sites/352/2022/09/Judge-Gavel-Ruling-Court.jpg"}, "tags": ["insanity", "big government", "politics", "Libtards", "culture wars", "woke judge", "wokies", "social justice", "absurd", "California", "crime", "stupid", "Collapse", "Daniel Lowenthal", "woke policies", "soft on crime", "left cult"], "tweets": [], "movies": [], "links": ["https://www.dailymail.co.uk/news/article-11185143/Woke-LA-judge-declares-MISTRIAL-robbery-suspect-suspect-slept-poorly-previous-night.html", "https://naturalnews.com/2022-08-22-flash-mob-looters-ransack-la-convenience-store.html", "http://insanity.news", "https://nypost.com/2022/09/06/california-judge-daniel-lowenthal-declares-mistrial-for-sleepy-suspect/", "https://wokies.news/", "https://www.brighteon.com/494ed199-519d-49c8-a2ec-36b3f2d60e23", "https://www.brighteon.com/channels/zolareportcom", "https://naturalnews.com/2022-08-30-boutique-bans-mask-wearers-to-prevent-crime.html", "https://wokies.news/2021-11-17-la-police-tell-robbery-victims-cooperate-comply.html", "https://collapse.news/2021-11-26-flash-mob-robberies-america-money-printing-desperation.html", "https://naturalnews.com/2020-06-13-hundreds-of-looters-ransack-walmart-tampa-florida.html", "https://www.dailymail.co.uk/news/article-11185143/Woke-LA-judge-declares-MISTRIAL-robbery-suspect-suspect-slept-poorly-previous-night.html", "https://nypost.com/2022/09/06/california-judge-daniel-lowenthal-declares-mistrial-for-sleepy-suspect/", "https://www.brighteon.com/494ed199-519d-49c8-a2ec-36b3f2d60e23", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Faltleftnews%2F2022-09-07-la-judge-declares-mistrial-sleepless-robbery-suspect.html&linkname=Woke%20LA%20judge%20declares%20MISTRIAL%20for%20robbery%20suspect%20who%20did%20not%20get%20comfy%20sleep%20in%20jail", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}