{"result_id": "021005", "URL": "https://altleft.news/2023-03-23-top-10-ways-americans-faked-into-losing-health-money-minds.html", "timestamp": "2023-04-25 11:59:39 CEST+0200", "meta": {"description": "All natural health advocates know better than to eat fast food, like McDonald’s, Burger King, and the like. That’s just common sense, because nearly every ingredient in every junk science “food stuff” bite is a fast track to health decimation. Yet, there are new foods that are deemed “healthy” or “sustainable” that really are NOT, […]", "lang": "en", "keywords": "badfood,chaos,Climate,conspiracy,deception,digital currency,Fact Check,fake borders,fake climate change,fake election,fake food,fake money,fake president,faked,false-flag,freedom,hoax,insanity,invasionusa,Liberty,lies,money supply,propaganda,risk,science deception,spike protein injections,truth", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://altleft.news/2023-03-23-top-10-ways-americans-faked-into-losing-health-money-minds.html", "encoding": "UTF-8"}, "image": null, "domain": "altleft.news", "title": "Top 10 most insidious ways Americans are FAKED into losing their health, money, minds, and lives", "cleaned_text": "Top 10 most insidious ways Americans are FAKED into losing their health, money, minds, and lives\n\nAll natural health advocates know better than to eat fast food, like McDonald’s, Burger King, and the like. That’s just common sense, because nearly every ingredient in every junk science “food stuff” bite is a fast track to health decimation. Yet, there are new foods that are deemed “healthy” or “sustainable” that really are NOT, even though the corporations that make them claim they are, just as they did with margarine, canola oil, and conventional dairy.\n\nFake meat and fake eggs are now being concocted in laboratories and marketed to healthy people, who often fall for the bait, hook-line-and-sinker, at least for a little while. Better known as “zombie eggs,” Bill Gates and Peter Thiel (Paypal) fund this biotech food mutation for zombie vegans who just want to pretend they’re still eating eggs, and for other consumers who still don’t know that “you are what you eat.” Then there’s GMO-Franken-test-tube-meat, that jiggles like raw cow, and bleeds like a stuck pig, tastes like fast food chicken, but comes from mutated cells and is grown in a dirty beaker in a lab.\n\nHere are the top 10 ways Americans are conned and fooled into sacrificing their health, money, minds, and lives on a daily basis\n\n#2. Fake Money – insolvent banks influence more crypto (digital money) that can be shut off by the Feds in an instant\n\n#4. Fake Medicine (deadly snake venom peptides used for hundreds of prescription medications – no wonder the side effects are so health-decimating)\n\n#8. Fake President (fake ballots, faked votes using Dominion Machines, and a senile man who’s just a POTUS puppet)\n\nDigital currency is like a digital clock, it can be “unplugged” by the powers that be and worthless in an instant\n\nInvesting or converting your cash or liquid savings to digital “crypto” money can be riskier than investing in the stock market right before a recession or great depression, like right now. At least the dollar takes a while to shrink and shrivel, while crypto currency can be undermined, devalued, and bankrupted virtually overnight (pun intended). That’s just it. It’s “virtual money.” You can’t touch it. You can’t put it in a safety deposit box or under your mattress.\n\nRecently, legislatures in 23 states deliberated bills that would introduce CENTRAL BANK digital currencies (CBDCs) into their jurisdictions. The Democrats want this badly, and are trying to legalize it in ten other states where they have control over the legislature, including California, Colorado, Hawaii, Maine, Massachusetts, Nevada, New Mexico, Rhode Island and Washington, plus of course, Washington DC.\n\nThis conversion would allow DC Democrats to cut off money from all conservatives and Republicans who own guns, land, and small-to-medium sized businesses literally overnight, during some “emergency” takeover needed to fund a fake war or fake pandemic, like we’re all experiencing right now.\n\nClimate change is fake. There’s no global warming happening, and that’s why the narrative and Ponzi scheme specialists had to change the name of it. Droughts, hurricanes, tornadoes and tsunamis happen naturally, but now every single one of them is labeled “climate change” by mainstream media and the globalists who want complete control of the populace.\n\nThe Covid “vaccines” are FAKE. They do not prevent the contraction of Fauci Flu, or the transmission of Wuhan virus, and they certainly don’t prevent DEATH from the Made-in-China spike-protein-syndrome, also known as gain of function coronavirus.\n\nTune into Cryptocult.news for updates on real money turning into digital lute where the government can shut off the valve and devalue it all overnight.", "opengraph": {"title": "Top 10 most insidious ways Americans are FAKED into losing their health, money, minds, and lives", "type": "article", "url": "https://www.altleft.news/2023-03-23-top-10-ways-americans-faked-into-losing-health-money-minds.html", "site_name": "Alt-Left News", "description": "All natural health advocates know better than to eat fast food, like McDonald’s, Burger King, and the like. That’s just common sense, because nearly every ingredient in every junk science “food stuff” bite is a fast track to health decimation. Yet, there are new foods that are deemed “healthy” or “sustainable” that really are NOT, […]", "image": "https://www.altleft.news/wp-content/uploads/sites/352/2023/03/Fake-Background-Badge-Eps-Grunge-Grungy-Insignia.jpg"}, "tags": ["insanity", "digital currency", "science deception", "fake president", "fake borders", "risk", "Climate", "Fact Check", "truth", "fake election", "money supply", "faked", "invasionusa", "propaganda", "Liberty", "chaos", "lies", "spike protein injections", "fake climate change", "freedom", "fake money", "fake food", "deception", "conspiracy", "hoax", "false-flag"], "tweets": [], "movies": [], "links": ["https://naturalnews.com/042997_Bill_Gates_zombie_eggs_vegan_foods.html", "https://www.theguardian.com/animals-farmed/2018/feb/21/dirty-meat-shocking-hygiene-failings-discovered-in-us-pig-and-chicken-plants", "https://naturalnews.com/042997_Bill_Gates_zombie_eggs_vegan_foods.html", "https://naturalnews.com/2019-03-21-impossible-burger-is-just-that-because-its-gmo.html", "https://www.naturalnews.com/2023-03-17-state-legislatures-paving-way-for-cbdc-domination.html", "https://www.naturalnews.com/2023-03-17-state-legislatures-paving-way-for-cbdc-domination.html", "https://naturalnews.com/2022-04-13-venomtech-company-announces-massive-library-of-snake-venom-peptides-for-pharmaceutical-deployment.html", "https://foreignpolicy.com/2022/11/16/ukraine-weapons-military-aid-stockpiles-nato-low-industry/", "https://www.naturalnews.com/2022-11-16-dr-tenpenny-warns-death-tsunami-covid-vaccines.html", "https://cryptocult.news/", "https://www.naturalnews.com/2023-03-17-state-legislatures-paving-way-for-cbdc-domination.html", "https://foreignpolicy.com/2022/11/16/ukraine-weapons-military-aid-stockpiles-nato-low-industry/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Faltleftnews%2F2023-03-23-top-10-ways-americans-faked-into-losing-health-money-minds.html&linkname=Top%2010%20most%20insidious%20ways%20Americans%20are%20FAKED%20into%20losing%20their%20health%2C%20money%2C%20minds%2C%20and%20lives", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}