{"result_id": "021017", "URL": "https://altleft.news/2022-06-19-sen-cotton-demands-resignation-of-ag-garland.html", "timestamp": "2023-04-25 11:59:46 CEST+0200", "meta": {"description": "Senator Cotton has demanded the resignation of far-left Attorney General Merrick Garland for his refusal to investigate the domestic terrorism group “Jane’s Revenge” (Article by Jesse Martin republished from 100PercentFedUp.com) 23 pro-life pregnancy centers and institutions have been firebombed or otherwise attacked in the past couple weeks, bringing the total to 50 pro-life institutions, pregnancy […]", "lang": "en", "keywords": "abortion,AG Garland,current events,justice,left cult,politics,pro-life,radicals,Senator Cotton,terrorism,violence", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://altleft.news/2022-06-19-sen-cotton-demands-resignation-of-ag-garland.html", "encoding": "UTF-8"}, "image": null, "domain": "altleft.news", "title": "Sen Cotton demands resignation of radical two-tiered Justice AG Garland for ignoring 50+ stunning attacks on pro-life groups", "cleaned_text": "Sen Cotton demands resignation of radical two-tiered Justice AG Garland for ignoring 50+ stunning attacks on pro-life groups\n\nSenator Cotton has demanded the resignation of far-left Attorney General Merrick Garland for his refusal to investigate the domestic terrorism group “Jane’s Revenge”\n\n23 pro-life pregnancy centers and institutions have been firebombed or otherwise attacked in the past couple weeks, bringing the total to 50 pro-life institutions, pregnancy centers, and churches having been attacked, vandalized, or firebombed since the onset of the radical left’s pro-abortion stormtroopers “Jane’s Revenge.” Additionally, another group called “Ruth Sent Us” doxxed the conservative Supreme Court Justices right after the leaked Roe v Wade decision, with no consequences.\n\nThe two groups have claimed responsibility for the massive volume of attacks against pro-life organizations and businesses. The Biden Administration’s Department of Justice and Attorney General Merrick Garland have not so much as even investigated this, let alone make arrests. This is not even to mention the threats against Justice Amy Coney Barrett’s children, or the attempted murder of Justice Kavanaugh.\n\nThe radical left’s pro-abortion elements have been committing textbook acts of terrorism, without the designation or investigation into them. Consequently, Senator Tom Cotton has demanded the resignation of complicit Attorney General Merrick Garland.\n\nSen. Cotton wrote the following letter to AG Garland\n\n“Houses of worship and pro-life pregnancy centers are under attack. The Family Research Council has compiled a list of more than 50 attacks against churches, pro-life pregnancy centers, and other pro-life groups in the past few weeks,” Cotton wrote to Garland in a letter. “A left-wing extremist group called ‘Jane’s Revenge’ has taken credit for many of these attacks, including firebombings and grotesque acts of vandalism.” he also noted that “Jane’s Revenge” “has now issued a letter declaring ‘open season’ on all so-called ‘anti-choice’ groups, and calls for terrorist attacks against these groups by anyone ‘with the urge to paint, to burn, to cut, [or] to jam.” “What is the Department of Justice doing to protect Americans from these violent attacks? At a minimum, you should bring federal charges against the perpetrators, where appropriate, and investigate ‘Jane’s Revenge’ as a domestic terrorist organization, Cotton wrote. “If you are unwilling to protect Americans from these attacks, you should resign-although, in my opinion, you should resign in any case,”\n\nMany of these attacks have been claimed by Jane’s Revenge, and many have gone without arrests. Often, the attacks contain grotesque messages such as “forced birth is murder” “Jane was here” and “if abortions aren’t safe then you aren’t either.”\n\nGarland has done nothing about this thus far.\n\nMeanwhile, the DOJ has its hands full with the kangaroo courts and phony arrests associated with the January 6th Capitol events, arresting anyone and everyone they can without evidence of crime or due process. Some of the arrests have been on high-profile patriots on social media, or even running for office as in the case of Michigan Gubernatorial candidate Ryan Kelley, whose home was raided by the FBI last week and who has received a massive polling boost after his arrest.\n\nIndeed, they would rather prosecute patriots unjustly and focus on the January 6th hearings than go after actual terrorists who are attacking and threatening the Supreme Court, churches, and any pro-life institution they can find.\n\nThe hysterical and deranged radical left has been terrorizing the country for years and continues to become more brazen, because they know that the Biden Administration is on their side.\n\nGarland’s refusal to address the situation, and his role in the wrongful arrests of peaceful protestors during January 6th’s events both make him unfit to be Attorney General.", "opengraph": {"title": "Sen Cotton demands resignation of radical two-tiered Justice AG Garland for ignoring 50+ stunning attacks on pro-life groups", "type": "article", "url": "https://www.altleft.news/2022-06-19-sen-cotton-demands-resignation-of-ag-garland.html", "site_name": "Alt-Left News", "description": "Senator Cotton has demanded the resignation of far-left Attorney General Merrick Garland for his refusal to investigate the domestic terrorism group “Jane’s Revenge” (Article by Jesse Martin republished from 100PercentFedUp.com) 23 pro-life pregnancy centers and institutions have been firebombed or otherwise attacked in the past couple weeks, bringing the total to 50 pro-life institutions, pregnancy […]", "image": "https://www.altleft.news/wp-content/uploads/sites/352/2022/06/Justice-Gavel-1.jpg"}, "tags": ["radicals", "Senator Cotton", "AG Garland", "abortion", "politics", "pro-life", "justice", "violence", "terrorism", "current events", "left cult"], "tweets": [], "movies": [], "links": ["https://100percentfedup.com/sen-cotton-demands-resignation-of-radical-two-tiered-justice-ag-garland-for-ignoring-50-stunning-attacks-on-pro-life-groups/", "https://100percentfedup.com/list-of-23-pro-life-centers-attacked-by-terrorists-while-msm-refuses-to-cover-violent-crimes/", "https://100percentfedup.com/pro-abortion-radicals-target-amy-coney-barretts-seven-children-while-democrats-remain-silent-on-threats/", "https://100percentfedup.com/breaking-man-who-threatened-to-kill-justice-kavanaugh-arrested-near-his-md-home-with-gun-and-knife/", "https://www.foxnews.com/politics/cotton-garland-resign-doj-inaction-janes-revenge-50-attacks-pro-life-groups", "https://100percentfedup.com/backfired-fbi-arrest-of-mi-gov-candidate-ryan-kelley-gives-him-a-big-boost-in-polls/", "https://100percentfedup.com/sen-cotton-demands-resignation-of-radical-two-tiered-justice-ag-garland-for-ignoring-50-stunning-attacks-on-pro-life-groups/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Faltleftnews%2F2022-06-19-sen-cotton-demands-resignation-of-ag-garland.html&linkname=Sen%20Cotton%20demands%20resignation%20of%20radical%20two-tiered%20Justice%20AG%20Garland%20for%20ignoring%2050%2B%20stunning%20attacks%20on%20pro-life%20groups", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}