{"result_id": "021004", "URL": "https://altleft.news/2022-08-01-fda-gender-affirming-pharmaceuticals-cause-children-blind.html", "timestamp": "2023-04-25 11:59:38 CEST+0200", "meta": {"description": "Handing out gender-benders like candy to children who want to go “trans” may not be the best idea, according to the U.S. Food and Drug Administration (FDA), which just put out a warning about how puberty-blocking drugs can cause blindness in kids. The new label applies to gonadotropin-releasing hormone (GnRH) agonists, which in children are […]", "lang": "en", "keywords": "badhealth,badmedicine,Big Pharma,blindness,children's health,Dangerous Medicine,eye health,FDA,gender affirming,gender confused,left cult,LGBT,medical violence,pharmaceutical fraud,puberty blockers,transgender,transhumanism,truth", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://altleft.news/2022-08-01-fda-gender-affirming-pharmaceuticals-cause-children-blind.html", "encoding": "UTF-8"}, "image": null, "domain": "altleft.news", "title": "FDA: “Gender-affirming” pharmaceuticals can cause children to go BLIND", "cleaned_text": "FDA: “Gender-affirming” pharmaceuticals can cause children to go BLIND\n\nHanding out gender-benders like candy to children who want to go “trans” may not be the best idea, according to the U.S. Food and Drug Administration (FDA), which just put out a warning about how puberty-blocking drugs can cause blindness in kids.\n\nThe new label applies to gonadotropin-releasing hormone (GnRH) agonists, which in children are linked to severe headaches, pressure buildup around the brain, and vision alteration or loss. (Related: At least one drag queen believes that children should automatically receive puberty blockers from birth until they can “consent” to puberty.)\n\nChildren who take GnRH agonists in order to become their “true selves” risk developing pseudotumor cerebri, also known as idiopathic intracranial hypertension. It involves fluid building up around the brain and spinal cord for no apparent reason, causing high pressure that can damage the brain and the nerve in the back of the eye, known as the optic nerve.\n\n“The new warning includes recommendations to monitor patients taking GnRH agonists for signs and symptoms of pseudotumor cerebri, including headache, papilledema, blurred or loss of vision, diplopia, pain behind the eye or pain with eye movement, tinnitus, dizziness and nausea,” reads an FDA announcement.\n\nGnRH agonists are only approved by the FDA to treat central precocious puberty, a condition in which children experience premature puberty. For girls, this is before the age of eight, and for boys before the age of nine.\n\nIn today’s ultra-perverted era of transgender mutilation, a growing number of normal children without this condition are being prescribed GnRH as a way to become “trans” since the drugs stop the body’s production of estrogen and progesterone.\n\nGnRH agonists can also be used to treat other conditions such as endometriosis, uterine fibroids, and infertility – but they were never approved as a way to corral children into the Cult of LGBT.\n\nAny such use of these drugs for trans purposes represents off-label use, which is questionable at best and, in some cases, illegal. Children under the age of 18 can take them with parental consent, but the FDA does not officially approve the drugs for this use.\n\nSo far, the FDA has identified six cases of GnRH agonist-induced pseudotumor cerebri in children who were taking the drugs to become trans. These cases were identified using a risk assessment that included looking through the FDA’s Adverse Event Reporting System.\n\n“Six cases were identified that supported a plausible association between GnRH agonist use and pseudotumor cerebri,” the FDA announced. “All six cases were reported in birth-assigned females ages 5 to 12 years.”\n\n“Five were undergoing treatment for central precocious puberty and one for transgender care. The onset of pseudotumor cerebri symptoms ranged from three to 240 days after GnRH agonist initiation.”\n\nOf the six cases identified, five of them involve visual disturbances, headaches and vomiting. Another three involve papilledema, also known as swelling of the optic nerve, while one also involves blood pressure increase and damage to the nerve responsible for eye movement.\n\nThe use of GnRH agonist drugs was “discontinued in three patients,” we now know. And in at least one of the cases, the child’s symptoms have yet to show any signs of resolving.\n\n“The incidence rate of pseudotumor cerebri associated with GnRH agonist use in pediatric patients could not be reliably established due to the small number of cases and data limitations,” the FDA added, presumably as a disclaimer meant to dissuade LGBTs who might feel “offended” by these latest scientific revelations.\n\nThe latest news about transgenderism and the plan to destroy children and their innocence can be found at Transhumanism.news.", "opengraph": {"title": "FDA: “Gender-affirming” pharmaceuticals can cause children to go BLIND", "type": "article", "url": "https://www.altleft.news/2022-08-01-fda-gender-affirming-pharmaceuticals-cause-children-blind.html", "site_name": "Alt-Left News", "description": "Handing out gender-benders like candy to children who want to go “trans” may not be the best idea, according to the U.S. Food and Drug Administration (FDA), which just put out a warning about how puberty-blocking drugs can cause blindness in kids. The new label applies to gonadotropin-releasing hormone (GnRH) agonists, which in children are […]", "image": "https://www.altleft.news/wp-content/uploads/sites/352/2022/08/transgender-children.jpg"}, "tags": ["blindness", "LGBT", "gender affirming", "medical violence", "puberty blockers", "FDA", "Big Pharma", "eye health", "transhumanism", "truth", "transgender", "pharmaceutical fraud", "children's health", "gender confused", "left cult"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/fda-warns-puberty-blockers-may-cause-vision-loss-in-children_4621822.html", "https://naturalnews.com/2020-12-17-mental-trans-activist-children-puberty-blockers-consent.html", "http://transhumanism.news", "https://www.theepochtimes.com/fda-warns-puberty-blockers-may-cause-vision-loss-in-children_4621822.html", "https://naturalnews.com/2020-12-17-mental-trans-activist-children-puberty-blockers-consent.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Faltleftnews%2F2022-08-01-fda-gender-affirming-pharmaceuticals-cause-children-blind.html&linkname=FDA%3A%20%E2%80%9CGender-affirming%E2%80%9D%20pharmaceuticals%20can%20cause%20children%20to%20go%20BLIND", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}