{"result_id": "021031", "URL": "https://altleft.news/2022-07-29-school-choice-becoming-law-of-the-land-republicans-should-jump-aboard.html", "timestamp": "2023-04-25 11:59:55 CEST+0200", "meta": {"description": "Recently elected Virginia Governor Glenn Youngkin is a prime example of how parents have major influence over elections, especially when they want a strong voice in their children’s education and choice of schools for them to attend. School choice is at the forefront right now in districts across the nation, and politicians should take heed […]", "lang": "en", "keywords": "brainwashed,campus insanity,cancel Democrats,Collapse,conspiracy,Crybullies,deception,education,education system,elections,gay mafia,gender confusion,groomers,homeschool,indoctrination,left cult,liberals,Parental rights,politics school,public education,race wars,school choice,school politics,Vote Republican,voting,woke", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://altleft.news/2022-07-29-school-choice-becoming-law-of-the-land-republicans-should-jump-aboard.html", "encoding": "UTF-8"}, "image": null, "domain": "altleft.news", "title": "School choice quickly becoming the “law of the land” ­– Republicans should jump aboard and follow Virginia Governor Youngkin’s lead", "cleaned_text": "School choice quickly becoming the “law of the land” ­– Republicans should jump aboard and follow Virginia Governor Youngkin’s lead\n\nRecently elected Virginia Governor Glenn Youngkin is a prime example of how parents have major influence over elections, especially when they want a strong voice in their children’s education and choice of schools for them to attend. School choice is at the forefront right now in districts across the nation, and politicians should take heed or surely lose their positions come midterms. These parental concerns cross party lines, and any political candidates who refuse to advocate for school choice and parental rights will more than likely face defeat come November.\n\nSupporting school choice and parental voice is politically advantageous across America right now\n\nThe primaries are already trending this summer towards politicians who support parental voice and school choice. Three-fourths of the candidates in this arena who advocate for these issues have advanced in run-offs or won their primaries already. Republican candidates are enjoying sweeping victories over Democrats and Liberals who want to force-feed children perverted agendas (trans-everything and drag queen story hours), social justice “reform,” and anti-White CRT (Critical Race Theory).\n\nThese liberal agendas are quickly becoming a liability for candidates who outwardly support them, and if more Republicans focus on these pressing and timely concerns, they will eventually become nonpartisan issues (because the Democrats will lose in landslide form due to it). It’s a political winner across the board for Republicans, so people running for offices at all levels should keep the subject matter in the forefront of their campaigns.\n\nSchool choice is the ability to use funds to send your kid(s) to whatever school fits their needs best\n\nA recent poll of 2,000 registered voters (RealClear Opinion Research) revealed that nearly 3/4ths of all polled support school choice. Less than 20 percent opposed it. That is a major trump card (pun intended) for Republican advantage when it comes to winning parent votes. We’ve seen recent victories for Republicans in Arizona and Virginia thanks to school choice stances, despite teacher’s unions and dogmatic Democratic opposition.\n\nIn fact, Arizona’s Governor, Doug Ducey, just signed HB 2853 into law, guaranteeing parents of kids K-12, statewide, a voice in allocating funds where the parents feel the money is best suited for their children’s needs, and/or aligns with their family’s values.\n\nDemocrats want to destroy the American nuclear family with perverted agendas AT SCHOOL where trans-teachers perform strip teases at the kid’s talent show, and special cross-dressing, gender-fluid guests dance in thongs and read story time books to daycare kids and kindergartners. It’s a sick, twisted, communist agenda and its antithesis is school choice and parental voice from conservatives (and normal people with ethics).\n\nNo more de-funding schools that don’t succumb to perverted coercion and put litter boxes in the bathrooms for kids that identify as cats. It’s insane. School funds should be used for education, not supporting sex-crazed-gender-switching and cross-dresser drag shows performing under the guise of read-aloud “story time.”\n\nOne of the main goals of Democrats in this country is to have the children believe that the majority of Americans are racists, bigots and white supremacists, and it’s simply not true. Kids want everything to be fair and just and accepting, so they’re falling for all the fake news and fake trends and fake race wars staged on the news and all over social media. This plays right into the hands of the perverts who exploit these politicized leanings, and make children think they must become gender-fluid, conservative-hating freaks themselves in order to “fit in.”\n\nThis is why Democrat run school systems are imploding, turning quickly into grooming centers where administrators, teachers and school union members influence their perverted agendas right into the curriculum, activities and school rules. They would have us believe this is the new norm. Yet, at the polls, there’s a different story. The Demon Dems are losing, losing fast and losing big. Parents are standing up for human rights, education rights, ethics, morals and decency, and thank God for it.\n\nTune that internet dial to Gender.news for updates on sex-crazed Senators trying to make drag shows mandatory for school kids in California and other Demoncrat-run states.", "opengraph": {"title": "School choice quickly becoming the “law of the land” ­– Republicans should jump aboard and follow Virginia Governor Youngkin’s lead", "type": "article", "url": "https://www.altleft.news/2022-07-29-school-choice-becoming-law-of-the-land-republicans-should-jump-aboard.html", "site_name": "Alt-Left News", "description": "Recently elected Virginia Governor Glenn Youngkin is a prime example of how parents have major influence over elections, especially when they want a strong voice in their children’s education and choice of schools for them to attend. School choice is at the forefront right now in districts across the nation, and politicians should take heed […]", "image": "https://www.altleft.news/wp-content/uploads/sites/352/2022/07/Teenagers-School-Bus.jpg"}, "tags": ["cancel Democrats", "homeschool", "elections", "campus insanity", "public education", "Vote Republican", "gender confusion", "education system", "indoctrination", "gay mafia", "Parental rights", "Collapse", "school politics", "left cult", "woke", "liberals", "deception", "race wars", "politics school", "brainwashed", "Crybullies", "school choice", "conspiracy", "voting", "groomers", "education"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/parents-across-the-board-support-school-choice-politicians-should-take-heed-education-policy-expert_4612917.html", "https://naturalnews.com/2022-05-16-lgbt-indoctrination-causing-teen-patients-identify-trans.html", "https://www.gender.news/2022-06-12-california-senator-wants-mandatory-drag-shows-kids.html", "https://www.theepochtimes.com/parents-across-the-board-support-school-choice-politicians-should-take-heed-education-policy-expert_4612917.html", "https://naturalnews.com/2022-05-16-lgbt-indoctrination-causing-teen-patients-identify-trans.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Faltleftnews%2F2022-07-29-school-choice-becoming-law-of-the-land-republicans-should-jump-aboard.html&linkname=School%20choice%20quickly%20becoming%20the%20%E2%80%9Claw%20of%20the%20land%E2%80%9D%20%C2%AD%E2%80%93%20Republicans%20should%20jump%20aboard%20and%20follow%20Virginia%20Governor%20Youngkin%E2%80%99s%20lead", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}