{"result_id": "021026", "URL": "https://altleft.news/2022-05-15-abortion-activists-reveal-evil-nature-threats-vandalism.html", "timestamp": "2023-04-25 11:59:52 CEST+0200", "meta": {"description": "Abortion activists reveal their evil nature by means of threats against Supreme Court justices and vandalism on churches, according to an op-ed. Pro-life activist Jonathon Von Maren noted this observation in a May 11 piece for LifeSiteNews. His observation comes amid the leak of a draft opinion penned by Justice Samuel Alito which, if adopted […]", "lang": "en", "keywords": "abortion,Alt-Left,civil unrest,conservative justices,culture wars,destruction,domestic terrorism,evil,firebombing,graffiti,infanticide,insanity,left cult,Leftists,Liberal Mob,private property,protests,radical left,riots,Roe v. Wade,scotus,Twisted,violence,Wisconsin Family Action,wokies", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://altleft.news/2022-05-15-abortion-activists-reveal-evil-nature-threats-vandalism.html", "encoding": "UTF-8"}, "image": null, "domain": "altleft.news", "title": "Op-ed: Abortion activists reveal their EVIL nature through threats and vandalism", "cleaned_text": "Op-ed: Abortion activists reveal their EVIL nature through threats and vandalism\n\nAbortion activists reveal their evil nature by means of threats against Supreme Court justices and vandalism on churches, according to an op-ed.\n\nPro-life activist Jonathon Von Maren noted this observation in a May 11 piece for LifeSiteNews. His observation comes amid the leak of a draft opinion penned by Justice Samuel Alito which, if adopted by four other justices, can overturn the 1973 Roe v. Wade decision on abortion.\n\n“We do not yet know if Roe v. Wade is alive or dead. But what we do know … is how supporters of the Sexual Revolution’s bloody sacrament will respond. Abortion activists are going to war for the right to kill, and the mask has slipped,” he wrote.\n\nVon Maren cited one protest that occurred at a Los Angeles church on May 8, Mother’s Day. Several abortion activists staged a protest at the Our Lady of Angels cathedral in downtown L.A. before security escorted them out. The Mass continued after the activists were hauled outside the church, reported FOX 11.\n\nParishioner Sal Vermiglio said the protesters blended in with other members of the congregation, even sitting in the front. However, they put on red robes from the series “The Handmaid’s Tale” and interrupted the Mass.\n\n“Right when [the priest was] to bless the Eucharist, I saw a couple of [women] get up and put on the red robes. They took their garbs out their backpacks. There were people in the congregation that weren’t having it because they were interrupting the Mass,” Vermiglio told the news outlet.\n\nThe day before, abortion activists gathered outside the homes of at least two conservative justices of the high court. The homes of Chief Justice John Roberts and Justice Brett Kavanaugh, both located in the state of Maryland, were swarmed by protesters on the evening of May 7. (Related: Pro-abortion leftists DOX and TARGET conservative SCOTUS justices following leak of draft opinion overturning Roe v. Wade.)\n\nAbout 100 demonstrators chanting slogans and holding signs first gathered at Kavanaugh’s house before walking to the chief justice’s home nearby. The protesters then returned to Kavanaugh’s residence, where law enforcement ordered the group to disperse.\n\nAbortion activists take things up a notch by destroying property\n\nVon Maren also mentioned that churches and other buildings became the target of attacks by deranged leftists who oppose the potential overturn of Roe v. Wade. Churches in the states of Washington, Colorado and Texas were vandalized – with pro-abortion graffiti sprayed across their doors.\n\nThe office of Wisconsin Family Action (WFA) in Madison, Wisconsin was also fire-bombed apart from being vandalized. According to the Daily Citizen, unknown assailants broke into the WFA office during the early hours of May 8 and threw at least two Molotov cocktails inside. While the office inside was damaged by the resulting fire, no injuries were reported.\n\nAside from fire-bombing the office, the attackers also scrawled “If abortion isn’t safe, then you aren’t either” on the outside wall. Other graffiti spray-painted on the wall included the anarchist symbol – the letter A inside a circle – and the number 1312, which stood for ACAB or “all cops are bastards.”\n\n“While this attack was directly provoked by the leaked draft opinion from the Supreme Court, this has (a) far broader implication,” said WFA President Julaine Appling. “Apparently, the tolerance that the Left demands is truly a one-way street. Violence has become their answer to everything. This is what happens when leadership is missing … or implies that violence is OK.”\n\nRadical pro-abortion group Jane’s Revenge took responsibility for the attack on WFA’s Madison office, warning that more attacks are soon to come. “Wisconsin is the first flashpoint, but we are all over the U.S., and we will issue no further warnings. Your repression only strengthens our resolve,” the group said.\n\nVon Maren concluded his piece by saying: “That is the vile face of pro-abortion America. The pro-life movement is arrayed against a truly evil ideology, and we should not forget it. I suspect we will be reminded of that much more in the days to come.”\n\nRioting.news has more stories about violent protests staged by abortion activists.\n\nWatch WFA President Julaine Appling talking to Veronika Kyrylenko about the attack on the group’s office in Madison.\n\nThis video is from the channel The New American on Brighteon.com.\n\nWe’ve got the receipts: Liberals experience end-of-the-world meltdown as Roe v Wade is set to be overturned.\n\nLeft-wing journalist calls for more destruction and violence after pro-life group’s office firebombed in Wisconsin.\n\nAbortion activists call for PROTESTS at conservative SCOTUS judges’ houses following leaked Roe v. Wade opinion.\n\nLeft-wing abortion terrorists vow to target conservative Supreme Court justices who signed on to draft repeal of Roe v. Wade.\n\nHowling leftist demons call for targeted violence against high court justices over Supreme Court plan to overturn Roe v. Wade.", "opengraph": {"title": "Op-ed: Abortion activists reveal their EVIL nature through threats and vandalism", "type": "article", "url": "https://www.altleft.news/2022-05-15-abortion-activists-reveal-evil-nature-threats-vandalism.html", "site_name": "Alt-Left News", "description": "Abortion activists reveal their evil nature by means of threats against Supreme Court justices and vandalism on churches, according to an op-ed. Pro-life activist Jonathon Von Maren noted this observation in a May 11 piece for LifeSiteNews. His observation comes amid the leak of a draft opinion penned by Justice Samuel Alito which, if adopted […]", "image": "https://www.altleft.news/wp-content/uploads/sites/352/2022/05/Surgical-Scalpel-Knife-Surgery.jpg"}, "tags": ["insanity", "private property", "culture wars", "Twisted", "Wisconsin Family Action", "violence", "graffiti", "Alt-Left", "radical left", "destruction", "firebombing", "scotus", "Liberal Mob", "evil", "wokies", "civil unrest", "conservative justices", "domestic terrorism", "Leftists", "riots", "left cult", "Roe v. Wade", "infanticide", "abortion", "protests"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/blogs/obscene-jokes-firebombing-threats-pro-abortion-america-is-showing-us-who-they-are/", "https://www.foxla.com/news/group-dressed-in-the-handmaids-tale-costumes-protest-during-mass-at-la-cathedral", "https://nypost.com/2022/05/08/abortion-rights-protests-form-outside-scotus-justices-homes/", "https://naturalnews.com/2022-05-09-pro-abortion-leftists-dox-target-conservative-justices.html", "https://dailycitizen.focusonthefamily.com/office-of-wisconsin-pro-family-group-firebombed-pro-abortion-perpetrator-leaves-threat/", "https://rioting.news/", "https://www.brighteon.com/17baa1b8-3200-4792-a6a0-0d94b6217dff", "https://www.brighteon.com/channels/thenewamerican", "https://wokies.news/2022-05-03-roe-v-wade-set-to-be-overturned.html", "https://violence.news/2022-05-11-left-wing-journalist-calls-for-destruction-violence-pro-life-office-firebombed.html", "https://leftcult.com/2022-05-06-abortion-activists-urge-protests-scotus-judges-houses.html", "https://abortions.news/2022-05-09-abortion-terrorists-vow-target-conservative-justices.html", "https://infanticide.news/2022-05-05-howling-leftist-demons-violence-scotus-roe-wade.html", "https://www.lifesitenews.com/blogs/obscene-jokes-firebombing-threats-pro-abortion-america-is-showing-us-who-they-are/", "https://www.foxla.com/news/group-dressed-in-the-handmaids-tale-costumes-protest-during-mass-at-la-cathedral", "https://nypost.com/2022/05/08/abortion-rights-protests-form-outside-scotus-justices-homes/", "https://dailycitizen.focusonthefamily.com/office-of-wisconsin-pro-family-group-firebombed-pro-abortion-perpetrator-leaves-threat/", "https://www.brighteon.com/17baa1b8-3200-4792-a6a0-0d94b6217dff", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Faltleftnews%2F2022-05-15-abortion-activists-reveal-evil-nature-threats-vandalism.html&linkname=Op-ed%3A%20Abortion%20activists%20reveal%20their%20EVIL%20nature%20through%20threats%20and%20vandalism", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}