{"result_id": "021015", "URL": "https://altleft.news/2021-02-25-corporate-media-responsible-spreading-hatred-fear-division.html", "timestamp": "2023-04-25 11:59:45 CEST+0200", "meta": {"description": "News outlets that still maintain some semblance of credibility are starting to take notice that their counterparts utterly failed, seemingly deliberately, to get anything right concerning the Capitol “insurrection.” The Independent (United Kingdom) published a piece the other day chastising mainstream coverage of the Capitol “siege” for not only lying about what actually happened, but […]", "lang": "en", "keywords": "capitol,corporate media,division,false-flag,Fear,hatred,insurrection,invasion,mainstream media,media,siege", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://altleft.news/2021-02-25-corporate-media-responsible-spreading-hatred-fear-division.html", "encoding": "UTF-8"}, "image": null, "domain": "altleft.news", "title": "Corporate media responsible for intentionally spreading hatred, fear and division", "cleaned_text": "News outlets that still maintain some semblance of credibility are starting to take notice that their counterparts utterly failed, seemingly deliberately, to get anything right concerning the Capitol “insurrection.”\n\nThe Independent (United Kingdom) published a piece the other day chastising mainstream coverage of the Capitol “siege” for not only lying about what actually happened, but also inciting more hatred, fear division, and ultimately, violence between Americans.\n\nWriter Patrick Cockburn says the corporate media’s coverage of the events that supposedly took place that day “has come to resemble war propaganda.” He adds that regardless of the facts, the goal is to demonize the enemy, which in this case is all Trump supporters.\n\nThe world is still being told that there was all this death and destruction taking place within the Capitol at the hands of the “Trump mob,” when the reality is that almost all of the victims were people there to support Trump. Only one person who did not necessarily support Trump, a Capitol police officer, died during the melee, and the details of his death have been ever-changing.\n\nEarly on, The New York Times claimed that “insiders” who had to remain anonymous, of course, confirmed that officer Brian Sicknick died after being struck by a Trump supporter with a fire extinguisher. The Times later quietly admitted that this was not the case.\n\nIt is still unknown why Sicknick died, it turns out, as text messages he sent after the “invasion” suggested that he had incurred no injuries, and certainly did not die, nor was he rushed to the hospital as the Times claimed.\n\nThe damage has already been done, though, as people who watch or read mainstream “news” now believe that Trump supporters murdered all these people in the Capitol because they were upset about Trump “losing” the election.\n\n“By becoming partisan instruments for spreading fake news, the media undermines its own credibility,” says Cockburn.\n\nThe mainstream media is now eating its own in mad rush to retain at least some credibility\n\nNo matter what actually happened, the mainstream media and globalist entities are now pushing the narrative that we need another Patriot Act 2.0 to stop “insurrectionists” from ever again rising up and going into government buildings unannounced.\n\n“A problem with a giant news story like the Capitol invasion is that at first it is over-covered before we know the full facts, and then it is under-covered when those facts begin to emerge,” Cockburn writes.\n\nHe further notes that many of the details that were provided are patently false, including the claim that a “Trump supporter” was carrying around zip ties in order to tie up members of Congress. As it turns out, the zip ties were laying on a table and someone took them to prevent police officers from using them against “protesters.”\n\n“It is significant because it is part of a decline in media reporting everywhere, but particularly in the U.S.,” Cockburn contends about the media’s failure to report accurately.\n\nAt the end of the day, “journalism” has become little more than a feeding frenzy whereby the ratings whores are willing to report anything, whether true or false, to keep its audience engaged. Even on-the-ground reporters “have turned themselves into talking heads, willing to waffle on endlessly to meet the needs of 24/7 newscasts,” Cockburn contends.\n\n“As a news event, the Capitol invasion showed that when it comes to spreading ‘fake facts,’ the traditional media can be even more effective than the social media that is usually blamed.”\n\nMore related news stories about the lying mainstream media and the damage it is causing to American society can be found at Propaganda.news.", "opengraph": {"title": "Corporate media responsible for intentionally spreading hatred, fear and division", "type": "article", "url": "https://www.altleft.news/2021-02-25-corporate-media-responsible-spreading-hatred-fear-division.html", "site_name": "Alt-Left News", "description": "News outlets that still maintain some semblance of credibility are starting to take notice that their counterparts utterly failed, seemingly deliberately, to get anything right concerning the Capitol “insurrection.” The Independent (United Kingdom) published a piece the other day chastising mainstream coverage of the Capitol “siege” for not only lying about what actually happened, but […]", "image": "https://www.altleft.news/wp-content/uploads/sites/352/2021/02/Disaster-Insurance-Fire-Apocalypse-Business-Collapse-Crisis.jpg"}, "tags": ["capitol", "division", "invasion", "Fear", "hatred", "corporate media", "insurrection", "media", "mainstream media", "siege", "false-flag"], "tweets": [], "movies": [], "links": ["https://www.independent.co.uk/voices/capitol-invasion-riots-trump-fake-news-b1804752.html", "https://www.naturalnews.com/2021-01-16-major-events-show-cnn-complicit-capitol-raid.html", "http://propaganda.news", "https://www.independent.co.uk/voices/capitol-invasion-riots-trump-fake-news-b1804752.html", "https://www.naturalnews.com/2021-01-16-major-events-show-cnn-complicit-capitol-raid.html"], "authors": [], "publish_date": null}