{"result_id": "021016", "URL": "https://altleft.news/2022-09-29-students-protest-trans-teacher-flaunting-fake-breasts.html", "timestamp": "2023-04-25 11:59:45 CEST+0200", "meta": {"description": "Kayla Lemieux, a transgender high school teacher in Ontario, Canada, garnered global attention when photos and videos of her appeared on social media where she was showing her eye-popping fake breasts. Under pressure from parents, the Halton District School Board (HDSB) board issued a statement to explain that its hands are tied due to the […]", "lang": "en", "keywords": "absurd,campus insanity,Canada,conspiracy,culture wars,gender,groomers,Halton District School Board,left cult,lunatics,public schools,revolt,social justice,stupid,trans-ideology,transhumanism,uprising", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://altleft.news/2022-09-29-students-protest-trans-teacher-flaunting-fake-breasts.html", "encoding": "UTF-8"}, "image": null, "domain": "altleft.news", "title": "Students join protest against transgender teacher flaunting huge fake breasts in school", "cleaned_text": "Kayla Lemieux, a transgender high school teacher in Ontario, Canada, garnered global attention when photos and videos of her appeared on social media where she was showing her eye-popping fake breasts.\n\nUnder pressure from parents, the Halton District School Board (HDSB) board issued a statement to explain that its hands are tied due to the Human Rights Code of the province.\n\nUnfortunately for Lemieux, the students of Oakville Trafalgar High School themselves are not a fan of her theatrics, with several joining a small protest outside school grounds. One declared, “This is a school, not a circus. We just want to learn.”\n\nA motion was put forward at a school board meeting to consider altering their dress code – and could later mean that Lemieux may have to ditch her prosthetic breasts, which could sell for as much as $1,000 online.\n\nThe HDSB said it recognizes the rights of students, staff, parents and guardians and community members to equitable treatment without discrimination based on gender identity and gender expression. “Gender identity and gender expression are protected grounds under the Ontario Human Rights Code,” HDSB said in a statement.\n\nHowever, a group of protesters showed up at the end of the school’s driveway on Sept. 23 shouting for school officials to protect the children.\n\nSeveral other people also held signs that said: “Inclusivity is no excuse for depravity” and “Teacher’s personal propaganda has no place in the classroom.”\n\nA Campaign Life Coalition petition demanding Lemieux’s firing has already garnered over 3,500 signatures of a target of 4,000. The petition stated: “Individuals self-identifying as ‘transgender’ do not get a free pass when it comes to grooming children and exposing them to sexualization and sexual imagery,” which applies in the case, as “this is a form of sexual exploitation of children on the part of a seemingly highly unbalanced teacher.”\n\nStudents who joined the protests said they were bound by a dress code that prohibits visible nipples or showing genitalia, so they wondered why the same rules did not apply to Lemieux. (Related: Sexual predators use same grooming tactics on victims as those now being “taught” to children at public schools.)\n\nProtesters from a faith-based group called Action 4 Canada also called for the principal and school board trustees to resign for failing to protect the students.\n\nWhile all these were ongoing, the school protected Lemieux by taking her out of the school in the driveway of an adjacent YCMA childcare facility, where she was driven away from the scene.\n\nThis did not deter protesters, who vowed to keep fighting and are already planning more demonstrations.\n\nSchool board says it is “obligated” to protect Lemieux\n\nAt a recent HDSB meeting, trustee Tracey Ehl Harrison put forward a motion, which was then approved unanimously, that the director is requested to return to the board in November a report addressing the dress code.\n\nWithout dropping names, Harrison spoke about the messages she received about the teacher’s appearance, saying that some of them were nasty messages that reached groups far beyond the borders of Canada.\n\nIf a dress code is enforced, Lemieux may have to get rid of the breasts.\n\nHowever, HDSB director of education Curtis Ennis reiterated that the board is obligated to protect the teacher.\n\n“Guided by our commitment in the multi-year strategic plan and our commitment to the human rights equity action accountability plan, The Way Forward, the Halton District School Board has aimed to handle this attention in a way that stays true to our values, respects the privacy and dignity of our students and staff, and with the safety and well being of students and staff as our highest priority,” he read from a prepared statement.\n\n“While I understand the desire for information by the public, we will not and cannot publicly discuss any matter that identifies our staff directly or indirectly. I trust the public will understand the parameters that guide us,” he went on.\n\nLemieux is being protected by both a private security firm and officers from the Halton Regional Police Service. Lemieux, like the school board, refused to respond to interview requests, opting instead to keep quiet about the issue.\n\nWatch the video below for a quick look at the transgender Canadian teacher that went viral online.\n\nThis video is from THE FRONTLINE TV NEWSFLASH channel on Brighteon.com.\n\nTRANS TYRANNY: Teacher arrested and IMPRISONED for using “wrong” student pronouns.\n\nHigh school teacher FIRED for refusing to play along with the transgender delusion now afflicting modern society.\n\nVirginia reverses transgender school policy, returns right to affirm children’s gender to parents.", "opengraph": {"title": "Students join protest against transgender teacher flaunting huge fake breasts in school", "type": "article", "url": "https://www.altleft.news/2022-09-29-students-protest-trans-teacher-flaunting-fake-breasts.html", "site_name": "Alt-Left News", "description": "Kayla Lemieux, a transgender high school teacher in Ontario, Canada, garnered global attention when photos and videos of her appeared on social media where she was showing her eye-popping fake breasts. Under pressure from parents, the Halton District School Board (HDSB) board issued a statement to explain that its hands are tied due to the […]", "image": "https://www.altleft.news/wp-content/uploads/sites/352/2022/09/Transgender-Beard-Lipstick.jpg"}, "tags": ["campus insanity", "revolt", "trans-ideology", "lunatics", "culture wars", "Canada", "gender", "transhumanism", "social justice", "absurd", "Halton District School Board", "stupid", "uprising", "conspiracy", "public schools", "groomers", "left cult"], "tweets": [], "movies": [], "links": ["https://www.dailymail.co.uk/news/article-11243855/School-board-implement-dress-code-force-trans-teacher-ditch-prosthetic-breasts.html", "http://leftcult.com", "https://www.campaignlifecoalition.com/petition/page/1/id/56", "http://groomers.news", "https://naturalnews.com/2022-08-09-predators-same-grooming-tactics-children-public-schools.html", "http://campusinsanity.com", "https://www.brighteon.com/2aceb99c-61fc-4812-a1bd-967d038c23a2", "https://www.brighteon.com/channels/frontlinenewsflash", "https://gender.news/2022-09-08-teacher-arrested-imprisoned-using-wrong-student-pronouns.html", "https://naturalnews.com/2018-12-12-high-school-teacher-fired-for-refusing-to-play-along-with-the-transgender-delusion.html", "https://gender.news/2022-09-20-virginia-reverses-transgender-school-policy-parents-affirm-gender.html", "https://www.dailymail.co.uk/news/article-11243855/School-board-implement-dress-code-force-trans-teacher-ditch-prosthetic-breasts.html", "https://www.campaignlifecoalition.com/petition/page/1/id/56", "https://www.brighteon.com/2aceb99c-61fc-4812-a1bd-967d038c23a2", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Faltleftnews%2F2022-09-29-students-protest-trans-teacher-flaunting-fake-breasts.html&linkname=Students%20join%20protest%20against%20transgender%20teacher%20flaunting%20huge%20fake%20breasts%20in%20school", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}