{"result_id": "021027", "URL": "https://www.altleft.news/2020-07-31-big-tech-social-media-terrorism-left-wing-violence.html", "timestamp": "2023-04-25 11:59:52 CEST+0200", "meta": {"description": "Oh, are they ever complicit in promoting terrorist acts and providing a coordination hub for those terrorists to plot destruction, murder, rape and arson in metropolitan cities across America. Yes, we’re talking about the Sharia Law Social Media Gurus, the CEOs, the kings of the twisted, communist, Leftist online fronts. All this while outright banning conservatives […]", "lang": "en", "keywords": "adam swart,antifa terror,Big Tech,blm terror,cod,left cult,paid riots,paid terror,peaceful protests,riots,Social media,swart doxxed,tech giants,terrorism,truth about covid,violence", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.altleft.news/2020-07-31-big-tech-social-media-terrorism-left-wing-violence.html", "encoding": "UTF-8"}, "image": null, "domain": "www.altleft.news", "title": "Big Tech social media platforms have morphed into terrorism coordination hubs for left-wing violence", "cleaned_text": "Big Tech social media platforms have morphed into terrorism coordination hubs for left-wing violence\n\nOh, are they ever complicit in promoting terrorist acts and providing a coordination hub for those terrorists to plot destruction, murder, rape and arson in metropolitan cities across America. Yes, we’re talking about the Sharia Law Social Media Gurus, the CEOs, the kings of the twisted, communist, Leftist online fronts. All this while outright banning conservatives from broadcasting their own rallies, their own political viewpoints, and even more importantly, their cures for all these seemingly “incurable” viruses, bacteria, diseases and disorders. Big Tech is complicit in treason. Black Lives Matter isn’t a group fighting for equal rights; they want to burn the whole country down and start over. They want chaos everywhere. They want to take over everyone’s home and land and send everyone packing or to their grave. It’s that simple, or maybe you haven’t heard every Democrat in America screaming for no more police, no more borders, and no more prisons. Follow the bouncing ball.\n\nFacebook and “Crowds on Demand” are the planning stations for left-wing terrorists plotting murder, arson, destruction and mayhem for US cities\n\nDid you say on Facebook that you like law and order? You’re banned for life. Did you post recently something positive about your country, that you actually like America? That’s hate speech. You’re now censored. Are you plotting to blow up a police station or murder some people at a rally that are wearing MAGA hats? Your posts may continue as you meet all “community guidelines” and social justice correctness. Head to Google Ads and Craig’s list now to find out how you can be paid to destroy buildings and people’s lives too.\n\nDid you know that over 90 percent of the people who attend Leftist protests (riots) are PAID and hired by radical communist companies like Crowds on Demand? These people don’t even have a cause, besides getting paid to be violent. They don’t support equal rights, or socialism, or Black lives, all they care about it getting paid to be violent. Yes, Crowds on Demand, or “COD,” organizes domestic terrorists and literally advertises to recruit rioters for up to $75 per hour. If they were peaceful protests, nobody would get paid, and they would all stop showing up. Get it?\n\nCEO of COD, Adam Swart, is responsible for every murder, rape, assault and burned building/store that results from his hired thugs\n\nThere should be warrants out for the arrest of Adam Swart. If he did this when Obama was President to protest the Left, you could bet your last pre-dawn raid that Adam Swart would either be serving hard time or would have been ‘suicided’ with two bullets to the back of the head, like Seth Rich. Is your name on the Clinton Hit List? You better check. By the way, there really is no group called BLM or Antifa. It’s just hired mercenaries sent into busy cities to create chaos before the Presidential election, and blame it all on Trump. Want to hire a crowd to murder people or burn down federal buildings?\n\nJust contact Crowds on Demand here and put in your request. There are no laws for Democrats and no censoring on social media, so have at it. Plus, when you protest peacefully (riot and murder) you’re immune to covid, so don’t worry about wearing a mask or social distancing! How great is that?\n\nNow the mainstream press has millions of white kids thinking they’re helping Blacks fight for rights, when essentially, the Left will kill all the Blacks first, with dirty vaccines and inner-city violence when the police are all disbanded and the prisons are shut down. Reparations are underway folks, and all you have to do is vote all your rights away to the communist Democrats.\n\nSo when it looks like every American metropolitan city is up in flames and bombarded by thousands of Neanderthals with torches, think again. That’s just the stage where the Democrats set up for their play for television. It’s all smoke and mirrors folks, except for the people that the rioters rape, burn, beat and kill.\n\nTruth is the new “hate speech”\n\nDid you say it’s not fair for all illegal immigrants who sneak into America to get free healthcare, free food, free college, and voting rights? According to the Tech Giants, you’re a racist. You’re now banned from YouTube, Twitter, Instagram and Fakebook.\n\nHave you shared a video of an anarchist autonomous zone that proves violence and murder are happening there? Artificial intelligence (AI) has now banned you from posting videos ever again on YouTube. These are all “peaceful protests” and your videos have been deemed “offensive,” “edited” and “fake news” by fact checkers who get paid to censor all conservative viewpoints and anything that exposes BLM or Antifa as the domestic terrorist network that they really are right now.\n\nTune your internet dial to Pandemic.news and find out why Bill Gates wants to inject all Black people first with his cannibal-covid-vaccine that’s loaded with human abortion cells and genetically mutated versions of the deadly coronavirus.", "opengraph": {"title": "Big Tech social media platforms have morphed into terrorism coordination hubs for left-wing violence", "type": "article", "url": "https://www.altleft.news/2020-07-31-big-tech-social-media-terrorism-left-wing-violence.html", "site_name": "Alt-Left News", "description": "Oh, are they ever complicit in promoting terrorist acts and providing a coordination hub for those terrorists to plot destruction, murder, rape and arson in metropolitan cities across America. Yes, we’re talking about the Sharia Law Social Media Gurus, the CEOs, the kings of the twisted, communist, Leftist online fronts. All this while outright banning conservatives […]", "image": "https://www.altleft.news/wp-content/uploads/sites/352/2020/07/fb-terr.jpg"}, "tags": ["paid riots", "peaceful protests", "Social media", "truth about covid", "swart doxxed", "antifa terror", "blm terror", "paid terror", "riots", "Big Tech", "tech giants", "cod", "violence", "terrorism", "adam swart", "left cult"], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com/2018-11-30-evil-tech-giants-now-operating-under-sharia-law.html", "https://www.naturalnews.com/2020-07-28-facebook-coordinate-left-wing-terrorist-attacks-ban-conservatives.html", "https://freedomoutpost.com/90-blm-antifa-rioters-paid-crowds-demand-via-craigs-list-google-ads/", "https://www.washingtontimes.com/news/2015/may/19/hired-black-lives-matter-protesters-start-cutthech/", "https://www.thegatewaypundit.com/2019/08/here-it-is-complete-list-of-clinton-associates-who-allegedly-died-mysteriously-or-committed-suicide-before-testimony-including-jeffrey-epstein/", "https://crowdsondemand.com/request-quote", "https://www.naturalnews.com/2020-07-30-twitter-locks-trump-jr-after-posting-americas-frontline-doctors.html", "https://www.naturalnews.com/2020-07-23-communist-corporate-america-fuming-red-bull-wont-sell-out.html", "https://pandemic.news/", "https://www.naturalnews.com/2020-07-29-youtube-deplatforms-del-bigtree-the-highwire-covid-19.html", "https://www.naturalnews.com/2020-07-28-facebook-coordinate-left-wing-terrorist-attacks-ban-conservatives.html", "https://freedomoutpost.com/90-blm-antifa-rioters-paid-crowds-demand-via-craigs-list-google-ads/", "https://pandemic.news/"], "authors": [], "publish_date": null}