{"result_id": "021018", "URL": "https://www.altleft.news/2021-10-31-jay-inslees-terror-against-unvaccinated-in-wa.html", "timestamp": "2023-04-25 11:59:46 CEST+0200", "meta": {"description": "If huge crowds at SEC college football games are any indication, much of the country has moved on from the media’s ticker-induced COVID-19 hysteria. (Article by Elizabeth M. Economou republished from AmericanThinker.com) Conversely, in the dystopian Pacific Northwest, Governor Jay Inslee’s reign of terror against the unvaccinated goes largely unchallenged and unabated. According to Marty Makary, […]", "lang": "en", "keywords": "covid-19,Hysteria,insanity,Jay Inslee,lockdowns,pandemic,terrorism,unvaccinated,vaccine,vaccine mandate,vaccine wars,vaccines,Washington state", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.altleft.news/2021-10-31-jay-inslees-terror-against-unvaccinated-in-wa.html", "encoding": "UTF-8"}, "image": null, "domain": "www.altleft.news", "title": "No end in sight to Jay Inslee’s reign of terror against the unvaccinated in WA", "cleaned_text": "No end in sight to Jay Inslee’s reign of terror against the unvaccinated in WA\n\nIf huge crowds at SEC college football games are any indication, much of the country has moved on from the media’s ticker-induced COVID-19 hysteria.\n\nConversely, in the dystopian Pacific Northwest, Governor Jay Inslee’s reign of terror against the unvaccinated goes largely unchallenged and unabated.\n\nAccording to Marty Makary, a professor at the Johns Hopkins University School of Medicine, citing an Israeli study of more than 700,000 people, natural immunity from infection confers 27 times more protection than the jab. And yet, starting yesterday (Oct. 25), the unvaccinated are prohibited from getting a cup of coffee at Starbucks in Seattle, or even stepping inside a gym, theater, or restaurant, without a negative COVID-19 test.\n\nInslee claims to follow “the science.” In reality, he is a science-denier for outright dismissing natural immunity.\n\n“We should not force COVID vaccines on anyone when the evidence shows that naturally acquired immunity is equal to or more robust and superior to existing vaccines. Instead, we should respect the right of the bodily integrity of individuals to decide for themselves,” writes Paul Elias Alexander for the Brownstone Institute, where he references 91 studies affirming naturally acquired immunity to COVID-19.\n\nSo far, nearly 1,900 Washington state employees, including 67 state patrol troopers, have quit their jobs or have been fired for rejecting the governor’s unconstitutional coronavirus vaccine mandate.\n\nPut another way: comply or starve.\n\nBy contrast, 29 states have no vaccine mandates in place, including sunny Florida, where COVID-19 cases have been dropping for eight consecutive weeks. Perhaps Inslee could take a cue from Florida governor Ron DeSantis, who has now opened monoclonal antibody treatment clinics across his state to help those with COVID-19 avoid hospitalization.\n\nToday, Washington State ranks among the bottom of all 50 states for legislative oversight of executive emergency actions, according to the Washington Policy Center. Inslee first proclaimed a state of emergency more than 600 days ago in February 2020 — which seems like an eternity now.\n\nStill, Inslee has no plans to relinquish executive emergency powers.\n\n“There’s only one person in the state of Washington who has the capability to save those lives right now and it happens to be the governor of the state of Washington,” Inslee told TVW, Washington State’s public affairs network, recently.\n\nIf Inslee is sincere about saving lives, he will recognize natural immunity and affirm that the number of fully vaccinated people dying from COVID is rising.\n\n“The best data we have comes out of the U.K. and Israel,” notes Alex Berenson, the author of Unreported Truths about COVID-19 and Lockdowns. In the U.K., at least 70% of the people who died from COVID in August were fully vaccinated, according to Berenson, citing British government documents.\n\nBut the truth doesn’t align with Inslee’s narrative against the unvaccinated, which is why he is playing partisan politics again.\n\nEarlier this month, he granted a 45,000-person carve-out (vaccination exemption) for unionized home care workers represented by the Service Employees International Union, or SEIU 775. The union pours millions into political campaigns to keep Democrats in office.\n\nIf Washington State’s COVID-19 public health emergency is as catastrophic as Inslee professes, why is he exempting thousands of union workers from getting vaccinated while forcing others to choose between their convictions and their livelihoods?\n\nShiftwa.org couldn’t have said it better:\n\nSo while a state wildlife officer, who rarely has any contact with a member of the public, could lose his job due to Governor Inslee’s vaccine mandate, a state employee whose sole job is to interact and come in close contact with those most vulnerable to COVID (i.e. seniors and those with respiratory problems) can keep their job without obtaining a vaccine. This privilege is granted to them simply because they are represented by the powerful and wealthy SEIU, which has been bankrolling Inslee’s career dating to his days in Congress.\n\nOthers are also waking up to Inslee’s authoritarian practices, including masking as public health. A letter to the editor in the Spokane Review rebuked the governor’s actions recently.\n\n“The inmates are … running the asylum here, and nobody knows what’s going on,” noted state representative Andrew Barkis, a Republican, on the Dori Monson Show on Friday. “But there’s one thing for certain, and that is Jay Inslee retains power over our lives in a way that no governor and public officials should.”\n\nWhat is not certain, however, is how much more abuse Inslee could inflict upon the unvaccinated in Washington State.", "opengraph": {"title": "No end in sight to Jay Inslee’s reign of terror against the unvaccinated in WA", "type": "article", "url": "https://www.altleft.news/2021-10-31-jay-inslees-terror-against-unvaccinated-in-wa.html", "site_name": "Alt-Left News", "description": "If huge crowds at SEC college football games are any indication, much of the country has moved on from the media’s ticker-induced COVID-19 hysteria. (Article by Elizabeth M. Economou republished from AmericanThinker.com) Conversely, in the dystopian Pacific Northwest, Governor Jay Inslee’s reign of terror against the unvaccinated goes largely unchallenged and unabated. According to Marty Makary, […]", "image": "https://www.altleft.news/wp-content/uploads/sites/352/2021/10/America-Divided-Red-Blue-Vaccine-Covid-19.jpg"}, "tags": ["insanity", "Jay Inslee", "lockdowns", "Hysteria", "covid-19", "unvaccinated", "vaccine mandate", "vaccine", "vaccine wars", "vaccines", "pandemic", "terrorism", "Washington state"], "tweets": [], "movies": [], "links": ["https://www.americanthinker.com/blog/2021/10/no_end_in_sight_to_jay_inslees_reign_of_terror_against_the_unvaccinated_in_wa.html", "https://www.wsj.com/articles/covid-19-coronavirus-breakthrough-vaccine-natural-immunity-cdc-fauci-biden-failure-11631548306", "https://www.seattletimes.com/seattle-news/heres-what-you-need-to-know-about-king-countys-vaccine-or-test-requirement/", "https://brownstone.org/articles/79-research-studies-affirm-naturally-acquired-immunity-to-covid-19-documented-linked-and-quoted/", "https://www.seattletimes.com/seattle-news/politics/nearly-1900-washington-state-workers-quit-or-are-fired-over-covid-vaccine-mandate/", "https://www.local10.com/news/florida/2021/10/22/florida-covid-infections-drop-to-lowest-level-since-mid-june/", "https://www.statesman.com/story/news/coronavirus/2021/08/20/monoclonal-antibody-therapy-what-know-covid-19-treatment-touted-desantis/8210809002/", "https://www.clarkcountytoday.com/opinion/opinion-why-washington-state-needs-emergency-powers-reform/", "https://www.tvw.org/watch/?clientID=9375922947&eventID=2021091196", "https://childrenshealthdefense.org/defender/kim-iversen-covid-vaccine-data-israel/", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1018547/Technical_Briefing_23_21_09_16.pdf", "https://www.seattletimes.com/seattle-news/health/thousands-of-washington-home-care-workers-represented-by-seiu-775-remain-exempt-from-gov-inslees-vaccine-mandate/", "https://shiftwa.org/newsletter/daily-briefing-october-6-2021/", "https://www.thenewstribune.com/news/coronavirus/article254763787.html", "https://www.spokesman.com/stories/2021/oct/09/inslee-abusing-his-power/", "https://mynorthwest.com/3198379/gov-inslees-covid-emergency-powers-the-inmates-are-running-the-asylum-says-state-lawmaker/", "https://www.americanthinker.com/blog/2021/10/no_end_in_sight_to_jay_inslees_reign_of_terror_against_the_unvaccinated_in_wa.html"], "authors": [], "publish_date": null}