{"result_id": "021019", "URL": "https://altleft.news/2022-08-04-southwest-airlines-union-assassinated-conservative-members-lawsuit.html", "timestamp": "2023-04-25 11:59:47 CEST+0200", "meta": {"description": "The Transportation Workers Union of America (TWU), which represents employees of Southwest Airlines, just lost a case involving its own harassment of a pro-life employee who was fired for her religious beliefs. Charlene Carter, a 20-year veteran flight attendant at Southwest and pro-life advocate, was awarded $5.1 million by a jury after it was determined […]", "lang": "en", "keywords": "assassinated,bias,conservatives,discrimination,First Amendment,freedom of speech,hypocrisy,lawsuit,legal settlement,Libtards,religion,southwest,Southwest Airlines,toxic environment,Transportation Workers Union of America,TWU,Tyranny,union,Witch Hunt", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://altleft.news/2022-08-04-southwest-airlines-union-assassinated-conservative-members-lawsuit.html", "encoding": "UTF-8"}, "image": null, "domain": "altleft.news", "title": "VICTORY for MORALITY: Southwest Airlines union “assassinated” conservative members on social media; now FORCED TO PAY out millions", "cleaned_text": "VICTORY for MORALITY: Southwest Airlines union “assassinated” conservative members on social media; now FORCED TO PAY out millions\n\nThe Transportation Workers Union of America (TWU), which represents employees of Southwest Airlines, just lost a case involving its own harassment of a pro-life employee who was fired for her religious beliefs.\n\nCharlene Carter, a 20-year veteran flight attendant at Southwest and pro-life advocate, was awarded $5.1 million by a jury after it was determined that both TWU and Southwest unfairly discriminated against her for not wanting her union dues to fund pro-abortion causes.\n\nTWU Local 556 president Audrey Stone attended the Women’s March in Washington, D.C., back in 2017 after Donald Trump was elected president. That event receives direct funding from Planned Parenthood, America’s largest abortion provider.\n\nCarter reportedly started filing complaints back in 2013 about deductions from her paycheck that were going towards the union’s far-left political action committee (PAC). These complaints were then circulated among TWU and Southwest higher-ups who openly mocked Carter for her objections.\n\n“Ha! She has been supporting the thing she despises this entire time,” wrote union treasurer John Parrot.\n\n“I wish I could give her a list of all the campaigns she has donated to in the last 17 years! Her head would explode,” added Todd Gage, a vice president at the union.\n\nCarter quickly became the butt of everyone’s jokes in private email chains that were revealed during the trial, exposing TWU and Southwest as being controlled by left-wing politics. (Related: Southwest was also among the many airlines that tried to force its employees to get “vaccinated” for the Wuhan coronavirus [Covid-19].)\n\nUnions need to be barred from using member funds for political candidates and campaigns\n\nCarter is not alone, either. It turns out that TWU and Southwest higher-ups maintained a culture of social media “assassination” against right-wing members whom they “targeted.”\n\n“I am all about targeted assassinations,” reads an email from union activist Brian Talburt, discussing dissidents on social media. That email was sent to Southwest’s then-senior director of inflight services Sonya Lacor, who then forwarded it to others.\n\n“It IS maddening trying to reason with these sheeple,” Talburt mocked in his correspondence, likening dissidents within the union ranks to “cancer.”\n\nWhen a black woman named Corliss King was made an executive board member at Local 556, Talburt chided her appointment as “incredibly dangerous.”\n\n“I am sure with her dreadful work history, there could be opportunity,” Talburt wrote about King.\n\n“She will play VERY well to the heavy inner city, minority crowd coming on board soon. She will be their voice. She will be a huge threat in our upcoming election as well.”\n\nUnion critic Mike Casper was also dubbed a “cancer” who needed to be “eradicated” from the ranks for bucking the union’s political leanings.\n\nBoth Southwest and TWU have indicated plans to appeal the ruling, which forces Southwest to pay $4.15 million and TWU Local 556 to pay $950,000 to Carter. National Right to Work Foundation President Mark Mix, however, has promised to “keep fighting” for Carter, as well as others like her who have “experienced similar hostility.”\n\n“Ms. Carter demonstrated that, even in an overwhelmingly toxic environment, independent-minded workers can stand up, push back against union boss attacks on individual rights and free speech, and win,” Mix said in a statement.\n\n“The evidence presented at Carter’s trial reveals an ingrained union culture of intimidation and prejudice against dissident workers. While we will keep fighting to defend Ms. Carter’s victory for her rights, flight attendants or other employees who have experienced similar hostility should not hesitate to contact the National Right to Work Foundation for help in defending their rights.”\n\nMore related news about left-wing intimidation and discrimination against conservatives can be found at Libtards.news.", "opengraph": {"title": "VICTORY for MORALITY: Southwest Airlines union “assassinated” conservative members on social media; now FORCED TO PAY out millions", "type": "article", "url": "https://www.altleft.news/2022-08-04-southwest-airlines-union-assassinated-conservative-members-lawsuit.html", "site_name": "Alt-Left News", "description": "The Transportation Workers Union of America (TWU), which represents employees of Southwest Airlines, just lost a case involving its own harassment of a pro-life employee who was fired for her religious beliefs. Charlene Carter, a 20-year veteran flight attendant at Southwest and pro-life advocate, was awarded $5.1 million by a jury after it was determined […]", "image": "https://www.altleft.news/wp-content/uploads/sites/352/2022/08/Southwest-Airlines-creative-commons.jpg"}, "tags": ["Transportation Workers Union of America", "southwest", "lawsuit", "TWU", "religion", "Tyranny", "First Amendment", "bias", "freedom of speech", "Libtards", "toxic environment", "union", "discrimination", "Witch Hunt", "hypocrisy", "conservatives", "Southwest Airlines", "assassinated", "legal settlement"], "tweets": [], "movies": [], "links": ["https://www.dailywire.com/news/targeted-assassinations-court-docs-uncover-shocking-details-in-pro-life-womans-5m-win-over-airline-union", "https://naturalnews.com/2021-10-13-sickout-protest-amtrak-canceling-trains-covid-vaccination.html", "http://libtards.news", "https://www.dailywire.com/news/targeted-assassinations-court-docs-uncover-shocking-details-in-pro-life-womans-5m-win-over-airline-union", "https://naturalnews.com/2021-10-13-sickout-protest-amtrak-canceling-trains-covid-vaccination.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Faltleftnews%2F2022-08-04-southwest-airlines-union-assassinated-conservative-members-lawsuit.html&linkname=VICTORY%20for%20MORALITY%3A%20Southwest%20Airlines%20union%20%E2%80%9Cassassinated%E2%80%9D%20conservative%20members%20on%20social%20media%3B%20now%20FORCED%20TO%20PAY%20out%20millions", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}