{"result_id": "021021", "URL": "https://altleft.news/2022-09-27-drag-queens-disney-perform-front-of-kids.html", "timestamp": "2023-04-25 11:59:48 CEST+0200", "meta": {"description": "A Tennessee brewery hosted performances by adult drag queens dressed as Disney characters even though the event was advertised as “family-friendly.” The Wanderlinger Brewing Company in Chattanooga, Tennessee became the center of the Chattanooga Pride Youth Day held on Sept. 24. It was organized by the Chattanooga Pride/Tennessee Valley Pride, which described itself as an […]", "lang": "en", "keywords": "Chattanooga,Child abuse,culture wars,dallas,deception,demonic,drag queens,drag show,evil,gender,groomers,left cult,Mr. Misster,Pedophilia,Robby Starbuck,sexual perversion,Tennessee,Texas,transgender,Wanderlinger Brewing Company", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://altleft.news/2022-09-27-drag-queens-disney-perform-front-of-kids.html", "encoding": "UTF-8"}, "image": null, "domain": "altleft.news", "title": "Drag queens dressed as Disney characters perform in front of kids at Tennessee brewery", "cleaned_text": "Drag queens dressed as Disney characters perform in front of kids at Tennessee brewery\n\nA Tennessee brewery hosted performances by adult drag queens dressed as Disney characters even though the event was advertised as “family-friendly.”\n\nThe Wanderlinger Brewing Company in Chattanooga, Tennessee became the center of the Chattanooga Pride Youth Day held on Sept. 24. It was organized by the Chattanooga Pride/Tennessee Valley Pride, which described itself as an organization “celebrating diversity in Chattanooga and combining our LGBTQ Resources to raise awareness, educate and improve our community with dignity.”\n\nThe brewery did not appear to promote this event on its website.\n\nA Facebook post describing the event invited Tennesseans to “come hang out … for [the] annual Pride Youth Day, featuring speakers, discussions, princess meet [and] greets, drag queen story time and a family friendly drag show.”\n\nHowever, video clips from the event that went viral on social media revealed that it was far from being a family-friendly event.\n\nOne clip shared by conservative activist Robby Starbuck showed a very young girl touching the crotch area of an adult performer dressed as Ariel from “The Little Mermaid.”\n\nAnother clip featured a second drag queen dressed like Winnie the Pooh. The second drag queen performed a provocative dance, spreading their legs in front of the children and families in the audience.\n\nStarbuck claimed in a tweet that he contacted law enforcement, specifically the Chattanooga Police Department (CPD), over the indecent and lewd performances. However, a CPD employee told the activist that “there was nothing they could do about this adult spreading their legs for kids, the adult who let a kid rub their crotch or the establishment that had kids at the bar.”\n\n“Where’s law enforcement? We won’t allow this [to] continue. In Tennessee, there will be no safe space to be inappropriate like this with kids. We will stop this,” Starbuck wrote.\n\n“We will be watching every move the Left makes to do this in Tennessee. We will be reporting to the public, to the politicians and to the police until this stops. Tennesseans, send this to your [representatives] and ask them to stop this and to work with us on legislation to protect kids.” (Related: Demonic Washington Post says LGBT drag shows for children are “family-friendly.”)\n\nThousands of people reacted to the video shared by Starbuck, with all of them expressing outrage. Some users called the performance “absolutely disgusting,” while others condemned it as “sick and demented perversion.”\n\nOne even asked: “I’m wondering where are the parents; do they find this acceptable?”\n\nThe drag show in Chattanooga, Tennessee was reminiscent of a drag show at a Texas bar in June that went viral. The Drag the Kids to Pride show, held at the Mr. Misster bar in Dallas, featured a neon pink sign that said “it’s not gonna lick itself.”\n\nThe bar described the event as “the ultimately family-friendly Pride experience.” It even invited children to participate in the perversion, allocating five spots “for young performers to take the stage solo, or with a [drag] queen of their choosing.”\n\nThe Daily Mail reported details of the June 4 performance.\n\n“Photos and footage from the event showed adults sitting on stools surrounding a long narrow runway stage in the middle of the room,” the publication wrote.\n\n“As parents sipped on drinks with kids seated at their side, drag queens in dresses and glittered leotards danced along the stage, at times inviting the children to walk down the runway with them.”\n\nProtesters and event attendees reportedly engaged in verbal clashes outside the venue.\n\nHead over to Groomers.news for more stories about drag performances that involve children.\n\nWatch InfoWars host Owen Shroyer discuss a viral video of drag queens teaching children to dance like strippers at a drag show.\n\nThis video is from the InfoWars channel on Brighteon.com.\n\nAntifa shows up armed to “kid friendly” drag event in Texas to “stand guard” and protect groomers.", "opengraph": {"title": "Drag queens dressed as Disney characters perform in front of kids at Tennessee brewery", "type": "article", "url": "https://www.altleft.news/2022-09-27-drag-queens-disney-perform-front-of-kids.html", "site_name": "Alt-Left News", "description": "A Tennessee brewery hosted performances by adult drag queens dressed as Disney characters even though the event was advertised as “family-friendly.” The Wanderlinger Brewing Company in Chattanooga, Tennessee became the center of the Chattanooga Pride Youth Day held on Sept. 24. It was organized by the Chattanooga Pride/Tennessee Valley Pride, which described itself as an […]", "image": "https://www.altleft.news/wp-content/uploads/sites/352/2022/09/drag-queen-disney-characters.png"}, "tags": ["sexual perversion", "culture wars", "gender", "Robby Starbuck", "dallas", "Chattanooga", "demonic", "Mr. Misster", "transgender", "Wanderlinger Brewing Company", "evil", "drag queens", "Child abuse", "Pedophilia", "left cult", "drag show", "deception", "Tennessee", "Texas", "groomers"], "tweets": [], "movies": [], "links": ["https://www.wnd.com/2022/09/law-enforcement-watch-drag-queens-dressed-disney-princesses-perform-kids/", "https://www.faithwire.com/2022/09/26/wheres-law-enforcement-video-shows-drag-queens-dressed-as-disney-princesses-performing-for-children-in-family-friendly-show/", "https://naturalnews.com/2022-08-12-wapo-lgbt-drag-children-family-friendly.html", "https://thenewamerican.com/drag-queen-pride-event-for-kids-features-sign-its-not-gonna-lick-itself/", "http://groomers.news/", "https://www.brighteon.com/af7e1826-0807-4640-b5fb-9f5cf207e6d0", "https://www.brighteon.com/channels/infowarsnetwork", "https://groomers.news/2022-08-12-disney-features-drag-queen-grooming-another-superhero.html", "https://groomers.news/2022-09-20-pridefest-scrubs-ad-urging-kids-tip-drag-queens.html", "https://groomers.news/2022-09-20-conservatives-unite-stop-exposing-children-lgbt-ideologies.html", "https://groomers.news/2022-08-30-desantis-cites-1947-ruling-against-drag-restaurant.html", "https://groomers.news/2022-08-31-antifa-armed-kid-friendly-drag-texas-groomers.html", "https://www.wnd.com/2022/09/law-enforcement-watch-drag-queens-dressed-disney-princesses-perform-kids/", "https://www.faithwire.com/2022/09/26/wheres-law-enforcement-video-shows-drag-queens-dressed-as-disney-princesses-performing-for-children-in-family-friendly-show/", "https://thenewamerican.com/drag-queen-pride-event-for-kids-features-sign-its-not-gonna-lick-itself/", "https://www.brighteon.com/af7e1826-0807-4640-b5fb-9f5cf207e6d0", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Faltleftnews%2F2022-09-27-drag-queens-disney-perform-front-of-kids.html&linkname=Drag%20queens%20dressed%20as%20Disney%20characters%20perform%20in%20front%20of%20kids%20at%20Tennessee%20brewery", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}