{"result_id": "021030", "URL": "https://altleft.news/2020-11-27-study-reveals-mainstream-media-suppression-biden-victories.html", "timestamp": "2023-04-25 11:59:54 CEST+0200", "meta": {"description": "Most readers know that the so-called ‘mainstream’ corporate media is little more than a propaganda arm for the far-left Democrat Party, and has been for decades. But now we can officially add “election meddling” to their wall of shame.  A new bombshell study has found that the media directly contributed to the election of Joe […]", "lang": "en", "keywords": "banned,broadcast networks,Censorship,covid-19,deep state,election theft,establishment media,fake news,Hillary Clinton,ignore,Joe Biden,left cult,lies,mainstream media,Media Lies,Media Research Center,negative coverage,news cartels,NewsBusters,omission,President Trump,propaganda,Tara Reade", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://altleft.news/2020-11-27-study-reveals-mainstream-media-suppression-biden-victories.html", "encoding": "UTF-8"}, "image": null, "domain": "altleft.news", "title": "Bombshell study reveals that mainstream media suppression of eight key issues led to Biden victories in key battleground states", "cleaned_text": "Bombshell study reveals that mainstream media suppression of eight key issues led to Biden victories in key battleground states\n\nMost readers know that the so-called ‘mainstream’ corporate media is little more than a propaganda arm for the far-left Democrat Party, and has been for decades.\n\nBut now we can officially add “election meddling” to their wall of shame.\n\nA new bombshell study has found that the media directly contributed to the election of Joe Biden (if it stands) by refusing to do its job: Informing Americans of the issues of the day.\n\nWhile these disgusting hacks spent the past four years repeating every single lie the deep state told them about President Donald Trump and his administration — starting with the ‘Russian collusion’ hoax — the media purposefully ignored eight issues that likely led to a Biden victory.\n\nAccording to a study commissioned by the Media Research Center, The Polling Company surveyed 1,750 Biden voters in Arizona, Georgia, Michigan, Nevada, North Carolina, Pennsylvania and Wisconsin — all states (with the exception of North Carolina) that were called for the former vice president.\n\n“We tested these voters’ knowledge of eight news stories — all important topics that our ongoing analysis had shown the liberal news media had failed to cover properly. We found that a huge majority (82%) of Biden voters were unaware of at least one of these key items, with five percent saying they were unaware of all eight of the issues we tested,” the MRC said.\n\n“This lack of information proved crucial: One of every six Biden voters we surveyed (17%) said they would have abandoned the Democratic candidate had they known the facts about one or more of these news stories. A shift of this magnitude would have changed the outcome in all six of the swing states won by Joe Biden, and Donald Trump would have comfortably won a second term as president,” the media critic added.\n\nIn particular, the garbage media ignored all of the bad news and scandals surrounding Biden, and eight issues specifically:\n\n— Very credible, multiply corroborated allegations of sexual assault against Biden dating back to the early 1990s by then-Senate aide Tara Reade;\n\n— Charges of corruption involving son Hunter Biden that were discovered on a laptop he abandoned at a Delaware computer repair shop last year that included possible kickbacks to the former vice president;\n\n— Sen. Kamala Harris’ extreme left-wing views on nearly every major domestic policy issue;\n\n— How the economy came back quickly from the recession caused by widespread mandatory business closures due to the COVID-19 pandemic (none of which President Trump himself ordered);\n\n— Historic peace deals the Trump administration managed between Israel and several of its Arab neighbors, as well as Serbia and Kosovo;\n\n— U.S. energy independence under President Trump, resulting in America becoming a net oil exporter for the first time (and probably the last time if Biden gets in because he’ll kill our energy industry);\n\n— The success of “Operation Warp Speed” to quickly get a coronavirus vaccine to market (a vaccine which we’re not fans of but which many Americans nevertheless believe will be needed if we’re to ever return to ‘normal’).\n\nAnd again, if the media had done its job and fairly reported all of these issues, then either President Trump would have cruised to reelection or the deep state would have had to have worked even harder to steal the election for Biden.\n\nOf course, none of this should surprise anyone. The media has been trashing President Trump for years — even before he beat the thoroughly corrupt and oft-investigated Hillary Clinton.\n\nA study published in August, for instance, by NewsBusters found that as the COVID-19 pandemic dragged through the summer, the three broadcast networks’ evening newscasts were the highest rated on television, meaning millions of viewers “witnessed the most biased presidential campaign coverage in modern history.”\n\n“A new MRC analysis of all evening news coverage of President Donald Trump and former Vice President Joe Biden in June and July found these networks chose to aim most of their attention and nearly all of their negative coverage on Trump, so Biden escaped any scrutiny of his left-wing policy positions, past job performance or character,” the media critic said.\n\nWe cover all of the mainstream media’s dishonesty at NewsFakes.com.", "opengraph": {"title": "Bombshell study reveals that mainstream media suppression of eight key issues led to Biden victories in key battleground states", "type": "article", "url": "https://www.altleft.news/2020-11-27-study-reveals-mainstream-media-suppression-biden-victories.html", "site_name": "Alt-Left News", "description": "Most readers know that the so-called ‘mainstream’ corporate media is little more than a propaganda arm for the far-left Democrat Party, and has been for decades. But now we can officially add “election meddling” to their wall of shame.  A new bombshell study has found that the media directly contributed to the election of Joe […]", "image": "https://www.altleft.news/wp-content/uploads/sites/352/2020/11/Interview-News-Media-Tv-Journalist-Information-Public.jpg"}, "tags": ["Tara Reade", "Joe Biden", "establishment media", "NewsBusters", "covid-19", "omission", "election theft", "Hillary Clinton", "Media Lies", "news cartels", "Censorship", "fake news", "President Trump", "propaganda", "mainstream media", "ignore", "lies", "left cult", "deep state", "Media Research Center", "banned", "negative coverage", "broadcast networks"], "tweets": [], "movies": [], "links": ["https://www.newsbusters.org/blogs/nb/rich-noyes/2020/11/24/special-report-stealing-presidency-2020", "https://www.naturalnews.com/2020-09-10-joe-biden-worst-candidate-democrats-ever-nominated.html", "https://www.naturalnews.com/2020-10-30-hunter-business-partner-says-vp-took-profits-china.html", "https://www.naturalnews.com/2020-08-19-150-more-negative-news-trump-than-biden.html", "http://NewsFakes.com", "https://www.naturalnews.com/2020-08-19-150-more-negative-news-trump-than-biden.html", "https://www.newsbusters.org/blogs/nb/rich-noyes/2020/11/24/special-report-stealing-presidency-2020", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Faltleftnews%2F2020-11-27-study-reveals-mainstream-media-suppression-biden-victories.html&linkname=Bombshell%20study%20reveals%20that%20mainstream%20media%20suppression%20of%20eight%20key%20issues%20led%20to%20Biden%20victories%20in%20key%20battleground%20states", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}