{"result_id": "022003", "URL": "https://americandigitalnews.com/index.php/2022/07/08/american-digital-news-7-8-22-lineups/", "timestamp": "2023-04-25 12:00:02 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://americandigitalnews.com/wp-content/uploads/ADN-red-favacon.jpg", "canonical": "https://americandigitalnews.com/index.php/2022/07/08/american-digital-news-7-8-22-lineups/", "encoding": "UTF-8"}, "image": null, "domain": "americandigitalnews.com", "title": "AMERICAN DIGITAL NEWS 7/8/22 LINEUPS", "cleaned_text": "1.Can A Sitting US President Go To Jail?\n\nGRUNGE George W. Bush, Barack Obama, Donald Trump, and Joe Biden all share something in common: all four have faced calls for their imprisonment. But could it happen?\n\n2.Shinzo Abe dead: Japan’s longest-serving prime minister was conservative kingmaker who strengthened US ties\n\n3.📌US NAVY/UK U.S. Navy supports UK seizure of Iranian missiles AUDACY A U.S. Navy guided-missile destroyer supported maritime operations conducted by naval forces from the United Kingdom that resulted in the seizure of adv weapons components during an interdiction in the Gulf of Oman, Feb. 25.\n\n4.📌LGTBQFML Army Mandatory Training Requires Soldiers To Shower With Transgender People Of Opposite Sex, Accept ‘Primitive’ Work Conditions THE GATEWAY PUNDIT The United States is being destroyed within as Democrats intentionally demoralize U.S. service members. The Army is being instructed during training to shower with transgender members of the opposite sex including those who have not surgically transitioned.\n\n5.📌LIBERAL PANIC House Republicans are ‘out for blood’ and planning revenge against the Jan. 6 committee: report ALTERNET A long list of House Republicans — from House Minority Leader Kevin McCarthy to Rep. Jim Jordan of Ohio to House Republican Conference Chair Elise Stefanik — deeply resent Speaker Nancy Pelosi’s January 6 select committee, which Stefanik has denounced as an “illegitimate partisan sham.” But that ”sham” has presented a mountain of damning evidence against former President Donald Trump and his MAGA allies, including former White House aide Cassidy Hutchinson’s bombshell testimony, on June 28, that Trump knew some of his supporters were armed on January 6, 2021 and wanted to march with them to the U.S. Capitol Building anyway.\n\n6. Liz Cheney Furious After Committee Chairman Gives Her News On Trump CONSERVATIVE BRIEF Republican Wyoming Rep. Liz Cheney continues to get hit with bad news. Cheney is reportedly furious with the January 6 Select Committee’s decision to not make a criminal referral to the Department of Justice for former President Donald Trump.\n\nThe chairman of the committee, Rep. Bennie Thompson, was asked by a reporter if the committee would be sending criminal referrals for the former president or others and he responded by saying the committee does not have that authority, CNN reported. This is not what she wanted!\n\n7.Bombshell Report Reveals $77.2B Improperly Paid Through Unemployment in 2021 THE WESTERN JOURNAL The government lost around $408 million through administrative and processing errors made by state and local agencies.\n\n8.European energy crisis has boiled over — things on the continent are about to change, rapidly and more absolutely than most can imagine:\n• Germany: is restricting when and how energy companies can declare force majeure;\n• France: has just nationalized the nation’s largest energy company, EDF;\n• UK: announced they, too, would simply cut off nat gas to the EU when supply is short (as the entire cabinet resigns);\n• The EU has decided that nuclear and natural gas energy are “green” after all, a semantic change which only marginally lengthens the runway for their ‘decarbonization transition’\n\nBerlin plans to limit claims of “force majeure” in bid to stabilize energy markets. Following reduced gas flows from Russia, German energy companies are struggling under the strain of record energy prices, prompting the German government to tighten its hold on the market. NWO major moves that signal of what is ahead… brace for impact, my friends. TG/EURACTIV.COM\n\n10.📌HLLARY CLINTON I Know Clarence Thomas. Hillary Clinton Lied About Him. THE DAILY SIGNAL Hillary Clinton’s “person of grievance” smear of Clarence Thomas must be based on unreliable hearsay or eavesdropping.\n\n1.📌NY/CRIME Three Women Go Berserk Over A $1.75 Extra Sauce Charge, Trash A NYC Restaurant In Viral Video RED VOICE MEDIA A crowd of people behind the counter began to cheer on the violent women, with one of the suspects opting to jump atop the service counter so they could twerk for their audience.\n\n2.📌9,000-Pound Hummer EV Pollutes More Than a Gas-Powered Chevy Malibu THE WESTERN JOURNAL The hype says electric vehicles are much better for the environment than their gas-powered counterparts. But the truth is not so simple.\n\n3.📌Facing Public Backlash Manhattan DA Lowers Bail for 61-Year-Old Convenience Store Clerk, Jose Alba, in Clear Self Defense Case – The Last Refuge CONSERVATIVE BRIEF Jose Alba, 61, was working at Hamilton Heights Grocery on Broadway when a 35-year-old career criminal and ex-con, Austin Simon, stormed behind the counter and shoved him into a wall. Austin Simon then continued to aggressively push Alba around, when the clerk grabbed a knife to defend himself and stabbed his attacker, Simon.\n\nThe entire incident was captured on CCTV footage [SEE HERE, Rumble], and the series of events were triggered when Simon’s girlfriend did not have enough money for her purchase and Jose Alba would not let her just take it without paying. The boyfriend, Austin Simon, then enters the store, walks behind the counter and begins assaulting the 61-year-old Mr. Alba. After a few minutes of being shoved and pushed around, Alba then grabbed a knife and stabbed Simon. The attacker died of his injuries. The store clerk was arrested by police, charged with murder and sent to jail with a $500,000 bail.\n\n4.📌SOCIAL MEDIA MONITORING TAMPERING WITH ELECTIONS? Heritage Foundation sues DHS for documents on social media monitoring efforts JUST THE NEWS The Heritage Foundation filed a Freedom of Information Act (FOIA) lawsuit on Thursday against the Department of Homeland Security in order to obtain records about the federal agency’s surveillance of Americans through social media. The intelligence program Babel X retrieves and copies information from billions of people worldwide.\n\n5.Biden Sold a Million Barrels From US Strategic Petroleum Reserve to China-Owned Gas Giant THE WASHINGTON FREE BEACON The Biden administration sold roughly one million barrels from the Strategic Petroleum Reserve to a Chinese state-controlled gas giant that continues to purchase Russian oil, a move the Energy Department said would “support American consumers” and combat “Putin’s price hike.”\n\n6.📌CV19 WTH? Munich Researchers Claim Intense Exercise Can Increase Risk of Catching COVID-19 THE GATEWAY PUNDIT A new study out of the University of Munich suggested that intense workouts may increase your risk of catching infectious diseases like COVID-19.\n\nFrench health authorities on Friday urged preemptive vaccination against monkeypox for certain segments of the population, especially those with multiple sexual partners.\n\n“Men who sleep with men and transgender people with multiple sexual partners, sex workers and people working in places where people go to find sex” were among “the groups most exposed to the virus,” the HAS body said in a statement.\n\n📌(b) $POX/FL ‘Absolutely be concerned.’ Monkeypox cases are surging in South Florida SMART NEWS $$$ Less than eight weeks ago, the Florida Department of Health reported the state’s first presumptive case of monkeypox — a viral disease that was once rare in the United States.\n\nAnd South Florida is the epicenter of the state’s outbreak, with Miami-Dade and Broward counties accounting for more than 70% of all reported cases in Florida. Broward is leading the state with 40 cases, while Miami-Dade is second with 14 cases, according to the Florida Department of Health.\n\n📌(c)CV19/CANADA Canada to Destroy 13.6 Million Doses of AstraZeneca COVID-19 Vaccine Because No One Wants it Domestically or Abroad THE GATEWAY PUNDIT The Canadian government announced on Tuesday that it will destroy 13.6 million expired doses of the Oxford-AstraZeneca COVID-19 vaccine due to a lack of demand at home and overseas.\n\nAccording to reports, more than half of all the doses it has ever bought have expired after Canada couldn’t find any foreign countries willing to take the vaccines, despite pledging to donate them.\n\n8.📌GOP Senator Pressures Fauci Into Canceling Nearly $2 Million In Funding For ‘Cruel’ Puppy Experiments CONSERVATIVE BRIEF A leading Republican senator played a significant role in Dr. Anthony Fauci’s decision to cancel funding for “cruel” experiments on puppies after she pressured him and his office.\n\n“Dr. Fauci was barking up the wrong tree when he decided to use government dollars on dog testing,” Sen. Joni Ernst of Iowa noted in a statement.\n\n“These inhumane practices have no place in our government – much less on the taxpayer’s dime. Thankfully, after voicing our concerns and shining a light on these heinous tactics, taxpayers can rest easy knowing their hard-earned money is not going towards dog abuse,” she said. He made a stunning admission.\n\n9.📌CNN Correspondent Can’t Hide Reality of Sky-High Inflation: ‘I Find Myself Shocked When I Go to the Grocery Store’ RESIST THE MAINSTREAM CNN Business correspondent Rahel Solomon opined Wednesday that “really high inflation,” which topped 8.6 percent in May, is reshaping American life.\n\n10. CALIFORNIA/UPDATE: BORDER WALL REPLACEMENT A TRUMP ACT! Biden DHS closing gap in border wall Trump wanted filled in NY POST The Biden administration has quietly given the green light to completing a border barrier separating Southern California from Mexico — a project that was initially planned by the Trump White House.\n\n🔷First 12 Things Trump Will Do When He Inevitably Returns To Power THE BABYLON BEE\n\nThe prophets have long whispered of the return of ULTRA-MAGA King Trump. In faith, we know that his return is inevitable and that he will soon reclaim the presidency and set right what has gone awry.\n\nHere are the first 12 things Trump will do when he returns to power:\n• Spray Febreze on the Oval Office curtains to get the old man smell out: Step one to draining the swamp is giving it a flowery scent.\n• Make Pelosi wear a sweater on the beach: I mean, really.\n• Welcome back Mike Pence, just to tell him he’s fired: It’ll be the highest ratings for a single episode of The Apprentice. Maybe ever.\n• Invade Afghanistan so he can show how much better he would be at withdrawing from Afghanistan: He’s been dreaming about this one every night when he goes to sleep.\n• Finish building that wall, but make Hunter Biden pay for it: Hunter will borrow from Joe, who will borrow from China. 4D chess!\n• Make everything at the dollar store $1 again: And abolish the Fed.\n• Sneak out of the Oval Office for a quick 9 holes: Trump needs to keep his golf skills sharp so he can challenge Putin to a match for the fate of Russia.\n• Bring back the McRib: And make it permanent this time!\n• Find Osama Bin Laden’s body and kill him again: USA! USA! USA!\n• Declare total infinity immunity with no take-backs: Should put an end to congressional witch hunts.\n• Put Dr. Fauci in the stocks in the National Mall so everyone can throw cabbage at him: Somewhere up there Samuel Adams is drunkenly smiling.\n• Buy Greenland and make Mexico pay for it: And then drill for oil like there’s no tomorrow.\n\n…Good Day Patriots Happy Friyay Plastic Girl Reporting here today’s top story on this day 246 years ago on July 8, 1776, a 2,000-pound copper-and-tin bell now known as the “Liberty Bell” rings out from the tower of the Pennsylvania State House (now Independence Hall) in Philadelphia, summoning citizens to the first public reading of the Declaration of Independence. Four days earlier, the historic document had been adopted by delegates to the Continental Congress, but the bell did not ring to announce the issuing of the document until the Declaration of Independence returned from the printer on July 8.\n\nIn 1751, to commemorate the 50-year anniversary of Pennsylvania’s original constitution, the Pennsylvania Provincial Assembly ordered the bell to be constructed. After being cracked during a test, and then recast twice, the bell was hung from the State House steeple in June 1753. Rung to call the Pennsylvania Assembly together and to summon people for special announcements and events, it was also rung on important occasions, such as King George III’s 1761 ascension to the British throne and, in 1765, to call the people together to discuss Parliament’s controversial Stamp Act. With the outbreak of the American Revolution in April 1775, the bell was rung to announce the battles of Lexington and Concord. Its most famous tolling, however, was on July 8, 1776, when it summoned Philadelphia citizens for the first reading of the Declaration of Independence.\n\n🤡 Joe Biden has only done 2 press interviews in 2022\n\n🆘 60% of small businesses say inflation is hurting them worse than Covid lockdowns\n\n☎️Rogers telecommunications company offline. Canada-wide outage affecting cell, internet services, and some 911 services, Ottawa police says.\n\n😁Judge in Uruguay suspends injections of Pfizer’s mRNA vaccine in children under age 13 until certain “conditions” are met, including contract disclosure. [DiscloseTV]\n\n🛢The Biden admin sold 1 million barrels from the Strategic Petroleum Reserve to a Chinese oil company that Hunter Biden has financial ties to, during an energy crisis. This is an impeachable offense [Fox Business]\n\n🚸 Governor Greg Abbott today issued an executive order authorizing and empowering the Texas National Guard and the Texas Department of Public Safety to apprehend illegal immigrants who illegally cross the border between ports of entry and return them to the border. [Breaking911]\n\n👏🏻Trump-Endorsed Arizona Gubernatorial Candidate Kari Lake gave an excellent interview on Steve Bannon’s War Room yesterday, responding to the lawless Biden Regime’s lawsuit over a new law requiring voters in Arizona to prove their US Citizenship. Kari Lake Responds To Biden Regime Lawsuit On Bannon’s War Room: “Obviously, He Wants To See ILLEGALS Vote. We Do Not And They Will Not In Arizona When I’m Governor. [Gateway Pundit]\n\n💩Biden is expected to formalize instructions to the Departments of Justice and HHS to push back on efforts to limit the ability of women to access federally approved abortion medication or to travel across state lines to access clinical abortion services.[WTHR]\n\n🗳The Maricopa County Republican Committee Executive Governance Committee voted unanimously in a voice vote to officially reject the certification of the 2020 Presidential Election.[AZ central]\n\n🎥NY Times Journo Gets OWNED for Ten Minutes Straight by Tucker Carlson\n\n🎥Joe Biden Claims He Has “Never Said a Negative Thing” About John McCain in His Life. Straight lies for 3 minutes 😒\n\nJOIN US NEXT FOR THE\n\n📌Democratic Candidate Reportedly Charged With Reckless Use of a Firearm RESIST THE MAINSTREAM Democratic Iowa District candidate Sonya Heitshusen has been charged with the reckless use of a firearm after she allegedly shot a gun in her home June 27.\n\n📌UKRAINE US announces more Himars precision rocket systems for Ukraine INSIDER PAPER The United States announced Friday it will send Ukraine more Himars rocket systems and new precision artillery shells, boosting its ability to target Russian arms depots and supply chains.\n\nA new $400 million arms package will include four Himars launchers with ammunition, a system that has helped Ukraine’s forces attack targets like ammunition dumps with guided missiles from a greater distance, out of range of Russian artillery, according to a senior defense official.\n\nThousands of heavily armed troops were deployed in Sri Lanka’s capital Friday ahead of a planned rally demanding the ouster of embattled President Gotabaya Rajapaksa.\n\nGreece and Bulgaria on Friday opened a long-awaited natural gas pipeline designed to help Bulgaria, which has for years been heavily dependent on Russian gas, obtain energy from other sources.\n\n📌UPDATE/DUTCH “I Could Be Dead Now – I Want to Know Why They Shot at Me” – Dutch Farmer Boy Jouke Speaks Out, Displays Bullet Holes in Tractor after Attempted Assassination by Police\n\nFarmers‘ protests against globalist Great Reset food policies spread to Germany, Italy, Poland and Spain. 16-year-old farmer’s son Jouke Hospes, who was shot at by police Tuesday evening despite having turned his tractor away from the police roadblock (Gateway reported) said: “I can’t believe they shot at me!“\n\n📌JAPAN SUSPECT INFO Suspect held grudge against organisation he believed Abe was connected to: Japanese police INSIDER PAPER The suspected killer of Japan’s former prime minister Shinzo Abe admitted targeting him and said he held a grudge against an organisation he believed the politician was connected to, police said Friday.\n\n“The suspect stated that he held a grudge against a particular organization, and that he committed the crime because he believed former prime minister Abe had a connection to it,” a senior police officer in Japan’s Nara region told reporters, declining to give further details.\n\n📌AUSTRALIA Sky News Australia Host Compares Trudeau to Netherlands PM Mark Rutte – Calls them “Golden Pin-Up Boys for Klaus Schwab” THE GATEWAY PUNDIT Justin Trudeau and Mark Rutte, the “golden pin-up boys for Klaus Schwab” As The Gateway Pundit reported earlier farmer protests are breaking out across Europe due to rising prices on raw materials, arrogant leadership, and burdensome government regulations that are destroying the farming community. Farmer protests continued in The Netherlands on Thursday. And now the movement is spreading.\n\n📌FINANCIAL/JUST IN – Uniper applies for state aid. Germany’s largest natural gas trader is on the verge of bankruptcy. DISCLOSE TV\n\nRussia on Friday vetoed a UN Security Council resolution that would have extended cross-border aid to Syria by one year without Damascus’s backing.\n\nFormer McDonald’s restaurants in Russia are facing a shortage of French fries due to a poor harvest and Western sanctions over Ukraine, a business newspaper reported on Friday.\n\nThe West’s plan to isolate Russia at the G20 summit over Russia’s military offensive in Ukraine did not work out, the foreign ministry said.\n\nGerman Foreign Minister Annalena Baerbock criticised Moscow as being opposed to dialogue with international partners after diplomats said Russian Foreign Minister Sergei Lavrov walked out of her speech to a Group of 20 meeting on Friday.\n\n📌RUSSIA/G20 Lavrov walks out of G20 talks as West presses Moscow on Ukraine\n\nRussia’s top diplomat stormed out of talks with G20 foreign ministers meeting in Indonesia on Friday as Western powers criticized Moscow.\n\nThe Kremlin on Friday said it was saddened by the death of Japan’s former prime minister Shinzo Abe and hailed him as a “patriot.”\n\n📌US occupation troops steal new batch of Syrian oil THE CRADLE\n\nUS troops and their proxy militia in northern Syria – the Syrian Democratic Forces (SDF) – are in control of most of the oil fields in Hasakah and Deir Ezzor governorates, and have been regularly smuggling Syrian oil out of the country to sell it abroad.\n\nThe occupation troops have also been accused of stealing the country’s wheat supplies.\n\nOn 18 June, a convoy of 40 trucks filled with Syrian wheat from the Al-Jazeera region was smuggled into US military bases in Iraq.\n\n📌UPDATE Japan’s former PM Shinzo Abe ‘has died’ after being shot twice by navy veteran during campaign speech, local TV says DAILY MAIL\n\n🔅Died After Being Shot Twice\n\nThe 67-year-old, who served for a total of nine years over two terms, was gunned down in the city of Nara around 11.30am as he rallied support for the local candidate ahead of parliamentary elections on Sunday. His death was reported by public broadcaster NHK around six hours later, shortly after wife Akie arrived at his bedside.\n\nPhoto of the suspect Tetsuya Yamagami who shot Japanese former PM Shinzo Abe. The weapon looks like a custom sawed-off shotgun.\n\n📌Shinzo Abe, Japan’s former prime minister, assassinated at a campaign stop | Reuters\n\nNARA, Japan, July 8 (Reuters) – Former Prime Minister Shinzo Abe, the longest-serving leader of modern Japan, was gunned down on Friday while campaigning for a parliamentary election, shocking a country where guns are tightly controlled and political violence almost unthinkable.\n\nFormer Japanese Prime Minister Shinzo Abe has been assassinated. He led the working meetings with Taiwan (China threatened it) and openly and directly told Putin that he started the war against Ukraine. According to multiple news outlets, former Japanese Prime Minister Shinzo Abe was attacked earlier today and left critically wounded. Shinzo Abe was transported to an undisclosed hospital where he succumbed to his injuries.\n\n📌URUGUAY/COV19 Uruguayan Judge Suspends COVID Vaccination for Children Under 13 Until Certain “Conditions” Are Met THE GATEWAY PUNDIT According to a recent ruling by an Uruguayan judge, the government and the pharmaceutical company Pfizer must provide all the information they have on the COVID vaccine’s biochemical composition, including any evidence of “graphene oxide” or “nanotechnological elements,” as well as proof of the vaccine’s efficacy and safety.\n\nAdministrative Litigation Court (TCA) Judge Alejandro Recarey made the order in response to a request to suspend the immunization of children in Uruguay.\n\n📌China Brags About Giving Taliban $37 Million – They’ve Got Nothing on the $84 Billion Joe Biden Surrendered to the Terrorist Regime THE GATEWAY PUNDIT China is bragging about giving the terrorist organization, the Taliban, in Afghanistan $37 million. But this is only a tiny fraction of the $84 billion Biden surrendered to the Taliban. China reported today that they had given the Taliban $37 million to help the terrorist regime stay in power: China’s Ambassador to the Taliban Wang Yu announced on Tuesday that the Communist Party had invested $37.4 million in the success of the jihadist terrorist government since it took power in August.\n\n📌European energy crisis has boiled over — things on the continent are about to change, rapidly and more absolutely than most can imagine:\n\n– Germany: is restricting when and how energy companies can declare force majeure;\n\n– France: has just nationalized the nation’s largest energy company, EDF;\n\n– UK: announced they, too, would simply cut off natgas to the EU when supply is short (as the entire cabinet resigns);\n\n– The EU has decided that nuclear and natural gas energy are “green” after all, a semantic change which only marginally lengthens the runway for their ‘decarbonization transition’\n\nBerlin plans to limit claims of “force majeure” in bid to stabilize energy markets\n\nFollowing reduced gas flows from Russia, German energy companies are struggling under the strain of record energy prices, prompting the German government to tighten its hold on the market.\n\nNWO major moves that signal of what is ahead… brace for impact, my friends.\n\nBritish Conservative Rishi Sunak, whose resignation from Prime Minister Boris Johnson’s cabinet helped spark an exodus of other ministers, on Friday declared his candidacy to become the party’s next leader.\n\nThis is a developing story.. check back for more updates.\n\n📌Boris Johnson sacks Michael Gove – one of the first serving cabinet members to wield the knife DISCLOSE TV JUST IN – Boris bites back: PM Johnson has sacked Cabinet Minister Michael Gove.\n\nJUST IN – Boris Johnson’s newly-appointed chancellor Nadhim Zahawi calls on the prime minister to resign.\n\nSUELLA BRAVERMAN called for Boris Johnson to step down as the Prime Minister yesterday but has been slammed as “f*ing useless”, as she became the first Tory to launch a party leadership bid. Could Suella Braverman replace Boris Johnson?\n\n📌UK Tom Tugendhat: First candidate launches leadership bid after Boris Johnson exit INSIDER PAPER British Conservative MP Tom Tugendhat said late Thursday he was launching his bid to succeed Boris Johnson, the first candidate to announce their campaign since the premier announced his resignation.\n\nJoe Biden will hold talks with Saudi Arabia’s controversial Crown Prince Mohammed bin Salman — but only as part of a larger delegation — when the US president visits the oil-rich nation next week, the White House said Thursday.\n\n“The president will sit down in a bilateral meeting with King Salman and his leadership team. As you know, the crown prince is on that leadership team,” John Kirby, National Security Council spokesman at the White House, told reporters.\n\n📌Russian Officials Threaten To Reclaim Alaska After US Sanctions By Biden THE GATEWAY PUNDIT This week Russian officials warned that Russia might seek to reclaim Alaska from the United States in retaliation for Biden’s continued sanctions related to the invasion of Ukraine.\n\nOn Wednesday, during a parliamentary session in Moscow, Vyacheslav Volodin, the speaker of the State Duma, cautioned the U.S. to think twice before seizing or freezing Russian assets abroad. The top Russian official reminded the U.S. that Alaska once belonged to Russia, and the Kremlin may want the land back.\n\n📌THIS COULD BE THE END OF THE BIDENS Hunter Biden Has Come Under Federal Surveillance: ‘Threat To National Security’ CONSERVATIVE BRIEF Hunter Biden, the son of President Joe Biden, has come under the scrutiny of federal surveillance for some of his activity with communist China figures, a report claimed.\n\n“US counterintelligence officials tell me Hunter Biden has come under federal surveillance amid growing concerns his partnerships with CCP-tied figures–notably Che Feng, aka ‘Super Chairman’–could ‘compromise’ the president or help Beijing gather US intel thru Hunter,” reporter Paul Sperry said.\n\n📌Both Bidens Caught: Joe Sold 950,000 Barrels of US Oil to Chinese Company Hunter Has Big Tie To THE WESTERN JOURNAL How is it possible for the media to continue to ignore the growing evidence of the Biden family’s influence-peddling schemes?\n\n📌UNBELIEVABLE Biden Is Handing Out Crack Pipes Across From A NYC Preschool Filled With 3 And 4 Year Old Children THE GATEWAY PUNDIT Now a new report by the Daily Caller found that Biden-funded crack pipes are being handed out at a clinic in New York City right across the street from a preschool.\n\nThe New York Harm Reduction Educators clinic (NYHRE) is located at Park and 126th in East Harlem. The clinic was awarded $400,000 in grants from the Biden administration to provide services to drug addicts in the area, including a safe injection site, and clean equipment.\n\n📌OIL Joe Biden Sold a Million Barrels of Oil from US Reserves to China Company Connected to Hunter Biden THE GATEWAY PUNDIT Hunter Biden wouldn’t have a dime if his dad wasn’t a corrupt politician. TGP has reported extensively on Hunter Biden’s corrupt dealings in China and today there is more. Breitbart reported on Thursday:\n\nPresident Joe Biden’s administration sold 950,000 barrels of oil from the U.S. Strategic Petroleum Reserve to a Chinese state-owned gas company that has financial ties to a private equity firm cofounded by Hunter Biden, according to a Washington Free Beacon report.\n\n📌MEDAL REMARKS/MCCAIN More Lies: Joe Biden Claims He Has “Never Said a Negative Thing” About John McCain in His Life (VIDEO) THE GATEWAY PUNDIT\n\nJoe Biden on Thursday awarded the Presidential Medal of Freedom to 17 recipients – including America-hating soccer star Megan Rapinoe and late Senator John McCain. Biden delivered remarks in the East Room of the White House during the ceremony.\n\nJoe Biden falsely claimed he “never said a negative thing” about John McCain in his life.\n\n📌ABORTION Biden Set To Sign Executive Order On Abortion Friday THE GATEWAY PUNDIT\n\nJoe Biden is expected to sign a highly anticipated executive order the White House is promising will protect access to reproductive healthcare services, including abortion and contraception, two weeks after the reversal of Roe V Wade. It is Biden’s first-ever move to protect the killing of unborn babies.\n\n📌Getting Rid of Joe Biden–Possible Scenarios THE GATEWAY PUNDIT With the U.K.’s Prime Minister, Boris Johnson, headed for the exits, it is worth exploring whether or not Joe Biden will last his term or be forced into retirement. With growing expectations that the Republicans will sweep the House of Representatives and take back the U.S. Senate, I believe it is worth exploring whether Democrats want to cut their losses before the election and dump Biden or will they encourage him to resign before the Republican-controlled legislative bodies take control in January.\n\nJUST IN – Biden’s communications director Kate Bedingfield to step down, White House officials tell the WSJ.\n\nBedingfield was Biden’s trusted aide since his time as Obama’s vice president and the brain of the 2020 campaign. DISCLOSE TV\n\n📌MONEY TRANSFERS CONFIRMED IN AUDIOS/HUNTER’S LAPTOP Hunter Biden Seen Smoking, Drinking & Fondling Himself In Shocking Newly Leaked Video Footage RADAR ONLINE A newly leaked video shows Hunter Biden smoking, drinking and touching himself in a deprivation tank days after asking Joe Biden for money for a detox program.\n\n📌FATHER & SON BEING ‘COVERED’? Republicans Rail Against Treasury Dept For Allegedly Adding Rule To Cover For Hunter Biden | THE DAILY CALLER House Overseers have railed against the Treasury Department, citing a new rule for Suspicious Activity Reports to protect contents from Hunter Bidens laptop.\n\n📌Biden Sold a Million Barrels From US Strategic Petroleum Reserve to China-Owned Gas Giant THE WASHINGTON FREE BEACON The Biden administration sold roughly one million barrels from the Strategic Petroleum Reserve to a Chinese state-controlled gas giant that continues to purchase Russian oil, a move the Energy Department said would “support American consumers” and combat “Putin’s price hike.”\n\n📌TREASURY/FRAUD Treasury faces mounting scrutiny for giving Hunter Biden ‘cover’ with new rule for document requests | FOX NEWS House Oversight Committee ranking member James Comer, R-Ky., blasted the Treasury Department over its new majority support rule to obtain Hunter Biden’s Suspicious Activity Reports.\n\n📌Biden admin blocking federal audit of US taxpayer funds still going to Afghanistan, auditor says | American Military News AMERICAN MILITARY NEWS U.S. taxpayer dollars are still flowing to Afghanistan nearly a year after the U.S.-backed Afghan government collapsed and the U.S. State Department and the United States Agency for International Development (USAID) have refused to tell a federal auditor where the money is now going.\n\n📌WH Norman Rockwell Series Has Graced White House Walls for Decades – Now the Spot Is Dedicated to Biden THE WESTERN JOURNAL Replacing Rockwell’s works with Biden’s face sums up his presidency – a decrepit old man sucking all the wholesome goodness out of America.\n\n📌Many Within Biden’s Own Administration Are ‘Frustrated’ by His Attempts to Tackle Inflation, Fear He Could Make Things Worse: Report THE WESTERN JOURNAL Many progressives hold the view that ‘inflation is likely to ease on its own without severe rate hikes,’ according to a Politico report.\n\n📌Hunter Joins Daddy Joe at White House After Regime Spox Refuses to Comment on Evidence Joe Biden Lied About Discussing Business Dealings with Son THE GATEWAY PUNDIT They’re just mocking us at this point.\n\nHunter Biden joined daddy Joe at the White House on Thursday for an award ceremony.\n\n📌Biden DOJ Launches Civil Rights Investigation Into Texas’ Efforts To Secure The Border: REPORT | THE DAILY CALLER\n\nThe Department of Justice (DOJ) is investigating Texas Gov. Greg Abbott’s border security initiative following reports of enforcement and personnel issues associated with the effort, according to ProPublica and The Texas Tribune, citing state records.\n\nThe Best Kept SECRET on Social Media is OUT…\n\nBring us your vaxed, your unvaxed, your straight and your gay.\n\nBring us your lost, your found, your night and your day.\n\nBring us your young, your old, your left and your right.\n\nBring us your tan, your brown, your black and your white.\n\nWe want our secret out… ’cause EVERYONE MATTERS in the ADN Community.", "opengraph": {"title": "AMERICAN DIGITAL NEWS 7/8/22 LINEUPS", "description": "   ADN COMMUNITY 🔷 #ADNistheNewsNOW 🔷 ADN VOICE CHAT  \n\n\n\n\n\n\n\nCREDITS FOR TODAY'S LINEUP:\n\n\n\n\nPamela (ADN Executive Producer)Rosie (ADN Exe", "image": "https://lh5.googleusercontent.com/FCiHlN-biOzh5XCkeharEW6IdCnirg2Fzya_kW8sksxs7ISkWK7Or-LQS05ILiuj1TiUype11f5TPBcjucRyYqgutkmAjg8K-Wygw3JFm4wL4OuYXwghK25j7g4l2iV2VhUQROKfaNf0-29fEyc", "image:width": "1024", "image:height": "1024", "image:type": "image/png", "type": "article", "article:published_time": "2022-07-08T20:50:52+00:00", "article:modified_time": "2022-07-12T00:57:29+00:00", "url": "https://americandigitalnews.com/index.php/2022/07/08/american-digital-news-7-8-22-lineups/", "site_name": "American Digital News"}, "tags": ["Swamp", "ADN News", "United States", "World", "White House"], "tweets": [], "movies": [], "links": ["https://t.me/AmericanDigitalNews", "https://t.me/AmericanDigitalNews?videochat=c9a53adf40b4ef8d1b", "https://t.me/ADNMEDIACHANNEL/551", "https://t.me/ADNMEDIACHANNEL/550", "https://t.me/ADNMEDIACHANNEL/554", "https://t.me/ADNMEDIACHANNEL/553", "https://t.me/ADNMEDIACHANNEL/552", "https://www.grunge.com/919683/can-a-sitting-us-president-go-to-jail/", "https://www.foxnews.com/world/shinzo-abe-dead-japan-longest-serving-prime-minister-conservative-kingmaker-strengthened-us-ties", "https://www.audacy.com/connectingvets/defense/us-navy-supports-uk-seizure-of-iranian-missiles", "https://www.thegatewaypundit.com/2022/07/army-mandatory-training-requires-soldiers-shower-transgender-people-opposite-sex-accept-primitive-work-conditions/", "https://www.alternet.org/2022/07/jan-6-hearings-2657617784/", "https://thehill.com/homenews/house/3544336-cassidy-hutchinson-testimony-prompts-reassessment-of-trump-legal-culpability/", "https://conservativebrief.com/cheney-11-64339/", "https://www.cnn.com/2022/06/13/politics/thompson-january-6-trump-criminal-referral-justice-department/index.html", "https://www.westernjournal.com/bombshell-report-reveals-77-2b-improperly-paid-unemployment-2021/?utm_source=social&utm_medium=tgm&utm_campaign=tgm&utm_content=can", "https://www.euractiv.com/section/energy/news/berlin-plans-to-limit-claims-of-force-majeure-in-bid-to-stabilise-energy-markets/", "https://www.wsj.com/articles/france-to-nationalize-energy-giant-edf-to-help-it-combat-europes-energy-crisis-11657119239", "https://www.ft.com/content/175ef927-efa2-439e-8ede-1dfc7edd23a6?sharetype=blocked", "https://www.msn.com/en-us/money/markets/europe-will-count-natural-gas-and-nuclear-as-green-energy-in-some-circumstances/ar-AAZhoJM", "https://www.dailysignal.com/2022/07/07/i-know-clarence-thomas-hillary-clinton-lied-about-him/", "https://www.redvoicemedia.com/2022/07/3-women-go-berserk-over-a-1-75-extra-sauce-charge-trash-a-nyc-restaurant-in-viral-video/", "https://www.westernjournal.com/9000-pound-hummer-ev-pollutes-gas-powered-chevy-malibu/?utm_source=social&utm_medium=tgm&utm_campaign=tgm&utm_content=can", "https://theconservativetreehouse.com/blog/2022/07/07/facing-public-backlash-manhattan-da-lowers-bail-for-61-year-old-convenience-store-clerk-jose-alba-in-clear-self-defense-case/", "https://nypost.com/2022/07/05/video-shows-nyc-bodega-worker-allegedly-stabbing-man-to-death/", "https://rumble.com/v1bfp31-nyc-bodega-stabbing-bodega-employee-charged-with-murder-after-stabbing-atta.html", "https://justthenews.com/government/courts-law/heritage-foundation-sues-dhs-documents-monitoring-social-media", "https://freebeacon.com/national-security/biden-sold-a-million-barrels-from-us-strategic-petroleum-reserve-to-china-owned-gas-giant/", "https://www.thegatewaypundit.com/2022/07/wth-munich-researchers-claim-intense-exercise-can-increase-risk-catching-covid-19/", "https://www.pnas.org/doi/full/10.1073/pnas.2202521119#sec-2", "https://insiderpaper.com/french-health-authority-urges-wider-monkeypox-vaccination/", "https://insiderpaper.com/who-to-reconvene-monkeypox-emergency-committee-week-of-july-18-at-latest/", "https://www.smartnews.com/p/4435976042435324703", "https://www.thegatewaypundit.com/2022/07/canada-destroy-13-6-million-doses-astrazeneca-covid-19-vaccine-no-one-wants-domestically-abroad/", "https://conservativebrief.com/gop-19-64312/", "https://slaynews.com/news/gop-senator-brings-anthony-fauci-to-heel-cancels-taxpayer-funded-1-8m-drug-testing-on-beagle-puppies/", "https://resistthemainstream.org/watch-even-cnn-correspondent-cant-hide-reality-of-sky-high-inflation/?utm_source=telegram", "https://www.theblaze.com/news/rahel-solomon-lays-bare-inflation-crisis", "https://nypost.com/2022/07/07/biden-dhs-closing-gap-in-border-wall-trump-wanted-filled-in/", "https://babylonbee.com/news/first-12-things-trump-will-do-when-he-returns-to-power/", "https://rumble.com/v1bfuun-backfire-ny-times-journo-gets-owned-for-ten-minutes-straight.html", "https://twitter.com/ElectionWiz/status/1544851211882577922?s=20&t=70_MHUjb7xknj8ing6rXKw", "https://twitter.com/ABC/status/1545128404462309377?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1545128404462309377%7Ctwgr%5E%7Ctwcon%5Es1_c10&ref_url=https%3A%2F%2Fwww.thegatewaypundit.com%2F2022%2F07%2Flies-joe-biden-claims-never-said-negative-thing-john-mccain-life-video%2F", "https://t.me/AmericanDigitalNewsChannel/2649", "https://resistthemainstream.org/democrat-charged-with-reckless-use-of-a-firearm/?utm_source=telegram", "https://insiderpaper.com/us-announces-more-himars-precision-rocket-systems-for-ukraine/", "https://insiderpaper.com/lavrov-walks-out-of-g20-talks-as-west-presses-moscow-on-ukraine/", "https://insiderpaper.com/sri-lanka-on-alert-ahead-of-anti-government-rally/", "https://insiderpaper.com/sri-lankan-president-asks-putin-to-assist-in-buying-fuel/", "https://insiderpaper.com/greece-bulgaria-open-new-pipeline-alternative-to-russian-gas/", "https://insiderpaper.com/russian-fm-says-wont-go-running-after-us-for-talks-at-g20/", "https://www.thegatewaypundit.com/2022/07/dead-now-want-know-shot-dutch-farmer-boy-jouke-speaks-displays-bullet-holes-tractor-attempted-assassination-police/", "https://www.thegatewaypundit.com/2022/07/dutch-farmer-protest-update-16-year-old-jouke-freed-document-reveals-government-plans-confiscate-farms-asylum-seekers/", "https://insiderpaper.com/suspect-held-grudge-against-organisation-he-believed-abe-was-connected-to-japanese-police/", "https://insiderpaper.com/kremlin-hails-japans-former-pm-shinzo-abe-as-patriot/", "https://www.thegatewaypundit.com/2022/07/sky-news-australia-host-compares-trudeau-netherlands-pm-mark-rutte-calls-golden-pin-boys-klaus-schwab-video/", "https://insiderpaper.com/russia-vetoes-un-resolution-extending-cross-border-aid-to-syria/", "https://insiderpaper.com/texas-governor-authorizes-state-police-to-return-migrants-to-border/", "https://insiderpaper.com/russian-mcdonalds-runs-short-of-french-fries/", "https://insiderpaper.com/lavrov-walks-out-of-g20-talks-as-west-presses-moscow-on-ukraine/", "https://insiderpaper.com/western-plan-to-isolate-russia-at-g20-failed-moscow/", "https://insiderpaper.com/german-fm-says-russia-not-interested-in-g20-dialogue/", "https://insiderpaper.com/lavrov-says-new-iron-curtain-descending-between-russia-and-west/", "https://insiderpaper.com/lavrov-walks-out-of-g20-talks-as-west-presses-moscow-on-ukraine/", "https://insiderpaper.com/kremlin-hails-japans-former-pm-shinzo-abe-as-patriot/", "https://thecradle.co/Article/news/12749", "https://www.dailymail.co.uk/news/article-10993735/Former-Japanese-Prime-Minister-Shinzo-Abe-shot-speech.html", "https://twitter.com/Global_Mil_Info/status/1545249495398719488?s=20&t=9LfjhIOri3HYQRFUrB0UOA", "https://www.reuters.com/world/asia-pacific/japan-ex-prime-minister-abe-may-have-been-shot-taken-hospital-nhk-2022-07-08/", "https://snbc13.com/shinzo-abe-shooting-former-japan-prime-minister-killed-in-armed-attack-today/", "https://www.thegatewaypundit.com/2022/07/update-uruguayan-judge-suspends-covid-vaccination-children-13-conditions-met/", "https://www.thegatewaypundit.com/2022/07/china-brags-giving-taliban-37-million-got-nothing-84-billion-joe-biden-surrendered-terrorist-regime/", "https://www.euractiv.com/section/energy/news/berlin-plans-to-limit-claims-of-force-majeure-in-bid-to-stabilise-energy-markets/", "https://www.wsj.com/articles/france-to-nationalize-energy-giant-edf-to-help-it-combat-europes-energy-crisis-11657119239", "https://www.ft.com/content/175ef927-efa2-439e-8ede-1dfc7edd23a6?sharetype=blocked", "https://www.msn.com/en-us/money/markets/europe-will-count-natural-gas-and-nuclear-as-green-energy-in-some-circumstances/ar-AAZhoJM", "https://insiderpaper.com/uks-ex-finance-minister-sunak-announces-bid-to-succeed-johnson/", "https://insiderpaper.com/first-candidate-to-succeed-boris-johnson-launches-party-leadership-bid/", "http://news.sky.com/story/boris-johnson-has-sacked-michael-gove-12647186", "https://www.express.co.uk/news/politics/1636892/Suella-Braverman-conservative-leadership-next-prime-minister-evg", "https://insiderpaper.com/first-candidate-to-succeed-boris-johnson-launches-party-leadership-bid/", "https://insiderpaper.com/biden-to-meet-mbs-in-saudi-bilateral-talks-white-house/", "https://insiderpaper.com/biden-to-visit-mideast-meet-saudi-leader-crown-prince-salman/", "https://www.thegatewaypundit.com/2022/07/russian-officials-threaten-reclaim-alaska-u-s-sanctions-biden/", "https://conservativebrief.com/hunter-2-64333/", "https://www.westernjournal.com/bidens-caught-joe-sold-950000-barrels-us-oil-chinese-company-hunter-big-tie/?utm_source=social&utm_medium=tgm&utm_campaign=tgm&utm_content=can", "https://www.thegatewaypundit.com/2022/07/biden-handing-crack-pipes-across-nyc-preschool-filled-3-4-year-old-children/", "https://dailycaller.com/2022/07/07/harm-reduction-grant-biden-crack-pipes-heroin-drugs/", "https://nyhre.org/", "https://nypost.com/2021/11/30/de-blasio-opening-supervised-injection-sites-for-drug-users-in-nyc/", "https://www.thegatewaypundit.com/2022/07/joe-biden-sold-million-barrels-oil-us-reserves-china-company-connected-hunter-biden/", "https://freebeacon.com/national-security/biden-sold-a-million-barrels-from-us-strategic-petroleum-reserve-to-china-owned-gas-giant/", "https://www.thegatewaypundit.com/2022/07/lies-joe-biden-claims-never-said-negative-thing-john-mccain-life-video/", "https://www.thegatewaypundit.com/2022/07/biden-set-sign-executive-order-abortion-friday/", "https://www.npr.org/2022/06/24/1102305878/supreme-court-abortion-roe-v-wade-decision-overturn", "https://www.thegatewaypundit.com/2022/07/getting-rid-joe-biden-possible-scenarios/", "https://radaronline.com/p/hunter-biden-smoking-drinking-touching-himself-newly-leaked-video/", "https://dailycaller.com/2022/07/07/james-comer-treasury-rule-hunter-biden/", "https://freebeacon.com/national-security/biden-sold-a-million-barrels-from-us-strategic-petroleum-reserve-to-china-owned-gas-giant/", "https://www.foxnews.com/politics/treasury-faces-mounting-scrutiny-giving-hunter-biden-cover-document-requests", "https://americanmilitarynews.com/2022/07/biden-admin-blocking-federal-audit-of-us-taxpayer-funds-still-going-to-afghanistan-auditor-says/", "https://www.westernjournal.com/norman-rockwell-series-graced-white-house-walls-decades-now-spot-dedicated-biden/?utm_source=social&utm_medium=tgm&utm_campaign=tgm&utm_content=can", "https://www.westernjournal.com/many-within-bidens-administration-frustrated-attempts-tackle-inflation-fear-make-things-worse-report/?utm_source=social&utm_medium=tgm&utm_campaign=tgm&utm_content=can", "https://www.thegatewaypundit.com/2022/07/hunter-joins-daddy-joe-white-house-regime-spox-refuses-comment-evidence-joe-biden-lied-discussing-business-dealings-son/", "https://dailycaller.com/2022/07/07/border-texas-doj-biden/", "https://t.me/AmericanDigitalNewsChannel/2649"], "authors": ["Ami Tiel"], "publish_date": "2022-07-08T20:50:52+00:00"}