{"result_id": "022013", "URL": "https://americandigitalnews.com/index.php/2019/06/01/lower-moreland-township-and-its-elite-alumni-part-1/", "timestamp": "2023-04-25 12:00:13 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://americandigitalnews.com/wp-content/uploads/ADN-red-favacon.jpg", "canonical": "https://americandigitalnews.com/index.php/2019/06/01/lower-moreland-township-and-its-elite-alumni-part-1/", "encoding": "UTF-8"}, "image": null, "domain": "americandigitalnews.com", "title": "Lower Moreland Township and Its’ Elite Alumni Part 1", "cleaned_text": "Lower Moreland Township, Montgomery County, Pennsylvania;\n\n A roughly 7 square mile nondescript town of about 13,000 on the outskirts of Philadelphia. Rosenstein/Smalls, I can only assume. R/S Financial, Robert and Miriam.\n\nLike most small towns, it has a High School; Lower Moreland Township High School- 555 Red Lion Road.\n\n Right around 750 students in grades 9-12.\n\n (Odd that it’s Red Lion Road, red isn’t one of the school colors)\n\nYou’re probably wondering where I’m going with this. Honestly- I can’t even describe how weird this is, I wasn’t looking for ANY of this, I simply noticed a pattern of dots to connect here, and started digging.\n\n Have a look at this…⬇️ Dr. BARRY LEFER- Tropospheric Composition Program Manager, NASA. He conducts research on climate, ozone, pollution, and Geochemistry for NASA.\n\n\n\n LOWER MORELAND TOWNSHIP HIGH SCHOOL, CLASS OF 1985.\n\nLt. Col Ilean Keltz, PhD.- Joint Staff/J-8/MASO. The J8 directorate develops capabilities, studies, analysis, and assessments for the Chairman of the Joint Chiefs of Staff. West Point, Old Dominion, George Mason. (Adelman).\n\n\n\n LOWER MORELAND TOWNSHIP HIGH SCHOOL, CLASS OF 1984.\n\nVALERIE PLAME- Writer, spy novelist, and covert operations officer at the Central Intelligence Agency. A central figure in the Scooter Libby ordeal, Clinton supporter, and possible Senate candidate in New Mexico.\n\n \n\n LOWER MORELAND TOWNSHIP HIGH, CLASS OF 1981.\n\nNANCY MESSONIER, M.D.- Acting Director of the Center for Preparedness and Response, CDC.\n\n You may know her as Nancy Rosenstein, Deputy Attorney General Rod Rosenstein’s sister.\n\n\n\n LOWER MORELAND TOWNSHIP HIGH SCHOOL CLASS OF 1983.\n\nDEPUTY ATTORNEY GENERAL ROD ROSENSTEIN- (no credentials necessary at this point, I’d think.)\n\n\n\n LOWER MORELAND TOWNSHIP HIGH SCHOOL CLASS OF 1982.\n\nLet’s get it out in the open- how in the blue Hell did a high school in a town of 13 thousand people crank out a covert CIA operative, a director of the CDC, a NASA climate program director, a Lt. Col at the Pentagon, and a deputy Attorney General ALL between 1981 and 1985? As luck would have it, I grew up in a town that EXACT same size. I have an amazing reference point here. This is not possible. \n\n All time alumni? Maybe, could be possible, I guess.\n\n Within 5 years, consecutively? No.\n\n I wiki’d my own high school famous alumni… I got a late 90s Playmate, a woman who was on a season of Survivor, and a cable tv host.\n\n And that’s ALL TIME-\n\n The ENTIRE history of my school, nevermind a 5 year slice. In fact, in a school/town that size, there’s no way they didn’t know each other, even if not closely. In just a 5 year span, Lower Moreland Township High School produced individuals who infiltrated the upper echelons of DoD, CDC, C_A, NASA, and DOJ.\n\n I can’t put it any simpler than that.\n\n And as far as I can tell, Rosenstein’s resignation aside, they’re all active. So what are we looking at Here?\n\n Is it a nest? A hive? An enclave? A recruiting ground? \n\n You might get a run like that from an elite college program, but this is a High School in a 7 square mile patch of Pennsylvania. But wait- there’s more, yet.\n\n Some additional notes- In the Lt. Col Keltz tweet earlier, I put Adelson in parentheses to highlight that he and Keltz worked on research projects together at George Mason University.\n\n Pics related\n\n Adelson—–> MITRE Corporation.\n\nThis dig was started on Rod Rosenstein. Naturally, on a dig like this going back into a person’s history, the parents get a look as well.\n\n Let’s look at Rod’s.\n\n His father, specifically, Robert J Rosenstein.\n\nWhen you search for Robert J Rosenstein, the bulk of the results will be a near verbatim variation of this sentiment, taken from multiple variations of a quote by Rod himself (father- small business owner, mother- bookkeeper, school board- it’s like he’s shilling his own life)\n\nNote the DOJ link date. June, 2018.\n\n He’s been shilling the humble parents since 2017, numerous times. It is the only real mention he makes of his parent’s professions. In this statement, he also mentions Miriam Smalls, partner of Robert in the “small business”.\n\nRosenstein/Smalls, I can only assume. R/S Financial, Robert and Miriam.\n\nRobert J Rosenstein and Miriam Smalls have more than a small business, they have several.\n\n National Mortgage Network is in Georgia, but was dissolved one minute after filed.\n\n Environmental Science and Technologies even shares the same address as R/S Financial.\n\nThe only documentation I could dig up on R/S were some court docs where they were co defendants with a man (also their attorney) named Richard Sprague in Philadelphia in the early 2000’s.\n\nRichard Sprague (Robert Rosenstein’s attorney/ co defendant) is not ONE OF the most connected and sleazy lawyers in Philadelphia, he is the most feared by far. He represents Democrat filth. Vince Fumo and Kathleen Kane, for example. His reputation is well known.\n\nNow figure this one out- Robert Rosenstein’s “small business” lawyer is not only the biggest shark in Philly for the last 50 years, but in 1977 Richard Sprague was appointed Chief Counsel of the newly formed House Select Committee on Assassinations.\n\nSprague has quite the history in Philadelphia, and the resume to match. From the Sprague & Sprague home site ⬇️\n\nHere is a Sprague & Sprague client list.\n\n Wait for it…\n\nWe’ve connected\n\n C_A\n\n CDC \n\n DoD\n\n DoJ \n\n NASA\n\n MITRE Corp\n\n Climate science\n\n Vaccines\n\n Pentagon/Joint Chiefs\n\n Philadelphia corruption\n\n House Committee on Assassinations \n\n And we did it all through a high school in a little suburb of Philadelphia called \n\n Lower Moreland Township.", "opengraph": {"title": "Lower Moreland Township and Its’ Elite Alumni Part 1", "description": "Eye opening re: Rosenstein's high school and many graduates from that school in a 5 year period that are serving in high places inside our Gov!  Highly unusual. Research by MindFuror", "image": "https://americandigitalnews.com/wp-content/uploads/Mind-Furor-Cover-1.jpg", "image:width": "431", "image:height": "453", "type": "article", "article:published_time": "2019-06-01T14:21:23+00:00", "article:modified_time": "2019-06-01T14:28:17+00:00", "url": "https://americandigitalnews.com/index.php/2019/06/01/lower-moreland-township-and-its-elite-alumni-part-1/", "site_name": "American Digital News", "image:type": "image/jpeg"}, "tags": ["ADN News"], "tweets": [], "movies": [], "links": ["https://twitter.com/MindFuror/status/1123974165025972231", "https://threadreaderapp.com/thread/1123974165025972231.html?fbclid=IwAR2U7OshXM4IUm3Aia7vSpNouDIzrPmQow85H5vwDr2os0BasMOtN2e6yo0", "https://www.spragueandsprague.com/ATTY/RAS.html"], "authors": ["Ami Tiel"], "publish_date": "2019-06-01T14:21:23+00:00"}