{"result_id": "022015", "URL": "https://americandigitalnews.com/index.php/2019/01/13/pets-vaccines-bigpharma/", "timestamp": "2023-04-25 12:00:14 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://americandigitalnews.com/wp-content/uploads/ADN-red-favacon.jpg", "canonical": "https://americandigitalnews.com/index.php/2019/01/13/pets-vaccines-bigpharma/", "encoding": "UTF-8"}, "image": null, "domain": "americandigitalnews.com", "title": "Pets, Vaccines & BigPharma", "cleaned_text": "As you very well know……Donna Ziccardi has done a lot of research on VACCINES for both Humans and our beloved PETS!!! So it should come as NO Surprise that VACCINES are harming and killing our pets as well……\n\nThe reason why I think scientists and politicians are either stupid or evil or BOTH…….there are many reasons……one I will state below.\n\nResponsible Vets and Immunologists are studying the adverse effects of over vaccinating our beloved pets and the detrimental effects the ingredients in vaccines have on the lives of our pets.\n\nThese immunologist researchers are FINDING that the long term effects of the Rabies Shot leads to Diabetes in dogs and cats.\n\nAT THE SAME TIME……I read this statistic and statement……Diabetes rates in cats and especially dogs are rising at an alarming rate in the U.S.\n\nDo you THINK one person would put the 2 together and say…..repeated use of the rabies shot can cause diabetes???!!!…..and THEN if that is not smart enough……. link the above facts with the science that the VMA and BigPharma will not accept……after the puppy gets his initial rabies shot and subsequent BOOSTER…….NO MORE RABIES SHOTS ARE NEEDED!!!………\n\n……..why????…….BECAUSE the body has MEMORY CELLS that will immune the pet for Rabies FOREVER!!!……..\n\nCan people PLEASE start using their cognitive skills and STOP believing what the “authorities” are telling you???!!!………\n\nPeople need to realize this. Not only are the vets torturing the pets needlessly. The Pet owners are spending a lot of NEEDLESS money trying to alieve the pain and suffering of these needless side affects.\n\nFrom researching this subject…..I am starting to believe the VMA and bigPharma are using our pets at the vets for animals experiments. Experimenting on animals that would not ordinarily get away with if they did this to animals in a laboratory.\n\nTITER TESTING IS THE BEST WAY TO PREVENT OVER VACCINATION IN DOGS AND CATS………\n\nTiter Tests indicates if a pet is immune to a specific disease. Take for example, Rabies. If the test is positive the pet is protected….but State law require the Rabies Vaccine every three years whether the dog has positive immunity or not. This will expose your pet to unnecessary mercury and other toxins in vaccines……and injure the pet’s immune system by challenging it when in fact the pet is protected in the first place.\n\nWhy do states refuse to recognize the Titer Tests??? …..from my research I have concluded that it is mainly due to GREED. BigPharma and the VMA makes MORE money on vaccinating your pet……then they make MORE $$$ when your pet develops other diseases due to over vaccination.\n\nWhy won’t politicians accept Titers Tests as a means to show immunity??? ……because most of them are narcissistic psychopaths who lack empathy. They do not care about you or the pain and suffering your pet goes thru. They are dictated to by the lobbyists for the chemical companies and the globalists who are pushing thru the Luciferian Agenda 21, demons that feed off of the energy of pain and suffering.\n\nWhat a coincidence. Diabetes in Pets is on the rise…..and over vaccinating your pets, especially with the Rabies Vaccine increases their risk of getting Diabetes….. Over-vaccination — There is a growing body of research that connects autoimmune disorders to diabetes, especially in dogs. If your pet’s immune system attacks his pancreas, he can develop diabetes. Dogs, in particular, are prone to immune system attacks on the pancreas, or more specifically, the cells that secrete insulin in the pancreas. This situation points to an autoimmune component in the development of diabetes in canines.\n\nImmune-mediated or autoimmune diseases are caused by over stimulation of the immune system. One of the primary ways your pet’s immune system can be overstimulated is through repetitive yearly vaccinations against diseases he’s already immunized against.”……….\n\nThe HERO and Spokesperson for the Pets is Dr John Robb founder of Protect the Pets. Please watch this video and learn what your veterinarian will not tell you. VIDEO LINK Dr. Karen Becker, a proactive and integrative wellness veterinarian, and Dr. John Robb, a Connecticut veterinarian, talk about profiteering and over-vaccination in veterinary medicine.\n\nWe must speak out regarding this injustice. We must be the voice for the animals…….\n\nAnother excellent resource on Pet Vaccinations is the book STOP the SHOTS! Are Vaccinations Killing Our Pets? by John Clifton.\n\nThe video link covers a multitude of concerns such as: How frequently should our pets be vaccinated…and What’s in there?\n\nOther valuable resources on this topic are: \n\nAre Pet Vaccinations Safe or Necessary? VIDEO LINK and \n\nVaccinating for Rabies when your dog is already immuned can cause AGGRESSION in your dog. ARTICLE LINK\n\nI’ll leave you with this question. It is not just about our pets but imagine this happening to our CHILDREN!!!!", "opengraph": {"title": "Pets, Vaccines & BigPharma", "description": "Vaccinations produce memory cells in the pet. The memory cells will afford the pet lifetime immunity. So the pet will get a puppy's rabies shot and then a booster. This will give the pet memory cells and immunity for the duration of the pet's life. So why over vaccinate and do harm? Educate yourself on the subject of over vaccination.....and be a VOICE for your pet.  Credit to Donna Ziccardi", "image": "https://americandigitalnews.com/wp-content/uploads/Pet-Vacs-4.jpg", "image:width": "487", "image:height": "439", "type": "article", "article:published_time": "2019-01-13T17:00:24+00:00", "article:modified_time": "2019-06-18T17:01:03+00:00", "article:tag": "Vaccines", "url": "https://americandigitalnews.com/index.php/2019/01/13/pets-vaccines-bigpharma/", "site_name": "American Digital News", "image:type": "image/jpeg"}, "tags": ["Healthcare", "ADN News", "Science"], "tweets": [], "movies": [], "links": ["https://www.facebook.com/donnathegoddess/posts/2474703702543947?comment_id=2474774159203568&reply_comment_id=2474852465862404", "https://www.youtube.com/watch?v=ETpOIriQ4Tc&fbclid=IwAR0fjbTNCm90Atb0uJzBekZMlkqCQivHRgaYLBohgY18d6LRiYHvVUqP4yQ", "https://www.youtube.com/watch?v=z5EF6FP_vMs&t=1586s&fbclid=IwAR24g9AW_bH5_ychuSDWXPX3fmFrkfnBx2QW5LsfprBuIGJYmYDDv-AKAoU", "https://www.youtube.com/watch?v=q-sT91vr4ys&fbclid=IwAR1qooJYj2bFGWDgQ9PBfBZsOQWkFWAMSkgqPCue5KxBLRLnMnSVvudJ9pc", "https://www.dogsnaturallymagazine.com/rabies-vaccination-and-aggression-in-dogs/?fbclid=IwAR0-bcEebGEucXYngIFJi06uHA2YnRcahUcBHklu2FfvP-_7wRIOcYDR5OY", "https://www.facebook.com/donnathegoddess?__tn__=%2CdC-R-R&eid=ARBgrx7A7eqBDQmZx32h0gGZZFKMeXZH5KLJetqKoJA6Q4_kj5ZSWuzglsYaepuEMoIBt4tixB8XpDc3&hc_ref=ARRhFMPJMXorNCDIOm3Y_4XPCeBLgOUb9tIEnn0kb-RxSZjc5Bg5UGqTIREn8BHd6Bs&fref=nf"], "authors": ["Ami Tiel"], "publish_date": "2019-01-13T17:00:24+00:00"}