{"result_id": "022021", "URL": "https://americandigitalnews.com/index.php/2021/07/11/researchrocks-new-tips-depopulation-methods-discussion-pt-5/", "timestamp": "2023-04-25 12:00:20 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://americandigitalnews.com/wp-content/uploads/ADN-red-favacon.jpg", "canonical": "https://americandigitalnews.com/index.php/2021/07/11/researchrocks-new-tips-depopulation-methods-discussion-pt-5/", "encoding": "UTF-8"}, "image": null, "domain": "americandigitalnews.com", "title": "#ResearchRocks New Tips & DEPOPULATION METHODS Discussion Pt 5", "cleaned_text": "To review previous Tips, Tricks & Gems and our LIVE Dig results:\n\nWelcome everyone!! We are excited to have you join us for our #RESEARCHROCKS Discussion today. If this is your first time here, take a few moments to review our previous episodes for many valuable tips and tricks. We have looked at ways to improve your search results, prepare your finds to be shared, and create calls of action for your research projects. Today we will be discussing the jewels from our prior group dig and looking at the many facets of information that can be featured along with a new tool for your toolbox – THE INFOGRAPHIC METHOD\n\nAn INFOGRAPHIC is a collection of information that is put into a visual graphic image for easier understanding. Now that benefit alone is huge but turning dull information into sharable content quickly with high rates of engagement (aka sharing) and the enhanced knowledge retention and recall (aka remembering) make this method a must have resource in your arsenal.\n\nI have included an example of one I pulled together from a timeline resource on our topic today. We will cover it after our group discussion. But you will now have the ability to convey your message with a more powerful punch using INFOGRAPHICS too!!\n\nDiscussions are a vital component involved in researching. Research is not just reading but also connecting dots to see a bigger picture. Being exposed to new research changes how you view your world – every time. We recommend getting a pen and paper to write down thoughts you may want to share in the discussion.\n\n“Late 1800s Francis Galton coined the term eugenics. Galton was half-cousin of Charles Darwin. Galton was involved in the fields of genetics, psychology, meteorology, and statistics, and advocated for a selective breeding program for humans.\n\n“Early 1900s Charles Davenport and Harry Laughlin began a eugenics movement in the U.S.\n\n“1901 John D. Rockefeller founded the Rockefeller Institute for Medical Research (RIMR) in Arkansas.\n\n“1907 Indiana was the first state to enact a sterilization law, and by 1935, 32 other states followed suit, which resulted in forced sterilization of 60,000 people in the U.S. by the mid 60s.\n\n“1917 Margaret Sanger founded the journal the ‘Birth Control Review.’ Some of her articles included:”Birth Control and Racial Betterment” (Feb. 1919), “Some Moral Aspects of Eugenics” (June 1920), “The Eugenic Conscience” (February 1921), “The Purpose of Eugenics” (December 1924), “Birth Control and Positive Eugenics” (July 1925) and “Birth Control: The True Eugenics” (August 1928).\n\n“1930 The Rockefeller Foundation began financing the Kaiser Wilhelm Institute of Anthropology, Human Heredity, and Eugenics, and continued to fund them up through 1939, being fully aware of their eugenics experiments.\n\n“The Rockefellers worked with scientists, WHO, UNFPA, USAID, multiple governments, and others, to create anti-fertility vaccines that would sterilize both men and women on a mass scale, with research evolving into crops as well. “Eugenicists under the guise of “scientists” and “philanthropists” have been running this game for decades. Statistics don’t lie. The timeline paints the picture, the data creates the framework, and the circle of people instrumental in these agendas are quoted in their own words. “It’s not a secret – they haven’t hidden this – one only needs to open their eyes. After all, they’ve long since formed their “population control” organizations, and have been telling you their concerns for years now. You just couldn’t imagine that what they meant by “control” was literally altering human physiology and outcomes to serve their eugenics agenda. “Late 1800s Francis Galton coined the term eugenics. Galton was half-cousin of Charles Darwin. Galton was involved in the fields of genetics, psychology, meteorology, and statistics, and advocated for a selective breeding program for humans. “Early 1900s Charles Davenport and Harry Laughlin began a eugenics movement in the U.S. “1901 John D. Rockefeller founded the Rockefeller Institute for Medical Research (RIMR) in Arkansas. “1907 Indiana was the first state to enact a sterilization law, and by 1935, 32 other states followed suit, which resulted in forced sterilization of 60,000 people in the U.S. by the mid 60s. “1917 Margaret Sanger founded the journal the ‘Birth Control Review.’ Some of her articles included:”Birth Control and Racial Betterment” (Feb. 1919), “Some Moral Aspects of Eugenics” (June 1920), “The Eugenic Conscience” (February 1921), “The Purpose of Eugenics” (December 1924), “Birth Control and Positive Eugenics” (July 1925) and “Birth Control: The True Eugenics” (August 1928). “1930 The Rockefeller Foundation began financing the Kaiser Wilhelm Institute of Anthropology, Human Heredity, and Eugenics, and continued to fund them up through 1939, being fully aware of their eugenics experiments. “1972 Planned Parenthood’s President, Alan Guttmacher, was honored with the Planned Parenthood Federation of America Margaret Sanger Award. He was also Vice President of the American Eugenics Society. “Other honorees have included Hillary Clinton, Nancy Pelosi, and Ted Turner, to name a few. “1973 Abortion was made legal by the Supreme Court following Roe v. Wade. Coincidentally, this is also the timeframe in which most states repealed their sterilization laws. “1988 The Rockefeller Foundation’s annual report states that their “population division” was making progress: “India’s National Institute of Immunology (in New Delhi) successfully completed the first phase of trials with three versions of an anti-fertility vaccine for women. ”The National Institute of Health (NIH) published the abstract on ‘Anti-fertility Vaccines’ in 1989. “Vaccines are under development for the control of fertility in males and females.” “The William H. Gates Foundation was formed, later becoming the Bill & Melinda Gates Foundation in 2000, with their goal centered on global immunization.”\n\n2000 The Global Alliance for Vaccines and Immunization (GAVI) was formed by Bill Gates, to accelerate the use of underused and new vaccines, increase funding, and shape the vaccine markets.\n\nINFOGRAPHIC RESOURCE: For much more though list of depopulation, eugenic, human experimentation and atrocities: A History Timeline of Population Control\n\n30 Population Control Quotes That Show That The Elite Truly Believe That Humans Are A Plague Upon The Earth\n\nUN Launches Blueprint For The New World Order With The Help Of The Pope: The 2030 Agenda\n\n“Ultimately, they hope to centrally plan and strictly regulate virtually everything that we do, and we will be told that it is necessary to “save the planet”.”\n\n“…what is “sustainable development?”\n\nPatrick Wood, an economist and author of “Technocracy Rising: The Trojan Horse of Global Transformation,” says it’s clear the U.N. and its supporters see sustainable development as more than just the way to a cleaner environment. They see it as the vehicle for creating a long-sought new international economic order, or “New World Order.”\n\nWood’s new book traces the modern technocracy movement to Zbigniew Brzezinski, David Rockefeller and the Trilateral Commission in the early 1970s.\n\nAnd Wood is quite correct. The environment is a perfect vehicle for the elite to use to bring in their version of utopia, because just about every possible form of human activity affects the environment in some way.”\n\n“Ultimately, they hope to centrally plan and strictly regulate virtually everything that we do, and we will be told that it is necessary to “save the planet”.”\n\nHOW MIGHT THE SAVE THE EARTH MOVEMENT TIE IN WITH THE AGE OF REASON AND THE GEORGIA GUIDESTONES?\n\n“Lenin’s birthday, April 22nd, is still quite popular, albeit officially celebrated only by the now-official communists under Gennady Zyuganov, as well as globally by the duped earth-worshippers who’ve been celebrating it since Lenin’s 100th birthday in 1970 as “Earth Day.” The Day of the Red Army, February 23rd, is also still being celebrated under a slightly changed motto. As is, of course, May 1st, Labour Day, the highday of international communism.” “…capable of withstanding the most catastrophic events, to be set up on some hilltop literally in the middle of nowhere and meant to communicate a ”message for future generations,” i.e. to instruct the shattered remnants of humanity, who will have survived a future cataclysm, in rebuilding a new society, a better civilisation than the one that nearly destroyed itself, and in finally entering an “Age of Reason.” The allusion apparently was to this 1794 classic of “Enlightened” philosophy (the year in which Robespierre’s “Terreur” reached its horrifying peak in revolutionary France, by the way). Its author, freethinker and radical enemy of religion, Englishman Thomas Paine (1737-1809), was a key player in both the French and American Masonic-Rosicrucian revolutions:” “However, “R. C. Christian” rather seems to be a deliberate allusion to the highly secretive Order of the Rosy Cross, an hermetic fraternity interested in alchemy and all sorts of ritual magic including the Kabbalah and formed in 15th-century- respectively re-established in early 17th-century Germany, and to its legendary founder, Frater C.R. resp. Christian Rosenkreutz. Rosicrucianism is an invisible movement rather than an official organisation, although there are to this day several societies that claim to be the genuine continuation of it. Rosicrucians have been frequently assumed as being at the core of international Satanism.” “In fact, many prominent Freemasons and Theosophists were also Rosicrucians and vice versa. “Good Pope” John XXIII, who in 1962 launched, without necessity, a “reform council” known as the Second Vatican Council, that then turned out as a veritable cultural revolution within the Roman Catholic Church, is said by a number of serious researchers, such as Piers Compton, to have been a crypto-communist, member of the Grand Orient de France, and covert Rosicrucian-Satanist!” “As for the mysterious orderers, no one has ever achieved unequivocally to detect their identity (there have been some speculations, though, whether Ted Turner could have been that ominous Mr. Anonymous).” “John Lennon’s dark “mother goddess” of earlier days, Yoko Ono (and weren’t especially the Beatles deeply involved not only in communist and New Age propaganda but even, like most Rock ‘n’ Roll figures, in Satanism?), even came out in 1993 with a song “Georgia Stone” on a tribute record for the recently deceased composer sharlatan John Cage. Yoko Ono freely praises the monstrosity as “a stirring call to rational thinking, akin to Thomas Paine’s ‘The Age of Reason’ ”, demonstrating how well she understands the symbolism and allusions that go with it.”\n\nDo We Even Have a Population Problem?\n\n“There is NO overpopulation. We can accommodate millions MORE. The real problem is maldistribution of resources.”\n\n“In POPULATION BOOM curious documentary filmmaker Werner Boote travels the globe and examines a stubborn view of the world that has existed for decades.\n\n“But he sees a completely different question: Who or what is driving this catastrophic vision?”\n\n“The U.S. population growth hit a historic 80-year low last year and the entire world population growth is on a downward spiral, particularly in western countries.\n\n“On April 29, 2019 Tucker Carlson had Dr. Hagai Levine on his show to discuss the alarming decline in male sperm count in men in the west, which has fallen over 50% in the last 40 years. That is astronomical!”\n\nMost people don’t know about the 2009 meeting of the billionaire club.\n\n“Microsoft billionaire Bill Gates and nine other American “foreign experts” in engineering and technology have been elected as new members of the Chinese Academy of Engineering (CAE)\n\nTogether with David Rockefeller, George Soros, Ted Turner, Warren Buffet, and a small clutch of additional billionaires, Gates formed a cabal they dubbed “The Good Club,” which seems to be fixated on population control. Its members are uncomfortably comfortable with China’s coercive (and murderous) One Child policy as an answer to population “problems.”\n\nTed Turner\n\nGiving Focus: United Nations, environment\n\nNet Worth: $2.2 billion\n\nLifetime Giving: $1.3 billion\n\nIn 1997, the man behind Turner Broadcasting and CNN made a historic $1 billion pledge that launched the United Nations Foundation. While the U.N. cannot directly raise money from philanthropists, the U.N. Foundation can—using the funds to support the intergovernmental organization’s peacekeeping, public health and environmental activities across the world. He fulfilled his big U.N. pledge in 2014. Turner, who has donated at least $300 million to other causes including land, water and species conservation through his own foundation, has said his U.N. contribution “is the best investment I’ve ever made.” FORBES\n\nTIP 1 INFOGRAPHIC METHOD: Below is an sample on DEPOPULATION METHODS from our first resource today. The timeline details were easy to pretty up and make eye catching and impactful. The resource used was simple to find and review, easy to use, and best of all – no cost. Add it to your toolbox too. LINK", "opengraph": {"title": "#ResearchRocks New Tips & DEPOPULATION METHODS Discussion   Pt 5", "description": "...many valuable tips and tricks.  We have looked at ways to improve your search results, prepare your finds to be shared,  and create calls of action for your research projects.  Today we will be discussing the jewels from our prior group dig and...", "image": "https://americandigitalnews.com/wp-content/uploads/Research-Cover-Pic-Epis-5.jpg", "type": "article", "article:published_time": "2021-07-11T19:23:53+00:00", "article:modified_time": "2021-07-12T02:56:52+00:00", "article:tag": "New World Order", "url": "https://americandigitalnews.com/index.php/2021/07/11/researchrocks-new-tips-depopulation-methods-discussion-pt-5/", "site_name": "American Digital News", "image:width": "239", "image:height": "211", "image:type": "image/jpeg"}, "tags": ["Agenda 2030", "ADN News"], "tweets": [], "movies": [], "links": ["http://researching-treasure-hunting-how-to-tips-tricks-live-group-digs-pt1/", "http://researching-treasure-hunting-dig-big-media-ep2/", "http://researching-treasure-hunting-expanded-tips-tricks-symbolism-digs-ep3/", "https://americandigitalnews.com/index.php/2021/07/04/researchrocks-treasure-hunting-implementing-tips-tricks-live-depopulation-dig-ep4/", "https://www.coreysdigs.com/health-science/eugenics-infertility-population-growth-crisis/", "http://www.eugenicsarchive.org/eugenics/list2.pl", "http://www.eugenicsarchive.org/html/eugenics/essay8text.html", "http://www.eugenicsarchive.org/eugenics/list2.pl", "http://www.eugenicsarchive.org/html/eugenics/essay8text.html", "https://www.plannedparenthood.org/about-us/newsroom/campaigns/ppfa-margaret-sanger-award-winners", "https://www.coreysdigs.com/wp-content/uploads/2019/06/Rockefeller-1988.pdf", "https://www.ncbi.nlm.nih.gov/pubmed/2665354", "https://rockfound.rockarch.org/childhood-immunization", "https://www.bibliotecapleyades.net/sociopolitica/esp_sociopol_depopu20.htm", "https://www.coreysdigs.com/health-science/eugenics-infertility-population-growth-crisis-part-2/", "https://www.coreysdigs.com/wp-content/uploads/2019/06/Rockefeller-1988.pdf", "https://academic.oup.com/humrep/article-abstract/6/1/166/875911", "https://www.coreysdigs.com/ivy-league-colleges/6-dartmouth-professors-under-investigation-connections/", "https://www.coreysdigs.com/health-science/eugenics-infertility-population-growth-crisis-part-3/", "https://www.tgen.org/news/2017/may/01/two-arizona-leaders-in-scientific-collaboration-partner-to-advance-global-tb-research/", "https://www.fiercebiotech.com/special-report/bill-gates", "https://xconomy.com/san-francisco/2018/10/02/pivot-bio-gets-70m-led-by-bill-gatess-fund-to-replace-fertilizer/2/", "https://www.coreysdigs.com/bill-gates/the-organic-narrative-whole-foods-red-flags/", "https://www.coreysdigs.com/vaccines-pharmaceuticals/measles-masterminds-millions/", "https://www.coreysdigs.com/clinton-foundation/clintons-shipwrecked-on-ten-islands-part-iv-exposed/", "https://www.gatesinstitute.org/about-us", "http://overpopulation.world/", "https://www.nytimes.com/2016/10/09/business/dealbook/an-investors-plan-to-transplant-private-health-care-in-africa.html", "https://therealdeal.com/2018/02/04/delayed-hospital-projects-prompt-bill-gates-foundation-to-audit-private-equity-firm/", "https://givingpledge.org/", "https://www.coreysdigs.com/clinton-foundation/shipwrecked-on-ten-islands-with-clintons-branson/", "https://khn.org/morning-breakout/dr00017637/", "https://rense.com/general16/georgiaguidestones.htm", "https://rense.com/general16/georgiaguidestones.htm", "http://thetruthwins.com/archives/30-population-control-quotes-that-show-that-the-elite-truly-believe-that-humans-are-a-plague-upon-the-earth", "http://en.wikipedia.org/wiki/David_Brower", "http://www.sott.net/article/192884-Connecting-the-Dots-Mass-depopulation-on-its-way-and-the-Secret-Teams-management-of-the-world", "http://www.infowars.com/from-7-billion-people-to-500-million-people-%E2%80%93-the-sick-population-control-agenda-of-the-global-elite/", "http://www.infowars.com/satire-article-quips-at-least-2-3-billion-must-die-to-save-the-earth/", "http://rspb.royalsocietypublishing.org/content/280/1754/20122845.full", "http://thetruthwins.com/archives/30-population-control-quotes-that-show-that-the-elite-truly-believe-that-humans-are-a-plague-upon-the-earth", "https://humansarefree.com/2015/09/un-launches-blueprint-for-the-new-world-order-with-the-help-of-the-pope-the-2030-agenda.html", "https://www.amazon.com/gp/product/0986373907/ref=as_li_qf_sp_asin_il_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0986373907&linkCode=as2&tag=humarefre-20&linkId=4Z7C5XRMWKWIPNSE", "https://humansarefree.com/2013/10/the-complete-history-of-freemasonry-and.html", "https://www.amazon.com/gp/product/0986373907/ref=as_li_qf_sp_asin_il_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=0986373907&linkCode=as2&tag=humarefre-20&linkId=4Z7C5XRMWKWIPNSE", "https://humansarefree.com/2013/12/exposing-shadow-elite-controlling-world.html", "https://humansarefree.com/2015/09/un-launches-blueprint-for-the-new-world-order-with-the-help-of-the-pope-the-2030-agenda.html", "https://thecontemplativeobserver.wordpress.com/2010/11/07/the-georgia-guide-stones-signposts-to-world-tyranny/", "http://www.catholicvoice.co.uk/brokencross/", "https://thecontemplativeobserver.wordpress.com/category/communist-world-revolution/", "https://vimeo.com/ondemand/populationboom/78312722", "https://www.coreysdigs.com/health-science/eugenics-infertility-population-growth-crisis-part-4/", "https://www.brookings.edu/blog/the-avenue/2018/12/21/us-population-growth-hits-80-year-low-capping-off-a-year-of-demographic-stagnation/", "https://www.coreysdigs.com/u-s/eugenics-infertility-population-growth-crisis-part-5/", "https://alumni.duke.edu/magazine/articles/big-question-can-your-environment-change-your-dna", "https://www.foodallergy.org/life-with-food-allergies/food-allergy-101/facts-and-statistics", "https://www.coreysdigs.com/u-s/eugenics-infertility-population-growth-crisis-part-6/", "https://www.coreysdigs.com/wp-content/uploads/2019/07/Habitat-III-New-Urban-Agenda-10-September-2016.pdf", "https://www.thetimes.co.uk/article/billionaire-club-in-bid-to-curb-overpopulation-d2fl22qhl02", "https://www.theguardian.com/world/2009/may/31/new-york-billionaire-philanthropists", "https://www.sgtreport.com/2021/04/secret-may-2009-meeting-of-the-good-club-billionaire-club-in-bid-to-curb-overpopulation/", "https://thenewamerican.com/bill-gates-other-elites-inducted-into-communist-chinese-academy/", "https://thenewamerican.com/bill-gates-other-elites-inducted-into-communist-chinese-academy/", "https://www.forbes.com/sites/forbeswealthteam/2021/01/19/americas-top-givers-the-25-most-philanthropic-billionaires/?sh=22ad66441f59", "https://www.visme.co/templates/infographics/"], "authors": ["Ami Tiel"], "publish_date": "2021-07-11T19:23:53+00:00"}