{"result_id": "022019", "URL": "https://americandigitalnews.com/index.php/2017/08/19/web-series-the-truth-about-vaccines/", "timestamp": "2023-04-25 12:00:18 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://americandigitalnews.com/wp-content/uploads/ADN-red-favacon.jpg", "canonical": "https://americandigitalnews.com/index.php/2017/08/19/web-series-the-truth-about-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "americandigitalnews.com", "title": "Web Series: “The Truth About Vaccines”", "cleaned_text": "SPECIAL Message for friends of March Against Monsanto\n\n“There has never been a more important time for The Truth About Vaccines. We live in a time when vaccine mandates are imminent and education on dangerous vaccine ingredients and the many serious risks associated with the CDC’s current vaccination schedule are kept hidden from the public. A single industry has managed to convince the entire population that injecting poison is essential to health. The Truth About Vaccines exposes the shocking truth of an industry built on deceit and provides life-saving knowledge that every parent must know.\n\nVaccine Excipient & Media Summary Excipients Included in U.S. Vaccines, by Vaccine\n\nIn addition to weakened or killed disease antigens (viruses or bacteria), vaccines contain very small amounts of other ingredients – excipients or media.\n\nSome excipients are added to a vaccine for a specific purpose. These include: Preservatives, to prevent contamination. For example, thimerosal. Adjuvants, to help stimulate a stronger immune response. For example, aluminum salts. Stabilizers, to keep the vaccine potent during transportation and storage. For example, sugars or gelatin.\n\nOthers are residual trace amounts of materials that were used during the manufacturing process and removed. These include: Cell culture materials, used to grow the vaccine antigens. For example, egg protein, various culture media. Inactivating ingredients, used to kill viruses or inactivate toxins. For example, formaldehyde. Antibiotics, used to prevent contamination by bacteria. For example, neomycin.\n\nThe following table lists all components, other than antigens, shown in the manufacturers’ package insert (PI) for each vaccine. Each of these PIs, which can be found on the FDA’s website (see below) contains a description of that vaccine’s manufacturing process, including the amount and purpose of each substance. In most PIs, this information is found in Section 11: “Description.”", "opengraph": {"title": "Web Series:  “The Truth About Vaccines”", "description": "SPECIAL Message for friends of March Against Monsanto\n“There has never been a more important time for The Truth About Vaccines. We live in a time when vaccine", "image": "https://americandigitalnews.com/wp-content/uploads/Vaccine-Ingredients.jpg", "image:width": "831", "image:height": "960", "type": "article", "article:published_time": "2017-08-19T14:53:04+00:00", "article:modified_time": "2017-08-19 09:53:04", "article:tag": "Vaccines", "url": "https://americandigitalnews.com/index.php/2017/08/19/web-series-the-truth-about-vaccines/", "site_name": "American Digital News", "image:type": "image/jpeg"}, "tags": ["Science"], "tweets": [], "movies": [], "links": ["https://go.thetruthaboutvaccines.com/mam/?a_aid=56101a033bdd4&a_bid=b61c3f7c", "https://www.cdc.gov/vaccines/pubs/pinkbook/downloads/appendices/b/excipient-table-2.pdf"], "authors": ["Ami Tiel"], "publish_date": "2017-08-19T14:53:04+00:00"}