{"result_id": "022001", "URL": "https://americandigitalnews.com/index.php/2022/05/23/american-digital-news-may-23-2022/", "timestamp": "2023-04-25 11:59:57 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://americandigitalnews.com/wp-content/uploads/ADN-red-favacon.jpg", "canonical": "https://americandigitalnews.com/index.php/2022/05/23/american-digital-news-may-23-2022/", "encoding": "UTF-8"}, "image": null, "domain": "americandigitalnews.com", "title": "American Digital News ~ May 23, 2022", "cleaned_text": "American Digital News and The ADN Community welcome you to today’s news. Leading stories, updates to relevant stories, Positivity Moments along with our daily Scripture verse await you. Join us every Monday thru Friday at 5:30pm EST in the ADN Community Voice Chat. #ADNistheNewsNOW\n\nADN COMMUNITY ~~ VOICE CHAT ~~ 🎙AUDIO RECORDING\n\nIn today’s political, religious & radically charged society; staying well informed is more important than ever. Who do you trust? What can you believe? Where will you turn for news? With more & more fake news, sensational click bait headlines & propaganda articles clouding the truth; using biased & unreliable sources to stay informed can lead to radical views & often closed-minded political beliefs. If you don’t challenge those opinionated sources, you will end up distrusting legitimate facts & verified information. ADN provides accurate & verified sources including articles pertinent to yesterday, today and tomorrow.\n\n📍Fauci Delivered $100MM Of NIAID Funds To A Company Called Bavarian Nordic To Create This Monkeypox Vaccine\n\n📍SOURCE This Patent Includes A Dual Monkeypox / Covid Vaccine And Was Filed A YEAR And A Half Ago\n\nI find it VERY interesting that this patent included a dual monkeypox/covid vaccine and was filed a YEAR and a half ago… US Patent Application #20210260182 – “Recombinant poxvirus based vaccine against SARS-CoV-2” – Feb 26, 2021\n\nMonkey pox was created in 1958 when scientists were injecting smallpox into monkeys for research purposes in a lab in Denmark. Monkey pox made the jump to humans in 1971 when scientists used said monkey liver tissue in small pox vaccines throughout Africa.\n\nFrance: 1 confirmed\n\nItaly: 1 confirmed, 2 suspected\n\nUK: 9 confirmed\n\nSweden: 1 confirmed\n\nPortugal: 14 confirmed, 6 suspected\n\nSpain: 7 confirmed, 40-50 suspected\n\nCanada: 0 confirmed, 13 suspected\n\nUSA: 1 confirmed, 6 suspected\n\nBelgium: 1 confirmed Becomes the first country to introduce mandatory “21 days quarantine” for the people tested positive for Monkey Pox.\n\n📍SOURCE NYC Reports First Suspected Monkeypox Case As WHO Convenes Emergency Meeting\n\n📍SOURCE Globalist Group NTI Predicted Likelihood of MonkeyPox Outbreak in Their November 2021\n\nBack in November 2021, NTI.org partnered with the Munich Security Conference to conduct a tabletop exercise on reducing high-consequence biological threats. According to the concluding report, the exercise examined gaps in national and international biosecurity and pandemic preparedness architectures—exploring opportunities to improve prevention and response capabilities for high-consequence biological events.\n\n📍SOURCE Global Health Agencies Planned for Monkeypox Pandemic to Strike in May 2022, Wargame Document from Early 2021 Reveals\n\nIran is set to be the first country to roll out a food rationing scheme (or ‘limited subsidy’) based on new biometric IDs.\n\n📍SOURCE Climate “Marshall Plan” will end US global dominance as U.N. joins WEF call to end oil, gas, and coal use\n\nThey’re not even trying to hide it! UN Secretary General Antonio Guterres, a Portuguese socialist, called for an end to oil, gas and coal in favor of so-called “renewable” sources as part of the ill-conceived global climate “Marshall Plan”.\n\n📍SOURCE $60 Million From U.S. Taxpayers so WEF Can Fund ‘Playground’ for World’s Billionaires?\n\nDocuments obtained by OpenTheBooks found U.S. taxpayers ponied up $60 million over the last eight years to support the World Economic Forum, which hosts the world’s billionaire business elite in Davos, Switzerland, every year.\n\n📍Klaus Schwab tells attendees at his World Economic Forum in Davos that “the future is being built by us.”\n\n📍 France has not found an alternative to Russian gas.\n\n📍President Bolsonaro says Brazil will REJECT WHO Pandemic Treaty\n\n📍LINK A new letter from Arch Bishop Carlo Maria Viganò to the people.\n\nIn the letter he addresses the intent of the treasonists in each of our countries (Buyden, Killary & Gates in the USA) attempting to hand over sovereignty to the globalists (W.H.O.).\n\n📍SOURCE Supreme Court could rule on Roe v. Wade on Monday, as Biden admin braces for violence after decision\n\nThe Supreme Court issues opinions on Mondays at 10 a.m. ET, so the next opportunity to hand down a decision in the case. As the court reaches the end of its term, usually by the end of June or first week in July, sometimes it adds additional dates to release opinions with a few days’ notice in advance. Historically, decisions in more closely watched cases are issued in the last weeks of the term immediately before the justices adjourn for the summer months.\n\n📍LINK Planned Parenthood has announced it will close five abortion centers in Indiana, Idaho and Alaska. The news follows a new report the other day indicating the billion-dollar abortion chain\n\nNow I plead with you, brethren, by the name of our Lord Jesus Christ, that you all speak the same thing, and that there be no divisions among you, but that you be perfectly joined together in the same mind and in the same judgment.\n\nWe are told that on the day of Pentecost, when the wind of the Spirit came, they are of one accord. Paul has begun to show them of the error in their church. First of all, he explains that they must be together, that division is not what God would have. If they are truly in Christ Jesus, then they would be one in Him. Paul is explaining to them that there is one message from God that saved them, and they must stick with that message.\n\nThis is what happens when you conflate sexual orientation with sexual identity. Last month the government funded AIDS Council of NSW (ACON) appointed a man, who identifies as a lesbian, to promote the Lesbian Day of Visibility. Rosie Piper, a transwoman and a comedian says he is a “blokey lesbian” and a “straight man” who has been living in the wrong body. Gay women, actual lesbians, were furious. University of Sydney emeritus Professor Bronwyn Winter questioned how a transgender woman could be chosen to raise awareness of lesbian issues and said it was part of a wider push by some in the trans community to replace “same sex attraction” with “same gender identity attraction”. She said ACON’s campaign ” was “insulting to lesbians”. “There are a lot of lesbians who will never accept male-bodied people can be lesbians,” she said. Prof Winter is a lesbian and one of the founders of the campaign group called Respect My Sex, which is calling on Australian voters to ask their candidates at the upcoming election questions about sex based rights. “Lesbians who want to socialize with lesbians are now being driven underground,” she said. “It is no longer legal for us to organize a social event without males in the room.” She cited a tribunal case in Tasmania where LGB Alliance member Jessica Hoyle sought an exemption to be able to hold lesbian events without “people with penises”. The exemption was rejected by the Tasmanian Anti-Discrimination commissioner Sarah Bolt. The LGBT community, the media and politicians have long conflated sexual orientation with sexual identity. Sexual orientation relies on biological reality. Same sex attraction is based on people being the same sex. Transgenderism denies biological reality and relies on the appropriation of sex. In almost every scenario, it is girls and women who suffer the disadvantage of the aggressive gender agenda.\n\n📍LINK (Kimberly) The Director Of LA County’s Child Protection Services Agency Just Resigned\n\nTens of millions of Americans could be thrown into a summer of hell as a megadrought, heatwaves, and reduced power generation could trigger widespread rolling electricity blackouts from the Great Lakes to the West Coast, according to Bloomberg, citing a new report from the North American Electric Reliability Corporation (NERC), a regulatory body that manages grid stability.\n\nNERC warned power supplies in the Western US could be strained this summer as a historic drought reduces hydroelectric power generation due to falling reservoir levels and what’s expected to be an unseasonably hot summer. Compound the hellacious weather backdrop with grids decommissioning fossil fuel power plants to fight climate change and their inability to bring on new green power generation, such as solar, wind, and batteries, in time, is a perfect storm waiting to happen that will produce electricity deficits that may force power companies into rolling blackouts for stability purposes.\n\n📍LINK US Western Megadrought Worst In 1,200 Years, Scientist Warn\n\nAttention lakefront homeowners: now might be the time to sell before your oasis transforms into a desert. More Warnings of Blackouts Across Half of the U.S. From Electricity Regulators\n\n‘Tens of millions of Americans could be thrown into a summer of hell as a megadrought, heatwaves, and reduced power generation could trigger widespread rolling electricity blackouts from the Great Lakes to the West Coast, according to Bloomberg, citing a new report from the North American Electric Reliability Corporation (NERC), a regulatory body that manages grid stability.\n\nNERC warned power supplies in the Western US could be strained this summer as a historic drought reduces hydroelectric power generation due to falling reservoir levels and what’s expected to be an unseasonably hot summer.’\n\nAs the article warns, this summer is looking to be a messy one: inflation, food shortages, soaring gas prices, heatwaves and blackouts and of course the coming violence and rioting from the ruling of Roe Vs Wade in June. Don’t forget ‘Cyber Polygon’ aka planned cyber attacks are also possibilities.\n\nThey hired someone else to the Disinformation Governance Board and I cannot believe they are actually this stupid.\n\nI thought for sure they would shut it down for good, because the backlash from the public is so severe. Even the centrists are speaking out about how wrong this is.\n\nGuess I shouldn’t be surprised they are doubling and tripling down on stupid. Here I was thinking they might have a semblance of self awareness. I actually thought they couldn’t get anymore stupid and they have proven me wrong.\n\nI will never underestimate their incompetence again\n\n📍Michael Chertoff, Biden’s new head of the Ministry of Truth, pushed claims that Russia hacked the DNC and gave the information to Wikileaks… mUh rUsSiA!!!!\n\n📍SOURCE U.S. President Biden supports Japan becoming permanent member of the U.N. Security Council\n\n📍LINK Biden: US would defend Taiwan militarily if China invaded\n\n📍SOURCE US Sees Risk of COVID Supply Rationing Without More Funds\n\nThe White House is planning for “dire” contingencies that could include rationing supplies of vaccines and treatments this fall if Congress doesn’t approve more money for fighting COVID-19.\n\nThe Florida agriculture commissioner bases her request for a state of emergency on high fuel, food prices.\n\nFormer New York Mayor Bill de Blasio announced Friday that he is running for Congress in the state’s newly drawn 10th Congressional District. “I’m ready right\n\n📍SOURCE US Senate REJECTS $48 Billion Aid Package For Small Businesses and Restaurants Just Hours After Approving\n\n📍LINK Pentagon reportedly considering deployment of special forces to guard U.S. Embassy in Kyiv”\n\nThe troops would only defend and protect the U.S. embassy.\n\n📍Kash explains why he’s not too concerned about the jurors that were selected for the Sussmann trial.\n\n📍SOURCE Public School Exodus: Since 2020 Public School Enrollment is Down 1.2 Million Students\n\n📍SOURCE (MamaT) Like a Creepy Neighbor: State Farm Donating Transgender Books for Kindergarteners to Schools in Florida\n\nAuto insurance company State Farm has partnered with the “GenderCool Project” to supply transgender books for students.\n\n📍SOURCE Here’s The New Left-Wing Theory Parents Are Fighting In Schools\n\nCritical Race Theory is not the only three letter phrase that has parents concerned; Social Emotional Learning is the latest curriculum.\n\nEarly voting in Georgia broke records this week despite last year’s adoption of election integrity measures that critics derid\n\nEllison has been a major GOP supporter and donor, having donated to Trump’s presidential campaign and Graham’s Senate campaign. He most recently donated $1 billion to SpaceX and Tesla CEO Elon Musk for his $44 billion acquisition of Twitter. Ellison has not commented publicly on the 2020 election results.\n\n📍SOURCE (Phoenix Rising) 2 Springfield women enter plea in breach of U.S. Capitol on Jan. 6, 2021\n\nCara Hentschel and Mahailya Pryer pleaded guilty to parading, demonstrating, or picketing in any of the Capitol building. They faced three other charges in the incident.\n\nFederal investigators say a person known to the FBI submitted an online tip stating that Hentschel had posted photographs to her Facebook account depicting her at the U.S. Capitol on January 6, 2021. The tipster included a link to Hentschel’s Facebook profile but reported not knowing her personally or whether she entered the Capitol.\n\nAgents arrested the couple in the fall of 2021.\n\n📍SOURCE Another unit of the Armed Forces of Ukraine refused to fight.\n\n📍SOURCE Russian soldier sentenced to life in prison in Ukraine’s first war crimes trial since invasion\n\nSgt. Vadim Shyshimarin, 21, admitted to shooting an unarmed 62-year-old man in the head in a village in northeastern Ukraine.\n\n📍LINK Russia permanently bans 963 Americans including Biden and Harris from entering the country, according to a list published on Saturday. Trump is not on the list.\n\n🙈TELEGRAM MEDIA: ADN MEDIA CHANNEL\n\nRepository for all ADN news broadcasts, show recordings and notes, videos, flyers and more", "opengraph": {"title": "American Digital News ~ May 23, 2022", "description": "5/23/22 ADN NEWS LINEUP\n\n\n\n\n\n\n\nAmerican Digital News and The ADN Community welcome you to today's news.  Leading stories, updates to relevant stories, Positivit", "image": "https://americandigitalnews.com/wp-content/uploads/ADN-Community-Logo-800x800.jpg", "type": "article", "article:published_time": "2022-05-23T20:27:47+00:00", "article:modified_time": "2022-05-23T22:24:51+00:00", "url": "https://americandigitalnews.com/index.php/2022/05/23/american-digital-news-may-23-2022/", "site_name": "American Digital News"}, "tags": ["ADN News"], "tweets": [], "movies": [], "links": ["#ADNistheNewsNOW", "https://t.me/AmericanDigitalNews", "https://t.me/AmericanDigitalNews?videochat=c9a53adf40b4ef8d1b", "https://t.me/ADNMEDIACHANNEL/415", "https://breaking-news.ca/this-patent-includes-a-dual-monkeypox-covid-vaccine-and-was-filed-a-year-and-a-half-ago/", "https://t.me/c/1617742402/3172", "https://breaking-news.ca/nyc-reports-first-suspected-monkeypox-case-as-who-convenes-emergency-meeting/", "https://www.ntd.com/israel-confirms-first-monkeypox-case_783052.html?utm_medium=NTD&utm_source=telegram", "https://www.thegatewaypundit.com/2022/05/weird-globalist-group-nti-predicted-likelihood-monkeypox-outbreak-november-2021-report/?utm_source=Telegram&utm_medium=PostTopSharingButtons&utm_campaign=websitesharingbuttons", "https://www.nti.org/analysis/articles/strengthening-global-systems-to-prevent-and-respond-to-high-consequence-biological-threats/", "https://www.nti.org/wp-content/uploads/2021/11/NTI_Paper_BIO-TTX_Final.pdf", "http://tinyurl.com/amr7baex", "https://t.me/AmericanDigitalNews/64018", "https://youtu.be/CPPQ2X8VoRQ", "https://www.lawenforcementtoday.com/climate-marshall-plan-will-stick-a-fork-in-us-global-dominance-as-u-n-joins-wef-call-to-end-oil-gas-and-coal-use/", "https://childrenshealthdefense.org/defender/wef-u-s-taxpayers-funding/", "https://bit.ly/3lyM93S", "https://www.foxnews.com/politics/supreme-court-roe-wade-ruling-biden-admin-braces-violence-decision", "https://t.me/AmericanDigitalNews/64723", "https://bible-studys.org/1-corinthians-chapter-1/", "https://breaking-news.ca/a-male-selected-to-promote-lesbian-day-of-visibility/", "https://t.me/AmericanDigitalNews/63888", "https://www.zerohedge.com/commodities/us-west-risk-power-blackouts-summer-regulator-warns", "https://www.zerohedge.com/weather/us-western-megadrought-worst-1200-years-scientist-warn", "https://www.bloomberg.com/news/articles/2022-05-18/vast-swath-of-us-is-at-risk-of-summer-blackouts-regulator-warns", "https://www.zerohedge.com/weather/severe-drought-dust-bowl-conditions-threaten-disastrous-winter-wheat-harvest-us", "https://archive.ph/a2YUZ", "https://www.thegatewaypundit.com/2022/05/wow-biden-regime-hires-michael-chertoff-previously-targeted-gateway-pundit-breitbart-lead-disinformation-board-another-hunter-biden-laptop-truther/", "https://share.smartnews.com/YsVSD", "https://twitter.com/thehill/status/1528682309070774272?t=6H_NLC1XfB_Rc_WWwciS_A&s=09", "https://www.newsmax.com/newsfront/Virus-Outbreak-Biden/2022/05/21/id/1070869/", "https://www.wfit.org/florida/2022-05-21/fried-requests-state-of-emergency-for-florida", "https://t.me/AmericanDigitalNews/64523", "https://www.msn.com/en-us/news/politics/bill-de-blasio-announces-run-for-congress/ar-AAXwpJ0", "https://www.thegatewaypundit.com/2022/05/america-last-us-senate-rejects-48-billion-aid-package-small-businesses-restaurants-just-hours-approving-another-40-billion-ukraine-34-rinos-voted-yes-ukraine-no-amer/", "https://t.me/plasticgirlreport", "https://share.smartnews.com/BhHyP", "https://rumble.com/v15jny3-public-school-exodus-since-2020-public-school-enrollment-is-down-1.2m-stude.html", "https://www.thegatewaypundit.com/2022/05/like-creepy-neighbor-state-farm-donating-transgender-books-kindergarteners-schools-florida/", "https://share.smartnews.com/HqfuX", "https://www.thegatewaypundit.com/2022/05/big-arizona-fraud-update-law-enforcement-raids-nonprofits-2000-mules-ballot-trafficking-investigation-like-tweety-birds-sang/", "https://link.theepochtimes.com/mkt_app/georgias-record-breaking-early-voting-turnout-defies-voter-suppression-accusations_4481593.html?utm_source=andshare", "https://secondnexus.com/pennsylvania-mehmet-oz-mccormick-ballots", "https://www.msn.com/en-US/news/politics/oracles-larry-ellison-joined-call-contesting-trump-election-loss-report/ar-AAXxXfM?ocid=sapphireappshare", "https://t.me/c/1617742402/3161", "https://share.smartnews.com/indtk", "https://www.mid.ru/ru/maps/us/1814243/", "https://finance.yahoo.com/news/swiss-investment-firm-acquires-3-090029649.html", "https://americandigitalnews.com/", "https://truthsocial.com/@AmiTielAmDigitalNews", "https://truthsocial.com/@AmericanDigitalNews", "https://gab.com/AmiTielAmDigitalNews", "https://www.facebook.com/groups/1722717411299460/", "https://mobile.twitter.com/AmDigitalNews", "https://t.me/AmericanDigitalNewsChannel", "https://t.me/AmericanDigitalNews", "https://t.me/ADNMEDIACHANNEL"], "authors": ["Ami Tiel"], "publish_date": "2022-05-23T20:27:47+00:00"}