{"result_id": "022004", "URL": "https://americandigitalnews.com/index.php/2020/07/02/who-is-bill-gates-part-1/", "timestamp": "2023-04-25 12:00:04 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://americandigitalnews.com/wp-content/uploads/ADN-red-favacon.jpg", "canonical": "https://americandigitalnews.com/index.php/2020/07/02/who-is-bill-gates-part-1/", "encoding": "UTF-8"}, "image": null, "domain": "americandigitalnews.com", "title": "WHO is Bill Gates? Part 1", "cleaned_text": "Born Oct 28, 1955 Henry William Gates is claimed as Co founder of Microsoft to become a multi billionaire through his intelligence as a software engineer, that is a lie.\n\nIn 1975, Gates dropped out of Harvard (322) to start a software co, yet in doing so failed to mention the fact that he comes from a loyal Eugenics family who strived to continue the ongoing transition into future depopulation using immense wealth through…\n\nFamily bloodlines. William Henry Gates (Gates Sr grandfather) was an active boy scout earning the eagle scout award in 1941,after high school enlisted in the US army (changing his name to Jr to avoid the appearance of elitism) honorably…\n\ndischarged and becoming one of the founding members of planned parenthood. Which leads us to William H Gates the 2nd (Sr) former head of Eugenics group planned parenthood, which was originally “America Eugenics Society”, William Gates Sr was quoted as most..\n\nhuman beings are “Reckless Breeders” and “Human weeds” in need of culling. Gates Sr was also admitted to the beliefs of Thomas Robert Malthus, who believed the population needed to be controlled through the reproductive system. Which leads us to Bill Gates..\n\nBill failed in college and MIT software programming yet was able to infiltrate one the largest software organizations and sell them a license to software he didn’t have at the time, then went out and bought from “Seattle Computer Products” for 50K and…\n\nrebrand the product as his own, and perused the IBM terms against their own standards and insured Microsoft a 80/90% share that was guaranteed under a fraudulent business model. The well connected Gates family is tied to IBM insiders and Eugenics insiders.\n\nBills mother Mary served on the Board of United Way, also on the Board of United Way was the CEO of IBM which is how Bill met the CEO of IBM, through his mother. IBM is also connected to the Holocaust through Edwin Black.\n\n\n\nSteve Jobs was quoted.. “Bill Gates was a talentless bum who stole every idea that made him money” example; Windows was stolen from apple, which was stolen from Xerox. “You are an unimaginative, never invented anything and shamelessly ripped off others” -Steve Jobs.\n\nOnce Gates fraudulently obtained his billions through theft and backed by a eugenics bloodline family, started the decades long agenda of depopulation. To further this agenda Gates needed to buy out the media to control public opinion. In Dec 2008…\n\nNews Hour was given 3.5 million from the Gates foundation. In Sep 2010, The Guardian launched a Global Development website with the Gates foundation. In Feb 2011, The Seattle Times received over 4.5 million through the Bill and Melinda Gates foundation..\n\nBBC received over 3million, ABC has received several millions to the coverage of the Bill and Melinda gates foundation on vaccines. So how did Gates funnel his wealth into programs to further the depopulation agenda? Gates speech on “Innovation to Zero” uses the carbon emissions rising in a\n\n“Joking” manner to lessen the population equals less carbon. Feb 1 2012, according to Natural News, Gates funded technology to destroy sperm, then there is GAVI (Global Alliance for Vaccine Immunization) which was..\n\nsuccessful through the grants of Bill and Melinda Gates foundation to which GAVI plays into the depopulation agenda. In NY 2009, there was a secret closed door meeting involving Soros, David Rockefeller, Ted Turner, Buffett, Bloomberg, Oprah..\n\nAnd of course Bill Gates. The meeting was on the Population Council to discuss how to use wealth to further the depopulation agenda, but was described by ABC news (Gates affiliate) as a discussion about charity, which is a lie.\n\nOver 70Billion dollars was funded into the Population Council that day, as the invitations were written by Gates and Rockefeller, as all members realized a growing population was the biggest threat towards their NWO agenda.\n\nGates was quoted “Through proper Vaccines, we can lower the population by 10-15% in the next 10 years” beginning the “Decade of vaccines”. Vaccines being used as sterilizing agents is fully documented, in 1968 The Rockefeller Foundation funded organizations to reduce fertility…\n\nBy 1988, The Rockefeller Foundation reported progress on this including Norplant (developed by Rockefeller) which includes a under the skin implant lasting for 5 years that causes sterilization. Later on The Population Council along with W.H.O. joined in 1972 to create a task force on\n\nvaccine fertilization, by 1995 they developed a prototype of Anti-HCG vaccine, which works by combining a immunogen formed from a synthetic peptide of a human chronic gonadotropin (HCG) a hormone secreted by an\n\nearly embryo implanted in the womb with a toxoid carry molecule, the vaccine stimulates a immune reaction, causing women to develop antibodies against the hormone thus preventing them from carrying babies to term. In the 1990s, a series of W.H.O. lead vaccine programs in the 3rd\n\nworld, tetanus vaccines were found to be laced with HCG in places such as Philippines and Kenya to implement population control under the disguise of “health concerns” without any consent or knowledge of those receiving the vaccines, after this discovery, the programs funding was pulled by federal governments, until the Bill and Melinda Gates\n\nfoundation stepped forward to fund the programs working with the UK government to host at the London Summit on “Family Planning” in 2012,\n\nto secure funding and further the programs.\n\nIn 2014 “Microchips Biotech Inc”, a company in Lexington MA had developed a form of birth control in the form of a wireless implant that could be turned on or off by remote, and designed to last 16 years.\n\nGates visited Robert Langers MIT labs in 2012 and asked Robert to create an implantable device that could be turned on/off, Gates gave 20 million to Microchips Biotech inc. In 2017 GAVI (Gates founded and funded program) that is partner with (Gates Foundation, W.H.O. and the World Bank) took a step away from vaccinated every child on the planet to focus its primary objective on creating Biometric identity in every child.\n\nPLEASE CONTINUE TO PART 2 LINK HERE", "opengraph": {"title": "WHO is Bill Gates? Part 1", "description": "He's a eugenics, depopulation-driven, elitist, virologist, global warming proponent...  You get the picture right?!?", "image": "https://americandigitalnews.com/wp-content/uploads/BG-cover.jpg", "type": "article", "article:published_time": "2020-07-02T14:49:15+00:00", "article:modified_time": "2020-07-02T14:49:18+00:00", "article:tag": "WHO", "url": "https://americandigitalnews.com/index.php/2020/07/02/who-is-bill-gates-part-1/", "site_name": "American Digital News", "image:width": "288", "image:height": "370", "image:type": "image/jpeg"}, "tags": ["Agenda 2030", "Healthcare", "ADN News", "Science"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">Bill Gates<br/>Depopulation Agenda <br/>&amp; Eugenics Frontman <br/><br/>Who is Bill Gates?<br/><br/>Born Oct 28, 1955 Henry William Gates. Is claimed as Co founder of Microsoft to become a multi billionaire through his intelligence as a software engineer, that is a lie. <a href=\"https://t.co/jsIG4NJ8aC\">pic.twitter.com/jsIG4NJ8aC</a></p>— The Punisher (@PunishDem1776) <a href=\"https://twitter.com/PunishDem1776/status/1264373730257575937?ref_src=twsrc%5Etfw\">May 24, 2020</a></blockquote> \n"], "movies": [], "links": ["https://twitter.com/PunishDem1776/status/1264373730257575937", "https://threadreaderapp.com/thread/1264373730257575937.html", "https://t.co/jsIG4NJ8aC", "https://twitter.com/PunishDem1776/status/1264373730257575937?ref_src=twsrc%5Etfw", "https://pbs.twimg.com/media/EYv1NPGXQAAUz8E.jpg", "https://pbs.twimg.com/media/EYv1QLJWkAEHQaV.jpg", "https://pbs.twimg.com/media/EYv1QVaXsAAe4sn.jpg", "https://pbs.twimg.com/media/EYv1QmpXsAUJz0H.jpg", "https://pbs.twimg.com/media/EYv1QvbXsAY7BfX.jpg", "https://pbs.twimg.com/media/EYv1SFpWAAIxsFh.jpg", "https://pbs.twimg.com/media/EYv1SQWWkAA5tnF.jpg", "https://pbs.twimg.com/media/EYv1SbDWsAAu-jD.jpg", "https://pbs.twimg.com/media/EYv1S2xXkAcBbp6.jpg", "https://pbs.twimg.com/media/EYv1TEHXQAE5cW8.jpg", "https://pbs.twimg.com/media/EYv1TZYWsAEhiex.jpg", "https://pbs.twimg.com/media/EYv1TmUXgAU_Mgu.jpg", "https://pbs.twimg.com/media/EYv1UEwX0AEhk1P.jpg", "https://pbs.twimg.com/media/EYv1UeoWoAA3Y9S.jpg", "https://pbs.twimg.com/media/EYv1U10XQAADAsx.jpg", "https://pbs.twimg.com/media/EYv1VMBWsAE60tj.jpg", "https://pbs.twimg.com/media/EYv1WWeXYAAssAD.jpg", "https://pbs.twimg.com/media/EYv1We2XgAE2vp9.jpg", "https://pbs.twimg.com/media/EYv1Xc-WkAAC27c.jpg", "https://pbs.twimg.com/media/EYv1Ya5WAAM7vps.jpg", "https://pbs.twimg.com/media/EYv1ZATWkAETVOQ.jpg", "https://pbs.twimg.com/media/EYv1Zd1XgAED5OI.jpg", "https://pbs.twimg.com/media/EYv1ZuLWAAAXVyo.jpg", "https://pbs.twimg.com/media/EYv1cSRXQAUF9SW.jpg", "https://pbs.twimg.com/media/EYv1cjxXsAAP0OK.jpg", "https://pbs.twimg.com/media/EYv1c-MWAAMab2O.jpg", "https://pbs.twimg.com/media/EYv1eO3XgAAOd2I.jpg", "https://pbs.twimg.com/media/EYv1gHUWoAE0M-a.jpg", "https://pbs.twimg.com/media/EYv1hL6WkAIaza1.jpg", "https://pbs.twimg.com/media/EYv1himXsAUHl-g.jpg", "https://pbs.twimg.com/media/EYv1h7IWsAAkFOX.jpg", "https://pbs.twimg.com/media/EYv1ko-WsAA5ZE9.jpg", "https://threadreaderapp.com/user/PunishDem1776", "https://threadreaderapp.com/thread/1264374183259078656.html", "https://twitter.com/PunishDem1776/status/1264373730257575937", "https://twitter.com/PunishDem1776/status/1264374183259078656"], "authors": ["Ami Tiel"], "publish_date": "2020-07-02T14:49:15+00:00"}