{"result_id": "022007", "URL": "https://americandigitalnews.com/index.php/2017/07/23/the-crowd-full-audio-book/", "timestamp": "2023-04-25 12:00:07 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://americandigitalnews.com/wp-content/uploads/ADN-red-favacon.jpg", "canonical": "https://americandigitalnews.com/index.php/2017/07/23/the-crowd-full-audio-book/", "encoding": "UTF-8"}, "image": null, "domain": "americandigitalnews.com", "title": "The Crowd (Full Audio Book)", "cleaned_text": "“Civilisations as yet have only been created and directed by a small intellectual aristocracy, never by crowds. Crowds are only powerful for destruction. Their rule is always tantamount to a barbarian phase. A civilisation involves fixed rules, discipline, a passing from the instinctive to the rational state, forethought for the future, an elevated degree of culture — all of them conditions that crowds, left to themselves, have invariably shown themselves incapable of realising. In consequence of the purely destructive nature of their power crowds act like those microbes which hasten the dissolution of enfeebled or dead bodies. When the structure of a civilisation is rotten, it is always the masses that bring about its downfall.” – Gustave Le Bon, from Introduction\n\n“If one destroyed in museums and libraries, if one hurled down on the\n\n flagstones before the churches all the works and all the monuments of art that\n\n religions have inspired, what would remain of the great dreams of humanity?\n\n To give to men that portion of hope and illusion without which they cannot\n\n live, such is the reason for the existence of gods, heroes, and poets. During\n\n fifty years science appeared to undertake this task. But science has been\n\n compromised in hearts hungering after the ideal, because it does not dare to be\n\n lavish enough of promises, because it cannot lie.”\n\nThe Crowd: A Study of the Popular Mind\n\n Author Gustave Le Bon\n\n Original title: Psychologie des Foules\n\nThe Crowd: A Study of the Popular Mind (French: Psychologie des Foules; literally: Psychology of Crowds) is a book authored by Gustave Le Bon that was first published in 1895.[1][2]\n\n In the book, Le Bon claims that there are several characteristics of crowd psychology: “impulsiveness, irritability, incapacity to reason, the absence of judgement of the critical spirit, the exaggeration of sentiments, and others…”[1] Le Bon claimed that “an individual immersed for some length of time in a crowd soon finds himself – either in consequence of magnetic influence given out by the crowd or from some other cause of which we are ignorant – in a special state, which much resembles the state of fascination in which the hypnotized individual finds himself in the hands of the hypnotizer.”[3]", "opengraph": {"title": "The Crowd (Full Audio Book)", "description": "Published on Feb 8, 2016\nThe Crowd - audiobook\nGustave LE BON (1841 - 1931)\n\"Civilisations as yet have only been created and directed by a small intellectual ar", "image": "https://americandigitalnews.com/wp-content/uploads/grouppsychologya00freu_0007-176x300.jpg", "type": "article", "article:published_time": "2017-07-24T00:24:01+00:00", "article:modified_time": "2017-07-24T00:31:00+00:00", "url": "https://americandigitalnews.com/index.php/2017/07/23/the-crowd-full-audio-book/", "site_name": "American Digital News"}, "tags": ["Science"], "tweets": [], "movies": [], "links": ["https://www.youtube.com/watch?v=u-u4-Ey4ndw", "https://archive.org/details/grouppsychologya00freu"], "authors": ["Ami Tiel"], "publish_date": "2017-07-24T00:24:01+00:00"}