{"result_id": "022006", "URL": "https://americandigitalnews.com/index.php/2019/02/24/5g-q-decode-by-serialbrain2/", "timestamp": "2023-04-25 12:00:06 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://americandigitalnews.com/wp-content/uploads/ADN-red-favacon.jpg", "canonical": "https://americandigitalnews.com/index.php/2019/02/24/5g-q-decode-by-serialbrain2/", "encoding": "UTF-8"}, "image": null, "domain": "americandigitalnews.com", "title": "5G Q Decode by SerialBrain2", "cleaned_text": "Post by SerialBrain2 on Reddit on Feb 23, 2019\n\nI told you to watch the date 02/21/2019. A major bomb went off yesterday. Nuclear level. Did you catch it?\n\nThis is a silent war. Silent but deadly. With real threats and real casualties. And sometimes, you can see the traces of the deflagrations:\n\nQ158 Silent war (some gets out). The Great Awakening. Iron Eagle. Godfather III. The Hunt for Red October. Q\n\nIf you want to know what is going on the battlefield, you need to learn the comms and pay attention:\n\nQ1150 Where are the autists?!?! Q\n\nFor many reasons, the Maestro and Q cannot share the truth with us in a direct way, they have to code the news from the battlefield:\n\nQ2712 Why must we communicate this way? Think NAT SEC laws. Q\n\nAs you may know by now, Q is extremely nuanced. This “NAT SEC laws” has a double meaning. Besides the regulatory perspective, there are also the laws governing social peace and preventing us from experiencing a mass panic.\n\nQ22 Biggest drop to ever be provided on Pol. Study and prepare. The masses tend to panic in such situations. No war. No civil unrest. Clean and swift.\n\nThis drop is proof the Maestro and his troops are going to take out the Cabal silently, elegantly, and mercilessly. Popcorn for those who can see.\n\nQ1069 We are in control. Those awake can see. Q\n\nTo know what happened yesterday, you need to take a close look at the Maestro’s tweets. He posted 5 tweets, distributed in 6 drops and finished the day with one re-tweet from FLOTUS. I will list the tweets for you in the following image.\n\nImg1 Read them very carefully, then think about what you read for a minute and take a step back to try to see the big picture. Will you be able to crack the code and see which bomb exploded?\n\nLet’s apply the usual method I showed you to extract the Maestro’s hidden message: we will first decode each tweet by finding the coded message corresponding to the gematria value of the capital letters. To do that, we will use the Q drop identified through the tweet DC military timestamp to find the context and narrow the list of possibilities. Then, we will gather the pieces of the puzzle and extract the general coded message.\n\nImg2 The timestamp is 8:55, we go to Q855 and the first lines read 1 of 5, then 2 of 5 and are separated by a number. Coincidence? The Maestro is saying he is going to post 5 tweets and this one and the next one, put together, should be considered as the first tweet. Hence the suspension points. Then, going to the nitty-gritty, there is a clear reference to America being sold out by their treasonous political leaders and that HRC’s victory would have been the nail in the coffin. In the simple Gematria system, the capital letters add up to IGGUSIAT=93=CYMATICS video. The principle behind cymatics is to alter matter geometrical shapes through frequencies. If you apply this at the biological cellular level, imagine all the things you may be able to do… Peruvian Coffee for those who noticed that we should consider the Jewish Gematria value of 558! This number is the timestamp 8:55 read from right to left which is exactly how Hebrew is read. With this clue, we are told we should use the Jewish Gematria system. We find: IGGUSIAT=558 (in English Gematria)=THEY FAILED (in Jewish Gematria). We can now extract the decoded message for this particular piece. Read very carefully.\n\nImg3 The timestamp is 8:59, we go to Q859. The weak spec steel import model is confirmed with the Kobe Steel scandal but there is more: do you see this ‘people’ broken by numbers adding up to 34=32+2? This symbolizes the programming and control of people by secret societies like Skull and Bones through the use of frequencies as confirmed in Q772. The capital letters add up to IUSW=72=DISCORD. You got it, we are talking about mass zombification of America, persisting division and social unrest. Read the decoded message.\n\nAs you can see, the picture shown about 5G is pretty somber right? Then why would the Maestro tweet he wants 5G and even 6G as soon as possible? Answer: because the wall is being built!!! America is now ready! Do you see it?! He tweeted about the wall R=18 minutes after talking about 5G. Why? Because it’s Related! BOOM! The bomb has just exploded: the wall is also about protecting America from the harm of 5G! So you thought the largest Military Spending Bill of our history was only about building a physical wall at the southern border? You thought everything we know and talk about regarding 5G and how it can harm humans was going to be overlooked by POTUS?\n\nThe wall is about protecting us from ALL TYPES OF WEAPONS AND ARMIES FROM ALL DIMENSIONNS that were gathered by our former treasonous political leaders in order to weaken us, enslave us and invade us.\n\nQ1009 The WALL means more than you know. The FIGHT for the WALL is for so much more. Q\n\nHow do you protect the American People from a tangible threat without causing a mass panic? Regulation? You don’t have time:\n\nQ166 Bad actors gather metadata and targeting. Small example of the ongoing silent war. Options? Regulate? Problem: time to complete. Solution? Patriots, get the word out. Jason Bourne (Deep Dream). Q\n\nSince Trump’s election, hundreds of billions of dollars have been quietly invested in R&D in the most advanced fields in biology, technology and military warfare to protect America and correct its course. Under the Maestro’s command, our most brilliant minds have been working behind the scenes to build an integrated set of protections to shield us from the various types of threats that were identified. This integrated set of protections is what the Maestro generically called: THE WALL.\n\nIf you think about what I have just said, you will see the wall for the Fake News is QANON!\n\nNow that I have revealed this amazing secret to you, the rest of the decoding becomes almost trivial. Let’s finish it. Try to get ahead of me this time.\n\nImg4 The timestamp brings in Q917 where, projected in this decoding context, a parent is worrying about the safety and health issues related to 5G networks. The answer is in the capital letters adding up to 456. A big load of Peruvian Coffee for those who noticed 456 is a multiple of 6 and is therefore eligible to the English Gematria system and that we should consider it. Why? Because this is why the Maestro said “and even 6G” in the first tweet: since G=7, 6G can be written 67. Take its mirror (76) and multiply it by 6. What do you get? Yes, 456. What does it mean? It means the Maestro is answering to this parent with 6 different matches for 76. Here they are: HIDDEN AGENDA, PAIN REAL, THE PLAN, LIBERATED, SAFETY, HEAL AMERICA. Notice the length of the wall construction video in the tweet: 23 seconds. This is the Trump/Q dynamics I told you about in previous posts and confirmed by the “revealed” password in Q1415. The Maestro puts it here to show the 322/32 Skull and Bones dynamics we saw in the previous message is reversed by THE WALL and neutralized.\n\nImg5 The first tweet refers to the recent Jussie Smollett scandal. The capital letters of the first tweet add up to 73=BIPOLAR, which is confirmed by the capital letters of the second tweet adding up to 293 and equaling THE ACTOR IS LOST IN HIS ROLE=293. The timestamps bring in Q1109 and Q1510 where we learn this mass confusion illustrated by the Smollet example is engineered by the Dems and their puppet masters through technology, evil and corruption. We get the confirmation California/Hollywood is their HQ and experimenting platform. This allows us to extract the decoded message.\n\nImg6 The timestamp is 7:27PM, which is 19:27 military time. We go to Q1927 where we find the lines about subversion and National Emergency. The capital letters add up to 124, value for REVERSE FATE. Read the decoded message.\n\nImg7 Amazing re-tweet by POTUS. He re-tweets a tweet from FLOTUS. Look at the timestamp: 8:55PM. It therefore points to Q2055 which brings the general idea of outstanding expertise and competence that I told you about in piece of the puzzle 2. You thought everything I told you about our brightest minds quietly working to build THE WALL was me guessing? No. I took it from this re-tweet. But there is more. Remember, POTUS tweeted his first 5G tweet of the day at 08:55 AM. FLOTUS tweeted this uplifting message at 08:55PM. Coincidence? Do you see the Cosmic Dance I am seeing? Close your eyes… Expand your thinking… video. The Maestro is essentially saying: “the darkness they wanted to plunge America into has been reversed. With 5G, the Enemies of America wanted to kill us with our children but I put our brightest minds to work. I have built THE WALL and we are now safe. You wanted 5G? HAVE FUN!”\n\nDo you now see THE WALL?\n\nAnd for our digital warriors out there, here is the complete decoded message: Img8\n\nPost by SerialBrain2 on VOAT on Feb 23, 2019\n\nCCAfixspecialist — After listening to VPOTUS at the Hudson Institute and his dower message about how the Chinese have infiltrated the fabric of our Nation and listening to several friends persistent rants about the dangers of 5G,\n\nThis is the message [tweets] I sent this morning at 08:22 22 Feb 2019 — realDonaldTrump long adverse biological effects: •DNA single and double strand breaks •oxidative damage •disruption of cell metabolism •increased blood brain barrier permeability •melatonin reduction •disruption to brain glucose metabolism •generation of stress proteins”\n\n[Mr. President] CAUTION please consider Health & means of protection. Q # QAnon Chinese are subversion inside USA, why SALES PITCH better cell phone coverage to compete against them with 5G. What are protections against 5G radiation?\n\nAs you have just revealed the answers came instantaneously = Coincidence? probably! But also reassurance and verification @realDonaldTrump, is no fool and well aware and ahead of the risks of 5G as we thought we knew it. Thank you Serial Brain, Thank you Q and Thank you Patriots WWG1WGA\n\njjacaranda11– Further consideration of this excellent post leads me to make the following comment about 5G:\n• On September 11, 2017 170 scientists from 37 countries issued a joint statement warning about the dangers of 5G. See their statement at this link.\n• Eric Schmidt, CEO of Google/Alphabet resigned from his position on 12/21/2017, the same day President Trump signed the EO seizing the assets of anyone involved in ‘corruption or human/child trafficking.’ article here What was ES doing that put Google/Alphabet at risk of asset seizure? We are going to find out post DECLAS. You can read the EO at this link, it is quite emphatic in its intention. This is a pivotal element in the battle against the deep state and the corrupt elements in government, Congress, and around the world.\n• Eric Schmidt then went to China where he built out their Dragonfly system which is a highly sophisticated AI Based system of total surveillance and weaponized 5G implementation (note weaponized is the operative term here). He has not, as far as I know, returned to the US since then. Dragonfly is so invasive and dangerous that Google engineers refused to work on it. See article\n• Qualcom and Broadcom were set to become one company, which would have created a 5G juggernaut. President Trump cancelled that merger in March 2018. See article. Why did he do that? With internet ownership firmly in the hands of ICANN (think UN) based in California (which is heavily compromised by China, thanks to Diane Feinstein and Obama’s sellout of the US to China), weaponized 5G would have been implemented and we would have been powerless to stop it.\n• Remember when Huawei CEO was arrested in December? Huawei is a big player in the 5G market. Is Eric Schmidt involved here? I do not know but there is more to this event than we are being told.\n• President Trump knows that about the dangers of 5G. If not, he would never have blocked the Qualcom/Broadcom merger. But he also knows about alternatives to 5G because he has been informed by his uncle. John Trump, who was selected by the FBI to review Tesla’s papers after he died. see article. Is there a non-lethal form of 5G and higher energy that can be safely implemented? Yes there is and anyone who has studied Tesla knows that he patented this in the 1880s. Trump knows about this and I believe this technology, which is part of the more than 5000 patents that are hidden by the DS, is what he is going to implement.\n\nAs Q says, ‘we have it all.’ And that says a lot.\n\nFFembotsForHillary– Q1010: The WALL means more than you know.\n\nI have pondered why Q has told us the above. It is a direct challenge to uncover that THE WALL has different meanings, many of which are not so obvious.\n• Filter Device (of people, products, contagious diseases, etc. via ports of entry)\n\nNo. 5 contains the Not-So-Obvious Metaphorical/ Metaphysical definitions of WALL as Other Filter Devices: a.) Human mind- (filter our thoughts); one can have walled-off thinking.\n\nb.) Human emotions- (one can be walled-off emotionally, stuck in an emotional pattern, like anger)\n\nc.) Human Brain- (filters perception of the 5 senses: hearing, vision, smell, taste, feeling sensation)\n\nPhysical injury to the brain by impact, tumor, drugs, stroke etc. can affect how one perceives the world & neural cognitive responses. Emotional trauma can have the same impact. Even mundane things impact our senses: Have you ever had a song that you couldn’t get out of your head? How does the brain filter memory? What other perceptual affects occur when one is affected (like that stuck song in your head)? How does that affect your emotions?\n\nJust a cursory search through the NIH website shows how much scientific research is done nationally & how easily it is to manipulate perception of the 5 senses as well as providing the measurements to do so.\n\nE.g. “Street-level noise in an urban setting: assessment and contribution to personal exposure” [https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4350859/]\n\nAs we age our hearing decreases requiring devices to filter background noise. But, increasing decibels of street noise is also damaging the physical properties of hearing (inner ear hair cells). Our visual perception begins to deteriorate, sometimes quite rapidly. Visual Studies are measuring the effects of computer screens, radiation, & increasing amounts of people with cataracts, retinal damage.\n\nScience inquiry strives to understand what causes these deleterious effects…. and we can easily infer that this science is still being used to bring harm to humans to overpower them (MK ultra experiments).\n\nd.) the Immune-System (the wall within our bodies that safeguards us from disease)\n\nIndeed, there has been a measurable increase in the amount of auto-immune diseases, hormonal imbalances, cancers, & chronic conditions. The fight against mandatory immunization, the Pro-organic movement, people doing yoga are all indications of this. No matter our personal beliefs about these issues many health advocates are addressing the reality that our immune systems are constantly being weakened by pollution, chemicals, GMO foods, radiation etc.\n\ne.) the Human Energy Field (HEF) is another WALL. IMO, The HEF is the most important WALL we as humans should know about. But many of us are unaware of. It is a person’s barrier to other energies outside himself/herself. It’s an individual’s bundle of energy (or as some call it one’s soul, or one’s aura). The HEF has been measured & mapped within the study of metaphysics’s.\n\nThe concept of human energy & its relation to healing has been ancient knowledge within many Asian belief systems/religions. They contend Humans have the ability to either strengthen, or weaken this energy, our “Chi” (one’s “life source”) via the energy pathways within our bodies. You can search the various belief systems of energy on the internet (i.e. Ayurveda, acupuncture) & how it affects our ability to heal our bodies /promote inner peace\n\nThis is THE WALL that the Cabal/DS seeks ultimately to penetrate & break down because it is so fundamental to our beings. Information about the strength of this WALL has been kept from us. They have tried to destroy it with detachment of our connection to God & the Divine. They try to control our consumption habits, our sleep (Daylight Savings Time), and now are trying to enslave the world with harmful 5G (by constantly disrupting those energies within us).\n\nHarmful 5G frequencies emit higher frequency tones. High frequencies are often described as constant ringing within ones head. Depending on the loudness, pervasiveness, or duration one perceives, it can overtime drive a person to craziness. Others report strong bad vibes — fear, mental/emotional confusion, pain– that they strive to run away from. But they can’t. The perception of an inability to escape (like a bad trip on LSD) can lead to constant uncontrollable hallucinations & a desire to commit suicide). It would be easy for “voices from phones” to seem like voices from within their heads telling them how they can escape.\n\nLike SB2 shows, doing so does turn us effectively into Zombies. Americans are already just going about their days unaware of why & how their personal energy is being drained, suppressed, indeed stolen (sucked right out of them).\n\nImporting “harmful 5G” would cause massive amounts of people to feel like they’re in an inescapable bad acid trip while changing the energy production within their cells.\n\nThis is what we MAGA Q Anon people have to start explaining to everyone we interact with.\n\nThank God President Trump and the Q team are fighting to stop this from happening.\n\nFractalizingIron– SB Deux, just a query. I checked the Gem trail and wandered around a bit in there. Anyway, you wrote: “Peruvian Coffee for those who noticed that the Jewish Gematria value of the capital letters is 558!” What I saw at the Gem.org site is that the English simple was 558, and the Jewish was 423 (“IGGUSIAT”). Did I miss something here? Jewish 558 is “they failed” but the connection from IGGUSIAT to Jewish 558 is missing for me.\n\nSerialBrain2[S] — You are right, the way I finally wrote it should have been more explicit and does not describe all the operations I mentally made before starting to write. The English value is an intermediary value that can be skipped because it is always the simple value multiplied by 6. I therefore made a direct link from 93 to J[558] through the inversion of the timestamp. Here is a better way to write it and describe ALL the logical steps: “we notice the capital letters are equivalent to the Jewish value of 558 because their English value is the timestamp read from right to left, which is a hint we should consider the Jewish value of 558. By doing so, we hit THEY FAILED”. It was a riddle in the riddle.\n\nWhite-Squall– Yes. The True Wall that’ll protect us more than just physically but in the electro-magnetic realm. This is good news SB2 because I had been concerned about 5G for some time. But if it’s done right it’ll be much safer than the current systems we have. Most of us are ramming WiFi signals/beams through our bodies and brains right in our own homes. If there’s a way to get clear, unbroken signal into our homes and reduce the RFs that’d be ideal. Otherwise we’d have been stuck with Pink Floyd’s “just another brick in the wall!” Speaking of that song, I do like the line, “We don’t need no thought control…” Great work my friend! We have to trust POTUS! Those who ran this Country before him were running it into the ground!\n\nI knew there was more to the 5G/6G post and that our Maestro would not allow this weaponized and dangerous technology to be implemented without first ensuring that it would be safe to use. This is also in the domain of the space force, the wall is not just physical, it is using technology to protect us from their dangerous tech which has the capability of creating mass casualties in the short term and even greater destruction in the longer term.", "opengraph": {"title": "5G Q Decode by SerialBrain2", "description": "For many reasons, the Maestro (Pres Trump) and Q cannot share the truth with us in a direct way, they have to code the news.  Post by SerialBrain2", "image": "https://americandigitalnews.com/wp-content/uploads/7chb.png", "image:width": "1920", "image:height": "1081", "type": "article", "article:published_time": "2019-02-25T03:01:01+00:00", "article:modified_time": "2019-02-25T03:07:41+00:00", "article:tag": "Trump Tweets", "url": "https://americandigitalnews.com/index.php/2019/02/24/5g-q-decode-by-serialbrain2/", "site_name": "American Digital News", "image:type": "image/png"}, "tags": ["Tech", "National News", "ADN News"], "tweets": [], "movies": [], "links": ["https://www.reddit.com/user/SerialBrain2/comments/atm9l0/the_bomb_that_went_off_yesterday_that_you/", "http://magaimg.net/img/7ch0.png", "http://magaimg.net/img/7cp2.png", "https://youtu.be/wvJAgrUBF4w", "http://magaimg.net/img/7ch4.png", "http://magaimg.net/img/7chw.png", "http://magaimg.net/img/7ch8.png", "http://magaimg.net/img/7ch9.png", "http://magaimg.net/img/7cha.png", "https://youtu.be/yUecc7hYJyM?t=90", "http://magaimg.net/img/7chb.png", "https://www.serial.rocks/post-141", "https://www.reddit.com/user/CAfixspecialist", "https://twitter.com/realDonaldTrump", "https://twitter.com/hashtag/Health?src=hash", "https://twitter.com/hashtag/Q?src=hash", "https://twitter.com/hashtag/QAnon?src=hash", "https://www.reddit.com/user/jacaranda11", "https://www.actu-environnement.com/media/pdf/news-29640-appel-scientifiques-5g.pdf", "http://fortune.com/2017/12/21/eric-schmidt-stepping-down-google-alphabet/", "https://www.whitehouse.gov/presidential-actions/executive-order-blocking-property-persons-involved-serious-human-rights-abuse-corruption/", "https://www.foxbusiness.com/business-leaders/google-employees-say-project-dragonfly-china-search-engine-plan-must-stop", "https://www.reuters.com/article/us-qualcomm-m-a-broadcom-merger-idUSKCN1GO1Q4", "https://www.newyorker.com/news/amy-davidson/donald-trumps-nuclear-uncle", "https://www.reddit.com/user/FembotsForHillary", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4350859/", "https://americandigitalnews.com/index.php/2019/02/24/5g-by-jon-rappoport/", "https://americandigitalnews.com/index.php/2019/02/24/5g-q-decode-by-serialbrain2/"], "authors": ["Ami Tiel"], "publish_date": "2019-02-25T03:01:01+00:00"}