{"result_id": "022017", "URL": "https://americandigitalnews.com/index.php/2022/07/07/7-7-22-adn-evening-news-lineup/", "timestamp": "2023-04-25 12:00:16 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://americandigitalnews.com/wp-content/uploads/ADN-red-favacon.jpg", "canonical": "https://americandigitalnews.com/index.php/2022/07/07/7-7-22-adn-evening-news-lineup/", "encoding": "UTF-8"}, "image": null, "domain": "americandigitalnews.com", "title": "7/7/22 ADN EVENING NEWS LINEUP", "cleaned_text": "staying well informed is more important than ever.\n\nWho do you trust?\n\nWhat can you believe?\n\nWhere will you turn for news?\n\nWith more & more fake news, sensational click bait headlines & propaganda articles clouding the truth; using biased & unreliable sources to stay informed can lead to radical views & often closed minded political beliefs.\n\nIf you don’t challenge those opinionated sources, you will end up distrusting legitimate facts & verified information. ADN provides accurate & verified sources including articles pertinent to yesterday, today and tomorrow.\n\n1.Fire out after pipeline explosion in west Fort Bend County, Precinct 1 says MSN Large pipeline explosion FortBend, Texas Multiple emergency crews and authorities are at the scene of a large Pipeline explosion in Fort Bend County TX as Large Flames from pipeline explosion burst up about 300 feet in air so far no injuries.\n\nEmergency crews responded to a pipeline explosion just west of Orchard in west Fort Bend County late Thursday morning, according to the Precinct 1 Constable’s Office.\n\nThe flames from the explosion appear to be out.\n\n2.BREAKING: Adam Schiff moves to block any evidence collected by US military from being used in Congressional investigations – unless previously authorized. The move is designed to ensure Republican investigators can’t utilize military intelligence gathering.\n\nR3.📌From Today, All New Vehicles In The EU Will Have Surveillance Black Boxes ZEROHEDGE From today, all new vehicles sold in the EU will have mandatory black boxes fitted that record technical data and will be accessible by authorities, greasing the skids for surveillance-powered speed limiting technology.\n\nThe US Treasury said Wednesday it was freezing the assets of members of an international network for violating oil sanctions on Tehran by selling millions of dollars’ worth of Iranian petrochemical products to East Asia.\n\nR5.📌SPLC Dems’ January 6th Committee Is Quietly Collaborating With The ‘Left’s Top Censor’: REPORT THE DAILY CALLER\n\nThe Southern Poverty Law Center (SPLC), a left-wing nonprofit that critics say targets conservative and Christian groups, is reportedly funneling research to the “nonpartisan” committee probing the Jan. 6 Capitol riot.\n\n🔷Twin 10-Year-Old Boys Save Drowning Dad: ‘Jesus Was Standing Right Behind Us the Whole Time’ THE WESTERN JOURNAL A family in Mountain Brook, Alabama, is incredibly grateful for the gift of life today after nearly losing husband and father Brad Hassig.\n\nHassig, a chiropractor, likes to meditate and has a habit of using the family pool as a calming\n\nOn June 14, Hassig was in the pool with his twin sons Bridon and Christian, who are 10, and\n\nneighbor boy Sam, 11, while Hassig’s wife was at work. The boys played while he did his\n\nbreathing exercises and sat underwater in the shallow end of the pool.\n\n6.Biden to Complete Section of Trump Border Wall in California NEWSMAX The Biden administration approved a Trump-era project to complete a section of a southern border wall in California.\n\nWhy Blue California and not Red Texas? An invasion has been declared. This madness needs to end. Now!\n\n📌Biden to FINISH section of Trump’s border wall in Calif and close park where separated families meet DAILY MAIL ONLINE The Biden administration has approved a Trump-era project finishing a section of the southern border wall in the western-most point of the U.S. along the border with Mexico in California.\n\n📌BREAKING: Texas Governor Greg Abbott has issued an executive order authorizing Texas DPS & TX National Guard to apprehend illegal immigrants and return them to the border. His office tells me they will be returned to ports of entry on the U.S. side, *NOT* to Mexico. In the executive order, Governor Abbott references Article IV Section 4 of the U.S. Constitution, which guarantees states federal protection from invasion, but Abbott does not declare an invasion at the southern border.\n\nThis is a half-ass effort by Abbott. He should be declaring an invasion because that’s exactly what it is. The Federal Government is failing to follow Article 4 Section IV of the U.S. Constitution protecting states from invasion\n\nR7.📌EPIC: Arizona Congressional Candidate Jerone Davison Exposes The RACIST Democratic Party in New Ad: “When This Rifle Is The Only Thing Standing Between Your Family And a Dozen Angry Democrats In Klan Hoods…” THE GATEWAY PUNDIT Former NFL player, pastor, and US Congressional Candidate Jerone Davison just released an incredible new ad defending gun rights and exposing the party of white supremacy and the KKK.\n\nJerone is the MAGA Republican candidate running in Arizona’s Congressional District four against Democrat incumbent Greg Stanton.\n\nThe FBI director and his deputy were staunch enemies of the former president, who pushed for the pair’s dismissal and prosecution.\n\nRP9.📌The Supreme Court’s next target is the executive branch AXIOS\n\nThe court is determined to rein in regulatory agencies.\n\n10.📌IRAN Iran’s Security Chief: Tehran Attended Doha Talks To Reach A Deal IRAN FRONT PAGE The secretary of Iran’s Supreme National Security Council has told Qatar’s foreign minister that Iran took part in the Doha talks to reach a strong, lasting and reliable nuclear deal with the other parties.\n\n📌IRAN CALLING US Iran denounces US as “biggest violator of human rights” in annual report BIG NEWS NETWORK “Nowadays, the U.S. imposition of unilateral coercive sanctions has turned into a tool to violate the human rights of the Iranian people,” Iranian Foreign Ministry said in its annual report on U.S. human rights.\n\nWashington’s unilateral sanctions have also caused “irreparable damage” to the health of the vulnerable members of the Iranian society, the ministry said, adding that the negative impact has been “very tangible and destructive.”\n\n1.📌‘Herd is strong in Westminster’ Boris takes bitter parting shot at MPs as he admits defeat EXPRESS.CO.UK BORIS JOHNSON is to quit as Prime Minister after his own MPs left him with no choice but to stand down.\n\nThe Great Exodus within the U.K. Government🔥\n\nResignations so far with immediate effect….\n\n(4) Saqib Bhatti MP parliamentary private Secretary to the Secretary of state for health and social care.\n\n(5) Jonathan Gullis parliamentary private Secretary to the Secretary of state for Northern Ireland.\n\n(11) Laura Trott MP for parliamentary private Secretary to the Department for Transport.\n\n(12) Will Quince MP minister for families and children.\n\n(13) Robin Walker Minister of State for School Standards of United Kingdom.\n\n(15) Felicity Buchan Private Secretary in the Department of Business energy and industrial strategy.\n\n(18) Stuart Andrew, Minister of state for housing at the Department for Levelling Up, Housing & Communities\n\n(21) David Johnston, parliamentary private secretary at the Department for Education\n\n(22) Kemi Badenoch, Minister of state at the Department for Levelling Up, Housing & Communities\n\n(23) Julia Lopez, Minister of state at the Department for Digital, Culture, Media & Sport\n\n(24) Lee Rowley, parliamentary under-secretary of state at the Department for Business, Energy & Industrial Strategy\n\n(25) Neil O’Brien, parliamentary under-secretary of state at the Department for Levelling Up, Housing & Communities\n\n(26) Alex Burghart, parliamentary under-secretary of state at the Department for Education\n\n(27) Mims Davies, parliamentary under-secretary of state at the Department for Work & Pensions\n\n(28) Duncan Baker, parliamentary private secretary at the Department for Levelling Up, Housing & Communities\n\n(31) Rachel Maclean, parliamentary under-secretary of state for safeguarding at the Home Office\n\n(32) Mike Freer, parliamentary under-secretary of state for exports at the Department for International Trade\n\n(33) Mark Fletcher, parliamentary private secretary at the Department for Business, Energy & Industrial Strategy\n\n(34) Sara Britcliffe, parliamentary private secretary at the Department for Education\n\n(36) Peter Gibson, parliamentary private secretary at the Department for International Trade\n\n(38) James Sunderland, parliamentary private secretary at the Department for Environment, Food & Rural Affairs\n\nR2.📌US Marshals capture more than 1,500 fugitives in 10 cities JUST THE NEWS The U.S. Marshals Service announced the arrests of 1,500 fugitives, including sex offenders, violent criminals, and self-identified gang members, in a 30-day operation across 10 cities.\n\nThe Department of Justice said in a press release Wednesday that Operation North Star was a “high-impact fugitive apprehension initiative aimed at combating violent crime in 10 cities with a significant number of homicides and shootings.”\n\n3.📌Republicans Turn Up Heat on Pelosi After J6 Subpoenas, Vow Their Own Probes CONSERVATIVE BRIEF Republicans upset that several of their own members have been subpoenaed by the committee looking into the Jan. 6, 2021, incident at the U.S. Capitol Building has turned up the heat on the woman responsible for selecting the panel: Speaker Nancy Pelosi.\n\nIn February, just weeks after the riot, a group of four Republicans sent the California Democrat a letter asking why she did not do more to protect the Capitol, including requesting National Guard deployments and a bulked-up Capitol Police presence.\n\nBut Pelosi, at least publicly, did not respond to the members’ letter requesting explanations.\n\nR4.Woke Coffee Shop Shuts Down After Even-More-Woke Employees Issue List of Insane Demands THE WESTERN JOURNAL While the owners of the shop committed to wokeness early on, the far left employees eventually came from them.\n\n5.📌At least 200 shot, killed in July 4 holiday weekend gun violence across US INSIDER PAPER According to the Gun Violence Archive, gun violence increased over the Fourth of July weekend, with shootings reported in nearly every US state, with at least 220 people killed and 570 others injured.\n\n🔷Incredible Moment Kentucky Cop Saves Seven-Day-Old Baby Girl’s Life by Giving Her CPR RESIST THE MAINSTREAM Watch: Incredible Moment Kentucky Cop Saves Seven-Day-Old Baby Girl’s Life by Giving Her CPR There goes a hero.\n\nR6.📌Lauren Boebert rages after Rep. Eric Swalwell shares these photos of her QUEERTY Colorado GOP Rep. Lauren Boebert and California Democratic Rep. Eric Swalwell have little admiration for one another. The two have exchanged a number of angry tweets in the wake of the Highland Park mass shooting in Chicago on Independence Day.\n\n7.📌Stocks enjoy bounce, sterling and FTSE up as Johnson to resign INSIDER PAPER\n\nEquities rose Thursday following a recent sharp drop, though recession fears continue to cast a shadow over markets with the euro stuck.\n\nR8.📌COV19 Doctor Issues Warning About Giving COVID-19 Vaccines to Babies RESIST THE MAINSTREAM Doctors continue to sound the alarm as the Biden administration celebrates the rollout of COVID-19 vaccines for children under five years old. The Epoch Times reports that according to Dr. Syed Haider — an internal medicine specialist and founder of mygotodoc.com — “the risk of the vaccine far outweighs the benefit.”\n\nThe Epoch Times reports that on June 18, Rochelle Walensky, director of the U.S. Centers for Disease Control and Prevention (CDC), “endorsed the Advisory Committee on Immunization Practices (ACIP) recommendation that all children 6 months through 5 years of age should receive a COVID-19 vaccine.”\n\n9.📌Europe Catches Major Blowback in Failed Attempt to Confront Russia THE GATEWAY PUNDIT Not since Wile E Coyote’s repeated failures to nab the Road Runner have we seen debacles like the ones now unfolding in the UK and Europe as a consequence of their misguided effort to destroy Russia.\n\nGermany’s economy is on the precipice. With an economy dependent of the import of oil and gas from Russia, German Prime Minister Olaf Scholz thought it a dandy idea to cut itself off from its main supplier. What could go wrong with that?\n\nRP10.📌Trump Was Right, German Housing Group Begins to Throttle Tenants’ Heating at Night to Save Gas THE GATEWAY PUNDIT Just as former President Trump warned, Germany has placed too much reliance on Russian gas, and now its residents will pay the prices as hundreds of thousands of Germans will be unable to adequately heat their homes this winter.\n\nOn Thursday, in response to Gazprom’s supply cutbacks, Germany’s housing and real estate association called for the minimum temperature for homes to be considerably reduced to a maximum of 64 degrees in case there is another drop in Russian gas supplies.\n\n📌Yikes! Nancy Pelosi Flashes Major Cleavage at Italian Beach Resort Owned by Andrea Bocelli THE GATEWAY PUNDIT *Yikes* 82-year-old Nancy Pelosi strutted down the beach at an Italian resort owned by opera singer Andrea Bocelli showing major cleavage.\n\nThe New York Post obtained the photos of the Democrat Speaker of the House and her husband, Paul Pelosi hanging out (literally) at the Alpamare Beach Club.\n\nGood Day Patriots Happy Thursday Plastic Girl Reporting here today’s top story includes old and senile Joe Biden has a difficult time saying mental fitness so it’s no surprise that most Americans question Biden’s mental fitness in a new poll.\n\nBack in December, Joe Biden had a difficult time saying “mental fitness”. This did not bode well for a guy who shows a lack of mental fitness daily in front of the whole world.\n\nAt a recent speech, Biden ended by turning to his right and attempting to shake hands with someone who wasn’t there. His handlers know of his senility and often attempt to hide his mental fitness even if they have to dress up as the Easter Bunny to do so. So it’s really no surprise that most Americans don’t think Biden is mentally competent.\n\nThe latest Harvard-Harris poll has lots and lots of unpleasant news for Democrats heading into the midterms, as well as one odd piece of not-bad data, but this looks like an utter disaster in a cycle that will serve as a referendum on Biden’s performance. Almost two-thirds of voters think Biden’s too old for the job, and sixty percent doubt his mental fitness for the presidency.\n\nWe knew when Biden was ‘running’ for office from his basement that he was in terrible shape. This leads us to the question of who is really running the US right now. Biden is corrupt but he is too senile to be running anything. He likely can’t make it to the bathroom in the middle of the night alone.\n\n📉 Biden has negative approval in every state except Hawaii and Vermont\n\n💬 CNN says Dems view Biden’s leadership as ‘rudderless, aimless, and hopeless’\n\n🙌🏻Campaign to recall D.A. Gascón has submitted thousands of signatures.\n\n💉 Some 40,000 National Guard and 22,000 Reserve soldiers who refused to be vaccinated against COVID-19 are no longer allowed to participate in their military duties, also effectively cutting them off from some of their military benefits. [Military.com]\n\n💩 Amid rising crime in New York City, one of Mayor Eric Adams’ aides was mugged in broad daylight Tuesday. The aide warned “I work for the mayor” but the thief was undeterred, brandished a pistol, and robbed the man. [NY Post]\n\n👨‍🌾Dutch farmers in the Netherlands are holding massive nationwide protests against their government after it passed extreme climate policies which are making it impossible for them to survive and straining the country’s food supply.[Daily Wire]\n\n🤡The Biden regime is reportedly planning to lift U.S. tariffs on Chinese goods in a last-ditch attempt to lower inflation before the 2022 midterm elections. [Epoch Times]\n\n🤮Netflixs “Cheer” star Biden campaign surrogate, Jerry Harris sentenced to 12 years for child pornography. Harris will be required to register as a sex offender for life. [Breitbart]\n\n🎥 Hunter Crack Head Biden filmed himself doing crack while on a detox at a health spa in Massachusetts in 2019 paid for after Joe Biden gave him $75,000.\n\n🎥 President Trump’s personal airplane that he used during the 2016 campaign just got a major face-lift. Looks like he’s coming back and sooner then you think\n\n🎥They figured out who blew up the Georgia Guidestones this is a much watch 😂🤣\n\n🙌🏻The remainder of the Georgia Guidestones have been demolished following the mysterious explosion. [This is God’s way of taking the darkness out]\n\nSATIRE BREAKING: New witness for the January 6 committee alleges President Trump blew up the friggin Georgia Guidestones. IL DONALDO TRUMPO\n\n📌Father of Highland Park Shooter, Who Helped Him Obtain His Guns, Claims His Son Has ‘Good Morals’\n\nThe father of the man who fatally shot seven people during a Fourth of July celebration has done an interview with the media, during which he claimed that his murderous son had “good morals.”\n\nSpeaking to ABC 7 Chicago, Robert Crimo Jr., who ran for mayor of the town where the shooting occurred in 2018, took no responsibility for helping his son obtain guns.\n\n📌Officials Reveal How Highland Park Shooter Was Able To Buy Guns Despite ‘Red Flag’ Laws\n\nStunning New Details Reveal How Highland Park Shooter Got Guns Despite ‘Red Flag’ Laws\n\nA local rabbi has told the Daily Caller News Foundation that the alleged Highland Park, Illinois, shooter visited his synagogue before his planned indiscriminate, murderous rampage.\n\n‘Who knows what goes on in his heart.’\n\n📌NEW: Uvalde Police Officer Who Had Clear Shot to Take Out Ramos Before He Entered Robb Elementary School Asked Supervisor For Permission to Shoot but Got No Answer THE GATEWAY PUNDIT\n\nAn armed Uvalde police officer had a clear shot to take out Salvador Ramos before he entered Robb Elementary School and fatally shot 19 children and 2 adults in late May.\n\nIn late May 18-year-old Salvador Ramos fatally shot 19 children and 2 adults at Robb Elementary School in Uvalde, Texas.\n\nPresident Vladimir Putin on Thursday that the West could try to defeat Russia “on the battlefield” and said Moscow’s intervention in Ukraine.\n\n📌UK says it seized advanced weaponry smuggled from Iran INSIDER PAPER\n\nBritain on Thursday said one of its warships on patrol in the Gulf earlier this year seized advanced weaponry being smuggled from Iran.\n\n📌Russian prosecutor seeks 7 years in jail for councillor over Ukraine criticism INSIDER PAPER\n\nA Russian prosecutor on Thursday requested a seven-year prison term for a Moscow city councilor for criticizing Russia’s military intervention in Ukraine, AFP reported from court.\n\nAlexei Gorinov, a 60-year-old lawyer by training, was arrested in late April for spreading “knowingly false information” about the Russian army and is now on trial.\n\nThe charges come under new legislation that allows prison time for discrediting the Russian military and is part of Moscow’s increasing efforts to silence dissent.\n\n📌Dutch Farmer Protest Update: 16-Year-Old Jouke Freed; Document Reveals Government Plans to Confiscate Farms for Asylum Seekers THE GATEWAY PUNDIT\n\nFarmers‘ protests in the Netherlands have reached the royal palace at Dam Square in Amsterdam. 16-year old Jouke, who was shot at by a police officer on Tuesday, was released without charges.\n\nOpposition leader Geert Wilders released a bombshell letter showing the globalist Dutch government wants to use expropriated agricultural land for asylum centers.\n\nUkrainian President Volodymyr Zelensky on Thursday telephoned Boris Johnson to express his “sadness” over the British leader’s resignation as Conservative leader and impending departure as prime minister, Kyiv said.\n\n📌“We Are Not Slaves, We Are Farmers!” – Polish and Italian Farmers RISE UP Against Government Elites Destroying Their Family Businesses THE GATEWAY PUNDIT\n\nFarmer protests continued in The Netherlands on Thursday. And now the movement is spreading. Farmer protests were launched in Italy and Poland on Thursday. Farmers in The Netherlands blocked supermarket distribution hubs on Monday, July 4th.\n\nIranian media reports that the Revolutionary Guards had arrested several foreign diplomats for espionage sowed confusion Thursday, after two.\n\n📌Japan introduces up to one-year jail time for cyberbullying INSIDER PAPER\n\nPeople found guilty of cyberbullying in Japan now face up to a year in prison under rules implemented Thursday, which were toughened up after.\n\nBritain’s ambassador to Iran on Thursday said a diplomat reported arrested by state media had ended his post and left the Islamic republic.\n\nA court in the Russian Far Eastern city of Vladivostok sentenced a dozen North Korean fishermen to long sentences for attacking Russian coast.\n\nOne of WikiLeaks founder Julian Assange’s lawyers, Jennifer Robinson, has reached a settlement with the Government after it accepted her rights were likely breached after covert surveillance, she said.\n\n📌❗🇬🇧 Boris Johnson to remain as Interim Prime Minister, till a new conservative party leader is elected.\n\nOutgoing British Prime Minister Boris Johnson told his rejigged cabinet Thursday that “major fiscal decisions” should be left for his successor, hours after announcing his resignation as Conservative party leader.\n\nIrish premier Micheal Martin said Thursday that Boris Johnson’s resignation as Conservative leader, paving the way for a new UK prime minister, was “an opportunity” to reset fraught relations.\n\n📌JUST IN – Boris Johnson resigns as Prime Minister of the United Kingdom. DISCLOSE TV\n\nBoris Johnson will resign as Conservative party leader on Thursday, the BBC reported, paving the way for a successor to replace him as British prime minister, after dozens of his ministers quit his scandal-hit government.\n\n📌The Queen Returns To Windsor As She Reportedly Awaits An Extremely Important Call THE LIST\n\nWhen Queen Elizabeth II returned to Buckingham Palace, she found her country involved in even more drama than what she left.\n\nRussian forces now occupy about 22 percent of Ukraine’s farmland since the February 24 invasion, impacting one of the major suppliers to global grain and edible oils markets, NASA said Thursday.\n\nIn the past day, shelling has killed at least seven civilians in Ukraine, officials said Wednesday, and Russians are closing in on Sloviansk.\n\n📌UN The United Nations Scrubbed This Article Heralding ‘The Benefits Of World Hunger’ From Its Website After It Went Viral THE GATEWAY PUNDIT\n\nMounting evidence continues to emerge proving the food shortages and supply chain disruptions are being manufactured by the United Nations, the World Economic Forum and the World Health Organization in an effort to institute a New World Order, global government and destroy the United States.\n\nA 2009 op-ed published by the United Nations, which is now removed from its website, heralds hunger as “the foundation of wealth” and a means to bolster the world economy.\n\n📌MEDICAL England: Excess Deaths on the Rise But NOT Because of COVID – Experts Call for Investigation THE GATEWAY PUNDIT\n\nThe death toll in England and Wales continues to rise, even though Covid-related deaths have dropped.\n\nAs a result, health experts have requested an immediate investigation into the source of the rising non-Covid excess death.\n\n📌UK denies deputy mission head was detained by IRGC THE JERUSALEM POST\n\nVideo footage released by the IRGC claimed to show the deputy ambassador near a site where the IRGC was conducting missile exercises at the time. The deputy ambassador has since apologized and been expelled, according to the reports.\n\nAs The Gateway Pundit’s Cristina Laila reported earlier — Joe Biden wired his son Hunter $100,000 back in December 2018 and January 2019 to ‘pay bills.’\n\nNow we know that Hunter Biden used much of his father’s money to pay for Russian hookers.\n\nFox News host Tucker Carlson is demanding President Joe Biden be impeached from office after another scandal hits the White House.\n\nDuring a segment on “Tucker Carlson Tonight,” he called for Biden’s impeachment after it emerged that the Democrat president sent America’s emergency oil reserves to China and India.\n\nAn explosive Reuters report lifted the lid on the Biden administration’s move to export the much-needed Strategic Petroleum Reserve.\n\n📌What Did Jill Biden Say to Joe to Make His Face Look Like This? 4 Photos Go Viral on Twitter\n\nWhen a series of photos of the president and first lady are trending on Twitter along with the words “elder abuse,” things aren’t exactly going as planned.\n\nThat can be said for so much of the recent happenings in President Joe Biden’s administration, mind you.\n\nHowever, the puzzling sequence of photos — taken just before the president left to give a speech in Cleveland — called into question the president’s mental fitness yet again.\n\n📌GOP Lawmaker: Biden Family Has More Suspicious Activity Reports from Banks than Any Family EVER in the History of the United States (VIDEO) THE GATEWAY PUNDIT\n\nHunter Biden and his Uncle have at least 150 suspicious activity reports on their accounts. For years Congress was able to gain access to these reports. Rep. James Comer joined Jesse Watters to discuss the latest revelations surrounding the Biden Crime Family.\n\nThe Department of Justice has filed a lawsuit against the state of Arizona after the state enacted a new voting law that would require proof of citizenship in order to vote in presidential elections.\n\nArizona Attorney General Mark Brnovich tweeted a response on Wednesday, vowing to defend the law and state “in court…against the lawlessness of the Biden Administration.”\n\n📌YOU CAN’T MAKE THIS UP Joe Biden Hears a Phone Ringing in the Crowd and Says It’s Trump Calling Him During Dumpster Fire Ohio Speech (VIDEO) THE GATEWAY PUNDIT\n\nJoe Biden on Wednesday traveled to Cleveland Ohio to deliver remarks on his American Rescue Plan at Max Hayes High School.\n\nBiden attacked Trump, blamed Vladimir Putin for high gas prices and soaring food costs – while simultaneously claiming the Republicans are blocking his efforts to lower prices.\n\n📌ABANDON SHIP JUST IN: White House Comms Director Kate Bedingfield Leaving Post as Biden’s Poll Numbers Crater THE GATEWAY PUNDIT\n\nWhite House Comms Director Kate Bedingfield is departing the Biden Regime this summer, according to Fox News.\n\n📌Biden Attacks Trump, Claims Republicans are Blocking His Effort to Lower Gas and Food Prices in Unhinged Ohio Speech (VIDEO) THE GATEWAY PUNDIT\n\nJoe Biden on Wednesday traveled to Cleveland Ohio to deliver remarks on his American Rescue Plan at Max Hayes High School.\n\nBiden attacked Trump, blamed Vladimir Putin for high gas prices and soaring food costs – while simultaneously claiming the Republicans are blocking his efforts to lower prices.\n\nIn an interview this week, Planned Parenthood’s CEO Alexis McGill Johnson outlined the organization’s next steps in ensuring women have access to abortions after the Supreme Court overturned Roe v. Wade, which legalized abortion in the United States in 1973.\n\n📌ABORTION Mississippi’s Last Abortion Clinic Closes, The Clinic That Led To The Overturning Of Roe\n\nThe last abortion clinic in Mississippi officially shut down Wednesday, a day before a trigger ban against almost all abortion procedures is poised to take effect in the state, following the Supreme Court’s decision last month to overturn Roe v. Wade.\n\nThe clinic was at the center of the controversial Dobbs v. Jackson Women’s Health Organization Supreme Court case that overturned Roe V Wade.\n\nShannon Brewer, the clinic’s director, told The Washington Post in May about plans to relocate to New Mexico, where abortion procedures are still legal.\n\nA group of four pro-abortion activists chained themselves to the Los Angeles City Hall and poured a massive amount of fake blood down the steps on Wednesday. The protest appears to have been organized by a group calling themselves “Rise Up 4 Abortion Rights.”\n\nCHICAGO (AP) — A federal judge Wednesday sentenced Jerry Harris, a former star of the Netflix documentary series “Cheer,” to 12 years in prison for coercing teenage boys to send him obscene photos and videos of themselves and soliciting sex from minors at cheerleading competitions.\n\nThe Louisiana Supreme Court rejected the state attorney general’s request to enforce abortion ban laws after they were put on hold by an Orleans Civil Court Judge.\n\nAnother major ruling comes down.\n\n📌HIGHLAND PARK Highland Park Massacre Suspect’s First Court Appearance Turns Bizarre as His Attorney Quits Mid-Hearing THE WESTERN JOURNAL\n\nThe first court appearance of the Highland Park suspect, Robert Crimo III, was a scene of confusion on Wednesday.\n\n📌TAXES Champagne Socialist AOC Fined For Not Paying Back Taxes THE GATEWAY PUNDIT\n\nAs previously reported, champagne Socialist Rep. Alexandria Ocasio-Cortez still owes $1,870 in back taxes for a company she founded in 2012.\n\nAnd yet she wants to raise your taxes by 100% to pay for a her green new deal and kill off cows.\n\nPresident Trump recently bashed the RINO Arizona US Senate Candidates running against Blake Masters in a video endorsement for Blake.\n\nThe Arizona Republican Primary election is on August 2nd, and Blake Masters is dominating in the polls because of his courage on the campaign trail. “He’s strong on election fraud. Frankly, he’s strong on everything,” said President Trump in the video.\n\nMasters is leading all competitors by double digits in a June 28 poll by Public Policy Polling.\n\n“Voting Month” for Arizona’s 2022 August Primary Election begins today, and ballots have been mailed out to voters.\n\nKari Lake War Room shared some election information on Twitter. This election determines “whether Arizona belongs to the establishment or We The People.”\n\nIn a 30 day span Trump jumped 15 points in the Polls.\n\nThis means people are jumping over in droves.\n\nGuess you say they have found their “Precipice!”\n\n📌Langlade County GOP Declares Biden as ‘Not Legitimately Elected’ in 2022 Resolution RESIST THE MAINSTREAM\n\nRepublicans in Langlade County, Wisconsin, have passed a resolution stating that President Joe Biden was “not legitimately elected” and that “substantial” election fraud influenced the results of the 2020 presidential election in favor of Biden.\n\n“The Republican Party of Langlade County Wisconsin formally rejects the certified results of the 2020 Presidential election, and we hold that acting President Joseph Robinette Biden Jr. was not legitimately elected by the people of the United States,” reads the Langlade County GOP’s 2022 resolution obtained by The Epoch Times.\n\n📌2024 IT’S HAPPENING! HE’S BACK! President Trump Releases Video of Revamped Plane — Includes SECRET PHOTOS of TRUMP 2024 FLAGS in Background! THE GATEWAY PUNDIT\n\nAs anticipation builds around the question of President Trump expected run for president in 2024, and a three-peat victory, the great MAGA KING released an amazing video today.\n\nPresident Trump released video today of his revamped 757 plane complete with a new paint job.\n\n📌Georgia Dem Sen. Rafael Warnock Embroiled In Campaign Finance Scandal CONSERVATIVE BRIEF\n\nThough much of the media has focused on past personal issues and failings of Herschel Walker, the Republican nominee for a U.S. Senate seat in Georgia, little attention has been paid by the same outlets to his opponent, Democratic Sen. Raphael Warnock.\n\nDespite the fact that the incumbent has a history of allegations of domestic violence and allowing abuse at a church camp, he has nevertheless largely avoided any serious scrutiny.\n\nHowever, a new Warnock scandal has come to light and it is substantial enough that even POLITICO is reporting it.\n\nThings just got real interesting in the Peach State.\n\nLong-time NHL Defenseman and current San Jose Sharks Scout Bryan Marchment died unexpectedly on Wednesday during a trip to Montreal, his agent confirmed to AP. He was 53 years old.\n\n“Longtime agent Rick Curran confirmed Marchment’s death to The Associated Press. Marchment was attending the NHL draft in Montreal as a scout for the San Jose Sharks,” the news outlet reported.\n\nOn Thursday morning, a self-proclaimed hacker briefly infiltrated the Disneyland Resort Instagram and Facebook accounts filled with offensive and racial slurs.\n\nThe co-founder of the South African Satanic church has resigned, he became Christian.\n\n🔷EXCLUSIVE: Archbishop Vigano Shares on the Cancel Culture – Relegating the Old for the New Is Not Always Best THE GATEWAY PUNDIT\n\nArchbishop Vigano shares with us his thoughts on a recent article in Italy where Catholic Bishop Crepaldi examine how the new is not always better like the New World Order proponents would like us all to believe.\n\nArchbishop Vigano shares a recent article by Italian Catholic Archbishop Giampaolo Crepaldi where he discusses how the new has always been used to replace the old in the church, it has at times taken the church away from its sole purpose of sharing God’s message with the people.\n\nAutomobile affordability worsens as Americans are saddled up with monthly payments topping $1,000, and loan delinquencies are creeping higher thanks to increasing economic pressures thanks to the Federal Reserve’s aggressive monetary tightening regime to rein in the highest inflation in 40 years. A Fed-induced downturn in the economy could end up bursting the auto bubble.\n\n“So we are seeing some headwinds there a little bit when it comes to delinquencies as maybe a leading indicator.”\n\nThe price of WTI crude, the main US oil contract, jumped more than five percent on Thursday on supply concerns due to a possible blockage of Kazakhstan’s exports.\n\nAt 1359 GMT, WTI was up 5.7 percent $103.63, while the main international contract Brent North Sea was 4.7 percent higher at $105.39.\n\n📌Halifax Bank’s Woke Pronoun Policy and Bullying of Customers Leads to Mass Exodus of Clients\n\nCustomers at Halifax Bank have withdrawn their funds and canceled their accounts after the British bank issued a warning to those who don’t like its new ‘woke’ pronoun policy.\n\nHalifax tweeted a photo of a name badge with preferred pronouns and a caption that reads, “Pronouns Matter.” The tweet also featured the hashtag #ItsAPeopleThing.\n\nUS central bankers last month flagged the concern that sky-high inflation could become persistent and reiterated their willingness to continue raising interest rates to tamp down price pressures, according to the minutes of the latest policy meeting released Wednesday.\n\nThe Federal Reserve last month implemented the most aggressive interest rate increase in nearly 30 years, as policymakers cited worries that price pressures had shown no signs of easing, according to the record of the June 14-15 meeting.\n\n‘Their goal was 700k for”‘padding.”‘ They received over 150,000 in the last few weeks since 2 El Monte PD officers [were] killed.’\n\n📌Woke Coffee Shop Shuts Down After Even-More-Woke Employees Issue List of Insane Demands\n\nWhile the owners of the shop committed to wokeness early on, the far left employees eventually came from them.\n\n📌PICTURED: Arsenal of weapons seized from two non-US citizens plotting July 4 shooting in Virginia\n\nThe suspect was identified as Julio Alvarado, 52. Rolman Alberto Balcarcel, 38, was arrested on Tuesday. They were charged with with being non-U.S. citizens in possession of a firearm.\n\n📌Detroit police officer shot and killed in the line of duty: ‘We lost a hero’ | FOX NEWS\n\nA Detroit police office died on Wednesday after he was shot by a suspect who police say was indiscriminately firing a gun.\n\n📌California Governor Gavin Newsom Vacations in Montana – a State He Banned Travel to For Its ‘anti-Transgender’ Policies THE GATEWAY PUNDIT\n\nCalifornia Governor Gavin Newsom (D) traveled to Montana with his family despite a state-funded travel ban to The Treasure State for its so-called ‘anti-LGBTQ’ policies.\n\n“Montana is being added to California’s state-funded travel restrictions list as a result of House Bill 112 and Senate Bill 215. Signed into law on May 7, House Bill 112 prevents transgender women and girls from participating in school sports consistent with their gender identity. Signed into law on April 22, Senate Bill 215 overrides existing state and local laws and policies that prohibit discrimination against LGBTQ+ Americans. It threatens to, among other effects, allow businesses to refuse a broad range of services to same-sex couples because of their sexual orientation alone. Given the effective date for the new laws, Montana, pursuant to AB 1887, will be added to California’s travel restrictions list on July 1, 2021.” California Attorney General Rob Bonta said in a press release in June 2021.\n\nTwo top former FBI officials were selected to undergo rare and intensive IRS audits, according to a new report.\n\nFormer FBI Director James Comey and Andrew McCabe, who served as acting director for several months after Comey was fired, were picked to have their 2017 and 2019 tax returns audited, respectively, the New York Times reported on Wednesday.\n\n📌DEVELOPING: Police Arrest Man Carrying Two Molotov Cocktails Near US Capitol THE GATEWAY PUNDIT\n\n“USCP officers arrested a man with two Molotov cocktails around 3:30 p.m. along Massachusetts Avenue, west of North Capitol Street.” Capitol Police said in a tweet Wednesday afternoon.\n\n📌Richmond Police Say a Tip Helped Them Thwart Planned Mass Shooting on Fourth of July by Two ‘Non-American Citizens’ THE GATEWAY PUNDIT\n\nRichmond Police are praising a tipster that they say led to them thwarting a planned mass shooting on Fourth of July in the city.\n\nDuring a press conference on Wednesday, the Richmond Police said that a “hero citizen” had offered a tip that led to them arresting two people and seizing three firearms and 223 rounds of ammunition.\n\nThe suspects are Julio Alvarado-Dubon and Rolman Balacarcel — neither of whom are American citizens.\n\nThe man who shot dead Grammy-winning rapper Nipsey Hussle in broad daylight on a Los Angeles street in 2019 was convicted of first-degree murder Wednesday.\n\nEric Holder did not deny killing Hussle — a fast-rising star whose death sent shockwaves through the music community — but his lawyers had argued it was an impulsive crime that took place in the “heat of passion.”\n\nInstead, a jury found Holder had acted with premeditation as he fired at Hussle 10 times following a dispute between the two men over claims the assailant was “snitching.”\n\nA staffer for Democratic Mayor Eric Adams found out firsthand that crime in New York City is out of control.\n\nEven nasty angry Democrats can’t stand being around Joe Biden. Tim Ryan, who’s running for US Senate in Ohio is hiding out from Joe Biden’s visit in Ohio today after being Biden’s cheerleader in 2020. Tim Ryan seems to always be angry whenever you see him in interviews on the mainstream media.\n\nMichael Beschloss, respected historian and NBC contributor, is either much dumber than he seems or assumes you’re that dumb.\n\nTrump-Endorsed Arizona Gubernatorial candidate Kari Lake released an explosive new ad exposing the invasion at Arizona’s southern border and her plan to stop it. It aired this morning on Steve Bannon’s War Room.\n\nArizona Republican Governor Doug Ducey has decided to do the job that President Joe Biden has not been willing to do.\n\nThe governor has signed legislation to strengthen the border between his state and Mexico as the border crisis continues to be an issue.\n\n📌WHAT ARE THEY HIDING? DOJ Denies FOIA Request on Ray Epps and Why He Was Removed From FBI Most Wanted List THE GATEWAY PUNDIT\n\nOn the eve of the January 6th protests, a middle-aged man in a MAGA hat showed up, defended Antifa, and told the crowd they needed to “go into the Capitol” on Jan. 6. The man made the demands while standing next to Antifa organizer John Sullivan.\n\nThis was the night before the Trump rally of a million patriots. This was the day before VP Mike Pence stabbed President Trump in the back and approved the fraudulent 2020 election results.\n\nThe Gateway Pundit identified the man as Ray Epps from Arizona.\n\nOn Monday, Former President Donald Trump targeted Cassidy Hutchinson, a major witness for the January 6 committee, after leaked text messages revealed that she referred to the investigation as B.S.\n\nIn a post on Truth Social, Trump wrote, “Lyin’ Cassidy Hutchinson, who the Fake News Media refuses to properly reveal, recently called the January 6 Unselect Committee “B.S.” Gee, that wasn’t reported by LameStream!”\n\n📌National Guardswoman Who Wore ‘I’m a Trump Girl’ Shirt Inside US Capitol on Jan. 6 Pleads Guilty to Misdemeanor LAW AND CRIME\n\nA West Virginia National Guardswoman photographed wearing a shirt emblazoned with the words “Yes, I’m A Trump Girl” as she joined the mob that stormed the U.S. Capitol on Jan. 6 has pleaded guilty to a misdemeanor.\n\nJamie Lynn Ferguson, 44, admitted Wednesday to entering the Capitol Rotunda alongside scores of other Donald Trump supporters angry over Joe Biden’s victory in the 2020 presidential election. Surveillance footage shows that she was wearing blue jeans and the dark-colored sweatshirt bearing the “Trump Girl” phrase in stark white all-caps lettering.\n\nAccording to the complaint, Ferguson had attended Trump’s so-called “Stop the Steal” rally with her mother and father from approximately 9:00 a.m. to 9:30 a.m. Ferguson’s parents left after the rally, while she proceeded toward the Capitol, “believing she would be able to see the President again,” the complaint said.\n\nOne of Pennsylvania’s popular drag queens, an LGBTQ+ youth adviser, has been charged with 25 counts of child pornography; he allegedly obtained dozens of photos and videos of nude underaged boys performing sex acts.\n\nAccording to the Pennsylvania Attorney General’s Office, Brice Williams, the drag queen Anastasia Diamond is reported to have downloaded dozens of photos and videos of underaged boys performing sex acts between May and December 2020.\n\n📌The Stomach-Churning Evidence – There’s Nothing ‘Child Friendly’ About Drag Shows | The Report\n\nClinical sexologist Dr. Ingrid Thrall spoke with The Western Journal, discussing drag shows and explaining how they are inherently sexual.\n\n“Child-friendly” drag shows are seemingly popping up all around the country as the left attempts to force its agenda on children nationwide. But experts have revealed why exposing children to this sort of material is not friendly at all.\n\nAccording to media reports, the FDA’s advisory committee has deliberated on how to proceed with allowing clinical trials to test pig-to-human organ transplants.\n\nThe xenotransplantation procedure dates back to the 17th century, when attempts were made to use animal blood for transfusions. Due to a scarcity of human organs, scientists began looking at non-human primates such as monkeys, chimps, baboons, and even pigs, according to Nature.\n\n📌COV19 Director General of the Danish Health Authority Admits Vaccinating Kids was a ‘Mistake’\n\nOn Wednesday night, Søren Brostrøm hosted ‘Go’ Evening Live’ on TV 2, and he was asked if vaccinating children was a mistake.\n\nBased on current information, it is inappropriate to immunize all children, according to the director-general of Denmark’s Health Authority Søren Brostrøm.\n\n📌FINANCIAL “Bring it On!” – Kansas Democrat Governor Says She is Excited About the Biden Recession (VIDEO) THE GATEWAY PUNDIT\n\nKansas Governor Laura Kelly (D) said she is looking forward the Biden recession. “And you hear people talking about, you know, a recession coming. Bring it on,” Governor Kelly said. Easy for Laura Kelly to say because she is collecting a government check.\n\nAnother day, another corrupt Democrat has been caught breaking the law.\n\nA prominent Hawaii Democrat was sentenced to 40 months in prison on Wednesday for taking bribes in exchange for shaping legislation while in office.\n\nFormer Democratic Senate Majority Leader J. Kalani English pleaded guilty to honest services wire fraud earlier this year, admitting in court that he accepted bribes from a Hawaii business owner in exchange for shaping legislation that would benefit a company involved in publicly financed cesspool conversion projects.\n\n📌RESIGNATION JUST IN: White House Communications Director Kate Bedingfield to Step Down\n\nWhite House communications director Kate Beddingfield will step down from her position before the end of the summer, according to a report.\n\nFormer Hawaii Senate Majority Leader Jamie Kalani English (D) was sentenced to 40 months in prison for taking bribes to influence legislation while in office.\n\n📌Video: Terrifying Moment NYC Bodega Worker Defends Himself in Vicious Attack, But He’s the One Arrested THE WESTERN JOURNAL\n\nA New York City bodega worker who fought back and killed his attacker on Friday night has now been charged with a crime.\n\nBrittney Griner, a US basketball star detained in Russia, pleaded guilty to drug smuggling charges in court on Thursday but said she did not intend to break Moscow’s laws.\n\nThe WNBA star said in court in the town of Khimki outside Moscow that she “would like to plead guilty” to all the charges, but stressed she had “no intention” of breaking any Russian law.\n\n“I was in a rush packing. And the cartridges accidentally ended up in my bag,” she said.\n\n📌Leftist Arizona Media Admits It! Kari Lake Is “Another Four Years of Donald Trump” And “Karrin Taylor Robson Is Another Four Years Of Doug Ducey” THE GATEWAY PUNDIT\n\nCorporate media hack Brahm Resnik, from 12 News Arizona TV, recently admitted that voting for Trump-endorsed Gubernatorial Candidate Kari Lake will give Arizona “another four years of Donald Trump.”\n\nBrahm also said, “Karrin Taylor Robson is another four years of Doug Ducey.”\n\nAnalyzing bank records, investigators found out that Hess made $441,779.05 by committing fraud against 331 of the victims.\n\n📌FL/DEATHS Nine dead, four cardiac arrests and six intubations after mass poisoning event with victims aged between 34 and 67 THE US SUN\n\nNINE people have died after allegedly being poisoned in Florida over the July 4 holiday weekend.\n\nCops revealed that the victims found dead in Gadsden County were aged between 34 and 67.\n\n📌CA/ASSISTED SUICIDE LAW ON PAUSE Hearing Tomorrow on California Aid in Dying Lawsuit /\n\nCalifornia’s aid-in-dying law could be halted, depending on the outcome of a hearing tomorrow in federal court.\n\nThe Christian Medical and Dental Association is asking the judge to put Senate Bill 380 on hold while the group’s lawsuit proceeds. The law allows terminally ill patients with less than six months to live to get a prescription to end their suffering if they choose to use it.\n\nThe Democratic candidates for Ohio senator and governor were nowhere to be found Wednesday as President Biden visited Cleveland — an indicator of the commander in chief’s political toxicity as the longtime battleground state moves firmly into the Republican column.\n\nLourdes Ubieta, a conservative radio host, has quit her position ahead of the expected purchase of her station by a liberal group backed by George Soros.\n\nUbieta, a Cuban American, hosted a show on Miami’s Radio Mambi and rejected a lucrative deal to continue operating under the new management. Radio Mambi has long been associated with Miami’s Cuban exile population and has always kept a right-leaning and anti-communist perspective.\n\n📌UPDATE Crews level rest of Georgia Guidestones after damage from explosive device MSN\n\nThey said “unknown individuals” detonated an explosive device at around 4 a.m. on Wednesday. The Elbert County Sheriff’s Office responded to discover the explosion destroyed a large portion of the structure, they said.\n\nAccording to multiple people nearby, the explosion was heard in the area and even shook their homes. Some shared images showing debris near the stones.\n\n11Alive’s Dawn White reported from the scene in Elbert County in the evening that crews had gone in to level the remaining standing parts of the Guidestones.\n\nVideo from the scene showed construction equipment and the stone blocks in a rubble heap.\n\nLast Month the Biden administration issued a ban on the popular Juul e-cigarette, but a court decision quickly halted the decision, and now the U.S. Food and Drug Administration (FDA) has temporarily lifted that ban.\n\nThe saga continues for the company, which faces bankruptcy in light of the ban rooted in fear of teenage tobacco use. The administration had taken aim at the tobacco industry with a ban on menthol cigarettes and the popular e-cigarettes as part of Biden’s “moon shot” push to eliminate cancer.\n\n📌CRIME Hollywood Producer Charged with Killing Model and Her Friend THE WESTERN JOURNAL\n\nTwo have been charged with connections to the deaths of aspiring actress Christy Giles and her architect friend Hilda Marcela Cabrales-Arzola.\n\nThe Best Kept SECRET on Social Media is OUT…\n\nBring us your vaxed, your unvaxed, your straight and your gay.\n\nBring us your lost, your found, your night and your day.\n\nBring us your young, your old, your left and your right.\n\nBring us your tan, your brown, your black and your white.\n\nWe want our secret out… ’cause EVERYONE MATTERS in the ADN Community.", "opengraph": {"title": "7/7/22 ADN EVENING NEWS LINEUP", "description": "                     ADN COMMUNITY 🔷 AUDIO RECORDING", "image": "https://lh4.googleusercontent.com/scL8dAhiKGydqDx5zpDRQ6Ao4EXHLyvfixIlzBYy2pRVN65O9EuR2IALaetRoShyJioKsKJUjm8cjAtLmctEC3LtfiRzwN5ITWJurD9nn3CmYGThfhvA-l0i67u1y0uSV4H-aVl523B6fqrPbqE", "image:width": "1024", "image:height": "1024", "image:type": "image/png", "type": "article", "article:published_time": "2022-07-08T03:30:08+00:00", "article:modified_time": "2022-07-08T03:30:13+00:00", "url": "https://americandigitalnews.com/index.php/2022/07/07/7-7-22-adn-evening-news-lineup/", "site_name": "American Digital News"}, "tags": ["Immigration", "ADN News", "United States", "Education", "World", "Politics"], "tweets": [], "movies": [], "links": ["https://t.me/AmericanDigitalNews", "https://t.me/AmericanDigitalNews?videochat=c9a53adf40b4ef8d1b", "https://www.msn.com/en-us/news/us/pipeline-explosion-reported-in-west-fort-bend-county-pct-1-says/ar-AAZkmZu", "https://www.zerohedge.com/political/today-all-new-vehicles-eu-will-have-surveillance-black-boxes", "https://insiderpaper.com/us-treasury-sanctions-network-selling-iranian-oil/", "https://insiderpaper.com/israel-thanks-turkey-for-thwarting-iranian-assassination-plot/", "https://dailycaller.com/2022/07/06/left-wing-j6-committee-splc-democrats/", "https://www.westernjournal.com/twin-10-year-old-boys-save-drowning-dad-jesus-standing-right-behind-us-whole-time/?utm_source=social&utm_medium=tgm&utm_campaign=tgm&utm_content=can", "https://www.westernjournal.com/8-year-old-learns-scary-life-lesson-wandering-deep-end-local-pool/?ff_source=social&ff_medium=tgm&ff_campaign=tgm&ff_content=can", "https://www.newsmax.com/newsfront/joe-biden-trump-southern-border-wall/2022/07/07/id/1077716/?dkt_nbr=6F1212vcekxh", "https://www.dailymail.co.uk/news/article-10991231/Biden-FINISH-section-Trumps-border-wall-Calif-close-park-separated-families-meet.html", "https://twitter.com/billfoxla/status/1545117706864689153?s=21", "https://www.thegatewaypundit.com/2022/07/epic-arizona-congressional-candidate-jerone-davison-exposes-racist-democratic-party-new-ad-rifle-thing-standing-family-dozen-angry-democrats-klan/", "https://jeroneforcongress.com/", "https://www.thedailybeast.com/trump-foes-james-comey-and-andrew-mccabe-were-both-swept-up-in-highly-invasive-rare-irs-audit-nyt", "https://www.axios.com/2022/07/05/supreme-court-conservative-climate-health-regulations", "https://ifpnews.com/iran-attended-doha-talks-reach-nuclear-deal/", "https://www.bignewsnetwork.com/news/272611800/iran-denounces-us-as-biggest-violator-of-human-rights-in-annual-report", "https://www.express.co.uk/news/politics/1636629/boris-johnson-resign-today-prime-minister-resigned-latest-news-live", "https://justthenews.com/nation/crime/us-marshals-captures-more-1500-fugitives-10-cities", "https://www.justice.gov/opa/pr/us-marshals-national-violence-reduction-operation-captures-more-1500-fugitives", "https://conservativebrief.com/furious-64283/", "https://www.westernjournal.com/woke-coffee-shop-shuts-even-woke-employees-issue-list-insane-demands/", "https://insiderpaper.com/at-least-200-shot-killed-in-july-4th-weekend-gun-violence-across-us/", "https://insiderpaper.com/new-york-mayor-says-supreme-court-ruling-may-feed-sea-of-gun-violence/", "https://resistthemainstream.org/watch-incredible-moment-kentucky-cop-saves-seven-day-old-baby-girls-life-by-giving-her-cpr/?utm_source=telegram", "https://www.queerty.com/lauren-boebert-rages-rep-eric-swalwell-shares-photos-20220706", "https://insiderpaper.com/stocks-enjoy-bounce-sterling-and-ftse-up-as-johnson-to-resign/", "https://resistthemainstream.org/doctor-issues-warning-about-giving-covid-19-vaccines-to-babies/?utm_source=Telegram", "https://edition.cnn.com/2022/06/21/politics/biden-covid-vaccines-under-five/index.html", "https://www.theepochtimes.com/doctor-issues-warning-about-giving-covid-19-vaccine-to-babies_4550313.html", "https://mygotodoc.com/about", "https://www.thegatewaypundit.com/2022/07/europe-catches-major-blowback-failed-attempt-confront-russia/", "https://www.thegatewaypundit.com/2022/07/trump-right-german-housing-group-begins-throttle-tenants-heating-night-save-gas/", "https://www.thegatewaypundit.com/2022/07/yikes-nancy-pelosi-flashes-major-cleavage-italian-beach-resort-owned-andrea-bocelli/", "https://rumble.com/v1bculz-hunter-biden-films-himself-smoking-crack-during-detox.html", "https://rumble.com/v1bcnw1-get-ready-trump-reveals-this-renovated-surprise-from-his-2016-campaign.html", "https://twitter.com/RNCResearch/status/1544861976366571524?s=20&t=bjegmSxazW-krfJAK6l2PQ", "https://rumble.com/v1bckct-who-did-this.html", "https://www.thegatewaypundit.com/2022/07/father-highland-park-shooter-helped-obtain-guns-claims-son-good-morals/", "https://abc7chicago.com/highland-park-shooting-parade-robert-crimo-father/12026458/", "https://conservativebrief.com/officials-2-64285/", "https://resistthemainstream.org/rabbi-recalls-strange-visit-the-alleged-highland-park-shooter-previously-paid-to-his-synagogue/?utm_source=Telegram", "https://www.thegatewaypundit.com/2022/07/new-armed-uvalde-police-officer-clear-shot-take-salvador-ramos-entered-robb-elementary-school-fatally-shot-19-children/", "https://www.texastribune.org/2022/07/06/uvalde-school-shooting-robb-elementary-report/", "https://insiderpaper.com/putin-says-if-west-wants-to-defeat-russia-on-battlefield-let-them-try/", "https://insiderpaper.com/uk-says-it-seized-advanced-weaponry-smuggled-from-iran/", "https://insiderpaper.com/russian-prosecutor-seeks-7-years-in-jail-for-councillor-over-ukraine-criticism/", "https://insiderpaper.com/moscow-slams-ukrainian-nationalism-in-borshch-battle/", "https://insiderpaper.com/the-us-militarys-newest-weapon-against-china-and-russia-is-hot-air/", "https://www.thegatewaypundit.com/2022/07/dutch-farmer-protest-update-16-year-old-jouke-freed-document-reveals-government-plans-confiscate-farms-asylum-seekers/", "https://insiderpaper.com/zelensky-expresses-sadness-at-uk-pms-departure/", "https://insiderpaper.com/uk-cabinet-minister-sajid-javid-resigns-in-protest-at-boris-johnsons-leadership/", "https://www.thegatewaypundit.com/2022/07/not-slaves-farmers-polish-italian-farmers-rise-government-elites-destroying-family-businesses/", "https://insiderpaper.com/poland-confirms-scientist-held-by-iran-austria-and-uk-deny-arrests/", "https://insiderpaper.com/japan-introduces-up-to-one-year-jail-time-for-cyberbullying/", "https://insiderpaper.com/uk-says-diplomat-iran-reported-arrested-left-last-year/", "https://insiderpaper.com/russia-hands-heavy-sentences-to-north-korean-fishermen/", "https://english.elpais.com/international/2022-06-09/julian-assange-spying-case-judge-suggests-cia-may-have-received-illicitly-recorded-conversations.html", "https://insiderpaper.com/major-fiscal-decisions-to-be-left-to-successor-uks-johnson/", "https://insiderpaper.com/uk-pm-quits-as-conservative-leader/", "https://insiderpaper.com/johnson-exit-marks-opportunity-to-reset-uk-ireland-ties-irish-pm/", "https://insiderpaper.com/a-long-history-of-hungarys-relations-with-russia-explained/", "https://insiderpaper.com/uk-pm-boris-johnson-will-resign-thursday-as-conservative-leader-bbc/", "https://insiderpaper.com/senior-ministers-set-to-tell-johnson-he-must-quit-uk-media/", "https://www.thelist.com/918923/the-queen-returns-to-windsor-as-she-reportedly-awaits-an-extremely-important-call/", "https://insiderpaper.com/russia-occupies-22-of-ukraine-farmland-nasa/", "https://insiderpaper.com/preparing-for-global-cyberwar-how-the-landscape-has-changed-since-ukraine/", "https://www.usatoday.com/story/news/politics/2022/07/06/ukraine-russia-invasion-live-updates/7818540001/", "https://www.thegatewaypundit.com/2022/07/united-nations-scrubbed-article-heralding-benefits-world-hunger-website-went-viral/", "https://web.archive.org/web/20220706173519/https://www.un.org/en/chronicle/article/benefits-world-hunger", "https://www.thegatewaypundit.com/2022/07/england-excess-deaths-rise-not-covid-experts-call-investigation/", "https://www.jpost.com/breaking-news/article-711375", "https://www.thegatewaypundit.com/2022/07/senator-ron-johnson-suggests-evidence-shows-biden-crime-family-may-involved-global-sex-scandal-video/", "https://www.thegatewaypundit.com/2022/06/joe-biden-wired-hunter-biden-100000-portion-used-pay-russian-hookers-watch-video-hunter-verbally-abusing-hooker/", "https://conservativebrief.com/tucker-17-64305/", "https://www.westernjournal.com/jill-biden-say-joe-make-face-look-like-4-photos-go-viral-twitter/?utm_source=social&utm_medium=tgm&utm_campaign=tgm&utm_content=can", "https://www.thegatewaypundit.com/2022/07/gop-lawmaker-biden-family-suspicious-activity-reports-banks-family-ever-history-united-states-video/", "https://resistthemainstream.org/ag-brnovich-responds-to-doj-suing-arizona-for-requiring-proof-of-citizenship-to-vote-in-presidential-elections/", "https://www.thegatewaypundit.com/2022/07/joe-biden-hears-phone-ringing-crowd-says-trump-calling-dumpster-fire-ohio-speech-video/", "https://www.thegatewaypundit.com/2022/07/biden-attacks-trump-claims-republicans-blocking-effort-lower-gas-food-prices-unhinged-ohio-speech-video/", "https://www.thegatewaypundit.com/2022/07/just-white-house-comms-director-kate-bedingfield-leaving-post-bidens-poll-numbers-crater/", "https://www.thegatewaypundit.com/2022/07/biden-attacks-trump-claims-republicans-blocking-effort-lower-gas-food-prices-unhinged-ohio-speech-video/", "https://resistthemainstream.org/planned-parenthood-ceo-outlines-next-steps-following-roe-v-wade-overturn/?utm_source=telegram", "https://www.thegatewaypundit.com/2022/07/mississippis-last-abortion-clinic-closes-clinic-led-overturning-roe/", "https://www.supremecourt.gov/opinions/21pdf/19-1392_6j37.pdf", "https://www.washingtonpost.com/nation/2022/05/04/abortion-mississippi-clinic-newmexico-roe-wade/", "https://www.thegatewaypundit.com/2022/07/watch-pro-abortion-activists-pour-fake-blood-los-angeles-city-hall-steps-chain-building/", "https://apnews.com/article/entertainment-sports-crime-child-pornography-4fd9db15a785348ae25569e65589ecff?taid=62c61e952e631c00013a9278&utm_campaign=TrueAnthem&utm_medium=AP&utm_source=Twitter", "https://conservativebrief.com/abortion-2-64308/", "https://www.westernjournal.com/highland-park-massacre-suspects-first-court-appearance-turns-bizarre-attorney-quits-mid-hearing/?utm_source=social&utm_medium=tgm&utm_campaign=tgm&utm_content=can", "https://www.thegatewaypundit.com/2022/07/champagne-socialist-aoc-fined-not-paying-back-taxes/", "https://www.thegatewaypundit.com/2019/03/figures-company-founded-by-ocasio-cortez-still-owes-1870-in-back-taxes/", "https://www.thegatewaypundit.com/2022/07/watch-president-trump-gives-another-statement-endorsing-blake-masters-az-senate-primary-mark-brnovich-jim-lamon-will-let/", "https://www.blakemasters.com/", "https://www.thegatewaypundit.com/2022/07/president-trump-truths-statement-arizona-early-voting-starting-today-people-arizona-chance-get-truly-great-governor-vote-kari-lake/'", "https://resistthemainstream.org/wisconsin-county-gop-declares-biden-as-not-legitimately-elected-in-2022-resolution/?utm_source=telegram", "https://www.thegatewaypundit.com/2022/07/happening-president-trump-releases-video-revamped-plane-includes-secret-photos-trump-2024-flags-background-video/", "https://conservativebrief.com/warnock-64284/", "https://www.politico.com/news/2022/07/06/warnock-used-campaign-funds-to-fight-personal-lawsuit-00044148", "https://www.thegatewaypundit.com/2022/07/former-nhl-defenseman-bryan-marchment-dies-unexpectedly-montreal-trip/", "https://apnews.com/article/nhl-sports-hockey-canada-san-jose-sharks-946c48f2568a899bf355a1932882cb1b?utm_source=Twitter&utm_medium=AP_Sports&utm_campaign=SocialFlow", "https://www.thegatewaypundit.com/2022/07/disneyland-social-media-hacked-hacker-calls-employees-n-word-talks-penis-size/", "https://twitter.com/PatriarchPrimus/status/1544420750479839232", "https://www.thegatewaypundit.com/2022/07/exclusive-archbishop-vigano-shares-cancel-culture-relegating-old-new-not-always-best/", "https://www.zerohedge.com/markets/prepare-auto-loan-crisis-delinquencies-begin-rise", "https://insiderpaper.com/wti-oil-price-jumps-5-on-supply-worries/", "https://insiderpaper.com/gm-reports-lower-q2-sales-as-supply-chain-woes-persist/", "https://www.thegatewaypundit.com/2022/07/halifax-banks-woke-pronoun-policy-bullying-customers-leads-mass-exodus-clients/", "https://insiderpaper.com/fed-flags-risk-us-inflation-could-become-entrenched-minutes/", "https://insiderpaper.com/saudi-to-hand-out-billions-to-ease-inflation-pain/", "https://www.westernjournal.com/soros-backed-da-gets-worst-news-career/?utm_source=social&utm_medium=tgm&utm_campaign=tgm&utm_content=can", "https://www.westernjournal.com/woke-coffee-shop-shuts-even-woke-employees-issue-list-insane-demands/", "https://www.dailymail.co.uk/news/article-10991485/PICTURED-Arsenal-weapons-seized-two-non-citizens-plotting-July-4-shooting-Virginia.html", "https://www.foxnews.com/us/detroit-police-officer-shot-killed", "https://www.thegatewaypundit.com/2022/07/california-governor-gavin-newsom-vacations-montana-state-banned-travel-anti-transgender-policies/", "https://oag.ca.gov/news/press-releases/attorney-general-bonta-add-five-states-travel-restrictions-list-result-wave-new", "https://www.washingtonexaminer.com/news/comey-mccabe-irs-audits-fbi", "https://www.washingtonexaminer.com/tag/fbi", "https://www.washingtonexaminer.com/tag/internal-revenue-service", "https://www.washingtonexaminer.com/tag/james-comey", "https://www.washingtonexaminer.com/tag/andrew-mccabe", "https://www.nytimes.com/2022/07/06/us/politics/comey-mccabe-irs-audits.html", "https://www.thegatewaypundit.com/2022/07/developing-police-arrest-man-carrying-two-molotov-cocktails-near-us-capitol/", "https://www.thegatewaypundit.com/2022/07/richmond-police-say-tip-helped-thwart-planned-mass-shooting-fourth-july-two-non-american-citizens/", "https://insiderpaper.com/nipsey-hussle-killer-eric-holder-convicted-of-first-degree-murder/", "https://insiderpaper.com/more-than-30-people-shot-in-los-angeles-in-troubling-week-says-police-chief/", "https://www.westernjournal.com/massive-nyc-crime-surge-hits-mayors-office-staffer-mugged-broad-daylight/?utm_source=social&utm_medium=tgm&utm_campaign=tgm&utm_content=can", "https://www.thegatewaypundit.com/2022/07/angry-democrat-tim-ryan-running-ohio-senate-race-wont-join-joe-biden-ohio-today/", "https://www.westernjournal.com/nbc-reporter-floats-insane-rittenhouse-conspiracy-theory-parade-shooting/?utm_source=social&utm_medium=tgm&utm_campaign=tgm&utm_content=can", "https://www.thegatewaypundit.com/2022/07/exclusive-arizona-attack-trump-endorsed-az-gubernatorial-candidate-kari-lakes-new-ad-exposes-biden-invasion-arizonas-southern-border-video/", "https://conservativebrief.com/doug-64279/", "https://www.thegatewaypundit.com/2022/07/hiding-doj-denies-foia-request-ray-epps-removed-fbi-wanted-list/", "https://resistthemainstream.org/trump-responds-to-cassidy-hutchinsons-latest-leaked-text-messages-of-her-referring-to-jan-6-committee-as-bs/?utm_source=telegram", "https://truthsocial.com/@realDonaldTrump/posts/108589976149350536", "https://lawandcrime.com/u-s-capitol-breach/national-guardswoman-who-wore-im-a-trump-girl-shirt-inside-u-s-capitol-on-jan-6-pleads-guilty-to-misdemeanor/", "https://www.thegatewaypundit.com/2022/07/another-childrens-lgbtq-drag-queen-advocate-charged-child-pornography/", "https://ujsportal.pacourts.us/Report/MdjDocketSheet?docketNumber=MJ-39304-CR-0000129-2022&dnh=Iyp6fvm083vnDaNHnw3YMQ%3D%3D", "https://www.westernjournal.com/stomach-churning-evidence-nothing-child-friendly-drag-shows-report/?utm_source=social&utm_medium=tgm&utm_campaign=tgm&utm_content=can", "https://insiderpaper.com/fda-likely-to-approve-clinical-trials-for-pig-to-human-organ-transplants/", "https://www.wsj.com/articles/fda-said-to-plan-pig-organ-transplant-clinical-trials-11656622411", "https://insiderpaper.com/sudden-and-unexplained-hepatitis-cases-in-children-rises-to-700-with-ten-deaths-who/", "https://www.thegatewaypundit.com/2022/07/director-general-danish-health-authority-admits-vaccinating-kids-mistake/", "https://nyheder.tv2.dk/samfund/2022-06-22-set-i-bakspejlet-fik-vi-ikke-meget-ud-af-at-vaccinere-boernene-erkender-brostroem", "https://www.thegatewaypundit.com/2022/07/bring-kansas-democrat-governor-says-excited-biden-recession-video/", "https://conservativebrief.com/prison-64293/", "https://www.mediaite.com/politics/just-in-white-house-communications-director-kate-bedingfield-to-step-down/", "https://resistthemainstream.org/former-democrat-state-senator-sentenced/", "https://www.westernjournal.com/video-terrifying-moment-nyc-bodega-worker-defends-vicious-attack-one-arrested/?utm_source=social&utm_medium=tgm&utm_campaign=tgm&utm_content=can", "https://insiderpaper.com/us-basketball-player-pleads-guilty-to-drug-charges-in-russian-court-afp/", "https://insiderpaper.com/moscow-slams-ukrainian-nationalism-in-borshch-battle/", "https://www.thegatewaypundit.com/2022/07/leftist-arizona-media-admits-kari-lake-another-four-years-donald-trump-karrin-taylor-robson-another-four-years-doug-ducey/", "https://www.westernjournal.com/shocking-details-exposed-illegal-body-part-scheme-undertaker-admits-heinous-crimes/?utm_source=social&utm_medium=tgm&utm_campaign=tgm&utm_content=can", "https://www.the-sun.com/news/5712051/victims-dead-mass-poisoning-florida/", "http://www.publicnewsservice.org/2022-07-07/health/hearing-tomorrow-on-california-aid-in-dying-lawsuit/a79351-2", "https://leginfo.legislature.ca.gov/faces/billCompareClient.xhtml?bill_id=202120220SB380&showamends=false", "https://dockets.justia.com/docket/california/cacdce/8:2022cv00274/844575", "https://resistthemainstream.org/two-ohio-democrat-candidates-noticeably-skip-biden-event-in-cleveland/?utm_source=telegram", "https://resistthemainstream.org/popular-florida-radio-host-quits-show-after-soros-backed-media-group-buys-station/?utm_source=telegram", "https://www.msn.com/en-us/news/us/crews-level-rest-of-georgia-guidestones-after-damage-from-explosive-device/ar-AAZgKB1", "https://twitter.com/JohnCMankey/status/1544693242867884033", "https://www.thegatewaypundit.com/2022/07/juul-e-cigarette-saga-continues-fda-suspends-ban-company-appeals/", "https://www.juul.com/", "https://www.fda.gov/", "https://www.westernjournal.com/hollywood-producer-charged-killing-model-friend/?utm_source=social&utm_medium=tgm&utm_campaign=tgm&utm_content=can", "https://t.me/AmericanDigitalNewsChannel/2649"], "authors": ["Ami Tiel"], "publish_date": "2022-07-08T03:30:08+00:00"}