{"result_id": "023019", "URL": "https://americanfreepress.net/rfk-jr-fights-slander-censorship/", "timestamp": "2023-04-25 12:00:42 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2017/03/cropped-AFP_Site_Icon3-32x32.jpg", "canonical": "https://americanfreepress.net/rfk-jr-fights-slander-censorship/", "encoding": "UTF-8"}, "image": null, "domain": "americanfreepress.net", "title": "RFK Jr. Fights Slander, Censorship – American Free Press", "cleaned_text": "Last year, an anonymous blogger known as “Down­east Dem” libeled Robert F. Kennedy Jr. as a “neo-Nazi” on the platform of “The Daily Kos” (DK). On June 11, a subpoena was served on Markos Moulitsas, founder of DK, by Kennedy’s representatives, ordering the disclosure of the real identity of Downeast Dem. Moulitsas has fought the order in court since December 2020. DK security guards at the company’s San Francisco headquarters twice blocked Kennedy’s process servers from entering the building.\n\nDK’s Aug. 29, 2020 article claimed that Kennedy spoke at a “Nazi” rally in Berlin, which had been “organized by right-wing extremist organizations, including the AFD (Alternative for Germany) Party and various anti-Semitic conspiracy groups as well as the neo-Nazi NPD party.” When Ken­nedy provided DK with proof refuting the absurd allegation, the liberal platform still refused to remove the defamatory statements. DK management claimed immunity under Section 230 of the Communication Decency Act, which shields anonymous commentators from legal liability.\n\nOn Dec. 1, 2020, Kennedy filed a petition with the Westchester County Supreme Court, ordering them to reveal the blogger’s actual name. In April 2021, Judge Mary H. Smith ruled in RFK Jr.’s favor. Incredibly, immediately upon the subpoena being served, a representative of the consumer advocacy group Public Citizen notified Kennedy that they would be representing Downeast Dem pro bono. This was especially shocking, given Public Citizen’s long history of opposing Big Pharma. RFK Jr. has often found himself fighting alongside Public Citizen during his many battles with the pharmaceutical and vaccine industries.\n\nFormer New York University Law School professor and human rights advocate Mary Holland is the president and general counsel of Children’s Health Defense, founded and chaired by RFK Jr. “Public Citizen’s choice to take on this case as its cause célèbre is one of the most dismaying emblems, to date, of the co-optation of liberal institutions by Big Pharma and the medical cartel,” Holland stated. “We have seen a lot of ideological chaos, confusion, doctrinal bankruptcy and intellectual dishonesty among our leading liberal institutions in the wake of the Covid crisis.” Kennedy himself added, “Public Citizen has done an extraordinary job documenting the pharmaceutical industry’s relentless and intractable history of homicidal corruption. It’s dismaying that the organization is switching sides at a time when this crisis has amplified the need for fearless pharma watchdogs.”\n\nAlluding to the clear and alarming record of unprecedented injuries and fatalities stemming from the “warp speed” vaccine, RFK, Jr. remarked, “there is no reason to think that Covid-19 has suddenly changed Big Pharma’s corrupt institutional culture. We need to be mindful that their opportunities for criminal profiteering are now manifold.”\n\nFew Americans realize that a horrific piece of 1986 legislation (which was supported by a younger Anthony Fauci), basically shields vaccine makers from lawsuits.\n\nRFK Jr. has been thoroughly demonized by the left. The Democratic Party his uncles and father once dominated fully supports the Medical Industrial Complex that RFK Jr. has been fighting for years. As Holland noted:\n\nThe “woke” left that completely runs this country now wants Kennedy and all the renegade doctors and nurses who have spoken out boldly by questioning the dubious Covid narrative and the resulting problematic vaccine to be muzzled. Moulitsas has been pleading for funds to fight Kennedy’s efforts to confront his accuser. In true bully fashion, Moulitsas ridiculed Kennedy as “Robbie or Bob or whatever people call you.” He added, “If Kennedy isn’t a coward, he can drop the suit targeting Downeast Dem and come directly after me. . . . So bring it [expletive deleted].”\n\nOf the “trust the science” mindless mantra, RFK Jr. said:\n\nDonald Jeffries is a highly respected author and researcher whose work on the JFK, RFK and MLK assassinations and other high crimes of the Deep State has been read by millions of people across the world. Jeffries is also the author of three books currently being sold by AFP Bookstore.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "https://afpstore.americanfreepress.net/product/survival-of-the-richest-how-the-corruption-of-the-marketplace-and-the-disparity-of-wealth-created-the-greatest-conspiracy-of-all/", "https://johnellis.com/", "#", "#", "#", "#"], "authors": [], "publish_date": null}