{"result_id": "023005", "URL": "https://americanfreepress.net/covid-vaccines-what-we-know-dont-know/?utm_source=rss&utm_medium=rss&utm_campaign=covid-vaccines-what-we-know-dont-know", "timestamp": "2023-04-25 12:00:26 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2017/03/cropped-AFP_Site_Icon3-32x32.jpg", "canonical": "https://americanfreepress.net/covid-vaccines-what-we-know-dont-know/", "encoding": "UTF-8"}, "image": null, "domain": "americanfreepress.net", "title": "Covid Vaccines What We Know & Don’t Know – American Free Press", "cleaned_text": "To date, two coronavirus vaccines have been authorized for use in the United States. Here’s what we know, some of what we don’t know, and what we’re being told not to ask.\n\nCovid-19 vaccinations are underway in the United States. Political figures from both sides of the aisle, from Vice President Mike Pence to Massachusetts Sen. Elizabeth Warren, have made a public display of receiving their inoculations. Pharmaceutical giants Pfizer-BioNTech and Moderna estimate they will have a combined 40 million doses available by the end of the first month of 2021, enough to give 20 million people the required two rounds of shots. These vaccines, the first of which was approved for use through an FDA emergency use authorization on Dec. 11 and the second on Dec. 18, were developed and manufactured in record time, creating hope, but also leaving many questions unanswered. Instead of being answered, these questions have set off a firestorm of misrepresentation and manipulation by the mainstream media and internet giants that labels any questioning or criticism of the vaccines as “conspiratorial,” no matter the source. Being wary of newly developed, hastily authorized vaccines that utilize a nanotechnology only recently approved for humans is reasonable, and the ability to openly question the motivations and practices of Big Pharma is necessary.\n\nAnd while FDA Commissioner Stephen M. Hahn, M.D., claimed, “Through the FDA’s open and transparent scientific review process, two COVID-19 vaccines have been authorized in an expedited timeframe while adhering to the rigorous standards for safety, effectiveness, and manufacturing quality needed to support emergency use authorization that the American people have come to expect from the FDA,” to no surprise, the narrative is being skewed. In spite of this assurance of a “transparent” process, what should be regarded as natural skepticism and questioning about the new technology you are being asked to have injected into your body is being twisted to look like a Dark Ages denial of all modern medicine.\n\nThe mainstream media has, with particularly aggressive fervor, misrepresented people’s hesitation about the Covid-19 vaccines and labeled anyone who dissents as crazy or an “anti-vaxxer.” Americans’ hesitancy to participate in government-run medical trials, however, is not unfounded. Documented as early as the 1840s and on through the infamous Tuskegee Syphilis Trials, finally shut down in 1972, there is a real, documented history of reasons to question the government’s intentions when it comes to medical intervention. This year, for instance, an investigation was begun into a state-run detention center in Georgia reportedly performing unauthorized hysterectomies, allegedly leaving dozens of women sterile. As we approach this new dawn in the Covid-19 era, it should not be a thought crime to ask relevant questions. Let’s break down what we know and what we don’t, and why people have lingering questions and concerns.\n\nWHAT WE KNOW\n\nBoth of the FDA approved vaccines use messenger RNA (mRNA) nanomedicine technology to introduce a protein “spike” into the cell body, from which the body will ignite an immune response. According to Sandro da Rocha, Ph.D., a director of the Center for Pharmaceutical Engineering and Sciences at Virginia Commonwealth University, as reported in an article at “MedicalxPress.com”: “This spike protein will do the same job to stimulate the immune system as a vaccine that contains the virus itself. An mRNA vaccine is non-infectious, and the cell will eventually break down the mRNA.” Unlike traditional vaccines, neither the Pfizer nor Moderna vaccines use any part of an active or weakened virus, meaning the patient cannot become ill with SARS-CoV-2 from the vaccine itself, a fear long associated with the polio and measles vaccines. Although the science behind mRNA technology was discovered in the late 1960s and has been clinically studied at great lengths, with a specific focus emerging in the 1990s, it was only recently approved for use in humans.\n\nSOME OF WHAT WE DON’T KNOW\n\nHow long until the mRNA is “broken down,” as Dr. da Rocha states? Once it has broken down, where does it go? Does the body reabsorb it?\n\nWhy has mRNA technology, which has been around for 40 years, only just now been authorized for use in humans?\n\nThe Pfizer vaccine must be kept at extremely cold temperatures to keep it viable. In fact, it must be kept at an impossible -70°C, or -94°F, “about 20 degrees colder than extreme winter temperatures at the South Pole,” reports CBS News. Further, “experts [have] warned that the U.S. lacked the necessary ultra-cold storage trucks and cargo planes needed to ship hundreds of millions of doses at sub-sub-zero temperatures,” and distribution is expected to create a “logistical nightmare.” If this “cold chain” temperature stasis is not maintained, what ill effects could the compromised vaccine produce in people who receive the shots?\n\nThe vaccines are intended to keep the patient from developing symptoms of Covid-19, but can the vaccinated patient still transmit the virus to others? Those who receive shots are told they must continue social distancing and wearing masks, even after the second jab.\n\nAssuming the vaccines do offer protection against developing Covid-19 symptoms, how long will that protection last? Will people need to be reinoculated at some point in the future?\n\nOne legitimate medical emergency that has occurred already in response to the vaccine is severe allergic reaction. As of December 31 there had been about a dozen recorded severe reactions to the vaccines across the U.S. and at least two in the UK, with at least one patient hospitalized. While the allergic reactions have been quickly diagnosed and treated, and individuals are now being monitored for a reaction for 30 minutes post-jab instead of 15 minutes, several questions remain:\n\nIs there a common denominator in these affected patients?\n\nWill the vaccine be safe for people with severe food and/or environmental allergies? More precisely, what is in the vaccine that is actually triggering the allergic responses? It is not recommended for reactive patients to receive the second dose, leaving their protection from the virus at under 50%. The Centers for Disease Control and Prevention now recommends that anyone with a history of severe allergic reactions to “a vaccine or other injectable medications [or to] polysorbate” not receive the vaccine. However, several of those who suffered an allergic response reported no history indicating said potential risk. In the UK, the National Health Service now recommends anyone with a history of significant allergic reactions of any sort should not have the Pfizer vaccine. Further, some scientists have expressed concern that antibodies developed in response to the first shot could trigger increased likelihood of such reactions to a second shot.\n\nAnother medical concern plaguing potential vaccine recipients is the fear of impending damage to women’s reproductive system. Even the guidance documents from Pfizer and Moderna caution the vaccine may be unsafe for pregnant and lactating women, but what about those who may wish to become pregnant in the future? Does the vaccine pose a risk to healthy and safe conception and pregnancy? A 10-page UK guiding document for use of the Pfizer vaccine, entitled “Reg 174 Information for UK Healthcare Professionals,” states women should wait at least two months after receiving the vaccine to conceive. Is this two-month window a data-driven time frame or an abstract recommendation? Additionally, and perhaps most terrifyingly, it has been widely reported that the UK document states, “It is unknown whether Covid-19 mRNA Vaccine BNT162b2 has an impact on fertility.” What does this portend for future pregnancies?\n\nThese unanswered questions are paramount to families and deserve to be answered before blanket acceptance of vaccination can be expected, and those asking these kinds of reasonable questions about potential negative effects to their own health should be respectfully answered rather than shamed.\n\nNo wonder Big Pharma pushed for legal immunity for manufacturers of these warp-speed vaccines. Fortunately for Pfizer and Moderna—and the FDA, which likewise cannot be sued for approving drugs that turn out to be dangerous or deadly—the Secretary of Health and Human Services in February allayed their fears by invoking the Public Readiness and Emergency Preparedness Act, declaring Covid-19 to be a public health emergency and thus immune from liability suits—a “sweeping” immunity that applies to “all types of legal claims under state and federal law.” As the Congressional Research Service explains, “Under the HHS Declaration, covered persons are generally immune from legal liability (i.e., they cannot be sued for money damages in court) for losses relating to the administration or use of covered countermeasures against Covid-19.”", "opengraph": {}, "tags": ["Covid-19", "vaccinations"], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "https://www.texemarrs.com/", "http://www.beatirs.com", "https://www.johnellis.com/wp-content/uploads/2019/05/Revelation_x264.mp4?_=1", "https://afpstore.americanfreepress.net/product/unmasked-the-coronavirus-story/", "#", "#", "#", "#"], "authors": [], "publish_date": null}