{"result_id": "023016", "URL": "https://afpstore.americanfreepress.net/product/screening-sandy-hook-causes-and-consequences/", "timestamp": "2023-04-25 12:00:38 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://afpstore.americanfreepress.net/wp-content/uploads/2018/01/cropped-AFP_Google_Logo2-32x32.jpg", "canonical": "https://afpstore.americanfreepress.net/product/screening-sandy-hook-causes-and-consequences/", "encoding": "UTF-8"}, "image": null, "domain": "afpstore.americanfreepress.net", "title": "SCREENING SANDY HOOK: Causes and Consequences – AFP Store", "cleaned_text": "Most parents would never consider dispensing deadly addictive street drugs to their children, but if a trusted physician writes a prescription for an FDA-approved schedule 2 “medication” for their two-year old based on some questionable mental health screening, those unwary parents do not question or object. Despite side effect warnings, regularly revealed during TV ads, parents frequently fail to take those warnings seriously, perhaps presuming that the side effects rarely occur.\n\nOver the decades, organized psychiatry convened numerous consensus panels that designed hundreds of non-biologically based “disorders” for its Diagnostic and Statistical Manual of Mental Disorders (DSM) especially suitable for the pill-for-every-ill pharmaceutical industry that conceivably already had many profitable solutions for the “disorders,” in the pre-production process.\n\nThe consequences have been disastrous with no discernable end in sight—some people taking prescription drugs or withdrawing from them have perpetrated school, mall and public shootings. That is in addition to thousands of suicides that the public never hears about, unless the victim is a well-known public figure. The military-related suicide rate alone is 8,000 per year—untold numbers of these are the result of the psychiatric drug cocktails doled out by Veterans Administration psychiatrists. The government is Big Pharma’s largest customer.\n\nIn addition to the homicides and suicides, irreversible brain damage results from drug remedies to temporary problems that might have been easily resolved through compassionate interaction and talk therapy. Despite the claim that drugs were not a factor in the Sandy Hook mass murders, certain circumstances provide a different picture.\n\nAdam Lanza, always a unique individual, changed from being a “geeky, weird kid” to being a mass murderer, not of people his own age, but of beautiful, vulnerable children feeling secure in their classrooms in a sleepy bedroom community in Connecticut.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}