{"result_id": "023032", "URL": "https://americanfreepress.net/america-needs-a-vaccine-against-tyranny/", "timestamp": "2023-04-25 12:00:57 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2017/03/cropped-AFP_Site_Icon3-32x32.jpg", "canonical": "https://americanfreepress.net/america-needs-a-vaccine-against-tyranny/", "encoding": "UTF-8"}, "image": null, "domain": "americanfreepress.net", "title": "America Needs a Vaccine Against Tyranny – American Free Press", "cleaned_text": "The World Health Organization (WHO) recently admitted that lockdowns cause more harm than good. Following this announcement, one would have expected American politicians to immediately end the lockdowns. After all, the WHO’s pronouncements are considered infallible, so much so that social media sites silence anyone who dares challenge the great and powerful WHO. Yet, governors, mayors, and other government officials across the country are ignoring the WHO’s anti-lockdown position.\n\nInstead of admitting that the lockdowns were a mistake, many in the political class, which includes a disturbing number of medical professionals whose positions and prestige depend on government, claim that we cannot return to normalcy until a coronavirus vaccine is in wide use. This suggests that people among the majority of Americans who do not wish to be vaccinated will remain under lockdown or be forced to be vaccinated against their will.\n\nThe assault on our liberty will not end with deployment and use of a vaccine. Moncef Slaoui, the chief adviser of the Trump administration’s Operation Warp Speed, a “public-private partnership” in charge of producing and delivering a coronavirus vaccine, has said that those who receive a vaccine will be monitored by “incredibly precise tracking systems.” Slaoui has also indicated that tech giants Google and Oracle will help the government keep tabs on the vaccinated individuals. So, the vaccine program will lead to an increase in government surveillance.\n\nSlaoui is just the latest “expert” to endorse forcing the American people to relinquish their few remaining scraps of privacy to stop coronavirus. Dr. Anthony Fauci and Bill Gates have urged development of a digital certificate for those vaccinated for coronavirus. People without the certificate would find their liberty severely restricted.\n\nThose who think that the new surveillance system will be limited to coronavirus should remember that Social Security numbers were only supposed to be used to administer the Social Security program. They should also consider that the PATRIOT Act’s expansion of warrantless wiretapping was supposed to be limited to stopping terrorists. However, these powers have been used for a wide variety of purposes. Whenever government is given power to abuse our rights for one reason it will inevitably use that power to abuse our rights for other reasons as well.\n\nFauci and Gates’s digital certificate could, and likely will, be expanded to include proof individuals have received a variety of other vaccines and medical treatments. The digital certificate could even extend to monitoring a person’s lifestyle choices on the grounds that unhealthy habits make one more susceptible to diseases.\n\nThe digital certificate could also be tied to the REAL ID program to deny individuals who have not been vaccinated the right to travel. It could also be combined with a future mandatory E-Verify system to deny unvaccinated individuals the right to hold a job. Those who consider this “paranoia” should consider Britain is already developing a Covid passport.\n\nLiberty lost in the “war on Covid” will not be voluntarily returned when the coronavirus threat ends—assuming the government ever stops moving the goal posts and declares the coronavirus threat is over. Instead, the people must be prepared to take back their liberty from the politicians.\n\nFortunately, we still have the ability to do so by the peaceful means of educating our fellow citizens and pressuring our elected officials to reverse course. We must all do what we can to use these peaceful tools before we are in a “dark winter” of authoritarianism.\n\nRon Paul, a former U.S. representative from Texas and medical doctor, continues to write his weekly column for the Ron Paul Institute for Peace and Prosperity, online at www.ronpaulinstitute.org.", "opengraph": {}, "tags": ["Covid-19", "vaccine", "WHO"], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "https://rememberthelawofmoses.com/", "https://www.johnellis.com/wp-content/uploads/2019/05/Revelation_x264.mp4?_=1", "https://afpstore.americanfreepress.net/product/covid-19-and-the-agendas-to-come/", "#", "#", "#", "#"], "authors": [], "publish_date": null}