{"result_id": "023040", "URL": "https://americanfreepress.net/biden-pushes-own-covid-response-plan/", "timestamp": "2023-04-25 12:01:06 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2017/03/cropped-AFP_Site_Icon3-32x32.jpg", "canonical": "https://americanfreepress.net/biden-pushes-own-covid-response-plan/", "encoding": "UTF-8"}, "image": null, "domain": "americanfreepress.net", "title": "Biden Pushes Own ‘Covid Response Plan’ – American Free Press", "cleaned_text": "Mask mandates, lockdowns, electronic tracing, rejoining WHO all part of the plan.\n\nOn Nov. 20, the Centers for Disease Control and Prevention (CDC) reported a record high daily total of 196,000 new cases of Covid-19 in the United States. The number of daily positive results has been steadily rising since early October, and increases in positive cases are projected to rise.\n\nOn one hand, President Donald Trump’s administration appears to have adopted a herd immunity approach, recently popularized by the Great Barrington Declaration, which states that the elderly and immune compromised should receive targeted protections while the young and healthy, along with those in the work force, should begin living life as it was pre-pandemic (as reported in AFP issue 45 & 46). On the other hand, media-anointed President-elect Joe Biden has proposed a more traditional, detailed, and in many ways predictable, response. It is important to note that while Biden has published his strategy, none of its tenets will take legal effect until he is inaugurated. However, the Biden team is encouraging all Americans to take individual action now, such as wearing masks, social distancing, and limiting the size of gatherings, to immediately reduce the spread of the virus.\n\nIn their first public appearance as president and vice president-elect, Biden and Harris made clear that getting control over the coronavirus pandemic is their top priority. Recently, Biden put names and faces to the 13-person team of public health experts that will serve as advisors on his Covid-19 Transition Taskforce.\n\nIn a public statement, he said, “I will be informed by science and by experts. The advisory board will help shape my approach to managing the surge in reported infections; ensuring vaccines are safe, effective, and distributed efficiently, equitably, and free; and protecting at-risk populations.”\n\nQuinton Fottrell writes at “Marketwatch.com,” Biden’s “transition Covid-19 advisory board will be led by co-chairs Dr. David Kessler, a professor of pediatrics, epidemiology and biostatistics at the University of California San Francisco; Dr. Vivek Murthy, who served as the country’s 19th surgeon general from 2014 to 2017; and Dr. Marcella Nunez-Smith, an associate professor of internal medicine, public health, and management at Yale University and associate dean for health equity research at the Yale School of Medicine.” The transition team is expected to welcome additional, permanent advisors to the taskforce after Jan. 20.\n\nAccording to JoeBiden.com, the Biden-Harris team has laid out a “seven-point plan to beat Covid-19 and get our country back on track.”\n\nStep 1: First on the list is to address testing and tracing. Biden aims to create a Pandemic Testing Board, not dissimilar to Roosevelt’s War Production Board, which will produce and distribute tens of millions of testing kits. Additionally, step one of Biden’s plan includes training and mobilizing 100,000 Americans as contact tracers. These newly employed workers will be able to trace the spread of the virus more effectively. Targeted protection of at-risk communities will allow the less affected regions of the country get back to “normal” more quickly.\n\nStep 2: Aims to use the Defense Production Act to increase production of personal protective equipment (PPE). Producing PPE on American soil will build a strong national supply chain, reducing American dependence on other countries in future crises.\n\nStep 3: Provide concise, evidence-based guidance about the national strategy and how Congress should provide resources for complete school and business reopening. As the website says “Social distancing is not a light switch. It is a dial.” Biden aims to provide a “restart package” to help small businesses cover the costs of safely opening. The team says establishing a renewable fund for state and local governments will prevent budget shortfalls that disproportionately affect teachers and firs t responders.\n\nStep 4: “Plan for the effective, equitable distribution of treatments and vaccines.” Biden wants to invest $25 billion into American companies to ensure treatment and distribution will be cost-free to all Americans. Unrelated, but likely beneficial to Biden’s 7-step plan, Pfizer released internal documents on Monday, showing 90% efficacy in their vaccine trial. Additional peer reviewed data is needed, but Pfizer has said 40 million doses may be available by the end of 2020.\n\nStep 5: Touching on points made in oftmaligned Great Barrington Declaration, Biden calls for increased, targeted protections of the elderly and those with a higher risk of complications from Covid-19. Creating a Nationwide Pandemic Dashboard will allow Americans to check in real time “whether local transmission is actively occurring in their zip codes” and then gauge what precautions to take. Biden has previously released specific plans including Plans for Older Americans and Plan for Sup porting People with Disabilities.\n\nStep 6: “Rebuild and expand the defenses that Trump has dismantled to predict, prevent, and mitigate pandemic threats, including those coming from China.” Biden seeks to rejoin the World Health Organization, re-establish the White House National Security Council Directorate for Global Health Security and Biodefense, and relaunch the pathogen-tracking program called PREDICT. Biden also says eyes and ears on the ground in China is essential for tracking future pandemic risks.\n\nStep 7: The Biden and Harris team are encouraging a nationwide mask mandate. Experts believe 70,000+ lives could be saved between “now and the end of December” if 95% of Americans wore a mask around people not in their immediate house hold. Knowing a national mandate would be near impossible to implement, Biden calls for governors and local officials to make mandatory and monitor the use of facial coverings.\n\nIt remains to be seen whether the American public will take heed of any plan set forth by a Biden regime or how they will respond to renewed local mask mandates and the eventual availability of a vaccine. Will there be a sense of relief from liberals that an over-arching Covid-19 plan has been put to paper? Or will our ever-looming doubt in big government render Biden’s proposal dead on arrival? Currently, according to Pew Research, 85% of Americans wear masks.", "opengraph": {}, "tags": ["Covid-19", "lockdowns", "vaccinations", "Joe Biden"], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "https://americanfreepress.net/Issue_45_46_Xmas_catalog_2020.pdf", "https://www.amazon.com/Stretch-Texas-Ground-Jeff-Weber/dp/B07RP4C92H/ref=sr_1_fkmrnull_2?crid=2JOQQC9ZKFRAT&keywords=my+stretch+of+texas+ground&qid=1558243028&s=gateway&sprefix=My+Stretch+of,aps,167&sr=8-2-fkmrnull", "http://www.beatirs.com", "https://afpstore.americanfreepress.net/product/covid-19-and-the-agendas-to-come/", "#", "#", "#", "#"], "authors": [], "publish_date": null}