{"result_id": "023025", "URL": "https://americanfreepress.net/covid-19-freedom-grab/", "timestamp": "2023-04-25 12:00:49 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2017/03/cropped-AFP_Site_Icon3-32x32.jpg", "canonical": "https://americanfreepress.net/covid-19-freedom-grab/", "encoding": "UTF-8"}, "image": null, "domain": "americanfreepress.net", "title": "Covid-19 Freedom Grab – American Free Press", "cleaned_text": "A Fresno, Calif. waffle restaurant dared to open its doors for business in early May to the delight of a long line of customers, who waited up to two hours for the “privilege” of willingly spending their money in a business happy to serve them breakfast on Mother’s Day. This freedom of voluntary transaction is the core of what we used to call our free society. But in an America paralyzed by fear—ramped up by a mainstream media that churns out propaganda at a level unparalleled in history—no one is allowed to enjoy themselves.\n\nThankfully, everyone carries a smartphone these days and can record and upload the frequent violations of our constitutional liberties. In the case of the waffle restaurant, thanks to a cell phone video we saw the police show up in force and try to push through the crowd waiting outside. An elderly man who was next in line to enter was indignant, complaining that he had been waiting two hours to eat at the restaurant and was not about to step aside while the police shut down the place. The police proceeded to violently handcuff and arrest the man, dragging him off while his wife followed sadly behind him to the police car.\n\nIt is hard not to be disgusted by government enforcers who would brutally drag an elderly man away from a restaurant for the “crime” of wanting to take his wife out for breakfast on Mother’s Day. A virus far more deadly than the coronavirus is spreading from Washington down to the local city hall. Tin pot dictators are ruling by decree while federal, state, and local legislators largely stand by and watch as the Constitution they swore to protect goes up in smoke.\n\nPoliticians with perfect haircuts issue “executive orders” that anyone cutting hair for mere private citizens must be arrested. In Texas a brave salon owner willingly went to jail for the “crime” of re-opening her business in defiance of “executive orders.” To add insult to injury, Texas Gov. Greg Abbott very quickly condemned the one-week jail sentence of salon owner Shelley Luther—but the officers who arrested her were only carrying out Abbott’s own orders.\n\nFirst we were told we had to shut down the country to “flatten the curve” so that hospitals were not overwhelmed by coronavirus patients. When most hospitals were nowhere near overwhelmed, and in fact were laying off thousands of healthcare workers because there were no patients, they moved the goalposts and said we cannot have our freedom back until a vaccine was available to force on us or the virus completely disappeared—neither of which is likely to happen anytime soon.\n\nMany politicians clearly see the creeping totalitarianism but lack the courage to speak out. Thankfully, patriots like Shelley Luther are demonstrating the courage our political leaders lack.\n\nWhen Patrick Henry famously said, “Give me liberty or give me death” in 1775, he didn’t add under his breath “unless a virus shows up.” If we wish to reclaim our freedoms, we will have to fight—peacefully—for them. As Thomas Paine wrote in 1776, “These are the times that try men’s souls. The summer soldier and the sunshine patriot will, in this crisis, shrink from the service of their country; but he that stands by it now, deserves the love and thanks of man and woman.”\n\nRon Paul, a former U.S. representative from Texas and medical doctor, continues to write his weekly column for the Ron Paul Institute for Peace and Prosperity, online at www.ronpaulinstitute.org.", "opengraph": {}, "tags": ["mainstream media", "Coronavirus"], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "https://www.johnellis.com/wp-content/uploads/2019/05/Revelation_x264.mp4?_=1", "https://afpstore.americanfreepress.net/product/profiles-in-corruption-abuse-of-power-by-americas-progressive-elite/", "#", "#", "#", "#"], "authors": [], "publish_date": null}