{"result_id": "023028", "URL": "https://americanfreepress.net/asia-is-winning-the-war-against-covid-19-and-the-west-is-not/", "timestamp": "2023-04-25 12:00:53 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2017/03/cropped-AFP_Site_Icon3-32x32.jpg", "canonical": "https://americanfreepress.net/asia-is-winning-the-war-against-covid-19-and-the-west-is-not/", "encoding": "UTF-8"}, "image": null, "domain": "americanfreepress.net", "title": "Asia Is Winning the War Against Covid-19 and the West Is Not – American Free Press", "cleaned_text": "I am the virologist, specialist in coronaviruses and respiratory diseases, whose views differ significantly from the experts who advise the government on the management of the COVID-19 pandemic.\n\nThe situation is dire and I would like to offer you a clear plan for getting out of the health, economic, and social crisis that Belgium and the rest of the world are facing.\n\nEverything I am proposing is based on the basic principles of public health that have been known since ancient times; and the history of the five pandemics of the previous five centuries has only one refrain: The cities and the countries that emerge from pandemics relatively unscathed are those that respect these rules; the others pay their tribute. It was true yesterday, it is true today. It is enough to see how Taiwan, Hong Kong, and Singapore handled the crisis from the start, and how China and South Korea recovered. Contrary to what the prime minister says, there are countries that are doing very well in their handling of this crisis.\n\nThe urgency of the situation.\n\nThe very first principle of public health in a response to a pandemic can be summed up in one word: EMERGENCY! Always answer right away with absolutely all means available, as this is the best and only reasonable way to flatten the curve. Every hour counts, and every hour lost means more people infected, more people hospitalized, more deaths. It’s just basic math.\n\nIf you hurt your fingertip and the wound becomes infected, you have to act quickly. Otherwise, your entire finger, then your hand, and finally your arm will be affected. It’s the same with the population in the event of a pandemic; it’s an exact analogy. The infectious agent spreads from cell to cell in our body before infecting it in its entirety if we do not stop it, and in the same way the coronavirus spreads from individual to individual in our social body, and we must do everything to stop it, immediately, without any delay.\n\nMy point of view differs from that of other experts, and for me, the fault lies first of all with the WHO. They made two errors with absolutely catastrophic consequences in their management of this crisis. The first was to believe that this new coronavirus was transmitted in the same way as the two recently emerged coronaviruses, SARS and MERS. It is the classic mistake of generals to prepare for the coming war by thinking that it will be a repetition of the previous one. They dig fortified trenches, put heavy artillery in bunkers, and then a blitzkrieg overruns them.\n\nSARS and MERS were not very contagious for respiratory viruses, and, from an epidemiological point of view, we knew, for example, that the contagion only happened when the patient was already sick for 4-5 days, which explains that for these two epidemics the virus was spread mostly to relatives and attending medical staff.\n\nOur public health measures are not suitable for COVID-19.\n\nBy contrast, COVID-19 is transmitted before the onset of symptoms, which implies that public health measures that could control a virus like SARS and MERS (but only if they were rigorously applied, with quarantine of people returning from risk areas, and mass screening), could never be sufficient to contain such a contagious virus.\n\nThis contagiousness, comparable to that of rubella or mumps before vaccination, implies that this virus can only spread like wildfire in an immunologically naive population. And a virus capable of being transmitted by aerosol can only explain this contagiousness; it is a property of practically all respiratory viruses, SARS and MERS being notable exceptions to the rule.\n\nThe WHO has, in fact, admitted in a press release that aerosol transmission is possible and requires more study, when we don’t have time for more study. I worked in an institute dedicated to respiratory diseases and there the work on aerosols, chemical or infectious, is done every day, it is perhaps 10% of their activities; I have absolutely no doubt that this virus is transmitted by aerosol, if I can leave my reserve as a scientist who must doubt everything. In an emergency situation, we follow the preponderance of evidence.\n\nThe WHO’s first fault was that it did not recognize that aerosol transmission was substantial and therefore that the recommendations had to be changed to contain the spread of the virus, which they still have not done. The WHO’s second fault is to underestimate the contagiousness of the virus, with a basic reproduction number of ~ 2.5 when in reality it is ~ 7, with a doubling time of 2.4 days in the absence of any public health measure.\n\nItaly has been in total lockdown since March 10 and we can clearly see that since the cessation of all non-essential economic activity, the progression of the coronavirus has slowed down (doubling time ~ 5.5 days on March 24 compared to ~ 3.3 days before the lockdown), but it still remains exponential‼ [Update: doubling time 9.7 days for this last week on March 29. A lockdown makes a big difference; it works].\n\nThere is therefore progress, but it is insufficient, and that is why the Italian government is considering even stricter measures. We [in Belgium] are only 4-5 days behind Italy when we consider the difference in population size, so in proportion to the infected population we will be in the same percentage of cases as Italy in 4-5 days.\n\nWe will not stop the exponential progression with the current measures.\n\nIn Belgium, we have had a doubling time of ~ 3.3 days for the past 15 days, the same figure as Italy before its lockdown. On March 24, Italy is at 5.5 days of doubling time, but it is still not enough. So we are not doing enough in Belgium. We will not stop the exponential progression with the current measures.\n\nThe recipe for successful countries is: sanitary cordon, screening of travelers, massive use of adequate masks by the population, quarantine when necessary, surveillance of respiratory diseases, massive screening, tracing of possible contacts, and early hospitalization when necessary. But you have to be organized before the pandemic to be able to apply this recipe.\n\nAs we find ourselves in an insufficiently prepared pandemic, what to do?\n\nThe first thing to realize is that those who continue to work in a non-essential occupation must stop immediately for two reasons. First of all, in practice the 1.5 meters are not respected. You just have to see the preparation for the swearing-in of the government to realize it. Then, and above all, a virus that is transmitted by aerosol respects no distance.\n\nSo the first measure to take is the immediate cessation of all non-essential economic activity, with only teleworking allowed. Certainly we can do without going to the hairdresser in a crisis. It is imperative to close the daycare, Belgian-style, leaving a daycare for essential staff, but otherwise it is necessary to close the daycare. Babies can be very contagious. For example a six-month-old baby in South Korea, under observation in a hospital because her parents were infected, produced an amount of virus considered contagious for 20 days. Her only symptom? 38°C for less than an hour over the total duration of the observations.\n\nTo understand what is going to happen, we must now consider two distinct populations in Belgium:,those who remain active because they have an essential function, and those who are confined to lockdown, because the prognosis is very different for these two populations.\n\nIn any viral epidemic, there are three fractions: a) the uninfected population, b) an infected but asymptomatic fraction (and here potentially contagious and the number of which is unknown), and c) an infected fraction with various symptoms and varying degrees of severity. When we put the population in lockdown (we start with four weeks, then we reevaluate), we limit our contacts to only the household and the people met in food stores.\n\nSo infected people will only contaminate at most those who live under the same roof, plus a very small fraction outside their house. The number of people infected in this population can therefore only be multiplied at most by, say, four; the average number of people living under the same roof should be taken as a multiplier. During the lockdown, those who were infected and asymptomatic can either get rid of the virus naturally or become symptomatic, be identified, and then be treated appropriately for the severity of their symptoms.\n\nContrast this to a scenario of no containment during these four weeks, where the number of people infected would be multiplied by 256, at the current rate of 3.3 days as doubling time. The measures in place today in Belgium will lengthen this doubling time, but not enough. The curve will remain exponential.\n\nSo for the population whose activity is not essential, it is the most basic common sense that the lockdown be imposed today, and the sooner it is implemented, the sooner we can get out and return to an almost normal economic activity. And the sooner it is implemented, the fewer people will be infected, hospitalized, and dead in the final assessment.\n\nIt is, of course, the population that is most at risk during the lockdown period. I had a flashback to this scene in Stanley Kubrick’s film, “Barry Lyndon,” where we see the troops advancing in close rank, and lines after lines fall under the musket fire, the madness of war, mid-19th century version.\n\nI went on Facebook to get feedback, and I get messages from everywhere, especially those on the front lines. I’m also on the COVID-19 group for medical doctors. In public medical personnel present a brave face. Like the government, they cannot show their feelings. But in private there are all the feelings, the fear, the rage, the incomprehension that in the 21st century, a society that believes itself advanced finds itself so unprepared to face a relatively small number of cases.\n\nLet’s remember the difference between isolation (or surgical) masks and the famous N95/FFP2 masks. The first wave in Wuhan the medical staff was short of FFP2, all the photos show them with surgical masks; result: 3,000 infected medical staff. The Chinese government sends reinforcements, 42,000 medical personnel equipped with FFP2; result: zero infection out of 42,000!\n\nOur doctors and nurses proudly go into battle without the necessary protection, namely a N95/FFP2, knowing that they will become infected one after the other, falling like the soldiers of the empire, like already Dr. Philippe Devos with whom I was on a TV set at the beginning of the month. But we cannot say that publicly in our society. In France a scientist has been rebuked for daring to say that Macron sends the medical staff to the “case-pipe,” another metaphor for heavy casualties. It’s apparently too raw to describe reality simply; you have to wrap it in lots of euphemisms.\n\nIt is simply UNACCEPTABLE as a situation and absolutely everything must be done to rectify it as soon as possible. It is infuriating to learn that we placed only ONE order in Turkey for such a vital material as FFP2 masks, when we should have placed 100 orders! And then there was fraud and we received nothing! We can sue them but it will not save any life here.\n\nChina is once again offering this equipment for sale and by chartering a plane you can have the equipment in two days. There was an article in La Libre (a Belgian newspaper) by a journalist in Hong Kong who was offended that members of the French government continued with the disinformation that these masks would not help the population, and she made the essential point that these masks were available in China. What are we waiting for?\n\nFFP2 must be recycled for the moment.\n\nFurthermore, I tried to communicate the importance of recycling FFP2 masks, without any success. It is a matter of life and death. These masks are considered for single use and staffs throw them away too quickly. This is not the place to be technical, but I have proposed four methods to recycle them, and they must be implemented according to the sterilization equipment available in hospitals, information that I have still not been able to obtain. We must educate medical staff on how to extend the life of these masks and recycle them, today—the urgency is immense.\n\nThe army, firefighters, and probably the police have gas masks, which should not be left in the barracks, they are even more effective than the FFP2. We do not care if it looks crazy to see doctors with gas masks, I prefer to see them stay alive and able to care for patients, and also it would prevent them from becoming vectors of spread themselves. How many gas masks, which are cleanable and reusable, are available?\n\nFinally, for the front-line staff who cannot be protected by an FFP2 or a gas mask, what about using hydroxychloroquine? I floated the idea on Facebook COVID-19 medical doctor group, the prophylactic use of hydroxychloroquine to see their responses, which of course ranged from total rejection to approval as an idea worth pursuing.\n\nThe major objection is that the studies are preliminary, but we don’t have time for a study with more double-blind patients. Our healthcare staff will be needlessly infected by then. The prophylactic use of this drug for malaria is well demonstrated. There is a population for whom it would be contraindicated, but it is well known and we are talking about medical personnel, not self-medication.\n\nIt is necessary to leave the choice to each individual to protect themselves in this way or not, according to the availability of the proper masks. Do not believe that the doctors do not know their rights, which is in particular not to work in conditions that put them in excessive danger. [Health Minister] Maggie De Block’s statement on Monday—no FFP2 on the front line—shocked and woke up more than one caregiver.\n\nThe second difficulty is logistics, and all wars are won or lost in logistics. It is not clear if we have enough of this drug, hydroxychloroquine, because of course the priority goes to COVID-19 patients, and patients afflicted with chronic diseases such as rheumatoid arthritis, lupus etc., who also need this drug.\n\nI hear that Belgium, like France, has taken over the national stock, and that France has several factories capable of producing hydroxychloroquine. We have to know what is in stock and their productive capacity, and how much France would be able to supply, with what delay, in order to calculate the judicious use of our stocks.\n\nAnd, if we know that reinforcements will arrive in time, let us use part of our stocks as prophylactics for those on the front line who want them because they do not have an adequate mask, including those who do not see symptomatic COVID patients, because of contagion by asymptomatic individuals. Those who cannot be protected by FFP2 or hydroxychloroquine must remain in reserve. It is imperative!\n\nFFP2 masks for the population, a simple solution for returning to work.\n\nTo finish with the masks, let us understand that what will get us out of confinement, lockdown, and will allow the population to resume almost normal work, is the massive production of FFP2 masks for the entire population, small (children) and adults (adults). The faster the necessary production tools are put in place, the faster Belgium can get back to work. It’s really that simple.\n\nDuring the minimum four weeks of lockdown, massive screening is needed, and the establishment of the task force is a step in the right direction. We cannot lift the lockdown until our ability to track down infected individuals has been greatly increased.\n\nAt Vo’Euganeo in Italy, all the confined residents (3,300) were tested a month ago. Result: Out of 89 positive cases, there are only a handful of contaminations, reports La Voix du Nord. The approach I propose works when you can combine lockdown and massive screening.\n\nThis screening should especially not be limited to the nucleic acid of the coronavirus. A team from Namur (and many others around the world) produced a serological test that was validated and then promptly prohibited, on the pretext that it will not detect recently infected patients before they produce antibodies. An absurd position, because all doctors are already well aware of this limitation.\n\nThis test is useful. Let us think of all those who were quarantined because of flu symptoms, but who could not be tested due to lack of sampling equipment, or not given enough priority for testing during the test shortages. They would like to know what infected them. A screening for the presence of nucleic acid, the screening test currently used, no longer makes sense if people got rid of the virus at the time of being tested. In addition to valuable information on the spread of the virus in our country, positive cases identified by this technique would motivate a disinfection of their home.\n\nOther logistical aspects that require urgent attention are the situation of the truckers who are on their knees and no longer have access to the facilities that normally allow them to function humanely, and the farmers who replant. We must ensure that we replant what Belgium will need because there is the risk that countries keep their agricultural production for domestic purposes in this pandemic situation.\n\nIt is, of course, necessary to increase the number of respirators available.\n\nUniversal income for the duration of the government-mandated lockdown.\n\nWe must also support the population with a form of universal income for the duration of the lockdown mandated by the government, it is not only necessary financially for many who have their rent and food and other bills to pay, but it will certainly decrease the general anxiety of the population, which will allow it to resist the virus more effectively. It will also facilitate acceptance of containment and compliance with the rules.\n\nFinally, with Belgium rebuilding itself post-corona and preparing for the probable return of the virus in October, once again masks for everyone is the simple and effective solution (and we can manufacture them in fabrics, which must be validated, of course, and make them recyclable).\n\nWe must consider that our medical staff and other first lines will probably be in a state of revolt, comparable to that of the Yellow Vests, because of the horrendous conditions in which they were forced to operate.\n\nOur society must change. Why return to society as it was organized before it failed in its most basic duty? And of course, politics has an essential role to play. Let’s not have preconceived ideas. Paul Craig Roberts proposes a rational approach, which has proven itself for companies in difficulty, which we would be very inspired to consider: https://www.paulcraigroberts.org/2020/03/23 / china-uses-the-michael-hudson-paul-craig-roberts-solution-for-the-economic-crisis /\n\nSo in summary, and without further ado:\n• FFP2 masks or gas masks or hydroxychloroquine for all those on the front line; recycling of masks; those who have no real protection remain in reserve; more respirators are needed;\n• Massive nucleic acid and serological screening of all suspected cases;\n• Industrial production of FFP2 masks to put the population back to work when the health lockdown is lifted;\n\nMarc Wathelet is a virologist and specialist in coronaviruses and respiratory diseases.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "http://Marc Wathelet, a virologist and specialist in coronaviruses and respiratory diseases explains why Asia was successful in containing Covid-19 and why the West is not.", "https://www.beatirs.com", "https://www.paulcraigroberts.org/2020/03/23%2520/%2520china-uses-the-michael-hudson-paul-craig-roberts-solution-for-the-economic-crisis%2520/", "https://www.paulcraigroberts.org/2020/03/23/debt-forgivness-and-nationalization-are-the-answers-to-the-economic-crisis/", "#", "#", "#", "#"], "authors": [], "publish_date": null}