{"result_id": "023021", "URL": "https://americanfreepress.net/the-oral-polio-vaccine-ruining-lives-since-1957/", "timestamp": "2023-04-25 12:00:45 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2017/03/cropped-AFP_Site_Icon3-32x32.jpg", "canonical": "https://americanfreepress.net/the-oral-polio-vaccine-ruining-lives-since-1957/", "encoding": "UTF-8"}, "image": null, "domain": "americanfreepress.net", "title": "The Oral Polio Vaccine: Ruining Lives Since 1957 – American Free Press", "cleaned_text": "\n• Dads who got polio from vaccinated kids had different outcomes.\n\nIn what could be dubbed “A Tale of Two Fathers,” two American fathers contracted polio from their infant daughters who received oral polio vaccines. Both men were likely infected while changing their daughters’ diapers. Keep in mind the two fathers did not receive the oral polio vaccines; their baby daughters did.\n\nFather No. 1: In 1971, Wall Street executive New York City resident Dominick Tenuto became paralyzed, sued vaccine maker Lederle Laboratories and, after 30 years of legal wrangling and appeals, a jury verdict of $22.5 million was upheld. New York’s Daily News reported that Tenuto who uses a wheelchair lost his job and sued in 1981 after contracting polio.\n\n“When I found myself paralyzed, a co-worker of mine called the hospital,” said Tenuto. “Little did I know I would be paralyzed for the rest of my life.” Thinking he would soon die, Tenuto spent months on a respirator in intensive care. Tenuto said: “I was on death’s door. . . . We called a priest.”\n\nTenuto did recover after months of rehabilitation but remained partially paralyzed, saying with his jury award he will provide for his family, have his “teeth fixed” and move out of subsidized housing.\n\nFather No. 2: In 1998 truck driver Gregory Clifford checked himself into his local emergency room, after presenting symptoms of leg weakness and severe back pain. Clifford had changed his daughter’s diaper a few months earlier. Three days after being admitted to the ER, Clifford was given a tracheotomy and was put on a ventilator, having suffered respiratory failure.\n\nDoctors told Clifford and his family terrible news: He had polio. Hospitalized in different facilities for more than a year, Clifford died of pneumonia, secondary to the polio infection.\n\nUnlike Tenuto, the Clifford family’s legal options were limited. The National Vaccine Injury Compensation Program (NVICP), passed in 1986, created a federal claims program that has exclusive jurisdiction concerning vaccine injury claims.\n\nVaccine manufacturers are immunized from liability and fees tacked on to vaccine sales are used to fund the court and pay claims. There is no option to have the case heard by a jury, as the Seventh Amendment to the United States Constitution guarantees.\n\nImagine that. Vaccine manufacturers have the federal government “hear” claims against their products where fault isn’t an issue, but rather U.S. attorneys defend the federal government against claims.\n\nFrom birth throughout young adulthood, parents and children are bullied into vaccine compliance, but never are they informed about the actual risks of vaccines, let alone a vaccine court. Adults, as well, are subjected to heavy pressure to get vaccinated, especially government employees and those who work in the medical field.\n\nWayne Rohde is probably the most well-informed person regarding the little known vaccine court. Rohde has reviewed every vaccine case published, interviewed 285 families who suffered vaccine related injuries, as well as a former Department of Justice special master, and spent three-and-a-half years researching and accumulating information that resulted in his book, The Vaccine Court: The Dark Truth of America’s Vaccine Injury Compensation Program.\n\nRohde reports that on July 30, 2002 the Clifford family was granted the maximum $250,000 death benefit, which the NVICP allowed, but was denied any additional funds.\n\nRohde explained: “It would be a few more years before the families who have lost a husband, wife, son or daughter can receive compensation for medical expenses, pain and suffering and loss of future earnings.”\n\n\n\nAMERICAN FREE PRESS asked Rohde for his perspective on the two cases.\n\n“The reason for why this (Tenuto’s) case was not in the NVICP (in the first place) is because the original suit was filed in 1981, several years before the establishment of the NVICP,” he said. “It took 30 years to come to a final decision. God bless Dominick Tenuto and his family.”\n\nRohde added: “The point is, Why did the New York courts not move the case to the jurisdiction of the NVICP? That is the $22 million question.”\n\nBeing uninformed in 2015 is not an option.\n\nKnowing the risks of vaccinations and also what legal hurdles and limitations a vaccine-damaged person may face under the NVICP are musts.\n\nJames Spounias is the president of Carotec Inc., originally founded by renowned radio show host and alternative health expert Tom Valentine and his wife, Carole. To receive a free issue of Carotec Health Report—a monthly newsletter loaded with well-researched and reliable alternative health information—please write Carotec, P.O. Box 9919, Naples, FL 34101 or call 1-800-522-4279. Also included will be a list of the high-quality health supplements Carotec recommends.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "https://americanfreepress.net/influx-of-illegal-aliens-could-give-nwo-excuse-to-force-vaccinate", "https://en.wikipedia.org/wiki/Polio_vaccine#Oral_vaccine", "http://www.silive.com/news/index.ssf/2009/03/a_staten_islander_details_livi.html", "https://en.wikipedia.org/wiki/American_Cyanamid", "https://www.law.cornell.edu/nyctap/I97_0170.htm", "http://www.law360.com/articles/152197/judge-won-t-nix-22-5m-award-in-pfizer-polio-suit", "http://www.nydailynews.com/new-york/staten-island-dad-22-5m-polio-case-lederle-laboratories-article-1.369105", "https://en.wikipedia.org/wiki/Vaccine_court", "https://en.wikipedia.org/wiki/Seventh_Amendment_to_the_United_States_Constitution", "http://mgid.com/advertisers/?utm_source=widget&utm_medium=text&utm_campaign=add", "http://mgid.com/", "http://www.thevaccinecourt.com", "http://www.uscfc.uscourts.gov/sites/default/files/opinions/MILLMAN.clifford.dec.pdf", "http://www.clixtrac.com/banner/click.php?banner=156365", "http://www.carotec.com", "#", "#", "#", "#"], "authors": [], "publish_date": null}