{"result_id": "023042", "URL": "https://americanfreepress.net/kamala-harris-says-theres-no-vaccine-against-racism/?utm_source=rss&utm_medium=rss&utm_campaign=kamala-harris-says-theres-no-vaccine-against-racism", "timestamp": "2023-04-25 12:01:08 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2017/03/cropped-AFP_Site_Icon3-32x32.jpg", "canonical": "https://americanfreepress.net/kamala-harris-says-theres-no-vaccine-against-racism/", "encoding": "UTF-8"}, "image": null, "domain": "americanfreepress.net", "title": "Kamala Harris Says There’s ‘No Vaccine Against Racism’ – American Free Press", "cleaned_text": "A few years ago, a political cartoon depicted Jesse Jackson and Al Sharpton looking wistfully into the night sky as they make a wish “for an end to racial strife and bigotry.” In the next panel, both suddenly evaporate, indicating that the eradication of racism would leave these two “leaders” with nothing to do and that their race-hustling would come to an end.\n\nThis brings us to Sen. Kamala Harris’s Democratic National Convention speech, where she accepted her nomination as vice president and quickly whipped out the race card. Harris said: “And let’s be clear—there is no vaccine for racism. We’ve gotta do the work.”\n\nA vaccine against racism would be the worst possible nightmare for Democrats such as Harris and running mate Joe Biden. A vaccine would produce the mother of all the emperor-wears-no-clothes moments.\n\nAs with the Jackson/Sharpton cartoon, the elimination of racism would deprive Harris of liberals’ go-to excuse: Blame racism. Whether the disintegration of the black family, urban crime, or support for public schools with high dropout rates and where those who remain in school often cannot read, write, and compute at grade level, the left blames racism.\n\nDuring the convention, former President Barack Obama, as he did during the eight years of his presidency, pushed the America-is-a-racist-nation narrative: “Americans of all races joining together to declare, in the face of injustice and brutality at the hands of the state, that Black Lives Matter, no more, but no less, so that no child in this country feels the continuing sting of racism.” He, of course, provided no definition of what he means by “the continuing sting of racism.”\n\nWhen in private practice, young attorney Obama was on an eight-member legal team representing one of the plaintiffs in a class-action lawsuit against Citibank. The plaintiffs argued that Citibank turned them down for loans because of racism. The lawsuit claimed Citibank “rejected loan applications of minority applicants while approving loan applications filed by white applicants with similar financial characteristics and credit histories.”\n\nDespite denying any racial discrimination in denying their mortgage applications, the bank settled, giving some plaintiffs cash payments while others got mortgages. According to a 2012 piece in the “Daily Caller”: “Roughly half of the 186 African- American clients in (Obama’s) landmark 1995 mortgage discrimination lawsuit against Citibank have since gone bankrupt or received foreclosure notices.\n\n“As few as 19 of those 186 clients still own homes with clean credit ratings.”\n\nGiven the plaintiffs’ post-loan approval track record, had there been a vaccine against racism in the 1990s, would it have made it any more likely that their loans would have been approved?\n\nArguably, a vaccine against racism would disproportionately impact blacks, but not in the way Harris likely thinks. Question: Who is racist? A recent Rasmussen survey of Americans found: “Eighteen percent (18%) say most white Americans are racist. But 25% believe most black Americans are racist. Fifteen percent (15%) think most Hispanic-Americans are racist, while nearly as many (13%) say the same of most Asian-Americans.” As to anti-Semitism, it is higher among blacks compared with the general population, 23% versus 14%, respectively, according to a 2016 survey commissioned by a prominent Jewish lobby group. The survey found, “In the past four years, anti-Semitic views among the African-American population have remained steady and are higher than the general population.”\n\nAn example just occurred in the National Basketball Association, a league that takes pride in its “wokeness.” A black player got into an on-court scuffle, and the black player, who later apologized, called the white player “[expletive deleted] white boy.” One can imagine the Category 5 storm that would have hit had a white player used a racial slur against a black player. Would an apology from the white player have sufficed? The big “woke” names in the NBA—LeBron James, coach Steve Kerr, and coach Gregg Popovich—never shy about pointing out racism against blacks, went social media silent on this issue.\n\nWe would likely obtain a greater benefit with a vaccine against white guilt, a paternalism that leads to counterproductive policies. These policies include the welfare state that encourages the non-formation of a nuclear family; the minimum wage that reduces jobs and hours for unskilled American workers; race-based preferences that create college-student mismatches that increase the dropout rate of the supposed beneficiaries of the racial preference; and refusal of Democrats to support school choice, something that black urban parents want but white Democrats do not.\n\nCuring these problems is the “vaccine against racism.”\n\nLarry Elder is an American libertarian talk radio host, author, and attorney who hosts “The Larry Elder Show.” He is also a columnist with Creators Syndicate. He can be reached via Instagram at instagram.com/larryeldershow/ and can be found on Twitter at @larryelder. See also www.LarryElder.com.", "opengraph": {}, "tags": ["Kamala Harris", "BLM", "systemic racism", "Joe Biden"], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "https://rememberthelawofmoses.com/", "https://clixtrac.com/banner/click.php?banner=292096", "http://www.kingidentity.com", "https://afpstore.americanfreepress.net/product/the-trayvon-hoax-combined-book-and-dvd-special/", "#", "#", "#", "#"], "authors": [], "publish_date": null}