{"result_id": "023009", "URL": "https://americanfreepress.net/heres-why-people-should-be-suspicious-of-big-pharma/", "timestamp": "2023-04-25 12:00:30 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2017/03/cropped-AFP_Site_Icon3-32x32.jpg", "canonical": "https://americanfreepress.net/heres-why-people-should-be-suspicious-of-big-pharma/", "encoding": "UTF-8"}, "image": null, "domain": "americanfreepress.net", "title": "Here’s Why People Should Be Suspicious of Big Pharma – American Free Press", "cleaned_text": "Few people had heard of human papillomavirus (HPV) vaccines prior to Texas Governor James Richard “Rick” Perry’s failed bid for the 2012 Republican presidential nomination.\n\nWhat America learned is that Perry bypassed the legislature and on February 2, 2007 issued an executive order making Texas the first state in the country to force sixth-grade girls to receive the three-shot vaccination series, which cost about $120 per shot, known as Gardasil.\n\n\n\nAs a presidential candidate, Perry said he was wrong to issue the executive order but still insisted the vaccine saved lives.\n\nNow, new information suggests Gardasil and other HPV vaccines do not protect girls against cervical cancer and have serious, potentially permanent and horrific side effects.\n\nWhen government works with “Big Pharma” to scare the public, then uses police powers to order dangerous vaccines be given to young girls—and, to top it off, forces taxpayers to foot the bill—how much further away from a free people can we get?\n\nLest one think that Perry is being singled out, California Governor Jerry Brown (D), once dubbed “Governor Moonbeam” for his purportedly left-flaky point of view, may be close to signing a bill , SB277, that forces all children to get vaccinated before kindergarten.\n\n“The bill now goes to the Assembly,” reported KABC in Sacramento. “It will also require approval from Gov. Jerry Brown. If approved, California would become the third state in the country, joining Mississippi and West Virginia, without either exemption.”\n\nIn 2011, Brown signed legislation that gave “children 12 or older the right to obtain preventive treatment for sexually transmitted diseases without parental consent, including an HPV immunization for cervical cancer.”\n\nFamed neurosurgeon Dr. Benjamin Solomon “Ben” Carson, Sr., who recently announced his bid for the Republican nomination, stated unequivocally that vaccines should be mandatory, going further than most by saying that religious and philosophical exemptions should be eliminated.\n\nAre these politicians truly interested in promoting the health of citizens, particularly children?\n\nIn Perry’s case, The Washington Post reported he received $29,500 since 2000 in contributions from Merck, the manufacturer of Gardasil.\n\nThe ties between Merck and Perry raise suspicion. Merck’s Texas lobbyist at the time was Mike Toomey, Perry’s former chief of staff. Merck also funded a phony grassroots—also called “astroturf”—organization called Women in Government (WIG). The Texas state director of WIG was Republican state Representative Dianne White Delisi, mother-in-law of Perry’s then-chief of staff.\n\nCronyism is nothing new. However, it takes on a new dimension when young children are the potential victims of scare campaigns that result in potentially dangerous vaccines being forced upon them.\n\nWhat’s encouraging to health activists is that light is being shed upon the potential dangers of HPV vaccines, which may wake up a sleeping public.\n\nDr. Diane Harper, who helped develop Gardasil, told an international conference on vaccines, “Gardasil is largely unnecessary and it has never been fully tested on females under the age of 15.”\n\nDr. Harper added, “They created a huge amount of fear in mothers, and appealed to mothers’ sense of duty to get them to get their daughters vaccinated.”\n\nDr. Harper explained that 70% of HPV infections clear up within a year without treatment and, within two years, 90% recover; the body literally clears the infection on its own accord.\n\nLucija Tomljenovic, Ph.D., from the Neural Dynamics Research Group in the Department of Ophthalmology and Visual Sciences at the University of British Columbia, uncovered documents that suggest Merck and government authorities conveniently hid damaging information about Gardasil.\n\nIn an interview in a French health journal, Dr. Bernard Dalbergue, a former pharmaceutical industry physician with Gardasil manufacturer Merck, echoing others who are concerned about the safety of the HPV vaccine, made this statement:\n\nThe full extent of the Gardasil scandal needs to be assessed. Everyone knew when this vaccine was released on the American market that it would prove to be worthless. Diane Harper, a major opinion leader in the United States, was one of the first to blow the whistle, pointing out the fraud and scam of it all. I predict that Gardasil will become the greatest medical scandal of all time because at some point in time, the evidence will add up to prove that this vaccine, technical and scientific feat that it may be, has absolutely no effect on cervical cancer and that all the very many adverse effects, which destroy lives and even kill, serve no other purpose than to generate profit for the manufacturers. Gardasil is useless and costs a fortune. In addition, decision-makers at all levels are aware of it. Cases of Guillain-Barré syndrome, paralysis of the lower limbs, vaccine-induced MS and vaccine-induced encephalitis can be found.\n\nIf you think you can trust Big Pharma, think again.\n• Could Common Herbicide Be Behind Autism Rise?\n• None The Electromagnetic Assault on Our Brains and Bodies\n• None Doctors Say Wireless Devices to Blame for Raft of Illnesses\n\nJames Spounias is the president of Carotec Inc., originally founded by renowned radio show host and alternative health expert Tom Valentine and his wife, Carole. To receive a free issue of Carotec Health Report—a monthly newsletter loaded with well-researched and reliable alternative health information—please write Carotec, P.O. Box 9919, Naples, FL 34101 or call 1-800-522-4279. Also included will be a list of the high-quality health supplements Carotec recommends.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "http://en.wikipedia.org/wiki/Human_papillomavirus", "http://www.politifact.com/texas/statements/2010/feb/06/rick-perry/perry-says-hpv-vaccine-he-mandated-would-have-been", "http://truthaboutgardasil.org", "http://abc7.com/news/ca-senate-approves-bill-mandating-vaccinations-for-school-kids--/723251", "http://www.sb277.org", "http://abc7.com/news/ca-senate-approves-bill-mandating-vaccinations-for-school-kids--/723251", "http://www.utsandiego.com/news/2011/oct/09/brown-signs-bill-minors-seek-preventive-std-treatm", "https://www.bencarson.com", "http://www.buzzfeed.com/andrewkaczynski/ben-carson-health", "http://www.washingtonpost.com/politics/rick-perry-reverses-himself-calls-hpv-vaccine-mandate-a-mistake/2011/08/16/gIQAM2azJJ_story.html", "http://www.nvic.org/Events/Vaccine-Conference-2009/speakers.aspx", "http://www.naturalnews.com/030782_HPV_vaccinations_side_effects.html", "http://www.vaccinesafetyconference.com/speakers.html", "http://www.neuraldynamicsubc.ca", "http://ddata.over-blog.com/xxxyyy/3/27/09/71/2012-2013/Juin-2013/Dr-Dalbergue--Gardasil--plus-grand-scandale-de-tous-les-tem.pdf", "http://healthimpactnews.com/2014/mercks-former-doctor-predicts-that-gardasil-will-become-the-greatest-medical-scandal-of-all-time", "https://americanfreepress.net/?p=22494", "https://americanfreepress.net/?p=22663", "https://americanfreepress.net/?p=22954", "https://americanfreepress.net/?p=23254", "https://americanfreepress.net/?p=23476", "https://americanfreepress.net/?p=23884", "https://americanfreepress.net/?p=24079", "http://www.clixtrac.com/banner/click.php?banner=156365", "http://www.carotec.com", "#", "#", "#", "#"], "authors": [], "publish_date": null}