{"result_id": "023052", "URL": "https://americanfreepress.net/maker-of-shingles-vaccine-faces-lawsuits/", "timestamp": "2023-04-25 12:01:20 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2017/03/cropped-AFP_Site_Icon3-32x32.jpg", "canonical": "https://americanfreepress.net/maker-of-shingles-vaccine-faces-lawsuits/", "encoding": "UTF-8"}, "image": null, "domain": "americanfreepress.net", "title": "Maker of Shingles Vaccine Faces Lawsuits – American Free Press", "cleaned_text": "A legal action against pharmaceutical giant Merck is shedding more light on vaccination dangers. Among the side effects listed in the warnings on packaging of Zostavax, a vaccination advertised to prevent shingles, are necrotizing retinitis, a severe eye disorder, and shingles.\n\nA group of lawsuits that allege pharmaceutical giant Merck’s Zostavax—a vaccine that is purported to prevent herpes zoster (shingles)—caused damage is shedding light on the possible dangers of this highly advertised medical treatment.\n\nTrial lawyer Marc Bern reports he is gathering “thousands of complaints” yet to be filed in Philadelphia. Bern told pharmaceutical news website “FiercePharma,” “I think Merck has failed terribly . . . to warn about the very serious side effects and the failure of the vaccine to do what they claim it does.”\n\nBern filed what is believed to be the first lawsuit against Merck. Plaintiff Jorja Bentley, from Nevada, claims that Merck failed to warn of the risk of viral infection and that she suffered a headache, dizziness, and blurred vision shortly after receiving the vaccine. She stated that she continues to suffer from injury to her right eye, elevated blood pressure, headaches, and dizziness.\n\nBug Out While You Still Can! Learn More…\n\nBern stated: “We’ve been looking at this potential case for some time, and we believe it is highly meritorious. We believe the vaccine is at best 50% effective. Either it is not effective, or it has caused shingles and other issues, like in this case, where it has caused a serious [eye] complication.”\n\nThe fact that Zostavax may be implicated in eye-damage claims became better known when Merck got permission from the FDA in 2016 to include a warning that reads, “Eye Disorders: necrotizing retinitis (patients on immunosuppressive therapy).”\n\nTellingly, another side effect of the shingles vaccine is shingles. According to an Aug. 28, 2014 approval letter, the FDA granted Merck’s request “to include ‘infections and infestations: Herpes zoster (vaccine strain)’ and to update the patient package insert to include ‘shingles’ in the ‘What are the possible side effects of Zostavax?’ section.” In 2011, “gastro-intestinal disorders: nausea” was added as well.\n\nMost claims against vaccine makers never make it to court because the National Childhood Vaccine Injury Act (NCVIA) of 1986 created a compensation program for vaccine injuries, the National Vaccine Injury Compensation Program (VICP), run through the Department of Health and Human Services.\n\nMany, but not all, vaccines are registered with the VICP, and because Zostavax is not registered, individuals are allowed to pursue litigation against Merck.\n\nThe VICP reviews vaccine injury claims, which are not limited to childhood vaccines. Roughly $3 billion has been awarded to victims since its creation in the 1980s, even though nearly two out of three claims are denied compensation.\n\nVaccine skeptics have plenty to say about the shingles vaccine.\n\nAnne Dachel, media editor for “AgeOfAutism.com,” which is a website devoted to assisting those who believe that autism is an environmentally induced illness, interviewed Dr. Kenneth Stoller, an integrative physician who practices in San Francisco. Dr. Stoller is the author of Incurable Me, a book that exposes some of the darkest secrets of the medical industry.\n\nStoller told Ms. Dachel that there is “zero credible safety data” on vaccines.\n\n“Vaccines are not tested for safety against a saline placebo,” he said. “They are tested against a solution that contains all of the adjuvants, metals, DNA, and other toxins etc., but just minus the infectious disease itself—in this case the varicella virus. So the safety data and adverse event data Merck cites in their package does not have a lot of meaning.”\n\nHow our immune systems respond to viruses cannot be reduced to the simplistic idea that a vaccine will protect us against a virus, and that those who are unvaccinated pose a risk to those who may be immune compromised. Introducing live or dead viruses into our system, by injection or orally, with or without “dangerous adjuvants,” is not the answer to fighting disease, according to some medical professionals.\n\nMs. Dachel posted a statement by Robert Krakow, former prosecutor and co-author of “Unanswered Questions from the Vaccine Injury Compensation Program: A Review of Compensated Cases of Vaccine-Induced Brain Injury,” a 2011 article published in Pace Environmental Law Review.\n\nKrakow, now in private practice, handles vaccine injury claims and gave this statement to Ms. Dachel: “Given the obvious risk of serious injury from the Zostavax vaccine, any person over 50 should proceed with caution regarding the commercially promoted recommendation to get this vaccine. While shingles can be serious in rare cases, my view is that efforts to maintain good health and a strong immune system will serve us better in preventing shingles than obtaining this vaccine, which has the undeniable risk of serious injury.\n\n\n\nThere are almost 5,000 reports of adverse events after Zostavax. The vaccine contains substances that can provoke autoimmunity. . . . As with many other vaccines, I am not convinced that the vaccine or its components have been properly tested. The promotion of Zostavax on television and other places is as irresponsible as it is inappropriate. The value of the vaccine is overstated, while the risk of adverse reactions is downplayed.”\n\nWhether someone should get the shingles vaccine is a matter of personal choice. This writer and American Free Press do not give medical advice. We do believe it is our obligation, though, to provide information for readers to research further and consult with their medical professionals.\n\nJames Spounias is the president of Carotec Inc., originally founded by renowned radio show host and alternative health expert Tom Valentine.", "opengraph": {}, "tags": ["NVIC", "zostavax", "vaccinations", "national childhood vaccine injury act"], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "http://shop.americanfreepress.net/incurable-me.html", "http://www.fincabayano.net/en/survival.htm?%20utm_source=americanfreepress.net&utm_medium=banner&utm_campaign=fincabayano", "http://www.libertystickers.com", "http://shop.americanfreepress.net/incurable-me.html", "http://mgid.com/advertisers/?utm_source=widget&utm_medium=text&utm_campaign=add", "http://mgid.com/", "#", "#", "#", "#"], "authors": [], "publish_date": null}