{"result_id": "023043", "URL": "https://www.americanfreepress.net/html/bio-chemists_murdered_149.html", "timestamp": "2023-04-25 12:01:09 CEST+0200", "meta": {"description": "", "lang": "de", "keywords": "", "favicon": "", "canonical": "https://www.americanfreepress.net/html/bio-chemists_murdered_149.html", "encoding": "ISO-8859-1"}, "image": null, "domain": "www.americanfreepress.net", "title": "Bio-Chemists Murdered_149", "cleaned_text": "Two French students, working on the real origins of bird flu, tortured, killed in London Two French biochemical students, Laurent Bonomo and Gabriel Ferez, were murdered by Israeli Mossad-British intelligence assassination teams on June 29, 2008. Both Bonomo and Ferez were studying at the prestigious London Imperial College researching the origins of bird flu and the link to the alleged vaccines.\n\n\n\nThe murders were first revealed by France’s Directorate for Internal Security, not by Britain’s Scotland Yard, making it likely that the students were French intelligence officers. London police arrested Daniel Sonnex, 23, and Nigel Edward Farmer in the killings. \n\n\n\nA joint French-U.S. Intelligence anti-terrorist task force in Paris, headed by former Secretary of State Colin Powell and former head of French intelligence Jean Crouté, for years has monitored the activity of the Israeli mercenaries. The patriotic American-French team has allegedly prevented various scripted terrorist attacks, i.e. false flags, on both the United States and Europe, with the planning of the attacks actually originating inside the compromised intelligence agencies of the United States, the United Kingdom, Israel and Germany, according to task force sources.\n\n\n\nThe two researchers had discovered that the alleged bird flu vaccine, H-7, which was designed to neutralize and stop the H5N1 avian flu virus, had been spliced using DNA to actually create a vaccine and an illness producing virus at the same time. The French students had also discovered that the bird flu vaccine, i.e. a virus, had links to U.S., British and Israeli laboratories associated with the noted Mossad agent, Dr. Philip M. Zackerie.\n\n\n\nIsraeli microbiologist Zackerie, known as “Dr. Zack,” worked for the U.S. bio-weapons lab at Ft. Detrick, Md., where he was photographed handling the strain of anthrax used in the post 9-11 attack according to published reports. He was a consultant at the FBI linked company Gilead Sciences Inc. of Boulder, Colo. Gilead Sciences has been linked to the 9-11 anthrax strain and to the bird flu vaccine.\n\n\n\nThe two French students, who had their apartment broken into one week before their brutal assassination, also had their lap-top computer stolen and their apartment fire-bombed.\n\n\n\nThe operation has been traced to a team of 10 Israeli Mossad and British MI5 agents. The two individuals currently under arrest in the United Kingdom were witnesses to the murders, according to task force sources,\n\nand their lives are in jeopardy.\n\n\n\nThe assassination of Bonomo and Ferez happened just after the recent meetings that took place in Northern Ireland between President George Bush, former President Bill Clinton and current British Prime Minister Gordon Brown.\n\n\n\nThe two murders also may be related to the recent alleged assassination attempt on French President Nicolas Sarkozy and Israeli Prime Minister Ehud Olmert in Ben Gurion International Airport in Israel.\n\n\n\nOfficially, an Israeli border patrol officer who was a member of the Druze community shot himself as Sarkozy and his wife were mounting the stairs to their plane. The man’s body then fell from the top of the building where he had been perched. Many believe he was an Arab patsy-to-be before the assassination attempt went awry.\n\n\n\nSarkozy was also aware of the bird flu treason and plans to use it against France as well as the Israeli Mossad hacking of French INTERPOL Internet portals using the U.S. National Security Agency and a headquarters in Amsterdam.\n\n\n\nGeorge Kadar is a Hungarian national living in England. He acts as one of AFP’s European bureau chiefs. Subscribe to American Free Press. Online subscriptions: One year of weekly editions—$15 plus you get a BONUS ELECTRONIC BOOK - HIGH PRIESTS OF WAR - By Michael Piper.\n\n\n\nPrint subscriptions: 52 issues crammed into 47 weeks of the year plus six free issues of Whole Body Health: $59 Order on this website or call toll free 1-888-699-NEWS . \n\n\n\nSign up for our free e-newsletter here - get a free gift just for signing up!", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.americanfreepress.net/rss/afp.xml", "http://www.americanfreepress.net/html/online_edition.html", "http://www.americanfreepress.net/html/afp_subscribe.html", "http://www.americanfreepress.net/html/afp_subscribe.html", "http://www.americanfreepress.net/html/email_newsletter.html"], "authors": [], "publish_date": null}