{"result_id": "023002", "URL": "https://americanfreepress.net/mainstream-rag-demands-death-for-those-who-question-big-pharma/", "timestamp": "2023-04-25 12:00:23 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2017/03/cropped-AFP_Site_Icon3-32x32.jpg", "canonical": "https://americanfreepress.net/mainstream-rag-demands-death-for-those-who-question-big-pharma/", "encoding": "UTF-8"}, "image": null, "domain": "americanfreepress.net", "title": "Mainstream Rag Demands Death for Those Who Question Big Pharma – American Free Press", "cleaned_text": "The Boston Herald has called for the death penalty for those who would share health information that is counter to big pharma’s nostrums, parroted by mainstream media. But the history of measles in America, and the measles, mumps and rubella vaccine, should cause anyone to question the reassuring, dismissive pat on the head they get from most doctors when asking whether their baby really needs yet another jab.\n\nThe vaccine hysteria rhetoric is heating up so much that the Boston Herald editorial board on May 10 wrote that “lying” to people about vaccines should be a “hanging offense.”\n\nThe Herald’s call to death was made in light of the widely reported story about the children of Somali refugees in Minnesota who experienced an “outbreak” of measles. Apparently, some Somali parents have opted their children out of the MMR (measles, mumps, and rubella) vaccine, enraging the establishment vaccine lobby.\n\nThe word outbreak connotes something massive, but, in real numbers, we’re talking about 46 children, 41 of whom are Somalian; none of these children are seriously ill, as of this writing.\n\nThe Herald’s full statement concluding the editorial reads: “These are the facts: Vaccines don’t cause autism. Measles can kill. And lying to vulnerable people about the health and safety of their children ought to be a hanging offense.”\n\nBug Out While You Still Can! Learn More…\n\nIf the Herald took the effort to do even a minimal job of investigation, free of bias, they would issue an apology and investigate the many layers of vaccination, from theory to practice, instead of calling for lynching of those who question vaccine dogma. Of course, that won’t happen, and the fact that vaccine critics are educating the public in alternative media outlets is irritating the establishment to the extent that a noted media organ calls for death.\n\nWhile this writer is solidly against mandatory vaccination of any kind, for reasons of personal liberty and science, one would think the push to vaccinate would actually have a profound basis, given the hyperbolic call for death.\n\nMeasles deaths were in severe decline for decades before the introduction of the measles vaccine in the U.S. in 1963 and even before the proliferation of penicillin in 1944. While a significant number of people died from measles in the 1800s, by the early 20th century, measles became manageable with knowledge of the importance of nutrition, not vaccination or pharmaceuticals.\n\nIn 1960, the official number of deaths from measles was recorded as 380 in the United States, in a population of 180,671,000 people. Compared to other causes of death, measles ranked extremely low. Even in 1963, deaths from asthma were 56 times higher than measles, from accidents were 935 times higher (motor vehicles 323 times higher), and heart disease 9,560 times higher, according to Dr. Suzanne Humphries and Roman Bystrianyk in their book titled, Dissolving Illusions.\n\nWhy, then, did the establishment in 1963 foist the measles vaccine on the public when measles literally wiped itself out, without a vaccine, antibiotics or other wonder drug?\n\nIf you are conspiratorially minded, the question may answer itself: Rockefeller-inspired allopathic medicine claimed that measles needed to be “wiped out” entirely.\n\nWiping out a disease that is already virtually non-existent doesn’t make sense to anyone with common sense. The irony is that it was already well known among medical professionals that in most cases, measles was a benign disease from which most recovered and, as a result, actually received the benefit of immunity against a subsequent occurrence.\n\nDr. Humphries and Bystrianyk wrote how important vitamin A is to preventing measles from overtaking the body and that this was known in the early 1900s: “It was known that certain vitamins had a significant impact on measles outcomes. Vitamin A stops the measles virus from rapidly multiplying inside cells by up-regulating the innate immune system in uninfected cells, which helps to prevent the virus from infecting new cells.”\n\nIt’s a fact that well-nourished children didn’t die or suffer damage from a case of the measles, and that use of cod liver oil in the 1930s resulted in helping those affected. Studies in the 1990s confirmed that by using vitamin A, measles deaths could be reduced up to 90% in developing countries where children often are severely malnourished.\n\nBetter nutrition made children in America and most of the advanced world healthier, because advances in transportation brought vitamin-rich fruits and vegetables to more people. Dr. Humphries and Bystrianyk drove this point home by tracking the incidence of scurvy and measles, both of which plummeted due to better nutrition.\n\nThe measles vaccine has a checkered history, from inception of its use in 1963 to today’s version, in spite of assurances of safety and efficacy from big pharma and its lapdog media. The first measles vaccine introduced in America in 1963, known as the KMV (killed measles virus), contained “ ‘killed’ virus (which) was an aluminum-precipitated vaccine produced from formaldehyde-inactivated monkey kidney cell cultures,” according to Dr. Humphries and Bystrianyk.\n\nThe KMV was a disaster, causing pneumonia and encephalopathy (brain swelling) in some cases, which brought the establishment to recommend it be discontinued, as early as 1967.\n\nNot learning from this mistake, big pharma thought it a good idea to use a live vaccine, instead, and recommend that all who had received the KMV get the new vaccine as well.\n\nAs Dr. Humphries and Bystrianyk wrote, “Those who encountered wild measles or live vaccine measles, after having the killed vaccine, had a tendency to develop a more severe disease, atypical measles” because the immune system in those vaccinated wrongly programmed the immune system.\n\nThe modified live vaccine brought rashes to nearly half of those injected and fevers up to 106 degrees in up to 83% of those who received it. Don’t fear, though: The geniuses at big pharma injected a “measles-specific antibody,” which did keep excessive rash and fever under control, but brought about other health maladies in those who received it, including neurological problems. Ironically, atypical measles could appear up to 16 years after injection of the modified measles vaccine. The measles vaccine did cause neurological damage in some reported cases and, interestingly, did not contain mercury as an adjuvant—driving home the point that mercury, alone, should not be singled out as the “problem” with vaccines.\n\nMany have heard the names of Dr. Andrew Wakefield and Dr. William Thompson, in news reports. Dr. Wakefield has been wrongly attacked as a fraud when all he did was have published in the journal Lancet in 1998 a link between regressive autism and a gastro-intestinal malady named ilea nodular enterocolitis in children given the MMR vaccine. Dr. Wakefield’s paper was retracted by The General Medical Council 12 years later in what is best described as politics.\n\nDr. Thompson, a former Center for Disease Control (CDC) scientist, who invoked federal whistleblower protection in 2014, reported that the CDC committed fraud regarding the link between vaccines and autism. He wrote in a letter to the CDC: “I regret that my coauthors and I omitted statistically significant information in our 2004 article published in the journal Pediatrics. The omitted data suggested that African-American males who received the MMR vaccine before age 36 months were at increased risk for autism. Decisions were made regarding which findings to report after the data were collected, and I believe that the final study protocol was not followed.”\n\nGiven the history of measles and vaccination in the United States, is it any wonder reasonable parents object to vaccination?\n\nThe Boston Herald and the medical establishment have failed abysmally when one considers the burden of proof is on them to show that injecting viruses with various chemical adjuvants into the bodies of children should not only be safe, but should also be warranted to prevent serious, life-threatening diseases.\n\nJames Spounias is the president of Carotec Inc., originally founded by renowned radio show host and alternative health expert Tom Valentine.", "opengraph": {}, "tags": ["measles", "Somalian children"], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "http://www.fincabayano.net/en/survival.htm?%20utm_source=americanfreepress.net&utm_medium=banner&utm_campaign=fincabayano", "http://www.libertystickers.com", "http://mgid.com/advertisers/?utm_source=widget&utm_medium=text&utm_campaign=add", "http://mgid.com/", "#", "#", "#", "#"], "authors": [], "publish_date": null}