{"result_id": "023023", "URL": "https://americanfreepress.net/american-institutions-serving-no-one-but-the-elite/", "timestamp": "2023-04-25 12:00:47 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2017/03/cropped-AFP_Site_Icon3-32x32.jpg", "canonical": "https://americanfreepress.net/american-institutions-serving-no-one-but-the-elite/", "encoding": "UTF-8"}, "image": null, "domain": "americanfreepress.net", "title": "American Institutions Serving No One But the Elite – American Free Press", "cleaned_text": "What do Americans get from their government, Big Business, Big Pharma, the U.S. justice system and Big Media? Let’s see if we can answer those questions.\n\nWhat do Americans get from their government?\n• Income tax which is confiscation of labor—essentially slavery or part-time slavery. A slave is a person who doesn’t own his own labor. No one subject to an income tax owns his own labor. A slave is a person whose labor, in part, belongs to another claimant. That is what income tax is—a claim on your labor. Most American taxpayers pay higher taxes than medieval serfs.\n• Endless wars in which Americans die for secret agendas of a few and the profits of the armament companies. Most gullible are “patriots” who wrap themselves in the flag and rush off to die for they know not what.\n• Lies about white people who are demonized by the “woke” Biden regime, public schools, universities, and the presstitutes of the Ministry of Propaganda, the mass media complex mind controlling the public.\n• Disrespect of the U.S. Constitution. According to “woke” Biden Democrats and Democrat judges, the U.S. Constitution is a document of white supremacy and oppression of minorities.\n\nWhat do Americans get from their corporations?\n• Offshored production for U.S. markets that destroys American jobs, middle class living standards, state and local government tax bases, and eventually the U.S. dollar.\n\nWhat do Americans get from their health care system?\n• The destruction by Big Pharma lobbying and campaign contributions of private practice and the formation of corporate medicine.\n• Big Pharma treatment protocols that destroy the independence of doctors in corporate medicine and fires them if they follow the Hippocratic Oath.\n• Money-making ventures such as the “Covid pandemic” that resulted in deaths due to withheld treatment with Ivermectin and HCQ, and massive deaths and injuries by the “emergency use authorization” of an untested mRNA “vaccine.”\n• U.S. medical care is the highest cost and least effective medical system on Earth.\n\nWhat do Americans get from their “justice system”?\n• Rigged trials focused only on convicting the defendant, not on finding the truth.\n• Violation of the requirement of a trial by peers. White Americans are arrested, indicted, prosecuted and tried with the participation of blacks who have been taught by the public school systems, universities, and “woke” media to hate white people as “racist oppressors.” In other words, instead of trial by peers, white people face trial by enemies. As there is scant prospect of justice in American court rooms, 97% of defendants, whether innocent or guilty, accept a plea deal in place of their right to a trial.\n\nWhat do Americans get from their media outlets?\n• Nothing but lies and official narratives that support, and protect from truth, the agendas of the ruling elites.\n\nWhy do people join the U.S. military to protect such evil? Are they completely mindless?\n\nGo ahead, amuse yourselves. Ask the same questions about any and all U.S. institutions. Try to find one that serves the people. All institutions are corrupted to serve perversity, evil, and the agendas of the elite.\n\nDr. Paul Craig Roberts was assistant secretary of the U.S.Treasury under President Ronald Reagan and was associate editor and columnist at The Wall Street Journal. He has been a professor of economics in six universities and is the author of numerous pertinent books available at www.AmericanFreePress.net.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "https://americanfreepress.net/afpaudio/9_10_23_Audio/04_9_10_23_Elites_Roberts.mp3", "http://www.usassetadvisors.com", "https://www.socialsecuritymoney.com/sales-page20148115", "https://johnellis.com/", "https://americanfreepress.net/amember/signup", "#", "#", "#", "#"], "authors": [], "publish_date": null}