{"result_id": "023053", "URL": "https://americanfreepress.net/can-trucker-convoy-squash-vax-mandates/", "timestamp": "2023-04-25 12:01:21 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2017/03/cropped-AFP_Site_Icon3-32x32.jpg", "canonical": "https://americanfreepress.net/can-trucker-convoy-squash-vax-mandates/", "encoding": "UTF-8"}, "image": null, "domain": "americanfreepress.net", "title": "Can Trucker Convoy Squash Vax Mandates? – American Free Press", "cleaned_text": "It has been said that when the Sun rises in the west, the end of the world is nigh. Though that hasn’t happened literally yet, a metaphorically resplendent Sun recently rose in the Canadian west: the Freedom Convoy of truckers protesting Canada’s draconian vaccine mandates. The 11,000-truck, 93-mile-long convoy left British Columbia on Jan. 23 heading eastward toward the national capital, Ottawa.\n\nBefore the departure of the convoy, truckers had been protesting Canada’s new vaccine requirement by stopping traffic at border crossings. Those border shutdowns demonstrated what could happen to the supply chain as a result of the Jan. 15 trucker vaccine mandate. Since nearly half of American truckers are unvaccinated, the vax-check at border crossings, despite the presumably widespread use of fake vaccine cards, could lead to shortages and empty shelves in supermarkets. As “Bloom­berg News” explained, the Canadian mandate “threatens to upend the flow of everything from food to auto parts to building supplies between two of the world’s largest trading partners.”\n\nIt also threatens to put thousands of truck drivers out of business. According to the Canadian Broadcasting Corporation: “The Canadian Trucking Alliance and the American Trucking Associations say up to 26,000 of the 160,000 drivers who make regular trips across the Canada-U.S. border are likely to be sidelined as a result of the vaccine mandate.”\n\nThe officials who are devastating North America’s economy with new mandates, even as European countries are dropping theirs, must have a political death wish. Experts agree that the emergence and spread of the mild but ultra-contagious vaccine-resistant omicron variant has changed the Covid equation. As of early 2022, it is clear that nothing—least of all boosting the vaccinated population by a few percentage points through mandates—will stop the spread of the “omicron variant.” From a medical perspective, the mandates (like cloth masks and social distancing) are completely pointless.\n\nBut the politicians don’t care about science or medicine. They only care about campaign money and votes, just like Big Pharma kingpins only care about profits and bonuses. And, just as Big Pharma has calculated that medically insane policies can reap them trillions of dollars in profits, politicians think the media has brainwashed a plurality of voters into hating and scapegoating the unvaxxed.\n\nThose politicians have miscalculated. They need to remember Bill Clinton’s 1992 campaign slogan “It’s the economy, stupid!” Though it’s true that the media’s Edward Bernays-style propaganda campaign has ginned up a wave of hysteria against the unvaxxed, voters are not going to reward leaders like U.S. President Joe Biden and Canadian Prime Minister Justin Trudeau for cratering the North American economy. Donald Trump, who would have handily won the 2020 election if Covid hadn’t destroyed the economy, can testify to that.\n\nConservatives in Canada and Republicans in the United States are already sowing future political capital by supporting the Freedom Convoy. Conservative leader Erin O’Toole has met with the truckers and expressed sympathy, while Donald Trump Jr. posted a pro-Convoy YouTube video saying, “Let’s support these truckers fighting for freedom, fighting as patriots in their country and patriots in America. We need more people willing to push back and say enough is enough to the nonsense.”\n\nThe pro-mandate anti-freedom media is already panicking and trying to shift the blame. The Guardian, for example, recently cited anonymous “experts” who assert that “the vaccine mandate is just one part of a ‘perfect storm’ to hit the nation’s food system. Highway closures due to bad weather and staffing challenges at grocery stores have also made it difficult to get food on shelves.” So, when you’re starving, don’t blame the insane, scientifically bankrupt mandates, blame the weather and lazy grocery store workers!\n\nIt seems the forces of unfreedom are overplaying their hand. Starving your people is not a good political strategy. It’s one thing to prevent unvaccinated people from shopping for groceries, as Quebec has done, and quite another to starve the nation.\n\nVaccine mandates are just the latest example of extremist, scientifically bankrupt Covid policies driven by mass hysteria triggered by one-sided media propaganda. From a public health perspective, these policies are a spectacular failure: Propaganda and censorship have made the Covid problem even more intractable.\n\nThe rate of compliance with public health measures would undoubtedly be higher if people felt they could trust the authorities. But the hysterical propaganda and draconian censorship of contrarian perspectives has made it obvious even to casual observers that we are only getting one side of the story. The predictable result has been the rise of a burgeoning populist movement questioning what we are being told and insisting on preserving constitutional freedoms. The Freedom Convoy across Canada represents that movement well. Let’s hope and pray it runs over the mandates and leaves them as roadkill on the highway of history. H\n\nKevin Barrett, Ph.D., is an Arabist-Islamologist scholar and one of America’s best-known critics of the War on Terror. From 1991 through 2006, Dr. Barrett taught at colleges and universities in San Francisco, Paris, and Wisconsin. In 2006, however, he was attacked by Republican state legislators who called for him to be fired from his job at the University of Wisconsin-Madison due to his political opinions.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "https://www.dlionheart.com/post/the-great-american-die-off-is-underway", "https://afpstore.americanfreepress.net/product/print-news-matters-1-year-print-subscription-u-s-only/", "https://www.beatirs.com/", "#", "#", "#", "#"], "authors": [], "publish_date": null}