{"result_id": "023013", "URL": "https://americanfreepress.net/measles-hysteria-hits-u-s/", "timestamp": "2023-04-25 12:00:35 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2017/03/cropped-AFP_Site_Icon3-32x32.jpg", "canonical": "https://americanfreepress.net/measles-hysteria-hits-u-s/", "encoding": "UTF-8"}, "image": null, "domain": "americanfreepress.net", "title": "Measles Hysteria Hits U.S. – American Free Press", "cleaned_text": "Media hysteria over a measles “outbreak” in New York has reached a fever pitch, yet nary a word about frightening police-state measures being used against parents who choose to not have their children vaccinated with the apparently dangerous MMR vaccine.\n\nRecent commentary on the current reported measles outbreak from healthcare professionals and government officials, blasted across the major media nearly nonstop, amounts to virtual hysteria, with unvaccinated people being singled out on the basis of utterly biased reporting. While public confidence in vaccine safety is decreasing, public debate is being essentially forbidden. Now, police-state measures threatening fines and quarantine of those refusing vaccines are rising, with persecution of the unvaccinated already happening in some places.\n\nIn Rockland County, N.Y., where 186 cases of measles in its population of about 329,000 have been logged since Oct. 2018, the health commissioner announced anyone who “is unvaccinated, has a laboratory-confirmed case of measles, has been identified by a health investigation as being exposed to measles, and is under age 18 will be issued an order to essentially stay at home for up to 21 days.” Parents or guardians who fail to comply with this order are threatened with a $2,000 fine per day.\n\nIn New York City, where an outbreak among ultra-Orthodox Jews that started in the fall when a child returned from Israel contagious with measles, Mayor Bill de Blasio declared a “public health emergency” and issued an executive order mandating vaccination in the neighborhoods of Brooklyn and Queens affected by the outbreak. Anyone who has not been vaccinated against measles or cannot show evidence of immunity could face a $1,000 fine.\n\n“Unvaccinated people are being blamed all over the place and people [in reaction] are actually starting to get the vaccine even if they’re older” out of fear, Joe Martino, host of the YouTube-based news show “Collective Evolution,” recently observed. He points to a USA Today video production titled, “How the anti-vax movement brought the measles back from near extinction.” The video description states: “Outbreaks across the U.S. have forced officials to declare emergencies. Why are we starting to see the rise of these outbreaks? It dates back to the antivax movement.”\n\nThe video states, “[I]n some places, parents can be fined $500 or spend 6 months in jail for not vaccinating their kids. In one New York county, unvaccinated kids are banned from appearing in any public place. . . . The World Health Organization reported that people who chose not to vaccinate are a global health threat.”\n\nUSA Today blames the decreasing compliance with measles, mumps, and rubella (MMR) vaccination requirements on research by Dr. Andrew Wakefield published in The Lancet in 1998, which it calls “one of the most serious frauds in medical history.”\n\nMartino and fellow journalist Arjun Walia, however, note that mass media and pro-vaccine institutions have long misrepresented that Wakefield, a gastroenterologist, firmly linked the MMR vaccine to autism in his published, peer-reviewed findings. In fact, they explain, Wakefield simply proposed a connection between gastro-intestinal issues and autism and noted the possibility of an MMR vaccination linkage. Wakefield clearly stated that more research is needed, yet he lost his medical license, and his reputation was, and continues to be, irreparably smeared worldwide.\n\nWhile USA Today doesn’t note any of the many other developments suggesting the measles vaccine either isn’t effective or actually causes the very illness it’s supposed to prevent, parents choosing not to vaccinate can point to many studies. For instance:\n• An American Journal of Public Health 1991 study cited an early-1988 outbreak of 84 measles cases at a Colorado college where over 98% of students had documentation of “adequate” measles vaccinations—which is above the “herd immunity” threshold.\n• In a 2011 outbreak, during which unvaccinated people were demonized, a study from New York City’s Bureau of Immunization of the Department of Health and Mental Hygiene “actually traced the measles outbreak to a vaccinated individual who had been twice vaccinated, and they concluded that the measles may occur in vaccinated individuals and secondary transmissions from such vaccine individuals is documented,” as Walia explained, noting these were just two of dozens of studies that exist.\n• In support of recent legislation (H.B. 1638) in Washington state, biochemical engineer Brian S. Hooker, who has published multiple papers on the issue of ineffective vaccines, addressing a House committee, said: “There’s a problem with measles in Washington . . . but it’s not low vaccination rates. It’s actually high rates with a vaccination product unable to provide lifetime immunity or vigorous maternal protection to infants during their first year of life.”\n\nAlternative health practitioner Brian David Andersen, of the Tri Vortex Institute in Palm Desert, Calif., recalled that the measles has always been one of those maladies “that you get once in childhood, stay home a few days from school, and then you’re naturally immune.” He added, “All that Robert F. Kennedy Jr. and other vaccine skeptics really want are impartial, rigorous studies to fully determine vaccine ingredients and find out, once and for all, if the vaccines actually work and are worth all the expense and the risks they create.”\n\n“The whole ‘anti-vax’ movement is really moving up and they’re pushing back with fear,” he told AFP, referring to the medical establishment’s reaction—with multi-billions of dollars at stake. Perhaps this explains the alarming encroachment of the “medical police state” in places like New York City and California, where longstanding exemptions from vaccination requirements are being revoked, and “non-compliant” parents are being threatened with fines and incarceration.\n\nMark Anderson is AFP’s roving editor. Email him at [email protected].", "opengraph": {}, "tags": ["vaccinations", "medical tyranny", "anti-vax", "measles", "police state"], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "http://mgid.com/advertisers/?utm_source=widget&utm_medium=text&utm_campaign=add", "http://mgid.com/", "https://afpstore.americanfreepress.net/product/vaxxed-the-movie/", "https://afpstore.americanfreepress.net/product/corporate-ties-that-bind-an-examination-of-corporate-manipulation-and-vested-interest-in-public-health/", "/cdn-cgi/l/email-protection#4e3a3c3b3a2626213b202a7c0e372f262121602d2123", "#", "#", "#", "#"], "authors": [], "publish_date": null}