{"result_id": "023033", "URL": "https://americanfreepress.net/vaccine-hesitancy-remains-high/", "timestamp": "2023-04-25 12:00:58 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2017/03/cropped-AFP_Site_Icon3-32x32.jpg", "canonical": "https://americanfreepress.net/vaccine-hesitancy-remains-high/", "encoding": "UTF-8"}, "image": null, "domain": "americanfreepress.net", "title": "Vaccine Hesitancy Remains High – American Free Press", "cleaned_text": "Reports of allergic reaction, severe complication, and even death following the injection of the Covid-19 vaccine have become more frequent in recent weeks. The VAERS self-reporting system, mentioned in prior AFP reporting [Issue 5 & 6, 2020], now links 329 deaths to the Moderna and Pfizer/BioNTech vaccines. It is no longer a fringe “conspiracy theory” to question the safety of these manufactured products. Polling by the PEW Research Foundation and Gallup Analytics reports public perception of the vaccine is ripe with speculation. A December 2020 Gallup poll found consumer confidence in the vaccine is low, with nearly 40% saying they will probably or definitely not receive the shot. Of healthcare workers polled, some 29% say they will refuse the vaccine as long as it is optional. These numbers are even higher among Los Angeles County healthcare workers, where the refusal rate is up to 40%. In Ohio, Gov. Mike DeWine says some 60% of nursing home staff will or have already refused the inoculation.\n\nAccording to the Kaiser Family Foundation, there are three concerns frequently cited for not vaccinating against Covid-19 at this time.\n\nThe most common apprehension is fear of the potential side effects, both short and long term. Almost 60% said what is not yet known about the side effects is the cause for their trepidations. Obviously, no data currently exist predicting what possible problems could arise a year, two years, or more after inoculation. The first trial participants received their doses a mere 10 months ago, far too recently for any meaningful clinical or anecdotal long-term evidence to present itself.\n\nThe second concern cited by Kaiser is a “lack of trust in the government to ensure the safety of the various vaccines and [their] effectiveness.” People fear that the FDA rushed approval and that the government doesn’t yet know when or if the vaccines will even end the pandemic. The breakneck speed at which the FDA pushed these shots into citizens’ arms is enough to give many pause. Even the name “Operation Warp Speed” has been a turn-off for many, with social media posts saying it sounds more like a low-budget 1980s science fiction movie and less like an apolitical government program, built with cautious oversight and a scientific foundation.\n\nThe third most frequently cited hesitation is fear that politics played a role in the process. After a turbulent final year for the Donald Trump administration and a slow start to the vaccine rollout by the Joe Biden administration, it should come as no surprise that people don’t trust that there was enough separation between the federal government and the private interests of Big Pharma groups, which stand to make billions of dollars. Whether a Republican or Democrat sits in the White House, billion-dollar biomedical corporations have their hands out, eager to take a profit on the back of a global crisis. Vaccine hesitancy or not, people are right to worry that these private interests convolute the truth.\n\nI recently spent time with two women, both struggling to make sense of the past year, the virus, and the vaccine.\n\nFrom her screened-in porch in a deeply conservative coastal Florida town, Betty Hardwick, 89, says she was recently offered the vaccine but turned it down. “Not until there’s enough of it. I can’t imagine why they would give it to some old lady like me, whose life is done spent, when there’s young people with their whole life ahead of ‘em,” she explained. When asked whether she believes the science behind the vaccine proves it is safe, Ms. Hardwick replied, “I don’t know. I sure hope. But whether it will keep you from getting the virus, I don’t know. After this last year of foolishness. . . . There’s been so much lying and untruths that I don’t have much faith in the government now.” Ms. Hardwick says she remembers her first vaccine, for smallpox, in 1939. She said, “If the doctor said you needed it, you needed it. I don’t think people trust doctors that way nowadays. I sure don’t. There’s too much money goin’ around to think everyone is doing the right thing for the right reason.”\n\nIn a sleepy, rural Midwestern hospital, registered nurse Tina Kellogg has been on the front line of this pandemic since it began, serving her community as a registered nurse in the emergency room and treating too many Covid-positive patients to count. As a medical professional of nearly 20 years, Ms. Kellogg says she has never missed a vaccine but, like many of her colleagues, the rapid production and approval of the Moderna and Pfizer/BioNTech vaccines left her feeling apprehensive. “It’s just too new. Even if the technology has been around, the vaccine itself hasn’t. The trial participants haven’t even been monitored for a year,” she said.\n\nHaving worked with symptomatic patients, Ms. Kellogg has seen up close how bad the illness can get, especially in patients with serious underlying health issues. When asked whether seeing patients in that condition made her question her hesitancy, she said:\n\nI see patients who get in car accidents, but I still have to drive, so I wear my seatbelt. I see patients who have heart disease, but I still get fast food, so I try to exercise more. I can’t justify getting this brand-new vaccine out of fear alone, especially when the long-term side effects could be horrendous. We just don’t know yet. So, until then I’ll wear my mask and use good hand hygiene, just like everybody else.\n\nOf Ms. Kellogg’s three daughters, her eldest is a certified medical technician at a senior living facility who says she will also wait until more is known of the vaccine. Kellogg’s 15-year-old daughter contracted the virus in October 2020. She began showing symptoms quickly and tested positive through a PCR (polymerase chain reaction) test. The family’s fear was palpable, as she was considered high risk due to a rare congenital heart condition. Fortunately, the girl made a full recovery after isolating on the third floor of their family home. It is still unknown whether she will have lasting complications. Kellogg said, “Two days before she tested positive, her throat hurt, so like any nurse mom I told her to open her mouth and say, ‘Ahh.’ I was right there in her face, her breath so close I could feel it, and yet somehow, I still didn’t contract the virus then. The human body is capable of fighting some pretty wild battles, and I’d rather face the knowns of Covid than the unknowns of the vaccine.” When asked whether she will get the shot eventually, she said, “I assume it will be mandatory by next\n\nyear. I can’t say no if it means I’ll lose my job.”\n\nWe are living a scary pseudo-reality. Near centenarians don’t trust what they hear on the news and from their government, registered nurses may lose their employment if they cite their constitutional right to safeguard their own bodies and refuse to receive an unproven vaccine, and over two-thirds of Americans agree with one or both of them.", "opengraph": {}, "tags": ["Covid-19", "big pharma", "vaccines"], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "https://www.texemarrs.com/", "https://www.johnellis.com/wp-content/uploads/2019/05/Revelation_x264.mp4?_=1", "https://www.nldbc.com/Millennium", "https://afpstore.americanfreepress.net/product/nourishing-diets-paleo-ancestral-and-traditional-peoples-really-ate/", "#", "#", "#", "#"], "authors": [], "publish_date": null}