{"result_id": "023017", "URL": "https://americanfreepress.net/dershowitz-you-cant-refuse-state-ordered-vaccinations/", "timestamp": "2023-04-25 12:00:39 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2017/03/cropped-AFP_Site_Icon3-32x32.jpg", "canonical": "https://americanfreepress.net/dershowitz-you-cant-refuse-state-ordered-vaccinations/", "encoding": "UTF-8"}, "image": null, "domain": "americanfreepress.net", "title": "Dershowitz: You Can’t Refuse State-Ordered Vaccinations – American Free Press", "cleaned_text": "In this front-page story in Issue 23&24 of American Free Press, online now for digital subscribers and in the mail to print subscribers, AFP reveals the position of well-known attorney Alan Dershowitz on whether police-state powers extend to forced innoculations or the 14th Amendment will protect those who choose to say no to a vaccine.\n\nConstitutional scholars have long argued that the 14th Amendment protects everyday Americans against the encroaching police state, noting in the provision that no state “shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States; nor shall any state deprive any person of life, liberty, or property, without due process of law.”\n\nIn a recent interview, however, 81-year-old Alan Dershowitz argues that even the 14th Amendment will not protect you when, in the not-too-distant future, states mandate that all citizens will have to be inoculated with a SARS-CoV-2 vaccine.\n\nNot too long ago, while representing President Donald Trump at his impeachment hearings, the traditionally leftist professor and pro-Israel attorney was the new darling of the right. Not anymore.\n\n“You have no right not to be vaccinated, you have no right not to wear a mask, you have no right to open up your business,” the Harvard Law School emeritus professor told interviewer Jason Goodman with “Crowdsource the Truth” in a video interview released on May 17.\n\nDershowitz added that someone can refuse treatment if they are threatened with a disease that is not contagious. “But you have no right to refuse to be vaccinated against a contagious disease,” he added. “Public health—the police power of the Constitution—gives the state the power to compel that.”\n\nIn other words, claims Dershowitz, the state has the power to hold you down, forcibly stick a needle in your arm, and inject you with a vaccine even if you don’t want it.\n\nThe professor cited an ancient Supreme Court case from 1905, Jacobson v. Massachusetts, which concluded that a state may require vaccination (in this case against smallpox) if a state board of health deems it necessary for public health or safety. One of the lines from that case ruling says, “It is within the police power of a state to enact a compulsory vaccination law, and it is for the legislature, and not for the courts, to determine.”\n\nIn a nutshell, the justices ruled that, in the case of any allegedly virulent, highly infectious, possibly deadly diseases, if any adult individual is allowed to act “without regard to the welfare of others,” true liberty does not exist. Dershowitz added that this case has withstood over 100 years of challenges, and no court has ruled against it.\n\nHowever, Dershowitz did omit this part of the decision: “There being obvious reasons for such exception, the fact that children, under certain circumstances, are excepted from the operation of the law does not deny the equal protection of the laws to adults if the statute is applicable equally to all adults in like condition.”\n\nThus, will our children be exempt from forced vaccinations if states decide to exercise their “police powers” and demand we all be vaccinated—or fined, jailed or otherwise punished if we do not? While a majority of American adults are willing to voluntarily be vaccinated against illnesses, it is a completely different matter if the state demands we submit ourselves to a mandatory vaccination or if the state decides to make health decisions for our children without our consent.\n\nEither way, a battle is brewing.", "opengraph": {}, "tags": ["Coronavirus", "tyranny", "Covid-19", "medical tyranny", "police state", "Dershowitz"], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "https://afpstore.americanfreepress.net/product-category/subscribe/", "https://afpstore.americanfreepress.net/product-category/subscribe/", "https://afpstore.americanfreepress.net/product-category/subscribe/", "https://afpstore.americanfreepress.net/product/most-dangerous-man-in-the-world-julian-assange/", "https://freeexpressionfoundation.org/", "#", "#", "#", "#"], "authors": [], "publish_date": null}