{"result_id": "023024", "URL": "https://americanfreepress.net/the-truth-illegal-immigration-is-not-helping-covid-spread/", "timestamp": "2023-04-25 12:00:48 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2017/03/cropped-AFP_Site_Icon3-32x32.jpg", "canonical": "https://americanfreepress.net/the-truth-illegal-immigration-is-not-helping-covid-spread/", "encoding": "UTF-8"}, "image": null, "domain": "americanfreepress.net", "title": "The Truth: Illegal Immigration Is Worsening Covid Spread – American Free Press", "cleaned_text": "As the Biden administration and mass media continue to feverishly hype the dangers of the Covid-19 pandemic, hinting at the introduction of vaccine mandates, more potential lockdowns, and other tyrannical measures, thousands of unscreened, largely unvaccinated migrants continue to pour across the southern border, both illegally and legally. This raises health and safety concerns as it has been shown that unknown numbers are ill with Covid and possibly other serious illnesses and are being released into the unsuspecting American public.\n\nIn late July, the La Joya Police Department in southern Texas issued a statement explaining that its officers had encountered a family of migrants who “had been apprehended by Border Patrol days prior and were released because they were sick with Covid-19,” according to the press release. The family told officers they had been staying at a local hotel with the assistance of Catholic Charities of the Rio Grande Valley, one of a number of misguided organizations that works directly with the U.S. federal government in facilitating the invasion of America.\n\nJudge Richard Cortez, a Hidalgo County judge in Texas, issued a scathing statement in response, insisting that “federal immigration officials stop releasing infected migrants into our community” and calling on Texas Gov. Greg Abbott to “return to Hidalgo County the safety tools taken away that would help us slow the spread of this disease.”\n\nEarlier this week, Biden administration officials announced plans to require overseas visitors to the U.S. to be fully vaccinated in order to enter the country. Meanwhile, unskilled, unvaccinated migrants from Mexico, Central and South America, and the Caribbean line up in droves at various ports of entry along the U.S.-Mexico border, sometimes waiting for a long time to be processed by border officials and then released into the country. Others continue to cross the border illegally, often facilitated by criminal cartels. In early August, at least 10 migrants died after a van transporting 25 migrant workers flipped over in Brooks County in southern Texas.\n\nImages at the border, which are increasingly rare as the mass media runs cover for the Biden administration’s disastrous border policy and his failure to enforce basic immigration laws, have shocked the nation as politicians, media pundits, and other high-profile figures hysterically hype the -Covid-19 pandemic as if it were the Bubonic plague. Thousands of migrants, including families and young children, stand shoulder-to-shoulder in long lines waiting to make contact with border officials.\n\nRepublican governors, including Abbott and Florida’s Ron DeSantis, have argued that the Biden administration is facilitating the invasion while helping to spread Covid-19 in the midst of a new outbreak.\n\nThe Biden administration has “imported more virus from around the world by having a wide open southern border,” DeSantis recently stated. “You have hundreds of thousands of people pouring across—and it’s not just from Mexico—you have over 100 different countries where people are pouring through. So, he’s not shutting down the virus, he’s helping to facilitate it in our country.”\n\nDeSantis has also made clear that his state will not enforce vaccine mandates that Biden administration officials and other political leaders across the country continue to vigorously promote. Ultimately it should be an individual’s right to make his own health decisions. Abbott has also taken aim at the Biden administration, insisting that his team is helping prolong the Covid-19 pandemic for political purposes—hoping for a return to the “lock-down election” that helped the Democrats defeat Donald Trump in 2020—with it’s carefully considered open borders policies.\n\n“While the Biden administration is openly pondering looming shutdowns and mandates on U.S. citizens to control the spread of Covid-19, at the same time, the administration is knowingly worsening the problem by importing Covid-19 at extreme rates,” Abbott recently declared.\n\nWhile Biden and crew continue to insist that it is unvaccinated white, conservative “deplorables” who are driving the increase in Covid cases, the fact is that Covid-positive immigrants and the black community (both of which traditionally vote Democrat) are a real problem for Biden.\n\nCurrently, many in the black community have been reluctant to receive the vaccine. African-Americans currently have a vaccination rate of 25%. American Indians actually have the highest vaccination rates, followed by Asians, whites and Hispan­ics. Additionally, black people have accounted for an increasing proportion of Covid-19 cases and deaths in places such as Washington, D.C., “where government data indicate they’ve made up nearly eight in 10 new cases and close to 90% of deaths since May 1,” according to Politico.\n\nBiden’s messaging to his black constituency is failing at the same time his open-border policy is spreading infected migrants across America. This is Biden’s epidemic now.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "https://afpstore.americanfreepress.net/product/print-news-matters-1-year-print-subscription-u-s-only/", "https://afpstore.americanfreepress.net/product/open-borders-inc-whos-funding-americas-destruction/", "https://johnellis.com/", "https://www.beatirs.com/", "#", "#", "#", "#"], "authors": [], "publish_date": null}