{"result_id": "023015", "URL": "https://www.americanfreepress.net/html/forced_vaccinations_196.html", "timestamp": "2023-04-25 12:00:37 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.americanfreepress.net/html/forced_vaccinations_196.html", "encoding": "ISO-8859-1"}, "image": null, "domain": "www.americanfreepress.net", "title": "Forced Vaccinations 196", "cleaned_text": "A number of “stop the vax” efforts are taking place across America amid persistent warnings of a possible mandated “swine flu” mass vaccination of the populace, with alternative and mainstream news reports ranging from ominous scenarios of a deliberately created pandemic and planned large-scale crippling and killing of the population on the one extreme, to casual “the shots are available if you want them” reports on the other extreme.\n\n\n\nMilitary exercises are even cited as possible dress rehearsals for gunpoint vaccinations and quarantines. \n\n\n\nYet, other sources suggest a lot more normalcy: one Midwestern daily newspaper noted that those catching the “swine flu” should just stay home at least 24 hours “after fever breaks,” implying that it’s unlikely this flu will kill anyone. Precautions for those who are still well are simply to wash your hands often with soap or sanitizer for “at least 20 seconds.”\n\n\n\nIn this age of hard-hitting news on the Internet that feeble mainstream sources will not report—but with the potential for falsehoods, exaggerations and deliberately planted urban legends also present on the Internet—it’s no easy task to say with certainty just how hard county, state, U.S. and global H1N1/swine flu shot advocates will push to vaccinate the greater population in the coming weeks. Yet, the bottom line is that more and more people will not take the shot.\n\n\n\nConsidering the known dangers of adjuvants and other highly suspect ingredients in modern vaccines, refusing the shot itself and avoiding any kind of nasal vaccine in spray form seem to be the only sensible course—no matter what plot is brewing. The best vaccination is no vaccination.\n\n\n\n \n\nNews reports appeared October 6 showing health care workers in Indiana, Illinois and Tennessee taking the nasal vaccine, FluMist, like willing sheep. Indeed, what is just as disturbing as government medical tyranny is the servility of Americans, particularly health care workers, to blindly accept the H1N1 nasal spray vaccine, amid troubling allegations that the spray—which is heavy with live viruses—could enable the viruses to incubate in the nasal tissue and then be released into the air by sneezing. This spreads the virus, possibly starting the very pandemic that thus far has not materialized, contrary to World Health Organization claims.\n\n\n\nNo matter what, Americans must refuse the H1N1 vaccine in needle and nasal form. But Americans must go beyond that and change every law in every state and at the national level that requires vaccinations.\n\n\n\nAmericans can force authorities at all levels and the profit-seeking drug companies that make these vaccinations to back down in a major way, and to “clean house” regarding any current or future attempts by megalomaniacs and mindless believers in all aspects of modern medicine to imperil the fabric of society with sordid medical schemes.\n\n\n\nThere are a number of good signs of much-needed resistance out there. New York healthcare workers held a morning rally at the state capitol in Albany September 29 “to protest the new regulations mandating that all healthcare workers with patient contact receive all CDC ‘recommended’ flu vaccines… including the just licensed, un-safety-tested ‘swine flu’ 2009 ‘H1N1-A.’\n\n\n\nMembers of [Ron Paul’s] Campaign for Liberty are taking an active role in this rally,” as noted in a news bulletin posted at HealthFreedomUSA.org.\n\n\n\nSo, in the short term we must greet “the shot” and “the spray” with bald-faced refusal and press on to expose the vast medical fraud that is our current system.\n\n\n\nRemember, the clamor for national healthcare is about giving Big Medicine even more money and covering only conventional medical treatments.\n\n\n\nCall and write your local and state health departments, local media and state representatives, contact the U.S. Department of Health and Human Services and the Centers for Disease Control, and annoy your member of Congress and your U.S. senators about this H1N1 “swine flu” situation. Make it known that the vaccine is not needed and is unacceptable in any form under any pretense.\n\n\n\nMark Anderson is a longtime newsman now working as a corresponding editor for American Free Press. Together he and his wife Angie provide many photographs of the events they cover for AFP. Mark welcomes your comments and inputs as well as story leads. Email him at at . Subscribe to American Free Press. Online subscriptions: One year of weekly editions—$15 plus you get a BONUS ELECTRONIC BOOK - HIGH PRIESTS OF WAR - By Michael Piper.\n\n\n\nPrint subscriptions: 52 issues crammed into 47 weeks of the year plus six free issues of Whole Body Health: $59 Order on this website or call toll free 1-888-699-NEWS . \n\n\n\nSign up for our free e-newsletter here - get a free gift just for signing up! Not Copyrighted. Readers can reprint and are free to redistribute - as long as full credit is given to American Free Press - 645 Pennsylvania Avenue SE, Suite 100 Washington, D.C. 20003", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["../html/readership.html", "../html/hot_news.html", "http://www.youtube.com/afpsupporter", "http://www.uncivilliberties.com/buy.php", "http://www.InstituteForTruthStudies.com", "http://www.johnellis.com", "http://www.takebackcontrol.us", "http://www.deep6spray.com", "http://www.americanfreepress.net/rss/afp.xml", "http://www.americanfreepress.net/html/email_newsletter.html", "http://HealthFreedomUSA.org", "/cdn-cgi/l/email-protection#3e4a4c4b4a5656514b505a0c7e475f565151105d5153", "http://www.americanfreepress.net/html/online_edition.html", "http://shop.americanfreepress.net/store/c/11-Subscribe.aspx", "http://shop.americanfreepress.net/store/c/11-Subscribe.aspx", "http://www.americanfreepress.net/html/email_newsletter.html", "http://www.referralblast.com/rblast.asp?sid=7918", "http://www.americanfreepress.net/Agora/agora.cgi?cart_id=%%cart_id%%&keywords=make%20%20donation", "http://www.referralblast.com/rblast.asp?sid=7918", "http://www.intcurrency.com/", "http://www.freeinvestingreports.com/ea/dr/afp060809ohsqa", "http://valtorta.org/", "http://stores.lulu.com/brandywinehouse", "http://www.HowToGetFreeSilverDollars.com", "https://reports.agorafinancial.com/LIRBailoutLoopholePOP10/LLIRKA03/landing.html", "http://www.scripturesforamerica.org/"], "authors": [], "publish_date": null}