{"result_id": "023035", "URL": "https://americanfreepress.net/power-actions-of-cdc-challenged/", "timestamp": "2023-04-25 12:01:00 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2017/03/cropped-AFP_Site_Icon3-32x32.jpg", "canonical": "https://americanfreepress.net/power-actions-of-cdc-challenged/", "encoding": "UTF-8"}, "image": null, "domain": "americanfreepress.net", "title": "Power, Actions of CDC Challenged – American Free Press", "cleaned_text": "Sen. Ron Johnson (R-Wisc.) has been demanding answers from federal health wonks whose silence is approaching pandemic proportions. The two-term senior senator from the Badger State recently sent separate letters to Centers for Disease Control and Prevention (CDC) Director Rochelle Walensky “requesting information about whether the agency performed sufficient surveillance of Covid-19 vaccine adverse events” and inquiring why the CDC spent almost half a million tax dollars to track millions of Americans.\n\n“A recent article noted that [the] CDC did not compile all of the data on vaccine adverse events it initially claimed it would,” Johnson wrote in a June 27, 2022, letter to Walensky.\n\nVAERS refers to the federal program where healthcare workers can report suspected adverse events from vaccinations, though these are rarely followed-up on and confirmed by health authorities.\n\nAccording to Johnson, the CDC “reportedly failed to provide these tables and other surveillance data in response to a Freedom of Information Act (FOIA) request,” even while the CDC oddly claimed, “no information was withheld from [the FOIA] release.”\n\nJohnson shot back: “This raises questions about whether [the] CDC ever collected the information on vaccine safety it originally claimed it would in the Jan. 2021 SOP.”\n\nFurthermore, the senator called on the agency to “explain why, and detail who, made the decision to not follow the SOP and when that decision was made,” according to Johnson’s office.\n\nIn his other letter, dated May 5, Johnson queried Walensky about the agency’s “reported use of location data to monitor Americans during the Covid-19 pandemic.”\n\nAccording to a recent report by “VICE,” an alternative media platform, which includes firsthand CDC data as a source, the CDC paid one company $420,000 to access location data “from at least 20 million active cellphone users per day” to examine Americans’ activities in schools, places of worship, parks, grocery stores, and public transit stations, as Johnson related in his letter.\n\nIt remains unclear why the CDC tracked millions of Americans during the pandemic and whether it continues to do so. The CDC “should have been prioritizing the development of treatments, effective testing, and vaccine safety rather than tracking Americans’ daily lives,” Johnson wrote.\n\nAs discussed during an Oct. 22, 2020, teleconference on vaccine surveillance systems, “a CDC official noted that [the] CDC and [the] FDA planned to use VAERS to conduct data mining … every one to two weeks,” Johnson’s letter noted. That official praised VAERS, stating that it can “rapidly detect safety signals and can detect rare adverse events,” Johnson noted, adding:\n\nAccording to the independent website OpenVAERS.com, based on federal Health and Human Services data, there had been 29,162 “vaccine reported deaths” just in the U.S. through June 24, along with 2,191,497 reported adverse vaccine effects and 165,213 total reported Covid-19 vaccine-related hospitalizations in the U.S.\n\nHowever, relatively small percentages of patients and doctors, if they’re aware of VAERS at all, take the time to report vaccine reactions, actual or suspected, in the first place.\n\nMeanwhile, in the immediate wake of Pfizer/BioNTech receiving the dubious permission of the FDA to include babies, toddlers, and children, ages 6 months to four years, in the Covid-19 vaccination campaign, the Crimes Against Humanity Tour USA, whose organizers are seeking justice about Covid-related crimes, is growing. At press time, the traveling conference had visited seven cities: Los Angeles May 1, Chicago May 8, Phoe­nix May 14, Houston May 21, Minneapolis May 28, Dallas June 11, and Tampa July 2, with additional planned visits to Sacramento July 16 and Utah July 30.\n\nThe conference, organized in part by noted German lawyer and vaccine industry critic Reiner Fuellmich, posted this online statement:\n\nWe have made significant progress thus far … to lodge the first criminal case that will result in a grand jury being assembled to investigate the vast amount of evidence to indict various individuals responsible for crimes against humanity. All other cases lodged thus far are civil cases that have little chance of success… Only a criminal case will bring the result we all hope to see, which is the halting of the jab campaign and bringing those involved … to justice.\n\nFuellmich, Dr. Richard M. Fleming and Dr. Judy Mikovits have been among those making on-stage appearances along the tour, which constitutes “a cross examination of the global pandemic, the global reset, and humanity’s path to a Great Awakening,” organizers say.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "https://americanfreepress.net/afpaudio/29_30_Audio/09_29_30_CDC_Anderson.mp3", "https://afpstore.americanfreepress.net/product/1-year-digital-subscription/", "https://www.beatirs.com/", "https://johnellis.com/", "https://afpstore.americanfreepress.net/product/faucian-bargain/", "https://afpstore.americanfreepress.net/product/the-real-anthony-fauci/", "#", "#", "#", "#"], "authors": [], "publish_date": null}