{"result_id": "023029", "URL": "https://americanfreepress.net/bill-gatess-global-vaccine-plan/", "timestamp": "2023-04-25 12:00:54 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2017/03/cropped-AFP_Site_Icon3-32x32.jpg", "canonical": "https://americanfreepress.net/bill-gatess-global-vaccine-plan/", "encoding": "UTF-8"}, "image": null, "domain": "americanfreepress.net", "title": "Bill Gates’s Global Vaccine Plan – American Free Press", "cleaned_text": "Billionaire says he would like to vaccinate, track every single person on the planet.\n\nWhatever fantastic and fatalistic vision billionaire Bill Gates had for America and the world, his recent appearances in the mainstream media have illustrated that his visions for world health crises are coming true. It is now also apparent that Gates intends to be fully engaged in the management of these crises and their responses. As recently as April 16, Sen. Lindsey Graham (R-S.C.) endorsed Gates to be the head of the World Health Organization (WHO). “I would double WHO funding if Bill Gates led the organization,” Graham said.\n\nPoliticians have always genuflected to the millionaire and billionaire classes as the most elite amongst them have always shown an interest in global issues. Bill Gates has shown the motivation, will, and financial determination to make an impact. Gates, however, has a questionable past regarding his obsession with public health, and that’s why any movement Gates makes amidst a world health crisis should be carefully monitored.\n\nWe should first question the goals of Bill and Melinda Gates’s work in the field of public health. One goal, stated by Gates in multiple media arenas is to “reduce population growth.” He is careful to never say “de-populize” or “reduce population.” Oddly, he often discusses reducing population growth when he is touting his love affair with vaccinations. The two, to Gates, appear to go hand-in-hand.\n\nAt a Technology, Entertainment and Design (TED) Talk in February 2010, Gates said: “First, we’ve got population. The world today has 6.8 billion people. That’s headed up to about nine billion. Now, if we do a really great job on new vaccines, healthcare, reproductive health services, we could lower that by, perhaps, 10% or 15%.”\n\nIn conjunction with the Rockefeller Foundation, Gates introduced the ambitious ID2020 initiative at a conference in 2016. The idea was to identify, officially, the more than 1 billion people around the world who do not have government-issued identifications. Of course, these IDs would be digital. The Windows Central website described the purpose of ID2020 as being about inclusion. “Participation in the modern economy, the ability to buy and sell, attain employment, healthcare, social services and more are virtually impossible without a digital identity.” And that is certainly true. If you had a goal of tracking vaccinations globally, digital identification would be vital to your success. It is also ironic that the predictive roll-out year attached to the program is 2020, the year of Covid-19.\n\n“Vaccine tracking” has been a major challenge for supporters of mass vaccinations, like Gates. A study done by Science Translational Medicine found that in low-resource centers (poorer countries) around the world, where “well-maintained centralized databases do not exist,” a lack of vaccine tracking “contributes to 1.5 million vaccine- preventable deaths annually.” The great hope for scientists is an invisible, embeddable medical record that could be activated when a vaccine is given.\n\nIt was Dr. Anthony Fauci who, in 2017, predicted that the Trump administration would have to deal with a health crisis. “There is no question that there will be a challenge to the coming administration in the arena of infectious diseases,” Fauci said. Fauci and Gates have a long history, but, in short, Fauci and Dr. Richard D. Klausner headed the Vaccine Research Center, a vaccination advocacy program. Klausner also served as senior fellow and special adviser to the presidents of the National Academies for Counter Terrorism, an odd choice for a specialist in vaccinations. In 2002, Klausner was named the executive director of the Bill & Melinda Gates Foundation’s global health program.\n\nGates now funds over 10% of the World Health Organization’s budget. While that may seem generously philanthropic, there is a danger in power tilting into the hands of an international organization that has no accountability to any official or body. Yes, the WHO is a specialized agency of the United Nations, but when the agency’s primary donor is an American billionaire and the UN is financed largely by the American government, there is little to no international control for the agency, which is headquartered in Geneva, Switzerland. In fact, it is easier for Gates to work through the WHO than it would be for him to work for an American governmental organization or department. At the WHO, his money is a lifeblood and there is no fear of congressional oversight.\n\nGates is dangerous when it comes to world health crises. He has access to the kind of funding that can move nations to follow the directives and goals of the financier. In the words of songwriter Randy Newman, “It’s money that matters.” However, this time, it could be lethal.\n\nS.T. Patrick holds degrees in both journalism and social studies education. He spent 10 years as an educator and now hosts the “Midnight Writer News Show.” His email is [email protected] He is also an occasional contributor to TBR history magazine and the current managing editor of Deep Truth Journal (DTJ), a new conspiracy-focused publication available from the AFP Online Store.", "opengraph": {}, "tags": ["WHO", "vaccinations", "Bill Gates"], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "http://www.kingidentity.com", "https://www.texemarrs.com/", "https://afpstore.americanfreepress.net/product/undoctored-why-health-care-has-failed-you-and-how-you-can-become-smarter-than-your-doctor/", "/cdn-cgi/l/email-protection", "https://afpstore.americanfreepress.net/product/deep-truth-journal-a-journal-of-deep-political-historical-research/", "#", "#", "#", "#"], "authors": [], "publish_date": null}