{"result_id": "023049", "URL": "https://americanfreepress.net/virus-viceroy/", "timestamp": "2023-04-25 12:01:16 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2017/03/cropped-AFP_Site_Icon3-32x32.jpg", "canonical": "https://americanfreepress.net/virus-viceroy/", "encoding": "UTF-8"}, "image": null, "domain": "americanfreepress.net", "title": "Virus Viceroy – American Free Press", "cleaned_text": "Is Bill Gates the most powerful global health voice?\n\nBill Gates, the billionaire tech mogul turned leading advocate for global public health meddling, has come under scrutiny in recent weeks for his promotion of possible mandatory vaccines and other stern measures to combat the Covid-19 viral outbreak.\n\nThe co-founder of Microsoft and one of the world’s wealthiest individuals (estimated net worth $102 billion), Gates became a leading figure in the philanthropic community after establishing the Bill and Melinda Gates Foundation (BMGF) in 2000,. BMGF is dedicated to “sustainable development and global public health advocacy,” agendas long criticized as promoting technocratic rule and global governance under the guise of “social conscience.”\n\nGates is also a major donor to various global health causes and organizations, such as the World Health Organization (WHO). Following President Donald Trump’s announcement that the U.S. will temporarily halt funding to the WHO, Gates became the organization’s single largest donor, funding roughly 10% of the globalist group’s budget. On several occasions, the WHO has bowed to Gates’s wishes for fear of losing that funding. Currently, Gates and his foundation have shifted their focus to combating the Covid-19 outbreak.\n\n“We’ve taken an organization that was focused on HIV and malaria and polio eradication, and almost entirely shifted it to work on [Covid-19],” Gates stated recently. “This has the foundation’s total attention.”\n\nIn the wake of the spread of Covid-19, Gates has been a regular talking head on mainstream television, advising the U.S. government and average citizens on what steps should be taken to combat the virus and the stages in which the economy could be opened up again. Viewed and presented erroneously as a public health expert, Gates has been instrumental in promoting fear about the pandemic, arguing that a vaccine is necessary in order to fully reopen the country. He stands to make a pretty penny from that vaccine should it ever materialize. And there are concerns— as there are with many vaccines— that a forced vaccination program in the U.S., Asia, Europe or in poverty-stricken areas of the globe could result in negative, serious side effects like those that occurred from the swine flu vaccine in which a small number of recipients developed Guillain-Barré syndrome, a rare but fatal autoimmune disease.\n\n“The eventual end comes when we get a vaccine that protects all of us—not just in the U.S. but the entire world,” Gates stated in a video interview he conducted in partnership with One World: Together At Home, a globalist propaganda campaign that aired in mid-April. “We need to make sure [the vaccine] gets out to everyone in the world,” he warned.\n\nMany are becoming increasingly skeptical of Gates and his promotion of vaccines and global health initiatives. Robert F. Kennedy Jr., a long-time critic of forced vaccinations, recently argued that Gates’s vaccine agenda represents “a strategic philanthropy that feeds his many vaccine-related businesses and gives him dictatorial control over global health policy—the spear tip of corporate neo-liberalism.”\n\nKennedy writes, “In addition to using his philanthropy to control WHO, UNICEF, GAVI (Global Alliance for Vaccines and Immunization) and PATH (another Gates-affiliated health nonprofit), Gates funds private pharmaceutical companies that manufacture vaccines, and a massive network of pharmaceutical industry front groups that broadcast deceptive propaganda, develop fraudulent studies, conduct surveillance and psychological operations against vaccine hesitancy and use Gates’s power and money to silence dissent and coerce compliance.”\n\nThus, two questions: Do we trust Bill Gates with our health? Will we have the right to resist being vaccinated if this “Virus Viceroy” decides that mandatory vaccinations are in the best interests of every person on the planet?", "opengraph": {}, "tags": ["Coronavirus", "WHO", "Bill Gates"], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "https://afpstore.americanfreepress.net/product-category/subscribe/", "https://afpstore.americanfreepress.net/product/profiles-in-corruption-abuse-of-power-by-americas-progressive-elite/", "#", "#", "#", "#"], "authors": [], "publish_date": null}