{"result_id": "023022", "URL": "https://americanfreepress.net/massive-increase-in-death-rate-goes-under-reported-by-media/", "timestamp": "2023-04-25 12:00:46 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2017/03/cropped-AFP_Site_Icon3-32x32.jpg", "canonical": "https://americanfreepress.net/massive-increase-in-death-rate-goes-under-reported-by-media/", "encoding": "UTF-8"}, "image": null, "domain": "americanfreepress.net", "title": "Massive Increase in Death Rate Goes Under-Reported by Media – American Free Press", "cleaned_text": "Recent reports from insurance companies indicate an alarming increase in the death rate among those aged 18-64 in this country. Deaths in that huge age group rose an astonishing 40% during the last half of 2021. And, yet, aside from some references on Tucker Carlson’s show, this unprecedented story has been ignored by the mainstream media.\n\n“We’re seeing right now the highest death rates we’ve ever seen in the history of this business,” Scott Davison, the CEO of OneAmerica, an Indiana-based life insurance company, stated. “The data is consistent across every player in the business.” Davison went on to say, “Just to give you an idea of how bad that is, a ‘three sigma’ or 200-year catastrophe would be a 10% increase over pre-pandemic levels. So, 40% is just unheard of.”\n\nDavison predictably attributed the increase largely to the unvaccinated.\n\n“It may not all be Covid on their death certificates, but deaths are up in just huge, huge numbers,” Davidson declared. While the mainstream media continues to stifle any mention of the untold number of deaths and serious injuries possibly related to the Operation Warp Speed vaccine, their own fanciful figures of official Covid deaths, even as wildly inflated as they are, cannot come close to explaining such a massive death increase. While still effectively fingering Covid as the culprit, Davison acknowledged that “most of the claims for deaths being filed are not classified as Covid-19 deaths.”\n\nThe Centers for Disease Control (CDC), which notably sent a directive to all hospitals in April 2020 instructing them to list patients’ cause of death as Covid even when they hadn’t been tested, is naturally trying to tie the glaring increase in numbers directly and indirectly to the virus. The CDC estimates that, since Feb. 1, 2020, there have been 942,431 excess deaths in the U.S. These are by far the highest death rates that veterans in the insurance business have ever seen. The corrupt National Cancer Institute (NCI) echoed the establishment narrative, claiming that, of the approximate 2.9 million Americans who died between March and December 31, 2020, 74% were due to Covid.\n\n“It is possible that fear of seeking out healthcare during the pandemic or misattribution of causes of death from Covid-19 are responsible for a majority of the excess non-Covid-19 deaths,” explained Meredith S. Sheils, senior investigator in the Infections and Immunoepidemiology Branch of the NCI.\n\nDr. Robert Malone, one of the renegades in the medical industry who isn’t buying the Covid narrative, called the news “a nuclear truth bomb masquerading as an insurance agent’s dry manila envelope full of actuarial tables.” Malone actually mentioned the Great Reset publicly postulated by Klaus Schwab and the World Economic Forum. As many in the conspiracy world have long noted, our largely eugenicist leaders appear to be passionately committed to a depopulation agenda. A 40% increase in deaths certainly fits the definition of depopulation.\n\nAt a minimum, based on my reading, one has to conclude that if this report holds and is confirmed by others in the dry world of life insurance actuaries, we have both a huge human tragedy and a profound public policy failure of the U.S. Government and U.S. HHS system to serve and protect the citizens that pay for this service. If this holds true, then the genetic vaccines so aggressively promoted have failed, and the clear federal campaign to prevent early treatment with lifesaving drugs has contributed to a massive, avoidable loss of life.\n\nMalone bemoaned the “massive loss of life in (presumably) workers that have been forced to accept a toxic vaccine at higher frequency relative to the general population.”\n\nAs if this wasn’t shocking enough, former BlackRock portfolio manager Edward Dowd proclaimed that CDC data show that millennials in particular suffered a “Vietnam War event” during the second half of 2021. Americans aged 25-40 experienced a mind-blowing increase in mortality of 84% last fall. Dowd termed it the “worst-ever excess mortality . . . in history.”\n\nThis was seven times higher than the excess mortality in those aged 85 and older, supposedly the most vulnerable to Covid-19. Dowd called the lower but still substantial excess among Baby Boomers as “a World War II event.” Unlike Davison, NCI and CDC, Dowd attributed the deaths to vaccine mandates and booster shots. Dowd warned against thinking that “Pfizer and Moderna” stocks “are good buys.”", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "https://americanfreepress.net/afpaudio/15_16_Audio/14_15_16_Deaths_Jeffries.mp3", "https://www.dlionheart.com/post/the-great-american-die-off-is-underway", "https://afpstore.americanfreepress.net/product/the-real-anthony-fauci/", "https://johnellis.com/", "https://www.beatirs.com/", "#", "#", "#", "#"], "authors": [], "publish_date": null}