{"result_id": "023001", "URL": "https://americanfreepress.net/rfk-jr-blasts-bill-gates-after-most-recent-kennedy-tragedy/", "timestamp": "2023-04-25 12:00:21 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2017/03/cropped-AFP_Site_Icon3-32x32.jpg", "canonical": "https://americanfreepress.net/rfk-jr-blasts-bill-gates-after-most-recent-kennedy-tragedy/", "encoding": "UTF-8"}, "image": null, "domain": "americanfreepress.net", "title": "RFK Jr. Blasts Bill Gates After Most Recent Kennedy Tragedy – American Free Press", "cleaned_text": "On April 2, 40-year-old Maeve McKean drowned in Maryland’s Chesapeake Bay, along with her eight-year-old son, Gideon. McKean was the granddaughter of former attorney general and U.S. Sen. Robert F. Kennedy. The circumstances of her death are puzzling. McKean supposedly took off in a canoe, and brought her young son with her, to retrieve a ball that had been kicked into the water. On this day, reports indicated that the water was even more turbulent than usual. Some thought it strange that anyone, let alone someone from such a wealthy family, would take a canoe out in such treacherous conditions in order to save an easily replaceable ball. But she did.\n\nOnline posters were quick to attribute the deaths to a combination of two oft-cited mainstream mythologies: the Kennedy “curse” and their alleged “recklessness.” What wasn’t noted as often was McKean’s very interesting job, especially given the present worldwide coronavirus crisis. McKean was the executive director of Georgetown University’s Global Health Initiative (GHI), connecting her to the man rapidly becoming the arch villain of our times, Bill Gates. The Bill and Melinda Gates Foundation funded GHI, a typically globalist endeavor.\n\nMcKean seems to have been steadfastly pro-vaccine and publicly denounced the controversial position of her uncle, Robert F. Kennedy Jr., several times. RFK Jr., however, reacted angrily in the wake of his niece’s death, taking to Instagram and launching a vicious attack on Gates. “Vaccines, for Bill Gates, are a strategic philanthropy,” Kennedy wrote, “that feed his many vaccine-related businesses (including Microsoft’s ambition to control a global vac ID enterprise) and give him dictatorial control over global health policy—the spear tip of corporate neo-imperialism.” RFK Jr. continued, “Gates’s obsession with vaccines seems fueled by a messianic conviction that he is ordained to save the world with technology and a god-like willingness to experiment with the lives of lesser humans.” Kennedy wrote this on April 8, not long after the bodies of his relatives had been found in the Chesapeake Bay. It is difficult not to connect the deaths and Kennedy’s powerful new public criticism of Gates.\n\nRFK Jr.’s April 8 Instagram post has to be seen to be believed. It’s as radical a demolition of Gates’s maniacal stance as any “conspiracy theorist” could conjure up. “Promising to eradicate polio with $1.2 billion, Gates took control of India’s National Advisory Board (NAB) and mandated 50 polio vaccines (up from five) to every child before age five,” Kennedy lashed out at one of the world’s richest people. “Indian doctors blame the Gates campaign for a devastating vaccine-strain polio epidemic that paralyzed 496,000 children…. In 2017, the Indian government dialed back Gates’s vaccine regimen and evicted Gates and his cronies from the NAB. Polio paralysis rates dropped precipitously. In 2017, the World Health Organization reluctantly admitted that the global polio explosion is predominantly a vaccine strain, meaning it is coming from Gates’s vaccine program.”\n\nKennedy also noted that, “In 2010, the Gates Foundation funded a trial of a GSK [Glaxo-SmithKline] experimental malaria vaccine, killing 151 African infants and causing serious adverse effect… to 1,048 of the 5,049 children [and] Gates operatives forcibly vaccinated thousands of African children against meningitis.” Diving fully into conspiratorial waters, Kennedy declared, “In 2010, Gates committed $10 billion to the WHO promising to reduce population, in part, through new vaccines. A month later Gates told a Ted Talk that new vaccines ‘could reduce population.’ ”\n\nRFK Jr. has been consistently attacking Gates ever since. On May 6, he wrote, “Bill Gates Wants to Chip Us and Not Only for Vaccines—for Surveillance and Transhumanism Using #5G.” Showing he is opposed to the lockdown, Kennedy continued, “I wrote last week about Malibu police’s ticketing Point Dume surfers $1,000 apiece for using the ocean during the quarantine. Was this merely an appalling police judgment at which we will laugh post-quarantine? Or does anyone else feel that this is the first wave of compliance and obedience training for something more permanent? Are powerful state and corporate entities using the current crisis to remove basic rights and intensify pressures to promote vaccines and surveillance? Does anyone else feel the suffocating darkness of tyranny descending on our nation? And finally, does anyone share my dread that Bill Gates—and his ‘Mini-Me’—Tony Fauci—will some how be running our Brave New World?”\n\nDonald Jeffries is a highly respected author and researcher whose work on the JFK, RFK and MLK assassinations and other high crimes of the Deep State has been read by millions of people across the world. Jeffries is also the author of three books currently being sold by the AFP Online Store.", "opengraph": {}, "tags": ["conspiracy theories", "RFK Jr.", "vaccinations", "Bill Gates"], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "https://www.amazon.com/Stretch-Texas-Ground-Jeff-Weber/dp/B07RP4C92H/ref=sr_1_fkmrnull_2?crid=2JOQQC9ZKFRAT&keywords=my+stretch+of+texas+ground&qid=1558243028&s=gateway&sprefix=My+Stretch+of,aps,167&sr=8-2-fkmrnull", "https://afpstore.americanfreepress.net/product/hit-list-an-in-depth-investigation-into-the-mysterious-deaths-of-witnesses-to-the-jfk-assassination/", "https://afpstore.americanfreepress.net/", "#", "#", "#", "#"], "authors": [], "publish_date": null}