{"result_id": "023012", "URL": "https://americanfreepress.net/fight-the-vaccine-madness/", "timestamp": "2023-04-25 12:00:33 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2017/03/cropped-AFP_Site_Icon3-32x32.jpg", "canonical": "https://americanfreepress.net/fight-the-vaccine-madness/", "encoding": "UTF-8"}, "image": null, "domain": "americanfreepress.net", "title": "Fight the Vaccine Madness – American Free Press", "cleaned_text": "\n• Time to fight back against mandatory requirements for vaccinations.\n\nThere is an agenda afoot to ensure that every child who attends public school receive vaccinations as a requirement for admission. At state and federal levels, pro-mandatory vaccine forces are on the offensive, closing loopholes and making it nearly impossible for parents to opt out and still have their children attend public schools.\n\nCalifornia is well on its way to eliminating personal and religious exemptions to vaccinations for those who attend public school. The state Senate recently passed S.B. 277, proposed by state Senator Richard Pan (D), a pediatrician. If the bill passes the California house and is signed by Governor Jerry Brown, California will join Mississippi and West Virginia, the only other states that do not allow personal or religious exemptions.\n\nCalifornia anti-vaccine activists received some compromise in the senate bill. The required number of vaccines is limited to 10, and students who opted for the personal exemption are grandfathered in. More than 13,000 children who have had no vaccinations by first grade won’t have to get their shots until they enter seventh grade. And nearly 10,000 seventh graders who today aren’t fully vaccinated may be able to avoid future shots because the state does not always require them after that grade.\n\nA law proposed on May 1 by Representative Frederica Wilson (D-Fla.), titled the “Vaccinate All Children Act of 2015,” would require students attending public schools to receive vaccinations with a limited exception. Wilson’s bill would permit the federal government to withdraw funding to schools as punishment for non-compliance.\n\nThe bill makes it extremely difficult, if not impossible, for a parent to have a child exempted from this federal mandate. In the exemption section of the proposed legislation, section 2(B) requires a physician to declare a student’s health “would be endangered” by a vaccine and 2(C) states the exception “demonstrating (to the satisfaction of the individual in charge of the health program at the student’s school) that the physician’s opinion conforms to the accepted standard of medical care.”\n\nEven if a concerned parent found a physician willing to state that a specific vaccine would “endanger” the student’s health, the act makes it clear that a school administrator has the power to decide whether the physician’s opinion “conforms to the accepted standard of medical care.”\n\nIt’s clear that part 2(C) is designed to thwart doctors who dare question vaccine orthodoxy. Good luck having a physician’s opinion preempt a school bureaucrat tethered to federal cash. Plus, there are no exceptions allowed on philosophical or religious grounds.\n\nIf you’re old enough to remember when you had a few vaccines and not much fuss was made of it, you probably aren’t aware of a major change in the law, which puts vaccine marketing and mandates into full-speed motion. A 1986 federal law preempted state and local subject matter jurisdiction regarding vaccine liability, creating “vaccine courts” to hear lawsuits against vaccine makers. Prior to the act, a vaccine case would be treated as any other tort or product liability case. In vaccine court, the statute of limitations is tight. No juries are allowed, and pretrial discovery is limited, unlike in regular cases. Vaccine courts have paid about $3 billion to victims from a fund that is financed by fees added to the cost of vaccines.\n\nSome would call this a racket. Big Pharma has near monopolistic market share, thanks to federal agency approvals. In the case of children, vaccines are coerced upon hapless parents by fright, and, to top it off, any side effects or adverse events are heard in a “special” court where damages are paid by a fund from taxes generated by vaccine sales. Is it any wonder the number of vaccinations given to Americans has blossomed, scaring the sanity out of parents and elderly to vaccinate cradle to grave?\n\nCritics of vaccination are few in number but resolute in facts that are hard to ignore.\n\nVaccines may contain live or inactivated viruses or bacteria, antibiotics and “other ingredients” such as mercury, aluminum, polysorbate 80, formaldehyde and other chemicals. They are injected into muscles, piercing the skin, unleashing lab-made compounds into the bloodstream on the theory that doing so will prevent one from catching a targeted disease.\n\nOne critic is Dr. Susanne Humphries, a nephrologist (kidney specialist) who observed patients experiencing kidney failure after receiving vaccines during the flu season. However, her observations went unheard at her hospital. Dr. Humphries boldly said: “There are no safe vaccines, there have never been safe vaccines, and never will there be a safe vaccine.”\n\nThe reason why, Dr. Humphries explains, is “the actual process of vaccination defies the natural function of the immune system.”\n\nDr. Humphries wryly noted how there’s “no nutritive effect of a vaccine,” meaning it’s not as if our bodies are in need of live or inactivated viruses or bacteria nor toxic chemicals to sustain life, let alone ward off disease. Risks of auto-immune disease, cancers and neurological disease exist from vaccines, according to Dr. Humphries.\n\nBut haven’t vaccines eradicated horrific diseases? Vaccination skeptics examined the evidence and found, in many instances, the claim that vaccines eliminated disease is false. Dr. Humphries notes that smallpox and tetanus vaccines, for instance, were implemented at the same time societies were adopting better sanitary, labor and dietary practices and that smallpox and tetanus were already in steep decline. The pro-vaccination scientists ignore other factors and preexisting decline that may better explain the reduction of these and other vaccine-related diseases.\n\nSame goes for polio. Dr. Humphries noted: “Unbeknownst to most doctors, the polio-vaccine history involves a massive public health service makeover during an era when a live, deadly strain of poliovirus infected the Salk polio vaccines and paralyzed hundreds of children and their contacts. These were the vaccines that were supposedly responsible for the decline in polio from 1955 to 1961. But there is a more sinister reason for the ‘decline’ in polio during those years. In 1955, a very creative re-definition of poliovirus infections was invented to ‘cover’ the fact that many cases of ‘polio’ paralysis had no poliovirus in their systems at all. . . . Now it is admitted in the medical literature that other viruses can cause polio, yet few people on the street have any idea.”\n\nEven pro-vaccine figures such as Dr. Mark R. Geier chafe at the sanctimonious attitude of vaccine advocates who chastise his honesty about the imperfections of vaccines. Dr. Geier said pro-vaccine extremists treat any criticism to a religious degree and chastise him for making public statements about vaccine flaws lest people lose faith in vaccination, but he is actually trying to bring problems to light to make better vaccines and even the most ardent anti-vaccine proponent should welcome his candor.\n\nDr. Geier is a strong proponent of the polio vaccine but finds the flu vaccine program flawed, noting that the Center for Disease Control and Prevention does not follow the law in this instance because there are no studies showing the safety of giving the vaccine yearly, and that the flu vaccine is essentially an experimental vaccine which is ineffective and causes Guillian-Barré Syndrome.\n\nHe stated the flu is “the wrong thing to vaccinate against” because it’s done every year, unlike diseases like smallpox and measles which are done once in childhood. Dr. Geier points the irony of spending billions of dollars on a vaccine may save few lives a year, noting other diseases should be targeted by vaccines. Remember, Dr. Geier is pro-vaccine.\n\nIn other words, the pat answer that vaccines are safe and effective and all critics are anti-science is a gross mischaracterization. So, too, is the idea that the unvaccinated spread disease.\n\nThe controversial measles vaccine is a live virus and is known to spread. “Numerous scientific studies indicate that children who receive a live virus vaccination can shed the disease and infect others for weeks or even months afterward.\n\nThus, parents who vaccinate their children can indeed put others at risk,” said Leslie Manookian, the activist who produced the documentary “The Greater Good.”\n\n“Vaccine failure and failure to acknowledge that live virus vaccines can spread disease have resulted in an increase in outbreaks of infectious disease in both vaccinated and unvaccinated individuals,” said Ms. Manookian, “CDC should instruct physicians who administer vaccinations to inform their patients about the risks posed to others by those who’ve been recently vaccinated.”\n\nThere have been credible reports of serious adverse effects from many different vaccines. Typically, 49 doses of vaccines before age six are given and 69 doses of 16 different vaccines by age 18, according to the National Vaccine Information Center. Reported side effects include high fever, skin rashes, high pitched screaming, collapse/shock, brain inflammation, seizure and other serious events, according to the CDC.\n• Could Common Herbicide Be Behind Autism Rise?\n• None The Electromagnetic Assault on Our Brains and Bodies\n• None Doctors Say Wireless Devices to Blame for Raft of Illnesses\n• Here’s Why People Should Be Suspicious of Big Pharma\n\nJames Spounias is the president of Carotec Inc., originally founded by renowned radio show host and alternative health expert Tom Valentine and his wife, Carole. To receive a free issue of Carotec Health Report—a monthly newsletter loaded with well-researched and reliable alternative health information—please write Carotec, P.O. Box 9919, Naples, FL 34101 or call 1-800-522-4279. Also included will be a list of the high-quality health supplements Carotec recommends.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "http://www.sacbee.com/news/politics-government/capitol-alert/article20999688.html", "http://wilson.house.gov/media-center/press-releases/congresswoman-frederica-s-wilson-introduces-legislation-to-require", "http://www.scribd.com/doc/265212985/H-R-2232-The-Vaccinate-All-Children-Act-of-2015", "http://en.wikipedia.org/wiki/National_Childhood_Vaccine_Injury_Act", "http://vaxtruth.org/2011/08/vaccine-ingredients", "https://www.youtube.com/watch?v=BpC0Tbb3diI", "http://www.vaccinationcouncil.org/2011/11/17/smoke-mirrors-and-the-disappearance-of-polio", "http://en.wikipedia.org/wiki/Mark_Geier", "http://en.wikipedia.org/wiki/Guillain%E2%80%93Barr%C3%A9_syndrome", "https://www.youtube.com/watch?v=aFPVviqOJ6Q", "http://www.greatergoodmovie.org", "http://www.vaccineriskawareness.com/Vaccine-Shedding", "http://www.nvic.org/CMSTemplates/NVIC/pdf/49-Doses-PosterB.pdf", "https://americanfreepress.net/?p=22494", "https://americanfreepress.net/?p=22663", "https://americanfreepress.net/?p=22954", "https://americanfreepress.net/?p=23254", "https://americanfreepress.net/?p=23476", "https://americanfreepress.net/?p=23884", "https://americanfreepress.net/?p=24079", "https://americanfreepress.net/?p=24483", "http://www.clixtrac.com/banner/click.php?banner=156365", "http://www.carotec.com", "#", "#", "#", "#"], "authors": [], "publish_date": null}