{"result_id": "023003", "URL": "https://americanfreepress.net/around-the-world-people-rise-up-against-tyranny/", "timestamp": "2023-04-25 12:00:24 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2017/03/cropped-AFP_Site_Icon3-32x32.jpg", "canonical": "https://americanfreepress.net/around-the-world-people-rise-up-against-tyranny/", "encoding": "UTF-8"}, "image": null, "domain": "americanfreepress.net", "title": "Around the World, People Rise Up Against Covid Tyranny – American Free Press", "cleaned_text": "Worldwide protests against vaccine mandates and passports, lockdowns, and other tyrannical measures implemented by various governmental organizations continue as concerned citizens and activists defiantly stand against their loss of freedom, basic human rights, and medical choice. In Europe and Australia, protests and rallies against vaccine mandates and other Covid-19 restrictions have been met with an increasingly brutal police response, with many activists and participants getting arrested, fined, and otherwise persecuted by law enforcement authorities for their activism.\n\nFrance and Germany had massive protests in major cities across the country during the last weekend in August, a continuation of rallies and protests that have been taking place for weeks now. In Germany, police attempted to ban a number of pre-planned demonstrations, a clear violation of freedom of assembly, free speech, and political protest rights, once the hallmark of Western civilization. Mass police mobilization was witnessed in major urban centers across Germany, as videos emerged on social media of heavy-handed and often violent police responses to protesters.\n\nProtests also continued across France, whose parliament has attempted to implement a vaccine passport law requiring businesses to check the vaccine status of patrons of restaurants, gyms, theaters and other public venues. Similar vaccine passport policies are currently being implemented by municipal governments in the United States, including New York City and San Francisco, while other metro areas and counties consider such measures.\n\nThe French have been particularly defiant, as countless citizens proudly boycott restaurants, bars, and other businesses attempting to comply with the central government’s overreaching vaccine passport policy. As one form of protest, French citizens have gathered in front of restaurants, cafes, bars, and other businesses that are enforcing the vaccine passport policy. They are bringing snacks, drinks, and meals and sitting in large groups outside the establishment to picnic with friends and family.\n\nFrench media and the country’s interior minister estimate that 160,000 people protested across the nation on Saturday, Aug. 28 in 222 separate protest actions. An estimated 14,500 protested in Paris alone. Many view the vaccine passport and lockdowns as entirely unnecessary, tyrannical, and a basic violation of human rights. “The vaccine isn’t the solution,” Helene Vierondeels, a retiree who attended a protest in Paris, told popular news outlet France24.\n\nOthers were upset with proposed vaccine mandates for school children and teachers. “We aren’t laboratory rats,” said one 11-year-old child in Bordeaux, referring to the Covid-19 vaccines that until recently have only been authorized under an emergency use authorization. Serious injuries, side effects, and even deaths have been reported from the vaccines, but, given the hundreds of millions of doses that have already been administered across the globe, they do remain rare.\n\n“We live in a free country, there are no figures that justify mass vaccinations,” the young boy’s father also noted.\n\nIn the United Kingdom, protests also continued, including one right outside a newly developed Covid vaccination center in Churchill Square, a large shopping mall in Brighton, England. Due to the protest, the vaccine center was forced to shut down, at least temporarily.\n\n“Our site will remain closed until at least 4:30 p.m. due to disruption,” the Sussex Community NHS stated. “Please do not attend appointments or walk-ins. We’re contacting people with booked appointments to rearrange.”\n\nAustralia, which has implemented arguably the most tyrannical and Orwellian Covid restrictions, has also witnessed a number of major protests, including an organized demonstration by truck drivers, recently. Australian police and political officials have enacted harsh measures against any form of protest or resistance to the lockdown agenda, including investigating and arresting individuals merely organizing public events online through social media sites.\n\nAnthony Khallouf, a 29-year-old activist and a self-described guerrilla journalist, recently had an appeal dismissed in Australia and has been ordered to serve a minimum three-month jail sentence for “breaches of public health orders,” according to Australian media. Khallouf has been a vocal and active organizer of protests and rallies in defiance of lockdowns and other draconian public health orders, and has been persecuted largely for encouraging others to protest and resist the governmental bullying being implemented in the name of Covid-19.\n\nThe pro-vaccine, pro-lockdown, pro-mask, pro-police state agenda shows no signs of abating, as virtually every major and minor political figure and media outlet parrot the same exact talking points, encouraging mass vaccination. Those who question the narrative or simply refuse to be vaccinated continue to be punished and shunned, regardless of their reasoning or circumstances. A judge in a recent child custody case in Chicago ordered that an unvaccinated mother could not see her child until she was vaccinated, demonstrating how out of control the vaccine pushers have become.\n\n“Judges in America are now revoking custody of children if parents aren’t vaxxed,” James Edwards, a popular talk radio host, Tweeted recently in response to the judge’s absurd order. “Thank God we live in a free country, though,” Edwards concluded sarcastically.\n\nAcross the Western world, globalist governments continue to implement increasingly tyrannical policies designed to curtail medical freedom, free speech and assembly, and other basic human rights that once formed the bedrock of Western civilization. Protests are likely to continue, despite the heavy-handed police approach in most Western nations, particularly Australia.\n\nSpeaking out publicly and peaceful resistance are several of the only effective measures against the full-on assault governments are waging in the name of combatting Covid-19.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["#", "#", "#", "#", "https://afpstore.americanfreepress.net/product/print-news-matters-1-year-print-subscription-u-s-only/", "https://www.beatirs.com/", "https://johnellis.com/", "#", "#", "#", "#"], "authors": [], "publish_date": null}