{"result_id": "024021", "URL": "https://aim4truth.org/2021/04/24/cat-nip/", "timestamp": "2023-04-25 12:01:55 CEST+0200", "meta": {"description": "Jeffrey Christian confesses to silver rigging OPTECH ELECTION RIGGING There is a war raging for control of your bloodstream and it is led by the FDA, CDC, WHO, and Big Pharma, and it looks as if they are winning Amazing Polly BOOM! MEDICAL JOURNALS CORRUPT TO THE CORE! The Few Words On Money In The…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/aim4truth.org/wp-content/uploads/2017/02/cropped-aim-4-truth-png.png?fit=32%2C32&ssl=1", "canonical": "https://aim4truth.org/2021/04/24/cat-nip/", "encoding": "UTF-8"}, "image": null, "domain": "aim4truth.org", "title": "#SilverSqueeze is putting huge pressure on the corrupt banking system", "cleaned_text": "#SilverSqueeze is putting huge pressure on the corrupt banking system\n\nThe meme above speaks the truth. We are witnessing the end of Western Civilization and the Roman Empire. On our spiritual site we call it the ending of the Kali Yuga. The vision before us is like seeing a ginormous tsunami on the horizon. We are positioned high above because we did years of research to place us on the high ground, along with you, where we discovered truth which now appears as a distant wave of about two to three months out to reach shore. June feels like the month we will see many things collide and washed away:\n• The horrors and evidence of the vaccine bioweapons will be known by more people, many of whom will be victims of their bad decisions, causing major social upheaval around the world.\n• #SilverSqueeze is putting huge pressure on the corrupt banking system. If you missed this confession by Jeffrey Christian about silver rigging, make sure to watch it here. This will expose the Federal Reserve paper money hoax and the fiat currency will collapse. We have no idea what kind of currency will be used in the interim, but keep in mind that U.S. minted silver and gold is official coinage for the United States. No mention of Bitcoin or cryptocurrency – wink. The Few Words On Money In The Constitution Say More Than We Know\n• Election rigging exposed – gonna happen. Michael, Douglas, and Tyla met with an influential leader this week who listened to us explain OPTECH ELECTION RIGGING. This was a HUGE help to this person who is going to share our vital research with others in their election cases against Dominion.\n\nRemember that time we discussed C60 and colloidal silver water?\n\nThink about how amazing you are to be living in this time. We are witnessing and participating in a GREAT SHIFT into a new way of being human on the planet. Is this the beginning of the Satya Yuga? Only time will tell, but the Gabriels plan on living out the rest of our lives doing the best we can to prepare those around us for new ways to approach health, farming, education, spirituality, art & entertainment, and community.\n\nWe already wrote the instruction manuals and constantly remind you that you can download our books for free. Plus, our sites (listed below) are filled with tons of material from sigils to nutrition for you to use and share.\n\nIf anyone is concerned that Cyber Polygon will wipe out the internet, please consider purchasing a set of physical books from Amazon while it is still in operation. You will want a physical copy when you can’t access your computer. Please get a few extra copies to share with friends down the road and organize a study group to help teach others what you have learned.\n\nAlternatively, you could download the books and print on your own paper, but it will cost you more than just buying the books – we kept the price really low.\n\nIf enough of you purchased the books, it would effect the algorithms and push the titles higher in the rankings which might bring them to the attention of other seekers who haven’t found our community yet.\n\nMany people ask me how they can donate to our work and I always reply, “we don’t ask for donations or payments.” Our work is created and offered from a place in the heart. However, if you feel inclined and can afford to do so, please buy a few of our books so we can bring them to the attention of other like-minded souls on the planet.\n\nThe most important unit in society is FAMILY. These kitties show us how it is done.\n\nThis article was written and posted by a fellow AIMCat:\n\nIS THERE SUCH A THING AS “TOO MUCH OF THE TRUTH”?\n\nBig Pharma is America’s new mafia whose chemical warfare on humanity dwarfs the number of victims killed by all the world wars and acts of terrorism combined. While drug companies profit billions, people are dying by the millions. It makes you wonder if Pharmageddon is upon us with the next set of mandatory vaccinations planned by the Center for Disease Control (CDC) for the profit of drug companies.\n\nThere is a war raging for control of your bloodstream and it is led by the FDA, CDC, WHO, and Big Pharma, and it looks as if they are winning. Read More\n\nDid you read the last Cat Nips thoroughly? Here’s the link.\n\nWHERE TO FIND US\n\nWe call this digital space the Glass Bead Game. We also call it Sophia’s Temple of Wisdom. Enjoy exploring our hundreds of articles, videos, free books, etc. to help you on your spiritual journey. Here is a basic “map” of the game and make sure to add glass beads to the game of discovering truth:\n\nThis week the Gabriels continue to ready our personal “ark”, our biosphere, for the travels ahead. It’s like getting ready for a big trip – packing, planning, and sorting. Check around your living space and make sure you have secured what you think will be important for living on the other side of the shift. Once the social upheaval starts, which is beginning to happen now and will only intensify, it may be difficult to get the supplies and materials that you might need.\n\nEach of us has a different locale, weather, lifestyle so we don’t want to give specific advice because YOU KNOW BEST, but here are some things we thought about as we prepared our modern-day Noah’s ark.\n• Enough food, water and provisions to outlast supply chain and currency problems. Don’t forget extra supplements like vitamin D, zinc, C60 and anything else that is important to your health.\n• Methods of payment other than the fiat note (junk silver, items of value for bartering)\n• Alternative energy off the grid. How will we pay for utilities if credit cards and fiat currency, including bank accounts, are worthless? Will there be interruptions and/or price increases in gas and energy? This is a big deal for us in Michigan because it gets COLD here and with the Maunder Minimum, we can expect even colder, longer winters.\n• Get those gardens going! So many great ways to grow today – inside or outside. Biodynamic, hydroponic, dirt pots, gardening towers. If you haven’t started yet, watch YouTube channels to find the best way to grow veggies to supplement you and your family when/if fresh produce is not as abundant. For the Gabriels, we do community farming in the growing season, supplemented with backyard hydroponics. We have expanded our efforts this year and are adding an indoor grow area for the winters and cooler spring where we can grow lettuce, greens, beans, peppers. Solar panels, because that’s the only alternative energy available to average citizens these days, will be used to power lighting in the grow room, as well as our home.\n• Buy tools and supplies (including personal protection devices) that you think you will need NOW. We did not procrastinate any longer in replacing those old appliances, and were not surprised at the low inventory, not to mention the lack of choice. We will need many years to rev up manufacturing in the U.S. again – so get what you need now. Tools and talent can be a way for you to support your family during the transition.\n\nPlease add your ideas in the comment box below. Let’s make sure AIMCats around the world make it through the storm. We are going to need at least 48 LEADERS with their posse of PIONEERS (your downline) to transition into the new world that awaits us.\n\nItems posted below were added after this version of Cat Nips was published.\n\nThe PDF now includes links to each biography in Fauci’s ABYS Swiss blood lineage.\n\nHey, you 48 out there! YOU ARE CHOSEN to lead your downline into the Satya Yuga, age of Love and Light. Rudolf Steiner indicated that it would take 48 amazing, enlightened humans LIKE YOU to change the course of humanity. Best news is that there are many more than ’48’ in this community who are leading the way forward.\n\nHow Do You Know If You’re A Chosen One?\n\nCan we get a hallelujah?! You Say – Lauren Daigle (cover) by Genavieve\n\n🚨ALERT🚨 DR. SHERRI TENPENNY | COVID SHOTS – MENSTRUAL CHANGES, INFERTILITY, SHEDDING, ETC. Video link Here.\n\nThe Manufacturing of a Mass Psychosis – Can Sanity Return to an Insane World?", "opengraph": {"type": "article", "title": "#SilverSqueeze is putting huge pressure on the corrupt banking system", "url": "https://aim4truth.org/2021/04/24/cat-nip/", "description": "Jeffrey Christian confesses to silver rigging OPTECH ELECTION RIGGING There is a war raging for control of your bloodstream and it is led by the FDA, CDC, WHO, and Big Pharma, and it looks as if th…", "article:published_time": "2021-04-25T00:00:38+00:00", "article:modified_time": "2021-06-09T14:59:46+00:00", "site_name": "American Intelligence Media", "image": "https://aim4truth.org/wp-content/uploads/2021/04/roman-empire.jpeg", "image:width": "1280", "image:height": "1280", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "980", "height": "552", "embed_code": "<iframe loading=\"lazy\" class=\"youtube-player\" width=\"980\" height=\"552\" src=\"https://www.youtube.com/embed/A0bG3S9y0dY?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/A0bG3S9y0dY?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}, {"embed_type": "iframe", "provider": "youtube", "width": "980", "height": "552", "embed_code": "<iframe loading=\"lazy\" class=\"youtube-player\" width=\"980\" height=\"552\" src=\"https://www.youtube.com/embed/wFYrAmt4gEc?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/wFYrAmt4gEc?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}, {"embed_type": "iframe", "provider": "youtube", "width": "980", "height": "552", "embed_code": "<iframe loading=\"lazy\" class=\"youtube-player\" width=\"980\" height=\"552\" src=\"https://www.youtube.com/embed/OFSrWxPHeBM?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/OFSrWxPHeBM?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}, {"embed_type": "iframe", "provider": "youtube", "width": "980", "height": "552", "embed_code": "<iframe loading=\"lazy\" class=\"youtube-player\" width=\"980\" height=\"552\" src=\"https://www.youtube.com/embed/pvMX_b0XuZg?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/pvMX_b0XuZg?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}, {"embed_type": "iframe", "provider": "youtube", "width": "980", "height": "552", "embed_code": "<iframe loading=\"lazy\" class=\"youtube-player\" width=\"980\" height=\"552\" src=\"https://www.youtube.com/embed/S_GA3Y2BB0I?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/S_GA3Y2BB0I?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}, {"embed_type": "iframe", "provider": "youtube", "width": "980", "height": "552", "embed_code": "<iframe loading=\"lazy\" class=\"youtube-player\" width=\"980\" height=\"552\" src=\"https://www.youtube.com/embed/fdzW-S8MwbI?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/fdzW-S8MwbI?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}, {"embed_type": "iframe", "provider": "youtube", "width": "980", "height": "552", "embed_code": "<iframe loading=\"lazy\" class=\"youtube-player\" width=\"980\" height=\"552\" src=\"https://www.youtube.com/embed/JqFEyrrVLmo?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/JqFEyrrVLmo?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}], "links": ["https://youtu.be/yb0Tn86PqmM", "https://www.forbes.com/sites/briandomitrovic/2018/09/07/the-few-words-on-money-in-the-constitution-say-more-than-we-know/?sh=2dded5355cd2", "https://aim4truth.org/2021/04/21/optech-election-rigging/", "https://youtu.be/A0bG3S9y0dY", "https://www.bitchute.com/video/SCdUdCbw5lsb/", "https://www.bitchute.com/video/JNjZNPvB2XjX/", "https://patriots4truth.org/2018/01/31/how-to-antidote-5g/", "http://conta.cc/2vrPhTT", "https://youtu.be/wFYrAmt4gEc", "https://aim4truth.org/wp-content/uploads/2021/04/Front-Line-Workers-Testimony-on-Vaccinations.pdf", "https://aim4truth.org/wp-content/uploads/2021/04/Front-Line-Workers-Testimony-on-Vaccinations.pdf", "https://tinyurl.com/y2phc3zo", "https://youtu.be/OFSrWxPHeBM", "https://radtrapwordpresscom.wordpress.com/2020/09/15/is-there-such-a-thing-as-too-much-of-the-truth/", "https://www.bitchute.com/video/qDyh0IYpUeuv/", "https://aim4truth.org/2017/03/26/5663/", "https://aim4truth.org/2021/04/18/cat-nips-2/", "http://www.ourspirit.com", "http://www.neoanthroposophy.com", "http://www.gospelofsophia.com", "http://www.eternalcurriculum.com", "http://www.aim4truth.org", "http://www.patriots4truth.org", "http://www.truthbits.blog&nbsp", "https://gab.com/Gabriels_Horn", "https://gab.com/Gabriels_Horn", "https://www.fbcoverup.com/docs/library/2021-04-16-Anthony-S.-Fauci-ABYS-Family-Tree-1589-to-present-Anonymous-Patriots-compiled-Apr-16-2021.pdf", "https://www.fbcoverup.com/docs/library/2021-04-16-Anthony-S.-Fauci-ABYS-Family-Tree-1589-to-present-Anonymous-Patriots-compiled-Apr-16-2021.pdf", "https://youtu.be/pvMX_b0XuZg", "https://youtu.be/S_GA3Y2BB0I", "https://www.bitchute.com/video/Edv10d8GoiSC/", "https://www.bitchute.com/video/Rtu5tstNtJSk/", "https://youtu.be/fdzW-S8MwbI", "https://youtu.be/JqFEyrrVLmo"], "authors": [], "publish_date": "2021-04-25T00:00:38+00:00"}