{"result_id": "024008", "URL": "https://aim4truth.org/2022/08/26/the-king-who-killed-is-killed/", "timestamp": "2023-04-25 12:01:40 CEST+0200", "meta": {"description": "Inside link \"Betsy and Thomas\" review how Donald Trump will be sacrificed on the altar of COVID to save the Pilgrims Society and their American-infiltrated crown agents. DONALD TRUMP TRAITOR TO AMERICA Donald Trump Pressured FDA Away From Safety Studies: Is He The Vaccine Fall Guy? TRUMP TRAP SPRUNG: Media FLIPS, sets stage to blame…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/aim4truth.org/wp-content/uploads/2017/02/cropped-aim-4-truth-png.png?fit=32%2C32&ssl=1", "canonical": "https://aim4truth.org/2022/08/26/the-king-who-killed-is-killed/", "encoding": "UTF-8"}, "image": null, "domain": "aim4truth.org", "title": "The King Who Killed is Killed", "cleaned_text": "Betsy and Thomas review how Donald Trump will be sacrificed on the altar of COVID to save the Pilgrims Society and their American-infiltrated crown agents.\n\nREPORT: Donald Trump Pressured FDA Away From Safety Studies: Is He The Vaccine Fall Guy?\n\nOnce the Pilgrims “kill the King”, will they crown Ron DeSantis as the heir apparent who will pick up princess darling Candace Owens to be his running mate? Nice tidy Pilgrims-controlled presidential ticket.\n\nIt looks like Trump will be sacrificed. There is no saving the ‘Father of Vaccines’ now. The Pilgrims have to remove him to get voters to accept the DeSantis/Owens ticket. Prepare.\n\nDeSantis Beats Trump on Fundraising – However, Donor Financials Highlight Corporate Version vs Grassroots Version of The Republican Party\n\nTRUMP TRAP SPRUNG: Media FLIPS, sets stage to blame Trump for widespread vaccine injuries and deaths\n\nTHE AZAR-FAUCI-TRUMP CORONAVIRUS PANDEMIC FIAT ON JAN. 31, 2020 WAS BASED ON HHS FRAUD\n\n(1) Donald Trump said You’re playing right into their hands when you doubt the vaccine. Trump\n\n(2) TRUMP enforcing vaccinations at TRUMP TOWER/GRILL !\n\nTRUMP TOWER and TRUMP GRILL refuses customer who is UN-Vaccinated !\n\nDecember 17, 2021, Trump Tower, New York\n\n\n\n(4) Trump encourages all Republicans to receive “vaccines” on Sean Hannity –\n\nAt the 28:25 mark Trump says, “A lot of our people don’t want to take vaccines. You know, I don’t know what this is exactly. Republicans? Don’t know what it is. I encourage them to take it. I do.” April 2021\n\n\n\n(6) Trump tells crowd at Alabama rally: “I recommend [you] take the vaccines.”\n\nAugust 2021\n\n\n\n(8) “I hope everyone remembers when they’re getting the COVID-19 Vaccine, that if I wasn’t President, you wouldn’t be getting that beautiful ‘shot’ for 5\n\nyears, at best, and probably wouldn’t be getting it at all. I hope everyone remembers!” — Donald J Trump, February 28th 2021\n\n(10) “I guess in a certain way, I’m the father of the vaccine… ” Donald J Trump, April 29th 2021\n\n(11) “Everybody, go get your shot.” — Donald J Trump,\n\nFebruary 28th 2021\n\n(12) “It works incredibly well. 95%, maybe even more than that…”\n\n— Donald J Trump, March 9th 2021\n\n(13) “These vaccines are also very safe.” — Donald J Trump, December 11th 2020\n\n(14) “The Vaccine and the Vaccine rollout are getting the best of reviews. Moving along really well. Get those shots everyone!” — Donald J Trump,\n\nDecember 17th 2020\n\n(15) “During my administration, everybody wanted the vaccine. There was nobody saying oh, gee, I don’t want to take it. Now they say that. And that’s because they don’t trust the Biden administration. I can think of no other reason. But they say we don’t want it, we aren’t going to take it. When I was there, everybody wanted it and we were doing great. Well, the military did a fantastic job.” — Donald J Trump, October 7th 2021\n\n(16) President Biden delivers remarks on the status of the country’s fight against COVID-19. “I got my booster shot as soon as they were available.\n\nAnd just the other day, former President Trump announced that he had gotten his booster shot. Maybe one of the few things that he and I agree on.”", "opengraph": {"type": "article", "title": "The King Who Killed is Killed", "url": "https://aim4truth.org/2022/08/26/the-king-who-killed-is-killed/", "description": "Inside link “Betsy and Thomas” review how Donald Trump will be sacrificed on the altar of COVID to save the Pilgrims Society and their American-infiltrated crown agents. DONALD TRUMP TR…", "article:published_time": "2022-08-26T17:38:51+00:00", "article:modified_time": "2022-08-27T13:04:18+00:00", "site_name": "American Intelligence Media", "image": "https://i0.wp.com/aim4truth.org/wp-content/uploads/2022/08/trump-judas-scape-goat-1.jpg?fit=1200%2C675&ssl=1", "image:width": "1200", "image:height": "675", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "980", "height": "552", "embed_code": "<iframe loading=\"lazy\" class=\"youtube-player\" width=\"980\" height=\"552\" src=\"https://www.youtube.com/embed/prGwei8qcXs?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/prGwei8qcXs?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}], "links": ["https://aim4truth.org/wp-content/uploads/2022/08/The-King-who-killed-is-killed.mp3", "https://youtu.be/prGwei8qcXs", "https://theconservativetreehouse.com/blog/2022/08/25/desantis-beats-trump-on-fundraising-however-donor-financials-highlight-corporate-version-vs-grassroots-version-of-the-republican-party/", "https://www.naturalnews.com/2022-08-25-media-flips-sets-stage-to-blame-trump-for-vaccine-injuries-and-deaths.html", "https://gab.com/Gabriels_Horn/posts/108889395619518881", "https://aim4truth.org/2021/09/16/the-azar-fauci-trump-coronavirus-pandemicfiat-on-jan-31-2020-was-based-on-hhs-fraud/", "https://aim4truth.org/2021/10/31/donald-trump-traitor-to-america/", "https://gab.com/Gabriels_Horn/posts/108889299452908156", "https://gab.com/CounterPropagandist"], "authors": [], "publish_date": "2022-08-26T17:38:51+00:00"}