{"result_id": "024020", "URL": "https://aim4truth.org/2020/11/11/kathy-boockvar-pa-sec-of-state/", "timestamp": "2023-04-25 12:01:54 CEST+0200", "meta": {"description": "What follows is substantial proof of foreign interference in U.S. elections, not to mention, treason and sedition by the Pennsylvania Secretary of State and her cronies Elected officials are required by law to disclose all relationships that could affect their impartiality Boockvar evidently hid these relationships because she knows they disqualify her from public office,…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/aim4truth.org/wp-content/uploads/2017/02/cropped-aim-4-truth-png.png?fit=32%2C32&ssl=1", "canonical": "https://aim4truth.org/2020/11/11/kathy-boockvar-pa-sec-of-state/", "encoding": "UTF-8"}, "image": null, "domain": "aim4truth.org", "title": "KATHY BOOCKVAR, PA SEC OF STATE, HIDES LIFELONG FOREIGN & CORPORATE ASSOCIATIONS WITH SIR EVELYN ROTHSCHILD, BRITISH PILGRIMS SOCIETY, THE BRONFMANS, NXIVM SEX TRAFFICKING, DNA-ALTERING EUGENICS, VACCINE BIOTECH WEAPONS, AND DOMINION ELECTION RIGGING", "cleaned_text": "KATHY BOOCKVAR, PA SEC OF STATE, HIDES LIFELONG FOREIGN & CORPORATE ASSOCIATIONS WITH SIR EVELYN ROTHSCHILD, BRITISH PILGRIMS SOCIETY, THE BRONFMANS, NXIVM SEX TRAFFICKING, DNA-ALTERING EUGENICS, VACCINE BIOTECH WEAPONS, AND DOMINION ELECTION RIGGING\n\nWhat follows is substantial proof of foreign interference in U.S. elections, not to mention, treason and sedition by the Pennsylvania Secretary of State and her cronies\n\nElected officials are required by law to disclose all relationships that could affect their impartiality\n\nBoockvar evidently hid these relationships because she knows they disqualify her from public office, not to mention show foreign influence\n\nBoockvar failed to disclose any of these relationships with her when she was a judge candidate and secretary of state\n\nShe’s an election lawyer (!), she has no excuse for ignoring these important election ethics laws\n\nNov. 11, 2020—We are accelerating release of this investigation given the imminent threat posed to the American Republic by Pennsylvania Secretary of State Kathryn “Kathy” Boockvar’s gross election meddling and sedition, in our opinion.\n\nOur headline assertions are supported with hard, indictable evidence. As our regular readers know, we do not make statements without proof.\n\nBROOCKVAR SAYS EVERYTHING WAS “SMOOTH” ON NOV. 3\n\nPennsylvania’s Secretary of State Kathryn “Kathy” Boockvar told Today the Nov. 4, 2020 Presidential vote went “incredibly smooth” and that “Every vote will be counted.”\n\nPresident Trump encouraged her yesterday to change her promise to ‘Every LEGAL vote will be counted.’ To our knowledge, Ms. Boockvar has not corrected herself.\n\nDOES PALPABLE DISDAIN MEAN IMPARTIAL? AT MINIMUM IT HAS AN ODOR\n\nBoockvar’s disdain for President Donald Trump is notoriously known on her own Twitter profile. On Mar. 07, 2017, she tweeted from her iPhone: “Using the title ‘President’ before the world ‘Trump’ really demeans the office of the presidency…”\n\nBoockvar’s bias against President Trump can be reasonably assumed by her words and the fruit of her actions, not to mention undisclosed foreign and corporate relationships that are uniformly anti-Trump as well as anti-American Republic, as described below.\n\nOFFICIALS WITH ANIMUS ARE BIASED BY INFERENCE, OR AT LEAST HAVE THE ODOR OF BIAS\n\nAll of these anti-Trump government officials with animus against our President, like Trump-Russia hoax C.I.A. asset Peter Strzok, claim that they are able to set that animus aside and do their job in an unbiased way. [Authors: Yeh, uh huh, right.]\n\nBOOCKVAR IS LYING. HOW DO WE KNOW? HER LIPS ARE MOVING.\n\nArmed with this common sense that Boockvar is lying, we put researchers on finding out who she is, really.\n\nWe encountered numerous road blocks to getting this information.\n\nIt is evident that Boockvar and her handlers used their power corruptly to: (1) filter Google searches to only allow hack biographies to appear, (2) scramble Newspapers.com records that are normally accurate, (3) hide Ancestry.com records “Private” when they would otherwise identify her as a relative, (4) mistype newspaper archives search words that make reference to her relatives, (5) obscure access to what can only be described as demonically anti-human eugenics documents behind academic-only logins and (6) buried unfavorable information in Google searches.\n\nAs evidence of record tampering at Newspapers.com:\n\nA search for “Leah Saskin” would not find this obituary that reveals numerous family names and associations that were the keys to opening up this research.\n\nLeah Saskin is Boockvar’s maternal great grandmother, a Jewish émigré from Russia, as was her maternal great grandfather, Benjamin Saskin, who was a men’s tailor. Leah was born “Yiddish” in 1889 (US Census) and emigrated to the United States in 1895.\n\nWHY DOES BOOCKVAR HIDE HER RUSSIAN JEWISH ANCESTRY?\n\nTellingly, all references to Boockvar’s Jewish ancestry have been recently removed from Wikipedia. Why?\n\nCould it be because so many of her British Pilgrims Society handlers are British Zionists with Russian Jewish roots?\n\nIn a court of law, when a witness makes contradictory statements and withholds evidence (where one or both statements must be false) all of that person’s testimony must be thrown out, and the jury is permitted to interpret the information in a way more favorable to the other side.\n\nBoockvar has clearly lied to the American people about her foreign and corporate relationships by withholding disclosure of them.\n\nBOOCKVAR’S NONDISCLOSURES ARE FRAUD & SEDITION, IN OUR OPINION\n\nTo be clear, Boockvar has never identified her family roots in her many biographies for public office—this fact alone is fraud since these relationship are directly related to her current corrupt conduct. It took crack AFI researchers almost three days to get around the censorship of Boockvar’s past.\n\nIn 1986, Boockvar was a senior and member of the student council at the exclusive Hewlett High School, Hewlett Neck, NY, as were her freshman twin brothers John and Daniel (Class of 1989). Danny is pictured as both a girl and guy in their 1986 Yearbook.\n\nA review of Hewlett’s alumni shows that the school is a feeder school for the “Deep State,” which we now know has a name: the British Pilgrims Society and its minions in the United States.\n\nDon’t let these corruptocrats distract you away from naming the Pilgrims Society enemy by one of their many offshoots including Council on Foreign Relations (CFR), League of Nations, United Nations, China, Bilderberg Group, DAVOS, World Economic Forum, Rothschilds, Atlantic Council, EU, Illuminati, Aspen Institute, Bohemian Grove, Federal Reserve, Trilateral Commission, Rockefeller Foundation, Carnegie Foundation, Ford Foundation, Gates Foundation, Clinton Foundation, Zuckerberg Founding, Wellcome Trust, Wellcome Fund, Crown Agents, MI6, MI5, GCHG, C.I.A., NSA, State Department, FBI, Mossad, Zionists, Knights of Malta, Free Masons, Senior Executive Service (SES), etc.\n\nIt would be accurate to identify the inner circle of the British Privy Council as the controllers of the British Pilgrims Society. Since the Pilgrims inception in 1902, their goal is an imperial corporatist new world order where America has returned to the reconstituted British Empire, and where the world populations are controlled with communism—a brainchild of British Pilgrims.\n\nThe president (or vice president depending on your source) of the Hewlett Student Council in 1986 was Neal Simon.\n\nIn 1994, just a mere eight years later, Simon followed Larry Summers (Harvard World Bank, Clinton U.S. Treasury, D.E. Shaw, Obama bank bailout director, Instagram, Facebook, Square, Andreessen) and Sheryl Sandberg (Harvard, Gmail, Summers Treasury Chief of Staff, Facebook, Clinton) into the World Bank. Summers had just finished collapsing the Russian currency with his vouchers debacle dubbed “globaloney” and “Big Bangery” by fellow economists.\n\nIn 2002, at age 34, Simon started Highline Wealth Management which magically became the 5th largest investment advisor in the U.S. Simon then “sold” his behemoth to Bronfman Rothschild where he became CEO for 17 years, until he failed a Maryland Senate run in 2018. Magically, he boasts on Wikipedia that “the company had grown every year.”\n\nNotably, Wikipedia narcissistically enumerates the many magazine covers that then featured Simon, including Charles Schwab, Financial Advisor, Financial Planning and Financial Advisor.\n\nWE REMAIN UNSURE WHY SHE IS HIDING HER RUSSIAN JEWISH ROOTS\n\nMatthew’s sister Clare Bronfman was convicted in 2018 of running the human sex trafficking NXIVM cult .\n\nMatthew Bronfman is one of the largest American Jewish investors in the Israeli economy.\n\nSir Evelyn Rothschild (Evelyn is a male) is one of the leaders of the British Pilgrims Society where Henry Kissinger and Obama bailout financial chairman Paul A. Volcker were 2007-2008 vice presidents.\n\nRothschild also plucks promising American students into globalism as trustee of the London-based Rhodes Scholarship.\n\nIf anyone needs proof of foreign interference in a U.S. election, we need look no further than Pennsylvania Secretary of State Kathryn “Kathy” Boockvar.\n\nBoockvar has British and Israeli influences on her work as Secretary of State.\n\nBoockvar’s concealment of her Russian family background begs the question: “What are you hiding in Russia?”\n\nCould it be your Russian Jewish connections to British Zionism and the U.N. interests in destroying the American Republic?\n\nBOOCKVAR IS THE FRUIT OF A POISONOUS TREE—ALL HER DECISIONS MADE AND ACTIONS TAKEN MUST BE INVALIDATED AS THEY ARE TAINTED BY BOOCKVAR’S FRAUD\n\nAt minimum, Boockvar’s control of the Pennsylvania 2020 election is the fruit of a poisonous tree.\n\nAll actions taken and decisions made by a corrupt actor are, by nature, the fruit of that actor’s poisonous tree, and therefore must be invalidated.\n\nKathryn “Kathy” Boockvar did not tell the People of Pennsylvania and the United States that she had material* relationships with:\n\n* A material relationship means a familial, financial, professional or employment relationship that would reasonably be expected to impair the objectivity of the person’s judgment when participating in the action to be taken. (Source: Law Insider.)\n• Matthew Bronfman / sister Clare indicted for leading the NXIVM human and sex-trafficking cult (666)\n• That she is a eugenicist and favors depopulation of the earth by force (666)\n• That she has Russian Jewish heritage and connections; why hidden ???\n\nEach of these concealed Boockvar relationships is a separate crime.\n\nIt is evident from her current attempt to cover over her election rigging that she is conspiring with one or more of these actors, many foreign, to undo the landslide re-election of President Donald J. Trump.\n\nDisclosure of conflicts of interest are required by law, common sense and morality for any candidate for public office in the United States.\n\nKathyrn Boockvar defrauds the Pennsylvania and U.S. public by hiding her many conflicts of interests and relationships with global election riggers.\n\nHer duty as a public official is to disclose relationships that affect her impartiality to do the peoples’ business.\n\nConflicts of interest are not illegal. Failing to disclose them is.\n\nFailing to disclose her legion of anti-President Trump, anti-American relationships is seditious, in our opinion, and certainly fraudulent.\n\nWe The People are with you, Mr. President, and we are praying with you. This is why we hired you. Ignore the naysayers. That is all they know how to do. Such “skill” cannot run a country, much less itself. Get these parasites off all of our backs.\n\nWe’ve already seen that you can do more in one day than Joe Biden has accomplished in 47 years.\n\nTraitors and seditionists must be hanged.", "opengraph": {"type": "article", "title": "KATHY BOOCKVAR, PA SEC OF STATE, HIDES LIFELONG FOREIGN & CORPORATE ASSOCIATIONS WITH SIR EVELYN ROTHSCHILD, BRITISH PILGRIMS SOCIETY, THE BRONFMANS, NXIVM SEX TRAFFICKING, DNA-ALTERING EUGENICS, VACCINE BIOTECH WEAPONS, AND DOMINION ELECTION RIGGING", "url": "https://aim4truth.org/2020/11/11/kathy-boockvar-pa-sec-of-state/", "description": "What follows is substantial proof of foreign interference in U.S. elections, not to mention, treason and sedition by the Pennsylvania Secretary of State and her cronies Elected officials are requir…", "article:published_time": "2020-11-11T23:56:18+00:00", "article:modified_time": "2020-11-11T23:56:42+00:00", "site_name": "American Intelligence Media", "image": "https://i0.wp.com/aim4truth.org/wp-content/uploads/2020/11/Broockvar-2.jpg?fit=1200%2C564&ssl=1", "image:width": "1200", "image:height": "564", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["https://americans4innovation.blogspot.com/", "https://americans4innovation.blogspot.com/2020/11/2020-11-11-KATHY-BOOCKVAR-HIDES-LIFELONG-FOREIGN-AND-CORP-ASSOC-W-ROTHSCHILD-PILGRIMS-BRONFMANS-NXIVM-EUGENICS-VACCINE-BIOTECH-WEAPONS-DOMINION-ELECTION-RIGGING-Americans-for-Innovation-Nov-11-2020.pdf", "https://tinyurl.com/y6fud6ku", "https://www.fbcoverup.com/docs/library/2020-11-08-Kathryn-Kathy-Broockvar-Biography-and-Timeline-Anonymous-Patriots-compiled-Nov-08-2020.pdf", "https://www.today.com/video/-every-vote-will-be-counted-pennsylvania-secretary-of-state-says-95313989703", "https://www.fbcoverup.com/docs/library/2017-03-07-Kathryn-Boockvar-TWEET-Trump-really-demeans-the-title-'President'-Twitter-Mar-07-2017.pdf", "https://www.fbcoverup.com/docs/library/2018-01-21-Read-FBI-s-Strzok-Page-texts-about-Trump-Fox-News-Jan-21-2018.pdf", "https://www.fbcoverup.com/docs/library/1958-10-26-LEAH-SASKIN-Obituary-b-1889-Jewish-Russia-San-Bernardino-County-Sun-Oct-26-1958.pdf", "https://americans4innovation.blogspot.com/2020/04/part-1-rca-nbc-founder-pilgrim-david.html", "https://aim4truth.org/2020/03/28/charles-m-lieber-and-the-queens-qinetiq/", "https://en.wikipedia.org/wiki/George_W._Hewlett_High_School", "https://americans4innovation.blogspot.com/2019/10/vladimir-lenin-communism-were-created.html", "https://en.wikipedia.org/wiki/Neal_Simon", "https://www.fbcoverup.com/docs/library/1986-Kathryn-Boockvar-Neal-Simon-GW-Hewlett-High-School-Hewlett-New-York-School-Yearbook-PATCHES-1986-Vol-52-p-153-1986.pdf", "http://www.fbcoverup.com/docs/cyberhijack/cyber-hijack-findings.html#globalbaloney", "https://en.wikipedia.org/wiki/Matthew_Bronfman", "https://en.wikipedia.org/wiki/Clare_Bronfman", "https://www.fbcoverup.com/docs/library/2020-11-11-NXIVM-Cult-Overview-Wikipedia-accessed-Nov-11-2020.pdf", "https://americans4innovation.blogspot.com/2020/08/henry-kissinger-has-been-spying-for.html", "https://americans4innovation.blogspot.com/2020/09/indictable-evidence-british-pilgrims.html", "https://americans4innovation.blogspot.com/2019/01/so-you-thought-rhodes-scholarships-were.html", "https://www.lawinsider.com/dictionary/material-relationship#:~:text=Related%20Definitions&text=Material%20relationship%20means%20a%20familial,the%20action%20to%20be%20taken."], "authors": [], "publish_date": "2020-11-11T23:56:18+00:00"}