{"result_id": "024016", "URL": "https://aim4truth.org/2021/03/22/jews-are-being-exterminated/", "timestamp": "2023-04-25 12:01:51 CEST+0200", "meta": {"description": "The Nazis are at it again. This time Israeli Jews are being targeted for extermination. This important post needs to be widely shared, most especially with the Jewish community that may not be aware of the globalist plans for their annihilation.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/aim4truth.org/wp-content/uploads/2017/02/cropped-aim-4-truth-png.png?fit=32%2C32&ssl=1", "canonical": "https://aim4truth.org/2021/03/22/jews-are-being-exterminated/", "encoding": "UTF-8"}, "image": null, "domain": "aim4truth.org", "title": "Jews are Being Exterminated", "cleaned_text": "Israeli Jews Are Being exterminated by Klaus “ ” Schwab\n\nDid you watch the video from yesterday’s Cat? (repeated below). The Gabriels and Michael have been calling out GENOCIDE for over a year and have provided evidence that humanity is being marched into global genocide by the British-American Pilgrims, which includes Prince Charles, the Rothschilds, the Monarch….and Klaus ‘the Nazi” Schwab whose family has deep roots to the Holocaust.\n\nThe Schwabs know how to control and exterminate millions of people, Jewish and others. It was tried and tested in WWII by Klaus’s daddy.\n\nThe Balfour Declaration and the creation of Israel actually gave the British Pilgrims an ability to round up millions of Jews in a containment area – the country Israel – which is far more efficient than marching millions in concentration camps. The Jews in Israel are sitting ducks for the next version of Zyklon B and IG Farben – Astrazenca and Moderna bioweapons.\n\nWhere are those highly efficient Israeli Defense Forces when Nazis like Klaus Schwab and Dr. Mengele-Fauci are implementing nation-wide GENOCIDE in Israel? We thought their military was filled with highly-trained ninja-types, yet their people are being herded WILLINGLY to receive their deadly bioweapon, while Benjamin Netanyahu promotes the ‘vaccine’, fully aware of the extermination plan of his country’s citizens.\n\nThis was Klaus’s Daddy. Klaus was left power and fortune to continue the Nazi plan of eradicating Jews from the planet. Daddy-O would be proud of Klausie-Boy for not only planning GENOCIDE for Jews, but for the entire population of the Earth.\n\nImportant research inside. Details matter. Make sure you and your downline are fully aware of the Nazi attempt to genocide the world.\n\nKLAUS SCHWAB IS THE GREAT BARKER OF THE FOURTH REICH\n\nBelow are additional notes that the AFI miners have pulled out about the Schwabs. Then scroll down the page to read what Alexandra Bruce of ForbiddenKnowledgeTV sent to her downline and what State of the Nation has been reporting (for years) about the Khazarian Mafia.\n\nKlaus Schwab’s Sulzer – Escher Wyss appears to be the source of the CERN “Accelerating Science” propaganda\n\nOPAL DETECTOR. (Accessed Mar. 21, 2021). The OPAL detector on the Large Electron-Positron collider [built by Sulzer – Escher Wyss]. CERN.\n\nCould that be because the Schwab/WEF/Escher Wyss/CERN people know they are lying about their research propaganda – that it is not real?\n\nOPAL-The OPAL detector on the Large Electron-Positron collider delivered key measurements of Z and W bosons in its 11-year lifetime, accessed Mar. 21, 2021\n\nSulzer Escher Wyss and Uranium Enrichment (Klaus as a newly-minted Swiss graduate) handled the 10,000-employee merger between Escher Wyss AG and Sulzer AG.\n\nBy attacking fossil fuels, Klaus Schwab is paving the way for his family of Sulzer, Escher Wyss, Andritz, Stoll, Festo underground nuclear power and weapons plants\n\nProof of the nuclear reactor under the Federal Institute in Zurich (ETH) when Klaus Schwab was attending University there, funded by Sulzer, Escher-Wyss, who were providing key technologies to the nuclear reactor and its processes.\n\nDuring his decade of military (ABC – nuclear, biological, chemical), Klaus was stationed in Aare that contain an experimental nuclear reactor.\n\nS. Pinto. (Dec. 01, 1979). A Survey of the Underground Siting of Nuclear Power Plants, incl. Sulzer Escher Wyss, ETH, Swiss Federal Institute for Reactor Research.\n\nSulzer includes Escher Wyss with whom they merged with Eugen & Klaus Schwab overseeing the merger.\n\nAlexandra Bruce at ForbiddenKnowledgeTV sent an emergency email to her downline regarding .\n\nThis is an excellent podcast by Tyla and Douglas Gabriel about the multidimensional aspects of the epochal change and the mass genocide that we are living through, drawing from Christian and Eastern theology and the work of Rudolf Steiner.\n\nIt’s both extremely interesting and important to have a higher perspective of what’s now happening, which is akin to the Great Flood of Noah. Whereas it said that Atlantis was destroyed by Water and the age previous to that, referred to as “Lemuria” was destroyed by Fire, our current world is in the process of being destroyed via the Element of Air; through 5G, chemtrails, psychotronic warfare and the spread of bioweapons.\n\nDouglas goes into a detailed description of Ahriman and Lucifer, which I won’t get into here.\n\nAs Tyla says, “We’re going through hyperinflation, the veils are being lifted, everything that can’t be tied down to Earth has been shorted. The banks are short, the stock market is short, silver’s short, all of the lies – everything – is being exposed and it’s all going to collapse. But we’re trying to nudge it so it collapses on the Evil Ones.\n\n“Those of you who’ve been listening, paying attention, you’re been fortifying yourselves, both spiritually and around you, physically with the things you need to survive as we go forward.\n\n“I don’t want to paint a doomsday picture because we know that those who’ve prepared are going to be fine; we’re going to make it out. But you’re going to be on your Ark. You’re going to see the people out there, in the water drowning, and there’s nothing you can do.\n\n“If a loved-one has already taken the vaccine, you can’t un-do that. So, we’re just going to just have to come to grips with what this means for our future incarnations and our evolution as a species and stop looking at it as these individual losses, because there will be so much suffering and we have to watch this.”\n\nDouglas agrees. “It’s like the image of Lot and his wife and children leaving the city, as hellfires [rain down].”\n\nTyla continues, “I’m so glad to see so many Trump supporters, who are saying, ‘Hell, no, we’re not taking the vaccine and we don’t care what Donald Trump says at his point. We don’t see that he is free to speak the truth. He could be handled. His kids could be in a hostage situation; he could be threatened to have to come out and say these things.’\n\n“So, at this point in history, Fellow Citizens, we have to follow the path of truth and not follow anyone in particular, like a Jim Jones at Jonestown and drink their Kool-Aid.”\n\nDouglas finishes by saying, “Vaccines, vaccine companies, Big Pharma, they are not trying to help you. It’s like the hospitals. They’re just there as a business. They want to do procedures; they want to make money. They want the next test because it’s all part of the flow of money. But when it comes to Big Pharma, when it comes to the National Institutes of Health and the Centers of Disease Control – no, no, no – they are outright – this is a pogrom. This is genocide. This is a global genocide, literally run from the World Health Organization, from the United Nations and those two organizations –”\n\nTyla interjects, “– And the World Economic Forum. Don’t forget those evil people!”\n\n“Oh, they planned it, remember, they’ve actually had meetings to prepare for this, begged for it – Fauci threatened that it was going to happen, threatened when it was going to happen and then brought the hammer down. They knew that it was the only thing they had left to create the Big Bang for the ‘Reset’.\n\n“And the Reset is America no longer exists. We are taken over by global forces. And America will probably be paired-up with Canada and Mexico, in the way that the United Nations plan wants to work. They want to have these economic zones. So, there’s going to be no more nations.\n\n“But before that, there has to be this war of All against All. So, what happens? Syria gets bombed. As soon as Syria gets bombed and Damascus, that’s it, Folks. It’s the rain coming down on Noah. And remember, even in the Fatima letters, with Noah or with Lot, they didn’t get to take everybody. A lot of the people didn’t make it.\n\n“And so, when we’re talking about consciousness, are people going make the leap of consciousness that is coming in because of all of these things that we’ve mentioned, the Maunder Minimum, the cosmic rays that are coming in from the stars, stronger now, probably than at any time that they can remember in history? There’s just about the greatest number we’ve ever had of earthquakes, volcanoes, strange storms and so on and so forth.\n\n“So, as this Minimum is happening, we can expect all these things; magnetic anomalies. People say that Earth’s axis is going to shift, North to South, South to North. This has happened before; paleomagnetism proves that. Well yeah, it is is. I’ve been watching the gigantic hole. It gets bigger and bigger and bigger.\n\n“So, where are we headed? Consciousness. No matter what, humans are a precious thing to the Divine. And they are not going to let a single person be wasted. Even if you are in the lower third and you become an animal-human and then it takes you a little bit longer to become a human…that’s OK. It’s all made in the big plan…\n\n“Just wake up, look around. Look inside, look outside and create a coherent cosmology. And if you can do that, then no matter what is happening, you can understand it, you can put it in place. You can eventually digest it; that right now, the things that are being stuffed down our throat are just about the worst that I’ve ever seen in my life, just as the four years before were the best that I’ve seen coming out of the White House and Washington DC.\n\n“But now, any evil you can think of is becoming a law…”\n\nAIMCats, we must get this CRITICAL information out to everyone on the planet, especially to the Jewish families in Israel who are at the mercy of the Khazarian Mafia. This time the World Economic Forum’s (Nazis with a modern name) goal is to wipe out all Jews in Israel, then around the world, by LETHAL INJECTION.\n\nKHAZARIAN MAFIA: The Most Ruthless Enemy of Humanity\n\nBibi Netanyahu is the Operational Head of the Khazarian Mafia\n\nExactly WHO or WHAT is behind the wholesale destruction of the entire planetary civilization?", "opengraph": {"type": "article", "title": "Jews are Being Exterminated", "url": "https://aim4truth.org/2021/03/22/jews-are-being-exterminated/", "description": "The Nazis are at it again. This time Israeli Jews are being targeted for extermination. This important post needs to be widely shared, most especially with the Jewish community that may not be awar…", "article:published_time": "2021-03-22T16:18:10+00:00", "article:modified_time": "2021-03-22T18:05:42+00:00", "site_name": "American Intelligence Media", "image": "https://aim4truth.org/wp-content/uploads/2021/03/balfour-declaration.jpg", "image:width": "802", "image:height": "515", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["https://en.wikipedia.org/wiki/Balfour_Declaration", "https://en.wikipedia.org/wiki/IG_Farben", "https://aim4truth.org/2021/03/16/klaus-schwab-is-the-great-barker-of-the-fourth-reich/", "http://stateofthenation.co/", "https://stateofthenation.co/?p=5854", "https://www.fbcoverup.com/docs/library/2021-03-21-OPAL-DETECTOR-The-OPAL-detector-on-the-Large-Electron-Positron-collider-CERN-accessed-Mar-21-2021.pdf", "https://www.fbcoverup.com/docs/library/2021-03-21-OPAL-DETECTOR-The-OPAL-detector-on-the-Large-Electron-Positron-collider-CERN-accessed-Mar-21-2021.pdf", "https://www.fbcoverup.com/docs/library/1986-Special-compressors-for-uranium-enrichment-re-Sulzer-Escher-Wyss-ten-years-of-development-P-Mayfarth-ISSN-0039-4912-Sulzer-Technical-Review-1986.pdf", "https://inis.iaea.org/search/search.aspx?orig_q=RN:18057043", "https://www.fbcoverup.com/docs/library/1979-12-01-A-Survey-of-the-Underground-Siting-of-Nuclear-Power-Plants-incl-Sulzer-Escher-Wyss-ETH-by-S-Pinto-Swiss-Federal-Institute-for-Reactor-Research-Dec-01-1979.pdf", "https://www.fbcoverup.com/docs/library/2021-03-21-Lucens-reactor-Overview-Sulzer-Escher-Wyss-Boverie-ETH-Zurich-1945-Swiss-Military-Study-Commission-for-Atomic-Energy.-de-zxc-wiki-accessed-Mar-21-2021.pdf", "https://forbiddenknowledgetv.net/", "https://forbiddenknowledgetv.net/wp-content/uploads/2021/03/lots-wife-1024x576-1.jpg", "https://forbiddenknowledgetv.net/wp-content/uploads/2021/03/CVCSC-0332.N-Cranach-Lucas-the-Elder-Lot-and-his-Daughters-%C2%A9-Compton-Verney.jpg", "https://stateofthenation.co/?p=52306", "https://stateofthenation.co/?p=5854", "https://stateofthenation.co/?p=56866", "https://gab.com/Gabriels_Horn"], "authors": [], "publish_date": "2021-03-22T16:18:10+00:00"}