{"result_id": "024045", "URL": "https://aim4truth.org/2020/04/22/bill-gates-global-vaccine-warlord/", "timestamp": "2023-04-25 12:02:16 CEST+0200", "meta": {"description": "Douglas Gabriel reviews the crimes Bill Gates has committed against humanity.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/aim4truth.org/wp-content/uploads/2017/02/cropped-aim-4-truth-png.png?fit=32%2C32&ssl=1", "canonical": "https://aim4truth.org/2020/04/22/bill-gates-global-vaccine-warlord/", "encoding": "UTF-8"}, "image": null, "domain": "aim4truth.org", "title": "Bill Gates Global Vaccine Warlord", "cleaned_text": "Douglas Gabriel reviews the crimes Bill Gates has committed against humanity in the audio below. The details are posted below the audio. Share wide and far.\n\nStarted the Global Alliance for Vaccines and Immunization (GAVI) in 2000 (donated $750 million) a “Vaccine Alliance”, who claim to have vaccinated half the world’s children (with poisonous vaccines).\n\nGave 496,000 Indian children polio through his new “polio vaccine”, as confirmed by WHO. Gates is now wanted in India for crimes against humanity.\n\nBy 2018, 75% of polio cases worldwide were from “Gates Vaccines.” Gates introduced the world to a new form of polio that he funded.\n\nIn 2014, Gates gave 23,000 Indian girls HPV vaccines – Gardasil and Cervarix from Merck and Glaxo Smith Kline (formerly Burroughs-Wellcome) – 5% had severe side effects, most were permanently sterilized, seven died, and the vaccine was useless against HPV. Gate’s staff were prosecuted by the Indian government for forging signatures, coercion, and refusing medical treatment for side effects.\n\nIn 2002, Gates forcibly vaccinated South African children against meningitis. Many developed permanent paralysis. The press called Gates “Ruthless and immoral.”\n\nIn 2010, Gates gave his anti-malaria vaccine to 5,000 African children – 151 died – 1,000 had serious side effects including paralysis and seizures.\n\nIn 2014, the WHO chemically sterilized millions of Kenyan women with a “Gates tetanus vaccine” that was poisonous, and later the WHO publicly admitted it.\n\nCreated the Strategic Advisory Group of Experts (SAGE) to advise WHO on vaccine and immunization policies, research and development, and delivery systems, This secretive group is chaired by Sir Peter Vallance, ex Glaxo Smith Kline director, a top vaccine warlord.\n\nGates committed $10 billion to the WHO campaign to reduce the world’s population through new vaccines. He bragged that his new Green Program for Africa will depopulate Africa by 10-15%.\n\nPartnered with the Rockefeller Foundation, UNICEF, WHO, World Bank, DFID, DNIH, CDC, WEF, vaccine manufacturers, and others to demand mandatory biometric ID’s to track vaccinations world-wide. This is “vaccine war” world-domination.\n\nHas controlled the Department of International Development (DFID) through donations since 2000. This British group demands that countries donated to the Gates Vaccine Wars and it controls media vaccine propaganda to hide the true intention of Vaccine Warlords and make Gates, SAGE, WHO. CDC, NIH and Big Pharma true heroes looking after the safety of people everywhere. DFID is hosting an international vaccine summit in June 2020. Anyone questioning the Bill Gates Vaccine War lockdown narrative will be silenced.\n\nGave $40 million in 2008 to Professor Chris Witty, Chief Medical Officer of England, and Chief Scientific Adviser for the Department of Health and Social Care (DHSC), National Institute for Health Research (NIHR), Department for International Development (DFID), and SAGE board member to control British vaccine promulgation. Chris Witty is Gates Vaccine Warlord in England just as Anthony Fauci is Gate’s Vaccine Warlord in America.\n\nStarted the Coalition for Epidemic Preparedness (CEPI) in 2017 to accelerate new vaccine creation and distribution. CEPI gave $8.4 million to Imperial College in 2017 to develop “Vaccine X”, a vaccine targeted for every person on the planet.\n\nDonated 200 million to CDC to help develop a COVID-19 vaccine knowing that no such vaccine is possible.\n\nDonated &100 million to Anthony Fauci’s efforts to create new vaccines at the National Institute for Health. The NIH donated $3.7 million of that money to the Wu Han Institute of Virology, the only level four bioweapon lab in China where the Chinese doctor (Dr. Qiu) who had breached the Canadian National Microbiology Laboratory had taken the Birtish/Canadian virus bioweapons, developed by Pirbright, Merial, and QinetiQ, to China.\n\nDonated £184 million to Imperial College of London for fake Covid-19 propaganda death predictions, 2.2 million in America and over 1.5 million in England. Gates is looking to COVID-19 to force his third world vaccination programs on the Western world and mandatory vaccine ID implanted in every human being.\n\nA child dies every 30 seconds from starvation, 3 million a year, but that’s not good enough for Bill Gates, the King of Depopulation and Eugenics. He wants every human (except his friends) to have the “Vaccine X” shot to ward all viruses – when he knows that NO VACCINE CAN STOP A VIRUS. Any Gate’s vaccine is poinous, period.\n\nThe Queen of England/Golden Share Holder of Pirbright\n\nDFID Department of International Development, among others.\n\nIt is Bill Gates who has locked down the world through his depopulation cabal which includes Toni Fauci, Chris Witty, the NIH, SAGE, CEPI, GAVI, CDC, UNICEF, WHO, and Big Pharma, among others. Bill Gates, plus his friends at Pirbright, Merial, QinetiQ, and the World Bank have “Bought and Paid For” their Vaccine War propaganda and global world dominance. They feel perfected entitled to complete the Empire Press Unions founding principles, vaccinated the enemy to slowly kill them and propagandized them into believing it is for their own good.\n\nThen,“Say No” to all vaccines and Immunizations!", "opengraph": {"type": "article", "title": "Bill Gates Global Vaccine Warlord", "url": "https://aim4truth.org/2020/04/22/bill-gates-global-vaccine-warlord/", "description": "Douglas Gabriel reviews the crimes Bill Gates has committed against humanity.", "article:published_time": "2020-04-22T19:12:00+00:00", "article:modified_time": "2020-04-26T18:55:13+00:00", "site_name": "American Intelligence Media", "image": "https://i0.wp.com/aim4truth.org/wp-content/uploads/2020/03/bill-gates-queen.jpg?fit=1125%2C821&ssl=1", "image:width": "1125", "image:height": "821", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["https://aim4truth.org/wp-content/uploads/2020/04/Bill-Gates-Vaccine-Warlord.mp3", "https://aim4truth.org/wp-content/uploads/2020/04/Bill-Gates-Vaccine-Warlord.mp3"], "authors": [], "publish_date": "2020-04-22T19:12:00+00:00"}