{"result_id": "024040", "URL": "https://aim4truth.org/2022/08/28/death-via-graphene-oxide-nano-particles/", "timestamp": "2023-04-25 12:02:13 CEST+0200", "meta": {"description": "Is there a diabolical plan behind superparamagnetic graphene/iron oxide nano-particles that are being found in the bloodstreams of people who have received the Covid vaccine or died from Sudden Adult Death Syndrome? Could the super-permeation of graphene family substances in food, drinks, water, vaccines, medicines, cosmetics, packaging, and medicines be a planned conspiracy against human…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/aim4truth.org/wp-content/uploads/2017/02/cropped-aim-4-truth-png.png?fit=32%2C32&ssl=1", "canonical": "https://aim4truth.org/2022/08/28/death-via-graphene-oxide-nano-particles/", "encoding": "UTF-8"}, "image": null, "domain": "aim4truth.org", "title": "Death via Graphene Oxide Nanoparticles", "cleaned_text": "This article will address some of the following questions:\n• Is there a diabolical plan behind superparamagnetic graphene/iron oxide nano-particles that are being found in the bloodstreams of people who have received the Covid vaccine or died from Sudden Adult Death Syndrome?\n• Could the super-permeation of graphene family substances in food, drinks, water, vaccines, medicines, cosmetics, packaging, and medicines be a planned conspiracy against human health?\n• Are graphene oxide “circuits” being created in the human body to control the many nano-particle metals being injected into people through vaccines and through the ingestion of food?\n• Can graphene oxide be “pre-programmed” before being inserted into injections, food, and the environment?\n• Is the transhumanistic plan for “aggressive remote-control of all things” (Internet of Things, Internet of the Body) actually possible through new scientific “mad-scientist” experiments of human subjects using the Graphene Family Nano-materials?\n\nThroughout the world, doctors are putting the Covid vaccine under the microscope, along with human blood from vaccinated people, and discovering the most astoundingly disgusting results that prove that pharmaceutical companies are lacing jabs with nano-metals, graphene and iron oxide nano-structures, and many other substances of “unknown” origin. These substances are accumulating in blood vessels as they self-organize and self-replicate with the magnetic and electrically conductive materials found in the vaccines that are being used by the pre-programmed graphene oxide to build unidentifiable structures in blood vessels and tissue that block blood flow creating strokes and heart attacks. These “structures” have also been analyzed and found to contain the same substances.\n\nGraphene oxide “quantum dots”, also called “evil dust”, jumps over the brain-blood barrier and deposits toxic Graphene Oxide in the mid-brain, causing Alzheimer’s and Parkinson’s like symptoms – also called human spongiform encephalitis. Graphene Oxide flakes, sheets, webs, and 3D structures build blood clots that create vascular obstructions and heart problems leading to the “vaccine death” now called Sudden Adult Death Syndrome. Many of these new illnesses and symptoms are caused by, or exacerbated by, Graphene Oxide substances that “build” unwanted, and unnatural structures in the human body that are foreign, man-made, sub-natural substances causing toxicity, harm, and death. Graphene Oxide organizes nano-metals into circuits that become sensors, activators, antennas, broadcasters, magnetic triggers, bio-electric devises, and mechanisms for diagnostic feedback in magnetic resonance imaging. A doctor can take readings from these circuits with external devises.\n\nUnfortunately, these mad-scientific, immoral research projects got out-of-hand during the fake pandemic when all safety protocols were ignored. Humans are now the lab rats for vaccine gain of function bioweapon experimentation without any consideration for adverse vaccine reactions. Of course, the bigger question is: Why did the CDC, NIH, WHO, Congress, Courts and the President sanction these crimes against humanity? Sadly, the answer is that this is Standard Operating Procedure for Big Pharma that is actually not an industry of health, but one of promoting illness and death – a pharmaceutical killing-field of depopulation. It is easy to understand why so many people believe that Big Pharma is a depopulation syndicate of rich elite who wish to decrease the Earth’s population by billions of people – and, as quickly as possible without being noticed and with complete impunity. Sadly enough, there seems to be no other answer than the fact that this is all a planned eugenics policy of transnational pharmaceutical (vaccine) syndicates aligned with Big Pharma, WHO, CDC, NIH and many other agencies and organizations.\n\nFirst, let’s take a look at the proof that this toxic poison is in the bodies of vaccinated people via microscopic examination. It is important to remember that most Covid vaccinations have these graphene/iron oxide “adjuvants” in them, especially childhood vaccines since 2008, flu shots, shingles and pneumonia vaccinations, as well as many medical treatments and procedures.\n\nHundreds of doctors worldwide are now examining the Covid vaccines, and human blood samples, under microscope and finding results that seem to be from a horrifying science-fiction movie.\n\nIn an article from The Defender, on August 25, 2022, entitled, Toxic, Metallic Compounds Found in All COVID Vaccine Samples Analyzed by German Scientists, by The Epoch Times, Enrico Trigoso:\n\nA group of independent German scientists found toxic components – mostly metallic – in all the COVID-19 vaccine samples they analyzed, “without exception” using modern medical and physical measuring techniques. The Working Group for COVID Vaccine Analysis says that some of the toxic elements found inside the AstraZeneca, Pfizer, and Moderna vaccine vials were not listed in the ingredient lists from the manufacturers. The following metallic elements were found in the vaccines:\n\n“We have established that the COVID-19 vaccines consistently contain, in addition to contaminants, substances the purpose of which we are unable to determine,” their study says.\n\nIn an article from The Expose entitled: Covid Injection Aftermath: Study finds 94% of “Vaccine” Recipients have Pre-Blood Clot Formations and Foreign Particles, by Rhonda Wilson, on 8/24/2022 the author states: “An Italian study published two weeks ago in the International Journal of Vaccine Theory, Practice, and Research revealed almost everyone who had been injected had abnormalities after Covid vaccination. In 94% of vaccinees’ blood, there was an aggregation of red blood cells and the presence of particles of various shapes and sizes. The study began in March 2021. Using dark-field microscopy, the researchers analyzed blood samples from 1,006 referred to the Giovannini Biodiagnostic Centre for various disorders after being injected with Pfizer/BioNTech or Moderna mRNA vaccines.\n\nIn the study, authors noted that the vaccines are purported to contain at least the spike protein from SARS-CoV-2 but are known also to contain foreign particles. “Among those foreign components are metallic objects as demonstrated previously in this journal by Lee et al. (2022) which are confirmed in our results.” Of the 1,006 cases analyzed, only 58 – equal to 5.77% of the total – presented a completely normal hematological picture upon microscopic analysis after the last mRNA injection with either the Moderna or Pfizer vaccine. The blood of 948 – 94% of the study’s participants – showed aggregation of red blood cells and the presence of particles of various shapes and sizes of unclear origin one month after the mRNA injection.\n\nBlood clots found by morticians have been sent all over the world to be studied by independent teams. The only thing that is for sure is that something is taking the injected metals and building them into “killer clots” throughout the body. These clots have substances and structures inside of them that are “unidentifiable” and cannot be explained by anyone. But they are obviously designed to kill the host body that receives the injections.\n\nGraphene Oxide flakes self-organize, move towards each other, and build layers like an independent robot. That is why they are used in hydrogels for the slow release of medicine in a patch, a patch that can sense what the Graphene Oxide receivers are broadcasting about the chemical function of the liver, pancreas, or most any other diseased area. A doctor can also read a Graphene Oxide “infested” organ and then give electrical/magnetic commands for a hydrogel to release a specific amount of medicine. Graphene Oxide (GO) can do wonders because it is monoatomic – one atom thick, either as a “dot”, “flake”, “sheet”, “tube”, “web”, or “buckyball/fullerene.” Graphene is carbon and carbon is the source of organic processes because it is seemingly amorphous, like silica in the inorganic world. As GO sheets, GO hyper-connects in all directions (superconductivity) in length and breadth and scientists say it is 2D – which it is not. Even though, a sheet of GO is transparent, electro-conductive, 100 times stronger than steel, self-organizing, and self-replicating when in the presence of specific EMFs and magnetic fields. Graphene Oxid, GO, can be the scaffolding for just about anything, organic or inorganic.\n\nGraphene Oxide as nano-tubes has created a diabolic industry of nano-technology that is far more evil than most people are aware of and yet touches most aspects of their life through myriad industries beyond just medical uses. Graphene Oxide and iron oxide (both superparamagnetic) are everywhere, but especially in vaccines, medicines, and food. They supposedly control and target vaccine delivery but are also known for being a common adjuvant, a substance that is seen as “foreign” (xenobiotic/inhuman) that creates an immune reaction because it is seen as an antigen or pathogen trying to harm the body. Graphene Oxide is considered toxic (cytotoxic) in the smallest amounts and accumulates in the body and yet it is used everywhere, including the lipid-coated nanotubes that deliver vaccines and other medicines. It is also mutagenic, causing DNA damage and continuing mutation, just as mRNA vaccines have recently been proven to do.\n\nGraphene Oxide as nanowebs can combine dots, flakes, tubes, and sheets into animated nanowebs that self-organized, self-replicate and direct the building of tissue-like material in the circulatory system, as well as nanocircuits that target certain organs (brain, heart, ovaries, testes, liver, etc.) and carry the payload inside the nanotube to the targeted organ. All of these things are already happening, these are not science predictions, they are science fact. These types of inhuman, mechanical, anti-life systems are being used right now, approved by the FDA, CDC, NIH, WHO, AMA, etc., to target and attack cancer cells in a variety of organs. Doctors can inject and move large amounts of Graphene Oxide with a magnet to a specific organ, inject a hydrogel and control the release of more nano-tubes from the hydrogel with a phone app to conduct telemedicine. These GO nan-technologies, merged with mRNA, create the most-deadly genocide in human history because we have only seen the initial results. Some estimates are that over twelve million have died directly associated with the current jab. Untold others have terrible adverse reactions. That doesn’t take into consideration the millions who have died due to the same vaccine death shots given out continuously for flu, pneumonia, shingles, or childhood vaccines. The vaccine induced Sudden Infant Death Syndrome is now joined by the Sudden Adult Death Syndrome and the medical authorities actively look the other way as hundreds of athletes drop dead on the playing field before the audience. And still, the vaccine has not been pulled from the market and the guilty prosecuted.\n\nGraphene Oxide as fullerenes (buckyballs) is, as yet, little used. It is a man-made 3D structure folded from GO sheets which can also make other 3D geometric solids. This is totally different than C-60, a natural occurring substance which is presumed to be from meteorites. Naturally occurring C-60 (fullerenes/buckyballs), which can be found in the rare mineraloid shungite, has nothing to do with the GO buckyballs created in laboratories. Scientists believe that bucky-balls (C-60) originate in space and are a highly developed form of carbon exposed to cosmic heat. There is also C-70, C-80, and other carbon compounds found in space that have exposed carbon to tremendous heat, which is one way to create Graphene Oxide – burn a steak on your barbeque and you have simple Graphene Oxide.\n\nIt seems quite likely that as human intelligence develops, so too does carbon develop in its many organic forms through a natural process of metamorphoses. We owe our life to carbon and if more perfect forms of carbon already exist in our solar system and cosmos, then obviously we can metamorphose carbon into higher forms and functions. Unfortunately, our voodoo witch-doctor mad-scientists haven’t considered any of these ideas as they are actively devolving into a “Graphene World” of one, two, and three dimensional, man-made monstrosities by injected a Frankenstein mutation (mRNA is mutagenic) into the new Graphene Oxide, Genetically Modified Human Being, a new species that has fallen out of the 3D world into the 2D Graphene World. Humans can advance to an objective view of time and enter a world of spiritual endurance (4D) instead of the illusion of linear time (3D). Modern materialistic science has devolved into two dimensional nanowebs that mimic human neural nets with 2D nanosheets/nanowebs that build “fake” human tissue with their 1D nano graphene dust/graphene flakes that are designed to kill human beings, ultimately leading to 0D – death. This is clearly planned elimination of everyone who does not know the secret – “Don’t take any injections of any kind.”\n\nGraphene World is a world of sub-nature, a step backwards into immoral animal, plant, and mineral realms, not a step forward into higher forms of carbon in super-nature that are part of human ascension. Graphene Oxide is a man-made sub-element that can only lead into darkness and the horrifying medical genocide we are seeing around us in all fields of medicine. Every person involved in gain of function research on deadly viruses and vaccines is an enemy to humanity. Using GO to deliver any vaccine is diabolical, then add mRNA and you have a truly evil group of murderers. These types of experiments on “uninformed” humans are creating a new species of ill and dying humanity and an elite pharmaceutical syndicate that openly advocates depopulation by injection, toxic food, toxic chem-trail air, a medical industry creating illness, economic slavery, psychological subliminal programming, and the mass hypnosis of media propaganda that sold the world a fake pandemic – the fear of Virus X. Virus X, the highly prophesied pandemic of huge proportions, is spliced into the synthetic virus that was created in a bioweapon P-4 labs and disseminated to all other P-4 secure biolabs throughout the world. This biological weapon of mass destruction was bio-engineered with funding from Dr. Anthony Fauci and the National Institutes of Health, the CDC, and the World Health Organization of the United Nation. The United Nations is a clear Anti-American war-actor that took over American Constitutional freedoms via Pharmaceutical Terrorism with a fake pandemic supported with lies and bad protocols that killed millions. It was made possible by Congress passing laws that allowed it: The All Hazards and Pandemic Act of 2019.\n\nIron oxide as a vaccine adjuvant has been in most childhood vaccines since 2008. Graphene Oxide is present everywhere in the environment and yet is poisonous, as proven in every study of its toxicity. And yet the medical industry pushes forward without any moral reflection on the harm being done to humans. These Big Pharma doctors and drug-pushers are individuals who have devolved into immoral animals who are now below even what an animal would do to another animal. The demonic forces involved in this global Pharmaceutical World War III are quite real and wish to turn all humans into machine-augmented cyborgs who can be “stopped” or “controlled” by pushing a button that activates transhuman wetworks inside the human body. This nefarious plan has been patented by Richard C. Walker and is called “The Aggressive Remote Control of Everything”, which can only be fully accomplished by having an “OFF” button on every human being created by nano graphene technology.\n\nWhat is Graphene Oxide (GO)?\n\nGraphene Oxide (GO) is a single atom carbon layer where both surfaces of the layer are modified by oxygen containing functional groups that are bonded together in a repeating pattern of hexagons. There is tremendous interest in graphene and its derivatives [graphene oxide (GO) and reduced GO (rGO)] due to their superior mechanical, thermal, electrical, optical, and chemical-adsorption properties. In the past few years, graphene-based materials attracted much attention and were used for many practical applications in various industries. Recent developments on graphene synthesis from foodstuffs, use of graphene for food analyses, and graphene-based analytical methods in detection (e.g., composition, contaminants, toxins, and volatile organic compounds) are used to help to ascertain the quality and/or safety of foods. There are also antibacterial properties of graphene-based nanomaterials and their applications in food packaging.\n\nGraphene Family Nano-materials trigger local and systemic toxic effects, induce genotoxicity in vitro and in vivo, alter the gut microbiome, cause genetic mutations, and are inedible. Further toxicological and risk assessment studies are needed especially when used in food or injections of any type.\n\nDifferent applications have been suggested for graphene nano-materials (GFNs) in the food and feed chain. However, it is necessary to perform a risk assessment before they become market-ready, and when consumer exposure is demonstrated. For this purpose, the European Food Safety Authority has published a guidance that has been recently updated to identify and characterize toxicological hazards related to GFNs after oral exposure. GFNs seemed to resist gastrointestinal digestion and were not able to be absorbed, distributed, and excreted, inducing toxic effects at different levels, including genotoxicity. Also, dose has an important role as it has been reported that low doses are more toxic than high doses because GFNs tend to aggregate in the digestive system, changing the internal exposure scenario. Thus, further studies including a thorough toxicological evaluation are required to protect humanity from the, as yet unknown, effects of GFNs.\n\nAlthough Graphene Oxide – like graphene – is also a 2 Dimensional material, its properties are very different from that of graphene. It does not absorb visible light, has a lower electric conductance compared to that of graphene, and demonstrates significantly higher chemical activity. Its high electron mobility is 100x faster than silicon; it conducts heat 2x better than diamond; its electrical conductivity is 13x better than copper; it absorbs only 2.3% of reflecting light; it is impervious so that even the smallest atom can’t pass through a defect-free monolayer graphene sheet with a thickness of about 0.33 nanometers. There are about 3 million layers of graphene in a 1 mm thick sheet of graphite. Harder than diamond yet more elastic than rubber; tougher than steel yet lighter than aluminum – graphene is the strongest known material.\n\nSome of the most promising applications of graphene are publicized as being in electronics (as transistors and interconnects), detectors (as sensor elements) and thermal management. The first graphene field-effect transistors (FETs) have already been created and used for nano analog communication or nano digital applications.\n\nAn ever-increasing number of research groups are exploiting programmable self-assembly properties of nucleic acids in creating rationally designed nano-shapes, nano-machines, and nano-electronic devices that can self-assemble for many different uses. These devices include nano-routers, nano-antennas, and nano-circuit boards. Medical nano-technology researchers have created nano-bots, a popular term for molecules with a unique property that enables them to be programmed to carry out a specific task.\n\nWhen Graphene Oxide is injected into the body and interacts with biological blood or tissue, the GO picks up hydrogen and becomes graphene hydroxide. The OH (hydroxy) groups can then split off a proton which leaves a negative charge affecting the whole graphene sheet and making it highly acidic and damaging to red blood cells. It also is incredibly sharp and acts like razor blades cutting blood vessels, tissue, and organs. Self-organizing GO tubes and sheets can block capillaries and arteries, with devastating effects when this occurs in the heart and lungs.\n\nGraphene Oxide inside the body causes thrombogenicity, blood clotting, post inflammatory syndrome or systemic or multi-organ inflammations, causes alteration of the immune system, collapse of the immune system, cytokine storms, neurodegeneration, and mutagenic effects changing the DNA of the host. Inhaled Graphene Oxide spreads evenly throughout the alveolar tract and causes bilateral pneumonias, inflammation of the mucous membranes, and loss of taste and smell. Graphene Oxide toxicity in the human body behaves like SARS-CoV-2, generating the same symptomatology.\n\nGraphene, Graphene Oxide (GO), carbon nano-tubes, and the entire graphene-family nano-materials (GFN) are toxic in almost all their forms, causing mutagenesis (cancer, chromosomal alteration), cell death, apoptosis, necrosis, and the release of free radicals. It creates immunosuppression, damage to the central nervous system, circulatory, endocrine, reproductive, and urinary systems, which can cause anaphylactic death, and multi-organ dysfunction. It increases toxicity rapidly in the lungs, creating cytokine storms leading to bilateral pneumonia, genotoxicity, and DNA damage.\n\nSeveral typical mechanisms underlying Graphene Oxide nano-material’s toxicity have been revealed in numerous studies, for instance, physical destruction, oxidative stress, DNA damage, inflammatory response, apoptosis, autophagy, and necrosis. In these mechanisms, toll-like receptors, transforming growth factor-beta (TGF-β) and tumor necrosis factor-alpha (TNF-α) dependent-pathways are involved in the signaling pathway network, and oxidative stress plays a crucial role in these pathways. Many experiments have shown that Graphene Oxide nano-materials have toxic side effects in many biological applications. According to the USA FDA, graphene, Graphene Oxide, and reduced graphene oxide elicit toxic effects both in vitro and in vivo. Graphene-family nano-materials (GFN) are not approved by the USA FDA for human consumption.\n\nGraphene Oxide has been used in a wide variety of nano-medical applications including tissue engineering, cancer treatment, medical imaging, and drug delivery. Its physiochemical properties allow for a structure to regulate the behavior of stem cells, with the potential to assist in the intracellular delivery of DNA, growth factors, and synthetic proteins. Due to its unique behavior in biological environments, GO is used in cancer therapies. It has also been used in vaccines and immunotherapy, including as a dual-use adjuvant and carrier of biomedical materials. In September 2020, researchers at the Shanghai National Engineering Research Center for Nanotechnology in China filed a patent for use of Graphene Oxide in a recombinant vaccine under development against SARS-CoV-2.\n\nThe properties of graphene are exceptional from a physical, thermodynamic, electronic, mechanical, and magnetic point of view. Its characteristics allow it to be used as a superconductor, crystallized graphene nano-antenna, and graphene quantum dot nan-orouters. It is an electromagnetic wave absorbing material, a signal emitter-receiver, and an antenna which makes it possible to create advanced nano and micrometric scale electronics. Graphene is a radio-modulatable nano-material. The graphene molecule also has the ability to inject electrons into other biological substances depending on the electromagnetic environment and temperature. Graphene is activated at room temperature and above.\n\nGraphene can multiply radiation, acting as a nano-antenna, or else a signal repeater, a transistor. Exposure to electromagnetic radiation can cause the exfoliation of the material into smaller particles called Graphene Quantum Dots (GQD), whose properties and physical peculiarities are enhanced since they act by amplifying electromagnetic signals and, with that, the emission distance, especially in environments such as the human body. Graphene quantum dots can acquire various morphologies like hexagonal, triangular, circular, bucky-bulls, or irregular polygons and geometric solids.\n\nThe nightmare of Graphene Oxide circuits in human food is a Frankenstein monster that kills. As Mark Wilson’s headline reads: Edible Graphene Is Here, And Electronics In Your Food Are Coming. Mark’s article highlights the research conducted by Jeff Fitlowfrom Rice University thatuses a stock laser to carve edible circuits into food. These researchers have successfully used a commercial laser to transform the surface carbon in foods – like toast, coconuts shells, potatoes, and Girl Scout cookies – into graphene. Without using any special vacuums or clean rooms, graphene can be patterned into an impossibly thin, edible circuit. Graphene can be used to help fuel cells to store power, radio hardware to transmit data, glowing elements to light up, and all sorts of sensors, as well as deliver a preprogrammed piece of toast that can control your body. These graphene circuits resemble a dark, inky tattoo, a bit like very burnt toast. But, don’t forget, graphene is inedible, toxic, and a nerve poison.\n\nIron oxide nano-structures (IONs) in combination with graphene or its derivatives – e.g., Graphene Oxide and reduced graphene oxide – hold great promise toward engineering of efficient nano-composites for enhancing the performance of advanced devices in many applicative fields. Due to the peculiar electrical and electrocatalytic properties displayed by composite structures in nanoscale dimensions, increasing efforts have been directed in recent years toward tailoring the properties of IONs-graphene based nanocomposites for developing more efficient electrochemical sensors.\n\nUnique features of IONs e.g., strong magnetic properties, low toxicity, high adsorption ability for immobilization of desired biomolecules and good biocompatibility, together with elegant properties of this new member of the carbon family e.g., high electrical/thermal conductivity, large surface area and electrocatalytic properties, have stimulated many interests for overcoming difficulties in realizing new scientific ideas or improving the performance of many current devices and methods. Catalytic activity of the graphene-IONs can be improved due to enhanced electronic communication e.g., charge transfer between catalyst and support. Additionally, synergistic effects of graphene sheets and IONs components provide nano-composite with novel physicochemical properties and consequently enhance electrochemical performance. As a result, graphene-IONs nano-composites have been considered as one of the most promising hybrid materials that can boost the development of more efficient electrochemical sensors.\n\nDue to their tissue-like mechanical properties, hydrogels are being increasingly used for biomedical applications; a well-known example are soft contact lenses. These gel-like polymers consist of 90 percent water, are elastic and particularly biocompatible. Hydrogels that are also electrically conductive allow additional fields of application, for example in the transmission of electrical signals in the body or as sensors. Graphene and graphene derivatives (e.g., Graphene Oxide (GO) reduced graphene oxide (rGO)) have been incorporated into hydrogels to improve the properties (e.g., mechanical strength) of conventional hydrogels and/or develop new functions (e.g., electrical conductivity and drug loading/delivery). Unique molecular interactions between graphene derivatives and various small or macromolecules enable the fabrication of various functional hydrogels appropriate for different biomedical applications. In order to produce electrically conductive hydrogels, conventional hydrogels are usually mixed with current-conducting nano-materials that are made of metals or carbon, such as gold nano-wires, graphene or carbon nano-tubes.\n\nTo demonstrate the truth and efficacy of the above statements concerning the graphene family materials, we present below a series of research projects which summarize the “state of the art” concerning research in Graphene Oxide in its many forms. Much of what has been said above may have sounded alarmist, or even like wild, sci-fi fairytales of transhumanism, but the research below demonstrates that all of the experiments on humans with graphene substances has been going on for many years on a massive scale. The “innovations” in nano-particle research are not “illegal” but should certainly be “not allowed” by any moral scientist, doctor, or sane person. For the sake of innovation, humanity is now a collective lab rat to be experimented on by morally bankrupt drug-doctors preaching the Gospel of Transhuman manipulation of the building blocks of DNA, human organs, tissue creation, neurological control through wetworks, and inhuman mechanical thinking that dominates “precision medicine” and nano-biology. Essentially, nano-biology should be an oxymoron instead of the current medical, experimental treatment, vaccine, or deadly medical procedure. Man-made toxic graphene does not belong in the human body. After reading these studies, I believe you will agree with the author that all Graphene Oxide use must end immediately and parties guilty of these heinous crimes against humanity must be brought to justice.\n\nFrom: ACS Publications, February 17, 2021, In Situ Transforming RNA Nanovaccines from Polyethylenimine Functionalized Graphene Oxide Hydrogel for Durable Cancer Immunotherapy,Yue Yin, Xiaoyang Li, Haixia Ma, Jie Zhang, Di Yu, Ruifang Zhao, Shengji Yu, Guangjun Nie, and Hai Wang\n\nAbstract: Messenger RNA (mRNA) vaccine is a promising candidate in cancer immunotherapy as it can encode tumor-associated antigens with an excellent safety profile. Unfortunately, the inherent instability of RNA and translational efficiency are major limitations of RNA vaccine. Here, we report an injectable hydrogel formed with graphene oxide (GO) and polyethylenimine, which can generate mRNA and adjuvants (R848)-laden nanovaccines for at least 30 days after subcutaneous injection. The released nanovaccines can protect the mRNA from degradation and confer targeted delivering capacity to lymph nodes. The data show that this transformable hydrogel can significantly increase the number of antigen-specific CD8+ T cells and subsequently inhibit the tumor growth with only one treatment. Meanwhile, this hydrogel can generate an antigen specific antibody in the serum which in turn prevents the occurrence of metastasis. Collectively, these results demonstrate the potential of the PEI-functionalized GO transformable hydrogel for effective cancer immunotherapy.\n\nThe Food and Drug Administration (FDA) has approved many types of iron oxide nanoparticles for clinical use, such as treating iron deficiency, contrast agents for magnetic resonance imaging (MRI) and drug delivery platforms. In one study, researchers explored the combined use of iron oxide nanoparticles (superparamagnetic Fe3O4 nanoparticles) as a vaccine delivery platform and immune potentiator, and investigated how this formulation affected cytokine expression in macrophages and dendritic cells (DCs) in vitro and tumor growth in vivo. Their iron oxide nanoparticles greatly promoted the activation of immune cells and cytokine production, inducing potent humoral and cellular immune responses. These results suggest that this nanoparticle-based delivery system has strong potential to be utilized as a vaccine for viruses.\n\nSuperparamagnetic iron oxide nanoparticles (SPIONs) as a contrast agent have been widely used in magnetic resonance imaging for tumor diagnosis and theranostics. However, there has been safety concern of SPIONs with cirrhosis related to excess iron-induced oxidative stress. Analysis with PCR array of the toxicity pathways revealed the high dose of SPIONs induced significant expression changes of a distinct subset of genes in the cirrhosis liver. All these results suggested that excess iron of the high dose of SPIONs might be a risk factor for cirrhosis because of the marked impacts of elevated lipid metabolism, disruption of iron homeostasis and possibly, aggravated loss of liver functions.\n\nAt present, nanoparticles are used for various biomedical applications where they facilitate laboratory diagnostics and therapeutics. More specifically for drug delivery purposes, the use of nanoparticles is attracting increasing attention due to their unique capabilities and their negligible side effects not only in cancer therapy but also in the treatment of other ailments. Among all types of nanoparticles, biocompatible superparamagnetic iron oxide nanoparticles (SPIONs) with proper surface architecture and conjugated targeting ligands/proteins have attracted a great deal of attention for drug delivery applications.\n\nSuperparamagnetic iron oxide nanoparticles (SPIONs) have drawn attention because of their excellent superparamagnetic properties such as controllable size, large surface area-to-volume ratio, and nontoxicity. Surface functionalization of SPIONs with therapeutic molecules, including antimicrobial agents, has been successfully used in nanomedicine. Through application of an external magnetic field, antimicrobial-loaded SPIONs can be guided to the desired infection site allowing a direct and specific therapeutic effect with minimum side effects. The great advantage of SPIONs is their magnetic properties that allow direct delivery of matter into the pathogen zone without influencing the whole organism, which incites an increasing interest in the development of antimicrobial SPIONs.\n\nWhen infused intravenously, these SPIONs can be used to detect and characterize small focal lesions in the liver. They also can be administered orally in order to visualize the digestive tract, and can be used as biomarkers to evaluate the efficacy of treatments. But still further investigations are required using labeled SPIONs in the field of molecular imaging.\n\nSuperparamagnetic iron oxide nanoparticles (SPIONs) have been studied for various biomedical applications, such as contrast agents, iron replacement therapies, drug delivery, tissue repair, hyperthermia, cell and tissue targeting, and transfection. SPIONs have an iron oxide core that is coated by an organic or inorganic layer. Bare SPIONs may be toxic because there is chemical reactive, so the coating layer prevents aggregation and agglomeration of the nanoparticles and reduces iron oxide oxidation. SPIONs are largely studied for magnetic resonance imaging and targeted delivery of drug and antigen to the required sites.\n\nSPIONs have been approved by the FDA for treatment of anemia in adult patients with chronic renal disease. SPIONs are also used for noninvasive diagnosis of chronic liver diseases, nonalcoholic steatohepatitis, cirrhosis, liver tumors, magnetic resonance angiography, lymph node imaging, bone marrow imaging, and atherosclerotic plaque imaging.\n\nFrom: Science of Food, November 20, 2017, Is nano safe in foods? Establishing the factors impacting the gastrointestinal fate and toxicity of organic and inorganic food-grade nanoparticles, David Julian McClements & Hang Xiao\n\nNanotechnology offers the food industry a number of new approaches for improving the quality, shelf life, safety, and healthiness of foods. Nevertheless, there is concern from consumers, regulatory agencies, and the food industry about potential adverse effects (toxicity) associated with the application of nanotechnology in foods. In particular, there is concern about the direct incorporation of engineered nanoparticles into foods, such as those used as delivery systems for colors, flavors, preservatives, nutrients, and nutraceuticals, or those used to modify the optical, rheological, or flow properties of foods or food packaging. This review article summarizes the application of both inorganic (silver, iron oxide, titanium dioxide, silicon dioxide, and zinc oxide) and organic (lipid, protein, and carbohydrate) nanoparticles in foods, highlights the most important nanoparticle characteristics that influence their behavior, discusses the importance of food matrix and gastrointestinal tract effects on nanoparticle properties, emphasizes potential toxicity mechanisms of different food-grade nanoparticles, and stresses important areas where research is still needed. The authors note that nanoparticles are already present in many natural and processed foods, and that new kinds of nanoparticles may be utilized as functional ingredients by the food industry in the future.\n\nNanotechnology can be utilized to improve food quality, shelf life, safety, cost, and nutritional benefits. In some cases, the nanomaterials used in the food industry are not intended to find their way into the final food product, e.g., those used in packaging, sensors, and antimicrobial treatments designed for sanitizing food manufacturing plants. Engineered nanoscale materials (ENMs) may be intentionally added to foods or they may inadvertently find their way into foods (such as nanoparticles in packaging materials that leach into the food matrix). ENMs may be used to create delivery systems for nutrients, nutraceuticals, colors, flavors, and preservatives, or they may be used to modify the texture, appearance, or stability of foods. Nanoscale structures may be present in foods as the result of routinely used food processing operations, such as homogenization, grinding, and cooking.\n\nNanoparticles present in foods can be categorized as either organic or inorganic. Inorganic materials, such as silver, iron oxide, titanium dioxide, silicon dioxide, or zinc oxide are commonly used. These particles are either crystalline or amorphous solids at ambient temperature, which may be spherical or non-spherical, have different surface characteristics and coatings, and come in different sizes depending on the initial materials and preparation conditions used in their fabrication.\n• Silver nanoparticles are used as antimicrobial agents in foods and food packaging materials.\n• Zinc oxide nanoparticles may be used as a source of zinc and in food packaging as antimicrobial agents to prevent contamination of foods and as ultraviolet light absorbers.\n• Iron oxide nanoparticles are utilized in foods as colorants or sources of bioavailable iron and come in different sizes, shapes, and crystalline forms.\n• Titanium dioxide nanoparticles are used as functional ingredients in certain foods to provide characteristic optical properties such as increased lightness and brightness.\n• Silicon dioxide nanoparticles are added to certain powdered foods as anticaking agents to enhance flow properties, e.g., salts, icing sugar, spices, dried milk, and dry mixes.\n• Lipid nanoparticles are widely present within many commercial food products, like beverage emulsions, such as soft drinks, fortified waters, fruit juices, and dairy drinks, contain small oil droplets dispersed in water.\n• Protein nanoparticles are the casein micelles found in bovine milk and other dairy products, which are small clusters of casein molecules and calcium phosphate ions.\n• Carbohydrate nanoparticles are typically assembled from digestible or indigestible polysaccharides, such as starch, cellulose, alginate, carrageenan, pectin, and xanthan and they may be indigestible within the upper gastrointestinal tract (GIT).\n\nSome organic substances used to fabricate food nanoparticles (such as dietary fibers and mineral oils) may not be digested in the upper GIT. Inorganic nanoparticles are also not digested in the GIT. Any nanoparticles that are not digested or absorbed in the upper GIT will reach the lower GIT where they may alter the microbiome in a negative way. The ability of inorganic nanoparticles to produce toxicity is often associated with their chemical reactivity, which depends on their composition. For example, some inorganic nanoparticles dissolve and release ions that promote undesirable chemical or biochemical reactions (e.g., silver nanoparticles).\n\nIngested nanoparticles accumulate in numerous tissues. These nanoparticles travel across the mucus layer and are then absorbed by active or passive transport mechanisms. After they have been absorbed into the cells, they accumulate within the cells. The accumulation of nanoparticles within specific tissues may lead to long-term problems if they exhibit toxic effects above a certain accumulation threshold. This mechanism of action is likely to be most important for inorganic nanoparticles that are bio-persistent (not normally digested or metabolized in GIT).\n\nNanoparticles may produce toxicity in cells through a variety of different mechanisms. One of the most important factors contributing to the toxicity of inorganic nanoparticles is their ability to generate reactive oxygen species (ROS), such as singlet oxygen, superoxide, hydrogen peroxide and hydroxyl radicals. These ROS may then cause damage to cell membranes, organelles, and the nucleus by interacting with lipids, proteins, or nucleic acids. As a result, many biochemical functions required to maintain cell viability, such as ATP production, DNA replication, and gene expression, may be adversely affected. A number of studies have reported the ability of inorganic nanoparticles to increase the generation of ROS in cells and to produce cytotoxicity.\n\nThe ability of nanoparticles to greatly increase the oral bioavailability of hydrophobic substances does have adverse health effects by promoting the uptake of undesirable non-polar substances in foods, such as certain pesticides (glyphosates, etc.) and hormones. For example, a food product that contains lipid nanoparticles (such as a beverage, sauce, dressing, or cream) may increase the bioavailability of hydrophobic pesticides on fruits or vegetables consumed with them.\n\nFrom: Materials Today Connecting the Materials Community, March 19, 2020, New graphene-based material self-assembles into vascular structures\n\nAn international team of scientists, led by Alvaro Mata at the University of Nottingham and Queen Mary University London in the UK, has discovered a new material that can be 3D printed to create tissue-like vascular structures. In a paper in Nature Communications, the scientists report developing a way to 3D print graphene oxide with a protein that can organize into tubular structures that replicate some of the properties of vascular tissue.\n\n“This work offers opportunities in bio-fabrication by enabling simultaneous top-down 3D bioprinting and bottom-up self-assembly of synthetic and biological components in an orderly manner from the nanoscale,” said Mata. “Here, we are bio-fabricating micro-scale capillary-like fluidic structures that are compatible with cells, exhibit physiologically relevant properties, and have the capacity to withstand flow. This could enable the recreation of vasculature in the lab and have implications in the development of safer and more efficient drugs, meaning treatments could potentially reach patients much more quickly.”\n\nSelf-assembly is the process by which multiple components spontaneously organize into larger, well-defined structures. Biological systems rely on this process to controllably assemble molecular building blocks into complex and functional materials exhibiting remarkable properties such as the capacity to grow, replicate and perform robust functions. The new biomaterial is produced by the self-assembly of a protein with graphene oxide. This self-assembly process allows the flexible regions of the protein to order and conform to the graphene oxide, generating a strong interaction between them. By controlling the way in which the two components are mixed, it is possible to guide their assembly at multiple scales in the presence of cells to produce complex robust structures.\n\nHollow tubular structures of molecular dimensions perform diverse biological functions in nature. Examples include scaffolding and packaging roles played by cytoskeletal microtubules and viral coat proteins, respectively, as well as the chemical transport and screening activities of membrane channels. In the preparation of such tubular assemblies, biological systems make extensive use of self-assembling and self-organizing strategies. Owing to numerous potential applications in areas such as chemistry, biology, and materials science considerable effort has recently been devoted to preparation of artificial nanotubular structures. This article reviews design principles and the preparation of synthetic organic nanotubes, with special emphasis on noncovalent processes such as self-assembly and self-organization.\n\nFrom: Nature Reviews Materials, Materials design by synthetic biology, Tzu-Chieh Tang, Bolin An, Yuanyuan Huang, Sangita Vasikaran, Xiaoyu Jiang\n\nSynthetic biology applies genetic tools to engineer living cells and organisms analogous to the programming of machines. In materials synthetic biology, engineering principles from synthetic biology and materials science are integrated to redesign living systems as dynamic and responsive materials with emerging and programmable functionalities. In this Review, we discuss synthetic-biology tools, including genetic circuits, model organisms and design parameters, which can be applied for the construction of smart living materials. We investigate non-living and living self-organizing multifunctional materials, such as intracellular structures and engineered biofilms, and examine the design and applications of hybrid living materials, including living sensors, therapeutics and electronics, as well as energy-conversion materials and living building materials. Finally, we consider prospects and challenges of programmable living materials and identify potential future applications.\n\nFrom: MIT Libraries, Towards engineering living functional materials, 2021, Tang, Tzu-Chieh,Ph. D.Massachusetts Institute of Technology\n\nThe field of engineered living materials (ELMs) aims to recapitulate the remarkable properties of natural biology to create novel, growable, multifunctional materials using genetically engineered organisms. Most relevant pioneering work was created using nano- to microscale biofilm [GO], which has rather small yields and usually requires costly modification. Second, releasing genetically modified microorganisms (GMMs) into the field for food, water, or agricultural applications is often considered risky due to the uncertainty of wild-type organisms acquiring undesirable traits, such as antibiotic resistance, from the GMMs. A significant effort in addressing these unmet needs is called for. This Thesis starts with an introduction of genetic circuits and an in-depth review of the current trends in materials synthetic biology, which includes two major categories of ELMs: self-organizing functional materials and hybrid living materials. The following chapters describe the technologies developed to achieve high scalability and safe deployment of ELMs in these two categories and living devices suitable for real-world applications.\n\nFrom: Biomedical Research International, Volume 2021 |Article ID 5518999, Synthesis and Toxicity of Graphene Oxide Nanoparticles: A Literature Review of In Vitro and In Vivo Studies, Asmaa Rhazouani, Halima Gamrani , Mounir El Achaby , Khalid Aziz, Lhoucine Gebrati, Md Sahab Uddin, and Faissal AZIZ, https://doi.org/10.1155/2021/5518999\n\nNanomaterials have been widely used in many fields in the last decades, including electronics, biomedicine, cosmetics, food processing, buildings, and aeronautics. The application of these nanomaterials in the medical field could improve diagnosis, treatment, and prevention techniques. Graphene oxide (GO), an oxidized derivative of graphene, is currently used in biotechnology and medicine for cancer treatment, drug delivery, and cellular imaging. Also, GO is characterized by various physicochemical properties, including nanoscale size, high surface area, and electrical charge. However, the toxic effect of GO on living cells and organs is a limiting factor that limits its use in the medical field. Recently, numerous studies have evaluated the biocompatibility and toxicity of GO in vivo and in vitro. In general, the severity of this nanomaterial’s toxic effects varies according to the administration route, the dose to be administered, the method of GO synthesis, and its physicochemical properties.\n\nNanoparticles are widely used in electronics, aeronautics, energy, agriculture, cosmetics, medicine, textile production, and many other fields. They are currently used to administer drugs, proteins, genes, vaccines, polypeptides, and nucleic acids. GO is a nanomaterial that has been known for more than 150 years and is used in many applications. In recent years, graphene has been exploited in the medical field, particularly for DNA sequencing, the development of biosensors, and cell differentiation and growth. As graphene is insoluble in water, its applications are limited to passive platforms for detection and cell work. Its functional derivative GO has unique properties that make it more effective for biomedical applications. It is characterized by its ability to disperse in many solvents, facilitating its handling. In addition, GO is used to administer anticancer drugs in biological cells, aptamers for ATP probing in epithelial cells, and gene delivery. These nanomaterials have a large surface area and can maintain drugs’ stability without altering the biological activity, much more than other nanomaterials.\n\nGO is characterized by properties that make it attractive in other areas such as sensors and energy storage. As applications increase, exposure to GO increases across populations. These include exposures during nanomaterial manufacturing and biomedical treatment. GO is involved in many applications, but there is one main factor limiting “its toxicity” limiting its use. Researchers are often faced with the problem of balancing the positive therapeutic effects of GO with the side effects associated with its toxicity\n\nFrom: Acta Biomaterialia, Volume 112, August 2020, Pages 14-28, Recent progress of graphene oxide as a potential vaccine carrier and adjuvant, WanjunCaoab, LinHea, Weidong Caob, Xiaobing HuangaKun, Jiac Jingying Dai\n\nAdjuvants and carriers have been appropriately added to the vaccine formulation to improve the immunogenicity of the antigen and induce long-lasting immunity. Graphene oxide (GO), widely employed for the delivery of biomolecules, excels in loading and delivering antigen and shows the potentiality of activating the immune system. However, GO aggregates in biological liquid [blood clots] and induces cell death, and it also exhibits poor bio-solubility and bio-compatibility. To address these limitations, various surface modification protocols have been employed to integrate aqueous compatible substances with GO to effectively improve its biocompatibility. More importantly, these modifications render functionalized-GO with superior properties as both carriers and adjuvants. Due to its unique physicochemical properties, graphene oxide is widely employed in medicine for purposes of photothermal treatment of cancer, drug delivery, antibacterial therapy, and medical imaging. Our work describes the surface modification of graphene oxide and for the first time summarizes that functionalized graphene oxide serves as a vaccine carrier and shows significant adjuvant activity in activating cellular and humoral immunity.\n\nPrecision medicine informs us that graphene oxide has been studied for its promising uses in a wide variety of nanomedical applications including tissue engineering, cancer treatment, medical imaging, and drug delivery. Its physiochemical properties allow for a structure to regulate the behavior of stem cells, with the potential to assist in the intracellular delivery of DNA, growth factors, and synthetic proteins that could allow for the repair and regeneration of muscle tissue. Due to its unique behavior in biological environments, graphene oxide has also been proposed as a novel material in early cancer diagnosis. It has also been explored for its uses in vaccines and immunotherapy, including as a dual-use adjuvant and carrier of biomedical materials.\n\nSeveral typical mechanisms underlying graphene oxide nanomaterial’s toxicity have been revealed, for instance, physical destruction, oxidative stress, DNA damage, inflammatory response, apoptosis, autophagy, and necrosis. In these mechanisms, toll-like receptors (TLR), transforming growth factor-beta (TGF-β) and tumor necrosis factor-alpha (TNF-α) dependent-pathways are involved in the signaling pathway network, and oxidative stress plays a crucial role in these pathways. Many experiments have shown that graphene oxide nanomaterials have toxic side effects in many biological applications. According to the USA FDA, graphene, graphene oxide, and reduced graphene oxide elicit toxic effects both in vitro and in vivo. Graphene-family nanomaterials (GFN) are not approved by the USA FDA for human consumption.\n\nFrom: Polymer Journal, Volume 52, pages 823-837, May 8, 2020, Graphene oxide-incorporated hydrogels for biomedical applications, Jongdarm Yi, Goeun Choe, Junggeon Park Young Lee\n\nGraphene and graphene derivatives (e.g., graphene oxide) have been incorporated into hydrogels to improve the properties (e.g., mechanical strength) of conventional hydrogels and/or develop new functions (e.g., electrical conductivity and drug loading/delivery). Unique molecular interactions between graphene derivatives and various small or macromolecules enable the fabrication of various functional hydrogels appropriate for different biomedical applications. In this mini-review, we highlight the recent progress in GO-incorporated hydrogels for biomedical applications while focusing on their specific uses as mechanically strong materials, electrically conductive scaffolds/electrodes, and high-performance drug delivery vehicles.\n\nFrom: Nanoscale, Functionalized graphene oxide serves as a novel vaccine nano-adjuvant for robust stimulation of cellular immunity, Ligeng Xu, Jian Xiang, Ye Liu, Jun Xu, Yinchan Luo, Liangzhu Feng, Zhuang Liu and Rui Peng\n\nBenefiting from their unique physicochemical properties, graphene derivatives have attracted great attention in biomedicine. In this study, we carefully engineered graphene oxide (GO) as a vaccine adjuvant for immunotherapy using urease B (Ure B) as the model antigen. Our work not only presents a novel, highly effective GO-based vaccine nano-adjuvant, but also highlights the critical roles of surface chemistry for the rational design of nano-adjuvants.", "opengraph": {"type": "article", "title": "Death via Graphene Oxide Nanoparticles", "url": "https://aim4truth.org/2022/08/28/death-via-graphene-oxide-nano-particles/", "description": "Is there a diabolical plan behind superparamagnetic graphene/iron oxide nano-particles that are being found in the bloodstreams of people who have received the Covid vaccine or died from Sudden Adu…", "article:published_time": "2022-08-28T19:05:28+00:00", "article:modified_time": "2022-09-03T20:32:23+00:00", "site_name": "American Intelligence Media", "image": "https://i0.wp.com/aim4truth.org/wp-content/uploads/2022/08/electric-body.jpg?fit=1050%2C590&ssl=1", "image:width": "1050", "image:height": "590", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "980", "height": "552", "embed_code": "<iframe loading=\"lazy\" class=\"youtube-player\" width=\"980\" height=\"552\" src=\"https://www.youtube.com/embed/DJsjSyv_2xY?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/DJsjSyv_2xY?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}], "links": ["https://www.brighteon.com/3ce757eb-93b1-4c5b-b247-be294b43738d", "https://www.brighteon.com/3ce757eb-93b1-4c5b-b247-be294b43738d", "https://doi.org/10.1155/2021/5518999", "https://youtu.be/DJsjSyv_2xY", "https://www.bitchute.com/video/WF46Q20yPOgA/"], "authors": [], "publish_date": "2022-08-28T19:05:28+00:00"}