{"result_id": "024049", "URL": "https://aim4truth.org/2020/04/30/virus-lies-and-vaccine-wars/", "timestamp": "2023-04-25 12:02:20 CEST+0200", "meta": {"description": "The CDC and NIH are lying to us. There are no known effective vaccines for viruses -- they simply don’t exist, and yet all of the CDC’s and the NIH’s time and money is spent on creating new, and horribly expensive, vaccines for the “Vaccine Wars” – which are actively raging in your bloodstream as…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/aim4truth.org/wp-content/uploads/2017/02/cropped-aim-4-truth-png.png?fit=32%2C32&ssl=1", "canonical": "https://aim4truth.org/2020/04/30/virus-lies-and-vaccine-wars/", "encoding": "UTF-8"}, "image": null, "domain": "aim4truth.org", "title": "Virus Lies and Vaccine Wars", "cleaned_text": "The CDC and NIH are lying to us. There are no known effective vaccines for viruses — they simply don’t exist, and yet all of the CDC’s and the NIH’s time and money is spent on creating new, and horribly expensive, vaccines for the “Vaccine Wars” – which are actively raging in your bloodstream as you read this article. Both “big pharma” institutions (CDC/NIH) ignore the fact that vaccines don’t stop viruses, they create and enhance viruses and subsequent illnesses.\n\nThese anti-health organizations don’t allow any research on treatments that have been shown effective against viruses in many other countries. Any of the treatments listed below that have a drug name in parenthesis after its name is an approved treatment in many, many other nations,– except the CDC/NIH controlled United Stated of America.\n\nSome of the most effective and promising anti-viral drugs:\n\nPleconaril, Remdesivir, Pyrazolo-pyrimidine, Oseltamivir (Tamiflu), Zanamivir (Relenza), Abacavir for HIV, Amprenavir (Agenerase) for HIV, Amantadine, Rimantadine, Galidesivir, Interferon, Reverse Transcriptase Inhibitor, Cidofovir, Combivir, Daclatasvir (Daklinza), Darunavir, Dolutegravir, Acyclovir (Aciclovir) for herpes/Chicken Pox, Atazanavir, Adefovir for Hepatitis B, Balavir, Baloxavir marboxil (Xofluza), Boceprevir (Victrelis), Amantadine for influenza, Doravirine (Pifeltro), Elvitegravir, Entecavir, Etravirine (Intelence), Famciclovir, Fosamprenavir, Ganciclovir (Cytovene), Ibalizumab (Trogarzo), Imunovir, Indinavir, Letermovir (Prevymis), Lopinavir, Nelfinavir, Nexavir, Norvir, Penciclovir, Peramivir (Rapivab), Raltegravir, Rilpivirine (Edurant), Ritonavir, Saquinavir, Simeprevir (Olysio), Sofosbuvir, Telaprevir, Trizivir, Telbivudine (Tyzeka), Tenofovir alafenamide, Tenofovir disoproxil, Tenofovir, Tipranavir, Valaciclovir (Valtrex), Valganciclovir, Zanamivir (Relenza) Ampligen, Arbidol, Atripla, Biktarvy, Cobicistat (Tybost), Delavirdine, Descovy, Didanosine, Docosanol, Ecoliever, Edoxudine, Efavirenz, Emtricitabine, Enfuvirtide, Fomivirsen, Foscarnet, Fosfonet, Ibacitabine, Idoxuridine, Imiquimod, Inosine, Interferon type I, Interferon type II, Interferon type III, Lamivudine, Loviride, Maraviroc, Methisazone, Moroxydine, Nevirapine, Nitazoxanide, Peginterferon alfa-2a, Peginterferon alfa-2b, Pleconaril, Podophyllotoxin, Pyramidine, Ribavirin, Rimantadine, Stavudine, Trifluridine, Tromantadine, Truvada, Vicriviroc, Vidarabine, Viramidine, Zalcitabine, Zidovudine, Capsid-binding agents: pleconaril, vapendavir and pirodavir, 3C protease inhibitors: rupintrivir, Soluble ICAM-1: tremacamra\n\nOne might ask: “Then, it is not criminal for the CDC/NIH to ignore effective treatments against viruses instead of pursuing the dead-end, bad-science of the theory that vaccines stop viruses?” The answer is simply – yes it is, and the culprits who promote these lies that have killed many people need to be rounded up, convicted, and jailed. This is a false flag operation of corrupt doctors, politicians, educators, government bureaucrats, and criminals to sell us snake oil under the guise of vaccines that promise to “end all illnesses.” Vaccines actually give you the virus that they advertise will stop the virus — and then the virus spreads everywhere instead of eliminating it.\n\nThis lie is so “large” that the British propaganda machine that drives the United Nations has worked non-stop to convince the entire world that vaccines are the only answer to end the assault of viruses upon humanity. They have been conducting this war against humanity to depopulate the world, that is why after 140 years of the “LIE of VACCINES” there are still more active viruses killing people today than back then and many of those “killer viruses” are laboratory-made and enhanced to be more virulent and deadly. Trillions of dollars have been spent on the elusive dreams of “Vaccine X” that will inoculate every human with a vaccine that stops all viruses.\n\nThis is bad-science that tries to mimic the ideas of homeopathy, but in an allopathic form which does not work. This “vaccine scam” simply enriches the liars and murderers at the WHO/CDC/NIH who pocket funds donated by Bill Gates, the Clintons, the Queen of England, the Wellcome Trust, the Carlyle Group, the Pirbright Institute and many other fake charities and corporate donars that support this poorly constructed lie.\n\nJust as the Food and Drug Administration (FDA) has no laboratory to test any of the drugs or food that they “approve”, so too the NIH and CDC farm-out their big money for research done by pharmaceutical companies, universities, and private corporations. The NIH and CDC have a small handful of good and useful things they have accomplished in their many years of controlling America and the world. And even those things focused on vaccines, not effective treatments. We must also consider the powerful global domination of health issues, depopulation, food and agriculture, and other “development” issues that are controlled by the United Nations World Health Organization (plus the World Bank, UNICEF, and many other UN organizations).\n\nThe WHO essentially tells the CDC/NIH (and the world) what to do. The British rule the world from behind the scenes and that is why the VACCINE LIE started in England with Burroughs Wellcome & Co. when “pills” were first offered. Over the 200 year plan to dominate the world, the myth of creating health through “pills” and “shots” became the most powerful bioweapon on the earth. It soon supplanted war as the greatest money-maker for Warlord Bankers and the corporate aristocracy.\n\nRecently, when President Trump accidentally called out the evil, fascist, murderer Dr. Anthony Fauci of the NIH for never studying Remdesivir as an effective treatment for COVID-19 in the 40 years it has been used to stop viruses, and was recently used in China and South Korea to stop the viral spread of COVID-19, Fauci said it was not effective and would not be studied by the NIH. Fauci works for Bill Gates, the Clintons, the Queen’s Privy council, and the globalist medical thugs at the WHO and they don’t want a treatment or a cure, just their vaccine scam. We now see that numerous studies have bee done on Remdesivir and it has been found effective in more than 90% of the cases. Trump was right and Fauci was wrong.\n\nHere is a little information on Gilead’s drug Remdesivir; which, by the way Fauci helped create in 1986 when he used dying AIDS HIV patients as guinea pigs to implant viruses in their intestines to create cell protein called virions. Mind you, Fauci and the entire NIH, knows about these virions (dozens listed above) and the drugs that have been developed from them since that time. Fauci, and the CDC/WHO, ignore the effective treatment for AIDS HIV and promote anti-AIDS drugs that are the most expensive drugs in history – good for Big Pharma’s business model. Virions are treatment and not a vaccine, so they are not allowed to be studied in America or anywhere else the Vaccine Warlords can stop research from finding an effective answer to viruses – virions and the other treatments.\n\nA few months ago, Dr. Fauci and the NIH announced they were going to have a vaccine for AIDS. Then, months later, he announced it was a complete failure and they were going back to the drawing board – after the NIH had already received hundreds of billions to find a cure for AIDS. Actually, the NIH/CDC/WHO have never found a CURE for anything at all. They have spent OUR money to create auto-immune reactors, retro-viruses, enhanced animal/human viruses, synthetic viruses, DNA recombined viruses, etc., etc., etc.\n\nWe provide below a summary of what Remdesivir, and treatments like them, are all about. These are true healers of viruses that the NIH refuses to acknowledge or allowed to be studied, thus the FDA will not approve any of these treatments.\n\nRemdesivir is an antiviral medication developed by the American biopharmaceutical company Gilead Sciences. It is a nucleotide analog, specifically an adenosine analogue, which inserts into viral RNA chains, causing their premature termination. It is being studied during 2020 as a possible post-infection treatment for COVID-19. Remdesivir was created and developed by Gilead Sciences as a treatment for Ebola virus disease and Marburg virus infections. Gilead Sciences subsequently discovered that remdesivir had antiviral activity in vitro against multiple filo-, pneumo-, paramyxo-, and corona- viruses.\n\nPleconaril (Chemical Formula: C18H18F3N3O3) is a capsid inhibitor used previously to treat enterovirus infections. Pleconaril is effective in inhibiting replication. Pleconaril leads to stiffening of the capsid structure, preventing RNA release into the cell. Pleconaril has been used as treatment on a “compassionate use” basis in neonates and immunodeficient patients with severe enterovirus infections.\n\nPleconaril is an antiviral drug from viral capsid inhibitor class, manufactured by Schering-Plough and intended for the prevention of acute asthma exacerbations and common cold symptoms in asthmatic patients who have had exposure to picornavirus. It acts by inhibiting viral replication. The use of pleconaril has not gained approval by the U.S. Food and Drug Administration (FDA) due to the fact that it has been found to induce CYP3A enzyme activity, therefore increasing the risk for serious drug interactions.\n\nPleconaril binds to a hydrophobic pocket in viral protein 1, the major protein which makes up the capsid (shell) of picornaviruses. This renders the viral capsid rigid and compressed and prevents the uncoating of its RNA. As a result, the virus is stopped from attaching to the host cell and causing infection.\n\nPleconaril inhibits viral replication by binding to a hydrophobic pocket on the viral capsid. In vitro activity it is effective against almost all commonly isolated enteroviruses and 90% of rhinovirus clinical isolates.\n\nPyrazolo[1,5-a]pyrimidine – pyrazolo[1,5-a]pyrimidine is the basis for a class of sedative and anxiolytic drugs related in its effects to benzodiazepines. Most of the drugs from this class marketed to date are intended to induce sleep, and are prescribed for people suffering insomnia, however some newer compounds produce anxiolytic effects with relatively little sedation and are being developed for use as non-sedating anti-anxiety drugs and antiviral treatments. They include: Zaleplon (Sonata), Indiplon, Ocinaplon and Lorediplon.\n\nSee the article: Medicinal attributes of pyrazolo-pyrimidine based scaffold derivatives targeting kinases as anticancer agents\n\nBelow we provide two articles that demonstrate that many adult illnesses are generated by childhood vaccines that were laced with poisons, cancers, viruses, retro-viruses and a plethora of other evil contents that clearly show that vaccines are weapons of biological warfare being waged against the bloodstream of humanity. Vaccines are experiments in planting the manipulated DNA of animal viruses into human DNA.\n\nThis is simply biowarfare. Research demonstrated that if a child gets a strong enterovirus (see Appendix) while their immune system is still developing, it could permanently damage organs like the pancreas or heart. Some vaccines have been found to directly attack the pancreas’ beta cells that produce insulin. Thus, a vaccine that is targeting diabetes is being injected into most Americans during childhood.\n\nDoctors are complicit, even though they are trained (brain-washed) into believing the “Vaccine Theory.” No scientific theory lasts long, that is why Gates and the Vaccine Industry are hell-bent on hiding treatments and promoting new vaccines. The Vaccine Industry drives American medical demands, which comprises the most lucrative industry in the USA.\n\nMake no mistake about it, these evil Vaccine Warlords planned this depopulation war-strategy and they are sure to have their cupboards well-stocked with virion treatments in case they, or their friends, happen to get the virus. They also know that there are many, many other natural treatments for viruses that are frowned upon by allopathic doctors who run our government medical institutions like the FDA.\n\nPlease be forewarned that the articles below will “red pill” you if you have not been aware of this diabolical plot to control the world’s population, its health, and its quality of life.\n\n“A significant number of viruses have been associated with type 1 diabetes, including enteroviruses such as Coxsackievirus B (CVB), but also rotavirus, mumps virus, and cytomegalovirus. Rubella virus has been suggested to cause type 1 diabetes, but so far only congenital rubella syndrome has conclusively been associated with the disease. The prime viral candidates for causing type 1 diabetes in humans are enteroviruses.\n\nCoxsackievirus B4 is the most common enteroviral strain found in pre-diabetic and diabetic individuals. CVB RNA has been detected in blood from patients at the onset or during the course of type 1 diabetes. Cellular immune responses to CVB antigens were found to be enhanced in type 1 diabetic patients after the onset of the disease. One CVB4 strain was isolated from the pancreas of a deceased diabetic child, passaged through murine β-cells, and found to induce diabetes after inoculation in mice.”\n\nType 1 Diabetes May Be Triggered By a Common Virus\n\nStudy Suggests Researchers found that kids exposed to enteroviruses are more likely to develop the autoimmune disease, by Amanda MacMillan, Health, January 10, 2017\n\n“Enteroviruses are a group of viruses that usually cause mild illnesses, like the common cold. Certain strains of enterovirus – such as the poliovirus, enterovirus-D68, and coxsackievirus (also known as hand, foot, and mouth disease) – can cause more serious symptoms.\n\nPrevious research has also suggested that children exposed to enteroviruses are more likely to develop type 1 diabetes, an autoimmune disease that damages insulin-producing cells in the pancreas, than those who have not.”.\n\nIf doctor know this information, that vaccines cause diabetes, why would they EVER give out another vaccine shot?\n\nAnd, we could add hundreds of other studies showing that vaccines create cancer, heart disease, liver disease, and many other diseases. Doctors everywhere knows this but only doctors outside of America talk about it. Dozens of naturopathic, homeopathic, and chiropractors who have spoken out publicly about this Vaccine Lie have been murdered, shot down in the street in numerous cases.\n\nIndustrial espionage used by Big Pharma is so powerful that recently the couple who owned one of the largest drug companies hung themselves in their own house after it was discovered that they had purposely manufacturer drugs that kill instead of heal.\n\nBillions of dollars in lawsuits against Big Pharma don’t slow its mission down at all. Paying billions in fines is simply “the price of doing business.” Killing their customers is standard operating procedure in the drugs business. Selling snake oil (vaccines) is their only concern.\n\nThe following list of drug warlords, fascist vaccinators, original progenitors of viral bioweaponry, depopulation eugenicists, murderers, propagandists, and enemies of humanity are but a short (but powerful) list of the Generals, Field Marshalls, Viscounts and Admirals who lead the all-out war against the human bloodstream. We provide this information to brief you on the enemy and their tactics and strategy. We can win the war only if we know our enemy and keep them close.\n\nFor a complete expose on Big Pharma and companies who benefit from poison vaccines can be found in one of our prior Anonymous Patriot Intelligence Reports. See here:\n\nWorld Health Organization – the only bragging points the WHO can make are: the eradication of smallpox [lie – it was used to spread AIDS-HIV], the near-eradication of polio [lie – Gates’ Polio vaccine has paralyzed a half million people in India], and the development of an Ebola vaccine [lie – there is no effective vaccine for Ebola]. Its current priorities include communicable diseases [spreading them], particularly HIV/AIDS [inoculated most of Africa with the virus], Ebola [laboratory created], malaria [no cure] and tuberculosis [no cure or effective treatment]; non-communicable diseases such as heart disease and cancer [created thru vaccines]; healthy diet [promotes poisons like glyphosate], nutrition, and food security. Essentially, the WHO has never helped prevent or end any disease, but actually promotes them through forced vaccines full of poisons and man-made viruses.\n\nThe WHO relies on member states and private donors for funding. In 2018, the WHO had a budget of over $4.2 billion from the 194 member nations assessed and voluntary contributions, with the lion’s share coming from a “tax” on America.\n\nIn 2007, the WHO organized work on pandemic influenza vaccine development through clinical trials in collaboration with many experts and health officials. A pandemic involving the H1N1 influenza virus was declared in April 2009. Critics claimed the WHO had exaggerated the danger, spreading “fear and confusion” rather than “immediate information” Approximately 30 million people contracted the virus with over 17,000 in America deaths. The WHO did nothing to examine any “treatments” for the Swine Flu or any other flu to date.\n\nFollowing the 2014 Ebola outbreak in West Africa, the organization was heavily criticized for its bureaucracy, insufficient financing, regional structure, and staffing profile. It did not contain, understand or help treat the virus victims.\n\nThe WHO sub-department, the International Agency for Research on Cancer (IARC), has been criticized for the way it analyses the tendency of certain substances and activities to cause cancer and for having a politically motivated bias when it selects studies for its analysis. The WHO and the CDC have not even addressed tobacco deaths, one of the largest killers in the world. The WHO simply protects British American Tobacco (BAT) and does nothing to solve the problem.\n\nAccording to The Associated Press, the WHO routinely spends about $200 million a year on travel expenses, more than it spends to tackle mental health problems, HIV/AIDS, Tuberculosis and Malaria combined.\n\nNational Institutes for Health – As of 2019, the NIH annual budget was US $39 billion. The NIH comprises 27 separate institutes and centers of different biomedical disciplines and is responsible for many scientific accomplishments, including the discovery of fluoride to prevent tooth decay [brain poison], the use of lithium to manage bipolar disorder [psych-drug addiction], and the creation of vaccines against hepatitis[spread AIDS HIV], Haemophilus influenzae (HIB) [man-made virus], and human papillomavirus (HPV)[caused sterility and death].\n\nSince the 1930s, the National Institutes of Health has invested close to $900 billion in the basic and applied research that formed both the pharmaceutical and biotechnology sectors [Big Pharma slave]. Despite taxpayers’ crucial investment, U.S. consumers are increasingly paying more for their prescription drugs [which only work less than 50% of the time]. Taxpayers essentially pay for Big Pharma. Over US $1 Trillion per year is spent on pharmaceutical drugs.\n\nA 2018 study on the National Institute of Health’s (NIH) financial contributions to new drug approvals found that the agency contributed to published research associated with every one of the 210 new drugs approved by the Food and Drug Administration from 2010–2016. More than $100 billion in NIH funding went toward research that contributed directly or indirectly to the 210 drugs approved during that six-year period. The NIH Research Project Grant (R01) – which supports health-related research – was by far the most common kind of grant used to fund the science that supported the new drugs. In all, NIH gave out nearly 118,000 R01 grants related to those drugs from 2010 to 2016. Not one of them was a “treatment” for a virus – just vaccines.\n\nIn the1980s, Congress enacted a series of laws designed to speed up tax-supported research on new products. One of these laws, the Bayh-Dole Act of 1980, enabled universities and small businesses to patent and/or license any discoveries from their tax-funded medical research sponsored by the National Institutes of Health (NIH). Prior to this law, taxpayer-financed discoveries belonged to the public domain (i.e., new drugs were available to any company that wanted them). As the result of this legislation, universities that carried out NIH-sponsored work could charge royalties, providing income for non-profit institutions. Legislation was also passed that allowed the NIH to enter into deals with drug companies, transferring NIH discoveries directly to industry, thus becoming a corrupt arm of Big Pharma.\n\nBurroughs Wellcome & Co. – American pharmaceutical magnates Henry Wellcome and Silas Burroughs, founded Burroughs-Wellcome & Co. in England in 1880. This pharmaceutical company was one of the four large organizations that eventually merged to become GlaxoSmithKline.\n\nAfter Silas Burroughs died in 1895, Henry Wellcome expanded the company into several continents and numerous countries, including the United States. In 1924, Wellcome consolidated all of the company’s holdings under a corporate umbrella that he named The Wellcome Foundation Ltd. When he died in 1936, his will vested all of the corporate shares in a new charity entity – the Wellcome Trust. The Trust’s purpose was to use profits from the Wellcome Foundation to advance research in medicine and medical history. In 1993 a $400 million gift from the trustees allowed it to become an independent entity with no ties to the Wellcome Foundation or to GlaxoSmithKline [supposedly], which by 2000 had purchased all shares of Wellcome Foundation.\n\nBurroughs Wellcome & Co. funded scientists who developed anti-toxins for tetanus, diphtheria and gas gangrene. They also isolated histamine, leading to antihistamine production, and standardized insulin and other medicines. At the company’s research labs in the USA, they developed the first leukemia drug and immune system suppressants for organ transplants, developed acyclovir which stops the herpes virus replicating, and AZT, the first drug approved to treat HIV.\n\nBy 1985 the Wellcome Foundation was worth £1 billion. This led to a huge increase in the Wellcome Trust’s scientific research funding. The Trust’s grant allocation then was around £26.5m a year. In 1995, the Wellcome Trust sold most of the remaining interest in Wellcome plc to Glaxo plc. This created Glaxo Wellcome plc, which merged with SmithKlineBeecham in 2000 to create GlaxoSmithKline. By selling the shares, the Wellcome Trust’s assets grew from £3.4bn in 1988 to £15bn in 2000. Our average annual charitable spend grew from £28m in the 1980s to £650m in 2007.\n\nThe Burroughs Wellcome Fund – Founded in 1955 as an extension of the England-based Wellcome Trust. Since 1970, The Burroughs Wellcome Fund is an American non-profit medical research organization that provides funding for biomedical research headquartered in North Carolina’s Research Triangle Park. The Fund has granted more than $40 million each year to research focusing on infectious disease, biomedical science, and other health-related fields. This BSL-P4 laboratory shares all its data with the Wu Han IV laboratory where the COVID-19 virus was created and experimentally released on the yearly Wu Han celebration dinner that drew 40,000 (largest ever) people from around the world in 2019.\n\nThe Pirbright Institute (UK) – The Pirbright Institute (formerly the Institute for Animal Health) is a research institute in Surrey, England, dedicated to the study of infectious diseases. It forms part of the UK government’s Biotechnology and Biological Sciences Research Council (BBSRC). It began in 1914 to test cows for tuberculosis. Compton was established by the Agricultural Research Council in 1937. Pirbright became a research institute in 1939 and Compton in 1942. In 1963 Pirbright became the Animal Virus Research Institute and Compton became the Institute for Research on Animal Diseases. In 1987, Compton, Houghton and Pirbright became the Institute for Animal Health, being funded by BBSRC.\n\nThe work previously carried out at Compton has either moved out to the university sector, ended or has been transferred to the Pirbright site. The Compton site currently carries out work on endemic animal diseases including some Avian Viruses and a small amount of Bovine Immunology whilst Pirbright works on exotic animal diseases (usually caused by virus outbreaks). Pirbright has National and International Reference Laboratories of diseases. It is one of the world’s bio-safety level 4 laboratories (commonly referred to as “P4” or BSL-P4).\n\nInitially, 25% of its income comes from a core grant from the BBSRC of around £11m. Around 50% comes from research grants from related government organizations, such as Department for Environment, Food and Rural Affairs (DEFRA), or industry and charities (such as the Wellcome Trust, Gates Foundation, Queen Elizabeth, Carlyle Group, WB, Unicef, WEF, DARPA, WB, CDC, NIH, etc.). The remaining 25% comes from direct payments for work carried out and their many patents.\n\nThe Pirbright Institute carries out research, diagnostics and surveillance viruses carried by animals, such as foot-and-mouth disease virus (FMDV), African swine fever, bluetongue, lumpy skin disease and avian and swine flu farm animals. Understanding of viruses comes from molecular biology. Essentially, it is a bioweapon laboratory.\n\nMerial Animal Health Institute – Merial is a multinational animal health company. In January 2017, Merial was acquired by Boehringer Ingelheim. In August 1997, Merial started as a joint venture between the animal health subsidiaries of Merck & Co. (MSD AgVet) and Sanofi-Aventis (Rhône-Mérieux). Merial became the animal health division of Sanofi, when Sanofi bought out Merck’s 50% share of the joint venture. On December 30, 2016 Boehringer Ingelheim completed a swap of their OTC business for Sanofi’s animal health business. Merial is now owned by Boehringer Ingelheim and combined with their animal health business, Boehringer Ingelheim Vetmedica, to form Boehringer Ingelheim Animal Health.\n\nMerial produces many products and vaccines for domestic pets, farm animals and wildlife. Merial has about 6,900 employees and is present in more than 150 countries in the world. Their sales in 2015 were about €2.5 billion. Some of Merial’s most popular products are Frontline, Heartgard, NexGard, Ivomec, PureVax and Previcox.\n\nIn October 2009, Merial announced it was investing 70 million US$ at its poultry vaccines plant in Nanchang Hi-tech Development Zone, China. On March 9, 2010, Sanofi-Aventis announced it had exercised an option to combine Merial with Intervet/Schering Plough, the animal health business of Merck. The new joint venture would be equally owned by Merck and Sanofi-Aventis. On March 22, 2011, they announced the mutual termination of their agreement to form a new animal health joint venture.This constant changing of company names is the British standard form of dodging culpability and avoiding all liabilities.\n\nMerial was investigated in connection with a 2007 United Kingdom foot-and-mouth outbreak, after a strain of foot-and-mouth disease sourced from one of their research facilities was found at Pirbright, a farm in Surrey, England, in August 2007. The investigators concluded that the release was due to an escape of live virus from the drainage system.\n\nQinetiQ (pronounced “kinetic”) is a British multinational defense technology company headquartered in Farnborough, Hampshire. It is the UK’s sixth-largest defense contractor and deals in all aspects of war – including bioweapons. It was created in April 2001; prior to this, it had been part of Defense Evaluation and Research Agency (DERA), a now-defunct British government agency like DARPA. A large portion of DERA’s assets, sites, and employees were transferred to QinetiQ, other elements were incorporated into Defense Science and Technology Laboratory (DSTL), which remains in government ownership. QinetiQ has completed numerous acquisitions of defense and technology-related companies, primarily those that are based in the United States, and is a trusted supplier to the US government.\n\nIn late 2002, the Carlyle Group, an American private equity firm, publicly declared its intention to purchase a large stake in QinetiQ. In February 2003, the Carlyle Group completed the acquisition of a 33.8% share for £42 million. Prior to QinetiQ’s flotation years later, ownership of the firm was divided between the UK Ministry of Defense (56%), Carlyle Group (31%) and staff (13%). The Carlyle Group was expected to remain invested in QinetiQ for between three and five years, after which a stock exchange float would take place.\n\nOn 12 January 2006, an announcement was made in Parliament by Dr John Reid, Secretary of State for Defense, regarding the pending flotation of QinetiQ. Reid stated that the Carlyle Group “will continue to retain a significant stake in the company”, and that the government would continue to hold a ‘Golden Share’ to protect the UK’s security and defense interests. Controversy was generated by the very large returns generated for both the Carlyle Group and senior managers at the company; reportedly Sir John Chisholm is speculated to have benefited by over £20 million alone. Lord Moonie, who handled the initial sale, stated in 2006 that the government’s 31% stake should not have been sold when equity markets were languishing in 2002. Controversy also arose around the fact that retail investors were excluded from the initial public offering (IPO) due to QinetiQ’s complexity and that institutional investors would require less complicated marketing and financing.\n\nDuring 2013, reports emerged that Chinese hackers had compromised sensitive military research being performed by QinetiQ. It was claimed that, between 2007 and 2010, QinetiQ’s North American business was the subject of a cyber-attack. The Pentagon has stated that it still entrusts QinetiQ with sensitive defense technology. QinetiQ has partnered with mobile phone network provider Vodafone to support end-to-end internet security services with 5G, again compromising the US/UK Five Eyes Agreement.\n\nQinetiQ North America is known for spy-world connections including secret satellites, drones and software used by U.S. special forces in Afghanistan and the Middle East. Former CIA Director George Tenet was a director of the company from 2006 to 2008 and former Pentagon spy chief Stephen Cambone headed a major division. Its U.K. parent was created as a spinoff of a government weapons laboratory that inspired Q’s lab in Ian Fleming’s James Bond thrillers.\n\nQinetiQ’s espionage expertise didn’t keep Chinese cyber-spies from outwitting the company. In a three-year operation, hackers linked to China’s military infiltrated QinetiQ’s computers and compromised most, if not all, of the company’s research compromising U.S. national security. At one point, they logged into the company’s network by taking advantage of a security flaw identified months earlier and never fixed. There were traces of the intruders in many of their divisions and across most of their product lines. During their multiyear assault on defense contractors, the spies stole several terabytes – equal to hundreds of millions of pages – of documents and data on weapons programs, dwarfing in sheer quantity any theft of Cold War secrets. The QinetiQ hack compromised information vital to U.S. national security, including bioweaponry.\n\nDeeper investigations uncovered more security holes. In 2008, a security team found that QinetiQ’s internal corporate network could be accessed from a Waltham, Massachusetts, parking lot using an unsecured Wi-Fi connection. The same investigation discovered that Russian hackers had been stealing secrets from QinetiQ for more than 2½ years through a secretary’s computer, which they had rigged to send the data directly to a server in the Russian Federation, according to an internal investigation.\n\nIn 2009, the spies spent 251 days raiding at least 151 machines, including laptops and servers, cataloging QinetiQ’s source code and engineering data. The hackers dribbled data out of the network in small packets to avoid detection, managing to get away with 20 gigabytes before they were finally stopped. The stolen cache included highly sensitive military technology and was equivalent in size to 1.3 million pages of documents or more than 3.3 million pages of Microsoft Excel spreadsheets.\n\nThe hackers also may have used QinetiQ to break into the U.S. Army’s Redstone Arsenal through a network shared with QinetiQ’s engineers in nearby Huntsville. A breach of the base, home of the U.S. Army’s Aviation and Missile Command, was linked by military investigators back to QinetiQ, according to a person familiar with the investigation. The security lapses at QinetiQ led to investigations by several federal agencies, including the FBI, Pentagon, and Naval Criminal Investigative Service.\n\nQinetiQ is a British company working in America for the Chinese. That is one of the reasons they are directly connected to China through Vodaphone. QinetiQ had P4 bioweaponry clearance at numerous facilities and was fully aware of the U.S. bioweapon programs.\n\nCenter for Disease Control and Prevention (CDC) – is the leading DHHS health institute in America focusing on disease control and prevention through vaccines and immunization. The CDC has not found a single “treatment” for a single virus – ever. Basically, they are a bioweapon lab that controls 26 vaccine patents ($4.1 billion income per year) and creates contracts with pharmaceutical companies to make design-made, poisonous vaccines that are then manufactured in China. The CDC has never met an infectious disease or virus that it didn’t love – and then compound into a weapon in their laboratories. In 1946, it was called the “Communicable Disease Center” because it focused on spreading communicable diseases from malaria to polio, all the time ignoring “treatments” and patenting vaccines that don’t work and spread the virus. The CDC studied insects more than humans and came up with the brilliant idea of killing malaria with DDT, which poisoned an entire generation of Americans. This is the same logic used to invent vaccine theory – another name for depopulation.\n\nIn May of 1994, the CDC admitted having sent samples of communicable diseases to the Iraqi government from 1984 through 1989 which were subsequently repurposed for biological warfare, including Botulinum toxin, West Nile virus, Yersinia pestis and Dengue fever virus. This policy was common and toxins were sent to many countries for experimental, bioweaponry purposes.\n\nAs of 2013, the CDC’s Biosafety Level 4 laboratories are among the few that exist in the world, and serve as one of only two official repositories of smallpox in the world. The second smallpox repository resides at the State Research Center of Virology and Biotechnology in the Russian Federation. The CDC revealed in 2014 that it had discovered several misplaced smallpox samples and also that lab workers had potentially been infected with anthrax. The Office of Public Health Preparedness was created during the 2001 anthrax attacks shortly after the terrorist attacks of September 11, 2001. Its purpose was to coordinate among the government the response to a range of biological terrorism threats, opening up endless “research” on viruses as bioweapons. At that time, almost all other departments in the Federal government were trumped by the CDC and it was turned into a bioweapon lab focused on viruses, and subsequently, laboratory created vaccines as bioweapons.\n\nThe CDC’s budget for fiscal year 2018 is $11.9 billion. It also makes approximately $4.1 billion on the 26 vaccine patents they own through their private branch called the CDC Foundation. The CDC awards over 85% of its annual budget through grants to big pharmaceutical companies – who have the immunity extended to all of their bioweaponry experiments. The CDC is protected by a special “vaccine court” that gives them complete immunity from prosecution. The CDC has manipulated over 400 viruses, diseases, bacteria, and man-made viruses that often end up in their vaccines.\n\nThe CDC Foundation operates independently from the CDC as a private, nonprofit 501(c)(3) organization incorporated in the State of Georgia. The creation of the Foundation was authorized by section 399F of the Public Health Service Act to support the mission of CDC in partnership with the private sector, including organizations, foundations, businesses, educational groups, and individuals. This foundation is the “cover” for accepting ear-marked donations from the Bill and Melinda Gates Foundation, Wellcome Trust, Clinton Foundation, World Bank, World Health Organization and many others. Essentially, the foundation is a vaccine money laundering operation that is a “flow through” charity that enriches the donors.\n\nThe CDC’s response to the AIDS crisis in the 1980s has been criticized for promoting some public health policies that harmed HIV+ people and for providing ineffective public education.\n\nThe agency’s response to the 2001 anthrax attacks was also criticized for ineffective communication with other public health agencies and with the public.\n\nThe listing here of some of the cancer forming chemicals included in CDC vaccines is taken directly from: Centers for Disease Control and Prevention Epidemiology and Prevention of Vaccine-Preventable Diseases, 13th Edition April, 2015. This list of horrible poisons is the tip of the iceberg. Take the vaccine Prevnar, which has many “listed” poisons but does not mention the fact that it also contains 23 viral pneumonias and 18 bacterial pneumonias in LIVE form. You are being inoculated with the very disease targeted by the fake vaccine. We list the contents below of some of the most common CDC vaccines. You will also notice that many other viruses are part of the vaccine formulas. The CDC is inoculating us with live viruses from animals. This is the proof that the CDC is not concerned about disease “prevention”, but in fact, simply focused on disease “creation and control” with the ulterior motive of total world control of humanity through “killer vaccines.” Soon, the CDC plans to inoculate every person of the earth with their vaccine for coronavirus and lock up any who resist, all for our “protection and safety.”\n\nDTaP-IPV/Hib (Pentacel) – aluminum phosphate, polysorbate 80, formaldehyde, sucrose, gutaraldehyde, bovine serum albumin, 2-phenoxethanol, neomycin, polymyxin B sulfate, Mueller’s Growth Medium, Mueller-Miller casamino acid medium (without beef heart infusion), Stainer-Scholte medium (modified by the addition of casamino acids and dimethyl-betacyclodextrin), MRC-5 (human diploid) cells, CMRL 1969 medium (supplemented with calf serum), ammonium sulfate, and medium 199\n\nInfluenza (Fluzone: Standard (Trivalent and Quadrivalent), High-Dose, & Intradermal) -formaldehyde, octylphenol ethoxylate (Triton X-100), gelatin (standard trivalent formulation only), thimerosal (multi-dose vial only), egg protein, phosphate buffers, sucrose\n\nRotavirus (RotaTeq) – sucrose, sodium citrate, sodium phosphate monobasic monohydrate, sodium hydroxide, polysorbate 80, cell culture media, fetal bovine serum, vero cells [DNA from porcine circoviruses (PCV) 1 and 2 has been detected in RotaTeq. PCV-1 and PCV-2 are not known to cause disease in humans.]\n\nRotavirus (Rotarix) – amino acids, dextran, sorbitol, sucrose, calcium carbonate, xanthan, Dulbecco’s Modified Eagle Medium (potassium chloride, magnesium sulfate, ferric (III) nitrate, sodium phosphate, sodium pyruvate, Dglucose, concentrated vitamin solution, L-cystine, L-tyrosine, amino acids solution, L-glutamine, calcium chloride, sodium hydrogenocarbonate, and phenol red) [Porcine circovirus type 1 (PCV-1) is present in Rotarix.\n\nA table listing vaccine excipients and media by excipient can be found in: Grabenstein JD. ImmunoFacts: Vaccines and Immunologic Drugs – 2013 (38th revision). St Louis, MO: Wolters Kluwer Health, 2012.\n\nThe obvious conclusion to this summary of CDC crimes is simply that the CDC is the globalists’ tool for depopulation and the war-machine to create vaccines generating billions in profits for the very people “donating” to the CDC.\n\nIf the CDC spent as much time and money on finding “treatments” for viruses instead of vaccines that can never work on a virus – we would have hundreds of “treatments” for viral and bacterial infections.\n\nBill and Melinda Gates Foundation – Bill Gates, the Vaccine Warlord and King of Depopulation, has committed ‘Crimes Against Humanity’ and must be prosecuted for planned depopulation – global murder. As part of a hundred year-long British plan to depopulate the world, Bill Gates has committed these “crimes” that enable him to openly bribe every major University and biomedical facility (Biosecurity Level P 1-4) throughout the world to focus exclusively on vaccines and not treatments for viruses. Here is the short list:\n\nStarted the Global Alliance for Vaccines and Immunization (GAVI) in 2000 (donated $750 million) a “Vaccine Alliance”, who claim to have vaccinated half the world’s children (with poisonous vaccines).\n\nGave 496,000 Indian children polio through his new “polio vaccine”, as confirmed by WHO. Gates is now wanted in India for crimes against humanity.\n\nBy 2018, 75% of polio cases worldwide were from “Gates Vaccines.” Gates introduced the world to a new form of polio that he funded.\n\nIn 2014, Gates gave 23,000 Indian girls HPV vaccines – Gardasil and Cervarix from Merck and Glaxo Smith Kline (formerly Burroughs-Wellcome) – 5% had severe side effects, most were permanently sterilized, seven died, and the vaccine was useless against HPV. Gate’s staff were prosecuted by the Indian government for forging signatures, coercion, and refusing medical treatment for side-effects.\n\nIn 2002, Gates forcibly vaccinated South African children against meningitis. Many developed permanent paralysis. The press called Gates “ruthless and immoral.”\n\nIn 2010, Gates gave his anti-malaria vaccine to 5,000 African children – 151 died – 1,000 had serious side effects including paralysis and seizures.\n\nIn 2014, the WHO chemically sterilized millions of Kenyan women with a “Gates tetanus vaccine” that was poisonous, and later the WHO publicly admitted it.\n\nCreated the Strategic Advisory Group of Experts (SAGE) to advise WHO on vaccine and immunization policies, research and development, and delivery systems, This secretive group is chaired by Sir Peter Vallance, ex Glaxo Smith Kline director, a top vaccine warlord.\n\nGates committed $10 Billion to the WHO campaign to reduce the world’s population through new vaccines. He bragged that his new Green Program for Africa will depopulate Africa by 10-15%.\n\nPartnered with the Rockefeller Foundation, UNICEF, WHO, World Bank, DFID, DNIH, CDC, WEF, vaccine manufacturers, and others to demand mandatory biometric ID’s to track vaccinations world-wide. This is “vaccine war” world-domination.\n\nHas controlled the Department of International Development (DFID) through donations since 2000. This British group demands that countries donated to the Gates Vaccine Wars and it controls media vaccine propaganda to hide the true intention of Vaccine Warlords and make Gates, SAGE, WHO, CDC, NIH and Big Pharma true heroes looking after the safety of people everywhere. DFID is hosting an international vaccine summit in June 2020. Anyone questioning the Bill Gates Vaccine War lockdown and universal vaccination narrative will be silenced.\n\nGave $40 million in 2008 to Professor Chris Witty, Chief Medical Officer of England, and Chief Scientific Adviser for the Department of Health and Social Care (DHSC), National Institute for Health Research (NIHR), Department for International Development (DFID), and SAGE board member to control British vaccine promulgation. Chris Witty is Gates Vaccine Warlord in England just as Anthony Fauci is Gates Vaccine Warlord in America.\n\nStarted the Coalition for Epidemic Preparedness (CEPI) in 2017 to accelerate new vaccine creation and distribution. CEPI gave $8.4 million to Imperial College in 2017 to develop “Vaccine X”, a vaccine targeted for every person on the planet.\n\nDonated 200 million to CDC to help develop a COVID-19 vaccine knowing that no such vaccine is possible.\n\nDonated $100 million to Anthony Fauci’s efforts to create new vaccines at the National Institute for Health. The NIH donated $3.7 million of that money to the Wu Han Institute of Virology (among others), the only level four bioweapon lab in China where the Chinese doctor (Dr. Qiu) who had breached the Canadian National Microbiology Laboratory had taken the British/Canadian virus bioweapons, developed by Pirbright, Merial, and QinetiQ to China.\n\nDonated £184 million to Imperial College of London for fake Covid-19 propaganda death predictions (2.2 million in America and over 1.5 million in England). Gates is looking to COVID-19 to force his third world vaccination programs on the Western world and mandatory vaccine IDs implanted in every human being.\n\nA child dies every 30 seconds from starvation, 3 million a year, but that’s not good enough for Bill Gates the Vaccine Warlord – King of Depopulation and Eugenics. He wants every human (except his friends) to have the “Vaccine X” shot to ward off all viruses – when he knows that NO VACCINE CAN STOP A VIRUS. Any “Gates vaccine” is poisonous, period.\n• The Queen of England/Golden Share Holder of Pirbright\n• DFID Department of International Development, among others.\n\nWe went to the official Bill and Melinda Gates Foundation and pulled down a sampling of Gates’ donation recipients. Basically, you have the majority of the criminals complicit with Bill’s plan to create vaccines (for his own enrichment) instead of acknowledging the dozens of proven treatments for viruses that no do include vaccines. We have listed many of these treatments above and point out that Bill’s bribes keep everyone from being “allowed” to look in any direction but vaccines – which cannot ever work due to being based upon “bad science.” But, vaccines will depopulate, sicken, and maim in many cases. Bill (and Melinda) know this full well. It is part of the “Global Health” plan that many donations go towards.\n\nAs a matter of fact, when you read the grant’s focus, please translate as follows:\n• Global Growth – bribes to nations via (International) Bank Reconstruction and Dev.\n• Malaria –malaria already has many effective treatments and numerous vaccines\n• AIDS HIV – Gates supported the WHO and CDC to create and continue HIV\n• Vaccine Development – no vaccine is safe or has ever been proven to work effectively\n• Pneumonia – there are already many current vaccines for pneumonia\n• Tropical Diseases –to develop new patents on new viruses\n• Agricultural Development – Gates’ program for GMOs in Africa and the world.\n\nLock Him (and the other Vaccine Warlords) Up – For Humanity’s Sake!\n\nEnteroviruses is a genus of positive-sense single-stranded RNA viruses associated with several human and mammalian diseases. Enteroviruses are named by their transmission-route through the intestine. Serologic studies have distinguished 71 human enterovirus serotypes on the basis of antibody neutralization tests. On the basis of their pathogenesis in humans and animals, the enteroviruses were originally classified into four groups, polioviruses, Coxsackie A viruses (CA), Coxsackie B viruses (CB), and echoviruses.\n\nEnteroviruses cause a wide range of symptoms, and while their long list of signs and symptoms should put them on the differential diagnosis list of many illnesses, they often go unnoticed. Enteroviruses can cause anything from rashes in small children, to summer colds, to encephalitis, to blurred vision, to pericarditis. Enteroviral infections have a great range in presentation and seriousness. Non-polio enteroviruses cause 10-15 million infections and tens of thousands of hospitalizations in the US each year. Below are common enterovirus related diseases, including poliomyelitis.\n• Poliomyelitis primarily via the fecal-oral route with polio-like syndrome found in children who tested positive for enterovirus 68.\n• Nonspecific Febrile Illness is the most common presentation of enterovirus infection which includes symptoms of: fever, muscle pain, sore throat, gastrointestinal distress/abdominal discomfort, and headache. In newborns the picture may be that of sepsis and can be severe and life-threatening.\n• Aseptic Meningitis in children. In the United States, enteroviruses are responsible for 30,000 to 50,000 meningitis hospitalizations per year as a result of 10-15 million infections.\n• Bornholm Disease or epidemic pleurodynia is characterized by severe paroxysmal pain in the chest and abdomen, along with fever, and sometimes nausea, headache, and emesis.\n• Pericarditis and/or myocarditis are typically caused by enteroviruses with symptoms of: fever with dyspnea, chest pain, arrhythmias, heart failure, and myocardial infarction.\n• Acute Hemorrhagic Conjunctivitis can be caused by enteroviruses.\n• Herpangina is caused by Coxsackie A virus and causes a vesicular rash in the oral cavity and on the pharynx, along with high fever, sore throat, malaise, and often dysphagia, loss of appetite, back pain, and headache.\n• Hand, Foot and Mouth Disease is a childhood illness most commonly caused by infection by Coxsackie A virus or EV71.\n• Encephalitis is rare manifestation of enterovirus generally caused by Echovirus 9.\n• Myocarditis is characterized by inflammation of the myocardium (cardiac muscle cells). One of the most common enteroviruses found to be responsible for causing Myocarditis is the Coxsackie B3 virus.\n• Chronic Fatigue Syndrome, an acute respiratory or gastrointestinal infection is associated with enterovirus.\n• Diabetes Mellitus Type 1 has been found to be a virus-triggered autoimmune response in which the immune system attacks virus-infected cells along with the insulin-producing beta cells in the pancreas.\n\nEnteroviruses affect millions of people worldwide each year and are often found in the respiratory secretions (e.g., saliva, sputum, or nasal mucus) and stool of an infected person. Historically, poliomyelitis was the most significant disease caused by an enterovirus, namely polio-virus. There are 81 non-polio and 3 polio enteroviruses that can cause disease in humans. Of the 81 non-polio types, there are 22 Coxsackie A viruses, 6 Coxsackie B viruses, 28 echoviruses, and 25 other enteroviruses.\n• Enterovirus C is a species of enterovirus whose best known subtype is poliovirus, the cause of poliomyelitis. There are three serotypes of poliovirus, PV1, PV2, and PV3.\n• Enterovirus D is a species of enterovirus which causes disease in humans. Five subtypes have been identified to date. Enterovirus 68 causes respiratory disease and is associated with acute flaccid paralysis (AFP) – a disease similar to polio.\n\nCoxsackievirus B1- 4 (CVB 1-4) was formerly known as Ljungan virus. These viruses are typically the most severe and fatal neonatal diseases. Common symptoms can include myocarditis, meningoencephalitis, and hepatitis. Other less severe symptoms can include pneumonia, gastrointestinal symptoms, pancreatitis, and seizures. Patients with Coxsackie B4 virus have seemed to have herpangina, tonsillitis, and pharyngitis.\n\nCoxsackievirus A (CVA) are mainly associated with human Hand, Foot and Mouth Disease. Coxsackie B viruses can cause signs and symptoms, similar to a cold, but these viruses also can lead to more serious diseases, including myocarditis (inflammation of the heart); pericarditis (inflammation of the sac surrounding the heart); meningitis (inflammation of the membranes that line the brain and spinal cord); and pancreatitis (inflammation of the pancreas).\n\nCoxsackievirus B3 (CVB3) is a single-stranded RNA enterovirus and a member of the Picornavirdae family. Once the virus penetrates the host’s systemic circulation via contaminated water or food, it can travel and infect the heart and cause myocarditis. Once inside the cytoplasm, the virus can use the host’s ribosomal machinery to proliferate and replicate progenies for further infection.\n\nCoxsackievirus B4 (CVB4) are enteroviruses of the Picornaviridae family and can be found worldwide. Coxsackievirus B4 has natural killer cells for pancreatic islet cells. Infection can lead to beta cell apoptosis which increases the risk of insulitis.\n\nCoronaviruses are a group of related viruses that cause diseases in mammals and birds. In humans, coronaviruses cause respiratory tract infections that can range from mild to lethal. Mild illnesses include some cases of the common cold while more lethal varieties can cause SARS, MERS, and COVID-19.\n\nFour coronaviruses continually circulate in the human population and produce the generally mild symptoms of the common cold in adults and children worldwide:\n\nCoronaviruses cause about 15% of commons colds. The majority of colds are caused by rhinoviruses. The four mild coronaviruses have a seasonal incidence occurring in the winter months in temperate climates.\n\nThe three human coronaviruses produce symptoms that are potentially severe:\n\nMiddle East Respiratory Syndrome (MERS-CoV) – In September 2012, a new type of coronavirus was identified, initially called Novel Coronavirus 2012, and now officially named Middle East respiratory syndrome coronavirus (MERS-CoV). The World Health Organization issued a global alert soon after. It appears the virus had trouble spreading from human to human, as most individuals who are infected do not transmit the virus. The only U.S. cases (both survived) were recorded in May 2014.\n\nIn May 2015, an outbreak of MERS-CoV occurred in the Republic of Korea, when a man who had traveled to the Middle East, visited four hospitals in the Seoul area to treat his illness. This caused one of the largest outbreaks of MERS-CoV outside the Middle East. As of December 2019, 2,468 cases of MERS-CoV infection had been confirmed by laboratory tests, 851 of which were fatal, a mortality rate of approximately 34.5%.\n\nSevere Acute Respiratory Syndrome (SARS-CoV) – In 2003, following the outbreak of severe acute respiratory syndrome (SARS) which had begun the prior year in Asia, and secondary cases elsewhere in the world, the World Health Organization (WHO) issued a press release stating that a novel coronavirus identified by a number of laboratories was the causative agent for SARS. More than 8,000 people were infected, about 800 of whom died.\n\nSevere Acute Respiratory Syndrome (SARS-CoV-2/COVID 19) – In December 2019, a pneumonia outbreak was reported in Wuhan, China. On December 31, 2019, the outbreak was traced to a novel strain of coronavirus, which was given the interim name 2019-nCoV by the World Health Organization (WHO), later renamed SARS-CoV-2 (Corona Virus ID-19).\n\nAs of April 27, 2020, there have been at least 208,131 deaths and more than 3,002,303 cases in the coronavirus pneumonia pandemic reported. The Wuhan strain has been identified as a new strain of Betacoronavirus from group 2B with approximately 70% genetic similarity to the SARS-CoV. The virus has a 96% similarity to a bat coronavirus, so it is widely suspected to originate from bats as well.\n\nCoronaviruses are enveloped viruses with a positive-sense single-stranded RNA genome. They have characteristic club-shaped spikes that project from their surface, which in electron micrographs create an image reminiscent of the solar corona, from which their name derives.\n\nCoronaviruses were first discovered in the 1930s when an acute respiratory infection of domesticated chickens was shown to be caused by Infectious Bronchitis Virus (IBV). In the 1940s, two more animal coronaviruses, mouse hepatitis virus (MHV) and transmissible gastroenteritis virus (TGEV), were isolated. It was not realized at the time that these three different viruses were related.\n\nThe IBV-like novel cold viruses were shown to be morphologically related to the Mouse Hepatitis Virus (MHV). This new group of IBV-like viruses came to be known as coronaviruses after their distinctive morphological appearance. Human coronavirus 229E and human coronavirus OC43 continued to be studied in subsequent decades. Other human coronaviruses have since been identified, including SARS-CoV in 2003, HCoV NL63 in 2004, HCoV HKU1 in 2005, MERS-CoV in 2012, and SARS-CoV-2 in 2019 (COVID-19).\n\nIn the 1890s, human coronavirus OC43 diverged from bovine coronavirus after an alleged cross-species spillover event. It is speculated that the flu pandemic of 1890 may have been caused by this such a spillover event, and not by the influenza virus, because of the related timing, neurological symptoms, and unknown causative agent of the pandemic.\n\nWhen human coronaviruses were discovered in the 1960s, they were isolated using two different methods in the United Kingdom and the United States. There have also been a large number of animal coronaviruses identified since the 1960s. MERS-CoV allegedly emerged in humans from bats through the intermediate host of camels, “according to the theory.” SARS-CoV diverged from bats in 1986, though virologists claim bat and human species spill over goes back much further.\n\nCoronaviruses are divided into alphacoronaviruses and betacoronaviruses which infect mammals – and gammacoronaviruses and deltacoronaviruses which primarily infect birds.\n\nEchoviruses are a cause of many of the nonspecific viral infections. They are mainly found in the intestine and can cause nervous disorders. The usual symptoms of coxsackie and echovirus are fever, mild rash, and mild upper respiratory tract illness.\n\nCytomegalovirus (CMV) is a genus of viruses in the order Herpesvirales which humans and monkeys serve as natural hosts. It is also related to other herpes viruses within the Alphaherpesvirinae subfamily, which includes herpes simplex viruses 1 and 2 and varicella-zoster virus, and the Gammaherpesvirinae subfamily, which includes Epstein–Barr virus and Kaposi’s sarcoma-associated herpes virus. Several species of Cytomegalovirus have been identified and classified for different mammals. The most studied is the human cytomegalovirus (HCMV), which is also known as human betaherpesvirus 5 (HHV-5). Rodents also have viruses previously called cytomegaloviruses.\n\nRotavirus is a genus of double-stranded RNA viruses in the family Reoviridae. Rotaviruses are the most common cause of diarrhoeal disease among infants and young children. Nearly every child in the world is infected with a rotavirus at least once by the age of five. Immunity develops with each infection, so subsequent infections are less severe; adults are rarely affected. There are ten species of the genus, referred to as A, B, C, D, E, F, G, H, I and J. Rotavirus A, the most common species, causes more than 90% of rotavirus infections in humans.\n\nThe virus is transmitted by the fecal-oral route. It infects and damages the cells that line the small intestine and causes gastroenteritis which is often called “stomach flu” despite having no relation to influenza. In 2013, rotaviruses caused 37% of deaths of children from diarrhoea and 215,000 deaths worldwide, and almost two million more became severely ill.\n\nThere are some recognized treatments. Probiotics have been shown to reduce the duration of rotavirus diarrhoea, and according to the European Society for Pediatric Gastroenterology “effective interventions include administration of specific probiotics such as Lactobacillus rhamnosus or Saccharomyces boulardii, diosmectite or racecadotril and the use of low-osmolarity oral rehydration solution and zinc supplementation.\n\nMumps orthorubulavirus (MuV) is the causative agent of mumps that cause swelling of the parotid glands, salivary glands and other epithelial tissues. Symptoms of mumps are fatigue, body aches, headache, loss of appetite, low grade fever, swelling of the salivary glands. Mumps can also result in muscle pain, deafness, meningitis, pancreatitis, swelling of testicles or ovaries, and death. Most people who contract mumps show symptoms of the virus. Natural infection is currently restricted to humans and the virus is transmitted by direct contact, droplet spread, or contaminated objects. It is a “vaccine-preventable disease”, although significant outbreaks have occurred in recent years caused by the vaccine itself.\n\nChickenpox, also known as varicella, is a highly contagious disease caused by the initial infection with varicella zoster virus (VZV). The disease results in a characteristic skin rash that forms small, itchy blisters, which eventually scab over. It usually starts on the chest, back, and face. It then spreads to the rest of the body. Other symptoms may include fever, tiredness, and headaches. Symptoms usually last five to seven days. Complications may occasionally include pneumonia, inflammation of the brain, and bacterial skin infections. The disease is often more severe in adults than in children. Symptoms begin 10 to 21 days after exposure to the virus.\n\nChickenpox is an airborne disease which spreads easily through the coughs and sneezes of an infected person. It may be spread from one to two days before the rash appears until all lesions have crusted over. It may also spread through contact with the blisters. Those with shingles may spread chickenpox to those who are not immune through contact with the blisters.\n\nFor those at increased risk of complications, antiviral medication such as aciclovir are recommended. Aciclovir (ACV), also known as acyclovir, is an antiviral medication that is effective. It is primarily used for the treatment of herpes simplex virus infections, chickenpox, and shingles. Other uses include prevention of cytomegalovirus infections following transplant and severe complications of Epstein-Barr virus infection.\n\nIn 2013 there were 140 million cases of chickenpox and herpes zoster worldwide. In 2015, chickenpox resulted in 6,400 deaths globally. Sorivudine, a nucleoside analog, has been reported to be effective in the treatment of primary varicella in healthy adults. There has also been success in curing it with continuous dosing of acyclovir.\n\nMeasles is a highly contagious infectious disease caused by measles virus. Symptoms usually develop 10-12 days after exposure to an infected person and last 7-10 days. Initial symptoms typically include fever, cough, runny nose, and inflamed eyes. Small white spots known as Koplik’s spots may form inside the mouth two or three days after the start of symptoms. A red, flat rash which usually starts on the face and then spreads to the rest of the body typically begins three to five days after the start of symptoms. Common complications include diarrhea (8% of cases), middle ear infection (7%), and pneumonia (6%). Other names include morbilli, rubeola, red measles, and English measles. Both rubella, also known as “German measles”, and roseola are different diseases caused by unrelated viruses.\n\nMeasles is an airborne disease which spreads easily through the coughs and sneezes of infected people. It may also be spread through direct contact with mouth or nasal secretions. It is extremely contagious – nine out of ten people who are not immune and share living space with an infected person will be infected. People are infectious to others from four days before to four days after the start of the rash.\n\nMeasles affects about 20 million people a year, and in 1980, 2.6 million people died of it, and in 1990, 545,000 died. The risk of death among those infected is about 0.2%, but may be up to 10% in people with malnutrition.\n\nERDRP-0519 is an antiviral drug which is the first drug specifically developed to target the measles morbillivirus. It acts as an inhibitor of the viral enzyme RNA polymerase which is essential for viral replication.\n\nFavipiravir, sold under the brand name Avigan, is an antiviral medication used to treat influenza in Japan. It is also being studied to treat a number of other viral infections like the experimental antiviral drugs (T-1105 and T-1106), it is a pyrazinecarboxamide derivative. In experiments in animals, favipiravir has shown effectiveness against West Nile virus, yellow fever virus, ebola, foot-and-mouth disease virus as well as other flaviviruses, arenaviruses, bunyaviruses and alphaviruses, enteroviruses and Rift Valley fever virus.\n\nThe Death of Viruses and the End of Vaccine Wars\n\nThe evidence and facts presented above make it perfectly clear that vaccines are not created for health, but in fact, for death. Vaccine Warlords and doctors know that the Vaccine Theory is flawed, and yet they let vaccines harm, kill, and maim millions every year. Well-known and accepted treatments for viruses are hidden and almost forbidden in America. The British and United Nations sources for these crimes against humanity have been presented. You can decide yourself and make up your own minds. Obviously, the authors have researched and made up their minds. Vaccines are poison, resist them at all costs.", "opengraph": {"type": "article", "title": "Virus Lies and Vaccine Wars", "url": "https://aim4truth.org/2020/04/30/virus-lies-and-vaccine-wars/", "description": "The CDC and NIH are lying to us. There are no known effective vaccines for viruses — they simply don’t exist, and yet all of the CDC’s and the NIH’s time and money is spent on creating new, a…", "article:published_time": "2020-04-30T22:52:03+00:00", "article:modified_time": "2020-05-05T15:57:53+00:00", "site_name": "American Intelligence Media", "image": "https://i0.wp.com/aim4truth.org/wp-content/uploads/2017/03/dollar-syringe.jpg?fit=527%2C347&ssl=1", "image:width": "527", "image:height": "347", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.sciencedirect.com/science/article/pii/S2314724516300723", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2570378/", "https://www.health.com/condition/type-1-diabetes/diabetes-enterovirus", "https://www.gatesfoundation.org/how-we-work/quick-links/grants-database", "https://www.gatesfoundation.org/how-we-work/quick-links/grants-database"], "authors": [], "publish_date": "2020-04-30T22:52:03+00:00"}