{"result_id": "024030", "URL": "https://aim4truth.org/2022/09/16/biden-executive-order-demands-new-bioweapon-to-alter-human-beings/", "timestamp": "2023-04-25 12:02:02 CEST+0200", "meta": {"description": "Both Donald Trump and Joe Biden are agents of Big Pharma which has the goal of exterminating the natural human being and turn any surviving humans into transhuman enhanced cyborgs.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/aim4truth.org/wp-content/uploads/2017/02/cropped-aim-4-truth-png.png?fit=32%2C32&ssl=1", "canonical": "https://aim4truth.org/2022/09/16/biden-executive-order-demands-new-bioweapon-to-alter-human-beings/", "encoding": "UTF-8"}, "image": null, "domain": "aim4truth.org", "title": "Biden Executive Order Demands New BioWeapon To Alter Human Beings", "cleaned_text": "Big-Pharma’s Pharmaceutical WWIII started with numerous actions Donald Trump took, while president, that demonstrated that he is either an idiot, or he was/is/became an agent of Big-Pharma before he signed Executive Order 13887 expanded the definition of viruses and giving a blank check to the WHO/CDC/NIH to experiment on humans with dangerous vaccine-like drugs that are actually bioweapons. It seems like the loss of life, like the 100,000 or so who die from influenza each year in America (65% of whom received the flu vaccine), are statistically incidental in the “research” to find a perfect vaccine for all influenza viruses. This desperate need to “stop the common flu and cold” has, in turn, created a BIOECONOMY that raked in more than five trillion dollars (+) for Covid – which was nothing more than the yearly flu.\n\nThe “biotechnology” of vaccines is now the biggest global industry, even above warmongering, and with the endless “booster” shots, will soar to new heights beyond any warmongering snake-oil scam or Ponzi scheme in history. To think, the best killer-fraud of all times was pulled off with the murderers being given prior, and complete, immunity because Trump and Biden’s Executive Orders and actions gave Big-Pharma control of American sovereignty through WHO/CDC/NIH medical tyranny that has overthrown the US Constitution and Bill of Rights. The United Nations has been in control of the world since the fake-pandemic was “pronounced” from the infallible church of holy science’s global offices at of the World Health Organization – Big-Pharma’s agents. These supposed experts killed more people via their protocols, mandates, and bad medical advice than Covid did.\n\nAll of these political machinations that have abnegated the US Constitution are supposedly legal due to the Pandemic and All Hazards Preparedness Act of 2019, and the 21st Century Cures Act of 2016, that assign all control of Americans during a pandemic to the World Health Organization via the CDC and NIH. This pandemic fraud surrenders our American sovereignty to an agency of the United Nations under the guise of medical safety and security. These treasonous “laws” gave the legal right for the heinous acts of the six million medical iatrogenic deaths called Covid. This is simply death by doctors and drugs.\n\nCDC Influenza and pneumonia vaccine shot statistics demonstrate that these vaccines simply create more influenza and pneumonia. Vaccines have never worked, and the CDC now admits that they added viruses as pathogens to childhood vaccines in the past that eventually caused over 100 million cancer cases. And yet, we haven’t taken our pitchforks and surrounded the WHO/CDC/NIH and stopped their obvious planned eugenics. Depopulation is the number one issue for the United Nations. Their agencies work for the demise of millions through vaccines that sterilize, polio shots that create polio, peace-keepers who rape and kill, economic agencies (World Bank, WTO, IMF, etc.) who steal and fleece undeveloped nations and manipulate the rest, and the many other atrocities they are well-known for. When Trump defunded the United Nations by 50%, many thought there was hope. But, when Trump either fell for, or aligned with the fake pandemic plan, he turned to the dark side and hasn’t come back yet. This is also evidenced in his lightning-fast response to the outbreak by calling a National Health Emergency (Jan 27), closing air travel from China (Jan 31), proclaiming a National Emergency on March 1 (ratified on March 13), agreeing to the WHO declaration of a Global Pandemic on March 11, creating Emergency Use Authorization for fake vaccines on January 13, allowing Ivermectin to be outlawed by the FDA on April 10, and fathering Operation Warp Speed on April 29.\n\nUnderstanding this timetable demonstrates that Trump was part of the plan to frighten Americans into taking an experimental bioweapon drug [vaccine] for an incidental virus. There was no historical precedent for abnegating all the rules and going headlong into creating a supposedly permanent vaccine for “all” influenza-like viruses. Only after Trump declared a National Health Emergency could the rules and regulations be thrown out. Trump proclaimed the fake-pandemic on January 27, even before the WHO proclaimed a Global Pandemic. Trump was the cheer leader of vaccines even before Covid was “thought of”, as seen by his September 19, 2019 Executive Order. He is still cheer leading as the “King of the Vaccine” that supposedly saved “millions of lives.” If we look at the timetable closely, the circumstantial evidence is quite convincing that Trump and Biden are simply agents of Big-Pharma.\n\nExecutive Order 13887, September 19, 2019, Donald Trump – Modernizing Influenza Vaccines in the United States to Promote National Security and Public Health\n\nPresident Donald Trump issued Executive Order 13887 on Thursday, September 19, 2019, in an attempt to improve and modernize influenza vaccine manufacturing processes to develop vaccines that provide more effective and longer lasting protection. Under the order, a National Influenza Vaccine Task Force was established. The goal of the Task Force is to compile a report, which includes a 5-year plan to promote new vaccine manufacturing technology and to accelerate the development of a universal flu vaccine.\n\nTranslation: Trump sold out to Big-Pharma since corona viruses (Covid) are considered equivalent to influenza. This EO was written before Covid-19 ever came along. Big-Pharma wrote this EO so they could pull-off the pandemic scam. The word pandemic appears repeatedly throughout this EO and basically makes Big-Pharma a government monopoly with full immunity from liability. It sanctions cell manipulation [m-RNA] and new types [viral vectors, pegylated graphene oxide, etc.] of vaccines. Thus, the definition of a vaccine is changed through this EO and allows experimental vaccine research and development.\n\nSec. 2. This order directs actions to reduce the United States’ reliance on egg-based influenza vaccine production; to expand domestic capacity of alternative methods that allow more agile and rapid responses to emerging influenza [corona] viruses; to advance the development of new, broadly protective vaccine candidates that provide more effective and longer lasting immunities; and to support the promotion of increased influenza vaccine immunization across recommended populations.\n\nTranslation: Get ready for Frankenstein vaccines which are supposed to kill “elusive” diseases. You will be coerced into taking toxic vaccines, without informed consent.\n\n(i) a 5-year national plan (Plan) to promote the use of more agile and scalable vaccine manufacturing technologies and to accelerate development of vaccines that protect against many or all influenza viruses;\n\n(A) estimate the cost of expanding and diversifying domestic vaccine manufacturing capacity to use innovative, faster, and more scalable technologies, including cell-based [genomic] and recombinant vaccine manufacturing [mRNA], through cost-sharing agreements with the private sector, which shall include an agreed-upon pricing strategy during a pandemic;\n\n(E) evaluate incentives for the development and production of vaccines by private manufacturers and public-private partnerships, including, in emergency situations, the transfer of technology to public-private partnerships – such as the HHS Centers for Innovation and Advanced Development and Manufacturing or other domestic manufacturing facilities – in advance of a pandemic, in order to be able to ensure adequate domestic pandemic manufacturing capacity and capability;\n\nTranslation: This EO is predicting the pandemic and making plans to give control to the private sector, supplied with endless government money, to experiment with new drugs without any responsibility or accountability.\n\n(A) further implement vaccine production process improvements to reduce the time required for vaccine production;\n\n(C) further support the conduct, in collaboration with the DOD, BARDA, and CDC, of applied scientific research regarding developing cell lines and expression systems that markedly increase the yield of cell-based and recombinant influenza vaccine manufacturing processes; and\n\n(v) through the Administrator of CMS, examine the current legal, regulatory, and policy framework surrounding payment for influenza vaccines and assess adoption of domestically manufactured vaccines that have positive attributes for pandemic response (such as scalability and speed of manufacturing).\n\nTranslation: It is OK to use previously failed experimental viral vectors and mRNA vaccines that have been proven harmful and lethal.\n\nTimeline of Lost Battles in the Pharmaceutical WWIII\n\nLet’s examine the dates of each of the first battles in the fake pandemic to demonstrate that Trump and Biden are good-old-boys working for the drug companies and their minions at the WHO/CDC/NIH.\n• Executive Order 13887, September 19, 2019, Donald Trump – Modernizing Influenza Vaccines in the United States to Promote National Security and Public Health\n• The Secretary of Health and Human Services (Alex Azar) declared a Public Health Emergency on January 27, 2020, under section 319 of the Public Health Service Act (42 U.S.C. 247d), in response to COVID-19.\n• Proclamation 9994 of March 13, 2020: Declaring a National Emergency Concerning the Novel Coronavirus Disease (COVID-19) Outbreak:\n• NOW, THEREFORE, I, DONALD J. TRUMP, President of the United States, by the authority vested in me by the Constitution and the laws of the United States of America, including sections 201 and 301 of the National Emergencies Act (50 U.S.C. 1601 et seq.) and consistent with section 1135 of the Social Security Act (SSA), as amended (42 U.S.C. 1320b-5), do hereby find and proclaim that the COVID-19 outbreak in the United States constitutes a National Emergency, beginning March 1, 2020.”\n• The World Health Organization (WHO) on March 11, 2020, declared the novel coronavirus (COVID-19) outbreak a Global Pandemic. WHO Director-General, Dr. Tedros Adhanom Ghebreyesus, noted that over the past two weeks, the number of cases outside China increased 13-fold and the number of countries with cases increased threefold thus justifying the decision.\n• On February 18, 2022, President Bidenproclaimed the Continuation of the National Emergency Concerning the Corona Virus Disease 2019 (COVID-19) Pandemic [FR Doc. 2022-03972].\n• On March 13, 2020, by Proclamation 9994, President Trump declared a national emergency concerning the coronavirus disease 2019 (COVID-19) pandemic. The COVID-19 pandemic continues to cause significant risk to the public health and safety of the Nation. For this reason, the national emergency declared on March 13, 2020, and beginning March 1, 2020, must continue in effect beyond March 1, 2022. Therefore, in accordance with section 202(d) of the National Emergencies Act (50 U.S.C. 1622(d)), I am continuing the national emergency declared in Proclamation 9994 concerning the COVID-19 pandemic.\n• On September 12, 2022, President Biden proclaimed Executive Order 14081 on Advancing Biotechnology and Biomanufacturing Innovation for a Sustainable, Safe, and Secure American Bioeconomy\n\nBiden’s New Bio-Attack – Mother of All Bombs\n\nBiden’s Mother of All Bombs transhumanistic genetic modification of everything (the Internet of the Body) is simply the psychotic desire to have aggressive remote control of all biological entities. Dementia Joe Biden, the current Big-Pharma White House agent, dropped his Mother Bomb on Americans on September 12, 2022, in an Executive Order (14081) entitled: Advancing Biotechnology and Biomanufacturing Innovation for a Sustainable, Safe, and Secure American Bioeconomy. This EO is another lost battle in Pharmaceutical WWIII. Fake president Biden has unleashed the transhumanists upon Americans without any restrictions, monitoring, or morality and given them unlimited funds to play with. The previous vaccines that delivered graphene oxide nanobots obviously weren’t enough for the depopulation mad-scientists, now they want to continue their genetic modifications unfettered, paid by the government, and with complete impunity. We know quite well that Big-Pharma lobbyists and lawyers write the Executive Orders and US Congressional laws concerning the medical industry and that politicians do not understand the ramifications at all. If they did understand, they could not vote for these demonic laws nor allow such industry-designed Executive Orders that act as administrative law within Federal agencies to be passed into US law. If politicians do understand what they voted for, they have committed treason and are complicit in mass murder – genocide through vaccines via the overthrowing of the US Constitution.\n\nBiden’s puppet-masters learned long ago that presidential actions can create trillions of dollars in easy income for new vaccines, treatments, and drugs. His new Executive Order establishes the supremacy of drug companies in his new “bioeconomy” through “biotechnology”, and “biomanufacturing.” Pharmaceutical WWIII is an inhuman medical attack on the human bloodstream that is obviously planning to take over global eugenics as a money-making business. Biden has pulled out all the stops in this vague but sweeping attempt to empower Big-Pharma. This can be seen clearly in the Executive Order, once the verbiage is translated. The EO creates the National Biotechnology and Biomanufacturing Initiative which will control our lives even more than during Covid.\n\nBiden’s EO is proof that the executive branch is now owned by the biomedical/pharmaceutical industry. Essentially, the transhumanists within Big-Pharma have completely taken over government policy and taxpayer funds to promote their own anti-human agenda of hacking the genetics of life and killing people in the process to advance depopulation. The mRNA injections are an experiment in transhumanism via vaccines. The genetic modification of all living things is anti-human and can only lead to more disaster and medical genocide. These poisonous vaccines, viral vectors, mRNA, and spike protein pathogen technologies are already inserted in many other vaccines, including flu shots, pneumonia shots, shingles, childhood vaccines, and numerous cancer treatments. The graphene oxide and SPIONS included as “inactive ingredients” in vaccines are toxic, mutagenic, and deadly to cells and tissue in the human body.\n\nIt is likely that this EO may have been timed in anticipation of the new pandemic treaty that the Biden administration is hoping to get passed through the United Nations World Health Organization. This treaty will transfer sovereignty over matters of “health emergencies” from the national level to the WHO with barely any possibilities for participating nations to reject the Organization’s dictates.\n\nLet’s take a look at some of the overtly anti-Constitutional provisions of Biden’s bombshell EO, with an accompanying translation into truth, instead of double-speak:\n\nSection 1. Policy. It is the policy of my Administration to coordinate a whole-of-government approach to advance biotechnology and biomanufacturing towards innovative solutions in health, climate change, energy, food security, agriculture, supply chain resilience, and national and economic security.\n\nWe need to develop genetic engineering technologies and techniques to be able to in the same way in which we write software and program computers; , including through computing tools and artificial intelligence; and advance the science of scale-up production while reducing the obstacles for commercialization so that innovative technologies and products can reach markets faster .\n\nTranslation: This Frankenstein insanity is trying to “play God” – and that always goes bad. The graphene oxide “circuitry for cells” is toxic, mutagenic and has yet to be approved for use on humans due to cytotoxicity, gene damage, and the production of acidosis (cancer). Many treatments using graphene oxide in Biden’s new “biotechnology” are already being used without the FDA stopping the use of these deadly toxins.\n\n(a) bolster and coordinate Federal investment in key research and development (R&D) areas of biotechnology and biomanufacturing in order to further societal goals;\n\nTranslation: The biological data ecosystem refers to radio frequency ID chips, graphene neural net antennas, hydrogel transistors, and many other systems that are already in use. This “data” will be able to be read and controlled by external digital devices and will be the global “vaccine pass” written into “functionalize and templated superparamagnetic reduced graphene oxide polyethylene glycol nano-circuitry microchips” that will record all vaccinations and medical data for global governmental control of “medical safety and security.”\n\n(c) improve and expand domestic biomanufacturing production capacity and processes, while also increasing piloting and prototyping efforts in biotechnology and biomanufacturing to accelerate the translation of basic research results into practice;\n\nTranslation: Permanent “Emergency Authorization Use Only” status is granted for all new diabolic vaccine experiments on humans and the inhuman medical nano-treatments that modify DNA, attack cellular functioning, and fill the body with man-made polymers derived from petroleum – like most pharmaceutical drugs. Animal studies will be skipped, and humans will be given shots and then studied for vaccine adverse events.\n\n(d) boost sustainable biomass production and create climate-smart incentives for American agricultural producers and forest landowners;\n\nTranslation: Bioeconomy will take over all food production and turn it towards glyphosates and GMO seeds and plants. The BIO-LORDS will re-make humans, animals, PLANTS, and minerals through nanotechnological genetic manipulation.\n\n(e) expand market opportunities for bioenergy and biobased products and services;\n\nTranslation: You will eat bugs and like it. Your body will be wirelessly connected to the grid and your bioenergy will be harvested. Your graphene oxide neural network will be added to the collective. Resistance is futile.\n\n(f) train and support a diverse, skilled workforce and a next generation of leaders from diverse groups to advance biotechnology and biomanufacturing;\n\nTranslation: Lie, falsify, and propagandize psychopathic “bio-goals” as the best thing for safety and security, health and wellness, and quantum leaps in human evolutionary development; when they are simply devolution into automaton nano-programmed cyborg/robot transhumananist grotesque experiments that will ultimately fail miserably causing illness, tremendous harm, and death.\n\n(g) clarify and streamline regulations in service of a science- and risk-based, predictable, efficient, and transparent system to support the safe use of products of biotechnology;\n\nTranslation: Throw out all regulations monitoring parasitical Big-Pharma vampirizing the world in an obvious effort to stop overpopulation.\n\n(h) elevate biological risk management as a cornerstone of the life cycle of biotechnology and biomanufacturing R&D, including by providing for research and investment in applied biosafety and biosecurity innovation;\n\nTranslation: This means that bioweaponry research is now legal in America and Fauci and the NIH won’t have to pretend to farm in out to other nations through NIH grants. It also allows “gain-of-function bioweapon” research to be conducted under the guise of “biosafety and medical biosecurity.”\n\nTranslation: Remove all hindrances to Big-Pharma continuing to control the world (bio-ecosystem) through medical fraud.\n\nSec. 7. Biotechnology and Biomanufacturing Workforce. (a) The United States Government shall expand training and education opportunities for all Americans in biotechnology and biomanufacturing.\n\nTranslation: Vaccine fascist control of “All Americans”, with no dissenters.\n\n(ii) use Federal investments in biological sciences, biotechnology, and biomanufacturing to enterprise.\n\n(iii) enhance cooperation, including joint research projects and expert exchanges, on biotechnology R&D, especially in genomics;\n\n(iv) work to promote the open sharing of scientific data, including genetic sequence data\n\nTranslation: “Enhance cooperation” means steal all patents. “Promote open sharing” means maintain a complete monopoly. Big-Pharma will have unlimited citizen’s tax money to do whatever they want.\n\n(j) The term “key R&D areas” includes fundamental R&D of emerging biotechnologies, including engineering biology; predictive engineering of complex biological systems, including the designing, building, testing, and modeling of entire living cells, cell components, or cellular systems;\n\nTranslation: We will turn you into transhuman enhanced cyborgs, and no one can stop us.\n\nGraphene and its derivatives are emerging as a class of novel but versatile templates for the controlled preparation and functionalization of materials. Graphene is capable of acting as a low-dimensional hard template, where its two-dimensional morphology directs the formation of novel nanostructures. Graphene oxide and other functionalized graphenes are amphiphilic and may be seen as soft templates for formatting the growth or inducing the controlled assembly of nanostructures. In addition, nanospaces in restacked graphene can be used for confining the growth of sheet-like nanostructures, and assemblies of interlinked graphenes can behave either as skeletons for the formation of composite materials or as sacrificial templates for novel materials with a controlled network structure. Flexible graphene and its derivatives together with an increasing number of assembled structures (polyethylene glycol) show great potentials as templates for bio-materials production.\n\nFrom: Frontiers, 15 March 15, 2022, Graphene Oxide and Biomolecules for the Production of Functional 3D Graphene-Based Materials\n\nGraphene and its derivatives have been widely employed in the manufacturing of novel composite nanomaterials which find applications across the fields of physics, chemistry, engineering and medicine. Biomolecules and biopolymers have been extensively studied and employed during the last decade as building blocks, leading to the realization of graphene-based biomaterials owning unique properties and functionalities. In particular, biomolecules like nucleic acids, proteins and enzymes, as well as viruses, are of particular interest due to their natural ability to self-assemble via non-covalent interactions forming extremely complex and dynamic functional structures. The capability of proteins and nucleic acids to bind specific targets with very high selectivity or the ability of enzymes to catalyze specific reactions, make these biomolecules the perfect candidates to be combined with graphenes, and in particular graphene oxide, to create novel 3D nanostructured functional biomaterials. Furthermore, besides the ease of interaction between graphene oxide and biomolecules, the latter can be produced in bulk, favoring the scalability of the resulting nanostructured composite materials. Moreover, due to the presence of biological components, graphene oxide-based biomaterials are more environmentally friendly and can be manufactured more sustainably compared to other graphene-based materials assembled with synthetic and inorganic components for the fabrication of novel functional and scalable materials and devices.\n\nFrom: Dovepress, Poly Ethylene Glycol (PEG) Functionalized Graphene Oxide in Tissue Engineering: A Review on Recent Advances, Ghosh S, Chatterjee K, April 21, 2020\n\nOwing to the unique physical, chemical, mechanical and electrical properties, graphene and its derivatives have been extensively researched for diverse biomedical applications including in tissue engineering since the past decade. Tunable chemical functionalities of graphene oxide (GO), a graphene derivative, allow easy surface functionalization. Functionalization of GO with polyethylene glycol (PEG-GO) has received significant attention as it offers superior solubility, stability, and biocompatibility. Besides being an attractive candidate for drug delivery, PEG-GO can aid in the attachment, proliferation, and differentiation of stem cells, thereby augmenting tissue engineering. Cytotoxicity at large dosages and prolonged exposure of GO limits its clinical translation. Few studies have been reported on the use of PEG-GO in composite materials to prepare scaffolds for tissue engineering. However, these scaffolds incorporating PEG-GO for bone, cardiac, skin, and neural tissue engineering reveal promising outcomes.\n\nPEG can be functionalized with different end groups so as to impart unique functionality to the nanoparticles when conjugated to GO. Ethylene glycol is one of several toxic alcohols that have medical and toxicological importance; if untreated, ingestion of ethylene glycol can be fatal. PEG containing acrylate groups can be incorporated in photo-curable bioinks for 3D printing of tissue scaffolds. Long-term effects of implanting scaffolds incorporating PEG-GO for tissue regeneration are poorly understood. PEG-GO is poised to emerge as a choice of biomaterial for advanced tissue engineering applications.\n\nThe possibility to obtain well-orchestrated polymeric architectures represents an emerging field of materials science for the development of advanced materials, including drug delivery devices, mimics of biological tissues, nanoreactors, and multifunctional coatings. Graphene oxide (GO) is a promising filler for polymer nanocomposites. GO is known to possess tunable physical-chemical characteristics, including optical, electrical, mechanical, antimicrobial properties, biocompatibility, UV-blocking, catalytic activity, and affinity to a wide range of pollutants. It can be easily reduced into graphene or chemically modified, thus holding promising potential as a versatile building block for the realization of nanostructured devices.\n\nMany studies have reported on the preparation of nanocomposites achieved via incorporation of GO inside the polymer matrix, and surface functionalization of flexible substrates. Prospects of gathering the unique properties of this nanomaterial with the ease of processability and free-standing properties of polymers into a lightweight devices via GO-coating of polymers finds application in an extremely wide range of fields, including nerve tissue engineering, electronics, water treatment, sensors, energy storage, covalent binding, vacuum filtration-aided coating, dip-coating, and spray-coating.\n\nFrom: Advanced Engineeering Materials, 2017, (#19, 1700627), Graphene Oxide/Polymer-Based Biomaterials, by Duygu Ege, Ali Reza Kamali, and Aldo R. Boccaccini\n\nSince its discovery in 2004, derivatives of graphene have been developed and heavily investigated in the field of tissue engineering. Among the most extensively studied forms of graphene, graphene oxide (GO), and GO/polymer-based nanocomposites have attracted great attention in various forms such as films, 3D porous scaffolds, electrospun mats, hydrogels, and nacre-like structures. In this review, the most actively investigated GO/polymer nanocomposites are presented and discussed, these nanocomposites are based on chitosan, cellulose, starch, alginate, gellan gum, polyvinyl alcohol, polyacrylamide, polye-caprolactone (PCL), polylactic acid, pol(lactide-co-glycolide, gelatin, collagen, and silk fibroin.\n\nWith the addition of GO, the mechanical performance of GO composites were extensively improved under physiological conditions. GO/polymer-based scaffolds can be categorized into four main categories, namely, 3D porous scaffolds, electrospun mats, hydrogels, and nacre-like structures. Electrospun mats were produced for different types of applications including bone, neural, muscle, and skin tissue engineering. GO/polymer hydrogels have been mainly prepared for soft tissue engineering such as wound dressing, peripheral nerve regeneration, and muscle tissue engineering. Hydrogels with higher mechanical strength such as crosslinked GO/PVA also show potential for load-bearing applications such as articular cartilage regeneration.\n\nEthylene glycol is used in PEG (ylation) and is one of several toxic alcohols that have medical and toxicological importance; if untreated, ingestion of ethylene glycol can be fatal. Although propylene glycol is a commonly used solvent for intravenous medications, it becomes toxic when administered in large doses over a short period. Iatrogenic propylene glycol can cause the following: hyperosmolality, anion gap metabolic acidosis, acute kidney injury, multisystem organ failure, refractory hypotension, arrhythmias, hemolysis, renal dysfunction, seizure, coma, CNS depression and seizures. Ethylene glycol’s toxicity mainly results from the accumulation of its toxic metabolites. Ethylene glycol is a central nervous system (CNS) depressant that produces acute effects similar to those of ethanol. These CNS effects predominate during the first hours after exposure. If undetected or untreated, ethylene glycol ingestion can cause serious or fatal toxicity.\n\nThe main toxicity of ethylene glycol results from hepatic metabolism of ethylene glycol to glycoaldehyde, glycolate, glyoxylate, and oxalate. These metabolites inhibit oxidative phosphorylation and cellular respiration, glucose and serotonin metabolism, protein synthesis, DNA replication, and ribosomal RNA formation. Other effects include CNS depression and cardiopulmonary and renal failure. The accumulation of organic acid metabolites, especially glycolic acid, results in an elevated anion gap metabolic acidosis.\n\nThe following severe cardiovascular effects have been reported in persons 12-24 hours after ingesting ethylene glycol: Hypertension or hypotension, Dysrhythmias (from electrolyte abnormalities), Congestive heart failure with cardiogenic pulmonary edema, Circulatory collapse, Cardiac arrest, and Death.\n\nThe initial phase of ethylene glycol poisoning in humans is characterized by inebriation caused by unmetabolized ethylene glycol. The following effects are common in acute poisoning cases:\n\nAtaxia, Slurred speech, Drowsiness, Irritation, Restlessness, and Disorientation. Possible consequences of neurologic effects in severe poisonings include the following: Myoclonic jerks, Convulsions, Coma, and Death. Cerebral edema and deposition of calcium oxalate crystals in the walls of small blood vessels in the brain contribute to this CNS toxicity. Some studies have documented brain dysfunction with corresponding cranial computed tomography (CT) findings after ethylene glycol ingestion, such as low-density areas in the basal ganglia, thalami, midbrain, and upper pons.\n\nAccording to some investigators, effects on cranial nerves appear late (generally 5–20 days after ingestion) and constitute a fourth, late cerebral phase in ethylene glycol. The following cranial nerve effects have been reported after acute exposure: Facial palsy, Hearing loss, Dysphagia, Ophthalmoplegia, and Visual disturbances.\n\nInhaled ethylene glycol can irritate the respiratory tract. Throat and upper respiratory irritation were the most common complaints after prolonged experimental exposures in humans. Exposure to 60 ppm aerosolized ethylene glycol caused noticeable respiratory irritation. Exposure to 80 ppm aerosolized ethylene glycol was “intolerable” because respiratory discomfort developed rapidly. Pulmonary edema, adult respiratory distress syndrome (ARDS), and death have occurred in persons exposed to ethylene glycol. The following respiratory effects often occur 12 hours or more after exposure in victims of severe ethylene glycol poisoning: Tachypnea, Hyperventilation, Kussmaul respirations, and severe metabolic acidosis.\n\nEthylene glycol victims revealed the following: Pulmonary edema with diffuse hemorrhagic exudates, Bronchopneumonia, Deposits of calcium oxalate crystals in lung parenchyma. Nephrotoxicity after ethylene glycol ingestion typically occurs 24-72 hours after acute exposure. Nausea, vomiting, and abdominal pain often occur soon after ethylene glycol ingestion. Also, leukocytosis, methemoglobinemia, and bone marrow arrest. Reported musculoskeletal effects have included: muscle tenderness and elevation of creatine kinase.\n\nEthylene glycol exposure was teratogenic to mice and rats, resulting in craniofacial and neural tube closure defects and skeletal dysplasia. Oral doses of ethylene cause developmental toxicity in those animals, including: axial skeletal malformations, reduced body weights, external malformations, and increased post-implantation loss.\n\nThe Battle Between Light (Photons) and Dark (Graphene)\n\nPhotomedicine is a type of biotechnology that specializes in the therapeutic application of light – “light medicine.” It uses non-ionizing electromagnetic radiation in dermatology, oncology, surgery, radiology, DNA manipulation, and diagnostics. The fundamental particle of light is referred to as a photon. Photons are both a particle and a wave. They are deemed to carry no charge and have no mass. In a biological system, photons are emitted when electrons move from one energy state to another. Photomedicine is used to treat various conditions, such as tissue injuries, psoriasis, seasonal affective disorder, and other circadian rhythm disorders, cancer and tumors, and alopecia.\n\nWeak emission of light from cells in a living organism were discovered by the Russian embryologist Alexander Gurwitsh in 1926, who called them mitogenetic rays. Half a century later, the German researcher Fritz Albert Popp, a Nobel Prize nominee in Physics, re-confirmed their existence and established the term biophoton. Popp experimentally demonstrated that dozens of photons of light are emitted every second from every square centimeter of biological area. Popp proved that biophoton emission is not confined to thermal radiation or bioluminescence.\n\nDiagnostic photomedicine involves the use of light for various imaging technologies, e.g. X-ray, MRI, and PET. Other forms of photomedicine include photodynamic therapy (PDT), low-level laser therapy (LLLT), and LED therapy. Photodynamic therapy (PDT) is a treatment that involves light-sensitive medicine and a light source to destroy abnormal cells. It can be used to treat some skin and eye conditions, as well as certain types of cancer.\n\nPhotodynamic therapy can be used to treat abnormal cells in parts of the body that a light source can reach, such as the skin, eyes, mouth, food pipe, esophagus, and lungs. Common conditions treated with PDT include: actinic keratoses, Bowen’s disease, basal cell carcinoma, macular degeneration, esophageal cancer, mouth cancer, lung cancer, warts, acne and Paget’s disease.\n\nWhen some photomedicines are exposed to the light, they activate and cause a reaction that damages nearby cells. This allows small abnormal areas of tissue to be treated without the need for surgery. Infrared light can heal cells and tissue while ultraviolet kills cells and tissue and is particularly effective at “turning off” targeted genes with the use of luciferase and luciferin. Bioluminescence is the outcome of the oxidation of luciferin and the enzyme luciferase. This is exemplified by bioluminescent organisms such as the firefly. Using light to turn DNA on and off effects the fields of DNA biotechnologies, synthetic biology, and epigenetics.\n\nAfter several independent studies demonstrated that living cells do not just radiate light, they also absorb light, scientists are now investigating the existence of a new form of communication using light. Biophotons could offer that supplementary signaling pathway next to electrical and chemical pathways for intra- and intercellular communication. It is known that photosensitive biomolecules of cells and neurons can absorb biophotons and transfer the absorbed biophotons energy to nearby biomolecules by resonance energy transfer, which can induce conformation changes and trigger complex signal processes in cells and between cells. Indeed, hollow microtubules with constant inner diameters inside the brain could act as optical fibers for biophoton transmission within brain nerve cells. A significant relationship between the fluctuation function of microtubules due to biophotons emission and alpha-EEG has been detected.\n\nIt has been suggested that the major source of biophotons is the DNA. The first supporting fact is that cells emit biophotons even when the cytoplasm is damaged, however when the nuclei is removed, biophoton emission stops. Red blood cells, which have no active chromatine (DNA) are the only cells which do not emit biophotons. The mechanism of biophoton absorption, storage and emission is however not well understood.\n\nPhotomedicine has been particularly effective at regenerating frayed DNA telomere. This ability for DNA repair indicates the possible medicines of the future. Some of the most effective pain relief comes from application of LED light, infrared light, and laser light directly to the effected area. These devices are over-the-counter “light medicine.” In effect, light heals and the use of light-absorbing graphene oxide, in all of its forms, kills.\n\nWhether we want it or not we are in the midst of a life and death battle for our own bloodstream. The enemy has the high ground, the money, the controlling infrastructure and a host of evil bioweapons disguised as safe and secure “medicines.” Iatrogenic death is considered by many to be the number one cause of death in America – doctor and drug induced death. The medical industry is one of death, not life. We are all in the cross-hairs of Big-Pharma who overtly claim that six billion people need to die, soon. The above article indicated the methods of delivery and the bombs they are using to cull humanity world-wide. But, darkness can’t see very far into the future because humans are extremely unpredictable and most do not consciously wish to turn to the dark side.\n\nFortunately, it is “light medicine” that may be the answer to dispelling the darkness of medical fake-science that has humanity in a death-grip. It has often been said in many religions, myths, and belief systems – light will win the day and dispel the darkness. Just turn on the light of consciousness and gain the gift of discernment to guide you through this vale of darkness and misery created by doctors, scientists, and politicians. Then, the light of a new day will dawn, and the dawn-treaders and forerunners will lead us to a new science of medicine based, literally, on light and love.", "opengraph": {"type": "article", "title": "Biden Executive Order Demands New BioWeapon To Alter Human Beings", "url": "https://aim4truth.org/2022/09/16/biden-executive-order-demands-new-bioweapon-to-alter-human-beings/", "description": "Both Donald Trump and Joe Biden are agents of Big Pharma which has the goal of exterminating the natural human being and turn any surviving humans into transhuman enhanced cyborgs.", "article:published_time": "2022-09-16T22:10:14+00:00", "article:modified_time": "2022-09-16T22:10:14+00:00", "site_name": "American Intelligence Media", "image": "https://i0.wp.com/aim4truth.org/wp-content/uploads/2022/09/Biden-Executive-Order-1.jpg?fit=1200%2C675&ssl=1", "image:width": "1200", "image:height": "675", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/5297c557-bdce-4991-9b05-11364ae65a62", "https://tylagabriel.substack.com/p/will-we-become-beings-of-light-or"], "authors": [], "publish_date": "2022-09-16T22:10:14+00:00"}