{"result_id": "024043", "URL": "https://aim4truth.org/2021/09/16/the-azar-fauci-trump-coronavirus-pandemicfiat-on-jan-31-2020-was-based-on-hhs-fraud/", "timestamp": "2023-04-25 12:02:15 CEST+0200", "meta": {"description": "HHS Secretary Alex M. Azar II, had no healthcare-related basis for declaring a national health emergency. In addition, Azar backdated his emergency declaration to Jan. 27, 2020— five (5) days earlier. By backdating his national emergency to Jan. 27, based on only five (5) COVID-19 deaths—one day before Lieber was indicted, Secretary Azar protected his…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/aim4truth.org/wp-content/uploads/2017/02/cropped-aim-4-truth-png.png?fit=32%2C32&ssl=1", "canonical": "https://aim4truth.org/2021/09/16/the-azar-fauci-trump-coronavirus-pandemicfiat-on-jan-31-2020-was-based-on-hhs-fraud/", "encoding": "UTF-8"}, "image": null, "domain": "aim4truth.org", "title": "The Azar-Fauci-Trump coronavirus pandemic fiat on Jan. 31, 2020 was based on HHS fraud", "cleaned_text": "\n• Only five people had died from COVID—there was no statistical health threat.\n• Four months earlier, on Sep. 24, 2019, Trump issued Executive Order 13887 on pandemic speed scenarios describing COVID-19, uncannily; hindsight shows this COVID-19 madness was seemingly premeditated.\n• Azar backdated to Jan. 27, 2020—five days earlier—his one-sentence declaration. (Trollers are claiming this was a clerical error by $1,000 per hour corrupt attorneys—redundant, we know).\n• Azar was not following his WHO handlers since his U.N. WHO co-conspirators had not yet declared a “pandemic,” which they did later, on Mar. 11, 2020—six weeks later.\n• Azar and Trump evidently jumped the gun to protect their bio-nano-5G-chemical warfare super-spy-agent, Harvard-NIH Dr. Charles M. Lieber who had been indicted on Jan. 28, 2020—one day after the backdate.\n• On Feb. 13, 2020—two weeks later, Kristin Debord, PhD, Acting Director of the Assistant Secretary for Preparedness and Response, made no mention of the COVID-19 “emergency” declaration in her presentation to the National Vaccine Advisory Committee (NVAC). The CDC said the opposite: “The immediate risk in the United States is low at present.” No immediate risk, or pandemic? Contradictory official statements and pregnant silences are lies/fraud… by bureaucrats who nevertheless want to mass inject the public with untested cocktails using any deception that works.\n• Yet, just nine weeks later, Debord initiated Operation Warp Speed on Apr. 29, 2020—she went from no emergency to hair on fire. Government agencies cannot tie their shoes in nine weeks.\n• Tellingly, the FDA issued a deceptively worded warning on Apr. 10, 2020 against using IVERMECTIN to treat COVID—four weeks after secretly declaring the pandemic. (Note: The FDA had approved it for human use on Oct. 8, 1998. Japanese researchers call it a “wonder drug” and “astonishingly safe for human use”).[1]\n• Why did “You’re Fired!” Trump hire so many British Pilgrims Society globalists like Cohen, Mnuchin, Ross, Fauci, Birx, Tillerson, Pompeo, Devos, Haspel, Chao, Pence, Mattis, Votel, Milley, Barr, Sessions?\n• Was Trump duped, or in on the scam with Azar, Fauci, Gates?\n• Fraud always unwinds judgments and resulting actions as the fruit of a poisoned tree—backdating legal orders is not a clerical error, it is criminal. HHS lawyers were playing games with the American Republic.\n\n[1] Andy Crump, Satosjo Ōmura, ed. (Feb. 10, 2011). Ivermectin, ‘wonder drug’ from Japan: the human use perspective. Proceedings of the Japan Academy. Series B, Physical and biological sciences, 87(2): 13–28. Reproduced for educational purposes only. Fair Use relied upon. Source: https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3043740/# \n\n\n\nA.D. Santin (Yale), D.E. Scheim, P.A. McCullough (TX A&M), M. Yagisawa (ICRC Kitasato Univ.), T.J. Borody (CDD Aus). (Aug. 03, 2021). Ivermectin: a multifaceted drug of Nobel prize-honoured distinction with indicated efficacy against a new global scourge, COVID-19, New Microbe and New Infect 2021; 43: 100924, Elsevier Ltd. Reproduced for educational purposes only. Fair Use relied upon. Source: https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8383101/pdf/main.pdf\n\n(Sep. 16, 2021)—On Sep. 09, 2021, Pretender Biden and the illegitimate U.S. Administration issued an “Executive Order on Requiring Coronavirus Disease 2019 Vaccination for Federal Employees.”\n\nIn Section 1, Biden cited his authority as the “nationwide public health emergency, first declared by the Secretary of Health and Human Services on January 31, 2020.” Fig. 1.\n\nFirstly, given that Biden’s pretender “presidency” was fraudulently obtained, his election fraud negates this action. See evidence of this fraud in various election fraud legal actions in Arizona, Pennsylvania, Wisconsin, Michigan, New York, Georgia, among other states. See Absolute Proof for the mountain of hard evidence.\n\nSecondly, Alex M. Azar II, Secretary of Health and Human Services (HHS), executed the underlying emergency on Jan. 31, 2020 when there were only five (5) COVID-19 deaths in the United States, according to the Center for Disease Control (CDC). Therefore, the health statistics did not support his action, which is another fraud. Figs. 2, 4.\n\nInterlocking International Entanglements at the FDA, HHS, CDC and NIH\n\nAzar was not following the agreements of his U.N. WHO handlers who have control over the FDA, HHS, CDC and NIH regarding pandemics (the WHO PIP Framework, see below).\n\nThe interlocking agreements with WHO are convoluted. We will not do screen captures here to save space.\n\nThe 21st Century Cures Act governs health authority for pandemics in the U.S. (H.R. 34, 114th Congress, 2015-2016). Section 3093 gives HHS authority over vaccines. Section 3092 gives the CDC authority over immunization.\n\nThe CDC established the CDC Collaborating Center Terms of Reference (2014) with the World Health Organization (WHO). The CDC’s WHO Collaborating Center’s Terms of Reference regarding “pandemic influenza preparedness” is the controlling agreement.\n\nU.S. medical leaders and legislators gave away U.S. healthcare sovereignty to the U.N. WHO (controlled by the British Pilgrims Society)\n\nThe CDC agreed to be controlled by WHO ANNEX 5 of the PIP Framework (WHO PIP–Pandemic Influenza Preparedness) that “will guide all activities” of participating WHO Collaborating Centres [sic] to “select and develop candidate influenza vaccine viruses with pandemic potential.” These centers, including the U.S., UK, Australia (UK) and Japan agreed “to be bound by the core terms of reference.”\n\nThe U.N. World Health Organization did not declare COVID-19 to be a pandemic until Mar. 11, 2020—six weeks later. Fig. 3.\n\nTherefore, HHS Secretary Alex M. Azar II, had no healthcare-related basis for declaring a national health emergency.\n\nIn addition, Azar backdated his emergency declaration to Jan. 27, 2020— five (5) days earlier. Fig. 4.\n\nBackdating a legal document is normally fraudulent on its face (not even counting the other frauds highlighted herein). The exceptions to backdating don’t apply here since this decision was so grave, affecting every man, woman and child in America. Proper diligence was swept under the carpet in Azar’s rush to execute. An inadvertent mistake excuse by highly paid attorneys for a one-sentence declaration is laughable.\n\nThis action begs the question as to why those five days were so critical.\n\nOn Jan. 28, 2020, the federal government indicted Harvard/Chinese nano-biowarfare researcher Dr. Charles M. Lieber in Boston. Lieber holds 66 U.S. patents in nanotechnology, much of it funded by Dr. Anthony S. Fauci and the National Institute of Health (NIH) as well as Harvard, DARPA, MITRE Corporation, Air Force Office of Scientific Research and the Office of Naval Research (each patent delineates the federal agencies that funded Lieber in the “Government Interests” section).\n\nResearchers are now discovering Lieber’s nanoparticles in the COVID-19 vials.\n\nBy indicting Lieber, the Justice Department effectively shielded and silenced him from public scrutiny, including his role in biowarfare activities in China just prior to the alleged Wuhan outbreak.\n\nLieber’s father, Robert I. Lieber, was an MI-6-controlled C.I.A. senior satellite engineer for Radio Corporation of America (RCA). He even received the David Sarnoff Outstanding Achievement Award in Engineering in 1962. His work on the Aegis satellite system for the U.S. Navy is integral to the deployment of 5G today.\n\nSarnoff was a leading member of the British Pilgrims Society, as highlighted in Congress in 1940 by Rep. Dr. Jacob Thorkelson (Montana 1st).\n\nBy backdating his national emergency to Jan. 27, based on only five (5) COVID-19 deaths—one day before Lieber was indicted, Secretary Azar protected his British Pilgrims Society’s super-agent, Dr. Charles M. Lieber, under the cover of a pandemic that he evidently knew was planned by U.N. WHO (another fraud), but for which Azar and Trump obviously jumped the gun, for some reason. He was six weeks ahead of his British U.N. WHO handlers.\n\nBackdating federal judgments is fraudulent and unwinds ALL subsequent actions, including the fraudulent Pretender Biden’s latest Executive Order\n\nThis backdating, and its interlocked frauds, completely unwinds the COVID-19 nightmare that the British Pilgrims Society, and its sycophants in the American government, have put America and the world through since late January of 2020.\n\nTheir agenda to implement medical genocide and achieve their obsession for a “new world order” tyranny, also known as “The Great Reset,” has become patently obvious to any reasonable person.\n\nThe Golden Rule, not The Great Reset\n\nThese criminals must be brought to justice by We The People in the United States and Patriots of the World. Our tyrannical governments must be set aside and The Golden Rule must be made supreme in civil discourse and economy.\n\nLord Have Mercy and Godspeed to all who love liberty.\n\nHere is this article in a flyer format for easy sharing on social media:\n\nPROOF: The Fauci/British Pilgrims Society-led U.S. medical establishment has conspired against showing the efficacy of IVERMECTIN to stop COVID-19 without the need for profit-taking/making “vaccines”\n\nThis need to be pushed out EVERYWHERE by themselves. Proves in mountains of peer-reviewed studies he Fauci, HIH, CDC, WHO propaganda against Invermectin is a FRAUD.\n\n[1] Andy Crump, Satosjo Ōmura, ed. (Feb. 10, 2011). Ivermectin, ‘wonder drug’ from Japan: the human use perspective. Proceedings of the Japan Academy. Series B, Physical and biological sciences, 87(2): 13–28. Reproduced for educational purposes only. Fair Use relied upon. Source: https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3043740/# \n\n\n\nA.D. Santin (Yale), D.E. Scheim, P.A. McCullough (TX A&M), M. Yagisawa (ICRC Kitasato Univ.), T.J. Borody (CDD Aus). (Aug. 03, 2021). Ivermectin: a multifaceted drug of Nobel prize-honoured distinction with indicated efficacy against a new global scourge, COVID-19, New Microbe and New Infect 2021; 43: 100924, Elsevier Ltd. Reproduced for educational purposes only. Fair Use relied upon. Source: https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8383101/pdf/main.pdf\n\nIVERMECTIN was approved by the FDA in 1998 – before Fauci and his British handlers at The Pirbright Institute were on a roll with the COVID poison program.\n\nNorman Schmuff, Ph.D. Chem. Team Leader, DNDC III. (Oct. 08, 1998). Drug Approval Package to Merck & Co., Inc., Frank Ricci, approving Stromectol (Ivermectin) Tablets, 6 mg, then 3 mg., App. No. 050742s001, Dec. 12, 1997. U.S. FDA. Center for Drug Evaluation and Research. Sources: https://www.accessdata.fda.gov/drugsatfda_docs/nda/98/50-742s001_Stromectol_Approv.PDF | https://www.accessdata.fda.gov/rugsatfda_docs/nda/98/50-742s001_Stromectol.cfm\n\nRead the deceptively worded “Letter to Stakeholders” (Fauci propaganda) muddying the waters about the efficacy of IVERMECTIN and discouraging its use to eliminate the COVID threat out of the chute. It did not link to the FDA’s own approval to Pfizer of IVERMECTIN in 1998 (Pfizer had a financial interest in suppressing this information).\n\nWho are the FDA’s stakeholders if not We The People?\n\nBelow are some memes you can use to get the word out to your downline.", "opengraph": {"type": "article", "title": "The Azar-Fauci-Trump coronavirus pandemic fiat on Jan. 31, 2020 was based on HHS fraud", "url": "https://aim4truth.org/2021/09/16/the-azar-fauci-trump-coronavirus-pandemicfiat-on-jan-31-2020-was-based-on-hhs-fraud/", "description": "HHS Secretary Alex M. Azar II, had no healthcare-related basis for declaring a national health emergency. In addition, Azar backdated his emergency declaration to Jan. 27, 2020— five (5) days earli…", "article:published_time": "2021-09-16T22:01:05+00:00", "article:modified_time": "2021-10-24T16:06:30+00:00", "site_name": "American Intelligence Media", "image": "https://i0.wp.com/aim4truth.org/wp-content/uploads/2021/09/King-Kong-Don-Trump.jpg?fit=1200%2C880&ssl=1", "image:width": "1200", "image:height": "880", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.fbcoverup.com/docs/library/2019-09-19-Exec-Order-13887-Modernizing-Influenza-Vaccines-in-the-United-States-to-Promote-National-Security-and-Public-Health-by-Donald-Trump-Pres-Vol-84-No-185-Fed-Reg-Sep-19-2019.pdf", "https://www.fbcoverup.com/docs/library/2020-02-13-Meeting-Minutes-National-Vaccine-Advisory-Committee-(NVAC)-incl-Kristin-DeBord-PhD-HHS-Alan-Embry-PhD-NIAID-(Fauci)-pp-16-17-HHS-NVAC-Feb-13-14-2020.pdf#page=16", "https://www.fbcoverup.com/docs/library/2020-02-13-Meeting-Minutes-National-Vaccine-Advisory-Committee-(NVAC)-incl-Kristin-DeBord-PhD-HHS-Alan-Embry-PhD-NIAID-(Fauci)-pp-16-17-HHS-NVAC-Feb-13-14-2020.pdf#page=8", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3043740/", "#_ftn1", "#_ftnref1", "https://www.fbcoverup.com/docs/library/2011-02-10-Ivermectin-'wonder-drug'-from-Japan-the-human-use-perspective-Procdngs-of-Japan-Academy-Series-B-Physical-and-biolgcl-sncs-by-Andy-Crump-Satosjo-%C5%8Cmura-ed-87(2)-13%E2%80%9328-Feb-10-2011.pdf", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3043740/", "https://www.fbcoverup.com/docs/library/2021-08-03-Ivermectin-multifaceted-drug-of-Nobel-distinction-w-efficacy-against-COVID-19-scourge-by-AD-Santin-Yale-et-al-New-Microbe-n-New-Infect-2021-43-100924-Elsevier-Aug-03-2021.pdf", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8383101/pdf/main.pdf", "https://www.bitchute.com/video/nUao0btUd20P/", "https://michaeljlindell.com/", "https://www.congress.gov/bill/114th-congress/house-bill/34", "https://www.cdc.gov/flu/weekly/who-collaboration.htm", "https://apps.who.int/gb/pip/", "https://www.whitehouse.gov/briefing-room/presidential-actions/2021/09/09/executive-order-on-requiring-coronavirus-disease-2019-vaccination-for-federal-employees/", "https://www.cdc.gov/nchs/nvss/vsrr/COVID19/", "https://pubmed.ncbi.nlm.nih.gov/32191675/", "https://www.phe.gov/emergency/news/healthactions/phe/Pages/2019-nCoV.aspx", "https://www.fbcoverup.com/docs/library/2020-05-11-FIRST-AMENDED-WHISTLEBLOWER-AFFIDAVIT-re-HIGHLANDS-GROUP-illegal-DARPA-meetings-May-11-2020.pdf", "https://patft.uspto.gov/netacgi/nph-Parser?Sect1=PTO2&Sect2=HITOFF&p=1&u=%2Fnetahtml%2FPTO%2Fsearch-bool.html&r=0&f=S&l=50&TERM1=%22Lieber%2C+Charles%22&FIELD1=INNM&co1=AND&TERM2=&FIELD2=&d=PTXT", "https://americans4innovation.blogspot.com/2020/04/part-1-rca-nbc-founder-pilgrim-david.html", "https://www.fbcoverup.com/docs/library/1940-08-06-GPO-CRECB-1940-pt-19-v86-1-Steps-Toward-British-Union-a-World-State-and-International-Strife-PTS-I-IX-Remarks-of-Hon-J-Thorkelson-MN-House-of-Reps-Gov-Printing-Off-Aug-06-1940.pdf", "https://www.justice.gov/opa/pr/harvard-university-professor-and-two-chinese-nationals-charged-three-separate-china-related", "http://english.sinano.cas.cn/ns/es/201305/t20130506_101653.html", "https://aim4truth.org/wp-content/uploads/2021/09/2021-09-16-The-Azar-Fauci-Trump-coronavirus-pandemic-fiat-on-Jan-31-2020-was-based-on-HHS-fraud-by-Anonymous-Patriots-Sep-16-2021-1.pdf", "https://aim4truth.org/wp-content/uploads/2021/09/2021-09-16-The-Azar-Fauci-Trump-coronavirus-pandemic-fiat-on-Jan-31-2020-was-based-on-HHS-fraud-by-Anonymous-Patriots-Sep-16-2021-1.pdf", "https://www.fbcoverup.com/docs/library/2011-02-10-Ivermectin-'wonder-drug'-from-Japan-the-human-use-perspective-Procdngs-of-Japan-Academy-Series-B-Physical-and-biolgcl-sncs-by-Andy-Crump-Satosjo-%C5%8Cmura-ed-87(2)-13%E2%80%9328-Feb-10-2011.pdf", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3043740/", "https://www.fbcoverup.com/docs/library/2021-08-03-Ivermectin-multifaceted-drug-of-Nobel-distinction-w-efficacy-against-COVID-19-scourge-by-AD-Santin-Yale-et-al-New-Microbe-n-New-Infect-2021-43-100924-Elsevier-Aug-03-2021.pdf", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8383101/pdf/main.pdf", "https://www.fbcoverup.com/docs/library/1998-10-08-Stromectol-(Ivermectin)-Tablets-6mg-approved-Drug-App-Pkg-to-Merck-Frank-Ricci-App-No-050742s001-Dec-12-1997-Norman-Schmuff-PhD-DNDC-III-US-FDA-Oct-08-1998.pdf", "https://www.accessdata.fda.gov/drugsatfda_docs/nda/98/50-742s001_Stromectol_Approv.PDF", "https://www.accessdata.fda.gov/rugsatfda_docs/nda/98/50-742s001_Stromectol.cfm", "https://www.fbcoverup.com/docs/library/2020-04-10-Letter-to-Stakeholders-re-IVERMECTIN-Coronavirus-(COVID-19)-Update-Daily-Roundup-April-10-2020-Press-Release-FDA-Apr-10-2020.pdf", "https://www.fda.gov/animal-veterinary/product-safety-information/fda-letter-stakeholders-do-not-use-ivermectin-intended-animals-treatment-covid-19-humans", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-daily-roundup-april-10-2020"], "authors": [], "publish_date": "2021-09-16T22:01:05+00:00"}