{"result_id": "024042", "URL": "https://aim4truth.org/2022/10/02/indictable-evidence-for-the-international-tribunal-of-crimes-against-humanity/", "timestamp": "2023-04-25 12:02:14 CEST+0200", "meta": {"description": "These people need to be tried in an international tribunal, then arrested for crimes against humanity. Their executions need to be televised on all the main stream propaganda channels. Dr. Anthony Fauci – NIH, NIAID Robert Redfield – US Centers for Disease Control and Prevention (Toxic Substances) Dr. Ralph Baric – Carolina Vaccine Institute at…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/aim4truth.org/wp-content/uploads/2017/02/cropped-aim-4-truth-png.png?fit=32%2C32&ssl=1", "canonical": "https://aim4truth.org/2022/10/02/indictable-evidence-for-the-international-tribunal-of-crimes-against-humanity/", "encoding": "UTF-8"}, "image": null, "domain": "aim4truth.org", "title": "Indictable Evidence for the International Tribunal of Crimes Against Humanity", "cleaned_text": "Indictable Evidence for the International Tribunal of Crimes Against Humanity\n\nDr. Douglas Gabriel posted this article back in September 2021. We are re-publishing it below at the request of some readers.\n\nDr. Richard M. Fleming has given all the indictable evidence we need to start arresting and convicting the criminals behind the current plandemic that has devastated the entire world economically and killed and maimed millions globally. His book: Is COVID-19 a Bioweapon, A Scientific and Forensic Investigation provides the blow-by-blow plan to create a viral bioweapon of mass destruction. He provides the proof of the U. S. sources of funding to the criminals who set out to violate all laws concerning gain-of-function biological research to create a laboratory created synthetic virus that was designed to kill as many people as possible. He offers the original documents that prove Anthony Fauci and his gang of bio-criminals at the National Institutes of Health (NIH), the Center for Disease Control and Prevention (CDC), and many other U. S. Federal agencies used to gain grants and patents to turn public laboratories into killing machines with U. S. taxpayer monies. He also gives the dates and contents of publications wherein these criminals brag about their research to the world without shame and with seeming impunity.\n\nWe have summarized and condensed the excellent work of Dr. Fleming into a readable form for layman who might not be familiar with medical terms concerning this deadly research. Fleming does not draw conclusions or demand judicial action to be taken against these “war actors”, but you will yourself, no doubt, come to the same conclusions that we did when presented with the overwhelming evidence that shows the broad trail of crimes that have led to our current world dilemma. You will surely ask the question, Why aren’t these criminals in jail and being held accountable for their consciously perpetrated crimes? This question, which is inevitable, needs to be addressed by law enforcement, the Department of Justice, the U. S. Congress, the president of the United States and any honest judges left in this country to defend U. S. Civil Rights and the United States Constitution. These crimes must be prosecuted if freedom and life as we know it are to continue to go on in America.\n\nIn 2002, following the SARS-CoV-1 outbreak in China, Dr. Shi Zhengli-Li and colleagues at the Wuhan Institute of Virology began investigating how SARS-CoV-1 was transmitted. In particular Zhengli was interested how SARS-CoV-1 was transmitted from person to person. To do this, she developed chimeric (Gain-of-Function) coronaviruses using human immunodeficiency, virus-based pseudovirus systems (laboratory man-made viruses) with the cell lines of people, civet cats, and horseshoe bats. In March 2004, the US Health and Human Services agency announced that it was going to create the National Science Advisory Board for Biosecurity to be managed by the National Institutes of Health, thus consciously violating U. S. laws prohibiting such research. In 2005, Dr. Ralph Baric published a paper declaring he could alter the genome of coronaviruses. In 2006, using chimeric (Gain-of-Function) research, Chinese scientists in Wuhan reported their ability to combine parts of four different viruses into a single viral genome. They combined parts of four viruses: hepatitis C, human immunodeficiency virus (HIV-1, AIDS), SARS-CoV-1, and SARS-CoV-2. Thus, COVID-19 was made in a laboratory as an attempt to kill human beings.\n\nWhen the Swine Flu vaccine of the mid-1970s produced neurological damage, including Guillain-Barre syndrome, following the first twenty-five deaths, the swine flu vaccine and vaccination program was stopped by the U. S. government. Today the Vaccine Adverse Event Reporting System (VAERS) shows thousands of deaths following SARS-CoV-2 vaccinations with over 400,000 experiencing severe adverse effects, and yet, this CDC provide data has not ended the use of COVID vaccines (DNA manipulation fake-vaccine) and the harmful vaccination program killing and harming Americans.\n\nTwo published papers looking at the consequences of the SARS-CoV-2 spike protein penetrating the brain of humanized mice and rhesus macaques show brain inflammation, mad cow disease (Spongiform encephalopathy), and Alzheimer disease. (Mariano Caroosino et al., January 2021 & Ingrid HCHM Philippens et al., May 5, 2021.) In other words, even though all of the mice showed damaging inflammation in their lungs, all the animals died due to brain damage with the virus entering the brain though the olfactory system (nose).\n\nIt is critical to understand that it makes no difference whether the spike protein of SARS-CoV-2 is introduced into the body via person-to-person transfer or via injection of biologicals (vaccines), the effect is the same.\n\nIn 2012, an investigation into Gain-of-Function research resulted in a voluntary moratorium that lasted almost one year and ended in January 2013 due to the dangers of biological experimentation concerning all viruses. In 2014, shortly thereafter, Ralph Baric and Chinese researchers published a paper demonstrating the differences between spike proteins that can infect bats and those capable of infecting people. This research was funded by National Institutes of Health grants RO1AI089728 and R21AI109094. In October of 2014, only one year after lifting the moratorium, the Obama Administration placed a ban on Gain-of-Function research after it was discovered that the CDC had accidentally exposed workers to Anthrax and “unwittingly” shipped out samples of influenza virus contaminated with the deadly H5N1 virus.\n\nIn 2015, Baric and Zhengli both announced they had “reengineered, through Gain-of-Function, the spike protein of coronavirus so they could infect human cells.” (Y. Yang et al., Journal of Virology 89, no 17, 2015) This research was paid for by NIH grants RO1AI089728 and RO1AI110700. Recommendations for the oversight of Gain-of-Function research were made on April 7, 2016, and approved on March 15, 2016, by the National Science Advisory Board for Biosecurity. Dr. Anthony Fauci is an ex officio member of that board. But this notwithstanding, the research moved forward in America and China.\n\nThe U. S. law that will put bioweapon makers and funders into jail is:\n\nUnited States Federal Code 12 U.S.C. Chapter 10–175 – which expressly prohibits such biological weapons and makes it a criminal offence.\n\n(a) In General. – Whoever knowingly develops, produces, stockpiles, transfers, acquires, retains, or possesses any biological agent, toxin, or delivery system for use as a weapon, or knowingly assists a foreign state or any organization to do so, or attempts, threatens, or conspires to do the same, shall be fined under this title or imprisoned for life or any term of years, or both.”\n\nOther provisions for prosecution of bioweapon makers, producers, conspirators:\n\nBiological Weapons Convention Treaty of 1969 – signed and ratified by the United States of America in 1972. It is a violation of the treaty to develop, acquire, retain, or produce any biological agent or toxin that has no justification for prevention or peaceful purposes.\n\nThe Nuremberg Code 1947 – includes such principles as informed consent, absence of coercion, properly formulated scientific experimentation, and demands beneficence towards experiment participates.\n\nInternational Covenant on Civil and Political Rights-1976 – provides for respect for civil and political rights of individuals, including the right to life, freedom of religion, freedom of speech, freedom of assembly, electoral rights, and rights to due process.\n\nIn October of 2014, the US government issued a policy statement regarding Gain-of-Function research including the following restrictions:\n\n“New [US government] funding will not be released for gain-of-function research projects that may be reasonably anticipated to confer attributes to influenza, MERS, or SARS viruses such that the virus would have enhanced pathogenicity and/or transmissibility in mammals via the respiratory route.”\n\nRobert Redfield – US Centers for Disease Control and Prevention (Toxic Substances)\n\nDr. Ralph Baric – Carolina Vaccine Institute at the University of North Carolina\n\nWe can find the criminals behind the plandemic by looking at publications and documents from the Department of Defense, National Institute of Health (National Institute of Allergy and Infectious Diseases), Centers for Disease Control and Prevention, Food and Drug Administration, Health and Human Services, National Science Foundation, EcoHealth Alliance, U. S. Agency for International Development, Department of Commerce, Department of Agriculture, Department of the Interior, U. S. Patent and Trademark Office, National Biosurveillance Integration Center, and other federal agencies.\n\n1974 – The first reported genetically altered (Gain-of-Function) virus QB phage was created.\n\n1985 – Ralph Baric began working with coronaviruses in the mid-1980s. In 1985, while at the University of California (UCLA) conducted research on recombinant viruses, including coronaviruses which was paid for by the National Science Foundation and U. S. Public Health and Human Services agency (HHS) by grant A1 19244.\n\n2000 – Researcher in Spain and Paul Ahlquist from the University of Wisconsin showed how combining complementary DNA with nuclear expression of RNA allowed the researchers to develop a synthetic virus. The spike protein of the virus was replaced with the spike protein from another virus creating a chimeric (Gain-of-Function) virus that infected the gastrointestinal system of pigs. The researchers discovered this could now be done with dogs, cats, and humans.\n\n2000 – With funding from NIH (Grant A1 239476) Ralph Baric and others enhanced a transmissible gastroenteritis virus. This infective transmissible virus, produced synthetically in a laboratory, was indistinguishable from the wild-type virus.\n\n2001 – German researchers used smallpox virus DNA to produce an infectious coronavirus using restriction enzymes that work like molecular scissors to cut DNA and ligate it into a vector. (Masters, 1999; Almazan et al., 2000; Yount et al., 2000). With this DNA manipulation, it became possible to rapidly generate a large collection of genetically modified coronaviruses. Expression of multiple subgenomic mRNAs in infected coronaviruses formed the basis of creating vector systems, each encoded with heterologous protein. These features could then be exploited in the development of a new class of RNA vaccine vectors.\n\n2001 – In May, Ralph Baric and colleagues applied for a patent to manipulate genes and profit from genetic manipulation of plants, animals, bacteria, and viruses – including coronaviruses. The patent was granted on July 15, 2003. This research was supported by U. S. taxpayer monies.\n\n2003 – Baric and others published research funded by NIH (grants A123946, GM63228, A126603) showing they could rescue SARS-CoV Urbani viruses by using reverse genetics. They then could fully clone SARS viruses. This process increased the infectivity for SARS-CoV-2 and has been shown to insert its genetic sequence into the human DNA. This research was funded by the NIH (1U19AI131135-01, 5R01MH104610-21).\n\n2006 – Chinese researchers spliced four target cDNA segments together to form a single 1,200-nucleotide-long RNA sequence. This chimeric (Gain-of-Function) sequence included combining hepatitis C viruses, human immunodeficiency virus (HIV-1 AIDS), and SARS-CoV-2.\n\n2007 – In May, a patent was granted for isolation of human SARS-Co-V-1 to the U. S. Department of Health and Human Services agency (HHS). This established the polymerase chain reaction (PCR) test to find the virus. In April, 2020, the FDA issued an umbrella Emergency Use Authorization for PCR testing of SARS-Co-V-2.\n\n2007 – Dr. Zhengli and colleagues in Australia demonstrated that insertions placed in spike proteins made it possible for SARS-CoV to infect human cells.\n\n2013 – Baric and colleagues discovered four critical genes that were expressed following SARS-CoV infections that created lung damage through fibrin that caused blood clotting. This was funded by NIAID, NIH, HHS, and the National Center for Advancing Translational Sciences (HHSN272200800060C; 5UL1RR02414).\n\n2014 – In March, Baric applied for an international patent for the Methods and Compositions for Chimeric (Gain-of-Function) Coronavirus Spike Proteins with support from NIH grant U54AI057157.\n\n2014 – Dr. Li Meng Yan discovers that SARS-CoV-1 was a genetically modified (Gain-of-Function) virus that was a bioweapon developed by the Chinese Communist Party, with SARS-CoV-2 being the upgraded version of this bioweapon.\n\n2015 – Baric and Zhengli received funding from Peter Daszak of EcoHealth Alliance and NIH to publish their research that had used reverse genetics to generate a pathogenic chimeric virus, formed from parts of various animals, that could not be controlled by the use of drugs and could cross the blood-brain barrier of humans. They concluded that these viruses were able “to replicate in human airway cultures, cause pathogenesis, and escape current therapeutics.” Further funding for this bioweapon came from National Natural Science Foundation of China, the Wuhan Institute of Virology, University of North Carolina, University of Texas Medical Branch, USAID, and the U. S. Central Intelligence Agency (CIA).\n\n2015 – In September, Zhengli and Baric reengineered, through mutations (Gain-of-Function), the spike protein of MERS to increase infectivity of humans through viral entry into human cells. (NIH Grants RO1AI089728, RO1AI110700).\n\n2015 – Peter Daszak and EcoHealth Alliance denounce a laboratory origin of this virus insisting on a zoonotic (animal) origin of this bioweapon.\n\n2012 – In January, Peter Daszak leads the World Health Organization “team of experts” to the Wuhan Institute of Virology and insists the great amount of missing documents concerning SARS-CoV-2 was irrelevant. No connection between SARS-CoV-2 and the Wuhan laboratory was found by Daszak’s team.\n\nThis timeline of crime is proof positive of the crimes against humanity that the Cast of Criminals and their agents have committed by creating a biological Weapon of Mass Destruction. The time has come for them to answer for their crimes.", "opengraph": {"type": "article", "title": "Indictable Evidence for the International Tribunal of Crimes Against Humanity", "url": "https://aim4truth.org/2022/10/02/indictable-evidence-for-the-international-tribunal-of-crimes-against-humanity/", "description": "These people need to be tried in an international tribunal, then arrested for crimes against humanity. Their executions need to be televised on all the main stream propaganda channels. Dr. Anthony …", "article:published_time": "2022-10-02T23:15:16+00:00", "article:modified_time": "2022-10-06T17:47:21+00:00", "site_name": "American Intelligence Media", "image": "https://i0.wp.com/aim4truth.org/wp-content/uploads/2017/02/american-intelligence-bw-aim4truth.png?fit=820%2C827&ssl=1", "image:width": "820", "image:height": "827", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2022-10-02T23:15:16+00:00"}