{"result_id": "024048", "URL": "https://aim4truth.org/2021/09/12/rudolf-steiner-on-the-question-of-vaccinations/", "timestamp": "2023-04-25 12:02:19 CEST+0200", "meta": {"description": "it would not take a medical degree to know that these substances are dangerous for human consumption, let alone injection into the human bloodstream. One can only imagine that health is not the goal of these vaccines, and then the question arises: Why are “they” poisoning people with vaccines? The answer is not clear, but…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/aim4truth.org/wp-content/uploads/2017/02/cropped-aim-4-truth-png.png?fit=32%2C32&ssl=1", "canonical": "https://aim4truth.org/2021/09/12/rudolf-steiner-on-the-question-of-vaccinations/", "encoding": "UTF-8"}, "image": null, "domain": "aim4truth.org", "title": "Rudolf Steiner on the Question of Vaccinations", "cleaned_text": "Rudolf Steiner on the Question of Vaccinations\n\nDr. Douglas Gabriel gives a presentation on the subject, followed by a comprehensive post on the indications Rudolf Steiner made about vaccinations.\n\n“A great majority of the population looks on with complete indifference as the medical papacy assumes ever greater proportion, worming its way into the most diverse fields – for instance, intervening extensively in children’s education, in school life, and staking a claim here to a certain form of therapy.” Rudolf Steiner, GA 107\n\nIllness is big business in America. Doctors, hospitals, drugs companies, and medical insurance companies combined make over 1.5 trillion per year in America alone. This is approximately 5% of the total GDP of America that goes to Big Med, Big Pharma, and Big Hospitals. This industry depends on sick clients. According to a recent study by Johns Hopkins, more than 250 thousand people in the United States die every year because of medical mistakes (iatrogenic death), making it the third leading cause of death after heart disease and cancer. Other sources claim that number is more likely to be over 440 thousand deaths per year, making iatrogenic death (mistakes of doctors) one of the leading causes of death in America each year. When you also add the admitted 4 to 100 million people who were given tainted polio shots that have caused countless illnesses and deaths, Big Med seems to do as much damage as they do good.\n\nQuoting from the Hearing before the Subcommittee on Human Rights and Wellness of the Committee on Government Reform House of Representatives of the One Hundred Eighth Congress on September 10, 2003: “There is no dispute that millions of Americans received polio vaccines that were contaminated with the virus called Simian Virus 40, or SV-40. There also is no dispute that SV-40 is capable of causing cancer, but there is a major dispute as to how many Americans may have received the contaminated vaccine, with estimates ranging from 4 million to 100 million people. There is also a major dispute as to when the polio vaccine supply got cleaned up. In addition, nobody knows how many people got sick or died because of the contaminated vaccines.”\n\nAccording to the Center for Disease Control and Prevention’s (CDC’s) National Center for Health Statistics, cancer kills approximately 599 thousand people per year. There is no dispute that many of those deaths are caused by the polio vaccines of the 1950’s and 1960’s. Thus, if you add iatrogenic deaths (doctor induced) and vaccine deaths (pharmaceutical doctor induced) you have the number one cause of death in America being induced by Big Med with the help of vaccines provided by Big Pharma and mandated by the killer vaccine industry called the Center for Disease Control and Prevention (CDC) and supported by the National Institutes of Health (NIH). Also, many people believe that the SV-40 vaccine also contributes to the 650 thousand who die each year from heart disease and the 85 thousand who die from diabetes.\n\nIt is also important to remember that the CDC and NIH “approve” cigarettes and simply put a warning on cigarette packages saying can kill you. Tobacco is responsible for more than 480 thousand deaths per year in the United States, including more than 41 thousand deaths resulting from secondhand smoke exposure – murder by association. This is about 1,300 deaths every day. On average, smokers die ten years earlier than nonsmokers and yet they are not outlawed by doctors and governmental agencies claiming to be protecting American’s health.\n\nCDC members own 56 patents connected to vaccinations, including nucleic acid vaccines for prevention of flavivirus infection (Yellow Fever, Zika, Dengue, West Nile Virus, and many more), various vaccination testing methods (including an artificial lung system for aerosol vaccines and a process that screens new vaccines for human rhinoviruses), adjuvant patents, assays that assist vaccine development and facilitate monitoring systems, and patents for vaccine quality control. The CDC’s patents and vaccines are exempt from prosecution by – 42 U.S. Code § 300aa–22: “(1) No vaccine manufacturer shall be liable in a civil action for damages arising from a vaccine-related injury or death associated with the administration of a vaccine after October 1, 1988, if the injury or death resulted from side effects that were unavoidable even though the vaccine was properly prepared and was accompanied by proper directions and warnings.”\n\nThe CDC Immunization Safety Office is responsible for investigating the safety and effectiveness of all new vaccinations; once an investigation is considered complete, a recommendation is then made to the CDC’s Advisory Committee on Immunization Practices (ACIP) who then determines whether the new vaccine will be added to the current vaccination schedule. Members of the ACIP committee include physicians such as Dr. Paul Offit, who also serves as the chief of infectious diseases at the Children’s Hospital of Philadelphia. Offit and other CDC members own numerous patents associated with vaccinations and regularly receive funding for their research work from the very same pharmaceutical companies who manufacture vaccinations which are ultimately sold to the public. This situation creates an obvious conflict of interest, as members of the ACIP committee benefit financially every time a new vaccination is released to the market.\n\nEach of the twelve members of the CDC’s ACIP Committee has a significant influence on the health of nearly every member of the American population. Many own vaccination related patents and/or stock shares of the pharmaceutical companies responsible for supplying new vaccines to the public. Others receive research grant money, funding for their academic departments, or payments for the oversight of vaccine safety trials. ACIP members claim they are able to remain unbiased despite the rewards they receive every time a new vaccination is mandated to the public. In numerous instances, vaccines released to the market are later removed after serious side effects are documented. The rotavirus vaccine was one such example; it was pulled from the market in 1999, a year after its initial approval. In 2001, the House Government Reform Committee found that four out of the eight ACIP members who voted to approve the vaccine had direct financial ties to one or more of the pharmaceutical companies who produced the vaccine for public use. Similar situations involving many other vaccinations have been independently documented over the course of nearly twenty years.\n\nThe vaccination industry currently generates $30 billion in profit each year, some of which reaches the hands of the very people who create the vaccine schedule. Despite concerns connecting vaccinations to the increase in autism and a host of other disorders, the number of recommended vaccines continues to grow each year.\n\nThe safety and efficacy of vaccines is questionable at best, and criminal in many cases. As of 2008, super paramagnetic iron oxide (and graphene) nanoparticles have been added to most vaccines for children, as well as the flu, pneumonia, and shingles vaccines, among others. And now, mRNA gene manipulation is flying under the false flag of claiming to be a vaccine approved for emergency use authorization with the Covid-19 “fake vaccine.” Use of this GMO vaccine abnegates the life insurance policy of anyone who takes this “experimental drug”, and yet the public is not warned of these deadly realities and informed consent laws are being ignored and grossly violated.\n\nSimply looking at the some of the ingredients found in standard vaccines reveals a list of potentially deadly substances that no one would agree to if the rules of informed consent were followed. Below is a partial list of some of the more dubious and draconian ingredients approved by the CDC and NIH to be active and inactive ingredients that they publicly justify, even though many are known carcinogens and poisons.\n\nAluminum, squalene oil, thiomersal, thimerosal, gelatin, sorbitol, stabilisers, emulsifiers, taste improvers, antibiotics, egg proteins, ovalbumin, yeast proteins, latex, formaldehyde, acidity regulators, human cell strains, animal cell strains, recombinant DNA, bovine products, viruses, bacteria, antigens, genetically modified organisms, aluminum salts, preservatives, human serum albumin, excipients, aluminum hydroxide, aluminum phosphate, potassium aluminum sulphate, pneumococcal viruses, flu viruses, polysorbate 80, sorbitan trioleate, sodium, mercury-based preservatives, ethyl mercury, sugar, lactose, mannitol, glycerol, medium 199, arginine hydrochloride, monosodium glutamate, urea, polysorbate 80, antibiotics, penicillins, cephalosporins, sulphonamides, neomycin, streptomycin, polymyxin B, gentamicin, kanamycin, gentamicin, yeast proteins, glutaraldehyde, disodium adipate, succinic acid, sodium hydroxide, hydrochloric acid, histidine, sodium borate, borax, trometamol, human cell lines, lung cells from aborted fetuses, HEK-293 cell line, adenovirus, kidney cells aborted fetuses, animal cell lines, chick embryo rotavirus cells, coronavirus spike protein, bacterium, hepatitis B virus, bovine products, graphene oxide, iron oxide, super paramagnetic nanoparticles, paramagnetic hydrogels, medium 199, eagle medium, and minimum essential medium, among others.\n\nAs you can see, it would not take a medical degree to know that these substances are dangerous for human consumption, let alone injection into the human bloodstream. One can only imagine that health is not the goal of these vaccines, and then the question arises: Why are “they” poisoning people with vaccines? The answer is not clear, but the outcome of millions of deaths indicate draconian intentions through a protracted war on the human bloodstream. We seem to be in the Pharmaceutical World War III that is being conducted with needles and pills instead of bullets and bombs. Thus, one can only conclude that vaccines are not meant to create good health, but in fact are meant to feed the biggest industry in America – the medical industry’s need for illness.\n\n“Disease is an experience of a so-called mortal mind. It is fear made manifest on the body.” Mary Baker Eddy\n\nRecently, a few articles have arisen from Anthroposophic sources that indicate that Rudolf Steiner was “in favor” of vaccines and therefore a tacit approval for the Covid-19 fake-vaccine is given the authoritative approval of Dr. Steiner. This is not true and we have pulled together a number of Dr. Steiner’s indication from numerous lecture cycles to demonstrate that his opinion was neither for, nor against vaccines, but rather, depended on many elements including: geographical area, personal history, age, prior conditions, awareness of the true spiritual nature of the illness, fear of the illness, and many other possible factors.\n\nOne quote in particular that has been repeatedly highlighted insinuates that Dr. Steiner supported smallpox vaccinations in his day. Once a close examination of all the many references to vaccines and childhood illnesses are examined, it is obvious that Dr. Steiner did not approve of blanket vaccination, especially for young children. And it must be kept in mind that in Dr. Steiner’s time, vaccines were not laced with poisons and carcinogens as they are today. A comprehensive study of Dr. Steiner’s remarks makes it clear that each individual case must be studied with care and in relation to the bigger picture.\n\nThree of the articles below are from Anthroposophical doctors who carefully outline the bigger picture concerning the use of vaccines. They present an overall view of the spiritual factors that must be considered for each person as the informed choice of vaccination is addressed. The many other selections of Dr. Steiner’s concerning vaccines and childhood illness presented below are taken from the painstaking work of our friend, David Adams, who compiled these indications for the use of people who wish to become more familiar, and properly informed about Steiner’s true position and opinions concerning these medical questions. We thank David for his labor of love and the comprehensive job he did in providing the full picture of Dr. Steiner’s Anthroposophical medical indications.\n\n“To prevent disease or to cure it, the power of Truth, of divine Spirit, must break down the dream of the material senses.” Mary Baker Eddy\n\nThe Fall of the Spirits of Darkness, A Future Vaccine to Prevent Knowledge of Soul and Spirit, Rudolf Steiner, October 7, 1917, Rudolf Steiner Press, Bristol, 1993, GA 177, p. 85.\n\nThe time will come – and it may not be far off – when quite different tendencies will come up at a\n\ncongress like the one held in 1912 and people will say: It is pathological for people to even think in terms of spirit and soul. ‘Sound’ people will speak of nothing but the body. It will be considered a sign of illness for anyone to arrive at the idea of any such thing as a spirit or a soul. People who think like that will be considered to be sick and – you can be quite sure of it – a medicine will be found for this. The soul will be made non-existent with the aid of a drug. Taking a ‘sound point of view,’ people will invent a vaccine to influence the organism as early as possible, preferably as soon as it is born, so that this human body never even gets the idea that there is a soul and spirit. The heirs of modern materialism will look for the vaccine to make the body ‘healthy,’ that is, make its constitution such that this body no longer talks of such rubbish as soul and spirit, but takes a ‘sound’ view of the forces which live in engines and in chemistry and let planets and suns arise from nebulae in the cosmos.\n\nMaterialistic physicians will be asked to drive the souls out of humanity.\n\nThe spirits of darkness are now among us. I have told you that the spirits of darkness are going to inspire their human hosts, in whom they will be dwelling, to find a vaccine that will drive all inclination toward spirituality out of people’s souls when they are still very young, and this will happen in a roundabout way through the living body. Today, bodies are vaccinated against one thing and another; in future, children will be vaccinated with a substance which it will certainly be possible to produce, and this will make them immune, so that they do not develop foolish inclinations connected with spiritual life – ‘foolish’ here, or course, in the eyes of materialists.\n\nA way will finally be found to vaccinate bodies so that these bodies will not allow the inclination toward spiritual ideas to develop and all their lives people will believe only in the physical world they perceive with the senses. Out of impulses which the medical profession gained from presumption – oh, I beg your pardon, from the consumption [tuberculosis] they themselves suffered – people are now vaccinated against consumption, and in the same way they will be vaccinated against any inclination toward spirituality. This is merely to give you a particularly striking example of many things which will come in the near and more distant future in this field – the aim being to bring confusion into the impulses which want to stream down to earth after the victory of the Michaelic spirits of light in 1879.\n\nPeople who think that playful ideas will help them to look ahead to the future are very much mistaken. We need serious, profound ideas to look ahead to the future. Anthroposophy is not a game, nor just a theory; it is a task that must be faced for the sake of human evolution.\n\nLet us take a certain case. I will construct quite an idealistic one – the true theory of smallpox. Real smallpox calls up a very strong Inspiration, with Intuition as well. And the knowledge that that comes to you here, when you are real therapists in this domain, works much more strongly upon you – when it is real knowledge – than does a vaccination; in a different sense it works much more strongly and in studying the therapy of smallpox as a physician you will bring about a kind of healing in yourself in advance, prophylactically, and will therefore be able, when you understand the connection, to go among smallpox patients without fear, and full of love. But all these things have their other side too. As I have said, if the knowledge of a medicament is a true imaginative or inspired knowledge – then the healing forces are there; it need not even by one’s own imagination, it may be that of someone else. In itself it has healing forces. Even to have the idea of a medicament has an effect, and it works. But it works only so long as you are without fear. Fear is the opposite pole to love.\n\nWhat is above all things for medicine is courage, the courage to heal. Think of the illness of smallpox which reveals itself in physical symptoms. But suppose you were able to do the following: Picture in yourselves a person suffering from smallpox who in his astral body and ego organization had the power today to draw out the whole illness and to experience it only in the astral body and in the ego, so that in that moment his physical and etheric bodies would be well. Suppose such a thing were hypothetically possible. What I have said cannot actually happen, but if you want to have this imagination you must do the same thing as I have described as a hypothetical case, without your physical body and etheric body having smallpox. In the astral body and ego organization, free from the physical and etheric bodies, you must experience the illness of smallpox. In other words, you must experience, spiritually, a spiritual correlate of physical illness. The illness of smallpox is the physical image of the condition in which ego organization and astral body are when they have such an Imagination.\n\nIf one has a heavenly Imagination such as that of which I spoke, one knows what smallpox is, because it is only the physical projection of what is experienced spiritually. And so it is, really, with all knowledge of illness.\n\nPhysiology and Healing: Treatment, Therapy and Hygiene, Smallpox and Smallpox Vaccination, Discussions with Medical Practitioners, Rudolf Steiner, April 22, 1924, Rudolf Steiner Press, Forest Row, 2013, GA 314, pp. 237-239.\n\nWith a condition such as smallpox, the situation for the individual person is that the I organization withdraws to a greater degree from all three other human bodies, from physical, ether, and astral body. This powerful withdrawal, this weakening of the I organization, may be due to the fact that the individual slips very much into the I’s of earlier lives on earth with his present I; because of this the I organization shows marked affinity to the spiritual world altogether. With smallpox, it is worth noting that there is some similarity with the things a person goes through with certain forms of initiation. Strange though it may seem, that is how it is.\n\nWhen someone gets to know the actions of the figures in the zodiac on human beings, really gets to know them inwardly, such states of insight involve powerful inner shocks. This the individual can at least go through in that it acts in a more controlled way, this situation with smallpox, more at the soul level, because human beings live very powerfully in the spiritual sphere with smallpox, though in a different way. We may say that with smallpox the danger of infection is extraordinarily great. We should not carelessly plump straight for physical means of transmitting the disease, however. With smallpox the mental disposition plays a particularly great role. One proof of this would be that one is able to protect oneself extremely well if one is able to contain oneself in the right way. One can protect oneself if one absolutely treats the sick person objectively, like any object, a stone or a shrub, with no feelings of fear or other emotions, but treats them as an objective fact. With this you counter the risk of infection to a high degree. The mental factor can thus play a considerable role when it comes to catching things.\n\nI have actually never shied away from exposing myself to any danger of infections and have really never caught anything, have never got myself infected. This did show that mere awareness, powerful awareness of the existence of a disease, can bring about the disease through the astral body. Powerful awareness of a disease can be the cause of that disease arising from the astral body.\n\nAnd smallpox vaccination? There we find ourselves in a peculiar position. You see, when you vaccinate someone and you are an anthroposophist, bringing him up in the anthroposophical way, it will do no harm. It will harm only those who grow up with mainly materialistic ideas. Then vaccination becomes a kind of ahrimanic power; the individual can no longer rise above a certain materialistic way of feeling. And that is really why vaccination causes us concern, because people are ‘garbed through’ with a phantom. The individual has a phantom which prevents him from freeing the psychic entities as far from the physical organism as in a normal state of consciousness. He grows constitutionally materialistic, is no longer able to rise to the spiritual sphere. This is what causes concern with vaccination.\n\nStatistics will of course be quoted, and we must ask ourselves if we really must rate statistic so highly exactly in this respect. Smallpox vaccination has very much to do with the psyche. It is certainly possible that belief that this vaccination is effective plays an incalculably great role in this. If we were to replace this belief with something else, if we were to educate people in a way that is in accord with nature, so that they would be impressed by something other than that we are vaccinating them, let us say by taking them closer to the spirit again, then it would certainly be possible for us to be as effective against the unconscious imposition of ‘there’s a smallpox epidemic here’ with fully conscious awareness that ‘there’s a spiritual element here, unjustifiable, yes, but I must stand up to it’ which is just as effective, and we must altogether make the person strong in the face of such influences.\n\nHow should one handle this under the kind of difficult conditions in our area, with education and so on having such a negative influence? Then you simply have to vaccinate. There’s no other choice. I would be absolutely against opposing these things in a fanatical way, not for medical but for generally anthroposophical reasons. Fanatical opposition to these things is not something we aim for, wanting instead to provide insight so that things might change on the greater scale. I have always seen this as something I had to combat when with medical friends such as Dr. Asch, for instance, who absolutely did not vaccinate. I would always fight against this. For if he does not vaccinate, someone else will. It is utterly absurd to be fanatical in particular situations.\n\nManifestations of Karma, Karma of the Higher Beings, Rudolf Steiner, Hamburg, 16th to 28th May, 1910, Lecture 8, GA 120\n\nThe case might be such that, in removing the external expression of uncharitableness, we should undertake the duty of influencing the soul also in such a way as to remove from it the tendency towards a lack of charity. The organic expression of uncharitableness is killed in the most complete sense, in the external bodily sense, by vaccination against smallpox. There, for instance, the following becomes manifest, and has been investigated by Spiritual Science. In one period of civilization, when there prevailed a general tendency to develop a higher degree of egotism, and uncharitableness, smallpox made its appearance. Such is the fact. In anthroposophy it is our bounded duty to give expression to the truth.\n\nNow it will be clear why in our period the protection of vaccination appeared. We also understand why, among the best minds of our period, there exists a kind of aversion to vaccination. This aversion corresponds to something within, and is the external expression of an inner reality. So if on the one hand we destroy the physical expression of a previous fault, we should, on the other hand, undertake the duty of transforming the materialistic character of such a person by means of a corresponding spiritual education. This would constitute the indispensable counterpart without which we are performing only half our task. We are merely accomplishing something to which the person in question will himself have to produce a counterpart in a later incarnation. If we destroy the susceptibility to smallpox, we are concentrating only on the external side of karmic activity. If on the one side we go in for hygiene, it is necessary that on the other we should feel it our duty to contribute to the person whose organism has been so transformed, something also for the good of his soul. Vaccination will not be harmful if, subsequent to vaccination, the person receives a spiritual education. If we concentrate upon one side only and lay no emphasis upon the other, we weigh down the balance unevenly. This is really what is felt in those circles which maintain that where hygienic measures go too far, only weak natures will be propagated. This of course is not justifiable, but we see how essential it is that we should not undertake one task without the other.\n\nHere we approach an important law of human evolution which acts so that the external and the internal must always be counter-balanced, and that it is not permissible to act with regard to the one only, leaving the other out of consideration. We here get a glimpse of an important relationship, and yet we have not even arrived at the significance of the question: ‘What is the relationship between hygiene and karma?’ As we shall see, the answer to this question will lead us still further into the depths of karma, and we shall further see that there exist karmic relationships between man’s birth and death. In addition, other personalities influence a human life, and man’s free will and karma are in harmony.\n\nThe flu is related to all the diseases, such as bronchitis, that can afflict the human head or the organs of the upper chest, but I will refer particularly to illnesses such as diphtheria and influenza that are so widely prevalent just now. These diseases afflict the upper part of the human body, and they have a definite peculiarity. They can best be studied by examining diphtheria; here one really can learn the most.\n\nWhen I see people suffering from influenza, I must always turn my attention to something other than the symptoms that the doctors pay heed to, because the flu is actually a kind of brain illness. The flu is really an illness of the brain! I shall say more about this later.\n\nThe following points must especially be taken into consideration regarding diphtheria. First, if you look at a child suffering from diphtheria – adults can also suffer from it, you know – you can see a membrane in the throat. This membrane, this formation of tissue, is usually what can cause suffocation in diphtheria. The second thing one notices in diphtheria is that the heart of a diphtheria patients is always attacked. The heart does not function properly. The third aspect of diphtheria is that even if the patient is not strongly afflicted by the membrane in his throat, he nevertheless has a hard time swallowing because of a kind of paralysis of the throat that occurs in addition to the membrane. Finally, the same symptom that is nowadays observed in those suffering from influenza also appears in diphtheria patients: their eyes begin to cross and they see double. These are the most important symptoms of diphtheria that can be noted in the upper part of the body. A form of kidney ailment, unobserved in those who suffocate and die, appears as an after-effect in the diphtheria patients who recover.\n\nWhat does diphtheria really consist of? Diphtheria can be understood only when one knows that Man is actually kept alive from two directions – from the outside in and from the inside out. Man lives first from within his skin. within his surroundings. The skin is constantly in contact with the outer air, with the external world, which causes it to become calloused. In humans it only becomes a little calloused and then sloughs off. The skin all over Man’s body constantly sloughs off. He is constantly exchanging his physical body because of outside influences.\n\nAside from this life proceeding from the outside in, there is also a life passing outwards from inside, particularly from the kidneys. Both must be active in the human being. Activity both from the skin inwards and from the kidneys outwards must be at work. The heart occupies a position in between and is highly sensitive to too much activity from outside or within. The heart can sense when the kidneys begin to be overactive, and it also senses when the skin’s activity begins to be too strong or too weak.\n\nNow, what happens in the case of diphtheria? In diphtheria the skin suddenly becomes weak and subdued. The activity of the skin is too weak, so a person with diphtheria suffers from too little exchange of air through the skin. Indeed, this is the main problem. The skin, including the skin of the nose exposed to the external surroundings, does not breathe enough, and it becomes too weak. The instreaming activity no longer functions properly, and the heart senses this. The heart also senses that the kidneys’ work is rising upwards. Long before inflammation of the kidneys, that is nephritis, sets in, the activity of the kidneys is already shooting upwards. Because the skin activity is no longer working effectively from outside, superfluous skin forms on the inside filling everything out, because the kidneys’ activity is too strong.\n\nWhen a person becomes afflicted with shrunken kidneys, which can occur when the kidneys’ activity is deficient, you can see an indentation here on the head. There is a connection between the kidneys and this section of the head. As soon as the kidneys’ activity is not working properly, this indentation occurs. You can see in every person who has kidney disease this indentation in the head. Beneath it lie the optic nerves. When the indentation occurs, the optic nerves become inactive. In the case of ordinary kidney shrinkage, the patient begins to see unclearly. When shrinkage does not occur but nephritis sets in instead, the kidney activity shoots up into the head and exerts an influence on the optic nerves. Now, you see, the optic nerves are such that when the head is viewed from above, they proceed back from the eyes. They cross in the brain, the two optic nerves, and continue on to the hindbrain. The moment these optic nerves that cross are not working properly, we see double. The optic nerves only need to be a little numbed and the crossing not made properly for us to see double.\n\nThe kidneys’ activity also has a stimulating effect on the optic nerves. If the optic nerves do not interact properly at the point where they cross people see double. This is the case, for example, in diphtheria. You can see, therefore, that diphtheria is caused by a disorder in the skin’s activity. Therefore, a future, more successful cure for diphtheria will consist above all of treating the patient in the right way with baths; he will have to be given baths that will immediately vigorously stimulate the skin’s activity. Then the formation of membranes will cease, and the patient’s skin will begin to function properly again.\n\nTreatment with modified virus vaccine is effective in the case of diphtheria, because the body is thus given a strong impulse to become active, but it has unfavorable after-effects. Particularly if a child is treated with vaccine, it will later suffer a hardening of its organization. One must therefore strive to replace vaccines with bathing treatment, especially in the case of diphtheria, which is caused primarily by the effective activity of the skin.\n\nIt is indeed true that diphtheria is more frequent now than in former times. Of course, one must think in terms of centuries, not decades. According to all that is known of earlier ages however diphtheria was more rare. This is connected with the fact that, in general, the European way of life increasingly leads in a direction in which the skin’s activity is no longer supported. You can also see the ill effect of civilization in the fact that bald-headed people are much more numerous today than in the past. The growth of hair is also an outer activity; in the case of diphtheria, one must try above all to bring about a proper activity of the skin.\n\nThis is also connected with a factor that affects people’s offspring. Take a mother or father whose skin is too sluggish and doesn’t slough off easily enough. This is most difficult to determine and takes very sensitive insight into human peculiarities and characteristics. This is difficult to determine, because the skin is actually transparent. As it sloughs off, it appears to be colored differently because of what is underneath. Our skin is really transparent. So if a father has a skin that is much tougher than it should be, this also influences the activity of the bones – the production of blood depends on the activity of the bones. If the father has such calloused skin that it reminds you of hippopotamus hide, he will produce white corpuscles that are too weak. This, in turn, influences his sperm, and his children will be weak from the\n\nbeginning. It is possible for his children to be born with the English disease of rickets, for them to be born weak and to be susceptible to tuberculosis. If the father’s skin is too soft, something that can be noted particularly when anxiety and so on easily cause blushing, then his bones become too hard, but his has no serious ill-effect. If, however, the mother’s skin is too soft, alternating between blushing and paling, her bones become too hard and she does not produce red corpuscles properly. At an early age already her child will acquire tendencies to all kinds of ailments such as rheumatism, and particularly illnesses like measles, scarlet fever, and so on, diseases that are related to the metabolic system. These facts are all related.\n\nNow, as for the flu, it really comes from a brain ailment. The lower part of the brain, located under the optic nerves, suffers a form of paralysis. The flu consists of a paralysis of that portion of the brain that lies quite near the optic nerves. Since this is a very significant part of the brain, an influence is actually exerted on the entire body. Proceeding from this paralysis in the brain, something in the human being becomes ill in the case of ordinary flu. Above all, the spinal cord is affected, since this part of the brain goes right into the spine, from which the nerves extend to all the limbs. The person thus gets aches and pains in his limbs, and so on, particularly in the vicinity of this part of the brain here [pointing to sketch], which is incapacitated during flu with much cranial fluid present. When the solid part [of the brain] is partially numbed, the ensuing symptoms are brought about through the working of the solid part of the brain on the spinal cord. The fluid, however, constantly flows up and down through the spinal canal here [drawing]. Hence, if the fluid in the brain is afflicted, affected fluid also appears in the spinal canal, and from here it passes into all the limbs. It thereby gradually creates inflammation everywhere. Because it was the cranial fluid that was inflamed, and not the solid part of the brain, however, a more counteractive, healing force was present and a patient can recover.\n\nAlthough various remedies must also be administered, in such illnesses it is essential that the body be given adequate rest and quiet. The patient must therefore lie in bed, and care should be taken to keep the room at a constant temperature and with steady, gentle lighting, because rest is not only brought about by stretching out on a bed. If the body is left totally to its own devices in conditions of steady warmth and light, it can itself endure even the worst attacks of pneumonia, pleurisy, and peritonitis. The human being is capable of that. Even with the worst illnesses that display the symptoms mentioned, it is more a matter of proper nursing care than of remedies.\n\nOne must always consider the individual and know him well if one wishes to cure him; one must have insight into what a person is like. In dealing with a patient suffering from diphtheria, for instance, it is under certain conditions best to place him in a rosemary bath so he can smell the rosemary. Repeated long rosemary baths will strengthen the activity of his skin. Sufficient rosemary must be added to the water, however, so that the patient constantly smells it during the bath. The activity of the skin is stimulated, and the patient will improve without being treated with vaccine. It really depends upon being able to use remedies in the right way to stimulate the patient’s own bodily resistance.\n\nOne must remember that the flu actually has its origin in an ailment of the brain. You will have perceived that a flu patient is always in a kind of doze, because the most important areas of the brain under the optic nerve are numbed. Thus he comes to doze. Now you can also grasp that when paralysis is located in the upper sections of the brain, the point of intersection of the optic nerves is affected and the person sees double. All this shows you that double vision can come about quite naturally in influenza. This should be no means be taken lightly because the intestines and the brain are connected.\n\nAll processes in the human being proceed outwards from within and inwards from without. If a person is cross-eyed for internal reasons and this condition is externally corrected, he can become ill inwardly [perhaps with intestinal symptoms]; in Man, one never deals with a single activity but with two activities that meet in the heart. The heart is in a mediating position. The heart is not a pump but a most delicate apparatus, which really perceives everything that is out of order. The heart’s function can be influenced from within as well as from without. In all illnesses in which this is the case – that is, when something is wrong with a process so that it is prevented from running its course outwards from within or inwards from without – it will be noted that this comes to expression in the heart.\n\nAir, or particularly the oxygen in the air, is constantly absorbed through the surface of a person’s skin, and along with the ordinary breathing process of his lungs one can also speak of his skin’s breathing. If a person has his lungs and skin for breathing, then he also needs an opposite, and that opposite is located in the liver – we must learn to view it as the opposite of the skin-lung activity; the liver and the skin-lung activity balance each other. One could say that the liver’s constant purpose is to bring into order internally what a human acquires through breathing in his relationship with the outer world. That is what the liver is for.\n\nNow imagine that the liver malfunctions. When this happens, all the activity of the lungs and skin is also thrown out of balance, and then a specific problem arises. Through quite delicate blood vessels, the blood circulation reaches everywhere into the skin, into the lungs, and also into the liver. If the liver’s function is impaired, the blood cannot flow properly in and out of the liver. If, because of a liver problem, the blood flows into it too strongly and the liver becomes overactive, too much bile is produced and the person becomes jaundiced. What happens, however, when the liver’s activity is too weak? The blood’s activity on the surface of the skin is not compensated for. The blood, which flows everywhere, wishes to be compensated, and the blood in the liver investigates, as it were, whether or not the liver is behaving properly. If the liver isn’t behaving properly, the blood rushes to the surface of the body to replenish itself there. What happens? Smallpox is the result. This is the connection between smallpox and a blood circulation which, due to a defective liver, has something wrong with it. The circulation of the blood rightly makes a point of contact with the breathing, and whether this occurs in the lungs or the skin really does not matter, because it balances itself out. If the air that enters through the breathing process does not make contact with the blood in the correct way, however, smallpox results.\n\nWhat is smallpox? Smallpox is really the result of the development of too much respiratory activity on the body’s surface or in the lungs. A person becomes too active over his surface area, and this activity causes inflammation everywhere. What can be done under these circumstances? Well, people already do the only thing that can be done in such cases. They vaccinate with cowpox vaccine. What does cowpox vaccine really accomplish? The vaccine inwardly permeates the body, because the blood circulates everywhere. Whereas the blood is otherwise compensated for on the body’s surface, it now has to cope with the vaccine. The overactivity on the surface is thus prevented. Smallpox inoculation does indeed have a certain significance. The blood, which is not properly engaged by the liver, is now busy with the vaccine. Generally, there is good reason for all methods of inoculation. You have perhaps heard that a large part of our healing is based on injections, because an activity occurring in the wrong place can thereby be directed to another part of the human body.\n\nInoculation against rabies is especially interesting. Though rabies comes from something altogether different, it is basically the same response as I described in connection with smallpox. Imagine that a person is bitten by a rabid dog or wolf. Such an animal has actual poison in its saliva. This poison now enters the victim through the bite, and the person becomes involved in detoxifying the poison. He may be too weak to do it, and he might succumb to the poison, but something else is really the cause of death. You know that a man first develops rabies before he succumbs to the poison. What is the reason for this?\n\nLet us assume that I am bitten by a rabid dog. Now I must direct all my inner activities to his spot, and I must let them flow here to use up the poison. This surge of activity is sensed by my spinal cord as though I had received a shock – my spinal cord suffers a shock through which I become ill. What must now be done to offset this shock? You know that when a person freezes in horror he can be brought to his senses by being slapped a few times. The spinal cord also needs to be slapped, but one must first get to the spine. Now, oddly enough, all substances have a way of going to specific parts of the body. The dried spinal cord of a rabid rabbit, which retains the rabies poison for a short time – about 15 minutes – before becoming ineffective, is quickly injected into the human being. It enters the human spinal cord, which thereby suffers a counter-shock. It is just as if you shake a person who is paralyzed with fear and he snaps out of it. In the case of rabies, the human spinal cord recovers from the shock by means of an inoculation with the rabid rabbit’s dehydrated spinal cord. You see, therefore, that when an activity develops in the human being in the wrong place and he becomes ill, he can be cured if almost the same process is developed in a different place.\n\n“I will restore you to health and heal your wounds, declares the Lord.” Jeremiah 30:17\n\nWolfgang Held: Why is the debate on the topic of vaccination so intense?\n\nGeorg Soldner: The topic of vaccination has been polarized ever since there have been vaccinations. As early as 1860, there were statements from vaccination supporters and opponents that sound very similar to those from today. Then, as now, both sides tend to suppress facts that contradict their own view. We also noticed this when we drafted a worldwide position statement on the part of the Medical Section and the IVAA (International Association of Anthroposophic Physicians). Even within the anthroposophic movement, the reactions are contradictory. There were colleagues who welcomed it, and colleagues who feared it would be selling out anthroposophy.\n\nIn GA 314, we can read Rudolf Steiner’s statement on vaccination in a concrete situation: “Then you have to vaccinate. There is no other choice. Because fanatical opposition to these things is something that I wouldn’t recommend at all – not for medical reasons, but for general anthroposophic reasons. Fanatical reactions to these things is not what we are striving for; rather, we want to do things differently in general. I’ve always seen this as something to fight against in my friendship with physicians. For example with Dr. Asch, who absolutely did not vaccinate. I always fought against this. Because if he doesn’t vaccinate, someone else will do it. It is completely absurd to be this fanatical in individual cases.”\n\nObviously, Steiner also said other things about vaccination, and about the importance of acute infectious illnesses for human development and for human destiny.\n\nWolfgang Held: What makes the topic of vaccination so controversial? Isn’t the victory over smallpox an impressive precedent?\n\nGeorg Soldner: A vaccine is developed for whole portions of the population, so it affects us as a community. At the same time, it intervenes in individual organisms and that creates uneasiness. The vaccine in the last 200 years was the smallpox vaccination. Smallpox has characteristics that it doesn’t share with any of the other infectious diseases that we’re dealing with now. If you are infected with smallpox, you develop the illness with 100% certainty. With polio, only one in a thousand develops paralysis. The other 999 show less severe symptoms, but are also contagious. Smallpox, which is deadly in 30% of cases, always occurs as a full-blown illness. That means that I can’t overlook a case. This illness is also so dangerous that it makes sense to vaccinate the entire population, because the mortality rate is so high. While the mortality rate for smallpox is approximately 30%, the mortality rate for measles in Germany is 0.1%. Therefore, I can’t mandate measles vaccinations in Germany using the same argument as for smallpox vaccinations. The danger level is a completely different scale of magnitude. But with measles, we also know now that there are mild cases that aren’t recognized as such for quite a while. This is why measles can survive, even if a high percentage of the population is vaccinated. While smallpox’s unique combination of characteristics allowed us to eradicate it, this is not so possible with any of the other infectious diseases we currently vaccinate for. Even polio isn’t eradicated, by the way. The oral vaccination virus can still transform back into its original aggressiveness. We will continue to vaccinate against polio for decades, because dangerous polioviruses continue to surface, some from the oral vaccination that we also used here for many years. But we have nearly eliminated it. There are very few occurrences any more in Europe. But if we stopped vaccinating for polio worldwide, it would probably come back.\n\nWith measles, we have three to four times as many cases now in Europe as we did ten years ago. This shows that every illness is different. Eradication of measles is far from being possible. The most we can hope for is that measles outbreaks are limited to only a few people through widespread vaccination of the population and careful care into adulthood. We call this elimination. That is the goal. But based on all that we know, measles cannot be eradicated. The claim is made that it can be, but the claim is false.\n\nWolfgang Held: So compulsory vaccinations for measles seem useless, right?\n\nGeorg Soldner: There are scientific studies on the question of compulsory vaccinations that show that every compulsory vaccination arouses resistance. In countries like Germany and Switzerland, compulsory vaccination is not carried out such that children are picked up by the police and forcibly vaccinated. There is only a fine. In point of fact, the vaccination rate increases more through education of the population. This is also the case in Germany for first-time measles vaccinations, which more children entering school have received than in a number of neighboring countries with compulsory vaccinations. We have always advocated that decisions on whether to vaccinate be free, informed decisions by parents or patients wherever possible. I spoke with an Indian colleague yesterday. In her country, there are areas with high child mortality where many parents still cannot read and can’t understand what a free decision on whether to vaccinate means. In areas like these with high child mortality and low levels of parent education – education as we understand it – it is not so simple to tout informed parent decisions on vaccination. Therefore, it is understandable that a country considers compulsory vaccination in some countries with widespread poverty and high child mortality. Measles, specifically, are a very frequent cause of child mortality in such regions. But in countries like Germany, the USA or Australia, the situation is different. Here, we’re talking about diseases with low to no mortality, like mumps. And here, we insist that parents or the patients themselves should decide what they want to vaccinate for, and when.\n\nWolfgang Held: So, what has changed in recent years?\n\nGeorg Soldner: What has changed is the perspective on the measles vaccination. In the last ten years, the measles vaccination has been able to show that it also triggers immunological maturation processes in those vaccinated. Not as strongly as measles itself, but less dangerously, and enough that in countries with high child mortality the measles vaccination lowers mortality more than by simply protecting against measles. Beyond measles, vaccinated children in these countries die less frequently of pneumonia and diarrhea than unvaccinated children. These findings show that the measles vaccination can support a child’s immunological development. For so-called “inactivated” or “dead vaccines”, like early vaccination against diphtheria and tetanus, the opposite is true: They have a negative influence on the immune system of infants and can potentially even raise child mortality rates in poor countries.\n\nOn the other hand, the measles vaccination has the effect, today, that in our countries certain population groups that used to be protected are now more endangered. One group is infants. A nursing mother who is vaccinated against measles does not pass her immunity on to her infant like a mother who has had measles herself. The nursing mother who has had measles can give her infant relatively strong immuno-protection, while a mother vaccinated against measles cannot. This means that infants are now at risk of measles. In infancy, measles can leave behind a terrible illness that only breaks out seven to ten years later and leads to a mental deterioration and certain death.\n\nWolfgang Held: Is the famous herd immunity turned on its head here?\n\nGeorg Soldner: Herd immunity is a term used to mean that we vaccinated people reduce the risk of infection for those who cannot be vaccinated because of a weak immune system or extreme youth. But in fact, the opposite is also true: the average age of the few measles cases that we still have here in Germany is now 20 years, and in Switzerland it is similar. The last death due to measles in Germany was of a 40-year-old. The situation is that adults born after 1970, who didn’t have measles as children and who were sometimes only vaccinated once, do not show sufficient immunity to measles. Even adults who were vaccinated twice as children can be so-called “vaccination failures.” The measles vaccine does not protect everyone. At least one percent of twice-vaccinated people do not exhibit sufficient immunity. If we vaccinate against measles already at the age of nine months, this percentage quadruples. If I vaccinate very early, more children remain unresponsive to the vaccine. And once this is the case, it is not easy to correct later. The second measles vaccination is not a booster vaccination – it is meant to fill in gaps for people who didn’t respond to the first vaccination. But it also doesn’t reach everyone – especially those who were vaccinated at very young ages. In such cases, we talk about vaccination failures. These people can also become ill with measles as adults, for whom measles are much more dangerous than for young children. Once we’re in this situation, the inherent necessity arises that we attempt to vaccinate so widely that the number of those who are not immune despite vaccination or who cannot be vaccinated because of immune disorders remains below five percent, so that outbreaks remain isolated and cannot spread.\n\nEncountering the natural measles virus strengthens my immune system. But in our countries, we have suppressed this encounter to a great extent.\n\nWe don’t know, by the way, whether this vaccine immunity, with which we have replaced natural immunity, actually lasts for a lifetime, because it is now so rare to encounter a natural measles virus. Encountering the natural measles virus strengthens my immune system. But in our countries, we have suppressed this encounter to a great extent. With all of the uncertainty regarding long-term consequences, this development creates a certain pressure to take part in measles vaccination, because now more adults or infants could contract measles and be more endangered. In the new GAÄD (German Association of Anthroposophic Doctors) leaflet on measles, which I played a key role in creating, we recommend a vaccination at a later age than is generally recommended in Germany and in Switzerland. Scientific studies show that vaccination after the age of 15 months leads to much more reliable long-term protection than vaccinating earlier. Vaccination at 9 months leaves significantly more gaps in immunity than a vaccination at 15 months.\n\nWolfgang Held: Why don’t such studies penetrate into vaccination practice?\n\nGeorg Soldner: As I said at the beginning, the way scientific findings are handled in day-to-day vaccination practice is not necessarily rational. The social development of day care plays a role. Vaccination of nine-month-old children is only recommended in Germany for children that enter day care early. These days, we even have tiny infants in day care facilities. In the DDR, it used to be quite common for children between the ages of three and six months to enter day care. This is becoming more common again today, leading to higher danger of contagion for infants. This childcare in community facilities means that the age of vaccination has had to be pushed up, contrary to what medical science has determined to be the optimal age for vaccination in terms of long-term immunity.\n\nIn the coming decades it will be a growing problem that individual adults have no reliable protection. Measles will not disappear in the next few decades. If an adult without protection travels to a country where there is still measles, for example as part of a development aid project, he or she can become infected and severely ill, and also pass on the infection to others. These are the risks. This is why it is for us Anthroposophic physicians of especially high priority – and we are pioneers in this area – to pay very careful attention to the immunity of young adults. When young adults leave my practice, I check whether they have measles immunity. This is best done with a blood test, so that vaccination failures can be identified. Just because you’ve been twice vaccinated doesn’t always mean you’re immune. In the 2015 Berlin epidemic, we saw that some of those infected had been twice vaccinated. And they sometimes exhibit less typical disease progressions that are not immediately recognized while they infect others. So the vaccinations have caused new problems. It is not the case that any given vaccination can inject eternal health, even if this is sometimes suggested.\n\nRudolf Steiner turns that thought on its head with the description of how it is the disease itself that at some point releases the vaccine, possibly because it has fulfilled its task.\n\nRudolf Steiner often characterizes the situation from different perspectives. A famous example of how we can look at something from different perspectives is the disappearance of polio. Vaccination proponents can point out that with the introduction of the polio vaccine, the number of infections fell drastically. Anyone who denies this is going against the facts. But we also know the fact that many diseases have retreated before medical measures could affect them. Even polio was certainly already retreating through improved hygiene and overcoming the period of misery after WWII. It is especially clear in the case of tuberculosis, which has by and large disappeared here, independent of possibilities for medical treatment. The disappearance of tuberculosis is rather due to the fact that people began to expose themselves to the sunlight in bathing suits and to take in sun, thereby counteracting the pathogen. Rudolf Steiner himself specifically pointed to this significance of sunlight. Improved diet and sunlight undermines tuberculosis, while, for example, the extreme veiling of Muslim women can lead to a significant increase in the frequency of tuberculosis. We can see that the appearance of a disease follows its own laws, which do not have a one-to-one relationship with our actions. This is currently the case with scarlet fever, for example, whose aggressiveness has significantly decreased.\n\nA perspective that I have represented for twenty years is based on long-term observation. I notice that the intervening feverish illness in childhood – taking hold of one’s own body’s destiny – doesn’t necessarily have to be measles – it can also be pneumonia. And over half of all childhood pneumonia is caused by viruses. Now, interestingly, we are being able to develop joint projects with pediatrician colleagues, including in Germany, around dealing differently with fever: not suppressing fever anymore with medication, and not prescribing antibiotics for every feverish illness. My colleague, Professor David Martin in Witten/Herdecke, has received two million Euros as a research grant from the government in order to develop and evaluate an app for parents that is intended to help parents overcome their fear when their child has a fever, and will give clear instructions for appropriate care for the child. How they, in generally understandable words, can help this acute intervention of the child’s being in its body within the framework of the fever.\n\nThis is also the aspect that Rudolf Steiner meant. It is not about contracting the measles illness – it needs to be about allowing a child in its first years to take hold of its body, to individualize its body within the context of feverish illnesses. About overcoming predispositions to illness that have been inherited from the parents, such as tendencies to allergies, through feverish illnesses. Within Anthroposophic Medicine, we have been able to prove that acute feverish illnesses, when not suppressed, contribute to a lower occurrence of allergies, for example.\n\nIf all pediatricians assume a favorable attitude toward acute feverish illnesses, we will have done much more for childhood development than if we fight for the opportunity to get the now rare measles virus.\n\nOf course, measles is one of these illnesses, but I don’t need to cultivate measles – there are enough other feverish illnesses that occur in childhood. If all pediatricians and general practitioners take a different attitude toward acute feverish illnesses, we have perhaps done much more for the good of children and for child development than if we, a small group of Anthroposophic physicians, fight for the ability to contract measles, now a rare illness.\n\nWolfgang Held: What positive effect can this discussion have?\n\nGeorg Soldner: First of all, I am very glad that we in the anthroposophic movement are bringing a process of clarification, if we want to affect the development of civil society. For example, the majority of parents in Germany are afraid of measles and don’t want the disease to continue to occur. But we can influence the thinking of these young parents, for example, in regard to acute fever. David Martin has the support of the Chair of the Professional Association of German Pediatricians, and our guidebooks for parents are widely purchased. On a broad front, we can change the way people think about acute fever. We approach the public and consciously participate in the now unavoidable global control of measles, by becoming more open to early measles vaccination. Before, we more often advised vaccination at the end of childhood. We approach the public. But on the other hand, we want to share our central thoughts on fever and the individualization of the child’s body with the public. When that is understood, we are not isolating ourselves in a niche. Rather, we become the seed of change in society. [End]\n\nWhat is our global attitude to vaccinating? Rudolf Steiner, Physiology and Healing, Treatment, Therapy and Hygiene, Georg Soldner, May 29, 2019, Forest Row.\n\nOn 15 April 2019 the Medical Section and the International Association of Anthroposophical Medical Societies (IVAA) responded to multiple requests from anthroposophic physicians and published a statement on the question of vaccination. Georg Soldner, deputy head of the Medical Section, explains the circumstances of this statement.\n\nIn the global vaccination campaigns anthroposophic physicians are often vilified as “anti-vaxxer” and, using this accusation as a pretext, efforts are even being made to ban Anthroposophic Medicine altogether. On the other hand, there are one-sided campaigns that oppose vaccination indiscriminately.\n\nGiven this situation, the attempt has been made to keep the discussion factual and protect Anthroposophic Medicine against one-sided attacks and generalizations. It soon became evident that, in some countries, the statement was very important for the public image of Anthroposophic Medicine and that it was welcomed accordingly. Others expressed clear criticism, often based on misunderstandings. I will therefore explain the joint statement, paragraph by paragraph.\n\nThe Need to Differentiate:\n\n“Vaccines, together with health education, hygiene and adequate nutrition, are essential tools for preventing infectious diseases. Vaccines have saved countless lives over the last century, for example, they allowed the eradication of smallpox and are currently allowing the world to approach the elimination of polio.”\n\nElaboration: Good communication requires, in the first instance, recognition and positivity where they are due. Our colleagues in India, for instance, emphasize how much some vaccinations have contributed to reducing child mortality in their country.\n\n“Anthroposophic medicine fully appreciates the contribution of vaccines to global health and firmly supports vaccination as an important measure to prevent life-threatening diseases. Anthroposophic Medicine is not anti-vaccine and does not support anti-vaccine movements.”\n\nElaboration: This says clearly that we are talking about vaccinations for life-threatening diseases, in which mumps and chicken pox are not necessarily included, while – in the global context – the measles jab has saved the lives of many children.\n\nThe statement clearly rejects any indiscriminate anti-vaccine movements. While many believe in and disseminate the view that the Measles, Mumps, and Rubella (MMR) vaccination has caused an epidemic increase in autistic disorders. This does not mean, however, that there is sufficient evidence of this vaccine being totally safe. Because the measles vaccine is a live vaccine it can contribute to the positive maturation of the immune system (in poor countries it also reduces the mortality rates of other diseases).\n\n“Physicians who are trained in Anthroposophic Medicine are expected to act in accordance with national legislation and to carefully advise patients (or their caregivers) to help them understand the relevant scientific information and national vaccination recommendations. In countries where vaccination is not mandatory and informed consent is needed, this may include coming to an agreement with the patient (or the caregiver) about an individualized vaccination schedule, for example by adapting the timing of the vaccination during infancy.”\n\nElaboration: This paragraph refers to national vaccination recommendations as well as scientific information. The latter may well contradict the national vaccination recommendations, which differ from one country to the next. After several deaths have occurred, France, for instance, no longer recommends to vaccinate babies against diarrhea (rotavirus) – unlike Germany, where not one (of more than a hundred) daily newspapers reported on these fatalities even though the complications are known to German scientists.\n\nIt has been criticized that the statement does not clearly condemn mandatory vaccinations. There are two reasons for this: firstly, the statement is a global one. There are regions in the world where child mortality is high, along with poverty levels, and there are situations in the context of major refugee movements, where mandatory vaccinations against life-threatening pathogens seem to be justified. But even in countries where mandatory vaccination has been introduced without sufficient cause (as in Italy or Hungary), it is not necessarily helpful to publish a global statement on Anthroposophic Medicine that includes views on questions of vaccination. This does not mean that the statement defends mandatory vaccinations. The opposite is the case.\n\nThe statement explicitly mentions the informed consent of parents or patients and emphasizes their right to make an informed decision not only regarding vaccination itself but particularly also regarding the time when it should be given. Scientifically speaking, vaccinating children under the age of one against measles – as recommended in Switzerland (from the age of nine months) – will have the effect that many will no longer be protected as adults.\n\nAluminum-containing dead vaccines – against tetanus and diphtheria for instance – are suspected to increase the risk of asthma and the susceptibility to infections if given in early infancy, in very poor countries they are even suspected to increase the overall mortality from infections.\n\n“Taking into account ongoing research, local infectious disease patterns and socioeconomic risk factors, individual anthroposophic physicians engage at times in the scientific discussion on specific vaccines and appropriate vaccination schedules. Anthroposophic Medicine is pro-science and continued scientific debate is more important than ever in today’s polarized discourse on vaccination.”\n\nElaboration: The statement emphasizes that vaccinations have to be judged against the background of the actual health challenges in the individual case (climate, poverty, crowded living, malnutrition etc.). Anthroposophic physicians and their patients enhance their chances of being listened to by the civil society, health authorities and politicians, if they express differentiated and informed views on questions of vaccination. A polarizing debate, on the other hand, where powerful economic interests and a certain fanaticism play into each other’s hands, destroys the foundations of a freedom that is rooted in the free spiritual life and that needs to be defended in the sphere of rights, in the civil society.\n\nAsking About the Meaning of Illness:\n\nElaboration: The question that remains is that of the meaning of illness – a question that is rarely asked today. Acute febrile illnesses are certainly important for the maturation of the child’s immune system and we can support this by not giving antipyretic drugs or unnecessary antibiotics, by providing an appropriate diet and competent nursing and medical care. Anthroposophic physicians support such an approach and are increasingly listened to by experts. Fever helps children not only to overcome an infectious disease but also to individualize their organism.\n\nIt is a fact that measles are globally considered today to be too dangerous. But there are many febrile infectious diseases that can be well controlled medically. A healthy child development is possible without measles if children grow up surrounded by love, good food, sunlight, and if they receive appropriate care and treatment when they develop a fever.\n\nConcerning Childhood Vaccinations Today, Lore Deggeller, MD, Translated by H. Jurgens from Der Merkurstab, Vol 44, Nr. 6, Nov-Dec 1991.\n\nIt is an open secret that today’s scientific wisdom often proves to be tomorrow’s error. And this often brings about progress. But things seem to be different in the immunization field. Opinions sometimes change there like the weather without any noticeable progress. In contrast to East\n\nGermany – until 1983 – the only compulsory vaccination in West Germany was for smallpox, and this was then dropped since the disease had been stamped out worldwide.\n\nOpinions with respect to several of the childhood inoculations which are routinely recommended fluctuate considerably, but this is not sufficiently noted by either parents or doctors. This is particularly true of the inoculations against TB (BCG vaccine Bacille Calmette Guérin) and whooping cough (pertussis vaccine). BCG vaccination was routine for a long time after World War II, and it was given in hospitals on the first or second day after birth without asking the parents’ permission. It was only omitted if it had already been forbidden before birth. On the basis of serious injuries which supposedly resulted from a “suboptimal” vaccine, instructions which amounted to a prohibition were given to doctors in the ’70s. They appeared in the German Medical Journal, but I know for certain that not all of the doctors read them. Hence scattered vaccinations continued. At present the German Federal Bureau of Health is encouraging doctors to inoculate BCG again, and this is again often done without the parents’ approval. But since the frequent detrimental consequences are known, it indicates that deliberate injury is being perpetrated.\n\nSomething similar happened with pertussis vaccinations. After 1953 they were routinely given alone or as a triple inoculation with diphtheria and tetanus (DPT). After 1974 they were radically curbed by STIKO (Inoculation Commission at the Federal Bureau of Health), and they were only still recommended for endangered babies in unfavorable social conditions. In 1988 and 1989 they weren’t propagated or recommended at all, but recently they are gaining favor again. The July 20, 1991, Hannover Gazette says that one can expect 80 to 100,000 cases of whooping cough a year and that 8 to 10 are expected to be fatal. Whereas in the Nov. 10, 1989, issue of the German Medical Journal (Nr. 45) it said that inoculations for TB and whooping cough were “no longer in accordance with the presently accepted standards.”\n\nFor the seeker of information this rise and fall of opinions reflects the uncertainty of the upper echelon, which often shows up in their emotional pro and con propaganda. That this makes excessive demands on the layman was recently made clear by a full page article in the Süddeutschen Zeitung (June 27, 1991) with the title Discussions About Inoculation Resistance, which gave a relatively impartial presentation of the views of supporters and opponents of vaccination. One sees how sharply drawn the fronts are if one compares the statements of the director of a children’s hospital in Cassel – Professor Lueder – and that of the vaccination critic and inoculation lawsuit expert G. Buchwald, MD. Lueder says that the omission of vaccinations for measles and mumps is criminal and that it is equivalent to child abuse, whereas Buchwald approves of only really important inoculations and he defends the stance of parents who shy away from the risk of diseases such as encephalitis and neurological ailments resulting from vaccination, regardless of whether this is on the order of 1:1 million or 1:5000. For all they know their child might be blinded and paralyzed like the one whose story made all the Constance newspapers in 1989; this child had been routinely vaccinated against diphtheria, pertussis, and tetanus in 1984 by a pediatrician. The state of Baden-Württemberg is now paying his parents 4000 DM a month, and although the doctor was not personally liable he agreed to pay 40,000 DM in damages in order to speed up the legal proceeding.\n\nThe litigation literature between the proponents and opponents of vaccination shows that such cases are frequent, although they are not always resolved as easily as this one. Also worthy of note is the literary row between W. Ehrengut, director of the Institute of Vaccination and Virology, Hamburg, now retired, and the above-mentioned G. Buchwald, head physician at the Park Clinic in Bad Steben, Doctor of Social Medicine, expert on lung diseases and other internal diseases, and medical adviser for the Association for the Protection of Inoculation Victims, now also retired. This battle has been raging for 25 years. It is not surprising that each side accuses the other of bias and wrong data, for everyone knows that manipulations are widespread.\n\nNevertheless Buchwald obviously has accumulated the largest amount of factual material about inoculation injuries. Among his recent articles are About Inoculation Injuries (Naturheilpraxis mit Naturmedizin Nov. 1989), Vaccination – a Crime against Our Children? (Erfahrungsheilkunde Feb. 1991, from which most of the following graphs are taken), and his chapter in S. Delarue’s book on vaccination – The Unbelievable Error (Hirthhauer-Verlag, Munich 1990). Of course, these titles will be very irritating to believers in conventional medicine. He has another article in a reprint from the German Journal for Homeopathy Nr. 1, 1989, which is entitled Vaccination Is Not Protective, Vaccination Is Useless, Vaccination Is Harmful, and itgives a detailed description of almost all kinds of inoculation and of themore or less intentionally misleading advertising, erroneous data, statisticalsources of error and especially the consequences of inoculation injuries withnumerous illustrated cases.\n\nObviously vaccination is still a very murky field which is dominated by the strongest lobby, just as in atomic energy. But the field is not quite as opaque as the atomic energy one, for the available statistical material enables even a layman to gain an overview and to make a judgment, in spite of all the inaccuracies due to the unwillingness of doctors to make reports, etc. This can be seen in the following curves which Buchwald published and which mainly come from the Federal Bureau of Statistics in Wiesbaden and from other reliable sources.\n\nOne can see that a steep decline had begun long before injections with BCG were begun and that, if anything, the decline was somewhat less steep during the period when they were giving the largest number of BCG vaccinations. Fig. 2 shows a similarly declining curve for TB cases between 1949 and 1986. Figs. 3a & b give curves for the number of whooping cough deaths in West Germany and Switzerland respectively. In the latter the greatest decline from 600 to 80 occurred before the injections were begun. Fig. 4 shows the number of cases of diphtheria from 1920–1989, and we see that there was even a sharp rise in the number of cases after vaccinations began. The overall curve begins to decline only again after 1948. The number of cases rose again fairly sharply in 1975 and 1976 during the period when the greatest number of vaccinations were being given. Fig. 5a shows the curve for polio cases since 1962. There seems to be a correlation between vaccinations and the decline in the curve. Whereas one gets a different picture when one looks at the curve for 1936 to 1962 in Fig. 5b. The number of cases increased after Salk vaccine was introduced in 1954. The vaccine produced 192 cases of paralysis in the U.S., and 11 of the patients died, so injections were stopped temporarily. But since there had been no serious incidents in Germany, the vaccine began to be used. Fig. 1b. Mortality of TB in the Federal Republic of Germany 1956–1988.\n\nThere is still a lot of discussion about the causes of the general decline in infectious diseases which occurred in the last 200 years. Neither the site of the infection nor the patient’s individual predisposition (the “terrain,” according to Pasteur) are responsible for it by themselves. Improved hygiene and social conditions were no doubt contributory factors. Experts like T.\n\nMcKeow in his Bedeutung der Medizin, Suhrkamp edition, vol. 109, say that the decline in the number of hungry people since 1750 through the cultivation of potatoes was another cause. We think that a combination of cultural factors and the change in people’s consciousness brought about this change in panorama.\n\nNow, if one looks at the general program for standard vaccinations on the background of this downward trend for infectious diseases, one is really amazed. The injections are all given during the child’s first year, and the majority of them during the third month. As we noted above, large numbers of BCG inoculations are still being given on the first or second day after birth – which is completely unnecessary according to the curve. DPT shots are still being given in the third month, although if anything the diphtheria curve in Fig. 4 should warn one not to do this, since the occasional side effects can be very severe (for instance, transverse lesions in the spinal cord and paraplegia); the epidemiological pertussis curve does not justify early shots either. And with regard to tetanus, Fig. 6 shows us that the age group from 50 to 75 years is the only one which is relatively endangered. The tetanus curve from 1959 to date shows a downward tendency just like all the others, which in this case might even be due to the widespread inoculations which are given to children. But tetanus is not an infectious disease; individuals are endangered only if their slightly bleeding wounds get street dust, horse manure, or garden soil, etc., in them. Puncture wounds by thorns, etc., with the exclusion of air can be particularly dangerous. Here one could ask why a 3-month-old child should be protected against this. For children only get such wounds when they begin to run and play under less supervision at the end of the second or third year. One should remember that the DPT vaccine contains 122 million whooping cough bacteria, 50 JE diphtheria antitoxin and 50 times the lethal amount of detoxified tetanus toxin.\n\nOne gets a similar picture from polio vaccinations. A steep decline in this disease is noticeable from about 4500 cases in 1961 to zero today. As in tetanus, this can no doubt be regarded as the result of vaccinations, and not as a natural tendency. According to Buchwald no German child has had polio in the last 12 years – only children from other countries. The Federal Bureau of Statistics in Wiesbaden reported only one case of polio in 1988. Panics about vaccination loopholes are unfounded since one can quickly control these (Buchwald). It is disconcerting that this vaccination is also included in the program from the third month, and since this is given as an oral vaccine, one might think that the immunologically taxing aspect is reduced since the intestine’s mucous membrane can act as a boundary-protector. But is this membrane sufficiently developed at this time? Isn’t it more likely that the vaccine will bring about a weakening or a chaotization of the immune processes which are just beginning to function? For instance, opponents to vaccination interpret the enormous increase in neurodermatitis in children in this way. And even the greatest vaccination adherent would have to admit that there is no danger of an infection at that time. A polio vaccination at the end of the child’s second year would seem to be sufficient, and if one took the necessary precautions one could even do it in the third year without Fig. 6. Tetanus mortality according to age and sex (FRG.), 1968–1978 having to develop any anxiety complexes about it, and this perhaps only when there is a specific danger, as in day nurseries, etc., so that one regards the vaccination as a sacrifice for the benefit of one’s social environment, for severe inoculation damage is always possible. However, the supporters of vaccination say that strong medications must also have side effects, and that the latter are often even a sign of quality today.\n\nIn view of the largely unjustified vaccinations – according to the epidemiological courses which are shown in Figs. 1–6, one could ask whether the early vaccination dates are justified. It is true that for a long time the idea prevailed that vaccinations – and especially smallpox vaccination with its particularly severe side effects – could be tolerated best during the first year after birth. But according to Buchwald this opinion will have to be revised. Investigations in Prague and Austria revealed that encephalitis was the main deleterious effect of early vaccinations. Whereas the vaccinations past age 3 which were done in Austria sometimes resulted in encephalopathy, a slowly progressive, destructive brain process which only becomes manifest later on. But since such later consequences also arise from early vaccinations, even though the connection with the inoculation can no longer be conclusively proved, it is reasonable to assume that there are close connections with behavioral disorders and defective intelligence here (according to a TV news report on Sept. 2, 1990, the number of illiterate people in West Germany had risen to 3 million). This opinion is supported by the report that the number of retarded people has declined ever since smallpox vaccination was terminated.\n\nOn the other hand near- and long-term injuries are also ascribed to the standard vaccinations which were mentioned above. Thus it is now recognized by some that childhood diabetes is a result of vaccination. Opponents of vaccination are talking about the likelihood of later results of vaccination such as autism, hyperactivity and other behavioral disorders, leukemia, cardiac infarction, multiple sclerosis, and sudden unexplained deaths in childhood, and even vaccination supporters admit that some of these connections may be correct. The files on the consequences of vaccination will not be closed for a long time yet.\n\nIn connection with the harmful results of vaccination, one should not overlook an important viewpoint with respect to the scheduling of inoculations. People assume that children have basically completed their immunoregulatory and defensive system by age 3. But the instigators of vaccination are inconsistent when they say that inoculations bring about an important immune-training, whereas on the other hand they would like to move below the threshold of this defense with certain inoculations as a precautionary measure. Because our immune system becomes overburdened through protein food and synthetic food additives already in infancy, an increasing number of people are blaming a chaotizing tendency in immune processes and programmed, false regulations such as allergies or anergies (AIDS) on the foreign influences of vaccines.\n\nWe already mentioned the enormous increase in children’s neurodermatitis. In view of this overall situation, it seems necessary to consult a spiritual knowledge of the human being such as the one which is to be had in anthroposophy. Everyone knows from his own life that the time when he first became aware of himself as an “I” was at about age 3, although some people today can remember back further. The wonderful, heavenly innocence and purity of the newborn child which touches every human heart is a phenomenon which can be perceived and felt up to this point in time. Spiritual science describes this phenomenon as a real stream of divine, spiritual forces which hovers around the child and streams into it and enables it to do man’s greatest deeds, namely, to develop the right relation to the force of gravity as it stands upright, to develop the larynx into an organ of speech, and finally to prepare its brain and to make it into a living instrument of thinking. The child brings this wisdom-filled working of forces with it so that the seductive Luciferic and Ahrimanic influences are still held off to a large extent. Christ’s saying that “unless you become like a little child …” should be understood on the background of such spiritual knowledge. Now, what happens in this physical, spiritual situation if vaccines are brutally shot into the baby in the amounts stated?\n\nIn addition to the already mentioned direct disruptions in the soul and spiritual development of the child, it is very likely that the disorders and deviations in ego-development which can be observed today can also be at least partly attributed to this procedure. All the more so since the vaccination programs extend beyond the first year. In addition to the backup shots in the second year, one has other “attacks” after age 15 months in the form of the vehemently demanded MMR (measles, mumps, rubella) shots. Here the advantage to disadvantage relation is not correct at all anymore. Mumps is considered to be a harmless children’s disease, and even WHO doesn’t recommend vaccinations for it. It is only in later years that it can result in meningitis, orchitis and pancreatitis – and then only rarely. Fearful parents could always have their children vaccinated before puberty. Something similar applies to rubella, which is only dangerous during pregnancy. Here too an inoculation of girls shortly before puberty would be sufficient and much more certain than one in infancy, which in any case is supposed to be repeated at age 15; for only a good case of German measles develops enough antibodies to last one for life.\n\nThis problem of antibody formation through vaccination which doesn’t last for life applies even more to measles. The protection from a successful measles shot in the 15th month might last for only a few years, so that one can get measles later in life with consequences which are much more severe than in childhood. The protection which a vaccinated mother gives to her baby lasts for about a year, but since the intensity of antibody formation is usually weaker than after a real case of measles, this protection may be inadequate. Thus infants and old people are the most vulnerable. And yet like all children’s diseases a real case of measles is a very positive developmental factor. Parents and doctors always confirm that distinct bodily and psychical progress can be experienced after such a molting process – eczemas and nephrotic syndromes get better, and bedwetting and speech disorders disappear. Impairments after measles are said to occur in one out of 15,000 cases, and after measles vaccinations it is 1:1 million and up to 1:15,000. It should not be difficult to draw a sensible conclusion from these facts.\n\nWe will refer to a few statements by Rudolf Steiner, in case parents and doctors would like to orientate themselves about the spiritual scientific position before making a decision between pro and contra. We should point out that his moderately negative remarks were mainly directed towards the smallpox vaccination which was being developed at the time. Our present huge vaccination scenery can hardly be compared with this anymore, although his basic remarks can still be applied to it. Rudolf Steiner often described how and on what parts of man’s organization substances which are present in the nature kingdom work. He said that mineral substances have an effect on the ego, plant substances work on man’s astral body, animal substances on the etheric body, whereas human substances “only” work on the physical body. Steiner points out that “when one uses an animal vaccine, one can follow how the activity of the vaccine which the patient took, moves up into the etheric body” (Bibl. Nr. 348, Jan. 23, 1923).\n\nSince immunological processes occur in the etheric body, this statement shows that animal vaccines influence them. In Manifestations of Karma, Rudolf Steiner says that smallpox vaccinations will not hurt anyone if he subsequently receives a spiritual education. In a lecture given to workmen at the Goetheanum on January 27, 1923 (Health and Illness, Vol. 2) he explained how they made rabies vaccine at that time and how it heals one’s spinal cord if it has been injured by rabies. In Bibl. Nr. 316, lecture 7 he said that a really spiritual knowledge of smallpox would enable a doctor to walk among smallpox patients without fear, and with perfect love.\n\nFreedom from anxiety and fear is also very important for parents and children, for this enables them to counteract the predisposition for disease. Conversely, fear and anxiety probably increase the danger of infection and also of deleterious vaccination effects.\n\nHence, it is no accident that the incitation of fear is the most important weapon and means of propaganda for vaccination strategists, for whom every means to attain their goals seems to be holy, even if untrue. Thus with respect to the vaccination problem, it is important to take the search for truth very seriously. Positive results with vaccinations for smallpox, tetanus and polio and their recognition should not lead to a thoughtless and uncritical acceptance of recommendations and entreaties for vaccinations, which upon closer examination are, in the long run, not only unnecessary but harmful for most people.\n\n“Praise the Lord my soul, and forget not all his benefits who forgives all your sins and heals all your diseases, who redeems your life from the pit and crowns you with love and compassion.” Psalms 103:2-4\n\nCourse for Young Doctors, The Measles – Scarlet Fever Polarity, Rudolf Steiner, April 21, 1924, Also translated as: Understanding Healing: Meditative Reflections on Deepening Medicine through Spiritual Science, Mercury Press, Spring Valley, NY,1994: GA 316, pp. 128-133.0 and Rudolf Steiner Press, Forest Row 2013.\n\nTo begin with, the cosmos is copied. This is what the human being wants, in reality, to do when he has come down from the pre-earthly into earthly existence. Why does he not do it? Because a model is already provided. And in accordance with this model, with the substances received, he transforms the pre-earthly during the first seven years of life. His inherent tendency would be to form a more spherical being, a being organized into a sphere. This is transformed in accordance with the model and so the pre-earthly forces work out this second physical man who is there from the seventh to the fourteenth years, but to begin with by adhering to the model which comes from the forces of heredity.\n\nIn the first [seven-year] life-period, therefore, there is a perpetual struggle between what comes from us out of the previous incarnation and what comes from hereditary development; the two elements fight with each other. The illnesses of childhood are the expression of this fight. Just think how intimately the whole inner being of soul and spirit is bound up with the physical organization during early childhood. When the second teeth appear you can see how they push up against the first, how they still have tussles with each other, and in this same way the whole second man has tussles with the first. But within the second man there is the super-earthly being in the first a foreign, earthly model. These two work into each other, and if you observe this inter-working truly, you can see how, if the inner man who as a being of soul and spirit was present in pre-earthly existence, has too much the upper hand for a time, working into the physical very strongly and having, willy nilly, to adjust itself by dint of effort to the model, that it damages the model by striking up against it everywhere, saying: I want to get this particular form out of you – then the fight expresses itself as scarlet fever. If the inner man is tender, so that there is a continual shrinking back, a wish to mold the in-taken substances more in accordance with their own nature, and resistance is put up to the model, the struggle comes out as measles. What is, in reality, a mutual struggle expresses itself in the illnesses of childhood.\n\nThe fact is that one being is weaker, directs himself more in accordance with the forces of heredity, builds up the second man with a greater resemblance to the model. This naturally comes out in the appearance, but the same thing has been going on when the being has adjusted itself more in accordance with the model. On the other hand, there are human beings who after the change of teeth become very unlike what they were before. In such cases what comes from the pre-earthly life of soul and spirit is strong and they adhere less to the model.\n\nEverything that has to be taken in [during the first seven years] must, in the first place, be taken in by the child and elaborated inwardly in such a way that the ego and astral body enter into intimate contact with the foodstuffs. Later on this need not be the case any longer. During those years he must work up in his ego and astral body everything he takes in such a way that it can be molded in accordance with the model. This process must be helped; and the world has arranged for it, inasmuch as milk is able to bear a very great resemblance indeed to an etheric structure. Milk is a substance which really still has an etheric body and because this substance, when it is taken by the child, still works up into the etheric, the astral body is able at once to take hold of the milk and then there can arise the close inner contact between what is thus taken in and the astral body and ego organization.\n\nIn the whole way in which the child drinks milk you can actually see how his astral body and his ego are taking hold of the milk – you can see it with our very eyes. Picture to yourselves how the being of spirit and soul comes down and makes its way to the physical foodstuff, ignoring the model to begin with, and then picture what is going on between the being of spirit and soul and the foodstuff – a process that is now directed in accordance with the forms contained in the model. If you form a true picture of an excessively strong working of the spirit and soul, the picture crystallizes into that of scarlet fever. A picture of a too feeble working of the spirit and soul, which wavers, in fact of the model, becomes the picture of measles. If you picture these things in meditation you carry over ordinary meditation into medical meditation.\n\nYou cannot notice this process in a grown-up person. The digestive tract takes over the food stuffs – it is a process transacted inwardly, whereas in the child, astral body and ego take over the foodstuffs.”\n\nThe Healing Process: Spirit, Nature and Our Bodies, Childhood Illnesses, Rickets, Phosphorous and the Uterus, Rudolf Steiner, August 29, 1924, Anthroposophic Press, 2000, Hudson, NY, GA 319, pp. 172-173.\n\nWhen a child enters the world, the astral body and I come from the spiritual world, while the physical and etheric bodies come from heredity, from the child’s ancestors. A struggle takes place as these two elements attempt to merge. The various types of childhood diseases are outer manifestations of this struggle. We see childhood diseases in the right light only when we view them as the attempt of the eternal core of an individual’s being to adapt to what heredity has provided. Especially when the ether body has difficulty adapting to the astral body and the I-being, we see illnesses developing as a consequence of the ether body’s preponderance over the approaching I and astral body. Rickets is an expression of the ether body’s predominance – its resistance to the invaders, as it were.\n\nTracing the spiritual aspect in addition to the physical allows us to discover specific means of negating the power of the ether body that blocks the astral body. What deprives the ether body of this power in the normal course of events, as an individual gradually approaches the physical world from the spiritual world during the embryonic period? When we study this period, we discover a specific relationship between forces present in phosphorous or its compounds and forces in the uterus that resist embryonic development. If these forces were not present in the uterus, every child would develop rickets. The uterus contains the same type of forces that are present in the outer, natural world in the mineral substance phosphorous and its compounds. Thus, the uterus constantly works like a physician to prevent rickets. Once we have understood these revealed mysteries, we will be able to treat rickets with phosphorous in the outer world after birth to compensate for insufficient phosphorous effects in utero.”\n\nSoul Economy and Waldorf Education, Scarlet Fever, Interventions, Etc. in the First 2-3 Years, Rudolf Steiner, Dornach, Switzerland, December 23, 1921 – January 5, 1922, GA 303, Anthroposophic Press, Spring Valley, NY 1986 GA 303, p. 109-110, 112.\n\nIf we wish to find out what the soul of a child is like between birth and the seventh year, we have to observe the child’s development from the seventh year onward. For then, in the child’s soul, we are able to observe the very same forces which previously were active in its physical organization. And we shall find that their hidden organic activity of molding and shaping the child’s brain as well as its remaining organization is of a very special significance. For, through birth or conception, the child carries down into its physical organization what it has brought with it from the worlds of soul and spirit.\n\nWhen the child is thus fully engaged in building up its physical organs, it must be left free to do so and consequently, the doors leading to the outer world remain closed. It is essential that we refrain from interfering in our clumsy ways with these inner activities of the child, for it is doing what it has to do, with the effect that it is not accessible to external will forces.\n\nWe must never forget that what will work in the realm of the child’s soul after the seventh year is directly involved in the organ-building processes before that age. This means that up to the seventh year any impressions coming from the outer world will directly affects its physical constitution – the lungs, stomach, liver and all kinds of other organs will have a decisive effect upon its future constitution of health or illness.\n\nWhat the child learns during the first two-and-a-half year period is of utmost importance for its whole life. It does so, through an inward-bound activity, out of what it has brought with it from its prenatal existence. Only consider how during the this first short period the child learns to speak and to walk, the two human faculties closely connected with an individual’s maintaining a proper self-confidence, both from a personal and a social point of view. These two importance faculties are achieved while the etheric body is still engaged in shaping the brain and while it is still raying out into the remaining organism. If these etheric forces ray out too strongly into the remaining organism so that they disturb the infant’s still delicate processes of metabolism, of breathing and blood circulation, if they surge too powerfully within the baby’s organism, scarlet fever and kindred children’s illnesses may occur already at this young age. Fundamentally speaking, through all that is at work within a child at that stage, the child remains inaccessible to any conscious and will-directed approaches or demands coming from outside. It wants to be left to work on its own organism.\n\nI believe that it can enormously enrich and intensify our ideas here if we realize that, basically, everything that occurs within us finds its correspondence in processes outside us in the surrounding world.\n\nNow, diphtheria-type symptoms are especially able to give us what we might call intimate insights into the human organism. And these symptoms, manifesting as diphtheria-type conditions, should be studied more carefully in relation to the search for methods of healing. There is still a view today, I believe, arising from a more materialistic outlook, that diphtheria would if possible be treated locally – that this condition should be tackled at the local site where it manifests. Naturally numerous other views also dispute this. The important thing about the development of diphtheria and everything related to it requires further elaboration here since, in the last course [Spiritual Science and Medicine], we were not yet able to fully examine this reciprocal action between the four levels of the human organism described by spiritual science.\n\nIn a different context I suggested that the child’s acquisition of speech is accompanied by many kinds of organic processes. The child learns to talk and, while he does so, and while therefore something particular occurs in his respiratory organism, something of a polar opposite nature at the same time occurs in his circulatory organism, the latter of course integrating metabolic processes into itself.\n\nNow, in a quite different context I pointed out that the reciprocal relationship with our surroundings that appears at puberty unfolds inwardly when the child is learning to speak; and that in other words what occurs when the astral body pushes outward from within at puberty occurs from below upward in the astralizing process. Learning to talk is, after all, a capacity that develops from below upward. Thus an astralizing process is involved there too. The whole process is one that rises from below upward. If the process that rises from below upward spreads out too far in an upward direction, and if therefore too strong an upward push of astrality occurs as children learn to talk, this upsurge of astrality represents a disposition to develop diphtheria-type conditions. This is what gives rise to conditions of diphtheria.\n\nNow let us also consider the external earth process which has a certain affinity with the process I just described. In a plant which, you can say, behaves properly toward the cosmos, the earth participates in the formation of its roots, and this earth influence then diminishes so that the extraterrestrial influences grow ever stronger, unfolding particularly in the flower. What unfolds here in the flower is in fact a kind of external astralizing of the flower, which then leads to the development of fruit. What happens when, as I said, the plant develops properly, into a decent plant, always a little way above the surface of the soil where the flower unfolds, can also develop right at the surface of the soil itself, and then we get mushrooms and fungi. You will likely be close to saying, now, that if mushrooms and fungi develop through this kind of idiosyncratic astralization, then the same process – and this is indeed the case – must occur from below upward toward the head, as in diphtheria, when this singular astralization process takes place within us. And this is why the tendency to a fungal condition exists in diphtheria. We must be very much aware of this fungal tendency, and take full account of it. A really very hidden process occurs here – all its external aspects are in fact only a sign that irregular astral streams prevail within a person. Diphtheria is regarded as a local disorder because only the external symptoms are recognized, without attention to what pushes its way out from within in such a condition.\n\nThe risk of infection is actually great in diphtheria-related disorders, but why? It is because they develop in direct connection with learning to speak, and occur therefore most widely in children aged between two and four. After this age children are less susceptible. But every process in the human organism that arises in the normal course of things at any particular period can also arise abnormally. This process, therefore, that is really simply a natural process of childhood development can also occur at a later age, albeit in a somewhat modified form, a metamorphosis. When diphtheria occurs at a later age this is in a sense an infantile condition that works on in a person. And the fundamental nature of infancy as you know – in mundane accounts of spiritual-scientific facts we usually need to speak in more psychological terms – is imitation. From an external viewpoint, childhood and infancy certainly involve a process of imitation. The organism itself is induced to become imitative when it contracts diphtheria. This is why infection is caused, really, by an urge to become imitative, and such imitation is informed by a subtle sensibility, which we can certainly observe.\n\nIf we study the matter through spiritual science, we find that the I does, in fact, play a certain role in the process of diphtheria infection. And therefore what develops as fungal infection, the parasitic nature of diphtheria, is more infectious in this condition than in other diseases because the human organism – to put it in a rough and ready way – perceives diphtheria toxin anywhere, it makes itself receptive to it, relates to it imitative. For this reason, at an initial stage of the disease, addressing the psyche, strengthening a person through psychological encouragement, will always have a beneficial effect. With such processes, however, that act so strongly on the organism, we will naturally achieve much less by these means than if we try to discover what I will call the specific antidote to the process occurring there. Here at least I am unaware whether people have made any efforts, even empirically, to discover an antidote to diphtheria-related disorders [other than serum treatment]. One should look for it, for example, in cinnabar up to a medium potency.\n\nCinnabar is the substance whose effects will counteract all the kinds of disorder I have been speaking of. In its very appearance, cinnabar expresses this counteractive capacity. It is important to be able to perceive the inner activity which, basically, is apparent in all external appearances in the world. Someone, therefore, who retains his healthy common sense, will have to say that vermilion, red cinnabar, is something that in a sense expresses an activity that counteracts fungal processes. Whatever tends toward a colorless state can become fungal. Whereas too strong an astralization of the earth’s surface is implicated in fungal growth, in cinnabar-related substances we find a reactivity to this astralization, a counteraction, and therefore the red color. Wherever reddishness appears in natural processes, astralization is strongly counteracted.\n\nThe Manifestations of Karma, Measles and Karma, Rudolf Steiner, May 1910, Rudolf Steiner Press, London, 1968, GA 120, pp. 112-114.\n\nAn actual case: “A certain person contracts measles in later life, and we seek for the karmic connection in this case. We find that this case of measles appeared as the karmic effect of occurrences in a preceding life – occurrences that may be thus described: In a preceding life the individuality in question disliked concerning himself with the external world but occupied himself a great deal with himself, though not in the ordinary egotistical sense. He investigated much, meditated much, though not with regard to the facts of the external world, but confined himself to the inner soul life. We meet many people today who believe that through self-concentration and through brooding within themselves, they will arrive at the solution of world riddles. The person in question thought he could order his life through inner meditation how to act in one instance or another, without accepting any teaching from others. The weakness of the soul resulting from this led to the formation of forces during existence between death and rebirth which exposed the organism comparatively late in life to an attack of measles. This soul condition will prove itself to be such that the personality in question, during the life in which the attack of measles took place, was again and again subject to self-deception. Thus in the self-deception we must see the psychic karmic result of this earlier life, and in the attack of measles the physical karmic result.\n\nLet us now assume that this personality before developing measles had succeeded in gaining such soul forces that he was no longer exposed to all kinds of self-deception, having completely corrected this failing. In this case the acquired soul force would render the attack of measles quite unnecessary, since the tendencies brought forth in this organism during its formation had been effaced through the stronger soul forces acquired by self-education. What I have said about a case of measles can lead to an explanation why measles is one of the illnesses of childhood. For the failings I have mentioned are present in a great many lives and especially in certain periods did they prevail in many lives. When such a personality enters existence he will be anxious to make the corresponding correction as soon as possible. In the period between birth and the general appearance of children’s complaints which effect an organic self-education, there can as a rule be no question of any education of the soul. From this we can see that in a certain respect we can really speak of a disease being transformed back into a spiritual process.\n\nA children’s disease that is a bit unpleasant is called whooping cough. It is not really all that bad for the child at the time when it happens, for he will normally get well again. The bad thing is that something remains if people don’t do the right things – meaning doctors or whoever is responsible at the time – when a child has whooping cough. Whooping cough means that breathing-in will always be as it should be – you may have a child with really severe whooping cough, it will breathe in properly but when the air wants to come out as the child breathes out it gets stuck, it will not come out the way it should, and then a bout of coughing develops. And with the air not getting out properly, fresh air cannot get in, and this causes the whooping cough.\n\nBut what lies behind it, when a child gets whooping cough? You see, what lies behind it is that the inner mucous membrane of the breathing system, of these tubes that go down to the lung and then out again, grows terribly sensitive. When we have breathed out our air, we have a vacuum in our lungs, and the air will rush in all by itself — the child’s breathing tubes have grown sensitive. They are just as sensitive as any other place where you may have got a scratch. The inside of the breathing tubes has grown a bit scratchy, and they are sensitive wanting to scratch the child forgets to push out the air, and the air stays put in there. You then get these bouts of whooping cough. The body wants to push out the air by force, whilst in life it is the part of us which I called the astral body the other day that pushes out the air.\n\nLooking at a child with whooping cough, you can see exactly where the physical body is and where the astral body is. When the child is not coughing the astral body pushes out the air; the body does not have any problems at all. When the child has whooping cough, you have a sensitive spot there. The astral body wants to scratch away; then the physical body has to come in and push the air out forcibly, in spasms. This may even cause spasms, and then another disease may develop as a consequence.\n\nConsider that whilst the child had whooping cough the parents bought a cat or a dog. This has made the child sensitive to the air the dog or cat had been breathing out. He would not have grown sensitive to this if he had not happened to have this sensitive spot at the time. The child then recovers from his whooping cough, but sometimes a strange thing remains behind. If the child has not been used to having a cat around before, and a cat has come to live in the house whilst the child had whooping cough – this will not happen when he has just recovered, but later on the condition will develop which people call asthma, a breathing difficulty that repeats itself over and over again.\n\nSo a man develops asthma, for instance, and to begin with no one knows where it comes from. If you observe carefully you find that he gets a further asthma attack if there is a cat near him or in the room. If the cat is removed the asthma stops. You will now also understand that human health and sickness is altogether connected with the whole environment. There are, of course, many kinds of asthma.\n\nWhooping cough can be cured as follows. Let us assume a child has a sensitive windpipe or tubes, coal dust may have irritated them in some way. This may immediately cause whooping cough to develop. Now imagine you get this fissure, this crack, in the windpipe or tubes; the astral body then comes a little bit free there. And the condition can be healed if one does it very carefully. We first of all put the child to bed and let him get into a sweat – you can observe the whole thing step by step – he’ll get really hot. The astral body easily joins with heat; it does not easily join with cold. If you let the child run around out of doors or even just indoors, the astral body can’t get at the physical body because the warmth it needs is not there. But if you wrap up the child really warm – people often do this instinctively; they’ll often tie a woolen sock or stocking around the throat to keep the warmth in – the astral body will start to be attracted to the warmth. So if you have had the child in bed for a time like this and the astral body has been drawn there all the time, it will again and again have been attracted to the throat. You should then take a piece of cloth and put a bit of warm water on it that contains a few drops of lemon juice and put the cloth around the throat. This will draw the irritated part together, so that it will again be open to the astral body, and you can cure the whooping cough very nicely. You must also take care in following this procedure that the child does not take fright. For when the child takes fright, the astral body will always come out a little, and this will undo the whole thing. If we truly cure the child, the whooping cough will run its course and he’ll not have asthma later on. If we do it wrongly, the ‘fissures’ in the windpipe or tubes will heal up, and the child will seem to have recovered, but the astral body will not have gone in completely, always remaining a little bit outside. Now if a person is very weak, if the child is a weakling, he’ll get asthma right away, because the breathing-out process is never quite right. The astral body is not completely involved in the breathing-out process. But if the child is a bit stronger, he’ll use the other part of the astral body, with the result that the rest of the astral body will only show its weakness at a later time in life, when another illness comes, for instance if the child later gets influenza or something of that kind. And he’ll then develop asthma.\n\nTherefore if one wants to understand the human being, what is of substance in the head must not be regarded as equivalent with what is of substance in the rest of the organism; rather one must see the interplay between the metabolic-limb organism and the head organism as a rhythm. This, however, enters into each individual organ. Countless causes of illness in people are based on the following: For every organism a certain measure of equilibrium exists between this ratio of four and one. Of course, it is never exactly one to four; there are all sorts of possible ratios; in this way people are individualized. For every human individuality, however, a definite ratio exists. If it is disturbed – let us say that a person normally had a ratio of one to four and conditions arose whereby the ratio were no longer one to four but one to four-and-a-seventh – then the dissolving force (from the blood/metabolic-limb system) would work too strongly. Just as easily the other rhythm can work too quickly. Then cramp-like conditions arise. When the astral forces vibrate too quickly through the etheric and physical organism, when the astral forces quiver through too quickly and do not approach slowly enough, cramp-like phenomena arise.\n\nTake, for example, ordinary children’s cramps. These ordinary cramps are simply based on the fact that with the child the astral organism and ego must immerse themselves in the right way into the physical and etheric organism. The right ratio must first be established. Now imagine that that astral organism and the ego, which vibrate at first into the metabolic-limb man, are vibrating too quickly; the other part of the human being cannot grasp this right away. Every current of the astral takes hold correctly of a droplet of the living water through which the etheric streams. They adapt to each other if the right tempo is within. If it vibrates too quickly, then the astral bursts through the etheric and thereby also through the living water and cramp-like conditions arise, occurring especially in children’s cramps, because there the correct rhythm must assert itself first in this astral instreaming. This has a very far-reaching significance. It means, for example, that a terrible form of illness, which engenders a lot of questions today, finds at least its explanation here, namely that the correct rhythmic encounters are disturbed in a particular way.\n\nAn example of such an illness is the terrible illness of polio, which can be explained in this way, though its remedy is not found at the same time, because conditions lying further back have brought about the lack of harmony. Inwardly, regarding what underlies the slow rhythm, the human being is exposed very strongly to Ahrimanic forces; regarding everything that corresponds to the fast rhythm he is exposed very strongly to Luciferic forces. You could also say, therefore, if you were to look once at ‘The Group’ [Steiner’s sculpture] , that here everything Ahrimanic has the tendency toward the slow rhythm, which hardens the forms and makes them pointed and rigid. In everything Luciferic, the fast rhythm predominates, which rounds everything off, because it runs its course faster. In this rounding, things are not made rigid but wave-like. You can see in these sculptural forms that one has to do with encounters in the ratio of three or four to one.\n\nCosmic Workings in Earth and Man, Causes of Polio (Infantile Paralysis), Rudolf Steiner, October 31, 1923, Rudolf Seiner Publishing, London, 1952, GA 351, pp. 62-72.\n\nIt is still rather difficult to speak about this illness [polio or infantile paralysis], since it has only assumed its present form quite recently, and one must wait till it has taken on more definite symptoms. Still, from the picture one can form at present one can say now that Infantile Paralysis, like its origin, Influenza, which leads to so many other diseases, is an extraordinarily complicated thing and can only be fought if one deals with the whole body. This Infantile Paralysis strikes sometimes in an extraordinarily sudden way and we may well be anxious lest it grow into a very serious epidemic. Infantile Paralysis is certainly connected, like Influenza itself, with the serious conditions of our time. In our Biological Institute in Stuttgart we have succeeded in obtaining dilutions of one in a million, one in a billion, even one in a trillion. Now when we are clear that very minute quantities of substance have an effect, we shall have no hesitation in recognizing that in such times as the present, when so many people take incorrect nourishment and then rot as corpses in the ground, this works differently. Of course, for the earth as a whole, the effect is very diluted, but still it is different from what happened when men lived healthily. And here again, the food which grows out of the earth is a factor. The health of men is completely dependent on the growth of plants and therefore we must know what really is involved.\n\nI have been greatly occupied with this point in connection with Infantile Paralysis, and it has turned out that one must really concern oneself with the whole man. There will probably have to be found a treatment made up of soda baths, iron arsenite, and of yet another substance which will be obtained from the cerebellum, from the back part of the brain of animals. It will have to be a very complicated remedy. You see, the disease of Infantile Paralysis arises from very complicated and obscure causes and so requires a complicated remedy. These things have become of urgent importance today, and it is well that you should understand the whole question of the growth of plants.\n\nThe plant grows out of the ground and the root grows out of the seed. Let us first take a tree; we can then pass to the ordinary plants. [Drawing on the blackboard] This stem which grows there is really only formed because it lets sap mount from the earth, and this sap in mounting carries up with it all kinds of salts and particles of earth; and so the stem becomes hard. What happens, in reality? The earthy, the solid, becomes fluid! And we have an earthy-fluid substance mounting there. Then the fluid evaporates and the solid remains behind: that is the wood. You see, this sap which mounts up in the tree – let us call it wood-sap – is not created there but is already contained everywhere in the earth, so that the earth in this respect is really a great living being. The sap which mounts in the tree is in the whole earth and through it the earth lives. In the tree it loses its life-giving quality; it becomes merely a chemical; it has only chemical qualities.\n\nSo when you look at a tree, you must say to yourself: the earthy-fluidic in the tree – that has become chemical; underneath in the earth it was still alive. So the wood-sap has partly died, as it mounted up in the tree. Were this all, never would a plant come into existence, but only stumps, dying at the top, in which chemical processes are at work. But the stem, formed from this sap, rises into the air, and the air always contains moisture. It comes into the moist air, into the fluidic-airy, and life springs up in it anew so that around it green leaves appear and finally flowers. Again, there is life in the stem, life is always dying; in the leaf it is always being resurrected.\n\nAnd what does this do? It travels all round and brings forth the leaves everywhere; so that you can see the spirals in which leaves are arranged. The living sap really circles round. It arises from the fluid-airy element into which the plant comes when it has grown out of the earthy-fluidic element. The stem, the woody stem, is dead and only that which sprouts forth around the plant is alive. The wood with its sap cannot keep the tree alive; what comes with the leaves must come from outside and that again contains life. When the sap rises in the spring, the tree is created anew. The earth produces the sap from the earthy-fluidic; the fluidic-airy produces the living sap.\n\nBut that is not all. While this is happening, between the bark, still full of living sap, and the woody stem, there is formed a new layer. What is formed is quite solid: it is called cambium. It is formed between the bark which still belongs to the leaves, and the wood. The cambium is formed in the warm air, in the warm damp, or the airy-warmth. The plant develops warmth while it takes up life from outside. This warmth goes inward and develops the cambium inside.\n\nLiving-sap: Surroundings of the earth: The Living\n\nBefore cambium forms, there is first of all developed a thicker substance: the plant gum. Plants form this plant gum in their inner warmth, and this, under certain conditions, is a powerful means of healing. Thus the sap carried the plant upward, the leaves give the plant life, then the leaves by their warmth produce the gum which reacts on the warmth. The cambium brings the plant into connection with the stars, with what is above, and in such a way that within this cambium the form of the next plant develops. This passes over to the seeds and in this way the next plant is born, so that the stars indirectly through the cambium create the next plant! The seed must first be worked on by the cambium, that is: by the whole heavens. This carries the power to the seed to develop through the forces of the earth into a new plant.\n\nSo it is with trees, and so, too, with the ordinary plants. When the rootlet is in the earth, the sprout shoots upward. But it does not separate off the solid matter, does not make wood; it remains like a cabbage stalk. The leaves come out directly on the circumference, in spirals, the cambium is formed directly in the interior, and the cambium takes everything back to the earth with it. So that in the annual plants the whole process occurs much more quickly. In the cambium one has a sketch, a sculptural activity. The stars model in it from the whole universe the complete plant form. So you see, we come from Life into the Spirit. The earth first gives up her life to the plant, the plant dies, the air environment along with its light once more gives it life, and the World Spirit implants the new plant form. This is preserved in the seed and grows again in the same way.\n\nNow you can see of what importance it is when quite tiny amounts of any substance are mixed in the earth. The earth is everywhere permeated with wood sap, and the tiny quantities penetrate everywhere into the ground. And having investigated how these tiny quantities work, we say that which disappeared into the earth, we eat it again in our food. It is so strong that it lives in the plant form. And what happens then? Imagine I had thus a plant form from a lead-containing soil . A plant grows out of it: one may say, a lead-plant. Well, this lead plant when we eat it, has a quite different effect from a lead-less plant. Actually, when we eat a lead plant, our cerebellum, which lies at the back of the head, becomes drier than usual. Now you have the connection between the earth and the cerebellum. There are plants which simply through the constitution of the earth, through what men put into the earth and what then spreads everywhere, can dry up the cerebellum. As soon as our cerebellum is not in full working order, we become clumsy, awkward and cannot properly control our feet and arms; and when the effect is much stronger, we become paralyzed.\n\nThus, you see, is the connection between the soil and paralysis. A man eats a plant. If it has something dying at the edge of the leaves, his cerebellum will be dried up somewhat. In ordinary life this is not noticed, but the man cannot any longer rightly direct his movements. If the effect is much stronger, paralysis sets in. When this drying up of the cerebellum happens in the head, so that man cannot control his muscles, at first this affects all those muscles which are dependent on a little gland in the head, the so-called pineal gland. If that happens, a man gets influenza. If the evil goes further, influenza changes to a complete paralysis. So that in every paralysis there is something that is inwardly connected with the soil.\n\nWood-sap develops in man as the ordinary colorless mucous. Wood-sap in plants is, in man, mucous. The life-sap of the plant which circulates from the leaves, corresponds to the human blood. And the cambium of the plant corresponds to the milk and the chyle in the human being. Here you have again something in human beings which is most strongly influenced by the stars, namely, milk. Decaying leaves create no proper cambium because they no longer have the power to work back into the proper warmth. They let the warmth escape outward from the dying edges instead of sending it inward. We eat these plants with an improperly developed cambium: they do not develop a proper milk; the women do not produce proper milk; the children get milk on which the stars cannot work strongly, and therefore they cannot develop properly.\n\nHence this Infantile Paralysis appears specially among children – but adults can also suffer from it, because men are all their lives influenced by the stars. When one eats unsound cambium as a child, one gets an unsound brain. In this way diseases are caused by what is in the earth. This is what can be said about the causes of such apparently inexplicable diseases: the causes are in the soil.\n\nCosmic Workings in Earth and Man, Effects of Lead in the Body, Diphtheria, Rudolf Steiner, January 19, 1924, Rudolf Seiner Publishing, London, 1952, GA 351, pp. 79-84.\n\nThe human organism produces in itself a little lead, copper, phosphorous. Man produces within his organism all kinds of substances, but these substances must be produced in exactly the quantity required by the body. If lead is introduced from outside, the body then contains too much lead. So we must ask; What is the function of lead in the human organism? If the body produced no lead, we should all be going about with rickets! Our bones would be flabby and soft. A rachitic child is one whose organism produces too little lead.\n\nThe human body must contain neither too much nor too little lead. Even in childhood you begin to produce lead in your bodies. But lead can really never be found in the body in any perceptible quantity because it is immediately sweated out. If it were not sweated out, you would, as quite young children, have within you so much lead that its presence could be demonstrated; and as grown-ups, far from having soft bones, you would be going about with bones so hard and brittle that if knocked at any point they would fall to pieces. But if an excessive quantity finds its way into the body, it cannot immediately be sweated out again and it becomes a destructive agent. Very well then – now we give water containing albumen. This is a deterrent to the injurious effects of the lead. And why? The reason why I am unable to sweat out the lead I have myself produced is that I also have albumen in my body. And when a baby is drinking the lukewarm mother’s milk, one of the effects of this milk is that the child gets accustomed to sweat out the lead. Therefore lukewarm milk can also be given in a case of sight lead poisoning, and then the lead is induced to leave the body, either through vomiting or through sweating. The very last vestiges must always be got rid of by sweating.\n\nThe albumen that is always present in the human being dissolves the lead. If, therefore, I introduce too much lead into the stomach and then add albumen, I am really doing what the body is doing all the time. The effects of these mineral poisons must be nullified by something that contains life. It must always be something that has life, either albumen-water – the egg comes from the hen and has life – or lukewarm milk which has come from the cow and has life; or oils that come from the plants and have life – something that still contains etheric life. And so, when there is mineral poisoning, the physical body is cured by means of the ether body. All mineral poisons cause the physical body to trespass into the ether body. If I now give the antidote, something that derives from the ether body – albumen water, lukewarm milk and the like – the physical body is driven out of the ether body.\n\nSpeaking quite generally, therefore, it can be said that animal poisons work primarily in the blood, not in the digestive process. The effect of mineral poisons is that the physical body trespasses into the ether body. Plant poisons cause the ether body to trespass into the astral body. Animal poisons cause the astral body to trespass into the field of the ‘I.’ Therefore with an animal poison the only thing to do is to expel it from the blood itself, because the ‘I’ is the highest principle. The poison can only be expelled by something that is actually in the blood. There is the example of fighting a rabies poisoning by injecting into the patient’s blood serum taken from an animal resisting rabies. This poison can only be got rid of by the direct antidote, produced in the blood itself. The human being himself produces slight animal poisons all the time. The faculties possessed by animals are due to the fact that they produce these poisons in themselves; if they did not, they would have no intelligence at all. The human being produces poisons very similar to the animal poisons, especially in organs situated near the head – but again in tiny quantities of which the body can make use. If the poisons are produced too vigorously there may, of course, be an excess of such animal poisons in the organism. This is what happens, for example, in diphtheria. Diphtheria is caused by animal poisons which have been produced by the human being himself. Therefore diphtheria can be cured in a similar way – by injecting the poison into an animal who can resist it and then injecting the serum again into the human being. He then has in his blood something that can fight the poison.\n\nIntroducing Anthroposophical Medicine, Epidemic Cosmic Influences: Influenza, Diphtheria, Meningitis, Rudolf Steiner, April 7, 1920, Anthroposophic Press, Hudson, NY, 1999, GA 312, pp. 244-253. (Also translated as Spiritual Science and Medicine, Rudolf Steiner Press, London, 1948/1989).\n\nBut if we attribute everything [inflammations, diseases] to the activity of bacilli, directing our attention only to what the bacilli are doing, we are distracted from the true cause of the disease, because any habitat that lower organisms find suitable for their own development within the human body is brought about by the primary causes. For once, we need to pay attention to the domain of primary causes. In plants, there is a constant interaction between the Earth’s forces and the forces of the supra-earthly cosmos. What is the effect of these nonearthly forces, which are always present in our environment? Plant existence as such holds the balance between the tendency toward mineralization or salt deposition in plant tissue and the tendency toward inflammation or becoming animal-like.\n\nThis process is always present in outer nature, but it is also present in an internalized and centralized form in the human organism. In the human organism, everything that is concentrated in cardiac activity needs to be kept separate from what is organized and concentrated in the lungs’ internal metabolism. These two activities must be kept separate. They can be allowed to affect each other only through an etheric or astral diaphragm inserted between them. I am using this word “diaphragm” only to suggest an image. Such a diaphragm does indeed exist, and it is the external rhythm of respiration itself. At this point, you begin to see how harmony is achieved between the upper and lower regions of the human being.\n\nWhat we call rhythmical activity in the human being, the rhythmical trembling that is expressed outwardly and physically as respiratory rhythm, extends into the activity of the etheric and astral bodies and separates the earthly forces of the upper part of the human being, which are concentrated in the lungs, and the heavenly forces of the lower part, which work from below upward through the activity expressed in the heart, just as they work from the periphery of the cosmos toward the center of the Earth.\n\nImagine that this rhythm is not working properly. What happens then is analogous to what happens when the Earth’s activity becomes too strong in plants, when earthly salt-forming activity affects the plants too strongly and they become overly mineralized. What happens then is that an ‘etheric plant,’ which is built into the lungs and grows up out of them just as physical plants grow up out of the Earth, becomes the cause of pulmonary hardening or the like as the mineralizing tendency becomes too strong in the human organism.\n\nIllnesses that appear in the form of epidemics must also be considered in terms of their primary causes. The rhythm between head and chest, which has its crudest expression in the rhythm of respiration, is easily damaged in individuals who also tend to allow certain atmospheric or supra-earthly phenomena to influence them strongly. Others, whose respiratory system is healthily organized from the start, will tend to resist such influences. It is always possible for other disruptive causes to intervene, of course. Suppose that during a particular winter night the Sun’s activity – note that I said the Sun’s activity, not the effects of light – is strongly influenced by the outer planets – Mars, Jupiter, and Saturn. Sun activity that can assert itself independently because Mars, Jupiter, and Saturn are at a distance would have a different effect from this particular winter constellation. During a winter like this, we can notice that the atmospheric phenomena are different. In susceptible individuals, this has an unusually strong influence on the rhythmical activity taking place between the chest and the head, whose crudest expression is the rhythm of respiration. We can say that this constellation significantly strengthens the tendency to regularize this rhythm in people who were born in healthy circumstances and are internally robust, although outwardly, of course, they may be quite frail. In these people, respiratory rhythm is very strongly regulated, as is the general rhythm between the head and the chest. An internally reinforced rhythm such as this is not easily affected by outside influences, and severely damaging factors are required in order to influence it. An influence such as the one I described, however, has an exceptionally strong effect on people in whom this rhythm is irregular in some way, because an already damaged rhythm tends to permit further damage. All predisposed individuals who lie on parts of the globe that are particularly affected by this heavenly constellation are candidates for so-called influenza. These influences absolutely must be present to lay the groundwork for an illness like influenza.\n\nIn a different case, something more complicated is present. Human rhythmical activity as a whole is such that these rhythms [respiration and sleeping-waking rhythms], taken together, form a unity in the entire human rhythmic system. The lower rhythm may assert itself too strongly, relatively speaking, because the upper rhythm, the head-chest rhythm, is weakened. When the upper rhythm is too weak and deviates from its proper position, it is susceptible to being made even more irregular by the lower rhythm. In this case the lower rhythm, which emanates from the activity of the spleen and from other organ activity that we will speak about later, works upward too strongly, creating the predisposition to hypertrophy of the upper digestive process withal its concomitant symptoms. A domain is created that especially favors the growth of certain lower organisms. The total picture that then appears is one of symptoms of inflammation and paralysis creeping into the upper organization while the beginnings of organ malformations or new organic growths also appear there. In short, we have the symptomatology of diphtheria. I might call this a breakthrough, from below upward, in the opposition direction from the breach that occurs in typhoid fever from above downward.\n\nIn all of these issues, the age of the person in question must also be considered. During childhood, the entire interaction of the upper and lower parts of the human being as well as the rhythmical activity that mediates between them is totally different than it is in later life. In childhood, for example, the upper region of the human being must exert a much stronger influence on the lower region than is the case later on. In reality, children ‘think’ much more than adults do. Strange as this may sound, it is nonetheless true. Instead of becoming conscious, children’s thoughts simply go into the organism and appear in its growth and in the forms it is developing. This application of thought activity to the body’s formative forces is especially pronounced in the first years of life. Once the body no longer needs to use so much of the formative forces for its own purposes, they are held back and become the force that forms the basis of memory.\n\nEverything is based on metamorphosis. What we encounter on the mental or spiritual level is only the re-spiritualization of an activity that worked on a bodily level when spirit was moving into matter. This explains why children have strong forces of resistance to many abdominal symptoms. Heavenly factors, supra-earthly factors, appear principally in the abdomen. Here again, imagine that a strong reflection occurs in the human abdomen as the result of a particular supra-earthly constellation of the Sun to other planets. What will the consequences be? There will be little effect on adults, in whom the rhythmical activity between the upper and lower parts of the body has already settled down to some extent, but children will have to forcefully resist the cosmic factor that wants to be reflected in the abdomen. And when a particular cosmic constellation affects a child’s lower body very strongly, the upper body must resist exceptionally strongly. This convulsive, overly strong application of forces in the upper part of children’s bodies causes epidemic cerebrospinal meningitis. This process certainly provides insight into how outer, nonhuman nature sends these influences into the human being. I might say that if you take this as a background for your observations, you can paint a picture of the entire symptomatology of meningitis, right down to the stiffening of the neck muscles. Because of the exertion taking place in the upper part of the child’s body, inflammatory symptoms must appear in the upper organs, in the meninges of the spinal cord or brain, which then result in the other symptoms.\n\nIt is especially necessary to sharpen our eye for seeing the human being in the context not only of the interactions taking place between different parts of the body but also of the interactions taking place between internal human factors and natural factors external to the human being or even external to the Earth.\n\nIllness and Therapy, Spiritual-Scientific Aspects of Healing, Conditions of the 9-Year Change, Headaches, Digestive Disorders, Sleep Disorders, Anemia, Chlorosis, Warmth, Rudolf Steiner, April 14, 1921, Rudolf Steiner Press, Forest Row, 2013, GA 313, pp. 51-60.\n\nWe find an important change that is more inwardly-directed and is not so outwardly apparent as, for instance, second dentition – which anyone will notice – or learning to speak. This other, more hidden process occurs in the period between the change of teeth and puberty, right in the middle of this period. Here the true I – which is really only exoterically born, as I have said elsewhere, born in a fully exoteric way, around the age of 20 – is born into the child, just as the astral body is born in the acquisition of speech. This process culminates between the age of 8 and 9. And now please consider the following. Our I-related predisposition, the I-capacity in us, is scarcely ever taken into account. Indwelling the human organism, the I does something very particular. When we ingest food we absorb substances that are also external substances, and must be transformed within us. Who causes this transformation, this thorough transformation of outer substances within us? Who does this? In truth, it is the I. The I alone has the power of, as it were, extending its feelers down into the forces of external substances.\n\nIf you have an external substance it has certain forces that have to be separated out if they are to be recombined in the human organism. Only the I really engages in penetrating the substances themselves and delving into them. So when you offer a food substance to the human organism, this food is first inside us. The I however reaches beyond the whole human organism and directly enters the food substance. Here the outer world, in respect of chemistry and physics, and the internal world of the human being, in respect of anti-chemistry and anti-physics, extend into each other. Up to the time when the second teeth begin to develop, thus the beginning of second dentition, this engagement with food substance is governed from the head. The child has been constituted during fetal development so that at birth he has received forces via his head that are active in assimilating substances from within. But after second dentition, in the time leading up to puberty, and culminating between the ninth and tenth year, the I that works from our lower organism, the lower I, has to meet and engage with the upper I.\n\nIn children the I always acts from the upper organism to assimilate substances, until the age referred to. I mean of course the instruments of the I. The I itself is ultimately a unified entity. But the I’s instruments – the polarity of I activity expressed in the lower I which meets the upper I – only establish a proper mutual relationship at this age between the ninth and tenth year. The I has to enter the human organization. With these considerations in mind, let us now observe everything that becomes apparent in children from the eighth or ninth year onward through to the age of eleven or twelve which involves searching for a harmony established only during the course of life between assimilated substances and our inner organization.\n\nTry to observe carefully how the head at this age does not much want to assimilate substances’ inner forces, how it objects to this, and how this comes to expression in headaches around the ninth, tenth, or eleventh year. Then observe how concomitant conditions arise in metabolic disorders, ones that manifest relatively close to the exterior, in the secretion of gastric acid and so forth. If you observe all these things you can see how some children are continually ailing, in a sense, due to this lack of adjustment between the I acting from below and from above. If we pay careful attention to such things we can remedy them, and after puberty they will normally fade and vanish; for at this age the astral body catches up and can compensate for what the I is not able to accomplish. These things gradually diminish from the fourteenth or fifteenth year through to the twentieth or twenty-first.\n\nYou will often have seen how ailing children, especially those in whom this sickliness expresses itself in digestive disorders, in irregular digestion, later go on to flourish and be fully healthy when carefully treated. It is very important that such treatment should take great care in relation to dietary prescriptions. Wonderful things can be achieved as long as the parents or teachers of children with this kind of ailment refrain from continually offering large amounts of food which they try to persuade them to eat. This will only exacerbate the condition. Instead we should try to discover what the child can easily digest, what he can assimilate especially well; and then we should serve this to him in smaller, more frequent portions, thus distributing food intake over a larger number of meals. This will do these children a great deal of good.\n\nIt is quite mistaken to think we are achieving anything by over-feeding, persuasion and such like. If, in addition, we ensure that such children are not too overburdened by schoolwork – which will increasingly exacerbate their condition – but instead give them enough rest and leisure, we will also be enhancing the inwardly necessary digestive activity achieved by offering smallerportions of food. All sorts of predispositions for illness potentially result from these digestive ailments, and can continue to affect a person for the rest of his life.\n\nIn the Waldorf School people are quick to complain that we give children so little homework. There are good reasons for this. A danger lies in what I will call the engagement or coupling of the lower I with the human organism. It exists really for all people, and poses a particular risk for children in modern civilization. Anyone not of sturdy peasant stock should be aware of this risk. A strong distinction still exists in relation to such things, and must be made here, between people of peasant or farming stock and the rest of us. All the rest of the world’s population has a very marked predisposition to risks arising from this insufficient engagement of the I with the organism, which is thoroughly ruined before this I is due to engage it. Such risks appear as the I engages from below. In the respiratory system and also the head system, the female constitution is more susceptible to this remarkably unstable balance. Men are more robust – though not more stable – in relation to their chest organization, and therefore less sensitive or susceptible. While the same problems can affect them, these are likely to be less apparent. The female sex is more sensitive to everything that occurs here; and what I have described as the search for the right kind of engagement or coupling of the I either culminates in a healthy condition or in anemia.\n\nAnemia is the direct continuation of all abnormal occurrences of this kind after the age of seven. It only surfaces later as a disorder, but represents an intensification of factors that are present but unnoticeable at an earlier stage of life. Here we must make an extremely important distinction. In considering the circulatory system we must distinguish circulation itself, as a sum of motions, from what in turn intimately informs this circulation and as it were penetrates it, which is metabolism. The circulatory system is informed by an equilibrium between the metabolic system and the rhythmic system, whereas the respiratory system reveals an equilibrium between the rhythmic system and the organism of nerves and senses. Observing this middle realm of the human organism, the chest system, we have to remember that it is organized between two polarities. Through breathing it is organizationally related to the head, and through circulation to the system of metabolism and limbs.\n\nEverything in the metabolism itself or in what intimately accompanies the metabolism as our capacity for movement – which is of great importance especially in the first or ‘rising’ half of life – pushes its way into the circulatory forces as forces of metabolism. And this upward-pushing dynamic must in turn advance so that, in the process I described, we find that what the I brings about in metabolism and also in the assimilation of substances advances into strong engagement with the substances’ inner forces. We find here an upward migration through circulation and breathing that extends as far as the head system, and this has to organize itself properly in the period I spoke of between second dentition and sexual maturity. The I’s capacity to grasp hold of, to engage with, the forces of external substances, must migrate upward through circulation and breathing until it acts properly upon the head system. This is the very complex process we have to study; and we can really only do so by trying to understand its effecting what I would call the outer digestive tract – where substances still strongly resemble the form they have in the outer world and where our inner processes have as yet taken only a weak hold of them.\n\nWhen the I first grasps the forces of external substances this is accompanied by taste sensations, the subjective experience of tasting. Then the process works its way inward. But tasting also extends inward. The inner digestive organism – in other words on the other side of the intestine, leading over into the blood – is still an attenuated tasting. And this really continues upward, until tasting is countered in the head. Here tasting is deadened.\n\nWhat occurs, in a sense, in the external digestive tract is strongly influenced by the mineral or salt element. The most palpable and fully developed forms of, say, anemia are often accompanied by the following concomitant symptoms: tiredness, lethargy, difficulty falling asleep or in waking up. Given all these symptoms, which can affect most children between second dentition and puberty, we first have to try to remedy the condition in the external digestive tract. Here we have to use mineral substance, still entirely mineral in character. And we will find this to be beneficial. Initially these things may be observed as strong symptoms, which all indicate how the I is seeking to grasp hold outwardly of the forces of external substances, and how it can be supported in this endeavor by, say, carbonated iron. Iron carbonate is something that supports the organism in combating lethargy whenever the I needs to get an outward grip.\n\nIf we take this a stage further, we find the I intervening too weakly in the circulatory system. Then we will see how the I’s lack of engagement in the circulatory organism can, for example, be supported by Ferrum muriaticum, thus by a medicine enhanced and intensified in the purely mineral realm. If we continue to the respiratory organism, thus advancing another stage higher, we can give very particular support to the I by using vegetable acid. Rising further, to the head system, we can do this with the pure metals – not of course as pure metals in an external sense, for initially these have no proper relationship to the human organism, but instead in their subtlest powers the human organism is itself a homeopath. In the ascent from the digestive system to the head organism, it fragments the metals itself – and we can of course support the organism in this process by potentizing a substance.\n\nYou will find that we can learn something here about potentization. We have to ascertain the actual locus of the deficiency. The lower and further away from the head the deficiency or lack of engagement is centered in the human organism, the lower should be the potencies we use. The nearer we find it to be to the head organization, the higher are the potencies required. How the I grasps hold of the external world is a real point of departure which will enable us to fathom the symptomatic phenomena we encounter. The human organism is largely also organized fluid, organized air and organized temperature. And now, you see, the I has to engage and grasp hold of these different aspects of the organism. Especially important, and subtle in nature, is the engagement of the I in the body’s different temperature conditions. The I has to engage in these temperature variations within the body in the following way.\n\nAt birth we have an image of the I. The image of, the imprint of, the I is present in the head. The I is present there as image and works throughout childhood. And now, alongside this, the I must as it were given reality or existence from below, must engage in the organism. This is expressed in the fact that this image of the I we have in our head permeates our organism with warmth in childhood. However, this permeation with warmth fades – it is strongest at birth in so far as the warming process issues from the head, and then falls away. And later on in life we need to maintain at a peak, from below, the warmth that develops in this way, and to do so through the engagement of the I in these temperature conditions. As we grow older we have to oppose this lapsing graph of warmth with the other, rising one, which largely depends on a capacity to grasp hold of rising forces made available from food substance, and to lead these into circulation, breathing, and the head system.\n\nNow let us assume that this does not happen in the proper way, that there is insufficient strength to assimilate the inner forces of external substances into the human organism. In that case you are not, as you should, introducing enough warmth into the organism via the I. The head, developing only the declining graph of warmth, allows the body to grow too cold. This becomes apparent firstly at the extremities. So please observe, now, how the state of flagging energy derived from all I described today is intensified in such people – in symptoms of chilled hands and toes. This is very tangible, for you can feel here how the process that was accomplished in childhood from above downward through the image of the I is not adequately met or countered with what needs to arise from and be developed by the active I, which should carry warmth through into the furthest extremities of the limbs. This is something that will show you how, as soon as you see things in images, as soon as you take note of how the different powers above and below are subtly interacting so that images arise. In chilled hands and feet you find images of what is occurring in the whole human organism.\n\nWhat first happens when we learn to raise ourselves upright expresses a power of uplift which is in a certain sense only external. It is supported by what streams down from above. Once the change of teeth has been completed, the power to raise ourselves has correspondingly used itself up; this primary power of uplift has come to a conclusion and then the self-raising energy passes into our interior, where a balance must be created between what rises from below upward and what streams from above downward. And then the forces coming from above and those coming from below enter into mutual opposition, encounter each other. In this one-dimensional encounter, as I will call it, we can see particularly well what is happening at this age. And now observe how people with, say chlorosis or anemia grow very tired. They do not feel most tired when they walk on level ground but when they’re climbing stairs. This points us directly to these phenomena. People with a tendency to anemia are especially taxed by climbing stairs; and so, in such symptoms, and in what comes to living expression as a child grows, we can grasp hold of spiritual realities underlying our existence. And then we can come to the point of simply ‘reading off’ what we need to do to remedy abnormal conditions from what diagnostic pathology can tell us in this way.\n\nPeople usually only concern themselves with disease, or at least with one or other forms of disease, when they fall ill in some way; and then they are mostly only interested in their recovery, in the fact of being cured. How they are cured is usually of very little interest to them, and it is even very agreeable to them not to have to concern themselves further with the nature of this recovery. Most of our contemporaries are happy to delegate the task of curing them to the people appointed to do so. In fact, a far more pervasive faith in authority holds sway in this field in our era than has ever held sway in the sphere of religion. Medical papacy, irrespective of what form it assumes in one place or another, has today become extremely prevalent and will go on taking stronger hold in future. A great majority of the population looks on with complete indifference as the medical papacy assumes ever greater proportion, worming its way into the most diverse fields – for instance, intervening extensively in children’s education, in school life, and staking a claim here to a certain form of therapy. People do not worry about the deeper underling factors at work here. They stand by and watch as public ordinances are given some kind of legislative form. They have no real wish to gain insight into such things. They are blithely unconcerned as to whether all mainstream methods and knowledge are undermining and undercutting a deeper, spiritually derived approach. Who worries if a public ordinance prohibits the practice of a method founded on esoteric insight, or even if the practitioner is locked up? People fail to consider such tings thoroughly enough, and only wake up to them in a particular case that affects them directly. The task of an authentic spiritual movement, though, is to waken awareness that the egotistic quest for a cure is insufficient, but that instead insight is needed into the deeper foundations of these things, and the dissemination of such insight.\n\nWe must eradicate from the soul\n\nAll fear and terror of what comes\n\nTowards us from the future.\n\nIn all feelings and sensations about the future.\n\nWe must look forward with absolute equanimity\n\nTo everything that may come.\n\nAnd we must think only that whatever comes\n\nIs given to us by a world-directive full of wisdom.\n\nIt is part of what we must learn in this age,\n\nNamely, to live out of pure trust,\n\nWithout any security in existence.\n\nTrust in the ever present help\n\nTruly, nothing else will do\n\nIf our courage is not to fail us.\n\nAnd let us seek the awakening from within ourselves\n\nEvery morning and every evening.\n\nOther articles from Dr. Gabriel on this topic:", "opengraph": {"type": "article", "title": "Rudolf Steiner on the Question of Vaccinations", "url": "https://aim4truth.org/2021/09/12/rudolf-steiner-on-the-question-of-vaccinations/", "description": "it would not take a medical degree to know that these substances are dangerous for human consumption, let alone injection into the human bloodstream. One can only imagine that health is not the goa…", "article:published_time": "2021-09-12T18:25:29+00:00", "article:modified_time": "2021-10-24T16:07:09+00:00", "site_name": "American Intelligence Media", "image": "https://aim4truth.org/wp-content/uploads/2020/09/steiner-vaccine.jpg", "image:width": "638", "image:height": "358", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["https://aim4truth.org/2017/03/26/5663/", "https://aim4truth.org/2020/04/30/virus-lies-and-vaccine-wars/"], "authors": [], "publish_date": "2021-09-12T18:25:29+00:00"}