{"result_id": "024047", "URL": "https://aim4truth.org/2020/05/07/the-british-rothschild-biowarfare-conspiracy/", "timestamp": "2023-04-25 12:02:18 CEST+0200", "meta": {"description": "Look who is hiding behind the Queen and the Monarch with their plans for global genocide and control....the ROTHSCHILDS. And we didn't even have to disclose their alleged religious affiliation in order to reveal these pesky FACTS...some even handwritten by Lord Rothschild himself as he planned world domination.", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/aim4truth.org/wp-content/uploads/2017/02/cropped-aim-4-truth-png.png?fit=32%2C32&ssl=1", "canonical": "https://aim4truth.org/2020/05/07/the-british-rothschild-biowarfare-conspiracy/", "encoding": "UTF-8"}, "image": null, "domain": "aim4truth.org", "title": "The British Rothschild biowarfare conspiracy", "cleaned_text": "Pilgrims Society, Bill Gates, Tony Fauci, Pirbright Institute, NIH, CDC, Jacob Rothschild (“the cryptkeeper”)* make $$$ billions from vaccines and vaccine research—are the very definition of ethical conflict of interest.\n\n* Rothschild Asset Management owns International Biotechnology Trust PLC, Co. No. 02892872 (UK) that controls massive U.S. biotech holdings\n\nProsecute the American Pilgrims Society for sedition with the British Pilgrims Society in a conspiracy to attack the human blood stream\n\nMay 07, 2020—Conclusion from this CDC data review: The increases in mortality appear to have a direct accelerating correlation to the increased rates of vaccination.\n\nSince the prevailing assumption that vaccines should reduce flu mortality, the statistics appear to show that vaccines disproportionately increase flu mortality, not decrease it, as intended.\n\nLet’s stop injecting unknown foreign substances into our bloodstreams because some “expert” says its good, but where those experts have a political agenda as well as investments in the vaccine companies that will benefit.\n\nLet’s wake up and stop being so gullible. These so-called experts who fail to disclose their massive conflicts of interest is proof enough that they only have their self interest in mind, and not the welfare of We the People and our families.\n\nMeet some of the Pilgrims Society (the literal “Deep State”) eugenicists\n\nL/R: Jacob Rothschild, 4th Baron Rothschild (“the cryptkeeper”) owner of Rothschild Asset Management & Biotechnology Trust PLC, the first DNA manipulation biotech firm in the UK via father Baron Victor’s company Biotechnology Investments Limited (BIL) (all records of this Rothschild-founded biotech firm are missing from Companies House UK and embargoed in archives until Jan. 2045); through BIL, Victor Rothschild (3rd Baron Rothschild) organized the modern version of The Pirbright Institute with Wellcome Trust and Bill Gates Foundation;\n\n \n\n Anthony Fauci, NIH, creator of AIDS/HIV;\n\nNick Knowles, virologist, director of the Foot & Mouth division of The Pirbright Institute, oversaw the 2007 foot and mouth outbreak at Pirbright UK, then oversaw the founding of Merial Animal Health Institute in Nanching, China for Pirbright, just four hours from Wuhan, China; Pirbright holds the U.S. Pat. No. 10,130,701 named “Coronavirus.”\n\nIn a 1988 Freudian slip (given the now-known 120-year+ high priority of the Pilgrims Society for vaccines and eugenics), Philip famously told the German news agency Deutsche Press Agentur: “In the event that I am reincarnated, I would like to return as a deadly virus, to contribute something to solving overpopulation.” Philip knew about the massive Baron Victor Rothschild investments (the Queen’s banker) in the burgeoning DNA-manipulation biotechnology field that his company Biotechnology Investments Limited (BIL) was making (records are missing)—the first, initiated… in Britain. American venture capitalists beat a path to Rothschild’s door after that. Ask why its company records are missing from Companies House and embargoed until 2045!\n\nThese are some of the people presently trying to push the world into mandatory vaccines, that at the very least, weaken, not strengthen, our immune systems. Let’s dig a little deeper and see who is really hiding under the Queen’s skirts, inside teh British Imperial Empire.\n\nVictor Rothschild is the British parliamentarian who almost single-handedly bullied Parliament to reorganize the British R&D under one UKRI umbrella (U.K. Research & Innovation) for optimal Pilgrims Society exploitation, including SERC(O), QinetiQ and The Pirbright Institute into the current time\n\nVictor’s son Jacob is carrying on that biowarfare activity\n\nVictor’s biotech mentor and partner in Biotechnology Investments Limited (BIL) was Nobel prize winner Sydney Brenner. BIL corporate documents and reports have been embargoed: “Closed until Jan 2045 – Suppress all images for 60 years”.\n\nWhat are the Rothschilds hiding? Note also that BIL has been completely removed from Companies House. In 1999, it was merged into another Rothschild company: INTERNATIONAL BIOTECHNOLOGY TRUST PLC, Company number 02892872.\n\nInternational Biotechnology Trust (IBT) PLC, Co. No. 02892872. (Filed Jan. 12, 1998). Annual Report and Accounts, 1998, incl. Biotechnology Investments Limited (BIL) merger, both Rothschild Asset Management companies. Companies House\n\nBiotechnology Investments Limited (BIL) (established, 1981) was Europe’s first specialist biotech investment company, funding early-stage and unlisted biotechnology companies. Dr. Brenner was one of six eminent scientists hired as an advisor to BIL (under the direction of Rothschild Asset Management) for the purpose of gathering the most accurate technical and financial information about these start-up companies. Dr. Brenner reviewed their research, project reports, staffing and business plans and reported his findings back to BIL. The documents in this subseries are the notes he created about the companies and their potential as investment entities, as well as some correspondence regarding those companies. Further documents could be found throughout the Rothschild Assent Management folders. http://libgallery.cshl.edu/items/show/82757\n\n…was a South African biologist. In 2002, he shared the Nobel Prize in Physiology or Medicine with H. Robert Horvitz and Sir John E. Sulston.[1] Brenner made significant contributions to work on the genetic code, and other areas of molecular biology while working in the Medical Research Council (MRC) Laboratory of Molecular Biology in Cambridge, England. He established the roundworm Caenorhabditis elegans as a model organism for the investigation of developmental biology,[2][16] and founded the Molecular Sciences Institute in Berkeley, California, United States.[17][18][19][20][21][22][23][24]\n\nHere’s what Brenner was thinking as he helped spawn the modern biotechnology investing world in all its juvenility and irresponsibility, that may kill us all.\n\nSydney Brenner. (Nov. 14-18, 1983). Overview of Biotechnology in Industry – Keynote Address, Seminar on Biotechnology – Singapore, Ref. SB/3/23, No. 74175. CSHL Archive Repository.", "opengraph": {"type": "article", "title": "The British Rothschild biowarfare conspiracy", "url": "https://aim4truth.org/2020/05/07/the-british-rothschild-biowarfare-conspiracy/", "description": "Look who is hiding behind the Queen and the Monarch with their plans for global genocide and control….the ROTHSCHILDS. And we didn’t even have to disclose their alleged religious affili…", "article:published_time": "2020-05-07T17:11:50+00:00", "article:modified_time": "2020-05-11T00:17:16+00:00", "site_name": "American Intelligence Media", "image": "https://aim4truth.org/wp-content/uploads/2020/05/windsor-rothschild.jpg", "image:width": "897", "image:height": "565", "locale": "en_US"}, "tags": ["Science and Engineering Research Council (Great Britain)", "Biotechnology", "Brenner, Sydney", "Rothschild, Nathaniel Mayer Victor Rothschild, Baron, 1910-", "Advisory Committees"], "tweets": [], "movies": [], "links": ["https://tinyurl.com/ybj29ueb", "https://www.fbcoverup.com/docs/library/2020-05-06-Comparison-of-mortality-rates-among-flu-coronavirus-pneumonia-over-time-CDC-May-06-2020.pdf", "https://americans4innovation.blogspot.com/2020/01/coronavirus-traced-to-british-crown.html", "https://americans4innovation.blogspot.com/2020/01/coronavirus-traced-to-british-crown.html", "http://libgallery.cshl.edu/items/show/70707", "http://libgallery.cshl.edu/items/show/74744", "https://www.nature.com/articles/nbt0199_8c", "https://beta.companieshouse.gov.uk/company/02892872", "https://www.fbcoverup.com/docs/library/1998-01-12-International-Biotechnology-Trust-(IBT)-PLC-Co-No-02892872-Annual-Report-and-Accounts-1998-incl-Biotechnology-Investments-Limited-(BIL)-merger-Companies-House.-filed-Jan-12-1998.pdf", "http://libgallery.cshl.edu/items/show/82757", "http://libgallery.cshl.edu/items/browse/tag/Brenner,%20Sydney", "https://en.wikipedia.org/wiki/Companion_of_Honour", "https://en.wikipedia.org/wiki/Fellow_of_the_Royal_Society", "https://en.wikipedia.org/wiki/Fellow_of_the_Academy_of_Medical_Sciences", "https://en.wikipedia.org/wiki/Member_of_the_Academia_Europaea", "https://en.wikipedia.org/wiki/Sydney_Brenner", "https://en.wikipedia.org/wiki/South_African_people", "https://en.wikipedia.org/wiki/Biologist", "https://en.wikipedia.org/wiki/Nobel_Prize_in_Physiology_or_Medicine", "https://en.wikipedia.org/wiki/H._Robert_Horvitz", "https://en.wikipedia.org/wiki/John_E._Sulston", "https://en.wikipedia.org/wiki/Sydney_Brenner#cite_note-fried-1", "https://en.wikipedia.org/wiki/Genetic_code", "https://en.wikipedia.org/wiki/Medical_Research_Council_(United_Kingdom)", "https://en.wikipedia.org/wiki/Laboratory_of_Molecular_Biology", "https://en.wikipedia.org/wiki/Cambridge", "https://en.wikipedia.org/wiki/Roundworm", "https://en.wikipedia.org/wiki/Caenorhabditis_elegans", "https://en.wikipedia.org/wiki/Model_organism", "https://en.wikipedia.org/wiki/Developmental_biology", "https://en.wikipedia.org/wiki/Sydney_Brenner#cite_note-celegans-2", "https://en.wikipedia.org/wiki/Sydney_Brenner#cite_note-hodgkin-16", "https://en.wikipedia.org/wiki/Molecular_Sciences_Institute", "https://en.wikipedia.org/wiki/Berkeley,_California", "https://en.wikipedia.org/wiki/California", "https://en.wikipedia.org/wiki/Sydney_Brenner#cite_note-wade-17", "https://en.wikipedia.org/wiki/Sydney_Brenner#cite_note-eighthday-18", "https://en.wikipedia.org/wiki/Sydney_Brenner#cite_note-BrennerElgar1993-19", "https://en.wikipedia.org/wiki/Sydney_Brenner#cite_note-errol-20", "https://en.wikipedia.org/wiki/Sydney_Brenner#cite_note-de_Chadarevian2009-21", "https://en.wikipedia.org/wiki/Sydney_Brenner#cite_note-Friedberg2008-22", "https://en.wikipedia.org/wiki/Sydney_Brenner#cite_note-scopus-23", "https://en.wikipedia.org/wiki/Sydney_Brenner#cite_note-googlescholar-24", "https://www.fbcoverup.com/docs/library/1983-11-14-Sydney-Brenner-Overview-of-Biotechnology-in-Industry-Keynote-Address-Seminar-on-Biotechnology-Singapore-Ref-SB-3-23-No-74175-CSHL-Archive-Repository-Nov-14-18-1983.pdf", "https://www.fbcoverup.com/docs/library/1983-11-14-Sydney-Brenner-Overview-of-Biotechnology-in-Industry-Keynote-Address-Seminar-on-Biotechnology-Singapore-Ref-SB-3-23-No-74175-CSHL-Archive-Repository-Nov-14-18-1983.pdf", "http://libgallery.cshl.edu/items/show/74175", "http://libgallery.cshl.edu/items/show/74414", "http://libgallery.cshl.edu/collections/show/4", "http://libgallery.cshl.edu/items/show/74414"], "authors": [], "publish_date": "2020-05-07T17:11:50+00:00"}