{"result_id": "024039", "URL": "https://aim4truth.org/2021/07/08/the-fauci-dossier/", "timestamp": "2023-04-25 12:02:12 CEST+0200", "meta": {"description": "This is enough to put Fauci and Obama in jail for the rest of their lives. No fluff, just indictable evidence that is conclusive. Dr. Martin is one of the most recognized experts in biomedical patents, bioweapon proliferation and the laws that govern such illegal activities in America. The evidence is staggering and definitive. Martin…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/aim4truth.org/wp-content/uploads/2017/02/cropped-aim-4-truth-png.png?fit=32%2C32&ssl=1", "canonical": "https://aim4truth.org/2021/07/08/the-fauci-dossier/", "encoding": "UTF-8"}, "image": null, "domain": "aim4truth.org", "title": "The Fauci Dossier", "cleaned_text": "Dr. Gabriel writes: “This is enough to put Fauci and Obama in jail for the rest of their lives. No fluff, just indictable evidence that is conclusive. Dr. Martin is one of the most recognized experts in biomedical patents, bioweapon proliferation, and the laws that govern such illegal activities in America. He has testified before the U. S. Congress numerous times and is the spokesperson for an organization that does this type of work professionally.\n\nI have read nothing that has come close to this summary of the many crimes against humanity that the CDC and NIH have illegal committed. The evidence is staggering and definitive. Martin names all of the criminal characters and companies involved in the creation of the man-made, laboratory designed synthetic bioweapon that mixed SARS and corona virus variants into a deadly weapon. Even the fake Covid vaccine is revealed as a viral vector, not a vaccine. This is the weapon that We the People need.”\n\nFULL INTERVIEW – There is NO variant, Not novel, NO pandemic – Dr David Martin with Reiner Fueller\n\nDr. David Martin is the founding CEO of M∙CAM Inc. M∙CAM is the international leader in intellectual property-based financial risk management. From auditing patent quality for governments and patent offices, to providing state-of-the-art actuarial risk management systems and solutions to the largest banks and insurance companies, M∙CAM has established a global standard in patent quality and commercial validity assessment and management.\n\nA spokesperson for global intellectual property accountability and quality reform, Dr. Martin has worked closely with the United States Congress, numerous trade and finance regulatory agencies in the United States, Europe and Asia, in advocating and deploying infrastructure to support growing reliance on proprietary rights in business transactions. M∙CAM has supported the modernization of intellectual property, tax, and accounting laws through its work with oversight agencies and policy makers.\n\nDr. Martin has founded several for-profit and non-profit companies and organizations and serves of several boards. He was the founding CEO of Mosaic Technologies Inc., a company that developed and commercialized advanced computational linguistics technologies, dynamic data compression and encryption technologies, electrical field transmission technology, medical diagnostics, and stealth/anechoic technology. He was a founding member of Japan\u0092s Institute for Interface Science & Technology. He founded and served as Executive Director of the Charlottesville Venture Group. He has served as a board member for the Research Institute for Small and Emerging Business (Washington D.C.), the Academy for Augmenting Grassroots Technological Innovations (India), the IST (Japan) the Charlottesville Regional Chamber of Commerce (Virginia), and the Charlottesville Industrial Development Agency (Virginia).\n\nAs former Assistant Professor at the University of Virginia\u0092s School of Medicine, Dr. Martin founded the University\u0092s first wholly-owned, for-profit, research and development and technology transfer corporation. Engaged in domestic and international technology transfer, clinical research, and financing, this company pioneered new techniques innovation management that have become industry standards. In 1999, Dr. Martin was appointed by the Governor of the Commonwealth of Virginia to serve on the Joint Commission on Technology and Science and has served the General Assembly and Virginia\u0092s Center for Innovative Technology on numerous occasions.\n\nDr. Martin\u0092s work with the Batten Institute at the Darden Graduate School of Business Administration at the University of Virginia and his related work at the Indian Institute for Management in Ahmedabad India has brought unprecedented curricular focus to areas of intangible asset risk management, finance, and accounting standards. In addition to his academic work, Dr. Martin has closely advised intellectual property based finance and investment programs in India, China, Denmark, the European Union, the United Kingdom, South Africa, the Islamic Republic of Iran, the United States, and the United Arab Emirates.\n\nDr. Martin has publications in law, medicine, engineering, finance and education. He maintains active research in the fields of linguistic genomics, fractal financial risk modeling, as well as continuing his over 15 years of research in cellular membrane ionic signaling.", "opengraph": {"type": "article", "title": "The Fauci Dossier", "url": "https://aim4truth.org/2021/07/08/the-fauci-dossier/", "description": "This is enough to put Fauci and Obama in jail for the rest of their lives. No fluff, just indictable evidence that is conclusive. Dr. Martin is one of the most recognized experts in biomedical pate…", "article:published_time": "2021-07-08T22:03:46+00:00", "article:modified_time": "2021-12-21T18:01:04+00:00", "site_name": "American Intelligence Media", "image": "https://aim4truth.org/wp-content/uploads/2021/07/science-fauci-garrison-pharma.jpg", "image:width": "707", "image:height": "562", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.fbcoverup.com/docs/library/2021-01-18-The-Fauci-COVID-19-Dossier-by-David-E-Martin-M-CAM-Jan-18-2021.pdf", "https://aim4truth.org/wp-content/uploads/2021/07/The-FauciCOVID-19-Dossier.pdf", "https://aim4truth.org/wp-content/uploads/2021/07/The-FauciCOVID-19-Dossier.pdf", "https://www.bitchute.com/video/lIUGg5dXHxiQ/"], "authors": [], "publish_date": "2021-07-08T22:03:46+00:00"}