{"result_id": "024013", "URL": "https://aim4truth.org/2022/05/26/w-h-o-world-order/", "timestamp": "2023-04-25 12:01:49 CEST+0200", "meta": {"description": "Dr. Tedros Adhanom Ghebreyesus is not a medical doctor but ultimately leads, single-handedly, the WHO’s “commands” concerning health emergencies of international concern – epidemics and pandemics. Please bow down or kowtow to the leader of the world, Darth Tedros the Empire’s Pseudo-medical Sith Lord. All of the fraudulent medical demands were instituted by ONE fake…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/aim4truth.org/wp-content/uploads/2017/02/cropped-aim-4-truth-png.png?fit=32%2C32&ssl=1", "canonical": "https://aim4truth.org/2022/05/26/w-h-o-world-order/", "encoding": "UTF-8"}, "image": null, "domain": "aim4truth.org", "title": "Tedros Adhanom Ghebreyesus’ W.H.O. World Order", "cleaned_text": "Just when I thought the evil vaccine emperor, Little Toni Fauci, was the incarnation of the ultimate Sith Lord of Death Vaccines, in walks Tedros the Mighty, Pharma-warlord of the New World Health Order – the United Nations’ depopulation agency – the World Health Organization (WHO). We all see the power of the ONE fake doctor that rules the whole world through WHO’s medical “advice” that the whole world MUST follow. But please don’t notice that your personal rights of freedom needed to be made secondary to Tedros and the holy World Health Organization run by the United Nation’s agency called the Health Assembly – which is a dummy organization that pretends like the Director General of WHO (Darth Tedros) is not in full control of WHO pronouncements. WHO advice is like a global medical encyclical from the supposed greatest authorities in the medical world – the Medical Pope.\n\nOops, Dr. Tedros Adhanom Ghebreyesus is not a medical doctor but ultimately leads, single-handedly, the WHO’s “commands” concerning health emergencies of international concern – epidemics and pandemics. Please bow down or kowtow to the leader of the world, Darth Tedros the Empire’s Pseudo-medical Sith Lord.\n\nThis video is available on Brighteon: https://www.brighteon.com/1750ab41-3ec2-48de-8aea-3ad45281bb1c\n\nDr. WHO (Darth Ted) is practicing medicine without a license, just like the biggest private economic donor to WHO, Bill Gates the Vaccine King. Tedros helped Gates vaccinate most of Africa and enforce the Gates’ Alliance for a Green Revolution in Africa, which now controls most food production in Africa with genetically modified seeds and food. Tedros also is a known fascist leader in Ethiopia and an outspoken communist supporter, as we all saw with the way Tedros has shielded China throughout the “China Virus” and, to this day, has not done a thorough medical investigation to find “case zero” of the virus because the Chinese Communist Party Central Committee won’t let him do so – and he complies and makes excuses for them. Tedros should know that both of the first two cases came from workers in the Wuhan BSL P-4 lab that was next to the wet-market where idiots say it came from “bat soup.”\n\nInitially, Tedros the Sith Lord refused to look at the virus when some of us could already see by the reports that this Wuhan virus started spreading in late October, 2019 at the World Military Games. Tedros told the world not to worry when the first widespread news of Covid was reported in January. He refused to stop flights from China. He refused to call a “health emergency of international concern” or an epidemic or pandemic even when faced with the obvious Chinese lies told to the world while the contagion spread. He waited from October until March before he did anything and then downplayed the illness and even said early on that facemasks were useless against this virus but still demanded the enforcement of masks knowing that the studies all say masks harm people.\n\nHe has changed his mind repeatedly on almost every recommendation and it looked like he was just trying to see if there were any limits to his WHO super-powers. He found out that there were only a few restrictions stopping his complete takeover of the world and Teddy has supposedly closed those few loopholes with an “International Health Treaty” he has created in his mind and not written down yet. Supposedly, over thirty nations have already agreed to Darth Ted’s “International Health Treaty” which, according to his own words, closes any opposition to total centralized world control via health concerns.\n\nOnce Tedros and his UN committees fumbled around for awhile further, the pandemic was spread by his actions (and inactions) and ultimately the advice given to use ventilators on senior citizens who tested positive for Covid killed many people. None of Teddy’s advice as Dr. WHO did any good. VAERS shows the many, many vaccine adverse effects to the Covid vaccines, but the WHO remains silent. The UN vaccine injury site is now out of commission but had shown over two million deaths from adverse effects from the five different Covid vaccines. Tedros still, to this day, has not changed his conflicting advice on what to do about Covid or anything recommended by the WHO, whether vaccines, treatments, ventilators, isolation of the healthy (reversed the stated powers of the WHO by locking down the healthy), closing businesses, closing schools, discriminating against essential and non-essential businesses and people, stopping travel, etc., etc., etc. All of these decisions, based upon WHO medical protocols, were made and delivered by Dr. WHO.\n\nAll of the fraudulent medical demands were instituted by ONE fake doctor – Fuhrer Tedros – who made the power of Hitler, Mussolini, Franco, Mao, Stalin, and Big-pharma’s World War III – Covid. But get ready, Teddy Boys’ new “International Health Treaty” will plug up all the holes he found during Covid in the United Nations World Health Organization’s global take-over of all nations, business, and economies.\n\nSorry, but we are too late to stop the overthrow of US sovereignty because US politicians have sold Americans out to the UN control of much of their lives, bloodstreams, health, and personal freedoms. Every politician that voted the Pandemic and All-Hazards Preparedness Acts into law (see URLs below) should be treated as traitors to the United States Constitution, which they swore to uphold. We have preached and harped and yelled and screamed about these demonic laws that must be rescinded immediately because they demand that whatever the WHO advises becomes the law in America through the CDC and NIH’s mandatory compliance.\n\nThe laws are clear, but the Anonymous Patriots seem to be some of the few who have noticed that the UN take-over of America is already complete. Covid proved that the WHO’s (CDC & NIH’s) demands become law in America once a stupid president or a stupid governor enacts emergency powers in relationship to a WHO declared pandemic and subsequently can become a dictator over their constituency. Everyone saw the fascism of the WHO become the fascism of the president and the dictatorial fascism of many governors during Covid.\n\nTHE LAWS SUPPORT THEIR DICTATORIAL, UNCONSTITUTIONAL ACTIONS, SO THEY WERE ACTING QUITE LEGALLY IF NOT ETHICALLY.\n\nThere was essentially nothing that any politician or leader was willing to do to stop the powers of our republic being handed over to the well-known corrupt hands of United Nations ADMINISTRATORS like Fake Dr. Tedros. And on top of what Covid has already shown us about global health dominance, we now see Tedros demanding more power in a new “health treaty” after he has already proved himself to be incompetent and unqualified for anything but a fascist lover of Bill Gates, big-pharma, and communist China. Tedros is not apologetic at all, but even demands more personal global power over all nations in his “imagined” health treaty.\n\nTedros and his WHO medical-fascist committees are simply unelected bureaucratic vaccine-mongers who have sold out to pharmaceutical corporations in a plan to depopulate the world through fake-medicine and self-aggrandizement.\n\nThe criminal laws listed below spell out the overthrow of the US Constitution. They are filled with unconstitutional tenets that abnegate all US citizens rights. Any politician who voted for these laws needs to answer to a military tribunal for treason. Any fifth-grade student would know these laws overthrow our constitutional republic. These laws provide the ability for politicians to surrender all American freedoms to the WHO through the CDC and NIH, and then, even the president cannot stop the enactment of these horrible laws. A citizens’ referendum could end these laws and win the battle for US sovereignty against the globalist’s intents of the United Nations World Health Organization.\n\nS.1379 – Pandemic and All-Hazards Preparedness and Advancing Innovation Act of 2019\n\nWe will quote Tedros Adhanom Ghebreyesus from the World Health Organization website where they recently posted a statement he made in Europe. I have selected relevant passages to demonstrate his polite demand to have more control of the world in his personal hands. He makes reference to his “magical thinking” International Health Treaty in these remarks, even though there is no such document, except in his mind.\n\nWHO Director-General’s remarks at the press conference with President of the European Council to discuss the proposal for an international pandemic treaty, 30 March 2021\n\n“It is now 425 days since declared COVID-19 a global health emergency.”\n\nTranslation: Tedros knows that he, and he alone, is in-charge of the WHO dictates.\n\n“…This powerful idea, of a treaty rooted in WHO, has resulted in the joint statement issued today and published in major newspapers around the world and in multiple languages, which has been signed, so far, by twenty-five heads of state and heads of government.”\n\nTranslation: They signed a document/treaty that doesn’t exist yet? Words of a madman.\n\n“…The time to act is now. The world cannot afford to wait until the pandemic is over to start planning for the next one. We must not allow the memories of this crisis to fade and go back to business as usual.”\n\nTranslation: Sounds like Claus Swab speaking. Note that he implicitly indicates that the “next one” is coming very soon. He was the WHO Director General for three years before Covid and he did no planning or preparation except to run simulations for the WHO pandemic take-over of the world: Event 201, etc.\n\n“…Without an internationally coordinated, all-of-government, all-of-society, One Health approach to pandemic preparedness and response, we remain vulnerable.”\n\nTranslation: Fear mongering is his only virtue. Note that it is an “all government, all society, One Health approach”, which sounds a lot like centralized globalist control of everyone under One Health Dictator. Tedros wants it all, now. He also leaves out any consideration for the sovereignty of nations in “Teddy’s Globalist Health-controlled World Order.” Teddy’s new “International Health Treaty” will create the longed-for New World Order with One Health, One Currency, One Medical Microchip Implant, One Religion, One Health System, and One Inhuman Dictator. This fascist path is quite common in “leaders” who single-handedly want to control everything – hegemony.\n\n“…Ultimately, of course, how such a treaty is developed and what it looks like, and whether it is ratified, is a matter for our Member States [UN Health Assembly] – the nations of the world.”\n\nTranslation: Teddy says in other places in his statement that thirty nations have signed “his treaty”, but now you can see that he says that the treaty doesn’t exist yet, needs to be developed by Member States (even though it is already written in his head) and ratified before a Global Medical Marshall Law take-over of the world can be effective.\n\nFake Doctor WHO, Tedros the Mighty, makes me think that I am in the Twilight Zone because he is supposed to be protecting people’s health but does the opposite. I wonder, is Dr. WHO an evil archetype of some strange sci-fi world we find ourselves in as the bombardment of pharma-wars, treaty-wars (NATO), nuclear wars, environmental toxin-wars on humans, food-wars, gas-wars, economic-wars, and unseen 5G wars are targeting humanity, especially in the West? In this absurdly crazy, medical sci-fi spy-thriller Tedros is the evil villain (Sith Lord) who allows and promotes “mad human disease”, bat viruses, CDC zombies, this pox or that pox, mRNA genetic modification, gene manipulation, corona/adeno/orthopox/rhino/entero/Marburg/HIV/SARS/flu viruses galore, gain of function synthetic viruses, transhuman cyborg implants, RFID chip implants, robot telemedicine, deadly lock-downs, deadly masking, deadly WHO medical protocols, deadly CDC & NIH biomedical countermeasures, NIH/CDC/DoD funding of BSL-P4 labs in unfriendly nations, depopulation through vaccines, big-pharma’s immunity, deadly pharmaceutical drugs, deadly Emergency Use Authorization drugs, FDA skipping all long-term testing of EUA vaccines, “inactive graphene oxide” in all vaccines since 2007, graphene oxide in food and water, graphene oxide in aerosol spraying, largescale human cloning, injectable graphene-sheet self-organizing nanobots, hydrogel graphene, mRNA spike protein poisoning and shedding, adenoviruses in childhood vaccines, live viruses in pneumonia and shingle vaccines, big-pharma’s “inactive contents” in most drugs, 200 million US cases of cancer from childhood vaccines, VAERS deaths from vaccines, seven trillion paid to big-pharma for Covid, trillions lost through WHO protocols, death by WHO ventilator protocols for Covid, etc., etc., and more etc.\n\nOf course, these are the wars waged against your bloodstream, body, soul, and spirit by invisible enemies protected by evil, demonic laws made legal by treasonous politicians, judges, federal agencies, corporate pharmaceutical barons and a health industry focused on illness instead of health. These same Pilgrims’ control the world’s economies also, not just all of the different wars.\n\nUnfortunately, it doesn’t do any good to rail against the evil United Nation’s World Health Organization and its fascist direct, Dr. WHO – Tedros Adhanom Ghebreyesus – and his two unqualified committees that control the most powerful “war actors” in history – pharmaceutical corporations and billionaires interlocked with governmental agencies. This is simply pseudo-medical (pharmaceutical industry) control of the world parading as doctors concerned about people’s health and bio-security. For instance, “We the People” don’t really know what is in these evil injections – and big-pharma ain’t telling, nor are they taking any responsibilities for the injuries, illnesses, and deaths that have already arisen from the untested Emergency Use Authorization vaccines and unproven treatments.\n\nThis unprecedented public use of humans as lab-rats is wrong and inhumane. But unfortunately, this killing is completely sanctioned by the premier medical group in the world – the World Health Organization, which has no labs, no doctors, no medical supplies and one Director General (Dictator) at the top pronouncing the mandates for all people on the Earth. Is this an Arthur C. Clark sci-fi nightmare, or what? Please wake me from this nightmare of ignorance, hatred, and scientific annihilation of humanity.\n\nWe might note that the Director General of WHO says that he already has many nations signed on to the idea of a “international pandemic treaty” that would give Tedros even more dictatorial powers over the entire world (so far: Albania, Chile, Costa Rica, the European Council, Fiji, France, Germany, Greece, Indonesia, Italy, Kenya, the Netherlands, Norway, Portugal, the Republic of Korea, Romania, Rwanda, Senegal, Serbia, South Africa, Spain, Thailand, Trinidad and Tobago, Tunisia, the United Kingdom, and Ukraine), as if the overly broad powers of the WHO was not good enough for Tedros.\n\nDr. WHO is a known leader of fascism in Ethiopia through the Tigray People’s Liberation Front – a left-wing, terrorist, paramilitary group aligned with communism that overthrew the Ethiopian government but was later dismantled and made illegal. Tedros’ past is also littered with globalist grooming interventions and essentially, besides condoms and bed mosquito nets, Teddy has done little for African medicine and health concerns. General Tedros has basically been an administrator and not a healer. Also, remember that these thirty nations have “signed on” with Dr. WHO (according to him) to take over the world with a treaty that has not even been written down.\n\nDue to the new American amendment to the UN WHO International Health Regulations (2005), Article 12, that is currently being purposed, Teddy won’t have to wait for his new “treaty”, in the form of a slippery “regulation”, to be ratified by member nations. If the members can’t ratify the amendment in their respective nations within six months, then the amendment is automatically voted in and takes effect. It looks like nothing is going to stop Dr. WHO, and the American delegates to the Health Assembly are in on the overthrowing of American sovereignty.\n\nPharmaceutical global control has already been enacted by Tedros once through the existing International Health Regulations (2005) that enabled the take-over of the world through nefarious, incorrect health guidance and bad science from Dr. WHO and the committees of the United Nations Health Assembly. By the way, Dr. Who personally selects the Board of the Health Assembly, the Emergency Committee, and the Advisory Committee which, as a facade, control the WHO. The selections below from the WHO and IHR documents demonstrate this to be true. But essentially, the Director General controls the WHO single-handedly. Thus, Tedros is the ruler of the New World (Medical) Order, which has always been a vaccine cabal led by the United Nations’ leadership under the propaganda guise of security, health, and peace.\n\nThe UN has never actualized any of those wonderful ideas. The United Nations is, and always was, a British extension of the Institute of Pacific Relations, the Royal Institute of International Affairs (British Round Table, of which the American version is the Council on Foreign Relations), the League of Nations and the International Network of Ambassadors established by the Anglo-American Pilgrims Society. Many people misname this group the “Deep State” and, over time, it has been called many other names. At this point, the new mega-rich mafia is the World Economic Forum (WEF) that is in total support of Tedros controlling the world through the WHO via man-made pandemics, epidemics, and bad medical advice as a branch of corporate pharmaceutical interests. Pandemics help the onset of the WEF’s reset. Dr. WHO has basically said, “You will be vaccinated, whether you like it or not.”\n\nEssentially, the Center for Disease Control and Prevention (CDC) and the National Institutes for Health (NIH) are corporate/governmental pharmaceutical monopolies that, by the tenets of the US preparedness and pandemic laws, must follow the “advice” of the WHO. Thus, US law has given anti-Constitutional power to the United Nations’ World Health Organization to suspend American constitutional rights. In other words, we are at WAR and Dr. WHO is a war actor/criminal who must be arrested and tried for premeditated mass-murder for recommending health procedures world-wide that killed countless people. And now, Tedros wants all nations to agree to his yet unwritten “International Pandemic Treaty” that will give him more power than any person has ever held in history.\n\nThe life and death of millions deepens on ending and defunding the United Nations, WHO, World Bank, IMF, WTO, and all the evil agencies that do the opposite of what they claim and propagandize to have as their goals. The WHO kills and does not heal. Just look at the fact that even after Margaret Chan, former Director General of WHO (a miserable failure of a health director in Hong Kong who led the WHO for ten years and botched the handling of Ebola and Swine Flu) demonstrated that we were NOT prepared at all for pandemics, WHO did nothing to be prepared for Corona virus even though it was predicted and expected by the CDC, NIH, and many others. Tedros admits that Margaret Chan had done nothing to protect the health of anybody, but in fact, made it much worse.\n\nTedros himself has been criticized throughout his career. His actual successes amount to simply bragging about providing condoms, AIDs awareness education, mosquito nets, and lots and lots of Bill Gates and Big-pharma’s vaccines and experimental medicines for his fellow Africans. Tedros has simply been a sock-puppet for pharmaceutical companies and that is why they spent so much money running him for the office of Director General of the WHO to become the undisputed vaccine warlord of the world (who is practicing medicine without a license on a global scale). Tedros has never met a vaccine he didn’t like. He has sacrificed many African nations, as a leader of the African Union, as Guinea pigs for vaccine research. The crime of Gates’ vaccine (Gardasil) sterilizing girls in Africa is well known but the many, many other “health programs” promoted by Tedros are also depopulation fake-medicine crimes. Tedros is an African medicine man on steroids dancing to the highest bidder’s tune. Dr. WHO has never helped heal a single person in his life, he has always been a ladder-climbing administrator groomed for a fascist/communist position aligned with Big-pharma – ultimately to become the fascist medical dictator of the world.\n\nJust like every other agency in the United Nations, the WHO must be stopped, investigated and the criminals put to death or imprisoned for the premeditated murder of millions. Tedros and all vaccine promoters, like the CDC, NIH, GAVI, the Vaccine Alliance, Wellcome Trust, Bill and Melinda Gates Trust, Clinton Foundation, World Economic Forum, Rockefeller Foundation, etc., must be charged with being premeditated depopulationists (murderers) who are committing global genocide to enhance their vaccine profits and self interests. Over seven trillion dollars has been given to Big-pharma so far for Covid. Former director of the CDC Robert Redfield says Covid was nothing compared to the “new” bird flu that will hit soon. This must be the “next pandemic” Tedros is using as a fear tactic to push his “Pandemic Treaty.” But it doesn’t matter whether it is H5N1 or monkey-pox, or any of the gain of function man-made viruses funded by Fauci’s NIAID, the “next” VIRUS X is coming to get us and only the WHO can ensure health security through vaccines! Questioning this global take-over is considered by medical doctors to be insanity and might get you up locked-up for spouting such a conspiracy theory.\n\nHave no fear! Dr. WHO’s “International Pandemic Treaty” will empower the WHO to save the world again, just like they did for Covid, Swine Flu, Ebola, HIV, influenza, pneumonia, and all those childhood diseases that demand vaccinations. Oh, that’s right, the WHO, CDC, and the NIH haven’t done much of anything to prepare for viruses, stop viruses, stop any illness, develop treatments instead of vaccines, develop safe vaccines, or even been able to heal a common cold or flu. After trillions of US tax-payer dollars have been poured into these fake-health organizations, the only things we have to show for our money are large monopoly-like pharmaceutical companies getting filthy rich for bad medicine while thoroughly being protected by government regulations, demonic laws, and the treasonous politicians who voted for them.\n• End all mandatory vaccinations of any type and for any age\n• Investigate Big-pharma corporations for being complicit with premeditated murder/genocide\n• Rescind all US Emergency preparedness and pandemic laws as unconstitutional\n• End all funding and association with all United Nations agencies\n• Prosecute everyone working in a biosecurity-P4 lab for designing bioweapons\n• Stop all sharing of viruses, mRNA drugs, gain of function drugs and experiments, and biosecurity countermeasures with all other nations\n• Prosecute the leaders of the WHO, CDC, and NIH who are responsible for the mRNA vaccines that have been found to be harmful/deadly\n• Ensure that all actions of the World Health Organization, in any form, end immediately\n• Investigate all existing vaccines in America, both active and inactive ingredients\n• Institute a Moratorium on all DNA research until new safety and security guidelines are established that end all genetic manipulation\n• Restructure the entire medical care industry, putting humans first instead of money\n\n“A central and historic responsibility for the World Health Organization (WHO) has been the\n\nmanagement of the global regime for the control of the international spread of disease. Under Articles 21(a) and 22, the Constitution of WHO confers upon the World Health Assembly the authority to adopt regulations “designed to prevent the international spread of disease” which, after adoption by the Health Assembly, enter into force for all WHO Member States that do not affirmatively opt out of them within a specified time period. The International Health Regulations were adopted by the Health Assembly in 1969, having been preceded by the International Sanitary Regulations adopted by the Fourth World Health Assembly in 1951. The 1969 Regulations, which initially covered six “quarantinable diseases” were amended in 1973\n\nand 1981, primarily to reduce the number of covered diseases from six to three (yellow fever, plague and cholera) and to mark the global eradication smallpox.”\n\n“…By not limiting the application of the IHR (2005) to specific diseases, it is intended that the\n\nRegulations will maintain their relevance and applicability for many years to come even in the face of the continued evolution of diseases and of the factors determining their emergence and transmission. The provisions in the IHR (2005) also update and revise many of the technical and other regulatory functions, including certificates applicable to international travel and transport, and requirements for international ports, airports and ground crossings.”\n\n4. States have, in accordance with the Charter of the United Nations and the principles of international law, the sovereign right to legislate and to implement legislation in pursuance of their health policies. In doing so they should uphold the purpose of these Regulations.\n\nArticle 18 Recommendations with respect to persons, baggage, cargo, containers, conveyances, goods and postal parcels\n\n1. Recommendations issued by WHO to States Parties with respect to persons may include the following advice:\n\n– review proof of medical examination and any laboratory analysis;\n\n– review proof of vaccination or other prophylaxis;\n\n– implement quarantine or other health measures for suspect persons;\n\n– implement isolation and treatment where necessary of affected persons;\n\n– implement tracing of contacts of suspect or affected persons;\n\n– refuse entry of unaffected persons to affected areas; and\n\n3. The Review Committee’s report shall be submitted to the Director-General, who shall communicate its views and advice to the Health Assembly or the Executive Board for their consideration and action.\n\nPART IX – THE IHR ROSTER OF EXPERTS, THE EMERGENCY\n\nThe Director-General shall establish a roster composed of experts in all relevant fields of expertise (hereinafter the “IHR Expert Roster”). The Director-General shall appoint the members of the IHR Expert Roster in accordance with the WHO Regulations for Expert Advisory Panels and Committees (hereinafter the “WHO Advisory Panel Regulations”), unless otherwise provided in these Regulations. In addition, the Director-General shall appoint one member at the request of each State Party and, where appropriate, experts proposed by relevant intergovernmental and regional economic integration organizations. Interested States Parties shall notify the Director-General of the qualifications and fields of expertise of each of the experts they propose for membership. The Director-General shall periodically inform the States Parties, and relevant intergovernmental and regional economic integration organizations, of the composition of the IHR Expert Roster.\n\n2. The Emergency Committee shall be composed of experts selected by the Director-General from the IHR Expert Roster and, when appropriate, other expert advisory panels of the Organization. The Director-General shall determine the duration of membership with a view to ensuring its continuity in the consideration of a specific event and its consequences.\n\n3. The Members of the Review Committee shall be selected and appointed by the Director-General from among the persons serving on the IHR Expert Roster and, when appropriate, other expert advisory panels of the Organization.\n\n4. The Director-General shall establish the number of members to be invited to a meeting of the Review Committee, determine its date and duration, and convene the Committee.\n\n1. States Parties and the Director-General shall report to the Health Assembly on the implementation of these Regulations as decided by the Health Assembly.\n\nThank you to our amazing AIM community for supporting our work. http://www.givesendgo.com/AIM4Truth.", "opengraph": {"type": "article", "title": "Tedros Adhanom Ghebreyesus’ W.H.O. World Order", "url": "https://aim4truth.org/2022/05/26/w-h-o-world-order/", "description": "Dr. Tedros Adhanom Ghebreyesus is not a medical doctor but ultimately leads, single-handedly, the WHO’s “commands” concerning health emergencies of international concern – epidemics and pandemics. …", "article:published_time": "2022-05-26T13:46:23+00:00", "article:modified_time": "2022-05-26T13:51:16+00:00", "site_name": "American Intelligence Media", "image": "https://aim4truth.org/wp-content/uploads/2022/05/shoveling-tedros-dung.jpg", "image:width": "1920", "image:height": "1080", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/1750ab41-3ec2-48de-8aea-3ad45281bb1c", "https://www.govinfo.gov/app/details/USCODE-2010-title42/USCODE-2010-title42-chap6A-subchapII-partB-sec247d", "https://www.congress.gov/bill/109th-congress/senate-bill/3678", "https://www.congress.gov/113/plaws/publ5/PLAW-113publ5.pdf", "https://www.congress.gov/bill/114th-congress/house-bill/34", "https://www.congress.gov/116/bills/s1379/BILLS-116s1379enr.pdf", "https://www.who.int/director-general/speeches/detail/who-director-general-s-remarks-at-the-press-conference-with-president-of-the-european-council-to-discuss-the-proposal-for-an-international-pandemic-treaty", "http://www.givesendgo.com/AIM4Truth"], "authors": [], "publish_date": "2022-05-26T13:46:23+00:00"}