{"result_id": "024001", "URL": "https://aim4truth.org/2020/12/17/mike-pence-gives-approval-for-illegal-biological-weapons-p-4-laboratory/", "timestamp": "2023-04-25 12:01:22 CEST+0200", "meta": {"description": "Vice President Mike Pence is giving the green light approval for a illegal biological weapons P-4 laboratory in Bloomington, Indiana. You might have heard that VP Pence is \"pro-life\". That's a lie. His support of this lab shows that he is complicit in planning mass genocide, which includes sterilization, of Americans along with Qinetiq, the…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/aim4truth.org/wp-content/uploads/2017/02/cropped-aim-4-truth-png.png?fit=32%2C32&ssl=1", "canonical": "https://aim4truth.org/2020/12/17/mike-pence-gives-approval-for-illegal-biological-weapons-p-4-laboratory/", "encoding": "UTF-8"}, "image": null, "domain": "aim4truth.org", "title": "Mike Pence gives approval for illegal biological weapons P-4 laboratory In Indiana. Is working with Rothschilds and Pilgrims to exterminate humanity with bioweapons called ‘vaccines’", "cleaned_text": "The C.I.A. is engaged in biowarfare using their interlocking “public-private partnerships” to push an untested mRNA COVID-19 “vaccine” in violation of the Nuremberg Code\n\nIn short, British-American spies have created the Coronavirus to scare people into being willing to inject themselves with an untested toxic substance in clear violation of the Nuremberg Code.\n\nCatalent, where VP Pence just spoke on Tuesday, went public in 2014 and is funded by the usual Pilgrims Society interlocked companies Blackrock, Janus Henderson Group plc (British), Vanguard, and T. Rowe Price.\n\nMike Pence Supports Weapons Manufacturing Facilities in Indiana – Producing BioWeapons to be used against you and your family. Read all about it.\n\nRichard Gillingwater, the British chairman of Janus Henderson, Catalent’s second largest investor, is a Commander of the British Empire, and was an early director of QinetiQ which is controlled by the Queen’s controlling share (run by the Privy Council), along with Carlyle Group; CIA George Tenet was an early QinetiQ director.\n\nGillingwater is a current director of Wellcome Trust, one of the funders of The Pirbright Institute Coronavirus patent, and a beneficiary of the coming vaccine cash bonanza for his companies. A fellow Wellcome Trust director is Baroness Elizabeth Manningham-Buller, former director of British MI5 intelligence.\n\nThe British Pilgrims society’s fingerprints are all over the Coronavirus scamdemic. The Chinese are merely their surrogates while their bankers hide and laugh at the way they herd the media around their fake stories like cows and sheep.\n\nCheryl Mills, Hillary Clintons former Chief of Staff, is a BlackRock (C.I.A.) director\n\nA Carlos Slim (New York Times) director is also a BlackRock (C.I.A.) director\n\nRothschild banking representatives and biotech holdings are interlocked throughout Catalent investors\n\nDec. 17, 2020—Breaking Discoveries: Manufacturers of the untested mRNA COVID-19 “vaccine” are actually illegal bioweapons P-4 laboratories.\n\nOn Mar. 28, 2020, Dr. Francis Boyle, who drafted the Biological Weapons Act said that the 2019 Coronavirus is an offensive biological warfare weapon and that the World Health Organization (WHO) already knew about it (because it is U.S. Patent No. 10,130,701 owned by The Pirbright Institute (UK), one of their global partners allied with Gates Foundation, Wellcome Trust, WHO, EU).\n\nOn Dec. 8, 2020, Dr. Boyle lambasted the pharmaceutical community for trying to force an untested mRNA vaccine—the first of its kind in history—on the public, which he says violates the Nuremberg Code against Nazi experimentation cruelty.\n\nOn Dec. 16, 2020, vaccine producer Catalent hosted Vice President Mike Pence at their facility in Bloomington, Indiana that will produce 200 million doses of the COVID-19 mRNA experimental toxin by May 2021 for Moderna.\n\nPence assured the public that the vaccine would be “will be safe and effective.”\n\nOn Dec. 17, 2020, Dr. Boyle said the mRNA COVID-19 vaccine “is going to kill people.” “It’s like putting a bomb in your body because it will tap into the body’s natural processes.” He cited DARPA as being a chief funder of this bioweapon. He said that the Moderna press release today says it is going after the entire U.S. population.\n\nThe speakers at this Catalent event were 84% not doctors and 50% lawyers:\n\nIn other words, 84% of the participants were not doctors, and 50% were lawyers. It is remarkable that this lawyer-enveloped bunch was chosen to assure Americans that a totally new toxin, an untested mRNA “vaccine” that will permanently alter your DNA, is “safe and effective.”\n\nAs Dr. Boyle points out, it is not safe. And as to effective, that is sales BS. One cannot know until the results are in whether it is “effective or not.\n\nTherefore, according to Dr. Boyle—a bona fide expert in the virology of bio weapons and their prohibition, the Indiana Catalent facility is a bioweapons manufacturing facility.\n\nIn fact, some of Catelent’s top investors have relationships with the chemical companies in Britain that produce explosives, namely Imperial Chemical Industries (ICI) that created AstraZenca Plc.\n\nCatalent was created by the British Pilgrims Society using with the C.I.A. and British QinetiQ where former CIA director George Tenet was an early director.\n\nCatalent’s 2020 Proxy Statement filed with the SEC on Sep. 18, 2020 reveals that the controlling investors are:\n\nBlackRock is notoriously known for being controlled by the C.I.A. and the C.I.A.’s “private” venture capital arm In-Q-Tel.\n\nBlackRock is the world’s largest asset manager with $7.81 trillion under management in Q4 2020. Along with Vanguard (#4 in Catalent) and State Street, BlackRock is considered one of the big three dominating corporate America.\n\nIn conclusion, the interlocking relationships of the corporations and individuals pushing the fake pandemic have an enormous conflict of interests dictating that the all stand down.\n\nThe leader of the British Pilgrims Society, Lord Victor Rothschild is known as the father of modern biotechnology. He provided most of the seed venture capital in both Britain and America, that focused on the gene manipulation being undertaken in the mRNA “vaccine.”\n\nThe damage they are producing already violate the Nuremberg Code and will only get worse.\n\nThese are the same people, controlled by the British Pilgrims Society, who are attempting to takedown the American Republic in a blizzard of election fraud by leaders of the British Pilgrims Society, including Lord Mark Malloch-Brown, Sir Nigel Knowles (DLA Piper plc—boss of Kamala Harris’ newly-minted husband Dough Emhoff) and others within the British Pilgrims Society and their American minions, most notably James W. Breyer, who had boldly announced years ago that he was “Super Bullish on China.”\n\nThe fact that Breyer is showing his face, aligned with China dictator Xi JingPing, says everything.\n\nFor those who don’t remember or haven’t been paying attention, James W. Breyer was Mark Zuckerberg’s handler at the beginning of Facebook, co-founder of PayPal, director of IDG-Accel Partners China, and a Blackstone director (BlackRock affiliate with interlocked history).\n\nNote that James W. Breyer was chairman of the National Venture Capital Association in 2004—the year Facebook rose like a Phoenix on the back of the social networking code that IBM Eclipse Foundation, Breyer, co-creation, stole from Columbus innovator Leader Technologies. Included on Breyer’s NVCA board was Gilman Louie, CEO of C.I.A. In-Q-Tel. Breyer was locked in to the weaponization of inventions at the fascist Highland Group organized by DARPA and the DoD Office of Net Assessment.\n\nBreyer is also a director of the American Academy of Achievement in Washington, D.C. which is a surrogate awards program for recruitment and rewards for the British Pilgrims Society. Associate Justices Neil Gorsuch and Brett Kavanaugh are Breyer awardees. 2017 | 2019\n\nNo wonder Gorsuch and Kavanaugh are hiding under their desks.\n\nMore China Connections for Breyer with U. S. Secretary of Transportation Elaine Chao Family\n\nDid you know that China Chao has a sister – ? She is married to the Swamp rat James Breyer.\n\nThe youngest sister in the Chao family, Angela, currently serves as deputy chairman of the Foremost Group, an international shipping company based out of New York. This company was originally founded in 1964 by Angela’s father, James Chao; he remains the company’s chairman to this day.\n\nAngela Chao received an undergraduate degree in economics from Harvard College and her M.B.A. from Harvard Business School. She currently serves on the Harvard Business School’s Board of Dean’s Advisors, as well as on the Council on Foreign Relations.\n\nIn addition to her work with the Foremost Group, Angela Chao tours America, Europe, and Asia as a speaker, talking about her experiences with education and business. In addition, she frequently shares stories from her childhood and of growing up in America, according to her website.\n\nChao married investment banker Bruce Wasserstein in 2009; he died later that year. She is currently married to Jim Breyer, a venture capitalist and the CEO of Breyer Capital.” Source\n\n“In April 2008, Chao’s father gave Chao and McConnell between $5 million and $25 million, which “boosted McConnell’s personal worth from a minimum of $3 million in 2007 to more than $7 million”[94] and “helped the McConnells after their stock portfolio dipped in the wake of the financial crisis that year”. Source\n\nThe Chao Family Donated $40 Million to Harvard to Honor Their Late Mother\n\n“A massive spike in McConnell’s financial disclosures occurred in 2007 and 2008 following the death of Ruth Chao, with the senator’s federal disclosure jumping from $3 million to $33 million in that two year span according to Forbes.\n\nMcConnell’s re-election campaigns have received over $1 million in contributions from Elaine Chao’s family, including James and Angela, according to a 2019 report from the New York Times.” Source\n\nIn light of these findings, we have to ask:\n\nIs it prudent to trust Mike Pence to count electoral college votes for Trump from the disputed states that used outright fraud in the elections?\n\nMany say that Pence’s background is compromised (y’all know what I am saying here) and that he has always been an easy blackmail target and the reason he was selected to be President Trump’s wingman.\n\nalent. ‘s out of the bag!", "opengraph": {"type": "article", "title": "Mike Pence gives approval for illegal biological weapons P-4 laboratory In Indiana. Is working with Rothschilds and Pilgrims to exterminate humanity with bioweapons called ‘vaccines’", "url": "https://aim4truth.org/2020/12/17/mike-pence-gives-approval-for-illegal-biological-weapons-p-4-laboratory/", "description": "Vice President Mike Pence is giving the green light approval for a illegal biological weapons P-4 laboratory in Bloomington, Indiana. You might have heard that VP Pence is “pro-life”. T…", "article:published_time": "2020-12-17T23:00:13+00:00", "article:modified_time": "2020-12-17T23:07:56+00:00", "site_name": "American Intelligence Media", "image": "https://i0.wp.com/aim4truth.org/wp-content/uploads/2020/12/mike-pence-genocide.jpg?fit=1200%2C675&ssl=1", "image:width": "1200", "image:height": "675", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["https://aim4truth.org/2020/12/16/cat-report-638/", "https://www.fbcoverup.com/docs/library/2005-10-18-Qinetiq-Holdings-Limited-(Group-Plc)-Co-No-4586941-ANNUAL-REPORT-AND-ACCOUNTS-2005-Companies-House-UK-Oct-18-2005.pdf#page=4", "https://americans4innovation.blogspot.com/2020/01/coronavirus-traced-to-british-crown.html", "https://americans4innovation.blogspot.com/2020/03/weaponized-coronavirus-is-anglo.html", "https://americans4innovation.blogspot.com/2020/01/coronavirus-traced-to-british-crown.html", "https://www.sec.gov/Archives/edgar/data/1596783/000119312520248603/d14459ddef14a.htm", "https://en.wikipedia.org/wiki/BlackRock", "https://www.sec.gov/Archives/edgar/data/1364742/000119312520102552/d814850ddef14a.htm#toc814850_12", "https://www.sec.gov/ix?doc=/Archives/edgar/data/1274173/000155837020001487/jhg-20191231x10kde51f7.htm#Item10DIRECTORSEXECUTIVEOFFICERSANDCORPO", "https://www.sec.gov/Archives/edgar/data/1113169/000120677420000899/trow3700021-def14a.htm", "https://www.fbcoverup.com/docs/library/1983-09-09-Blue-chip-genes-promise-high-returns-re-Lord-Victor-Rothschild-Biotechnology-Investments-Limited-(BIL)-Co-No-02892872-NM-Rothschild-Asset-Management-p6-by-David-Fishlock-Financial-Times-Sep-09-1983.pdf", "https://americans4innovation.blogspot.com/2020/06/how-rothschilds-use-mass-surveillance.html", "https://en.wikipedia.org/wiki/Nuremberg_Code", "https://americans4innovation.blogspot.com/2018/07/part-ii-lord-mark-malloch-brown.html", "http://www.fbcoverup.com/docs/cyberhijack/cyber-hijack-findings.html#nvca-breyer", "http://www.fbcoverup.com/docs/cyberhijack/cyber-hijack-findings.html#highlands-forum", "https://www.fbcoverup.com/docs/library/2017-10-17-to-2017-10-21-2017-Adademy-of-Achievement-Summit-London-and-Oxforshire-52nd-International-Achievement-Summit-Oct-17-21-2017.pdf", "https://www.fbcoverup.com/docs/library/2019-09-13-to-15-American-Academy-of-Achievement-(The)-53rd-International-Achievement-Summit-Achievement-org-from-Sep-13-to-Sep-15-2019.pdf", "http://www.theforemostfoundation.org/angela-chao", "http://www.angelachao.com/", "https://heavy.com/news/2016/11/elaine-chao-sisters-family-siblings-jeanette-may-christine-grace-angela-james-ruth-family-history-harvard/", "https://en.wikipedia.org/wiki/Elaine_Chao", "https://www.hbs.edu/about/campus-and-culture/campus-built-on-philanthropy/Pages/chao-center.aspx", "https://nationalfile.com/china-mitch-mcconnell-has-family-ties-to-bank-of-china-top-chinese-shipping-firm/"], "authors": [], "publish_date": "2020-12-17T23:00:13+00:00"}