{"result_id": "024014", "URL": "https://aim4truth.org/2020/12/18/cat-report-640/", "timestamp": "2023-04-25 12:01:49 CEST+0200", "meta": {"description": "FDA Panel Recommends Approval of Moderna Virus Vaccine for Emergency Use Companies Let Staff Work From Anywhere They Choose Pentagon halts Biden transition briefings Vice President Mike Pence and his wife Karen received an injection of the Pfizer coronavirus vaccine Friday morning at the White House Mike Pence to Confirm Joe Biden, Then Leave The…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/aim4truth.org/wp-content/uploads/2017/02/cropped-aim-4-truth-png.png?fit=32%2C32&ssl=1", "canonical": "https://aim4truth.org/2020/12/18/cat-report-640/", "encoding": "UTF-8"}, "image": null, "domain": "aim4truth.org", "title": "Dr. Anthony Fauci: ‘Independent Spirit’ in U.S. Has ‘Hurt Us’ During Pandemic", "cleaned_text": "Dr. Anthony Fauci: ‘Independent Spirit’ in U.S. Has ‘Hurt Us’ During Pandemic\n\n“Of the four provisions, the most recent and the most powerful is 10 USC § 253, which was written in 2006. This is the one that liberal pundits always forget to mention when they blab about Posse Comitatus and governors. It reads:\n\nThe President, by using the militia or the armed forces, or both, or by any other means, shall take such measures as he considers necessary to suppress, in a State, any insurrection, domestic violence, unlawful combination, or conspiracy, if it-\n• so hinders the execution of the laws of that State, and of the United States within the State, that any part or class of its people is deprived of a right, privilege, immunity, or protection named in the Constitution and secured by law, and the constituted authorities of that State are unable, fail, or refuse to protect that right, privilege, or immunity, or to give that protection; or\n• opposes or obstructs the execution of the laws of the United States or impedes the course of justice under those laws.” Read more\n\nSame enemy now as it was in 1775. This time, however, they used information warfare (indoctrination, brainwashing, and propaganda) to take America from the inside. Can’t let that happen. America Fuck Yeah!\n\nThis is how the corporate world will have companies and consumers take a knee to their globalist vaccine agenda. Read the headline link below – please, don’t skip over it.\n\nWe reported yesterday about how Blackrock, Catalent and global genocidist Mike Pence are working hand in glove to roll out nation-wide extermination bioweapons into the public. Read here for that article.\n\nFDA Panel Recommends Approval of Moderna Virus Vaccine for Emergency Use\n\nMike Pence is leading the way for global\n\nHere is Pence giving us a theatrical performance of vaccine injection which could be anything inside the vile – saline, B12 vitamins, or something benign. No way would they inject Pence with a deadly substance unless they wanted to murder him. Which reminds us to alert the President that his astrological aspects in January are not so good and is ripe for foul play like this.\n\nVice President Mike Pence and his wife Karen received an injection of the Pfizer coronavirus vaccine Friday morning at the White House\n\nMike Pence to Confirm Joe Biden, Then Leave The Country (March 9, 2021. See what YouTube did here? Removed this video so that you don’t know the truth. Censorship!)\n\nActing Defense Secretary Chris Miller ordered a Pentagon-wide halt to cooperation with the transition of President-elect Biden, shocking officials across the Defense Department, senior administration officials tell Axios.\n\nOf course Joe Biden shouldn’t get daily updates from the Pentagon. Biden is an enemy of the United States.\n\nDr. Anthony Fauci: ‘Independent Spirit’ in U.S. Has ‘Hurt Us’ During Pandemic\n\nNurse gets V@xed and Passes Out (Post production note: Here’s YouTube making sure you don’t see the immediate side effect of injecting globalist poisons into your bloodstream. Below the gray screen is the actual thumbnail that we wanted you to see.)\n\nThey’re All Guilty of Misprision of Felony!\n\nAbout all these banks and financial institutions encouraging and requiring employees to work from home – It will be easy to hide the collapse of their industry and employee layoffs when everyone is scattered around the country. The companies and banks can quietly fire them, making sure to cut off their access to company files and directories, removing their names from any association with their company. Poof. Gone. An individual who is fired may not know that others have also been fired, which is a great way to keep lay-off information away from unions, shareholders and the public.\n\nIf you are looking for a new career or employment path, choose one that cannot be done at home exclusively, like plumbing, building, excavating, mining, trucking, farming, fixing, etc. THE ‘TRADES’ ARE GREAT JOBS IN OUR NEW AMERICA!\n\nCompanies Let Staff Work From Anywhere They Choose\n\nThis is why we need martial law before the votes reach Congress. In both chambers we have severely compromised politicians, dual citizens, and outright enemies who do not have an America First agenda.\n\nMike Pence has revealed himself to be a pro-genocide, bioweapons hustler for Catalent, Blackstone, and the globalist gang. Sorry to burst your happy bubble, but ‘vanilla man’ Pence is not pro-life.\n\nThen you have Mitch McConnell being pussy spanked by his Chinese in-laws. BTW – where is Elaine Chao’s resignation from the Trump cabinet? We need to get all the enemies out of the President’s cabinet ASAP so they don’t use the 25th Amendment against him. Gotta close all those traitor exit doors, patriots.\n\nThis is a good timeline in the headline link below. Note that some of his conclusions are not ones we can stand behind, like Mike Pompeo is a good guy (Pompass is a globalist from years of Pilgrims grooming) and some others…but the timeline is still relevant.\n\nAll of the organizational moves happening across the Trump admin and what they mean\n\nIn order for a George Soros revolution to work, the elections need to be in utter chaos. That’s exactly what we see now… states ripping themselves apart for their set of electors, rogue courts, massive fraud, and reports written by shills like Peter Navarro that continue to fuel the flames of discord. We aren’t saying that what he has written about isn’t true, but what a lame reporter that he did not call out Dominion, Mark Malloch-Brown, and the British attempt to overthrow our election. Navarro is just another low-information presstitute, like Maria Bartiromo or any Fox Pravda propagandists, blathering about the obvious, but with nice graphics and fonts.\n\nPeter Navarro releases 36-page report alleging election fraud ‘more than sufficient’ to swing victory to Trump\n\nHere’s another example of someone who is stirring up chaos around the elections.\n\n“Most Important Tweet of my Life”: Attorney Lin Wood Unleashes on Justice John Roberts, Calls For His Resignation\n\nSidney Powell Reports Supreme Court Rejected Arizona and Wisconsin Cases, Gives Georgia and Michigan Until Jan 14th to Respond\n\nOf course we saw this “tale” from Hal Turner Radio. We didn’t post it because it was not sourced properly, seemed quite outrageous, and was posted on the shill site ‘Hal Turner Radio’. We wouldn’t insult your intelligence with this crap. But low and behold it made its way into the Texas legislature. It is still hearsay and not sourced properly, but who cares at this point?\n\nPeople detest Scumbag John Roberts so much, they will gladly believe it…and Scumbag has no way to correct the record. So pass it around and remind your downline that Roberts needs to be impeached or imprisoned.\n\nTEXAS ELECTORAL COLLEGE: “The Justices went into a closed room…When Texas case was brought up he said he heard screaming through the walls as Justice Roberts and the other liberal Justices were insisting…afraid of what would happen if they did right thing…Moral cowardice”\n\nWhite House Deputy Chief of Staff Sends Out Cryptic Message & Photo, “Historical Moment in the Oval…”\n\n…we already told you as much with this post:\n\nReject the globalshit tyrant Klaus Schwab and his evil agenda – the Great Reset.\n\nCardinal Burke: Forces of the ‘Great Reset’ have used COVID to advance ‘evil agenda’\n\nHow are you doing American Gal Pal?\n\nDon’t you just love it, when family or friends give you the perfect gift.\n\nMy new desktop Betsy Ross flag.\n\nHappy Christmas, Tyla and Douglas, and Blessings as always. Weyne\n\nOur reply: If only folks knew how far away you are, Weyne, from Michigan. This is what the scalability of the internet has done for all of us. (Thank you, Michael McKibben and Leader Technologies, for making this technology available.) Now patriots from Michigan to South Africa from New Zealand to India and Alabama can share the common vision for our planet – peace and prosperity without Pilgrims Society rule.\n\nKazimirRampant was booted off Twitter again – he keeps dropping truth bombs that Jack Dorsey and company do not like. Actually, we haven’t heard anything from General Flynn that was of interest to us, so far – lots of raa-raa for family, faith, America, and Tracy Beanz (yawn), but diddly squat on the British connection to Dominion, Mark Malloch-Brown and the overthrow attempt by Flynn’s buddy in the picture below – Richard Dearlove.\n\nThis is a meme of the new Acting Attorney General Jeff Rosen – through the lens of an AIM Patriot in the UK. Rosen is already being trashed worldwide by patriots who see through the veil of his real agenda.", "opengraph": {"type": "article", "title": "Dr. Anthony Fauci: ‘Independent Spirit’ in U.S. Has ‘Hurt Us’ During Pandemic", "url": "https://aim4truth.org/2020/12/18/cat-report-640/", "description": "FDA Panel Recommends Approval of Moderna Virus Vaccine for Emergency Use Companies Let Staff Work From Anywhere They Choose Pentagon halts Biden transition briefings Vice President Mike Pence and h…", "article:published_time": "2020-12-18T18:45:49+00:00", "article:modified_time": "2021-03-09T23:20:31+00:00", "site_name": "American Intelligence Media", "image": "https://aim4truth.org/wp-content/uploads/2020/12/trump-stop-world-killing-itself.jpg", "image:width": "2216", "image:height": "1526", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "980", "height": "552", "embed_code": "<iframe class=\"youtube-player\" width=\"980\" height=\"552\" src=\"https://www.youtube.com/embed/wEZSca_7y0A?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/wEZSca_7y0A?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}, {"embed_type": "iframe", "provider": "youtube", "width": "980", "height": "552", "embed_code": "<iframe loading=\"lazy\" class=\"youtube-player\" width=\"980\" height=\"552\" src=\"https://www.youtube.com/embed/ZOJCmPKaYN8?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/ZOJCmPKaYN8?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}, {"embed_type": "iframe", "provider": "youtube", "width": "980", "height": "552", "embed_code": "<iframe loading=\"lazy\" class=\"youtube-player\" width=\"980\" height=\"552\" src=\"https://www.youtube.com/embed/SAZkJZtWveM?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/SAZkJZtWveM?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}, {"embed_type": "iframe", "provider": "youtube", "width": "980", "height": "552", "embed_code": "<iframe loading=\"lazy\" class=\"youtube-player\" width=\"980\" height=\"552\" src=\"https://www.youtube.com/embed/wFNPdEESnUg?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/wFNPdEESnUg?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}, {"embed_type": "iframe", "provider": "youtube", "width": "980", "height": "552", "embed_code": "<iframe loading=\"lazy\" class=\"youtube-player\" width=\"980\" height=\"552\" src=\"https://www.youtube.com/embed/MOCyqWsVkr0?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/MOCyqWsVkr0?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}, {"embed_type": "iframe", "provider": "youtube", "width": "980", "height": "552", "embed_code": "<iframe loading=\"lazy\" class=\"youtube-player\" width=\"980\" height=\"552\" src=\"https://www.youtube.com/embed/vVhlcCyF7e8?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/vVhlcCyF7e8?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}], "links": ["https://youtu.be/wEZSca_7y0A", "https://macris.substack.com/p/trump-at-the-rubicon", "https://macris.substack.com/p/trump-at-the-rubicon", "https://youtu.be/ZOJCmPKaYN8", "https://aim4truth.org/2020/12/17/mike-pence-gives-approval-for-illegal-biological-weapons-p-4-laboratory/", "https://www.breitbart.com/economy/2020/12/17/carney-larry-finks-blackrock-doubles-down-on-woke-capitalism/", "https://www.breitbart.com/health/2020/12/17/fda-panel-recommends-approval-of-moderna-virus-vaccine-for-emergency-use/", "https://www.breitbart.com/politics/2020/12/18/mike-pence-injected-with-pfizer-coronavirus-vaccine-live-on-tv/", "https://youtu.be/SAZkJZtWveM", "https://archive.is/YmoYW", "https://www.breitbart.com/politics/2020/12/17/dr-anthony-fauci-independent-spirit-us-hurt-pandemic/", "https://stateofthenation.co/?p=42234", "https://youtu.be/wFNPdEESnUg", "https://stateofthenation.co/?p=42204", "https://www.zerohedge.com/markets/ken-moelis-letting-his-staff-work-anywhere-they-choose", "https://mobile.twitter.com/annvandersteel/status/1339638127493787650", "https://thedonald.win/p/11R4c0rcQw/big-update-all-of-the-organizati/", "https://www.washingtonexaminer.com/news/wh-adviser-navarro-releases-report-election-fraud-swing-victory-to-trump", "https://bannonswarroom.com/wp-content/uploads/2020/12/The-Immaculate-Deception-12.15.20-1.pdf", "https://trendingpolitics.com/most-important-tweet-of-my-life-attorney-lin-wood-unleashes-on-justice-john-roberts-calls-for-his-resignation/?utm_source=economics", "https://theconservativetreehouse.com/2020/12/17/sidney-powell-reports-supreme-court-rejected-arizona-and-wisconsin-cases-gives-georgia-and-michigan-until-jan-14th-to-respond/", "https://halturnerradioshow.com/index.php/en/news-page/news-nation/loud-arguments-in-us-supreme-court-chambers-over-texas-lawsuit-court-intimidated", "https://twitter.com/HowardMortman", "https://twitter.com/HowardMortman/status/1338607068165656578", "https://trendingpolitics.com/white-house-deputy-chief-of-staff-sends-out-cryptic-message-photo-historical-moment-in-the-oval/", "https://aim4truth.org/2020/12/16/meow-56/", "https://youtu.be/MOCyqWsVkr0", "https://youtu.be/vVhlcCyF7e8", "https://t.co/xjGmrT2tuT", "https://twitter.com/Gunny_Q", "https://twitter.com/Gunny_Q/status/1339952481271492608"], "authors": [], "publish_date": "2020-12-18T18:45:49+00:00"}