{"result_id": "024037", "URL": "https://aim4truth.org/2017/03/26/5663/", "timestamp": "2023-04-25 12:02:10 CEST+0200", "meta": {"description": "Every day, people in the United States are being injured and killed by vaccines, and those numbers are increasing. This is a fact that is not in dispute, as the Department of Justice quarterly report on vaccine injuries and deaths clearly demonstrates. And yet, the government’s official public statement about vaccines is that they are…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/aim4truth.org/wp-content/uploads/2017/02/cropped-aim-4-truth-png.png?fit=32%2C32&ssl=1", "canonical": "https://aim4truth.org/2017/03/26/5663/", "encoding": "UTF-8"}, "image": null, "domain": "aim4truth.org", "title": "PHARMAGEDDON", "cleaned_text": "Big Pharma is America’s new mafia whose chemical warfare on humanity dwarfs the number of victims killed by all the world wars and acts of terrorism combined. While drug companies profit billions, people are dying by the millions. It makes you wonder if Pharmageddon is upon us with the next set of mandatory vaccinations planned by the Center for Disease Control (CDC) for the profit of drug companies.\n\nOver 70% of Americans are on some form of pharmaceutical drug that often brings negative side-effects, including death. Iatrogenic death, or “death by doctor”, is considered the third leading cause of death in America, conservatively speaking. Some experts interpret the data to read iatrogenic death as the number one cause of death, and they have a great deal of evidence to back up the claim. These statistics suggest that we should change the name “health industry” to “illness industry.”\n\nConservative estimates suggest that America spends about 20% of the Gross Domestic Product (GDP) on health costs, about $3.35 trillion this year, which works out to $10,345 for every man, woman and child. Hospitals account for about 32%, doctors for 20%, and prescription drugs 10%. Spending on prescription drugs in the U.S. rose to a record $425 billion in 2016.\n\nThe vaccine business alone is currently a $30 billion per year industry and the World Health Organization has urged increased vaccines, projecting that it will become a $100 billion per year industry by 2025. (See Global Vaccine Markets Features and Trends in stunning report.)\n\nIt is evident that the federal CDC and their business partners need the public to “be okay” with the current 69 doses of recommended childhood vaccines, plus adherence for an additional 100 plus doses of vaccines recommended by the CDC’s new adult schedule. Folks, they want us to inject our families with the additional 271 vaccines that are in the development pipeline. But nowhere on the CDC’s web site can you find a disclosure that the agency is a for-profit partner with the vaccine makers for whom it is supposed to be providing federal safety oversight.\n\nThere are 57 granted U.S. patents with the CDC listed as an assignee. Some of the vaccine patents include: Flu, Rotavirus, Hepatitis A, HIV, Anthrax, Rabies, Dengue fever, West Nile virus, Group A Strep, Pneumococcal disease, Meningococcal disease, RSV, Gastroenteritis, Japanese encephalitis, SARS, Rift Valley Fever, and chlamydophila pneumoniae, flavivirus infection, human rhinovirus, adjuvants, Canarypox virus, Fowlpox virus, Sealpox virus, and dog flu.\n\nKey Point: The CDC is a pharmaceutical company in the business of profiting from illnesses they disseminate through their own vaccines while they regulate their own corporate interests.\n\nBig Pharma is the moniker given to the world’s vast and influential pharmaceutical industry and its trade group, the Pharmaceutical Research and Manufacturers of America or PhRMA. These powerful companies make hundreds of billions of dollars every year by selling drugs and medical devices. More than 20% of America’s GDP is related to the health industry. In the U.S., the industry contributes heavily to the annual budget of the U.S. Food and Drug Administration (FDA), which is charged with regulating drugs and devices made by those same companies. The industry boldly demonstrates its power, political might, and social influence over the nation’s governments and agencies, its health care systems, its doctors and hospitals, as well as the psyche of the American people.\n\nThe global market for pharmaceuticals topped $1 trillion in sales in 2014. The world’s 10 largest drug companies generated $429.4 billion of that revenue. Five of the top 10 companies are headquartered in the U.S. are Johnson & Johnson, Pfizer, Abbot Laboratories, Merck, and Eli Lilly.\n\nWith the help of staggering profits and 1,100-plus paid lobbyists, the industry has gained powerful leverage on Capitol Hill. From 1998 to 2014, Big Pharma spent nearly $2.9 billion on lobbying expenses — more than any other industry. The industry also doled out more than $15 million in campaign contributions from 2013-14. But the large amount of cash Big Pharma bestows on government representatives and regulatory bodies is small when compared with the billions it spends each year on direct-to-consumer advertising. The U.S. is one of only two countries in the world whose governments allow prescription drugs to be advertised on TV. A single manufacturer, Boehringer Ingelheim, spent $464 million advertising its blood thinner Pradaxa in 2011. The following year, the drug passed the $1 billion sales mark.\n\nBig Pharma tends to weaken the objectivity of even the most honest health professionals while encouraging them to overprescribe medications. Consider the numbers:\n• Advertising instead of research: For every $1 spent on “basic research,” Big Pharma spends $19 on promotions and advertising.\n• Distribution of free drug samples: The U.S. has one pharmaceutical sales representative for every five office-based physicians.\n• Sponsorship of symposiums and medical conventions: Drug and medical device makers spend lavishly on doctors, including covering meals, travel, seminars and conventions that sometimes look more like vacations.\n\nMany medical journals, including the industry standard bearer Journal of the American Medical Association, actively vie for the attention of Big Pharma advertising dollars, billing themselves as the best way for drug companies to reach their professional readership.\n\nThe United States, unlike other developed countries, allows pharmaceutical companies to charge whatever they want, if they do not collude with one another in setting the prices. In other words, these companies can charge whatever the market will bear. For example, Solvadi, Gilead’s hepatitis C drug, costs $1,000 for each pill, which amounted to sales of $3.5 billion between April and June of 2015.\n\nCongress, influenced by pharmaceutical lobbyists, has not allowed Medicare to negotiate drug prices, as do most health care systems, HMOs, and some insurance companies. In those countries that negotiate the prices of their national insurance plans with Big Pharma, most drugs sell for much less.\n\nIn the November 2015, $150 billion merger of U.S.-based Pfizer and Irish-based Allergen, a move known as an “inversion transaction,” Pfizer gave up its corporate citizenship in the United States so that it could reduce its tax bill by billions. Another effect of mergers is the reduction in the number of competitors, which has led to the doubling or tripling of drug prices and, in some cases, to a 1000% increase in cost. Normally, new drug prices are set only slightly higher than those of rival drugs already on the market, which typically ends up raising the price of the older drug. But if a company has few competitors or merges with its competitor, the resulting lack of, or diminished, competition means that the price of a drug can be whatever the company wants.\n\nBig Pharma is an industry that generates higher profit margins than any other and is no stranger to multi-billion dollar fines for malpractice, collusion, and over-charging–just a cost of doing business. Average profit margins for Big Pharma ranges from 42% to 10% with an average around 20%. Pfizer, the world’s largest drug company, made a 42% profit margin this year. Last year, five pharmaceutical companies made a profit margin of 20% or more – Pfizer, Hoffmann-La Roche, AbbVie, GlaxoSmithKline (GSK) and Eli Lilly. With some drugs costing upwards of $100,000 for a full course, and with the cost of manufacturing just a tiny fraction of this, it’s not hard to see why profits are so high.\n\nIatrogenic damage (defined as a state of ill health or adverse effect resulting from medical treatment) is the third leading cause of death in the U.S., after heart disease and cancer. This means that doctors and hospitals are responsible for more deaths each year than cerebrovascular disease, chronic respiratory diseases, accidents, diabetes, Alzheimer’s disease and pneumonia.\n\nThe combined effect of errors and adverse effects that occur because of iatrogenic damage include:\n• 20,000 deaths/year from other errors in hospitals\n\nFrom 1976 to 2006, 62 million death certificates were coded as having occurred in a hospital setting due to medication errors. Imagine what those numbers will be for the next three decades 2007-2037! An estimated 450,000 preventable medication-related adverse events occur in the U.S. every year. The costs of adverse drug reactions to society are more than $136 billion annually — greater than the total cost of cardiovascular or diabetic care. Adverse drug reactions cause injuries or death in one of five hospital patients.\n\nIn 2009, there were 4.6 million drug-related visits to U.S. emergency rooms nationwide, with more than half due to adverse reactions to prescription medications – most of which were being taken exactly as prescribed. Heroin deaths in America in that year were 12,989. Deaths from synthetic opioids, including illicit fentanyl were 9,580. Abuse of drugs like Oxycontin and Vicodin killed 17,536. These are stats that we could glean from our internet searches. We surmise that these figures will be much higher once newer statistics are released, if they are ever released accurately and promptly.\n\nThere is also “iatrogenic poverty” to describe impoverishment induced by medical care. Impoverishment is described for households exposed to catastrophic health expenditures or to hardship financing. In the USA, illness and medical debt causes half of the personal bankruptcy.\n\nIt is estimated that 400,000 unnecessary deaths happen in American hospitals annually. It is the third leading cause of death in the United States. Some studies show that about 1.14 million patient-safety incidents occurred among the 37 million hospitalizations in the Medicare population alone over a two-year period. But after all these iatrogenic events, less than 20,000 malpractice suits are brought against doctors each year.\n\nThe main cause of a cascade of injury in iatrogenic medicine is by misdiagnosis and medical error. From medical error flows a cascade of effects and results often including pain, disability, loss of job, poverty and homelessness which obviously cause mental health problems and may cause death. In medicine, a cascade effect may also refer to a chain of events initiated by an unnecessary test, an unexpected result, or patient or physician anxiety, which results in ill-advised tests or treatments that may cause harm to patients as the results are pursued.\n• Adverse reactions in hospitals to prescribed drugs is conservatively estimated to be 2.2 million per year.\n• The number of unnecessary antibiotics prescribed annually for viral infections is 20 million per year.\n• The number of unnecessary medical and surgical procedures performed annually is 7.5 million per year.\n• The number of people exposed to unnecessary hospitalization annually is 8.9 million per year.\n• The total number of deaths caused by conventional medicine is estimated by some to be 783,936 per year.\n\nIf these estimates are true, the American medical system is the leading cause of death and injury in the U.S. By contrast, the number of deaths attributable to heart disease annually is estimated at 699,697, while the number of deaths attributable to cancer is estimated at 553,250. The cost per year for treating avoidable doctor induced injuries is estimated to be over $282 billion per year.\n\nAmerican vaccination programs are out of control. The rise in the number of vaccines administered to American children in their first five years makes America the leader in the number of immunizations administered to children. The CDC Childhood Immunization schedule skyrocketed from 11 injections in 1983 to 36 or more injections as of 2015. Recently, California Governor Jerry Brown signed bill SB277 into law, which took effect July 1, 2016. The law is “one of the most far-reaching vaccination laws in the nation which barred religious and other personal-belief exemptions for schoolchildren, thus taking away America civil rights.\n\nSuch a harmful and unconstitutional law is like declaring Marshal Law over the American bloodstream.\n\nCritical reports are showing that the commonly-accepted procedure of administering vaccines to children in their infancy dramatically increases risk to their systems. Corresponding to this rise in the number of vaccines was a precipitous rise in allergies, autoimmune disease, asthma, and autism. Autism affected a scant 1 in 10,000 children in 1982, where now 1 in 88 children born in the U.S. is diagnosed with autism.\n\nThe connection to autism has already been repeatedly established, and there are many other conditions caused by vaccines. Permanent paralysis (Guillain Barré syndrome) is surprisingly common as a side-effect of the flu vaccine. Vaccines are said to prevent certain diseases. However, the chance of contracting these diseases is incredibly remote, and the iatrogenic side-effects from vaccines are so common that overall vaccines cause much more harm than good. In some cases, vaccines infect patients with the very diseases that they were meant to offer protection from, because they utilize live viral strains.\n\nThe following substances are found in one or more “mandatory” vaccines given to children during the most sensitive years of their life. Mercury alone causes enough side-effects that it should be simple to understand that all vaccines should be optional or simply banned altogether. The list below contains deadly poisons, carcinogens and other unassimilable substances found in vaccines:\n\nAborted baby fetus tissue, human albumin, formaldehyde, mercury, antifreeze, aluminum, 2-phenoxyethanol, phenol, methanol, borax , glutaraldehyde, monosodium glutamate , sulfate and phosphate compound, ammonium sulfate, gentamicin sulfate, neomycin sulfate, tributylphosphate, polymyxin B, polysorbate 20/80, sorbitol , polyribosylribitol, beta-propiolactone, amphotericin B, animal organ tissue and blood, large foreign proteins, latex, animal viruses, human viruses, mycoplasma, genetically engineered yeast, and foreign DNA, among others.\n\nDr. William Thompson, senior scientist at the Centers for Disease Control and Prevention and someone working on the national immunization program came forward and said:\n\nHe not only said it, he made available all the documents, emails, transcripts, data outputs, databases, draft papers, original analysis plans, and exchanges with his colleagues where he had tried repeatedly to bring this to their attention. The CDC had concealed the data systematically and they revoked Wakefield’s license to practice medicine and denied that vaccines cause autism.\n\nCountries in Europe that adhere to a less elaborate childhood vaccination program than the U.S. are experiencing much lower rates of autism. According to Rescuepost.com, the data shows a direct correlation between the number of vaccines called for in a countries immunization program and the incidence of autism in that countries’ population.\n\nThe toxic Hepatitis B vaccine is administered to babies at a day old regardless of their mother’s Hep B status. Hep B is a blood-born pathogen that a child not living with a Hep B-positive person would have little risk of contracting. Despite this, it is the stated objective of the Center for Disease Control to vaccinate all American children regardless of their risk just hours after birth.\n\nEvery day, people in the United States are being injured and killed by vaccines, and those numbers are increasing. This is a fact that is not in dispute, as the Department of Justice quarterly report on vaccine injuries and deaths clearly demonstrates. And yet, the government’s official public statement about vaccines is that they are safe and effective, and should be mandated for all people. Any opinion or presentation of facts to contradict their position is vigorously suppressed and censored in the mainstream media all in the name of “public health.”\n\nFrom the study entitled: Mortality Rates and Cause-of-death Patterns in a Vaccinated Population, by McCarthy et. al., we find that analyses conducted in 2012 from the National Center for Health Statistics (NCHS) data tell us that among 13,033,274 vaccinated people, 15,455 deaths occurred between 0 and 60 days following vaccination. The mortality rate within 60 days of a vaccination visit was 442.5 deaths per 100,000.\n\nThere is a vaccine court known as the National Vaccine Injury Compensation Program (NVICP). This program was started because of a law passed in 1986 that gave pharmaceutical companies total legal immunity from being sued due to injuries and deaths resulting from vaccines. If you or a family member is injured or dies from vaccines, you must now sue the federal government in this special vaccine court. Many cases are litigated for years before a settlement is reached.\n\nIn the period from February 16, 2016 to May 15, 2016 there were 206 cases adjudicated in which 85 cases settled were for injuries and deaths due to the flu vaccine, making the flu vaccine the most dangerous vaccine in the U.S., harming and killing more people than all the other vaccines put together.\n\nThe flu vaccine is basically an experimental vaccine that the CDC and Big Pharma want to give out to 300 million Americans every year. There are no studies showing the safety of giving the flu vaccine. The CDC is in the business of distributing flu vaccines, because they represent 300 million doses per year, whereas all the childhood vaccines together number 20 million – more than ten times the profit. Another lesson in finding truth by following the money!\n\nWith most of the settlements being cases of harm caused by the flu vaccine, Guillain-Barré Syndrome (GBS) is the most common injury suffered from the flu shot. GBS is a debilitating disease that attacks a person’s own immune system and damages the nerve cells, causing muscle weakness and sometimes paralysis. GBS is also listed as a side effect of the flu shot in the package insert.\n\nWhen the Vaccine Injury Compensation Trust Fund was set up in 1988, autism was the most prevalent vaccine injury brought before the vaccine court, mostly from the MMR vaccine. This trust fund is funded through taxes the public pays on vaccines. The fund didn’t have sufficient money to pay out to the 13,330 cases of autism that were pending. So, the Omnibus Autism Proceedings were conducted and it was determined that autism is not caused by vaccines; accordingly, the fund no longer paid damages for the hundreds of thousands of children suffering with autism caused by the MMR vaccines. Only 2,409 autism cases were compensated.\n\nOn February 22, 2011, the U.S. Supreme Court shielded drug companies from all liability for harm caused by vaccines mandated by government. (Russell Bruesewitz et al v. Wyeth et al. No. 09-152. Argued October 12, 2010). Six Supreme Court judges created the liability safety net for the U.S. mass vaccination system and wrote Big Pharma a blank check by deliberately ignoring the language and legislative history of the 1986 Vaccine Injury Act. Thus, from that moment on, drug companies selling vaccines in America were not held accountable in a court of law. If you get paralyzed by a flu shot or your child has a serious reaction to a vaccine required for school and becomes learning disabled, epileptic, autistic, asthmatic, diabetic or mentally retarded, you are on your own.\n\nThree decades ago, government officials were ordering doctors to give children 23 doses of 7 vaccines. Today, that direct order is up to 70 doses of 16 vaccines. But now, the Supreme Court has given Pharma and doctors permission to lobby legislators to require every American, who lives to be 78 years old, to get more than 130 doses of government recommended vaccines starting on the day of birth through the last year of life.\n\nIn 1982, four of the largest drugs companies, Merck, Wyeth, Lederle, and Connaught blackmailed Congress by threatening to stop selling vaccines in America unless a law was passed giving them complete immunity from prosecution. The pharmaceutical industry knew they were in trouble because the old, crude whooping cough vaccine in the DPT shot was causing brain inflammation and death, and the live oral polio vaccine was crippling children and adults with vaccine strain polio which caused many Americans to file lawsuits.\n\nIn 1988, after great lobbying the following law was passed, 42 U.S. Code § 300aa–22 – Standards of Responsibility was passed, which states: (1) No vaccine manufacturer shall be liable in a civil action for damages arising from a vaccine-related injury or death associated with the administration of a vaccine after October 1, 1988, if the injury or death resulted from side effects that were unavoidable even though the vaccine was properly prepared and was accompanied by proper directions and warnings.\n\nVaccines should not be legally required, especially when doctors cannot predict ahead of time who will be harmed by a vaccine and there is no civil liability for the company selling it, the person giving it or the government official mandating it.\n\nThe Obama administration’s Department of Health and Human Services (HHS) created a program to track Americans’ vaccination records, wage a massive propaganda campaign to “encourage” more inoculations, and foist more controversial vaccines on adults against their will. Critics of the unconstitutional scheme, formally dubbed the “National Adult Immunization Plan” (NAIP), say the ultimate goal is to forcibly vaccinate all Americans and move toward a radical new healthcare paradigm in which medical “treatment” is mandatory.\n\nThis Obama program violates the human right to protect bodily integrity and autonomy which is the core value of “informed consent.”\n\nKEY POINT: The battle for the bloodstream is not just about being anti-vaccine, it is about freedom, values, beliefs, and what medical risks individuals are willing to accept. Vaccination just happens to be at the forefront of the battle.\n\nAdding more mandatory vaccines for children and adults is an assault on individual liberty, privacy, medical ethics, and the U.S. Constitution. The radical United Nations inspired plan also incorporates eugenic sterilization and uses Obama’s executive authority and the legacy media to foist coercive propaganda that supports fantastic profits for Big Pharma and illness for Americans. The same corporate Pharma-Warlords successfully lobbied the federal government to shield them from liability when their products kill and injure consumers.\n\nObama’s Executive Order entitled: Advancing the Global Health Security Agenda (GHSA) to Achieve a World Safe and Secure from Infectious Disease Threats states that: “It is hereby ordered as follows: Section 1. Policy. As articulated in the National Strategy for Countering Biological Threats and implemented in Presidential Policy Directive 2 (PPD-2), promoting global health security is a core tenet of our national strategy for countering biological threats. No single nation can be prepared if other nations remain unprepared to counter biological threats; therefore, it is the policy of the United States to advance the Global Health Security Agenda (GHSA), which is a multi-faceted, multi-country initiative intended to accelerate partner countries’ measurable capabilities to achieve specific targets to prevent, detect, and respond to infectious disease threats (GHSA targets), whether naturally occurring, deliberate, or accidental.\n\nThe roles, responsibilities, and activities described in this order will support the goals of the International Health Regulations (IHR) and will be conducted, as appropriate, in coordination with the World Health Organization (WHO), Food and Agriculture Organization of the United Nations (FAO), World Organisation for Animal Health (OIE), Global Partnership Against the Spread of Weapons and Materials of Mass Destruction, the International Criminal Police Organization (INTERPOL), and other relevant organizations and stakeholders. To advance the achievement of the GHSA targets and to support the implementation of the IHR within partner countries, each executive department, agency, and office (agency) shall, as appropriate, partner, consult, and coordinate with other governments, international financial institutions, international organizations, regional organizations, economic communities, and nongovernmental stakeholders, including the private sector.”\n\nTranslation: Obama put the United Nations in charge of every American’s bloodstream and the UN’s eugenic war against over-population has targeted every American citizen. The United States of America and the U.S. Constitution is overthrown if this relinquishing of U.S. liberties is fully instituted.\n\nThe largest drug companies are prepared annually to pay out up to $5 billion in lawsuits for damages (including death) caused by the drugs they produce. These huge pay-outs and possible deaths are simply the price of doing business. Many millions suffer untold injuries and pain due to side-effects that drug companies consider “within the realm of tolerance.” These deaths are already calculated in the overall business model of selling the drug. Below, we list a few of the known criminal activities of Big Pharma that have been taken to court and yet one has gone to jail for their negligence and criminal acts.\n\nJohnson & Johnson ($74 billion) faced more than 1,800 lawsuits over products after patients suffered from organ perforation, mesh erosion or other complications. They settled more than 100 lawsuits for undisclosed amounts, but it has more than 1,000 remaining against it. It also sold faulty hip implants containing metal components that release metal debris into patients, 12,000 patients sued and they set aside $1 billion to cover the recall and hip lawsuits. They also face hundreds of lawsuits involving a blood thinner that causes an inability to control bleeding thus being life-threatening. Hundreds of Xarelto lawsuits are pending. J&J’s Risperdal faces hundreds of lawsuits.\n\nPfizer ($49.6 billion) faced both criminal and civil allegations over illegal marketing of the drugs Bextra, Geodon, Zyvox, Lyrica, Neurontin, Detrol and Lipitor. Pfizer was accused of telling doctors that certain drugs could be used for unapproved uses and defrauding the Medicaid program. Pfizer paid $2.3 billion settlement. Effexor and Zoloft have had many law suites. Lipitor can lead to irreversible bleeding.\n\nMerck & Co. ($42.2 billion) Vioxx brought scandal to the company, as thousands of users reported instances of cardiac side effects, including fatal outcomes. Tens of thousands of lawsuits targeted Merck and it paid out billions of dollars in settlements. Fosamax, Januvia, NuvaRing, and Propecia resulted in devastating side effects for thousands of consumers who filed lawsuits.\n\nGlaxoSmithKline’s ($37.9 billion) Avandia is linked to an increased risk of heart attack, stroke and heart failure. The FDA estimates that the drug is responsible for 100,000 heart attacks causing 50,000 lawsuits so far. Paxil, Wellbutrin and Advair were marketed illegally and paid $3 billion in fines. Paxil is also associated with serious side effects like birth defects and an increased risk of suicide. Zofran causes birth defects and led to a fraud settlement.\n\nAstraZeneca ($26.0 billion) Crestor may cause liver damage and Type 2 diabetes. Onglyza may increase the risk of pancreatitis and heart failure. Farxiga may cause kidney problems, and Nexium was linked to an increase in heart attack risks. The company paid a fine of $520 million to the U.S. Department of Justice for illegally promoting Seroquel and settled thousands of lawsuits involving Seroquel for $647 million.\n\nBayer ($25.4 billion) has spent over $1 billion settling 4,800 Yaz lawsuits over blood-clot related injuries and has reserved $1.5 billion for settlements. Bayer was charged with intentionally selling a defective product misled consumers by exaggerating the benefits and inadequately warning of its risks. Bayer also faces hundreds of lawsuits claiming its blood thinner Xarelto caused internal bleeding.\n\nEli Lilly & Co. ($23.1 billion) Prozac is the target of multiple lawsuits that claim it can lead to suicidal thoughts and birth defects if used during pregnancy. Eli Lilly also has helped to market controversial products, including the diabetes drugs Actos, Byetta, Tradjenta, and the SGLT2 inhibitors Jardiance and Glyxambi leading to many law suties.\n\nAbbVie Inc. ($18.8 billion) failed to warn consumers about AndroGel’s heart risks for men, which led to hundreds of lawsuits.\n\nBristol-Myers Squibb ($15.9 billion) Byetta and Bydureon are linked to pancreatitis and pancreatic cancer. Farxiga has been linked to a deadly condition called ketoacidosis and a lawsuit was filed against BMS claiming Eilqiuis caused irreversible bleeding leading to a death.\n\nBoehringer Ingelheim ($15.1 billion) thousands of injuries and more than 500 deaths among Pradaxa users over a two-year period caused patients to file more than 4,000 lawsuits. The company settled allegations regarding Pradaxa’s bleeding risks for $650 million in 2014.\n\nStryker Orthopaedics ($9.6 billion) hip and knee implants left patients needing costly and traumatic revision surgeries. An estimated 20,000 Americans received one of these devices before they were recalled in 2012. The number of hip lawsuits against Stryker continues to grow. Stryker also marketed knee implants associated with disabling side effects that have all been partially or completely recalled to protect patients.\n\nBoston Scientific ($7.3 billion) defended the first of 6,000 lawsuits filed over health complications with Pinnacle and Obtryx, two of the manufacturer’s mesh products. It settled 3,000 cases for $119 million in 2015.\n\nC.R. Bard ($3.3 Billion) – sold dangerous products such as heart catheters, inferior vena cava (IVC) filters, mesh surgical patches and transvaginal mesh products. Bard lost mesh lawsuits for $5.5 million and $2 million in 2012 and 2013. The company settled more than 500 cases for $21 million in 2014 and an additional 3,000 cases for about $200 million in 2015.\n\nMonsanto has been dominating our foods and seeds for too long and now have manipulated them into poisonous pharmaceuticals. One might wonder how an evil Big Pharma corporation like Monsanto took over the future of American food even though it has a well-known “dark history.” Perhaps we should remember that Obama, despite his promises to label GMOs, appointed Monsanto’s Mike Taylor as head of FDA, Roger Beachy, the former director at Monsanto as head of USDA, and Tom Vilsack the creator of Governors’ Biotechnology Partnership as the commissioner of USDA. And then, Obama signed the Monsanto Protection Act that gives Monsanto ultimate protection from both the legal system and the government.\n\nAny one of these heinous bio-warfare weapons of mass destruction listed below should have banned Monsanto from ever doing business in America again; but instead, these weaponized drugs keep killing people and making great profits. Recently, the purchase bid of $66 billion for Monsanto went to one of Big Pharma’s top companies – Bayer. This deal was created to move Monsanto to Germany to avoid U.S. prosecution over multiple cases concerning Roundup being a cancer-causing drug, and to avoid paying taxes. Here is a short list of Monsanto’s evil products:\n• Aspartame, Saccharin, and Nutrasweet – Nutrasweet products are low calorie sweeteners that have been linked to cancer, craving for sugar, obesity, diabetes, and chronic neurological disorders.\n• PCBs – Monsanto is the largest producer of polychlorinated biphenyls (PCBs) used as hydraulic fluid, cutting oil, and lubricant for electric motors, capacitates and transformers. PCBs are widely banned and known as one of the most dangerous chemicals related to cancer, immune system disorder, birth defects, and even death.\n• DDT – In 1944, Monsanto among 15 other companies started manufacturing DDT as a pesticide for killing weeds. Research in 1970s confirmed that DDT was toxic and due to public pressure DDT was banned in 1972.\n• Roundup – Soon after DDT was banned in 1973, Monsanto developed another toxic pesticide called Roundup (even more toxic than DDT). The active ingredient in Roundup is glyphosate which has been linked to birth defects, reproduction failure and deformities in animal laboratories.\n• Bovine Growth Hormone – The Bovine Growth Hormone (rBGH) is injected into livestock for faster growth and production of more milk. rBGH growth hormones can cause udder infections in livestock which forces large commercial dairy farmers to give cows injections of antibiotics routinely. Based on many studies, rBGH growth hormones are related to breast cancer in women and prostate cancer in men. Hormones are also related to a wave of chronic diseases including colon cancer, diabetes, heart diseases and obesity.\n• Genetically Modified Crops – Although many independent studies of concerned scientists have linked GMOs to obesity, infertility, cancer and even autism, Monsanto has been able to fully dominate and control our seeds and food supply.\n• Dioxin and Agent Orange – Monsanto and Dow were the main producers of dioxin that was a byproduct of herbicides. Many scientists have regarded dioxin as the most toxic and poisonous small molecule on the planet. Later on, 2,4,5-T dioxin-containing herbicide was mixed with 2,4-D to create Agent Orange that was used against the Vietnamese. Agent Orange killed more than 400,000 Vietnamese while half a million children were born with birth defects and up to million people were disabled or suffered from chronic diseases. More than 3 million American troops and their offspring were also the victims of Agent Orange.\n• Polystyrene – In the 1940s, Monsanto focused on oil-based plastics including synthetic polystyrene which is non-biodegradable and an environmental disaster.\n• GMO Foods and Seeds – More than 75% of processed foods are genetically modified and more than 90% of all soy and corn grown in US are GMOs.\n• Atomic Bombs, Nuclear Weapons – During WW2, Monsanto was involved in the Manhattan project and the production of the first nuclear bombs that were dropped on Japan.\n• Monsanto’s GMO alfalfa and sugar beets are a threat to native and organic crops – but the USDA illegally approved them.\n• Monsanto’s Roundup is toxic and is linked to a wide range of health problems including infertility, lower immune system, cancer and allergies, and is known to spread diseases, spread superweeds, and increase in use of chemicals.\n• The impact of GMOs on livestock is devastating. Animals fed on GMO crops have had different metabolic, physiological and immunological responses compared to others.\n• Small farmers are pushed out of business in a hostile take-over of agriculture.\n• PCBs and their devastating side-effects cause continuous liability.\n• Monsanto is still refusing to pay any compensation to the families of the Vietnamese that were poisoned with chemical Agent Orange.\n• Monsanto’s GMO seeds are causing a disaster in U.S. agriculture and GMO crops have cost the American taxpayers over $12 billion in farm subsidies.\n• There are devastating result of GMO crops in India as every 30 minutes, an Indian farmer commits suicideas a result of Monsanto’s GMO crops.\n• Monsanto is taking ownership of public water and has been polluting our soil, seeds, air, and water by chemicals including dioxin, PCB, and glyophosate. Now Monsanto is in-charge of filtering our tap water.\n• Monsanto is now joining big banks and the giant oil companies to pursue the UN so called Agenda 21 for “Global Sustainability.”\n\nThe history of Monsanto and FDA starts in 1991 when Margaret Miller was appointed as Deputy Director of FDA by George Bush Sr. Margaret Miller, as one of the top scientists in Monsanto, was working on developing rBGH growth hormones. Soon after she was appointed as head of FDA, Miller approved rBGH growth hormones, the very product that she was previously studying while working for Monsanto.\n\nDuring the same year in 1991, Clarence Thomas (Monsanto’s former attorney) was appointed to the Supreme Court despite the rage of the whole nation.\n\nIn 1992, Michael Taylor (Monsanto’s former attorney) was appointed as Deputy Commissioner of FDA. This position gave him the authority to expedite the approval of genetically modified organisms in our food supply. Taylor then became the VP of Monsanto.\n\nIn 1993, Rufus Yerxa (Monsanto’s Chief Counsel) was nominated as U.S. deputy to the World Trade Organization.\n\nIn 1996, Michael Kantor (Member of the Monsanto Board) became the US Secretary of Commerce.\n\nIn 2000, Carol Tucker Foreman (Monsanto lobbyist) was appointed as the “Consumer Advocate” on the international committee assessing genetically modified foods.\n\nIn 2001, Anne Veneman (Member of the Board) was appointed as head of USDA in charge of regulating genetically modified organisms.\n\nIn January 2001, Donald Rumsfeld (CEO of Monsanto’s Searle) was appointed as the Secretary of Defense.\n\nIn 2001, Linda Fisher (Monsanto’s VP) was appointed as Deputy Administrator of Environmental Protection Agency.\n\nIn 2002, George Poste (Monsanto’s specialist) was appointed as head of bio-terrorism division of Homeland Security.\n\nIn 2008, Obama appointed Michael Taylor, (Monsanto’s former attorney and VP) as Deputy Commissioner of FDA.\n\nObama appointed Roger Beachy, (Monsanto Director) as head of USDA and appointed Tom Vilsack as the commissioner of USDA.\n\nObama promised to label GM foods but instead the USDA under the Obama administration approved the second generation of GMOs, GMO alfalfa, and GMO sugar beets that can increase the chances of cross contamination and many other environmental problems.\n\nWhat is the overall goal of an “illness industry” designed by pharmaceutical companies and carried out by hospitals and doctors throughout America?\n\nDoes Big Pharma want to kill us? And if so, why?\n\nWhat would be the point of creating weaponized vaccines that ultimately cause illnesses in the long-run and medical costs in the short-run?\n\nThe answers to those questions are given by studying two of the richest families in American history and their subversive plan for depopulation and pharmaceutical sterilization.\n\nThe Rockefellers and Gates seem obsessed with vaccines and the proliferation of dispensaries – particularly in the Third World. Such elitist philanthropy disguised as a health project is very deceptive.\n\nThe Rockefellers, one of the world’s wealthiest families, have been the largest financial backer of eugenics and other population control measures like their early anti-fertility vaccine. From one of their proceedings we read:\n\n“Other lines of current immunological contraceptive research continue to seek what, during the 1930s, Max Mason of the Rockefeller Foundation called “anti-hormones”: vaccines to block hormones needed for very early pregnancy and a vaccine to block the hormone needed for the surface of the egg to function properly.”\n\n\n\nAnti-fertility vaccines had their origins in scientific research dating back to at least 1968, and with successful research conducted by at least 1988. There now exist several methods to sterilize both men and women by injection, as well as to terminate pregnancies and/or induce spontaneous abortions supported by the Rockefeller Foundation.\n\nThe Rockefeller family, dating back to oil baron John D. Rockefeller, has been on the cutting edge of financing eugenic research to reduce the populations of the “lesser” genetic groups of the world.\n\nThey financed early eugenics research at the Kaiser Wilhelm Institute in Nazi Germany, where some of the most horrifying research was conducted. Following World War II, eugenics was re-branded to cast off its associations with the Nazis, and emerged, as it were, in the form of such social policy topics as “population control,” “family planning,” abortion/planned parenthood, health care, and various types of genetics leading to arguments about reducing the burden of over-population upon the earth. The powerful Bill & Melinda Gates Foundation formally tied its agenda to aims of the Rockefeller Foundation through its funding for vaccinations and eugenic sterilization leading to population reduction.\n\nBill Gates and David Rockefeller were the leading members of a billionaires’ club that met in secret to discuss how to strengthen measures for population control, particularly in the developing world, through the guise of “philanthropy.” Other notable members include Ted Turner, George Soros, Warren Buffett, Oprah Winfrey, and Michael Bloomberg.\n\nThere is evidence that these anti-fertility vaccines – developed through Rockefeller-funded research – may have been used covertly in several developing nations (Philippines, India, Africa, Hait) where women experienced loss of pregnancy after receiving tetanus shots – one of the main carriers for the Rockefeller-funded HcG anti-fertility vaccine.\n\nThe global distribution of Rockefeller-funded anti-fertility vaccinations were coordinated by the World Health Organization, UN Population Fund, and the World Bank through a program called, “Task Force on Vaccines for Fertility Regulation.” Dr. P.D. Griffin from the Task Force says:\n\n“If vaccines could be developed which could safely and effectively inhibit fertility, without producing unacceptable side effects, they would be an attractive addition to the present armamentarium of fertility regulating methods and would be likely to have a significant impact on family planning programs.”\n\nOne of the advantages of the Fertility Regulation Vaccines over “currently available methods of fertility regulation” the Task Force states, is the following: “low manufacturing cost and ease of delivery within existing health services.” Already in 1978, the WHO’s Task Force on Immunological Methods for Fertility Regulation underlined the usefulness of these vaccines in regards to the possibility of “large scale synthesis and manufacture” of the vaccine.\n\nAlthough the term “Anti-Fertility Vaccine,” coined by the Rockefeller Foundation, was replaced by the more bureaucratic sounding “Fertility Regulating Vaccine (FRV), the program was the same. The WHO, as a global coordinating body, has since the early 1970s continued the development of the Rockefeller-funded “anti-fertility vaccine.” What is becoming clear, is that extensive research has been done to the delivery systems in which these anti-fertility components can be buried within another vaccine.\n\nThe Rockefeller Foundation created an anti-fertility substance called Gossypol for widespread use within other more innocuous vaccines. It seems there is no limit to the Rockefeller Foundation’s ambitions to introduce anti-fertility compounds into either existing health-services, such as vaccines, or even average consumer products.\n\nThe 1985 Rockefeller Foundation’s annual report underlined its ongoing dedication towards finding good use for the anti-fertility substance Gossypol, which is a toxic polyphenol derived from the cotton plant that was identified early on in the Foundation’s research as an effective sterilant. The question was, how to implement or integrate the toxic substance into crops for maximum exposure.\n\nIn the 1986 Rockefeller Foundation annual report, the organization admits funding research into the use of fertility-reducing compounds in relation to food for widespread use.\n\nIn the 1988 Rockefeller Foundation’s annual report, Gossypol’s effects on DNA replication was studied.\n\nIn the 1994 Rockefeller Foundation annual report it states that funds were appropriated to study the molecular action of gossypol at the cellular level to understand the process of readying Gossypol for mass-distribution in food.\n\nRockefeller Foundation minion Max Mason, who acted as president in the mid-1930s, on multiple occasions expressed the Foundation’s desire for an “anti-hormone” that would reduce fertility worldwide. This is more than 35 years before the Foundation mentioned funding “anti-fertility vaccines” in subsequent annual reports from 1969 onward.\n\nIn the annual report of 1933, the Foundation stresses the fact that work on the reproductive hormones of primates serves to experiment on man in the future. In a February 1934 progress report written by Warren Weaver (director of the Natural Sciences Division of the Rockefeller Foundation) who once again underlined the endgame:\n\n“Can man gain an intelligent control of his own power? Can we develop so sound and extensive a genetics that we can hope to breed, in the future, superior men? Can we obtain enough knowledge of physiology and psychobiology of sex so that man can bring this pervasive, highly important, and dangerous aspect of life under rational control?”\n\nThe blueprint for sterilizing vaccines has been first conceptualized back in the 1920s and 1930s by social scientists of the Rockefeller Foundation. Although later, the eugenic language (anti-fertility vaccine) was polished up with the help of some linguistic plastic surgery producing the term “immunological contraceptive”, but the ultimate goal of depopulation remains the same.\n\nBill Gates’ father, William H. Gates Sr., has long been involved with the eugenics group Planned Parenthood, a rebranded organization birthed out of the American Eugenics Society. In a 2003 interview with PBS’s Bill Moyers, Bill Gates admitted that his father used to be the head of Planned Parenthood, which was founded on the concept that most human beings are just “reckless breeders” and “human weeds” in need of culling.\n\nThis long-time eugenicist, William Gates Sr., is co-chair of the Bill & Melinda Gates Foundation who “guides the vision and strategic direction” of the Foundation, which is currently heavily focused on forcing GMOs on Africa via its financing of the Alliance for a Green Revolution in Africa (AGRA).\n\nGates also admitted during the interview that his family’s involvement in reproductive issues throughout the years has been extensive, referencing his own prior adherence to the beliefs of eugenicist Thomas Robert Malthus, who believed that populations of the world needed to be controlled through reproductive restrictions. Though Gates claims he now holds a different view, it appears his foundation’s initiatives are just a modified Malthusian approach that much more discreetly reduces populations through vaccines and GMOs.\n\nThe Gates Foundation has admittedly given at least $264.5 million in grant commitments to AGRA and reportedly hired Dr. Robert Horsch, a former Monsanto executive for 25 years who developed Roundup, to head up AGRA back in 2006. According to a report published in La Via Campesina in 2010, 70% of AGRA’s grantees in Kenya work directly with Monsanto, and nearly 80 percent of the Gates Foundation funding is devoted to biotechnology.\n\nThe same report explains that the Gates Foundation pledged $880 million in April 2010 to create the Global Agriculture and Food Security Program (GAFSP), which is a heavy promoter of GMOs. GAFSP was responsible for providing $35 million in “aid” to earthquake-shattered Haiti to be used for implementing GMO agricultural systems and technologies.\n\nVaccines, pharmaceuticals, GMOs, reproductive control, weather manipulation, global warming — these and many other points of entry are the means by which the Gates Foundation is making great strides to control the world by pretending to help improve and save it.\n\nRather than promote real food sovereignty and address the underlying political and economic issues that breed poverty, Gates has instead embraced the promotion of corporately-owned and controlled agriculture and medicine paradigms that will only further enslave the world’s most impoverished. It is abundantly evident that GMOs have ravished already-impoverished people groups by destroying their native agricultural systems, as has been seen in India. It is simple to conclude that Gates Sr. and Jr. are in bed with Big Pharma whose hidden agenda is de-population.\n\nFor Bill Jr. especially, “population control” is top priority. The Bill and Melinda Gates Foundation is employing a sophisticated eugenics program by partnering with powerful United Nations organizations like the WHO and UNICEF. They disguise their efforts as philanthropic endeavors to free the people of the world from hunger and disease, when in actuality they simply want to free the world of people. It is an agenda shrouded in classic Orwellian doublespeak.\n\nTheir stated goal of population reduction is being conducted in part through the weaponization of food and medicine. Bill Jr. invested $23 million into the biotech giant Monsanto, which invented Genetically Modified Corn, Soy and Canola. The evidence that GMO’s cause disease has been piling up for decades as the list of countries banning their import and cultivation grows. Bill openly promotes GMO’s as the answer to world hunger.\n\nIndia had been officially declared polio-free by the WHO, but now the rate of actual polio cases in India has risen steadily because of the cooperative efforts of the WHO and the Bill and Melinda Gates Foundation’s polio vaccinations. India has now become the nation with the world’s highest rate of NPAFP [Non-Polio Acute Flaccid Paralysis] incidence. In 2004, 12,000 cases of NPAFP were reported in the country, increasing dramatically to 25,000 in 2005, 40,000 in 2007, and 61,000 in 2011.\n\nOne of the “contaminants”, or bio-weapons, contained in the polio vaccine was the SV-40 virus administered to 98 million unsuspecting Americans. SV-40 has been identified as a Cancer-causing viral agent. This same Sv-40 virus is still being used today in the third world by the Gates Foundation and others. The broader vaccine campaign gained a huge head of steam in 1986 when Congress passed the National Childhood Vaccine Injury Act which limited big pharma’s liability from injury and death resulting from their toxin-laden injections.\n\nA recent WHO vaccine campaign in Kenya is not about eradicating neonatal tetanus but a well-coordinated forceful population control mass pharmaceutical sterilization program using a proven fertility regulating vaccine. Kenya’s Catholic bishops are charging two United Nations organizations with sterilizing millions of girls and women under cover of an anti-tetanus inoculation program sponsored by the Kenyan government. According to a statement released by the Kenya Catholic Doctors Association, the organization has found an antigen that causes miscarriages in a vaccine being administered to 2.3 million girls and women by the World Health Organization and UNICEF. Priests throughout Kenya are advising their congregations to refuse the vaccine.\n\nHIV continues to be a major global public health issue. In 2015, an estimated 36.7 million people were living with HIV (including 1.8 million children) – a global HIV prevalence of 0.8%. The vast majority of this number live in low-income countries. In the same year, 1.1 million people died of AIDS-related illnesses. Since the start of the epidemic, an estimated 78 million people have become infected with HIV and 35 million people have died of AIDS-related illnesses. An estimated 25.5 million people living with HIV live in sub-Saharan Africa. An estimated 19 million live in east and southern Africa which saw 46% of new HIV infections globally in 2015. Around 40% of all people living with HIV do not know that they have the virus.\n\nWhat is not known is that Big Pharma and WHO, the World Health Organization, are behind the attempted pharmacological genocide of Africans and other populations WHO deems as “undesirable.” The bovine leukemia virus (BLV) is lethal to cows, but not humans, just as the sheep visna virus (SVV). These deadly viruses are “retro viruses” meaning that they can change the genetic composition of cells that they enter. The World Health Organization, in published articles, called for scientists to work with these deadly agents and attempt to make a hybrid virus that would be deadly to humans:\n\n“An attempt should be made to see if viruses can, in fact, exert selective effects on immune function. The possibility should be looked into that the immune response to the virus itself may be impaired if the infecting virus damages, more or less selectively, the cell responding to the virus.”\n\nThe above quote is a description of the AIDS virus called for by the World Health Organization in the 70’s. What the WHO is saying in plain English is, “Let’s cook up a virus that selectively destroys the T-cell system of man, creating an acquired immune deficiency.”\n\nWhy would anyone want to do this? If you destroy the T-cell system of a human, you destroy the person. Is it possible that the objective of the World Health Organization is to develop a virus that would wipe out humans?\n\n \n\n But what about the green monkey theory? Some of the best virologist in the world and many of those directly involved in AIDS research, such as Robert Gallo and Luc Montagnier, have said that the green monkey may be the culprit. You know the story: A green monkey bit a native on the ass and, immediately AIDS was spread all over central Africa. Gallo, Montagnier and these other virologists know that the AIDS virus doesn’t occur naturally in monkeys. In fact, it doesn’t occur naturally in any animal. Examination of the gene structure of green monkey cells proves that it is not genetically possible to transfer the AIDS virus from monkeys to man by natural means.\n\nDr. Theodore Strecker’s research of the literature indicates that the National Cancer Institute in collaboration with the World Health Organization made the AIDS virus in their laboratories at Fort Detrick (now NCI). Fort Detrick, Maryland, is the United States Army’s germ warfare unit euphemistically called the Army Infectious Disease Unit. They combined the deadly retroviruses, bovine leukemia virus and sheep visna virus, and injected them into human tissue cultures. The result was the AIDS virus, the first human retrovirus known to man.\n\nThe creation of the AIDS virus by the WHO was not just a diabolical scientific exercise that got out of hand, it was a successful attempt to create a killer virus which was then used in a successful experiment in Africa. It was so successful that most of central Africans are infected.\n\nIn the Federation Proceedings of the United States in 1972, WHO suggested that experiments be conducted to find the best way to put their new killer virus (AIDS) into a vaccination program and then observe the results. “This would be particularly informative in sibships,” they said. In that way, they could give the AIDS virus to brothers and sisters and see if they die, who dies first, and of what, just like using rats in a laboratory. They used the smallpox vaccine for their vehicle and the geographical sites chosen in 1972 were Uganda and other African states, Haiti, Brazil and Japan. The present and past epidemiology of AIDS coincides with these geographical areas.\n\nWhy did the “experts” keep talking about green monkeys and homosexuals being the culprits when it was obvious that the AIDS virus was a man-made virus?\n\nWhy did they say that it was a homosexual and drug-user disease when in Africa it was obviously a heterosexual disease?\n\nIf the green monkey did it, then why did AIDS explode practically simultaneously in Africa, Haiti, Brazil, the United States and southern Japan?\n\nWhy, when it was proposed to the National Institute of Health that the AIDS virus was a combination of two bovine or sheep viruses cultured in human cells in a laboratory, did they say it was “bad science” when that’s exactly what occurred?\n\nAs early as 1970 the World Health Organization was growing these deadly animal viruses in human tissue cultures. Cedric Mims, in 1981, said in a published article that there was a bovine virus contaminating the culture media of the WHO. Was this an accident or a non-accident? If it was an accident, why did WHO continue to use the vaccine?\n\nThis viral and genetic death bomb, AIDS, was finally produced in 1974. It was given to monkeys and they died of pneumocystis carni which is typical of AIDS.\n\nThere are precedents for such heinous acts. This is not the first time the virologist have brought us disaster. SV-40 virus from monkey cell cultures contaminated polio cultures. Most people in their 40’s are now carrying this virus through contaminated polio inoculations given in the early 60’s. It is known to cause brain cancer. SV-40 was the origin of the green monkey theory. The polio vaccine was grown on green monkey kidney cells. Sixty-four million Americans were vaccinated with SV-40-contaminated vaccine in the 60’s. An increase in cancer of the brain, possibly multiple sclerosis, and other brain disorders are the tragic results.\n\nThe AIDS virus didn’t exist in the United States before 1978. You can check back in any hospital and no stored blood samples can be found anywhere that exhibit the AIDS virus before that date. Ultimately it was found that the introduction of the hepatitis B vaccine exhibits the exact epidemiology of AIDS and it spread AIDS throughout homosexual communities.\n\nA Doctor W. Szmuness set up the rules for the hepatitis vaccine studies in the 70’s. Only males between the ages of 20 and 40, who were not monogamous, would be allowed to participate in this study. The Centers for Disease Control reported in 1981 that 4% of those receiving the hepatitis-vaccine were AIDS-infected. In 1984 they admitted to 60%. Now they admit that near 100 % of hepatitis vaccine receivers are infected with AIDS.\n\n The London Times should be congratulated for uncovering the smallpox-AIDS connection. But their expose was very misleading. The article states that the African AIDS epidemic was caused by the smallpox vaccine “triggering” AIDS in those vaccinated. There is absolutely no scientific evidence that this laboratory-engineered virus was present in Africa before the World Health Organization descended upon these innocent people in 1967 with their deadly AIDS-laced vaccine.\n\nIn 2012, Dr Robert Gallo admitted that he created the AIDS virus at Fort Detrick, Maryland, as a biological weapon to depopulate humanity. The London Times reported on its front page, May 11, 1987, that the World Health Organization (WHO) had “triggered” the AIDS epidemic in Africa through the WHO smallpox immunization program. The only people in the free world not surprised by the London Times front page expose were the American scientists and eugenists, who created the virus.\n\nThe Battle for Your Bloodstream\n\nWe have seen in this article that Big Pharma is in bed with politicians, corporations, and the government and seem to currently have the upper hand in the raging battle for your bloodstream.\n\nThe goal of the “illness industry” has been painted in livid colors to show that ruthless Pharma-Warlords will not stop deliberately killing the people they inoculate with deadly vaccines. Big Pharma wants to create and own all pharmaceutical drugs and foods that have been weaponized to create eugenic sterilization in a global United Nation’s program of depopulation. Even the creation of AIDS is another depopulation program supported by Big Pharma and the Big Philanthropists like Gates and Rockefeller.\n\nThe “elite” do not eat GMOs or get vaccines, especially to their offspring. The grand plan is simple and plain for the elites — “billions of people need to die so there are resources enough for us.”\n\nIf people don’t awaken and stand against the tide of Big Pharma right now, there will be many fewer of us to stand against them later. Your bloodstream is sacred and is your private domain where poisonous chemicals are not welcome and should not be allowed. Resist the attacks of modern medicine so that you might avoid iatrogenic adverse effects that might lead to sterilization, death, or even worse.\n\nEnd all mandatory vaccinations in America and settle all pending claims of damages from vaccines.\n\nCall a Moratorium on all American vaccines and study the full documentation of side effects and the unsafe nature of the contents.\n\nInvestigate the CDC and its patents on vaccines and convict those involved with collusion with drug companies.\n\nHold drug companies responsible for all injuries and deaths from their drug’s side-effects.\n\nBan all Monsanto products permanently and hold the company responsible for knowingly creating products that harm human beings.\n\nDismantle the “medical industry” and “Big Pharma”, creating a new “health industry” instead of an “illness industry.”\n\nInvestigate all drug companies for price fixing, overpricing, and manipulation of market prices.\n\nRescind Obama’s executive orders concerning United Nations resolutions concerning health, vaccines, and fertility programs.\n\nDismantle the Food and Drug Administration and end all pharmaceutical lobbying and direct marketing.", "opengraph": {"type": "article", "title": "PHARMAGEDDON", "url": "https://aim4truth.org/2017/03/26/5663/", "description": "Every day, people in the United States are being injured and killed by vaccines, and those numbers are increasing. This is a fact that is not in dispute, as the Department of Justice quarterly repo…", "article:published_time": "2017-03-26T15:49:25+00:00", "article:modified_time": "2017-03-29T13:50:52+00:00", "site_name": "American Intelligence Media", "image": "https://i0.wp.com/aim4truth.org/wp-content/uploads/2017/03/pharma-does-not-create-cures.jpg?fit=480%2C320&ssl=1", "image:width": "480", "image:height": "320", "locale": "en_US"}, "tags": ["the Department of Justice quarterly report on vaccine injuries and deaths clearly demonstrates."], "tweets": [], "movies": [], "links": ["http://who.int/influenza_vaccines_plan/resources/session_10_kaddar.pdf", "http://phrma-docs.phrma.org/sites/default/files/pdf/Vaccines_2013.pdf", "https://www.google.com/patents/US6169175?dq=vaccine+inassignee:centers+inassignee:for+inassignee:disease+inassignee:control&hl=en&sa=X&ved=0ahUKEwienfmNxMfRAhVRgSYKHRVkCGQQ6AEIYjAK", "https://www.google.com/patents/US8357525?dq=vaccine+inassignee:centers+inassignee:for+inassignee:disease+inassignee:control&hl=en&sa=X&ved=0ahUKEwienfmNxMfRAhVRgSYKHRVkCGQQ6AEIWzAJ", "https://www.google.com/patents/US7223535?dq=vaccine+inassignee:centers+inassignee:for+inassignee:disease+inassignee:control&hl=en&sa=X&ved=0ahUKEwienfmNxMfRAhVRgSYKHRVkCGQQ6AEIlgMwNg", "https://www.google.com/patents/US8592146?dq=vaccine+inassignee:centers+inassignee:for+inassignee:disease+inassignee:control&hl=en&sa=X&ved=0ahUKEwienfmNxMfRAhVRgSYKHRVkCGQQ6AEI3gIwLg", "https://www.google.com/patents/US9102742?dq=vaccine+inassignee:centers+inassignee:for+inassignee:disease+inassignee:control&hl=en&sa=X&ved=0ahUKEwienfmNxMfRAhVRgSYKHRVkCGQQ6AEIkwEwEQ", "https://www.google.com/patents/US9248179?dq=vaccine+inassignee:centers+inassignee:for+inassignee:disease+inassignee:control&hl=en&sa=X&ved=0ahUKEwienfmNxMfRAhVRgSYKHRVkCGQQ6AEIMTAD", "https://www.google.com/patents/CA2611954C?cl=en&dq=vaccine+inassignee:centers+inassignee:for+inassignee:disease+inassignee:control&hl=en&sa=X&ved=0ahUKEwigk86MvcfRAhWIPiYKHSlyA8oQ6AEIcDAM", "https://www.google.com/patents/US8715689?dq=vaccine+inassignee:centers+inassignee:for+inassignee:disease+inassignee:control&hl=en&sa=X&ved=0ahUKEwienfmNxMfRAhVRgSYKHRVkCGQQ6AEIigIwIg", "https://www.google.com/patents/US8637050?dq=vaccine+inassignee:centers+inassignee:for+inassignee:disease+inassignee:control&hl=en&sa=X&ved=0ahUKEwigk86MvcfRAhWIPiYKHSlyA8oQ6AEIHDAA", "https://www.google.com/patents/CA2319404C?cl=en&dq=vaccine+inassignee:centers+inassignee:for+inassignee:disease+inassignee:control&hl=en&sa=X&ved=0ahUKEwienfmNxMfRAhVRgSYKHRVkCGQQ6AEImgEwEg", "https://www.google.com/patents/US6472518?dq=vaccine+inassignee:centers+inassignee:for+inassignee:disease+inassignee:control&hl=en&sa=X&ved=0ahUKEwienfmNxMfRAhVRgSYKHRVkCGQQ6AEIpAMwOA", "https://www.google.com/patents/US8846056?dq=vaccine+inassignee:centers+inassignee:for+inassignee:disease+inassignee:control&hl=en&sa=X&ved=0ahUKEwigk86MvcfRAhWIPiYKHSlyA8oQ6AEIKjAC", "https://www.google.com/patents/US8426574?dq=vaccine+inassignee:centers+inassignee:for+inassignee:disease+inassignee:control&hl=en&sa=X&ved=0ahUKEwigk86MvcfRAhWIPiYKHSlyA8oQ6AEI-gIwMg", "https://www.google.com/patents/US8221768?dq=vaccine+inassignee:centers+inassignee:for+inassignee:disease+inassignee:control&hl=en&sa=X&ved=0ahUKEwienfmNxMfRAhVRgSYKHRVkCGQQ6AEIvQEwFw", "https://www.google.com/patents/US7220852?dq=vaccine+inassignee:centers+inassignee:for+inassignee:disease+inassignee:control&hl=en&sa=X&ved=0ahUKEwienfmNxMfRAhVRgSYKHRVkCGQQ6AEIuQMwOw", "https://www.google.com/patents/US8673629?dq=vaccine+inassignee:centers+inassignee:for+inassignee:disease+inassignee:control&hl=en&sa=X&ved=0ahUKEwienfmNxMfRAhVRgSYKHRVkCGQQ6AEIdzAN", "https://www.google.com/patents/US7223836?dq=vaccine+inassignee:centers+inassignee:for+inassignee:disease+inassignee:control&hl=en&sa=X&ved=0ahUKEwigk86MvcfRAhWIPiYKHSlyA8oQ6AEIODAE", "https://www.google.com/patents/US7417136?dq=vaccine+inassignee:centers+inassignee:for+inassignee:disease+inassignee:control&hl=en&sa=X&ved=0ahUKEwienfmNxMfRAhVRgSYKHRVkCGQQ6AEIPzAF", "https://www.google.com/patents/US8986933?dq=vaccine+inassignee:centers+inassignee:for+inassignee:disease+inassignee:control&hl=en&sa=X&ved=0ahUKEwienfmNxMfRAhVRgSYKHRVkCGQQ6AEIuwIwKQ", "https://www.google.com/patents/US8354115?dq=vaccine+inassignee:centers+inassignee:for+inassignee:disease+inassignee:control&hl=en&sa=X&ved=0ahUKEwienfmNxMfRAhVRgSYKHRVkCGQQ6AEI_AEwIA", "https://www.google.com/patents/US7959929?dq=vaccine+inassignee:centers+inassignee:for+inassignee:disease+inassignee:control&hl=en&sa=X&ved=0ahUKEwienfmNxMfRAhVRgSYKHRVkCGQQ6AEI5QIwLw", "https://www.drugwatch.com/2012/01/18/direct-to-consumer-marketing/", "http://www.thehealthyhomeeconomist.com/six-reasons-to-say-no-to-vaccination/", "http://www.rescuepost.com/files/gr-autism_and_vaccines_world_special_report1.pdf", "https://vaccineimpact.com/tag/doj-report/", "http://www.uscfc.uscourts.gov/omnibus-autism-proceeding", "http://www.supremecourt.gov/opinions/10pdf/09-152.pdf", "http://www.hhs.gov/nvpo/national_adult_immunization_plan_draft.pdf", "https://www.drugwatch.com/depuy-hip/lawsuit.php", "https://www.drugwatch.com/xarelto/lawsuit/", "https://www.drugwatch.com/avandia/lawsuit.php", "https://www.drugwatch.com/2012/07/03/glaxosmithkline-pays-3-billion-for-illegal-drug-marketing/", "https://www.drugwatch.com/yaz/lawsuit.php", "https://www.drugwatch.com/xarelto/internal-bleeding/", "https://www.drugwatch.com/prozac/lawsuit.php", "https://www.drugwatch.com/eliquis/lawsuits/", "https://www.drugwatch.com/pradaxa/bleeding/", "https://www.drugwatch.com/stryker/lawsuit-hip-replacement/", "https://www.drugwatch.com/knee-replacement/", "https://www.drugwatch.com/2014/11/21/boston-scientific-mesh-verdict-18-million/", "https://www.drugwatch.com/2015/09/14/nbc-investigates-ivc-filter-controversy/", "http://www.seattleorganicrestaurants.com/vegan-whole-food/political-corruption-Monsanto.php", "http://www.seattleorganicrestaurants.com/vegan-whole-food/Monsanto-protection-act.php", "http://www.seattleorganicrestaurants.com/vegan-whole-food/Monsanto-corruption-gmo.php#AgentOrange", "http://www.seattleorganicrestaurants.com/vegan-whole-foods/fact-checking-gmo-foods/#GMO-crisis-India", "http://www.seattleorganicrestaurants.com/vegan-whole-foods/dark-history-monsanto/", "http://www.seattleorganicrestaurants.com/vegan-whole-foods/fact-checking-gmo-foods/#FDA", "http://seattleorganicrestaurants.com/vegan-whole-foods/gmo-labeling-washington/", "http://www.seattleorganicrestaurants.com/vegan-whole-food/Monsanto-corruption-gmo.php", "http://www.seattleorganicrestaurants.com/vegan-whole-food/usda-approves-second-generation-of-GMOs-resistant-to-toxic-herbicide-isoxaflutole-IFT.php", "http://seattleorganicrestaurants.com/vegan-whole-foods/top-20-genetically-modified-foods/#alfalfa", "http://seattleorganicrestaurants.com/vegan-whole-foods/top-20-genetically-modified-foods/#sugar-beets", "http://www.seattleorganicrestaurants.com/vegan-whole-food/GMO-health-risks.php", "http://educate-yourself.org/nwo/nwopopcontrol.shtml", "http://www.oldthinkernews.com/2010/09/vaccinate-the-world-gates-rockefeller-seek-global-population-reduction/", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC1448560/", "http://www.wnd.com/2009/05/99105/", "http://www.pop.org/content/bad-blood-in-the-philippines-1200", "http://www.whale.to/vaccine/miscarriage_vax_h.html", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC1537571/pdf/clinexpimmunol00215-0170.pdf", "http://www.rockefellerfoundation.org/uploads/files/aa052a3a-32f9-4c1d-9a50-a42252b0cb23-1985.pdf", "http://www.rockefellerfoundation.org/uploads/files/b9b03b28-ccd3-47d4-9ad7-6fb75a86c30f-1986.pdf", "http://www.rockefellerfoundation.org/uploads/files/80610f05-587b-4c14-8b96-fc50c2950edc-1988.pdf", "http://www.rockefellerfoundation.org/uploads/files/31c877bb-c6be-4416-820c-0f39e26b893b-1994.pdf", "http://www.hangthebankers.com/why-is-bill-gates-investing-in-monsanto-and-gmos/", "http://healthimpactnews.com/2013/pediatrician-predicts-bill-gates-and-the-who-will-kill-3125-babies-with-their-5-in-1-vaccine/", "https://www.lifesitenews.com/news/a-mass-sterilization-exercise-kenyan-doctors-find-anti-fertility-agent-in-u", "http://medical-dictionary.thefreedictionary.com/sibship", "https://www.bibliotecapleyades.net/salud/salud_vacunas.htm", "https://www.bibliotecapleyades.net/salud/salud_vacunas.htm"], "authors": [], "publish_date": "2017-03-26T15:49:25+00:00"}