{"result_id": "024024", "URL": "https://aim4truth.org/2021/03/05/cat-report-691/", "timestamp": "2023-04-25 12:01:57 CEST+0200", "meta": {"description": "GOING VIRAL IN AFRICA: Zambian Leader Dr. Mumba Refuses COVID Drugs After Discovering Bottles Marked “Not for Use in EU or USA” (VIDEO) CHD’s New ‘Medical Racism’ Film Exposes Long-Standing Experimentation on Minorities IG Farben – ICI – AstraZenaca Gear Up for Mass Global Vaccination Extermination Report: President Trump Positioning Resources and Strategy to Destroy…", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/aim4truth.org/wp-content/uploads/2017/02/cropped-aim-4-truth-png.png?fit=32%2C32&ssl=1", "canonical": "https://aim4truth.org/2021/03/05/cat-report-691/", "encoding": "UTF-8"}, "image": null, "domain": "aim4truth.org", "title": "Learn about Zombie Preparedness and the Moderna Vaccine have in common", "cleaned_text": "Learn about Zombie Preparedness and the Moderna Vaccine have in common\n\nVIDEO Learn about Zombie Preparedness and the Moderna Vaccine have in common\n\nGOING VIRAL IN AFRICA: Zambian Leader Dr. Mumba Refuses COVID Drugs After Discovering Bottles Marked “Not for Use in EU or USA” (VIDEO)\n\nThe next to last paragraph in the article is the big reveal as to what the intended effects are for declaring these fake scamdemics:\n\nIn a September speech WHO Director-General Chan said “ministers of health” should take advantage of the “devastating impact” swine flu will have on poorer nations to get out the message that “changes in the functioning of the global economy” are needed to “distribute wealth on the basis of” values “like community, solidarity, equity and social justice.” She further declared it should be used as a weapon against “international policies and systems that govern financial markets, economies, commerce, trade and foreign affairs.”\n\nStatement by Donald J. Trump, 45th President of the United States of America\n\nOur border is now totally out of control thanks to the disastrous leadership of Joe Biden. Our great Border Patrol and ICE agents have been disrespected, demeaned, and mocked by the Biden Administration. A mass incursion into the country by people who should not be here is happening on an hourly basis, getting worse by the minute. Many have criminal records, and many others have and are spreading covid. Interior enforcement has been shut down—criminals that were once promptly removed by our Administration are now being released back onto the street to commit heinous and violent crimes. ICE officers are desperate to remove these convicted criminals, but Biden won’t let them. Continue reading…..\n\nAccording to the article insiders, a second way President Trump will target the financial aspects will be to restrict the republican party from using his name in any manner except that expressly approved by him:\n\n[…] “Trump and his new campaign team are also cracking down on the use of the president’s name for fundraising — a huge draw attracting small-dollar donors. Three sources told us that Trump, who made his fortune licensing his name, has felt burned and “abused” by the GOP bandying about his name to haul in money.” … “One Trump adviser said they’ve been sending out cease-and-desists to faux PACs using Trump’s name to fundraise, among other demands to knock it off. (link)\n\nPublic Schools Refusing To Open Should Give Taxpayers Their Money Back\n\nUPDATE: Four Months After the 2020 Election in Georgia, Over 400,000 Absentee Ballots are Missing Legally Required Chain of Custody Documentation, Yet Biden Was Given the State by 12,000 Votes Read all about it.\n\nWe are going to have a hard time defeating this evil head-on so we need to be like this magnificent bird of prey and scoop in by surprise. By removing physical silver and gold from the retail market, we destroy the payment mechanism they need for operation (the petrodollar). It’s like how they take us out by denying access to PayPal, Patreon, or bank credit cards. They remove our ability to conduct financial transactions.\n\nBy collapsing the Rothschild debt slavery system, we do the same to them, but on a much grander scale. First, take care of your own family and fortune…then tell others in your downline about #SilverSqueeze. Our mission is to legally remove every piece of precious metals from the retail market while protecting our personal wealth from hyperinflation, stock market crash, and the Great Reset.\n\nJohn Money, David Reimer, and the Dark Origins of the Transgender Movement", "opengraph": {"type": "article", "title": "Learn about Zombie Preparedness and the Moderna Vaccine have in common", "url": "https://aim4truth.org/2021/03/05/cat-report-691/", "description": "GOING VIRAL IN AFRICA: Zambian Leader Dr. Mumba Refuses COVID Drugs After Discovering Bottles Marked “Not for Use in EU or USA” (VIDEO) CHD’s New ‘Medical Racism’ Film Exposes Long-Standing Experim…", "article:published_time": "2021-03-06T01:28:27+00:00", "article:modified_time": "2021-03-22T20:51:29+00:00", "site_name": "American Intelligence Media", "image": "https://aim4truth.org/wp-content/uploads/2021/03/central-banks-silver-squeeze-2.jpg", "image:width": "520", "image:height": "586", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "980", "height": "552", "embed_code": "<iframe loading=\"lazy\" class=\"youtube-player\" width=\"980\" height=\"552\" src=\"https://www.youtube.com/embed/lt7Iab0DNWw?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/lt7Iab0DNWw?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}], "links": ["https://app.clouthub.com/post/2321e6d1-7777-11eb-a34b-effabf21f41f", "https://www.cdc.gov/cpr/zombie/index.htm", "https://www.thegatewaypundit.com/2021/03/going-viral-africa-zambian-leader-dr-mumba-refuses-covid-vaccine-discovering-vaccine-bottles-marked-not-use-eu-usa/", "https://aim4truth.org/2020/06/16/cat-report-437/", "https://childrenshealthdefense.org/defender/medical-racism-film-exposes-experimentation-minorities/", "https://twitter.com/dockaurG/status/1316018426070986755", "https://archive.is/NzH6X", "https://archive.vn/ck4Yp", "https://gab.com/realdonaldtrump/posts/105838728117189357", "https://gab.com/realdonaldtrump/posts/105838728117189357", "https://theconservativetreehouse.com/2021/03/05/report-president-trump-positioning-resources-and-strategy-to-destroy-decepticons/#more-208790", "https://www.politico.com/newsletters/playbook/2021/03/05/mccarthy-struggles-to-manage-trump-492003", "https://www.politico.com/newsletters/playbook/2021/03/05/mccarthy-struggles-to-manage-trump-492003", "https://www.breitbart.com/politics/2021/03/05/eric-swalwell-sues-donald-trump-and-allies-over-capital-riots/", "https://www.zerohedge.com/political/john-mcafee-indicted-over-alleged-cryptocurrency-fraud", "https://www.zerohedge.com/political/public-schools-refusing-open-should-give-taxpayers-their-money-back", "https://www.thegatewaypundit.com/2021/03/four-months-2020-election-georgia-400000-absentee-ballots-missing-legally-required-chain-custody-documentation-yet-biden-given-state-12000-votes/", "https://www.intellectualtakeout.org/article/john-money-david-reimer-and-dark-origins-transgender-movement/", "https://youtu.be/lt7Iab0DNWw", "https://gab.com/Gabriels_Horn"], "authors": [], "publish_date": "2021-03-06T01:28:27+00:00"}