{"result_id": "025025", "URL": "https://amg-news.com/the-end-of-all-freedom-a-central-bank-digital-currency-creates-unprecedented-possibilities-for-tyranny/", "timestamp": "2023-04-25 12:03:02 CEST+0200", "meta": {"description": "The End of All Freedom | A Central Bank Digital Currency Creates Unprecedented Possibilities for Tyranny", "lang": "en", "keywords": "", "favicon": "https://amg-news.com/wp-content/uploads/2021/09/cropped-AMG-mic-32x32.jpg", "canonical": "https://amg-news.com/the-end-of-all-freedom-a-central-bank-digital-currency-creates-unprecedented-possibilities-for-tyranny/", "encoding": "UTF-8"}, "image": null, "domain": "amg-news.com", "title": "The End of All Freedom | A Central Bank Digital Currency Creates Unprecedented Possibilities for Tyranny", "cleaned_text": "The End of All Freedom | A Central Bank Digital Currency Creates Unprecedented Possibilities for Tyranny\n\nMedeea Greere, an independent publisher, is now on Telegram at https://t.me/AMGNEWS2022 and exists only on reader support as we publish Truth, Freedom and Love for public awareness. Thank You for your support!\n\nThe central banks are preparing to replace all cash money with a digital currency, the CBDC (Central Bank Digital Currency). This will give them full control over humanity, as they can then monitor every transaction, limit what you can spend, and even delete your funds at will. It is promoted as something that will make our lives easier. The truth is that it would mean total tyranny for all of humanity. Our digital funds would be connected to our digital ID, which will be connected to our vaccine status and social credit scores.\n\nImagine no longer being able to access your funds – when your digital ID shows that you haven’t received your umpteenth vaccine booster. Or envision how your spending would be limited as the result of posting something on Facebook that the government doesn’t like.\n\nOr worse: what if governments simply erase your bank account because you don’t agree with their policies?\n\nThis has been happening already with services like PayPal, which closed thousands of accounts because people engaged in activities that oppose tyranny. JP Morgan Chase and Wells Fargo have frozen the bank accounts of people who participated in events that defend basic human rights. In Canada, America, The Netherlands, India, China and other nations, countless people have experienced this.\n\nOnce a digital currency replaces all physical money, financial tyranny would become mainstream, as it is the perfect tool to keep the public in check.\n\nSimilar to what we are seeing on Facebook and YouTube: when you post something that exposes the agenda of the criminal elites, either the post is removed, you are blocked, or worse: your entire account is deleted because “it violates community standards”.\n\nDo you think this will stay limited to social media? Once they have full control over your finances, you can bet they will steal money from people at will, just because someone “violates community guidelines”.\n\nIt happens all the time in China, and as we know from the documents published by the Rockefeller Foundation and World Economic Forum, China is their perfect example. The European Union, another example, is going all out on the transfer to a digital currency.\n• None GESARA NESARA QFS Global Financial Reset – Everything is Changing – Trust The Plan! (video)\n• None QFS: THE NEW FINANCIAL SYSTEM – Step Out of The Matrix and Into The Golden Age!\n• None GCR – GESARA – QFS Intel ☆ No More Corrupt System ~ Trust The Plan!\n\n\n\nThere is nothing national governments can do to stop it, since they have been so stupid as to surrender their currency into the hands of the European Union.\n\nSigrid Kaag, the leader of the Dutch Democrat Party D66, who works closely with the World Economic Forum, is pushing a system that would alert the government when anyone spends more than 100 euros.\n\nKaag was positioned by blatant election fraud, which you can see in this Dutch report. This is how the WEF gains control over the nations: by rigging elections and positioning their mind-controlled Young Global Leaders, who force the agenda of the tyrants.\n\nThe plan to install a digital currency controlled by the Central Banks has been prepared for decades. The strategy has been to launch this right after the first pandemic, as one of their “solutions” for “global threats”. And here we are.\n\nThe Biden administration is also tracking the bank accounts of the American people, and the IRS is notified whenever anyone spends more than 600 USD.\n\nA digital currency would unleash tyranny onto humanity, the likes of which this world has never seen before. It would also prevent the masses from discovering the truth, as people could be punished with their finances, when they look into the truth.\n\nIf the digital currency becomes an international reality, there will be full and undisputed control of the world population in the hands of a handful of controllers of this financial system.\n\nIt is critical that we rise up against this. They count on us doing nothing. Grumbling and moaning doesn’t stop anything – we must become heroes who take powerful action. Let’s surprise them by exposing this worldwide. It is imperative that we share this truth by all means possible. Let’s forget our differences and join in the common fight against this nefarious agenda.\n\nIs there any hope to escape this nightmare? I am talking to several people who are building alternative financial systems. More about this later.\n\nTRENDING: PREMIUM Gold Smart Trump Card. This is NOT just another no-use, memorabilia card! This is a Unique, Exclusive, Functional, SMART card that has great benefits. Premium Packaging – Every Card has it’s own box to keep it safe!\n\nVoter Fraud Election Sting Containing QFS Blockchain Watermark Is More Than Meets The Eye! Trump’s Plan For The “Reset” Deployed To Expose Voter Fraud\n\nQuantum Financial System (QFS) is building a Virtual Private Network (VPN) for the Cross-Border Interbank Payment System (CIPS). It’s a network based on Sovereignty and Commerce.\n\nThe Trump Administration was committed to the Quantum financial System, and to unleashing its incredible potential for U.S. economic growth, technological advancement, and national security.\n\nTo coordinate a national research effort encompassing Federal agencies the academic community, and industry leaders already underway, The White House National Quantum Coordination Office has released A Strategic Vision for America’s Quantum Financial System Networks. February 2020\n\nQuantum Financial System (QFS) provides pristine clean integrity in the movement of funds from Central Banking sources to destination accounts.\n\nThe QFS will cover the new global network for the transfer of asset backed funds and can replace the US- Centrally Controlled SWIFT System.", "opengraph": {"locale": "en_US", "type": "article", "title": "The End of All Freedom | A Central Bank Digital Currency Creates Unprecedented Possibilities for Tyranny - American Media Group", "description": "The End of All Freedom | A Central Bank Digital Currency Creates Unprecedented Possibilities for Tyranny", "url": "https://amg-news.com/the-end-of-all-freedom-a-central-bank-digital-currency-creates-unprecedented-possibilities-for-tyranny/", "site_name": "American Media Group", "article:author": "https://www.facebook.com/medeea23greere", "article:published_time": "2023-04-10T15:30:46+00:00", "article:modified_time": "2023-04-10T16:02:18+00:00", "image": "https://amg-news.com/wp-content/uploads/2023/02/US-Federal-Reserve-Releases-Discussion-Paper-on-Central-Bank-Digital-Currency.png", "image:width": "1136", "image:height": "629", "image:type": "image/png"}, "tags": ["Deep State", "Central Bank Digital Currency", "QSF", "CBDC", "NESARA", "GESARA"], "tweets": [], "movies": [], "links": ["https://t.me/AMGNEWS2022", "https://0879fafyl0cnin8g57h8vyeyav.hop.clickbank.net/?tid=AMG1004QFS", "https://amg-news.com/gesara-nesara-qfs-global-financial-reset-everything-is-changing-trust-the-plan-video/", "https://amg-news.com/qfs-the-new-financial-system-step-out-of-the-matrix-and-into-the-golden-age/", "https://amg-news.com/gcr-gesara-qfs-intel-%e2%98%86-no-more-corrupt-system-trust-the-plan/", "https://f03d58o3r1mujo9mg1-l3drq1r.hop.clickbank.net/?tid=AMG1004QFS", "https://amg-news.com/category/qfs/", "https://18460er1jzow4wb8yjo0djdwdh.hop.clickbank.net/?tid=AMG1004QFS", "https://amg-news.com/voter-fraud-election-sting-containing-qfs-blockchain-watermark-is-more-than-meets-the-eye-trumps-plan-for-the-reset-deployed-to-expose-voter-fraud/", "https://t.me/AMGNEWS2022", "https://t.me/AMGNEWS2022"], "authors": ["Medeea Greere"], "publish_date": "2023-04-10T15:30:46+00:00"}