{"result_id": "025011", "URL": "https://amg-news.com/pentagon-cancels-vaccine-mandates/", "timestamp": "2023-04-25 12:02:42 CEST+0200", "meta": {"description": "Pentagon CANCELS Vaccine Mandates", "lang": "en", "keywords": "", "favicon": "https://amg-news.com/wp-content/uploads/2021/09/cropped-AMG-mic-32x32.jpg", "canonical": "https://amg-news.com/pentagon-cancels-vaccine-mandates/", "encoding": "UTF-8"}, "image": null, "domain": "amg-news.com", "title": "Pentagon CANCELS Vaccine Mandates", "cleaned_text": "The Pentagon on Tuesday formally rescinded its COVID-19 vaccination mandate, dropping the shot’s requirement across the U.S. military over a year after it was first put in place, according to a new memo signed by Defense Secretary Lloyd Austin.\n\nThe memo was expected after the annual defense policy bill, signed into law by President Biden on Dec. 23, gave the Defense Department 30 days to pull the mandate.\n\nEven with the requirement gone, however, the Defense Department “will continue to promote and encourage COVID-19 vaccination for all service members,” Austin said in the memo. “Vaccination enhances operational readiness and protects the force.”\n\nAustin on Aug. 24, 2021, first issued a mandate requiring coronavirus vaccinations for all service members — including those in the National Guard and Reserve — with those who did not comply facing various levels of punishment. Those included loss of days individuals accrued toward retirement, loss of pay or even dismissal from the ranks in a move known as involuntary separation.\n\nBut the rule received heavy pushback from Republican lawmakers and was the subject of several lawsuits. It was eventually dismantled after a rescission requirement was included in the fiscal 2023 National Defense Authorization Act — a major concession by Democrats to help pass the sweeping legislation before the end of 2022.\n\nAhead of the memo’s release, the U.S. military had stopped all related punishments for refusing the shot, including discharging troops from the service.\n\nIn the document, Austin still argued that the vaccine mandate is meant to ensure force readiness and is critical to the health and safety of the force, giving commanders the reins in deciding whether or not to deploy troops who are not vaccinated.\n\n“All commanders have the responsibility and authority to preserve the Department’s compelling interests in mission accomplishment,” he wrote.\n\nLeaders are also able “to consider, as appropriate, the individual immunization status of personnel in making deployment, assignment, and other operational decisions, including when vaccination is required from travel to, or entry into, a foreign nation,” Austin added.\n\nAs for the thousands of active-duty service members who were discharged for refusing the shots, they will not be reinstated.\n\nDisclaimer: The views expressed in this article may not represent the official views of Medeea Greere or the American Media Group. Stories filed under Opinion contain information from various sources that may be both, verified and unverified. Medeea Greere and the American Media Group do not make any claims as to the validity of the information expressed in the opinion section, however we do encourage the reader to do further research on their own and we hope that you will share your findings with us. The mission for the truth requires a collective effort.", "opengraph": {"locale": "en_US", "type": "article", "title": "Pentagon CANCELS Vaccine Mandates - American Media Group", "description": "Pentagon CANCELS Vaccine Mandates", "url": "https://amg-news.com/pentagon-cancels-vaccine-mandates/", "site_name": "American Media Group", "article:author": "https://www.facebook.com/medeea23greere", "article:published_time": "2023-01-11T12:07:46+00:00", "article:modified_time": "2023-01-11T12:09:24+00:00", "image": "https://amg-news.com/wp-content/uploads/2023/01/Pentagon_large.jpg", "image:width": "1140", "image:height": "760", "image:type": "image/jpeg"}, "tags": ["Pentagon", "COVID-19"], "tweets": [], "movies": [], "links": ["https://amg-news.com/urgent-supreme-court-has-canceled-universal-vaccination-in-the-united-states/", "https://8821d6s1g7ithn33s82rpfnneq.hop.clickbank.net/?tid=AMG1101pentag", "https://t.me/AMGNEWS2022", "https://t.me/AMGNEWS2022"], "authors": ["Medeea Greere"], "publish_date": "2023-01-11T12:07:46+00:00"}