{"result_id": "025010", "URL": "https://amg-news.com/died-suddenly-official-trailer-died-suddenly-film-connects-the-dots-on-the-depopulation-agenda-behind-covid-vaccines/", "timestamp": "2023-04-25 12:02:41 CEST+0200", "meta": {"description": "DIED SUDDENLY | OFFICIAL TRAILER. ‘Died Suddenly’ Film Connects The Dots On The Depopulation Agenda Behind COVID Vaccines", "lang": "en", "keywords": "", "favicon": "https://amg-news.com/wp-content/uploads/2021/09/cropped-AMG-mic-32x32.jpg", "canonical": "https://amg-news.com/died-suddenly-official-trailer-died-suddenly-film-connects-the-dots-on-the-depopulation-agenda-behind-covid-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "amg-news.com", "title": "DIED SUDDENLY | OFFICIAL TRAILER! ‘Died Suddenly’ Film Connects The Dots On The Depopulation Agenda Behind COVID Vaccines", "cleaned_text": "Medeea Greere, an independent publisher, is now on Telegram at https://t.me/AMGNEWS2022 and exists only on reader support as we publish Truth, Freedom and Love for public awareness. Thank You for your support!\n\n‘This is the greatest orchestrated die-off in the history of the world,’ one commentator alleged.\n\nA groundbreaking documentary that sketches the connection between recently skyrocketing sudden deaths, COVID jabs, and the depopulation agenda behind it all will be released November 21.\n\nThe trailer for “Died Suddenly,” presented by radio host Stew Peters, is now available for public viewing:\n\nThe film aims not only to “tell the stories of those who died suddenly,” but to “find answers” explaining their deaths.\n\nSnapshots from the movie trailer give glimpses into what the documentary team has found: massive and mysterious clots being found in the bodies of the vaccinated deceased, an “apocalyptic” spike in excess deaths, and indications, according to the filmmakers, that high fatality rates among the jabbed are ultimately the result of a deliberate depopulation plan.\n\nA marked increase in the numbers of excess deaths have been recorded across the world particularly since the second half of 2021, after the COVID jabs were made available to the public. One film commentator featured in the trailer has claimed that the massive death increase amounts to “12 standard deviations above the mean,” or a one-in-800-year event.\n\n“Why do we never believe them? For centuries, the global elite have broadcast their intentions to depopulate the world – even to the point of carving them into stone,” observed the Stew Peters Show in the release of the documentary trailer, which opens with film footage of the Georgia Guidestones.\n\nThe now-demolished, anonymously-commissioned Georgia Guidestones was a monument that prescribes humanity be maintained at a population of “under 500,000,000 in perpetual balance with nature,” and that human beings “be not a cancer upon the earth.”\n\nThe film trailer raises the question of why Bill Gates, who provided major funding for the global COVID response, is “involved in public health,” and why he considers world overpopulation to be a threat to be averted.\n\nThe trailer closes with the momentous claim regarding the recent death spike,\n\nThe film’s team has launched a “#DiedSuddenly hashtag that has since trended on Twitter.\n\nThe Stew Peters Network has also recently presented a documentary on child sex trafficking called “These Little Ones.”\n\nHow To Make Natural Antibiotics Capsules at Home | Easy + Powerful (video)", "opengraph": {"locale": "en_US", "type": "article", "title": "DIED SUDDENLY | OFFICIAL TRAILER! ‘Died Suddenly’ Film Connects The Dots On The Depopulation Agenda Behind COVID Vaccines - American Media Group", "description": "DIED SUDDENLY | OFFICIAL TRAILER. ‘Died Suddenly’ Film Connects The Dots On The Depopulation Agenda Behind COVID Vaccines", "url": "https://amg-news.com/died-suddenly-official-trailer-died-suddenly-film-connects-the-dots-on-the-depopulation-agenda-behind-covid-vaccines/", "site_name": "American Media Group", "article:author": "https://www.facebook.com/medeea23greere", "article:published_time": "2022-11-02T15:25:56+00:00", "article:modified_time": "2022-11-02T15:51:15+00:00", "image": "https://amg-news.com/wp-content/uploads/2022/11/Died-Suddenly-810x500-1.png", "image:width": "810", "image:height": "500", "image:type": "image/png"}, "tags": ["Depopulation Agenda", "Died Suddenly", "COVID Bioweapon", "Covid-19 vaccine deaths", "NEW ORLD ORDER", "Depopulation Plan"], "tweets": [], "movies": [], "links": ["https://t.me/AMGNEWS2022", "https://20443iiznzby5z6ktalw028za7.hop.clickbank.net/?tid=AMG0211COVID", "https://363146t6gzk0ju78t7-1q6rd09.hop.clickbank.net/?tid=AMG0211COVID", "https://1e866fq5s-nzgm07406btkev6x.hop.clickbank.net/?tid=AMG0211COVID", "https://685ffetas7cn8o34ulo80zbu3n.hop.clickbank.net/?tid=AMG0211COVID", "https://8efe57rzq1pthlbxwlx9reikbz.hop.clickbank.net/?tid=AMG0211COVID", "https://8efe57rzq1pthlbxwlx9reikbz.hop.clickbank.net/?tid=AMG0211COVIDv", "https://t.me/AMGNEWS2022", "https://t.me/AMGNEWS2022"], "authors": ["Medeea Greere"], "publish_date": "2022-11-02T15:25:56+00:00"}