{"result_id": "025042", "URL": "https://amg-news.com/covid-vaccines-are-the-biggest-corruption-scandal-in-the-history-of-the-world-says-mep/", "timestamp": "2023-04-25 12:03:27 CEST+0200", "meta": {"description": "Covid Vaccines Are The Biggest Corruption Scandal In The History Of The World, Says MEP", "lang": "en", "keywords": "", "favicon": "https://amg-news.com/wp-content/uploads/2021/09/cropped-AMG-mic-32x32.jpg", "canonical": "https://amg-news.com/covid-vaccines-are-the-biggest-corruption-scandal-in-the-history-of-the-world-says-mep/", "encoding": "UTF-8"}, "image": null, "domain": "amg-news.com", "title": "Covid Vaccines Are The Biggest Corruption Scandal In The History Of The World, Says MEP", "cleaned_text": "Medeea Greere, an independent publisher, is now on Telegram at https://t.me/AMGNEWS2022 and exists only on reader support as we publish Truth, Freedom and Love for public awareness. Thank You for your support!\n\n“The purchase of 4.5 billion doses of the Covid-19 vaccine for 450 million EU residents is the biggest corruption scandal in the history of mankind,” Mislav Kolakusic, a Member of the European Parliament (“MEP”), said. That’s 10 doses for every man, woman and child in Europe – including newborn babies – for an injection that no one knows the ingredients of.\n\nYesterday, 10 MEPs asked Ursula von der Leyen, President of the European Commission – also known as “Mrs. 4.5 billion doses” – when she would make communications she had with Pfizer regarding the procurement of the “vaccines” publicly available. Mislav Kolakusic was one of those MEPS and he tweeted the video below.\n\nPfizer CEO Albert Bourla refused to participate in the European Parliament’s special committee on Covid-19 (“COVI”) to answer questions. In his stead, Janine Small, President of International Developed Markets, faced the committee. MEP Rob Roos asked her whether Pfizer had tested if their “vaccine” stopped transmission of the virus before the product entered the market. Small said “no.” “Get vaccinated for others” was always a lie.\n\nOn Tuesday, the day after the COVI hearing, six MEPs held a press conference in the European Parliament exposing what happened.\n\nAlbert Bourla’s representative “was unable, incapable or unwilling to answer many of the questions asked by my colleagues,” said Terhes. “What has Pfizer got to hide? … [When we asked] when are they going to fully release these [heavily redacted] contracts the representative of Pfizer, who was sent to replace the CEO of Pfizer, said that they can’t fully disclose these contracts because they have some commercial secrets … and they have to protect their interests. What about the interests of our people?”\n\n“The conduct of Pfizer-Biotech, the biggest pharmaceutical company involved in the covid-19 vaccine production, is deplorable and unacceptable in a democratic framework such as the European Union one,” Donato said. Adding:\n\n“Yesterday … Albert Bourla refused to appear to answer our legitimate questions about his private text messages with the president of EU commission, Ursula von der Leyen, that have already been considered to be irregular … refusal by President von der Leyen to disclose the content of their text messages … the denial by Mr. Bourla to appear in front of the parliament [ ] followed by the reticent behaviour of Mrs Small yesterday casts concerning shadows on the legitimacy of the entire contract award process leaving suspicion of corruption to emerge.”\n\n“It is a scandal that Mr. Bourla is shirking his duty to speak and answer questions after having made the deal of his life,” Limmer said. “[Yesterday] Mrs Small … either pretended to be ignorant or was unwilling to address any of my questions.”\n\n“A mandatory study on safety for pregnant women was quietly discontinued by Pfizer. Preliminary data from v-safe, a program of the US Authority CDC, seems to show a devastating rate of spontaneous abortions in pregnant women. Mrs. Small declined to comment.”\n\n“It is a major disgrace that the Pfizer CEO, Albert Bourla, failed to present himself before our committee. And it is an even bigger disgrace that he has no real intention of appearing, ever,” Sincic said. “So, I will suggest to the Secretariat that invites our guests … that he should be invited using a text message and not an email next time, perhaps he will appear in that way.”\n\nSincic reminded us of a huge Pfizer scandal 10 years ago where Pfizer was penalised $60 million for bribing Croatian doctors responsible for the registration of medicines and evaluating clinical trials. And that this is not the only scandal involving Pfizer.\n\n“So, when you have a company like that, using text messages to communicate with the head of the [European] Commission, [then we must ask] what is happening here? Is this a conflict of interest? Yes of course it is. And a conflict of interest is the first step towards corruption … We were discussing these text messages some time ago and we called upon the President of the Commission, Ursula von der Leyen, to resign and I will repeat my demand for her to resign.”\n\n“Yesterday’s session of the Covid committee showed, yet again, that the EU Parliament is nothing but a gigantic show of democracy illusion to fool the peoples of Europe into thinking their interests were represented in Parliament. It is not,” Anderson said.\n\n“Not only do the invited panellists … or Ministers of Health from the member states not answer any of our questions. No, they continue to spread disinformation about the safety and efficacy of mRNA injections. They continue to lie about and downplay, outright deny, the harmful effects of these injections … In short, they continue to demonstrate their utter contempt for the peoples of the EU.” Anderson has called for a formal committee of inquiry that would “get to the bottom of things and would put an end to their plot of stripping the people of freedom, democracy and the rule of law.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Covid Vaccines Are The Biggest Corruption Scandal In The History Of The World, Says MEP - American Media Group", "description": "Covid Vaccines Are The Biggest Corruption Scandal In The History Of The World, Says MEP", "url": "https://amg-news.com/covid-vaccines-are-the-biggest-corruption-scandal-in-the-history-of-the-world-says-mep/", "site_name": "American Media Group", "article:author": "https://www.facebook.com/medeea23greere", "article:published_time": "2022-10-13T15:21:03+00:00", "image": "https://amg-news.com/wp-content/uploads/2022/10/Fara-titlu-2.png", "image:width": "1453", "image:height": "818", "image:type": "image/png"}, "tags": ["COVID Scandal", "Corruption Scandal"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "788", "height": "443", "embed_code": "<iframe loading=\"lazy\" title=\"Press conference after Pfizer CEO Albert Bourla refused to answer in front of European Parliament\" width=\"788\" height=\"443\" src=\"https://www.youtube.com/embed/2jTgDj7uiX8?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/2jTgDj7uiX8?feature=oembed"}], "links": ["https://t.me/AMGNEWS2022", "https://amg-news.com/urgent-supreme-court-has-canceled-universal-vaccination-in-the-united-states/", "https://1e866fq5s-nzgm07406btkev6x.hop.clickbank.net/?tid=AMG1310COVID", "https://8efe57rzq1pthlbxwlx9reikbz.hop.clickbank.net/?tid=AMG1310COVID", "https://t.me/AMGNEWS2022", "https://t.me/AMGNEWS2022"], "authors": ["Medeea Greere"], "publish_date": "2022-10-13T15:21:03+00:00"}