{"result_id": "025036", "URL": "https://amg-news.com/and-just-like-that-natural-immunity-is-no-longer-a-conspiracy-theory/", "timestamp": "2023-04-25 12:03:18 CEST+0200", "meta": {"description": "And Just Like That, Natural Immunity is No Longer a Conspiracy Theory", "lang": "en", "keywords": "", "favicon": "https://amg-news.com/wp-content/uploads/2021/09/cropped-AMG-mic-32x32.jpg", "canonical": "https://amg-news.com/and-just-like-that-natural-immunity-is-no-longer-a-conspiracy-theory/", "encoding": "UTF-8"}, "image": null, "domain": "amg-news.com", "title": "And Just Like That, Natural Immunity is No Longer a Conspiracy Theory", "cleaned_text": "And Just Like That, Natural Immunity is No Longer a Conspiracy Theory\n\nMedeea Greere, an independent publisher, is now on Telegram at https://t.me/AMGNEWS2022 and exists only on reader support as we publish Truth, Freedom and Love for public awareness. Thank You for your support!\n\nNatural immunity to disease is, or at least was, a well-known concept in medicine.\n\nBy disease, I mean viral infections. One can’t develop natural immunity to diseases like diabetes or heart failure. Many of us remember “chicken pox parties” where when one kid was infectious, he or she was invited over to play with your kids, so they all got infected and then they did not have to worry about getting chicken pox again, due to natural immunity.\n\nThe CDC defines it as follows: “Natural immunity is acquired from exposure to the disease organism through infection with the actual disease.” Contrast this to: “Vaccine-induced immunity is acquired through the introduction of a killed or weakened form of the disease organism through vaccination.”\n\nBoth can be effective depending on the virus, assuming exposure doesn’t kill you, and the type of vaccine, assuming one exists for that virus. As the CDC describes,\n\nYet with the COVID pandemic, this basic and longstanding medical concept became a right-wing, Q-Anon conspiracy theory.\n\nFar-left Mother Jones described it, “Anti-vaxxers have a dangerous theory called ‘natural immunity.’ Now it’s going mainstream.”\n\nThe CDC: “Getting a COVID-19 vaccination is a safer and more dependable way to build immunity to COVID-19 than getting sick with COVID-19.\n\nThe Mayo Clinic: “It’s recommended that people who have already had COVID-19 get a COVID-19 vaccine.”\n\nUSA Today was also quite certain: “Fact check: COVID-19 vaccines provide safer, more consistent immunity than infection.”\n\nAnyone saying otherwise was accused of spreading mis- or disinformation. For physicians this could manifest as a threat of or loss of medical license or employment.\n\n► How To Make The Most Powerful Natural Painkiller That Works Like Morphine That You Can Make at Home. Video Below:\n\nFor example, Dr. Peter McCullough, prominent cardiologist, and outspoken challenger of government COVID policies had his Texas medical license threatened.\n\nDenial of natural immunity was the basis of vaccine mandates which deprived millions of Americans of “the right to choose” or “my body my choice.” Countless individuals with proven natural immunity based on antibody testing lost their jobs since the government mantra was that vaccine immunity was the only path forward and natural immunity was a dangerous conspiracy theory.\n\nThose serving in the military, playing professional sports, or attending college had to make a potentially life-changing choice between natural and vaccine immunity and losing their job or education. For those suffering a vaccine-adverse event, such as myocarditis, stroke, or even sudden death, this was a fatal choice.\n\nLo and behold, The Lancet changed their tune a few weeks ago with a paper, specifically a meta-analysis reviewing 65 studies from 19 countries showing that previous infection with COVID provided better and longer lasting protection than vaccination. This is not to say vaccines provide no protection, but that natural immunity is more effective.\n\nFrom the paper: “Protection from past infection against re-infection from pre-omicron variants was very high and remained high even after 40 weeks.” Immunity may last far longer. A 2020 study published in Nature found that after the 2003 SARS epidemic, a virus similar to COVID, infected patients had immunity 17 years later.\n\nThis was the length of surveillance meaning that immunity could last far longer, even a lifetime. For this SARS coronavirus, previous infection provided long term protection against reinfection. Or as Nature headlined: “Had COVID? You’ll probably make antibodies for a lifetime.”\n\n“Protection was substantially lower for the omicron BA.1 variant and declined more rapidly over time than protection against previous variants.” But their graphs still showed better protection from previous infection than vaccination.\n\nAlso, “Protection from severe disease was high for all variants.” This was the argument for vaccination that it would keep you out of the hospital and ICU, although natural immunity did just fine in this regard.\n\nAlthough even that point about serious disease is in question. Steve Kirsch performed an analysis and found, “The government data from New Zealand shows that for each age group, the more you vax, the more likely you are to die from COVID.”\n\nThis is similar to the recent Cleveland Clinic study finding that the more vaccine doses one had the more one was likely to get COVID. If would be helpful of the CDC would carry out its own similar studies to either confirm or refute these reports. Rather than sticking to their guns and screaming “disinformation.”\n\nWhy is natural immunity more robust? One reason is that natural infection is through the respiratory tract via mucosal surfaces, as opposed to vaccination which bypasses mucous membranes and only provides immunity within the body. Natural infection provides mucosal immunity to future infection, at the point of viral entry into the body, whereas vaccine immunity does not.\n\nLook at it another way. Natural infection locks the doors and windows to the house versus vaccine immunity which simply has a guard inside the house which can’t stop the bad guys from getting inside.\n\nAnother reason is that natural immunity protects against 29 viral proteins compared to vaccines which protect against only one protein, the spike protein. This would like guarding your home with 29 guards rather than only one.\n\nAs a necessary disclaimer, I am not antivaccine, having received two COVID vaccine doses in late 2020. But all vaccines and patients and their risk factors are not the same. With any medical treatment, a thoughtful approach is required, rather than a one size fits all management.\n\nIs this a sudden revelation about natural immunity? Hardly. Dr. Anthony Fauci, in a 2004 C-Span interview, sang the praises of natural immunity for the flu virus, another respiratory virus similar to COVID. Here are his words.\n• You Should Put Garlic in Your Ear Before Going to Sleep:\n\nFlash forward 17 years and the self-proclaimed fact checkers, like Reuters, claim Dr Fauci’s previous statements were “missing context.” His words seemed very clear and straightforward that previous infection is the best form of immunity. Instead, the CDC recommended vaccination even after previous infection, ostensibly to prevent reinfection, which simple observation and the Cleveland Clinic study refutes. How many people do you know who have been fully vaccinated and multi-boosted are still getting COVID?\n\nCommon sense suggests that previous infection should count for something, such as full vaccination, with booster doses for those at higher risk. The EU COVID certificate acknowledged “recovered from COVID-19” as equivalent to vaccination. Yet in the U.S., citizens suffered ostracization or job loss if they chose to rely on previous infection as providing sufficient immunity. Similarly, foreigners still cannot enter the U.S. without proof of vaccination, regardless of how many times they have had and recovered from COVID.\n• None Viral Content: What is the secret to a long healthy life? This Secret Ancient Japanese Tonic Recipe Will Help You Melts 54 LBS Of Fat\n\nIt turns out that the COVID vaccines don’t stop transmission, and based on the above reviews, may increase susceptibility to infection and death. Those were the reasons for vaccine mandates. And natural immunity, a well-known concept, was ignored for COVID and called a conspiracy theory which like many previous bits of “misinformation” turned out to be true.\n\nWhat about young individuals forced to take vaccines and boosters to attend school, despite having had previous COVID infection, and the few that suffered myocarditis or blood clots despite their risk of getting seriously ill from COVID was near zero? How do they get their lives back?\n\nCOVID will not go away but is mutating, as viruses generally do, into a more contagious and less virulent form, much like the common cold. Pushing a vaccine which at this point for most people, provides little if any benefit, and exposes recipients to small but potentially significant risks (another conspiracy theory) is pointless and goes against the medical admonition to “first do no harm”.\n\nSince medical authorities and public health agencies followed the political rather than the medical science, their credibility may be permanently damaged. Why did the medical smart set purposefully ignore the role of natural immunity when formulating COVID policy? Did they all have sudden amnesia to well established immunology or were other agendas at play?\n\nThis will not be the last public health emergency we face and if those in charge choose to play God rather than be honest and transparent, the public will have little faith in any future public medical pronouncements.\n\nBy Brian C. Joondeph, M.D., is a physician and writer. Follow me on Twitter @retinaldoctor, on Truth Social @BrianJoondeph, and on LinkedIn @Brian Joondeph.", "opengraph": {"locale": "en_US", "type": "article", "title": "And Just Like That, Natural Immunity is No Longer a Conspiracy Theory - American Media Group", "description": "And Just Like That, Natural Immunity is No Longer a Conspiracy Theory", "url": "https://amg-news.com/and-just-like-that-natural-immunity-is-no-longer-a-conspiracy-theory/", "site_name": "American Media Group", "article:author": "https://www.facebook.com/medeea23greere", "article:published_time": "2023-02-27T13:32:50+00:00", "image": "https://amg-news.com/wp-content/uploads/2023/02/Fara-titlu-6.png", "image:width": "1259", "image:height": "754", "image:type": "image/png"}, "tags": ["Natural Immunity", "CDC", "COVID-19", "conspiracy theory"], "tweets": [], "movies": [], "links": ["https://t.me/AMGNEWS2022", "https://beca6arbtzqwfv7ispvsql7mbj.hop.clickbank.net/?tid=AMG2702cov", "https://8efe57rzq1pthlbxwlx9reikbz.hop.clickbank.net/?tid=AMG270covV", "https://1e866fq5s-nzgm07406btkev6x.hop.clickbank.net/?tid=AMG2702cov", "https://8efe57rzq1pthlbxwlx9reikbz.hop.clickbank.net/?tid=AMG2702cov", "https://685ffetas7cn8o34ulo80zbu3n.hop.clickbank.net/?tid=AMG2702covV", "https://8c133li5g3btdx2bjdtkma5r5x.hop.clickbank.net/?tid=AMG2702cov", "https://4fbac8kyo9hsdp46ffj-0epz6q.hop.clickbank.net/?tid=AMG2702cov", "https://twitter.com/retinaldoctor", "https://truthsocial.com/@BrianJoondeph", "https://www.linkedin.com/in/brian-joondeph-137ab439/", "https://t.me/AMGNEWS2022", "https://t.me/AMGNEWS2022"], "authors": ["Medeea Greere"], "publish_date": "2023-02-27T13:32:50+00:00"}