{"result_id": "025016", "URL": "https://amg-news.com/why-is-it-so-important-for-the-rockefeller-foundation-to-push-people-to-get-vaxxed-because-they-stated-they-have-a-depopulation-agenda-its-in-your-face/", "timestamp": "2023-04-25 12:02:49 CEST+0200", "meta": {"description": "Why Is It So Important For the Rockefeller Foundation to Push People to Get Vaxxed? Because They Stated They Have a DEPOPULATION AGENDA. It’s In Your Face!", "lang": "en", "keywords": "", "favicon": "https://amg-news.com/wp-content/uploads/2021/09/cropped-AMG-mic-32x32.jpg", "canonical": "https://amg-news.com/why-is-it-so-important-for-the-rockefeller-foundation-to-push-people-to-get-vaxxed-because-they-stated-they-have-a-depopulation-agenda-its-in-your-face/", "encoding": "UTF-8"}, "image": null, "domain": "amg-news.com", "title": "Why Is It So Important For the Rockefeller Foundation to Push People to Get Vaxxed? Because They Stated They Have a DEPOPULATION AGENDA. It’s In Your Face!", "cleaned_text": "Medeea Greere, an independent publisher, is now on Telegram at https://t.me/AMGNEWS2022 and exists only on reader support as we publish Truth, Freedom and Love for public awareness. Thank You for your support!\n\nThe Rockefeller Foundation, the National Science Foundation and other nonprofits are pouring millions of dollars into a research initiative “to increase uptake of COVID-19 vaccines and other recommended public health measures by countering mis- and disinformation.”\n\nThe Rockefeller Foundation, the National Science Foundation (an “independent” agency of the U.S. government) and other nonprofits are pouring millions of dollars into a research initiative “to increase uptake of COVID-19 vaccines and other recommended public health measures by countering mis- and disinformation.”\n\nIn conjunction with the Social Science Research Council (SSRC), the Rockefeller Foundation last month announced $7.2 million in funding for the Mercury Project, initially launched in November 2021, under the slogan, “Together, we can build a healthier information environment.”\n\nThe funds will support 12 teams of researchers in 17 countries who will conduct studies on “ambitious, applied social and behavioral science to combat the growing global threat posed by low COVID-19 vaccination rates and public health mis- and disinformation,” the Rockefeller Foundation said.\n\nThe Rockefeller Foundation and the SSRC claim the aim of the Mercury Project, whose name is derived from the ancient Roman god of messages and communication, is to bolster public health and safety.\n\nRELATED: Guess Who Kills One Person Every 19 Minutes? Rockefellers, The Godfathers Of The Global Pharma MAFIA Cartel\n\nHowever, some critics described the project as one based on “propaganda” aimed at “nudging” the unvaccinated to get vaccinated.\n\nBehavioral change lies at the heart of the Mercury Project, which will issue three-year research grants to estimate “the causal impacts of mis- and disinformation on online and offline outcomes in the context of the COVID-19 pandemic,” including “differential impacts across socio-demographic groups.”\n\nThe research will include “interventions that target the producers or the consumers of mis- and disinformation, or that increase confidence in reliable information.”\n\nSome of the “interventions” proffered by the Rockefeller Foundation include “literacy training for secondary school students” to “help students identify COVID-19 vaccine misinformation,” “equipping trusted messengers with communication strategies to increase COVID-19 vaccination demand” and “using social networks to share tailored, community-developed messaging to increase COVID-19 vaccination demand.”\n\nThis information will, according to the Rockefeller Foundation, “provide evidence about what works — and doesn’t — in specific places and for specific groups to increase COVID-19 vaccination take-up.”\n\nBut according to ZeroHedge, the research groups funded by the Mercury Project “are operating with the intent to tailor vaccination narratives to fit different ethnic and political backgrounds, looking for the key to the gates of each cultural kingdom and convincing them to take the jab.”\n\nThe project uses “ambiguous language and mission statements” to at least partially conceal the project’s main purpose of “using behavioral psychology and mass psychology elements to understand the global resistance to the recent COVID compliance efforts”.\n\nIn November 2021, the Mercury Project received an initial $7.5 million in seed funding from entities including the Rockefeller Foundation, the Robert Wood Johnson Foundation, Craig Newmark Philanthropies and the Alfred P. Sloan Foundation to apply “the principles of large-scale, team-based science to the problem of vaccination demand” over a three-year period.\n\nAs of August 2022, these entities have funded the Mercury Project to the tune of $10.25 million.\n\nIn June, the project received $20 million from the National Science Foundation to study “interventions to increase COVID-19 vaccination demand and other positive health behaviors.”\n\nThe SSRC’s latest call for proposals, under the aegis of the Mercury Project, received nearly 200 submissions.\n\nThe accepted proposals come from researchers in countries including the U.S., Canada, Côte d’Ivoire, England, France, Ghana, Haiti, Kenya, India, Malawi, Mexico, Sierra Leone, Spain, Rwanda and Tanzania.\n\nU.S.-based researchers represent institutions including Carnegie Mellon, Columbia, Duke, Harvard, MIT, New York University, Rutgers, St. Augustine University, Stanford, UC Berkeley, University of Southern California, the University of Chicago, the University of Pennsylvania, the University of Michigan, Vanderbilt and Yale.\n\nThe titles of some of the projects most recently funded by the Mercury Project include:\n• “A tough call: Impacts of mobile technology on Covid-19 (mis)information and protective behavior decision-making.”\n• “Boosting boosters at scale: A megastudy to increase vaccination at scale.”\n• “Building a better toolkit (for fighting misinformation): Large collaborative project to compare misinformation interventions.”\n• “Harnessing influencers to counter misinformation: Scalable solutions in the Global South.”\n• “Targeting health misinformation networks: Network-transforming interventions for reducing the spread of health misinformation online.”\n\nArguing in favor of the importance of the project’s research, Anna Harvey, president of the SSRC, stated:\n\nDescribing the Mercury Project’s grantees, Dr. Bruce Gellin, the Rockefeller Foundation’s chief of global public health strategy, said:\n\nHeather Lanthorn, the Mercury Project’s program director, highlighted the importance of leveraging communication toward achieving public health objectives:\n\nZeroHedge, however, countered that behind all the rhetoric, the focus of the Mercury Project, is “propaganda, propaganda and propaganda,” and “the very basis of the existence of the Mercury Project presupposes that individuals cannot be trusted to make up their own minds about the information they are exposed to.”\n\nThe expectation is that individuals “must be molded to accept the mainstream narrative,” ZeroHedge said, while presupposing that “mainstream or establishment information is always trustworthy and unbiased.”\n\nThe field of behavioral science — and a concept known as “nudging” — figured prominently during the years of the COVID-19 pandemic and were heavily utilized by governments and public health officials throughout the world to justify often stringent restrictions and countermeasures.\n\nNudging was defined in a bestselling 2008 book by economist Richard H. Thaler and legal scholar Cass R. Sunstein — “Nudge: Improving Decisions About Health, Wealth, and Happiness” — as something that “alters people’s behavior in a predictable way without forbidding any options or significantly changing their economic incentives.”\n\nThaler and Sunstein presented nudging as a technocratic solution for tricky policy issues involving a perceived need to encourage, in a “voluntary manner,” policies or measures that would otherwise be unpopular.\n\nTheir work drew from a 1974 paper by two Israeli psychologists, Daniel Kahneman and Amos Tversky, which, as explained by an article published by GAVI-The Vaccine Alliance, “pioneered the study of mental shortcuts that humans rely on to make decisions, known as heuristics.”\n\nThe Rockefeller Foundation is also a partner and board member and donor to GAVI, alongside the WEF, the Bill & Melinda Gates Foundation and the Johns Hopkins Bloomberg School of Public Health, which hosted Event 201, which simulated the spread of a coronavirus just prior to the actual COVID-19 pandemic.\n\nIn 2010, the U.K. government established the Behavioural Insights Team, initially within the government’s Cabinet Office, before it was spun off as a private company in 2014. A year later, U.S. President Barack Obama issued an executive order to promote the utilization of behavioral science in federal policymaking.\n\nAccording to GAVI, “globally, there are now more than 200 teams, or nudge units, that specialize in applying behavioral science to everyday life.”\n\nCOVID-19, and the response to it, was no exception. HRW Healthcare’s Tony Jiang described nudges as “a set of policy tools which utilize psychological insights to attempt to motivate people to adopt certain desired actions/behaviours, without having to enforce strict laws, bans, or punishments,” and as a means to “motivate people into making responsible decisions, while preserving individual liberty.”\n\nAccording to Jiang, “at the beginning of the pandemic, to encourage COVID-safe behaviours, behavioural nudges were the preferred policy by governments in the UK, USA, and Australia.”\n\nAccording to Jay Van Bavel, associate professor of psychology at New York University, “as COVID-19 infections grew exponentially in 2020, behavioral scientists wanted to help. Nudges presented a possible route to controlling the virus, particularly in the absence of vaccines and evidence-based treatments.”\n\nVan Bavel, along with Sunstein and 40 other researchers, in 2020 published a paper in Nature presenting ways in which behavioral science and nudging could contribute to efforts to combat COVID-19, including through fostering increased trust in government and fighting “conspiracy theories.”\n\nAs explained by GAVI, “as scientists learned more about how the coronavirus spread … governments knew what they wanted their citizens to do, but they still had to think carefully about how to encourage people to change their behavior. That’s where nudges could help.”\n\nViral Content: What is the secret to a long healthy life? This Secret Ancient Japanese Tonic Recipe Will Help You Melts 54 LBS Of Fat\n\nThis was evidenced, for instance, in a March 14, 2020, U.K. government document published approximately two weeks before the U.K. government imposed a nationwide lockdown.\n\nThe document presented the role that would be played by the Scientific Advisory Group for Emergencies in advising the U.K. government’s response.\n\nThe document referenced the 2009-10 swine flu pandemic and the advice the advisory group received at the time from a subgroup known as the Scientific Pandemic Influenza Group on Behaviour and Communications. This group was reconvened on Feb. 13, 2020, with an exclusive focus on behavioral psychology.\n\nAccording to the document, the group was “asked to provide advice aimed at anticipating and helping people adhere to interventions that are recommended by medical or epidemiological experts,” concluding that the U.K. government should “provide clear and transparent reasons for the different strategies that might be taken.”\n\nThe group advised the U.K. government that “in order to increase confidence in, and adherence to, the interventions should provide clear and transparent reasons for the strategies that have and have not been selected … and conduct rapid research into how best to help people adhere to the recommendations” whilst suggesting “behaviours that reduce risk.”\n\nOther studies in the 2020-2021 period also highlighted the potential role nudging and behavioral psychology could play in relation to COVID-19.\n\nFor instance, a 2021 study showed that sending text messages to patients before scheduled primary care visits increased flu vaccinations by 5%, while another 2021 study found that the same strategy boosted COVID-19 vaccination appointments by 6% and actual vaccinations by 3.6%.\n\nStill another 2021 study, also published in Nature, found that “behavioural nudges increase COVID-19 vaccinations,” arguing that “overcoming vaccine hesitancy … requires effective communication strategies” and finding that “inducing feelings of ownership over vaccines” can help bring about an increase in vaccine uptake.\n\nThe National Science Foundation offered grants of $200,000 for research in this field, while the SSRC also issued a call for proposals, receiving 1,300 applications even though it had sufficient funding for only 62.\n\nHowever, as the pandemic progressed and as vaccination figures eventually plateaued, the strategy of nudging began to be called into question.\n\nDena Gromet, executive director of the Behavior Change for Good Initiative at the University of Pennsylvania, said nudging is effective only if individuals are already inclined to perform the action that they are being reminded or encouraged to perform.\n\nNudging, as a result, was supplanted by vaccine mandates.\n\nIndeed, such “sterner measures” were advocated by Richard Thaler, one of the creators of the concept of nudging. In an August 2021 New York Times op-ed, Thaler called for stricter measures for the unvaccinated, including vaccine passports and isolation — measures which he described as “pushes and shoves” instead of nudges.\n\nTwo studies performed by researchers at King’s College London also cast doubt on the effectiveness of nudging to change behaviors and attitudes in relation to COVID-19.\n\nNotably, the dedicated COVID-19 page on the website of the Behavioral Insights Team, which had played such a key role in advising the U.K. government on its COVID-19-related countermeasures early in the pandemic, has not featured a new posting since April 28, 2021.\n\nHowever, some believe there still remains a role for nudging as the world enters a “new phase” of the COVID-19 pandemic. Tony Jiang argued that “as mandates relax, a greater reliance on individual compliance is required if we are to prevent mass-outbreaks in the future.”\n\n“This makes the role of nudges and behavioural science ever more crucial,” he said, suggesting that going forward, nudges can be utilized to encourage mask-wearing, vaccinations and boosters.\n\nJiang proffered suggestions such as personalized masks that “can be more fashionable,” and for vaccinations, the potential role of “defaults,” where “people are automatically enrolled to receive a booster and must deliberately cancel the scheduled appointment if they do not wish to receive it.”\n\nGuess What Kills One Person Every 19 Minutes?\n\nStatistics are showing that deaths from pharmaceutical drugs are rising at an alarming rate. But don’t take my word for it. Just google the term “pharmaceutical drugs kill” and you’ll see headlines from major news organizations such as Fox and CNN that read:\n\n“Prescription drugs 62,000 times more likely to kill …\n\n“Prescription drugs are now killing more people than traffic accidents…”\n\n“Prescription Drugs Now Kill More People Than Heroin And Cocaine Combined…”\n\nSadly, most people don’t know that properly prescribed prescription drugs kill over 100,000 Americans each year. (This excludes prescription drug abuse, which causes this number to skyrocket even higher). This is more than or equal to the number of people who die from accidents, Alzheimer’s, influenza and diabetes!", "opengraph": {"locale": "en_US", "type": "article", "title": "Why Is It So Important For the Rockefeller Foundation to Push People to Get Vaxxed? Because They Stated They Have a DEPOPULATION AGENDA. It’s In Your Face! - American Media Group", "description": "Why Is It So Important For the Rockefeller Foundation to Push People to Get Vaxxed? Because They Stated They Have a DEPOPULATION AGENDA. It’s In Your Face!", "url": "https://amg-news.com/why-is-it-so-important-for-the-rockefeller-foundation-to-push-people-to-get-vaxxed-because-they-stated-they-have-a-depopulation-agenda-its-in-your-face/", "site_name": "American Media Group", "article:author": "https://www.facebook.com/medeea23greere", "article:published_time": "2022-10-03T20:23:11+00:00", "article:modified_time": "2022-10-03T21:23:42+00:00", "image": "https://amg-news.com/wp-content/uploads/2022/10/Why-Is-It-So-Important-For-the-Rockefeller-Foundation-to-Push-People-to-Get-Vaxxed.jpg", "image:width": "1056", "image:height": "480", "image:type": "image/jpeg"}, "tags": ["Rockefeller Foundation", "Big Pharma", "Depopulation Agenda", "Mercury Project"], "tweets": [], "movies": [], "links": ["https://t.me/AMGNEWS2022", "https://8efe57rzq1pthlbxwlx9reikbz.hop.clickbank.net/?tid=AMG0310ROK", "https://amg-news.com/rockefellers-godfathers-of-the-global-pharma-mafia-cartel/", "https://8efe57rzq1pthlbxwlx9reikbz.hop.clickbank.net/?tid=AMG0310ROKv", "https://1e866fq5s-nzgm07406btkev6x.hop.clickbank.net/?tid=AMG0310ROK", "https://46a889u3s2oyhtfq0l67rw6x7q.hop.clickbank.net/?tid=AMG0310ROK", "https://685ffetas7cn8o34ulo80zbu3n.hop.clickbank.net/?tid=AMG0310ROK", "https://4fbac8kyo9hsdp46ffj-0epz6q.hop.clickbank.net/?tid=AMG0310ROK", "https://4fbac8kyo9hsdp46ffj-0epz6q.hop.clickbank.net/?tid=AMG0310ROKv", "https://8c133li5g3btdx2bjdtkma5r5x.hop.clickbank.net/?tid=AMG0310ROK", "https://8825cjg2i1iyim1mv9m98jeq60.hop.clickbank.net/?tid=AMG0310ROK", "https://amg-news.com/archives/6018", "https://t.me/AMGNEWS2022", "https://t.me/AMGNEWS2022"], "authors": ["Medeea Greere"], "publish_date": "2022-10-03T20:23:11+00:00"}