{"result_id": "025028", "URL": "https://amg-news.com/the-sequel-to-the-fall-of-the-cabal-who-are-they-where-do-they-come-from-do-they-really-rule-the-world-and-what-do-they-have-in-stall-for-us/", "timestamp": "2023-04-25 12:03:07 CEST+0200", "meta": {"description": "The Sequel to the Fall of the Cabal: Who are they? Where do they come from? Do they really rule the world? And what do they have in stall for us?", "lang": "en", "keywords": "", "favicon": "https://amg-news.com/wp-content/uploads/2021/09/cropped-AMG-mic-32x32.jpg", "canonical": "https://amg-news.com/the-sequel-to-the-fall-of-the-cabal-who-are-they-where-do-they-come-from-do-they-really-rule-the-world-and-what-do-they-have-in-stall-for-us/", "encoding": "UTF-8"}, "image": null, "domain": "amg-news.com", "title": "The Sequel to the Fall of the Cabal: Who are they? Where do they come from? Do they really rule the world? And what do they have in stall for us?", "cleaned_text": "The Sequel to the Fall of the Cabal: Who are they? Where do they come from? Do they really rule the world? And what do they have in stall for us?\n\nMedeea Greere, an independent publisher, is now on Telegram at https://t.me/AMGNEWS2022 and exists only on reader support as we publish Truth, Freedom and Love for public awareness. Thank You for your support!\n\nFull Exposure of the Cabal: Who are they? Where do they come from? Do they really rule the world? And what do they have in stall for us?\n\nPart 1, The Birth of the Cabal\n\nWe’re taking you back into history, all the way to the origins of the Cabal. Let’s start in Sumer (modern-day Iraq), where the oldest civilization on earth started. By following two major migrations (to the West and to the North), we’ll meet the Khazars and the Ashkenazi, and we’ll discover the roots of the Rothschild family. This episode takes you to the turbulent era of the Crusades, the Knights Templar, their hunger for world dominance and their link to Secret Societies, the Jesuit Order and the Freemasons. Were these really separate groups? Let’s find out in this very first episode!\n\nMeet 18th century Adam Weishaupt and Amschel Rothschild, the founders of the Order of the Illuminati in southern Germany. Let ancient documents show you the true ideology of the Cabal, their infiltration of Masonic Lodges, and their Secret Alliances. Their taste for Revenge… taking shape as the French Revolution, the Napoleonic Wars and WW1 (and many more wars, as we will see in future episodes). Behold the Cabal’s Ultimate Tool to obtain Power, Money and Control: WAR. The empire of the Cabal grows and grows….\n\nThe Khazarian Cabal wanted Revenge on Russia, the country that had expelled them. The Russian Revolution was their ultimate wrath: revenge in the Jesuit way… Every leader of every war was a Jesuit puppet, groomed and pushed forward by the Elite. Not just Napoleon, not just Lenin, but also Hitler, ‘leader’ of WW2. Who was he, really? And what happened between WW1 and WW2? How was WW2 even possible? Find out about the Jesuit Nazi SS and the Jesuit organized birth of Israel, long before WW2 even started. While the world was on fire, the Cabal’s power kept growing exponentially…\n\nHoax or Truth? Anti-Semitic or not? Let’s find out through ancient documents, revealing the true identity of the Protocols and its author(s). They show us a future so chilling, so evil, this episode will send shivers down your spine.\n\n\n\n Their old words combined with everyday pictures will shock you to the core. Do we have time left before they reach their final goal: absolute world dominance and a One World Government, a New World Order in which their King – ‘the King of Kings’ – will be crowned on the throne of Zion (Jerusalem) to rule the world forever more?\n\nFrom the Georgia Guidestones – summarizing the Protocols of Zion in stone! – to the main engine of the Cabal: the United Nations. Set up at the very end of WW2 with one goal alone: to create a One World Government in order to usurp and suppress. Their Blue Helmets and ‘Peace Corps’ leave trails of abuse and destruction. Surrounded by scandals, yet untouchable by Law. Agenda 21, agenda 2030, the Global Sustainability Goals. Do you want evidence for such brutal claims? Then go ahead and watch Part 5…\n\nMeet Henry Kissinger, the man who adapted the ancient Protocols of Zion to the 20th and 21st centuries and who advised US presidents and governments on how to steal precious minerals and fossil fuels from the African Continent and how to roll out and execute Population Control. Let’s have a closer look at the UN and their financial support of China’s one child policy, their forced abortions and sterilization of millions of women worldwide, the trauma and bloodshed they left behind. We’ll expose the Population Control NGOs assisting the UN in their aim to cut down on the world population in heinous ways… One of them is Planned Parenthood with its Eugenist Nazi ideology.\n\nIn this episode, we’ll dive into some of the (over 5,500!) NGOs that have been set up solely to execute the UN’s evil goals. These so-called philanthropic institutions are tax-exempt. They do not need to disclose their donors.\n\nThey move millions (even billions!) of dollars around, from mother to sister company, to yet another subsidiary, without any legal control or obstruction whatsoever in this massive money laundering scheme. Let’s examine what ‘philanthropy’ truly means…\n\nMeet the Bill & Melinda Gates Foundation: one of the most influential NGOs of the 21st century. On the outside a benign philanthropic foundation… but on the inside one of the darkest Cabal tools imaginable. We’ll expose their complicity in vaccination experiments on innocent people across the world. We’ll show you the devastating results: children crippled, sterilized, mutilated for the rest of their lives. Human guinea pigs used to see how many would die as a result of the venom shot into their veins. All of BMGF’s programs were/are fully supported by the UN, the WHO, and UNICEF. Are you still considering donating money to any of these foundations? You won’t… after seeing this episode!\n\nBill Gates’ super fetish for GMOs is further revealed in this episode. From super-chickens to kill-switch mosquitoes. Released on the population of Less Developed Countries, they caused havoc… as always when Gates presents a new idea. Big Pharma companies like Hendrix Genetics and Oxitec, plus the University of Wageningen (NL) and the US Army Medical Research & Development Command made a pact with the Devil and created a whole new variety of biological warfare options. Let’s explore… in Part 9!\n\nPart 10, The Gates Foundation – Selling Children on the Internet\n\nThe Bill & Melinda Gates Foundation’s investments in Big Pharma companies and some of the worst polluters in the world (like Bayer/Monsanto) are overshadowed by their interest in companies that sell products on-line.\n\nWe’ll show you Gates’ involvement in pedophilia and child trafficking, his close friendship with convicted child-abuser Epstein, his visits to Epstein-Island, and his massive financial support of webshops that sell Adrenochrome and items that refer to missing children through strange codes. Mister Nice turns out not to be so nice after all…\n\nBill Gates and his foundation invest in some of the most criticized companies in the world for involvement in human rights abuses, labour abuses, environmental abuses, tax avoidance, and the amount of carbon held in their reserves. Everything he does goes against his own preaches about sustainability and the human carbon footprint. GAVI, the WHO, UNICEF, the World Bank, AGRA… evil players steered by the Gates Foundation in order to exploit the people and to depopulate the planet. Time to expose and to redefine Philanthropy!\n\nMore biological warfare in this episode! A frightening cooperation between the Gates Foundation and DARPA (Defense Advanced Research Projects Agency) to deploy Gene Drive Technology, better known as Extinction Technology. A means to make entire species or races go extinct. Used in vaccines and now… to mimic meat! Let’s introduce Beyond Meat and Impossible Foods and their delicious alternatives for vegetarians and vegans: ever so tempting until you find out what’s really in it. This episode shows you what it’s like to play God…\n\nPart 13, The Gates Foundation – Getting Richer and Richer and Richer…\n\nBill Gates uses laws and regulations to avoid tax. His foundation launders money at a scale the world has not seen before. How is it possible that he presents himself as the world’s greatest philanthropist, giving away billions of dollars each year, yet ending up getting richer and richer and richer? Did you know that in the end, it’s We-The-Taxpayers, that pay for all his projects? Do you realise that in fact we pay for our own depopulation?\n\n Let’s see how Gates pulls it off, shall we?\n\nPart 14, Depopulation – The First 4 of 10 Extinction Tools\n\nThe New World Order’s main focus is complete world dominance. Population control, better known as Depopulation, is the UN’s tool to annihilate the majority of the masses, so that no more than 500 million people are left on the face of the earth. A neat number, easy to control, dominate and subjugate. How are we, the people, being attacked in the name of population control? By means of 10 different Extinction Tools. Let’s take a look at the first 4: wars, (natural?) disasters, famine & drought, and plagues & diseases…\n\nLet’s explore some more Extinction Tools! Number 5 on our list: Additives in food, water, beauty, care & cleaning products. You’ll be shocked to see that by design, purposefully, our food and water have been poisoned with substances that cause cancer, infertility, and that destroy our nervous system.\n\nPATRIOT ALERTS: YOUR TRUMP TRB MEMBERSHIP HANDBOOK IS WAITING TO BE IN YOUR HAND:\n\nThink aspartame, fluoride, xeno-oestrogens, heavy metals, magnetic particles… Number 6 on our list: GMOs, notorious for causing cancer and destroying ecosystems. And number 7 on our list: Family Planning. Abortion, gender confusion (LGBTQIA+) and teaching sex to children at the age of 5, all supported and financed by the UN…\n\nExtinction tool number 8 on our list: Chemtrails. After years of denial and ridicule, finally admitted to exist by our governments. Heavy metals are raining down on us, our bodies store them in our brains where they cause havoc. Number 9 on our list: Electrosmog. Every day we are bombarded with the invisible electromagnetic radiation from the use of wireless technology and mains electricity. Plus the ever increasing 5G… do you dare to find out what electrosmog actually does to your body and mind? Then get ready for some chilling facts in part 16!\n\nLast but not least: Extinction tool number 10 on our list: Vaccinations. One of our most chilling episodes about the dangers of vaccinations. Not based on theories or beliefs, but on rock hard scientific facts. We promise you, once you’ve seen this episode, once you know what ingredients are in those shots, you’ll never take another jab in your life! This part 17 has been called by thousands of viewers world-wide “a life saviour”…\n\nCovid-19 and 5G: the ultimate Cabal weapons of mass destruction. However, did you know that the SARS-CoV2 virus has never been isolated and thus never proven to exist? According to the scientific facts, Covid-19 is just another flu. So how come the entire world shut down? What was so different this time, compared with other flu seasons?\n\nIt sure weren’t the number of casualties! Even the CDC and the WHO have admitted that more people died of the 2018 flu than of this one. So what happened? Everything was premeditated, maybe that’s the saddest and scariest thing of all. Let’s take a look at the role of the MSM, of Bill Gates and the WHO, and see why this one got so out of hand…\n\nThe Covid Scam started with social distancing and face masks. Based on scientific fraud, people were led to believe the horrific predictions of incompetent advisors to the government. Millions of people were to die if we didn’t obey! And so… the people obeyed. Families were torn apart, societies were split. Everything that gave joy – singing, dancing, hugging, laughing – was prohibited. Instead, fear ruled the planet and turned it into a dark place. Midazolam and morphine was used to purposefully euthanise many thousands of elderly people in care homes. Hold on to your seat as we prove, beyond a shadow of a doubt, that our world leaders arranged all of this during the lockdowns, so nobody would notice. Hard to believe? Then follow us… to part 19!\n\nPart 20: Covid-19: Part 3 of multiple episodes about the biggest medical scam of all times.\n\n About Face Masks, Social Distancing, and much more…\n\nOur political leaders stated it in front of the cameras: the lock-downs, face masks, social distancing, compulsive hand washing, even the police fines… it was all just a behavioural experiment. They said it, but no one seemed to hear. Fear had taken over people’s minds, and so, logical thinking was no longer an option.\n\nThe majority of the people the Cabal so look down upon, complied with the ridiculous, contradictory rules that kept getting weirder and weirder. How easy was it to terrify and suppress the people, to take all their freedoms away, one by one so they wouldn’t notice it? It turned out to be very, very easy. Fear kept people submissive and right where they belonged: bent and about to break under the oppression by the Cabal…\n\nPart 21: Covid-19: Part 4 of multiple episodes about the biggest medical scam of all times.\n\n About nose swabs and PCR\n\nIn this episode we show you the great dangers of the Nose Swab that transmit carcinogenic ethylene oxide, nano-particles called Morgellons, and DARPA Hydrogel containing nano-bots called Theragrippers that – in all probability – contain the ‘vaccine’. The fibre nose swabs cause havoc inside your head, where they may damage facial and olfactory nerves. When they pass through your blood-brain barrier, the door is open for viruses and bacteria to attack your brains. Were you told about these risks before you complied to these nose swabs? Were you told they may cause eye-bleeds and even brain-bleeds? And what about the PCR test? A marvellous invention, totally abused to pump up the Covid-19 numbers and to further surround this ‘Pandemic’ with lies, fraud, scandals, and deceit.\n\nPart 22: Covid-19: Part 5 of multiple episodes about the biggest medical scam of all times.\n\n About MONEY & MURDER IN HOSPITALS…\n\nWelcome to one of our most shocking episodes, in which we show you evidence of the deliberate euthanisation of healthy people in hospitals across the world. The motive? Money… huge amounts of ‘Covid incentives’. The murder weapon? A combination of the nose swab, too many PCR cycles and thus false positives, the improper use of ventilators, and an overdose of tranquillisers and narcotics. If you want to stay safe, this episode is a must-see! Albeit shocking, the information is vital and may one day save your life or that of a loved one…\n\nTHE SEQUEL TO THE FALL OF THE CABAL – PART 23 – WHISTLEBLOWERS ABOUT HOSPITAL MURDERS\n\n Part 6 of multiple episodes about the biggest medical scam of all times.\n\n Health Care Worker Whistleblowers about Money & Murder in Hospitals…", "opengraph": {"locale": "en_US", "type": "article", "title": "The Sequel to the Fall of the Cabal: Who are they? Where do they come from? Do they really rule the world? And what do they have in stall for us? - American Media Group", "description": "The Sequel to the Fall of the Cabal: Who are they? Where do they come from? Do they really rule the world? And what do they have in stall for us?", "url": "https://amg-news.com/the-sequel-to-the-fall-of-the-cabal-who-are-they-where-do-they-come-from-do-they-really-rule-the-world-and-what-do-they-have-in-stall-for-us/", "site_name": "American Media Group", "article:author": "https://www.facebook.com/medeea23greere", "article:published_time": "2023-01-10T15:17:39+00:00", "image": "https://amg-news.com/wp-content/uploads/2023/01/The-Sequel-to-the-Fall-of-the-Cabal.jpg", "image:width": "1024", "image:height": "557", "image:type": "image/jpeg"}, "tags": ["Fall of the Cabal"], "tweets": [], "movies": [], "links": ["https://t.me/AMGNEWS2022", "https://8821d6s1g7ithn33s82rpfnneq.hop.clickbank.net/?tid=AMG1001CABAL", "https://20443iiznzby5z6ktalw028za7.hop.clickbank.net/?tid=AMG1001CABAL", "https://amg-news.com/bombshell-list-of-hollywood-pedo-names-pedophilia-cia-and-mossad-child-trafficking-in-america-sickening-hillary-clinton-sex-tape-list-of-indictments-arrests-and-exe/", "https://9dac4eq8j5in4q2dd8m2xcvpio.hop.clickbank.net/?tid=AMG1001CABAL", "https://8efe57rzq1pthlbxwlx9reikbz.hop.clickbank.net/?tid=AMG1001CABAL", "https://amg-news.com/urgent-supreme-court-has-canceled-universal-vaccination-in-the-united-states/", "https://88933efamcowbv7f2yqnm2l79a.hop.clickbank.net/?tid=AMG1001CABAL", "https://t.me/AMGNEWS2022", "https://t.me/AMGNEWS2022"], "authors": ["Medeea Greere"], "publish_date": "2023-01-10T15:17:39+00:00"}