{"result_id": "025007", "URL": "https://amg-news.com/breaking-news-emergency-injunction-and-tribunal-order-was-served-to-who-and-all-criminal-defendants-video/", "timestamp": "2023-04-25 12:02:36 CEST+0200", "meta": {"description": "BREAKING NEWS: Emergency Injunction and Tribunal Order Was Served to WHO and all Criminal Defendants (video)", "lang": "en", "keywords": "", "favicon": "https://amg-news.com/wp-content/uploads/2021/09/cropped-AMG-mic-32x32.jpg", "canonical": "https://amg-news.com/breaking-news-emergency-injunction-and-tribunal-order-was-served-to-who-and-all-criminal-defendants-video/", "encoding": "UTF-8"}, "image": null, "domain": "amg-news.com", "title": "BREAKING NEWS: Emergency Injunction and Tribunal Order Was Served to WHO and all Criminal Defendants (video)", "cleaned_text": "BREAKING NEWS: Emergency Injunction and Tribunal Order Was Served to WHO and all Criminal Defendants\n\nMedeea Greere, an independent publisher, is now on Telegram at https://t.me/AMGNEWS2022 and exists only on reader support as we publish Truth, Freedom and Love for public awareness. Thank You for your support!\n\nBREAKING NEWS: Emergency injunction and tribunal order was served to WHO and all Criminal Defendants listed below to immediately cease and desist a criminal conspiracy to commit war crimes, genocide, crimes against humanity and to arrest and incarcerate these criminal defendants.\n\nAll Constitutional law enforcements officers worldwide are being served starting with Interpol and constitutional law enforcements in everyone of the 194 member nations under Writs of Mandamus ordering them to carry out their duties to arrest and incarcerate these criminal codefendants for unlawful and Genocidal acts in connection with the WHO Pandemic preparedness response and changes to the international health regulations.\n\nTribunal Writs of Mandamus is defined as:\n\n“The lawful term writ of mandamus refers to an order by a court to a lesser government official to perform an act required by law, which he has refused or neglected to do. This type of court order is a remedy that may be sought if a governmental agency, public authority, or corporation in service of the government, fails or refuses to do its public or statutory duty.”\n\nThis has been ordered by the Tribunal Under Articles 6 (Genocide) and 7 (Crimes Against Humanity) of the International Criminal Code.\n\n2009-2023 Lockstep Vaccination Genocidal Pandemic Criminal Co-conspiracy, including and not limited to individually and collectively:\n\nXi JinPing, General Secretary of the Communist Party. Vladimir Vladimirovich Putin, President of the Russian Federation. Donald J. Trump, 45th President of the United States of America. Joseph R. Biden 46th President of the United States of America. Benjamin Netanyahu, Prime Minister of Israel. Boris Johnson, Prime Minister of the UK. Matt Hancock, UK Secretary of State for Health. The Crown Corporation and any and all of its Subsidiaries including and not limited to Serco. Justin Trudeau, Prime Minister of Canada. Scott Morrison, Prime Minister of Australia. Jacinda Arden, Prime Minister of New Zealand. GITMO Files | The List of Traitors Hanged in GITMO | You Watch The News Every Day But You See “Fake Persons”, Human Clone, Because They Have Been Executed Stefan Löfven Prime Minister of Sweden. Minister of Heath Lena Hallengren. Narendra Modi, Prime Minister of India. Emmanuel Jean-Michel Frédéric Macron, President of France. Edouard Phillipe, Prime Minister of France. Angela Merkel, Chancellor of Germany. António Guterres, Secretary General of the United Nations Organization. European Union, and President of the Commission, Ursula von der Leyen. President of the Parliament, David Sassoli. President of the European Council, Charles Michel. Michael Ryan, WHO CEO’s at GCHQ-UK, NSA-USA and Bilderberg Group, all CEOs, Monarchies, and Members.\n\nJudge Pascal Najadi: They will all be arrested as soon as possible, Military and law enforcement worldwide are preparing for this to happen. Godspeed.", "opengraph": {"locale": "en_US", "type": "article", "title": "BREAKING NEWS: Emergency Injunction and Tribunal Order Was Served to WHO and all Criminal Defendants (video) - American Media Group", "description": "BREAKING NEWS: Emergency Injunction and Tribunal Order Was Served to WHO and all Criminal Defendants (video)", "url": "https://amg-news.com/breaking-news-emergency-injunction-and-tribunal-order-was-served-to-who-and-all-criminal-defendants-video/", "site_name": "American Media Group", "article:author": "https://www.facebook.com/medeea23greere", "article:published_time": "2023-03-09T15:59:53+00:00", "article:modified_time": "2023-03-09T22:10:08+00:00", "image": "https://amg-news.com/wp-content/uploads/2023/03/AMG-NEWS-breakin-news.jpg", "image:width": "780", "image:height": "390", "image:type": "image/jpeg"}, "tags": ["Deep State", "GITMO", "Cabal", "Deep State Arrests", "Arrests and Execution"], "tweets": [], "movies": [], "links": ["https://t.me/AMGNEWS2022", "https://b3557gq4nzmqfl6s22maqbnzcv.hop.clickbank.net/?tid=AMG0903BN", "https://amg-news.com/gitmo-files-the-list-of-traitors-hanged-in-gitmo-you-watch-the-news-every-day-but-you-see-fake-persons-human-clone-because-they-have-been-executed/", "https://363146t6gzk0ju78t7-1q6rd09.hop.clickbank.net/?tid=AMG0903BN", "https://t.me/AMGNEWS2022", "https://t.me/AMGNEWS2022"], "authors": ["Medeea Greere"], "publish_date": "2023-03-09T15:59:53+00:00"}