{"result_id": "025047", "URL": "https://amg-news.com/guantanamo-bay-detention-camp-arrests-indictments-and-executions-for-thousands-of-new-ex-elite-prisoners-official-documents/", "timestamp": "2023-04-25 12:03:34 CEST+0200", "meta": {"description": "Before we get started, let us first understand that before Trump was POTUS GITMO (Guantanamo Bay Detention Camp) was a fraction", "lang": "en", "keywords": "", "favicon": "https://amg-news.com/wp-content/uploads/2021/09/cropped-AMG-mic-32x32.jpg", "canonical": "https://amg-news.com/guantanamo-bay-detention-camp-arrests-indictments-and-executions-for-thousands-of-new-ex-elite-prisoners-official-documents/", "encoding": "UTF-8"}, "image": null, "domain": "amg-news.com", "title": "UPDATE | Guantanamo Bay Detention Camp Arrests, Indictments and Executions for Thousands of New Ex-Elite Prisoners - Official Documents", "cleaned_text": "UPDATE | Guantanamo Bay Detention Camp Arrests, Indictments and Executions for Thousands of New Ex-Elite Prisoners – Official Documents\n\nMedeea Greere, an independent publisher, is now on Telegram at https://t.me/AMGNEWS2022 and exists only on reader support as we publish Truth, Freedom and Love for public awareness. Thank You for your support!\n\nWHERE THEY GO ONE, THEY GO ALL.. TO TRIBUNAL\n\nSo before we get started, let us first understand that before Trump was POTUS GITMO (Guantanamo Bay Detention Camp) was a fraction of the size it now is. This can be clearly confirmed by the following visuals, identifying a significant amount of expansion for what is expected to be tens of thousands of new ex-elite prisoners. Well, those who are not executed via military tribunal at least.\n\nNow, if you are not aware of these indictments I am referring to, that makes perfect sense because they are still sealed and not yet public knowledge.\n\nPlease allow me to enlighten you:\n\nThese equate to roughly 222,000 sealed indictments and pertain to the most disturbing and corrupt crimes against humanity.\n\nThese range from human trafficking, organ trafficking, child sex trafficking, slavery, treason, terrorism, fraud, misuse of AI, genocide, brainwashing, defamation, 5G endangerment, religious discrimination, misrepresentation, censorship, privacy infringement, and prevention of saving humanity from biotech endangerment.\n\nBelow you will find the related and confirmed ongoing lawsuit filed by Cyprus A. Parsa, The AI Organization vs. Google et al. on February 26, 2020.\n\n[1] Full Lawsuit – Cyprus A. Parsa, The AI Organization vs. Google et al.\n\nRelatedly, another notable court case has been brought forward by the Latham family versus Epstein’s “The 1953 Trust” and was updated as recently as February 1, 2021. This lawsuit showcases how a child was bought, sold, and used as a commodity by multiple high level Luciferian pedophile elites and their respectively associated media corporations and record labels.\n\nThe full lawsuit shown below highlights the charges relating to spying, stalking, drugging, abducting, hostage taking and kidnapping for the purposes of criminally organized sociopathic conduct including sexual assault, sexual harassment, abuse, rape, torment, torture, exploitation, extortion, and human trafficking.\n\nEqually, there has been numerous documents published on the Human Rights Tribunal International website relating to violations of all 30 articles of the Universal Declaration of Human Rights (UDHR) including war crimes to commit mass genocide involving ANTIFA, CDC, Fauci, Gates Foundation, National Lawyers Guild, National Governors Association, The Rothschild Family, and WHO.\n\nBy March 18, 2021 the Natural & Common Law Tribunal For Public Health & Justice (a.k.a. PeaceInSpace.org) had issued its final order including a judgement enforcement and compliance order regarding ceasing and desisting distribution of all COVID vaccinations as they are considered to be genetic biowarfare thus constituting as geocide and crimes against humanity. Both the judgement enforcement and compliance order documents are linked within this cease and desist order.\n\nMany of these deep state elites were given warning of their looming arrests via secret envelopes handed out at George H. W. Bush’s funeral. The following video and image will show you a few of those who were the served the letter and what exactly the letter said.\n\nEssentially, George H.W. Bush confessed everything in his human rights tribunal (filmed on analog) which severely implicated many deep state puppets.\n\nMany of these involved elites have been using COVID-19 as a guise for their crimes against humanity, using coded communications to let each other know their legal situations. The images below give us a great breakdown of their comms.\n\nIt was reported that all of the adrenochrome production facilities have been shutdown as part of the White Hat Military Alliance draining the deep state satanic swamp. However, before they were shutdown the last supply was purposefully tainted with a HIV version of COVID-19 to act as a marker for those elites involved in crimes against humanity. We are witnessing many of these elites suffer from adrenochrome withdrawal during the COVID-19 scandemic.\n\nTRENDING: PREMIUM Gold Smart Trump Card. This is NOT just another no-use, memorabilia card! This is a Unique, Exclusive, Functional, SMART card that has great benefits. Premium Packaging – Every Card has it’s own box to keep it safe!\n\nWe can identify they are suffering from adrenochrome withdrawal as the symptoms include reversing positive effects, schizophrenia, sever physical / mental / emotional damage, and accelerated aging. The following image differentiates the SARS versus HIV strain of COIVD-19 and the possible outcomes for either scenario.\n\nMany of these involved elites are currently suited with an ankle monitor or microchip tracker. They often fake a leg injury to get a large cast/brace over the monitor to conceal it easily. Below we can see Ellen DeGeneres with her SMART Monitor on.\n\nJustin Trudeau for example had the ankle monitor himself for some time, until he supposedly had himself micro-chipped as explained below in the following note by Annie, a Canadian Government official.\n\nWhereas the clone/double Joe Biden so flagrantly shows off how not broken his foot is, just mere days after he allegedly fractured it. He is so obviously concealing an ankle monitor and this just makes it undeniable. Clearly he has entirely capitulated to the plan and is merely playing his role out, possibly even a white hat actor.\n\nAs of June 11, 2020 images of lists with elites’ names began surfacing on social media and circulating around in groups and group chats. They seem to identify who is currently on house arrest, in prison, awaiting tribunal, at GITMO, or already executed.\n\nThere are many versions of the lists and there appears to be quite some overlap in names, which helps to confirm the validity of them:\n\nThe following 50 politically involved elites have been charged with any combination of the following Title 18 U.S. Code felony violations including:\n\nThese arrests, executions, and tribunals began as far back as 2017 during Trumps presidency and are still ongoing as of today as many indictments have yet to be unsealed. The following diagrams seek to make sense of the “plan” or “show” or “movie” or “script” the entire world is watching as the deep state cabal is being brought down behind the scenes.\n\nMany of the elites that have already been arrested or executed along with those who have not yet had their military tribunal will continue to commit suicide or die mysterious deaths. This is also how the white hat clones/doubles filling in for the indicted elites will exit the movie we are all watching.\n\nThe fake news media may even label many of these Rommel deaths as COVID-19 to push their narrative on the sleeping masses in order to keep as many fear-mongered as possible. These elites are attempting to keep their public image and legacy intact and have taken deals behind the scenes. The crimes they have committed are either treasonous or crimes against humanity which all equate to the death sentence regardless.\n\nOperation Warp Speed, a military vaccine delivery operation is believed to secretly be these indictments unsealing for mass arrests via the military for crimes against humanity, treason, and other high crimes (the military is the cure). We have seen numerous live broadcasted vaccine injections (many of which appear to be using prop needles to fake injections) to some well known treasonous or pedophilic persons.\n\nNow the key point that needs to be overserved in the following image is that all the flags are wrinkled, which is a com for traitor/treason. Is it possible that these vaccines are actually lethal injections? Have we just witnessed actors/clones/doubles being phased out of the movie?\n\nThe following videos will help you understand how Trump was able to use evidence of adrenochrome and child trafficking on all countries around the world to get them to capitulate to the plan.\n\nThis includes royalty, prime ministers, presidents, the Vatican, and all Rothschild controlled central banks. Essentially, this explains how Trump is currently the richest man in the world with the largest military in the world as all countries that agreed to capitulate to Trump’s demands are now following his every command.\n\nAs mentioned in the above videos human cloning has been confirmed and many of the elites you are now seeing are in fact clones or doubles standing in for themselves.\n\nThe reason for these clones is because humanity has not yet awakened enough to handle knowing all the crimes these sick disgusting Deep State Freemasonic Illuminati Cabal Globalist Satanists are truly involved in. The majority of society would literally go mentally insane if they learn’t all of this information at once.\n\nThis is why we must help everyone we know raise their vibrational frequency, overcome cognitive dissonance, take the Red Pill, and defeat indoctrination. Once we collectively see the light we shall see the truth, we are in it together.\n\nEpstein Flight Logs – Hollywood Illuminati Satanic Cult – Sent Them all To GITMO!\n\nEpstein Flight Logs – Hollywood Illuminati Satanic Cult – Sent Them all To GITMO!\n\nBOMBSHELL! List of Hollywood Pedo-Names – Pedophilia – CIA and Mossad – Child Trafficking in America | Sickening Hillary Clinton Sex Tape | List of Indictments, Arrests and Executions – Dismantling the Deep State Operatives and Doubles:\n\nHere is a full list of people who are being actively investigated for crimes against children. Many say that arrests have already taken place but no one can confirm this. Something to ask yourself as you review this list…. if these were false allegations, wouldn’t someone have stepped up by now?\n\nWith all the money they have, wouldn’t someone have filed a lawsuit for slander by now? It makes you wonder. What is really sad is that anyone who becomes famous becomes a target.\n\nSome are born into this secret society, some are sold into it by their parents, some are drugged and blackmailed, others are rewarded for participation in the cult by getting leading roles in movies. It’s anyone’s guess as to the specific story for each actor. May God have mercy on their souls…\n\nIf you are not convinced satanic sex cults are operating through out our society and right under our noses, let me introduce you to Marina Abramovic, a 75 year old Serbian performance artist, that claims to test the limits of the human body.\n\nMock Cannibalism – Spirit Cooking\n\n In the WikiLeaks Podesta Emails, there is email 15893 which refers to a “Spirit Cooking dinner”, the so-called “artist” Marina Abramovic is talking to Tony Podesta about, and hoping to know if his brother John Podesta is coming to.\n\nThe Spirit Cooking dinner being refereed to is the famous one you might have seen where people are scooping up mock-blood liquids from naked people lying in mock-blood baths, apparently molasses (but I’m not sure if there wasn’t anything else mixed in). She has used real blood in her “art” before, as you will see. You can see Lady Gaga enjoying her lick of red liquid that was scraped off a naked women that imitates a cannibalistic ritual.\n\nPizzaGate The Pedophile Scandal of The American Elites: Hillary Clinton, Barack Hussein Obama, John and Tony Podesta … The List Would Be Endless\n\nPizzagate is the term given to the flow of news and revelations about\n\n a possible network of pedophiles that operated in Washington through symbols and keywords within a couple of family pizzerias. In this article we will cover many details about this accusation of child abuse.\n\nWhen researchers from Reddit and 4Chan began to delve into the subject of Podesta’s leaked emails, they found something a little strange. Strange references to pizza, ping pong, and a small establishment in northwest Washington DC called Comet Ping Pong.\n\nIt turns out that within the thousands of Podesta emails that left Hillary Clinton in a bad position in handling the situation in Libya and Syria when she was Secretary of State of the Obama administration, there were also strange emails in which words and words were persistently repeated. phrases that seemed to have no meaning, or contextual meaning.\n\nOnly when it was understood that there was a code language in the words of the same, it was possible to measure what was being said in those emails. Podesta and his perverted friends talked about child abuse with an encrypted language that has been widely used in pedophile circles on the Internet for years.\n\nThey substitute words related to pedophilia with “innocent” words, some related to fast foods and related ingredients such as “pizza”, “hodotgs”, “masa”, “salsa”, “queso” or more exotic things like “Nuez” or “bandanas” ” of colors”.\n\nQAnon: Where They Come One They Come All. To GITMO! This Revolution Will Not be Televised!\n\nDisclaimer: The views expressed in this article are that of the author and may not represent the official views of American Media Group. Stories filed under Opinion contain information from various sources that may be both, verified and unverified. AMG-NEWS.com, do not make any claims as to the validity of the information expressed in the opinion section, however we do encourage the reader to do further research on their own and we hope that you will share your findings with us. The mission for the truth requires a collective effort.\n\n[1] Full Lawsuit – Cyprus A. Parsa, The AI Organization vs. Google et al.", "opengraph": {"locale": "en_US", "type": "article", "title": "UPDATE | Guantanamo Bay Detention Camp Arrests, Indictments and Executions for Thousands of New Ex-Elite Prisoners - Official Documents", "description": "Before we get started, let us first understand that before Trump was POTUS GITMO (Guantanamo Bay Detention Camp) was a fraction", "url": "https://amg-news.com/guantanamo-bay-detention-camp-arrests-indictments-and-executions-for-thousands-of-new-ex-elite-prisoners-official-documents/", "site_name": "American Media Group", "article:author": "https://www.facebook.com/medeea23greere", "article:published_time": "2023-04-10T19:22:03+00:00", "article:modified_time": "2023-04-10T19:44:36+00:00", "image": "https://amg-news.com/wp-content/uploads/2022/02/amg-news.jpg", "image:width": "1277", "image:height": "769", "image:type": "image/jpeg"}, "tags": ["Deep State", "Cabal Globalist", "Satanists", "Guantanamo Bay", "Freemason", "Illuminati", "Clones"], "tweets": [], "movies": [], "links": ["https://t.me/AMGNEWS2022", "https://363146t6gzk0ju78t7-1q6rd09.hop.clickbank.net/?tid=AMG2313GTM1", "https://0879fafyl0cnin8g57h8vyeyav.hop.clickbank.net/?tid=AMG2313GTM2", "https://amg-news.com/remember-bush-funeral/", "https://18460er1jzow4wb8yjo0djdwdh.hop.clickbank.net/?tid=AMG2313GTM3", "https://18460er1jzow4wb8yjo0djdwdh.hop.clickbank.net/?tid=AMG2313GTM4V", "https://amg-news.com/archives/2555", "https://amg-news.com/archives/10329", "https://4fbac8kyo9hsdp46ffj-0epz6q.hop.clickbank.net/?tid=AMG2313GTM5", "https://amg-news.com/archives/10052", "https://8efe57rzq1pthlbxwlx9reikbz.hop.clickbank.net/?tid=AMG2313GTM", "https://363146t6gzk0ju78t7-1q6rd09.hop.clickbank.net/?tid=AMG2313GTM7V", "https://amg-news.com/bombshell-list-of-hollywood-pedo-names-pedophilia-cia-and-mossad-child-trafficking-in-america-sickening-hillary-clinton-sex-tape-list-of-indictments-arrests-and-exe/", "https://amg-news.com/satanic-elite-exposed-marina-abramovic-dinner-rituals-perverse-sexual-and-cannibalistic-rituals/", "https://amg-news.com/pizzagate-the-pedophile-scandal-of-the-american-elites-hillary-clinton-barack-hussein-obama-john-and-tony-podesta-britney-spears-lindsey-lohan-justine-bieber-miley-cyrus-the-list-woul/", "https://amg-news.com/the-executed-clones-doubles-actors-transvestites-hiding-in-plain-sight-holographic-or-cgi/", "https://amg-news.com/list-of-indictments-arrests-and-executions-dismantling-the-deep-state-operatives-and-doubles/", "https://amg-news.com/the-end-of-the-world-as-we-know-it-the-fall-of-the-cabal-arrests-and-executions-we-have-it-all-q-video/", "https://amg-news.com/guantanamo-bay-detention-camp-arrests-indictments-and-executions-for-thousands-of-new-ex-elite-prisoners-official-documents/", "https://amg-news.com/gitmo-files-the-list-of-traitors-hanged-in-gitmo-you-watch-the-news-every-day-but-you-see-fake-persons-human-clone-because-they-have-been-executed/", "https://www.humorousmathematics.com", "https://www.courtlistener.com/recap/gov.uscourts.casd.660353/gov.uscourts.casd.660353.3.0.pdf", "http://humanrightstribunal.international/?wpfb_dl=809", "http://humanrightstribunal.international/?wpfb_dl=834", "http://humanrightstribunal.international/?wpfb_dl=787", "https://t.me/AMGNEWS2022", "https://t.me/AMGNEWS2022"], "authors": ["Medeea Greere"], "publish_date": "2023-04-10T19:22:03+00:00"}