{"result_id": "025039", "URL": "https://amg-news.com/brilliant-new-documentary-exposes-how-big-pharma-and-govt-teamed-up-to-push-the-covid-vaccines/", "timestamp": "2023-04-25 12:03:22 CEST+0200", "meta": {"description": "‘Brilliant’ New Documentary Exposes How Big Pharma and Gov’t Teamed Up To Push The COVID Vaccines", "lang": "en", "keywords": "", "favicon": "https://amg-news.com/wp-content/uploads/2021/09/cropped-AMG-mic-32x32.jpg", "canonical": "https://amg-news.com/brilliant-new-documentary-exposes-how-big-pharma-and-govt-teamed-up-to-push-the-covid-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "amg-news.com", "title": "‘Brilliant’ New Documentary Exposes How Big Pharma and Gov’t Teamed Up To Push The COVID Vaccines", "cleaned_text": "Medeea Greere, an independent publisher, is now on Telegram at https://t.me/AMGNEWS2022 and exists only on reader support as we publish Truth, Freedom and Love for public awareness. Thank You for your support!\n\n‘Safe and Effective: A Second Opinion’ chronicles the ‘perfect storm” of safety trial problems, regulatory lapses, and government propaganda that led to mass ‘vaccination’ with a shot that has devastated lives.\n\nA newly released documentary that has been praised as “brilliant” and “outstanding,” chronicles the shocking story of how COVID shots were pushed in the United Kingdom using government propaganda and misleading data from Big Pharma.\n\nWhile the film, aptly titled, “Safe and Effective: A Second Opinion,” is primarily focused on the U.K., one of its most powerful sub-narratives is relevant worldwide: How pharmaceutical manufacturers sidestepped safety hurdles and misled the public regarding the effectiveness and potential harms of the COVID jabs.\n\nViral Content: What is the secret to a long healthy life? This Secret Ancient Japanese Tonic Recipe Will Help You Melts 54 LBS Of Fat\n\nThe documentary uses expert testimony to show how the trial data was flawed, and how the “vaccine” manufacturers used “very, very misleading” figures to promote the COVID-19 shot.\n\nConsultant cardiologist Dr. Aseem Malhotra, who was “one of the first to take the Pfizer vaccine,” shared how Pfizer’s promotion of its shot using relative risk reduction, and not absolute risk reduction, led to the impression that the mRNA COVID shot was dramatically more effective at preventing disease than was actually the case.\n\nThe film went on to highlight the “shocking allegations” of clinical trial research specialist Alexandra Latypova, who studied Pfizer trial documents that were force-released in the U.S. after a Freedom of Information Act (FOIA) request. Among her findings were the following:\n• The toxicity of the COVID-19 vaccines’ mRNA active ingredient was never studied.\n• The FDA and Pfizer knew about major toxicities associated with gene therapy class of medicines.\n• The CDC, FDA and Pfizer lied about vaccines staying in the injection site.\n• My examination of leaked Moderna documents also revealed that vaccine-induced antibody-enhanced disease was identified as a serious risk.”\n\nWorsening the problem of woefully inadequate studies was a disruption of the ordinary regulation process, Bowe explained. The Medicines and Healthcare products Regulatory Agency (MHRA) Chief Executive June Raine had “admitted that the agency had changed from Watchdog to Enabler.”\n\nThe film highlighted video footage in which Raine confessed that normal safeguards in the clinical trials for “vaccines” had been discarded for the COVID jabs: “We tore up the rule book and we allowed companies to immediately start juxtaposing not sequential phases of clinical trials, but overlapping. Beginning the next one before the previous had been finished.”\n\n► Watch Now: The Most Powerful Natural Painkiller That Works Like Morphine That You Can Make at Home. Video below:\n\nThe film went on to highlight heart-tugging stories of COVID jab injuries, which in some cases shattered the lives of the victims, making them almost entirely dependent on caregivers for day-to-day living.\n\n► Educate-Yourself: Home Doctor – Why You Should Put Garlic in Your Ear Before Going to Sleep\n\nMP Sir Christopher Ghope protested in parliament that doctors have proceeded to add insult to injury in these unfortunate cases by consistently dismissing the jabs as a possible causal factor:\n\nAnother key piece of the documentary was its demonstration of how the UK government scandalously coordinated propaganda to promote the COVID jab. It showed screenshots of actual instructions from a “playbook” of the Scientific Advisory Group for Emergencies (SAGE), which explicitly instructed, “Use [of the] media to increase [a] sense of personal threat,” to achieve government aims during COVID-19, among other things.\n\nFollowing this series of events, a BBC reporter was shown publicly stating, “Just to let you in on a journalistic point here. We actually don’t, as a matter of editorial policy, we don’t debate with anti-vaxxers, whether they’re right or wrong. We actually don’t do that.”\n\nThe Supreme Court In The US Has Ruled That The Covid Pathogen Is Not A Vaccine, Is Unsafe, And Must Be Avoided At All Costs – Supreme Court Has Canceled Universal Vax\n\nHas not been in the news anywhere. Looks like we are getting closer to the Final Scene in the movie.\n\nPlease ALERT everyone in the family, friends and relatives! BREAKING NEWS ! Supreme Court has canceled universal vaccination In the United States, the Supreme Court has canceled universal vaccination. Bill Gates, US Chief Infectious Disease Specialist Fauci, and Big Pharma have lost a lawsuit in the US Supreme Court, failing to prove that all of their vaccines over the past 32 years have been safe for the health of citizens! Read the full article HERE: https://amg-news.com/urgent-supreme-court-has-canceled-universal-vaccination-in-the-united-states/", "opengraph": {"locale": "en_US", "type": "article", "title": "‘Brilliant’ New Documentary Exposes How Big Pharma and Gov’t Teamed Up To Push The COVID Vaccines - American Media Group", "description": "‘Brilliant’ New Documentary Exposes How Big Pharma and Gov’t Teamed Up To Push The COVID Vaccines", "url": "https://amg-news.com/brilliant-new-documentary-exposes-how-big-pharma-and-govt-teamed-up-to-push-the-covid-vaccines/", "site_name": "American Media Group", "article:author": "https://www.facebook.com/medeea23greere", "article:published_time": "2022-10-02T14:02:23+00:00", "article:modified_time": "2022-10-02T14:05:12+00:00", "image": "https://amg-news.com/wp-content/uploads/2022/10/‘Brilliant-New-Documentary-Exposes-How-Big-Pharma-and-Govt-Teamed-Up-To-Push-The-COVID-Vaccines.jpg", "image:width": "1555", "image:height": "873", "image:type": "image/jpeg"}, "tags": ["COVID Scam", "Big Pharma"], "tweets": [], "movies": [], "links": ["https://t.me/AMGNEWS2022", "https://8c133li5g3btdx2bjdtkma5r5x.hop.clickbank.net/?tid=AMG0210covid", "https://46a889u3s2oyhtfq0l67rw6x7q.hop.clickbank.net/?tid=AMG0210covidV", "https://46a889u3s2oyhtfq0l67rw6x7q.hop.clickbank.net/?tid=AMG0210covid", "https://8efe57rzq1pthlbxwlx9reikbz.hop.clickbank.net/?tid=AMG0210covid", "https://8efe57rzq1pthlbxwlx9reikbz.hop.clickbank.net/?tid=AMG0210covidV", "https://685ffetas7cn8o34ulo80zbu3n.hop.clickbank.net/?tid=AMG0210covid", "https://1e866fq5s-nzgm07406btkev6x.hop.clickbank.net/?tid=AMG0210covid", "https://amg-news.com/urgent-supreme-court-has-canceled-universal-vaccination-in-the-united-states/", "https://t.me/AMGNEWS2022", "https://t.me/AMGNEWS2022"], "authors": ["Medeea Greere"], "publish_date": "2022-10-02T14:02:23+00:00"}