{"result_id": "025031", "URL": "https://amg-news.com/injectable-nanotech-federal-insider-warns-vaccines-will-be-used-to-create-a-digital-prison/", "timestamp": "2023-04-25 12:03:11 CEST+0200", "meta": {"description": "Injectable Nanotech: Federal Insider Warns Vaccines Will Be Used to Create a Digital Prison", "lang": "en", "keywords": "", "favicon": "https://amg-news.com/wp-content/uploads/2021/09/cropped-AMG-mic-32x32.jpg", "canonical": "https://amg-news.com/injectable-nanotech-federal-insider-warns-vaccines-will-be-used-to-create-a-digital-prison/", "encoding": "UTF-8"}, "image": null, "domain": "amg-news.com", "title": "Injectable Nanotech: Federal Insider Warns Vaccines Will Be Used to Create a Digital Prison", "cleaned_text": "Injectable Nanotech: Federal Insider Warns Vaccines Will Be Used to Create a Digital Prison\n\nMedeea Greere, an independent publisher, is now on Telegram at https://t.me/AMGNEWS2022 and exists only on reader support as we publish Truth, Freedom and Love for public awareness. Thank You for your support!\n\nMilton William ‘Bill’ Cooper was born on May 6, 1943 in Long Beach, California. His father was a member of the U.S. Air Force. Being part of a military family, he lived in many countries around the world. As a young adult Bill joined the armed forces and diligently climbed the ranks.\n\nWhile stationed in Vietnam, he was awarded several medals for his heroism on the battlefield. After the war, he worked on Top Secret projects as a member of the Naval intelligence team. Following an honorable discharge in 1975, Bill reintegrated into civilian life.\n\nIn 1988, deeply concerned about events transpiring globally, the veteran broke his silence and became a whistleblower. He dedicated his life to sharing insider knowledge hidden from the general public. Much of his intel came from classified documents he read while employed in the federal sector.\n\nBy 1991 Bill had compiled his decades-long research into a book titled Behold a Pale Horse. It contains many predictions regarding future events planned by the New World Order. On page 444, he includes an article discussing the end goal of using vaccines to implant trackable microchips.\n\nHere is the transcript:\n\nCoded Microchips implanted in every person in the country would tie all of us into a master computer that could track anyone down at any moment, and plans for such a system are already underway whether you like it or not.\n\nThe secret scheme is being touted as a service for the protection of the people by high government officials, but some insiders who object to the move say it’s just another way for Big Brother to control its subjects.\n\nclaims Davis Milerand, a critic of government intervention who says he has received leaked information from inside sources.\n\nInjections “But with the astounding technology of today, everything about you could be contained in one tiny microchip, which would be connected to a government computer.\n\nAlso: 5G AirWave Defender – How to REDUCE RADIATION IN YOUR HOME !!!\n\nAny government agency will know what any person has done and is doing at any time. Other sources say the tiny transmitters can be injected painlessly from a tiny gun in humans without them even knowing it through a nationwide vaccination program. All the government would have to do is make up something like the swine flu vaccine,” Milerand says.\n\nThese statements were made over thirty years ago— a time when technological devices such as smartphones did not yet exist. Given the push for mass inoculation in recent years, one cannot help but wonder if there is a hidden ulterior motive.\n\nWilliam Cooper made numerous claims that have come to fruition. These include the fall of the Berlin Wall, the United States invading Panama, and predicting 9/11.\n\nWas he right about injectable microchips too?\n\nOnly time will tell, but for the sake of the 5.5 billion individuals that received a COVID-19 vaccine, let’s hope not.\n\nThe central banks are preparing to replace all cash money with a digital currency, the CBDC (Central Bank Digital Currency). This will give them full control over humanity, as they can then monitor every transaction, limit what you can spend, and even delete your funds at will. It is promoted as something that will make our lives easier. The truth is that it would mean total tyranny for all of humanity. Our digital funds would be connected to our digital ID, which will be connected to our vaccine status and social credit scores.\n\nImagine no longer being able to access your funds – when your digital ID shows that you haven’t received your umpteenth vaccine booster. Or envision how your spending would be limited as the result of posting something on Facebook that the government doesn’t like.\n\nOr worse: what if governments simply erase your bank account because you don’t agree with their policies?", "opengraph": {"locale": "en_US", "type": "article", "title": "Injectable Nanotech: Federal Insider Warns Vaccines Will Be Used to Create a Digital Prison - American Media Group", "description": "Injectable Nanotech: Federal Insider Warns Vaccines Will Be Used to Create a Digital Prison", "url": "https://amg-news.com/injectable-nanotech-federal-insider-warns-vaccines-will-be-used-to-create-a-digital-prison/", "site_name": "American Media Group", "article:author": "https://www.facebook.com/medeea23greere", "article:published_time": "2023-02-22T15:42:16+00:00", "image": "https://amg-news.com/wp-content/uploads/2023/02/Injectable-Nanotech-Federal-Insider-Warns-Vaccines-Will-Be-Used-to-Create-a-Digital-Prison.png", "image:width": "1179", "image:height": "665", "image:type": "image/png"}, "tags": ["Digital Prison", "New World Order", "State Of Control", "Injectable Nanotech", "Digital ID"], "tweets": [], "movies": [], "links": ["https://t.me/AMGNEWS2022", "https://363146t6gzk0ju78t7-1q6rd09.hop.clickbank.net/?tid=AMG2202inject", "https://363146t6gzk0ju78t7-1q6rd09.hop.clickbank.net/?tid=AMG2202injectV", "https://f9871imyl8js9o91xpn4kcty3r.hop.clickbank.net/?tid=AMG2202inject", "https://8efe57rzq1pthlbxwlx9reikbz.hop.clickbank.net/?tid=AMG2202injectV", "https://amg-news.com/the-end-of-all-freedom-a-central-bank-digital-currency-creates-unprecedented-possibilities-for-tyranny/", "https://downthechupacabrahole.com/2023/01/11/injectable-nanotech-federal-insider-warns-vaccines-will-be-used-to-create-a-digital-prison/#more-10387", "https://t.me/AMGNEWS2022", "https://t.me/AMGNEWS2022"], "authors": ["Medeea Greere"], "publish_date": "2023-02-22T15:42:16+00:00"}