{"result_id": "025033", "URL": "https://amg-news.com/vaccines-was-faked/", "timestamp": "2023-04-25 12:03:14 CEST+0200", "meta": {"description": "BOMBSHELL: The FDA’s emergency use authorization (EUA) for covid “vaccines” was FAKED", "lang": "en", "keywords": "", "favicon": "https://amg-news.com/wp-content/uploads/2021/09/cropped-AMG-mic-32x32.jpg", "canonical": "https://amg-news.com/vaccines-was-faked/", "encoding": "UTF-8"}, "image": null, "domain": "amg-news.com", "title": "BOMBSHELL: The FDA’s emergency use authorization (EUA) for covid “vaccines” was FAKED", "cleaned_text": "BOMBSHELL: The FDA’s emergency use authorization (EUA) for covid “vaccines” was FAKED\n\nMedeea Greere, an independent publisher, is now on Telegram at https://t.me/AMGNEWS2022 and exists only on reader support as we publish Truth, Freedom and Love for public awareness. Thank You for your support!\n\n› › › The Supreme Court In The US Has Ruled That The Covid Pathogen Is Not A Vaccine, Is Unsafe, And Must Be Avoided At All Costs – Supreme Court Has Canceled Universal Vax\n\nAfter Congress passed the Public Readiness and Emergency Preparedness Act (PREP Act) back in 2020, things changed for the worse at the U.S. Food and Drug Administration (FDA) in terms of the standards used to authorize and approve vaccines, biologics, and other pharmaceutical drugs.\n\nAll of the certified Good Clinical Practices (GCP) that were followed prior to 2020 went out the window at the height of the Wuhan coronavirus (Covid-19) scamdemic to pave the way for warp speed drug approvals on the fly, which is exactly what happened with Operation Warp Speed.\n\nWhistleblower Brook Jackson brought to light many of the blatant violations of GCP in Pfizer’s human clinical “trials” for its messenger RNA (mRNA) shot, which we now know is both dangerous and ineffective. Ventavia, the Pfizer partner that held the trials, knew full well about the violations at the time of the trials.\n\nAfter Jackson blew the lid on the whole operation, Ventavia went into attack mode. It vilified the victims of Pfizer’s lethal injections who are now suffering or dead because of getting jabbed, as well as arranged for Jackson to be fired for telling the truth.\n\nThe following bullet points highlight the observations that Jackson made while at Ventavia, which she included in her whistleblower complaint:\n• fabrication and falsification of blood draw information, vital signs, signatures and other essential clinical trial data;\n• failure to timely remove ineligible patients’ data from the trial;\n• failure to maintain temperature control for the vaccine at issue;\n• failure to monitor patients after injection as required by the trial protocol;\n• use of unqualified and untrained personnel as vaccinators and laboratory personnel;\n• failure to maintain the “blind” as required, which is essential to the credibility and validity of the observer-blinded clinical trial;\n• ethical violations, such as failure to secure informed consent and giving patients unapproved compensation;\n• improper injection of the vaccine (i.e., by over-diluting vaccine concentrate or using the wrong needle size);\n• failure to ensure that trial site staff were properly trained as required by good clinical practices;\n• other violations of the clinical trial protocol, FDA regulations, and Federal Acquisition Regulations and their DoD supplements.\n\nPfizer and the DoD committed FRAUD by submitting sham trials to fake FDA reviewers\n\nHad the old, pre-PREP Act rules still been valid at the times of these fraudulent trials, none of the aforementioned issues would have been tolerated. In fact, the entire clinical trial operation would have been halted immediately.\n\nInstead, the trials proceeded as normal, despite all the corruption, and were used to later justify mandating covid injections on millions of Americans who otherwise would have just said no to these deadly drugs, as the late First Lady Nancy Reagan once urged.\n\nDuring the emergency use authorization (EUA) farce, Pfizer, in conjunction with the Department of Defense (DoD), submitted Wistar rat data to fake FDA reviewers as part of the package. That clinical trial “study” included admissions by Pfizer and the DoD that no assessment would be made of pharmacokinetics, pharmacodynamics, biomarkers or genetics with regard to the injections.\n\nViral Content: Alpine Weight Loss Secrets: The Natural Way to Look 5, 10, Even 20 Years Younger\n\n“The primary purpose of all the statutory, regulatory changes and guidance document revisions year after year, page after page, is to keep people from, first, understanding the war crimes as war crimes, and – if people do figure it out – keep them chasing their tails trying to find the FDA loophole that the war criminals somehow failed to close, through which somebody might someday be able to get them to stop killing us,”\n\nwrites Katherine Watt for Bailiwick News – be sure to read her full assessment of the situation.\n\nMore news stories like this one can be found at FDA.news.", "opengraph": {"locale": "en_US", "type": "article", "title": "BOMBSHELL: The FDA’s emergency use authorization (EUA) for covid “vaccines” was FAKED - American Media Group", "description": "BOMBSHELL: The FDA’s emergency use authorization (EUA) for covid “vaccines” was FAKED", "url": "https://amg-news.com/vaccines-was-faked/", "site_name": "American Media Group", "article:author": "https://www.facebook.com/medeea23greere", "article:published_time": "2023-02-15T20:31:31+00:00", "article:modified_time": "2023-02-17T17:27:55+00:00", "image": "https://amg-news.com/wp-content/uploads/2023/02/00-1.jpg", "image:width": "800", "image:height": "451", "image:type": "image/jpeg"}, "tags": ["FDA", "“vaccines” was FAKED"], "tweets": [], "movies": [], "links": ["https://t.me/AMGNEWS2022", "https://amg-news.com/urgent-supreme-court-has-canceled-universal-vaccination-in-the-united-states/", "https://3afa0iq7p4cxdxeelhp3ybw5rr.hop.clickbank.net/?tid=AMG1502FED", "https://b3557gq4nzmqfl6s22maqbnzcv.hop.clickbank.net/?tid=AMG1502FED", "https://20717ctyp5pvbs95wnjjq9-ycx.hop.clickbank.net/?tid=AMG1502FED", "https://bailiwicknews.substack.com/p/on-the-significance-of-21-usc-360bbb", "https://t.me/AMGNEWS2022", "https://t.me/AMGNEWS2022"], "authors": ["Medeea Greere"], "publish_date": "2023-02-15T20:31:31+00:00"}