{"result_id": "025015", "URL": "https://amg-news.com/benjamin-fulford-march-6th-2023-entire-km-financial-system-about-to-collapse-with-credit-suisse-the-likely-first-domino/", "timestamp": "2023-04-25 12:02:48 CEST+0200", "meta": {"description": "Benjamin Fulford — March 6th 2023: Entire KM financial system about to collapse with Credit Suisse the likely first domino", "lang": "en", "keywords": "", "favicon": "https://amg-news.com/wp-content/uploads/2021/09/cropped-AMG-mic-32x32.jpg", "canonical": "https://amg-news.com/benjamin-fulford-march-6th-2023-entire-km-financial-system-about-to-collapse-with-credit-suisse-the-likely-first-domino/", "encoding": "UTF-8"}, "image": null, "domain": "amg-news.com", "title": "Benjamin Fulford — March 6th 2023: Entire KM financial system about to collapse with Credit Suisse the likely first domino", "cleaned_text": "Benjamin Fulford — March 6th 2023: Entire KM financial system about to collapse with Credit Suisse the likely first domino\n\nMedeea Greere, an independent publisher, is now on Telegram at https://t.me/AMGNEWS2022 and exists only on reader support as we publish Truth, Freedom and Love for public awareness. Thank You for your support!\n\nNOTICE: The videos Fulford normally embeds into his posts are now restricted (as of March 2023). There is no way to add them here for easy viewing. Until a new format is used by Fulford and his team, all the videos will show up as restricted below.\n\nThe collapse of the Khazarian Mafia financial system is looking imminent with Credit Suisse the likely first domino. If it falls it will trigger a process that would lead to the collapse of multiple major banks and then after that the World Bank, the IMF and the big Kahuna, the UNITED STATES CORPORATION .⇒ Khazaria, Rothschild Dynasty, New World Order, Ukraine and Implementation of the Nephilim Agenda\n\nA full-fledged bank run on Credit Suisse is now underway as customers withdrew $120 billion last month alone. Now the New York Post reports sensitive personal information including social security identification, employment information, and contact details of customers who keep $50 million or more in the bank has been compromised.\n\nThis “Suisse Secrets” report from a year ago just touches the tip of the iceberg.\n\nThe head of MI6 agrees saying: “Credit Suisse is indeed implicated in international criminal fraud, in this case, the money laundry in Geneva of The Europe Union paying bribery to all of The Queen’s Prime Ministers to commit high treason. We have all the evidence. This is why I keep firing prime ministers in London. The Queen and Her Majesty’s husband were both murdered because of this among so many.”\n\nThe shoot-to-kill licenses 001 and 002 are now in full play, he adds.\n\nThis implosion is not just about high-level gangsters but is likely to lead to the removal of most of the so-called leaders in the world, White Dragon Society sources say.\n\nThe revelations of Vatican bank bribery accounts below from the Obama administration are a sample of systematic KM bribery that could be reproduced across most of the Western-controlled countries of the world.\n\nBecause banks all lend to the same people if one bank falls and pulls its loans, then the borrowers cannot pay other loans either so, the whole system comes tumbling down.\n\n“I know from very credible sources that Bank of America, Wells Fargo and JP Morgan Chase are insolvent and have bankruptcy proceedings active. They are ‘sealed’ from the public’s view,” the Mossad source adds.\n\nDespite the attempt to cover this up, bits and pieces are leaking. Chinese real estate developers have stopped about USD 53.6 Billion in loans to Western banks, Blackstone defaulted $580 million on a Manhattan building (40% vacancy); the second default on Nordic REIT (46% vacancy) totaling $2.1 Billion…PIMCO defaulted on $1.7 Billion and Brookfield defaulted on 2 Los Angeles bldgs with $783 million in mortgages.\n\nThis is expected to pull down the Swiss Octagon group and with it, their control over the G7 countries and various slave states around the world. The big question is where is all the physical gold the Swiss have been storing in their vaults for more than 50 years? They have so far refused to honor legitimate requests to return either Chinese or Japanese imperial gold. If they no longer have the gold, this is very important because at the very top of the financial system, only real assets like gold are accepted: paper is not. The Khazarian Mafia has been reduced to threatening to use earthquake weapons to force countries to hand over gold. Indonesian authorities tell us they are being told to hand over gold and other natural resources, or a very large earthquake will occur later this month. The threats came from the Dutch embassy in Jakarta. It was passed on to a high-level official in the Ministry of Foreign Affairs of Indonesia in Jakarta, Indonesian intelligence sources say. That explains why Dutch “seismologist” Frank Hoogerbeets -who rose to international prominence after predicting the devastating earthquakes in Türkiye and Syria- predicts a “mega-earthquake” with a magnitude of 8.5 or higher “due to the special position of the Earth, Mercury and Saturn.” This pseudo-science is nothing other than a thinly veiled threat. This is a message from the WDS to the Dutch: “People who live below sea level shouldn’t throw tsunamis.” Indonesia is not alone. The KM is also trying to intimidate the Philippines into handing over its gold and other resources. The Philippine people are fighting back. A Philippines court has issued an international arrest warrant for Bill Gates, who as the founder of the Bill and Melinda Gates Foundation, is “wanted in connection with hundreds of thousands of deaths, a number which cannot be estimated at present and is certain to increase exponentially in time.” This arrest warrant is connected to the murder of Negros Oriental Governor Roel Degamo. A Philippine government source said “Bill Gates and David Rockefeller Jr. are involved. More threats/assassination attempts are being planned. The KM cabal is desperate for control of the Philippines.” Neither Mr, Gates nor Mr. Rockefeller were available for comment by the time this report went live. In any case, this financial turmoil and the accompanying threats were visible at last week’s G20 foreign ministers meeting which broke up without issuing a communique. This is highly unusual because usually, such meetings will paper over cracks by at least issuing a bland statement. “Some Western delegations turned the G20 agenda into a farce, trying to blame Moscow for their own economic failures,” Russian Foreign Minister Sergey Lavrov said. At the G20 countries like Brazil, India, China, Mexico, South Africa and Turkey asked for the “elimination of the Western monopoly” in international organizations. The Western countries responded with “blow-below-the-belt” tactics by threatening to “punish” countries that disobey, Lavrov said. That would explain the tsunami threats against Indonesia etc.. The head of Russia’s Security Council, Nikolay Patrushev went further saying Washington and its allies resort to “political pressure, military blackmail, financial enslavement, economic sanctions and, of course, deceitful propaganda,” This video below of slave camp conditions at a cobalt mine (needed to make mobile phones etc.) shows the kind of economic management the rest of the world is sick of. If the Western leadership was competent, people might be more willing to overlook their bullying but they are not. Their paranoid leadership has been repeatedly proven to spread disease, cause environmental disasters, and promote war. Just last Tuesday a Russian commander warned a train carrying a cargo of poisonous chemicals arrived in the city of Kramatorsk and that the United States is planning to use the “highly toxic and banned substances” in it to stage a “false flag” operation in Ukraine to blame on Moscow, Now we have Israel -that for 30 years has been saying Iran will get a nuclear bomb within three months- screaming “It would now take Iran just 12 days to produce a bomb’s worth of missile material.”, Not only do they keep trying to start an all-out nuclear war, but they have also been caught red-handed trying to kill most of the world’s population with toxic vaccines. Official data from the UK government shows that vaccines killed 24 times more people than the so-called pandemic they were supposed to protect them from. If you think this wasn’t premeditated, ask yourself why the exact authorities and manufacturers who mandated the Covid vaccine – were never required to get the jab! GESARA NESARA QFS Global Financial Reset – Everything is Changing – Trust The Plan! GESARA NESARA QFS Global Financial Reset – Everything is Changing – Trust The Plan! The Deep State do not want small businesses in America. Big corporations do want the competition for their new system. The system they are developing is the same system that Mussolini developed in Italy, it’s called fascism. Inflation is one way of getting rid of the old corrupt system and ushering in a news people’s system. This is what we are witnessing right now. The Quantum Financial System is coming, XRP and XLM – digital assets are here to stay whether you like it or not. The XRPQFS Manual is intended for the new user who knows nothing about Nesara – Gesara, XRP and digital assets. The game always been rigged. Most people invest their money/savings in the stock market with financial institutions who offers investments packages to BUY in the market. MOST people can’t SHORT/SELL the market. So when it drops and we’re in a down trend 95% of normal people are losing it all as they can’t SHORT/Sell the market. Also: QFS, GCR, Med Bed Intel ~ Step Out of The Matrix and Into The Golden Age ~ Trust The Plan! – https://amg-news.com/qfs-gcr-med-bed-intel-step-out-of-the-matrix-and-into-the-golden-age-trust-the-plan/", "opengraph": {"locale": "en_US", "type": "article", "title": "Benjamin Fulford — March 6th 2023: Entire KM financial system about to collapse with Credit Suisse the likely first domino - American Media Group", "description": "Benjamin Fulford — March 6th 2023: Entire KM financial system about to collapse with Credit Suisse the likely first domino", "url": "https://amg-news.com/benjamin-fulford-march-6th-2023-entire-km-financial-system-about-to-collapse-with-credit-suisse-the-likely-first-domino/", "site_name": "American Media Group", "article:author": "https://www.facebook.com/medeea23greere", "article:published_time": "2023-03-06T19:20:03+00:00", "image": "https://amg-news.com/wp-content/uploads/2023/03/Fara-titlu-2.png", "image:width": "1486", "image:height": "1004", "image:type": "image/png"}, "tags": ["Financial System", "Khazarian Mafia"], "tweets": [], "movies": [], "links": ["https://t.me/AMGNEWS2022", "https://amg-news.com/khazaria-rothschild-dynasty-new-world-order-ukraine-and-implementation-of-the-nephilim-agenda/", "https://0879fafyl0cnin8g57h8vyeyav.hop.clickbank.net/?tid=AMG0603FULL", "https://amg-news.com/khazaria-rothschild-dynasty-new-world-order-ukraine-and-implementation-of-the-nephilim-agenda/", "https://363146t6gzk0ju78t7-1q6rd09.hop.clickbank.net/?tid=AMG0603FULL", "https://amg-news.com/gesara-nesara-qfs-global-financial-reset-everything-is-changing-trust-the-plan-video/", "https://amg-news.com/qfs-gcr-med-bed-intel-step-out-of-the-matrix-and-into-the-golden-age-trust-the-plan/", "https://stillnessinthestorm.com/2023/03/benjamin-fulford-march-6th-2023-entire-km-financial-system-about-to-collapse-with-credit-suisse-the-likely-first-domino/", "https://t.me/AMGNEWS2022", "https://t.me/AMGNEWS2022"], "authors": ["Medeea Greere"], "publish_date": "2023-03-06T19:20:03+00:00"}