{"result_id": "025004", "URL": "https://amg-news.com/list-of-indictments-arrests-and-executions-dismantling-the-deep-state-operatives-and-doubles-2/", "timestamp": "2023-04-25 12:02:31 CEST+0200", "meta": {"description": "List of Famous People Arrested & Executed ‘The Movie’ – Dismantling the Deep State Operatives and Doubles: Kimmel, Oprah, Biden and More...", "lang": "en", "keywords": "", "favicon": "https://amg-news.com/wp-content/uploads/2021/09/cropped-AMG-mic-32x32.jpg", "canonical": "https://amg-news.com/list-of-indictments-arrests-and-executions-dismantling-the-deep-state-operatives-and-doubles-2/", "encoding": "UTF-8"}, "image": null, "domain": "amg-news.com", "title": "List of Famous People Arrested & Executed ‘The Movie’ – Dismantling the Deep State Operatives and Doubles: Kimmel, Oprah, Biden and More...", "cleaned_text": "List of Famous People Arrested & Executed ‘The Movie’ – Dismantling the Deep State Operatives and Doubles: Kimmel, Oprah, Biden and More…\n\nMedeea Greere, an independent publisher, is now on Telegram at https://t.me/AMGNEWS2022 and exists only on reader support as we publish Truth, Freedom and Love for public awareness. Thank You for your support!\n\nCollection Of Mind Blowing New Messages From Our Real 19th Vice President John F Kennedy Jr.\n\nUpdate List of Indictments, Arrests and Executions – Dismantling the Deep State Operatives and Doubles: Kimmel, Oprah, Biden and More…\n\nThis information will give you 20/20 vision to see through the Illusion of the Matrix.\n\nHere you will see some of ‘The Movie’ players/actors.\n\nBe sure to show this to your skeptic friends who say nothing is happening.\n\nAMG-NEWS has predicted for months arrests with accurate time lines of the Pope, Merkel, Trudeau, Joe Biden, Hillary Clinton, Obama, the Queen, Prince Andrew, Prince Charles and many more. You won’t find these types of prophecies anywhere. The Deep State keep deleting her channels and block uploads, but we keep going.\n\nARRESTS and EXECUTIONS of famous people have been a highly-controversial topic for months. Arrests and executions of famous people 2022 has been updated.\n\nRead this post before checking out the updated list of Arrests and Executions of Famous people.\n\nBrace Yourselves…The Storm Has Arrived! You Just Have to Know Where to Look:\n\nBill & Melinda Gates have been arrested and executed. When you see them on social media, you are seeing clones and doubles.\n\nIntel says Bill and Melinda Gates were in India in 2013 giving children vaccinations and many died, or were left paralyzed, because of the Gates vaccine. People who had their children die by this “vaccine” hanged Bill and Melinda Gates at the same time in July of 2013. They both died.\n\nThe persons they have on house arrest are not Bill and Melinda Gates. They are doubles.\n\nWHERE THEY GO ONE, THEY GO ALL… TO TRIBUNAL\n\nSOME OF THE FAMOUS PEOPLE ARRESTED HAD RESULTS CHANGED FROM WAITING FOR TRIBUNAL TO EXECUTION OR LIFE IN PRISON\n\nPEOPLE WHO ARE SERVING LIFE HAVE RECEIVED A PLEA DEAL. IF THEY VIOLATE THE TERMS OF THE DEAL THE DEATH SENTENCE WILL BE SERVED.\n\nThere are more people on the list of arrests and executions of famous people but no further intel is available at this time.\n\nBefore you scroll down to see the latest military tribunal arrests and executions of famous people in 2020, read this explanation.\n\nThe tribunals are arresting these people in plain clothes. We saw the Obama’s arrest, although we didn’t know it was an arrest at the time. The arrest was done nonchalantly so as to not get noticed by the public.\n\nAll arrests of these famous people were done this way. If the person is convicted of child sex trafficking, crimes against humanity or treason, they will be executed.\n\nIf the person arrested has evidence on someone else to help their prosecution, or is willing to help Trump, and they want to cooperate, they may be allowed to do so. A sentence of execution down to life in prison may be accepted if their evidence is worth anything.\n\nA document including some popular people involved in the 9/11 Attack.\n\nWhen a plea deal is done, the defendant must present evidence they have to make their sentence lighter. This information is given to the prosecution, defense, and to the judge. If the evidence is accepted, they are presented the plea deal. They will have to make a guilty plea to the crime with a video confession and written statement. That is how all plea deals work.\n\nAll famous people arrested were either treasonous or involved in satanic worship rituals. These rituals involved torturing children then murdering them as a sacrifice. Drinking the blood of children that contains adrenochrome is the drug these satanist famous people and politicians have been involved with for decades.\n\nCrimes against humanity call for death. Trump signed an Executive Order calling for the death penalty for anyone involved in crimes against humanity or treason. These famous people arrested in 2020 are to be given a tribunal and sentenced to execution or life in prison.\n\nIf the arrested were taking orders from the cabal and carrying out those orders, that is treason.\n\nObama said “I was only following orders.” Yeah, Obama followed orders of treason from the cabal. Obama made a plea deal and was let out for a time to help President Trump. Somewhere along the line, Obama violated the plea deal and was rearrested, put before a firing squad and shot in the back of the head.\n\nLying Big Mike (aka Michelle Obama) was executed shortly after. Obama turned over Big Mike to get a plea deal.\n\nCan you believe there are people out there who still don’t know who BIG MIKE is? This article is designed to give you a clear understanding of who exactly Michael La Vaughn Robinson is. Read the full article HERE: Join Me on Another Red Pill Journey – Enjoy The Show! (Must Watch) – American Media Group (amg-news.com)\n\nOnce arrests and executions of famous people (2020) are completed, these people have a double or clone. This was put in place by the white hats to make people think they are still around. This is so people who are are not awake yet to what is really going on in the world will not get angry or upset enough to start riots against the government for executing someone they loved.\n\nFans of Madonna or other celebrities will not be able to accept they have been lied to all their life. Believe it or not there are many democrats out there who still love the Obamas and are blind to what is going on.\n\nMichelle Obama has recently been on PBS reading books to children, appearing in one session. These videos were done with CGI. They are fake, known as deep fakes. The Obamas are dead.\n\nIf you see a video of a famous person who was arrested or executed, it is done by CGI (deep fake.) If the person is making a personal appearance, it will be a double or a clone.\n\nThe Pence you have seen on tv with Trump is a clone. Pence was arrested long ago after the coup he was involved in with Paul Ryan. If a person has died of covid19, that is code for they were arrested or executed.\n\nPATRIOT ALERTS: YOUR TRUMP TRB MEMBERSHIP HANDBOOK IS WAITING TO BE IN YOUR HAND:\n\nHarvey Weinstein turned over everyone in Hollywood\n\nHillary Clinton died the day she spoke at the 9/11 event and collapsed at the SUV when she was told she was under arrest. They rushed her to her daughter’s house because it is a medical facility for her. A double came out and said she was ok. This Hillary Clinton double was noticeably different in weight, being much thinner, and everyone commented on that.\n\nAt Chelsea’s place, Hillary Clinton was revived by very interesting technology using adrenochrome. She was given a tribunal and was executed. All video confessions are done in analog video .\n\nBy the way, GITMO is full. Some of the famous people who were arrested and on house arrest, or at GITMO, are still in the tribunal negotiating a deal.\n\nThere are many more famous people who have been arrested and executed who did not make this list. The following list of famous people arrested and executed includes the more popular names. There have been thousands of arrests.\n\nThere are no dates of arrests or executions of famous people because that info has not been released yet. Most of these people were charged with crimes against humanity, treason, or both.\n\nTHERE HAVE BEEN THOUSANDS OF ARRESTS AROUND THE WORLD. IT IS NOT POSSIBLE TO LIST THEM ALL\n\nALSO: Guantanamo Bay Detention Camp Arrests, Indictments and Executions for Thousands of New Ex-Elite Prisoners – Official Documents\n\nMust-Read: Updated List of Indictments, Arrests and Executions – Dismantling the Deep State Operatives and Doubles\n• None ANTHONY FAUCI ARRESTED & RELEASED FOR A TIME TO HELP TRUMP\n• None All Royalties have either been removed, arrested, or executed around the world\n• None All Prime Ministers have been removed, arrested or executed around the world with the exception of Poland\n\nDemocrats are the problem, they are criminals. Some are arrested already. what you see are doubles. Court records list all who were arrested and executed. Facts not Lies.\n\nThe list of arrests and executions of famous people should be released early 2022 to the public. If you have any other info on Arrests and executions of famous people 2021, please share in the comments below.\n\nBrace Yourselves…The Storm Has Arrived! You Just Have to Know Where to Look!\n\nGovernment Shutdown – 911 Tribunals at GITMO – White Hats in Control – Comeback Bigger Than Setback\n\nThe news cycle is so wild I’m about ready to vibrate into a different dimension this is getting so exciting. Check out the September timeline, was Christ born on September 11th? Don’t miss Great Awakening Video compilation to help you make sense of what is going on right now!\n\n9/11 Tribunals at GITMO Media invite first time ever, will this expose CIA & Mossad for 9/11?\n\nWhat’s this a new movie on Diana called Spencer? List of vaccine nasty ingredients exposed on CDC website.\n\nDisclaimer: The views expressed in this article may not represent the official views of Medeea Greere or the American Media Group. Stories filed under Opinion contain information from various sources that may be both, verified and unverified. Medeea Greere and the American Media Group do not make any claims as to the validity of the information expressed in the opinion section, however we do encourage the reader to do further research on their own and we hope that you will share your findings with us. The mission for the truth requires a collective effort.", "opengraph": {"locale": "en_US", "type": "article", "title": "List of Famous People Arrested & Executed ‘The Movie’ – Dismantling the Deep State Operatives and Doubles: Kimmel, Oprah, Biden and More... - American Media Group", "description": "List of Famous People Arrested & Executed ‘The Movie’ – Dismantling the Deep State Operatives and Doubles: Kimmel, Oprah, Biden and More...", "url": "https://amg-news.com/list-of-indictments-arrests-and-executions-dismantling-the-deep-state-operatives-and-doubles-2/", "site_name": "American Media Group", "article:author": "https://www.facebook.com/medeea23greere", "article:published_time": "2023-01-11T15:10:20+00:00", "article:modified_time": "2023-03-05T11:53:13+00:00", "image": "https://amg-news.com/wp-content/uploads/2021/03/Untitled-238.png", "image:width": "974", "image:height": "505", "image:type": "image/png"}, "tags": ["Deep State", "Executions", "List of Indictments", "Arrests", "PizzaGate"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "788", "height": "443", "embed_code": "<iframe loading=\"lazy\" title=\"TW: On Seeing CSA &amp; Snuff Images of Myself In Mk Ultra &amp; the Crippling Guilt of Throwing Them Away\" width=\"788\" height=\"443\" src=\"https://www.youtube.com/embed/SjCH1PCOTbw?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/SjCH1PCOTbw?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "788", "height": "443", "embed_code": "<iframe loading=\"lazy\" title=\"Trump signs order to keep Guantanamo Bay prison open\" width=\"788\" height=\"443\" src=\"https://www.youtube.com/embed/L5npjgzV-e8?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/L5npjgzV-e8?feature=oembed"}], "links": ["https://t.me/AMGNEWS2022", "https://amg-news.com/archives/10052", "https://b3557gq4nzmqfl6s22maqbnzcv.hop.clickbank.net/?tid=AMG1101exec1", "https://363146t6gzk0ju78t7-1q6rd09.hop.clickbank.net/?tid=AMG1101exec", "https://amg-news.com/archives/11716", "https://9dac4eq8j5in4q2dd8m2xcvpio.hop.clickbank.net/?tid=AMG1101exec1", "https://amg-news.com/boom-the-hillary-child-sex-tape-is-worse-than-you-can-imagine-the-satanic-syndicate-graphic-disturbing-content/", "https://4fbac8kyo9hsdp46ffj-0epz6q.hop.clickbank.net/?tid=AMG1101exec", "https://amg-news.com/collection-of-mind-blowing-new-messages/", "https://0879fafyl0cnin8g57h8vyeyav.hop.clickbank.net/?tid=AMG1101exec2", "https://20443iiznzby5z6ktalw028za7.hop.clickbank.net/?tid=AMG1101exec", "https://amg-news.com/guantanamo-bay-detention-camp-arrests-indictments-and-executions-for-thousands-of-new-ex-elite-prisoners-official-documents/", "https://amg-news.com/archives/10052", "https://3f39fan1j4ewcp4ns5pevby486.hop.clickbank.net/?tid=AMG1101exec", "https://amg-news.com/government-shutdown-911-tribunals-at-gitmo-white-hats-in-control-comeback-bigger-than-setback-video/", "https://t.me/AMGNEWS2022", "https://t.me/AMGNEWS2022"], "authors": ["Medeea Greere"], "publish_date": "2023-01-11T15:10:20+00:00"}