{"result_id": "025026", "URL": "https://amg-news.com/military-tribunals-at-gitmo-dark-to-light-the-great-awakening-government-shutdown-comeback-bigger-than-setback-white-hats-in-control-game-ov/", "timestamp": "2023-04-25 12:03:04 CEST+0200", "meta": {"description": "Military Tribunals at GITMO – Dark To Light – The Great Awakening – Government Shutdown – Comeback Bigger Than Setback – White Hats in Control – Game Over!", "lang": "en", "keywords": "", "favicon": "https://amg-news.com/wp-content/uploads/2021/09/cropped-AMG-mic-32x32.jpg", "canonical": "https://amg-news.com/military-tribunals-at-gitmo-dark-to-light-the-great-awakening-government-shutdown-comeback-bigger-than-setback-white-hats-in-control-game-ov/", "encoding": "UTF-8"}, "image": null, "domain": "amg-news.com", "title": "Military Tribunals at GITMO – Dark To Light – The Great Awakening – Government Shutdown – Comeback Bigger Than Setback – White Hats in Control – Game Over!", "cleaned_text": "Military Tribunals at GITMO – Dark To Light – The Great Awakening – Government Shutdown – Comeback Bigger Than Setback – White Hats in Control – Game Over!\n\nMedeea Greere, an independent publisher, is now on Telegram at https://t.me/AMGNEWS2022 and exists only on reader support as we publish Truth, Freedom and Love for public awareness. Thank You for your support!\n\nThe news cycle is so wild I’m about ready to vibrate into a different dimension this is getting so exciting. Check out the September timeline, was Christ born on September 11th? Don’t miss Great Awakening Video compilation to help you make sense of what is going on right now!\n\n9/11 Tribunals at GITMO Media invite first time ever, will this expose CIA & Mossad for 9/11?\n\nWhat’s this a new movie on Diana called Spencer? List of vaccine nasty ingredients exposed on CDC website.\n\nExecutive Order 13848—Imposing Certain Sanctions in the Event of Foreign Interference in a United States Election\n\nRemember if White hats were not in control, the Deep State / Cabal under Biden would have removed the following Executive Orders:\n\nBlocking the Property of Persons Involved in Serious Human Rights Abuse or Corruption\n\nImposing Certain Sanctions in the Event of Foreign Interference in a United States Election\n\nAddressing the Threat From Securities Investments That Finance Communist Chinese Military Companies\n\nTrump and White hats are letting the pyramid implode from the inside out. Breaking the structure to collapse the entire matrix. Slowly but surely.\n\nEveryone remember when HRC Clone/Double had seizures over wanting you to try a cold chai?\n\n⇒ UPDATED – The Executed: Clones, Doubles, Actors, Transvestites Hiding in Plain Sight, Holographic or CGI\n\nCold Chai = 98 = 17 = Q\n\n 33 = Age of Jesus When He Died – 33 Degree FreeMason\n\n 55 = Loud and Clear – JFK Jr.\n\nMilitary Tribunals – Dark To Light – The Great Awakening – Game Over\n\nFor some light reading with family and friends don’t forget to review President Trumps proclamations by year, also gently remind them he works for free, has no wrinkles and claims to be the chosen one. Trump asked the African American community what they had to lose by voting for him? I believe people can clearly see what they have to lose with the Biden’s administration debacle completely exposed which was the entire point. You have to show the people you can not tell the people.\n\nWe do not support identity politics, African Americans are Americans to us, everyone knows your skin colour is meaningless, it’s your character that matters and living in the present. If you think about your past you will be depressed, if you worry about the future you will be anxious, live in the present moment, give your worries to God and enjoy.\n\nLooks like Juan O Savin’s prediction that the world would understand what a monster Joe Biden truly is and NO ONE will ever admit that they voted for him or ever liked that creature. You know what else Juan O Savin predicted? He said last year would be the LAST Christmas anyone ever called you a conspiracy theorist again.\n\nWell well well – looks like everything is falling into place nicely. You didn’t think full 911 disclosure went away did you? If you’re still under the delusion that Osama Bin Laden (Obama and Biden Bin Lying) took down 3 buildings with 2 planes – you have some serious work to do. Suggestion: Unplug your TV immediately and seek out your nearest conspiracy theorist.\n\nYou didn’t think Epstein “suicide” went away did you? You didn’t buy the old OJ Simpson murder HOAX did you? How about the COVID hoax? Heads up it’s a common cold which is your own bodies way of detoxing. Look up exosomes. That’s it.\n\nGame Over YOUR RESPONSIBLE FOR YOUR HEALTH NO ONE ELSE IS AND NO ONE IS COMING TO SAVE YOU, least of all a mask or a vaccine which is useless, now you need triple booster shots, that will never end, masks, quarantine, NEXT triple set of depends cuz you can catch COVID from a fart, let me help you onto this box car, show us your papers!!! It’s for your safety!!!!\n\nIf you are still getting your DATA DUMP from the TV it’s a sewage pipe of propaganda directly from China that is getting pumped directly into your head.\n\nThere is no debate, they’ve admitted it. Operation Mockingbird Media CIA = Clowns In America – Who owns the CIA? Mossad?\n\nRelated: Execution and Arrests From June-Sept: List of Indictments, Arrests and Executions – Dismantling the Deep State Operatives and Doubles\n\nNDP Leader Jagmeet Singh says he is going to fight COVID, you know the virus they never isolated.\n\nSo here we have NDP, Conservative and Liberal all saying no matter who you vote for they all want to fight COVID = mandate vaccinations which will never end.\n\nThis means they are all globalist assholes and this has nothing to do with health and everything to do with control.\n\nThey would have shut down all junk food joints, liquor stores, pot shops and convinced us to eat healthy and get some exercise instead of selling fear, masks, quarantine, vaccines, boosters, hand sanitizer – all garbage. Come on now.\n\nPPC is the only option for Canada. If you can’t see that, we can’t help you. What have you got to lose? EVERYTHING including your FREEDOM hello.\n\nTRENDING: PREMIUM Gold Smart Trump Card. This is NOT just another no-use, memorabilia card! This is a Unique, Exclusive, Functional, SMART Card that has great benefits. Premium Packaging – Every Card has it’s own box to keep it safe!\n\nPINK TOWEL HEAD = ADRENOCHROME – This one is banned from India because he has ties to terrorists. Canada come on in and run one of the fake globalist parties for CanaDUH.\n\nDisgusting each globalist party joins this terrorist to combat COVID. If you were so worried about COVID you never would have called an election during this plandemic.\n\n264 = MY MY MOST AMUSING\n\n264 = MY NAME IS POPE FRANCISCUS\n\n264 = THINK ITS COOL TO BE EVIL\n\nWhy Satanists may be the last hope to take down Texas’s Abortion bill\n\nSatanists LOL – The state of Texas, with approval from the U.S. Supreme Court, instituted the most draconian set of anti-abortion laws in the last 50 years this Tuesday. While pro-choice advocates scramble to save what’s left of Roe v. Wade, their salvation may come from an unexpected place: the Satanic Temple.\n\n\n\n The nontheistic religious group, based out of Salem, Massachusetts, has filed a letter with the U.S. Food and Drug Administration arguing that their members should be allowed to access abortion pills without regulatory action. The temple is attempting to use its status as a religious organization to claim its right to abortion as a faith-based right.\n\nDo You Know What is in a Vaccine?\n\n“I gathered all vaccine ingredients into a list and contacted Poison Control. After intros and such, and asking to speak with someone tenured and knowledgeable, this is the gist of that conversation.\n\nMe: My question to you is how are these ingredients categorized? As benign or poison? (I ran a few ingredients, formaldehyde, Tween 80, mercury, aluminum, phenoxyethanol, potassium phosphate, sodium phosphate, sorbitol, etc.)\n\nHe: Well, that’s quite a list. But I’d have to easily say that they’re all toxic to humans, used in fertilizers, pesticides., to stop the heart, to preserve a dead body. They’re registered with us in different categories, but pretty much poisons. Why?\n\nMe: If I were deliberately to feed or inject my child with these ingredients often, as a schedule, obviously I’d put my daughter in harm’s way. But what would legally happen to me?\n\nHe: Odd question, but you’d likely be charged with criminal negligence, perhaps with intent to kill and of course child abuse. Your child would be taken away from you. Do you know of someone’s who’s doing this to their child? This is criminal.\n\nMe: An industry. These are the ingredients used in vaccines with binding agents to make sure the body won’t flush these out to keep the antibody levels up indefinitely.\n\nHe: WHAT?! Your conclusion?\n\nThe man was beside himself. He asked if I would email him all this information. He wanted to share it with his adult kids who are parents. He was horrified and felt awful he didn’t know his kids are vaccinated and they all have health issues.”\n\nBest Explanation I’ve Seen About Why the Covid Jabs Are Killer Shots\n\nThrone Has Changed in Canada – Where Else Has it Changed and Who Else Submitted to Trump?\n\nMust-Read: The Great Awakening: We are Witnessing the Destruction of The Old Guard \n\n\n\nTrump’s Devolution: The Most Astonishing Military Operation of All -Time! Unprecedented Warfare!\n\nSo before we get started, let us first understand that before Trump was POTUS GITMO (Guantanamo Bay Detention Camp) was a fraction of the size it now is. This can be clearly confirmed by the following visuals, identifying a significant amount of expansion for what is expected to be tens of thousands of new ex-elite prisoners. Well, those who are not executed via military tribunal at least.\n\nNow, if you are not aware of these indictments I am referring to, that makes perfect sense because they are still sealed and not yet public knowledge…\n\nQ – 1776 – DRAIN THE SWAMP – WE THE PEOPLE – MAGA – MEGA – THE BEST IS YET TO COME – HOLD THE LINE – BUCKLE UP – NCSWICN\n\nQ Mystery Book | Where We Go One, We Go All! Do you want to know Who Is Behind QAnon?\n\nAccording to the New-York Times, using machine learning, deep learning, stylometry, and statistics on Q texts, two separate teams of NLP researchers from France and Swiss have identified the same two men as likely authors of messages that fueled the QAnon movement.\n\nFirst the initiator, Paul Furber, a South African software developer and then Ron Watkins took over, who operated 8chan website where the Q messages began appearing in 2018 and is now running election for Republican in Arizona.\n\nDoes America really have a national security “deep state”?\n\nThere are parts of the US government that wield real power outside the conventional checks and balances of the system!\n\nIs there a case for a more robust deep state, especially when the power of the American presidency keeps growing? Is it necessarily bad to have an alternative check on the executive?\n\nFor the Deep State, Trump Was Never President ?\n\nDisclaimer: The views expressed in this article may not represent the official views of Medeea Greere or the American Media Group. Stories filed under Opinion contain information from various sources that may be both, verified and unverified. Medeea Greere and the American Media Group do not make any claims as to the validity of the information expressed in the opinion section, however we do encourage the reader to do further research on their own and we hope that you will share your findings with us. The mission for the truth requires a collective effort.", "opengraph": {"locale": "en_US", "type": "article", "title": "Military Tribunals at GITMO – Dark To Light – The Great Awakening – Government Shutdown – Comeback Bigger Than Setback – White Hats in Control – Game Over! - American Media Group", "description": "Military Tribunals at GITMO – Dark To Light – The Great Awakening – Government Shutdown – Comeback Bigger Than Setback – White Hats in Control – Game Over!", "url": "https://amg-news.com/military-tribunals-at-gitmo-dark-to-light-the-great-awakening-government-shutdown-comeback-bigger-than-setback-white-hats-in-control-game-ov/", "site_name": "American Media Group", "article:author": "https://www.facebook.com/medeea23greere", "article:published_time": "2023-04-14T10:13:00+00:00", "article:modified_time": "2023-04-14T12:13:32+00:00", "image": "https://amg-news.com/wp-content/uploads/2023/01/Military-Tribunals-at-GITMO-–-Dark-To-Light-–-The-Great-Awakening-–-Government-Shutdown-–-Comeback-Bigger-Than-Setback-–-White-Hats-in-Control-–-Game-Over.png", "image:width": "1106", "image:height": "600", "image:type": "image/png"}, "tags": ["Deep State", "GITMO", "Cabal", "Hillary Clinton", "Joe Biden", "Great Awakening", "Donald Trump", "Barack Obama", "Guantanamo Bay", "Military Tribunals", "doubles and clones", "White Hats", "Arrests and Execution"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "788", "height": "591", "embed_code": "<iframe loading=\"lazy\" title=\"Children recite KITE, HIT, STEEL, PLANE, MUST\" width=\"788\" height=\"591\" src=\"https://www.youtube.com/embed/lEqeELMXsyo?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/lEqeELMXsyo?feature=oembed"}], "links": ["https://t.me/AMGNEWS2022", "https://rumble.com/user/MedeeaGreere", "https://amg-news.com/category/guantanamo-bay/", "https://amg-news.com/list-of-indictments-arrests-and-executions-dismantling-the-deep-state-operatives-and-doubles/", "https://0879fafyl0cnin8g57h8vyeyav.hop.clickbank.net/?tid=AMG1404GTM1", "https://amg-news.com/the-executed-clones-doubles-actors-transvestites-hiding-in-plain-sight-holographic-or-cgi/", "https://amg-news.com/the-executed-clones-doubles-actors-transvestites-hiding-in-plain-sight-holographic-or-cgi/", "https://363146t6gzk0ju78t7-1q6rd09.hop.clickbank.net/?tid=AMG1404GTM2", "https://amg-news.com/execution-and-arrests-from-june-sept-2020-list-of-indictments-arrests-and-executions-dismantling-the-deep-state-operatives-and-doubles/", "https://18460er1jzow4wb8yjo0djdwdh.hop.clickbank.net/?tid=AMG1404GTM3", "https://4fbac8kyo9hsdp46ffj-0epz6q.hop.clickbank.net/?tid=AMG1404GTM", "https://amg-news.com/guantanamo-bay-detention-camp-arrests-indictments-and-executions-for-thousands-of-new-ex-elite-prisoners-official-documents/", "https://amg-news.com/the-great-awakening-we-are-witnessing-the-destruction-of-the-old-guard/", "https://363146t6gzk0ju78t7-1q6rd09.hop.clickbank.net/?tid=AMG1404GTM5", "https://amg-news.com/guantanamo-bay-detention-camp-arrests-indictments-and-executions-for-thousands-of-new-ex-elite-prisoners-official-documents/", "https://rumble.com/v1a14m5-nothing-can-stop-whats-coming-.html?mref=jqf7z&mc=7s8cc", "https://amg-news.com/must-watch-q-1776-drain-the-swamp-we-the-people-maga-mega-the-best-is-yet-to-come-hold-the-line-buckle-up-ncswicn/", "https://t.me/AMGNEWS2022", "https://t.me/AMGNEWS2022"], "authors": ["Medeea Greere"], "publish_date": "2023-04-14T10:13:00+00:00"}