{"result_id": "025017", "URL": "https://amg-news.com/your-digital-identity-will-be-your-digital-prison-why-you-may-soon-find-yourself-in-digital-prison/", "timestamp": "2023-04-25 12:02:51 CEST+0200", "meta": {"description": "Your Digital Identity Will Be Your ‘Digital Prison’ | Why You May Soon Find Yourself in ‘Digital Prison’", "lang": "en", "keywords": "", "favicon": "https://amg-news.com/wp-content/uploads/2021/09/cropped-AMG-mic-32x32.jpg", "canonical": "https://amg-news.com/your-digital-identity-will-be-your-digital-prison-why-you-may-soon-find-yourself-in-digital-prison/", "encoding": "UTF-8"}, "image": null, "domain": "amg-news.com", "title": "Your Digital Identity Will Be Your ‘Digital Prison’ | Why You May Soon Find Yourself in ‘Digital Prison’", "cleaned_text": "Your Digital Identity Will Be Your ‘Digital Prison’ – Why You May Soon Find Yourself in ‘Digital Prison’! Your Digital Prison Is Pretty Much Built, & Will Be The Final Lockdown.\n\nMedeea Greere, an independent publisher, is now on Telegram at https://t.me/AMGNEWS2022 and exists only on reader support as we publish Truth, Freedom and Love for public awareness. Thank You for your support!\n\nAn international vaccine passport, digital identity, a social credit system and a central bank digital currency (CBDC) form a digital control system that will lock down the population in perpetuity.\n\n Facial recognition is an essential part of the control structure, as it’s the “password” to your digital identity.\n\nBy the end of 2022, there will be 1 billion data-collecting surveillance cameras in the world, all connected to the internet and artificial intelligence (AI). Cameras and audio recording devices in cell phones, automobiles and smart appliances also collect and share data.\n\nAll these data are then used to give each person an individual score, based on their behavior, expression and interaction with the world. Ultimately, your social credit score, will dictate what you can and cannot do, what you can buy and where you can go.\n\nAI is an absolutely crucial component, without which the control system cannot work. The easiest way to push against this system is to starve AI of data by refusing to use technologies that collect and share your personal data.\n\nIn the video below, Maria Zeee with ZeeeMedia interviews computer scientist Aman Jabbi about the coming international vaccine passport, digital identity, the social credit system being built in the West and CBDCs.\n\nAll these factors are now coming together to control the global population. As noted by Zeee, this digital prison, which is already mostly built, will be the final lockdown of mankind.\n\nYour digital identity will be your digital prison\n\nIn the video, Jabbi goes through a presentation that explains the digital prison that is your digital identity — in other words, how your digital identity ties in with the coming social credit system and will control what you can and cannot do in your everyday life.\n\nAs noted by Jabbi, surveillance cameras with facial recognition software have already been erected around the world. They are an essential part of the control structure, and this surveillance will be linked together with digital identity, the social credit score system, carbon footprint tracking, CBDCs and more.\n\nFacial recognition has been sold as a great convenience and security feature. With facial recognition, you don’t need to remember pins or passwords, and since no one has your exact face, it’s supposed to keep your personal accounts more secure.\n\nBut, as with most other technologies sold under the guise of convenience and security, facial recognition is ultimately a tool for mass control and an essential part of your individual digital prison. As explained by Jabbi, the Chinese control system is based on facial recognition in combination with a social credit system.\n\nHe describes the Chinese social credit system as a feedback system that responds based on your behavior. Unbeknownst to most Westerners, an identical system has already been set in motion behind the scenes in Western countries — they just haven’t told you yet.\n\nBy the end of 2022, there will be 1 billion data collecting surveillance cameras in the world, all connected to the internet and AI. The U.S. actually has the most surveillance cameras per capita. China is in second place and the U.K. is in third.\n\nIn addition to all of that data collection, cameras and audio recording devices in cell phones, automobiles and smart appliances also collect and share data, even when you’re at home.\n\nAll these data are then used to give each person an individual score based on their behavior, expression and interaction with the world. Ultimately, that score — your social credit score — will dictate what you can and cannot do, what you can buy and where you can go.\n\nAs noted by Jabbi, there are also additional control mechanisms already built into the hardware being erected. For example, many smart light poles have built-in charging stations for drones, which in the future will be used for law and behavioral enforcement purposes. We will largely be policed by AI and machines.\n\nThese smart light poles can also be weaponized. Built-in are LED incapacitators. Sometimes referred to as “puke rays” for their ability to induce severe nausea, LED incapacitators are weapons designed like a flashlight that emit an extremely bright, rapid and well-focused series of “differently-colored random pulses.”\n\nAccording to Jabbi, these lights can also induce brain damage, spinal damage, sickness and likely even death.\n\nLED combined with radar on some smart poles can also be used to identify people carrying guns, and could theoretically be used as a weapon to selectively take out people carrying weapons.\n\nA new chapter in the ‘social contract’\n\nDigital identity has been described by the World Economic Forum (WEF) as a new chapter in the social contract. The problem, as noted by Jabbi, is that the WEF’s new social contract is one that none of us has agreed to. It’s being revised by the WEF and its allies and thrust upon the rest of us, without our consent.\n\nThe vast majority of people don’t even know what this new social contract actually entails, or how it will affect their personal day-to-day lives and individual decision-making ability.\n\nThat, for obvious reasons, has never been fully delineated because, if fully understood by everyone, virtually no one on earth would accept it. After all, few people with normal intelligence relish having their lives dictated by someone else.\n\nAs shown in the graphic above, your digital identity will be required to unlock all aspects of life, from logging onto the internet to accessing social services, travel, food, shopping and financial services. If your social credit score is too low, one or more of these aspects can be turned off and made unavailable to you.\n\nYour digital identity is confirmed through facial recognition, and is tied to your social score, carbon footprint score and CBDCs. As your social and carbon footprint scores go down, so does your purchasing ability.\n\nAs noted by Zeee, the international vaccine passport proposed at the 2022 G20 meeting is, at least right now, THE key to the entire effort to get everyone into the digital ID system. So, preventing the adoption of vaccine passports is a central component of resistance to the digital prison system in its entirety.\n\nYou must also reject the vaccine passport unless you’re willing to be a medical lab rat for the rest of your life. Zeee cites documents stating 500 new vaccines will be ready by 2030 that target most common diseases.\n\nIt is likely that having an up-to-date vaccination status will be one of the requirements to maintain a valid passport, which will also serve as your digital identity.\n\nIn other words, vaccine refusal can be used to nullify or “lock” your digital ID, leaving you unable to do, go or buy anything. The question is, what will those vaccines be? Basically, you’ll have no choice but to comply, even if you believe or know that a vaccine can injure or kill you, as is the case with the COVID-19 jabs.\n\nMOST IMPORTANT: YOU CAN COUNT ON PRESIDENT TRUMP DO NOT MISS YOUR GOLDEN CHANCE! VIDEO BELOW:\n\nAs explained by Jabbi, the new social contract created by the WEF and its allies is a zero-trust system.\n\nIn a physical prison, prisoners are under a zero-trust policy. In other words, the guards don’t trust the prisoners and there are security measures in place to make sure they behave. The new open-air prison system envisioned by the WEF is based on the same premise.\n\nEverywhere you go, you must prove who you are and that your compliance metrics are in alignment with the prevailing rules. So, to buy food, you have to not only identify yourself so that your purchase can be permanently logged as one of your purchases, but you also have to meet certain compliance standards, or else your CBDC won’t work.\n\nThe default in this system is denial, so everything you want to do — absolutely everything — must be unlocked by your digital ID. As noted by Jabbi,\n\nGeofencing and smart cities form the walls of your prison\n\nTo enforce your conditional access to life, geofencing will be used. Smart light poles equipped with LED incapacitators can be used to prevent you from going beyond your designated geofence, but there are also other geofencing mechanisms.\n\nFor example, your CBDC can be programmed to not work outside your district, and your smart car can be programmed to shut down past a certain perimeter. Jabbi also reviews the inexorable push toward smart cities, which will:\n\nJabbi cites a formula created by the WEF’s philosophical guru Yuval Noah Harrari, to describe technocrats’ ever-growing ability to hack humans: B x C x D = AHH.\n\nB stands for biological knowledge, C is computing power, D is data and AHH is the level of ability to hack a human being. As noted by Jabbi, the ability to hack humans is dependent on AI being fed a constant stream of data.\n\nIt’s a “beast system” in the sense that AI is the beast, and it needs to be fed. Its food is data, gathered through a vast array of data conduits such as cameras, recording devices, facial recognition, GPS and sensors of all kinds that make up the Internet of Bodies.\n\nAI is an absolutely crucial component for success of the digital prison. Without it, it cannot work. The answer then is to starve the beast, and we do this by withholding our data. “No amount of legislation can stop this,” he says, “it has to be done by the people.” In short, we must refuse to use the technologies that gather our data.\n\nWe won’t be able to avoid them all. Smart light poles and traffic cameras, for example, cannot be avoided unless you avoid certain areas, which could include your own street. But there are many we can avoid, such as smart watches, fitness trackers, smart thermostats, smart TVs, AI assistants and Ring surveillance cameras just to name a few.\n\nWe can also fight, on a local level, to prevent the expansion of facial recognition cameras and 5G, and we can refuse the coming vaccine passport and the push toward virtual reality.\n\nAs noted by Jabbi, one way in which people are surreptitiously led into the digital prison is by relying on apps that offer convenience, such as apps that allow you to order food or transportation.\n\nEventually, they’ll phase out apps on your phone and transfer them to virtual reality googles, so that you have to be in the virtual world in order to use them. It’s important to understand why this is done. It’s to force you deeper into the digital prison system, which includes digital clones and living much of your life in a virtual reality.\n\nAt present, China is being rocked by massive protests against the Zero-COVID policy that is used to imprison tens of millions of people in their homes for weeks on end. You’d think an American company like Apple would stand for American values like freedom but, no, it does not. It’s working with the Chinese government to quell dissent.\n\nAs reported by Bloomberg Nov. 9, Apple is limiting its iPhone file-sharing tool, restricting AirDrops from non-contacts to 10 minutes. The wireless file-sharing feature was used to share pictures and videos from the protests, thereby encouraging more people to join.\n\nAccording to Bloomberg, while the change was only made to phones sold in China, Apple says it plans to roll out the same limitation globally. Why? Are they predicting anti-government protests elsewhere?\n\nAccording to a Twitter user named Songpinganq, the video above shows iPhone workers clashing with police over the country’s Zero-COVID policy. In response, the Chinese government is alleged to have remotely switched all of the protesters’ COVID-19 passports to “red,” which prevents them from entering public spaces.\n\nIf they try to enter a building, for example — including residential complexes — an alarm will go off and they’ll be detained and escorted to a quarantine camp which, by the way, they have to pay for. That’s how easy it is for the government to eliminate undesirables from society once this kind of control system is in place.\n\nThe first video below is said to be from a Chinese quarantine camp. A health worker walks through the complex measuring the detainees’ body temperature. The second video shows the inside of a quarantine cubicle.\n\nThe world is starting to catch on\n\nThe good news is people around the world are starting to realize what’s happening.\n\nAs explained by legal philosopher Eva Vlaardingerbroek (video above), the reason there are now mass protests around Europe is because they’re realizing that the COVID-19 vaccine passport system rolled out in Europe is a control system that has no expiration date.\n\nThey’re realizing it’s meant to be permanent, and that it will be expanded.\n\nIn the video below, a young Chinese man describes how digital ID, CBDCs and the social credit system operate in China. By 2017, they already had the technology to automatically deduct fines from your account for infractions such as jaywalking, and the control network is only getting larger and more sophisticated.\n\nIs this what we want in the West? Is this what you want for your children and your grandchildren? If not, you need to participate in the movement to prevent it, and that starts with making changes in your own life to starve the beast of your personal data, and educating your family and friends about this necessity.\n\nDisclaimer: The views expressed in this article may not represent the official views of Medeea Greere or the American Media Group. Stories filed under Opinion contain information from various sources that may be both, verified and unverified. Medeea Greere and the American Media Group do not make any claims as to the validity of the information expressed in the opinion section, however we do encourage the reader to do further research on their own and we hope that you will share your findings with us. The mission for the truth requires a collective effort.", "opengraph": {"locale": "en_US", "type": "article", "title": "Your Digital Identity Will Be Your ‘Digital Prison’ | Why You May Soon Find Yourself in ‘Digital Prison’ - American Media Group", "description": "Your Digital Identity Will Be Your ‘Digital Prison’ | Why You May Soon Find Yourself in ‘Digital Prison’", "url": "https://amg-news.com/your-digital-identity-will-be-your-digital-prison-why-you-may-soon-find-yourself-in-digital-prison/", "site_name": "American Media Group", "article:author": "https://www.facebook.com/medeea23greere", "article:published_time": "2022-12-17T11:31:56+00:00", "image": "https://amg-news.com/wp-content/uploads/2022/12/Your-Digital-Identity-Will-Be-Your-‘Digital-Prison-Why-You-May-Soon-Find-Yourself-in-‘Digital-Prison.jpg", "image:width": "920", "image:height": "480", "image:type": "image/jpeg"}, "tags": ["Digital Prison", "COVID-19", "Global Surveillance"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">JUST IN – Chinese government remotely switched all the protesters's COVID passports to code red.</p>\n<p>Meanwhile Chinese iPhone factory workers clash with police as COVID protest turns violent. <a href=\"https://t.co/1u3xnTJ6wR\">https://t.co/1u3xnTJ6wR</a> <a href=\"https://t.co/5D3aT09EzP\">pic.twitter.com/5D3aT09EzP</a></p>\n<p>— Songpinganq (@songpinganq) <a href=\"https://twitter.com/songpinganq/status/1595456780557062144?ref_src=twsrc%5Etfw\">November 23, 2022</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">For those who don't know what china's covid quarantine camps looks like.<br/>This may help you…and you need to pay for your own isolation in china. <a href=\"https://t.co/7oUuF9dpTw\">pic.twitter.com/7oUuF9dpTw</a></p>\n<p>— Songpinganq (@songpinganq) <a href=\"https://twitter.com/songpinganq/status/1480157517485203463?ref_src=twsrc%5Etfw\">January 9, 2022</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">She's right <a href=\"https://t.co/1sV2VTt0wi\">pic.twitter.com/1sV2VTt0wi</a></p>\n<p>— june slater (Chief Gammon) (@juneslater17) <a href=\"https://twitter.com/juneslater17/status/1596657620357627904?ref_src=twsrc%5Etfw\">November 27, 2022</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Here’s a personal account of how digital ID / central bank digital currencies / social credit systems operate in China. </p>\n<p>Central banks and governments are nudging us towards this. We cannot let this happen. Wake up before it’s too late.  <a href=\"https://t.co/dOMpCXWiLs\">pic.twitter.com/dOMpCXWiLs</a></p>\n<p>— James Melville (@JamesMelville) <a href=\"https://twitter.com/JamesMelville/status/1597282329181159425?ref_src=twsrc%5Etfw\">November 28, 2022</a></p></blockquote>\n"], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "788", "height": "443", "embed_code": "<iframe loading=\"lazy\" title=\"Must Hear Interview: Your Digital Prison Is Pretty Much Built, &amp; Will Be The Final Lockdown\" width=\"788\" height=\"443\" src=\"https://www.youtube.com/embed/TgbNku6aAWY?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/TgbNku6aAWY?feature=oembed"}], "links": ["https://t.me/AMGNEWS2022", "https://8821d6s1g7ithn33s82rpfnneq.hop.clickbank.net/?tid=AMG1712DIGI1", "https://amg-news.com/cia-top-secret-list-of-8-million-names-who-will-be-rounded-up-when-martial-law-is-imposed-video/", "https://20443iiznzby5z6ktalw028za7.hop.clickbank.net/?tid=AMG1712DIGI2", "https://8efe57rzq1pthlbxwlx9reikbz.hop.clickbank.net/?tid=AMG1712DIGI", "https://88933efamcowbv7f2yqnm2l79a.hop.clickbank.net/?tid=AMG1712DIGI3", "https://amg-news.com/complete-list-of-1000-fema-concentration-camps-the-road-to-hell-nowhere-to-run-nowhere-to-hide/", "https://t.co/1u3xnTJ6wR", "https://t.co/5D3aT09EzP", "https://twitter.com/songpinganq/status/1595456780557062144?ref_src=twsrc%5Etfw", "https://20443iiznzby5z6ktalw028za7.hop.clickbank.net/?tid=AMG1712DIGI6", "https://t.co/7oUuF9dpTw", "https://twitter.com/songpinganq/status/1480157517485203463?ref_src=twsrc%5Etfw", "https://t.co/1sV2VTt0wi", "https://twitter.com/juneslater17/status/1596657620357627904?ref_src=twsrc%5Etfw", "https://t.co/dOMpCXWiLs", "https://twitter.com/JamesMelville/status/1597282329181159425?ref_src=twsrc%5Etfw", "https://t.me/AMGNEWS2022", "https://t.me/AMGNEWS2022"], "authors": ["Medeea Greere"], "publish_date": "2022-12-17T11:31:56+00:00"}