{"result_id": "025012", "URL": "https://amg-news.com/bombshell-official-documents-prove-anthony-fauci-bill-gates-are-responsible-for-developing-the-covid-virus-in-a-biolab/", "timestamp": "2023-04-25 12:02:43 CEST+0200", "meta": {"description": "BOMBSHELL! Official Documents prove Anthony Fauci & Bill Gates are responsible for developing the COVID Virus in a Biolab", "lang": "en", "keywords": "", "favicon": "https://amg-news.com/wp-content/uploads/2021/09/cropped-AMG-mic-32x32.jpg", "canonical": "https://amg-news.com/bombshell-official-documents-prove-anthony-fauci-bill-gates-are-responsible-for-developing-the-covid-virus-in-a-biolab/", "encoding": "UTF-8"}, "image": null, "domain": "amg-news.com", "title": "BOMBSHELL! Official Documents prove Anthony Fauci & Bill Gates are responsible for developing the COVID Virus in a Biolab", "cleaned_text": "BOMBSHELL! Official Documents prove Anthony Fauci & Bill Gates are responsible for developing the COVID Virus in a Biolab\n\nMedeea Greere, an independent publisher, is now on Telegram at https://t.me/AMGNEWS2022 and exists only on reader support as we publish Truth, Freedom and Love for public awareness. Thank You for your support!\n\nThe US government funded Peter Daszak’s ECO Health Alliance to the tune of $61,491,183 to make new coronaviruses that are infectious to humans.\n\nIt also directly or indirectly funds the Wuhan Institute of Virology to the tune of $7.4 million dollars to make new coronaviruses that are infectious to humans.\n\nMeanwhile, the National Institute of Allergy and Infectious Diseases funded Ralph Baric to the tune of $46,958,414 to make new coronaviruses that are infectious to humans.\n\nThis totals more than $114 million in the period from 2000 to 2020 to make new coronaviruses which are infectious to humans.\n\nThere is no question that SARS-CoV 2 (causing Covid-19) is man-made. Here’s the evidence…\n\nA Brief History of man-made pathogens designed by Baric, Daszak, Zhengli and Moderna and funded by Fauci, the NIH, the NIAID and the US Government to carry out the research necessary for the creation of SARS, MERS and Covid-19\n\n1984: Dr Anthony Fauci is appointed director of the NIAID (National Institute of Allergies and Infectious diseases) – There is an Orwellian Appointment for you.\n\n1986 July1: 1986 – 1999 funding amounts not specified and then funded by $1,987,840 over 7 years from 2000 to 2007 excluding 2002.\n\nNIAID (National Institute of Allergies and Infectious Diseases) funding Ralph Baric at the University of Nort Carolina, Chapel Hill.\n\nSubject: Mechanism of MHV Replication (Mouse Hepatitis Virus). This was the start of the partnership between Fauci and Baric.\n\n1999: U.S. Dept. of Health & Human Services (HHS) funds research amplifying the infectious character of Coronaviruses.\n\n1999: The Bill and Mellisa Gates Foundation set up GAVI (Global Alliance for Vaccines and Immunization) with a promise of $750 million in funding. So it was never going to be a bit part actor in the vaccine movie.\n\n2000: In May Ralph Baric successfully constructs a 28k base pair Coronavirus from smaller fragments by reverse transcription (making DNA from RNA) He makes an infectious TGE (Transmissible Gastroenteritis Virus – which is a type of Coronavirus) clone from isolated components of the genome. He files for US Patent 6,593,111 B2:\n\n2001: April 20: NIH Grant GM63228 funds Ralph Baric et al at the University of North Carolina at Chapel Hill to do Chimera research to transform the original SARS Coronavirus which was pathogenic only to animals, existing in nature as a pathogen for dogs and rabbits, to make it pathogenic to mankind targeting lung epithelial cells. The justification for this research was that it was supposedly designed as a vector virus to distribute HIV vaccines. This resulted in US patent application US28531801P\n\n2001 May21: Ralph Baric and Boyd Yount (Assigned to the University of North Carolina at Chapel Hill) file US Patent 6,593,111 B2 Directional Assembly of Large Viral Genomes and Chromosomes The Patent Office search report found: Lai, Michael M.C “The making of infectious viral RNA: No size limit in sight” PNAS vol 97 No 10, May 9, 2000 pp 5025-5027 And it found: Thiel et al “Infectious RNA transcribed in vitro from a cDNA copy of human coronavirus genome cloud in vaccinia virus 92: 1273-1261 (2001)\n\n2002: April 19: The University of North Carolina files US patent 7279327 for an infectious replication defective coronavirus (to be used as a virus vector for an HIV vaccine), claiming priority from US28531801P. Inventors were: Kristopher M. Curtis, Boyd Yount, Ralph S. Baric\n\n2002 November 16: The first case of an atypical pneumonia is reported in the Guangdong province in southern China.\n\n2003 February 25: First cases of unusual pneumonia reported in Hanoi, Vietnam.\n\n2003 February 28: WHO officer Carlo Urbani, MD, examines an American businessman with an unknown form of pneumonia in a French hospital in Hanoi, Vietnam.\n\n2003 March10: Urbani reports an unusual outbreak of the illness, which he calls sudden acute respiratory syndrome or SARS, to the main office of the WHO. He notes that the disease has infected an unusually high number of healthcare workers (22) at the hospital (in Hanoi, Vietnam).\n\n2003 March11: A similar outbreak of a mysterious respiratory disease is reported among healthcare workers in Hong Kong.\n\n2003 March15: WHO issues a heightened global health alert about the mysterious pneumonia with a case definition of SARS after cases in Singapore and Canada are also identified. The alert includes a rare emergency travel advisory to international travellers, healthcare professionals and health authorities.\n\n2003 March17: An international network of 11 leading laboratories is established to determine the cause of SARS and develop potential treatments.\n\n2003 March24: CDC officials present the first evidence that a new strain of a virus most frequently associated with upper respiratory infections and the common cold in humans called the coronavirus might be a likely cause of SARS.\n\n2003 March29: Carlo Urbani, who identified the first cases of SARS, dies as a result of the disease. Researchers later suggest naming the agent that causes the disease after the infectious disease expert.\n\n2003 April4: President George W. Bush adds SARS to the list of quarantinable diseases, which gives the CDC the authority to isolate persons who might have been exposed to the disease.\n\n2003 April12: Canadian researchers announce they have completed the first successful sequencing of the genome of the coronavirus believed to cause SARS.\n\n2003 April14: CDC officials announce their laboratories have sequenced a nearly identical strain of the SARS-related coronavirus. The CDC version includes an additional 15 nucleotides, which provides the important beginning of the sequence.\n\n2003 April16: A new form of a coronavirus never before seen in humans is confirmed as the cause of SARS according to Koch’s postulates, which are four specific conditions that must be met for a pathogen to be confirmed as a causal agent of disease.\n\n2003 April 25: CDC Patent filed and ultimately becomes US 7,220,852 (the patent on the RNA sequence) and 7,776,521 (the patent on the testing methodology). These patents give the U.S. Department of Health and Human Services the ability to control the commercial exploitation of SARS coronavirus.\n\n2003 July2: WHO removes Toronto, Canada from its list of areas with recent local SARS transmission after 20 days passed since the last SARS case was reported and isolated.\n\n2003 January26: Dr. Anthony Fauci appointed to the Bill and Melinda Gates Foundation’s Global Grand Challenges Scientific Advisory Board (served through 2010 – when he joined their Global Vaccine Action Plan).\n\n2006: Chinese researchers combine HCV, HIV-1, SARS-CoV-1 & SARS-CoV-2: Huang Q, Cheng Y, Guo Q, Li Q. Preparation of a Chimeric Armored RNA as a Versatile Calibrator for Multiple Virus Assays. Clinchem 2006; 52(7):1446-1448 and Supplement A.Inform1999200020022003.\n\n2007: NSF Grant IIS-0513650 (Italy, France and Indiana University) study addresses FIRST CRITICAL STEP to control a pandemic – shutdown International Travel. Given this knowledge why did Fauci tell Trump a Travel Ban was unnecessary?\n\n2009 April15: ModernaTX INC is incorporated in Delaware USA\n\n2010 August 6: Moderna (prior to its establishment) files U.S. Patent 9,447,164 which attracted the investment of (and “inventorship” for) venture capitalists at Flagship Ventures. This patent grew out of the work of Dr. Jason P. Schrum of Harvard Medical School supported by National Science Foundation Grant #0434507. While the application claims priority to August 2010, the application didn’t get finalized until October, 2015.\n\n2010 September21: Wildlife Trust is rebranded to become ECO Health Alliance under the directorship of Peter Daszak.\n\n2010: The World Health Organization (WHO), UNICEF, the National Institute of Allergy and Infectious Diseases (NIAID) and the Bill & Melinda Gates Foundation have announced a collaboration to increase coordination across the international vaccine community and create a Global Vaccine Action Plan.\n\n The Leadership Council is comprised of:\n\n2012-April2: Moderna claims priority to US201261618957P in its 5 patents cited below all of which refer to a double CGG codon Furin Cleavage site.\n\n2013: Baric and Chinese scientists isolate 3 coronaviruses from bats with HKU4 spike protein – unable to infect human cells. Yang Y…Baric RS, et al. Receptor usage and cell entry of bat coronavirus HKU4 provide insight into bat-to-human transmission of MERS coronavirus. PNAS 2014;111(34):12516-12521. Funded with NIH grants RO1AI089728 & R21AI109094.\n\n2015 :Dr. Zhengli et al “reengineered HKU4 spike aiming to build its capacity to infect human cells.” “To this end, we introduced two single mutations…mutations in these motifs in coronavirus spikes have demonstrated dramatic effects on viral entry into human cells.”\n\n2015: Baric and Zhengli announce they can make a more dangerous, virulent and infectious virus. Two Mutations Were Critical for Bat-to-Human Transmission of Middle East Respiratory Syndrome Coronavirus (MERS). J Virol.2015;89(17):9199-9123. Funded by NIH grants RO1AI089728, RO1AI110700.\n\n2015 July: South Korea had its last case of MERS. There were 2,494 confirmed laboratory cases and a total of 858 deaths in 27 countries; 80% of these cases came from Saudi Arabia. So the mortality rate for MERS was 34.4%. But it was not very transmissible. Infections were limited to family members, other hospital patients and health care workers who encountered MERS patients.\n\n2016 June2: Moderna files US9587003B2 referring to a double CGG codon Furin Cleavage site: Modified polynucleotides for the production of oncology-related proteins and peptides.\n\n2018: US Patent 7279327 for the chimeric adaption of the naturally occurring animal SARS Coronavirus to become infectious to humans targeting lung epithelial cells is transferred from University of North Carolina to he US National Institute for Health (NIH) – who funded it in the first place.\n\n2018 March 27: Peter Daszac and the Eco Health Alliance in 2018 submitted a proposal to DARPA to do gain of function research on SARS coronaviruses to insert is furin cleavage site (such as is found in HIV1) in an optimal position into the coronavirus gene. COVID-19 has a furin cleavage site optimally positioned to infect humans.\n\nOh dear. That really nails it. DARPA confirms that Peter Daszac of the Eco Health Alliance submitted a proposal on 2018March27 to add an HIV1 type furin cleavage site to SARS1. SARS CoV 2 has that furin cleavage site. In fact the double CGG codon Furin cleavage site is the main difference between Covid-19 and the Bat Coronavirus RaGT13. Fauci funded Wuhan through the Eco Health Alliance.\n\nHere is Peter Daszak admitting that he and Ralph Baric made new forms of SARS in the lab :", "opengraph": {"locale": "en_US", "type": "article", "title": "BOMBSHELL! Official Documents prove Anthony Fauci & Bill Gates are responsible for developing the COVID Virus in a Biolab - American Media Group", "description": "BOMBSHELL! Official Documents prove Anthony Fauci & Bill Gates are responsible for developing the COVID Virus in a Biolab", "url": "https://amg-news.com/bombshell-official-documents-prove-anthony-fauci-bill-gates-are-responsible-for-developing-the-covid-virus-in-a-biolab/", "site_name": "American Media Group", "article:author": "https://www.facebook.com/medeea23greere", "article:published_time": "2022-12-02T15:15:38+00:00", "image": "https://amg-news.com/wp-content/uploads/2022/12/0212.png", "image:width": "1135", "image:height": "744", "image:type": "image/png"}, "tags": ["Deep State", "COVID Virus", "Crimes Against Humanity", "Anthony Fauci", "Bill Gates"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "788", "height": "443", "embed_code": "<iframe loading=\"lazy\" title=\"Peter Daszak Created (Covid-19)\" width=\"788\" height=\"443\" src=\"https://www.youtube.com/embed/5mEuZBKJxVw?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/5mEuZBKJxVw?feature=oembed"}], "links": ["https://t.me/AMGNEWS2022", "https://88933efamcowbv7f2yqnm2l79a.hop.clickbank.net/?tid=AMG0212fauci", "https://8efe57rzq1pthlbxwlx9reikbz.hop.clickbank.net/?tid=AMG0212fauci", "https://8821d6s1g7ithn33s82rpfnneq.hop.clickbank.net/?tid=AMG0212fauci", "https://3f39fan1j4ewcp4ns5pevby486.hop.clickbank.net/?tid=AMG0212fauci", "https://20443iiznzby5z6ktalw028za7.hop.clickbank.net/?tid=AMG0212fauci", "https://685ffetas7cn8o34ulo80zbu3n.hop.clickbank.net/?tid=AMG0212fauci", "https://t.me/AMGNEWS2022", "https://t.me/AMGNEWS2022"], "authors": ["Medeea Greere"], "publish_date": "2022-12-02T15:15:38+00:00"}