{"result_id": "025038", "URL": "https://amg-news.com/a-warning-call-for-canadian-parents-over-96-canadian-children-ages-2-19-have-died-suddenly-or-unexpectedly-in-the-past-3-months/", "timestamp": "2023-04-25 12:03:21 CEST+0200", "meta": {"description": "A Warning Call for Canadian Parents: Over 96 Canadian children ages 2-19 have died suddenly or unexpectedly in the past 3 months", "lang": "en", "keywords": "", "favicon": "https://amg-news.com/wp-content/uploads/2021/09/cropped-AMG-mic-32x32.jpg", "canonical": "https://amg-news.com/a-warning-call-for-canadian-parents-over-96-canadian-children-ages-2-19-have-died-suddenly-or-unexpectedly-in-the-past-3-months/", "encoding": "UTF-8"}, "image": null, "domain": "amg-news.com", "title": "A Warning Call for Canadian Parents: Over 96 Canadian children ages 2-19 have died suddenly or unexpectedly in the past 3 months", "cleaned_text": "A Warning Call for Canadian Parents: Over 96 Canadian children ages 2-19 have died suddenly or unexpectedly in the past 3 months\n\nMedeea Greere, an independent publisher, is now on Telegram at https://t.me/AMGNEWS2022 and exists only on reader support as we publish Truth, Freedom and Love for public awareness. Thank You for your support!\n\nIn the August 2022 James Gill paper titled “Autopsy Histopathologic Cardiac Findings in 2 adolescents following the second COVID-19 vaccine dose” (click here), two teenage boys died in their sleep within the first week after receiving the 2nd Pfizer COVID-19 mRNA vaccine dose. Both boys were pronounced dead at home.\n\nSudden deaths of Canadian children have skyrocketed in recent months. I have tracked these deaths since November 2022, when healthy Canadian children began to die from influenza, strep, myocarditis, blood clots, strokes, sudden deaths while playing sports and sudden deaths in their sleep (!)\n\nI have been overwhelmed with the sheer number of these sudden deaths recently and this will be my last report of this kind.\n\nThe COVID-19 mRNA vaccine status in many of these tragic cases is unknown. Some of these children were mandated to have COVID-19 mRNA vaccines to play sports or attend University or College. While it is unknown in how many of these cases mRNA toxicity played a major factor, even ONE child death due to mRNA vaccine damage and injury, is one death too many.\n\nDue to the aggressive, unscientific and unethical rollout of COVID-19 mRNA vaccines in Canadian children in 2021 and 2022, parents must be on guard for COVID-19 mRNA vaccine toxicity, which has been implicated in severe damage to the immune system, heart, brain, kidneys, liver, endocrine system, reproductive organs, as well as autoimmune diseases and cancers.\n\nI believe that COVID-19 mRNA vaccine injury to the immune system played a major role in at least some of these deaths. 13 kids died from influenza, 4 from strep and 2 from meningitis (that we know of). Many provincial governments (including Ontario) refused to release any information on the deaths of children due to influenza in late 2022. The governments knew something was very wrong and they stayed quiet.\n\nWhat is even more alarming, however, are 56 sudden deaths in children ages 12-19. This is the age group that is dangerously over-vaccinated with COVID-19 mRNA, with 84% Canadian children having 1 dose and 80% having two doses.\n\nI believe COVID-19 mRNA vaccines are playing a major role in many of these sudden deaths of Canadian children ages 12-19, and this is a public health emergency that can no longer be ignored, and must be investigated immediately.\n\nDenmark, Sweden, Norway and Finland halted COVID-19 mRNA vaccines in children under 18 a long time ago. They clearly know something Canadian politicians and Canadian doctors don’t.\n\nCOVID-19 mRNA vaccines should never have been rolled out in Canadian children of any age. They must be halted immediately.", "opengraph": {"locale": "en_US", "type": "article", "title": "A Warning Call for Canadian Parents: Over 96 Canadian children ages 2-19 have died suddenly or unexpectedly in the past 3 months - American Media Group", "description": "A Warning Call for Canadian Parents: Over 96 Canadian children ages 2-19 have died suddenly or unexpectedly in the past 3 months", "url": "https://amg-news.com/a-warning-call-for-canadian-parents-over-96-canadian-children-ages-2-19-have-died-suddenly-or-unexpectedly-in-the-past-3-months/", "site_name": "American Media Group", "article:author": "https://www.facebook.com/medeea23greere", "article:published_time": "2023-03-01T11:45:43+00:00", "article:modified_time": "2023-03-01T11:47:21+00:00", "image": "https://amg-news.com/wp-content/uploads/2023/03/1.jpg", "image:width": "1233", "image:height": "905", "image:type": "image/jpeg"}, "tags": ["Died Suddenly"], "tweets": [], "movies": [], "links": ["https://t.me/AMGNEWS2022", "https://substack.com/profile/45787643-dr-william-makis-md", "https://makismd.substack.com/p/over-96-canadian-children-ages-2?", "https://t.me/AMGNEWS2022", "https://t.me/AMGNEWS2022"], "authors": ["Medeea Greere"], "publish_date": "2023-03-01T11:45:43+00:00"}