{"result_id": "025030", "URL": "https://amg-news.com/a-nation-of-sheep-more-and-more-evidence-that-us-plans-to-lockdown-and-wait-for-a-vaccine-date-from-2007/", "timestamp": "2023-04-25 12:03:10 CEST+0200", "meta": {"description": "A Nation of Sheep | More and More Evidence that US Plans to Lockdown and Wait for a Vaccine Date from 2007", "lang": "en", "keywords": "", "favicon": "https://amg-news.com/wp-content/uploads/2021/09/cropped-AMG-mic-32x32.jpg", "canonical": "https://amg-news.com/a-nation-of-sheep-more-and-more-evidence-that-us-plans-to-lockdown-and-wait-for-a-vaccine-date-from-2007/", "encoding": "UTF-8"}, "image": null, "domain": "amg-news.com", "title": "A Nation of Sheep | More and More Evidence that US Plans to Lockdown and Wait for a Vaccine Date from 2007", "cleaned_text": "A Nation of Sheep | More and More Evidence that US Plans to Lockdown and Wait for a Vaccine Date from 2007!\n\nMedeea Greere, an independent publisher, is now on Telegram at https://t.me/AMGNEWS2022 and exists only on reader support as we publish Truth, Freedom and Love for public awareness. Thank You for your support!\n\nMore and more evidence is coming to light that the ‘lockdown and wait for a vaccine’ strategy unleashed in 2020 was being cooked up inside the US Government for decades before COVID-19 appeared and gave too many people an excuse to put the dreadful plan into action.\n\nRecently the role of CISA (Cybersecurity and Infrastructure Security Agency) in producing key lockdown guidance for America in March 2020 came to light.\n\nNow, a pandemic plan from 2007 produced by the National Infrastructure Advisory Council (NIAC) and currently hosted on the CISA website has emerged.\n\nThe plan contains the original list of pandemic ‘essential businesses’ that was used by CISA in 2020 to lock down America. The 2007 plan (which was itself based on a Department of Homeland Security plan from the previous year) clearly states the intention to ban large gatherings “indefinitely,” close schools and nonessential businesses, institute work-from-home, and quarantine exposed and not just sick individuals. The aim is simple and clear: to slow the spread to wait for a vaccine.\n\nHere’s the relevant section of the 2007 NIAC plan in full.\n\nThe years 2006 and 2007 were a turning point in US biodefence planning. Prior to 2006, such planning had been focused on biological attacks, but then major mission creep set in and the new draconian ideas were applied wholesale to general pandemic planning. This controversial switch in focus so riled leading US disease expert D.A. Henderson, who had been involved with the project up to that point, that he issued his famous riposte objecting in the strongest terms to the new ideas. He and his fellow dissenters wrote, presciently:\n\nI’m told by someone who was involved with the programme in the early days that the original biodefence planning in 2002-2003 assumed a targeted biological weapons attack with smallpox as the viral case and anthrax as the bacterial case – both considered worst case scenarios. It was recognised that the old smallpox vaccine was too risky to try to use on a wider population to protect them if such an attack occurred, thus the effort for a new vaccine. But very quickly, within a year or two (not least due to the SARS outbreak in 2003), there was a massive expansion of the original mission and suddenly every infectious agent, whether dangerous or not, was cast into the web of biodefence.\n\nOutside the US there was more resistance to this kind of totalitarian nonsense. However, even the 2019 World Health Organisation pandemic guidance bears many of its marks. While this guidance commendably did not recommend “in any circumstances” contact tracing, border closures, entry and exit screening and quarantine of exposed individuals, it did make conditional recommendations for use of face masks by the public, school and workplace closures and “avoiding crowding” i.e., social distancing.\n\nThe purpose was also the same: to ‘flatten the curve’ to wait for a vaccine, as illustrated in the diagram below. The WHO guidance states: “NPIs are often the most accessible interventions, because of the time it takes to make specific vaccines available;” “specific vaccines may not be available for the first six months;” NPIs are “used to delay the peak of the epidemic… allowing time for vaccines to be distributed.”\n\nThese untested ideas, which the WHO’s own guidance rightly admitted had no good quality evidence to support them, have now become a terrible orthodoxy for global pandemic response. This is despite them utterly failing to achieve any of their goals – a point that no one who backs them seems to have noticed.\n\nSomehow, the world must learn the right lessons from this debacle. Yet it keeps threatening to learn all the wrong ones.", "opengraph": {"locale": "en_US", "type": "article", "title": "A Nation of Sheep | More and More Evidence that US Plans to Lockdown and Wait for a Vaccine Date from 2007 - American Media Group", "description": "A Nation of Sheep | More and More Evidence that US Plans to Lockdown and Wait for a Vaccine Date from 2007", "url": "https://amg-news.com/a-nation-of-sheep-more-and-more-evidence-that-us-plans-to-lockdown-and-wait-for-a-vaccine-date-from-2007/", "site_name": "American Media Group", "article:author": "https://www.facebook.com/medeea23greere", "article:published_time": "2022-12-19T12:57:30+00:00", "image": "https://amg-news.com/wp-content/uploads/2022/12/A-Nation-of-Sheep.jpg", "image:width": "868", "image:height": "580", "image:type": "image/jpeg"}, "tags": ["COVID-19"], "tweets": [], "movies": [], "links": ["https://t.me/AMGNEWS2022", "https://20443iiznzby5z6ktalw028za7.hop.clickbank.net/?tid=AMG1912sheep", "https://8821d6s1g7ithn33s82rpfnneq.hop.clickbank.net/?tid=AMG1912sheep", "https://3f39fan1j4ewcp4ns5pevby486.hop.clickbank.net/?tid=AMG1912sheep", "https://88933efamcowbv7f2yqnm2l79a.hop.clickbank.net/?tid=AMG1319sheep", "https://t.me/AMGNEWS2022", "https://t.me/AMGNEWS2022"], "authors": ["Medeea Greere"], "publish_date": "2022-12-19T12:57:30+00:00"}