{"result_id": "025013", "URL": "https://amg-news.com/the-plan-the-who-has-a-plan-of-10-years-of-infectious-diseases-starting-from-2020-to-2030-are-you-ready/", "timestamp": "2023-04-25 12:02:45 CEST+0200", "meta": {"description": "THE PLAN - WHO Has a Plan of 10 Years of Infectious Diseases, Starting From 2020 to 2030. Are You Ready?", "lang": "en", "keywords": "", "favicon": "https://amg-news.com/wp-content/uploads/2021/09/cropped-AMG-mic-32x32.jpg", "canonical": "https://amg-news.com/the-plan-the-who-has-a-plan-of-10-years-of-infectious-diseases-starting-from-2020-to-2030-are-you-ready/", "encoding": "UTF-8"}, "image": null, "domain": "amg-news.com", "title": "THE PLAN - The WHO Has a Plan of 10 Years of Infectious Diseases, Starting From 2020 to 2030. Are You Ready?", "cleaned_text": "The new COVID-19 disease appeared in China towards the end of 2019. That’s why it was named COVID-19, which is an acronym for Corona Virus Disease 2019. Data from the World Integrated Trade Solution, however, shows something astonishing:\n\nIn 2017 and 2018, hundreds of millions of COVID-19 Test Kits were distributed worldwide.\n\nA 2015 COVID-19 testing method was set to be released in 2020\n\nMovie from 2006 depicted a pandemic in the year 2020\n\nThe next bit of information is particularly interesting because it shows how much information is available, for those who dare to do the research. Back in 2013, a musical artist with the peculiar name of Dr. Creep wrote a rap song called PANDEMIC. Nothing special about that, were it not that one of his lyrics reads: (6)\n\nIn 2017, Fauci guaranteed a pandemic within the next two years\n\nExcitement about selling vaccines in the next year\n\nA coronavirus pandemic plan was published months before the coronavirus pandemic\n\n20 years of research say: the vaccine will change our DNA\n\nDoctor Carrie Madej has directed two medical clinics in Georgia, USA, and has studied DNA and vaccines for the past twenty years. She has made an urgent video in which she warns that there is a plan to inject humanity with very dangerous vaccines for Covid-19. The purpose of these new vaccines will be twofold: 1) reprogram our DNA and make us hybrids that are easier to control.\n\n 2) connect us to artificial intelligence through a digital vaccine ID, which will also open a whole new realm of control. This medical expert says she has observed on multiple occasions how diseases were spread over populations by aircraft. For safety reasons, she is not able to share more details about this in public. Depopulate the earth by means of organized epidemics Dr. John Coleman was an Intelligence Officer from the CIA who wrote a book titled ‘The Committee of 300’. In the book, he explains how secret societies manipulate governments, health care, food industries, the media and so on. This book can be found on the website of the CIA. (15) One of the primary goals of the many secret societies that control governments and the media, is to depopulate the earth. Dr. Coleman says the following about their strategy: In 1980 a granite monument was erected in Georgia, USA, called the Guidestones. A set of 10 guidelines is inscribed on the structure in eight modern languages, and a shorter message is inscribed at the top of the structure in four ancient language scripts. The first guideline goes as follows: 1. Maintain humanity under 500,000,000 in perpetual balance with nature. The CIA officer Dr. Coleman revealed that one of their methods to ‘maintain humanity’ is to cause ‘organized epidemics of fatal, rapid acting diseases’. During a TED talk, Bill Gates echoed this goal, when he literally said that new vaccines can be used to reduce the world’s population by 10 – 15%! (16) Mike Adams is a published food scientist, author of the popular science book Food Forensics, and founder of ISO-accredited CWC Labs. Years ago he said the following: An engineered bioweapon will be released in population centers. There will be calls for massive government funding for the vaccine industry to come up with a vaccine. Miraculously they will have a vaccine developed in record time. Everyone will be required to line up and take this vaccine shot. There has indeed been a release of an engineered bioweapon, followed by a vaccine mandate, massive government funding for the vaccine industry and a vaccine that has been developed in record time. The rest of his message is that this vaccine will slowly begin to kill millions – if not billions – of people over the course of a few years. It will be a kill-switch vaccine, designed to reduce the world’s population. All predictions were made shortly before it happened Note that every single prediction of this pandemic was announced a few years or even months before it happened. The fact that such a historically unique event was predicted in great detail – by movies, shows, investigators, medical doctors, those who finance the labs that develop these viruses, those who earn billions from these pandemics, and those who want to create a whole new level of control in our world, etc. – plainly reveals that it was planned. Are there signs that the pandemic is being manipulated? So far, we have looked at indications that the pandemic was planned beforehand. If it is indeed orchestrated, then that should also be obvious during the pandemic. A planned pandemic is also a controlled pandemic. Do we indeed observe that the pandemic is being manipulated? Absolutely. Other posts on StopWorldControl.com reveal how literally every medical, scientific, governmental, educational and journalistic voice that differs from the media propaganda is aggressively censored. Never before in the history of humanity has there been such a global censorship of medical doctors and respected scientists from around the world. In addition, there is an unprecedented display of worldwide fraud with covid numbers. Literally every bit of information about COVID-19 is false. Medical personnel from around the world have admitted that they are being heavily pressured to register every single patient as a covid patient, and every death – no matter the cause – as a covid death. You can see the evidence for this outrageous claim in this shocking expose of the greatest fraud in the history of the world. Who is behind the plan to control the world? We have been talking about a group of people who are called ‘globalists’. So, who are these ‘globalists’ anyway? They are wealthy, influential people around the world who plan to create one global government. This will enable them to control every human being on the planet. Their strategy is to dominate every area of our societies: health care, food industries, media, governments, religion – everything. Total world domination has been a diabolical desire of many powerful leaders throughout world history. Just think of the notorious world empires of Rome, Great Britain, the Persians, the Russians, and so on. This perverse passion has never left the corrupt hearts of humanity, but the means to achieve this goal have changed. Instead of invading nations with tanks and bazookas, they now enslave humanity using the force of fear. Once they can create enough panic, they can present the ‘solution’. This solution, however, means removing our freedoms and submitting us to their control. The main players in globalism are the United Nations, the World Economic Forum, the World Health Organization, the European Union, the International Monetary Fund, the World Bank, and particularly the many private banks that basically control the world already. These visible entities are, however, just a facade that hides the true powers, which are the many ‘Secret Societies’. Many of these globalists recently gathered in a small town called Davos, in Switzerland, where they expressed how the pandemic will be used to deploy their plans. Here are some of the statements they made: ‘Now is the historic moment in time, not only to fight the virus, but TO SHAPE THE SYSTEM. The pandemic represents a window of opportunity to RESET OUR WORLD. The world must act jointly and swiftly to REVAMP ALL ASPECTS of our societies and economies, from educational to social contacts and working conditions.EVERY COUNTRY, from the United States to China, must participate, and every industry, from oil and gas to tech, must be TRANSFORMED.’ Klaus Schwab, Founder of the World Economic Forum The World Economic Forum has created a ‘spinning wheel’ graphic with all their objectives. Here we can see the following three ‘projects’: COVID19, followed by Global Governance and Internet Governance. Nobody wants these organizations Not a single human on the earth has voted for these organizations to even exist, let alone take full control of our lives, families, communities, jobs, health, industries, etc. Yet they present themselves as our ‘world leaders’ who are planning our entire future. The World Health Organization positioned itself as the authority over our health, without any one of us having chosen them. They apply a tyranny in mainstream media and social media, where no expression of medical or scientific expertise is allowed, unless it is in line with the guidelines of this ‘World’ organization. Tens of thousands of medical doctors and scientists have been censored all over the world by Facebook, Youtube and Twitter. Why? Because these social media giants seek to portray that ONLY information from the World Health Organization is true. That is a clear example of world tyranny by the globalists. They install their own ‘world’ institutions – that have ZERO authority over any one of us. But simply because they call themselves ‘world’ leaders, they assume authority over all of humanity. This means complete loss of medical freedom, loss of freedom of speech, loss of true science, loss of true journalism and an imposition of dictatorships by organizations that no one voted for, led by individuals that no one chose or wanted. And yet they simply seize ownership of our entire world. They are the “big, fat, mean bully on the playground” that plays boss over everyone. The World Health Organization is run by a terrorist The head of the World Health Organization was a member of a violent revolutionary communist party in Ethiopia: Tigray People’s Liberation Front. (19) The Department of Homeland Security clearly states: “The TPLF qualifies as a Tier III terrorist organization… on the basis of its violent activities…” Let this get through to you: the man directing the World Health Organization is literally a communist terrorist, who has been involved in imposing communism on Ethiopia. That same man is now bullying the entire world, telling all of us what we can and cannot do, censoring every medical professional who has a different opinion, demanding blind obedience from all of humanity, while imposing mandates for vaccination from the WHO’s number one financial sponsor: Bill Gates. Is this the world you want to live in, from now on? More and more pandemics, until mankind submits These globalists are also threatening humanity with more suffering if we don’t submit to their total control. Prince Charles recently joined the globalists and publicly stated: There will be more and more pandemics, if we don’t do ‘the great reset’ now. (18) Bill Gates is already calling this ‘pandemic one’ and is talking about ‘pandemic two and three’. The investigator who in 2013 predicted that a coronavirus pandemic would occur in 2020, followed by riots, has stated that the plan is to create a series of pandemics during 2020-2030. This decade is the selected timeframe to turn the world into one big prison. Globalists are planning to cause as many pandemics as necessary in order to break the backbone of humanity, until everybody submits to their global control. Mandating vaccines is key to their plan, because the vaccines will connect us to global control systems. Only the vaccinated will be able to move freely. Are you beginning to understand why more than 700 medical doctors from Germany, 600 doctors from Spain, thousands of medical experts from the USA and many more all over the world are calling this pandemic a ‘global’ crime’? Archbishop Carlo Vigano and several cardinals of the Roman Catholic Church wrote a letter to humanity, to warn us of global tyranny under the guise of COVID-19. This is an excerpt of this historic message, which was translated into many languages and sent to leaders all over the world. (20) We have reason to believe, on the basis of official data on the incidence of the epidemic as related to the number of deaths, that there are powers interested in creating panic among the world’s population with the sole aim of permanently imposing unacceptable forms of restriction on freedoms, of controlling people and of tracking their movements. The imposition of these illiberal measures is a disturbing prelude to the realization of a world government beyond all control. Is there hope? What can we do? Is there any hope for our future, or are we surrendered to the merciless hands of these wicked mega-billionaires who want to depopulate the earth and seize total control over humanity? Yes, there is hope. The future is brighter than we can even imagine! This is not a doom and gloom scenario, but a wake-up call for humanity to stop blindly believing the mafia-media and perverse politicians, and to rise up as one for a future of freedom. I invite you to join a unique and historic movement of Global Freedom Fighters, who will lead humanity into a new era of hope, restoration and more freedom than we have ever known.", "opengraph": {"locale": "en_US", "type": "article", "title": "THE PLAN - The WHO Has a Plan of 10 Years of Infectious Diseases, Starting From 2020 to 2030. Are You Ready? - American Media Group", "description": "THE PLAN - WHO Has a Plan of 10 Years of Infectious Diseases, Starting From 2020 to 2030. Are You Ready?", "url": "https://amg-news.com/the-plan-the-who-has-a-plan-of-10-years-of-infectious-diseases-starting-from-2020-to-2030-are-you-ready/", "site_name": "American Media Group", "article:author": "https://www.facebook.com/medeea23greere", "article:published_time": "2023-01-05T17:59:40+00:00", "image": "https://amg-news.com/wp-content/uploads/2023/01/Fara-titlu.png", "image:width": "1128", "image:height": "590", "image:type": "image/png"}, "tags": ["Depopulation Agenda", "COVID-19", "New World Order"], "tweets": [], "movies": [], "links": ["https://patents.google.com/patent/US20200279585A1/en", "https://8efe57rzq1pthlbxwlx9reikbz.hop.clickbank.net/?tid=AMG0501cov", "https://8c133li5g3btdx2bjdtkma5r5x.hop.clickbank.net/?tid=AMG0501cov", "https://8c133li5g3btdx2bjdtkma5r5x.hop.clickbank.net/?tid=AMG0501covV", "https://685ffetas7cn8o34ulo80zbu3n.hop.clickbank.net/?tid=AMG0501cov", "https://stopworldcontrol.com/"], "authors": ["Medeea Greere"], "publish_date": "2023-01-05T17:59:40+00:00"}