{"result_id": "026008", "URL": "https://americanpolicy.org/2021/02/16/aufheben-der-kultur-cancel-culture-part-5-schools-the-birthing-place-of-cancel-culture/", "timestamp": "2023-04-25 12:03:44 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://americanpolicy.org/wp-content/uploads/2020/03/faveagle.png", "canonical": "https://americanpolicy.org/2021/02/16/aufheben-der-kultur-cancel-culture-part-5-schools-the-birthing-place-of-cancel-culture/", "encoding": "UTF-8"}, "image": null, "domain": "americanpolicy.org", "title": "Aufheben der Kultur - Cancel Culture - Part 5: Schools, the birthing place of Cancel Culture", "cleaned_text": "In the previous parts of “Aufheben der Kultur”, I have been explaining different aspects of Cultural Marxism. A thought that comes to mind after reading about Cultural Marxism is, how in the world did America succumb so quickly and thoroughly to this evil? The short answer: our children were/are vaccinated against liberty from the day they start kindergarten. I will expand and try to elucidate this below.\n\nOne person who doesn’t get quoted much in the discussion of early education designed by the Frankfurt School is Mary Parker Follett. Yet, she lays out, in black and white, what she sees as the new state (which is the title of one of her books). This is an excellent example:\n\nThe training for the new democracy must be from the cradle – through nursery, school and play, and on and on through every activity of our life. Citizenship is not to be learned in good government classes or current events courses or lessons in civics. It is to be acquired only through those modes of living and acting which shall teach us how to grow the social consciousness. This should be the object of all day school education, of all night school education, of all our supervised recreation, of all our family life, of our club life, of our civic life. (Mary Parker Follett 1918, The New State, p. 363)\n\nFollet believed that there is no such thing as an individual conscience, that, “We can have no true moral judgment except as we live our lives with others. . . our individual conscience must be incorporated in a national conscience as one of its constituent members.”\n\nAnd what does she think of individualism and nationalism? “. . . as we see now that a nation cannot be healthy and virile if it is merely protecting the rights of its members, so we must see that we can have no sound condition of world affairs merely by the protection of each individual nation – that is the old theory of individual rights. Each nation must play its part in some larger whole. (National rights) are as obsolete as the individual rights of the last century. . . In our present international law, a sovereign nation is one that is independent of other nations – surely a complete legal fiction.”\n\nFollett’s book, The New State, tells us what kind of community we will have and where individuals fit in (not). It is the outline of what will be taught (or not) to our children. That is shown, quite openly, by Brock Chisholm, the First Secretary General of World Health Organization (WHO):\n\n“To achieve world government, it is necessary to remove from the minds of men their individualism, loyalty to family tradition, national patriotism, and religious dogmas.\n\nWe have been very slow to rediscover this truth and to recognize the unnecessary and artificially imposed inferiority, guilt and fear, commonly known as sin . . . which produces so much of the social maladjustment and unhappiness in the world. For many generations we have bowed our necks to the yoke of the conviction of sin. We have swallowed all manner of poisonous certainties fed us by our parents, our Sunday and day school teachers, our politicians, our priests.\n\n“Thou shalt become as gods, knowing good and evil”, good and evil, with which to keep children under control, with which to prevent free thinking, with which to impose local and familial and national loyalties and with which to blind children to their glorious intellectual heritage.\n\nMisguided by authoritarian dogma, bound by exclusive faith, stunted by inculcated loyalty, torn by frantic heresy . . . and loaded down by the weight of guilt and fear engendered by its own original promises, the unfortunate human race, deprived . . . of its reasoning power and its natural capacity to enjoy the satisfaction of its natural urges, struggles along under its ghastly self-imposed burden. The results, the inevitable results, are frustration, inferiority, neurosis and inability to enjoy living, to reason clearly or to make a world fit to live in.\n\nMan’s freedom to observe and to think freely . . . has been destroyed or crippled by local certainties . . . moralities . . . personal salvation . . . frequently masquerading as love. Brock Chisholm, Psychiatry, February 1946, pp. 7-8.\n\nJohn Dewey, Rockefeller, Vanderbilt, the Rothschilds, the British Royal family, the Frankfurt School, and many others had their hands in the building of our public school system to achieve the goals of molding our nation into one of useful idiots and useless eaters.\n\nExactly what John Dewey heralded at the onset of the twentieth century has indeed happened. Our once highly individualized nation has evolved into a centrally managed village, an agora made up of huge special interests which regard individual voices as irrelevant. The masquerade is managed by having collective agencies speak through particular human beings. Dewey said this would mark a great advance in human affairs, but the net effect is to reduce men and women to the status of functions in whatever subsystem they are placed. Public opinion is turned on and off in laboratory fashion. All this in the name of social efficiency, one of the two main goals of forced schooling. Dewey called this transformation “the new individualism.” John Taylor Gatto.\n\nWho was John Dewey? A Fabian Socialist, member of the Council on Foreign Relations, Marxist, and created the Progressive Education Association in 1919, and co-authored Humanist Manifesto I, in 1933. In his Manifesto, he states:\n\nToday man’s larger understanding of the universe, his scientific achievements, and deeper appreciation of brotherhood, have created a situation which requires a new statement of the means and purposes of religion. Such a vital, fearless, and frank religion capable of furnishing adequate social goals and personal satisfactions may appear to many people as a complete break with the past. While this age does owe a vast debt to the traditional religions, it is none the less obvious that any religion that can hope to be a synthesizing and dynamic force for today must be shaped for the needs of this age. To establish such a religion is a major necessity of the present. It is a responsibility which rests upon this generation. We therefore affirm the following Human Manifesto (which is found at the bottom of this document).\n\nJohn Dewey taught “Functionalism”; that “man is without purpose and he is a product of his or her experience and nothing else. Thus, all values must be found within the social context. Values therefore are relative and ethics are based on custom, inclination, or utilitarianism.”\n\nWhat has it taken that we have almost reach this state now? The cultural Marxists have put enormous amounts of time, money, and effort into molding the American people – as well as much of the rest of the world — into compliant, submissive, spineless, empty-headed beings. Key foundations here in the U.S. took charge of un-educating our children. The Carnegie, Rockefeller, and Ford Foundations were at the start and at the heart of the corruption of our school system. Conclusions from the Reece Committee’s 1954 investigations of tax-exempt foundations using their funds for other than originally intended purposes, i.e., to subvert U.S. education:\n\nThe committee’s final report concluded that with a few exceptions (such as the Institute for Pacific Relations) these tax-exempt institutions had not directly supported organizations that supported communism, but that institutions including the Ford Foundation, Rockefeller Foundation, and Carnegie Endowment were using funds to promote causes that were “subversive” by the committee’s (and the Brookings Institute’s) definition of the term. Namely, causes that would promote a form of oligarchical collectivism.\n\nAmong the most notable findings of the Reece Committee:\n\nFrom “1933–1936, a change took place which was so drastic as to constitute a ‘revolution’. They also indicated conclusively that the responsibility for the economic welfare of the American people had been transferred heavily to the Executive Branch of the Federal Government; that a corresponding change in education had taken place from an impetus outside of the local community, and that this ‘revolution’ had occurred without violence and with the full consent of an overwhelming majority of the electorate. In seeking to explain this unprecedented phenomenon, subsequent studies pursued by the staff clearly showed it could not have occurred peacefully, or with the consent of the majority, unless education in the United States had been prepared in advance to endorse it ” (Dodd, 6). Thus, influencing educational curriculum is of the utmost importance to advancing revolutionary policies.\n\nCarnegie and Rockefeller Foundations had used their funds for grants with the following agendas in mind:\n\n“Directing education in the United States toward an international viewpoint and discrediting the traditions to which it [formerly] had been dedicated.\n\nDecreasing the dependency of education upon the resources of the local community and freeing it from many of the natural safeguards inherent in this American tradition.\n\nChanging both school and college curricula to the point where they sometimes denied the principles underlying the American way of life.\n\nFinancing experiments designed to determine the most effective means by which education could be pressed into service of a political nature” (Dodd, 7).\n\nThe American Historical Association had issued a report in 1934 “which concluded that the day of the individual in the United States had come to an end and that the future would be characterized, inevitably, by some form of collectivism and an increase in the authority of the State” (Dodd, 10).\n\nThe Social Science Research Council and the National Research Council pushed educational curriculum that serves to indoctrinate American students to forego the freedom of the individual and “substitute the group, the will of the majority, and a centralized power to enforce this will – presumably in the interest of all” (Dodd, 11).\n\nAt a later meeting of the head of the Ford Foundation, Rowan Gaither, said to Norman Dodd:\n\nMr. Dodd, all of us here at the policy making levels of the foundations have at one time or another served in the OSS (Office of Strategic Services, CIA forerunner) or the European Economic Administration, operating under directives from the White House. We operated under those same directives. The substance under which we operate is that we shall use our grantmaking power to so alter life in the United States that we can be comfortably merged with the Soviet Union.”\n\nLooking at today’s textbooks is not enough to understand what is going on in our schools. While reviewing many of them can actually make you ill, when you see the how and why these things are being taught (and have been taught for decades now, gradually working up to the outright lies, omissions and brainwashing) you will have a better understanding of the evil behind our public-school instruction.\n\nOur teacher’s associations and others involved in education have been dumbing down our children for a hundred years. In 1928 at a Progressive Education Association meeting with John Dewey and others, a teacher named O.A. Nelson comments:\n\nThe sole work of the group was to destroy our schools! We spent one hour and forty-five minutes discussing the so-called “Modern Math.” At one point I objected because there was too much memory work, and math is reasoning; not memory. Dr. Ziegler turned to me and said, “Nelson, wake up! That is what we want . . . a math that the pupils cannot apply to life situations when they get out of school!” That math was not introduced until much later, as those present thought it was too radical a change. A milder course by Dr. Breckner was substituted but it was also worthless, as far as understanding math was concerned. The radical change was introduced in 1952. It was the one we are using now. So, if pupils come out of high school now, not knowing any math, don’t blame them. The results are supposed to be worthless. ( Charlotte Iserbyt Deliberately Dumbing Down of America, p. 38.)\n\nIn 1965, The Department of Health, Education and Welfare commissioned Michigan State University to write a report, Behavioral Science Teacher Education Program (BSTEP), that is designed not to only change our children’s values, attitudes and beliefs, but with far more malevolence (if you can conceive something even more evil than that) this program will make most of them into brain-dead slaves.\n\nPage 255 of BSTEP (288 of the PDF) has a chart “Detailing the Controlling Elite,” the Overview reads:\n\nThe Protestant Ethic will atrophy as more and more enjoy varied leisure and guaranteed sustenance. Work as the means (illegible) end of living will diminish in importance except for a few with exceptional motivation, drive, or aspiration. No major source of a sense of worth and dignity will replace the Protestant Ethic. Most people will tend to be hedonistic, and a dominant elite will provide “bread and circuses” to keep social dissension and disruption at a minimum.\n\nA small elite will carry society’s burdens. The resulting impersonal manipulation of most people’s lifestyles will be softened by provisions for pleasure seeking and guaranteed physical necessities. Participatory democracy in the American-ideal mold will mainly disappear. The worth and dignity of individuals will be endangered on every hand. Only exceptional individuals will be able to maintain a sense of worth and dignity.\n\nI could stop here and you would have read more than you need to comprehend what our government plans for us. Don’t even say “conspiracy theory” here. This is an official document. You have to admit, they have chutzpah; they put it out there for us to see. Not immediately after they wrote it, but now you can download the entire document. SEE IT. Go to the links and read it. “No major source of a sense of worth and dignity will replace the Protestant Ethic.” This is one of their goals. Can they be anything other than evil? Every sentence in those two paragraphs is damning.\n\nBut I won’t stop yet. On page 251 (p. 284 of PDF) we see Hitler’s progeny:\n\n Greater need to be able to work with children who are biologically superior (years needed before biological improvements will be reflected in the kinds of persons in the professions.)\n\nNeed to help students develop attitudes compatible with societal needs . . .\n\nYou don’t mind the government, through our schools, changing the values, attitudes and beliefs of your children?\n\nOn page 247 (280 of PDF) you will read:\n\n For those who wish some structure, the following is provided. There are five broad categories with several sub-categories:\n• Futurism as a social tool and decision making by an elite\n\n 2.Population factors\n\n a. Population concentrations\n\n b. Increasing youthfulness of the population and generational gap\n\n 3. Biological capabilities\n\n a. Biological capabilities in controlling inherited characteristics and potentialities\n\n b. Body repair and health improvements\n\n 4. Man and interaction dynamics\n\n a. Shifting social values\n\n b. Governance and services by varied agencies, organizations, and enterprises.\n\n c. A controlling elite\n\n d. Conflict and cooperation among peoples at home and abroad\n\n e. International arrangements and nationalism\n\n 5. Man’s technical and natural resources\n\n a. Knowledge explosion and means of analyzing, processing, storing, and retrieving ideas and information\n\n b. Systems approach and cybernetics\n\n c. Diffusion of prosperity and increased social mobility\n\n d. Communications capabilities and potentialities for opinion control\n\n e. Transportation capabilities (supplemented by communications capabilities.\n\n f. Nuclear power\n\n g. Space and underwater explorations\n\n h. Environmental pollution\n\nPlanning to overturn the values of the Great American Experiment, the writers of this document have conceived a Brave New World that no longer sees values in the works of our Forefathers. They are renouncing the Judeo-Christian/Western Culture values that gave freedom to all who resided here and are inculcating the anti-human, anti-freedom values promoted through so-called social justice and global government.\n\nThere is little doubt that environments do change. To recognize present and future environments one must know the sources of change which create a new environment. Technology is the major source of change. It opens up possibilities of manipulating, mastering and transforming nature, resources, time and space. It offers a systematic disciplined approach to objectives, permits precision and measurement and a systems concepts that may be quite contrary to traditional religious, esthetic and intuitive modes. Because of technology, decision-making can be based on such techniques as simulation model construction, linear programming, and operations research.\n\nSeeing the demise of the US’s prestige in the world, these writers see most humans as resources now like trees and oil and cotton, just not as valuable. In the next to the last sentence below, the canons the Occident (the Western World), are to be replaced by those of the globe. In other words, moral relativism at its zenith. Instead of sovereign countries choosing the values they wish to exemplify, all countries will have all values – at least all the values promoted by the UN, i.e., no values with a moral absolute: (p240 or 273 PDF)\n\nOther sources of change in society exist. These include the diffusion of existing goals and privileges in society, the structural development in society, and the relationship of the United States to the rest of the world. Human capital rather than financial capital is considered urgent; sociological questions about relationships of new technological modes of decision-making to the political structures of society are raised; and there tends to be a shift from the product sector of economy to that of service.\n\nThat is BSTEP, and that was almost 50 years ago. I don’t know if you can even imagine how deeply this is embedded in our school system. But that was just one of the steps to bring about global citizens whose entire beings are to protect the state and to sacrifice their lives if necessary to achieve the goal of a cultural Marxist world dominated by the Globalists.\n\nMore recently, now that the goals of BSTEP are at, or next to, completion, social justice issue are being inculcated into our school children’s psyches. Besides the issues I mentioned in Part 4 of the Cancel Culture articles, our children are being, literally, brainwashed to accept things that would have been unacceptable to almost every parent even 20 year ago. And it is all to wipe out the student’s moral values and replace them with Cancel Culture vacuity.\n\nSocial Justice and multiculturalism are major tools in the Cancel Culture arsenal. In Crimes of the Educators, Samuel Blumenfeld and Alex Newman explain the Common Core standards on multiculturalism:\n\nThe standard . . . does not call for the Americanization of all these diverse students from different countries and cultures. What it also means is that the traditional Judeo-Christian model of American values is no longer to be upheld as the model for children to adopt in the public schools. A multicultural society is made up of many equally valid ideals that could serve as equally valid models for young Americans. No one is required any longer to conform to the once-dominant Judeo-Christian patriotic ideal. That culture is to be virtually erased from the minds of American students. . . . “As a descriptor, multiculturalism points to a condition of numerous lifestyles, values and belief systems. By treating diverse cultural groups and ways of life as equally legitimate, and by teaching about them in positive ways, legitimizing differences through various education policies and practices, self-understanding, self-esteem, intergroup understanding and harmony, and equal opportunity are promoted.”\n\nThus, multicultural education embraces much more than mere cultural pluralism or ethnic diversity. It legitimizes different lifestyles and values systems, thereby legitimizing moral diversity – which is simply moral anarchy. The concept of moral diversity directly contradicts the biblical concept of moral absolutes based on the Ten Commandments, on which this nation was founded.\n\nHow is multicultural education taught? It is not a course that is taught separately from the rest of the subject matter. It is, in reality, a worldview, that in the words of Theresa E. McCormick, a multicultural specialist at Emporia State University, “must permeate the total educational environment.’”\n\nThis is just an iota of the evils perpetrated on the youth of our nation in the desire to achieve a cancelled culture and, thus, bring us to full cultural Marxism.\n\nHow do we stop it? Can we? We certainly best try.\n\nThe first step would be to shut down the Department of Education. That would take away the total control of education in this country from the globalists running Washington. Next, we need to take back our schools in our towns and cities. Get rid of those school board members who are working for the globalists, and get parents and community residents who believe in the Great American Experiment.\n\nThe schoolbooks need to be burned (I never thought I would ever be in favor of burning even one book), but these need to be burned – all but one of each to remind us never to slip into this evil again. This is probably the hardest part, but we could reprint textbooks from the ‘50s for a stop-gap measure until we can get new ones with authentic history, true mathematics, and NO sick and twisted sexual education.\n\nIn 2013, along with many other parents, teachers and concerned citizens of Tennessee, I spent days reviewing the ‘proposed’ textbooks for introduction in 2017. I won’t go into the lies and brainwashing that we found in every book; and, yes, we took our findings to the State Legislature to ask them to reject these books. What did we get from it? I believe there were many people who had little or no inkling of what they were going to find in the books; that was good – a wake-up call for some. But, other than that, it was a waste of time – exactly what those promoting the books like to see happen. But, to my original point, those books should burn.\n\nIn the short and medium run, every parent who can, should homeschool their children. There are great curricula out there, Ron Paul has an excellent one. And in the meantime, as I said before, we need to take back our schools and watch over them like hawks this time. Nothing will be easy, but we allowed this to happen over 100+ years. We cannot expect to fix it in a day. Or month. Or year.\n\nFirst: Religious humanists regard the universe as self-existing and not created.\n\nSecond: Humanism believes that man is a part of nature and he has emerged as a result of a continuous process.\n\nTHIRD: Holding an organic view of life, humanists find that the traditional dualism of mind and body must be rejected.\n\nFOURTH: Humanism recognizes that man’s religious culture and civilization, as clearly depicted by anthropology and history, are the product of a gradual development due to his interaction with his natural environment and with his social heritage. The individual born into a particular culture is largely molded by that culture.\n\nFIFTH: Humanism asserts that the nature of the universe depicted by modern science makes unacceptable any supernatural or cosmic guarantees of human values. Obviously humanism does not deny the possibility of realities as yet undiscovered, but it does insist that the way to determine the existence and value of any and all realities is by means of intelligent inquiry and by the assessment of their relations to human needs. Religion must formulate its hopes and plans in the light of the scientific spirit and method.\n\nSIXTH: We are convinced that the time has passed for theism, deism, modernism, and the several varieties of “new thought”.\n\nSEVENTH: Religion consists of those actions, purposes, and experiences which are humanly significant. Nothing human is alien to the religious. It includes labor, art, science, philosophy, love, friendship, recreation–all that is in its degree expressive of intelligently satisfying human living. The distinction between the sacred and the secular can no longer be maintained.\n\nEIGHTH: Religious Humanism considers the complete realization of human personality to be the end of man’s life and seeks its development and fulfillment in the here and now. This is the explanation of the humanist’s social passion.\n\nNINTH: In the place of the old attitudes involved in worship and prayer the humanist finds his religious emotions expressed in a heightened sense of personal life and in a cooperative effort to promote social well-being.\n\nTENTH: It follows that there will be no uniquely religious emotions and attitudes of the kind hitherto associated with belief in the supernatural.\n\nELEVENTH: Man will learn to face the crises of life in terms of his knowledge of their naturalness and probability. Reasonable and manly attitudes will be fostered by education and supported by custom. We assume that humanism will take the path of social and mental hygiene and discourage sentimental and unreal hopes and wishful thinking.\n\n: Believing that religion must work increasingly for joy in living, religious humanists aim to foster the creative in man and to encourage achievements that add to the satisfactions of life.\n\nTHIRTEENTH: Religious humanism maintains that all associations and institutions exist for the fulfillment of human life. The intelligent evaluation, transformation, control, and direction of such associations and institutions with a view to the enhancement of human life is the purpose and program of humanism. Certainly religious institutions, their ritualistic forms, ecclesiastical methods, and communal activities must be reconstituted as rapidly as experience allows, in order to function effectively in the modern world.\n\nFOURTEENTH: The humanists are firmly convinced that existing acquisitive and profit-motivated society has shown itself to be inadequate and that a radical change in methods, controls, and motives must be instituted. A socialized and cooperative economic order must be established to the end that the equitable distribution of the means of life be possible. The goal of humanism is a free and universal society in which people voluntarily and intelligently cooperate for the common good. Humanists demand a shared life in a shared world.\n\nFIFTEENTH AND LAST: We assert that humanism will: (a) affirm life rather than deny it; (b) seek to elicit the possibilities of life, not flee from them; and (c) endeavor to establish the conditions of a satisfactory life for all, not merely for the few. By this positive morale and intention humanism will be guided, and from this perspective and alignment the techniques and efforts of humanism will flow.", "opengraph": {"locale": "en_US", "site_name": "American Policy Center", "title": "Aufheben der Kultur - Cancel Culture - Part 5: Schools, the birthing place of Cancel Culture", "url": "https://americanpolicy.org/2021/02/16/aufheben-der-kultur-cancel-culture-part-5-schools-the-birthing-place-of-cancel-culture/", "type": "article", "description": "In the previous parts of “Aufheben der Kultur”, I have been explaining different aspects of Cultural Marxism. A thought that comes to mind after reading about Cultural Marxism is, how in the world did America succumb so quickly and thoroughly to this evil? The short answer: our children were/are vac", "image": "https://americanpolicy.org/wp-content/uploads/2020/08/cancel-5355845_1280.jpg", "image:url": "https://americanpolicy.org/wp-content/uploads/2020/08/cancel-5355845_1280.jpg", "image:secure_url": "https://americanpolicy.org/wp-content/uploads/2020/08/cancel-5355845_1280.jpg", "article:published_time": "2021-02-16T15:34:39-05:00", "article:modified_time": "2021-02-16T15:35:11-05:00", "updated_time": "2021-02-16T15:35:11-05:00", "article:section": "More Issues", "article:publisher": "https://www.facebook.com/americanpolicycenter/"}, "tags": [], "tweets": [], "movies": [], "links": ["https://americanpolicy.org/author/kathleen-marquardt/", "https://americanpolicy.org/category/more-issues/", "https://americanpolicy.org/2020/10/15/aufheben-der-kultur-cancel-culture/", "https://2bcreative.org/?page_id=1670", "https://fascinatingpolitics.com/2019/12/22/the-reece-committee-on-foundations-conspiratorial-nonsense-or-an-expose-of-a-threat-to-the-nation/", "http://www.supremelaw.org/authors/dodd/interview.htm", "http://www.scribd.com/doc/24470503/Behavioral-Teacher-Education-Project", "http://www.scribd.com/doc/24470503/Behavioral-Teacher-Education-Project", "https://files.eric.ed.gov/fulltext/ED035597.pdf", "https://americanpolicy.org/2020/12/14/aufheben-der-kultur-cancel-culture-part-4-social-justice-political-correctness-and-the-woke-menagerie/", "https://newswithviews.com/Marquardt/kathleen114.htm"], "authors": [], "publish_date": "2021-02-16T15:34:39-05:00"}