{"result_id": "026003", "URL": "https://americanpolicy.org/2020/12/14/agenda-21-to-green-new-deal-the-war-on-human-society/", "timestamp": "2023-04-25 12:03:40 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://americanpolicy.org/wp-content/uploads/2020/03/faveagle.png", "canonical": "https://americanpolicy.org/2020/12/14/agenda-21-to-green-new-deal-the-war-on-human-society/", "encoding": "UTF-8"}, "image": null, "domain": "americanpolicy.org", "title": "Agenda 21 to Green New Deal - The WAR on Human Society", "cleaned_text": "Agenda 21 to Green New Deal – The WAR on Human Society\n\nFor nearly thirty years, as some of us have attempted to sound the alarm over plans to reorganize human society into global governance, we have been mercilessly attacked and labeled as radical conspiracy theorists.\n\nNow, as those very plans move ever closer to enforcement, many are beginning to ask questions about the origins of the plans. Who stands behind them, and where will it all lead? Will life be better? Will there be more freedom and happiness? Are we finally going to create a society free of war and strife, as promised by the promoters? Who’s right, the conspiracy theorists or the promoters?\n\nFirst, a little history. One of the direct results of World War II, which had affected every nation, was the desire to find a way to prevent war. Most of all, the threat of nuclear war truly terrified everyone. This led to the creation of the United Nations as a way to provide a forum where nations could work out their problems in a public forum instead of on a battlefield. That was the selling point, at least.\n\nThe fact of the matter is, the United Nations is a club in which nations join voluntarily and pay dues for the privilege. However, from its very beginning, some envisioned a much larger role for the club. They envisioned the end of independent sovereign nations in which they charged were the root of war, strife and poverty. They claimed that for true freedom to exist, everything must be equal, including food, possessions, and opportunity. To achieve that, individual nations must surrender their sovereignty to the greater good – global governance overseen by the United Nations.\n\nRight away, many socialist and communist-run nations grabbed hold of the concept. These were nations where the rights of the people were already determined by those in charge. In short, where government granted rights.\n\nBut there was one nation, in particular, that openly opposed this concept, because that nation had been created under the idea that every person possessed their rights from birth and that it was government’s job to protect those rights. Such a concept was completely antithetical to the growing determination to give the United Nations central power over the Earth. The United States was soon seen as the major obstacle to the globalist agenda.\n\nOver time, a “cold war” between the totalitarians of the communist nations and the advocates of free nations erupted and the United States found itself the designated leader of the “Free World.” As a member of the UN’s Security Council, the United States used its single-nation veto power to foil many of the efforts by the communist nations to build a UN power structure. This caused major frustration to those behind the goal of global governance. A solution had to be found to bring the United States into compliance.\n\nFinally, in the 1970s a novel tactic emerged in the form of the illusion of environmental Armageddon by way of the illusion of “Climate Change.” It was the perfect tool to propel the argument for independent nations. “It doesn’t matter what rights you think you have if you don’t have a planet to stand on!” The drive for global governance took hold, full speed ahead. One of the main proponents of the global governance movement, the Club of Rome said, “The common enemy of humanity is man. In searching for a new enemy to unite us, we came up with the idea that pollution, the threat of global warming, water shortages, famine and the like would fit the bill. All of these dangers are caused by human intervention, and it is only through changed attitudes and behavior that they can be over come. The real enemy then, is humanity itself.” There it was! The answer. The environment doesn’t recognize political or national boundaries. Just grab control of the land, water and air, and control every nation and every human life.\n\nIt didn’t take long for the globalist forces to jump onto the concept. Again, the Club of Rome laid out the party line necessary to grab control: “Democracy is not a panacea. It cannot organize everything and it is unaware of its own limits. These facts must be faced squarely. Sacrilegious though it may sound, democracy is no longer well suited for the task at hand. The complexity and the technical nature of many of today’s problems do not always allow elected representatives to make competent decisions at the right time.” So, according to this concept, in order to replace these leaders which were elected by the people, we are going to enforce global policy created by forces unseen, unknown, and equipped with their own agenda. Yep – that will solve the world’s problems!\n\nIt didn’t take long for the communists to grasp the idea. Former Soviet dictator, Mikhail Gorbachev, after the collapse of his socialist paradise, quickly set himself up as an environmentalist to promote this new world order. He explained to the State of the World Forum, “The emerging ‘environmentalization’ of our civilization and the need for vigorous action in the interest of the entire global community will inevitably have multiple political consequences. Perhaps the most important of them will be a gradual change in the status of the United Nations. Inevitably, it must assume some aspects of world government.” And there is was — the real goal, out in the open.\n\nThe UN’s Commission on Global Governance went further to explain how it would all come about as it reported, “The concept of national sovereignty has been immutable, indeed a sacred principle of international relations. It is a principle which will yield only slowly and reluctantly to the new imperatives of global environmental cooperation.” Now, how to set it all into place…?\n\nThe UN began to sponsor a series of international meetings, specifically focusing on the environment and how to “save planet Earth.” After a series of such meetings where private, non-governmental organizations (NGOs), officially recognized and sanctioned by the United Nations, met with government leaders, diplomats, and various bureaucrats, began to draw up a plan for using environmental issues as the basis for regulating human activity – all through the noble guidance of the United Nations, of course. Finally, in 1992, more than 50,000 NGOs, diplomats, and 179 world leaders, including U.S. President, George, H.W. Bush, met in an “Earth Summit,” in Rio de Janeiro, Brazil. Here, they introduced a series of four documents and treaties for the world to accept as guidelines for UN-led reorganization to save the planet.\n\nMost significant of these plans was one designed to create a global plan of action for the 21st Century. It was named Agenda 21, and its supporters promoted it as a “Comprehensive blueprint for the reorganization of human society.” All 179 world leaders signed onto the document, including President Bush, and promised to bring its goals into national policy.\n\nThere are four parts: Sections 1 is titled Social and Economic Dimensions. Details include, international cooperation to accelerate sustainable development policies, combat poverty, changing consumption patterns, protecting and promoting human health conditions, and promoting sustainable development by integrating environment policy into development plans.\n\nSection 2: is titled Conservation and Management of Resources for Development. This section outlined plans for promoting sustainable agriculture and rural development, integrating those policies into planning and management of land resources, enforcing sustainable policy into every body of water from seas to rivers and lakes, waste management, and conservation of “fragile” ecosystems, .\n\nSection 3: is titled “Strengthening the Role of Major Groups. Here we get into who was going to promote these policies in a divide and conquer tactic. First, the infamous NGOs who wrote the document gave themselves a major role under the chapter entitled “Strengthening the role of non-governmental organizations: partners for sustainable development.” But we were also to have “global action for women towards sustainable and equitable development.” Next, children were specifically targeted to be promoters of sustainable development. Another chapter outlined how to pull in local elected officials to promote support for Agenda 21 initiatives. Each chapter in this section of the Agenda 21 document focuses on more and more individual interest groups needed to push the agenda, from business and industry, to science and technology to farmers. No stone was left unturned in this outline to reorganize human society.\n\nSection 4: titled Means of Implementation. Here, finally, are the details on how it was to be accomplished. As all of the individual groups are brought under the umbrella, now the enforcers would focus on the necessary financial resources, transferring environmental technology into decision making, and focusing on education process, not only for schools, but also for “public awareness and training.” And then, of course, there are the necessary “International legal instruments and mechanisms.”\n\nHere it is, a complete and comprehensive outline for the agenda to completely transform all of humanity under the umbrella of globalism. And of course, it was urgent that the agenda be enforced as quickly as possible because, we were facing an environmental Armageddon caused by selfish, uncontrolled, ignorant humans, unfettered in unenlightened nation-states.\n\nFirst Global Warming, and then later Climate Change became the focus of the looming disaster. And it simply did not matter if there was no true science to back up the scare tactic. As the Canadian Minister of the Environment, Christine Stewart, openly admitted, “No matter if the science of global warming is all phony…climate change provides the greatest opportunity to bring about justice and equality in the world.” There is was! The truth. This whole charade wasn’t about saving the environment, but about changing the world order with a new gang in charge.\n\nTimothy Wirth, President of the UN Foundation, further enforced that fact when he said, “We’ve got to ride this global warming issue. Even if the theory of global warming is wrong, we will be doing the right thing in terms of economic and environmental policy.” There it is again – “economic policy!”\n\nAnd finally, there was Paul Watson, a co-founder of the radical Green NGO called GreenPeace. He summed it all up very nicely, saying, “It doesn’t matter what is true, it only matters what people believe is true.” No muss, no fuss, just get in line and don’t question us!\n\nHowever, there was still a skeptical world that had to be indoctrinated to follow the party line. So, it was important that the language, while keeping the urgent tension of environmental crisis in the forefront, used soft-peddle words to promote the policies. For example, soothing, reassuring comments such as, “we are just concerned about the environment, aren’t you?” “We want to help those less fortunate, living in poverty. Don’t you?” “Imagine all the people sharing all the world.” Nothing to worry about here, just a giant, loving, world-wide group hug. So, the agenda moved forward, with few questioning its details, motives, and true goals.\n\nMeanwhile, forces inside the UN were determined to hurry along the real agenda — global governance. As we moved closer to the year 2000, many insiders saw the start of the new Millennium as the perfect opportunity to launch a full-scale framework for global politics. In preparation, the UN planned to sponsor a Millennium Summit to plan the future for the world. A document was prepared for presentation at the Summit called the Charter for Global Democracy. In the UN’s words, the document contained “detailed, practical measures which set out an ambitious agenda for democracy in international decision-making, now increasingly known as ‘global governance.”\n\nThe Charter contained 12 principles or goals. It would consolidate all international agencies under the direct authority of the United Nations. In addition, the UN would regulate all transnational corporations and financial institutions, along with the establishment of a new institution to establish economic and environmental security by insuring sustainable development. The Charter called for a declaration that Climate Change is an essential global security interest that requires a “high level action team” to control carbon emissions. And, the Charter called for the cancellation of all debt owed by the poorest nations, global poverty reductions, and for “equitable sharing of global resources,” including land, air and sea, plus various wealth redistribution schemes. Under the Charter for Global Democracy there would be no independent, sovereign nations, no private property or free enterprise. All would be controlled and regulated by UN edict – all in the name of environmental protection, of course.\n\nBut there is more. To establish a government, three main ingredients are necessary; a revenue taxation system, a criminal court system, and a standing army. Principle 3 of the Charter for Global Democracy demanded an independent source of revenue for the UN. Proposed were taxes on aircraft and shipping fuels and licensing the use of the global commons. The “global commons” are defined to be “outer space, the atmosphere, non-territorial seas, and related environment that supports human life.” In other words, the UN claimed control of the entire planet, its air and water, even outer space, and the power to tax use of it all.\n\nPrinciple Number 5 would authorize a standing UN Army. Principle Number 6 would require UN registration of all arms and the reduction of all national armies “as part of a multinational global security system” under the authority of the United Nations.\n\nPrinciple Number 8 would activate the International Criminal Court, make the International Court of Justice compulsory for all nations, and give individuals the right to petition the courts to remedy what they deemed social injustice, meaning redistribution of wealth based on emotional tirades rather than the rule of law.\n\nThere you have it, all the tools necessary to make the United Nations a full- fledged global government, a government over the whole world. But, the Charter for Global Democracy broke one major rule in the UN’s plans to dominate the world – it was too honest. It lacked the soft sell and, instead, marched brutally forward, revealing their true agenda. It was never officially presented to the Millennium Summit for world leaders to approve in front of the cameras. However, it remains a shadow agenda, with parts included in other documents. The Criminal Court does exist and there is still a drive for an environmental court. The UN continues to push for full ratification of the Law of the Seas Treaty that would give it full control of the waters of the planet. While the United States has not officially ratified the treaty, Congress has promoted regulations through the Environmental Protection Agency (EPA) to enforce many of the same goals.\n\nMeanwhile, the UN has continued to add more details, a little at a time, through documents released at yet more international gatherings. The Millennium Summit did issue 8 goals, mostly focusing on eradicating poverty, respecting nature, and “Protecting the Vulnerable.” The goals are there, just not the direct wording of the Charter. Peace, Brother!\n\nIn 2016, the UN issued Agenda 2030, containing 17 goals. They are all the same as Agenda 21 and the Millennium Goals, however each new document issued reveals a little more detail as the UN moves ever closer to enforcing all 12 principles of the Charter for Global Democracy.\n\nMost recently, however, the Sustainable forces again took off the gloves of misdirection, and this time they have gotten away with it. This latest version is called the Green New Deal and it didn’t come as a declaration or a suggestion from another summit. This time it came as actual legislation introduced into the U.S. Congress and has been openly accepted as the center of political debate across the nation.\n\nEven though the word “green” is in the title, it, too, is not an environmental policy. The Green New Deal is an economic plan to reorder society away from free enterprise, private property, and limited government. Gee, where have we heard that before? Oh yes, Agenda 21, Agenda 2030, and the Millennium Declaration!\n\nThe Green New Deal is divided into four pillars. First is the Economic Bill of Rights, demanding full employment, guaranteeing a living wage, Medicare for all, tuition-free education and the right to affordable housing. Can you find any issue there that is designed to save the planet?\n\nPillar 2 is labeled the Green Transition. Surely here is where we will find concerns expressed for clean rivers and air, right? Nope. We find money and tax schemes for global corporations who agree to play ball and spread the sustainable propaganda. This helps to fill their pockets as it kills competition from small, independent businesses. There’s also the usual attack on cars along with schemes to end shipping of food and products by truck or air. Each community, you see, will be responsible for providing all of its needs for the local population.\n\nPillar 3 called Real Financial Reform, turns banks into public utilities run by government, doing away with the stock market, all leading to higher taxes and the end of freedom of choice for your financial needs.\n\nPillar 4 is called a Functioning Democracy. It calls for the creation of a “Corporation for Economic Democracy” that will basically combine government agencies, private associations, and business enterprise into one big corporation, all to be controlled by one, central ruling authority. The last time I checked on such an idea it was called communism.\n\nMy colleague, climate change expert Paul Driessen, produced a very clear picture of what life will be like under the Green New Deal. Are you ready America? According to Paul’s analysis, the GND would, “control and pummel the jobs, lives, living standards, savings, personal choices and ecological heritage of rural, poor, minority, elderly and working classes.” Says Paul, the GND would turn middle America into vast energy colonies. Millions of acres of farmland, wildlife habitat, and scenic areas would be blanketed by industrial wind, solar, and battery facilities. Windswept ocean vistas and sea lanes would be plagued by towering turbines. Birds, bats, and other wildlife would disappear. As you are forced to rip out exiting natural gas appliances from your kitchen, replacing them with electric models, electrical power would only be there when its available, rather that when you need it. And don’t forget, as the GND moves to ban petroleum, pharmaceuticals, cosmetics, paints, synthetic fibers, fertilizers, plastics for computers would all be gone, along with millions of jobs. Not to mention that the cost of near non-existent energy would soar.\n\nThis, then, is the future offered to us by the power-mad control freaks now plotting every day to “reorganize human society.” These policies now dominate political debate and are becoming established in more and more states and communities, yet any attempt to reveal the true goals are immediately labeled “conspiracy theories” and those sounding the alarm are called extremists.\n\nMeanwhile, as we have all suffered through the COVID lockdowns, the forces behind these policies have been busy planning ways to use tactics they have learned from enforcing the pandemic to move forward with a “Green Reset” to tackle the so-called climate crisis. In a recent issue, Time magazine announced the “Great Reset,” asserting “The COVID-19 pandemic has provided a unique opportunity to think about the kind of future we want… to share ideas for how to transform the way we live and work.”\n\nBill Gates said that large-scale economic shutdowns are “nowhere near sufficient” to curtail climate change. Rather, we need “to get rid of emissions from all the different sectors.” He went on, “Simply shutting down (the economy) is not going to get (us) to our goal. So just like we need innovation for COVID-19, we also need to get rid of emissions from all the different sectors and bring down climate change.” Are you ready to live in a cave with no heat or running water to satisfy Bill Gates’ demands to reorganize society? What else would be the alternative if we must completely shut down our entire infrastructure of transportation, industry, buildings, electricity, etc?\n\nGreen New Deal advocates, like Gates, see the COVID-19 outbreak as a signal to the international community that it is necessary to reform humanity’s relationship with nature, pointing to concerns that “as habitat and biodiversity loss increase globally, the coronavirus outbreak may be just the beginning of mass pandemics.” That’s the new scare tactic – piled on top of climate change. Just as the Club of Rome prediction declared decades ago, the real enemy is humanity itself. So there it is, now facing us like never before – the interconnection of climate change, the Green New Deal, and the COVID-19 pandemic. Step by step, changing and controlling human society.\n\nThe COVID-19 lockdown has been the master experiment as to how much manipulation people will accept out of fear. It has been the grand experiment to get us to stop driving, reducing energy use, and change our living habits. All called for in the Green New Deal. Arn Menconi, an environmental activist and recent candidate for the Colorado state senate said, the “coronavirus has proved we can afford the Green New Deal and Medicare for all.”\n\nBut there is much more planned for the reorganization of human society that few have counted on. Take careful note of the growing manipulation of the free market, a main target of Agenda 21/GND policy. Global corporations, such as Amazon and Walmart, that have agreed to join in Public Private Partnerships (PPPs) with government to promote the Sustainable policies, have been allowed to continue near normal operations and they are thriving in the lockdowns. Meanwhile local, small, independent businesses have been forced to close their doors. As those small business jobs are lost, employees are left with little alternative than to seek positions in the global behemoths or accept government handouts. Soon, we will begin to see the corporations demanding that employees accept Bill Gates’ mandatory COVID vaccines or lose their jobs. That means that more and more will have no choice but too march in lockstep with the dictates of their masters. Free thought, free market competition, and free expression will no longer exist anywhere but in the minds of those old enough to remember “when”. These are all the enemies of totalitarianism and must be curtailed.\n\nThey’ve managed to find the perfect scare tactic to get us all to “voluntarily” give up our liberties, allow government to shut us in our homes, kill our jobs, stop our schools, and destroy human contact. They have finally achieved the vision of British monarch, Prince Phillip who once said, “If I were reincarnated, I would wish to be returned to Earth as a killer virus to lower human population levels.” Never tell these people a joke, because they will eventually turn it into global policy!\n\nHow do we stop this drive to destroy our way of life? One thing the COVID lock-down has proven, is that we must regain control of local and state governments. It was mayors and governors who led the way to enforce most of the draconian controls over our ability to move about, go to work and church, see our doctors, and open our businesses. That’s why it’s imperative that those concerned about stopping this transformation must become active on the local level, organizing, researching, speaking out and running effective local government campaigns.\n\nOne major obstacle standing in the way of the forces of freedom to stop this drive for global governance is that too many on the Right have ignored the threat, joining in the chorus against we who have been sounding the alarm. Not one mainstream, Washington, DC-based conservative organization will even mention the words Agenda 21 or the many issues connected to the global agenda. Many Republicans in Congress lamely accept many of the environmental positions, instead offering lighter, “more reasonable” positions. Once they do that, they’ve already lost the argument. Today’s mainstream Conservative movement has changed little of their tactics from those used 50 years ago, when they were fighting Soviet communism. Yet, as the environmental movement takes over the American beef industry and leads the way to destroy private property rights and single-family neighborhoods, little action is taken. We cannot win if we ignore the massive loss of property in cities and farms. We cannot win if we fail to stand with the growing number of Americans who are suffering from the radical environmental assault. We have to change the debate and appeal to the growing legions of victims. And we must learn that the most effective place to begin the fight is on the local level in our communities – not on Capitol Hill.\n\nIn 1980, Ronald Reagan beat Jimmy Carter in 49 states. Think about that when you look at today’s election results. When that happened, the Left said “never again” and they began to organize. They focused on the local level and not just city council and county commission races. No position was too small or unimportant, including appointed boards, and even city hall jobs. These are the places where policy is decided and regulations, licensing, and government attitudes are prepared and carried out. When was the last time a local Republican group discussed the importance of the office of City Attorney? Yet these are the positions of power that have enforced the COVID lock-downs. After this most recent election don’t you wish we had some influence over voter registration and Board of Elections? This is how the Democrats have managed to turn formerly red states blue. Pure determination.\n\nEvery freedom-loving American must become vitally aware that we now face the most powerful, determined force of evil to ever threaten humanity. To defeat them we must become equally determined to do the dirty work which our side has ignored for fifty years. This includes, local organization of precincts, finding viable candidates to run, and controlling the debate over issues as they appear, making sure our side is heard. We must decide to relentlessly focus on the three pillars of freedom, including protection of private property rights, taking necessary steps to help small business thrive, and assure that government is a servant of the citizens rather than citizens submitting to government.\n\nTake such actions to secure your community as a Freedom Pod where these rights are the backbone of every decision made by your local government. If you are successful, the idea will get the attention of neighboring communities and another Freedom Pod will be planted there — and then the next and the next. These are the actions we must take to “flatten the Socialist curve” and take America back! As Winston Churchill said, “Never Give In, Never, Never, Never.”", "opengraph": {"locale": "en_US", "site_name": "American Policy Center", "title": "Agenda 21 to Green New Deal - The WAR on Human Society", "url": "https://americanpolicy.org/2020/12/14/agenda-21-to-green-new-deal-the-war-on-human-society/", "type": "article", "description": "For nearly thirty years, as some of us have attempted to sound the alarm over plans to reorganize human society into global governance, we have been mercilessly attacked and labeled as radical conspiracy theorists.\r\n\r\nNow, as those very plans move ever closer to enforcement, many are beginning to as", "image": "https://americanpolicy.org/wp-content/uploads/2020/04/original.jpg", "image:url": "https://americanpolicy.org/wp-content/uploads/2020/04/original.jpg", "image:secure_url": "https://americanpolicy.org/wp-content/uploads/2020/04/original.jpg", "article:published_time": "2020-12-14T11:16:02-05:00", "article:modified_time": "2020-12-14T11:16:43-05:00", "updated_time": "2020-12-14T11:16:43-05:00", "article:section": "Sustainable Development", "article:publisher": "https://www.facebook.com/americanpolicycenter/"}, "tags": [], "tweets": [], "movies": [], "links": ["https://americanpolicy.org/category/sustainable-development/", "https://americanpolicy.org/author/tom-deweese/", "https://americanpolicy.org/category/property-rights/"], "authors": [], "publish_date": "2020-12-14T11:16:02-05:00"}