{"result_id": "026011", "URL": "https://americanpolicy.org/2022/04/21/animal-rights-and-eugenics-cancelling-more-than-culture-cancelling-humanity/", "timestamp": "2023-04-25 12:03:47 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://americanpolicy.org/wp-content/uploads/2020/03/faveagle.png", "canonical": "https://americanpolicy.org/2022/04/21/animal-rights-and-eugenics-cancelling-more-than-culture-cancelling-humanity/", "encoding": "UTF-8"}, "image": null, "domain": "americanpolicy.org", "title": "Animal Rights and Eugenics - Cancelling more than culture, cancelling humanity", "cleaned_text": "Animal Rights and Eugenics – Cancelling more than culture, cancelling humanity\n\nFor over 30 years we have been telling people that Agenda21/2030 was designed to destroy property rights, giving control of the land to the government, thus making us slaves; and to reduce the human population by billions. But, because we spoke of the reduction of the population, we were scoffed at because people couldn’t see it until it was in their faces, their homes. Even though many famous people from Ted Turner to Jacques Cousteau called for it. Until Covid. Abortion was condoned by the Supreme Court of the United States no less. People in faraway places – Africa, India – were being killed or sterilized by “vaccines”. Maybe not ho hum, but still, too far away to get worked up about.\n\nNow, besides a so-called pandemic that wasn’t, but gave the Globalist the opening to bring in a killer vaccine, we got a vaxx that wasn’t tested (or was and it did exactly what the Globalists wanted, to kill off useless eaters). And if that vaxx doesn’t kill you, it can make you sterile and destroy your immune system. Interestingly, Animal Rights Philosopher Tom Regan wrote that “we humans should be subjected to the diseases we would be heir to.” In other words, kick science out, we need to die of diphtheria, cholera, scarlet fever, infection. Interestingly, this vaccine is made, not to make us well, but to bring on our deaths. Now, he might be for this so-called science. It is a weapon.\n\nWe will start seeing more and more methods, asymmetrical weapons, to “off” us. But one that is not new, abortion, is being given a real boost – and extra power. Several states have introduced bill to allow “abortion” (after birth it isn’t abortion, but murder) up to a month after the baby is born. This idea isn’t new, but with a totally controlled media, it has gained power and is being promoted wildly.\n\nWhere does animal rights come into the abortion issue? you ask. Peter Singer, the “father” of animal rights has been promoting abortion for up to two years after birth. Now you ask, why do animal rightist care about babies? Because babies are human beings, and the bottom line of animal rights is to rid “mother earth” of humans so what animals are left (domesticated animals will also be erased by them) can roam the world in peace. Un huh, the lion won’t eat the lamb? Animal rights is solely about getting rid of humans. They not only don’t care about animal welfare but are against it because it slows their mission.\n\nPeter Albert David Singer is an Australian moral philosopher, currently the Ira W. DeCamp Professor of Bioethics at Princeton University, according to Wikipedia. In 1975, Peter Singer wrote in the introduction to his book, Animal Liberation, “My wife and I don’t really care about dogs and cats and horses like other people.” So, tell me that animals are what he and the whole animal rights movement are all about. In 1993, he contends that neither fetuses nor newborn infants are persons, because neither are rational, self-aware beings, so their lives can reasonably be judged to be not worth living and they can be “replaced” by healthier, happier future humans.\n\nSinger brags about his notoriety for his statements: “My views are perceived to be threatening by a segment of this society, and it’s a segment that comes largely from the Christian viewpoint. And that segment feels in some sense of crisis because it has lost some important battles, notably the abortion battle. I state my opposition to that viewpoint more bluntly than most people do. This is a society that does need to hear some of the things I’ve got to say.” That society he mentions, the one coming from the Christian viewpoint, hears what he says and, being moral beings, reject it.\n\nAnd Environmentalist Dave Foreman, co-founder of Earth First! said, “Phasing out the human race will solve every problem on earth, social and environmental.” Yes, deep ecologists, World Wildlife Fund (Foundation), and many environmental organizations also promote eugenics. And they are all Non-governmental Organizations (NGOs) connected with the United Nations. This is one big cabal to erase rational, moral mankind off the face of the earth, whatever their personal reasons.\n\nDon’t discount them because they are on the lunatic fringe. That fringe is now a big cog in pushing Public/Private Partnerships. From my article, “Reinventing Government”, A public private partnership is a partnership that is a business arrangement; it is for profit. A partnership can have two or more partners, plus several layers of partnerships, which are all interrelated. It has partners that are both public, meaning government, and private, meaning individuals, corporations, foundations, and/or non-governmental organizations. A PPP includes all levels of government, from local government to county, state, regional, and federal. In addition to international agencies and foreign governments, public private partnerships include a wide range of non-governmental organizations. These can include any corporations, national, multinational, or transnational corporations and non-governmental organizations like the Nature Conservancy, Sierra Club, Humane Society of the United States, and foundations like Ford, Mellon, Rockefeller. They also include Facebook (now META), Big Pharma – you get the picture.\n\n“When you bring these entities together, where does the power lie? With the deepest pockets. Is that government? Not even close. It’s business. Remember, they are “reinventing government” another form of transfer of power and destruction of our American form of representative government. As a result, representative government disappears.”\n\nNow these NGOs, at the behest of the big businesses that are running the world today, have been ordered to focus on reducing the human population. Can you imagine how happy they are, doing what they were set up to do?\n\nThis is one issue that should get most of the population up in arms, figuratively. If there is already legislation being promoted in your city or state to allow afterbirth murder, jump on it. If it isn’t there yet, it probably will be soon enough. Be ready. Keep in mind, this is going in one direction. The drumbeats are for this; the silent majority is not. The media is for this; any person with a functioning moral compass is not.\n\nBecause of these reasons, we the “rabble”, the common folk must stand up. For every candidate running for office in your city or state, get them to sign a statement that they will never vote for this. For the office holders now, get them to sign one and let them know this is an issue that you won’t compromise on.\n\nStand up now or you will be on your knees for the rest of your life – and it won’t mean you are praying.", "opengraph": {"locale": "en_US", "site_name": "American Policy Center", "title": "Animal Rights and Eugenics - Cancelling more than culture, cancelling humanity", "url": "https://americanpolicy.org/2022/04/21/animal-rights-and-eugenics-cancelling-more-than-culture-cancelling-humanity/", "type": "article", "description": "For over 30 years we have been telling people that Agenda21/2030 was designed to destroy property rights, giving control of the land to the government, thus making us slaves; and to reduce the human population by billions. But, because we spoke of the reduction of the population, we were scoffed at", "image": "http://americanpolicy.org/wp-content/uploads/2022/04/wolves-gef84d6af6_1920.jpg", "image:url": "http://americanpolicy.org/wp-content/uploads/2022/04/wolves-gef84d6af6_1920.jpg", "article:published_time": "2022-04-21T16:23:18-04:00", "article:modified_time": "2022-04-21T16:23:18-04:00", "updated_time": "2022-04-21T16:23:18-04:00", "article:section": "Uncategorized", "article:publisher": "https://www.facebook.com/americanpolicycenter/"}, "tags": [], "tweets": [], "movies": [], "links": ["https://americanpolicy.org/author/kathleen-marquardt/", "https://americanpolicy.org/category/uncategorized/", "https://en.wikipedia.org/wiki/Moral_philosopher", "https://en.wikipedia.org/wiki/Princeton_University"], "authors": [], "publish_date": "2022-04-21T16:23:18-04:00"}