{"result_id": "026004", "URL": "https://americanpolicy.org/2022/09/13/the-three-es-of-agenda21-2030-or-eugenics-eviction-enslavement/", "timestamp": "2023-04-25 12:03:41 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://americanpolicy.org/wp-content/uploads/2020/03/faveagle.png", "canonical": "https://americanpolicy.org/2022/09/13/the-three-es-of-agenda21-2030-or-eugenics-eviction-enslavement/", "encoding": "UTF-8"}, "image": null, "domain": "americanpolicy.org", "title": "The Three Es of Agenda21/2030 or Eugenics, Eviction, Enslavement", "cleaned_text": "The Three Es of Agenda21/2030 or Eugenics, Eviction, Enslavement\n\nAgenda 21/2030 use interlocking 3 Es – Economic Prosperity, Ecological Integrity, and Social Equity (or in ethical language Eugenics, Eviction, and Enslavement) to define the goal of Sustainable Development.\n\nTo achieve the so-called Economic Prosperity required carry out the plan requires that those who control the world, in the words of the late Rosa Koire, they must first “inventory and control all land, all water, all minerals, all plants, all animals, all construction, all means of production, all energy, all education, all information, and all human beings in the world.”\n\nTo be able to control all human beings in the world means they will first have to reduce the population. There is no way the global elites would be able to control 8 billion people And, there is no way they could feed that many. But they have no plans to feed even half that many. To “cure” starvation” their answer is to get rid of those who are starving along with most of the middle class. We are no longer needed nor wanted. And, we are the class that will not go willingingly.\n\nOverpopulation is a root problem of all the environmental issues. If you can control the population, you can control almost anything. Rinkesh Kukreja, Founder – Conserve Energy Future\n\nIt’s terrible to have to say this. World population must be stabilized and to do that we must eliminate 350,000 people per day. Jacques Cousteau speaking at UNESCO, Nov. 1991\n\nA 2009 study titled “Reproduction and the carbon legacies of individuals,” looked at the relationship between population growth and global warming. It determined that the “carbon legacy” of just one child can produce 20 times more greenhouse gas than a person will save by driving a high-mileage car, recycling, using energy-efficient appliances and light bulbs, etc. “Clearly, the potential savings from reduced reproduction are huge compared to the savings that can be achieved by changes in lifestyle,” Global Population SPEAKOUT, Paris 2015\n\nThe preamble to Transforming our world: the 2030 Agenda for Sustainable Development reads:\n\nThis Agenda is a plan of action for people, planet and prosperity. It also seeks to strengthen universal peace in larger freedom. We recognize the eradicating poverty in all its forms and dimension, including extreme poverty, is the greatest global challenge and an indispensable requirement for sustainable development. (emphasis mine).\n\nThe global elite feel quite certain that they will attain all 17 goals of Agenda 2030 in the allotted time. How do they plan to have poverty in all its forms and dimension, including extreme poverty, eradicated worldwide by 2030? We are watching it before our eyes.\n• The UK Medicine Regulator has confirmed that over a period of nineteen months the Covid-19 Vaccines have caused at least 5.5x as many deaths as all other available vaccines combined in the past 21 years.\n• This means, that when compared side by side, the Covid-19 injections are a shocking 7,402%/75x more deadly than every other vaccine available in the UK.\n• Bill Gates, China, and other globalist parties (including BlackRock and Vanguard are buying up U.S. farm and ranch land.\n• China has bought over 1 million hectares (over 2 ½ million acres) of ranchland in South and Central America.\n• Food production plants and agricultural operations are being burned down, almost daily.\n• The World Economic Forum’s agenda is to stop growth and decide what industries to shut down. People out of work will starve sooner, but the rest of us are slated to be ashes, fertilizer for forests, or perhaps even soylent green for those not yet taken out.\n• 87,000 new IRS agents are being sought who were to “carry a firearm and be willing to use deadly force” (yes, those words were on the IRS jobs webpage until the backlash spurred the IRS to remove the words (but is the requirement still there?). We should not be surprised that an unconstitutional amendment must be backed up by force.\n• Because our country is being run by immoral liars and wannabe world tyrants, we, (mostly the middle class) are the only ones still ruled by a moral compass. Thus, we are the targets.\n\nThe most important question in 21st-century economics may well be, ‘What should we do with all the superfluous people, once we have highly intelligent non-conscious algorithms that can do almost everything better than humans?‘ Yuval Noah Harari, assistant to Klaus Schwab\n\nIn order to arrest or reverse Climate Change you’ve got to stabilize the population, and hopefully, reduce the population by having a one child family for a hundred years. Get population back down to about two to two and a half billion people. Ted Turner\n\nIf you haven’t given voluntary human extinction much thought before, the idea of a world with no people in it may see strange. But, if you give it a chance, I think you might agree that the extinction of Homo sapiens would mean survival for millions, if not billions of Earth-dwelling species. . . . Phasing out the human race will solve every problem, om earth, social and environmental” Les U. Knight, Wild Earth, Vol. 1, No 2 (Summer1991), p.72\n\nThe Earth as we know it will not survive without drastic measures. . . .the only feasible solution to saving the Earth is to reduce the population to 10 percent of the present number. Professor Pianka, University of Texas, 2006\n\nSo, Economic Prosperity is not for the poor, or the middle class. And it probably isn’t for a lot of the upper class. With the few useful idiots the Global Elite need, combined with their robots and artificial intelligent, they expect to live happily ever after. They haven’t read the end of the book: Marxism only destroys. It can only destroy them, also. But I have hopes that they won’t get that far.\n\nTry to nail down the definition of Ecological Integrity. The closest I got is from Conservation Science and Practice, Volume 3, Issue4/e411”The integrity of ecosystems is a property that contemporary conservation biologists and restoration ecologists believe that they can observe and measure, and integrity is often cited as a good reason for taking specific actions, including protecting high-integrity areas and intervening to increase integrity by reintroducing lost species, removing non-natives, and adjusting abiotic elements.”\n\nUnder this label lies an enormous amount of anti-human action. The framework for “Ecological Integrity” is the Wildlands Project (brainchild of Dave Foreman[1] and Reed Noss), now the Wildlands Network. Under the guise of saving endangered species. The legal framework for the plan is found in Article 8a-e of the Convention on Biological Diversity. Working in tandem with the Biosphere Reserve Program, a 1971 creation of the United Nations Educational, Scientific, Cultural Organization (UNESC0), the Wildlands Project gained an instant international position and became the basis for the U.N.’s Convention on Biodiversity.\n\nLike the two parts of Agenda 21 — ????? and Reinventing Government, The Wildlands Project laid down the blueprint for the reorganization of human society, and the other Convention on Biodiversity detailed how it was to be done.\n\nSimply put, the Wildland Project is divided into 21 Bioregions, which then were divided into three zones:\n• Wilderness area, designated as habitat of plants and animals; human habitation and use or intrusion is forbidden.\n• Buffer zones surrounding the wilderness areas. Limited, and strictly controlled, human access is permitted within this zone.\n• Cooperation zones, the only zones where humans are permitted to live.\n\nThe late Dr. Michael Coffman noted the strategy to implement such reserves and corridors would include:\n• Start with a seemingly innocent-sounding program like the “World Heritage Areas in Danger”. For example: Bring all human activity under regulation in a 14-18 million acre buffer zone around Yellowstone National Park.\n• Next, declare all federal land (except Indian reservations) as buffers, along with private land that is within federal administration boundaries.\n• Next, extend the U.S. Heritage corridor buffer zone concept along major river systems. Begin to convert critical federal lands and ecosystems to reserves.\n• Finally, convert all U.S. Forest Service, grasslands, and wildlife refuges to reserves. Add missing reserves and corridors so that 50% of the landscape is preserved.\n• Each of the 21 bioregions will be governed by a bioregion council.\n• “When the councils come into play, local, state, and national government will not be able to interfere with their governance. It will be under the strong arm of the UN Environmental organizations such as the Sierra Club, Nature Conservancy or other Green organizations which will be given the green light (to be) the enforcement arm of these councils at the local level.” (Karen Lee Bixman, “The Takings of America)\n\nOther asymmetrical warfare means of taking land are:\n• by denying water and/or grazing rights to farmers and ranchers or limiting their use of pesticides and herbicides, which in turn will force the farmers and ranchers out of business, causing the land to possibly fall into the hands of the federal gov’t.\n• when Wilderness Areas, Parks, etc. are established. Not only the land is out of production, but, the mineral resources underground or forest above can also be made off-limits for development.\n• by expanding the legal definition of a wetland. By making any trickle of water or puddle a wetland, the EPA can prevent the development of the land and all the land around it. This makes the land worth less and easy to acquire by sundry entities including the gov’t.\n• when an endangered species is located within a forest. Then large areas around this area are made off-limits to development, and once again, the land loses its value and is easily acquired by gov’t.\n• by the direct taking of land through eminent domain.\n\n… when Road RIP, a non-governmental organization, was created for the sole purpose of removing existing roads and preventing the construction of new roads into wilderness areas. Then humans are locked away from land that was once served by roadways.\n\n… when urban boundaries are created around a town, beyond which development may not occur and/or utilities may not be provided. This will destroy the economic value of the rural lands around the town. Comprehensive Land Use Plans in existence today and their policies are creating this scenario.\n\n… when the government declares land part of a flood plain, then forces the homeowners to give up their homes. The homes are then destroyed and the land is not allowed to be developed. The government gets a 2-fer if the land is along a river. Then, not only is the land off-limits to development, the government has total control of the river and the priceless water it contains.\n\n… when a land trust purchases private property rights from a land owner for promises from the land owner to do certain environmentally friendly things. In return the land owner and his heirs are then able to stay on this land in perpetuity.\n\n“The social equity dimension of sustainability refers to how burdens and benefits of different policy actions are distributed in a community. The more evenly they are distributed, the more equitable the community is, and this even distribution is reflected in economic, ecologic, and social outcomes.” Google\n\nThat definition is communism. And the global elite wish us to see it more in that light than what they are doing under the sobriquet of social justice.\n\nAs I see equity as it is now being used as a whipping tool against, depending on the day, anything that doesn’t line up with the Marxist, Cancel Culture neo-shibboleth of the day. So, every day, white, male, Christians, children who are still the sex they were born are unacceptable. For a while, it was the founding fathers and other heroes who helped form America. Those are, mostly, on the trash heaps and in the burned book piles.\n\nIt is also being used to attempt to order that in every business and field of endeavor, be filled by the proportional equivalent of the general population. Has anyone checked the proportions of those classes in the Global Elite?\n\nPlus, somehow equity has become the definition of “if you are anti-free market economics you can plunder businesses; if you are an illegal alien, you can be set free (because it was racist to put you in jail for murder), and you can go murder some more. Keep in mind, this helps on the E for Eugenics.\n\nOnce we are all equal – equally stupid, equally poor, equally non-property owners, we are slaves – owned by the Global Elite.\n\nWashington State Supreme Court Justice Richard B. Sanders said it best:\n\n“Property in a thing consists not merely in its ownership and possession, but in the unrestricted right of use, enjoyment, and disposal. Anything which destroys any of the elements of property, to that extent, destroys the property itself. The substantial value of property lies in its use. If the rights u use be denied, the value of the property is annihilated, and ownership is rendered a barren right.\n\nWhat we are seeing in social justice is being made into slaves by our fellow citizens who are going right down that road with us – they just don’t realize it. Don’t pity them, they deserve it. We don’t.\n\nIf, as Mattias Desmet says in The Psychology of Totalitarianism, it takes no more than 30% of the population to fall sway to “mass formation spurred by a singular, focused, crisis narrative that forbids dissident views and relies on destructive groupthink.” Ponder that as you recount the past two years.\n\nThen, please, let’s hear the lion roar – all 60+% of us.\n• Dave Foreman was founder of EarthFirst! a radical environmental group that in invented Monkeywrenching – destroying forest and industrial equipment, spiking trees to maim or kill workers, sabotaging dams, ski lifts, and electrical towers. ↑", "opengraph": {"locale": "en_US", "site_name": "American Policy Center", "title": "The Three Es of Agenda21/2030 or Eugenics, Eviction, Enslavement", "url": "https://americanpolicy.org/2022/09/13/the-three-es-of-agenda21-2030-or-eugenics-eviction-enslavement/", "type": "article", "description": "Agenda 21/2030 use interlocking 3 Es – Economic Prosperity, Ecological Integrity, and Social Equity (or in ethical language Eugenics, Eviction, and Enslavement) to define the goal of Sustainable Development.\r\n\r\n Economic Prosperity \r\n\r\nTo achieve the so-called Economic Prosperity required carry out", "image": "http://americanpolicy.org/wp-content/uploads/2022/09/solar-g0baf69997_1920.jpg", "image:url": "http://americanpolicy.org/wp-content/uploads/2022/09/solar-g0baf69997_1920.jpg", "article:published_time": "2022-09-13T10:48:44-04:00", "article:modified_time": "2022-10-17T17:11:31-04:00", "updated_time": "2022-10-17T17:11:31-04:00", "article:section": "Sustainable Development", "article:publisher": "https://www.facebook.com/americanpolicycenter/"}, "tags": [], "tweets": [], "movies": [], "links": ["https://americanpolicy.org/category/mcmkm/", "https://americanpolicy.org/category/sustainable-development/", "https://americanpolicy.org/author/kathleen-marquardt/", "https://americanpolicy.org/category/featured-posts/", "https://www.conserve-energy-future.com/15-current-environmental-problems.php", "http://blog.oregonlive.com/environment_impact/2009/07/carbon%20legacy.pdf", "#post-13157-endnote-1", "#post-13157-endnote-ref-1"], "authors": [], "publish_date": "2022-09-13T10:48:44-04:00"}