{"result_id": "026012", "URL": "https://americanpolicy.org/2002/03/29/dont-sacrifice-liberty-to-terrorism/", "timestamp": "2023-04-25 12:03:48 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://americanpolicy.org/wp-content/uploads/2020/03/faveagle.png", "canonical": "https://americanpolicy.org/2002/03/29/dont-sacrifice-liberty-to-terrorism/", "encoding": "UTF-8"}, "image": null, "domain": "americanpolicy.org", "title": "Don't Sacrifice Liberty to Terrorism", "cleaned_text": "How Americans respond to the terrorist attack of September 11th is vital to the survival of our nation’s unique liberties. Which will we choose for our future? Liberty, free of massive government intrusion in our lives? Or the false promise of a neatly tucked safety blanket?\n\nWe can build a concrete bunker around us and our families, make it impenetrable by nuclear bombs, killer chemicals and diseases and crashing air planes, and shudder in fear as we accept our fate of the “new reality” of a dangerous world. We can make a pact with the government that it can take our ability to move about freely; it can take away our personal privacy; it can strip search, number and process us, if only the government will make us safe.\n\nOr we can stand up in the fresh air of an American morning, raise our fists to the sky in the resolve that we won’t surrender American liberty to terrorists – or big brother- government in the name of security.\n\nWhich will it be, America? You can’t have both.\n\nSome Americans are in a panic since the attacks of September 11th. They are willing to toss out everything that is sacred to Americans in exchange for a false security. This world is no more dangerous than it was on September 10th. Terrorism has been a threat for decades.\n\nBut Americans chose to do nothing about it. Our government, particularly under Bill Clinton, played footsy with these thugs, decimated our security and intelligence-gathering systems and pretended that UN-controlled diplomacy would make the problem go away. It didn’t. On September 11th, terrorists showed this nation what happens when you disregard protecting your own borders; ignore the responsibilities of defending national sovereignty and treat the gift of American citizenship like a cheap snack. Now these same American citizens who never cared about the world of politics, and who have no understanding of what defending liberty means – are ready to force all of us into living in an armed camp for their own security.\n\nThe fact is there is no safety from terrorists. They can find a way to foil every single security system we create. They can forge every document or identification card the government mandates. The more that Americans are forced to disarm, the more everyday items can be converted into weapons. There is no way to detect tiny vials of killer diseases like Anthrax. There is no way to completely control our borders to keep terrorists out of our country. There is no way to monitor every telephone conversation and computer transmission to find them. In short, if a terrorist, who has no regard for innocent lives or his own, wants to kill you – he will.\n\nThe only answer is to eliminate the terrorists. President Bush declared war on terrorism. That act takes away the need to grant terrorists Miranda rights. They don’t have any. To spend time pursuing the terrorists, as in a criminal investigation, would be comparable to hunting down and arresting the pilots of the Japanese planes which bombed Pearl Harbor. We declared war on Japan and destroyed its ability to threaten us again – nothing less. And there should be no less response today.\n\nPresident Bush told the world, “either you are with us or you are with the terrorists.” That statement drew massive applause and world-wide support. Now the President must act on it. We must make it very dangerous for any nation to even think of harboring this enemy. We must cut off trade, aid and civility to any nation involved with the terrorists. If a nation hesitates or holds back information or cooperation, they should be immediately put on our enemies’ list. We must make it a painful act to oppose the United States. Why? Because we are at war. Diplomatic niceties are over.\n\nThe United States should not hesitate to use any weapon in our arsenal. Nations which might even think about helping our enemies must understand that they face grave risks. This includes the threat of the possible use of nuclear weapons. There is successful precedence for such a threat in the 1991 Gulf War. Then, Secretary of State James Baker issued such a private warning to Iraq that the United States would use such weapons of mass destruction if Saddam used chemical weapons against American troops. Even though Iraq possessed a massive stock pile of chemical weapons, it never used them, fearing such American retaliation.\n\nNuclear threats aside, we should use our massive firepower to destroy any known or suspected facility that produces or stores chemical or biological weapons. The United States has no ability to protect American citizens from this threat. Therefore, the only possible choice is to eliminate them altogether.\n\nThe United States of America was attacked, innocent people were killed, our economy damaged, our people live in fear of pursuing their happiness, even though it is our Constitutional right. That is an act of war. The enemy who did it must pay for the deed. The U.S. government must fight that war with the determination that American liberty will not be sacrificed at the expense of an undefined safety. This must not be a “war without end.” We’re not living is some new reality. We have just ignored an enemy too long. So, now, destroy the enemy and end this threat, quickly.\n\nTo fight this war at home and assure as much safety as possible for the American people, the government must create policy and procedures that will actually have the effect of deterrence against terrorism, without diminishing the rights and liberties of Americans. Yes, it may be necessary for a few sacrifices – temporarily. The American people have proven time and again that they are willing to do that to insure victory. But it is the government’s job to treat those sacrifices as a temporary, sacred trust and to restore those liberties fully, rather than try to make them permanent policy.\n\nIt is the tendency, in an emergency, for scared people to demand that something – anything – be done, whether it is effective in solving the problem or not. Politicians tend to answer these pleas with tons of rules and regulations, most just as thoughtless as the pleas. Some elected officials and bureaucrats use that panic as an opportunity to enhance their agenda to increase big-brother government. And those simpering Americans who demand safety over liberty help the social planners do it.\n\nIt is common, for example, for demands of more gun control after a tragic shooting, even if existing laws were broken or ignored. Worse, there have been cases where stronger gun control laws were demanded, even when no gun was used in the crime. Such is the logic of panic. Such is the logic behind many of the current proposals for national security against terrorism. Because the terrorists used knives in the September 11th hijackings, now Transportation Secretary Norman Mineta is actually suggesting that knives and forks (even plastic ones) be banned from anywhere in an airport, even in the restaurants. How silly. Most of the new “lock-down procedures will do absolutely nothing to deter terrorism. They will only inconvenience Americans and increase the power of government, in the name of safety.\n\nSpecifically, how should the government respond to be effective against terrorism while protecting liberty? Here are a few suggestions:\n\n· The news media is reaching almost hysterical levels in reporting possibilities for chemical or biological attacks. Other reports say it’s not a probable situation. The threat is real. Since we are in a war, action must be taken to eliminate this threat. As the military is destroying enemy supplies of chemical and biological weapons, the U.S. government should immediately begin to build reserves of vaccines to inoculate American citizens from Anthrax. Contrary to the assurances of HUD Secretary Tommy Thompson, other reports indicate that the country doesn’t even have enough of the vaccine to protect the military. There is none for common citizens. The plant that produces it is shut down pending FDA approval for some plant renovations in 1998. The FDA needs to get out of the way and allow that plant to start producing vaccines now. Once a biological attack has taken place it will be too late to save Americans.\n\n· In some parts of the country there are biotech sensors in place to detect the release of such weapons. The Anthrax virus is completely invisible and undetectable by humans – until it’s too late. The sensors would alert us that such an attack has taken place and help the government to contain it. Such sensors should be expanded to any place where large groups of Americans gather, including office buildings, airports, train stations, etc.\n\n· To increase security on airline transportation, one area is essential to stopping the threat of terrorism: cockpits. Armored doors and armed pilots will go a long way toward eliminating hijackings. FAA rules must be changed to allow pilots to carry firearms. At one time they were permitted to do so, then the FAA changed the rules to require commercial pilots to attend FAA-administered training classes. But the FAA never held the classes, effectively stopping any pilot from carrying a firearm. It’s time to get the bureaucrats and their red tape out of the way. Congressman Ron Paul has introduced legislation to allow pilots to carry firearms.\n\n· It is a mistake to place the federal government in complete charge of airline security. The FBI, FAA and CIA failed in their duty to detect and protect the American people from terrorist attack. Now Congress and the President want to throw more money at these failed agencies and beef up a system that is not working. Instead, the airlines should be given a free hand to enforce their own security. A market-driven solution would give airlines the opportunity to provide the best and safest service and give the consumer a choice in airlines. If an airline wants to use strong tactics to enforce safety of its planes it would be the best source to judge what’s necessary. Let them charge more for the service. People will pay to be safe. An airline which wants to survive this crisis with a strong bottom-line profit will find a way to assure its passengers that it is protecting them. The proposed, so-called government/private partnership for airline and airport security now being proposed is socialism. It’s the same scam government has been using in the massive property grabs across the nation in the name of protecting the environment. Such a partnership may well lead to the nationalization of the airline industry – in the name of safety.\n\n· The government should certainly renew the sky-marshal program. We have cops on street corners, but none in the sky. That creates the atmosphere of anarchy. But the government can’t possibly provide enough marshals to protect every plane. One could be overpowered. Backups would require more than 60,000 marshals. One solution to this problem would be to encourage off-duty cops to carry their weapons on the plane. The airlines could even offer a discount to cops to do so. Then potential hijackers would have no idea how many armed passengers they faced, giving advantage to the passengers.\n\n· To stop the terrorists’ ability to quietly move into the country, cancel all visas of aliens from Arabic countries. That’s not racism. This is war. If you’re going to fight a war, instead of conducting a criminal investigation, then remember – war is hell. It’s our country and we have a right to protect it. Constitutional rights apply only to Americans.\n\n· Further, require approval from the Immigration Service before any aliens can board an American plane. Make them prove who they are and that they have legitimate business in our country.\n\n· Beef up border security along the Canadian and Mexican lines. There are Mexicans just walking across the border now. How are we going to stop a terrorist from doing the same thing – with Anthrax?\n\n· Increase America’s intelligence-gathering capability. Since the Democrats decided to punish Richard Nixon in the 1970’s the intelligence community has been steadily diminished. The Clinton Administration enforced a regulation that prohibited the CIA from using informants that had a human rights record. They could only use official embassy personnel to ask polite questions. That means that the United States has no intelligence-gathering capability. Spying is a dirty business and one uses dirty people who wallow with your enemies in order to gather information. Why? Because they are the ones who know something.\n\n· The United States must take every necessary step to become self-sufficient. That means drilling American oil, especially in Alaska in the ANWR refuge. It also means keeping the American timber, steel and cattle industries strong. Wrong-headed environmental policies that are helping to destroy America’s ability to provide for itself in the name of globalism must be reversed.\n\n· The United States must move forward with a missile defense shield. The terrorists used our own planes against us this time. Within a few years they may have their own missiles. To ignore that threat – or the current buildup of the world’s worst terrorist state – China – is pure folly. Again, radical environmentalists are using every tactic possible to delay the building of the missile shield. For those of you who want to be truly safe – toss them out of the way and get it built.\n\nThese are a few basic, but effective ideas that could help eliminate the threat of terrorism on our shores. More importantly, not one of these procedures would diminish American liberties. They would diminish the liberties of non-Americans while they are in this country. It’s war. National ID – Shield of the Great American Chicken!\n\nEvery time I write articles opposing the implementation of a national ID card, I get letters from supposedly conservative, patriotic Americans, boldly telling me that I am off- base on the issue. Previously they have told me that an ID card is the only answer to stop illegal immigration. Now they add a new verse to stop terrorism. How pathetic they are, hiding behind a shield of plastic.\n\nThere is no time, ever, when Americans should surrender their liberty to the constant surveillance by the government. To the person who wrote to me saying, “if it will save one life, protect one family, stop one act of violence – then I fully support a national ID card,” I ask, have you thought for one minute how a national ID would provide that protection?\n\nImplementation of a national ID would require that the government set up a massive data bank, containing every single detail about you, from school records to medical records to employment and financial records. Now the government knows about you. What do they know about the terrorists? Nothing, except the false information they have been able to place in the data bank. Cards can be forged. Security or airline personnel can be bribed. Government workers can be careless. Terrorists will not be affected by a national ID card. You will.\n\nGeorge Orwell once wrote, “Political language…is designed to make lies sound truthful…and to give an appearance of solidity to pure wind.” For several years certain politicians have tried to enforce the idea of a national ID on the American public. In 1996, they almost succeeded by quietly placing special language in three separate bills including the Illegal Immigration Reform and Immigration Responsibility Act, The Welfare Reform Act and the Kennedy Kassenbaum Medical Reform Act. Each of these bills contained identical language that established the Social Security number as a common identifier number to be used in state driver licenses. The bills were all passed into law and were to go into effect in October, 2000. The laws were repealed by language provided by Senator Richard Shelby of Alabama. Since then, those same politicians have been trying to find new ways to create the ID again.\n\nNow, many, led by House Minority Leader Dick Gephardt are jumping on the politics of fear to push again for the establishment of a national ID card. They tell us we live in a new world of terror. That we must all learn to sacrifice just a little bit to survive. Instead of helping to push policies that would eliminate the fact of terrorism, as outlined above, they are seeking ways to build the power of government.\n\nThese policies would include massive use of surveillance cameras, ID cards, profiling, wiretapping, financial snooping, e-mail eavesdropping, facial imaging scans in public places.\n\nAll of this information would go into federal data banks of records created for every single American. With it, the government could trace our whereabouts, monitor our travel, look into our personal correspondence, examine our financial records and medical records, profile our spending habits and have the ability to keep us in its control. Making prisoners of all Americans will do very little to track down terrorists who know how to hide from the system and forge documents. All of this information would be under the control of government bureaucrats. Today, of all the current information now in federal data banks, more than thirty percent is incorrect. How does it get corrected? Who do we turn to with a problem? Such mistakes can cost us jobs and bank loans.\n\nHave you ever been to a government agency to try to confront a problem. Have you ever felt like a number? Have you ever felt less than human. Then what will change when all of us are required to carry a national ID card to prove we are who we say we are? The only ones who can beat this system are criminals. It will do nothing to protect us from terrorists.\n\nWe do not live in a new world. We have an avowed enemy which has threatened us for years, and we ignored him. He has struck. He has killed. And he has made us mad and afraid. Our only solution is to eliminate him and carry on – not to hide in our bunkers afraid to meet the sunshine. And certainly not to hide behind the false security of government tyranny. If we intend to surrender our way of life to some fanatics, to resort to hiding, shuddering and simpering for mercy, then we have no right to carry the banner of our founding fathers. They would be appalled at this repulsive display of cowardice. They created our government for one purpose – to protect our freedoms, not to control our lives.\n\nStand up and fight, Americans. Fight for your liberty and the special gifts it has given you. Get mad at anyone who would threaten it, including government bureaucrats and politicians. And never surrender your freedom. We have to fight back against the enemy called terrorism. We don’t have to create a society of tyranny to do it.", "opengraph": {"locale": "en_US", "site_name": "American Policy Center", "title": "Don't Sacrifice Liberty to Terrorism", "url": "https://americanpolicy.org/2002/03/29/dont-sacrifice-liberty-to-terrorism/", "type": "article", "description": "By Tom DeWeese\n\n \n\nHow Americans respond to the terrorist attack of September 11th is       vital to the survival of our nation’s unique liberties. Which will we       choose for our future? Liberty, free of massive government intrusion in       our lives? Or the false promise of a neatly tucked saf", "article:published_time": "2002-03-29T16:22:16-05:00", "article:modified_time": "2022-10-27T09:38:35-04:00", "updated_time": "2022-10-27T09:38:35-04:00", "article:section": "Privacy Rights", "article:publisher": "https://www.facebook.com/americanpolicycenter/"}, "tags": [], "tweets": [], "movies": [], "links": ["https://americanpolicy.org/category/privacy-rights/", "https://americanpolicy.org/author/tom-deweese/", "https://americanpolicy.org/category/more-issues/"], "authors": [], "publish_date": "2002-03-29T16:22:16-05:00"}