{"result_id": "026014", "URL": "https://americanpolicy.org/2022/06/09/we-the-people-just-stopped-who-for-now/", "timestamp": "2023-04-25 12:03:49 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://americanpolicy.org/wp-content/uploads/2020/03/faveagle.png", "canonical": "https://americanpolicy.org/2022/06/09/we-the-people-just-stopped-who-for-now/", "encoding": "UTF-8"}, "image": null, "domain": "americanpolicy.org", "title": "We the People Just Stopped WHO - For Now", "cleaned_text": "We the People Just Stopped WHO – For Now\n\n“We the People” threw a sabot into the machinations of the WHO, the World Health Organization, stopping them from setting up a system that would grossly infringe on our national and individual sovereignty. In January, the Biden administration proposed amendments to the International Health Regulations (IHR) that cover 194 Member States. According to the IHR: “While disease outbreaks and other acute public health risks are often unpredictable and require a range of responses, the International Health Regulations (2005) (IHR) provide an overarching legal framework that defines countries’ rights and obligations in handling public health events and emergencies that have the potential to cross borders.” Overarching means comprehensive, all-embracing, and that, in my opinion, defines their aims exactly – and the reason to get the U.S. out of the WHO and, ultimately, the U.N. if we wish to save this country.\n\nThe amendments that started this whole firestorm would have given unilateral power to the Director General of WHO to determine WHAT CONSTITUTES A PUBLIC HEALTH EMERGENCY of international concern. Peter Breggin, a Harvard-trained psychiatrist, former U.S. Public Health Service officer, and former National Institute on Mental Health (NIMH) consultant, wrote, “The power to declare health emergencies is a potential tool to shame, intimidate, and dominate nations. It can be used to justify ostracism and economic or financial actions against the targeted nation by other nations aligned with WHO or who wish to harm and control the accused nation.” That would definitely be a tool in the globalists’ asymmetrical warfare arsenal. WE DON’T WANT IT.\n\nThink about what constitutes a public health emergency. Does the non-existing climate change constitute a public health emergency? Tedros Adhanom Ghebreyesus, the Director General of WHO (which is under the U.N. umbrella) would most likely believe it so. In fact, the World Health Organization has stated that Climate change is the biggest health threat facing humanity[1]. Bigger than COVID? Then it would definitely give Ghebreyesus a free hand to let those amendments loose on the world’s population.\n\nOne of the actions taken by “we the people” that was so very effective during this last skirmish was submitting responses re the proposed amendments. Dozens were able to submit their oral objections and many thousands sent in their objections. The WHO said they had received over 30,000 responses – most of them negative. There will be no invitation for responses this time.\n\nWe bit the bullet – until next week. Yep. The WHO pulled a silly and fully illegal rabbit out of their hat to end the last meeting supposedly on an “high” note (see Catching Fire News Video, People Power Defeats Biden at the WHO).1 But they have scheduled more rounds of meetings running from June 14th through the 17th [2] with Subgroup A (meeting the first two days) “discussing “the outline of substantive elements relating to the respective categories of pandemic prevention and preparedness” and Subgroup B will study “pandemic response and recovery” the last two days. The draft of their findings will be presented at the next meeting starting July 18th.\n\nWhat are some of the things that will be addressed later this month? Let me give you just a few (or more) “highlights”:\n• Set up permanent national (and, where possible, regional) multisectoral pandemic preparedness and response committees, comprising the IHR National Focal Point, and representatives from animal health, environmental health, civil protection and other relevant public bodies\n• Regulation of the private sector What are they regulating in the private sector?\n• Multisectoral participation for the implementation of the 2030 Agenda for Sustainable Development and Sustainable Development Goals for the broad approach for the recovery, prevention and mitigation of the effects of future pandemics This one makes me very hot under the collar; Sustainable Development is nothing more that a thousand tools to destroy Western Culture.\n• Member States must be obliged to present WHO with routine reports outlining their level of commitment to the proposed agreement\n• International vaccination registry for COVID -19 and all vaccines So they have complete surveillance of us 100% of the time.\n• Create a multidisciplinary and multisectoral platform of public health emergency operations centres at global, regional and national level\n• Consider other global health threats (i.e. climate change or chemical contamination)\n• Envisaged treaty should go a step further to empower WHO to review the travel restrictions and issue binding recommendations in this regard Yes, let them control these areas also.\n• Freedom of international movement for those fighting against the pandemics\n• Engagement of civil society, communities and non-State actors, including the private sector, as part of a whole-of-society-approach (public/private partnerships in control).\n\nNow “We the People” need to make it clear that we meant what we said during the earlier meeting. We are not going to take any more. Please go to StopTheWHO.com[3] and share the information James Roguski has amassed there for us. Take this information to your local, state, and federal representatives and tell them WE are not going to fall for this. We want it gone. And we want the U.S. out of the WHO, now!", "opengraph": {"locale": "en_US", "site_name": "American Policy Center", "title": "We the People Just Stopped WHO - For Now", "url": "https://americanpolicy.org/2022/06/09/we-the-people-just-stopped-who-for-now/", "type": "article", "description": "“We the People” threw a sabot into the machinations of the WHO, the World Health Organization, stopping them from setting up a system that would grossly infringe on our national and individual sovereignty. In January, the Biden administration proposed amendments to the International Health Regulatio", "image": "http://americanpolicy.org/wp-content/uploads/2022/06/who-gd10f0882b_1920-e1654715346125.jpg", "image:url": "http://americanpolicy.org/wp-content/uploads/2022/06/who-gd10f0882b_1920-e1654715346125.jpg", "article:published_time": "2022-06-09T15:09:51-04:00", "article:modified_time": "2022-10-27T09:36:15-04:00", "updated_time": "2022-10-27T09:36:15-04:00", "article:section": "More Issues", "article:publisher": "https://www.facebook.com/americanpolicycenter/"}, "tags": [], "tweets": [], "movies": [], "links": ["https://americanpolicy.org/author/kathleen-marquardt/", "https://americanpolicy.org/category/more-issues/", "#post-12852-endnote-1", "#post-12852-endnote-2", "#post-12852-endnote-3", "#post-12852-endnote-ref-1", "#post-12852-endnote-ref-2", "#post-12852-endnote-ref-3"], "authors": [], "publish_date": "2022-06-09T15:09:51-04:00"}