{"result_id": "026002", "URL": "https://americanpolicy.org/1999/03/29/nazi-type-thugs-destroy-medical-research/", "timestamp": "2023-04-25 12:03:39 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://americanpolicy.org/wp-content/uploads/2020/03/faveagle.png", "canonical": "https://americanpolicy.org/1999/03/29/nazi-type-thugs-destroy-medical-research/", "encoding": "UTF-8"}, "image": null, "domain": "americanpolicy.org", "title": "Nazi-Type Thugs Destroy Medical Research", "cleaned_text": "The Animal Liberation Front (ALF), an “animal rights” terrorist group, has taken credit for a raid on twelve University of Minnesota medical research labs because of the use of animal testing. The raiders gleefully acknowledged releasing animals and causing over $1 million in damages.\n\nA spokesman for the Animal Liberation Group ( a terrorist group secretly funded by People for the ethical Treatment of Animals, PeTA) said the group smashed computers, tipped over lab equipment and wrecked microscopes. The massive damage and Nazi-like tactics were justified as a compassionate act for exploited animals. “The ALF is taking action immediately to free these animals from their exploitation,” group spokesman Kevin Kjonaas said. He was proud that the group had found homes for the animals.\n\nWhat Kjonaas did not admit to was the irreversible damage his mindless attack had caused to families who have been desperately seeking a cure for their sick loved ones. Because officials at the University of Minnesota said the damage from the raid will seriously impede research on Alzheimer’s, Parkinson’s, cancer and other diseases.\n\nDr. Walter Low said the damage set back the Alzheimer’s research alone by two years. One of the pieces of equipment damaged was an incubator containing brain cells from a patient participating in a research project. “You begin to have an impact on a patient who’s donated their cells for us to develop a vaccine, and we no longer have that vaccine to offer to that patient,” said Dr. Low.\n\nSo the families suffer in silence, watching their loved ones slowly wither away, with no hope of recovery. But if they listen closely they will hear the evil, hollow laughter of a brainless thug, proud to have helped cause the death of one more “worthless” human.", "opengraph": {"locale": "en_US", "site_name": "American Policy Center", "title": "Nazi-Type Thugs Destroy Medical Research", "url": "https://americanpolicy.org/1999/03/29/nazi-type-thugs-destroy-medical-research/", "type": "article", "description": "By Tom DeWeese\n\nThe Animal Liberation Front (ALF), an \"animal rights\"               terrorist group, has taken credit for a raid on twelve University               of Minnesota medical research labs because of the use of animal               testing. The raiders gleefully acknowledged releasing anim", "article:published_time": "1999-03-29T15:05:59-05:00", "article:modified_time": "1999-03-29T15:05:59-05:00", "updated_time": "1999-03-29T15:05:59-05:00", "article:section": "Property Rights", "article:publisher": "https://www.facebook.com/americanpolicycenter/"}, "tags": [], "tweets": [], "movies": [], "links": ["https://americanpolicy.org/author/tom-deweese/", "https://americanpolicy.org/category/property-rights/"], "authors": [], "publish_date": "1999-03-29T15:05:59-05:00"}