{"result_id": "026013", "URL": "https://americanpolicy.org/2021/09/16/agenda-21-cancel-culture-on-a-world-wide-scale/", "timestamp": "2023-04-25 12:03:49 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://americanpolicy.org/wp-content/uploads/2020/03/faveagle.png", "canonical": "https://americanpolicy.org/2021/09/16/agenda-21-cancel-culture-on-a-world-wide-scale/", "encoding": "UTF-8"}, "image": null, "domain": "americanpolicy.org", "title": "Agenda 21: Cancel Culture on a World-wide Scale", "cleaned_text": "Since 1992, we, at American Policy Center have been pointing out that one of the major goals of Agenda21/Sustainable Development is to reduce the human population by over 90%. Yet many laugh and call us conspiracy theorists. What I don’t understand about this statement is that we had been hearing for decades that the world is overpopulated; that we will run out of space and room for everyone; that we can’t feed so many. At the same time that we were reading Paul Ehrlich’s Population Bomb and Population Explosion and the Club of Rome’s The Limits to Growth, America was being called the breadbasket of the world. Of the world! We were sending food all over the world to feed people. So, the problem was not about feeding us dirty hordes of skeptical people. It was, and is, that some of us – especially Americans – believe in the right to property and liberty, which prevents the globalist cabal from just taking all the land they want, reducing the whole world’s population by some 90+%, and living in “Marxist Nirvana” (contradiction of terms notwithstanding).\n\nBut because we never stopped saying that this catastrophic reduction of humans on the earth was a major part of the plan, we were seen as nut cases since, by then, they had already either got people to believe in their catastrophic scenario or because many more didn’t think a reduction was going happen. Nevertheless, the globalists have been using many methods to reduce the population for decades, but none as huge as COVID. Remember the Tuskegee Experiment from 1932 to 1972? For 40 years the goal was to “observe the natural history of untreated syphilis” in black populations, but the subjects were completely unaware and were instead told they were receiving treatment for bad blood when in fact, they received no treatment at all. And the Gates Foundation putting birth control meds in vaccines in Africa?\n\nThen there is the fact that every day in the United States, abortions kill more humans than were killed in the 9/11 attack on the Twin Towers. That is a substantial number, no matter what your view is on abortion. I would love to go into the Food Pyramid, school lunch programs, and others to show how the general populace is being lied to about health and diet. But I’m not. I do suggest that, if you are interested, check out Bedrock Living or Natural News.\n\nNow, Bill Gates and the Chinese have bought up a great deal of America’s farmland. This globalist acquisition of farm and ranch land has also been in the works for years, but in the past few years, it has been accelerated greatly. Excuse me if I suppose that their aim is to starve us Americans to death – or capitulation (I expect it to be a lot of the former and a little of the latter). America is the only truly free nation in the world with a constitution that was written to protect the individual and his/her God-given rights – from other people and, especially, from the government.\n\nThe sad thing is that we are not – yet – leading the revolt against all the unconstitutional laws, edicts, and orders being levied on us and most of the world. I see three reasons for this:\n• Most of the population under 40 has been brainwashed and dumbed down in our education system that was set up for that very reason. (See Cancel Culture on Education.)[1]\n• The asymmetrical warfare we have been under attack from for decades is now on overdrive and many people are having a hard time coping with it psychologically.\n• Many, who do understand at least some of the problem, do not understand that we are in a mind-war, not an arms war, and they are waiting until they can begin firing. By the time we reach that stage, it will either be too late, or that the civil war to help erase a great number of us will have begun – either by provoking patriots who are itching for a fight, or for staging red flag events to precipitate the war. And this will help reduce the human population, whatever is used to ignite it.\n\nSo what I want to address are the reasons behind the reduction of the human population, who are instigating and carrying it out, and how it is being done.\n\nAccording to Ted Turner, media mogul and a founder of the Club of Rome, “The total population of 250-300 million people is ideal That means a reduction of 95% from present levels, which would be even more ideal.” Many of the other numbers I have heard from world leaders is usually around 500 million, which would be a reduction of only just over 90%.\n\nWorld Wildlife Fund President Prince Phillip of the UK said, “Human population growth is probably the single most serious long-term threat to survival. We’re in for a major disaster if it isn’t curbed. We have no option. If it isn’t controlled voluntarily, it will be controlled involuntarily by an increase in disease, starvation and war.”\n\nHe went on to say: “I was in Sri Lanka recently, where a United Nations project set out in the late 1940s to eradicate malaria. It’s an island and it was, therefore, possible to destroy the mosquito carrying the disease. What people didn’t realize was that the malaria was actually controlling the growth (ital. mine) of the population. The consequence was that within about 20 years the population doubled.”[2] Definitely a negative outcome in his mind.\n\nIn 1971, the UN Population Commission designated 1974 as World Population Year and requesting the UN Secretary-General to “… study the possibilities of developing a global population strategy, including population movements, for promoting and coordinating population policy in Member States with the objective of achieving a balance between population and other natural resources (ital. mine).[3]\n\nNow we are told, “The transferable birth quota plan proposes that scale and distribution of the rights to bear children be determined by the community at large, but that these rights then be traded in the free market.\n\n“This plan is based on the perception that the right to reproduce can no longer be treated as a free good. It must be seen as a scarce good in a full world.”[4]\n\nI could give you a hundred more quotes re population reduction needs, but let me just give one more, by Mr. Population Bomb himself, Professor Paul Ehrlich, in the prolog to his book The Population Explosion: “Our position requires that we take immediate action at home and promote effective action worldwide. We must have population control at home, hopefully through a system of incentives and penalties, but by compulsion of voluntary methods fail…. We can no longer afford merely to treat the symptoms of the cancer of population growth, the cancer itself, must be cut out.” (ital. mine)\n\nBut how many must die? What numbers will be allowed to live on this mortal coil if the Deep Greens, Deep State, and Globalists get their way? Let them tell you:\n• Ted Turner, “A total world population of 250-300 million, a 95% decline from present levels, would be ideal.”\n• Mikhail Gorbachev, “We must speak more clearly about sexuality, contraception, about abortion, about values that control population, because the ecological crisis, in short, is the population crisis. Cut the population by 90% and there aren’t enough people left to do a great deal of ecological damage.”\n• MIT professor Penny Chisholm, “The real trick is, in terms of trying to level off at someplace lower than that 9 billion, is to get the birthrates in the developing countries to drop as fast as we can. And that will determine the level at which humans will level off on earth.”\n• Jacques Costeau, “In order to stabilize world population, we must eliminate 350,000 people per day. It is a horrible thing to say, but it is just as bad not to say it.”\n\nLast, but not least, the co-founder of Earth First and founder of the ReWilding Institute, •Dave Foreman, “My three main goals would be to reduce human population to about 100 million worldwide, destroy the industrial infrastructure and see wilderness, with its full complement of species, returning throughout the world.”\n\nWe were not lying about the globalist plan to reduce the world. It is a key to all the rest of the plan – “wilding” at least 50% of the earth’s surface, canceling the right to property, and establishing a one-world Marxist government. Just because we understand that a Marxist government can only destroy, not build or “build back better”, otherwise this one-world government will soon be on the ash heap of history, it doesn’t sit well with me that we will allow this.\n\nMost people consider themselves environmentalists. And I would claim that the true environmentalist is a farmer, rancher, landowner, logger, fisherman, and all those who live closest to the land and work in symbiosis with it. Those who live in high-rise buildings, fight to “protect” nature from any human use, and, as Ted Nugent said, “never put their hands in a gut pile”, are fake environmentalists. They have little or no understanding of the biological workings of the flora and fauna on this earth. And they do not realize we humans are part of nature, part of the food chain. They speak of how important it is to save every little species – otherwise, the whole ecosystem of the world will collapse. Then, how much more important must it be to save one of the most prevalent species on earth? Where are the common sense, reason, and logic in their thinking?\n\nFor at least two reasons, I would suggest that they start using sound science, critical thinking, and logic and realize that 1. Human extinction will likely collapse the system, and 2. We “useless eaters” in their vernacular are the ones who make their world go round – produce not only the food but all the stuff that gives them great living standards – housing, clothing, computers, you name it.\n\nWe are on the verge of civilization collapse, but not for the reasons the environmentalists, globalists, and anti-humans believe. We are on the verge of collapse because of the evil, anti-humanity schemes, plots, and plans they are forever coming up with. Now is the time for us to throw the sabot into the machinery and stop the Marxist, Communist, Globalist plans, and bring back the Great American Experiment. And now is the time for people to wake up to the fact that we have tried to get through to them that a cataclysmic restructuring of the world is in the near future if people don’t finally accept that when the Globalists declared a needed reduction of the human population on a scale that is unfathomable to any thinking being, is a major part of their plan.\n\n[4] For the Common Good, by Daly and Cobb. 1994", "opengraph": {"locale": "en_US", "site_name": "American Policy Center", "title": "Agenda 21: Cancel Culture on a World-wide Scale", "url": "https://americanpolicy.org/2021/09/16/agenda-21-cancel-culture-on-a-world-wide-scale/", "type": "article", "description": "Since 1992, we, at American Policy Center have been pointing out that one of the major goals of Agenda21/Sustainable Development is to reduce the human population by over 90%. Yet many laugh and call us conspiracy theorists. What I don’t understand about this statement is that we had been hearing fo", "image": "https://americanpolicy.org/wp-content/uploads/2021/09/iStock-1251262051.jpg", "image:url": "https://americanpolicy.org/wp-content/uploads/2021/09/iStock-1251262051.jpg", "image:secure_url": "https://americanpolicy.org/wp-content/uploads/2021/09/iStock-1251262051.jpg", "article:published_time": "2021-09-16T13:34:43-04:00", "article:modified_time": "2021-09-16T13:37:31-04:00", "updated_time": "2021-09-16T13:37:31-04:00", "article:section": "Sustainable Development", "article:publisher": "https://www.facebook.com/americanpolicycenter/"}, "tags": [], "tweets": [], "movies": [], "links": ["https://americanpolicy.org/category/sustainable-development/", "https://americanpolicy.org/author/kathleen-marquardt/", "https://americanpolicy.org/category/property-rights/", "applewebdata://30FE62BD-5EA2-4D62-A89E-831E5F4C924C#_edn1", "applewebdata://30FE62BD-5EA2-4D62-A89E-831E5F4C924C#_edn2", "applewebdata://30FE62BD-5EA2-4D62-A89E-831E5F4C924C#_edn3", "applewebdata://30FE62BD-5EA2-4D62-A89E-831E5F4C924C#_edn4", "http://www.infowars.com/from-7-billion-people-to-500-million-people-%E2%80%93-the-sick-population-control-agenda-of-the-global-elite/", "http://www.infowars.com/satire-article-quips-at-least-2-3-billion-must-die-to-save-the-earth/", "applewebdata://30FE62BD-5EA2-4D62-A89E-831E5F4C924C#_ednref1", "https://americanpolicy.org/?s=cancel+culture+education", "applewebdata://30FE62BD-5EA2-4D62-A89E-831E5F4C924C#_ednref2", "applewebdata://30FE62BD-5EA2-4D62-A89E-831E5F4C924C#_ednref3", "applewebdata://30FE62BD-5EA2-4D62-A89E-831E5F4C924C#_ednref4"], "authors": [], "publish_date": "2021-09-16T13:34:43-04:00"}