{"result_id": "026015", "URL": "https://americanpolicy.org/2022/01/27/stay-alert-virginia-the-nation-is-watching/", "timestamp": "2023-04-25 12:03:50 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://americanpolicy.org/wp-content/uploads/2020/03/faveagle.png", "canonical": "https://americanpolicy.org/2022/01/27/stay-alert-virginia-the-nation-is-watching/", "encoding": "UTF-8"}, "image": null, "domain": "americanpolicy.org", "title": "Stay Alert Virginia, the Nation is Watching", "cleaned_text": "It is a great feeling of relief for many in Virginia to receive a new Republican Governor to office. After decades of Democrat rule, leading to larger and larger government control over every aspect of business, healthcare, education, environment, and personal choice, Virginians are hoping for major changes in how their government will now operate.\n\nAdding to the positive feelings across the state, new Governor Glenn Youngkin had a busy inauguration day, signing nine executive orders and two executive directives to set the tone for his term. Each was met with thundering applause.\n\nThe Executive Orders included removing Critical Race theory from school curriculums. Anther empowered parents to decide if their children must wear masks while in school. Another EO terminated the current Parole Board and gave the Attorney General orders to investigate the policies of that board. Still other EOs set in process an investigation of wrongdoing by a local school board over child abuse issues, pulled back restrictions on local businesses, combating child trafficking and anti-Semitism, and remove Virginia from the Regional Greenhouse Gas Initiative, which threatened to destroy the state’s power grid. In an Executive Directive, Youngkin rescinded the vaccine mandate on all state employees.\n\nIn addition to the historic election of the new Governor, the Republicans also elected a new Lieutenant Governor and Attorney General. They are pushing for even more change through their elected offices. Meanwhile, Youngkin appears to be filling his cabinet with dedicated limited-government advocates. That’s a powerful three-pronged attack. Meanwhile Republicans have also gained control of the state House of Representatives and are only two votes short of control of the state Senate. And bills are pouring into the legislative hopper to roll back gun control laws passed under Democrat rule; stop mail-in ballots and secure elections, and eliminate discrimination against the non-vaccinated. Much more is planned — no wonder the Virginia election last November caused such an earthquake.\n\nHowever, if the expected success of this new chance for Virginia is to be achieved and then reverberated across the nation in next November’s election, a stern warning must be sounded now. And it must be taken very seriously by the pro-freedom advocates in Virginia, along with hopeful Americans across the nation. You are facing two significant threats that can lead to your defeat.\n\nFirst, VIRGINIA, DO NOT BECOME COMPLACENT THAT YOUR GOVERNOR AND LEGISLATURE WILL NOW AUTOMATICALLY SOLVE ALL OF YOUR PROBLEMS. YOU ARE NOT FREE TO JUST STAY HOME AND TAKE IT EASY!!!\n\nThose of us who believe in limited government feel that way because we don’t really like government. We just want to be left alone. As a result, we tend to stay away from involvement, especially on the local and state levels. Once we work to get our candidate elected, we tend to walk away from the fray, convinced that they will now take care of things. We aren’t there to keep up the pressure. The result is that we end up with more government. Whether it’s the President, Governor, or Mayor, one person cannot fight these battles alone.\n\nSecond, the forces of leftist tyranny never give up! They never accept defeat. In fact, defeat seems to energize them. And they see the Virginia election as a wake-up call to fight harder to regain power. They become more determined and fight harder. It’s already happening to Governor Youngkin.\n\nThe Leftist forces have already organized a parental movement to file suit against the Youngkin Administration over the removing of the masks mandates in the schools. “I’m scared for my kid,” said a CNN headline in a report about parents in Chesapeake, Virginia, who filed a lawsuit immediately after Youngkin issued his Executive Order. That’s what he is going to face, non-stop lawsuits, scare tactics, and media attacks — all designed to weaken the new Administration’s resolve and force it to back off.\n\nIn addition, radical leftists, led by Michelle Obama, have vowed to “recruit and train” an army of 100,000 to register more than a million new voters to guarantee a Democrat victory in 2022. Michelle founded a voting organization in 2018 called “WHEN WE All Vote.” Its mission is “to change the culture around voting and to increase participation in each and every election by helping to close the race and age gap.” They are determined to stop any effort by Republicans to protect the ballot box for honest returns. Win – that’s the goal – by any means.\n\nNow is the true test. Virginians have a new governor who has promised much and has started to keep them. But you cannot turn him into a sacrificial lamb to fight by himself. We must be as determined to stay involved and fight as fiercely for our goals as does the Left. We must stand with the new governor and be his fighting force. With that kind of support, he will be energized to do even more. If he is left to fight alone, he will be forced to pick his battles more carefully, resulting in less achievement.\n\nEvery community, every local and state organization must now stay active – build a permanent infrastructure to respond immediately to any attack. Do the research, supply the volunteer manpower. Give the governor and state legislators a support base they can rely on. It will give them more courage and more power to keep moving forward.\n\nThere is also a third threat to be considered on the cautionary side. What if Governor Youngkin isn’t quite the dedicated freedom fighter he purports to be? What if all of these early Executive Orders and rhetoric are just for show? Then you have to be prepared to apply the necessary pressure on him to fulfill those promises and keep him on the right road.\n\nNever lose sight of the true goal – to restore and protect our Republic, its economic system, our property rights, and our right to choose our personal goals, free of tyrannical government control. State by state, establish Freedom Pods to secure the pillars of freedom.\n\nSupport the good statesman and stop the lying, cheating, tyrannical politician. To paraphrase Rocky, “That’s how winning is done!” Win these battles now in Virginia, and next we can take back America.", "opengraph": {"locale": "en_US", "site_name": "American Policy Center", "title": "Stay Alert Virginia, the Nation is Watching", "url": "https://americanpolicy.org/2022/01/27/stay-alert-virginia-the-nation-is-watching/", "type": "article", "description": "It is a great feeling of relief for many in Virginia to receive a new Republican Governor to office. After decades of Democrat rule, leading to larger and larger government control over every aspect of business, healthcare, education, environment, and personal choice, Virginians are hoping for major", "image": "http://americanpolicy.org/wp-content/uploads/2022/01/youngkin.jpg", "image:url": "http://americanpolicy.org/wp-content/uploads/2022/01/youngkin.jpg", "article:published_time": "2022-01-27T09:35:42-05:00", "article:modified_time": "2022-01-27T09:36:21-05:00", "updated_time": "2022-01-27T09:36:21-05:00", "article:section": "Election", "article:publisher": "https://www.facebook.com/americanpolicycenter/"}, "tags": [], "tweets": [], "movies": [], "links": ["https://americanpolicy.org/author/tom-deweese/", "https://americanpolicy.org/category/election/"], "authors": [], "publish_date": "2022-01-27T09:35:42-05:00"}