{"result_id": "029042", "URL": "https://www.ancient-origins.net/unexplained-phenomena/adena-giant-revealed-profile-prehistoric-mound-builders-004876", "timestamp": "2023-04-25 12:04:53 CEST+0200", "meta": {"description": "In the 1800s, reports began to surface of the discovery of very large skeletal remains in the burial mounds of North America.", "lang": "en", "keywords": "Adena, Giants, Prehistoric, mounds, burial, archaeology, Smithsonian, elongated skulls, skeletons", "favicon": "https://www.ancient-origins.net/apple-touch-icon-192x192.png", "canonical": "https://www.ancient-origins.net/unexplained-phenomena/adena-giant-revealed-profile-prehistoric-mound-builders-004876", "encoding": "utf-8"}, "image": null, "domain": "www.ancient-origins.net", "title": "The Adena Giant Revealed: Profile of Prehistoric Mound Builders", "cleaned_text": "In the 1800s, reports began to surface of the discovery of very large skeletal remains in the burial mounds of North America. These skeletons were described as reaching seven to eight feet (2.4 meters) in length, with a lower frequency of discoveries spanning nine to 11 feet (3.3 meters) in length, and having very large skulls and gigantic lower jawbones.\n\nHistorians often detailed these remains in early local historical records, such as the following from Cass County, Michigan:\n\n“It was a mound about thirteen feet high…. the diameter of its base was about fifty feet…Portions of the skeletons were in a good state of preservation. The femur, or thigh bone, of one of the males, which Dr Bonine has now in his possession, is of great size and indicates that its owner must have been at least seven feet in height”\n\nThe Criel Mound in South Charleston West Virginia, photo courtesy of authors © Jason Jarrell and Sarah Farmer. The 35-foot (11 m) high and 175-foot (53 m)-diameter conical mound, is the second largest of its type in West Virginia.\n\nAntiquarians also wrote about the anthropology of the tall ones in prehistoric mounds. The following is an account from Chillicothe, Ill. from American Antiquarian, Vol 2 No 1 (1879):\n\n“A recent exploration of a mound near this place resulted in some interesting discoveries…The form was large, the jaws massive, and the teeth perfect.”\n• The Adena People and Prehistoric Colonization of North America\n\nAs is well known, 19 th and early 20 th century newspapers frequently ran stories of gigantic skeletons found throughout the country. The following report from Portsmouth, Ohio was run by the News Herald on January 3, 1895:\n\n“Bridge Carpenters on the N. & W. R. R. found a gigantic skeleton while excavating, three miles east of Portsmouth, a few days ago. The skeleton measured, 7 feet, 4 inches…”\n\nIn the 1880s, the Eastern Mound Division of the Smithsonian discovered a number of gigantic skeletons in their wanton destruction of North American tumuli. The 12 th Annual Report of the Bureau of Ethnology documents numerous gigantic skeletons found by Smithsonian agents:\n\n“Near the original surface (of the mound)… lying at full length upon its back, was one of the largest skeletons discovered by the Bureau agents, the length as proved by actual measurement being between 7 and 8 feet.”\n\n“In the center (of mound 11), 3 feet below the surface, was a vault 8 feet long and 3 feet wide. In the bottom of this…lay a skeleton fully 7 feet long…”\n\n“The length from the base of the skull to the bones of the toes was found to be 7 feet 3 inches. It is probable, therefore, that this individual when living was 7.5 feet high.”\n\nPre-excavation view of the Adena Mound, located in Chillicothe, Ohio, United States, northwest of downtown. The type site for the Adena culture, the site is listed on the National Register of Historic Places, even though the mound was removed decades ago. It was excavated in 1901. ( Public Domain )\n\nThe twentieth century saw the rediscovery of the ancient giants by mainstream archeologists. Working with Charles Snow, William S Webb (University of Kentucky) positively identified the unique skeletal features noted by the early sources with the people of the Adena Mound Building Culture. Webb and Snow’s analysis of the anthropology of Adena was described in The Adena People Number 1 (1945) and number 2 (co-written with Raymond S Baby, 1957):\n\n“The forehead is typically a prominent one, bordered below by fairly prominent brow ridges….The characteristic bulge of the upper and lower jaws (alveolar prognathism) is moderate in projection…Usually the cheek bones are not only of large size in themselves but they have a forward and lateral prominence…” (Webb Snow and Baby, 1957)\n\nIn addition to these strong features, Webb Snow and Baby (1957) remarked upon the “great width of the bony chin, formed by bilateral eminences”.\n• Elongated Skulls in utero: A Farewell to the Artificial Cranial Deformation Paradigm?\n• Interview with Brien Foerster – Unravelling the Genetics of Elongated Skulls\n\n“Approximately 89% of the adult males, 92% of the adult females are brachycephalic.” (Webb and Snow 1945)\n\nIn their report on the Dover mound in Kentucky, Webb and Snow noted that the Adena crania to represent the “highest skull vaults reported anywhere in the world” (Webb and Snow, The Dover Mound . 1959) Cephalic indices measured for Adena range from 89 to 100. (Webb, Snow and Baby 1957)\n\nThe Adena People practiced artificial flattening of the occipital region, which added height to the cranial vault. This practice merely enhanced congenital features:\n\n“…those skulls with slight or no deformation (undeformed) present similar proportions”.(Webb and Snow, 1945)\n\n“It is likely that many, if not most, of the skull characteristics so typical of Adena are of genetic nature…” (Webb, Snow and Baby 1957)\n\nThe “Wolf Plains Group”, aA Late Adena group of 30 earthworks including 22 conical mounds and nine circular enclosures. Located a few miles to the northwest of Athens, Ohio, USA. ( Public Domain )\n\nAt the Dover Mound, Webb encountered a seven foot (two meters) tall skeleton with these notable Adena features (burial 40):\n\n“…the remains of burial 40 is one of the largest known to Adena; the skull-foot field measurement is 84 inches (7 feet).” ( Webb and Snow, 1959)\n\nIn1958, Don Dragoo of the Carnegie Museum uncovered the remains of an individual “of large proportions” in a subsurface tomb at the lowest strata of the Cresap Mound in West Virginia. Burial 54 as described by Dragoo in Mounds for the Dead (1963):\n\n“When measured in the tomb his length was approximately 7.04 feet. All the long bones were heavy and possessed marked eminences for the attachment of muscles.”\n\nDragoo described the unique traits of Adena, including the “protruding and massive chin” with “prominent bilateral protrusions”, as well as “individuals approaching seven feet in height”. (Dragoo, 1963)\n\nIt is important to note that in considering this information from Webb, Snow, and Dragoo, regularly occurring gigantic members are not the only unique features of the Adena People:\n\n“Not only were these Adena People tall but also the massiveness of the bones indicates powerfully built individuals. The head was generally big with a large cranial capacity.” (Dragoo, 1963)\n\nWorking in the 20 th century, Webb, Snow and Dragoo essentially corroborated the findings of the earlier antiquarians and linked the gigantic skeletal types with a specific culture. Following this, the pioneering research of Ross Hamilton and the late Vine Deloria set a scholarly standard for giantology, synchronizing the Native and archeological records in Hamilton’s unsurpassed work, A Tradition of Giants .\n\nAnd yet, in spite of this tradition of rediscovery, no satisfactory reconstruction of an Adena giant has ever been undertaken. While we are routinely reminded of the dimensions of the giants in volumes reprinting multiple hundreds of accounts of their discovery, we have been denied imagery representing their living form. While numerous other anomalies (such as the Paracas and “Starchild” crania) have received due attention, the gigantic Adena have remained shrouded in mystery. In May of 2015, the authors undertook a joint venture with the legendary Marcia K Moore to remedy this situation.\n\nMarcia is best known as the premier artist recreating the living images of the elongated crania of Peru, associated with the Paracas People. Her work has appeared in the books of Brien Foerster and L.A. Marzulli and has been featured on the Ancient Aliens TV series, with Marcia herself occasionally appearing on the show. (Ancient Aliens: Alien Evolution)\n\nThe skull used for the Adena recreation was that of burial 16 from the Wright Mounds in Kentucky, photographed in figure 25 of The Adena People No1, where it is described as showing “pronounced” deformation. In Skeletal Material from the Wright Site, Montgomery County, Kentucky (1940) H.T.E. Hertzberg noted that the crania of the Wright site featured the large, prognathic lower mandibles (or protruding lower jaw) typical of Adena, and although artificially deformed, the series demonstrated the large congenital features detailed by Webb, Snow and Dragoo:\n\n“…deformed as they are, these crania display a pronounced brachycrany…it may be noticed that four skulls…displaying submedium deformation, also give an average cranial index of over 90%. Thus the inference is that these people would have shown pronounced brachycrany even without deformation…”\n\nThe dimensions of the Adena giant were derived from several sources with corroborating details. Among these, the authors referenced the hand written field notebook of P. W. Norris, the agent of the Bureau of Ethnology who excavated the Adena mounds at Charleston, West Virginia in 1883 and 1884 (Smithsonian Manuscript, Norris Mound Excavations). Several mounds at Charleston yielded skeletons seven feet (two meters) long. At the Great Smith Mound, Norris encountered a house-like timber structure 12 by 13 feet broad (3.6 by 4 meters) and 6 feet (1.8 meters) high, reaching 10 feet (three meters) at the ridged top.\n\nWithin this structure was a “gigantic and prominent personage, surrounded by 5 of his (probably volunteer) warriors…” Norris measured the central burial in situ and described it as “a gigantic human skeleton 7 feet 6 inches in length and 19 inches between the shoulders…”\n\nElsewhere in the manuscript, this skeleton is regularly referred to as “the giant” or “gigantic\" . Significantly, this particular burial was wrapped in bark and covered with a dry clay. This certainly suggests that the in-situ measurements would have been accurate, rather than the product of some type of disarticulation due to the weight of the mound mass, as mainstream sources often claim.\n• The Establishment Has Already Acknowledged A Lost Race of Giants - Part 1\n• The Establishment Has Already Acknowledged a Lost Race of Giants - Part 2\n\nThe measurements provided by Norris are similar to those from several other sources, including this account of a gigantic specimen unearthed by Warren K Moorehead in Ohio, documented in his Primitive Man in Ohio (1892):\n\n“Six feet above these remains was found the partial skeleton of a man almost a giant in size….The breadth across the shoulders, with the bones correctly placed, was nineteen inches…”\n\nThe anthropological details of Adena recorded by Webb, Snow and Dragoo and the early historians and antiquarians corroborate Norris’ account and indicate individuals approaching eight feet (2.4 meters) tall. Since a high frequency of reports describe skeletons reaching this height, the data was used by Marcia to formulate the likely dimensions and appearance of an eight-foot-tall Adena in the flesh.\n\nMarcia has done more than merely provide a visual for a tall member of a prehistoric population. The Adena giant represents a truly unique form of humankind, which until now has only been suggested by the multitude of newspaper and historical accounts regularly reprinted in the giantology market place. The recreation of a very large member of Webb, Snow and Dragoo’s “unique group of honored dead” provides a glimpse into the distant past, a snapshot from beyond the veil pulled over history by the establishment a century ago.\n\nMarcia is currently working with the authors on a book to be published in 2016 that will feature an extensive set of her recreations of Adena and Adena-like individuals from the burial mounds of North America and around the world. This important visual work will accompany the presentation of 7000 years of obfuscated world history.\n\nFeatured image: Main: The Criel Mound in South Charleston West Virginia, photo courtesy of authors © Jason Jarrell and Sarah Farmer. The 35-foot (11 m) high and 175-foot (53 m)-diameter conical mound, is the second largest of its type in West Virginia. Inset: Artist’s representation of the “Adena Giant”, Prehistoric Mound Builders. Credit: Marcia K Moore / Ciamar Studio. Visit www.marciakmoore.com\n\nFor more information, please visit www.alleghenymounds.com/", "opengraph": {"type": "article", "url": "https://www.ancient-origins.net/unexplained-phenomena/adena-giant-revealed-profile-prehistoric-mound-builders-004876", "title": "The Adena Giant Revealed: Profile of Prehistoric Mound Builders", "description": "In the 1800s, reports began to surface of the discovery of very large skeletal remains in the burial mounds of North America.", "image": "https://www.ancient-origins.net/sites/default/files/field/image/adena-giants.jpg", "image:secure_url": "https://www.ancient-origins.net/sites/default/files/field/image/adena-giants.jpg", "image:type": "image/jpeg", "article:published_time": "2015-12-08T14:53:25+00:00", "article:modified_time": "2015-12-10T02:01:27+00:00", "site_name": "Ancient Origins Reconstructing the story of humanity's past"}, "tags": ["Read more about The Spearhead Mound: Interpretation of a Forgotten Adena Burial Site", "Read more about Symbolism of the Great Serpent in the Adena and Hopewell Cultures – Part I", "Read more about The Fall of the Giants and Their Fate According to Ancient Texts", "Read more about The Giants of Doddridge County: Burials of a Vanished Race – Part I", "Read more about Symbolism of the Great Serpent in the Adena and Hopewell Cultures – Part II", "Read more about The Mound Builders' Moon Goddess: Grandmother of the Eastern Woodlands"], "tweets": [], "movies": [], "links": ["https://www.ancient-origins.net/ancient-places-americas/adena-people-and-prehistoric-colonization-north-america-003342", "https://www.ancient-origins.net/ancient-places-americas/ancient-earthworks-north-america-suggest-pre-columbian-european-contact-020417", "https://commons.wikimedia.org/wiki/File:Adena_Mound.jpg", "https://www.ancient-origins.net/unexplained-phenomena/elongated-skulls-utero-farewell-artificial-cranial-deformation-paradigm-002526", "https://www.ancient-origins.net/videos/interview-brien-foerster-unravelling-genetics-elongated-skulls-001316", "https://commons.wikimedia.org/wiki/File:Wolf_Plains_Group_Squier_and_Davis_01.jpg", "http://www.marciakmoore.com/", "http://www.marciakmoore.com/giants.html", "https://www.ancient-origins.net/unexplained-phenomena/establishment-has-already-acknowledged-lost-race-giants-part-1-003109", "https://www.ancient-origins.net/unexplained-phenomena/establishment-has-already-acknowledged-lost-race-giants-part-2-003114", "http://www.marciakmoore.com", "http://www.marciakmoore.com/", "https://www.ancient-origins.net/users/jason-and-sarah", "http://www.alleghenymounds.com/"], "authors": [], "publish_date": "2015-12-08T14:53:25+00:00"}