{"result_id": "029014", "URL": "https://www.ancient-origins.net/religions", "timestamp": "2023-04-25 12:04:14 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "Religions, ancient, archaeology, artifacts, myths, legends, history, ancient places", "favicon": "https://www.ancient-origins.net/apple-touch-icon-192x192.png", "canonical": "https://www.ancient-origins.net/religions", "encoding": "utf-8"}, "image": null, "domain": "www.ancient-origins.net", "title": "Religions | Ancient Origins", "cleaned_text": "Most people will recognize Mecca as the name for the Holy City of Islam. Do you know where the Holy City is? Do you know where it should be? Did it get lost? Was it ever found? Believe it or not,...", "opengraph": {"site_name": "Ancient Origins Reconstructing the story of humanity's past"}, "tags": ["Read more about Ancient DNA Analysis Reconstructs Legacy of the Biblical Levites", "Read more about Pre-Pottery “Perfect” Neolithic Shrine Found in East Jordan Desert", "Read more about Garden of Eden Depicted in Ancient Greek Religious Art", "Read more about Nippur: The Great Mesopotamian Holy City That Gave Early Ideas Of God", "Read more about Where Is the True Location of Mecca?", "Read more about Athena: Fiercely Feminine Goddess of War and Wisdom", "Read more about High-Tech Scans Prove Austria’s Venus of Willendorf Originated in Italy", "Read more about Zoroastrianism: 4000 Years of Faith, Fire and the Battle Between Good and Evil", "Read more about The Truth About the Holy Grail: Magical Chalices Around the World", "Read more about The Jewish Satan Mastema and the Cosmic War Against God", "Read more about The Truth Behind the Christ Myth: Ancient Origins of the Often Used Legend – Part I", "Read more about Ezekiel’s Daniel: Biblical Hero or Ancient Ugaritic Legend?", "Read more about The Wondrous Buddhist Rock-Cut Architecture of the Ajanta Caves", "Read more about Mythical Metropolises: Pithom, Piramesses, and the Israelite Exodus of Egypt", "Read more about Easter Rebirth: How Rabbits and Eggs Came to Symbolize New Life (Video)", "Read more about Teotlnanácatl: In Search of the Aztec 'God's Flesh' Psychedelic Mushroom"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}