{"result_id": "029034", "URL": "https://www.ancient-origins.net/news-history-archaeology/genghis-khan-death-0014893", "timestamp": "2023-04-25 12:04:41 CEST+0200", "meta": {"description": "Could it be that a team of scientists has finally found the cause of death of Genghis Khan?", "lang": "en", "keywords": "Genghis Khan, Mongol, Tomb, China, bubonic plague, Plague, pandemic, myth, covid-19", "favicon": "https://www.ancient-origins.net/apple-touch-icon-192x192.png", "canonical": "https://www.ancient-origins.net/news-history-archaeology/genghis-khan-death-0014893", "encoding": "utf-8"}, "image": null, "domain": "www.ancient-origins.net", "title": "Mystery of Genghis Khan’s Death Considered Solved", "cleaned_text": "A team of scientists have cleared up the myths surrounding the death of the great Genghis Khan . They claim that his passing might hold a message for today’s leaders amidst the threats of the current Covid-19 pandemic. Born Temujin of the Borjigin clan in 1162 AD, Genghis Khan was the legendary Mongol leader who developed a vast empire stretching from the east coast of China west to the Aral Sea. The great Khan was 65 years old when he died in 1227 AD during a campaign against the Chinese kingdom of Xi Xia. Now a team of researchers suggest Genghis Khan died from bubonic plague .\n\nGenghis Khan was the “original historical gangster” (H.O.G). With his rule of violence and terror Khan controlled everywhere, and everything, between the Pacific Ocean and the Caspian Sea. According to a recent Live Science article, this domain represented a landmass about “2.5 times larger by territory than the Roman Empire.” While the circumstances surrounding the conqueror's birth, his rise to power, and socio-political influence are relatively well-known, the events leading up to Genghis Khan ’s death have remained a mystery. Until now, that is.\n• Search to Find Tomb of Genghis Khan Picks up Pace\n• The Darkhad: Guardians of The Soul of Genghis Khan\n\nA BBC article explains that after Genghis’ death he was “buried in secret.” His grieving army carried his body home, killing anyone they met “to hide the route.” Then, once the Khan’s body was finally laid to rest, 1,000 horses were marched over his grave to destroy any remaining traces. And then all of those horsemen were killed when they returned. This plan worked, apparently. For over the 800 years since Genghis Khan ’s death not one of the thousands of researchers who have looked for his lost tomb have unearthed so much as a horseshoe.\n\nIn the almost 800 years since his death, no one has yet discovered the tomb of Genghis Khan, but not for want of trying. ( Andrey Shevchenko / Adobe Stock)\n\nIn the new paper published in the International Journal of Infectious Diseases , the research scientists said the Mongols had been warring against the Western Xia empire for more than two decades when Genghis fell ill. To maintain political security, Genghis Khan 's family and closest followers, kept the circumstances leading up to his demise as their most carefully guarded secret. Then, in some cases to immortalize it, and in others to damn his very name, “both friends and foes of the Mongols told a number of legends about his death.”\n\nThe authors mention one story that claims Genghis Khan had succumbed to “blood loss after getting stabbed or castrated by a princess of the Tangut people,” a Tibeto-Burman tribe in northwest China. Another tale says he died of injuries sustained after falling from his horse while fighting against the Chinese the year before his death. Furthermore, another folktale says he died of an infected arrow wound during his final campaign against the Western Xia.\n\nOne of the co-authors of the new study, Francesco Galassi, a physician and paleo pathologist at Flinders University in Adelaide, Australia, says the tales told of the death of the kings and emperors of greater China were “often mixed with myth.”\n\nCould it be that the researchers have discovered the true cause of Gehghis Khan’s death? (Иван Коржев / CC BY-SA 3.0 )\n\nLessons from the Past: Genghis Khan’s Death and Covid-19\n\nThe team of researchers set out to discover, once and for all, how Khan actually died. They say it was the current Covid-19 pandemic that prompted them to consider microbial causes. The History of Yuan is a historical text compiled during China's Ming dynasty. The text claims that “from Aug. 18 to Aug. 25, 1227 AD, during Genghis Khan's last campaign against the Western Xia, he felt unwell with a fever,” that ultimately killed him within eight days of the first symptoms.\n\nTraditionally, typhoid fever was blamed for Khan’s death, but Dr. Galassi and his colleagues say in the new paper that “no mention of other typical symptoms of that disease, such as abdominal pain and vomiting,” were mentioned in the ancient text. What the researchers did notice, however, was that the symptoms “matched those of the bubonic plague that was prevalent in that era.”\n\nCo-author of the paper, Dr. Elena Varotto, an anthropologist and bioarchaeologist at the University of Catania in Italy, said “Genghis Khan's death might serve as a general example of the influence of diseases upon leadership, potentially capable of changing the course of history.” She went so far as to suggest Genghis Khan's fate “may hold lessons for the present-day leaders,” as Covid-19 threatens the leaders of our modern nations the same way the plague got Khan. The researchers remind us that infectious diseases have no respect for human power, and they care not for one’s class, education, pay-grade or religion.\n\nTop image: Once the ruler of a vast empire, the search for his final resting place and discovering the cause of Genghis Khan’s death has become an obsession for historians. Source: Towseef / Adobe Stock", "opengraph": {"type": "article", "url": "https://www.ancient-origins.net/news-history-archaeology/genghis-khan-death-0014893", "title": "Mystery of Genghis Khan’s Death Considered Solved", "description": "A team of scientists have cleared up the myths surrounding the death of the great Genghis Khan. They claim that his passing might hold a message for today’s leaders amidst the threats of the current Covid-19 pandemic.", "image": "https://www.ancient-origins.net/sites/default/files/field/image/Genghis-Khan-death.jpg", "image:secure_url": "https://www.ancient-origins.net/sites/default/files/field/image/Genghis-Khan-death.jpg", "image:type": "image/jpeg", "article:published_time": "2021-02-05T17:11:23+00:00", "article:modified_time": "2021-02-05T17:11:55+00:00", "site_name": "Ancient Origins Reconstructing the story of humanity's past"}, "tags": ["Read more about Sexual Exploits and Exploitation along the Silk Road", "Read more about From Nomads to Glampers: The History of the Yurt", "Read more about The Mongol Onslaught: When Ukraine Fell to the Horde (Video)", "Read more about 9 Ancient Leaders Who Changed the Course of History", "Read more about Did The Curse of Tamerlane Cause One of the Bloodiest Battles in World War II?", "Read more about ‘Super-Father’: One in 200 Men are Descendants of Genghis Khan"], "tweets": [], "movies": [], "links": ["https://www.ancient-origins.net/history-famous-people/genghis-khan-0010790", "https://www.ancient-origins.net/history-famous-people/mughal-empire-0010922", "https://www.ancient-origins.net/history-important-events/genocides-0013417", "https://www.ancient-origins.net/history-important-events/black-death-0013083", "https://www.ancient-origins.net/news-history-archaeology/military-stronghold-mongolian-conqueror-genghis-khan-020244", "https://www.livescience.com/genghis-khan-death-cause-revealed.html", "https://www.ancient-origins.net/news-history-archaeology/genghis-khans-winter-camp-0013946", "https://www.ancient-origins.net/news-history-archaeology/search-find-tomb-genghis-khan-picks-pace-002557", "https://www.ancient-origins.net/history-important-events/mongol-empire-0012538", "https://www.ancient-origins.net/history-famous-people/darkhad-0011527", "http://www.bbc.com/travel/story/20170717-why-genghis-khans-tomb-cant-be-found", "https://www.ancient-origins.net/history/temujin-genghis-khan-hard-life-leads-path-vengeance-part-i-006212", "https://www.youtube.com/watch?v=hLgaCJEV2b0", "https://stock.adobe.com/uk/contributor/204616904/andrey-shevchenko", "https://www.ijidonline.com/article/S1201-9712(21)00020-5/fulltext", "https://www.ancient-origins.net/history-famous-people/jebe-0010816", "https://www.ancient-origins.net/history-famous-people/genghis-khan-biography-0010873", "https://www.flinders.edu.au/", "https://commons.wikimedia.org/wiki/File:Korzhev_Ivan._Chingishan._%D0%9A%D0%BE%D1%80%D0%B6%D0%B5%D0%B2_%D0%98._%D0%A7%D0%B8%D0%BD%D0%B3%D0%B8%D1%81%D1%85%D0%B0%D0%BD,_2008,_%D0%B1%D1%80%D0%BE%D0%BD%D0%B7%D0%B0_%D0%B4%D0%B5%D1%80%D0%B5%D0%B2%D0%BE_", "https://www.ancient-origins.net/history/uprisings-and-pandemics-0013839", "https://www.chinahighlights.com/travelguide/china-history/the-yuan-dynasty.htm#:~:text=The%20Yuan%20empire%20was%20founded,money%20as%20the%20main%20currency.", "https://www.unict.it/en/", "https://www.ancient-origins.net/news-history-archaeology/death-ships-0013723", "https://stock.adobe.com/uk/contributor/208268329/towseef"], "authors": [], "publish_date": "2021-02-05T17:11:23+00:00"}