{"result_id": "029045", "URL": "https://www.ancient-origins.net/history-ancient-traditions/inoculation-0016692", "timestamp": "2023-04-25 12:04:57 CEST+0200", "meta": {"description": "From ancient China and India to 18th-century Britain, the history of inoculation is a fascinating one, evolving over time to protect people from disease.", "lang": "en", "keywords": "Medicine, vaccine, disease, cure, smallpox", "favicon": "https://www.ancient-origins.net/apple-touch-icon-192x192.png", "canonical": "https://www.ancient-origins.net/history-ancient-traditions/inoculation-0016692", "encoding": "utf-8"}, "image": null, "domain": "www.ancient-origins.net", "title": "Just a Poke: The Origins of Inoculation", "cleaned_text": "With the recent pandemic and the still-spreading Covid-19 virus, inoculation has become a hot topic throughout several areas of the world. Regardless of what side you’re on, the history of inoculation that led us to this point is a fascinating one. From ancient China and India to 18th-century Britain, inoculation methods have travelled far and wide to protect people from certain diseases.\n\nJapanese watercolor illustration of smallpox, dating back to 1720, from a work entitled Toshin seiyo, or The essentials of smallpox. (Wellcome Collection / Public Domain Mark 1.0 )\n\nThe early methods of inoculation all focused on one specific but deadly disease: smallpox. The earliest records of inoculation all describe it as an attempt to eliminate smallpox from China, and other areas such as Europe eventually started researching and using inoculation to prevent smallpox as well. By continuing to share these medical advancements worldwide, smallpox was eventually eradicated entirely by 1980, with the last known natural outbreak of smallpox occurring in the US in 1949.\n• Learn From History: Don’t Panic, But Prepare For Coronavirus Pandemic\n\nVaccination has certainly evolved since the time of early inoculation in Asia and Europe. With so many mandatory vaccines for infants, children, and adults, we are certainly no longer live in the same world that existed at the time of small pox in the early 16th to 20th centuries. The journey to get here, however, was a long one filled with medical experimentation and uncertainty. To see how far we’ve come, we must first start where the first records of inoculation come from: China.\n\nCh'iu-Hsu, Yin-tou lueh, 1895. Chinese tract on vaccination. Figure showing the appropriate places on the arm where a vaccination could take place. (Wellcome Collection / Public Domain Mark 1.0 )\n\nWhere Was Inoculation First Developed: China or India?\n\nThe earliest records of inoculation are believed to stem back all the way to sometime around 1000 AD. Though there are not many records of this, it is thought that inoculation was first invented by a Taoist or Buddhist monks and involved a combination of medicine and magic, which discouraged official recording of this practice. The first official account of inoculation attempts was not created until 1549, when it was recorded in an ancient medical book. This record claimed that inoculation had potentially induced menstruation in some women, which indicated that this must have been at least a somewhat common medical procedure by this time.\n\nRecords of China’s use of inoculation continues into the late 1600s with the Khangxi emperor. This emperor publicly proclaimed that he had successfully inoculated himself and his entire family with smallpox to prevent illness and death from the disease. This encouraged Chinese physicians to publish medical manuals describing common inoculation methods to the public.\n\nThese manuals included early methods such as taking the scabs of infected patients and crushing them into powder to be snorted or consumed as a drink mixed with water. Fluid from smallpox pustules would also be collected on cloth and stuffed up the noses of those wishing to be inoculated in an attempt to produce an immune response.\n\nSome argue, however, that India developed true inoculation first, since India used needles before China did. Records from the 18th century reveal that Indian Brahmins would take sharp iron needles and dip them in the pustule of an infected person before poking the needle into the skin of an uninfected person.\n\nIn addition to using needles first, a written record from 1731 by Oliver Coult states that the procedure had first been performed by a physician named Dununtary from Champanagar over 150 years previous to his writing. This would suggest that this method was being used around the 1580s, around the same time as inoculation origins in China. Other texts claim that inoculation has been performed in India for thousands of years, but any texts from before the 1731 Coult account only discuss smallpox and its treatment rather than inoculation specifically.\n\nThough it is unclear which country started using inoculation practices first, many historians believe that both methods evolved independent of one another. Rather than it starting in one country and being taught to another, it is possible that they started separately in each area and were not shared until after the 1500s. However, there has been no evidence of these claims either way. Further evidence will have to be found and analyzed to back up and find out more about these timelines.\n\nInoculation was introduced to Europe and the Ottoman Empire in the 18th century after the publishing of a letter from Emanuel Timonius at Constantinople in the Philosophical Transactions of the Royal Society . This letter was read to the Royal Society by John Woodward, which then influenced others to send their own letters communicating information they knew about inoculation in other countries such as China, India, and Africa.\n\nWith this information spreading across Europe, Lady Mary Wortley Montagu, wife of British Ambassador to the Ottoman Empire Edward Wortley Montagu, went to Turkey and saw inoculation working first-hand. Remembered as a “trailblazing 18th-century scientist and early feminist,” according to The Guardian , Wortley Montagu was herself a smallpox survivor who had her son inoculated for smallpox in Turkey and later returned to Europe and brought her daughter to Scottish physician Charles Maitland to be inoculated.\n\nThe inoculation of this political family brought great publicity to the concept of inoculation, which encouraged officials to publish more information on the practice and encouraged citizens to get inoculated against smallpox themselves. Widespread talk at this time suggested that inoculation had existed in Europe since the 1600s, but had simply not yet become as common as it had in other parts of the world.\n\nIn Europe, the most common method for inoculating was similar that used in India, whereby fluid from pustules was collected as the source of the infection. Needles would be dipped into this fluid and then punctured into the recipient’s skin to induce infection. In addition to pustule fluid, some physicians preferred to use scabs, which would be broken into powder for needles to be dipped in. Some people would even try to inoculate without the use of a physician by purchasing scabs from infected people and rubbing the scabs into open wounds. This practice originated the popular phrase “buying the pocks.”\n\nOther areas of Europe tried less common methods. Scabs may simply be held in a child’s hand for a few hours in an attempt to let the smallpox seep through their skin. Other families would take the clothing of infected children and put it on their non-infected children to try giving them immunity. Sometimes, a small thread was soaked in the fluid of smallpox pustules and wrapped around the wrist of a child to try inoculating them. Even with all of these variations, using a needle to insert infected material into one’s skin was the most common method amongst Europeans at this time, and it only gained in popularity over time.\n\nEngraving by C. Manigaud showing Edward Jenner vaccinating his son. ( Wellcome Collection / Public Domain Mark 1.0)\n\nSoon after Europe’s discovery and implementation of inoculation, this medical practice spread to Britain and later, New England. The British analyzed this information and began to take it a step further, focusing most of their efforts on those with the highest risk of death from infection. These are some of the earliest records of “disease severity” being a significant factor in medical practice.\n\nHowever, they were warier of inoculation than some other countries. In fact, they were so concerned with the effects of medical experimentation that they first tried smallpox inoculation on prisoners, telling them that if they survived the inoculation they would be freed. This inadvertently led to the liberation of many prisoners since inoculation proved itself to be fairly effective.\n\nEdward Jenner, an English physician, began studying the effects of inoculation in the late 1700s. After spending many years as an apprentice to a country physician, Jenner began considering other methods of inoculation for smallpox. He began to toy with this idea after observing that a large number of dairy farmers did not become infected with smallpox.\n\nThough some physicians believed this meant the farmers had once had smallpox, they adamantly stated that they had never had it. Physicians began to question this as those inoculated with smallpox always show some sort of physical symptom, but none of the farmers being inoculated experienced any symptoms.\n\nAfter hearing these accounts, Jenner began considering that cowpox, a virus related to smallpox but less severe, could be the key to defeating the horrid disease. In 1796, he decided to test his theory by inoculating a young boy with fluid from a cowpox pustule, which proved his theory true. The boy was immune to smallpox after this inoculation, as were Jenner’s many family members that he inoculated. Inoculation with cowpox resulted in few or no symptoms in humans and prevented any sort of reaction when being inoculated with smallpox, proving immunity.\n\nAfter this success, Jenner coined the term “vaccination,” which stems from the Latin term vaccinus which translates to “of or from the cow.” He continued to vaccinate others throughout England against smallpox and later became known as the Father of Vaccination. Inoculation with smallpox was eventually banned in England in the mid-1800s as it was no longer deemed safe compared to cowpox vaccination. In 1800, Harvard professor of medicine Benjamin Waterhouse brought this vaccine to New England by sharing this medical breakthrough with President John Adams and vaccinating his own children.\n\nAn inquiry by Edward Jenner into the causes and effects of the variolae vaccinae : a disease discovered in some of the western counties of England, particularly Gloucestershire, and known by the name of the cowpox. (Wellcome Collection / Public Domain Mark 1.0 )\n\nSince Jenner’s work, other vaccines have been able to be put into use including those for diphtheria, tetanus, pertussis, polio, measles, mumps, and rubella. Other vaccine research has also created vaccines against Hepatitis A and B as well as the annual shot against influenza. Combination vaccines have also become common, which vaccinate patients against multiple diseases in one vaccine (such as MMR for measles, mumps, rubella). Boosters for vaccines have also become more common to protect people against diseases long-term, with some vaccines needing more boosters than others.\n\nMost recently, a vaccine and booster vaccines have been created for Covid-19, and other vaccines are in the works for diseases such as Hepatitis C, Ebola, Malaria, and Lassa fever. In addition to developing new vaccines for other diseases, current medical research is focused on making vaccines more effective in the long run. While many vaccines eventually need boosters to keep immune response up (such as Covid-19 boosters or the annual flu shot for evolving influenza strains), development in vaccine research could improve our current vaccines to make them last a lifetime, thus avoiding the need for a booster.\n\nWith so many diseases causing long-term symptoms and death, medical advancement is a must. Further funding for medical technology is essential to keeping populations safer and to prevent future pandemics. With the effort of scientists and medical professionals, hopefully someday we can see a world free of disease unlike any other time in history.\n\nTop image: Vaccination poster image. The story of inoculation is far older than you might think. Source: bakhtiarzein / Adobe Stock", "opengraph": {"type": "article", "url": "https://www.ancient-origins.net/history-ancient-traditions/inoculation-0016692", "title": "Just a Poke: The Origins of Inoculation", "description": "With the recent pandemic and the still-spreading Covid-19 virus, inoculation has become a hot topic throughout several areas of the world. Regardless of what side you’re on,", "image": "https://www.ancient-origins.net/sites/default/files/field/image/inoculation.jpg", "image:secure_url": "https://www.ancient-origins.net/sites/default/files/field/image/inoculation.jpg", "image:type": "image/jpeg", "article:published_time": "2022-04-27T22:54:35+01:00", "article:modified_time": "2022-04-27T22:55:46+01:00", "site_name": "Ancient Origins Reconstructing the story of humanity's past"}, "tags": ["Read more about High Status Brothers Had Access to Cranial Surgery in Bronze Age Israel", "Read more about Medicinal Microbes of Our Ancestors: Tracing the History of Probiotics", "Read more about Marijuana for All that Ails You: Cannabis in the Ancient World", "Read more about Murderous Medicine: Six Strange and Horrifying Ancient Medical Treatments", "Read more about Ancient Medicinal Mint Has Untapped Potential, New Research Reveals", "Read more about Ancient Maggot and Leech Therapy Sees Revival to Fight Antibiotic Resistance"], "tweets": [], "movies": [], "links": ["https://wellcomecollection.org/works/uvz4cwcc", "https://www.ancient-origins.net/news-general/disease-0013806", "https://www.ancient-origins.net/history-famous-people/muhammad-ibn-zakariya-al-razi-0015893", "https://www.ancient-origins.net/news-general/coronavirus-pandemic-0013234", "https://www.ancient-origins.net/history-important-events/ancient-africans-0013738", "https://www.ancient-origins.net/news-history-archaeology/ancient-coronavirus-0015507", "https://wellcomecollection.org/works/xh9rraz8", "https://commons.m.wikimedia.org/wiki/File:Liotard_Lady_Montagu.jpg", "https://www.theguardian.com/society/2021/mar/28/how-mary-wortley-montagus-bold-experiment-led-to-smallpox-vaccine-75-years-before-jenner", "https://wellcomecollection.org/works/b7d6yvdr/images?id=np6gnqz2", "https://www.ancient-origins.net/history-ancient-traditions/prisons-and-imprisonment-ancient-world-punishments-used-maintain-public-020588", "https://www.youtube.com/watch?v=6iRatByNw08", "https://wellcomecollection.org/works/aq3qrvnw/images?id=j3bgpngs", "https://www.ancient-origins.net/news-science-space/measles-origins-0013080", "https://www.ancient-origins.net/news-history-archaeology/child-mummy-unlocks-secret-unravelling-450-years-hepatitis-b-virus-009392", "https://www.ancient-origins.net/news-history-archaeology/viruses-sleeping-mummies-could-ancient-corpses-lead-modern-epidemics-009234", "https://www.ancient-origins.net/news-science-space/measles-origins-0013080", "https://www.ancient-origins.net/news-history-archaeology/neanderthal-gene-0014357", "https://www.ancient-origins.net/news-history-archaeology/viruses-sleeping-mummies-could-ancient-corpses-lead-modern-epidemics-009234", "https://www.ancient-origins.net/news-history-archaeology/archaeological-digs-0015324", "https://www.ancient-origins.net/news-history-archaeology/plague-athens-0013456", "https://www.ancient-origins.net/news-history-archaeology/viking-smallpox-0014025", "https://stock.adobe.com/uk/contributor/205363189/bakhtiarzein?load_type=author&prev_url=detail", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3407399/", "https://www.npr.org/sections/goatsandsoda/2018/02/01/582370199/whats-the-real-story-about-the-milkmaid-and-the-smallpox-vaccine", "https://www.cdc.gov/smallpox/index.html", "https://www.chop.edu/centers-programs/vaccine-education-center/vaccine-history/developments-by-year", "https://www.reuters.com/business/healthcare-pharmaceuticals/moderna-plots-vaccines-against-15-pathogens-with-future-pandemic-potential-2022-03-08/", "https://www.nature.com/articles/d42859-020-00006-7", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8402855/", "https://amhistory.si.edu/polio/virusvaccine/history.htm", "https://www.historyofvaccines.org/timeline/"], "authors": [], "publish_date": "2022-04-27T22:54:35+01:00"}