{"result_id": "029040", "URL": "https://www.ancient-origins.net/news-evolution-human-origins/study-black-death-skeletons-reveals-plague-airborne-0998877", "timestamp": "2023-04-25 12:04:49 CEST+0200", "meta": {"description": "An analysis carried out on 25 skeletons of plague victims discovered by railway engineers beneath London last year, has revealed that the Black Death was even more lethal than previously thought.", "lang": "en", "keywords": "bubonic, Plague, black death, pandemic, epidemic, Europe, london, airborne, pathogen, Yersinia pestis, bacterium, DNA, skeletons, archaeology news", "favicon": "https://www.ancient-origins.net/apple-touch-icon-192x192.png", "canonical": "https://www.ancient-origins.net/news-evolution-human-origins/study-black-death-skeletons-reveals-plague-airborne-0998877", "encoding": "utf-8"}, "image": null, "domain": "www.ancient-origins.net", "title": "Study of Black Death skeletons reveals plague may have been airborne", "cleaned_text": "An analysis carried out on 25 skeletons of plague victims discovered by railway engineers beneath London last year, has revealed that the Black Death was even more lethal than previously thought. Scientists are now doubtful that the epidemic was spread by the bites of infected fleas living on rats. Instead, it appears that the pathogen mutated into a more virulent strain that was airborne.\n\nThe Black Death arrived in Britain from central Asia in the autumn of 1348 and by late spring the following year it had killed six out of every 10 people in London. It was one of the most devastating pandemics in human history, resulting in the deaths of an estimated 75 to 200 million people.\n\nAn analysis on the DNA extracted from the 14 th century skeletons unearthed in London revealed traces of Yersinia pestis bacterium, the pathogen responsible for the Black Death , confirming what scientists had suspected – the remains belonged to plague victims who had been hastily buried in a mass grave. Guided by underground radar scans, researchers now plan to expand their search for more victims as it is believed there could be hundreds if not thousands more nearby.\n\nTraces of Yersinia pestis were found in the 14 th century skeletons. Photo source .\n\nScientists compared the strain of the plague preserved in the victims, to a strain that was recently responsible for killing 60 people in Madagascar. To their surprise, the 14th-century strain, was no more virulent than today's disease. That means that there must have been another factor that caused the 14 th-century strain to become a deadly pandemic, while the Madagascar one did not.\n\nThe findings cast doubt on the ‘facts’ that every schoolchild has learned for decades – the Black Death was caused by a highly contagious strain spread by fleas on rats.\n\n“As an explanation for the Black Death in its own right, [bubonic plague is] simply not good enough,” said Dr Tim Brooks, an expert in infectious diseases at Public Health England. “It cannot spread fast enough from one household to the next to cause the huge number of cases that we saw during the Black Death epidemics.”\n\nThe Black Death was one of the most deadly pandemics in recorded history. Image source .\n\nScientists working at Public Health England have therefore suggested a different cause - for any plague to spread at such a pace it must have got into the lungs of victims who were malnourished and then spread by coughs and sneezes – fatal in medieval Europe’s crowded cities. It was therefore a pneumonic plague rather than a bubonic plague, which had a much lower survival rate and could kill within 24 hours.\n\n“In a small number of people … the organism will spread to their lungs and they will then develop a pneumonia,” said Dr Brooks. “It is that critical switch, that if there were enough people in contact with them, that allows it to spread as a pneumonic plague.”\n\nThe results of the study have led to a breakthrough in our understanding of the ancient pandemic of the 14 th century, and offers new hope in the understanding of how plagues evolve and spread over the centuries.", "opengraph": {"type": "article", "url": "https://www.ancient-origins.net/news-evolution-human-origins/study-black-death-skeletons-reveals-plague-airborne-0998877", "title": "Study of Black Death skeletons reveals plague may have been airborne", "description": "An analysis carried out on 25 skeletons of plague victims discovered by railway engineers beneath London last year, has revealed that the Black Death was even more lethal than previously thought.", "image": "https://www.ancient-origins.net/sites/default/files/field/image/black-death-plague-1.jpg", "image:secure_url": "https://www.ancient-origins.net/sites/default/files/field/image/black-death-plague-1.jpg", "image:type": "image/jpeg", "article:published_time": "2014-03-31T23:05:27+01:00", "article:modified_time": "2020-03-21T13:53:21+00:00", "site_name": "Ancient Origins Reconstructing the story of humanity's past"}, "tags": ["Read more about New Details Emerge on the Black Death by Examining a Plague Victim and her Tragic Coffin Birth", "Read more about Eyam’s Ultimate Sacrifice: Medieval Village Locked Down to Stop the Plague", "Read more about The Plague that brought down mighty empires is thousands of years older than thought", "Read more about Amber encases a flea infected 20 million years ago with bubonic plague-type bacteria", "Read more about The Black Death: the Plague that Sowed Terror and Death in Medieval Europe - Part 1", "Read more about The Justinianic Plague Wasn’t as Bad as Many Scholars Think"], "tweets": [], "movies": [], "links": ["https://www.ancient-origins.net/news-history-archaeology/black-death-0013302", "http://www.bbc.com/news/science-environment-26770334", "http://www.getting-medieval.com/my_weblog/2010/10/black-death-pathogen-identified.html", "http://contagions.wordpress.com/the-plague/", "https://plus.google.com/111732353779175483777/posts"], "authors": [], "publish_date": "2014-03-31T23:05:27+01:00"}