{"result_id": "029026", "URL": "https://www.ancient-origins.net/news-science-space/animal-human-hybrids-0012383", "timestamp": "2023-04-25 12:04:31 CEST+0200", "meta": {"description": "Scientists have created an animal-human hybrid. Relocating their research to China to avoid legal restrictions they created a human-monkey embryo.", "lang": "en", "keywords": "human-monkey, embryo, animal testing, Genes, stem cells, transplants, DNA, Hybrid, animal-human", "favicon": "https://www.ancient-origins.net/apple-touch-icon-192x192.png", "canonical": "https://www.ancient-origins.net/news-science-space/animal-human-hybrids-0012383", "encoding": "utf-8"}, "image": null, "domain": "www.ancient-origins.net", "title": "World’s First Human-Monkey Hybrid Created In China", "cleaned_text": "A team of American and Spanish scientists relocated to China to jump European laws and they have created the world’s first human-monkey embryo, in the next step in the controversial breeding of animals for the human organs program.\n\nNotes on ‘animal testing’ appear in 4th and 3rd centuries BC writings of the ancient Greeks and Galen was a 2nd-century Roman physician who dissected pigs and goats, and thus is known as the “Father of Vivisection”. Then, in 12th-century Moorish Spain the Arabic physician, surgeon, and poet Ibn Zuhr (Latin: Avenzoar) practiced dissection and surgical procedures on animals before applying them to human patients.\n\nAgain, in Spain, researchers from the Murcia Catholic University (UCAM) and the Salk Institute for Biological Studies (SIBS) in the US (founded in 1960 by Jonas Salk, the developer of the polio vaccine) “ genetically modified monkey embryos” and have successfully created a HUMAN-MONKEY embryo.\n\nA report in RT says the team of scientists, led by Juan Carlos Izpisúa, relocated to China to conduct the experiment because it was “in violation of Spanish law”. These modern Dr. Frankensteins tinkered with the very building blocks of organic life and firstly they “deactivated specific genes used in the formation of organs” before injecting “ human stem cells into the embryo”.\n\nScientists injected human stem cells into the monkey embryo to create the animal-human hybrid. ( freshidea / Adobe Stock)\n\nIf left to evolve ‘naturally’ the embryo would quickly have grown into a monkey with human cells ; but adhering to ‘ethical standards’ the plug was pulled on the whole process long before the embryo began developing a central nervous system . The Spanish daily El Pais quoted Estrella Núñez, who collaborated on the project, as saying “the results are very promising… a necessary first step towards developing human organs in animals that could be used in transplants”.\n\nIt seems like only yesterday scientists at Scotland’s Roslin Institute created their ‘specialized’ cell and made a whole new animal, but it was way back in the 5th of July 1996 that ‘ Dolly the Sheep ’ was born. This Roslin Institute report details the work of Professor Sir Ian Wilmut and his team who cloned Dolly from a ‘ mammary gland cell’ taken from a six-year-old Finn Dorset sheep and an egg cell taken from a Scottish Blackface sheep. Incidentally, the report discloses that because Dolly’s DNA had come from a mammary gland cell this is why she was named “after the country singer Dolly Parton”.\n\nThe cloning process that produced Dolly the Sheep. (Magnus Manske / Public Domain )\n\nSince Dolly’s first bahh, the world has been divided on the ethical issues associated with animal testing and in researching these arguments one quickly realizes that both factions readily throw scientific studies and contradictory ‘hard’ facts back and forth. But as a base-line to help you understand the perimeters of this problem a May 2017 article published on animal testing on ProCon says “an estimated 26 million animals are ‘used’ every year in the United States for scientific and commercial testing” mostly to determine the toxicity of developing medical treatments for humans.\n\nProponents of animal testing often say research on living animals has been practiced since at least 500 BC and gives us life-saving treatments and that there is no viable alternative to studying complete living organisms. They might throw down this 2017 California Biomedical Research Association paper that states “nearly every medical breakthrough in the last 100 years has resulted directly from research using animals”.\n• 1,400-year-old medicinal treatise of Galen found hidden under hymns in ancient manuscript\n\nOpponents of animal testing say that it’s inhumane and cruel to experiment on animals and that alternative methods ‘are’ available to researchers. Their academic armory might fire off this extensive 2012 Humane Society International study that demonstrated animals were commonly subjected to “force feeding, forced inhalation, food and water deprivation, prolonged periods of physical restraint, the infliction of burns and other wounds to study the healing process, the infliction of pain to study its effects and remedies, and killing by carbon dioxide asphyxiation, neck-breaking, decapitation, or other means”.\n\nWhere Exactly Are ‘We’ With Creating Hybrid Animal-Humans?\n\nIn 2017 the same team that have now produced a human-monkey embryo attempted to brew-up a “ human and pig chimera ” and when this experiment failed they subsequently succeeded in creating hybrid chimeras between a rat and a mouse. An example of an answer as to ‘why’ scientists are making human-monkey chimera’s might be Dr. Douglas Munoz of Queen’s University’s breakthrough study on the onset of Alzheimer’s disease in humans, derived from data gathered by injecting monkeys with proteins.\n\nBut a good argument for the danger of ‘uncontrolled’ tests of this kind, and why this could all go terribly wrong, is discussed in this Earth.com article that refers to “a resource guide on the ethics of chimeras” written by Yale University researchers suggesting “that it is time to ‘cautiously’ explore the creation of human-monkey chimeras”. Dr. Munoz himself told the National Post in July that the “prospect of humanizing animal brains is disturbing to him” and he concluded “for us to start to manipulate life functions in this kind of way without fully knowing how to turn it off, or stop it if something goes awry really scares me”. \n\nDoesn’t Dr. Munoz sound like a computational scientist speculating about the potential catastrophes of uncontrolled testing of AI? It seems like we humans are destined, possibly hell-bound to create something that is part us, but much more than us, whether we want to or not.\n\nTop image: On Left - Young chimpanzee. On Right - Human Embryo. Source: Left, Public Domain ; Right, CC BY-SA 2.0 .", "opengraph": {"type": "article", "url": "https://www.ancient-origins.net/news-science-space/animal-human-hybrids-0012383", "title": "World’s First Human-Monkey Hybrid Created In China", "description": "A team of American and Spanish scientists relocated to China to jump European laws and they have created the world’s first human-monkey embryo, in the next step in the controversial breeding of animals for the human organs program.", "image": "https://www.ancient-origins.net/sites/default/files/field/image/Animal-Human-Hybrids.jpg", "image:secure_url": "https://www.ancient-origins.net/sites/default/files/field/image/Animal-Human-Hybrids.jpg", "image:type": "image/jpeg", "article:published_time": "2019-08-02T22:40:21+01:00", "article:modified_time": "2019-08-02T22:52:21+01:00", "site_name": "Ancient Origins Reconstructing the story of humanity's past"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.ancient-origins.net/human-origins-science/how-ancient-hominid-interbreeding-has-shaped-humans-today-004151", "https://www.youtube.com/watch?v=pGacJWvTZr4", "https://www.ancient-origins.net/news-history-archaeology/breaking-new-dna-testing-2000-year-old-elongated-paracas-skulls-changes-020914", "https://www.ancient-origins.net/history/five-things-ancient-greeks-can-teach-us-about-medicine-today-006463", "https://www.ancient-origins.net/history-famous-people/galen-famous-medical-researcher-classical-antiquity-005459", "https://www.ancient-origins.net/history-famous-people/andreas-vesalius-medieval-physician-who-loved-dissecting-humans-006754", "https://www.ancient-origins.net/history-famous-people/paracelsus-father-toxicology-and-enemy-physicians-003958", "https://www.ancient-origins.net/artifacts-ancient-technology/sushruta-samhita-and-plastic-surgery-ancient-india-020148", "https://www.ancient-origins.net/news-science-space/infant-bodies-were-prized-19th-century-anatomists-study-suggests-006220", "https://www.ancient-origins.net/opinion-guest-authors/origin-man-00806", "https://www.rt.com/news/465576-china-embyro-human-monkey-organs/", "https://www.ancient-origins.net/news-science-space/planet-x-there-scientific-evidence-005768", "https://www.ancient-origins.net/news-evolution-human-origins/science-lab-neanderthal-brains-021900", "https://stock.adobe.com/images/genetic-editing/236233736", "https://www.ancient-origins.net/news-history-archaeology/when-dna-missing-ancient-sugar-chain-may-help-trace-human-evolution-008785", "https://www.ancient-origins.net/news-history-archaeology/fayum-mummy-portraits-expose-information-about-precise-painting-techniques-020744", "https://elpais.com/elpais/2019/07/30/ciencia/1564512111_936966.html", "https://www.ancient-origins.net/news-science-space/russian-scientists-make-progress-secret-eternal-life-003917", "https://www.ancient-origins.net/opinion-guest-authors/library-stone-ica-stones-professor-cabrera-part-i-006637", "https://www.ancient-origins.net/news-science-space/extinct-bird-dinosaur-claw-may-soon-be-resurrected-009729", "https://dolly.roslin.ed.ac.uk/facts/the-life-of-dolly/index.html", "https://www.ancient-origins.net/news-history-archaeology/legal-bid-fails-rebury-remains-2500-year-old-tattooed-ice-princess-005299", "https://www.ancient-origins.net/news-human-origins/ancient-dna-parchments-reveal-hidden-stories-002458", "https://www.ancient-origins.net/news-evolution-human-origins/ancient-ancestors-had-more-dna-we-do-now-have-we-devolved-003590", "https://commons.wikimedia.org/wiki/File:Dolly_clone.svg", "https://animal-testing.procon.org/", "https://www.ancient-origins.net/artifacts-ancient-writings/ebers-papyrus-0012333", "https://www.ancient-origins.net/news-history-archaeology/frozen-organisms-0012258", "https://www.ancient-origins.net/news-evolution-human-origins/telling-smile-tooth-variation-shows-hobbit-was-entirely-separate-human-020629", "https://www.ancient-origins.net/news-history-archaeology/1400-year-old-medicinal-treatise-galen-found-hidden-under-hymns-ancient-020371", "https://www.ancient-origins.net/history/forget-folk-remedies-medieval-europe-spawned-golden-age-medical-theory-007507", "https://stock.adobe.com/images/workplace-modern-laboratory-for-molecular-biology-test/64159236", "https://www.hsi.org/news-media/about/", "https://www.ancient-origins.net/history/ancient-remedies-0012251", "https://www.ancient-origins.net/news-evolution-human-origins/how-most-humans-lost-their-tails-fish-tetrapods-apes-homo-sapiens-021116", "https://www.youtube.com/watch?v=TCu_f9MKyBg", "https://dbms.queensu.ca/faculty/doug_munoz", "https://www.earth.com/news/human-monkey-chimeras/", "https://nationalpost.com/news/canada/it-just-really-ethically-scares-me-caution-urged-as-scientists-look-to-create-human-monkey-chimeras", "https://pxhere.com/en/photo/606254", "https://www.flickr.com/photos/euthman/304334264", "https://www.ancient-origins.net/users/ashley-cowie"], "authors": [], "publish_date": "2019-08-02T22:40:21+01:00"}