{"result_id": "029044", "URL": "https://www.ancient-origins.net/news-science-space/mammoth-meatball-0018156", "timestamp": "2023-04-25 12:04:56 CEST+0200", "meta": {"description": "Having fused elephant, sheep and mammoth DNA in a lab, scientists have created the misleadingly named “mammoth meatball.” But can you really eat it?", "lang": "en", "keywords": "meat, food, mammoth, DNA, protein, dodo, Extinction", "favicon": "https://www.ancient-origins.net/apple-touch-icon-192x192.png", "canonical": "https://www.ancient-origins.net/news-science-space/mammoth-meatball-0018156", "encoding": "utf-8"}, "image": null, "domain": "www.ancient-origins.net", "title": "Scientists Create Potentially Deadly Prehistoric “Mammoth Meatball”", "cleaned_text": "Scientists have successfully created a hybrid of elephant, sheep, and mammoth DNA in a laboratory, which they have misleadingly dubbed the “mammoth meatball”. Despite their success, producers of the unusual concoction have hesitated to try it, citing concerns about its safety.\n\nThe so-called prehistoric “mammoth meatball” has been manufactured by the Australian “cellular meat” company, Vow. This culinary conundrum will be displayed this Thursday at the Nemo Science Museum in the Netherlands.\n\nIn this seemingly sci-fi experiment, scientists extracted the DNA from an ancient mammoth, a beast that went extinct some 10,000 years ago, and combined it with genetic material from an elephant. This hybrid DNA sequence , that shouldn't rightfully be called a mammoth, was then set in myoblast stem cells from a sheep.\n\nThe experiment produced approximately 20 billion cells that were then used to cultivate what some are calling mammoth meat. However, according to a report in the Daily Mail , the producers “are too afraid to eat it in case the ancient protein proves deadly.” In other word, there are concerns that the mammoth meatball may be harmful.\n\nThis Is Not A “Mammoth Meatball”\n\nProfessor Ernst Wolvetang of the Australian Institute for Bioengineering at the University of Queensland , was the brainchild behind the supposed \"mammoth meatball.” He explained that his team of scientists took the DNA sequence from mammoth muscle protein, known as myoglobin.\n\nDistantly related to haemoglobin, Myoglobin, is an iron and oxygen-binding protein that is found in the skeletal muscle tissue of vertebrates and most mammals. According to Wolvetang, gaps in the mammoth DNA were “filled in” with DNA coding from the mammoth's close living relative, the African elephant.\n\nFinally, this new DNA sequence was placed into a sheep's stem cells and the genetic soup produced around 20 billion copies that were then used to make the ill-named “mammoth meatball.” However, this is “not” a mammoth meatball. It is a sheep and elephant meatball, built on mammoth DNA.\n\nThe mammoth is an extinct species of elephant that lived during the Pleistocene epoch. Now scientists have used ancient mammoth DNA, combined with other genetic material, and created what has been dubbed a mammoth meatball . ( WILD HARE / Adobe Stock)\n\nProfessor Wolvetang told The Guardian that the process of making the mammoth meatball was completed in a “couple of weeks,” a time frame which he described as “ridiculously easy and fast.” However, he warned that because the meat was thrown together so quickly “we have no idea how our immune system would react” if it was eaten by a human.\n\nWolvetang stated that if his team were to produce additional mammoth meat products, they would ensure they were “more palatable to regulatory bodies.” It is worth noting that he referred specifically to regulatory bodies, rather than consumers' bodies.\n\nThe team actually set out to reintroduce dodo meat. According to a 2003 estimate published in Nature, this flightless bird went extinct at the end of the 17th century. But lacking dodo DNA, the team abandoned this quest, and the idea to create a “mammoth meatball” came from Bas Korsten, at creative agency Wunderman Thompson.\n\nThe ‘mammoth meatball’ was unveiled at in the Netherlands. ( studioaico/ Wunderman Thompson )\n\nAccording to Vow, the company's overarching goal is “to demonstrate the potential of meat grown from cells as an alternative to the slaughter of animals.” Furthermore, Vow associates global warming with large-scale livestock production. The company explained that they chose “mammoth meat,” even though it isn’t mammoth meat, because the mammoth “is a symbol of diversity loss and a symbol of climate change .”\n\nThe internet is full of scientists claiming “meat without slaughter,” or lab grown meat consumption is inevitable, because cultivated meats use much less water and land than livestock. Lab grown meat also produces no methane emissions.\n\nHowever, these tropes are becoming widely contested by sceptical researchers. “Splashy headlines have long overshadowed inconvenient truths about biology and economics,” decried a 2021 article in The Counter . Now, extensive new research suggests the cellular meat industry may be on a “billion-dollar crash course with reality.” But, why?\n\n“Most of us have a limited appetite for 50-dollar lab-grown chicken nuggets,” stressed The Counter . Meanwhile the Food Health Agency has explained that “unlike animals, cells do not have a fully functioning immune system, so there is a high likelihood of bacterial or fungal growth, mycoplasma, and other human pathogens growing in vats of cells.” Because this science is so new, there are no long-term trials to support spurious claims that these food products would be safe and healthy for human consumption.\n\nTransitioning, No Matter What the Human Cost Might Be\n\nIn this most recent attempt, lab-grown meat companies, which is also known as cultured meat, aimed to produce palatable mammoth meat. But some producers remain hesitant to consume it due to concerns that the ancient protein could be harmful to humans. Notwithstanding, some lab-grown meat companies, including the California-based Upside Foods , have passed the approval process for their product in the United States.\n• Mammoth Hybrid To Be Made Using Asian Elephants\n\nGeorge Peppou, who Ted Talks describe as “a serial entrepreneur and inventor, with over 30 patents granted,” is co-founder and CEO of food-tech startup Vow. “The goal is to transition a few billion meat eaters away from eating [conventional] animal protein to eating things that can be produced in electrified systems,” explained Peppou in The Guardian .\n\nHowever, before transitioning billions of traditional meat eaters, perhaps this serial entrepreneur should himself be a part of the human trials for his own self-proclaimed “deadly” mammoth meatball. But then again, it isn’t really a “mammoth meatball.” Maybe it should be named after what it really is; a “potentially deadly fusion of mammoth DNA, blended with elephant and sheep.” Although this may not be quite as catchy.\n\nThis prehistoric monster mammoth meatball is not only a threat to our future children’s health. It’s also a hazard to more than 570 million farms worldwide, of which more than 90% are run by families who produce about 80% of the world's food today, according to the Food and Agriculture Organization of the United Nations .\n\nTop image: An Australian lab-grown meat company has created a so-called mammoth meatball made using mammoth DNA. Source: studioaico/ Wunderman Thompson", "opengraph": {"type": "article", "url": "https://www.ancient-origins.net/news-science-space/mammoth-meatball-0018156", "title": "Scientists Create Potentially Deadly Prehistoric “Mammoth Meatball”", "description": "Scientists have successfully created a hybrid of elephant, sheep, and mammoth DNA in a laboratory, which they have misleadingly dubbed the “mammoth meatball”.", "image": "https://www.ancient-origins.net/sites/default/files/field/image/mammoth-meatball.png", "image:secure_url": "https://www.ancient-origins.net/sites/default/files/field/image/mammoth-meatball.png", "image:type": "image/jpeg", "article:published_time": "2023-03-29T22:57:57+01:00", "article:modified_time": "2023-03-29T23:01:07+01:00", "site_name": "Ancient Origins Reconstructing the story of humanity's past"}, "tags": ["Read more about Pet Dogs in the Bronze Age Given Vegetarian Diet!", "Read more about Nine Absolutely Disgusting Ancient Foods Our Ancestors Enjoyed", "Read more about What Egyptians Ate: Did the Cuisine of Ancient Egypt Reflect the Tastes of Today?", "Read more about Study Dispels Human Meat Diet Hypothesis, Changing Evolutionary Story", "Read more about Pot Residues Lift the Lid on Ancient Indus Valley Food Choices", "Read more about Neanderthals Definitely Had a Meat-Based Diet: Claims of Plant and Cannibal Diet Refuted"], "tweets": [], "movies": [], "links": ["https://www.ancient-origins.net/news-history-archaeology/dna-analysis-0015460", "https://www.vowfood.com/", "https://www.musement.com/uk/amsterdam/nemo-science-museum-v/?lid=43700069541845281&ds_s_kwgid=58700007452107383&&ds_e_adid=553888647070&ds_e_matchtype=search&ds_e_device=c&ds_e_network=g&&ds_url_v=2&idengine=700000002023563&idcampaign=71700000087627215&idadgroup=58700007452107383&nmkeyword=nemo+amsterdam&idkeyword=43700069541845281&gclid=Cj0KCQjww4-hBhCtARIsAC9gR3aKWyss8AcOcd60lQo_aobujLzOoftVz0toHget7gbf3zCQ4oZetggaAnhhEALw_wcB&gclsrc=aw.ds", "https://www.ancient-origins.net/news-history-archaeology/human-impact-animal-extinction-0015289", "https://www.ancient-origins.net/news-history-archaeology/pompeii-man-genome-0016822", "https://www.ancient-origins.net/news-general/satanists-0012912", "https://www.ancient-origins.net/news-general/mammoth-dna-0014948", "https://www.ancient-origins.net/weird-facts/dodo-0018060", "https://www.ancient-origins.net/news-history-archaeology/baby-mammoth-0016947", "https://www.dailymail.co.uk/sciencetech/article-11910339/Scientists-grow-mammoth-flesh-lab-make-prehistoric-meatball-afraid-eat-it.html", "https://aibn.uq.edu.au/", "https://www.ancient-origins.net/history-ancient-traditions/did-man-and-mammoth-ever-live-harmony-not-quite-008014", "https://stock.adobe.com/uk/contributor/211227399/wild-hare?load_type=author&prev_url=detail", "https://www.theguardian.com/environment/2023/mar/28/meatball-mammoth-created-cultivated-meat-firm#:~:text=Vow%20Food%20worked%20with%20Prof,few%20gaps%20using%20elephant%20DNA.", "https://www.ancient-origins.net/news-evolution-human-origins/human-meat-diet-0016340", "https://www.nature.com/articles/426245a", "https://www.wundermanthompson.com/", "http://studioaico.nl/", "https://wunderman-belgium.prezly.com/the-woolly-mammoth-is-back-to-raise-questions-about-the-future-of-food", "https://www.ancient-origins.net/news-history-archaeology/cultural-he", "https://thecounter.org/lab-grown-cultivated-meat-cost-at-scale/", "https://thecounter.org/lab-grown-cultivated-meat-cost-at-scale/", "https://www.centerforfoodsafety.org/blog/6458/is-lab-grown-meat-healthy-and-safe-to-consume#:~:text=Another%20major%20issue%20associated%20with,growing%20in%20vats%20of%20cells.", "https://upsidefoods.com/", "https://www.ancient-origins.net/news-evolution-human-origins/environmental-dna-0017631", "https://www.ancient-origins.net/news-science-space/mammoth-hybrid-0015821", "https://tedxsydney.com/contributor/george-peppou/#:~:text=George%20is%20co%2Dfounder%20and,tantalising%20and%20unique%20culinary%20experiences.", "https://www.vowfood.com/", "https://www.ancient-origins.net/news-evolution-human-origins/ancient-human-ancestors-ate-raw-meat-and-insects-they-cleaned-their-021121", "https://www.theguardian.com/environment/2023/mar/28/meatball-mammoth-created-cultivated-meat-firm#:~:text=Vow%20Food%20worked%20with%20Prof,few%20gaps%20using%20elephant%20DNA.", "https://www.ancient-origins.net/news-history-archaeology/mummified-meat-left-egyptian-royals-after-death-001045", "https://www.ancient-origins.net/news-general/dinosaur-dna-0016128", "https://www.youtube.com/watch?v=0xwTR8d768Q", "https://www.ancient-origins.net/news-evolution-human-origins/origin-farming-0016758", "https://www.fao.org/family-farming/background/en/", "http://studioaico.nl/", "https://wunderman-belgium.prezly.com/the-woolly-mammoth-is-back-to-raise-questions-about-the-future-of-food", "https://www.ancient-origins.net/users/ashley-cowie"], "authors": [], "publish_date": "2023-03-29T22:57:57+01:00"}