{"result_id": "029022", "URL": "https://www.ancient-origins.net/weird-facts/elixir-life-0017223", "timestamp": "2023-04-25 12:04:24 CEST+0200", "meta": {"description": "The First Emperor of China was so terrified of death that he spent a decade searching for the Elixir of Life. Ironically, it was his quest for endless life that sent him to his death.", "lang": "en", "keywords": "Qin Shi Huang, First Emperor, Chinese, alchemy, Mercury, poison, elixir of life, Immortality", "favicon": "https://www.ancient-origins.net/apple-touch-icon-192x192.png", "canonical": "https://www.ancient-origins.net/weird-facts/elixir-life-0017223", "encoding": "utf-8"}, "image": null, "domain": "www.ancient-origins.net", "title": "The First Emperor of China Took an ‘Elixir of Immortality’ Made of Mercury and it Killed Him", "cleaned_text": "The First Emperor of China, Qin Shi Huang, was terrified of death and much of his reign was focused on the search for immortality and the Elixir of Life. Ironically, Qin Shi Huang died from the toxic effects of consuming a so-called Elixir of Life made of mercury.\n\nThe story of Qin Shi Huang’s search for immortality sounds like something straight out of a fairytale. For the last ten years of his life, China’s first Emperor sent every scholar, magician, and wise man in the nation on a quest to find an elixir that would keep him from dying. He gave up everything in his mad war against the inevitability of death – and in the end, let his fear of dying drive him into an early grave.\n\nHis quest for immortality was not just driven by a desire for everlasting power, but his intense fear of death. Qin Shi Huang had elevated walkways and walled roads installed, connecting each building so that he’d never have to walk outside exposed. Every window was covered with a curtain, and anyone who mentioned the emperor’s location was put to death.\n\nA portrait painting of Qin Shi Huangdi, first emperor of the Qin Dynasty, from an 18th-century album of Chinese emperor's portraits. ( Public Domain )\n\nIn 211 BC, a meteor crashed near the lower reaches of the Yellow River. On it was an inscription that read; “The First Emperor will die and his land will be divided.” The Emperor was furious. He demanded to know who had written it, and when no one came forward, he had every person in the area executed. Then the meteor itself was pulverized into bits so that no one would ever see the message again.\n\nWhen the First Emperor overheard a rumor that the alchemists who had promised him the elixir of life were playing him for a fool, Qin Shi Huang flew into a rage. 460 scholars were dragged out of their homes and pulled to the capital. There he had a huge pit waiting for them. The Emperor had the wisest men in the kingdom thrown into the pit, and he buried them alive.\n\nThe Emperor tried all kinds of concoctions that were offered to him by his advisors. On his way home from his fifth tour of Eastern China, he stopped at a palace in Hopei and fell incredibly ill. He had been taking pills that one of his alchemists had promised would make him immortal. What they had given him were pills of poisonous mercury, a common ingredient in ancient Chinese elixirs , and he had just taken a lethal dose. He died that night.\n\nQin Shi Huang’s search for endless life had resulted in his premature death. The nation erupted into civil war, and Qin Shi Huang’s united China fell apart. The Emperor himself only lived to be 49.\n\nRead more: How the Search for Immortality Killed the First Emperor of China\n\nTop image: The First Emperor of China was Killed by an Elixir of Immortality. Source: ЮРИЙ ПОЗДНИКОВ / Adobe Stock", "opengraph": {"type": "article", "url": "https://www.ancient-origins.net/weird-facts/elixir-life-0017223", "title": "The First Emperor of China Took an ‘Elixir of Immortality’ Made of Mercury and it Killed Him", "description": "The First Emperor of China, Qin Shi Huang, was terrified of death and much of his reign was focused on the search for immortality and the Elixir of Life. Ironically, Qin Shi Huang died from the toxic effects of consuming a so-called Elixir of Life made of mercury.", "image": "https://www.ancient-origins.net/sites/default/files/field/image/elixir-of-life.jpg", "image:secure_url": "https://www.ancient-origins.net/sites/default/files/field/image/elixir-of-life.jpg", "image:type": "image/jpeg", "article:published_time": "2022-09-03T22:55:48+01:00", "article:modified_time": "2022-09-03T22:55:48+01:00", "site_name": "Ancient Origins Reconstructing the story of humanity's past"}, "tags": ["Read more about Builders of Teotihuacan Had Remarkable Knowledge of Science and Engineering", "Read more about Chinese Find Ancient Xianyang, Lost Capital of the Qin Dynasty", "Read more about One In 8,000! This Unique Terracotta Figure Is Unlike All The Rest", "Read more about 9 Ancient Leaders Who Changed the Course of History", "Read more about Wei Dynasty Terracotta Figurines Enrich Our Knowledge of Ancient China", "Read more about Thousands Of Tombs Found in Xian, Home of China’s Terracotta Army"], "tweets": [], "movies": [], "links": ["https://www.ancient-origins.net/history/seeking-life-finding-death-deadly-chinese-elixirs-immortality-009577", "https://www.ancient-origins.net/history-famous-people/ruthless-chinese-emperor-qin-shi-huang-how-he-unified-and-tyrannized-his-020762", "https://www.ancient-origins.net/news-history-archaeology/chinese-elixir-life-0011571", "https://upload.wikimedia.org/wikipedia/commons/4/43/Qin_shihuangdi_c01s06i06.jpg", "https://www.ancient-origins.net/myths-legends-asia/elixir-life-0013476", "https://www.ancient-origins.net/history-famous-people/search-immortality-killed-emperor-china-0010207", "https://stock.adobe.com/ie/contributor/210114067/%D1%8E%D1%80%D0%B8%D0%B9-%D0%BF%D0%BE%D0%B7%D0%B4%D0%BD%D0%B8%D0%BA%D0%BE%D0%B2?load_type=author&prev_url=detail"], "authors": [], "publish_date": "2022-09-03T22:55:48+01:00"}