{"result_id": "029013", "URL": "https://www.ancient-origins.net/famous-people?page=7", "timestamp": "2023-04-25 12:04:13 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.ancient-origins.net/apple-touch-icon-192x192.png", "canonical": "https://www.ancient-origins.net/famous-people", "encoding": "utf-8"}, "image": null, "domain": "www.ancient-origins.net", "title": "Famous People (Page 8) | Ancient Origins", "cleaned_text": "Blackbeard, an infamous pirate from the 1700s, was notoriously an excellent fighter and survivalist. He was so famous, in fact, that after his death his skull was rumored to have been plated in...", "opengraph": {"site_name": "Ancient Origins Reconstructing the story of humanity's past"}, "tags": ["Read more about Eri: Mythical King and Founder of the Igbo", "Read more about Just a Poke: The Origins of Inoculation", "Read more about Achilles: The Greatest Hero of Greek Mythology?", "Read more about Martin Guerre: A Much Celebrated Historic Tale of Stolen Identity", "Read more about Whatever Happened to Blackbeard’s Silver-Plated Skull?", "Read more about The Visions of Ermine de Reims - Supernatural Forces in Everyday Medieval Life", "Read more about First Tomb of Christopher Columbus Finally Found", "Read more about Finding Francisco Pizzaro: The Strange Story of Pizarro’s Remains", "Read more about Gold Ring that Belonged to Real Sheriff of Nottingham Sold", "Read more about Klaus Störtebeker: The Bizarre Tale of a North German Pirate", "Read more about The Sena Empire: Rise and Fall of the Last Hindu Kings of Bengal", "Read more about Who was the Teacher of Righteousness in the Dead Sea Scrolls?", "Read more about Acharya Kanad: An Indian Sage Who Developed Atomic Theory 2,600 Years Ago", "Read more about The Ben Cao Gang Mu – The Bible of Traditional Chinese Medicine", "Read more about Sweden’s Enigmatic Golden Curmsun Disc", "Read more about Hell Hath No Fury Like the Freedom Fighting Trung Sisters"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}