{"result_id": "029029", "URL": "https://www.ancient-origins.net/weird-facts/leprosy-0017379", "timestamp": "2023-04-25 12:04:34 CEST+0200", "meta": {"description": "Leprosy was once treated with a host of ridiculous remedies, including lathering lesions in bull gallbladder paste, steamed flies, and ass fat!", "lang": "en", "keywords": "leprosy, disease, treatment, Medicine, remedy, Pliny", "favicon": "https://www.ancient-origins.net/apple-touch-icon-192x192.png", "canonical": "https://www.ancient-origins.net/weird-facts/leprosy-0017379", "encoding": "utf-8"}, "image": null, "domain": "www.ancient-origins.net", "title": "Leprosy Was Treated with Ass Fat, Bull Gallbladder and Steamed Flies!", "cleaned_text": "It wasn’t until the 1970s that scientists developed an effective cure for leprosy. Up until then this terrible disease was feared not just for its awful symptoms, but also for the stigma that came with it and the ridiculous remedies popularized throughout the ages, including lathering lesions in bull gallbladder paste, steamed flies, and ass fat – that’s a wild ass of the horse family of course!\n\nOne source of such curious treatments is the Roman author Pliny the Elder (23 to 79 AD). In his Naturalis Historia , considered by some to be the first encyclopedia in history, Pliny discusses particular diseases and the crazy concoctions which Romans believed would cure them.\n\nLeprosy is a sickness which, when untreated, can lead to serious and permanent damage not just to the skin, but also to the nerves, limbs and eyes. One of the first visible symptoms is the appearance of ulcers or lesions on the skin, numbness and even burning sores on the bottom of feet. Its victims are often horribly disfigured and crippled for life.\n\nNow imagine having to endure the peculiar prescriptions created by the Romans. Some of them, although useless, sound pretty harmless, such as applying sores with vinegar-soaked elm. Asses’ fat was also thought to help heal scars caused by leprosy.\n\nPliny the Elder included a selection of remedies for leprosy within his Naturalis Historia. ( Public domain )\n\nOther remedies involved rubbing a blend of salt, raisins, suet and bread into open wounds. Meanwhile, putting asses’ urine or bull gallbladder on skin lesions, with the added proviso that it had to be done during the rising of the dog-star, which we know today as Sirus, appears to defy all logic.\n\nInsects were reported to be “extremely efficacious for the cure of leprosy.” The main ingredient in one especially curious cure, thought to stay the progress of the disease, were Catherides, known as Spanish fly, particularly juicy ones covered in yellow streaks. The idea was to steam the insects in a small pot layered with fully-bloomed roses and cover it with linen cloth. Once they’re done, the mixture was mushed into a pulp and lathered onto the leprous sores.\n\nThe Romans weren’t the only ones to come up with dubious medication. From snake venom and excrement, to bee stings, human blood and isolation, there’s very little nonsense which hasn’t been tested on leprosy’s casualties. While Elma Brenner highlights the importance of avoiding “reductive and misleading” depictions of the way lepers were treated throughout history in History Extra , leprosy has been associated with shame and stigma in different moments of history.\n\nThe name itself comes from the Bible, where leprosy was inflicted by God as divine punishment for their sins. In an attempt to rid the terminology of this reputation, in recent years it has been replaced with the term Hansen’s disease, after the Norwegian physician who discovered the leprosy bacillus bacteria back in 1873.\n\nTop image: The hands of a person with leprosy. Source: paul salmon/EyeEm / Adobe Stock", "opengraph": {"type": "article", "url": "https://www.ancient-origins.net/weird-facts/leprosy-0017379", "title": "Leprosy Was Treated with Ass Fat, Bull Gallbladder and Steamed Flies!", "description": "It wasn’t until the 1970s that scientists developed an effective cure for leprosy.", "image": "https://www.ancient-origins.net/sites/default/files/field/image/leprosy%20.jpg", "image:secure_url": "https://www.ancient-origins.net/sites/default/files/field/image/leprosy%20.jpg", "image:type": "image/jpeg", "article:published_time": "2022-10-09T23:00:50+01:00", "article:modified_time": "2022-10-10T14:38:59+01:00", "site_name": "Ancient Origins Reconstructing the story of humanity's past"}, "tags": ["Read more about Squirrels, Armadillos and Now Apes Have Leprosy", "Read more about Did Scandinavian Vikings Carry Leprosy To Ireland?", "Read more about Behold the Coconut! There’s Nothing Savage About Niue", "Read more about A Toxic Price to Pay: Wealthy citizens in medieval Europe had poisoning from lead-glazed plates", "Read more about Caribbean Island Skull Reveals Evidence of Old World Leprosy, Study", "Read more about Edinburgh’s First Inhabitants Revealed in 3D Digital Reconstructions"], "tweets": [], "movies": [], "links": ["https://www.ancient-origins.net/news-general/uncovering-ancient-roots-leprosy-001367", "https://www.ancient-origins.net/history/ancient-plant-immortality-treats-over-50-medical-conditions-007505", "https://www.ancient-origins.net/history-famous-people/illustrious-life-pliny-elder-ancient-historian-and-roman-commander-003262", "https://www.ancient-origins.net/news-history-archaeology/caribbean-leprosy-0016099", "https://www.ancient-origins.net/news-science-space/leprosy-0012578", "https://commons.wikimedia.org/wiki/File:Histoire_Naturelle_Pline_l_Ancien_mid_12th_century_Abbaye_de_Saint_Vincent_Le_Mans_France.jpg", "https://www.ancient-origins.net/history-ancient-traditions/what-so-special-about-sirius-dog-star-009232", "https://www.ancient-origins.net/news-history-archaeology/1500-year-old-skeleton-scandinavian-man-might-be-patient-zero-spread-020344", "https://www.historyextra.com/period/general-history/leprosy-history-disease-perception-treatment/", "https://www.youtube.com/watch?v=UVUETqrtC3I", "https://www.ancient-origins.net/news-history-archaeology/unique-burial-method-medieval-japan-may-be-linked-social-stigma-against", "https://www.ancient-origins.net/news-general/leprosy-0015947", "https://stock.adobe.com/ie/contributor/209283439/paul-salmon-eyeem?load_type=author&prev_url=detail"], "authors": [], "publish_date": "2022-10-09T23:00:50+01:00"}