{"result_id": "029008", "URL": "https://members.ancient-origins.net/articles/virtual-archaeology-2021", "timestamp": "2023-04-25 12:04:07 CEST+0200", "meta": {"description": "Despite COVID-19 restrictions, ingenious archaeologists are adapting to virtual excavations and conferences to find ancient treasures.", "lang": "en", "keywords": "archaeology, ancient, unexplained, mythology, artefacts, evolution, origins, history, myths", "favicon": "/apple-icon-57x57.png", "canonical": "https://members.ancient-origins.net/articles/virtual-archaeology-2021", "encoding": "utf-8"}, "image": null, "domain": "members.ancient-origins.net", "title": "2021 The Year Virtual Archaeology Fights Back", "cleaned_text": "The 2020 lockdowns saw thousands of planned archaeological excavations canceled and postponed and those archaeologists who persisted at their projects faced serious challenges accessing archives, labs, reports and museum artifacts. But humankind is resilient and none more so than ingenious archaeologists, as 2021 has seen an array of amazing discoveries from mapping monuments in Erbil in Iraq to unearthing a female statue in Hidalgo Amajac, Álamo in Mexico; from finding a stash of gold in Újlengyel in Hungary to discovering a new passage from the Book of the Dead in Saqqara in Egypt, and from a deciphering symbols on a bone fragment found in Ramle in Israel to discovering shipwrecks of Kasos island, Greece, and that is just for January.\n\nEven though the distribution of vaccines is appearing to be highly-effective against the spread of COVID-19, the days of large archaeological conferences in airport hotels, stretching over two or three days, have most probably ended as the pandemic has demonstrated the feasibility and benefits of virtual archaeology. Not only are virtual conferences cheaper but they appeal to a far wider audience. (Don’t miss out on the Ancient Origins Ancient Hi-Tech Uncovered April 2021 conference).\n\nBecome a member to read more OR login here", "opengraph": {"site_name": "Ancient Origins Members Site", "type": "article", "url": "https://members.ancient-origins.net/articles/virtual-archaeology-2021", "title": "2021 The Year Virtual Archaeology Fights Back"}, "tags": [], "tweets": [], "movies": [], "links": ["/articles/virtual-archaeology-2021", "javascript:;", "/user/login?bookmark_login=1&destination=/?bookmark_login_nid=1349", "/users/ashley-cowie", "/articles/archaeology-science", "#", "https://shop.ancient-origins.net/collections/conferences/products/ancient-hi-tech-uncovered-conference-2021", "https://shop.ancient-origins.net/collections/conferences/products/ancient-hi-tech-uncovered-conference-2021", "https://shop.ancient-origins.net/collections/conferences/products/ancient-hi-tech-uncovered-conference-2021", "https://members.ancient-origins.net/user/register", "https://members.ancient-origins.net/user/login?destination=node/1349"], "authors": [], "publish_date": null}