{"result_id": "029006", "URL": "https://www.ancient-origins.net/news-history-archaeology/placebo-effect-0017539", "timestamp": "2023-04-25 12:04:03 CEST+0200", "meta": {"description": "A new study of medieval medicine has concluded that physicians understood that placebos could help induce self-healing in their patients.", "lang": "en", "keywords": "placebo, Medicine, health, physician, healing", "favicon": "https://www.ancient-origins.net/apple-touch-icon-192x192.png", "canonical": "https://www.ancient-origins.net/news-history-archaeology/placebo-effect-0017539", "encoding": "utf-8"}, "image": null, "domain": "www.ancient-origins.net", "title": "Medieval Medicine Understood How the Placebo Effect Could Heal", "cleaned_text": "Is it time to kill the term “placebo effect”? A researcher looking at questionable medieval medicines, that are today shunned as placebos, has shown how early physicians triggered patient’s brains into making their body self-heal.\n\nThe Healing Power (or Placebo Effect) of a Mother’s Kiss\n\nWhen we were children falling about and battering our knees, a kiss from mum on the kneecap would often see the pain dissipate immediately. We know now that those kisses weren’t magic and that the “placebo effect / response” was at play. In the pharmaceutical world this occurs when positive therapeutic outcomes are derived from inert treatments like sugar pills, saline injections and mother’s kisses.\n• Fake It Til’ You Make it: A History of the Placebo Effect\n• The Healing Power of Dream Incubation in Ancient Greece\n\nThe magical effect of a mother’s kisses is an example of the placebo effect at play. Mother and Child by Camille Corot. ( Public domain )\n\nToday, placebos are central in medical studies where some test subjects are given new drugs while others are given a placebo. The results are compared to assess if new drugs beat the placebo effect in test patients.\n\nHowever, in some areas of medicine placebos are observed to provide patients with clinical improvement. The apparent power of placebos to enable the body to heal itself was discussed in depth by 18th century psychologists, but now a new paper looking at medieval medicines prefers the term “meaning response” over “placebo.”\n\nThe new study re-examined three medieval medical texts, including Bald’s Leechbook, housed at the British Library, Royal MS 12 D XVII, ff. 20v-21r. ( Public domain )\n\nFor two centuries physicians have often disregarded medieval medical treatments as placebos. Since the 1800s the word placebo has generally been used when referring to fake treatments, but a new study turns all this around by demonstrating that medieval physicians had a rich understanding of how to apply sometimes inert treatments to best help their patients self-heal.\n\nThe new study undertaken by Rebecca Brackmann, an Associate Professor of English at Lincoln Memorial University, is published in the latest issue of the University of Chicago Journal Speculum. The researcher re-examined three medieval English texts: Bald’s Leechbook , Leechbook III , and the Old English Herbal.\n\nThese three medieval medical books offer what are by today's standards bizarre and outlandish medical treatments, but Brackmann broke the scientific mold and asked if the so-called placebo effect might offer insights about how the power of the human brain can cause the body to heal.\n\nHating clichés, but always paying compliments where due, this truly is a display of out-of-the-box thinking. So often science is structured on quoting the safe peer-reviewed research findings published beforehand. This time however, Brackmann asked brave and hitherto unformed questions in her field of research.\n\nMedieval physicians have often been described as prescribing fake treatments, also dubbed placebos. Village Charlatan by Adriaen Brouwer from the 1620s. ( Public domain )\n\nIn the study, Brackmann wrote that she “challenges” modern dismissals of placebo responses in Old English medicine by showing how placebos “enhanced patient responses to pharmaceutical treatments both inert and active.”\n\nIn order to distance her research from the stigma associated with the word placebo, Brackmann used the term “meaning response” that was first used by Daniel Ellis Moerman, an American medical anthropologist and ethnobotanist, and an emeritus professor of anthropology at the University of Michigan-Dearborn.\n\nMoerman is a specialist in Native American ethnobotany and how the placebo effect works, and in a 2018 article published in Perspectives in Biology and Medicine he proposed replacing the term “placebo effect” with “meaning response.” This is because people do not respond to placebos, which are inert, but they respond to “meanings” and the intention that medics associate with treatments. Brackmann claims that the meaning response “can have striking success” in bringing about self-healing.\n\nWhen Medieval Medicine Changes Our Future\n\nThe three medieval texts studied by Brackmann are greatly built upon earlier remedies lifted from Greek and Roman medical texts. Bald’s Leechbook , for example, was written in the 9th century and it lists many off the wall potions and lotions for ailments, including multiple uses of the herb betony. The medical text claimed that this plant could relieve diarrhea, asthma, heartburn and bladder issues, as well as dissolving kidney stones.\n\nWhile not a shred of scientific evidence exists to support the effectiveness of betony, in 2020 a team of researchers identified what might be a new treatment for modern infections within the magical pages of Bald’s Leechbook .\n\nThe 1000-year-old text suggested that to fight antibiotic resistance “more antimicrobials are needed to treat bacterial biofilms, which protect an infection from antibiotics.” Using a medieval recipe containing every day natural ingredients such as garlic, “ Balds Eyesalve ” was studied by researchers from the University of Warwick who found it to be “effective against five bacteria that cause modern-day biofilm infections.”\n\nEuropean depiction of the Persian doctor Al-Razi in Gerardus Cremonensis, circa 1250s. ( Public domain )\n\nBrackmann concluded that to gain a better understanding of the body’s “meaning response” researchers must “move beyond the simplistic binary of medical recipes that ‘work’ (by modern biomedical standards) and those that do not.” She suggests researchers must look towards the cultural components of beliefs, and understanding which will offer new insights into “the interaction of chemical and cultural healing practices in embodied experience.”\n• Snake Oil Has Long Been Deemed A ‘Fake Medicine’, But It’s Not Guilty, It Really Does Cure!\n\nFurthermore, by focusing on the “cultural components of belief,” Brackmann thinks a new type of discussion can be had focusing on the way medieval medical treatments functioned. According to the researcher, this new cultural approach to medieval medicines does not force scientists to distinguish treatments into the two dogmatic categories of magical or medical.\n\nBrackmann has essentially asked new questions that shatter the traditional dualistic approach to the subject by bridging medieval magic and medicine. Hopefully, this study will allow a deeper understanding of the placebo effect - sorry the “meaning response” - to emerge.\n\nTop image: Medieval medicine understood that the placebo effect could induce self-healing. Source: GINGER_Tsukahara / Adobe Stock", "opengraph": {"type": "article", "url": "https://www.ancient-origins.net/news-history-archaeology/placebo-effect-0017539", "title": "Medieval Medicine Understood How the Placebo Effect Could Heal", "description": "Is it time to kill the term “placebo effect”? A researcher looking at questionable medieval medicines, that are today shunned as placebos, has shown how early physicians triggered patient’s brains into making their body self-heal.", "image": "https://www.ancient-origins.net/sites/default/files/field/image/placebo-effect.jpg", "image:secure_url": "https://www.ancient-origins.net/sites/default/files/field/image/placebo-effect.jpg", "image:type": "image/jpeg", "article:published_time": "2022-11-17T21:41:34+00:00", "article:modified_time": "2022-11-17T21:41:34+00:00", "site_name": "Ancient Origins Reconstructing the story of humanity's past"}, "tags": ["Read more about The Healing Arts and Spiritual Mumbo-Jumbo in the Ancient World", "Read more about Fake It Til’ You Make it: A History of the Placebo Effect"], "tweets": [], "movies": [], "links": ["https://www.ancient-origins.net/history-ancient-traditions/history-placebo-0017054", "https://www.ancient-origins.net/history-ancient-traditions/dream-incubation-ancient-greece-009287", "https://www.metmuseum.org/art/collection/search/435977", "https://www.ancient-origins.net/news-general/ayahuasca-tea-0016132", "https://www.ancient-origins.net/news-general/ancient-medicinal-knowledge-amazon-tribes-be-recorded-writing-first-time-history-009192", "https://www.bl.uk/manuscripts/FullDisplay.aspx?ref=Royal_MS_12_D_XVII", "https://www.ancient-origins.net/weird-facts/urine-0017165", "https://www.ancient-origins.net/news-general/medieval-medicine-1000-year-old-onion-garlic-kills-modern-bacterial-superbugs-020281", "https://www.ancient-origins.net/history-famous-people/ancient-physicians-0012389", "https://www.journals.uchicago.edu/doi/10.1086/721680", "https://www.ancient-origins.net/news-science-space/medieval-medical-books-could-hold-recipe-new-antibiotics-007935", "https://commons.wikimedia.org/wiki/File:%27The_Village_Charlatan_(The_Operation_for_Stone_in_the_Head)%27_by_Adriaen_Brouwer,_The_Hermitage.JPG", "https://pubmed.ncbi.nlm.nih.gov/30293975/", "https://www.ancient-origins.net/history/ancient-medicine-0015845", "https://www.bl.uk/collection-items/balds-leechbook", "https://www.youtube.com/watch?v=FzfMf-2bKrE", "Eyesalve", "https://commons.wikimedia.org/wiki/File:Al-RaziInGerardusCremonensis1250.JPG", "https://www.ancient-origins.net/history/snake-oil-0011317", "https://www.ancient-origins.net/news-general/medieval-medicine-manuscripts-0017162", "https://www.youtube.com/watch?v=2p0Z2wNwcf8", "https://stock.adobe.com/uk/contributor/209817438/ginger-tsukahara?load_type=author&prev_url=detail"], "authors": [], "publish_date": "2022-11-17T21:41:34+00:00"}