{"result_id": "029041", "URL": "https://www.ancient-origins.net/history-0?page=18", "timestamp": "2023-04-25 12:04:50 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.ancient-origins.net/apple-touch-icon-192x192.png", "canonical": "https://www.ancient-origins.net/history-0", "encoding": "utf-8"}, "image": null, "domain": "www.ancient-origins.net", "title": "History (Page 19) | Ancient Origins", "cleaned_text": "Many people use salt to bring out the flavor in their food. Others spread it on icy roads and sidewalks to give vehicles or pedestrians some grip as they go about their day. It is, by most accounts,...", "opengraph": {"site_name": "Ancient Origins Reconstructing the story of humanity's past"}, "tags": ["Read more about Everyday Viking Life: More Farmers Than Fighters", "Read more about Sexual Exploits and Exploitation along the Silk Road", "Read more about The History of Kung Fu: A Modern Name for an Ancient Art", "Read more about Prince William Inherits Ancient Duchy of Cornwall Estate Worth $1.2billion!", "Read more about 12 Ancient Foods That We Still Love Today", "Read more about 76 Pre-Inca Child Sacrifices Found at Peru’s Pampa La Cruz site", "Read more about Why Was Gout The Kingliest of Ailments?", "Read more about Tourism Through the Ages: The Human Desire to Explore", "Read more about Medieval Divorce by Combat: Guaranteeing ‘til Death do us Part’", "Read more about The Gruesome History of Botched Executions", "Read more about Meta-Study Shows Ancient Maya were at High Risk of Mercury Poisoning", "Read more about Why One Neolithic Scottish Settlement Didn’t Need Any Fertilizer", "Read more about Salt Sowing: An Ancient Method to Settle Scores", "Read more about The Battleground Origins of Jujutsu", "Read more about Why is William’s New Prince of Wales Title So Significant?", "Read more about Da Vinci’s Deadly Designs: The Wildest Weapons of the Renaissance Man"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}