{"result_id": "029039", "URL": "https://www.ancient-origins.net/history-ancient-traditions/history-placebo-0017054", "timestamp": "2023-04-25 12:04:47 CEST+0200", "meta": {"description": "The earliest use of the term “placebo” in medicine comes from the 17th century, but the idea of the placebo effect is much older.", "lang": "en", "keywords": "placebo, Medicine, health, physician, doctor, medical", "favicon": "https://www.ancient-origins.net/apple-touch-icon-192x192.png", "canonical": "https://www.ancient-origins.net/history-ancient-traditions/history-placebo-0017054", "encoding": "utf-8"}, "image": null, "domain": "www.ancient-origins.net", "title": "Fake It Til’ You Make it: A History of the Placebo Effect", "cleaned_text": "One of the most fascinating medical phenomena is the placebo effect. In medicine, a placebo is considered to be any medical treatment that is not “real.” This could be a fake pill, shot, or in some cases, even a fake surgery. A literal example of mind over matter, the placebo effect supposedly “heals” you simply by making you think you’ve received treatment.\n\nThe effect has been widely studied, and placebos continue to be used in medical research today. Though placebos are not considered to be ethical medical treatment today, they were widely used in medical treatment throughout history. So where did the placebo effect come from, and just what is it capable of?\n\nAs previously mentioned, placebos are any form of medical treatment that is determined to be knowingly “fake.” Because they are known fake treatments, they are no longer ethically prescribed by physicians. Nowadays, placebos are often used as the control group in clinical trials. This means the responses from the experimental group (the participants with the real treatment) are compared to the responses from the control group (the participants with the fake treatment ). If the clinical trial has significantly greater reports of healing from the experimental group, it is believed the medication is “proven to work.”\n\nThe term placebo comes from an old Latin phrase, “Placebo Domino in regione vivorum,” which translates to, “I will please the Lord in the land of the living.” Over time, the term “placebo” essential meant “flatterer” or “to flatter,” as to “placebo” at a funeral meant to pretend to know the deceased to get a free meal, since you’d have to “flatter” the family to do so.\n\nEventually, “placebo” came to mean anything that was pleasing to others whether it was truthful or not. Even if a person wasn’t friends with the deceased, it pleased the family to believe they were. Similarly, even if a medicine doesn’t truly work, it pleases the patient to think they’re being healed. This mentality led to physicians not only prescribing “fake” medications, but medications that they believed were “weak” or “ineffective,” even if they had some level of functionality.\n• Widespread Erection Problems In China Are Bringing Rhino, Tiger And Other Species To An End\n\nIn later years, placebos started to make their way out of funerals and into medicine. Because the general understanding worldwide was for physicians to not only treat their patients but to make them “feel better,” placebos were used to give untreatable patients peace of mind. Throughout the 18th century, physicians would prescribe placebos to satisfy patient demand, meet patient expectations, and dissuade rumors of physicians refusing to prescribe treatment.\n\nThe primary instance of the term “placebo” in regard to medical treatment occurred in the late 17th century in Bath memoirs: or, Observations in Three and Forty Years Practice by Dr. Robert Pierce. In this book, he describes a “Dr. Placebo,” who mostly treated his patients with his bedside manner rather than his actual medical remedies.\n\nAfter the publishing of this book, the first known record of a placebo being prescribed by a physician occurred in 1752. Dr. William Smellie, a Scottish obstetrician, once wrote:\n\nPlacemus, another term for placebo, indicates that he was willing to prescribe a patient a knowingly fake treatment just to put her mind at ease.\n\nRobert Hooper, a British physician in the 18th and 19th centuries published Quincy’s Lexicon-medicum , an early medical dictionary, in 1811. In this dictionary, Hooper defined “placebo” as “an epithet given to any medicine adapted more to please than benefit the patient.” Ultimately, the goal of the placebo was to put the patient’s mind at ease, whether there was an effective alternative treatment available or not.\n\nHowever, this seemingly considerate motive behind prescribing placebos was not taken positively by everyone. There was great criticism over placebos by some individuals, such as American physician Richard Cabot, who believed using placebos was deceptive. However, others argued the “placebo paradox.” The paradox claims that while using a placebo may seem unethical, not using a treatment that works may also be unethical. If placebos worked in some instances, why shouldn’t a physician use them?\n\nOne of the most well-known specific instances of a placebo being given to a patient occurred in 1799 by British Physician John Haygarth. Haygarth had seen a new “medical remedy” on sale called Perkins tractors, which were metal rods that claimed to “draw disease from the body” by ridding it of electric fluid. Allegedly, the treatments were so popular at the time that even George Washington had a set of these tractors.\n\nCaricature of a quack treating a patient with Perkins Patent Tractors by James Gillray, 1801. (Wellcome Images/ CC BY 4.0 )\n\nUntrusting of the new treatment, Haygarth treated patients with both the real Perkins tractors and fake, wooden Perkins tractors he had produced to look identical to the real ones. He discovered that 4 out of 5 individuals treated with the fake tractors for rheumatism reported feeling better after using them. He found these results fascinating and desired to do more research on the legitimacy of new medical remedies. Haygarth also speculated that the tractors may not have worked through electricity, but by “faith.”\n\nThough Haygarth himself did not call this phenomenon the placebo effect, he did make note of these results in his book On the Imagination as a Cause and as a Cure of Disorders of the Body . Others in the 18th century did use the term placebo effect, but they were not fully associated with any specific medical experiment until Haygarth.\n\nOther physicians took after Haygarth throughout the 19th and 20th centuries, conducting their own placebo experiments to test the legitimacy of various treatments. In many cases, physicians found that the placebo even worked better than some of the new medical treatments, as the actual treatments sometimes caused harmful side effects, while placebos did not.\n\nFrench pharmacist Emile Coué in the late 19th century particularly promoted the placebo effect. He would prescribe placebos, tell the patient about the drug’s great success among his other patients, and even verbally praise patients once they took the medication. This “performance” used when prescribing medication resulted in a positive response from many of his patients, which he described in his 1920 book Self-Mastery Through Conscious Autosuggestion .\n\nNews of the placebo effect spread wildly in the early 20th century due to increases in cheap printing and communication over distances. An article in The Lancet once used the term “placebo effect” in 1920. An anesthesiologist in World War II, Henry Beecher, learned the term from these types of publications and witnessed it first-hand during the war. When morphine was short on the battlefield, nurses would pretend to inject wounded soldiers with morphine, and they would claim to not feel pain. In reality, they were only injected with saline.\n\nBeecher’s observations led to further consideration of placebos in medical research. He noted that most placebos were effective when the treatment was supposed to change perception, such as perception of pain or mental health conditions such as depression. Throughout the 20th century, this was taken into consideration to test the functionality of medications for these conditions. In the 1950s, Beecher published his famous article “The Powerful Placebo,” which claimed that 35% of patients claimed improvement in symptoms after a placebo alone.\n\nWhile these results were fascinating, physicians and researchers in the 1990s questioned these results. According to them, some of the health conditions Beecher was observing could have been healed naturally by the body over time. This would mean that the placebo alone was not the cause of their perceived healing.\n• The Healing Power of Dream Incubation in Ancient Greece\n• Snake Oil Has Long Been Deemed A ‘Fake Medicine’, But It’s Not Guilty, It Really Does Cure!\n\nBecause of doubts over Beecher’s work, future placebo trials must be completed. Since placebos are mostly used in trials for conditions based on perception, putting them against treatments for conditions that cannot necessarily be perceived (i.e. cancer, aneurysms, etc.) likely won’t be effective (and could even be unethical).\n\nFuture trials will need to compare the perception of using a placebo versus using no treatment at all. This would allow physicians to observe whether natural healing over time is comparable with the “healing” seen in placebo patients. In fact, some of these experiments have already been performed, and results indicate that there is little evidence that placebos produce any sort of healing in patients. For those that did claim they felt better, scientists suspect there may have been some bias based on taking a “remedy” that resulted in a small placebo effect amongst some individuals.\n\nArguments from other physicians say that these experiments cannot be taken seriously because they used multiple placebos across multiple conditions. Since some conditions are based on perception and some are not, the results may be inaccurate.\n\nBecause of these contradictions, placebo clinical trials are still in full use. In fact, some physicians are now using placebo surgeries to determine if the placebo effect works outside of sugar pills and fake injections. Dr. Bruce Moseley performed knee surgery on 180 individuals with severe knee pain in 2002. The catch? Half of them were fake surgeries. The patients were put under anesthesia and a small incision was made on their knee, but no other part of the surgery was performed. In over half the trials, the fake surgery was determined to be as effective as the real surgery.\n\nFuture trials must be done to determine just how ethical placebo treatments are versus ordinary treatments. In addition, future experiments determining the effectiveness of placebos versus a lack of treatment must be continued to determine their accuracy.\n\nThe future may surprise us. Perhaps the mind is over matter, after all.", "opengraph": {"type": "article", "url": "https://www.ancient-origins.net/history-ancient-traditions/history-placebo-0017054", "title": "Fake It Til’ You Make it: A History of the Placebo Effect", "description": "One of the most fascinating medical phenomena is the placebo effect. In medicine, a placebo is considered to be any medical treatment that is not “real.” This could be a fake pill, shot, or in some cases, even a fake surgery.", "image": "https://www.ancient-origins.net/sites/default/files/field/image/history-placebo.jpg", "image:secure_url": "https://www.ancient-origins.net/sites/default/files/field/image/history-placebo.jpg", "image:type": "image/jpeg", "article:published_time": "2022-07-24T23:00:35+01:00", "article:modified_time": "2022-07-24T23:00:35+01:00", "site_name": "Ancient Origins Reconstructing the story of humanity's past"}, "tags": ["Read more about The Healing Arts and Spiritual Mumbo-Jumbo in the Ancient World", "Read more about Medieval Medicine Understood How the Placebo Effect Could Heal"], "tweets": [], "movies": [], "links": ["https://www.ancient-origins.net/history/snake-oil-0011317", "https://www.ancient-origins.net/news-general/ayahuasca-tea-0016132", "https://www.ancient-origins.net/news/traditional-chinese-medicine-0011058", "https://www.ancient-origins.net/history-ancient-traditions/roman-funerals-021976", "https://www.flickr.com/photos/dandiffendale/50254468952", "https://www.ancient-origins.net/history-famous-people/ancient-physicians-0012389", "https://www.ancient-origins.net/news-general/ayahuasca-tea-0016132", "https://www.ancient-origins.net/news/traditional-chinese-medicine-0011058", "https://www.ancient-origins.net/human-origins-science/cemi-field-theory-0011319", "https://commons.wikimedia.org/wiki/File:Madame_Royale_Cared_for_by_Doctor_Brunier,_January_24,_1793_MET_DP882510.jpg", "https://www.ancient-origins.net/history-famous-people/hippocrates-0012480", "https://www.ancient-origins.net/history/medieval-scottish-mason-0011342", "https://commons.wikimedia.org/wiki/File:James_Gillray,_%22Metallic_Tractors%22,_showing_Elisha_Perkins_Wellcome_M0010466.jpg", "https://www.ancient-origins.net/history/said-cure-everything-death-these-seeds-are-ancient-miracle-cure-007513", "https://www.ancient-origins.net/news-general/medieval-remedy-0014045", "https://www.ancient-origins.net/news-history-archaeology/1300-year-old-antidepressant-pills-discovered-ancient-center-drug-021030", "https://www.ancient-origins.net/history-ancient-traditions/addiction-treatment-0011113", "https://www.ancient-origins.net/history-ancient-traditions/depression-0015835", "https://www.rawpixel.com/image/2298594/free-photo-image-world-war-vintage-people", "https://www.ancient-origins.net/unexplained-phenomena/healing-sound-ancient-temples-111hz-006749", "https://www.ancient-origins.net/history-ancient-traditions/dream-incubation-ancient-greece-009287", "https://www.ancient-origins.net/history/snake-oil-0011317", "https://www.ancient-origins.net/history-ancient-traditions/cancer-treatment-0016521", "https://www.ancient-origins.net/artifacts-ancient-technology/medical-mystery-usermontu-why-discovery-2600-year-old-knee-screw-020445", "https://www.flickr.com/photos/gandalfsgallery/8592184428", "https://theconversation.com/the-fascinating-story-of-placebos-and-why-doctors-should-use-them-more-often-149945", "https://doi.org/10.1016/j.ctim.2012.06.002", "https://knowablemagazine.org/article/mind/2017/imagination-effect-history-placebo-power", "https://doi.org/10.1056/nejmoa013259", "https://onlinebooks.library.upenn.edu/webbin/book/lookupid?key=uma54826", "https://www.brainfacts.org/archives/2012/the-power-of-the-placebo", "https://www.jameslindlibrary.org/quoted-in-sutherland-a-attempts-to-revive-ancient-medical-doctrines/"], "authors": [], "publish_date": "2022-07-24T23:00:35+01:00"}