{"result_id": "029049", "URL": "https://www.ancient-origins.net/weird-facts/sugar-lead-0017194", "timestamp": "2023-04-25 12:05:04 CEST+0200", "meta": {"description": "Romans added a highly toxic sweetener to their wine and widespread poisoning may have contributed to the downfall of this powerful empire.", "lang": "en", "keywords": "roman, wine, lead, poisoning, toxic, Water, sugar, empire", "favicon": "https://www.ancient-origins.net/apple-touch-icon-192x192.png", "canonical": "https://www.ancient-origins.net/weird-facts/sugar-lead-0017194", "encoding": "utf-8"}, "image": null, "domain": "www.ancient-origins.net", "title": "Romans Added Lead Sweetener to Their Wine and it Killed Them", "cleaned_text": "How far did ancient people go to enhance the flavor of their food and drinks? Would they consume toxic substances if it made things a little more appetizing? Well, the Romans did, by adding a sweet version of lead to their wine and, later, to their food. Some scholars say that widespread lead poisoning contributed to the fall of the powerful Roman empire.\n\nPliny the Elder , Cato the Elder , and Columella wrote that a syrup was produced by boiling unfermented grape juice in order to concentrate its natural sugars. If the juice was reduced to one third of its original volume, it was called sapa.\n\nAs the juice was boiled in kettles made of lead alloys, this harmful element seeped into the syrup. By reacting with the acetate ions in the grape juice , lead(II) acetate was produced, a highly toxic chemical compound. In fact, sapa, or ‘sugar of lead’, contained lead levels 200 times higher than today’s acceptable level.\n\nThe Romans added a toxic sweetener to their wine called sapa. ( Paolo Gallo / Adobe Stock)\n\nThe ancient Romans used sapa as a form of artificial sweetener, especially in wines. They eventually found a way to turn sugar of lead into crystal form. This meant that the toxic substance could be produced in the way table salt or sugar is produced today. As a consequence of this innovation, the consumption of sugar of lead became even more widespread, and started to be used in cooking as well. In the 4th century Roman recipe book of Apicius, almost a fifth of the recipes were made with sugar of lead in its syrup form.\n\nThe writings of some ancient Roman authors indicate that the Romans were aware of the dangers of lead consumption; but by then, the damage had already been done. Side effects included dementia, infertility, cognitive difficulties, fatigue, gout and eventually organs shutting down.\n\nSugar of lead wasn't the only source of lead poisoning in ancient Rome. Romans also drank water transported through lead pipes , making the water hazardous for their health. Research in 2019 suggested that more than half the population in Roman-era London was dealing with health issues caused by lead poisoning.\n\nRead more: Savoring the Danger: Romans Loved Toxic 'Sugar of Lead' Wine", "opengraph": {"type": "article", "url": "https://www.ancient-origins.net/weird-facts/sugar-lead-0017194", "title": "Romans Added Lead Sweetener to Their Wine and it Killed Them", "description": "How far did ancient people go to enhance the flavor of their food and drinks? Would they consume toxic substances if it made things a little more appetizing?", "image": "https://www.ancient-origins.net/sites/default/files/field/image/sugar-of-lead.jpg", "image:secure_url": "https://www.ancient-origins.net/sites/default/files/field/image/sugar-of-lead.jpg", "image:type": "image/jpeg", "article:published_time": "2022-08-27T22:58:17+01:00", "article:modified_time": "2022-08-27T22:58:17+01:00", "site_name": "Ancient Origins Reconstructing the story of humanity's past"}, "tags": ["Read more about Opulent Roman Winery With Fountains of Grape Juice Uncovered", "Read more about Lost Roman Fortlet Rediscovered Near Scotland’s Clydebank", "Read more about Stunning Roman Villas Unearthed in Underwater Ruins of Ancient Baiae", "Read more about The Gladiator Emperor: Commodus and the Bloodlust of Ancient Rome (Video)", "Read more about Walking in the Footsteps of Ancient Romans: A Tour of Rome's Streets and Buildings (Video)", "Read more about 5 Heartbreaking Roman Myths That’ll Captivate You"], "tweets": [], "movies": [], "links": ["https://www.ancient-origins.net/news-history-archaeology/destruction-pompeii-date-0010858", "https://www.ancient-origins.net/history/herodotus-cato-censor-and-josephus-understanding-life-and-times-historians-ancient-world-021032", "https://www.ancient-origins.net/news-history-archaeology/we-brewed-ancient-graeco-roman-beer-and-here-s-how-it-tastes-009955", "https://www.ancient-origins.net/news-history-archaeology/boutique-wine-byzantines-1600-year-old-wine-press-discovered-negev-desert-021530", "https://stock.adobe.com/uk/contributor/201507526/paolo-gallo?load_type=author&prev_url=detail", "https://www.ancient-origins.net/history-important-events/roman-empire-0013085", "https://www.ancient-origins.net/history/history-sugar-food-nobody-needs-everyone-craves-004406", "https://www.ancient-origins.net/history-ancient-traditions/commandaria-0011615", "https://www.ancient-origins.net/history-ancient-traditions/salt-trade-0011802", "https://www.ancient-origins.net/history-famous-people/marcus-gavius-apicius-top-gourmand-roman-world-004712", "https://www.ancient-origins.net/news-history-archaeology/poisonings-went-hand-hand-drinking-water-ancient-pompeii-008626", "https://www.ancient-origins.net/history-ancient-traditions/savoring-danger-sugar-lead-was-used-flavor-roman-food-and-wine-toxic-021771", "https://www.ancient-origins.net/history-ancient-traditions/savoring-danger-sugar-lead-was-used-flavor-roman-food-and-wine-toxic-021771", "https://stock.adobe.com/uk/contributor/201564435/rudall30?load_type=author&prev_url=detail"], "authors": [], "publish_date": "2022-08-27T22:58:17+01:00"}