{"result_id": "029020", "URL": "https://www.ancient-origins.net/science-space", "timestamp": "2023-04-25 12:04:21 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "Science & Space, ancient, archaeology, artifacts, myths, legends, history, ancient places", "favicon": "https://www.ancient-origins.net/apple-touch-icon-192x192.png", "canonical": "https://www.ancient-origins.net/science-space", "encoding": "utf-8"}, "image": null, "domain": "www.ancient-origins.net", "title": "Science & Space | Ancient Origins", "cleaned_text": "So where exactly did the building blocks for life (DNA and its chemical precursors) come from? This is a question that has both puzzled and fascinated scientists for decades, and a couple of possible...", "opengraph": {"site_name": "Ancient Origins Reconstructing the story of humanity's past"}, "tags": ["Read more about 830-Million-Year-Old Microorganisms May Help in the Search for Life on Mars", "Read more about Ancient Remedy of the Boswellia Tree - Still Great for Joint Health!", "Read more about 3,500-Year-Old Mummified Bear Found in Siberian Permafrost", "Read more about Pompeii Ruins Now To Be Protected by Robotic Guard Dog", "Read more about Glacial Melt On Tibetan Plateau Could Be Source of New Pandemics", "Read more about New Study Proves ALL the Building Blocks of Life Found in Meteorites!", "Read more about Scientists Create Potentially Deadly Prehistoric “Mammoth Meatball”", "Read more about What Could Go Wrong?! 48,500-Year-Old Siberian Virus is Revived", "Read more about Space Company Tests Giant Satellite-Launching “Slingshot”", "Read more about Can Artificial Intelligence Unlock Secrets of the Ancients?", "Read more about Is Bacteria Hiding on Mars? Indestructible Microbe “Conan the Bacterium” Suggests There Is", "Read more about Senator Warren’s Mishap Proves the Importance of Reliable Genetic Ancestry Tests", "Read more about Conclusions About Ancient Populations May be Drastically Wrong Due to Dodgy Method", "Read more about Are You Related To An Ancient VIP?", "Read more about Ancient Medicinal Mint Has Untapped Potential, New Research Reveals", "Read more about Ancient Maggot and Leech Therapy Sees Revival to Fight Antibiotic Resistance"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}