{"result_id": "029037", "URL": "https://www.ancient-origins.net/evolution-human-origins", "timestamp": "2023-04-25 12:04:45 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "Evolution & Human Origins, ancient, archaeology, artifacts, myths, legends, history, ancient places", "favicon": "https://www.ancient-origins.net/apple-touch-icon-192x192.png", "canonical": "https://www.ancient-origins.net/evolution-human-origins", "encoding": "utf-8"}, "image": null, "domain": "www.ancient-origins.net", "title": "Evolution & Human Origins | Ancient Origins", "cleaned_text": "The Americas were settled by people who migrated across the Bering Sea land bridge that connected Siberia (North Asia) and North America during the last Ice Age, between 30,000 and 12,000 years ago...", "opengraph": {"site_name": "Ancient Origins Reconstructing the story of humanity's past"}, "tags": ["Read more about Ancient DNA Analysis Reconstructs Legacy of the Biblical Levites", "Read more about Results of Kenyan Dig Suggest Africa’s First Toolmakers Were Not Human", "Read more about Digital Scientists Resurrect A 30,000-Year-Old Egyptian Man", "Read more about Israeli Researchers Say Human Cooperation Sparked Neolithic Revolution", "Read more about Massive Penguins the Size of Gorillas Once Waddled Around New Zealand", "Read more about Virtual Reality Tracks 75,000-Year-Old Footsteps of Sahul Explorers", "Read more about East-West Migration to Siberia Found in 7,500-Year-Old DNA", "Read more about Neanderthals Filled This Spanish Cave with Animal Skulls. But Why?", "Read more about Ancient DNA is Restoring the Origin Story of the Swahili People of the East African Coast", "Read more about Study Upends European Narrative of Horse Domestication in the USA", "Read more about 11,000-Year-Old Human Remains Found in British Cave", "Read more about Ancient DNA Reveals Contrasting Fates of Hunter-Gatherer Groups in Europe", "Read more about Proof Emerges that Neanderthals Harvested and Ate Crabs 90,000 Years Ago", "Read more about Giant Elephant Hunt Reveals Emerging Neanderthal Society", "Read more about Neolithic Solutions to Lactose Intolerance Revealed in New Study", "Read more about Is Archaeology Getting it Wrong? ‘Ancient Stone Tools’ Accidentally Made by Modern Monkeys"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}