{"result_id": "029016", "URL": "https://www.ancient-origins.net/news-history-archaeology/viruses-sleeping-mummies-could-ancient-corpses-lead-modern-epidemics-009234", "timestamp": "2023-04-25 12:04:16 CEST+0200", "meta": {"description": "Mummies fascinate historians, archaeologists, and anyone with antiquarian leanings. Mummies allow scientists to learn more about the diets, clothing, appearance, genetics, and general lifestyle of ancient populations than would be otherwise possible. The process of mummification, however, may preserve more than just the flesh and clothing of ancient pharaohs and desert nomads.", "lang": "en", "keywords": "mummy, Mummified, corpse, virus, disease, smallpox, Rameses, epidemic, frozen, permafrost, thaw, global warming", "favicon": "https://www.ancient-origins.net/apple-touch-icon-192x192.png", "canonical": "https://www.ancient-origins.net/news-history-archaeology/viruses-sleeping-mummies-could-ancient-corpses-lead-modern-epidemics-009234", "encoding": "utf-8"}, "image": null, "domain": "www.ancient-origins.net", "title": "Viruses Sleeping in Mummies—Could Ancient Corpses Lead to Modern Epidemics?", "cleaned_text": "Mummies fascinate historians, archaeologists, and anyone with antiquarian leanings. Mummies allow scientists to learn more about the diets, clothing, appearance, genetics, and general lifestyle of ancient populations than would be otherwise possible. The process of mummification, however, may preserve more than just the flesh and clothing of ancient pharaohs and desert nomads. Forensic scientists have discovered that ancient viruses and possibly other potential pathogens can remain dormant within the bodies of mummies. This leads to the question of whether investigation of mummies could accidentally bring back long dead diseases like smallpox. Studies of pathology in mummies show that this is a plausible scenario, especially for mummies from cold climates.\n\nA virus that is often a subject of discussion within this topic is smallpox. Smallpox is a deadly disease that kills about a third of those who contract it. By 1977, aggressive vaccination campaigns carried out by doctors and other health professionals were successful in completely eradicating the disease except for a couple of virus specimens that remain in vials in heavily guarded laboratories around the world.\n\nWatercolor illustration from a Japanese work on smallpox entitled Toshin seiyo [The essentials of smallpox]. ( CC BY 4.0 )\n\nRemnants of the virus, however, have been found in other places. The scab that forms from smallpox can encase specimens of the virus allowing them to be preserved over long periods of time, even thousands of years. If the body of the person who contracted smallpox is mummified, these scabs could contain remnants of the virus. Degraded forms of the virus have been discovered in a 3,200-year-old Egyptian mummy who appears to have died of smallpox and the mummy of an African-American woman from the mid-19th century. Although remnants of the virus have been found in Egyptian and other mummies, viruses that pose a threat have so far not been found. In every case, the virus is too degraded to be viable.\n• Victims of End of the World Epidemic Unearthed in Egypt\n• The Fall of Tenochtitlan - Truly the End of the Aztec Empire?\n\nHead of mummy of pharaoh Rameses V shows bumps suggesting he died of smallpox. ( Public Domain )\n\nA Russian research group studied a series of Siberian ice mummies to see if they could find preserved viruses. In all cases, they did not find any specimens. Non-scientists might be puzzled, perhaps a bit disturbed, that scientists would be dismayed that the active version of a deadly virus has so far not been found. Although it would be a serious biohazard if a dormant variola (smallpox) virus were to be revived and begin infecting human hosts, it is also good to have intact samples of the virus to learn how to develop vaccines to fight it in case it was ever revived.\n\nAlthough this search for viruses preserved in mummies has so far been unsuccessful, it has been suggested by medical researchers that mummies in cold climates might pose a greater threat for being the source of viruses than mummies found in hot, dry climates.\n\nOver the years, scientists have found several examples where dormant viruses trapped in ice or permafrost were revived once the ice or permafrost melted. One example of this is a strain of giant viruses found in Siberian permafrost. Luckily, these viruses only infect amoeba, not humans or animals, but some health professionals are concerned that ancient human pathogens may be preserved in permafrost or ice which could lead to future health issues as permafrost regions continue to melt around the globe.\n• Ancient virus recovered from permafrost has genes not found on Earth\n• Cuauhtémoc, The Last Aztec Emperor to Fight Against the Spanish\n\nCaribou Antlers and Skull in Gates of the Arctic National Park. ( Public Domain )\n\nIf dormant viruses are entombed in ice and permafrost, it is reasonable to suggest that they could be lurking in frozen mummies found in Siberia and other frigid regions. The potential health threat posed by viruses preserved in mummies, however, probably depends on the age of the mummy.\n\nPrehistoric mummies, for example, are unlikely to be a source of epidemic-causing pathogens such as influenza or smallpox. This is because epidemic diseases did not become common in humans until the establishment of large population centers such as villages, towns, and cities. The earliest recorded case of a smallpox epidemic occurred in Egypt around 1600 BC, a rather late date compared to other diseases. The reason for this is that epidemic pathogens require large numbers of potential hosts to be successful in spreading. If the number of hosts is very small, a virus or bacterium that kills off its hosts too rapidly will quickly find itself extinct.\n\nThe rise of agriculture and urban settlements allowed for thousands, even millions, of potential hosts to gather in the same place, meaning that a virus which easily spreads and quickly kills its hosts can survive for a long time since there are plenty of hosts to which it can spread once the current host is dead. For this reason, such diseases are unlikely to be found in mummies pre-dating the rise of agriculture or large permanent settlements. A Neanderthal virus, for example, would probably involve either a long, slow progression of the disease, as in the case of leprosy or yaws, or it would be nonlethal, as in the case of the common cold.\n• CT Scans of Mummy of an Ancient Priest Reveal He Was Stricken with Modern Diseases\n\nMummies that originated from dense population centers that formed in the last 10,000 years, on the other hand, are more likely to contain pathogens that cause epidemics and even pandemics. No viable viruses have been found in mummies that could pose a hazard to humans, though archaeologists have suggested that excavators take caution when handling a mummy in case such an event does occur.\n\nSo, it is unlikely that a disease will be revived from a mummy and cause an epidemic, but if such an event does occur, it will most likely involve a body mummified in a cold, dry climate. Furthermore, it will most likely be from a mummy that formed within the last 10,000 years when large population centers emerged.", "opengraph": {"type": "article", "url": "https://www.ancient-origins.net/news-history-archaeology/viruses-sleeping-mummies-could-ancient-corpses-lead-modern-epidemics-009234", "title": "Viruses Sleeping in Mummies—Could Ancient Corpses Lead to Modern Epidemics?", "description": "Mummies fascinate historians, archaeologists, and anyone with antiquarian leanings. Mummies allow scientists to learn more about the diets, clothing, appearance, genetics, and general lifestyle of ancient populations than would be otherwise possible. The process of mummification, however, may preserve more than just the flesh and clothing of ancient pharaohs and desert nomads.", "image": "https://www.ancient-origins.net/sites/default/files/field/image/Viruses-Sleeping-in-Mummies.jpg", "image:secure_url": "https://www.ancient-origins.net/sites/default/files/field/image/Viruses-Sleeping-in-Mummies.jpg", "image:type": "image/jpeg", "article:published_time": "2017-12-05T18:55:29+00:00", "article:modified_time": "2017-12-05T18:56:57+00:00", "site_name": "Ancient Origins Reconstructing the story of humanity's past"}, "tags": ["Read more about Mermaid Mummy at Japan Temple Exposed as Gruesome Man-Made Hoax", "Read more about Psusennes: The Silver Pharaoh with Treasures to Rival Tutankhamun's", "Read more about 5 Discoveries That Changed Our Understanding of Egyptian Mummification", "Read more about Boris Johnson’s Mummified Ancestor Died from Pathogen, Not the STD Syphilis", "Read more about Mummy Labels Unlock Climate Secrets of Ancient Mediterranean", "Read more about Man in Peru Caught Out Drinking With an 800-year-old Mummy!"], "tweets": [], "movies": [], "links": ["https://commons.wikimedia.org/wiki/File%3ASmallpox_illustration%2C_Japanese_manuscript%2C_c._1720_Wellcome_L0074745.jpg", "https://www.ancient-origins.net/news-general/victims-end-world-epidemic-unearthed-egypt-001770", "https://www.ancient-origins.net/history-important-events/fall-tenochtitlan-truly-end-aztec-empire-005942", "https://en.wikipedia.org/wiki/Ramesses_V", "https://commons.wikimedia.org/wiki/File%3ARamses_V_mummy_head.png", "https://www.ancient-origins.net/news-evolution-human-origins/ancient-virus-recovered-permafrost-has-genes-not-found-earth-001420", "https://www.ancient-origins.net/history-famous-people/cuauht-moc-last-aztec-emperor-fight-against-spanish-005435", "https://www.goodfreephotos.com/united-states/alaska/gates-of-arctic-national-park/caribou-antlers-and-skull-gates-of-arctic-national-park.jpg.php", "https://www.ancient-origins.net/news-history-archaeology/scientists-dissect-mysterious-medieval-child-mummy-siberia-006286", "https://www.ancient-origins.net/news-history-archaeology/ct-scans-mummy-ancient-priest-reveal-he-was-stricken-modern-diseases-006359", "http://siberiantimes.com/home/", "https://www.ancient-origins.net/users/caleb-strom"], "authors": [], "publish_date": "2017-12-05T18:55:29+00:00"}