{"result_id": "029001", "URL": "https://www.ancient-origins.net/mysterious-phenomena", "timestamp": "2023-04-25 12:03:57 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "Mysterious Phenomena, ancient, archaeology, artifacts, myths, legends, history, ancient places", "favicon": "https://www.ancient-origins.net/apple-touch-icon-192x192.png", "canonical": "https://www.ancient-origins.net/mysterious-phenomena", "encoding": "utf-8"}, "image": null, "domain": "www.ancient-origins.net", "title": "Mysterious Phenomena | Ancient Origins", "cleaned_text": "A secret journal offers new clues about the nature of the alleged 1947 AD UFO crash at Roswell in the New Mexico desert, or does it? Before we kick off, this isn’t one of these Reddit stories that...", "opengraph": {"site_name": "Ancient Origins Reconstructing the story of humanity's past"}, "tags": ["Read more about NFT Image from 1947 Alien Autopsy Film For Sale for $1 Million", "Read more about Bigfoot: Giant Hoax or Giant Hominid?", "Read more about ‘Clearest Photo Ever’ of a Huge UFO, Advanced Military Tech, Or Just A Rock In Water?", "Read more about Mummified “Mermaid” is CT Scanned by Japanese Scientists", "Read more about Mermaid Mummy at Japan Temple Exposed as Gruesome Man-Made Hoax", "Read more about Giant Sinkhole Is Growing In Chile’s Atacama Desert", "Read more about UFO Author Will Lead Exploration of Rendlesham Forest Encounters Site", "Read more about 12,000-Year-Old Lost City Off New Orleans Coast or Imagination Gone Wild?", "Read more about Are Mermaid Myths Inspired by a Rare Medical Condition?", "Read more about A Secret Roswell Journal Becomes The Focus Of A New UFO Documentary", "Read more about The Natural Mummies of San Bernardo: Created by Earth, Gas or Fruit?", "Read more about Demonic Possession and the Ancient Practice of Exorcism on the Rise?", "Read more about Mysterious Tjipetir Blocks Are Appearing on European Beaches", "Read more about Roaring Yowie Apeman Reported by Australian Work Crew", "Read more about Japan’s Killing Stone Has Cracked, Sparking Widespread Fear", "Read more about Medieval Sea Monster Was Likely a Whale, New Research Reveals"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}