{"result_id": "029028", "URL": "https://www.ancient-origins.net/news-science-space/mint-0017849", "timestamp": "2023-04-25 12:04:33 CEST+0200", "meta": {"description": "How many uses can you think of for mint? For centuries, the mint family has provided food, medicine, and more. New DNA analysis is revealing further untapped potential.", "lang": "en", "keywords": "Medicine, herbs, mint, cosmetics, food", "favicon": "https://www.ancient-origins.net/apple-touch-icon-192x192.png", "canonical": "https://www.ancient-origins.net/news-science-space/mint-0017849", "encoding": "utf-8"}, "image": null, "domain": "www.ancient-origins.net", "title": "Ancient Medicinal Mint Has Untapped Potential, New Research Reveals", "cleaned_text": "Researchers from Michigan State University recently completed a comprehensive study of the genomes of several species of mint plants , to trace their evolutionary pathways at the chemical level. These scientists hope their work will have many practical applications, providing useful information to researchers looking to develop medicines, antimicrobials, and organic pesticides from mint.\n\nThe mint family of herbs includes sage, rosemary, basil, thyme, lavender, catnip, oregano, peppermint, and dozens of other plants that can stimulate the human senses of taste and smell. Mints have traditionally been used as flavorings for foods and drinks, to make scents for perfume, for oral hygiene, and as herbal medicines.\n• Ancient Herbal Medicine and What to Use At Home to Stay Healthy Today!\n\nMembers of the mint family have been used in numerous ways, from food to hygiene to medicine. ( Yanadjan / Adobe Stock)\n\nAs Michigan State researchers explain in an article just published in the journal Nature Communications , they were interested in looking more closely at the DNA of various mint plants to see how they developed and diversified. This process of diversification has produced an immense variety of species with their own distinct characteristics.\n\nAs it turns out, it is the mint plant’s need to defend itself that drove it to evolve in so many different directions.\n\nIn many green plants, it is a type of metabolite known as terpenoids that help prevent them from being eaten by voracious predators. Terpenoids are present in all plants, and are responsible for plant coloring and aroma. They also give plants a unique taste when they’re eaten.\n\nWhile the odors they emit and the tastes they create can be attractive to humans or pollinating insects, the chemicals in the terpenoids are often repellent or toxic to insects, fungi, bacterial parasites, and animals that would consume or infect the plants that produce them. Terpenoids developed their protective capacities over millions of years through evolution, and the members of the mint family can all make unique terpenoids that protect them against the enemies in their ecosystems.\n\nBecause of their specialized chemical profiles, terpenoid metabolites can be used as food or cosmetic additives, as healing compounds, dental protectors, pesticides, or antimicrobial agents that shield crops from predator destruction. Scientists study the DNA of plants to learn more about the specific qualities of their terpenoids, and the Michigan State researchers involved in the new study were seeking to unlock the secrets of mint’s DNA, which is believed to have enormous untapped potential to produce many substances that would be beneficial to humans.\n• Could ancient textbooks be the source of the next medical breakthrough?\n\nNew research on the mint family’s terpenoids yielded exciting new potential uses for mint. ( adidas4747 / Adobe Stock)\n\nUncovering the Beautiful Secrets of the Beautyberry Plant\n\nFor the past several years, Björn Hamberger and Robin Buell, a former MSU genetic researcher who is now at the University of Georgia, have been working to sequence the DNA of multiple species of mint plants. With support from other MSU researchers and graduate students, the scientists were able to track the evolution of mint plant genomes over an incredibly long period of time (60—70 million years).\n\nTwo graduate students, Abigail Bryson and Emily Lanier, were able to identify the genes in mint plants that were responsible for the biosynthesis (creation) of terpenoids. While studying the genome of a type of mint known as a beautyberry, the two researchers found it contained a large gene cluster known as the BGC group. This distinctive set of genes has been observed in bacteria many times, but its role in the plant world is not well understood.\n\nLooking more closely, Bryson and Lanier found different versions of the BGC group in six other species of mint, all of which had a special place in the genome.\n\nThrough further study, the researchers discovered that the BGC cluster in the beautyberry plant is involved in the creation of two different kinds of terpenoids. They found dense accumulations of these terpenoids in various parts of the plant, including the leaves and roots, which are vulnerable to attack by pests and predators.\n\nWith the ability to adapt to living in all types of ecosystems, mint plants can diversify into a broad range of species, many of which will look, smell, and taste quite different from their cousins.\n\nThe aptly-named beautyberry is a member of the mint family, which recently was the source of an insight on the metabolic pathways of the mint family. (Ken Mattison / CC BY NC ND 2.0 )\n\nThe Uses for Mint through the Ages\n\nMint plants are currently being used to treat certain types of medical conditions. To give a couple of examples, Indian Coleus is often applied as a treatment for glaucoma, while Texas sage has antimicrobial properties that have made it useful as a remedy for tuberculosis.\n\nBut modern researchers didn’t just suddenly discover the health-protecting capacities of mint.\n\nThe plant was referenced 3,500 years ago in an ancient Egyptian medical text known as the Ebers Papyrus , which prescribed it as a cure for bloating and flatulence. More than a thousand years later, physicians in Greece, including the famous Galen, were recommending mint plants as a safe and effective form of oral contraception for women. Mint has been used in traditional Chinese medicine for more than 2,000 years, and in fact, a 2019 research project successfully sequenced the DNA of a type of medicinal mint known as Chinese Skullcap , which researchers believe could allow the plant’s chemicals to be used to develop many new therapeutic applications.\n\nChinese skullcap, pictured, has been used in traditional Chinese medicine for thousands of years. (Agnieszka Kwiecień, Nova / CC BY SA 4.0 )\n\nIn medieval Europe, mint was widely celebrated for its healing properties. A 17th century text written by Nicholas Culpepper, an English astrologer and apothecary (or pharmacist in today’s terminology) claimed mint could be used to treat more than 40 ailments!\n\nIn the present day, the new information Michigan State University researchers have discovered about terpenoid chemistry could help them develop brand-new products derived from mint plants.\n\nTop image: Beautyberries (left) have revealed insights about mint family composition. Source: Left: Tom Cardrick / Adobe Stock; Right: Public Domain", "opengraph": {"type": "article", "url": "https://www.ancient-origins.net/news-science-space/mint-0017849", "title": "Ancient Medicinal Mint Has Untapped Potential, New Research Reveals", "description": "Researchers from Michigan State University recently completed a comprehensive study of the genomes of several species of mint plants, to trace their evolutionary pathways at the chemical level.", "image": "https://www.ancient-origins.net/sites/default/files/field/image/mint.jpg", "image:secure_url": "https://www.ancient-origins.net/sites/default/files/field/image/mint.jpg", "image:type": "image/jpeg", "article:published_time": "2023-01-26T13:54:25+00:00", "article:modified_time": "2023-01-26T13:54:25+00:00", "site_name": "Ancient Origins Reconstructing the story of humanity's past"}, "tags": ["Read more about High Status Brothers Had Access to Cranial Surgery in Bronze Age Israel", "Read more about Ancient Maggot and Leech Therapy Sees Revival to Fight Antibiotic Resistance", "Read more about Medicinal Microbes of Our Ancestors: Tracing the History of Probiotics", "Read more about Extracted from Andean Coca, Freud Promoted Cocaine as a Miracle Drug", "Read more about Marijuana for All that Ails You: Cannabis in the Ancient World", "Read more about Murderous Medicine: Six Strange and Horrifying Ancient Medical Treatments"], "tweets": [], "movies": [], "links": ["https://daily.jstor.org/plant-of-the-month-mint/", "https://www.ancient-origins.net/news-history-archaeology/medicinal-mint-0011806", "https://www.ancient-origins.net/history-ancient-traditions/herbal-medicine-0014447", "https://stock.adobe.com/uk/images/tinctures-extracts-oils-and-dietary-supplements-from-medicinal-herbs-selective-focus/514925434?asset_id=514925434", "https://www.nature.com/articles/s41467-023-35845-1", "https://msutoday.msu.edu/news/2023/msu-researchers-uncover-new-potential-for-ancient-mint-plants#:~:text=MSU%20researchers%20have%20traced%20the,senses%20of%20smell%20and%20taste.", "https://www.ancient-origins.net/history/ancient-plant-immortality-treats-over-50-medical-conditions-007505", "https://www.ancient-origins.net/artifacts-ancient-technology/etruscan-bee-boats-0014576", "https://www.ancient-origins.net/artifacts-ancient-writings/could-ancient-textbooks-be-source-next-medical-breakthrough-004108", "https://www.ancient-origins.net/news-science-space/ancient-chinese-remedy-could-wipe-out-tuberculosis-007275", "https://stock.adobe.com/uk/images/image-of-mint-leaves-after-rain-background/515268009?prev_url=detail", "https://www.ancient-origins.net/history-ancient-traditions/modern-science-confirms-ancient-chinese-remedy-provides-effective-non-021495", "https://www.flickr.com/photos/69421573@N08/51584874154/", "https://www.ancient-origins.net/history-ancient-traditions/versatile-plant-what-were-many-uses-cannabis-ancient-egypt-007733", "https://www.ancient-origins.net/news-science-space/ancient-chinese-remedy-could-wipe-out-tuberculosis-007275", "https://www.ancient-origins.net/artifacts-ancient-writings/ebers-papyrus-0012333", "https://www.ancient-origins.net/history-famous-people/roland-farter-0017774", "https://www.ancient-origins.net/history-famous-people/galen-famous-medical-researcher-classical-antiquity-005459", "https://www.ancient-origins.net/history-ancient-traditions/ancient-methods-contraception-even-tutankhamun-wore-protection-009205", "https://www.ancient-origins.net/myths-legends-americas/unearthing-unexpected-fossil-usage-ancient-medicine-part-2-dragon-pills-gods-021481", "https://www.ancient-origins.net/news-history-archaeology/medicinal-mint-0011806", "https://commons.wikimedia.org/wiki/File:Scutellaria_baicalensis_Tarczyca_bajkalska_2020-08-07_03.jpg", "https://phys.org/tags/family/", "https://stock.adobe.com/uk/images/callicarpa-bodinieri-profusion-berries-in-autumn/457933357", "https://www.pexels.com/photo/lush-green-leaves-of-mint-plants-14931253/", "https://www.nature.com/articles/s41467-023-35845-1", "https://msutoday.msu.edu/news/2023/msu-researchers-uncover-new-potential-for-ancient-mint-plants", "https://daily.jstor.org/plant-of-the-month-mint/"], "authors": [], "publish_date": "2023-01-26T13:54:25+00:00"}