{"result_id": "029038", "URL": "https://www.ancient-origins.net/2016-tour-terms-conditions-005202", "timestamp": "2023-04-25 12:04:46 CEST+0200", "meta": {"description": "Download the PDF of the termsServicesIncluded:All transfers from/to the hotel, bus, train, boat, airportAccommodation in a double room, hotel category:***Meals as indicatedWelcome snack after hotel check in on Arrival dayLunch on day 04 and Lunch box on day 15 of Main tourLunch on day 02 of Pre-tour, ParacasLunch on day 02 and 04 on Post-tour, BoliviaExperienced Tour guide (Archaeologist - talking English/Spanish),who will accompany you to Juliaca -Translation into German if needed by Harald PetrulLocal Tour guide from Copacabana to La PazPrivate guidance in La Paz, Tiwanaku and Khonko WakaneA", "lang": "en", "keywords": "", "favicon": "https://www.ancient-origins.net/apple-touch-icon-192x192.png", "canonical": "https://www.ancient-origins.net/2016-tour-terms-conditions-005202", "encoding": "utf-8"}, "image": null, "domain": "www.ancient-origins.net", "title": "2016 Tour - Terms & Conditions", "cleaned_text": "Download the PDF of the terms\n• Welcome snack after hotel check in on Arrival day\n• Lunch on day 04 and Lunch box on day 15 of Main tour\n• Lunch on day 02 and 04 on Post-tour, Bolivia\n• Experienced Tour guide (Archaeologist - talking English/Spanish),who will accompany you to Juliaca -Translation into German if needed by Harald Petrul\n• All excursions as indicated in the itinerary\n• All entrance fees to national parks, museums, Cusco Tourist Ticket, Valle Sagrado and other places of interest, as indicated in the itinerary\n• Private transport during the whole journey (Main tour)\n• Flight over the Nazca and Palpa Lines\n• Boat trip to the floating island of Uros, Lake Titicaca\n• Private guidance in the Historic Museum of Paracas, in the Museum Cabrera Ica, Museo Ritos Andinos in Andahuaylillas such as in the Museums of La Paz, Tiahuanaco, Puma Punku and Khonko Wakane\n• Attendance during the whole trip by Harald Petrul (Paititi Tours & Adventures) and John Syrgios (Ancient Origins)\n• Tours, viewings and visits of museums etc. which aren’t explicitly mentioned in the itinerary as included services\n• All meals and drinks (if not mentioned)\n• Visa fees (e.g. US $134 Visa fee for US-Citizens to enter Bolivia)\n\nDomestic flights (net price per Person in US$)\n\n* Air fares subject to change according to availability\n\nFor all reservations, we need the following information by June 30th, 2016:\n• Full name, date of birth, nationality, scan of passport sent by e-mail, evidence of travel insurance and visas\n• Arrival and departure details of your international flight into Lima\n• Two to four pairs of absorbable cotton socks\n• Two to four pairs of normal cotton socks\n• Three or four cotton shirts with long sleeves\n• A bottle or canteen for drinks during the excursions\n• Cash for drinks at the bar and other personal spending (souvenirs, post cards, etc.)\n\nA vaccination against yellow fever is mandatory for Bolivia.\n\nDuring this trip you will experience all climates and will move through heights from sea level up to more than 4,500 meters. Therefore, this tour can be classified as physically stressful and requires a good state of health and fitness.\n\nAltitude sickness can sometimes, but very rarely, appear. Thus we recommend undergoing a medical test in a medical practice to test your ability to manage high altitude before you make the trip.\n\nFor all preventative measures, please consult your doctor.\n\nThe indicated price of the trip does not include travel insurance. You must take out sufficient travel insurance that covers trip cancellation and interruption, missed flight connections, lost baggage, loss due to unforeseen circumstance, death, injury or illness, medical expenses, and emergency assistance.\n\nThe receipt of 20% deposit of the tour price (Main tour) and US$ 500 deposit for each extension (Pre-tour Nazca and Post-tour Bolivia) per person is required as soon as possible to secure your spot. The deposit is refundable as shown below under point 3.3) “Payments, Refunds & Insurance”. We will also need to deduct any payment charges for receiving and sending funds from your returned deposit.\n\n1) Your Eligibility:\n\nYou must be an individual, 21 years of age or older. If you are under 21, you may participate only with involvement of a parent or legal guardian.\n\nTour accommodations are carefully chosen to provide our participants with quality accommodation, hospitality, and service at reasonable cost. Breakfasts are included in the price of the tour; see tour itinerary for details. Tour prices are based on two people sharing a room with either double or twin beds. Every effort will be made to pair tour participants traveling by themselves with another member of the tour, if desired. A single room may be available at the stated single-supplement cost. Your accommodations, meals as described above, tour vehicle, boats, trains or airplanes, transportation fares, admission to museums and tour sites, all tour guide fees and applicable taxes are included in the price of the tour (see above under Services). Exclusions include: lunches and dinners (unless indicated in the itinerary), gratuities, airfare and incidental expenditures such as border/customs fees (see above under Services).\n\nPaititi Tours & Adventures reserves the right to alter any tour or to cancel any tour in which the minimum number of participants is not reached, or for any other reason. If the minimum is not reached, your payment or deposit will be fully refunded. However, flight tickets will not be. Therefore, you must not purchase flight tickets until confirmation of the tour is given. You must have trip cancellation insurance to cover refund of your airfare in such a case.\n\nOnce the deposit and booking form have been received you will receive an email confirming your place on the tour.\n\n3.1) All international transfer costs (Paypal, Credit card, Bank transfer, etc.) must be taken care of by the participant. These costs will be added on the final payment.\n\n3.2) Full payment should be received by June 30th 2016.\n\n3.3) We charge/refund as followed if you cancel for any reason:\n\n3.3.1 We charge 50% cancellation fee if you cancel up until 30 days prior tour starts (This does not include deposit).\n\n3.3.2 We cannot refund from 29 days before tour starts\n\n3.3.3 We can refund 50% of deposits until 61 days prior to tour starts\n\n3.3.4 We cannot refund deposits up to 60 days prior to tour starts\n\n3.3.5. We do not refund monies paid by guests should the tour be cancelled due to reasons of war, conflict, or natural disasters.\n\n3.4) We cannot be held responsible for any injury, accident or stolen goods and by signing this disclaimer it means you will only make claims through your own personal travel insurance – please get travel insurance and relevant visas before booking this tour and have a passport with at least 6 months past the end date of the tour.\n\n3.5) Each group or individual is responsible for all insurances and their own international travel arrangements. For unforeseen circumstances, you must enroll in personal accident, baggage, and trip cancellation insurance policies. Baggage, as well as personal items, such as jackets, cameras, purses, etc. are the sole responsibility of the owner.\n\n3.6) Full payment and passport details must be received latest by June 30, 2016\n\nI am aware that this trip requires me to have an average level of fitness as walking, often up hills, and in some cases bending, are daily activities, and I hereby affirm that I accept the inherent risks involved in exploring sites of antiquity, and that I do not have any physical, emotional, or other disability that would create a hazard for myself, my guides, or other tour participants.\n\nPaititi Tours & Adventures and or its agents gives notice that all tickets, vouchers, or other issuance for conveyance or accommodation made by them, are made as agents for participants of Paititi Tours & Adventures upon the express condition that we are not liable for any accident, injury, damage, loss, delay, or irregularity which may be occasioned either by reason of defect in any vehicle, or through acts or default of any hotel personnel. Paititi Tours & Adventures or its agents accepts no responsibility for losses or incidental expenses due to delay or change in schedules, hotel booking irregularities, defaults, accidents, sickness, quarantine, emergency, weather, strikes, war, or other causes. All such losses are the sole responsibility of the participants. The right is reserved to not accept or retain as a participant any person whose acts or conduct are judged to be detrimental or in conflict with the safety, interest, comfort, harmony, or well-being of the group as a whole.\n\nI hereby agree to permit Paititi Tours & Adventures, its agents and other participants to take pictures and make video or film records without further approval or recourse, and I understand and agree that such photographs and recordings may be used for professional, commercial, and promotional purposes.\n\nAssumption of Risk and Release of Liability:\n\nIn consideration of, and in part payment for the right to participate in the trip and services, activities and food arranged on my behalf by Paititi Tours & Adventures, its agents and associates, I do hereby state that I fully assume all risks of illness, injury or death. I hereby release Paititi Tours & Adventures, its agents and associates and Ancient Origins from all claims and action for damages in connection with the trip for which I am issuing payment. I concur that the foregoing shall be binding on me personally as well as on my heirs. Payment, in the form of deposit, or payment, partial or full, shall constitute consent to all terms contained herein.\n• Execution depends on availability – Subject to modifications – Relevant is the travel confirmation\n• All payments and financial details will be arranged directly through Ancient Origins with either Harald Petrul of Paititi Tours and Adventures or John Syrigos of Ancient Origins ( ). No third party at any time will be involved with any financial matters or held responsible for any refunds.\n• This tour is organized and guided from Lima to Juliaca/La Paz by Harald Petrul of “Paititi Tours & Adventures” in cooperation with Dr John Syrigos of “Ancient Origins”. On selected sites we have guest speakers, including Fernando Elorrieta Salazar, Antonio Portugal Alvizuri, Renato Davila Riquelme, Thierry Jamin, Hilbert Sumrine Busticio, Ernesto Cabrera Claux, Dr. Jorge Miranda Luizaga , Manuel Fernando de la Torre Ugarte Bustos, Dieter Groben and a lecture with Dr. Professor Frederico Kauffmann Doig, the highly decorated “Father of Peruvian Archaeology”.", "opengraph": {"type": "article", "url": "https://www.ancient-origins.net/2016-tour-terms-conditions-005202", "title": "2016 Tour - Terms & Conditions", "description": "Download the PDF of the termsServicesIncluded:All transfers from/to the hotel, bus, train, boat, airportAccommodation in a double room, hotel category:***Meals as indicatedWelcome snack after hotel check in on Arrival dayLunch on day 04 and Lunch box on day 15 of Main tourLunch on day 02 of Pre-tour, ParacasLunch on day 02 and 04 on Post-tour, BoliviaExperienced Tour guide (Archaeologist - talking English/Spanish),who will accompany you to Juliaca -Translation into German if needed by Harald PetrulLocal Tour guide from Copacabana to La PazPrivate guidance in La Paz, Tiwanaku and Khonko WakaneA", "image:type": "image/jpeg", "site_name": "Ancient Origins Reconstructing the story of humanity's past"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.ancient-origins.net/sites/default/files/AOTour2016Terms.pdf", "/cdn-cgi/l/email-protection#3a4e554f48497a5b5459535f544e175548535d53544914545f4e"], "authors": [], "publish_date": null}