{"result_id": "029012", "URL": "https://www.ancient-origins.net/news-evolution-human-origins/natural-selection-theory-0016397", "timestamp": "2023-04-25 12:04:11 CEST+0200", "meta": {"description": "A new study has refuted Darwin by proving that natural selection theory is more about non-random environmental pressure than the influence of random accidents.", "lang": "en", "keywords": "natural selection, darwin, Mutations, Genetics, biology", "favicon": "https://www.ancient-origins.net/apple-touch-icon-192x192.png", "canonical": "https://www.ancient-origins.net/news-evolution-human-origins/natural-selection-theory-0016397", "encoding": "utf-8"}, "image": null, "domain": "www.ancient-origins.net", "title": "Darwin’s Natural Selection Theory May Not Be True, Gene Study Says", "cleaned_text": "Researchers from Ghana and the University of Haifa, Israel, have published a breakthrough study that questions randomness in Darwin’s natural selection theory, in the Genome Research journal which may revolutionize human evolutionary history. According to the researchers, mutations have been misattributed to randomness, and this has been the backbone of the theory of evolution, until now. Instead, the researchers have been able to provide evidence of non-random mutations by showing “a long-term direct mutational response to environmental pressure.”\n\nFor over 160 years, the scientific community has followed Darwin’s natural selection theory, which basically says nature selects for new mutations in a totally random way. But a new study shows that it may not be randomness at all but environmental pressures that cause mutations. ( David Carillet / Adobe Stock)\n\nThis is in direct contradiction to Darwin’s longstanding theory of natural selection, which argues that all genetic mutations are random and accidental, and attributes beneficial traits being passed on through generations of breeding. For long, this has been a key tenet of neo-Darwinism, but we can now safely postulate that one helpful genetic mutation was not random at all – the human haemoglobin S (Hbs) mutation that protects against malaria.\n• The Edge of Evolution: The Search for the Limits of Darwinism\n\nLead researcher Professor Adi Livnat, from the University of Haifa, Israel said:\n\nProfessor Livnat is referring to the unique approach adopted by his team, wherein, the HbS mutation was isolated to distinguish between random mutations, and natural selection. In the mix, non-random mutations were added to detect “de novo” mutations, which literally mean “out of the blue” mutations that are present in an offspring but not inherited from either parent, reported The Daily Mail .\n\nInterestingly, the HbS mutation was found to occur more frequently in populations where malaria is endemic, i.e., Africa, suggesting that certain mutations arise more frequently where they are of adaptive significance. The scientists behind the latest study hypothesize that evolution is influenced both by external information (natural selection), and internal information (generational genetic pools).\n\nFor over 160 years, based on Darwin’s natural selection theory, we have been taught that evolution through mutation is random and accidental, but the latest study shows that this isn’t true for malaria. ( Exposé GmbH / Adobe Stock)\n\nThis new thinking about natural selection has actually been around for a long time but the recent study proves it for the human hemoglobin malaria mutation.\n\nMany scientists have written that complex and impressive adaptations in the eyes, brain, or hands, cannot be just attributed to randomness. Neither can the entire natural selection process be explained by Lamarckism, which posits that all beneficial adaptations come from direct environmental pressure. When the out-of-the-blue mutation hypothesis is applied to HbS, it is seen to provide protection against malaria for people with one copy, but causes sickle cell anemia in those with two copies, reported Salon.\n\n\"This shows empirically for the first time a directional response of mutation to a specific long-term environmental pressure . This sort of result cannot be explained by Neo-Darwinism, which is limited to explaining minor, gross-level effects on average mutation rates, not responses of specific mutations to specific environmental pressures. Therefore, the implications are that here there is an empirical finding that Neo-Darwinism really cannot explain, which challenges the notion of random mutation on a fundamental level,” added Dr Livnat.\n\nDr Livnat, and his lab manager, Dr Daniel Melamed, applied the de novo emergence of the HbS mutation to its origins, showing that the malaria-protective mutation actually originates de novo more frequently in sub-Saharan Africans , a population subgroup that has been exposed to centuries of malarial selection pressure, compared to that of the Europeans. Clearly, a random mutation would have equally random chances of appearing in both populations, as per Darwinian postulation, but that is not what actually happened.\n• Cretan Footprints Challenge Darwin’s Out of Africa Theory, Says Study\n\n“Mutations defy traditional thinking. The results suggest that complex information that is accumulated in the genome through the generations impacts mutation, and therefore mutation-specific origination rates can respond in the long-term to specific environmental pressures. Mutations may be generated nonrandomly in evolution after all, but not in the way previously conceived. We must study the internal information and how it affects mutation, as it opens the door to evolution being a far bigger process than previously conceived,” Livnat concluded.\n\nPrevious studies using Lamarckism as a theoretical base looked for immediate mutational adaptations to environmental stressors. Other studies, which found Lamarckism too limited in its scope, used only Darwinian natural selection and looked for random internal genetic mutations.\n\nThe current study gives scientists motive to reconsider current practices “of measuring mutation rates as averages across a multitude of positions on the genome.” This also opens up the field to study mutations other than HbS to see if the story of human evolution is actually random or smart by design!\n\nTop image: This arc of five hominin skulls has been used for over 100 years to prove that natural selection theory is totally random and accidental, but a new study shows this to be false for a malaria mutation. Source: Smithsonian\n\nJP. 2022. Are genetic mutations random in humans? Israeli study says no . Available at: https://www.jpost.com/science/article-695101 Melamed, D., Nov, Y., et al. 2022. De novo mutation rates at the single-mutation resolution in a human HBB gene-region associated with adaptation and genetic disease. Genome Research. Available at: https://doi:10.1101/gr.276103.12 Morrison, R. 2022. Darwin was wrong! New study suggests for the first time that genetic mutations are NOT always random and may evolve to respond to environmental pressures . Available at: https://www.dailymail.co.uk/sciencetech/article-10465347/New-study-suggests-genetic-mutations-NOT-random.html Rozsa, M. 2022. Biologists surprised to discover that some \"random\" mutations may not be so random . Available at: https://www.salon.com/2022/02/05/biologists-surprised-to-discover-that-some-random-mutations-may-not-be-so-random/", "opengraph": {"type": "article", "url": "https://www.ancient-origins.net/news-evolution-human-origins/natural-selection-theory-0016397", "title": "Darwin’s Natural Selection Theory May Not Be True, Gene Study Says", "description": "Researchers from Ghana and the University of Haifa, Israel, have published a breakthrough study that questions randomness in Darwin’s natural selection theory, in the Genome Research journal", "image": "https://www.ancient-origins.net/sites/default/files/field/image/natural-selection-theory.jpg", "image:secure_url": "https://www.ancient-origins.net/sites/default/files/field/image/natural-selection-theory.jpg", "image:type": "image/jpeg", "article:published_time": "2022-02-09T14:00:27+00:00", "article:modified_time": "2022-08-26T18:04:09+01:00", "site_name": "Ancient Origins Reconstructing the story of humanity's past"}, "tags": ["Read more about Weekly Top Stories: A Quick Catch Up On What You Missed", "Read more about The First Teacher? Study Finds Teaching and Tools Evolved Together"], "tweets": [], "movies": [], "links": ["https://genome.cshlp.org/content/early/2022/01/14/gr.276103.121", "https://stock.adobe.com/uk/contributor/200388083/david-carillet?load_type=author&prev_url=detail", "https://www.ancient-origins.net/news-evolution-human-origins/human-mutation-slowdown-0011378", "https://www.ancient-origins.net/news-history-archaeology/researchers-find-evidence-deadly-malaria-imperial-rome-2000-years-ago-021101", "https://www.ancient-origins.net/news-general/charles-darwin-0014839", "https://www.ancient-origins.net/book-reviews/edge-evolution-search-limits-darwinism-007483", "https://www.ancient-origins.net/news-history-archaeology/crusader-sword-0015963", "https://www.ancient-origins.net/news-evolution-human-origins/intelligence-evolution-0012775", "https://www.dailymail.co.uk/sciencetech/article-10465347/New-study-suggests-genetic-mutations-NOT-random.html", "https://stock.adobe.com/uk/contributor/208428408/expose-gmbh?load_type=author&prev_url=detail", "https://www.ancient-origins.net/news-evolution-human-origins/new-studies-clash-previous-analyses-life-and-fate-neanderthals-008567", "https://www.salon.com/2022/02/05/biologists-surprised-to-discover-that-some-random-mutations-may-not-be-so-random/", "https://www.ancient-origins.net/news-evolution-human-origins/ancient-ecosystems-0012700", "https://www.ancient-origins.net/news-history-archaeology/sub-saharan-food-production-0013859", "https://www.ancient-origins.net/book-reviews/shattering-myths-darwinism-007406", "https://www.ancient-origins.net/news-evolution-human-origins/crete-footprints-0015962", "https://www.si.edu/newsdesk/photos/human-origins-traveling-exhibition-skull-casts", "https://www.jpost.com/science/article-695101", "https://doi:10.1101/gr.276103.12", "https://www.dailymail.co.uk/sciencetech/article-10465347/New-study-suggests-genetic-mutations-NOT-random.html", "https://www.salon.com/2022/02/05/biologists-surprised-to-discover-that-some-random-mutations-may-not-be-so-random/"], "authors": [], "publish_date": "2022-02-09T14:00:27+00:00"}