{"result_id": "029047", "URL": "https://www.ancient-origins.net/taxonomy/term/1/%2C%20led%20by%20the%20Institut%20national%20de%20recherches%20archeologiques%20preventives%20%28INRAP%29%2C?page=89", "timestamp": "2023-04-25 12:05:00 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.ancient-origins.net/apple-touch-icon-192x192.png", "canonical": "https://www.ancient-origins.net/taxonomy/term/1/%2C%20led%20by%20the%20Institut%20national%20de%20recherches%20archeologiques%20preventives%20%28INRAP%29%2C", "encoding": "utf-8"}, "image": null, "domain": "www.ancient-origins.net", "title": "News (Page 90) | Ancient Origins", "cleaned_text": "The University of Oxford is so old that its existence predates the Aztec civilization by more than 200 years! Here are the facts: People were learning at the University of Oxford by 1096 and the...", "opengraph": {"site_name": "Ancient Origins Reconstructing the story of humanity's past"}, "tags": ["Read more about Man Angry at His Girlfriend Smashes Ancient Greek Artifacts Worth $5 Million!", "Read more about Roman Penis Pendant Found in Britain Declared a “National Treasure”", "Read more about The Mysterious House-Burning of the Forgotten Cucuteni-Trypillian Culture", "Read more about 4,000 Years Ago, Chinese Advances Were Fueled By Mass Beer Production!", "Read more about Blood, Emeralds, Snakes & Poop: Bizarre European Medieval Plague Cures", "Read more about Peter the Great Ordered a Beard Tax to Discourage Russian Facial Hair!", "Read more about Equivocal Pyramids All Over The World", "Read more about The Shocking Ancient Greek Origins of the Eugenics Movement", "Read more about Stonehenge’s Bluestone Tracks Discovered Beneath Roman Road", "Read more about Egyptian Olive Oil Production Method Recreated With Delicious Results!", "Read more about The Meaning of Animism: Philosophy, Religion and Being Alive", "Read more about The Cerne Giant and the Egyptian Osiris Hypothesis", "Read more about Ancient Origins Features in Box Office Hit Film Uncharted", "Read more about British Geologist Gets Ridiculous 15-year Prison Sentence in Iraq", "Read more about 1300-Year-Old Severed Head Sculpture Located in the ‘Lost City’ of Maya", "Read more about The University of Oxford is Older than the Aztec Civilization!"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}