{"result_id": "029021", "URL": "https://www.ancient-origins.net/history-ancient-traditions/marijuana-0017887", "timestamp": "2023-04-25 12:04:22 CEST+0200", "meta": {"description": "How did ancient civilizations use marijuana? For everything! Medicinal, spiritual, and recreational use of cannabis has been common across the world for millennia.", "lang": "en", "keywords": "Medicine, rituals, marijuana, cannabis, drugs", "favicon": "https://www.ancient-origins.net/apple-touch-icon-192x192.png", "canonical": "https://www.ancient-origins.net/history-ancient-traditions/marijuana-0017887", "encoding": "utf-8"}, "image": null, "domain": "www.ancient-origins.net", "title": "Marijuana for All that Ails You: Cannabis in the Ancient World", "cleaned_text": "Marijuana, also known as cannabis, has been used by humans for thousands of years for both medicinal and recreational purposes. Its versatility and effectiveness in treating a wide range of ailments have made it a valuable plant in many ancient civilizations. From its use as a pain-relieving anesthetic during surgical procedures in ancient China, to its medicinal properties for treating hemorrhoids, inflammation, and even glaucoma in ancient Egypt, and its spiritual significance in religious rituals in ancient India, we explore six amazing ways ancient civilizations used marijuana.\n\nThe ancient Chinese were known to have used marijuana as a form of anesthetic during surgical procedures. This incredible medicinal plant was first recorded in the Pen Ts'ao Ching, an ancient Chinese medical text written by the Emperor Shen Nung in 2737 BC. Not only did the text describe the use of marijuana as an anesthetic, but it also listed its medicinal properties, such as the ability to relieve pain, reduce inflammation, and promote the healing of wounds.\n\nBut the ancient Chinese didn't just rely on oral consumption of marijuana for surgical procedures. They also used it in the form of a topical ointment, applied directly to the skin before surgery. This method was believed to provide a more effective form of pain relief, as the active compounds in marijuana, such as THC and CBD, were able to penetrate the skin and reach the bloodstream more quickly. The anesthetic properties of marijuana were so highly valued that it was used in surgical procedures well into the 19th century before being replaced by more advanced forms of anesthetics, such as chloroform and ether.\n• A Versatile Plant: What Were the Many Uses of Cannabis in Ancient Egypt?\n\nMagu, the Hemp Maiden and Goddess of Longevity. This painting reflects her description in the Biographies of Deities and Immortals by Ge Hong (284-363) of the Jin dynasty. ( Public Domain )\n\nThere is evidence from ancient Egyptian texts and medical papyri that marijuana was used for medicinal purposes in ancient Egypt . One of the earliest known references to the medicinal use of marijuana can be found in the Ebers Papyrus , a medical text dating back to 1550 BC. The papyrus describes the use of marijuana for the treatment of hemorrhoids, inflammation, and glaucoma. Additionally, there have been archaeological findings of marijuana pollen in tombs of ancient Egyptians, which suggests that it may have been used in funerary rituals as well.\n\nTo treat hemorrhoids, the ancient Egyptians would mix the plant with other ingredients, such as honey and myrrh, to create a potent ointment that was applied directly to the affected area. The ancient Egyptians also used marijuana as a remedy for various eye conditions, including glaucoma, inflammation, and redness.\n• Drugs in Ancient Cultures: A History of Drug Use and Effects\n\nA figure of the goddess Seshat carved on the back of the throne of the seated statue of Rameses II. Above her head, there is what is argued to be a marijuana leaf. (Jon Bodsworth / Public Domain )\n\nAncient Indians have a long history of using marijuana in religious and spiritual rituals. They believed that the plant had the power to bring them closer to the divine, and it was often used in rituals to promote spiritual growth and understanding. The plant was considered sacred and was often used in offerings to the gods and in religious ceremonies.\n\nThe use of marijuana in ancient India was not just limited to spiritual practices; it was also used for medicinal and therapeutic purposes. The plant was believed to have healing properties and was used to treat a variety of ailments, such as pain, insomnia, and anxiety. The ancient Indian medical system, Ayurveda, also made use of marijuana as a part of its treatment regimen. The plant was used to balance the body's energies and promote overall health and well-being.\n\n4.Ancient Greece – Marijuana for Nosebleeds and More\n\nThe ancient Greeks were known for their extensive knowledge of medicine and their use of various herbs and plants for healing. One of these plants was marijuana, which they used to treat a variety of conditions, including nosebleeds. The anti-inflammatory properties of marijuana were believed to help reduce the inflammation in the nasal passages, while its astringent properties helped to constrict the blood vessels, thereby stopping the bleeding. The Greek physician, Galen wrote about the use of marijuana as a nasal decongestant and as a treatment for nosebleeds in his medical texts. He described how the dried leaves of the plant were crushed and mixed with other ingredients, such as frankincense and myrrh to create a poultice, which was then applied to the nostrils to stop the bleeding.\n\nThe use of marijuana as a treatment for nosebleeds was not limited to just the ancient Greeks. In fact, it was a common practice in ancient medicine and was also used by the Romans and other cultures. The effectiveness of this treatment was well-known, and it continued to be used for centuries before the advent of modern medicine.\n\nA funerary kantharos (Attica, circa 780 BC), a type of ancient Greek cup used for drinking. ( Public Domain )\n\nThe ancient Romans were known to have used marijuana for both medicinal and recreational purposes. According to historical texts, the Roman naturalist Pliny the Elder wrote about the use of marijuana as a pain reliever for earaches and gout in his book Natural History , written in the first century AD. The Romans also used marijuana as a sedative, mixing it with other herbs to create a calming and soothing effect.\n\nAdditionally, ancient Romans were known to have used marijuana for recreational purposes. The Roman poet, Ovid, in his work Tristia, wrote of a \"hempen wreath\" that was used to \"drive away care\" and bring on sleep. Moreover, archaeological evidence such as clay pipes and pottery depicting marijuana leaves have been found in ancient Roman settlements, further indicating its recreational use. It is believed that the marijuana plant was introduced to the Roman Empire by the conquering troops from Egypt, where it was used for medicinal purposes.\n\nCannabis sativa from the Vienna Dioscurides, 512 AD. The Vienna Dioscurides is an early 6th-century Byzantine Greek illuminated manuscript of an even earlier 1st century AD work, De materia medica by Pedanius Dioscorides. Both ancient Greece and Rome used marijuana for multiple ailments. ( Public Domain )\n\nAncient Central Asia was home to several cultures that used marijuana for both medicinal and recreational purposes. The Scythians, a nomadic tribe that inhabited the region from the 9th century BC to the 4th century AD, were known to use marijuana in ritual ceremonies. They would toss the dried leaves and flowering tops of the plant onto hot stones to create a thick smoke, which they would then inhale. This was believed to have been done to induce hallucinations and to communicate with the spirit world. The Scythians also used marijuana for medicinal purposes, to treat a variety of conditions, such as headaches, toothaches, and pain relief during childbirth.\n\nAnother ancient culture in Central Asia that used marijuana was the Sogdian civilization, which lived in the region from the 5th century BC to the 8th century AD. They used marijuana in religious rituals and also as a form of currency. They would trade the plant with other cultures, such as the Chinese and the Indians, for goods such as silk, spices, and precious stones. The Sogdians also used marijuana for medicinal purposes, to treat conditions such as gout and rheumatism, and to alleviate pain during surgery. This is supported by the fact that Sogdians used the word \"cannabis\" to describe the plant, which translates to \"a way to obtain freedom from pain.\"\n\nAncient nomadic tribes of the steppes of Central Asia also used marijuana to get high before going into battle. The Scythians and the Sarmatians believed that the plant had powerful properties that could give them supernatural strength and courage. They would inhale the smoke from burning marijuana, or consume it in the form of a drink called \"bhang,\" which was made by mixing the plant with milk or other liquids. This practice was also believed to have spiritual and religious significance as it was believed to help them communicate with the gods and ancestors. The use of marijuana in this context was not just limited to men, but also women and children, who were believed to partake in the rituals to gain strength and courage.\n\nBhang eaters in India, circa 1790. Bhang is an edible preparation of marijuana native to the Indian subcontinent. It has been used in food and drink as early as 1000 BC by Hindus in ancient India. ( Public Domain )\n\nAncient cultures had a profound understanding of the healing properties of marijuana and used it in various forms to promote health and well-being. From medical treatments to spiritual practices, the ancient world knew the value of this powerful plant.\n\nTop Image: Marijuana and other plants have been used for medicinal, spiritual, and recreational purposes since time immemorial. The pictured Amazonian shaman uses ayahuasca ritualistically. Source: Ammit / Adobe Stock", "opengraph": {"type": "article", "url": "https://www.ancient-origins.net/history-ancient-traditions/marijuana-0017887", "title": "Marijuana for All that Ails You: Cannabis in the Ancient World", "description": "Marijuana, also known as cannabis, has been used by humans for thousands of years for both medicinal and recreational purposes.", "image": "https://www.ancient-origins.net/sites/default/files/field/image/marijuana_0.jpg", "image:secure_url": "https://www.ancient-origins.net/sites/default/files/field/image/marijuana_0.jpg", "image:type": "image/jpeg", "article:published_time": "2023-02-04T01:02:08+00:00", "article:modified_time": "2023-02-04T01:03:31+00:00", "site_name": "Ancient Origins Reconstructing the story of humanity's past"}, "tags": ["Read more about High Status Brothers Had Access to Cranial Surgery in Bronze Age Israel", "Read more about Medicinal Microbes of Our Ancestors: Tracing the History of Probiotics", "Read more about Extracted from Andean Coca, Freud Promoted Cocaine as a Miracle Drug", "Read more about Murderous Medicine: Six Strange and Horrifying Ancient Medical Treatments", "Read more about Ancient Medicinal Mint Has Untapped Potential, New Research Reveals", "Read more about Ancient Maggot and Leech Therapy Sees Revival to Fight Antibiotic Resistance"], "tweets": [], "movies": [], "links": ["https://www.ancient-origins.net/news-history-archaeology/leaf-buds-discovered-tomb-early-chinese-emperor-may-be-oldest-example-fine-020695", "https://www.ancient-origins.net/news-history-archaeology/cannabis-domestication-0015596", "https://www.ancient-origins.net/history-important-events/anesthesia-0015881", "https://www.ancient-origins.net/history-ancient-traditions/versatile-plant-what-were-many-uses-cannabis-ancient-egypt-007733", "https://www.ancient-origins.net/myths-legends-asia/magu-hemp-goddess-who-healed-ancient-asia-008709", "https://commons.wikimedia.org/wiki/File:Portrait_of_the_Immortal_Magu_-_Ma_Hezhi_-_Song_Dynasty.jpg", "https://www.ancient-origins.net/history-ancient-traditions/versatile-plant-what-were-many-uses-cannabis-ancient-egypt-007733", "https://www.ancient-origins.net/artifacts-ancient-writings/ebers-papyrus-0012333", "https://www.ancient-origins.net/news-history-archaeology/ancient-egyptian-texts-contain-hangover-cure-eye-disease-020309", "https://www.ancient-origins.net/opinion-guest-authors/drugs-ancient-cultures-history-drug-use-and-effects-006051", "https://www.ancient-origins.net/history/ancient-cannabis-0011400", "https://commons.wikimedia.org/wiki/File:Luxor_temple_16.jpg", "https://www.ancient-origins.net/history-ancient-traditions/ayurvedic-medicine-traditional-knowledge-life-india-has-endured-passage-020647", "https://www.ancient-origins.net/history/five-things-ancient-greeks-can-teach-us-about-medicine-today-006463", "https://www.ancient-origins.net/history-famous-people/galen-famous-medical-researcher-classical-antiquity-005459", "https://www.ancient-origins.net/news-science-space/frankincense-may-infuse-users-mild-euphoria-004585", "https://commons.wikimedia.org/wiki/File:Geometric_kantharos_Staatliche_Antikensammlungen_8501.jpg", "https://www.ancient-origins.net/opinion-guest-authors/drugs-ancient-cultures-history-drug-use-and-effects-006051", "https://en.wikipedia.org/wiki/History_of_medical_cannabis#/media/File:Cannabissativadior.jpg", "https://www.ancient-origins.net/news-history-archaeology/secret-chamber-found-scythian-burial-mound-reveals-golden-treasure-drug-020362", "https://www.ancient-origins.net/artifacts-ancient-writings/words-ancient-past-sogdian-ancient-letters-006874", "https://www.ancient-origins.net/news-history-archaeology/surprising-5000-year-old-cannabis-trade-eurasian-steppe-nomads-were-020909", "https://www.ancient-origins.net/ancient-places-asia/sarmatians-0013985", "https://commons.wikimedia.org/wiki/File:Bhang_eaters_before_two_huts_(6124556163).jpg", "https://stock.adobe.com/uk/images/shaman-ayahuasca-ecuador-amazon-old-ceremony-man-tribal-tribes-people-magical-in-ecuadorian-amazonia-during-a-real-ayahuasca-formal-picture-as-seen-in-april-2015-shaman-ayahuasca-ecuador-amazon-old-c/94121335?prev_url=detail"], "authors": [], "publish_date": "2023-02-04T01:02:08+00:00"}