{"result_id": "029046", "URL": "https://www.ancient-origins.net/news-history-archaeology/black-death-0016474", "timestamp": "2023-04-25 12:04:58 CEST+0200", "meta": {"description": "Researchers have used medieval pollen samples from across Europe to conclude that Black Death mortality rates were lower but not all bubonic researchers agree.", "lang": "en", "keywords": "black death, pollen, mortality, diseases, Europe, medieval, Plague", "favicon": "https://www.ancient-origins.net/apple-touch-icon-192x192.png", "canonical": "https://www.ancient-origins.net/news-history-archaeology/black-death-0016474", "encoding": "utf-8"}, "image": null, "domain": "www.ancient-origins.net", "title": "Was Medieval Black Death Really That Bad? A New Pollen Study Says No!", "cleaned_text": "Black Death is said to have killed over half of Europe’s population. However, a new pollen study suggests many parts of Europe were not affected by the bacterial onslaught. Black Death was a bubonic plague pandemic that affected Afro-Eurasia between 1346 and 1353 AD. The disease was greatly perpetuated by flea-ridden rats inhabiting overcrowded mediaeval cities. Known as the most fatal pandemic ever recorded in human history, it has been estimated that between 75-200 million people died in Eurasia and North Africa. However, a new study of ancient pollen deposits suggests the death toll may have been much lower.\n\nMedieval Black Death mortality levels were looked at by using pollen levels at various locations across Europe using this approach. ( Nature Ecology & Evolution )\n\nNew Black Death Study Says Previous Death Rates Not Accurate\n\nResearchers from the Max Planck Institute for the Science of Human History have completed a new study of mediaeval European pollen samples. The team set out to determine whether historic claims that the Black Death “killed half of Europe’s population between 1346 and 1352 AD” were accurate, or not.\n\nThe new research study was published in the journal Nature Ecology & Evolution and it shows Black Death was “not as deadly as previously thought.” It was Norwegian historian Ole Benedictow, a leading plague expert, that most recently estimated 65 percent of Europe’s population was wiped out by the disease.\n• Black Death Mortality Wasn’t as Widespread as Everyone Thinks\n• Culling the World: The Catastrophic Conquests of the Black Death\n\nPollen was studied from 261 historic sites in 19 modern-day Europe countries to determine any topographical changes between 1250 and 1450 AD. According to an article published in The Conversation by the research team, pollen differs in shape between plants and it is so durable that it can last for several centuries.\n\nThe scientists proposed that if the traditional claims were accurate that “half of Europe’s population died during the Black Death,” a distinct change from agricultural pollen grains to those of trees and shrubs would be found, as fields were left to go fallow after so many farmers died .\n\nBagno Kusowo peatland, one of best-preserved Baltic bogs in north Poland, was one of the sites used in the recent Black Death pollen study. (Mariusz Lamentowicz / Max Planck Institute )\n\nStudy author Adam Izdebski told the New York Times that while the most prevalent form of Black Death was contracted through infected rat flea bites , human overcrowding and highly-unsanitary conditions likely contributed to its accelerated spread. The researcher said mediaeval communities “cannot maintain the same level of land use if half of the labour force disappeared instantly.”\n\nContrary to this expectation, while certain areas like southern Sweden , central Italy and Greece fit this pattern, other areas like Catalonia and Czechia showed “no change in agricultural presence,” according to the new study. Furthermore, in Poland, the Baltic countries and central Spain , an increase in agricultural expansion is noted during the Black Death period. Dr Izdebski described “a regionally variable Black Death” which he says also fits with what modern scientists know about the spread of plagues.\n\nThe new Black Death pollen study results have not convinced everyone, and a number of “serious” critics have emerged, while others have given support for the new bubonic mortality conclusions of the latest study. ( luismolinero / Adobe Stock)\n\nThe New Study Has Unleashed Serious Scientific Criticism\n\nThe results of the new study conflict with the research of Ole Benedictow. Moreover, John Aberth, author of The Black Death: A New History of the Great Mortality , told the New York Times he “doubts the conclusion of the new study.” The author is skeptical about the new research because mediaeval Europe was highly interconnected by “trade, travel, commerce and migration,” and he says whole regions could “not have escaped the disease.” But it looks like they did.\n\nWhile John Aberth provides no evidence whatsoever to show how regions couldn’t have escaped Black Death, the New York Times lists several other researchers who support the new findings. Dr Sharon DeWitte of the University of South Carolina supports the idea of a more modest death toll, and so does Joris Roosen at the Centre for the Social History of Limburg in the Netherlands. Unlike most other research in this field the new study refrains from estimating how many Europeans actually died from the disease, and the scientists said they stopped themselves from “making quick generalizations” like most other writers.\n\nTop image: A plaque to the Black Death dead from 1349 and 1369 at Monmouth, Wales. Source: Jaggery / CC BY-SA 2.0", "opengraph": {"type": "article", "url": "https://www.ancient-origins.net/news-history-archaeology/black-death-0016474", "title": "Was Medieval Black Death Really That Bad? A New Pollen Study Says No!", "description": "Black Death is said to have killed over half of Europe’s population. However, a new pollen study suggests many parts of Europe were not affected by the bacterial onslaught. Black Death was a bubonic plague pandemic", "image": "https://www.ancient-origins.net/sites/default/files/field/image/Black-Death_1.jpg", "image:secure_url": "https://www.ancient-origins.net/sites/default/files/field/image/Black-Death_1.jpg", "image:type": "image/jpeg", "article:published_time": "2022-03-01T18:00:39+00:00", "article:modified_time": "2022-03-01T18:00:39+00:00", "site_name": "Ancient Origins Reconstructing the story of humanity's past"}, "tags": ["Read more about The Haunted Plague Island of Poveglia: A Dark and Twisted Past", "Read more about Thrilled Detectorist Finds 800-Year-Old Brooch with Magical Words to Ward off Illness", "Read more about Black Death Mortality Wasn’t as Widespread as Everyone Thinks", "Read more about Survivors of Black Death Passed on Genetic Risk to Autoimmune Disease", "Read more about Medieval Black Death Origin Traced to Central Asia", "Read more about From Horror to Hope: Surviving the Black Plague (Video)"], "tweets": [], "movies": [], "links": ["https://www.nature.com/articles/s41559-021-01652-4", "https://www.shh.mpg.de/2099614/black-death-mortality-lower-than-believed", "https://www.ancient-origins.net/history-important-events/black-death-plague-sowed-terror-and-death-medieval-europe-part-1-003821", "https://www.nature.com/articles/s41559-021-01652-4", "https://www.ancient-origins.net/news-history-archaeology/black-death-mortality-0016413", "https://www.ancient-origins.net/history-important-events/black-death-0013083", "https://www.ancient-origins.net/news-general/charles-darwin-0014839", "https://theconversation.com/the-black-death-was-not-as-widespread-or-catastrophic-as-long-thought-new-study-175461", "https://www.ancient-origins.net/history-important-events/roots-civilization-0014323", "https://www.shh.mpg.de/2099614/black-death-mortality-lower-than-believed", "https://www.nytimes.com/2022/02/10/science/black-death.html", "https://www.ancient-origins.net/news-evolution-human-origins/study-black-death-skeletons-reveals-plague-airborne-0998877", "https://www.ancient-origins.net/ancient-places-europe/bl-jungfrun-island-sweden-witches-dwell-and-labyrinths-confuse-009779", "https://www.ancient-origins.net/news-history-archaeology/neolithic-bones-reveal-socio-economic-and-cultural-differences-are-nothing-021645", "https://stock.adobe.com/uk/contributor/203651281/luismolinero?load_type=author&prev_url=detail", "https://www.ancient-origins.net/news-history-archaeology/early-medieval-0014826", "https://www.ancient-origins.net/history-important-events/renaissance-0013046", "https://www.ancient-origins.net/news-history-archaeology/black-death-0013302", "https://www.ancient-origins.net/news-history-archaeology/black-death-origins-0015519", "https://www.geograph.org.uk/photo/4310591"], "authors": [], "publish_date": "2022-03-01T18:00:39+00:00"}