{"result_id": "029002", "URL": "https://www.ancient-origins.net/weird-facts/dodo-0018060", "timestamp": "2023-04-25 12:03:58 CEST+0200", "meta": {"description": "Icon of humanity’s impact on nature, the sad story of the dodo was popularized by the late Lewis Carroll. Now scientists aim to revive the long-extinct bird.", "lang": "en", "keywords": "dodo, Extinction, Mauritius, DNA", "favicon": "https://www.ancient-origins.net/apple-touch-icon-192x192.png", "canonical": "https://www.ancient-origins.net/weird-facts/dodo-0018060", "encoding": "utf-8"}, "image": null, "domain": "www.ancient-origins.net", "title": "Scientists Plan to De-Extinct the Dodo!", "cleaned_text": "Have you ever wondered where the phrase “dead as a dodo” comes from? Used to describe something obsolete, unimportant and unquestionably dead, the saying was inspired by the sad story of the long-dead dodo. First recorded by European explorers in Mauritius, the trusting dodo garnered a reputation as a bumbling fool and was extinct within a century of its discovery.\n\nThe dodo was a flightless forest bird, much like a giant ground pigeon, endemic to Mauritius off East Africa, an island with no human settlement prior to the arrival of the Portuguese in the 1500s. Thought to have originated millions of years ago in Southeast Asia, after sea levels rose the dodo existed in isolation.\n\nDodos are mysterious creatures. With limited remains and unscientific descriptions and drawings found in ship logs, scientists aren't sure what they really looked like. Without any natural predators, they evolved to be big, heavy and flightless – up to a meter (3.3 ft) tall and 20 kilos (44 lbs) in weight. Sadly, they had no fear of humans and couldn't escape hungry Portuguese sailors who nicknamed them doudo, meaning stupid.\n\nAfter fascinating visitors, the last living dodo was spotted at the end of the 1600s, so much so that during the 18th century the dodo was considered an idiotic fictional creature, populating the pages of mythology much like unicorns and mermaids. Unfortunately, blaming victims for their own mistreatment and untimely demise has been a recurring pattern in colonial history.\n\nBelieve it or not, but these mummified dodo remains, on display at the Oxford Museum of Natural History, were the inspiration behind Alice in Wonderland’s Dodo character. ( Oxford University Museum of Natural History )\n\nWe have Charles Dodgson, a.k.a. Lewis Carroll , to thank for popularizing the dodo. A frequent visitor of the Oxford Museum of Natural History , home to the only dodo soft tissue in existence - the Oxford Dodo – Dodgson included the Dodo in his celebrated Alice's Adventures in Wonderland in 1865. Legend has it that the dodo represented the author himself because, due to his stammer, he would introduce himself as “do-do-dodgeson.”\n\nCarroll’s dodo brought attention to the first recognized human-induced extinction. Scientists believe dodos disappeared due to over-hunting, invasive species and habitat destruction. Dodos were also slow to reproduce, laying only one egg at a time, making them extra vulnerable.\n\nBeth Shapiro and Ben Lamm announced plans to resurrect the iconic dodo, or Raphus cucullatus, which was last spotted in the 17th century. ( Colossal Biosciences )\n\nInspired by the dodo’s role as poster child of human driven extinction, Texas-based gene editing company Colossal Biosciences announced in January 2023 that they plan to bring back the dead-as-a-dodo bird through ancient DNA sequencing , gene editing, and synthetic biology.\n\nThis would be the company's first bird revival, following previous plans to revive the woolly mammoth . While some criticize de-extinction as “fairytale science,” these initiatives raise awareness, and funding, for threatened species and research into conservation efforts. The possible revival of the dodo, a species synonymous with extinction, could be the much-needed symbol of hope for envisioning a brighter future.\n\nTop image: Illustration by John Tensile of the Dodo from Lewis Carroll’s “Alice's Adventures in Wonderland.” Source: Archivist / Adobe Stock", "opengraph": {"type": "article", "url": "https://www.ancient-origins.net/weird-facts/dodo-0018060", "title": "Scientists Plan to De-Extinct the Dodo!", "description": "Have you ever wondered where the phrase “dead as a dodo” comes from? Used to describe something obsolete, unimportant and unquestionably dead, the saying was inspired by the sad story of the long-dead dodo.", "image": "https://www.ancient-origins.net/sites/default/files/field/image/dodo.jpg", "image:secure_url": "https://www.ancient-origins.net/sites/default/files/field/image/dodo.jpg", "image:type": "image/jpeg", "article:published_time": "2023-03-15T00:51:54+00:00", "article:modified_time": "2023-03-27T18:20:26+01:00", "site_name": "Ancient Origins Reconstructing the story of humanity's past"}, "tags": ["Read more about Scientists Create Potentially Deadly Prehistoric “Mammoth Meatball”"], "tweets": [], "movies": [], "links": ["https://www.ancient-origins.net/ancient-places-asia/mauritius-dodo-0010569", "https://www.ancient-origins.net/history-important-events/mauritius-conquests-naval-battles-piracy-and-long-awaited-independence-021738", "https://www.ancient-origins.net/history-important-events/age-discovery-0013205", "https://www.ancient-origins.net/myths-legends/magic-unicorn-horn-0010750", "https://www.ancient-origins.net/myths-legends/magical-mermaids-japanese-folklore-005755", "https://www.oumnh.ox.ac.uk/", "https://www.ancient-origins.net/ancient-places-europe/saint-margarets-well-0014090", "https://oumnh.ox.ac.uk/learn-the-oxford-dodo", "https://www.youtube.com/watch?v=5eM8fKO6Mu8", "https://www.ancient-origins.net/news-history-archaeology/human-impact-animal-extinction-0015289", "https://colossal.com/", "https://www.ancient-origins.net/news-history-archaeology/caribbean-animal-extinctions-0015363", "https://colossal.com/", "https://www.ancient-origins.net/news-history-archaeology/dna-analysis-0015460", "https://www.ancient-origins.net/news-general/mammoth-dna-0014948", "https://www.ancient-origins.net/news-evolution-human-origins/could-we-see-return-ancient-extinct-species-001400", "https://stock.adobe.com/ec/contributor/206758745/archivist?load_type=author&prev_url=detail", "https://www.ancient-origins.net/users/cecilia-bogaard"], "authors": [], "publish_date": "2023-03-15T00:51:54+00:00"}