{"result_id": "029003", "URL": "https://www.ancient-origins.net/news-history-archaeology/viking-smallpox-0014025", "timestamp": "2023-04-25 12:04:00 CEST+0200", "meta": {"description": "Researchers have discovered an extinct strain of smallpox in the teeth of Viking skeletons that could be called the “Killer Viking Disease”.", "lang": "en", "keywords": "coronavirus, pandemic, smallpox, Viking, vikings, disease, human genome, gene sequencing, Viking skeletons, Europe, burial sites, sweden, oland, vaccine, covid-19, Viking teeth, variola virus, epidemics, Viking Age", "favicon": "https://www.ancient-origins.net/apple-touch-icon-192x192.png", "canonical": "https://www.ancient-origins.net/news-history-archaeology/viking-smallpox-0014025", "encoding": "utf-8"}, "image": null, "domain": "www.ancient-origins.net", "title": "Viking Explorers Found To Be Carriers Of The World's Deadliest Virus", "cleaned_text": "Chinese-Flu, Kung-Flu and now Trump-Flu, according to Nancy Pelosi, the Speaker of the United States House of Representatives, but now, in the middle of all these politicized pseudonyms names for coronavirus during the current epidemic, a new scientific paper has been published about an ancient micro-killer that could be called the “Killer Viking Disease”.\n\nThe team of researchers from St John's College, University of Cambridge , discovered extinct strains of smallpox in the teeth of Viking skeletons which prove for the very first time that the killer smallpox disease haunted humanity’s growth trajectory for at least 1400 years.\n\nResearchers isolated viral DNA from human teeth and bones, such as this 1,200-year-old smallpox-infected Viking skeleton discovered in Öland, Sweden. ( The Swedish National Heritage Board / Science News )\n\nThe new paper by an international team of researchers was published in Science and is part of a long-term project sequencing 5000 ancient human genomes and their associated pathogens. This particular gene sequencing project focused on ancient strains of the smallpox virus extracted from the teeth of Viking skeletons unearthed across northern Europe. The team of researchers found smallpox, caused by the variola virus, in 11 Viking-era burial sites in Denmark, Norway, Russia, the UK and in multiple human remains from Öland, an island off the east coast of Sweden.\n\nProfessor Eske Willerslev of St John's College, University of Cambridge, who led the new study, explained that smallpox spread from person to person via infectious droplets and that it killed around “a third of sufferers and left another third permanently scarred or blind.” The paper reveals that around 300 million people died from the disease during the 20th century before it was officially eradicated in 1980 thanks to the deployment of a global vaccine. This represents the first human disease that the human race successfully eradicated.\n\nThe professor said his team already knew Vikings were moving around Europe and beyond, but now it is known they had smallpox. In the same way people are spreading Covid-19 during the coronavirus pandemic by traveling round the world on airplanes, it is thought likely that “Vikings spread smallpox” due to their extensive sea travel . The researchers conclude that the 1400-year-old genetic information extracted from the Viking’s teeth is “hugely significant because it teaches us about the evolutionary history of the variola virus that caused smallpox.”\n\nThe gene sequencing project focused on ancient strains of the smallpox virus extracted from the teeth of Viking skeletons unearthed across northern Europe to show the genome evolution of Viking Age smallpox. ( Múhlemann et al. / Science )\n\nGene Sequencing Provides Proof of Smallpox in Vikings\n\nHistorians believe smallpox may have existed since 10,000 BC, but no scientific evidence of the virus has been found from a time before the 17th century. While scientists are still unclear about how smallpox first infected humans, like Covid-19 it is believed to have leaped from an animal population. Professor Martin Sikora, one of the senior authors leading the study, from the Centre for GeoGenetics at the University of Copenhagen, said the timeline of the emergence of smallpox has always been unclear, but by sequencing the earliest-known strain of the killer virus “we have proved for the first time that smallpox existed during the Viking Age.”\n\nThe researchers also say it is highly probable there were epidemics much earlier than their published findings, and while they don't know for sure if these strains of smallpox were fatal and caused the death of the Vikings, “they certainly died with smallpox in their bloodstream for us to be able to detect it up to 1400 years later.”\n• How ‘Death Ships’ Spread Disease Through the Ages\n• Learn From History: Don’t Panic, But Prepare For Coronavirus Pandemic\n• What Can the Plague of Athens Teach Us About Today’s Coronavirus?\n\nSmallpox was an infectious disease that killed around 300 million people in the 20 th century alone, before it was officially eradicated in 1980 thanks to a global vaccine. ( Robert Carswell / CC BY 4.0 )\n\nDr. Terry Jones, one of the senior authors leading the study, a computational biologist based at the Institute of Virology at Charité -- Universitätsmedizin Berlin and the Centre for Pathogen Evolution at the University of Cambridge , said none of the team expected to find proof that these smallpox strains existed. According to Dr. Jones, it has long been believed that smallpox circulated in Western and Southern Europe by 600 AD. Thanks to these new findings it has been scientifically proven that smallpox was also widespread in northern Europe and that “returning crusaders or other later events have been thought to have first brought smallpox to Europe, but such theories cannot be correct” in light of this new study.\n\nDr. Jones added that archaeological knowledge from the past can “protect us in the present.” Mutations can re-occur or spill over from the animal reservoir, “so there will always be another zoonosis,” referring to an infectious disease outbreak caused by a pathogen jumping from a non-human animal to a human. And while smallpox was eradicated forty years ago, the scientists warn that another smallpox strain could spill over from the animal reservoir “tomorrow.”\n\nTop image: Researchers have discovered extinct strains of smallpox, an infectious disease also known as Variola, in the teeth of Viking skeletons proving the disease was around at least 1,400 years ago. Source: nobeastsofierce / Adobe Stock", "opengraph": {"type": "article", "url": "https://www.ancient-origins.net/news-history-archaeology/viking-smallpox-0014025", "title": "Viking Explorers Found To Be Carriers Of The World's Deadliest Virus", "description": "Chinese-Flu, Kung-Flu and now Trump-Flu, according to Nancy Pelosi, the Speaker of the United States House of Representatives, but now, in the middle of all these politicized pseudonyms names for coronavirus during the current epidemic", "image": "https://www.ancient-origins.net/sites/default/files/field/image/Viking-smallpox.jpg", "image:secure_url": "https://www.ancient-origins.net/sites/default/files/field/image/Viking-smallpox.jpg", "image:type": "image/jpeg", "article:published_time": "2020-07-24T19:51:21+01:00", "article:modified_time": "2020-07-24T19:53:22+01:00", "site_name": "Ancient Origins Reconstructing the story of humanity's past"}, "tags": ["Read more about Do You Have the Good or Bad Covid-19 Neanderthal Genes?", "Read more about Covid-19 Complications – Are Neanderthals to Blame?", "Read more about Medieval ‘Wine Windows’ Revived Due to Coronavirus", "Read more about 47,000 U.K. Pandemic Finds, But This Tudor Coin Hoard Is King!", "Read more about Historic Wine Windows Reopen in Italy, What Could Possibly Go Wrong?", "Read more about Halloween CAN Go on With These Fun Ancient Traditions"], "tweets": [], "movies": [], "links": ["https://www.ancient-origins.net/news-history-archaeology/plague-athens-0013456", "https://www.ancient-origins.net/news-history-archaeology/viruses-sleeping-mummies-could-ancient-corpses-lead-modern-epidemics-009234", "https://www.joh.cam.ac.uk/", "https://www.ancient-origins.net/news-history-archaeology/hominin-breastfeeding-0012312", "https://www.ancient-origins.net/news-history-archaeology/archaeologists-found-irish-viking-king-olaf-guthfrithsson-05886", "https://www.sciencenews.org/article/smallpox-virus-ancient-dna-teeth-vikings-europeans", "https://science.sciencemag.org/content/369/6502/eaaw8977", "https://www.ancient-origins.net/news-history-archaeology/viking-ship-burial-0012237", "https://www.ancient-origins.net/news-history-archaeology/archaeologists-unearth-1500-year-old-crime-scene-sweden-00896", "https://www.ancient-origins.net/history-famous-people/viking-hrafna-floki-0013995", "https://www.ancient-origins.net/history-important-events/ancient-africans-0013738", "https://www.ancient-origins.net/news-history-archaeology/viking-tar-0010962", "https://www.ancient-origins.net/history-ancient-traditions/did-these-filed-and-grooved-teeth-belong-viking-elite-warrior-009227", "https://science.sciencemag.org/content/369/6502/eaaw8977", "https://globe.ku.dk/research/geogenetics/", "https://www.ancient-origins.net/news-general/victims-end-world-epidemic-unearthed-egypt-001770", "https://www.youtube.com/watch?v=IAodgb3BZDc", "https://www.ancient-origins.net/news-history-archaeology/death-ships-0013723", "https://www.ancient-origins.net/news-general/coronavirus-pandemic-0013234", "https://www.ancient-origins.net/news-history-archaeology/plague-athens-0013456", "https://commons.wikimedia.org/wiki/File:Green_Smallpox-pustules_by_Carswell._Wellcome_L0019716.jpg", "https://virologie-ccm.charite.de/en/", "https://www.zoo.cam.ac.uk/directory/centre-for-pathogen-evolution-members", "https://www.ancient-origins.net/news-general/islamic-healers-0013797", "https://stock.adobe.com/ec/contributor/201734807/nobeastsofierce?load_type=author&prev_url=detail", "https://www.ancient-origins.net/users/ashley-cowie"], "authors": [], "publish_date": "2020-07-24T19:51:21+01:00"}