{"result_id": "029036", "URL": "https://www.ancient-origins.net/news-history-archaeology/drug-enema-0017286", "timestamp": "2023-04-25 12:04:44 CEST+0200", "meta": {"description": "The ancient Maya people administered drug enemas to themselves which included psychoactive substances and alcohol!", "lang": "en", "keywords": "enemas, drugs, hallucinogens, rituals, maya, pottery", "favicon": "https://www.ancient-origins.net/apple-touch-icon-192x192.png", "canonical": "https://www.ancient-origins.net/news-history-archaeology/drug-enema-0017286", "encoding": "utf-8"}, "image": null, "domain": "www.ancient-origins.net", "title": "Maya Drug Enema Study Receives Ig Nobel History Prize", "cleaned_text": "Mesoamerican tribes have had a long history of administering liquids through the lower digestive tract in a procedure known today as an enema. Maya drug enemas included psychoactive substances, entheogens (substances with hallucinogenic properties), and alcohol. The Maya drug enema absorption process indicates that these ancient people knew all about the lower digestive tract. As depicted in Maya pottery, the “ritual ecstasy” of drug enemas was widely practiced.\n\nAnd now a 1986 study on this subject has been awarded 2022’s prestigious Ig Nobel history prize, which was created to \"honor achievements that first make people laugh, and then make them think.\"\n\nOn this Maya enema beaker, a male priest is administering a drug enema to a recipient just out of the frame on the left side of this circular vessel in the collection of the Princeton University Art Museum. ( Princeton University Art Museum )\n\nMaya drug enemas were the subject of a landmark 1986 study entitled A multidisciplinary approach to the scenes of ritual enemas in ancient Mayan ceramics , available on Science Direct . The first of these polychrome pottery jars , dated to the late Classic Maya period (600-900 AD), was discovered in 1977. This period of Maya pottery is associated with depictions of palace scenes, ball games, hunting parties, dances associated with human sacrifice, and drug enemas.\n\nAfter the initial discovery in 1977, several other ceramic pieces depicting scenes of drug enema usage in ritual and ceremonial settings were. The 1986 study concluded that drug enemas were administered frequently in Maya societies. The 1986 study was written by Peter de Smet and Nicholas Hellmuth, who have just received 2022’s Ig Nobel history prize. Peter de Smet personally tried out these drug enemas on more than one occasion.\n\nTheir remarkable study analyzed the iconographic traditions on Maya pottery pieces depicting the administration of drug enemas, and the linguistic glyphs that appeared in these scenes. This prompted them to compile a list of possible “ethnopharmacological” substances that the Maya may have ingested using enemas, according to a report on Arts Technica .\n\n“This idea is quite contrary to the traditional view that the ancient Maya were a contemplative people, who did not indulge in ritual ecstasy. The occasional display of vomiting actors would seem to provide a plausible reason why the Maya opted for rectal application. Some scenes present a fair amount of evidence that an alcoholic beverage may have been taken rectally,” write de Smet and Hellmuth. In fact, \"they gave themselves over to ritual ecstasy.\"\n\nPeter de Smet went the extra mile and tested the efficacy of a number of these substances by self-administering various drug enemas. \"The results certainly support the theoretical suggestion that alcohol is absorbed well from an enema,” the authors of the study noted.\n\nThe famous Teotihuacan Tepantitla mural, now in the collection of Mexico’s National Museum of Anthropology, depicts two attendants (left and right) offering hallucinogenic plants to a central deity or elite. (Juan Carlos Fonseca Mata / CC BY-SA 4.0 )\n\nThe consumptions of entheogens in the Americas dates back to the Olmec civilization , the earliest known Mesoamerican civilization (1500-400 BC), who occupied parts of the tropical lowlands of modern day Mexico. Central American ethnopharmacological substances have been documented in Maya religious texts like the Popol Vuh, and in the accounts of 16th-century Spanish invaders and chroniclers.\n\nThe administration of entheogens during ritual ceremonies most often took place underground, in caves, or sacred access points to the underworld. The ancient Maya believed that the use of these access points would intensify their visions. This created a favorable atmosphere for contact with the world of spirits.\n\n“Mesoamerican myths and religions emphasize the role of the priest or shaman as a mediator between the physical and the spiritual worlds, and this situation promoted the use of entheogens in religious ceremonies and prophecy,” the authors wrote in their study.\n• · Ancient Egyptian Pharaohs Had a Shepherd of the Royal Anus\n• · US Vets and Others May Get Legal Access To Old World Magic Mushrooms\n\nThe most commonly used Maya entheogen was a drink called balché. It was made from the bark of the leguminous tree fermented in water with honey. The other alcoholic drink commonly consumed was chih, made by fermenting the sap of the maguey plant.\n\nThe Maya also used wild tobacco in their rituals, which they called piziet. Piziet helped in the quest for visions and minimized the pain caused during blood sacrifices. The tobacco contained an alkaloid that when chewed, inhaled, or mixed with datura leaves created a strong hallucinogenic substance.\n\nHallucinogenic mushrooms called k’aizalaj okox were consumed in ritual ceremonies. The mushrooms were consumed fresh, or as a dry, powdered mixture with other entheogenic compounds (like psilocybin and psilocin) and produced powerful hallucinations. The Heritage Daily reported that the Maya consumed magic mushrooms for human decapitation rituals, in preparation for battle, and in some Mesoamerican ballgames.\n\nNow that the prestigious Ig Nobel Prize has been awarded to the scholars that pioneered Maya drug enema research, we can expect more research on this topic and likely more than a few “researchers” giving themselves multiple drug enemas for study purposes!\n\nTop image: Maya pottery found in Guatemala depicting a man applying a ritual drug enema, from the collection of the Los Angeles County Museum of Art. Source: Los Angeles County Museum of Art", "opengraph": {"type": "article", "url": "https://www.ancient-origins.net/news-history-archaeology/drug-enema-0017286", "title": "Maya Drug Enema Study Receives Ig Nobel History Prize", "description": "Mesoamerican tribes have had a long history of administering liquids through the lower digestive tract in a procedure known today as an enema.", "image": "https://www.ancient-origins.net/sites/default/files/field/image/drug-enema.jpg", "image:secure_url": "https://www.ancient-origins.net/sites/default/files/field/image/drug-enema.jpg", "image:type": "image/jpeg", "article:published_time": "2022-09-18T18:56:18+01:00", "article:modified_time": "2022-09-19T00:42:23+01:00", "site_name": "Ancient Origins Reconstructing the story of humanity's past"}, "tags": [], "tweets": [], "movies": [], "links": ["https://artmuseum.princeton.edu/collections/objects/36739", "https://www.ancient-origins.net/myths-legends-americas/mayan-gods-0011052", "https://www.sciencedirect.com/science/article/pii/S2173580814001527?via%3Dihub", "https://www.ancient-origins.net/news-history-archaeology/greek-pottery-0016637", "https://www.ancient-origins.net/news-general/self-harming-ritual-0012731", "https://www.ancient-origins.net/news-history-archaeology/maya-drugs-0014807", "https://www.ancient-origins.net/news-history-archaeology/sacrificed-inca-children-0016832", "https://www.ancient-origins.net/artifacts-ancient-writings/hidden-glyphs-deciphering-bilingual-mayan-olmec-text-007171", "https://arstechnica.com/science/2022/09/maya-ritual-enemas-and-constipated-scorpions-the-2022-ig-nobel-prize-winners/", "https://www.ancient-origins.net/human-origins-science/strange-and-wonderful-world-ancient-brews-008892", "https://commons.wikimedia.org/wiki/File:Mural_en_Tepantitla_-_Museo_Nacional_de_Antropolog%C3%ADa_-_Sala_4_-_Teotihuacan.png?uselang=es", "https://www.ancient-origins.net/news-ancient-places-americas/mysterious-civilization-olmecs-002540", "https://www.ancient-origins.net/ancient-places-americas/maya-art-0014641", "https://www.ancient-origins.net/myths-legends-americas/venus-symbol-0014781", "https://www.ancient-origins.net/weird-facts/shepherd-anus-0017177", "https://www.ancient-origins.net/news-general/magic-mushrooms-0016528", "https://www.ancient-origins.net/news-history-archaeology/oldest-tobacco-north-america-020922", "https://www.heritagedaily.com/2022/09/the-ritual-drug-habits-of-the-maya/144651", "https://www.lacma.org/", "https://www.heritagedaily.com/2022/09/the-ritual-drug-habits-of-the-maya/144651", "https://historia.nationalgeographic.com.es/a/estudio-sobre-aplicacion-ritual-enemas-entre-mayas-distinguido-premio-ig-nobel_18371", "https://www.abc.net.au/news/science/2022-09-16/ig-nobel-prizes-2022-maya-enema-alcohol-hallucinogen/101440422", "https://doi.org/10.1016/0378-8741(86)90091-7", "https://www.mexicanist.com/l/ritual-enemas/#:~:text=In%20addition%20to%20their%20use,by%20the%20lower%20digestive%20tract"], "authors": [], "publish_date": "2022-09-18T18:56:18+01:00"}