{"result_id": "029030", "URL": "https://www.ancient-origins.net/weird-facts/toxic-pigment-0017241", "timestamp": "2023-04-25 12:04:36 CEST+0200", "meta": {"description": "In the Victorian Era, a brilliant-green colored pigment proved popular in wallpaper, but its toxicity was fatal to many, especially children.", "lang": "en", "keywords": "Victorian, pigments, paint, arsenic, toxic", "favicon": "https://www.ancient-origins.net/apple-touch-icon-192x192.png", "canonical": "https://www.ancient-origins.net/weird-facts/toxic-pigment-0017241", "encoding": "utf-8"}, "image": null, "domain": "www.ancient-origins.net", "title": "Victorian-Era Wallpaper Killed Countless Children", "cleaned_text": "Wallpaper isn’t as popular as it once was, and perhaps the reason for its fall from fashion was its ability to kill! In the Victorian Era, a brilliant green-colored pigment proved popular in wall colors, but its toxicity was fatal to many, especially children and the elderly.\n\nIn 1778, Swedish Chemist Carl Scheele created the brilliant green pigment called “Scheele’s Green,” which was composed of copper arsenite . As its name suggests, copper arsenite contains the deadly element arsenic. Not all commercially available green paints contained arsenic, but many of the prominent ones did, such as Emerald Green, Paris Green, and Schweinfurt Green.\n\nAlthough the dangers associated with ingesting arsenic were well known, the people of the 19th century did not believe their arsenic-laden wall coverings would do them harm. But many families around this time grew mysteriously ill for no apparent reason. The water supplies were untainted, and the houses were clean, but there remained one common factor: the green wallpaper.\n\nDamage caused by the use of green arsenic, 1859, from Scheele’s Green pigment. (Fæ / CC BY-SA 4.0 )\n\nIn 1850, Dr. Letheby, a renowned chemist working at the London Hospital, confirmed that the cause of death for a girl was arsenic poisoning. The newspapers were quick to publicize the doctor’s theory: that the arsenic-filled paints used in the wallpaper covering the family home had killed a child.\n\nHis theory did not convince everyone. Letters appeared in local newspapers for nearly a decade claiming that the theory was impossible and that no one could be killed by wallpaper. Due to the popularity of the color, businesses were also reluctant to give up such a large source of income. So, they continued to claim that there was nothing wrong with the pigment.\n\nHowever, in 1879, Queen Victoria had all of the green wallpaper torn out of Buckingham Palace after a visiting dignitary became ill. In the decades to follow, the toxic pigment was slowly but surely left behind.\n\nRead more: Death by Wallpaper: When Arsenic in the Walls Was Killing Children", "opengraph": {"type": "article", "url": "https://www.ancient-origins.net/weird-facts/toxic-pigment-0017241", "title": "Victorian-Era Wallpaper Killed Countless Children", "description": "Wallpaper isn’t as popular as it once was, and perhaps the reason for its fall from fashion was its ability to kill!", "image": "https://www.ancient-origins.net/sites/default/files/field/image/toxic-pigment.jpg", "image:secure_url": "https://www.ancient-origins.net/sites/default/files/field/image/toxic-pigment.jpg", "image:type": "image/jpeg", "article:published_time": "2022-09-08T02:00:16+01:00", "article:modified_time": "2022-09-08T02:01:35+01:00", "site_name": "Ancient Origins Reconstructing the story of humanity's past"}, "tags": ["Read more about Hundreds of Toxic Beer Bottles Found Under Old English House", "Read more about Highway Project Unearths Post-Medieval Burial Ground in England", "Read more about The Book of Exposition and the Enigmatic English Bohemian", "Read more about More Than A Game: The True History Of Ouija Boards", "Read more about “We Don't Need No Education!” – The History of Childhood", "Read more about British Gentlemen Drank From Moustache Cups that Protected Their Facial Hair"], "tweets": [], "movies": [], "links": ["https://www.ancient-origins.net/history-ancient-traditions/deadly-pigments-0012572", "https://www.ancient-origins.net/ancient-technology/egyptian-blue-oldest-artificial-pigment-ever-produced-001745", "https://www.ancient-origins.net/news-history-archaeology/experimental-color-chart-reveals-original-beauty-prehistoric-copper-goods-021773", "https://commons.wikimedia.org/wiki/File:Accidents_caused_by_the_use_of_green_arsenic,_1859_Wellcome_L0075300.jpg", "https://stock.adobe.com/ie/images/little-girl-sleep-in-bed-retro-style/513039163?asset_id=513039163", "https://www.ancient-origins.net/history-ancient-traditions/arsenic-poisoning-0010336"], "authors": [], "publish_date": "2022-09-08T02:00:16+01:00"}