{"result_id": "029048", "URL": "https://www.ancient-origins.net/news-history-archaeology/neanderthal-gene-0014357", "timestamp": "2023-04-25 12:05:03 CEST+0200", "meta": {"description": "A new research paper has linked a Neanderthal gene found in about 16% of today’s global human population as a contributing factor to Covid-19 severity.", "lang": "en", "keywords": "Neanderthal DNA, modern humans, covid-19, Neanderthal genes, homo sapiens, Denisovans, Age, gender, ethnicity, obesity, health, coronavirus", "favicon": "https://www.ancient-origins.net/apple-touch-icon-192x192.png", "canonical": "https://www.ancient-origins.net/news-history-archaeology/neanderthal-gene-0014357", "encoding": "utf-8"}, "image": null, "domain": "www.ancient-origins.net", "title": "Covid-19 Complications – Are Neanderthals to Blame?", "cleaned_text": "A strand of Neanderthal DNA inherited by modern humans has been linked to your likelihood of falling severely ill with Covid-19, but not everyone is convinced.\n\nThe Neanderthal gene is only found in some people on the planet. A strand of DNA that modern humans inherited from the Neanderthals has been identified in a new paper published in Nature. The paper says, the Neanderthal gene “increases the risk of developing severe Covid-19.”\n\nAccording to lead author, Hugo Zeberg, an assistant professor at the Karolinska Medical Institute in Stockholm, and his co-author, Svante Pääbo, director of the Max Planck Institute of Evolutionary Anthropology in Leipzig, the strand of DNA that was passed on from Neanderthals to modern humans “triples the risk of developing severe Covid-19.” However, there are skeptics who suggest the Neanderthal gene we carry cannot really explain the complex nature of Covid-19 and doesn’t account for all the factors.\n\nSince emerging from China in late 2019, over the last year Covid-19, according to the latest data published on Worldometers, has reportedly infected 34,999,693 people and has claimed the lives of 1,035,656. Running parallel in the race for a vaccine and more advanced therapeutics is the hunt for a common factor among those who contract the disease and become extremely ill. The primary suspicions point to age, diet, race, smoking and other lifestyle and environmental factors.\n\nBut now, genetic evidence has been published suggesting your chances of extreme suffering and death after contracting Covid-19 is related to how much Neanderthal DNA is present in any given individual. Is this a gross oversimplification, or is it true enough to consider?\n\nThe Covid-19 coronavirus that causes respiratory infections is said to be worse in people who carry the Neanderthal gene. (dottedyeti / Adobe Stock )\n\nAround 50,000 years ago Homo sapiens met Neanderthals on the bountiful Eurasian hunting grounds. Traditional history teaches us that a competition for food resources led to the Homo sapiens killing-off the Neanderthals. However, recent research has proven that there was a lot of inter-species breeding between modern humans, Neanderthals and Denisovans. According to the new paper, it is estimated that about “16% of Europeans and half of south Asians today” carry Neanderthal genes.\n\nZeberga and Pääbo identified the Covid-19 “risk gene” after a comparison of DNA samples from Covid-19 victims with the DNA from Neanderthal and Denisovan bones. They wrote that the particular strand of DNA that makes sufferers more likely to develop complications and serious illness, closely matched Neanderthal DNA unearthed in Croatia.\n\nTalking with reporters at The Guardian , Dr Zeberga said “I almost fell off my chair,” when realizing this statistical analysis determined an unseen commonality in Covid-19 suffers, and that the DNA of Covid-19 patients with extreme symptoms was “exactly the same as in the Neanderthal genome.”\n\nA Neanderthal on the left versus a modern human on the right. We sure look different but below the surface the modern human genome also includes the Neanderthal gene that makes Covid-19 more severe. (nicolasprimola / Adobe Stock )\n\nAttempting to explain why ancient humans may have kept this apparently deadly Neanderthal gene, the pair of geneticists suspect the guilty Neanderthal gene might have at one time been beneficial in helping us fight off a range of other ancient infections , but now, 55,000 years later, that same gene’s “downside has been exposed.” However, what remains a mystery is how exactly the Neanderthal gene amplifies the effects of Covid-19.\n\nThe authors of the new paper estimate that about “100,000 additional people” have died so far in the current pandemic due to the Neanderthal gene that is part of the modern human genome.\n• Improving Our First Line of Defense: Neanderthal Genes\n• New DNA Study Suggests African Humans Interbred With European Neanderthals Way Earlier Than We Think\n• New Studies Clash with Previous Analyses On the Life and Fate of Neanderthals\n\nAnother Scientist Disagrees And Says: “Not So Fast!”\n\nReading almost every headline about this story, linking a Neanderthal gene with Covid-19 complications, you might be inspired, like I was, to search for where you can get a Neanderthal gene test now. But I urge you to save your cash for now as another leading professor in this field, Dr Mark Maslin, from the University College London, told The World New s that he urged the public to “show caution” towards the claims in this new paper.\n\nIndirectly, he accused the authors of perhaps “oversimplifying the causes and impact of the pandemic,” and he added that Covid-19 is a complex disease , the severity of which has been linked to “age, gender, ethnicity, obesity, health, virus load among other things,” and as Covid-19 spreads around the world it is clear that “lots of different populations are being severely affected, many of which do not have any Neanderthal genes.”\n\nFor someone like me, immersed in archaeology and the history of humans, the new research on the Neanderthal gene that some modern humans carry and its effect on Covid-19 severity highlights how little we know about our modern-day genes, where they came from, and what made them useful in the first place.\n\nTop image: A group of Neanderthals, who, according to a new research paper, gave modern humans a Neanderthal gene that can make Covid-19 more servere. Source: Gorodenkoff / Adobe Stock", "opengraph": {"type": "article", "url": "https://www.ancient-origins.net/news-history-archaeology/neanderthal-gene-0014357", "title": "Covid-19 Complications – Are Neanderthals to Blame?", "description": "A strand of Neanderthal DNA inherited by modern humans has been linked to your likelihood of falling severely ill with Covid-19, but not everyone is convinced.", "image": "https://www.ancient-origins.net/sites/default/files/field/image/Neanderthal-gene.jpg", "image:secure_url": "https://www.ancient-origins.net/sites/default/files/field/image/Neanderthal-gene.jpg", "image:type": "image/jpeg", "article:published_time": "2020-10-04T23:27:47+01:00", "article:modified_time": "2020-10-06T20:47:30+01:00", "site_name": "Ancient Origins Reconstructing the story of humanity's past"}, "tags": ["Read more about In Plain Sight, Our Neanderthal Ancestors", "Read more about Neanderthal DNA Recovered from Cave Dirt Using Breakthrough Technology"], "tweets": [], "movies": [], "links": ["https://www.ancient-origins.net/human-origins-science/research-confirms-neanderthal-dna-makes-20-modern-human-genome-009817", "https://www.ancient-origins.net/news-general/ayurvedic-text-0013594", "https://www.nature.com/articles/s41586-020-2818-3", "https://ki.se/en", "https://www.eva.mpg.de/index.html", "https://www.worldometers.info/coronavirus/", "https://stock.adobe.com/uk/images/covid-19-coronavirus-that-causes-respiratory-infections-sars-cov-2-virus-background/327553041?prev_url=detail", "https://www.ancient-origins.net/human-origins-science/age-wise-men-what-distinguishes-homo-sapiens-other-great-apes-009139", "https://www.ancient-origins.net/news-history-archaeology/neolithic-diet-0011341", "https://www.ancient-origins.net/news-evolution-human-origins/denisovans-mated-modern-humans-0011688", "https://www.ancient-origins.net/news-evolution-human-origins/study-casts-new-light-diseases-we-inherited-neanderthals-005344", "https://www.ancient-origins.net/news-history-archaeology/elongated-skulls-0012475", "https://www.theguardian.com/science/2020/sep/30/neanderthal-genes-increase-risk-of-serious-covid-19-study-claims", "https://stock.adobe.com/uk/images/neanderthal-vs-modern-human/90132470?prev_url=detail", "https://www.ancient-origins.net/history/world-no-antibiotics-how-did-doctors-treat-infections-005281", "https://www.ancient-origins.net/news-evolution-human-origins/improving-our-first-line-defense-neanderthal-genes-005121", "https://www.ancient-origins.net/news-evolution-human-origins/new-dna-study-suggests-african-humans-interbred-european-neanderthals-021480", "https://www.ancient-origins.net/news-evolution-human-origins/new-studies-clash-previous-analyses-life-and-fate-neanderthals-008567", "https://twnews.co.uk/gb-news/neanderthal-genes-increase-risk-of-serious-covid-19-study-claims", "https://www.ancient-origins.net/news-history-archaeology/2000-year-old-feces-silk-road-reveal-spread-infectious-diseases-006326", "https://www.ancient-origins.net/news-evolution-human-origins/fat-primates-0012201", "https://stock.adobe.com/uk/images/tribe-of-four-hunter-gatherers-wearing-animal-skin-holding-stone-tipped-tools-pose-at-the-entrance-of-their-cave-portrait-of-two-grown-male-and-two-female-neanderthals-and-their-way-of-living/311314644?prev_url=detail", "https://www.ancient-origins.net/users/ashley-cowie"], "authors": [], "publish_date": "2020-10-04T23:27:47+01:00"}