{"result_id": "029051", "URL": "https://www.ancient-origins.net/news-science-space/measles-origins-0013080", "timestamp": "2023-04-25 12:05:07 CEST+0200", "meta": {"description": "The world’s oldest known measles sample has been discovered in the lungs of a girl who died in 1912, revealing that the ancient virus jumped from animals to humans around 300 BC.", "lang": "en", "keywords": "measles, virus, lungs, History, origins, livestock, animals, ancient, vaccine", "favicon": "https://www.ancient-origins.net/apple-touch-icon-192x192.png", "canonical": "https://www.ancient-origins.net/news-science-space/measles-origins-0013080", "encoding": "utf-8"}, "image": null, "domain": "www.ancient-origins.net", "title": "Lungs of 2-Year-Old Reveal Ancient Origins of Measles Virus", "cleaned_text": "The world’s oldest known measles sample has been discovered in the lungs of a girl who died in 1912 and scientists now suggest the ancient virus jumped from animals to humans around 300 BC, making the disease in people much older than previously believed.\n\nAccording to a summary of the new findings in Science, a team of researchers has made ´a groundbreaking´ new find relating to the history of measles after the oldest sample ever discovered was found in the preserved lung of a two-year-old girl who had died in 1912 from measles. The remains of the little girl were found in the basement storage facility of the Museum of Medical History in Berlin and she had never before been tested, but the new study reveals that measles may have emerged 1,000 years earlier than currently believed.\n\nThe new study was based on analysis of “the oldest known sample of the measles virus known to science” and, according to a feature in Science Mag , this microcosmic bacterial discovery always ´promised´ new insights about the evolution of the disease throughout history. Until this new paper, researchers had incorrectly thought the measles virus had first emerged between 400 AD and 1400 AD but the new analysis suggests it may have first appeared a thousand years earlier, as early as 300BC.\n\nResearcher and co–author of the new paper, Professor Sebastien Calvignac-Spencer, told Science that his team isolated RNA from the oldest measles virus, “by more than 40 years”. Previously, the oldest known sample of a measles virus dated back to 1954 and had been used to develop the first measles vaccine, but this newly tested lung sample had been preserved in the basement in a formaldehyde solution known as formalin which preserved the virus in near perfect conditions for testing.\n• Victims of End of the World Epidemic Unearthed in Egypt\n• Have Researchers Discovered What Caused the 16th Century Mexican Epidemic That Killed Over 80% of the Population?\n• New Study Finds Salmonella Brought by Europeans Caused Epidemic that Wiped Out 80% of the Aztecs\n\nThe preserved lungs of a girl who died from measles in 1912. Credit: KAI KUPFERSCHMIDT/SCIENCE\n\nAs for the origins of measles, around 10,000 years ago people started establishing hunting, fishing and agricultural settlements which would shape the future of human civilization, but people were now living closer together in unsanitary communities and many animal diseases jumped species. The new paper suggests the virus came from sheep and goats around 300 BC and, while not fully proven, it is suspected to have migrated to humans as we increasingly populated cities, subsequently creating less space between humans and livestock.\n\nAccording to a paper on QScience, the first description of measles dates back to the ninth century AD when Persian physician, Al-Razi, wrote his treatise on Smallpox and Measles in 865 AD. This genius physician died in Rayy in 925 AD but is famed in medical circles for having coined the term “sudden death” in Arabic 1000 years ago, and for having first identified measles as an independent infection, differing from smallpox.\n\nIt was only in 1757 that Francis Home, the Scottish physician, demonstrated that the infection was caused by an agent in the blood and after a 1964 breakout in Boston, John F. Enders and Dr Thomas C. Peebles isolated the measles virus in the patient’s blood which soon after led to a vaccine.\n\nEuropean depiction of the Persian (Iranian) doctor Al-Razi, in Gerardus Cremonensis \"Recueil des traités de médecine\" 1250-1260. ( Public Domain )\n\nProfessor Sebastien Calvignac-Spencer wrote in the new paper that the virus would have ideally needed populations of between between 250,000 and a million people to spread widely and not just die out, and that the biggest cities in the world emerged around the fourth century AD, and as an example, the researcher said as many as “a million people lived in Rome around that time”. He added that the virus depends on large populations to keep itself alive as it requires exposure to new hosts, which they say can be difficult because once a person's been infected by the virus, they develop a lifetime immunity to it.\n\nThe Daily Mail article refers to the Great Ormond Street Hospital , who say measles has been resurgent in the last several years, with more than 9.7 million documented cases in 2018 and 142,300 deaths, the majority of which were children under four years old. And on the back of this, it advises readers that measles can be prevented by receiving “two vaccinations, the first at 13 months old and the second at three years and four months to five years old.”\n\nThe Way It Used To Be\n\nTo cover myself before I write my last paragraph, I must first state that in no way whatsoever am I either endorsing or advising against the somewhat controversial combined Measles Mumps Rubella vaccination, but I cannot reject my own personal experience with the disease and take stock of how much things have changed over the last two or three decades.\n\nWhen I was a lad, we went to school and caught the measles and got the customary week off school, which we spent watching films on VHF tapes. We would eventually go back to school to pass the virus along to the next child we ´tagged´ in the playground, and so we all quickly, and together as a community, became immunized for life in one or two months, keeping alive the micro-organism that leaped from animals to humans in ancient days.", "opengraph": {"type": "article", "url": "https://www.ancient-origins.net/news-science-space/measles-origins-0013080", "title": "Lungs of 2-Year-Old Reveal Ancient Origins of Measles Virus", "description": "The world’s oldest known measles sample has been discovered in the lungs of a girl who died in 1912 and scientists now suggest the ancient virus jumped from animals to humans around 300 BC, making the disease in people much older than previously believed.", "image": "https://www.ancient-origins.net/sites/default/files/field/image/measles-origins.jpg", "image:secure_url": "https://www.ancient-origins.net/sites/default/files/field/image/measles-origins.jpg", "image:type": "image/jpeg", "article:published_time": "2020-01-01T22:25:59+00:00", "article:modified_time": "2020-01-01T22:26:41+00:00", "site_name": "Ancient Origins Reconstructing the story of humanity's past"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.sciencemag.org/news/2019/12/measles-may-have-emerged-when-large-cities-rose-1500-years-earlier-thought", "https://www.bmm-charite.de/en/index.html", "https://www.sciencemag.org/news/2019/12/measles-may-have-emerged-when-large-cities-rose-1500-years-earlier-thought", "https://www.ancient-origins.net/news-general/victims-end-world-epidemic-unearthed-egypt-001770", "https://www.ancient-origins.net/news-history-archaeology/have-researchers-discovered-what-caused-16th-century-mexican-epidemic-021231", "https://www.ancient-origins.net/news-history-archaeology/new-study-finds-salmonella-brought-europeans-caused-epidemic-wiped-out-80-021237", "https://www.qscience.com/docserver/fulltext/qmj/2000/2/qmj.2000.2.7.pdf?expires=1577908213&id=id&accname=guest&checksum=03D856CD979EAC975E6E402B63C2E231", "https://www.ancient-origins.net/history-ancient-traditions/urine-wheel-and-uroscopy-your-wee-could-tell-medieval-doctor-009744", "https://upload.wikimedia.org/wikipedia/commons/8/8d/Al-RaziInGerardusCremonensis1250.JPG?uselang=fr", "https://www.gosh.org/donate?appeal=C26011&utm_source=Google&utm_medium=cpc&utm_campaign=DonatePage&gclid=CjwKCAiAo7HwBRBKEiwAvC_Q8fA068_tgvmzFWN23OO14fUZ9K1r8tsulHxsPMumf0rex0y8tkSTjxoC__UQAvD_BwE&gclsrc=aw.ds", "https://stock.adobe.com/uk/contributor/201734807/nobeastsofierce?load_type=author&prev_url=detail", "https://stock.adobe.com/uk/contributor/206108071/bilanol?load_type=author&prev_url=detail", "https://www.ancient-origins.net/users/ashley-cowie"], "authors": [], "publish_date": "2020-01-01T22:25:59+00:00"}