{"result_id": "029009", "URL": "https://www.ancient-origins.net/unexplained-phenomena/giant-footprint-pingyan-008191", "timestamp": "2023-04-25 12:04:08 CEST+0200", "meta": {"description": "Stories and tales about gigantic beings inhabiting the Earth occur in almost all ancient cultures and civilizations. From the Indo-Europeans, to the Greeks, to the Christian Bible, tales of giants have been passed down from generation to generation and these stories still exist in modern day.", "lang": "en", "keywords": "giant, Giants, China, footprint, rock, ancient, gods", "favicon": "https://www.ancient-origins.net/apple-touch-icon-192x192.png", "canonical": "https://www.ancient-origins.net/unexplained-phenomena/giant-footprint-pingyan-008191", "encoding": "utf-8"}, "image": null, "domain": "www.ancient-origins.net", "title": "The Giant Footprint of Pingyan: Giant Made or Man Made?", "cleaned_text": "Stories and tales about gigantic beings inhabiting the Earth occur in almost all ancient cultures and civilizations. From the Indo-Europeans, to the Greeks, to the Christian Bible, tales of giants have been passed down from generation to generation and these stories still exist in modern day. There has never been any concrete evidence to prove the existence of giants, that is unless you believe the giant footprints that have been found across the globe. Multiple giant footprints have been discovered and are thought to be millions if not billions of years old. To the locals where these footprints can be found they are known as “the footprints of god.” Could the history books and what we know of evolution be wrong?\n\nIn August 2016, a giant human-shaped footprint was discovered by a group of photographers in Pingyan village in Guizhou, the southwestern province of China. By the following month numerous websites has published similar stories that contributed to the believability of the account of the giant footprint. The footprint was said to be 57 cm long, 20 cm wide, and 3 cm deep. Found fossilized in rock, the footprint was dated back to the prehistoric era. Considering that the average foot size of a man is 18 cm, and the average for a woman is 16.5 cm, this discovery would be monumental and leave historians and scientists alike questioning what we know of human history and evolution.\n\nClose up of the alleged giant’s footprint. (Sina News Agency)\n\nThe original article regarding the footprint gives a barebones description of the discovery and lists its sources merely as “agencies.” However, according to Snopes.com a search was done of the local newspapers near Guizhou and no article was written about the giant footprint in August 2016. Therefore, no reputable source has published any work on the topic, neither in the media or the scientific community. However, many conspiracy websites have gotten hold of the original article and link it to other alleged giant footprints.\n• Is There Archaeological Evidence of Bigfoot? (Part I)\n• Lovelock Cave: A Tale of Giants or A Giant Tale of Fiction?\n• The Giants of Doddridge County: Burials of a Vanished Race – Part I\n\nThe footprints are reportedly 57cm (22.5inches) long and 20cm (8 inches wide) Next to the full print is what looks like a partial print (Sina news agency).\n\nThese websites claim that an archaeologist named Michael Tellinger dated one of these giant footprints to be around 200 million years old. Tellinger supposedly found another giant footprint in Africa in 2012 and he was convinced that it was one of the best pieces of evidence proving that giants once roamed the earth. While Tellinger claims to be an archaeologist, many have denounced him as a conspiracy theorist.\n\nMichael Tellinger with the massive footprint in the rock in Africa (Youtube screenshot)\n\nA third footprint was discovered in Bolivia but CNN reported that the print was from a large carnivorous dinosaur rather than an ancient giant. Prior to that, another massive footprint was found in New Mexico by Jerry MacDonald in 1987 which measuring 100 cm in length and was said to be 290 million years old. This print was recorded as the largest footprint made by a meat-eating dinosaur. However, this print has been problematic for paleontologists since there is no explanation as to how it got there or what left it. This again left room for the conspiracy websites to theorize, and took this information to further prove the existence of ancient giants.\n• Giant Footprints in Rock Evidence of Ancient People from the Sky?\n• The Establishment Has Already Acknowledged A Lost Race of Giants - Part 1\n\nThe claims made by these conspiracy theorists hold no weight when it comes to any sort of academic research. The giant footprint of Pingyan is said to have been fossilized in solid granite, a material that does not lend itself to capturing any type of print. Also, the rock is most likely closer to 3.1 billion years old, as opposed to 200 million. While the discovery of these other footprints has led to more and more questions, more research is being done on the topic. Could these footprints have come from ancient giant humans, possibly even our ancestors? There is no certainty yet. However, the research that has already been done points to that answer being unlikely.\n\nTop image: A man stands in what appears to be a giant footprint in bedrock in Pingyin China (Credit: Sina news agency)\n\nAncient Code. 2012. A Giant Footprint Has Been Discovered in China. [Online] Available at: http://www.ancient-code.com/giant-footprint-discovered-china/\n\nBhattacharjee, Budhaditya. 2016. Giant Footprint in China: Facts to Know. [Online] Available at: https://www.morningnewsusa.com/giant-footprint-china-facts-know-23112509.html\n\nLions Ground. 2016. Giant Human Footprints Discovered in China. [Online] Available at: https://youtu.be/F2TFvwUqpds\n\nTellinger, Michael. Giatn Foor Print 200 Million Yrs Old – South Africa. [Online] Available at: https://youtu.be/dRuxw-nZoJw\n\nSina. 2016. Giant Fossilized Human Footprint Found in SW China’s Guizhou. [Online] Available at: http://english.sina.com/china/s/2016-08-26/detail-ifxvixeq0515878.shtml", "opengraph": {"type": "article", "url": "https://www.ancient-origins.net/unexplained-phenomena/giant-footprint-pingyan-008191", "title": "The Giant Footprint of Pingyan: Giant Made or Man Made?", "description": "Stories and tales about gigantic beings inhabiting the Earth occur in almost all ancient cultures and civilizations. From the Indo-Europeans, to the Greeks, to the Christian Bible, tales of giants have been passed down from generation to generation and these stories still exist in modern day.", "image": "https://www.ancient-origins.net/sites/default/files/field/image/The-Giant-Footprint-of-Pingyan.jpg", "image:secure_url": "https://www.ancient-origins.net/sites/default/files/field/image/The-Giant-Footprint-of-Pingyan.jpg", "image:type": "image/jpeg", "article:published_time": "2020-06-06T14:02:51+01:00", "article:modified_time": "2020-09-30T16:57:46+01:00", "site_name": "Ancient Origins Reconstructing the story of humanity's past"}, "tags": ["Read more about Argos Panoptes – The All-Seeing Giant of Greek Mythology", "Read more about Massive Penguins the Size of Gorillas Once Waddled Around New Zealand", "Read more about Giant 7-Foot Sword and Mirror for Demon Slaying found in Japan Tomb", "Read more about Extreme Drought Exposes Theropod Dinosaur Tracks in Texas River", "Read more about Skeleton of Irish Giant, Charles Byrne, to be Removed from Public Display", "Read more about Surtr: Norse Mythology's Giant God of Fire and Apocalypse"], "tweets": [], "movies": [], "links": ["https://www.ancient-origins.net/unexplained-phenomena/there-archaeological-evidence-bigfoot-part-i-005350", "https://www.ancient-origins.net/myths-legends-americas/lovelock-cave-tale-giants-or-giant-tale-fiction-003060", "https://www.ancient-origins.net/unexplained-phenomena/giants-doddridge-county-burials-vanished-race-part-i-005541", "https://www.youtube.com/watch?v=dRuxw-nZoJw", "https://www.ancient-origins.net/news-evolution-human-origins/giant-footprints-rock-evidence-ancient-people-sky-00780", "https://www.ancient-origins.net/unexplained-phenomena/top-ten-giant-discoveries-north-america-005196", "https://www.ancient-origins.net/unexplained-phenomena/establishment-has-already-acknowledged-lost-race-giants-part-1-003109", "https://www.ancient-origins.net/users/veronica-parkes", "http://www.ancient-code.com/giant-footprint-discovered-china/", "https://www.morningnewsusa.com/giant-footprint-china-facts-know-23112509.html", "http://www.snopes.com/giant-human-footprints-found-in-china/", "https://youtu.be/F2TFvwUqpds", "https://youtu.be/dRuxw-nZoJw", "http://english.sina.com/china/s/2016-08-26/detail-ifxvixeq0515878.shtml"], "authors": [], "publish_date": "2020-06-06T14:02:51+01:00"}