{"result_id": "032034", "URL": "https://answersingenesis.org/genetics/mutations/hiv-mutation-vulnerable-to-vaccines/", "timestamp": "2023-04-25 12:06:09 CEST+0200", "meta": {"description": "HIV mutation may make it more vulnerable to vaccines.", "lang": "en", "keywords": "Hiv,Mutation,Vaccines,Vulnerable", "favicon": "https://assets.answersingenesis.org/img/favicons/apple-touch-icon.png", "canonical": "https://answersingenesis.org/genetics/mutations/hiv-mutation-vulnerable-to-vaccines/", "encoding": "utf-8"}, "image": null, "domain": "answersingenesis.org", "title": "HIV Mutation Possibly More Vulnerable to Vaccines", "cleaned_text": "HIV mutation may make it more vulnerable to vaccines.\n\nHuman Immunodeficiency Virus (HIV) has frustrated efforts to create an effective vaccine. Analysis of naturally developed antibodies in a few infected patients, however, has uncovered a pattern in HIV mutations, a pattern that could be the key to developing an HIV vaccine.\n\nYour immune system uses antibodies to attack invaders, but antibodies typically recognize only a small region of an invader. The recognizable regions of HIV, however, are well hidden. Thus this virus initially evades detection. After it binds to its target cells (T-lymphocytes and macrophages), the immune system recognizes it and produces antibodies. Then, however, rapid mutation in the HIV genome typically makes enough unrecognizable versions of the virus to maintain the infection. And because the target cells are part of the human immune system, the infected person remains disastrously vulnerable to other infections.\n\nHIV targets human cells that have CD4 on their surface. The virus’s glycoprotein envelope (gp120) binds to CD4, essentially unlocking the cell to allow HIV to enter and take over the cell. The most potent types of “broadly cross-neutralizing antibodies” to HIV can recognize a certain glycan sugar attached to the 332nd amino acid of this gp120 glycoprotein envelope. However, in patients initially infected, most HIV are not glycosylated at position 332. So how, investigators wondered, could this antibody be broadly effective?\n\nAt South Africa’s National Institute for Communicable Diseases of the National Health Laboratory Service, Penny Moore and Lynn Morris have discovered the answer. They found that two HIV-infected women whose original HIV (like most) was not glycosylated at position 332 began producing increasing amounts of the antibody designed to recognize that marker. Because the immune system generally designs antibodies to attack what it has been exposed to, this did not seem to make sense. “We were astonished,” Moore said.\n\nFurther investigation of 70 patients revealed that in a third of them the viral population changed in just 6 months to HIV glycosylated at position 332.1\n\nGlycosylation at position 332, it turns out, is caused by a mutation in the original virus. And it is this very mutation that enables the HIV possessing it to escape the usual volley of antibodies generated during the initial infection. Such glycosylated mutant viruses enter the cells and “escape from the first wave of antibodies.” But the very mutation that facilitates the original infection could potentially become the target of attack by natural antibodies in some patients, and hopefully, the eventual target of attack by manmade ones.\n\n“This is the first time we’ve really understood that viral evolution itself shapes the antibodies that come out,” said Moore. The researchers write, “These findings highlight the dynamic interplay between early antibodies and viral escape in driving the evolution of conserved BCN [broadly cross-neutralizing] antibody epitopes [target sites].” Moore adds, “Being able to work out the pattern of viral evolution will help us think about designing vaccines.” Not that anyone expects this to be an easy task, but the discovery offers a clue that will hopefully lead to an effective strategy to deal with this devastating infection.\n\nThis encouraging discovery illustrates the unfortunate way the word evolution gets applied to vastly different phenomena. The broadest definition of the word evolution as just “change” fits what we see here. Of the ordinary mutations that occur in the original infecting virus, a particular mutation (glycosylation at amino acid 332) renders HIV more capable of successfully evading host defenses and invading target cells. Those invading viruses replicate their mutated genome using the infected cells’ machinery and produce a viral population naturally selected to have the glycosylation. But this new glycosylation is a recognizable target that new antibodies can attack.\n\nBut this change is not evidence of Darwinian evolution. The change in the viral genome did not provide the virus with the tools to become something different than a virus. The original viral genome was altered, but it did not make upward progress toward becoming a living thing or some sort of non-virus. Thus, the usual application of the word evolution—in the sense of “molecules-to-man evolution”—does not apply here. Unfortunately, as we noted just last week, proponents of evolution habitually point to the changes in the pathogenicity of bacteria and viruses and their responses to antibiotics, vaccines, and other treatments as examples to support the belief that bacteria changed into bats, bananas, blue whales, and bacteriologists over the course of millions of years of natural selection and mutations.\n\nNothing about this new discovery depended on a belief in molecules-to-man evolution. This discovery resulted from the rigorous application of scientific observational skills in the study of the immune system God designed. The findings illustrate one way the immune system is equipped to fight pathogens in this sin-cursed world.", "opengraph": {"title": "HIV Mutation Possibly More Vulnerable to Vaccines", "url": "https://answersingenesis.org/genetics/mutations/hiv-mutation-vulnerable-to-vaccines/", "description": "HIV mutation may make it more vulnerable to vaccines.", "image": "https://assets.answersingenesis.org/img/cms/content/contentnode/header_image/mutations.jpg", "image:width": "945", "image:height": "300", "site_name": "Answers in Genesis", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.the-scientist.com/?articles.view/articleNo/32935/title/HIV-Evolves-Vulnerability/", "#fn_1", "/evolution/", "/answers/news-to-know/news-to-note-october-27-2012/", "/god/", "/sin/", "/natural-selection/antibiotic-resistance/evolution-and-medicine/", "/natural-selection/antibiotic-resistance/antibiotic-resistance-of-bacteria-evolution-in-action/", "https://answersresearchjournal.org/microbes-days-of-creation/", "https://answersresearchjournal.org/origin-bacterial-pathogenicity/", "/biology/microbiology/the-genesis-of-pathogenic-e-coli/", "/biology/microbiology/robert-koch-creation-and-the-specificity-of-germs/", "/answers/", "/forms/media-response/", "/answers/news-to-know/", "/about/privacy-policy/"], "authors": [], "publish_date": "Nov. 3, 2012, midnight"}