{"result_id": "032003", "URL": "https://answersingenesis.org/ministry-news/essential-ministry-christian-liberty-suing-caesar/", "timestamp": "2023-04-25 12:05:33 CEST+0200", "meta": {"description": "Christians must have the freedom to follow their consciences, even in a pandemic—which is why Answers in Genesis sued the United States government.", "lang": "en", "keywords": "", "favicon": "https://assets.answersingenesis.org/img/favicons/apple-touch-icon.png", "canonical": "https://answersingenesis.org/ministry-news/essential-ministry-christian-liberty-suing-caesar/", "encoding": "utf-8"}, "image": null, "domain": "answersingenesis.org", "title": "Essential Ministry, Christian Liberty, and Suing Caesar", "cleaned_text": "It’s January 2022! What battles and stresses will we have this year? Do you shudder to think about that, knowing what we’ve all gone through the past two years?\n\nAs I was writing this letter, I asked Mally, “Did you ever think when we were a young married couple and I was a high school science teacher in a country town in Queensland that one day we would be suing the United States government?” She answered, “It’s best we didn’t know because we may have run in the opposite direction from what the Lord called us to do.”\n\nYes, Answers in Genesis sued the federal government in November 2021. More on this later.\n\nIn 2015, we sued the state of Kentucky and its governor and tourism cabinet. That particular lawsuit was over religious freedom and persecution. Many of you may remember the then governor (the father of our current governor) stopped us from participating in a sales tax rebate incentive for the Ark Encounter that is offered to any new tourist facility that fulfills the state requirements (which we did fulfill and were approved for). He said we could not have this because of our religious purpose and message (we preached about Jesus), and because we only employed people who agreed with our Christian statement of faith.\n\nWell, on the basis of Title VII of the Civil Rights Act of 1964 and its exemption for religious organizations, a federal judge not only ruled that we could participate in the sales tax rebate incentive, but we had the right to employ only people who agreed with our statement of faith. Actually, this case set a precedent that is now used in other cases of religious discrimination.\n\nWe believe it is important to be subject to the governing authorities. “For there is no authority except from God, and those that exist have been instituted by God. . . . Because of this you also pay taxes, for the authorities are ministers of God, attending to this very thing. Pay to all what is owed to them: taxes to whom taxes are owed, revenue to whom revenue is owed, respect to whom respect is owed, honor to whom honor is owed” (Romans 13:1, 6–7).\n\nAnd as Jesus stated clearly, “render to Caesar the things that are Caesar’s, and to God the things that are God’s” (Matthew 22:21). But remember, the Apostle Peter in God’s Word states, “We must obey God rather than men” (Acts 5:29).\n\nAs a ministry, we have always paid “Caesar” what we owe “Caesar.” And we always obey “Caesar’s” rules in regard to day-to-day operations of the ministry. But when “Caesar” disobeys “Caesar’s” own rules, and/or tries to stifle a Christian organization from freely proclaiming the truth of God’s Word and the gospel, and/or impinges on one’s personal religious rights and freedoms, then we must hold “Caesar” to account. We must obey God rather than man. Civil disobedience, breaking the law, or doing something that is illegal is not what Christianity condones. “Respect for authority and having respect for authority is a Christian virtue,” stated Martyn Iles from the Australian Christian Lobby in Australia.\n\nI’m sure you recall the government-mandated shutdowns of 2020. Churches were also shut down, and in some states, rules concerning what pastors/churches could or could not do were different from others. But in all this, what we began to see was a definite bias against the church. For instance, in the state of Kentucky, churches were not allowed to be open, as they were not considered “essential,” but abortion clinics (nothing less than child-murdering facilities) were considered essential and allowed to be open. Certain numbers of people were allowed to be in a hardware store to shop for items, but the same number couldn’t worship in a church auditorium that was just as big or bigger. Churches were considered nonessential.\n\nNow, in Kentucky, our governor said it was important to stop people from dying, and so the shutdowns were purportedly necessary. Yet he made sure abortion clinics were open so as many children as possible could be put to death in their mother’s wombs. And actually, no matter what the governor mandated, he was not going to stop people from dying, because everyone is going to die! Now don’t get me wrong, I’m not saying we shouldn’t look after ourselves health-wise and use the medical knowledge God has allowed our doctors to accumulate. But the truth is, “it is appointed for man to die once, and after that comes judgment” (Hebrews 9:27).\n\nCertainly, people died from the virus, although I think we are all confused at what the actual statistics are. People die every day from all sorts of diseases. But once a person dies, God’s Word tells us they will spend eternity in heaven or hell. So how essential is the church, the body of Christ (of which AiG is a part of), for people’s well-being? It is vital.\n\nThere is no more important message than what the church proclaims to the world about the truth of God’s Word and the saving gospel. We only live a short time on earth but will spend eternity in heaven or hell. That’s what we always have at the forefront of our ministry.\n\nThere’s no doubt the governments in the West see the church as nonessential. In fact, in many instances, it appears they deliberately try to stifle what the church is doing. So we must stand up to “Caesar” when this is happening.\n\nSadly, a real fear of death has been created over the pandemic, but actually, it’s those who have rejected Christ who should have a real fear of death, because as God’s Word says, they will suffer a second death of eternal separation from God.\n\nI believe we are acting true to God’s Word when we stand up to “Caesar,” as Peter did.\n\nNow, in November 2021, the federal government (through OSHA) mandated that all organizations with 100 or more employees were required (1) to determine who in their organization had the COVID-19 vaccine and who did not, and (2) require all unvaccinated employees to receive the COVID-19 vaccine or be tested weekly and wear an OSHA-compliant mask (effectively labeling them in front of others). Employees not complying could then be subject to termination and employers subject to $13,000 per violation fines for each noncompliant action/inaction! So, of course, we had to meet and discuss whether as a ministry we had to comply with “Caesar’s” mandate. Well, consider these two things:\n\nThe legal document by which the US Government is to abide is the Constitution. And the Constitution clearly states the government cannot infringe the freedom of religion or free exercise of religion. And yet during this pandemic they have done just that. As First Liberty Institute states on its website: “The Supreme Court has already made it clear the government is not free to disregard the First Amendment’s protection of religious liberty and religious organizations in times of crisis.”\n\nCan the government have rights over a person’s body to not allow people to have personal freedom to do what they want with their own body? Well, let’s see what Kamala Harris, the vice president of the United States, stated on September 9 regarding abortion: “And, needless to say, the right of women to make decisions about their own bodies is not negotiable. The right of women to make decisions about their own bodies is their decision; it is their body. And no legislative institutions have the right to circumvent the Constitution of the United States in an attempt to interfere with, much less to prevent, a woman to make those decisions.”\n\nOh, so a woman has total rights over her body so she can kill her child in the womb (which is against God’s law as given in Exodus 20:13, “you shall not murder”), but a person can’t have rights over their body to not receive a vaccine that may have been developed or tested using aborted babies’ fetal stem cells, or which they believe may be harmful to them for various reasons. One starts to see how hypocritical the government is in regard to such matters and makes us wonder if they really are concerned about our health, or is there another agenda?\n\nMartyn Iles, who leads the Australian Christian Lobby, recently said on the Vision Christian Radio 20Twenty program that the COVID-19 vaccine mandates (he’s not against vaccines but against the mandates) are wrong because they “represent an overriding of free and informed consent which is essential for any medical procedure.” He referenced what came out of the Nuremberg Trials in regard to such a statement. (It’s worth listening to this interview with him about what’s happening in Australia regarding the pandemic: https://www.youtube.com/watch?v=zgZq3HNvZjA)\n\nThe above gives some of the background as to why we worked with First Liberty Institute, one of the many vital Christian attorney groups, to launch a lawsuit against the Federal Government over its COVID-19 vaccine mandate that would put AiG in a position of demanding all its employees reveal their COVID-19 vaccination status and require that they get the vaccine (or get tested weekly and wear a mask), or we would be in violation of OSHA regulations with the prospect of a $13,000 fine per violation!\n\nWhen we launched the lawsuit with First Liberty (who are providing legal services at no charge to AiG), we sent this to the staff:\n\nPursuant to President Biden’s directive, today the US Department of Labor and Occupational Safety and Health Administration (OSHA) issued a “mandate” that employers with 100+ employees require their staff to be vaccinated against COVID-19.\n\nWe do not intend to enforce this “mandate” on our staff. Answers in Genesis retained First Liberty Institute, a nationwide religious liberty law firm dedicated to defending the religious liberty of all Americans. Today, our attorneys at First Liberty filed a lawsuit challenging President Biden’s private employer “mandate.” We hope for a quick resolution.\n\nAs a Christian organization, in good conscience, we cannot—and will not—force our staff to violate their deeply held religious beliefs concerning vaccines. Our Constitution has long required the government, including OSHA, to respect the religious beliefs of its citizens. A global pandemic cannot change that.\n\nAs our CEO and founder, Ken Ham, recently explained, “As Christians, we certainly strive to submit to the government that God ordained as stated in Romans 13, unless our conscience before the Lord can’t allow it. We don’t want to oppose government directives. However, our government also cannot disregard the First Amendment of the US Constitution’s protection of religious liberty in times of crisis.”\n\nKelly Shackelford, president, CEO, and chief counsel for First Liberty, said, “The Constitution prevents the federal government from coercing a religious organization into violating the religious beliefs of its employees. This rule is unlawful and unconstitutional. The Biden administration’s mandate shows disdain for both our Constitution and the religious liberty of millions of Americans.”\n\nAs our attorneys work to preserve AiG’s religious liberty—and yours—we ask that you continue to pray for our country, its leaders, and that the Lord would continue to protect and bless our ministry and staff.\n\nThere is no Bible verse about vaccines. No one can say that being unvaccinated is sin. Neither is getting the vaccine sin. It’s a very personal decision and a matter of one’s own conscience. When the door is opened to allow the government to have rights over our bodies, how will that door be opened even more for the future in regard to control over people, churches, etc.?\n\nI write these letters a few weeks ahead of when you receive them. We don’t know what will happen in the courts before then. As of writing this letter, a federal court has already ruled on allowing a temporary stay against this mandate until the issue is heard on the merits by the courts. (Update: That ruling was later overturned and we have appealed to the Supreme Court, which, as of this writing, has yet to rule.) And remember, “I urge that supplications, prayers, intercessions, and thanksgivings be made for all people, for kings and all who are in high positions, that we may lead a peaceful and quiet life, godly and dignified in every way. This is good, and it is pleasing in the sight of God our Savior” (1 Timothy 2:1–3).\n\nThe board of this ministry, myself as CEO, and our leadership are burdened to do all we can to protect religious freedom, protect the personal rights of our staff, and protect the organization the Lord has entrusted to us so we can continue to be free to proclaim God’s Word and the saving gospel.\n\nSo we value your prayers as we negotiate through this minefield of issues in regard to the pandemic and government policies. I also ask that you prayerfully consider a gift this month to our core ministry that provides for all of our outreaches as we start a new year. Your gift of any size will be a great blessing to this ministry!\n\nRegardless of all that is happening, we won’t take our focus off the fact that the solution to all the problems of the world is what God clearly instructs us in his Word. There’s nothing more important than people trusting Christ as Savior and knowing their eternity will be in heaven with the Lord.\n\nThank you for your ongoing prayer and financial support of this evangelistic ministry.\n\nP.S. Your support is vital to our ministry. Please consider a gift to our core ministry today as we start 2022 with great hope for impacting millions of people this year through the many outreaches of Answers in Genesis. Thank you!", "opengraph": {"title": "Essential Ministry, Christian Liberty, and Suing Caesar", "url": "https://answersingenesis.org/ministry-news/essential-ministry-christian-liberty-suing-caesar/", "description": "Christians must have the freedom to follow their consciences, even in a pandemic—which is why Answers in Genesis sued the United States government.", "image": "https://assets.answersingenesis.org/img/cms/content/contentnode/og_image/religious-freedom.jpg", "image:width": "1200", "image:height": "628", "site_name": "Answers in Genesis", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.youtube.com/watch?v=zgZq3HNvZjA", "/donate/"], "authors": [], "publish_date": "Jan. 10, 2022, 6 a.m."}