{"result_id": "032025", "URL": "https://answersingenesis.org/creation-vs-evolution/war-belief/", "timestamp": "2023-04-25 12:06:02 CEST+0200", "meta": {"description": "Being featured in a two-page spread in National Geographic is not always a compliment for Christians.", "lang": "en", "keywords": "Global warming,Authority,Beliefs,Science", "favicon": "https://assets.answersingenesis.org/img/favicons/apple-touch-icon.png", "canonical": "https://answersingenesis.org/creation-vs-evolution/war-belief/", "encoding": "utf-8"}, "image": null, "domain": "answersingenesis.org", "title": "War on Belief", "cleaned_text": "Being featured in a two-page spread in National Geographic is not always a compliment for Christians. The March 2015 issue of that magazine features a dinosaur standing near Adam and Eve at the Creation Museum. But the accompanying article is not positive.\n\nThe magazine’s cover blares “The War on Science.” The feature article lumps young-earth creationists with “science deniers,” including doubters of climate change and opponents of vaccination and genetically modified foods.\n\nThe author, Joel Achenbach, explains that “tribalism” drives people to associate with a particular group and then interpret all evidence in light of their group’s beliefs. He refers to a study that showed that science literacy tends to strengthen already-held beliefs rather than change those beliefs. After all, people’s beliefs determine how they interpret evidence and not the other way around.\n\nAchenbach admits that scientists are just as tribal as everyone else. But then, ironically, he descends into his own tribalism by defending the “scientific” view (his evolutionary beliefs) as the only “right” worldview. In this way, he accidentally demonstrates that people honest enough to admit biases can still be blind to those biases.\n\nThe fact that a national magazine groups biblical creation with other scientific and political debates should cause Christians concern. How closely should we tie Christianity and the Bible’s authority to political and scientific issues not directly addressed in the Bible—such as global warming or vaccination—however important those issues may be?\n\nClearly, our biblical worldview should inform our attitude toward every subject in life. But we must distinguish between the clear teaching of God’s Word and political positions, even if they are based on biblical principles. We don’t want our personal views on political or scientific controversies to be confused with biblical truth.", "opengraph": {"title": "War on Belief", "url": "https://answersingenesis.org/creation-vs-evolution/war-belief/", "description": "Being featured in a two-page spread in National Geographic is not always a compliment for Christians.", "image": "https://assets.answersingenesis.org/img/cms/content/contentnode/header_image/creation-vs-evolution.jpg", "image:width": "945", "image:height": "300", "site_name": "Answers in Genesis", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["/adam-and-eve/", "/creation/", "/bible/", "/god/"], "authors": [], "publish_date": "July 1, 2015, midnight"}