{"result_id": "032011", "URL": "https://answersingenesis.org/creation-science/", "timestamp": "2023-04-25 12:05:43 CEST+0200", "meta": {"description": "Can Bible-based creation science make successful predictions, explain the evidence, and properly explain reality?", "lang": "en", "keywords": "Successful predictions by creation,Proof of creation,Created kinds,Creation science,The bible", "favicon": "https://assets.answersingenesis.org/img/favicons/apple-touch-icon.png", "canonical": "https://answersingenesis.org/creation-science/", "encoding": "utf-8"}, "image": null, "domain": "answersingenesis.org", "title": "Creation Science", "cleaned_text": "Evolutionists and some old-earth creationists frequently charge that scientists who believe in a young earth don't have real degrees and don't do real scientific research that can be published in peer-reviewed secular scientific journals. God Is in the Science of Mathematics If math is an invention of many human minds, then why should all these minds agree on what is correct? The Christian philosophy of math begins with God, who numbered the days of creation as recorded in Genesis 1. The founder of the true philosophy of math is Jesus Christ. We don’t have to abandon all the work of secular scientists; we can often co-opt their work into a biblical worldview. I could now walk into any museum and—exercising caution and discernment—imagine how some of the reconstructed scenes could have been part of Noah’s world. Creation researchers have been studying the biblical record and the world around us to understand the history that God’s Word records. While some of their theories have been discarded as new data came to light, other predictions have been powerfully confirmed.\n• God made living things to reproduce according to their kind. The taxonomic science of baraminology seeks to classify modern and fossil organisms within their original kinds.\n• Secular scientists often boldly declare that creationists aren’t “real” scientists. History and many modern, well-educated scientists would disagree!\n• Why Do So Many Reject Creation Science? Why do 98% of professional scientists accept evolution? This page seeks to answer these questions by documenting the behavior of opponents of young-earth creation science.\n• Many of the common perceptions of creation and arguments against creation are merely misrepresentations of the true creationist position.\n• For many years, creation researchers have been studying the biblical record and the world around us to understand the history that God’s Word records.\n• Can Statistics Tell Us Whether Dinosaurs Had Feathers? What are the limitations and possible pitfalls of statistical baraminology?\n• How God is the ultimate foundation for mathematics. Math has sometimes been revered as supreme and final truth...until a mathematician proved we must look higher.\n• Researchers are attempting to take species closely related to extinct ones and, using DNA from preserved specimens, to recreate the extinct species.\n• A name like “Creation Research, Science Education Foundation (CRSEF)” may not capture much attention. But dinosaurs sure will.\n• Several scientists share their favorite examples of Bible-based predictions that led to demonstrably true scientific discoveries.\n• Dr. David DeWitt responds to claims that the creation model is not scientific and does not make predictions.\n• from Did God Use Evolution? Certain statements which appear constantly in evolutionist publications, should make us prick up our ears.\n• 10 Basics Every Creationist Must Know Every Christian who stands unashamedly on the authority of God’s Word should be ready to show how the Bible unlocks our understanding of the world.\n• A creationist dig site in eastern Wyoming has set a new standard of excellence in fossil fieldwork.\n• To understand fossils, we either begin with God’s Word or with human opinion that rejects God’s Word. Our starting point makes all the difference in the world.\n• from Did God Use Evolution? Bible-believing Christians ought to know that there are no scientific philosophical objections today which prohibit the use of the Bible for explaining the facts of nature (creation science).\n• The more I learn about creation science, the more excited I get about my Savior and my God.\n• Why the Land of Milk and Honey Is Now a Desert In the biblical view of history after the Flood, how is it possible that the dry Middle East of today was once fertile?\n• Look Only at Spiritual Fruit? Does spiritual fruit trump disdain for the clear teachings of Scripture? Tim Chaffey, AiG–U.S., shows why faith in Christ and adherence to His Word must work together.\n• After finding our site, a reader claims to have had his good day ruined because of our “brainwashing.” Bodie Hodge, AiG–U.S., answers his objections and points him to “goodness” that won’t fade.\n• Is There an “Ultimate Proof of Creation”? Many creationists are looking for a “magic bullet” to prove creation is true. The proof, however, is not simply in the evidence.\n• Can scientists be unbiased? What are the limits of science? And were earlier scientists simply cowed into creationism by the Inquisition?\n• It has always been an interesting historical point that the contemporary creation movement began not in the pulpit, but in the laboratory.\n• What is the nature of truth? Can facts be refuted by science? Roger Patterson, AiG–U.S., addresses an attack on his book series Evolution Exposed.\n• By going back to God's Word, we can see the world much more clearly.\n• Science is an essential activity of the church.\n• The editor of the Answers Research Journal has received and identified the first attempt at scamming the journal.\n• Does creation and a young universe, as revealed in the Bible, require “convoluted theories” to deal with the facts? Dr. Jason Lisle, AiG–U.S., responds.\n• Sometimes critics of Creation refer to the creation/evolution debate as “science vs. the Bible” or “reasoning vs. faith.” Of course, nothing could be further from the truth.\n• Would you like to see more creation material in your local public library or school library?\n• from The New Answers Book 1 When answering questions about the creation/evolution issue, I have often been accused of believing some strange things.\n• If scientific evidence causes a creationist model to change, we should not let that shake our confidence in the accuracy and authority of Scripture.\n• from The New Answers Book 1 The laws of nature are perfectly consistent with biblical creation, and pose a serious problem for naturalism.\n• Are we all confused about biology, geology, and evolution?\n• “Putting Science and Its Studies in Their Proper Place” “It is about time someone really pointed out the fallacy that medicine and other science's cannot survive without the belief in evolution.”\n• “Why Are You so Bothered?” If we are creationists, does that mean we lack faith?\n• The claims of evolutionists and some old-earth creationists that young-earth creationists don't have real degrees and don't do real scientific research that can be published are simply not true.\n• Grand Canyon: A Different View is back in the headlines in America with a dispute over whether or not a federal review of the book actually took place.\n• “I hope that we, the debaters, regardless of opinion, can allow our discussions to encompass two of the wonders central to the human condition - thse of friendship and of reason.”\n• There has been much recent discussion about origins, how this world came into being.\n• The problem of poisons is considered, and it is concluded that a false dichotomy exists between poisonous and non-poisonous chemicals.\n• Following is a list of six words and phrases used by creationists. Pick the meaning beside each which you think comes closest to the true meaning of that word.\n• It Helps to Think Creation Can you think of one area where evolutionary thinking has ever helped? Does it make our children smarter or keep them off drugs? Does it put meat on the table or men on the moon?\n• Science teaching is made more than normally important, because science in the modern world has for many replaced God as the source of authority.\n• After two years of heavy involvement with the Creation Science Ministry in Queensland, I write this article to share some of our experiences and the reasons for our approach and our methods.\n• Any theory of the origin and history of life is a theory on the nature of life. Nowhere could this be more true, than theories or models or beliefs about the origin and history of man.\n• Creation is often criticized as being religious while evolution is scientific. In reality, both have religious aspects and both have points which are testable by repeatable observation.\n• Many Christians and churches cannot see the relevance of creation science.\n• Those who propose evolution of any sort (atheistic or theistic) usually raise one major criticism against creation.", "opengraph": {"title": "Creation Science", "url": "https://answersingenesis.org/creation-science/", "description": "Can Bible-based creation science make successful predictions, explain the evidence, and properly explain reality?", "image": "https://assets.answersingenesis.org/img/cms/content/contentnode/header_image/creation-science.jpg", "image:width": "945", "image:height": "300", "site_name": "Answers in Genesis", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.facebook.com/sharer.php?u=https%3A//answersingenesis.org/creation-science/&t=Creation%20Science", "https://twitter.com/intent/tweet?url=https%3A//answersingenesis.org/creation-science/", "mailto:?Subject=Creation%20Science&body=Take%20a%20look%20at%20this%20article%20I%20found%20on%20the%20Answers%20in%20Genesis%20website...%0A%0ACreation%20Science:%0A%0ACan%20Bible-based%20creation%20science%20make%20successful%20predictions%2C%20explain%20the%20evidence%2C%20and%20properly%20explain%20reality%3F%0Ahttps%3A//answersingenesis.org/creation-science/", "/creation-science/real-scientists-really/", "/creation-science/taking-god-out-of-the-equation/", "/creation-science/imagine/", "/creation-science/successful-predictions-creation-scientists/", "/creation-science/baraminology/", "/creation-science/baraminology/", "/creation-science/baraminology/", "/creation-scientists/", "/creation-scientists/", "/creation-scientists/", "/creation-science/why-do-so-many-reject-creation-science/", "/creation-science/why-do-so-many-reject-creation-science/", "/creation-science/why-do-so-many-reject-creation-science/", "/creation-science/top-ten-myths-about-creation/", "/creation-science/successful-predictions-creation-scientists/", "https://assets.answersingenesis.org/doc/articles/pdf-versions/successful-predictions-creation-scientists.pdf", "/creation-science/can-statistics-tell-us-whether-dinosaurs-had-feathers/", "/creation-science/taking-god-out-of-the-equation/", "/answers/magazine/", "/creation-science/why-bring-back-extinct-species/", "/creation-science/dinosaur-guys/", "/answers/magazine/", "/creation-science/field-trip/", "/answers/magazine/", "/creation-science/can-bible-based-predictions-lead-to-scientific-discoveries/", "/creation-science/does-the-creation-model-make-predictions-absolutely/", "/creation-science/78-danger-no-8-misinterpretation-of-reality/", "/answers/books/did-god-use-evolution/", "/creation-science/10-basics-every-creationist-must-know/", "/answers/magazine/", "/creation-science/mapping-out-the-truth/", "/answers/magazine/", "/creation-science/stumbling-stones-or-stepping-stones/", "/answers/magazine/", "/creation-science/15-some-consequences/", "/answers/books/did-god-use-evolution/", "/creation-science/imagine/", "/answers/magazine/", "/creation-science/why-the-land-of-milk-and-honey-is-now-a-desert/", "/answers/magazine/", "/creation-science/look-only-at-spiritual-fruit/", "/answers/feedback/", "/creation-science/a-good-day-ruined/", "/answers/feedback/", "/creation-science/is-there-an-ultimate-proof-of-creation/", "/creation-science/science-and-the-inquisition/", "/answers/feedback/", "/creation-science/the-wonderful-unscientific-teachings-of-christianity/", "/creation-science/searching-for-truth/", "/answers/feedback/", "/creation-science/the-wildest-goose-chase-in-scientific-history/", "/answers/magazine/", "https://assets.answersingenesis.org/doc/articles/pdf-versions/pp_106.pdf", "/creation-science/loving-science-loving-god/", "/answers/magazine/", "https://assets.answersingenesis.org/doc/articles/pdf-versions/pp_90-92.pdf", "/creation-science/caught-in-the-act/", "/creation-science/worldviews-and-occams-razor/", "/answers/feedback/", "/creation-science/the-ultimate-standard/", "/answers/in-depth/", "https://assets.answersingenesis.org/doc/articles/aid/v3/ultimate-standard.pdf", "/creation-science/bringing-balance-to-the-shelf/", "/answers/magazine/", "/creation-science/dont-creationists-believe-some-wacky-things/", "/answers/books/new-answers-book-1/", "/creation-science/can-creation-models-be-wrong/", "/answers/magazine/", "/creation-science/dont-creationists-deny-the-laws-of-nature/", "/answers/books/new-answers-book-1/", "/creation-science/confusion-on-biology-geology-and-evolution/", "/answers/feedback/", "/creation-science/putting-science-and-its-studies-in-their-proper-place/", "/answers/feedback/", "/creation-science/why-are-you-so-bothered/", "/answers/feedback/", "/creation-science/real-scientists-really/", "/creation-science/science-facts-or-science-fiction/", "/answers/feedback/", "/creation-science/the-great-divide-continues/", "/creation-science/non-creationist-compliments-aigs-intelligent-discussion/", "/answers/feedback/", "/creation-science/scientists-for-creation/", "/creation-science/understanding-poisons-from-a-creationist-perspective/", "/creation-science/test-your-knowledge/", "/creation-science/it-helps-to-think-creation/", "/creation-science/a-christian-creationist-view-of-teaching-science/", "/creation-science/creation-science-methodology/", "/creation-science/creation-as-science-part-3/", "/creation-science/creation-as-science-part-2/", "/creation-science/creation-science-in-the-churches/", "/creation-science/creation-as-science/", "/store/product/why-biblical-creation-good-science/?sku=30-9-492", "/store/product/why-biblical-creation-good-science/?sku=30-9-492", "/store/product/science-confirms-bible/?sku=30-9-414", "/store/product/science-confirms-bible/?sku=30-9-414", "/store/product/wonder-dna/?sku=30-9-673", "/store/product/wonder-dna/?sku=30-9-673", "/store/product/replacing-darwin/?sku=10-2-494", "/store/product/replacing-darwin/?sku=10-2-494"], "authors": [], "publish_date": null}