{"result_id": "032022", "URL": "https://answersingenesis.org/genetics/human-genome/human-genome-project-two-decades-dna-discovery/", "timestamp": "2023-04-25 12:05:58 CEST+0200", "meta": {"description": "Twenty years ago, US President Bill\r\n  Clinton declared the human genome\r\n  project “the most wondrous map ever\r\n  created by humankind.”", "lang": "en", "keywords": "", "favicon": "https://assets.answersingenesis.org/img/favicons/apple-touch-icon.png", "canonical": "https://answersingenesis.org/genetics/human-genome/human-genome-project-two-decades-dna-discovery/", "encoding": "utf-8"}, "image": null, "domain": "answersingenesis.org", "title": "Two Decades of DNA Discovery", "cleaned_text": "Twenty years ago, US President Bill Clinton declared the human genome project “the most wondrous map ever created by humankind.” The ambitious goal of this immense scientific research project was to identify all of the base pairs that make up human DNA and to map the sequence of all human genes. The “genome” is the collection of human DNA found in the nucleus of the cell.\n\nMapping our genome has already helped geneticists study mutated DNA responsible for cancers and other conditions. President Clinton predicted, “It will revolutionize the diagnosis, prevention, and treatment of most, if not all, human diseases.”1 He was right: “Essentially every new drug and vaccine is now based on genomics.”2 The human genome project has played an integral part in the development of new drugs for conditions such as asthma and cystic fibrosis.\n\nMore detailed studies of the human genome in the past 20 years have helped us understand that DNA has multiple layers of information. The genome is like an onion with many layers and lots of information encoded in each layer. We now know that the DNA between the genes, once thought of as “junk” DNA, isn’t worthless after all, but helps regulate the genes. Mutations in “junk” DNA can lead to disease. This knowledge can help us diagnose disease and find cures to mitigate the effects of the Genesis 3 fall.\n\nThe human genome project also revealed that there is only a small amount of DNA differences between any two individuals, and even fewer differences when it comes to DNA that encodes external characteristics (like skin shade). According to geneticist and lead researcher Craig Venter, the mapping project also illustrated that “the concept of race has no genetic or scientific basis.”3 Of course, we already know from Scripture that we are one race (Genesis 1; Acts 17:26). Now science confirms that truth.\n\nEven 20 years later, we have continued to discover more about our DNA. We can be certain that the complexity of the human genome could not have come about by random chance over long periods of time, but rather by divine design. Answers in Genesis geneticist Dr. Georgia Purdom states, “God says he can be known through what he has created (Romans 1:20), and DNA shows that we have an infinitely intelligent Creator.”", "opengraph": {"title": "Two Decades of DNA Discovery", "url": "https://answersingenesis.org/genetics/human-genome/human-genome-project-two-decades-dna-discovery/", "description": "Twenty years ago, US President Bill\r\n  Clinton declared the human genome\r\n  project “the most wondrous map ever\r\n  created by humankind.”", "image": "https://assets.answersingenesis.org/img/cms/content/contentnode/header_image/am/v16/n3/human-genome-project.jpg", "image:width": "945", "image:height": "300", "site_name": "Answers in Genesis", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["#fn_1", "#fn_2", "#fn_3", "/god/"], "authors": [], "publish_date": null}