{"result_id": "032038", "URL": "https://answersingenesis.org/blogs/ken-ham/2020/12/25/2020-what-year-this-has-been/", "timestamp": "2023-04-25 12:06:16 CEST+0200", "meta": {"description": "Don’t look to our world for hope, peace, and joy this Christmas. Look to Christ, who came to solve our sin problem and who is Lord over everything.", "lang": "en", "keywords": "", "favicon": "https://assets.answersingenesis.org/img/favicons/apple-touch-icon.png", "canonical": "https://answersingenesis.org/blogs/ken-ham/2020/12/25/2020-what-year-this-has-been/", "encoding": "utf-8"}, "image": null, "domain": "answersingenesis.org", "title": "2020—What a Year This Has Been!", "cleaned_text": "We’re almost at the end of 2020—many people are celebrating because, wow, what a year this has been! Certainly not what anyone would have predicted this time in 2019! Of course, 2021 is setting itself up to be just as crazy (if not more so!). Now, that may not seem like a very encouraging Christmas message, but hang in there—I’ll get to that!\n\nFor unbelievers, their hope is that 2021 won’t be as bad: that the COVID vaccine will start returning life to normal, that politics will sort itself out somehow, and that the economy will eventually recover. But as a Christian, if that’s what your hope is in, you’re looking in the wrong place!\n\nOur world is dark. It has been since Adam and Eve sinned and it will continue to be until Christ returns again. This year was a wake-up call to a largely lukewarm church that this world is dark and desperately needs the hope of the gospel. (I pray the church and individual Christians are responding to this wake-up call!) And it isn’t the first time such a “wake-up call” has happened.\n\nIf you read through God’s Word, you will see the darkness of our world, the sin that ensnares, entangles, and destroys, and the God who is sovereign over it all. You’ll see his mercy in breaking into our dark world with the Light of Christ—the God-man, “God with us,” who came as a babe in a manger.\n\nConsider Isaiah 9:2–7, a passage set in the context of great darkness:\n\nDon’t look to our world for hope, peace, and joy this Christmas—you’ll be disappointed. Look to Christ, who came to solve our sin problem and who is Lord over everything, having overcome the darkness.\n\nMerry Christmas from the Answers in Genesis, Creation Museum, and Ark Encounter family!\n\nThanks for stopping by and thanks for praying,\n\nKen\n\nThis item was written with the assistance of AiG’s research team.", "opengraph": {"title": "2020—What a Year This Has Been!", "url": "https://answersingenesis.org/blogs/ken-ham/2020/12/25/2020-what-year-this-has-been/", "description": "Don’t look to our world for hope, peace, and joy this Christmas. Look to Christ, who came to solve our sin problem and who is Lord over everything.", "image": "https://assets.answersingenesis.org/img/cms/content/contentnode/og_image/christmas-reminder-of-why-we-do-what-we-do.jpg", "image:width": "1200", "image:height": "628", "site_name": "Answers in Genesis", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["/sin/"], "authors": [], "publish_date": null}