{"result_id": "032014", "URL": "https://answersingenesis.org/charles-darwin/darwin-versus-compassion/", "timestamp": "2023-04-25 12:05:48 CEST+0200", "meta": {"description": "Darwin’s other writings reveal how barbarous evolutionary philosophy can be.", "lang": "en", "keywords": "Charles darwin,Natural selection", "favicon": "https://assets.answersingenesis.org/img/favicons/apple-touch-icon.png", "canonical": "https://answersingenesis.org/charles-darwin/darwin-versus-compassion/", "encoding": "utf-8"}, "image": null, "domain": "answersingenesis.org", "title": "Darwin Versus Compassion", "cleaned_text": "The full title of Darwin’s Magnum Opus is Origin of the Species by means of Natural Selection, or the Preservation of the Favoured Races in the Struggle for Life. Darwin’s other writings reveal how barbarous evolutionary philosophy can be:\n\nWith savages, the weak in body and mind are soon eliminated; and those that survive commonly exhibit a vigorous state of health. We civilised men, on the other hand, do our utmost to check the process of elimination; we build asylums for the imbecile, the maimed and the sick; we institute poor laws; and our medical men exert their utmost skill to save the life of everyone to the last moment. There is reason to believe that vaccination has preserved thousands who, from a weak constitution, would formerly have succumbed to smallpox. Thus the weak members of civilised society propagate their kind.\n\nNo one who has attended to the breeding of domestic animals will doubt that this must be highly injurious to the race of man. It is surprising how soon a want of care, or care wrongly directed, leads to the degeneration of a domestic race; but, excepting in the case of man himself, hardly anyone is so ignorant as to allow his worst animals to breed.\n\nThe aid which we feel impelled to give to the helpless is mainly an incidental result of the instinct of sympathy, which was originally acquired as part of the social instincts, but subsequently rendered in the manner previously indicated more tender and more widely diffused. Nor can we check our sympathy, even without deterioration in the noblest part of our nature … We must, therefore, bear the undoubtedly bad effects of the weak surviving and propagating their kind.", "opengraph": {"title": "Darwin Versus Compassion", "url": "https://answersingenesis.org/charles-darwin/darwin-versus-compassion/", "description": "Darwin’s other writings reveal how barbarous evolutionary philosophy can be.", "image": "https://assets.answersingenesis.org/img/cms/content/contentnode/header_image/charles-darwin.jpg", "image:width": "945", "image:height": "300", "site_name": "Answers in Genesis", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "March 19, 1998, midnight"}