{"result_id": "032031", "URL": "https://answersingenesis.org/human-evolution/thinking-biblically-about-transhumanist-technologies/", "timestamp": "2023-04-25 12:06:08 CEST+0200", "meta": {"description": "Examining biotechnology—from medical therapies to radical modifications", "lang": "en", "keywords": "", "favicon": "https://assets.answersingenesis.org/img/favicons/apple-touch-icon.png", "canonical": "https://answersingenesis.org/human-evolution/thinking-biblically-about-transhumanist-technologies/", "encoding": "utf-8"}, "image": null, "domain": "answersingenesis.org", "title": "Thinking Biblically About Transhumanist Technologies", "cleaned_text": "From governments to billionaires, powerful voices tell us we stand on the brink of a biotechnological revolution that will drastically alter humanity.1 Technologies that enable radical modification of human genes, bodies, thinking, reproduction, and communication already exist—and are rapidly advancing. Nearly 20 years ago, the President’s Council for Bioethics urged for greater public discussion of biotechnologies meant to “enhance” humans, recognizing that today’s choices will establish a trajectory that could shape society—and humanity—in unprecedented, unintended, and irreversible ways.2 Given the stakes involved, Christians need tools for thinking biblically and critically about each application of these technologies as they emerge.\n\nThe following discussion introduces these tools by comparing secular and biblical worldview foundations for thinking about enhancement, clarifying key distinctions for discussing enhancements, and suggesting a Christian framework for responding to enhancement technologies. First, a brief introduction to the topic of enhancement is in order.\n\nThe term “human enhancement” can mean anything from moderately improving someone’s natural abilities to radically modifying humankind. The latter is the vision of transhumanism, which seeks to technologically evolve humans into post-human—and possibly “Godlike”—beings.3 Recent tools to pursue this vision include brain-computer interfaces (BCIs), nanotechnologies, and gene-editing tools like CRISPR. Although these tools’ limitations lead some scholars to question if biotechnology can “evolve” humans the way transhumanists imagine,4 visions of enhancement continue to capture public, government, and military attention.5\n\nNot all applications of enhancement-enabling biotechnologies may fall under the same ethical categories. Not only can different technologies entail different ethical implications, but different applications of a single technology may entail different implications depending on purpose, consequences, and context. Such applications require case-by-case considerations, which will often depend on a person’s worldview.\n\nA secular worldview assumes humans evolved through natural processes. Without a knowable Creator as the source of truth, humans become their own “creators” and authorities. Consequently, secularism cannot supply an objective, consistent, overarching foundation for concepts including morality, human value, or human meaning.6 Secularism’s evolutionary outlook also sees human “nature” as strictly material and openly changeable, resulting in a poietic view which, according to Carl Trueman, “sees the world as so much raw material out of which meaning and purpose can be created by the individual.”7 This outlook finds its ultimate expression in transhumanism, which views human bodies as raw material for creating a post-human reality.\n\nDespite lacking a moral foundation for viewing death and suffering as bad, secular transhumanists do generally recognize these as problems demanding a savior.8 The transhumanist hope is that technology will serve as messiah, creating a utopia freed from finitude. However, not only does this framework conflict with a biblical view of sin and salvation,9 but secular transhumanist concepts also self-contradict.10 For instance, having no objective standard of goodness means having no objective standard of enhancement. Secular transhumanists must also borrow moral content from outside secularism to claim that enhancements—not to mention the concepts of liberty, autonomy, and utopia so prevalent in transhumanist arguments—are good.\n\nThese inconsistencies do not just pose theoretical problems, but also practical ones. For instance, while goals of furthering human evolution do not guarantee consequences like eugenics and Social Darwinism, transhumanism’s aims are certainly consistent with these outcomes—especially given secularism’s lack of foundations for morality and human value. The rise of an enhanced elite with power to outcompete—or eliminate—the unenhanced would be the ultimate testament to Darwin’s “survival of the fittest.”11 Correspondingly, it may be no surprise that the person who popularized the term transhumanism was Julian Huxley,12 the evolutionary biologist (and first Director-General of UNESCO) who served from 1959–1962 as the president of the British Eugenics Society.13 In sum, a eugenics mentality plus an enhanced elite plus powerful biotechnology minus a foundation for morality would total an unimaginably precarious equation.\n\nIn contrast to secularism, a biblical framework for thinking about enhancement begins with Genesis, which reveals that God designed an orderly universe with distinctions between Creator and creation, humans and nonhumans, and men and women. Having deemed his completed creation very good (Genesis 1:31),14 God rested from creating, as Genesis 2:1–2 twice underscores.15 These Genesis truths point to a givenness in nature, consistent with a mimetic view which, according to Trueman, “regards the world as having a given order and a given meaning”16 to which humans must conform themselves.\n\nGenesis further indicates that God created humans in his image as relational, embodied beings called to steward creation.17 Individually, we are also called to fulfill good works for which God created us as the unique persons whose bodies he lovingly knitted.18 We do not own our bodies to use however we choose19—much less to recreate ourselves into beings other than humans. Instead, the concept of an essential human nature appears to be taken for granted throughout Scripture20 and is foundational to much orthodox theology. For instance, the doctrines of the incarnation, atonement, and redemption entail that God took on human nature as the second Adam to save descendants of the first Adam.21\n\nIt was this first Adam’s sin which corrupted creation, resulting in brokenness, death, and suffering. While humans have always been finite in relation to God, we are now also fallen and able to die. Loving others carries new responsibilities in this fallen world, such as caring for the vulnerable, exercising wisdom in light of human fallenness, and mitigating the fall’s effects by easing others’ suffering. But contrary to transhumanist dreams, we cannot defeat sin’s effects ourselves.22 Instead, we hope in our Savior, Jesus, who conquered death and will restore creation.\n\nTheological Positions on Enhancement: Are Humans “Co-Creators” with God?\n\nThis biblical worldview supplies a Christian foundation for thinking about enhancements. But not all professing Christians reach the same conclusions. Various theologians and Christian ethicists conclude that enhancements are prima facie immoral for trespassing against God’s given designs;23 some, however, argue that limited enhancements may be allowable, provided they do not pose other concerns or transform humans into nonhumans.24 Still others fully embrace radical human modification.25 A common argument for such “Christianized transhumanism” comes from Philip Hefner’s view of humans as “created co-creators.”26 Advocates for this concept argue that, as beings made in their Creator’s image, humans are meant to join God in creating humanity.27 However, a closer look reveals this concept is not biblical.\n\nFor instance, while humans are creative as image-bearers, we are not creators on a level with God,28 who creates ex nihilo.29 Correspondingly, one scholar notes that Scripture uses the Hebrew word create (בָּרָא, bārā') almost 50 times in relation to God, but only 4 times—none of which refer to literal creative acts—in relation to humans.30 As Psalm 100:3 (NKJV) declares, “It is He who has made us, and not we ourselves. . . .” Not only does this passage reaffirm the Creator-creation boundary, but the verb tense of has made also echoes that God completed creation.31 While we are called to steward creation, Genesis nowhere indicates that we are meant to “co-create” ourselves further.32\n\nSo, if the co-creator idea does not come from Scripture, where does it come from? It is rooted in Hefner’s highly unorthodox, theistic-evolution-based revisions of core biblical doctrines including sin,33 the dual nature of Christ,34 the cross, and the atonement,35 that heretically claim that Jesus died, not to pay humanity’s sin debt, but to show how to advance evolution.36 These revisions are not peripheral to Hefner’s co-creator concept; rather, Hefner states that his chapter section on “Revising Christological Doctrines” conveys “the heart of the actual content of the program for the created co-creator.”37\n\nAdopting the evolutionary view that humans are continuous with nature, Hefner also reinterprets God’s image as something which applies to all nature.38 This reinterpretation carries major problems from a Christian ethics perspective, undermining the biblical view that God’s image sets humans apart from animals and imbues humanity with unique responsibilities and rights.39 Furthermore, the idea that humans lack a unique image-bearing nature means that whatever God deemed very good about humans must not be our nature but our changeability, leaving no basis to respect humans as they are.40 Ultimately, Hefner’s created co-creator concept is incompatible with biblical doctrines and biblical ethics, so it cannot serve as the basis for a biblical response to enhancement technologies. Rather than starting from theistic evolutionary reinterpretations of Scripture, a biblical response to these technologies must begin from the foundation of a commitment to the authority of God’s Word.\n\nThree Distinctions for Thinking About Enhancements\n\nWhen assessing specific enhancement technologies from this biblical foundation, three distinctions are especially useful: (1) normal vs. enhanced states, (2) therapies vs. enhancements, and (3) tools vs. modifications. All three distinctions have blurry boundaries, complicated by the fact that ideas about what is normal, healthy, or diseased may vary by culture or across time.41 However, a distinction between concepts is not disposable simply because the concepts’ boundaries are vague.42 To say otherwise would be an informal logical error known as the continuum fallacy. For instance, Soren Holm and Mike McNamee point out that shades of red and yellow may blur into one another, yet the conceptual difference between red and yellow remains real and useful—especially at traffic lights.43\n\nCorrespondingly, distinctions between concepts like normal and diseased remain useful despite vagueness. Pinpointing detailed definitions of health and disease surpasses the scope of this discussion; however, to the extent that healthy and diseased states are recognizable in practice, normal states can be understood for this discussion as those which fall within the range of natural human variation without qualifying as diseased.44 Such a definition provides an imperfect but largely practical baseline for discerning normal states from enhanced states.\n\nThe second distinction to clarify is enhancement vs. therapy. Because therapies are generally considered ethical, a number of ethicists use this distinction to gauge if a relevant biotechnological intervention is acceptable.45 Others, however, object that enhancement and therapy are overlapping concepts.46 Eyeglasses, for instance, enhance vision, while some say vaccines enhance already-healthy immune systems.47 However, much conceptual blurriness can be erased by defining therapy as the preservation or restoration of normalcy.48 This definition would assert that both glasses and vaccines function therapeutically, restoring vision or preventing disease.49\n\nTo further clarify the boundaries of what counts as an enhancement, Claudio Tamburrini and Torbjorn Tannsjo suggest distinguishing between three categories of interventions this way: (1) negative medical interventions are therapeutic, (2) positive interventions improve a trait within the naturally occurring human range, and (3) proper enhancements “take an individual beyond normal functioning.”50 These categories are not always clear-cut, especially if certain therapies may carry individuals beyond normal function (albeit, potentially with certain trade-offs).51 However, the fact that such cases can occur in individual medical contexts does not logically provide moral grounds for a radical enhancement free-for-all. It is also worth repeating that a boundary is not useless simply because it may be blurry.\n\nAfter recognizing the enhancement-therapy boundary’s validity, the task remains to show its moral significance.52 While secularism cannot supply moral content to condemn or condone either enhancements or therapies, Christians can seek moral guidance from God’s Word. As noted above, Scripture not only portrays humanity’s embodied nature as given and good, but also indicates that individuals are knit together by God for specific good works.53 The reality that we have been fashioned by a sovereign, loving, all-knowing Creator suggests that ambitions to transcend human or individual traits (which do not reflect results of the fall) are inappropriate.54\n\nBiblical morality also affirms contented, thankful stewardship of God’s gifts.55 However, Scripture condemns covetousness, pride, greed, idolatry, ingratitude, complaining, selfish ambition, and disobedience to God—all of which reflect plausible factors in humanity’s fall.56 So Christians can expand on the therapy-enhancement distinction by considering whether an intervention primarily mitigates the fall’s effects or mirrors the fall’s causes.57 Medical therapies aim to mitigate effects of suffering, as Jesus did through healing.58 Absent other concerns, therapeutic applications of dual-use technologies thus seem justifiable—especially if alternative treatment options cannot suffice. But interventions involving covetous, hubristic desires to be “like God,” or other forms of rebellion mirror the cause of the fall, qualifying as immoral.59 By factoring in motives and conveying moral significance, the mitigating-mirroring distinction may be more useful for Christian ethics than a simpler enhancement-therapy distinction.\n\nAnother distinction to consider is whether an enhancement functions primarily as a tool or an ontological modification.60 Tools are often thought of as devices we pick up, interact with via our bodies (as opposed to our thoughts alone), and then let go. Ontological modifications, in contrast, are bodily alterations meant to change humans into something other than what they are.61 Some interventions—for example, a gene-editing initiative to transform humans into aquatic creatures—would most obviously count as modifications. But wearable devices (that do not bypass bodily mediation by interfacing directly with the brain) may function more as tools, which humans use and remove while remaining their embodied, finite selves.\n\nWhat about devices embedded in the body? While strictly therapeutic devices like pacemakers only mitigate the fall’s effects, many invasive devices may be dual-use technologies with both therapeutic and non-therapeutic applications.62 A helpful step in these cases is to consider the relationship between the body and the device. The more immediacy, intimacy, invasiveness, and permanency a device has relative to the body, the more a device bypasses bodily mediation; and the more a device is meant to alter humans ontologically, the more the device resembles a modification rather than a mere tool.63\n\nAlong with these distinctions, Christians need to consider basic ethics questions for evaluating enhancement technologies. An initial question to ask (even before applying the above distinctions) is whether human life is harmed in making or using the technology, rendering its application unethical. The next questions to ask concern an intervention’s foreseeable risks vs. benefits. This step requires carefully considering the intervention’s possible unintended consequences, recognizing that—on a fallen planet filled with fallen people—technologies often carry significant potential to harm as well as to help. When identifying these possible consequences, three key areas to consider include the technology’s effects on (1) humans as a species, (2) humans as a society, and (3) humans as individuals.\n\nTwo central questions to ask regarding humans as a species concern how a technology may affect our creaturely embodiment and God-given relationality. For instance, Lee Johnson observes that enhancement initiatives to largely replace human bodies with technology demand caution in light of Scripture’s emphasis on the body’s importance.64 Similarly, enhancements that involve directly linking devices with the brain may bypass our embodiment—and alter our self-identities65—in ways which pose concerns from a mimetic perspective of bodily givenness. Likewise, enhancements that enable direct brain-to-brain communication66 may affect our relationality by sidestepping the bodily mediation which interpersonal interactions otherwise require.\n\nAssociated with a technology’s effects on relationality are its effects on society. For instance, a common objection to enhancements states that these interventions would introduce destructive gaps between those with and without enhancements,67 raising ethical concerns complicated by questions of whether enhancements represent appropriate uses of medical resources.68 C. Ben Mitchell and his coauthors describe how enhancements could alter entire occupations, strongly pressuring professionals to enhance themselves and triggering downstream societal effects, including the need for greater social coordination, monitoring, and control.69 Other social consequences may include increased body dysmorphia, commoditization of the body (and—in cases like the creation of enhanced “designer babies”—commoditization of children), and widespread eugenics mentalities.70\n\nCompounding these issues are consequences for humans as individuals. For example, if enhancements become ubiquitous, would pressure to enhance grow increasingly coercive? If so, such coercion would compromise individuals’ ability to provide informed consent for enhancement procedures—an ability already complicated by the unknown effects of novel biotechnologies.71 These challenges are amplified when parents wish to enhance children, who are incompetent to provide consent.72 Additional concerns include consequences for individuals’ privacy, freedom, and autonomy, which BCI-related enhancements may especially compromise.73 Considerations of such risks can be particularly difficult because humans lack omniscience to predict all the interacting effects that a novel biotechnology may trigger. Because humanity’s Creator is omniscient, those who attempt to improve on God’s blueprints may learn the hard way why humans are designed as they are.\n\nIn summary, biblical principles, conceptual distinctions, and general ethics considerations combine to give Christians a framework for responding to specific enhancement interventions. The first step is to identify major topical issues surrounding the intervention and consider how biblical principles speak to each.74 Another initial question is whether human life is harmed through the intervention. If no moral issues are yet apparent, the next step is to identify the nature of the intervention using the conceptual distinctions addressed above. The more an intervention mirrors the fall’s cause or seeks to transcend God’s given design, the more morally suspect it becomes. Finally, Christians must apply basic ethical considerations to gauge whether the intervention is unwise. Then, by saying yes to technological applications which mitigate the effects of the fall, saying no to applications which mirror the cause of the fall, and embracing an embodied, relational life of thankful, contented stewardship, Christians can model genuine human flourishing amidst the biotechnological revolution. Meanwhile, believers must also communicate the message of hope which no enhancement intervention can supply, showing that the way to abundant life is found not in transhumanist efforts, but in our embodied Savior, Jesus.", "opengraph": {"title": "Thinking Biblically About Transhumanist Technologies", "url": "https://answersingenesis.org/human-evolution/thinking-biblically-about-transhumanist-technologies/", "description": "Examining biotechnology—from medical therapies to radical modifications", "image": "https://assets.answersingenesis.org/img/cms/content/contentnode/og_image/transhumanism.jpg", "image:width": "1200", "image:height": "628", "site_name": "Answers in Genesis", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["#fn_1", "/genetics/crispr-clear-cut-issue/", "/human-evolution/questions-brain-computer-interfaces/", "#fn_2", "/apologetics/tools-critical-thinking/", "/worldview/only-two-worldviews/", "/christian/", "/blogs/calvin-smith/2022/02/22/post-humans-in-the-metaverse/", "#fn_3", "/human-evolution/questions-brain-computer-interfaces/", "/genetics/crispr-clear-cut-issue/", "#fn_4", "#fn_5", "/morality/morality-and-the-irrationality-of-an-evolutionary-worldview/", "#fn_6", "#fn_7", "#fn_8", "#fn_9", "#fn_10", "/human-evolution/are-there-transhumans-in-our-future/", "/sanctity-of-life/eugenics/what-about-eugenics-and-planned-parenthood/", "/charles-darwin/darwinism/religion-of-nature-social-darwinism/", "#fn_11", "#fn_12", "#fn_13", "/the-word-of-god/what-is-a-biblical-worldview/", "#fn_14", "#fn_15", "#fn_16", "/are-humans-animals/gods-image-difference-maker/", "/environmental-science/stewardship/caring-about-creation-right-reasons/", "#fn_17", "#fn_18", "#fn_19", "#fn_20", "#fn_21", "/death-before-sin/biblically-could-death-have-existed-before-sin/", "#fn_22", "/creation/", "#fn_23", "#fn_24", "#fn_25", "#fn_26", "#fn_27", "#fn_28", "#fn_29", "#fn_30", "#fn_31", "#fn_32", "#fn_33", "#fn_34", "#fn_35", "/blogs/calvin-smith/2022/01/17/biologos-heresy-and-false-teaching-part-1/", "#fn_36", "#fn_37", "#fn_38", "#fn_39", "#fn_40", "/god/", "#fn_41", "#fn_42", "#fn_43", "#fn_44", "#fn_45", "#fn_46", "#fn_47", "#fn_48", "#fn_49", "#fn_50", "#fn_51", "#fn_52", "#fn_53", "#fn_54", "#fn_55", "/sin/the-first-sin/", "#fn_56", "#fn_57", "#fn_58", "#fn_59", "#fn_60", "/human-evolution/questions-brain-computer-interfaces/", "#fn_61", "#fn_62", "#fn_63", "#fn_64", "#fn_65", "#fn_66", "#fn_67", "#fn_68", "#fn_69", "/genetics/gene-editing-and-designer-babies-why-future-desperately-needs-us/", "#fn_70", "#fn_71", "#fn_72", "#fn_73", "#fn_74", "/jesus/"], "authors": [], "publish_date": "Jan. 11, 2023, 6 a.m."}