{"result_id": "032028", "URL": "https://answersingenesis.org/natural-selection/antibiotic-resistance/making-the-evolution-pill-easier-to-swallow-part-3/", "timestamp": "2023-04-25 12:06:05 CEST+0200", "meta": {"description": "In her final installment discussing a recent conference on medicine and Darwin, Dr. Georgia Purdom, AiG–U.S., reveals how confused one presenter was about natural selection and evolution.", "lang": "en", "keywords": "E. coli,Antibodies,Science", "favicon": "https://assets.answersingenesis.org/img/favicons/apple-touch-icon.png", "canonical": "https://answersingenesis.org/natural-selection/antibiotic-resistance/making-the-evolution-pill-easier-to-swallow-part-3/", "encoding": "utf-8"}, "image": null, "domain": "answersingenesis.org", "title": "Making the Evolution Pill Easier to Swallow, Part 3", "cleaned_text": "In her final installment discussing a recent conference on medicine and Darwin, Dr. Georgia Purdom, AiG–U.S., reveals how confused one presenter was about natural selection and evolution.\n\nThe following is part 3 of a series of articles reviewing presentations given as part of the program “Your Genes and You: Health, Disease, and Medicine” offered by the University of Cincinnati in 2009. (For more see, Part 1 and Part 2.)\n\nThe fifth presentation in the program was entitled “Vaccines and Drugs Versus the Evolving Microbe: It’s Personal and It’s a War.” This presentation focused mainly on natural selection and mutations in bacteria and viruses (collectively called microbes) that can lead to drug-resistant microbes.\n\nThe terms evolving and evolution used in the context of this presentation should have been clearly defined as meaning “adaptation” or “limited change in a population over time,” but unfortunately this never happened. Instead the audience is left to believe that this is referring to the commonly accepted definition of evolution as “descent with modification from a common ancestor” (molecules-to-man evolution). This is done to reinforce the concept that Darwin’s evolutionary ideas are necessary for modern medicine.\n\nThe presenter talked about the polio vaccine and stated it was successful in preventing polio because the polio virus is not evolving rapidly, and, therefore, “Darwinism is not active.” Again, equating Darwinian evolution (molecules-to-man evolution) with adaptation (limited change within a population) is deceptive. No reason was given as to why the polio virus and other microbes that cause childhood diseases like mumps and measles are slow to change. As a molecular biologist and microbiologist, I am personally intrigued by this but do enjoy the benefits of vaccinations—especially as it concerns my five-year-old daughter!\n\nAn interesting fact about polio is that it was not a common disease before the 1900s due to poor sanitation. People were commonly exposed to polio viruses and developed antibodies, which could then be passed to infants through breast milk. Infants would become infected with the poliovirus but would only develop a mild disease because of the protection of the mother’s antibodies. The infants would then develop their own antibodies to the polio virus and never suffer the severe form of the disease.\n\nBetter sanitation after the 1900s led to decreased exposure to the virus, meaning no maternal antibodies and exposure to the virus typically occurred later in life. Children were not immune and thus developed a severe form of polio. This equates well to my thinking that it is sometimes good to let your kids eat dirt! Not that you should literally let children eat dirt, but rather the principle that it is a good thing for your children to play outside, be around animals, and get dirty once in a while. This increases their exposure to microbes and helps them build a strong immune system. Multiple studies have shown this to be true.\n\nThe presenter stated that other microbes, such as the influenza virus, evolve quickly, and, therefore, “Darwinism is in full force.” This means that mutation and natural selection allow the organism to change and adapt quickly to its environment (again, not molecules-to-man evolution).\n\nThe flu shot or vaccination we receive each year is only good for one flu season, since the influenza virus is rapidly changing. The influenza virus can mutate quickly, pick up genes from its hosts, and swap genes with other viruses. Thus, the “dead” influenza virus given to us in a flu shot (which we develop antibodies against) during one flu season may be very different from the influenza virus that will be infecting people the next flu season (which we have no antibodies against). This is true for other microbes such as HIV and Mycobacterium tuberculosis.\n\nAt the end of the presentation, a slide entitled “Some take home [sic] lessons” stated, “Darwinian evolution applies to microbes as well as to plants and animals.” But this is not true. Jacques Monod is quoted as saying, “Anything found to be true for E. coli [bacteria] must also be true of elephants.”1 This was in reference to biochemistry that is similar in bacteria (E. coli) and animals (elephants).\n\nHowever, the effects of mutation and natural selection are very different for microbes and animals, plants, and humans. Population sizes, generation times, genome complexity, and the pressure of the environment are very different for microbes versus most other living organisms. These differences allow bacterial populations to change and survive quickly in adverse environmental conditions, but the same is not true for plants, animals, and humans (for a more in-depth analysis of this issue see A Creationist Perspective of Beneficial Mutations in Bacteria). Regardless, mutations and natural selection lead to a decrease in information for every organism and do not add the genetic information needed for molecules-to-man evolution.\n\nSeveral of the presentations given in this series made no reference to evolution or only a passing referencing. It was obvious that some presenters were really stretching for connections. For example, in one presentation dealing with a particular disease, the presenter had a slide stating, “Evolutionary conservation of critical cellular pathways and processes enables scientists to use simpler organisms such as fruit flies and worms to decipher human disease.” However, I could approach studying the disease very similarly as a creationist and say, “God’s design conservation of critical cellular pathways . . . .”\n\nSince the study of the disease falls under the category of operational science, how the organisms used in the study came to have similar cellular pathways is irrelevant. Both evolutionists and creationists studying the disease would likely come to the same conclusions.\n\nThe bottom line is that molecules-to-man evolution is completely irrelevant to modern medicine.\n\nOverall, the presentations were very informative and worth my time. I gained a greater appreciation for the complexity of the genome, how small differences in DNA can lead to very bad consequences for an individual, and how local scientists and physicians are actively doing research that will lead to better understanding and treatment of human diseases in the future.", "opengraph": {"title": "Making the Evolution Pill Easier to Swallow, Part 3", "url": "https://answersingenesis.org/natural-selection/antibiotic-resistance/making-the-evolution-pill-easier-to-swallow-part-3/", "description": "In her final installment discussing a recent conference on medicine and Darwin, Dr. Georgia Purdom, AiG–U.S., reveals how confused one presenter was about natural selection and evolution.", "image": "https://assets.answersingenesis.org/img/cms/content/contentnode/header_image/antibiotic-resistance.jpg", "image:width": "945", "image:height": "300", "site_name": "Answers in Genesis", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["/genetics/making-the-evolution-pill-easier-to-swallow-part-1/", "/genetics/mutations/making-the-evolution-pill-easier-to-swallow-part-2/", "/evolution/", "http://www.sciencedaily.com/releases/2007/10/071016135444.htm", "#fn_1", "/genetics/mutations/a-creationist-perspective-of-beneficial-mutations-in-bacteria/", "/genetics/mutations/are-mutations-part-of-the-engine-of-evolution/", "/natural-selection/is-natural-selection-the-same-thing-as-evolution/", "/god/", "/what-is-science/what-is-science/"], "authors": [], "publish_date": "Nov. 16, 2009, midnight"}