{"result_id": "032020", "URL": "https://answersingenesis.org/coronavirus/genesis-sars-cov-2-virus-and-origin-covid-19-pandemic/", "timestamp": "2023-04-25 12:05:55 CEST+0200", "meta": {"description": "In this paper the origin and genesis of COVID-19 are postulated, and the epidemiological/ecological aspects of the disease and biblical perspective are shared.", "lang": "en", "keywords": "Bible,Biblical,Coronavirus,Origin,Origins", "favicon": "https://assets.answersingenesis.org/img/favicons/apple-touch-icon.png", "canonical": "https://answersingenesis.org/coronavirus/genesis-sars-cov-2-virus-and-origin-covid-19-pandemic/", "encoding": "utf-8"}, "image": null, "domain": "answersingenesis.org", "title": "The Genesis of SARS-CoV-2 Virus and the Origin of the COVID-19 Pandemic", "cleaned_text": "The current outbreak of the 2019 novel coronavirus (SARS-CoV-2, fig. 1), causing a respiratory-tract illness, first started in Wuhan, China, and has been escalating worldwide. The official disease name became known as COVID-19 in mid-spring 2020. It shares some characteristics of the SARS virus of 2002–3. Early on, with many cases in Wuhan, China, it was reported that the outbreak had some association with animal markets, which indicated that there was animal-to-person transmission. Like SARS-CoV-1, the suspected animal source of the virus is bats. We have not seen this virus before, and our bodies were not ready for this, nor was the world ready for the pandemic. The microbiology is fascinating; however, the effects on humanity have been heartbreaking as the virus has become widespread. The highly contagious nature of SARS-CoV-2 is greater than the seasonal flu, SARS 1, MERS, and most diseases that mankind has encountered since the Spanish Flu (Influenza H1N1) of 1918–19.\n\nThe transmission of the disease has been found to be human-to-human contact. There is no known vaccine that has been tested beyond Phase 2. Additionally, different treatment options are being tested and used in patients who have COVID-19, but a universally effective treatment of the virus has not been found yet. In this paper, the origin and genesis of COVID-19 are postulated. Additionally, the epidemiological/ecological aspects of the disease and biblical perspective are shared. Lastly, the epidemiology of the COVID-19 pandemic is projected along with a discussion of the biblical perspective on the plagues and pestilences.\n\nNew Diseases and Plagues in Headlines\n\nThe outbreak of COVID-19, a “new” form of severe acute respiratory syndrome has caused worldwide panic. A new form of a virus that has resemblance to some forms of the common cold in humans was behind the rapidly emerging SARS-CoV-2 phenomenon, according to the National Centers for Disease Control and Prevention, or CDC (fig. 2). The CDC presented strong evidence that this highly contagious coronavirus was, if not the primary cause of the illness, at least a major contributor. The CDC is part of a network of 11 leading international laboratories formed by the World Health Organization, or WHO, which determined a cause as well as treatments for SARS-CoV-2. Not only were CDC researchers able to grow the virus in the laboratory with cultures from two SARS patients but also they found evidence of the previously unknown strain in tissue samples from affected patients (CDC 2020). The viral RNA sequence appears to be a mixture of coronaviruses isolated in bats and humans. Based on current knowledge, the most probable ancestry of the novel coronavirus is natural, i.e., not man-made, but its exact ancestral lineage may remain a mystery.\n\nCOVID-19 has caused 8 million infections worldwide and about 438,000 deaths globally (mid-June 2020) with about 2 million infections and over 100,000 deaths in the U.S. (Johns Hopkins 2020). These numbers continue to increase daily. Some countries (ex. New Zealand) have minimal infections and deaths, perhaps due in part to strict lockdowns. This is not a new practice or one which originated merely in human intellect. We read in Leviticus 13:46 about controlling infectious diseases by quarantining those who have them.\n\nCOVID-19 may have dominated the headlines during early 2019–20, but it wasn’t the only emerging disease on the WHO’s radar screen that year. In central Africa, an outbreak of the dreaded hemorrhagic fever had stretched into months. COVID-19, Ebola, and influenza—the parade of frightening new maladies continues, each one confirming that our species, for all its cleverness, still lives at the “mercy” of microbes. In fact, over 50 new or emerging diseases have occurred since the 1970s. One of the major contributors to new and emerging diseases is urban sprawl into previously wilderness, jungle, or desert environments. Man and his livestock coming into contact with wild animals and their “germs” results in a mixing of genetic information between the pathogens of domestic animals and wildlife. The viruses, pathogens, and parasites become displaced. Humans then come into contact with their pets and livestock carrying these new “germs,” and new strains of disease are born.\n\nScary stuff! How could a once-common virus lead to such terrible consequences? When terrible diseases come our way, believers in Jesus Christ can take refuge in the shadow of the Almighty. Psalm 91:3 says, “ For he will deliver you from the snare of the fowler and from the deadly pestilence. ” Although Christians are not exempt from terrifying diseases, it is true that they can and will find refuge in their Creator as pestilence, plague, and destruction rage. Christians are not called to fear these diseases, but to study and apply all known biblical principles (such as quarantine), to employ effective hygiene measures, and to seek professional medical help in times of crisis.1\n\nPlagues and Pandemics Not New\n\nDeadly plagues are not new to man. We read of deadly pestilence and infectious disease outbreaks throughout the Bible. In the Old Testament, we read about laws that Moses gave and some principles about washing, quarantine, and purification that when applied can prevent or control the spread of disease.\n\nFor years, physicians, priests, pastors, and laymen alike have all been asking, “Why are there new diseases?” Creation biologists and medical scientists alike are asking and trying to answer critical questions, such as:\n• Why do new diseases keep popping up?\n• What is the origin of these new, emerging diseases?\n• How do new human diseases spill over from animals?\n\nMan is unable to control many new disease outbreaks in rural, jungle, and desert environments. Most new diseases begin when a person catches something from an animal—a transaction that can be shaped even by weather. The dark side of progress is now unmistakable; many of the advances that have made our lives more comfortable have also made them more dangerous in many ways. So what’s to be done? As the SARS-CoV-2 outbreak has shown, surveillance is critical. By spotting new infections wherever they occur and working globally in some way to contain them, we can greatly reduce their impact. But is preparedness our ultimate weapon? Do we know enough about the genesis of new diseases to prevent them? Could we avert the next SARS-CoV-2? Or could we stop the next Ebola or pandemic flu? What would a reasonable strategy look like?\n\nCoronaviruses were discovered in the early 1930s when an acute respiratory infection of domesticated chickens was shown to be caused by a virus now known as avian infectious bronchitis virus (IBV). The first human coronaviruses (HCoV) were discovered in 1965. Research with human volunteers at the Common Cold Unit near Salisbury, UK, showed that colds could be induced by nasal washings that did not contain rhinoviruses. More experiments where nasal swabs were inoculated onto cultures of the respiratory tract revealed the presence of enveloped viruses with the characteristic shape of coronaviruses as previously described for causing bronchitis. The term coronavirus (Latin: corona, crown) was named for these viruses reflecting their characteristic fringed (crowned) appearance in the electron microscope after negative staining. Coronaviruses range in size from 80–120 nm (1/10 size of E. coli). The size of SARS-CoV-2, the virus that causes COVID-19, is about 120 nm, or 0.12 μ in diameter. N95 (masks) protect down to 0.1 μ, with 95% efficiency, which is why such masks have this name (fig. 3).\n\nCoronaviruses are now recognized in a range of animal species causing respiratory, gastrointestinal, nervous, and systemic diseases. Coronaviruses are positive-sense, single-stranded RNA viruses that mutate faster than any life-form because they lack proofreading mechanisms in replication (fig. 4). In contrast, DNA viruses and other life-forms have proofreading enzymes that check the genome in replication. The COVID-19 pandemic began as a collection of pneumonia cases in December 2019, in Wuhan, China. At first, the virus was identified as 2019-nCoV by the World Health Organization, WHO. Then, as it has been studied and examined more, WHO officially named the virus as SARS-CoV-2 or the cause of COVID-19 disease.\n\nCoronaviruses are members of the family Coronaviridae. This subfamily consists of four genera, or categories: alphacoronavirus (α-CoV), betacoronavirus (β-CoV), gammacoronavirus (γ-CoV), and deltacoronavirus (δ-CoV) on the basis of their shared genetic relationships and genomes. Among the categories, SARS-CoV-2 is a β-CoV. In the variety of the different coronaviruses, there have been six separate strains that are known to infect humans. In the six strains, four of them have low pathogenicity and cause mild symptoms. Although the other two strains, SARS-CoV and MERS-CoV, are more severe and can be fatal. SARS-CoV-2 is among the severe strains of coronavirus, more specifically from the SARS-CoV strain. This has been tested and proven through comparing SARS-CoV-2 with the bat CoV and SARS-CoV. SARS-CoV-2 was 96% identical to bat CoV and 80% identical to SARS-CoV, the virus that caused SARS in 2003. The two highly pathogenic viruses, SARS-CoV and MERS-CoV, cause severe respiratory syndrome in humans, and the other four human coronaviruses induce only mild upper respiratory diseases (i.e. colds) in healthy people, although some of them can cause severe infections in infants, young children, and senior citizens.\n\nAccording to the CDC (2020), individuals suffering with COVID-19 experience a wide range of symptoms ranging from mild to severe illness. COVID-19’s symptoms are similar to influenza symptoms which include fever, cough, shortness of breath, and difficulty breathing. In severe cases, acute pneumonia, severe respiratory syndrome, renal insufficiency, and even death can occur (fig. 5). Symptoms may appear 2–14 days after exposure to the virus.\n\nIn order to better understand the background and important factors of COVID-19, it is vital to look further into the origin of it. Bat coronaviruses SARS-CoV and MERS-CoV, a type of bat coronavirus that passes through camels, were strains that appeared before the SARS-CoV-2 strain. In 2002 and 2003, there was an outbreak with SARS-CoV that killed 774 people before it was able to be controlled. Then, in 2012, there was an outbreak with MERS-CoV that killed 884 people. Despite those outbreaks happening, scientific research was more focused on significant viruses such as influenza. A few scientists tried to warn about a harmful potential re-emergence of the SARS-CoV, but those warnings were not heeded. Now that SARS-CoV-2 has been studied more since it has started a pandemic, researchers have learned more about its structure and mutations within the strain that have caused it to become the deadly virus scientists feared it would become.\n\nScientists confirmed that SARS-CoV-2 uses the same human body cell entry receptor—angiotensin-converting enzyme II (ACE2)—as SARS-CoV-1. This would make it “natural” and not a bio-engineered virus. The reason that a human bio-engineered strain is unlikely is that the binding site for virus entry to a human body cell is not “ideal,” that is, not as precise as one made in biotechnology. A man-made virus would be very efficient for binding to the human receptor. Additionally, the backbone of the virus does not resemble any previously described in scientific literature used for genetic modification. Comparative analysis of genetic (RNA) data suggests SARS-CoV-2 may bind human hACE2, just like the first SARS outbreak in 2002. The computational analyses predict that this interaction is not ideal (random in nature) and therefore likely rules out laboratory manipulations as a potential origin for SARS-CoV-2 (Anderson, et. al. 2020).\n\nA prominent mutation on the surface of the SARS-CoV-2 increased its virulence. This mutation modified a glycoprotein spike on the virus surface (fig. 6) which it uses to bind to and enter respiratory system cells. The mutation produced a cleavage site for the human protease called furin. Furin modified the spike glycoprotein on the surface of SARS-CoV-2 allowing it to more optimally bind and enter throat and lung cells. This made SARS-CoV-2 more deadly to vulnerable humans (Xu et al. 2020). As the funds for research are increased drastically for this virus, knowing the specific mutations within the SARS-CoV-2 strain is helpful to scientists trying to find a vaccine and treatment. Even though past research was not taken as seriously as it perhaps should have been for SARS-CoV, the current research being conducted will hopefully combat the spread of COVID-19 (fig. 7).\n\nSevere acute respiratory syndrome coronavirus (SARS-CoV) and Middle East respiratory syndrome coronavirus (MERS-CoV) are two highly transmissible and pathogenic viruses that emerged in humans at the beginning of the 21st century. Genetically diverse coronaviruses that are related to SARS-CoV and MERS-CoV were discovered in bats worldwide (Cui et al. 2019). This diversity and potential spillover of bat-borne coronaviruses are evidenced by the origin and genesis of pathogenic coronaviruses.\n\nIn one of the earliest studies to examine the “genesis” or origin of the Wuhan coronavirus, Professor Pei Hao at the Pasteur Shanghai Institute performed genetic analysis on the collection of coronavirus sequences from various animals and humans. His data indicated that SARS-CoV-2 belongs to the betacoronavirus genera and shares a common ancestor with the SARS/SARS-like coronaviruses (including those causing the SARS epidemic). Their common ancestor resembles the bat coronavirus strain similar to SARS (2003), yet distinct (RaTG13 is a unique RNA sequence in SARS-CoV-2). Based on the genetic relationship of betacoronavirus, the bat is likely the native host of the SARS-CoV-2. Previous studies showed that CoV’s genomes display a high degree of change (plasticity) in terms of RNA and recombination. Furthermore, the relatively large CoV genome increases the probabilities for adaptive mutations, with it being relatively easy for the spike protein to exploit multiple body cell receptors for virus attachment and entry (Xu et al. 2020).\n\nThe Wild Side of Life: Displacement and How Sylvatic Diseases Become Urban Diseases\n\nZoonosis is an infectious disease caused by a pathogen that has jumped from non-human animals (usually vertebrates) to humans. Animals can sometimes carry microbes, some “good” and some pathogenic that can spread to people and cause illness. The sylvatic cycle, also known as the “wild” transmission cycle, is a portion of the natural transmission cycle of a pathogen or parasite. Sylvatic refers to the occurrence of a subject in or affecting wild animals. The sylvatic cycle is the fraction of the pathogen population's lifespan spent cycling between wild animals and vectors. Humans are usually an incidental or dead-end host, infected by a vector (Roberts et al. 2013).\n\nIn creation microbiology, displacement is the moving of something from its original designed place or purposeful position. Its original structure and or function was made good in its original place or position; however in a new position or place, due to the curse of Genesis 3, it is now functioning poorly or pathogenically. Microbes, including viruses, were originally designed for restricted places and good functions, but after the fall they spread to other places and began to cause disruption and disease. Sometimes, mutations in RNA, DNA, or proteins cause disease. In other cases, existing genetic information gets lost, duplicated, transferred, or changed. Modification of genetic information in a microbe kind and displacement thus probably led to its pathogenicity. Displacement can also be considered a horizontal transfer of genes, pathogens, and parasites to a different location in nature, often where the sylvatic cycle intersects the urban cycle (Francis 2020).\n\nThis specific strain of the virus was first reported to have originated in Wuhan, China, in a small fish market called the Huanan Seafood Market (Zhang, et al. 2020). It was noted that this wet market sold more than its name suggested, and in addition to the traditional seafood that was offered there, animals ranging from snakes and porcupines to beavers and bats could be found. Wet markets are not uncommon in China and are considered to be a part of their culture. In fact, public health experts note that Chinese culture is very fond of eating fresh foods, including meats and wild game. This practice introduces a new opportunity for zoonotic diseases and infections to be introduced to the human population (Rothan & Byrareddy 2020). Zoonotic diseases, diseases that pass from an animal to a human, make up approximately 70% (over 200 known diseases) of the diseases we see infecting populations today. The events in which the zoonotic diseases are spread from animals to humans are known as a zoonotic spillover. Zoonotic spillovers occur when an intermediate host, such as a bat with a high pathogenic count, comes in contact with a definitive host, a human, and the pathogen is transmitted from the reservoir population into the host population. In addition to the similarity in genetics to the horseshoe bat (fig. 8), the coronavirus strains have some similarities (phylogenetically) to SARS-CoV-2 in pangolins (scaly anteaters) that are found in Southeast Asia (fig. 9).\n\nEven though bat and pangolin viruses are closely related to SARS-CoV-2, none of the existing SARS-CoVs represent an immediate direct ancestor. The RNA sequence from an intermediate horseshoe bat in Yunnan is closest to the genomic region of SARS-CoV-2. The host receptor domains (RBD) are closest to pangolins in Guangzhou China (Lau et al. 2020, fig. 10). RBDs are sections of protein that directly engage with the receptors of viruses. Viral recombination occurs when viruses of two different parent strains coinfect the same host cell during replication to generate virus-containing genes from both parents (Roizman 1996). The pangolin virus probably interacted with the human SARS-CoV-2 or was transmitted directly from the bat. Potential recombination sites suggest SARS-CoV-2 might be a recombinant virus, with its genome (RNA) backbone originated from the Yunnan bat virus-like SARS-related-CoVs and its RBD region acquired from the pangolin virus-like SARS-related-CoVs (Lau et al. 2020). Which came first is difficult to determine; however, it is fairly clear that the viruses have mixed RNA.\n\nThere are current theories that scientists are working through to identify and trace back this new mutation of the coronavirus to determine what creature could be responsible for this groundbreaking pandemic. The role of wild animals in human infections, including that resulting from the Wuhan breakout, should never be downplayed. Wet markets for example, though a current cultural component in Chinese countries, can introduce infections and diseases and should be re-evaluated with new laws to prevent future problems.\n\nThe best scientists all over the world are working to understand SARS-CoV-2 and COVID-19 but there remains a mystery. How did this lethal coronavirus jump from the wild in China to major human population centers? And what genetic mutations produced a pathogen that is so perfectly adapted to infect so many? Approximately 70% of emerging infectious diseases in humans are zoonotic, i.e., transmitted from an animal to a person. Genetic sequencing revealed SARS-CoV-2 is related to two other coronaviruses that originated in bats. Its presumed SARS-CoV-2 originated in bats, though an intermediate host has yet to be identified.\n\nThe immediate source of SARS-CoV-2 remains a mystery even though the Wuhan market was initially suspected to be the epicenter of the epidemic. However, the closely related SARS-CoV-2 strains suggest the Wuhan outbreak probably originated from a point source with subsequent human-to-human transmission, in contrast to the multiple (polyphyletic) origin of MERS coronavirus. If the Wuhan market was the source, it is possible that bats carrying the parental (the bat coronavirus) virus were mixed in the market, enabling viral recombination. However, none of the animal samples from the market were reported to be positive, and the first identified case-patient and other early case-patients had not visited the market, suggesting the possibility of an alternative source (Lau et al. 2020).\n\nEarly investigations about the origin of COVID-19 suggested that the SARS-CoV-2 may have jumped from bats to humans. This is not unprecedented since bat viruses have been shown to “jump” the species barrier frequently to infect new species. However, since bats were in hibernation when the outbreak occurred, and it was uncertain whether bats were sold at the market, the virus is more likely to have been transmitted via other species on the market. Genomic analyses of SARS-CoV-2 demonstrate a 96% nucleotide identity with a CoV isolated from a bat. Previous reports showed that species from the bat genera Rhinolophus (fig. 11) in southern China contain a rich pool of SARS-like-CoVs. Interestingly, Chinese researchers showed that pangolin CoV sequences with 86% to 92% similarity to SARS-CoV-2. Early preliminary studies show the existence of lineages of pangolin CoVs with genetic similarity to SARS-CoV-2. Later the hypothesis that pangolins served as a potential intermediate host was not supported. The currently available data do not fully elucidate if the virus was directly transmitted from bats to humans or indirectly through an intermediate host. Consequentially, more sequence data is needed to confirm the specific source and origin of the SARS-CoV-2, which can only be achieved by enhanced collection and monitoring of bat and other wild animal samples. Furthermore, results are similar to the finding from other preliminary reports that indicate that the virus source of interspecies transmission was highly concentrated or limited, possibly a single event. In addition, the high sequence similarity among the viruses isolated from patients indicates a recent introduction to humans.\n\nA study of cultured bat cells shows that their strong immune responses can drive viruses to greater virulence. Modeling bat immune systems on a computer, the researchers showed that when bat cells quickly release interferon upon infection, other cells quickly wall themselves off. This drives viruses to faster reproduction. The increased virulence and infectivity wreak havoc when these viruses infect animals with “tamer” immune systems, like humans.\n\nBats have distinct characteristics that make them unique to most mammals. Perhaps their most recognizable feature is that bats are the only mammals that can truly fly. However, bats are hosts to 100 different viruses, many of which are harmful or potentially lethal to humans. An international research team led by Dr. Peng Zhou performed extensive bat studies. Their research aimed to discover how bats carry so many of these viruses without harm. They found that bats “turn on” an immune response that fights off danger. Mammals including humans have this ability where they are able to regulate their immune response by “turning on” or “switching off” the response when danger is or is not present. This on/off switch is essential for protection and fighting off threats; however, it can be harmful and pose risks to the animal in certain instances. In other mammals, having the immune response constantly switched on is dangerous: it is pathogenic to tissue and cells. Bats never seem to turn off their immune system even when there are no threats, and yet this operates in harmony with their bodies. This allows the bat to carry 100 viruses without getting sick and to easily transmit these viruses to other mammals and humans (Zhou et al. 2020).\n\nSince bats were in hibernation in Wuhan when the epidemic started, this may not hold well for the Wuhan Institute of Virology (WIV). As the WHO investigates, it is doubtful they will find direct evidence that SARS-CoV-2 originated in the lab. The bat viruses in the lab were collected in Yunan province, hundreds of miles away from Wuhan. However, studying the distribution and emergence of bat coronaviruses in Yunan and Wuhan may provide circumstantial evidence. If SARS-CoV-2 is more similar to bat coronaviruses in Yunan than in Wuhan, it is possible that it originated in the lab from their studying bat viruses sampled elsewhere. In 2004, there were lab infections of SARS-CoV in Beijing and in Singapore. The WIV found the origin of SARS-CoV in bats and are publishing sequences as they become available. Most interestingly, the sequence of the RaTG13 strain of bat virus, which is 96% similar to SARS-CoV-2, was isolated and published together with SARS-CoV-2. There is a possibility that the Wuhan Virology Lab had collected a natural sample from a market or bat source in Yunnan to study, and somehow the virus escaped the lab. This type of accidental escape has happened before with SARS-CoV (Andersen et. al. 2020).\n\nA highly pathogenic and severe disease, COVID-19, has been caused by SARS-CoV-2, Severe Acute Respiratory Syndrome Coronavirus 2. COVID-19 likely began in Wuhan, China, and has spread across the world. There are multiple coronaviruses, but the most harmful strains are SARS-CoV and MERS-CoV. SARS-CoV-2 shares a distant common ancestor to the SARS-CoV bat strain but has undergone different genetic mutations within its structure to make it more dangerous and even deadly to humans. The transmission of the disease has been found to be human-to-human contact while the origin is still somewhat of a mystery regarding its exact origin (index case/patient zero).\n\nWhy did God Create Viruses? Virus Helpful and Cooperative Properties\n\nHow could a good God allow such pathogenic viruses?2 A scalpel or sharp instrument in the hand of a skilled surgeon or biologist is useful; the same sharp instrument in the hands of a thief or murderer will cause havoc. Regulation, control, and placement of a dangerous instrument are needed—so too in viruses. Viruses, even though small and simpler than most cells, possess tremendous designs. Creation microbiologists believe viruses were created for good uses in creation, but some viruses were altered after the fall. Viruses are harmful when in places they should not be. This is referred to as displacement theory in creation biology. In the human genome, for instance, we have more DNA or RNA base sequences that align with viruses than we have bases that code for our own proteins. Some of these virus sequences (retrotransposons) in the human body make proteins that turn our immune system on and off, for example during pregnancy. Could some viruses then originate from animals and from us? If so, this supports the displacement creation theory, and, as we have stated above, many infectious viruses in humans have a zoonotic origin. For instance, we have heard about the swine and the bird flus. In these cases, human and bird influenza (flu) viruses mix in pigs, and new influenza viruses re-assort from a mixture of the viral parts. These types of new influenza strains are usually the most virulent, infectious, and pathogenic (Gillen 2019; Francis 2020). In pandemics, new viruses that often emerge are a mixture of the viral sequences from various animals.\n\nHistorically, evolutionists have told us that changes in living things happen at a slow and deliberate pace. Yet the creation model shows that life is able to adapt to new environments rapidly. Viral mechanisms of change include mutation and variation. RNA viruses, like SARS-CoV-2, are characterized by a high mutation rate and replicate up to a million times faster than their host. This mutation rate drives genome variability and enables the virus to escape the host’s immunity (Pachetti et al. 2020). Genetic variation explains differences in immune response strengths which may affect the susceptibility and the severity of infection of SARS-CoV-2 (Nguyen et al. 2020).\n\nCoronavirus genomes have genomic “flexible” genomes due to having high mutation rates and high rates of RNA recombination. Even on June 14, 2020, the strain identified in the Beijing COVID-19 outbreak is not like the type circulating in China according to the CDC chief epidemiologist.3 We see a displacement with modification that occurs when wild animals, like bats, transmit viruses to other species, like humans. This is commonly seen in wilderness, jungle, or desert environments. In the example of the bat, the bat is unharmed because their immune system is able to fight off the threat. However, when the virus is transmitted to humans, our immune system is unable to fight it off. Mixing of genetic information occurs and new strains, species, and diseases arise. This is why not all diseases are created equally and old diseases take new forms. We now have a new disease that we need to trust God as our Shelter, Refuge, and Fortress (Psalms 91).\n\nClearly, the origin of infectious disease is complex and multifaceted. This topic is further explored in the book, The Genesis of Germs (Gillen 2019). It provides some understanding of the origin of such diseases. From a biblical worldview, we can say that infectious diseases and pathogenesis became a secondary condition, a result of sin against our Creator. The sequence of events in a biblical worldview might be seen as Creation, Curse, Corruption, Contagion, and Crisis. In time, we will see what happens with the new Coronavirus Crisis and the signature “plague” of the new millennium.\n\nCui, J., Fang Li & Zheng-Li Shi.“ Origin and evolution of pathogenic coronaviruses.” Nature Reviews, Microbiology 17, no. 3 (2019): 181–192. https://doi.org/10.1038/s41579-018-0118-9.\n\nGillen, Alan L. The Genesis of Germs: Disease and the Coming Plagues in a Fallen World. Green Forest, Arkansas: Master Books, 2019.\n\nGillen, Alan L. and Keoprommony Huy. “Wise Blood: The Principle of Overcoming in Disease and Immunity (Part 1).” Answers in Depth 15 (Jan. 28, 2020). https://answersingenesis.org/human-body/wise-blood-overcoming-in-disease-immunity-part-1/.\n\nLau Susanna K.P., Hayes K.H. Luk, Antonio C.P. Wong, Kenneth S.M. Li, et al. “Possible Bat Origin of Severe Acute Respiratory Syndrome Coronavirus 2.” Emerging Infectious Diseases 26, no. 7 (July 2020). https://doi.org/10.3201/eid2607.200092.\n\nLightner, Jean. “Life: Designed by God to Adapt.” Answers in Depth 3 (June 4, 2008). https://answersingenesis.org/evidence-for-creation/life-designed-by-god-to-adapt/.\n\nPachetti, Maria, Bruna Marini, Francesca Benedetti, Fabiola Giudici, et al. “Emerging SARS-CoV-2 mutation hot spots include a novel RNA-dependent-RNA polymerase variant.” Journal of Translational Medicine 18 (2020): 179. https://doi.org/10.1186/s12967-020-02344-6.\n\nRoberts, L. S., J. Janovy, Jr., and S. Nadler. 2013. Schmidt and Roberts’ Foundations of Parasitology, 9th ed. Boston, Massachusetts: WCB McGraw-Hill.\n\nRothan, Hussin and Siddappa N.Byrareddy. “The epidemiology and pathogenesis of coronavirus disease (COVID-19) outbreak.” Journal of Autoimmunity 109 (May 2020): 102433. https://doi.org/10.1016/j.jaut.2020.102433.\n\nXu, Xintian, Ping Chen, Jingfang Wang, Jiannan Feng, Hui Zhou, Xuan Li, Wu Zhong & Pei Hao. “Evolution of the novel coronavirus from the ongoing Wuhan outbreak and modeling of its spike protein for risk of human transmission.” Science China Life Sciences. 63 (2020): 457–460. https://doi.org/10.1007/s11427-020-1637-5.\n\nZhang, Xiaodong. “Epidemiology of Covid-19.” New England Journal of Medicine 382 (May 7, 2020): 1869-1870. https://www.nejm.org/doi/full/10.1056/NEJMc2005157.", "opengraph": {"title": "The Genesis of SARS-CoV-2 Virus and  the Origin of the COVID-19 Pandemic", "url": "https://answersingenesis.org/coronavirus/genesis-sars-cov-2-virus-and-origin-covid-19-pandemic/", "description": "In this paper the origin and genesis of COVID-19 are postulated, and the epidemiological/ecological aspects of the disease and biblical perspective are shared.", "image": "https://assets.answersingenesis.org/img/cms/content/contentnode/og_image/genesis-sars-cov-2-virus-and-origin-covid-19-pandemic.jpg", "image:width": "1200", "image:height": "628", "site_name": "Answers in Genesis", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["#fn_1", "/bible/", "/creation/", "https://commons.wikimedia.org/wiki/File:Coronavirus_SARS-CoV-2.jpg", "https://answersresearchjournal.org/origin-bacterial-pathogenicity/", "#fn_2", "#fn_3", "/god/", "/sin/", "https://www.cdc.gov/coronavirus/2019-ncov/faq.html", "https://doi.org/10.1038/s41579-018-0118-9", "/coronavirus/covid19-coronavirus-and-creation-virology/", "/human-body/wise-blood-overcoming-in-disease-immunity-part-1/", "https://coronavirus.jhu.edu/us-map", "https://doi.org/10.3201/eid2607.200092", "/evidence-for-creation/life-designed-by-god-to-adapt/", "https://doi.org/10.1186/s12967-020-02344-6", "https://doi.org/10.1016/j.jaut.2020.102433", "https://doi.org/10.1007/s11427-020-1637-5", "https://www.nejm.org/doi/full/10.1056/NEJMc2005157"], "authors": [], "publish_date": "June 17, 2020, 6 a.m."}