{"result_id": "032032", "URL": "https://answersingenesis.org/kids/show-tell/whats-new-at-zoo/pumpkin-treats/", "timestamp": "2023-04-25 12:06:08 CEST+0200", "meta": {"description": "Fall is here at the zoos of Answers in Genesis—that means pumpkins galore! Pumpkins are a favorite treat for many of our zoo animals.", "lang": "en", "keywords": "", "favicon": "https://assets.answersingenesis.org/art/kids-icons/1810_KidsAnswers_FullLogo_AppIcon_57x57.png", "canonical": "https://answersingenesis.org/kids/show-tell/whats-new-at-zoo/pumpkin-treats/", "encoding": "utf-8"}, "image": null, "domain": "answersingenesis.org", "title": "Pumpkin Treats!", "cleaned_text": "Fall is here at the zoos of Answers in Genesis—that means pumpkins galore! Pumpkins are a favorite treat for many of our zoo animals. They are also good for digestion and provide essential vitamins and minerals.\n\nAt the Eden Animal Experience, zookeepers celebrated alpacas Bilbo, Frodo, and Samwise’s birthdays and kept with the Lord of the Rings theme by constructing a Mount Doom and Barad-dur for them to destroy. Cardboard boxes were shaped, painted, and then stuffed with treats before being offered to the boys to “defeat.” With some help from Thorin Oinkenshield and Gimli son of Gloink the KuneKune pigs, Mordor was defeated!\n\nMeanwhile, Promise the miniature Hereford cow has been progressing in her training. Although Promise is friendly, she is a bit skittish, so our zoo staff has been working hard to build a positive, trusting relationship with her so they can better care for her. Promise will now stand on a scale to be weighed, stand in stocks to get vaccinated, and even allow our keepers to give her snuggles! We also celebrated Boomer the Bennett’s wallaby’s fourth birthday with bamboo and pumpkins stuffed with cheese crackers and peanuts.\n\nOver at the Ark Encounter, our ring-tailed lemurs had some fun with a giant papier-mache lemur stuffed with treats and enjoyed some painting! The paint is nontoxic and washable, so it is safe for the animals. Additionally, we celebrated Felix the sloth’s fourth birthday by throwing a party and gifting him with one of his favorite treats—hibiscus!\n\nLots of training progress has also occurred at the Ararat Ridge Zoo. Amos the KuneKune pig has learned how to “clean up” by placing his toys into a toy basket. Abednego the goat has learned how to stand up, jump through a hula hoop, and walk to and from the stage. While this may seem easy to us, for a prey animal like a goat, standing on two legs, jumping through a scary object, and walking to and from somewhere strange are big milestones. Finally, Milcah the white-throated monitor is learning how to follow a target to climb objects. Did you know the monitor lizards are actually very smart? Studies show they can count, solve problems, and recognize and remember things.\n\nFinally, this month marked a big milestone for our baby aoudad (OW-dad) sheep, Noel. She was born on the winter solstice of 2020 and was hand-raised for health reasons. As a baby, she was kept with two of our domestic goats to keep her company. However, she has grown into a big girl, and it’s time for her to join Bathsheba, Rachel, Sarah, and Zipporah on exhibit. The first day, the adults were very curious and chased her around a bit to establish their hierarchy. Since then, they have been friendly to each other. We are very happy that all the aoudads are getting along! Because Noel was hand-raised, she is relatively tame and often goes for walks around the zoo with her trainers. She also allows hoof trims and injections. Being around Noel has also helped Bathsheba, Rachel, Sarah, and Zipporah become more comfortable with us.\n\nI hope you enjoyed learning what’s happening at the zoo! Tune in next time for more animal adventures.", "opengraph": {"title": "Pumpkin Treats!", "url": "https://answersingenesis.org/kids/show-tell/whats-new-at-zoo/pumpkin-treats/", "description": "Fall is here at the zoos of Answers in Genesis—that means pumpkins galore! Pumpkins are a favorite treat for many of our zoo animals.", "image": "https://assets.answersingenesis.org/img/cms/content/contentnode/og_image/kids/blogs/last-week-zoo/rj-argentine-bw-tegu-1200x628.jpg", "image:width": "1200", "image:height": "628", "site_name": "Answers in Genesis", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["https://assets.answersingenesis.org/vid/kids/blogs/last-week-at-zoo/lemurs-painting.mp4"], "authors": [], "publish_date": null}