{"result_id": "032010", "URL": "https://answersingenesis.org/creation-scientists/profiles/louis-pasteur/", "timestamp": "2023-04-25 12:05:43 CEST+0200", "meta": {"description": "Louis Pasteur, outstanding scientist and opponent of evolution (1822-1895)", "lang": "en", "keywords": "Research scientists,Chemists,Scientists", "favicon": "https://assets.answersingenesis.org/img/favicons/apple-touch-icon.png", "canonical": "https://answersingenesis.org/creation-scientists/profiles/louis-pasteur/", "encoding": "utf-8"}, "image": null, "domain": "answersingenesis.org", "title": "Great Creation Scientists: Louis Pasteur (1822–1895)", "cleaned_text": "Each time we go to the refrigerator and take out a bottle of milk, we should be reminded of the work of the outstanding French scientist, Louis Pasteur. Pasteur discovered that milks turns sour because of the action of tiny living organisms too small to see with the naked eye. He developed a process of gently heating foodstuffs like milks to kill these organisms without changing the flavour or nutritional value. This process, named ‘pasteurization’ in honour of its developer, is just one of Pasteur’s great contributions to mankind.\n\nLouis Pasteur was born on December 27, 1822, in the town of Dole, in eastern France, about 400 kilometres south-east of Paris. Several years later, Louis’ family moved to the nearby town of Arbois. Louis attended school in Arbois but he obtained poor results except in art. Most of his teachers thought he would just leave school and work in his father’s tannery. However, Louis had a great desire to increase his knowledge. One of his teachers saw potential in his persistent and careful approach to his work.\n\nAt 15 years of age, Louis went to Paris to complete his secondary schooling. He was overcome by homesickness and returned to Arbois. He tried again, this time at Besancon, only 40 kilometres from home. He was successful and went on to complete a Bachelor of Science degree at the Royal College in Besancon in 1842.\n\nLouis decided he wanted to attend the Ecole Normale in Paris, which trained teachers for French colleges and universities. He passed the entrance examination in 1842, but knew he could have achieved a higher standard. So he studied for another year to improve his knowledge before entering the Ecole Normale. (This determination to accept nothing less than his best effort characterized his work throughout his career.) Louis studied chemistry at the Ecole Normale, receiving a Master of Science degree in 1845.\n\nHe then began a doctoral degree at the same institution. His task was to solve a difficult research problem of his own choosing. Pasteur decided to investigate the structure of tartrate and paratartrate crystals and explain the differences between them. This problem had baffled even the greatest chemists of that time.\n\nHe was fascinated by the intricate structure of the tiny crystals and ‘looked upon them as direct evidence of the artistic expression of God the Creator.’1 He carefully observed the crystals under his microscope. His thorough organization and attention to detail helped him to detect what others had missed—there were actually two different types of paratartrate crystals, one being the mirror image of the other. His slow and cautious approach, which had been mistaken for lack of ability in his childhood, turned out to be one of Pasteur’s greatest assets. Not only did he earn his higher degree, but he also became well known among research scientists.\n\nPasteur became Professor of Chemistry at the University of Strasbourg and spent the next five years teaching and doing research there. He also became happily married and started a family.\n\nAt the age of 32, Pasteur accepted a challenge which changed the direction of his research and teaching career. He was asked to go to Lille to set up an applied science faculty which would train scientists to put their theoretical knowledge to work to solve the practical scientific problems of industry and business. While the scientific community was largely oriented towards theoretical investigations, Pasteur longed to put to use the science he loved to benefit ordinary people. He eagerly accepted this opportunity to change direction.\n\nDuring the two years Pasteur spent establishing this new faculty of applied science, he focused his own research efforts on the process of fermentation—the process which is used to produce alcohol from sugar, but which also causes milk to go sour. Most chemists believed that the chemicals present merely reacted together and could not explain why the process sometimes produced unexpected results. Pasteur proved that fermentation took place only when small living things called microbes were present. If the right microbe was present, the desired result was obtained. If the wrong microbe was present, the wrong substance was produced, such as sour milk or bitter wine. Pasteur’s findings helped established a new branch of science—microbiology.\n\nIn 1857, Pasteur returned to the Ecole Normale. This time he was not a student, but was the Director of Scientific Studies. Here he continued his work on microbes.\n\nThe ancient Greeks had believed that small animals such as worms, mice, and maggots sprang to life automatically from the non-living matter around (such as rotting flour, a sweaty shirt, or decaying meat). This belief that living matter arose from non-living material is called spontaneous generation. The idea of maggots’ coming spontaneously to life out of decaying meat was successfully challenged in 1668 by Italian biologist Francesco Redi. When he covered the meat with gauze to prevent flies from laying their eggs on it, no maggots appeared in the meat. (The maggots are actually the larvae which hatch from flies’ eggs.)\n\nLong after the idea of spontaneous generation of maggots, mice and worms had been generally discarded, scientists still clung to the idea of spontaneous generation of microscopic animals. To disprove this idea also, Pasteur boiled some broth to kill any microbes present. With special glassware, he allowed air to circulate over the broth, but prevented microbes in the air from reaching the broth. As Pasteur expected, no microbes appeared in the broth. Pasteur’s findings showed that microbes were not spontaneously generated from the broth itself. Microbes would only appear in the broth if they were allowed in with the air. He clearly showed that even for microbes, life came only from life—‘Microscopic beings must come into the world from parents similar to themselves.’2\n\nPasteur’s work should have dealt the death blow to the idea of spontaneous generation. But spontaneous generation is an essential part of the theory of evolution. Despite all the efforts of evolutionary scientists, not one observable case of spontaneous generation has ever been found. Pasteur’s findings conflicted with the idea of spontaneous generation (as do all scientific results since). Consequently, Louis Pasteur was a strong opponent of Darwin’s theory.\n\nPasteur now had a good theoretical understanding of microbes. He sought to apply his findings to the practical problem of stopping wine from spoiling. As many families depended on the wine industry for their livelihoods, and the French economy was heavily dependent on wine exports, this was a big problem.\n\nPasteur achieved success by slightly modifying the process used with the broth. Boiling the wine would alter its flavour. Therefore, Pasteur heated the wine enough to kill most of the microbes present without altering the flavour. Chilling prevented any microbes left from multiplying. (As with the broth, it was necessary to prevent new microbes from entering from the air as well.) To his great delight, Pasteur found that this process could also prevent milks from turning sour and preserve many other foodstuffs as well.\n\nIf Louis Pasteur had chosen to patent this process, he would have become a rich man. Instead, he chose to make his discovery freely available so that all could benefit from it. His only reward was fame and recognition, with the new process becoming known as ‘pasteurization’.\n\nLouis Pasteur was called on to help another group of French farmers when the silk industry faced a crisis due to diseased eggs. He showed the farmers how they could use a microscope to detect the diseased eggs. These eggs were then destroyed and the disease eliminated in the silkworm nurseries. Pasteur received grateful thanks from those whose livelihoods he had saved.\n\nWhile solving this practical problem, Pasteur’s active mind was laying the foundation for his next great theoretical advance—the idea that many diseases in animals and man were the result of germs (harmful microbes) which enter the body and multiply there.\n\nWhile the French government honoured Pasteur with its highest award, the Legion of Honour—much of the medical profession still resisted his ideas. Some older doctors seemed unable to cope with Pasteur’s forward thinking on germs and vaccination. Others resented medical research being conducted by someone whose training was in chemistry, not medicine. Eminent modern-day creation scientist, Dr Henry Morris, believes that a large part of the opposition was a reaction to Pasteur’s ‘own opposition to spontaneous generation and to Darwinism.’H.M. Morris, Men of Science, Men of God, Master Books, El Cajon, California, USA, 1999, p. 62.\n\nSuch opposition seems hard to understand considering that Pasteur is generally recognized today as having made ‘the greatest contribution of any one man to the saving of human lives’.3\n\nUndeterred by this opposition, Pasteur moved on to the next, and perhaps greatest, step—diseases in humans. In 1882, he began studying rabies. This deadly disease is contracted by being bitten by an infected animal, usually a dog or wolf.\n\nPasteur began his experiments using animals. He followed the same procedures as before, but was hampered by the long delay of several weeks between the animal’s being bitten and the germs’ reaching the brain. While this delay made research time-consuming, it enabled a significant difference in treatment to be possible. Previous vaccination work had required that the vaccine be given prior to exposure to the disease. However, the delay in the rabies germs reaching the brain enabled the rabies vaccine to be given after the bite had occurred. Therefore only those who had been bitten by a rabid animal needed to be treated.\n\nIn 1885, a small boy who had been bitten by a rabid dog was brought to Pasteur. Although he was not yet sure whether the treatment would work on humans, Pasteur knew the boy would die without the vaccine. After several tense weeks of treatment on the boy, it was clear that the rabies vaccine was a success.\n\nIn 1888, the Pasteur Institute was established in Paris to continue the fight against diseases. Pasteur by then was almost 66 years old and in failing health. He served largely in an advisory capacity while those whom he had trained took over responsibility for continuing the research.\n\nLouis Pasteur’s personal life had been punctuated by sickness and tragedy. Three of his five children died of childhood diseases. Also he had been brought up with a sister left mentally retarded by a childhood disease. Rather than crush his spirit, these tragedies spurred him on in his efforts to spare others the heartbreak of losing their children to disease. His own life was touched by a brain hemorrhage and several strokes which left him partially paralysed. His condition was often made worse by overwork. Despite his great contributions to medicine, many doctors and veterinarians strongly opposed him—the very people who should have seen the enormous potential of his work. Through all these trials, Pasteur was sustained by his Christian faith.\n\nPasteur always worked for the benefit of others, not for praise or for financial gain. However, he did not shun publicity as this was an important factor in gaining recognition of his work.\n\nHe has been described as ‘a person of simplicity. He remained humble despite the medals and honours.’4 Pasteur’s dedication and thoroughness enabled him to make many great discoveries. He courageously broke new ground. However, he was somewhat intolerant of opponents who rejected his work without evaluating it properly.\n\nPasteur saw no conflict between science and Christianity. In fact, he believed that ‘science brings men nearer to God’.5 In his work as a scientist, he perceived evidence of wisdom and design, not randomness and chaos. Pasteur stated that: ‘The more I study nature, the more I stand amazed at the work of the Creator’.6\n\nLouis Pasteur died on September 28, 1895, after a long and fruitful life. His contributions to science were truly outstanding. His Christian faith sustained him through many trials. He firmly believed in creation, and strongly opposed Darwin’s theory of evolution because it did not fit well with scientific evidence.", "opengraph": {"title": "Great Creation Scientists: Louis Pasteur (1822–1895)", "url": "https://answersingenesis.org/creation-scientists/profiles/louis-pasteur/", "description": "Louis Pasteur, outstanding scientist and opponent of evolution (1822-1895)", "image": "https://assets.answersingenesis.org/img/cms/content/contentnode/header_image/creation-scientists-profiles.jpg", "image:width": "945", "image:height": "300", "site_name": "Answers in Genesis", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["#fn_1", "#fn_2", "/evolution/", "#fn_3", "/christian/", "#fn_4", "#fn_5", "#fn_6", "/creation/"], "authors": [], "publish_date": "Dec. 1, 1991, midnight"}