{"result_id": "032012", "URL": "https://answersingenesis.org/kids/scientists/louis-pasteur-father-microbiology/", "timestamp": "2023-04-25 12:05:46 CEST+0200", "meta": {"description": "Pasteur is known as the founder of microbiological sciences and praised even today for the many lives he saved with his vaccinations.", "lang": "en", "keywords": "", "favicon": "https://assets.answersingenesis.org/art/kids-icons/1810_KidsAnswers_FullLogo_AppIcon_57x57.png", "canonical": "https://answersingenesis.org/kids/scientists/louis-pasteur-father-microbiology/", "encoding": "utf-8"}, "image": null, "domain": "answersingenesis.org", "title": "Louis Pasteur: Father of Microbiology", "cleaned_text": "Did you know that a man called the greatest biologist of all time was also a strong opponent of evolution and a man of God?\n\nLouis Pasteur was born in France in 1822. He attended school in Arbois, but he got bad scores in all subjects except for art. He worked slowly, making sure he got every detail right, but others did not see his potential. His teachers thought he wouldn’t continue school, but Pasteur continued and eventually became one of the most famous scientists of all time.\n\nAfter graduating from the Royal College of Besançon in France, Pasteur moved on to get his master of science degree from the École Normale Supérieure, another French university, in 1845. While he was in the process of getting his doctorate degree, he studied crystals found in drinks and analyzed them. He also discovered that milk turns sour because of tiny organisms that are too small to be seen without a microscope. This discovery led to the development of pasteurization (named after him), the process of gently heating food or drink to kill harmful bacteria. Thanks to Pasteur’s research, many of the drinks we buy today are safe to drink.\n\nPasteur is also responsible for developing many vaccines. He discovered that diseases in animals and humans were caused by germs that enter the body and multiply. He developed a vaccine for rabies so that people bitten by an infected animal did not get the disease. He also developed vaccines for cholera and anthrax.\n\nPasteur is known as the founder of microbiological sciences and is praised even today for the many lives he saved with his vaccinations. He was also a strong opponent of evolution, causing other scientists to oppose him. Through those trials, Pasteur was uplifted by his Christian faith. He believed that science brought men closer to God. In his scientific studies, he realized that the complexity of life had nothing to do with randomness and chaos, but rather everything to do with an intelligent Creator. He once stated, “The more I study nature, the more I stand amazed of the work of the Creator.”\n• Three of Pasteur’s five children died of disease, which pushed him to learn how to cure diseases.\n• Pasteur always worked for the benefit of others. He would have become rich by patenting pasteurization, but he chose not to so that his research would benefit everyone.\n• He was described as a person of simplicity, staying humble even through all of his awards and honors.", "opengraph": {"title": "Louis Pasteur: Father of Microbiology", "url": "https://answersingenesis.org/kids/scientists/louis-pasteur-father-microbiology/", "description": "Pasteur is known as the founder of microbiological sciences and praised even today for the many lives he saved with his vaccinations.", "image": "https://assets.answersingenesis.org/img/cms/content/contentnode/header_image//kids/creation-scientists.jpg", "image:width": "945", "image:height": "300", "site_name": "Answers in Genesis", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}