{"result_id": "032019", "URL": "https://answersingenesis.org/human-body/wise-blood-antibodies-principle-overcoming-disease-part-2/", "timestamp": "2023-04-25 12:05:54 CEST+0200", "meta": {"description": "The immune system serves more than just to “defend” against disease – it was designed to interact with microbes and to cleanse the body.", "lang": "en", "keywords": "White blood cells,Blood,Coronavirus,Immunity,Virus", "favicon": "https://assets.answersingenesis.org/img/favicons/apple-touch-icon.png", "canonical": "https://answersingenesis.org/human-body/wise-blood-antibodies-principle-overcoming-disease-part-2/", "encoding": "utf-8"}, "image": null, "domain": "answersingenesis.org", "title": "Wise Blood: Antibodies, The Principle of Overcoming in Disease (Part 2)", "cleaned_text": "Keywords: antibodies, overcoming principle, immune system, pre-Fall, post-Fall, body defenses, the genesis of germs, immunology, intelligent design, power in the blood, cleansing, interwoven complexity, fearfully and wonderfully made, body by design, coronavirus\n\nThe immune system serves more than just to “defend” against disease. The immune system was designed to interact with microbes and to cleanse the body of aging, dying, and dead red blood cells and bacteria even in the pre-fall world. The immune system in a pre-fall world worked to assist body development positively, and in the post-fall world, it also defends against pathogens. This is how most creation biologists view the immune system.\n\nThe most probable pre-fall function of antibodies is to regulate numbers of microbes and shape the microbiome composition. Too much of even a good thing is bad. Even in a perfect world, the grass and trees might need to be trimmed—and grazing animals would take care of much of this. In the body, antibodies could be used to keep good E. coli at the right numbers in the gut. There were no harmful pre-fall bacteria, so the numbers would need to be regulated.\n\nIn recent research, host antibodies shape gut microbiome by changing bacteria gene expression.1 The researchers have discovered how antibodies secreted in the gut promote the growth of beneficial bacteria. Their study, published in the Journal of Experimental Medicine (JEM), shows that immunoglobulin A (IgA) antibodies can alter the expression of bacterial genes, allowing different bacterial species to cooperate with each other and form a community that enhances body function.\n\nIt is estimated that between two and five grams of IgA are produced in adult intestines each day. IgA is the first line of defense against harmful, pathogenic bacteria in the gastrointestinal tract, but it also promotes the growth of a healthy microbiome—the community of “good” bacteria that reside in the gut. An average adult has over two thousand species of bacteria in their intestines that improve the function of the intestines and immune system, significantly impacting human health and disease.2 Even in a pre-fall world, humans and animals would have utilized antibodies to regulate the gut microbiome. The prominent human gut bacterium Bacteroides thetaiotaomicron (B. theta, fig. 1) was particularly susceptible to coating with gut antibodies, IgA. The JEM team discovered that exposure to IgA causes B. theta to up-regulate two proteins that were structurally shared with many other bacterial strains, named Mucus-Associated Functional Factors (MAFFs).3 These proteins appear to help B. theta grow in the mucous membrane of the intestine and produce metabolites that allow other beneficial bacteria, such as those in the group Clostridiales (gut bacteria taxa), to thrive as well. Mice inoculated with a strain of B. theta unable to up-regulate MAFFs had an altered gut microbiome and were more susceptible to intestinal inflammation, or colitis.\n\nThere is an antibody-mediated defense found in blood plasma, lymph, and other body fluids. In adaptive (acquired) immunity, receptors provide pathogen-specific recognition. It is a specific lock-and-key fit. Antibodies have locked away the secret of defeating each disease; a second infection of the same type will normally do no or minimal harm. It is immunity attributable to specific antibodies in blood plasma. B cells act as the “biological arms factory,” designed to produce millions of potent, specific antibodies. Antibodies and helper T cells often work together during immune responses. Upon activation by an antigen, B cells collectively undergo differentiation, each producing hundreds of specific antibodies, proteins made in response to specific antigens, then recognize and bind tightly to them (fig. 2a). Antibodies can, therefore, help neutralize or destroy antigens. Antibodies belong to the soluble-proteins known as immunoglobulins or Igs. Five classes of immunoglobulins are designated IgG, IgM, IgA, IgE, and IgD. Antibodies have at least two identical sites that bind to antigenic determinants. These sites are known as antigen-binding or antibody-combining. The number of antigen-binding sites on an antibody is called the valence of that antibody. For example, most antibodies have two binding sites, so they are said to be bivalent. By design, each class plays a different role in the immune response and has a distinctive size and shape.\n\nAntibodies are comprised of light (L) and heavy (H) chains attached by disulfide bonds. The most common antibody is IgG, composed of four polypeptide chains: two identical light chains and two identical heavy chains. These chains are arranged in a Y shape. The two tips of the Y vary from antibody to antibody, and these tips allow the antibody to attack one kind of antigen specifically. These tips, called the variable regions or antigen-binding sites, are the point where the antibody binds to the antigen with the specificity of a key fitting its lock. The rest of each chain in the antibody is called the constant region (fig. 2b). The characteristics of the constant region determine the class of the antibody (Gillen 2019).\n\nEach class fights antigens in a slightly different way. IgG helps promote phagocytosis, for example. They bind to the antigen with their variable regions and to macrophages with their constant region, then macrophages engulf the antigen. IgMs are larger antibodies that form a five-antibody complex and use their constant regions to activate complement proteins. Interestingly, IgG can also fight antigens this way. IgE helps initiate the inflammatory response by first attaching to basophils with their constant regions. Then, when attached to antigens with their variable regions, the basophils are stimulated to release inflammatory agents. IgA is found in breast milk to provide immunity to infants. IgD typically inactivates antigens by simple binding.\n\nAntibodies, then, have several means of fighting antigens:\n• Binding the antigens together in groups.\n\nIn the event of a new threat, a B lymphocyte cell memorizes the shape and rushes to the nearest lymph node or gland, and it is transformed into a plasma cell that is a chemical antibody factory. One specific antibody subtype is for one pathogen or parasite and stores the formula to overcome the germ. Occasionally, a new antigen comes along and “fools” the body’s response. The cells have to adapt and modify their formula to come up with a new combination and combat the threat.\n\nThe variable region of an antibody determines the specific antigen it will fight. The constant region determines the method by which it will fight the antigen. Antibodies are produced by B cells—specialized lymphocytes. Antigen-antibody binding causes these B cells to divide rapidly. This process is called clonal selection because the resulting population of cells is composed of replicates that multiply in the presence of particular invasive antigens. When exposed for the first time to the antigen for which they are specific, these sites bind to the antigen, and the B cells begin to proliferate. The proliferation produces two types of B cells: plasma B cells and memory B cells. The activated plasma cells are large ellipsoidal or spherical cells that may reach 20 μm in diameter. They undergo morphologic change mainly due to the rough endoplasmic reticulum (RER), which must expand to provide increased surface area for active protein synthesis. Antibodies are membrane bound, and clonal selection causes those cells that have an antibody that recognizes the antigens to undergo the transformation to plasma cells. While some are transformed into plasma cells, others remain as memory cells.\n\nThe antibodies are released into the plasma so the antibodies can attack the antigens to which they can bind. The memory B cells are long-lived cells that do not release their antibodies. Instead, they circulate in the body waiting for the next attack by the antigen, allowing the body to respond quickly to subsequent infection by the same antigen. These cells give the immune system its amazing memory.\n\nWith each such subsequent exposure to the same antigen, the number of different responding B cell clones increases to generate a many-clone response, and effectively a greater number of memory B cells persist. Thus, a stronger antibody response (i.e., higher antibody titer) having improved affinity towards antigen is typically observed in the secondary immune response. The fact that all the accumulation of cells of a single clone population expresses many of the same types of antibody and that these memory B cells survive for long periods in a body underscores their functional significance during vaccination and the administration of booster shots. In the case of smallpox, it has been documented 50 years in memory for B cells and documented for as long as 70 years in memory for T cells.\n\nMemory B lymphocytes are generated at three specific germinal centers in the bone marrow.\n\nMemory B cells contribute to a bigger and faster antibody response than regular B cells in primary response because they have already undergone class switching (mature) and have a faster and higher affinity than immature B cells. They still have to proliferate into plasma cells that have high antibody production due to rich cell RER. IgG is faster, bigger, better defense against specific pathogens and parasites. Antibody production shows beauty, complexity, providential orderliness, and gives praise as a fearfully and wonderfully made design.\n\nImmunologists, like Dr. Ronald Glasser,4 joke about antibody diversity acronym, GOD (Generator of Diversity). This expresses the body’s astonishing ability to manufacture what defense is needed to get the job done against invading pathogens and parasites. Dr. Glasser says that the mixture is “a mixture of mystery and chemistry… a combination of physics and grace at the molecular level” (Brand and Yancy 1984, p. 85). The diversity helps with the staggering range of invaders (virus, bacteria, fungi, protozoan, and multi-cellular parasites). There is an enormous number of threats over time.\n\nAntibody diversity is a result of gene rearrangement. There may be an estimate of more than a million different antibody types. For decades, immunologists were puzzled over how an enormous variety of antibodies could be generated by the limited number of genes associated with the immune system. Because, like all proteins, genes specify antibodies, it would be reasonable to assume that an individual must have a million or more antibody genes. However, genomic experts point out that human cells have only about 35,000 genes. The answer to this antibody diversity mystery is elegant and simple, pointing clearly to intelligent design and a benevolent Creator.\n\nEmbryonic cells contain about 300 genetic segments that can be shuffled and combined in each B lymphocyte as it matures. The process, known as somatic recombination or rearrangement, is a random mixing and matching of gene segments to fashion unique antibody genes. The information encoded by these genes is then expressed on the surface receptor proteins of B lymphocytes and in the antibodies later expressed by the stimulated clone of plasma cells. This is a process of somatic recombination, and the discovery of immunoglobin genes for D, V, J, and C regions allow for the great variation of antibody diversity. According to the process, the gene segments coding for the light and heavy chains of an antibody are located on different chromosomes. The light and heavy chains are synthesized separately, then joined to form the antibody. One of eight constant genes (C), one of four joiner genes (J), one of 50 diversity genes (D), and one of up to 300 variable genes (V) can be used to form a heavy chain. One of 300 variable genes is selected and combined with one of five joiner genes and a constant gene to form the active light-chain gene. After the deletion of intervening genes, the new gene can function in protein synthesis. When these gene sections are joined, new information, not originally encoded, is added by the enzyme terminal transferase. This is the point where the system can generate the greatest amount of diversity. That all this gene rearrangement is done at the DNA level. Class switching is a design feature able to place the same antigen-binding site with a different class with a different role. In antibody class switching, there is a design that changes a B-lymphocyte production of immunoglobulin from one type to another, e.g., the IgM to the IgG. During this process, the constant-region portion of the antibody-heavy chain is changed, but the variable region of the heavy chain stays the same (the terms “variable” and “constant” refer to changes or lack thereof between antibodies that target different epitopes). Since the variable region does not change, class switching does not affect antigen specificity. Instead, the antibody retains affinity for the same germs (antigens). For example, in the novel Coronavirus, IgM is produced the first day, but later, IgG to the same virus is produced easily because of class switching. Class switching takes place at the RNA level so that there is increased specificity and adaptability\n\nThis discovery was insightful because it questioned two dogmas of biology: that the DNA for a protein must be one continuous piece (for antibody synthesis, the gene segments are separated from each other, then assembled together), and that every body cell has identical DNA (the antibody genes for different B lymphocytes can differ). Current evidence suggests that more than 600 different antibody gene segments exist per cell. Additional versatility is generated through imprecise recombination and somatic mutation. Therefore, the total antibody diversity produced by the B cells ranges from 100 to more than 1,000 immunoglobulin possibilities.\n\nThis system of producing enormous numbers of antibody types is clearly one of intelligent design. One analogy to this is the principle of variation, as found in classical music. For example, J.S. Bach composed selections such as Jesu, Joy of Man’s Desiring, and Variations on a Theme for church choirs. You might hear a basic pleasant melody, then re-encounter it in a different way and conclude this is a detailed, masterful arrangement of music. Nature also selects from “successful” structures and varies them in many wondrous ways for survival, even in this fallen world. Just as Bach composed beautiful music, the Creator has composed a variation on an antibody theme that defends the body.\n\nThe current outbreak of the 2019 Novel Coronavirus (2019-nCoV (fig. 3), upper-respiratory-tract illness first started in Wuhan, China, and cases have been escalating worldwide. Early on, with many cases in Wuhan, China, it was reported that the outbreak had some association with animal markets, which indicated that there was animal-to-person transmission. The most likely animals with coronavirus are bats. Presently, there is no specific antiviral treatment for the 2019-nCoV infection. A vaccine designed to combat severe acute respiratory syndrome (SARS) and the advancement of technology are likely to quicken the time to develop a new vaccine against the 2019-nCoV and will be designed to promote antibodies to battle with this novel coronavirus. Mercifully, there are some cases where people were able to surpass this infection due to their intelligently designed body defense mechanism. An antibody test (such as a sandwich E.L.I.S.A.) will enable us to detect infections so we can portray how widespread the virus is and consequently, determine the true morbidity and mortality rate.\n\nA person’s blood becomes more potent over time as that person prevails and overcomes pathogens and parasites with its newly formed antibodies in high numbers. Antibodies have the secret locked away to defeat the germ that has invaded. The second infection usually has minimal harm; hence, the wise blood has defeated the enemy. When a microbe pathogen or parasite invades the blood, the immune system goes to work. The immune system acts like a Star Wars anti-missile action (Behe 1996). The first action is to recognize the invader. Bacteria have to be distinguished from blood cells, viruses from connective tissue, malaria parasites from liver and spleen cells, etc. Unlike microbiologists, they cannot look at them under a microscope; rather, they have to rely on a chemical sense of “taste/smell/touch.” They have “fingers” of antibody arms. This is part of the fearfully and wonderfully made design of the human body.\n\nThe body must solve the problem of binding to a specific invader with a match of an estimated 1 in 100,000. There may be billions or trillions of antibody types possibly needed in a lifetime.\n\nThere may be billions of different kinds of antibodies. Each antibody is made in a separate B lymphocyte cell. Once made, a factory of antibodies is generated in many plasma cells, and memory cells recall the information for long-term storage of remembering what was encountered. Immunization derives from the brilliant pioneering work of Edward Jenner and Louis Pasteur: they solved the time problem of a quick and efficient immune response for the body. Exposing the body to a weakened or “killed” pathogen shrinks the time for the secondary response of IgG, allowing the body to flood the battle scene with prepared antibodies and overwhelm intruders. The immune response, crafted wisely, was engineered with a mitigating mercy in light of a fallen world. It remembers “germs” and responds swiftly with a counter defense that prolongs life.\n\nBehe, Michael J., 1996. Darwin’s Black Box: The Biochemical Challenge to Evolution. New York: The Free Press.\n\nBrand, P., and P. Yancey. 1984. In His Image. Grand Rapids, Michigan: Zondervan Publishing Co.\n\nGillen, A. L., 2019. Life is in the Blood: How Red Blood Cells Reveal and Magnify the Creator as the Master Craftsman. Posted on August 2, 2019, on the Answers in Genesis Website.\n\nGillen, A. L., 2019. The Genesis of Germs: Disease and the Coming Plagues in a Fallen World . Green Forest, Arkansas: Master Books.\n\nGillen, A. L. and Conrad, J., 2014. Our Impressive Immune System: More than a Defense. Answers in Depth 8 (January 15, 2014), https://answersingenesis.org/human-body/our-impressive-immune-system-more-than-a-defense/.\n\nRoberts, L. S., J. Janovy, Jr., and S. Nadler, 2013. Schmidt and Roberts’ Foundations of Parasitology, 9th ed. Boston, Massachusetts: WCB McGraw-Hill.\n\nTortora, G. J., B. R. Funke, and C. L. Case, 2018. Microbiology, An Introduction, 13th ed. San Francisco, California: Pearson Benjamin/Cummings Pub. Co.", "opengraph": {"title": "Wise Blood: Antibodies, The Principle of Overcoming in Disease (Part 2)", "url": "https://answersingenesis.org/human-body/wise-blood-antibodies-principle-overcoming-disease-part-2/", "description": "The immune system serves more than just to “defend” against disease – it was designed to interact with microbes and to cleanse the body.", "image": "https://assets.answersingenesis.org/img/cms/content/contentnode/og_image/wise-blood-antibodies-principle-overcoming-disease-part-2.jpg", "image:width": "1200", "image:height": "628", "site_name": "Answers in Genesis", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["/creation/", "#fn_1", "#fn_2", "#fn_3", "#fn_4", "/god/", "/church/", "#fn_5", "/human-body/our-impressive-immune-system-more-than-a-defense/"], "authors": [], "publish_date": "Feb. 5, 2020, 6 a.m."}