{"result_id": "032026", "URL": "https://answersingenesis.org/biology/disease/the-first-book-of-public-hygiene/", "timestamp": "2023-04-25 12:06:03 CEST+0200", "meta": {"description": "The nuns at the Yambuku mission hospital were using five unsterilized needles to give injections to hundreds of people each day. Epidemiologists have concluded that this caused the outbreak.", "lang": "en", "keywords": "Hygiene,Leprosy,Panic,Virus", "favicon": "https://assets.answersingenesis.org/img/favicons/apple-touch-icon.png", "canonical": "https://answersingenesis.org/biology/disease/the-first-book-of-public-hygiene/", "encoding": "utf-8"}, "image": null, "domain": "answersingenesis.org", "title": "The First Book of Public Hygiene", "cleaned_text": "The nuns at the Yambuku mission hospital were using five unsterilized needles to give injections to hundreds of people each day. Epidemiologists have concluded that this caused the outbreak.\n\nOn 28 September 1976, the following telegram was received at the World Health Organization Headquarters in Geneva:\n\nThis was the first information to come out of Zaïre (now Republic of the Congo) regarding the Ebola viral epidemic that killed hundreds of infected Africans living in and around the Yambuku hospital, near the headwaters of the Ebola River.2\n\nAmong the more deadly and incurable of viruses is the Ebola virus, named after the Ebola River region in the African Congo, where it was first identified. It has since been found elsewhere in Africa with the same deadly effects. The onset of infection is accompanied by non-specific symptoms such as severe abdominal pains and diarrhoea. Soon the victim is bleeding from many orifices as internal organs liquefy. Doctors suspect that the virus, which equally affects all primates, may have originated in rats. Strangely, some people are totally unaffected by the virus. Outbreaks come in waves and then seem to subside completely. While research continues, little is known for certain of the virus’s origin and mechanisms of infection.\n\nThe nuns at the Yambuku mission hospital were using five unsterilized needles to give injections to hundreds of people each day. Epidemiologists have concluded that this caused the outbreak that occurred simultaneously in 55 villages surrounding the hospital.\n\nThe first to die were those who received the injections. Then the disease moved through families, killing mainly those who had prepared the dead for burial. It also swept through the hospital’s staff, killing nurses and midwives who had contact with patient blood and vomit. It is believed that the Ebola disease may have been transmitted through sexual contact as well.\n\nEbola is only one of a number of newly-emerging killer pathogens that are gaining a foothold throughout the world. Viral diseases such as Lassa fever, Rift Valley fever, hantavirus and dengue are also striking panic and alarm worldwide. Old diseases that had been considered to be no longer health problems are re-emerging in importance. The jet plane and increasing international travel have created the situation in which someone with one of these diseases can travel around the world spreading it even before noticing any symptoms.3 What is worse, there is no cure or vaccine for many of these deadly diseases.\n\nOn the positive side, the first five books of the Bible, the Pentateuch, provide tremendous insight and relief concerning disease prevention. Remarkably, the Pentateuch is regarded as the earliest evidence we have of sound public health and sanitary practices.4 These ancient writings, when used in conjunction with modern medicine, can break the mode of transmission of virtually every scourge known to humanity.\n\nWhat follows is a brief summary of the biblical instructions pertaining to public health and sanitation. Bear in mind that these regulations were practiced some 3,500 years before the germ concept of disease was discovered (mainly by the creationist Louis Pasteur5)!\n\nThe instructions recorded in are strikingly similar to modern disease-prevention techniques.\n\nFor example, anyone touching a person with a “running issue” (that is, a bodily discharge), or anything upon which that person sat or lay, became “unclean”. In addition, should the “toucher” touch someone without first having washed his hands, uncleanness would be transferred to the person he touched as well.\n\nJust a little more than 100 years ago, these precautions were instituted in modern medical facilities to prevent diseases from spreading. “No touch” surgical and dressing techniques are now used.6 Gloves are necessary for persons touching infected areas and careful hand washing is observed before and after patient care. In addition, “universal precautions” require that all bodily secretions be treated as potentially infectious agents.\n\nThe Israelites were instructed to bury their waste material away from the camp ( ). Intestinal diseases such as cholera, amebic dysentery and E. coli enteritis continue even today to take a heavy toll on lives where similar sanitary practices are not observed.\n\nThe Israelites were also admonished to burn used dressings. Garments that contained a growth (perhaps a fungus) were to be washed. If the fungus/growth was removed, the garment was to be rewashed before using again. If not, it was to be burned ( ). Note that a first wash could germinate hardy spores. The new growth could then be removed by rewashing. Objects that were touched by an infected person were to be washed. If the object was pottery, however, washing was insufficient (perhaps due to its porous nature). It was to be destroyed ( ).\n\nToday’s health practices are quite similar. Objects and dressings contaminated with bodily discharges are removed for incineration. Whenever possible, disposable needles, syringes, eating utensils, dishes and other items are used. Non-disposable items are washed, bagged and sterilized.\n\nThe Israelites took great care before diagnosing a person as having leprosy or a similar condition. If there was any doubt as to the certainty of a diagnosis, the person was to be isolated for observation ( ). Once a person was diagnosed with a contagious condition, he was to be quarantined outside of the camp “all the days wherein the plague shall be in him.” He was also required to wear a covering over his mouth, and to warn others by shouting, “Unclean, unclean!” ( and ).\n\nModern hospitals also follow special isolation procedures for persons who have, or are suspected of having, contagious infections. For example, “strict isolation” requires a private room with an independent air supply. The door to this room must be kept closed. Gowns, gloves and masks must be worn by all who enter the room. In addition, a sign must be placed on the patient’s door to warn others of his condition.\n\nDirect contact with the dead (human or animal) brought defilement and required the washing of body and garments ( and ). Contact with objects that had come in direct contact with the dead (such as garments, swords, pots and graves) also resulted in “defilement” and required cleansing or destruction.\n\nFurthermore, when someone died in a tent, all who came into the tent, and all that was in the tent (including every “open vessel”) was declared unclean ( and ).\n\nUntil the late 1800s, it was common practice for physicians and medical students to examine their living patients immediately after participating in autopsies.7\n\nOf course, the pathogens that were present in the bodies of those in the morgue were spread to the hospital wards. When doctors began practising procedures similar to those found in the first five books of the Bible, mortality rates were drastically reduced.8\n\nIf the carcass of an animal was found in drinking water, use of the water was forbidden as “unclean”. If, however, the water source had a continual supply of fresh water, such as a spring, it would remain “clean” because of the tendency of such water to renew itself ( ). In addition, all food and water within a vessel that came in contact with a dead animal or an infected person was declared unclean ( ).\n\nToday, we know that failure to heed any one of these precautions could result in the transmission of infectious microorganisms.\n\nThe Israelites were clearly forbidden to have any sexual relationships outside of marriage ( , and ). The biblical plan of husband and wife constituting an exclusive married unit ( , ; ) certainly prevented the spread of venereal diseases.\n\nBecause of man’s failure to heed this admonition, sexually transmitted diseases continue to be the world’s leading contagious diseases.9\n\nThe biblical record clearly indicates that diseases are communicable and that the best protection against them is to prevent their spread. It is noteworthy that these ancient records do not contain a single medical misconception! I don’t claim that Moses understood the basis of modern medicine, but that God, who inspired Moses” writings (including the outline of the world’s true history given in Genesis), certainly did.\n\nMore importantly, the Bible deals with the most deadly disease ever to plague mankind—sin ( ; ). Like every good physician, God offers the prescription for this killer disease as well: a personal saving relationship, through faith, with His Son, the Lord Jesus Christ ( ).\n\n“But He was wounded for our transgressions; He was bruised for our iniquities; the chastisement of our peace was on Him; and with His stripes we ourselves are healed … Yet it pleased the LORD to … put forth His soul as a guilt-offering” (Isaiah 53:5, 10a).", "opengraph": {"title": "The First Book of Public Hygiene", "url": "https://answersingenesis.org/biology/disease/the-first-book-of-public-hygiene/", "description": "The nuns at the Yambuku mission hospital were using five unsterilized needles to give injections to hundreds of people each day. Epidemiologists have concluded that this caused the outbreak.", "image": "https://assets.answersingenesis.org/img/cms/content/contentnode/header_image/disease.jpg", "image:width": "945", "image:height": "300", "site_name": "Answers in Genesis", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["#fn_1", "#fn_2", "#fn_3", "#fn_4", "#fn_5", "#fn_6", "#fn_7", "#fn_8", "#fn_9", "/god/"], "authors": [], "publish_date": "Dec. 1, 2003, midnight"}