{"result_id": "032004", "URL": "https://answersingenesis.org/biology/microbiology/bacteria-survival-growth/", "timestamp": "2023-04-25 12:05:35 CEST+0200", "meta": {"description": "In a pure culture growing in a liquid medium, we find that the development and decline of bacterial populations follow a definite, predictable course.", "lang": "en", "keywords": "Growth,Spores", "favicon": "https://assets.answersingenesis.org/img/favicons/apple-touch-icon.png", "canonical": "https://answersingenesis.org/biology/microbiology/bacteria-survival-growth/", "encoding": "utf-8"}, "image": null, "domain": "answersingenesis.org", "title": "Bacteria Survival and Growth", "cleaned_text": "Certain kinds of bacilli are capable of changing into resistant bodies called spores (or endospores). Each individual bacillus becomes converted into a single spore, except in a few rare species where two spores appear to form in a single cell. The spore can withstand comparatively high temperatures and other unfavorable influences, keeping the organism alive when it would otherwise perish. When suitable conditions are supplied, the spore germinates and returns to the original bacillus form. This remarkable property is confined to a few species of bacilli only, but has great practical importance. The aerobic, spore-forming bacteria make up the genus Bacillus, and the anaerobic species are classified in the genus Clostridium.\n\nSome spore-bearing bacilli change to the spore form more readily than others, and certain types of culture media or other environmental conditions tend to favor sporulation, while other circumstances suppress it. Sporulation is always preceded by a period of active multiplication, and nearly all the organisms in the same culture begin to form spores at about the same time. The conversion of the bacilli into spores preserves the life of individual organisms subjected to an unfavorable environment, thus perpetuating the species under circumstances that would destroy non-spore-bearing organisms. It is important to note, however, that sporulation is clearly a regular habit of spore-forming bacteria and part of their normal cycle of development, irrespective of any special need for protection from injurious influences.\n\nSpore formation may be suppressed by cultivation under unusual conditions—for example, at abnormally high temperatures (as Pasteur showed with anthrax vaccines), on deficient media, or when sufficient access to oxygen is denied. In general, endospore formation is favored by the same conditions favoring active growth, though it may be inhibited by factors that do not measurably influence the amount of growth.\n\nSince, as a rule, only one spore is formed from a single bacterium, spore formation is not a method of multiplication. Certain conditions must be maintained for bacterial growth. Temperature is one important factor. Some bacteria can be active at temperatures as warm as 100°C (212ºF) or as cold as 0°C (32ºF). The desired temperature for parasites in human hosts is 37°C (98.6ºF) body temperature, which is normal. Another factor affecting bacterial growth is moisture. Relatively active bacteria contain approximately 90 percent water. Dryness will destroy most species. Another important factor in bacterial growth is proper atmosphere. Aerobic bacteria require free oxygen for respiration. Anaerobic bacteria (those not needing free oxygen) may dwell at the bottom of a pond, lake, or ocean.\n\nLike us, food is necessary for survival of bacteria. Their diet varies from living tissue to agar. Some bacteria are autotrophs; they can make their own food. The breakdown of inorganic sulfur, iron, or nitrogen compounds often secretes energy. Few bacteria undergo photosynthesis. The majority of bacteria are heterotrophs, unable to make their own food. This majority enjoins the fight for survival between human beings and bacteria. Bacteria need sources of vitamins, minerals, sugars, salts, and sometimes protein.\n\nThe life of a bacterium or other microorganism is, of course, profoundly influenced by the character of the other organisms present, and by the moisture content, pH, temperature, and other factors in its immediate environment. Hence, the number of living individuals of one species likely found in any one place fluctuates greatly and unpredictably from time to time. In the highly artificial conditions of a pure culture growing in a liquid medium, however, we find that the development and decline of bacterial populations follow a definite, predictable course. By counting the number of living bacteria in the culture at different time intervals during incubation, then plotting these data in relation to time, we may derive a growth curve.\n\nIt is customary to divide the growth curve into several parts, but these may be combined into four chief phases: the lag phase (A to B), the logarithmic growth phase (B to C), the stationary phase (C to D), and the death or decline phase (D to E). The lag phase usually lasts no more than a few hours. During the first part of this phase there is no apparent increase, and even a reduction, in the number of living organisms, for some of the bacteria may die while others are unprepared for active multiplication. The bacteria are adjusting to a new environment, synthesizing enzymes and actively metabolizing, though cell division is not yet occurring. The lag phase ends when the organisms finally begin dividing with increasing rapidity.\n\nDuring the logarithmic (log) growth phase, organisms multiply at a constant, maximum rate. The bacteria increase in number by geometrical progression (two divide to make four, four to make eight, eight to make sixteen, etc.), and if the logarithms are plotted in relation to time we get a straight, steep line as in the chart below (B to C). With a number of bacteria, for example the colon bacilli and the cholera spirilla, the generation time (i.e., the time between the formation of a new bacterium and its division to form two new cells) may be as short as 20 minutes. Organisms such as staphylococci and streptococci are said to multiply almost as rapidly, whereas other species, such as diphtheria bacilli, increase at about half this rate. A few bacteria apparently always multiply, even during this logarithmic phase, at a markedly slow rate; the generation time of tubercle bacilli in laboratory media, for example, is said to be about 18 hours.\n\nWhatever the species of organism, the logarithmic growth phase is brief. The reduction in available food substances, accumulation of waste products, and lack of sufficient oxygen force the culture into the stationary phase, when organisms are less active and divide less frequently. The total number of living organisms remains practically constant, the death rate balancing the multiplication rate. The bacterial population reaches its greatest density within 24 to 48 hours when incubated at 37°C. The death or decline phase then sets in; the organisms gradually cease multiplying entirely. The death phase may be as rapid as the growth phase. The bacteria eventually die as nutrients decline and waste products build up. Not all the bacteria in a culture are in the same phase at the same time. Some organisms proceed to the next phase before others, and some lag behind. Thus, a gradual rather than abrupt transition generally occurs from one phase to the next.\n\nThe ABCs of Anthrax: Its Anatomy, Bioterror, and Creation In 2001, we witnessed the greatest terrorist attack in the United States, including the release of anthrax in mail envelopes. Prior to 9/11, the few people acquainted with anthrax were microbiologists. Most Americans wondered if anthrax was a new disease; it actually dates back to the plagues described in Exodus. Anthrax derives its name from the Greek word for “coal,” anthrakis, because the disease causes black, coal-like skin lesions. It is caused by Bacillus anthracis, a Gram-positive, spore-forming, rod-shaped bacterium. Anthrax spores germinate upon entering an environment rich in nutrients, such as found in animal or human tissues. The rapidly multiplying bacilli have poor survival rates outside their hosts, dying within 24 hours. This contrasts with the environmentally hardy properties of the spore that can survive for millennia. Since ancient times, anthrax has played major roles in history, including the plagues recorded in Exodus 9. When the Lord visited Egypt with a “a very grievous murrain” upon Pharaoh’s cattle ( ), the severe plague was most likely anthrax. Tough Bacillus anthracis spores can persist for years in alluvial soil like in the Nile Valley, ravaging herds that venture near the aerosol. In this case, the Israelites were probably spared because they camped on sandy ground above the river’s flood plain. A miracle of highly directed winds (from the Creator) could have stirred up alluvial soil in Egypt, affecting only those in the immediate area. Stricken livestock dying in the grip of anthrax’s gruesome spasms and convulsions would definitely seem cursed. Anthrax is known as a zoonotic disease because people catch it from animals—mostly cattle, sheep, horses, etc.—and not from other people. Spores enter humans through cuts, tainted meat, or inhalation. The spores multiply, producing enough toxin to injure surrounding cells and tissue. In a subsequent plague ( ), Moses was instructed to release “ashes,” and boils came upon the Egyptians. These ashes may have contained anthrax spores, serving as the Creator’s biological warfare agent for judgment, with death coming quickly. In Europe during the 1800s, anthrax ravaged livestock workers. Robert Koch formulated his famed postulates in 1876 by developing methods to grow pure cultures, testing them in guinea pigs, and proving the germ cause of anthrax. Since anthrax was concurrently devastating sheep flocks, Louis Pasteur was summoned to produce a vaccine against it. Pasteur’s vaccine not only saved millions of animals, but also led to a human vaccine as well. Today, government agencies are expanding technologies for anthrax detection because it is quite probable that anthrax will be used again in biological terrorism. An electron micrograph of spores from the Ames strain of Bacillus anthracis bacteria.", "opengraph": {"title": "Bacteria Survival and Growth", "url": "https://answersingenesis.org/biology/microbiology/bacteria-survival-growth/", "description": "In a pure culture growing in a liquid medium, we find that the development and decline of bacterial populations follow a definite, predictable course.", "image": "https://assets.answersingenesis.org/img/cms/content/contentnode/header_image/microbiology.jpg", "image:width": "945", "image:height": "300", "site_name": "Answers in Genesis", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}