{"result_id": "032043", "URL": "https://answersingenesis.org/origin-of-life/louis-pasteurs-views-on-creation-evolution-germs/", "timestamp": "2023-04-25 12:06:22 CEST+0200", "meta": {"description": "Shortly after Darwin published On the Origin of Species, Pasteur began to challenge the idea of spontaneous generation.", "lang": "en", "keywords": "Origin of species", "favicon": "https://assets.answersresearchjournal.org/art/apple-touch-icon-57x57.png", "canonical": "https://answersingenesis.org/origin-of-life/louis-pasteurs-views-on-creation-evolution-germs/", "encoding": "utf-8"}, "image": null, "domain": "answersingenesis.org", "title": "Louis Pasteur’s Views on Creation, Evolution, Genesis of Germs", "cleaned_text": "Although his scientific pronouncements were sometimes abrasive to his fellow scientists, he remained firm in his convictions, borne from painstaking research. Pasteur had a strong religious and humanitarian spirit. He firmly believed in God, as the Creator of all living things. From his knowledge of the Gospels, he wanted to benefit mankind by having his ideas used to “heal the sick.”\n\nPasteur had the uncanny ability to combine theoretical, operational, and applied science—the mark of a truly gifted scientist. Pasteur understood the variability of microbes and how he could apply this principle in vaccine preparation. For example, he noticed that Bacillus anthracis cultures sometimes lose their pathogenic ability when heated and then retain this modified, nonvirulent, or “attenuated” trait through many generations. He applied this concept to vaccinate dozens of sheep that would have otherwise died at a critical time in France. His understanding of this natural variation was also successfully applied in developing vaccines for chicken cholera and rabies.\n\nShortly after Darwin published On the Origin of Species in 1859, Pasteur began to challenge the idea of spontaneous generation—the foundation of the evolutionary view on the origin of life. Pasteur’s simple but elegant swan-necked flask experiments not only put to rest the organic life-from-non-life idea but also set the foundation for the law of biogenesis: life only comes from life. The genesis of germs in hospital patients was the result of microbes having parents, not a result of spontaneous generation. This revolutionary idea would have application in many areas of medicine. It forms the basis of sterilization, asepsis in surgery, and the germ theory of disease.\n\nIn past years revisionist historians have been rewriting the worldview of Christians who have made some of the major discoveries in biology and medicine. It appears that postmodern revisionists are rewriting history to support their agenda of a more “secular” explanation to science. The Judeo-Christian worldview is not politically correct in most universities. This is true in regard to past scientists such as Louis Pasteur who believed in creation. According to reliable, primary sources such as René Vallery-Radot, Pasteur’s son-in-law, Pasteur’s unique view and application of operational science gave him a significant advantage, benefiting mankind in a number of critical areas.\n\nWe are in danger of losing the remembrance of noble-minded biologists with a creation worldview through whom God poured out scientific achievements. Indeed, the memories of man’s past discoveries in all fields are soon forgotten unless we are reminded. Many people are familiar with the name Louis Pasteur (fig. 1) and his amazing accomplishments in pasteurization, vaccination, and the germ theory of disease. Yet, few know the details of his early life regarding the spontaneous generation controversy or his religious faith. In recent years, Pasteur’s view on evolution and God’s creation have been openly challenged. The movement to revise history in America is hardly surprising as Western civilization has become increasingly hostile regarding its Judeo-Christian roots. In an alarming trend, history continues to be altered by politically correct revisionist historians. This article challenges the secular historian’s efforts to rewrite the life, beliefs, and discoveries of Louis Pasteur, in particular, his views on origins, the Christian faith, and his work on spontaneous generation as it relates to the germ theory. Although we have consulted over twenty-five biographies, we have focused on primary sources and quotes, with many references over eighty years old.\n\nThe most extensive biography of Louis Pasteur was by his son-in-law, René Vallery-Radot. The first biography of Pasteur was written by Vallery-Radot in 1883, under Pasteur’s direct and close supervision. This first book was in effect Pasteur’s ghostwritten autobiography. (At this point in his life, he was partially paralyzed and needed assistance on many tasks.) The details of this book are believed to be the most accurate of any book written about Pasteur. Vallery-Radot’s eyewitness account of Pasteur offers rare glimpses of his motivations, family life, faith, and compassion. René Vallery-Radot frequently mentions Pasteur’s love of science and his desire to heal the sick, in addition to his genius in scientific matters. This biography would later be expanded to a two-volume set—still the most extensive biography ever written on Pasteur.\n\nLater, Pasteur Vallery-Radot, Louis Pasteur’s grandson, wrote several books that provide personal biographical information. These books include eyewitness accounts by people who knew Pasteur when he was a child. René offers more details and greater accuracy, but René’s son, Pasteur Vallery-Radot, writes in an easier, more engaging style. Pasteur Vallery-Radot is easier reading, but he is less familiar with eyewitness details of his grandfather’s life. In most details of Louis Pasteur’s private and personal life, the books are in agreement. Since both authors are family, they convey a personal touch in the scientific life of Louis Pasteur. Each of their books is worth reading. However, by the 1950s Pasteur Vallery-Radot’s books speculate that his grandfather’s view on the origin of life would allow for the one-time “spontaneous generation” of life (like Stanley Miller’s experiment).\n\nThis reflection differs from the eyewitness account of his father (René). Otherwise, the accounts are parallel.\n\nLouis Pasteur’s calling was to investigate God’s creation and to help mankind through his discoveries. Let no one claim that faith in God is a detriment to science! Pasteur said, “The more I study nature, the more I stand amazed at the work of the Creator.” In his last famous speech, he says:\n\nAt first glance, Pasteur’s achievements seem to be a miscellaneous assortment of discoveries (table 1). They in fact form a cohesive whole, in which one can easily follow his unity of thought. We have tried to describe just a few of his projects that led to his remarkable discoveries. You will see that, like a brilliant detective, this great man of science conducted investigations using his wealth of experience and scientific guidelines. It is this method of study that held true for other men of God, each one of whom was called and was devoted to a particular field dealing with a specific problem.\n\nIn each instance, once Pasteur had identified the cause of the problem, he suggested a remedy for it. It is most remarkable that Pasteur managed to discover the keys to all the enigmas with which he was confronted, be they rabies (fig. 2) or sour wine. One cannot help but be struck by Pasteur’s incredible ability to reveal these scientific mysteries. He was truly a scientist who sought to understand the truth of God’s living creation.\n\nLouis Pasteur began his scientific career by studying the forms of certain crystals under a hand lens. This led to the study of the diseases of milk and vinegar, and then to the diseases of people and animals. While wholly absorbed in a task, he was nonetheless able to discover ideas regarding other matters that incidentally were set before him. In this way he opened up a number of paths allowing others to further the progress of science. In fact, it is generally acknowledged that modem aseptic surgery is based on the results of Pasteur’s pioneering work. Louis Pasteur never divorced theory from practice, and his investigations often led to industrial plans of first-class importance (i.e., pasteurization). Before he died Pasteur was to know the supreme satisfaction of saving many lives of his fellow man.\n\nAlmost all historians recognize Pasteur’s great contributions to science, microbiology, and medicine. He was an experimentalist and daily performed operational science. Pasteur is a prime example of the principle that one does not have to be an evolutionist to conduct good science. However, in recent years his Christian and creation views are being challenged. His most straightforward, anti-evolution remarks came from his studies on whether life can spontaneously arise. His case for special creation is best seen in his experiments disproving spontaneous generation. These experiments took place over a period of about five years. It was during this time that Pasteur “converted” from being a chemist to a microbiologist.\n\nOverview to the Theory of Biogenesis vs. Spontaneous Generation\n\nThe discovery of microorganisms raised an intriguing question: “Where did these microscopic forms originate ” For thousands of years, the idea of spontaneous generation stated that organisms, such as tiny worms, can arise spontaneously from non-living material. This idea began to fall into disfavor due to the work of Francesco Redi. In a simple but significant experiment, he demonstrated that worms found on rotting meat originated from the eggs of flies, not directly from the decaying meat as advocates of spontaneous generation believed. To prove this, he simply covered the container holding putrefying meat with gauze fine enough to prevent flies from entering the container to deposit their eggs. Worms appeared on the surface of the gauze—but not the meat. Perhaps Redi (1668, p. 26) put it best when he said:\n\nSpontaneous generation devotees stated that life could appear without the hand of God, prompting skeptical scientists to study this tenuous doctrine. Despite Redi’s compelling findings, the idea of spontaneous generation was still difficult to totally disprove, and it took about 200 more years to refute this idea. One reason for this was that the gauze used by Redi could not prevent the development of microorganisms (bacteria and mold) on the meat’s surface, giving comfort to Pasteur’s opponents. New experiments were needed to reveal the unscientific nature of spontaneous generation.\n\nThe traditional experiment designed to determine whether microbes could arise and thrive from non-living material consisted of vigorously boiling a soup of organic material in a vessel to sterilize it (fig. 3). The vessel was then quickly sealed to prevent any outside air from entering. If the solution became cloudy after several days, one could then conclude that microbes must have arisen from the organic material in the vessel, thus supporting the theory of spontaneous generation. Unfortunately, this experiment did not consider several alternative possibilities that would cause the cloudy condition: the flask could have been improperly sealed, microorganisms might be present in the air, or boiling might not have killed all forms of life (i.e., spores). Therefore, it was not surprising that when this experiment was performed, different investigators obtained different results. A unique and common-sense experiment was needed that would address and explain these possibilities.\n\nIn 1861, Pasteur published a refutation of spontaneous generation that was a masterpiece of experimental science and logic. First, he demonstrated that air is alive with microorganisms. This was done by filtering air through a cotton plug, trapping microorganisms and examining them under a microscope (see below photo). Many of these trapped organisms looked identical to those that had previously been observed by others in many infusions. Infusions are liquids containing nutrients in which microorganisms can proliferate. Pasteur showed that if the cotton plug was then dropped into a sterilized infusion, it became cloudy because the organisms quickly multiplied. Most notably, Pasteur’s experiment demonstrated that sterile infusions would remain sterile in specially constructed swan-necked flasks even when they were left open to the air. Gravity caused the airborne organisms to settle in the bends and sides of these unique flasks. The fluid in the flask remained sterile. Only when the flasks were tipped could bacteria enter the broth and grow, as evidenced by forming a cloudy solution. These simple and elegant experiments finally ended the arguments that unheated air or the infusions themselves contained a “vital force” necessary for spontaneous generation.\n\nThe theory of biogenesis states that life can only come from other life. This idea mirrors the principles of : life begets life and like begets like. Yet evolutionists imagine that at one time several billion years ago, life did spontaneously appear. For example, German organic chemist Dr. Günther Wächtershäuser and his colleague Dr. Claudia Huber of the Munich Technical University have suggested that the first polypeptide chains necessary for life formed at the bottom of a primal ocean, in the heated environment of undersea volcanoes. But science continues to show a total lack of evidence that would suggest any living cell (even the smallest) could originate spontaneously through time and chance. Recently the evolutionist Franklin Harold (2001, p. 218) said, “The crux of the matter is that living organisms cannot be rationally and systematically deduced from the principles that generally do account for the properties of inanimate matter.” It has always been known that Louis Pasteur opposed the doctrine of spontaneous generation, and he presented compelling empirical evidence against it. He believed that the idea of spontaneous generation did not fit with the view of God as the Creator of life.\n\nProtestant François Guizot, a historian and politician, came to the defense of the Catholic Church against the materialist attack, which he saw as an assault upon the Christian faith. In an 1862 book, he insisted that “under the blows that [the materialists] bring against Christian dogma, the entire religious edifice collapses and the entire social edifice shakes; the Empire, the essence of religion itself, vanishes” (Geison 1995, p. 124). Flames were fanned by the appearance of Clemence Royer’s French translation of Darwin’s On the Origin of Species in 1862. Darwin’s book was even more explosive since Royer advocated every doctrine conservative forces hated: atheism, materialism, and republicanism. Her preface to the Origin was an extended attack against the Catholic Church, which she described as a “religion spread by an ignorant, domineering, and corrupt priesthood” and which she identified as the major cause of all social ills. It is hardly surprising, then, that Darwinian evolution was regarded in France as a political and religious doctrine allied with the forces that threatened church and state. Nor is it surprising that so many French critics of Darwinian evolution focused on the issue of spontaneous generation. Beside its historical association in France with evolutionary theories, spontaneous generation was seen as a threat to the doctrine of a providential Creator.\n\nAgainst this background, a great debate arose between Louis Pasteur and Félix-Archimède Pouchet. Pouchet was a leading French biologist of the nineteenth century who was openly advocating the idea of spontaneous generation. He asserted that new life could arise from primordial raw elements that had no parents. Pouchet had a new twist to the old spontaneous generation argument. He said that living things could arise as “plastic manifestations” that tend to group molecules together and to impose on them a specific mode of vitality leading to life (Debre 1998, p. 157). The debate between these two men carried implications of enormous importance to the political culture of the French Empire, as had the Cuvier-Geoffroy debate in earlier years. The great British anatomist Richard Owen, who lived through both debates, emphasized their similarity in 1868, the analogy of the discussion between Pasteur and Pouchet, and that between Cuvier and Geoffroy, is very close. In part, this analogy rested on the circumstance that Pasteur, like Cuvier, had the advantage of being consistent with the culture’s biblical worldview. Pouchet was also attempting to convince others of his positions on the “origin of monads” (i.e., bacteria) and on the origin of species. He was attempting to provide arguments for evolution. Even Richard Owen, a foreign outsider, could clearly see, in nineteenth-century France, the debate over spontaneous generation had found implications over how to interpret Genesis, bringing the French Academy of Sciences into the “battle” over origins (Geison 1995).\n\nDuring this time Pasteur conducted milk and butter experiments—showing microbes as being the source of spoilage, not spontaneous generation. Previously, Roman Catholic priest Father Lazzaro Spallanzani had shown similar findings in 1765. His heretical ideas of biogenesis were finally vindicated—all microbes indeed have parents. On March 11, 1857, Pasteur initiated his experiments on milk spoilage, called lactic fermentation. He took careful notes day after day. Pasteur observed the appearance of some well-characterized lactic ferment. “Milk diseases,” he concluded, were caused by bacteria (Vallery-Radot 1901). Pasteur’s brilliant germ theory has withstood the test of time. Essentially this theory exposed microorganisms as the source of infectious diseases. Using his chemistry background, Pasteur postulated that the milk souring was caused by microbes which convert milk sugar into lactic acid. Today, we know this change is caused by streptococci and lactobacilli, bacteria that are used in the dairy industry to produce yogurt.\n\nPasteur hypothesized that microbes in fermentation perhaps had a parallel mechanism with regard to infectious disease. The expression “diseases of wine” was first used in 1857 to designate the souring of fermented grape juice by microbes. From 1867 to 1870, Pasteur studied two important silkworm diseases and identified the responsible agents as protozoa and bacteria. He provided a brilliant scheme describing each of these cause and effect relationships. By 1877, the germ theory of disease was so firmly established that even Pasteur’s critics could not counter the evidence (Dubos 1962).\n\nDespite the growing trend elsewhere in Europe, Pasteur came to oppose evolution. His opposition was also against Lamarckism and Pouchet’s naturalistic ideas. At the same time the French scientific elite campaigned vigorously against Darwinism based on Pasteur’s experiments exposing spontaneous generation. In fact, Mrs. Flourens, who succeeded George Cuvier as secretary for the French Academy of Sciences, opposed Darwinism. The French Academy of Sciences published Flourens’ Examining the Book Written by Mr. Darwin Concerning the Origin of Species (Examen du livre de M. Darwin sur l’origine des especes) in 1864. The theme of the book was that Darwinian evolution depended on the occurrence of spontaneous generation and therefore could not be considered because spontaneous generation was false (Farley 1974). Pasteur not only gave light to the question of origins, but he also resolved it. Other leading French scientists rallied to the cause because of political and religious implications of evolutionary ideas. In this politically charged climate, many members of the French scientific elite preferred Pasteur over Pouchet on political and scientific grounds. Many of these scientists joined the two-pronged attack against Darwinism and spontaneous generation.\n\nNo one seemed to pay attention to Pouchet’s insistence, like others before him, regarding spontaneous generation. Pouchet was associated with the forces of materialism, transformism, and atheism. But whatever the title, the doctrine of spontaneous generation was too dangerous to tolerate. A majority of the French scientific community was allied against spontaneous generation. Pasteur, in spite of the entreaties of friends and colleagues who said he was wasting precious time, could not resist returning to the battleground. He felt a sense of patriotic duty and religious conviction to confront Pouchet and the dangerous new liberalism of Europe. In 1864 Pasteur gave his famous speech that provided his final “proof” that dismissed spontaneous generation (see summary box below).\n\nPasteur not only refuted the strange idea that one can get something from nothing, but he maintained life must come from other life or the Author of Life. This soon led to an understanding of both disease prevention (via aseptic techniques) and the germ theory of disease. He clearly demonstrated that infectious disease does not spontaneously appear as “miasmas” (a poisonous gas formerly thought to arise from swamps and cause disease) but was the outcome of disease-causing germs. Later, Joseph Lister (fig. 4), Christian physician and creationist, developed the idea of using aseptic techniques (fig. 5) in surgery (Brock 1961, pp. 58–65). The idea of biogenesis was antecedent to the concepts of both asepsis and the germ theory of disease. Because creation thinking embraces truth, real science, and God’s blessing, it frequently leads to life-saving practical applications, especially in the world of medicine. Pasteur was the first to successfully explain the genesis of germs and their implications.\n\nPasteur and the Germ Theory of Disease\n\nA foundation in biology is the germ theory of disease. Although some may argue that this theory has its origin with Girolamo Fracastoro in 1546, the name most closely associated with the idea that germs cause disease is Louis Pasteur (Brock 1961, pp. 69–75). It was Pasteur who developed his ideas of fermentation and experiments on milk and wine spoilage indicating disease by microorganisms. Prior to Pasteur, the connection between microorganisms and disease was not apparent since many microbes were known to be beneficial for humans (yeasts added to bread, or starter cultures for yogurt and cheese) and evidently did not cause disease. (The Jews, however, did seem to understand the idea of contagion—Moses had given them instructions for those with infectious skin diseases in the book of Leviticus.)\n\nThe Battle over the Anthrax Vaccine\n\nIn Europe during the 1800s, anthrax ravaged livestock, especially sheep. In some fields of France more than 10% of the sheep were dying. Robert Koch and Louis Pasteur had both reached the conclusion its cause was the bacterium Bacillus anthracis. Since sheep were vital to France’s economy, anthrax was devastating thousands of herds. In 1878, Louis Pasteur was summoned by concerned stock handlers to possibly produce a vaccine against anthrax. It was an uphill battle; many doubted and were skeptical of this strange science called vaccination. Ever the humanitarian Pasteur went to work, and after several weeks of vaccination, the sheep with vaccination survived and those without the vaccine died. Once again, Pasteur’s tireless work paid off. His vaccine not only saved millions of animals but also led to a human vaccine as well (Gillen 2007).\n\nDuring Pasteur’s initial anthrax investigation a wager had been made at Pouilly-le-Fort over whether the vaccine would work. Most veterinarians, French scientists, and doctors had still not embraced the germ theory of disease. They believed anthrax was somehow caused by an imbalance in the sheep’s body or some deleterious chemical. A public wager was announced. But soon it was obvious that Pasteur had gained another victory, further substantiating the germ theory. It was recorded that Pasteur stood in his carriage and addressed his opponents through the crowd. He was thrilled and triumphant by the recent victory and biblical in his enthusiasm, declaring: “Here it is! Oh ye of little faith!” (Debre 1998, p. 400). Pasteur, the Father of Microbiology, quoted Jesus in . Does this sound like an agnostic, Darwinist, or deist as some revisionist historians have declared?\n\nA skeptic of Pasteur made the following questionable assertion regarding the evolution of the anthrax bacillus:\n\nThe quote from Pasteur given above, without the parenthetical statement, appeared in an article co-authored by Pasteur (Pasteur, Chamberland, and Roux 1881, p. 203). The parenthetical statement was added at a later time by an unknown author. Neither Vallery-Radot nor any of the early documents state Pasteur believed that evolutionary theory was related to the virulence of anthrax. Pasteur used the word evolution to refer to change within a species, or the variability of bacterial strains. Pasteur understood the variability of microbes and how he could apply this principle in vaccine preparation. He applied this concept to vaccinate dozens of sheep that would have otherwise died at a critical time in France. His understanding of this natural variation was also successfully applied in developing vaccines for chicken cholera and rabies.\n\nIn addition, the concept of changing the virulence from a pathogen to an attenuated (weakened) microbe has nothing to do with neo-Darwinism (descent with modification). In the case of the anthrax bacterium (Bacillus anthracis), it was heated to a temperature of 43 ºC. This destroyed the plasmid-encoding toxin gene but kept the bacterium alive. In fact, it loses information—in this case the pathogenicity gene (that Pasteur was unaware of). This weakened bacterium was injected by Pasteur into sheep to generate enormous antibody production against pathogenic B. anthracis (the real germ) when it would later be encountered. Clearly, Pasteur understood the basic dynamics of virulence, even though he did not know about antibody production. Was it a horizontal change within a created kind? Yes! Was it vertical change between created kinds? No!\n\nSkeptics, eager to downplay or denigrate creation scientists of the past, have rewritten the history of Pasteur and changed him into a skeptic embracing evolution and Darwin’s ideas. Yet his son-in-law, an eyewitness, writes in The Life of Pasteur, the most extensive biography yet written about Pasteur, regarding his last days of faith in Christ:\n\nOn January 1, 1895 (nine months before his death), his colleague and friend Dr. Emily Roux brought him the flasks that Pasteur had used to disprove spontaneous generation (Vallery-Radot 1911, vol. 2, pp. 238–239), the mythical idea that life can “pop” into existence by time and chance. Pasteur seemed to reaffirm his belief in the Creator with no hint that Darwinism had replaced his belief. Then, for those who are skeptical about his belief in Christ, we go to the last day of his life, September 28, 1895 (4:40 p.m.), Louis Pasteur was found holding his wife’s hand with one hand and a crucifix with the other. He tightly gripped both for twenty-four hours. Does this sound like a man who had lost his faith in the Creator and in Christ?\n\nPasteur’s abundant life and series of remarkable discoveries can only be attributed to genius and tenacity in the face of numerous skeptics. Indeed, he was a genius and was very resolute in all his efforts. Today, like Thomas Edison, he would be described as a workaholic. Yet his was a labor of love, and he had a genuine desire to help mankind. No doubt these attributes can be said of many other scientists. But few can claim the lifetime achievements that Pasteur earned. The hand of God seemed to be behind him. Like the providential scripting of the book of Esther in the Bible (where God is not mentioned explicitly), we see a series of remarkable accomplishments.\n\nPasteur had been trained not in biology or pathology but in physics and organic chemistry. He first achieved international fame at the age of twenty-seven by his crystallographic studies and his discovery of isomerism. It was through measurements of optical rotation of organic acids that he was led, by many indirect steps, to recognize that the conversion of sugar into alcohol (in wine) or lactic acid (in milk) is caused by microbes. In his first biological paper, published in 1857 at age thirty-five, he boldly formulated what he called the germ theory of fermentation. This theory proposed that each type of fermentation is caused by a specific kind of microbe. He suggested that this theory could be generalized, and even suggested a specific microbial etiology of disease. Eventually the hypothesis of specific etiology led him to specific vaccinations and the germ theory of infectious diseases.\n\nThroughout his life, Pasteur stated that he had been “led” by an inescapable logic. He proceeded from designed crystals and optical rotation to fermentation studies and microbial control, and eventually to microbial diseases and specific vaccinations. One can recognize majestic and perhaps Divine ordonnance (Fr. architecture) in Pasteur’s scientific achievements. Although he started as a chemist and tried to solve the enigma of life’s origins, it was later in his career that he focused on solving infectious diseases that threatened animal and human life. Through it all, he never lost his early interest in crystalline asymmetry and biogenesis. Pasteur began in 1844, by sorting out right- and left-handed crystals, and spent the rest of his life just as patiently (and fruitfully) sorting right-and left-handed facts until the Creator revealed the secrets of microbes and germs.\n\nGiven the state of biology in the nineteenth century, Pasteur certainly took the right path in his pursuit of chemistry and what would later be called microbiology. Certainly the Hand of the Creator was guiding him. He discovered the particular causes of fermentation and later the specific origins of infectious diseases that led to lifesaving vaccinations. Pasteur’s writing regarding fermentation, putrefaction, and germ theory soon reached Christian surgeon Joseph Lister (1827–1912). Under Pasteur’s influence, Lister postulated that microbes cause wound suppuration (noxious pus in wounds). Lister suggested that microbes be controlled or eradicated in medical work. He developed the first antiseptics and later aseptic surgery that would protect millions from fatal and nonfatal infections that occurred during surgery. In addition, Pasteur was the first to notice the antimicrobial effects that some bacteria have on pathogenic bacteria. He noticed that some bacteria produced antibiotics against other competing bacteria. He noticed this in his milk studies in 1857 and then more graphically in this anthrax studies in 1878. Many historians of science recognize the significance of his observation that when Pasteur placed pathogenic bacillus in contact with soil microorganisms, they lost their virulence. He had a vision of an antimicrobial effect (through antibiotics) that Alexander Fleming (discoverer of penicillin) and others would realize and exploit a half-century later.\n\nThe biological sciences and medicine could not have proceeded without the precise knowledge provided by the concepts of biogenesis (life comes from life) and the germ theory of disease. Microbiologists and medical scientists profit from the pioneering work of Pasteur’s creation thinking, especially Joseph Lister and those who pioneered aseptic surgery. Untold numbers of lives have been saved. It is clear that the Hand of Providence was moving as Pasteur was conducting his experiments. Perhaps, R. C. Sproul (1996, book cover) summarized it best, “The invisible hand that governs the universe with ‘perfect intentionality’ has worked for the good of those who love him.”\n\nIn 1888, a grateful France founded the Pasteur Institute. In the closing paragraphs of his inaugural speech,\n\nThe biography of Louis Pasteur is fascinating and complex. Granted, some of his beliefs and statements are not considered biblically orthodox. For example, he said the Rosary and was involved in other Roman Catholic rituals. However, he clearly had a strong belief in God and held to most Roman Catholic doctrines. Although he was not a young-earth creationist (YEC or biblical creationist) in the modern sense (he lived in a different time, continent, and culture), Pasteur was clearly skeptical of Darwin’s idea of evolution. Little is said about his beliefs on the age of the earth. But from a few anecdotal remarks, there is reason to believe that he believed in a recent creation, not one evolving over millions of years.\n\nHe also had a high view of human life and dignity, loved the compassionate virtues and ideals of the gospel, and held a high view of Jesus as the Son of God. In his address Pasteur said, “These are the living springs of great thoughts and great actions. Everything grows clear in the reflections from the Infinite.” Some of the letters to his children breathe a profound and simple piety. He declared, “The more I know, the more nearly is my faith that of the Breton peasant. Could I but know all I would have the faith of a Breton peasant woman.” Above all, what he could not understand is the failure of scientists to recognize the clear evidence of the Creator’s hand in the world around us. Pasteur was a traditional Catholic. His life was focused on experimental science as it related to infectious disease and the germ theory. In all our primary readings, the worldview of Pasteur is consistent with historic and traditional Catholic teachings, including those about Creation and Christ. Pasteur and the Catholics of his era believed that the creation is good, that God uses it for His purposes, but that it is marred by original sin. Catholics believe that Christ is the Creator and that Jesus is fully God and fully man. He is the King of the Cosmos, the Word of God, and the awaited Messiah of Israel.\n\nLouis Pasteur was also an experimentalist, daily performing operational science. He, like so many other creation scientists, is a prime example that you do not have to be an evolutionist to do good science. Let no one claim that faith in God is detrimental to this burgeoning field. Pasteur, France’s number one scientist, said, “The more I study nature, the more I stand amazed at the work of the Creator.” We have seen Pasteur’s faith was as genuine and logical as his science. In his panegyric of Littré (i.e., elaborate praise in formal slogan), whose fauteuil (armchair) he took, he said, “Happy the man who bears within him a divinity, an ideal of beauty and obeys it; an ideal of art, an ideal of science, an ideal of country, and ideal of the virtues of the gospel” (Vallery-Radot 1959, p. 197). Pasteur was a man of progress. He relieved the sufferings of others, gave them the means of a better life, and never spurned the mundane but practical applications of his work. He taught that the strictest care must be exercised in experiment and that through careful reasoning nothing should be assumed without compelling proof. He was, without doubt, one of the greatest benefactors of humanity, and he belongs to that heritage of France that it is our bound duty to honor and to proclaim.\n\nWe have given a brief history of the spontaneous generation controversy, of experiments proving biogenesis, and of the development of the germ theory of disease, including the conflicting beliefs of Pasteur and Pouchet. Louis Pasteur is known as the Father of Microbiology, mainly because of his work on the germ theory. Many contemporary medical scientists and physicians have been inspired by the ideas and efforts of these microbe hunters (Dekruif 1926; Gillen 2007). We would like to challenge those who study modern medical issues to take notes from these giants in microbiology and believers in the God of the Bible.\n\nThese are the translated words engraved above Pasteur’s tomb in the Pasteur Institute:\n\nPasteur was truly a man of Christian character and action. Louis embraced the values of the Gospels throughout his life. His faith came simply and naturally for spiritual help and was most evident in the later stages of this life. Pasteur believed in prayer, the Bible, and the truths of the gospel as his goal. He encouraged others to do the same (Vallery-Radot 1911, vol. 2. p. 240).\n\nLouis Pasteur’s view on biogenesis, the stability, and continuity of biological types (i.e., kind) principle are described by S. J. Holmes (1924, pp. 66–67),\n\nIn conclusion, Pasteur began in 1844, by sorting out right- and left-handed crystals, and spent the rest of his life, patiently and fruitfully, sorting right- and left-handed facts. The Creator blessed these efforts by revealing His truth (as He faithfully reveals operational science) to those who diligently seek Him ( ). By God’s grace, Pasteur received the answers to these challenging questions.", "opengraph": {"title": "Louis Pasteur’s Views on Creation, Evolution, Genesis of Germs", "url": "https://answersingenesis.org/pasteur-creation-evolution-germs/", "description": "Shortly after Darwin published On the Origin of Species, Pasteur began to challenge the idea of spontaneous generation.", "image": "https://assets.answersingenesis.org/img/cms/content/contentnode/og_image/origin-of-life.jpg", "image:width": "1200", "image:height": "628", "site_name": "Answers in Genesis", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": ["Frank Sherwin", "Dr. Alan L. Gillen"], "publish_date": "2008-02-25"}