{"result_id": "032036", "URL": "https://answersingenesis.org/genetics/animal-genetics/whale-genetics-and-evolution/", "timestamp": "2023-04-25 12:06:13 CEST+0200", "meta": {"description": "Whale evolution is presented in most biology textbooks as absolute fact, often with inaccurate depictions of the supposed transitional forms.", "lang": "en", "keywords": "Killer whales,Evolution,Fossil,Fossilization,Fossils,Kinds,Transition,Transitional,Whale,Whales", "favicon": "https://assets.answersingenesis.org/img/favicons/apple-touch-icon.png", "canonical": "https://answersingenesis.org/genetics/animal-genetics/whale-genetics-and-evolution/", "encoding": "utf-8"}, "image": null, "domain": "answersingenesis.org", "title": "Whale Genetics and Evolution", "cleaned_text": "Whales are claimed to have proved one of the most popular so-called evidences for evolution. Whale evolution is presented in most biology textbooks as absolute fact, often with inaccurate depictions of the supposed transitional forms.1\n\nA Brief Review of the “Whale Transitional” Series\n\nIn the secular worldview, the currently accepted whale evolution model is that the hippopotamus is the closest living relatives of whales. But supposed “early” whales have little in common with hippos or living whales. Pakicetus, often called a basal whale, was a wolf-sized, fully terrestrial animal. Its ankle bones were similar to extant artiodactyls (even-toed hoofed mammals that include hippos, pigs, sheep, cows, deer, giraffes, antelopes).\n\nAmbulocetus, another supposed early whale ancestor, is another terrestrial and/or possibly semi-aquatic animal that has larger hindfeet than forefeet. Its backbone ends at the pelvis, and powerful rear legs are attached and then extend (we would assert dorsally downward) from it. This is typical land mammal anatomy, not a transitional whale’s, although there has been a recent (2016) paper that argues they were fully aquatic, based upon the strength of their ribcage not being able to support their weight on land.2 However, this assumes a particular hindlimb position (trailing behind the torso), which quite probably is not accurate.\n\nThe Protocetids (another group of cetaceans), Maiacetus, Rodhocetus, and Kutchicetus, also all appear to be semi-aquatic animals, most likely related to pinnipeds (seals, sea lions, walruses). Maiacetus, for example, still had hips that were attached to its vertebral column, which shows that the hindlimbs could support its body weight.3 That represents land animal anatomy.\n\nNext is the archaeocetes (a group of primitive whales) Basilosaurus and Dorudon in this alleged transitional series, but both are fully aquatic, and their hindlimbs are not attached to their vertebrae. In fact, their hindlimbs (like modern whales) are more properly explained as anchors to muscles for reproduction, and not vestigial “legs.”4\n\nThen there is the huge evolutionary problem with explaining how baleen could have evolved. The current model of toothed whales losing their teeth, becoming suction feeders, and then “evolving” baleen is composed of “just so” stories with no data to back up evolutionary hypotheses. And added to that is the problem of the origin of echolocation in some whales.\n\nIn short, the morphological data for the “whale transitional” series shows no such thing, and is, if anything, counterintuitive. Their model shows only semi-aquatic pinniped-like animals and finally fully-aquatic animals with huge anatomical gaps between them all. And when we begin to look at the dates, we see that all of these evolutionary leaps must have occurred in just a few million years, which by evolutionary standards is a blink of an eye. That is not enough time for all the changes required for the process.\n\nIn the last several months, even more papers have been published that attempt to demonstrate the evolution of whales. In the process, the researchers beached themselves on their own methodologies.\n\nThe first paper, published in 2019, was a phylogenetic representation of the purported transition from land animals to whales. According to the article, gene loss in the various cetaceans can be traced using phylogenetic trees back to a lineage that gave rise to both whales and modern cows.5 Their screening identified 85 genes that they believe were lost in the transition. These genes are purported to have been lost due to inactivation mutations or deletion. Notably, the genes they claim were lost appear to confer advantages to whales. For example, the MAP3K19 gene that is not present in whales is beneficial since it would cause pulmonary fibrosis in diving whales.\n\nIn an attempt to demonstrate their idea that gene loss has occurred in cetaceans, the researchers show an abbreviated phylogenetic tree of whales. Exactly how they built that tree is unclear, as it is not cited as being borrowed from other researchers, nor do they explain how they built it. However, using an online phylogeny builder, we attempted to duplicate it.6,7,8,9,10,11,12 Using mostly the same animals, along with a few additional ones, we discovered some issues. Unfortunately, full sequences for cytochrome b were not publicly available for some creatures during our attempt to recreate the secular paper’s results. Where possible, members of the same genera as the missing organisms were used as replacements. Where it was not possible, the taxon was omitted.\n\nA phylogeny built using cytochrome b, a protein commonly used to determine phylogenies, revealed some differences with the whale phylogeny in the secular paper.13 For example, according to our derived phylogeny, sperm whales and Yangtze river dolphins share the same most recent common ancestor. In the Science Advances paper, they do not. In our phylogeny, bottlenose dolphins and killer whales did not split from the same common ancestor. In the Science Advances paper, they did. Most interestingly, two toothed whales, the sperm whale, and the Yangtze River dolphin are more closely related to baleen whales than they are to other toothed whales in our phylogeny, which is very strongly contrary to the Science Advances phylogeny.\n\nThere are significant issues with phylogenetics as a whole, and this study in its attempting to use them as supporting evidence of gene loss is simply pointless. As noted in the above phylogeny, you could argue that some of the toothed whales are more closely related to baleen whales than they are to other toothed whales. Obviously this is false since there is enough genetic and morphological data to demonstrate it to be wrong, but from a phylogenetic perspective, it is valid.\n\nEvolutionists acknowledge that whale phylogenies are wracked with problems. “While the monophyly of cetaceans is widely accepted, the origin of and evolutionary relationships among the major groups of cetaceans is more problematic since morphological and molecular analyses reach very different conclusions. Indeed, based on the conventional interpretation of the morphological and behavioral data set, the echolocating toothed whales (about 67 species) and the filter-feeding baleen whales (10 species) are considered as two distinct monophyletic groups . . . On the other hand, phylogenetic analysis of DNA . . . and amino acid . . . sequences contradict this long-accepted taxonomic division. One group of toothed whales, the sperm whales, appear to be more closely related to the morphologically highly divergent baleen whales than to other odontocetes, while all other resolvable relationships are consistent with traditional groupings.”14 In other words, depending on what characters you use, you get widely differing and opposite results.\n\nWithout the phylogenetic support, the claim of gene deletion falls apart. Mutations may have occurred in some whales certainly, and it is possible that genes truly are inactivated. However, this demonstrates the aftereffects of the fall, not evolution. The genomes of all organisms are breaking down: they are not evolving upward or towards any specific goal, and if you are attempting to go from a terrestrial ecosystem to a fully aquatic one, that must be the case.\n\nThe second paper relies much more heavily on anatomy and physiology, as it documented the 2007 discovery of a proposed “whale ancestor” from Egypt, Aegicetus gehennae. They have two specimens of protocetids,* which they claim exhibit sexual dimorphism.15 The purported fossil of the male is in much better condition and is larger than the supposed female specimen. While these researchers never give a picture of a full skeleton or the actual estimated full length of the creature, from the diagrams, which helpfully provide size keys, the creature is approximately 12 feet long (3–4 meters),16 depending on how much of the skeleton is missing. They estimate the weight of these creatures was nearly a ton.\n\nWhile the researchers claim this new discovery is a proto-whale, they are stretching to reach that conclusion. Because whales dive deep and thus suffer compression, whale ribs do not attach to the sternum. However, on the sternum of Aegicetus, there are clear markings of rib attachment. Further, the lumbar vertebrae measure in at 160 mm (6.2 in.). That is quite small for an animal that weighed nearly a ton. There are only four lumbar vertebrae present in the fossil. By contrast, the dwarf sperm whale, the smallest whale species, has ten lumbar vertebrae, and the first four alone measure 196 mm (7.7 in.) in a 2.4 m (8.1 ft.) specimen.17 For reference, dwarf sperm whales are anywhere from 2.0–2.7 m (6.6–8.9 ft.) in length. The ribs of Aegicetus are also relatively small for such a supposedly heavy animal. The iliac blade in this organism is quite slender for such a heavy creature as well.\n\nAnatomist David Menton examined the Aegicetus paper in detail. He concludes they have grossly overestimated the weight of the creature and that a more appropriate estimate would be somewhere in the neighborhood of a half-ton based on the anatomical size of the bones. With this estimate in mind, this creature looks much more like a pinniped than a whale. Intriguingly, the larger sea lions are about the same weight as his estimate. Only three pinnipeds, the walrus and the elephant seals, weigh more than a half ton. With this weight estimate, the slender iliac blade makes more sense as it would struggle to support a one-ton creature. Further, pinnipeds have only five lumbar vertebrae. While Aegicetus only has four, it is possible one is missing, having been disarticulated and lost during fossilization. It would be a much greater stretch to say that six were missing to get to even the smallest number of whale lumbar vertebrae.18 Viewing Aegicetus as a pinniped also explains the ribs being articulated to the sternum. It certainly is not an evolutionary ancestor to whales.\n\nIn short, despite decades of attempts, the evolutionary ancestors of whales remain elusive. What we observe are distinct types of organisms, with the several whale kinds being discontinuous from things like Pakicetus and Aegicetus. Regardless of the biased phylogenies or faulty interpretations of fossils, whales have always been whales.", "opengraph": {"title": "Whale Genetics and Evolution", "url": "https://answersingenesis.org/genetics/animal-genetics/whale-genetics-and-evolution/", "description": "Whale evolution is presented in most biology textbooks as absolute fact, often with inaccurate depictions of the supposed transitional forms.", "image": "https://assets.answersingenesis.org/img/cms/content/contentnode/og_image/whale-genetics-and-evolution.jpg", "image:width": "1200", "image:height": "628", "site_name": "Answers in Genesis", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["#fn_2", "#fn_3", "#fn_4", "/evolution/", "#fn_5", "#fn_6", "#fn_7", "#fn_8", "#fn_9", "#fn_10", "#fn_11", "#fn_12", "#fn_13", "#fn_14", "#fn_15", "#fn_16", "#fn_17", "#fn_18"], "authors": [], "publish_date": "July 3, 2020, 6 a.m."}