{"result_id": "032001", "URL": "https://answersingenesis.org/answers/magazine/v12-n6/publishers-pen/terrible-infection/", "timestamp": "2023-04-25 12:05:31 CEST+0200", "meta": {"description": "A malady is growing among Christians today. But\r\nusually, only those who don’t suffer from it are willing\r\nto talk about it.", "lang": "en", "keywords": "Answers bible curriculum,Bible,Reading,Study", "favicon": "https://assets.answersingenesis.org/img/favicons/apple-touch-icon.png", "canonical": "https://answersingenesis.org/answers/magazine/v12-n6/publishers-pen/terrible-infection/", "encoding": "utf-8"}, "image": null, "domain": "answersingenesis.org", "title": "A Terrible Infection", "cleaned_text": "A malady is growing among Christians today. But usually, only those who don’t suffer from it are willing to talk about it.\n\nThe malady is pervasive and spreads rapidly. It silently infects once-vibrant individuals to varying degrees and often leads to a life of pain. It is nearly impossible to confirm until adulthood, but at that point it can poison entire families.\n\nIn the USA, biblical illiteracy has grown and spread for generations. This form of illiteracy has almost nothing to do with an inability to read. Rather, it is a failure to dig deeper into the Bible and strengthen the initial excitement about our Creator that usually accompanies the birth of a new believer. Biblical illiteracy is like a muscle-eating virus. It takes root in a family when one of the adults fails to strengthen their resistance to infections that come in the form of attacks against the Bible’s truth and authority. From that one host, biblical illiteracy can easily spread to the children, where it appears to lie dormant but invisibly metastasizes deep in their hearts.\n\nWhen children are not trained and equipped to withstand the ravages of a godless culture, they fail to thrive and their Christian growth becomes stunted.\n\nThe cure comes from a right understanding of God’s Word. Of course, we pray that every issue of Answers magazine will be a big help in building the spiritual muscle every believer needs to thrive, grow, and reproduce. But nothing can replace God’s Word. Read it frequently and pray for deep understanding.\n\nMay I suggest two resources to help your loved ones get a big picture perspective of the Scriptures? About my fiftieth birthday, I realized I was infected, and I determined to do something about it. For decades I used the excuse of being “too busy” and acted like I was fine. But as a new grandfather at fifty and inspired in part by the Answers Bible Curriculum for Sunday schools, a four-year chronological study of the Bible (AnswersBibleCurriculum.org), I decided to dig deeper into God’s Word. Much deeper. The result was a book, The Ten-Minute Bible Journey which includes a “summary first” chronological Bible reading plan. You can get a free PDF of the reading plan below.\n\nWhether or not you use ABC or the free PDF, don’t neglect the only vaccine against spiritual weakness. Steep yourself in God’s Word!", "opengraph": {"title": "A Terrible Infection", "url": "https://answersingenesis.org/answers/magazine/v12-n6/publishers-pen/terrible-infection/", "description": "A malady is growing among Christians today. But\r\nusually, only those who don’t suffer from it are willing\r\nto talk about it.", "image": "https://assets.answersingenesis.org/img/cms/content/contentnode/header_image//am/v10/n2/publishers-pen-header.jpg", "image:width": "700", "image:height": "222", "site_name": "Answers in Genesis", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["/bible/", "/christian/", "/god/", "/sunday-school/", "/store/sku/10-2-486/"], "authors": [], "publish_date": null}