{"result_id": "032039", "URL": "https://answersingenesis.org/human-body/wise-blood-overcoming-in-disease-immunity-part-1/", "timestamp": "2023-04-25 12:06:18 CEST+0200", "meta": {"description": "How our immune system protects us from deadly pathogens and parasites through antibodies to demonstrate how we’re fearfully and wonderfully made.", "lang": "en", "keywords": "White blood cells,Blood,Immunity,Virus", "favicon": "https://assets.answersingenesis.org/img/favicons/apple-touch-icon.png", "canonical": "https://answersingenesis.org/human-body/wise-blood-overcoming-in-disease-immunity-part-1/", "encoding": "utf-8"}, "image": null, "domain": "answersingenesis.org", "title": "Wise Blood: The Principle of Overcoming in Disease and Immunity (Part 1)", "cleaned_text": "The immune system is an intelligently made system designed for interaction with microbes even in a perfect world; it is more than a defense. However, in a post-fall world, it is primarily a body’s defense system. Battle imagery is appropriate for describing the interaction with pathogens and parasites. A person’s blood becomes more potent over time as that person prevails and overcomes pathogens and parasites with its newly formed antibodies in high numbers. Antibodies have the secret locked away to defeat the germ that has invaded. The second infection usually has minimal harm; hence, the “wise” blood is more likely to defeat the enemy. Immunization derives from the brilliant pioneering work of Edward Jenner, a Christian physician, and Louis Pasteur, a creation microbiologist; they solved this time-delay problem for the body. By exposing the body to a weakened or “killed” pathogen, a vaccine shrinks the time for the secondary response of IgG (immunoglobin). Now the body can flood the battle scene with prepared antibodies and can overwhelm intruders.\n\nTiming presents by far the biggest challenge to the body’s protective system. Bodily defenses are strictly an “umbrella” against the “rain” of pathogens and parasites that attack the body. We live in the gap between beneficial colonization and host immune response; otherwise, infection or disease occurs. Vaccination shortens the secondary, intense antibody response. It has “wised-up” to the enemy, and it overcomes the germ, pathogen, or parasite. Antibodies produced in the body represent beauty, complexity, and providential orderliness that exemplify how the body is fearfully and wonderfully made design, glorifying their Creator.\n\nNormally, the body loses crucial hours while breaking the code of the new pathogen or parasite while manufacturing antibodies to combat it. With immunization, a prior shot exposes the body to a weakened (attenuated) or antigen component and gives the body prior notice and an upper hand in the cell wars battle. When invaded, the body can flow with a prepared assortment of antibodies and T cells that quickly overwhelm the intruders. Historically, Edward Jenner (a Christian physician) and Louis Pasteur provided the basis for immunization. In more recent times, Dr. Lance Plyler (Samaritan’s Purse physician) saved Dr. Kent Brantley (a Samaritan’s Purse physician and Time Man of the Year) with an Ebola antibody vaccine (ZMapp) in 2014. These represent how the blood “wises” up to enemies (pathogens or parasites) and overcomes their breakout.\n\nKeywords: acquired immunity, vaccinations, overcoming principle, immune system, pre-Fall, post-Fall, body defenses, the genesis of germs, immunology, intelligent design, power in the blood, cleansing, interwoven complexity, fearfully and wonderfully made, body by design\n\nEach day, we live at the mercy of pathogens and parasites, microbes about one-trillionth to one-thousandth of our size. We read about the flu causing havoc this winter in most parts of the USA and Europe. The flu epidemic is peaking earlier than normal and is spreading across the USA according to the CDC. Flu vaccination can help prevent flu and its potentially serious complications. In the summer, we read about malaria and Ebola outbreaks troubling tropical populations. The objectives of this article are (1) to explain the overcoming design principle of the immune system in effectively fighting pathogens and parasites in disease; and (2) to record the role of Christians and creation biologists in developing vaccines.\n\nThe immune system acts like a protective physical and biochemical bubble around the human body, protecting against everyday germs. It provides an invisible barrier to nonspecific and specific pathogens. Diseases such as malaria, measles, smallpox, influenza, and anthrax all threaten people in today's cursed world (Genesis 3). Even as the world presently faces the new pandemic of the virus from Wuhan, China, the human body responds in defense. A new vaccine against the 2019 Novel Coronavirus (2019-nCoV) is in development and will be designed to enhance the body’s immune system. The immune system has been designed as the body's major defense not only against bacteria and viruses, but also against fungi, parasites, and toxins. It serves as an invisible boundary of mucous membranes, strong chemicals, and proteins that defend us against new and old diseases. Stages of the immune system include the skin and mucous membranes as the first line of defense, white blood cells as the second line of defense, and antibodies as the third line. The immune system includes the lymph glands, lymph nodes, spleen, bone marrow, tonsils, and appendix.\n\nIn addition to innate immunity, humans and vertebrate animals have been created with a more specialized response, termed the acquired immune response. It develops throughout life and substantially increases the body’s ability to defend itself. Each time the body is exposed to foreign material, the adaptive defense system “learns” then “remembers” the most effective response to that specific material, reacting accordingly if the material is encountered again. The foreign material to which the immune system responds is called an antigen. On first exposure to an invading microbe or another antigen, the response develops relatively slowly; the antigen may cause damage if the innate defenses cannot contain it. Successive exposures, however, lead to swifter, greater repeated responses, generally eliminating the invader before it causes obvious additional harm.\n\nThe immune system can discriminate between healthy “self,” your own body cells, and dangerous cells. The adaptive immune response uses two general mechanisms to eliminate an invader. If the antigen is within one of the body’s own cells, then the immune system will not attack these cells. If the antigen is extracellular, hence dangerous, then the body responds by making antibodies—glycoprotein molecules with two functional regions. One region binds specifically to the antigen; the other functions as a “red flag” to alert the other host defenses to remove or destroy the antigen.\n\nLeukocytes: Able to Defend and Cleanse\n\nLeukocytes (white blood cells or WBCs) are nucleated cells and do not contain hemoglobin. WBCs are not nearly as common as red blood cells (RBCs). Another interesting difference between white and red blood cells is found by comparing their movements. RBCs cannot move on their own; they are simply carried along by the flow of blood. Most WBCs, however, can move on their own through tiny “legs” (projections). Once in tissue spaces, leukocytes are attracted to dead cells or foreign materials. For example, when a bacterium or virus gets into tissues, WBCs move out of the bloodstream via diapedesis, the passage of leukocytes through the blood-vessel pores and into the tissue’s spaces. They are attracted by chemotaxis (chemical attraction) right to the point of infection. In this way, the WBCs can get right to the attack. In fact, they exhibit amoeboid movement, extending their pseudopods and flowing into the infected tissue.\n\nBlood is the body’s cleanser. It is the Creator’s merciful provision for living in this fallen, contaminated world. The infection in a wound is cleansed by the blood flowing through it. Blood flow facilitates wandering and fixed macrophages to cleanse pathogens via phagocytosis. Blood flow dislodges germs and delivers the tissue from further damage by bacteria and viruses. During healthy periods, 25 billion leukocytes circulate freely throughout the blood, and 25 billion more loiter on blood vessel walls (Brand and Yancey 1984 and 2019). When an infection occurs, billions of reserves leap from the marshes of bone marrow. The body can quickly mobilize ten times the normal number of white cells. In fact, physicians use a census of them as a diagnostic blood test to judge the severity of the infection.\n\nWe need vast numbers of leukocytes for one reason: some white cells are “specific” defenders, programmed against only one type of disease. An average leukocyte lives merely13 to 20 days. Some leukocytes called memory T and B cells live decades. A select few live for 50 to 70 years, and they preserve the chemical memory of dangerous invaders, all the while checking in at their assigned lymph gland every few minutes. These master “memory” cells safeguard the chemical secrets that remind the body how to respond to any invader previously encountered.\n\nThe blood has a mixture of cells (e.g. macrophages) and chemicals (esp. antibodies) to cleanse the blood and combat infections. A macrophage must somehow find the actual invaders who are camouflaged by the chemical smokescreen of battle. Chemokines guide macrophages through the fray to their intended target. Then, antibodies coat the germ by clinging to the enemy like moss to a tree. They “soften” them up for the approaching white cells and neutralize their destructive spike shapes. A single antibody protects against only one disease; for example, a common cold antibody has no effect against avian flu. There is a wonder-working power in the blood (Gillen 2019; Gillen 2009).\n\nSpecific immunity is the third line of defense of the body, and it provides specific resistance against particular pathogens or toxins. Specific defenses are based on specialized cells of the immune system called lymphocytes and the production of proteins called antibodies. They are adaptive to specific antigens found in the environment. Creation scientists see this finely tuned system as having been designed from the beginning (as discussed above) and not well explained naturalistically.\n\nIn contrast to nonspecific immunity, specific immunity is ready to respond using both T and B lymphocytes to provide immunological “memory”— a greatly enhanced response to re-exposure. The adaptive immune response matures through the growth of the immune system arsenal, which develops the most effective responses against specific invaders as each is encountered. An important hallmark of the adaptive immune response is this “memory.” Individuals who survive diseases such as measles, mumps, or diphtheria generally never develop these acute diseases again. They “learn” the secrets of the pathogen or parasite in hours and begin a counterattack. Vaccines can prevent these diseases by exposing a person’s immune system to weakened or killed forms of the causative microbe or its products. Some diseases can be contracted repeatedly, but this phenomenon generally results from the causative agent’s ability to evade the host’s defenses. The acquired immune response also has molecular specificity. The response that protects an individual from developing symptoms of measles does not prevent the person from contracting a different disease, such as chickenpox. The immune system can also discriminate between healthy “self” (your own “normal” cells) and “non-self,” such as invading bacteria and toxins. Without this ability, the immune system would routinely turn against the body’s own cells, attacking them as invading microbes.\n\nThe High Specificity of the Acquired Immune Response\n\nThe course of infection may be separated into several separate phases. After about a week or more of first exposure to a given microbe or antigen, clonal selection of lymphocytes is generated. During this delay, the host depends on the protection provided by innate immunity, a critical prerequisite for the adaptive immune response. This first highly specific response to a particular antigen is called the primary immune response. As a result of that initial encounter, the adaptive immune system is able to “remember,” via immunological memory, that specific antigen. When the same antigen is encountered later in life, there is an enhanced antibody response called the secondary immune or anamnestic response. The efficiency of the secondary response reflects the immunological memory of the immune system “learned” from the first encounter. The anamnestic response comes from the Greek anamnesis, meaning “for recollection.” Memory cells bring the recollection of past threats for both active (long-term) immunity against most pathogens and for some passive immunity (short-term and passing away).\n\nThe adaptive immune response uses two basic strategies for countering antigens. One response, humoral immunity, works to eliminate extracellular antigens via specific immunoglobulin antibodies, targeting bacteria, toxins, or viruses in the blood plasma, lymph, or fluids surrounding tissues. The other response is called cellular immunity or cell-mediated immunity (CMI) that involves specifically sensitized T lymphocytes and macrophages (APCs, antigen presenting cells). Cellular immunity deals with antigens residing within a host cell, such as a virus that has infected a cell by way of the major histocompatibility complex or MHC. Humoral and cellular immunity are both powerful, and if misdirected, they can cause great damage to the body’s own tissues (an autoimmune response). Because of this, the adaptive immune response is tightly regulated; each B and T lymphocyte, the primary participants in the adaptive response, requires a “second opinion” from a different type of cell (macrophages releasing cytokines) before it can unleash its power.\n\nThe Development of the Specific Immune System\n\nThe cornerstone of specific immunity is a set of primed or specifically sensitized lymphocytes, along with antibodies. The lymphocytes are distributed throughout the body comprising the lymphoid or lymphatic system. Lymphocytes are small cells, about 7 to 12 µm in diameter, each with a large ovoid-to-round nucleus taking up almost the entire cytoplasm (fig. 1). Electron microscopy reveals that villi cover most of the surface. Under a light microscope, all lymphocytes look similar, varying in the cytoplasm. On the basis of developmental history of cellular function and unique biochemical differences, two types of lymphocytes can be distinguished: B lymphocytes and T lymphocytes. B lymphocytes are largely responsible for humoral immunity, while T lymphocytes are primarily responsible for CMI. In humoral immunity, antibodies provide resistance to disease, while in CMI, specifically sensitized T lymphocytes provide resistance through direct cell-to-cell contact via APCs.\n\nScripture alludes to a healthy body and bone (Proverbs 14:30, 15:30, 16:24, 17:22). These allusions are interesting because bone marrow produces lymphocytes, which are essential for good immunological health. The immune system arises in the fetus about two months after conception. Lymphocytes originate from “primitive” cells in the yolk sac, fetal liver, and bone marrow. These unspecialized cells are known as stem cells. Stem cells differentiate into two types of cells: erythropoietic (myeloid), which become red blood cells, and lymphopoietic, which become lymphocytes. The Greek word poien means “to make”; thus, lymphopoietic cells are “lymphocyte-making.” During the early stages of development, lymphopoietic cells take one of the two courses. Some proceed to the thymus, where they are processed via negative and positive selection, emerging as T lymphocytes (T for “thymus”). Thereafter, they begin to slowly shrink and undergo involution. Within the thymus, stem-cell maturation and differentiation occur, modified by the addition and the disappearance of specific surface receptor proteins termed CD antigens. Mature, antigen-specific T lymphocytes or T cells are ready to engage in cell-mediated immunity and are said to be immunocompetent. The fully developed T lymphocytes enter the systemic circulation and colonize the lymph nodes, spleen, tonsils, and other lymphoid organs. The T cells provide the basis for cell-mediated immunity.\n\nThe B lymphocytes or B cells mature and become immunocompetent in the bone marrow (this process is the bursa equivalent for B cell maturation in mammals, though some immunologists favor the liver, spleen, or gut-associated tissue as the maturation site). In the embryonic chick, this area has been identified as the bursa of Fabricus. For this reason, the lymphocyte is known historically as the bursa-derived or B lymphocyte (the letter B may also stand for bone marrow). Once mature, the B lymphocytes (B cells) move through the circulation to colonize organs of the lymphoid system where they join the T lymphocytes. B cells provide the basis for humoral immunity (humor is Greek for “fluid”) (Gillen 2019; Gillen 2009).\n\nEdward Jenner (fig. 2), a Christian physician and son of an English pastor, represented his work as the first scientific attempt to control an infectious disease by the deliberate use of vaccination and ultimately eradication of smallpox. He is often mentioned as a pioneer of immunization. Jenner’s first experiment with inoculation provided the connection that cowpox can be protected against smallpox, but it also could be transmitted from one person to another as a mechanism of protection. In 1796, he took fluid from fresh cowpox lesions from a dairymaid and inoculated it to an eight-year-old boy, James Phipps, who developed mild symptoms . After nine days, he inoculated that patient again. No disease developed, and Jenner concluded that this patient was protected (fig.3). However, his experiment did not lead to any understanding of how immunity develops.\n\nLouis Pasteur (fig. 4) was a creation microbiologist and a father of immunology. He is the first scientist to understand the principle of immunization. He introduced “pasteurization,” a process of heating and rapid cooling to kill most of the microbes. He then introduced the concept of vaccination that could be applied to any microbial diseases by using live attenuated microbes to generate our immunity against a specific microbial disease. He is known to be a pioneer of vaccination, having developed vaccines for anthrax, a major livestock disease that in recent times has been used against humans in germ warfare, and rabies, a deadly virus spread to people from the saliva of infected animals.\n\nVaccination may be described as the deliberate introduction of an antigenic substance to the body to induce acquired immunity by the production of specific antibodies and is based upon the principle of immune cells “remembering” the antigen encountered. Vaccination is the word that Edward Jenner invented for his treatment (from the Latin vacca, a cow) described above. He based his research on careful case studies and clinical observation more than a hundred years before scientists could explain the viruses themselves.\n\nJenner was a Christian whose personal correspondence and letters showed himself quite genuine, and he treasured the Bible. A few days before his death, he stated to a friend, “I am not surprised that men are not grateful to me; but I wonder that they are not grateful to God for the good which He has made me the instrument of conveying to my fellow creatures.” In addition, Jenner’s dedication to his cause and purpose that God gave him was evident in this quotation: “While the vaccine discovery was progressive, the joy I felt at the prospect before me of being the instrument destined to take away from the world one of its greatest calamities [smallpox], blended with the fond hope of enjoying independence and domestic peace and happiness, was often so excessive that, in pursuing my favourite subject among the meadows, I have sometimes found myself in a kind of reverie. It is pleasant for me to recollect that these reflections always ended in devout acknowledgements to that Being (God) from whom this and all other mercies flow.”1\n\nPrior to Jenner, smallpox was the leading killer disease among infants and young children. In 1980, as a result of Jenner's discovery, the World Health Organization officially declared “the world and its peoples” free from endemic smallpox. His procedure was adopted by Pasteur and others for immunization against many other infectious diseases.\n\nThere are two basic types of vaccines. The first type contains either live (attenuated) or killed pathogens or products from it. In this kind of vaccine, the pathogen has been weakened, so it cannot overtake your body’s immune system. But the pathogen’s antigens stimulate the production of T cell immunity and protective antibodies. As a result, the lymph system recognizes it, makes antibodies to kill it, then makes B and T lymphocytes to “remember” the infection should the individual be exposed to the pathogen again (fig. 5). Since the pathogen is weakened, the body’s immune system will destroy it before it can overtake the body. Thus, even though the vaccine actually contains a disease-causing pathogen, the pathogen is so weak that your immune system will both destroy and remember it.\n\nThe other type of vaccine contains a synthetic chemical that makes the body react in the same manner as if a certain pathogen has entered the body. This type of vaccine mimics a real pathogen, causing the immune system to produce antibodies as well as memory B cells. Regardless of the type of vaccine, the effect is the same. The vaccine causes your body to form B cells that in turn produce antibody-making plasma cells and also memory B cells. The memory B cells remember the pathogen and provide a quick response to any future infections (fig. 5). Because of the smallpox vaccine, the causative smallpox virus exists only in laboratories (fig. 6). It has been wiped out because the vaccine stopped its ability to reproduce by infecting people.\n\nThe 2013–2015 epidemic of hemorrhagic fever caused by the Ebola virus (fig. 7) captured international news headlines. The Ebola outbreak is currently wreaking much havoc in Africa and scares many in this country as missionaries return back to the United States for treatment. The numbers of cases reported in West Africa in those years are more than triple of any epidemic since the disease was first described in 1976. Ebola infection progresses its symptoms similar to tropical diseases such as malaria, with fever, fatigue, muscle aches, and weakness; but then from 2 to 21 days (with an average time of 10 days), massive bleeding, hemorrhaging, and death occur.\n\nIn my book The Genesis of Germs (Gillen 2019), I suggest several major factors that probably led to the origin of the disease. Those medical missionary workers like Dr. Kent Brantly and Nancy Writebol who contacted Ebola are getting stronger with experimental serum (monoclonal antibodies from those who previously survived the disease). They are very courageous and demonstrating Christian compassion to those in need. Brantly and Plyler are committed Christians who first used ZMapp antibodies to treat Ebola hemorrhagic fever (fig. 8). In the case of Ebola, convalescent serum (blood of an overcomer) has been used—first in animals and then people. Equipped with borrowed antibodies, Dr. Kent Brantly was able to overcome the Ebola virus given to him by Dr. Lance Plyer. He overcame the virus, not by his own resistance or immunity, but by the result of a battle that had previously taken place in another animal. The ZMapp antibodies were experimental and very chancy, but they worked by God’s grace.\n\nEven though memory B cells are long lived, they do not last the individual’s lifetime. Thus, some vaccines require a booster for the memory of the infection. When the body is first exposed to a pathogen, the B cells produce a primary response. This response, as stated above, fights the infection and produces memory B cells. The memory B cells then produce a secondary response if the pathogen infects the body later. For example, if you have the influenza (flu) shot, your body will manufacture antibodies against the influenza virus (fig. 9). If you encounter a strain of the flu closely related to the original virus, your body quickly mounts a response that will spare you re-infection, or at least its more severe effects (in severe cases even sparing life). Thus, your lymphatic system identifies your blood type and knows how to spot specific antigens versus those of the flu virus, like neuraminidase and hemagglutinin. The flu vaccine is most effective for only one year for two reasons: (1) a most likely match to current influenza strains in circulation; and (2) the highest antibody titer. However, the antibody to influenza stays about seven years and completely diminishes in eight years (Baylor COM).\n\nPremunition, also known as infection-immunity, is a host response that protects against high numbers of parasite and illness without eliminating the infection. In the case of malaria, the sporozoite and merozoite stages of Plasmodium elicit the antibody response which leads to premunition. Premunition is immunity to malaria through repeated exposures. There is a sense in which a person’s blood becomes more valuable and potent as that person prevails in the battle of malaria parasites over time. The protected person has “wise blood” through acquired immunity. After antibodies have stored and retrieved the secret of defeating a particular species or strain of malaria, it has a more robust response to the parasite and overcomes it, or at least it minimizes the symptoms and prevents death (Roberts, Janovy, Nadler 2013).\n\nIn conclusion, the immune system was likely put into place in the original human body design. The word immune comes from the Latin root word that means “freedom or protection from taxes or burdens.” This amazing system battles disease in a manner that is so complex and intricate that the most gifted imagination could not envision such incredible functions. In today’s post-fall world, the primary role of our immune system is to recognize pathogens and parasites, then to destroy them.\n\nThe immune system is ingenious. In today’s world, it has three lines of defense. In this article, we have focused on the third line of defense comprised of antibodies, specialized lymphocytes such as B cells and T cells, and memory cells. But the immune systems functions go beyond simple defense. Two other functions are cleansing and regulating. The immune system cleanses our body from waste buildup and potential harm. It regulates the normal microbiota, a natural symbiotic relationship needed for a healthy body.\n\nImmunity includes specificity, versatility, memory, tolerance, and cell- and tissue-specific responses. The immune system is adaptive: it learns, has memory, and is specific. The overall complexity of the human body and the interwoven magnificence of our immune system further illustrate evidence of an intelligent design by a master craftsman. It is more than a defense. It is “fearfully and wonderfully made” (Psalm 139:14).\n\nIn part 2 we will examine the role and design of antibodies in overcoming disease.\n\nBehe, Michael J. 1996. Darwin’s Black Box: The Biochemical Challenge to Evolution. New York: The Free Press.\n\nBrand, P. and P. Yancey. 1984. In His Image. Grand Rapids, Michigan: Zondervan Publishing Co.\n\nBrand, P. and P. Yancey. 2019. Fearfully and Wonderfully: The Marvel of Bearing God's Image, updated and combined edition. Westmont, Illinois: InterVarsity Christian Fellowship/USA Press.\n\nGillen, A. L. 2019. Life is in the Blood: How Red Blood Cells Reveal and Magnify the Creator as the Master Craftsman. Answers in Depth 14 (August 2, 2019), https://answersingenesis.org/biology/microbiology/life-is-in-the-blood/.\n\nGillen, A. L. 2019. The Genesis of Germs: Disease and the Coming Plagues in a Fallen World. Green Forest, Arkansas: Master Books.\n\nGillen, A. L. and Conrad, J. 2014. Our Impressive Immune System: More than a Defense. Answers in Depth 8 (January, 15, 2014), https://answersingenesis.org/human-body/our-impressive-immune-system-more-than-a-defense/.\n\nRoberts, L. S., J. Janovy, Jr., and S. Nadler. 2013. Schmidt and Roberts’ Foundations of Parasitology, 9th ed. Boston, Massachusetts: WCB McGraw-Hill.\n\nTortora, G. J., B. R. Funke, and C. L. Case. 2018. Microbiology, An Introduction, 13th ed. San Francisco, California: Pearson Benjamin/Cummings Pub. Co.", "opengraph": {"title": "Wise Blood: The Principle of Overcoming in Disease and Immunity (Part 1)", "url": "https://answersingenesis.org/human-body/wise-blood-overcoming-in-disease-immunity-part-1/", "description": "How our immune system protects us from deadly pathogens and parasites through antibodies to demonstrate how we’re fearfully and wonderfully made.", "image": "https://assets.answersingenesis.org/img/cms/content/contentnode/og_image/wise-blood-overcoming-in-disease-immunity-part1.jpg", "image:width": "1200", "image:height": "628", "site_name": "Answers in Genesis", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["/creation/", "/christian/", "#fn_1", "/god/", "/biology/microbiology/life-is-in-the-blood/", "/human-body/our-impressive-immune-system-more-than-a-defense/"], "authors": [], "publish_date": "Jan. 28, 2020, 6 a.m."}