{"result_id": "032015", "URL": "https://answersingenesis.org/coronavirus/how-covid19-started-and-where-its-going/", "timestamp": "2023-04-25 12:05:49 CEST+0200", "meta": {"description": "What is COVID-19, how it started, what are coronaviruses, did it evolve, how it spreads, and what we should expect as the situation develops.", "lang": "en", "keywords": "", "favicon": "https://assets.answersingenesis.org/img/favicons/apple-touch-icon.png", "canonical": "https://answersingenesis.org/coronavirus/how-covid19-started-and-where-its-going/", "encoding": "utf-8"}, "image": null, "domain": "answersingenesis.org", "title": "How COVID-19 Started & Where It’s Going", "cleaned_text": "What is COVID-19, how it started, what are coronaviruses, did it evolve, how it spreads, and what we should expect as the situation develops.\n\nCOVID-19, since making its appearance as a dangerous pneumonia in the human population in December 2019, has rapidly risen to every headline. Just as my own father once told to me about the depredations of the Spanish flu epidemic in his rural South Carolina home a century ago, so this generation will be talking about COVID-19 for years to come.\n\nWhile not the first pandemic to strike the modern world, the need to contain it and slow its spread has rightly captured the attention of every household, business, church, and government. In this information age, the latest news about the dangers of COVID-19 and how to stop its worldwide rampage saturate us. As news of its spread from China to the rest of the world unfolded, talking heads sometimes delivered contradictory information, reflecting both the rapidly changing situation and the simple lack of knowledge. There were even allegations—now shown to be false—that COVID-19 was man-made.1 Now we at least know it is a virus that made its jump from the natural world of animals to us.\n\nIn considering this virus, it’s important to remember COVID-19 is not the only kind of coronavirus. Coronaviruses are a large family of viruses including many that cause ordinary colds but also the deadly SARS and MERS viruses that surfaced a few years back. Analysis of the virus has confirmed that it has two particular mutations that make it able to latch onto and discharge its deadly genetic cargo into human cells. Those mutations may have both occurred randomly in the coronaviruses hosted by animals and then—once they became well equipped to take advantage of human hosts—spread readily among humans. Or perhaps the second mutation happened after the virus with the human-recognizing mutation made the leap to humans.\n\nIn any case, mutations are random changes in genetic information. If a mutation in a virus that infects one host randomly equips it to infect another host, and then that mutated virus gains access to the new host’s cells, that particular mutated virus multiplies rapidly. That is how viruses leap from animal to human hosts.\n\nSo how did COVID-19 start? Here’s the short version:\n\nIn December 2019 a severe pneumonia developing from what initially seemed to be an ordinary respiratory infection—fever, dry cough, flu-like aches, etc.—appeared in the population of Wuhan, China. Because COVID-19 started among the workers and clientele of a wet meat market—one in which food is slaughtered and sold on the spot—there was suspicion that the virus causing the disease had come from the animal population. China reported the first death on January 11. By January 13 the infection had arrived in Thailand. Since its initial leap from animals to humans, COVID-19 has spread rapidly in China and around the world through human-to-human contact.\n\nIf immune defenses are unable to successfully deal with the infection, then the hosts—in this case many humans, especially older ones—can become extremely ill and even die. While most people infected with COVID-19 appear to have a mild illness similar to the flu, this infection is far more dangerous. Overall, the risk of death with COVID-19 is significantly higher than with the flu—around 3.4% by current estimates. This lethality is due to the high risk of developing a severe pneumonia. And the risk of dying from a COVID-19 infection is dramatically high among older adults—nearly 5% for people in their 60s, almost 10% for people in their 70s, and around 18% for people in their 80s.2 COVID-19 also spreads far more rapidly than the flu, at least partly because people are infectious long before they feel ill. And while children who contract COVID-19 do not, so far, appear to get as ill as adults, they do transmit the infection to the more vulnerable.\n\nThe COVID-19 virus spreads easily in the droplets exhaled with every breath and every cough from an infected person, even during the two weeks before that person develops a fever. Those tiny droplets settle on surfaces, and the viruses in them, the CDC says, may remain infectious for hours or even days.3 Thus, we may become infected by inhaling virus-containing droplets in the air or from touching surfaces and then our own eyes, noses, and mouths. Rigorous disinfection of oft-touched surfaces, frequent hand-washing, keeping hands off of faces, maintaining a distance of six feet between people when possible, and avoiding crowds is hoped to reduce the number of individuals who catch COVD-19 and stop the exponential rise in severe cases that threaten to overwhelm our health-care system and rob us of our loved ones.\n\nIf you read the news at all, you’ve seen many mentions of how this virus has “evolved” to infect humans. And indeed this particular coronavirus has changed to make it able to infect human cells. But that change is mutation, which essentially means damage to existing genetic information. Many mutations can happen, but only those that make the resulting virus able to infect a new host result in this sort of scenario. No mutations of a sort that could potentially create a new kind of more complex organism have ever been observed. Thus, nothing about the present crisis validates any claims about molecules-to-man evolution.\n\nWhere Things Are Heading with COVID-19\n\nWith COVID-19 we are living through history. We do not yet know, and cannot realistically predict, how this chapter in human history will end. Science and society are facing challenges unprecedented in recent times.\n\nBattles are being fought in intensive care units where a variety of medications are being tried along with supportive care to rescue COVID-19 victims. Investigations are underway to determine what makes some people more susceptible to COVID-19’s deadly effects than others. Medical scientists in laboratories are searching for a safe and effective vaccine. Epidemiologists and virologists, once they have the opportunity to delve deeper into the origin of this particular zoonotic disease—the latest to leap from animals to humans—will be looking for ways to decrease the risk of the next one. It is not evolutionary beliefs but observational operational science that will supply the answers to dig us out of this nightmare and to come up with workable ways to address the next ugly microbe to crossover and come our way.\n\nMeanwhile, support systems that keep people supplied with basic necessities are being stretched to their limits. Those confined to their homes must rely on help from their neighbors and those who remain at work supplying critical needs like food and fuel. Countless sermons will be preached—through livestream to far-flung listeners who cannot safely gather—drawing an analogy between the way an insidious virus can change to something deadly which, like sin, creeps unseen into our lives and destroys us. And people the world over are getting a painful lesson in the importance of scrupulously good hygiene and the common practices that quickly spread infection from person to person. “Social distancing” is the latest and perhaps the most important addition to our common vocabulary.\n\nWhile we do not know how bad the situation will get, we should be thankful we live in a time when technology and worldwide communication systems can be brought to bear on these problems. And we should be exceedingly thankful for the selflessness of health professionals the world over who are remaining on the front lines, exposed to invisible dangers, with dwindling and imperfect personal protection equipment. We need to pray for God’s protection on them and for him to provide wisdom to all those who labor to bring us through this crisis.", "opengraph": {"title": "How COVID-19 Started & Where It’s Going", "url": "https://answersingenesis.org/coronavirus/how-covid19-started-and-where-its-going/", "description": "What is COVID-19, how it started, what are coronaviruses, did it evolve, how it spreads, and what we should expect as the situation develops.", "image": "https://assets.answersingenesis.org/img/cms/content/contentnode/og_image/how-covid19-started-and-where-its-going.jpg", "image:width": "1200", "image:height": "628", "site_name": "Answers in Genesis", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["#fn_1", "#fn_2", "#fn_3", "/evolution/", "/sin/", "/god/"], "authors": [], "publish_date": "March 25, 2020, 6 a.m."}