{"result_id": "032041", "URL": "https://answersingenesis.org/kids/show-tell/whats-new-at-zoo/month-of-babies/", "timestamp": "2023-04-25 12:06:20 CEST+0200", "meta": {"description": "June was a month full of animal babies for the Ararat Ridge Zoo at the Ark Encounter!", "lang": "en", "keywords": "", "favicon": "https://assets.answersingenesis.org/art/kids-icons/1810_KidsAnswers_FullLogo_AppIcon_57x57.png", "canonical": "https://answersingenesis.org/kids/show-tell/whats-new-at-zoo/month-of-babies/", "encoding": "utf-8"}, "image": null, "domain": "answersingenesis.org", "title": "Month of Babies", "cleaned_text": "June was a month full of animal babies for the Ararat Ridge Zoo at the Ark Encounter! Jael the Asian forest scorpion gave birth to 26 babies, called scorplings. They rode on her back for two weeks while they were still vulnerable so she could protect them. Then they climbed off her back and continue to grow up behind the scenes! You can learn more about Jael’s motherhood journey and her babies by reading our Asian forest scorpion article!\n\nNot a fan of eight-legged babies? We also welcomed an adorable one-year-old red kangaroo baby, called a joey, named Obadiah (Obi for short). Once he grows up, he will join our six adult female red kangaroos in our walkabout exhibit. Red kangaroos are native to Australia and are the world’s largest marsupials. They live in groups called “mobs” made up of one male, multiple females, and their joeys. Although Obi is fixed, he will still serve as the “mob leader” when he’s an adult.\n\nObi is currently being hand-raised by our experienced zoo staff - he goes home with them every night. He’s still drinking milk from a bottle but has started eating grain and hay too. Once mother kangaroos naturally kick their joeys out of the pouch, our zookeepers take over for a while to ensure they become well-trained and accustomed to people. Since our kangaroos are exposed to a wide variety of sights, sounds, smells, and strangers in the walkabout, it’s important they become desensitized. He is in training to become a show kangaroo like one of our adult females, Naamah. She walks on a leash and harness in our daily animal programs. Obi is already doing well walking on his leash and harness!\n\nZoo staff will also train him to participate in his own health care. This month, during our big vet visit where all our zoo animals got their yearly physicals and vaccines, our adult female kangaroos stood still and allowed our vets to give them their shots voluntarily. If you’ve ever had to wrestle a dog to get their shots, you know that can be an ordeal—imagine fighting with a 100 pound kangaroo! Instead, our zookeepers build positive, trust-based relationships with our animals and train them to calmly allow veterinary care in exchange for treats. It makes our animal and staff lives easier and more stress-free!\n\nAnother interesting veterinary behavior that has been trained is with our zonkey, Cletus. A zonkey is a cross between a male zebra and a female donkey. Since horses, donkeys, and zebras belong to the same created kind (Genesis 1:24-25), they can hybridize!\n\nEvery summer, Cletus develops environmental allergies, just like some people do. Since we can’t change the environment, our vet staff does their best to manage his reactions. He gets a variety of medications to help, but allergens have been very high this year. So his vet decided to try a new therapy called Phovia light energy treatment. A unique gel is put on his itchy spots and a special light is shone on it to activate it to work with his body’s natural healing responses to help his skin repair faster. He gets it every five days, and his keepers must wear special glasses to protect their eyes from the light. Since Cletus’s head is above where the light shines, his eyes are safe. He’s done a great job standing still for this treatment, and our zoo staff are excited to see the results! Join us again next month for more zoo news!", "opengraph": {"title": "Month of Babies", "url": "https://answersingenesis.org/kids/show-tell/whats-new-at-zoo/month-of-babies/", "description": "June was a month full of animal babies for the Ararat Ridge Zoo at the Ark Encounter!", "image": "https://assets.answersingenesis.org/img/cms/content/contentnode/og_image/kids/blogs/last-week-zoo/kangaroo-baby.jpg", "image:width": "1200", "image:height": "628", "site_name": "Answers in Genesis", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["https://answersingenesis.org/kids/bugs/asian-forest-scorpion/"], "authors": [], "publish_date": null}