{"result_id": "032013", "URL": "https://answersingenesis.org/are-humans-animals/chimp-rights/", "timestamp": "2023-04-25 12:05:47 CEST+0200", "meta": {"description": "“They’re not people, you know .&nbsp;.&nbsp;. ”", "lang": "en", "keywords": "Human life,Apes,Chimpanzee", "favicon": "https://assets.answersingenesis.org/img/favicons/apple-touch-icon.png", "canonical": "https://answersingenesis.org/are-humans-animals/chimp-rights/", "encoding": "utf-8"}, "image": null, "domain": "answersingenesis.org", "title": "Chimp Rights", "cleaned_text": "“They’re not people, you know . . . ”\n\nSo says the villain in the film Rise of the Planet of the Apes. In real life, the ethics of chimp research are being debated by Congress, the NIH, and animal rights activists. And chimps’ “rights” are being weighed against the value of the medical information needed to save human lives.\n\nAnimal models are valuable tools for biomedical research. Initial research proceeds more quickly when an animal model is available. But laboratory mice aren’t suitable guinea pigs for all situations.\n\nChimp research has contributed life-saving discoveries to our medical arsenal. Supporters of chimp research point out that “The chimpanzee is the only animal model in which human strains of [hepatitis C] can replicate, making [chimpanzees] especially important in work to develop a vaccine.” Others counter that “despite the genetic similarities between chimps and humans, they have relevant differences in, for instance, immune-response genes, and that [those] differences in gene expression make chimps weak as a biological model.”\n\nWith plans to call 200 retired chimps back into active service, the NIH convened a committee to evaluate the biomedical value of chimp research. But criticism erupted when the NIH declined to consider ethical arguments against such research. An editorial in Nature says, “The agency may wish to divorce the science from the ethics, but society at large will not accept such a distinction. Nor is it intellectually defensible: a moral choice to use intelligent, emotionally complex creatures to their detriment, for the benefit of human welfare, is intimately related to what can be achieved scientifically.” A public outcry heightened after the airing of an undercover exposé in which instances of inappropriate behavior by technicians were caught on film. In one instance, a technician slapped a chimp for biting. Interestingly, a visually disturbing scene in which a sedated chimp fell off of a bed occurred because the undercover agent stepped away from the chimp to take pictures.\n\nThe debate will soon move to Congress. The “Great Ape Protection and Cost Savings Act” would make invasive chimp research illegal in the United States. The European Union outlawed chimp research in 2010, but European pharmaceutical companies can still contract their research to American facilities. If the bill passes, all such research, whether publicly or privately funded, will become illegal.\n\nWhile we certainly oppose animal cruelty, in the wake of the recent United Nations statements about the rights of all creatures being equal to those of humans, we want to pay attention to the manipulation of public opinion. This summer will see the release of two films likely to have a significant impact: The Rise of the Planet of the Apes, in which research chimps evolve human-like intellect, is sure to excite emotions with their very human features. And the documentary Project Nim will tug at our heart strings as it “powerfully explores the line between human and animal” (quotation from trailer) by teaching a chimp sign language to find out what it is thinking.\n\nHumans like to anthropomorphize animals, imagining they think the way we do. Ethical issues rise to new heights with chimps, however, because many people are convinced we share a common ancestor. It is as if we look at the ape and think, “There, but for the grace of the evolutionary tree, go I.” Claims of genetic proof reinforce this notion. Yet these so-called near-identities are based on a number of assumptions. The more genetic research unfolds, the more differences become apparent. The latest research is covered in a study just published in the Answers Research Journal.\n\nAs Christians, we should already know that chimps deserve ethical treatment because tells us that “a righteous man regards the life of his animal.” But we must be very clear that only human beings, not chimpanzees, are made in the image of God.\n\nFor More Information: Get Answers Remember, if you see a news story that might merit some attention, let us know about it! (Note: if the story originates from the Associated Press, FOX News, MSNBC, the New York Times, or another major national media outlet, we will most likely have already heard about it.) And thanks to all of our readers who have submitted great news tips to us. If you didn’t catch all the latest News to Know, why not take a look to see what you’ve missed?", "opengraph": {"title": "Chimp Rights", "url": "https://answersingenesis.org/are-humans-animals/chimp-rights/", "description": "“They’re not people, you know .&nbsp;.&nbsp;. ”", "image": "https://assets.answersingenesis.org/img/cms/content/contentnode/header_image/are-humans-animals.jpg", "image:width": "945", "image:height": "300", "site_name": "Answers in Genesis", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.nature.com/nature/journal/v474/n7351/full/474252a.html", "/genetics/dna-similarities/chimp-genome-sequence-very-different-from-man/", "https://answersresearchjournal.org/how-genomes-sequenced/", "/god/", "/sanctity-of-life/", "/answers/", "/forms/media-response/", "/answers/news-to-know/", "/about/privacy-policy/"], "authors": [], "publish_date": "June 25, 2011, midnight"}