{"result_id": "032030", "URL": "https://answersingenesis.org/biology/microbiology/creation-and-the-germ-theory/", "timestamp": "2023-04-25 12:06:07 CEST+0200", "meta": {"description": "Today, we take for granted that germs cause disease, and many people fear them. Yet for centuries, the concept of germs was virtually unknown.", "lang": "en", "keywords": "Bacteria,Evolve,Germs,Healthy", "favicon": "https://assets.answersingenesis.org/img/favicons/apple-touch-icon.png", "canonical": "https://answersingenesis.org/biology/microbiology/creation-and-the-germ-theory/", "encoding": "utf-8"}, "image": null, "domain": "answersingenesis.org", "title": "Creation and the Germ Theory", "cleaned_text": "The news media writes frequently that germs cause disease. Infectious diseases such as swine flu, Salmonella, Escherichia coli, MRSA, multi-drug resistant tuberculosis, and AIDS have captured the national headlines in recent months. With each passing year, these headlines reveal that some new disease outbreak or plague threatens thousands of lives. For example, in 2009 the news flash “Swine Flu Threatens the Globe” was broadcast across the nation, alarming many people. The emergence of a new strain of flu (H1N1) was said to place millions at risk.\n\nToday, we take for granted that germs cause disease, and many people fear them. Yet for centuries, the concept of germs was virtually unknown. Leprosy, plagues, and pestilence were diseases of mystery through most of history. The cause of infectious (or contagious diseases) was not known. Many speculated that mysterious miasmas caused sickness or that mysterious elements were spontaneously generated. Miasma was thought to be a poisonous gas- or vapor-filled particle of decaying miasmata (matter) that caused various sickness and disease.\n\nToday, the term germ is well known and refers to disease-causing microbes, i.e. pathogens. A pathogen is a microbe capable of causing damage to the host creature in which it lives. One of the central themes in biology is the germ theory of disease (Rutherford and Ahlgren 1990). The germ theory is one of the most important concepts to understand in the age of pandemic flu, MRSA, E. coli, Salmonella, and other deadly infectious diseases.\n\nIn this short paper, we provide historical background on the emergence of the germ theory of disease in the 1800s. Christians, Jews, and non-religious scientists have contributed to the germ theory over the past 150 years. The basic history of the germ theory is given in many texts, most often giving credit to the experimental work of Pasteur, Lister, and Koch. However, the role of worldview, and the fact that many of these scientists were Christian and creation biologists, is often left out (Table 1).1 This article seeks to illustrate how creation and biblical thinking led to the germ theory in a logical chain of development. In this article, we would like to show specifically how the historic, biblical worldview of Creation, Curse, Corruption, and Contagion played an important role in the chain of thinking that led to the germ theory (Tables 1 and 2).2\n\nThe idea of contagion is very old. Contagium animatum (i.e., the invisible spread of diseases by close contact) in the Old Testament, especially in the Mosaic Law (Leviticus and Deuteronomy), is discussed and referred to (in various translations) as infectious and contagious diseases, leprosy, plague, and pestilence. Perhaps some Jews envisioned an unseen agent causing diseases. In any case, the practices of cleansing one’s hands, instruments, and other objects dates back to ancient Israel when Moses instructed the Israelites about purification (in Leviticus). This was not just spiritual cleansing; it also had a useful medical purpose.\n\nAbout three millennia before Leeuwenhoek, Semmelweis, Pasteur, Koch, and Lister, the Creator instructed His people to distinguish between the unclean and the clean ( ). This seems to foreshadow the antiseptic principle. In the Levitical law, God instructed man about other disease-fighting principles such as quarantine, sanitation of body wastes, and disinfection, long before microscopes and the Golden Age of Microbiology (1870s to 1914).\n\nThe idea of contagious diseases would not get further developed until Girolamo Fracastoro (in 1546). Fracastoro proposed that a contagious agent caused syphilis and some other diseases. However, he could not see a contagious agent. It would take the invention of a good microscope to see agents of contagion such as bacteria, fungi, and protozoans.\n\nAlthough Anton van Leeuwenhoek did not invent the microscope, he certainly advanced it (in the 16th century), long before anyone else. He was the first to use a microscope widely and to describe bacterial, protozoan, and other microscopic life-forms (Gillen 2007). He was a committed Christian of the Dutch Reformed faith. Leeuwenhoek found great joy in God’s smallest creatures, e.g., bacteria and protozoans, even in his youth. He spent countless hours grinding tiny lenses and looking through them through homemade microscopes. For Leeuwenhoek, the amazing diversity of tiny life-forms glorified God. In his lifetime, he started the field of microbiology and opened mankind to the world of microorganisms. By 1673, van Leeuwenhoek was discovering things that no human eye had ever seen. When he described “minute eels,” he was probably actually observing a spirillum-shaped bacterium, perhaps Spirillum volutans. Anton van Leeuwenhoek began the work of describing bacteria and other microorganisms (Gillen 2007), but after he died, interest in microbes “died” along with him for two main reasons: biologists lacked instruments for effectively studying this field, and most microbes were considered mere amusements—not causes of disease nor connected to anything useful.\n\nThe Listers and the Light Microscope\n\nMany people are familiar with van Leeuwenhoek and Lord Joseph Baron Lister, but few are aware of the critical contributions of Lord Lister’s father, Joseph Jackson Lister. Although Lord Lister was very successful (even Listerine® is named after him), his father Joseph Jackson Lister was responsible for improving the main invention used in Lord Lister’s later discoveries, the light microscope (Fig. 1). It might be noted that a major part of Joseph Lister’s success is that it was built upon the knowledge of a proficient microscope.\n\nJoseph Jackson Lister greatly improved the regular light microscope in the early 19th century. He invented achromatic lenses that removed artificial “rainbow” effects across the viewing screen. He also invented the “Lister limb,” a strong support for the upright body tube of a large (professional) microscope. The invention of an achromatic lens (taking away distracting colors at high magnifications) enabled a clear look at bacteria and other microbes, and the limb attached to the body tube allowed for much larger microscopes to be built and supported.\n\nLister made other microscope improvements including adding graduated draw tubes that made it easier to set up and focus the microscope, additional lenses to act as a sub-stage condenser, and a rotating clamping stage to manipulate the slide. The main significance to Lister’s new 1826 microscope was to provide a superb quality to the viewing of microscopic images and invent a mechanism to support a large or heavy microscope. In addition, J.J. Lister was a friend of Dr. Thomas Hodgkin, a fellow Quaker and physician at a prominent hospital in London.\n\nUsing the “newly” invented microscopes (1826), J. J. Lister and Hodgkin conducted studies on blood and co-authored scientific papers. They were the first to describe the elegant and intelligently-designed, biconcave disc-shape of healthy red blood cells (erythrocytes) and their tendency to gather like a stack of dishes in a roll. The erythrocyte stack is called rouleaux when passing through capillaries. Later, Dr. Thomas Hodgkin would describe a cancer of blood (lymphoma), now called Hodgkin’s disease is his honor.\n\nJ. J. Lister’s contribution and advancement of the modern microscope took this instrument from a toy, or hobby status to a prominent tool used in medical research (Lister 1909). It would have a profound effect on his son and Joseph Baron Lister would soon promote antiseptic surgery based upon his bacteriological studies. J.J. Lister, Thomas Hodgkin and Joseph Baron Lister were Christians. The “new” microscope would give his son, Joseph Baron Lister, an advantage in medical school and in his early practice as a physician. The younger Joseph Lister was said to be a bold witness for Christ in his younger years. Although most Quakers were quiet about their faith, Joseph was very “evangelical” (Fisher 1977). He will be discussed further, later in this article.\n\nBy the 1850s, the compound light microscope was advanced enough for Louis Pasteur (and others) to take advantage of being able to actually see microorganisms (Fig. 2). As Pasteur called attention to microbes as possible agents of infectious disease, the technology became even more advanced. With technology in place and a reason to use it, the germ theory advanced. Pasteur believed that science should have practical applications. In 1857, he took advantage of the challenge to unravel the mysteries of why French wines and milk were turning sour. The prevailing ideas were that fermentation was purely a chemical breakdown of grape juice in alcohol. Pasteur was able to show that fermentation was due to yeasts. In the case of milk, it was bacteria causing it to go sour. Thus, he called these fermentations the “diseases” of wine and milk.\n\nThe name most closely associated with the idea that germs cause disease is Louis Pasteur (Brock 1961). It was Pasteur who developed his ideas of fermentation and experiments on milk and wine spoilage, indicating disease by microorganisms. Prior to Pasteur, the connection between microorganisms and disease was not apparent, since many microbes were known to be beneficial for humans (yeasts added to bread or starter cultures for yogurt and cheese) and were thought to not cause disease.\n\nLouis Pasteur and the Germ Theory of Disease\n\nOne of Pasteur’s first major scientific contributions was disproving the supposed spontaneous generation of living things (such as bacteria) from non-living organic matter. (However in spite of this disproof, spontaneous generation is now considered to be the foundation of the evolutionary view of the origin of life if “millions of years” are added). In Pasteur’s day most people believed in miasmas (“atmospheres”) and other nonscientific reasons for the origin of infectious diseases. Out of nowhere, substances could supposedly cause contagious diseases. Pasteur’s simple but elegant swan-necked flask fermentation experiments not only put to rest the organic life-from-non-life idea, but also set the foundation for the law of biogenesis: life only comes from pre-existing life.\n\nPasteur’s fermentation studies thus led to the germ theory of disease. In his first biological paper, published in 1857 at the age of thirty-five, he boldly formulated what he called the germ theory of fermentation: he proposed that each type of fermentation is caused by a specific kind of microbe (Gillen and Sherwin 2008). He suggested that this theory could be generalized and even suggested a specific microbial etiology (cause) of disease. Eventually the hypothesis of specific etiology led him to specific vaccinations and the germ theory of infectious diseases.\n\nIt was this theory that Pasteur later generalized for what he called “diseases of wine” for the souring of fermented grape juice by microbes. Then from 1867 to 1870, he studied two important silkworm diseases and established the responsible agents as protozoa and bacteria. Pasteur provided a great conceptual scheme to explain each of these cause-and-effect relationships. By 1877, the germ theory of disease was so firmly established that even Pasteur’s critics could not counter the evidence (Dubos 1962). Pasteur went on to suggest that the genesis of germs in hospital patients was the result of microbes coming from microbes, not a result of spontaneous generation! This revolutionary idea would have application in many areas of medicine. It formed the basis of sterilization, asepsis in surgery, and the germ theory of disease.\n\nPasteur had the uncanny ability to combine theoretical, operational, and applied science—the mark of a truly gifted scientist. Pasteur understood the variability of microbes and how he could apply his germ principle in vaccine preparation. For example, he noticed that Bacillus anthracis cultures sometimes lose their pathogenic ability when heated and then retain this modified, nonvirulent, or “attenuated” trait through many generations. He applied this concept to vaccinate dozens of sheep that would have otherwise died during a critical time in France. His understanding of this natural variation was also successfully applied in developing vaccines for chicken cholera and human rabies (Fig. 3).\n\nAlthough his scientific pronouncements were sometimes abrasive to his fellow scientists, he remained firm in his convictions because they were based on painstaking research. Pasteur had a strong religious and humanitarian spirit. He firmly believed in the Christian God as the Creator of all living things (Gillen and Sherwin 2008). From his knowledge of the Gospels, he wanted to benefit mankind by having his ideas used to “heal the sick.”\n\nIt seems that the hand of the Creator was guiding him. He discovered the particular causes of fermentation and later the specific origins of infectious diseases that led to lifesaving vaccinations. Pasteur’s writing regarding fermentation, putrefaction, and germ theory soon influenced Christian surgeon Joseph Lister (1827–1912). In addition, Pasteur was the first to notice the antimicrobial effects that some harmless bacteria had on some pathogenic ones. He observed that some bacteria produced antibiotics against other competing bacteria, such as in his milk studies in 1857 and then more obviously in his anthrax studies in 1878. Many historians of science recognize the significance of his observation that when Pasteur placed a pathogenic Bacillus in contact with soil microorganisms, they lost their virulence. He had a vision of an antimicrobial effect (through antibiotic chemicals) that Alexander Fleming, the discoverer of penicillin, and others would realize and exploit a half century later.\n\nThe biological sciences and medicine could not have proceeded without the precise knowledge provided by the concepts of biogenesis (life comes from life) and the germ theory of disease. Microbiologists and medical scientists, especially Joseph Lister and those who pioneered aseptic surgery profited from the pioneering work of Pasteur’s creation thinking. Untold numbers of lives were saved. It is clear that the hand of Providence was moving as Pasteur was conducting his experiments. Perhaps, R. C. Sproul (1996, book cover) summarized it best, “The invisible hand that governs the universe with ‘perfect intentionality’ has worked for the good of those who love him.”\n\nPasteur perceived that his findings with regard to the role of microbes in fermentation were probably relevant to the problem of infectious diseases. Although his 1857 paper dealt primarily with the conversion of lactose into lactic acid, he was insightful enough to state that just as microbes can multiply in organic solutions, thereby causing chemical changes, likewise they might multiply in the body of living things and cause infectious diseases (Pasteur 1857). It was this theory in which he later utilized the expression “diseases of wine” to designate the souring of fermented grape juice by microbes. Then from 1867 to 1870, he studied two important silkworm diseases and established the responsible agents as protozoa and bacteria.\n\nThe Germ Theory and Its Applications\n\nPasteur had recognized a principle of specific infectious (germ) formation by a specific organism as the cause of each infectious disease. However, because he was not a physician, he did not directly apply this germ theory. On the other hand, Lord Lister was a physician, so he did appreciate the analogy between germ formation and putrefaction in a wound. This led Lister to recognize the role of bacteria entering wounds from the air; and, therefore, he developed the antiseptic treatment of wounds (with carbolic acid dressings and spray). The awesome success of this method led to its widespread application and strengthened the case for the germ theory. Other investigators, especially Robert Koch, began to search for specific pathogens for specific diseases. Thus, each scientist built upon the former one’s success.\n\nJoseph Lister (1827–1912) was acquainted with the principle of asepsis better than anyone in his generation! Lord Lister (Fig. 4) is best known for being the first person to keep his surgical instruments clean from the start to the finish of an operation. More importantly, he was a devout, evangelical Quaker physician. Lord Lister is best known for pioneering aseptic surgical methods. Lister is also known as a cofounder of the germ theory, as the physician for Queen Victoria, for the first successful use of permanent artificial limbs, and for working with wound infections. Lister identified himself on numerous occasions as a Bible-believing Christian who believed in special creation and rejected Darwinism and the ideas of abiogenesis (Fisher 1977; Godlee 1917).\n\nJoseph Baron Lister was a British physician who revolutionized surgery by preventing infection in surgical wounds. Lister, impressed with Pasteur’s work on fermentation, completed work that would complement Pasteur’s bacteriological studies. In particular, he investigated lactic acid fermentation and milk spoilage. Lister thought of milk spoilage as a type of infectious disease. Lister wondered if minute organisms might also be responsible for the pus that forms in surgical wounds. He experimented with phenol (carbolic acid), applying it at full strength to wounds by means of a saturated rag. Lister was particularly proud of the fact that after carbolic acid wound dressings became routine for his patients, the patients no longer developed gangrene. Later, he improved this antiseptic surgery by excluding bacteria from wounds by maintaining a clean environment in the operating room and by sterilizing instruments (Fig. 5).\n\nLister made the connection between how a specific bacterium causes “lactic ferment” in milk and how bacteria in surgical wounds often cause gangrene and pyemia (pus-forming infections) in humans. Lister’s laboratory studies of “milk diseases,” in conjunction with Pasteur, led him to studies of “surgical diseases.” Based on his observations of aerial bacteria contaminating milk in flasks, Lister attempted to reduce infections by spraying a mist of carbolic acid in the air of operating rooms (Fig. 5). This application of the germ theory was less successful than the asepsis techniques that he used on instrumentation, gauze, bandages, and other material objects. He was also the first to successfully implant artificial limbs because he kept them germ-free.\n\nSuch procedures were preferable to killing the bacteria after they entered wounds because they avoided the toxic effects of the disinfectant on the wound. His technique of asepsis, along with hand washing, meant that most patients no longer suffered from new germs being introduced during surgery. The British Medical Journal recently stated that “he [Lister] saved more lives by the introduction of this system than all the wars of the 19th century together had sacrificed” (Nester et al., 2007).\n\nEarly in his life, Lister suffered persecution because of his rejection of Darwinism. For example, he apparently was discriminated against in a medical school exam because his ideas did not align with an examiner’s evolutionary views on comparative anatomy (Fisher 1977, p 54). Later, he contended with Darwinists over abiogenesis (the supposed evolution of life from non-living things) (Fisher 1977, p. 181). Although Pasteur had apparently put the idea of spontaneous generation to rest in 1864 (Gillen and Sherwin 2008), a few scientists still had doubts. By contrast, Lister embraced the idea of biogenesis (living things only come from pre-existing life) and applied it to infection and wound control, by suggesting that bacteria came only from pre-existing bacteria; and this helped to promote antiseptic methods (by 1871). By that date, most of Britain’s top medical doctors accepted Lister’s bacteriological explanation for wound sepsis and his methods of applying antiseptics to operating room surfaces and the skin. It should also be noted that although Lister differed with Darwin on several issues, they did remain professional “friends” and frequently corresponded (Godlee 1917, p. 310).\n\nHowever, a remnant of biologists, most notably Thomas Huxley (Darwin’s “bulldog”), felt that Lister’s explanation and practice were good for some surgeries; however, not for all of them. Huxley still embraced abiogenesis in some circumstances and thought that germs could spontaneously generate in the wound itself—or might even evolve in the air (Fisher 1977, p. 181)! Many Darwinists in the 1880s still believed in spontaneous generation, and felt that germs in wounds could suddenly appear from “out of nowhere.”\n\nLike Pasteur, Lister did not accept this ancient, unsupported concept. Therefore, Lister had to defend his belief in biogenesis, that any bacteria found in wounds must be a result of contamination in the surgery room. His answer for this was asepsis, clean hands, and a clean hospital. Perhaps he had also considered Bible passages like: “ This is the law . . . make a difference between the unclean and the clean ” ( ) and “ Depart ye, go ye out from thence, touch no unclean thing; go ye out of the midst of her; be ye clean, that bear the vessels ” ( ).\n\nIn conclusion, Lister revolutionized medicine because he practiced good science. This practice of good science was preceded by a Christian heritage and grounded in biblical thinking. In the tradition of Pasteur and Koch, Lister applied the germ theory via his public promotion of cleanliness and sanitation to various governments and institutions around the world to reduce tuberculosis and other major infections. The germ theory of disease is still one of the most important concepts in our age of AIDS and other deadly diseases. In the future, remember the above historical events when you are in surgery or use “Listerine®” mouthwash or toothpaste.\n\nFor the first few decades of the 1800s, specific bacteria were suspected of causing particular diseases. Men like Pasteur and Lister had provided increasing evidence that bacteria might cause certain diseases, such as anthrax, yet they could not conclusively prove this. They did, however, lay the groundwork for Robert Koch, who developed a logical series of observations and experiments (Koch’s postulates) that proved the specific element of many infectious diseases, starting with anthrax. The series of steps worked out by Koch and others has become known as Koch’s postulates. He completed the famous postulates with anthrax.\n\nThe next and even more important disease that made Koch and his postulates famous was tuberculosis (TB). TB is a human lung disease that destroys alveoli and other neighboring lung tissues. At the start of the 20th century, it was the leading cause of death in the United States. Koch was the first to describe its cause, the bacterium Mycobacterium tuberculosis. This organism had been of great interest because numerous researchers had suspected it caused the widespread, often-lethal infection. Koch made a second important discovery: he found a way of staining tissue for microscopic examination that could accentuate the M. tuberculosis cells (as thin blue rods on a brown background). With these tools, Koch set out to prove that tuberculosis was caused by M. tuberculosis. In the 1870s, not only was there no proven connection between the two, there was also no definitive proof that any particular microorganism caused any particular disease. There was only suggestive evidence of causation.\n\nKoch then began to put together his four postulates of disease causation. Koch began by examining tuberculosis patients for the presence of M. tuberculosis cells. He found the bacterium in every patient—blue rods against brown tissue. Then Koch cultured the tuberculosis cells on serum taken from coagulated blood, thus isolating pure M. tuberculosis cultures. He then injected this culture into guinea pigs, which succumbed to tuberculosis. Therefore, unequivocally, M. tuberculosis caused tuberculosis. This work M. tuberculosis provided absolute proof of the microbial etiology (cause) of an important infectious disease. Moreover, Koch was then able to enunciate a valuable principle: the successful demonstration of Koch’s Postulates would provide absolute proof that a specific microorganism was the cause of a particular disease:\n• The suspected causative microorganism must be present in every individual with the disease.\n• The causative microorganism must be isolated and grown in pure culture.\n• The pure culture must cause the disease when inoculated into an experimental animal.\n• The causative microorganism must be re-isolated from the experimental animal and reidentified in pure culture.\n\nNevertheless, Koch’s postulates are not the only route to determining an infectious etiology. They are, however, the best time-tested models for determining specific cause-and-effect in bacteriology. For example, these postulates would be used by Dr. Carl Fliermans when he helped determine the etiology of Legionnaire’s diseases (Fig. 6).\n\nThe cause of human, plant, and animal diseases had been a mystery for millennia: contagion, the ability of a disease to pass from one person to another, had been recognized from at least biblical times; however, the mechanism of such contagion had been unclear. Nothing visible could be observed passing from a diseased person to a healthy person. This led to many erroneous ideas about the cause of disease. For centuries, many people thought that miasmas (poisonous gases or vapors) were the cause of various sicknesses and diseases. In contrast, the concept that invisible particles being transmitted from person to person provided a tangible explanation for the phenomenon of contagion (contagium animatum).\n\nThe phenomenon of contagion seems to well known among the Jews since the giving of the Levitical law. The “Sanitary Code” is implied throughout the Bible, the Talmud, and other Jewish writings. The Jews held a very high standard of cleanliness throughout the Old and New Testament. It started under the leadership of Moses and was later held by subsequent priests and kings. The cleanliness standard seemed to have taken on an extreme by the time of the New Testament. Although the early Jews and some Gentiles had very high standards of sanitation, most probably did not understand why. There is a suggestion that a few understood that contagion was the cause of infectious diseases and rightly held to clean food, proper disposal of waste, and washing of hands. Without the sanitary code (ultimately given by the Creator), the Jews would have lived a shorter and more difficult life for centuries. However, if they obeyed to the Mosaic Law, victory was given over many contagious diseases ( ) thanks to an understanding by their Creator and Maker that germs cause disease.\n\nAlthough some may argue that the germ theory has its origin with Girolamo Fracastoro in 1546 or Bassi in 1835, the name most closely associated with the idea that “germs cause disease” is Louis Pasteur (Brock 1961). Pasteur developed his ideas of fermentation and disease from his experiments on milk and wine spoilage. Prior to Pasteur, the connection between microorganisms and disease was not apparent, since many microbes were known to be beneficial to humans and did not cause disease. The understanding of contagion would take both the microscope and experimentation. In the 200 years after Leeuwenhoek, some people hypothesized that microbes might be the cause of “contagion,” but it would be a number of years before other significant discoveries took place.\n\nThe antecedents to the germ theory were as follows: disproving the “evolutionary” idea of spontaneous generation of microbes; perfecting the microscope; the observation and proving of biogenesis; the discovery of fermentation or spoilage of foods (milk, wine, beets) caused by microbes; the demonstration of protozoan parasites as the cause of Pebrine (silkworm disease); and showing that bacteria caused animal diseases like chicken cholera, anthrax, and rabies. The work of Joseph Lister and Louis Pasteur would give strong credence to the germ theory. Then, the work of Robert Koch and his famous postulates would once and for all verify the germ theory. He was able to demonstrate specific bacteria that caused specific diseases such as anthrax, cholera and tuberculosis. The Golden Age of Microbiology had been ushered in.\n\nAfter 1879, Louis Pasteur and Robert Koch were able to associate specific bacteria with certain diseases. Pasteur first developed his ideas of the germ theory from his work on Pebrine and chicken cholera in the 1870s. Then, in the 1880s, Pasteur solved anthrax and rabies disease plagues by treating sheep and dogs using the germ theory concept. Pasteur applied his germ theory to vaccinating people against deadly diseases. During the late 1800s, physicians such as Joseph Lister and Robert Koch began to understand the role of microbes in causing disease, so they applied aseptic principles in their medical practices. The new techniques in surgery, along with hand washing, meant that most patients no longer suffered from gas gangrene, poisoning of the blood, or amputation because of surgery. By the end of the 19th century and because of disinfected surgical instruments and hand washing, patients were less likely to die in the operating room. Both Louis Pasteur and Joseph Lister expressed faith in God, and were, to some extent, “listening” to the Creator by His Scripture and His Spirit to solve medical plagues of their day.\n\nPasteur was also an experimentalist, performing operational science by testing physical phenomena on a regular basis. He, like so many other creation scientists, is a prime example that you do not have to be an evolutionist to do good science. Let no one claim that faith in God is detrimental to this burgeoning enterprise. Pasteur, France’s number one scientist, said, “The more I study nature, the more I stand amazed at the work of the Creator” (Gillen and Sherwin 2008). Pasteur’s faith was as genuine and logical as his science.\n\nMany other Christian and creation biologists were “founders” of tropical medicine and involved in the discovery of microorganisms, vectors and parasites (Graves 1999). Some notable ones are mentioned below; however, space will not permit discussion of the involvement and contributions of many Christians to parasitic and vector-borne diseases. Sir Patrick Manson discovered the elephantiasis parasite (Wucheraria bancrofti) in the Culex mosquito. Sir Ronald Ross discovered the malaria parasite (Plasmodium) in the Anopheles mosquito. Walter Reed discovered the mosquito vector (Aedes) for yellow fever. In modern times (1977) Carl Fliermans completed Koch’s Postulates for Legionnaire’s disease and virtually described all the ecology of Legionella bacteria.\n\nAs far we can tell, each of the above men was a committed Christian and held a creation worldview. Each of these is described in the book The Genesis of Germs (Gillen 2007). Both Christians and non-Christians have clearly added substance to the modern-day germ theory. Most of the early founders of microbiology held to a Judeo-Christian worldview. Sadly, there are very few creation microbiologists today.\n\nSince his Fall, man has struggled to conquer disease, one of the curses brought upon him by sin. Only in the past two centuries, however, has man made great strides toward curing and preventing diseases. In today’s world, there is a failure of scientists to recognize the clear evidence of the Creator’s hand in the world around us. This was not so just a few centuries ago. Fracastoro, Bassi, Pasteur, the Listers, Ross, Manson, and Reed were either traditional Catholics or evangelical Christians. Their lives were focused on experimental science as it related to infectious disease, but they were also influenced by a Judeo-Christian worldview. Many of the “founders” of modern-day microbiology and parasitology held a worldview that was consistent with historic and traditional biblical teachings, including those about Creation, the Curse, Corruption, Contagion, and Christ. If a biblical worldview comes back, we might again have more medical discoveries and an increase the quality of life of mankind.\n\nWe would like to express our appreciation for the photography of microscopes by Dr. Paul Sattler.\n\nWe wish to also thank Georgia Purdom for all her comments and providing feedback on earlier drafts of the manuscript.\n\nBulloch, W. 1938. The history of bacteriology, New York: Dover Publications.\n\nDubos, R. J. 1986. Louis Pasteur: Free lance of science (Reprinted from 1950). New York: Da Capo Press.\n\nDubos, R. J. 1962. The unseen world. New York: The Rockefeller Institute Press.\n\nGillen, A. L. 2007. The Genesis of Germs: Disease and the Coming Plagues in a Fallen World, Green Forest, AR: Master Books.\n\nGillen, A. L. and F. Sherwin. 2008. Louis Pasteur’s Views on Creation, Evolution, and the Genesis of Germs. Answers Research Journal (1): 43–52.\n\nLister, J. 1877. On the lactic fermentation and its bearing on pathology. In Brock, T., 1961. Milestones in microbiology, 58–65. Washington DC: The American Microbiology Society.\n\nLister, J. B. 1909. The Collected Papers of Joseph, Baron Lister. In Two Volumes Vol. I & II London: Oxford At The Clarendon Press (Printed in 1979; Reprint of the 1909 edition).\n\nPasteur, L. 1857. “Report on the lactic acid fermentation.” In Brock, T. 1961. Milestones in microbiology, 27–30. Washington DC: The American Microbiology Society.\n\nPasteur, L. and J. Lister. 1996. Germ Theory and Its Applications to Medicine & on the Antiseptic Principle of the Practice of Surgery (Great Minds Series). Amherst, New York: Prometheus Books.\n\nRutherford, F. J. and A. Ahlgren. 1990. Science for all Americans. New York: Oxford University Press.\n\nSproul, R. C. 1996. The invisible hand. Phillipsburg, New Jersey: Presbyterian & Reformed Publishing.\n\nVallery-Radot, R. 1901/1902. The life of Pasteur. 2 vols. Translated by R. L. Devonshire. London: Archibald Constable.", "opengraph": {"title": "Creation and the Germ Theory", "url": "https://answersingenesis.org/biology/microbiology/creation-and-the-germ-theory/", "description": "Today, we take for granted that germs cause disease, and many people fear them. Yet for centuries, the concept of germs was virtually unknown.", "image": "https://assets.answersingenesis.org/img/cms/content/contentnode/header_image/microbiology.jpg", "image:width": "945", "image:height": "300", "site_name": "Answers in Genesis", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["/creation/", "/bible/", "#fn_1", "#fn_2", "/god/", "/christian/", "/store/sku/10-2-274", "/sin/", "https://answersresearchjournal.org/pasteur-creation-evolution-germs/"], "authors": [], "publish_date": "July 29, 2009, midnight"}