{"result_id": "032040", "URL": "https://answersingenesis.org/kids/fossils/what-is-science/", "timestamp": "2023-04-25 12:06:19 CEST+0200", "meta": {"description": "The kind of science that we normally think of as science (called “operational science”) is a wonderful tool.", "lang": "en", "keywords": "Science", "favicon": "https://assets.answersingenesis.org/art/kids-icons/1810_KidsAnswers_FullLogo_AppIcon_57x57.png", "canonical": "https://answersingenesis.org/kids/fossils/what-is-science/", "encoding": "utf-8"}, "image": null, "domain": "answersingenesis.org", "title": "What Is Science?", "cleaned_text": "The kind of science that we normally think of as science (called “operational science”) is a wonderful tool that helps researchers discover new vaccines, find new kinds of fish in previously-uncharted waters, build more fuel-efficient cars, chart a course to other planets, and devise new treatments for old diseases. With this kind of science, people can uncover fossils or study the composition of rocks.\n\nHowever, operational science has limitations. It can’t, for example, tell us where fish came from, when the rock formed in the first place, or how the bones of the creature came to be fossilized. Operational science deals with the world of today. It involves testing and repeating experiments.\n\nOrigins science deals with the past. Origins or historical science is used to reconstruct events that have happened in the past, using principles such as causality (for every effect, there must be a cause) and analogy (if this is the way it happens today, then perhaps it happened like this in the past). Of course, the best method of reconstruction is to rely on the account of an accurate eyewitness.\n\nNaturalists have no such eyewitness to rely on. However, the Bible provides a written record of an eyewitness to (who was also intimately involved in) history—the Creator God. This eyewitness cannot lie, so His account is completely trustworthy. We can use this written record as our foundation for understanding the world around us. This will help us to understand why the world is the way it is today and to make sense of where we came from and why we’re here.\n\nAs you go through the museum, be sure to look for statements which fall under operational science—e.g., “this fossil was found in Montana”—and statements which fall under origins science—e.g., “this fossil is 65 million years old.”", "opengraph": {"title": "What Is Science?", "url": "https://answersingenesis.org/kids/fossils/what-is-science/", "description": "The kind of science that we normally think of as science (called “operational science”) is a wonderful tool.", "image": "https://assets.answersingenesis.org/img/cms/content/contentnode/header_image/fossils.jpg", "image:width": "945", "image:height": "300", "site_name": "Answers in Genesis", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}