{"result_id": "032023", "URL": "https://answersingenesis.org/hermeneutics/eisegesis/", "timestamp": "2023-04-25 12:05:59 CEST+0200", "meta": {"description": "A deadly virus is sweeping through church members worldwide. I consider this virus to be one of the most dangerous in the world today.", "lang": "en", "keywords": "Historical narrative,Eisegesis", "favicon": "https://assets.answersingenesis.org/img/favicons/apple-touch-icon.png", "canonical": "https://answersingenesis.org/hermeneutics/eisegesis/", "encoding": "utf-8"}, "image": null, "domain": "answersingenesis.org", "title": "Eisegesis", "cleaned_text": "A deadly virus is sweeping through church members worldwide. Investigators have found that the reason this virus is fairly specific to church attendees is that it has found safe harbour in many seminaries and Bible colleges.\n\nIn these institutions, the virus is transmitted to students who eventually pass it on to unsuspecting church members (especially if they become pastors). Although some people are “immune” to the effects of the virus, most are not. The virus has been called “The Eisegesis Virus”, and has been found responsible for the “death” of many church members.\n\nThis report summarizes the nature of this “virus” that does not affect a person’s physical body, but infects their thinking in such a way that people are no longer able to consistently determine absolute truth. I consider this virus to be one of the most dangerous in the world today.\n\nThere is, however, a powerful vaccine that can counteract the eisegesis “virus” and even reverse its destructive effects on thinking. The vaccine, called “exegesis”, is readily available, but sadly is not recognized by most church leaders.\n\nNow I am not referring to a biological virus or a physical vaccine, but to what I could call a “spiritual virus’—a way of thinking that has taken over the minds of many church leaders and most church members. This has caused them to incorrectly interpret God’s Holy Word. This often results in doubt about, or even unbelief in, Biblical doctrines. It has placed a stumbling block before people in the world, one which results in them scoffing at, and not being willing to take seriously, the words of Scripture.\n\nThe antidote is a “spiritual vaccine” that teaches a way to think that enables people to “interpret” God’s Word correctly and believe and understand this special revelation of absolute truth. As a result, people in the world are challenged, and many hearts are changed in regard to their attitude towards God’s Word and the Gospel of Jesus Christ.\n\nThe Random House Webster’s Unabridged Dictionary defines “eisegesis” as: “an interpretation, esp. of Scripture, that expresses the interpreter’s own ideas, bias, or the like, rather than the meaning of the text.”\n\nThus, when someone reads something into Scripture—this would be an example of eisegesis. For instance, nowhere does the Bible ever speak of billions of years. In Genesis 1, the word day (yôm) in context, as used for the six Days of Creation (with a number and the phrase evening and morning), means these days are approximately 24-hour periods—ordinary days.\n\nHowever, probably the majority of church leaders insist these days could represent billions of years—this is “eisegesis”, as the billions of years is a belief from outside of Scripture that is read into Scripture (resulting in the clear words of Scripture being reinterpreted on the basis of these outside ideas).\n\nSadly, this is the “virus” that infects much of the church. Church leaders and thus church members have, by and large, developed a way of thinking that accepts many aspects of what the “world” teaches concerning billions of years, evolution etc., and that reads these ideas into God’s Word.\n\nThe “world” then views the church as not believing God’s Word as written, but as accepting the “world’s” theories as truth and reinterpreting God’s Word to fit. Thus, the “world” does not really have a respect for the Bible and generally does not listen to the message of the Gospel that is preached from this book.\n\nMany church members (and particularly their children and subsequent generations) recognize that if the Bible has to be reinterpreted on the basis of the “world’s” teachings, then the Bible is not absolute truth. When they are taught to use eisegesis in Genesis, they begin to consistently apply this same interpretation method to the rest of the Bible. Ultimately, they stop taking the Bible seriously, and within a generation or two, people begin to reject the Christian faith and stop attending church. Thus, we see the “death” of many church members.\n\nHowever, there is a powerful solution to this situation that can result in saving faith for many, and restoration of confidence for God’s people in God’s Word.\n\nThe Random House Webster’s Unabridged Dictionary defines “exegesis” as: “critical explanation or interpretation of a text or portion of a text, esp. of the Bible.”\n\nThis is often called the “grammatical-historical” interpretation method.\n\nThus, when someone reads the words of Scripture, and interprets them on the basis of context and the type of literature etc., then this would be an example of “exegesis”—reading out of Scripture what the writer clearly intended to express.\n\nIn Genesis 1, the Hebrew word for day (yôm), as used for each of the six Days of Creation, would be looked at in regard to context and the type of literature. Genesis is written in typical Hebrew historical narrative—this is important to understand when interpreting the words of this book. Any reputable Hebrew lexicon (one-way dictionary) will list the different meanings given to a word (like “day”), and the various contexts that determine these meanings.\n\nOne will find that whenever yôm (day) is qualified by a number or the phrase evening and morning, it always means an ordinary day. Thus, critically looking at the text and then reading out of Scripture, one cannot come to any other conclusion except that these days were ordinary (24-hour) days.\n\nWhen church members and their subsequent generations are trained in this method of thinking (interpreting Scripture in context), they have a respect for God’s Word and then judge the “world’s” fallible theories on the basis of what the Word of God clearly states. When they are taught to use exegesis in Genesis, they usually consistently apply this method of interpretation throughout the rest of the Bible. They have a solid faith in absolute truth. Especially when they then see how, starting with the history given in the Bible, they can make better sense of the same evidence which was previously used to undermine the Bible. They are not tossed “to and fro” by the world’s fallible ideas, but by and large stand firm on the authoritative Word.\n\nThe “world” then recognizes that Christians do take God’s Word seriously and believe it as written. As a result, the “world” is often challenged to question its fallible theories and listen to God’s Word—instead of the other way around.\n\nUnderstanding the difference between “eisegesis” and “exegesis” is really the key to the effectiveness of the church in today’s culture.\n\nWhich “Key” Are You Using?\n\nAll of this can be summed up by using the analogy of keys. These two interpretative methods are really two different keys:\n\nThese two keys unlock doors—each of which results in very different consequences when opened. The doors represent words—in this case, the words from the Bible. To illustrate the result of using these different keys, the two doors will represent the Hebrew word for day, yôm.\n\nThis method of interpretation involves making God’s Word the authority and letting its words speak to us—reading out of Scripture. Thus, starting with Genesis, one would take the words of this book as written. Yôm in this context would be taken as exactly what it was meant to convey—an ordinary day.\n\nIf one consistently applies this same method of interpretation throughout the Scriptures, one would have no problem accepting the Virginal Conception and the literal bodily Resurrection of Christ. Such teachings come only from the revelation of Scripture—the words of the Bible taken in context according to the type of literature. This results in believing the words of Scripture, not doubting them, thus providing the basis for the Christian faith.\n\nThis method of interpretation involves taking man’s word (ideas, theories, etc.) from outside the Bible as a basis for reading into Scripture. Thus, starting with Genesis, one would take the words of this book (like the word day—yôm) and interpret them in the light of man’s fallible theories (e.g. billions of years). Even though the words taken as written in context contradict those outside ideas, their meaning must be changed to conform to them. This results in people doubting the Word of God, as it means one can’t trust the words as written.\n\nIf a person then applies this interpretive method consistently throughout Scripture, one would certainly doubt the rest of Genesis (for example, the “world” teaches there never was a global Flood), and ultimately other crucial doctrines (science has never shown a virgin birth in humans, for instance), including the bodily Resurrection of Christ (science has never shown that a man can be raised from the dead). This leads, consistently and logically, to disbelieving the words of Scripture, and thus rejecting the Christian faith that is built on the Bible.\n\nSadly, the church is infected with the eisegesis “virus’—and as a result, the Christian worldview that was once so prevalent in the Western world is waning.\n\nGod’s people need a good dose of the exegesis “vaccine” to restore the foundations of God’s Word that the Christian worldview is built upon.", "opengraph": {"title": "Eisegesis", "url": "https://answersingenesis.org/hermeneutics/eisegesis/", "description": "A deadly virus is sweeping through church members worldwide. I consider this virus to be one of the most dangerous in the world today.", "image": "https://assets.answersingenesis.org/img/cms/content/contentnode/header_image/hermeneutics.jpg", "image:width": "945", "image:height": "300", "site_name": "Answers in Genesis", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["/church/", "/god/", "/gospel/", "/jesus/", "/bible/", "/christian/", "/creation/", "#fn_1"], "authors": [], "publish_date": "June 1, 2002, midnight"}