{"result_id": "032005", "URL": "https://answersingenesis.org/biology/disease/flu-everything-you-need-to-know/", "timestamp": "2023-04-25 12:05:36 CEST+0200", "meta": {"description": "Understanding the flu’s origins will practically aid us in treating the flu virus, so let’s take a look first at what causes the flu.", "lang": "en", "keywords": "Flu virus,Influenza virus,Swine flu,Flu,Genome,Genomes,Illness,Influenza,Origin,Rna,Virus", "favicon": "https://assets.answersingenesis.org/img/favicons/apple-touch-icon.png", "canonical": "https://answersingenesis.org/biology/disease/flu-everything-you-need-to-know/", "encoding": "utf-8"}, "image": null, "domain": "answersingenesis.org", "title": "The Flu: Everything You Need to Know", "cleaned_text": "It’s that time of year: flu season. I hate the flu season because it means I am at risk of catching some illness that will keep me from my everyday activities. People react to flu season in many different ways, from not caring at all to carrying hand sanitizer everywhere they go. Regardless of their reactions, everyone can benefit from some refresher information about the flu and where it came from. Understanding the flu’s origins will practically aid us in treating the flu virus, so let’s first take a look at what causes the flu.\n\nWhat Causes the Flu?\n\nMany people misunderstand what the flu is and what causes it. For example, some people refer to having the stomach flu. However, nothing is actually responsible for causing flu symptoms in the stomach because no virus can survive the acidic conditions. It’s also important to distinguish between the flu and the common cold as two different things. The common cold is not a bodywide illness, but is contained in the head. The flu is a bodywide illness that is caused by a virus called influenza. All influenza viruses have the same kinds of symptoms and are essentially organized the same way.\n\nAll viruses are referred to as obligate intracellular parasites, and influenza is no different. Besides living inside our cells, viruses are also defined by the presence of a nucleic acid (DNA or RNA) and a protein coat. The influenza virus is called an RNA virus because it only contains RNA.1 Influenza viruses are unique not only because of their RNA genomes, but also because they have an interesting arrangement of their genome. The influenza virus genome is organized into eight discrete segments that allow for a variety of gene combinations present in the virus.2 Each virus segment contains a series of genes responsible for producing more virus, just like the chromosomes of our DNA. Some of the more well-known genes on these segments are known as the hemagglutinin gene (abbreviated by the letter H) and the neuraminidase gene (abbreviated by the letter N). These particular genes are relevant because we name the influenza viruses based on what kind of H gene they carry and what kind of N gene they carry. One of the most infamous strains of influenza was the 1918 influenza virus that spanned the globe in less than one year. The name of this particular strain of influenza was H1N1. Ironically, because there are only so many different combinations of the H gene and N gene, we recently saw another H1N1 virus back in 2009.3\n\nInfluenza viruses are known primarily for infecting humans, but they can also infect animals.4 In particular, the 2009 influenza was known as the swine flu because it originally began at a Mexican farm as a pig infection that jumped the species boundary to infect humans.5 It is not uncommon for strains of influenza to switch host organisms from year to year. This switch between hosts often relates to how influenza causes disease each year. Knowing that hosts switch allows us to develop a vaccine.\n\nThe influenza viruses are typical-sized viruses, 100 to 120 nanometers (nm) in diameter.6 Unlike most other viruses, they have an irregular shape that makes them unique. Additionally influenza is unique because of its name: we don’t often refer to the virus itself as influenza. Influenza is, rather, an old-world name to describe the series of symptoms we now recognize as the flu.\n\nWhat Are the Symptoms of the Flu in Adults?\n\nThe primary symptom of the flu is a fever (though not everyone with the flu will have a fever).7 Fever is defined by an elevated body temperature above 100°F.\n\nMost people notice not feeling well before realizing that they have a fever. Fever is an important sign from our body that something is not right and that it needs attention quickly. Associated with a fever are general aches and pains across your entire body, not just one particular location. Other symptoms affecting your entire body include chills, dehydration, fatigue, body aches, and sweating.8 It is not entirely uncommon to have a cough associated with the flu, along with a runny nose.\n\nBut the flu is particularly different from the common cold because the flu affects the entire body, not just the upper respiratory system. Those with the common cold don’t complain of having aches and pains all over their body, but usually only problems in their head region. To that end, we often recognize symptoms affecting our head as what’s called a head cold.\n\nWe are concerned about getting the flu not only because it doesn’t feel good, but also because of the fever associated with it. The fever caused by the flu can last up to 14 days. Whenever we have a fever that lasts consecutive days, we run the risk of compounding issues including (but not limited to) brain trauma, problems maintaining alertness, and possible deafness.9 Fever is a great design in our body to let us know that something wrong has entered our system and to alert us to seek medical treatment.10 When we begin running a fever around this time of year, it is usually a good indicator that we’re sick, possibly with the flu. We are concerned about the fever with the flu because, though most people are capable of fighting off the infection, people die from the flu each year, chiefly children, elderly people, and pregnant women. No one really dies from the flu just because they have a runny nose or a cough, but because the virus ravages the entire body and causes such a high fever.\n\nHow Does the Virus Spread?\n\nThe flu is extremely efficient at spreading in the human population. It is primarily transmitted from person-to-person by respiratory droplets. One respiratory droplet is infectious from up to six feet away.11 The closer you are to someone infected with the flu, the greater your chance of getting sick. Certainly, there are also examples of the flu being transmitted by coming in direct contact with someone who has the flu, for example, by shaking hands.\n\nAs it turns out, our hands are another common way that we transmit the flu. We touch our face often or wipe our nose and that’s how the virus gets from our hands to our face and vice versa. Once the virus reaches our face, it’s not long until we actually get sick with the flu and experience full-blown symptoms. Then while we’re sick, we touch someone or some object and transfer the flu virus to another person or object. For up to 24 hours, we can be infected with the flu without showing symptoms.12 During that incubation period, we can infect a number of people and objects during our normal daily routines.\n\nWhile we are infectious, common objects that we touch include door handles, stair rails, and elevator buttons. As a result, we transfer the flu virus and make others sick. That is the primary reason those infected with the flu are told to stay home away from people while they are sick. Whenever we go out in public, we tend not to pay close attention to everything we come in contact with, so we can inadvertently be spreading or contracting the flu virus. One simple solution is to wash our hands whenever we’re out in public during flu season to minimize the amount of flu virus that we come in contact with.\n\nThe reason that the flu goes around each year is largely because humans move indoors when the weather becomes colder. As we’re indoors for the colder weather, we come in contact with more people and the things that more people touch.\n\nThe elderly, infants, and pregnant women are at an increased risk of developing the flu and experiencing some of the more drastic complications that can even lead to death because these people already have a weakened immune system. There is no known cure for the flu, so we can pray for those individuals that are in a high-risk category and be responsible when we’re around them.\n\nSince there is no known cure, we often let the flu run its course. Technically, there is a small window of time from when you begin showing flu symptoms that you can get an antiviral medication that treats early symptoms of the flu, but taking it does not provide you a complete cure—it only lessens the duration and severity of symptoms.13 Whenever anyone gets sick with the flu, we can only recommend that people continue consuming fluids and get their rest. Even though there’s no cure for the flu virus, there is something that you can do to prevent getting it in the first place.\n\nDo You Really Need a Flu Shot?\n\nPerhaps the best weapon we have available against the flu is the flu vaccine. There is a significant controversy surrounding the effectiveness of the flu vaccine because it doesn’t always work well each year. To understand why the flu vaccine doesn’t work as well each year, it is important to understand a little about how the flu vaccine is developed and how the virus is organized.\n\nThe flu vaccine is developed against what are thought to be immunogenic proteins that cause a massive immune response in us. If our body can mount an immune response to the flu that is going around each year, then our body learns what to look for before being exposed to the actual virus. Our immune system is wonderfully designed with immunogenic memory and can be prepared to attack the flu virus quickly when it comes. Part of the reason the flu vaccine is ineffective, though, has nothing to do with vaccines being bad overall or because scientists and doctors are incompetent.\n\nOne reason the flu vaccine does not work is because of how the vaccine is developed in the first place. Each year, the flu goes through the human and animal populations. We have found that the flu often goes through farm animals one year and through the human population the following year. This makes sense since humans have a close association with farm animals. Immunologists will often go to the animal population for a given year to develop a vaccine for the following year. This method works most of the time. However, developing the flu vaccine based on what goes through some farm animals in a given year doesn’t always work because it assumes that scientists sampled the right animals and an adequate number of them.\n\nThe other reason that the flu vaccine doesn’t work is that the flu virus can mutate from year to year. To understand how the flu mutates from year to year, we must understand a little bit of virus structure and function. The fact that influenza viruses have RNA for genetic material is significant because RNA is inherently less stable than DNA. Not only is RNA less stable, but the enzymes responsible for replicating the virus are also less accurate for RNA compared to DNA. Notably, the RNA-dependent RNA polymerase enzyme lacks proofreading activity that is present in DNA polymerase. As a result, there is no proofreading activity in the viral RNA-dependent RNA polymerase to catch mutations that creep into the genome. Thus, the flu genome tends to accumulate mutations because it cannot catch them and fix them before the virus is fully made.\n\nAnother problem is that during replication, the RNA polymerase responsible for replicating the RNA genome has eight separate RNA segments it must replicate. The RNA polymerase must jump from strand to strand for faithful replication of the genome. However, there are instances when the RNA polymerase jumps between strands of the RNA genome for the flu virus and causes what is known as a recombination event (i.e., a type of mutation to the genome). A recombination event that occurs between two segments of RNA generates new combinations of genes. In some ways, the recombination that occurs within the flu genome is similar to a mutation in that it increases the variation found within the flu. These new recombinant forms of the flu virus often arise because a single animal is infected with more than one strain of flu at a time. When these flu viruses replicate within the same cell, the recombination event happens and a new version of the flu virus is born.14\n\nScientists recognize that mutations happen within the flu virus and refer to this phenomenon as antigenic variation. Antigenic variation is the process whereby the flu virus changes its RNA from year-to-year. The process of antigenic variation makes it difficult for scientists to guess what is going to be in the human population each year. Antigenic variation is also responsible for making the virus as effective at making us sick each year. Antigenic variation will render a vaccine from one year ineffective the next year—or even worse. Sometimes antigenic variation can occur during a given flu season and that change will prevent the vaccine from working.\n\nThe flu virus can also change because of recombination events happening within a given host, also known as antigenic drift. Antigenic drift is a significant source of variation within the flu population from year to year. When the drift occurs, there is no way of knowing which direction the drift will go or what the result will be. So we are helpless in the design of a flu vaccine because of the drift that can occur. But just because the drift can occur doesn’t mean that it will occur. Thus, we still make flu vaccines, which work most of the time.\n\nThese kinds of change (i.e., antigenic variation and antigenic drift) are not sufficient to cause a brand-new virus to evolve, but just bring a new strain of the flu virus into existence—the same flu virus, but with a twist. The twist of the new genome is a form of adaptation that explains why there is variation within this created kind. Viruses like influenza have the unique ability to adapt to selective pressures and change within an observable amount of time. This kind of change during an observable amount of time is testable by observational science, which is completely different from the so-called historical science of evolution. Evolution requires these kinds of changes to occur on a much grander scale than can be observed. The fact that organisms such as viruses can change is simply an aspect of the design they received from their very creation—they were designed to adapt! So we cannot use the changes of influenza types as evidence of changes between kinds because it remains the flu virus at the end of the day. At best, the changes within influenza remind us of just how much change can be tolerated within a given kind.\n\nWhere Did the Flu Come from?\n\nOne of the biggest issues with trying to figure out where any virus comes from deals with the very nature of how viruses are put together. Viruses are made up of a nucleic acid and a protein coat. While the protein coat does not really reveal the information on the virus’ origin, there can be clues left behind in viral DNA or RNA. However, there are certain viruses whose DNA or RNA does not give very many clues as to their origin, such as the flu viruses. Many RNA viruses can be found lying dormant in the genomes of other organisms, but this is not the case for the flu.15 We think that the flu is something that once was inside the genome of another organism because we know that is how most other viruses originated. No one can say with certainty, however, to know that the flu virus began in another genome because it has not been found in another genome yet. Ultimately, we are making an argument based on what we know of other viruses and applying those principles to what we know about influenza.\n\nWith all that being said, one of the things that we do know about influenza is that it is capable of infecting a rather wide range of organisms. The influenza family of viruses is known to infect at least swine, birds, and humans. Perhaps the fact that it can infect these other organisms is a clue to its origin.\n\nThe flu changes each year within the human population; however, it is not as big of a change as some assume. People like Bill Nye and any number of textbooks have argued that changes within the flu virus are great examples of evolution happening today.16 What they mean to say is that they believe the flu virus is a great example of how small changes lead to the evolution of every living thing from chemicals. Selection is the observable process whereby small changes accumulate within an organism over time. Because the flu virus certainly changes each year because of mutations, it is a great example of how small change happens. However, these “microevolutionary” changes do not lead to “macroevolutionary” changes, such as the unobservable process whereby one organism changes into another organism over long periods of time. Changes within the flu virus are not sufficient to change it from the flu into any other organism. In fact, researchers have calculated that, because there are only so many possible mutations within the flu genome, we have observed every known mutation to date.17\n\nInfluenza is a complex virus because it is an RNA genome and jumps from one host to another. However, just because the flu is capable of small and frequent change does not mean that those changes lead to any kind of large-scale change that supports evolutionary theory. The flu is a primary example of what forces are at work within nature and just where the limits of natural selection can go. With so many mutational changes within the flu genome, it should have gone extinct by now—but it has not.18 Though it is difficult to determine just why the flu has not gone into extinction, it is certainly successful each year at making thousands of people sick.\n\nBecause the flu kills people each year, we are forced to face our mortality sooner rather than later. Something as simple as the flu reminds us each year that our days are numbered and that we all will face the judgment. Regardless of whether we get the flu shot each year, we need to be ready to face our Creator and share love, compassion, and the gospel with those who are suffering.", "opengraph": {"title": "The Flu: Everything You Need to Know", "url": "https://answersingenesis.org/biology/disease/flu-everything-you-need-to-know/", "description": "Understanding the flu’s origins will practically aid us in treating the flu virus, so let’s take a look first at what causes the flu.", "image": "https://assets.answersingenesis.org/img/cms/content/contentnode/og_image/the-flu-everything-you-need-to-know.jpg", "image:width": "1200", "image:height": "628", "site_name": "Answers in Genesis", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["#fn_1", "#fn_2", "#fn_3", "#fn_4", "#fn_5", "#fn_6", "#fn_7", "#fn_8", "#fn_9", "#fn_10", "#fn_11", "#fn_12", "#fn_13", "#fn_14", "/creation-science/baraminology/", "#fn_15", "#fn_16", "#fn_17", "#fn_18", "/good-news/"], "authors": [], "publish_date": "Nov. 22, 2017, 6 a.m."}