{"result_id": "033038", "URL": "https://anti-empire.com/15-percent-of-germans-report-severe-side-effects-after-mrna-treatments/", "timestamp": "2023-04-25 12:06:55 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://anti-empire.com/wp-content/uploads/2016/11/favifavi.jpg", "canonical": "https://anti-empire.com/15-percent-of-germans-report-severe-side-effects-after-mrna-treatments/", "encoding": "UTF-8"}, "image": null, "domain": "anti-empire.com", "title": "15 Percent of Germans Report Severe Side Effects After mRNA Treatments", "cleaned_text": "Survey show how common serious vaccine side effects really are\n\nThe German journalist Boris Reitschuster did what really should have been the task of the health authorities and big media. The question is, of course, how common are serious side effects from the vaccinations? Chancellor Olaf Scholz said in his New Year’s speech that “almost four billion people around the world have now been vaccinated. Without major side effects». Although it is of course known that serious side effects do occur, it is very subjective whether you consider the number as “high” or “low”.\n\nMany doubt the official figures. At the same time, a large number of doctors say that many side effects that are at least related in time to the vaccination have not even been registered, because it is too time-consuming and the doctors do not get paid for the work.\n\nBecause the large media corporations seem to avoid the question, Reitschuster commissioned a representative poll on the subject from a reputable polling institute. INSA asked 1004 adults in Germany if they had been vaccinated and if they had any side effects. The result is that the official narrative – “hardly any side effects” – collapses and confirms exactly what many medical professionals report from their own experience.\n\nIn order to collect the data accurately, INSA first had to ask the following questions: “Have you been vaccinated against the coronavirus?” According to impfdashboard.de, 57.60 million of the 69.4 million adults in Germany have been vaccinated. This corresponds to a vaccination rate of around 83 percent. This is exactly the result of the INSA survey:\n\n60 percent have booster vaccination, 23 percent have two doses without booster vaccination. Another four percent answered that they have been partially vaccinated. 12 percent state that they have not been vaccinated – extrapolated to the population, that is to say 11.8 million people,\n\nVoters from the right-wing party AfD state far more often than voters from other parties that as of today they have not received any vaccination against corona (44 percent). Green voters are the most vaccinated (96 percent), which is also remarkable, because this party is one of the strongest opponents of genetic engineering, and a large proportion of the new vaccines are based on such genetic technology.\n\nThere is also an east-west divide. Respondents from the former East Germany state more often than respondents from the Western parts that they have not been vaccinated against the coronavirus (19 vs 10 percent).\n\nAnd now to the main result of the survey: 15 percent of the respondents stated that they suffered from severe/heavy side effects; Extrapolated to the 57.60 million vaccinated, it is 8.64 million victims. Although the “severity” of the side effects is definitely subjective – the official narrative, where there are hardly any serious side effects, has been shattered according to the results of this study.\n\nAnd the number corresponds exactly to what many doctors say. A general practitioner Reitschuster asked, confirming that this exactly matches the figures from her practice – although she assumes more than 20 percent cases of serious side effects: “In my experience, young healthy people are prone to side effects, severe headaches, swelling in lymph nodes, fever. And also some thrombosis and pulmonary embolism in the elderly, although this is difficult to prove. Overall, the rate of heart attacks has increased. “\n\nDr. Gunter Frank comments on the results of the study: “In the 30 years I have been a doctor, I have only rarely experienced red injection sites after an ordinarily approved vaccination, or very rarely a fever that lasts for several days (somewhat more frequently after the swine flu vaccine Pandemrix), and once a rheumatic attack probably related to the vaccination. That’s it, after 30 years. And now this: 15 percent severe side effects after covid vaccination. Just like me and many of my colleagues have experienced for several months.”\n\nThe number who report serious side effects is particularly explosive, also in view of the excess mortality that has increased dramatically for several months and cannot be explained by corona deaths.\n\nOnly 40 percent of those vaccinated, less than half, state that they have not felt any side effects at all.\n\nThose over 40 years and over were more likely to have no side effects at all than younger respondents with at least one corona vaccination.\n\nMale respondents with at least one corona vaccination state significantly more often than female respondents that they have not experienced any side effects (48 versus 33 per cent). Female respondents, on the other hand, report mild side effects more often than men (51 versus 39 percent).\n\nExtrapolated to the whole world, it would also mean that with 4 billion vaccinated, there are 600 million people who catagorize themselves with serious side effects.", "opengraph": {"title": "15 Percent of Germans Report Severe Side Effects After mRNA Treatments", "description": "Survey show how common serious vaccine side effects really are\r\n\r\nThe German journalist Boris Reitschuster did what really should have been the task of the health authorities and big media. The question is, of course, how common are serious side effects from the vaccinations? Chancellor Olaf Scholz", "url": "https://anti-empire.com/15-percent-of-germans-report-severe-side-effects-after-mrna-treatments/", "image": "https://anti-empire.com/wp-content/uploads/2022/01/JVeaItaN.jpg", "image:width": "525", "image:height": "379", "image:type": "image/jpeg", "type": "article", "article:published_time": "2022-01-20T07:16:31+01:00", "article:modified_time": "2022-01-20T07:16:31+01:00", "locale": "en_US", "site_name": "Anti-Empire", "article:section": "Society", "image:secure_url": "https://anti-empire.com/wp-content/uploads/2022/01/JVeaItaN.jpg", "updated_time": "2022-01-20T07:16:31+01:00", "article:publisher": "https://www.facebook.com/CheckpointAsia/"}, "tags": [], "tweets": [], "movies": [], "links": ["https://reitschuster.de/post/exklusiv-umfrage-zeigt-wie-haeufig-starke-impfnebenwirkungen-wirklich-sind/", "https://impfdashboard.de/", "https://www.bitchute.com/video/GesdwrMev2YL/"], "authors": ["Field Empty"], "publish_date": "2022-01-20T07:16:31+01:00"}