{"result_id": "033023", "URL": "https://anti-empire.com/germany-discovers-ukrainian-refugees-are-uninterested-in-vaccination-and-wary-of-the-vaccinators/", "timestamp": "2023-04-25 12:06:43 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://anti-empire.com/wp-content/uploads/2016/11/favifavi.jpg", "canonical": "https://anti-empire.com/germany-discovers-ukrainian-refugees-are-uninterested-in-vaccination-and-wary-of-the-vaccinators/", "encoding": "UTF-8"}, "image": null, "domain": "anti-empire.com", "title": "Germany Discovers Ukrainian Refugees Are Uninterested in Vaccination, and Wary of the Vaccinators", "cleaned_text": "Editor’s note: Ukraine’s vaccination rate is even lower than Russia’s. Good people.\n\nOnly about a third of Ukrainians have been vaccinated against Corona, in part with vaccines that are unapproved in the EU. The low vaccination rate could cause problems in the refugee centres. The city of Nürnberg, for example, has set up three gymnasiums to accommodate 600 people, where many must share a small space. … Anyone who wants to can receive a vaccination a few hundred metres away … free of charge for Ukrainian refugees. “Unfortunately, we’re finding that the refugees aren’t exactly snatching the vaccines out of our hands,” says Nürnberg Mayor Marcus König. “Many new arrivals are very worried about ‘forced vaccinations’,” adds Thomas Jung, Mayor of Fürth. He says you have to approach the topic with sensitivity. …\n\nIt’s been months of overt coercion to accept vaccination from politicians and the press here in the Federal Republic of Germany. Months of social exclusion and jeopardised careers and all the rest of it. Nobody has given the slightest thought to “sensitivity.” Why are they now at pains to accommodate the feelings of Ukrainians?\n\nJung explains that city officials pressed a Ukrainian doctor into service, to begin delicately preaching the Gospel of Vaccination to refugees last Friday. It’s rare, because the West is so totalising, but every now and then you get an idea of what it must be like to look into this funhouse from the outside. You flee a war-zone and end up sleeping on the floor of some repurposed gym, while the locals scheme madly about how to inject you with their latest mRNA tech.\n\nDear Ukrainians: You’re entirely right to be terrified of forced vaccination. We are too.", "opengraph": {"title": "Germany Discovers Ukrainian Refugees Are Uninterested in Vaccination, and Wary of the Vaccinators", "description": "“Unfortunately, we’re finding that the refugees aren’t exactly snatching the vaccines out of our hands”", "url": "https://anti-empire.com/germany-discovers-ukrainian-refugees-are-uninterested-in-vaccination-and-wary-of-the-vaccinators/", "image": "https://anti-empire.com/wp-content/uploads/2022/03/06574456-750x454.jpg", "image:width": "793", "image:height": "480", "image:type": "image/jpeg", "type": "article", "article:published_time": "2022-03-22T10:17:48+01:00", "article:modified_time": "2022-03-22T10:17:48+01:00", "article:tag": "The Vaccine Taliban", "locale": "en_US", "site_name": "Anti-Empire", "article:section": "Politics", "image:secure_url": "https://anti-empire.com/wp-content/uploads/2022/03/06574456.jpg", "updated_time": "2022-03-22T10:17:48+01:00", "article:publisher": "https://www.facebook.com/CheckpointAsia/"}, "tags": ["The Vaccine Taliban"], "tweets": [], "movies": [], "links": ["https://substack.com/profile/15736836-eugyppius", "https://www.br.de/nachrichten/bayern/ukrainische-gefluechtete-und-corona-angst-vor-zwangsimpfung,T0LVb1A"], "authors": ["Field Empty"], "publish_date": "2022-03-22T10:17:48+01:00"}