{"result_id": "033013", "URL": "https://anti-empire.com/what-is-the-chance-of-a-severe-adverse-reaction-from-3-boosters-every-year-for-40-years/", "timestamp": "2023-04-25 12:06:35 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://anti-empire.com/wp-content/uploads/2016/11/favifavi.jpg", "canonical": "https://anti-empire.com/what-is-the-chance-of-a-severe-adverse-reaction-from-3-boosters-every-year-for-40-years/", "encoding": "UTF-8"}, "image": null, "domain": "anti-empire.com", "title": "What Is the Chance of a Severe Adverse Reaction From 3 Boosters Every Year for 40 Years?", "cleaned_text": "What Is the Chance of a Severe Adverse Reaction From 3 Boosters Every Year for 40 Years?\n\nBad news from Israel which led the world in vaccinations (and vaccine passports). The vaccinated there are testing positive for COVID at the same rate as is their proportion of the population. They are also dying and being hospitalized at nearly the same rate as their proportion of the population.\n\nTheir researchers have sifted through data and determined the vaccine appears to have protective qualities against COVID but loses them rapidly.\n\nThe benefit compared to the unvaccinated is 95 percent two weeks after the second dose, falls to 75 percent after 3 months, and to just 16 percent after 6 months. This would also suggest that after 7 months the benefit drops to nothing.\n\nThis means that to keep efficacy at over a measly 50 percent the vaccinated would need to get a booster every 4 months or three times a year.\n\nNow, Israel vaccinated overwhelmingly with Pfizer. It is possible that the picture for other injections is not as abysmal. It is also possible that vaccine makers will improve the recipe over time, or that after enough boosters a more permanent immunity will be achieved.\n\nBut we don’t know that.\n\nAt the present, the possibility that a permanent 50+ percent “immunity” from COVID will require a “booster” shot every 4 months is a possibility.\n\nIf so, seeing just how prone to moving the goalpost the virus freaks are they certainly are going to try and make thrice-yearly “vaccination” a new cultural and legal reality. (I say vaccination in citation marks because inoculation is by definition something that ought to grant long-lasting and rather strong immunity. On evidence Pfizer doesn’t qualify.)\n\nWe keep being told that vaccines are “safe”. I’m sure they are. What is also “safe” is driving a motorcycle 260 km/h. Only a tiny fraction of such rides result in a crash. The point isn’t that the injection is guaranteed death, but what is the risk, to what extent is the risk knowable, and what is the benefit?\n\nIf life-long immunity doesn’t take 2 doses, but three doses EVERY YEAR, then the upside per dose is rather less. If this immunity requires constant boosters, eg 120 in 40 years, then the total risk is also far, far higher.\n\nSeriously. Who in their right mind is going to take 120 doses? What kind of wild mess is that going to inflict on your immune system?\n\nAnd by the same token, who in their right mind — that is not in a grave risk group — ought to take 1 dose for 3 months of very partial protection from a flu germ?\n\nAll the more so since even the CDC estimated that around 40% of the population has already had COVID by April, and therefore already had much stronger, and far longer-lasting natural immunity.\n\nOne-half of the people getting the injection are taking on an unknowable risk for absolutely nothing, and much of the rest are doing it for nearly nothing.\n\nAnd even that is “okay”. But when you start to make the calculation of unknowable risk for (next-to-)zero upside obligatory for others we’re starting to have a problem.", "opengraph": {"title": "What Is the Chance of a Severe Adverse Reaction From 3 Boosters Every Year for 40 Years?", "description": "At which point does it make sense to just get COVID, and natural immunity, instead?", "url": "https://anti-empire.com/what-is-the-chance-of-a-severe-adverse-reaction-from-3-boosters-every-year-for-40-years/", "image": "https://anti-empire.com/wp-content/uploads/2021/07/134995740_445000776909371_3344859327730487499_n.jpg", "image:width": "581", "image:height": "430", "image:type": "image/jpeg", "type": "article", "article:published_time": "2021-07-28T17:57:18+02:00", "article:modified_time": "2021-07-28T18:35:12+02:00", "locale": "en_US", "site_name": "Anti-Empire", "article:section": "Politics", "image:secure_url": "https://anti-empire.com/wp-content/uploads/2021/07/134995740_445000776909371_3344859327730487499_n.jpg", "updated_time": "2021-07-28T18:35:12+02:00", "article:publisher": "https://www.facebook.com/CheckpointAsia/"}, "tags": [], "tweets": [], "movies": [], "links": ["https://anti-empire.com/57-of-israelis-are-fully-vaccinated-they-contribute-55-of-the-newly-infected/", "https://anti-empire.com/israeli-data-suggests-protection-from-vaccines-drops-down-to-nothing-after-just-6-months-just-16-benefit/", "https://twitter.com/BenMarten/status/1419697737310740480", "https://twitter.com/BenMarten/status/1419697737310740480", "https://anti-empire.com/according-to-cdcs-estimate-42-percent-of-k12-aged-children-already-had-the-infection-are-immune/"], "authors": ["Field Empty"], "publish_date": "2021-07-28T17:57:18+02:00"}