{"result_id": "033007", "URL": "https://anti-empire.com/wait-what-how-does-this-abysmal-shambolic-data-justify-the-approval-of-the-pfizer-vaccine/", "timestamp": "2023-04-25 12:06:30 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://anti-empire.com/wp-content/uploads/2016/11/favifavi.jpg", "canonical": "https://anti-empire.com/wait-what-how-does-this-abysmal-shambolic-data-justify-the-approval-of-the-pfizer-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "anti-empire.com", "title": "Wait, What? How Does This Abysmal, Shambolic Data Justify the Approval of the Pfizer Vaccine?", "cleaned_text": "Wait, What? How Does This Abysmal, Shambolic Data Justify the Approval of the Pfizer Vaccine?\n• “…the FDA’s expectation is of “at least 50%” efficacy for any approvable vaccine.”\n• “…it is notable that evidence of waning immunity was already visible in the data by the 13 March 2021 data cut-off.”\n• “But although this additional information was available to Pfizer in April, it was not published until the end of July.”\n• “Until new clinical trials demonstrate that boosters increase efficacy above 50%, without increasing serious adverse events, it is unclear whether the 2-dose series would even meet the FDA’s approval standard at six or nine months.”\n• “So despite this preprint appearing a year after the trial began, it provides no data on vaccine efficacy past six months”\n• “It is hard to imagine that the <10% of trial participants who remained blinded at six months (which presumably further dwindled after 13 March 2021) could constitute a reliable or valid sample to produce further findings”\n• “…no reported data past 13 March 2021, unclear efficacy after six months due to unblinding, evidence of waning protection irrespective of the Delta variant, and limited reporting of safety data”\n\nOn 28 July 2021, Pfizer and BioNTech posted updated results for their ongoing phase 3 covid-19 vaccine trial. The preprint came almost a year to the day after the historical trial commenced, and nearly four months since the companies announced vaccine efficacy estimates “up to six months.”\n\nBut you won’t find 10 month follow-up data here. While the preprint is new, the results it contains aren’t particularly up to date. In fact, the paper is based on the same data cut-off date (13 March 2021) as the 1 April press release, and its topline efficacy result is identical: 91.3% (95% CI 89.0 to 93.2) vaccine efficacy against symptomatic covid-19 through “up to six months of follow-up.”\n\nThe 20-page preprint matters because it represents the most detailed public account of the pivotal trial data Pfizer submittedin pursuit of the world’s first “full approval” of a coronavirus vaccine from the Food and Drug Administration. It deserves careful scrutiny.\n\nSince late last year, we’ve heard that Pfizer and Moderna’s vaccines are “95% effective” with even greater efficacy against severe disease (“100% effective,” Moderna said).\n\nWhatever one thinks about the “95% effective” claims (my thoughts are here), even the most enthusiastic commentators have acknowledged that measuring vaccine efficacy two months after dosing says little about just how long vaccine-induced immunity will last. “We’re going to be looking very intently at the durability of protection,” Pfizer senior vice president William Gruber, an author on the recent preprint, told the FDA’s advisory committee last December.\n\nThe concern, of course, was decreased efficacy over time. “Waning immunity” is a known problem for influenza vaccines, with some studies showing near zero effectiveness after just three months, meaning a vaccine taken early may ultimately provide no protection by the time “flu season” arrives some months later. If vaccine efficacy wanes over time, the crucial question becomes what level of effectiveness will the vaccine provide when a person is actually exposed to the virus? Unlike covid vaccines, influenza vaccine performance has always been judged over a full season, not a couple months.\n\nAnd so the recent reports from Israel’s Ministry of Health caught my eye. In early July, they reported that efficacy against infection and symptomatic disease “fell to 64%.” By late July it had fallen to 39% where Delta is the dominant strain. This is very low. For context, the FDA’s expectation is of “at least 50%” efficacy for any approvable vaccine.\n\nNow Israel, which almost exclusively used Pfizer vaccine, has begun administering a third “booster” dose to all adults over 40. And starting 20 September 2021, the US plans to follow suit for all “fully vaccinated” adults eight months past their second dose.\n\nDelta may not be responsible\n\nEnter Pfizer’s preprint. As an RCT reporting “up to six months of follow-up,” it is notable that evidence of waning immunity was already visible in the data by the 13 March 2021 data cut-off.\n\n“From its peak post-dose 2,” the study authors write, “observed VE [vaccine efficacy] declined.” From 96% to 90% (from two months to <4 months), then to 84% (95% CI 75 to 90) “from four months to the data cut-off,” which, by my calculation (see footnote at the end of the piece), was about one month later.\n\nBut although this additional information was available to Pfizer in April, it was not published until the end of July.\n\nAnd it’s hard to imagine how the Delta variant could play a real role here, for 77% of trial participants were from the United States, where Delta was not established until months after data cut-off.\n\nWaning efficacy has the potential to be far more than a minor inconvenience; it can dramatically change the risk-benefit calculus. And whatever its cause—intrinsic properties of the vaccine, the circulation of new variants, some combination of the two, or something else—the bottom line is that vaccines need to be effective.\n\nUntil new clinical trials demonstrate that boosters increase efficacy above 50%, without increasing serious adverse events, it is unclear whether the 2-dose series would even meet the FDA’s approval standard at six or nine months.\n\nThe “six month” preprint based on the 7% of trial participants who remained blinded at six months\n\nThe final efficacy timepoint reported in Pfizer’s preprint is “from four months to the data cut-off.” The confidence interval here is wider than earlier time points because only half of trial participants (53%) made it to the four month mark, and mean follow-up is around 4.4 months (see footnote).\n\nThis all happened because starting last December, Pfizer allowed all trial participants to be formally unblinded, and placebo recipients to get vaccinated. By 13 March 2021 (data cut-off), 93% of trial participants (41,128 of 44,060; Fig 1) were unblinded, officially entering “open-label followup.” (Ditto for Moderna: by mid April, 98% of placebo recipients had been vaccinated.)\n\nDespite the reference to “six month safety and efficacy” in the preprint’s title, the paper only reports on vaccine efficacy “up to six months,” but not from six months. This is not semantics, as it turns out only 7% of trial participants actually reached six months of blinded follow-up (“8% of BNT162b2 recipients and 6% of placebo recipients had ≥6 months follow-up post-dose 2.”) So despite this preprint appearing a year after the trial began, it provides no data on vaccine efficacy past six months, which is the period Israel says vaccine efficacy has dropped to 39%.\n\nIt is hard to imagine that the <10% of trial participants who remained blinded at six months (which presumably further dwindled after 13 March 2021) could constitute a reliable or valid sample to produce further findings. And the preprint does not report any demographic comparisons to justify future analyses.\n\nWith the US awash in news about rising cases of the Delta variant, including among the “fully vaccinated,” the vaccine’s efficacy profile is in question. But some medical commentators are delivering an upbeat message. Former FDA commissioner Scott Gottlieb, who is on Pfizer’s board, said: “Remember, the original premise behind these vaccines were [sic] that they would substantially reduce the risk of death and severe disease and hospitalization. And that was the data that came out of the initial clinical trials.”\n\nYet, the trials were not designed to study severe disease. In the data that supported Pfizer’s EUA, the company itself characterized the “severe covid-19” endpoint results as “preliminary evidence.” Hospital admission numbers were not reported, and zero covid-19 deaths occurred.\n\nIn the preprint, high efficacy against “severe covid-19” is reported based on all follow-up time (one event in the vaccinated group vs 30 in placebo), but the number of hospital admissions is not reported so we don’t know which, if any, of these patients were ill enough to require hospital treatment. (In Moderna’s trial, data last year showed that 21 of 30 “severe covid-19” cases were not admitted to hospital; Table S14).\n\nAnd on preventing death from covid-19, there are too few data to draw conclusions—a total of three covid-19 related deaths (one on vaccine, two on placebo). There were 29 total deaths during blinded follow-up (15 in the vaccine arm; 14 in placebo).\n\nThe crucial question, however, is whether the waning efficacy seen in the primary endpoint data also applies to the vaccine’s efficacy against severe disease. Unfortunately, Pfizer’s new preprint does not report the results in a way that allows for evaluating this question.\n\nApproval imminent without data transparency, or even an advisory committee meeting?\n\nLast December, with limited data, the FDA granted Pfizer’s vaccine an EUA, enabling access to all Americans who wanted one. It sent a clear message that the FDA could both address the enormous demand for vaccines without compromising on the science. A “full approval” could remain a high bar.\n\nBut here we are, with FDA reportedly on the verge of granting a marketing license 13 months into the still ongoing, two year pivotal trial, with no reported data past 13 March 2021, unclear efficacy after six months due to unblinding, evidence of waning protection irrespective of the Delta variant, and limited reporting of safety data. (The preprint reports “decreased appetite, lethargy, asthenia, malaise, night sweats, and hyperhidrosis were new adverse events attributable to BNT162b2 not previously identified in earlier reports,” but provides no data tables showing the frequency of these, or other, adverse events.)\n\nIt’s not helping matters that FDA now says it won’t convene its advisory committee to discuss the data ahead of approving Pfizer’s vaccine. (Last August, to address vaccine hesitancy, the agency had “committed to use an advisory committee composed of independent experts to ensure deliberations about authorization or licensure are transparent for the public.”)\n\nPrior to the preprint, my view, along with a group of around 30 clinicians, scientists, and patient advocates, was that there were simply too many open questions about all covid-19 vaccines to support approving any this year. The preprint has, unfortunately, addressed very few of those open questions, and has raised some new ones.\n\nI reiterate our call: “slow down and get the science right—there is no legitimate reason to hurry to grant a license to a coronavirus vaccine.”\n\nFDA should be demanding that the companies complete the two year follow-up, as originally planned (even without a placebo group, much can still be learned about safety). They should demand adequate, controlled studies using patient outcomes in the now substantial population of people who have recovered from covid. And regulators should bolster public trust by helping ensure that everyone can access the underlying data.\n\nCompeting interests: I helped organize the Coalition Advocating for Adequately Licensed Medicines (CAALM), which has formally petitioned the FDA to refrain from fully approving any covid-19 vaccine this year (docket FDA-2021-P-0786). A full list of competing interests is available here.\n\nFootnote: Calculations in this article are as follows. “About 1 month” past month 4 is based on the final row of Fig 2 in the preprint: 1030/12670*12 = 0.98 months (vaccine group) and 895/11802*12 = 0.91 months (placebo group). “53%” is based on Fig 2: (12670+11802)/(23040+23037). “4.4 months” is based on the average of 8412/22505*12 = 4.5 (vaccine) and 8124/22434*12 = 4.3 (placebo) in Fig 2.", "opengraph": {"title": "Wait, What? How Does This Abysmal, Shambolic Data Justify the Approval of the Pfizer Vaccine?", "description": "I reiterate our call: “slow down and get the science right\"", "url": "https://anti-empire.com/wait-what-how-does-this-abysmal-shambolic-data-justify-the-approval-of-the-pfizer-vaccine/", "image": "https://anti-empire.com/wp-content/uploads/2021/08/woman-medical-face-mask-768x512-1-750x500.jpg", "image:width": "768", "image:height": "512", "image:type": "image/jpeg", "type": "article", "article:published_time": "2021-08-25T21:27:25+02:00", "article:modified_time": "2021-08-28T11:24:54+02:00", "locale": "en_US", "site_name": "Anti-Empire", "article:section": "Society", "image:secure_url": "https://anti-empire.com/wp-content/uploads/2021/08/woman-medical-face-mask-768x512-1.jpg", "updated_time": "2021-08-28T11:24:54+02:00", "article:publisher": "https://www.facebook.com/CheckpointAsia/"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.fda.gov/media/139638/download", "https://doi.org/10.1101/2021.07.28.21261159", "https://investors.pfizer.com/investor-news/press-release-details/2021/Pfizer-and-BioNTech-Confirm-High-Efficacy-and-No-Serious-Safety-Concerns-Through-Up-to-Six-Months-Following-Second-Dose-in-Updated-Topline-Analysis-of-Landmark-COVID-19-Vaccine-Study/default.aspx", "https://investors.pfizer.com/investor-news/press-release-details/2021/Pfizer-and-BioNTech-Confirm-High-Efficacy-and-No-Serious-Safety-Concerns-Through-Up-to-Six-Months-Following-Second-Dose-in-Updated-Topline-Analysis-of-Landmark-COVID-19-Vaccine-Study/default.aspx", "https://investors.pfizer.com/investor-news/press-release-details/2021/Pfizer-and-BioNTech-Initiate-Rolling-Submission-of-Biologics-License-Application-for-U.S.-FDA-Approval-of-Their-COVID-19-Vaccine/default.aspx", "https://investors.modernatx.com/news-releases/news-release-details/moderna-announces-primary-efficacy-analysis-phase-3-cove-study", "https://blogs.bmj.com/bmj/2021/01/04/peter-doshi-pfizer-and-modernas-95-effective-vaccines-we-need-more-details-and-the-raw-data/", "https://www.fda.gov/media/144859/download#page=368", "https://www.medrxiv.org/content/10.1101/2021.07.28.21261159v1", "https://doi.org/10.1093/cid/ciy748", "https://www.cdc.gov/flu/vaccines-work/past-seasons-estimates.html", "https://www.reuters.com/world/middle-east/israel-sees-drop-pfizer-vaccine-protection-against-infections-still-strong-2021-07-05/", "https://www.cnbc.com/2021/07/23/delta-variant-pfizer-covid-vaccine-39percent-effective-in-israel-prevents-severe-illness.html", "https://www.fda.gov/media/139638/download", "https://www.jpost.com/health-science/covid-israel-registers-600-serious-patients-3rd-vaccine-to-be-expanded-677144", "https://www.whitehouse.gov/briefing-room/speeches-remarks/2021/08/18/remarks-by-president-biden-on-fighting-the-covid-19-pandemic-2/", "https://www.medrxiv.org/content/10.1101/2021.07.28.21261159v1.full.pdf#page=7", "https://www.fda.gov/media/144416/download#page=19", "https://covid.cdc.gov/covid-data-tracker/#variant-proportions", "https://www.bmj.com/content/373/bmj.n1244", "https://www.medrxiv.org/content/10.1101/2021.07.28.21261159v1.full.pdf#page=14", "https://investors.modernatx.com/news-releases/news-release-details/moderna-provides-clinical-and-supply-updates-covid-19-vaccine", "https://junkcharts.typepad.com/numbersruleyourworld/2021/08/statistical-statements-turn-on-a-few-words.html", "https://www.cbsnews.com/news/transcript-dr-scott-gottlieb-face-the-nation-08-01-2021/", "https://www.bmj.com/content/371/bmj.m4037", "https://www.nejm.org/doi/full/10.1056/NEJMoa2034577", "https://jamanetwork.com/journals/jama/fullarticle/2776739#comment-wrapper", "https://www.nejm.org/doi/full/10.1056/NEJMoa2035389#article_supplementary_material", "https://www.medrxiv.org/content/medrxiv/early/2021/07/28/2021.07.28.21261159/DC1/embed/media-1.pdf?download=true#page=12", "https://www.nytimes.com/live/2021/08/20/world/covid-delta-variant-vaccine/", "https://clinicaltrials.gov/ct2/show/NCT04368728", "https://www.bmj.com/content/374/bmj.n2086", "https://www.healthaffairs.org/do/10.1377/hblog20200814.996612/full/", "https://blogs.bmj.com/bmj/2021/06/08/why-we-petitioned-the-fda-to-refrain-from-fully-approving-any-covid-19-vaccine-this-year/", "https://blogs.bmj.com/bmj/2021/06/08/why-we-petitioned-the-fda-to-refrain-from-fully-approving-any-covid-19-vaccine-this-year/", "https://ebm.bmj.com/content/early/2021/08/08/bmjebm-2021-111735", "https://blogs.bmj.com/bmj/2021/06/08/why-we-petitioned-the-fda-to-refrain-from-fully-approving-any-covid-19-vaccine-this-year/", "https://www.regulations.gov/document/FDA-2021-P-0786-0001", "https://www.bmj.com/about-bmj/editorial-staff/peter-doshi", "https://blogs.bmj.com/bmj/2021/08/23/does-the-fda-think-these-data-justify-the-first-full-approval-of-a-covid-19-vaccine/"], "authors": ["Field Empty"], "publish_date": "2021-08-25T21:27:25+02:00"}