{"result_id": "033008", "URL": "https://anti-empire.com/vaccine-passport-slovenia-says-family-of-woman-who-died-after-jab-cant-sue-because-vaccination-is-voluntary/", "timestamp": "2023-04-25 12:06:31 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://anti-empire.com/wp-content/uploads/2016/11/favifavi.jpg", "canonical": "https://anti-empire.com/vaccine-passport-slovenia-says-family-of-woman-who-died-after-jab-cant-sue-because-vaccination-is-voluntary/", "encoding": "UTF-8"}, "image": null, "domain": "anti-empire.com", "title": "Vaccine Passport Slovenia Says Family of Woman Who Died After Jab Can’t Sue Because Vaccination Is “Voluntary”", "cleaned_text": "Without a vaccine/test passport you can’t get pump gas in Slovenia except in select gas stations where they have payment via a mobile application set up. You also can’t work or attend school.\n\nIt was precisely to get around these limitations that a 20-year old Slovenian woman “Katja” went for a vaccination last month and died of complications two weeks later. She wanted to “get her freedom” as her father explained. (Testing every 48 hours isn’t tenable which is just as the government wants it.)\n\nIt was also for this reason that she chose the one-dose J&J vaccine, so she could have her vax passport right away, rather than having to wait for another two weeks.\n\nThis is a person who never would have gotten the vaccine if not for government coercion and who would thus still be alive.\n\nThe government’s response has been to suspend the use of the J&J vaccine as its pressure campaign against the unvaccinated continues unabated. Get that. After its pressure campaign pushed a young woman into death, a rational person might conclude it is this campaign of coercing vaccinations that needs to stop. Instead, that will continue but now the unvaccinated will have even less choice as one of the injections is taken off the menu.\n\nAnother thing. If the government suspends the use of a vaccine like J&J that betrays the fact that the government doesn’t have a whole lot of faith in it. Yet how can the state justifiably coerce people into taking vaccines that it can not vouch for and is this skittish about?\n\nIf you have so little faith in your concoctions that you are never too far from suspending their use, then maybe you shouldn’t be running a mass campaign of coercion to get everyone injected in the first place?\n\nFinally when asked by reporters if those who suffer adverse effects (and families of those who die) are entitled to damages from the state, the Slovenian “Minister of Health” replied that they are not because in Slovenia vaccination is “voluntary”.\n\nThat might strike someone as absurd for a state where new limitations on the unvaxxed are thought up every month. On the other hand, if vaccination in Slovenia was not “voluntary” then justice for Katja would demand its government be lined up in front of a firing squad. This may have some role in explaining the Minister’s ‘creative’ position.", "opengraph": {"title": "Vaccine Passport Slovenia Says Family of Woman Who Died After Jab Can’t Sue Because Vaccination Is “Voluntary”", "description": "Use of J&J suspended. What are the ethics of coercing people to take an injection you can't vouch for?", "url": "https://anti-empire.com/vaccine-passport-slovenia-says-family-of-woman-who-died-after-jab-cant-sue-because-vaccination-is-voluntary/", "image": "https://anti-empire.com/wp-content/uploads/2021/10/6756745.jpg", "image:width": "510", "image:height": "340", "image:type": "image/jpeg", "type": "article", "article:published_time": "2021-10-04T15:13:56+02:00", "article:modified_time": "2021-10-04T15:13:56+02:00", "article:tag": "The Covid Rouge", "locale": "en_US", "site_name": "Anti-Empire", "article:section": "Society", "image:secure_url": "https://anti-empire.com/wp-content/uploads/2021/10/6756745.jpg", "updated_time": "2021-10-04T15:13:56+02:00", "article:publisher": "https://www.facebook.com/CheckpointAsia/"}, "tags": ["The Covid Rouge"], "tweets": [], "movies": [], "links": ["https://www.zurnal24.si/slovenija/protestnike-pred-parlamentom-nagovoril-oce-umrle-20-letnice-373974", "https://www.24ur.com/novice/korona/cepivo-janssen.html", "https://www.facebook.com/tanja.ribic.77/posts/420756876074754"], "authors": ["Field Empty"], "publish_date": "2021-10-04T15:13:56+02:00"}