{"result_id": "033026", "URL": "https://anti-empire.com/biontech-is-a-tech-startup-which-had-never-successfully-brought-a-product-to-market-before-the-pfizer-covid-mrna/", "timestamp": "2023-04-25 12:06:46 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://anti-empire.com/wp-content/uploads/2016/11/favifavi.jpg", "canonical": "https://anti-empire.com/biontech-is-a-tech-startup-which-had-never-successfully-brought-a-product-to-market-before-the-pfizer-covid-mrna/", "encoding": "UTF-8"}, "image": null, "domain": "anti-empire.com", "title": "BioNTech Is a Tech Startup Which Had Never Successfully Brought a Product to Market Before the “Pfizer” COVID mRNA", "cleaned_text": "The notion that vaccine mandates and related measures to compel vaccination are the product of the influence of “Big Pharma” on governments is a commonplace among the critics of such measures. Moreover, with the Pfizer vaccine going from one regulatory success to another and increasingly dominating the Covid-19 vaccine market in both the United States and continental Europe (not to mention Israel, whose vaccination campaign has consisted almost exclusively of Pfizer), it is clear that what is really meant today by “Big Pharma” must be Pfizer and Pfizer alone.\n\nFollowing negative media coverage of adverse effects (in particular, thrombosis) and, in some cases, regulatory intervention on the part of national supervisory agencies, both of the other actual “Big Pharma” alternatives, AstraZeneca in the EU and Johnson & Johnson in the EU and the US, have been relegated to the status of bit players outside of the United Kingdom.\n\nIt would appear that in the West at least, we are moving toward a virtual Covid-19 vaccine monopoly for Pfizer. Even the Covid vaccine of Moderna – a company that famously had never brought a drug to market previously and hence that could hardly be described as “Big Pharma” – is increasingly coming under scrutiny for causing myocarditis in young males and its use is being restricted to people over 30 in a whole series of European countries.\n\nPfizer, by contrast, has remained untouched. This even though myocarditis is a widely-reported and officially acknowledged adverse effect of both mRNA vaccines, Moderna and Pfizer, even though recent statistical analysis by the CDC, at any rate, found no “significant difference” in reported myocarditis between the two vaccines for males 18-25, and even though there is evidence that Moderna provides longer-lasting protection (the effectiveness of the vaccine even being twice that of Pfizer six months on, according to this recent study [p. 11]).\n\nWhat greater proof of the inordinate power of “Big Pharma” – i.e. Pfizer – could there be? But if Pfizer did not rule the world two years ago, how did it come to rule the world today?\n\nMoreover, as many Americans will only have discovered when the FDA’s full approval of the “Pfizer” vaccine was given not to Pfizer, after all, but to BioNTech Manufacturing GmbH of Mainz, Germany. The actual developer of the so-called “Pfizer” vaccine is precisely Pfizer’s German partner BioNTech.\n\nThis is already evident indeed from the codename of the vaccine: BNT162b2. Needless to say, “BNT” does not stand for Pfizer. The partnership agreement between the two firms likewise makes abundantly clear that BNT162b2 is BioNTech’s vaccine. Thus, apart from its own direct proceeds from sales of the vaccine, BioNTech receives “up to double-digit tiered royalty payments” from Pfizer on the latter’s sales of the vaccine in Pfizer’s assigned territories.\n\nThis is in addition to “$120 million in upfront, equity and near-term research payments and up to an additional $305 million in potential development, regulatory and commercial milestone payments”. (See BioNTech press release here.) BioNTech, incidentally, has a similar agreement with Fosun Pharma for commercializing its vaccine in China.\n\nNow, far from being “Big Pharma,” prior to the outbreak of the Covid-19 pandemic, BioNTech was still, in effect, a small, struggling start-up, which, like Moderna, had yet to bring a product to market. BioNTech’s own 2019 annual report filing to the SEC describes the company as follows: “We are a clinical-stage biopharmaceutical company with no pharmaceutical products approved for commercial sale.”\n\nThe filing continues frankly, “We have incurred significant losses since our inception and we anticipate that we will continue to incur significant losses for the foreseeable future….” Thus, in the 2nd quarter of 2020, BioNTech had only 41.8 million euros in (non-product) revenues and losses of more than twice that amount (88.3 million euros). Thanks to its Covid-19 vaccine, however, one year later, in the 2nd quarter of 2021, its revenues had rocketed to 5.31 billion euros – a more than 100-fold increase! – of which over three-quarters (4 billion euros) is profit.\n\nAs the economist Carsten Brzeski of the Dutch bank ING put it to Reuters, BioNTech had gone “from 0 to 100 in just a year.” BioNTech’s recently announced 3rd quarter results show estimated revenues of over 6 billion euros and gross profits of nearly 4.7 billion euros.\n\nThe story of how BioNTech went from zero to hero is a pure story of government interventionism and subsidies. Indeed, the German government supported the very founding of BioNTech. It was thus in fact the German government that identified biotechnology as an important, potential growth sector and, in 2005, launched a funding program whose explicit aim was to promote biotech start-ups based on academic research: the Gründungsoffensive Biotechnologie – roughly, the “Biotechnology Start-Up Offensive” – or “Go-Bio” for short.\n\nThe idea, as explained here (link in German), is to provide up to two rounds of support: a first grant to a research team with a commercially promising project and then, supposing the research team succeeds in founding a company based on its research, a second grant to the start-up.\n\nBioNTech was one of the firms to be brought into existence under the aegis of the Go-Bio program. In 2007, Go-Bio first provided a 1.2 million euro “Phase I” grant of 1.2 million euros to support BioNTech founder Ugur Sahin’s research at the University of Mainz on developing mRNA-based cancer treatments, and it then followed that up with a nearly 3 million euro “Go-Bio Phase II” grant to the newly-founded BioNTech RNA Pharmaceuticals GmbH in 2010. (For the details, in German, see here.)\n\nIn the years to come, BioNTech would continue to enjoy public support: both from the state government of Rhineland-Palatinate, of which Mainz is the capital, and as leading member of a so-called “cluster” of companies and research establishments in the Mainz region that from 2012 to 2017 received 40 million euros in support (link in German) from the German Federal Ministry of Education and Research. The cluster is named the Cluster for Individualized Immune Intervention or “Ci3”. The chairs of Ci3 are Sahin’s wife and BioNTech Chief Medical Officer, Özlem Türeci, and BioNTech co-founder Christoph Huber.\n\nBut the flow of public manna to BioNTech then increased massively last year, when the outbreak of the Covid pandemic provided the company the opportunity to pivot from its hitherto unsuccessful efforts to develop mRNA-based cancer treatments to developing an mRNA-based vaccine against Covid-19.\n\nPer this timeline published by the German public broadcaster SWR, BioNTech had already contacted German’s public regulatory agency for vaccines, the Paul Ehrlich Institute, about its plans to develop a Covid-19 vaccine in February 2020 – at a time when scattered reports about local Covid-19 infections were first emerging in Europe and before the WHO had even declared there to be a pandemic!\n\nBy April, clinical trials were already underway! (See the EU Clinical Trial Register here.) On September 15, the German government announced that it was providing BioNTech 375 million euros in subsidies (link in German) to support its Covid-19 vaccine. The European Bank for Investment had already pitched in 100 million euros in debt financing. The German funding does not have to be repaid.\n\nBut with an overall average corporate tax rate of around 30% in Germany and an effective federal rate of almost 16%, the German government figures to get a healthy return on its investment. According to the company’s current projections, BioNTech is expected to have 16-17 billion euros in Covid-19 vaccine revenues for 2021.\n\nAlready after the announcement of BioNTech’s 2nd quarter results, the German economist Sebastian Dullien calculated that BioNTech revenues alone will represent about 0.5% of German GDP and thus account for 0.5% growth in German GDP – i.e. since BioNTech contributed essentially nothing to German GDP previously! BioNTech alone would thus account for about 1/8 of Germany’s expected GDP growth for 2021.\n\nThese calculations were based, however, on a slightly lower revenue forecast and significantly higher expected GDP growth. Based on the current forecast of 2.4% German growth, BioNTech alone would account for more than 1/5 of German growth. According to its most recently released financials, moreover, the company’s 2021 tax bill to date comes to over 3 billion euros.\n\nFor all the talk of the power of Big Pharma, the Covid-19 vaccine that is currently becoming the standard throughout the Western world has a far more powerful state sponsor and the state sponsor is Germany. This raises particularly obvious and thorny issues for the European Union, where the vaccine contracts for all 27 member states were negotiated by a European Commission that is headed by former German Minister of Defense Ursula von der Leyen.\n\nBut with Germany able to amplify its power and project it on a global scale precisely via the European Union, German sponsorship of the BioNTech/“Pfizer” vaccine also raises issues for the world as a whole.", "opengraph": {"title": "BioNTech Is a Tech Startup Which Had Never Successfully Brought a Product to Market Before the “Pfizer” COVID mRNA", "description": "Well it's very fortunate then that the psychosis happened — and $4-5bn in profit quarterly after years of money-bleeding failure", "url": "https://anti-empire.com/biontech-is-a-tech-startup-which-had-never-successfully-brought-a-product-to-market-before-the-pfizer-covid-mrna/", "image": "https://anti-empire.com/wp-content/uploads/2021/11/msg501671980-52007.jpg", "image:width": "680", "image:height": "385", "image:type": "image/jpeg", "type": "article", "article:published_time": "2021-11-25T07:25:55+01:00", "article:modified_time": "2021-11-25T07:33:02+01:00", "locale": "en_US", "site_name": "Anti-Empire", "article:section": "Politics", "image:secure_url": "https://anti-empire.com/wp-content/uploads/2021/11/msg501671980-52007.jpg", "updated_time": "2021-11-25T07:33:02+01:00", "article:publisher": "https://www.facebook.com/CheckpointAsia/"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.cdc.gov/vaccines/acip/meetings/downloads/slides-2021-10-20-21/06-COVID-Shimabukuro-508.pdf", "https://poseidon01.ssrn.com/delivery.php?ID=791101027092093118085018000068105018105084007031052035109090082088104013086003024089043050055106031007050102108000078085025112025019027055033022099008084018116090105066026050067002007094107075122119085029114017089102091000014074112077030064109090009005&EXT=pdf&INDEX=TRUE", "https://www.fda.gov/media/151710/download", "https://investors.biontech.de/news-releases/news-release-details/biontech-signs-collaboration-agreement-pfizer-develop-mrna-based", "https://investors.biontech.de/news-releases/news-release-details/biontech-and-fosun-pharma-form-covid-19-vaccine-strategic", "https://www.sec.gov/Archives/edgar/data/0001776985/000156459020014536/bntx-20f_20191231.htm#ITEM_3_D", "https://investors.biontech.de/news-releases/news-release-details/biontech-announces-second-quarter-2020-financial-results-and", "https://investors.biontech.de/news-releases/news-release-details/biontech-announces-second-quarter-2021-financial-results-and", "https://www.reuters.com/article/us-germany-economy-biontech-idUSKBN2FB15A", "https://investors.biontech.de/news-releases/news-release-details/biontech-announces-third-quarter-2021-financial-results-and", "https://www.go-bio.de/gobio/shareddocs/downloads/de/2020_11_09_steckbrief_go-bio_barrierefrei_de.pdf?__blob=publicationFile&v=1", "https://www.go-bio.de/gobio/de/gefoerderte-projekte/_documents/entwicklung-innovativer-impfstoffe-gegen-krebserkrankungen", "https://mwvlw.rlp.de/de/presse/detail/news/News/detail/cluster/", "https://www.uni-mainz.de/presse/54412.php", "https://ci-3.de/chairpersons/", "https://www.swr.de/swraktuell/rheinland-pfalz/corona-impfstoff-chronologie-100.html", "https://www.clinicaltrialsregister.eu/ctr-search/trial/2020-001038-36/DE#A", "https://www.bundesregierung.de/breg-de/themen/themenseite-forschung/corona-impfstoff-1787044", "https://ec.europa.eu/commission/presscorner/detail/en/IP_20_1034", "https://investors.biontech.de/news-releases/news-release-details/biontech-announces-third-quarter-2021-financial-results-and", "https://www.reuters.com/article/us-germany-economy-biontech-idUSKBN2FB15A", "https://investors.biontech.de/news-releases/news-release-details/biontech-announces-third-quarter-2021-financial-results-and", "https://ec.europa.eu/info/live-work-travel-eu/coronavirus-response/safe-covid-19-vaccines-europeans/questions-and-answers-covid-19-vaccination-eu_en", "https://ec.europa.eu/commission/presscorner/detail/en/QANDA_21_48"], "authors": ["Field Empty"], "publish_date": "2021-11-25T07:25:55+01:00"}