{"result_id": "033054", "URL": "https://anti-empire.com/sweden-introduces-vaccine-passports-considers-deploying-troops-to-ukraine/", "timestamp": "2023-04-25 12:07:07 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://anti-empire.com/wp-content/uploads/2016/11/favifavi.jpg", "canonical": "https://anti-empire.com/sweden-introduces-vaccine-passports-considers-deploying-troops-to-ukraine/", "encoding": "UTF-8"}, "image": null, "domain": "anti-empire.com", "title": "Sweden Introduces Vaccine Passports, Considers Deploying Troops to Ukraine", "cleaned_text": "The Swedish Public Health Agency announced on Wednesday that they will introduce vaccine passes for the first time from the start of December, with theatres, concerts and other indoor events able to limit entry to the fully inoculated.\n\n“Vaccine passes are a measure that we see as necessary,” Karin Tegmark Wisell, the agency’s director general [she has only been appointed this month], said at a press conference announcing the move, pointing to the rising infection rates elsewhere in Europe. “We cannot just kick back and hope for the best”.\n\nSweden’s culture minister, Amanda Lind, stressed that the government was not enforcing vaccine passes on those holding larger indoor events, only allowing them to dispense with restrictions if they decided required them.\n\n“The restrictions that would otherwise apply to an activity are eased if the organiser can guarantee that the participants are vaccinated,” she said.\n\nShe said that the government had long been mulling requiring vaccine certificates, which have long been a tool used elsewhere in Europe.\n\n“Being able to use vaccination certificates is something the government has been preparing for a long time. You have previously heard me talk about vaccination certificates as a “plan B”. Now that situation is here,” Lind said.\n\nHow will Sweden use the vaccine pass?\n\nThe Swedish Public Health Agency said in a press release on Wednesday afternoon that they intended to bring back restrictions for all indoor events with more than 100 participants from December 1st.\n\nThese restrictions might include a limit on the maximum number of people allowed to attend per square meter, or a minimum distance requirement between different groups of people attending. At the press conference, Tegmark Wisell would not give any further details, only saying that the restrictions would “be similar” to those in place during earlier waves of infection.\n\nThe new restrictions will apply to theatres, concerts, cinemas, night clubs, sports events, dance performances, funfairs, and amusement parks, markets, conferences, demonstrations, and religious services.\n\nInstitutions and event organisers will be excused the new restrictions if they require that all those attending have shown a valid vaccination certificate.\n\nThe possibility of requiring a vaccine pass is not currently expected to be extended to restaurants, bars or similar establishments, as has been the case in France, Denmark and other countries — so long as they do not hold dance events.\n\nWhat will be required for a vaccination certificate to be valid?\n\nUnlike similar health or Covid passes brought in elsewhere in Europe, Sweden’s requirement is for vaccination and vaccination alone, with those who have received their final vaccine dose at least two weeks before attending an event counted as fully vaccinated. Proof of a negative test result or evidence of recovery from a Covid-19 infection will not be enough to enter events requiring a certificate.\n• None Peter Hultqvist supports a proposal within the EU that has come from the Baltic countries for a training mission in Ukraine.\n• None This could mean that Sweden will eventually send officers to the country to train the military.\n\nMinister of Defence of Sweden Peter Hultqvist agreed to send Swedish troops to Ukraine for a training mission led by the European Union. Hultqvist stated this on Swedish radio Ekot.\n\n“We consider it very important to highlight the EU’s ambitions to contribute to the security and sovereignty of Ukraine,” Swedish Defense Minister said.\n\nHultqvist intends to find out how Sweden can take part in this.\n\nIn October, Ukraine’s Defense Ministry announced that an EU military advisory and training mission would be deployed in the country by the end of this year.\n\nEarlier it became known that Brussels sent experts to Ukraine to study the country’s needs in the deployment of the EU military training mission.\n\nLast week, Swedish Ambassador to Ukraine Tobias Tiberg said that the European Union would prepare an assessment of the security situation on the Ukrainian border, where Russian troops are concentrated.", "opengraph": {"title": "Sweden Introduces Vaccine Passports, Considers Deploying Troops to Ukraine", "description": "To train Ukrainians with the EU. Events over 100 only for those with the proof of obedience", "url": "https://anti-empire.com/sweden-introduces-vaccine-passports-considers-deploying-troops-to-ukraine/", "image": "https://anti-empire.com/wp-content/uploads/2021/11/200616-poland.jpg", "image:width": "676", "image:height": "384", "image:type": "image/jpeg", "type": "article", "article:published_time": "2021-11-18T12:13:26+01:00", "article:modified_time": "2021-11-18T12:13:26+01:00", "locale": "en_US", "site_name": "Anti-Empire", "article:section": "Society", "image:secure_url": "https://anti-empire.com/wp-content/uploads/2021/11/200616-poland.jpg", "updated_time": "2021-11-18T12:13:26+01:00", "article:publisher": "https://www.facebook.com/CheckpointAsia/"}, "tags": [], "tweets": [], "movies": [], "links": ["https://archive.vn/o/OWPsG/https://www.folkhalsomyndigheten.se/nyheter-och-press/nyhetsarkiv/2021/november/nya-atgarder-for-att-minska-spridning-av-covid-19/", "https://www.thelocal.com/20211117/analysis-will-sweden-introduce-covid-vaccine-passes/", "https://sverigesradio.se/artikel/forsvarsministern-beredd-att-skicka-svensk-militar-till-ukraina", "https://112.international/society/ukraine-excluded-from-travel-green-list-which-eu-countries-remain-open-66851.html", "https://112.international/ukraine-top-news/new-satellite-images-show-concentration-of-russian-troops-hardware-on-border-with-ukraine-politico-66392.html", "https://112.international/ukraine-top-news/sweden-ready-to-send-its-troops-to-ukraine-for-a-training-mission-66909.html"], "authors": ["Field Empty"], "publish_date": "2021-11-18T12:13:26+01:00"}