{"result_id": "033048", "URL": "https://anti-empire.com/romanias-famous-steaua-soccer-club-announces-ban-on-vaccinated-players-who-are-powerless-and-lose-strength/", "timestamp": "2023-04-25 12:07:02 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://anti-empire.com/wp-content/uploads/2016/11/favifavi.jpg", "canonical": "https://anti-empire.com/romanias-famous-steaua-soccer-club-announces-ban-on-vaccinated-players-who-are-powerless-and-lose-strength/", "encoding": "UTF-8"}, "image": null, "domain": "anti-empire.com", "title": "Romania’s Famous Steaua Soccer Club Announces Ban on Vaccinated Players Who Are ‘Powerless’ and ‘Lose Strength’", "cleaned_text": "Romania’s Famous Steaua Soccer Club Announces Ban on Vaccinated Players Who Are ‘Powerless’ and ‘Lose Strength’\n\nThe owner of Romanian side Steaua Bucharest has sensationally announced the club will ban all players vaccinated against Covid-19 from playing for them.\n\nMr Gigi Becali – a Romanian businessman and politician – said he is not allowing vaccinated players to play anymore because they are ‘powerless’.\n\nBecali went on to claim that people who are vaccinated against the virus die in hospitals, as opposed to those who have refused the jabs.\n\nHe also claimed players at Romanian rivals CFR Cluj and Rapid Bucuresti were struggling as a result of taking the vaccine, singling out 36-year-old winger Ciprian Deac.\n\n‘You’re going to laugh, but I might be right. Those vaccinated lose their strength. That’s something scientific,’ he said according to Romanian journalist Emanuel Rosu.\n\n‘Haven’t you seen it at CFR? With Rapid, the players seemed to be fainting. They slept on the ground. All vaccinated people lose their strength!\n\n‘I also see mine, the vaccinated ones. It doesn’t affect some, but it does affect those who are older. Haven’t you seen [Ciprian] Deac? There is no more storm.’\n\nThe same journalist also said Becali suggests he only allowed players who faked getting vaccinated to play, though this information remains unconfirmed.\n\nBecali also recently said Steaua Bucharest striker Claudiu Keseru – who returned to the club in August after six years at Bulgarian outfit Ludogorets – can no longer play at a high level because he was vaccinated.\n\n‘I gave him the money, I had a contract with him, he was a football player, I was the owner,’ Becali said via sport.ro about Keseru’s return.\n\n‘I said, ”You can’t go to this level anymore. You can play in Romania, but not at Steaua and CFR!”.\n\n‘He said he would show me, but he has nothing to show me. It can’t be at this level anymore. It’s possible because of the vaccine. I say what I think. I don’t want to offend him.’\n\nBut his latest statement has drawn a furious reaction from the country’s government.\n\nIn a statement, RO Vaccinare, the official Facebook page of the government’s national information platform on vaccination said: ‘Vaccinated footballers do NOT lose their strength after being vaccinated against COVID-19!\n\n‘From a medical and scientific point of view, there are no studies that would support a singularity like the one recently promoted on Facebook accounts in Romania.\n\n‘Vaccination against COVID-19 does not affect the performance of football players. In contrast, there are enough studies showing that going through SARS CoV-2 infection leaves long-term sequelae (Long COVID), and these can influence athletes’ performance.\n\n‘The bottom line is simple: to stay healthy, to enjoy football, to look at those who trust science and medicine. Please inform yourself ONLY from credible, official sources!’\n\nRomania are one of eight countries with a vaccination rate below 60 per cent according to The Local, with the other consisting of Slovenia, Croatia, Serbia, Hungary, Slovakia, Poland and Russia.\n\nHowever, their current rate of 86.52 doses per 100 population means they have the second lowest in Europe, ahead of only Bulgaria, according to Statista.\n\nEarlier this month, the coordinator of the Romanian national vaccination campaign, Valeriu Gheorghita, confirmed nearly one million doses of the AstraZeneca vaccine, had expired and would therefore be destroyed.\n\n‘We have received a total of 4,478,000 doses, and 852,356 doses have been administered. Some 3.3, entered the resale or donation mechanism, including the 917,800 that have expired,’ Gheorghita explained.\n\nBecali’s comments are just the latest in what has been a career in the game littered with controversial statements.\n\nIn 2018, he triggered a sexism row after revealing Steaua Bucharest will never have a women’s team as long as he is in charge, claiming female football is ‘against human nature’ and aligns ‘to Satan’s ideas’.\n\nAsked on Romanian TV channel Pro X whether he would consider launching a women’s side, Becali answered ‘you can’t do things against God’s will’ before adding ‘I’ll quit football’.\n\n‘She isn’t built for playing football. Her body isn’t made for football. It’s dangerous. The female was created to be beautiful, to attract the opposite sex.\n\n‘We are affecting women by letting them play football or by allowing them to box. They should play handball, volleyball, basketball, but not aggressive sports.’\n\nOther previous controversies include promising to oppose sexual minorities when running for president in 2004, before another go five years later. However, he received just 1.77 and 1.91 per cent of the votes cast respectively.\n\nThe former member of the Romanian Parliament was also heavily criticised in 2006 for saying: ‘Why [are there] so many homosexuals (in Romania)? I’ll give $2m or $5m (for a referendum), so we can finish off all homosexuals in the country.’", "opengraph": {"title": "Romania’s Famous Steaua Soccer Club Announces Ban on Vaccinated Players Who Are ‘Powerless’ and ‘Lose Strength’", "description": "\"Becali suggests he only allowed players who faked getting vaccinated to play\"", "url": "https://anti-empire.com/romanias-famous-steaua-soccer-club-announces-ban-on-vaccinated-players-who-are-powerless-and-lose-strength/", "image": "https://anti-empire.com/wp-content/uploads/2022/03/steaua-1986-duckadam-709x432-1.jpg", "image:width": "709", "image:height": "432", "image:type": "image/jpeg", "type": "article", "article:published_time": "2022-03-23T06:11:15+01:00", "article:modified_time": "2022-03-23T07:32:28+01:00", "locale": "en_US", "site_name": "Anti-Empire", "article:section": "Politics", "image:secure_url": "https://anti-empire.com/wp-content/uploads/2022/03/steaua-1986-duckadam-709x432-1.jpg", "updated_time": "2022-03-23T07:32:28+01:00", "article:publisher": "https://www.facebook.com/CheckpointAsia/"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.dailymail.co.uk/sport/sportsnews/article-10542765/Romanias-famous-football-team-Steaua-Bucharest-announce-ban-VACCINATED-players.html", "https://archive.vn/o/KrUyJ/https://www.dailymail.co.uk/news/coronavirus/index.html", "https://archive.vn/o/KrUyJ/https://twitter.com/Emishor/status/1496447904617312259", "https://archive.vn/o/KrUyJ/https://www.sport.ro/liga-1/teoria-lui-gigi-becali-facuta-praf-in-direct-declaratie-tembela-incorecta-mizerabila-si-discriminatorie.html", "https://archive.vn/o/KrUyJ/https://www.facebook.com/photo.php?fbid=349197777213426&set=a.274467748019763&type=3", "https://archive.vn/o/KrUyJ/https://www.thelocal.at/20220222/which-groups-are-most-vaccine-hesitant-in-austria/", "https://archive.vn/o/KrUyJ/https://www.statista.com/statistics/1196071/covid-19-vaccination-rate-in-europe-by-country/"], "authors": ["Field Empty"], "publish_date": "2022-03-23T06:11:15+01:00"}