{"result_id": "033001", "URL": "https://anti-empire.com/phds-are-now-most-likely-to-be-vaccine-resistors/", "timestamp": "2023-04-25 12:06:24 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://anti-empire.com/wp-content/uploads/2016/11/favifavi.jpg", "canonical": "https://anti-empire.com/phds-are-now-most-likely-to-be-vaccine-resistors/", "encoding": "UTF-8"}, "image": null, "domain": "anti-empire.com", "title": "PhDs Are Now Most Likely to Be Vaccine Resistors", "cleaned_text": "PhDs Are Now Most Likely to Be Vaccine Resistors\n\nA study conducted by researchers from Carnegie Mellon University and the University of Pittsburgh has found that vaccine hesitancy has decreased among US adults by one-third between January and May 2021. While tentative people are concerned about COVID-19 vaccine safety and potential side effects, those with stronger views tend to distrust the government.\n\nThe researchers published their results on medRxiv, a preprint website, and announced their results today, ahead of peer-reviewed publication.\n\nThe researchers, Robin Mejia, special faculty at the CMU Dietrich College of Humanities and Social Sciences and senior author on the paper, and Wendy C. King, associate professor of epidemiology in Pitt’s Graduate School of Public Health and first author, reviewed the responses of approximately 1 million Americans per month to assess trends in vaccine acceptance. The researchers partnered with the Delphi Group at CMU, who run an ongoing national COVID-19 survey in collaboration with the Facebook Data for Good group.\n\nThe survey asked people whether they would take a vaccine were it offered to them today. People who said “probably not” or “definitely not” were considered to be vaccine hesitant.\n\nMejia and King analyzed the data by race, education, US region and Trump support in the 2020 election to assess time trends and how each group’s outlooks changed regarding vaccination. The data from May provides the current relationship between a broad range of factors and vaccine acceptance.\n\nThe largest decrease in hesitancy between January and May by education group was in those with a high school education or less. Hesitancy held constant in the most educated group (those with a PhD); by May PhD’s were the most hesitant group.\n\nWhile vaccine hesitancy decreased across virtually all racial groups, Black people and Pacific Islanders had the largest decreases, joining Hispanics and Asians at having lower vaccine hesitancy than white people in May.\n\nThose from counties with higher Trump support in the 2020 presidential election showed higher hesitancy, and the difference in hesitancy between areas with high and low Trump support grew over the period studied. “This finding really highlights the politicization of public health recommendations,” said King.\n\n“What’s concerning is there is a subset of the population that’s got strong levels of hesitancy, as in refusal to take the vaccine, not potential concern about it, and the size of that group isn’t changing,” said Mejia.\n\nAmong the most recalcitrant, commonly cited reasons included not trusting the vaccine and not trusting the government, while less hesitant groups were more inclined to explain they were waiting to see if the vaccine is safe. The researchers believe that different approaches are necessary to address these concerns.\n\n“In all the other levels of vaccine intent we saw change over time. The lack of change in prevalence of the ‘definitely not’ group implies those with strong feelings about the vaccine are not likely to change easily,” said King. “Thinking about how to reach that group and having messaging and incentives that that group will respond to is important.”\n\nThe decrease in disparities by educational attainment and race was found. The researchers believe that targeted campaigns may have increased vaccine acceptance and access.\n\n“There have been racial disparities in every aspect of the pandemic from how hard different communities have been hit by it to access to healthcare resources,” said Mejia. “There’s been concerns about access to vaccines in the rollout, and initially there was a wide disparity in acceptance of the vaccine, so to see over time that’s decreased was really encouraging.”\n\nThe study also highlights key differences in hesitancy by race and age subgroups. For example, in May, younger Black people are more hesitant than younger white people, while the reverse is true in older populations.\n\nGenerally, COVID-19 vaccine hesitancy was higher among young (ages 18-24), non-Asian people, and less educated (≤ high school diploma) adults, and those with PhDs, with a history of a positive COVID-19 test, not worried about serious illness from COVID-19 and living in regions with greater support to Donald Trump in the 2020 election.\n\nThe researchers hope that their detailed analysis, which also includes a review of reasons for hesitancy by racial group, will help policymakers identify vaccine-resistant pockets to ensure the country reaches herd immunity.\n\n“Understanding the trends over the last several months is really important for projecting what may happen in the next couple months,” said King.\n\nSurvey respondents reported average education levels higher than the general population, and participants had greater vaccine uptake compared to the general population. This limitation suggests the percentage of people who refuse the COVID-19 vaccine is likely higher.\n\n“I remain concerned about reaching the most hesitant subgroup of Americans,” said Mejia. “The only way to end this pandemic for real is to get enough people vaccinated that we can reduce the speed of new variants spreading.”\n\nKing and Mejia were joined by Max Rubinstein and Alex Reinhart at CMU in the study, titled “Time trends and factors related to COVID-19 vaccine hesitancy from January-May 2021 among US adults: Findings from a large-scale national survey.” This research was supported by Facebook and a Centers for Disease Control and Prevention research grant.", "opengraph": {"title": "PhDs Are Now Most Likely to Be Vaccine Resistors", "description": "PhDs and high school dropouts least likely to bend the knee", "url": "https://anti-empire.com/phds-are-now-most-likely-to-be-vaccine-resistors/", "image": "https://anti-empire.com/wp-content/uploads/2021/08/no-thanks-3-750x500.jpg", "image:width": "1000", "image:height": "667", "image:type": "image/jpeg", "type": "article", "article:published_time": "2021-08-25T16:41:48+02:00", "article:modified_time": "2021-08-25T16:41:48+02:00", "locale": "en_US", "site_name": "Anti-Empire", "article:section": "Society", "image:secure_url": "https://anti-empire.com/wp-content/uploads/2021/08/no-thanks-3.jpg", "updated_time": "2021-08-25T16:41:48+02:00", "article:publisher": "https://www.facebook.com/CheckpointAsia/"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.medrxiv.org/content/10.1101/2021.07.20.21260795v1", "https://www.cmu.edu/chrs/about_us/people_bios/mejia.html", "https://publichealth.pitt.edu/home/directory/wendy-c-king", "https://delphi.cmu.edu/", "https://dataforgood.fb.com/", "https://www.cmu.edu/dietrich/news/news-stories/2021/july/covid-hesitancy.html"], "authors": ["Field Empty"], "publish_date": "2021-08-25T16:41:48+02:00"}