{"result_id": "033032", "URL": "https://anti-empire.com/its-time-for-unvaccinated-passports-house-arrest-for-the-injected/", "timestamp": "2023-04-25 12:06:50 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://anti-empire.com/wp-content/uploads/2016/11/favifavi.jpg", "canonical": "https://anti-empire.com/its-time-for-unvaccinated-passports-house-arrest-for-the-injected/", "encoding": "UTF-8"}, "image": null, "domain": "anti-empire.com", "title": "It’s Time for Unvaccinated Passports, House Arrest for the Injected", "cleaned_text": "The latest UKHSA Vaccine Surveillance report, containing data for the month ending December 12th, brings mixed news on the vaccines. First the bad news. Unadjusted vaccine effectiveness based on the raw reported infection rates is still negative for all aged between 18 and 70 (see above). In fact, it’s gone negative for the first time in 18-29 year-olds, down to minus-10.1%, after a sharp drop in the last week. A negative vaccine effectiveness means the infection rate per 100,000 people is higher in the vaccinated than the unvaccinated.\n\nThis means that vaccine passports and vaccine mandates will be ineffective at preventing transmission, and indeed it implies that the vaccinated are actually a higher transmission risk than the unvaccinated. Far from protecting the vaccinated from the unvaccinated, then, as much current policy seems intended to do, perhaps the unvaccinated should be wary of the company of the vaccinated.\n\nFor those in their 40s in particular, unadjusted vaccine effectiveness is minus-119%, meaning the vaccinated are more than twice as likely to be carrying the virus as the unvaccinated.\n\nThe goods news, however, is that the boosters appear to be having a significant impact. Unadjusted vaccine effectiveness has been rising in the older age groups for some weeks, and is now solidly positive in the over-70s, albeit at a not-very-impressive 39.5% in 70-79 year-olds and 53.3% in the over-80s. That this rise is likely due to the third doses is indicated by the fact it has occurred in staggered fashion in each age group, apparently in line with when boosters were rolled out.\n\nWhat appears to be the case to the casual eye has been put more rigorously to the test by Dr. Richard J. Booth, a retired civil servant with a Ph.D. in mathematical statistics. In a new piece published by the Daily Sceptic today, Dr. Booth undertakes statistical analysis to compare the booster rollout rates in each age group with the changes in the relative reported infection rates to see if there is any correlation over time. He explains:\n\nIt occurred to me that since the third doses have been deployed at different rates in the different age groups, it might be possible to observe, and analyse, a ripple of decreasing infection rates from older to younger people over the last few weeks. So I developed a statistical model for infection rates, including a value dependent on the week (because the epidemic progresses at a rather unpredictable rate from week to week), and a week-dependent value proportional to the number of people who two or more weeks earlier had had the third dose compared with the number having had at least the first dose. I divided out the infection rate data by its value in the first week, to put the different age ranges on the same footing.\n\nHe concludes that what appeared to be the case is validated by his model, and the booster rollout correlates well with the changes in relative infection rates.\n\nI conclude that though three doses of vaccines may have been effective from the outset, statistical support for that proposition via these sources did not become apparent until week 44’s data was published, when nearly half of over 80’s had had boosters two or more weeks earlier, but has been sustained since then. Of course, ‘statistical support’ is not a cast-iron proof, as correlation is not causation and there might be ‘unknown unknowns’ at work. Nevertheless it is highly suggestive that the prior statistical work on Covid vaccines is vindicated here.\n\nWhile not all readers will follow every detail in Dr. Booth’s thorough and technical article, it is well worth checking out.\n\nThere are signs of a similar rise in vaccine effectiveness against hospitalisation and death, which remain reassuringly high on this data. [Hospitalization and death with Covid as opposed to all-cause.]\n\nThe percentage of Covid hospital admissions in the unvaccinated has also been creeping up. While, contrary to what many claim, the unvaccinated still constitute a minority of Covid hospital admissions, the percentage has grown in the past month from 32.6% to 42.9%.\n\nThe booster success story is a double-edged one, however, as the sharp rise in unadjusted vaccine effectiveness since the rollout only underlines how poorly the two doses were performing only a few months after being administered. That the booster effect is showing up in the data indicates the data is telling us something meaningful about the vaccines. But that cuts both ways, as it means the negative vaccine effectiveness frequently showing up in the same data is also likely to be telling us something important.\n\nIf boosters are indeed boosting vaccine effectiveness, dragging the unadjusted rates up from below zero where they had long settled, the obvious question is: How long is the booster going to work for? How often are people going to have to have these injections? At the moment, there looks to be no end in sight. Since there are serious questions about the safety of the vaccines and their overall impact on mortality, the prospect of having two per year may, for many, become an increasingly unwelcome one.", "opengraph": {"title": "It’s Time for Unvaccinated Passports, House Arrest for the Injected", "description": "The double-jabbed are now more likely to test positive in every age group", "url": "https://anti-empire.com/its-time-for-unvaccinated-passports-house-arrest-for-the-injected/", "image": "https://anti-empire.com/wp-content/uploads/2021/12/8786786-750x500.jpg", "image:width": "758", "image:height": "505", "image:type": "image/jpeg", "type": "article", "article:published_time": "2021-12-18T18:33:41+01:00", "article:modified_time": "2021-12-18T18:33:41+01:00", "locale": "en_US", "site_name": "Anti-Empire", "article:section": "Society", "image:secure_url": "https://anti-empire.com/wp-content/uploads/2021/12/8786786.jpg", "updated_time": "2021-12-18T18:33:41+01:00", "article:publisher": "https://www.facebook.com/CheckpointAsia/"}, "tags": [], "tweets": [], "movies": [], "links": ["https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1041593/Vaccine-surveillance-report-week-50.pdf", "https://dailysceptic.org/measuring-vaccine-usefulness-without-reference-to-unvaccinated-case-rates/", "https://dailysceptic.org/measuring-vaccine-usefulness-without-reference-to-unvaccinated-case-rates/", "https://dailysceptic.org/2021/12/09/vaccine-safety-update-20/", "https://www.hartgroup.org/why-do-they-hide-what-happens-in-the-first-two-weeks-after-vaccination/", "https://dailysceptic.org/2021/12/17/vaccine-effectiveness-drops-below-zero-in-18-29-year-olds-for-first-time-but-boosters-appear-to-be-helping/"], "authors": ["Field Empty"], "publish_date": "2021-12-18T18:33:41+01:00"}