{"result_id": "033053", "URL": "https://anti-empire.com/the-atlantic-is-it-safe-to-hang-out-with-the-unboosted/", "timestamp": "2023-04-25 12:07:06 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://anti-empire.com/wp-content/uploads/2016/11/favifavi.jpg", "canonical": "https://anti-empire.com/the-atlantic-is-it-safe-to-hang-out-with-the-unboosted/", "encoding": "UTF-8"}, "image": null, "domain": "anti-empire.com", "title": "The Atlantic: “Is It Safe to Hang out With the Unboosted?”", "cleaned_text": "This past spring, if someone told you that they were fully vaccinated, you knew precisely what they meant: At least two weeks before, they’d received two doses of the Moderna COVID-19 vaccine, two doses of Pfizer, or one dose of Johnson & Johnson.\n\nNow what it means to be vaccinated encompasses much more variety. Some people who have gotten their initial doses haven’t gotten a booster dose, and some people mixed and matched the brands of their first shots and their booster. What’s more, everyone is on their own personal timeline, depending on when they got their shots. Amid this complexity, kids under 5 still aren’t eligible for any shots at all.\n\nAs the weather gets colder in much of the country and people bring more of their socializing indoors, this variety of vaccination histories introduces questions Americans didn’t previously have to deal with. Is it still safe to hang out with someone who is vaccinated but not boosted? Can unvaccinated little kids safely spend time with unboosted adults? And will the new coronavirus variant, Omicron, further complicate the risk calculus of an already complicated winter?\n\nWhen trying to gauge whether a gathering will be risky, the most important variable—by far—continues to be whether the attendees are vaccinated. Jessica Malaty Rivera, a research fellow at Boston Children’s Hospital, told me that she wouldn’t feel safe spending time with an unvaccinated person indoors; if she saw them at all, the meetup would be outside and with masks.\n\nThe next most important distinction is whether someone who’s due for a booster has received one. As of last week, the CDC advises that adults should get boosted at least six months after their initial doses of Pfizer or Moderna, or at least two months after their dose of Johnson & Johnson. (A booster’s full effects take about two weeks to kick in.)\n\nPeople who have gotten a booster are generally safer to spend time with, but not having one isn’t a dealbreaker. Rivera told me that someone’s booster status wouldn’t stop her from hanging out with them.\n\nShe said that she would feel more comfortable meeting outdoors with unboosted friends who are exposed to many other people each day, but “if there’s somebody who is always masked when they’re in mixed [vaccination] settings, works from home, and doesn’t see many people, their booster status doesn’t matter to me,” and she would feel comfortable spending time with them indoors.\n\nBecause of boosters, however, the term fully vaccinated doesn’t indicate as much about someone’s vaccination history as it used to. To be clear, the CDC’s definition of fully vaccinated hasn’t changed—it still applies to anyone who received their initial doses—but it doesn’t capture whether an adult has received a now-recommended booster shot. Eventually, the Omicron variant or waning vaccine effectiveness could make three doses the new standard for full vaccination, according to Ali Ellebedy, an immunologist at Washington University in St. Louis. This would add another element of complexity: Some “fully vaccinated” people might abruptly revert back to the category of “partially vaccinated.”\n\nAs people get boosted, many of them are getting a different brand of vaccine than the one they initially received. Some brands and combinations do appear to be more protective than others. Aparna Kumar, a professor at Thomas Jefferson University and a founding member of the public-education campaign Dear Pandemic, ranked them as follows, based on the antibody levels they produce: three Moderna shots, two doses of Pfizer with a Moderna booster, three Pfizer shots, one Johnson & Johnson dose with a Pfizer or Moderna booster, and two doses of Johnson & Johnson.\n\nBut this hierarchy of vaccines, Kumar and the other experts agreed, is not worth obsessing over. As Ellebedy put it, “The differences between them are the differences between being filthy rich or rich.” Indeed, Americans are exceedingly lucky to be able to ponder such distinctions; much of the world would be thrilled to have access to any vaccines at all.\n\nIn the U.S., one ongoing vexation is that children younger than 5 are still not eligible for any vaccines, which complicates the risk calculus for their families. Kumar told me that if a small child is the only unvaccinated person at a gathering of people without immunodeficiencies or comorbidities, the risk seems “really minimal.” But if multiple unvaccinated kids will be present, she would more strongly advise taking precautions such as masking, meeting outdoors, and testing.\n\nBoosters would decrease risk for all involved, but in Ellebedy’s view, children can still safely be around unboosted adults. At least for now: “Things could change if Omicron turns out to be very infectious,” he told me.\n\nIndeed, as complicated as vaccination statuses are now, they might become even more complicated in the future. The threat posed by Omicron is currently unclear, but if it turns out to be more contagious, deadlier, and able to dodge our existing vaccines, an additional dose formulated specially for Omicron may be necessary. At that point, Ellebedy noted, people’s vaccine sequences would be even more varied: Some would be getting their fourth shot, while others would get an Omicron-specific dose as their first.\n\nBut over time, the distinctions around boosters and timing and brands should fade in importance. As the pandemic continues, more and more people will develop immunity, whether by getting vaccinated or by recovering from an infection. “At a certain point, we will stop paying attention, just because overall immunity will be higher,” Ellebedy said. For now, the complexity is stressful, but at least it’s a side effect of something good—namely, that more people can get more protection from the virus. The complexity will eventually pass, but thankfully the advantages of vaccines won’t.", "opengraph": {"title": "The Atlantic: “Is It Safe to Hang out With the Unboosted?”", "description": "The vaccine mischlinge", "url": "https://anti-empire.com/the-atlantic-is-it-safe-to-hang-out-with-the-unboosted/", "image": "https://anti-empire.com/wp-content/uploads/2021/12/5645-750x500.jpg", "image:width": "915", "image:height": "610", "image:type": "image/jpeg", "type": "article", "article:published_time": "2021-12-07T10:31:20+01:00", "article:modified_time": "2021-12-07T10:31:20+01:00", "locale": "en_US", "site_name": "Anti-Empire", "article:section": "Society", "image:secure_url": "https://anti-empire.com/wp-content/uploads/2021/12/5645.jpg", "updated_time": "2021-12-07T10:31:20+01:00", "article:publisher": "https://www.facebook.com/CheckpointAsia/"}, "tags": [], "tweets": [], "movies": [], "links": ["https://archive.vn/o/dYvJ1/https://www.theatlantic.com/science/archive/2021/10/booster-shot-better-name/620300/", "https://archive.vn/o/dYvJ1/https://www.theatlantic.com/health/archive/2021/10/mix-match-booster-covid-vaccine/620395/", "https://archive.vn/o/dYvJ1/https://www.theatlantic.com/health/archive/2021/12/how-bad-omicron-variant/620870/", "https://archive.vn/o/dYvJ1/https://dearpandemic.org/", "https://archive.vn/o/dYvJ1/https://www.theatlantic.com/health/archive/2021/10/mix-match-booster-covid-vaccine/620395/", "https://archive.vn/o/dYvJ1/https://www.theatlantic.com/science/archive/2021/11/omicron-coronavirus-variant-what-we-know/620827/", "https://www.theatlantic.com/family/archive/2021/12/covid-booster-fully-vaccinated-omicron/620916/"], "authors": ["Field Empty"], "publish_date": "2021-12-07T10:31:20+01:00"}