{"result_id": "034002", "URL": "https://anyavien.com/tamiflu-adults-and-kids-are-at-risk-of-hallucinations-seizures-and-sudden-death/", "timestamp": "2023-04-25 12:07:10 CEST+0200", "meta": {"description": "Serious Adverse Events, especially neuropsychiatric events associated with Tamiflu, started getting reported. Tamiflu dangers", "lang": "en", "keywords": "", "favicon": "https://anyavien.com/wp-content/themes/foodiepro/images/favicon.ico", "canonical": "https://anyavien.com/tamiflu-adults-and-kids-are-at-risk-of-hallucinations-seizures-and-sudden-death/", "encoding": "UTF-8"}, "image": null, "domain": "anyavien.com", "title": "Tamiflu: One of the most dangerous medications on the market, especially for children", "cleaned_text": "One thing you hear constantly on TV is this year’s Flu is “the worst ever and deadly… run to get a flu shot now”! But since even the CDC conceded that flu shots only work 39% of the time, chances are, you will still get the flu at some point. If the talking heads convinced you this year the flu is uniquely deadly, you will probably go see your doctor who in return has been trained to offer you an expensive pharmaceutical product to control its symptoms (it’s tragic how modern doctors think the only solution is pharmaceutical). That product will likely be Tamiflu. At this point your safe right? Wrong! Tamiflu dangers are real and can cost you the health of your family.\n\n“My cousin in Atlanta just took this medication a week ago for flu symptoms and has been hallucinating ever since. He never acted this way before. He’s currently in a psychiatric hospital seeking treatment. We are all heart broken; he was okay before taking the medication.” ~Emeka\n\nThe truth is you’re not safe!\n\nA Japanese study in 2007 highlighted the impact Tamiflu had on the Japanese population 6 years after the product came to market in that country. The Japanese Ministry of Health and Labor Welfare handled 1,377 reports of adverse reactions to the drug. About half were classified as neuropsychiatric cases (including delirium, convulsions and encephalitis). Of the 80 deaths reports, 71 were deemed directly due to Tamiflu. Including two suicides attributed to Tamilflu induced psychiatric dysfunction.\n\nIn 2011 A Japanese study concluded that patients taking Tamiflu had a 6X increased chance of death within 12 hours. Saying:\n\n“These data suggest Tamiflu use could induce sudden deterioration leading to death especially within 12 hours of prescription. These findings are consistent with sudden deaths observed in a series of animal toxicity studies, several reported case series and the results of prospective cohort studies. From “the precautionary principle” the potential harm of Tamiflu should be taken into account and further detailed studies should be conducted.”\n\nA January 24, 2008 new article about a 5-year-old girl who suffered severe hallucinations and seizure like convulsions stated to the media:\n\n“The flu is bad, it’s horrible, you feel helpless your child’s sick…I would take that a hundred times over the reaction she had to the Tamiflu.”\n\nThe next time you or your loved one experience flu like symptoms be careful which medication you use. There are many natural methods to shorten the duration of a flu or cold and reduce symptom related discomfort like elderberry syrup (find it here) These should be your first line of therapy and always consider if the symptoms are bad enough to risk permanent damage before you choose your therapy.\n\nThese wheatgrass flu shots are your answer to improved immunity and better health this winter season. Wheatgrass is one of the most effective healers, containing over 90 minerals, all 17 amino acids (building blocks of protein), and vitamins A, C, E, I, K and B-complex.\n\nFind the best quality here\n\nIt is also composed of 70% chlorophyll, which is one of the best blood-builders out there. Need I say more? all you need is just one shot a day – find it here", "opengraph": {"locale": "en_US", "type": "article", "title": "Tamiflu: One of the most dangerous medications on the market, especially for children", "description": "Serious Adverse Events, especially neuropsychiatric events associated with Tamiflu, started getting reported. Tamiflu dangers", "url": "https://anyavien.com/tamiflu-adults-and-kids-are-at-risk-of-hallucinations-seizures-and-sudden-death/", "site_name": "Anya Vien", "updated_time": "2020-01-23T00:45:26+00:00", "article:published_time": "2018-12-20T17:47:34+00:00", "article:modified_time": "2020-01-23T00:45:26+00:00", "image": "https://i0.wp.com/anyavien.com/wp-content/uploads/2018/12/na18-flu.jpeg?fit=1200%2C675&ssl=1", "image:width": "1200", "image:height": "675"}, "tags": [], "tweets": [], "movies": [], "links": ["https://amzn.to/2QG3xH0", "https://amzn.to/2LiSxcw", "https://amzn.to/2LiSxcw"], "authors": ["Anya"], "publish_date": "2018-12-20T17:47:34+00:00"}