{"result_id": "036004", "URL": "https://www.ae911truth.org/news/775-the-censorship-of-spike-lee-s-nyc-epicenters-is-a-tragically-fitting-end-to-the-last-20-years", "timestamp": "2023-04-25 12:07:50 CEST+0200", "meta": {"description": "Even the respected and dauntless filmmaker Spike Lee could not overcome the awesome wrath of the mainstream media that comes down upon any person of influence who dares challenge the official story of 9/11.", "lang": "en", "keywords": "", "favicon": "/templates/it_oxygen/favicon.ico", "canonical": "https://www.ae911truth.org/news/775-the-censorship-of-spike-lee-s-nyc-epicenters-is-a-tragically-fitting-end-to-the-last-20-years", "encoding": "utf-8"}, "image": null, "domain": "www.ae911truth.org", "title": "The censorship of Spike Lee’s NYC Epicenters is a tragically fitting end to the last 20 years", "cleaned_text": "Even the respected and dauntless filmmaker Spike Lee could not overcome the awesome wrath of the mainstream media that comes down upon any person of influence who dares challenge the official story of 9/11.\n\nIn a span of three days, from August 23rd to 26th, Lee went from staunchly defending his decision to include so-called “9/11 conspiracy theorists” in his eight-hour HBO docuseries, NYC Epicenters 9/11 → 2021½, to removing the entire 30 minutes he had devoted to questioning how the Twin Towers and Building 7 fell. The half-hour was part of the final two-hour episode set to air on the night of the 20th anniversary of 9/11.\n\nUnbeknownst to most people — because only members of the media got to view the episode and declare it unfit for the public to see — the 30 minutes of excised material included far more than just interviews with so-called “fringe architects.” (Actually, there were upwards of 10 architects and engineers, ranging from a San Francisco high-rise architect to a fellow of the Society of Fire Protection Engineers.) There were also interviews with 9/11 family members who believe they have not been told the truth about the murder of their loved ones and with first responders and survivors who witnessed explosions. Along with all those interviews was a wealth of archival footage and radio dispatches from that morning, in which rescuer after rescuer can be heard reporting explosions. (Full disclosure: I was also interviewed for the film.)\n\nInstead of painting a full and accurate picture of the now-excised section, the media seized upon the inclusion of “conspiracy group” Architects & Engineers for 9/11 Truth and our founder Richard Gage — who, in the words of Slate editor Jeremy Stahl, “is responsible for peddling some of the most pernicious and long-running lies about the 9/11 attacks.”\n\nStahl’s choice of words was clearly intended to imply, falsely, that Gage does not actually believe the view he is presenting but is, rather, knowingly perpetuating a lie for some nefarious purpose. Any person practicing real journalism who has interviewed Gage “multiple times” could not plausibly claim that Gage is lying. What Stahl was practicing was propaganda, the express goal of which was to stop millions of viewers from seeing the half-hour of documentary film that Lee made.\n\nThe death blow to Lee’s attempt to shine a light on the Twin Towers’ and Building 7’s controlled demolition appears to have been Stahl’s reporting of statements that Gage made in the past year in which he called the coronavirus pandemic a “hoax” and aired other related views about vaccines and Bill Gates. Stahl also loosely accused Gage of being anti-Semitic — or of condoning anti-Semitism — for having tolerated suggestions, made by an audience member in 2012 and by a podcast host more recently, that Israel’s Mossad was involved in the 9/11 attacks.\n\nLess than 24 hours after Stahl’s Slate article was published, news broke that Lee was “back in the editing room” reexamining the final chapter of the series. One day later, HBO announced that the entire half-hour had been cut.\n\nIf Lee had any say in the decision, I suspect he did what he did because he felt he could not defend keeping Gage, nor did he care to, and he didn’t have time for the massive edit that would have been required to remove Gage, who was central to the section. It may be that all of the other attacks did not faze him at all. However, the current narrative is that Lee capitulated to the totality of the media’s condemnation over featuring so-called “conspiracy theorists.”\n\nAt the height of the controversy and since, countless articles have been published referring to the controlled demolition theory as “debunked.” These articles either have no links to any sources, or they have links to Popular Mechanics articles from 10 years ago or more, or they have links to the very reports and FAQs issued by the National Institute of Standards and Technology that are disputed by thousands of architects, engineers, and scientists. (By the way, Lee and others make the point that fire isn’t hot enough to melt steel because there was molten metal at Ground Zero, not because the steel needed to melt for the buildings to collapse. This fact, as with all of the evidence of controlled demolition, has not been debunked.)\n\nA journalist friend at a serious investigative news outlet recently told me that on any other issue, relying on the articles of a pop-science magazine like Popular Mechanics to claim that a particular argument had been “debunked,” without doing one’s own research, would not pass as legitimate journalism. But when it comes to mainstream reporting of challenges to the official story of 9/11, we are not talking about journalism but propaganda.\n\nIndeed, for the past 20 years, the mainstream media have revealed themselves — at least those who have done the writing and editing about this issue — to be nothing more than a cult of denialists and propagandists when it comes to addressing what really happened on 9/11. The dictionary definition of a cult is “a group or sect bound together by veneration of the same thing, person, or ideal, etc.” In this case, that thing is the official story of 9/11.\n\nThus, the media’s response to Lee’s positive portrayal of controlled demolition proponents was especially swift and ferocious because it represented a profound threat to the object of their veneration.\n\nNot only was the half-hour too compelling, thanks to Lee’s “extraordinary directorial panache” and his inclusion of sympathetic figures like Bob McIlvaine, who believes an explosion killed his son while he was entering the North Tower, but Lee himself is about the most terrifying messenger the media could have imagined.\n\nHere is a man who is generally beloved by a wide cross section of the American public, from film buffs to sports fans to the Black community to progressives and beyond. He recently returned from being president of the Cannes Film Festival jury. He has produced and directed dozens of films, many of them highly acclaimed. And now he has just created seven-and-a-half hours of “exuberant,” “brilliant,” “poignant” documentary storytelling about Covid-19 and 9/11.\n\nHow could it be that Lee believes so strongly the Twin Towers and Building 7 were brought down with explosives that he wanted to dedicate essentially the final 30 minutes of his HBO docuseries to exploring, if not advocating, that view?\n\nUnable to even imagine the possibility of Lee and his guests being right, the media was forced to rationalize that Lee simply went off the deep end for a moment, “fraternizing with the truthers” on a “pet project” and almost committing a “career-defining offense,” in the words of The New Yorker’s Doreen St. Félix.\n\nControlled demolition denialism is so engrained in the culture of the media that an entire generation of young writers like St. Félix, who was eight years old in 2001, simply take at face value, without any curiosity or questions or serious research, the notion that the controlled demolition theory has been debunked. Somehow, they manage to look at the collapse of Building 7 and harbor no doubt whatsoever that fire brought it down. Such is the power of 20 years of propaganda that otherwise intelligent people like St. Félix end up doing the bidding — I will assume unwittingly — of whoever perpetrated the 9/11 attacks.\n\nIn the face of this relentless and dehumanizing propaganda machine, Lee’s intention to give voice to advocates of the controlled demolition theory on the 20th anniversary of 9/11 should be seen as a testament to the millions of hours of hard work put in by tens of thousands of activists over the past two decades (including those at Architects & Engineers for 9/11 Truth). Lee was ever-so-close to elevating their message to unseen heights and possibly creating a turning point in the now two-decades-long fight for truth and justice.\n\nBut it was almost too good to be true, at least right now. The censorship of Spike Lee’s documentary about 9/11 on the 20th anniversary of that day — when a conspicuous 90 minutes will air on HBO instead of two hours — is a tragically fitting end to the last 20 years of perpetual war, cover-up, and propaganda that have led to an unprecedented level of distrust of public institutions.\n\nLet us hope and do everything we can to ensure that the next 20 years will be different. There is little doubt in the minds of most people that the current trajectory of our society is unsustainable. Exposing the truth about 9/11 is essential to changing that trajectory.\n\nRelated article: Spike Lee’s 9/11 doc still has the building blocks he was laying for his controlled demolition exposé\n\nTed Walter is the director of strategy and development for Architects & Engineers for 9/11 Truth. He has authored several publications and writings on behalf of the organization, including the 2020 request for correction to NIST's final report on the collapse of World Trade Center Building 7, which is now the subject of an ongoing lawsuit against NIST.", "opengraph": {"title": "The censorship of Spike Lee’s NYC Epicenters is a tragically fitting end to the last 20 years", "description": "Even the respected and dauntless filmmaker Spike Lee could not overcome the awesome wrath of the mainstream media that comes down upon any person of influence who dares challenge the official story of 9/11.", "image": "https://www.ae911truth.org/images/articles/2021/Sept_2021/spike-lee_768.jpeg", "type": "article", "locale": "en_US", "url": "https://www.ae911truth.org/news/775-the-censorship-of-spike-lee-s-nyc-epicenters-is-a-tragically-fitting-end-to-the-last-20-years", "site_name": "AE911Truth"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe src=\"https://www.youtube.com/embed/9oVs_94VHk8\" width=\"560\" height=\"315\" title=\"YouTube video player\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\"/>", "src": "https://www.youtube.com/embed/9oVs_94VHk8"}, {"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe src=\"https://www.youtube.com/embed/zRpCwKRnL1M\" width=\"560\" height=\"315\" title=\"YouTube video player\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\"/>", "src": "https://www.youtube.com/embed/zRpCwKRnL1M"}], "links": ["https://www.nytimes.com/2021/08/23/arts/television/spike-lee-nyc-epicenters.html", "https://www.nytimes.com/2021/08/26/arts/television/spike-lee-911-edit.html", "https://www.vanityfair.com/hollywood/2021/08/spike-lees-911-doc-promoted-conspiracy-theories", "https://www.nytimes.com/2021/08/23/arts/television/spike-lee-nyc-epicenters.html", "https://slate.com/news-and-politics/2021/08/spike-lee-hbo-documentary-richard-gage.html", "https://youtu.be/9oVs_94VHk8", "https://www.vanityfair.com/hollywood/2021/08/spike-lees-911-doc-promoted-conspiracy-theories", "https://www.theatlantic.com/magazine/archive/2021/09/twenty-years-gone-911-bobby-mcilvaine/619490/", "https://www.newyorker.com/magazine/2021/09/13/the-messy-introspection-of-spike-lees-nyc-epicenters", "/news/779-spike-lee-s-9-11-doc-still-has-the-building-blocks-he-was-laying-for-his-controlled-demolition-expose", "https://files.wtc7report.org/file/public-download/RFC-to-NIST-WTC7-Report-04-15-20.pdf", "https://AE911Truth.org/nist"], "authors": ["Ted Walter"], "publish_date": "2021-09-10T21:42:51-07:00"}