{"result_id": "036008", "URL": "https://www.ae911truth.org/news/716-youtube-google-suppress-ae911truth-boost-authoritative-sources-like-nist", "timestamp": "2023-04-25 12:07:58 CEST+0200", "meta": {"description": "The suppression of alternative voices on the internet, including those who challenge the official story of\r\n9/11, is relentless. And it’s getting worse.\r\nThe censorship of non-mainstream viewpoints includes content created by Architects & Engineers for\r\n9/11 Truth. This practice, by online giants like Google, YouTube, Facebook, and Twitter, has been going\r\non for a long time but has been reaching a fever pitch over the past two or three years.", "lang": "en", "keywords": "", "favicon": "/templates/it_oxygen/favicon.ico", "canonical": "https://www.ae911truth.org/news/716-youtube-google-suppress-ae911truth-boost-authoritative-sources-like-nist", "encoding": "utf-8"}, "image": null, "domain": "www.ae911truth.org", "title": "YouTube, Google suppress AE911Truth, boost ‘authoritative’ sources like NIST", "cleaned_text": "The suppression of alternative voices on the internet, including those who challenge the official story of 9/11, is relentless. And it’s getting worse.\n\nThe censorship of non-mainstream viewpoints includes content created by Architects & Engineers for 9/11 Truth. This practice, by online giants like Google, YouTube, Facebook, and Twitter, has been going on for a long time but has been reaching a fever pitch over the past two or three years.\n\nIt is particularly YouTube and its parent company, Google, whose policies have made it more difficult to find AE911Truth and its content online.\n\nThis is all being done in the name of reducing “harm” allegedly created by “extremism” and “misinformation.” Mainstream accounts of events like 9/11 are more and more being shielded from scrutiny as material challenging them is either banned or made harder to find.\n\nMeanwhile, mainstream media are being held up as authorities on what is true and what isn’t. This effectively means that alternative journalists whose reports differ from those of the corporate media on the same subject are assumed to be spreading misinformation.\n\nInternet censorship is being carried out in a number of ways. A few years ago, YouTube began “demonetizing” videos that it considered inappropriate or problematic in some way. This did not affect AE911Truth directly, since the organization has never used the platform to generate advertising revenue.\n\nBut more recent moves are having an effect.\n\nAE911Truth videos won’t come up nearly as readily as they once did when someone searches for them on YouTube, nor are they as easy to find on Google. In fact, even when you type in the precise title of an AE911Truth video, you’re far more likely to find numerous mainstream outlets appearing ahead of what you are actually searching for. Sometimes you’ll see AE911Truth videos that have been re-posted on other YouTube channels.\n\nAge restriction is the newest form of censorship. An AE911Truth video of the Building 7 video billboard that was placed in Times Square in New York City was recently restricted to those 18 years of age and older.\n\nYou won’t get AE911Truth videos recommended for you by YouTube anymore, even when you have watched similar content, and YouTube’s “autocomplete” feature for searches now steers users away from AE911Truth and other “conspiracy” content.\n\nIn addition, many interviews given to independent journalists by AE911Truth founder Richard Gage have disappeared from the internet because those outlets’ YouTube channels have been deleted.\n\nCare to watch this video of our Building 7 video billboard that was placed in Times Square in New York City? You can't watch it on this website because it's been age-restricted by YouTube censors. You can only watch it if you click the link to go to YouTube, are logged in, and are 18 years or older.\n\nThe recent expansion of internet censorship has made it possible for Google and YouTube to hide content that challenges official narratives. AE911Truth’s first experience with this was in 2015 when the video Architects and Engineers: Solving the Mystery of Building 7, narrated by Ed Asner, was taken down by YouTube for supposedly contravening its policy on “spam, scams, and commercially deceptive content.”\n\nAt that time, the video had accumulated more than 1.5 million views. It was subsequently re-uploaded on YouTube and has since amassed another 400,000 views. But anyone watching the video on YouTube today would have no idea that nearly two million people had already watched it before them. As AE911Truth marketing director Jeff Long says, this has a clear effect on the weight the video carries in people’s minds.\n\nMaking it worse, he adds, is that when content is removed, “There is no way to contact anyone at the platform to find out what the problem was.”\n\nContrast the treatment of the Asner video with that of the 2009 video Why the Building (WTC7) Fell by the National Institute of Standards and Technology (NIST), which puts forward the provably false official government account of the building’s collapse. While AE911Truth’s videos have been made harder to find, those touting the official story of 9/11 have been boosted.\n\nTed Walter, AE911Truth’s director of strategy and development, recalls that the NIST video had only about 200,000 views by early 2019, a full decade after it was uploaded to YouTube, but that total had shot up to more than 700,000 by April of 2020. Now, just seven months later, it has topped 1.1 million.\n\nClearly, the official account of Building 7’s destruction is getting lots of help from YouTube. And this jump in viewers for the NIST video comes despite the fact that it has about 8,900 “dislikes” and just 3,200 “likes.” YouTube claims that the public’s reaction to a video factors into its visibility, but the negative reaction to this video has certainly not hurt its visibility, at least not since 2019.\n\nDoing some simple searches reveals how AE911Truth is being suppressed. When you search for “AE911Truth” and “Building 7” on Google, the first video that comes up is Explosive 9/11 Claims by the National Geographic. Second is NIST’s Why the Building (WTC7) Fell. To reach anything by AE911Truth, you have to scroll down to the ninth listing,\n\nSimilarly, when you search for “World Trade Center” and “controlled demolition” you have to scroll down to the fourth page to find anything from AE911Truth.org.\n\nThe current state of affairs wasn’t created all at once; it has come in stages.\n\nIn June 2017, Google announced steps it was taking to fight “terrorism online.” These included using technology to identify terrorist content more quickly and to prevent removed content from being re-uploaded; using “independent experts” in their Trusted Flagger program to judge content; and taking a harder stance against videos that they consider problematic even though they don’t violate policies.\n\nIn January 2019, YouTube’s official blog included this statement about its plans to reduce the spread of content that “comes close to — but doesn’t quite cross the line of\" violating its community guidelines:\n\n“To that end,” YouTube’s blog stated, “we’ll begin reducing recommendations of borderline content and content that could misinform users in harmful ways—such as videos promoting a phony miracle cure for a serious illness, claiming the earth is flat, or making blatantly false claims about historic events like 9/11.”\n\nOf course, when they say “blatantly false claims” about 9/11, they mean those that diverge from the official narrative. Not only are the real blatantly false claims by NIST and other official sources not penalized, they are rewarded.\n\nIn June 2019, YouTube announced new measures to tackle “hate” and reduce “harmful content.” The company laid out the four pillars of their approach: removing violative content, raising up authoritative content, reducing the spread of borderline content, and rewarding trusted creators.\n\nAgain, those questioning the official 9/11 story are being considered “borderline,” while those affirming the story are among the “trusted creators” who are producing “authoritative content.”\n\nOne of the leading voices against this censorship has been investigative journalist James Corbett of The Corbett Report, who posited at AE911Truth’s recent “Justice Rising: 9/11 in 2020” conference that increasing internet censorship is “the modern-day equivalent of book burning.”\n\nHe pointed out that it’s not necessary for alternative information to be deleted from all corners of the internet for it to essentially be unusable. It is only necessary to make it difficult or impossible to find. And that’s where Google, as the internet’s “index,” and YouTube, as the internet’s repository of video material, wield enormous power.\n\n“That should concern us all for reasons that are self-evident,” Corbett said.\n\nCorbett recently held a “Goodbye, YouTube!!! party” on his Corbett Report, featuring guests who have had their channels deleted by the site.\n\nWhile AE911Truth has mainly been penalized by YouTube and Google, internet censorship goes well beyond these two giants. Facebook has closed thousands of pages, and it routinely blocks millions of posts every month, sometimes leading to the temporary banning of those doing the posting. In August 2020, Facebook announced that it had blocked 22 million posts in just three months.\n\nGlenn Greenwald, in a recent article in The Intercept titled “Facebook and Twitter Cross a Line Far More Dangerous Than What They Censor,” wrote that censorship is “an instrument of status quo preservation.”\n\n“Facebook is not some benevolent, kind, compassionate parent or a subversive, radical actor who is going to police our discourse in order to protect the weak and marginalized or serve as a noble check on mischief by the powerful. They are almost always going to do exactly the opposite: protect the powerful from those who seek to undermine elite institutions and reject their orthodoxies.”\n\nIronically, shortly after that article was published, Greenwald resigned from The Intercept in protest over another one of his articles that he says was being censored by his own editors.\n\nEven blogging engines like WordPress and email distribution services like Mailchimp have gotten into the act. WordPress purged thousands of blogs and other sites starting in 2018, without any warning and without any reason given for the decisions. (This author’s website was among those deleted.)\n\nMore recently, Mailchimp, a popular online email distribution service, began closing many accounts, including those of Dan Dicks’ Press for Truth (which has also been deplatformed by YouTube, Facebook, and Twitter) and the 9/11 and Other Deep State Crimes Teleconference (of which this author is a co-facilitator and which often involves participation from AE911Truth staffers).\n\nWhile no reason was given to the account holders, Mailchimp is a funding partner of the Centers for Disease Control Foundation, and it has agreed to close accounts of users for sharing “anti-vaccination content.” Immediately before the teleconference had its Mailchimp account terminated, its monthly agenda had included a speaker on vaccines from Physicians for Informed Consent.\n\nThe ever-expanding censorship by Google, YouTube, Facebook, Twitter, and others has encouraged many to move to other platforms, which is happening in larger numbers all the time. While AE911Truth, like Corbett, still has a presence on YouTube, it is following his lead by making its content available on multiple platforms. (An upcoming AE911Truth announcement will provide details about this.)\n\nJeff Long says there is always the danger that some of these alternative platforms will begin censoring, too, which is why it will be important to post on sites that are decentralized so that content cannot be removed by any “authority.”\n\nThe deck is stacked, folks; the table is tilted. Mainstream content that covers up the crimes of the Deep State is gaining yet another advantage over dissident voices. And the censorship is only going to get worse. The alternative for those whose voice is being suppressed, which includes AE911Truth, is to find innovative ways to get the message out by using platforms that offer a level table and no censorship.\n\nUpdate: Speaking of censorship, the above video is an example of the ultimate censorship, deplatforming. Truth Factory's entire channel was just deleted for \"wrong speak,\" here in January 2023. I've reposted it below, keeping the above YouTube blackscreen, to show it is only getting worse. Each week, I have to go through our website to find \"dead\" videos that the \"thought police\" have found problematic, whether our own content or other researchers.\n\nThis illustrates the need for backup channels and platforms. It'a laborious process, when you have thousands of videos, such as our own video channel, but if you don't, you disappear, hence why I've created backups on our other channels, Rumble, Odysee and Bitchute. If you find videos you like, you should back them up on your own blockchain/torrent channels for redundancy, to keep the truth flowing.", "opengraph": {"title": "YouTube, Google suppress AE911Truth, boost ‘authoritative’ sources like NIST", "description": "The suppression of alternative voices on the internet, including those who challenge the official story of 9/11, is relentless. And it’s getting worse.", "image": "https://www.ae911truth.org/images/articles/2020/Nov_2020/silicon_valley_technocracy_censorship_light.jpg", "type": "article", "locale": "en_US", "url": "https://www.ae911truth.org/news/716-youtube-google-suppress-ae911truth-boost-authoritative-sources-like-nist", "site_name": "AE911Truth"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "768", "height": "432", "embed_code": "<iframe src=\"https://www.youtube.com/embed/n4xtcn6-5yw\" width=\"768\" height=\"432\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\"/>", "src": "https://www.youtube.com/embed/n4xtcn6-5yw"}, {"embed_type": "iframe", "provider": "youtube", "width": "768", "height": "432", "embed_code": "<iframe src=\"https://www.youtube.com/embed/hqUqioYaze0\" width=\"768\" height=\"432\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\"/>", "src": "https://www.youtube.com/embed/hqUqioYaze0"}], "links": ["https://youtu.be/n4xtcn6-5yw", "https://youtu.be/n4xtcn6-5yw", "https://web.archive.org/web/20200301160158/https://www.blog.google/around-the-globe/google-europe/four-steps-were-taking-today-fight-online-terror/", "https://web.archive.org/web/20201120151344/https://blog.youtube/news-and-events/our-ongoing-work-to-tackle-hate", "/justicerising", "https://www.corbettreport.com/goodbye-youtube-party-video/", "https://web.archive.org/web/20201122114402/https://www.pnas.org/content/111/24/8788.full", "https://reclaimthenet.org/facebooks-deletes-22-5m-posts-for-hate-speech/", "https://web.archive.org/web/20201121014610if_/https://theintercept.com/2020/10/15/facebook-and-twitter-cross-a-line-far-more-dangerous-than-what-they-censor/", "http://911freefall.com/9-11-free-fall-11-15-18-craig-mckee-censored/", "https://mvc.freedomsphoenix.com/News/292956-2020-10-22-press-for-truth-under-coordinated-attack-as-mailchimp-terminates-account.htm", "https://web.archive.org/web/20200103180059/https://www.nbcnews.com/tech/tech-news/email-marketer-mailchimp-bans-anti-vaccination-content-n1017221", "https://web.archive.org/web/20200116163321/https://help.twitter.com/en/rules-and-policies/sexual-exploitation-policy", "https://web.archive.org/web/20201009234556/https://www.opensecrets.org/orgs/recipients?id=d000067823", "http://www.anolink.pro/b?link=https://www.darpa.mil/program/social-media-in-strategic-communication", "https://twitter.com/TruthFactoryCat", "https://rumble.com/c/c-1727331", "https://odysee.com/$/invite/@AE911Truth:9", "https://www.bitchute.com/channel/ae911truth/", "https://twitter.com/TruthFactoryCat"], "authors": ["Craig McKee"], "publish_date": "2020-11-24T18:54:09-08:00"}