{"result_id": "036002", "URL": "https://www.ae911truth.org/news/744-lawyers-committee-targets-sham-fbi-probe-of-2001-anthrax-attacks", "timestamp": "2023-04-25 12:07:48 CEST+0200", "meta": {"description": "Exposing this connection could become much easier if the Lawyers’ Committee for 9/11 Inquiry (LC911) is successful in getting the U.S. Congress to launch a new investigation into the hugely significant but often overlooked anthrax attacks.", "lang": "en", "keywords": "", "favicon": "/templates/it_oxygen/favicon.ico", "canonical": "https://www.ae911truth.org/news/744-lawyers-committee-targets-sham-fbi-probe-of-2001-anthrax-attacks", "encoding": "utf-8"}, "image": null, "domain": "www.ae911truth.org", "title": "Lawyers' Committee targets sham FBI probe of 2001 anthrax attacks", "cleaned_text": "We know that the anthrax attacks of 2001 were not carried out by Muslim terrorists, but what many of us may not know is that these attacks provide strong evidence that 9/11 wasn’t either.\n\nExposing this connection could become much easier if the Lawyers’ Committee for 9/11 Inquiry (LC911) is successful in getting the U.S. Congress to launch a new investigation into the hugely significant but often overlooked anthrax attacks.\n\nTo this end, LC911 has laid out its rationale for wanting the case reopened in a 78-page petition that was sent to Congress on October 15, 2020. The petition is accompanied by 69 exhibits. All of this material can be viewed on the LC911 website (LCfor911.org).\n\nLC911 contends that the official narrative of the anthrax attacks is false and that it, like 9/11, involved both a cover-up of what really happened and accusations against innocent parties.\n\n“It’s after 9/11, but we look at it as being connected,” LC911 president David Meiswinkle, who is also a member of his organization’s anthrax committee, explained in an interview. “We did anthrax in part because no one has done it. There is no Architects & Engineers [for 9/11 Truth] for anthrax.”\n\nAn essential finding of LC911’s investigation is that the man the FBI and the Department of Justice claim was the sole perpetrator of the attacks, Dr. Bruce Ivins, not only wasn’t responsible but couldn’t have been.\n\nIvins was a microbiologist who worked on anthrax vaccine development at the United States Army Medical Research Institute of Infectious Diseases (USAMRIID) at the Fort Detrick military base in Maryland until his apparent suicide in July 2008. It was only after his death that he was publicly named by the FBI as its primary suspect.\n\nThe first wave of letters containing dried anthrax spores was sent one week after 9/11 to a number of locations, including several media outlets. A second wave went out the following month, and these contained a much deadlier variety, with spores that are so concentrated (one trillion spores per gram) that they behaved almost like a gas, Meiswinkle explains.\n\nAmong the targets of this second wave were U.S. senators Patrick Leahy and Tom Daschle. Both were resisting the effort to get the Patriot Act passed, and LC911 contends they were targeted to accelerate passage of the bill, something that Vice-President Dick Cheney was pushing hard for.\n\nFive people died in the attacks, including two postal workers, and 17 were injured.\n\nThe letters themselves contained references to 9/11 and suggested that both 9/11 and the anthrax attacks were the work of Muslim terrorists. Then anthrax used was also determined to be from the Ames strain, which is known to be used by the U.S. military, although it is also held by other countries.\n\nFour of the actual letters were recovered, two from the first group of letters and two from the second.\n\nThe two from the group first read:\n\n09-11-01\n\nTHIS IS NEXT\n\nTAKE PENACILIN NOW [sic]\n\nDEATH TO AMERICA\n\nDEATH TO ISRAEL\n\nALLAH IS GREAT\n\nThe ones from the second group contained similar language and presentation:\n\n09-11-01\n\nYOU CAN NOT STOP US.\n\nWE HAVE THIS ANTHRAX.\n\nYOU DIE NOW.\n\nARE YOU AFRAID?\n\nDEATH TO AMERICA.\n\nDEATH TO ISRAEL.\n\nALLAH IS GREAT.\n\nIt is significant that, in accusing Ivins, the U.S. government was admitting that the anthrax attacks, which the letters appeared to blame on Muslim extremists, were actually most likely to have originated in a U.S. military facility.\n\nProminent 9/11 researcher Graeme MacQueen, also a member of LC911’s anthrax committee and author of the 2014 book The 2001 Anthrax Deception: The Case for a Domestic Conspiracy, says the fact that we know the anthrax did not come from Muslim terrorists is hugely revealing about 9/11.\n\n“What we’re being told is that on September 11th real Islamic terrorists attacked New York and Washington and killed a bunch of people,” he says, “and starting about a week later, fake Islamic terrorists — because they pretended in their letters to be Islamic terrorists — who were people actually embedded in the U.S. military, attacked and killed a bunch of people in Washington and New York.\n\n“It strains credibility. It would make anyone ask, if the second one was fake then maybe the first one was too.”\n\nMacQueen says LC911 took a different approach with its petition than he did in his book, focusing on scientific evidence that can be positively verified.\n\n“[The book and the petition] complement each other, you could say, but they are not the same.”\n\nIn The 2001 Anthrax Deception (chapter 7, page 134), MacQueen addresses a stunning link between the anthrax attacks and 9/11 in the form of a connection between several of the alleged 9/11 hijackers and the first person to die in the anthrax attacks.\n\nOne of the anthrax letters was sent to the now-defunct Sun newspaper in Boca Raton, Florida. The paper was owned by American Media Inc., the same company that owns the National Enquirer. Robert Stevens was a photo editor at the Sun, and he was the first to die after coming into contact with the anthrax.\n\nMike Irish was the paper’s editor in chief, and he had known Stevens for 25 years. Mike Irish’s wife, Gloria, was a real estate agent who helped two of the alleged hijackers (Marwan al-Shehhi and Hamza al-Ghamdi) find apartments in the summer of 2001. Each of these apartments was shared by two of the alleged “hijackers.” Al-Shehhi was said to be a close friend of alleged Flight 11 pilot Mohammed Atta, who he once stayed with in Hamburg, Germany.\n\nGloria Irish had previously found a house for Stevens. The assertion that it’s just a coincidence that the first anthrax victim shared a real estate agent with two alleged 9/11 hijackers isn’t credible, MacQueen contends.\n\nIn addition, Mike Irish, a licensed pilot, was a former member of the Civil Air Patrol based at the airport in Lantana, Florida. This is the same airport where Atta is supposed to have rented a plane in 2001. Stevens lived in Lantana.\n\nThe connections between Gloria Irish and the alleged hijackers were actually reported by several major media in October 2001, but this was before the anthrax attacks had come to light and before the connection to Stevens was clear.\n\nIvins’ colleagues say he was innocent\n\nWhile Bruce Ivins was publicly accused of the crime only after his apparent suicide, LC911’s research shows that the FBI had previously targeted other scientists with harassment and surveillance. All of them, Meiswinkle contends, appear to have been innocent of any involvement.\n\nHe explains that one of the ways LC911’s anthrax committee developed its bank of evidence was by connecting with four scientists who worked with Ivins at Fort Detrick. These four — two were colonels and one was a lieutenant colonel — have provided statements as well as important documents to LC911 that the public has not seen before.\n\nThe USAMRIID scientists, Meiswinkle says, “all agreed that Ivins was the patsy, basically, the fall guy. And he was innocent. They knew him. They knew he couldn’t do that, that he didn’t have the capability to do it.”\n\nLC911 also reached out to Richard Lambert, was in charge of the FBI’s “Amerithrax” investigation from 2002–2006. Lambert, who, in a federal court complaint, detailed obstruction by his FBI superiors, told LC911 representatives he met with that they would have to get Congress to subpoena the 2,000-page report he produced for the FBI because the material is classified. While he could not divulge what is in the report, he was able to confirm that 16 of those pages contain information exonerating Ivins.\n\nLC911 lists five primary conclusions it has reached about the anthrax attacks and the FBI investigation of the attacks in the executive summary of its petition to Congress, which states:\n\n1. The FBI’s sole identified anthrax killer, Dr. Bruce Ivins, a distinguished scientist with a 28-year career at U.S. Army’s Medical Research Institute, was innocent and an unfortunate scapegoat of FBI contrivance.\n\n2. The FBI intentionally, by concealing and avoiding key evidence, steered its investigation away from the most likely suspects, personnel associated with Dugway Proving Grounds, Batelle Memorial Institute, and their contractual CIA partner, and institutions and individuals associated with them, and concentrated on the least likely suspects, scientists from the United States Army Medical Institute of Infection Diseases (USAMRIID), and prematurely concluded its investigation upon the death of Dr. Ivins. \n\n3. Congressional involvement is necessary as the Department of Justice has a conflict of interest in investigating its own alleged misconduct.\n\n4. Those responsible for the anthrax attacks are still at large and the Nation remains in peril.\n\n5. The attacks appear to have been intended to rush passage of the United States Patriot Act, thus undermining civil liberties, facilitating a War on Iraq predicated on nonexistent weapons of mass destruction and inaugurating the War on Terror, which continues to this day.\n\nAnthrax committee member Dr. Meryl Nass has been an expert on the subject of anthrax and anthrax vaccines for 30 years. She took an additional interest in this case because she was friends with Ivins, who she is convinced was framed by the FBI.\n\n“The fact that he was a friend of mine gave me a reason to pursue this all these years,” she said in an interview.\n\n“The vast majority of the country thinks the case was never solved or that Ivins did it,” she adds. “That’s unfortunately how Americans are about many issues. They’ve been covered once with a flurry of activity and then facts come out gradually that challenge the original narrative, and people never become aware of these facts.”\n\nShe explains that not only did Ivins work exclusively with liquid anthrax — not the powdered variety used in the attacks — but the FBI could not find even a trace of either of the contaminant bacterium present in the first set of letters nor the silicon signature found in the second used in the attacks in Ivins’ Fort Detrick workplace. She says it would be impossible to remove such traces, if they existed.\n\n“The FBI had fumbled along building a case against one perpetrator after another,” she says. “And they went from one person to another with no direct evidence for any of them.”\n\nNass says she learned from the Fort Detrick scientists that Ivins’ apparent suicide made him an easy and convenient “culprit” for the FBI to settle on.\n\n“I learned basically that the FBI had been harassing several of them,” she says, “and that they felt there had been several people that the crime could have been pinned on, and that Bruce was the first one to break and to commit suicide, and that gave the FBI their man.”\n\nThe pressure on Ivins during this period was enormous, she adds.\n\n“You take someone who is frail emotionally, and you pound on them for a year. You tell them you are about to accuse them of multiple murders and that you have the powers of the federal government to pin this on them.”\n\nThe FBI commissioned the National Academy of Science’s National Research Council (NRC) to assess the scientific basis for its conclusion that Ivins was the guilty party. The NRC’s 2011 report fell short of supporting the FBI’s claim that it had conclusively proven Ivins’ guilt, however.\n\nThe FBI claimed it had conclusively proven that the anthrax batch Ivins was working with at Fort Detrick, known as RMR-1029, was where the spores used in the attacks had come from. The NRC report contradicted this claim, stating that while the anthrax spores used in the attacks were “consistent with” spores Ivins worked with, there was no proof that they were the same.\n\nNass points out that on page 55 of the report, “consistent with” is defined: “The expression “consistent with” is frequently used in this report and conveys the weakest level of certainty (greatest amount of uncertainty). In general, when the term “consistent with” is used, it means that an association may or may not be present; the available data can neither rule out nor confirm an association.”\n\nNass says that since 2001, biological warfare research has hugely expanded around the world.\n\n“The preponderance of this massive bio-defense infrastructure that has developed in the United State, China, and elsewhere is, to a great extent, a consequence of the anthrax letters.”\n\nLC911 board member and 9/11 researcher Barbara Honegger — who chronicled the connections between the anthrax attacks and 9/11 in a 2008 article — appeared at AE911Truth’s “Justice Rising: 9/11 in 2020” conference last September (along with fellow board members Meiswinkle and Mick Harrison) — to discuss LC911’s anthrax work.\n\nDuring her talk, she said the attacks could offer the breakthrough needed to expose the 9/11 deception.\n\n“… the government first wanted you to believe that it was a foreign organization, al-Qaeda, that was behind the anthrax attacks but only long enough to get their Patriot Act rushed through Congress,” she said, “Then and now they want you to believe that 9/11 and the anthrax attacks are completely unrelated, that a lone nut terrorist named Bruce Ivins did the entire thing himself.”\n\nShe suggests that the lie that Ivins was responsible is being used by the government to hide the fact that the same “domestic terrorists” — or at least some of the same ones — that were responsible for 9/11 also pulled off the anthrax attacks.\n\nMeiswinkle says the goal is ultimately to get the evidence in front of a grand jury. LC911 has already submitted a grand jury petition concerning the World Trade Center evidence and plans to address both the Pentagon and Shanksville elements of 9/11 in the months ahead. It is also considering focusing on government obstruction, which he says is present in both 9/11 and the anthrax attacks.\n\nIf successful in getting Congress to investigate the anthrax attacks, LC911 could not only exonerate an innocent man, but it could open the eyes of many to the fact that these lesser-understood attacks provide powerful insights into the truth about 9/11 itself.", "opengraph": {"title": "Lawyers' Committee targets sham FBI probe of 2001 anthrax attacks", "description": "We know that the anthrax attacks of 2001 were not carried out by Muslim terrorists, but what many of us may not know is that these attacks provide strong evidence that 9/11 wasn’t either.", "image": "https://www.ae911truth.org/images/articles/2021/Mar_2021/FBI_Anthrax_Cover-Up_1024_v4.jpg", "type": "article", "locale": "en_US", "url": "https://www.ae911truth.org/news/744-lawyers-committee-targets-sham-fbi-probe-of-2001-anthrax-attacks", "site_name": "AE911Truth"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "768", "height": "432", "embed_code": "<iframe src=\"https://www.youtube.com/embed/92uOWAQ9Nu8\" width=\"768\" height=\"432\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/92uOWAQ9Nu8"}], "links": ["https://www.lawyerscommitteefor9-11inquiry.org/lawyers-committee-anthrax-petition/", "https://www.lawyerscommitteefor9-11inquiry.org/anthrax-congressional-petition-exhibit/", "/news/643-9-11-and-anthrax-an-interview-with-dr-graeme-macqueen", "/news/643-9-11-and-anthrax-an-interview-with-dr-graeme-macqueen", "https://www.lawyerscommitteefor9-11inquiry.org/anthrax-petition-executive-summary/", "https://www.opednews.com/articles/Anthrax-Links-to-9-11-by-Barbara-Honegger-080925-678.html"], "authors": ["Craig McKee"], "publish_date": "2021-03-08T18:53:46-08:00"}