{"result_id": "036007", "URL": "https://www.ae911truth.org/news/374-news-media-events-ae911truth-enters-science-march-with-wtc-evidence", "timestamp": "2023-04-25 12:07:57 CEST+0200", "meta": {"description": "AE911Truth is a nonprofit organization that represents more than 3,000 architects and engineers who are calling for a new investigation into the destruction of the World Trade Center Twin Towers and Building 7 on 9/11.", "lang": "en", "keywords": "", "favicon": "/templates/it_oxygen/favicon.ico", "canonical": "https://www.ae911truth.org/news/374-news-media-events-ae911truth-enters-science-march-with-wtc-evidence", "encoding": "utf-8"}, "image": null, "domain": "www.ae911truth.org", "title": "AE911Truth Enters Science March with WTC Evidence", "cleaned_text": "Rachel Colton organized a coalition of 9/11 Truth volunteers to attend the recent March for Science. “Why?” you may be asking. Because she believes that scientists can — and do — help uncover the truth behind 9/11 — especially the cause of World Trade Center Building 7's collapse.\n\n“A building will not descend at free-fall acceleration unless the structure underneath has been removed” by demolition explosives, maintains Colton, who represented Architects & Engineers for 9/11 Truth at the Washington, D.C., march on April 22nd — Earth Day.\n\nWhile holding an AE911Truth sign and passing out flyers with fellow volunteers, Colton attracted a good deal of attention, had a number of memorable conversations, and read the signs held by other attendees of the event.\n\nShe shares her observations here:\n• “A common sign at the march said, ‘Science does not take sides.’ I found this interesting, because there are several controversial issues in science — vaccines, climate change, 9/11. The problem seems to be that the research is not unbiased. The individuals and groups behind the research have an agenda that's driven by power or money or something else.”\n• “Another sign said, 'Science is not a liberal conspiracy.' As a 9/11 activist, I cringe at the word 'conspiracy.' It's used to discount alternative theories without considering the evidence behind them. I have taken that word out of my vocabulary.”\n• “A man stopped to talk to us and said that we were 'on to something,' but mostly he wanted to talk about who planned the attacks of 9/11. He said that we [AE911Truth] would have to be the ones to do an investigation. Then he mentioned [New York City Mayor Rudy] Giuliani having foreknowledge and Building 7 being evacuated.”\n• “A man who claimed to be a structural engineer said he was unhappy with us. 'They already studied the collapses,' he said, referring to NIST. He continued, ‘It was the planes [striking the Twin Towers] and the ensuing fires [that caused the collapses].’ I asked him about Building 7, pointing out that NIST won't release its data and that the building was in free fall for 2.5 seconds of its 7-second collapse. When I pressed him to explain this, he dodged the question. I told him if he was interested in learning more about Building 7, he could go to our website.”\n• “During the march, a woman came alongside me and confided, ‘They hauled those buildings down to NIST where I work.’ I told her she needs to get NIST to release its data on Building 7. She didn’t seem to be aware that they hadn’t and said she was going to ask someone about that. I offered her a pamphlet, but she refused and explained, ‘They aren’t very nice to women over at NIST.’”\n• “A man walked by and said something along the lines of, ‘The planes hit [the Twin Towers], there was fire, and four stories of sheetrock blew the buildings apart like a grenade.’ I didn't respond. I'm not an engineer or an architect or a physicist, but I’m pretty sure four stories of sheetrock will not blow up a 100-plus-story building like a grenade.”\n• “Later in the march, a woman came up to me. I offered her a pamphlet, but she refused it. I asked her if she knew of Building 7. She said she wasn't aware of it, so I told her it was a third World Trade Center tower that fell — allegedly from fires — in the late afternoon of 9/11. I also told her that NIST was responsible for explaining its collapse but won't release the data for other scientists to verify. Upon hearing that, she took the pamphlet.”\n• “When I was standing in the rain on the lawn near the main stage next to two large AE911Truth banners and holding a World Trade Center Building 7 sign, a man came over, stood next to me, and shared his umbrella. We commiserated over not being able to trust the government and its psychological manipulation of the population. We also grumbled about not being able to trust the mainstream media and not knowing who to trust in the alternative media. He kindly gave me his umbrella and two hand warmers.”\n\nFor an interview with Rachel Colton, click here.", "opengraph": {"title": "AE911Truth Enters Science March with WTC Evidence", "description": "“I'm not an engineer or an architect or a physicist, but I’m pretty sure a 100-plus-story building doesn't fall apart like that.” – Rachel Colton", "image": "https://www.ae911truth.org/images/blog/Rachel-March-DC-1-header-rgb-768-v2.jpg", "type": "article", "locale": "en_US", "url": "https://www.ae911truth.org/news/374-news-media-events-ae911truth-enters-science-march-with-wtc-evidence", "site_name": "AE911Truth"}, "tags": [], "tweets": [], "movies": [], "links": ["/news/375-news-media-events-activist-rachel-colton-shares-her-9-11-personal-journey.html"], "authors": ["Mark Oliver"], "publish_date": "2017-05-03T09:37:16-07:00"}