{"result_id": "036001", "URL": "https://www.ae911truth.org/news/238-news-media-events-shure-part-19-government-manipulation-and-the-big-lie", "timestamp": "2023-04-25 12:07:46 CEST+0200", "meta": {"description": "AE911Truth is a nonprofit organization that represents more than 3,000 architects and engineers who are calling for a new investigation into the destruction of the World Trade Center Twin Towers and Building 7 on 9/11.", "lang": "en", "keywords": "", "favicon": "/templates/it_oxygen/favicon.ico", "canonical": "https://www.ae911truth.org/news/238-news-media-events-shure-part-19-government-manipulation-and-the-big-lie", "encoding": "utf-8"}, "image": null, "domain": "www.ae911truth.org", "title": "Part 19: Government Manipulation and the Big Lie", "cleaned_text": "Editor's Note: Frances Shure, M.A., L.P.C., has performed an in-depth analysis addressing a key issue of our time: \"Why Do Good People Become Silent — or Worse — About 9/11?\" The resulting essay, being presented here as a series, is a synthesis of both academic research and clinical observations.\n\nPlease note that because Architects & Engineers for 9/11 Truth is dedicated to researching and disseminating scientific information about the destruction of three World Trade Center skyscrapers on September 11, 2001, and does not speculate as to the identity or motives of the perpetrators, any reference to names or motives of the attackers in this series of articles, made by either the author or the individuals she quotes, is a personal opinion and not the viewpoint of AE911Truth.\n\nOften the people I speak with about 9/11 divulge the reasons they simply cannot “get their heads around” the assertion that it was perpetrated by government insiders. They have told me, variously, that this claim is “just too extreme,” that “no one in their right mind would have tried to pull something like this off,” and that “even if they had been crazy enough to think about or even plan such an evil deed, they would have been too scared to carry it out, because they would be lynched should they be found out.”\n\nPower-crazed leaders who plan and orchestrate false flag operations count on such defensive reactions and flawed reasoning. They are aware that the ordinary person cannot fathom that their leaders would mass murder their fellow citizens and then blame the attack on another entity. Most good people find such an allegation too outrageous — too outside the bounds of human decency to even consider.\n\nAdolf Hitler Some of us have read the famous quote by Adolf Hitler about the “big lie.” Often this quote is taken out of context, so that the reader believes Hitler is boldly advocating for the big lie as a fail-safe strategy to manipulate citizens. I believed this misinformation until a friend pointed out that Hitler was actually blaming “the Jews” for telling such colossal lies. Upon finding the source of Hitler’s quote in Mein Kampf, I discovered that my friend was correct.\n\nNevertheless, I will argue for what seems to me to be self-evident: Although these written words were indeed one portion of his railing against the Jewish people, Hitler himself was indeed an adept practitioner of the big lie. Later in this section, we will see that this infamous leader was not alone in his capacity to perpetrate atrocities and then to tell a big lie about them to keep the truth from the public. We will consider the parallel between the Nazi big lies and the great deceptions surrounding the attacks of September 11, 2001.\n\nBut it remained for the Jews, with their unqualified capacity for falsehood, and their fighting comrades, the Marxists, to impute responsibility for the downfall [of Germany in World War I] precisely to the man who alone had shown a superhuman will and energy in his effort to prevent the catastrophe which he had foreseen and to save the nation from that hour of complete overthrow and shame. By placing responsibility for the loss of the world war on the shoulders of Ludendorff they took away the weapon of moral right from the only adversary dangerous enough to be likely to succeed in bringing the betrayers of the Fatherland to Justice. All this was inspired by the principle — which is quite true within itself — that in the big lie there is always a certain force of credibility; because the broad masses of a nation are always more easily corrupted in the deeper strata of their emotional nature than consciously or voluntarily; and thus in the primitive simplicity of their minds they more readily fall victims to the big lie than the small lie, since they themselves often tell small lies in little matters but would be ashamed to resort to large-scale falsehoods. It would never come into their heads to fabricate colossal untruths, and they would not believe that others could have the impudence to distort the truth so infamously. Even though the facts which prove this to be so may be brought clearly to their minds, they will still doubt and waver and will continue to think that there may be some other explanation. For the grossly impudent lie always leaves traces behind it, even after it has been nailed down, a fact which is known to all expert liars in this world and to all who conspire together in the art of lying. These people know only too well how to use falsehood for the basest purposes. [Emphasis added.]\n\nFrom time immemorial. [sic] the Jews have known better than any others how falsehood and calumny can be exploited. Is not their very existence founded on one great lie, namely, that they are a religious community, whereas in reality they are a race? And what a race! One of the greatest thinkers that mankind has produced has branded the Jews for all time with a statement which is profoundly and exactly true. Schopenhauer called the Jew “The Great Master of Lies.” Those who do not realize the truth of that statement, or do not wish to believe it, will never be able to lend a hand in helping Truth to prevail.1\n\nClearly, Adolf Hitler was irrationally accusing all Jewish people of being base liars, capable of telling “colossal untruths.” The question now becomes: Was Adolf Hitler himself capable of telling the “big lie?” Or was he innocent of such deceptions?\n\nLet’s take a look at Hitler’s actions, as opposed to his words. First, we will examine the company he kept and whom he appointed to his cabinet. Secondly, we’ll study his direct actions to determine if this leader promoted big lies.\n\nPaul Joseph Goebbels was one of Hitler’s closest associates. Goebbels strongly supported the genocide of the Jewish people when the Nazi leadership developed their “final solution for the Jewish question” — that chilling euphemism for the eventual extermination of all Jewish people.2\n\nIn 1933 Hitler appointed Goebbels to the cabinet position of Minister of Public Enlightenment and Propaganda, a position he held until 1945.\n\nAlthough the timing of these quotes in unknown, Goebbels reportedly said:\n\nThink of the press as a great keyboard on which the government can play.3\n\n\n\n The most brilliant propagandist technique will yield no success unless one fundamental principle is borne in mind constantly — it must confine itself to a few points and repeat them over and over.4 \n\n\n\n If you tell a lie big enough and keep repeating it, people will eventually come to believe it. The lie can be maintained only for such time as the State can shield the people from the political, economic and/or military consequences of the lie. It thus becomes vitally important for the State to use all of its powers to repress dissent, for the truth is the mortal enemy of the lie, and thus by extension, the truth is the greatest enemy of the State. 5 [Emphasis added.]\n\nHermann Wilhelm Göring, another close associate of the Führer, was appointed commander-in-chief of the Luftwaffe (air force) in 1935, a position he held until the final days of WWII. In 1940 Hitler promoted him to the rank of Reichsmarschall, a special rank that was senior to all other Wehrmacht (armed forces of Germany from 1935 to 1946) commanders. In 1941 Hitler designated Göring as his successor and deputy in all his offices.\n\nBy 1942, however, Göring’s standing with Hitler was reversed when the Luftwaffe failed to fulfill its commitments and the German war effort was stumbling on both fronts.\n\nGustave Mark Gilbert In his book, Nuremberg Diary, Gustave Mark Gilbert, who was appointed to the position of prison psychologist for the German prisoners during the Nuremberg trials, presents a clear window into Göring’s ability to tell a big lie in order to manipulate citizens to go to war. During these trials, Gilbert, a Jewish American who spoke fluent German, became the confidant of many men in the Nazi leadership, dialoguing with them in their cells, the lunchroom, and other informal locations. Gilbert also carefully observed the defendants’ behavior during the proceedings, meticulously writing down his observations in his diary, which became the basis for his book. The following well-known quote by Hermann Göring is from one of his interviews with Gilbert:\n\nGöring: Why, of course, the people don’t want war. Why would some poor slob on a farm want to risk his life in a war when the best that he can get out of it is to come back to his farm in one piece? Naturally, the common people don’t want war; neither in Russia, nor in England, nor in America, nor for that matter in Germany. That is understood. But, after all, it is the leaders of the country who determine the policy and it is always a simple matter to drag the people along, whether it is a democracy, or a fascist dictatorship, or a parliament, or a communist dictatorship.\n\nGilbert: There is one difference. In a democracy the people have some say in the matter through their elected representatives, and in the United States only Congress can declare wars.\n\nGöring: Oh, that is all well and good, but, voice or no voice, the people can always be brought to the bidding of the leaders. That is easy. All you have to do is tell them they are being attacked, and denounce the pacifists for lack of patriotism and exposing the country to danger. It works the same way in any country.6\n\nGöring is clearly speaking of lying, manipulating, and perhaps using a false flag scheme to persuade people that they are being attacked so they will accept going to war.\n\nDavid Ray Griffin informs us in his book, The New Pearl Harbor Revisited, that Nazi advocacy for, and use of, false flag events is confirmed by the fact that the Nazis themselves orchestrated the 1933 Reichstag fire, blamed the Communists, and used the pretext to imprison political dissidents and to annul civil liberties. Griffin continues,\n\nIn 1939 when Hitler wanted a pretext to attack Poland, he had Germans dressed as Poles stage raids on German outposts on the Polish-German border, in some cases leaving dead German convicts dressed as Polish soldiers at the scene. The next day, referring to these “border incidents,” Hitler attacked Poland in “self-defense,” thereby starting the European part of World War II.7\n\nIt was Heinrich Himmler who carried out this false flag for his Führer.8\n\nHeinrich Himmler was appointed by Hitler as Reichsführer of the Schutzstaffel (SS). The infamous SS comprised multiple deployment groups whose troops were directly responsible for the extermination of tens of millions of people through firing squads, deliberate starvation, hard labor without adequate rest or food, gassings in vans, and extermination camps. The deliberate extermination of these people was to be kept, as much as possible, from common knowledge among German citizens, especially the extermination of the Jewish people.\n\nAn excerpt from Himmler’s Posen speech to the top officers of the Wehrmacht, delivered on October 4, 1943, clearly documents the practice of the big lie regarding the extermination of the Jewish peoples of Europe:\n\nI want to refer here very frankly on a very difficult matter. We can now very openly talk about this among ourselves, yet we will never discuss this publicly. \n\n\n\n . . . I am now referring to the evacuation of the Jews, the extermination of the Jewish People. This is something that is easily said: ‘The Jewish People will be exterminated’, says every party member, ‘this is very obvious, it is in our program — elimination of the Jews, extermination, a small matter.’ And then they turn up, the upstanding 80 million Germans, and each one has his decent Jew. They say the others are all swines, but this particular one is a splendid Jew. But none has observed it, endured it. Most of you here know what it means when 100 corpses lie next to each other, when there are 500 or when there are 1,000. To have endured this and at the same time to have remained a decent person — with exceptions due to human weaknesses — has made us tough, and is a glorious chapter that has not and will not be spoken of. 9\n\nBecause Hitler authorized Himmler to speak frankly in the city of Posen about the clear meaning of the “final solution for the Jewish question,” all of the party leaders were aware of this horrific big lie, and they were all, therefore, parties to the planned genocide.10\n\nThese examples of Hitler’s associates lead us to examine his own direct use of the big lie to further his agenda of Jewish extermination. One example will suffice: A July 11, 1943, office memo from the Führer Headquarters and signed by Martin Bormann, head of the Party Secretariat, was circulated among the Nazi leadership. It read:\n\nOn instructions from the Führer, I make known the following: Where the Jewish Question is brought up in public, there may be no discussion of a future overall solution (Gesamtlosung). It may, however, be mentioned that the Jews are taken in groups for appropriate labor purposes.11\n\nThe Nazi leadership systematically used cynical, euphemistic code names for their murderous designs, such as “labor camps” or “quarantine camps” for death camps, “resettlement” for the death marches in severe winter conditions, and “Extraordinary Pacification Action” for the liquidation of the intelligentsia of Poland.12 Without doubt, Martin Bormann was conveying instructions from his Führer that the Nazi leadership must never discuss in public the real plan for the Jewish People. The real plan had already been made abundantly clear in previous meetings and speeches among the leaders: Total extermination of the entire Jewish population of Europe, estimated to be eleven million people.\n\nAlthough no comprehensive blueprint has ever been found, captured documents reveal that the Nazis’ “New Order” was to designate the Germans as the “master race” and all other people would be considered, with some exceptions, subhuman. While the Jewish people were to be completely exterminated, tens of millions of non-Jewish citizens of the conquered lands were also killed to make room for German settlers. The indigenous peoples who would survive this onslaught — in particular the Slavs — were fated to become the uneducated slaves of the so-called master race.13\n\nBormann wrote a letter in 1942 reiterating the Führer’s plan for the survivors:\n\nThe Slavs are to work for us. In so far as we don’t need them, they may die. Therefore compulsory vaccination and German health services are superfluous. The fertility of the Slavs is undesirable. They may use contraceptives or practice abortion — the more the better. Education is dangerous. It is enough if they can count up to one hundred. At best an education which produces useful coolies for us is admissible. Every educated person is a future enemy.14 [Emphasis added.]\n\nThe foregoing documented accounts demonstrate the Nazi plan for conquering Europe, which would lead to eventual world domination. They show, too, the Nazis’ racist politics and the Führer’s determined efforts to keep the total extermination of the Jewish people a secret from the average German citizen. Obviously, to manage such a colossal deception, the strategy of the big lie had to be employed.\n\nEven though Hitler’s “big lie” quote from Mein Kampf was indeed an accusation against an entire people — the Jews — Hitler himself was an ardent practitioner of the big lie. Surely, he employed this strategy because he knew that if the Germans — most of whom saw themselves as good, decent people — were explicitly told the true designs of the final solution for their Jewish neighbors and of the Nazi leadership’s ultimate plans for world hegemony, there would have been — in spite of the Gestapo’s zealous pursuit of dissidents — much greater unrest than there was from within this horribly misdirected country.\n\nFor the sake of the future of humanity, it is vital that the citizens of every nation understand that governments are capable of telling colossal lies for the purpose of:\n\n(1) keeping their citizens ignorant of atrocities that the leaders have ordered;\n\n (2) convincing their citizens to remain silent and trust the authorities, who will (ostensibly) protect them; and/or\n\n (3) persuading their citizens that they have been attacked — or are in grave danger of being attacked.\n\nWhen common citizens are unsuspecting of their government’s machinations, it’s no wonder they often jingoistically raise a battle cry, sign up to go to war, and suppress their conscience so they can kill their brothers and sisters in other lands — and sometimes in their own land.\n\nThe frank admissions of Göring and Goebbels bear repeating:\n\nGöring: . . . [V]oice or no voice, the people can always be brought to the bidding of the leaders. That is easy. All you have to do is tell them they are being attacked, and denounce the pacifists for lack of patriotism and exposing the country to danger. It works the same way in any country.15\n\nGoebbels: It thus becomes vitally important for the State to use all of its powers to repress dissent, for the truth is the mortal enemy of the lie, and thus by extension, the truth is the greatest enemy of the State.16\n\nUntil the majority of us are educated regarding these tactics, we will continue to be hoodwinked in heinous ways. And until most of us understand our own proclivities to yield to power through our silence when we suspect or detect a big lie, we will continue to be those good people who, because of our fear, cooperate with the authorities with monstrous results. [See Part 3: Obeying and Believing Authority.]\n\nAgain, it is urgent that we the people wake up — that we become aware of the deceptions of those in power who operate against the common good. Rousing humanity to this awareness is one of my primary reasons for writing this work.\n\nClinging to the web of the big lie\n\nAwareness in this context moves in two directions: outward and inward. Our outward awareness is expressed as an interest in studying historical accounts to ascertain the despotic capacity of those in power. Our inward awareness, meanwhile, takes the form of self-awareness, wherein we study our ability to deceive ourselves.\n\nFor example, the big lie would surely snare in its web those innocent and unaware people who are completely ignorant that they are being lied to by their government. But what about those people who are aware, who suspect or even know they are being lied to — and yet pretend they believe the official lies? Perhaps these are the people who cling desperately to the web of lies being spun for them, and who keep blinders on to avoid the evidence in plain sight that contradicts those lies.\n\nHarvard professor Daniel Jonah Goldhagen makes a powerful argument in his international bestseller, Hitler’s Willing Executioners: Ordinary Germans and the Holocaust, that the majority of German citizens knew about and condoned the “final solution” of the Nazi Party.\n\nHe argues equally strongly that the Jewish mass killings could not have occurred without both an underlying willingness and cooperation of the majority of the population and a leadership that allowed or ordered those atrocities. Indeed, both of these conditions are necessary for any genocide to occur.\n\nHitler and the Nazis were obviously the driving force behind the persecution and eventual slaughter of Jewry, yet the German people’s own prior anti-Semitism [which evolved over centuries] created the necessary enabling condition for the eliminationist program to unfold, of which they, with sadly few exceptions, approved in principle, if not wholeheartedly.17\n\nMore generally, it can be said that certain kinds of dehumanizing beliefs about people, or the attribution of extreme malevolence to them, are necessary and can be sufficient to induce others to take part in the genocidal slaughter of the dehumanized people, if they are given proper opportunity and coordination, typically by a state.18\n\nFor such genocidal killing to ensue, the perpetrators need to believe that the dehumanized people are a grave danger to their survival. As revealed by a defense counsel of the indicted in the Nuremberg trials, the majority of Germans of the 1930s and 1940s had come to thoroughly believe — brainwashed as they were by the treacherous rumors that were swirling around them — that Bolshevism, with which Germany was locked in a life-or-death battle, “was a Jewish invention and was only serving the interests of Jewry.” For those who believed that Jewry was locked in an apocalyptic battle with Germans, the annihilation of the Jewish “race” was deemed a just necessity.19\n\nFurthermore, Goldman argues, public record clearly demonstrates that Adolf Hitler publicly proclaimed that death was the only fitting punishment and “solution” for the Jewish “race.” On August 13, 1920, at the beginning of his political career in a speech entitled, “Why Are We Antisemites?” Hitler articulated, “We have, however, decided that we shall not come with ifs, ands, or buts, but when the matter comes to a solution, it will be done thoroughly,” which clearly meant the extermination of the Jewish people.\n\nIn the same speech, he candidly confided to the audience that after he achieved national prominence, he would not repeat what he meant by the phrase “it will be done thoroughly.” Thus, the big-lie policy would then begin.\n\nBut why? If the Nazi leadership knew that the majority of non-Jewish German citizens would be supportive of the Jewish genocide, why go to the trouble of spinning the big lie?\n\nThis apparent contradiction troubled me. How to make sense of it? The insight that eventually became clear is that many people want to leave “the dirty work to the boys in the back room,” so they can pretend they are ignorant and shocked when they discover the crimes of their leaders.\n\nIt’s cognitive dissonance once again. [See Part 5: Denial and Cognitive Dissonance.] People normally see themselves as good human beings, and we all know that good people do not murder. Despite that veneer of morality, good people may want a de-humanized group to be annihilated — or at least weakened to the point of powerlessness. Leadership, understanding this psychology and wanting no dissent from the population, employs the big lie to keep the conscience of the common people unruffled. The truth is in plain sight for all to see or hear, but, as with the three proverbial “wise” monkeys, we do not want to see or hear, much less speak, of the evil in our midst. We now have plausible deniability.\n\nFurther clarity on this apparent paradox comes from the essay “Tenth Anniversary of War by Deceit” by Catholic priest Emmanuel Charles McCarthy, executive director of the Center for Christian Nonviolence. In this essay, McCarthy passionately calls on our conscience:\n\nIn terms of the Nonviolent Jesus and His teaching of Nonviolent Love of friends and enemies, and the steely obstinate refusal of practically all the leaders of all the Christian Churches to teach it as Jesus’ Way, I have often thought of Alexander Solzhenitsyn’s reflection: ‘We do not err because truth is difficult to see. It is visible at a glance. We err because the lie is more comfortable.’ It seems that most human beings have, just about always, preferred to live in a make-believe world, where truth is sacrificed to vanity, comfort, and/or self-interests. Three hundred years before Solzhenitsyn, Diderot wrote, ‘We swallow greedily any lie that flatters us, but we sip only little by little, if at all, at the truth we find bitter.’\n\nWe humans find an uneasy truce from the nagging discomfort of cognitive dissonance by pretending we believe in the big lie — for the sake of our “vanity, comfort, and/or self-interests.” McCarthy, in what is reminiscent of the very few lone Christian voices 20 of protest during the Nazi era continues:\n\nJeremiah 9:5: Heaping oppression upon oppression, and deceit upon deceit, they refuse to know me, declares the Lord . . . . Whether it be Christians in the United States and England, or Jews in the United States, England, or Israel; whether they worship Jesus or consider the worship of Jesus idolatry or false worship; whether they zealously and of course piously, believe in Adonai (Yahweh) or the Holy Trinity, a huge number of Jews and Christians since 9/11 have heaped oppression upon oppression on the Arab people of the Middle East or supported its imposition. Their respective national political masters have also — in relation to this oppression, torture, and murder — engaged in deceit after deceit, ad nauseam, via the communication instruments each controls. And since 9/11, both Jews and Christians have acted in this way, all the while declaring that they know the Lord!\n\nThis impassioned plea for integrity and courage from the religious community brings us closer to exploring the big-lie parallel of the Nazi era to the attacks of September 11, 2001. But before we arrive there, let’s dig deeper into Hitler’s behavior of accusing an entire people of practicing the big lie when he, himself, practiced such diabolical deception. In doing so, we will learn more about ourselves.\n\nProjection is a psychological defense mechanism that we all use from time to time. Our “shadow” — the negative tendencies we are unaware that we possess — is unconsciously “projected” onto another person or even onto a whole group of people. Our shadow can be understood metaphorically as our personal demons — or as a hidden pool of poisons.\n\nWhen our defenses are weakened, for one reason or another, these inner poisons float to the surface of our awareness, throwing our emotional equilibrium off balance, because they do not fit our self-image of who we are. This can create unbearable emotional pain. To relieve ourselves of this pain, we unconsciously project these poisons, these demons, these traits onto others.\n\nTo summarize: When we unconsciously harbor unacceptable emotions, traits, or impulses, we defend ourselves (our identity) by “projecting” these emotions, traits, or impulses onto another person or even an entire group of people.\n\nThis dynamic is the psychological origin of “scapegoating,” a violent form of projection — indeed, a physical, emotional, or spiritual sacrifice of the scapegoated person or group.\n\nProjection is found in varying degrees on a continuum. On one end are relatively harmless projections, such as hasty judgments we may automatically make about another person’s actions. If, for example, we harbor a perpetual desire to play instead of finishing our work at the office, we might accuse a colleague — who, unbeknownst to us, has a sick child at home and thus has to leave early — of “taking off work early simply to go play.” In other words, we project our own desire for pleasure onto our innocent workmate, thus betraying our underlying shadow.\n\nIn the middle of the continuum are less innocuous projections that result in more obsession, enmity, and judgmental attitudes. Referring to the above example, we might say about our early-departing office mate: “She’s a lazy good-for-nothing, always leaving us with the bulk of the work load.”\n\nAt the far end of the continuum is what is known as scapegoating, a virulent form of projection marked by hypercriticism, irrational blame, and even the malevolent wish to banish another from one’s group. We might target that poor mother — who’s secretly worried about her sick child and feels badly giving more work to her colleagues because she has to leave work early — with a venomous stab: “It’s all her fault that we didn’t meet our department’s quota and earn a raise, so I’m going to figure out a way to get her fired.”\n\nThe term “scapegoat” has been handed down from ancient Middle Eastern rituals. A goat or a human would be driven from the village to rid the villagers of their perceived sins or in response to a crisis. Today, we use the term “scapegoating” to indicate that someone has been unfairly blamed for another’s problems. 21\n\nWhat are these poisons, these demons we harbor inside our psyches and our bodies?\n\nBriefly, they are the repressed and unhealed emotions from the traumas of omission and commission that we have sustained in our lives — from the womb on. According to the research of psychoanalyst Alice Miller, Adolf Hitler, perhaps from the age of three or four, was daily, brutally beaten by his father. As a result, young Adolf was a horribly traumatized little boy who carried post-traumatic stress into his adulthood. In short, he was very, very unhealed. Perhaps one reason that Hitler appealed to so many of his countrymen is that the style of childrearing that he survived was similar to that of many German citizens of the period.22\n\nTo varying degrees, virtually all of us carry repressed trauma from our infancy and childhood. Therefore, nearly all of us have a shadow side that, if we recognized it, we would abhor as undesirable and unacceptable. Consequently, most of us are liable to project our unwanted characteristics onto others.\n\nHow do we know if we are harshly projecting onto — or worse, scapegoating — another?\n\nSelf-observation gives us a clue. Do we notice ourselves being obsessed with a negative view of a person or a group of people? Do we see in ourselves a tendency to disparage select people or even entire groups of people? Do we find ourselves repeating judgmental statements about certain people or groups? If we are often filled with such damning thoughts of others, we can be sure this is our own poison being projected onto undeserving victims.\n\nIt doesn’t matter if our animosity is directed toward all Jews, Muslims, Christians, Communists, Republicans, Democrats, Israelis, Palestinians, or toward certain individuals — perhaps George W. Bush, Barack Obama, Osama bin Laden, Saddam Hussein, or even a family member or friend. Regardless of the “who,” regardless of the reasons we give for our enmity, the clue remains the same: Are we obsessed with negative thoughts and feelings toward others? If we are, we are projecting our own shadow. And if we become aware that we are projecting our own shadow, we have a choice.\n\nOne option is to continue the cycle of abuse and trauma by projecting upon and scapegoating others. If we do, we may for a short time feel some relief from our own demons — from the rage, hurt, terror, helplessness, grief, and profound confusion that, unaware, we hold deep inside. But such relief is illusory and temporary, never leading to wholeness or true peace. Sacrificing another is always in vain. Our inner demons remain to haunt us.\n\nUltimately, it is our own internal demons that we want to be free of, not the person or group upon whom we have projected them.\n\nThe better choice, then, is to point our accusing finger back at ourselves and find what is unhealed within us. We can discover a healing path that enables us to release the repressed, stored-up emotions resulting from our lifelong traumas — these poisons, these demons that we will otherwise carry with us forever.\n\nNo matter what particular healing path we choose, our journey is ultimately about making the unconscious conscious and about releasing the repressed emotions from psyche and body. Such a process is always painful, but it is also immeasurably freeing.\n\nIn the foregoing analysis, I do not mean for a moment to minimize the atrocities that the bully perpetrates on others, whether this be the school-ground bully or the bully at the helm of a country. Nevertheless, if we do not understand the root of the problem, our own repressed traumas that drive the psychological defenses of projection and scapegoating, we will not know how to prevent these atrocities in the future.\n\nBack to Hitler. The U.S. Office of Strategic Studies (OSS, the predecessor of the CIA) took an interest in Adolf Hitler’s personality and his strategies of deception and manipulation. OSS analysts headed by psychoanalyst Walter Langer produced a secret report that was finally declassified after more than 20 years. In this report, Langer writes of Hitler:\n\nHis primary rules were: never allow the public to cool off; never admit a fault or wrong; never concede that there may be some good in your enemy; never leave room for alternatives; never accept blame; concentrate on one enemy at a time and blame him for everything that goes wrong; people will believe a big lie sooner than a little one; and if you repeat it frequently enough people will sooner or later believe it.23\n\nDo not these revelations about the Nazis’ and Hitler’s strategy strike a chord with us in the aftermath of the events of 9/11? Specifically, is it not plausible to consider that, in order to persuade Americans to go to war, people in power who have little, if any, social conscience would employ the time-tested tactic of a false flag operation 24 to establish trauma and fear in the public? Then, to advance their political agenda, would they not tell a big lie, keep it simple, and never deviate from the story that “19 Muslim Arabs attacked us on September 11, 2001, because they hate our freedoms?”\n\nIs it not plausible to speculate that those same people would attempt to stimulate fear again and again — via anthrax attacks,25 repeated warnings of the dangers we face from “terrorists,” and ongoing color-coded “terror alerts?”\n\nWould it not be plausible that such unscrupulous leaders could then persuade the public, through further lies, of the grave danger of Saddam Hussein’s “weapons of mass destruction,” thus deceiving the public into agreeing that the U.S. must preemptively bomb and invade Iraq?\n\nWould not those at the helm be capable of demonizing Muslims and Arabs in the press and in Hollywood movies, so that Muslims and Arabs become, in Americans’ eyes, less than full human beings, much as the Nazi propaganda shaped Germans’ impressions of the Jews in the 1930s and early 1940s?26\n\nIn line with this approach, does it not follow that the torture of our perceived enemies becomes permissible to, and even seen as necessary by, a large percentage of the American public?27\n\nDid not the mainstream media, compliant with and unquestioning of the Bush-Obama policy, present to the public one enemy at a time, on whom we could project our own demons, and toward whom our fear and hatred could be focused: first Osama bin Laden, then Saddam Hussein, then Kadafi, then Assad, and so on?\n\nWould our government officials’ rigid repetition of the official story of 9/11, and their refusal to acknowledge contradictory evidence, not be reminiscent of the Nazi-inspired strategy of presenting only official accounts, never leaving room for questioning? And, if such evidence or questioning emerges briefly through the cracks of the mainstream media, does not the same strategy employ the tactic of shaming the messenger by branding her or him as “unpatriotic” or as a “conspiracy theorist”?\n\nDid we not hear, and do we not still hear today, more than a decade later — repeated ad nauseam through a lapdog (not watchdog) media — the official conspiracy theory about the attacks on September 11, 2001, which worked us into a warring, “Let’s roll” fervor?\n\nDo we not suspect, upon seeing many Americans still caught in the 9/11 web of deceit, that a large number of these citizens are, in reality, clinging desperately to the web of the 9/11 big lie, which is being spun constantly by both political parties and by the media, for their own “vanity, comfort, and/or self-interests”?\n\nIn the true spirit of America, whose founding fathers and mothers admonished us to be vigilant against the tyranny of the powerful, is it not reasonable to be skeptical — to seriously consider all of these possibilities? In asking these questions, I am fully aware of how distasteful it is to many Americans to compare Nazi Germany with the current United States of America.\n\nThe big lie did not begin or end with the Nazi war criminals nor with the perpetrators of the attacks of 9/11. Our human history is replete with such deceit. In Towers of Deception: The Media Cover-up of 9/11, Canadian journalist Barrie Zwicker wrote:\n\nFalse-flag ops are the least-recognized, highest-impact category of human deceit. In terms of emotional wallop, even the most brilliant lies uttered by the most capable demagogues pale in comparison to the public outcry generated by an outrageous false-flag operation. The false-flag op is the indispensable, most dependable device rulers use to mobilize their populations, especially behind wars the rulers want.28\n\nThe false-flag operation has been used for decades, if not centuries, by colonial powers; so far, no nation as a whole has wakened up to it sufficiently to escape being bamboozled by it. False-flag ops are not a side issue. They’re at least one key issue. In my view they are the central issue of our time because of their linchpin function. Repeated false-flag “terrorist” acts are the black lifeblood of the so-called “war on terror,” in turn the template for perpetual rule by the oligarchy. It’s difficult to think of a more controlling form of deceit.\n\nThe events of 9/11 marked a significant upscaling and refining of the false-flag op. But in essence it was business as usual for the ruling oligarchy and Invisible Government. We and everything we hold dear are their targets.29\n\nZwicker then backs up his statements with historical accounts of false flag deceits by several countries, including the United States, Germany, Britain, Spain, Israel, and Italy. The infamous Operation Gladio,30 confirmed by the Italian Senate, demonstrates that sometimes false flag deceits are monstrous multiple acts birthed through the cooperation of several intelligence agencies — in this case, the collaboration of the Italian secret service (SIFAR), NATO, and the CIA. 31\n\nZwicker recognizes that 9/11 is perhaps the most bold false flag, the most brazen big lie, orchestrated to date. He holds out hope, nevertheless, that if a sufficient number of people with integrity can see it and take action, 9/11 also constitutes “the greatest opportunity ever to launch a new beginning. The reason is that the evidence of an inside job in the case of 9/11 is so obvious that it is susceptible to revelation.”32\n\nI agree with him that the exposure of the massive deceit of the false flag attacks of September 11, 2001, is our greatest hope to wake up the general population and Congress. Could this revelation also be the watershed needed to dismantle an empire that has been running amok, wreaking untold havoc on our planet’s environment and untold suffering on countless, innocent human beings?\n\nIf enough of the world’s population does not awaken to the reality of false flags and other deceits propagated by the powerful, and in turn confront these perpetrators, we are, in essence, inviting more of the same. Think of the bully on the school playground. Until enough students decide enough is enough, until they stand up and put an end to his bullying, one thing is certain: the bullying will continue — and most likely it will escalate. Do we really think the school bully will stop his abuse without a determined confrontation?\n\nIn considering the parallel of the bullies at the helm of the Nazi regime and the bullies who perpetrated 9/11, it becomes clear that these individuals have little conscience or capacity for empathy. It also becomes obvious that they know the psychology of the masses better than the masses know themselves — and sometimes better than most psychologists. Can we really blame German and American citizens, then, for buying into the big lie?\n\nFor those citizens who are truly innocent and deceived, the short answer is “No.” Most human beings have a conscience and feel empathy, so it is unfathomable to us that some humans do not have the same capacity. For the majority of us, it is especially incomprehensible that even some of our parental-figure officials, whom we greatly desire to trust, may have the treacherous ability to deceitfully murder our fellow citizens en masse in order to advance their own agenda.\n\nWho are the people capable of perpetrating such atrocities? One of them, as we have already noted, was Adolf Hitler, someone who experienced extreme post-traumatic stress syndrome . . . who projected his own demons onto the Jewish people and onto others he saw as “undesirables” . . . and who committed one of the most egregious and horrifying examples of scapegoating in human history.\n\nThere are other psychological explanations for the diminishing of conscience and of the capacity for empathy; many of these explanations are most likely based in trauma. A few people at the helm of a country may completely lack a conscience and the capacity for empathy due to an organic brain disorder. In the next section, we will learn about them. They are the true sociopaths.\n\nFor ample documentation on the existence of the Nazi leadership’s policy to exterminate all Jewish people in addition to tens of millions of other people, see the following: \n\n— G. M. Gilbert, Nuremberg Diary (First Da Capo Press edition, 1995).\n\n— Richard J. Evans, The Third Reich in History and Memory (Oxford University Press, 2015).\n\n— William L. Shirer, The Rise and Fall of the Third Reich: A History of Nazi Germany (Simon & Schuster, 2011).\n\nDavid Ray Griffin, The New Pearl Harbor Revisited: 9/11, The Cover-up, and the Exposé (Olive Branch Press, 2008), xxii.\n\nThis translation is from https://en.wikipedia.org/wiki/Heinrich_Himmler.\n\nSee also: Shirer, The Rise and Fall of the Third Reich, 966. The last line of this quote is translated as: “This is a page of glory in our history which has never been written and is never to be written.”\n\nFor more excerpts of Himmler’s speeches, see https://en.wikipedia.org/wiki/Posen_speeches.\n\nThe Wannsee Conference of January 20, 1942, which was convened by Reinhard Heydrich, the director of the SS under Himmler, was held to ensure the cooperation of the administrative leaders of various government departments in this big lie. \n\nSee https://en.wikipedia.org/wiki/Wannsee_Conference and\n\nShirer, The Rise and Fall of the Third Reich, 965 – 966.\n\nShirer, The Rise and Fall of the Third Reich, 662 – 664.\n\nShirer, The Rise and Fall of the Third Reich, Chapter 27, “The New Order,” 937 – 994.\n\nShirer, The Rise and Fall of the Third Reich, 939.\n\nDaniel Jonah Goldhagen, Hitler’s Willing Executioners: Ordinary Germans and the Holocaust (Alfred A. Knopf, Inc., 1996), 448.\n\nIbid. 393 – 394. The quoted words are contained in Reinhard Maurach’s expert legal brief for the defense of the indicted Nazi leadership at the Einsatzgruppen trial at Nuremberg.\n\nOne of those voices was that of Pastor Walter Höchstädter, a hospital chaplain in France in 1944, who sent one thousand copies of a written protest of the slaughter through the military mail to soldiers at the front. His impassioned plea to the Church to speak out against the atrocities can be found in Goldhagen’s Hitler’s Willing Executioners, pages 431 – 432. Here are a few excerpted sentences from this rare protest by a member of the Christian clergy of that era:\n\nWe live in an age which is raging throughout with mad ideas and demons, no less than the Middle Ages. Our allegedly “enlightened” age, instead of indulging in an orgy of crazed witch-hunting, feasts itself in an orgy of maniacal Jew-hatred. Today the Jew-hating madness, which had already raged frightfully in the Middle Ages, has entered upon its acute state. . . . Today, the blood of millions of slaughtered Jews, of men, women, and children, cries to heaven. The Church is not permitted to be silent. . . . The witch craze also was once scientifically justified by leading authorities of the theological, legal, and medical faculties. The battle against Jewry proceeds from the same muddy source from which the witch craze once proceeded. Contemporary mankind has not overcome its proclivity to look for a “scapegoat”. . . . The Church ought to live of love. . . . Woe to her if by her silence and by all sorts of dubious excuses she becomes jointly guilty of the world’s outbursts of hatred! . . .\n\nToday, the blood of millions of slaughtered Muslims, of men, women, and children, cries to heaven. And indeed, the Church — and surely the Temple — are not permitted to remain silent. Yet, sadly, nearly a century later, silent they remain.\n\nAlice Miller, For Your Own Good: Hidden cruelty in child-rearing and the roots of violence (Farrar, Straus and Giroux, New York, 2002), 142 – 195.\n\nRobin Grille, Parenting for a Peaceful World (Longueville Media, PO Box 7143 Alexandria, New South Wales 2015, Australia, 2005), Chapter 13 “Nazis and their opponents: how did their childhoods differ?”\n\nWalter C. Langer, The Mind of Adolf Hitler (New York: Basic Books, 1972). \n\nSee also: http://www.nizkor.org/hweb/people/h/hitler-adolf/oss-papers/text/profile-index.html and http://www.nizkor.org/ftp.cgi/people/h/hitler.adolf/oss-papers/images/gif/00010057.gif.\n\nGraeme MacQueen, The 2001 Anthrax Deception: The Case for a Domestic Conspiracy (Clarity Press, September 1, 2014). See interview with Dr. Graeme MacQueen on the anthrax attacks at https://www.youtube.com/watch?v=fPyKO5TnIgs. See Glenn Greenwald at http://www.salon.com/2011/02/16/ivans.\n\n\n\nSee the excellent documentary Anthrax War at http://www.anthraxwar.com/1.\n\nReel Bad Arabs: How Hollywood Vilifies a People: This film, narrated by Jack Shaheen, who wrote the book by the same name, depicts the slander of Arabs in American filmmaking since the early days of silent cinema, a slander that still exists in the biggest Hollywood blockbusterstoday. Of 900 films studied, only 50 show a neutral image of Arabs. Reel Bad Arabs also addresses the close connection between the Hollywood film industry and the foreign policy decision-makers of Washington, D.C.\n\nFor Nazi propaganda demonizing Jewish and other German citizens, see http://blogs.law.harvard.edu/karthik/files/2011/04/HIST-1572-Analysis-of-Nazi-Propaganda-KNarayanaswami.pdf.\n\nAdam Goldman and Peyton Graighill, “New poll finds majority of Americans think torture was justified after 9/11 attacks,” Washington Post, December 16, 2014, http://www.washingtonpost.com/world/national-security/new-poll-finds-majority-of-americans-believe-torture-justified-after-911-attacks/2014/12/16/f6ee1208-847c-11e4-9534-f79a23c40e6c_story.html and\n\nhttp://apps.washingtonpost.com/g/page/politics/washington-post-abc-news-poll/1514.\n\n\n\nFor different poll results, see the 2006 BBC World Service Poll at http://www.globescan.com/news_archives/bbctorture06/BBCTorture06.pdf.\n\nBarrie Zwicker, The Towers of Deception: The Media Cover-up of 9/11, Chapter 7 (New Society Publishers, Canada, June 2006).\n\nDaniele Ganser, NATO’s Secret Armies: Operation GLADIO and Terrorism in Western Europe (Frank Cass Publishers, London, 2005).\n\nSee “Operation Gladio: Interview with Daniele Ganser” at http://911blogger.com/node/2582.\n\nNote: Electronic sources in the endnotes have been archived. If they can no longer be found by a search on the Internet, readers desiring a copy may contact Frances Shure [This email address is being protected from spambots. You need JavaScript enabled to view it. ].", "opengraph": {"title": "Part 19: Government Manipulation and the Big Lie", "description": "Editor's Note: Frances Shure, M.A., L.P.C., has performed an in-depth analysis addressing a key issue of our time: 'Why Do Good People Become Silent — or Worse — About 9/11?' The resulting essay, being presented here as a series, is a synthesis of both academic research and clinical observations.\r\nP...", "image": "https://www.ae911truth.org/images/blog/PART-19-gov-big-lie-768-RGB-n.jpg", "type": "article", "locale": "en_US", "url": "https://www.ae911truth.org/news/238-news-media-events-shure-part-19-government-manipulation-and-the-big-lie", "site_name": "AE911Truth"}, "tags": [], "tweets": [], "movies": [], "links": ["https://en.wikipedia.org/wiki/Erich_Ludendorff", "https://en.wikipedia.org/wiki/Arthur_Schopenhauer", "#footnote1", "#footnote2", "#footnote3", "#footnote4", "#footnote5", "#footnote6", "#footnote7", "#footnote8", "#footnote9", "#footnote10", "#footnote11", "#footnote12", "#footnote13", "#footnote14", "#footnote15", "#footnote16", "/evidence/technical-articles/articles-on-psychology/280-shure-part-3-obeying-and-believing-authority", "#footnote17", "#footnote18", "#footnote19", "/evidence/technical-articles/articles-on-psychology/282-shure-part-5-denial-and-cognitive-dissonance", "https://en.wikipedia.org/wiki/Three_wise_monkeys", "#footnote20", "#footnote21", "#footnote22", "#footnote23", "#footnote24", "#footnote25", "#footnote26", "#footnote27", "#footnote28", "#footnote29", "#footnote30", "#footnote31", "#footnote32", "http://gutenberg.net.au/ebooks02/0200601.txt", "http://www.sourcewatch.org/index.php?title=Big_lie", "http://thinkexist.com/quotation/think-of-the-press-as-a-great-keyboard-on-which/383183.html", "http://thinkexist.com/quotation/the_most_brilliant_propagandist_technique_will/162045.html", "http://thinkexist.com/quotation/-if_you_tell_a_lie_big_enough_and_keep_repeating/345877.html", "https://en.wikipedia.org/wiki/Heinrich_Himmler", "https://en.wikipedia.org/wiki/Posen_speeches", "https://en.wikipedia.org/wiki/Wannsee_Conference", "http://www.jewishvirtuallibrary.org/jsource/Holocaust/hitban.html", "http://thinkexist.com/quotation/-if_you_tell_a_lie_big_enough_and_keep_repeating/345877.html", "https://en.wikipedia.org/wiki/Scapegoat", "http://www.nizkor.org/hweb/people/h/hitler-adolf/oss-papers/text/profile-index.html", "http://www.nizkor.org/ftp.cgi/people/h/hitler.adolf/oss-papers/images/gif/00010057.gif", "https://en.wikipedia.org/wiki/False_flag", "https://www.youtube.com/watch?v=fPyKO5TnIgs", "http://www.salon.com/2011/02/16/ivans", "http://www.anthraxwar.com/1", "http://blogs.law.harvard.edu/karthik/files/2011/04/HIST-1572-Analysis-of-Nazi-Propaganda-KNarayanaswami.pdf", "http://www.washingtonpost.com/world/national-security/new-poll-finds-majority-of-americans-believe-torture-justified-after-911-attacks/2014/12/16/f6ee1208-847c-11e4-9534-f79a23c40e6c_story.html", "http://apps.washingtonpost.com/g/page/politics/washington-post-abc-news-poll/1514", "http://www.globescan.com/news_archives/bbctorture06/BBCTorture06.pdf", "http://911blogger.com/node/2582"], "authors": ["Frances T. Shure, M.A., L.P.C."], "publish_date": "2015-10-05T13:49:00-07:00"}