{"result_id": "037032", "URL": "https://www.asia-pacificresearch.com/china-risks-himalayan-water-war-india/5629824", "timestamp": "2023-04-25 12:08:56 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.asia-pacificresearch.com/china-risks-himalayan-water-war-india/5629824", "encoding": "UTF-8"}, "image": null, "domain": "www.asia-pacificresearch.com", "title": "China Risks a Himalayan Water War with India | Asia-Pacific Research", "cleaned_text": "China-India tensions in the Himalayas is shifting from confrontation and saber-rattling over contested border territory to a potentially more destabilizing conflict over water flows from the world’s highest mountain range.\n\nThe heart of the issue is China’s plan to construct a mega-dam on the Yarlung Zangbo River, which flows through Tibet and eventually becomes the Brahmaputra when it enters India.\n\nPrecise technical details are lacking, but regional media reports indicate it will likely dwarf the massive Three Gorges Dam on the Yangtze River and generate three times as much electricity for distribution in China.\n\nThe Yarlung Zangbao Dam plan is moving ahead without China discussing or entering into water-sharing agreements with downstream India or Bangladesh.\n\nChina’s apparent lack of consultations with downstream neighbors follows a pattern that has already sparked controversy and angst in Southeast Asia.\n\nChina has built eleven mega-dams on the Mekong River, causing water levels there to fluctuate widely without prior notice in Myanmar, Laos, Thailand, Cambodia and Vietnam.\n\nIn late December, China reduced water discharge from a dam to test its equipment near the town of Jinghong in southern Yunnan province from 1,904 cubic meters to 1,000 cubic meters per second, according to reports.\n\nIt took almost a week for China to inform the downstream countries of the move, which wasn’t enough time for downstream countries to prepare, resulting in disruptions in shipping and commerce. Water levels had already dropped a meter at Thailand’s Chiang Saen, where the Mekong forms the border with Laos,\n\nChina’s announcement was made only after the Washington-based Stimson Center’s Southeast Asia Program’s Mekong Dam Monitor, which uses satellite imagery to keep tabs on water levels along the river, notified the Mekong River Commission, a regional cooperation organization of which China is not a member.\n\nSome analysts believe China is using its leverage over water flows as a stick to win concessions from downstream Southeast Asian states on other issues, including in regard to its Belt and Road Initiative.\n\nIt’s possible China is trying to establish a similar dynamic with India with its Yarlung Zangbao Dam designs. But if a water-sharing agreement isn’t reached, the dam could cause more bilateral conflict than compromise in the future.\n\nAfter Indian and Chinese forces fatally clashed in Ladakh in the western Himalayas in June last year and a 2017 border stand-off near the border with Bhutan, anger is building in India over China’s unilaterally decided hydroelectric power scheme.\n\nIndian newspaper editorials and private think tanks such as the New Delhi-based Center for Policy Research have produced critical reports and commentaries on the issue, saying the dam will adversely affect the livelihoods of downstream communities.\n\nIn Bangladesh, which maintains cordial relations with China, protests over the Yarlung Zangbao Dam have also been heard.\n\nOn December 1, Reuters quoted Sheikh Rokon, secretary-general of the Bangladeshi environment campaigners Riverine People, as saying multilateral discussions should be held before China builds any dams and that “China’s downstream neighbors have a legitimate cause for concern. Water flow will be disrupted.”\n\nThe water controversy is heightening already inflamed anti-Chinese sentiments in India, and thus could have an impact on regional security. China claims most of the Indian state of Arunachal Pradesh, where the Brahmaputra flows across the border, and refers to it as “South Tibet.”\n\nIndians stage a protest against China killing Indian soldiers during a Himalayan border standoff, on June 17, 2020. Photo: Twitter\n\nIn 1962, India and China fought a short but bitter border war in that area and although the situation has been mostly peaceful since then, the actual border remains undemarcated and heavily militarized on both sides.\n\nPerhaps in an attempt to probe India’s defenses — or just as a provocation meant to underline its territorial claims — Chinese troops have in recent years made frequent incursions across the de facto but not de jure border.\n\nThey have frequently painted Chinese characters on rocks in remote areas to stake Beijing’s claim. In September, the Chinese abducted and then released five Indian youths who had gone hunting in northern Arunachal.\n\nIn the first week of January, in apparent response, New Delhi announced a series of new road-building projects in Arunachal, evidently meant to strengthen India’s hold of the China-claimed territory.\n\nSince the confrontation in Ladakh, India has also established more outposts along the 1,126-kilometer line of actual control that separates Arunachal from China-controlled Tibet.\n\nBefore that, in 2017, India announced that it would construct two Advanced Landing Grounds — or small airstrips — in northern Arunachal. That move came after China had renamed six places in Arunachal to make them sound Chinese.\n\nFor its part, China has begun the construction of a railroad that will run parallel to the Arunachal frontier and connect the city of Chengdu in China’s Sichuan province with Linzhi in Tibet.\n\nIt will be the second railroad project that connects Tibet with the rest of China, the first being the line from Xining in Qinghai province to Tibet’s capital Lhasa, which was completed in 2005.\n\nAccording to the communist party mouthpiece the Global Times, the new line “will not only accelerate and enhance overall economic development of the Tibet region, but will play an important role in safeguarding border stability.”\n\nIn a likely related development, huge numbers of people — some say as many as two million, or nearly two-thirds of the entire population of Tibet — have been resettled in what China is euphemistically calling “comfortable housing” and “vocational training programs.”\n\nThey are officially part of Beijing’s efforts to eradicate poverty but which critics claim are efforts to bring a potentially unruly ethnic minority, the Tibetans, under stricter governmental control.\n\nOver the decades, Tibetans in their droves have fled to and now reside in India, not least Tibetan spiritual leader Dalai Lama. Some analysts have speculated India could play a “Tibet card” to stir instability in Tibet if relations deteriorate significantly.\n\nIt is by now clear that infrastructural developments, military build-ups and now water sharing disputes in the region are hardening Indian attitudes towards China — and vice versa as India moves to ban Chinese tech in line with outgoing Donald Trump’s tech war policies.\n\nThe Global Times ran an op-ed this month penned by Qian Feng, director of the research department at the National Strategy Institute at Tsinghua University, which predicted that “India’s public opinion about the border issue will be replaced with [Covid-19] vaccine priorities in 2021.”\n\nHe wrote, “Indian society’s overall negative attitude toward China will continue to intensify as a result of continuously malicious hyping up of the ‘China threat’ theory by certain Indian media outlets and elites.”\n\nQian also opined that “public anger against China has been stirred up by the [Narendra] Modi administration.”\n\nIf China moves ahead with its Yarlung Zangbo Dam project, those sentiments will only rise concomitant with diminished downstream water flows into India. That could be the spark that brings Asia’s two giants to blows in what may or may not play out as a repeat of their fateful 1962 clash.\n\nNote to readers: please click the share buttons above or below. Forward this article to your email lists. Crosspost on your blog site, internet forums. etc.\n\nFeatured image: China and India could soon be on the verge of a major water conflict. Image: Facebook", "opengraph": {}, "tags": ["Politics", "China", "South Asia"], "tweets": [], "movies": [], "links": ["https://asiatimes.com/2021/01/china-risks-a-himalayan-water-war-with-india/", "https://www.asia-pacificresearch.com/author/bertil-lintner", "https://asiatimes.com/2021/01/china-risks-a-himalayan-water-war-with-india/", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "25 January 2021"}