{"result_id": "037020", "URL": "https://www.asia-pacificresearch.com/five-years-since-the-suspension-of-proactive-recommendation-of-the-human-papillomavirus-hpv-vaccine-in-japan/5628181", "timestamp": "2023-04-25 12:08:33 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.asia-pacificresearch.com/five-years-since-the-suspension-of-proactive-recommendation-of-the-human-papillomavirus-hpv-vaccine-in-japan/5628181", "encoding": "UTF-8"}, "image": null, "domain": "www.asia-pacificresearch.com", "title": "Five Years Since the Suspension of Proactive Recommendation of the Human Papillomavirus (HPV) Vaccine in Japan | Asia-Pacific Research", "cleaned_text": "National Plaintiffs Association for the HPV Vaccines Lawsuits in Japan\n\nNational Attorneys Association for the HPV Vaccines Lawsuits in Japan\n\nIt has been five years since the Japanese Government halted proactive recommendation of the HPV vaccine on June 14, 2013, claiming that it could not provide the public with enough information. Compared to other routine vaccinations, an average of over seven times the number of serious adverse effects per one million HPV vaccinations have been reported, and the number of disability certifications by the Adverse Drug Reaction Relief System is almost ten times higher. The government has put in place research groups and selected cooperating medical institutions for the HPV vaccine, but measures to prevent adverse effects and to provide treatment have yet to be established. The public cannot use the HPV vaccine with peace of mind.\n\nThe government officially endorsed the HPV vaccine nine years ago, and many of the victims who were junior or high school students at the time of their HPV vaccination have now grown into adults. However, they have received no effective medical treatment until now and suffer from serious adverse effects, not only pain spreading all over their bodies and involuntary movements, but perceptual disorders, impaired mobility, sleep disruption, impaired memory, and learning disabilities. While their classmates became working adults, they have been incapable of fully attending classes and have abandoned their plans for higher education or getting a job. With no medical institutions able to give them sufficient treatment, they see no bright future and live under a shadow of uncertainty as they struggle to cope with agonizing symptoms every day.\n\nSimilar cases have been also reported overseas. Groups of victims from five countries, UK, Spain, Ireland, Colombia and Japan, participated in an international symposium held in Tokyo in March this year, and published a Joint Statement in April, calling for the necessity of a fact-finding investigation, development of treatment methods, and support for daily life, education and employment.\n\nIn the meantime, studies on the adverse effects of the HPV vaccine have made solid progress and a number of results have been reported. Based on analysis of multiple cases, one study clarified that the adverse effects of a range of symptoms develop in a multi-layered manner over time. Another study reported changes in cerebrospinal fluid, cerebral blood flow, and peripheral nerves, etc. A third study reported that the HPV vaccine causes impaired mobility among other effects in vaccinated mice due to neurological damage. Finally, a fourth study indicated that individuals develop chronic ailments soon after receiving the HPV vaccine. A paper written by researchers from the WHO Collaborating Centre for International Drug Monitoring argues that previous signal evaluations and epidemiological studies have relied primarily on reporting of a specific diagnosis or single-symptom concept, and thus a focus on symptomatology and seriousness in combination with an investigation of the underlying pathology may be required to fully elucidate the safety signals.\n\nInterview at press club in Ministry of Health, Labour and Welfare (Second left: Ms. Nanami Sakai, Representative of National Plaintiffs Association) June 14, 2018\n\nThe drugmakers GlaxoSmithKline PLC and Merck Sharp & Dohme Corp. have long ignored this progress and insist on resuming proactive recommendation of the HPV vaccine, adding that the Global Advisory Committee on Vaccine Safety (GACVS) in WHO and other overseas authorities have already approved the safety of the HPV vaccine. However, the epidemiological studies they rely on were not conducted with proper understanding of the adverse effects of the HPV vaccine and thus cannot be a basis for confirming safety. It has also become clear that there are conflicts of interests and a lack of neutrality in WHO.\n\nAt the current time, the overall Japanese HPV vaccination rate has dropped to less than 1 percent, and few new cases have been reported from clinical practices, but new victims will obviously emerge if the government were to resume proactive recommendation of the HPV vaccine. In January this year, although the government updated their HPV vaccine leaflets, those for girls to be vaccinated and their parents intentionally omit the risk of impaired memory and learning disabilities, delivering misleading information to the public. Far from resuming proactive recommendation of the HPV vaccine, what the government must do now is to remove the HPV vaccine from its routine vaccination list.\n\nWe call again for the government and drugmakers not to spread harm any further, and demand that they compensate for all the harm caused based on their legal liabilities, and take the necessary measures to develop treatment methods and establish a medical treatment structure to prevent more suffering, so that victims can live in peace in the future.", "opengraph": {}, "tags": ["East Asia", "Science"], "tweets": [], "movies": [], "links": ["https://www.hpv-yakugai.net/2018/06/29/5years-english/", "https://www.asia-pacificresearch.com/author/national-attorneys-association-for-the-hpv-vaccine", "https://www.hpv-yakugai.net/2018/06/29/5years-english/", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "8 July 2018"}