{"result_id": "037038", "URL": "https://www.asia-pacificresearch.com/philippines-president-threatens-jail-citizens-refuse-vaccine/5630396", "timestamp": "2023-04-25 12:09:06 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.asia-pacificresearch.com/philippines-president-threatens-jail-citizens-refuse-vaccine/5630396", "encoding": "UTF-8"}, "image": null, "domain": "www.asia-pacificresearch.com", "title": "Philippines President Threatens to Jail Citizens Who Refuse Vaccine | Asia-Pacific Research", "cleaned_text": "All Global Research articles can be read in 51 languages by activating the “Translate Website” drop down menu on the top banner of our home page (Desktop version).\n\nVisit and follow us on Instagram at @crg_globalresearch.\n\nPresident of the Philippines, Rodrigo Duterte, commanded citizens to get vaccinated against COVID-19, threatening them with prison time or forced injection of a drug if they do not get the vaccine.\n\nDuterte can be seen speaking to the camera while wearing a mask and threatening the public, according to a video released by The Guardian.\n\n“You choose, get vaccinated or I will have you jailed. I’m telling you, those police jail cells are filthy and foul-smelling, police are lazy in cleaning. That is where you’ll be,” he said.\n\nThe video clip cut to another moment when Duterte says,\n\n“You get vaccinated, otherwise I will order all the village heads to have a tally of the people who refuse to be vaccinated. Because if not I will inject them with Ivermectin which is intended for pigs.”\n\nThe Washington Post reported that Duterte also said,\n\n“If you don’t want to be vaccinated, I’ll have you arrested and have the vaccine shot into your [buttocks],” he said, reportedly using a vulgar word. “If you don’t get vaccinated, leave the Philippines. Go to India if you want, or somewhere, America.”\n\nJustice Secretary of the Philippines Menardo Guevarra reportedly cleared up Duterte’s words on Tuesday and said refusing vaccination was not a violation of the law, per The Post.\n\nThe U.S. Food and Drug Administration (FDA) and the World Health Organization (WHO) have warned everyday people not to use Ivermectin against COVID-19.\n\nOn its website, the FDA stated that the agency “has not approved ivermectin for use in treating or preventing COVID-19 in humans. Ivermectin tablets are approved at very specific doses for some parasitic worms, and there are topical (on the skin) formulations for head lice and skin conditions like rosacea. Ivermectin is not an anti-viral (a drug for treating viruses),” adding that “Taking large doses of this drug is dangerous and can cause serious harm.”\n\n“Never use medications intended for animals on yourself. Ivermectin preparations for animals are very different from those approved for humans.”\n\nIn March, the WHO recommended that Ivermectin only be used in treatment of COVID-19 within clinical trials.\n\n“The current evidence on the use of ivermectin to treat COVID-19 patients is inconclusive. Until more data is available, WHO recommends that the drug only be used within clinical trials,” it stated, citing a guideline development group that looked at data from trials.\n\n“Duterte is famous for his bellicose rhetoric and his remarks on Monday contradicted those of his health officials, who have said getting vaccinated against COVID-19 is voluntary.”\n\n“Don’t get me wrong, there is a crisis in this country,” Duterte said. “I’m just exasperated by Filipinos not heeding the government.”\n\nCOVID-19 cases have gone down in the Philippines since a spike in April, but continue to maintain an uncomfortable rate.\n\nAccording to the WHO,\n\n“from 3 January 2020 to 5:44pm CEST, 22 June 2021, there have been 1,364,239 confirmed cases of COVID-19 with 23,749 deaths, reported to WHO. As of 12 June 2021, a total of 6,624,417 vaccine doses have been administered.” The current population of the country is 111,034,497 people, according to Worldometer.\n\nReuters reported that “as of June 20, just 2.1 million people had been fully vaccinated of the 70 million people targeted for this year.”\n\nNote to readers: Please click the share buttons above or below. Follow us on Instagram, @crg_globalresearch. Forward this article to your email lists. Crosspost on your blog site, internet forums. etc.", "opengraph": {}, "tags": ["South-East Asia", "Justice"], "tweets": [], "movies": [], "links": ["https://www.instagram.com/crg_globalresearch/", "https://www.youtube.com/watch?v=T6DCuND1RR0", "https://www.washingtonpost.com/world/asia_pacific/duterte-philippines-arrest-vaccine/2021/06/22/9ac3eed8-d337-11eb-b39f-05a2d776b1f4_story.html", "https://www.fda.gov/consumers/consumer-updates/why-you-should-not-use-ivermectin-treat-or-prevent-covid-19", "https://www.who.int/news-room/feature-stories/detail/who-advises-that-ivermectin-only-be-used-to-treat-covid-19-within-clinical-trials", "https://www.reuters.com/world/asia-pacific/philippines-duterte-threatens-those-who-refuse-covid-19-vaccine-with-jail-2021-06-21/", "https://github.com/CSSEGISandData/COVID-19", "https://www.worldometers.info/world-population/philippines-population/", "https://www.dailywire.com/news/philippines-president-threatens-to-jail-citizens-who-refuse-vaccine", "https://www.asia-pacificresearch.com/author/charlotte-pence-bond", "https://www.dailywire.com/news/philippines-president-threatens-to-jail-citizens-who-refuse-vaccine", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "24 June 2021"}