{"result_id": "037003", "URL": "https://www.asia-pacificresearch.com/australian-government-shuts-down-melbourne-construction-sites-amid-protests-vaccine-mandates/5630690", "timestamp": "2023-04-25 12:08:04 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.asia-pacificresearch.com/australian-government-shuts-down-melbourne-construction-sites-amid-protests-vaccine-mandates/5630690", "encoding": "UTF-8"}, "image": null, "domain": "www.asia-pacificresearch.com", "title": "Australian Government Shuts Down Melbourne Construction Sites Amid Protests over Vaccine Mandates | Asia-Pacific Research", "cleaned_text": "All Global Research articles can be read in 51 languages by activating the “Translate Website” drop down menu on the top banner of our home page (Desktop version).\n\nVisit and follow us on Instagram at @crg_globalresearch.\n\nConstruction sites in and around Melbourne, Australia, have been shut down for two weeks after hundreds of construction workers and other protestors gathered Monday at the site of a union building, throwing bottles and damaging equipment.\n\nThey were protesting the Victorian government’s COVID-19 vaccine mandate for construction workers that begins Thursday.\n\nRiot police used rubber bullets and pepper spray to disperse crowds, the BBC reported, and the headquarters building for the Construction, Forestry, Maritime, Mining and Energy Union was damaged. Several people were arrested.\n\nThe union released a statement saying it condemned the protests and the “mindless acts of violence” perpetrated by members of the crowd. The statement said that many protesters were not construction workers but members of neo-Nazi and other right-wing extremist groups.\n\n“It is clear that a minority of those who participated were actual union members,” it said.\n\nProtests continued on Tuesday in Melbourne, with the crowd growing into the thousands and encompassing anti-vaccine activists and other types of workers.\n\nUp to 2,000 protesters descended into the city’s central business district, according to The New York Times, which also reported that protesters threw bottles at the police and set off flares, while officers in riot gear fired rubber bullets and used pepper spray.\n\nWorker protests began last week when “tea rooms” where tradespeople congregate during breaks were shut down amid the rising delta surge and the government banned workers from consuming food or drink indoors. That prompted construction workers to take their lunch breaks outside in protest.\n\nThey set up tables and plastic chairs in multiple intersections in central Melbourne, blocking roads and holding up traffic, according to NPR.\n\nFollowing the protests, construction and state officials announced that jobsites in Melbourne and other areas in the region will be closed for at least two weeks beginning Tuesday. It cited Monday’s unrest and the increase in COVID-19 cases in the building and construction industry as the reasons.\n\nVictorian Premier Daniel Andrews said that multiple outbreaks — as high as 13% of all cases, according to local media reports — have been linked to construction sites.\n\nConstruction has been among the few industries that have largely stayed open throughout the pandemic in Victoria.\n\n“Construction workers are a mobile workforce who may work across multiple sites and travel longer distances to work than other permitted workers,” Andrews said in a statement. “Concerns have also been raised, and remain, about the sector’s compliance with public health measures and directions.”\n\nMinister for Industrial Relations Tim Pallas was even more forceful, saying that his office has seen widespread non-compliance across the industry.\n\n“We’ve been clear: if you don’t follow the rules, we won’t hesitate to take action,” he said in the statement.\n\nWorkers will be required to show proof of at least one vaccine dose when sites reopen on Oct. 5, he added.\n\nNote to readers: Please click the share buttons above or below. Follow us on Instagram, @crg_globalresearch. Forward this article to your email lists. Crosspost on your blog site, internet forums. etc.", "opengraph": {}, "tags": ["Society", "Oceania"], "tweets": [], "movies": [], "links": ["https://www.instagram.com/crg_globalresearch/", "https://www.vba.vic.gov.au/news/news/2021/important-covid-19-update-mandatory-vaccination-for-construction-workers", "https://www.bbc.com/news/world-australia-58628629", "https://cg.cfmeu.org/news/cfmmeu-condemns-far-right-extremist-violence-0?fbclid=IwAR0gCck3hNHweGVkS-kivOwLlfpVMVBpzIIfs7inevj6QaE65NcAOQehtwk", "https://www.nytimes.com/2021/09/21/world/australia/australia-melbourne-vaccine-mandate-protest.html", "https://www.npr.org/2021/09/21/1039301977/anti-vaccine-protesters-clash-with-police-in-melbourne-for-the-second-straight-d", "https://www.facebook.com/masterbuildersvic/posts/5066923483320968", "https://7news.com.au/business/workplace-matters/melbourne-tradies-stage-protest-outside-cfmeu-headquarters-and-smash-window-c-4013877", "https://www.premier.vic.gov.au/construction-industry-shut-down-two-weeks", "https://www.flickr.com/photos/avlxyz/37217852115", "https://www.constructiondive.com/news/australian-government-shuts-down-melbourne-construction-sites-amid-protests/606979/", "https://www.asia-pacificresearch.com/author/jennifer-goodman", "https://www.constructiondive.com/news/australian-government-shuts-down-melbourne-construction-sites-amid-protests/606979/", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "24 September 2021"}