{"result_id": "037048", "URL": "https://www.asia-pacificresearch.com/asia-deadliest-covid-country-resist-vaccination/5629811", "timestamp": "2023-04-25 12:09:20 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.asia-pacificresearch.com/asia-deadliest-covid-country-resist-vaccination/5629811", "encoding": "UTF-8"}, "image": null, "domain": "www.asia-pacificresearch.com", "title": "Asia’s Deadliest COVID Country to Resist Vaccination | Asia-Pacific Research", "cleaned_text": "“My fellow Indonesians, at 9:42 this morning I took the major step as an Indonesian of receiving the coronavirus vaccine and freeing myself from the pandemic,” President Joko Widodo wrote on his Facebook page on December 13 as the Christmas-New Year Covid-19 infection rate set new records across the country.\n\nWith a reassuring “Safe and Halal” sign as a backdrop, the 59-year-old president launched the first round of inoculations of the Chinese Sinovac vaccine, whose efficacy rate is 65.3%, according to third phase trials conducted in Bandung, south of Jakarta.\n\nBut none of the volunteers were over 59, the most vulnerable age group, and there is concern about a similar trial conducted by Brazil’s Butantan Institute which recorded an efficacy rate of only 50.4%, barely above the World Health Organization’s (WHO) threshold to establish and maintain herd immunity.\n\nAlthough Sinovac recently received emergency approval from the Food and Drug Monitoring Agency (BPOM) and the Indonesian Ulema Council (MUI), the Widodo government will clearly have to do more to earn public trust as it prepares for one of the world’s biggest inoculation programs.\n\nAll vaccines must receive halal certification from the MUI to ensure they are permissible under Islamic law, an important step in the Muslim-majority nation, where it could become a serious impediment if not addressed.\n\nTwo years ago the council refused to sign off on a measles vaccine, declaring it to be haram because it was suspected of containing a pork-derived gelatin stabilizer used in some cases to prevent degradation during storage and transport.\n\nA Saiful Mujani Research & Consulting survey last month found that only 37% of respondents were willing to take what might be the life-saving jab, with 40% uncertain and 17% saying they would refuse it, mostly because of concerns over safety and effectiveness.\n\nHealth experts say even with a smooth rollout through hospitals and 10,000 first-level health clinics, it will be at least 15 months before the program reaches the percentage required for herd immunity among Indonesia’s 270 million-strong population.\n\nThe government estimates it will need 427 million doses, factoring in a wastage of 15%, to vaccinate a targeted 181.5 million citizens, with Widodo saying he wants that done by mid-2022.\n\nSome experts fear it may take three to four years, but with newly-appointed Health Minister Budi Sadikian, a proven manager, now at the helm there is optimism that the government now has the life-saving task in hand.\n\nAlthough only a drop in the bucket, the three million doses of Sinovac already available will initially go to healthcare workers, business people, community leaders, civil servants and members of the police and armed forces.\n\nThe government has signed deals for a further 125 million doses of Sinovac, which is expected to be available to inoculate another 65 million Indonesians, and 50 million vials each of the AstraZeneca (Britain) and Novavax (US) vaccines.\n\nBut negotiations with Pfizer have reached a stalemate over the US drug company’s insistence on a government-to-business contract for 50 million doses, along with the specialized cold storage facilities to store the vaccine at the required -70 degrees Celsius.\n\nImage below: Honesti Basyir takes questions from the press. Image: Facebook\n\nHonesti Basyir, president director of state-owned Bio Farma, Indonesia’s only vaccine manufacturer, says Pfizer wants to be immune of lawsuits resulting from any short or long-term side effects that may emerge during the rollout of the vaccine.\n\nIndonesia has still to complete a “cold chain” across the archipelago to handle the distribution of the vaccine, with Covid-19 Task Force spokesman Wiku Adisasmito indicating that it will be confined mainly to large urban centers.\n\nJakarta is also seeking 108 million free doses from GAVI, an alliance led by the WHO, the Bill & Melinda Gates Foundation, UNICEF and the World Bank which was created two decades ago to improve vaccination access for the world’s children.\n\nAlready considered to be unstated, Indonesia’s daily infection rate has doubled from 8,000 to as much as 14,000-plus in the past two weeks, a direct result of intra-provincial travel during the Christmas-New Year holiday break.\n\nThat has boosted total infections over the 900,000 mark, with the death toll verging on 26,000, or 250-300 a day.\n\nOfficials say isolation and intensive care units are at 80% capacity as the government implements a stricter set of health protocols in Java and on the tourist island of Bali to contain the latest surge, the worst since the crisis began.\n\nEast Java leads with 6,779 deaths, followed by Central Java with 4,375, Jakarta on 3,673 and West Java with 1,294 – Indonesia’s four most populous provinces that contribute to about 60% of the national total.\n\nThe lowest number of deaths have been recorded in West Kalimantan (28) and in West Sulawesi (57), the scene of last week’s 6.2 earthquake which killed more than 50 people and collapsed hundreds of buildings.\n\nIn Asia, a region that appears to have escaped the full brunt of the pandemic, Indonesia has the highest number of deaths per million at 5.52%, according to Statista. But its data shows that is still far less than countries in Europe and most other parts of the world.\n\nForeign nationals have been banned from entering Indonesia until January 28 to prevent the entry of the more infectious Covid-19 strains discovered in Britain, South Africa and Brazil. Domestic tourists can only travel internally after undergoing a swab anti-gen test and obtaining a digital health card.\n\nBut he also warned that much also depends on the availability of supply, an issue amplified by Health Minister Sadikan this week when he said the government may allow for private vaccination schemes after the completion of the first phase of the program to help fill any gap.\n\nOfficials say they will not force the vaccine on people, but will wait before imposing sanctions, which include a 100 million rupiah fines for those who don’t comply with quarantine restrictions or hinder the implementation of a vaccination program.\n\nNote to readers: please click the share buttons above or below. Forward this article to your email lists. Crosspost on your blog site, internet forums. etc.", "opengraph": {}, "tags": ["South-East Asia", "Science"], "tweets": [], "movies": [], "links": ["https://asiatimes.com/2021/01/asias-deadliest-covid-country-to-resist-vaccination/", "https://www.asia-pacificresearch.com/author/john-mcbeth", "https://asiatimes.com/2021/01/asias-deadliest-covid-country-to-resist-vaccination/", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "21 January 2021"}