{"result_id": "037009", "URL": "https://www.asia-pacificresearch.com/india-vaccine-drive-up-goes-awry-villagers-jump-river-evade-jab/5630315", "timestamp": "2023-04-25 12:08:14 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.asia-pacificresearch.com/india-vaccine-drive-up-goes-awry-villagers-jump-river-evade-jab/5630315", "encoding": "UTF-8"}, "image": null, "domain": "www.asia-pacificresearch.com", "title": "India: Vaccine Drive in Uttar Pradesh Goes Awry, Villagers Jump into River to Evade Jab | Asia-Pacific Research", "cleaned_text": "All Global Research articles can be read in 51 languages by activating the “Translate Website” drop down menu on the top banner of our home page (Desktop version).\n\nVisit and follow us on Instagram at @crg_globalresearch.\n\nDespite a sustained campaign and widespread publicity, vaccine hesitancy continues to prevail in the of Uttar Pradesh where the pandemic is spreading its tentacles.\n\nIn Sisoda village in Barabanki — where a group of residents jumped into the Saryu river to evade vaccination on Sunday — the residents remain firm in their decision of not getting the jab.\n\n“People have died even after getting vaccinated. I know of those who have had to be hospitalised after the jab. Jab marna hi hai to vaccine kyon?”\n\nShishupal, who has done matriculation, is convinced that the Covid vaccine is ‘harmful’ and spreads this ‘information’ among others.\n\n“I have got this information from several of my friends who work in big cities. I am convinced as the local officials have not answered my queries. My own uncle, who worked in Delhi, died a month after having both vaccine shots. What more proof do I need,” he asked.\n\nMohd Ahsan, another resident, was also unwilling to take the jab.\n\n“Is there a guarantee that we will not get infected after the vaccine? There are many in adjoining village who rushed to take the vaccine and then got infected. Why is the government pushing for vaccination-they should give it to those who want it,” he stated.\n\nBesides this, rumours abound in the village that the vaccine causes ‘impotence’ and this is mainly responsible for driving the men away.\n\nOn Sunday evening, a group of people in Sisoda village in Barabanki district had jumped into the Saryu river after seeing a team of health officials.\n\nThe health team had gone to the village to give Covid vaccination to the local residents.\n\nSub-Divisional Magistrate of Ramnagar tehsil, Rajiv Kumar Shukla, said about 200 people of the village ran away from the village because of the fear of vaccine and reached the Saryu shore. When the health team reached the river, these people jumped into the river.\n\nShukla said he made the villagers understand the importance and benefits of vaccination, and tried to dispel the myths, following which only 18 people in the village got the jabs.\n\nThe villagers said they jumped into the river because some people had told them that this was not a vaccine, but a poisonous injection.\n\nIt took a great deal of convincing to get people come out of the river.\n\nSisoda is a village with a population of 1,500 people located in the Terai, 70 km from the district headquarters of Barabanki.\n\nNodal Officer Rahul Tripathi said that they were continuing efforts to convince the local people about the benefits of vaccination and also dispel misconceptions.\n\nChief Minister Yogi Adityanath has announced reward for Covid-free villages with ‘Mera Gaon-Corona Mukt Gaon‘ campaign.\n\nNote to readers: Please click the share buttons above or below. Follow us on Instagram, @crg_globalresearch. Forward this article to your email lists. Crosspost on your blog site, internet forums. etc.", "opengraph": {}, "tags": ["Science", "Media", "South Asia"], "tweets": [], "movies": [], "links": ["https://ummid.com/news/2021/may/07.05.2021/covid-situation-in-uttar-pradesh-rural.html", "https://ummid.com/news/2021/may/24.05.2021/covid-vaccine-drive-in-uttar-pradesh.html", "https://www.asia-pacificresearch.com/author/ummid-com", "https://ummid.com/news/2021/may/24.05.2021/covid-vaccine-drive-in-uttar-pradesh.html", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "26 May 2021"}