{"result_id": "037021", "URL": "https://www.asia-pacificresearch.com/why-japan-lags-covid-19-vaccine-race/5629656", "timestamp": "2023-04-25 12:08:34 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.asia-pacificresearch.com/why-japan-lags-covid-19-vaccine-race/5629656", "encoding": "UTF-8"}, "image": null, "domain": "www.asia-pacificresearch.com", "title": "Why Japan Lags in the COVID-19 Vaccine Race | Asia-Pacific Research", "cleaned_text": "For readers who might wish to compare its message with the usual image of a competent Japanese pharmaceutical industry – one that remains among the largest in the world after the US and China, with a world market share of approximately 7% – here’s a recent news item Asia Times asked me to unpack:\n\nJapan-made coronavirus vaccines may not be available until 2022. Coronavirus vaccines developed in Japan are unlikely to become available for practical use until at least 2022, according to industry officials. Only one company in Japan is conducting a trial of a vaccine. Foreign rivals lead the development of vaccines because know-how has been accumulated even in peacetime from the perspective of national security, an official at a major Japanese pharmaceutical firm said.\n\nThe disconnect between past successes and current acceptance of lack of know-how needn’t be all that mystifying.\n\nIndustry sources paint the big picture for us:\n\nThe pharmaceutical market in Japan has shown small growth rates in the past years. A complex regulatory and pricing process, as well as the regular price cuts, have made it difficult for pharmaceutical companies to introduce new innovative products. Another reason for the stagnant market is the promotion of generic drugs adopted by the government since 2007 in order to reduce the healthcare expenditures in Japan. The volume share of generics has more than doubled during the last decade and is still on the rise.\n\nThis could partially explain why Japan apparently will be relying at first on foreign vaccines, with Pfizer and AstraZeneca both reportedly running tests in the country.\n\nThat said, I have additional thoughts addressing the cited news story – including what may be its most provocative sentence, the one about a “national security” angle that is said to have kept the Japanese industry from acquiring know-how.\n\nDoes that mean the Japanese government has not been pushing companies to develop such know-how while governments in some other countries have?\n\nMy short answer: Yes, but what’s new? This, after all, is post-World War II Japan.\n• The most cost-effective way to hold down Covid-19 is a mask. Japan has one of the highest mask-wearing rates and one of the lowest death rates from Covid 19: fewer than 3,000 died in the past 12 months out of a population of 126,000,000.\n• Yes, you still get waves. The current third wave is peaking and cases should drop toward January, but the fourth wave should be in March. But we are not talking millions of cases and hundreds of thousands of deaths as in other countries that cannot keep their masks on. Japan’s strategy of using masks to buy time has worked very well.\n• A 100-yen mask probably has more than 90% efficacy if worn by over 95% of the community. That’s almost as good an outcome you’d get from a messenger RNA-based vaccine refrigerated at minus 80 degrees centigrade and inoculated at 5,000 yen per arm – twice.\n• Unlike Taiwan, South Korea and Hong Kong, Japan did not experience MERS or SARS. The nation thinks it is a first-world nation that practices first-rate public hygiene. Complacency? Yes, some of that. But common sense says: Wear a mask.\n• National security considerations for a country that retired its last F4 Phantom, a Vietnam-era relic, just last month? Again complacency? Yes, some of that. But common sense, too. It is not the vintage of the jet that counts. In a truly defense-only strategy it is the kill rate of the anti-aircraft missile, whether launched from a stealthy F35 or from a shoulder of an illiterate teenager. Think mask.\n• Japanese scientists would be the first to acknowledge that Japan is behind the front line pharmas of the US and EU when it comes to DNA/RNA based pharmaceuticals. The nation is still allergic to recombinant technology whether it be for food or medicine. Blame that on the Ministry of Education.\n• Japanese medical professionals would be the first to complain that the Health Ministry has a tendency to take its time approving anything new. This is the legacy of thalidomide, HIV-infected supplements for hemophiliacs and other missteps in the past. The nation rewards caution more than it rewards those first across the ever-changing finish line.\n• How a society addresses its technological challenges is revealing. American astronauts discovered that they could not use ballpoint pens (patented in 1888) in low-gravity space; they asked for a new technology. How did the Russian cosmonauts address the issue? Pencils.\n• While we wait for the vaccine, wear a mask.\n\nNote to readers: please click the share buttons above or below. Forward this article to your email lists. Crosspost on your blog site, internet forums. etc.\n\nA retired Tokyo-based analyst for a major US investment bank, Matt Aizawa now crunches numbers beside a lake north of the city.", "opengraph": {}, "tags": ["East Asia", "Science"], "tweets": [], "movies": [], "links": ["https://www.japantimes.co.jp/news/2020/12/04/national/japanese-coronavirus-vaccines-2022/", "https://www.statista.com/topics/4544/pharmaceutical-industry-in-japan/", "https://www.statista.com/statistics/739179/total-drug-production-value-japan/", "https://www.statista.com/statistics/801562/japan-generics-drug-market-sales-revenue/", "https://www.statista.com/statistics/799622/japan-generics-market-volume-share/", "https://asiatimes.com/2020/12/why-japan-lags-in-the-covid-19-vaccine-race/?mc_cid=8519c77dd0&mc_eid=61b4b7d446", "https://www.asia-pacificresearch.com/author/matt-aizawa", "https://asiatimes.com/2020/12/why-japan-lags-in-the-covid-19-vaccine-race/?mc_cid=8519c77dd0&mc_eid=61b4b7d446", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "19 December 2020"}