{"result_id": "037022", "URL": "https://www.asia-pacificresearch.com/we-can-breathe-again-philippines-lift-mandatory-use-face-mask-outdoors/5631331", "timestamp": "2023-04-25 12:08:35 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.asia-pacificresearch.com/we-can-breathe-again-philippines-lift-mandatory-use-face-mask-outdoors/5631331", "encoding": "UTF-8"}, "image": null, "domain": "www.asia-pacificresearch.com", "title": "We Can Breathe Again. Philippines to Lift the Mandatory Use of Face Mask Outdoors | Asia-Pacific Research", "cleaned_text": "All Global Research articles can be read in 51 languages by activating the “Translate Website” drop down menu on the top banner of our home page (Desktop version).\n\nFollow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\nToday, September 7, the Philippine Inter-agency Task Force for the Management of Emerging Infectious Diseases (IATF-EID) has finally passed a recommendation on the voluntary use of face mask outdoors to the office of the President. The country awaits an executive order for its implementation.\n\nWhile the President expresses optimism over the proposal, the Department of Health and other authorities demonstrate reluctance to lift this health protocol which comes from a flawed scientific reference on the effectiveness of face masks against viral transmission.\n\nIt should be recalled that since the onset of the pandemic, people have been religiously wearing the face mask (others even wore two or more at a time), but that did not prevent the rise in the so-called “COVID-19 confirmed cases”. Now, with a reported average of daily cases at 0.017% of the total population, what other evidence is necessary to justify the lifting of the use of face mask?\n\nThe Philippines is among the remaining countries to impose mandatory wearing of face mask in both indoor and outdoor areas.\n\n*\n\n Note to readers: Please click the share buttons above or below. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\nJezile Torculas has a bachelor’s degree in Political Science. She is an Assistant Editor at the Centre for Research on Globalization (CRG).\n\nFeatured image is from Flickr, licensed under Creative Commons\n\nYou may also purchase directly at DonorBox “Worldwide Corona Crisis” Campaign Page! (NOTE: User-friendly)", "opengraph": {}, "tags": ["South-East Asia", "Science"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/IJiNQuW?EMAIL=&go.x=0&go.y=0&go=GO", "https://www.instagram.com/globalresearch_crg/", "https://twitter.com/CrGlobalization", "https://t.me/gr_crg", "https://www.pna.gov.ph/articles/1183130", "https://doh.gov.ph/covid19tracker", "https://store.globalresearch.ca/store/the-worldwide-corona-crisis-global-coup-d%C3%A9tat-against-humanity/", "https://donorbox.org/the-worldwide-corona-crisis-global-coup-d-etat-against-humanity", "https://www.asia-pacificresearch.com/author/jezile-torculas", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "7 September 2022"}