{"result_id": "037036", "URL": "https://www.asia-pacificresearch.com/funeral-rites-covid-zero/5630764", "timestamp": "2023-04-25 12:09:03 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.asia-pacificresearch.com/funeral-rites-covid-zero/5630764", "encoding": "UTF-8"}, "image": null, "domain": "www.asia-pacificresearch.com", "title": "Funeral Rites for COVID Zero | Asia-Pacific Research", "cleaned_text": "All Global Research articles can be read in 51 languages by activating the “Translate Website” drop down menu on the top banner of our home page (Desktop version).\n\nVisit and follow us on Instagram at @crg_globalresearch.\n\nIt was such a noble public health dream, even if rather hazy to begin with. Run down SARS-CoV-2. Suppress it. Crush it. Or just “flatten the curve”, which could have meant versions of all the above. This created a climate of numerical sensitivity: a few case infections here, a few cases there, would warrant immediate, sharp lockdowns, stay-at-home orders, the closure of all non-vital service outlets.\n\nThen came mutations and variants. Delta became the word mentioned like a terrorist saboteur, placing bombs under the edifice of the health system. The pro-market factions within governments receptive to using lockdown formulas could claim that harsh stay-at-home rules were not working. It was time to open up the economy; time to live with the virus, and, consequently, a good number of deaths. It was time for the epidemiologists to do more modelling.\n\nA crucial factor to this was the arrival of COVID-19 vaccines and the acceleration of vaccination programs. Studies showing how increased vaccination coverage would reduce cases of COVID-19 and precipitate a fall in hospitalisation began to catch the attention of policy makers. One, a preprint and yet to be peer-reviewed paper from August, looked at the effects of vaccination coverage among the 112 most populous counties in the United States. It found that a 10 percent increase in vaccination coverage could be associated with a 28.3 percent decrease in the rate of hospitalisation and a 16.6 percent decrease in COVID-19 hospitalisations per 100 cases.\n\nIn Australia, New South Wales became the first state to accept that a lockdown policy coupled with a mass vaccination push, the stress being on the latter, would be necessary to cope with the ravages of the Delta variant. Eventually, the number of infections would fall, as they now seem to be doing. “What we need to do is all of us have to start accepting that we need to live with COVID because COVID would be around for three or four years,” the now departed Premier Gladys Berejiklian stated in September. But it was less a stance of wisdom than one of necessity, given the initially carefree approach of the Berejiklian government to staying open despite the dangers posed by new variants. “We have to live with the virus,” meant not having to say sorry.\n\nVictoria followed, digesting a harsh reality that the virus, active and present, had ceased to be ineradicable. It had not been that long ago that the same government had proclaimed that it had “run the virus” into the ground like an unwanted invader. But Melbourne, the city lockdown for the longest period on this planet, went the way of Sydney, despite having more stringent measures in place. “We think there may be a number that is not zero but is low that we can contain,” Victoria’s Premier Daniel Andrews cryptically speculated. A debate was taking place on “a sweet spot that is not zero, but it’s not so high”. A stumbled slaying of the COVID Zero vision, but a slaying nonetheless.\n\nEven as this was taking place, the true believers, largely untouched by the effects of the virus in the first place, continued to believe in a certain public health heaven. West Australian Premier Mark McGowan made clear his ambitions of keeping his state “unscathed” which prompted observations that West Australia might become a bastion of COVID-19 “secessionism”.\n\nRecently, two countries also removed their names from one of the world’s shortest lists, reading COVID Zero its funeral rites. There was New Zealand’s Prime Minister Jacinda Ardern, whose country had followed the elimination strategy for a year and a half, discarding it in full view of the press. In doing so, she used the word “transitioning”. “We’re transitioning from our current strategy to a new way of doing things,” she revealed to reporters earlier this month. “With Delta, the return to zero is incredibly difficult, and our restrictions alone are not enough to achieve that quickly. In fact, for this outbreak, it’s clear that long periods of heavy restrictions has not got us to zero cases.” Some imagery was in order: “What we have called a long tail feels more like a tentacle that has been incredibly hard to shake.”\n\nThere was Singapore, a model example of strict border controls despite being a global economic hub, a nation-state dedicated to firm contact tracing, social distancing and mask mandates. Having reached a vaccination rate in the populace of 80 percent, the government was keen to move the small country towards a “living with COVID-19” strategy.\n\nThe co-chair of the COVID multi-ministry taskforce (MTF), Lawrence Wong, went so far on October 2 as to suggest that “sooner or later, many of us will end up catching the virus, but we will have zero or mild symptoms (and) recover from home after a few days”. While 98 percent of those catching the virus would not fall seriously ill, two percent probably would suffer severely. Wong also thought it important to say that the government was stabilising “our protocols [to] make sure the procedures are in place and build up the necessary capacity (in the health care system)”.\n\nIt was telling that these words were coming from the finance minister, rather than a public health official of Spartan gravity and moral severity. In New South Wales, Dominic Perrottet, the new premier, till recently the state’s Treasurer, is an open-economy hawk in the face of the lockdown lobby. The pendulum is again swinging in pandemic health, and the citizens of the once COVID zero countries are being softened for tolerable mortality and acceptable risk.\n\nNote to readers: Please click the share buttons above or below. Follow us on Instagram, @crg_globalresearch. Forward this article to your email lists. Crosspost on your blog site, internet forums. etc.\n\nDr. Binoy Kampmark was a Commonwealth Scholar at Selwyn College, Cambridge. He lectures at RMIT University, Melbourne. He is a frequent contributor to Global Research and Asia-Pacific Research. Email: [email protected]", "opengraph": {}, "tags": ["Politics", "Justice", "Oceania"], "tweets": [], "movies": [], "links": ["https://www.instagram.com/crg_globalresearch/", "https://www.medrxiv.org/content/10.1101/2021.08.17.21262195v2", "https://www.skynews.com.au/australia-news/coronavirus/watch-live-gladys-berejiklian-announces-latest-covid19-cases-in-new-south-wales/news-story/74dc516013e6857346390be294bd06fd", "https://www.afr.com/policy/health-and-education/victoria-abandons-covid-zero-but-national-plan-in-doubt-20210831-p58ngs", "https://spectator.com.au/2020/09/wa-labor-the-new-covid-secessionists/", "https://www.nytimes.com/2021/10/04/world/australia/new-zealand-covid-zero.html", "https://thediplomat.com/2021/10/singapore-and-the-philippines-from-zero-covid-19-to-living-with-covid-19/", "https://news.yahoo.com/sooner-later-many-catching-covid-lawrence-wong-112206219.html", "/cdn-cgi/l/email-protection#44262f2529342925362f042329252d286a272b29", "https://www.asia-pacificresearch.com/author/binoy-kampmark", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "15 October 2021"}