{"result_id": "037015", "URL": "https://www.asia-pacificresearch.com/pakistan-police-superintendent-malik-imtiaz-mahmood-drops-dead-minutes-after-experimental-covid-19-vaccine/5630465", "timestamp": "2023-04-25 12:08:25 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.asia-pacificresearch.com/pakistan-police-superintendent-malik-imtiaz-mahmood-drops-dead-minutes-after-experimental-covid-19-vaccine/5630465", "encoding": "UTF-8"}, "image": null, "domain": "www.asia-pacificresearch.com", "title": "Pakistan: Police Superintendent Malik Imtiaz Mahmood Drops Dead Minutes after Experimental COVID-19 “Vaccine” | Asia-Pacific Research", "cleaned_text": "All Global Research articles can be read in 51 languages by activating the “Translate Website” drop down menu on the top banner of our home page (Desktop version).\n\nVisit and follow us on Instagram at @crg_globalresearch.\n\nA police superintendent is dead in what may be the fastest death we’ve covered on this blog.\n\nMr. Malik Imtiaz Mahmood was the Superintendent of Police for the city of Khushab. He received his experimental injection against COVID-19 on or around June 13, according to the World Doctors Alliance. The organization shared a photo of Mr. Mahmood receiving the injection.\n\nDetails are sketchy as to what exactly happened next. But a disturbing video shows Mr. Mahmood clutch his heart and drop to the ground, apparently just minutes after receiving the shot.\n\nThe Namal reported that Mr. Mahmood died of a heart attack. It is unclear which injection he received. The China-made “inactivated virus” Sinopharm and Sinovac, Russia’s Sputnik V, AstraZeneca and the CanSino (China-made viral vector DNA) shots are all authorized for emergency use in Pakistan.\n\nThe country also ordered 13 million Pfizer doses late last month. Pakistan processes and packages the CanSino shots at its own labs. Most Pakistanis receive one of the China-made injections. But many Pakistanis travel abroad for work and need AstraZeneca or Pfizer to enter their host countries.\n\nFurther the Pakistani government punishes people for refusing the experimental injections. Some provinces cut off your cell phone service for refusing the shots. Others withhold paychecks until you show proof of vaccination. Pakistan suspended 70 military troops without pay for refusing the injections in January.\n\nOne of the early cases that inspired the creation of this blog was Tiffany Pontes Dover. She was a nurse at CHI Memorial Hospital in Chattanooga, Tennessee, but lived in a nearby Alabama town. Ms. Dover, 30, received the experimental Pfizer mRNA injection on live TV on December 17, 2020.\n\nLess than 20 minutes later, she passed out, on live television.\n\nThe story was insulting to the intelligence of critical thinkers. Ms. Dover got on camera shortly thereafter and said she passes out all the time, specifically “six times in the last six weeks.” How can someone work as a critical care nurse and pass out so frequently? The subterfuges continued when the hospital staged some “Welcome back Tiffany” thing where the masked nurse clearly was not Tiffany Dover.\n\nThe truth is that she’s likely dead. But we’ll never hear that from mainstream media. What a disaster that would be for Pfizer and all these other companies if one of the first recipients of their poison died immediately on live television. Thus the story has been manipulated and suppressed. We knew our platform was necessary from that point forward.\n\nThese instant deaths after experimental injections are not anomalies. The following video is from a vaccine clinic in Mexico. Watch the woman in the background fall out of her chair and have a seizure just minutes after receiving the injection.\n\nWhat we know for certain now is that the viral RNA (spike proteins) in these shots spreads to every organ in your body. We also know that the spike proteins cause blood clots. Whether you die in minutes, days, weeks or months after the experimental shots, it’s likely going to happen within a year or two. Blood clots are inevitable after any of the experimental viral vector DNA or mRNA shots.\n\nThe only way to protect yourself is to avoid the injections. Stay vigilant and protect your friends and loved ones.\n\nNote to readers: Please click the share buttons above or below. Follow us on Instagram, @crg_globalresearch. Forward this article to your email lists. Crosspost on your blog site, internet forums. etc.", "opengraph": {}, "tags": ["Science", "South Asia"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "690", "height": "400", "embed_code": "<iframe loading=\"lazy\" title=\"YouTube video player\" src=\"https://www.youtube.com/embed/vrn510otd7o\" width=\"690\" height=\"400\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/vrn510otd7o"}], "links": ["https://www.instagram.com/crg_globalresearch/", "https://t.me/worlddoctorsalliance", "https://www.asia-pacificresearch.com/wp-content/uploads/2021/07/Screen-Shot-2021-07-05-at-10.28.18-PM.png", "https://thecovidblog.com/2021/07/03/pakistan-police-superintendent-malik-imtiaz-mahmood-drops-dead-minutes-after-experimental-covid-19-vaccine/", "https://thenamal.com/featured/khushab-sp-investigation-imtiaz-malik-dies-of-heart-attack-in-front-of-camera/", "https://thecovidblog.com/2021/03/29/peru-young-doctor-dead-three-weeks-after-sinopharm-covid-19-vaccine/", "https://thecovidblog.com/2021/06/10/arlene-tolibas-55-year-old-filipino-actress-and-comedienne-dead-three-weeks-after-second-experimental-sinovac-coronavac-shot/", "https://www.dawn.com/news/1623682", "https://www.reuters.com/world/asia-pacific/pakistan-receive-13-mln-doses-pfizer-vaccine-minister-2021-06-22/", "https://www.reuters.com/world/asia-pacific/pakistan-produces-chinese-cansinobio-covid-vaccine-brands-it-pakvac-2021-06-04/", "https://www.cnn.com/2021/06/28/asia/pakistan-expatriates-vaccination-center-intl-hnk/index.html", "https://www.nytimes.com/2021/06/15/world/pakistan-vaccine-cellphones.html", "https://www.france24.com/en/live-news/20210701-pakistan-suspends-70-paramilitary-troops-for-refusing-vaccine", "https://www.asia-pacificresearch.com/wp-content/uploads/2021/07/Screen-Shot-2021-07-05-at-10.29.06-PM.png", "https://thecovidblog.com/2021/07/03/pakistan-police-superintendent-malik-imtiaz-mahmood-drops-dead-minutes-after-experimental-covid-19-vaccine/", "https://www.reuters.com/article/uk-factcheck-nurse-covid-vaccine-dead-idUSKBN29629G", "https://www.ibtimes.sg/tiffany-dover-creepy-instagram-post-tennessee-nurse-who-fainted-after-covid-19-shot-reignites-55854", "https://thecovidblog.com/2021/06/28/7-stories-in-june-mainstream-media-buried-and-big-tech-censored/", "https://www.salk.edu/news-release/the-novel-coronavirus-spike-protein-plays-additional-key-role-in-illness/", "https://thecovidblog.com/2021/07/03/pakistan-police-superintendent-malik-imtiaz-mahmood-drops-dead-minutes-after-experimental-covid-19-vaccine/", "https://www.asia-pacificresearch.com/author/thecovidblog", "https://thecovidblog.com/2021/07/03/pakistan-police-superintendent-malik-imtiaz-mahmood-drops-dead-minutes-after-experimental-covid-19-vaccine/", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "5 July 2021"}