{"result_id": "037030", "URL": "https://www.asia-pacificresearch.com/blinkens-single-point-agenda-in-delhi-china/5630557", "timestamp": "2023-04-25 12:08:53 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.asia-pacificresearch.com/blinkens-single-point-agenda-in-delhi-china/5630557", "encoding": "UTF-8"}, "image": null, "domain": "www.asia-pacificresearch.com", "title": "Blinken’s Single-point Agenda in Delhi – China | Asia-Pacific Research", "cleaned_text": "All Global Research articles can be read in 51 languages by activating the “Translate Website” drop down menu on the top banner of our home page (Desktop version).\n\nVisit and follow us on Instagram at @crg_globalresearch.\n\nThe overnight visit by US Secretary of State Antony Blinken to New Delhi has been an eye-opener in many ways. It highlighted how much India has changed through the searing pain and suffering it underwent in the past one-year period and how that tumultuous period also led to a reset in the government’s calculus.\n\nA rethink in the foreign policies became inevitable. The ‘body language’ of the joint press conference by Blinken and his Indian host External Affairs Minister S. Jaishankar on Wednesday testifies to it.\n\nThe US-Indian relationship remains fundamentally strong insofar it enjoys bipartisan support in both countries that it is a consequential relationship. But beneath that threshold, fault lines have appeared.\n\nFirst and foremost, the Biden administration’s neoconservative ideology obliges it to adopt intrusive policies on issues of democracy, human rights and rule of law, which grates on the Modi government’s sensitivities.\n\nParadoxically, some of the most pro-American sections of Indian opinion also happen to be the harshest critics of the Modi government today. Their alienation is so deep that they won’t even mind joining hands with the Indian left in berating the Modi government.\n\nBlinken’s move to hold a ‘civil society roundtable’ discussion with a group of Indians conveyed a powerful message to the Modi Government that things may not be as bad as in Belarus or Myanmar, but India is being perceived by the Biden Administration more or less the same way as Recep Erdogan’s Turkey — an ally who is straying toward post-modern authoritarianism. An AFP dispatch from Delhi reported that at the discussion, Blinken “issued a veiled warning… about Indian democracy backsliding.” read more\n\nNo amount of wordplay by Blinken could cover up the reality that he had no word of praise for the Modi Government. Nor did Jaishankar appear particularly perturbed by that.\n\nEstimating correctly that the Biden Administration is unlikely to easily abandon the goals it has been pursuing, Jaishankar was in no mood to apologise, either.\n\nAnd at one point, he interjected at the press conference to defiantly point out that “the quest for a more perfect union applies as much to the Indian democracy as it does to the American one.” Jaishankar asserted that “it is the moral obligation of all polities to right wrongs when they have been done, including historically. And many of the decisions and policies you’ve seen in the last few years fall in that category.”\n\nHe held the ground that “freedoms are important, we value them, but never equate freedom with non-governance or lack of governance or poor governance. They are two completely different things.” It is difficult to recall an Indian minister in modern times pushing back at the US publicly. read more\n\nThe press conference also highlighted the deep disillusionment in Delhi over the irresponsible manner in which the US cut loose and exited Afghanistan, leaving that country in shambles and jeopardising regional security — and stability and billions of dollars worth Indian investment in that country, both in financial support and technical assistance and in engineering projects.\n\nJaishankar noted bitterly that outcomes are being decided in the battlefield in Afghanistan and alluded to continuing Pakistani interference. He didn’t take Blinken’s easy route to put the blame on the Taliban and instead underscored the “broad consensus, deep consensus” among most of the neighbours of Afghanistan that there should be a political settlement.\n\nCertainly, Washington’s clumsy rearguard action to create another QUAD (Quadrilateral Diplomatic Platform) comprising the US, Uzbekistan, Afghanistan and Pakistan with a view to remaining embedded in the region even after the humiliating defeat in the 20-year war would have come as a nasty surprise to Delhi and prompted it to slam the door shut on any form of bandwagoning with America in the Hindu Kush. The dryness in Jaishankar’s tone had a tinge of contempt.\n\nAs regards the all-important Covid-19 vaccines, Blinken didn’t say a word about TRIPS waiver, which was an Indian initiative. Quite obviously, Biden who initially supported the initiative since quietly backtracked under pressure from the powerful Pharma companies and their political lobby and is now accepting their argument that the real solution lies in quickly relieving the global COVID-19 vaccine imbalance by pushing a package of interventions, including limiting export restrictions, improving vaccine manufacturing in the global south, and issuing voluntary licenses that would allow specific manufacturers to avoid intellectual property restrictions, but without instituting a universal waiver.\n\nSo, at the end of the day, Blinken made a grand announcement that US will supply 25 million doses of vaccine to India! From past experience, India is unsure whether even this paltry donation isn’t another empty promise. Jaishankar didn’t react.\n\nBlinken also avoided making any assurances to give India full access to the raw materials for vaccine production. Did Blinken make any trade concessions to ease India’s post-pandemic economy recovery? Will the US help us to avoid another apocalyptic scenario when the 3rd Wave arrives? Did he promise to invest in India to create jobs? Did he have any advice how Indian Army can resume patrolling on Depsang Plains? No, none of that.\n\nBlinken’s real mission was without doubt to stop India from drifting away from the US-led anti-China coalition. The Biden Administration is worried that without India, the QUAD would unravel and the containment strategy against China wouldn’t gain traction in Asia.\n\nThus, in the typical American way to hustle difficult partners, Blinken began with a bang by meeting Tibetan representatives — the first of its kind in India or in a third country by US officials — which was a calculated move to create misleading optics that would queer the pitch of India-China tensions.\n\nThis is no way to treat a hospitable friend — undercutting his standing while enjoying his hospitality at his home. It only shows how testy the Blinken administration is nowadays when it comes to China.\n\nBut Blinken underestimated the fault lines in the US-Indian relationship and the widening chasm between the two countries over the range of issues concerning Afghanistan, vaccine distribution and human rights issues. This was a rare India-US high-level exchange where there was hardly any rhetoric directed against China.\n\nHaving said that, the strong likelihood is that India may take part in the face-to-face meet to discuss QUAD, which President Biden plans to convene. That will be a defining moment, as the US intention is to create a regional mechanism to strategically contain and exert pressure on China — simply put, to institutionalise the QUAD, where all four countries have their own reasons to address the perceived pressures and challenges posed by China’s rise.\n\nThe Quad’s record so far is dismal — be it on Covid vaccines, supply chains on rare earths or as counter to China’s Belt and Road. Yet, the way forward in US-China relations is expected to be rocky and the Biden Administration hopes to suppress China.\n\nIndeed, the strategic contradictions are self-evident insofar as all the QUAD countries, including the US, also have need for bilateral economic cooperation and even regional cooperation with China. When the top dog in the QUAD slyly keeps the door open for cooperation, the choice for the three subalterns couldn’t be clearer.\n\nIndia needs to continue to walk the fine line both to avoid collateral damage from the Biden administration’s zigzagging policies on China as well as to keep its own autonomy to negotiate with China bilaterally. Biden is a highly experienced politician and if he gets to realise the futility of trying to suppress China, a pattern of co-existence may well emerge.\n\nNote to readers: Please click the share buttons above or below. Follow us on Instagram, @crg_globalresearch. Forward this article to your email lists. Crosspost on your blog site, internet forums. etc.\n\nFeatured image: Indian Foreign Minister Subrahmanyam Jaishankar (R) welcomes the US Secretary of State Antony Blinken, New Delhi, July 28, 2021. (Source: Indian External Affairs Ministry / ANADOLU AGENCY / Anadolu Agency via AFP)", "opengraph": {}, "tags": ["Politics", "USA", "China", "South Asia"], "tweets": [], "movies": [], "links": ["https://www.instagram.com/crg_globalresearch/", "https://www.globaltimes.cn/page/202107/1229877.shtml", "https://www.state.gov/secretary-antony-j-blinken-and-indian-external-affairs-minister-dr-subrahmanyam-jaishankar-at-a-joint-press-availability/", "https://www.indianpunchline.com/blinkens-single-point-agenda-in-delhi-china/", "https://www.asia-pacificresearch.com/author/m-k-bhadrakumar", "https://www.indianpunchline.com/blinkens-single-point-agenda-in-delhi-china/", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "30 July 2021"}