{"result_id": "037039", "URL": "https://www.asia-pacificresearch.com/india-brink-sanitary-catastrophe/5630300", "timestamp": "2023-04-25 12:09:07 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.asia-pacificresearch.com/india-brink-sanitary-catastrophe/5630300", "encoding": "UTF-8"}, "image": null, "domain": "www.asia-pacificresearch.com", "title": "India on the Brink of Sanitary Catastrophe | Asia-Pacific Research", "cleaned_text": "All Global Research articles can be read in 51 languages by activating the “Translate Website” drop down menu on the top banner of our home page (Desktop version).\n\nVisit and follow us on Instagram at @crg_globalresearch.\n\nThe pandemic is hitting India hard. In recent weeks, the world has turned its attention to this Asian country, which, despite having passed with little damage by the first wave of COVID-19, began to suffer strongly between the end of 2020 and the beginning of 2021, with the second wave being marked by the appearance of a new variant of the virus, much more lethal than the first one. The country records 26 million cases of contamination, with 300 thousand deaths and an average of daily deaths of almost 4 thousand people.\n\nIn addition to the coronavirus, India is suffering from the outbreak of a lethal fungus, popularly known as “black fungus”, which causes the mucormycosis disease. This disease already existed in India before the pandemic, but was considered rare, having reached an extraordinary increase with the new variant of COVID-19. Being caused by exposure to fungi of the genus Mucor, commonly found in soil, in the air and even in the nose and human mucus, the disease spreads through the respiratory tract and corrodes facial structures. Associated with coronavirus, mucormycosis has much more serious effects and considerably increases chances of death. Sometimes, doctors need to surgically remove the eye to prevent the infection from reaching the brain of a patient. The inadequate sanitary conditions in the treatment centers allow the exposure to the fungus, which has already resulted in 9 thousand cases of infection.\n\nThe Indian scenario is catastrophic. Lack of oxygen in hospitals, crowded crematoriums, lack of ambulances and people dying on the streets have become commonplace in Indian daily life. In addition to the terrifying official figures, there is still a strong concern about underreporting, due to the difficulty of the Indian state in controlling some of the country’s most isolated regions. The economic and social consequences make the situation even worse. About 230 million Indians have fallen into poverty due to the coronavirus pandemic, with young people and women being the most affected. The confinement implemented for months in India has left around 100 million people unemployed, according to a report by Azim Premji University published in early May. About 47% of those affected by unemployment are women, which also hinders the slow process of social inclusion of women and gender equality in the country.\n\nInterestingly, there is a contradictory point in the Indian crisis: the country is the world’s largest manufacturer of vaccines – and even so, it continues to move towards the health catastrophe. There are two main vaccine producers on Indian soil, the Serum Institute, in the city of Pune, which is producing the Oxford/AstraZeneca vaccine; and Bharat Biotech, in Hyderabad, which is producing its own vaccine. The Indian government authorized companies to start producing doses last year and the country quickly became the largest global producer. Large-scale production was part of a strategy by the Indian government to combat the pandemic – it was believed that, with more production, greater the national stock of doses. But most of the vaccines produced on Indian soil were destined for export and with the worsening of the internal crisis, manufacturing decreased considerably due to the lack of resources, making the national stock insufficient to contain the infection cycle.\n\nThe shortage of vaccines, however, was only realized after the government initiated a comprehensive mass vaccination plan in early May. Only 41 million people were fully vaccinated, while 104 million received the first dose. In many countries, this number would be significant, but in a nation with 1.4 billion inhabitants, the data are extremely low. In response to the crisis, the government has banned the export of vaccines. The objective is to preserve all the resources available to vaccinate the Indian population, but this will result in a great loss for several countries that depend on Indian vaccines – some of these countries have already paid in advance for millions of doses that will be sent only at the end of 2021, when the Indian government hopes to resume export.\n\nThe crisis reveals serious strategic mistakes by the government. The first mistake was to ignore the gravity of the first wave. Due to the low number of cases – compared to the rest of the world – the Indian government has failed to supervise sanitary policies. Agglomerations were part of Indian daily life throughout the year 2020, without any measures being taken to maintain health care. A second mistake was the national vaccine production plan. In fact, the most correct thing to do would be to focus on internal supply and establish as a contractual condition with pharmaceutical companies for production the reservation of a considerable number of doses so that in a few months there would be enough stock to vaccinate the population.\n\nIt is also necessary to emphasize how the absence of economic strategy has harmed India, leaving millions of people into poverty and unemployment without any social support. Lacking assistance, people cannot remain isolated in their homes – the tendency is for them to leave more and more, in search of work or other means of obtaining resources. This creates a vicious cycle of simultaneous increase in poverty and infection.\n\nDespite still producing many vaccines, India will have no stock for 1 billion people and no resources to continue large-scale manufacture, which means that New Delhi will begin to import large quantities of doses. The situation is truly worrying in India and the country is unlikely to recover without strong international cooperation – both for sending vaccines and for economic aid.\n\nNote to readers: Please click the share buttons above or below. Follow us on Instagram, @crg_globalresearch. Forward this article to your email lists. Crosspost on your blog site, internet forums. etc.\n\nLucas Leiroz is a research fellow in international law at the Federal University of Rio de Janeiro.", "opengraph": {}, "tags": ["Science", "South Asia"], "tweets": [], "movies": [], "links": ["http://infobrics.org/post/33393/", "https://www.asia-pacificresearch.com/author/lucas-leiroz", "http://infobrics.org/post/33393/", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "24 May 2021"}