{"result_id": "037018", "URL": "https://www.asia-pacificresearch.com/australia-hermit-nation-strategy-unravels/5630513", "timestamp": "2023-04-25 12:08:30 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.asia-pacificresearch.com/australia-hermit-nation-strategy-unravels/5630513", "encoding": "UTF-8"}, "image": null, "domain": "www.asia-pacificresearch.com", "title": "Australia’s Hermit Nation Strategy Unravels | Asia-Pacific Research", "cleaned_text": "All Global Research articles can be read in 51 languages by activating the “Translate Website” drop down menu on the top banner of our home page (Desktop version).\n\nVisit and follow us on Instagram at @crg_globalresearch.\n\nAustralia, like other island states, has had spells of isolationist fancy and hermit dispositions. Protected by geography, distant and vast, the country’s first bit of legislation in 1901 was the Immigration Restriction Act. This nasty little statute came to be colloquially known as the White Australia Policy. Doors would remain open to Europeans and preferably those of Western stock.\n\nFortress Australia has also had a few modern manifestations. Refugees and asylum seekers who dare make their perilous journey to Australia via sea are rapidly whisked away into a privatised, Pacific concentration camp system. They are solemnly promised never to be settled on the Australian mainland.\n\nNow, against another sort of traveller, far less tangible and distinctly invisible, Fortress Australia is again finding its shaky form. But the novel coronavirus cares little for such shuttering approaches. It specialises in spread and mutation, skirting around barriers, leaping over obstacles and coasting along aerosol transmission. The virus’s devastating product – the disease of COVID-19 – is indifferent to the fortress.\n\nSince Australia’s borders closed in 2020 the fortress formula has become an article of faith. International travel was halted. Caps were placed on returning Australians and permanent residents. Arrivals were placed in quarantine for fortnightly periods in ill-fitted hotels.\n\nFor a time, the Hermit Nation strategy worked, if creakily. Quarantine breaches did take place with telling consequences – Melbourne suffered in June 2020 and endured a lockdown lasting 112 impoverishing days. But for the most part, breaches could be contained. Contact tracing and surveillance was sharpened. A sense of hubris developed: the virus could be outwitted. The country could bask in the isolation of “COVID Zero”.\n\nWhile Australia was fashioning its suppression and elimination strategy, its politicians became bullish and complacent. The vaccine strategy, the crucial counterpart to containment, was neglected and left to wither. In August 2020, Morrison boasted that “Australians will be one of the first in the world to receive a COVID-19 vaccine, if it proves successful, through an agreement between the Australian Government and UK-based drug company AstraZeneca.” That agreement, at least initially, was merely a letter of intent.\n\nThe government then thought it sensible to focus on acquiring the AstraZeneca vaccine over all others. Alternatives were treated as distant contenders. Fictional numbers and targets were generated.\n\nCountries which spectacularly failed in containing COVID-19 – the United States and UK foremost among them – showed greater prudence on the vaccine front. Contracts with pharmaceutical giants were drawn up to develop and manufacture a range of vaccines. Supply chains were guaranteed and mass rollout strategies scripted. From the rooftops of morgues, President Donald Trump and UK Prime Minister Boris Johnson could celebrate and distract. The needle and the jab could take over from death and catastrophe, working alongside a range of other containment measures.\n\nIn the meantime, Australia was left behind. Health Minister Greg Hunt called the quest to vaccinate the Australian populace “a marathon not a sprint.” Morrison similarly informed the press that this was neither a race nor a competition. The vaccination rollout, correctly seen as a “strollout”, only began on February 22; the UK, US and European states had begun around Christmas, if not earlier.\n\nThere was also inadequate supply to meet demand. Hunt’s March 22 announcement that people should make a friendly call to their GP to organise a vaccination was farcical and wishful thinking. GPs had little idea when or how many doses they would receive. It did not occur to the federal government that mass vaccination centres should also be set up as a priority.\n\nThe pace of this “boutique” program was also affected by the bad press surrounding AstraZeneca’s vaccine. While it does cause rare blood clotting, the risk of death remains one in a million. But the communications strategy of the federal government was woeful and disunited.\n\nAs the health advice changed to prioritise older groups, the Morrison government realised it needed to consider other vaccine options. The problem was not vaccine hesitancy but hesitancy to AZ. Other options, notably Pfizer, were needed.\n\nWhile the vaccine rollout crawled, COVID-19 did not. Cases of community transmission began to soil the COVID Zero record. A number of snap lockdowns were imposed in Western Australia and Queensland. Victoria, yet again, added its name to the list. Now, stubborn, resistant New South Wales has become another member of the lockdown family, with Sydney facing the Delta strain.\n\nThe Australian government’s response to this latest debacle? An advertising campaign crass in nature, ill-conceived and inaccurate. Designed to terrify people into vaccination, its amateurish clumsiness misfires in puns and insensitivity.\n\nMore practical approaches have come from outside government circles. Former Prime Ministers have shown Morrison up. The ever connected Kevin Rudd made his own intervention in lobbying Pfizer’s chairman Albert Bourla. This effort was bitchily dismissed by Hunt and watered down by the Morrison government. Rudd’s response was a snarl. He would “definitely not seek to associate himself with the Australian Government’s comprehensively botched vaccine procurement program.”\n\nThe Australian model, if it can be called that, has pricked international attention. John LaMattina, former president of Pfizer Global Research and Development, was all understatement about it in an interview on Australian television: “If I was an Australian, and I was seeing the rest of the world getting all these vaccine doses, and my country … was late to the party, I’d be a little disappointed to say the least. And it isn’t as if they were blindsided.”\n\nThe Financial Review was less reserved. Australia may well have developed “an enviable test and tracing system” that helped keep the COVID-19 death toll to less than a thousand. But it had “squandered its early victory over the virus, despite being one of the world’s wealthiest countries”. It now faced “a costly round of restrictions as it struggles to protect a largely unimmunised population from outbreaks of the highly contagious Delta variant.”\n\nThe country stood as “a warning to other nations, not least neighbouring New Zealand, that a fortress approach to the virus cannot succeed in the absence of an effective vaccine program.” The hermit approach is not only looking foolish but dangerous.\n\nNote to readers: Please click the share buttons above or below. Follow us on Instagram, @crg_globalresearch. Forward this article to your email lists. Crosspost on your blog site, internet forums. etc.\n\nDr. Binoy Kampmark was a Commonwealth Scholar at Selwyn College, Cambridge. He lectures at RMIT University, Melbourne. He is a frequent contributor to Global Research and Asia-Pacific Research. Email: [email protected]", "opengraph": {}, "tags": ["Politics", "Oceania"], "tweets": [], "movies": [], "links": ["https://www.instagram.com/crg_globalresearch/", "https://www.pm.gov.au/media/new-deal-secures-potential-covid-19-vaccine-every-australian", "https://www.skynews.com.au/details/_6241455495001", "https://www.crikey.com.au/2021/05/31/scott-morrison-covid-19-vaccine-race/", "https://www.datawrapper.de/_/2zRcR/", "https://www.health.gov.au/ministers/the-hon-greg-hunt-mp/media/phase-1b-covid-19-vaccination-rollout-begins", "https://theconversation.com/4-ways-australias-covid-vaccine-rollout-has-been-bungled-158225", "https://www.health.gov.au/news/arm-yourself-against-covid-19", "https://www.bbc.com/news/world-australia-57800981", "https://twitter.com/MrKRudd/status/1414459193692590081/photo/1", "https://twitter.com/MrKRudd/status/1414459193692590081/photo/1", "https://twitter.com/abc730/status/1414525024933797893", "https://www.ft.com/content/1466396e-2959-4a46-a449-2e1654b40c36", "/cdn-cgi/l/email-protection#17757c767a677a76657c57707a767e7b3974787a", "https://www.asia-pacificresearch.com/author/binoy-kampmark", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "13 July 2021"}