{"result_id": "037033", "URL": "https://www.asia-pacificresearch.com/boris-johnson-done-modi-favour/5629817", "timestamp": "2023-04-25 12:08:58 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.asia-pacificresearch.com/boris-johnson-done-modi-favour/5629817", "encoding": "UTF-8"}, "image": null, "domain": "www.asia-pacificresearch.com", "title": "Boris Johnson Has Done Modi a Favour | Asia-Pacific Research", "cleaned_text": "Prime Minister Narendra Modi’s invitation to British Prime Minister Boris Johnson conferring on the latter the great honour of being the chief guest at the Republic Day on January 26 was a hasty and premature move. True, the Oxford vaccine can turn India’s dismal future around, but the idea of inviting a British dignitary should have been reserved, thoughtfully, for the 2022 Republic Day, which is the 75th anniversary year of India’s independence from British rule.\n\nGreat anniversaries are invested with symbolism. Indians are becoming so crass that they are losing their sense of history. Be that as it may, on balance, Johnson seems to have performed, perhaps unwittingly, a ‘rescue act’ by regretting Modi’s invitation. The good thing is that we still have the opportunity to invite a British dignitary to the 2022 Republic Day and jointly celebrate Great Britain’s profound contribution to India’s transformation from medieval feudalism to the modern era.\n\nAny whichever way one were to look at Modi’s invitation to Johnson, to my mind, it had all the hallmark of External Affairs Minister S. Jaishankar. The zest with which Jaishankar performed at his joint press conference on Dec. 15 with the visiting British Foreign Secretary Dominic Raab gave the tale away. His infectious enthusiasm conveyed the impression that Jaishankar found a quick replacement for the outgoing US Secretary of State Mike Pompeo who has been his close friend, confidante and guide ever since he became minister in 2019.\n\nOf course, it would be a gross misjudgment to imagine that someone like Raab, an accomplished intellectual and erudite mind, could ever be a cowboy of the western world. But the ‘China bug’ is creating havoc with our thought processes. There is not a soul in sight among India’s elites today who has not been bitten by that bug.\n\nOur foreign policy may have consequently become somewhat spicy, but from a long term prospective, it is in jeopardy of losing its versatility, agility and pragmatism. Diplomacy based on a single maxim restricts foreign policy options — ‘Hello, Minister, if you have a problem with China, come and have a cuppa with me.’\n\nAt any rate, we are deluding ourselves if we think that Britain is on a collision course with China. Of course, things have changed since the halcyon days in 2016 when then British PM David Cameron visualised a “Golden Era” in UK-China relations. Britain since beat a retreat over Hong Kong. And it can’t be to Britain’s liking that the lone Anglo-Saxon outpost in the Asia-Pacific, Australia, is being punished by Beijing for crossing its ‘red lines’ and trespassing into its national sovereignty.\n\nBut Britain is not all Five Eyes, either. On its rich tapestry of history, a steamy soap opera like Hong Kong cannot leave enduring impact. Apart from the BBC, no one of consequence in London seems obsessed with Hong Kong anymore.\n\nAlthough back in April last year, it was a former head of Britain’s MI6, John Sawers, who first alleged that China concealed crucial information about the novel coronavirus outbreak and so should answer for its deceit, Britain has decided not to pursue the campaign further and has, kind of, slunk away from the podium, leaving Australian PM Scott Morrison as the night watchman. (Gareth Evans has written a delightful blog titled Australia’s China Problem on Morrison’s goof-up, which can be useful reading for the Indian establishment.)\n\nPost-Brexit Britain is planning to go ‘global’ after having parted company with the EU. It is a hazardous journey. Hard times lie ahead. The British economy has shrunk by 11 percent (lower than India’s) and the current lockdown exacerbates matters further. In all probability, a return to pre-pandemic times cannot happen before 2023.\n\nThe national debt is touching new heights and it seems inevitable that the Bank of England, Britain’s central bank, may rack up the pace of its asset-purchase plan to shore up the financial system. Brexit has been a historical blunder. The trade deal with the EU wears a deceptive look, since it may create downstream problems. Compulsory export declarations and lumbering red tape in trade procedures in the longer term are bound to lead to diminished British market access to the mainland. Johnson has run out of ideas.\n\nAgain, the EU-China investment agreement of Dec. 30 means that Britain will run into European headwinds as China’s financial, manufacturing and services markets are set to be further opened to Berlin, Paris, Rome, Madrid, Athens, Brussels, etc. For example, Germany will almost certainly take away a good slice of Britain’s auto exports to the Chinese market.\n\nThe answer lies in a UK-China Free Trade Agreement, while prospects of a UK-US FTA have receded further. Suffice to say, Britain has no choice but to revive a friendly relationship with China, whose investments will be badly needed for the resuscitation of its infrastructure; whose tourists and students bring in big money; whose own domestic infrastructure investment to solidify growth is of such staggering proportions that can be highly lucrative British business; whose people’s disposable income is steadily rising and consumption power is visibly growing for British products which are in demand among Chinese consumers.\n\nIn sum, the $15 trillion Chinese economy, which is more than five times Britain’s, is irreplaceable. And China’s economy is set to grow by more than 8 percent annually in 2021 and 2022, according to World Bank/IMF estimates. Conceivably, the lure of a “Golden Era” of UK-China relations will remain and Beijing is looking forward to it.\n\nTherefore, the big question is: What is it that Jaishankar can offer to Raab to draw Britain into the Quad? Hosting the newly-built British aircraft carrier on its maiden voyage across the Indian Ocean? Jaishankar should not have embarked on another misadventure like Howdy Modi.\n\nWithout doubt, when Britain goes global, India should be part of it. Britain still has so much to offer. Britain’s multicultural society holds valuable lessons for our ruling elite. The two economies have so much complementarity. Britain’s internationalism can help us figure out how to come out of the hole we’ve dug ourselves in. We don’t need to hinge India-UK relations on shared hostility toward China.\n\nNote to readers: please click the share buttons above or below. Forward this article to your email lists. Crosspost on your blog site, internet forums. etc.", "opengraph": {}, "tags": ["Politics", "History", "South Asia"], "tweets": [], "movies": [], "links": ["https://www.livemint.com/news/india/uk-pm-boris-johnson-cancels-india-visit-11609854219856.html", "https://asialink.unimelb.edu.au/insights/australias-china-problem", "https://yorkshirebylines.co.uk/johnson-pleads-with-business-leaders-give-me-a-reason-for-brexit/", "https://indianpunchline.com/boris-johnson-has-done-modi-a-favour/", "https://www.asia-pacificresearch.com/author/m-k-bhadrakumar", "https://indianpunchline.com/boris-johnson-has-done-modi-a-favour/", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "22 January 2021"}