{"result_id": "037005", "URL": "https://www.asia-pacificresearch.com/canberra-freedom-convoy-demands-sack-them-all/5630980", "timestamp": "2023-04-25 12:08:06 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.asia-pacificresearch.com/canberra-freedom-convoy-demands-sack-them-all/5630980", "encoding": "UTF-8"}, "image": null, "domain": "www.asia-pacificresearch.com", "title": "Canberra Freedom Convoy Demands, ‘Sack Them All!’ | Asia-Pacific Research", "cleaned_text": "All Global Research articles can be read in 51 languages by activating the “Translate Website” drop down menu on the top banner of our home page (Desktop version).\n\nVisit and follow us on Instagram at @globalresearch_crg.\n\nThe Canberra Freedom Convoy is an awful lot bigger than the mainstream press would like you to believe. Although they have been in Canberra for nearly two weeks, today’s rally grew to an extraordinary size with the lawn outside Parliament House filling to hold tens of thousands.\n\nTrucks – adorned with banners, messages, and flags – meandered slowly through the pedestrians. Their playful horns had to compete with cheers and wolf-whistles from a crowd in high spirits.\n\n‘No more mandates!’ read one sign. ‘End tyranny. Free Australia!’ said another. ‘Freedom convoy to Canberra. Since 2020 I’ve lost my business.’\n\nAnd there it is – the heart of the issue. People have joined the Canberra Freedom Convoy because they have lost more than they can tolerate. It is not a piece of clever political incitement, or some kind of alt-right witchcraft.\n\nOrganic movements like this rise for the same reason Australian politics is awash with minor parties – Labor and Liberal have lost touch. By cracking down on Covid, those in charge constructed cages of safety that not everybody wants to live in.\n\nThe frantic search for something better has spawned political diversity. If left to its own devices, these parties and rallies will condense into a coherent opposition and cause the ‘big two’ some serious problems at the federal election.\n\nOne Nation Senator Pauline Hanson was on the ground amongst protesters, while United Australia Leader Craig Kelly signed protesters into Parliament House four days ago so that they could deliver their demands to the Prime Minister. Nationals MP George Christensen livestreamed from Canberra last week, calling for an independent federal investigative body to address misconduct during Covid which led to people losing their jobs due to vaccine mandates. Liberal Democrats candidates have also been busy, voicing their admiration for the convoy on social media.\n\nPrime Minister Scott Morrison re-iterated that he supports mandatory vaccination only for workers in high-risk situations with vulnerable people, yet during National Cabinet he has done nothing whatsoever to stop state premiers and chief ministers mandating three shots for almost all workers – including the implementation of vaccine passports which effectively leaves the unvaccinated locked out of their own economy.\n\nDespite what the Prime Minister says, vaccines are mandatory unless you want to live on the street.\n\nWhy hasn’t Morrison been pressed on this question by reporters with access? Where is the journalistic integrity of ‘trusted’ news organisations who fail – repeatedly – to point out the obvious untruth in the Prime Minister’s words? Indeed, why haven’t they asked the state premiers to justify vaccine mandates when their workforces are full of double-dosed, Covid-infected staff? Australians do not require a medical degree or strings of letters after their names to sense that something has gone amiss.\n\nThis silence from the press is one of the reasons ordinary people made their way down the avenue leading toward the lawn where a stage had been set up to host the afternoon’s events. Independent press and livestreamers shot footage revealing protesters peacefully waving thousands of Australian flags in the perfect Summer weather in scenes that looked more like a music festival than a ‘terrorist event’.\n\n‘Sack them all!’ blared out in front of Parliament House, shouted at such volume that it must have been audible through the foundations.\n\nPoliticians should be worried. Even in Canberra, a city dominated by public servants supposedly loyal to those ensconced in the halls of power, there were plenty of vehicles honking and tooting in support of the rally. Could it be that the silent majority are a lot louder when they have a horn beneath their palm?\n\nWhat may have started out as a few brave ‘fringe dwellers’ has gathered speed, spurred on in no small part by the enormous truck protest taking place in Ottawa.\n\nThe crowd was littered with ‘solidarity’ banners, flown in sympathy with their Canadian counterparts. Another wave of cheers erupted for them. Canadian truck drivers have suffered through freezing conditions after police confiscated their fuel, their crowdfunding money, and then threatened to take away their children.\n\nLivestreamers and independent media reported poor service coverage in Canberra, with most enduring constant interruptions to their broadcast. With so many people in attendance, the towers could not handle the traffic. It didn’t matter. The beauty of social media means that technical difficulties and selective reporting from the legacy press can no longer stifle coverage. While they put up pictures and say ‘thousands’, the audience flocks to Twitter and Facebook to count tens of thousands.\n\nIf anything, the spread of Omicron appears to have loosened the shackles of fear. Even with most states over 93 per cent double-dosed, it does not mean that the figure was achieved ‘freely’. The Australian Technical Advisory Group on Immunisation’s decision to reclassify ‘fully vaccinated’ as three shots last week, after lobbying from state premiers, has exasperated the spirit of rebellion.\n\nPeople are fed up. Let’s be honest, Australians have never liked politicians very much and after two years of wall-to-wall Covid control, they want their lives back.\n\nNote to readers: Please click the share buttons above or below. Follow us on Instagram, @globalresearch_crg. Forward this article to your email lists. Crosspost on your blog site, internet forums. etc.\n\nFeatured image is from The Spectator Australia", "opengraph": {}, "tags": ["Justice", "Oceania"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"500\">\n<p lang=\"en\" dir=\"ltr\">Quiet Australians not so 'quiet' anymore…<a href=\"https://t.co/VdPvo6btvV\">pic.twitter.com/VdPvo6btvV</a></p>\n<p>— Alexandra Marshall (@ellymelly) <a href=\"https://twitter.com/ellymelly/status/1492431688785604609?ref_src=twsrc%5Etfw\">February 12, 2022</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"500\">\n<p lang=\"en\" dir=\"ltr\">No debate on what the message is here… 'SACK THEM ALL!'<a href=\"https://twitter.com/hashtag/CanberraConvoy?src=hash&amp;ref_src=twsrc%5Etfw\">#CanberraConvoy</a> <a href=\"https://twitter.com/hashtag/Freedom?src=hash&amp;ref_src=twsrc%5Etfw\">#Freedom</a> <a href=\"https://twitter.com/hashtag/covid19?src=hash&amp;ref_src=twsrc%5Etfw\">#covid19</a><a href=\"https://t.co/3iyqGh7tLd\">pic.twitter.com/3iyqGh7tLd</a></p>\n<p>— Alexandra Marshall (@ellymelly) <a href=\"https://twitter.com/ellymelly/status/1492339971893907456?ref_src=twsrc%5Etfw\">February 12, 2022</a></p></blockquote>\n"], "movies": [], "links": ["https://lp.constantcontactpages.com/su/IJiNQuW?EMAIL=&go.x=0&go.y=0&go=GO", "https://www.instagram.com/globalresearch_crg/", "https://t.co/VdPvo6btvV", "https://twitter.com/ellymelly/status/1492431688785604609?ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/CanberraConvoy?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/Freedom?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/covid19?src=hash&ref_src=twsrc%5Etfw", "https://t.co/3iyqGh7tLd", "https://twitter.com/ellymelly/status/1492339971893907456?ref_src=twsrc%5Etfw", "https://www.spectator.com.au/2022/02/canberra-freedom-convoy-demands-sack-them-all/", "https://www.asia-pacificresearch.com/author/flat-white", "https://www.spectator.com.au/2022/02/canberra-freedom-convoy-demands-sack-them-all/", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "21 February 2022"}