{"result_id": "037027", "URL": "https://www.asia-pacificresearch.com/mass-vaccination-beginning-around-world-new-zealand-wait-covid-jab/5629626", "timestamp": "2023-04-25 12:08:46 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.asia-pacificresearch.com/mass-vaccination-beginning-around-world-new-zealand-wait-covid-jab/5629626", "encoding": "UTF-8"}, "image": null, "domain": "www.asia-pacificresearch.com", "title": "Mass Vaccination Is Beginning Around the World, but New Zealand Will Wait for a COVID Jab | Asia-Pacific Research", "cleaned_text": "The first people in the UK will be getting a Covid-19 vaccine on Tuesday, while in New Zealand, the wait could be for several more months. Here’s the government’s plan to vaccinate Aotearoa.\n\nMass vaccination efforts against Covid-19 are underway around the world, but in New Zealand the government is asking for patience as the first jabs are still months away.\n\nThe first Britons will receive a vaccine tomorrow and the Queen is expected to receive her first dose in the coming weeks. Clinics in Moscow began deploying Russia’s Sputnik V vaccine over the weekend. In the US, mass vaccination is expected to start before Christmas.\n\nGlobally, the coronavirus is entering a dangerous phase. The northern hemisphere is headed into colder months spent indoors as well as the holiday period. Over the past week, the United States broke a series of new records, with over 226,000 new cases of Covid-19 added on Friday alone. Hospitalisations have topped 100,000. In Canada, field hospitals are being set up before the arrival of snow.\n\nCovid-19 minister Chris Hipkins has said New Zealand’s first vaccines won’t be administered until the first quarter of next year, March or earlier. One of the reasons for the delay is that the country’s sense of urgency, and its willingness to take risks, is somewhat lessened.\n\n“They are speeding things up in a way we wouldn’t necessarily do here because of the risks they face,” Hipkins told reporters. He added that countries facing “hundreds if not thousands” of deaths daily are willing to skip waiting for the end of clinical trials, something New Zealand won’t do.\n\nThe government only confirmed in late November that Covid-19 jabs will be free. There also won’t be any legal requirement that people get the vaccine, however Qantas has already said that it’ll require passengers to show proof of vaccination before letting them on international flights.\n\nUnlike the UK, which was the first western country to approve a vaccine, New Zealand won’t be using emergency provisions to fast-track approval of any of the coronavirus vaccines the country will eventually purchase. As global vaccination programmes gain speed, there will be more evidence for the efficacy and safety of some vaccines than others.\n\nMedsafe, the country’s medical regulator, has already started an approvals process for Covid-19 vaccines. One of the vaccines being looked at is the Pfizer/BioNTech vaccine that Britain is rushing to its citizens this week. Early results have shown that the vaccine, which uses a new form of technology, is highly effective.\n\nHipkins added that an emergency approval from the government for that vaccine, copying the work done in the UK, wouldn’t necessarily speed up delivery. “There is a global issue here where everybody wants the vaccine as fast as we can get it,” he said. New Zealand expects to eventually purchase five or six different types of vaccines. Some will come through direct purchases from pharmaceutical giants while others will be delivered as part of large international coalitions. While Hipkins mused last week that a humanitarian argument could be made to ensure the vaccines go first to countries that are hardest hit by Covid-19, he quickly added that New Zealand will be getting its doses as quickly as possible. There won’t be any unnecessary delay, he added. In the UK, the first wave of jabs have been reserved for the over-80s and care home residents. In the US, authorities have said health care workers and the frail will be at the head of the queue. In New Zealand, the order will be decided by the evidence from a longer approvals process. Border-facing workers and people in aged care homes could be first, but the science will determine the sequencing, said Hipkins. New Zealand’s vaccine programme will be unveiled later in December, but the government is planning to have a significant supply of vaccine in the country when Medsafe finally provides approval to proceed. As a result of that, purchasing agents are currently scouring the globe for the equipment the country will need to transport, store and administer the vaccines. New orders have already been placed for super-cold freezers needed for the Pfizer injection. Note to readers: please click the share buttons above or below. Forward this article to your email lists. Crosspost on your blog site, internet forums. etc.", "opengraph": {}, "tags": ["Oceania", "Science"], "tweets": [], "movies": [], "links": ["https://thespinoff.co.nz/politics/07-12-2020/mass-vaccination-is-beginning-around-the-world-but-nz-will-wait-for-a-covid-jab/", "https://www.asia-pacificresearch.com/author/justin-giovannetti", "https://thespinoff.co.nz/politics/07-12-2020/mass-vaccination-is-beginning-around-the-world-but-nz-will-wait-for-a-covid-jab/", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "16 December 2020"}