{"result_id": "037011", "URL": "https://www.asia-pacificresearch.com/thailand-pay-45m-over-vaccine-side-effects/5631005", "timestamp": "2023-04-25 12:08:16 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.asia-pacificresearch.com/thailand-pay-45m-over-vaccine-side-effects/5631005", "encoding": "UTF-8"}, "image": null, "domain": "www.asia-pacificresearch.com", "title": "Thailand to Pay $45M Over Vaccine Side-effects | Asia-Pacific Research", "cleaned_text": "All Global Research articles can be read in 51 languages by activating the “Translate Website” drop down menu on the top banner of our home page (Desktop version).\n\nVisit and follow us on Instagram at @globalresearch_crg and Twitter at @crglobalization.\n\nThis was first published on APR on March 15, 2022\n\nThailand’s National Health Security Office (NHSO) has so far paid 1.509 billion baht ($45.65 million) as compensation to 12,714 people who developed side-effects after they received Covid-19 vaccines.\n\nThe NHSO on March 9 reported that from May 19, 2021 to March 8 this year, a total of 15,933 people had filed complaints of negative reactions to Covid-19 vaccines.\n\nThe NHSO said 2,328 complaints were rejected after it ruled that the side-effects were not related to the vaccinations.\n\nOf the rejected cases, 875 complainants are appealing against the earlier decision of the NHSO.\n\nIt added that 891 cases were pending consideration.\n\nMeanwhile, the Ministry of Public Health reported on the morning of March 10 that in the past 24 hours there were 22,984 new patients who tested positive for Covid-19, 47 of whom have arrived in Thailand from abroad.\n\nThe death toll increased by 74, while 24,161 patients recovered and were allowed to leave hospitals.\n\nThe cumulative number of cases in the country stands at 3,111,857, of which 888,422 (28.55 per cent) were recorded this year alone.\n\nThe health ministry had reported on the morning of March 9 that another 55,820 people were given their first Covid shot in the last 24 hours, 18,227 their second shot and 88,932 a booster, bringing the total number of Covid-19 vaccine doses administered nationwide to 125,199,011.\n\nNote to readers: Please click the share buttons above or below. Follow us on Instagram, @globalresearch_crg and Twitter at @crglobalization. Forward this article to your email lists. Crosspost on your blog site, internet forums, etc.", "opengraph": {}, "tags": ["South-East Asia", "Justice"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/IJiNQuW?EMAIL=&go.x=0&go.y=0&go=GO", "https://www.instagram.com/globalresearch_crg/", "https://twitter.com/CrGlobalization", "https://www.phnompenhpost.com/international/thailand-pay-45m-over-vaccine-side-effects", "https://www.asia-pacificresearch.com/author/asia-news-network", "https://www.phnompenhpost.com/international/thailand-pay-45m-over-vaccine-side-effects", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "6 April 2022"}