{"result_id": "037019", "URL": "https://www.asia-pacificresearch.com/hints-hun-sen-starting-look-away-china/5629646", "timestamp": "2023-04-25 12:08:31 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.asia-pacificresearch.com/hints-hun-sen-starting-look-away-china/5629646", "encoding": "UTF-8"}, "image": null, "domain": "www.asia-pacificresearch.com", "title": "Hints Hun Sen Starting to Look Away from China | Asia-Pacific Research", "cleaned_text": "When Cambodian Prime Minister Hun Sen announced this week that his country will order its first batch of Covid-19 vaccines from the United Nations-backed COVAX facility, it was notable that Cambodia’s first inoculations were not coming from China.\n\n“Cambodia is not a dustbin.. and not a place for a vaccine trial,” Hun Sen said in blunt terms during a marathon speech on December 15, adding that he will only trust and accept vaccines approved by the World Health Organization (WHO).\n\nAccording to reports, Cambodia’s government has so far collected US$48 million in donations, mostly from wealthy tycoons allied to Hun Sen’s ruling Cambodian People’s Party (CPP), which will go towards the US$200 million needed to purchase inoculations.\n\nThe vaccine collection drive comes amid fears a community-transmission outbreak that started late last month may still be spreading.\n\nA first batch of China’s Sinovac vaccines has already been delivered to Indonesia, yet there has been no official comment on whether Beijing will donate doses to its so-called “ironclad friend” Cambodia. This is despite pledges from Chinese Premier Li Keqiang in August that mainland Southeast Asian states would be given priority once shots are ready.\n\nThat’s raising questions why Beijing hasn’t rushed to engage in “vaccine diplomacy” with one of its few close regional allies, especially amid an ongoing debate among Cambodian intellectuals about whether Phnom Penh needs to rethink its foreign policy, which has steered closer to China at the expense of the US in recent years.\n\n“Cambodia needs also to rethink its foreign policy approach…It needs to improve its tarnished international image, in particular, by addressing the widespread perception that it is a Chinese proxy,” Kimkong Heng, a Ph.D. candidate at the University of Queensland, wrote last month.\n\nIn many ways, Cambodia has been here before. Back in 1958, just a few years after it gained its independence, its monarch-cum-civilian ruler Norodom Sihanouk penned an article for Foreign Affairs, entitled “Cambodia Neutral: the Dictate of Necessity.”\n\nFirst, he argued, Cambodia’s geography, wedged between the much larger Thailand and Vietnam, then on either side of the US-Soviet Union rivalry, and in the vicinity of China, means that the country has no other choice “but to try to maintain an equal balance” between the more powerful states.\n\nSecond, in foreign relations Cambodia favors “neutrality, which in the United States is all too often confused with ‘neutralism,’ although it is fundamentally different,” he wrote. “We are neutral in the same way Switzerland and Sweden are neutral-not neutralist like Egypt or Indonesia.”\n\nFor Sihanouk, “neutralism” meant that no formal alliance with one of the superpowers but a strong attachment and support to its causes. Indonesia was resoundingly pro-US and anti-communist throughout the Cold War, although also the architect of the non-aligned movement.\n\nCambodia’s present-day relations with China also turn on the nuanced distinction between these two terms. According to Phnom Penh, it engages in strict “neutrality” between the US and China, favoring neither and open to both, as its constitution mandates.\n\nCritics of the ruling CPP as well as many in Washington, however, assert that Phnom Penh’s foreign relations are now heavily skewed towards a pro-China and anti-US cause, although not formally allied with Beijing. As in Sihanouk’s day, Phnom Penh now vehemently rejects America’s reading of the situation.\n\nIn early 2017, Phnom Penh unilaterally canceled joint military drills with the US and began training instead with China’s armed forces the following year. After the authorities recently knocked down two US-built facilities at the country’s largest naval base, they are now reportedly being rebuilt by a Chinese state-run firm.\n\nPhnom Penh denies constant allegations it will allow Chinese troops to be stationed on its soil, a claim made by senior US officials.\n\nCambodian navy sailors stand in formation on a Chinese naval patrol boat during a hand over ceremony at Cambodias Ream Naval Base. Photo: Twitter\n\nCambodia’s reliance on China increased after authorities forcibly dissolved the country’s only viable opposition party in 2017, sent most opponents into exile and then secured a de facto one-party system at the 2018 general election.\n\nThis earned strong rebukes from the US, which has imposed targeted sanctions on several Cambodian officials, and from the European Union, which partially cut Cambodia’s trade privileges in August.\n\nIn comparison, China’s aid and trade is said to come with “no strings attached”, a characterization critics contest when taking into account big land concessions and domestic economic policies that have been tailored to favor China’s interests.\n\nYet Beijing has publicly defended Phnom Penh from supposed Western attempts to interfere in Cambodia’s internal affairs. Wherever Cambodia-China relations lie on an axis of “neutrality” or “neutralism”, there is clearly a perception by many in Cambodia that it cannot do without its most loyal foreign ally.\n\nChheang Vannarith, president of the Asian Vision Institute, a self-described “independent” think-tank, told the Chinese state-run news service Xinhua in late November that “Cambodia and China share the same world view on promoting multilateralism as the basis for peace, security and prosperity.”\n\nAlso in late November, Seun Sam, a researcher at the Royal Academy of Cambodia, wrote in a local newspaper that Phnom Penh “should not forget that the US and EU are the biggest markets for Cambodia to sell their products, not China. But China has been a very honest friend who supports Cambodia under all situations.”\n\nThe CPP government is often more overt about its lean towards China. “Cambodia’s development could not be detached from China. Without Chinese aid, Cambodia would go nowhere,” Deputy Prime Minister Hor Namhong commented a few years ago.\n\nChina is now Cambodia’s largest trading partner, with bilateral trade worth US$8.53 billion in 2019, and its largest investor for some years, with investments reaching US$9 billion by 2019. By one estimate, China has also provided more than US$6 billion in aid between 2001 and 2021.\n\nThe trend is gathering pace. In the first quarter of 2020, 51.5% of all investment projects approved in Cambodia were from Chinese investors, the largest percentage share of Chinese investment in recent years. It fell to 27.4% in the second quarter of this year but that was still a higher share than in most quarters in 2019 and 2018, according to National Bank of Cambodia data.\n\nIn mid-October, the two sides signed a free-trade agreement – Cambodia’s first bilateral pact – which took less than a year to negotiate and comes into effect next month. Moreover, if Cambodia’s vital tourism is to begin recovery next year, it will likely be reliant on Chinese tourists, who will be able to travel more freely than Europeans and Americans in 2021.\n\nHowever, China’s preponderance in trade and investment doesn’t always work in Cambodia’s favor. Bilateral trade skews heavily towards China, which enjoys a large bilateral trade surplus most years.\n\nLocals accuse Chinese firms of only hiring Chinese workers and engaging in land grabs. They also carp Chinese outprice local in property deals. This is most keenly felt in Sihanoukville, a coastal city and hub for Chinese investment, where locals have complained since 2017 that the city is being turned into a Chinese “colony.”\n\nCambodia’s insistence in 2012 and 2016 that the Southeast Asian bloc tone down its communiques against Chinese aggression in the South China Sea, where it controversially claims ownership of territory already claimed by four regional states, has also made Phnom Penh the source of frustration amongst its neighbors.\n\nThere has even been recent talk that Cambodia and Laos, another close friend of China, should be kicked out of the regional bloc because their foreign policies are overly aligned with Beijing’s.\n\nRecent articles have noted that Cambodia’s foreign policy is being shaped by political elites whose views are not in line with the majority of the public, who are more fearful of China’s economic and strategic influence than America’s, according to the 2020 State of Southeast Asia survey produced by the ISEAS Yusof Ishak Institute.\n\nIndeed, Chinese largesse tends to flow chiefly to Cambodia’s elites, whereas Western aid is largely directed to grassroots organizations, which makes Beijing’s funds more attractive for those in power and, indeed, supports the CPP regime’s survival.\n\nHowever, sensible voices note that Cambodia can maintain close economic and diplomatic relations with China whilst also improving ties with other states, not least the US. In other words, Cambodia’s current foreign policy problems can be rectified.\n\nIt’s unclear why Hun Sen didn’t specifically mention China during his four-hour televised speech this week, with many now guessing whether it was an intentional omission or a ploy to extract greater concessions from Beijing.\n\nImage on the right: Cambodian Prime Minister Hun Sen and Chinese President Xi Jinping. Photo: Xinhua\n\nWhat’s clear, however, is that the escalating tensions of the US-China-Cambodia “triangle” have hardly worked in Phnom Penh’s favor this year, and there may be a growing realization that conditions could become a lot worse for the Cambodian government in 2021 without a recalibration.\n\nIndeed, a group of US lawmakers last month called on the outgoing Donald Trump administration, and presumably also on the incoming Joe Biden administration, to impose harsh targeted sanctions on dozens of senior Cambodian political, military and business officials.\n\nBiden’s administration, which may or may not go harder on Phnom Penh for its democratic backsliding, at least offers the Cambodian government a reset moment to realign its foreign policy back closer to neutrality than neutralism.\n\nNote to readers: please click the share buttons above or below. Forward this article to your email lists. Crosspost on your blog site, internet forums. etc.\n\nFeatured image: A new China-Cambodia trade pact will not provide Phnom Penh the economic lifeline it needs amid the Covid-19 pandemic. Image: Twitter/Bilaterals.org", "opengraph": {}, "tags": ["South-East Asia", "China", "Politics"], "tweets": [], "movies": [], "links": ["https://asiatimes.com/2020/12/hints-hun-sen-starting-to-look-away-from-china/?mc_cid=ac7bb3e2f9&mc_eid=61b4b7d446", "https://www.asia-pacificresearch.com/author/david-hutt", "https://asiatimes.com/2020/12/hints-hun-sen-starting-to-look-away-from-china/?mc_cid=ac7bb3e2f9&mc_eid=61b4b7d446", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "18 December 2020"}