{"result_id": "037042", "URL": "https://www.asia-pacificresearch.com/quad-say-it-like-modi/5630004", "timestamp": "2023-04-25 12:09:12 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.asia-pacificresearch.com/quad-say-it-like-modi/5630004", "encoding": "UTF-8"}, "image": null, "domain": "www.asia-pacificresearch.com", "title": "Quad: Say It Like Modi | Asia-Pacific Research", "cleaned_text": "All Global Research articles can be read in 27 languages by activating the “Translate Website” drop down menu on the top banner of our home page (Desktop version).\n\nIndia hasn’t had a prime minister to match Narendra Modi in his grasp of the power of speaking with purpose to connect with his listeners. When he speaks on foreign policy issues, however, Modi uses communication skills of a certain kind where he doesn’t have to build to a crescendo and he’d much rather leave a record for lasting impression.\n\nModi’s remarks at the landmark first-ever summit meeting of the Quad on Friday is a case in point. What comes to mind is a book that I picked up at Mumbai airport many years ago titled SAY IT LIKE OBAMA by Shel Leanne who used to be a full faculty member at Harvard. It focuses on the communicative power of Barack Obama — a “mixture of Martin Luther King and John F. Kennedy”.\n\nModi’s communication skills are of a different kind. He lacks Obama’s deep baritone and his communication techniques of backward loops and symbolism and his inspiring, compelling eloquence. But Modi created a strong non-conformist first impression at the Quad summit.\n\nModi’s remarks added up to just 105 words — in comparison with his voluble American counterpart Joe Biden’s 560 words, his ebullient Australian counterpart Scott Morrison’s 295 words and the taciturn Japanese PM Yoshihide Suga’s 215 words. Conceivably, External Affairs Minister S. Jaishankar advised the PM beforehand that discretion would be the better part of valour. This is the first thing.\n\nTruly, India gains nothing out of irritating China at this point in time. Probably, it’d have much to lose. Besides, it’s surreal to get excited about a US enterprise that the Asia-Pacific refuses to identify with. This is aside the wisdom of aligning with Biden’s ambivalent, contrarian attitudes toward China. Unsurprisingly, America’s close European allies refuse to identify with the US approach.\n\nAn incisive analysis by Reuters last week summed up:\n\nThe report quoted a EU diplomat as saying that the US has “a hawkish agenda against China, which is not our agenda”. This is the crux of the matter. One doesn’t have to be a rocket scientist to figure out why Biden slipped into his Quad wardrobe so early into his presidency.\n\nLast week, Biden’s aides were extending an invitation to high-level Chinese officials for strategic talks. Biden is in tearing hurry to engage with the Chinese leadership, although the US has far from coordinated with its allies a common strategy towards China, his passion for trans-atlanticism notwithstanding.\n\nThe heart of the matter is that Biden has successfully signed into law his $1.9 Trillion American Rescue Package. This would be in addition to previous $900 billion stimulus packages he announced in January. Biden said on Thursday, “The crisis of deep human suffering is in plain sight.” In a call to immediate action to turn things around, he added, “There’s no time to waste. We have to act and we have to act now.”\n\nBiden’s American Rescue Plan is broadly popular with voters but at its core, it is about living on borrowed money in ways that will do little to improve the nation’s long-term economic outlook. The overall federal debt is expected to climb to 102% of GDP this year! The point is, deficit-financed spending now on a short-term relief package could make it harder for the Biden administration to find money later for long-term investments in things like infrastructure.\n\nEnter China. The economies of the US and China are intricately linked, due to the two nations sharing a large trading partnership of goods and services and investment. The US deficit is financed partly by capital flows from China. China holds more US Treasury securities than any other foreign country except Japan. According to the US Treasury, China owned $1.06 trillion in US debt securities as of Sept. 2020.\n\nClearly, the huge influence of the Chinese economy on Biden’s calculus cannot be understated. China is the only show in town for his ambitious project encapsulated in that very widely used expression “Build Back Better” where he has openly telegraphed his role model to be FDR’s New Deal, which is riveted on the famous “Three Rs” — relief (for the unemployed), recovery (through federal spending and job creation), and reform (of capitalism by means of regulatory legislation and creation of new social welfare programs).\n\nBiden desperately needs the “2+2” talks in Anchorage on March 18-19 with top Chinese diplomats to reset the US-China relationship. But the paradox is that he is also not ready to let go the containment strategy against China that the Beltway demands, although it has no takers abroad among America’s friends and allies. Simply put, the US has a tactical need to keep the Quad going while it resets the ties with China.\n\nThis is where Modi’s remarks show smart thinking. He stated:\n\nModi stated the minimum that was necessary for the occasion. Evidently, Modi enjoys claiming affinity with Biden in “democratic values”. It has its uses too. Biden is a tough, wily, unsentimental partner. (The US just co-sponsored a scathing UNHRC resolution condemning authoritarianism and repression in Egypt under President Sisi — and is threatening to impose arms embargo against that close ally bordering Israel.)\n\nSecond, Modi repeated “our commitment to a free, open, and inclusive Indo-Pacific”. It is Biden’s prerogative as the self-appointed Quad chairman to drop the word “inclusive” from the joint statement, but for Modi it is important not to attribute any exclusivity to Quad as if it is directed against China.\n\nModi noted the “agenda” for the summit’s deliberations — vaccines, climate change, and emerging technologies — and expressed confidence that such a purposive development agenda would “make the Quad a force for global good.” In essence, he flagged India’s vision of the Quad. Does it look like “Asian NATO”?\n\nEqually, Modi struck a philosophical note: “I see this positive vision as an extension of India’s ancient philosophy of Vasudhaiva Kutumbakam, which regards the world as one family.” In Modi’s conception, the Quad family can accommodate Marxist-Leninists and capitalists alike.\n\nModi sounded pleased that the Quad has “come of age”, finally. The plan to finance a brand new ultra-modern vaccine factory in India testifies to maturity. Modi hoped that the Quad “will now remain an important pillar of stability in the region.” Interestingly, in his entire remarks, Modi never once mentioned regional security.\n\nIndeed, Modi’s expectation will be that the newly set-up Quad Working Groups on climate and critical and emerging technology will also make investments in “Make in India” projects. However, everything Biden does has a domestic resonance. The Quad isn’t a seductive enough topic for American domestic opinion. NSA Jake Sullivan’s media briefing turned out to be a damp squib!\n\nFor Biden too, this summit has been quintessentially a useful catch-up on vaccine-diplomacy, as New York Times pointed out, to push back against intense pressure to donate excess coronavirus vaccines to needy nations “without risking domestic political blowback from exporting doses in the coming months, as Americans clamour for their shots.” China, India and Russia have hopelessly outmatched the US in vaccine diplomacy. Biden is facing accusations of vaccine hoarding from global health advocates.\n\nIn the final analysis, of course, Beijing has since outwitted Biden by simply scaling up its vaccine production capacity manifold to a mammoth scale that his Quad vaccine project cannot possibly compete with.\n\nNote to readers: please click the share buttons above or below. Forward this article to your email lists. Crosspost on your blog site, internet forums. etc.", "opengraph": {}, "tags": ["Politics", "Defence", "South Asia"], "tweets": [], "movies": [], "links": ["https://www.mea.gov.in/Speeches-Statements.htm?dtl/33618/Prime_Ministers_opening_remarks_at_the_first_Quadrilateral_Leaders_Virtual_Summit", "https://www.reuters.com/article/uk-eu-usa-china-idUKKBN2B400S", "https://www.morningfuture.com/en/article/2021/01/11/build-back-better-joe-biden-jobs/1112/", "http://english.www.gov.cn/news/internationalexchanges/202103/11/content_WS6049d045c6d0719374afa968.html", "https://geneva.usmission.gov/2021/03/12/joint-statement-on-human-rights-in-egypt/", "https://www.whitehouse.gov/briefing-room/statements-releases/2021/03/12/fact-sheet-quad-summit/", "https://www.whitehouse.gov/briefing-room/press-briefings/2021/03/12/press-briefing-by-press-secretary-jen-psaki-march-12-2021/", "https://www.nytimes.com/2021/03/12/us/politics/biden-vaccine-diplomacy.html?action=click&module=Top%20Stories&pgtype=Homepage", "https://www.nytimes.com/2021/03/11/us/politics/coronavirus-astrazeneca-united-states.html?action=click&module=RelatedLinks&pgtype=Article", "https://www.globaltimes.cn/page/202103/1217366.shtml", "https://www.indianpunchline.com/quad-say-it-like-modi/", "https://www.asia-pacificresearch.com/author/m-k-bhadrakumar", "https://www.indianpunchline.com/quad-say-it-like-modi/", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "15 March 2021"}