{"result_id": "037014", "URL": "https://www.asia-pacificresearch.com/xi-apec-speech-reveals-extent-health-silk-road-regional-global-integration-plans/5630537", "timestamp": "2023-04-25 12:08:23 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.asia-pacificresearch.com/xi-apec-speech-reveals-extent-health-silk-road-regional-global-integration-plans/5630537", "encoding": "UTF-8"}, "image": null, "domain": "www.asia-pacificresearch.com", "title": "Xi’s APEC Speech Reveals Extent of Health Silk Road, Regional & Global Integration Plans | Asia-Pacific Research", "cleaned_text": "All Global Research articles can be read in 51 languages by activating the “Translate Website” drop down menu on the top banner of our home page (Desktop version).\n\nVisit and follow us on Instagram at @crg_globalresearch.\n\nChinese President Xi Jinping’s speech at the Asia-Pacific Economic Cooperation (APEC) meeting on Friday included a four-point proposal for APEC cooperation, based on the themes of strengthening international cooperation over COVID-19, deepening regional economic integration, pursuing inclusive and sustainable development, and seizing opportunities for scientific and technological innovation. We can examine each of these in this article.\n\nXi said China has so far provided more than 500 million doses of vaccine to other developing countries and “will provide another US$3 billion in international aid over the next three years to support the COVID-19 response and economic and social recovery in other developing countries”.\n\nChina is currently involved in developing some 35 COVID-19 vaccines and has made significant strides in the development of its BioPharm industry, raising considerable sums of money on the Hong Kong, Shenzhen, and Shanghai bourses to raise development capital. Some US$90 billion was raised among 28 companies listed on these exchanges last year, with China ramping up vaccine production to reach an estimated 3.2 billion doses in 2021 and 5.3 in 2022.\n\nAs of July 3, this year, China has provided nearly 500 million doses of vaccine overseas. (Source: Henry Tillman, China Investment Research from the Dezan Shira & Associates GBA webinar event from 34:30 viewable here). These vaccines are being distributed largely among Belt & Road Initiative countries, comprising some 35 percent of the global population, viewed as very important” for lower- and middle-income countries, many of them in Asia and in Africa.\n\nXi also stated that China will provide another US$3 billion in international aid over the next three years to support COVID-19 response and economic and social recovery in other developing countries. China supports waiving intellectual property rights on COVID-19 vaccines and will work with other parties to push for an early decision by the World Trade Organization (WTO) and other international institutions.\n\nChina will take an active part in cooperation initiatives to keep vaccine supply chains stable and safe and support the movement of essential goods, and take effective measures to ensure healthy, safe, and orderly people-to-people exchanges and restore normal business cooperation in our region at an early date. China has financed the founding of a Sub-Fund on APEC Cooperation on Combating COVID-19 and Economic Recovery, which will help APEC economies win an early victory over COVID-19 and achieve economic recovery.\n\nXi stated that “We need to deepen regional economic integration. Opening-up and integration is the prevailing trend. It is important that we promote the liberalization and facilitation of trade and investment and uphold the multilateral trading system with the WTO at its core. We must remove barriers, not erect walls. We must open, not close off. We must seek integration, not decoupling. This is the way to make economic globalization more open, inclusive, balanced, and beneficial for all.\n\nWe need to step up macroeconomic policy coordination, minimize negative spillovers, and fully implement the APEC Connectivity Blueprint to promote cooperation on digital connectivity. We need to advance regional economic integration, with a view to establishing a high-standard Free Trade Area of the Asia-Pacific at an early date. China is among the first to ratify the Regional Comprehensive Economic Partnership agreement. We look forward to its entry into force this year.”\n\nComment: This section reveals how China sees itself as part of East Asia – RCEP – and APEC, together with links to Central Asia, Africa, Europe and later, South America. The Belt & Road Initiative, Shanghai Cooperation Organisation, and other institutions complete this picture and will further integrate through a high yielding mechanized agricultural and focused innovative approach of China, ASEAN, Japan, South Korea, Australia, and New Zealand and the rising new vast Asia, including Central Asia, Africa, and South America. The rising Chinese domestic market will sit at the center of the new East Asian Free Trade Area. The other areas of Asia will link in gradually as they mature – the world’s leading industries will focus on East Asia for new markets, capital, and profitability. Eventually Asia will be the continent of the world, and its central economy.\n\nXi’s comments echo those made on a more regional basis by China’s Foreign Minister Wang Yi, who delivered a more regionally focused speech in Tashkent last week at the ‘Central and South Asia: Regional Connectivity, Challenges, and Opportunities’ inter-governmental conference hosted by Uzbekistan. That also contained a four-point plan and dealt more with the regional dynamics of connecting Central with South Asia. Our analysis of that, complete with planned Eurasian interconnectivity maps can be viewed here.\n\nXi stated that “We need to pursue inclusive and sustainable development. Planet Earth is the only home for humanity. We must follow a people-centered approach, foster a sound environment to buttress sustainable economic and social development worldwide, and achieve green growth. China attaches great importance to addressing climate change. We will strive to peak carbon dioxide emissions before 2030 and achieve carbon neutrality before 2060.\n\nChina supports APEC in advancing cooperation on sustainable development, improving the List of Environmental Goods, and making energy more efficient, clean, and diverse. We need to enhance economic and technological cooperation, promote inclusive trade and investment, support the development of small- and medium-sized enterprises, scale up support for women and other vulnerable groups, share experience on eliminating absolute poverty and strive to deliver the 2030 Agenda for Sustainable Development.”\n\nXi commented “We need to seize opportunities from scientific and technological innovation. The digital economy is an important area for the future growth of the world economy. The global digital economy is an open and close-knit entity. Win-win cooperation is the only right way forward, while a closed-door policy, exclusion, confrontation, and division would only lead to a dead end. We need to ensure full and balanced implementation of the APEC Internet and Digital Economy Roadmap, further develop digital infrastructure, facilitate the dissemination and application of new technologies, and work for a digital business environment that is open, fair, and non-discriminatory.\n\nChina has concluded several cooperation initiatives, including those on using digital technologies for the prevention and control of COVID-19 and on smart cities. We will host a workshop on digital capacity building and take forward such initiatives as bolstering the recovery of the tourism sector with digital tools, as part of our efforts to contribute more to Asia-Pacific cooperation on digital economy.\n\nChina has embarked on a new journey toward fully building a modern socialist country. As China enters a new development stage, we will follow a new development philosophy and foster a new development paradigm. We will build a new system of open economy of higher standards, create a more attractive business environment, and advance high-quality Belt and Road cooperation. We hope to work with countries in the Asia-Pacific and beyond to achieve higher-standard mutual benefit and win-win cooperation.”\n\nComment: Xi’s statements, and especially those made by Wang Yi as concerns Central Asia, herald the arrival of Asia as an Asian managed region. This has arrived as an on-going process of infrastructure building, urbanization and wealth creation and has ultimately resulted in the complete withdrawal of both NATO and US troops from Afghanistan. The Central and South Asian region, and increasingly the Middle East and Africa are undergoing a new influential course and geopolitical dynamics.\n\nAsia, centered on East Asia, will not a federal state. It will be a continent of nations, but with a Free Trade Area – a combination of ASEAN, RCEP, the Eurasian Economic Union, and agreements with the African Continental Free Trade Agreement, the Gulf Cooperation Council and South America’s Mercosur bloc. (Source, Dezan Shira & Associates GBA webinar, Regional Free Trade from 1:48.40 viewable here).\n\nWhat we see happening is the coordination by the regions national leaders to build continental and intercontinental infrastructure and mechanisms to develop living standards and care for society and the environment. Their central banks will coordinate as they have done since 2002 through the Chiang Mai Accords, while their economies will trade in currencies that are not capable of being sanctioned but are more available as digital and easily transferable and convertible.\n\nChina is ushering in a new emerging world and has been making long term plans to do so. Frictions have arisen because the United States and Europe have neglected at present significant long-term plans – as can be seen from the somewhat ‘knee-jerk’ response to initiatives such as the G7’s ‘Build Back Better World’ and the EU’s ‘Globally Connecting Europe’ plans which lack any tangible structural or address the financial planning requirements.\n\nChina in Asia and beyond has very clear objectives and is openly discussing these in international forums such as APEC. The United States and EU in comparison need to clearly see this and listen to these plans with an eye of global development instead of concentrating purely on their internal priorities. If this does not occur, and a re-engagement with Beijing materialize, it will be China, Asia, and its trading partners alone that will govern and influence global trade.\n\nNote to readers: Please click the share buttons above or below. Follow us on Instagram, @crg_globalresearch. Forward this article to your email lists. Crosspost on your blog site, internet forums. etc.", "opengraph": {}, "tags": ["Politics", "China", "Economy"], "tweets": [], "movies": [], "links": ["https://www.instagram.com/crg_globalresearch/", "https://www.dezshira.com/multimedia/view/china-greater-bay-area-exploring-key-sectors-direct-investment-m-and-a.html?1626257073", "https://www.silkroadbriefing.com/news/2021/07/19/china-urges-interconnection-between-central-and-south-asian-countries/", "https://www.dezshira.com/multimedia/view/china-greater-bay-area-exploring-key-sectors-direct-investment-m-and-a.html?1626257073", "https://www.china-briefing.com/news/xis-apec-speech-reveals-extent-of-health-silk-road-regional-global-integration-plans-analysis-opinion/", "https://www.asia-pacificresearch.com/author/chris-devonshire-ellis", "https://www.china-briefing.com/news/xis-apec-speech-reveals-extent-of-health-silk-road-regional-global-integration-plans-analysis-opinion/", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "20 July 2021"}