{"result_id": "037012", "URL": "https://www.asia-pacificresearch.com/philippines-returns-full-face-face-classes-after-two-years-distance-learning-covid-vaccination-not-mandatory/5631264", "timestamp": "2023-04-25 12:08:18 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.asia-pacificresearch.com/philippines-returns-full-face-face-classes-after-two-years-distance-learning-covid-vaccination-not-mandatory/5631264", "encoding": "UTF-8"}, "image": null, "domain": "www.asia-pacificresearch.com", "title": "Philippines Returns to Full Face-to-Face Classes After Two Years of Distance Learning, COVID Vaccination Not Mandatory | Asia-Pacific Research", "cleaned_text": "All Global Research articles can be read in 51 languages by activating the “Translate Website” drop down menu on the top banner of our home page (Desktop version).\n\nFollow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\nOn July 12, Philippine Vice President and Education Secretary Sara Duterte (daughter of former President Rodrigo Duterte who employed a militaristic approach to combatting COVID-19) mandated a full resumption of face-to-face classes in all public and private schools in November 2022. To say that the last two years of pure distance learning (self-learning modules) is problematic and likely ineffective is reasonable, for without literate guardians, school-age children struggle in the process of individual learning. Therefore, the decision to transition to full face-to-face classes soon is only necessary for the development of well-rounded Filipino children.\n\nSeveral critics lambasted the decision amidst the current surge in COVID-19 cases in the country. However, Dr. Mary Ann Bunyi, president of the Pediatric Infectious Diseases Society of the Philippines, said in 2021 that children who contracted COVID-19 accounted for “less than 10 percent of the country’s total cases.” She added that children have strong resistance to the coronavirus disease, where those infected only manifest mild symptoms. Against this scientific evidence, VP and EduSec Duterte maintained that pediatric vaccination is not mandatory and “co-mingling of vaccinated and unvaccinated learners will be allowed in the classrooms.”\n\nIn conjunction with the VP’s pronouncement, President Ferdinand Marcos Jr. declared that overall mandatory vaccination is not necessary and that a law is not required, acknowledging the public’s right to self-determination. Nonetheless, he still advocates for vaccination and the benefits one gets from getting vaccinated, essentially turning a blind eye to cases of adverse events and deaths. His administration also plans for a massive vaccination campaign to be spearheaded by the Department of Health, Department of the Interior and Local Government, and the Department of Education.\n\nThe “mandatory vaccination” buzzword is often denied by the national administration but is de facto implemented in systemic levels, giving workers in both government agencies and private sector[1] two options: get vaccinated or get terminated. If President Marcos Jr. is straightforward in his non-mandatory vaccination strategy, he must shape a more rigorous policy that penalizes employers pursuing mandatory vaccination. After all, didn’t he say, “We don’t really need to pass it into a law because we can still choose what’s best for our own health”?\n\nNote to readers: Please click the share buttons above or below. Follow us on Instagram and Twitter and subscribe to our Telegram Channel. Feel free to repost and share widely Global Research articles.\n\nJezile Torculas has a bachelor’s degree in Political Science. She is an Assistant Editor at the Centre for Research on Globalization (CRG).\n\n[1] Does not refer to the entire private sector", "opengraph": {}, "tags": ["South-East Asia", "Society", "Science"], "tweets": [], "movies": [], "links": ["https://lp.constantcontactpages.com/su/IJiNQuW?EMAIL=&go.x=0&go.y=0&go=GO", "https://www.instagram.com/globalresearch_crg/", "https://twitter.com/CrGlobalization", "https://t.me/gr_crg", "https://twitter.com/bnzmagsambol/status/1546694860941701121?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1546694860941701121%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fwww.rappler.com%2Fnation%2Fdeped-says-all-schools-should-shift-face-to-face-classes-november-2-2022%2F", "https://mb.com.ph/2021/08/16/kids-infected-with-covid-19-account-for-less-than-10-of-the-countrys-total-cases/", "https://tribune.net.ph/index.php/2022/07/18/bbm-mandatory-vaccination-not-needed/?utm_source=rss&utm_medium=rss&utm_campaign=bbm-mandatory-vaccination-not-needed", "https://tribune.net.ph/index.php/2022/07/18/bbm-mandatory-vaccination-not-needed/?utm_source=rss&utm_medium=rss&utm_campaign=bbm-mandatory-vaccination-not-needed", "https://www.asia-pacificresearch.com/author/jezile-torculas", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "18 July 2022"}