{"result_id": "037043", "URL": "https://www.asia-pacificresearch.com/fallacy-north-korean-collapse/5629968", "timestamp": "2023-04-25 12:09:13 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.asia-pacificresearch.com/fallacy-north-korean-collapse/5629968", "encoding": "UTF-8"}, "image": null, "domain": "www.asia-pacificresearch.com", "title": "The Fallacy of North Korean Collapse | Asia-Pacific Research", "cleaned_text": "All Global Research articles can be read in 27 languages by activating the “Translate Website” drop down menu on the top banner of our home page (Desktop version).\n\nIn an op-ed in the Washington Post on January 15, 2021, Dr. Victor Cha, a senior adviser at the Center for Strategic and International Studies, warned that the United States may confront a military crisis arising from North Korea’s regime instability or its collapse. He argued that the North Korean economy could not survive “for another year or longer” due to existing sanctions and border blockades for quarantine measures, and thus the North Korean government may be tempted to take military actions against external enemies, or it may lose control of its nuclear weapons.\n\nCha is one of the most influential North Korea analysts in Washington; unfortunately, in this case, his argument is closer to fiction than reality. The inaccuracies and distorted description of North Korea’s situation themselves create risks. Such a view not only makes it more difficult to solve the North Korean nuclear problem, but also might even lead to policy miscalculations, such as a military option. In this article, we rebut Cha’s claim in hopes of providing a more accurate basis for considering diplomatic and policy options.\n\nFirst, there is almost no possibility that the North Korean economy will collapse. Cha argues that the recent North Korean economy is in a situation “comparable to the Great Famine in the 1990s.” However, the reality is entirely different from his assertion. North Korea experienced a terrible crisis in the years after the end of the Cold War, during which about two million people starved to death despite foreign aid. There were no strong sanctions and a border blockade at that time, but there was mass starvation. On the contrary, recently, starvation is not pervasive in North Korea even with tough economic sanctions and border blockades as far as we know.\n\nWhy does this difference exist? The reason is that North Korea has already developed internal conditions for survival with which it can manage to muddle through strong sanctions. Since the early 2010s, the government in Pyongyang has pursued an economic policy of reform and openness to strengthen its survival capacity and resilience. In 2018, its national strategy shifted from a military-first approach to an economy-first one. New economic changes in North Korea encompass a wide range of areas such as facilitating import substitution and domestic production, adopting competitive systems, expanding markets, reforming financial institutions, establishing commercial banks, and promoting science and technology. However, the opening-up policy has been postponed because of strong economic sanctions caused by North Korea’s nuclear program.\n\nIn particular, the adoption of both the “socialist corporate responsible management system” and “field responsibility system” has increased production and facilitated distribution in light industry and agriculture. The former grants firms substantive management rights to run business autonomously, and the latter permits individual farmers to be rewarded for their crop yields. As a result of an import substitution policy, the proportion of domestically manufactured products has rapidly increased in markets.\n\nAlso, exchange rates and market prices for items such as rice and gasoline have become relatively stable. North Korea has secured internal economic conditions that enable people to have at least three modest meals a day. Comparing the current North Korean economy to the Arduous March in the mid-to-late-1990s is a deeply flawed approach that considers only the magnitude of challenges facing North Korea, ignoring its enhanced ability to cope with them.\n\nOf course, the decline in trade and investment due to sanctions and border blockades poses a major obstacle to North Korea’s economic development. However, North Korea has already secured an internal economic foundation, thanks to which citizens do not starve to death amid intensified sanctions. At the Eighth Congress of the Korean Workers’ Party last month, General Secretary Kim Jong Un admitted that the five-year economic development strategy had fallen short of meeting its goals in almost every category, but this should not be construed as a complete failure of North Korean economy. Besides, the economic recession caused by COVID-19 is a global phenomenon, not just for North Korea.\n\nUnder the sanctions regime, it will be difficult for North Korea to achieve economic prosperity through its self-reliance strategy, but it will have no problem in maintaining the status quo or achieving a low level of gradual economic development.[1]\n\nSecond, Cha argues that North Korea will not be able to obtain a vaccine for COVID-19 in the near future; thus, it will have no choice but to continuously block its borders and, as a result, the economy will not be able to survive for a year or longer. However, his claim is groundless speculation. We find it hard to agree with the argument that China will not provide its close ally with vaccines, especially since it has already supplied them to Southeast Asian and African countries. According to our research, the North Korean government has already secured hundreds of thousands of vaccine doses from China. Given that the North Korean government desperately wants the revitalization of foreign trade that is not subject to sanctions, it is highly likely to vaccinate trade workers first.\n\nDepending on whether the COVID-19 situation improves, trade between North Korea and China is expected to resume as early as this spring or in the fall at the latest. Therefore, the North Korean economy is predicted to gradually turn to a recovery path after hitting a low point in 2020 and the first half of 2021, when it faced a triple whammy of sanctions, natural disasters and the coronavirus pandemic.\n\nAt the recent Party Congress, 7,000 people attended meetings without wearing masks for the main events.[2] This suggests that North Korea is in control of COVID-19, or there is at least no massive infection. Although a combination of COVID-19 and sanctions negatively impacts the North Korean economy, it is improbable to lead to economic collapse.\n\nThird, although Dr. Cha contends that via this Party Congress, North Korea hinted at pursuing anti-market policies to overcome economic difficulties, the government is unlikely to do so. If anything, Cha’s argument seems to be based on a lack of understanding of the changes in economic policies in the Kim Jong Un era.\n\nIn the past, North Korean markets existed outside the national economy and were spontaneously expanded by people seeking their own survival. But in the Kim Jong Un era, markets have become part of the structure of the national economy. In other words, the markets belong to the economic arena managed by the government. In fact, Kim’s economic policy enables factories, enterprises and citizens to utilize markets for facilitating the supply and distribution of products.\n\nAs economic reforms have expanded and been institutionalized since Kim’s ascension to power, the government has not pursued a policy of suppressing market activity. Therefore, it is highly unlikely that the government would transform its economic policy in the direction of cracking down on or trying to eliminate markets, unless serious abnormal symptoms spring up. The failed currency reform in 2009 makes the government in Pyongyang likely to refrain from undertaking an anti-market policy.\n\nDenuclearization Is Still an Option\n\nFourth, Cha contends that at this Party Congress, Kim Jong Un made it clear that he does not intend to negotiate on denuclearization with the Biden administration. However, such an argument is based on a priori assumptions, not observation or analysis of what actually transpired at the Congress. At the eight-day-long Congress, Kim neither mentioned denuclearization nor stated that he has no intention to denuclearize.\n\nBefore this Congress, the DPRK government has repeatedly announced that it will persist in developing strategic weapons until the United States withdraws its hostile policy towards North Korea. The DPRK’s position on denuclearization has always been conditional. Therefore, the plan for developing strategic weapons announced at this Congress cannot be interpreted as a final statement that North Korea does not have a willingness to denuclearize.\n\nRecent moves by North Korea show that although it will not approach the United States with flexibility first, it has a willingness to negotiate on denuclearization with the Biden administration. During this transition period of American leadership, North Korea has not made any provocations against the United States in rhetoric or action from the election to the present. This is contrary to the past when North Korea made provocations to test the United States whenever a new US administration was about to start its term, including the time before and after President Obama’s inauguration. Additionally, the military parade commemorating the Party Congress, held shortly before President Biden’s inauguration, did not display any ICBM (intercontinental ballistic missile) that always appeared to provoke the United States in previous military parades.\n\nWhat do these signs point to? It is fair to interpret that if the United States does not provoke North Korea first, it will likewise not provoke the United States and that the government in Pyongyang is leaving room open for nuclear negotiations with the Biden administration. At the recent Party Congress, Kim Jong Un reaffirmed that the future relationship between North Korea and the United States would depend on changes in the United States’ position. Contrary to Cha’s argument that North Korea does not intend to denuclearize, the North is sending a message that it will wait for the United States to take a new approach.\n\nIn conclusion, it can be said that Cha’s article presents inaccurate descriptions and distorted views of North Korea’s reality. The DPRK is highly unlikely to enter a systemic crisis or face regime collapse. Thus, there is almost no possibility that the government in Pyongyang would preemptively strike external enemies for internal control or lose control of its nuclear weapons. We need to face the fact that the North Korean regime survived an extreme crisis in the mid-to-late-1990s, during which about two million people died of starvation.\n\nThe idea of North Korean collapse is a persistent fallacy, almost a mythology in US foreign policy thinking. Policies built on such a fallacy are doomed to fail. There should be no more mistakes: The lack of understanding and distorted perspectives on North Korea’s reality mislead policies on the country, thereby making it harder to solve the North Korean nuclear issue.\n\nNote to readers: please click the share buttons above or below. Forward this article to your email lists. Crosspost on your blog site, internet forums. etc.\n\n1. For a more detailed explanation of how the North Korean economy has been able to secure internal viability in response to tough sanctions, see Jong-seok Lee and Eun-ju Choi, Demystifying The North Korean Economy (Seoul: The Sejong Institute, 2019), http://www.sejong.org/boad/1/egoread.php?bd=56&itm=&txt=&pg=1&seq=5270.", "opengraph": {}, "tags": ["Politics", "Media", "East Asia", "Economy"], "tweets": [], "movies": [], "links": ["https://www.washingtonpost.com/opinions/2021/01/15/why-north-korea-could-become-one-bidens-biggest-challenges/", "https://www.nytimes.com/1999/08/20/world/korean-famine-toll-more-than-2-million.html", "https://en.yna.co.kr/view/AEN20170404013600315", "https://www.koreatimes.co.kr/www/nation/2018/09/103_254852.html", "https://www.38north.org/2021/01/key-results-of-the-eighth-party-congress-in-north-korea-part-1-of-2/", "https://asia.nikkei.com/Spotlight/Coronavirus/China-pushes-vaccine-diplomacy-in-Southeast-Asia", "https://www.dw.com/en/whats-behind-chinas-offer-to-share-its-vaccines-with-africa/av-55940113", "https://en.yna.co.kr/view/AEN20210112005900325", "http://www.sejong.org/boad/1/egoread.php?bd=56&itm=&txt=&pg=1&seq=5270", "https://www.38north.org/2021/02/the-fallacy-of-north-korean-collapse/", "https://www.asia-pacificresearch.com/author/sang-ki-kim", "https://www.asia-pacificresearch.com/author/eun-ju-choi", "https://www.38north.org/2021/02/the-fallacy-of-north-korean-collapse/", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "3 March 2021"}