{"result_id": "037037", "URL": "https://www.asia-pacificresearch.com/aussies-hoping-repeat-1979-truckie-blockade-when-government-backed-down-truckers-demands/5630629", "timestamp": "2023-04-25 12:09:05 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.asia-pacificresearch.com/aussies-hoping-repeat-1979-truckie-blockade-when-government-backed-down-truckers-demands/5630629", "encoding": "UTF-8"}, "image": null, "domain": "www.asia-pacificresearch.com", "title": "Aussies Hoping for a Repeat of 1979 Truckie Blockade when the Government Backed Down to Truckers’ Demands | Asia-Pacific Research", "cleaned_text": "All Global Research articles can be read in 51 languages by activating the “Translate Website” drop down menu on the top banner of our home page (Desktop version).\n\nVisit and follow us on Instagram at @crg_globalresearch.\n\nThe stakes are much higher this time, but Aussies are hoping that a planned trucker blockade that is beginning Monday, August 30th, demanding “a guarantee from federal and state governments that there will be no mandated vaccine, and that no person, company or business can force anyone to get a vaccine to work, or go about their daily life in general,” will be as successful as the 1979 Truckie Blockade where truckers demanded an end to high road taxes.\n\nFirst published in The Sun-Herald on April 8, 1979:\n\nTruckies blockading Sydney and other major cities last night said they would “stay put” – despite State Government plans to drop road maintenance taxes from July 1.\n\nFrom Razorback Mountain outside Sydney, spokesman for the blockading truckies Ted Stevens said the blockades would continue until all drivers’ demands were met.\n\nThis could mean that Sydney will face serious food shortages this week. Industries could be brought to a standstill as tens of thousands of workers are stood down.\n\nSupermarkets warned that fresh fruit and vegetables are likely to be in scarce supply and that many stores might have to start closing down by the middle of the week.\n\nThe ‘revolutionary truckies” of Razorback Mountain are expecting crowds of sightseers to drift into their makeshift camp today.\n\nSome of the visitors, they hope, will take food and money, which the blockading truck-drivers need.\n\nBut most will go to gape at the massive rigs blocking the Hume Highway, and to gaze at the blue singlet and T-shirt brigade who have sparked the spontaneous and spectacular grievance protest which now threatens to strangle the nation.\n\nAnd what a sight it is.\n\nA jumble of Kenworths, Mercedes, Macks, Whites, Scanias, Louisville Fords and other Kings of the Road litter the highway. The trucks and the goods they contain are worth more than $75 million.\n\nHaving seized a vulnerable part of Australia’s busiest highway, the truckies are acting with near-puritanical restraint.\n\nAlcohol is forbidden in the camp, by common agreement, so their cause will not he tarnished by misbehaviour.\n\nYou see tough men, bursting with muscles and broad bellies, licking ice creams and drinking cans of soft drink to combat the sweltering heat.\n\nVolunteers wander around picking up scraps of rubbish so that the site — with its maze of bullbars, towering prime movers and disembodied trailers — is unusually clean.\n\nThe police, hovering on the outskirts, are treated with respect. It is they who will be forced to act if the Government decides on harsh measures. And it is their blood, if any, which will he spilled if such orders are given.\n\nAlthough the occupancy is gentle, the mood is tough and implacable. “If they tried to move the trucks, they wouldn’t be able to get near us,” one driver told me. “There’d be a hundred blokes down on top of them.”\n\nIn the end, the government backed down and met all the truckers’ demands. They became a legend in Australia for standing up against the government, and songs were even composed about them.\n\nMany truck drivers have gone on social media to talk about the blockade to take back Australia from medical tyranny over COVID and mandatory COVID vaccines that are about to be launched as this article is being published.\n\nA video report I put together last week has already been viewed by over a quarter of a million people on the Health Impact News network.\n\nEarlier today popular truckie Tony Fulton, co-creator of trucking app Truckwiz and the Facebook page Tones Truckin’ Stories, also made a statement, announcing that he was joining the protest.\n\nAnd apparently it is not only truckers who will be joining the protest. Police officers, doctors, politicians and “high ranking barristers” are reportedly going to join as well.\n\nNote to readers: Please click the share buttons above or below. Follow us on Instagram, @crg_globalresearch. Forward this article to your email lists. Crosspost on your blog site, internet forums. etc.", "opengraph": {}, "tags": ["Justice", "Oceania", "History"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "690", "height": "400", "embed_code": "<iframe loading=\"lazy\" title=\"YouTube video player\" src=\"https://www.youtube.com/embed/N-8ifO70wTQ\" width=\"690\" height=\"400\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/N-8ifO70wTQ"}], "links": ["https://www.instagram.com/crg_globalresearch/", "https://www.smh.com.au/national/truckies-set-up-blockade-20091231-ll09.html", "https://rumble.com/vltrm0-australian-truckies-arent-joking-theyre-done-with-the-coercion.html", "https://healthimpactnews.com/2021/aussies-hoping-for-a-repeat-of-1979-truckie-blockade-when-the-government-backed-down-to-truckers-demands/", "https://www.asia-pacificresearch.com/author/brian-shilhavy", "https://healthimpactnews.com/2021/aussies-hoping-for-a-repeat-of-1979-truckie-blockade-when-the-government-backed-down-to-truckers-demands/", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "30 August 2021"}