{"result_id": "037041", "URL": "https://www.asia-pacificresearch.com/brazil-suspends-covaxin-contract-scandal-becomes-too-hot-bolsonaro/5630462", "timestamp": "2023-04-25 12:09:10 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.globalresearch.ca/favicon2.ico", "canonical": "https://www.asia-pacificresearch.com/brazil-suspends-covaxin-contract-scandal-becomes-too-hot-bolsonaro/5630462", "encoding": "UTF-8"}, "image": null, "domain": "www.asia-pacificresearch.com", "title": "Brazil Suspends Covaxin Contract as Scandal Becomes Too Hot for Bolsonaro | Asia-Pacific Research", "cleaned_text": "All Global Research articles can be read in 51 languages by activating the “Translate Website” drop down menu on the top banner of our home page (Desktop version).\n\nVisit and follow us on Instagram at @crg_globalresearch.\n\nIn a major blow to Bharat Biotech’s plan to market Covaxin abroad, the Brazilian government on Tuesday suspended its contract to import 20 million doses of the vaccine in a $300-million deal with the Indian company. With the growing scandal around the contract closing in on Jair Bolsonaro, the Brazilian government is now in a complete damage-control mode to save the president’s skin in a multi-million-dollar case which is keeping this country fixated to TV news.\n\nIn a development on Tuesday evening that was not completely unexpected, Brazil’s minister of health Marcelo Queiroga announced that the government has “decided to suspend the contract on the recommendation of the federal comptroller general (CGU)”, which is investigating the alleged irregularities in the contract. After examining the entire contract, which may take 10 to 15 days, CGU will decide whether to terminate the contract or not. But in the views of senators leading the parliamentary commission of inquiry (CPI), the contract is as good as dead.\n\n“I think they suspended the contract to buy some time and then cancel it. They will try to negotiate with the company and say that they have reached a limit because there is a great distrust among the Brazilian population and there is a very deep investigation by the CPI. There won’t be a contract in a few days, I’m sure of that. The plan is to get rid of this contract because the investigation into the Covaxin case is now reaching the president’s office,” said Senator Omar Aziz, president of the parliamentary commission, speaking on a channel on Tuesday night.\n\nThe contract between Brazil and Bharat Biotech, mediated and signed by a local company called Precisa Medicamentos, has been in the eye of a political storm for days as it became the main target of the parliamentary commission of inquiry (CPI) investigating the government’s handling of the pandemic. Last week, after a health ministry official, Ricardo Miranda, testified at the senate that he and his brother, federal deputy Luis Miranda, had informed the president about the serious irregularities in an invoice sent by Madison Biotech, an offshore company from Singapore, the CPI turned its focus towards Bolsonaro and Bharat Biotech, whose owner Dr Krishna Ella is also the founding director of the firm which operates from the ground floor of a two-story house in Singapore.\n\nIn a late-night report on Tuesday night, CNN Brasil revealed some parts of the CGU report which had forced the government to suspend the contract. In the 11-page official report, as per CNN Brasil, the focus of the investigation is the invoice from Madison Biotech. “Five points are listed to justify the suspension: Attempt to make advance payment, without contractual provision; possible payment through a company not a signatory to the contract; non-compliance with contractual deadlines; non-justification of price; and breach of contract by Bharat/Precisa as reported by ministry of health,” said the report, which largely seem to put the blame on Bharat Biotech, its offshore partner and its Brazilian representative.\n\nThe Indian company signed a pact with Precisa Medicamentos on January 12, 2021. Just 40 days later, on February 25, Precisa Medicamentos signed a contract with the Brazilian government for the sale of 20 million doses. At the time of signing of the contract, Covaxin had not been approved by Brazil’s National Health Surveillance Agency (ANVISA). Yet, its purchase price was agreed at $15 a dose, the highest paid by this country for any of the six vaccines contracted so far. Rejected by ANVISA on March 31 and then approved for limited import with strict conditions on June 4, the Indian vaccine has been mired in a controversy for months. Now, it is at the centre of a massive scandal that is rocking the Brazilian government and tearing apart Bharat Biotech’s reputation as pharmaceutical company.\n\nAmid damaging revelations, the national capital has been abuzz for days with rumours that the government was considering cancelling the contract. According to sources in Brasilia, the people close to the presidential palace want to wash their hands of the deal. “The question is not if the government wants to terminate the contract, the question is when they will cancel it. It is taking time because the contract is under so many ongoing investigations,” said a senior official, speaking on the condition of anonymity. “Nobody wants anything to do with this vaccine anymore. It is toxic.”\n\nFor the Bolsonaro administration, which has been completely cornered by the CPI over the purchase of Covaxin and hydroxychloroquine – both from India, the scandal is now too hot to handle. But the suspension – or eventual termination – may not bring any closure as the senators leading the parliamentary probe are not in a mood to give up on their trail of money in the deal. On Tuesday, soon after the government’s announcement to suspend the deal, Senator Randolfe Rodrigues, the vice president of CPI, called it a “confession of guilt”. “If nothing was wrong (in the contract), why would they suspend it? There is only one word for it: Confession!” the senator wrote on Twitter.\n\nThe senate probe has gone too deep into the scandal surrounding the Indian vaccine to give it up now. Already dubbed CovaxinGate, it has captured the country’s imagination and is dominating the news cycle. Ricardo Miranda, the health official who exposed the request for $45 million advance payment sent by Madison Biotech of Singapore, is now being treated as a whistleblower by CPI; and the invoice he and his brother took to Bolsonaro with their complaint is the smoking gun on which rests the probe into corruption in the India-Brazil deal.\n\nThe senate probe will continue to dig deeper into the vaccine deal between Brazil and Bharat Biotech. Photo: Pedro França/Agência Senado\n\nFour days have passed since the Miranda brothers testified at the senate, telling the country that the president was aware of corruption in the deal, told them the name of the person behind it and yet did nothing about it, but Bolsonaro has not denied the revelations in the bombshell testimony.\n\nThe government has, in fact, tied itself in knots, trying to tackle the extremely serious allegations against the president. When the invoice story was revealed last week, the government tried to accuse Ricardo Miranda of tampering with it, but it was soon proved that the document was in the ministry’s computer system and had not been forged. Then the government claimed that the president had forwarded the complaint to then minister of health, Eduardo Pazuello. The senators from CPI found this claim to be fragile because Pazuello was dismissed on March 23, just three days after the brothers meeting with Bolsonaro. On Tuesday, the government came out with the third version, claiming that Pazuello had forwarded the complaint to the executive secretary of the ministry, Élcio Franco, who would have done a “proper” check. It was immediately pointed out by senators that Franco was also dismissed just three days later and had no time to probe the matter.\n\nOn Ricardo Miranda’s testimony that he told the president about being under “extreme pressure” from his superiors to clear the invoice for advance payment from a company which is not part of the contract, Bolsonaro is standing on thin ice. As per Brazilian law, not reporting a wrongdoing by a public official is a crime of malfeasance – an impeachable offence. Three senators, including the CPI vice president, asked the Supreme Court on Saturday to open a criminal case against the president. On Monday, an apex court judge forwarded the application to the federal prosecutor-general’s (PGR) for action. On Tuesday, the PGR’s office requested the court to “wait till the senate probe is over”.\n\nThe senate investigation may be extended by a few weeks as has been demanded by CPI, during which the investigators plan to dig up more dirt on corruption, especially in the Covaxin deal, before they prepare their report which may shake up the country’s politics. At the heart of this probe is the invoice from Madison Biotech presented by Ricardo Miranda at his testimony. What could be giving sleepless nights to officials at the presidential palace is the announcement on Monday that Ricardo Miranda will be appearing again at the senate but this time in a closed-door session. There has been speculation, hinted strongly by Luis Miranda, that there is a recording of the brothers’ conversation with Bolsonaro where no other person was present.\n\nBolsonaro’s silence on the Miranda brothers’ testimony is a sign that he knows what is coming. In recent days, his allies have become shaky, rallies called by his supporters have been no-shows and anger against his government has grown. Nationwide protest rallies, scheduled for July 24, have been advanced to this Saturday (July 3), when hundreds of thousands, if not millions, may pack the streets across the country. To suspend a scandalous contract may be an attempt by the government to get out of the tight spot. But it may be too little and too late.\n\nSuspension of the Covaxin contract is unlikely to put an end to this scandal. On Thursday, Francisco Maximiano, the head of Bharat Biotech’s representative in Brazil, is expected to appear at the senate hearing. Now just CPI investigators but the whole country is waiting to watch it live. It may bring out more scandalous details.\n\nNote to readers: Please click the share buttons above or below. Follow us on Instagram, @crg_globalresearch. Forward this article to your email lists. Crosspost on your blog site, internet forums. etc.\n\nShobhan Saxena and Florencia Costa are independent journalists based in Sao Paulo, Brazil.", "opengraph": {}, "tags": ["Latin America & Caribbean", "Science"], "tweets": [], "movies": [], "links": ["https://www.instagram.com/crg_globalresearch/", "https://www.cnnbrasil.com.br/politica/2021/06/29/cgu-aponta-cinco-indicios-de-irregularidades-em-contrato-da-covaxin", "https://thewire.in/world/brazil-suspends-covaxin-contract-as-scandal-becomes-too-hot-for-bolsonaro", "https://www.asia-pacificresearch.com/author/shobhan-saxena", "https://www.asia-pacificresearch.com/author/florencia-costa", "https://thewire.in/world/brazil-suspends-covaxin-contract-as-scandal-becomes-too-hot-for-bolsonaro", "https://www.facebook.com/GlobalResearchCRG", "https://store.globalresearch.ca/member/"], "authors": [], "publish_date": "2 July 2021"}