{"result_id": "038014", "URL": "http://askingangels.com/linsblog/tag/zika-virus-fraud/", "timestamp": "2023-04-25 12:09:30 CEST+0200", "meta": {"description": "Tagged with zika virus fraud", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://askingangels.com/linsblog/tag/zika-virus-fraud/", "encoding": "UTF-8"}, "image": null, "domain": "askingangels.com", "title": "zika virus fraud", "cleaned_text": "CDC Clears the Way for Massive Zika Virus Payday and a Brand New Mandated Vaccine\n\n“Given the recognition of this causal relationship, we need to intensify our efforts toward the prevention of adverse outcomes caused by congenital Zika virus infection… … Moving from a hypothesis that Zika virus is linked to certain adverse outcomes to a statement (?)that Zika virus is a cause of certain adverse outcomes allows for …. the development of a Zika virus vaccine” New England Journal of Medicine\n\nSo this isn’t a fact? It isn’t proven? This is merely a “statement”? What conclusion can we draw from that?\n\nWhile Robert DeNiro goes from daytime talk-show to daytime talk-show saying he regrets pulling Vaxxed from the line-up of his Tribeca Film Festival, the CDC has cobbled together a new study that purports to use a new type of evaluation process to determine a causal relationship between the Zika Virus and microcephaly. The report was written by CDC authors and forms the basis of their new conclusion.\n\nOn the CDC webpage, the fraud is evident if you take the time to read it:\n\n“This study marks a turning point in the Zika outbreak. It is now clear that the virus causes microcephaly.” study “The report notes that no single piece of evidence provides conclusive proof that Zika virus infection is a cause of microcephaly and other fetal brain defects.” CDC announcement “This cautious approach toward ascribing Zika virus as a cause of birth defects is not surprising, given that… no flavivirus has ever been shown definitively to cause birth defects in humans,4 and no reports of adverse pregnancy or birth outcomes were noted during previous outbreaks of Zika virus disease in the Pacific Islands.5,6″ study\n\nSo there is no concrete proof of causality, no flavivirus has ever caused this type of birth defect and previous Zika outbreaks never resulted in increased cases of microcephaly in effected populations.\n\nSo their conclusion stands in direct conflict with all of that, yet they still published their findings and thus, the debate is over.\n\nThis conclusion of theirs clears the way for Obama’s 2 billion dollar combating Zika fund which includes at least 200 million dollars for the development of yet another soon to be mandated vaccine. A pricey vaccine which will not be given away for free mind you, even though taxpayers pay for the R&D. Here are the three major elements of Obama’s 1.8 billion dollar request to fight Zika from this past February.\n\nVaccine development: $200 million of the requested funds would be dedicated to Zika and chikungunya virus vaccine development. Both diseases are primarily spread by the Aedes aegypti mosquito. Foreign aid: Obama requested $335 million in aid to countries with ongoing Zika outbreaks, particularly in South and Central America and the Caribbean. Puerto Rico: $250 million would be allocated to Puerto Rico, which declared a state of emergency last week. There are currently 22 people in the U.S. territory with Zika virus, including one pregnant woman. (By comparison, there are currently only 51 people with Zika in the continental United States, including one sexually transmitted Zika case in Texas.)\n\nAt the moment, there are 42 nations or territories which are “threatened” by Zika. Imagine the windfall profit margins Big Pharma would reap on that one vaccine. That one vaccine you and I pay for thanks to the CDC’s new study, mind you.\n\nThe press, understanding their role in all of this, is already busy parroting the old Global Warming line about “the debate is over. The consensus is in. There is a connection so shut up you naysayers”\n\nI am reminded of a quote from Michael Crichton.\n\nAgain, the vapid conclusions of the MSM aside, if you simply take the time to read the study you will find they repeatedly state there are to be various “positive” outcomes of their finding a connection between the Zika virus and supposed increase in microcephaly cases in Brazil (read Jon’s work on the subject from back then. He shows their numbers were VASTLY inflated). These “positive” outcomes, they seem to be saying, justify the bad science surrounding their study. In conclusion, they make it very clear this is more an inference based on existing work than it is a new scientific finding:\n\nThe absence of an alternative explanation is not proof of a causal relationship nor should it suggest one. That is absurd. Decades ago, autism was blamed on “emotionless mothers” and in the absence of an alternative explanation, that ridiculous and misogynistic diagnosis remained intact. Clearly that was not in any way proof of a causal relationship nor should it have supported that conclusion yet it did, in those dark age days.\n\nMuch More of this article here: http://beforeitsnews.com/opinion-liberal/2016/04/cdc-clears-the-way-for-massive-zika-virus-payday-and-a-brand-new-mandated-vaccine-2526458.html", "opengraph": {"url": "http://askingangels.com/linsblog/tag/zika-virus-fraud/", "type": "website", "locale": "en_US", "site_name": "Asking Angels Blog", "title": "zika virus fraud", "description": "Tagged with zika virus fraud"}, "tags": ["zika virus fraud", "zika hoax"], "tweets": [], "movies": [], "links": ["http://askingangels.com/linsblog/2016/04/zika-virus-hoax-no-scientific-proof/", "http://www.nejm.org/doi/full/10.1056/NEJMsr1604338?query=featured_home&", "http://willyloman.wordpress.com//feed/https://medium.com/@jbhandley/what-s-with-deniro-s-tribeca-co-founder-jane-rosenthal-513d89afe9df#.lplkvngal", "http://www.nejm.org/doi/full/10.1056/NEJMsr1604338?query=featured_home&", "http://www.cdc.gov/media/releases/2016/s0413-zika-microcephaly.html", "http://www.cdc.gov/media/releases/2016/s0413-zika-microcephaly.html", "http://www.nejm.org/doi/full/10.1056/NEJMsr1604338?query=featured_home&", "http://www.cdc.gov/media/releases/2016/s0413-zika-microcephaly.html", "http://www.nejm.org/doi/full/10.1056/NEJMsr1604338?query=featured_home&#ref4", "http://www.nejm.org/doi/full/10.1056/NEJMsr1604338?query=featured_home&#ref5", "http://www.nejm.org/doi/full/10.1056/NEJMsr1604338?query=featured_home&", "http://www.huffingtonpost.com/entry/obama-plan-to-fight-zika-virus_us_56b8b4d6e4b04f9b57da5025", "http://abcnews.go.com/Health/zika-virus-outbreak-updates-pregnant-woman-puerto-rico/story?id=36737501", "http://abcnews.go.com/Health/zika-virus-outbreak-updates-pregnant-woman-puerto-rico/story?id=36737501", "http://www.cdc.gov/media/releases/2016/t0205-zika.html", "http://www.huffingtonpost.com/entry/zika-virus-causes-microcephaly-birth-defects-confirmed_us_570eb23de4b0ffa5937e13f6", "http://www.nejm.org/doi/full/10.1056/NEJMsr1604338?query=featured_home", "http://beforeitsnews.com/r2/?url=http://www.huffingtonpost.com/entry/zika-virus-causes-microcephaly-birth-defects-confirmed_us_570eb23de4b0ffa5937e13f6", "http://willyloman.wordpress.com//feed/https://jonrappoport.wordpress.com/2016/02/07/zika-who-launched-the-fake-epidemic-story-in-brazil/", "http://www.nejm.org/doi/full/10.1056/NEJMsr1604338?query=featured_home&#ref9", "http://beforeitsnews.com/r2/?url=http://www.nejm.org/doi/full/10.1056/NEJMsr1604338?query=featured_home&#ref40", "http://willyloman.wordpress.com//feed/https://medium.com/@jbhandley/what-s-with-deniro-s-tribeca-co-founder-jane-rosenthal-513d89afe9df#.lplkvngal", "http://beforeitsnews.com/opinion-liberal/2016/04/cdc-clears-the-way-for-massive-zika-virus-payday-and-a-brand-new-mandated-vaccine-2526458.html", "mailto:?subject=Share:%20Zika%20Virus%20Hoax%3A%20No%20Scientific%20Proof&body=CDC%20Clears%20the%20Way%20for%20Massive%20Zika%20Virus%20Payday%20and%20a%20Brand%20New%20Mandated%20Vaccine%20by%20Scott%20Creighton%20%E2%80%9CGiven%20the%20recognition%20of%20this%20causal%20relationship%2C%20we%20need%20to%20intensify%20our%20efforts%20toward%20the%20prevention%20of%20adverse%20outcomes%20caused%20by%20congenital%20Zika%20virus%20infection%E2%80%A6%20%E2%80%A6%20Moving%20from%20a%20hypothesis%20that%20Zika%20virus%20is%20linked%20to%20certain%20adverse%20outcomes%20to%20a%20statement%20%28%3F%29that%20Zika%20virus%20is%20a%20cause%20of%20certain%20adverse%20outcomes%20allows%20for%20%E2%80%A6.%20the%20development%20of%20a%20Zika%20virus%20vaccine%E2%80%9D%20New%20England...%0D%0A%0D%0AShared%20from%20http://askingangels.com/linsblog/2016/04/zika-virus-hoax-no-scientific-proof/%0D%0A", "http://twitter.com/share", "http://www.tumblr.com/share"], "authors": [], "publish_date": null}