{"result_id": "038048", "URL": "http://askingangels.com/spirit/america/the-old-president.php", "timestamp": "2023-04-25 12:09:48 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://askingangels.com/spirit/america/the-old-president.php", "encoding": null}, "image": null, "domain": "askingangels.com", "title": "The (old) President Has Not Abandoned You!", "cleaned_text": "The (old) President Has Not Abandoned You!\n\n\n\nMany people are starting to panic because Biden has seemingly taken power and everything is beginning to turn bad. Yet I am here to tell you things are indeed not as they seem, not at all. Do not be upset because I believe Trump has not abandoned you and you, the People, will Win.\n\n \n\n\n\nThe election was a complete fraud and all the evidence is collected. The Military are on your side. We know a lot of information because of Cue (insert the letter that sounds like cue) has told us so. Do not worry if you have not been following cue or his messages. This is \"the time\" everyone has been waiting for.The television is gaslighting you. It is 100% lies. Biden has been blocked out of the Whitehouse and they appear to be using TV sets pretending he is in the Whitehouse. What you are watching on television is one giant lie at this point. It is not clear yet if you still have a President Trump or the emergency power as gone to the military, or elsewhere, but I am sure it is not to Biden.I will be keeping this page updated as I learn more news but the military is in the Capitol for 30 days and I think they plan to take the Capitol back fromif they haven't already. You see, many years ago the country known as America was turned into a Corporation, and D.C. was made into a new country outside of America. It is foreign land. Now it is fenced off as the assets of America are taken back. For an amazing understanding please go to this link:What we are now watching on TV is, I believe, total farce by the media. They are master gaslighters. As Trump himself said, \"fake news\" and never a truer word was spoken. You, the people, did indeed vote him in and I believe he will be back. Please stay tuned as I will add more to this page as I find out. Or, you will soon be receiving emergency messages about all of this. Be patient and do nothing for now. The Plan is playing out. Do not get involved in any violence at all, in any circumstances. Trump cannot stand violence and it simply isn't needed. The military has this. Thanks!\n\nThis article is copyright of AskingAngels.com. The first 200 words only may be shared as long as they are unaltered and proper credit is given to the website with this link www.askingangels.com included. The full article may not be copied or reproduced without express written permission from the copyright holder.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://themarshallreport.wordpress.com/2021/01/20/trump-ode-to-the-corporation/", "http://www.askingangels.com", "/spirit/portal-of-light-activation.php", "/healing/health/the-nuremberg-trials.php", "/articles/angels/incarnated-angels.php", "/articles/spiritual/twin-flame-love.php", "/articles/starseeds/negative-ets.php", "/articles/angels/ascendedmasters.php", "/psychic/numbers/what-are-angel-numbers.php", "/healing/healer-signs.php", "/articles/spiritual/soulmates-types.php", "/psychic/cutcords.php", "/articles/spiritual/ascension-symptoms.php", "/psychic/signs/feather-angel-sign.php", "/psychic/signs/butterfly-angel-sign.php", "/psychic/signs/rose-scent.php", "/psychic/signs/angel-wings-meaning.php", "/articles/angels/askformoney.php", "/psychic/energy-vampire.php", "/articles/interpreting-signs.php", "/psychic/areyoupsychic.php", "/psychic/four-clairs.php", "/articles/spiritual/spiritual-awakening.php", "/psychic/empath-signs.php", "/articles/spiritual/twin-flame-telepathy.php", "/healing/kundalini-awakening.php", "/psychic/spiritual-grounding.php", "/articles/starseeds/starseed.php", "/psychic/protection.php", "/articles/spiritual/lightworker-missions.php", "/articles/angels/names.php", "/articles/spiritual/twin-flame-meetings.php", "/articles/spiritual/twin-flame-separation.php", "/articles/spiritual/soulmates-signs.php", "/articles/spiritual/lightworker-traits.php", "/spirit/meditations/love-meditation.php", "/healing/earth/incarnated-elementals.php", "http://askingangels.com/articles.php"], "authors": [], "publish_date": null}