{"result_id": "038020", "URL": "http://askingangels.com/articles/bookofkarma.php", "timestamp": "2023-04-25 12:09:34 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://askingangels.com/articles/bookofkarma.php", "encoding": null}, "image": null, "domain": "askingangels.com", "title": "THE BOOK OF KARMA Spiritual Awakening - Official Page", "cleaned_text": "is an interesting book explaining the mechanics of Karma (Cause and Effect), Reincarnation, Dharma and many other related topics. I was over-lighted by powerful angels in the writing of this book. It offers insight into the many laws of nature that govern us, including The Law Of Attraction, Spiritual Evolution as well as some Buddhist concepts that all relate to our journey here on Earth.\n\nThe Adventure Of The Soul\n\nWe Never Loose Our Growth\n\nNow this book will be available on Barnes and Noble as soon as I can get it up! We are no longer using Amazon as Amazon does not use an Average Star Review. They make up any score they choose, and when you ask them to change your score since it does not reflect your reviews, they actually censor you and write their own score for you. Then on the same day, you get negative reviews when over the 5 years you never got one low score before. Not worth it, sorry. Please be patient as I try to organise things elsewhere, hopefully through Barnes and Noble. The links below have been disabled: \n\n \n\n\n\nOne of the most important teachings regarding the reason we are on Earth is the wonderful teaching called “Spiritual Evolution”. There is no grander idea than this teaching for within it liesin all planes and levels of life, from the largest events on a worldwide scale down to the smallest, most random ones. It could be one of the most important ideas/truths that you could ever read because it explains the game of Life from a large perspective, from that of your soul.Many new ideas may be presented to you in this chapter. If you are not ready to receive all of the ideas straight away do not push yourself. Accept only that which rings true to your inner self. I am now going to describe a Journey to you, a vast adventure that you are a part of, that you areof, and it is the Adventure of the Soul.What is the soul? Simply put, the soul is a higher part of us and, being so, is where we originate. The soul is a part that is never separate from us because it is what we are.When we are present on Earth we are here as humans and we walk around in bodies. Does this mean that our soul is not with us? Essentially no, for we always remain connected to and in communication with our soul. It is our soul that decides to come to Earth and it does so through us. You could say that each of us is part of a soul, stepped down into human form walking the Earth. We are seemingly human and physical whilst we are here because this is the medium through which the soul experiences life on Earth. However, the majority of the soul energy does not travel to Earth and remains in the place where souls exist, in a higher dimension of pure energy.Our souls (in other words) are on a grand adventure in physical form. What is the purpose of this adventure? It is to explore and experience, no more and no less.Imagine for a moment that you are this non-physical entity much larger than your present self and you have been given the opportunity to come to Earth. You jump at this opportunity, even though you are told the adventure will be difficult and you will be cut-off from your higher self. Imagine you are informed that you won’t even remember who or what you are. Then you are told that after your time is complete, you will once again become one with your soul, which is waiting for you in the higher dimension that you call home. This idea would probably excite you and, before you know it, here you are on Earth, living out the adventure. But is it all just for fun?As a soul, you are a great being of light and pure consciousness. Most importantly, you are a changing being. You are never static. You pulsate, you glow and you Grow. You evolve. You are made from a spiritual essence and you are constantly discovering new things about yourself and the universe around you. Your grandest adventure of all is your own Evolution.Coming to live on Earth is a great way to learn about yourself, to grow and evolve. Souls do not only evolve upon Earth for there are many dimensions and mansions that make up Existence. Whether you are here or elsewhere, you cannot help but continue to learn, grow and evolve. This is what souls do. Animals and plants also originate from a soul. Like you and I, they are a fragment of a much larger energy, always remaining connected to it through a thread of light.So we find ourself upon Earth in a state of forgetfulness regarding our purpose for being here. We find that we have many questions. If this describes you then there is a reason why you have come across this book, for in it many answers are offered. Perhaps just the answers you need at this time.The soul will never stop exploring and experiencing, and never stop in its grand adventure. If viewed from the greater perspective of Spiritual Evolution, of the evolution of your soul, life can be seen to have reason and purpose, and even your failures have a purpose. One of the main ideas centered around Spiritual Evolution is that of “Growth” and this is the growth of you and your soul. You are your soul.Spiritual Growth is the idea that our purpose on Earth is to Grow and that this is a spiritual phenomenon. We grow in all ways, maturing on mental, emotional and spiritual levels. The reason we are here is to mature and grow as spiritual beings.When we grow, undoubtedly we improve. We become better human beings through the learning of lessons. We improve through gaining in intelligence and expanding our understanding as we undergo deep change throughout life. We can look back at our past and note the ways in which we have improved due to the maturity that has unfolded within us.Our growth is not restricted to that of merely emotional and intellectual maturity for we expand also on a spiritual level. Spiritual growth contributes to refining us in beautiful ways as time goes on. It gives us the opportunity to become kinder, more tolerant, more understanding, and more loving. This growth is happening everywhere around us and inside of us. How does it happen?We grow, quite simply, due to contact with all that is around us in our world. As all living things live and contact the outside world, they grow.Life is not static or an unchanging state but rather a state of constant change, growth and betterment. We can see that growth is occurring all around us, from the tiniest organisms in nature up to mankind (and beyond). What is this growth but the gaining of knowledge brought about by? For any of us to grow, we simply experience life and learn from it. There is nothing special we need to do to allow ourselves to grow except exist as we are. It takes care of itself. As we gain experience through our living, we naturally change our ideas and perceptions, gaining a greater understanding of what is around us. All of this growing takes us some place, for the experiences of life formand when we are done with an experience we have learned some lesson from it.This overall growth gained from our everyday interactions and living forms a great part of our Evolution of the Self. This just means that weonce we have “got it”.Have you noticed that when we learn from an experience we are loath to ignore the lesson? Once we have gained a new understanding of any situation, we simply never unlearn it. It is remembered always in some part of us. Even if we were to eventually forgetwe learned it, we always retain a “gut feeling” or instinct about it. This is a testament to the strength and power of growth. You might say that it becomesfrom us. Growth adds to us spiritually. The purpose is our Spiritual Evolution.The growth from our experiences is never discarded but is carried with us wherever we may go, incorporated into our body of experiencing, our instincts and reactions. Once we have grown to learn a lesson or gain an understanding, we cannot disregard, ignore or forget it. We cannot be separated from our own growth or evolution, and this is a real blessing.\n\nThis article is copyright of AskingAngels.com. The first 200 words only may be shared as long as they are unaltered and proper credit is given to the website with this link www.askingangels.com included. The full article may not be copied or reproduced without express written permission from the copyright holder.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.amazon.com/dp/B00V7PQBF0", "http://", "https://", "http://www.askingangels.com", "/spirit/portal-of-light-activation.php", "/healing/health/the-nuremberg-trials.php", "/articles/angels/incarnated-angels.php", "/articles/spiritual/twin-flame-love.php", "/articles/starseeds/negative-ets.php", "/articles/angels/ascendedmasters.php", "/psychic/numbers/what-are-angel-numbers.php", "/healing/healer-signs.php", "/articles/spiritual/soulmates-types.php", "/psychic/cutcords.php", "/articles/spiritual/ascension-symptoms.php", "/psychic/signs/feather-angel-sign.php", "/psychic/signs/butterfly-angel-sign.php", "/psychic/signs/rose-scent.php", "/psychic/signs/angel-wings-meaning.php", "/articles/angels/askformoney.php", "/psychic/energy-vampire.php", "/articles/interpreting-signs.php", "/psychic/areyoupsychic.php", "/psychic/four-clairs.php", "/articles/spiritual/spiritual-awakening.php", "/psychic/empath-signs.php", "/articles/spiritual/twin-flame-telepathy.php", "/healing/kundalini-awakening.php", "/psychic/spiritual-grounding.php", "/articles/starseeds/starseed.php", "/psychic/protection.php", "/articles/spiritual/lightworker-missions.php", "/articles/angels/names.php", "/articles/spiritual/twin-flame-meetings.php", "/articles/spiritual/twin-flame-separation.php", "/articles/spiritual/soulmates-signs.php", "/articles/spiritual/lightworker-traits.php", "/spirit/meditations/love-meditation.php", "/healing/earth/incarnated-elementals.php", "http://askingangels.com/articles.php"], "authors": [], "publish_date": null}