{"result_id": "038054", "URL": "http://askingangels.com/spirit/serve-earth-gaia.php", "timestamp": "2023-04-25 12:09:51 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://askingangels.com/spirit/serve-earth-gaia.php", "encoding": null}, "image": null, "domain": "askingangels.com", "title": "HOW TO SERVE GAIA | 5 Ways To Help Mother Earth Ascend", "cleaned_text": "Many people are wondering how best they can serve Earth at this time of great change when all seems in turmoil and many in power are now being arrested\n\nEnergetically speaking, we do the same each time we work inwards on our own issues to heal what is inside of us.\n\n2. How Do We Self Heal?\n\nBut the real point to being on this world it to learn how to get along with\n\nand be kinder and more loving\n\nAs we are able to learn, we make it easier for others to also learn.\n\n4. Our Attitude Can Spread Like Magic\n\n\n\nPeople have the power and en mass, we rise up and state No More.\n\nthe power of what you dream for...\n\n5. Dreams Are More Powerful Than You Know!\n\nThere is so much going on and people wish they could help others and the planet in it's current progress. There certainly are ways to help and the best way is to. This is essentially a brilliant way to help cleanse the planet. By healing all within ourself and finding inner peace, we also help to heal the collective consciousness and all around us. See how this works below.I love that as we do our healing inner work, we are in fact helping the macrocosm to also heal. It's like how we each work on our own environment, clean up our own neighborhood, or help locally with issues in our own area. When we all do this planet-wide, the entire world gets a bit of a spruce up and people are well taken care of. Do you ever go to pick up rubbish in the park, volunteer locally, or give to charity. When we all do it it adds up quickly and adds to our whole environment.It may take a moment to realise but as we do this, we are slowly changing the mass consciousness of the planet. As each human grows, whether growing a bigger conscience, becoming more caring, etc, the mass consciousness of planet earth also grows and becomes kinder. This is amazing.We are all working on our own issues right now finding our best way through life on earth. One issue I recently learned was in regards to relationships, and I learned that I need more than love i.e. RESPECT. I know I'll never jump into a relationship where that vital respect is missing. I have no interest in that kind of setup. What is it that you have learned recently?We're essentially learning to be kinder in our jobs and more caring of other people. Of course there are still jerks out there who are getting the entire 'planet earth thing' wrong - be it through rudeness or ruthlessness, they seem to be missing the point.Perhaps we are learning to avoid those situations that just don't fit, like the job where you go in and are subtly abused or made to feel less than. Is it really worth going in there if you are treated that way?Each time we heal up one of these vital issues, we become stronger but also, we help to lessen the load on our planet and her people.We can talk about our lessens but also we live our new truth, proudly.We may state, \"I no longer work in a job where I am treated as less than,\" or, \"I no longer stay in a relationship where I'm not respected, even if the love is still there.\" Others do learn from this as an example. Then it begins to spread, and as more people get stronger, more are encouraged to live their truth also. We help each other and make the world a little kinder and wiser.Usually we're never aware of it, but this new attitude is contagious. What about women suddenly standing up in Hollywood and saying, \"no more sexual abuse!\". How fast did that message suddenly spread once it came out? Everyone was in complete agreement and the only ones not liking it were the ones who spread abuse in the first place. We seem to be healing our society from the inside with these powerful kinds of movements.In many other ways we're doing the same thing. Humanity's mass consciousness is changing in many ways and we ARE the change, each of us. Do you ever talk in groups about how you would love society to be shaped; or maybe you just think it to yourself? And this brings me to our last step;The purpose of healing is to put to bed issues from your past so that you are finally free of inner turmoil and upset. We have a set number of personal issues and once we solve these, facing the shadow within us, we are much more free to dream about how we want the world to be. We have much more inner peace and are free to create what we want, even if just in our dreams.Everyone has an opinion on this world and where it's going. Do you simply wish the world may stay the same, or do you see how things in all areas of life, education, work, play, etc, can be so much better? It doesn't take a genius to wonder how it would feel if everyone, for example, owned their own safe home. I had this dream since the age of 15, and why not? Why is land so expensive anyway? Is it because someone arbitrarily decided to make it so? Why doesn't everyone born on the earth automatically get a free parcel of land so they can feel safe? The land comes from God. Of course in the future buying land will seem ridiculous because we will do away with this system.Many of the rules we currently live under are illegal and written by those who wish to enslave humanity. We are taxed many times a day and you may not realise but income tax is illegal. People pay their tax to a privately owned corporation (the IRS) and even the government doesn't receive it. A lot of American taxes actually go to the Queen, of England. Does this make sense? It is all warped and corrupt.Our world is about to change in a big way because people are waking up to the hidden horrors going on here. We all dream, and mostly of a friendly world where we can work in a project or job that we love. We want to raise our families in safe environments. We want a nice home that reflects who we are.Keep dreaming, for things are hotting up and are going to change. We, the people, are going to start manifesting all that we wish for. I really believe the Earth is being healed including our environment. Please remember to heal yourself first, help your loved ones and keep dreaming. Keep the hope alive. This is how we can best serve our Earth, and remember also to be kind :)\n\nThis article is copyright of AskingAngels.com. The first 200 words only may be shared as long as they are unaltered and proper credit is given to the website with this link www.askingangels.com included. The full article may not be copied or reproduced without express written permission from the copyright holder.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.askingangels.com", "/spirit/portal-of-light-activation.php", "/healing/health/the-nuremberg-trials.php", "/articles/angels/incarnated-angels.php", "/articles/spiritual/twin-flame-love.php", "/articles/starseeds/negative-ets.php", "/articles/angels/ascendedmasters.php", "/psychic/numbers/what-are-angel-numbers.php", "/healing/healer-signs.php", "/articles/spiritual/soulmates-types.php", "/psychic/cutcords.php", "/articles/spiritual/ascension-symptoms.php", "/psychic/signs/feather-angel-sign.php", "/psychic/signs/butterfly-angel-sign.php", "/psychic/signs/rose-scent.php", "/psychic/signs/angel-wings-meaning.php", "/articles/angels/askformoney.php", "/psychic/energy-vampire.php", "/articles/interpreting-signs.php", "/psychic/areyoupsychic.php", "/psychic/four-clairs.php", "/articles/spiritual/spiritual-awakening.php", "/psychic/empath-signs.php", "/articles/spiritual/twin-flame-telepathy.php", "/healing/kundalini-awakening.php", "/psychic/spiritual-grounding.php", "/articles/starseeds/starseed.php", "/psychic/protection.php", "/articles/spiritual/lightworker-missions.php", "/articles/angels/names.php", "/articles/spiritual/twin-flame-meetings.php", "/articles/spiritual/twin-flame-separation.php", "/articles/spiritual/soulmates-signs.php", "/articles/spiritual/lightworker-traits.php", "/spirit/meditations/love-meditation.php", "/healing/earth/incarnated-elementals.php", "http://askingangels.com/articles.php"], "authors": [], "publish_date": null}