{"result_id": "038013", "URL": "http://askingangels.com/articles/starseeds/cat-people.php", "timestamp": "2023-04-25 12:09:29 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://askingangels.com/articles/starseeds/cat-people.php", "encoding": null}, "image": null, "domain": "askingangels.com", "title": "Cats, Cat People & Mother Sekmet - A 9D Feline Master", "cleaned_text": "If you have a happy cat living in your home, have you ever thought about it as being an emissary from a distant star system? It might seem like a strange or dramatic thought, but then again, look deeply into kitty's eyes because that can tell a story.\n\n \n\n\n\nCats are classically very different from other lifeforms on this world and if you love cats, you may know they are only \"half in\" anyway and are extremely psychic. Your little, loved house kitty, or your neighbourhood cat is borrowed from another place in space. They are visitors to this world here to help us humans, and they do a wonderful job at it. Who runs your house anyway, and who can change the mind of a cat when it knows its true place in your world? They offer us love and are brilliant energy healers when they snuggle on our laps. They know what they are doing. There are many cats out there in the universe and they are a very advanced race of beings. The one whose DNA is mixed with humans (or the \"cat people\") are ones I want to discuss as well. (see below)\n\nNot only do cats come in miniature form to help us humans, but they also come to earth as starseeds. This means that a feline soul that is comparable to a human can be born into a human body and forget it is a cat. It is in fact a starseed. The sign Leo The Lion is a reminder of the Feline race for Leo's love comfort as do felines but can also be adventurous, fun-loving, curious and intelligent. The cat starseeds may also be Scorpio because they are intense, competitive, perhaps a bit like a tiger and dangerous as well. It may be wise to tread carefully around Scorpio and not make an enemy of them and the same is true of cats. They really only mean well.\n\nThere are people out there who apparently hate cats. I read this in a Feline message recently so they are aware of it. In my family no one cared for cats and I was always told what awful creatures they were. Once I left home I made friends with neighbourhood cats, fascinated by them. I could talk to them psychically and they clearly understood me very well. Cats are loving creatures except when it comes to other little animals outside, like mice or birds. In Australia they kill all our native wildlife, like innocent Bilby's who are now nearly extinct. Cats are ferocious hunters and you will never get that trait out of them until they ascend.\n\n\n\nIt might be interesting to know that out in the universe, cats are hunters as well. If you watch them play hunt as they are growing, you can see how natural this side of their life is. Unlike humans who are traumatised by killing, cats do it instinctually or for no other real reason. They need to know they have karma too. They enjoy a good killing and may think no more on it, but eventually, they will evolve out of this habit on Earth.\n\n\n\nMost star felines are on the side of the Light and so they may only hunt the Dark beings out there, to remove the dark when it is found somewhere it is not invited. The dark (usually reptilian) often go to worlds filled with light and try to turn them into slave planets with dark control, i.e. the Earth. The Feline starseed people are here to help us but also - the felines are in the skies or help us inter-dimensionally to transmute the darkness and help us bring Light back into this world. The Felines are an ancient race much older than the human race. They are excellent energy transmuters.\n\n\n\nEarth is a very interesting place. We have some of everything here and that is very rare. Our planet is a rare paradise and not just in the animal kingdom. If we look at races of people, the physical differences are obvious.\n\nbut what if countless wars have raged out in space between all these different races? What if they are at war and have been for millions of years, perhaps even forgetting why? How do we ever sort out this mess?\n\nMaybe we ARE a special planet in this universe, with an important purpose and we just don't know it yet.\n\nMany other animals on Earth have their roots in the stars as well. Felines are from the Lyran system, (and before that from another universe entirely), yet humans are also originally from that same system. Birds are an advanced race as well and yet we see less of the bird people. They are here though helping our planet through these difficult times. Obviously Earth's reptiles were seeded from reptilian races in Orion, like the dragons, which are both light and dark. They also originally came in from another universe (another game), one that had failed so they brought those failings into this universe. Now we are changing the game here and turning towards the Light once and for all.Mother Sekhmet, called this name from her Egyptian times, is the ninth dimensional or 9D version of felines. They don't have a feline body in the higher dimensions for they exist as pure energy, and that just shows us how the physical body doesn't matter so much anyway. We are all ultimately energy which we may \"step down\" in order to become physical and enter into some kind of body.Mother Sekhmet lives on Nibiru, or we call it planet X, the 10th planet in this solar system. It has a widely elliptical orbit but right now it is close to the rest of the planets and is near to the sun. Nibiru is not a natural planet, is it made, or is a space ship of sorts. It is in our solar system to protect it like a friendly death star, so it is our defense system. Sekhmet is actually a Collective of advanced feline beings, and you can read their channelings if you wish to google Mother Sekhmet.We have Asians, who originated from elsewhere, then we have red people, white people, and darker tribes, many of who were more blue but turned dark from our sun's radiation. We all came from different places in the universe but were put here to all get along with each other. That is the experiment of Earth. We were put here to learn how to love each other! Now we are all part of the same planet-home.I've been thinking of this a lot lately. You may not believe any of this,Could we put representatives of them onto a 'special' planet and let them all learn, over time, to be best friends. Let them all mix in and breed together and make the entire world a melting pot of love. Then send them back to their home worlds and let them teach and share the love they have learned.What do you think?I always thought these ideas were too strange or too obvious or too silly. However,, I'm finding out, is not always civilized. What if we really are that special world? What if our leaders don't want us to know, even though UFOs are often a sight for us.\n\nThis brings me to the last idea I've been thinking about a lot, the idea of all this fighting - not just on Earth but out in the universe. For some reason I always thought of Earth as the crazy place in the universe and that the rest of this galaxy must be more sensible and must exist in peace, or fight only occasionally. I always thought it was only here where we had all these insane wars that made no sense, with people being sent off to die for no outcome whatsoever. War never achieves anything whatsoever.\n\n\n\nBut truly, now I'm realising that wars happen \"out there\" too and in fact there are many of them, and some are incredibly old. There are wars and conflicts happening out there right now. \n\n\n\nMany are wars about Dark and Light; the dark is trying to conquer and the light is defending itself, which it is very good at. For example, the felines are brilliant killers and call themselves \"assassins\", and the lightened dragons are ferocious! They are expert killers but maybe they need to be, in order to defeat the dark. As humans, killing certainly does not come naturally to us and we abhor it. We follow God's laws that say \"Do Not Kill\". We are not built killers; we don't have claws or sharp teeth or breath fire. But can you see how crazy this universe seems to be? This \"killing\" does not sit well with me, but the felines and dragons talk about it like it is fun. Go figure, maybe for them it is, or maybe it is just a task.\n\n\n\nI have even heard of some races, like the Antarians, who exist in higher dimensions but may become lower dimensional again in order to defend themselves and their home planet. They exist near Orion so have many troubles with reptilians that are trying to conquer their world. We on Earth are protected by Nibiru so they have to keep away from this solar system. We are the Experiment of the universe meaning outside killers are not allowed near to us. They instead incarnated here to take over from within, known as the Cabal, but they have recently lost. The Light has won here on Earth.\n\n\n\nSometimes killing is unavoidable, like if you have mice or rats in your home which always breed like crazy. Unless you can find their holes and seal them, you need to use pellets to kill them and their offspring off. I've done this in many properties even though I feel bad. But who wants mice in their home?\n\n\n\nBut have a thought for the darker ones, the lost ones, the old overlords (and human minions) who used to run this world financially and in all ways. All dark is currently being cleansed from this world, with Felines and Dragons helping us in higher dimensions. We cannot just throw the dark ones away like yesterday's news. They were once like us in the Light, and they chose to play the darkness in this daring game. Now they find it hard to get out of the darkness and come back home to the Light. We need to have some compassion for them. We need to offer them love. This killing everyone off does not fit well with me and the Angels say we need to show compassion. We can instead lock them away for life in a secret underground facility. I suspect they pay karmically after they die.\n\n\n\nIt may seem an impossible task I know, for we had to face them like enemies in order to win this world. Now that we have won, now that Light is expanding here on Earth, can we show the dark a bit of compassion? I feel sorry for them. We don't have to be their best friends but we don't need to kill all of them - even though I suspect STRONGLY this is what is occurring secretly all over the world through the secret military trails. They are being cleared up.\n\n\n\nTo read more on Feline Starseeds go here.\n\n\n\nMore Starseed Articles \n\n Are You A Starseed?\n\n Sirian\n\n Pleiadian\n\n Arcturian\n\n Andromedan\n\n Lyran & Vegan\n\n Orion\n\n Feline\n\n Avian\n\n Reptilian\n\n Negative ETs - Full Disclosure\n\n The AI Controller - The Eye Atop The Pyramid\n\nThis article is copyright of AskingAngels.com. The first 200 words only may be shared as long as they are unaltered and proper credit is given to the website with this link www.askingangels.com included. The full article may not be copied or reproduced without express written permission from the copyright holder.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/articles/starseeds/felines.php", "/articles/starseeds/starseed.php", "/articles/starseeds/sirians.php", "/articles/starseeds/pleiadians.php", "/articles/starseeds/arcturians.php", "/articles/starseeds/andromedans.php", "/articles/starseeds/lyran-vegan-starseeds.php", "/articles/starseeds/orions.php", "/articles/starseeds/felines.php", "/articles/starseeds/avians.php", "/articles/starseeds/reptilians.php", "/articles/starseeds/negative-ets.php", "/articles/starseeds/ai-controller.php", "http://www.askingangels.com", "/spirit/portal-of-light-activation.php", "/healing/health/the-nuremberg-trials.php", "/articles/angels/incarnated-angels.php", "/articles/spiritual/twin-flame-love.php", "/articles/starseeds/negative-ets.php", "/articles/angels/ascendedmasters.php", "/psychic/numbers/what-are-angel-numbers.php", "/healing/healer-signs.php", "/articles/spiritual/soulmates-types.php", "/psychic/cutcords.php", "/articles/spiritual/ascension-symptoms.php", "/psychic/signs/feather-angel-sign.php", "/psychic/signs/butterfly-angel-sign.php", "/psychic/signs/rose-scent.php", "/psychic/signs/angel-wings-meaning.php", "/articles/angels/askformoney.php", "/psychic/energy-vampire.php", "/articles/interpreting-signs.php", "/psychic/areyoupsychic.php", "/psychic/four-clairs.php", "/articles/spiritual/spiritual-awakening.php", "/psychic/empath-signs.php", "/articles/spiritual/twin-flame-telepathy.php", "/healing/kundalini-awakening.php", "/psychic/spiritual-grounding.php", "/articles/starseeds/starseed.php", "/psychic/protection.php", "/articles/spiritual/lightworker-missions.php", "/articles/angels/names.php", "/articles/spiritual/twin-flame-meetings.php", "/articles/spiritual/twin-flame-separation.php", "/articles/spiritual/soulmates-signs.php", "/articles/spiritual/lightworker-traits.php", "/spirit/meditations/love-meditation.php", "/healing/earth/incarnated-elementals.php", "http://askingangels.com/articles.php"], "authors": [], "publish_date": null}