{"result_id": "038044", "URL": "http://askingangels.com/articles/starseeds/pleiadians.php", "timestamp": "2023-04-25 12:09:46 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://askingangels.com/articles/starseeds/pleiadians.php", "encoding": null}, "image": null, "domain": "askingangels.com", "title": "PLEIADIAN Starseed People | 5 Qualities, Appearance & Traits", "cleaned_text": "I have been around many Pleiadians during my own evolution. At first I denied it but Pleiadian starseeds always remark that they sense a lot of Pleiadian in me.\n\nThis article is copyright of Linda Aspinall. The first 200 words only may be shared as long as proper credit is given to the author and a link to this website www.askingangels.com is included. The full article may not be copied or reproduced without express written permission from the copyright holder.\n\nOn many levels I get along famously with Pleiadians and know what makes them tick. I am like them, I also know all the games they play because I used to play those same games. In fact, I have been intimately involved with Pleiadians for so long that I feel a need to distance myself and get to know other kinds of starseeds for a change! Perhaps the man I loved the most during this life is a Pleiadian elemental-being, one who is a bit too difficult to make it last.They are a somewhat young race compared to others. In fact races tend to spawn new races of their own when they achieve a certain mastery, and then look after their daughter race, watching over and guiding them, which is what Earth humans may one day do far off in the future.Humans from the Lyra constellation first spawned Pleiadians and they have since gone along on their own evolution in the Pleiades star system, creating their own societies and unique cultures. As a younger race, their messages have a different quality to the messages from others; they certainly offer a different perspective. For example they are younger than the Arcturians and Sirians. They are actually a lot more evolved than native humans on this world, so they represent where humanity is headed in the immediate future, and they act as teachers and guides to show Earth humans the way, having been involved in this world from way back. There have been Pleiadian rebellions and dark Pleiadians on this world as well.The Pleiadian energy is basically male (I think), and I trust certain channels who state this is true. My experience of them is one of power and masculine energy, especially from the females. It can be an odd quirk that their women are more masculine in their thinking than their men, and the males can seem much more feminine and take a back set to the women. These are some empowered women.I always recognise them by their unique personal power that they radiate constantly, and very strong personalities. I'm sure there are softer ones, but I have never met one. The lighted Pleiadians can have a vague sense of dark around them but this is not what they truly are. They are highly intelligent and spiritual, they know their minds, they do what they want to do, not what others think they should be doing.They don't know the meaning of peer pressure. If you think you know what a Pleiadian will do, think again because they always surprise with the unexpected. I think they just like springing the unexpected on others. They can keep their own council and are not generally gossips or blabbermouths. They know the art of generating personal power in their aura and keeping it there. They can seem quite on the edge (dark edge) sometimes, though never doubt their resolve or intelligence.Pleiadians are very intellectual and feeling creatures, and can possess deep compassion and love of life. They are extremely sexual creatures who put me in mind of dolphins, which swim around having sex all the time with different partners. Part of their spirituality is tied up with sex, or the ultimate bonding with another (or many others) in a sexual manner.Much of their spiritual philosophy revolves around the sex act, which is said to keep them rejuvenated, age more slowly, and reach higher spiritual planes. I have heard of other races doing likewise, but perhaps not to the same level.The darker Pleiadians seen from time to time can seem drunk on power, and seek to be revered or worshiped. They do not like aging. On Earth, I notice they can be quite social and are party animals. They are strong and unshakable spiritually, and follow their inner wisdom. They may seem stubborn but really I see this as strength, for they know what others may not and follow their own intelligence.Their actual origin is a world called Avalon in the Lyra constellation, which was destroyed by the dark Reptilians a very long time ago, after which they fled and colonised new worlds in the Pleiadian star system.The Arcturians have been their teachers, just as the Pleiadians can now be our teachers on Earth. They are the most like Earth humans in appearance since all humans originally come from the same stock in Lyra. Many say there are very Nordic in appearance. The Sirians also come from this Lyra stock and inhabit human bodies in the lower dimensions.Pleiadians have the highest number of starseeds out of all 200 million, having 75 million present on earth.I now include an article below by Michelle Walling.The Pleiades Star Cluster.\n\nAppearance: Appear much like particularly beautiful Earth humans, with perfect bodies and pleasingly symmetrical features with a luminosity reflecting their higher dimensional frequency.\n\nEvolution: Evolved millions of years ago as one of the early races of what we would call humankind and look like we do. This form has been modeled throughout the universe. Pleiadian DNA has been used to develop many human beings in this universe, including those of our solar system on Venus, Mars, Maldeck and Earth. There still exists newly developing 3D planets in the Pleiades, but the Pleiadians that communicate with us are usually 6D and 9D. These are dimensions they work well within and from which they contact other worlds. They have light bodies, yet like other higher dimensional ET beings, they can appear in a form that projects what they evolved from. Having a lot more time to evolve than we have, they have refined their natures and are intensely spiritual and giving beings.\n\nAbilities: Pleiadians are healers on many levels. They can empathize and sooth all pains with their sensitive communication and transfer of light. They communicate by means of light transfer. These beings have a natural radiance that comes from their mystical knowing of how to connect and share Source light.\n\nSpecialties: Pleiadians are called upon to seed new worlds with the essence of evolved human form, and to commune with a planet’s consciousness and its existing life in order to introduce new beings and ideas in a nurturing way. They embody the divine feminine and often will show themselves in female form to radiate this refined quality.\n\nBasic Needs: Peace and sharing. Pleiadians thrive in places and states of peace and tranquility. They feel best when they are sharing their refined essence.\n\nFocus: Transferring their gifts of radiance throughout the universe through seeding and communicating their healing vibrations and mystical awareness.\n\nInvolvement with Earth: Provided genetic and energetic model for early human development. They are the missing link in our evolution to our current form. They were guides for Atlantis and Lemuria and have been involved in the nurturing of many life forms on Earth that began elsewhere, such as whales and dolphins. They are responsible for infusing awareness into the many methods of energy healing discovered by humans over the years. They are playing an important role in reinvigorating our beliefs in the mystical elements of our knowledge and helping us open to celestial contact in non threatening manners. They radiate light and soothing energy that we are able to feel because of our genetic link.\n\nGuide for Humanity: Katara (of 6D Pleiadian Emissaries of Light collective)\n\nStar seeds: There are many millions of Pleiadian souls incarnate on Earth and have been since Lemuria. These souls are here to remind us of our divinity and our connection to Source consciousness. They come as healers and inspire us to nurture our spirits and that of the planet. These souls are sensitive and usually extremely intuitive. They also light up the room when they walk in and tend to heal without even knowing. They communicate well with others and are good empathetic listeners. Most leave their presence with a new sense of joy and gratitude. These human star souls often have physical beauty and most incarnate as females and exude feminine strength. They can be overpowering for some human male Earth souls, as they radiate such deep feminine mystique. They are often water signs that flow with emotion and passion and connection to the blood of Gaia. Pleiadian souls connect easily to nature. Animals love them and become calm in their presence. These star seeds can also bring the essence of a person’s soul to the surface and can reflect their purpose and encourage their mission. They are often found in professions of spiritual mastery, healing, psychology, communications, child care, and fields related to ecology and care for the Earth. They often volunteer for causes and give a lot of themselves.\n\nMore Starseed Articles \n\n Are You A Starseed?\n\n Sirian\n\n Pleiadian\n\n Arcturian\n\n Andromedan\n\n Lyran & Vegan\n\n Orion\n\n Feline\n\n Avian\n\n Reptilian\n\n Negative ETs - Full Disclosure\n\n The AI Controller - The Eye Atop The Pyramid\n\nAbout the author:\n\n Michelle Walling is a Certified Holistic Life Coach, webmaster, writer, and and Radio Host on In5d radio’s The Cosmic Awakening Show. As a truth seeker, she is committed to share her experiences with the world. Michelle has joined forces with Gregg Prescott as an admin for the In5d Facebook page, as an assistant for In5d Events, and as a contributing author for http://www.in5d.com. Michelle also supports Gregg’s endeavors in many other areas including alternative and holistic healthcare. Their next project is a walk in clinic under the name AHH- Alternative Holistic Healthcare to be launched in the Sarasota, Florida area, and then subsidiaries will be opened around the world based upon that model. All of Michelle Walling’s articles and radio appearances can be found on her database CosmicStarseeds.com. Holistic Counseling sessions can be booked through her website MichelleWalling.com. The truth about the holographic nature of the matrix and how we are going to dissolve it can be explored on her website Howtoexitthematrix.com. Michelle’s personal Facebook page can be found here.\n\n \n\n Michelle has licensed this article and picture under a Creative Commons Attribution-NonCommercial 3.0 Unported\n\nThis article is copyright of AskingAngels.com. The first 200 words only may be shared as long as they are unaltered and proper credit is given to the website with this link www.askingangels.com included. The full article may not be copied or reproduced without express written permission from the copyright holder.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.askingangels.com/", "/articles/starseeds/starseed.php", "/articles/starseeds/sirians.php", "/articles/starseeds/pleiadians.php", "/articles/starseeds/arcturians.php", "/articles/starseeds/andromedans.php", "/articles/starseeds/lyran-vegan-starseeds.php", "/articles/starseeds/orions.php", "/articles/starseeds/felines.php", "/articles/starseeds/avians.php", "/articles/starseeds/reptilians.php", "/articles/starseeds/negative-ets.php", "/articles/starseeds/ai-controller.php", "http://www.blogtalkradio.com/in5d-radio", "http://www.facebook.com/pages/In5d-Esoteric-Metaphysical-and-Spiritual-Database/274897519205760", "http://www.in5d.com/", "http://in5d.com/a-guide-to-earths-extraterrestrial-races/Michelle%20Walling%20is%20a%20Certified%20Holistic%20Life%20Coach,%20webmaster,%20writer,%20and%20and%20Radio%20Host%20on%20In5d%20radio%27s%20The%20Cosmic%20Awakening%20Show.%20%20As%20a%20truth%20seeker,%20she%20is%20committed%20to%20share%20her%20experiences%20with%20the%20world.%20Michelle%20has%20joined%20forces%20with%20Gregg%20Prescott%20as%20an%20admin%20for%20the%20In5d%20Facebook%20page,%20as%20an%20assistant%20for%20In5d%20Events,%20and%20as%20a%20contributing%20author%20for%20http://www.in5d.com.%20Michelle%20also%20supports%20Gregg%E2%80%99s%20endeavors%20in%20many%20other%20areas%20including%20alternative%20and%20holistic%20healthcare.%20Their%20next%20project%20is%20a%20walk%20in%20clinic%20under%20the%20name%20AHH-%20Alternative%20Holistic%20Healthcare%20to%20be%20launched%20in%20the%20Sarasota,%20Florida%20area,%20and%20then%20subsidiaries%20will%20be%20opened%20around%20the%20world%20based%20upon%20that%20model.%20All%20of%20Michelle%20Walling%E2%80%99s%20articles%20and%20radio%20appearances%20can%20be%20found%20on%20her%20database%20%20CosmicStarseeds.com.%20Holistic%20Counseling%20sessions%20can%20be%20booked%20through%20her%20website%20MichelleWalling.com.%20The%20truth%20about%20the%20holographic%20nature%20of%20the%20matrix%20and%20how%20we%20are%20going%20to%20dissolve%20it%20can%20be%20explored%20on%20her%20website%20Howtoexitthematrix.com.%20Michelle%E2%80%99s%20personal%20Facebook%20page%20can%20be%20found%20here.", "http://www.michellewalling.com/", "http://www.howtoexitthematrix.com/", "http://www.facebook.com/michelle.sukup.9", "http://creativecommons.org/licenses/by-nc/3.0/", "http://www.askingangels.com", "/spirit/portal-of-light-activation.php", "/healing/health/the-nuremberg-trials.php", "/articles/angels/incarnated-angels.php", "/articles/spiritual/twin-flame-love.php", "/articles/starseeds/negative-ets.php", "/articles/angels/ascendedmasters.php", "/psychic/numbers/what-are-angel-numbers.php", "/healing/healer-signs.php", "/articles/spiritual/soulmates-types.php", "/psychic/cutcords.php", "/articles/spiritual/ascension-symptoms.php", "/psychic/signs/feather-angel-sign.php", "/psychic/signs/butterfly-angel-sign.php", "/psychic/signs/rose-scent.php", "/psychic/signs/angel-wings-meaning.php", "/articles/angels/askformoney.php", "/psychic/energy-vampire.php", "/articles/interpreting-signs.php", "/psychic/areyoupsychic.php", "/psychic/four-clairs.php", "/articles/spiritual/spiritual-awakening.php", "/psychic/empath-signs.php", "/articles/spiritual/twin-flame-telepathy.php", "/healing/kundalini-awakening.php", "/psychic/spiritual-grounding.php", "/articles/starseeds/starseed.php", "/psychic/protection.php", "/articles/spiritual/lightworker-missions.php", "/articles/angels/names.php", "/articles/spiritual/twin-flame-meetings.php", "/articles/spiritual/twin-flame-separation.php", "/articles/spiritual/soulmates-signs.php", "/articles/spiritual/lightworker-traits.php", "/spirit/meditations/love-meditation.php", "/healing/earth/incarnated-elementals.php", "http://askingangels.com/articles.php"], "authors": [], "publish_date": null}