{"result_id": "038025", "URL": "http://askingangels.com/psychic/articles/alternate-timelines.php", "timestamp": "2023-04-25 12:09:36 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://askingangels.com/psychic/articles/alternate-timelines.php", "encoding": null}, "image": null, "domain": "askingangels.com", "title": "ALTERNATE TIMELINES | The View From A Psychic, My Stories", "cleaned_text": "Alternate Timelines are realities that exist alongside ours but differ in various ways. Most often they differ because of making a different choice that takes us in another direction. \n\n \n\n\n\nWhat Does It Mean?\n\nThis article is copyright of AskingAngels.com. The first 200 words only may be shared as long as they are unaltered and proper credit is given to the website with this link www.askingangels.com included. The full article may not be copied or reproduced without express written permission from the copyright holder.\n\nI first became aware of these natural timelines whilst talking to my angels and being given different predictions for the future. As any psychic knows, the future that we are shown can change if another decision is made. So if I am reading for someone and they do something completely different, all that I saw around them may alter. It does not mean that the future I saw doesn't happen, it just no longer happens ontimeline.Humans are in fact inter-dimensional beings, as are all living things. It is difficult to contemplate alternate realities without carrying it forward to determine that the entire of reality must be essentially infinite. Since our reasoning mind cannot comprehend \"infinite\" comfortably we can get confused. The closest you can understand infinite may be during meditation if you are using your Higher Mind. Since that is complicated, let's assume that infinite exists and move on to analysing the alternate realities.Essentially, the idea behind alternate timelines is that we can create a new timeline that branches off almost every second. Every second of our life we can make a different choice, so that many slightly different timelines can branch off. If you consider your life, how many big choices have you made that affected your entire life?This is where it gets complicated for we create a different alternate reality with each big choice we make, and on each of those branches, there are infinite other branches being formed. It makes my head spin to think of ALL the different ways I have gone - from career choices and jobs, to hobbies, to friends, and to partners. So many different pathways.These choices are real on the other timelines; in other worlds, those different worlds all exist. Often in movies like Back To The Future, we are shown that changing a past event somehow changes the future, and in a way this is true. It creates a new line that is different. However, this never deletes the previous timeline, which continues to propagate in its own way. Once a choice is made, we have a new line that keeps going forward into the future.When you consider that each person on the world and each animal, etc, is creating large numbers of timelines constantly, you can see how they can be considered infinite.The way it works for me is that my angels often warn me or show me what will happen if I go a certain way. Since the angels watch us from outside of time and space, they know what each decision will cause to happen for they can see it. Then they tell me the situation is dire in that direction, I can avoid that particular choice. I am always working with my own timeline to find the best outcomes and especially to avoid the bad pitfalls, of which there are many.Some of the pitfalls I have avoided include a few divorces, a suicide, illness and being injured a few times, and being seriously depressed from failed relationships. And that is just for starters. My angels may say something to me like, \"Don't ever get into a car with this person; you must always drive yourself or you will crash and need to learn to walk all over again.\" Yikes. Then they add that it isn't meant to be that way and there is no lesson for me in this experience. When they say things like this about someone, I tend to avoid that relationship just to avoid the car crash the person causes. It is a very useful way to navigate through the world. Sometimes they tell me not to go out on a certain day because I'll be involved in an inconvenient car accident, a small one. On those days I stay home just to be on the safe side, or to be doubly sure, my car won't start on those days or something like that.Alternate timelines are what I read when I ask my angels to show me the future, either for myself or for another. They show us the mosttimeline at that point in time. I will pick up the information both clairvoyantly and clairsentiently and then relay what I can see. I talk about the optionto happen. If a client doesn't like this, they may come back every two weeks to ask the same question, and I always get exactly the same reading. It is only if they change something significantly that I begin to see a new probable future on the cards for them.Its interesting to me how often I change timelines by making new decisions based on what I'm shown psychically. It's almost like I have mostly bad timelines to choose from. I've seen myself being strangled by a lover who lost control of his rage. I'm not sure how probable or likely this was, but it was one option that he could make (maybe 30% probable), so this lover is no longer a part of my life. We could have been very happy if we had gotten past this point, however I don't want to take the chance. There is another lover who was desperate to be married (in the future) but I saw him change right after the wedding to be strict on removing my freedoms, so that is no longer an option for me. That one was 100% probable with no way to change it, so now I only wish to be friends with this person.I keep skipping from line to line looking for that person who will be there for me. The alternate versions of me are living precarious lives with other people, in many different alternate worlds, some with children. I am the lucky one perhaps, the one who is still single and still waiting for just the right opportunity to come by (and I have recently found a nice future that could happen with someone new).Its a little exhausting to go constantly through all the timelines as they come up but it seems to work well for me. I know my angels have my back and are constantly helping me to avoid various disasters. I am just hanging out for that nice man I know is out there waiting for me.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.askingangels.com", "/spirit/portal-of-light-activation.php", "/healing/health/the-nuremberg-trials.php", "/articles/angels/incarnated-angels.php", "/articles/spiritual/twin-flame-love.php", "/articles/starseeds/negative-ets.php", "/articles/angels/ascendedmasters.php", "/psychic/numbers/what-are-angel-numbers.php", "/healing/healer-signs.php", "/articles/spiritual/soulmates-types.php", "/psychic/cutcords.php", "/articles/spiritual/ascension-symptoms.php", "/psychic/signs/feather-angel-sign.php", "/psychic/signs/butterfly-angel-sign.php", "/psychic/signs/rose-scent.php", "/psychic/signs/angel-wings-meaning.php", "/articles/angels/askformoney.php", "/psychic/energy-vampire.php", "/articles/interpreting-signs.php", "/psychic/areyoupsychic.php", "/psychic/four-clairs.php", "/articles/spiritual/spiritual-awakening.php", "/psychic/empath-signs.php", "/articles/spiritual/twin-flame-telepathy.php", "/healing/kundalini-awakening.php", "/psychic/spiritual-grounding.php", "/articles/starseeds/starseed.php", "/psychic/protection.php", "/articles/spiritual/lightworker-missions.php", "/articles/angels/names.php", "/articles/spiritual/twin-flame-meetings.php", "/articles/spiritual/twin-flame-separation.php", "/articles/spiritual/soulmates-signs.php", "/articles/spiritual/lightworker-traits.php", "/spirit/meditations/love-meditation.php", "/healing/earth/incarnated-elementals.php", "http://askingangels.com/articles.php"], "authors": [], "publish_date": null}