{"result_id": "038035", "URL": "http://askingangels.com/articles/newearth/third-jab-ai.php", "timestamp": "2023-04-25 12:09:41 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://askingangels.com/articles/newearth/third-jab-ai.php", "encoding": null}, "image": null, "domain": "askingangels.com", "title": "The Third Jab Will Sever God & Introduce AI Into People", "cleaned_text": "The Third Jab Will Sever God, Introduce AI\n\n\n\nThey are saying online that the third Jab that rolls out will sever the human from God, sever them from their heart, and sever them from their Self, so please take this as a warning to be careful about this jab. The first two jabs prepare the human for this, introduce all kinds of metals and chips into them, (as seen with magnets that now stick to their injection site) and even set to work apparently killing them working in conjunction with 5G.\n\nin the most corrupt election process\n\nI want to give my source but don't want to see her removed. They can easy censor her. She has been brilliant as of late and although she went through a period of months of not working with Ashtar or the Galactic Federation, I am over the moon she figured out their problems and has come back. I was going to write an article about people who are doing Ashtar wrong, but now I see it isn't necessary. Sometimes they can greatly disappoint you, and sometimes they can come back! Isn't it amazing?Now what this lady is all about is talking about the Reptilians and the dark force, etc, and what they are doing. I can only take her word for this but her information fits in with what I have already read, i.e. The New Nuremberg Trials . Yes I know, the Reptoids are already gone from this world recently, lets say the Chimera are gone (almost) and others are all gone. But we must still contend with what is on the surface of this planet, which includes vast numbers of Reptilian-Human hybrids. They are the ones reading to us the so-called \"news\" and telling us all this garbage. They are the ones in positions of power and politics, and the ones who stole the 2020 election in AmericaThey are the ones pushing the vaccine that is not accepted by the FDA, that has had no animal or human trials and is in fact. Fact. But they don't tell you that, do they? There are large numbers of people who are already dead as a result of the jab, according to the article The New Nuremberg Trials . Yet you are not hearing any of this.I am aghast to hear that numbers getting the vaxx are around 50% in Europe and America and even higher in UK with 57%, according to Australian television. But we were told that the numbers here in Australia are just 2%. Yes, you read that right. We Aussies are avoiding the jab at all costs. There have been many reports of blood clots from those getting the jab, and after all, we have not had a death in Australia from covid for six months. So we're pretty chill. They are now trying to make it mandatory here so good luck with that. It simply won't happen. I am happy to say, in case you have been out of the loop, Earth's military after being at war for years, are about to start with the \"surface\" Cabal, i.e. those on the surface of the planet, after years of destroying the DUMBs and other garbage below ground. This seems to be nearing the end, and thank Goodness for that. I for one am tired of the almost daily fly-overs of helicopters equipped with DEWs. It will be nice to have them gone. And with the new Amnesty that has been announced (which I fall under), they will just be wasting their time anyway.All aliens are being removed from this planet, and all alien-human hybrids will probably be removed but, unfortunately they can of course choose the Light and they may get to stay. I believe most of them will be going to an orbital prison ship and then off they go, straight to galactic court. And good riddance to them.I may add more to this article but this is so important I'm going to publish it today. And good work by the amazing lady who came back to us after her rift with Ashtar; bloody good work!\n\nThis article is copyright of AskingAngels.com. The first 200 words only may be shared as long as they are unaltered and proper credit is given to the website with this link www.askingangels.com included. The full article may not be copied or reproduced without express written permission from the copyright holder.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/healing/health/the-nuremberg-trials.php", "/healing/health/the-nuremberg-trials.php", "http://www.askingangels.com", "/spirit/portal-of-light-activation.php", "/healing/health/the-nuremberg-trials.php", "/articles/angels/incarnated-angels.php", "/articles/spiritual/twin-flame-love.php", "/articles/starseeds/negative-ets.php", "/articles/angels/ascendedmasters.php", "/psychic/numbers/what-are-angel-numbers.php", "/healing/healer-signs.php", "/articles/spiritual/soulmates-types.php", "/psychic/cutcords.php", "/articles/spiritual/ascension-symptoms.php", "/psychic/signs/feather-angel-sign.php", "/psychic/signs/butterfly-angel-sign.php", "/psychic/signs/rose-scent.php", "/psychic/signs/angel-wings-meaning.php", "/articles/angels/askformoney.php", "/psychic/energy-vampire.php", "/articles/interpreting-signs.php", "/psychic/areyoupsychic.php", "/psychic/four-clairs.php", "/articles/spiritual/spiritual-awakening.php", "/psychic/empath-signs.php", "/articles/spiritual/twin-flame-telepathy.php", "/healing/kundalini-awakening.php", "/psychic/spiritual-grounding.php", "/articles/starseeds/starseed.php", "/psychic/protection.php", "/articles/spiritual/lightworker-missions.php", "/articles/angels/names.php", "/articles/spiritual/twin-flame-meetings.php", "/articles/spiritual/twin-flame-separation.php", "/articles/spiritual/soulmates-signs.php", "/articles/spiritual/lightworker-traits.php", "/spirit/meditations/love-meditation.php", "/healing/earth/incarnated-elementals.php", "http://askingangels.com/articles.php"], "authors": [], "publish_date": null}