{"result_id": "038022", "URL": "http://askingangels.com/healing/earth/chemtrails.php", "timestamp": "2023-04-25 12:09:35 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://askingangels.com/healing/earth/chemtrails.php", "encoding": null}, "image": null, "domain": "askingangels.com", "title": "Healing & Dissolve Chemtrails, Message From Ashtar Galactic Fleet", "cleaned_text": "Have you ever noticed the crisscross of white trails in the skies above your home and city? Or noticed the strange plane activity as the same plane flies over your suburb first one way, then the other, until several white trails are left to disperse their toxic cloud, ready to drift down onto all life below, be it human, animal, plant and soil/water?\n\nHow To Rid The Earth Of Chemtrails\n\nLet me describe to you how you can do this yourselves. Every time one of you does this, we are able to come in our ships to eliminate more of these poison clouds.\n• Place your hands out before you, palm down.\n• Move your hands together so that your thumbs overlap, forming a U-shaped opening between them.\n• Now, turn your hands so that the palms face each other.\n• Fold the last three fingers of your right hand into a partial fist, leaving your pointer finger pointing toward the sky. You are now armed with a powerful energy-focusing \"weapon\" that can channel your Light-force toward the chemtrails. Start with the tail and aim your intention to dissolve the vaporous trails, and moving your pointer finger along the elongated cloud steadily, focus your attention with the purpose of bringing Light and Love to your Earth's environment and the people below who need to be protected. Call my name (Ashtar) and report to us as you perform this service. We will feel your heartfelt intention and will be able to eliminate a specified percentage of the existing trails, depending on the current participation of those on the ground. Our ability to intervene is growing daily, as you can see by the dwindling number of chemtrails in your atmosphere at this time. We expect that they will be completely eliminated once all of you who are reading this are involved with us.\n\nSometimes there are dozens of trails left by the same plane as it deliberately drops it poisonous cargo.For years some people have called Chemtrails a \"conspiracy theory\" yet now that the problem of poisoning has become so prevalent, it has been discussed at the United Nations. I believe this makes it anconspiracy, indeed a conspiracy Fact. Read more on my blog Does the above picture look deliberate, like someone is deliberately \"spraying\" us and our cities? This has been happening for decades so please do not be too alarmed. We indeed have been subject to many and various experiments in illness and sickness as chemical loads have been dropped on us whilst we watch the increase in all kinds of diseases. The angels and Ascended Masters have been aware of this illegal activity on earth that goes against divine law. Now a way has been provided that we might work with the angels and angelic fleets to disperse and dissolve the poison that is being dropped on us. Below I will provide a technique that has just been given us by Ashtar.\n\nWhat wonderful news from Ashtar, and this will give us something to do instead of feeling helpless when we see these trails in the sky.\n\n\n\nThis article is copyright of AskingAngels.com. The first 200 words only may be shared as long as they are unaltered and proper credit is given to the website with this link www.askingangels.com included. The full article may not be copied or reproduced without express written permission from the copyright holder.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://askingangels.com/linsblog/2015/08/chemtrails-are-real-addressed-at-un/", "http://www.askingangels.com", "/spirit/portal-of-light-activation.php", "/healing/health/the-nuremberg-trials.php", "/articles/angels/incarnated-angels.php", "/articles/spiritual/twin-flame-love.php", "/articles/starseeds/negative-ets.php", "/articles/angels/ascendedmasters.php", "/psychic/numbers/what-are-angel-numbers.php", "/healing/healer-signs.php", "/articles/spiritual/soulmates-types.php", "/psychic/cutcords.php", "/articles/spiritual/ascension-symptoms.php", "/psychic/signs/feather-angel-sign.php", "/psychic/signs/butterfly-angel-sign.php", "/psychic/signs/rose-scent.php", "/psychic/signs/angel-wings-meaning.php", "/articles/angels/askformoney.php", "/psychic/energy-vampire.php", "/articles/interpreting-signs.php", "/psychic/areyoupsychic.php", "/psychic/four-clairs.php", "/articles/spiritual/spiritual-awakening.php", "/psychic/empath-signs.php", "/articles/spiritual/twin-flame-telepathy.php", "/healing/kundalini-awakening.php", "/psychic/spiritual-grounding.php", "/articles/starseeds/starseed.php", "/psychic/protection.php", "/articles/spiritual/lightworker-missions.php", "/articles/angels/names.php", "/articles/spiritual/twin-flame-meetings.php", "/articles/spiritual/twin-flame-separation.php", "/articles/spiritual/soulmates-signs.php", "/articles/spiritual/lightworker-traits.php", "/spirit/meditations/love-meditation.php", "/healing/earth/incarnated-elementals.php", "http://askingangels.com/articles.php"], "authors": [], "publish_date": null}