{"result_id": "038056", "URL": "http://askingangels.com/articles/newearth/kryon-timelines.php", "timestamp": "2023-04-25 12:09:52 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://askingangels.com/articles/newearth/kryon-timelines.php", "encoding": null}, "image": null, "domain": "askingangels.com", "title": "THE KRYON TIMELINES & How They Changed The Whole World", "cleaned_text": "I am a big fan of Kryon and if you have been following him, he is simply another part of what we call Archangel Michael, who is a large collective of beings. Kryon is extremely interesting and he has been channeling on Earth since 1987 and the Harmonic Convergence when things began to change on this planet. He channels though Lee Carroll and he has done many, many channelings, most of which I have never read. Now he tells us a crucial part of the tale many people may be unaware of and I wish to share this strange timeline information he describes and which we are currently on. Yes, we are on this strange timeline but we just think it is normal. It isn't, or at least it wasn't. Maybe now it is beginning to become normal to us...\n\n \n\n\n\nWell, every timeline except one. I swear, there was one little timeline where they did not do this; where they were unable to do this. Only one. And we are on this timeline, and we are still here. Amazing.\n\nThese timelines do not belong to Kryon; he did not create them or cause them to exist and that is what exactly is fascinating about them. Yet they do exist. If you consider the old timelines....just imagine how we all felt back living in the eighties. It was a time of great worry I remember and we all seemed to know instinctively that we were NOT long for this world. There was this thing called Nuclear Proliferation and there was absolutely no hope we could survive this period. Indeed, we had the Nostradamus prophecies and the telling of exactly what was going to happen to us, and all of these prophecies were correct. They were right. We in fact, and I joke not, destroyed ourselves back in the nineties with nuclear warheads fired off all over the place. Every timeline did this; we destroyed the entire Earth. Maybe only those deep underground survived to fly off happy they destroyed the planet, as their plan said they would.Now Kryon talks of this event. We are on the one timeline where God stepped in and stopped them. Why? Intervention of this kind is hardly possible; in fact it is infinitely improbable. God lets it unfold how it is. God never steps in and intervenes - and by intervenes I mean that God allowed the Galactics to come here and stop all of the nuclear warheads from exploding. They were all fired off no doubt, but they never went off. It is a question of physics and the galactics are able to neutralize a nuke from exploding. There are nuclear warheads hidden in every city of the world, probably thousands all over the place. They meant, the cabal meant, to obliterate us, to rid the universe of us forever, but they could not, not on this timeline.It is a Prime Directive to never stop the natural occurrence, so we all died and the planet was destroyed. Except here. And this occurrence is HUGE. It in fact saves the entire universe. You will hear all kinds of entities saying that they thought we were gone for all money. We were wiped out and with it, the fate of the universe, at least below the 5th dimension. Yet, we have this strange timeline, we have Galactic intervention, and most importantly we have this rescue mission of the universe, and it DOES survive, on this new set of timelines. It is considered a miracle. It is VERY fortunate and interesting. But for us humans on the Earth, it means we survive and we get to continue on - in a very new Earth with our galactic friends who are coming, or they are actually here, walking amongst us. This is what it means. And we all get to Ascend up to the 5th dimension in order to escape what awaits on the 3rd, our former old timelines (or something similar).I remember the nineties and walking around for years in a daze when I realised we had survived the nuclear holocaust. The holocaust simply never happened. Well the nukes were fired of amazingly quickly but never exploded. I remember I started to read books back then (channeled books) about us surviving. I was horrified and amazed. What the heck happened? I thought the Earth deserved it's fate because it was a horrible, corrupt place. It wasn't until 2001 (when I first got online) and mainly a few years later that I found Kryon and heard about this miracle. I was stunned. No doubt hardly anyone realises what Kryon was talking about. I've never heard it or read about it anywhere. But this is what it was, this miracle, this single timeline that came through that period and where we were all saved. And then it branched off into many possibilities where we survived, probably billions of them. Incredible!Yes, humanity mainly slept through all of this. They kept on watching the news and believing the lies, with no idea the entire planet was run off planet by awful Reptoids and Chimera, etc. By AI. No idea. They are starting to wake up now. And this is where Disclosure comes in, where soon we will all learn the truth about this DARK agenda that has been in place for thousands of years. Only after the dark ones are cleared off our planet for good will we start to hear it, and they are nearly gone.To hear about what Kryon said, you will need to listen to him around the dates 2003-2006 (the best I can remember anyway). I never recorded what he said but these recordings are all over the internet. Try his website at kryon.com to hear them. You can also read online at this site what he said. They can also be found on YouTube but this can be more difficult to find the ones you want. He has done many, many channelings. He does bring it up periodically even years later because it was such an event. It is one of the reasons he is here, after all. So cool!So this is WHY we are on an upwards path spiritually and why the entire Earth will be, not only saved, but become some kind of successful experiment to saving the universe. The experiment worked. The reason and goal of the Earth experiment worked out. What was this experiment? Apparently it was something about coming all the way down to 3D and someone worked out how to Ascend, without help, up to 5 or 7D and did it. It's a happy story, it's some kind of miracle but who cares how it happened. It saved a lot of species in 3D from being overthrown by Reptoids and AI and I for one am eminently thankful for it. And of course thankful to God in the Highest. What a huge relief!\n\nThis article is copyright of AskingAngels.com. The first 200 words only may be shared as long as they are unaltered and proper credit is given to the website with this link www.askingangels.com included. The full article may not be copied or reproduced without express written permission from the copyright holder.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.kryon.com", "http://www.askingangels.com", "/spirit/portal-of-light-activation.php", "/healing/health/the-nuremberg-trials.php", "/articles/angels/incarnated-angels.php", "/articles/spiritual/twin-flame-love.php", "/articles/starseeds/negative-ets.php", "/articles/angels/ascendedmasters.php", "/psychic/numbers/what-are-angel-numbers.php", "/healing/healer-signs.php", "/articles/spiritual/soulmates-types.php", "/psychic/cutcords.php", "/articles/spiritual/ascension-symptoms.php", "/psychic/signs/feather-angel-sign.php", "/psychic/signs/butterfly-angel-sign.php", "/psychic/signs/rose-scent.php", "/psychic/signs/angel-wings-meaning.php", "/articles/angels/askformoney.php", "/psychic/energy-vampire.php", "/articles/interpreting-signs.php", "/psychic/areyoupsychic.php", "/psychic/four-clairs.php", "/articles/spiritual/spiritual-awakening.php", "/psychic/empath-signs.php", "/articles/spiritual/twin-flame-telepathy.php", "/healing/kundalini-awakening.php", "/psychic/spiritual-grounding.php", "/articles/starseeds/starseed.php", "/psychic/protection.php", "/articles/spiritual/lightworker-missions.php", "/articles/angels/names.php", "/articles/spiritual/twin-flame-meetings.php", "/articles/spiritual/twin-flame-separation.php", "/articles/spiritual/soulmates-signs.php", "/articles/spiritual/lightworker-traits.php", "/spirit/meditations/love-meditation.php", "/healing/earth/incarnated-elementals.php", "http://askingangels.com/articles.php"], "authors": [], "publish_date": null}