{"result_id": "038001", "URL": "http://askingangels.com/healing/health/the-nuremberg-trials.php", "timestamp": "2023-04-25 12:09:23 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://askingangels.com/healing/health/the-nuremberg-trials.php", "encoding": null}, "image": null, "domain": "askingangels.com", "title": "THE NUREMBERG TRIALS - 2021 | The Covid19 Vaccines", "cleaned_text": "May 12, 2021 By Steve Beckow @ Golden Age Of Gaia\n\n\n\nA comprehensive look at how the Covid19 vaccines violate the Nuremberg Laws. Thanks to Len.\n\nA team of over 1,000 lawyers and over 10,000 medical experts led by Dr. Reiner Fuellmich have begun legal proceedings against the CDC, WHO & the Davos Group for crimes against humanity. Fuellmich and his team present the faulty PCR test and the order for doctors to label any comorbidity death as a Covid death as fraud. The PCR test was never designed to detect pathogens and is 100% faulty at 35 cycles. All the PCR tests overseen by the CDC are set at 37 to 45 cycles. The CDC admits that any tests over 28 cycles are not admissible for a positive reliable result. This alone invalidates over 90% of the alleged covid cases / ”infections” tracked by the use of this faulty test.\n\nIn addition to the flawed tests and fraudulent death certificates, the “experimental” vaccine itself is in violation of Article 32 of the Geneva Convention. Under Article 32 of the 1949 Geneva Convention IV, “mutilation and medical or scientific experiments not necessitated by the medical treatment of a protected person” are prohibited. According to Article 147, conducting biological experiments on protected persons is a grave breach of the Convention.\n\nThe “experimental” vaccine is in violation of all 10 of the Nuremberg Codes which carry the death penalty for those who seek to violate these International Laws.\n\nThe “vaccine” fails to meet the following five requirements to be considered a vaccine and is by definition a medical “experiment” and trial:\n\nProvides immunity to the virus\n\n This is a “leaky” gene therapy that does not provide immunity to Covid and claims to reduce symptoms yet double-vaccinated are now 60% of the patients requiring ER or ICU with covid infections.\n\nProtects recipients from getting the virus\n\n This gene-therapy does not provide immunity and double-vaccinated can still catch and spread the virus.\n\nReduces deaths from the virus infection\n\n This gene-therapy does not reduce deaths from the infection. Double-vaccinated infected with Covid have also died.\n\nReduces circulation of the virus\n\n This gene-therapy still permits the spread of the virus as it offers zero immunity to the virus.\n\nReduces transmission of the virus\n\n This gene-therapy still permits the transmission of the virus as it offers zero immunity to the virus.\n\nViolations of the Nuremberg Code are as follows:\n\nNo person should be forced to take a medical experiment without informed consent. Many media, political and non-medical persons are telling people to take the shot. They offer no information as to the adverse effects or dangers of this gene-therapy. All you hear from them is – “ safe and effective” and “ benefits outweigh the risks.” Countries are using lockdowns, duress and threats to force people to take this vaccine or be prohibited to participate in free society under the mandate of a Vaccine Passport or Green Pass. During the Nuremberg trials, even the media was prosecuted and members were put to death for lying to the public, along with many of the doctors and Nazis found guilty of Crimes Against Humanity.\n\nAs listed above, the gene-therapy does not meet the criteria of a vaccine and does not offer immunity to the virus. There are other medical treatments that yield fruitful results against Covid such as Ivermectin, Vitamin D, Vitamin C, Zinc and boosted immune systems for flu and colds.\n\nNuremberg Code #3: Base Experiments on Results of Animal Experimentation and Natural History of Disease\n\nThis gene therapy skipped animal testing and went straight to human trials. In mRNA research that Pfizer used – a candidate study on mRNA with rhesus macaques monkeys using BNT162b2 mRNA and in that study all the monkeys developed pulmonary inflammation but the researchers considered the risk low as these were young healthy monkeys from the age of 2-4. Israel has used Pfizer and the International Court of Law has accepted a claim for 80% of the recipients having pulmonary inflammation from being injected with this gene-therapy. Despite this alarming development Pfizer proceeded to develop their mRNA for Covid without animal testing.\n\nSince the rollout of the experiment and listed under the CDC VAERS reporting system over 4,000 deaths and 50,000 vaccine injuries have been reported in America. In the EU over 7,000 deaths and 365,000 vaccine injuries have been reported. This is a grievous violation of this code.\n\nNuremberg Code #5: No Experiment to be Conducted if There’s Reason to Think Injury or Death Will Occur\n\nSee #4, based on fact-based medical data this gene-therapy is causing death and injury. Past research on mRNA also shows several risks that have been ignored for this current trial gene-experiment. A 2002 study on SARS-CoV-1 spike proteins showed they cause inflammation, immunopathology, blood clots, and impede Angiotensin 2 expression. This experiment forces the body to produce this spike-protein inheriting all these risks.\n\nNuremberg Code #6: Risk Should Never Exceed the Benefit\n\nCovid-19 has a 98-99% recovery rate. The vaccine injuries, deaths and adverse side-effects of mRNA gene-therapy far exceed this risk. The use of “leaky” vaccines was banned for agriculture use by the US and EU due to the Marek Chicken study that shows ‘hot-viruses’ and variants emerge… making the disease even more deadly. Yet, this has been ignored for human use by the CDC knowing fully the risk of new deadlier variants emerge from leaky vaccinations. The CDC is fully aware that the use of leaky vaccines facilitates the emergence of hot (deadlier) strains. Yet they’ve ignored this when it comes to humans.\n\nNuremberg Code #7: Preparation Must Be Made Against Even a Remote Possibility of Injury, Disability or Death\n\nThere were no preparations made. This gene therapy skipped animal trials. The pharmaceutical companies’ own Phase 3 human clinical trials will not conclude until 2022 /2023. These vaccines were approved under an Emergency Use only act and forced on a misinformed public. They are NOT FDA-approved.\n\nNuremberg Code #8: Experiment Must Be Conducted by Scientifically Qualified Persons\n\nPoliticians, media and actors claiming that this is a safe and effective vaccine are not qualified. Propaganda is not medical science. Many retail outlets such as Walmart & drive-through vaccine centers are not qualified to administer experimental medical gene-therapies to the uninformed public.\n\nNuremberg Code #9: Anyone Must Have the Freedom to Bring the Experiment to an End At Any Time\n\nDespite the outcry of over 85,000 doctors, nurses, virologists and epidemiologists – the experiment is not being ended. In fact, there are currently many attempts to change laws in order to force vaccine compliance. This includes mandatory and forced vaccinations. Experimental ‘update’ shots are planned for every 6 months without any recourse to the growing number of deaths and injuries already caused by this experiment. These ‘update’ shots will be administered without any clinical trials. Hopefully this new Nuremberg Trial will put an end to this crime against humanity.\n\nNuremberg Code #10: The Scientist Must Bring the Experiment to an End At Any Time if There’s Probable Cause of it Resulting in Injury or Death\n\nIt is clear in the statistical reporting data that this experiment is resulting in death and injury yet all the politicians, drug companies and so-called experts are not making any attempt to stop this gene-therapy experiment from inflicting harm on a misinformed public.\n\nWhat can you do to help put an end to this crime against humanity? Share this information. Hold your politicians, media, doctors and nurses accountable – that if they are complicit in this crime against humanity they too are subject to the laws set forth in the Geneva Convention and Nuremberg Code and can be tried, found guilty and put to death. Legal proceedings are moving forward, evidence has been collected and a large growing body of experts are sounding the alarm.\n\nVisit the Covid Committee website at: https://corona-ausschuss.de/ and if you have been affected by this crime, report the event, persons involved, and as much detail to the following website:\n\nThis article is copyright of AskingAngels.com. The first 200 words only may be shared as long as they are unaltered and proper credit is given to the website with this link www.askingangels.com included. The full article may not be copied or reproduced without express written permission from the copyright holder.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.askingangels.com", "/spirit/portal-of-light-activation.php", "/healing/health/the-nuremberg-trials.php", "/articles/angels/incarnated-angels.php", "/articles/spiritual/twin-flame-love.php", "/articles/starseeds/negative-ets.php", "/articles/angels/ascendedmasters.php", "/psychic/numbers/what-are-angel-numbers.php", "/healing/healer-signs.php", "/articles/spiritual/soulmates-types.php", "/psychic/cutcords.php", "/articles/spiritual/ascension-symptoms.php", "/psychic/signs/feather-angel-sign.php", "/psychic/signs/butterfly-angel-sign.php", "/psychic/signs/rose-scent.php", "/psychic/signs/angel-wings-meaning.php", "/articles/angels/askformoney.php", "/psychic/energy-vampire.php", "/articles/interpreting-signs.php", "/psychic/areyoupsychic.php", "/psychic/four-clairs.php", "/articles/spiritual/spiritual-awakening.php", "/psychic/empath-signs.php", "/articles/spiritual/twin-flame-telepathy.php", "/healing/kundalini-awakening.php", "/psychic/spiritual-grounding.php", "/articles/starseeds/starseed.php", "/psychic/protection.php", "/articles/spiritual/lightworker-missions.php", "/articles/angels/names.php", "/articles/spiritual/twin-flame-meetings.php", "/articles/spiritual/twin-flame-separation.php", "/articles/spiritual/soulmates-signs.php", "/articles/spiritual/lightworker-traits.php", "/spirit/meditations/love-meditation.php", "/healing/earth/incarnated-elementals.php", "http://askingangels.com/articles.php"], "authors": [], "publish_date": null}