{"result_id": "038003", "URL": "http://askingangels.com/articles/spiritual/who-is-st-germain.php", "timestamp": "2023-04-25 12:09:24 CEST+0200", "meta": {"description": "", "lang": "de", "keywords": "", "favicon": "", "canonical": "http://askingangels.com/articles/spiritual/who-is-st-germain.php", "encoding": null}, "image": null, "domain": "askingangels.com", "title": "MEET SAINT GERMAIN, A Favourite Master Of Mine", "cleaned_text": "Meet Saint Germain - Lord Of The Violet Ray\n\n\n\n, who is also the Lord Of the Seventh Spiritual Ray - the violet ray. He has had many incarnations upon the Earth plane, including but not limited to Merlin, Shakespeare/Sir Francis Bacon, Christopher Columbus, and of course, The Count Of St Germain (1710-1784).\n\nHe attained his ascension out of physical form during this last lifetime, but was granted permission to remain upon Earth for the purpose of aiding humanity. This is why the Count appeared to never age, over a few hundred years, and lived an extraordinary amount of time, beyond where he appeared to die.He traveled and aided governments in several countinents. He is credited as the sponsor of the Unitied States Of America. He is also accredited with being an alchemist, wherein true alchemy is the science of ascension out of matter.Some claim he mysteriously became an Ascended Master, but the truth of course is that he was the incarnation of a master. He incarnated into flesh and then ascended back to his true state. Being an enlightened being walking the Earth, a kind of 'avatar', he had abilities to manipulate nature and create out of thin air using what we term alchemy. He was said to be quite flamboyant, and created jewels using alchemy which he wore, being covered in rubies or other stones. With the fashions of those times, we can only imagine how flamboyant he appeared.His twin flame is the ascended lady master Portia.Most importantly, he is the Heirarch of The Age Of Aquarius, which is the next astrological age we are now entering into, the age of freedom. This age is governed by the Seventh (Violet) Ray - or the ray of freedom and transformation. He is replacing the Heirarch of The Picean Age, Master Jesus, who was heirarch of the current age for the past 2000 years.The violet flame has been gifted to us by St Germain. We can call on him personally to come to us to help use the powerful, transmuting flame to raise our vibration and transform the lower energies trapped in our body and energy field. We can do this by using either meditation and visualisation , or through speaking mantras . A mantra is a kind of affirmation using intent and words that focus our energies and send out our intent to the universe. We can call upon the flame for protection as well, since it will increase our vibration, thus protecting us from negative energies.This simple mantra is from Saint Germain and can be used to invoke the violet fire of purification to cleanse your body and aura.\n\nThis article is copyright of AskingAngels.com. The first 200 words only may be shared as long as they are unaltered and proper credit is given to the website with this link www.askingangels.com included. The full article may not be copied or reproduced without express written permission from the copyright holder.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/articles/angels/ascendedmasters.php", "/articles/spiritual/twin-flame-love.php", "/articles/spiritual/violet-meditation.php", "/articles/spiritual/violet-mantras.php", "http://www.askingangels.com", "/spirit/portal-of-light-activation.php", "/healing/health/the-nuremberg-trials.php", "/articles/angels/incarnated-angels.php", "/articles/spiritual/twin-flame-love.php", "/articles/starseeds/negative-ets.php", "/articles/angels/ascendedmasters.php", "/psychic/numbers/what-are-angel-numbers.php", "/healing/healer-signs.php", "/articles/spiritual/soulmates-types.php", "/psychic/cutcords.php", "/articles/spiritual/ascension-symptoms.php", "/psychic/signs/feather-angel-sign.php", "/psychic/signs/butterfly-angel-sign.php", "/psychic/signs/rose-scent.php", "/psychic/signs/angel-wings-meaning.php", "/articles/angels/askformoney.php", "/psychic/energy-vampire.php", "/articles/interpreting-signs.php", "/psychic/areyoupsychic.php", "/psychic/four-clairs.php", "/articles/spiritual/spiritual-awakening.php", "/psychic/empath-signs.php", "/articles/spiritual/twin-flame-telepathy.php", "/healing/kundalini-awakening.php", "/psychic/spiritual-grounding.php", "/articles/starseeds/starseed.php", "/psychic/protection.php", "/articles/spiritual/lightworker-missions.php", "/articles/angels/names.php", "/articles/spiritual/twin-flame-meetings.php", "/articles/spiritual/twin-flame-separation.php", "/articles/spiritual/soulmates-signs.php", "/articles/spiritual/lightworker-traits.php", "/spirit/meditations/love-meditation.php", "/healing/earth/incarnated-elementals.php", "http://askingangels.com/articles.php"], "authors": [], "publish_date": null}