{"result_id": "038038", "URL": "http://askingangels.com/articles/spiritual/lightworker-traits.php", "timestamp": "2023-04-25 12:09:43 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://askingangels.com/articles/spiritual/lightworker-traits.php", "encoding": null}, "image": null, "domain": "askingangels.com", "title": "14 LIGHTWORKER TRAITS | Characteristics, Symptoms, Physical", "cleaned_text": "A lightworker can be any age, faith, or culture and even animals can act as lightworkers to help clear the planet from negative energy.\n\nUsually, however, a Lightworker is an evolved soul who has incarnated on earth for a specific mission or purpose that is spiritual or helps the earth in some way.\n\n\n\n1 You Are Spiritual Though Not Necessarily Religious\n\n2 Being Psychic Or Sensitive To Your Surrounds\n\n3 Work To Heal Your Own Inner Self\n\n6 Not Doing It To Get Rich\n\n\n\nas long as the service provided gives real and not merely imagined help.\n\n9 Not Fitting In To The World, Being A Loner\n\n\n\nLightworkers usually work with the angels (whether they are aware of it or not) and can include any person who is working towards the good of the Earth, her people, animals, plant life and environment. They usually have a strong sense of purpose and drive to better the conditions on this world, noticing conditions that are unbalanced and need help. They could work with the homeless, abused children, plant trees on the weekend, heal with alternative medicine, be a doctor, an inventor, or a politician who sticks up for people's rights.Some people get stuck on the term Lightworker, considering it a label - yet everyone on the earth is a potential lightworker. Some lightworkers are awake and consciously aware of their reason for being here, whilst others are considered asleep, or unaware of any potential Lightwork they may be able to perform. We were all asleep at some point before we awakened to our spiritual nature. Lightworkers acknowledge God and all of God's kingdoms, including angels, and merely work with them to the best of their own ability.All lightworkers serve Love, which comes naturally to them. They are usually giving in nature, empathic, and like to help others or better themselves and the world. This is the true meaning of spirituality. Some may be religious but many are not affiliated with any earthly form of religion, preferring to follow their own faith in the divine. To serve Creator as a lightworker does not mean to adhere to any religion. Religions come from man - the best place to find the Almighty is in your own heart.Not all lightworkers are clairvoyants. Many of the first lightworkers to awaken were the clairvoyant or psychic ones, who began by channeling or reading channelled information. Most conscious lightworkers have an interest in communication with their angels, guides or masters, so many go on to learn how to improve their intuition or psychic sensitivity. They may learn how to channel, or how to hear their guide's messages through meditation, or a number of other ways.As innate healers (of the mind, body or soul), we learn that we must healfirst before we can heal others or the earth. Therefore, lightworkers almost always work on their own issues and continue to rise above what they were previously. Whilst those who still slumber rarely work on their issues and \"stuff\", lightworkers actively strive to evolve into a higher version of themselves. They have come to understand that harmony is the only way forward that works, and they act to be vessels of Love before all else. They hold themselves to high standards, like those of the angels and masters, knowing that any of us can be as the angels are and radiate pure love and healing. We all have our \"stuff\" and that is accepted. The lightworkers endlessly strive to heal their stuff, thus uplifting the planet and all on it.Whilst a good many lightworkers are old souls, not all of them are. You can have a young soul and an amazing heart, and be used by angels to help others. Whenever we are impulsed to do something good, it either comes from our own heart or from the angels. Once a person starts to help others, the angels notice and begin to work with them from the other side, sending them extra help so they can reach even further. You don't have to be an old soul to do God's work, and God is not fussy as to your soul age.We tend to be born and raised into the usual, unawakened system of thought, whereby God/angels are an after thought or downright denied. We may receive snide remarks if we do or say anything outside of the system or matrix of false thought. So when we spiritually awaken, it is a big deal. It happens quickly and we are lead on a quest to learn all we can about spirituality, angels, psychic phenomena, God or other religions. Some people awaken to the possibility of extraterrestrial phenomena and it soon leads them to a more spiritual place. You will have had some kind of awakening and begun to think for yourself, exiting the dark matrix where we are bullied into non belief of the spiritual.There are people on this world who do things to help others but do not gain anything for themselves, unless that be joy, satisfaction and positive karma. True lightworkers are about genuinely helping the earth, whilst the more false kind are primarily about profit, sales, or attention and reputation. There is nothing wrong with making a living through doing lightwork,Real lightwork is done from the heart and payment will be modest, with real value for money offered.Those who work in service to the divine who are the helpers of angels are more humble in general and do not seek to show off their work. They are the unsung heros, most of them, and you will never hear about their good deeds in the media. Rather, the media focuses on celebrities who further their own career, rather than on those who working quietly to uplift the lives of others. This mediafocus helps to keep the dark matrix of worshiping idols in place, and removing attention from those who are bringing in change and light to the world.Although many lightworkers are gentle and loving in nature, they have often been chosen for their mission by angels because of their special braveness for what can sometimes be a difficult task at hand. Lightworkers can see through the dark and know what needs to be changed. Therefore, setbacks do not deter them easily. Once they have awakened, they often become fearless for the light and work tirelessly. They have reserves of strength and have the Light on their side. They know that even if they fail, and they rarely do, that others will complete what they have started. Many have had difficult lives starting in childhood, which has formed them into warriors. They know what it takes to get a project off the ground and do not care to listen to negativity from others who would prevent them.It is kind of a given that lightworkers, due to their spiritual nature, do not fit as easily into this world of ego, negativity, hostility, fear and slavery for money. They know there is a better way. Although the world is filled with lightworkers, they are outnumbered many times over. Many lightworkers failed to awaken, resulting in a lot less awakened ones than planned. Current lightworkers take on more work than they ever planned to. Many who did not awaken, work to keep the status quo with corporations running the world and financial mafia using debt slavery to take over law-making. Many who could do better are actually leaning towards the dark ways and tend to protect them. Some lightworkers have fallen, having been tempted by money or power. Those who remain true often do not fit in, finding many traditions of the world pointless, dark or downright irrational. They can be loners if they do not find other lightworkers of a similar nature to themself.Lightworkers see nature and animals, in fact all creatures, as sacred; they are born this way. They have a reverence for life that is inbuilt, and would never consciously harm another living creature, except maybe in self defense. Lightworkers would never normally fight or willingly engage in battle as most of them abhor violence. Many, many lightworkers fight against animal cruelty and the destruction of the natural world. They believe in total respect for all living things which they consider have the same rights as humans and deserve to live peacefully on this planet alongside us.As the term \"lightworker\" suggests, they are souls full of light and who can spread that light wherever they go, if they so choose. They do this unconsciously as well, for they generally have a larger auric field and, depending on how developed they are, it is full of light and higher energy (which comes from their chakras like the heart chakra). This light can naturally transform or transmute lower energies in the earth's auric field. Lightworkers can naturally bring a peaceful feeling at gatherings or wherever they go, even if they are unaware that they are doing so. Positive energy is much more powerful than negative energy, so they are a bit like the purifiers of the earths auric field and they help to ground or anchor higher energy that reaches the planet through the sun portal.Lightworkers, after awakening, begin to gravitate towards others who have similar views and interests. They find one or more lightworker communities where they can discuss everything related to their awakening and their new found spirituality. These communities can vary in their quality of light. Some communities can be full of competition, jousting and in-fighting. The most common problem facing a lightworker is to fall into pride or feeling they are better than other lightworkers. Shop around for the best community to learn about other lightworkers. Some people find a place that feels like home (either online or elsewhere) and can stay for years, making all kinds of new friends. Some lightworkers steer clear of communities and make their way in the old system/matrix and trying to slowly change it from within. It is more lonely to do things this way, and also more hostile, as those who are unawakened can fearfully attack any ideas they are not used to.Lightworkers may also feel a connection to the stars, or feel they have incarnated on Earth but come from far away origins in the universe. See a full list of starseed signs Walk-Ins are souls who do not go through birth or childhood, but who are part of a predetermined soul exchange and \"walk into\" the body of another who is dying, and who is planning to leave the earth plane. Many lightworkers consider themselves to be walk-ins, although most do not. Check out the Signs of Being a Walk-In There are no special physical traits when you are a lightworker, and lightworkers do not all look the same, or dress the same. Being a lightworker is more about a calling, or a mission in life, and lightworkers can be as different in body as can be.See 10 more Signs of Being a Lightworker\n\nThis article is copyright of AskingAngels.com. The first 200 words only may be shared as long as they are unaltered and proper credit is given to the website with this link www.askingangels.com included. The full article may not be copied or reproduced without express written permission from the copyright holder.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/articles/starseeds/starseed.php", "/articles/spiritual/walk-ins.php", "/articles/spiritual/lightworker-signs.php", "http://www.askingangels.com", "/spirit/portal-of-light-activation.php", "/healing/health/the-nuremberg-trials.php", "/articles/angels/incarnated-angels.php", "/articles/spiritual/twin-flame-love.php", "/articles/starseeds/negative-ets.php", "/articles/angels/ascendedmasters.php", "/psychic/numbers/what-are-angel-numbers.php", "/healing/healer-signs.php", "/articles/spiritual/soulmates-types.php", "/psychic/cutcords.php", "/articles/spiritual/ascension-symptoms.php", "/psychic/signs/feather-angel-sign.php", "/psychic/signs/butterfly-angel-sign.php", "/psychic/signs/rose-scent.php", "/psychic/signs/angel-wings-meaning.php", "/articles/angels/askformoney.php", "/psychic/energy-vampire.php", "/articles/interpreting-signs.php", "/psychic/areyoupsychic.php", "/psychic/four-clairs.php", "/articles/spiritual/spiritual-awakening.php", "/psychic/empath-signs.php", "/articles/spiritual/twin-flame-telepathy.php", "/healing/kundalini-awakening.php", "/psychic/spiritual-grounding.php", "/articles/starseeds/starseed.php", "/psychic/protection.php", "/articles/spiritual/lightworker-missions.php", "/articles/angels/names.php", "/articles/spiritual/twin-flame-meetings.php", "/articles/spiritual/twin-flame-separation.php", "/articles/spiritual/soulmates-signs.php", "/articles/spiritual/lightworker-traits.php", "/spirit/meditations/love-meditation.php", "/healing/earth/incarnated-elementals.php", "http://askingangels.com/articles.php"], "authors": [], "publish_date": null}