{"result_id": "038051", "URL": "http://askingangels.com/articles/starseeds/omicron.php", "timestamp": "2023-04-25 12:09:50 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://askingangels.com/articles/starseeds/omicron.php", "encoding": null}, "image": null, "domain": "askingangels.com", "title": "OMICRON Is A Reptilian Draconian Alien Underneath The Earth", "cleaned_text": "The \"Omicron\" Reptilian is a type of Reptilian Draconian Alien they found recently hiding below in an underground DUMB underneath South Africa. (Like all the other reptilians they have so far removed). They have been down there for thousands of years running our Earth. The Earth is not run by these evil \"men\" like Soros - no, he is just a puppet taking orders from the reptoids. This has been, not just WW3, but an Interstellar War that\n\nWho knows what they look like but often television shows, like cartoons for example, report on facts that nobody would believe and they just get away with it. There are massive amounts of truth in the Simpsons, and this from Futurama, which people just imagine is fantasy. These are some very dark television shows.The White Hats found these when it came time to destroy the oldest DUMB (Deep Underground Military Base) which is a massive and ancient structure going deep into the earth. It is the biggest apparently of the Earth Dumbs. Now we have our friendly galactic forces (Galactic Federation) going in and destroying and removing the lizards. They no doubt will face Galactic Court.It is the White Hats who barred people from leaving South Africa, so as they could close the net around this area and carry out their work on this DUMB. It was not, as the media is reporting, a new variant. There may already have been a variant they are now naming Omicron, an extremely mild variant, and they are using this to create new mandate rules the world over. By the way, these so-called \"mandates\" are not Laws. You don't have to follow them. It's all a load of crap.I will continue on with the relevant youtube data I found today. No name was given with this and they are typically deleted just days later. It is revealing stuff!The White Hats have dismantled CERN (woohoo!)The New World advocates completed the capital of Kazakhstan in 2019 known as Astana, the Illuminati headquarters for Harvesting Children. CIA Headquarters which funded the Illuminati out of US Taxpayer dollars was located beneath Lake Geneva, Switzerland and was only accessible via underground trains, and submarines which traveled through a 275 kilometer subterranean tunnel beginning in Geneva, Italy, and ending in Lake Geneva.Under Orders from the Illuminati Epstein worked for many governments including the Israeli Mossad. Epstein Island was a blackmail headquarters controlled by special services. The Cabal benefited from the Satan worshiping island because they could control and manipulate politicians.Celebrities at Trump's first term in office burn the bridge that we might take to return to the way things used to be. This country and indeed the world will never go back to the world the way things used to be (thank God). The future that lies before us is either a dark and miserable prison or a bright and glorious awakening. The one we experience will be determined by us. Remember, Hillary Clinton was the red line. America was on the verge of being destroyed in 2016 and here we stand again in 2021 seemingly back where we started. Yet we aren't. The amount of progress we've made in the Great Awakening is far more significant than people think. We've never seen anything like this and here's the kicker. We just getting started. You aren't alone. It's never been easier to show someone the truth about the world than it is now. Babylon is exposed for the world to see and you can't put this awakening back in a box. Apocalypse literally means unveiling. The world is Red Pilled and there's no going back. I can affirm that there are many more awake than people think. Some have been quietly watching the Red Pill fiesta that is 2020-21. Soaking it all in and going about there business with new eyes. I talked to a man the other day and he didn't know who I was on the internet and he told me this entire thing with the infinite booster shots was insane.Military in charge since November 3. Trump sworn in as President of Republic November 27 2021. Alliance of 17 Elite Global forces. Crypto markets crash.The movie Borat was a Psyop designed by phoenecians to make you think Kazakhstan was just goat farmers. Why? Because the brand new capital of Kazakhstan completed in 2019 was Astana (anagram of Satan) where they havested children. This was to be the headquarters of the NWO (New World Order). Their plan was C-19, vax, 5G, fall of America and NWO Astana. Switzerland is harboring the CIA. CERN actually serves as the secret entrance to CIA Headquarters which is located in the underwater Alpine canyons of lake Geneva. A lake so deep it had to be explored by Mere 1 and 2.David Rockefeller was in Epstein's black book. Epstein served on the board of the Rockefeller foundation. Both served on the Trilateral Commission.\n\nThis article is copyright of AskingAngels.com. The first 200 words only may be shared as long as they are unaltered and proper credit is given to the website with this link www.askingangels.com included. The full article may not be copied or reproduced without express written permission from the copyright holder.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/articles/starseeds/chimera-spiders.php", "http://www.askingangels.com", "/spirit/portal-of-light-activation.php", "/healing/health/the-nuremberg-trials.php", "/articles/angels/incarnated-angels.php", "/articles/spiritual/twin-flame-love.php", "/articles/starseeds/negative-ets.php", "/articles/angels/ascendedmasters.php", "/psychic/numbers/what-are-angel-numbers.php", "/healing/healer-signs.php", "/articles/spiritual/soulmates-types.php", "/psychic/cutcords.php", "/articles/spiritual/ascension-symptoms.php", "/psychic/signs/feather-angel-sign.php", "/psychic/signs/butterfly-angel-sign.php", "/psychic/signs/rose-scent.php", "/psychic/signs/angel-wings-meaning.php", "/articles/angels/askformoney.php", "/psychic/energy-vampire.php", "/articles/interpreting-signs.php", "/psychic/areyoupsychic.php", "/psychic/four-clairs.php", "/articles/spiritual/spiritual-awakening.php", "/psychic/empath-signs.php", "/articles/spiritual/twin-flame-telepathy.php", "/healing/kundalini-awakening.php", "/psychic/spiritual-grounding.php", "/articles/starseeds/starseed.php", "/psychic/protection.php", "/articles/spiritual/lightworker-missions.php", "/articles/angels/names.php", "/articles/spiritual/twin-flame-meetings.php", "/articles/spiritual/twin-flame-separation.php", "/articles/spiritual/soulmates-signs.php", "/articles/spiritual/lightworker-traits.php", "/spirit/meditations/love-meditation.php", "/healing/earth/incarnated-elementals.php", "http://askingangels.com/articles.php"], "authors": [], "publish_date": null}