{"result_id": "038039", "URL": "http://askingangels.com/reviews/life-purpose-oracle.php", "timestamp": "2023-04-25 12:09:43 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://askingangels.com/reviews/life-purpose-oracle.php", "encoding": null}, "image": null, "domain": "askingangels.com", "title": "Life Purpose Oracle Cards by Doreen Virtue - A Review by a Psychic", "cleaned_text": "How Do The Cards Work?\n\nI was very excited to receive these cards in the post recently. They are my third deck of cards by Doreen Virtue (I have a feeling I will be buying a few more), and are a very unique deck. The subject of Life Purpose fascinates me and I knew I had to own these cards as soon as I discovered them. Although a lot of her oracle decks are similar with countless messages from angels, and many of her cards feature dolphins and unicorns - this deck features humans (you and I), although each human has beautiful angel wings, making for truly stunning artwork.As the name suggests, each card deals with the subject of Life Purpose. Is there any other subject that can be more confusing to us as we navigate our way through life? Each of the 44 cards carries a message about life purpose, ie Music, Artist, Children, Writing, Healer etc. The corresponding booklet contains an extra message for each card that is about 3 short paragraphs long. It is well worth reading this booklet carefully to receive the full guidance from the cards you draw.More than any other deck I have owned so far, these cards feel so healing to me. Just touching and holding the deck is nurturing and calming. The predominate colour of this deck is a healing shade of green that soothes and relaxes the soul. Each card is thick, glossy and large; they are gilded in gold for that extra special touch. The artwork is stunning and I adore the pictures, more so than Doreen's 'Romance Angels Oracle' deck, which is also superb. I know I will get many happy hours out of these cards. Being a working psychic, I am lucky in that I use each of my decks extensively and can then experience their healing energy on many ocassions. Life Purpose cards are a must have for any psychic reader and will pay for themselves.Perhaps the only downfall is this - I have heard one person comment that after she had read for herself, she had no idea what more she could do with the cards. This is a fair comment since a reading will last you at least 6 months, maybe several years, meaning you may not use the cards often. But if you enjoy reading for your family and friends, then you will get the use out of them that they are designed for. Whilst some people find the cards too big to shuffle, I have never experienced this since you can always shuffle longways instead of sideways just as easily.The only card I can honestly can I don't particularly resonate with is the \"Protector\" who I think looks like a dark, sworded being all in black.The first reading I did for myself was extremely accurate! By drawing out three cards, you get a quick past, present and future spread. I drew the card \"Builder\" for my past with a picture of a sexy, shirtless man holding a hammer bathed in sunlight. It surprised me until I read the accompanying message and I realised that I am in fact a 'website' builder and quite passionate about it. I have written all the code for my websites, designed them and most of the content is also written by me. This card describes me exactly since it also covers building up business enterprises, something else that interests me.My second card, in the present position, was \"Energy Worker\". I am indeed waiting to start a course learning Reiki. I've wanted to do this for over a decade and have been guided to this, even though I don't know why - I just know I passionately want to learn Reiki. This card confirms that I am making the right choices for right now. I am also currently studying massage therapy so that also ties in.My future card is very interesting because it hasn't happened yet; I drew out the \"Leadership\" card. Of course, I don't yet know what this is talking about but it has me very interested. Perhaps in 6 or 12 months I'll do another reading for myself but in the meantime, I can't wait to start using these cards to help others! A clear five out of five stars for these beautiful cards.Like all oracle cards, your angels and spirit guides direct you to the right card. Simply shuffle whilst thinking about your life purpse, then choose a card. Personally I always cut the deck and use the card with the picture facing. Others shuffle and take the card on the top of the deck.I have found ordering the cards online to be a very good way to get the best deal. I use an auction website but you could use Amazon. Amazon is also an amazing place to read reviews before purchasing to make sure the cards are exactly the right fit for you. With so many decks around, and using a deck that suits your personal taste being important, you want to do some research first. Always buy brand new when it comes to oracle and tarot cards.If you would like me to draw 3 cards from Doreen'sdeck, you can go to my store to purchase a reading. This is a great option if you don't want to own the cards but would like to see what cards you get. Or you could use the reading to find out your child's Life Purpose or that of another person. Readings start from AU$6.\n\nThis article is copyright of AskingAngels.com. The first 200 words only may be shared as long as they are unaltered and proper credit is given to the website with this link www.askingangels.com included. The full article may not be copied or reproduced without express written permission from the copyright holder.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/jewellery/", "http://www.askingangels.com", "/spirit/portal-of-light-activation.php", "/healing/health/the-nuremberg-trials.php", "/articles/angels/incarnated-angels.php", "/articles/spiritual/twin-flame-love.php", "/articles/starseeds/negative-ets.php", "/articles/angels/ascendedmasters.php", "/psychic/numbers/what-are-angel-numbers.php", "/healing/healer-signs.php", "/articles/spiritual/soulmates-types.php", "/psychic/cutcords.php", "/articles/spiritual/ascension-symptoms.php", "/psychic/signs/feather-angel-sign.php", "/psychic/signs/butterfly-angel-sign.php", "/psychic/signs/rose-scent.php", "/psychic/signs/angel-wings-meaning.php", "/articles/angels/askformoney.php", "/psychic/energy-vampire.php", "/articles/interpreting-signs.php", "/psychic/areyoupsychic.php", "/psychic/four-clairs.php", "/articles/spiritual/spiritual-awakening.php", "/psychic/empath-signs.php", "/articles/spiritual/twin-flame-telepathy.php", "/healing/kundalini-awakening.php", "/psychic/spiritual-grounding.php", "/articles/starseeds/starseed.php", "/psychic/protection.php", "/articles/spiritual/lightworker-missions.php", "/articles/angels/names.php", "/articles/spiritual/twin-flame-meetings.php", "/articles/spiritual/twin-flame-separation.php", "/articles/spiritual/soulmates-signs.php", "/articles/spiritual/lightworker-traits.php", "/spirit/meditations/love-meditation.php", "/healing/earth/incarnated-elementals.php", "http://askingangels.com/articles.php"], "authors": [], "publish_date": null}