{"result_id": "038009", "URL": "http://askingangels.com/articles/starseeds/orions.php", "timestamp": "2023-04-25 12:09:27 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://askingangels.com/articles/starseeds/orions.php", "encoding": null}, "image": null, "domain": "askingangels.com", "title": "ORION STARSEEDS 5 Characteristics | Human Alien Race", "cleaned_text": "Are You An Orion Starseed?\n\n\n\nBoth positive and negative races originating in Orion live currently on Earth. The Orion Constellation is fascinating and dominates our skies often drawing our eyes as we gaze at the figure of Orion. Orion humans, but also reptilian races who are ancient, exist there.\n\nto allow for this variety\n\nThis article is dedicated to the starseeds living on earth who originated from Orion and there are a few of you! Most starseeds, including Pleiadian, Andromedan, etc, have spent some lifetimes in the Orion constellation, but those who lived there the longest have the Orion traits and characteristics that are discussed below.We begin by discussing thetype Orions, those who traveled and settled in this constellation from Sirius/Vega, where mankind originated. If you have these traits in abundance, you may be an Orion Starseed.These starseeds are characterised by being in their mind most if not all of the time, for they are extremely mentally polarised. They view the world through the medium of the mind more so than emotions, and require to see proof and evidence of something before believing in it.Perhaps, Orion, what you haven't realised in your spiritual search is that proof often comes from the heart, from your feeling nature. You are quite expert at logical thinking and reasoning with the mind, but did you realise it can distract you fromthrough life? We know you may not be a soft creature of the heart, but you do have a fully functioning heart and it works perfectly fine to provide intuitive information from your Higher Self.Orions have many beliefs and opinions, and you often try to get others to validate your beliefs by coming along with you in the way you think. Does this sound familiar? Yet we all think differently, and this may just confound you! How do people believe in this, that and the other when you believe it is just daydreaming or fantasy. Even when things are spelled out clearly to others, how do they end up with a totally different view? People confound you.You spend a lot of time trying to figure out others logically and you try endlessly to understand why they are that way. The reason is because we aren't all from Orion like you. There is variety in the universe and people have amazing views, no less amazing than yours. Your lesson with a capital 'L' is. You know that variety is the spice of life. You are very ordered, especially in your thinking, but not all beings are like that, are we?You like knowledge, you covert it, and in many ways you rely on it, loving the comfort that it provides. Let's face it, it makes you feel comfy and confident, especially when you can prove what you are talking about. You want to win your conversations, impressing others and swaying them to your way. You like to learn, for fun, and you enjoy knowing things, all manner of things. Your interests run deeply.Sometimes you wonder why others do not share this thirst for knowledge, for surely knowledge is Everything. Maybe, or maybe not. There are all kinds of paths that lead to enlightenment, knowledge is one of those paths, but there are other ways too.The trap of the mind, of course, is Judgment and you know this. Our mental side can become very critical of ourself and others. Of course, you judge yourself as much as you may secretly judge others. This is such a burden however, the quirk of. What you can realise is that God doesn't judge, and you can lift that heavy burden off yourself at any time. The only one that told you to carry it was probably you in the first place. I know because I used to be mentally polarised too, before I decided to use my heart more and focus on God.Are you prickly in relationships, too intellectual and tired of others who react all emotionally? Maybe you see 'emotion' as a dirty word, or a weakness, or a trap. Admittedly you love balance, and emotions often get others out of balance or out of whack, which is sometimes all too true. Humans are emotional beings and you're an Orion, a little too mental and unemotional. But you DO have them, don't you? However, you like to scrutinize those feelings and try to analyse them, then write them off or deny them if they seem nonsensical.A clue to emotions is that they follow our 'attachments', so that any time someone is over emotional, it simply points to what they areto. When it looks to someone that they might lose this attachment, they react emotionally; it helps to let it (the attachment) go in many ways.As much as you pretend not to fall into that trap, of course you do. You like to deny it however, most of the time.You are curious, with a burning need to understand what is around you, so you ask a lot of questions. You only want to learn more, investigate or dig deeper.You, Orion, are also a person who needs your alone time in order to recharge. This also means that you're sensitive. You need your 'you' time, and time away from the seemingly madness of others, because we know we drive you crazy. Sadly for you, there isn't much order in this world, which is full of foolish things, so you have to take time alone to recover and get your strength back. You're not much for hanging out in big crowds, or over socialising.You also have a great sense of humour, so you aren't stuck in your mind completely - here is the proof. You are so alive, so typically human when you're being funny and making the crowd laugh. We don't all have that ability but this is a strength for you. You are clever and are good at making jokes. The world is a comical place and you know this. Your friends appreciate this side of you and when you feel good, you can share this side.Many of the Orions are human and these are the ones we're discussing today, but they are not restricted to this. The Orion constellation also hosts the negative Reptoid races, who have an Empire spanning six planets there including Bellatrix. This is the reptoid home base if you like, yet like humans they also span the galaxy - but not to make friends but rather to subjugate, control, enslave and destroy. They are beings of manipulation who have power over the Greys (who live near Orion in Zeta Reticuli).Some of the human Orions may have, as starseeds, very blue eyes. It is said that the spiritual ones such as the priests gained this feature from their spiritual path. I'm not sure why this is so, although I've heard that many angels also have blue eyes. It's reminiscient of the novel Dune wherein the humans native to Dune would develop blue in blue eyes from the spice. If you see a starseed with vivid blue eyes, they may be Orion.It's also said that many Greys, of Zeta Reticuli origins, have become stuck on earth reincarnating as human, due to their karma and interference with earth inhabitants. They are not necessarily friendly and have deliberately traumatised many humans. Their interference here was not allowed in a galactic sense, so many of them have become us, living here stuck karmically. They may lack certain emotion since Greys are not known for showing emotion. Many of their bases beneath the earth have now recently been destroyed since they are not welcome here.In closing, it's hard to understand how both humans and reptoids can co-exist in the same system of Orion, since reptoids are hell bent on eradicating or controlling humans, whom they view as disposable and inferior. Reptoid religion is diametrically opposed to all other races in the universe, whom they hate. Orion humans must be equipped with superior technology to keep the aggressive reptoids at bay, or at least away from their own worlds in order to survive there.The negative reptoids are not from this universe and escaped into our universe (without permission) after destroying their own. Can you imagine bringing an entire universe into darkness and destroying it? After coming into this one it was deemed by the God of this universe that they be allowed to continue on with their unique path of darkness (called the Grand Experiment) to see what would occur. Would light or darkness prevail? Darkness is ever trying to trick the rest of us and tempt us grandly to come over to its side. This is what earth has been all about.It is nice to know that on this timeline, God is now winding up this grand experiment and allowing us to evolve naturally in the light, as we were meant to, without dark interference. The darkness is no longer in control and is gradually leaving this world. Light and reason are now returning. I'm very thankful for this decision and slowly, we shall witness things start to go right. One example is North Korea, which has finally been freed of the ruling cabal. Things are going to start to become more sane on earth. Hallelujah.\n\nMore Starseed Articles \n\n Are You A Starseed?\n\n Sirian\n\n Pleiadian\n\n Arcturian\n\n Andromedan\n\n Lyran & Vegan\n\n Orion\n\n Feline\n\n Avian\n\n Reptilian\n\n Negative ETs - Full Disclosure\n\n The AI Controller - The Eye Atop The Pyramid\n\nThis article is copyright of AskingAngels.com. The first 200 words only may be shared as long as they are unaltered and proper credit is given to the website with this link www.askingangels.com included. The full article may not be copied or reproduced without express written permission from the copyright holder.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/articles/starseeds/starseed.php", "/articles/starseeds/sirians.php", "/articles/starseeds/pleiadians.php", "/articles/starseeds/arcturians.php", "/articles/starseeds/andromedans.php", "/articles/starseeds/lyran-vegan-starseeds.php", "/articles/starseeds/orions.php", "/articles/starseeds/felines.php", "/articles/starseeds/avians.php", "/articles/starseeds/reptilians.php", "/articles/starseeds/negative-ets.php", "/articles/starseeds/ai-controller.php", "http://www.askingangels.com", "/spirit/portal-of-light-activation.php", "/healing/health/the-nuremberg-trials.php", "/articles/angels/incarnated-angels.php", "/articles/spiritual/twin-flame-love.php", "/articles/starseeds/negative-ets.php", "/articles/angels/ascendedmasters.php", "/psychic/numbers/what-are-angel-numbers.php", "/healing/healer-signs.php", "/articles/spiritual/soulmates-types.php", "/psychic/cutcords.php", "/articles/spiritual/ascension-symptoms.php", "/psychic/signs/feather-angel-sign.php", "/psychic/signs/butterfly-angel-sign.php", "/psychic/signs/rose-scent.php", "/psychic/signs/angel-wings-meaning.php", "/articles/angels/askformoney.php", "/psychic/energy-vampire.php", "/articles/interpreting-signs.php", "/psychic/areyoupsychic.php", "/psychic/four-clairs.php", "/articles/spiritual/spiritual-awakening.php", "/psychic/empath-signs.php", "/articles/spiritual/twin-flame-telepathy.php", "/healing/kundalini-awakening.php", "/psychic/spiritual-grounding.php", "/articles/starseeds/starseed.php", "/psychic/protection.php", "/articles/spiritual/lightworker-missions.php", "/articles/angels/names.php", "/articles/spiritual/twin-flame-meetings.php", "/articles/spiritual/twin-flame-separation.php", "/articles/spiritual/soulmates-signs.php", "/articles/spiritual/lightworker-traits.php", "/spirit/meditations/love-meditation.php", "/healing/earth/incarnated-elementals.php", "http://askingangels.com/articles.php"], "authors": [], "publish_date": null}