{"result_id": "038026", "URL": "http://askingangels.com/articles/spiritual/violet-mantras.php", "timestamp": "2023-04-25 12:09:37 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://askingangels.com/articles/spiritual/violet-mantras.php", "encoding": null}, "image": null, "domain": "askingangels.com", "title": "VIOLET FIRE Mantras, Affirmations, Decrees & Chants", "cleaned_text": "The violet flame is renowned for its ability to protect and uplift us, yet we must first invoke it by using either\n\n\n\n I AM the Violet Flame in action in me now! \n\n I AM the Violet Flame to light alone I bow \n\n I AM the Violet Flame in mighty cosmic power \n\n \n\n I AM the Light of God shining every hour \n\n I AM the Violet Flame blazing like a Sun \n\n \n\n \n\n Radiant violet flame, O come\n\n Expand and blaze thy light through me!\n\n Radiant violet flame, O come\n\n Reveal God's power for all to see!\n\n Radiant violet flame, O come\n\n Awake the earth and set it free! Radiance of the violet flame\n\n Expand and blaze through me!\n\n Radiance of the violet flame\n\n Expand for all to see!\n\n Radiance of the violet flame\n\n Establish Mercy's outpost here\n\n Radiance of the violet flame\n\n Come, transmute now all fear! \n\n I AM Forgiveness acting here\n\n Casting out all doubt and fear \n\n \n\n \n\n \n\n \n\n \n\n To all life in every place \n\n Breath of God inside each cell\n\n I am the violet flame\n\n Pulsing out the cosmic time\n\n I am the violet flame\n\n Energizing heart and mind\n\n I am the violet flame\n\n Sustaining God's creation now\n\n I am the violet flame\n\n With all love (x3)\n\n \n\n Shimmering in a crystal cave\n\n I am the violet flame\n\n Searching out all hidden pain\n\n I am the violet flame\n\n \n\n Consuming cause and core of fear\n\n I am the violet flame\n\n Revealing now the inner name\n\n I am the violet flame Flashing like a lightning bolt\n\n I am the violet flame\n\n Stretching through the galaxies\n\n I am the violet flame Connecting soul and Spirit now\n\n I am the violet flame\n\n Raising you to cosmic heights\n\n I am the violet flame \n\n\n\nWhere Does The Violet Flame Come From?\n\nA mantra is a kind of affirmation using powerful words that focus our energies and send out our intent to the universe. It is not difficult in any way to use mantras as, unlike a prayer, they are much shorter and are usually repeated a few times or even chanted. An invocation or decree is basically the same, although they can be longer and are less likely to be chanted.Remember the violet flame can also be used for protection. When we infuse our aura with the violet flame through the use of mantras or meditation, its high frequencies remain in our aura so the protection lasts for hours.The violet flame, when invoked, is able to transmute negative or misqualified energy stored in our body into high frequency energy. We can heal ourself through using mantras of the violet fire.It is possible to write our own mantras, and they do not have to actually rhyme. Some people prefer the rhythm while they chant them for up to 15 minutes at a time.All the mantras below have been channelled by others, including Mark and Elizabeth Clare Prophet. So enjoy!Absolutely it does work. It is one of the easiest and most powerful tools we can use. Every colour has a vibration and for this reason, different colours have different healing abilities. White light includes all of the colours and is also a powerful tool, yet pure violet is a highly spiritual colour/vibration.By keeping expectations reasonable, then we won't expect too much too soon. I try not to have any expectations at all. If nothing else, it is very satisfying to bathe oneself in this light during a meditation, however most people can really sense the power of this colour. If you cannot sense too much during meditation, or are not accustomed to meditating, then be patient, keep an open mind, and continue to use the flame. Sooner or later you are sure to experience its power.Mantras work when they are said with intent. Saying the words whilst thinking about something else may not have the desired effect. Work out whether you want to work with the flame during meditation or if you prefer mantras. Everyone is different, and some people incorporate mantras during their meditation. There is no right or wrong way to use the flame, so follow your intuition and experiment with this amazing energy.Many people wonder where did this flame come from to begin with. There has always been a violet flame, just as there has always been God/Creator and Spirit. The violet ray is one of the, in fact it is the. When God created the universe, pure God energy was differentiated into seven rays (just as we can take white light and split it into all the rainbow colours through a prism).All of us belong to one of the rays, and each ray has different main qualities. This spiritual science of the rays has been discussed by Alice A Bailey in her channeled books, and others since. One quality of the seventh ray, the violet ray, is Transformation. We have always had the colour violet, and by summoning the flame, we invoke a spiritual light that has existed since the inception of the universe.I have recently learned that some reiki healers have now incorporated the violet flame to remove stubborn blockages in the body. If you do self-reiki or visit a reiki practitioner, why not use this amazing healing energy to improve an already wonderful healing modality!\n\nThis article is copyright of AskingAngels.com. The first 200 words only may be shared as long as they are unaltered and proper credit is given to the website with this link www.askingangels.com included. The full article may not be copied or reproduced without express written permission from the copyright holder.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/articles/spiritual/violet-meditation.php", "http://www.askingangels.com", "/spirit/portal-of-light-activation.php", "/healing/health/the-nuremberg-trials.php", "/articles/angels/incarnated-angels.php", "/articles/spiritual/twin-flame-love.php", "/articles/starseeds/negative-ets.php", "/articles/angels/ascendedmasters.php", "/psychic/numbers/what-are-angel-numbers.php", "/healing/healer-signs.php", "/articles/spiritual/soulmates-types.php", "/psychic/cutcords.php", "/articles/spiritual/ascension-symptoms.php", "/psychic/signs/feather-angel-sign.php", "/psychic/signs/butterfly-angel-sign.php", "/psychic/signs/rose-scent.php", "/psychic/signs/angel-wings-meaning.php", "/articles/angels/askformoney.php", "/psychic/energy-vampire.php", "/articles/interpreting-signs.php", "/psychic/areyoupsychic.php", "/psychic/four-clairs.php", "/articles/spiritual/spiritual-awakening.php", "/psychic/empath-signs.php", "/articles/spiritual/twin-flame-telepathy.php", "/healing/kundalini-awakening.php", "/psychic/spiritual-grounding.php", "/articles/starseeds/starseed.php", "/psychic/protection.php", "/articles/spiritual/lightworker-missions.php", "/articles/angels/names.php", "/articles/spiritual/twin-flame-meetings.php", "/articles/spiritual/twin-flame-separation.php", "/articles/spiritual/soulmates-signs.php", "/articles/spiritual/lightworker-traits.php", "/spirit/meditations/love-meditation.php", "/healing/earth/incarnated-elementals.php", "http://askingangels.com/articles.php"], "authors": [], "publish_date": null}