{"result_id": "038042", "URL": "http://askingangels.com/articles/spiritual/walk-in-stories.php", "timestamp": "2023-04-25 12:09:45 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://askingangels.com/articles/spiritual/walk-in-stories.php", "encoding": null}, "image": null, "domain": "askingangels.com", "title": "WALK-IN STORIES | Real Tales of Soul Exchange & Braiding", "cleaned_text": "There are so many interesting walk in stories from Lightworkers who wish to share. We can learn a lot from other people's experiences. This page contains walk in stories from those who wish to speak of their experiences as a walk in to help spread knowledge about the phenomenon.\n\n\n\n \n\n The \"walk-in\" experience is a form of\n\nwhereby one soul leaves or \"walks out\" of the body, usually during sleep, and another prearranged soul \"walks into\" that body with all of its memories intact.\n\nUpon hearing the word cancer, I went into a type of shock. I moved through the process of diagnosis, surgery and treatments like an automaton. I had a radical mastectomy to the left breast early 2008 and after several months of healing began chemotherapy. I reacted badly to the chemo, spending most of my time throwing up. Instead of being sick to my stomach, every joint in my body hurt profoundly. Finally done with the treatments, I took two to three months to heal, then prepared to have reconstructive surgery. This is when things got weird. \n\n \n\n\n\nDuring all of my treatments I had experienced a mental quietness that was very uncharacteristic for me. My mind went completely silent. I accepted my situation without resistance and found myself ready and willing to move on to the next realm at any time. I was completely at peace. \n\n \n\n The reconstructive surgery lasted for over six hours and I believe that is when my old self left and this new self \"walked in\". Everything was different. I felt totally disconnected with my old life. When I looked at photos of my life before the surgery I was puzzled... I did not recognize myself. My taste in food changed. I became an avid meat eater after being a dedicated vegetarian for twenty years. I felt no connection to my husband, had no interest at all in smoking pot anymore and felt out of place among my friends and in laws. All of this resulted in a divorce, my moving back to my childhood home town and starting a completely new life.\n\n \n\n\n\nI feel like my \"walk in\" is actually a self that walked out when I was around eighteen years old. She left then and now she is back. She left after a heartbreaking experience. When she/me walked back in, she initially thought she/me was still a teenager. I felt like a teenager. I had tons of energy, was youthful in my thinking (which I had not been for many years) and everything about me related to a youthfulness that was not who I had been for many years. When the reality of my life sunk in, that is living a very limited life with a man who was more interested in getting stoned and watching TV than in really living, I experienced a deep sense of loss and depression. I got help and read Byron Katies book, \"Loving What Is\" which helped me tremendously.\n\n \n\n\n\nI had read the Ruth Montgomery books years ago and found them quite interesting, but never imagined that I would one day think of myself in relation to that idea.\n\n \n\n\n\nI have always been a student of spiritual matters. I had out of body experiences, experienced precognitive thoughts, have always been an empath and an intuitive. I have now developed a chronic lung condition as a result of the chemo. I am sixty one years old and don't think I will be in this life for a very long time. In the meantime, I try to be a light, an inspiration to others.\"\n\n\n\nWalk-ins are usually starseeds who have a specific mission to accomplish to help the earth to ascend. As you will see, not all souls actually walk-out, as in the Soul Braided experience, which is thought to be rarer and more challenging than a clear cut walk in.\"I am a braided soul walk-in, no walk out, and an open portal for visitors of the Light. In dream state, I greet those wishing to visit, and I allow or disallow the walk-in. I’ve only disallowed one due to higher frequency that my body could not manage. I also say goodbye to those that have been present for a while. Departed loved ones are allowed spontaneously if a message is needed to the incarnate here. I am able to connect in on soul level to for a soul portrait.\"\"In 2007, I was diagnosed with an aggressive form of fast growing breast cancer. I had always been a healthy person with mostly healthy habits, including being a long term vegetarian. But I did have a drug abuse problem, I smoked pot regularly and was experiencing chronic depression. I had been married for eighteen years when I was diagnosed.\"About 7 years ago I fled my abusive husband with my son who was beginning his freshman year at a university some distance from our home. I had become disabled because of disconnective tissue disease associated with an auto-immune disorder, and Mitral-valve prolapse which occurred as a result of a heart attack 17 years ago.My son who wanted me to be well, saw a poster at his school for a healer, a gazer that was in town, and insisted I go see him. Basically feeling pressured by my son, I went. I didn't expect anything to happen at all, I thought my son was naive. But that event was the catalyst for my life totally changing. I saw and felt energy at that event I had never thought could exist.Over the next several years, my thyroid issue, the uterine problem, the auto-immune disorder, and the MVP have healed. I see little light beings whom I call angels around me at night. I am aware that they have been healing my body and I have had some very precious and beautiful spiritual experiences. I still have some skeletal issues, but those are being healed.During these spiritual experiences, I have been aware of another beautiful light being that has 'joined' with me via my crown chakra. I do consider at this time, as myself as having experienced a soul braiding. I can feel him at any part of my body when he wants to reassure me. However, I am still having difficulty feeling joy in life, and I am not sure yet what will happen, whether I will exit, or stay. I do believe the plan was for me to stay. I do know I am being 'watched' very carefully, and I truly feel very grateful for all the spiritual manifestations in my life. And I am very grateful as most of the painful conditions I lived with have gone as well!I was just reading Dolores Cannons book \"Between Life & Death\", and my 'partner' made his presence known during the part about Walk-Ins. He is of course, very aware of my mental/emotional conditioning. I have been searching for answers everywhere in an attempt to process all that has happened to me, and I have found just enough information. However, have not found anyone whose experiences were like mine.\"\n\nThis article is copyright of AskingAngels.com. The first 200 words only may be shared as long as they are unaltered and proper credit is given to the website with this link www.askingangels.com included. The full article may not be copied or reproduced without express written permission from the copyright holder.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/articles/starseeds/starseed.php", "http://www.askingangels.com", "/spirit/portal-of-light-activation.php", "/healing/health/the-nuremberg-trials.php", "/articles/angels/incarnated-angels.php", "/articles/spiritual/twin-flame-love.php", "/articles/starseeds/negative-ets.php", "/articles/angels/ascendedmasters.php", "/psychic/numbers/what-are-angel-numbers.php", "/healing/healer-signs.php", "/articles/spiritual/soulmates-types.php", "/psychic/cutcords.php", "/articles/spiritual/ascension-symptoms.php", "/psychic/signs/feather-angel-sign.php", "/psychic/signs/butterfly-angel-sign.php", "/psychic/signs/rose-scent.php", "/psychic/signs/angel-wings-meaning.php", "/articles/angels/askformoney.php", "/psychic/energy-vampire.php", "/articles/interpreting-signs.php", "/psychic/areyoupsychic.php", "/psychic/four-clairs.php", "/articles/spiritual/spiritual-awakening.php", "/psychic/empath-signs.php", "/articles/spiritual/twin-flame-telepathy.php", "/healing/kundalini-awakening.php", "/psychic/spiritual-grounding.php", "/articles/starseeds/starseed.php", "/psychic/protection.php", "/articles/spiritual/lightworker-missions.php", "/articles/angels/names.php", "/articles/spiritual/twin-flame-meetings.php", "/articles/spiritual/twin-flame-separation.php", "/articles/spiritual/soulmates-signs.php", "/articles/spiritual/lightworker-traits.php", "/spirit/meditations/love-meditation.php", "/healing/earth/incarnated-elementals.php", "http://askingangels.com/articles.php"], "authors": [], "publish_date": null}