{"result_id": "038047", "URL": "http://askingangels.com/articles/newearth/ukraine.php", "timestamp": "2023-04-25 12:09:47 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://askingangels.com/articles/newearth/ukraine.php", "encoding": null}, "image": null, "domain": "askingangels.com", "title": "The Ukraine Never Stopped Being Part Of Russia", "cleaned_text": "Ukraine Never Stopped Being Part Of Russia\n\n\n\nThe Ukraine is still a part of Russia apparently, which makes all of this fake news rather funny, I think. According to Charlie Ward, there is a statement that has been released from the Secretary General of the UN (the new UN as the old one has been disbanded.) He has stated that the Ukraine has not applied for border registration since 1991. So the state of Ukraine as we think it is does not exist.\n\n \n\n\n\nWhat Trump Did On His World Tours\n\nHe had all of them and it was exactly all of them who CAPITULATED to him.\n\nAll of them.\n\nBack in 2014 the Secretary General made a statement that the Ukrainian Media, Internet and Mainstream Media. His name is Banky Moon. He stated that Ukraine has NOT registered it's borders as a sovereign state since 1991. Russia is not committing any rights violations concerning Ukraine. Amazing. According to the CIS Treaty the territory of Ukraine is an administrative district of the USSR. Therefore no one can be blamed for separatism or forcibly changing the borders of Ukraine under international law. The country simply has no official recognised borders. In order to solve this problem Ukraine needs to complete a demarcation of borders with neighboring countries and obtain the agreement of neighboring countries including Russia with their common border. It is required to document everything and sign treaties with neighboring states. The European nation has pledged it's support to Ukraine on the important issues and has decided to provide all technical assistance. But will Russia sign a border treaty with Ukraine? No, of course not since Russia is the legal successor of USSR. This is confirmed by the decisions of the International Courts on the property disputes of the former USSR and foreign countries. The lands of which Ukraine, Belarus and Novarosia are located belong to Russia. HA.Of course the Deep State wanted Ukraine to be a proxy country for them. They put in a puppet President and they laundered all their money there and we involved in criminal activities. Biden owns huge amounts of land over in Ukraine which land is above all their DUMBs apparently. It is nothing but a farce, so don't be getting all worried about Putin going into Ukraine as this is LAWFUL. He can do what he wants since it is part of his country that he is the President over. Putin wants to go in there to clean it up. To get rid of all the Deep State rats. And so he should.Recently I was reading about what Trump got up to on his World Tour back when he was President (he still is President of USA) in 2016 and 2017, etc. - very interesting! I did not realise he had proof of all the Pedophilia. He went in front of all these countries of the world and showed them the proof. Each of them individually, time and again, he showed them.They all gave in to Trump.This was after America (and maybe other militia as well) had destroyed the 13 families in Italy who ran the world. Yes, the Satanic Families were then destroyed in their massive, country mansions. I believe it was Christmas Eve when they were all home, as it is a big satanic ritual day of killing. The families who liked to hunt, torture, kill and then eat children. I've been hearing about all of this. We have done amazing! Humanity, we are winning! We have toppled already the Deep State and this, what is happening now, is a movie to wake everyone up. We are supposed to wake up this year, 2022, on mass so let's wait and see!\n\nThis article is copyright of AskingAngels.com. The first 200 words only may be shared as long as they are unaltered and proper credit is given to the website with this link www.askingangels.com included. The full article may not be copied or reproduced without express written permission from the copyright holder.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.askingangels.com", "/spirit/portal-of-light-activation.php", "/healing/health/the-nuremberg-trials.php", "/articles/angels/incarnated-angels.php", "/articles/spiritual/twin-flame-love.php", "/articles/starseeds/negative-ets.php", "/articles/angels/ascendedmasters.php", "/psychic/numbers/what-are-angel-numbers.php", "/healing/healer-signs.php", "/articles/spiritual/soulmates-types.php", "/psychic/cutcords.php", "/articles/spiritual/ascension-symptoms.php", "/psychic/signs/feather-angel-sign.php", "/psychic/signs/butterfly-angel-sign.php", "/psychic/signs/rose-scent.php", "/psychic/signs/angel-wings-meaning.php", "/articles/angels/askformoney.php", "/psychic/energy-vampire.php", "/articles/interpreting-signs.php", "/psychic/areyoupsychic.php", "/psychic/four-clairs.php", "/articles/spiritual/spiritual-awakening.php", "/psychic/empath-signs.php", "/articles/spiritual/twin-flame-telepathy.php", "/healing/kundalini-awakening.php", "/psychic/spiritual-grounding.php", "/articles/starseeds/starseed.php", "/psychic/protection.php", "/articles/spiritual/lightworker-missions.php", "/articles/angels/names.php", "/articles/spiritual/twin-flame-meetings.php", "/articles/spiritual/twin-flame-separation.php", "/articles/spiritual/soulmates-signs.php", "/articles/spiritual/lightworker-traits.php", "/spirit/meditations/love-meditation.php", "/healing/earth/incarnated-elementals.php", "http://askingangels.com/articles.php"], "authors": [], "publish_date": null}