{"result_id": "038011", "URL": "http://askingangels.com/articles/starseeds/sirians.php", "timestamp": "2023-04-25 12:09:28 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://askingangels.com/articles/starseeds/sirians.php", "encoding": null}, "image": null, "domain": "askingangels.com", "title": "8 Characteristics Of Sirian Starseeds | Alien People Race", "cleaned_text": "Sirius is probably the most important star when it comes to humanity's future as we head further towards the Sirian culture ourselves.\n\n2. They Have Their Own Truth.\n\n8. They can be quite silly and fun\n\nSirius is the brightest star in our sky and is a multi-star system, i.e. more than one sun. One of their worlds, called Sirius B, is a water planet that contains dolphins, whales and merpeople. Yes, we also have these three races on our world who represent the Sirians. We also have those in human form as starseeds who come from Sirius. Are you a Sirian Starseed?The Sirians are also a group of humans from the Sirius star system whose culture is much older than ours. Coming originally from Vega in the Lyra constellation, the home of humanity, they have been around a lot longer than humans on earth and are, in a real sense, our ancestors.To give a brief galactic history when it comes to life in this galaxy, humans are a relatively newer race, for example compared to Dinoids or Reptoids who are extremely intelligent and much more ancient. Humans are about 20 million years old, making us quite young and recent. We have only lived on earth for about 200,000 years however, although a more etheric human did live here long before that.There are many Masters or Avatars from Sirius who are Ascended Masters. Jesus Sananda and Mother Mary are both said to be Sirian. They wish to bring our world into harmony and for us to be able to express love and brotherhood as they do on Sirius.There was a setback wherein darkness was allowed to flourish unabated on Earth to see what would occur. It was a genuine experiment to see how the light would fare against very dark situations, but this situation has now ended and is winding up. Instead, humans, animals and plants on this world are headed for an ascension to a higher level whilst still living here physically. We are going the way of the Sirians, albeit we are doing it in a way that is much faster than ever before.We are also headed towards a Lyran/Sirian system on this planet. The Sirians plan to teach and mentor us about our true state in this universe and also our lengthy history - which most of us are unaware of. We call it the Lyran/Sirian system because Sirians first came from Vega in the Lyra system, where humanity was created. They plan to bring us their forms of healing, working and living in general. We are not going to turn into them, however we can do many things much better than we do them now, thus being fully environmental and honouring our planet. We were designed to be Guardians of this world, like the dolphins and whales, and we will begin to do this in the future.As Earth humans, we will also travel out into space becoming involved in the Galactic Federation and the greater universe. The entire planet Earth has been under quarantine until now due to our dangerous governments and warlike attitudes, but this will lift soon as new governments are formed to allow us to move out into the galaxy. The old, hierarchical way we did things over the last 13,000 years has been very Pleiadian due to rebels from that sector taking over for a short time, followed by the ruthless Cabal or Illuminate who took over after them, who were reptilian in nature. Now we humans are returning to the Sirian ways, which are much higher and more spiritual.Sirians are simple in the way they approach life yet they can be deeply spiritual also. They are like the salt of the earth. They go about tasks easily, have an open mind to many things and are not overly complicated. Yet they are also very deep and intelligent.Due to their openness, they may listen to all kinds of truths and never push their own onto others, yet deep down they have their own version and this is what they stick with. If they find something from another that suits them, they can also change quickly to something better if need be.and determined enough to finish tasks and jobs. They are the ones who get the work actually done. Work is not a game to them and they are good at ploughing through what needs to be completed.It is not easy to anger a Sirian. They are very calm and also resourceful. They will be the rock when everything falls apart. Look to the Sirian to hold everything together under a lot of pressure.They do have difficulty expressing what is inside of them, such as emotions or needs, so sit with them to get to the bottom of any problems. They can be easily hurt because of this when others may not live up to what is expected of them. Communication is a big deal because they keep things to themself, so in a friendship you need to bring this out clearly.Since Sirians do not like looking at the past, they can carry around a lot of repressed issues that have not been faced. They may like to focus on the future and what is coming, but they need to learn to deal with old angers so they can be released. They do not like confrontation and will avoid being angry at all costs if they can. However, if pressed against a wall they will fight back.They tend to drift off in a daydream as sometimes their inner life is more interesting than the outer, or what is actually happening. They do well with hands-on learning rather than sitting still and merely listening, which can bore them silly. When teaching them, give them something interesting to do to snap them awake again., but only if they know and trust you, otherwise they may seem quite serious. They are very loyal and staunch friends but you will have to prove yourself to them first. Once you have, they feel free enough to be themselves and have a great sense of humour.\n\nMore Starseed Articles \n\n Are You A Starseed?\n\n Sirian\n\n Pleiadian\n\n Arcturian\n\n Andromedan\n\n Lyran & Vegan\n\n Orion\n\n Feline\n\n Avian\n\n Reptilian\n\n Negative ETs - Full Disclosure\n\n The AI Controller - The Eye Atop The Pyramid\n\nThis article is copyright of AskingAngels.com. The first 200 words only may be shared as long as they are unaltered and proper credit is given to the website with this link www.askingangels.com included. The full article may not be copied or reproduced without express written permission from the copyright holder.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/articles/starseeds/starseed.php", "/articles/starseeds/sirians.php", "/articles/starseeds/pleiadians.php", "/articles/starseeds/arcturians.php", "/articles/starseeds/andromedans.php", "/articles/starseeds/lyran-vegan-starseeds.php", "/articles/starseeds/orions.php", "/articles/starseeds/felines.php", "/articles/starseeds/avians.php", "/articles/starseeds/reptilians.php", "/articles/starseeds/negative-ets.php", "/articles/starseeds/ai-controller.php", "http://www.askingangels.com", "/spirit/portal-of-light-activation.php", "/healing/health/the-nuremberg-trials.php", "/articles/angels/incarnated-angels.php", "/articles/spiritual/twin-flame-love.php", "/articles/starseeds/negative-ets.php", "/articles/angels/ascendedmasters.php", "/psychic/numbers/what-are-angel-numbers.php", "/healing/healer-signs.php", "/articles/spiritual/soulmates-types.php", "/psychic/cutcords.php", "/articles/spiritual/ascension-symptoms.php", "/psychic/signs/feather-angel-sign.php", "/psychic/signs/butterfly-angel-sign.php", "/psychic/signs/rose-scent.php", "/psychic/signs/angel-wings-meaning.php", "/articles/angels/askformoney.php", "/psychic/energy-vampire.php", "/articles/interpreting-signs.php", "/psychic/areyoupsychic.php", "/psychic/four-clairs.php", "/articles/spiritual/spiritual-awakening.php", "/psychic/empath-signs.php", "/articles/spiritual/twin-flame-telepathy.php", "/healing/kundalini-awakening.php", "/psychic/spiritual-grounding.php", "/articles/starseeds/starseed.php", "/psychic/protection.php", "/articles/spiritual/lightworker-missions.php", "/articles/angels/names.php", "/articles/spiritual/twin-flame-meetings.php", "/articles/spiritual/twin-flame-separation.php", "/articles/spiritual/soulmates-signs.php", "/articles/spiritual/lightworker-traits.php", "/spirit/meditations/love-meditation.php", "/healing/earth/incarnated-elementals.php", "http://askingangels.com/articles.php"], "authors": [], "publish_date": null}