{"result_id": "039007", "URL": "http://www.assassinationscience.com/1090wjkm.htm", "timestamp": "2023-04-25 12:09:57 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://www.assassinationscience.com/1090wjkm.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.assassinationscience.com", "title": "WJKM AM 1090 / CMR - BLASTED OFF THE AIR", "cleaned_text": "July 14, 2001 Hartsville, Tennessee - Friday, July 6, was a clear and sunny morning. But at 10:45 a.m., something very odd surged through the air, radio transmitter, power and phone lines at country music radio station WJKM (1090 AM) near the city park in downtown Hartsville, Tennessee. It also affected theVidette newspaper office next door and shocked one of the employees sitting at her desk.\n\nEmployee, Vidette Newspaper, Hartsville, Tennessee: \"I heard this, it sounded like a surge of electricity running through the building. And the lights went off for a second. And I looked up real quick when I heard that and saw light - a flash of light on the front wall there in front of me. Lights came back on. Then it did that again and they stayed off. And again, I saw that flash of light and heard that sound. I don't know how else to describe it, except that it sounded like a surge of electricity coming through the building. It was just like a big old block of light, like it came in through that window.\"\n\nNext door at country radio station WJKM (1090 AM), the sales manager also heard a strange, powerful sound and the whole building shook.\n\n\n\n At about 10:45 AM Friday, radio station WJKM and CMR (Country Music Radio), with studios in Hartsville, Tennessee was knocked off the air by a very powerful strange energy blast! There was a crystal clear blue sky, no clouds or rain. It was not lightning!\n\n1.All the radio station's lines were knocked out.\n\n2. Several power transformers were blown several blocks away from the studios (smoke seen billowing out of one)\n\n3. All phone lines at the newspaper (The Hartsville Vidette), the local farm co-op and all other phones in this small radius were knocked out!\n\n4. Radio station transmitter lost all MOSFETS and the output - tuning network.\n\n5. All computers at WJKM lost motherboards, network cards etc.\n\n6. ISDN was knocked out.\n\n7. Most all the equipment Zephyr codec and EAS all knocked out.\n\n\n\nTHERE WAS NOT A CLOUD IN THE SKY! This was not lightning!\n\nIn the back of the radio station were DEAD FRIED BIRDS! Their wings, tails and feet severely burned. Station secretary Jennifer and sales manager Steve found a small bird still alive hopping around with its wings and tail feathers burned off. Many of the birds were still alive but badly burned.\n\nThese are smaller birds. The wingspan is not large enough for them to get fried from getting across a powerline to ground. This was not just one bird.\n\nSteve (sales manager) told me he heard a loud electrical overload sound then the power went out. He told me he has never heard anything like this ever in his life. There was no blown transformer near the radio station. The closest burned transformer was at least three city blocks from the building.\n\nSales Manager, WJKM (1090 AM), Hartsville, Tennessee: \"The lights flickered a time or two and then there was kind of a low level rumbling kind of noise. It sounded like an electric current (mimics sound). It lasted only two or three seconds tops, two maybe. Then the lights were down. I never heard anything quite like it. It was quite unusual. It sounded like somebody, or something hit something and there was a charge go off or something like a rumbling like an electric current kind of thing.\"\n\nWJKM's General Manager, Ted Randall, talked to me this weekend about the shocking chaos of at least 60 birds dead with charred and melted wings around the radio station and the damage to his transmitter, phone lines and most of the station's computer equipment.\n\nThe editor of the Vidette said she was sitting with her back to the window. She heard a loud roaring sound like an overload and something came through the window and a flash of light went through the entire building. The Vidette is next door to the radio station.\n\nTed Randall, General Manager, WJKM (1090 AM), Hartsville, Tennessee: \"So, these birds were burned very badly. With the wings, you can actually see the bone structure where it curled from the heat.\n\nI just told David, \"Shoot some pictures because it was just too weird.\"\n\nIt's a disturbing thing, and I just don't understand it. Now, the phone company reported to the editor of the newspaper that the ground wires on all of the lines from the radio station, from the newspaper and from the co-op had been burned completely in two. So, birds flying into a transformer ­ the central office for the phone company is about three blocks away from the radio station. But all the phones were not out. I called the Chamber of Commerce. Their line was working. Their answering machine was working. They had power and phones. So, if indeed, something that powerful blew the grounds out of just those circuits, I would have thought - I don't know, it just seems like it would have taken out the central office. But it didn't. It just bothered the specific lines that were effected. Now, of course, the lines are extended above ground on poles. Power lines are extended above ground on poles. Our antenna system outside which is an AM antenna system is in the air.\"\n\n\" So it seems like it bothered anything that was suspended above the earth and it got the birds. Because I thought everyone else felt the shake or felt something - Steve and the editor from the newspaper, but they - no harm came to them. But the birds obviously took a major hit and so did the electrical system, the electrical power, and the telephone lines. So this remains a very big mystery. \"\n\n\"We've had a lot of power surges. We've had to replace a lot of equipment. We've got circuit protectors ­ I should say, surge protectors. We've got surge protectors plugged into surge protectors plugged into surge protectors. We've done everything we know how other than enclosing the radio station in a Faraday shield or something.\"\n\n\"I placed some calls to the TVA and they didn't return my calls. The only reason I called them is that we have a nuclear power plant that was never completed, according to what they say, and it's supposed to be completely non-operational. It's supposed to be a storage facility for TVA junk, discarded stuff that they don't have any use for. Occasionally they have auctions out there. But there's been a lot of things reported in regards to this nuclear plant that are just abnormal. Sound strange.\"\n\n\"The thing started off with a farmer who called me one day. He's a very country fellow, obviously an elderly gentlemen, who told me his beagles had gotten loose and they had wandered off and a friend had called and said they had heard or seen the beagles over by the cooling tower. So this old gentleman got in his pickup truck and drove over there and when he got near the area, he jumped over the fence and could hear the dogs out in the thicket, as he said. He said he was out there 10 or 15 minutes and a helicopter came over head and the next thing he knows, he's got about 30 people on the ground escorting him off the property. He said he had to take a nitro tablet he was so upset. And so I thought, \"Boy, for a place where nothing is going on, that's really overkill.'\n\n\" But we've been told stories of black, silent helicopters coming in and out at night; C-130 transports coming in and out; shiny 18-wheel rigs coming in at 3 o'clock in the morning, three or four of them in a row going out to the site. People who live in the area who are up high enough that they can see the place say it is very, very active at night, a lot of activity.\"\n\n\"I don't know. Not to blame the nuclear power plant or say that's what the cause is, but when people call up they report strange humming sounds that occur in the middle of the night and are usually accompanied by helicopters. And the humming sound is nondescript. We've had a couple of callers say they can feel it, that it raises the hair on the back of their head, that type of thing. But they (TVA) will tell you that nothing is going on out there.\"\n\n\" And we got on the air and said, 'If nothing is going on and the TVA is maintaining this ungodly piece of land which is hundreds of acres, then why don't they just turn it over to the county for development and bow out of the situation and then it's no longer an expense. They don't have all this liability they claim they have. And as soon as we began to talk that, they (TVA) scheduled a press conference and they went on and said they were going to donate this land to the county and that the local electric company and TVA were going to develop a power park where you can go in if you are operating some kind of industry where you need some kind of guaranteed flow of power and current with no outages, they were going to put something like that together. By air, I would say no more than 3 to 4 miles at the most.\"\n\n\"And all of a sudden, they (TVA) came back and made the announcement that it would be at least three years because they had to do an environmental study. And I said, \"Now wait a minute. They did a study that said they could put a nuclear reactor on the banks of the Cumberland River where Nashville, Tennessee gets its water supply. They have approved this property for nuclear fission and then they decided they are not going to build it. Now they simply want to put an industrial park in. What kind of environmental study could they do that would exceed what they did to approve a nuclear power plant?! I attended a meeting where they were at and I asked them about the helicopters and all such as that and the guy that was talking, he got very nervous. And he stayed nervous through the remainder of his speech. But never so much as a clue.\"\n\n\"I went for a drive out there with my sons one day. When I first moved into the community I was just curious what was out there because there were a bunch of buildings that looked like Army barracks. And they have an incubator set up out there supposedly for new businesses. And there are some businesses operating out there. But there's a good portion of that property that does not meet the eye.\"\n\n\" And all of a sudden here comes the nose of a C-130 pops up over the top of a hill, very close to the ground. I said, \"That thing must have just taken off.\" I began to ask questions (in town) and everyone said, \"Well, there's no runway out there. There's no place for a C-130.\" And I said, \"Well, what in the world ­ what did we see?\" And you're constantly seeing three and four of these C-130s go out in that direction.\"\n\n\" So, interestingly enough after all this took place, we had some satellite photos that my son Matt had gotten off the internet. We put them on the (radio) website. And I've had two or three people e-mail those satellite images back to me with arrows on them all pointing to a strip that each one of these people e-mailing say the strip is at least 7,000 feet long, or something like that, and it would be an ideal place. A C-130 would have no trouble taking off or landing there.\"\n\n\"It's right in that same complex. There must be, I don't know how many hundreds of acres there are. It seems to me they had talked about turning 700 acres over for development to the county. But then, there's always some reason like this environmental study. \"\n\n\" But the helicopters, I've seen those myself. We're a good distance away from Fort Campbell, Kentucky, built a lot of people say they do maneuvers from Ft. Campbell and fly the C-130s from there and turn around and go back in helicopters and what not.\"\n\n\" There's a radio tower that they mysteriously claim is being used by NOAA. A friend of mine has a spectrum analyzer, has monitored the area pretty closely and says the tower is never used during any sort of a storm or tornado activity. So there is a lot of mystery about the place.\"\n\n\"And I guess what bothered me when this happened with the birds and all that, I look at the community of Hartsville and I say, 'How far are we away from a military installation?' Well, it's a long ways. And yet this place is surrounded by a lot of mystery and there are a lot of odd things going on surrounding the place and that was my first suspicion. I wonder if they are playing with something out there? Is something going on? I haven't heard a word from anyone.\"\n\n\"The whole thing seems strange. In the past I've called because I've had listeners call me and say, 'We've heard this humming sound at night. What's with these black, unmarked helicopters? They don't make any noise until they are right overhead.' You hear these stories and I would call as a public relations person from the radio station and say, 'Well, I've got listeners calling and they are asking these questions.' I would always get a voice answering machine and I would leave a message, but never a call back.'\n\n\" Now, these people have showed up at public meetings. Now, I'll tell you a very strange thing that took place right after all of this happened. I believe this last week, the supposed director of the area stopped in to talk to our lady over at the (Hartsville) Chamber of Commerce. The nuclear site. And he said, 'I need to tell you what's going on. You need to know. Every week now, we're going to be bringing in 150 people for training purposes each week. And we're not going to do this over a short term. We're going to do this over an 8 year period.' She mentioned something about fossil energy and some other kind of energy. So, I'm thinking to myself, 'OK, we have a partially constructed nuclear power plant that was scrapped. There is supposedly nothing there except junk and what remains of the construction. What would they be training people for in an area like that? What on earth could they possibly have to train someone?' Maybe I'm just crazy and stupid and don't know. I mean, I think it is a legitimate question. But 150 people a week?!\n\n\"What are they doing? Maybe it was a little target practice and those birds were .....? I mean, I just don't know. I think what ever happened to those birds hit them in the air. And the ground wires being burned off the phone lines. All of that is - I don't know. What really bothers me over there is playground equipment. And it extends up in the air quite a little ways. You know, monkey bars and stuff. Super park for kids to play. And I thought, 'If a child were elevated up there 15 or 20 feet off the ground...\"\n\n\"Yeah, what would have happened then? And that makes me angry. Whatever this is, unless it's a natural occurrence that we can explain somehow, ...But, you know, who's to say what it is. And I would say this: if when you call govt. agencies they would respond and return telephone calls, you wouldn't be nearly as suspicious of them as you would if they are totally silent and just ignore you.\"\n\nThe Power Company, Tri County Electric and Bell South seem to be at a loss to explain the situation.\n\nThis is not the first time WJKM has had strange power surge problems. It has been difficult to keep computers up and running at the Hartsville studios and transmitter site.\n\nWe have called the local power company and complained to no avail. They seem to be as puzzled by the problem as we are. They have placed monitoring equipment on the lines and have seen nothing unusual.\n\nYet in this outage the editor of the Vidette told me she keeps all the computers in the building unplugged. The newspaper publishes once a week so they only plug the computers into power once a week. Friday the Editors calculator was plugged into the wall outlet and it was destroyed by the surge.\n\nThese surges are not just coming into the power lines. They are also entering the radio station through phone lines and the antenna system. This is evident in blown telephone equipment. Sometimes the equipment is not destroyed but the program settings are scrambled or wiped out.\n\nWe have surge protectors plugged into surge protectors. We keep MOV's by the boxfulls.\n\nWe have been at a loss to make a determination as to the cause of these surges. The only clue as to what the cause may be has been suggested by our listeners.\n\nMany of the callers to the radio station seem to think that there is some sort of activity at the old Hartsville nuclear power plant site. My first trip to the site left me a bit cold as the place looks like an abandoned ghost town. With heaps of things lying around, it looks like a good set for a futuristic movie.\n\nThe nuclear power plant is a site that cost the general public millions of dollars that was supposedly never finished. The construction of the plant came to an abrupt halt some years back leaving the community devastated. TVA (Federal Government) will tell you it is being used as a storage area only. Yet I have calls at the radio station from listeners who claim to hear strange humming sounds coming from the location. Listeners have seen strange objects overhead. Listeners have claimed to see triangular shaped craft overhead. Silent black helicopters at all hours of the night. Huge military C-130's heading in as if to land or leaving the area nose up as if they have just taken off.\n\nThere are no visible places for a C-130 to land or take off. We have searched the area as well as we could.\n\nListeners from the area have called talking about a strange humming sound. Comments like \"you can feel it\" \"It makes the hair stand up on your neck\" are common. We also hear that you can't locate the source of the humming it seems to be coming from everywhere. This has been mentioned only by people who live near the nuclear power plant site. . A rural elderly listener called my morning show extremely upset. He told us he had lost several beagle puppies in the area. A friend of his told him that he thought that he had seen the pups in the area near the cooling tower. He reported to us in a phone call that he had driven his truck to the area. He thought he was hearing the beagles out in the wooded area so he climbed over the fence and started calling to them. He told us he was greeted with an overhead helicopter and a ground force of about 30 people. They allegedly escorted him off the property in a very rough and crude manner. He said they were some kind of police, some in plain clothes. He told us they were rude and threatening.\n\nA listener who is a tech that lives on a hill near the area has had fluorescent bulbs light in his hand on various spots on his property. He discovered this by accident but has witnesses to the phenomenon. He works with surveillance cameras, thermal imaging and a lot of high tech stuff. He tells us there is operational radar being used at the nuclear site at different times.\n\nA Hartsville resident who's ex-husband worked at the site tells us that there is a reactor there. We have had several reports of this from different folks in the community. She tell us that her husband was told \"don't eat the fish from the river or eat any deer shot in the area\"\n\nOur local heating and air conditioning contractor tells about how he sees large shinny new 18 wheel tankers go and come from the nuclear site at 3 in the morning.\n\nA gentleman who is a relative to an owner of a local grocery establishment claims to have seen a Bigfoot near the nuclear plant.\n\nIt is also interesting that according listeners have called in, there has apparently been an increase in what they are calling fibromyalgia. This is a decease name appointed to the unexplainable severe and disabling pain throughout the entire body over recent years, as well as, an increase in headaches mimicking migraines that are not actual migraines.\n\nAt night the entire area has a strange chemical smell to it somewhat pungent like ozone and chemicals. The radio station transmitter and Hartsville studio is located in the middle of Hartsville City Park about 5 miles from the nuclear cooling tower.\n\nWe are in no way accusing the TVA or the nuclear power plant of causing this problem. We are just reporting what listeners and residents of the community have reported to us.\n\nOne thing that we do find strange is this, in the beginning we would go on the air and joke about the nuclear power plant. We did this because of the TVA's vague promise to turn a good portion of the land back to the community for development. This was always talked about but nothing ever happened. We placed several calls to TVA. No one ever responded. When we would get on the air and start airing some of these reports it was always promptly followed by a press release or a public meeting about the donation of the land back to the county. We were told not to talk about it, that the TVA would get upset. Whenever we would stop talking about it, then it seemed that you would hear nothing about the land development. We have been off the subject for a good time now. Their latest announcement is to develop the land in partnership with the local Power Company for an industrial power park. They say this wont happen now for 4 years. They now claim they must do a 4 year environmental study. What do they need to study? Was there not a study done in order to build a nuclear facility? What else needs to be studied for a commercial business site? For you the listener, thank you for putting up with our outage. We are making repairs as fast as we can. As for the cause, we have no idea what this is all about. We are concerned about the charred and fried birds however. These birds were found on our property in areas where there are no powerlines! The Power Company said the birds got into a power transformer. What transformer? Our 10 KVA pole peg behind the radio station? How would all these birds do that? After being in or near the transformer, how did they all get to different locations around the 5 acres of land where there are no power lines? If the birds were sitting on an electrical wire and were hit by a surge their legs would have been burned off! These birds have legs. Its their wings and feathers that are burned, singed or missing! It appears to us these birds were cooked in flight! But by what? \n\n\n\n\n\nClick Here For More Pictures Thomas Crump looks at a motor used at the Hartsville Nuclear Plant, where equipment will be sold off tomorrow. (Michael Clancy) HARTSVILLE, Tenn. -- What do you get when you cancel construction of a $12 billion nuclear reactor generating plant? The mother of all garage sales. TVA is cleaning out its \"attic\" at the defunct Hartsville Nuclear Plant and inviting the public to bid on items as varied as office equipment, a 30-ton hoist and electric motors larger than automobiles. While the plant has been the site of auctions selling equipment from TVA installations, utility companies and the armed services, tomorrow's sale marks the first time equipment made specifically for the scrapped Hartsville plant will be placed up for sale to the highest bidder. \"We've sold some of it directly, but not at auction,\" said Robert Walker, a TVA auctioneer. So if a turbo-axial ventilating fan strikes your fancy, or if you just can't get along without a Vibromet polisher, this could be the sale for you. But you probably won't be alone. Sensing bargains will be aplenty, an estimated 900 bidders are expected for the sale, including some brokers representing utility companies overseas. \"We had one call from Kuwait,\" Walker said. Bidders began touring the dozen football field-sized warehouses where the equipment is stored yesterday. The tours continue today and will be held tomorrow morning before the sale. The gate will open at 7 a.m. Some of the equipment up for grabs has been stored for more than two decades. After TVA halted the project in 1982, the buildings that were to be supply rooms for the reactors became warehouses. \"We've been trying to peddle it for all these years, and now is the time to bite the bullet and take what we can get,\" Walker said. Even though much of the material will be sold at bargain prices, TVA expects to have sales of $1 million or more. \"We'll take personal checks for $500 and company checks up to $1,000. Of course, cash speaks just as well, too,\" Walker said. RADAR STRANGENESS AT EDWARDS AIR FORCE BASE THE SAME DAY I would be careful on how much of Al Bielek's info you believe - facts are often interspersed with planned disinformation, especially from people who have in the past been involved with the military or black projects - who knows what their underlying programming contains? I would be interested in the orgone info. BTW, I have heard that JFK was assassinated because \"he thought he was in control\". When the mind control stuff kicks in, or the planned reactions that came along with the compulsory vaccinations given to US servicemen, to be activated in response to some as yet unknown stimulus, whether they want to go along or not may be a moot point, so don't rely on any coherent support from that direction. During the course of our orgone work (our updated cloudbusters destroy chemtrails within seconds and also break up artificial, directed weather, for example) we spent an afternoon with Al Bielek, who told us that StarWars was developed internationally to defend the planet from aggressors and that it was deployed and used successfully to divert Hale-Bopp from striking the earth, an event which would have fulfilled the earth-changes predicions of Nostradamus, Cayce, Scallion, Toye, et al. www.albielek.com and www.wingmakers.com have more collaborative evidence on the subject. I never knew what to think of Al's story before I met him but have found abundant confirmation since that meeting. According to Al, the creeps that operate the New World Order have a lot less power than most people think. The consortium that operates the planetary defenses are made up primarily of military men who are more or less independent of the predators who operate the world's governments and economies. I don't know how this is done, but I trust that it takes place. The internet was, after all, created by the military. There may be a coup d'etat in progress, worldwide, that we simply don't know about. I can't imagine how any general officer with conscience would just go along with the parasitic procedures of the UN. Deep Throat in the movie JFK was actually an army colonel who was appointed by the Pentagon to keep tabs on the CIA, which is one of the New World Order's parasitic agencies. I used to listen to this colonel being interviewed on short wave programs. He operated the Tokyo airport after the American invasion of Japan in 1945 and said, among other things, that SONY stands for Standard Oil of New York ;-) I do know that there's a lot more to the picture than even the most cynical conspiracy theorist imagines, and a lot of it is encouraging to me. Disraeli said 'anyone who ignores the conspiratorial nature of history is a dunce,' and I still don't have much patience with my contemporaries (mostly ex-hippies) who believe that simply loving everybody will make the bad things disappear. Actually, they get pretty un-loving whenever I bring these things to their attention. I consider what I'm doing 'tough love,' so maybe we can interface that way. The following information appeared about 20 odd years ago, in a periodical called Youth Action News. While I don't even suggest that the incident in Tennessee was caused by the Russians. it does more or less confirm my personal opinion that the \"Alphabet Boys\" in the Federal Government are playing games with a Scalar Interferometer over at the old nuke plant, and they screwed up, caused a bubble of energy where a bubble should never have been and fried some birds and a few motherboards. Past that point, I suggest you draw your own conclusions. THE TESLA SHIELD-- Of particular interest is the hemispherical shell of energy which years ago was dubbed the \"TESLA Shield.\" Two scalar hemispherical surfaces are created, using multiple frequency transmitters and truncated Fourier series expansions. Interference of the two scalar hemispheres creates a great, glowing hemispherical shell of ordinary electromagnetic energy. In the shell, the energy density is sufficient to lift Dirac matter from the Dirac sea of vacuum. The shell is thus filled with a glowing plasma. Such a shell may be several hundreds of miles in diameter at the base. The enormous energy required to form such a defense shell is obtained by a \"scalar power tap\" into the molten core of the earth itself as previously explained. In late April/early May of 1985, 27 such \"power taps\" were placed in the earth by the Soviets. If each tap is capable of powering 4 to 6 large scalar EM weapons, then the Soviet strategic scalar EM arsenal contains over 100 monstrous superweapons capable of generating exothermic explosions, endothermic explosions, engineering the weather, locating and destroying underwater submarines, detecting and destroying ballistic missiles shortly after launch, detecting and destroying long range strategic bombers as soon as they are airborne, etc. At any rate, the giant Tesla shield is useful against any penetrating vehicle. If the shell is not so large, its energy density may be very high. In that case, the intense plasma heating will fuse and even vaporize metallic bodies. In addition, any vehicle encountering the shell is subjected to an extremely intense EMP arising everywhere inside its circuitry. EMP shielding is of no use against the creation of energy throughout the spacetime of the circuits; such shielding only helps against energy flow through space in the conventional sense. Thus the electronics of any vehicle encountering the shield are instantly dudded, whether or not they are shielded against ordinary electromagnetic interference (EMI). This includes the electronics operating a nuclear warhead, carried by a re-entry vehicle. Electrically everything penetrating the shell is totally dudded. Further, explosive materials are exploded when such an EMP is encountered, and combustible materials are fiercely consumed or set afire. Ablative shielding suffers an interesting catastrophe: since energy does not try to \"flow into\" the shielding but \"arises\" everywhere in it simultaneously, \"ablation\" occurs everywhere throughout the ablative material, simply exploding it instantly. In addition, for smaller Tesla shells (say of 50 miles in diameter) the energy density is sufficient to melt or vaporize metals such as missile structures. With such a Tesla shield, there is no need to discriminate true warhead bearing re-entry vehicles from decoys, chaff, etc. The whole \"mess\" entering the shield is simply \"cleaned up\" and \"sterilized\" or destroyed. The shield can take care of ICBMs/IRBMs and their nuclear warheads, strategic bombers and their nuclear bombs, cruise missiles and their nuclear warheads, re-entry vehicles and their warheads, decoys, chaff, etc. --SARYSHAGAN DIRECTION-SEPTEMBER 1979-- The London Sunday Times of 17 August 1980 contained information and a photo-sketch of incidents fo sighting of the testing of very large Tesla globes deep within the Soviet Union. The sightings were made in Afghanistan by British war cameraman Nick Downie. The phenomena seen were in the direction of the Saryshagan Missile Test Range, which -- according to the U.S. Defense Departments \"Soviet Military Power,\" 1986 -- contains one or more large directed energy weapons (DEW's). Even though Downie was seeing the globe of light from a great distance, it flared silently over the Hindu Kush and expanded to subtend an arc of about 20 degrees, dimming as it expanded. (An arc of 20 degrees subtended by an object many hundreds of miles distant indicates an object of well over a hundred miles in diameter. This gives some idea of the enormous energy being controlled and manipulated by these Soviet weapons.) Downie saw the sight on more than one occasion in September 1979. In the same month --December 1979-- a stationary luminous globe containing a vertical stripe of black in the center was seen in the sky off the coast of St.Petersburg, Florida. This particular type of sighting in that area has been previously correlated with times of known activity at Saryshagan. Further, in the same month, U.S. nuclear warning Vela satellites detected a \"nuclear flash\" over the South Atlantic, off the coast of Africa. Controversy has raged in U.S. Intelligence and scientific circles to this day as to whether a nuclear explosion or some other kind of mechanism produced the flash. Indeed, the flash may have been produced by a scalar EM howitzer from Saryshagan as one more \"ping\" of the U.S. Intelligence system, to ascertain whether or not it knew anything about scalar EM howitzers. Again the negative response told them with high confidence that (1) We still didn't know about scalar EM stuff, and (2) We were still totally defenseless against the Soviet scalar EM weaponry. At any rate, from Downie's sightings, it is highly probable that the DEW weaponry at Saryshagan Missile Test Range was active in September 1979, and was producing large Tesla globes. If the DEWs at Saryshagan can produce the giant luminous Tesla globe, they are almost certainly scalar EM interferometers and can produce the giant Tesla shields as well. Downie reported other earlier sightings of similar phenomena seen by Afghans deep within the Soviet Union in the same direction toward Saryshagan... Briefly, let us cover the uses of such a giant globe or spherical shell of glowing EM energy and plasma. By placing such a giant globe hundreds of miles out away from the defended heartland, an entire arc of the sky can be defended against long range ballistic missile attack in midcourse. During their midcourse trajectory, the attacking missiles would have to penetrate the globular shell twice, exposing them to giant internal EMPs twice. A very high probability thus exists that all missiles entering the space occupied by the globe are dudded upon entry and/or exit. This includes the electronics inside the nuclear warheads themselves. Also this is particularly effective against MIRV and MARV missile carriers since the multiple re-entry vehicles are normally still on the main vehicle during most of midcourse. The use of this midcourse ABM globe defense greatly reduces the number of vehicles arriving at the latter part of midcourse and the terminal phase of their trajectory. By using a smaller, more intense globe, and placing it on incoming clusters of objects or single objects, both EMP and local heating are used against the objects. This is suitable in the latter part of midcourse and in the terminal phase of ICBMs, IRBMs, SLBMs, and cruise missiles. It is also useful against incoming strategic bombers and their air to surface missiles both ballistic and cruise. Two modes of the globes -- especially the small ones -- can be used. First the continuous mode can be used to \"fry\" or vaporize incoming objects in a relatively small volume (say ten to fifteen miles in diameter). Second, the \"pulse\" mode can be used to \"service\" all incoming objects, whether or not they have passed through the \"large globe\" midcourse defense. This provides an additional guarantee of killing the objects; discrimination is not require, just get all of them. The exposure of all incoming objects to multiple attacks raises the probability of kill to essentially 100%, or as close to that as one wishes. Of course the incoming vehicle may still encounter a terminal defense consisting of the Tesla shield and associated roving \"quickshot\" small intense globes. In short, with these systems an essentially 100% ABM and anti bomber defense is possible. Further, the Soviets have possessed such an effective defense for two decades, JUST AS THEY HAVE OPENLY STATED SINCE 1960 WHEN KHRUSHCHEV ANNOUNCED HIS \"SUPERWEAPONS\"!! --CONTINUOUS TESLA EMP GLOBE-- Here is another verified incident of a gigantic test of a Soviet scalar EM howitzer deep within the Soviet Union. This is a C.I.A. report, released under the Freedom of Information Act. One can be quite sure that the incident occurred as stated. The phenomenon was seen from two aircraft approaching Mehrabad Airport in Teheran, Iran on June 17, 1966 and reported by their pilots. On the far horizon deep within the Soviet Union, an intense spherical ball of light appeared, \"sitting on the horizon\" so to speak. The globe of light increased to enormous size, dimming as it did so, literally filling an arc of the distant sky as it expanded. The sighting was shielded from most ground observers view at the airport itself due to an intervening mountain range which masked most of the phenomena from the ground. The silent, expanding globe was observed for four or five minutes before it faded away. Again this is positive evidence of the testing of a giant scalar interferometer, in the \"midcourse ABM globe\" type of action. However, note the date -- mid 1966! The Soviets have therefore been testing such scalar weapons of enormous size and power for at least two decades. This implies that development must have started at least a decade earlier, or in the mid '50s. Still earlier, in January 1960 Nikita Khrushchev had announced the development of a \"fantastic\" Soviet weapon, one which could even destroy all life on earth if unrestrainedly used. In 1962 the ebullient Khrushchev was forced to back down and lose face before John Kennedy, in the Cuban Missile Crisis. Khrushchev's missiles and bombers were in woeful shape, as Kennedy well knew (by courtesy of the Russian spy, Colonel Oleg Penkovsky). Kennedy did not know that Khrushchev's new superweapons were nearing deployment, but were not quite ready yet. To save face and prevent his immediate ouster, Khrushchev apparently conducted a startling two-strike demonstration of his new weapons as soon as they became operationally ready. On April 10, 1963 he detected and destroyed the U.S.S. Thresher nuclear submarine, using a scalar EM howitzer in the underwater \"continuous\" mode. The next day he demonstrated the \"pulsed\" underwater destruction mode for underwater subs by producing a giant underwater explosion underneath the water 100 miles north of Puerto Rico. Ironically, just as the Atlantic was coming alive with U.S. naval vessels searching for the lost Thresher, a second test of the weapons that had finished off the sub occurred to the south of them, unnoticed and disregarded, even though seen and reported to he F.B.I. and the U.S. Coast Guard by a passing U.S. jetliner's pilot and crew, who observed the underwater explosion. We thus can peg the development of these weapons by the Soviets as starting well before 1960. The first operational deployment of the gigantic strategic weaponry occurred in early 1963. Note that the 1966 testing observed here is completely consistent with this estimated development schedule. Thus large Soviet strategic scalar EM weapons have been operational on site for 24 YEARS !!! This implies that at least three additional generations of the scalar EM weapons have been developed and deployed by now... --MYSTERIOUS LIGHTS OVER NORTH PACIFIC-- Incidents of Soviet testing of the Tesla shield and the Tesla globe weapons are routinely observed by airline pilots flying over the North Pacific into and out of Japan. This is one typical example. Two jetliners, Japan Air Lines flights 403 and 421, sighted and reported a large glowing globe of light sitting just beyond the horizon and extending well above it. The aircraft were in the vicinity of 42 degrees N latitude and 153 degrees longitude at the time. The sighting was thus about 700 miles east of Kushiro. The diameter of the ball was estimated as at least 18-27 kilometers by the pilots. Depending upon the actual distance to the sphere it may have been of much larger size. This incident is reported in the Asahi Evening News, Tokyo, June 22, 1982. Many similar sightings have been reported by jet airliner pilots flying over these waters. --WHITE SPHERE SEEN IN NORTH ATLANTIC 1976-- Here is another sighting closer to home. This incident was observed from a passing ship on June 22,1976 in the North Atlantic, at about 2113-2140 hours. It is reported in the Marine Observer, Vol.47,1977, p.66. First an orange glow was sighted behind some distant clouds. A couple of minutes later, a glowing white sphere of light was observed to the left of the orange glow, just above the clouds. The white sphere then slowly expanded to a much larger sphere, dimming as it expanded. At its maximum size, the top of the white sphere reached about 24 degrees 30 minutes elevation angle to the observer. Development to maximum size required about 10 minutes. By 2140 hours the sphere had faded and disappeared. The sphere was sufficiently thin that the stars could be seen through it at all times. Again, this incident strongy fits the large Tesla globe mode of a Soviet scalar EM interferometer. The significance and role of the orange glow are not known at this time. --CONTINUOUS TESLA FIREBALL-- Here is another incident that represents a stimulus to the British government, to see if the British are aware of scalar electromagnetics. Again this is a CIA report released under the Freedom of Information Act, so the details are reliable. On Sep. 10, 1976 British European Airways flight 831, flying between Moscow and London and over Lithuania at the time, observed an intense ball of light above the clouds below the aircraft. The light was so intense it lit up the sky in the entire vicinity. The concerned pilot reported the glowing object to Soviet ground authorities with whom he was in contact. He received harsh instructions to ignore the light, and essentially to continue on his way out of there. Here we see an incident involving a small, intense Tesla globe, of the kind with which the defense could \"service\" objects that had already penetrated a large midcourse globe, or aircraft approaching the defended area. Obviously the Soviet authorities were tracking the aircraft, and knew it was in the vicinity. It seems logical, then, that they deliberately placed the brightly glowing ball beneath the aircraft so that the pilot and crew could not fail to observe it. The strange message to the pilot was simply designed to increase the intensity of the stimulus. The stimulus was to be something like, \"The Soviets are doing something in research and development that allows them to create intense balls of glowing light at a distance, and place these objects in and around the air in and around aircraft, possibly to intercept them.\" The purpose, of course, was to observe the British governments reaction after the incident was reported by the pilot upon his arrival in London. Again the reaction of the British -- and the U.S. as well -- was as predicted. Again we showed that we knew nothing of scalar electromagnetic weapons, and did not recognize one when we encountered its effects. --TERMINAL ABM SYSTEM-- Very neat things can be done if one \"nests\" several Tesla shields -- say three or four -- concentrically, one inside the other. In that case even the nuclear radiation (such as gamma rays) from a defense-suppressive high altitude nuclear burst can be handled. For example, suppose three such concentric shields are placed over a large vital area. Further, suppose a high altitude nuclear burst is placed above the outer shield. Gamma radiation almost instantly strikes the plasma in the outer shell, where it is absorbed, scattered, and re-radiated at a lower temperature. (That after all is what plasmas do.) Inside the first shell, the scattered radiation is now in the x-ray and ultra violet region. Let us track the most lethal component, the x-rays. The scattered x-rays then strike the second plasma shell, and are absorbed scattered and re-radiated at a lower temperature. Inside the second shell the scattered radiation is now in the visible and infrared region, with a little ultraviolet. This optical radiation in turn strikes the third plasma shell, and is absorbed scattered and re-radiated at still lower temperature. Inside the third shell, most of the energy is now in the form of radio frequency (RF) energy, with a little IR and visible band spectral energy content. At this point, ordinary electromagnetic interference (EMI) shielding of electronic equipment on the ground inside the third shield can take care of any RF interference resulting from the emergent RF noise. As can be seen, three shells are sufficient to convert the gamma and x-ray radiation (and ultraviolet and infrared) mostly to harmless RF energy before all three shells are penetrated. Thus the tactic of deliberate defense suppression by a preliminary high altitude nuclear burst can be countered by multiple Tesla shields. In addition, of course, any ordinary vehicles penetrating all three shields are exposed to successive violent EMP's and are almost certainly electrically dudded. The vehicles are also subjected to multiple periods of intense heating, so combustibles, fuels, explosives, and ablatives are destroyed. In addition, metal structures may be melted or vaporized. Think of it this way: anything which hits one of these Tesla shields goes phhht! Just like a bug hitting an electrified bugkiller screen. For years passing ships have observed and reported such multiple-shield \"light phenomena\" over remote regions of the ocean. U.S. intelligence has routinely not paid any heed to \"lights at night\" over remote ocean areas, and so Soviet tests in this manner have remained relatively unnoticed by officialdom... --WOODPECKER BEAMS INTERSECT OVER NORTH AMERICA-- In July 1976 the U.S. received very special Bicentennial greetings from the Soviet Union. At that time, communications systems of the world in the 3-30 megaHertz band suddenly met substantial interference from extremely powerful, chirped Soviet transmitters which were suddenly activated. These transmitters continue their transmission to this day. Estimates of the power of these transmitters vary, but figures range as high as several hundred megawatts, with a nominal figure being 100 megawatts. These powerful transmitters were properly nicknamed \"Woodpeckers\" because of the characteristic sound of the chirped signal when received. That is, the received signal makes a \"pecking\" sound much like a woodpecker's beak hitting a block of wood. Several nations protested, but the powerful signals have continued, right down to this day. The only Soviet response was to add a \"spread spectrum\" capability, so that the transmitter would not dwell too long on one specific frequency, but shifted periodically to other frequencies. These transmitters have apparently never been precisely located by U.S. intelligence, but their beams carry much of the characteristics of an over- the-horizon (OTH) radar. They have been dubbed OTH radars by U.S. intelligence, and can without question perform that mission, in addition to some very interesting missions that U.S. intelligence does not assess. \"Soviet Military Power\", Department of Defense, 1985, p.45 shows the direct intersection over the United States of the Woodpecker radar beams used in an OTH role. In addition, shown is an additional \"scanner\" beam which can be scanned across the intersection \"grid\" over the U.S., formed by waveform interference of two main Woodpecker beams. First, they can be used in a conventional OTH radar mode, since their beams follow the earth-ionosphere waveguide and curve around the earth. In this mode they can detect missiles at launch and thereafter, and strategic bombers at launch and thereafter. These scalar interference grid weapons can be used to biologically attack entire populations in a targeted area. This aspect is not covered in this briefing. Suffice it to say that phase locked ELF modulation signals of 10 Hz and less are often detected on multiple woodpecker frequencies simultaneously. In a target area, this modulation -- is sufficiently stronger than the Schumann resonance of the earth's magnetic field -- will entrain a percentage of the brains into \"forced entrainment\". In that case, these human brains are \"synchronized\" to the Woodpecker signals so that multiple coherent frequencies are phase-locked into them. That is, multiple coherent EM channels directly into these entrained brains now exist. At that point, Fourier expansions may now be used to attack specific portions of the brain geometrically. In addition, scalar EM disease patterns can be modulated upon the carriers, again with fourier expansions. Specific biological effects can be induced in the entrained populations at will, limited only by the state of the art of the Soviet technology used to attack them. Possible effects include instantaneous death, heart seizure, severe emotional disruption, loss of control of internal functions, diseases, disabling of the immune system, and even implantation of thoughts, emotions, and ideas which are interpreted by the subjects as their own. While further discussion of this area is beyond the scope of my knowledge, the biological aspects of the Woodpecker transmitters are horrible. It suffices to say that, in thousands of experiments, Kaznacheyev demonstrated that almost any kind of cellular death and disease pattern could be electromagnetically transmitted. Kaznacheyev reported the effect in the near ultraviolet. Experimenters at the University of Marburg in West Germany duplicated the experiments in the infrared. The bottom line is that photons themselves can carry death and disease patterns between cells. Scalar EM technology allows synthesis of the actual potential pattern (which after all represents total control of charge and charge distribution, hence biochemistry in the cell) of a particular disease or death mechanism. Symptoms (and cellular death from them!) of nuclear radiation, chemical poisoning, bacterial infection, and other mechanisms were induced by the Kaznacheyev experiments. Dr. Popp of West Germany has published an analysis of the virtual photon master control system of the cells. Since scalar EM represents the deliberate ordering of virtual particle flux into deterministic patterns, the master control system can readily be entered with scalar techniques to induce disease and disorder at will... U.S. Air Force Linked to Electronic Warfare Attack in Tennessee HARTSVILLE, TENN - Newly released documentary and eyewitness evidence now links an apparent July 6, 2001 electronic warfare attack on a radio station and weekly newspaper in Hartsville, Tennessee to a nearby unacknowledged secret access project (USAP). This secret project, eyewitnesses say, includes the U.S. Air Force as paymaster, U.S. government aircraft as transportation and security craft; military troops in black uniforms; and black unmarked triangular aircraft. The project may also include a secret electronic warfare unit capable of disabling nearby media outlets with destructive electromagnetic energy. It has now known that an official U.S. Air Force cheque was used to pay for the clandestine installation of massive telephone switching equipment at a defunct Tennessee Valley Authority nuclear power plant about five miles from the target media outlets. The private contractor who installed the unusually large switching system at a former nuclear power plant that is still officially defunct reported this to the WJKM investigators on condition of anonymity. Historically, the U.S Air Force has pioneered in the development and use of electronic warfare against civilian targets and populations, notably in the NATO war in Yugoslavia. Speaking to a live radio audience on July 21, WJKM general manager Ted Randall for the first time publicly released the results on his station's official on-going investigation of the attack. Dan Fluehe and Matt Aaron of WJKM, radio host Clyde Lewis along with this reporter, Alfred Webre, participated in the radio program. WJKM's investigation has eliminated other possible causes of the electromagnetic blast, such as power transformer malfunction caused by birds or internal mechanical problems. Centrexnews reporter Joel Skousen, who initially reported that birds caused the electronic attack, declined to participate in the radio program. Although the nuclear facility has been officially closed for some time, eyewitnesses now testify to clandestine activities going on at the site. These include sightings of tractor-trailer trucks entering and leaving the former nuclear power plant at 2 or 3 AM; sightings of C-130 military aircraft flying over the facility as if to land; sightings of unmarked black helicopters monitoring the area; sightings of military troops in unmarked black uniforms; and - yes - multiple witness reports of black triangular craft hovering over the former power plant. Civilians venturing near the site have also reported being aggressively ejected by a private police force of about 30 plain-clothes men. Randall presented live and audiotaped eyewitness testimony of the destructive effects of the electronic attack, including a tell-tale flashing blue pulse that accompanied the destruction, and usually accompanies the discharge of electromagnetic pulse weapons. He also presented audio recordings of the audible electronic hum that accompanied the alleged attack, a clear electronic signature of an electromagnetic weapon attack. The accompanying surges during the event fit the pattern of an electronic attack. According to WJKM, \" These surges are not just coming into the power lines. They are also entering the radio station through phone lines and the antenna system. This is evident in blown telephone equipment. Sometimes the equipment is not destroyed but the program settings are scrambled or wiped out.\" On the air, Randall described photographs of dead, electronically- fried birds that littered a mile-square area around the radio station, now posted on the station's Internet website at http://www.1090wjkm.com/ Randall stated that local residents are experiencing adverse health effects. Randall said, \"It is also interesting that according listeners have called in, there has apparently been an increase in what they are calling fibromyalgia. This is a disease name appointed to the unexplainable severe and disabling pain throughout the entire body over recent years, as well as, an increase in headaches mimicking migraines that are not actual migraines.\" Randall documented the 2.4 Richter underground seismic earthquake that struck the area on July 7, the day after the electronic attack, from 10-10:30 PM. Randall also posted the HAARP magnetometer readings on the WJKM website for the two days - July 6 and July 7. Both the electronic attack and the unusual earthquake were accompanied by massive, anomalous bursts of electromagnetic pulse energy from HAARP, the U.S. Navy's electromagnetic pulse military facility and possible environmental weapons system in Gakona, Alaska. Coincidentally (and perhaps causally) HAARP's magnetometer showed massive spikes of electromagnetic energy for both days. According to Randall, \" At about 10:45 AM Friday [July 6], radio station WJKM and CMR (Country Music Radio), with studios in Hartsville, Tennessee was knocked off the air by a very powerful strange energy blast! There was a crystal clear blue sky, no clouds or rain. It was not lightning\" According to WJKM, in the attack, \"All the radio station's lines were knocked out. Several power transformers were blown several blocks away from the studios (smoke seen billowing out of one). All phone lines at the newspaper (The Hartsville Vidette), the local farm co-op and all other phones in this small radius were knocked out! Radio station transmitter lost all MOSFETS and the output - tuning network. All computers at WJKM lost motherboards, network cards etc. ISDN was knocked out. Most all the equipment Zephyr codec and EAS all knocked out.\" These effects on radio transmission systems closely resemble the effects on urban radio, television, power transmission and generation facilities attacked by U.S. Air Force electronic bombing in electronic warfare missions in recent military operations worldwide, including Yugoslavia and Iraq. How and why was electronic warfare carried out in rural Tennessee? From the known profile of electronic weaponry, the electronic attack upon WJKM appears to have been caused by a tactical electromagnetic weapon, emitting a directed electromagnetic plasma, beam, pulse, etc. at the target. Electronic weapons with this capability are known, and can be land mounted in a facility like the former power plant, Mounted in portable facilities like vans, trucks, helicopters or airplanes. Electronic weapons may even be space-based, on satellite platforms. This reporter has personally met with an Assistant Secretary of Defense at the Pentagon who confirmed the existence of such secret space-based weapons as early as 1977. An alternative electronic warfare delivery system may involve newly constructed relays for the HAARP installation in Alaska. The potential tactical electronic warfare applications of HAARP are under investigation. Serious public interest researchers maintain that HAARP's electromagnetic energy may cause effects such as earthquakes, such as occurred on July 7 in Hartsville. Electromagnetic weapons have been used in tectonic warfare, intentionally causing earthquakes. Electromagnetic pulse energy accompanies most earthquakes. Research shows that ultra low frequencies emitted by the HAARP installation may affect the human limbic system, and be used for mood management and mind control. The close resemblance of the Hartsville attack to other U.S. Air Force electronic warfare led to speculation that radio station WJKM may have been chosen as a test target for a clandestine electronic warfare unit located within the power facility, or to which the power facility serves as electronic relay point. The likelihood that the electronic attack was accidental, rather than an intentional military test, is low, given that the targets were media outlets. One purpose of such test could be to evaluate the physical impact of electronic warfare on U.S. domestic radio installations, a well as the impact of intimidating the local community, as well as the U.S. media reporting of such attacks. The U.S. military has a long history of secretly testing weapons on its unsuspecting civilian population, a practice that is illegal. Randall, Dan Fluehe, Clyde Lewis, and this reporter, Alfred Webre, all noted that the electronic attacks targeted two media offices directly - a radio station and a newspaper - both protected entities under the First Amendment of the U.S. Constitution. Another clue to the motive behind the disinformation attacks may lie in eyewitness accounts of military troops in black uniforms, wearing light blue patches, and military vehicles bearing license plates with the letters \"UN\" on them. This scenario would be consistent with a disinformation mission, in which United States government troops would be disguised with mock United Nations insignia in order to spread propaganda rumours regarding the actual source of this state terror. In fact, it would appear that U.S. paramilitary troops are carrying out military attacks on the U.S. civilian population. This modus operandi has been characteristic of Central Intelligence Agency sponsored warfare in developing countries, notably Guatemala. Randall indicated that station WJKM and its parent corporation are pursuing an official investigation of the electronic attack, including surveillance of activities at the former TVA power plant. The U.S. Congress has legislative oversight over the many federal agencies that may be involved in this secret project, including the U.S. Air Force, the Tennessee Valley Authority, and other defense \"black budget\" agencies. Asked if his company intended to contact its members of Congress to seek a congressional investigation, Randall responded that WJKM is taking this attack and its investigation most seriously. WJKM's Congressperson is Bart Gordon, Dean of the Tennessee Delegation, and currently serving his ninth term in Congress, representing the Sixth District, which includes 15 Middle Tennessee counties. U.S. Air Force Linked to Electronic Warfare Attack in Tennessee \n\nBy Alfred Webre, EcoNews Service (Vancouver, BC) \n\nhttp://www.ecologynews.com/cuenews31.html \n\nHARTSVILLE, TENN - Newly released documentary and eyewitness evidence now links an apparent July 6, 2001 electronic warfare attack on a radio station and weekly newspaper in Hartsville, Tennessee to a nearby unacknowledged secret access project (USAP). This secret project, eyewitnesses say, includes the U.S. Air Force as paymaster, U.S. government aircraft as transportation and security craft; military troops in black uniforms; and black unmarked triangular aircraft. The project may also include a secret electronic warfare unit capable of disabling nearby media outlets with destructive electromagnetic energy. It has now known that an official U.S. Air Force cheque was used to pay for the clandestine installation of massive telephone switching equipment at a defunct Tennessee Valley Authority nuclear power plant about five miles from the target media outlets. The private contractor who installed the unusually large switching system at a former nuclear power plant that is still officially defunct reported this to the WJKM investigators on condition of anonymity. Historically, the U.S Air Force has pioneered in the development and use of electronic warfare against civilian targets and populations, notably in the NATO war in Yugoslavia. Speaking to a live radio audience on July 21, WJKM general manager Ted Randall for the first time publicly released the results on his station's official on-going investigation of the attack. Dan Fluehe and Matt Aaron of WJKM, host Clyde Lewis along with this reporter, Alfred Webre, participated in the radio program. WJKM's investigation has eliminated other possible causes of the electromagnetic blast, such as power transformer malfunction caused by birds or internal mechanical problems. Centrexnews reporter Joel Skousen, who initially reported that birds caused the electronic attack, declined to participate in the radio program. Although the nuclear facility has been officially closed for some time, eyewitnesses now testify to clandestine activities going on at the site. These include sightings of tractor-trailer trucks entering and leaving the former nuclear power plant at 2 or 3 AM; sightings of C-130 military aircraft flying over the facility as if to land; sightings of unmarked black helicopters monitoring the area; sightings of military troops in unmarked black uniforms; and - yes - multiple witness reports of black triangular craft hovering over the former power plant. Civilians venturing near the site have also reported being aggressively ejected by a private police force of about 30 plain-clothes men. Randall presented live and audiotaped eyewitness testimony of the destructive effects of the electronic attack, including a tell-tale flashing blue pulse that accompanied the destruction, and usually accompanies the discharge of electromagnetic pulse weapons. He also presented audio recordings of the audible electronic hum that accompanied the alleged attack, a clear electronic signature of an electromagnetic weapon attack. The accompanying surges during the event fit the pattern of an electronic attack. According to WJKM, \" These surges are not just coming into the power lines. They are also entering the radio station through phone lines and the antenna system. This is evident in blown telephone equipment. Sometimes the equipment is not destroyed but the program settings are scrambled or wiped out.\" On the air, Randall described photographs of dead, electronically-fried birds that littered a mile-square area around the radio station, now posted on the station's Internet website at http://www.1090wjkm.com/ Randall stated that local residents are experiencing adverse health effects. Randall said, \"It is also interesting that according listeners have called in, there has apparently been an increase in what they are calling fibromyalgia. This is a disease name appointed to the unexplainable severe and disabling pain throughout the entire body over recent years, as well as, an increase in headaches mimicking migraines that are not actual migraines.\" Randall documented the 2.4 Richter underground seismic earthquake that struck the area on July 7, the day after the electronic attack, from 10-10:30 PM. Randall also posted the HAARP magnetometer readings on the WJKM website for the two days - July 6 and July 7. Both the electronic attack and the unusual earthquake were accompanied by massive, anomalous bursts of electromagnetic pulse energy from HAARP, the U.S. Navy's electromagnetic pulse military facility and possible environmental weapons system in Gakona, Alaska. Coincidentally (and perhaps causally) HAARP's magnetometer showed massive spikes of electromagnetic energy for both days. According to Randall, \" At about 10:45 AM Friday [July 6], radio station WJKM and CMR (Country Music Radio), with studios in Hartsville, Tennessee was knocked off the air by a very powerful strange energy blast! There was a crystal clear blue sky, no clouds or rain. It was not lightning\" According to WJKM, in the attack, \"All the radio station's lines were knocked out. Several power transformers were blown several blocks away from the studios (smoke seen billowing out of one). All phone lines at the newspaper (The Hartsville Vidette), the local farm co-op and all other phones in this small radius were knocked out! Radio station transmitter lost all MOSFETS and the output - tuning network. All computers at WJKM lost motherboards, network cards etc. ISDN was knocked out. Most all the equipment Zephyr codec and EAS all knocked out.\" These effects on radio transmission systems closely resemble the effects on urban radio, television, power transmission and generation facilities attacked by U.S. Air Force electronic bombing in electronic warfare missions in recent military operations worldwide, including Yugoslavia and Iraq. How and why was electronic warfare carried out in rural Tennessee? From the known profile of electronic weaponry, the electronic attack upon WJKM appears to have been caused by a tactical electromagnetic weapon, emitting a directed electromagnetic plasma, beam, pulse, etc. at the target. Electronic weapons with this capability are known, and can be land mounted in a facility like the former power plant, mounted in portable facilities like vans, trucks, helicopters or airplanes. Electronic weapons may even be space-based, on satellite platforms. This reporter has personally met with an Assistant Secretary of Defense at the Pentagon who confirmed the existence of such secret space-based weapons as early as 1977. An alternative electronic warfare delivery system may involve newly constructed relays for the HAARP installation in Alaska. The potential tactical electronic warfare applications of HAARP are under investigation. Serious public interest researchers maintain that HAARP's electromagnetic energy may cause effects such as earthquakes, such as occurred on July 7 in Hartsville. Electromagnetic weapons have been used in tectonic warfare, intentionally causing earthquakes. Electromagnetic pulse energy accompanies most earthquakes. Research shows that ultra low frequencies emitted by the HAARP installation may affect the human limbic system, and be used for mood management and mind control. The close resemblance of the Hartsville attack to other U.S. Air Force electronic warfare led to speculation that radio station WJKM may have been chosen as a test target for a clandestine electronic warfare unit located within the power facility, or to which the power facility serves as electronic relay point. The likelihood that the electronic attack was accidental, rather than an intentional military test, is low, given that the targets were media outlets. One purpose of such test could be to evaluate the physical impact of electronic warfare on U.S. domestic radio installations, a well as the impact of intimidating the local community, as well as the U.S. media reporting of such attacks. The U.S. military has a long history of secretly testing weapons on its unsuspecting civilian population, a practice that is illegal. Another clue to the motive behind the disinformation attacks may lie in eyewitness accounts of military troops in black uniforms, wearing light blue patches, and military vehicles bearing license plates with the letters \"UN\" on them. This scenario would be consistent with a disinformation mission, in which United States government troops would be disguised with mock United Nations insignia in order to spread propaganda rumours regarding the actual source of this state terror. In fact, it would appear that U.S. paramilitary troops are carrying out military attacks on the U.S. civilian population. This modus operandi has been characteristic of Central Intelligence Agency sponsored warfare in developing countries, notably Guatemala. Randall, Dan Fluehe, Clyde Lewis, and this reporter, Alfred Webre, all noted that the electronic attacks targeted two media offices directly - a radio station and a newspaper - both protected entities under the First Amendment of the U.S. Constitution. Randall indicated that station WJKM and its parent corporation are pursuing an official investigation of the electronic attack, including surveillance of activities at the former TVA power plant. The U.S. Congress has legislative oversight over the many federal agencies that may be involved in this secret project, including the U.S. Air Force, the Tennessee Valley Authority, and other defense \"black budget\" agencies. Asked if his company intended to contact its members of Congress to seek a congressional investigation, Randall responded that WJKM is taking this attack and its investigation most seriously. WJKM's Congressperson is Bart Gordon, Dean of the Tennessee Delegation, and currently serving his ninth term in Congress, representing the Sixth District, which includes 15 Middle Tennessee counties. Alfred Webre, JD, MEd, was a member of the Governor's Emergency Taskforce for Earthquake Preparedness for the State of California, 1981-82. Was the Seattle-Vancouver earthquake triggered by environmental (electronic) war? U.S. Air Force Linked to Electronic Warfare Attack in Tennessee Alfred Webre, JD, MEd, was a member of the Governor's Emergency Taskforce for Earthquake Preparedness for the State of California, 1981-82 Was the Seattle-Vancouver earthquake triggered by environmental (electronic) war? http://www.ecologynews.com/cuenews12.html U.S. Air Force Linked to Electronic Warfare Attack in Tennessee http://www.ecologynews.com/cuenews31.html", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.1090wjkm.com/bird34b.jpg", "http://www.1090wjkm.com/bird44b.jpg", "http://www.1090wjkm.com/bird47b.jpg", "http://www.1090wjkm.com/npp071b.jpg", "http://www.1090wjkm.com/nppgal.htm", "http://www.1090wjkm.com/bird19b.jpg", "http://www.1090wjkm.com/nb02c.jpg", "http://www.1090wjkm.com/bird22b.jpg", "http://www.1090wjkm.com/bird23b.jpg", "http://www.1090wjkm.com/bird28b.jpg", "http://www.1090wjkm.com/bird29b.jpg", "http://www.1090wjkm.com/bird30b.jpg", "http://www.1090wjkm.com/bird31b.jpg", "http://www.1090wjkm.com/bird32b.jpg", "http://www.1090wjkm.com/bird44b.jpg", "http://www.1090wjkm.com/bird37b.jpg", "http://www.1090wjkm.com/bird34b.jpg", "http://www.1090wjkm.com/nb03.jpg", "http://www.1090wjkm.com/nb05.jpg", "http://www.1090wjkm.com/nb06.jpg", "http://www.1090wjkm.com/nb09.jpg", "mailto:webmaster@accessnashville.com", "http://www.1090wjkm.com/picgal.htm", "http://www.infowar.com/mil_c4i/mil_c4i8.html-ssi", "http://flashradar.50megs.com/FLASHHARTSVILLE.html", "http://www.ecologynews.com/cuenews31.html", "http://www.cyberspaceorbit.com/maserblasx.htm"], "authors": [], "publish_date": null}