{"result_id": "040033", "URL": "https://www.australiannationalreview.com/covid-19-deaths-and-injuries/ucsf-orders-their-doctors-to-ignore-covid-vaccine-injuries/", "timestamp": "2023-04-25 12:11:24 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.australiannationalreview.com/wp-content/uploads/2021/07/favicon-4-512x512-1-150x150.png", "canonical": "https://www.australiannationalreview.com/covid-19-deaths-and-injuries/ucsf-orders-their-doctors-to-ignore-covid-vaccine-injuries/", "encoding": "UTF-8"}, "image": null, "domain": "www.australiannationalreview.com", "title": "UCSF Orders Their Doctors to Ignore COVID Vaccine Injuries", "cleaned_text": "They don’t file VAERS reports either. That’s a violation of federal law. I had a bunch of questions for their media relations department, but they ghosted me. Here’s what I wanted to know.\n\nDr. Josh Adler is executive vice president and chief clinical officer at UCSF Health as well as vice dean for clinical affairs at the UCSF School of Medicine. I wondered if he would like to see these questions answered as well. So I asked him.\n\nYou know what that means, don’t you?\n\nThe questions I sent them\n• The UCSF Chief Medical Officer has issued a verbal directive that medical staff (doctors, nurses, techs, etc.) are specifically instructed NOT to associate the COVID vaccine to any injuries. So even if they believe the vaccine caused the injury they are NOT allowed to talk to the patient about it. Can you explain how this is in a patient’s best interest? World health authorities such as Karl Lauterbach, Federal Minister of Germany for Health, have publicly admitted that the rate of severe vaccine injury is 1 in 10,000 and the V-safe data in the US shows the rate of severe injury (requiring medical care) is actually 100X higher: 8 SEVERE INJURIES per 100 fully vaccinated people. So why is the UCSF medical staff forbidden to make an association??\n• I’ve been told that the staff are told not to ask if the person was recently vaccinated with the COVID vaccine because that would suggest to the patient that the COVID vaccine might have caused their medical condition. Is this true? So the patient must offer it to the doctor because the doctor isn’t allowed to ask? How does that improve clinical outcomes?\n• I’ve been told that 70% of the Radiology Department (in Marin specifically) requested and were granted religious exemptions after seeing what happened to people who received the COVID vaccine. If it wasn’t 70%, what is the number?\n• I’ve been told that the placentas of a majority of vaccinated women who give birth are not normal (calcified, blood clots, etc.). This started happening after the shots rolled out. Can you tell me what percentage was observed and why nobody at the hospital is speaking out to the press about this situation?\n• Most troubling to me is that I was not able to find anyone who currently works at UCSF (including doctors, nurses, and lab techs) who would talk to me on the record for fear of being fired. Why would these doctors and nurses have such a fear? Will you guarantee in writing that any staff member who speaks out about any of the points above will be protected and not be fired just for speaking out? Have you fired anyone for speaking the truth? Who?\n• With all the chatter about fear and intimidation tactics, have you issued WRITTEN assurances to the staff that 1) it is OK to ask about COVID vaccine status, 2) that it is OK to write vaccine exemptions when warranted such as allergic reactions, 3) that if they believe the vaccine caused an injury that they are free to talk about it with the patient and 4) that staff members who talk publicly about what they are seeing in the clinic with respect to vaccine-associated injuries/deaths and don’t violate any confidentiality/HIPAA rules will be protected from being fired? I want to know whether TRUE speech is protected and whether UCSF has notified staff of this in WRITING. If not, why not? Do fear and intimidation tactics yield better health outcomes?\n• My friend Tim Damroth told me he suffered a cardiac arrest 2 minutes after getting his first COVID shot. He was in such pain since the shot that his UCSF doctors prescribed a nerve block shot. But in order to get the nerve block shot, UCSF required him to be fully vaccinated (i.e., 2 shots)! He asked for a vaccine exemption, but the UCSF doctors told him that UCSF doesn’t allow them to write any vaccine exemptions, even for people who almost died after getting the shot. So Tim got another shot in order to get the medical care he needed but this made his pain much worse. Can you confirm whether COVID vaccination is still required to get certain medical care at UCSF? If it isn’t still required, when did the requirement end? Can you explain the rationale for requiring vaccination to give a shot? Do you deny treatment to people with life threatening conditions if they are not fully vaccinated? How vaccinated must they be to be treated? 2 shots? 3 shots? I just talked to Tim and he will be delighted to sign a HIPAA consent to allow UCSF to talk about his case and all his medical records publicly so everyone can learn what happened to him. Are you proud of the way he was treated? Do you have any regrets?\n• If you believe that COVID vaccine and masks are effective, why would you subject a patient to have to be vaccinated before receiving medical care? This is nonsensical in light of the Cleveland Clinic study which clearly showed that vaccines increase risk of getting COVID which would seem to put the staff at higher risk. You are clearly ignoring that study. On what basis? Nobody has been able to debunk the study. The precautionary principle of medicine requires that you hold off your vaccine requirement until you can resolve the ambiguity.\n• How many UCSF staff have died within 6 months of receiving a COVID vaccine shot? Were autopsies done? Did they do the histopathology studies to rule out the COVID vaccine as a cause of death? Can we see the slides?\n• How many UCSF staff have been seriously injured from the COVID vaccine?\n• Why didn’t any doctor at UCSF file a VAERS report on the vaccine injuries of <redacted>, Jan Maisel, and Angela Wulbrecht. This is required by law. <redacted> was a former Chief Medical Officer at UCSF. Maisel is Associate Clinical Professor of Pediatrics at UCSF. Wulbrecht was a top UCSF nurse. All of their injuries were required by law to be reported, yet no VAERS reports were filed. Why not? What are you doing to correct the problem?\n• UCSF ultrasound technicians with decades of experience have seen an unprecedented number of menstrual irregularities in women who have been vaccinated. Why aren’t any of them warning the public about this? Is the public better off if nobody knows about this?\n• I talked to one of the funeral homes used by UCSF. They are seeing a 20X higher rate of perinatal deaths after the COVID vaccines rolled out. This is a disaster. Why isn’t anyone saying anything about this? Why did the funeral director decline to be named for fear of being fired? Why isn’t UCSF just publishing the numbers to warn the community? How does keeping this information secret result in superior clinical outcomes?\n• Nearly all of the UCSF neurologists know that the COVID vaccines have caused serious injuries to huge numbers of UCSF patients. Can you explain why none of them are speaking out publicly about what they are observing in the clinic?\n• Why not make public health information from the hospital public? The information can be easily anonymized to protect privacy. Wouldn’t making medical records such as age/admission date/COVID vaccine dates/reason for admission be a huge public service? If the vaccine really works, everyone would know it. If the vaccine doesn’t work, everyone would know it. Why don’t we have data transparency?\n• Is anyone at UCSF calling for data transparency from the CDC? If the death-vax records were public, we could instantly know whether the shots are beneficial or harmful. Is there a reason these records are not public and nobody at UCSF is calling for these records to be made public? Do we get better health outcomes when the CDC keeps the data from public view? The data can be easily anonymized to satisfy any HIPAA requirements. I personally released a subset of the death-vax records from Medicare. So I know it can be done. Oh, and it showed the vaccine were causing an enormous amount of excess deaths.\n• How long do you think you can get away with hiding all these vaccine injuries from public view?\n• Is this really in the public interest to keep all this stuff secret and engage in fear and intimidation tactics? Is there a paper in a peer-reviewed medical journal showing superior patient outcomes when the public is kept in the dark about vaccine injuries?\n\nOn March 20 at 9:50pm I sent this email to Dr. Adler and cc’ed his assistant: These should be easy questions for UCSF to answer, but they are ducking my questions for some reason. I just can’t figure it out. I don’t want to spread misinformation, and I’ve offered to correct any questions if they will supply evidence that I’m wrong, but all I hear is silence. It’s not just me who wants answers to these questions. Pretty much all my readers want to know the answer too. More importantly, I’d guess that most of the people who work at UCSF would want to know the answer to these questions as well. But apparently UCSF management and the mainstream media don’t think any of these questions are important. I wonder if any members of the UCSF Health Leadership Team are curious about the answer to any of these questions. And if not, why not? Do all of them think secrecy is the best way to go? Which questions do they not want to have answered and why? I’ve emailed Dr. Adler and I hope he will respond. They can’t keep running from the truth. The longer they avoid answering these questions, the worse they look. Some day there will be accountability. You can bank on that.", "opengraph": {"locale": "en_US", "type": "article", "title": "Australian National Review - UCSF Orders Their Doctors to Ignore COVID Vaccine Injuries", "description": "UCSF Orders Their Doctors to Ignore COVID Vaccine Injuries By Steve Kirsch They don’t file VAERS reports either. That’s a violation of federal law. I had a bunch of questions for their media relations department, but they ghosted me. Here’s what I wanted to know. Dr. Josh Adler is executive vice president and chief clinical […]", "url": "https://www.australiannationalreview.com/covid-19-deaths-and-injuries/ucsf-orders-their-doctors-to-ignore-covid-vaccine-injuries/", "site_name": "Australian National Review", "article:published_time": "2023-03-21T09:55:16+00:00", "article:modified_time": "2023-03-21T09:56:14+00:00", "image": "https://www.australiannationalreview.com/wp-content/uploads/2023/03/UCSF-orders-their-doctors-to-ignore-COVID-vaccine-injuries.jpeg", "image:width": "800", "image:height": "425", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": ["ANR News"], "publish_date": "2023-03-21T09:55:16+00:00"}