{"result_id": "040009", "URL": "https://www.australiannationalreview.com/covid-19-deaths-and-injuries/more-vaccines-higher-infant-mortality/", "timestamp": "2023-04-25 12:10:18 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.australiannationalreview.com/wp-content/uploads/2021/07/favicon-4-512x512-1-150x150.png", "canonical": "https://www.australiannationalreview.com/covid-19-deaths-and-injuries/more-vaccines-higher-infant-mortality/", "encoding": "UTF-8"}, "image": null, "domain": "www.australiannationalreview.com", "title": "More Vaccines - Higher Infant Mortality", "cleaned_text": "This has now been confirmed and published in a peer-reviewed medical journal. The medical community will ignore it because that’s how science works: they ignore everything counter-narrative.\n\nWhoops! Perhaps it is now time to re-think all those childhood vaccines?\n\nCritique written by members of the Miller Lab at BYU: Infant Vaccination Does Not Predict Increased Infant Mortality Rate: Correcting Past Misinformation (NOT peer-reviewed and is now misinformation)\n\nReaffirmation of the original result: Reaffirming a Positive Correlation Between Number of Vaccine Doses and Infant Mortality Rates: A Response to Critics (peer-reviewed)\n\nA lot of vaccine activists immediately prior to the lockdowns predicted that the decline in infant vaccinations during the lockdowns would result in a decrease in SIDS and that ended up being exactly what happened.\n\nFor more on this:\n\nBecause that’s how science works at the CDC. If you go against the narrative, you are punished. That’s how they keep people in line with the narrative, no matter how absurd it is.\n\nWatch this talk about the chickenpox vaccine:\n\nWouldn’t it be great if issues like this were unambiguous?\n\nWouldn’t it be great if public data were actually “public” as el gato malo has suggested in this excellent Substack article:\n\nWashington State to make it illegal to question vaccines?\n\nIt might soon be illegal to question “vaccines” in WA state.\n\nCheck out this new proposed legislation.\n\nDuring the January 24, 2023 working session and public hearing on HB 1333, the ADL representative defined “extremist views” as including those that challenge whether masks and vaccines work. However, this interpretation is NOT codified in the bill which does NOT define what is covered.\n\nPBS Newshour already aired a 6 1/2 minute segment on this bill (when it hadn’t even gone through committee in the House yet) calling it “Model Legislation for the Nation.”\n\nDo you think the same association might be true for the COVID vaccines? Is it possible that the more vaccines, the more deaths? That’s what the data says.\n\nIsn’t it time we stop hiding the record-level data on mortality and vaccines for the COVID vaccines and release it publicly?\n\nThe CDC is keeping these vaccine-death records under wraps because they don’t want to create vaccine hesitancy. It makes sense; when everyone finds out that they were duped they are going to be pissed.\n\nBut sooner or later, one country is going to release the data and the cat will be out of the bag.\n\nAny state in the US could publicly release their vax/death records. It could even be released in any county as well.\n\nWhy is every county, state, and world government HIDING this data? It’s even hidden in Florida. It’s public information. It doesn’t benefit the public when it is kept under lock and key.\n\nRelease the data! What is everyone afraid of? The truth?\n\nNote that the “privacy” excuse is just that; an excuse. I point out that the data can be easily adjusted so that nobody can find even their own record without affecting any analysis.", "opengraph": {"locale": "en_US", "type": "article", "title": "Australian National Review - More Vaccines - Higher Infant Mortality", "description": "More Vaccines – Higher Infant Mortality By Steve Kirsch This has now been confirmed and published in a peer-reviewed medical journal. The medical community will ignore it because that’s how science works: they ignore everything counter-narrative. Executive summary Following a critique published on pre-print server by the Bailey Lab at BYU, whistleblower Gary Goldman and […]", "url": "https://www.australiannationalreview.com/covid-19-deaths-and-injuries/more-vaccines-higher-infant-mortality/", "site_name": "Australian National Review", "article:published_time": "2023-03-04T07:59:23+00:00", "article:modified_time": "2023-03-04T07:59:53+00:00", "image": "https://www.australiannationalreview.com/wp-content/uploads/2023/03/More-Vaccines-Higher-Infant-Mortality.jpg", "image:width": "1067", "image:height": "600", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "728", "height": "409", "embed_code": "<iframe loading=\"lazy\" title=\"Misadventures with the Chickenpox Vaccine, Gary Goldman, Ph.D.\" src=\"https://www.youtube.com/embed/9owLjgItcJU\" width=\"728\" height=\"409\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/9owLjgItcJU"}], "links": ["https://journals.sagepub.com/doi/10.1177/0960327111407644", "https://www.cureus.com/articles/134233-reaffirming-a-positive-correlation-between-number-of-vaccine-doses-and-infant-mortality-rates-a-response-to-critics#!/", "https://amidwesterndoctor.substack.com/p/a-century-of-evidence-has-accumulated?utm_source=substack&utm_campaign=post_embed&utm_medium=web", "https://boriquagato.substack.com/p/a-simple-proposal-to-restore-confidence/", "https://www.investmentwatchblog.com/washington-hb-1333-an-act-relating-to-establishing-the-domestic-violent-extremism-commission/", "https://www.pbs.org/newshour/show/how-a-washington-state-plan-to-fight-domestic-extremism-could-be-a-model-for-the-nation"], "authors": ["ANR News"], "publish_date": "2023-03-04T07:59:23+00:00"}