{"result_id": "040014", "URL": "https://www.australiannationalreview.com/health/please-help-stop-college-vaccine-mandates-by-filling-out-one-simple-form/", "timestamp": "2023-04-25 12:10:34 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.australiannationalreview.com/wp-content/uploads/2021/07/favicon-4-512x512-1-150x150.png", "canonical": "https://www.australiannationalreview.com/health/please-help-stop-college-vaccine-mandates-by-filling-out-one-simple-form/", "encoding": "UTF-8"}, "image": null, "domain": "www.australiannationalreview.com", "title": "Please Help Stop College Vaccine Mandates by Filling Out One Simple Form", "cleaned_text": "Please Help Stop College Vaccine Mandates by Filling Out One Simple Form\n\nI’m making a list of all college students in the US who died either from COVID or the COVID vaccine. Please help me compile that list. I haven’t heard of a healthy college student who died from COVID.\n\nI haven’t heard of any unvaxxed healthy college students who died from COVID. Not a single one. Have you?\n\nBut I have heard of college students who died from the COVID vaccine, including Shawn Kuhn who they claim died from COVID (he was fully vaccinated… hmmm…).\n\nIf you know (or know of) a college student in the US who died from COVID or the COVID vaccine, please fill out this form.\n\nI want to make sure I cover students like the tragic death of Simone Scott who was one of the first COVID vaccine horror stories I read about. I am hoping someone who knows her will report this.\n\n19-year-old Simone Scott died shortly after her second shot. She was required to be vaccinated to attend Northwestern. The colleges are killing their students. Please don’t let them continue to get away with this.\n\nTo avoid duplicate entries, please check here first to see if the name is already reported.\n\nIt will be interesting to compare the COVID death rates for colleges with NO vaccine mandate vs. the vaccine death rates for colleges with a vaccine mandate, wouldn’t it?\n\nNext step: We run op-eds in all student newspapers formally requesting a RECORDED zoom meeting with the committee who decided on the policy to discuss how they defend their policy in light of this data.", "opengraph": {"locale": "en_US", "type": "article", "title": "Australian National Review - Please Help Stop College Vaccine Mandates by Filling Out One Simple Form", "description": "Please Help Stop College Vaccine Mandates by Filling Out One Simple Form By Steve Kirsch I’m making a list of all college students in the US who died either from COVID or the COVID vaccine. Please help me compile that list. I haven’t heard of a healthy college student who died from COVID. Executive summary […]", "url": "https://www.australiannationalreview.com/health/please-help-stop-college-vaccine-mandates-by-filling-out-one-simple-form/", "site_name": "Australian National Review", "article:published_time": "2023-03-14T07:51:09+00:00", "article:modified_time": "2023-03-14T07:59:34+00:00", "image": "https://www.australiannationalreview.com/wp-content/uploads/2023/03/Please-Help-Stop-College-Vaccine-Mandates-by-Filling-Out-One-Simple-Form.jpg", "image:width": "800", "image:height": "418", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://airtable.com/shrih08NgIfjLVLYR", "https://twitter.com/AlexBerenson/status/1404408955149991939?s=20", "https://airtable.com/shrv7GSsy0Qsf2zpS"], "authors": ["ANR News"], "publish_date": "2023-03-14T07:51:09+00:00"}