{"result_id": "040024", "URL": "https://www.australiannationalreview.com/health/restoring-trust-in-public-health/", "timestamp": "2023-04-25 12:10:59 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.australiannationalreview.com/wp-content/uploads/2021/07/favicon-4-512x512-1-150x150.png", "canonical": "https://www.australiannationalreview.com/health/restoring-trust-in-public-health/", "encoding": "UTF-8"}, "image": null, "domain": "www.australiannationalreview.com", "title": "Restoring Trust in Public Health", "cleaned_text": "On Thursday, April 13, the Australian Medical Professionals’ Society will be hosting an event in New South Wales to discuss how we .\n\nCan there be trust in public health without access to truth, without honourable conduct, and without integrity? And what happens when our medical, bureaucratic, political, journalistic, and legal authoritarians appear to be bereft of the character traits that create trust? What do you do when there seems to be no avenue for recourse to demand transparency in decision-making, data accountability, and justice for bad decisions? How do we rebuild trust in public health when those with all the power seem to bear no responsibility for the outcomes of their actions or lack thereof? As said, ‘It is hard to imagine a more stupid or more dangerous way of making decisions than by putting those decisions in the hands of people who pay no price for being wrong.’\n\nTrust, according to the Oxford English Dictionary, is a firm belief in the honesty, veracity, justice, and strength of a person or thing.\n\nTruth is the body of real things, facts. Honour is to have a keen sense of ethical conduct and integrity. Integrity is a firm adherence to a code of especially moral incorruptible values.\n\nFor many, the time of Covid has created an immense sense of destabilisation, as our trust in these core values has been shattered almost beyond redemption. Medical ethical principles, evidence-based medicine, fundamental principles of public health, political due diligence, institutional regulation, and legal recourse have all been ignored or subsumed by a single focus of achieving consensus to maximise compliance. It has been compliance based on false and where those who have power appear to have declined to do even the basic level of due diligence by failing to read even their own reports .\n\nFrom lockdowns to natural immunity to infection fatality rates to vaccine safety and efficacy, the truth is being revealed, demonstrating a failure of integrity to for the health and safety of Australians. The gravest of failures are against and . Practitioners who across the country knew it would likely cost them careers, relationships, financial security, and reputation. But they did it anyway because they knew Covid public health policies would likely , creating physical, social, and economic effects nationally and internationally. These modern-day heroes have been censored, deplatformed, and punished for trying to lead authorities to the evidence.\n\nShould we trust those who pay no price for being wrong, or those who have made huge sacrifices in the pursuit of truth to save lives? As Dr , what builds trust in an institution? Intellectual freedom through open scientific discourse, or enforced adherence to the regime’s singular ‘truth’ under the threat of professional excommunication? To for medical ethics, and evidence-based medicine against the censorship industrial complex, a government behemoth that enforced their ‘message’ as the is an extraordinarily costly risk that has seen people go from prestige to food banks. Is there anything more honourable than refusing to compromise the truth fighting to protect humanity? Is there a better definition of integrity than doing what is right knowing how high a price might have to be paid?\n\nIt causes intense pain to moral people to be powerless to protect others. There is a great grief many feel as they have watched families fall apart. Jobs have been destroyed, future economic prosperity hampered, child development impaired, and mental health problems have rocketed. There have been unprecedented vaccine injuries, while deaths have gone unacknowledged, all unnecessarily. For the most part, all that was needed was due diligence and humility. Is there any justification for the head of the Department of Health to appear to be unaware of their own regulatory documents such as the ? Having read the non-clinical report and all the , Advisory Committee on , and it is difficult to understand how decisions were made and on what findings the ‘safe and effective mantra’ was based other than blind hope. Is it acceptable to impose policies onto an entire population when there is evidence that they are unscientific, lacking in conclusive data, and based on secret health advice all together resulting in a and economic catastrophe?\n\nWhat was the government’s definition of Covid public health success? Until the implementation of the coercive, mandatory lockdown and vaccination-only strategy, there was no pandemic of death. Yet we now find ourselves in just that, with increases in excess mortality not seen since the world wars. Shrouded in continued secrecy our authorities implemented authoritarian pandemic policies in complete contradiction of their . This behaviour, in my opinion, has cost lives. The consequences of the failures are difficult to ignore.\n\nThe truth of the damage done by the government’s unscientific and unjustified response to Covid is snowballing and the . The apparent media-and-government malfeasance has been laid bare through the release of the Twitter Files, the US Senate, the WhatsApp scandal, and the alleged collaboration between social media platforms, the WHO, and the White House.\n\nCourt-ordered Pfizer documents released and subsequently reviewed show what the population has been subjected to. The Emergency Use Authorisation (EUA) of the Pfizer-BioNTech Covid-19 Vaccine/BNT 162b2 was granted on the with identified. Based on this questionable trial data, we were told two ‘safe and effective’ shots would stop the virus and that society could return to normal; then it was three, then four, and now more. Pfizer admits that it did not test for transmission before the vaccine was first distributed. It has recently been revealed they tried to keep certain information withheld for 75 years. But Australians are expected to trust the regulator to ensure they keep the pharmaceutical manufacturers accountable…?\n\nThese experimental vaccinations, according to the ACV meeting minutes from January 2021, confirm that pregnant women are not included in any studies . It appears to me that there was no data on mRNA distribution and degradation, the toxicity of the Lipid Nanoparticle formulation was not specifically studied, and a range of other serious possibilities were insufficiently tested. This means all the ‘safe and effective’ propaganda was based on the repeated claims from regulatory reports that the components of COMIRNATY to pose a risk. Is it reassuring that an entire population’s health and that of the next generation is to be based on hopeful expectations not any actual conclusive data?\n\nWhile our political and bureaucratic elite may be slowly losing their grasp of biological reality, it is still fair to hope they believe women are not rodents. According to government reports, testing in rats was what the reproductive safety data were based on for the granting of provisional approvals. Novel genetic therapies were pushed on pregnant workers without exception under threat of job loss and the subsequent loss of ability to feed their children, without sufficient safety data. called this, ‘The most egregious violation of ethics in the history of medicine.’ We should add to this the pushing of these experimental injections onto who are at statistically zero risk from Covid.\n\nGovernment Covid policies have resulted in a great deal of harm the results of which continue to grow each day and cannot be ignored. Policies shrouded in secrecy, and enforced under threat, severe censure, and reprisal are now being revealed. The absence of transparency and accountability while medical ethical principles have been trashed shows how little value is placed on the incorruptible values of truth, honour, and integrity. We have been . Trust and confidence in authorities and institutions feels like it could be beyond repair. Nevertheless, there are numbers of Australians who believe in the power of truth, honour, and integrity and are willing to pay a huge price to stand by them.\n\nIt is these people across this nation, medical and non-medical alike, whose refusal to be silent once they become aware of the truth, who have the power to rebuild trust and heal the harm. They have sacrificed a great deal to take on a fight against the behemoth biopharmaceutical industrial complex. Truth matters, and without honour and integrity trust crumples. It is their fight that has created all the cracks in the dam wall that allowed the leaks that are now emerging.\n\nFor truth, for honour, and for integrity we in AMPS along with other people across the country question, speak, write, and run events, and campaign as we come together to save lives standing by the oath, ‘first do no harm’. Transparency of data and health advice, accountability for decisions, and open intellectual scientific freedom is what will restore trust in public health. :\n\nWe salute those people who have been courageous under pressure, speaking out in integrity against an unjust authoritarian health system. And as the realisation of what has happened spreads through our society, they might well be central in bringing back trust in it.", "opengraph": {"locale": "en_US", "type": "article", "title": "Australian National Review - Restoring Trust in Public Health", "description": "Restoring Trust in Public Health By Kara Thomas Character, in the long run, is the decisive factor in the life of an individual and of nations alike.’ – Theodore Roosevelt, 1900 On Thursday, April 13, the Australian Medical Professionals’ Society will be hosting an event in New South Wales to discuss how we restore trust in […]", "url": "https://www.australiannationalreview.com/health/restoring-trust-in-public-health/", "site_name": "Australian National Review", "article:published_time": "2023-04-11T07:55:29+00:00", "image": "https://www.australiannationalreview.com/wp-content/uploads/2023/04/Restoring-Trust-in-Public-Health.jpg", "image:width": "800", "image:height": "533", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": ["ANR News"], "publish_date": "2023-04-11T07:55:29+00:00"}