{"result_id": "040004", "URL": "https://www.australiannationalreview.com/covid-19-deaths-and-injuries/new-zealand-government-data-shows-that-the-covid-vaccines-make-you-more-likely-to-die-from-covid-not-less/", "timestamp": "2023-04-25 12:10:07 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.australiannationalreview.com/wp-content/uploads/2021/07/favicon-4-512x512-1-150x150.png", "canonical": "https://www.australiannationalreview.com/covid-19-deaths-and-injuries/new-zealand-government-data-shows-that-the-covid-vaccines-make-you-more-likely-to-die-from-covid-not-less/", "encoding": "UTF-8"}, "image": null, "domain": "www.australiannationalreview.com", "title": "New Zealand Government Data Shows that the COVID Vaccines Make You MORE Likely to Die from COVID (Not Less)", "cleaned_text": "New Zealand Government Data Shows that the COVID Vaccines Make You MORE Likely to Die from COVID (Not Less)\n\nWow. Finally, crystal clear government data shows the more you vax, the more likely you are to die from COVID. This is the OPPOSITE of what the US health authorities and the medical community told us.\n\nThe FOIA request does NOT ask for COVID-related deaths and the results provided were not age-stratified.\n\nTherefore, I am currently unable to replicate these results, even though the results are consistent with other data I have from other sources.\n\nClearly, the all-cause mortalities are up in New Zealand in 2022 vs. 2021 by 4,500 deaths. Yet there is a high vaccination rate (82% of the entire population of 5.123M people) which they claimed is why they only had 2,331 COVID deaths. So why so many all-cause deaths? Clearly there is something that is killing these people.\n\nIn the meantime, from this data and other data, the vaccine is, at best, a “do nothing” as far as death rate goes and the UK numbers show it decreases all-cause mortality for all age groups, so the conclusion that it is a bad intervention remains true no matter what.\n\nThe data shows that world governments are responsible for millions of excess deaths.\n\nNow you know the truth.\n\nThe CDC and the health authorities and medical community were all lying to you about the safety of the vaccine. The vaccines are doing exactly the opposite of what they said.\n\nThat’s what happens when you give advice based upon belief instead of reality. Had they embraced full data transparency since the start of the pandemic, we could have avoided all of this. Instead, they hid the records that we needed and urged everyone, including pregnant women and kids, to get vaccinated.\n\nHere’s a key graph in a larger size below. This is exactly the type of graph every country should be producing. But they aren’t for some reason. I wonder why?\n\nLet’s dive into the data sources cited in the figure above\n\nOn the Infoshare stats page, the graphic didn’t specify the stats. The interesting stats appear to be:\n\nNote that the 75-79 cohort is nearly 100% vaccinated and 90+ are 95% vaccinated.\n\nNote that the COVID cases started in New Zealand right after the boosters rolled out.\n\nCOVID-19 deaths started Feb 22, 2022 but most people were vaccinated before COVID came. Note how smooth the death rate is… COVID didn’t come in waves! A total of 2,331-48= 2,283 people died from COVID in 2022 in New Zealand.\n\nFrom this chart it appears that the vaccines might be slightly protective against dying from COVID.\n\nThis is 12 months ending in March of that year:\n\nIt’s much worse than these charts indicate\n\nWhat they don’t show you (because they only look at the risk of dying from COVID) is the rise in all-cause mortality and the number of people disabled and/or permanently injured from the shots. And they don’t show you the pregnancies that never happened, the 20X increase in perinatal deaths, or the dramatic drop in birth rates. So the chart shows an incomplete picture.\n\nIt turns out that the mortality and morbidity effects dwarf the negative impact on COVID deaths. But we don’t even have to go there to reject the vaccine.\n\nThe key point is that their claimed “key benefit” is not a benefit at all, but an increased risk. This makes it unconscionable for any doctor to support the vaccine.\n\nLatest data from the UK shows that the vaccines increase your risk of death\n\nClare Craig found the same thing that the vaccine started off as having no effect, but then graduated to killing off the population at a higher rate as time progressed.\n\nExcess deaths are happening all over Europe for some reason\n\nThe more you vax, the more likely you are to be infected with COVID and the more likely you are to die from COVID.\n\nBut it doesn’t stop there: these vaccines also increase all-cause mortality and morbidity.\n\nThe COVID vaccines are a disaster and should be immediately halted for all age groups.\n\nWhich is what I’ve been saying since May 25, 2021 when I published my first “anti-vax” article on TrialSiteNews.\n\nBut now you have crystal clear proof from the Cleveland Clinic (COVID infections increased) and the government of New Zealand (COVID deaths increased) that I was telling the truth.\n\nHow bad is the effect? Over 600,000 Americans have been killed by the COVID vaccines in America to date. I’ll be talking about 10 different ways to get to that number in an upcoming post.", "opengraph": {"locale": "en_US", "type": "article", "title": "Australian National Review - New Zealand Government Data Shows that the COVID Vaccines Make You MORE Likely to Die from COVID (Not Less)", "description": "New Zealand Government Data Shows that the COVID Vaccines Make You MORE Likely to Die from COVID (Not Less) By Steve Kirsch Wow. Finally, crystal clear government data shows the more you vax, the more likely you are to die from COVID. This is the OPPOSITE of what the US health authorities and the medical […]", "url": "https://www.australiannationalreview.com/covid-19-deaths-and-injuries/new-zealand-government-data-shows-that-the-covid-vaccines-make-you-more-likely-to-die-from-covid-not-less/", "site_name": "Australian National Review", "article:published_time": "2023-02-22T08:06:05+00:00", "article:modified_time": "2023-02-22T08:06:29+00:00", "image": "https://www.australiannationalreview.com/wp-content/uploads/2023/02/New-Zealand-government-data-shows-that-the-COVID-vaccines-make-you-MORE-likely-to-die-from-COVID-not-less.jpg", "image:width": "800", "image:height": "448", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://twitter.com/bronwyn_meikle/status/1627619442430730240?s=46&t=y1RMa7J0NNqXCK7AagEy0g", "https://www.health.govt.nz/covid-19-novel-coronavirus/covid-19-data-and-statistics/covid-19-case-demographics", "https://www.health.govt.nz/covid-19-novel-coronavirus/covid-19-data-and-statistics/covid-19-vaccine-data", "https://infoshare.stats.govt.nz/default.aspx?pxlD=f180eeb2-ed62-4cd5-9759-479819bf274e", "https://metatron.substack.com/p/england-deaths-by-vaccination-status", "https://stevekirsch.substack.com/p/very-large-cleveland-clinic-study"], "authors": ["ANR News"], "publish_date": "2023-02-22T08:06:05+00:00"}