{"result_id": "040022", "URL": "https://www.australiannationalreview.com/health/mrna-vaccination-of-animals-expected-to-begin-by-the-end-of-the-year/", "timestamp": "2023-04-25 12:10:56 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.australiannationalreview.com/wp-content/uploads/2021/07/favicon-4-512x512-1-150x150.png", "canonical": "https://www.australiannationalreview.com/health/mrna-vaccination-of-animals-expected-to-begin-by-the-end-of-the-year/", "encoding": "UTF-8"}, "image": null, "domain": "www.australiannationalreview.com", "title": "mRNA Vaccination of Animals, Expected to Begin by the End of the Year", "cleaned_text": "mRNA Vaccination of Animals, Expected to Begin by the End of the Year\n\nAll around the world countries will be launching a campaign to “Vaccinate” Billions of Pigs, Cows, Goats, and Sheep over a period of nine months\n\n This Massive task is an effort to “enhance the biosecurity system by improving animal immunity and eradicating epidemic diseases”\n\nThe campaign targets controlling many diseases like (PPR), foot-and-mouth disease (FMD), and crystal inflammation\n\n The production of a COVID-style mRNA vaccine is already underway Genvax Technologies is a startup dedicated to bringing advances in self-amplifying mRNA (saRNA) vaccine production to animal health and has secured $6.5 million in series seed funding from the United Animal Health.\n\n“As the World Health Organization progresses a new pandemic preparedness treaty, it is critical that governments seize the opportunity to invest in livestock systems to improve public health”\n\nA new One Health playbook offers governments worldwide the solutions.\n\nGenvax Technologies, a startup dedicated to bringing advances in self-amplifying mRNA (saRNA) vaccine production to animal health, has secured $6.5 million in series seed funding.\n\nUnited Animal Health led the financing with participation from Johnsonville Ventures, Iowa Corn Growers Association, Summit Agricultural Group and Ag Startup Engine. This investor coalition represents animal health, nutrition, feed, meat packers and consumer products in the fight against existing and emerging threats to the food supply chain.\n\n“The threat posed to producers and consumers by foreign animal diseases like African swine fever (ASF) and constantly mutating variants of swine influenza is extraordinary,” Joel Harris, CEO and co-founder of Genvax Technologies, said in a release. “The goal is to develop a vaccine that matches 100% to the specific strain when a disease outbreak occurs.”\n\nThis funding moves the company a step forward to USDA and international regulatory approval of its vaccines in anticipation of any foreign animal disease outbreak, Genvax said in a release.\n\n“For ASF, Genvax’s vaccine could be an important tool for eradication efforts and may alleviate any concerns with trading partners abroad. In addition, the financial and public support of multiple stakeholders like United Animal Health and others in the food industry is a huge validation of this technology’s promise,” Harris said in a release.\n\nThe company’s proprietary saRNA platform allows for rapid development of herd-specific vaccines matched 100% to the variant strain circulating in an animal-production operation. By inserting a specific transgene or “gene of interest” (GOI) matched to the variant strain into the platform, the saRNA can generate an antibody response without requiring the whole pathogen, Genvax explained.\n\n“United Animal Health sees Genvax and self-amplifying mRNA vaccines as the cutting edge of technology to protect the industries we serve,” Scott Holmstrom, Ph.D., senior vice president, research and development of United Animal Health, said in a release. “These technologies are critical to food security and protein availability. We are excited to be offering our innovation and research farms to work carefully with Genvax in developing these future products.”\n\nIn April 2022, Genvax received more than $145,000 in grant funding from the USDA-Agricultural Research Services Plum Island Animal Disease Center and the Foundation for Food and Agriculture Research (FFAR) to develop a saRNA vaccine for ASF virus. Genvax, founded in February 2021 by animal health serial entrepreneurs Joel Harris and Hank Harris, DVM Ph.D., has raised $1.9 million in a pre-seed round of funding, the release said, in addition to the USDA and FFAR grant.\n\nASF is a deadly virus of pigs that can cause up to 100% mortality in pigs and could decimate the income of U.S. pork producers and force layoffs, significantly reducing rural employment. Economic models estimate the worst case scenario of an ASF outbreak in the U.S. would result in a $50 billion loss to the domestic pig industry.\n\n“We’ve been impressed with Joel Harris and the Genvax team, in addition to the novel technology they are developing,” Kevin Ladwig, managing director of Johnsonville Ventures, said in a release. “As a stakeholder in the pork industry, we feel this is a necessary step in helping prepare for and protect against African swine fever and other emerging diseases.”\n\nNew ‘livestock-inclusive’ One Health agenda could help protect the world against pandemic diseases\n\nA new One Health playbook offers governments around the world 18 practical ways to improve livestock systems in developing countries that will unlock benefits for global health and development.\n\nA “livestock-inclusive” One Health agenda focused on seven key areas in the Global South would help protect the whole world against pandemic diseases, according to the brief from the International Livestock Research Institute (ILRI).\n\nAround three-quarters of emerging infectious diseases in humans have their origins in wild and domestic animals, and – before the Covid-19 pandemic – animal-borne diseases almost exclusively affected people in low-income countries. Just 13 of the 200 known zoonotic diseases cause 2.2 million deaths a year, mostly in developing nations.\n\nScientists at ILRI highlighted how investments into healthier and sustainable livestock systems in developing countries would benefit the three interconnected areas of “One Health”: animal, human and environment, and reduce the risk of disease spillovers.\n\nThe recommendations include increasing the availability and uptake of livestock vaccines to reduce the threat of cross-species disease outbreaks, raising public awareness of the precautions needed to limit disease spread, and improving food hygiene and safety standards at informal markets.\n\n“Healthy livestock mean healthy people and environments, which not only enables low-income countries to sustainably grow their economies but also improves global health security, minimizing the risk of disease outbreaks that spread worldwide.”\n\nThe brief, which comes ahead of the next meeting to discuss an international “pandemic prevention treaty”, also highlights the importance of improving early detection of emerging zoonotic infections in animals both to protect the livelihoods of the poorest and to prevent pandemics in people. One such disease is Middle East Respiratory Syndrome Coronavirus (MERS-CoV), a virus that is transmitted by camels, which are becoming increasingly popular in countries such as Kenya for their climate resilience.\n\nScientists at ILRI and partners have started enhanced surveillance of MERS in camels both to provide a better understanding of camel diseases and to get ahead of potential outbreaks in people, which could develop into another pandemic.\n\n“As the World Health Organization progresses a new pandemic preparedness treaty, it is critical that governments seize the opportunity to invest in livestock systems to improve public health,” said Hung Nguyen-Viet, co-leader of Animal and Human Health Program at ILRI.\n\n“Tackling zoonotic diseases at source would dramatically reduce the number of human illnesses and deaths while saving trillions of dollars in future epidemic or pandemic control.”\n\nIn addition to preventing pandemics, livestock-based One Health approaches can also contribute to healthier ecosystems, particularly when applied to mixed crop and livestock systems. In such systems, crop residues provide animal feed while animals provide organic fertilizer to maintain soil health, as well as traction and income that in turn can be reinvested into crop production.\n\nSimilarly, healthier livestock systems also increase the resilience of communities and economies, leaving rural populations less susceptible to hunger, malnutrition and ill-health. Some 70 per cent of the world’s 1.4 billion people living in extreme poverty depend on livestock for a living. Improving productivity through smarter feeding, farmer training and rangeland management can allow herders to get more from their animals, leading to higher incomes, more nutritious diets and better health prospects.\n\n“As we saw with the Covid-19 pandemic, health vulnerabilities and threats in one part of the world can quickly spread and impact the entire global population,” added Dr Smith.\n\n“Livestock’s prevalence in developing countries makes them a unique vehicle through which to improve the lives of the most vulnerable, and in doing so, protecting health gains the world over.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Australian National Review - mRNA Vaccination of Animals, Expected to Begin by the End of the Year", "description": "mRNA Vaccination of Animals, Expected to Begin by the End of the Year All around the world countries will be launching a campaign to “Vaccinate” Billions of Pigs, Cows, Goats, and Sheep over a period of nine months This Massive task is an effort to “enhance the biosecurity system by improving animal immunity and eradicating epidemic […]", "url": "https://www.australiannationalreview.com/health/mrna-vaccination-of-animals-expected-to-begin-by-the-end-of-the-year/", "site_name": "Australian National Review", "article:published_time": "2023-03-21T08:01:29+00:00", "image": "https://www.australiannationalreview.com/wp-content/uploads/2023/03/Untitled1-6.jpg", "image:width": "800", "image:height": "418", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.porkbusiness.com/news/industry/genvax-technologies-secures-65-million-advance-novel-vaccine-platform", "https://www.news-medical.net/news/20220718/New-livestock-inclusive-One-Health-agenda-could-help-protect-the-world-against-pandemic-diseases.aspx"], "authors": ["ANR News"], "publish_date": "2023-03-21T08:01:29+00:00"}