{"result_id": "040013", "URL": "https://www.australiannationalreview.com/covid-19-deaths-and-injuries/new-study-links-c0vid-vaxxines-to-25-increase-in-cardiac-arrest-for-both-males-females/", "timestamp": "2023-04-25 12:10:31 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.australiannationalreview.com/wp-content/uploads/2021/07/favicon-4-512x512-1-150x150.png", "canonical": "https://www.australiannationalreview.com/covid-19-deaths-and-injuries/new-study-links-c0vid-vaxxines-to-25-increase-in-cardiac-arrest-for-both-males-females/", "encoding": "UTF-8"}, "image": null, "domain": "www.australiannationalreview.com", "title": "New Study Links C0VID Vaxxines to 25% Increase in Cardiac Arrest for Both Males & Females", "cleaned_text": "New Study Links C0VID Vaxxines to 25% Increase in Cardiac Arrest for Both Males & Females\n\nStudy based on data from emergency services. COVID infection itself not linked to significant increase in cardiovascular complications.\n\nA new study by Israeli researchers and published in Nature has revealed an increase of over 25 percent in cardiovascular-related emergency calls in the young-adult population, following the rollout of COVID vaccines, among both males and females. No similar increase was found due to COVID infection alone.\n\nIsrael health authorities and the U.S. Centers of Disease Control (CDC) have acknowledged a link between COVID vaccines and specific cardiovascular complications. The risk of myocarditis after receiving a second vaccine dose is now estimated to be between 1 in 3000 to 1 in 6000 in men aged 16 to 24.\n\nRecent articles in scientific journals, however, have sought to suggest that cardiovascular complications following COVID infection are more common than those following vaccination. This assertion is contradicted by the findings from a recent study conducted by Israeli researchers, using data from Israel National Emergency Medical Services (EMS) related to “cardiac arrest and acute coronary syndrome EMS calls in the 16–39-year-old population” between 2019 and 2021. This enabled them to compare baseline (pre-COVID epidemic) to COVID epidemic without vaccines, to COVID epidemic following widespread vaccine takeup.\n\nAn increase of over 25% was detected in both call types during January–May 2021, compared with the years 2019–2020. That is to say, “increased rates of vaccination … are associated with increased number of CA [cardiac arrest] and ACS [acute coronary syndrome].” By contrast, the trial “did not detect a statistically significant association between the COVID-19 infection rates and the CA and ACS weekly call counts.”\n\nWhile the dangers of myocarditis for young males have gained widespread attention, this study found a larger increase in CA and ACS events among females that was linked to COVID vaccination.\n\nMyocarditis is known to be a “major cause of sudden, unexpected deaths in adults less than 40 years of age and is assessed to be responsible for 12–20% of these deaths,” the study’s authors note. They add that their findings have been mirrored by researchers in Germany and Scotland.\n\nThey caution that given these findings, “It is essential to raise awareness among patients and clinicians with respect to related symptoms (e.g., chest discomfort and shortness of breath) following vaccination or COVID-19 infection to ensure that potential harm is minimized.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Australian National Review - New Study Links C0VID Vaxxines to 25% Increase in Cardiac Arrest for Both Males & Females", "description": "New Study Links C0VID Vaxxines to 25% Increase in Cardiac Arrest for Both Males & Females By Y Rabinovitz Study based on data from emergency services. COVID infection itself not linked to significant increase in cardiovascular complications. A new study by Israeli researchers and published in Nature has revealed an increase of over 25 percent in cardiovascular-related […]", "url": "https://www.australiannationalreview.com/covid-19-deaths-and-injuries/new-study-links-c0vid-vaxxines-to-25-increase-in-cardiac-arrest-for-both-males-females/", "site_name": "Australian National Review", "article:published_time": "2022-06-02T07:13:05+00:00", "image": "https://www.australiannationalreview.com/wp-content/uploads/2022/06/New-study-links-COVID-vaccines-to-25-increase-in-cardiac-arrest-for-both-males-females.jpg", "image:width": "800", "image:height": "489", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": ["ANR News"], "publish_date": "2022-06-02T07:13:05+00:00"}