{"result_id": "040030", "URL": "https://www.australiannationalreview.com/covid-19-deaths-and-injuries/famous-pro-vaccine-doctor-suspects-pfizer-booster-shot-sent-his-cancer-into-overdrive/", "timestamp": "2023-04-25 12:11:16 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.australiannationalreview.com/wp-content/uploads/2021/07/favicon-4-512x512-1-150x150.png", "canonical": "https://www.australiannationalreview.com/covid-19-deaths-and-injuries/famous-pro-vaccine-doctor-suspects-pfizer-booster-shot-sent-his-cancer-into-overdrive/", "encoding": "UTF-8"}, "image": null, "domain": "www.australiannationalreview.com", "title": "Famous Pro-Vaccine Doctor Suspects Pfizer Booster Shot Sent His Cancer Into Overdrive", "cleaned_text": "Famous Pro-Vaccine Doctor Suspects Pfizer Booster Shot Sent His Cancer Into Overdrive\n\nAfter realizing his COVID-19 booster shot may have sent his cancer into overdrive, Michel Goldman, M.D., Ph.D., professor of immunology and pharmacotherapy at the Université libre de Bruxelles in Belgium, said going public with the information was the “right thing to do.”\n\nThis article was originally published by The Defender – Children’s Health Defense’s News & Views Website\n\nMichel Goldman, M.D., Ph.D., professor of immunology and pharmacotherapy at the Université libre de Bruxelles in Belgium, suspects his third dose of Pfizer’s COVID-19 vaccine may have sent his cancer into overdrive.\n\nGoldman, 67, is one of Europe’s best-known champions of medical research and a lifelong promoter of vaccines.\n\nBut he told The Atlantic he wants discussion of the COVID-19 vaccine to be transparent — so he went public about his suspicion that the Pfizer booster shot he received on Sept. 22, 2021, may have induced rapid progression of his angioimmunoblastic T-cell lymphoma (AITL), a type of lymphoma he’d been diagnosed with before he got the booster shot.\n\nAfter his diagnosis, Goldman said he rushed to get the booster shot, believing he would need it more than most people because once he started chemotherapy, his immune system would be compromised.\n\nBut after receiving the shot, Goldman’s follow-up CT scan showed something unexpected: Within only a few days, his cancer had grown so fast that cancerous points were lighting up all over his scan.\n\n“It looked like someone had set off fireworks inside Michel’s body,” The Atlantic reported.\n\nGoldman and his brother, Serge Goldman, a fellow scientist and head of nuclear medicine at the teaching hospital of the Université libre de Bruxelles, suspected Goldman’s COVID-19 booster shot may have triggered the rapid proliferation of cancerous growth in his body.\n\nThe initial CT scan had been “a bit disturbing,” Serge Goldman told The Atlantic, because it showed an asymmetrical cluster of cancerous nodes around Goldman’s left armpit, where Michel’s first two doses of vaccine had been delivered.\n\nThe CT scan done after Michel’s third dose showed the cancer’s asymmetry had flipped and was clustered by his right armpit, where he received the third shot.\n\nThe brothers knew it could be a mere coincidence, but they thought it was important to investigate the possibility that the vaccine might be behind the clustering — because it could mean other people with certain forms of cancer might be at risk of a COVID-19 vaccine causing their cancer to progress more rapidly.\n\nSo on Nov. 25, 2021, the brothers — who had written prior papers together — and other colleagues published a case report in which they described Michel Goldman’s experience and urged the scientific community to study the phenomenon to see if it occurred in patients diagnosed with AITL.\n\n“Since nucleoside-modified mRNA vaccines strongly activate T follicular helper cells, it is important to explore the possible impact of approved SARS-CoV-2 mRNA vaccines on neoplasms affecting this cell type,” the authors wrote.\n\nThe brothers said the case study “suggests that vaccination with the [Pfizer-BioNTech] BNT162b2 mRNA vaccine might induce rapid progression of AITL.”\n\nThey noted, however, that it would be “premature” to extrapolate the findings from Michel Goldman’s case to other patients with the same kind of cancer and that “dedicated studies are needed.”\n\nGoing Public Was ‘The Right Thing to Do’\n\nMichel Goldman’s case study added to the scientific literature that aims to understand the relationships between mRNA vaccines and the functioning of helper T-cells.\n\nFor instance, previous researchers have noted mRNA vaccines rev up helper T-cells, which may explain why Michel Goldman’s AILT went into overdrive following his third booster shot.\n\n“Perhaps the shots gave such a jolt to his helper T cells that they went berserk,” The Atlantic reported. “If they were prone to forming tumors, or if they were already cancerous, then overstimulation could have made the problem even worse.”\n\nResearch involving body scans of some people who get mRNA vaccines — including cancer patients — shows heightened activity in the lymph nodes near the armpit on the side where the shot was received.\n\nIn February 2018, a team of researchers at Columbia University’s Institute for Cancer Genetics published a study using mice with a pair of gene mutations — the same two mutations found in Michel Goldman’s tumor — showing that the mutations predispose T-cells to go rogue.\n\nThe study also showed that when the mice were injected with red blood cells from sheep — as an experimental stand-in for invading microbes — the mice developed the same subtype of lymphoma Michel Goldman had.\n\nMichel Goldman previously headed a $2 billion European endeavor to accelerate the research of new medicines and in December 2020, he publicly spoke out in support of the safety of mRNA vaccines — the technology used in both the Pfizer and Moderna COVID-19 vaccines.\n\nAt that time, he said the highest risk — especially for vulnerable people — is not to be vaccinated and that his main concern about mRNA vaccination was that people might use the possible side effects as an argument against getting the vaccine.\n\nHe currently leads the Institute for Interdisciplinary Innovation in Healthcare, or I3h, a university hub aimed at assisting in drug-design projects.\n\nMichel Goldman doesn’t regret going public with his case, even though it presented challenging evidence regarding the safety of mRNA vaccines for individuals such as himself.\n\n“I’m still convinced it was the right thing to do,” he told The Atlantic.\n\nHe remains adamant that COVID-19 vaccines are useful for the vast majority of people, but he is unsure whether he himself will get another booster dose.\n\n“I don’t know what I will do,” he said.", "opengraph": {"locale": "en_US", "type": "article", "title": "Australian National Review - Famous Pro-Vaccine Doctor Suspects Pfizer Booster Shot Sent His Cancer Into Overdrive", "description": "Famous Pro-Vaccine Doctor Suspects Pfizer Booster Shot Sent His Cancer Into Overdrive By Suzanne Burdick, The Defender After realizing his COVID-19 booster shot may have sent his cancer into overdrive, Michel Goldman, M.D., Ph.D., professor of immunology and pharmacotherapy at the Université libre de Bruxelles in Belgium, said going public with the information was the […]", "url": "https://www.australiannationalreview.com/covid-19-deaths-and-injuries/famous-pro-vaccine-doctor-suspects-pfizer-booster-shot-sent-his-cancer-into-overdrive/", "site_name": "Australian National Review", "article:published_time": "2022-10-03T08:18:08+00:00", "article:modified_time": "2022-10-03T09:52:20+00:00", "image": "https://www.australiannationalreview.com/wp-content/uploads/2022/10/Famous-Pro-Vaccine-Doctor-Suspects-Pfizer-Booster-Shot-Sent-His-Cancer-Into-Overdrive.jpg", "image:width": "800", "image:height": "533", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": ["ANR News"], "publish_date": "2022-10-03T08:18:08+00:00"}