{"result_id": "040038", "URL": "https://www.australiannationalreview.com/health/20-fold-increase-in-workers-in-uk-for-vaccine-damage-payment-program/", "timestamp": "2023-04-25 12:11:36 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.australiannationalreview.com/wp-content/uploads/2021/07/favicon-4-512x512-1-150x150.png", "canonical": "https://www.australiannationalreview.com/health/20-fold-increase-in-workers-in-uk-for-vaccine-damage-payment-program/", "encoding": "UTF-8"}, "image": null, "domain": "www.australiannationalreview.com", "title": "20 Fold Increase in Workers in UK for Vaccine Damage Payment Program", "cleaned_text": "Increasing demand for Covid vaccine injury payments has seen the number of staff processing claims increase 20-fold, figures show.\n\nThe Vaccine Damage Payment Scheme (VDPS) has scaled up operations and boosted its administrative staff from four to 80 to handle the claims.\n\nA project is also under way to digitalise the application process to make it simpler and quicker for claimants.\n\nBut MPs, campaigners and families have called for the process to be reformed, arguing that the payment cap of £120,000 is too low, too slow and bureaucratic, and the eligibility criteria is too strict.\n\nIf a person is left severely disabled as a result of receiving certain vaccines they could be entitled to the one-off payment from the Government.\n\nFamilies can also apply for the payment if a loved one died as a result of a vaccination.\n\nIt is not treated as compensation, meaning claimants can still seek damages in court.\n\nA group of patients and families are now taking legal action against AstraZeneca after they suffered injury or bereavement as a result of complications from the Covid vaccine.\n\nThe Hausfeld Claimant group, which includes 13 bereaved families and 28 survivors, says the VDPS offers “inadequate funds to families”.\n\nSarah Moore, leading the litigation, said: “No amount of compensation will bring back loved ones or restore those injured to health but it can make life a little bit easier for the mothers, fathers, children, parents and partners who are now reshaping their lives.”\n\nFigures released under a Freedom of Information (FOI) request in March show more than 4,000 claims related to a Covid-19 vaccine have been submitted since Nov 1 2021.\n\nThe payment scheme was taken over by the NHS Business Services Authority in November 2021, after previously being handled by the Department for Work and Pensions.\n\nOf the 4,017 claims made, 334 relate to a claimant who has died.\n\nSome 48 claims have been approved so far, Maria Caulfield, a health minister, told MPs in February.\n\nA separate FOI document published in February revealed 3,842 claims had been received, meaning the number submitted has increased by almost 200 in one month alone. Of those, 814 claims were unsuccessful and a further 37 did not meet the eligibility criteria.\n\nUnder the VDPS, severe disablement means a patient must be at least 60 per cent disabled to qualify, based on the Social Security (General Benefit) Regulations 1982.\n\nA patient’s medical records along with “all scientific evidence” will be considered in the application by an independent medical assessor.\n\nThey will decide if the person is due a payment based on whether “on the balance of probabilities” the vaccine caused the disability, and if the level of disability is 60 per cent.\n\nMany claimants have been diagnosed with vaccine-induced thrombocytopenia and thrombosis, a rare condition linked to the Covid-19 jab.\n\nThe number of people who experienced life-changing adverse reactions to coronavirus vaccines is tiny compared to the millions who received the jab.\n\nData from the Medicines and Healthcare products Regulatory Agency, up to Nov 23 2022, show 445 cases of major thromboembolic events (blood clots) with concurrent thrombocytopenia (low platelet counts) in the UK following an AstraZeneca jab. The overall case fatality rate was 18 per cent with 81 deaths.\n\nThe Government says it can take “at least six months” to process a VDPS claim, but a claim about a Covid-19 vaccine “will take longer”.\n\nJeremy Wright, Conservative MP for Kenilworth and Southam, raised the issue in the Commons this week and called on the Prime Minister to revamp the scheme.\n\nHe told The Telegraph: “It’s good news if they’re improving the resources to handle claims. There are a lot of claims and it’s taking a very long time to process them.”\n\nHe added there were still “structural problems” with the scheme, including the low cap and 60 per cent disablement cut off.\n\nRishi Sunak said on Wednesday: “We are taking steps to reform vaccine damage payments schemes by modernising the operations and providing more timely outcomes, but of course I’d be happy to talk to the honourable gentleman further about it.”\n\nThe Telegraph has spoken to families who have waited more than a year for the payment.\n\nSheila Ward, whose husband Stephen, 57, died after having the Covid vaccine, said the compensation scheme was “not fit for purpose”.\n\nHer husband, who was retired, had the Oxford AZ jab in March 2021. Mr Ward had no pre-existing conditions but after a few days developed a headache and had to stay in bed.\n\n“We just thought he had been doing too much,” said Mrs Ward, 55, who lives in Newcastle.\n\nWhen she went upstairs to check on him she found him unable to speak. He was taken to hospital where he was treated for a stroke. The doctors found bleeds and clots on his brain.\n\nLater Mrs Ward was told by doctors that her husband had suffered seizures. He died before he could receive an operation.\n\nA coroner’s certificate listed the vaccine as one of the causes of death but obtaining compensation took a year.\n\n“The whole process was very slow and they never gave me updates unless I chased them,” said Mrs Ward, whose claim was finalised in June 2022.\n\n“Personally, I don’t think the compensation families receive is enough. I’m in a fortunate position that my husband had a pension, so my income has been subsidised that way.\n\n“For anyone who has been left with a lifelong disability or young children, it simply wouldn’t be enough to replace somebody’s income.”\n\nMrs Ward said the Government should consider raising the cap but also make the process faster. “It is not fit for purpose,” she said. “I’ve heard of cases where it takes 20 months for a decision. That is far too long”.\n\nVikki Spit, 40, lost her partner Zion of 21 years in May 2021 after he suffered a blood clot linked to the AZ vaccine.\n\nIt took more than a year for Ms Spit, who campaigns for Vaccine Injured Bereaved UK, to receive the VDPS.\n\n“The [60 per cent disabled] criteria is a really big [issue], because there are so many people just left with nothing after being severely injured, and have life-changing disabilities, and they’re just told ‘well you’re not interested enough’,” she said.", "opengraph": {"locale": "en_US", "type": "article", "title": "Australian National Review - 20 Fold Increase in Workers in UK for Vaccine Damage Payment Program", "description": "20-Fold Increase in Workers in UK for Vaccine Damage Payment Program Campbell lays it out here… Inarguable point that the stabs are f**king people up on a MASSIVE scale… ﻿ MSM… Vaccine injury scheme ramps up staff as claims over Covid jabs keep growing Admin workers scaled up from four to 80 as claimants say […]", "url": "https://www.australiannationalreview.com/health/20-fold-increase-in-workers-in-uk-for-vaccine-damage-payment-program/", "site_name": "Australian National Review", "article:published_time": "2023-03-30T08:53:11+00:00", "article:modified_time": "2023-03-30T08:54:02+00:00", "image": "https://www.australiannationalreview.com/wp-content/uploads/2023/03/20-Fold-Increase-in-Workers-in-UK-for-Vaccine-Damage-Payment-Program.jpg", "image:width": "800", "image:height": "500", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.investmentwatchblog.com/20-fold-increase-in-workers-in-uk-for-vaccine-damage-payment-program/", "https://www.telegraph.co.uk/news/2023/03/24/vaccine-damage-payment-scheme-boosts-staff-numbers-four-80-covid/"], "authors": ["ANR News"], "publish_date": "2023-03-30T08:53:11+00:00"}