{"result_id": "040017", "URL": "https://www.australiannationalreview.com/health/new-g20-agenda-2030-document-calls-for-global-vaccine-passports/", "timestamp": "2023-04-25 12:10:43 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.australiannationalreview.com/wp-content/uploads/2021/07/favicon-4-512x512-1-150x150.png", "canonical": "https://www.australiannationalreview.com/health/new-g20-agenda-2030-document-calls-for-global-vaccine-passports/", "encoding": "UTF-8"}, "image": null, "domain": "www.australiannationalreview.com", "title": "New G20 Agenda 2030 Document calls for Global Vaccine Passports", "cleaned_text": "G-20 leaders have adopted a joint declaration calling for the establishment of “global digital health networks” that build on existing digital COVID-19 vaccine passports.\n\nThe G20 is officially over, and in doing so the G20 has put out a PDF document named – “2022 G20 Bali Update on the G20 Action Plan on the 2030 Agenda for Sustainable Development and G20 Development Commitments.”\n\nThis document tracks the progress and status of active G20 development commitments. In addition to ensuring accountability and transparency, the Bali Update also helps future G20 presidencies optimize the G20’s contribution to SDGs and G20 development commitments.\n\nWhat’s in it? From page 38:\n\nIn the section Collective and Concrete Actions by Working Groups and Workstreams Contributing to the Implementation of the 2030 Agenda for Sustainable Development, specifically under SDS Global Health, the following passage can be found:\n\n“Acknowledge the importance of shared technical standards to facilitate seamless international travel, interoperability, and recognizing digital and non-digital solutions aligned with countries’ relevant legal provisions including those used for COVID-19 proof of vaccination or verification of tests as well as the IHR (2005) which provides an overarching legal framework for addressing public health emergencies that have the potential to cross borders”\n\n“Endeavour to move towards interoperability of systems including mechanisms that validate proof of vaccination, whilst respecting the sovereignty of national health policies, and relevant national regulations such as personal data protection and data-sharing.\n\n“Acknowledge that continued global cooperation is necessary to build trust between countries. Support continued international dialogue and collaboration on the establishment of trusted global digital health networks as part of efforts to strengthen prevention and response to future pandemics.”\n\n“Further steps should capitalize and build on the success of the existing standards and digital COVID19 certificates.”\n\nTo capitalise and build on existing vaccination passports for future pandemics?\n\nThey are unwilling to let this slide even though the COVID vaccines were never tested to prevent transmission. This was revealed in the EU Parliament last month by MEP Rob Roos.\n\nFinally on page 12 under Scaling-up Financing for Sustainable Development it mentions:\n\n“Discuss the drivers of currency usage in trade and finance as well as developing local currency capital markets and discuss the macro-financial implications of Central Bank Digital Currencies (CBDCs) for the international monetary and financial system.”\n\nIt’s all about the globalist agenda, people. Agenda 2030 is that agenda. The globalists are using climate change, war, and COVID to create a digital hell on earth.\n\nDuring one of the summits, we had Indonesian Health Minister Budi Gunadi Sadikin state the following:\n\n“Let’s have a digital health certificate acknowledged by WHO. If you have been vaccinated or tested, you can move around. So, for the next pandemic, instead of stopping the movement of the people one hundred percent, which [collapsed] the economy globally, you can still provide some movement of the people.”\n\nThis G20 recommendation also conveniently synchronises with the EU vaccine roadmap which also states for 2022 and beyond that the “Commission proposal for a common vaccination card/passport for EU citizens – considered delivered in the format of Commission proposal for Regulation on the European Health Data Space:” And to “Develop guidance to overcome the legal and technical barriers impeding the interoperability of national immunisation information systems.“\n\nKlaus Schwab announced at the B20, an offshoot of the main G20, that this world must undergo deep and systemic restructuring.\n\nHe’s talking about restructuring and transitioning to achieve their sustainable dystopia agenda, which means a highly controlled society under the name of net zero.\n\nThe globalists aren’t hiding their agenda anymore: For the “privilege” of traveling, they want everyone to show their “digital papers” and submit to an all-powerful digital id system.\n\nWithout the digital identity system on your phone, you can’t leave your house. There’s a chance they’ll only let you go to the grocery store or the pharmacy.\n\nOnce we have a CBDC, it’ll be even easier to enforce. Once you go outside your pre-approved radius of movement, your money stops working.", "opengraph": {"locale": "en_US", "type": "article", "title": "Australian National Review - New G20 Agenda 2030 Document calls for Global Vaccine Passports", "description": "New G20 Agenda 2030 Document calls for Global Vaccine Passports By The Expose G-20 leaders have adopted a joint declaration calling for the establishment of “global digital health networks” that build on existing digital COVID-19 vaccine passports. The G20 is officially over, and in doing so the G20 has put out a PDF document named – “2022 […]", "url": "https://www.australiannationalreview.com/health/new-g20-agenda-2030-document-calls-for-global-vaccine-passports/", "site_name": "Australian National Review", "article:published_time": "2022-11-19T08:49:04+00:00", "article:modified_time": "2022-11-19T09:07:25+00:00", "image": "https://www.australiannationalreview.com/wp-content/uploads/2022/11/digital-COVID-19-vaccine-passports.jpg", "image:width": "800", "image:height": "491", "image:type": "image/jpeg"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">🚨 BREAKING:</p>\n<p>In COVID hearing, <a href=\"https://twitter.com/hashtag/Pfizer?src=hash&amp;ref_src=twsrc%5Etfw\">#Pfizer</a> director admits: <a href=\"https://twitter.com/hashtag/vaccine?src=hash&amp;ref_src=twsrc%5Etfw\">#vaccine</a> was never tested on preventing transmission.</p>\n<p>\"Get vaccinated for others\" was always a lie.</p>\n<p>The only purpose of the <a href=\"https://twitter.com/hashtag/COVID?src=hash&amp;ref_src=twsrc%5Etfw\">#COVID</a> passport: forcing people to get vaccinated.</p>\n<p>The world needs to know. Share this video! ⤵️ <a href=\"https://t.co/su1WqgB4dO\">pic.twitter.com/su1WqgB4dO</a></p>\n<p>— Rob Roos MEP 🇳🇱 (@Rob_Roos) <a href=\"https://twitter.com/Rob_Roos/status/1579759795225198593?ref_src=twsrc%5Etfw\">October 11, 2022</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">'If you have been vaccinated or tested properly, you can move around..<br/>'We will sub [this digital certificate using WHO standard] into the next World Health Assembly.. as the revision to intl health regulation': Indonesia MoH Budi Sadikin, ex-banker <a href=\"https://twitter.com/hashtag/B20Summit?src=hash&amp;ref_src=twsrc%5Etfw\">#B20Summit</a> <a href=\"https://twitter.com/hashtag/B20?src=hash&amp;ref_src=twsrc%5Etfw\">#B20</a> <a href=\"https://twitter.com/hashtag/DigitalID?src=hash&amp;ref_src=twsrc%5Etfw\">#DigitalID</a> <a href=\"https://t.co/mt2XugRhiC\">pic.twitter.com/mt2XugRhiC</a></p>\n<p>— Tim Hinchliffe (@TimHinchliffe) <a href=\"https://twitter.com/TimHinchliffe/status/1592232822483419138?ref_src=twsrc%5Etfw\">November 14, 2022</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">🧵</p>\n<p>1. “What we have to confront is a deep systemic and structural restructuring of our world, and the world will look differently after we have gone through this transition process (Great Reset)” – Klaus Schwab B20 Summit Indonesia 2022 Opening Remarks 14.11.2022. <a href=\"https://t.co/H7AL0uCQXN\">pic.twitter.com/H7AL0uCQXN</a></p>\n<p>— Sikh For Truth (@SikhForTruth) <a href=\"https://twitter.com/SikhForTruth/status/1592471425998532611?ref_src=twsrc%5Etfw\">November 15, 2022</a></p></blockquote>\n"], "movies": [], "links": ["https://twitter.com/hashtag/Pfizer?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/vaccine?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/COVID?src=hash&ref_src=twsrc%5Etfw", "https://t.co/su1WqgB4dO", "https://twitter.com/Rob_Roos/status/1579759795225198593?ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/B20Summit?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/B20?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/DigitalID?src=hash&ref_src=twsrc%5Etfw", "https://t.co/mt2XugRhiC", "https://twitter.com/TimHinchliffe/status/1592232822483419138?ref_src=twsrc%5Etfw", "https://t.co/H7AL0uCQXN", "https://twitter.com/SikhForTruth/status/1592471425998532611?ref_src=twsrc%5Etfw"], "authors": ["ANR News"], "publish_date": "2022-11-19T08:49:04+00:00"}