{"result_id": "040026", "URL": "https://www.australiannationalreview.com/health/confused-about-the-second-c0vid-booster-so-are-some-of-the-experts/", "timestamp": "2023-04-25 12:11:06 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.australiannationalreview.com/wp-content/uploads/2021/07/favicon-4-512x512-1-150x150.png", "canonical": "https://www.australiannationalreview.com/health/confused-about-the-second-c0vid-booster-so-are-some-of-the-experts/", "encoding": "UTF-8"}, "image": null, "domain": "www.australiannationalreview.com", "title": "Confused About the Second C0VID Booster? So Are Some of the Experts", "cleaned_text": "Confused About the Second C0VID Booster? So Are Some of the Experts\n\nVaccine resisters have accused the federal government of pushing COVID-19 shots without ensuring that the benefits outweigh the risks. But what about when one of the people raising questions about the latest round of jabs is Paul A. Offit, arguably the most prominent supporter of vaccines in the nation, a vocal force against people who spread silly myths about vaccination and himself the developer of a vaccine against rotavirus.\n\nWell, then you listen more closely.\n\nOffit has concerns about additional boosters. Other prominent vaccine experts have been raising questions too, including Phil Krause, a former deputy director of the FDA Office of Vaccines Research and Review, and Luciana Borio, formerly the agency’s acting chief scientist, who co-wrote an op-ed in the Wall Street Journal titled “You Likely Don’t Need a Fourth Covid Shot.” Michael Osterholm, director of the Center for Infectious Disease Research and Policy at the University of Minnesota, said waning immunity makes repeated boosting unsustainable.\n\nThey are not against inoculations for COVID-19. Quite the opposite. The science is clear that the vaccine is remarkably effective at preventing hospitalization and death from a virus that has killed nearly 1 million Americans.\n\nOffit says a second booster is probably a good idea for the most vulnerable people — those of very advanced age, with compromised immunity or co-morbidities such as diabetes. But he says the government has made the fourth dose available to large swaths of the population who don’t need it. (Notably, the U.S. Centers for Disease Control and Prevention didn’t call for people to get the fourth dose; instead, it said that people 50 and older and those with health problems are allowed to receive it, and suggested they consult their doctors.)\n\nTalking to a doctor is a good idea, Offit said, but this time around even doctors’ knowledge is limited because neither the Food and Drug Administration advisory committee — of which he’s a member — nor the equivalent at the CDC met in a public session to consider the second booster. Though the panel is advisory, the usual process of reviewing evidence, examining data, discussing the pros and cons of expanding use of a vaccine or other medication helps inform the public.\n\nWhat was the rush? Both hospitalization and infection rates continue to be low, though the latter have been rising again.\n\nSome experts say the evidence for additional COVID-19 booster shots in a healthy population is weak. A new study out of Israel, where fourth doses of the Pfizer–BioNTech vaccine were widely administered, found that they resulted in additional antibodies but provided little protection against infection and waned quickly. Cases of severe illness were down, but scientists on both sides of the issue say there were methodological problems with the study and the results were reported too soon to evaluate whether that group received better long-term protection against serious disease than people who received just a third dose.\n\nMuch of the public still is confused about what protection means, and for good reason. When people hear that a vaccine’s protection wanes quickly, they think it no longer is effective. But a vaccine against this disease was unlikely to prevent actual infection for long, Offit told me. That’s because the nature of coronaviruses is that they move quickly, which means infection can be prevented only by antibodies in the bloodstream. Vaccines prompt the body to make those antibodies before infection can take hold, but their ability to do that falls off after a few months.\n\nVaccines are much better at providing lasting protection against serious disease. That’s not a weaker version of protection from infection; it’s a different process that employs memory cells that work more slowly than antibodies already in the bloodstream. Offit says these cells might last years; it’s not known exactly how long.\n\nThere’s no evidence, he says, that healthy young people needed anything beyond the two initial shots. People older than 65 and in good health appear to benefit from a booster, but he says there’s no clear evidence they need a second booster. But those with compromised immune systems or co-morbidities or the elderly suffering various health problems probably do need the additional dose, Offit said.\n\nFrom Offit’s perspective, as long as the vaccines protect against severe disease, no more is needed except for those whose immune systems cannot mount a strong defense. Otherwise, we’re looking at vaccinating huge portions of the population every few months for minor illness. We don’t do that for any other disease.\n\nNot only is it wasteful — those doses could do a lot more good for people in other countries who haven’t been able to get a first shot — but it’s potentially counterproductive. As safe as the vaccines are, they do result in significant if temporary side effects for more than a few people and, in very rare cases, serious side effects. That tiny chance of having a bad reaction is more than worth it when the payoff is preventing serious disease, but not if an extra booster isn’t giving additional long-term protection.\n\nOther scientists agree with the FDA and CDC decisions. The FDA is saying an additional dose might be needed in the fall. The agency said it didn’t need its advisory committees to weigh in because the issue was straightforward; the CDC told CNBC that this was just an “incremental change.” It’s not certain at this point what the right path forward is now or will be, and there may be new COVID-19 variants in coming months — ones that call for more vaccination or different vaccines. But Offit raises worthwhile concerns that should be part of the federal government’s considerations.\n\nThe CDC has much of the raw data needed to understand vaccine protection better. The medical world, policy makers and the public could benefit from having that information to make decisions about this and future boosters.", "opengraph": {"locale": "en_US", "type": "article", "title": "Australian National Review - Confused About the Second C0VID Booster? So Are Some of the Experts", "description": "Confused About the Second C0VID Booster? So Are Some of the Experts By Karin Klein | Editorial Writer Vaccine resisters have accused the federal government of pushing COVID-19 shots without ensuring that the benefits outweigh the risks. But what about when one of the people raising questions about the latest round of jabs is Paul […]", "url": "https://www.australiannationalreview.com/health/confused-about-the-second-c0vid-booster-so-are-some-of-the-experts/", "site_name": "Australian National Review", "article:published_time": "2022-04-20T06:30:35+00:00", "image": "https://www.australiannationalreview.com/wp-content/uploads/2022/04/asaass.jpg", "image:width": "758", "image:height": "463", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": ["ANR News"], "publish_date": "2022-04-20T06:30:35+00:00"}