{"result_id": "040003", "URL": "https://www.australiannationalreview.com/the-great-vaccinecon/", "timestamp": "2023-04-25 12:10:04 CEST+0200", "meta": {"description": "Australian National Review is Australia’s first real free and independent press, one with no editorial control by the elite, but a publication that can generate critical thinkers and critical debate and hold those spreading mistruths and deliberate propaganda in mainstream media to account.", "lang": "en", "keywords": "", "favicon": "https://www.australiannationalreview.com/wp-content/uploads/2021/07/favicon-4-512x512-1-150x150.png", "canonical": "https://www.australiannationalreview.com/the-great-vaccinecon/", "encoding": "UTF-8"}, "image": null, "domain": "www.australiannationalreview.com", "title": "The Great Vaccinecon", "cleaned_text": "Is corporate greed, biased science and coercive Governments combined with naive politicians and complicit mainstream media up to now pulling off one of the greatest medical frauds of all time?\n\nThe Great Vaccine Con shows without a shadow of doubt once and for all what many of us have suspected and others already knew that vaccines are neither safe nor effective. The claim they are the greatest medical breakthrough of our time is nothing but a total Con that’s been covered up for decades on a public that is becoming less and less gullible and harder to convince.\n\nSo much so that Governments such as in Australia have introduced Nazi style policies such as No Jab no pay and even no jab no play to coerce and bribe lower economic families to take money to risk their childs health and vaccinate them with dangerous and unproven vaccines.\n\nIt takes courage to expose an industry with powerful friends in both Government and the media but the Author like millions of others is fed up with the lies, propaganda and pseudoscience pushed by greedy Pharmaceutical Companies who won’t hesitate to lie and deceive to sell their faulty vaccines. They do this by abusing the publics trust for the sake of profits and to cover up a lie that gets bigger every year and requires more and more lies to contain its exposure.\n\nWhether a pro Vaxxer or anti Vaxxer this is a book that has to be read.\n\nOur childrens health and the future of humanity is at stake if we allow the medical fraud and lies behind the aggressive vaccine industry to continue any longer.\n\nAn inconvenient truth that the Governments can no longer hide as childhood diseases and cancers now hit epidemic levels in countries such as the United States that has had a rapid increase in its vaccine schedule in recent decades verse countries that decided long ago to not buy into the Great Vaccine Con\n\nThis book will open the minds of many and enrage others but the Author is someone who has put his money where his mouth is and no one yet has dared take on his $1million challenge to prove Vaccines are safe and effective", "opengraph": {"locale": "en_US", "type": "article", "title": "Australian National Review - The Great Vaccinecon", "description": "Australian National Review is Australia’s first real free and independent press, one with no editorial control by the elite, but a publication that can generate critical thinkers and critical debate and hold those spreading mistruths and deliberate propaganda in mainstream media to account.", "url": "https://www.australiannationalreview.com/the-great-vaccinecon/", "site_name": "Australian National Review", "article:modified_time": "2022-03-12T07:06:28+00:00", "image": "https://www.australiannationalreview.com/wp-content/uploads/2021/12/d86603e8-9636-4ff4-a7cb-56be7efa5743.png"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}