{"result_id": "040028", "URL": "https://www.australiannationalreview.com/covid-19-deaths-and-injuries/new-paper-an-estimated-13-million-people-worldwide-killed-by-the-covid-vaccines/", "timestamp": "2023-04-25 12:11:10 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.australiannationalreview.com/wp-content/uploads/2021/07/favicon-4-512x512-1-150x150.png", "canonical": "https://www.australiannationalreview.com/covid-19-deaths-and-injuries/new-paper-an-estimated-13-million-people-worldwide-killed-by-the-covid-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "www.australiannationalreview.com", "title": "New Paper: An Estimated 13 Million People Worldwide Killed by the COVID Vaccines", "cleaned_text": "New Paper: An Estimated 13 Million People Worldwide Killed by the COVID Vaccines\n\nThat’s twice as many as were killed by the virus. In the US, the estimates are 670K Americans killed. Perhaps it’s time to declare that the vaccines are a worldwide emergency?\n\nThe tweet directly from the author sums it up:\n\nThe full story about how universities undermine people like Denis Rancourt who tell the truth\n\nThe paper points out that “it is not unreasonable to assume an all-population global value of vDFR = 0.1 %”\n\nFor the US, 670M doses have been given, so the estimate is 670,000 people have been killed by the COVID vaccines in the US.\n\nI have said for a long time that the URF in VAERS is 41, and there are 16,300 excess US deaths in VAERS (subtracting 250 background deaths per year which gets reported into VAERS) which comes to 668K.\n\n668K is very close to 670K, isn’t it?\n\nIn short, you can just take the number of vaccine doses in millions and just change “millions” to “thousands” to estimate the number of people killed by the vaccine.\n\nUsing data from Israel and Australia, the paper estimates 13 million deaths worldwide from the COVID vaccines:\n\nThe COVID-19 vaccines did not only not save lives but they are highly toxic. On the global scale, given the 3.7 million fatalities in India alone, having vDFR = 1 % (Rancourt, 2022), and given the age-stratified vDFR results presented in this work, it is not unreasonable to assume an all-population global value of vDFR = 0.1 %. Based on the global number of COVID-19 vaccine doses administered to date (13.25 billion 24 doses, up to 24 January 2023, Our World in Data),3 this would correspond to 13 million deaths from the COVID-19 vaccines worldwide. By comparison, the official World Health Organization (WHO) number of COVID-19 deaths to date is 6.8 million (6,817,478 deaths, reported to WHO, as 3 February 2023),4 which are not detected as COVID-19 assignable deaths in ACM studies.", "opengraph": {"locale": "en_US", "type": "article", "title": "Australian National Review - New Paper: An Estimated 13 Million People Worldwide Killed by the COVID Vaccines", "description": "New Paper: An Estimated 13 Million People Worldwide Killed by the COVID Vaccines By Steve Kirsch That’s twice as many as were killed by the virus. In the US, the estimates are 670K Americans killed. Perhaps it’s time to declare that the vaccines are a worldwide emergency? Executive summary The paper suggests you can take […]", "url": "https://www.australiannationalreview.com/covid-19-deaths-and-injuries/new-paper-an-estimated-13-million-people-worldwide-killed-by-the-covid-vaccines/", "site_name": "Australian National Review", "article:published_time": "2023-02-13T07:54:35+00:00", "article:modified_time": "2023-02-13T09:03:11+00:00", "image": "https://www.australiannationalreview.com/wp-content/uploads/2023/02/New-Paper-An-Estimated-13-Million-People-Worldwide-Killed-by-the-COVID-Vaccines.jpg", "image:width": "800", "image:height": "455", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.researchgate.net/publication/368389701_Age-stratified_COVID-19_vaccine-dose_fatality_rate_for_Israel_and_Australia", "https://www.researchgate.net/publication/368389701_Age-stratified_COVID-19_vaccine-dose_fatality_rate_for_Israel_and_Australia", "https://www.kwesthues.com/Rancourt09.htm"], "authors": ["ANR News"], "publish_date": "2023-02-13T07:54:35+00:00"}