{"result_id": "041016", "URL": "https://www.autismspeaks.org/blog/qa-coping-covid-19", "timestamp": "2023-04-25 12:11:58 CEST+0200", "meta": {"description": "As Omnicron cases rise, children with autism and their families continue to feel the impact of the pandemic. School closures and staff shortages are affecting many people’s access to needed services, while mask mandates are creating challenges for those with sensory issues. In this Q&A, licensed psychologist and board-certified behavior analyst Dr. Brenna Cavanaugh offers some guidance about getting through the current wave of the pandemic.", "lang": "en", "keywords": "", "favicon": "/themes/custom/particle/apps/drupal/favicon.ico", "canonical": "https://www.autismspeaks.org/blog/qa-coping-covid-19", "encoding": "utf-8"}, "image": null, "domain": "www.autismspeaks.org", "title": "Q&A: Coping with COVID-19", "cleaned_text": "As Omnicron cases rise, children with autism and their families continue to feel the impact of the pandemic. School closures and staff shortages are affecting many people’s access to needed services, while mask mandates are creating challenges for those with sensory issues. In this Q&A, licensed psychologist and board-certified behavior analyst Dr. Brenna Cavanaugh offers some guidance about getting through the current wave of the pandemic.\n\nQ: How has the recent spike in COVID-19 cases affected the autism community? What are the biggest challenges coming out of this wave?\n\nFrom what I see from the families I work with, many children are frequently being put on quarantine due to an exposure. I also see many daycares and classrooms closing temporarily due to staffing shortages or COVID exposures. This means that kids are out of the classroom a lot and not receiving the therapies and support they need. It can be hard for families to keep structure and routine in place, which these children benefit so much from. Unexpected closures and quarantines can also be very stressful for families, as they have to arrange childcare for their child. This sometimes means a parent cannot go to work, which in turn can cause financial stress and job insecurity.\n\nQ: What are the biggest risk factors for contracting the Omnicron variant among autistic children?\n\nPoor masking adherence is a possible risk factor. Many children with autism are still having trouble keeping a mask on successfully for long durations of time, such as throughout the school day. This could not only put them at higher risk for contracting the virus, but also means they are put on quarantine more often due to coming in contact with a COVID positive individual while not being in proper personal protective equipment. Parents and educators should continue working with these individuals to help them mask more successfully. At the University of Rochester, my colleagues and I developed a toolkit to help children wear masks successfully that may be helpful.\n\nQ: Do people with autism have a higher risk of complications from COVID-19?\n\nBased on data I have seen, it appears that they may. My understanding is that this is not due to being autistic per se, but more so because people with autism are more likely to have medical comorbidities which can put them at higher risk.\n\nQ: What guidance would you give to the autistic community to help them stay physically and mentally well during this wave of the pandemic?\n\nEveryone is struggling with this right now and there is no easy answer. Again, I would recommend parents and educators continue to help individuals with autism with masking. Most children can be successful with this with lots of additional support.\n\nMentally and emotionally, it can be a family effort to try to stay healthy. I always want to make sure caregivers are taking a little time to care for themselves, even if it means five minutes with a cup of tea and their bedroom door closed. Try to plan an enjoyable activity, whether it is taking a walk, baking or playing a board game as a family. Having small things to look forward to does help.\n\nI always find myself reminding caregivers that it is okay to cut yourself some slack! We can’t always be productive—we just have to get through some days. However, for anyone struggling with their mental health, simple things like this may not be enough. Definitely talk to your doctor if you are experiencing enduring anxiety or depressed mood.\n\nQ: How can caregivers make the vaccine experience easier for their loved ones with autism?\n\nI would recommend preparing most individuals beforehand for the vaccine. Caregivers likely know what would be most helpful for preparing their child, whether it is pictures, a Youtube video or just encouraging words. Positive distractions can be helpful, such as having a tablet for your child and playing a favorite show while they get the shot. Rewards may also help someone get through it, such as a special treat after the appointment. You can acknowledge and validate your child’s fears while still encouraging them that they can do it.\n\nQ: What advice would you offer the family or caregiver of an autistic person who is hospitalized with COVID-19? How can they best advocate for their loved one?\n\nI would advise families to check with the hospital to see who they have on staff who can help support. Some hospitals have professionals such as child life specialists and behavior specialists who can help them make a plan and support the individual through treatment. Families should do their best to communicate with the providers involved and educate them on the individual’s strengths, preferences and abilities, as well as areas they will need support. It may help to create a document about the individual with this information that can be uploaded to their medical file and shared with all providers involved.\n• Learn about the impact of COVID-19 school closures on autistic children\n• View a video of caregiver tips to make mask-wearing easier for people with autism\n• Read our vaccine guide for people with autism and their support people\n• See our full list of COVID-19 resources for autistic adults, family members and health professions", "opengraph": {"site_name": "Autism Speaks", "url": "https://www.autismspeaks.org/blog/qa-coping-covid-19", "title": "Q&A: Coping with COVID-19 | Autism Speaks", "description": "As Omnicron cases rise, children with autism and their families continue to feel the impact of the pandemic. School closures and staff shortages are affecting many people’s access to needed services, while mask mandates are creating challenges for those with sensory issues. In this Q&A, licensed psychologist and board-certified behavior analyst Dr. Brenna Cavanaugh offers some guidance about getting through the current wave of the pandemic.", "image": "https://www.autismspeaks.org/sites/default/files/COVID%20Q%26A.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.urmc.rochester.edu/people/29643592-brenna-m-cavanaugh", "https://www.urmc.rochester.edu/strong-center-developmental-disabilities/resources/masks-toolkit.aspx", "https://www.autismspeaks.org/science-news/new-study-shows-negative-effect-covid-19-school-closures-autistic-children", "https://www.youtube.com/watch?v=T1I4BcpTfIk", "https://www.autismspeaks.org/sites/default/files/Getting_Vaccine_Information_Individuals_Families.pdf", "https://www.autismspeaks.org/covid-19-information-and-resources-educators-and-health-professionals"], "authors": [], "publish_date": null}