{"result_id": "041031", "URL": "https://www.autismspeaks.org/what-causes-autism", "timestamp": "2023-04-25 12:12:10 CEST+0200", "meta": {"description": "What is the cause of autism? Learn more about risk factors for autism, including genetic and environmental risks.", "lang": "en", "keywords": "", "favicon": "/themes/custom/particle/apps/drupal/favicon.ico", "canonical": "https://www.autismspeaks.org/what-causes-autism", "encoding": "utf-8"}, "image": null, "domain": "www.autismspeaks.org", "title": "What Causes Autism?", "cleaned_text": "The information below is not meant to diagnose or treat. It should not take the place of consultation with a qualified healthcare professional.\n\nA common question after an autism diagnosis is what is the cause of autism.\n\nWe know that there’s no one cause of autism. Research suggests that autism develops from a combination of genetic and nongenetic, or environmental, influences.\n\nThese influences appear to increase the risk that a child will develop autism. However, it’s important to keep in mind that increased risk is not the same as cause. For example, some gene changes associated with autism can also be found in people who don’t have the disorder. Similarly, not everyone exposed to an environmental risk factor for autism will develop the disorder. In fact, most will not.\n\nResearch tells us that autism tends to run in families. Changes in certain genes increase the risk that a child will develop autism. If a parent carries one or more of these gene changes, they may get passed to a child (even if the parent does not have autism). Other times, these genetic changes arise spontaneously in an early embryo or the sperm and/or egg that combine to create the embryo. Again, the majority of these gene changes do not cause autism by themselves. They simply increase risk for the disorder\n\nResearch also shows that certain environmental influences may further increase – or reduce – autism risk in people who are genetically predisposed to the disorder. Importantly, the increase or decrease in risk appears to be small for any one of these risk factors:\n• Pregnancy and birth complications (e.g. extreme prematurity [before 26 weeks], low birth weight, multiple pregnancies [twin, triplet, etc.])\n• Pregnancies spaced less than one year apart\n• Prenatal vitamins containing folic acid, before and at conception and through pregnancy\n• Vaccines. Each family has a unique experience with an autism diagnosis, and for some it corresponds with the timing of their child’s vaccinations. At the same time, scientists have conducted extensive research over the last two decades to determine whether there is any link between childhood vaccinations and autism. The results of this research is clear: Vaccines do not cause autism. The American Academy of Pediatrics has compiled a comprehensive list of this research.\n\nHow do these genetic and nongenetic influences give rise to autism? Most appear to affect crucial aspects of early brain development. Some appear to affect how brain nerve cells, or neurons, communicate with each other. Others appear to affect how entire regions of the brain communicate with each other. Research continues to explore these differences with an eye to developing treatments and supports that can improve quality of life.", "opengraph": {"site_name": "Autism Speaks", "url": "https://www.autismspeaks.org/what-causes-autism", "title": "What Causes Autism? | Autism Speaks", "description": "What is the cause of autism? Learn more about risk factors for autism, including genetic and environmental risks."}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.ncbi.nlm.nih.gov/pubmed/18945690", "http://www.ncbi.nlm.nih.gov/pubmed/21220394", "http://www.ncbi.nlm.nih.gov/pubmed/21610500", "https://www.healthychildren.org/English/safety-prevention/immunizations/Pages/Vaccine-Studies-Examine-the-Evidence.aspx", "https://www.autismspeaks.org/what-causes-autism?form=FUNYARVSAXT&utm_source=website&utm_medium=banner&utm_campaign=THD_causes_autism"], "authors": [], "publish_date": null}