{"result_id": "041029", "URL": "https://www.autismspeaks.org/advocacy-news/congress-includes-relief-autism-community-american-rescue-plan", "timestamp": "2023-04-25 12:12:08 CEST+0200", "meta": {"description": "The fifth COVID-19 relief package, the American Rescue Plan, has been signed into law, securing additional relief for individuals with autism and their families.", "lang": "en", "keywords": "", "favicon": "/themes/custom/particle/apps/drupal/favicon.ico", "canonical": "https://www.autismspeaks.org/advocacy-news/congress-includes-relief-autism-community-american-rescue-plan", "encoding": "utf-8"}, "image": null, "domain": "www.autismspeaks.org", "title": "Congress includes relief for the autism community in the American Rescue Plan", "cleaned_text": "This week, Congress passed the fifth COVID-19 relief package (The American Rescue Plan). Today, the President has signed the bill into law. This is the largest relief package since the onset of the pandemic last year. Autistic individuals and their families have faced incredible challenges during this difficult time, and there are many elements of the $1.9 trillion bill that will provide financial help, as well as housing, food and health care assistance.\n\nThroughout the past year, in response to hearing from autistic individuals and their families, Autism Speaks staff, volunteer advocacy ambassadors and advocates from across the country have been asking Congress to assist the autism community as it faces unique challenges brought about by the pandemic. Fortunately, those voices were heard loud and clear, and the American Rescue Plan addresses each of the priority issues that we have been fighting for, including\n• Over $12.6 billion in emergency relief for home and community-based services (HCBS);\n• $1,400 stimulus payments for dependents over the age of 16. This marks the first-time dependents 17 years old and up are eligible for stimulus payments; previous rounds were only provided for dependents under age 17.\n\nIn addition, legislation passed at the end of last year addressed another important Autism Speaks priority – the expansion of telehealth services and other flexibilities for autism services and supports.\n\nThe voices of advocacy ambassadors and grassroots advocates, including autistic individuals, family members and others who care deeply about the autism community, played an important role in getting Congress to incorporate these provisions in the legislation. We know that the work to tackle the many ongoing challenges that the autism community faces continues. But the enactment of these provisions in the American Rescue Plan is a cause for celebrating the achievements of autism advocates.\n\nAdditional information on our advocacy priorities that were included in the American Rescue Plan are detailed below.\n\nThe Senate increased the additional funding for home and community-based services from 7.35% to 10% federal matching percentage. This will result in nearly $12.7 billion for Medicaid HCBS. This funding will be distributed based on states’ respective funding levels of Medicaid HCBS.\n\nHCBS support people with autism and other individuals with disabilities to live and thrive in their homes and communities. The vast majority of residential services for adults with autism are provided via Medicaid HCBS, which also offers respite to family caregivers, supported employment services to autistic adults, along with many other critical community supports.\n\nStates have broad flexibility to use HCBS in a variety of ways. With these funds, states can increase available services, raise provider payments, support emergency enrollment, address waiting lists for HCBS or use these funds to address other important issues identified by the state.\n\nAutistic individuals and their families have benefited from the economic impact payments provided by previous COVID-19 relief bills. However, those bills excluded dependents over the age of 16 from eligibility. The American Rescue Plan incorporates legislation that Autism Speaks and other disability organizations advocated to ensure that dependents over age 16 will qualify for $1,400 stimulus checks.\n\nWhile individuals and families across the autism community will benefit from the $1,400 payments, this change will address an inequity and provide significant financial relief for many families. A recent Autism Speaks needs assessment survey found that 35 percent of households that have a family member with autism who is 16 years old or older were facing food insecurity during the pandemic.\n\nEducational supports for students with autism and protecting rights under IDEA\n\nThe American Rescue Plan includes $3 billion in dedicated funding for Individuals with Disabilities Education Act (IDEA) programs.\n\nThe number of school-age children with autism served under IDEA is significant and growing. Students with autism and other disabilities have been disproportionately impacted by the disruptions brought about by the COVID-19 pandemic. Students with autism have missed more than class time. The lack of in-person instruction and related services, like speech, occupational and behavioral therapies, has caused widespread learning loss and skill regression. The $3 billion allocated to IDEA will go a long way in easing the financial burdens felt by schools and helping them meet their service commitments to students with autism and other disabilities.\n\nExpanding telehealth services and other flexibilities for autism services and supports\n\nAdditional telehealth flexibilities that have been established during the COVID-19 pandemic were retained through the end of year Consolidated Appropriations Act of 2021.\n\nThis funding established the COVID-19 Telehealth Program to assist healthcare providers with ramping up telehealth capabilities and funding to increase broadband access across the country. Beginning in January 2022, private insurers will be prohibited from placing higher cost-sharing for nonemergency out-of-network telemedicine providers. Virtual home visits under the Maternal, Infant and Early Childhood Home Visit Program were also made permissible.\n\nFor more information about our advocacy efforts and to get involved, visit autismspeaks.org/advocacy.", "opengraph": {"site_name": "Autism Speaks", "url": "https://www.autismspeaks.org/advocacy-news/congress-includes-relief-autism-community-american-rescue-plan", "title": "Congress includes relief for the autism community in the American Rescue Plan | Autism Speaks", "description": "The fifth COVID-19 relief package, the American Rescue Plan, has been signed into law, securing additional relief for individuals with autism and their families.", "image": "https://www.autismspeaks.org/sites/default/files/MicrosoftTeams-image.png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.autismspeaks.org/advocacy"], "authors": [], "publish_date": null}