{"result_id": "041035", "URL": "https://www.autismspeaks.org/covid-19-information-and-resources-adults-spectrum", "timestamp": "2023-04-25 12:12:13 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/themes/custom/particle/apps/drupal/favicon.ico", "canonical": "https://www.autismspeaks.org/covid-19-information-and-resources-adults-spectrum", "encoding": "utf-8"}, "image": null, "domain": "www.autismspeaks.org", "title": "COVID-19 information and resources for adults on the spectrum", "cleaned_text": "The Autism Response Team (ART) is an information line for the autism community. Our team members are available via phone, email, and live chat to speak with you and share resources and support based on your family’s individual situation. Contact our Autism Response Team (ART)\n\nCOVID-19 Vaccines: What You Should Know\n\n Vaccines are the best tools we have to fight the COVID-19 pandemic and keep our communities healthy, but many people still have concerns about their safety. Here are some facts that can help you make an informed decision about your choice to get vaccinated, and some tips to make the experience more autism-friendly.\n\nCDC Guidance About COVID-19 Vaccines\n\n Vaccines are a safe, effective, and free way to slow the spread of COVID and prevent serious illness. Here, you can view the latest CDC guidance on vaccines and booster shots.\n• What people with disabilities and care providers need to know about COVID-19 vaccines\n• Find a site near you and get help making an appointment\n\nFind a COVID-19 Vaccine Center\n\nVaccines.gov helps people find the latest information on COVID-19 vaccine availability in their area. You can also schedule your free vaccine at CVS or Rite Aid, or contact the Disability Information and Access Line (DIAL) for help getting vaccinated and accessing COVID-19 tests.\n\nGetting the COVID-19 Vaccine\n\n A guide for people with autism and related conditions, and their support people.\n\nWhere to Find Food\n\n With food insecurity worsening in the autism community, we’ve collected information for families about where to find food. If you or someone you know needs food, there are places near you that can help.\n\nVideo: Making Mask-Wearing Easier for Autistic Adults and Those with Sensory Needs\n\nClinical psychologist Dr. Rebecca Shaffer of Cincinnati Children’s Hospital reviews some easy steps to practice mask-wearing at home so that you can be successful wearing masks as communities re-open.\n\nTelehealth Tool Kit for Families and Providers\n\n This resource, created by the Family Advisory Council of the Autism Speaks Autism Treatment Network/AIR-P, offers families and providers tips for successful telehealth visits for children and adults with autism. Developed by the Autism Speaks Autism Treatment Network/AIR-P/Autism Learning Health Network.\n\nHow to cope with disrupted personal routines during COVID-19\n\n Tips for autistic adults to help cope with disruptions in routines, mental health challenges, and other ways to practice self-care during this difficult time. Written by Brigid Rankowski, a disability advocate, educator and international speaker and author on autism spectrum disorders.\n\nWorking from home: Developing a new routine\n\n The transition to remote work for many workers has presented many challenges. For some autistic employees this change can be even more difficult. Lydia Wayman, an autistic author, speaker, blogger and advocate, offers tips for adapting to a new work routine.\n\nSupport for Autistic Adults Dealing with COVID-19 Employment Changes\n\n Tips for autistic workers who may be facing a job change or unemployment. Includes information on applying for unemployment, accessing other benefits, budgeting, focusing on mental health, and more.\n\nApplying for Unemployment\n\n For more information about applying for unemployment benefits, workers’ compensation, welfare or temporary assistance, and other programs and services that can help if you lose your job, visit usa.gov/unemployment.\n\nVideo: My tips for other autistics during the COVID-19 pandemic\n\nMotivational Speaker and Poet, Russell Lehmann, talks about his struggles with his mental health during the COVID-19 pandemic and offers advice to other autistic adults as well as for parents of young children.\n\nWHO Coping With Stress\n\n From the World Health Organization, an infographic with quick tips for managing stress.\n\nAmerican Psychological Association Resources\n\n The APA has put together many resources to help the community cope with the new challenges and disruptions from COVID-19. This includes information on:\n\nAPA Podcast: Coping With Stress During COVID-19 \n\n In this podcast, Dr. Lynn Bufka offers tips for managing anxiety and coping with stress during the current pandemic.\n\nSuicide Prevention Lifeline - 1-800-273-8255\n\n The National Suicide Prevention Lifeline provides free and confidential emotional support to people in suicidal crisis or emotional distress 24 hours a day, 7 days a week. Call 1-800-273-8255 or visit their website to chat with a crisis counselor.\n\nCrisis Text Line - Text ‘Home’ to 741-741 \n\n Crisis Text Line is free, 24/7 support for those in any type of crisis. Text 741-741 from anywhere in the US to text with a trained Crisis Counselor.\n\nThriving at Home during the Pandemic: Authentic Tips for Resilience\n\nIf you or someone you know is in crisis—whether they are considering suicide or not—please call the toll-free Lifeline at 800-273-TALK (8255) to speak with a trained crisis counselor 24/7.\n\nTaking steps to prepare for the possibility of a crisis can help you act quickly, ease your mind and lessen the impact if a crisis situation occurs. Navigating a Mental Health Crisis: A NAMI Resource Guide for Those Experiencing a Mental Health Emergency provides important, potentially life-saving information for people experiencing a mental health crisis and their loved ones.\n\nIf you or someone you care about is feeling overwhelmed with emotions like sadness, depression, or anxiety, or feel like you want to harm yourself or others, call", "opengraph": {"site_name": "Autism Speaks", "url": "https://www.autismspeaks.org/covid-19-information-and-resources-adults-spectrum", "title": "COVID-19 information and resources for adults on the spectrum | Autism Speaks"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "854", "height": "480", "embed_code": "<iframe width=\"854\" height=\"480\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" src=\"https://www.youtube.com/embed/v_Q6OI_ij-o?autoplay=0&amp;start=0&amp;rel=0\"/>", "src": "https://www.youtube.com/embed/v_Q6OI_ij-o?autoplay=0&start=0&rel=0"}, {"embed_type": "iframe", "provider": "youtube", "width": "854", "height": "480", "embed_code": "<iframe width=\"854\" height=\"480\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" src=\"https://www.youtube.com/embed/fT4YaSSOkXg?autoplay=0&amp;start=0&amp;rel=0\"/>", "src": "https://www.youtube.com/embed/fT4YaSSOkXg?autoplay=0&start=0&rel=0"}], "links": ["/autism-response-team-art", "https://www.autismspeaks.org/sites/default/files/Vaccine%20Hesitancy%20Flyer%20-Community.pdf", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/index.html", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/your-vaccination.html", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/booster-shot.html", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/recommendations/disabilities.html", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/faq.html", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/facts.html", "https://acl.gov/DIAL", "https://acl.gov/DIAL", "https://www.vaccines.gov/", "https://www.cvs.com/immunizations/covid-19-vaccine", "https://www.riteaid.com/covid-19", "https://acl.gov/DIAL", "https://www.autismspeaks.org/sites/default/files/Getting_Vaccine_Information_Individuals_Families.pdf", "https://www.autismspeaks.org/sites/default/files/Vaccine_Support_Card_Individuals_Families.pdf", "http://act.autismspeaks.org/site/DocServer?docID=4004", "http://act.autismspeaks.org/site/Survey?ACTION_REQUIRED=URI_ACTION_USER_REQUESTS&SURVEY_ID=9407", "https://www.autismspeaks.org/blog/how-cope-disrupted-personal-routines-during-covid-19", "https://www.autismspeaks.org/blog/working-home-developing-new-routine", "https://www.autismspeaks.org/blog/support-autistic-adults-dealing-covid-19-employment-changes", "http://www.usa.gov/unemployment", "https://www.usa.gov/unemployment", "https://www.who.int/docs/default-source/coronaviruse/coping-with-stress.pdf", "https://www.apa.org/topics/covid-19/", "https://www.apa.org/topics/covid-19/index#self-care", "https://www.apa.org/topics/covid-19/index#work", "https://www.apa.org/topics/covid-19/index#stress", "https://www.apa.org/research/action/speaking-of-psychology/covid-19-mental-health", "https://suicidepreventionlifeline.org/", "https://www.crisistextline.org/", "/science-news/thriving-home-during-pandemic-authentic-tips-resilience", "https://www.samhsa.gov/grants/grant-announcements/sm-16-006", "https://www.nami.org/About-NAMI/Publications-Reports/Guides/Navigating-a-Mental-Health-Crisis", "https://www.nami.org/About-NAMI/Publications-Reports/Guides/Navigating-a-Mental-Health-Crisis", "https://www.samhsa.gov/newsroom/press-announcements/202003240200"], "authors": [], "publish_date": null}