{"result_id": "041038", "URL": "https://www.autismspeaks.org/covid-19-information-and-resources-families", "timestamp": "2023-04-25 12:12:15 CEST+0200", "meta": {"description": "Autism and COVID-19 parent support and resources. The Autism Response Team (ART) is here to help based on your family’s situation.", "lang": "en", "keywords": "autism response team", "favicon": "/themes/custom/particle/apps/drupal/favicon.ico", "canonical": "https://www.autismspeaks.org/covid-19-information-and-resources-families", "encoding": "utf-8"}, "image": null, "domain": "www.autismspeaks.org", "title": "COVID-19 information & resources for families", "cleaned_text": "The Autism Response Team (ART) is an information line for the autism community. Our team members are available via phone, email, and live chat to speak with you and share resources and support based on your family’s individual situation. Contact our Autism Response Team (ART)\n\nTools and Resources Recommended by the COVID-19 Autism Research Community Task Force are noted with a ? symbol.\n• Other Guidance for Families and Caregivers\n\nCOVID-19 Vaccines: What You Should Know\n\n Vaccines are the best tools we have to fight the COVID-19 pandemic and keep our communities healthy, but many people still have concerns about their safety. Here are some facts that can help you make an informed decision about your choice to get vaccinated, and some tips to make the experience more autism-friendly.\n\nCDC Guidance About COVID-19 Vaccines\n\n Vaccines are a safe, effective, and free way to slow the spread of COVID and prevent serious illness. Here, you can view the latest CDC guidance on vaccines and booster shots.\n• What people with disabilities and care providers need to know about COVID-19 vaccines\n• Find a site near you and get help making an appointment\n\nFind a COVID-19 Vaccine Center\n\nVaccines.gov helps people find the latest information on COVID-19 vaccine availability in their area. You can also schedule your free vaccine at CVS or Rite Aid, or contact the Disability Information and Access Line (DIAL) for help getting vaccinated and accessing COVID-19 tests.\n\nGetting the COVID-19 Vaccine\n\n A guide for people with autism and related conditions, and their support people.\n\n? Where to Find Food\n\n With food insecurity worsening in the autism community, we’ve collected information for families about where to find food. If you or someone you know needs food, there are places near you that can help.\n\n? UConn Parent Training website\n\n This resource is a free, web-based training program for caregivers of children with, and at risk for, autism spectrum disorders. It is designed to educate caregivers in basic behavioral and naturalistic teaching principles, developmental milestones, and use of evidence-based intervention principles. Submitted in response to Task Force User Call for Families.\n\n? Exercise Buddy \n\n Exercise is important for people with autism and opportunities to facilitate physical activity during COVID-19 is critical. Exercise Buddy is an app available on tablets which can help increase physical activity. Access a special 3-month free trial for users during the COVID-19 pandemic.\n\n? Help Is In Your Hands\n\n This video training includes 16 lessons with animated and narrated videos of families interacting in their homes that walking caregivers through specific strategies they can use with their toddlers to support social communication. Submitted in response to Task Force User Call for Families.\n\n? Caring for Individuals with Autism During a Crisis\n\n This PDF pamphlet offers families guidance on navigating crises, including the current COVID-19 pandemic. Includes tips on preparing for crises, following a daily routine, continuing communication with caregivers, maintaining social support, addressing treatment discrimination in hospitals, and provides additional crisis resources. Submitted in response to Task Force User Call for Families.\n\n? We Wear Masks\n\n A simple Social Story to help children understand why we wear masks. It also provides language for providers, families, teachers and other caregivers. Submitted in response to Task Force User Call for Families.\n\n? Making Mask-Wearing Easier for Autistic Adults and Those With Sensory Needs\n\n Clinical psychologist Dr. Rebecca Shaffer of Cincinnati Children’s Hospital reviews some easy steps to practice mask-wearing at home so that you can be successful wearing masks as communities re-open.\n\n? Caregiver Tips to Make Mask-Wearing Easier for People with Autism\n\n Clinical Psychologist Dr. Rebecca Shaffer of Cincinnati Children’s Hospital walks through steps caregivers and parents can use to help their children and loved ones wear masks successfully as communities re-open.\n\n? ASD Strategies in Action \n\n While Americans from coast to coast are practicing safe social distancing and staying home, the Autism Certification Center (ACC) and Autism Speaks are teaming up to make 30+ hours of online video learning resources available at no cost for the autism community.\n\n? COVID-19 Video Teaching Story from University of Miami – NSU\n\n The University of Miami-Nova Southeastern University Center for Autism and Related Disabilities created a helpful social narrative video to help individuals with autism understand the Coronavirus (COVID-19).\n\n? UC Davis Autism Distance Education Parent Training (ADEPT)\n\n ADEPT (Autism Distance Education Parent Training) Interactive Learning is a 10-lesson interactive, self-paced, online learning module. The goal is to provide parents with tools and training to more effectively teach their child functional skills using applied behavior analysis (ABA) techniques. Submitted in response to Task Force User Call for Families.\n\n? Supporting Individuals with Autism through Uncertain Times - UNC Frank Porter Graham Child Development Institute Autism Team\n\n The UNC Frank Porter Graham Child Development Institute Autism Team created a comprehensive guide with visual tools and resources related to support strategies, coping and calming skills, hygiene, daily schedules and routines, communication, activities, and more.\n\n? Challenging Behaviors Tool Kit\n\n Coping with disrupted routines and increased anxiety can result in an increase in challenging behavior for some individuals. Our Challenging Behaviors Tool Kit offers strategies to help families understand these behaviors and how to support their loved ones in difficult situations.\n\n? Tips for managing children at home during COVID-19\n\n? OCALI Autism Internet Modules\n\n OCALI’s Autism Internet Modules are a series of free online trainings on a variety of topics. They provide high-quality information and professional development for anyone who supports, instructs, works with, or lives with someone with autism.\n\n? Coronavirus (COVID-19) Virtual Outreach Series from Cincinnati Children’s Hospital Division of Developmental Behavioral Pediatrics\n\nDDBP Virtual Outreach Series: Supporting Families Through COVID-19 includes the following topics:\n• Homebound: Strategies to Improve Compliance and Cooperation with Your Children\n• Collaborating with Your Child’s School Team through COVID-19\n• Sleep Hygiene Tips for Parents of Children with Developmental Disabilities\n\n? Coping with disrupted routines\n\n Tips and ideas for helping your loved one cope and adapt when normal daily routines are disrupted, from Arianna Esposito, BCBA, Director of Lifespan Services at Autism Speaks. Disrupted Routines Teaching Story.\n\n? Challenging Behaviors Tool Kit\n\n Coping with disrupted routines and increased anxiety can result in an increase in challenging behavior for some individuals. Our Challenging Behaviors Tool Kit offers strategies to help families understand these behaviors and how to support their loved ones in difficult situations.\n\nBehavioral health care during COVID-19 pandemic\n\n Social distancing requirements and stay at home orders mean may behavioral health services for people with autism will no longer be available in person. Dan Coury, M.D., of Nationwide Children's Hospital, reviews ways to receive care during the pandemic.\n\nTips for managing children at home during COVID-19\n• My child is sometimes aggressive, what can help?\n• Parents seek help for son with autism and recurring behavioral crises\n• Mom perplexed by toddler running back and forth shaking things\n• A Day in the Life: A Mom’s Perspective on Parenting During a Pandemic\n\n? Parent/Caregiver Guide to Helping Families Cope With the Coronavirus Disease 2019 (COVID-19)\n\n The National Child Traumatic Stress Network created a resource to help families manage the challenges associated with the current Coronavirus outbreak. This includes age-appropriate tips for helping children cope with stress and uncertainty at this time.\n\nAmerican Psychological Association COVID-19 Resources\n\n Resources from the American Psychological Association on managing stress and coping during this pandemic. A few selected links in particular:\n• Advice for caregivers of children with disabilities in the era of COVID-19\n• WHO Coping With Stress\n\n From the World Health Organization, an infographic with quick tips for managing stress.\n\nSuicide Prevention Lifeline - 1-800-273-8255\n\n The National Suicide Prevention Lifeline provides free and confidential emotional support to people in suicidal crisis or emotional distress 24 hours a day, 7 days a week. Call 1-800-273-8255 or visit their website to chat with a crisis counselor.\n\nCrisis Text Line - Text ‘Home’ to 741-741 \n\n Crisis Text Line is free, 24/7 support for those in any type of crisis. Text 741-741 from anywhere in the US to text with a trained Crisis Counselor.\n\nIf you or someone you know is in crisis—whether they are considering suicide or not—please call the toll-free Lifeline at 800-273-TALK (8255) to speak with a trained crisis counselor 24/7.\n\nTaking steps to prepare for the possibility of a crisis can help you act quickly, ease your mind and lessen the impact if a crisis situation occurs. Navigating a Mental Health Crisis: A NAMI Resource Guide for Those Experiencing a Mental Health Emergency provides important, potentially life-saving information for people experiencing a mental health crisis and their loved ones.\n\nIf you or someone you care about is feeling overwhelmed with emotions like sadness, depression, or anxiety, or feel like you want to harm yourself or others, call the Disaster Distress Helpline at 1-800-985-5990 or text TalkWithUs to 66746 (TTY 1-800-846-8517).\n\nThe Autism Care Network Works to Improve Mental Health Among Autistic Youth\n\nResearch shows that people with autism are more likely to have other mental health conditions that affect their overall health and well-being. The Autism Care Network can help you or your loved one access the mental health care you need. Read this Q&A to learn how the ACNet is working to improve treatment for mental health issues among autistic youth.\n\nFlu Teaching Story\n\n Teaching stories help people with autism learn about new and unfamiliar situations. This story talks about the coronavirus, staying healthy, and adapting to new routines.\n\nSchool closures and disruption of school-based services\n\n As COVID-19 continues to spread, many students may need to learn in a remote or hybrid learning environment. Families must find ways to adapt to their child learning from home. This article offers tips to help prepare for remote learning and recommendations for continuing educational support as much as possible.\n\nOther Guidance for Families and Caregivers\n\n? Community Connecting to Play: Jooay\n\n Jooay is a free mobile and web app that helps parents, youth and other users find leisure and community activities that are accessible, close to where they live, suit their needs and abilities, and match their preferences. Includes the option to join the Community Connecting to Play private Facebook for ideas of what to do at home and other resources. Submitted in response to Task Force User Call for Families.\n\nAPA webinar: Caring for children and adolescents with autism during COVID-19 \n\n Arianna Esposito, BCBA, of Autism Speaks and experts from the American Psychological Association answer questions on everything from how to talk about COVID-19 to your child with autism to how to feel supported in your own self-care. Includes links to resources.\n\nWhat does the autism community need to know about COVID-19?\n\n Basics and tips about hygiene and how to discuss the current situation with your child with autism.\n\nWHO Guidance for the Public\n\n The World Health Organization has up-to-date, comprehensive information and resources for the public on responding to the current Coronavirus (COVID-19) pandemic.\n\nMy child needs to be admitted to the hospital. How can I help them cope with an inpatient stay? How can I explain their needs to the staff?\n\n Angeles Nunez, a certified child-life specialist, offers guidance for families and caregivers of autistics who may be facing hospitalization.\n\nTelehealth Tool Kit for Families and Providers\n\n This resource, created by the Family Advisory Council of the Autism Speaks Autism Treatment Network/AIR-P, offers families and providers tips for successful telehealth visits for children and adults with autism. Developed by the Autism Speaks Autism Treatment Network/AIR-P/Autism Learning Health Network.\n\nIn this brief video, Autism Speaks Community Outreach Director Janet Williams offers tips to individuals and families on how to stay safe and healthy in regions of the country that are re-opening for business and community activities.", "opengraph": {"site_name": "Autism Speaks", "url": "https://www.autismspeaks.org/covid-19-information-and-resources-families", "title": "COVID-19 information & resources for families | Autism Speaks", "description": "Autism and COVID-19 parent support and resources. The Autism Response Team (ART) is here to help based on your family’s situation.", "image": "https://www.autismspeaks.org/sites/default/files/COVIDresources-20.png", "image:url": "https://www.autismspeaks.org/sites/default/files/COVIDresources-20.png", "image:secure_url": "https://www.autismspeaks.org/sites/default/files/COVIDresources-20.png"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "854", "height": "480", "embed_code": "<iframe width=\"854\" height=\"480\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" src=\"https://www.youtube.com/embed/zjGXPhpZHV0?autoplay=0&amp;start=0&amp;rel=0\"/>", "src": "https://www.youtube.com/embed/zjGXPhpZHV0?autoplay=0&start=0&rel=0"}], "links": ["/autism-response-team-art", "#Vaccines", "#FoodResources", "#ParentTraining", "#Behavioral", "#StressMental", "#Teaching Stories", "#Educational", "#OtherGuidance", "https://www.autismspeaks.org/sites/default/files/Vaccine%20Hesitancy%20Flyer%20-Community.pdf", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/index.html", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/your-vaccination.html", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/booster-shot.html", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/recommendations/disabilities.html", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/faq.html", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/facts.html", "https://acl.gov/DIAL", "https://acl.gov/DIAL", "https://www.vaccines.gov/", "https://www.cvs.com/immunizations/covid-19-vaccine", "https://www.riteaid.com/covid-19", "https://acl.gov/DIAL", "https://www.autismspeaks.org/sites/default/files/Getting_Vaccine_Information_Individuals_Families.pdf", "https://www.autismspeaks.org/sites/default/files/Vaccine_Support_Card_Individuals_Families.pdf", "http://act.autismspeaks.org/site/DocServer?docID=4004", "https://parenttraining.chip.uconn.edu/", "http://www.exercisebuddy.com/", "https://helpisinyourhands.org/", "/sites/default/files/Caring_individuals_autism_during_crisis.pdf", "/sites/default/files/We_Wear_Masks_COVID-19.pdf", "https://www.youtube.com/watch?v=v_Q6OI_ij-o", "https://www.youtube.com/watch?v=T1I4BcpTfIk", "http://autismcertificationcenter.org/here-to-help", "https://www.youtube.com/watch?v=xkZ23tDzN4c&feature=youtu.be", "https://health.ucdavis.edu/mindinstitute/centers/cedd/adept.html", "https://afirm.fpg.unc.edu/sites/afirm.fpg.unc.edu/files/covid-resources/Supporting%20Individuals%20with%20Autism%20through%20Uncertian%20Times%20Full%20Packet.pdf", "https://www.autismspeaks.org/tool-kit/challenging-behaviors-tool-kit", "https://www.autismspeaks.org/news/tips-managing-children-home-during-covid-19", "https://autisminternetmodules.org/", "https://www.cincinnatichildrens.org/service/d/developmental-behavioral/patients/outreach", "https://www.youtube.com/watch?v=wgeQRyQ-hg4&feature=youtu.be", "https://www.youtube.com/watch?v=nVnchPncZqA&feature=youtu.be", "https://www.youtube.com/watch?v=3GdfdmvNLkw&feature=youtu.be", "https://www.youtube.com/watch?v=WKFRWHPW7o4&feature=youtu.be", "https://www.youtube.com/watch?v=DFLL69Patsw&feature=youtu.be", "https://www.autism.org/webinars-autism/", "/news/how-cope-disrupted-family-routines-during-covid-19", "https://www.autismspeaks.org/sites/default/files/Autism Speaks Disrupted Routines Teaching Story.pdf", "/tool-kit/challenging-behaviors-tool-kit", "https://youtu.be/eX-SMH8XYFk", "/science-news/how-handle-clinical-care-during-social-distancing-and-schoolprogram-closures", "/news/tips-managing-children-home-during-covid-19", "/expert-opinion/my-child-sometimes-aggressive-what-can-help", "/expert-opinion/parents-seek-help-son-autism-and-recurring-behavioral-crises", "/expert-opinion/mom-perplexed-toddler-running-back-and-forth-shaking-things", "/expert-opinion/family-remote-area-seeks-autism-treatment-guidance", "/blog/day-life-moms-perspective-parenting-during-pandemic", "https://www.nctsn.org/sites/default/files/resources/fact-sheet/outbreak_factsheet_1.pdf", "https://www.apa.org/practice/programs/dmhi/research-information/pandemics", "https://www.apa.org/research/action/children-disabilities-covid-19", "https://www.apa.org/research/action/speaking-of-psychology/covid-19-mental-health", "https://www.who.int/docs/default-source/coronaviruse/coping-with-stress.pdf", "https://suicidepreventionlifeline.org/", "https://www.crisistextline.org/", "https://www.samhsa.gov/grants/grant-announcements/sm-16-006", "https://www.nami.org/About-NAMI/Publications-Reports/Guides/Navigating-a-Mental-Health-Crisis", "https://www.nami.org/About-NAMI/Publications-Reports/Guides/Navigating-a-Mental-Health-Crisis", "https://www.samhsa.gov/newsroom/press-announcements/202003240200", "https://www.autismspeaks.org/blog/autism-care-network-works-improve-mental-health-among-autistic-youth", "https://autismcarenetwork.org/", "/sites/default/files/My%20Day%20at%20Home%20Visual%20Support.docx", "/sites/default/files/flu_teaching_story_final%20%281%29.pdf", "/science-news/how-handle-school-closures-and-services-your-child-autism", "http://jooay.com/", "https://www.facebook.com/groups/JooayCommunity/", "https://www.apa.org/topics/covid-19/children-adolescents-autism", "https://www.autismspeaks.org/science-news/what-should-autism-community-know-about-coronavirus-outbreak", "https://www.who.int/emergencies/diseases/novel-coronavirus-2019/advice-for-public", "https://www.autismspeaks.org/expert-opinion/my-child-needs-be-admitted-hospital-how-can-i-help-them-cope-inpatient-stay-how-can", "http://act.autismspeaks.org/site/Survey?ACTION_REQUIRED=URI_ACTION_USER_REQUESTS&SURVEY_ID=9407", "https://www.youtube.com/watch?v=8egjdU3vqdc&feature=youtu.be", "https://www.youtube.com/watch?v=s4WEN6bAScw&feature=youtu.be"], "authors": [], "publish_date": null}