{"result_id": "041008", "URL": "https://www.autismspeaks.org/advocacy-news/autism-speaks-joins-disability-groups-calling-priority-access-covid-vaccine-people", "timestamp": "2023-04-25 12:11:52 CEST+0200", "meta": {"description": "Autism and vaccines. Autism Speaks joins several disability groups in advocating for the autism community to be among the first to receive access to the COVID-19 vaccine.", "lang": "en", "keywords": "", "favicon": "/themes/custom/particle/apps/drupal/favicon.ico", "canonical": "https://www.autismspeaks.org/advocacy-news/autism-speaks-joins-disability-groups-calling-priority-access-covid-vaccine-people", "encoding": "utf-8"}, "image": null, "domain": "www.autismspeaks.org", "title": "joins disability groups calling for priority access to COVID vaccine for people with autism", "cleaned_text": "As government health agencies coordinate distribution plans and priority access for newly approved COVID-19 vaccines, Autism Speaks joined several disability groups in advocating for the autism community to be among the first to receive access to this critical protection.\n\n“Research suggests that autistic people, who have a higher risk for other health conditions and are more likely to live in group or supported living facilities as adults, are at greater risk of contracting COVID and developing severe disease,” said Thomas W. Frazier, Ph.D., chief science officer at Autism Speaks. “Priority access to the COVID vaccine for autistic individuals and the health care and direct care professionals who work with them, will allow autistic people to safely get the services and supports they need, so many of which have been limited as a result of the pandemic.”\n\nToday’s statement acknowledges that the autism community has been more severely affected in many ways by the pandemic. Examples of the challenges resulting from the outbreak include:\n• Many public health measures can be very challenging for people with autism, depending on each individual’s challenges and support needs, as evidenced by reported difficulty wearing masks and social distancing.\n• In addition to school and work closures, many children and adults with autism have been unable to get the medical care, behavioral therapies and education services they need to reach their full potential.\n• Many autism diagnosis appointments, which had long waitlists before the pandemic, have been delayed, potentially impacting getting therapies and services to children when they are most effective.\n• Direct service providers and health care personnel who assist people with autism, like many others, have encountered shortages of personal protective equipment and have had to cope with increased stress.\n\nFurther, a recent survey by Autism Speaks found that more than 9 percent of white families and more than 17 percent of minority families did not receive any distance learning supports during the pandemic.\n\n“While the survey showed that people were using telehealth to get some needed services, not all services are effectively delivered this way, and many people are not able to meaningfully participate in a therapy delivered virtually,” said Dr. Frazier. “Telehealth has helped tremendously to fill the gap in services in 2020, but it does have inherent limits.”\n\nEven with more telehealth options being accessed, many autistic children and adults report having experienced regression, or a loss of skills, as a result of extended time at home without access to their service providers.\n\n“For someone with autism and limited communication skills or behavior challenges common in autism, protection afforded by the vaccine can have an immeasurable impact. It can enable renewed participation in community life, access to vital services and supports, and an opportunity to begin the recovery from the disruptions in care that have taken place this year,” said Angela Geiger, president and CEO of Autism Speaks. “This can also be a crucial step for family members and caregivers of people with autism who have more significant needs.”\n\nAs with any other medical decision, families and individuals should work with their healthcare providers to make decisions that are right for them.\n\nAutism Speaks has not independently verified the safety and efficacy of the COVID-19 vaccine, but it is important to note that the weight of scientific evidence indicates that vaccines do not play a role in the development of autism. Please reference the American Academy of Pediatrics (AAP) for recommended immunization schedules.\n\n“Autism Speaks urges federal public health officials and policy makers to prioritize the health of the most vulnerable Americans, including those with autism spectrum disorders, for access to any approved COVID-19 vaccine,” Geiger said.", "opengraph": {"site_name": "Autism Speaks", "url": "https://www.autismspeaks.org/advocacy-news/autism-speaks-joins-disability-groups-calling-priority-access-covid-vaccine-people", "title": "Autism Speaks joins disability groups calling for priority access to COVID vaccine for people with autism | Autism Speaks", "description": "Autism and vaccines. Autism Speaks joins several disability groups in advocating for the autism community to be among the first to receive access to the COVID-19 vaccine.", "image": "https://www.autismspeaks.org/sites/default/files/fusion-medical-animation-npjP0dCtoxo-unsplash.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.autism-society.org/news/the-autism-society-of-america-and-national-disability-organizations-encourage-the-autism-and-i-dd-community-to-be-prioritized-for-covid-19-vaccination/", "/science-news/covid-19-survey-reveals-widespread-challenges-autism-community-and-wider-disparities", "https://www.aap.org/en-us/advocacy-and-policy/aap-health-initiatives/immunizations/Pages/Immunizations-home.aspx"], "authors": [], "publish_date": null}