{"result_id": "041009", "URL": "https://www.autismspeaks.org/covid-19-information-and-resources-educators-and-health-professionals", "timestamp": "2023-04-25 12:11:53 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/themes/custom/particle/apps/drupal/favicon.ico", "canonical": "https://www.autismspeaks.org/covid-19-information-and-resources-educators-and-health-professionals", "encoding": "utf-8"}, "image": null, "domain": "www.autismspeaks.org", "title": "COVID-19 information and resources for educators and health professionals", "cleaned_text": "COVID-19 Vaccines: What You Should Know\n\n Vaccines are the best tools we have to fight the COVID-19 pandemic and keep our communities healthy, but many people still have concerns about their safety. Here are some facts that can help you combat vaccine misinformation and some tips to make the vaccination experience more autism-friendly.\n\nVaccine Experience Tool Kit\n\n The Vaccine Experience Tool Kit was designed to help vaccination sites create an inclusive experience for people with autism and other related conditions.\n\nInformation and Resources for Schools and School Personnel \n\n This resource page from the US Department of Education includes guidance documents for elementary schools, secondary schools, and institutes of higher education. Additional resources address questions about grant funding, adult education, and WIOA.\n\nCDC Guidance for Administrators of US K-12 Schools, Early Childhood Education, and Childcare Programs \n\n The CDC provides guidance for administrators of childcare programs, early childhood education, and K-12 schools on preparing for and responding to the current public health crisis.\n\nTelehealth Tool Kit for Families and Providers\n\n This resource, created by the Family Advisory Council of the Autism Speaks Autism Treatment Network/AIR-P, offers families and providers tips for successful telehealth visits for children and adults with autism. Developed by the Autism Speaks Autism Treatment Network/AIR-P/Autism Learning Health Network.\n\nProviding Services to Children with Disabilities During the Coronavirus Disease 2019 Outbreak \n\n The US Department of Education has compiled questions and answers on providing services to children with disabilities during the outbreak of COVID-19. This includes guidance around IDEA regulations and implementation of IEPs.\n\nAmerican Psychological Association Guidance for Professionals \n\n The American Psychological Association has compiled many resources to help professionals, researchers, and the general public cope with the impact of COVID-19. This page includes information for professionals related to practice guidelines, telehealth, and self-care.\n\nHealth Resources & Services Administration (HRSA) FAQs for Health Centers on COVID-19\n\n Health centers are providing essential services during the COVID-19 pandemic. HRSA has compiled this information to answer FAQs and provide guidance to support the practice of essential healthcare providers at this time.\n\nNational Association of Community Health Centers Guidance on Telehealth Practice During COVID-19\n\n This is a memo from the National Association of Community Health Centers detailing technical assistance and guidance around the use of telehealth practice.\n\nGlobal Autism Community Facing Challenges of COVID-19 Disruptions: Guidance for Service Providers\n\n Guidance for autism service providers in responding to widespread school closures and lockdowns and continuing clinical care.\n\nPractice Parameters for Telehealth-Implementation of Applied Behavior Analysis: Continuity of Care During the COVID-19 Pandemic", "opengraph": {"site_name": "Autism Speaks", "url": "https://www.autismspeaks.org/covid-19-information-and-resources-educators-and-health-professionals", "title": "COVID-19 information and resources for educators and health professionals | Autism Speaks"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.autismspeaks.org/sites/default/files/Vaccine%20Hesitancy%20Flyer%20-Community.pdf", "https://www.autismspeaks.org/tool-kit/vaccine-experience-tool-kit", "https://www.ed.gov/coronavirus?src=feature", "https://www.cdc.gov/coronavirus/2019-ncov/community/index.html", "http://act.autismspeaks.org/site/Survey?ACTION_REQUIRED=URI_ACTION_USER_REQUESTS&SURVEY_ID=9407", "https://www2.ed.gov/policy/speced/guid/idea/memosdcltrs/qa-covid-19-03-12-2020.pdf", "https://www.apa.org/practice/programs/dmhi/research-information/pandemics", "https://bphc.hrsa.gov/emergency-response/coronavirus-frequently-asked-questions.html", "http://www.nachc.org/wp-content/uploads/2020/03/Telehealth-Assistance-During-COVID19-FINAL-FLYER-3.17.20.pdf", "https://www.autismspeaks.org/science-news/challenges-covid-19-disruptions-guidance-autism-service-providers", "https://casproviders.org/practice-parameters-for-telehealth/"], "authors": [], "publish_date": null}