{"result_id": "041045", "URL": "https://www.autismspeaks.org/expert-opinion/autism-and-doctor-visit-communication-tips-success", "timestamp": "2023-04-25 12:12:19 CEST+0200", "meta": {"description": "A pediatrician with Missouri's Thompson Center for Autism shares strategies for making medical appointments run smoothly for kids on the spectrum", "lang": "en", "keywords": "", "favicon": "/themes/custom/particle/apps/drupal/favicon.ico", "canonical": "https://www.autismspeaks.org/expert-opinion/autism-and-doctor-visit-communication-tips-success", "encoding": "utf-8"}, "image": null, "domain": "www.autismspeaks.org", "title": "Autism and the doctor visit: Communication tips for success", "cleaned_text": "A pediatrician with Missouri’s Thompson Center for Autism shares strategies for making medical appointments run smoothly for kids on the spectrum\n\nBy pediatrician Kristin Sohl, of the University of Missouri’s Thompson Center for Autism and Neurodevelopmental Disorders. The Thompson Center is one of 13 sites in the Autism Speaks Autism Treatment Network.\n\nAs readers of this website know well, doctor visits can be a challenge for patients with autism, their families and healthcare providers. In my role as a pediatrician, I’ve summarized several steps that providers and families can take to make medical visits more successful. All of them require good communication between the provider and parent before, during and after medical visits.\n\nAlso see our related video at the end of my tips. If you find the video and tips helpful, please consider sharing them with your child’s healthcare team.\n\nParents or caregivers should call ahead to the provider’s office to discuss individual accommodations that the patient might need during the visit. These might include bringing along a comfort item or a distraction toy. Tell the office staff if there have been prior negative experiences – or successful ones – to help guide the staff in providing a supportive environment and avoiding your child’s triggers for problem behavior.\n\nParents and providers should discuss a backup plan at the start of the appointment to determine when to stop a procedure or when to call in more assistance.\n\nProviders should also know the goals of the visit and prioritize necessary objectives, such as lab work, to make appointments run smoothly.\n\nIf the care team observes increasing agitation in a patient who has autism, they should consider whether the results of any procedure or visit are urgent or critical and discuss with the family whether to proceed.\n\nProviders should explain what they’re doing before they do it to reduce uncertainty and encourage the patient’s understanding of the procedures.”\n\nI recommend that doctors use simple, direct communication when talking to a child – or adult – who has autism and supplement this with visual supports when needed. Many people on the spectrum are confused by idioms or turns of phrase that might have a different literal meaning.\n\n\n\n Learn more about visual supports and download the Autism Speaks ATN visual supports tool kit.\n\nTo get the most out of a visit, I also recommend the use of rewards and reinforcements as the child moves through routine procedures such as vitals checks or blood draws. As a parent, you likely know best what motivates your child.\n\nCommunication remains important once the appointment is over. I recommend that parents follow up with a phone call or email to let the office staff know what helped and any needs or suggestions for the next visit.\n\nRemember to praise your child for his or her successes and attempts.\n\nFor more tips and strategies, also see:\n• Autism and doctor visits: Family seeks help to ease daughter's fears\n• Taking the Work Out of Blood Work, An Autism Speaks ATN/AIR-P tool kits for parents and providers", "opengraph": {"site_name": "Autism Speaks", "url": "https://www.autismspeaks.org/expert-opinion/autism-and-doctor-visit-communication-tips-success", "title": "Autism and the doctor visit: Communication tips for success | Autism Speaks", "description": "A pediatrician with Missouri's Thompson Center for Autism shares strategies for making medical appointments run smoothly for kids on the spectrum"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "vimeo", "width": "854", "height": "480", "embed_code": "<iframe width=\"854\" height=\"480\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" src=\"https://player.vimeo.com/video/202110683?autoplay=0\"/>", "src": "https://player.vimeo.com/video/202110683?autoplay=0"}], "links": ["/autism-treatment-network-atn", "/tool-kit/atnair-p-visual-supports-and-autism", "/tool-kit/atnair-p-visual-supports-and-autism", "/expert-opinion/autism-and-doctor-visits-family-seeks-help-ease-daughters-fears", "/science-blog/atnwork-visual-supports-ease-medical-visits-kids-autism", "/tool-kit/atnair-p-parents-guide-blood-draws"], "authors": [], "publish_date": null}