{"result_id": "041017", "URL": "https://www.autismspeaks.org/profile/meet-kristen-and-hudson-t", "timestamp": "2023-04-25 12:11:59 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/themes/custom/particle/apps/drupal/favicon.ico", "canonical": "https://www.autismspeaks.org/profile/meet-kristen-and-hudson-t", "encoding": "utf-8"}, "image": null, "domain": "www.autismspeaks.org", "title": "Meet Kristen and Hudson T.", "cleaned_text": "For many, the COVID-19 pandemic has created so much uncertainty. Day-to-day life has been disrupted ― care programs may be closed due to social distancing guidelines, daily routines can no longer be followed and health regulations may be overwhelming.\n\n“As a child on the spectrum, Hudson depends and thrives on a daily (and consistent) routine. It was extremely hard on all of us within the household to adjust to this major change for Hudson,” says Kristen about life with her 4-year-old son Hudson – and coronavirus.\n\n“At a time such as this, it is SO important to utilize any and all support you can get.”\n\nWith the online resources provided by Autism Speaks, Kristen and Hudson have been able to better adapt to their new normal.\n\n“Autism Speaks provides an abundance of links and resources that had helped us through the thick of adjusting to our new routine at home!” said Kristen. “Not only did it give us techniques and tips for homeschool but it also gave great insight into how to help your child cope with the stress and how to best handle behaviors that may stem from it!”\n\nTo support the autism community, Autism Speaks has worked to create a free online library full of reliable information for adults with autism, families, or other professionals who may need support and tips. Ranging from topics like how to adjust to new routines, applying for unemployment, exercising while at home and how to avoid caretaker burnout, the support can be a lifeline for many during this time.\n\nIf you would like to learn more about these resources and how Autism Speaks is responding to the COVID-19 pandemic, please visit autismspeaks.org/coronavirus. For further assistance, contact the Autism Response Team at 888-AUTISM2 or help@autismspeaks.org.", "opengraph": {"site_name": "Autism Speaks", "url": "https://www.autismspeaks.org/profile/meet-kristen-and-hudson-t", "title": "Meet Kristen and Hudson T. | Autism Speaks", "image": "https://www.autismspeaks.org/sites/default/files/Kristen_Hudson_0.jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["/coronavirus", "mailto:help@autismspeaks.org"], "authors": [], "publish_date": null}