{"result_id": "041002", "URL": "https://www.autismspeaks.org/blog/autistic-self-advocate-shares-his-covid-19-vaccine-experience", "timestamp": "2023-04-25 12:11:46 CEST+0200", "meta": {"description": "Click here to read about how autistic self-advocate, Paul Silver, faced his fear of needles to make sure the people in his community stayed safe and healthy by getting vaccinated against COVID-19.", "lang": "en", "keywords": "", "favicon": "/themes/custom/particle/apps/drupal/favicon.ico", "canonical": "https://www.autismspeaks.org/blog/autistic-self-advocate-shares-his-covid-19-vaccine-experience", "encoding": "utf-8"}, "image": null, "domain": "www.autismspeaks.org", "title": "An autistic self-advocate shares his COVID-19 vaccine experience", "cleaned_text": "When the COVID-19 pandemic hit, Paul Silver knew he only had one good choice: to get vaccinated and protect himself, his family and his colleagues. As an autism advocate and professional in the medical field, Paul faced his fear of needles to make sure the people in his community stayed safe and healthy.\n\nIn this Q&A, learn more about Paul and his experience getting vaccinated.\n\nCan you tell me a bit about yourself?\n\nI was diagnosed with Asperger’s syndrome at age 8. I’ve resided in Florida for 3 years now, but I became an autism advocate in my late 20s when I lived in my home state of Georgia. There, I helped pass the autism insurance reform law known as Ava’s law. Now, I work in the medical field doing medical coding.\n\nWhat has the pandemic been like for you?\n\nDuring the lockdown period, my parents were living with me while they built their own house. My dad had to work from home, and I went into the office. I also went back to school to learn medical coding.\n\nI didn’t feel comfortable wearing a mask at first. It took me a week or two to get comfortable. I stopped wearing a mask this year because the rules in Florida changed.\n\nHow has your experience in the medical field affected your opinion about getting the vaccine?\n\nEven before the pandemic, I had a healthy relationship with vaccines even though I’m afraid of needles. I actually had a falling out with one of my mentors who believed vaccines cause autism, which made me lose faith in her.\n\nThe reason I believe in vaccines is I work in the medical field and my uncle and grandfather were physicians. As part of my job, I have to go inside hospitals to drop off paperwork for surgery, so I knew I had to take some precautions.\n\nI planned to get the vaccine once I knew it was available for me. I did some research, but when I heard that no one was having major issues, I just got it.\n\nWhat advice would you give to autistic people who might need accommodations when they get the vaccine?\n\nI just tell people not to look at the needle when they do it. Look in the opposite direction—that’s my trick. I’ve been doing this trick since I was going to the pediatrician. Another idea I heard recently is bringing a tablet computer or playing a game as a distraction.\n\nHow do you feel about the fact that so many people are resistant to getting the vaccine?\n\nIt’s concerning to me that people do not take the COVID-19 vaccine. However, I go along with my regular life because I know I’m protected. I got the Johnson & Johnson shot originally and then I got the Moderna booster once they said it was ok to mix vaccines. My rule is unless you have a certain medical reason and you can’t get vaccinated, that’s the only exception.", "opengraph": {"site_name": "Autism Speaks", "url": "https://www.autismspeaks.org/blog/autistic-self-advocate-shares-his-covid-19-vaccine-experience", "title": "An autistic self-advocate shares his COVID-19 vaccine experience | Autism Speaks", "description": "Click here to read about how autistic self-advocate, Paul Silver, faced his fear of needles to make sure the people in his community stayed safe and healthy by getting vaccinated against COVID-19.", "image": "https://www.autismspeaks.org/sites/default/files/Paul%20Silver%20%20.jpg"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}