{"result_id": "041018", "URL": "https://www.autismspeaks.org/covid-19-information-and-resources", "timestamp": "2023-04-25 12:12:00 CEST+0200", "meta": {"description": "Autism Speaks is leading the COVID-19 Autism Research Community Task Force to tap the rich knowledge and expertise of autism researchers during the pandemic, and offer the best available evidence-based tools here for your use.", "lang": "en", "keywords": "", "favicon": "/themes/custom/particle/apps/drupal/favicon.ico", "canonical": "https://www.autismspeaks.org/covid-19-information-and-resources", "encoding": "utf-8"}, "image": null, "domain": "www.autismspeaks.org", "title": "COVID-19 (coronavirus) information and resources", "cleaned_text": "As Autism Speaks continues to monitor the evolving situation around COVID-19, our sincere hope is that you and your loved ones are staying safe and healthy. The situation is changing rapidly; stay informed by visiting the CDC’s information page regularly.\n\nIn the wake of the coronavirus (COVID-19) pandemic, it can be difficult to wade through what will be an effective tool to cope with widespread disruptions to the daily lives of autistic children, teens and adults. Autism Speaks is leading the COVID-19 Autism Research Community Task Force to tap the rich knowledge and expertise of autism researchers during the pandemic, and offer the best available evidence-based tools here for your use.\n\nIn partnership with the Autism Science Foundation (ASF), working together with the International Society for Autism Research (INSAR) and the Simons Foundation Autism Research Initiative (SFARI), the task force has asked autism researchers to create ready-to-use tools for the range of support needs to help people with autism through this crisis. The task force will rapidly review, assess and distribute these tools to the public, posting them on this page as a quick reference. Tools vetted by the Task Force are indicated with a ? symbol.\n\nAs COVID-19 vaccines are distributed throughout the country, Autism Speaks hosted the CDC’s Georgina Peacock, M.D., and the presidents of the Autism Society of America and Autism Science Foundation on for a webinar about COVID vaccines and autism. Watch it here.", "opengraph": {"site_name": "Autism Speaks", "url": "https://www.autismspeaks.org/covid-19-information-and-resources", "title": "COVID-19 (coronavirus) information and resources | Autism Speaks", "description": "Autism Speaks is leading the COVID-19 Autism Research Community Task Force to tap the rich knowledge and expertise of autism researchers during the pandemic, and offer the best available evidence-based tools here for your use.", "image": "https://www.autismspeaks.org/sites/default/files/COVIDresources-20.jpg", "image:url": "https://www.autismspeaks.org/sites/default/files/COVIDresources-20.jpg", "image:secure_url": "https://www.autismspeaks.org/sites/default/files/COVIDresources-20.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.cdc.gov/coronavirus/2019-nCoV/index.html", "http://www.autism-society.org/", "http://www.autismsciencefoundation.org/", "https://www.autismspeaks.org/science-news/autism-speaks-cdc-and-partners-answer-covid-vaccine-questions-autism-community"], "authors": [], "publish_date": null}