{"result_id": "041036", "URL": "https://www.autismspeaks.org/science-news/new-meta-analysis-confirms-no-association-between-autism-and-vaccines", "timestamp": "2023-04-25 12:12:14 CEST+0200", "meta": {"description": "Is there a connection between autism and vaccines? Studies reaffirm that vaccines don't cause autism and that some immunizations can decrease autism risk.", "lang": "en", "keywords": "", "favicon": "/themes/custom/particle/apps/drupal/favicon.ico", "canonical": "https://www.autismspeaks.org/science-news/new-meta-analysis-confirms-no-association-between-autism-and-vaccines", "encoding": "utf-8"}, "image": null, "domain": "www.autismspeaks.org", "title": "New Meta-analysis Confirms: No Association Between Autism and Vaccines", "cleaned_text": "Analysis of 10 studies involving more than 1.2 million children reaffirms that vaccines don’t cause autism; MMR shot may actually decrease risk\n\nA meta-analysis of ten studies involving more than 1.2 million children reaffirms that vaccines don’t cause autism. If anything, immunization was associated with decreased risk that children would develop autism, a possibility that’s strongest with the measles-mumps-rubella vaccine.\n\nThe report appears online in the journal Vaccine as an “uncorrected proof.” This means that it has passed through peer review and been accepted for publication, but may still undergo proof-reading changes.\n\nA meta-analysis combines and analyzes the results of multiple, earlier studies. By increasing the size of the sample – in this case to 1,266,327 children –scientists can generate more accurate conclusions than would be possible with a single study.\n\n“This analysis provides further confirmation for a lack of association between vaccines and autism that the broader healthcare community has understood and embraced for some time,” comments Autism Speaks Chief Science Officer Rob Ring. \"Autism Speaks’ own policy on vaccines echoes those of other credible healthcare organizations like the American Academy of Pediatrics and the World Health Organization. We strongly encourage parents to work with their physician to ensure their children receive the full benefits immunization offers in protecting their loved ones against a variety of preventable childhood diseases.”\n\nThe study’s authors, from the University of Sydney, in Australia, summarized their findings as follows:\n• There was no relationship between vaccination and autism (OR: 0.99; 95% CI: 0.92 to 1.06).\n• There was no relationship between vaccination and ASD [autism spectrum disorder] (OR: 0.91; 95% CI: 0.68 to 1.20).\n• There was no relationship between [autism/ASD] and MMR (OR: 0.84; 95% CI: 0.70 to 1.01).\n• There was no relationship between [autism/ASD] and thimerosal (OR: 1.00; 95% CI: 0.77 to 1.31).\n• There was no relationship between [autism/ASD] and mercury (Hg) (OR: 1.00; 95% CI: 0.93 to 1.07).\n\nBy “autism,” the researchers are referring to “autistic disorder,” a term generally reserved for those on the most severely affected end of the autism spectrum.\n\nThe abbreviation OR stands for odds ratio. Here it measures the difference in risk for autism between two groups – for example those who received the MMR (measles-mumps-rubella) vaccine versus those who did not. An odds ratio of 1 means no difference in risk. Numbers below 1.00 indicate decreased risk. Those above 1.00 indicate increased risk. The possibility of decreased risk was strongest for the MMR vaccine, with an odds ratio of 0.84, or a 16 percent risk reduction.\n\nCI stands for confidence interval, and “95% CI” means that, with 95 percent confidence, the true difference in risk falls within the range of values given. In general, the range of possible values tightens as the size of the total sample studied increases.\n\n“Meta-analysis can be a powerful research approach,” comments epidemiologist Michael Rosanoff, Autism Speaks associate director for public health research. “It assesses the quality of data across multiple studies and combines the highest-quality data to give us a ‘higher definition picture’ of the relationship between potential risk factors and autism.” (Rosanoff was not involved in the analysis.)\n\nAcknowledging parents’ concerns, one of the three authors added the following epilogue to the report:\n\nAs an epidemiologist I believe the data that is presented in this meta-analysis. However, as a parent of three children I have some understanding of the fears associated with reactions and effects of vaccines. My first two children have had febrile seizures after routine vaccinations, one of them a serious event. These events did not stop me from vaccinating my third child, however, I did take some proactive measures to reduce the risk of similar adverse effects. I vaccinated my child in the morning so that we were aware if any early adverse reaction during the day and I also gave my child a dose of paracetamol 30 min before the vaccination was given to reduce any fever that might develop after the injection. As a parent I know my children better than anyone and I equate their seizures to the effects of the vaccination by increasing their body temperature. For parents who do notice a significant change in their child's cognitive function and behaviour after a vaccination I encourage you to report these events immediately to your family physician and to the 'Vaccine Adverse Event Reporting System'.", "opengraph": {"site_name": "Autism Speaks", "url": "https://www.autismspeaks.org/science-news/new-meta-analysis-confirms-no-association-between-autism-and-vaccines", "title": "New Meta-analysis Confirms: No Association Between Autism and Vaccines | Autism Speaks", "description": "Is there a connection between autism and vaccines? Studies reaffirm that vaccines don't cause autism and that some immunizations can decrease autism risk."}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.sciencedirect.com/science/article/pii/S0264410X14006367", "https://www.autismspeaks.org/record#vaccines"], "authors": [], "publish_date": null}