{"result_id": "041024", "URL": "https://www.autismspeaks.org/press-release/florida-issues-new-covid-19-testing-requirement-group-home-staff", "timestamp": "2023-04-25 12:12:04 CEST+0200", "meta": {"description": "Autism Speaks commends Florida for vital testing rules for staff of group homes for individuals with developmental and/or intellectual disabilities.", "lang": "en", "keywords": "", "favicon": "/themes/custom/particle/apps/drupal/favicon.ico", "canonical": "https://www.autismspeaks.org/press-release/florida-issues-new-covid-19-testing-requirement-group-home-staff", "encoding": "utf-8"}, "image": null, "domain": "www.autismspeaks.org", "title": "Florida issues new COVID-19 testing requirement for group home staff", "cleaned_text": "Autism Speaks commends Florida for vital testing rules for staff of group homes for individuals with developmental and/or intellectual disabilities.\n\nRecently, Autism Speaks urged Gov. DeSantis and Florida health and disability leaders to provide adequate COVID testing to protect residents in group homes for individuals with developmental and/or intellectual disabilities, including autism. In many cases, residents of these group homes may be more susceptible to acquiring COVID-19 and its complications including higher death rates. Spikes in COVID cases have been reported in various communities around the country, including in Florida. Effective identification of COVID-19 infection paves the way to quarantine and prevents infection spread through contact tracing.\n\nWe are pleased that an emergency order was issued today, requiring group home staff to be tested every two weeks at no cost. We thank Gov. DeSantis and Florida health and disability leaders for this rapid response. Prior to this order, State of Florida officials referred group homes to local health departments or other resources for COVID testing, resulting in a lack of adequate or coordinated testing and oversight to ensure protection of residents.\n\nAccording to Florida Agency for Persons with Disabilities (APD) Director Barbara Palmer, “APD wants our customers to receive the best possible care wherever they live. We understand this Emergency Rule will require a lot of coordination and logistics to test our licensed home and facility employees every 14 days; however, it is a vital step to help ensure the safety of our employees and customers.”\n\nTest kits will be provided by the State of Florida without charge to the homes and facilities. They will be mailed directly to homes and facilities, which will implement their own testing schedules. Homes that have recently done testing may wait two weeks before conducting new testing. Group homes without any current residents are exempt from this requirement.\n\nLicensed homes will be required to maintain a record of testing at each facility, and they must report compliance with testing and test results to APD by the first and fifteenth of each month. Today’s emergency action to try to stop the spread of COVID-19 into facilities overseen by APD is consistent with rules previously issued by the Agency for Health Care Administration related to nursing homes and assisted living facilities.\n\nClick here for more information on Autism Speaks advocacy priorities related to the impact of COVID-19 on our community.", "opengraph": {"site_name": "Autism Speaks", "url": "https://www.autismspeaks.org/press-release/florida-issues-new-covid-19-testing-requirement-group-home-staff", "title": "Florida issues new COVID-19 testing requirement for group home staff | Autism Speaks", "description": "Autism Speaks commends Florida for vital testing rules for staff of group homes for individuals with developmental and/or intellectual disabilities.", "image": "https://www.autismspeaks.org/sites/default/files/covid-19-4922384_1920.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.flrules.org/gateway/View_Notice.asp?id=23504475", "https://www.autismspeaks.org/advocacy-priorities-public-policy-priories-during-covid-19"], "authors": [], "publish_date": null}