{"result_id": "042030", "URL": "https://awakecanada.org/13-reasons-to-have-state-attorney-generals-seize-and-destroy-all-covid-19-mrna-bioweapons/?utm_source=rss&utm_medium=rss&utm_campaign=13-reasons-to-have-state-attorney-generals-seize-and-destroy-all-covid-19-mrna-bioweapons", "timestamp": "2023-04-25 12:14:15 CEST+0200", "meta": {"description": "Have we been gaslit into believing that we don't have the evidence or legal standing to stop the COVID-19 mRNA biowarfare operation dead in its track? Insight into what happened and what we can do. This post was first posted by: Karen Kingston Can We Take Civil or Criminal Actions Against Big Pharma? Have you", "lang": "en", "keywords": "", "favicon": "https://awakening.s3.amazonaws.com/wp-content/uploads/2021/10/09132407/favicon-32x32-1.png", "canonical": "https://awakecanada.org/13-reasons-to-have-state-attorney-generals-seize-and-destroy-all-covid-19-mrna-bioweapons/", "encoding": "utf-8"}, "image": null, "domain": "awakecanada.org", "title": "13 Reasons to Have State Attorney Generals Seize and Destroy All COVID-19 mRNA Bioweapons", "cleaned_text": "Can We Take Civil or Criminal Actions Against Big Pharma?\n\nHave you been told that we can’t take civil or criminal action against Big Pharma or the government? Do you want to know why no criminal charges have been brought against Pfizer, Moderna, J&J, the FDA, HHS, CDC, NIH, and others involved in the development, manufacturing, distribution, promotion, and administration of these bioweapons falsely referred to as mRNA vaccines? It could be because 99.9% of Americans are victims of extrinsic fraud, or in non-legal terms, narcissistic gaslighting.\n\nGaslighting is the intentional use of repetitive and patterned manipulation techniques to make individuals, groups, or even entire populations question their reality. Gaslighting is often used by influential people with narcissistic personality disorder (NPD) as means of gaining power, by making people dependent on them for information and guidance. Once authority and trust are established, NPD individuals can easily mislead others about material facts and their legal rights in matters of civil or criminal litigation. They often will discredit anyone who questions their statements, authority, or intentions in order to maintain control of a narrative or group of people.\n\nBe wary of attorneys or leaders who tell you that organizations that have harmed, disabled and murdered hundreds of thousands of American adults and innocent children; organizations such as Pfizer, that the laws don’t apply to them.\n\nWhen an expert or attorney withholds material evidence or misrepresents the facts and laws regarding a legal matter, such as a potential lawsuit, it’s called extrinsic fraud.\n\nExtrinsic fraud is fraud that induces a person; to not present a case in court, to not pursue criminal charges, to not properly present case, or to be deprived of an opportunity for just compensation.\n• Extrinsic fraud includes fraudulent acts which keep a person from understanding information about his/her rights or obtaining evidence. This could include misleading an ignorant person about not having the right to sue or press criminal charges, or persuading them to delay moving forward with a case (stalling tactics).\n• A typical stall tactic used by attorneys and politicians is telling victims and frustrated constituents to ‘just wait’, ‘the team is working on it’, and that they will ‘hold an investigation to hold these criminals to account.’ – These are stalling tactics.\n• Extrinsic fraud is distinguished from intrinsic fraud, which is the fraud that is the subject of a lawsuit (i.e. Pfizer and the FDA committed intrinsic fraud regarding the clinical trial data.).\n\nIt is not uncommon for a judge, attorney or politician to commit the crime of extrinsic fraud due to bribery, coercion, or allegiance to an undisclosed organization or individual. Experts who have special knowledge of material facts also engage in extrinsic fraud for the same reasons listed above.\n\nAre We Victims of Extrinsic Fraud?\n\nTypically, extrinsic fraud occurs once legal matters officially begin, such as engaging an attorney, but it’s safe to say that many Americans have been gaslit into believing there is nothing we can do to pursue Big Pharma or the government healthcare agencies.\n\nBelow are some false claims that have been repeated to us consistently and relentlessly.\n• The FDA/VRBPAC can change the definition of a vaccine to whatever they want.\n• Pfizer is protected under the Childhood Vaccine Injury Act because the CDC added it to the Childhood Vaccine Schedule.\n\nIn my opinion, these false and misleading statements have dissuaded Americans from pursuing criminal or civil charges against Big Pharma (Pfizer) and/or the government agencies they conspired with for manufacturing, distributing, promoting and administering mRNA bioweapons on American adults, seniors, and our children.\n\nNot only are these repeated claims false, but they are also irrelevant. Why? Because the COVID-19 mRNA injections are not vaccines. The COVID-19 mRNA injections are biological weapons.\n\nPer 18 USC 175, a biological weapon is any biological agent, toxin, or delivery system (device/LNP/vaccine) that is not reasonably justified by a prophylactic or protective purpose; bona fide research, or other peaceful purposes.\n\nIt’s critical that we’re able to clearly articulate and document that the COVID-19 mRNA vaccines are weapons of biowarfare and stop repeating the lie that the COVID-19 mRNA injections are vaccines that underwent bona fide research and are able to provide prevention from infection or protection from disease.\n\nLet’s apply some techniques from the Socratic method to define what the mRNA injections ‘are not’ through statements and claims from FDA an Pfizer documents, and then apply those statements and claims to define what the mRNA injections are.\n\nDoes the New Definition of a Vaccine per the CDC/FDA Matter?\n\nWhen I point out to attorneys and scientific experts that the COVID-19 mRNA injections are gene-editing technologies that do not provide immunity and actually cause disease, the typical response has been something along the lines of, “FDA/CBER/VRBPAC can call a a gene-editing technology a vaccine, a medical device a vaccine, or anything they want a vaccine.”\n\nThis is a false, manipulative, misleading and fraudulent statement.\n\nBut for the sake of argument, let’s say the attorneys are right (and not just lying), and that the FDA has the authority to change the name of therapeutic categories on a whim (or at Pfizer’s command). Let’s say the FDA has the legal authority to call PEGylated lipid nanoparticle encapsulated gene-editing technologies that produce immunogenic disease causing and sometimes life-threatening biosynthetic spike proteins whatever the agency wants; baby aspirin, an antibiotic, or a vaccine.\n\nEven if this was true (that the FDA could call a gene-editing technology a vaccine), this still means that the Phase-3 data and post-market approval data for Pfizer’s COVID-19 mRNA vaccines must meet the burden-of-proof of proving vaccine efficacy per the FDA-approved indication for their ‘vaccine.’\n\nThe indication for Pfizer’s FDA-approved COVID-19 mRNA vaccines is;\n\nNow let’s apply the FDA’s and Pfizer’s own evidence against them. (Much of this content is taken from Intended Consequences).\n\nDuring the FDA’s December 11, 2020, emergency use authorization meeting for the Pfizer COVID-19 mRNA vaccines, FDA committee members pointed out that the mRNA vaccines appear to provide no clinical benefit, specifically regarding severe disease.\n\nPer the FDA’s own words, in the history of the FDA, the FDA has never approved a vaccine that does not protect against severe disease, until the agency approved the COVID-19 mRNA vaccines.\n\nPer the data discussed during that same FDA meeting, not only do Pfizer’s COVID-19 mRNA vaccines NOT prevent severe disease, Pfizer’s mRNA vaccines cause SEVERE COVID-19 within 7 days of being injected.\n\nPage 41 of PFIZER’s EUA submission, states that there were 409 patients who had COVID-19 symptoms within 7 days of getting their first (1st) or second (2nd) PFIZER shot, BUT these patients did not have a positive PCR-test for SARS-CoV-2.\n\n3. Severe Disease Caused by mRNA Injections Includes Cardiac, Respiratory and Kidney Failure, Neurological Dysfunction and Death\n\nPer PFIZER’s EUA submission, clinically significant or severe COVID-19 cases were defined in the Phase-3 Study as kidney, liver or neurological dysfunction, low oxygen levels, respiratory failure, mechanical ventilation, systemic shock, admission to the intensive care unit (ICU), or death.\n\nPer the September 17, 2021, FDA committee meeting, the FDA had full knowledge that two (2) injections of Pfizer’s mRNA vaccines increases a person risk for developing COVID-19 over time versus a person who remains unvaccinated.\n\nPer the documents provided to the FDA for the authorization and approval of Pfizer’s COVID-19 mRNA vaccines, the mRNA vaccines cause SARS-CoV-2 infection and COVID-19 disease, including severe disease.\n\nPfizer’s COVID-19 mRNA vaccines increase the risk of COVID-19 caused by SARS-CoV-2, therefore they cannot prevent SARS-CoV-2 infection or prevent COVID-19 (per the FDA-approved indication) and do not meet the FDA’s definition of a vaccine.\n\n5. Pfizer’s mRNA injections are categorized as biological agents by the FDA, but they are biological agents that provide no preventative or protective purpose. This meets the criteria of a biological weapon.\n\n6. Pfizer’s mRNA Injections Produce a Known Toxin that Causes Disease\n• do NOT produce antibodies to SARS-CoV-2, and\n• are resistant to the antibodies for SARS-CoV-2, and therefore –\n\nIt is scientifically and clinically impossible for Pfizer’s authorized and FDA-approved mRNA vaccines to be considered a vaccine, or a prophylactic or preventative treatment against SARS-CoV-2 infection, or any coronavirus, including variants.\n\n7. Pfizer’s mRNA Injections are Gene-Editing Technologies that Can Make Permanent Changes to Human Genome\n\nLet’s say an attorney or Albert Bourla himself claims that, “Fine, the mRNA injections may not be these so-called ‘vaccines’ you speak of, but they are very good emergency use authorized (EUA) gene-editing therapies and anyone who calls them a bioweapon is obviously crazy…..”\n\nEven though in Pfizer’s FDA- approved biological license application (BLA), they describe their mRNA injections as a gene-therapy, they are not gene-therapies. Gene-therapies prevent or cure disease, and the mRNA injections cause disease.\n\nThe following statement from the Manufacturing section of Pfizer’s FDA approval application describes the mechanism-of-action (MOA) of Pfizer’s mRNA as gene therapy:\n\nThe mechanism-of-action listed in COMIRNATY’s FDA application is nearly verbatim to the FDA’s definition for all gene-therapy products per the FDA’s August 2015 Guidance for Industry document, “Design and Analysis of Shedding Studies for Virus or Bacteria-Based Gene Therapy and Oncolytic Products.”\n\nPer the FDA document, “Gene therapy products ARE ALL PRODUCTS that mediate their effects by transcription and/or translation of transferred genetic material (mRNA) and/or by integrating into the host genome and that are administered as nucleic acids, viruses, or genetically engineered microorganisms.\n\nmRNA products may be used to modify cells in vivo (inside the body).”\n\nThe mechanism-of-action for Pfizer’s mRNA gene-editing technologies states that during RNA transcription, substitution occurs.\n\nSubstitution is a type of genetic mutation that has profound effects on human health.", "opengraph": {"locale": "en_US", "site_name": "Awake Canada", "type": "article", "title": "13 Reasons to Have State Attorney Generals Seize and Destroy All COVID-19 mRNA Bioweapons", "description": "Have we been gaslit into believing that we don't have the evidence or legal standing to stop the COVID-19 mRNA biowarfare operation dead in its track? Insight into what happened and what we can do.\nThis post was first posted by:", "url": "https://awakecanada.org/13-reasons-to-have-state-attorney-generals-seize-and-destroy-all-covid-19-mrna-bioweapons/", "image": "https://awakening.s3.amazonaws.com/wp-content/uploads/2023/01/10131405/ability-to-think-critically-7-3072061274-1.jpg", "image:secure_url": "https://awakening.s3.amazonaws.com/wp-content/uploads/2023/01/10131405/ability-to-think-critically-7-3072061274-1.jpg", "image:width": "1600", "image:height": "900", "article:published_time": "2023-01-10T21:14:23+00:00", "article:modified_time": "2023-01-10T21:14:24+00:00", "article:publisher": "https://www.facebook.com/groups/awakecanada"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.talkspace.com/mental-health/conditions/articles/narcissistic-gas-lighting/", "https://karenkingston.substack.com/p/big-pharma-and-biotech-can-not-elect", "https://en.wikipedia.org/wiki/Extrinsic_fraud", "https://karenkingston.substack.com/p/13-reasons-to-have-state-attorney?utm_source=substack&utm_medium=email&utm_content=share&action=share", "https://en.wikipedia.org/wiki/Fraud", "https://en.wikipedia.org/wiki/Intrinsic_fraud", "https://uscode.house.gov/view.xhtml?path=/prelim@title18/part1/chapter10&edition=prelim", "https://karenkingston.substack.com/?utm_source=substack&utm_medium=email&utm_content=share&action=share", "https://www.fda.gov/media/151707/download", "https://karenkingston.substack.com/p/intended-consequences-mrna-vaccines", "https://www.fda.gov/media/144416/download", "https://www.fda.gov/media/144416/download", "https://www.fda.gov/media/144416/download", "https://www.cdc.gov/dotw/covid-19/index.html", "https://www.fda.gov/media/152176/download", "https://karenkingston.substack.com/p/13-reasons-to-have-state-attorney?utm_source=substack&utm_medium=email&utm_content=share&action=share", "https://karenkingston.substack.com/p/intended-consequences-mrna-vaccines", "https://karenkingston.substack.com/p/intended-consequences-mrna-vaccines", "https://www.fda.gov/media/151733/download", "https://www.fda.gov/media/89036/download", "https://www.fda.gov/media/89036/download", "https://www.fda.gov/media/89036/download", "https://www.genome.gov/genetics-glossary/Substitution#:~:text=Substitution%2C%20as%20related%20to%20genomics,with%20a%20different%20amino%20acid"], "authors": [], "publish_date": "2023-01-10T21:14:23+00:00"}