{"result_id": "042045", "URL": "https://awakecanada.org/scientists-warn-of-potential-covid-vaccine-related-ticking-time-bomb/", "timestamp": "2023-04-25 12:15:14 CEST+0200", "meta": {"description": "Associate Professor of Health Sciences Adam MacNeil at Brock University, Canada and his Ph.D. student Jeremia Coish were among the earliest to warn, last June, of the dangers of not looking very carefully at the possibility that vaccines might trigger antibody-dependent enhancement (ADE) of disease. This could mean that people who are vaccinated might, paradoxically,", "lang": "en", "keywords": "", "favicon": "https://awakening.s3.amazonaws.com/wp-content/uploads/2021/10/09132407/favicon-32x32-1.png", "canonical": "https://awakecanada.org/scientists-warn-of-potential-covid-vaccine-related-ticking-time-bomb/", "encoding": "utf-8"}, "image": null, "domain": "awakecanada.org", "title": "Scientists Warn of Potential COVID Vaccine-Related ‘Ticking Time Bomb’", "cleaned_text": "Associate Professor of Health Sciences Adam MacNeil at Brock University, Canada and his Ph.D. student Jeremia Coish were among the earliest to warn, last June, of the dangers of not looking very carefully at the possibility that vaccines might trigger antibody-dependent enhancement (ADE) of disease. This could mean that people who are vaccinated might, paradoxically, suffer more severe disease when exposed to the wild virus than if they hadn’t been vaccinated.\n\nIn their aptly titled article, “Out of the frying pan and into the fire? Due diligence warranted for ADE in COVID-19,” published in the journal Microbes and Infection in June 2020, MacNeil and Coish argue that ADE is well known to be a risk for coronavirus-mediated infections, as well as dengue.\n\nFor those not already familiar with ADE, it is the paradoxical immune response that makes a person who was previously exposed to the disease, or a vaccine targeting it, more — not less — susceptible in the event that they’re subsequently infected.\n\nSeemingly countering this view, in August 2020, was viral epidemiologist Leah Katzelnick Ph.D., a dengue and zika specialist now in the employ of the National Institute for Allergy and Infectious Diseases headed by Dr. Tony Fauci. Along with co-author Scott Halstead,. Katzelnick argued that ADE shouldn’t be something to be feared. Katzelnick and Halstead proposed that the fundamental differences between SARS-CoV-2 infection that can cause COVID-19 and other diseases, for which ADE has been shown, meant that ADE would be highly unlikely.\n\nThey supported their arguments with evidence from cases of classic, intrinsic ADE, notably infectious peritonitis, a coronavirus infection in cats, as well as from respiratory syncytial virus, dengue and SARS — suggesting significant differences in the pathology, epidemiology and immune responses involved in these diseases as compared with COVID and SARS-CoV-2 infection.\n\nCareful readers of Halstead and Katzelnick’s paper will note that while the authors largely dismiss the ADE risk, they very clearly identify a risk of vaccine hypersensitivity (or VAH), a closely related immunological hyper-reaction that was first identified in the late 1960s when children developed atypical measles following measles vaccination.\n\nMany who’ve used the paper to dismiss ADE risks may only have read the title and abstract and not picked up that Katzelnick and Halstead dismiss only intrinsic ADE or iADE (i.e. the risk of disease enhancement on re-infection in the absence of vaccination).\n\nThey also may not have read the sombre advisory in the paper’s last sentence: “Given the magnitude of the repertoire of COVID-19 problems and the need for an effective vaccine, the full force of worldwide investigative resources should be directed at unravelling the pathogenesis of VAH.”\n\nThere is not much to suggest that this advisory has been heeded, other than the fact that thousands of volunteers have been put through Phase 3 trials and there has been no evidence of spikes in more severe reactions among those vaccinated with the real thing, as opposed to the placebo.\n\nHerbert Virgin, Ann Arvin and colleagues, writing in Nature, one of the most influential journals in the world, made a not dissimilar call for caution back in July. These authors discuss the great difficulties in identifying the incidence and frequency of ADE (and VAH) and suggest that “… it will be essential to depend on careful analysis of safety in humans as immune interventions for COVID-19 move forward.”\n\nThis requires full transparency of surveillance data so that cases of infection and reinfection post-vaccination can be correlated against severe reactions following infection or vaccination. It also requires time — much more time than we’ve had so far.\n\nPresently, data released by VAERS (Vaccine Adverse Event Reporting System) in the U.S. and the MHRA (Medicines and Healthcare products Regulatory Agency) in the UK don’t come close to telling us anything about the ADE or VAH risk. In fact, there will have to be a lot more re-infection before we know conclusively one way or another. And will we be able to find out if there are genuine issues with ADE or VAH, or will the authorities manage to keep a lid on it by just not communicating them given many reactions will be substantially delayed following vaccination?\n\nTimothy Cardozo from New York University and Ronald Veazy from Tulane University took it a step further in their article in the International Journal of Clinical Practice published in October, when Phase 3 trials for the COVID frontrunner vaccines were in full swing. They argued not only that vaccine-mediated ADE (i.e. VAH) risks were more than just theoretical, they also suggest that the risks may be greater following particular types of mutations in the circulating viruses.\n\nIn their discussion on SARS-CoV-2, they discuss how very tiny changes, such as changes in the conformity (shape) of its spike protein both before and after fusion with host cells, via ACE2 receptors might impact those who’ve been vaccinated. Several months on with emerging evidence that some variants are able to evade the immune response that has been trained to offer protection against the original Wuhan variants, there is cause for even greater concern. This risk also can’t be dismissed on the basis of the results of the Phase 3 trials\n\nWhat Cardozo and Veazy also suggest is another point we’ve long been concerned about. That relates to the fact that trial subjects — let alone members of the public who’re now lining up for COVID vaccines — are just not being informed of these potential risks, and the delayed nature of possible ADE/VAH reactions.\n\nWhat about vaccinees who become ill several months after being vaccinated, suffering the classic range of symptoms associated with many respiratory diseases (including COVID), such as fever, chills, cough, shortness of breath, headache, fatigue, and so on? Will they know that these symptoms might be related to enhanced COVID disease mediated by the vaccination given to them months before, something that didn’t occur to them because they thought the vaccine gave them protection from COVID?\n\nCardozo and Veazy then show how informed consent forms for volunteer subjects in vaccine trials fail to meet the required ethical standards for informed consent. While ADE is mentioned, it is generally added at the end of the list of possible risks and its implications and identification are unlikely to be adequately understood by the lay public.\n\nWith a tick in the box and a sense from regulators and vaccine makers that they’ve successfully negotiated the hurdle of ADE/VAH risks, there’s been no further discussion of the issue. The vast majority of pre-vaccinees lining up as part of the global mass vaccination roll out simply have no idea of the risk — because they’re not being told.\n\nDoes non-disclosure as part of the informed consent process constitute not only a breach of medical ethics, but also a breach of law? In our view, that’s highly likely and should evidence accrue in the future, this will be something the courts will need to grapple with.\n\nPresently there is no evidence of any significant ADE/VAH signal — but it is too early to tell and many cases could have gone undetected.\n\nIs it possible that some instances of ‘long COVID’ could be a form of ADE? This is a possibility we have been considering. Typically people who get long COVID don’t test as positive from nasopharyngeal swab tests. But in deep seated systemic infections the mucosa may not show evidence of viral multiplication, whereas the infection may become systemic in certain tissues and be enhanced. This possibility cannot easily be dismissed.\n\nCould the problem increase with new variants of SARS-CoV-2? Yes, as explained above.\n\nWhat you can do:\n• Anyone who is deciding to have the vaccine should inform themselves of the ADE and VAH risk, where there could be a considerable delay between vaccination and the experience of disease symptoms that may be more severe than those that would occur without the vaccine.\n• Let those you know who are considering or planning to have the COVID vaccine of this risk. Read and share our article, “Informed consent — is this fundamental right being respected?“\n\nThe post Scientists Warn of Potential COVID Vaccine-Related ‘Ticking Time Bomb’ appeared first on Children’s Health Defense.", "opengraph": {"locale": "en_US", "site_name": "Awake Canada", "type": "article", "title": "Scientists Warn of Potential COVID Vaccine-Related ‘Ticking Time Bomb’", "description": "Associate Professor of Health Sciences Adam MacNeil at Brock University, Canada and his Ph.D. student Jeremia Coish were among the earliest to warn, last June, of the dangers of not looking very carefully at the possibility that vaccines might trigger antibody-dependent enhancement (ADE) of disease. This could mean", "url": "https://awakecanada.org/scientists-warn-of-potential-covid-vaccine-related-ticking-time-bomb/", "article:published_time": "2021-02-12T04:12:25+00:00", "article:modified_time": "2021-02-12T04:12:25+00:00", "article:publisher": "https://www.facebook.com/groups/awakecanada", "image": "https://awakening.s3.amazonaws.com/wp-content/uploads/2023/03/23140920/Awakecanada.org-4-1-1.png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://brocku.ca/media-room/2020/08/20/brock-researchers-stress-importance-of-properly-developed-covid-19-vaccine/", "https://childrenshealthdefense.org/defender_category/big-pharma/", "https://academic.oup.com/cid/article-abstract/19/3/500/459343", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7311339/", "https://childrenshealthdefense.org/defender_category/covid/", "https://www.cdc.gov/dengue/index.html", "https://www.niaid.nih.gov/research/leah-c-katzelnick-phd-mph", "https://childrenshealthdefense.org/defender/truth-rfk-jr-david-martin-fauci-moderna-vaccine/", "https://academic.oup.com/jid/article/222/12/1946/5891764", "https://childrenshealthdefense.org/news/republish/chds-letter-to-congress-urging-covid-19-origins-investigation/", "https://academic.oup.com/jid/article/222/12/1946/5891764?login=true", "https://jamanetwork.com/journals/jama/article-abstract/336928", "https://www.nature.com/articles/s41586-020-2538-8?ref=theprepping-com", "https://www.anhinternational.org/news/vaccine-transparency-more-needed-now-than-ever/", "https://vaers.hhs.gov/", "https://www.gov.uk/government/publications/coronavirus-covid-19-vaccine-adverse-reactions/coronavirus-vaccine-summary-of-yellow-card-reporting", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7645850/", "https://www.anhinternational.org/news/informed-consent-is-this-fundamental-right-being-respected/", "https://www.anhinternational.org/news/long-covid-what-is-it-and-what-might-be-the-best-way-back/", "https://www.anhinternational.org/news/informed-consent-is-this-fundamental-right-being-respected/", "https://www.anhinternational.org/news/too-few-irons-in-the-fire-or-out-of-the-frying-pan/", "https://childrenshealthdefense.org/defender/potential-covid-vaccine-related-ticking-time-bomb/", "https://childrenshealthdefense.org/", "https://createchanges.thrivecart.com/tc-tfmrw-pre-launch/", "https://gab.com/compose?url=https%3A%2F%2Fawakecanada.org%2Fscientists-warn-of-potential-covid-vaccine-related-ticking-time-bomb%2F&text=Scientists%20Warn%20of%20Potential%20COVID%20Vaccine-Related%20%E2%80%98Ticking%20Time%20Bomb%E2%80%99", "https://gettr.com/share?text=Scientists%20Warn%20of%20Potential%20COVID%20Vaccine-Related%20%E2%80%98Ticking%20Time%20Bomb%E2%80%99&url=https%3A%2F%2Fawakecanada.org%2Fscientists-warn-of-potential-covid-vaccine-related-ticking-time-bomb%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fawakecanada.org%2Fscientists-warn-of-potential-covid-vaccine-related-ticking-time-bomb%2F&text=Scientists%20Warn%20of%20Potential%20COVID%20Vaccine-Related%20%E2%80%98Ticking%20Time%20Bomb%E2%80%99", "https://www.instagram.com/", "https://mewe.com/share?link=https%3A%2F%2Fawakecanada.org%2Fscientists-warn-of-potential-covid-vaccine-related-ticking-time-bomb%2F", "https://api.whatsapp.com/send?text=Scientists%20Warn%20of%20Potential%20COVID%20Vaccine-Related%20%E2%80%98Ticking%20Time%20Bomb%E2%80%99 https%3A%2F%2Fawakecanada.org%2Fscientists-warn-of-potential-covid-vaccine-related-ticking-time-bomb%2F", "https://awakecanada.org/scientists-warn-of-potential-covid-vaccine-related-ticking-time-bomb/", "https://mail.google.com/mail/?ui=2&view=cm&fs=1&tf=1&su=Scientists%20Warn%20of%20Potential%20COVID%20Vaccine-Related%20%E2%80%98Ticking%20Time%20Bomb%E2%80%99&body=Link:https%3A%2F%2Fawakecanada.org%2Fscientists-warn-of-potential-covid-vaccine-related-ticking-time-bomb%2F", "https://awakecanada.org/scientists-warn-of-potential-covid-vaccine-related-ticking-time-bomb/", "https://awakecanada.org/scientists-warn-of-potential-covid-vaccine-related-ticking-time-bomb/", "https://gab.com/compose?url=https%3A%2F%2Fawakecanada.org%2Fscientists-warn-of-potential-covid-vaccine-related-ticking-time-bomb%2F&text=Scientists%20Warn%20of%20Potential%20COVID%20Vaccine-Related%20%E2%80%98Ticking%20Time%20Bomb%E2%80%99", "https://gettr.com/share?text=Scientists%20Warn%20of%20Potential%20COVID%20Vaccine-Related%20%E2%80%98Ticking%20Time%20Bomb%E2%80%99&url=https%3A%2F%2Fawakecanada.org%2Fscientists-warn-of-potential-covid-vaccine-related-ticking-time-bomb%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fawakecanada.org%2Fscientists-warn-of-potential-covid-vaccine-related-ticking-time-bomb%2F&text=Scientists%20Warn%20of%20Potential%20COVID%20Vaccine-Related%20%E2%80%98Ticking%20Time%20Bomb%E2%80%99", "https://www.instagram.com/", "https://mewe.com/share?link=https%3A%2F%2Fawakecanada.org%2Fscientists-warn-of-potential-covid-vaccine-related-ticking-time-bomb%2F", "https://api.whatsapp.com/send?text=Scientists%20Warn%20of%20Potential%20COVID%20Vaccine-Related%20%E2%80%98Ticking%20Time%20Bomb%E2%80%99 https%3A%2F%2Fawakecanada.org%2Fscientists-warn-of-potential-covid-vaccine-related-ticking-time-bomb%2F", "https://awakecanada.org/scientists-warn-of-potential-covid-vaccine-related-ticking-time-bomb/", "https://mail.google.com/mail/?ui=2&view=cm&fs=1&tf=1&su=Scientists%20Warn%20of%20Potential%20COVID%20Vaccine-Related%20%E2%80%98Ticking%20Time%20Bomb%E2%80%99&body=Link:https%3A%2F%2Fawakecanada.org%2Fscientists-warn-of-potential-covid-vaccine-related-ticking-time-bomb%2F", "https://awakecanada.org/scientists-warn-of-potential-covid-vaccine-related-ticking-time-bomb/", "https://awakecanada.org/scientists-warn-of-potential-covid-vaccine-related-ticking-time-bomb/"], "authors": [], "publish_date": "2021-02-12T04:12:25+00:00"}