{"result_id": "042026", "URL": "https://awakecanada.org/significant-jump-this-week-in-reported-injuries-deaths-after-covid-vaccine/", "timestamp": "2023-04-25 12:13:59 CEST+0200", "meta": {"description": "Data released today by the Centers for Disease Control and Prevention (CDC) on the number of injuries and deaths reported to the Vaccine Adverse Event Reporting System (VAERS) following COVID vaccines showed a significant jump in reports of injuries and deaths compared with last week’s numbers. VAERS is the primary government-funded system for reporting adverse", "lang": "en", "keywords": "", "favicon": "https://awakening.s3.amazonaws.com/wp-content/uploads/2021/10/09132407/favicon-32x32-1.png", "canonical": "https://awakecanada.org/significant-jump-this-week-in-reported-injuries-deaths-after-covid-vaccine/", "encoding": "utf-8"}, "image": null, "domain": "awakecanada.org", "title": "Significant Jump This Week in Reported Injuries, Deaths After COVID Vaccine", "cleaned_text": "Data released today by the Centers for Disease Control and Prevention (CDC) on the number of injuries and deaths reported to the Vaccine Adverse Event Reporting System (VAERS) following COVID vaccines showed a significant jump in reports of injuries and deaths compared with last week’s numbers.\n\nVAERS is the primary government-funded system for reporting adverse vaccine reactions in the U.S. Reports submitted to VAERS require further investigation before a causal relationship can be confirmed.\n\nEvery Friday, VAERS makes public all vaccine injury reports received as of a specified date, usually about a week prior to the release date. Today’s data show that between Dec. 14, 2020 and April 23, a total of 118,902 total adverse events were reported to VAERS, including 3,544 deaths — an increase of 358 over the previous week — and 12,619 serious injuries, up 2,467 since last week.\n\nIn the U.S., 222.3 million COVID vaccine doses had been administered as of April 23. This includes 97 million doses of Moderna’s vaccine, 117 million doses of Pfizer and 8 million doses of the Johnson &Johnson (J&J) COVID vaccine.\n\nOf the 3,544 deaths reported as of April 23, 25% occurred within 48 hours of vaccination, 17% occurred within 24 hours and 40% occurred in people who became ill within 48 hours of being vaccinated.\n\nThis week’s data included three reports of deaths among teens under age 18, including two 15-year-olds and one 16-year-old who died unexpectedly from a blood clot 11 days after receiving her first Pfizer dose.\n\nA 15-year-old female died of cardiac arrest after receiving the second dose of the Moderna vaccine, and a 15-year-old male died of cardiac failure two days after receiving the Pfizer vaccine.\n\n21% of deaths were related to cardiac disorders.\n\n 54% of those who died were male, 44% were female and the remaining death reports did not include gender of the deceased.\n\n The average age of death was 75.3 and the youngest deaths reported include two 15-year-olds (VAERS I.D. 1187918 and 1242573 ) and a 16-year-old (VAERS I.D. 1225942). There were other reported deaths in children under 16 that could not be confirmed or contained obvious errors.\n\n As of April 23, 598 pregnant women reported adverse events related to COVID vaccines, including 170 reports of miscarriage or premature birth.\n\n Of the 1,099 cases of Bell’s Palsy reported, 51% of cases were reported after Pfizer-BioNTech vaccinations, 39% following vaccination with the Moderna vaccine and 131 cases or 12% of Bell’s Palsy were reported in conjunction with J&J.\n\n There were 121 reports of Guillain-Barré Syndrome with 44% of cases attributed to Pfizer, 43% to Moderna and 17% to J&J.\n\n There were 33,673 reports of anaphylaxis with 39% of cases attributed to Pfizer’s vaccine, 44% to Moderna and 16% to J&J.\n\nCDC ignores The Defender, no response after 53 days\n\nAccording to the CDC website, “the CDC follows up on any report of death to request additional information and learn more about what occurred and to determine whether the death was a result of the vaccine or unrelated.”\n\nThe Defender reached out to the CDC on March 8 with a written list of questions about reported deaths and injuries related to COVID vaccines, the status of ongoing investigations reported in the media, if autopsies are being done, the standard for determining whether an injury is causally connected to a vaccine, and education initiatives to encourage and facilitate proper and accurate reporting.\n\nWe made numerous attempts to contact the CDC via phone and email. As of April 30, 53 days after our initial inquiry, we still have yet to receive answers to our questions.\n\nFirst ‘acknowledged’ case of J&J blood clots in a male\n\nOn April 27, The Defender reported a 30-year-old California man was hospitalized with blood clots after receiving J&J’s COVID vaccine. It is the first time U.S. public health officials have specifically acknowledged “vaccine-induced thrombotic thrombocytopenia syndrome” in a male who received J&J’s shot.\n\nThe news came days after an independent advisory panel for the CDC on April 23 voted 10 to 4 to recommend the continued use of the J&J vaccine with no restrictions after acknowledging a “possible link” between the vaccine and rare blood clotting disorders, mostly in young people. The panel concluded the benefits of the vaccine outweigh the risks.\n\nChildren’s Health Defense queried the VAERS data for a series of adverse events associated with the formation of clotting disorders and other related conditions. VAERS yielded a total of 1,845 reports for all three vaccines from Dec. 14, 2020, through April 23.\n\nOf the 1,845 cases reported, there were 655 reports attributed to Pfizer, 577 reports to Moderna and 608 reports to J&J — an increase of 448 J&J-related cases in just one week. U.S. health officials only acknowledged 15 blood clot cases associated with the J&J vaccine at the April 16 meeting.\n\nChildren as young as 6 months in COVID vaccine trials\n\nOn April 27, ABC News reported children as young as 6 months old are now in COVID vaccine trials. Dr. Zinaida Good, research fellow and immunologist at the Stanford Medicine Cancer Center, enrolled both her sons in Stanford Hospital’s Pfizer trial. Good said she and her husband are confident in the safety of the vaccine.\n\n“It would be wonderful if we knew how to communicate better the benefits of the vaccine and its safety. The data is very clear,” Good said. “Those who get vaccines like this, mRNA vaccines, at least they are protected and they don’t really have any real side effects, not any real long-term consequences.”\n\nDr. Angelica Lacour’s 3-year-old daughter, Eloise, is also participating in the trial for young children. Lacour said she was told about potential side effects. “They said that it’s incredibly rare, but anyone can have an anaphylactic reaction to it. But it’s so rare they couldn’t even give us an example,” Lacour said. “So [side effects were] not something I was very concerned about.”\n\nIt is unknown whether Pfizer informed parents of potential side effects beyond just “anaphylaxis.” According to VAERS data, 45,508 of the 118,902 total reported adverse events were attributed to Pfizer’s vaccine. Of those 45,508 adverse events, 13,116 were related to anaphylactic reactions.\n\nPossible link between Pfizer vaccine and heart inflammation\n\nThe Defender reported April 26 on details leaked from an Israeli Health Ministry report that raised concerns among experts about a possible link between the Pfizer vaccine and myocarditis.\n\nThe preliminary report found 62 cases of myocarditis, including two deaths, in people who received the Pfizer vaccine. Fifty-six of the cases occurred after the second dose of the vaccine, and 55 cases occurred in men — most between the ages of 18 and 30.\n\nIsrael’s pandemic response coordinator, Nachman Ash, confirmed “tens of incidents” of myocarditis occurred in vaccinated people, primarily after the second dose, but emphasized the health ministry had yet to draw any conclusions.\n\nPfizer said it had not detected similar findings in the rest of the world but would look deeper into the phenomenon. Yet a search for “myocarditis” in VAERS revealed 75 cases of myocarditis, with 73% occurring in people between the ages of 17 and 44. Of the reported cases, 33 were reported after the Pfizer vaccine.\n\nResearchers this week called for clinical trials to track and document menstrual changes in vaccinated women after some women reported changes to their menstrual cycles after receiving a COVID vaccine, The Defender reported April 28.\n\nWomen have reported hemorrhagic bleeding with clots, delayed or absent periods, sudden pre-menopausal symptoms, month-long periods and heavy irregular bleeding after being vaccinated with one or both doses of a COVID vaccine.\n\nThere’s no data linking COVID vaccines to changes in menstruation because clinical trials omit tracking menstrual cycles. But two Yale University experts wrote in The New York Times last week there could be a connection.\n\n“There are many reasons vaccination could alter menstruation,” wrote Alice Lu-Culligan, an M.D./Ph.D. student at Yale School of Medicine, and Dr. Randi Epstein, writer in residence at Yale School of Medicine.\n\n“Periods involve the immune system, as the thickening and thinning of the uterine lining are facilitated by different teams of immune cells and signals moving in and out of the reproductive tract,” Lu-Culligan and Epstein explained. “Vaccines are designed to ignite an immune response, and the female cycle is supported by the immune system, so it’s possible vaccines could temporarily change the normal course of events.”\n\nTo find out whether the COVID vaccine truly disrupts menstrual cycles, experts say there needs to be a controlled study with a placebo group. Rather than treat menstrual cycles as unimportant or too complicated, researchers should view tracking periods in future studies as a potential opportunity, Lu-Culligan and Epstein said. Clinical trials should track and document menstrual changes as they do other possible side effects.\n\nGovernment considering COVID vaccine mandate for U.S. troops\n\nPresident Joe Biden said today he has not ruled out requiring all U.S. troops to get the COVID vaccine after the shots win final clearance from federal regulators, but cautioned that such a decision would be a “tough call,” Politico reported.\n\nPresident Biden will not rule out ordering military to get vaccinatedhttps://t.co/dOswYqom0Q\n\nThe comments come as the Pentagon sounded the alarm that roughly one-third of troops and 40% of Marines had declined the vaccine as of February, according to congressional testimony from military officials.\n\nIn March, a group of Democratic lawmakers demanded Biden make the vaccine a requirement for service members, while Pentagon Press Secretary John Kirby confirmed the military’s top brass was weighing a mandatory vaccination order.\n\nAs The Defender reported this week, military officials held a virtual town hall this month in which leaders touted the vaccines and urged service members to get vaccinated, or miss out on perks granted exclusively to those who get the vaccine.\n\nChildren’s Health Defense asks anyone who has experienced an adverse reaction, to any vaccine, to file a report following these three steps.\n\nThe post Significant Jump This Week in Reported Injuries, Deaths After COVID Vaccine appeared first on Children’s Health Defense.", "opengraph": {"locale": "en_US", "site_name": "Awake Canada", "type": "article", "title": "Significant Jump This Week in Reported Injuries, Deaths After COVID Vaccine", "description": "Data released today by the Centers for Disease Control and Prevention (CDC) on the number of injuries and deaths reported to the Vaccine Adverse Event Reporting System (VAERS) following COVID vaccines showed a significant jump in reports of injuries and deaths compared with last week’s numbers.\nVAERS is the primary government-funded system for", "url": "https://awakecanada.org/significant-jump-this-week-in-reported-injuries-deaths-after-covid-vaccine/", "image": "https://awakening.s3.amazonaws.com/wp-content/uploads/2021/04/30141255/vaers_vaccine_injury_covid_april_23-300x207-ohMfnV.png", "image:secure_url": "https://awakening.s3.amazonaws.com/wp-content/uploads/2021/04/30141255/vaers_vaccine_injury_covid_april_23-300x207-ohMfnV.png", "image:width": "300", "image:height": "207", "article:published_time": "2021-05-01T04:12:54+00:00", "article:modified_time": "2021-05-01T04:12:54+00:00", "article:publisher": "https://www.facebook.com/groups/awakecanada"}, "tags": [], "tweets": [], "movies": [], "links": ["https://vaers.hhs.gov/", "https://childrenshealthdefense.org/defender/cdc-investiging-johnson-johnson-vaers-data-reports-deaths-covid-vaccines/", "https://childrenshealthdefense.org/defender/rfk-jr-david-kessler-covid-vaccine-vaers/", "https://childrenshealthdefense.org/defender/rfk-jr-david-kessler-covid-vaccine-vaers/", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=CAT&EVENTS=ON&VAX=COVID19", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&SERIOUS=ON", "https://ourworldindata.org/grapher/cumulative-covid-vaccinations?tab=chart&stackMode=absolute&country=~USA&region=World", "https://ourworldindata.org/grapher/covid-vaccine-doses-by-manufacturer?country=~USA", "https://childrenshealthdefense.org/defender/did-cdc-mislead-public-allergic-reactions-moderna-vaccine/", "https://childrenshealthdefense.org/defender/fda-pfizer-experimental-covid-vaccine-children/", "https://childrenshealthdefense.org/defender/u-s-pauses-johnson-johnson-covid-vaccine/", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&V2OCHECKED=ON&V2OLOW=0&V2OHIGH=2", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&V2OCHECKED=ON&V2OLOW=0&V2OHIGH=2", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=1225942", "https://www.legacy.com/us/obituaries/madison/name/kamrynn-thomas-obituary?pid=198250554", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=1187918", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=1187918", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=1225942", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=1187918", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=1242573", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=1225942", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=DIS&EVENTS=ON&SYMPTOMS%5B%5D=Abnormal+labour+%2810000153%29&SYMPTOMS%5B%5D=Abnormal+labour+affecting+foetus+%2810000154%29&SYMPTOMS%5B%5D=Aborted+pregnancy+%2810000209%29&SYMPTOMS%5B%5D=Abortion+%2810000210%29&SYMPTOMS%5B%5D=Abortion+complete+%2810061614%29&SYMPTOMS%5B%5D=Abortion+early+%2810052846%29&SYMPTOMS%5B%5D=Abortion+spontaneous+%2810000234%29&SYMPTOMS%5B%5D=Abortion+spontaneous+complete+%2810061616%29&SYMPTOMS%5B%5D=Abortion+spontaneous+incomplete+%2810061617%29&SYMPTOMS%5B%5D=Exposure+during+pregnancy+%2810073513%29&SYMPTOMS%5B%5D=Foetal-maternal+haemorrhage+%2810016871%29&SYMPTOMS%5B%5D=Foetal+cardiac+disorder+%2810052088%29&SYMPTOMS%5B%5D=Foetal+damage+%2810016852%29&SYMPTOMS%5B%5D=Foetal+death+%2810055690%29&SYMPTOMS%5B%5D=Foetal+disorder+%2810061157%29&SYMPTOMS%5B%5D=Foetal+distress+syndrome+%2810016855%29&SYMPTOMS%5B%5D=Foetal+exposure+during+pregnancy+%2810071404%29&SYMPTOMS%5B%5D=Foetal+growth+abnormality+%2810077582%29&SYMPTOMS%5B%5D=Foetal+heart+rate+abnormal+%2810051139%29&SYMPTOMS%5B%5D=Foetal+heart+rate+deceleration+%2810058322%29&SYMPTOMS%5B%5D=Foetal+heart+rate+deceleration+abnormality+%2810074636%29&SYMPTOMS%5B%5D=Foetal+heart+rate+decreased+%2810051136%29&SYMPTOMS%5B%5D=Foetal+heart+rate+disorder+%2810061158%29&SYMPTOMS%5B%5D=Foetal+heart+rate+increased+%2810051138%29&SYMPTOMS%5B%5D=Foetal+movement+disorder+%2810077576%29&SYMPTOMS%5B%5D=Foetal+movements+decreased+%2810016866%29&SYMPTOMS%5B%5D=Haemorrhage+%2810055798%29&SYMPTOMS%5B%5D=Haemorrhage+in+pregnancy+%2810018981%29&SYMPTOMS%5B%5D=Placental+calcification+%2810082008%29&SYMPTOMS%5B%5D=Placental+disorder+%2810035132%29&SYMPTOMS%5B%5D=Placental+insufficiency+%2810035138%29&SYMPTOMS%5B%5D=Placental+necrosis+%2810035139%29&SYMPTOMS%5B%5D=Placental+transfusion+syndrome+%2810035146%29&SYMPTOMS%5B%5D=Placenta+praevia+%2810035119%29&SYMPTOMS%5B%5D=Placenta+praevia+haemorrhage+%2810035121%29&SYMPTOMS%5B%5D=Pregnancy+test+positive+%2810036575%29&SYMPTOMS%5B%5D=Premature+baby+%2810036590%29&SYMPTOMS%5B%5D=Premature+baby+death+%2810076700%29&SYMPTOMS%5B%5D=Premature+delivery+%2810036595%29&SYMPTOMS%5B%5D=Premature+labour+%2810036600%29&SYMPTOMS%5B%5D=Premature+rupture+of+membranes+%2810036603%29&SYMPTOMS%5B%5D=Premature+separation+of+placenta+%2810036608%29&SYMPTOMS%5B%5D=Stillbirth+%2810042062%29&SYMPTOMS%5B%5D=Ultrasound+foetal+abnormal+%2810077578%29&SYMPTOMS%5B%5D=Ultrasound+uterus+abnormal+%2810064876%29&SYMPTOMS%5B%5D=Uterine+haemorrhage+%2810046788%29&SYMPTOMS%5B%5D=Uterine+rupture+%2810046820%29&VAX=COVID19", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5B%5D=Aborted+pregnancy+%2810000209%29&SYMPTOMS%5B%5D=Abortion+%2810000210%29&SYMPTOMS%5B%5D=Abortion+spontaneous+%2810000234%29&SYMPTOMS%5B%5D=Abortion+spontaneous+complete+%2810061616%29&SYMPTOMS%5B%5D=Abortion+spontaneous+incomplete+%2810061617%29&SYMPTOMS%5B%5D=Abortion+threatened+%2810000242%29&SYMPTOMS%5B%5D=Foetal-maternal+haemorrhage+%2810016871%29&SYMPTOMS%5B%5D=Foetal+cardiac+disorder+%2810052088%29&SYMPTOMS%5B%5D=Foetal+damage+%2810016852%29&SYMPTOMS%5B%5D=Foetal+death+%2810055690%29&SYMPTOMS%5B%5D=Foetal+disorder+%2810061157%29&SYMPTOMS%5B%5D=Foetal+distress+syndrome+%2810016855%29&SYMPTOMS%5B%5D=Foetal+heart+rate+abnormal+%2810051139%29&SYMPTOMS%5B%5D=Foetal+heart+rate+deceleration+%2810058322%29&SYMPTOMS%5B%5D=Foetal+heart+rate+deceleration+abnormality+%2810074636%29&SYMPTOMS%5B%5D=Foetal+heart+rate+decreased+%2810051136%29&SYMPTOMS%5B%5D=Foetal+heart+rate+disorder+%2810061158%29&SYMPTOMS%5B%5D=Foetal+heart+rate+increased+%2810051138%29&SYMPTOMS%5B%5D=Foetal+hypokinesia+%2810068461%29&SYMPTOMS%5B%5D=Foetal+malformation+%2810060919%29&SYMPTOMS%5B%5D=Foetal+malpresentation+%2810058013%29&SYMPTOMS%5B%5D=Foetal+monitoring+abnormal+%2810071507%29&SYMPTOMS%5B%5D=Foetal+movement+disorder+%2810077576%29&SYMPTOMS%5B%5D=Foetal+movements+decreased+%2810016866%29&SYMPTOMS%5B%5D=Foetal+non-stress+test+abnormal+%2810071516%29&SYMPTOMS%5B%5D=Placental+disorder+%2810035132%29&SYMPTOMS%5B%5D=Pregnancy+induced+hypertension+%2810036563%29&SYMPTOMS%5B%5D=Premature+baby+%2810036590%29&SYMPTOMS%5B%5D=Premature+baby+death+%2810076700%29&SYMPTOMS%5B%5D=Premature+delivery+%2810036595%29&SYMPTOMS%5B%5D=Premature+labour+%2810036600%29&SYMPTOMS%5B%5D=Premature+rupture+of+membranes+%2810036603%29&SYMPTOMS%5B%5D=Premature+separation+of+placenta+%2810036608%29&SYMPTOMS%5B%5D=Stillbirth+%2810042062%29&SYMPTOMS%5B%5D=Ultrasound+foetal+abnormal+%2810077578%29&VAX=COVID19", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=MAN&EVENTS=ON&SYMPTOMS%5B%5D=Bell%27s+palsy+%2810004223%29&SYMPTOMS%5B%5D=Facial+discomfort+%2810083537%29&SYMPTOMS%5B%5D=Facial+dysmorphism+%2810016045%29&SYMPTOMS%5B%5D=Facial+nerve+disorder+%2810061457%29&SYMPTOMS%5B%5D=Facial+neuralgia+%2810061594%29&SYMPTOMS%5B%5D=Facial+palsy+%2810016060%29&SYMPTOMS%5B%5D=Facial+paralysis+%2810016062%29&SYMPTOMS%5B%5D=Facial+paresis+%2810051267%29&SYMPTOMS%5B%5D=Facial+spasm+%2810063006%29&VAX=COVID19", "https://childrenshealthdefense.org/defender/fda-misled-public-pfizer-vaccine-efficacy/", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=MAN&EVENTS=ON&SYMPTOMS=Guillain-Barre+syndrome+%2810018767%29&VAX=COVID19", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&VAXMAN=PFIZER/BIONTECH", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&VAXMAN=MODERNA", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&VAXMAN=JANSSEN", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/adverse-events.html", "https://childrenshealthdefense.org/defender/", "https://childrenshealthdefense.org/defender/congress-support-hr-834-prepare-act/", "https://childrenshealthdefense.org/defender/man-hospitalized-blood-clots-johnson-johnson-vaccine/", "https://www.nejm.org/doi/full/10.1056/NEJMe2106315", "https://childrenshealthdefense.org/defender/cdc-panel-resume-use-of-jj-covid-vaccine-no-restrictions/", "https://childrenshealthdefense.org/", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5B%5D=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS%5B%5D=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS%5B%5D=Coagulopathy+%2810009802%29&SYMPTOMS%5B%5D=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS%5B%5D=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS%5B%5D=Embolism+%2810061169%29&SYMPTOMS%5B%5D=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS%5B%5D=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS%5B%5D=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS%5B%5D=Ischaemic+stroke+%2810061256%29&SYMPTOMS%5B%5D=Myocardial+infarction+%2810028596%29&SYMPTOMS%5B%5D=Petechiae+%2810034754%29&SYMPTOMS%5B%5D=Pulmonary+embolism+%2810037377%29&SYMPTOMS%5B%5D=Purpura+%2810037549%29&SYMPTOMS%5B%5D=Thrombocytopenia+%2810043554%29&SYMPTOMS%5B%5D=Thrombosis+%2810043607%29&SYMPTOMS%5B%5D=Vasculitis+%2810047115%29&VAX=COVID19", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5B%5D=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS%5B%5D=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS%5B%5D=Coagulopathy+%2810009802%29&SYMPTOMS%5B%5D=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS%5B%5D=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS%5B%5D=Embolism+%2810061169%29&SYMPTOMS%5B%5D=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS%5B%5D=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS%5B%5D=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS%5B%5D=Ischaemic+stroke+%2810061256%29&SYMPTOMS%5B%5D=Myocardial+infarction+%2810028596%29&SYMPTOMS%5B%5D=Petechiae+%2810034754%29&SYMPTOMS%5B%5D=Pulmonary+embolism+%2810037377%29&SYMPTOMS%5B%5D=Purpura+%2810037549%29&SYMPTOMS%5B%5D=Thrombocytopenia+%2810043554%29&SYMPTOMS%5B%5D=Thrombosis+%2810043607%29&SYMPTOMS%5B%5D=Vasculitis+%2810047115%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5B%5D=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS%5B%5D=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS%5B%5D=Coagulopathy+%2810009802%29&SYMPTOMS%5B%5D=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS%5B%5D=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS%5B%5D=Embolism+%2810061169%29&SYMPTOMS%5B%5D=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS%5B%5D=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS%5B%5D=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS%5B%5D=Ischaemic+stroke+%2810061256%29&SYMPTOMS%5B%5D=Myocardial+infarction+%2810028596%29&SYMPTOMS%5B%5D=Petechiae+%2810034754%29&SYMPTOMS%5B%5D=Pulmonary+embolism+%2810037377%29&SYMPTOMS%5B%5D=Purpura+%2810037549%29&SYMPTOMS%5B%5D=Thrombocytopenia+%2810043554%29&SYMPTOMS%5B%5D=Thrombosis+%2810043607%29&SYMPTOMS%5B%5D=Vasculitis+%2810047115%29&VAX=COVID19&VAXMAN=MODERNA", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS%5B%5D=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS%5B%5D=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS%5B%5D=Coagulopathy+%2810009802%29&SYMPTOMS%5B%5D=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS%5B%5D=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS%5B%5D=Embolism+%2810061169%29&SYMPTOMS%5B%5D=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS%5B%5D=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS%5B%5D=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS%5B%5D=Ischaemic+stroke+%2810061256%29&SYMPTOMS%5B%5D=Myocardial+infarction+%2810028596%29&SYMPTOMS%5B%5D=Petechiae+%2810034754%29&SYMPTOMS%5B%5D=Pulmonary+embolism+%2810037377%29&SYMPTOMS%5B%5D=Purpura+%2810037549%29&SYMPTOMS%5B%5D=Thrombocytopenia+%2810043554%29&SYMPTOMS%5B%5D=Thrombosis+%2810043607%29&SYMPTOMS%5B%5D=Vasculitis+%2810047115%29&VAX=COVID19&VAXMAN=JANSSEN", "https://abcnews.go.com/US/children-young-months-now-covid-19-vaccine-trials/story?id=77353416", "https://childrenshealthdefense.org/news/editorial/an-mrna-vaccine-against-sars-cov-2-preliminary-report-a-researcher-reacts/", "https://childrenshealthdefense.org/defender/fda-investigates-reactions-pfizer-covid-vaccine-healthcare-workers-hospitalized/", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&VAXTYPES=COVID-19&VAXMAN=PFIZER/BIONTECH", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=CAT&EVENTS=ON&VAX=COVID19", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMSSMQ=21&VAX=COVID19&VAXMAN=PFIZER/BIONTECH", "https://childrenshealthdefense.org/defender/pfizer-vaccine-heart-inflammation-people-under-30-leaked-study/", "https://www.mayoclinic.org/diseases-conditions/myocarditis/symptoms-causes/syc-20352539", "https://www.jpost.com/health-science/covid-19-israel-finds-possible-link-between-vaccine-myocarditis-cases-666237https://www.jpost.com/health-science/covid-19-israel-finds-possible-link-between-vaccine-myocarditis-cases-666237", "https://www.maariv.co.il/corona/corona-israel/Article-836014", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Myocarditis+%2810028606%29&VAX=COVID19&VAXTYPES=COVID-19", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Myocarditis+%2810028606%29&VAX=COVID19&VAXTYPES=COVID-19&VAXMAN=PFIZER/BIONTECH", "https://childrenshealthdefense.org/defender/covid-vaccines-disrupt-womens-menstrual-cycles/", "https://www.nytimes.com/2021/04/20/opinion/coronavirus-vaccines-menstruation-periods.html", "https://medicine.yale.edu/profile/alice_lu/", "https://medicine.yale.edu/profile/randi_epstein/", "https://journals.sagepub.com/doi/full/10.2217/WHE.13.32", "https://www.nytimes.com/2021/04/20/opinion/coronavirus-vaccines-menstruation-periods.html", "https://www.politico.com/news/2021/04/30/biden-covid-vaccines-troops-485099", "https://t.co/dOswYqom0Q", "https://twitter.com/TODAYshow/status/1388139488828870656?ref_src=twsrc%5Etfw", "https://www.politico.com/news/2021/02/17/troops-covid-vaccine-pentagon-469518", "https://www.navytimes.com/news/your-navy/2021/03/24/lawmakers-call-on-biden-to-make-covid-vaccines-mandatory-for-the-military/", "https://childrenshealthdefense.org/defender/us-army-convert-coerce-vaccine-skeptics/", "https://childrenshealthdefense.org/", "https://childrenshealthdefense.org/defender/injured-by-vaccine-how-to-report-it/", "https://childrenshealthdefense.org/defender/vaers-significant-jump-reported-injuries-deaths-after-covid-vaccine/", "https://childrenshealthdefense.org/", "https://createchanges.thrivecart.com/tc-tfmrw-pre-launch/", "https://gab.com/compose?url=https%3A%2F%2Fawakecanada.org%2Fsignificant-jump-this-week-in-reported-injuries-deaths-after-covid-vaccine%2F&text=Significant%20Jump%20This%20Week%20in%20Reported%20Injuries%2C%20Deaths%20After%20COVID%20Vaccine", "https://gettr.com/share?text=Significant%20Jump%20This%20Week%20in%20Reported%20Injuries%2C%20Deaths%20After%20COVID%20Vaccine&url=https%3A%2F%2Fawakecanada.org%2Fsignificant-jump-this-week-in-reported-injuries-deaths-after-covid-vaccine%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fawakecanada.org%2Fsignificant-jump-this-week-in-reported-injuries-deaths-after-covid-vaccine%2F&text=Significant%20Jump%20This%20Week%20in%20Reported%20Injuries%2C%20Deaths%20After%20COVID%20Vaccine", "https://www.instagram.com/", "https://mewe.com/share?link=https%3A%2F%2Fawakecanada.org%2Fsignificant-jump-this-week-in-reported-injuries-deaths-after-covid-vaccine%2F", "https://api.whatsapp.com/send?text=Significant%20Jump%20This%20Week%20in%20Reported%20Injuries%2C%20Deaths%20After%20COVID%20Vaccine https%3A%2F%2Fawakecanada.org%2Fsignificant-jump-this-week-in-reported-injuries-deaths-after-covid-vaccine%2F", "https://awakecanada.org/significant-jump-this-week-in-reported-injuries-deaths-after-covid-vaccine/", "https://mail.google.com/mail/?ui=2&view=cm&fs=1&tf=1&su=Significant%20Jump%20This%20Week%20in%20Reported%20Injuries%2C%20Deaths%20After%20COVID%20Vaccine&body=Link:https%3A%2F%2Fawakecanada.org%2Fsignificant-jump-this-week-in-reported-injuries-deaths-after-covid-vaccine%2F", "https://awakecanada.org/significant-jump-this-week-in-reported-injuries-deaths-after-covid-vaccine/", "https://awakecanada.org/significant-jump-this-week-in-reported-injuries-deaths-after-covid-vaccine/", "https://gab.com/compose?url=https%3A%2F%2Fawakecanada.org%2Fsignificant-jump-this-week-in-reported-injuries-deaths-after-covid-vaccine%2F&text=Significant%20Jump%20This%20Week%20in%20Reported%20Injuries%2C%20Deaths%20After%20COVID%20Vaccine", "https://gettr.com/share?text=Significant%20Jump%20This%20Week%20in%20Reported%20Injuries%2C%20Deaths%20After%20COVID%20Vaccine&url=https%3A%2F%2Fawakecanada.org%2Fsignificant-jump-this-week-in-reported-injuries-deaths-after-covid-vaccine%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fawakecanada.org%2Fsignificant-jump-this-week-in-reported-injuries-deaths-after-covid-vaccine%2F&text=Significant%20Jump%20This%20Week%20in%20Reported%20Injuries%2C%20Deaths%20After%20COVID%20Vaccine", "https://www.instagram.com/", "https://mewe.com/share?link=https%3A%2F%2Fawakecanada.org%2Fsignificant-jump-this-week-in-reported-injuries-deaths-after-covid-vaccine%2F", "https://api.whatsapp.com/send?text=Significant%20Jump%20This%20Week%20in%20Reported%20Injuries%2C%20Deaths%20After%20COVID%20Vaccine https%3A%2F%2Fawakecanada.org%2Fsignificant-jump-this-week-in-reported-injuries-deaths-after-covid-vaccine%2F", "https://awakecanada.org/significant-jump-this-week-in-reported-injuries-deaths-after-covid-vaccine/", "https://mail.google.com/mail/?ui=2&view=cm&fs=1&tf=1&su=Significant%20Jump%20This%20Week%20in%20Reported%20Injuries%2C%20Deaths%20After%20COVID%20Vaccine&body=Link:https%3A%2F%2Fawakecanada.org%2Fsignificant-jump-this-week-in-reported-injuries-deaths-after-covid-vaccine%2F", "https://awakecanada.org/significant-jump-this-week-in-reported-injuries-deaths-after-covid-vaccine/", "https://awakecanada.org/significant-jump-this-week-in-reported-injuries-deaths-after-covid-vaccine/"], "authors": [], "publish_date": "2021-05-01T04:12:54+00:00"}