{"result_id": "042021", "URL": "https://awakecanada.org/german-autopsy-mrna-vaccine-study-is-blocked-by-western-media/", "timestamp": "2023-04-25 12:13:39 CEST+0200", "meta": {"description": "We are going through massive censorship of the effects of these vaccines and have been from the very first month. If you have followed this site, you would have been made aware of the Bonnie Henry emails that were obtained through the freedom of inf0rmation act that shows that she knew these were not safe", "lang": "en", "keywords": "", "favicon": "https://awakening.s3.amazonaws.com/wp-content/uploads/2021/10/09132407/favicon-32x32-1.png", "canonical": "https://awakecanada.org/german-autopsy-mrna-vaccine-study-is-blocked-by-western-media/", "encoding": "utf-8"}, "image": null, "domain": "awakecanada.org", "title": "German Autopsy mRNA Vaccine Study is blocked by Western Media", "cleaned_text": "I am an extremely concerned citizen about the direction our politicians wish to take us, UNLAWFULLY, against our wishes. The evidence, lying and censoring the truth about covid 19 is at an all time high. I am not a doctor, or scientist. Nor do I need to be. There is massive censorship of these professionals funded by big pharma to silence them from exposing the truth. On this site, I have documented their videos, along with lawyers all over the world. There are multiple law suits in Canada against the Federal and Provincial governments for their actions regarding Covid 19. The cases and lawyers are well documented on this site, and you can find them under the Awake Resources tab. The research is accumulated through thousands of our members, some of which are police, doctors, chiropractors, immunologists, and harvard educated people. We are not anti-vaxxers, nor conspiracy theorists. We are citizens that are determined to expose the truth. The mainstream media on this planet is owned by 6 large companies. The rest are subsidiaries, and all of them are being given directives to suppress anything against the narrative of lockdowns, and vaccines. There is a political agenda in play here, and our governments have turned against their people. They are using software, and mail in ballots to keep their political figures in office to complete this agenda. We are all being played on a massive level, and by investigating the material on this site and thousands of other sites that popped up trying to share the truth with you, our goal is simply this. To save our Country from totalitarianism and to save our citizens from medical tyranny from corrupt organizations such as the WHO, and the CDC. These companies are now just vaccine companies owned by the medical cartel we are all falling victim too. This is a wake up call to humanity, our police, military, and citizens to take back our country and expose the criminals, and to hold them accountable in trials for war crimes against humanity. WE WILL WIN PEOPLE! STAY STRONG. STAY FOCUSED. NEVER STOP SPREADING THE TRUTH. THE TRUTH WILL PREVAIL!!", "opengraph": {"locale": "en_US", "site_name": "Awake Canada", "type": "article", "title": "German Autopsy mRNA Vaccine Study is blocked by Western Media", "description": "We are going through massive censorship of the effects of these vaccines and have been from the very first month.  If you have followed this site, you would have been made aware of the Bonnie Henry emails that were obtained through the freedom of inf0rmation act that shows that she knew these were not safe", "url": "https://awakecanada.org/german-autopsy-mrna-vaccine-study-is-blocked-by-western-media/", "image": "https://awakening.s3.amazonaws.com/wp-content/uploads/2022/12/20142130/Screen-Shot-2022-12-20-at-2.20.20-PM.jpg", "image:secure_url": "https://awakening.s3.amazonaws.com/wp-content/uploads/2022/12/20142130/Screen-Shot-2022-12-20-at-2.20.20-PM.jpg", "image:width": "1534", "image:height": "850", "article:published_time": "2022-12-20T22:22:05+00:00", "article:modified_time": "2022-12-20T22:22:05+00:00", "article:publisher": "https://www.facebook.com/groups/awakecanada"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2022-12-20T22:22:05+00:00"}