{"result_id": "043006", "URL": "https://awarenessact.com/the-symptoms-and-causes-of-monkeypox-infection-that-is-spreading-like-wildfire-throughout-the-globe/", "timestamp": "2023-04-25 12:15:20 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://awarenessact.com/wp-content/uploads/2016/02/cropped-logo-aa-fb-32x32.png", "canonical": "https://awarenessact.com/the-symptoms-and-causes-of-monkeypox-infection-that-is-spreading-like-wildfire-throughout-the-globe/", "encoding": "UTF-8"}, "image": null, "domain": "awarenessact.com", "title": "The Symptoms and Causes of Monkeypox Infection That is Spreading Like Wildfire Throughout the Globe", "cleaned_text": "Over the past three weeks, over 250 cases of monkeypox (which is a less severe cousin of smallpox) have been reported in 16 different countries. And according to experts, the virus is spread by close and prolonged contact.\n\nFor quite some time, monkeypox has been endemic to Africa, and it wasn’t until recently that the virus began spreading into other nations. “This is an emerging disease. It has been emerging for the last 20 to 30 years, (so) it’s not unknown, it’s very well described,” explained Rosamund Lewis, who is head of the smallpox secretariat from the WHO Emergencies program.\n\nBut, the problem is that “The countries that are reporting monkeypox now are countries that do not normally have outbreaks of monkeypox,” Rosamund says.\n\nCurrently, only three cases have been confirmed in the United States. With the recent pandemic not long behind us, many are worried as to what this could bring. However, monkeypox is much different. Here is everything you need to know.\n\nMonkeypox is spread through close and prolonged contact with an infected animal or person. It can be spread through lesions, bodily fluids, and respiratory droplets. Monkeypox incubates for around 7-14 days and up to 21 days.\n\nAt the beginning of the illness, the virus presents the following symptoms:\n\nWithin days of the first fever, a rash begins to develop on the face and then moves to other parts. Then, lesions begin to develop. The illness lasts 2-4 weeks and rarely results in death.\n\nAccording to the Hill, the smallpox vaccine is 85% effective at combating monkeypox. However, beginning in 1972, the smallpox vaccine campaigns were ended, so most younger people are likely not vaccinated against smallpox.", "opengraph": {"title": "The Symptoms and Causes of Monkeypox Infection That is Spreading Like Wildfire Throughout the Globe", "type": "article", "image": "https://awarenessact.com/wp-content/uploads/2022/05/Monkeypox_By_Country.jpg", "url": "https://awarenessact.com/the-symptoms-and-causes-of-monkeypox-infection-that-is-spreading-like-wildfire-throughout-the-globe/", "description": "Over the past three weeks, over 250 cases of monkeypox (which is a less severe cousin of smallpox) have been reported in 16 different countries....", "locale": "en_US", "site_name": "Awareness Act", "article:tag": "vaccine", "article:section": "Health", "article:published_time": "2022-05-26T16:44:11+00:00", "article:modified_time": "2022-05-26T16:44:11+00:00", "article:author": "https://awarenessact.com/author/danielle/"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.cdc.gov/poxvirus/monkeypox/symptoms.html", "https://thehill.com/policy/healthcare/3498248-here-are-the-signs-and-symptoms-of-monkeypox/"], "authors": ["https://awarenessact.com/author/danielle/"], "publish_date": "2022-05-26T16:44:11+00:00"}