{"result_id": "043004", "URL": "https://awarenessact.com/pfizer-to-test-covid-19-vaccine-on-children-as-young-as-12/", "timestamp": "2023-04-25 12:15:19 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://awarenessact.com/wp-content/uploads/2016/02/cropped-logo-aa-fb-32x32.png", "canonical": "https://awarenessact.com/pfizer-to-test-covid-19-vaccine-on-children-as-young-as-12/", "encoding": "UTF-8"}, "image": null, "domain": "awarenessact.com", "title": "Pfizer To Test COVID-19 Vaccine On Children As Young As 12", "cleaned_text": "For those who do not know Pfizer is a drugmaker/company that has been working on a COVID-19 vaccine. This vaccine is one that seems to so far be quite promising and well, as trials begin some are concerned about the age of those involved.\n\nAccording to CNN Pfizer will be testing this experimental COVID-19 vaccine in kids who are as young as 12 years old but it should also be noted the children involved will be those whose parents have expressed interest in such. This is interesting as here in the US this would be the first COVID-19 vaccine that includes children in their testing on this scale.\n\nNPR wrote as follows on this breaking down what was announced as of late:\n\nPfizer announced this week that it has received FDA approval to enroll children as young as 12 years old in its COVID-19 vaccine trial. The expansion is aimed at understanding whether the vaccine would be safe and effective for adolescents.\n\nUntil now, children under 16 have not been included in any of the COVID-19 vaccine trials in the U.S., and the average age of participants has skewed much older.\n\n” I think this is a really big deal,” says L.J. Tan, chief strategy officer of the Immunization Action Coalition. “Without clinical trials actually done in children, the only way to actually extend the use of the COVID-19 vaccine into children would be to rely on the adult data,” Tan says, which is not ideal.\n\nEarlier this month, the American Academy of Pediatricians wrote to top federal health officials urging them to take this step. “Children must be included in vaccine trials to best understand any potential unique immune responses and/or unique safety concerns,” wrote AAP president Sara Goza in a letter, which was sent to Alex Azar, Secretary of the U.S. Department of Health and Human Services, and Stephen Hahn, Commissioner of the U.S. Food and Drug Administration.\n\nIn recent months, it’s become increasingly clear that children can be infected with the virus, and while they often have only mild disease or are asymptomatic, they can also infect others.\n\nWhile a lot of people are very much against using children to test this kind of thing, it does make sense that children would need to be included on some level. As noted above the company has approval from the FDA and from here things will begin very soon. Considering how children are, a vaccine that we know works for them would be very beneficial in getting this virus under control, wouldn’t you agree?\n\nCNN reported as follows on this:\n\nChildren can develop serious illness and also die from coronavirus and there is no way to predict which ones will, he said. They also can spread it to other, more vulnerable people, including parents, grandparents, healthcare workers, and others. And children can develop a rare but serious side-effect from coronavirus infection called multisystem inflammatory syndrome in children or MIS-C.\n\nFrenck also believes more children have been infected with coronavirus than the official data show. “I think we are probably under detecting the number of kids that are infected because they are not getting sick enough to where a parent says they need to go to a doctor,” he said.\n\n“Most of the time in kids, you have a young kid at home and they have a runny nose, they have a cough — you are not going to bring them to a doctor,” he added.\n\n“And most of the time, what a coronavirus causes is a cold.”\n\nPlus, the FDA has asked the companies working to make a coronavirus vaccine to test them in diverse groups — including in people usually missed in drug and vaccine trials, such as the elderly, Blacks, Hispanics, and Native Americans.\n\nWhat do you think about all of this? I for one think that only time will tell when it comes to any vaccine that may be to come and just how testing needs to play out overall. With so many vaccines in the works, we are likely to see some odd effects with some, and with others, perhaps we will end up with something that really does help.", "opengraph": {"title": "Pfizer To Test COVID-19 Vaccine On Children As Young As 12", "type": "article", "image": "https://awarenessact.com/wp-content/uploads/2020/10/shutterstock_1673309629.jpg", "url": "https://awarenessact.com/pfizer-to-test-covid-19-vaccine-on-children-as-young-as-12/", "description": "For those who do not know Pfizer is a drugmaker/company that has been working on a COVID-19 vaccine. This vaccine is one that seems to...", "locale": "en_US", "site_name": "Awareness Act", "article:tag": "vaccine", "article:section": "Health & Wellness", "article:published_time": "2020-10-19T20:59:27+00:00", "article:modified_time": "2020-10-19T20:59:27+00:00", "article:author": "https://awarenessact.com/author/shelly/"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.immunize.org/aboutus/litjen_tan_bio.asp", "https://downloads.aap.org/DOFA/AAPLettertoHHSandFDAChildreninCOVID19VaccineTrials.pdf", "http://www.cnn.com/2020/05/19/health/mis-c-coronavirus-children-doctors-immediate/index.html", "https://www.npr.org/sections/health-shots/2020/10/13/923248377/will-kids-get-a-covid-19-vaccine-pfizer-to-expand-trial-to-ages-12-and-up", "https://www.cnn.com/2020/10/13/health/covid-vaccine-pfizer-kids-bn/index.html"], "authors": ["https://awarenessact.com/author/shelly/"], "publish_date": "2020-10-19T20:59:27+00:00"}