{"result_id": "043011", "URL": "https://awarenessact.com/florida-bill-demands-newborns-have-eyes-dilated-within-48-hours-of-birth/", "timestamp": "2023-04-25 12:15:22 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://awarenessact.com/wp-content/uploads/2016/02/cropped-logo-aa-fb-32x32.png", "canonical": "https://awarenessact.com/florida-bill-demands-newborns-have-eyes-dilated-within-48-hours-of-birth/", "encoding": "UTF-8"}, "image": null, "domain": "awarenessact.com", "title": "Florida Bill Demands Newborns Have Eyes Dilated Within 48 Hours Of Birth", "cleaned_text": "A Florida Bill is causing quite the stir in recent times. This is SB46 and while it seems harmless at first glance, the more you dive into it the more concerning its contents become.\n\nMany have taken to social media in opposition to this bill but it for some reason is not getting much coverage. This bill proposes the removal of some vaccine exemptions including medical ones and even goes so far as to make eye evaluations for newborns mandatory. This meaning if a mother just the day after giving birth refuses to allow her child to have his or her eyes dilated, she would be charged with a misdemeanor.\n\nPart of this bill states as follows:\n\nThe physician, midwife, or other person in attendance at the birth of a child in this state shall instill or have instilled into the eyes of the newborn baby within 1 hour after birth an effective prophylactic recommended by the Committee of Infectious Diseases of the American Academy of Pediatrics for the prevention of neonatal ophthalmia.\n\nBefore being discharged from the hospital, each child born in a hospital in this state must receive an eye examination, using a direct ophthalmoscope, in which the newborn’s pupils are dilated to allow detection of pediatric congenital and ocular abnormalities and developmental abnormalities.\n\nTo read over the rest of this bill click here. From there mandatory follow up exams are required at 6-8 weeks and 6-9 months. Considering what babies are already put through as is, this is too much in every possible way. There is no necessity in having these eye exams the day after birth as congenital/developmental eye anomalies and other things of the sort can be noted after a visit later on. They are not necessarily hard to find and in most cases only require glasses or patching.\n\nWhile those in charge think they have found the perfect means in justifying such a serious push for something so extreme and unnecessary mothers, in general, are blown away by how encroaching things are becoming. Many are also noticing that these eye issues could be stemming from the ointment being used (in reference to the drops the bill mentioned) after the babies are born as is. These drops can cause newborn babies eyes to be very irritated and in some cases even swelling.\n\nWhat do you think about all of this? Do you think Florida is overstepping? Things like this are common in places like California as well, perhaps we are on our way to a very overstepping situation in more ways than we could imagine. Eye exams are important but should they be done at such a young age?", "opengraph": {"title": "Florida Bill Demands Newborns Have Eyes Dilated Within 48 Hours Of Birth", "type": "article", "image": "https://awarenessact.com/wp-content/uploads/2019/09/shutterstock_78559897.jpg", "url": "https://awarenessact.com/florida-bill-demands-newborns-have-eyes-dilated-within-48-hours-of-birth/", "description": "A Florida Bill is causing quite the stir in recent times. This is SB46 and while it seems harmless at first glance, the more you...", "locale": "en_US", "site_name": "Awareness Act", "article:tag": "sb46", "article:section": "Government", "article:published_time": "2019-09-20T17:33:58+00:00", "article:modified_time": "2019-09-20T17:33:58+00:00", "article:author": "https://awarenessact.com/author/shelly/"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p dir=\"ltr\" lang=\"en\">So <a href=\"https://twitter.com/hashtag/SB46?src=hash&amp;ref_src=twsrc%5Etfw\">#SB46</a> is really mandating that all newborns have eye ointment &amp; extensive eye exam requiring dilation of the pupil, 24-48 hours old ¿ fuck sake with this country 🚫</p>\n<p>— Lizbeth Fraire (@lizbethfrairee) <a href=\"https://twitter.com/lizbethfrairee/status/1174085759411859456?ref_src=twsrc%5Etfw\">September 17, 2019</a></p></blockquote>\n"], "movies": [], "links": ["https://www.flsenate.gov/Session/Bill/2020/46", "https://twitter.com/hashtag/SB46?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/lizbethfrairee/status/1174085759411859456?ref_src=twsrc%5Etfw", "http://m.flsenate.gov/session/bill/2020/46/billtext/filed/html?fbclid=IwAR2gI3pYKoIPUabFAt1WHEwJBLXLdzUsu5vUR4pIw1iLmNlgrdz8o-OSWUE", "http://m.flsenate.gov/session/bill/2020/46/billtext/filed/html?fbclid=IwAR2gI3pYKoIPUabFAt1WHEwJBLXLdzUsu5vUR4pIw1iLmNlgrdz8o-OSWUE", "https://childrensnational.org/visit/conditions-and-treatments/eye-conditions/congenital-developmental-anomalies-affecting-the-eye-and-orbit", "https://www.chop.edu/conditions-diseases/eye-prophylaxisvitamin-k-injection"], "authors": ["https://awarenessact.com/author/shelly/"], "publish_date": "2019-09-20T17:33:58+00:00"}