{"result_id": "043005", "URL": "https://awarenessact.com/14-dark-things-you-probably-dont-realize-about-jim-carrey/", "timestamp": "2023-04-25 12:15:20 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://awarenessact.com/wp-content/uploads/2016/02/cropped-logo-aa-fb-32x32.png", "canonical": "https://awarenessact.com/14-dark-things-you-probably-dont-realize-about-jim-carrey/", "encoding": "UTF-8"}, "image": null, "domain": "awarenessact.com", "title": "14 Dark Things You Probably Don’t Realize About Jim Carrey", "cleaned_text": "We all have our dark sides and we all have our own issues but accepting that is a lot easier said than done. While we might think our favorite actors and actresses are perfect, but the truth is, they are far from it.\n\nJim Carrey is one of the strangest faces of Hollywood. He has been in tons of movies and is quite hilarious all the while having some very serious and interesting secrets that aren’t exactly secrets. While a lot of these things are very public people choose to ignore them or just don’t ever hear about them.\n\nHe is someone that while very wise is also just human like the rest of us. Below I am going to go over some of the interesting things that some would consider a bit ‘dark’ about him. While not all will come as a shock, some might really make you think twice.\n\n14 ‘Dark Things’ About Jim Carrey You May Not Know:\n\n1. He might have a real coke problem.\n\nChances are you’ve considered this possibility before. His now deceased ex has even been recorded mentioning he had an addiction to cocaine and that he refers to it as sugar. Whether or not he is still a user or was ever a real user is something no one can really say for sure but anything is possible.\n\n2. One time he wore Jenny McCarthy’s bathing suit to the beach\n\nI know, not very shocking when you think about who this is but still, the image itself is something you can’t unsee. More power to him but I think what truly makes this one dark is that he looked much better than she did in it. Perhaps he should have opted for them more often?\n\n3. He has been homeless before.\n\nFor some reason, people like to assume famous people just land their roles right off the bat and don’t have to work hard or struggle, this is not true. Some of the most famous people in this world have come from poor homes as hard as it is to believe. Carrey has had financial problems and when he was just about 12 years old had to live in a camper van with his whole family.\n\n4. He shamed Tiger Woods wife when the truth came out.\n\nHe took to Twitter amidst all of the drama and spilled some very hot tea. I guess you could say he said what many were thinking but still, was it right? I guess at the end of the night anything goes if your Jim Carrey.\n\n5. Back in 2011, He was obsessed with vandalism.\n\nYes, not too long ago he was all about spray painting ‘baba’ on buildings. Baba for those who are not familiar is a deity he apparently believes in. While police kept covering his work he made his way back and redid it every time.\n\n6. He most likely gave his ex STDs. (YES, plural)\n\nAccording to many different sources, he and his ex’s split (before her death) was because he had given her three STDs. It has been said that he was using an alias for his medical records somehow and was positive for Hepatitis A, HSV 1 and 2, as well as Chlamydia. Quite the variety now, isn’t it? That being said, he believes his ex actually forged these test results to try and extort him. What do you think?\n\n7. He wants to father Emma Stone’s babies.\n\nWhile he says he was just joking Jim posted a video online that has creepy vibes and is aimed towards Emma Stone. The video in itself is hard to watch and nowhere near as funny as I am sure he thought it would be. It is literal disrespectful and quite unsettling.\n\nYes, Jim loves to paint but the dark part about this one is the work he does. His pieces are quite interesting and some are either something you really like or hate. Chances are you haven’t been seeing him on the big screen recently but if you take a look online his artwork can be found easily.\n\n9. He does not believe in organized religion.\n\nJim is a very godly and spiritual person but he does not believe in the church like most people do. He says that his time is better spent worshiping God and doing good. He does not waste his time breaking things down as he does not believe it is necessary.\n\n10. He believes the MMR vaccine causes autism.\n\nHe is very against vaccination because of the toxic substances within them. He has been advocating for this kind of thing for quite some time and is very passionate about it. While he has faced lots of criticism of his views in this aspect, it is something he will not let up on. His reasoning behind this has much to do with his ex Jenny Mcarthy’s son and his battle with autism.\n\n11. He is believed to have enabled his ex when it comes to her suicide.\n\nJim is said to have been providing her with painkillers and other things that she used in her death. There was actually even a case on this and while we don’t know everything it sounds like a shit show all around. While it is heart-breaking that she passed, could you really blame him for her actions in the long-run?\n\n12. He was super creepy in his younger years.\n\nIf you think he’s creepy now, you haven’t seen anything. Jim has always been a bit odd. He was slightly morbid and pretty closed off but eventually found his passion. When you look at how Jim was in his younger years it really makes current Jim seem quite normal.\n\n13. When Tupac was in prison Jim wrote him letters.\n\nWhile this one isn’t necessarily dark it is quite unexpected. This unlikely friendship is one worth mentioning. When Tupac was in prison Jim wrote him silly letters and always attempted to make him laugh. Both got along quite well and I am sure Jim’s letters brightened Tupacs day in some way.\n\n14. He thought about killing his mother.\n\nJim in a Rolling Stones interview mentioned that before he had thought about murdering his mother. This because when he was younger he didn’t want to live with his family. He even went as far to say that he contemplated strangling her in her sleep. While he never acted on it you could say his openness about it made it feel much less like a joke and more-so a real option.", "opengraph": {"title": "14 Dark Things You Probably Don’t Realize About Jim Carrey", "type": "article", "image": "https://awarenessact.com/wp-content/uploads/2018/09/23-1.jpg", "url": "https://awarenessact.com/14-dark-things-you-probably-dont-realize-about-jim-carrey/", "description": "We all have our dark sides and we all have our own issues but accepting that is a lot easier said than done. While we...", "locale": "en_US", "site_name": "Awareness Act", "article:tag": "vandalism", "article:section": "Other", "article:published_time": "2018-09-14T18:30:49+00:00", "article:modified_time": "2019-02-25T19:25:34+00:00", "article:author": "https://awarenessact.com/author/shelly/"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\" data-lang=\"en\">\n<p dir=\"ltr\" lang=\"en\">No wife is blind enough to miss that much infidelity. Elin had 2 b a willing participant on the ride 4 whatever reason. kids/lifestyle ;^)</p>\n<p>— Jim Carrey (@JimCarrey) <a href=\"https://twitter.com/JimCarrey/status/11896451642?ref_src=twsrc%5Etfw\">April 9, 2010</a></p></blockquote>\n"], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "680", "height": "415", "embed_code": "<iframe loading=\"lazy\" src=\"https://www.youtube.com/embed/fNrkcY-I0RA\" width=\"680\" height=\"415\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/fNrkcY-I0RA"}], "links": ["https://www.popsugar.com/celebrity/Photos-Jim-Carrey-Jenny-McCarthy-Wearing-Same-Bathing-Suit-4th-July-Malibu-1760248", "http://poplyft.com/the-family-lived-in-a-van-jim-carrey-beat-the-odds/", "http://poplyft.com/the-family-lived-in-a-van-jim-carrey-beat-the-odds/", "https://twitter.com/JimCarrey/status/11896451642?ref_src=twsrc%5Etfw", "http://www.tmz.com/2011/09/08/jim-carrey-street-art-new-york-city-baba-art-spray-can-tagging-rebellion-revenge-video/", "https://www.dailymail.co.uk/news/article-3860224/STD-test-filed-Jim-Carrey-wrongful-death-lawsuit-confirms-positive-results-Herpes-Chlamidya-Hepatitis-A.html", "http://www.happysonship.com/faith-of-jim-carrey/", "https://www.theguardian.com/society/2015/jul/01/jim-carrey-california-vaccine-law", "https://www.eonline.com/news/817462/jim-carrey-challenges-mother-of-late-girlfriend-cathriona-white-over-wrongful-death-lawsuit", "https://www.thevintagenews.com/2017/02/04/jim-carrey-wrote-humorous-letters-to-tupac-to-cheer-him-up-while-in-prison/", "https://www.rollingstone.com/culture/culture-news/jim-carrey-bare-facts-and-shocking-revelations-181569/"], "authors": ["https://awarenessact.com/author/shelly/"], "publish_date": "2018-09-14T18:30:49+00:00"}