{"result_id": "043008", "URL": "https://awarenessact.com/putins-covid-vaccine-approved-after-testing-on-only-38-people/", "timestamp": "2023-04-25 12:15:21 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://awarenessact.com/wp-content/uploads/2016/02/cropped-logo-aa-fb-32x32.png", "canonical": "https://awarenessact.com/putins-covid-vaccine-approved-after-testing-on-only-38-people/", "encoding": "UTF-8"}, "image": null, "domain": "awarenessact.com", "title": "Putin’s Covid Vaccine Approved After Testing On Only 38 People", "cleaned_text": "While the race for a COVID-19 vaccine has been in the works by many across the globe in different ways for some time now, at the moment we don’t have much. However, it seems Russia may finally have something interesting on their hands as officials claim a vaccine has been approved.\n\nWhile this vaccine has not been tested on a lot of people it according to the BBC has been approved as Mr. Putin says it has passed all the required checks. He even as the BBC has noted gave it to his own daughter.\n\nWhile concerns are quite present about how rushed this specific vaccine feels it may prove to be quite useful as time passed but for now we just don’t know. Sure, it may seem to work but could there be more to that than we realize?\n\nCNN wrote as follows on this vaccine and the topic at hand:\n\n“A vaccine against coronavirus has been registered for the first time in the world this morning,” Putin said on state TV. “I know that it works quite effectively, it forms a stable immunity.”\n\nPutin added that one of his daughters had already taken it; he said she had a slightly higher temperature after each dose, but that: “Now she feels well.”\n\nDeveloped by the Moscow-based Gamaleya Institute, the vaccine has been named Sputnik-V, a reference to the surprise 1957 launch of the world’s first satellite by the Soviet Union. It has yet to go through crucial Phase 3 trials where it would be administered to thousands of people.\n\nThe claim of victory by Putin in the global push to make an effective vaccine against Covid-19 comes amid suggestions that Russia has cut essential corners in its development.\n\nCritics say the country’s push for a vaccine is partly due to political pressure from the Kremlin, which is keen to portray Russia as a global scientific force.\n\nRussia has released no scientific data on its testing and CNN is unable to verify the vaccine’s claimed safety or effectiveness.\n\nIt is said by the end of this year the vaccine in question will be in production for the country itself and well, Putin seems to think it works quite effectively. According to Reuters, it will be administered to government officials and medical personnel first and then teachers ‘on a voluntary basis at the end of this month or in early September.’ Reuters also mentioned in an article on this topic that this approval comes before the start of a larger trial that will involve thousands of participants which could end up giving us the information we need on the vaccine itself.\n\nTo learn more about this take a look at the video below. Would you get this vaccine if it were available to you? Sure, a quick vaccine was needed but how quick was or is too quick?", "opengraph": {"title": "Putin’s Covid Vaccine Approved After Testing On Only 38 People", "type": "article", "image": "https://awarenessact.com/wp-content/uploads/2020/08/shutterstock_1703465413.jpg", "url": "https://awarenessact.com/putins-covid-vaccine-approved-after-testing-on-only-38-people/", "description": "While the race for a COVID-19 vaccine has been in the works by many across the globe in different ways for some time now, at...", "locale": "en_US", "site_name": "Awareness Act", "article:tag": "vaccine", "article:section": "Science", "article:published_time": "2020-08-12T20:30:03+00:00", "article:modified_time": "2020-08-12T20:30:03+00:00", "article:author": "https://awarenessact.com/author/shelly/"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1080", "height": "608", "embed_code": "<iframe title=\"Russia becomes first country to authorize COVID-19 vaccine\" width=\"1080\" height=\"608\" src=\"https://www.youtube.com/embed/i0EXw2Rmz8c?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/i0EXw2Rmz8c?feature=oembed"}], "links": ["https://cnn.com/2020/05/17/europe/russia-coronavirus-time-zones-intl/index.html", "https://www.cnn.com/2020/08/11/europe/russia-coronavirus-vaccine-putin-intl/index.html", "https://www.bbc.com/news/world-europe-53735718", "https://www.reuters.com/article/us-health-coronavirus-russia-vaccine-put/putin-hails-new-sputnik-moment-as-russia-is-first-to-approve-a-covid-19-vaccine-idUSKCN25712U"], "authors": ["https://awarenessact.com/author/shelly/"], "publish_date": "2020-08-12T20:30:03+00:00"}