{"result_id": "043003", "URL": "https://awarenessact.com/celiac-disease-vaccine-in-clinical-trials/", "timestamp": "2023-04-25 12:15:19 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://awarenessact.com/wp-content/uploads/2016/02/cropped-logo-aa-fb-32x32.png", "canonical": "https://awarenessact.com/celiac-disease-vaccine-in-clinical-trials/", "encoding": "UTF-8"}, "image": null, "domain": "awarenessact.com", "title": "Celiac Disease Vaccine In Clinical Trials", "cleaned_text": "While the only treatment for celiac disease at the moment is to opt for gluten-free, everything. This is quite the hassle and can be tricky sometimes.\n\nThat being said, things could be changing in the future. The company ‘ImmusanT‘ has recently announced that they will be starting phase two of clinical trials for a celiac disease vaccine that they are calling Nexvax2. This vaccine has been designed to protect those with the disease from exposure to gluten, basically.\n\nThe company wrote as follows in a statement released on their website:\n\n“The initiation of our Nexvax2 Phase 2 trial is significant for patients who suffer from celiac disease, a condition affecting approximately 1% of the global population,” said Leslie Williams, Chief Executive Officer of ImmusanT. “This trial is designed to demonstrate protection against inadvertent exposure to gluten, but the ultimate goal is to develop Nexvax2 as a treatment that will allow patients to return to an unrestricted diet. We look forward to taking the next step to collect the clinical evidence to move Nexvax2 towards approval.”\n\nThis Phase 2 study will build upon previous Phase 1 results that have shown Nexvax2 to be safe and tolerable at its highest dose levels following stepwise up-dosing. By further testing Nexvax2 at therapeutically-relevant dose levels, the company believes the findings will be significant in advancing the understanding of the potential impact of peptide-based immunotherapies.\n\n“This trial is important in establishing clinical proof-of-concept for a treatment that would provide benefit beyond that of the gluten-free diet,” said Ken Truitt, M.D., Chief Medical Officer of ImmusanT. “Avoiding gluten is burdensome and not entirely effective; even the most diligent patients incur inadvertent exposure. Through this study, we anticipate making new insights that will further our ability to demonstrate specific suppression of the immune response to gluten epitopes and associated effects of celiac disease.”\n\nThis could give those with the disease an upperhand for when it comes to accidentally ingesting things like wheat or rye that would normally set things into a serious fit. This vaccine is administered slowly and works to reprogram the T-cells within a person. These are the cells that trigger inflammatory responses in those with celiac disease.\n\nTo learn more about this potential vaccine please check out the video below. Whether you are for or against this kind of thing, it does seem quite interesting. What do you think about the concept?", "opengraph": {"title": "Celiac Disease Vaccine In Clinical Trials", "type": "article", "image": "https://awarenessact.com/wp-content/uploads/2018/11/shutterstock_1020163207.jpg", "url": "https://awarenessact.com/celiac-disease-vaccine-in-clinical-trials/", "description": "While the only treatment for celiac disease at the moment is to opt for gluten-free, everything. This is quite the hassle and can be tricky...", "locale": "en_US", "site_name": "Awareness Act", "article:tag": "vaccine", "article:section": "Science", "article:published_time": "2018-11-08T06:28:47+00:00", "article:modified_time": "2018-11-08T06:28:47+00:00", "article:author": "https://awarenessact.com/author/shelly/"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "680", "height": "415", "embed_code": "<iframe src=\"https://www.youtube.com/embed/Y8st89r6ddo\" width=\"680\" height=\"415\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/Y8st89r6ddo"}], "links": ["http://www.immusant.com/docs/ImmusanT_Nexvax2-Phase-2-FIP-Press-Release_9.27.18_FINAL.pdf", "http://www.immusant.com/docs/ImmusanT_Nexvax2-Phase-2-FIP-Press-Release_9.27.18_FINAL.pdf"], "authors": ["https://awarenessact.com/author/shelly/"], "publish_date": "2018-11-08T06:28:47+00:00"}