{"result_id": "045007", "URL": "https://beholdisrael.org/former-british-prime-minister-gordon-brown-voices-support-of-one-world-government/", "timestamp": "2023-04-25 12:15:27 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://beholdisrael.org/wp-content/uploads/2018/11/behold-israel-favicon-32-wht.png", "canonical": "https://beholdisrael.org/former-british-prime-minister-gordon-brown-voices-support-of-one-world-government/", "encoding": "utf-8"}, "image": null, "domain": "beholdisrael.org", "title": "Former British Prime Minister Gordon Brown Voices Support of One World Government", "cleaned_text": "Former British PM calls for ‘temporary’ world government amid the battle against COVID-19; Brown believes that no one country can come up with a solution on their own; Brown: There has to be a coordinate global response…We need some sort of working executive.\n\nEarlier this week, amid the ever-spreading pandemic of the coronavirus, former British Prime Minister Gordon Brown voiced his support of a ‘temporary’ world government. He argued that no one country would be able to come up with a solution on their own and that international leaders will need to work together to form a solution.\n\nIncluded in the former left-wing prime minister’s plan would be efforts to locate a vaccine for the virus followed by a plan to mass-produce it for sale. His ‘temporary’ world government would also give direction to central banks and have other economic authority.\n\nBrown argued, “There has to be a coordinated global response…We need some sort of working executive. If I were doing it again, I would make the G20 a broader organization because in the current circumstances you need to listen to the countries that are most affected, the countries that are making a difference and countries where there is the potential for a massive number of people to be affected – such as those in Africa.”\n\nBrown spoke at the G20 Summit in 2009, stating, “I think the new world order is emerging and with it the foundations of a new and progressive era of international cooperation.”\n\nHistory reveals that Gordon Brown was a primary guest at the annual Bilderberg Meeting, where global elites gather to discuss and advance their agenda for the world. Other significant names that have partaken in this meeting include Bill & Hillary Clinton, David Rockefeller, Bill Gates, Tony Blair, Angela Merkel, and several others.", "opengraph": {"locale": "en_US", "type": "article", "title": "Former British Prime Minister Gordon Brown Voices Support of One World Government - Behold Israel", "description": "Former British PM calls for ‘temporary’ world government amid the battle against COVID-19; Brown believes that no one country can come up with a solution […]", "url": "https://beholdisrael.org/former-british-prime-minister-gordon-brown-voices-support-of-one-world-government/", "site_name": "Behold Israel", "article:published_time": "2020-03-28T18:18:31+00:00", "article:modified_time": "2020-03-28T19:18:38+00:00", "image": "https://beholdisrael.org/wp-content/uploads/shutterstock_1440282680.jpg", "image:width": "800", "image:height": "500", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": ["Behold Israel"], "publish_date": "2020-03-28T18:18:31+00:00"}