{"result_id": "045014", "URL": "https://beholdisrael.org/how-covid-19-is-impacting-iran-and-the-islamic-state/", "timestamp": "2023-04-25 12:15:37 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://beholdisrael.org/wp-content/uploads/2018/11/behold-israel-favicon-32-wht.png", "canonical": "https://beholdisrael.org/how-covid-19-is-impacting-iran-and-the-islamic-state/", "encoding": "utf-8"}, "image": null, "domain": "beholdisrael.org", "title": "How COVID-19 is Impacting Iran and the Islamic State", "cleaned_text": "The Islamic State of Iraq and Syria (ISIS) is telling its militants to refrain from Europe for the time being; Iran can’t seem to slow down the virus; How the virus is impacting the agenda of both regimes.\n\nWhile the virus known as COVID-19 continues to essentially put most of the globe on temporary lockdown, it’s also significantly hindering the regimes of both the Islamic Republic of Iran and the Islamic State of Iraq and Syria (ISIS). Iran can’t seem to slow down the spread of the virus and ISIS is hesitant to act for fear of it entering and spreading through their ranks.\n\nSince the virus struck the city of Qom, Iran, and spread rapidly from there, Iran hasn’t been transparent regarding the actual numbers of infections and fatalities (much like China). As of yesterday, Iran reported the number of fatalities from the virus to be close to 1,000, but the number is actually much higher. Bear in mind the massive graves Iran is preparing in Qom in addition to sources inside of the hospital(s) who claim that the death rate is much higher than what’s being reported.\n\nWith those of higher age being at a far greater risk to this virus, Iran is facing more problems because of the ages of many within the regime. Several high-ranking officials have fallen ill and some have died, including leaders within the Islamic Revolutionary Guard Corps (IRGC). Earlier this week, Iranian Supreme Leader Ali Khamenei went into a full quarantine after being exposed to someone who has the virus.\n\nNot only is the virus creating internal problems for the regime, but it’s also slowing down its mission to surround the Jewish State and acquire nuclear weaponry. Israeli officials believe and have reported that this virus, if nothing else, is putting a temporary pause on the activity of the world’s number one sponsor of terror.\n\nSadly, according to Iranian leaders, even if Israel were to create a vaccine and/or a cure for the virus in the coming weeks, they wouldn’t purchase it from Israel because their hate for the Jewish State is far greater than their concern for their own people. They said they would wait until they could buy it third party or on the open market (because that somehow doesn’t support Israel…).\n\nThe Islamic State is at a crossroads because they’re determined to do what is necessary to advance their agenda but they know they’re putting the entire evil movement at risk if they act in a careless manner while this virus rips through the Middle East and Europe.\n\nISIS leadership has told their militants to avoid any activity in Europe due to the current outbreak of the virus in that portion of the world. It also indicates that some of their militants may already be infected inside of Europe. Due to their lack of communication and transparency with the outside world, there are no exact statistics regarding how the virus has affected ISIS thus far.\n\nIn a recent ISIS newsletter, the writer referred to Europe as ‘the land of the epidemic’ and described the virus as a weapon being used by Allah to kill whoever he wants. He called the virus a “torment sent by god on whomsoever he wills…Illnesses do not strike by themselves but by the command and decree of god.”\n\nAn Iranian leader recently made similar claims regarding the virus and how it will kill whoever God sees fit to die.", "opengraph": {"locale": "en_US", "type": "article", "title": "How COVID-19 is Impacting Iran and the Islamic State - Behold Israel", "description": "The Islamic State of Iraq and Syria (ISIS) is telling its militants to refrain from Europe for the time being; Iran can’t seem to slow […]", "url": "https://beholdisrael.org/how-covid-19-is-impacting-iran-and-the-islamic-state/", "site_name": "Behold Israel", "article:published_time": "2020-03-18T17:32:42+00:00", "article:modified_time": "2020-03-18T17:33:43+00:00", "image": "https://beholdisrael.org/wp-content/uploads/shutterstock_1675338058.jpg", "image:width": "800", "image:height": "500", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": ["Behold Israel"], "publish_date": "2020-03-18T17:32:42+00:00"}