{"result_id": "045015", "URL": "https://beholdisrael.org/israeli-researchers-on-the-brink-of-having-a-vaccine-for-covid-19-coronavirus/", "timestamp": "2023-04-25 12:15:41 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://beholdisrael.org/wp-content/uploads/2018/11/behold-israel-favicon-32-wht.png", "canonical": "https://beholdisrael.org/israeli-researchers-on-the-brink-of-having-a-vaccine-for-covid-19-coronavirus/", "encoding": "utf-8"}, "image": null, "domain": "beholdisrael.org", "title": "Israeli Researchers on the Brink of Providing a Vaccine for CoVid-19 (Coronavirus)", "cleaned_text": "Israeli researchers in Northern Israel ran tests using birds that were carrying the coronavirus, finding that they were able to cure the birds of the disease; They expect the vaccine to be ready within three months.\n\nIn Northern Israel, researchers have been running tests on birds infected with the coronavirus and have recently discovered a cure, healing the birds of the virus. This is considered to be a breakthrough that could lead to a vaccine that is ready sometime in the next three months to help seriously combat this virus that is continuing to plague the world.\n\nThe researchers are hopeful, they say, because the ‘genetic structure’ of the virus inside of a bird is very similar to how it is inside of a human being. This being why they’re confident that they can have a vaccine in the next three months. This is crucial for the Jewish State alone being so close to Iran, who is experiencing the second-highest death toll worldwide due to the virus.\n\nAccording to David Zigdon, the Chief Operating Officer of the institute where the research is being done, the vaccine will be administered orally. He stated, “there is a great need for an immediate solution to human infection of coronavirus, and we have been working to do that nonstop. The solution we are developing against COVID-19 virus has proven effective, and we believe a version for human treatment can be ready within eight to 10 weeks. That would be followed by a 90-day test period to ensure safety. The treatment we developed for birds is given orally, and the treatment we are developing for humans will also be given orally.”\n\nThe director of the institute, Dan Levanon, has high hopes that the approval process won’t take as long as it normally does. He is confident that once the vaccine is approved, it can hit the markets at a faster rate due to the quick-spreading nature of this virus.\n\nAfter calling Abraham out from the land of his upbringing, God Himself vowed to make him into a great nation. Additionally, God promised that Abraham and his descendants would be a blessing to the whole world (Genesis 12:1-3). While the nature of this promise should first bring our attention to Jesus Christ, the Jewish Messiah, the promise doesn’t necessarily end there. Throughout history, God has used the Jewish people to provide a solution to difficult circumstances. Even now, Israel is teaching countries in Africa new strategies for collecting water out of the air because they’re nowhere in the vicinity of a primary water source! Should they provide a sufficient vaccine, and they believe they will, this will be just one more way God is unconditionally fulfilling what He promised.", "opengraph": {"locale": "en_US", "type": "article", "title": "Israeli Researchers on the Brink of Providing a Vaccine for CoVid-19 (Coronavirus) - Behold Israel", "description": "Israeli researchers in Northern Israel ran tests using birds that were carrying the coronavirus, finding that they were able to cure the birds of the […]", "url": "https://beholdisrael.org/israeli-researchers-on-the-brink-of-having-a-vaccine-for-covid-19-coronavirus/", "site_name": "Behold Israel", "article:published_time": "2020-02-28T02:51:50+00:00", "article:modified_time": "2020-02-28T02:52:04+00:00", "image": "https://beholdisrael.org/wp-content/uploads/shutterstock_1653729883.jpg", "image:width": "800", "image:height": "500", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": ["Behold Israel"], "publish_date": "2020-02-28T02:51:50+00:00"}