{"result_id": "045001", "URL": "https://beholdisrael.org/", "timestamp": "2023-04-25 12:15:23 CEST+0200", "meta": {"description": "Behold Israel is a non-profit organization. Our mission is to provide reliable and accurate reporting on developments in Israel and the region.", "lang": "en", "keywords": "", "favicon": "https://beholdisrael.org/wp-content/uploads/2018/11/behold-israel-favicon-32-wht.png", "canonical": "https://beholdisrael.org/", "encoding": "utf-8"}, "image": null, "domain": "beholdisrael.org", "title": "A Non Profit Teaching Ministry", "cleaned_text": "Behold Israel is a non-profit organization led by native Israeli Amir Tsarfati. Our mission is to provide reliable and accurate reporting on developments in Israel and the region. Amir’s live updates and teachings, based on God’s Written Word, sift out the truth on current events amidst global media bias against Israel. Through the website and app you can find information on our upcoming teaching engagements, Bible Experience Tours and the latest unfiltered news straight from Israel and much more. On YouTube you can find all of our teachings from around the globe available at no cost. You can also stay connected by following Behold Israel on Instagram, Facebook and Twitter. Telegram is the one-stop shop for daily updates from Amir related to current events in the Middle East and what’s taking place around the world.\n\nThrough the website and app you can find information on our upcoming teaching engagements, Bible Experience Tours and the latest unfiltered news straight from Israel and much more. On YouTube you can find all of our teachings from around the globe available at no cost. You can also stay connected by following Behold Israel on Instagram, Facebook and Twitter.\n\nAmir has been an international Bible teacher since 1999. He has spoken at conferences, churches and seminars around the globe. His teachings are centered on currents events in Israel and the region in light of the Bible.\n\nWe invite you to experience the Bible not just as a book, but as the reality of God’s chosen people and their promised land with their beloved city! Come walk in the footsteps of the patriarchs, prophets, kings and apostles from God’s Word. Experience Israel and its many breathtaking sites- from Jaffa and Caesarea through Mt. Carmel and the Valley of Armageddon, to Nazareth and the Sea of Galilee. To the Mount of Olives and the city of the great King- Jerusalem!\n\nWe invite you to experience the Bible not just as a book, but as the reality of God’s chosen people and their promised land with their beloved city! Come walk in the footsteps of the patriarchs, prophets, kings and apostles from God’s Word. Experience Israel and its many breathtaking sites- from Jaffa and Caesarea through Mt. Carmel and the Valley of Armageddon, to Nazareth and the Sea of Galilee. To the Mount of Olives and the city of the great King- Jerusalem!\n\n“The Alumni tour greatly deepened our love for the land of Israel and God’s incredible purposes for it – from ancient times to the present. Crossing into Jordan to visit Petra, exploring the ancient quarry of Zedekiah’s Cave in Jerusalem, seeing the rugged majesty of Solomon’s Pillars – there were many unforgettable moments. The Lord blessed us with a whole new family of friends as we worshipped and toured together.” “I didn’t expect this tour to change me, but it did. I can’t really say an exact moment during the trip where I realized something switched. I think Jesus just revealed Himself to me throughout it. Seeing how the people a part of this ministry, along with the diverse group of young adults who were on this tour walk so closely with Christ truly inspired me in my walk.” “Our Bible Experience Tour was truly life changing. Amir’s passion for his country and God’s Word brought every place we visited to life. Each day, we soaked in more of what God had in store for us. The country itself, together with Amir’s insightful teachings, has forever turned our Bibles from black and white to full technicolor. We loved it so much, we returned 8 months later for the Alumni tour. Thank you Behold Israel for making this all possible.”", "opengraph": {"locale": "en_US", "type": "website", "title": "Behold Israel - A Non Profit Teaching Ministry", "description": "Behold Israel is a non-profit organization. Our mission is to provide reliable and accurate reporting on developments in Israel and the region.", "url": "https://beholdisrael.org/", "site_name": "Behold Israel", "image": "https://beholdisrael.org/wp-content/uploads/2018/11/behold-israel-fb.jpg", "image:width": "1200", "image:height": "630", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.amazon.com/Has-Tribulation-Begun-Confusion-Redeeming/dp/0736987266/", "https://www.amazon.com/Has-Tribulation-Begun-Confusion-Redeeming/dp/0736987266/", "#", "https://zoom.us/j/96135149236", "https://beholdisrael.org/live-public-reading-of-scripture/", "https://beholdisrael.org/teaching-around-the-world/", "https://beholdisrael.org/bible-experience-tours/", "https://www.facebook.com/beholdisrael/", "https://www.instagram.com/beholdisrael/", "https://www.youtube.com/user/beholdisrael", "https://t.me/s/beholdisraelchannel", "https://www.facebook.com/beholdisrael/", "https://www.instagram.com/beholdisrael/", "https://www.youtube.com/user/beholdisrael", "https://t.me/s/beholdisraelchannel", "https://beholdisrael.org/teaching-around-the-world/", "https://beholdisrael.org/teaching-around-the-world/", "https://beholdisrael.org/bible-experience-tours/", "https://beholdisrael.org/bible-experience-tours/", "#", "https://beholdisrael.org/newsletter-and-email-updates/", "https://beholdisrael.org/app-download/", "https://beholdisrael.captivate.fm/listen"], "authors": [], "publish_date": null}