{"result_id": "045009", "URL": "https://beholdisrael.org/israel-breaks-into-the-top-20/", "timestamp": "2023-04-25 12:15:29 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://beholdisrael.org/wp-content/uploads/2018/11/behold-israel-favicon-32-wht.png", "canonical": "https://beholdisrael.org/israel-breaks-into-the-top-20/", "encoding": "utf-8"}, "image": null, "domain": "beholdisrael.org", "title": "Israel Breaks Into the Top 20", "cleaned_text": "Great news for Israel! For the first time in its 73-year history, Israel has broken into the list of top 20 countries with the highest GDP per capita. In fact, we’re number 19.i That means that our per capita economic strength is greater than 176 other countries in the world. Last year we were ranked 21, and a decade ago, we weren’t even in the top 30.ii But God keeps blessing, and Israel health keeps growing.\n\nWhat exactly is GDP per capita? Unlike other economic metrics, GDP per capita is as basic as it sounds. It takes Gross Domestic Product (the total of all finished goods and services produced within a nation) and divides it by a country’s population.iii Economists use this measure to determine the economic health of a nation and the direction of its financial trend. An increasing GDP per capita indicates growing health; a decreasing GDP per capita says that something is going wrong.\n\nIt is true that Israel’s economy took a hard hit in 2020 due to COVID, with a 2.5% reduction in GDP. But it still fared much better than most other nations. The United States lost 3.5% of its GDP, the 37 nations of the OECD (Organisation for Co-operation and Development) lost an average of 5.5%, and EU nations dropped 6.6% on average.iv Many believe that Israel has its incredibly strong tech sector to thank.\n\nNow that COVID seems to be dwindling, we can see the country gaining back what the epidemic took from it. All kindergartens, schools, and universities are open. Businesses are all open and hotels are packed with Israelis. To everyone’s joy, Israel will be reopened for tourism next month. There is even talk that the vaccination green pass will soon be done away with.\n\nIn Ezekiel 36 and 37, God promised the restoration of Israel and its people. He clearly states His purpose for doing this supernatural work: “Then they shall know that I am the LORD” (Ezekiel 36:38). God’s declaration of Himself is a work that He has clearly accomplished. One only needs to look at the powerful, restored nation of Israel to know that there is one God, and the LORD is His name.\n\ni Solomon, Shoshanna. “Amid COVID, Israel Enters Top 20 Club of Nations with Highest GDP per Capita.” The Times of Israel, 26 Apr. 2021, www.timesofisrael.com/amid-covid-israel-enters-top-20-club-of-nations-with-highest-gdp-per-capita/.", "opengraph": {"locale": "en_US", "type": "article", "title": "Israel Breaks Into the Top 20 - Behold Israel", "description": "Great news for Israel! For the first time in its 73-year history, Israel has broken into the list of top 20 countries with the highest […]", "url": "https://beholdisrael.org/israel-breaks-into-the-top-20/", "site_name": "Behold Israel", "article:published_time": "2021-05-01T15:00:14+00:00", "article:modified_time": "2021-04-30T19:52:05+00:00", "image": "https://beholdisrael.org/wp-content/uploads/Behold-Israel-Tag-Indicators.001-212.jpeg", "image:width": "800", "image:height": "500", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": ["Behold Israel"], "publish_date": "2021-05-01T15:00:14+00:00"}