{"result_id": "046006", "URL": "https://bestnewshere.com/uncounted-vaccine-deaths-on-our-highways-and-railways/", "timestamp": "2023-04-25 12:16:15 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://bestnewshere.com/wp-content/uploads/2022/08/bestnewsherelogo-1-2.png", "canonical": "https://bestnewshere.com/uncounted-vaccine-deaths-on-our-highways-and-railways/", "encoding": "UTF-8"}, "image": null, "domain": "bestnewshere.com", "title": "Uncounted Vaccine Deaths on Our Highways and Railways", "cleaned_text": "This website has spent considerable time reporting on vaccine-related aircraft fatalities and injuries; until now, though, a murky haze and government coverup have shrouded equally depressing statistics: the number of vaccinated motorists who either died or fell ill behind the wheel, and accidents which caused significant loss of life or property damage.\n\nThe U.S. military began investigating these figures in mid-2022, after several recently vaccinated servicemembers perished in car accidents. White Hats had tasked their compatriots at the U.S. Army Corps of Engineers and at the Womack Army Medical Hospital, Fort Bragg, with reviewing seven wrecks—in each instance the driver died and was the sole occupant in the vehicle—that occurred between January-March 2022. While the Corps of Engineers examined vehicle accident reports, medical staff at Fort Bragg sifted through the medical logs and death certificates of the deceased servicemembers.\n\nPreliminary reports revealed the following: the mean age of the drivers was 23; six were male; importantly, all took a Covid-19 vaccination within 10 days of death; none had illnesses or comorbidities that precluded their ability to enlist in the armed forces; postmortem toxicology screenings came back negative; all fatalities were attributed to “loss of vehicular control due to sudden onset myocardial infarction,” or heart attacks.\n\nIn four of the six male victims, medical examiners found “garter snake-size blood clots” in the femoral artery, as well as enlarged hearts, both known side effects of the Covid-19 vaccine.\n\nThis worrisome news caused White Hats to wonder whether the federal government was deceptively concealing vaccine-induced vehicle accidents on our nation’s highways. In October, White Hats sought U.S. Army Cyber Command’s help in penetrating a database maintained by the National Highway Traffic Safety Administration, which is overseen by Deep State operative and Secretary of Transportation Pete Buttigieg.\n\nCyber Command’s probe uncovered glaring inconsistencies: NHTSA’s computer held two disparate data sets, authored on September 15thand 19th, respectively, with each record listing both the number of accidents and fatalities from Jan-June 2022. The latter, or revised, spreadsheet was posted to NHTSA’s website and identified 20,175 fatalities—this figure includes drivers, occupants, and collateral casualties. In other words, if a driver swerved off the road and struck and killed three pedestrians, their deaths are tallied.\n\nThe unpublished spreadsheet had markedly different numbers. According to it, 39,465 accidents caused 41,970 deaths in the first half of 2022—more than twice the number disclosed to the public.\n\n“We can’t conclusively prove deceit, but it’s damn peculiar that two reports written days apart have such a big difference in figures. If someone miscounted by 10, 100, or even 1000, yeah, that might seem a reasonable reason to remake a report. It’s our opinion, and just opinion, NHTSA falsified the published data to match data before the vaccines were publicly available,” a Cyber Command source told Real Raw News.\n\nHe added that Cyber Command had neither the manpower nor capability to dig deep into 39,465 accident reports.\n\n“It looks like the transportation department is removing reports where vaccines were a contributing cause,” he said.\n\nCyber Command also scrutinized railway accidents. During the week of October 20, six trains derailed over a 36-hour period across the United States. An accident in Orneville, Maine, was particularly dangerous, with multiple cars piling up on the track. The Federal Railway Administration (FRA) said a faulty track punctured a freight car. Cyber Command, however, says it has audio of the engineer communicating with the crew seconds before the derailment. “I’m not feeling too well, I got vaccinated this morning,” the engineer said as the 76-car Canadian Pacific train listed to the left and derailed.\n\n“These vaccines are killing people in droves,” our Cyber Command source said. “It’s only going to get worse until the majority of the population wakes up and rejects them absolutely.”", "opengraph": {"image": "https://bestnewshere.com/wp-content/uploads/2022/11/B2B72BCB-D277-4279-AF2B-85CE10B909EB.jpeg", "type": "article", "description": "Here's What People Are Buying Right Now! LAST PIECE OF THE PUZZLE- YOU CAN COUNT ON PRESIDENT TRUMP THIS IS YOUR CHANCE! This website has spent considerable time reporting on vaccine-related aircraft fatalities and injuries; until now, though, a murky haze and government coverup have shrouded equally depressing statistics: the number of vaccinated motorists who […]", "locale": "en_US", "title": "Uncounted Vaccine Deaths on Our Highways and Railways - best news here", "url": "https://bestnewshere.com/uncounted-vaccine-deaths-on-our-highways-and-railways/", "site_name": "best news here", "article:published_time": "2022-11-28T22:33:49+00:00", "article:modified_time": "2022-11-28T22:34:27+00:00", "image:width": "1536", "image:height": "1083", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.reddit.com/submit?url=https%3A%2F%2Fbestnewshere.com%2Funcounted-vaccine-deaths-on-our-highways-and-railways%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fbestnewshere.com%2Funcounted-vaccine-deaths-on-our-highways-and-railways%2F&text=Uncounted%20Vaccine%20Deaths%20on%20Our%20Highways%20and%20Railways", "https://www.linkedin.com/shareArticle?mini=1&url=https%3A%2F%2Fbestnewshere.com%2Funcounted-vaccine-deaths-on-our-highways-and-railways%2F&title=Uncounted%20Vaccine%20Deaths%20on%20Our%20Highways%20and%20Railways&source=https%3A%2F%2Fbestnewshere.com", "https://www.digistore24.com/redir/491620/hp_333435/3", "https://www.reddit.com/submit?url=https%3A%2F%2Fbestnewshere.com%2Funcounted-vaccine-deaths-on-our-highways-and-railways%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fbestnewshere.com%2Funcounted-vaccine-deaths-on-our-highways-and-railways%2F&text=Uncounted%20Vaccine%20Deaths%20on%20Our%20Highways%20and%20Railways", "https://www.linkedin.com/shareArticle?mini=1&url=https%3A%2F%2Fbestnewshere.com%2Funcounted-vaccine-deaths-on-our-highways-and-railways%2F&title=Uncounted%20Vaccine%20Deaths%20on%20Our%20Highways%20and%20Railways&source=https%3A%2F%2Fbestnewshere.com"], "authors": ["BestNews Here"], "publish_date": "2022-11-28T22:33:49+00:00"}