{"result_id": "046029", "URL": "https://bestnewshere.com/white-hat-military-installations-destroy-vaccine-contaminated-blood-stockpiles/", "timestamp": "2023-04-25 12:16:31 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://bestnewshere.com/wp-content/uploads/2022/08/bestnewsherelogo-1-2.png", "canonical": "https://bestnewshere.com/white-hat-military-installations-destroy-vaccine-contaminated-blood-stockpiles/", "encoding": "UTF-8"}, "image": null, "domain": "bestnewshere.com", "title": "White Hat Military Installations DESTROY Vaccine-Contaminated Blood Stockpiles", "cleaned_text": "After the House voted 350-80 in favor of repealing Lloyd Austin’s unconstitutional Covid-19 vaccine mandate for all armed forces members, the White Hat partition of the U.S. military took it a step further by destroying blood donations taken from vaccinated servicemembers.\n\nThey say empirical evidence proves beyond all doubt that although donors might not present vaccine-related side effects, recipients of tainted plasma have had adverse reactions, including sudden death, to contaminated blood. Case in point: Staff Sgt. William Wright, a healthy 36-year-old male stationed at Fort Bliss, Texas, was wounded during a training exercise to the point of needing a transfusion. Wright was not vaccinated; he had been fighting an arduous battle to obtain a religious exemption. He was unconscious at the time, and therefore couldn’t ask whether the plasma entering his veins had been siphoned from a vaccinated person. Unbeknownst to Wright, the donor had been double-vaxxed and boosted. He seemed to recover—his vitals were normal and he was eating solid food—but remained under observation at the William Beaumont Army Medical Center-Fort Bliss, and had enough strength to ask whether he’d been given vaccinated blood. When told he had, he protested. Two days later Wright, still at the hospital, died suddenly—major heart attack. A postmortem examination found an 11” blood clot in an artery in his lungs.\n\nThe White Hat physicians’ movement claims that the criminal Biden regime has buried hundreds of similar reports that malign its precious vaccine.\n\n“When an unvaccinated patient receives vaccinated plasma, well, statistics don’t lie. What we’ve witnessed is an astronomically large number of troops present everything from mild and temporary to severe and lasting side effects, and, in some cases, death. I’m personally aware of 12 men that needed a transfusion and vehemently objected to getting vaccinated plasma. They were told they were government property and had no right to refuse it,” a physician at Womack Army Medical Center, Fort Bragg, told Real Raw News.\n\nOn Thursday, the senior leadership at Womack Army Medical Center reached a consensus to incinerate and destroy its stockpile of vaccine-contaminated blood—approximately 500 liters of refrigerated plasma and whole blood that hadn’t yet been spun in a centrifuge. News of the heroic act spread rapidly among the White Hat community, and within hours other military bases began torching polluted blood. Fort Meade, home to U.S. Cyber Command, destroyed its supply, as did Hunter Army Airfield and Fort Benning, both in Georgia. All told, 23 installations obliterated toxic blood.\n\n“It was a ripple effect, a wave,” said our source at Womack Army Medical Center. “It only took us to start it, and now it’s washing over joint bases all over the country.”\n\nRRN asked whether the blood destruction would affect service members whose lives depend on a transfusion.\n\n“We have an ace in the hole,” our source said. “Fortunately, Marines resisted the mandate from the start, and have been donating regularly. Rough estimate, 150,000 unvaccinated Marines who can donate 6 times per year. The Special Operations units also refused vaccination. That’s 43,000 men and women, give or take. We won’t have a shortage of unvaccinated blood. And we’ll get more as new enlistees, who won’t have to get vaxxed, can contribute theirs.”", "opengraph": {"image": "https://bestnewshere.com/wp-content/uploads/2022/12/whole-blood-768x320-1.jpg", "type": "article", "description": "Here's What People Are Buying Right Now! LAST PIECE OF THE PUZZLE- YOU CAN COUNT ON PRESIDENT TRUMP THIS IS YOUR CHANCE! After the House voted 350-80 in favor of repealing Lloyd Austin’s unconstitutional Covid-19 vaccine mandate for all armed forces members, the White Hat partition of the U.S. military took it a step further […]", "locale": "en_US", "title": "White Hat Military Installations DESTROY Vaccine-Contaminated Blood Stockpiles - best news here", "url": "https://bestnewshere.com/white-hat-military-installations-destroy-vaccine-contaminated-blood-stockpiles/", "site_name": "best news here", "article:published_time": "2022-12-09T22:10:49+00:00", "article:modified_time": "2022-12-10T01:10:07+00:00", "image:width": "768", "image:height": "320", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.reddit.com/submit?url=https%3A%2F%2Fbestnewshere.com%2Fwhite-hat-military-installations-destroy-vaccine-contaminated-blood-stockpiles%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fbestnewshere.com%2Fwhite-hat-military-installations-destroy-vaccine-contaminated-blood-stockpiles%2F&text=White%20Hat%20Military%20Installations%20DESTROY%20Vaccine-Contaminated%20Blood%20Stockpiles", "https://www.linkedin.com/shareArticle?mini=1&url=https%3A%2F%2Fbestnewshere.com%2Fwhite-hat-military-installations-destroy-vaccine-contaminated-blood-stockpiles%2F&title=White%20Hat%20Military%20Installations%20DESTROY%20Vaccine-Contaminated%20Blood%20Stockpiles&source=https%3A%2F%2Fbestnewshere.com", "https://www.digistore24.com/redir/491620/hp_333435/3", "https://www.reddit.com/submit?url=https%3A%2F%2Fbestnewshere.com%2Fwhite-hat-military-installations-destroy-vaccine-contaminated-blood-stockpiles%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fbestnewshere.com%2Fwhite-hat-military-installations-destroy-vaccine-contaminated-blood-stockpiles%2F&text=White%20Hat%20Military%20Installations%20DESTROY%20Vaccine-Contaminated%20Blood%20Stockpiles", "https://www.linkedin.com/shareArticle?mini=1&url=https%3A%2F%2Fbestnewshere.com%2Fwhite-hat-military-installations-destroy-vaccine-contaminated-blood-stockpiles%2F&title=White%20Hat%20Military%20Installations%20DESTROY%20Vaccine-Contaminated%20Blood%20Stockpiles&source=https%3A%2F%2Fbestnewshere.com"], "authors": ["BestNews Here"], "publish_date": "2022-12-09T22:10:49+00:00"}