{"result_id": "046019", "URL": "https://bestnewshere.com/putin-exterminates-mad-covid-19-vaccine-scientist/", "timestamp": "2023-04-25 12:16:25 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://bestnewshere.com/wp-content/uploads/2022/08/bestnewsherelogo-1-2.png", "canonical": "https://bestnewshere.com/putin-exterminates-mad-covid-19-vaccine-scientist/", "encoding": "UTF-8"}, "image": null, "domain": "bestnewshere.com", "title": "Putin Exterminates “Mad” Covid-19 Vaccine Scientist", "cleaned_text": "Russian President Vladimir Putin on Sunday ordered the execution of a vaccine scientist who tainted Covid-19 vaccines with live HIV, FSB agent Andrei Zakharov told Real Raw News. Uncoincidentally, that scientist had helped develop the CoviVac vaccine and was earning enormous royalties in perpetuity.\n\nSamuil Kiselev, 47, graduated from Moscow State University and later held prestigious positions at Fosun Pharma and Hepatera, Russian biotech companies. In mid-2019, just before the Plandemic, Kiselev transferred to the Chumakov Federal Scientific Center, which manufactured the CoviVac shot. He was instrumental in its development.\n\nVladimir Putin, Zakharov said, has a tranche of documents proving Kiselev knew in 2020 that the vaccine—then in its first trial phase—could confer HIV to vaccine recipients. Kiselev had authored papers saying he and his colleagues had attenuated live HIV to provoke an antibody and immune response powerful enough to ward off Covid without putting a person in jeopardy of contracting HIV. The HIV-enhanced vaccines were administered to 37 of 600 Phase I trial participants in August 2020, and those unfortunate souls were told to return for a blood draw 90 days following the first vaccination. The Chumakov Center never disclosed to them the presence of HIV in the shots.\n\nAlthough physical symptoms of HIV may not present for up to 10 years from infection, blood tests can detect the presence of HIV antibodies within 90 days of exposure.\n\nAccording to the documents Putin reviewed, 6 of the 37 victims tested positive for HIV on the follow-up blood test, but Chumakov Center, at Kiselev’s urging, withheld from the victims that crucial morsel of information, essentially allowing them to spread the virus to sexual partners unknowingly. The six were then told without reason to follow up again in 30 days. Unbeknownst to them, further blood tests were given to exclude false positives, but all six tested positive again.\n\n“These insane experiments should’ve stopped, but, no, these are mad scientists. Of the six people who got AIDS—one…his heart exploded in his chest. Kiselev continued his insanity in Phase II trials. As you say, if at first you don’t succeed, try, try again. Another 16 got the disease, and no one told them,” Zakharov said.\n\nAfter perusing the documents, Putin asked his medical advisory board whether Kiselev’s unauthorized experiments held any medical value. It was a rhetorical question. Putin already knew the answer, Zakharov said.\n\nThe answer seemed cut and dry: Kiselev committed treason.\n\n“It doesn’t matter why Kiselev did what he did. He did it without authority. Maybe he thought putting AIDS in Covid vaccines would help people, as his notes say, but his team—and we’ll get them too—did this underhanded. This we cannot allow,” Zakharov said.\n\nOn Sunday the FSB sent agents to Kiselev’s lavish home in Novosibirsk, where they put two bullets in his forehead.\n\n“President Putin wanted Kiselev to see it coming,” Zakharov said. “He begged for his life.”\n\nAs reported last week, Putin has instructed the military to destroy all Covid-19 vaccines in Russia, for the country’s fivefold spike of recorded HIV infections in 2022, and HIV-tainted vials turning up, has convinced him that millions of Russians could unknowingly carry the virus.\n\n“People shouldn’t be getting tested for Covid; they should be running to their doctors to get tested for the AIDS,” Zakharov said.", "opengraph": {"image": "https://bestnewshere.com/wp-content/uploads/2023/03/BB47D7B8-D689-4E9D-90E3-6A80CAA65E63.jpeg", "type": "article", "description": "Here's What People Are Buying Right Now! LAST PIECE OF THE PUZZLE- YOU CAN COUNT ON PRESIDENT TRUMP THIS IS YOUR CHANCE! Russian President Vladimir Putin on Sunday ordered the execution of a vaccine scientist who tainted Covid-19 vaccines with live HIV, FSB agent Andrei Zakharov told Real Raw News. Uncoincidentally, that scientist had helped […]", "locale": "en_US", "title": "Putin Exterminates “Mad” Covid-19 Vaccine Scientist - best news here", "url": "https://bestnewshere.com/putin-exterminates-mad-covid-19-vaccine-scientist/", "site_name": "best news here", "article:published_time": "2023-03-08T15:16:40+00:00", "article:modified_time": "2023-03-09T12:26:23+00:00", "image:width": "485", "image:height": "360", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.reddit.com/submit?url=https%3A%2F%2Fbestnewshere.com%2Fputin-exterminates-mad-covid-19-vaccine-scientist%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fbestnewshere.com%2Fputin-exterminates-mad-covid-19-vaccine-scientist%2F&text=Putin%20Exterminates%20%E2%80%9CMad%E2%80%9D%20Covid-19%20Vaccine%20Scientist", "https://www.linkedin.com/shareArticle?mini=1&url=https%3A%2F%2Fbestnewshere.com%2Fputin-exterminates-mad-covid-19-vaccine-scientist%2F&title=Putin%20Exterminates%20%E2%80%9CMad%E2%80%9D%20Covid-19%20Vaccine%20Scientist&source=https%3A%2F%2Fbestnewshere.com", "https://www.digistore24.com/redir/491620/hp_333435/3", "https://www.reddit.com/submit?url=https%3A%2F%2Fbestnewshere.com%2Fputin-exterminates-mad-covid-19-vaccine-scientist%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fbestnewshere.com%2Fputin-exterminates-mad-covid-19-vaccine-scientist%2F&text=Putin%20Exterminates%20%E2%80%9CMad%E2%80%9D%20Covid-19%20Vaccine%20Scientist", "https://www.linkedin.com/shareArticle?mini=1&url=https%3A%2F%2Fbestnewshere.com%2Fputin-exterminates-mad-covid-19-vaccine-scientist%2F&title=Putin%20Exterminates%20%E2%80%9CMad%E2%80%9D%20Covid-19%20Vaccine%20Scientist&source=https%3A%2F%2Fbestnewshere.com"], "authors": ["BestNews Here"], "publish_date": "2023-03-08T15:16:40+00:00"}