{"result_id": "046015", "URL": "https://bestnewshere.com/cdc-pushes-for-hybrid-covidpox-vaccine/", "timestamp": "2023-04-25 12:16:22 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://bestnewshere.com/wp-content/uploads/2022/08/bestnewsherelogo-1-2.png", "canonical": "https://bestnewshere.com/cdc-pushes-for-hybrid-covidpox-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "bestnewshere.com", "title": "CDC Pushes for Hybrid “CovidPox” Vaccine", "cleaned_text": "The mainstream media’s vitriol of President Donald J. Trump has of late supplanted its second favorite topic, trying to scare shitless the people who still believe Covid-19 is a threat to the nation. But absence of media coverage hasn’t stopped the CDC’s vile director, Rochelle Walensky, from pushing forth a new agenda that could sicken or kill even more millions of gullible Americans—she has advocated for the creation of a “CovidPox” vaccine, a hybrid drug that, she says, will inoculate citizens against both emerging strains of Covid and Monkeypox.\n\nCDC whistleblowers have told Real Raw News that Walensky, ostensibly at the request of HHS Secretary Xavier Becerra, has in recent days held talks with Pfizer and Danish pharmaceutical manufacturer Bavarian Nordic A/S. She had asked them whether they could jointly research the viability of an amalgamized vaccine because “Americans aren’t smart. They like fewer rather than more vaccines.”\n\nAt the time of this writing, Bavarian Nordic is the only company with an FDA approved Monkeypox vaccine, which is a modified version of the smallpox vaccine developed in 1796. Between 1963-1968, millions of American children were vaccinated against smallpox, and in 1980 the sinister WHO declared that the disease had been eradicated from the world. Record keeping of that era was rudimentary at best, and many credible scientists have argued that the smallpox vaccine killed tens of thousands of kids in the United States alone. Believing the disease a remnant of the past, the WHO in 1981 encouraged manufacturers to declare a moratorium on further research.\n\nThat is until recently. Bavarian Nordic is redesigning the Monkeypox shot to mimic pharmacological actions of Pfizer and Moderna’s clot shots. In other words, once completed and approved, it will flood the human body with mRNA spike proteins.\n\nWhen Walensky learned of Bavarian Nordic’s initiative, she eagerly made a proposal.\n\n“Rochelle was positively giddy with excitement,” a CDC source said. “It struck her that Americans would be more receptive to a hybrid vaccine as opposed to getting individual Monkeypox and Covid shots and boosters. She’s upset only 30% of adults are getting regular Covid boosters. She argues that Monkeypox has transcended being a gay disease—that it now threatens everyone. She thinks Americans will line up in droves to get a shot that protects against both.”\n\nSources privy to Walensky’s conversations with Pfizer Vice President and Chief Scientific Officer Seng H. Chang told RRN that Pfizer adamantly rejected the idea of collaborating with another pharmaceutical company, citing ethical and monetary concerns. Chang told Walensky that Pfizer was on the verge of completing its own Monkeypox vaccine and would be starting clinical trials within 90 days. With time and funding, Chang said, Pfizer could produce a hybrid mRNA vaccine inhouse, without the competitive bickering that happens often when two or more companies are forced to team up. He cited Pfizer’s “Covid successes” as proof that Pfizer stood ready to combat “the Monkeypox epidemic.”\n\nBavarian Nordic CEO Paul Chaplin, who has proclaimed mRNA vaccines “the future of modern medicine,” was positively ecstatic at Walensky’s proposal. He said he would be honored to work alongside a large, more prominent manufacturer to end the “Covid-19 and Monkeypox threat to civilization.” Over several telephone calls, Chaplin assured Walensky that his smaller and fiscally diminutive company would devote the entirety of its resources towards making the hybrid vaccine a reality, adding that Bavarian Nordic’s mRNA recombinant Monkeypox shot was scheduled to begin Phase I clinical trials in September.\n\nIf Pfizer stands firm in its refusal, the CDC can still approach Moderna, a French pharmaceutical conglomerate that has a history of partnerships with both domestic and foreign competitors. Real Raw News’ CDC sources could neither confirm nor deny whether Walensky had already spoken to Moderna CEO Stephen Bancel.\n\nPfizer and Moderna’s mRNA clot shots have killed more people than they have protected from a non-existent disease. The vaccines and boosters have sickened, maimed, or killed hundreds of thousands of citizens, and the elderly have taken the heaviest toll. The so-called vaccines have caused countless spontaneous heart attacks, sudden respiratory collapse, and permanent paralysis. The long-term effect of getting multiple shots and boosters is still hypothetical, but doesn’t look good for those who can’t wait to get the next dose. Until last week, the CDC’s website claimed that spike proteins stayed in the body for a brief time, maybe weeks. It has now removed that disclaimer. If one mRNA shot is obliterating the lives of millions, imagine what an immediate double dose might do.\n\n“Both Covid-19 and Monkeypox are fraud illnesses, and the vaccines tailored to make people sick or die and make Big Pharma rich. Do you think the Big Pharma reps and their friends and families are getting vaxxed? Hell no. Even Rochelle Walensky hasn’t been Covid vaxxed. All she got was a saline solution,” our source said.", "opengraph": {"image": "https://bestnewshere.com/wp-content/uploads/2022/08/B0104FE3-B83D-4E3D-A14E-C4CEAE670320.webp", "type": "article", "description": "Here's What People Are Buying Right Now! LAST PIECE OF THE PUZZLE- YOU CAN COUNT ON PRESIDENT TRUMP THIS IS YOUR CHANCE! The mainstream media’s vitriol of President Donald J. Trump has of late supplanted its second favorite topic, trying to scare shitless the people who still believe Covid-19 is a threat to the nation. […]", "locale": "en_US", "title": "CDC Pushes for Hybrid “CovidPox” Vaccine  - best news here", "url": "https://bestnewshere.com/cdc-pushes-for-hybrid-covidpox-vaccine/", "site_name": "best news here", "article:published_time": "2022-08-20T16:02:45+00:00", "article:modified_time": "2022-08-20T17:21:42+00:00", "image:width": "789", "image:height": "460", "image:type": "image/webp"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.reddit.com/submit?url=https%3A%2F%2Fbestnewshere.com%2Fcdc-pushes-for-hybrid-covidpox-vaccine%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fbestnewshere.com%2Fcdc-pushes-for-hybrid-covidpox-vaccine%2F&text=CDC%20Pushes%20for%20Hybrid%20%E2%80%9CCovidPox%E2%80%9D%20Vaccine%C2%A0", "https://www.linkedin.com/shareArticle?mini=1&url=https%3A%2F%2Fbestnewshere.com%2Fcdc-pushes-for-hybrid-covidpox-vaccine%2F&title=CDC%20Pushes%20for%20Hybrid%20%E2%80%9CCovidPox%E2%80%9D%20Vaccine%C2%A0&source=https%3A%2F%2Fbestnewshere.com", "https://www.digistore24.com/redir/491620/hp_333435/3", "https://www.reddit.com/submit?url=https%3A%2F%2Fbestnewshere.com%2Fcdc-pushes-for-hybrid-covidpox-vaccine%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fbestnewshere.com%2Fcdc-pushes-for-hybrid-covidpox-vaccine%2F&text=CDC%20Pushes%20for%20Hybrid%20%E2%80%9CCovidPox%E2%80%9D%20Vaccine%C2%A0", "https://www.linkedin.com/shareArticle?mini=1&url=https%3A%2F%2Fbestnewshere.com%2Fcdc-pushes-for-hybrid-covidpox-vaccine%2F&title=CDC%20Pushes%20for%20Hybrid%20%E2%80%9CCovidPox%E2%80%9D%20Vaccine%C2%A0&source=https%3A%2F%2Fbestnewshere.com"], "authors": ["BestNews Here"], "publish_date": "2022-08-20T16:02:45+00:00"}