{"result_id": "046003", "URL": "https://bestnewshere.com/jag-sentences-janssen-vaccine-scientist-to-death/", "timestamp": "2023-04-25 14:33:36 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://bestnewshere.com/wp-content/uploads/2022/08/bestnewsherelogo-1-2.png", "canonical": "https://bestnewshere.com/jag-sentences-janssen-vaccine-scientist-to-death/", "encoding": "UTF-8"}, "image": null, "domain": "bestnewshere.com", "title": "JAG Sentences Janssen Vaccine Scientist to Death", "cleaned_text": "The United States Navy Judge Advocate General’s Corps on Friday convicted and sentenced to death Janssen Pharmaceuticals scientist Richard Tillyer, who stood accused of maintaining a confidential company database detailing how Janssen prevented trial participants whom the vaccine had sickened from seeing their personal physicians. Instead, Janssen’s compulsory NDA mandated—through coercion and litigation threats–that the sick use hospitals and clinics where the pharmaceutical company had a presence, even if the ill had private or employer-sponsored health insurance.\n\nFlanked by a pair of muscular Marines, Tillyer on Friday hobbled into court, his puffy, spectacled eyes blinking rapidly. His gnarled hands quivered. A mat of brittle grey hair was combed neatly to one side of his head. He seemed far older than his 57 years, a fact that didn’t escape Vice Adm. Darse E. Crandall’s attention.\n\n“Evil ages a man,” the admiral noted. “Just look at Obama; his hair turned grey overnight.”\n\nNo sooner had Tillyer taken a seat at the defense table than he raised his hand as a schoolkid would to answer a question in class.\n\n“Could someone please tell me where I am?” Tillyer said slowly, flatly.\n\nHis apparent bewilderment evoked a chortle of laughter from the 3-officer panel JAG had chosen to weigh the merits of its case. Admiral Crandall, though, saw no humor in Tillyer’s statement.\n\n“You are at Guantanamo Bay, detainee Richard Tillyer, where you stand accused of accessory to mass murder, treason, conspiracy against the United States, conspiracy to conceal a crime, and mass medical malpractice and negligence,” Admiral Crandall said, reading from a list of charges.\n\n“How I got here. Why I’m here,” Tillyer said.\n\nAdmiral Crandall stepped toward the defense table, leering at Tillyer. “This isn’t amusing. You knew damn well where you were two days ago when medical looked you over. Do you remember that?”\n\nTillyer was silent momentarily, then said, “I don’t recall.”\n\nAdmiral Crandall approached the panel, saying that Tillyer’s convenient amnesia was a theatrical Deep State trope to avoid a trip to the gallows. At the time of his arrest, Tillyer admitted to concealing vaccine fatalities in the name of corporate secrecy. He later told JAG investigators he took pride in his work and would “do it again and again and again, five times over,” and quoted a line spoken by the fictional Captain Spock in Star Trek: The Wrath of Khan: “The needs of the many outweigh the needs of the few, or the one.”\n\n“Did you say that if vaccines kill a billion to save six billion, it’s worth it?” the admiral asked.\n\n“I don’t recollect,” Tillyer said, as Admiral Crandall played audio of him speaking those exact words during a February 20 deposition.\n\nThe panel decided Tillyer was “faking it,” calling his theatrics fatuous and ridiculous, and said Tillyer’s contrived forgetfulness evidenced his guilt. They unanimously found Tillyer guilty on all charges and recommended that he get the maximum allowable punishment—death—for his role in concealing Covid crimes.\n\nAs the panel spoke, Tillyer seemed flummoxed. “Where am I?” he asked again.\n\nAdmiral Crandall accepted the panel’s verdict and judgment and decreed that Tillyer should hang for his crimes. Tillyer was either an Oscar-worthy actor or honestly didn’t grasp the gravity of the decision, asking the tribunal whether he was “going home.”\n\n“Yes, you are going home, in a different sense of the word,” Admiral Crandall said, and scheduled Tillyer’s execution for Tuesday, March 7.", "opengraph": {"image": "https://bestnewshere.com/wp-content/uploads/2023/03/8F52D94D-6369-4BA5-9435-958BB377EA2B.jpeg", "type": "article", "description": "Here's What People Are Buying Right Now! LAST PIECE OF THE PUZZLE- YOU CAN COUNT ON PRESIDENT TRUMP THIS IS YOUR CHANCE! The United States Navy Judge Advocate General’s Corps on Friday convicted and sentenced to death Janssen Pharmaceuticals scientist Richard Tillyer, who stood accused of maintaining a confidential company database detailing how Janssen prevented trial […]", "locale": "en_US", "title": "JAG Sentences Janssen Vaccine Scientist to Death - best news here", "url": "https://bestnewshere.com/jag-sentences-janssen-vaccine-scientist-to-death/", "site_name": "best news here", "article:published_time": "2023-03-09T20:25:30+00:00", "article:modified_time": "2023-03-09T22:06:00+00:00", "image:width": "1280", "image:height": "720", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.reddit.com/submit?url=https%3A%2F%2Fbestnewshere.com%2Fjag-sentences-janssen-vaccine-scientist-to-death%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fbestnewshere.com%2Fjag-sentences-janssen-vaccine-scientist-to-death%2F&text=JAG%20Sentences%20Janssen%20Vaccine%20Scientist%20to%20Death", "https://www.linkedin.com/shareArticle?mini=1&url=https%3A%2F%2Fbestnewshere.com%2Fjag-sentences-janssen-vaccine-scientist-to-death%2F&title=JAG%20Sentences%20Janssen%20Vaccine%20Scientist%20to%20Death&source=https%3A%2F%2Fbestnewshere.com", "https://www.digistore24.com/redir/491620/hp_333435/3", "https://www.reddit.com/submit?url=https%3A%2F%2Fbestnewshere.com%2Fjag-sentences-janssen-vaccine-scientist-to-death%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fbestnewshere.com%2Fjag-sentences-janssen-vaccine-scientist-to-death%2F&text=JAG%20Sentences%20Janssen%20Vaccine%20Scientist%20to%20Death", "https://www.linkedin.com/shareArticle?mini=1&url=https%3A%2F%2Fbestnewshere.com%2Fjag-sentences-janssen-vaccine-scientist-to-death%2F&title=JAG%20Sentences%20Janssen%20Vaccine%20Scientist%20to%20Death&source=https%3A%2F%2Fbestnewshere.com"], "authors": ["BestNews Here"], "publish_date": "2023-03-09T20:25:30+00:00"}