{"result_id": "047020", "URL": "https://biggovernment.news/2023-01-26-unvaccinated-pilots-suing-united-airlines-firing-discriminating.html", "timestamp": "2023-04-25 12:17:30 CEST+0200", "meta": {"description": "A former longtime pilot at United Airlines who is unvaccinated for Wuhan coronavirus (COVID-19) – and wants to stay that way – has joined 30 other unvaccinated pilots, flight attendants, ramp service workers, and other personnel in suing the company for discriminating against them based on their pureblood status. On January 19, Tom Floyd, who […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,conspiracy,corruption,COVID,freedom,Genetic Information Non-Disclosure Act,health freedom,lawsuit,Liberty,medical fascism,Medical Tyranny,pandemic,pilots,Resist,revolt,Scott Kirby,Tom Floyd,United Airlines,uprising,vaccine,vaccine mandate,vaccine wars", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://biggovernment.news/2023-01-26-unvaccinated-pilots-suing-united-airlines-firing-discriminating.html", "encoding": "UTF-8"}, "image": null, "domain": "biggovernment.news", "title": "Unvaccinated pilots suing United Airlines for firing or otherwise discriminating against them for having pure blood", "cleaned_text": "Unvaccinated pilots suing United Airlines for firing or otherwise discriminating against them for having pure blood\n\nA former longtime pilot at United Airlines who is unvaccinated for Wuhan coronavirus (COVID-19) – and wants to stay that way – has joined 30 other unvaccinated pilots, flight attendants, ramp service workers, and other personnel in suing the company for discriminating against them based on their pureblood status.\n\nOn January 19, Tom Floyd, who now works for a private jet firm after getting canned at United, along with the others, filed a complaint stating that they were “fired, placed on unpaid leave, or otherwise had their careers at United limited or terminated without just compensation.”\n\n“This is an action for legal and equitable relief to redress Defendants’ invasions of privacy, negligence, failure to accommodate, religious discrimination, creation of a hostile work environment, violations of the Genetic Information Non-Disclosure Act (GINA) and otherwise wrongful conduct that was perpetrated, encouraged, and condoned by Defendants,” the complaint further states.\n\n“Such wrongful conduct was predicated on Defendants’ unlawful discrimination, harassment, and retaliation against Plaintiffs based on their requests for religious accommodations from Defendants’ coronavirus vaccine mandate.” (Related: After firing all of its unvaccinated pilots, JetBlue replaced at least one of them with a violent felon.)\n\nUnited Airlines issued COVID jab mandate after U.S. Treasury agreed to loan the company $7.5 billion\n\nPrincipal attorney John Pierce, who also defended victims of the Jan. 6, 2021, “insurrection” psy-op, told the independent media that Floyd is among the key leaders of the group suing United. It first began in April 2021 when United issued a “strong recommendation” to its personnel that they take the jabs.\n\nOne month later in May, United reached an agreement with its pilot union to not mandate the jabs, which seemed like a victory until United then started trying to incentivize its workers into getting jabbed by offering three vacation days, or the equivalent of 10 hours’ pay, to comply.\n\nThe company’s policies then changed not long after that to require that all new hires show proof of injection in order to gain employment. Then in August, a company-wide jab mandate was issued – the first one for the airline industry.\n\nUnited did allow employees to apply for a religious exemption, but Floyd said many, if not most, who did this were denied. The company was hostile, demanding letters from their churches to prove that they really have a religious objection to getting injected.\n\nFloyd, a devout Christian, was denied his exemption based on these grounds. Around that time, United CEO Scott Kirby “sarcastically described employees such as Plaintiffs as ‘all of a sudden deciding ‘I’m really religious,'” the suit states.\n\nIt turns out that United more than likely imposed these militant policies on its employees because of a loan agreement with the Department of the Treasury, which agreed to let the company borrow $7.491 billion – just so long as it complied with “certain restrictions on employee compensation, stock repurchases, dividends and reductions in employment levels, as required by the CARES Act.”\n\n“Treasury will receive warrants to purchase common stock equal to 10 percent of the total loan amount drawn,” reads a transaction summary from the Treasury Department about this agreement.\n\nPut simply, the United States government bought into United and thus imposed its own agenda on the company. As usual, it is always about the money, the love of which is the root of all evil.\n\n“I will never fly on United again!” one commenter wrote in response to all these revelations. “They have the moral and ethical backbone of a jellyfish. Such are never to be trusted.”\n\nInterested in learning more about the dangers and ineffectiveness of COVID injections? You can do so at ChemicalViolence.com.", "opengraph": {"title": "Unvaccinated pilots suing United Airlines for firing or otherwise discriminating against them for having pure blood", "type": "article", "url": "https://www.biggovernment.news/2023-01-26-unvaccinated-pilots-suing-united-airlines-firing-discriminating.html", "site_name": "Big Government", "description": "A former longtime pilot at United Airlines who is unvaccinated for Wuhan coronavirus (COVID-19) – and wants to stay that way – has joined 30 other unvaccinated pilots, flight attendants, ramp service workers, and other personnel in suing the company for discriminating against them based on their pureblood status. On January 19, Tom Floyd, who […]", "image": "https://www.biggovernment.news/wp-content/uploads/sites/59/2023/01/Airplane-Pilot-Captain-Uniform.jpg"}, "tags": ["revolt", "lawsuit", "vaccine", "pilots", "uprising", "big government", "medical fascism", "health freedom", "vaccine mandate", "vaccine wars", "Liberty", "Scott Kirby", "Tom Floyd", "Genetic Information Non-Disclosure Act", "freedom", "corruption", "Resist", "pandemic", "conspiracy", "Medical Tyranny", "United Airlines", "COVID"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/mkt_app/friendly-skies-interview-with-an-unvaccinated-pilot-suing-united-airlines_5000572.html", "https://naturalnews.com/2022-11-30-jetblue-hires-violent-felon-discriminates-unvaccinated-pilots.html", "http://medicaltyranny.com", "http://chemicalviolence.com", "https://www.theepochtimes.com/mkt_app/friendly-skies-interview-with-an-unvaccinated-pilot-suing-united-airlines_5000572.html", "https://naturalnews.com/2022-11-30-jetblue-hires-violent-felon-discriminates-unvaccinated-pilots.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fbiggovernment%2F2023-01-26-unvaccinated-pilots-suing-united-airlines-firing-discriminating.html&linkname=Unvaccinated%20pilots%20suing%20United%20Airlines%20for%20firing%20or%20otherwise%20discriminating%20against%20them%20for%20having%20pure%20blood", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}