{"result_id": "047002", "URL": "https://biggovernment.news/2022-05-05-airman-fighting-dismissal-for-refusing-covid-vaccine.html", "timestamp": "2023-04-25 12:17:19 CEST+0200", "meta": {"description": "A member of the U.S. Air Force is fighting his possible dismissal from the service for refusing to get injected with the Wuhan coronavirus (COVID-19) vaccine. Air Force Master Sergeant Robert Bierman first applied for an exemption to the military’s COVID-19 vaccine mandate on religious grounds in October 2021. He argued that taking the shot […]", "lang": "en", "keywords": "air force,badhealth,badmedicine,big government,Big Pharma,Comirnaty,covid-19,EUA,exemptions,FDA,health freedom,lawsuit,medical fascism,Medical Tyranny,military,pandemic,pharmaceutical fraud,Resist,Robert Bierman,vaccine mandates,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://biggovernment.news/2022-05-05-airman-fighting-dismissal-for-refusing-covid-vaccine.html", "encoding": "UTF-8"}, "image": null, "domain": "biggovernment.news", "title": "Airman fighting possible DISMISSAL for refusing to get the COVID clot shot", "cleaned_text": "Airman fighting possible DISMISSAL for refusing to get the COVID clot shot\n\nA member of the U.S. Air Force is fighting his possible dismissal from the service for refusing to get injected with the Wuhan coronavirus (COVID-19) vaccine.\n\nAir Force Master Sergeant Robert Bierman first applied for an exemption to the military’s COVID-19 vaccine mandate on religious grounds in October 2021. He argued that taking the shot would violate his “sincerely held beliefs [regarding] the sanctity of human life and self-harm to the bodily temple of God.” This request for religious exemption was denied, and so was an appeal of the decision he lodged in February the following year.\n\nHe later applied for a medical exemption to the vaccine mandate in January, this time citing natural immunity from a previous bout of COVID-19 and contraindications in his medical history. This was again denied by military authorities. On April 11, Bierman was given five calendar days to either “begin his COVID-19 and influenza vaccination regimen” or “submit a request to separate or retire” from the Air Force.\n\nThe master sergeant got injected with the influenza vaccine three days later on April 14. He inquired to the allergy and immunization clinic at the Scott Air Force Base in Illinois whether the Comirnaty vaccine from BioNTech and Spikevax from Moderna was available – but was informed that both were unavailable. Both Comirnaty and Spikevax received full approval from the Food and Drug Administration (FDA), while the Pfizer BNT162b2 shot was only approved under an emergency use authorization (EUA).\n\nBierman then asked if Comirnaty was similar to the available BNT162b2 and was told that they “are the same product,” even though one was fully approved and the other under an EUA. He cited a memo from Defense Secretary Lloyd Austin stating that “mandatory vaccination against COVID-19 will only use vaccines that receive full licensure from the FDA.” He also cited a December 2021 ruling by U.S. District Court Judge Allen Winsor pointing out that “the FDA nowhere claims that [the] EUA vaccine had been licensed as ‘interchangeable’ with Comirnaty.”\n\nThe fiasco surrounding BNT162b2 and Comirnaty bolstered Bierman’s continued refusal to get the COVID-19 vaccine. He has already received his first letter of reprimand, which he plans to answer through several letters from his Air Force colleagues attesting to his character. He has also submitted an informal complaint under Article 138 of the Uniform Code of Military Justice (UCMJ), alongside a request for a congressional inquiry on his predicament.\n\n“I have devoted my entire life to the faithful execution of my sworn oath of enlistment: to support and defend the Constitution and fulfill the orders given me, according to the UCMJ. I have not ceased from my aim to exemplify our Air Force core values and promote good order and discipline,” said Bierman. “Forcing me to receive an [EUA-approved] product, contrary to federal laws, would constitute an unlawful order.”\n\nThe airman is not the only service member pushing back against the military’s COVID-19 vaccine mandates. Back in August 2021, two staff sergeants sued three government agencies for making vaccination against COVID-19 compulsory – even for those with natural immunity. (Related: US soldiers sue federal agencies over military’s COVID-19 vaccine requirements.)\n\nThe plaintiffs, U.S. Army Staff Sergeant Daniel Robert and U.S. Marine Corps Staff Sergeant Holli Mulvihill, filed the class-action lawsuit on Aug. 17 at the U.S. District Court for the District of Colorado. It named the FDA, Department of Defense and the Department of Health and Human Services as defendants.\n\nRobert and Mulvihill argued in their lawsuit that Austin “ignored the [Pentagon’s] own regulations and created an entirely new definition of ‘full immunity’ as being achievable only by vaccination. Similar to Bierman, both plaintiffs in the August 2021 lawsuit cited natural immunity following a bout of COVID-19 for refusing to get the vaccine.\n\nHealthFreedom.news has more stories about military service members fighting against COVID-19 vaccine mandates.\n\nWatch attorney and Brighteon.TV host Tom Renz testifying about the dangers of injecting military members with the COVID-19 vaccine below.\n\nThis video is from the In Search Of Truth channel on Brighteon.com.\n\nBiden’s Pentagon taking massive risk by ordering ALL military personnel to get experimental COVID-19 vaccine.\n\nPentagon faces class-action lawsuit over vaccine mandates on military, federal employees and contractors.\n\nHouse Republicans calling for ban on using taxpayer funds for implementing military vaccine mandate.\n\nOur nation’s security is at risk due to Biden’s illegal military vaccine mandate, experts warn.", "opengraph": {"title": "Airman fighting possible DISMISSAL for refusing to get the COVID clot shot", "type": "article", "url": "https://www.biggovernment.news/2022-05-05-airman-fighting-dismissal-for-refusing-covid-vaccine.html", "site_name": "Big Government", "description": "A member of the U.S. Air Force is fighting his possible dismissal from the service for refusing to get injected with the Wuhan coronavirus (COVID-19) vaccine. Air Force Master Sergeant Robert Bierman first applied for an exemption to the military’s COVID-19 vaccine mandate on religious grounds in October 2021. He argued that taking the shot […]", "image": "https://www.biggovernment.news/wp-content/uploads/sites/59/2022/05/Military-Soldier-American-Flag-1.jpg"}, "tags": ["Big Pharma", "lawsuit", "covid-19", "vaccines", "big government", "military", "vaccine mandates", "Comirnaty", "medical fascism", "air force", "health freedom", "FDA", "vaccine wars", "EUA", "pharmaceutical fraud", "Resist", "pandemic", "Robert Bierman", "Medical Tyranny", "exemptions"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/news/air-force-master-sergeant-fights-for-right-to-refuse-covid-jab-expose-vaccine-bait-switch/", "http://medicaltyranny.com", "https://uncoverdc.com/2021/09/07/staff-sergeants-file-class-action-suit-against-covid-mandate/", "https://naturalnews.com/2021-09-09-sergeants-sue-federal-agencies-over-vaccine-requirements.html", "https://healthfreedom.news/", "https://www.brighteon.tv/", "https://www.brighteon.com/94ece6cd-828e-4a2b-92ec-e321f46b2ede", "https://www.brighteon.com/channels/insearchotruth", "https://joebiden.news/2021-08-11-bidens-pentagon-massive-risk-ordering-all-military-personnel-experimental-covid19-vaccine.html", "https://vaccinewars.com/2021-10-21-pentagon-faces-class-action-lawsuit-vaccine-mandates.html", "https://biggovernment.news/2022-02-04-republicans-ban-taxpayer-military-vaccine-mandate.html", "https://nationalsecurity.news/2022-01-26-nations-security-risk-military-vaccine-mandate.html", "https://healthfreedom.news/2021-11-15-7-lawsuits-challenging-covid-vaccine-mandates-military.html", "https://www.lifesitenews.com/news/air-force-master-sergeant-fights-for-right-to-refuse-covid-jab-expose-vaccine-bait-switch/", "https://uncoverdc.com/2021/09/07/staff-sergeants-file-class-action-suit-against-covid-mandate/", "https://www.brighteon.com/94ece6cd-828e-4a2b-92ec-e321f46b2ede", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fbiggovernment%2F2022-05-05-airman-fighting-dismissal-for-refusing-covid-vaccine.html&linkname=Airman%20fighting%20possible%20DISMISSAL%20for%20refusing%20to%20get%20the%20COVID%20clot%20shot", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}