{"result_id": "047027", "URL": "https://biggovernment.news/2022-03-03-schwab-gates-trudeau-are-threat-to-freedom.html", "timestamp": "2023-04-25 12:17:35 CEST+0200", "meta": {"description": "After two long years of unbridled media-induced hysteria, the pandemic narrative finally began losing steam, only to be replaced by the latest bogeyman in globalists’ crosshairs – Putin and his Ukraine war. (Article by Dragan Filipovic republished from DailyExpose.uk) Shortly before, even Bill Gates was forced to admit that the battle against Covid had definitely […]", "lang": "en", "keywords": "big government,bill gates,chaos,conspiracy,corruption,COVID,deception,false-flag,freedom,globalists,Justin Trudeau,Klaus Schwab,Liberty,pandemic,slavery,Tyranny,Ukraine,Vladimir Putin,World War III", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://biggovernment.news/2022-03-03-schwab-gates-trudeau-are-threat-to-freedom.html", "encoding": "UTF-8"}, "image": null, "domain": "biggovernment.news", "title": "COVID and Putin are not a threat to your freedom; people like Schwab, Gates & Trudeau are", "cleaned_text": "COVID and Putin are not a threat to your freedom; people like Schwab, Gates & Trudeau are\n\nAfter two long years of unbridled media-induced hysteria, the pandemic narrative finally began losing steam, only to be replaced by the latest bogeyman in globalists’ crosshairs – Putin and his Ukraine war.\n\nShortly before, even Bill Gates was forced to admit that the battle against Covid had definitely been lost – as far as the pharma industry was concerned; however, the war against future pandemics continues unabated.\n\nAt the Munich Security Conference he revealed that “Sadly, the virus itself – particularly the variant called Omicron – is a type of vaccine. That is, it creates both B-cell and T-cell immunity, and it’s done a better job of getting out to the world population than we have with vaccines,” he stated.\n\nHis belated confession is what everyone with a (half functioning) brain knew from the outset: that vaccines are absolutely powerless against rapidly-mutating coronaviruses, and that nothing beats natural immunity, as confirmed by an Israeli study last year.\n\nHowever, Gates is nothing if not persistent, immediately “predicting” a new pandemic – and an even deadlier pathogen, thus confirming that he and his cohorts will be keeping busy with their comprehensive plans for our collective well-being and will not be abandoning their agenda to compassionately rule over our collapsing planet.\n\nThat the leaky SS Corona is quickly sinking had already been confirmed by Stéphane Bancel, CEO of Moderna Therapeutics, the second largest manufacturer of mRNA vaccines, who recently sold company shares worth some $300 million and quickly deleted his Twitter account. Other directors followed suit and sold their Moderna stocks whose value has fallen 72% since August of last year.\n\nPrior to that, and below media radar, news seeped out of India that the country’s authorities had denied Pfizer’s request for approval of their Covid-19 vaccine, signifying that their Covid serum is absent form the two biggest world markets, India and China – as well as Russia. The drug regulator stated on its website that it was unable to recommend the vaccine due to the numerous side effects reported abroad as well as Pfizer’s refusal to generate safety and immunogenicity data in domestic Indian studies.\n\nOne of these side effects is myocarditis as confirmed in a study published by the Journal of the American Medical Association (JAMA) and disclosed by the Israel National News under the headline “New study: 133x risk of myocarditis after COVID vaccination.”\n\nMinistry of Health of Israel – the pioneer in administering Pfizer’s experimental vaccine – had on February 9th issued the results of a survey recording adverse effects in those who received the third shot, which had revealed that two-thirds of them reported health problems; that report was quickly removed from the ministry’s website.\n\nIndian authorities presumably noted the fact that Africa, where only 6% of the population is vaccinated, counted the fewest infections and had practically eradicated the virus. Also, the Indian state of Uttar Pradesh, with 230 million inhabitants, has successfully treated Covid patients using Ivermectin, a drug that costs less than $2 dollars for a five-day treatment, while developed countries rely heavily on Remdesivir which has been shown to be a largely ineffective and toxic drug whose five-day treatment costs over $3,000.\n\nWhile Bill Gates and his cohorts are busy preparing their new, deadlier pathogen, public attention has been diverted to the events in Ukraine and the long-planned war involving Russia. The media line is that the Russian bear had awoken from its slumber and suddenly decided that now was the perfect time to chop off another chunk of Ukrainian soil.\n\nHowever, that fairy tale doesn’t hold an ounce of water as Russia was in a perfect position to capture eastern Ukraine with little or no resistance when it reclaimed the Crimean peninsula in 2014 without a shot being fired. The Ukrainian militarily was much weaker back then and their two attempts to forcibly reclaim runaway Donetsk and Lugansk republics ended in miserable failure.\n\nIt has certainly not been lost on Russia that NATO has since supplied Ukraine with military equipment and training valued at 3 billion dollars so that a war now will end up being exponentially costlier than eight years ago. Russia had in 2014 turned down the recognition of the two republics, but it could no longer ignore the constant shelling of the mostly Russian civilian population, with almost 14,000 lives lost since the secession.\n\nIt was also left with no alternative after US and NATO categorically refused Russia’s security demands and exclude the possibility of a future Ukrainian accession to that organization, thereby forcing Putin’s hand and his recognition of the two republics on February 21st when he stated:\n\n“Western organizations show direct influence on practically all spheres of life in Ukraine. There is no independent statehood in Ukraine – everything depends on what Westerners say. Western organisations get so involved in Ukraine to struggle against corruption, but nothing has been flourishing in Ukraine, but corruption lately, he said.\n\nForeign advisors are in charge of Ukrainian intelligence services. The USA and NATO have proceeded to openly develop the territory of Ukraine as a theatre of military actions.\n\nNATO plans to conduct a number of major military exercises with Ukraine as a cover to build up its military forces in the country.\n\nNATO has established a command centre in the city of Ochakov to be able to target and destroy Russia’s Black Fleet. The USA and NATO had similar plans for the Crimea, but the people of the Crimea disrupted those plans.\n\nNATO has come too close to Russia’s borders, and the appearance of military infrastructure in Ukraine is a question that has already been decided. NATO wants to come to Ukraine to be able to strike Russia hard and all of a sudden. Ukraine will be used as a platform for this attack against Russia. From Ukraine, NATO will be able to control all of Russia’s territory to Urals. Tomahawk missiles will be able to fly to Moscow in 35 minutes, whereas NATO’s ICBMs will be able to reach Moscow in 5 minutes.“\n\nNATO has for years unabashedly worked on setting the Ukraine trap for the Russian bear, but the media inevitably downplayed these obvious machinations, disparaging Russia’s alarm about the nefarious activities on its borders.\n\nThe scenario eerily parallels the subterfuge preceding WWI, with the exception that the World Powers are now armed with nuclear weapons, this being the reason why Russia desperately tried to find a way out. It eventually became clear even to prudent Putin that, if Ukraine and her mentors had sought peace, they would have long ago implemented the 2015 Minsk II agreement; that treaty was approved by the UN Security Council, making it mandatory for all the signatories – including the UK and the US – to abide by its conditions, but they instead supported Kiev’s intransigence and insistence for a centralized nationalist state, rejecting the promised autonomy for Donetsk and Lugansk.\n\nIn any case, it is not Russia which occupied Ukraine first, as that distinction goes to the US, which had spent $5 billion organizing the violent Maidan revolution and the overthrow of a democratically elected president at a time when Russia was preoccupied preparing the winter Olympic Games in Sochi in February 2014.\n\nSevere Russian sanctions forced Germany to halt the Nordstream 2 pipeline certification, despite the fact that this gas will be of vital importance to its economy due to the imminent closure of the remaining German nuclear power plants. If a nuclear exchange can be avoided, the only country benefiting from this war is the US which will tighten its grip on Europe, and NATO which has for three decades been searching for a raison d’être.\n\nIn an interview with film director Oliver Stone, president Putin disclosed how back in 2000 he was rebuffed by Bill Clinton when he proposed that Russia enter NATO. The West always needs an enemy – in the absence of a real threat, an artificial one will do, and their goal now is to financially weaken, isolate and destabilize Russia and create maximum domestic discontent within the population and resistance to Putin by the oligarchs, eventually returning Russia to the nineties when Yeltsin surrendered the country at the mercy of the Western capitalist vultures.\n\nFor good measure, Klaus Schwab of World Economic Forum (WEF) fame, had previously announced that the world shall soon face a “comprehensive global cyber attack”, which will inevitably be blamed on Russia, tantamount to a declaration of war.\n\nWhile most Americans are oblivious to how their tax dollars are being spent abroad, there are also those who are not, and who vehemently disagree with the US policy in Ukraine. One of them is Russell Bentley, who came to Donbass as a volunteer in 2014 to fight the “Ukrainian fascist forces”, as he calls them.\n\nHe revealed in early February that the demarcation line was five miles from the city center, and that the Ukrainian forces were shelling civilian infrastructure with heavy artillery on a daily basis. Along the front line, which stretches for some 200 miles, their 30,000-strong volunteer force faces some 150,000 regular Ukrainian troops, of whom he estimates that 80% are demoralized conscripts who would rather flee than fight, but are forced to stay put by the thousands of zealots of the infamous Azov battalion as well as Blackwater mercenaries and ISIS terrorists – imported from Syria, courtesy of Erdogan.\n\nSince late last year, dozens of cargo planes landed in Ukraine with military equipment and NATO calibre ammunition; in addition to heavy artillery and Turkish drones, Ukrainian forces are equipped with modern night scopes and encrypted communications equipment, whereas the separatists are forced to defend their homes with obsolete weapons and analog radios which are easily jammed.\n\nRussian intervention was their only hope for survival, as was the case for Abkhazia and South Ossetia, two pro-Russian enclaves which Georgia attacked with US and Israeli military assistance in 2008. President Mikheil Saakashvili asserted at the time that he acted in self-defense and did not initiate the five-day war – which took place during the Beijing olympics – but in 2009 an investigative team dispatched by the EU concluded that Georgia had been the instigator.\n\nWhen the war in Ukraine comes to an end, the world can look forward to a new, more dangerous pandemic that the “philanthropist” Bill Gates predicted in Munich. Malleable politicians across the globe will hastily introduce a new wave of restrictive measures, resulting in a permanent loss of the few remaining human rights, including freedom of speech and free movement, including the right to protest.\n\nSceptics should observe Canada, where the devoted student of Klaus Schwab and his WEF global puppet school, the self-appointed dictator Justin Trudeau, had single-handedly declared a state of emergency and eliminated political discourse, with all who participated in, or had financially backed the anti-government protests, being at risk of arrest, property confiscation and blocked bank accounts; even non-regime reporters covering the protest were subjected to police harassment and threats of imprisonment.\n\nIt must become clear to everyone that Pathogens and Putin are not a threat to mankind’s existence – while parasites in human form are – and that a new Dark Age is imminent if they continue believing the government propaganda and behaving like everything it decrees is perfectly normal.", "opengraph": {"title": "COVID and Putin are not a threat to your freedom; people like Schwab, Gates & Trudeau are", "type": "article", "url": "https://www.biggovernment.news/2022-03-03-schwab-gates-trudeau-are-threat-to-freedom.html", "site_name": "Big Government", "description": "After two long years of unbridled media-induced hysteria, the pandemic narrative finally began losing steam, only to be replaced by the latest bogeyman in globalists’ crosshairs – Putin and his Ukraine war. (Article by Dragan Filipovic republished from DailyExpose.uk) Shortly before, even Bill Gates was forced to admit that the battle against Covid had definitely […]", "image": "https://www.biggovernment.news/wp-content/uploads/sites/59/2022/03/Gates_WEF_wikimedia-1.jpeg"}, "tags": ["Justin Trudeau", "Vladimir Putin", "big government", "Ukraine", "globalists", "Klaus Schwab", "Tyranny", "COVID", "Liberty", "chaos", "slavery", "World War III", "bill gates", "freedom", "deception", "corruption", "pandemic", "conspiracy", "false-flag"], "tweets": [], "movies": [], "links": ["https://dailyexpose.uk/2022/03/02/covid-putin-no-threat-to-freedom-gates-trudeau-are/", "https://www.cnbc.com/2022/02/18/watch-bill-gates-share-his-thoughts-on-how-to-end-to-the-covid-pandemic.html", "https://drtrozzi.org/2021/11/16/natural-immunity-beats-vaccine-by-27-times/", "https://www.rt.com/news/546570-bill-gates-pandemic-warning/", "https://www.redvoicemedia.com/2022/02/moderna-ceo-runs-for-cover-sells-moderna-stock-suddenly-deletes-twitter/", "https://finance.yahoo.com/quote/MRNA/insider-transactions/", "https://www.forbes.com/sites/jonathanponciano/2022/02/14/moderna-stock-crash-losses-top-140-billion-as-insiders-sell-millions-of-dollars-in-shares/", "https://www.reuters.com/article/health-coronavirus-india-pfizer-idUSKBN2A50GE", "https://jamanetwork.com/journals/jama/fullarticle/2788346", "https://www.israelnationalnews.com/news/321238", "https://principia-scientific.com/israeli-ministry-of-health-actually-did-survey-of-adverse-events/", "https://www.naturalnews.com/2021-11-22-africa-6percent-vaccinated-covid-disappeared-scientists-baffled.html", "https://www.hindustantimes.com/cities/lucknow-news/33-districts-in-uttar-pradesh-are-now-covid-free-state-govt-101631267966925.html", "https://www.informedchoiceaustralia.com/post/india-s-most-populous-state-uttar-pradesh-declared-covid-free-since-ivermectin-introduced", "https://sputniknews.com/20220227/three-bayraktar-drones-shot-down-ukrainian-s-300-complex-destroyed-during-sunday-ops-russian-mod-1093426833.html", "https://www.ntv.ru/novosti/2685439/", "https://finance.yahoo.com/news/nato-weighs-russias-security-offer-143636493.html", "https://english.pravda.ru/news/russia/150387-putin_recognises_donbass/", "https://maintenance.un.org/", "https://www.un.org/press/en/2015/sc11785.doc.htm", "https://www.sott.net/article/273602-US-Assistant-Secretary-of-State-Victoria-Nuland-says-Washington-has-spent-5-billion-trying-to-subvert-Ukraine", "https://hitchensblog.mailonsunday.co.uk/2018/02/now-it-starts-to-come-out-kievs-2014-revolution-was-achieved-by-heavily-armed-thugs-many-of-them-neo.html", "https://www.politico.eu/article/germany-powers-down-3-nuclear-plants/", "https://tass.com/politics/949712", "https://beforeitsnews.com/spirit/2021/05/cyber-polygon-2021-klaus-schwab-central-bank-cyber-attack-the-great-currency-reset-2519391.html", "https://www.bitchute.com/video/Ehl7rZOSxLls/", "https://www.ynetnews.com/articles/0,7340,L-3580136,00.html", "https://euobserver.com/foreign/28747", "https://sagaciousnewsnetwork.net/world-economic-forums-young-global-leaders-revealed/", "https://www.rebelnews.com/canadian_mp_struggling_single_mom_had_bank_account_frozen_over_50_donation_to_freedom_convoy", "https://www.breitbart.com/politics/2022/02/21/ottawa-mayor-proposes-selling-trucks-confiscated-during-freedom-convoy-protests/", "https://www.revolver.news/2022/02/trudeau-crosses-the-rubicon-reveals-end-stage-of-fake-liberal-democracy/", "https://www.rebelnews.com/ottawa_police_threaten_media_with_arrest_for_covering_enforcement_against_peaceful_protesters", "https://dailyexpose.uk/2022/03/02/covid-putin-no-threat-to-freedom-gates-trudeau-are/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fbiggovernment%2F2022-03-03-schwab-gates-trudeau-are-threat-to-freedom.html&linkname=COVID%20and%20Putin%20are%20not%20a%20threat%20to%20your%20freedom%3B%20people%20like%20Schwab%2C%20Gates%20%26%20Trudeau%20are", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}