{"result_id": "047006", "URL": "https://biggovernment.news/2022-06-23-if-democrats-win-midterms-pharmaceutical-genocide-wins.html", "timestamp": "2023-04-25 12:17:22 CEST+0200", "meta": {"description": "After more than two years of oppressive medical fascism, which was mostly inflicted by the Left, it is worth considering that the upcoming midterm elections represent a critical juncture for the future of health freedom and bodily autonomy in this country. If Republicans fail to regain a majority in any of the major branches of […]", "lang": "en", "keywords": "biased medicine,Big Pharma,cancel demoncrats,CDC,Censored Science,child health,Collapse,corruption,COVID,democrats,fake science,FDA,genocide,health freedom,heart health,medical fascism,Medical Tyranny,medical violence,midterms,pandemic narrative,pharmaceuticals,Plandemic,Resist,science fraud,skeptics,vaccination,vaccine injury,vaccines,Vote Republican", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://biggovernment.news/2022-06-23-if-democrats-win-midterms-pharmaceutical-genocide-wins.html", "encoding": "UTF-8"}, "image": null, "domain": "biggovernment.news", "title": "Health freedom at RISK: If Democrats win the midterms, pharmaceutical genocide also wins", "cleaned_text": "Health freedom at RISK: If Democrats win the midterms, pharmaceutical genocide also wins\n\nAfter more than two years of oppressive medical fascism, which was mostly inflicted by the Left, it is worth considering that the upcoming midterm elections represent a critical juncture for the future of health freedom and bodily autonomy in this country.\n\nIf Republicans fail to regain a majority in any of the major branches of government this year, chances are that the next engineered plandemic will be much worse than the last one.\n\nThis is not to say that Republicans are always champions of health freedom (i.e., their bizarre aversion to cannabis, for instance). But when it comes to matters like the right to refuse vaccination, Republicans tend to be the better choice.\n\nAt the forefront of the conversation right now is the recent decision to allow children as young as six months to get “vaccinated” for the Wuhan coronavirus (Covid-19). Both the U.S. Food and Drug Administration (FDA) and the U.S. Centers for Disease Control and Prevention (CDC) authorized this with flying colors, a move that Dr. Toby Rogers says is a travesty.\n\n“Over the course of five meetings in five days I witnessed crimes against humanity, the end of the bourgeoisie, and the likely end of America,” Rogers wrote about his observations.\n\nIf covid shots don’t work and come with serious risks, why was authorization for babies granted without question?\n\nFirst and foremost, the “science” that was presented at the meetings was fraudulent. It bore the same flaws as the so-called science put forth for the adult injections.\n\nThere is zero evidence to show that the jabs work to protect children, as well as zero to support the notion that they are in any way safe. Meanwhile, the data shows that the shots are catastrophic for human health.\n\nRogers goes into this in far more detail in an article he wrote about the subject, if you are interested in the nitty-gritty about all this.\n\nHe further notes that covid is not a vaccine-preventable disease by any stretch of the imagination, which the government and Big Pharma openly admit. And yet somehow they also say in the very same breath that everyone needs to take them, including children, in order to “stop the spread” – how, exactly, does that work?\n\nIt was also revealed at the meetings that there are “no observed health benefits” and plenty of “negative efficacy” that can “cause myocarditis.” Still, authorization was granted with flying colors.\n\n“At these meetings there is no critical thinking, no hard questions, and no debate,” Rogers says. “There’s no science at all at these meetings, just a theatrical performance of science-y sounding things.”\n\nAs Americans wake up to the deadly poisons that were pushed on them, more of them will become Republicans, Rogers says\n\nIn Rogers’ view, the powers that be only think that they won, and that the “Final Solution” they constructed over the past year will reign supreme. The reality, he says, is that Republicans are about to win in a landslide, preventing a pharmaceutical genocide.\n\nAs those who believe the plandemic narrative continue to inject themselves and their children with every new shot and “booster” that comes along, their health, and eventually their dignity, will collapse under the weight of their misguided decisions.\n\nOver time, these people will shift their views and medical freedom will become the single issue that drives their voting preferences. This will deliver a death blow to the Democrats who have been pushing these deadly poisons on the country for many months now.\n\n“Republicans, who understand vaccine injury better than Democrats at this point, will win the November midterm elections, the 2024 Presidential election, and the majority of local, state, and federal elections for the foreseeable future,” Rogers writes.\n\n“Republicans will control all of the appropriations committees and oversight committees that have purview over HHS, FDA, CDC, and NIH. Fauci, Walensky, Califf, and Marks will all quickly retire to avoid being called to testify.”\n\nIn Rogers’ opinion, the current system that has controlled the United States for two centuries has already collapsed. The Rockefeller Foundation, the New England Journal Medicine (NEJM), Harvard University and a host of other once-respected institutions have lost all credibility, and they will never again rise to the same level of power they once had.\n\n“By failing to listen to the majority of the country that is deeply skeptical of these shots, the FDA and CDC deepened the polarisation and made reconciliation nearly impossible,” Rogers adds.\n\n“We need to make the point every chance that we get that the November midterm election is not about inflation, guns, abortion, drag shows, nor Ukraine. The 2022 midterm election is about stopping the Pharma genocide.”\n\nThe issues that are most important to him all have to do with who was involved in pushing the plandemic genocide, and how to get them out of power and replaced as soon as possible. And the reality is that most of the villains seem to align with the Left rather than the Right, he says.\n\nMore of the latest news about Chinese Virus injections can be found at ChemicalViolence.com.", "opengraph": {"title": "Health freedom at RISK: If Democrats win the midterms, pharmaceutical genocide also wins", "type": "article", "url": "https://www.biggovernment.news/2022-06-23-if-democrats-win-midterms-pharmaceutical-genocide-wins.html", "site_name": "Big Government", "description": "After more than two years of oppressive medical fascism, which was mostly inflicted by the Left, it is worth considering that the upcoming midterm elections represent a critical juncture for the future of health freedom and bodily autonomy in this country. If Republicans fail to regain a majority in any of the major branches of […]", "image": "https://www.biggovernment.news/wp-content/uploads/sites/59/2022/06/Skull-Hell-Apocalypse-Pile-Bones-Cemetery-Genocide.jpg"}, "tags": ["Censored Science", "vaccine injury", "genocide", "Big Pharma", "science fraud", "vaccines", "midterms", "pandemic narrative", "Plandemic", "democrats", "cancel demoncrats", "Vote Republican", "biased medicine", "skeptics", "medical fascism", "CDC", "health freedom", "FDA", "heart health", "Collapse", "child health", "pharmaceuticals", "vaccination", "medical violence", "corruption", "Resist", "Medical Tyranny", "COVID"], "tweets": [], "movies": [], "links": ["https://expose-news.com/2022/06/22/election-is-about-stopping-pharma-genocide/", "https://www.naturalnews.com/2022-06-21-pfizer-trial-children-covid-vaccines-ineffective-dangerous.html", "https://expose-news.com/2022/06/22/election-is-about-stopping-pharma-genocide/", "http://www.harvard.edu", "http://chemicalviolence.com", "https://expose-news.com/2022/06/22/election-is-about-stopping-pharma-genocide/", "https://www.naturalnews.com/2022-06-21-pfizer-trial-children-covid-vaccines-ineffective-dangerous.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fbiggovernment%2F2022-06-23-if-democrats-win-midterms-pharmaceutical-genocide-wins.html&linkname=Health%20freedom%20at%20RISK%3A%20If%20Democrats%20win%20the%20midterms%2C%20pharmaceutical%20genocide%20also%20wins", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}