{"result_id": "047017", "URL": "https://www.biggovernment.news/2022-12-15-fda-blind-eye-fraudulent-data-covid-vaccines.html", "timestamp": "2023-04-25 12:17:28 CEST+0200", "meta": {"description": "Documents released as part of a whistleblower complaint against Pfizer reveal that the U.S. Food and Drug Administration (FDA) “turned a blind eye” to the “fraudulent data” that Pfizer submitted alongside its messenger RNA (mRNA) Wuhan coronavirus (Covid-19) “vaccine.” An agent within the FDA’s Office of Criminal Investigation (OCI) admitted in an email that the […]", "lang": "en", "keywords": "badhealth,badmedicine,badscience,Big Pharma,BigGovernment,Collusion,conspiracy,COVID,Dangerous Medicine,deception,Fact Check,FDA,fraud,government corruption,medical violence,Pfizer,pharmaceutical fraud,science deception,traitors,treason,Tyranny,vaccine", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.biggovernment.news/2022-12-15-fda-blind-eye-fraudulent-data-covid-vaccines.html", "encoding": "UTF-8"}, "image": null, "domain": "www.biggovernment.news", "title": "FDA “turned a blind eye” to “submission of fraudulent data” on covid injections, investigator reveals", "cleaned_text": "FDA “turned a blind eye” to “submission of fraudulent data” on covid injections, investigator reveals\n\nDocuments released as part of a whistleblower complaint against Pfizer reveal that the U.S. Food and Drug Administration (FDA) “turned a blind eye” to the “fraudulent data” that Pfizer submitted alongside its messenger RNA (mRNA) Wuhan coronavirus (Covid-19) “vaccine.”\n\nAn agent within the FDA’s Office of Criminal Investigation (OCI) admitted in an email that the agency knew Pfizer’s data was fraudulent but accepted it anyway, using it to emergency authorize (EUA), then approve, Pfizer’s covid injection products.\n\nThe OCI operates much like a police force, conducting criminal investigations into illegal activities involving FDA-approved products. It then presents cases before the Department of Justice (DoJ) for prosecution.\n\nRoughly 200 federal agents hired from the Secret Service, the FBI, and the Internal Revenue Service (IRS) criminal investigations unit work at the OCI, which has agents stationed all across the country, as well as at some overseas posts.\n\nThe OCI, which has the same arresting authority as other federal law enforcement agents, was established by former FDA Commissioner David Kessler following the generic drug scandal of the late 1980s. Kessler wanted to crack down on FDA employees for accepting bribes in exchange for drug approvals.\n\n“What I care about most is restoring the credibility and the integrity of the Food and Drug Administration,” Kessler stated at the time. “And the only way to do that is to focus on strong enforcement. We are going to enforce the law.” (Related: Back in May, the FDA finally admitted that covid jabs cause clots.)\n\nFDA knew about fraudulent data from AstraZeneca, too\n\nThe email in question from the OCI agent, dated March 26, 2021, was leaked as part of whistleblower Brook Jackson’s complaint against Pfizer. Jackson, as you may recall, blew the lid on Pfizer’s fraudulent clinical trials and “falsified data.”\n\n“Having worked at FDA, I see it as surprising, for many reasons, that the agency turned a blind eye to a company’s knowing submission of fraudulent data,” is what the OCI officer wrote in the discourse.\n\nThe FDA, he added, “likely feared the criticism they undoubtedly would have received for holding up a vaccine (which they knew they would eventually approve anyway) at the expense of untold lives lost,” noting that the agency was also “weighing the risk / benefit ratio.”\n\nIt was a decision between telling the truth or telling a lie, though the OCI officer presented it in somewhat more anomalous, politically charged terms. The answer is the simple one: tell the truth – but we know the FDA is reluctant to ever choose that option.\n\nThere was also mention of AstraZeneca’s failed covid injection, and the fraudulent clinical trial data that was used to push that one as well. The company trial’s own Data and Safety Monitoring Board drew attention to the “outdated and potentially misleading data” submitted to the FDA, and the OCI officer addressed this matter, too.\n\n“The general public must be able to trust that the clinical results are valid to sell, approve or take medication,” he wrote, adding the politically correct caveat that the jab is probably “still extremely likely to be safe and effective.”\n\n“My point here is that instead of the regulators protecting the public, in our case, they were complicit in a fraud,” he further suggested in a later statement about the matter.\n\n“At the time, they may have been doing what they believed to be the right thing under extraordinary circumstances. But now they may soon have some explaining to do.”\n\nMore of the latest news coverage about covid injections and the fraudulent data the FDA used to emergency authorize and approve them can be found at ChemicalViolence.com.", "opengraph": {"title": "FDA “turned a blind eye” to “submission of fraudulent data” on covid injections, investigator reveals", "type": "article", "url": "https://www.biggovernment.news/2022-12-15-fda-blind-eye-fraudulent-data-covid-vaccines.html", "site_name": "Big Government", "description": "Documents released as part of a whistleblower complaint against Pfizer reveal that the U.S. Food and Drug Administration (FDA) “turned a blind eye” to the “fraudulent data” that Pfizer submitted alongside its messenger RNA (mRNA) Wuhan coronavirus (Covid-19) “vaccine.” An agent within the FDA’s Office of Criminal Investigation (OCI) admitted in an email that the […]", "image": "https://www.biggovernment.news/wp-content/uploads/sites/59/2022/12/fda.png"}, "tags": ["Collusion", "fraud", "science deception", "Tyranny", "medical violence", "Pfizer", "Big Pharma", "FDA", "treason", "BigGovernment", "deception", "vaccine", "traitors", "government corruption", "pharmaceutical fraud", "conspiracy", "COVID", "Fact Check"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/health/fda-blind-eye_4901497.html", "https://naturalnews.com/2022-05-10-fda-admits-covid-vaccines-cause-blood-clots.html", "https://naturalnews.com/2021-11-03-whistleblower-pfizer-falsified-data-flawed-covid-trials.html", "http://chemicalviolence.com", "https://www.theepochtimes.com/health/fda-blind-eye_4901497.html", "https://naturalnews.com/2022-05-10-fda-admits-covid-vaccines-cause-blood-clots.html", "https://naturalnews.com/2021-11-03-whistleblower-pfizer-falsified-data-flawed-covid-trials.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fbiggovernment%2F2022-12-15-fda-blind-eye-fraudulent-data-covid-vaccines.html&linkname=FDA%20%E2%80%9Cturned%20a%20blind%20eye%E2%80%9D%20to%20%E2%80%9Csubmission%20of%20fraudulent%20data%E2%80%9D%20on%20covid%20injections%2C%20investigator%20reveals", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}