{"result_id": "047038", "URL": "https://biggovernment.news/2022-11-24-henriette-mutegwaraba-shares-experience-rwanda-genocide-survivor.html", "timestamp": "2023-04-25 12:17:41 CEST+0200", "meta": {"description": "Author Henriette Mutegwaraba shared her experience as a survivor of the Rwanda genocide with guest host Sondra Martin Hicks during the November 21 episode of “America Unhinged” on Brighteon.TV. Mutegwaraba survived the genocide, but not after losing 62 people in her family. The Rwanda genocide was a planned campaign of mass murder that happened over the […]", "lang": "en", "keywords": "big government,chaos,crime,democide,Europeans,evil,extremism,genocide,Henriette Mutegwaraba,history,mass murder,post traumatic stress disorder,PTSD,Rwanda,Sondra Martin Hicks,terrorism,Tutsi,Twisted,violence", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://biggovernment.news/2022-11-24-henriette-mutegwaraba-shares-experience-rwanda-genocide-survivor.html", "encoding": "UTF-8"}, "image": null, "domain": "biggovernment.news", "title": "Rwanda genocide survivor Henriette Mutegwaraba shares her experience with Sondra Martin Hicks – Brighteon.TV", "cleaned_text": "Author Henriette Mutegwaraba shared her experience as a survivor of the Rwanda genocide with guest host Sondra Martin Hicks during the November 21 episode of “America Unhinged” on Brighteon.TV.\n\nMutegwaraba survived the genocide, but not after losing 62 people in her family.\n\nThe Rwanda genocide was a planned campaign of mass murder that happened over the course of about 100 days from April to July 1994 in the east-central African nation.\n\nMore than 800,000 civilians killed during the Rwandan genocide\n\nThe genocide, which was conceived by extremist elements of Rwanda’s majority Hutu tribe, had more than 800,000 civilians killed. Around two million Rwandans left the country during or immediately after the genocide.\n\nHicks, an award-winning filmmaker and author, asked Mutegwaraba to share her story, which was also told in the book she wrote.\n\nMutegwaraba provided a brief historical background about the genocide and related how the conflict between the two Rwandan tribes, the Hutus and the Tutsis, started.\n\nThe author of the book “By All Means Necessary” said there was so much animosity between the Hutus toward the Tutsis because the latter were favored by the Europeans during the colonial time.\n\nShe also mentioned that after Rwanda got its independence, the Europeans gave power to the Hutu majority. The Hutus started killing the Tutsis in 1959.\n\nMutegwaraba added that the small percentage of Tutsis living in the country were also oppressed, with the tribe not being allowed in the military and universities. Intermarriage between Hutus and Tutsis was also not allowed. (Related: Pompeo says China’s treatment of Muslims and ethnic minorities is “genocide”.)\n\nShe stated that political issues between the two tribes turned into a different story when the government tried to kill all Tutsis beginning in the 1990s, which culminated with the genocide that happened in 1994.\n\n“They (Tutsis) got arrested. Young people got arrested, mothers got arrested, and fathers got arrested. I had a couple of family members who got arrested as well. They invaded our houses in the morning trying to accuse us and set us up for weapons that we didn’t have. Just false accusations and treating us as if we’re not human beings just because of how God had created us,” Mutegwaraba said.\n\n“I lost all my immediate family. I lost four siblings, my mother, my father, my brothers, my grandmas, my aunties, cousins,” Mutegwaraba continued. She added that aside from herself, her younger sister and auntie were the sole survivors in their family.\n\nMutegwaraba, who was in her 20s when the genocide happened, said it took a lot of prayers to deal with and overcome the massive pain she had to face after the genocide.\n\n“It was a massive pain, so much pain that I didn’t know how to handle it. And everybody around me was in pain. My little sister who survived, that time she was 13. I was trying to be a mother to her. And so, it’s like you are in that pain and everybody who survived with you they are dealing with the same pain. So, there’s nobody to comfort you, nobody. It was so much pain that only God can take it away from me,” Mutegwaraba said.\n\nThe genocide destroyed Rwandans in many ways. Mutegwaraba said Rwandans will never recover from it until they learn how to forgive, live again and get past the traumatic memories of the genocide.\n\nAccording to Mutegwaraba, the aftermath of genocide is terrifying and tough because the survivors lost everything. Many of the victims, Mutegwaraba added, didn’t even receive proper burial and were just thrown in mass graves.\n\nThe author also shared that a lot of Rwandans are still dealing with post-traumatic stress disorder or PTSD because of the genocide.\n\nFollow Genocide.news for more news about the mass murder of people happening around the world.\n\nWatch the November 21 episode of “America Unhinged” below. “America Unhinged” with Dr. John Diamond airs every weekday at 9 a.m., Sunday at 9 p.m. and Saturday at 8 a.m. on Brighteon.TV.\n\nSLOW MOTION GENOCIDE: Excess mortality up 40% all around the world following release of covid “vaccines.”\n\nScientist calls out Polish government over attempt to LEGALIZE GENOCIDE.\n\nWalmart sides with terrorists, pledges $100 million to fund very same groups linked to those demanding the mass murder of whites across America.\n\nChina declares “all lives matter” but fails to mention the mass murder of Falun Gong practitioners, or the secret organ harvesting operations by the CCP.\n\nCCP says Uyghur Muslims opposing their own genocide are guilty of “hating Asians.”", "opengraph": {"title": "Rwanda genocide survivor Henriette Mutegwaraba shares her experience with Sondra Martin Hicks – Brighteon.TV", "type": "article", "url": "https://www.biggovernment.news/2022-11-24-henriette-mutegwaraba-shares-experience-rwanda-genocide-survivor.html", "site_name": "Big Government", "description": "Author Henriette Mutegwaraba shared her experience as a survivor of the Rwanda genocide with guest host Sondra Martin Hicks during the November 21 episode of “America Unhinged” on Brighteon.TV. Mutegwaraba survived the genocide, but not after losing 62 people in her family. The Rwanda genocide was a planned campaign of mass murder that happened over the […]", "image": "https://www.biggovernment.news/wp-content/uploads/sites/59/2022/11/Skull-Hell-Apocalypse-Pile-Bones-Cemetery-Genocide.jpg"}, "tags": ["genocide", "Twisted", "post traumatic stress disorder", "violence", "crime", "Henriette Mutegwaraba", "mass murder", "big government", "Tutsi", "Sondra Martin Hicks", "evil", "PTSD", "Europeans", "democide", "chaos", "terrorism", "history", "Rwanda", "extremism"], "tweets": [], "movies": [], "links": ["http://www.brighteon.com/471bc8ce-e8b2-47c9-96ba-13aec945444d", "https://brighteon.tv/", "http://www.britannica.com/event/Rwanda-genocide-of-1994", "https://heartstonenetwork.com/booking/", "https://naturalnews.com/2021-01-21-pompeo-china-muslims-ethnic-minorities-genocide.html", "https://biggovernment.news", "http://genocide.news", "http://www.brighteon.com/471bc8ce-e8b2-47c9-96ba-13aec945444d", "https://brighteon.tv/", "https://naturalnews.com/2022-11-18-excess-mortality-soaring-around-world-covid-vaccines.html", "https://genocide.news/2022-11-18-polish-government-attempts-to-legalize-genocide.html", "https://naturalnews.com/2020-06-08-walmart-sides-terrorists-donates-millions-groups-demanding-murder-whites.html", "https://naturalnews.com/2020-06-02-china-declares-all-lives-matter-fails-to-mention-local-atrocities.html", "https://naturalnews.com/2021-03-31-ccp-uyghurs-opposing-genocide-guilty-hating-asians.html", "https://www.brighteon.com/471bc8ce-e8b2-47c9-96ba-13aec945444d", "http://www.britannica.com/event/Rwanda-genocide-of-1994", "https://heartstonenetwork.com/booking/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fbiggovernment%2F2022-11-24-henriette-mutegwaraba-shares-experience-rwanda-genocide-survivor.html&linkname=Rwanda%20genocide%20survivor%20Henriette%20Mutegwaraba%20shares%20her%20experience%20with%20Sondra%20Martin%20Hicks%20%E2%80%93%20Brighteon.TV", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}