{"result_id": "047011", "URL": "https://biggovernment.news/2022-08-10-south-africa-to-mandate-tests-vaccinations-quarantine.html", "timestamp": "2023-04-25 12:17:24 CEST+0200", "meta": {"description": "South Africa is seeking to put in place tyrannical health mandates – such as required tests, compulsory vaccination and indefinite quarantine – that undermine individual liberty and bodily integrity. The mandates come in the form of proposed amendments to the country’s National Health Act (NHA) regulations. South African Health Minister Dr. Joe Phaahla introduced the proposed measures […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,covid-19,freedom,health freedom,Joe Phaahla,Liberty,medical fascism,medical martial law,Medical Tyranny,Mogomotsi Mogodiri,National Health Act,pandemic,Resist,Sibelo Sibanda,South Africa,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://biggovernment.news/2022-08-10-south-africa-to-mandate-tests-vaccinations-quarantine.html", "encoding": "UTF-8"}, "image": null, "domain": "biggovernment.news", "title": "Medical police state: South Africa to mandate tests, vaccination, indefinite quarantine in the name of health", "cleaned_text": "Medical police state: South Africa to mandate tests, vaccination, indefinite quarantine in the name of health\n\nSouth Africa is seeking to put in place tyrannical health mandates – such as required tests, compulsory vaccination and indefinite quarantine – that undermine individual liberty and bodily integrity.\n\nThe mandates come in the form of proposed amendments to the country’s National Health Act (NHA) regulations. South African Health Minister Dr. Joe Phaahla introduced the proposed measures in May. The official sought to change regulations added to the NHA in 2017, instead of outright changing the law, which would require the consent of the South African Parliament in Cape Town.\n• All individuals entering or exiting South Africa “during a public health emergency of international concern” will be required to either present a negative Wuhan coronavirus (COVID-19) test result or get the COVID-19 vaccine on the spot.\n• People who are deemed to be positive cases, suspects or contacts can be detained indefinitely. They will be subjected to any medical examination and treatment the government wishes to impose – including forced vaccination – without their informed consent.\n• Any person suspected of being sick with an infectious disease can be intercepted while departing the country, detained in a state-run quarantine facility against their will and forced to undergo a medical examination. The government will have total control of how and when quarantined individuals will be released.\n• Wakes and after-funeral gatherings for deceased individuals will be prohibited.\n• Any activity on any premises determined as a danger to human health or an environmental nuisance could be deemed unlawful.\n\nIn summary, Phaahla will have the power to declare a pandemic, shut down the whole country or certain regions, forcefully quarantine people and enforce vaccines or other drugs without soliciting consent from people. Anyone opposing these measures could either face prison time of up to 10 years, or given vaccines or medical treatments against their will at a quarantine facility. (Related: Protesters in South Africa burn masks in opposition to coronavirus vaccine experimentation.)\n\nOne South African spoke out against the health minister’s proposed measures, calling on his compatriots in a video to stand up against this affront to health freedom.\n\nAdvocate Sibelo Sibanda remarked that the draft provisions make the “state of disaster” and “regulations” that stemmed from the COVID-19 pandemic permanent. According to the lawyer, the proposed mandates take away an individual’s ability to refuse medical treatments, including vaccines, and their right to move freely.\n\n“So now, the country of South Africa will be under a permanent state of disaster. Masking will be permanent, social distancing [will be] permanent – [and so are] control of people at gatherings … [and] the entry in and out of the country,” warned Sibanda.\n\n“You are now subjected to such draconian laws, and it is a way by which, in the name of health, people’s freedoms are being taken away.”\n\nMedia specialist Mogomotsi Mogodiri also denounced the proposed mandates, saying that they went “against [South Africa’s] democratic ethos.”\n\n“By introducing these regulations while sidestepping Parliament, the government is attempting – by stealth – to obliterate our rights and freedoms of choice, religion and bodily integrity.”\n\nMogodiri also urged South Africans to submit their objections to the proposed revisions to the NHA.\n\n“Through submitting their objections to these amendments, the public will be doing their patriotic duty [by] ensuring that human rights are not violated or taken away [on a] whim and that the government remains true to its obligation of protecting, defending and preserving [the South African] Constitution.”\n\nThe media specialist ultimately exhorted Phaahla to “abandon these amendments,” as refusing to do so “will only point at the mischief of a government that has dictatorial inclinations.”\n\nVisit MedicalTyranny.com for more stories about draconian mandates imposed under the veil of public health.\n\nListen to Health Ranger Mike Adams argue that the medical police state seen in South Africa is now in the United States.\n\nThis video is from the Health Ranger Report channel on Brighteon.com.\n\nMedical police state: British government to require covid vaccines everywhere, and for any job.\n\nMedical police state: FBI and HHS raid medical spa treating coronavirus patients with intravenous vitamin C.\n\nThe medical police state has arrived in California: Mother threatened with ARREST for refusing to vaccinate her children.\n\nMEDICAL POLICE STATE TYRANNY: Australian police smash down the door of a man and violently arrest him for mentioning anti-lockdown protest.", "opengraph": {"title": "Medical police state: South Africa to mandate tests, vaccination, indefinite quarantine in the name of health", "type": "article", "url": "https://www.biggovernment.news/2022-08-10-south-africa-to-mandate-tests-vaccinations-quarantine.html", "site_name": "Big Government", "description": "South Africa is seeking to put in place tyrannical health mandates – such as required tests, compulsory vaccination and indefinite quarantine – that undermine individual liberty and bodily integrity. The mandates come in the form of proposed amendments to the country’s National Health Act (NHA) regulations. South African Health Minister Dr. Joe Phaahla introduced the proposed measures […]", "image": "https://www.biggovernment.news/wp-content/uploads/sites/59/2022/08/Vaccine-Syringe-Password-Mask-Covid-19-Coronavirus.jpg"}, "tags": ["South Africa", "Joe Phaahla", "big government", "health freedom", "Medical Tyranny", "National Health Act", "covid-19", "vaccines", "Resist", "medical martial law", "pandemic", "Liberty", "Mogomotsi Mogodiri", "medical fascism", "freedom", "Sibelo Sibanda"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/news/south-african-govt-seeks-mandated-tests-shots-and-indefinite-detention-in-the-name-of-health/", "https://www.msn.com/en-za/news/other/draconian-amendments-to-national-health-act-a-violation-of-rights/ar-AA10fWTD", "http://healthfreedom.news", "https://naturalnews.com/2020-07-06-protesters-south-africa-burn-masks-opposition-coronavirus-vaccine-experimentation.html", "https://medicaltyranny.com/", "https://www.brighteon.com/143e09f1-09ce-41b5-bd0b-942088616198", "https://www.brighteon.com/channels/hrreport", "https://medicaltyranny.com/2021-07-20-british-government-to-require-covid-vaccines-everywhere-any-job.html", "https://alternativemedicine.news/2020-04-28-fbi-hhs-raid-medical-spa-treating-coronavirus-intravenous-vitamin-c.html", "https://policestate.news/2017-11-14-the-medical-police-state-has-arrived-in-california-mother-threatened-with-arrest-for-refusing-to-vaccinate-her-children.html", "https://medicaltyranny.com/2020-09-04-australian-police-smash-down-door-of-a-man-anti-lockdown-protest.html", "https://www.lifesitenews.com/news/south-african-govt-seeks-mandated-tests-shots-and-indefinite-detention-in-the-name-of-health/", "https://www.msn.com/en-za/news/other/draconian-amendments-to-national-health-act-a-violation-of-rights/ar-AA10fWTD", "https://www.brighteon.com/143e09f1-09ce-41b5-bd0b-942088616198", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fbiggovernment%2F2022-08-10-south-africa-to-mandate-tests-vaccinations-quarantine.html&linkname=Medical%20police%20state%3A%20South%20Africa%20to%20mandate%20tests%2C%20vaccination%2C%20indefinite%20quarantine%20in%20the%20name%20of%20health", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}