{"result_id": "047009", "URL": "https://biggovernment.news/2022-07-29-fauci-fund-china-military-run-labs-taxpayers-money.html", "timestamp": "2023-04-25 12:17:23 CEST+0200", "meta": {"description": "The National Pulse revealed in a recent article that the National Institutes of Health (NIH) has sent hundreds of thousands of dollars to China-based laboratories with deep ties to the People’s Liberation Army (PLA). Dr. Anthony Fauci is the director of the National Institute of Allergy and Infectious Diseases (NIAID) at the NIH. Two studies were found in […]", "lang": "en", "keywords": "Anthony Fauci,badscience,big government,CCP,China,conspiracy,corruption,military labs,NIH,research,science deception,science fraud,traitors,treason,Wuhan Institute of Virology", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://biggovernment.news/2022-07-29-fauci-fund-china-military-run-labs-taxpayers-money.html", "encoding": "UTF-8"}, "image": null, "domain": "biggovernment.news", "title": "Anthony Fauci, NIH fund China’s military-run labs using US taxpayers’ money", "cleaned_text": "The National Pulse revealed in a recent article that the National Institutes of Health (NIH) has sent hundreds of thousands of dollars to China-based laboratories with deep ties to the People’s Liberation Army (PLA).\n\nDr. Anthony Fauci is the director of the National Institute of Allergy and Infectious Diseases (NIAID) at the NIH.\n\nTwo studies were found in the NIH grant database. The first one is a study on the “transmission-blocking vaccines” for malaria-endemic countries, which received $135,000.\n\n“This project seeks to use a comprehensive antigen discovery pathway, including antigen identification through genome-wide immunological screening, validation in rodent malaria model, and further evaluation in P. vivax, to identify new transmission-blocking vaccine candidates for vivax malaria,” the project summary stated. The grant was given to China Medical University.\n\nThe National Pulse noted that the said university is entirely controlled by the Chinese Communist Party (CCP) and formerly known as the Peasants Red Army Military Medical School.\n\n“It is the only medical institution to have participated in the ‘long march’ in 1934 with the Red Army of the CCP,” said Natalie Winters, National Pulse‘s lead investigative reporter and podcast host.\n\nThe other research focused on the spread of dengue fever in China, with $132,912 going to the Southern Medical University (SMU). Winters said the school was formerly known as First Military Medical University.\n\n“SMU falls under the jurisdiction of the Military Committee of the PLA, according to its website. Professors, as well as entire institutes, have received awards from various branches of the PLA, including its general logistics department,” she said.\n\nShe added that this university’s biomechanics laboratory operates under the control of the PLA and counts support of China’s 863 programs, which has seen Chinese scientists affiliated with the effort get convicted for stealing trade secrets from American companies.\n\nThe school has also collaborated with the Wuhan Institute of Virology, which conducted gain-of-function research on bat coronaviruses. SMU provided human blood samples to the Wuhan lab for its controversial work with EcoHealth Alliance, another recipient of NIH grants.\n\nEven without this new revelation, Fauci is already considered the single biggest reason why COVID-19 has become a worldwide pandemic.\n\n“He has done incalculable damage throughout the world,” Epoch Times columnist Jeffrey Tucker said during an interview with LifeSite News senior correspondent Jim Hale.\n\nTucker, the founder and president of Brownstone Institute, said the NIAID director’s pandemic measures have damaged a lot of people and businesses.\n\n“He believed that he could control the spread through forced behavioral changes and worked very closely with Deborah Birx to bring this about,” Tucker said.\n\nHe stressed that Fauci definitely lied about his funding of gain-of-function through Eco Health Alliance and friend Peter Daszak, who received several grants from NIAID. (Related: Fauci and the NIH caught funding China’s covid bioweapons research.)\n\nAccording to Tucker, Fauci convinced Big Tech and mainstream media to back his campaign promoting fear and hysteria.\n\n“And it’s not just about that, he’s lied about everything. He’s lied about natural immunity. He was asked countless times about natural immunity [and] each time he said, ‘Well, we are looking into that. We just don’t know.’ But we’ve known about natural immunity for two and a half thousand years. And so this was just ridiculous,” he said.\n\nWatch the below video that talks about the shameful legacy of Anthony Fauci.\n\nThis video is from the LSNTV channel on Brighteon.com.\n\nTWISTED: Fauci is now claiming that he never recommended lockdowns.\n\nWhy does it matter that Fauci got COVID-19.\n\nBirx admits she and Fauci made up “the science” on social distancing, lockdowns.\n\nLawsuit filed against Fauci, Biden regime hacks for colluding with Big Tech to suppress free speech.", "opengraph": {"title": "Anthony Fauci, NIH fund China’s military-run labs using US taxpayers’ money", "type": "article", "url": "https://www.biggovernment.news/2022-07-29-fauci-fund-china-military-run-labs-taxpayers-money.html", "site_name": "Big Government", "description": "The National Pulse revealed in a recent article that the National Institutes of Health (NIH) has sent hundreds of thousands of dollars to China-based laboratories with deep ties to the People’s Liberation Army (PLA). Dr. Anthony Fauci is the director of the National Institute of Allergy and Infectious Diseases (NIAID) at the NIH. Two studies were found in […]", "image": "https://www.biggovernment.news/wp-content/uploads/sites/59/2022/07/Fauci-Mask-Hearing-Coronavirus.jpg"}, "tags": ["big government", "NIH", "research", "science deception", "Wuhan Institute of Virology", "treason", "science fraud", "corruption", "China", "CCP", "military labs", "traitors", "conspiracy", "Anthony Fauci"], "tweets": [], "movies": [], "links": ["https://thenationalpulse.com/2022/07/28/fauci-nih-agency-is-still-funding-ccp-military-labs/", "https://reporter.nih.gov/search/b4coUJMdc06IGIvc3sCxSg/projects?sort_field=FiscalYear&sort_order=desc", "https://reporter.nih.gov/search/b4coUJMdc06IGIvc3sCxSg/project-details/10388106", "https://www.isacteach.com/university/china-medical-university/", "http://portal.smu.edu.cn/en/", "http://english.whiov.cas.cn/", "https://thenationalpulse.com/2021/09/13/fauci-funded-study-recombining-viruses-used-pla-data/", "https://www.brighteon.com/810172ef-8af3-4ac8-b29d-892b2e18aaff", "https://faucitruth.com/", "https://naturalnews.com/2021-05-10-fauci-and-the-nih-caught-funding-chinas-covid-bioweapons-research.html", "http://traitors.news", "https://www.brighteon.com/810172ef-8af3-4ac8-b29d-892b2e18aaff", "https://www.brighteon.com/channels/lsntv", "https://naturalnews.com/2022-07-28-fauci-claiming-he-never-recommended-lockdowns.html", "https://pandemic.news/2022-06-24-it-matters-that-fauci-got-covid-19.html", "https://newstarget.com/2022-07-25-birx-fauci-fake-science-social-distancing-lockdowns.html", "https://naturalnews.com/2022-07-23-lawsuit-fauci-biden-collusion-big-tech-speech.html", "https://thenationalpulse.com/2022/07/28/fauci-nih-agency-is-still-funding-ccp-military-labs/", "https://reporter.nih.gov/search/b4coUJMdc06IGIvc3sCxSg/projects?sort_field=FiscalYear&sort_order=desc", "https://reporter.nih.gov/search/b4coUJMdc06IGIvc3sCxSg/project-details/10388106", "https://thenationalpulse.com/2021/09/13/fauci-funded-study-recombining-viruses-used-pla-data/", "https://www.brighteon.com/810172ef-8af3-4ac8-b29d-892b2e18aaff", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fbiggovernment%2F2022-07-29-fauci-fund-china-military-run-labs-taxpayers-money.html&linkname=Anthony%20Fauci%2C%20NIH%20fund%20China%E2%80%99s%20military-run%20labs%20using%20US%20taxpayers%E2%80%99%20money", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}