{"result_id": "047016", "URL": "https://www.biggovernment.news/2023-01-20-cdc-report-118000-youth-dead-covid-vaccines.html", "timestamp": "2023-04-25 12:17:28 CEST+0200", "meta": {"description": "It is not easily identifiable – by design – on first glance, but documents from Pfizer and the U.S. Centers for Disease Control and Prevention (CDC) show that nearly half a million children and young adults died within the year following Tony Fauci’s announcement that children are eligible for covid “vaccination.” Of this number, more […]", "lang": "en", "keywords": "badhealth,badmedicine,Big Pharma,CDC,conspiracy,COVID,Data,deaths,deception,depopulation,died suddenly,pharmaceutical fraud,science deception,unexplained,Vaccine deaths,vaccine wars,vaccines,youth", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.biggovernment.news/2023-01-20-cdc-report-118000-youth-dead-covid-vaccines.html", "encoding": "UTF-8"}, "image": null, "domain": "www.biggovernment.news", "title": "As of last October, secret CDC report reveals, at least 118,000 young people “died suddenly” due to covid jabs", "cleaned_text": "As of last October, secret CDC report reveals, at least 118,000 young people “died suddenly” due to covid jabs\n\nIt is not easily identifiable – by design – on first glance, but documents from Pfizer and the U.S. Centers for Disease Control and Prevention (CDC) show that nearly half a million children and young adults died within the year following Tony Fauci’s announcement that children are eligible for covid “vaccination.” Of this number, more than 118,000 deaths were confirmed to have resulted from covid jab adverse events.\n\nThe Organisation for Economic Co-Operation and Development (OEC) is credited with finding the data and presenting it for easy public consumption. Try as they did to conceal the truth, Pfizer and the CDC were unable to keep this data a secret forever.\n\nExcess deaths were barely noticeable – and pretty much nonexistent – among young people in early 2020 at the start of the “pandemic.” Following the launch of Operation Warp Speed, however, excess deaths began to soar in this demographic.\n\n“In 2021, a massive jump can be seen with a higher starting point that is now continuing an upward trajectory, probably because more and more people are being panicked into getting their children injected,” reports explain.\n\n“It’s also important to note that after the vaccines were released (not during the pandemic) the excess deaths were higher every single week.” (Related: The CDC has been lying to the public about covid vaccine unsafety and ineffectiveness to protect its Big Pharma controllers.)\n\nDoes ANYONE who got covid jabbed stand a chance at long-term survival?\n\nAs of this writing, excess deaths are still increasing in a steady upward trajectory that has ever-so-slightly leveled out – probably because nearly everyone who was ever going to get injected already has, and the rest are just saying no to drugs.\n\nDespite continued efforts by the powers that be to convince everyone to take the shots, tens of millions of Americans are never going to comply. As for those who did and are still alive, our prayers are with them that these excess death trends do not eventually catch up with them as many expect will happen once vaccine-induced AIDS (VAIDS) runs its course.\n\n“The world will not know the complete damage to mankind due to this criminal action for another 10-15 years,” wrote a Natural News commenter about how long he expects it will take for all the rest of the excess deaths to manifest.\n\n“The CDC lied to keep the kill shot active,” wrote another. “And money is how they greased the skids.”\n\nAnother clarified that many of the CDC’s lies are lies of omission rather than lies of commission – meaning the CDC deliberately withholds incriminating and damning data, which paints a false picture of the subject at hand.\n\n“The CDC omits the fact that they are monitoring VAERS reports for one purpose: to remove as many damning reports from public view as possible,” this person wrote.\n\n“They are also omitting the fact that these gene therapy injections self-assemble nanoparticles into bio-circuits when exposed to cell phone and router transmissions.”\n\nHow anyone ever could have trusted the CDC even before the covid scam was foisted upon the world is mind-boggling when considering the agency’s longstanding incestuous relationship with Big Pharma, suggested another.\n\n“After the tobacco scam, people must have their heads in the sand to believe anything other than big profits are the objective,” this person wrote.\n\nSomeone else pointed out that the National Institutes of Health (NIH), the World Health Organization (WHO), and many other national and international governing bodies are no different than the CDC – they are all corrupt and all on the dole of Big Pharma.\n\nThe latest news about the CDC can be found at CDC.news.", "opengraph": {"title": "As of last October, secret CDC report reveals, at least 118,000 young people “died suddenly” due to covid jabs", "type": "article", "url": "https://www.biggovernment.news/2023-01-20-cdc-report-118000-youth-dead-covid-vaccines.html", "site_name": "Big Government", "description": "It is not easily identifiable – by design – on first glance, but documents from Pfizer and the U.S. Centers for Disease Control and Prevention (CDC) show that nearly half a million children and young adults died within the year following Tony Fauci’s announcement that children are eligible for covid “vaccination.” Of this number, more […]", "image": "https://www.biggovernment.news/wp-content/uploads/sites/59/2023/01/Toe-Tag-Dead-Death-Morgue.jpg"}, "tags": ["Data", "deaths", "died suddenly", "science deception", "CDC", "unexplained", "Big Pharma", "Vaccine deaths", "deception", "vaccines", "depopulation", "vaccine wars", "youth", "pharmaceutical fraud", "conspiracy", "COVID"], "tweets": [], "movies": [], "links": ["https://www.shtfplan.com/headline-news/secret-cdc-report-confirms-118k-youths-died-suddenly-after-vax-rollout", "https://naturalnews.com/2022-08-15-cdc-lied-covid-vaccines-protect-big-pharma.html", "http://cdc.news", "https://www.shtfplan.com/headline-news/secret-cdc-report-confirms-118k-youths-died-suddenly-after-vax-rollout", "https://naturalnews.com/2022-08-15-cdc-lied-covid-vaccines-protect-big-pharma.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fbiggovernment%2F2023-01-20-cdc-report-118000-youth-dead-covid-vaccines.html&linkname=As%20of%20last%20October%2C%20secret%20CDC%20report%20reveals%2C%20at%20least%20118%2C000%20young%20people%20%E2%80%9Cdied%20suddenly%E2%80%9D%20due%20to%20covid%20jabs", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}