{"result_id": "047018", "URL": "http://www.biggovernment.news/2022-08-23-malone-denounces-fda-failure-to-protect-americans.html", "timestamp": "2023-04-25 12:17:29 CEST+0200", "meta": {"description": "Dr. Robert Malone, inventor of mRNA technology, physician and podcaster, denounced the Food and Drug Administration (FDA) over its failure to protect the American people from what could be an extremely unsafe platform technology. “I do not need to list out all the adverse events and deaths caused by the [Wuhan coronavirus] COVID-19 vaccines here. […]", "lang": "en", "keywords": "Animal testing,badhealth,badmedicine,badscience,Big Pharma,CDC,cdc lies,Censored Science,Clinical trials,Dangerous Medicine,EUA,FDA,mRNA,pharmaceutical fraud,propaganda,research,Robert Malone,science deception,science fraud,spike proteins,vaccine damage,vaccine injury,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "http://www.biggovernment.news/2022-08-23-malone-denounces-fda-failure-to-protect-americans.html", "encoding": "UTF-8"}, "image": null, "domain": "www.biggovernment.news", "title": "Dr. Robert Malone denounces FDA over failure to protect Americans from “extremely unsafe platform technology”", "cleaned_text": "Dr. Robert Malone denounces FDA over failure to protect Americans from “extremely unsafe platform technology”\n\nDr. Robert Malone, inventor of mRNA technology, physician and podcaster, denounced the Food and Drug Administration (FDA) over its failure to protect the American people from what could be an extremely unsafe platform technology.\n\n“I do not need to list out all the adverse events and deaths caused by the [Wuhan coronavirus] COVID-19 vaccines here. We all know those mRNA vaccines have a lot of adverse events and death. How can the FDA turn a blind eye to this?” Malone said.\n\nMalone was particularly bothered by the news that the pre-clinical phase of the combined influenza/COVID-19 vaccine has been concluded and approved by the FDA and that enrollment for the clinical trials is about to begin. He added that Colorado (UC Health) already has an mRNA vaccine for influenza clinical trial that is already enrolling.\n\n“This means that these mRNA combo vaccines are again being given status as a “vaccine” and not a gene-therapy product. Otherwise, pre-clinical development would have taken much, much longer. Also, the use of pseudouridine has been given the green light again, without further prior clinical testing for safety,” Malone said.\n\n“The length of time the mRNA continues to make protein once in the body, and levels of protein expressed over time have not been assessed in an animal body prior to the onset of these trials. This is shocking.”\n\nHe pointed out that FDA did not require more testing of the nano lipid particles for safety, reproductive toxicity and bio-distribution in an animal model.\n\n“Because we know from the Pfizer data package that inherent safety issues with these vaccines were swept under the rug under the [emergency use authorization] EUA authorization and that these issues should have been red flags for other mRNA vaccine clinical trials, it is hard to believe that any of these issues were addressed,” Malone said.\n\nMoreover, Malone noted that phases 1 and 2 of clinical trials are being condensed. “The safety endpoints for many of these clinical trials are in months, not years. All we can do is speculate, but the lack of transparency and malfeasance is palpable,” he added.\n\nCDC quietly takes down the statement “mRNA do not stay long in the body” from its official site\n\nOn July 15, the Center for Disease Control and Prevention (CDC) quietly removed from its website the statement that says “mRNA and the spike protein do not last long in the body.” Analysts are saying that finally, CDC is changing its point of view. (Related: CDC is quietly altering its website, now admitting that mRNA persists in the body for an extended duration.)\n\n“We know that the mRNA from these vaccines, which incorporates the synthetic nucleotide pseudouridine can persist in lymph nodes for at least 60 days after injection. This is not natural, and this is not really mRNA,” the mRNA vaccine inventor himself said.\n\nMalone explained that these molecules have genetic elements similar to those of natural mRNA, but they are clearly far more resistant to the enzymes which normally degrade natural mRNA, seem to be capable of producing high levels of protein for extended periods and seem to evade normal immunologic mechanisms for eliminating cells – which produce foreign proteins that are not normally observed in the body.\n\n“However, rather than stating it on their website, which the associated liability of that statement being a lie, they turf the untruth to a large hospital and physician chain called Nebraska Med. Better for the CDC to not get caught in another lie, I guess,” he said.\n\n“The CDC, FDA, [National Institute of Allergy and Infectious Diseases] NIAID and [National Institutes of Health] NIH have not been doing their job. They have been hiding data, lying, omitting scientific facts.”\n\nWatch the below video where Dr. Robert Malone talks about FDA displaying “willful blindness” on COVID-19 vaccine dangers.\n\nThis video is from the mh4bright channel on Brighteon.com.\n\nTop 8 GUILTY ADMISSIONS by the CDC, FDA, Fauci, top immunologists about how ineffective, experimental and unsafe COVID-19 “vaccines” really are.\n\nThe Ben Armstrong Show: America reaches tipping point in COVID-19 vaccine truth, says Dr. Robert Malone.\n\nThe FOREVER BATTLE: There is no time clock for when mRNA stops producing toxic spike proteins.", "opengraph": {"title": "Dr. Robert Malone denounces FDA over failure to protect Americans from “extremely unsafe platform technology”", "type": "article", "url": "https://www.biggovernment.news/2022-08-23-malone-denounces-fda-failure-to-protect-americans.html", "site_name": "Big Government", "description": "Dr. Robert Malone, inventor of mRNA technology, physician and podcaster, denounced the Food and Drug Administration (FDA) over its failure to protect the American people from what could be an extremely unsafe platform technology. “I do not need to list out all the adverse events and deaths caused by the [Wuhan coronavirus] COVID-19 vaccines here. […]", "image": "https://www.biggovernment.news/wp-content/uploads/sites/59/2022/08/Robert-Malone-Joe-Rogan-interview.png"}, "tags": ["research", "science deception", "Censored Science", "vaccine injury", "Big Pharma", "science fraud", "vaccines", "cdc lies", "spike proteins", "CDC", "mRNA", "vaccine damage", "FDA", "propaganda", "vaccine wars", "EUA", "Animal testing", "pharmaceutical fraud", "Clinical trials", "Robert Malone"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/opinion/dr-robert-malone-endless-mrna-jabs-are-in-the-works-as-the-cdc-and-fda-play-hide-the-data/", "http://fda.news", "https://www.thegatewaypundit.com/2022/08/cdc-quietly-removes-statement-says-mrna-spike-protein-not-last-long-body-website/", "https://naturalnews.com/2022-08-16-cdc-altering-website-admitting-mrna-persists-in-body.html", "http://vaccinewars.com", "https://www.brighteon.com/216e6f79-297f-439d-bd15-fb1cdfe3498c", "https://www.brighteon.com/channels/mh4bright", "https://naturalnews.com/2022-08-16-top-8-admissions-cdc-fda-fauci-immunologists-about-covid-19-vaccines.html", "https://CDC.news/2022-08-17-cdc-found-lying-about-covid-vaccine-monitoring.html", "https://vaccines.news/2022-08-10-america-reaches-tipping-point-covid-vaccine-truth.html", "https://spikeprotein.news/2022-08-10-mrna-wont-stop-producing-toxic-spike-proteins.html", "https://www.lifesitenews.com/opinion/dr-robert-malone-endless-mrna-jabs-are-in-the-works-as-the-cdc-and-fda-play-hide-the-data/", "https://www.uchealth.org/today/new-mrna-flu-vaccine-testing-launching-now/", "https://clinicaltrials.gov/ct2/show/NCT05375838?term=vaccine&cond=COVID-19+influenza&draw=3&rank=19", "https://www.thegatewaypundit.com/2022/08/cdc-quietly-removes-statement-says-mrna-spike-protein-not-last-long-body-website/", "https://www.brighteon.com/216e6f79-297f-439d-bd15-fb1cdfe3498c", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fbiggovernment%2F2022-08-23-malone-denounces-fda-failure-to-protect-americans.html&linkname=Dr.%20Robert%20Malone%20denounces%20FDA%20over%20failure%20to%20protect%20Americans%20from%20%E2%80%9Cextremely%20unsafe%20platform%20technology%E2%80%9D", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}