{"result_id": "047035", "URL": "https://biggovernment.news/2022-05-20-pfizer-knew-vaccine-cant-protect-from-covid.html", "timestamp": "2023-04-25 12:17:39 CEST+0200", "meta": {"description": "Pfizer knew all along that it’s mRNA vaccine can’t protect people from the Wuhan coronavirus (COVID-19). Renowned author and journalist Naomi Wolf said that a new batch of Pfizer documents released by the Food and Drug Administration (FDA) includes information about the six-shot regimen initially planned by the pharmaceutical company. Both Pfizer and the FDA were fully […]", "lang": "en", "keywords": "Albert Bourla,badhealth,badmedicine,big government,Big Pharma,Brannon Howse,Brighteon.tv,conspiracy,covid-19,Dangerous Medicine,deception,FDA,lies,Naomi Wolf,pandemic,Pfizer,pharmaceutical fraud,traitors,vaccine damage,vaccine injury,vaccine war,vaccines,Worldview Report", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://biggovernment.news/2022-05-20-pfizer-knew-vaccine-cant-protect-from-covid.html", "encoding": "UTF-8"}, "image": null, "domain": "biggovernment.news", "title": "Worldview Report: Pfizer knew all along its mRNA vaccine can’t protect people from COVID – Brighteon.TV", "cleaned_text": "Worldview Report: Pfizer knew all along its mRNA vaccine can’t protect people from COVID – Brighteon.TV\n\nPfizer knew all along that it’s mRNA vaccine can’t protect people from the Wuhan coronavirus (COVID-19).\n\nRenowned author and journalist Naomi Wolf said that a new batch of Pfizer documents released by the Food and Drug Administration (FDA) includes information about the six-shot regimen initially planned by the pharmaceutical company. Both Pfizer and the FDA were fully aware the two-shot regimen was never going to work.\n\nThey also knew that thousands of people have died from the Pfizer’s COVID-19 vaccine just three months into the vaccination program, the proof of which was included in the first batch of Pfizer documents released by the FDA. That would have been enough to stop the vaccine rollout.\n\nInstead, boosters were introduced and Pfizer’s six-shot regimen now seems like a given. “So, it’s not over yet, ” Wolf warned during her appearance in a podcast hosted by former BlackRock fund manager Edward Down.\n\n“Inevitably, there will be many more deaths and injuries, and people are still being denied informed consent,” Brannon Howse noted in the May 16 episode of his Brighteon.TV program “Worldview Report,” which featured Dowd’s interview of Wolf.\n\nWolf and her team had been tasked to review the documents made public about the Pfizer vaccine. These are the documents that the FDA wanted to keep hidden from the public. The agency was forced to release the documents by a federal judge.\n\nAccording to Wolf, the documents revealed that there are ingredients in the Pfizer vaccine that can do horrible things to the human body, such as propylene glycol and spiked protein. Propylene glycol is used in topical preparations and has not been used in injections.\n\nThe documents also hinted that nanoparticles were supposed to stay at the injection site within 48 hours. Pfizer and Moderna, whose vaccine also uses the mRNA technology, are aware that the nanoparticles and spiked protein go right into the bloodstream and end up in the liver, spleen, adrenals and ovaries. (Related: Lipid nanoparticles in covid jabs “stick” to bodily organs, reveals Pfizer study.)\n\n“This is not only the greatest crime of our era, but it’s a crime that so many, hundreds of government insiders are also complicit,” Wolf said.\n\nSteven Looney, a civil trial and appellate attorney in New Mexico, concluded that Pfizer committed fraud.\n\n“Pfizer knew by February of 2021, that there had been ‘a large number of adverse events‘ in the three months prior,” he said. “In sum, Pfizer did not only apparently commit fraud, but they also compounded the fraud by hiring 2,400 full-time employees to deal with the flood of adverse events that they expected – and yet they told no one about this publicly.”\n\nLooney has volunteered to analyze the Pfizer secret document, together with 250 other lawyers. The latest tranche of documents was released on April 1.\n\nPfizer CEO wants people to take annual COVID shot\n\nThe FDA seems convinced that Pfizer’s original six-shot plan is the best way to protect the population. In late March, the agency gave emergency use authorization for a second booster dose of COVID-19 vaccines for older and immunocompromised individuals.\n\nPfizer CEO Albert Bourla wants to push his luck, suggesting that an annual shot of the COVID-19 vaccine is the best way to go. “A vaccine that will be taken once a year is way easier to administer and we should have the population be compliant with it. We are working on that,” he said.\n\nHe made this suggestion during a press conference set up by the International Federation of Pharmaceutical Manufacturers & Associations (IFPMA) where he talked about the creation of a new COVID vaccine. The Big Pharma executive said that what the world really needs is a vaccine that can last a year. He pointed out that COVID-19 is “very difficult to eradicate.”\n\n“The most likely scenario is that the virus will continue being with us for the years to come,” Bourla said.\n\nMore related stories can be found at BigPharmaNews.com.\n\nWatch the full May 16 episode of “Worldview Report With Brannon Howse” below. Catch new episodes of the program every weeknight starting at 9 p.m. on Brighteon.TV.\n\nWhistleblower: Pfizer vaccine trial data was falsified, participants who experienced adverse effects were ignored.\n\nBioNTech CEO: Third dose of coronavirus vaccine necessary after a year, followed by annual booster shots.", "opengraph": {"title": "Worldview Report: Pfizer knew all along its mRNA vaccine can’t protect people from COVID – Brighteon.TV", "type": "article", "url": "https://www.biggovernment.news/2022-05-20-pfizer-knew-vaccine-cant-protect-from-covid.html", "site_name": "Big Government", "description": "Pfizer knew all along that it’s mRNA vaccine can’t protect people from the Wuhan coronavirus (COVID-19). Renowned author and journalist Naomi Wolf said that a new batch of Pfizer documents released by the Food and Drug Administration (FDA) includes information about the six-shot regimen initially planned by the pharmaceutical company. Both Pfizer and the FDA were fully […]", "image": "https://www.biggovernment.news/wp-content/uploads/sites/59/2022/05/Coronavirus-Covid-19-Pfizer-Vaccine-Syringe-Vial.jpg"}, "tags": ["vaccine injury", "Pfizer", "Big Pharma", "covid-19", "vaccines", "Naomi Wolf", "big government", "traitors", "vaccine damage", "FDA", "Brannon Howse", "Albert Bourla", "lies", "vaccine war", "Worldview Report", "deception", "Brighteon.tv", "pandemic", "pharmaceutical fraud", "conspiracy"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/e9a7a157-4116-43bf-bc5f-bc4f02d72d14", "https://brighteon.tv/", "https://www.reuters.com/legal/government/paramount-importance-judge-orders-fda-hasten-release-pfizer-vaccine-docs-2022-01-07/", "https://naturalnews.com/2022-05-10-lipid-nanoparticles-covid-jabs-stick-bodily-organs.html", "http://corruption.news", "https://dailyclout.io/how-pfizer-covered-up-anticipated-adverse-events/", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-authorizes-second-booster-dose-two-covid-19-vaccines-older-and", "https://fortune.com/2022/03/14/pfizer-covid-vaccine-fourth-dose-booster-ceo-albert-bourla/", "https://www.ifpma.org/resource-centre/global-biopharma-ceo-covid-19-media-briefing-13-april-2022/", "https://bigpharmanews.com/", "https://www.brighteon.com/e9a7a157-4116-43bf-bc5f-bc4f02d72d14", "https://brighteon.tv/", "https://pandemic.news/2021-11-11-pfizer-falsified-trial-data-vaccine-adverse-effects.html", "https://vaccineinjurynews.com/2022-03-07-pfizer-document-covid-vaccines-severe-adverse-reactions.html", "https://naturalnews.com/2021-05-11-biontech-ceo-pfizer-coronavirus-vaccine-booster-shot.html", "https://www.brighteon.com/e9a7a157-4116-43bf-bc5f-bc4f02d72d14", "https://www.reuters.com/legal/government/paramount-importance-judge-orders-fda-hasten-release-pfizer-vaccine-docs-2022-01-07/", "https://dailyclout.io/how-pfizer-covered-up-anticipated-adverse-events/", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-authorizes-second-booster-dose-two-covid-19-vaccines-older-and", "https://fortune.com/2022/03/14/pfizer-covid-vaccine-fourth-dose-booster-ceo-albert-bourla/", "https://www.ifpma.org/resource-centre/global-biopharma-ceo-covid-19-media-briefing-13-april-2022/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fbiggovernment%2F2022-05-20-pfizer-knew-vaccine-cant-protect-from-covid.html&linkname=Worldview%20Report%3A%20Pfizer%20knew%20all%20along%20its%20mRNA%20vaccine%20can%E2%80%99t%20protect%20people%20from%20COVID%20%E2%80%93%20Brighteon.TV", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}