{"result_id": "047008", "URL": "https://biggovernment.news/2021-10-05-woman-arrested-for-not-showing-vaccine-passport.html", "timestamp": "2023-04-25 12:17:23 CEST+0200", "meta": {"description": "In a viral video posted on Facebook, a mother who is visiting a local community center in Ripley, Ontario, is seen being detained by two officers as two children look in horror while another hugs her leg. Her crime? She is not able to show her COVID vaccine passport. An officer is seen informing the woman and the […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,Canada,coronavirus,coronavirus vaccine passport,covid-19,freedom,health freedom,medical fascism,Medical Tyranny,obey,pandemic,vaccine passport,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://biggovernment.news/2021-10-05-woman-arrested-for-not-showing-vaccine-passport.html", "encoding": "UTF-8"}, "image": null, "domain": "biggovernment.news", "title": "Canadian woman arrested after refusing to show a vaccine passport", "cleaned_text": "In a viral video posted on Facebook, a mother who is visiting a local community center in Ripley, Ontario, is seen being detained by two officers as two children look in horror while another hugs her leg. Her crime? She is not able to show her COVID vaccine passport.\n\nAn officer is seen informing the woman and the man filming that the manager of the facility wants them to leave, telling them that they are trespassing.\n\nThe man filming the scene argues that they’re not trespassing because they are taking part in recreational activities at a facility funded by taxpayers. Police officers then proceeded to handcuff the woman and take her into a police vehicle. The man behind the camera claims that he has not been asked for his papers.\n\n“We’re being arrested for participating in skating,” says the man.\n\nIn a later comment, it was found that the police drove the woman in cuffs to the Ripley Public School, issued her a $65 ticket for alleged trespassing and then drove her back to the facility, where they told her she’s been banned.\n\nOntario’s proof-of-vaccination policy took effect mid-September. For businesses, the rules tread into new territory. For instance, workers and employees will be tasked to ask their customers to show proof of immunization against the coronavirus.\n\nCrystal Meikle, a manager at the Queen’s Head pub in east Toronto says: “The pushback is where I get a little nervous. It’s the unknown of how somebody is going to react.”\n\nThe province has outlined its guidelines for businesses who are required to make these vaccination checks. Patrons on dine-in restaurants, nightclubs, gyms, sports facilities and other venues must present receipt of full vaccination and identification, or a doctor’s note for medical exemptions if applicable. (Related: Canada wants to require VACCINE PASSPORTS for Americans crossing the border.)\n\nBefore the implementation of the vaccine mandate on September 22, Ontarians were able to print or download their vaccination receipt online.\n\nOntario is also developing enhanced vaccine certificates with unique QR codes to make the system more secure and convenient to show that a person has been vaccinated. The enhanced vaccine certification and verification app are set to be available by October 22. Ontario’s proof of vaccination guidance will be updated accordingly.\n\nKaleed Rasheed, the associate minister of Digital Government says: “Businesses need a smart, quick and safe solution to verify vaccination. The made-in-Ontario enhanced vaccine certificate for the public and the verification app for businesses are tools to confirm that an individual has been vaccinated while protecting Ontarians’ health data.”\n\nThose that don’t comply with the checks and patrons that refuse to give information may be subjected to fines. Once in full effect, businesses that fail to comply with the vaccine mandate could be fined up to $1,000, while individuals could be fined up to $750. Police forces and the provincial government say that enforcement will be gentle until the policy’s impact starts to play out.\n\nSome Ontario police forces also indicate that while they would respond to safety-related calls regarding threats or violence, they will not actively enforce or check for compliance with the vaccination policy or conduct “routine compliance checks” of the vaccination receipts.\n\nBusinesses have started sorting out how they would assign staff the tasks of checking for immunization status. Venues that sell alcohol are already used to checking IDs, but Meikle says the vaccine receipt requirement may take some getting used to for staff and customers alike.\n\nGet more updates about COVID-19 and vaccine mandates at Pandemic.news.", "opengraph": {"title": "Canadian woman arrested after refusing to show a vaccine passport", "type": "article", "url": "https://www.biggovernment.news/2021-10-05-woman-arrested-for-not-showing-vaccine-passport.html", "site_name": "Big Government", "description": "In a viral video posted on Facebook, a mother who is visiting a local community center in Ripley, Ontario, is seen being detained by two officers as two children look in horror while another hugs her leg. Her crime? She is not able to show her COVID vaccine passport. An officer is seen informing the woman and the […]", "image": "https://www.biggovernment.news/wp-content/uploads/sites/59/2021/10/Car-Drive-Vaccine-Passport.jpg"}, "tags": ["big government", "health freedom", "Medical Tyranny", "Canada", "covid-19", "vaccines", "vaccine wars", "pandemic", "obey", "coronavirus vaccine passport", "medical fascism", "vaccine passport", "freedom", "coronavirus"], "tweets": [], "movies": [], "links": ["https://www.facebook.com/josh.dawson.5243/videos/294799719122941/", "https://www.infowars.com/posts/canadian-police-arrest-mother-in-front-of-crying-children-after-failing-to-show-proof-of-vaccination/", "https://toronto.ctvnews.ca/will-ontario-police-forces-be-actively-enforcing-proof-of-vaccination-1.5591569", "https://www.naturalnews.com/2021-05-06-canada-require-vaccine-passports-border-americans.html", "https://news.ontario.ca/en/release/1000807/ontario-releasing-guidance-to-support-proof-of-vaccination-policy", "https://www.hcamag.com/ca/news/general/vaccine-passports-start-today-what-employers-need-to-know/310842", "http://pandemic.news", "https://www.facebook.com/josh.dawson.5243/videos/294799719122941/", "https://www.infowars.com/posts/canadian-police-arrest-mother-in-front-of-crying-children-after-failing-to-show-proof-of-vaccination/", "https://toronto.ctvnews.ca/will-ontario-police-forces-be-actively-enforcing-proof-of-vaccination-1.5591569", "https://news.ontario.ca/en/release/1000807/ontario-releasing-guidance-to-support-proof-of-vaccination-policy", "https://www.hcamag.com/ca/news/general/vaccine-passports-start-today-what-employers-need-to-know/310842"], "authors": [], "publish_date": null}