{"result_id": "047014", "URL": "https://biggovernment.news/2023-02-20-hundreds-global-orgs-operating-outside-the-law.html", "timestamp": "2023-04-25 12:17:27 CEST+0200", "meta": {"description": "Investigative journalist Corey Lynn revealed that there are hundreds of international organizations operating outside the law. She told Elze Van Hamelen of the Dutch newspaper De Andere Krant that these groups – which include several banks – have been granted diplomatic immunity. This meant that these groups do not fall under any jurisdiction in a […]", "lang": "en", "keywords": "accountability,big government,blanket immunity,conspiracy,Corey Lynn,corruption,De Andere Krant,deception,deep state,Elze Van Hamelen,Globalism,globalist elites,International Organizations Immunities Act,new world order,overlords,Rule by Secrecy,United Nations", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://biggovernment.news/2023-02-20-hundreds-global-orgs-operating-outside-the-law.html", "encoding": "UTF-8"}, "image": null, "domain": "biggovernment.news", "title": "Hundreds of global organizations are operating far outside the law, says investigative journalist Corey Lynn", "cleaned_text": "Hundreds of global organizations are operating far outside the law, says investigative journalist Corey Lynn\n\nInvestigative journalist Corey Lynn revealed that there are hundreds of international organizations operating outside the law.\n\nShe told Elze Van Hamelen of the Dutch newspaper De Andere Krant that these groups – which include several banks – have been granted diplomatic immunity. This meant that these groups do not fall under any jurisdiction in a court of law and they cannot be prosecuted, because everything happens internally – including their own audits.\n\n“Since 1946, hundreds of organizations have been provided with diplomatic immunity, meaning that they are operating completely outside of the law. There are no courts that can claim jurisdiction over their actions,” Van Hamelen said. “Many of these organizations happen to be either key players or major profiteers from the COVID era.”\n\nLynn, who co-hosts the “Dig It” and “The Solution Series” podcasts, added that these organizations have privileges that allow them to travel without going through customs and getting their fingerprints.\n\n“All of their documentation is inviolable. They can’t have their assets seized,” the investigative journalist said. “There’s a whole list we can go through of what these immunities entail for these organizations. It’s pretty staggering.”\n\nAccording to Lynn, those behind the establishment of the United Nations (UN) in 1946 wanted certain international organizations to have immunities in the same manner as diplomats – allowing them to travel to different countries and operate without interference or distraction. (Related: UN claims world hunger is necessary, as governments intentionally cause poverty on a global scale.)\n\nVan Hamelen mentioned the Vatican, the City of London, the Bank of International Settlements (BIS) and vaccine advocacy organization Gavi as possessing this status. But according to Lynn, those groups are just the tip of the iceberg as a total of 76 international organizations were granted immunities, privileges and tax exemptions.\n\nAmerica behind the immunities these international groups enjoy\n\nLynn added that the U.S. was behind the immunities enjoyed by these groups, through the International Organizations Immunities Act (IOIA) passed in 1945. Under this law, the U.S. president can designate organizations with immunities through an executive order. This took effect from the Truman administration up until the Obama administration,\n\nThe IOIA covers every arm of the UN – including the five branches of the World Bank, the Organization of American States and many others. The BIS also has its own sovereign immunities which extend to those who are working with their organization such as insurers and central banks. Lynn added that Gavi, Big Pharma, CERN and the Global Fund are all part of this as well.\n\n“You got the telecommunications, you got the fertilizer, the agriculture, the food, the postal basically everything you need to run a world outside of a system of law, where nothing’s transparent. No one’s accountable all the way down to their personnel and in many cases, their families and their homes. It’s unbelievable. But then at the same time, you’ve got 13 financial institutions and banks in that list of 76,” Lynn stated.\n\nOn top of these 76 organizations, thousands of non-governmental organization or NGOs that work with them or under them are also covered by this blanket immunity.\n\nShe went on to say that the world now has an entire network operating outside the law and people are wondering why they can’t get anywhere or why they can’t go after these people. These organizations, along with the people behind them, can’t be held accountable and they are completely inviolable.\n\nUltimately, the investigative journalist said this is the control framework for the future New World Order rulers where the bankers sit at the top, followed by the UN, World Bank, international organizations and NGOs.\n\nWatch Corey Lynn’s interview with Elze Van Hamelen about the immunities granted to these international organizations that operate outside the law.\n\nThis video is from the Data Dumper channel on Brighteon.com.\n\nWorld Health Organization continues to put mad scientists in charge of global health, promoting medical fascism.\n\nGlobal reset fully underway as 90% of central banks push for digital currency that governments can control.\n\nGAVI Vaccine Alliance: The source of terror behind global lockdowns and vaccine coercion.\n\nThe planned sterilizations of black people is sanctioned by “humanitarian” organizations.", "opengraph": {"title": "Hundreds of global organizations are operating far outside the law, says investigative journalist Corey Lynn", "type": "article", "url": "https://www.biggovernment.news/2023-02-20-hundreds-global-orgs-operating-outside-the-law.html", "site_name": "Big Government", "description": "Investigative journalist Corey Lynn revealed that there are hundreds of international organizations operating outside the law. She told Elze Van Hamelen of the Dutch newspaper De Andere Krant that these groups – which include several banks – have been granted diplomatic immunity. This meant that these groups do not fall under any jurisdiction in a […]", "image": "https://www.biggovernment.news/wp-content/uploads/sites/59/2023/02/1402991039_united-nations-general-assembly.jpg"}, "tags": ["deep state", "big government", "globalist elites", "Rule by Secrecy", "De Andere Krant", "Globalism", "International Organizations Immunities Act", "new world order", "Corey Lynn", "overlords", "deception", "corruption", "United Nations", "accountability", "conspiracy", "Elze Van Hamelen", "blanket immunity"], "tweets": [], "movies": [], "links": ["http://www.brighteon.com/cbf068fc-bba2-4ae1-b80b-9b39fc8ae9b3", "http://gab.com/CoreysDigs", "https://naturalnews.com/2022-07-12-un-claims-world-hunger-is-necessary.html", "http://rulebysecrecy.news", "https://globalism.news", "http://www.brighteon.com/cbf068fc-bba2-4ae1-b80b-9b39fc8ae9b3", "https://www.brighteon.com/channels/datadumper", "https://naturalnews.com/2022-03-24-un-world-bank-funding-taliban-controlled-afghanistan.html", "https://globalism.news/2023-02-13-who-mad-scientists-global-health-medical-fascism.html", "https://naturalnews.com/2022-05-13-global-reset-fully-underway-central-banks-push-digital-currency.html", "https://naturalnews.com/2021-03-23-gavi-vaccine-alliance-the-source-of-terror-vaccine-coercion.html", "https://naturalnews.com/2019-12-31-the-planned-sterilizations-of-black-people-is-sanctioned-by-humanitarian-organizations.html", "https://www.brighteon.com/cbf068fc-bba2-4ae1-b80b-9b39fc8ae9b3", "http://gab.com/CoreysDigs", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fbiggovernment%2F2023-02-20-hundreds-global-orgs-operating-outside-the-law.html&linkname=Hundreds%20of%20global%20organizations%20are%20operating%20far%20outside%20the%20law%2C%20says%20investigative%20journalist%20Corey%20Lynn", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}