{"result_id": "047012", "URL": "https://www.biggovernment.news/2022-06-08-biden-cms-cited-hospitals-noncompliance-vaccine-mandate.html", "timestamp": "2023-04-25 12:17:25 CEST+0200", "meta": {"description": "The Centers for Medicare & Medicaid Services (CMS) has cited 69 hospitals in the United States for failing to comply with the workplace Wuhan coronavirus (COVID-19) vaccine mandate of President Joe Biden’s administration. As part of his administration’s desire to force every American to take the experimental and deadly COVID-19 vaccines, the president directed the Occupational Safety & […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,Centers for Medicare and Medicaid Services,covid-19,health freedom,healthcare,hospital vaccine mandate,hospitals,insanity,medical fascism,medical martial law,Medical Tyranny,pandemic,vaccine mandate,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.biggovernment.news/2022-06-08-biden-cms-cited-hospitals-noncompliance-vaccine-mandate.html", "encoding": "UTF-8"}, "image": null, "domain": "www.biggovernment.news", "title": "Biden’s CMS has cited 69 hospitals for not complying with healthcare worker vaccine mandate", "cleaned_text": "Biden’s CMS has cited 69 hospitals for not complying with healthcare worker vaccine mandate\n\nThe Centers for Medicare & Medicaid Services (CMS) has cited 69 hospitals in the United States for failing to comply with the workplace Wuhan coronavirus (COVID-19) vaccine mandate of President Joe Biden’s administration.\n\nAs part of his administration’s desire to force every American to take the experimental and deadly COVID-19 vaccines, the president directed the Occupational Safety & Health Administration (OSHA) last September to create a vaccine mandate for around 17 million healthcare workers at healthcare institutions that receive Medicare and Medicaid funding. This mandate does not provide an opt-out option for workers willing to submit to regular COVID-19 testing instead. (Related: Biden poised to ROUND UP anti-vaccine doctors and force them into insane asylums.)\n\nBiden’s expansive mandate was rolled back slightly to allow workplaces with 100 or more employees to decide for themselves whether they want to force their employees to get vaccinated. But the vaccine mandate for healthcare workers remained.\n\nThe COVID-19 vaccine mandate was supposed to get healthcare workers vaccinated. But by February of this year, up to one-third of nurses working at some facilities in the country remained unvaccinated.\n\nSixty-nine of these hospitals were cited by CMS for not complying with the agency’s mandate to make sure unvaccinated workers comply with the vaccine mandate or lose their jobs.\n\n“Since the implementation of the COVID-19 healthcare worker vaccine rule, hundreds of surveys of hospitals have taken place, and the majority of hospitals are in compliance with the vaccine requirement,” wrote a CMS spokesperson in an email to journalist Kelly Gooch of Becker’s Hospital Review. “In total, surveyors have made 69 citations of hospitals since the rollout of the requirement, and surveys are still underway. As a reminder, hospitals are one of the 17 provider types included in this rule.”\n\nWhat this email suggests is that other types of healthcare facilities have yet to comply with the mandate, as well. This means there are likely more unvaccinated healthcare workers than either the government or mainstream media outlets may admit.\n\nNoncompliant hospitals could be taken off Medicare and Medicaid\n\nThe spokesperson continued by saying that the goal of CMS is to bring healthcare facilities that receive Medicare and Medicaid funding in compliance with federal government requirements.\n\nCompliance is based on reviews of the facility’s COVID-19 vaccination policies and procedures. CMS also looks at the number of employees who contract COVID-19 and a list of workers provided by the employer, which includes interviews and observations and data regarding their vaccination statuses.\n\nIf healthcare facilities keep refusing to comply with the federal mandate, the facilities could be subject to civil monetary penalties and denial of payment. As a last resort, the facilities could be terminated from the Medicare and Medicaid program for protecting their unvaccinated employees from unemployment.\n\nThe agency noted that the “remedy” for noncompliance is termination.\n\n“CMS’ goal is to bring healthcare facilities into compliance. Termination would generally occur only after providing a facility with an opportunity to make corrections and come into compliance,” said the agency.\n\n“We are holding the health system accountable,” said CMS Chief Operating Officer and Principal Deputy Administrator Jon Blum.\n\nHowever, CMS officials have noted that the fact that the agency has to ensure the compliance of health facilities is a sign of how unprepared the U.S. is to fully enforce its vaccine mandates.\n\n“We’ve been so unprepared for this pandemic from the start,” said Larry Levitt, executive vice president for health policy at the Kaiser Family Foundation. “CMS is not even intended to be a regulator of hospitals in general, let alone during a pandemic.”\n\nTo make up for its shortcomings in enforcing compliance, CMS said earlier in May that it is boosting oversight of hospitals with COVID-19 outbreaks among its staff. The agency added it will release a full year of data on the number of healthcare workers in facilities covered by CMS who are vaccinated against COVID-19 by October of this year.\n\nThe agency is “far from satisfied” with this arrangement, said Blum, but he claimed that CMS has made “tremendous progress” since it received additional funding from the federal government that can go towards surveying infection control at healthcare facilities, particularly nursing homes.\n\nListen to this episode of the “Health Ranger Report” as Mike Adams, the Health Ranger, notes that the systematic, daily medical violence committed against patients by doctors in America is still very widespread.\n\nThis video is from the Health Ranger Report channel on Brighteon.com.\n\nVIOLENCE IN HOSPITALS: Mass shootings barely compare to the medical violence routinely inflicted by many surgeons and doctors.\n\nUtah nurses try to hide cases of fully vaccinated patientscoughing up massive fibrous clots from one of their lungs.\n\nDr. Jane Ruby: Nurses that stayed in hospitals allowed COVID death protocol to remain – Brighteon.TV.\n\nNurse activist: Healthcare workers who supported COVID-19 hospital policies should stand trial for deaths they enabled.\n\nDr. Paul Marik: Hospitals are KILLING COVID-19 patients by refusing to give them life-saving medications.", "opengraph": {"title": "Biden’s CMS has cited 69 hospitals for not complying with healthcare worker vaccine mandate", "type": "article", "url": "https://www.biggovernment.news/2022-06-08-biden-cms-cited-hospitals-noncompliance-vaccine-mandate.html", "site_name": "Big Government", "description": "The Centers for Medicare & Medicaid Services (CMS) has cited 69 hospitals in the United States for failing to comply with the workplace Wuhan coronavirus (COVID-19) vaccine mandate of President Joe Biden’s administration. As part of his administration’s desire to force every American to take the experimental and deadly COVID-19 vaccines, the president directed the Occupational Safety & […]", "image": "https://www.biggovernment.news/wp-content/uploads/sites/59/2022/06/Coronavirus-Doctor-Surgeons-Hospital-Team.jpg"}, "tags": ["Centers for Medicare and Medicaid Services", "hospitals", "big government", "insanity", "health freedom", "Medical Tyranny", "healthcare", "hospital vaccine mandate", "covid-19", "vaccine mandate", "vaccines", "medical martial law", "vaccine wars", "pandemic", "medical fascism"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/news/biden-administration-issues-69-citations-to-hospitals-for-defying-covid-19-vaccine-mandate/", "https://www.naturalnews.com/2022-01-31-biden-round-up-anti-vaccine-doctors-asylums.html", "https://www.beckershospitalreview.com/workforce/cms-has-cited-69-hospitals-for-noncompliance-with-worker-vaccine-mandate.html?origin=BHRE&utm_source=BHRE&utm_medium=email&utm_content=newsletter", "http://medicaltyranny.com", "http://healthfreedom.news", "https://pandemic.news/", "https://www.brighteon.com/0aad0ab6-c75f-4b7a-939b-d0306e13e754", "https://www.brighteon.com/channels/hrreport", "https://www.brighteon.com/channels/hrreport", "https://naturalnews.com/2022-06-02-violence-in-hospitals-mass-shootings-barely-compare-to-medical-violence-surgeons-and-doctors.html", "https://pandemic.news/2022-04-27-fully-vaccinated-patient-coughed-up-fibrous-clots.html", "https://hospitalhomicide.com/2022-03-25-hospital-nurses-allowed-covid-death-protocol.html", "https://www.medicaltyranny.com/2022-03-21-healthcare-workers-face-trials-for-covid-crimes.html", "https://www.hospitalhomicide.com/2022-01-28-hospitals-deliberately-killing-covid-patients.html", "https://www.lifesitenews.com/news/biden-administration-issues-69-citations-to-hospitals-for-defying-covid-19-vaccine-mandate/", "https://www.beckershospitalreview.com/workforce/cms-has-cited-69-hospitals-for-noncompliance-with-worker-vaccine-mandate.html?origin=BHRE&utm_source=BHRE&utm_medium=email&utm_content=newsletter", "https://www.brighteon.com/0aad0ab6-c75f-4b7a-939b-d0306e13e754", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fbiggovernment%2F2022-06-08-biden-cms-cited-hospitals-noncompliance-vaccine-mandate.html&linkname=Biden%E2%80%99s%20CMS%20has%20cited%2069%20hospitals%20for%20not%20complying%20with%20healthcare%20worker%20vaccine%20mandate", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}