{"result_id": "047007", "URL": "https://biggovernment.news/2022-10-14-croatia-mep-vaccine-purchase-biggest-corruption-scandal.html", "timestamp": "2023-04-25 12:17:22 CEST+0200", "meta": {"description": "Croatian Member of the European Parliament (MEP) Mislav Kolakusic blasted the European Union’s purchase of excess Wuhan coronavirus (COVID-19) vaccine doses, calling it the biggest corruption scandal in history. “The purchase of 4.5 billion doses of the COVID-19 vaccine for 450 million EU residents is the biggest corruption scandal in the history of mankind,” he […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,Big Pharma,conspiracy,corruption,covid-19,Dangerous Medicine,deception,drug cartels,European Union,pandemic,Pfizer,pharmaceutical fraud,traitors,Ursula von der Leyen,vaccine,vaccine wars", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://biggovernment.news/2022-10-14-croatia-mep-vaccine-purchase-biggest-corruption-scandal.html", "encoding": "UTF-8"}, "image": null, "domain": "biggovernment.news", "title": "Croatian MEP Kolakusic: EU’s purchase of excess COVID-19 vaccine doses is “biggest corruption scandal in history”", "cleaned_text": "Croatian MEP Kolakusic: EU’s purchase of excess COVID-19 vaccine doses is “biggest corruption scandal in history”\n\nCroatian Member of the European Parliament (MEP) Mislav Kolakusic blasted the European Union’s purchase of excess Wuhan coronavirus (COVID-19) vaccine doses, calling it the biggest corruption scandal in history.\n\n“The purchase of 4.5 billion doses of the COVID-19 vaccine for 450 million EU residents is the biggest corruption scandal in the history of mankind,” he said in a video posted on his Twitter Wednesday, Oct. 12. Kolakusic directed his message at Ursula von der Leyen, the president of the European Commission, whom he dubbed as “Mrs. 4.5 Billion Doses.”\n\nAccording to the MEP, von der Leyen refused to disclose communications surrounding the EU’s purchase of Pfizer COVID-19 vaccine doses to him and other federal lawmakers.\n\n“Ten of us MEPs asked her the following question: When will she present to us, the members of the European Parliament, as well as the EU citizens whom she supposedly represents, the communication she had with Pfizer during the procurement of 4.5 billion doses of vaccines at a time when there was absolutely no proof of the effectiveness, and especially not of the harmfulness of that product?” Kolakusic said.\n\n“Imagine – four and a half billion doses for 450 million people. [The U.K.] is no longer with us, so there are quite a few of us. Based on that calculation – each child, newly born, should receive ten doses of something that no one in the world, except maybe two or three people, knows what it contains.”\n\nKolakusic commented that the deal between Pfizer and von der Leyen was all about “secrets” and “protected patents,” adding: “Don’t think that any kind of government or European agency knows exactly what is in that product. Nobody knows that, and nobody tells you that.”\n\nHe further pointed out that the COVID-19 vaccine was approved “just based on the statements of the pharmaceutical companies,” without any medical research to back up the approval.\n\n“To date, no medical research has been handed over to the members of the EU Parliament’s COVID committee or the European Medicines Agency. How is that possible? We are talking about corruption here,” said Kolakusic.\n\n“The procurement of 4.5 billion [vaccine doses] with the intention of injecting them into people, without anyone knowing what is inside, is surely the biggest corruption affair in the history of mankind, not only in the history of the EU.” (Related: European Parliament member says EU over-purchase of COVID jabs equates to “biggest corruption scandal in the history of mankind.”)\n\nThe Croatian MEP, formerly a judge in his home country, earlier compared COVID-19 vaccine makers to members of an “unscrupulous mafia.”\n\nDuring a session of the European Parliament in February 2022, Kolakusic warned his fellow MEPs about the emergence of “powerful, unscrupulous mafia-pandemic profiteers who are more dangerous than all previous forms of organized crime.”\n\n“We are dealing with a mafia that uses the media, instead of weapons, for a fear campaign to sell billions of its products. Over the past year, virtually all mainstream media in Europe and worldwide have been spreading misinformation and publishing falsehoods.”\n\nThe source of the misinformation, according to Kolakusic, is the COVID-19 vaccine makers that aim to sell several billions of their products annually by propagating fear campaigns.\n\n“There is no end to this fear campaign because they earn tens of billions a year. They are organized, spread fear and influence policymakers.”\n\nKolakusic also pointed his finger at von der Leyen, blaming her COVID-19 policies for dividing citizens and violating their rights.\n\n“Fundamental human rights have never been more seriously violated in the past 80 years since Nazism – freedom to travel, the right to work, health care and the right to ban medical experiments performed on more than 500 million people,” he said, emphasizing that “every citizen has the right to self-determination.”\n\nMoreover, the Croatian MEP also blasted vaccine passports. “The vaccination certificates that only allow the vaccinated to travel freely – while spreading the virus just as easily as the unvaccinated – are insane,” he said.\n\n“Tens of thousands of citizens have died from the side effects of vaccines. Mandatory vaccinations represent the death penalty and will result in the execution of many citizens.”\n\nWatch Croatian MEP Mislav Kolakusic blast the EU’s purchase of COVID-19 vaccine doses below.\n\nThis video is from the Prevent Global Genocide channel on Brighteon.com.\n\nWHO Pandemic Treaty will take away government oversight in the event of another pandemic, German MEP says.\n\nRomanian lawmaker GRILLS Big Pharma executives over lack of accountability for dangerous COVID-19 vaccines.\n\nMembers of European Parliament push back hard against vaccine mandates and safety passports.", "opengraph": {"title": "Croatian MEP Kolakusic: EU’s purchase of excess COVID-19 vaccine doses is “biggest corruption scandal in history”", "type": "article", "url": "https://www.biggovernment.news/2022-10-14-croatia-mep-vaccine-purchase-biggest-corruption-scandal.html", "site_name": "Big Government", "description": "Croatian Member of the European Parliament (MEP) Mislav Kolakusic blasted the European Union’s purchase of excess Wuhan coronavirus (COVID-19) vaccine doses, calling it the biggest corruption scandal in history. “The purchase of 4.5 billion doses of the COVID-19 vaccine for 450 million EU residents is the biggest corruption scandal in the history of mankind,” he […]", "image": "https://www.biggovernment.news/wp-content/uploads/sites/59/2022/10/facebook-oped-66.jpg"}, "tags": ["big government", "European Union", "drug cartels", "Big Pharma", "Pfizer", "covid-19", "deception", "corruption", "Ursula von der Leyen", "vaccine", "vaccine wars", "pandemic", "traitors", "pharmaceutical fraud", "conspiracy"], "tweets": [], "movies": [], "links": ["https://rairfoundation.com/breaking-mep-calls-eu-covid-vaccine-purchases-biggest-corruption-scandal-in-the-history-of-mankind/", "https://twitter.com/mislavkolakusic/status/1580132343758540800", "http://corruption.news", "https://www.naturalnews.com/2022-10-14-covid-jab-over-purchase-biggest-corruption-scandal.html", "https://rairfoundation.com/mep-compares-covid-vaccine-makers-to-unscrupulous-mafia-video/", "https://vaccinedeaths.com", "https://www.brighteon.com/08d75876-8b3c-43ad-917a-dbb4eba8d172", "https://www.brighteon.com/channels/nuremberg", "https://globalism.news/2022-05-12-who-pandemic-treaty-takes-away-government-involvement.html", "https://bigpharmanews.com/2022-09-09-romanian-lawmaker-grills-big-pharma-execs-vaccines.html", "https://resist.news/2021-11-04-eu-parliament-members-push-back-against-vaccine-mandates.html", "https://genocide.news/2022-02-02-croatian-politician-mandatory-covid-vaccination-death-penalty.html", "https://vaccinedeaths.com/2021-12-03-german-mep-when-will-vaccine-deaths-counted.html", "https://rairfoundation.com/breaking-mep-calls-eu-covid-vaccine-purchases-biggest-corruption-scandal-in-the-history-of-mankind/", "https://twitter.com/mislavkolakusic/status/1580132343758540800", "https://rairfoundation.com/mep-compares-covid-vaccine-makers-to-unscrupulous-mafia-video/", "https://www.brighteon.com/08d75876-8b3c-43ad-917a-dbb4eba8d172", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fbiggovernment%2F2022-10-14-croatia-mep-vaccine-purchase-biggest-corruption-scandal.html&linkname=Croatian%20MEP%20Kolakusic%3A%20EU%E2%80%99s%20purchase%20of%20excess%20COVID-19%20vaccine%20doses%20is%20%E2%80%9Cbiggest%20corruption%20scandal%20in%20history%E2%80%9D", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}