{"result_id": "047031", "URL": "https://biggovernment.news/2022-01-04-cdc-sued-for-hiding-covid-vaccine-safety-data.html", "timestamp": "2023-04-25 12:17:37 CEST+0200", "meta": {"description": "Nonprofit organization Informed Consent Action Network (ICAN), an advocate for full transparency of the medical products’ safety and efficacy, filed a lawsuit against the U.S. Center for Disease Control and Prevention (CDC) and its parent entity, the Department of Health and Human Services (HHS), for their refusal to make public the post-licensure safety data of Wuhan coronavirus (COVID-19) vaccines. The lawsuit was […]", "lang": "en", "keywords": "badhealth,badmedicine,badscience,Big Pharma,CDC,conspiracy,coronavirus,corruption,covid-19,Dangerous Medicine,deception,FDA,foia,pandemic,pharmaceutical fraud,V-safe,vaccine damage,Vaccine injuries,vaccine wars,vaccines,VAERS", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://biggovernment.news/2022-01-04-cdc-sued-for-hiding-covid-vaccine-safety-data.html", "encoding": "UTF-8"}, "image": null, "domain": "biggovernment.news", "title": "CDC sued for hiding COVID vaccine safety data", "cleaned_text": "Nonprofit organization Informed Consent Action Network (ICAN), an advocate for full transparency of the medical products’ safety and efficacy, filed a lawsuit against the U.S. Center for Disease Control and Prevention (CDC) and its parent entity, the Department of Health and Human Services (HHS), for their refusal to make public the post-licensure safety data of Wuhan coronavirus (COVID-19) vaccines.\n\nThe lawsuit was filed after the agency turned down three Freedom of Information Act (FOIA) requests to publish reports, submitted through the CDC’s “V-Safe” system.\n\nThe “V-Safe” is a smartphone application that uses text messaging and web surveys to give “personalized health check-ins” after a person receives a COVID shot. The “V-Safe” app is also supposed to allow individuals to report to the CDC if they have any side effects after getting a COVID-19 vaccine in “near real-time.” The system is supposed to be so effective that the agency said that depending on reports’ specifics, representatives may call to check on a vaccine recipient to collect more information.\n\nThe system was created because the CDC said that the Vaccine Adverse Effects Reaction System (VAERS) is not capable of determining causation, making it unreliable. At the same time, the agency noted that the COVID-19 vaccines are being administered under intensive vaccine safety monitoring efforts in the United States.\n\nHowever, it seems that the CDC wants to keep secret the adverse reactions and corresponding numbers that have been reported through the app. In response to ICAN’s FOIA requests, the agency refused to report the safety data under the pretext that such information is not deidentified, or that it includes personal health information. (Related: California bill would require state to post links to vaccine injury reporting and vaccine injury compensation.)\n\nDe-identified data does exist. The CDC relies on private data company Oracle to collect, manage and house the data, as stated in its own document. The document indicates that as per Oracle’s internal policies, staff will not be able to view any individualized survey data, including those with personally identifiable information (PII). Instead, they will gain access to aggregate unidentifiable data for reporting.\n\nICAN is pushing for the CDC to produce the unidentified data in the same form that Oracle can access, but the agency has closed that inquiry. ICAN noted that the federal government is not only failing to comply with the FOIA, but also failing to provide the transparency necessary to earn people’s trust regarding the vaccines.\n\nThe nonprofit organization emphasized that the public deserves to have all information necessary regarding the vaccines that are being mandated, as many Americans are under threat of losing their jobs, being excluded from school and not being allowed to participate in society.\n\nNew York, Washington D.C., Chicago, Los Angeles, Boston and Seattle, among others, have already put such laws into place.\n\nIndividuals who get injured by the vaccines will not be able to hold the pharmaceutical companies accountable because the federal government has given them and others associated with administering the shots legal immunity for any injuries that the vaccines may cost. Moreover, the vaccine manufacturers are immune from liability for willful misconduct unless the government brings this claim first.\n\nICAN stated in the lawsuit that comprehensive knowledge of vaccine safety is important for the public and that the government should remain transparent about the data. It stressed that locking out independent scientists from addressing the issues is dangerous, irresponsible, unethical and illegal.\n\nThe CDC is not the first government agency to be sued over documents associated with vaccine safety. The Food and Drug Administration (FDA) was also previously sued for over 400,000 pages of information regarding Pfizer’s COVID-19 vaccine.\n\nWatch the video below to learn more about the government’s COVID reporting system.\n\nThis video is from the “What is Happening” channel on Brighteon.com.\n\nGet more news and updates about COVID-19 vaccine and its adverse effects at Pandemic.news.", "opengraph": {"title": "CDC sued for hiding COVID vaccine safety data", "type": "article", "url": "https://www.biggovernment.news/2022-01-04-cdc-sued-for-hiding-covid-vaccine-safety-data.html", "site_name": "Big Government", "description": "Nonprofit organization Informed Consent Action Network (ICAN), an advocate for full transparency of the medical products’ safety and efficacy, filed a lawsuit against the U.S. Center for Disease Control and Prevention (CDC) and its parent entity, the Department of Health and Human Services (HHS), for their refusal to make public the post-licensure safety data of Wuhan coronavirus (COVID-19) vaccines. The lawsuit was […]", "image": "https://www.biggovernment.news/wp-content/uploads/sites/59/2022/01/CDC-Vaccine-Coronavirus-Syringe.jpg"}, "tags": ["Vaccine injuries", "CDC", "V-safe", "Big Pharma", "FDA", "vaccine damage", "covid-19", "deception", "corruption", "vaccines", "vaccine wars", "foia", "pandemic", "pharmaceutical fraud", "conspiracy", "VAERS", "coronavirus"], "tweets": [], "movies": [], "links": ["https://thenewamerican.com/cdc-sued-for-hiding-covid-vax-post-licensure-safety-data/", "https://naturalnews.com/055211_vaccine_injuries_California_proposed_law.html", "https://news.yahoo.com/cdc-sued-vaccine-safety-app-192649881.html", "https://www.brighteon.com/d66038c9-3ebd-453a-ad24-8d01c5aee19e", "https://www.brighteon.com/channels/annaka", "https://www.brighteon.com/channels/annaka", "https://thenewamerican.com/cdc-sued-for-hiding-covid-vax-post-licensure-safety-data/", "https://news.yahoo.com/cdc-sued-vaccine-safety-app-192649881.html"], "authors": [], "publish_date": null}