{"result_id": "047022", "URL": "https://biggovernment.news/2022-04-19-covid-pandemic-is-dna-war-against-humanity.html", "timestamp": "2023-04-25 12:17:31 CEST+0200", "meta": {"description": "Dr. Lee Merritt thinks the Wuhan coronavirus (COVID-19) pandemic is a DNA war against humanity. You need to resist in order to survive. “We should not give up access to our bodies to the COVID beast,” said Merritt during the the April 13 episode of “Merritt Medical Hour,” noting that the virus gets into the human […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,Big Pharma,bioweapons,Brighteon.tv,conspiracy,corruption,crimes against humanity,deception,DNA war,health freedom,Lee Merritt,medical fascism,Medical Tyranny,Merritt Medical Hour,pharmaceutical fraud,slavery,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://biggovernment.news/2022-04-19-covid-pandemic-is-dna-war-against-humanity.html", "encoding": "UTF-8"}, "image": null, "domain": "biggovernment.news", "title": "Dr. Lee Merritt: COVID-19 is a DNA war against humanity – Brighteon.TV", "cleaned_text": "Dr. Lee Merritt thinks the Wuhan coronavirus (COVID-19) pandemic is a DNA war against humanity. You need to resist in order to survive.\n\n“We should not give up access to our bodies to the COVID beast,” said Merritt during the the April 13 episode of “Merritt Medical Hour,” noting that the virus gets into the human nucleus, which eventually changes the DNA structure of the body.\n\nAccording to Merritt, the SARS-CoV-2 virus is a genetically engineered bioweapon and vaccination dramatically increases the risk of death from COVID. She said the entire pandemic is a vast global conspiracy for the government to exert social control.\n\n“I don’t think we can vote ourselves out of this. We’re going to have to prepare, protect ourselves and maybe fight our way out of this,” she said. (Related: Dr. Lee Merritt: We are in the fourth stage of the DNA WAR against humanity.)\n\nMerritt, former president of the Association of American Physicians and Surgeons, wrote an op-ed back in 2015 criticizing the Obama administration’s National Adult Immunization Plan.\n\n“You cannot scream for a ‘woman’s right to choose’ when it applies to abortion, but give her no right to choose what gets administered to her in a syringe. Let me be clear: Public health does not trump individual liberty. End of story,” she wrote at the time.\n\nMerritt noted that vaccinated individuals can’t get unvaccinated, even if they decide to refuse further vaccinations. But said there are several ways to address the spike protein injected in the body. Ivermectin, hyperbaric oxygen therapy, chelation and intravenous glutathione are some of the things she mentioned.\n\n“We’re in a situation where [it’s] kind of the calm before the storm. We’re seeing the dying, but we don’t have a sense of what they would say the ‘first derivative of dying.’ In other words, we don’t know how rapidly the death rate is changing,” Merritt said.\n\nShe also pointed to a “marked, unprecedented increase” in all-cause mortality due to the COVID-19 vaccines, citing data from the U.S. and the U.K, and mentioning stillbirths, miscarriages and infertility as some of the issues linked to the COVID-19 shots.\n\nCOVID vaccine rollout is all about money\n\nThe rollout of COVID-19 vaccines is all about the money it will bring to Big Pharma companies and their cohorts.\n\nMerritt said there is a lot of evidence for ivermectin and other drugs being an effective treatment for COVID-19, so it does not make sense for the government to stop pharmacies from dispensing them.\n\n“This [COVID-19 vaccine] is really experimental stuff, and they cannot do this if there’s an available treatment. And they have to take down this whole treatment program to get you to take the vaccine,” she said. (Related: Dr. Lee Merritt: Mask wearing was never about controlling the virus.)\n\n“They had to do it quickly under EUA [emergency use authorization] because it allows them to put out a vaccine or a drug that’s critical to the well-being of people without telling what’s in it legally.”\n\nWith EUA-approved vaccines having an extraordinary liability shield under the 2005 Public Readiness and Preparedness Act, vaccine manufacturers, distributors, providers and others are safe from liability. Moreover, Merritt believes that the vaccine isn’t designed to protect people at all.\n\nShe referred to OneAmerica CEO Scott Davison, who heads a $100 billion life insurance and retirement company in Indianapolis. Davison previously said that they are now seeing the highest death rates ever in the history of their business. “We’ve never seen an increase in all-cause mortality, as we did in 2021 – [a] 40 percent increase in working-age people between 18 and 64,” he said.\n\nTo illustrate how severe the current death rate is, Davison said a one in 200-year catastrophe would likely only cause a 10 percent increase over pre-pandemic deaths.\n\nFollow Pandemic.news for news related to the COVID-19 pandemic.\n\nWatch the full April 13 episode of “Merritt Medical Hour” below. Catch new episodes of the program every Wednesdays at 7-8 p.m. on Brighteon.TV.\n\nDrs. Bryan Ardis and Lee Merritt talk about the coronavirus as a depopulation tool – Brighteon.TV.\n\nDr. Lee Merritt: No justification for experimenting on children by injecting them with COVID-19 vaccines – Brighteon.TV.\n\nVirus that causes COVID-19 has NEVER been isolated in a lab – Drs Lee Merritt and Tom Cowan explain.\n\nNew interviews with Dr. Lee Merritt, Dr. Chris Shaw and Reiner Fuellmich reveal astonishing information about vaccine crimes against humanity.", "opengraph": {"title": "Dr. Lee Merritt: COVID-19 is a DNA war against humanity – Brighteon.TV", "type": "article", "url": "https://www.biggovernment.news/2022-04-19-covid-pandemic-is-dna-war-against-humanity.html", "site_name": "Big Government", "description": "Dr. Lee Merritt thinks the Wuhan coronavirus (COVID-19) pandemic is a DNA war against humanity. You need to resist in order to survive. “We should not give up access to our bodies to the COVID beast,” said Merritt during the the April 13 episode of “Merritt Medical Hour,” noting that the virus gets into the human […]", "image": "https://www.biggovernment.news/wp-content/uploads/sites/59/2022/04/Coronavirus-DNA-Science.jpg"}, "tags": ["big government", "slavery", "health freedom", "Medical Tyranny", "bioweapons", "DNA war", "Big Pharma", "Merritt Medical Hour", "pharmaceutical fraud", "deception", "Brighteon.tv", "corruption", "Lee Merritt", "vaccine wars", "vaccines", "crimes against humanity", "conspiracy", "medical fascism"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/ddc56648-eeac-475f-91fe-ddb0dff74df6", "http://enslaved.news", "https://naturalnews.com/2022-04-07-lee-merritt-fourth-stage-dna-war-humanity.html", "http://healthfreedom.news/", "https://thehill.com/changing-america/well-being/longevity/588738-huge-huge-numbers-death-rates-up-40-percent-over-pre/", "https://naturalnews.com/2022-01-21-mask-wearing-never-about-viral-control.html", "http://Pandemic.news", "https://www.brighteon.com/ddc56648-eeac-475f-91fe-ddb0dff74df6", "https://brighteon.tv/", "https://pandemic.news/2021-10-13-bryan-ardis-lee-merritt-coronavirus-depopulation-tool.html", "https://pandemic.news/2021-11-12-no-justification-experimenting-on-children-covid-vaccines.html", "https://pandemic.news/2022-03-08-putin-great-magician-dna-war-against-humanity.html", "https://pandemic.news/2022-02-07-covid-virus-never-been-isolated-in-lab.html", "https://pandemic.news/2021-08-22-interviews-with-dr-lee-merritt-chris-shaw-reiner-fuellmich-vaccine-crimes-against-humanity.html", "https://www.brighteon.com/ddc56648-eeac-475f-91fe-ddb0dff74df6", "https://thehill.com/changing-america/well-being/longevity/588738-huge-huge-numbers-death-rates-up-40-percent-over-pre/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fbiggovernment%2F2022-04-19-covid-pandemic-is-dna-war-against-humanity.html&linkname=Dr.%20Lee%20Merritt%3A%20COVID-19%20is%20a%20DNA%20war%20against%20humanity%20%E2%80%93%20Brighteon.TV", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}