{"result_id": "047003", "URL": "https://www.biggovernment.news/2022-01-20-austria-approves-plan-to-fine-unvaccinated-citizens.html", "timestamp": "2023-04-25 12:17:19 CEST+0200", "meta": {"description": "The Austrian government has approved a proposal to fine unvaccinated citizens who continue to refuse vaccination. Vienna announced details of the new proposal back in December 2021. Citizens turning down the Wuhan coronavirus (COVID-19) vaccine will face fines of up to €3,600 ($4,110) every three months. This equates to a monthly penalty of €1,200 ($1,370). However, Health […]", "lang": "en", "keywords": "Austria,badhealth,badmedicine,big government,covid-19,extremism,health freedom,insanity,Liberty,medical fascism,medical martial law,Medical Tyranny,monthly fines,pandemic,Resist,revolt,vaccine,vaccine mandate", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.biggovernment.news/2022-01-20-austria-approves-plan-to-fine-unvaccinated-citizens.html", "encoding": "UTF-8"}, "image": null, "domain": "www.biggovernment.news", "title": "Austrian government approves plan to impose heavy fines on unvaccinated citizens", "cleaned_text": "The Austrian government has approved a proposal to fine unvaccinated citizens who continue to refuse vaccination. Vienna announced details of the new proposal back in December 2021.\n\nCitizens turning down the Wuhan coronavirus (COVID-19) vaccine will face fines of up to €3,600 ($4,110) every three months. This equates to a monthly penalty of €1,200 ($1,370). However, Health Minister Wolfgang Mueckstein said officials can impose a smaller €600 fine ($685) as an alternative.\n\nChancellor Karl Nehammer said on Sunday, Jan. 16, that this proposal would be implemented “as planned” beginning February 2022.\n\nHe explained that February 2022 would serve as a “transition period” in order to give unvaccinated Austrians more time to “be persuaded” to get the COVID-19 vaccine. The chancellor added that “more information will be made available to them” for this purpose.\n\nAccording to Nehammer, the measure will be carried out in three phases following the transition period. In the first phase, which is set to start in mid-March 2022, health authorities in the country will start checking the vaccination status of all Austrians 18 years old and up.\n\nThe measure will then proceed to the second phase “if the progress of the vaccination rate is still not sufficient.” Unvaccinated Austrians will be sent a “reminder letter” to get injected with the COVID-19 vaccine, with the €3,600 ($4,110) fine to be imposed every three months. (Related: Austrians who refuse COVID vaccines to face MONTHLY fines under new law.)\n\nIn the third phase, Austrians who remain adamant in turning down the shot would receive a letter with a vaccination appointment. Non-compliance and refusal to attend to the vaccination appointment will merit additional fines. “[In the] best case scenario, we won’t even need this third phase,” Nehammer told reporters.\n\nThe measure will apply to all adults living in Austria, but those granted a medical exemption to vaccination will be exempt. Any fines or legal action against Austrians notified by the authorities would be dropped upon showing proof of vaccination within two weeks of being informed.\n\nHowever, Vienna’s proposal to penalize unvaccinated Austrians faced opposition from the citizens themselves. More than 20,000 people marched on the streets of the capital on Jan. 15, a day before Nehammer announced the plan’s approval. The Austrian government also received more than 100,000 comments from citizens opposing the plan during a public consultation.\n\nMembers of Austrian law enforcement also expressed disagreement with the plan to punish the unvaccinated through a letter signed by more than 600 police officers. The letter sent to Interior Minister Gerhard Karner said a significant part of the Austrian Federal Police sides with the health freedom protesters against compulsory vaccination.\n\nNehammer defended his decision to approve the proposal in spite of the opposition.\n\nAustrian Minister for the European Union and the Constitution Karoline Edtstadler also defended the measure.\n\n“There are still well over a million Austrians who aren’t vaccinated, [and] that is too many. We sill have an obligation and a need to increase vaccination coverage so that we don’t go from lockdown to lockdown,” she said.\n\n“I say very clearly that we don’t want to punish the people who aren’t vaccinated. We want to bring them along … [and] convince them of this vaccination. We want them to show solidarity with everyone so that we can regain our freedom.” (Related: Austria has practically made it ILLEGAL for people to exist without getting COVID-19 vaccines.)\n\nWatch the video below of Leah and Michelle Svensson, the Resistance Chicks, talking about Austria’s plan to punish unvaccinated citizens.\n\nThis video is from the BrighteonTV channel on Brighteon.com.\n\nMedicalTyranny.com has more stories about governments waging war against the unvaccinated.", "opengraph": {"title": "Austrian government approves plan to impose heavy fines on unvaccinated citizens", "type": "article", "url": "https://www.biggovernment.news/2022-01-20-austria-approves-plan-to-fine-unvaccinated-citizens.html", "site_name": "Big Government", "description": "The Austrian government has approved a proposal to fine unvaccinated citizens who continue to refuse vaccination. Vienna announced details of the new proposal back in December 2021. Citizens turning down the Wuhan coronavirus (COVID-19) vaccine will face fines of up to €3,600 ($4,110) every three months. This equates to a monthly penalty of €1,200 ($1,370). However, Health […]", "image": "https://www.biggovernment.news/wp-content/uploads/sites/59/2022/01/Coronavirus-Covid-19-No-Vaccine-Concept-Protest-Hands.jpg"}, "tags": ["insanity", "big government", "health freedom", "Medical Tyranny", "revolt", "extremism", "covid-19", "vaccine mandate", "Resist", "Austria", "medical martial law", "pandemic", "Liberty", "vaccine", "medical fascism", "monthly fines"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/news/austrian-govt-moves-forward-with-covid-vaccine-mandate-despite-massive-protests/", "https://www.dailymail.co.uk/news/article-10297391/Austrians-aged-14-refuse-Covid-vaccines-fined-1-000-month.html", "https://www.naturalnews.com/2021-12-13-unvaccinated-austrians-to-face-monthly-fines.html", "https://www.bloomberg.com/news/articles/2022-01-16/austria-to-start-fines-for-unvaccinated-in-march-nehammer-says?sref=jB82HHlm", "https://www.naturalnews.com/2021-12-23-austria-illegal-people-exist-without-covid-vaccine.html", "https://www.brighteon.com/f39ff0bd-8a8b-4ec8-ae30-873397b7d13c", "https://www.brighteon.com/channels/brighteontv", "https://www.brighteon.com/channels/brighteontv", "http://medicaltyranny.com", "https://www.lifesitenews.com/news/austrian-govt-moves-forward-with-covid-vaccine-mandate-despite-massive-protests/", "https://www.dailymail.co.uk/news/article-10297391/Austrians-aged-14-refuse-Covid-vaccines-fined-1-000-month.html", "https://www.bloomberg.com/news/articles/2022-01-16/austria-to-start-fines-for-unvaccinated-in-march-nehammer-says?sref=jB82HHlm", "https://www.brighteon.com/f39ff0bd-8a8b-4ec8-ae30-873397b7d13c"], "authors": [], "publish_date": null}