{"result_id": "047033", "URL": "https://biggovernment.news/2022-01-28-california-legislators-pan-force-schoolchildren-vaccinated-covid.html", "timestamp": "2023-04-25 12:17:38 CEST+0200", "meta": {"description": "The rulers of California are pushing a new bill that would force all schoolchildren in the state to get “vaccinated” for the Wuhan coronavirus (Covid-19). Spearheaded by the infamous vaccine lover Richard Pan, a Democrat, the legislation would add Fauci Flu shots to California’s list of required injections for attending K-12 schools, a move that […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,California,COVID,democrats,insanity,lunatics,medical extremism,medical fascism,Medical Tyranny,obey,Plandemic,richard pan,schoolchildren,traitors,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://biggovernment.news/2022-01-28-california-legislators-pan-force-schoolchildren-vaccinated-covid.html", "encoding": "UTF-8"}, "image": null, "domain": "biggovernment.news", "title": "California legislators, including Richard Pan, trying to force all schoolchildren to get “vaccinated” for covid", "cleaned_text": "California legislators, including Richard Pan, trying to force all schoolchildren to get “vaccinated” for covid\n\nThe rulers of California are pushing a new bill that would force all schoolchildren in the state to get “vaccinated” for the Wuhan coronavirus (Covid-19).\n\nSpearheaded by the infamous vaccine lover Richard Pan, a Democrat, the legislation would add Fauci Flu shots to California’s list of required injections for attending K-12 schools, a move that would override Gov. Gavin Newsom’s scaled-back mandate issued last year.\n\nCurrently, students attending both public and private schools in the Golden State are required to get jabbed with a lengthy list of needles (unless they present a valid exemption, which is difficult to get there) in order to receive an education. That list could soon include spike protein injections.\n\nThe Newsom mandate, by the way, which was decreed back in October, does not take effect until after the U.S. Food and Drug Administration (FDA) fully approves the shots for children ages 12 and over.\n\n“Pan’s bill will go much further than Newsom’s mandate, starting with requiring all students from kindergarten through 12th grade to be vaccinated against COVID-19 beginning Jan. 1,” the Los Angeles Times reported.\n\nDemocrats want to eliminate your right to just say no to covid vaccination\n\nSenate Bill 871, as it is called, would supplant Newsom’s mandate and set it in stone legislatively. It could not simply be rescinded by Newsom’s successor through executive order.\n\nThat is what makes this bill so dangerous: It would be permanent, unless the legislature ever voted to end it. This is an unlikely possibility if it gets passed now.\n\n“Under the bill, the California Department of Public Health could mandate vaccines in the future without requiring the state to offer personal belief exemptions, a move that would make it easier to add COVID-19 boosters or other immunizations for students without a lengthy legislative process,” the Times further reported.\n\nIn a statement, Pan alleged that the proposed mandate is necessary to ensure that schools are “safe,” and that all parents feel “comfortable sending their children to school.”\n\n“And we want to keep schools open,” Pan further threatened, insinuating that schools will once again close if not everyone agrees to get jabbed.\n\nPan, by the way, publicly announced last spring that he believes covid vaccine refusers should be regarded as “domestic terrorists.”\n\nIt is “extremism,” in his view, for anyone to refuse the shots under any circumstances because everyone supposedly needs to get injected in order to stop the spread.\n\nPan’s bill is the second major vaccine proposal to be announced this year by Democratic lawmakers in California. Sen. Scott Wiener of San Francisco previously introduced Senate Bill 866, which would allow children 12 years of age and older to get injected without parental consent or knowledge.\n\nTogether, these two bills would open wide the floodgates for children and babies to be medically raped by the state. This is what the Democrats want, by the way: forced medical rape in the name of “public health.”\n\n“Given the fact that countries around the world are dropping restrictions, eschewing mandates, and accepting that COVID is becoming endemic, Sen. Pan’s new bill shows just how out of touch he is, both scientifically and politically,” warned Stefanie Fetzer, founder of Parents United 4 Kids, an advocacy group for parental choice.\n\n“California parents don’t want the state making parenting decisions for them.”\n\nIf Pan’s bill fails and the jabs do end up receiving approval for children and babies, parents would still have the option to sidestep Newsom’s edict by claiming a personal exemption.\n\n“The state must offer broader personal belief exemptions for any newly required vaccine unless it is added through a new law to the list of shots students must receive to attend school in California,” the Times says.\n\nMore news on Fauci Flu shot tyranny can be found at Fascism.news.", "opengraph": {"title": "California legislators, including Richard Pan, trying to force all schoolchildren to get “vaccinated” for covid", "type": "article", "url": "https://www.biggovernment.news/2022-01-28-california-legislators-pan-force-schoolchildren-vaccinated-covid.html", "site_name": "Big Government", "description": "The rulers of California are pushing a new bill that would force all schoolchildren in the state to get “vaccinated” for the Wuhan coronavirus (Covid-19). Spearheaded by the infamous vaccine lover Richard Pan, a Democrat, the legislation would add Fauci Flu shots to California’s list of required injections for attending K-12 schools, a move that […]", "image": "https://www.biggovernment.news/wp-content/uploads/sites/59/2022/01/Children-School-Pandemic-Mask-Hand-Sanitizer.jpg"}, "tags": ["insanity", "big government", "Plandemic", "democrats", "Medical Tyranny", "lunatics", "vaccines", "California", "medical extremism", "richard pan", "schoolchildren", "traitors", "obey", "vaccine wars", "medical fascism", "COVID"], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/defender/bb-all-california-schoolchildren-must-be-vaccinated-against-covid-under-new-bill/", "https://www.latimes.com/california/story/2022-01-24/new-vaccine-legislation-california-schoolchildren-mandate", "https://naturalnews.com/2021-03-09-richard-pan-refuse-coronavirus-vaccines-domestic-terrorists.html", "http://fascism.news", "https://childrenshealthdefense.org/defender/bb-all-california-schoolchildren-must-be-vaccinated-against-covid-under-new-bill/", "https://naturalnews.com/2021-03-09-richard-pan-refuse-coronavirus-vaccines-domestic-terrorists.html", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}