{"result_id": "047030", "URL": "https://biggovernment.news/2022-11-06-white-house-deletes-tweet-bigger-social-security-inflation.html", "timestamp": "2023-04-25 12:17:36 CEST+0200", "meta": {"description": "The Biden administration was forced to delete a tweet boasting about an increase in Social Security payments for retirees. Its removal of the post stemmed from social media users pointing out that the increase was tied to the decades-high inflation faced by the country. The White House deleted the embarrassing social media post on Nov. […]", "lang": "en", "keywords": "adjustments,automatic adjustments,benefit payments,Biden administration,COLAs,cost-of-living adjustments,endless debt,government,government benefits,Inflation,Joe Biden,left cult,lunatics,Republicans,senior citizens,social security,stupid,Twitter,welfare,White House", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://biggovernment.news/2022-11-06-white-house-deletes-tweet-bigger-social-security-inflation.html", "encoding": "UTF-8"}, "image": null, "domain": "biggovernment.news", "title": "White House deletes tweet boasting about bigger Social Security payouts as netizens point out the increase is tied to decades-high inflation", "cleaned_text": "White House deletes tweet boasting about bigger Social Security payouts as netizens point out the increase is tied to decades-high inflation\n\nThe Biden administration was forced to delete a tweet boasting about an increase in Social Security payments for retirees. Its removal of the post stemmed from social media users pointing out that the increase was tied to the decades-high inflation faced by the country.\n\nThe White House deleted the embarrassing social media post on Nov. 2.\n\nPress Secretary Karine Jean-Pierre trying to save face by insisting that the tweet was incomplete. “Usually, when we put out a tweet, we post it with context, and it did not have that context,” she told reporters.\n\nThe 8.7 percent increase in Social Security benefits, set to take effect in 2023, is the biggest increase since 1981 – when benefits were increased by 11.2 percent.\n\nPrior to the tweet’s deletion, social media platform Twitter appended a fact-check note to the post that said “readers added context they thought people might want to know.” It explained that senior citizens “will receive a large Social Security benefits increase due to the annual cost of living adjustment (COLA), which is based on the inflation rate.” (Related: Social Security Administration admits all benefit payments are contingent upon endless cycle of debt.)\n\nPrior to the COLAs put in place by former President Richard Nixon in 1972, Congress increased Social Security payouts on an irregular basis. The former president, however, believed that providing Americans money and insurance they can use to secure necessary services themselves was a better option than passing it through the bureaucracy.\n\nNixon’s landmark legislation thus ended old inequities and provided a new uniform system of benefits to older Americans as well as the blind and disabled.\n\nThis is not the first time that the White House has gone off the rails, either. In May, the account wrongly claimed that there was no vaccine available for COVID-19 when Biden took office in January 2021. This was proven wrong as there had already been COVID-19 vaccines since December 2020.\n\nSeveral Republican congressmen took to social media to blast the Biden administration’s gaffe.\n\nKentucky Rep. Thomas Massie said: “Biden social media geniuses are giving [him] credit for the biggest Social Security COLA in 10 years, but neglect to mention that COLA is an automatic formula based on government inflation metric?.”\n\nColorado Rep. Doug Lamborn noted that the White House is responsible for the COLA increase, thanks to its bad policy decisions that stoked inflation.\n\n“?Even with one-party Democratic rule in D.C., the Biden administration continues to blame others for their failed policies. There is nobody to blame but themselves, ” he tweeted.\n\nMissouri Rep. Vicky Hartzler agreed with Lamborn, noting that Biden’s leadership is solely responsible for record inflation – that triggered the increase in benefits payments.\n\n“The increase is adjusted upwards because cost-of-living has gone up. They are literally taking credit for record-high inflation” tweeted North Dakota Rep. Kelly Armstrong. She also took a jab at Surgeon General Dr. Vivek Murthy by tweeting that he will be justifying why the high cost of eggs is good for people’s health.\n\nVisit BigGovernment.news for more stories like this.\n\nWatch the video below to know how the president is destroying Social Security.\n\nThis video is from the Dr William Mount channel on Brighteon.com.\n\nEVERYTHING the government tells you is a lie: Fake CDC science, fake economic numbers, and especially fake projections on future social security payouts and pensions.\n\nUS govt. admits Social Security going bankrupt; warns public should be given ‘adequate time to prepare’ for the collapse.\n\nSocial Security fund to go into the red in 2020; will be completely bankrupt by 2035… governments will desperately find a way to kill off populations around the world.", "opengraph": {"title": "White House deletes tweet boasting about bigger Social Security payouts as netizens point out the increase is tied to decades-high inflation", "type": "article", "url": "https://www.biggovernment.news/2022-11-06-white-house-deletes-tweet-bigger-social-security-inflation.html", "site_name": "Big Government", "description": "The Biden administration was forced to delete a tweet boasting about an increase in Social Security payments for retirees. Its removal of the post stemmed from social media users pointing out that the increase was tied to the decades-high inflation faced by the country. The White House deleted the embarrassing social media post on Nov. […]", "image": "https://www.biggovernment.news/wp-content/uploads/sites/59/2022/11/White-House-United-States-America.jpg"}, "tags": ["adjustments", "Republicans", "Joe Biden", "senior citizens", "Twitter", "stupid", "Inflation", "automatic adjustments", "Biden administration", "endless debt", "cost-of-living adjustments", "lunatics", "benefit payments", "government", "social security", "government benefits", "left cult", "White House", "COLAs", "welfare"], "tweets": [], "movies": [], "links": ["https://naturalnews.com/042416_Social_Security_benefit_payments_endless_debt.html", "https://www.milkenreview.org/articles/remembering-social-securitys-best-friend", "https://BigGovernment.news", "https://www.brighteon.com/adb04b5d-e041-4f26-acea-69b894db66e4", "https://www.brighteon.com/channels/drwilliammount", "https://naturalnews.com/051013_government_lies_social_security_vaccines.html", "https://naturalnews.com/052008_Social_Security_US_government_financial_collapse.html", "https://naturalnews.com/2019-04-28-social-security-fund-completely-bankrupt-by-2035.html", "https://nypost.com/2022/11/02/republicans-fact-check-white-house-on-cause-of-inflation/", "https://www.milkenreview.org/articles/remembering-social-securitys-best-friend", "https://www.brighteon.com/adb04b5d-e041-4f26-acea-69b894db66e4", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fbiggovernment%2F2022-11-06-white-house-deletes-tweet-bigger-social-security-inflation.html&linkname=White%20House%20deletes%20tweet%20boasting%20about%20bigger%20Social%20Security%20payouts%20as%20netizens%20point%20out%20the%20increase%20is%20tied%20to%20decades-high%20inflation", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}