{"result_id": "048012", "URL": "https://www.biodefense.com/Index.html", "timestamp": "2023-04-25 12:17:49 CEST+0200", "meta": {"description": "Pandemic Preparedness FREE Online How-To Course with the Health Ranger, Mike Adams", "lang": "en", "keywords": "Health, Mike Adams, Pandemic, Preparedness, Ebola, Virus", "favicon": "", "canonical": "https://www.biodefense.com/Index.html", "encoding": "iso-8859-1"}, "image": null, "domain": "www.biodefense.com", "title": "Pandemic Preparedness FREE Online How-To Course", "cleaned_text": "\"I rate the chance of a nuclear war within my lifetime as being fairly low,\" says Gates. \"I rate the chance of a widespread epidemic, far worse than Ebola, in my lifetime, as well over 50%.\"\n\n\"It's spiraling out of control. It is getting worse. It's spreading faster and exponentially.\"\n\n\"If the outbreak is not stopped now, we could be looking at hundreds of thousands of people affected, with profound economic, political and security implications for all of us...\"\n\n\"What is not getting said publicly, despite briefings and discussions in the inner circles of the world's public health agencies, is that we are in totally uncharted waters and that Mother Nature is the only force in charge of the crisis at this time.\"\n\n- Michael T. Osterholm, director of the Center for Infectious Disease Research and Policy at the University of Minnesota, printed in the New York Times on Sep. 11, 2014\n\n\"This is not an African disease. This is a virus that is a threat to all humanity.\"\n\n\"The level of outbreak is beyond anything we've seen - or even imagined.\"\n\n- Dr. Tom Frieden, the Director of the Centers for Disease Control and Prevention\n\n\"Emergency rooms are closed, many hospital wards are as well leaving people who are sick with heart disease, trauma, pregnancy complications, pneumonia, malaria and all the everyday health emergencies with nowhere to go.\"\n\n\"This is different than every other Ebola situation we've ever had. It's spreading widely, throughout entire countries, through multiple countries, in cities and very fast.\"\n\n- Vincent Martin, head of an FAO unit in Dakar, the UN Food and Agriculture Organization\n\n\"The current Ebola virus's hyper-evolution is unprecedented; there has been more human-to-human transmission in the past four months than most likely occurred in the last 500 to 1,000 years.\"\n\n- Michael T. Osterholm, director of the Center for Infectious Disease Research and Policy at the University of Minnesota, printed in the New York Times on Sep. 11, 2014\n\n\"It is impossible to keep up with the sheer number of infected people pouring into facilities. In Sierra Leone, infectious bodies are rotting in the streets.\"\n\n- Dr. Joanne Liu, the international president of Doctors Without Borders\n\n\"Staff at the outbreak sites see evidence that the numbers of reported cases and deaths vastly underestimate the magnitude of the outbreak.\"\n\n\"In 2012, a team of Canadian researchers proved that Ebola Zaire, the same virus that is causing the West Africa outbreak, could be transmitted by the respiratory route from pigs to monkeys, both of whose lungs are very similar to those of humans.\"\n\n- Michael T. Osterholm, director of the Center for Infectious Disease Research and Policy at the University of Minnesota, printed in the New York Times on Sep. 11, 2014\n\n\"Liberia, population four million, has fewer than 250 doctors left in the entire country.\" (Because they've all been killed by Ebola or fled the country.)\n\n- Sheri Fink, published in the New York Times on Aug. 16, 2014\n\n\"Liberia is facing a serious threat to its national existence. It is now spreading like wild fire, devouring everything in its path. The already weak health infrastructure of the country has been overwhelmed... The deadly Ebola virus has caused a disruption of the normal functioning of our State.\"\n\n- Liberian Minister of National Defense Brownie Samukai, quoted in the Daily Mail\n\n\"The number of new cases is increasing exponentially. [The Ebola outbreak is a] dire emergency with unprecedented dimensions of human suffering.\"", "opengraph": {"title": "Pandemic Preparedness FREE Online How-To Course - BioDefense.com", "type": "website", "url": "http://www.BioDefense.com", "image": "http://www.naturalnews.com/gallery/640/Misc/Pandemic-Prepardness-Audio-Program.jpg", "site_name": "BioDefense.com", "description": "Pandemic Preparedness FREE Online How-To Course with the Health Ranger, Mike Adams"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.businessinsider.com/bill-gates-biggest-fear-is-a-killer-flu-2015-5", "http://hosted.ap.org/dynamic/stories/U/US_OBAMA_EBOLA?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT&CTIME=2014-09-16-16-12-47", "http://www.thestar.com/news/world/2014/09/03/fight_against_ebola_to_cost_600_million_who_says.html", "http://www.thedailybeast.com/articles/2014/09/02/cdc-window-is-closing-on-containing-ebola.html", "http://abcnews.go.com/Health/american-doctor-tests-positive-ebola-west-africa/story?id=25216376", "https://au.news.yahoo.com/world/a/24883440/man-infected-with-ebola-virus-flees-isolation-terrifies-market", "https://www.theguardian.com/society/2014/sep/02/ebola-outbreak-call-send-military-curb-epidemic", "http://www.who.int/csr/disease/ebola/overview-20140814/en", "http://www.dailymail.co.uk/news/article-2749687/Ebola-seriously-threatens-Liberias-national-existence-minister.html", "http://www.cnn.com/2014/09/12/health/ebola-outbreak"], "authors": [], "publish_date": null}