{"result_id": "048001", "URL": "https://www.biodefense.com/Pandemic-Preparedness-Episode-09.html", "timestamp": "2023-04-25 12:17:43 CEST+0200", "meta": {"description": "Episode 9: The Ebola vaccine fraud - BioDefense.com", "lang": "en", "keywords": "Health, Mike Adams, Pandemic, Preparedness, Ebola, Virus", "favicon": "", "canonical": "https://www.biodefense.com/Pandemic-Preparedness-Episode-09.html", "encoding": "iso-8859-1"}, "image": null, "domain": "www.biodefense.com", "title": "Episode 9: The Ebola vaccine fraud", "cleaned_text": "\n• Human trials have already begun on the Ebola vaccine\n• The vaccine has completely skipped over all vaccine safety protocols and preliminary testing\n• The sudden, spontaneous appearance of an Ebola vaccine is near-conclusive proof that this was all planned in advance\n• Patent #CA2741523A1 reveals that the United States Government owns Ebola; the patent was awarded in 2010 based on Ebola samples held by the CDC in 2007\n• The current strain of Ebola is spreading out of control because it is a weaponized variant\n• Pharmaceutical companies have a long history of conducing medical experiments on African children: research the history of Pfizer and Nigerian children\n• GSK, the Ebola vaccine manufacturer, was fined by Argentina for the deaths of 14 babies who died during vaccine trials\n• GSK is the same company that was caught committing felony crimes across the USA, running a massive doctor bribery scheme that bribed doctors to push GSK drugs with off-label (illegal) prescriptions\n• GSK was also fined another $490 million for running an illegal bribery scheme in China, where hospitals and doctors were bribed\n• This is the company we are suddenly going to trust with an Ebola vaccine?\n• Understanding the real corporate revenue model of our corrupt world: CREATE the problem, then SELL the solution\n• Big Pharma always creates fake diseases then sells harmful drugs to treat them\n• The CDC has openly admitted that polio vaccines were widely contaminated with cancer viruses\n• Big Pharma depends on repeat business for its profits; it doesn't want to sell you a cure but rather a way to \"manage\" a health condition without solving it\n• The CDC fabricates evidence of pandemics in order to push vaccines\n• CDC scientist Dr. William Thompson has openly admitted, on the record, to taking part in a conspiracy of scientific fraud at the CDC\n• NIH controls government research grants while the CDC controls the \"official\" story on all pandemics and treatments\n• The use of human guinea pigs for medical experiments is routinely conducted across the vaccine industry\n• Ebola was \"manufactured\" by the U.S. Dept. of Defense, says a Liberian scientist, as a biological weapon\n• Medical martial law was declared in Sierra Leone, and Ebola victims were hunted like fugitives in door-to-door searches\n• All large drug companies are in business solely to make money, not to aid humanity or solve problems (they actually make more money from causing problems)\n• The worse a vaccine works, the more vaccine sales immediately follow (because the outbreak gets worse)\n• HPV vaccines have been damaging young girls in Colombia while the drug companies offer excuses and denials\n• People who refuse Ebola vaccines will be declared mentally ill\n• Ebola is an \"invention\" that's owned by the United States government and covered by an on-file patent, encompassing all Ebola variations that share 70% of the same genetic code\n• Patents give the government \"ownership\" over the Ebola replicating in your own blood\n• The U.S. government can also claim ownership and control over all research into Ebola, all vaccines and all \"cures\" Learn more from the Health Ranger at www.NaturalNews.com\n\nNatural News is now on Diaspora!\n\nJoin the Natural News Diaspora community for 100% uncensored real-time news posts throughout the day. Diaspora is the free speech alternative to Facebook.", "opengraph": {"title": "Episode 9: The Ebola vaccine fraud - BioDefense.com", "type": "website", "url": "http://www.BioDefense.com/Pandemic-Preparedness-Episode-09.html", "image": "http://www.BioDefense.com/Photos/Pandemic-Preparedness-Episode-09.jpg", "site_name": "BioDefense.com", "description": "Episode 9: The Ebola vaccine fraud - BioDefense.com"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.BioDefense.com/Pandemic-Preparedness-Episode-09.html/MP3/Pandemic-Preparedness-Episode-09-v2.mp3", "Pandemic-Preparedness-Episode-08.html", "Pandemic-Preparedness-Episode-10.html", "MP3/Pandemic-Preparedness-Episode-09-v2.mp3", "https://www.addtoany.com/share_save", "http://www.naturalnews.com", "http://share.naturalnews.com", "http://www.naturalnews.com/046822_Ebola_virus_transmission_World_Health_Organization.html", "http://www.naturalnews.com/046703_ebola_medical_police_state_cdc_whistleblower.html", "http://www.naturalnews.com/046378_cdc_ebola_pandemic_survival_tips.html", "http://www.naturalnews.com/046330_ebola_dirty_bomb_biological_terrorism_large_cities.html", "http://www.naturalnews.com/046276_ebola_aerosol_transmission_infectious_disease.html", "http://www.nomorefakenews.com", "http://truthstreammedia.com", "http://www.shtfplan.com", "http://www.theorganicprepper.ca", "http://www.thedailysheeple.com", "http://www.stevequayle.com", "http://theeconomiccollapseblog.com", "http://theextinctionprotocol.wordpress.com", "http://survivalblog.com"], "authors": [], "publish_date": null}