{"result_id": "049008", "URL": "https://discourse.biologos.org/t/is-the-covid-vaccine-safe-for-children-a-pediatrician-and-immunologist-weigh-in/48606/157", "timestamp": "2023-04-25 12:17:56 CEST+0200", "meta": {"description": "Thanks to @MOls for working so diligently on this piece for us! \nI know I personally am counting down the days until we are approved for 0-5!", "lang": "en", "keywords": "", "favicon": "https://discourse.biologos.org/uploads/db1313/optimized/2X/1/1bb7edaaa4d5a5efc31a60b3388f20e2aeca1507_2_32x32.png", "canonical": "https://discourse.biologos.org/t/is-the-covid-vaccine-safe-for-children-a-pediatrician-and-immunologist-weigh-in/48606?page=7", "encoding": "utf-8"}, "image": null, "domain": "discourse.biologos.org", "title": "Is the COVID Vaccine Safe for Children? A Pediatrician and Immunologist Weigh In", "cleaned_text": "I am confused. I think the Allysia Finley, in the WSJ means well, but here are some questions. Also, I refer people to the OP again. There are some good points that I’m sure people could get clarification from. @MOls , Thank you for your excellent paper.\n\nWhy should we trust this person, who has no medical training, over the CDC? Please note that the good question, “There’s a reason vaccine trials usually take a decade,” was answered quite a while ago, with new techniques. Covid is one of the best confirmed vaccines for safety, ever.\n\nRegarding mild versus severe disease, I think that the writer makes the mistake of forgetting to think epidemiologically. Most vaccination programs base the effectiveness of our natural immune system to protect the herd, not the individual. As with adults, community spread diseases are worst with the ill and weak. Thus, a child with congenital heart disease, lung disease or tracheomalacia of prematurity, SCIDS (immunodeficiency), and many others that show up every few months in the children’s hospitals like St Jude’s, DeVos in my region, and Children’s Hospital of Michigan in Detroit, are touch and go if they get the disease. They are high risk of getting it from others in the community–and kids don’t mask, socially distance, or wash their hands well (what’s the difference between broccoli and boogers? Kids won’t eat broccoli).\n\nNot only that, but as we’ve discussed before, kids can be vectors to their grandparents, who get ill very quickly. As the OP points out, many of the mildly, chronically ill (which is a big segment of our population) don’t make good antibodies with a vaccine, and have more breakthrough infection. That’s why we vaccinate kids against Hep A–most kids do well in the long run, but grandparents can die from it, especially those with chronic liver disease.\n\nIf we would like to take someone seriously, we should trust someone with training in infectious disease and epidemiology.\n\nI am a family doc. If I were to refer someone to an obstetrician for a heart attack, I would lose my job. Yet, in Covid, we seem to rely heavily on people who have no expertise in their region. They are, of course, smart. However, the Dunning Kruger effect is something we all fall prey to.\n\nI only know enough to know who to trust. It’s incredibly confusing to people who read “don’t trust this” by someone who uses big words and vague atmosphere of distrust, and sounds like they know what they’re doing.\n\nI’ve followed Dr Fauci and the CDC for years–for advice on heart, travel medicine, HIV, and many other things (missionaries rely on it for decades for safety in traveling overseas). We need to stick with the thousands of experts (who, by and large, are not rich) who really know what they’re doing.\n\nI don’t have time to go looking up all the rebuttal to this–there are some holes even I can see. However, even if I did, I would not have the hundreds of years of research these folks have over me, enough to speak on their level.\n\nAs a primary care provider, I do recommend the shots- my kids (8 through 14) have gotten them, and I will recommend the younger ones, too.", "opengraph": {"site_name": "The BioLogos Forum", "type": "website", "image": "https://discourse.biologos.org/uploads/db1313/original/2X/f/f961c6c80e26b70ee0d1d6cc9465706f024563cf.jpeg", "url": "https://discourse.biologos.org/t/is-the-covid-vaccine-safe-for-children-a-pediatrician-and-immunologist-weigh-in/48606/157", "title": "Is the COVID Vaccine Safe for Children? A Pediatrician and Immunologist Weigh In", "description": "I am confused. I think the Allysia Finley, in the WSJ means well, but here are some questions.  Also, I refer people to the OP again. There are some good points that I’m sure people could get clarification from. @MOls , Thank you for your excellent paper.  Why should we trust this person, who has no medical training, over the CDC? Please note that the good question, “There’s a reason vaccine trials usually take a decade,” was answered quite a while ago, with new techniques. Covid is one of the ...", "ignore_canonical": "true"}, "tags": ["COVID"], "tweets": [], "movies": [], "links": ["/u/mols"], "authors": ["03Cobra", "HRankin", "Randy", "TJO", "glipsnort", "Dale", "jpm"], "publish_date": "2022-07-09T16:37:35+00:00"}