{"result_id": "049007", "URL": "https://biologos.org/resources/should-christians-take-the-vaccine", "timestamp": "2023-04-25 12:17:55 CEST+0200", "meta": {"description": "It is important to think about the vaccine from a Christian perspective because a sizable number of believers have indicated they are suspicious of it.", "lang": "en", "keywords": "", "favicon": "/favicon.png", "canonical": "https://biologos.org/resources/should-christians-take-the-vaccine", "encoding": "utf-8"}, "image": null, "domain": "biologos.org", "title": "Should Christians Take the Vaccine? - Resource", "cleaned_text": "Should Christians take the COVID vaccine? It is important to think about the vaccine from a specifically Christian perspective because a sizable number of believers have indicated they are suspicious of the vaccine, often for reasons related to their faith.\n\nMy name is Curtis Chang. I am a former pastor, and now I teach pastors as a seminary professor.\n\nOur video series seeks to help Christians think Biblically about the vaccine. To be upfront, we do make the case that Christians should indeed take the vaccine, and do so for important Biblical reasons. However, we take seriously the doubts that many have, especially the doubts that are related to faith. There already is a great deal of information available online that presents the scientific reasons to take the vaccine. Our series is focused more on the Biblical reasons to do so.\n\nOne of the key themes running throughout our series is how Christians are supposed to trust something. The answer to the question, “Should Christians take the COVID vaccine?” really depends on the underlying question of trust.\n\nSo, why do I trust the vaccine? I’d love to be able to tell you that I’ve read all the research papers, mastered all the science, and come to my own independent conclusion on why the vaccine is safe. But I haven’t. I’m a seminary professor, not an advanced biomedical scientist. I couldn’t name for you the exact ingredients of the vaccine. And if I tried to describe exactly how the vaccine works, I would probably start mumbling after about 15 seconds.\n\nMy trust in the vaccine is not based on my direct understanding of all the scientific details. I trust the vaccine because I trust experts who are tasked with understanding the science for me. I trust experts like Dr. Francis Collins who heads the National Institutes of Health (the NIH). Dr. Collins, by the way, is a devout evangelical Christian and one of the nation’s leading scientists.\n\nHe has assured everyone that the vaccine is safe and effective. I rely on Dr. Collins—and not just him, but all the leading scientific institutions who agree with him on the safety and efficacy of the vaccine: the FDA, the CDC, and many other organizations that have proven themselves to be trustworthy for many decades.\n\nIn fact, trust is critical to how we take any medicine.\n\nWhenever you take medicine, you also probably do not know directly its exact ingredients or the research behind the drug. Instead, you are trusting your doctor, and perhaps without even knowing, you are also trusting research universities, pharmaceutical companies, and the FDA that ultimately approved the drug. This is exactly the kind of trust involved in taking the COVID vaccine.\n\nThe necessity of trust applies to the spiritual issues involved in the vaccine as well. There are issues like “Can you be pro life and pro vaccine?” or “What about the history of racism in these research institutions?” Some have even wondered, “Is the vaccine the mark of the beast?”\n\nOn these spiritual issues, as a seminary professor, I myself am an expert, and I have studied these issues in depth. This is why our other videos will focus specifically on these kinds of questions. But even in my own extensive research on the spiritual issues, I as an expert am still trusting others.\n\nOn pro-life issues, I have relied on the thinking of the Vatican, which has studied the ethics of vaccine development for decades. I have benefited from the statements of bioethics experts from institutions like the Association of Pro-Life Obstetricians, the Christian Medical Association and many others*, all of whom have encouraged Christians to take the vaccine because it is ethical to do so. On issues of race, I have taken my cues from a coalition of historically black medical schools that published a “Love Letter to Black America” on the vaccine.\n\nIn practically every facet of our life, we have to regularly trust experts and institutions to navigate life. And here is the important Biblical principle: that is a good thing! God designed us to trust. God designed us to trust institutions and experts.\n\nThis was true in the way God designed the society of Israel to trust kings, prophets and judges. This was true in the Great Commission of the New Testament, when Jesus entrusted the gospel to his original disciples. The disciples were to be his designated experts, and he expected the world to take in truth by trusting their words.\n\nGod designed humans to know truth through trust. Of course, trusting human institutions does not mean expecting them to be perfect. How we as Christians relate to flawed institutions will be another theme running through our other videos. As we will see, the Bible is full of wisdom on relating to flawed institutions that we can apply to the vaccine.\n\nWhen we factor everything in, I believe there are strong reasons for trusting the scientific and Christian institutions encouraging us to take the vaccine.\n\nWe invite you to explore the other videos in this series. We believe you will not only learn more about the vaccine, but you will also discover other important and perhaps surprising Biblical truths about how God designed us to navigate this world. Come join us.\n\n*Additional institutions in support of the vaccine include United States Conference of Catholic Bishops, Pontifical Academy for Life, American Association of Pro-Life Obstetricians and Gynecologists, American College of Pediatricians; Catholic Medical Association, and Christian Medical & Dental Associations.", "opengraph": {"title": "Should Christians Take the Vaccine? - Resource - BioLogos", "description": "It is important to think about the vaccine from a Christian perspective because a sizable number of believers have indicated they are suspicious of it.", "image": "https://cms.biologos.org/wp-content/uploads/2021/03/Screen-Shot-2021-03-18-at-10.18.47-PM.png", "url": "https://biologos.org/resources/should-christians-take-the-vaccine/", "site_name": "BioLogos", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["http://maristpoll.marist.edu/wp-content/uploads/2020/12/NPR_PBS-NewsHour_Marist-Poll_USA-NOS-and-Tables_202012071625.pdf#page=3", "https://www.nih.gov/about-nih/who-we-are/nih-director", "https://biologos.org/series/should-christians-take-the-vaccine/resources/should-pro-lifers-be-pro-vaccine", "https://biologos.org/series/should-christians-take-the-vaccine/resources/is-the-covid-vaccine-the-mark-of-the-beast", "https://www.ncronline.org/news/coronavirus/pontifical-academy-life-urges-quick-action-covid-19-vaccine-production", "https://aaplog.org/physician-support-for-ethical-vaccines/", "https://cmda.org/article/physician-support-for-ethical-vaccines/", "https://www.msm.edu/RSSFeedArticles/2020/November/blackloveletter.php", "https://www.usccb.org/resources/memo-to-bishops-on-vaccines-for-covid-19.pdf", "https://www.ncronline.org/news/coronavirus/pontifical-academy-life-urges-quick-action-covid-19-vaccine-production", "https://aaplog.org/physician-support-for-ethical-vaccines/", "https://cmda.org/article/physician-support-for-ethical-vaccines/"], "authors": [], "publish_date": null}