{"result_id": "049039", "URL": "https://discourse.biologos.org/t/common-question-should-christians-get-vaccinated/45057?page=10", "timestamp": "2023-04-25 12:18:20 CEST+0200", "meta": {"description": "Is it really that much of a risk to just opt out? How can we really know these vaccines are safe? And what about the ethical concerns regarding how they’re made? These are important questions—questions worth taking serio&hellip;", "lang": "en", "keywords": "", "favicon": "https://discourse.biologos.org/uploads/db1313/optimized/2X/1/1bb7edaaa4d5a5efc31a60b3388f20e2aeca1507_2_32x32.png", "canonical": "https://discourse.biologos.org/t/common-question-should-christians-get-vaccinated/45057?page=10", "encoding": "utf-8"}, "image": null, "domain": "discourse.biologos.org", "title": "Common Question: Should Christians get vaccinated?", "cleaned_text": "Oh man you guys, I can’t keep doing this. This is taking too much time\n\n A) why ask… I purposely chose a ridiculous number (52 shots, 12 bottles of pills) so that we both may agree that there is a limit for any reasonable person. The 4 shots/per year is where we are at, so that number is our reality. As Dale was saying, the vaccine ( 1 or 2 shots), booster, and perhaps another, so 4 is not outlandish. 2 bottles of pills at the bedside is realist too. 12 bottles is crazy. My question is about faith. When do you say, “I will trust God with my health not doctors/drugs”? 2 bottles, 4 bottles, 8 bottles? Now no judgement here about whatever answer you have. I am curious if a doctor/or your authority in your life said you need 12 shots this year, and they are someone you consider trustworthy is that ok with you? My point that I’m driving at is this. We all have our own limits. I have a low to no limit. Others, have higher. That’s all ok with me. We each have to stand before our maker alone. I don’t care if you all get all the vaccines, I’m not your judge. But, I do have a big problem with others making choices for me. Do you? Regardless what we believe where this virus came from, I believe, this last year may be the new norm. I could easily see 2 sets of shots each year, that would be 8 shots plus your flu shots. There’s nothing immoral about it, neither is dying with 6 bottles of pills near your bed. I just reject living that way.\n\n B) passports… what I’m talking about is what is happening in our society today. There is talk about vaccine passports for normal activities not traveling to other countries. Let me form a question. Why vaccine passports vs anti-body passports? Why wouldn’t we do that? Does that make sense to you? I got covid and recovered, what are the pecentages of recovered covid people getting it again? If I heard correctly something like .02%. Why am I being pushed to get jabbed? This does not make sense, again imo. They are also talking about mandated vaccines. Are you in favor of mandated vaccines?\n\n C) the vulnerable… I agree on the vulnerable. Smart people should figure out who is at most risk and then we should have good measures. The problem is we didn’t do that in the beginning and we still aren’t doing that completely now. The elderly are at most risk, so obviously let’s protect them, and by all means don’t send people with covid back to their care centers (Coumo are you listening). Look at things now. The young rarely are dying from the virus. They probably have a higher risk making it to the mall without dying in a car accident than getting covid and dying. (if kids even do that these days??) If you are under 50 and healthy your chances of survival are really high. ( Like if those odds were at Vegas, I would be a professional gambler.) Now, they are pushing the vaccine to pregnant girls and kids. Are they the vulnerable? Another question. Do NFL players seem like the vulnerable to you? Young, models of fitness, they probably have thee best healthcare and thee best nutrition. Look what’s going on there, they are pressuring these players to get it. Does that sound like a rational amount of fear?\n\n D) last question about fear… Q- When you see a young person, say in their 20’s, jogging on a trail in the forest with fresh air wearing a mask, do you think they are: A) anti-vaccers B) pro-vaccine? I see lots of these people. My aunt who is in the sticks in Michigan, lives alone without any close neighbors. She is vaccinated, she will be working in her garden with a mask on. Take a guess where she got that crazy fear from. Watching the news, main stream media. She is scared to death of getting this virus, and even with the vaccine she still is unreasonably fearful. The fear and the politically motivated misinformation is on both sides of the isle.\n\n E) just a note about the beast shot. I doubt highly that it will come with a moral choice. It will probably come wrapped in a social sugar coated trick like- get the tat and stop human traffiking. or stop drugs, or get the money tattoo and wipe out poverty. This is only my almost worthless opinion.\n\nok everyone, I really do want to leave. If I can just stop thinking about this now, that would help. I wish you all well!", "opengraph": {"site_name": "The BioLogos Forum", "type": "website", "image": "https://discourse.biologos.org/uploads/db1313/original/2X/f/f961c6c80e26b70ee0d1d6cc9465706f024563cf.jpeg", "url": "https://discourse.biologos.org/t/common-question-should-christians-get-vaccinated/45057?page=10", "title": "Common Question: Should Christians get vaccinated?", "description": "Since this forum is about asking questions, let me ask.  How many jabs are you willing to get in a year?  4? once a quarter?, how about 12, how about once a week 52 a year?  How many bottles of pills are you willing to have at your bedside table when you die?  2, 6, a dozen?   Where is your limit, where you say enough is enough?  My gut feeling is that we ( the US and the world) are headed to vaccine passports, then what Dale?  Money passports, work passports?  Maybe the new world order by then ...", "ignore_canonical": "true"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": ["Ten2Four", "MarkD", "T_aquaticus", "DanielK", "glipsnort", "Dale", "SkovandOfMitaze", "jpm", "Klax"], "publish_date": "2021-07-26T13:13:52+00:00"}