{"result_id": "049003", "URL": "https://biologos.org/post/let-us-not-lose-heart-on-vaccination", "timestamp": "2023-04-25 12:17:53 CEST+0200", "meta": {"description": "Because of our faith in Jesus Christ, let us love our neighbors by getting the shot and wearing masks in public places, and encouraging others to do the same. Let us follow Christ by speaking the truth and countering misinformation.", "lang": "en", "keywords": "", "favicon": "/favicon.png", "canonical": "https://biologos.org/post/let-us-not-lose-heart-on-vaccination", "encoding": "utf-8"}, "image": null, "domain": "biologos.org", "title": "Let Us Not Lose Heart on Vaccination - Post", "cleaned_text": "To find a location near you to get your free vaccine, visit vaccines.gov (no health insurance is required).\n\nIf you’ve already been vaccinated, you probably have loved ones, fellow church members, or extended family who haven’t been vaccinated. Thankfully, research shows that many vaccine-hesitant people are willing to change their minds! People don’t change their minds from hearing one magic-bullet argument. Rather, people change their minds when they hear good information and compelling stories, repeatedly, from multiple sources, especially from sources they trust. That means we can all help. As Christians, we all have networks into communities of fellow believers who have resisted vaccination. Someone who would resist hearing about vaccines from a secular scientist or a government mandate may be open to hearing it from a fellow believer they trust, who can explain about vaccines in Christian terms. And sometimes someone just needs a ride to a pharmacy or a friend to watch the kids while they get the shot.\n\nBioLogos has developed several resources to help you share accurate information on vaccination, from a fully Christian perspective. Here are two great ones to start with:\n• “Should Christians get vaccinated?” Our Common Question on vaccination has already been viewed 350,000 times. I encourage you to read it (or read it again) to remind yourself of the best arguments you can make, and to share the link with others.\n• “Love your Neighbor: A Christian Statement on Science for Pandemic Times.” Our statement has now been signed by over 8000 people, including many prominent Christian leaders. Signers come from different denominations, different parts of the country, and different political parties, yet agree that masks and vaccination are ways to love our neighbors. When you share this with someone, point to the signers they know and trust.\n\nMost of all, share stories. Many times, what changes hearts and minds is a story rather than scientific information. Tell them why you decided to get vaccinated. Were you hesitant, and if so, what changed your mind? Why did you do it as a Christian? Maybe you got the shot so you could celebrate a birthday with a grandparent without fear of giving them the disease. Maybe you overcame your fear of needles because you wanted to avoid the Long Covid “brain fog.” Maybe you didn’t want to spread COVID to the children in your congregation who can’t be vaccinated yet. Maybe you did it for a nurse from your church, so that her hospital would not be overwhelmed with more COVID cases.\n\nLet us not lose heart. God has heard our prayers for relief from the pandemic and provided safe vaccines that work. Because of our faith in Jesus Christ, let us love our neighbors by getting the shot and wearing masks in public places, and encouraging others to do the same. Let us follow Christ by speaking the truth and countering misinformation. And let us follow Christ in compassion, working for justice and caring for the sick, sacrificing ourselves for the sake of others.", "opengraph": {"title": "Let Us Not Lose Heart on Vaccination - Post - BioLogos", "description": "Because of our faith in Jesus Christ, let us love our neighbors by getting the shot and wearing masks in public places, and encouraging others to do the same. Let us follow Christ by speaking the truth and countering misinformation.", "image": "https://cms.biologos.org/wp-content/uploads/2021/10/covid-prayer.png", "url": "https://biologos.org/post/let-us-not-lose-heart-on-vaccination/", "site_name": "BioLogos", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://vaccines.gov", "https://directorsblog.nih.gov/2021/10/05/most-vaccine-hesitant-people-remain-willing-to-change-their-minds/", "https://osf.io/fazup/", "https://biologos.org/resources?hierarchicalMenu%5Btopics.lvl0%5D=Science%20%3E%20COVID-19&page=1", "https://biologos.org/common-questions/should-christians-get-vaccinated/", "https://statement.biologos.org", "https://directorsblog.nih.gov/2021/09/14/breakthrough-infections-in-vaccinated-are-less-likely-to-cause-long-covid/"], "authors": [], "publish_date": "2021-10-26T12:00:33.000Z"}