{"result_id": "049022", "URL": "https://biologos.org/events/online-the-covid-19-vaccines-a-conversation-with-francis-collins-and-russell-moore", "timestamp": "2023-04-25 12:18:09 CEST+0200", "meta": {"description": "BioLogos Founder Francis Collins will participate in the Ethics & Religious Liberty Commission of the Southern Baptist Convention's webinar \"The Covid-19 Vaccines: A Conversation with Dr. Francis Collins and Russell Moore\" on December 3, 2020.", "lang": "en", "keywords": "", "favicon": "/favicon.png", "canonical": "https://biologos.org/events/online-the-covid-19-vaccines-a-conversation-with-francis-collins-and-russell-moore", "encoding": "utf-8"}, "image": null, "domain": "biologos.org", "title": "The Covid-19 Vaccines: A Conversation with Dr. Francis Collins and Russell Moore - Event", "cleaned_text": "BioLogos Founder Francis Collins will participate in the Ethics & Religious Liberty Commission of the Southern Baptist Convention’s webinar “The Covid-19 Vaccines: A Conversation with Dr. Francis Collins and Russell Moore” on December 3, 2020.\n\n“The race for a COVID-19 vaccine has dominated recent headlines. Today, we are likely only weeks away from multiple vaccines being released to the public.\n\nThis raises a number of important questions like: How do we know these vaccines are safe? What will church life be like in 2021? Will we ever get back to “normal”?\n\nOn Thursday, join us for an important conversation about the COVID-19 vaccines with Dr. Francis Collins, director of the National Institutes of Health.\n\nThe incredible story of how the COVID-19 vaccines were developed\n\n The scientific process behind the creation of the vaccines\n\n Responding to those who say this is all a hoax\n\n Discussing the truth about these vaccines\n\n Why Christians should have confidence in the vaccines”\n\nThis event is hosted by Ethics & Religious Liberty Commission of the Southern Baptist Convention.", "opengraph": {"title": "The Covid-19 Vaccines: A Conversation with Dr. Francis Collins and Russell Moore - Event - BioLogos", "description": "BioLogos Founder Francis Collins will participate in the Ethics & Religious Liberty Commission of the Southern Baptist Convention's webinar \"The Covid-19 Vaccines: A Conversation with Dr. Francis Collins and Russell Moore\" on December 3, 2020. ", "image": "https://biologos.org/images/og-image.jpg", "url": "https://biologos.org/events/online-the-covid-19-vaccines-a-conversation-with-francis-collins-and-russell-moore/", "site_name": "BioLogos", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}