{"result_id": "049050", "URL": "https://biologos.org/post/5-reasons-christians-should-get-the-covid-19-vaccine", "timestamp": "2023-04-25 12:18:30 CEST+0200", "meta": {"description": "Deb highlights why Christians should feel confident receiving a COVID vaccine on behalf of themselves and the rest of their community.", "lang": "en", "keywords": "", "favicon": "/favicon.png", "canonical": "https://biologos.org/post/5-reasons-christians-should-get-the-covid-19-vaccine", "encoding": "utf-8"}, "image": null, "domain": "biologos.org", "title": "5 Reasons Christians Should Get the COVID-19 Vaccine - Post", "cleaned_text": "3. The sooner the better\n\nWidespread vaccination is the fastest and most permanent way to stop the spread. Nearly half a million people in the United States have already died of COVID-19 and millions more have been sick. Many others are struggling—those who’ve lost jobs, the lonely, those suffering mental illness, the healthcare workers serving on the front lines, and the teachers and kids dealing with online school. All of this will end as soon as we stamp out this virus! You can help your community by getting the vaccine as soon as you are eligible.\n\nMany Christians are concerned about the possible use of fetal cells in vaccines. The good news is that no vaccines contain human cells! Moreover, the Pfizer and Moderna vaccines do not use human cells even in the production process. The Johnson & Johnson vaccine does use a human cell line in production; this is an immortal cell line that came from a fetus aborted in 1985 (the abortion was not performed for this purpose). Yet even here, the cells used today are descended many generations from the original fetus and were never part of an actual human body. While the association with abortion gives many Christians pause, there is substantial agreement among Christian theologians and ethicists that the connection to fetal cell lines should not make these vaccines off-limits for Christians; see our Common Question on vaccines for more.\n\n5. The disease is riskier than the vaccine\n\nNo vaccine is 100% risk-free, just as no medical procedure is risk free. Christians need to weigh the risks on both sides. COVID-19 is a serious disease, much worse than the flu. By now we’ve all known people who have had it. Some people have mild cases but others have serious symptoms, hospitalization, and long-term complications. The risks of the vaccine are less than the risks of the disease. Our Common Question on vaccines weighs the risks in more detail.", "opengraph": {"title": "5 Reasons Christians Should Get the COVID-19 Vaccine - Post - BioLogos", "description": "Deb highlights why Christians should feel confident receiving a COVID vaccine on behalf of themselves and the rest of their community.", "image": "https://cms.biologos.org/wp-content/uploads/2021/02/Doctor-preparing-COVID-vaccine-WEB.jpg", "url": "https://biologos.org/post/5-reasons-christians-should-get-the-covid-19-vaccine/", "site_name": "BioLogos", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://biologos.org/post/francis-collins-speaks-out-on-mental-health-during-covid-19", "https://biologos.org/podcast-episodes/julia-wattacheril-caring-for-the-caretakers", "https://biologos.org/common-questions/should-christians-get-vaccinated", "https://biologos.org/post/whats-the-big-deal-about-covid-a-friendly-correspondence", "https://biologos.org/common-questions/should-christians-get-vaccinated"], "authors": [], "publish_date": "2021-02-19T05:24:55.000Z"}