{"result_id": "049026", "URL": "https://biologos.org/articles/from-need-to-distribution-vaccine-development-in-urgent-times", "timestamp": "2023-04-25 12:18:13 CEST+0200", "meta": {"description": "\"How fast can a vaccine safely be developed? With COVID-19 spreading like wildfire, do we have time?\" An immunologist takes a look at the process of vaccine development and how it's being adapted for the current times.", "lang": "en", "keywords": "", "favicon": "/favicon.png", "canonical": "https://biologos.org/articles/from-need-to-distribution-vaccine-development-in-urgent-times", "encoding": "utf-8"}, "image": null, "domain": "biologos.org", "title": "From Need to Distribution: Vaccine Development in Urgent Times - Article", "cleaned_text": "By now (June of 2020), five months from the discovery of the COVID virus, there are already about a dozen vaccine candidates in clinical trials, with some finishing Phase 2, and others planning Phase 3 trials in July.\n\nIs it still going to be safe?\n\nIt seems in order to develop a vaccine rapidly, we are cutting corners in the process. Would we sacrifice safety by moving too fast? Yes, we certainly are taking more risks when we don’t follow the process step by step. For example, by doing animal study and human study simultaneously (for the mRNA vaccine from Moderna). They had not shown in animal study the vaccine was protective and safe for the animals, but they already started putting it in humans. However, such risks are well-calculated. mRNA vaccines are relatively safe. Since the vaccine only consists of a piece of mRNA, not a whole virus, there is no chance the vaccine recipient will be infected through the vaccine. Over the last five years, many mRNA vaccine candidates (for other pathogens) have gone through animal studies and early clinical trials to show an excellent safety profile. The mRNA platform has the advantage of conserving much of the vaccine mechanism between different pathogen targets, where the only difference would be the sequence of the mRNA. So, such a small risk is viewed favorably in light of the potential to save many more lives sooner.\n\nSo far, all the cutting-corners occur during preclinical study, Phase 1 or 2 studies. No one is saying they are going to cut corners with Phase 3 trials, and rightly so. As a matter of fact, companies plan to have tens of thousands of volunteers for their Phase 3 trials rather than just thousands. If one is going to catch some safety issues or efficacy issues, it would be in Phase 3 trials, because it has the largest number of subjects involved. Before a vaccine candidate can be approved and licensed, it will have to demonstrate in the large Phase 3 trials that it’s both safe and effective. The FDA is not going to sacrifice its standard on that.\n\nThere are actually advantages in developing a vaccine in a pandemic. For one, there will not be a lack of testing subjects. This was a serious issue with the SARS vaccine: by the time the first SARS was ready to be tested (20 months after the outbreak), the virus disappeared (and has not returned since), so one cannot run a clinical trial to test whether the vaccine is protective. Additionally, people are willing to invest money in developing the vaccine. Believe it or not, running clinical trials takes a lot of money—millions. During a pandemic, everyone sees the clear benefit and urgency for a vaccine. Then, of course, certain processes can be fast-tracked, because of the urgency. Finally, there is so much interest and so many vaccine candidates (more than 100 so far for COVID), that the chance of developing one or several successful ones is very high.\n\nOverall, the scientific process it takes to develop a vaccine generally ensures safety and effectiveness of the final product, even when it is fast-tracked. However, for the new coronavirus, there are other challenges.\n\nFirst of all, there may not be lasting immunity to the coronavirus, even after a natural infection. Studies have shown our immunity against coronaviruses that cause common cold fade away after several months. For SARS, the antibodies lasted several years (not lifetime), but we don’t know whether the antibody levels were protective against infection since SARS never came back. We certainly at this point still don’t know about the COVID virus. There simply hasn’t been enough time elapsed to see if recovered patients can be infected again after a certain period of time. It is possible that natural immunity to COVID may not result in long-term protection. A recent study showed that antibody levels in recovered COVID patients started to decrease within 2-3 months. If a vaccine has similar effect as a natural infection, it will require more frequent administration of the vaccine.\n\nSecondly, there is a risk that a vaccine may cause more severe symptoms in natural virus infection. Isn’t a vaccine supposed to prevent infection, or at least prevent more severe symptoms? Yes, but some vaccines can do the opposite due to non-protective antibody responses. For example, in the dengue vaccine, it was found for some patients, getting the vaccine causes more severe disease when they are exposed to the real virus. Similar enhanced disease was observed in animal studies of certain SARS vaccines. Therefore, careful evaluation of protective versus disease enhancing antibodies is imperative during analysis of immunogenicity and safety results from COVID-19 candidate vaccines. Scientists are aware of this potential risk and will be guarding against such phenomenon when analyzing clinical trial results.", "opengraph": {"title": "From Need to Distribution: Vaccine Development in Urgent Times - Article - BioLogos", "description": "\"How fast can a vaccine safely be developed? With COVID-19 spreading like wildfire, do we have time?\" An immunologist takes a look at the process of vaccine development and how it's being adapted for the current times.", "image": "https://cms.biologos.org/wp-content/uploads/2020/07/research-lab-WEB.jpg", "url": "https://biologos.org/articles/from-need-to-distribution-vaccine-development-in-urgent-times/", "site_name": "BioLogos", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://abcnews.go.com/Health/lab-peoples-arms-list-covid-19-vaccines-studied/story?id=71145250", "https://www.wcvb.com/article/cambridge-based-moderna-announces-plans-for-phase-3-trial-of-covid-19-vaccine/32837152", "https://www.statnews.com/2020/03/11/researchers-rush-to-start-moderna-coronavirus-vaccine-trial-without-usual-animal-testing", "https://www.cnbc.com/2020/06/02/dr-anthony-fauci-says-theres-a-chance-coronavirus-vaccine-may-not-provide-immunity-for-very-long.html", "https://www.technologyreview.com/2020/04/27/1000569/how-long-are-people-immune-to-covid-19", "https://www.nature.com/articles/s41591-020-0965-6", "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(19)32525-5/fulltext", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3335060/", "https://www.nature.com/articles/s41577-020-0321-6", "https://www.nejm.org/doi/full/10.1056/NEJMp2005630"], "authors": [], "publish_date": "2020-07-08T07:00:38.000Z"}