{"result_id": "049037", "URL": "https://discourse.biologos.org/t/covid-vaccinations/47016", "timestamp": "2023-04-25 12:18:19 CEST+0200", "meta": {"description": "I am deeply encouraged to find an Open Forum with many people who are united and compassionate towards differing opinions. I wanted to ask a few questions to clarify: \nFrom what I understand, if you receive the vaccine y&hellip;", "lang": "en", "keywords": "", "favicon": "https://discourse.biologos.org/uploads/db1313/optimized/2X/1/1bb7edaaa4d5a5efc31a60b3388f20e2aeca1507_2_32x32.png", "canonical": "https://discourse.biologos.org/t/covid-vaccinations/47016", "encoding": "utf-8"}, "image": null, "domain": "discourse.biologos.org", "title": "Covid Vaccinations", "cleaned_text": "Receiving the vaccine doesn’t make you contagious with COVID because you aren’t getting the virus, you are getting mRNA that stimulates your body to make a protein that triggers a similar immune response as the virus and makes antibodies that protect against the virus.\n\nIf you are vaccinated you have some protection against getting a COVID infection. An infection happens when a virus enters your body and begins to multiply quicker than the body can fight it off. A vaccine helps your body kill off the virus before it can infect you (multiply enough to start overwhelming your immune system). If it doesn’t develop into an infection, then you wouldn’t be contagious. The vaccine will help your body fight off the virus before it can infect you something like 50-80% of the time.\n\nIf the antibodies you developed from the vaccine are not enough to fight off the virus and it multiplies into an infection in your body, then you will be as contagious to others as an infected person who wasn’t vaccinated. But since you have antibodies, you will probably have a less severe infection and be able to fight the infection more quickly. It is actually only a small number of people with breakthrough infections who get sick enough to be hospitalized. The numbers keep getting updated, but in April a study showed unvaccinated people were 29 times more likely to be hospitalized with COVID then vaccinated people who got a breakthrough infection, because breakthrough infections tend to be less severe since your body is better equipped with antibodies already to fight them. Similarly, people who have already had a COVID infection tend to have less severe symptoms if they get it again, though this isn’t always the case. That’s why even people who have already been sick with COVID should still get vaccinated because natural immunity + a vaccination is the best protection against reinfection. A good friend of mine died on Saturday from a second COVID infection. She lived in another country and was unable to get a vaccine because she was under 40.\n\nThere was a study done in Israel on vaccinations, prior infections, and the Delta variant. They found that compared to a single vaccine shot, natural immunity was better protection against reinfection against Delta. But two vaccine shots or a prior infection and a vaccine shot were better than natural immunity alone.\n\nGetting COVID is bad, even if you don’t die. Thirty percent of people even those with mild cases report lingering symptoms for months after an infection, some of them pretty debilitating. Some people who are hospitalized and don’t die end up with long term or lifelong organ damage. Even a short hospitalization with a full recovery can leave a person with thousands of dollars in medical bills. The overall effect of so many people being in the hospital with COVID is that we are all going to pay more for health insurance to cover costs. My premiums went up another 9% this year. Being vaccinated makes it 1) less likely that the virus will be able to infect you and 2) makes it less likely that you will need to be hospitalized or have a serious infection that leaves you with long term side effects.\n\nPeople are required to do a lot of things to protect public safety. It is weird that they have picked this hill to die on. The religious exemptions based on fetal cell line use are hypocritical because lots of common medicines like Tylenol and Tums used fetal cell lines in their development and they never had a problem with those things.", "opengraph": {"site_name": "The BioLogos Forum", "type": "website", "image": "https://discourse.biologos.org/uploads/db1313/original/2X/f/f961c6c80e26b70ee0d1d6cc9465706f024563cf.jpeg", "url": "https://discourse.biologos.org/t/covid-vaccinations/47016", "title": "Covid Vaccinations", "description": "I am deeply encouraged to find an Open Forum with many people who are united and compassionate towards differing opinions. I wanted to ask a few questions to clarify:  From what I understand, if you receive the vaccine you are still able to transmit Covid and can still be hospitalized. Is this correct?  It’s also my understanding that those who have previously been vaccinated have immunity built up for a few months so I’m wondering why those individuals would need to be vaccinated?  If most peop...", "ignore_canonical": "true"}, "tags": ["COVID"], "tweets": [], "movies": [], "links": [], "authors": ["03Cobra", "HRankin", "SaraBerk", "glipsnort", "Dale", "Christy", "jpm", "Terry_Sampson"], "publish_date": "2021-09-30T18:42:27+00:00"}