{"result_id": "049020", "URL": "https://biologos.org/resources/is-the-covid-vaccine-the-mark-of-the-beast", "timestamp": "2023-04-25 12:18:08 CEST+0200", "meta": {"description": "If you are not familiar with all the different strands of Christianity, this may seem like a strange question to you.", "lang": "en", "keywords": "", "favicon": "/favicon.png", "canonical": "https://biologos.org/resources/is-the-covid-vaccine-the-mark-of-the-beast", "encoding": "utf-8"}, "image": null, "domain": "biologos.org", "title": "Is the COVID vaccine the \"Mark of the Beast\"? - Resource", "cleaned_text": "Is the COVID vaccine the “mark of the beast”?\n\nIf you are not familiar with all the different strands of Christianity, this may seem like a strange question to you. But you may be one of the many Christians who is genuinely concerned about this question, and it is making you afraid of the vaccine.\n\nMy name is Curtis Chang, and welcome to Redeeming Babel, where our mission is to provide Biblical thinking in a confusing world. In this video, I want to explain why the COVID vaccine is definitely not the mark of the beast described in Revelation 13. I invite you to learn the reasons why I believe this so strongly, because doing so will help you read the Bible with greater knowledge and greater hope.\n\nHow one answers the question, “Is the COVID vaccine the ‘mark of the beast’ depends greatly on one’s reading approach to the book of Revelation, the final book in the Bible. The Christians who fear the vaccine being the “mark of the beast “ have been taught a particular reading approach: to read Revelation as a prophecy of “the end times.”\n\nI actually grew up with this “end times” reading approach. When I was 10 years old, as a kid in Faith Bible Church in the Midwest, I was given a comic book version of a very popular book among Christians during that time called “The Late, Great Planet Earth,” written by an author named Hal Lindsey. The book was influential in promoting the “end times” reading approach to Revelation.\n\nI remember very vividly the comic book illustrations of the “mark of the beast” passage. The drawing style made the world seem so ominous. I was afraid that some new technology in the world might actually be the “mark of the beast.” I was afraid that I might somehow get accidentally tagged by the mark. I was afraid that the end times were approaching. And I was afraid that the end times would happen before I got my first girlfriend. Seriously, I was really afraid of that!\n\nI no longer have those fears because over the years, as I have studied to become a pastor and now a seminary professor, I have learned to read that passage and the entire book of Revelation with a different reading approach. Let’s call this the “first century” approach.\n\nNow, from my years of study, I do strongly believe that the “first century” reading approach is more faithful to the Biblical author’s intentions.\n\nHowever, I’m also aware from my own personal experience how many Christians still adhere to the “end times” reading approach. And like I said, I know firsthand how much of an emotional impression that the “end times” approach can make.\n\nIf that is true for you, I’d like to invite you to just consider with an open mind the reading approach I’m about to describe. Think of it like this: you’ve been wearing one set of reading glasses. I’m going to offer you to try another set on. If you don’t think my version helps you see more clearly, you can always go back to your old one.\n\nWhen you’re trying on new glasses, it’s helpful to compare them side by side, to switch between the two and see which produces more clarity.\n\nI believe this side by side comparison can be characterized by the following:\n\nLet’s start with the first comparison: Reading an x-ray versus reading a crystal ball\n\nHere is the actual passage about the mark of the beast in Revelation 13:16-18:\n\nThe “end times” reading approach treats this passage like a crystal ball. In this approach, the author of Revelation was thousands of years ago gazing into the future, and predicting that some monstrous institution – “the beast” – would force everyone to adopt some practice, one that is somehow associated with the number “666.” And that event would mark the nearness of the end of the world.\n\nThroughout modern history, some Christians have used this reading approach to claim that a particular institution of the day was the beast predicted by Revelation 13. The institution was usually one that the reader was already suspicious of in the first place. When social security was rolled out in the 1930’s to political controversy, some opponents who were Christians labeled “the beast” as the administration of FDR, and the “mark of the beast” was the assigned social security number.\n\nIn the 1950’s and 1960’s, when giant telephone companies were seen as part of the shift from agricultural rural life to technological urban life, rural Christians labeled these companies “the beast.”\n\nThey said the newly assigned three digit area codes were the three digit “mark of the beast.” The same pattern occurred with large financial institutions in the 1970’s with the roll out of credit card numbers, in the 1980’s bar codes and 1990’s with computers and the Internet, in the 2000’s with RFID technology that can track objects, and so on.\n\nAnd now, it’s happening with the vaccine. The beast is the government, or the CDC, or some other institution. And the vaccine shot itself is the “mark of the beast.” There is even the false rumor that some sort of tracking feature is built into the vaccine.\n\nThe historical pattern of the crystal ball approach should alert us that something is wrong with this reading approach. With each crystal ball reading throughout the years, the end times does not occur as predicted. The predicted beast ends up not being that horrible. Yet, each generation keeps updating to another prediction, another match – again, with the match fitting pre-existing suspicions.\n\nThe Bible actually has very stern warnings about any one who presumes to offer any crystal ball reading. Deuteronomy 18:22 cautions:\n\n“Speaking presumptuously” means when someone is imposing one’s own feelings, including one’s own suspicions, on to God’s word. Anyone who tries to read Revelation as a crystal ball is especially risking this judgment of presumption because the author did not write it for this purpose. Reading Revelation as a crystal ball is actually misreading the kind of literature the book is.\n\nRevelation is a type of first century literature that as the title suggests, is meant to “reveal.” But what is being revealed is not primarily the future, but the spiritual meaning of the historic events happening in the first century world of the original audience. Revelation isn’t talking about “the end times” for most of the book: it doesn’t get to anything close to that time horizon until the very last chapters.\n\nRevelation 1:4 makes it very clear the intended audience:\n\nThe intended audience is the seven first century churches in Western Asia. The next three chapters makes this even more clear as John, the author, reveals the spiritual condition of those seven churches at the time of writing. He is casting a spiritual X-Ray to show them what is really happening in their own congregations.\n\nIn the ensuing chapters, John then trains this spiritual X-Ray to the wider world. There is nothing to indicate that he’s shifting time frames. He’s just shifting to the secular world, to revealing to first century Christians the spiritual meaning behind those first century world historical events.\n\nAnd this is where the crystal ball approach gets off track: it misinterprets Biblical X-Ray language for what we think is crystal ball language. The type of first century literature that does this kind of X-Ray reading of world events routinely used extreme metaphorical language to describe the underlying spiritual realities. So Revelation is full of passages that describe the sky falling, the mountains crashing, the seas erupting with beasts. If read literally, these passages do sound ominous, like the world is ending. And that’s why some Christians have assumed Revelation is making predictions about some future where the world quite literally ends.\n\nIt is helpful to remember that even today, we also use extreme metaphorical language to reveal the underlying spiritual or emotional reality behind significant world events. The virus has been described as an “earth shattering” event. The nation “held its breath” for the presidential election results. Obviously, the virus did not physically break apart the earth’s surface. Obviously, the entire country did not cease to take in oxygen for a week.\n\nWe have to read Revelation as using the first century version of such metaphorical language to reveal the spiritual and emotional realities of their first century world events. Since most readers aren’t familiar with first century metaphors or first century historical events, we should approach Revelation with a trusted and accessible Bible commentary. I personally recommend N.T. Wright’s Revelation for Everyone. Wright is probably the leading Bible scholar of the day and yet he writes in an extremely accessible and succinct fashion in this book. Also, our friends at The Bible Project have some excellent videos on this topic (and they’re much less scary than my Hal Lindsey comic book!).\n\nEven though I believe that Revelation cannot be read as a crystal ball, I can understand the attraction to this approach. The crystal ball approach – even if it is mistaken in my view – is nevertheless a way of making Revelation relevant to us today. If one only reads Revelation as revealing the spiritual meaning of first century world events, then what’s the point of us reading it today?\n\nThis gets to a second reading comparison. To explain this difference, I’m going to change metaphors a bit. I believe we have to read Revelation as a compass versus reading it as a map.\n\nWhen we are reading a map like this – and I realize that those of you under the age 20 may have never glimpsed such an object like this – we are making a one to one equation. This dot equals this specific town and this town only. This line equals this specific road and this road only.\n\nIf we want to read Revelation as a map making one to one equations, we have to do so with the first century world. We can do that with precision in the mark of the beast passage. It is historically documented that the first century Christians were under enormous pressure to conform to a growing practice of worshipping the Roman emperor. You can draw a one to one equation from “the beast” to the Roman emperor: it was common for Scripture to use the metaphorical language of beasts to reveal the dehumanizing and vicious spiritual reality behind pagan rulers. Revelation makes that equation even more obvious by identifying the mark of the beast as 666. There was a common code in first century Hebrew literature that identified letters to numbers, and in that code, 666 translates precisely into the word “Nero” – the specific Roman emperor of that day.\n\nSo, read as a map, the passage clearly wants the first century Christian to avoid bowing down to Nero and getting too closely identified with him. The language about getting branded with “666” is the metaphorical way of saying: beware that everyone in the first century world doesn’t brand Christians politically. Make sure that everyone doesn’t just assume Christians worship Nero like the rest of the pagan world.\n\nNow, if we want to discern the relevance of Revelation for our world today, we have to read the text differently. We have to read it like this thing: like a compass.\n\nA compass does not make one to one equations to a previously mapped world. Rather, a compass equips you to navigate your path in what may be an unfamiliar world. A compass gives you an orientation, a way to make your way in the world now before you. And a compass orients you by pointing you to the True North.\n\nNow, the two ways of reading – a compass and a map – are related. As we read Revelation as a map, we are seeing how the Biblical author was guiding the first century Christian church. We can trace God’s intended route for them. The more we follow those first century routes, the more we end up with a compass, “Oh so, that is how God wants his people to navigate the world in general.”\n\nSo, let’s try to turn Revelation 13 from a map into a compass. We should beware of any one to one connection that confidently equates “the beast” or “666” to any current political leader or current political identification. But we can read this passage as a kind of general orientation for Christians on how to navigate politics in our world.\n\nHere’s my reading of the passage as a compass: I believe it is telling Christians in general throughout all ages, to navigate their political world by avoiding any complete and total identification with any political leader or party – whether on the Left or the Right. Don’t bow down to any one leader. And as Christians, don’t let yourself get politically branded, such that being a Christian automatically equals being a member of a particular political party – whether on the Left or the Right.\n\nThat’s my version of reading Revelation 13 as a compass. You may of course discern your own version. I’m sharing mine simply to offer an illustrative example of what is an appropriate way to rely on Revelation to navigate our current world.\n\nChristians can differ on the specifics of how different Biblical passages operate as compasses. But what all Christians should agree on is the True North. The most important way that a compass guides navigation is by pointing you to True North. And this leads to my final comparison. This is reading with hope versus reading with fear.\n\nLike I said, the end times reading approach made me afraid of many things for many years. The tragedy was that causing fear is the exact opposite intention of Revelation. If you read passages like Revelation 13 as a compass, they are pointing to the final chapters of the book. This is when the book does shift its time horizon to the end. But it is the end, not of the very existence of the world, but rather the end of its struggles and suffering.\n\nThe final chapters of Revelation depict what has always been the Biblical picture of Christian hope for the world. Revelation 21:2-4 states it beautifully:\n\nNotice that the end is God coming down from heaven to earth to be with humans and restore humanity. The end is not some devastating series of events. The end is not the destruction of the world. The end is the return of God – in the person of Jesus – back to this world. To dwell with us, to wipe away every tear, to end death and suffering.\n\nThis is our true North Star. This is the future that gives us hope for this world. Reading Revelation all the way to the end assures us that even when it seems like the world right now is captive to tears, death, and suffering, that is not the final state. As Christians, we have every reason to live as people of hope, not fear.\n\nThe priority of hope over fear is the reason why all Christians should stop fearing the mark of the beast. Even if you want to stick with an end times reading approach to Revelation, you should avoid interpretations that create fear in you.\n\nThis is because all Christians have been given something even better than a reading approach. We’ve been given a personal reading guide. This personal reading guide is the Holy Spirit. The Holy Spirit is like a tutor at our side when we read Scripture, telling us, “No, don’t read it this, read it that way.” And how do you know when you are reading with the Holy Spirit’s active guidance?\n\nA Spirit guided reading leads you away from fear. Fear makes you feel powerless, suspicious (which is the opposite of love), and out of control. But the Holy Spirit seeks to give us a feeling of being empowered, being loved, and that things are under control.\n\nMost of all, the Holy Spirit points you to the True North, to the reassuring promise that our God will one day end suffering, disease, and death itself. This is why I believe that if you want to locate the vaccine in Revelation, don’t equate it one to one with the mark of the beast. Rather, locate the vaccine as a hopeful pointer, a compass indicating God’s promise that he himself will return one day to end all suffering and death.\n\nThe vaccine of course is just a pointer – it itself won’t end all suffering and death for good. Only God’s return to earth can do that. But pointers give us hope, they give us some indication of what is to come. The vaccine has the potential to do just that: to give us hope, to give an indication that there is an end to suffering and death.\n\nLet’s follow that pointer. Let’s be people not of fear, but of hope.", "opengraph": {"title": "Is the COVID vaccine the \"Mark of the Beast\"? - Resource - BioLogos", "description": "If you are not familiar with all the different strands of Christianity, this may seem like a strange question to you.", "image": "https://cms.biologos.org/wp-content/uploads/2021/03/Screen-Shot-2021-03-18-at-10.28.17-PM.png", "url": "https://biologos.org/resources/is-the-covid-vaccine-the-mark-of-the-beast/", "site_name": "BioLogos", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.bbc.com/news/52847648", "https://youtu.be/UNDX4tUdj1Y"], "authors": [], "publish_date": null}