{"result_id": "049044", "URL": "https://biologos.org/articles/from-smallpox-to-today-the-science-of-vaccination", "timestamp": "2023-04-25 12:18:26 CEST+0200", "meta": {"description": "An overview of how the first vaccine was developed and how vaccines work today to protect millions all around the world.", "lang": "en", "keywords": "", "favicon": "/favicon.png", "canonical": "https://biologos.org/articles/from-smallpox-to-today-the-science-of-vaccination", "encoding": "utf-8"}, "image": null, "domain": "biologos.org", "title": "From Smallpox to Today: The Science of Vaccination - Article", "cleaned_text": "There are many types of vaccine, but they all have in common the fact that a foreign material is being introduced into your body. This is the essential idea of how all vaccines work: not only must a foreign substance be present, but it must be recognized as foreign, which requires it to be delivered in a way that tricks the body into seeing it as something to counteract. Immunizing humans is made more challenging than animals by the fact that we desire to have very few adverse responses, so this aspect of vaccine formulation—including immune stimulators known as adjuvants—is limited to the mildest ones, which often means they are less effective. So the soreness in the area of a vaccine usually should not be seen as a negative side effect, but rather part of the main effect. It is a sign that your body is doing what it should be doing: working at the cellular level to develop long-term cell-based protection against disease. A sore arm for a day is a small price to pay. Of course, the science of developing newer better human vaccine adjuvants has also progressed along with a greater understanding of the molecules and cellular mechanisms that lead to an effective immune response.\n\nHopefully, this discussion has helped to shine some light of understanding on these strange and mysterious things known as vaccines. Perhaps the mystery and even fear that many face when getting their shots can be replaced with a more appropriate sense of true awe and wonder. It is truly wonderful and amazing that our bodies are able to defend themselves with the training provided by vaccines. Everyone should retain a healthy skepticism of anything you are being asked to take into your body, or any medicine for that matter, and seek answers to the basic scientific question: How does it work? This is just a good approach, and should lead to a personal investigation for well-sourced and reliable information from people who speak clearly and aim to educate, not instill fear, or sell a product or service.\n\nWhen we are vaccinated, we contribute to a societal effort to minimize disease. Several years ago, I spent a research sabbatical at the Dana-Farber Cancer Institute, in Boston. As a biologist who teaches immunology, and has a reasonably good idea of how vaccines do what they do, I tend to ask folks I meet—like my barber or other friends—whether they have gotten their seasonal flu vaccine, and it always surprises me how many don’t get it for various reasons. Well, at the Dana-Farber, you cannot work there without proof of having had the flu vaccine. You are required to display your “I’m vaccinated” sticker on your ID. So is the Dana-Farber just extra concerned that its staff and doctors are able to continue coming to work to do the essential research and care for their patients? No, that’s not the main reason at all! The reason to require vaccination of all working at the Dana-Farber is that the building is full of people undergoing chemotherapy who have a weakened immune system, and they must be protected. But this is also true outside of the hospital. You encounter all kinds of strangers continually as you move through the world. By vaccinating yourself, you are protecting those you encounter who for various reasons either cannot be vaccinated or are immune-compromised. Once a high percentage of the population is immune to a given pathogen, epidemiologists speak of “herd immunity” having been achieved.\n\nHerd immunity is a goal for societies to achieve. But what does this mean? Much like a herd that circles around and protects the young and vulnerable, a high level of immunity in a population protects those who are non-immune or susceptible to disease by preventing it from reaching them. This high level of immunity can come naturally from infection and recovery, or after widespread vaccination. Unfortunately, herd immunity may not be easily achievable naturally for some diseases. Natural herd immunity is harder to achieve when, like measles, the disease spreads easily. Interestingly, with COVID-19, superspreader incidents suggest it also may be hard to rely on any natural herd effect for protection.\n\nAlthough it may sound funny to refer to ourselves as part of a herd, in the context of immune protection and from the viewpoint of a virus, that is what we are. We are biologically very much a part of the natural world. Of course, scripturally and theologically, Christians believe we are much more than the other animals—God cares about us personally (1 John 4:10). Yet, the Bible also refers to our sheep-like personal tendencies (Isaiah 53:6), and this should give us pause as we realize that even at the cellular level the reality of our animal-like biology is more accurate than we may like to admit! Certainly the pandemic has provided a strong motivation for each of us to learn more about the science of vaccines, and as the field is rapidly developing, unless you are one of the heroes working directly in vaccine development, there is something for everyone to learn.", "opengraph": {"title": "From Smallpox to Today: The Science of Vaccination - Article - BioLogos", "description": "An overview of how the first vaccine was developed and how vaccines work today to protect millions all around the world.", "image": "https://cms.biologos.org/wp-content/uploads/2020/06/administering-vaccine-WEB.jpg", "url": "https://biologos.org/articles/from-smallpox-to-today-the-science-of-vaccination/", "site_name": "BioLogos", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3383374/", "https://www.publichealth.org/public-awareness/understanding-vaccines/", "https://coronavirus.jhu.edu/from-our-experts/early-herd-immunity-against-covid-19-a-dangerous-misconception", "https://www.scientificamerican.com/article/how-ldquo-superspreading-rsquo-events-drive-most-covid-19-spread/", "https://www.biblegateway.com/passage/?search=1%20John+4:10&version=MSG"], "authors": [], "publish_date": "2020-06-26T06:00:34.000Z"}