{"result_id": "049001", "URL": "https://biologos.org/podcast-episodes/curtis-chang-and-david-french-christians-and-the-vaccine", "timestamp": "2023-04-25 12:17:51 CEST+0200", "meta": {"description": "Curtis Chang and David French talk about the rise of vaccine refusal, the spiritual problem which causes it, and how to broach these tricky territories with friends and family.", "lang": "en", "keywords": "", "favicon": "/favicon.png", "canonical": "https://biologos.org/podcast-episodes/curtis-chang-and-david-french-christians-and-the-vaccine", "encoding": "utf-8"}, "image": null, "domain": "biologos.org", "title": "Curtis Chang and David French | Christians and the Vaccine - Podcast Episode", "cleaned_text": "To be a Christian is to say what is necessary is not just what is necessary for me, that my view on rights is not just my own personal rights, but that in the whole biblical model of Jesus is laying down one’s rights on behalf of the others.\n\nWhen you’re considering this action in the middle of a pandemic that has taken more than 500,000 lives and massively disrupted the American economy and the daily habits of life of all of us, the idea that evangelicals would be least likely to consider the health effects of the community communicates that that’s not a problem susceptible to being dealt with with a clever fact check. That’s a problem that is dealing with where are your priorities? And that’s when we get into spiritual issues.\n\nI’m Curtis Chang, theologian and former senior pastor with faculty appointments at Duke Divinity School and a Senior Fellow at Fuller Theological Seminary.\n\nI’m David French. I’m a Senior Editor at The Dispatch and a columnist for Time.\n\nWelcome to Language of God. I’m Jim Stump.\n\nIt has been exactly one year since we released our first COVID episode, called Science and Faith in Pandemic Times. Then we speculated about how long it might take to develop a vaccine — hoping against that hope that it might be ready within a year. Here we are, a year and more than half a million deaths later, but now several vaccines have been developed, tested, and distributed. I’ve had my two doses of the Pfizer vaccine, and hope those around me will get theirs soon. But one of the things we didn’t really anticipate in that episode a year ago was the public reaction and division that has come about, specifically around the refusal to wear masks or get the vaccine. A recent PEW survey has found religious groups to be the worst in this regard, with White evangelicals leading the way among those who are most unwilling to receive a vaccine or to consider the health of their communities. Yikes.\n\nOur guests, Curtis Chang and David French are both deeply committed to evangelical Christianity. They have partnered on a new video project with the goal of dispelling some misinformation about the vaccine and connecting the benefits of a vaccine to a deeper priority that comes straight out of an evangelical faith worldview. Whether you are pro-vaccine and wondering how to talk to your friends and family or hesitant about it yourself, David and Curtis share a way of thinking about the vaccine which is both persuasive and gracious.\n\nLet’s get to the conversation.\n\nDavid French and Curtis Chang, welcome to the podcast.\n\nThanks for having us.\n\nIt’s great to be here.\n\nWe are going to talk primarily about Christians and the COVID vaccines. But first, let’s get to know you a little bit. Curtis, you’ve been a pastor and now a seminary professor? Is that the career path you have always been on?\n\nNo, actually I’ve had a pretty diverse career path. I started in campus ministry, then I became a senior pastor. And then, actually for the last 15 years I’ve been running my own consulting firm in the secular world, while at the same time, still, you know, involved in theological circles. And so in some ways this particular project I’m working on represents the intersection between my two passions and loves of theology and the church along with engaging the secular world.\n\nWhat was your religious environment growing up?\n\nI grew up in a fundamentalist church. My family was not, they were not Christians. I was the first person in my family to become a Christian through a fairly fundamentalist church in the Midwest, a Bible Church. And then my own discipleship has continued to evolve out of those but I still draw actually a lot of my own inspiration and spiritual lifestyle date back to those days. And in some ways, even though my theology may have evolved, the fundamental, so to speak, relationship with Christ goes back to those days.\n\nAnd David French, you’re a writer and political commentator. Your Wikipedia page says you toyed with running for president back in 2016. Has your professional life turned out the way you thought it would when you were younger?\n\nOh, no. Well, considering that my professional life when I was younger, was shaped by the movie Top Gun and I wanted to be a fighter pilot. I would say it’s a little just a little different. Yeah, I’ve kind of bounced all over the place. I graduated from college in Nashville and literally had no idea what to do with my life. And so I went to law school kind of as, you know, your sort of option-expanding choice when you’re graduating with an undergraduate degree in political science. And then from there, I’ve done a bunch of different things. I was a big firm litigator for a while. I taught law at Cornell Law School for a while. I was a constitutional litigator for Foundation for Individual Rights in Education. I was president of FIRE for a while and head of the Center for Academic Freedom at the Alliance Defending Freedom. And then in 2015, I hung up my litigation spurs and went full time into the world of journalism and commentary. And that’s where I’ve been since. I started in National Review. I had been writing for National Review for a while but full time at National Review in 2015, and then jumped over to The Dispatch with my good friend Jonah Goldberg and my good friend Steve Hays. And as I tell a lot of people I have more fun professionally than any lawyer should be permitted to have.\n\nAnd how would you describe the religious community you came from and are part of today?\n\nYeah, so I have the most boring personal testimony imaginable, which is I grew up in a Christian family and don’t remember ever not believing in Jesus. So I don’t have one of these you know, dramatic conversion stories. But I grew up—I have changed my church community quite a bit. I grew up—I can out fundamentalist Curtis. [laughter] I grew up in the Acapella Churches of Christ. And so which a lot of folks may know, especially back in the 60s, 70s, 80s—I was born in 69—was quite fundamentalist and sectarian. And went to a church Christ college, Lipscomb University, which I love and had a wonderful time there. And since that time, after I got out of college, I began a spiritual journey and I was just ultimately predestined to be a Presbyterian. So I’m a member of a PCA church here in Franklin, Tennessee.\n\nYou two, are not just a couple of random people we’ve thrown together but have known each other for a while. Curtis, how did you get to know each other? And what got you to join together on this vaccine project?\n\nYeah, well, David and I’ve actually been friends for 25 years. And the center of our friendship is actually a fantasy baseball league that’s met for 25 years, gets together every year. And then in between that—you know, to do the draft, which is mainly an excuse for us to be together and do crazy things. And then during the year, between our reunion at the draft, we’re in a pretty constant email community. And one of the beautiful things about this community is how our lives and projects professional projects can often intersect. So David and I intersected 25 years ago on some religious liberty work that David did. And then over the years, we’ve, you know, just tried to support each other. When David was sent to Iraq, when he was enlisted in the Army, the Baseball League kind of rallied around that to send care packages to his unit. And then so we’ve just always been a support to each other, even though we work in very different fields and have different, even different political affiliations. We’re kind of all over the place as a league. But we know we have each other’s back, we’re a band of brothers, so to speak. And when I felt, you know, sort of this sense that we were facing a real crisis and opportunity around this vaccine issue, you know, as a theologian, I could have just remained very narrowly in my sort of theological or church facing world. But the fact that I was friends with David made the possibility of actually doing something bigger, to reach a bigger audience, completely possible. And so this is really, it’s a project born out of friendship more than anything else.\n\nVery good. David anything to add to or correct in that account from Curtis on the personal level?\n\nNo, no. It’s, you know, really, I think Curtis put it well. It’s a band of brothers from really a wide variety of walks of life. And yeah, Curtis is right. We became friends through baseball, and we’ve remained friends through many different phases of life.\n\nAnd David’s baseball prowess is, you know, is a great boon to me because it ensures that I’ll never finish last in the league.\n\n[laughs] Well, I’m glad to hear that baseball has provided the great equalizer there of friendship and lasting camaraderie. Maybe that’s the moral to all of this, that we need more baseball in our lives.\n\nBut let’s start working toward our main topic, which is this new video series Curtis has produced. But before telling us directly about that, I’d like to hear some about the problem that the video series is attempting to address. So, David, you wrote your newsletter last week with the title, The Spiritual Problem at the Heart of Christian Vaccine Refusal. So there are a couple of things that jump out from that title that have been indicated by recent survey results. And I’d like to ask you to comment on these. So these two things first: that Christians are refusing the vaccine and second, the reason they’re doing this is a spiritual problem. So summarize, if you could, your analysis of these survey findings, you’re talking about.\n\nYeah, that there was a little bit of a reaction to that argument. But it’s grounded in some pretty concrete data. So if you look, for example at a recent Pew Research Center poll, and it looked at basically every major category of American religion, from white evangelical, white not evangelical, black Protestant, Catholic white, Catholic Hispanic, atheist, agnostic, the nones. The subgroup of Americans that is most apt to refuse the vaccine, either definitely or probably will not get it, is white evangelical. And it’s not all that close. So 54% say they definitely probably will get it, 45% definitely probably will not. The next closest is 64% on black Protestants and nones that they say definitely probably will. If you drill down and you look at it, the 45% that definitely will not or probably will not—again that’s a ten or a nine point gap between the next closest—so you had a situation here where white evangelicals are an outlier. They’re an outlier from every other religious tradition, including religious traditions similar to theirs. And so you drill down into it and you start to ask well, why is that?\n\nWell, part of it is there’s some partisan affiliation in there and if you look at the community of Americans, from a political standpoint, who are least likely to want the vaccine then it’s going to be Republicans, white republicans and leaners are among the most likely to refuse a vaccine. And white evangelicals, as most people know, are very, very, very Republican. So there’s some of this is wrapped up in partisanship and some of it is a little deeper. Also in the Pew poll what we found is that white evangelicals were the least, least likely to say they should consider the health effects on their community when making a decision to be vaccinated. Only 48% of white evangelicals said they would consider the community health effects a lot when deciding to be vaccinated. This compares with 70% of black Protestants, 65% of Catholics and 68% of unaffiliated Americans. And so not only do you have a situation where you have a—the white evangelical community is an outlier in vaccine refusal, they’re also an outlier in considering the health of their own community. And so what this suggested to me is that you have not just an information problem in this community—in other words, is the vaccine safe, is it is taking it consistent with pro-life principles—you also have, I think, a spiritual problem in the lack of regard for the health of your community. That’s not so much of an information problem, what you’re getting there is where a priorities problem. When you’re considering this action in the middle of a pandemic that has taken more than 500,000 lives and massively disrupted the American economy and the daily habits of life of all of us, the idea that evangelicals would be least likely to consider the health effects of the community communicates that that’s not a that’s not a problem susceptible to being dealt with with a clever fact check. That’s a problem that is dealing with where are your priorities? And that’s when we get into spiritual issues.\n\nSo you say an information problem and a spiritual problem and quoting from your newsletter, you go on to say, “yes, you can and should flood the zone with more and better information about the safety and effectiveness of the vaccine. But we also need to flood the zone with better and more effective spiritual teaching about loving our neighbors and critically about trust, faith, and courage.” So Curtis, here we come to your project, Christians And The Vaccine. Tell us a bit about this project and how it addresses both the information and the spiritual problems that David was just telling us here.\n\nSure, yeah. And so to give you an example of what we’re trying to do. First of all, just to say the format of the resources is short, shareable videos on specific questions that people really are asking. Questions like can I be pro life and pro vaccine? You know, can black Americans trust the vaccine? Is the vaccine a form of government control? We even have a segment on is the vaccine the mark of the beast? Because we know that the question is really out there. And I, actually from my own religious tradition, from my childhood, that would have been a question I would have been asked and been afraid of. And so what we’re trying to do is address people where they’re at. So these are real questions they’re asking. We’re trying to take them seriously. But we’re trying to address the spiritual presuppositions and positions and assumptions that are responsible for those Pew survey results. So a good example is the issue of trust. You know,\n\none of the reasons that—I think the fundamental reason for distrust of the vaccine is you just trust the experts and institutions telling you this vaccine is safe and it’s necessary and effective. And so what would that video, for instance, is trying to do is to try to get people to think it just a little more critically about this issue of trust, and trying to get them to see that, for instance, they already trust the very institutions that are telling them to take the vaccine and the vaccine is safe. And say they already do that every time they buy some medication, they’re trusting the FDA, every time they get a medical procedure, they’re ultimately trusting foundational research behind that procedure done by the NIH. And so…\n\nOne of the examples you give us every time they buy a hamburger at McDonald’s, right?\n\nAbsolutely. We’re always trusting institutions and experts to navigate life. And here’s the spiritual point to that is, that’s a good thing. That is actually how God designed human beings to live and operate and work and navigate the world, is to trust. Now, of course, we have to trust the right institutions. And a lot of our problems this day is that, you know, the right institutions that have credibility and expertise and authority and have been instituted, I believe, by God in the Romans 13 sense, instituted by God to speak on these matters, are getting drowned out by a lot of misinformation and the wrong kinds of entities. But the fundamental need to trust the right institutions is a biblically designed way that we’re supposed to navigate the world. And I’m trying to call people back to that, in a cultural moment when we are so prone to reflexively distrust everything and anything.\n\nWe will dig into some more of that in just a second. Let me say at this point, though, that these videos are really well done, we’ll link to them and our show notes here. But they’re also very easy to find by going directly to christiansandthevaccine.com. There are eight of these videos so far. Are there more in the works?\n\nThere are. We hope to have some others that will be responding to other questions that are emerging from the conversation and hopefully to get some guests even to speak to some of the issues that are out there.\n\nGood. Well, I hope everybody listening to this will watch the videos, share them with people who might genuinely consider the message. And BioLogos is thrilled to join with you in getting this word out. But now, I don’t want our entire conversation here to be just a big commercial and want to dig in a little bit to some of these more substantive issues that are brought up. You’ve just been talking about trust. Let’s push that one a little bit further. BioLogos has been in the business of trying to persuade people to the—primarily Christians—to the truth of certain scientific findings. And pretty early on we realized it just doesn’t work to simply plop down a bunch of scientific information on the table and say, “see, here’s all the data, the conclusion is obvious.” So you’re making the case in your video that the question of whether I should take the vaccine boils down to trust, and I’m quoting you here from the first video, you say, “my trust in the vaccine is not based on my direct understanding of all the scientific details. I trust the vaccine because I trust experts who are tasked with understanding the science for me.” And I think that could be applied to lots of different kinds of decisions we make, but of course it only raises the question of which experts to trust. They don’t always agree. And you can always find someone with a PhD to support your theory, can’t you? So give us a little more guidance here on which experts to trust? Or how does my community come to determine which are the experts of our community in a particular topic like that?\n\nIt’s a great question. And I think there’s a number of different, frankly, even biblical principles to use there. And I’ll offer one of them, which is the track record. You know, the biblical vision of prophets, for instance, is explained in Deuteronomy 18, is very much predicated on, hey, you’ll know a true authority figure a prophet by the fact that what they say is going to happen actually happens. Like their track record actually is supposed to be a way in which Christians are supposed to apply to how they evaluate which experts and which institutions to listen to. And so I think that’s one very important one is, what is the track record of all these institutions, both in terms of how they do they have a long history and tradition of expertise, of making the right calls, the right judgments? They’re not going to be perfect. No one is perfect. But fundamentally, are they hitting it right much more often than they’re wrong. And that’s where I think a lot of the misinformation floating out there is just neglecting this basic biblical principle from Deuteronomy 18 that pay attention to the track record.\n\nDavid, you spend a fair bit of your time communicating and arguing, presenting evidences on the internet. Has the internet, this great leveler of sources of information, made trusting a more problematic feature of our lives today?\n\nYou know, that’s a really good question. It’s hard to say. I mean, Americans have had an affection for conspiracy theory for a long time. But I will say that the combination—and I’m not necessarily going to say the internet—but I think the combination of an extreme degree of polarization with this sort of ability to find some PhD somewhere who’s going to tell you what you want to hear, has really amped up our trust problems. So that one of the reasons why you have so much less trust, and one of the reasons why I talked about the partisan angle to this is people are accepting or rejecting important medical or legal, or you name it kind of ideas, depending not so much on the merit of the idea, but the source of the idea. So I’ll give you a good example, staying within the COVID Arena: the masking culture war. Now, if you had started the, you know, at the start of this pandemic, I would have said, the last thing that I think that we’re gonna actually have a culture war over is whether or not to wear a mask in a pandemic brought about by a virus that attacks the respiratory system. But we ended up, and we still have to a large degree, a masking culture war. How does something like that happen? And my friend Rob Dreyer, who writes for the American Conservative had a really insightful post not long ago, where he talked about that the mask became a condensed symbol of elite progressive decision making in elite progressive governance. And so what ended up happening was your resistance to the mask became a cultural symbol of your resistance to sort of elite secular progressive governance. And so this wasn’t a decision that was sort of everyone sat down and they looked at all the various peer reviewed studies and came to one conclusion or another. It began to be channeled into this partisan frame and lens. Now on the one hand, you might say, well, what about the vaccine? How could the vaccine be in that same partisan lens when it’s actually the product for example of Operation Warp Speed and the Trump administration’s very successful effort to really bring a vaccine to market in record time, just extraordinary achievement in bringing it into market in record time. But it’s still coming through an elite superstructure and being strongly advocated by a superstructure that a lot of white evangelicals just flat out, don’t trust. And so there’s a lot of this that goes back to partisan distrust and institutional distress that’s related to our national polarization. And so that, in many ways, is one of the hardest nuts to crack. And so my first advice, when you’re talking to anybody about the vaccine, is know your audience. Why do they mistrust? Sometimes it’s because of these sort of deep, very deep seated partisan reasons. And for some, it’s something very simple and quick to deal with. Just the other day, for example, I had a friend of mine who works for TSA, and in the National Airport called and he said, “we’re all getting the vaccine, I have one concern and I don’t want the vaccine because of this one concern.” And I was able to deal with that one concern, he was like, “great, I’ll get the vaccine.” That’s easy. There are others for whom it’s a lot harder. I had a friend who finally bargained with his mother, and said, “if you get the vaccine, I know you don’t trust it, nothing I say will make you trust it, but I tell you what, if you get the vaccine, I’ll stop dipping snuff.” [laughs]\n\nYou go with what works, because it’s so important. And don’t feel like you have to transform their whole worldview. You know, don’t feel like oh, well, I’m going to make you trust medical elites and then I’ll persuade you to take the vaccine.\n\nHi Language of God listeners. We wanted to take a quick break from the episode to tell you about the BioLogos resource centers found at our website, biologos.org. You’ll find articles, videos, and other resources curated for pastors, educators, youth ministry, campus ministry and small groups. Help bring the science and faith conversation to the places that are important to you. Just click the resources tab at the top of the page. Now back to the conversation.\n\nSo I want to try to drill down a little further, even into some of the partisanship you’re talking about here. A few years ago, I became aware of Jonathan Haidt’s work on moral foundations that drive our decision making. He’s a social psychologist, probably best known for his book, The Righteous Mind. And David, I’ve seen you refer to his work too. The gist of it is that there are these deep seated values that drive most of our decision making at an almost unconscious level, right? And that most of the conscious reasoning we do is simply marshaling arguments to justify what we’re already committed to. So no matter how good my argument is, if it isn’t somehow connecting to the values of the other person, it’s going to fall on deaf ears. So I wonder if you’d comment further on this partisanship where Haidt shows that many on the left value care and fairness as these fundamental kind of rock-bottom moral values and think that all they have to do is show how someone’s decisions are not in line with those foundations and that should get them to change. But many on the other side hold to freedom and sanctity as moral foundations that are just as if not more important, right?\n\nYeah, absolutely. And understanding what actually motivates people—that’s a huge part of knowing your audience. I really like how Haidt uses this metaphor of a rider and an elephant.\n\nYeah, explain that for the audience here.\n\nSo essentially, what he says is, if the rider is the person who you believe has got the reins, it’s the person at the top of the elephant, and we spend a lot of our time aiming our conversation at the rider, sort of this what we think of as the rational part of our mind that’s going to weigh and evaluate evidence and make decisions according to reason and evidence. So we talk to the rider and we talk to the rider and we talk to the rider. But what we forget is the elephant is sort of all of the rest of us. It’s our sense of community. It’s these core underlying values that you talked about. And you can convince a rider but if an elephant doesn’t want to move, the elephant is not going to move. And so if you really want to connect with somebody, if you really want to persuade somebody, you connect with the elephant part of them. And to go back to my conversation between my friend and his mom about the vaccine, when they struck this bargain, where was the elephant there? The elephant was her love for her son. And her ability to, her willingness to sort of say, “I’m going to do something I don’t necessarily do, I’m maybe a little bit worried about, but if it can get me to get him to stop doing something I think is dangerous, it’s worth it.” That was sort of the elephant there was this, “hey, I’ve got this incredible, you know, this incredible concern for my son and I’m going to bargain on this basis.”\n\nAnd I think what we often do is we forget about these elephants. And some of them include the fact that a lot of times when you’re talking to people who are rejecting a vaccine, and you’re talking, what you’re really communicating with is not just this person, but their community, maybe a Bible study where people have traded sort of stories about the problems with mainstream medicine, and how alternative forms of treatment have been very, very, very effective. Maybe they’re part of a political community, that if they break with their particular political community, whether it’s wearing a mask, or whether it is agreeing to take the vaccine, you’re going to be fracturing friendships. I mean, these things matter just a ton. And so to know where people are, know what the elephant is, is the real battle. And one of the things that Haidt has said is that so much of persuasion is about community. That if somebody—if there is a community that somebody wants to belong to, the rider part of themselves will figure out a way to make that reasonable. Right? Where the elephant wants to go, the Elephant is going to go, and that’s one of the reasons why I say, for example, in my piece, is that you’re just not going to sit there and say, you know, to somebody that you love, you don’t lead with, “trust the CDC.” If you have a bond with that person, you lead with the personal bond, you know, “look, this is me, you’re talking to not Fauci, not somebody else, it’s me, and I’m taking the vaccine, and my wife is taking the vaccine, and my kids are going to take the vaccine and here’s why we’re doing it.” And until you get much more to that sort of elephant part of the relationship which is that mutual love and bond that people have for each other in family and friendship. And I think that that’s where you really have to move. And then that rider will want to move with the elephant.\n\nJim, if I could step in here, just to underline how important David’s point is and his real great advice, practical advice is, for especially for your listeners. Because I’m going to go out on a limb and think that the typical listener to a BioLogos podcast themselves are not actually doubting at all the efficacy or the safety of the vaccine. However, if the statistics of a Pew are saying is accurate, many of your listeners have friends and especially family members who are aren’t following that road and are, you know, participating kind of in a different culture. For those folks, your listeners may be the one best shot God has to reach the elephant because of that relationship. And I think David’s exactly right. The key, I think, for your listeners, is to consider, is not to lead with the marshaling the data that can oftentimes you know, sort of, at least unintentionally sound condescending, kind of unintentionally reinforce the educational divides or discrepancies in the relationship, but to instead establish commonality based on love, history, care. And I think those are powerful elephants to appeal to. And I think that can be often times the particular role. And just to say, if some of your listeners are wondering, how do I do that? How do I reopen the lines of communication so that I can appeal to those relationships? That’s exactly why we created the videos in this kind of shareable format is that sometimes it’s just easier to open up a communication by saying, “hey, I came across this video, thought you might want to watch about it, let me know if you want to talk about it.” Like that could be just, that could be a great way to reopen the relationship.\n\nWell, let me point to two of the videos in particular that might illustrate this a little bit further, because I think these show really well the underlying kind of moral values that the elephants that may differ between different groups of people and how they resolve some of these questions. For instance, we might say, “get the vaccine, don’t go to in person worship services because you should care about your neighbors.” And some people in our community might respond in a way that doesn’t even really engage that line of argument because they so value freedom, and fear that all these public health measures are just ways of government controlling us and so should be resisted. So you address this, Curtis, in the video that’s entitled, “is the COVID vaccine a form of government control?” But now invoking my inner Jonathan Haidt here, I worry a little bit that it’s merely responding to the deep seated concerns about infringement of liberty by saying, “yes, but shouldn’t we care about others?” I’m hoping you can quell my worries about that one, or at least that we can talk about it a little further and sort out what the issues are here.\n\nYeah, well, I think actually that’s a good example of where sometimes you can appeal to the existing force of an elephant, such as the relationship, but then sometimes you actually have to convert the elephant, and that’s hard work. But sometimes you do. And this, the issue you’re naming, is one of those. Is to say, yes—you can start by affirming the fact that yes, it’s a legitimate concern about form of government control, that in the pandemic, we can point to specific examples and validate that fear of government overreach at churches and Christian gatherings. So you know, our video tries to affirm that and say, that’s a real legitimate concern. However, here’s the biblical way of how Christians sort of are meant to respond to that fear. It’s through prayer, persuasion, legal action only as necessary. But it’s not through outright disobedience. You know, Romans 13:1 is clear on that. And then we try to pivot to actually—really do persuade to say, look, there is this other value that actually is even more important. And that’s where to be a Christian, is to say, what is necessary is not just what is necessary for me. That my view on rights is not just my own personal rights, but that in the whole biblical model of Jesus is laying down one’s rights on behalf of the others. It is to say that what is necessary is to adopt the posture of a servant. This is fundamental to the gospel. And that is a conversion. There’s no getting around that, that that’s a conversion of a deep value that is centered not on yourself and your rights and what’s best for you, but really what’s best for others, laying down our rights for the sake of the greater good in the model of Jesus. So there’s no easy—that’s conversion. That’s a public expression of the gospel that we all must be converted to. We must all repent and actually follow that way. And I don’t think there’s any way around that conversion necessity.\n\nYeah, I was just gonna say, one thing I think that is, that I have found, is an awful lot of the folks who raise questions about government control in the pandemic are people where their elephant, their sort of identity that they attach, their political identity, is one that is deeply rooted in sort of the founding principles of the country, deeply rooted in the Constitution. And one of the things that I did going all the way back to the start of the pandemic was to illustrate how much the response to pandemics—including a very aggressive state response to the pandemic—has been baked into our constitution since the founding. And and, you know, because we hadn’t faced a pandemic, a deadly pandemic, in 100 years, there’s just a giant amount of history that we didn’t know, that we had no idea about. I mean, if you go back to George Washington’s response to smallpox during the Revolutionary War, if you’re talking about the 1824 case of Gibbons v. Ogden, which says that states have sovereign authority to enact quarantine laws and health laws of every description, if you go to the 1905 case of Jacobson v. Massachusetts, dealing with mandatory vaccinations in the midst of a smallpox epidemic, and you can show people how actually what we have just experienced In the last year—which is not to endorse every single action of the state, for example, I’m a religious liberties attorney and there have been, there’s been disparate and worse treatment of churches that I think the Supreme Court has properly stepped in to address—but one of the things that I have found is, people just don’t realize how much the American Constitution from the ground up, from its inception and from the inception of the Constitutional Republic has granted authority to states to deal with public health emergencies in a way that temporarily can can restrict personal freedom. And I think that’s something that a lot of people, they just look at what happened in 2020, and said there’s no precedent for this. And I looked at what happened in 2020 and I said, there’s precedent going back to before the founding, that the founding fathers themselves implemented for this. And when you get an actual chance to talk to people about it, then “oh, okay, I see this, I understand this,” if they’re already existing constitutional conservatives.\n\nAnd then some of the other things is you can just sort of draw some pretty nice analogies. I mean, if you’re talking about masks, for example, and someone says, where’s the constitutional authority for a mask mandate? Well, where’s the constitutional—it’s the same constitutional authority as exists, or in fact stronger, than for public decency laws. So if I don’t have the right to take pants off [laughs] in the public square, you know, the actual public interest in not seeing me nude is less than the public interest in me not spreading a potentially deadly disease, although there’s a high public interest in both. And so a lot of this, I think, is there’s been a lot of misunderstanding about the historic role of the state, constitutionally, in a pandemic. And so that it’s allowed for a lot of misunderstandings to flourish. But again, that’s something, that’s an argument that’s persuasive to somebody who’s already has a lot of presuppositions such as, “hey, I really want to know what the foundational constitutional order is supposed to be.” And that answer is easy to state.\n\nYeah, it seems that there is an example where information really does help to bring about at least kind of reconciliation of my values to what is needed. There’s another example here and another one of the videos I’d like to get the two of you talking about is one where I’m wondering if that same thing can happen or if there’s something even a little deeper that we have to try to sort out. Because another of the moral values that Jonathan Haidt identifies is sanctity. And clearly the pro-life movement draws deeply on it and talking about the sanctity of life. And one of the objections to the vaccines from Christians very recently, this is in the news today again, has been they use fetal tissue in making the vaccines. So Curtis your video Should Pro-lifers Be Pro-Vaccine addresses this very nicely. And let’s start at least with the misinformation that any of the vaccines actually contain aborted fetal tissue, and then we’ll see where we push to and the deeper ramifications. But what’s the actual situation?\n\nYeah, this issue is a great example of that it’s a “both-and,” that it is both an information problem as well as a spiritual imagination problem, if you will. So on the information front, the misinformation that you really have to address is the idea that there’s any fetal tissue in the vaccines themselves. That is just flatly not true. None of the vaccines contains any fetal tissue, nor any descendants of fetal tissue. So and this is where the information key point to realize is what we’re really talking about when we’re talking about a connection to fetal tissue and abortion is this concept of a cell line. A cell line is the long line of cells that descend from some original cell, cultivated, sometimes from a fetal tissue, sometimes from an abortion, long ago. But the cell line or the descendants, they’re often over decades, replicated in labs, reworked, modified and so forth. They are not themselves—the cell line themselves are not fetal tissue. They are off descendants, you know, many generations removed and decades removed from the original cell that was cultivated.\n\nSo where this controversy comes in is that the vaccines—and they use them in slightly different ways—but they all either in the research, development or the or the manufacturer of it, rely on the cell line to make the actual vaccine, which by the again to underlie does not, the vaccine itself does not contain any fetal tissue or even any cell line. But they are used—the cell line is used in various ways in the vaccines for these sort of development purposes. So that’s the information problem.\n\nNow the the spiritual imagination elephant part of it is people can still feel like, “oh, that’s still feels like I’m touching evil,” if they view abortion as an evil, which of course many rightly do. And this is where you do have to do the spiritual work of helping them to imagine what is the actually the Christian imagination around cleanliness? It is not—and the gospels are absolutely clear on this—it is not found by keeping your hands clean of any touching. I mean, this is the repeated controversy that Jesus ran into with the Pharisees, right? It is not to be—cleanliness is not found by that. And that there’s a clear distinction biblically from the impact of something that was tainted by guilt, and then actual guilt itself.\n\nYou give some nice illustrations, I think, to help us think about this, about that difference between the guilt versus the impact and whether we benefit from things that we wouldn’t approve of necessarily. So for instance, tell us about the railroad that was built out there to the west coast where you are.\n\nSure. Yeah, this is analogy I often used to describe this. I live in California and every sort of major solid, large good shipped to California, my car or whatever like that, gets shipped to me, railroad lines. Those railroad lines follow the pathway laid down by the original transcontinental railroad. Now, as a Chinese American, I know the history of those original lines that were laid down, and there was an enormous amount of racism, lynching massacres, that happened as part of that process. So I am being impacted every time I receive some shipped railroaded good to me. I’m impacted by those lines that were originally laid down through some act of institutional racism. But that doesn’t make those current railroad lines guilty, nor the fact, or me guilty by receiving those things. It’s just an inevitable result of the fact that we live in a fallen world and that we’re all ensnared in touching lines that if you’d go back far enough, you can trace to some wrongdoing. And so today’s cell lines are like those railroad tracks. They’ve been laid down on tracks, that if you go back far enough, yes, you can definitely identify some wrong in doing that. But that itself does not translate into the current benefit derived from those lines as something that’s guilty or wrong.\n\nDavid, maybe I can get you to weigh in here too. And I’m thinking particularly in a fallen world, is there anything in culture that isn’t tainted by sin sometimes? Every time I fill up my car with gas or buy a pair of sneakers or drink a Coca Cola, isn’t there something going on in the production or the origin of this that we as Christians would not want to associate ourselves with? And are those—do you see these the same as this issue of our proximity to abortions, if we’re using medical technologies that have benefited from them?\n\nYou know, I really appreciated Curtis’s video on this point. And I think he did a really good job of demonstrating how far removed these vaccines are from, you know, from the conduct and from the behavior that Christians rightly condemn. And I do think that, you know, this is something—and the railroad analogy is very interesting—and it’s something that extends in a lot of ways where we often take something that is good in and of itself, a vaccine is good in and of itself—everything. Food, drink, those things are good in and of themselves. And we will often sort of say, okay, well, how much am I going to evaluate how this good thing was created and produced? And that’s a valid question to ask. I mean, it is a valid thing to say, for example, I may not want to watch a movie that was filmed with the permission of the Communist Party of China in the very region in which Uighurs are being viciously oppressed and the film thanks the Communist Party of China, or the People’s Republic for its cooperation in creating this film. That’s something where the evil that you are targeting, and the evil that you’re rightly condemning is very closely connected to the product that you’re consuming. But there’s also very real limits to that approach that’s going to try to ask us to sort of enquire and ask about running all the way down the line, how good was each entity involved in the production of this product? And I’m reminded, I was at a pro-life convention not long ago, and I was speaking and right after I finished my speech, someone came up to me and and was angry at me that I had a coffee cup in my hand from a certain coffee company. And they said, “why would you drink coffee from this company when they do X, Y, and Z?” And they said, “there’s a coffee shop down the street.” And I said, “okay, can you tell me about the owner of that coffee shop? What are his politics? What has he supported or she supported?” And they had absolutely no idea. But that’s kind of sometimes what the rabbit hole we get into where we’re trying to evaluate product by product, piece by piece, the things that are, that by themselves, they may be good things and to try to figure out how far down the line are we going to go? How much virtue, how far down the line are we going to go before we’re going to consume that particular product? It’s a very difficult thing to do. And so I think that we need to think hard about that.\n\nYeah, can I just jump in? I think there’s two critical things to really emphasize along those same lines. One, I think a critical moral judgment is is what I am doing by consuming it encouraging further this wrong act? That’s critical. Because then you are definitely wading into guilt and not just impact. And I want to underline that for people taking the COVID vaccine, they are not encouraging more abortions. In fact, the very fact that these vaccines were developed on this cell line that goes back to 1973, really, is where this original abortion—and even that is unclear. It’s not proven, but it’s possible to probable that a abortion in 1973 was the original cell that ultimately engendered this long cell line over these decades that were now used in the development of the vaccine, not in the vaccine itself, but in the development of vaccine. Even if you, sort of, except that, the critical moral question is by taking this vaccine, am I encouraging more abortions? The answer is a flat no to that. Because the very fact that this cell line has been extended for so long since 1973 means most researchers rely on it because it’s been proven, it’s been tested, there’s an enormous amount of scientific literature that guides their research on that. They would have to start from scratch if they were to do that kind of research on a on a new abortion, which is why most scientific researchers are going to rely on this particular cell line and others like it that date back decades, not from any fresh fetal cell that is that’s taken from any new abortion. And the government regulations make that very, very difficult and strongly discourages any research drawn from new fetal tissue, and certainly from any abortion. So when you’re taking the vaccine, you are not encouraging the current practice of abortion.\n\nSo this is a really important distinction. And I want to use it to bring us back then even to the question of liberty and whether the things I’m doing contribute to the death of a human. Because in this case, where the sanctity virtue is so deeply entrenched in many of us, to say, “oh, my proximity to this practice that I disapprove of, the death of a human, I’m benefiting from in some sense, but my actions are not contributing to the death of any human by getting a vaccine in this way.” But go back then to the issue of my refusal to get a vaccine, my refusal to wear a mask, or my insistence on meeting with other people in person. Aren’t those actions directly contributing to the death of a human being? I mean, it’s just a matter of math, right, to see how many people are going to be exposed and how many of them are going to be caused to die by my actions? Am I missing something in that?\n\nNo, you’re not missing, you’re not missing something there. And a lot of this goes back to what does it mean to be pro-life? I mean, and that’s a big argument, actually, what does it mean to be pro-life? A lot of people will narrow that down and say what that means, what it means to be pro-life is it means to be anti-abortion, that when you use the words pro-life, that’s what that means. Well, then just use the term anti-abortion, that certainly, you know, not the theology of life, for example, you know, in the Catholic Church, which has had a rich and robust theology of life, that is not limited to anti-abortion, as important as it is to be anti-abortion. And so, you know, that’s one of the frustrations, for example, that I’ve had during this pandemic, is that here’s a very tangible opportunity for members of the Christian community to engage in very small sacrifices. It almost is insulting the word sacrifice to call, for example, wearing a mask a sacrifice. But, you know, very small inconveniences that could have, if widely adopted, could have really a pretty dramatic effect on the health and well being of their communities. And, you know, the widespread reluctance of evangelicals to endure those inconveniences for the sake of the health and well being of their communities has been very deeply disconcerting. You know, I was communicating with somebody the other day, and I said, If you had told me five years ago or six years ago, that a pandemic would stalk our shores, it would kill more than half a million Americans in a year, and one of the communities in the US most resistant to simple health measures, like wearing a mask or vaccination, most resistant, would be evangelicals—if you had made that assertion, I would have thought you are an anti-Christian bigot. You know, how dare you say that about us! This is a pro-life community. And yet, here we are. This is where we are. And it’s so important for us to try to figure out and drill down how we got here and what we can do to turn that around. But the bottom line is that we’re in a position right now, where an awful lot of people are very deeply committed and who are both simultaneously, say and have voted and engaged in activism on the pro life side, and then simultaneously, deeply opposed to wearing a mask at church or deeply opposed to taking a vaccine that will help their community achieve herd immunity, save lives and pull people out of the economic mess that we’re in.\n\nI guess, perhaps in spite of my appreciation of Jonathan Haidt’s work, I have to believe that hearing some of this information really would persuade those of us in the in the Christian community that have been resistant to this, too, to hear, yes, my actions really are contributing to the deaths of other people, that should be enough to convince me to change my behavior. Shouldn’t it?\n\nWell, and Jim, I want to bring this home to the vaccine to underline this fact that if Christians, if a substantial number of Christians, at the current rate of the Pew survey results show, if they refuse to take the vaccine, they are endangering the entire world. They are endangering the entire—and the reason for that is because if a substantial portion of a population says, “it’s not necessary for me to take the vaccine, I’m not afraid of it, I’m not afraid to die, it’s a flu, it’s…” Okay, maybe for a large majority of them it is just a flu level symptoms and the death rates are still going to be a lot higher than flu but I’m willing to tolerate that. What you’re still doing, as an evangelical community if you choose to do that, is you are allowing the virus to replicate unchecked throughout your community. The more that a virus replicates to our community, the more it develops variants, mutations. We’re already seeing that happen. That’s been in the news, right, the B117 variant, which is more lethal, more transmissible and potentially more difficult to treat. It’s just one example. That’s going to—the laws of biology indicate that it’s just going to happen more. And so you’re increasing the chances that a variant will evolve through the replication through your own community that will develop eventually resistance to the vaccines. And so you’re going to actually threaten the entire world, which is resting its hopes on this vaccine to protect the elderly that especially the vulnerable, the immunocompromised. Those people are all going to be endangered because you as a community are allowing the virus to replicate and mutate.\n\nAll right, we’ve got to wrap up our time here. Let’s end with some marching orders, perhaps, saying that we’ve completely persuaded everybody listening to this, that they should get the vaccine, they should follow the public health guidelines. What would you have them do next?\n\nWell, I think this goes back to our earlier conversation, that every one of your listeners knows people who have doubts, would be my guess, and have family or friend who either—and it can be doubts at varying levels of strength, but really have some questions and some doubts. And that in our polarized times, where, as we’ve said, institutional trust is at an all time low. That personal trust actually rises to the fore of importance. And so I would just encourage all the listeners, even if they already came into this podcast already, you know, with no qualms about the vaccine, to still consider, if not my resource, some other resource, but I would at least hope they would at least consider looking at a resource, it’s completely free, and to consider is there somebody in my life that could actually benefit from hearing this? Is there somebody who I think I could reestablish a conversation around health and their decisions around health, with this video as an opening gesture, so to speak, or an opening calling card. And I would encourage people to take that act as an act of love and service to the ones that they love.\n\nGood. And I concur with that, and putting my money where my mouth is, I’ll tell you, I’ve already forwarded the video series to a number of people, and has been received very warmly. I think it does a really great job. So again, everybody if we can be spreading those out. David, are you optimistic or pessimistic that if we were to talk again, a year from now that this would all be behind us?\n\nI am cautiously optimistic. I would be pessimistic if the numbers were trending poorly. But we are in fact, as a country, we’re considerably more willing to take the vaccine as a country right now than we were at the height of the political campaign. And I think the more people who take the vaccine and do not suffer the the side effects that are, you know, rumored or whispered about online, and the more examples of individuals who are taking the vaccine are healthy, who are not getting Coronavirus, sort of the testimony of reality, I think is on our side here. That doesn’t mean that the adoption of the vaccine won’t be slower than it should be. I mean, right now where at this point where demand outstrips supply, but we may very well reach a point relatively soon where supply outstrips demand, and we’ll have to really ramp up our efforts. But I would say I’m cautiously optimistic. But part of my optimism is rooted in the fact that an awful lot of people I know, not just us, but an awful lot of people are thinking hard and creatively about how to meet people where they are and persuade those who are reluctant. I do not get a sense that either public health authorities, government officials, religious leaders are taking anything for granted. And the fact that people are worried about this in fact reassures me that and tells me that we’re going to make the effort we need to make. But it’s far from assured. I mean, there’s no assurance that there’s going to be enough adoption of the vaccine to get us through the pandemic. But I’m cautiously optimistic we will.\n\nWell, it’s deeply encouraging to me to have come across the work that the two of you are doing. And again, BioLogos is thrilled to be able to help support that and get that out there. And I thank you so much, David French, Curtis Chang, for talking to us today.\n\nIt’s been a pleasure. Thank you for having us. Yeah.\n\nThanks for having us.\n\nLanguage of God is produced by BioLogos. It has been funded in part by the John Templeton Foundation and more than 300 individuals who donated to our crowdfunding campaign. Language of God is produced and mixed by Colin Hoogerwerf. That’s me. Our theme song is by Breakmaster Cylinder. We are produced out of the remote workspaces and homes of BioLogos staff in Grand Rapids, Michigan.\n\nIf you have questions or want to join in a conversation about this episode find a link in the show notes for the BioLogos forum. Find more episodes of Language of God on your favorite podcast app or at our website, biologos.org, where you will also find tons of great articles and resources on faith and science. Thanks for listening.", "opengraph": {"title": "Curtis Chang and David French | Christians and the Vaccine - Podcast Episode - BioLogos", "description": "Curtis Chang and David French talk about the rise of vaccine refusal, the spiritual problem which causes it, and how to broach these tricky territories with friends and family. ", "image": "https://cms.biologos.org/wp-content/uploads/2021/03/vaccine-bottles-copy-1-scaled.jpg", "url": "https://biologos.org/podcast-episodes/curtis-chang-and-david-french-christians-and-the-vaccine/", "site_name": "BioLogos", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}