{"result_id": "049047", "URL": "https://biologos.org/resources/is-the-covid-19-vaccine-safe", "timestamp": "2023-04-25 12:18:28 CEST+0200", "meta": {"description": "The vaccine is the key to our global recovery from the pandemic. But currently there exists a sizable number of Christians who have indicated they are suspicious of the vaccine.", "lang": "en", "keywords": "", "favicon": "/favicon.png", "canonical": "https://biologos.org/resources/is-the-covid-19-vaccine-safe", "encoding": "utf-8"}, "image": null, "domain": "biologos.org", "title": "Is the COVID-19 vaccine safe? - Resource", "cleaned_text": "The vaccine is the key to our global recovery from the pandemic. But currently there exists a sizable number of Christians who have indicated they are suspicious of the vaccine.\n\nMy name is Curtis Chang, and welcome to Redeeming Babel, where our mission is to provide Biblical thinking in a confusing world. In this series, I want to take seriously the questions that some Christians have about the vaccine. But I want to make the case that after considering those questions, ultimately all Christians should indeed take the vaccine, and do so for important Biblical reasons.\n\nThere are several questions being asked by Christians. We will examine these questions in our other videos. However, I believe everyone starts with that first question, “Is the vaccine safe?”\n\nSo this video will focus on vaccine safety. If you can only watch one video, I recommend you too start with this one.\n\nSo, let’s ask the question: “Is the vaccine safe?”\n\nI do believe the vaccine is safe. This is a major reason why I encourage all Christians to take the vaccine. But I think the way this question has gotten framed has unfortunately fallen into the division affecting our country.\n\nHow the question has been framed\n\nIn our divided society, each side is doing a great deal of eye rolling at the other side.\n\nThe “Yes” side rolls their eyes at the “No” side, and dismisses anti-vaxxers as “anti-science” and “ignorant.”\n\nThe “No” side rolls their eyes at the “Yes” side, and dismisses the majority as being “Sheeple!” “Sheeple” is a term used by some anti-vaxxers to describe people just mindlessly following conventional wisdom like sheep. “Think for yourself!” is the cry of the “No” side.\n\nThe way this debate is framed is not accurate or fair to either side. For instance, it really isn’t accurate or fair for the “Yes” side to claim their side knows science and the “No” side is just being ignorant.\n\nI’m someone that is on the “Yes” side. But if I’m honest with myself, I have to ask, “How much do I really know the science of the vaccine?” Yes, I’ve read several news articles on the vaccine. But have I really mastered even the basics of the science involved? For instance, could I even name the chemical ingredients of the vaccine? No, I can’t.\n\nCould I explain with any scientific detail why the vaccine attacks the virus but is somehow safe for me? If I actually tried, I have about 15 seconds of material and then I start mumbling. I have not read for myself any of the underlying scientific research papers on vaccine safety. And even if I did, I couldn’t understand most of it. If I’m honest, when it comes to the actual science behind vaccine safety, I’m rather, well, “ignorant.”\n\nSo, why do I believe the vaccine is safe? Well, the No side does have a point. It is not because I am “thinking for myself” in the sense that I am not depending on anyone else. In truth, I believe the vaccine is safe because I trust others tasked with answering that question for me. I trust the expert leaders of the scientific institutions like Dr. Francis Collins who heads the National Institute of Health (the NIH). Dr. Collins, by the way, is a devout evangelical Christian and one of the nation’s leading scientists. Here are his words:\n\nI have not “followed closely the development of these vaccines.” I do not know the details of this “rigorous testing.” But Dr. Collins has, and I am trusting him. And not just him, but all the leading scientific institutions who agree with him on the safety of the vaccine. The FDA, the CDC, and all the major research institutions tasked with knowing about drug safety have assured us that the vaccine is actually very safe. And this overwhelming agreement by experts cuts across political divisions. Bioethics experts from conservative institutions like the Southern Baptist Convention and the Heritage Foundation have all encouraged people to take the vaccine as safe.*\n\nIn other words, the real question behind “Is the vaccine safe?” is actually the question of trust. The real question is: “Do I trust scientific experts and institutions?”\n\nAnd this means that what is going on for those on the No side is not that they are ignorant, but rather that they distrust the designated experts and institutions.\n\nAnd this is where I invite the “No” side to do a parallel self-examination.\n\nThere is a sense on the “No” side that we are truly independent thinking people who don’t just listen to the authorities tell us how to think. Rather we “think for ourselves.”\n\nBut do we? Do any of us actually “think for ourselves” in a consistent and complete way? When we go to McDonald’s and order a Big Mac, are we inspecting for ourselves whether that particular piece of hamburger comes from healthy cattle, that it has been slaughtered in a sanitary fashion, that it didn’t get contaminated somewhere in the long supply chain?\n\nOf course not. Every day, we are willing to inject many things into our own bodies because we trust the underlying institutions that have been tasked with knowing these things for us. We trust not just McDonalds, but a whole system of institutions behind it: its supply chain, government inspectors, the cattle industry, and many, many experts and institutions. Every day, we are all trusting in others. None of us fully “thinks for ourselves.”\n\nAnd here is the key Biblical truth that I want to emphasize: that is a good thing. That is the way God designed human beings and human life to operate. God designed us to navigate the world through trusting others, including trusting institutions and experts.\n\nThink about the Old Testament. Yes, some rare individuals get direct access to God’s truth. But the vast majority of people in the Bible have to trust designated leaders: prophets, priests, kings. People have to trust entire institutions like the system of judges Moses appoints, the Levites, the Temple. In the New Testament, Jesus’ all important Great Commission rests on his expectation that the entire world will trust the words of the few he has designated.\n\nGod has designed human knowledge to access truth about the world through trust. Why did God design human life in the world to operate this way? I suspect God did this as a way to build our trust muscles for ultimately trusting Him. If a person insists on being distrustful of everything and everybody, that person will become a fundamentally distrustful person. A fundamentally distrustful person will have difficulty trusting God. So, trusting in other human institutions is like faith training, building up our trust muscles for God.\n\nOf course, trusting human institutions does not mean expecting them to be perfect. Human institutions, like human individuals, have flaws. But just like we have to figure out how to trust imperfect individuals in our lives – like our spouses, our parents, our friends – and we also have to learn to trust imperfect human institutions.\n\nIf you lean on the “No” side of the vaccine debate, I want to point out that you’ve already learned to trust the very institutions that are telling you the vaccine is safe. Every time you buy some aspirin at the drugstore, you are trusting the FDA who oversees all drug safety. This is the same institution that has approved the COVID vaccine. Every time, you take a family member to the ER at your local hospital, you are trusting the NIH, the institution headed by Francis Collins who oversees health practices.\n\nYou already trust these institutions for yourself and your loved ones. Please keep trusting them as they tell you that the vaccine is safe.\n\nThe coronavirus has disrupted our world, caused enormous suffering of all kinds, and killed over 2 million people globally, and over 400,000 Americans. The vaccine is our best chance at ending this suffering and preventing more deaths.\n\nBut the vaccine does not have all the ingredients necessary to accomplish this. It needs one ingredient that only you can supply: this is the ingredient of trust. Let’s add our part to the solution.\n\n*Additional institutions in support of the vaccine include The Center for Bioethics & Human Dignity of Trinity International University, Pontifical Academy for Life, American Association of Pro-Life Obstetricians and Gynecologists, American College of Pediatricians; Catholic Medical Association, and Christian Medical & Dental Associations.", "opengraph": {"title": "Is the COVID-19 vaccine safe? - Resource - BioLogos", "description": "The vaccine is the key to our global recovery from the pandemic. But currently there exists a sizable number of Christians who have indicated they are suspicious of the vaccine.", "image": "https://cms.biologos.org/wp-content/uploads/2021/03/Screen-Shot-2021-03-18-at-10.20.06-PM.png", "url": "https://biologos.org/resources/is-the-covid-19-vaccine-safe/", "site_name": "BioLogos", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["http://maristpoll.marist.edu/wp-content/uploads/2020/12/NPR_PBS-NewsHour_Marist-Poll_USA-NOS-and-Tables_202012071625.pdf#page=3", "https://www.nih.gov/about-nih/who-we-are/nih-director", "https://www.nih.gov/", "https://albertmohler.com/2020/12/14/vaccines-and-the-christian-worldview-principles-for-christian-thinking-in-the-context-of-covid", "https://www.heritage.org/public-health/commentary/the-covid-vaccine-and-the-pro-life-movement", "https://cbhd.org/", "https://www.ncronline.org/news/coronavirus/pontifical-academy-life-urges-quick-action-covid-19-vaccine-production", "https://aaplog.org/physician-support-for-ethical-vaccines/", "https://cmda.org/article/physician-support-for-ethical-vaccines/"], "authors": [], "publish_date": null}