{"result_id": "049045", "URL": "https://discourse.biologos.org/t/biblical-arguments-for-and-against-use-of-cell-lines-such-as-hek293-in-vaccine-development-and-manufacture/44842", "timestamp": "2023-04-25 12:18:27 CEST+0200", "meta": {"description": "I am sorry that I have not been as active on here as I hoped I might and I do hope that I will not just sweep in here and ask for help when I need it as I am today!    I have been challenged by a few people recently abou&hellip;", "lang": "en", "keywords": "", "favicon": "https://discourse.biologos.org/uploads/db1313/optimized/2X/1/1bb7edaaa4d5a5efc31a60b3388f20e2aeca1507_2_32x32.png", "canonical": "https://discourse.biologos.org/t/biblical-arguments-for-and-against-use-of-cell-lines-such-as-hek293-in-vaccine-development-and-manufacture/44842", "encoding": "utf-8"}, "image": null, "domain": "discourse.biologos.org", "title": "Biblical arguments for and against use of cell lines such as HEK293 in vaccine development and manufacture", "cleaned_text": "The verses that come to mind to me are the ones about straining at gnats and tithing a tenth of the spices while neglecting justice and the love of God.\n\nThe ethical arguments calling for avoiding the fetal cell vaccines are similar in some ways to arguments for reparations for slavery, though you would never hear the people who are so concerned about the fetal cell lines saying that White people should be denied anything that benefits them in the present because sins were committed in the past and their wealth is birthed from injustice.\n\nBasically something immoral happened in the past and we have an opportunity in the present to benefit from a long causal chain that could be traced back to that immoral event. Does that make benefiting wrong? We benefit from land that was violently stolen from indigenous people. We benefit from companies and industries and social systems that were built on the backs of slave labor and colonial imperialism and oppression. Heck, we benefit from manufacturing practices that currently enslave children and pollute the world to the point of killing poor people who have to live in the degraded environments.\n\nThe only reason Christians are outraged over this vaccine issue is because abortion is such a politicized issue that generates passion that can be channeled in support of other issues. But feeling all righteous because you won’t take a vaccine that is tainted in your mind by a decades old abortion that would have happened anyway, while not taking any strong moral stand on much more clear issues of benefitting from evil is a Pharisaical look.", "opengraph": {"site_name": "The BioLogos Forum", "type": "website", "image": "https://discourse.biologos.org/uploads/db1313/original/2X/f/f961c6c80e26b70ee0d1d6cc9465706f024563cf.jpeg", "url": "https://discourse.biologos.org/t/biblical-arguments-for-and-against-use-of-cell-lines-such-as-hek293-in-vaccine-development-and-manufacture/44842", "title": "Biblical arguments for and against use of cell lines such as HEK293 in vaccine development and manufacture", "description": "I am sorry that I have not been as active on here as I hoped I might and I do hope that I will not just sweep in here and ask for help when I need it as I am today!    I have been challenged by a few people recently about the issue of the use of human cell lines which originated in long ago abortions in vaccine development and /or manufacture.  I have been surprised that although my instinct is to say “yes” to these vaccines morally not least because of the idea of two decisions being both a bit...", "ignore_canonical": "true"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": ["AdrianWarnock", "Dale", "Christy", "jpm", "Patrick_S"], "publish_date": "2021-01-14T12:33:58+00:00"}