{"result_id": "049030", "URL": "https://discourse.biologos.org/t/is-the-covid-vaccine-safe-for-children-a-pediatrician-and-immunologist-weigh-in/48606?page=15", "timestamp": "2023-04-25 12:18:16 CEST+0200", "meta": {"description": "Thanks to @MOls for working so diligently on this piece for us! \nI know I personally am counting down the days until we are approved for 0-5!", "lang": "en", "keywords": "", "favicon": "https://discourse.biologos.org/uploads/db1313/optimized/2X/1/1bb7edaaa4d5a5efc31a60b3388f20e2aeca1507_2_32x32.png", "canonical": "https://discourse.biologos.org/t/is-the-covid-vaccine-safe-for-children-a-pediatrician-and-immunologist-weigh-in/48606?page=15", "encoding": "utf-8"}, "image": null, "domain": "discourse.biologos.org", "title": "Is the COVID Vaccine Safe for Children? A Pediatrician and Immunologist Weigh In", "cleaned_text": "They all lied and patronized the public. The WHO refused to declare a pandemic, which meant that cruise line could not invoke insurance and had to sail, turning several vessels into plague ships with full mortuaries. Eventually, CNN declared it an official pandemic with or without the WHO. Then public health authorities, including Fauci, realizing that people would look out for number one and run on masks, advised that masks are effective in hospitals but not outside. The science became much more clear when mask availability became much more secured, and all of a sudden the hitherto not recommended masks were everywhere mandated. When there were more arms than shots, all vaccines were equal so do not even ask, which of course was never supported by any scientific paper ever. When public policy makers decided that a whole generation losing a year of school was unacceptable, children were not at serious risk from Covid, and community transmission was never from the classroom. Now that there is approved vaccine for children, the science has changed. Children are now susceptible.\n\nIn all of this, transparency has played catch up to eliciting public compliance for the greater public good. The immediate public health has been the behind the doors justification. Perhaps that is realistic. The price paid, however, is by now it is not only the conspiracy paranoias who do not believe anything they are told. Rational people, rationally enough, do not believe anything they are told by public authorities. Honesty may be naïve, but I do not fault people for cynicism.", "opengraph": {"site_name": "The BioLogos Forum", "type": "website", "image": "https://discourse.biologos.org/uploads/db1313/original/2X/f/f961c6c80e26b70ee0d1d6cc9465706f024563cf.jpeg", "url": "https://discourse.biologos.org/t/is-the-covid-vaccine-safe-for-children-a-pediatrician-and-immunologist-weigh-in/48606?page=15", "title": "Is the COVID Vaccine Safe for Children? A Pediatrician and Immunologist Weigh In", "description": "Thanks for the discussion", "ignore_canonical": "true"}, "tags": ["COVID"], "tweets": [], "movies": [], "links": [], "authors": ["rsewell", "03Cobra", "Randy", "James1", "T_aquaticus"], "publish_date": "2022-07-31T19:21:54+00:00"}