{"result_id": "049029", "URL": "https://biologos.org/post/how-do-we-practice-gracious-dialogue-when-talking-about-covid-19-vaccines", "timestamp": "2023-04-25 12:18:15 CEST+0200", "meta": {"description": "Kendra Terpstra reflects on a recent conversation her son had with his friend, and how it reminded her of the importance of grace in our relationships with others who think differently than we do.", "lang": "en", "keywords": "", "favicon": "/favicon.png", "canonical": "https://biologos.org/post/how-do-we-practice-gracious-dialogue-when-talking-about-covid-19-vaccines", "encoding": "utf-8"}, "image": null, "domain": "biologos.org", "title": "How Do We Practice Gracious Dialogue When Talking about COVID-19 Vaccines? - Post", "cleaned_text": "Conner: Are you getting the COVID vaccine?\n\nClive: Yes. I already got it. So did my whole family.\n\nConner: Why did you get it?\n\nClive: I got it because we want to be safe, and it is a deadly virus.\n\nConner: More people have died from the vaccine than COVID.\n\nClive: Where did you learn that?\n\nClive: Where did your mom get that information?\n\nConner: On Facebook and the internet.\n\nClive: So what makes you think the people on Facebook are more trustworthy than the scientists who worked on the vaccine?\n\nConner: You can’t trust the scientists. Rich, powerful people are saying the population needs to be decreased, and they want to kill off hundreds of thousands of people. I think the scientists are working with them to make something to kill people off. They created the virus, and now they have created the vaccine to kill more people.\n\nClive: Why would the scientists need to make the vaccine if the virus was already killing a lot of people off? You really shouldn’t be skeptical of the vaccine.\n\nConner: Oh, we aren’t just skeptical, we are absolutely not going to get it. Lots of people are getting myocarditis and dying from the vaccine (yes, he knew what myocarditis was and how to pronounce it). Like your grandma, she had a stroke because she got the vaccine.\n\nClive: There’s no proof that the vaccine caused her stroke.\n\nConner: Well, what caused it?\n\nClive: Well, I’m not sure, but I do know she has high blood pressure and other health issues. You shouldn’t immediately assume the vaccine was the cause. With the huge number of people around the world who are getting the vaccine every day, there are bound to be people who have strokes during that time. It seems to be more of a coincidence.\n\nConner: Those aren’t coincidences. The government and scientists are doing it. They are causing these deaths and manipulating the information about COVID just like they are manipulating the information about climate change.\n\nClive: Well, I want to be a scientist and study meteorology when I go to college. Would you trust me if I was a scientist?", "opengraph": {"title": "How Do We Practice Gracious Dialogue When Talking about COVID-19 Vaccines? - Post - BioLogos", "description": "Kendra Terpstra reflects on a recent conversation her son had with his friend, and how it reminded her of the importance of grace in our relationships with others who think differently than we do. ", "image": "https://cms.biologos.org/wp-content/uploads/2022/02/two-people-having-conversation-WEB.png", "url": "https://biologos.org/post/how-do-we-practice-gracious-dialogue-when-talking-about-covid-19-vaccines/", "site_name": "BioLogos", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2022-03-04T05:00:11.000Z"}