{"result_id": "049009", "URL": "https://statement.biologos.org/go/the-covid-19-variants-are-spreading-rapidly/", "timestamp": "2023-04-25 12:17:57 CEST+0200", "meta": {"description": "Experts weigh in on what scientists know and don’t know about the new, more contagious coronavirus variants.", "lang": "en", "keywords": "", "favicon": "/themes/custom/hippocrates/images/favicon.ico", "canonical": "https://www.aamc.org/news-insights/covid-19-variants-are-spreading-rapidly-here-s-what-scientists-know-about-them-and-why-you-need", "encoding": "utf-8"}, "image": null, "domain": "statement.biologos.org", "title": "The COVID-19 variants are spreading rapidly. Here’s what scientists know about them — and why you need a better mask", "cleaned_text": "All viruses mutate. SARS-CoV-2, the virus at the root of the COVID-19 pandemic, has mutated in a variety of ways since it first began spreading in humans in 2019, but few of these mutations have changed the virus enough to alter its impact on people — at least until late 2020.\n\nIn the past few months, several variants — which arise from mutations in the virus’s genetic makeup — have caused concern in the international scientific community. Among those are B.1.1.7, a strain that is driving a surge of hospitalizations and deaths in the United Kingdom; B.1.351, which was first detected in South Africa; and P.1, which is now surging in Brazil. Just last week, researchers announced the discovery of a homegrown strain in California, labeled B.1.426 or CAL.20C, which they believe could have contributed to the alarming spike in the state, according to the Los Angeles Times.\n\nWhat does this mean as a weary world enters the second year of the pandemic? AAMCNews spoke with Ashish Jha, MD, MPH, dean of the Brown University School of Public Health, and Gigi Gronvall, PhD, a senior scholar at the Johns Hopkins Center for Health Security, who offered their expertise about what we know — and don’t know — about the new variants.\n\nAre the new variants more contagious?\n\nJha says that evidence suggests the variants from the United Kingdom, South Africa, and Brazil are about 50% more contagious than the strain common in the United States. Scientists are still studying the transmissibility of the California variant, but they believe it is also more contagious. All the variants have mutations to the spike protein that the virus uses to gain entry to and infect human cells.\n\nDo they cause more severe disease?\n\nBritish officials said last week that there is some preliminary evidence that the U.K. variant is deadlier, but researchers cautioned that the data were still limited.\n\n“We need to assume now that what has been circulating dominantly in the U.K. does have a certain degree of increase in what we call virulence, namely the power of the virus to cause more damage, including death,” Anthony Fauci, MD, the nation’s top infectious disease expert and chief medical advisor to the president, said Sunday on “Face the Nation\n\nEven if people generally don’t get sicker because of the new strains, larger outbreaks can still result in a higher death toll. The more people become infected, the more people will become seriously ill, further straining health systems that are already taxed from COVID-19.\n\nAre the variants already spreading in the United States?\n\nThe variant from the United Kingdom has been detected in at least 20 U.S. states, Fauci said on Sunday, and the first U.S. case of the Brazilian variant was confirmed in Minnesota on Monday. Researchers in California have found that the homegrown strain accounts for about a quarter of cases in the state. So far, the South African variant has not been detected in the country, but few laboratories are doing the testing necessary to identify different strains.\n\nThe New York Times reported on Jan. 6 that U.S. labs are only doing genomic sequencing on about 3,000 viral samples out of the 1.4 million positive tests per week, meaning that variants could be spreading undetected.\n\n“We are not doing enough genomic sequencing,” Jha says. “We should be doing a lot more of it.”\n\nThe United States has the capacity to do more widespread sequencing but has lacked a federal effort to organize the endeavor, he explains. He hopes that this can be amped up significantly in the coming weeks.\n\n“We won’t know what we’re dealing with if we’re not looking for it,” Gronvall says.\n\nShe explains that identifying concerning variants is critical to implementing containment strategies, such as contact tracing and isolation.\n\n“This is a public health tool we’re going to need in the future,” she says. “It’s only going to expand as a field.”\n\nAs of now, the Centers for Disease Control and Prevention predicts that the U.K. variant could become the dominant strain in the United States in March.\n\nWhat do the new variants mean for existing precautions, such as masking and social distancing?\n\nExperts say it’s time to double down on known public health measures.\n\n“We do still have the tools to cut down on this becoming a predominant strain, and we just need to be much more stringent about using them,” Gronvall says. “Masking and open air and social distancing will still work.”\n\nGronvall goes as far as to say that, even without the more contagious variants, current levels of community spread in many regions of the United States are high enough that everyone should think twice about any activity that puts them around people outside of their household — especially moderate- to high-risk activities such as eating out and air travel.\n\nJha says that the two highest priorities for policymakers in the coming weeks should be to get as many people vaccinated as possible and to encourage everyone to wear better quality masks.\n\n“People really need to upgrade their masks,” he says. “We have this mental model that there are N95 masks and everything else and that’s not true.”\n\nJha recommends using KF94 masks, which are Korean-made masks that filter out 94% of particles — slightly less than N95 masks. They’re available on Amazon.\n\nOtherwise, he says that it’s a good idea to double-up on cloth masks, especially in higher-risk situations, such as going to the grocery store, riding public transportation, or going to any place that might be crowded.\n\nWill the vaccines still be effective against the new variants?\n\nSo far, the data suggest that the vaccines will still produce immunity against the new variants.\n\nLaboratory studies have shown the Pfizer-BioNTech vaccine to be just as effective on the strain prevalent in the United Kingdom. And Moderna, the company that manufactures the other vaccine currently approved in the United States, said on Monday that its studies show its vaccine is effective against both the U.K. and South Africa variants — although, in relative terms, it is less effective against the South Africa variant. The company is working on developing a booster shot to better guard against this variant.\n\nJha says his fear is that if the coronavirus continues to spread at the rate it is currently spreading, then other variants that can further evade the vaccine will develop.\n\nThe best way to prevent that from happening — and to save the United States from being crushed by another surge when the more contagious variants spread more widely — is to get vaccines in as many arms as possible.\n\nFauci reiterated at the White House briefing last Thursday that, even if the vaccines aren’t as effective on the new variants, they will still be helpful. He added that the vaccine can be altered to address changes in the virus if necessary.\n\nCan people with antibodies from a previous COVID-19 infection be reinfected by the new variants?\n\nExperts aren’t sure if a previous COVID-19 infection will protect against the new variants. One study from South Africa suggests that the variant there could evade antibodies from the more common COVID-19 strain. This issue could also make one promising therapy — the use of plasma from people who have been previously infected to boost a sick person’s immune response — ineffective.\n\nBut Jha says that scientists will need more clinical data to determine whether antibodies are truly ineffective in the new variants.\n\n“We don’t know enough yet to worry,” he says.\n\nDo the new variants impact children differently?\n\nWhile there was initially some worry that children might be more severely impacted by the new variants, Gronvall says the latest data suggest this is not the case.\n\nWhat does the emergence of new variants mean for the academic medicine community?\n\nGronvall notes that it’s critical to make sure our communities are getting vaccinated and practicing precautions to prevent the spread — or else already stressed health systems will be hit hard once again.\n\n“It’s not a good news story,” she says.\n\nJha hopes to see leaders at academic medical institutions being voices of clarity in their communities.\n\n“They have a really important role to play in their communities in helping people over the next few months,” he says. The message must be, “Double down on public health measures. You don’t have to do this forever, it’s just a few more months.”", "opengraph": {"site_name": "AAMC", "type": "Article", "url": "https://www.aamc.org/news-insights/covid-19-variants-are-spreading-rapidly-here-s-what-scientists-know-about-them-and-why-you-need", "title": "The COVID-19 variants are spreading rapidly. Here’s what scientists know about them — and why you need a better mask", "description": "Experts weigh in on what scientists know and don’t know about the new, more contagious coronavirus variants.", "image": "https://www.aamc.org/sites/default/files/Pipettes-1200x666.jpg"}, "tags": ["Equity, Diversity, & Inclusion", "Compensation/Salary", "Research", "Wellness", "Medical Education", "Health Care", "Students", "Research & Technology", "Coronavirus", "Admissions", "Health Care Systems", "Faculty", "Residency & Fellowship", "Press Releases", "More in Research & Technology", "Policy", "CDC - Centers for Disease Control and Prevention"], "tweets": [], "movies": [], "links": ["https://www.medrxiv.org/content/10.1101/2021.01.18.21249786v1.full", "https://www.latimes.com/science/story/2021-01-23/coronavirus-california-strain-homegrown", "https://cmmid.github.io/topics/covid19/uk-novel-variant.html", "https://www.nytimes.com/2021/01/22/world/europe/virus-variant-uk.html", "https://www.cbsnews.com/news/transcript-anthony-fauci-on-face-the-nation-january-24-2021/", "https://www.cbsnews.com/news/transcript-anthony-fauci-on-face-the-nation-january-24-2021/", "https://www.npr.org/sections/coronavirus-live-updates/2021/01/25/960566484/a-more-contagious-coronavirus-variant-from-brazil-is-found-in-minnesota", "https://www.latimes.com/science/story/2021-01-23/coronavirus-california-strain-homegrown", "https://www.cdc.gov/mmwr/volumes/70/wr/mm7003e2.htm?s_cid=mm7003e2_w", "https://www.amazon.com/s?k=kf94&ref=nb_sb_noss_1", "https://www.statnews.com/2021/01/20/pfizer-biontech-covid-19-vaccine-works-just-as-well-against-variant-first-detected-in-u-k-study-indicates/", "https://www.nytimes.com/2021/01/25/health/coronavirus-moderna-vaccine-variant.html", "https://www.biorxiv.org/content/10.1101/2021.01.18.427166v1.full", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/950823/Variant_of_Concern_VOC_202012_01_Technical_Briefing_3_-_England.pdf"], "authors": [], "publish_date": null}