{"result_id": "049024", "URL": "https://biologos.org/resources/can-black-americans-trust-the-covid-vaccine", "timestamp": "2023-04-25 12:18:11 CEST+0200", "meta": {"description": "Can Black Americans trust the COVID vaccine? This is a crucial question that will impact the future health of our African American community.", "lang": "en", "keywords": "", "favicon": "/favicon.png", "canonical": "https://biologos.org/resources/can-black-americans-trust-the-covid-vaccine", "encoding": "utf-8"}, "image": null, "domain": "biologos.org", "title": "Can Black Americans trust the COVID vaccine? - Resource", "cleaned_text": "Iheoma: Can Black Americans trust the COVID vaccine? This is a crucial question that will impact the future health of our African American community.\n\nCurtis: And not just the African American Community. When it comes to the pandemic, the fates of all communities are truly inter-connected. My name is Curtis Chang, I am a former pastor who now teaches other pastors as a seminary professor.\n\nIheoma: And my name is Iheoma Umez-Eronini. I am a church leader and community activist.\n\nCurtis and I have been friends for many years. Together, we want to make the case that Black Americans can indeed trust the COVID vaccine, and this is important good news for both the African American community and the rest of society. Curtis will begin by giving some key background, and I will come back to explain why we believe Black Americans can trust the vaccine, and in fact, are leading the way for the rest of society.\n\nThanks, Iheoma. Whether any community is willing to take the COVID vaccine depends greatly on whether that community trusts the health institutions encouraging vaccination. As individuals, few of us can fully grasp the scientific details about the vaccine by ourselves. We are going to take the vaccine only if we trust the institutions telling us that this vaccine is safe, and good for us.\n\nFor most communities in the United States, we have little reason to distrust the health institutions overseeing vaccination. Institutions like the Center for Disease Control, the FDA, the National Institute of Health are recognized leaders with a proven track record of serving the public. They aren’t perfect, of course. Like any human institution, they have their flaws. But with most communities, these institutions have shown that they are looking out for our safety, and out for our good. They are trustworthy.\n\nBut the African American community does have legitimate historical reasons to distrust the leading health institutions. This is because the past history of American health institutions has been tainted by more than just the kind of flaws that should be expected in any human institution. Instead, American health institutions have been tainted with institutional racism.\n\nInstitutional racism is different from ordinary institutional flaws because it breaks trust with a particular community.\n\nFor example, if the public health agency rolling out the vaccine in my city of San Jose was doing so too slowly and in a disorganized fashion, that institutional flaw would affect everyone. I can extend grace and patience because that agency is just showing it is human.\n\nHowever, suppose I heard that the leaders of this agency were secretly calling COVID, “the China flu.” And that it was common for their staff to make racist jokes about Asian Americans. Or perhaps that even the agency was prioritizing vaccinations for white communities over Asian American communities. If that were the case, I would no longer trust that agency and what it told me to do. To repeat, racism is a special, particularly damaging flaw because it breaks trust with a particular community.\n\nMy example is purely hypothetical. I have seen no historical evidence of institutional racism on the part of leading health agencies targeted at the Asian American community. Unfortunately, Black Americans have experienced institutional racism that is much worse than my hypothetical example.\n\nA key chapter in that story is the Tuskegee Syphilis Study that ran from 1932 to 1972.\n\nThe study originated with the Center for Disease Control (CDC) – yes, the very CDC you read about in the news about COVID and the vaccination program. One of the early projects of the CDC was this study that enrolled black sharecroppers, deliberately looking for African Americans who were infected with syphilis. The project found 399 of them. But the researchers – who were almost entirely white – did not tell those infected individuals that they were infected. Instead, they told them that they were receiving free medical care from the US Government. Except that the doctors were lying: the black men were not receiving medical care. The study was intentionally designed to see how much and how quickly syphilis causes damage when untreated.\n\nSo, doctors deliberately lied to these black sharecroppers, did not tell those 399 individuals that they had syphilis, and did not treat them. The doctors knew syphilis would cause them severe damage. By the mid-1940’s, the doctors knew that there was effective treatment available in the form of penicillin. Yet, this experiment lasted 40 years without any of the patients receiving treatment. The study was only ended in 1972 when it was exposed to the media. And by the end, the study had caused the deaths of 128 of the participants.\n\nAs I said, the CDC – the institution leading the public on COVID today – was responsible for this horribly racist practice. And it is not just Tuskegee – this is just one example. Many other expressions of institutional racism by the government and the medical establishment have caused the African American community to naturally distrust the system. And this has affected the community’s response to the COVID vaccine.\n\nWhat is supposed to happen when trust has been broken like this by institutional racism?\n\nFor Christians, the Biblical model of response to broken trust hinges on two components: repentance and reconciliation. You can think of repentance as what the sinner must do first, and reconciliation as the choice of those who have been sinned against.\n\nOn the repentance side, the key signs of genuine repentance are when the sinner acknowledges the sin, asks for forgiveness, and begins to repair the damage.\n\nNotice that the third sign under repentance is “BEGINS to repair the damage.”\n\nIn almost every case of sin – and this is especially true with institutional racism – it is impossible for humans to completely repair the damage done. As Christians, we believe that only the work of Jesus on the cross can completely repair the damage of all sin. As humans, we can only begin that repair work as an initial sign of our repentance and our ultimate faith in the power of God to heal the effects of sin.\n\nOne sign that genuine repentance is happening and that God is actively at work to heal is when those beginning and incomplete steps lead to the second component: that of reconciliation.\n\nReconciliation happens when those sinned against graciously accept the beginning and incomplete signs of repentance, and voluntarily choose to resume relationship.\n\nReconciliation is a miracle, a sign that God is at work. This is because, again, the repentant sinner has only begun to repair the damage. There hasn’t been enough repair to fix everything completely. Humanly speaking, the sinned against side has every legitimate reason to still keep their distance and distrust the other side.\n\nBut in Christian reconciliation, the wronged party is filled with the miraculous grace of God. When those sinned against choose to resume the relationship, they reflect the God that resumed relationship with us human sinners “while we were yet sinners” – in the famous phrase of Romans 5:8.\n\nRepentance and Reconciliation are the key indicators that God is at work in a situation marked by human sin. How then do these indicators apply to the situation of Black Americans and the COVID vaccine? For that, I will turn it over to Iheoma.\n\nIn our nation’s history the sin of the Tuskegee Experiment was acknowledged by our country on May 16th 1997. President Clinton held a formal ceremony at the white house that included the surviving victims of the study and family members.\n\nDuring the ceremony, the President said these words:\n\nThese words of apology, of acknowledgement from America’s president in the White house, America’s ‘seat of power’ are an important sign of repentance, as are the apologies of other government and medical representatives that have come after it. But, words alone do not evidence repentance. This takes us to the next part: ‘beginning to repair the damage.’ Actions of repair ‘make true’ the words of the apology.\n\nFor all the living survivors of the Tuskegee study, the US Government gave lifetime medical services and burial services. Over the years, that initial repair was expanded to include widows and offspring.\n\nPerhaps most importantly, the government – recognizing that the CDC had committed terrible institutional racism in its biomedical research practices – instituted a number of more lasting changes. These institutional reforms included stronger bioethical oversight over all experiments to ensure that something like the Tuskegee study could not happen again. Further reforms have encouraged all researchers to respect the needs and perspectives of all minority communities. The practices of the COVID vaccine research reflected these reforms.\n\nAnd all of this takes us to today and the question of reconciliation. One of the most powerful signs of reconciliation is the leadership of black researchers, trial volunteers and government officials in the development and approval of the COVID vaccine.\n\nMost prominent among these is Dr. Kizzmekia Corbett, the scientific lead for the Messenger RNA Vaccine Development Program. mRNA is the core science underlying both the Moderna and Pfizer vaccines. In fact, because Dr. Corbett had been studying this specific type of vaccine development for years, she was able to provide the mRNA sequence to Moderna that served as the basis for their vaccine. As Dr. Fauci said,\n\nOther researchers like Dr. Christopher Barnes, Dr. Michael Johnson, and Dr. Tomeka Suber have pioneered research on both the vaccine and treatment of COVID\n\nIn addition to researchers, other people of color made important contributions by volunteering to participate in the trials. People of color made up 37% of the Moderna vaccine trial, and 23% of the Pfizer trial, ensuring that the vaccine is safe and inclusive of all our communities.\n\nDr. Chris Pernell is a physician who entered the Moderna trial to honor her father who passed away from the virus. Dr. Pernell was an early advocate, writing and speaking about the virus’s devastating effect on people of color. She credits her father’s influence as an “apostle of science” her characterization of his twin passions of faith and science. Other Black doctors as well as two HBCU presidents also volunteered for the trials.\n\nMany pastors likewise participated in the trials or received the vaccine early to promote the safety of the vaccine to their congregations. Others who received the vaccine early include Sandra Lindsay, an African American ICU nurse who was actually the first to receive it in the US outside of trials. And of course, Madam Vice President Kamala Harris.\n\nAnother sign that Black Americans have led in the vaccine process is how black doctors like HBCU president, Dr. James Hildreth of Meharry Medical College, served on the overall FDA panel that approved the vaccines for all Americans\n\nI’ve shared actions that show steps of repentance by our government and medical bodies. I’ve highlighted encouraging examples of Black people that are engaging in reconciliation through their participation in the development of the vaccine. Now, not all Black people are comfortable with this reconciliation process – and that is completely legitimate. However, all of us in the Black community should seek the wellbeing of our people. And make no mistake, the vaccine is critical to the well being of our people. Black people are disproportionately dying from the virus.\n\nMyself, I’m really haunted by this number: 69,477\n\n69,477 black people have died from COVID as of the time of this recording. This represents a death rate that is nearly 2 times more than the general population.\n\nThis is why a coalition of black medical professionals have written the “Love Letter to Black America,” imploring our community to take the vaccine. I encourage you to check out their letter for yourself.\n\nAnd that is really, in the end, what the vaccine is about. It is about love. It is about the ways that Black scientists have loved our community by leading in the development of the vaccine. It is about how Black people volunteered for the trials as an act of love to ensure that the vaccine is safe for our community. It is about how we all can love our community by encouraging one another to take the vaccine.\n\nLove is why I am so relieved that my parents and grandmother have gotten the vaccine already. And love for my community and for myself is why I plan on taking the vaccine as soon as it is available.", "opengraph": {"title": "Can Black Americans trust the COVID vaccine? - Resource - BioLogos", "description": "Can Black Americans trust the COVID vaccine? This is a crucial question that will impact the future health of our African American community.", "image": "https://cms.biologos.org/wp-content/uploads/2021/03/Screen-Shot-2021-03-18-at-10.38.45-PM.png", "url": "https://biologos.org/resources/can-black-americans-trust-the-covid-vaccine/", "site_name": "BioLogos", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}