{"result_id": "049032", "URL": "https://biologos.org/resources/should-pro-lifers-be-pro-vaccine", "timestamp": "2023-04-25 12:18:16 CEST+0200", "meta": {"description": "Pro-lifers in fact have strong reasons to be pro-vaccine.", "lang": "en", "keywords": "", "favicon": "/favicon.png", "canonical": "https://biologos.org/resources/should-pro-lifers-be-pro-vaccine", "encoding": "utf-8"}, "image": null, "domain": "biologos.org", "title": "Should Pro-lifers be Pro-Vaccine? - Resource", "cleaned_text": "The Pro-life movement and Black Americans. The media tends to portray these two groups as very different. And they are. But there are some curious commonalities between the two groups. Most obviously, there are large numbers of Christians in both groups. More surprisingly, these two groups are by far the most suspicious of the COVID vaccine – although for different reasons.\n\nWhy do Pro-lifers and Blacks have this vaccine suspicion?\n\nMy name is Curtis Chang, and welcome to Redeeming Babel, where our mission is to provide Biblical thinking in a confusing world. In another video, I explained the history behind Black American distrust of vaccination. In this video, I turn to the Pro-life movement.\n\nPro-lifers fear that the vaccine is connected to abortion. And indeed there is a distant connection. But the consensus of leading Christian bioethicists is that this distant connection should not discourage pro life Christians from taking the vaccine. Pro lifers in fact have strong reasons to be pro-vaccine.\n\nTo understand why this is the case, one must first understand what a cell line is. A cell line begins with some original cell taken from a human source, and then those original cells get replicated in labs over and over and over, often over decades. The cells that descend from that original cell make up the cell line. It is these descendant cells – the cell line – that gets used in biomedical research.\n\nOne of the most important cell lines used in COVID vaccine research is the HEK 293 cell line. No one knows the actual individual identity of HEK 293. The original cells were obtained in the Netherlands in 1973 by Dr. Frank Graham. Dr. Graham has reported that he cannot be sure whether the fetal remains came about through a miscarriage or an elective abortion. But it is quite possible – maybe even probable – that HEK 293 originated from an elective abortion.\n\nFor the sake of understanding the pro-life Christian’s worst fears, let’s assume this is the case.\n\nThis would mean that COVID vaccine research used cells that if you back far enough, can be trace an ancestry to a past abortion. Keep in mind that the vaccine ITSELF does not contain any fetal cells; it is the research PROCESS that used the cell line. And remember the cell line used today is not the actual original cell taken from a fetus. Those original cells are long gone. The HEK 293 cell line are the descendants of that original cell taken back in 1973.\n\nThe HEK 293 cell line has been used not just in vaccine research, but in most advanced medical treatments today. The biggest recent breakthroughs in treatment for diabetes, heart conditions, hepatitis, arthritis, lung disease, cancer and many other diseases all drew upon the HEK 293 cell line. In fact, if someone today did not want to touch the impact of the HEK 293 cell line at all, that person would almost have to disconnect from modern medicine entirely. If you have received any meaningful medical treatment in the past ten years, you most likely have already been impacted by the HEK 293 cell line. None of us can avoid this impact.\n\nAnd this is where we have to make a key distinction: the distinction between impact and guilt. Impact does not equal guilt.\n\nThere can certainly be impact from a past sin. In fact, the Biblical concept of original sin is meant to say that none of us can avoid the impact of past sin. Sin originates a “cell line” of impact, if you will, that can extend down through the generations. Anyone who has a family of origin where there was abuse or addiction knows that this is true. Past sin makes an impact on subsequent generations.\n\nBut impact that gets passed on is not the same as current guilt. Let’s say, God forbid, you had a grandparent who was abusive. This fact will impact your family of origin and probably even you. But this does not mean that you automatically are an abuser. Impact gets passed on. But guilt does not. In the same manner, an act of abortion back in 1973 had a huge impact on all biomedical research, including COVID vaccine research. But this does not automatically make the COVID vaccine guilty.\n\nSo, as we think about the COVID vaccine from a pro-life perspective, let me emphasize three key points:\n• None of the vaccines contain any fetal tissue or offshoot\n• No actual cell taken directly from fetuses were used in research\n• None of the vaccines encourage more abortions for medical research\n\nNone of the vaccines contain any fetal tissue or offshoot\n\nFirst, none of the vaccines contain any fetal cells or even any descendant cells. None of the vaccines contain the HEK 293 cell line itself. To repeat, the research process for the vaccine relied on the cell line, but the vaccine itself does not include the cell line. When someone gets injected with the vaccine, they are NOT getting injected with any fetal tissue or any cell line originating from fetal tissue.\n\nNo actual cell taken directly from fetuses were used in research\n\nSecond, no actual cells taken directly from fetuses were used in the research. When we talk about how the HEK 293 or other cell line were used in vaccine development, remember that we are not talking about the actual cells from an abortion that happened decades ago. The HEK 293 cells used today in labs are not the original cells. Those original cells are long gone. The cell line are descendants (usually modified at that) of those original cells.\n\nThe analogy I like to use is the railroad lines that connect my home state of California to the rest of the country. Most goods that we Californians import today from the rest of the country come to us on railroad lines that were originally laid down in the building of the First Transcontinental railroad. That origin story is filled with racist treatment of the first Chinese Americans, my ancestors. They were discriminated against horribly, given the most dangerous jobs, and were periodically lynched by mobs, like in the horrible Rock Spring Massacre.\n\nToday’s transportation lines into California are like the fetal cell lines that developed the COVID vaccine. They are not evil in their current state and usage, but they run on tracks that follow lines first laid down by previous institutional sin. And none of us can avoid being touched by those lines.\n\nNone of the vaccines encourage more abortions for medical research\n\nFinally, it is important to emphasize that none of the COVID vaccines encourage more abortions for medical research.\n\nIn fact, the fact that HEK 293 has been so widely studied and used for decades means that most researchers rely on it and other long established cell lines. They are not motivated to obtain new cell lines from new fetuses. And government regulations strongly discourage any researcher trying to do so, especially from aborted fetuses. This point is key to the difference between impact and guilt. Because it means that current vaccine research, while it has been impacted by past abortion, is not guilty of promoting current abortions.\n\nAll of these facts have led to a consensus among the leading Christian bioethicists. The consensus is that Christians – including pro-life Christians – are encouraged to take the COVID vaccines. The Vatican – which as studied this issue extensively – has given its approval. The president of the Southern Baptist Theological Seminary has similarly approved. Leading conservative bioethicists, like those associated with pro life foundations such as the Heritage Foundation have also joined in the approval.\n\nI agree with this chorus of thinkers. I believe that every pro-life Christian should take the COVID vaccine.\n\nIndeed, I suggest that the COVID vaccine can serve as an image of God’s redemption. Redemption is God’s ultimate answer to the problem of original sin. Redemption is taking something that originated in a wrongful state, and reworking that thing into something good. The Bible tells us that in his death and resurrection, Jesus redeemed human sin.\n\n1 Corinthians 15:22 puts it this way:\n\nIn other words, Adam’s original sin had an impact on us all. We are descendants of his spiritual cell line, so to speak. But the origins of that spiritual cell line, that began in death, is not the final verdict. The spiritual line of Adam has been reworked by Jesus. What began as a story of sin and death has been reworked into a story of forgiveness and life. That is what it means to be “made alive in Christ.” That is redemption.\n\nThe idea that what began in death could be reworked into life is hard for the human mind to grasp. This is why we need images of redemption in the world. We need examples that can serve as metaphors of what Jesus accomplished, that show us, “Jesus’ redemption is kind of like that…”\n\nI propose that the COVID vaccine is an image of redemption. Yes, the vaccine may have a distant origin story in abortion. But that past has been reworked and redeemed into something that saves life. We can point to the vaccine and say, “Jesus redemption is kind of like that.” And indeed, the production of a vaccine in less than a year is really a miracle. Something like this has never happened this quickly. I personally believe God’s redemptive power was present in the process.\n\nMy invitation to Pro-life Christians who distrust the COVID vaccine is this: please remember that the Christian story is the story of redemption. Every one of us has a origin story in sin. None of us can avoid this. Yet each one of us has had our story reworked by Jesus into new life. That’s what it ultimately means to be pro-life. To be pro life is to be pro redemption. And to be pro redemption, in my view, means being pro vaccine.\n\nThe vaccine is ultimately a redemption story. Let’s be part of that story.", "opengraph": {"title": "Should Pro-lifers be Pro-Vaccine? - Resource - BioLogos", "description": "Pro-lifers in fact have strong reasons to be pro-vaccine.", "image": "https://cms.biologos.org/wp-content/uploads/2021/03/Screen-Shot-2021-03-18-at-10.31.27-PM.png", "url": "https://biologos.org/resources/should-pro-lifers-be-pro-vaccine/", "site_name": "BioLogos", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://journals.sagepub.com/doi/full/10.1177/2378023120977727", "https://www.christiansandthevaccine.com/episodes/07", "https://www.nature.com/articles/ncomms5767", "https://www.thepublicdiscourse.com/2020/05/63752/", "https://www.wyohistory.org/encyclopedia/rock-springs-massacre", "https://fas.org/sgp/crs/misc/IN11136.pdf", "https://www.vaticannews.va/en/vatican-city/news/2020-12/vatican-cdf-note-covid-vaccine-morality-abortion.html", "https://albertmohler.com/2020/12/14/vaccines-and-the-christian-worldview-principles-for-christian-thinking-in-the-context-of-covid", "https://www.heritage.org/public-health/commentary/the-covid-vaccine-and-the-pro-life-movement"], "authors": [], "publish_date": null}