{"result_id": "049043", "URL": "https://biologos.org/post/i-am-in-a-covid-vaccine-trial-my-take-on-the-testing-experience", "timestamp": "2023-04-25 12:18:26 CEST+0200", "meta": {"description": "BioLogos’ President enrolled as a volunteer in a COVID vaccine trial. Here’s what it’s like, and what she learned.", "lang": "en", "keywords": "", "favicon": "/favicon.png", "canonical": "https://biologos.org/post/i-am-in-a-covid-vaccine-trial-my-take-on-the-testing-experience", "encoding": "utf-8"}, "image": null, "domain": "biologos.org", "title": "I am in a COVID vaccine trial: My take on the testing experience - Post", "cleaned_text": "I expected there to be more inspirational calls to serve (like this video), or at least abundant thanks for our sacrifice, but these were left out, I think to eliminate any sort of pressure to volunteer. The study staff at my site represented a broad range of races and ethnicities, and the opportunity was widely advertised. We were paid at the end of the day, an amount appropriate for the hours of work lost, travel expenses, etc., but the payment wasn’t used as an incentive (It wasn’t even mentioned till over halfway through the document). We were told repeatedly that we would be accepting some risk, that the study might not benefit us, and that we could back out at any time. Once fully informed, everyone in my session agreed to serve.\n\nWhat impressed me the most, however, was the consistency and thoroughness of the study. I am one of 60,000 volunteers at dozens of sites all over the globe. For the results to mean anything, all of us have to be treated the same way. On the first day, we all had to do several sessions around the building (group orientation, checking vitals, blood draws, meeting with the doctor, etc.), all while staying 6 feet apart. It could have been chaotic, but it was actually very well-organized. The staff were patient and diligent, checking every form, ensuring that all of our information was complete and correctly recorded. The key scientific step took place early in the afternoon, when a staff person gave each of us a card with a special code number that assigned us either to the placebo group or the vaccine group. Half of the participants are in each group, but I don’t know which group I’m in. The card was exchanged for a box with a syringe, and the person who gave me the shot didn’t know what was in the syringe either. That’s what “double-blind” means—neither the patient nor the medical staff know which shot was used. The researchers will now watch for cases of COVID among both groups as we live our lives in the coming months. If most of the cases are in the placebo group, they can conclude that the vaccine was effective in protecting the other group.\n\nWith the desperate rush for a vaccine and the conspiracy theories swirling around this issue, it is understandable that some people are concerned about the reliability of these studies. Last summer BioLogos posted a note from Francis Collins, Director of the National Institutes of Health, to someone with these concerns, emphasizing that the research findings will be transparent and available to all to review. My own experience is that no corners are being cut. The study was being done with full attention to detail and as consistently as possible. The “Warp Speed” aspect of the vaccine push refers not to any sacrifice in scientific quality, but to several other special measures being taken to speed up the timeline. The biggest is that the government is paying vaccine companies to produce millions of doses now, even knowing that the doses will have to be dumped if the studies show the vaccine isn’t safe and effective. Another special measure is using larger numbers of people in Phase 3 trials than is typically done—60,000 in the case of my trial. A large group means that the number of COVID cases among participants will stack up faster, giving the researchers an earlier opportunity to see how many cases are in the placebo group vs. the vaccine group. The study is still being done with all deliberate care. From all I could see, the researchers running the study are experienced and ethical, and I have no reason to doubt that they will apply the same integrity to reporting these findings as they have in previous trials they have run.", "opengraph": {"title": "I am in a COVID vaccine trial: My take on the testing experience - Post - BioLogos", "description": "BioLogos’ President enrolled as a volunteer in a COVID vaccine trial. Here’s what it’s like, and what she learned.", "image": "https://cms.biologos.org/wp-content/uploads/2020/11/vials2-WEB.jpg", "url": "https://biologos.org/post/i-am-in-a-covid-vaccine-trial-my-take-on-the-testing-experience/", "site_name": "BioLogos", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.youtube.com/watch?v=lfc29oliU8o", "https://biologos.org/post/francis-collins-responds-to-covid-vaccine-skeptic/"], "authors": [], "publish_date": "2020-11-23T18:38:03.000Z"}