{"result_id": "049016", "URL": "https://biologos.org/articles/is-the-covid-vaccine-safe-for-children-a-pediatrician-and-immunologist-weigh-in", "timestamp": "2023-04-25 12:18:06 CEST+0200", "meta": {"description": "An immunologist and a pediatrician share some of the reasons they chose to vaccinate their kids and answer common questions about the COVID vaccine.", "lang": "en", "keywords": "", "favicon": "/favicon.png", "canonical": "https://biologos.org/articles/is-the-covid-vaccine-safe-for-children-a-pediatrician-and-immunologist-weigh-in", "encoding": "utf-8"}, "image": null, "domain": "biologos.org", "title": "Is the COVID Vaccine Safe for Children? A Pediatrician and Immunologist Weigh in - Article", "cleaned_text": "Over the past two years COVID-19, the illness caused by the virus SARS-CoV-2, has quickly become one of the most studied infectious diseases. Its worldwide spread and the wide distribution of COVID-19 vaccines has made data from patients easily accessible to medical doctors and scientists around the world. As an immunologist and a pediatrician, we and our colleagues have been following the science around COVID-19 very closely. We are also parents of four children under the age of 11, so we understand that decisions about vaccination are challenging and personal. Here, we explain some of the reasons why we chose to vaccinate our kids and answer some common questions.\n\nTraditional vaccines consist of manufactured and purified virus parts. In contrast, mRNA vaccines use the pathway described above to direct cells in the body to make a component of the virus, like the spike protein for the COVID-19 vaccine. The mRNA from the vaccine mainly enters muscle cells at the injection site, and some travels to the lymph nodes. Display of vaccine components within lymph nodes is an important feature of vaccines, allowing the immune system to mount the most effective response. Importantly, the mRNA does not permanently alter cells in your body and cannot change your DNA. The spike proteins are displayed by a few cells for a short period of time (days to weeks), before being degraded themselves. In our cooking analogy, an mRNA vaccine would be like receiving a recipe from your neighbor and discarding it after you finished cooking your meal. The mRNA vaccine recipe cannot become part of the published master cookbook. Having seen the “mug shot” of the virus (via exposure to only the spike protein), the immune system develops a “memory” of it, so will be more prepared to rapidly respond to an actual SARS-CoV-2 virus infection. The technology required to generate mRNA vaccines has been in development for decades. This mRNA technology opened up a fast path to new vaccine generation for novel infectious agents. Traditional vaccine development requires overcoming multiple challenges, including growing the virus in the lab, purifying virus parts, and formulating them into an optimal delivery vehicle. These are all complicated, time-consuming steps that are not required for mRNA vaccine development.\n\nPeople at an elevated risk of disease include grandparents, adults and children with asthma, obesity, diabetes, heart or lung disease, and sickle cell anemia. Pregnancy also increases the risk of severe outcomes from SARS-CoV-2 infection. Some diseases and medications reduce the strength of the immune system, increasing the risk of infection. Unfortunately, vaccines are less effective for people under such conditions, including cancer patients, transplant recipients, and people with autoimmunity. Ultimately, vaccines protect both our kids and our community. How concerning is the risk of myocarditis? There are some indications that COVID-19 vaccines could increase the rate of myocarditis, particularly for adolescents and young men. However, these events are rare, making the cases difficult to study. To put this risk in perspective, let’s look at some of the numbers. The overall incidence of myocarditis in the general population is about 10-20 per 100,000. That amounts to about a 0.01% risk of myocarditis without COVID-19 infection or vaccination. The cases of myocarditis after COVID-19 vaccination appear to be highest in young males (16-30 years old). Two studies found rates of myocarditis after COVID-19 vaccination to be elevated, but similarly rare as the estimated incidence in the general population. However, COVID-19 infection is also associated with myocarditis. One study found COVID-19 infection to increase the risk of myocarditis by about 16-fold. An analysis in the United States found that vaccination reduced the incidence of myocarditis following COVID-19 infection in the highest-risk group (12-17 year old males) by 6-fold. The bottom line is that the incidence of myocarditis after vaccination is very rare, and vaccination could reduce the rate of myocarditis caused by COVID-19 infection itself.\n\nHow do we weigh the benefits against the risks? To assess our vaccine decisions, we should weigh the benefits against the risks. While there is a very rare risk of adverse effects from vaccination, there are more chances of negative outcomes from COVID-19 infection than from vaccination. During the last two years of the pandemic, over 700 children between the ages of 5-18 have died from COVID-19, including during this recent wave driven by the omicron variant. To help think about that level of risk, let’s consider how we reduce risks in other areas of our children’s lives. Very few children drown, but parents take action to teach their kids to swim to reduce the risk of drowning. (An average of 357 children aged 5-17 drowned per year from 2010-2019.) Swimming with lessons has reduced risk compared to swimming without lessons. Likewise, exposure to SARS-CoV-2 after vaccination has reduced risk compared to COVID-19 infection without vaccination. From the numbers discussed above, we can conclude that our kids are more likely to suffer harm from COVID-19 infection than vaccination. Although not entirely without risk, the chance of vaccine injury is very rare, while providing multiple great benefits. We should not only consider the risk of death from COVID-19 infection, which is fortunately very low, but also other negative outcomes.\n\nPediatric vaccine doses are determined based on what is not just a safe and effective dose but what is going to be a safe, effective, and “friendly” dose. Unlike medications, vaccine doses are not based on weight, but are instead based on the age of the child. This is due to the immune responses in different age groups. In general, children have higher immune responses than adults. It is believed that children’s immune systems are generally the best around age 15. This is thought to be the reason that 12-15 year olds had the highest level of antibodies after receiving the adult dose. In the initial pediatric trials, Pfizer tested 4 different vaccine doses, including the adult dose. The pediatric trial monitored children in all four groups for side effects and antibody levels. Subsequently, the two lower doses were chosen for the full clinical trial. In the end, the 10-microgram dose was chosen as it had comparable levels of antibodies as young adults and had a good side effect profile. In the trial for children under 5, the first low dose selected by Pfizer did not give as good of an immune response as expected after 2 doses, so a third dose is being studied. More information and data on this vaccine should be available soon. Some people wonder if vaccines could cause unknown side effects in the distant future. Unfortunately, this idea is promoted by groups who spread mis-information about vaccines. Examples of long-term future side effects of vaccines are virtually unheard of. Because vaccine side effects result from the activity of the immune system, they mostly occur within about a month of vaccination.", "opengraph": {"title": "Is the COVID Vaccine Safe for Children? A Pediatrician and Immunologist Weigh in - Article - BioLogos", "description": "An immunologist and a pediatrician share some of the reasons they chose to vaccinate their kids and answer common questions about the COVID vaccine. ", "image": "https://cms.biologos.org/wp-content/uploads/2022/03/Child-with-bandaid-after-vaccine-WEB.png", "url": "https://biologos.org/articles/is-the-covid-vaccine-safe-for-children-a-pediatrician-and-immunologist-weigh-in/", "site_name": "BioLogos", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.ncbi.nlm.nih.gov/books/NBK513280/", "https://biologos.org/articles/from-smallpox-to-today-the-science-of-vaccination", "https://unsplash.com/@spencerbdavis?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText", "https://unsplash.com/s/photos/covid-vaccine?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText", "https://reasons.org/explore/blogs/the-cells-design/the-covid-19-vaccines-and-god-s-providence", "https://www.sciencedirect.com/science/article/pii/S2211124720302928", "https://www.cell.com/cell/fulltext/S0092-8674(22)00076-9?_returnURL=https%3A%2F%2Flinkinghub.elsevier.com%2Fretrieve%2Fpii%2FS0092867422000769%3Fshowall%3Dtrue", "https://wng.org/podcasts/covid-vaccines-may-work-but-are-they-safe-1617914616", "https://www.statnews.com/2020/11/10/the-story-of-mrna-how-a-once-dismissed-idea-became-a-leading-technology-in-the-covid-vaccine-race/", "https://www.nature.com/articles/d41586-020-03626-1", "https://link.springer.com/article/10.1208%2Fs12249-021-02058-y", "https://www.nihb.org/covid-19/wp-content/uploads/2020/08/Fact-sheet-operation-warp-speed.pdf", "https://biologos.org/articles/mother-knows-best-lets-talk-common-vaccine-concerns", "https://www.cdc.gov/flu/highrisk/children.htm", "https://link.springer.com/article/10.1007/s00431-020-03684-7", "https://publications.aap.org/pediatrics/article/148/3/e2020042929/179730/Thirty-Day-Outcomes-of-Children-and-Adolescents", "https://gis.cdc.gov/grasp/COVIDNet/COVID19_5.html", "https://data.cdc.gov/NCHS/Provisional-COVID-19-Deaths-Focus-on-Ages-0-18-Yea/nr4s-juj3", "https://www.uptodate.com/contents/covid-19-clinical-manifestations-and-diagnosis-in-children", "https://www.nature.com/articles/d41586-021-01935-7", "https://www.cdc.gov/mmwr/volumes/71/wr/mm7102e2.htm", "https://www.uptodate.com/contents/covid-19-multisystem-inflammatory-syndrome-in-children-mis-c-clinical-features-evaluation-and-diagnosis?topicRef=127488&source=see_link", "https://www.cdc.gov/mis/mis-c/hcp/provider-families.html", "https://jamanetwork.com/journals/jamanetworkopen/fullarticle/2780861", "https://onlinelibrary.wiley.com/doi/full/10.1111/apa.15985", "https://www.nejm.org/doi/full/10.1056/NEJMoa2116298", "https://www.cdc.gov/mmwr/volumes/71/wr/mm7102e1.htm", "https://www.cdc.gov/coronavirus/2019-ncov/need-extra-precautions/people-with-medical-conditions.html", "https://www.mayoclinic.org/diseases-conditions/coronavirus/in-depth/pregnancy-and-covid-19/art-20482639", "https://www.ncbi.nlm.nih.gov/books/NBK459259/#:~:text=The%20incidence%20of%20myocarditis%20is,20%20cases%20per%20100%2C000%20persons", "https://www.nejm.org/doi/full/10.1056/NEJMoa2110737", "https://www.nejm.org/doi/full/10.1056/NEJMoa2109730", "https://www.annualreviews.org/doi/abs/10.1146/annurev-med-042220-023859", "https://www.cdc.gov/mmwr/volumes/70/wr/mm7035e5.htm", "https://www.medrxiv.org/content/10.1101/2021.07.23.21260998v1", "https://data.cdc.gov/NCHS/Provisional-COVID-19-Deaths-Focus-on-Ages-0-18-Yea/nr4s-juj3", "https://www.cdc.gov/nchs/data/databriefs/db413-tables-508.pdf#1", "https://www.pfizer.com/news/press-release/press-release-detail/pfizer-biontech-announce-positive-topline-results-pivotal", "https://www.fda.gov/media/153510/download", "https://www.factcheck.org/2021/02/scicheck-no-evidence-vaccines-impact-fertility/", "https://www.fertstertreports.org/article/S2666-3341(21)00068-4/fulltext", "https://www.cdc.gov/vaccines/hcp/vis/index.html", "https://unsplash.com/@cdc?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText", "https://unsplash.com/s/photos/covid?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText", "https://www.chop.edu/centers-programs/vaccine-education-center/vaccines-and-other-conditions/guillain-barre-syndrome", "https://www.npr.org/sections/goatsandsoda/2019/05/03/719037789/botched-vaccine-launch-has-deadly-repercussions", "https://www.science.org/doi/10.1126/science.abf4063", "https://www.cdc.gov/coronavirus/2019-ncov/science/science-briefs/vaccine-induced-immunity.html#anchor_1635539961239", "https://www.nature.com/articles/d41586-022-00063-0#ref-CR2", "https://www.science.org/doi/10.1126/science.abm0829", "https://biologos.org/articles/mother-knows-best-lets-talk-common-vaccine-concerns", "https://www.nature.com/articles/d41586-022-00510-y?fbclid=IwAR3CPQwQo9CQ4GAcxekg0ne8gvhDH7hHephyrI4tn9TLMOBeN16Npop0fnY#ref-CR2", "https://www.science.org/doi/10.1126/science.abm0829"], "authors": [], "publish_date": "2022-03-18T05:00:57.000Z"}