{"result_id": "049023", "URL": "https://discourse.biologos.org/t/new-blog-post-5-reasons-christians-should-get-the-covid-19-vaccine/45154?page=2", "timestamp": "2023-04-25 12:18:10 CEST+0200", "meta": {"description": "Deb highlights why Christians should feel confident receiving a COVID vaccine on behalf of themselves and the rest of their community and provides accessible links to most of our vaccine content.", "lang": "en", "keywords": "", "favicon": "https://discourse.biologos.org/uploads/db1313/optimized/2X/1/1bb7edaaa4d5a5efc31a60b3388f20e2aeca1507_2_32x32.png", "canonical": "https://discourse.biologos.org/t/new-blog-post-5-reasons-christians-should-get-the-covid-19-vaccine/45154?page=2", "encoding": "utf-8"}, "image": null, "domain": "discourse.biologos.org", "title": "New Blog Post: 5 reasons Christians should get the COVID-19 vaccine", "cleaned_text": "Intro: “eh, you probably had COVID already” dice roll\n\nLet’s say your interpolation of the CDC study range is correct and there really were 143.6 million people infected in the country so far. The biggest problem with that is… 110 of those million people don’t have evidence that they were infected with COVID-19. Should those people just assume they are protected against future outbreaks based upon no evidence but a probability from a computational estimate? I don’t think that’s a good plan of action.\n\nCommon sense is not a reliable tool to judge things\n\nPlease don’t judge things based off of your “common sense.” That is not a great way to go about evaluating much of anything, but let’s go on. For example, while there could have been some reasons to think people who were infected have some protection against future infections, here is a short blog post before various immunity studies came in outlining some research on the short-lived nature of immunity to some seasonal coronaviruses:\n\nOkay, that’s good for most individuals who have evidence of prior infection. But that amounts to only 10% of our population and again you run into the problem of not knowing who actually has protection. You also have some 5% of people as per the study you linked that do not have strong protection after prior infection.\n\nThat is a good result and in line with some other studies. Here is an early one from Denmark:\n\nHere prior infection was 80% effective at preventing disease the second round, but if you were over 65, this dropped to less than 50%. These numbers are worse than vaccines which is part of why there’s still a recommendation for at least one shot after a confirmed COVID-19 diagnosis. Unless someone has evidence of having COVID-19, they should still get fully vaccinated.\n\nHere is also a timely comparison from NIH director, Francis Collins, about how variants might play a role in the difference between vaccines and prior infection:\n\nI am not sure what kind of background you have in statistics or epidemiology as you rattle off statistics on “vaccine-related deaths,” comparing this season to previous years and remarkably claim that 16 times more people die from the COVID-19 vaccine as the flu vaccine. It looks like a few others have chimed in with your abuse of the VAERS database so far so I won’t touch upon that.\n\nYou also make misleading statements like:\n\nThis is misleading for multiple reasons, starting with the obvious that you clearly aren’t familiar with typical vaccine production and testing timelines and why many times they can take over a decade. Please go learn about that before commenting more.\n\nKids can die, and get long COVID, and the vaccine is still safer\n\nReally? The likelihood of children dying is not zero and you even posted links showing how some 50,000 kids 0-4 were hospitalized with COVID-19 (my friend’s son nearly died thank you very much) and 140,000 some children aged 5-17. That’s about one in every 390 infected children will be hospitalized if they get the virus.\n\nThis is also highly misleading because this is with many health precautions in place. This is not a “life as normal” thing. Plus, much transmission from kids occurs within households, where there are often more vulnerable people.\n\nAgain, let’s say we can attribute all of this to vaccines… it’s still much better than an actual COVID-19 infection for even youth (from a recent ACIP meeting):\n\nIn closing, all children should consider getting vaccinated for COVID-19:\n\nAnd the American Academy of Pediatrics recent recommendation:", "opengraph": {"site_name": "The BioLogos Forum", "type": "website", "image": "https://discourse.biologos.org/uploads/db1313/original/2X/f/f961c6c80e26b70ee0d1d6cc9465706f024563cf.jpeg", "url": "https://discourse.biologos.org/t/new-blog-post-5-reasons-christians-should-get-the-covid-19-vaccine/45154?page=2", "title": "New Blog Post: 5 reasons Christians should get the COVID-19 vaccine", "description": "Intro: “eh, you probably had COVID already” dice roll   Let’s say your interpolation of the CDC study range is correct and there really were 143.6 million people infected in the country so far. The biggest problem with that is… 110 of those million people don’t have evidence that they were infected with COVID-19. Should those people just assume they are protected against future outbreaks based upon no evidence but a probability from a computational estimate? I don’t think that’s a good plan of a...", "ignore_canonical": "true"}, "tags": ["Medicine", "Bioethics", "COVID"], "tweets": [], "movies": [], "links": ["https://www.cdc.gov/coronavirus/2019-ncov/cases-updates/burden.html", "https://covid.cdc.gov/covid-data-tracker/#datatracker-home", "https://directorsblog.nih.gov/2020/09/29/study-finds-people-have-short-lived-immunity-to-seasonal-coronaviruses/", "https://directorsblog.nih.gov/2020/09/29/study-finds-people-have-short-lived-immunity-to-seasonal-coronaviruses/", "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(21)00575-4/fulltext", "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(21)00575-4/fulltext", "https://directorsblog.nih.gov/2021/06/22/how-immunity-generated-from-covid-19-vaccines-differs-from-an-infection/", "https://directorsblog.nih.gov/2021/06/22/how-immunity-generated-from-covid-19-vaccines-differs-from-an-infection/", "https://discourse.biologos.org/uploads/db1313/original/2X/4/4108902903a3b7dba466a5fd00e0d41bcaad276e.jpeg", "https://discourse.biologos.org/uploads/db1313/original/2X/2/2805641653b6ad11333139014d16647ee4293f3d.jpeg", "https://blogs.bmj.com/bmj/2021/06/23/covid-19-vaccination-in-children/", "https://blogs.bmj.com/bmj/2021/06/23/covid-19-vaccination-in-children/", "https://www.aap.org/en/news-room/news-releases/aap/2021/statement-following-cdc-acip-meeting-from-nations-leading-doctors-nurses-and-public-health-leaders/", "https://www.aap.org/en/news-room/news-releases/aap/2021/statement-following-cdc-acip-meeting-from-nations-leading-doctors-nurses-and-public-health-leaders/"], "authors": ["glipsnort", "Dale", "Christy", "TheW", "ROBBY", "Ralphie", "1Thessalonians5.21", "jpm", "pevaquark", "Vinnie"], "publish_date": "2021-06-24T19:05:21+00:00"}