{"result_id": "049035", "URL": "https://discourse.biologos.org/t/response-to-mass-vaccination-in-a-pandemic-benefits-versus-risks-interview-wiht-geert-vanden-bossche/45415", "timestamp": "2023-04-25 12:18:18 CEST+0200", "meta": {"description": "I’d like to make a general statement about my post from yesterday &amp; the discussion that’s ensued. I am not a scientist, hence, my reason for posting a video of an interview between 2 scientists for discussion. I don’t ge&hellip;", "lang": "en", "keywords": "", "favicon": "https://discourse.biologos.org/uploads/db1313/optimized/2X/1/1bb7edaaa4d5a5efc31a60b3388f20e2aeca1507_2_32x32.png", "canonical": "https://discourse.biologos.org/t/response-to-mass-vaccination-in-a-pandemic-benefits-versus-risks-interview-wiht-geert-vanden-bossche/45415", "encoding": "utf-8"}, "image": null, "domain": "discourse.biologos.org", "title": "Response to \"Mass Vaccination in a Pandemic- Benefits versus Risks: Interview wiht Geert Vanden Bossche", "cleaned_text": "I’d like to make a general statement about my post from yesterday & the discussion that’s ensued. I am not a scientist, hence, my reason for posting a video of an interview between 2 scientists for discussion. I don’t get the impression that the majority of you who interacted on this thread even watched the video or read any of this guy’s research; instead, you wanted to argue with me the same old arguments about the vaccines. That’s fine, I guess- I’m not opposed to back and forth with the limited knowledge that I do have so I’ve engaged a good bit. Here’s why I even bothered to post the video in the first place: I’m EXTREMELY concerned about this approach to the pandemic & the safety of the vaccine and, to be perfectly honest, it’s been a spiritual discipline for several months for me to put aside this debate and simply trust my Creator who knows best. I’m keeping abreast of current events, to a degree, but I’m not seeking this information out, letting it consume my mind or posting things on social media about it. I received this video in an email from a health podcast I listen to & trust. I didn’t post it on Facebook, where I could have gotten some support from likeminded people but also argued with people who disagree, but are, for the most part, probably less scientifically trained than many of you on this forum. But my goal wasn’t to pick a fight or be confirmed in my beliefs- it was to get this information in front of people who might be able to look at it, analyze it and possibly make a difference in the trajectory of things. Also important to me, is that this is a group of believers and, with as ugly & emotional as these arguments get, I feel a conviction not to have them in front of non-believers. What I found here was closemindedness, sarcasm & an assumption that I’m an anti-vaxxer with 2 hours of internet research under my belt who would be happy for children to die or be disfigured from preventable disease. I may not be a scientist but I do have a masters degree- I’m not an idiot. Tim Keller, the very one pictured & quoted on the homepage of Biologos, is my favorite Christian teacher. I’m not from some backward, anti-science, snake handling church community. When I first came across the Biologos organization, I was impressed by the amount of information and lack of snark as compared to Answers in Genesis. I wish I could say the same about the forum but some of the attitudes on here may push me right into the arms of the snake handlers. Would you like to know the root of my vaccine skepticism? It goes back to the tender age of 12, probably. I learned young that doctors have no – absolutely zero- interest in finding out the CAUSE of anything that’s wrong with you. They’re happy to give you a prescription for something that may help but also may (very likely in my case) cause other health issues and that their number 1 priority is to get you out the door as quickly as possible. I know this is a matter of training (look at the funding of medical schools and it makes perfect sense) but even as a child, this all seemed very backward to me. My health journey only went downhill from there until I was forced to go rouge, taking my problems to the internet, and after much trial, error & experimentation, finally started getting some help there. I’m feeling better at 37 than I’ve ever felt in my life NO THANKS TO OUR “HEALTHCARE” SYSTEM, which is really a sick-care system. This fact alone makes me a skeptic, but let’s consider a few other facts: we in the US pay more for healthcare than anyone else in the world and get the worst outcomes of the developed world (U.S. Health Care from a Global Perspective, 2019 | Commonwealth Fund – to summarize: we spend almost twice as much as other developed countries yet have the lowest life expectancy, highest rates of suicide, obesity & chronic disease. This is a terrible system and the burden of proof is on them to convince me they’ve gotten anything right, to be honest), the pharmaceutical industry gives billions of dollars to our government via lobbying (what could go wrong there?!), childhood vaccines have tripled since I was born in 1984- corresponding with the pharma companies receiving immunity from lawsuits (what horrendous diseases were American kids in the 80’s experiencing that needed to be eradicated with many, many more vaccines? I also heard recently that approximately 70 more sit waiting for approval), reports such as this one from Cochrane (Featured Review: Three updated Cochrane Reviews assessing the effectiveness of influenza vaccines | Cochrane ) have these damning things to say about years of flu vaccine data: “The evidence for a lower risk of influenza and ILI with vaccination is limited by biases in the design or conduct of the studies. Lack of detail regarding the methods used to confirm the diagnosis of influenza limits the applicability of this result. The available evidence relating to complications is of poor quality, insufficient, or old and provides no clear guidance for public health regarding the safety, efficacy, or effectiveness of influenza vaccines for people aged 65 years or older. Society should invest in research on a new generation of influenza vaccines for the elderly” and this “We await to see whether anyone has the interest or the courage to develop effective ways to control upper respiratory viral syndromes. Meanwhile our reviews will remain as a testimonial to the scientific failure of industry and governments to address the most important clinical outcomes for patients.”. So, based on that, should I also get the flu vaccine to “love my neighbor”? I’m not saying it’s all bad. I wouldn’t know my father had he not received chemotherapy and radiation for the aggressive cancer that was discovered when I was 8 months old. Once again, before someone types the word “polio”, is it possible that, yes, we’ve accomplished some wonderful things but have started to drift off course because of our highly capitalistic society? What about issues like EMF’s- has anyone looked at that research and wondered why our government is doing nothing to protect us from those ill effects if they’re so concerned about our health and wellbeing? You ask for nuance from Christians when you address the sentiment “science changes all the time- why would we trust what is says about climate change or COVID?”- I hear this on the podcast all the time. I would say this group could also use some nuance in their thinking; to assume that I don’t care about other people or that I’m against all vaccines just because I’m questioning- and asking you to question- an EXPERIMENTAL, developed-at-warp-speed treatment, is not nuanced. It’s also not very Christian nor scientific. I’m regularly enraged by the injustice of our “healthcare” system. It’s bankrupting people while often making them sicker. People are sick, depressed, overweight, on a multiple medications for chronic disease and yet “trust the science!” . . .I know you’re sensing anger & sarcasm from me at this point. I am angry because I care a lot about the suffering people are enduring at the hands of our systems. I hope the COVID vaccine is a good thing, truly. I pray all the time that God will have mercy on us, whatever form that takes. But I’m begging you to stop talking down to people who disagree with you, to try to overcome your bias and at least look at the opinions of scientist who disagree with the prevailing line instead of assuming they’ve got some angle to make money, to acknowledge that we have legitimate reasons for skepticism & that there are differing opinions on how best to love our neighbors in this situation.", "opengraph": {"site_name": "The BioLogos Forum", "type": "website", "image": "https://discourse.biologos.org/uploads/db1313/original/2X/f/f961c6c80e26b70ee0d1d6cc9465706f024563cf.jpeg", "url": "https://discourse.biologos.org/t/response-to-mass-vaccination-in-a-pandemic-benefits-versus-risks-interview-wiht-geert-vanden-bossche/45415", "title": "Response to \"Mass Vaccination in a Pandemic- Benefits versus Risks: Interview wiht Geert Vanden Bossche", "description": "I’d like to make a general statement about my post from yesterday & the discussion that’s ensued. I am not a scientist, hence, my reason for posting a video of an interview between 2 scientists for discussion. I don’t get the impression that the majority of you who interacted on this thread even watched the video or read any of this guy’s research; instead, you wanted to argue with me the same old arguments about the vaccines. That’s fine, I guess- I’m not opposed to back and forth with the limi...", "ignore_canonical": "true"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.commonwealthfund.org/publications/issue-briefs/2020/jan/us-health-care-global-perspective-2019", "https://www.cochrane.org/news/featured-review-three-updated-cochrane-reviews-assessing-effectiveness-influenza-vaccines"], "authors": ["Mervin_Bitikofer", "HRankin", "T_aquaticus", "glipsnort", "Dale", "Christy", "jessica", "jpm"], "publish_date": "2021-03-18T18:28:40+00:00"}