{"result_id": "049036", "URL": "https://biologos.org/post/from-a-scientist-to-her-parents", "timestamp": "2023-04-25 12:18:18 CEST+0200", "meta": {"description": "Jennifer shares the letter that she sent her parents regarding their concerns about the COVID-19 vaccine.", "lang": "en", "keywords": "", "favicon": "/favicon.png", "canonical": "https://biologos.org/post/from-a-scientist-to-her-parents", "encoding": "utf-8"}, "image": null, "domain": "biologos.org", "title": "From a Scientist to Her Parents - Post", "cleaned_text": "Here are some facts about the two approved vaccines, so you can make informed decisions.\n\nPfizer’s trial enrolled over 10 times as many people as in a normal Phase III drug trial (over 41,000 people and counting). The trial started July 27, so there are 5 months of healthy people (the published report checked their health after two months). Moderna is a second vaccine made with the same technology and testing.\n\nBoth vaccines work 95% of the time—that is great for a vaccine! (It blows the flu shot out of the water!). A remaining question is how long the immunity will last. So far, so good, though.\n• NO preservatives (has to be kept frozen and used right away).\n• It is NOT made in the human cells like other vaccines (see postscript).\n• There is NO inactivated virus or proteins.\n• Here is the ingredient list (Pfizer) (Moderna): RNA, lipids (fats), salts (sodium, potassium, chloride), sucrose (sugar).\n\nVaccine side effects are the normal symptoms of your body’s immune system working to create immunity. The vaccine itself is RNA; the instructions for the immune response. The RNA is only temporary so there is nothing left over except protection!\n\nThe best vaccine to get is the one that becomes available to you. Other companies are making more traditional vaccines, but these won’t be available for a while longer. Traditional vaccines do take longer to develop, which is why people are surprised at how quickly the mRNA vaccines arrived.\n\nYour family very much wishes that both of you get the vaccine. It will give us peace of mind that you will be protected from a virus that we could carry in and cause you so much suffering. Your grandchildren will be able to visit you that much sooner too!", "opengraph": {"title": "From a Scientist to Her Parents - Post - BioLogos", "description": "Jennifer shares the letter that she sent her parents regarding their concerns about the COVID-19 vaccine.", "image": "https://cms.biologos.org/wp-content/uploads/2021/02/letter-writing-web.png", "url": "https://biologos.org/post/from-a-scientist-to-her-parents/", "site_name": "BioLogos", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.nejm.org/doi/full/10.1056/NEJMoa2034577", "https://www.modernatx.com/covid19vaccine-eua/providers/about-vaccine", "https://www.cidrap.umn.edu/news-perspective/2021/01/peer-reviewed-data-show-high-protection-leading-covid-vaccines", "http://labeling.pfizer.com/ShowLabeling.aspx?id=14472", "https://www.fda.gov/media/144638/download", "https://www.modernatx.com/mrna-technology/science-and-fundamentals-mrna-technology"], "authors": [], "publish_date": "2021-02-05T05:03:11.000Z"}