{"result_id": "049041", "URL": "https://biologos.org/post/is-the-covid-19-vaccine-a-miracle", "timestamp": "2023-04-25 12:18:24 CEST+0200", "meta": {"description": "Is the COVID-19 vaccine a rare or extraordinary event that points to the reality of the Kingdom of God?", "lang": "en", "keywords": "", "favicon": "/favicon.png", "canonical": "https://biologos.org/post/is-the-covid-19-vaccine-a-miracle", "encoding": "utf-8"}, "image": null, "domain": "biologos.org", "title": "Is the COVID-19 Vaccine a Miracle? - Post", "cleaned_text": "Dictionary definitions change over time in response to how people actually use words. But they also serve as a standard for how we ought to use words now. So I have dictionary.com on my bookmarks bar and go to it several times per week to see if I’m using a word correctly.\n\nOne of this week’s sessions was to look up “miracle” and see whether we can appropriately say that the COVID vaccines are a miracle. Here are the first three definitions given:\n• an effect or extraordinary event in the physical world that surpasses all known human or natural powers and is ascribed to a supernatural cause.\n• such an effect or event manifesting or considered as a work of God.\n\nI think lots of people look at #3 and think, “OK, maybe in a loose sense we can say ‘It was a miracle that I passed that test’ or talk about the Miracle on Ice when the US hockey team improbably beat the Russians in the 1980 Olympics. But those aren’t really miracles.” And even #2 looks suspicious when it says “considered as a work of God.” That sounds like saying the birth of a baby is a miracle and we may be grateful to God for it. But we know that biology explains that process pretty well. In the more precise sense, it’s not really a miracle.\n\nIt’s #1 that most people take to be the real definition of a miracle: it is beyond the capacity of nature, and we must invoke supernatural forces to explain it. In that sense, the incredibly effective and rapid development of the COVID vaccines are not miracles. They were developed by scientists in laboratories and adhere to perfectly explainable laws of nature.", "opengraph": {"title": "Is the COVID-19 Vaccine a Miracle? - Post - BioLogos", "description": "Is the COVID-19 vaccine a rare or extraordinary event that points to the reality of the Kingdom of God?", "image": "https://cms.biologos.org/wp-content/uploads/2021/05/is-covid-19-vaccine-a-miracle.png", "url": "https://biologos.org/post/is-the-covid-19-vaccine-a-miracle/", "site_name": "BioLogos", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.dictionary.com/browse/miracle", "https://en.wikipedia.org/wiki/Miracle_on_Ice"], "authors": [], "publish_date": "2021-05-10T14:42:41.000Z"}