{"result_id": "049004", "URL": "https://biologos.org/resources/how-can-christians-spot-fake-news-on-the-vaccine", "timestamp": "2023-04-25 12:17:53 CEST+0200", "meta": {"description": "In this video, I want to address the concern some Christians have about “fake news,” especially when it comes to COVID.", "lang": "en", "keywords": "", "favicon": "/favicon.png", "canonical": "https://biologos.org/resources/how-can-christians-spot-fake-news-on-the-vaccine", "encoding": "utf-8"}, "image": null, "domain": "biologos.org", "title": "How can Christians Spot Fake News on the Vaccine? - Resource", "cleaned_text": "My name is Curtis Chang, and welcome to Redeeming Babel where our mission is to provide Biblical thinking in a confusing world. In this video, I want to address the concern some Christians have about “fake news,” especially when it comes to COVID. I want to offer a simple principle for Christians to judge information sources on COVID. Most importantly, I want to encourage Christians to apply this principle with our own Christian leaders.\n\nWhen it comes to information about COVID, a very helpful principle is found in Proverbs 14:25:\n\nA “witness” is the Biblical term for a public information source. What Proverbs is saying is, you’ll know which “witnesses” or information sources are truthful by their track record. You will know if an information source is trustworthy if its track record ends up saving lives. Conversely, it is implied that you’ll know an information source is false, is “fake news,” if it does the opposite: if its track record betrays people and costs the people their lives.\n\nWhen applied to news sources, this means that we have to pay attention to the track record. Did what they say come true and have the impact of saving lives? Or did what they say fail to come true and end up costing people their lives?\n\nCOVID presents a critical opportunity to apply Proverbs 14:25. We should all be examining our news sources for their track record on COVID. Did your news source warn you about the seriousness of COVID and the need to take precautions? Or did your primary news source downplay its seriousness and the need for precautions.\n\nThere are news sources consumed by many Christians that consistently downplayed the threat of COVID for months, long after the pandemic began. In doing so, these news sources failed the Proverbs 14:25 test. Badly. At the time of this recording, 2 million people around the world have died from COVID. In the US, the death toll is over 400,000 Americans. More Americans have died from COVID in one year than died in combat during four years of World War Two. News sources that downplayed COVID for months betrayed the people, betrayed the public’s need to be warned.\n\nThe purpose of Proverbs is to give God’s people practical tips on how to not keep making the same mistakes in life. This means that you should stop listening to those information sources that downplayed COVID. You are at risk of being betrayed again with the next major health threat.\n\nAs much as it is important to evaluate our news sources, it is even more important to evaluate our Christian leaders, especially Christian leaders who claim to have prophetic authority.\n\nThe Bible is clear that God’s people have a responsibility to evaluate leaders who claim prophetic authority. Just like Proverbs 14:25 insists on doing with witnesses, with prophets we are supposed to pay attention to the track record.\n\nDeuteronomy 18:22 describes the importance of track record for prophets:\n\nEvaluating the track record of self-proclaimed prophets is especially important during this pandemic. The message from these prophets is that it is not necessary for Christians to obey public health regulations or take the vaccine. They have predicted that “God will protect his people from the virus” if they disobey. For example, the mega-church pastor John MacArthur has mocked and publicly defied public health rules with this kind of prophecy.\n\nSadly, in case after case, when we apply the Deuteronomy 18:22 test to these prophets, they have failed the test. Their predictions that God would protect everyone who rejects public health recommendations has not come true.\n\nFor example, Pastor Ronnie Hampton of New Vision Community Church in Louisiana told his followers to not worry about the virus, to keep gathering in large meetings, to reject the vaccine, because God would protect everyone who did so. He died of the coronavirus. Pastor E.W. Jackson in Virginia also defied legal restrictions in meeting, proclaiming that God had told him that he would never get the virus. Months later, he tested positive. The Christian musician Landon Spradlin called COVID 19 fake news. He died of COVID 19. This tragic pattern has happened repeatedly. In one Pentecostal denomination, more than 30 pastors who claimed this kind of prophetic authority have themselves died from the virus.\n\nThis abuse of prophetic authority has caused suffering in entire congregations. Studies by the CDC have traced in detail how Christian religious services with singing and close physical contact are especially likely to become super spreader events. For example, there was one church gathering in North Carolina that led to 187 cases and 8 deaths. One study back in July of 2020 identified 650 similar cases linked to religious facilities.\n\nIf some Christian leader is claiming prophetic authority to encourage you to reject the COVID vaccine because you’ll be protected by God, then you have a serious responsibility under Deuteronomy 18:22. You should recognize that such prophecies are not coming true. Their track record is false. Therefore, those prophecies are not from the Lord. According to the Bible, you should disregard those instructions.\n\nLet me repeat: if a Christian leader is claiming prophetic authority to encourage you to reject the COVID vaccine, that prophet is speaking falsely. The track record indicates this.\n\nI recognize that it is uncomfortable to disregard a news source you’ve trusted for a while. And that it’s even more uncomfortable to disregard a Christian leader you’ve listened to for a long time.\n\nBut the Bible gives instructions like Proverbs 14:25 and Deuteronomy 18:22 precisely because God knew that fake news and false prophets were possible. The answer is not to distrust every institution and every leader. We do need to trust others to know things in the world. That is unavoidable. But we have to take care to trust the right institutions and the right leaders. We do this by paying attention to the track record of their predictions.\n\nCOVID is a wake up call for everyone. Let’s pay attention.", "opengraph": {"title": "How can Christians Spot Fake News on the Vaccine? - Resource - BioLogos", "description": "In this video, I want to address the concern some Christians have about “fake news,” especially when it comes to COVID.", "image": "https://cms.biologos.org/wp-content/uploads/2021/03/Screen-Shot-2021-03-18-at-10.27.02-PM.png", "url": "https://biologos.org/resources/how-can-christians-spot-fake-news-on-the-vaccine/", "site_name": "BioLogos", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://religiondispatches.org/bill-gates-comments-on-covid-19-vaccine-enflame-mark-of-the-beast-worries-in-some-christian-circles/", "https://www.latimes.com/california/story/2020-11-08/la-pastor-mocks-covid-19-rules-church-members-ill", "https://christiantoday.com/article/pastor-dies-coronavirus-days-after-saying-my-faith-has-never-wavered/134595.htm", "https://www.newsweek.com/pastor-gets-coronavirus-said-he-wouldnt-get-covid-ew-jackson-1548070", "https://foreignpolicy.com/2020/04/02/landon-spradlin-coronavirus-pandemic-death-punchline/", "https://www.independent.co.uk/news/world/americas/bible-belt-us-coronavirus-pandemic-pastors-church-a9481226.html", "https://www.cdc.gov/mmwr/volumes/69/wr/mm6915e1.htm?s_cid=mm6915e1_w", "https://www.webmd.com/lung/news/20201220/75-covid-19-cases-linked-to-n-c-church-event", "https://www.nytimes.com/2020/07/08/us/coronavirus-churches-outbreaks.html"], "authors": [], "publish_date": null}