{"result_id": "049040", "URL": "https://statement.biologos.org/go/6-myths-about-the-covid-19-vaccines-debunked/", "timestamp": "2023-04-25 12:18:21 CEST+0200", "meta": {"description": "Misinformation is causing some to question whether they should get the vaccine. Here are six common misconceptions — and the real truth behind the vaccines.", "lang": "en", "keywords": "", "favicon": "/themes/custom/hippocrates/images/favicon.ico", "canonical": "https://www.aamc.org/news-insights/6-myths-about-covid-19-vaccines-debunked", "encoding": "utf-8"}, "image": null, "domain": "statement.biologos.org", "title": "6 myths about the COVID-19 vaccines — debunked", "cleaned_text": "By March 1, approximately 50 million U.S. residents had received at least one dose of a coronavirus vaccine. With the pace of vaccinations likely to accelerate rapidly in the coming weeks — Pfizer and Moderna, the makers of the two currently approved mRNA vaccines, have each promised to deliver 100 million doses by the end of March, with Johnson & Johnson providing an additional 20 million — many more U.S. residents will suddenly have access to a vaccine.\n\nThat’s good news, except for the fact that recent polls show a distressing number of people are still uncertain about whether they will get vaccinated when it’s their turn. A Kaiser Family Foundation poll in late February found that 44% of U.S. adults are still on the fence or unlikely to be vaccinated: 22% said they wanted to wait and see how the vaccines are working, 7% would get a vaccine only if it was required of them, and 15% said they definitely would not get vaccinated.\n\nThat could translate into a protracted recovery for the country, as most experts estimate that 80% to 85% of the population needs to have some level of immunity for the pandemic to end.\n\nVaccine hesitancy has many causes, not least among them distrust of the medical establishment — particularly among Black and Latinx communities — and concern about the rapid development of the vaccines.\n\nIn recent weeks, though, mixed messaging about the safety and efficacy of the vaccines — whether they work, whether they protect against the new coronavirus variants, whether we can ever stop masking and social distancing — has many experts concerned that even more people will opt out.\n\n“I’m concerned that there are some broad statements about the vaccines that are informing the dialogue that aren’t true that are making people really worried,” says Monica Gandhi, MD, MPH, professor of medicine and associate division chief of the Division of HIV, Infectious Diseases, and Global Medicine at the University of California San Francisco at Zuckerberg San Francisco General Hospital and Trauma Center.\n\nWe spoke with Gandhi and several other prominent academic experts about some common myths — and facts — about the vaccines.\n\nDuring clinical trials, the Pfizer, Moderna, and Johnson & Johnson vaccines were found to be exceedingly safe, with headache, fatigue, and arm pain reported as the most common side effects. “These vaccines do cause temporary side effects in a good proportion of people who get them. You’re going to feel a little achy, as if you’re fighting off a low-grade bug, especially after the second dose of the mRNA vaccine,” says Megan Ranney, MD, MPH, an emergency medicine physician and founding director of the Brown-Lifespan Center for Digital Health at Brown University. “These side effects show that your immune system is mounting a response, they are to be expected, and they are not dangerous.”\n\nAs the vaccines have rolled out to a wider population, though, a few people have reported having an allergic reaction to the vaccine, including anaphylaxis — a severe, life-threatening reaction.\n\nA report published in JAMA Network on Feb. 12, 2021, of vaccinations between Dec. 14, 2020, through Jan. 18, 2021, found that a total of 66 people suffered anaphylaxis after vaccination during that time period — and that the rate was approximately 4.7 cases per million doses for the Pfizer vaccine and 2.5 cases per million doses for the Moderna vaccine. Most of those 66 people received epinephrine and/or steroid treatment, a few were hospitalized, and none died.\n\n“The post-trial monitoring has shown that the rate of anaphylaxis is really not much higher, if at all, than any other type of vaccine out there,” Ranney explains. “The data is super clear that the benefit of the vaccines … far outweighs this very small risk, which is in the order of three per million vaccines administered. And anaphylaxis is completely treatable.”\n\nMyth #2: The vaccines don’t really work that well — they don’t reduce virus transmission.\n\nMost experts have been urging people to continue following public health guidelines, including masking and social distancing, even after they’ve been fully vaccinated with two doses of the Pfizer or Moderna vaccine or one dose of the Johnson & Johnson vaccine — and after enough time has passed for those vaccinations to have taken effect (generally two weeks).\n\nThe reason for this recommendation is because while the Pfizer and Moderna vaccines have been shown to have 95% efficacy against illness (and the Johnson & Johnson vaccine is 85% protective against severe disease), the clinical trials were not designed to test whether any of the trial participants contracted COVID-19 but showed no symptoms.\n\n“The experts are saying that the vaccines do not reduce transmission, but that is an inaccurate statement,” Gandhi says. “Vaccines have always decreased transmission. What they should be saying is that the clinical trials were not designed to test for asymptomatic infection, but there is every biological reason in the world to believe that they will reduce asymptomatic transmission.”\n\nThere is already evidence to support this, she says. First, when the vaccines were studied in macaque monkeys (during preclinical testing), they did eliminate asymptomatic infection — researchers swabbed the vaccinated macaques’ noses and found little or no virus. Second, the types of antibodies that are stimulated by most systemic vaccines (IgG and IgA) do tend to block viral infection in the nose (and no viral load in the nose most likely translates to no transmission). Finally, when monoclonal antibodies are given to COVID-19 patients, those antibodies reduce the viral load throughout the respiratory tract, including the nose.\n\nThe most convincing evidence, though, is just starting to emerge among real-world data. In Israel, where more than 90% of those age 60 and over have been vaccinated, “cases have plummeted in this population,” Gandhi notes. “Not just hospitalizations, which we expected, but cases [asymptomatic infection] as well.” Moreover, data from vaccinated health care workers recently published in the Lancet and preprint servers show reduced rates of asymptomatic infection and low viral loads in the nose when swabbing after vaccination.\n\n“I think that in a few months, we are going to be able to say with certainty that these vaccines not only protect you, they also protect those around you,” Ranney says.\n\nMyth #3: If you’ve already had COVID-19, you don’t need to get the vaccine.\n\nIn early January, a group of scientists at the La Jolla Institute for Immunology (LJI) in California published the results of a study examining the immune responses of 188 people who had been infected with SARS-CoV-2. What they found was that 90% of study participants still had a robust immune response six to eight months after infection — and likely will continue to have immunity much longer, explains Alessandro Sette, PhD, an immunologist at the LJI whose lab has conducted extensive research into the immune response to SARS-CoV-2.\n\nThat said, 10% of previously infected individuals did not show sufficient immune response — either in their production of protective antibodies, or memory B cells, or helper or killer T cells, all of which the study measured.\n\n“If someone has had COVID, I don’t think you can assume that they are protected,” Sette says. “It’s like saying, ‘Would you feel comfortable driving a car where there’s a 90% chance that the brakes work?’ Personally, I would take it into the shop.”\n\nThere is some evidence, though, that for those who have had COVID-19, just one dose of the two-dose vaccination regimen by Pfizer or Moderna might provide sufficient protection.\n\nOne study conducted by researchers at the Icahn School of Medicine at Mount Sinai in New York found that the level of antibodies produced after a single vaccine dose in those who had been previously infected was equal to or greater than that produced after two doses of vaccine in those who had never been infected.\n\nSimilarly, a study at the University of Maryland School of Medicine (UMSOM) found that health care workers who had been previously infected with SARS-CoV-2 had significantly higher antibody responses after one vaccine dose compared to those who had not previously been infected. “What we found was that for health care workers, if you have validated previous infection and antibodies, a single dose can be protective when you have limited doses available,” says Matthew Frieman, PhD, an associate professor of microbiology and immunology at UMSOM and a co-author of the paper.\n\nThe Centers for Disease Control and Prevention currently recommends that those who have been infected with SARS-CoV-2 should be vaccinated with two doses of the Pfizer or Moderna vaccine, though they should wait until they have recovered if they experienced symptoms.\n\n“Until we have more data, the safest way is to get two doses of the vaccine,” Frieman explains.\n\nMyth #4: The variants are going to get us anyway, vaccines or not.\n\nFor the last few months, concern has been growing that a number of SARS-CoV-2 variants — mutated versions of the virus that seem to be contributing to greater numbers of hospitalizations and deaths in some parts of the world — could render the vaccines impotent.\n\nThe important thing to remember is that not all variants are the same, says Frieman. Emerging data from Pfizer, Moderna, and Johnson & Johnson, as well as the vaccine candidates from Novavax and AstraZeneca that are not yet approved by the Food and Drug Administration, suggest that all of these vaccines are highly protective against both the original virus and the so-called U.K. variant — also known as the B.1.1.7 variant — that is projected to become the dominant strain in the United States by the end of March.\n\n“The general consensus is that if you are vaccinated with any of the vaccines that we have now [including the vaccines from Novavax and AstraZeneca], you are protected against the 2020 strains and the U.K. variant,” Frieman notes.\n\nThe so-called South African variant, technically known as B.1.351, and the Brazilian variant, known as P.1, are similar and do not seem to be as easily neutralized by the vaccines, Sette says. But that doesn’t mean the vaccines are completely useless. “We have been doing some calculations and it seems that most of the pieces that the T cells recognize are not changed in the variants,” he says. “What that means is that the T cell response [induced by the vaccine] may not prevent infection, but it can impact disease severity.”\n\nGandhi agrees. “We are talking about the variants as if our T cell responses stimulated by the vaccine are not important. But they’re very important in preventing severe disease. And that matters because we never would have been in this mess with SARS-CoV-2 if it didn’t cause severe disease.”\n\nMyth #5: We’re never going to go back to normal, so why get vaccinated?\n\nIn fact, the Biden administration announced in mid-February that it had purchased 600 million doses of the Pfizer and Moderna vaccines, to be delivered by the end of July. Coupled with Johnson & Johnson’s pledge to deliver an additional 100 million doses by the end of June, that would be more than enough to vaccinate every U.S. resident.\n\nIn the meantime, vaccination will allow you and your vaccinated pals to return to some semblance of normality even sooner.\n\nWhat might that look like?\n\nCan two people who are fully vaccinated be with each other without masking? “The answer is a firm and definitive yes,” Gandhi says.\n\n“If you are around other people who have been vaccinated, you can take that mask off and enjoy being with them,” Ranney adds.\n\nCan a vaccinated person be around an unvaccinated person without masking? No. “While I’m almost positive that vaccination is going to take away transmission, if you had a little viral RNA in your nose, we would never want a vaccinated person to pass that on to an unvaccinated person,” Gandhi says. “So, mask around the unvaccinated until they are vaccinated too.”\n\nCan two vaccinated people enjoy dinner in an indoor restaurant? Maybe. “Because these are such powerful vaccines, you should be able to go out to eat, especially right now, when most of the restaurants have extra ventilation and spacing and the waiters are all wearing masks,” Gandhi says.\n\nRanney is a bit more cautious. “A couple of months from now, when most of us are vaccinated, going back to restaurants is going to be very safe,” she says. “But right now, given the high rates of COVID in the community and the fact that the vaccines are not 100% effective, that would not be my first choice.” Instead, she would recommend having your vaccinated friends over for dinner in your home.\n\nCan you hug your grandkids? While the vaccines aren’t likely to be available to children until later in 2021, Ranney plans to reunite her parents and children as soon as her parents are fully vaccinated. “The risk to them of getting really sick from COVID is quite low. But the risk to them emotionally from continuing to be separated from my kids is higher. It’s a risk-benefit equation. We’re not going to completely eliminate COVID from the world, so two weeks after my parents get their second dose, we’re going to get together.”\n\nCan you fly or go to the gym? “If vaccinated, you can go to an indoor gym, fly (maintaining your masking for others), and start opening up your life,” Gandhi says.\n\nMyth #6: As-yet-unidentified variants are going to get us eventually.\n\nWhile scientists are monitoring several new variants across the globe, there is some concern that SARS-CoV-2 may mutate into a highly transmissible, highly deadly virus that even our powerful vaccines cannot combat.\n\nBut while that’s always a possibility, immunologists are generally convinced that humans have the upper hand.\n\nFor one, surveillance has increased across the globe, and scientists are on the lookout for any new variants that might crop up in ways that they might not have been during earlier surges, when health care systems were overwhelmed.\n\nSecond, if new variants do emerge, vaccine companies are prepared to quickly alter the vaccines. And altering the existing vaccines will not require large-scale clinical trials, since any alterations are unlikely to affect the underlying safety of the vaccines. “Essentially, you are just changing a few amino acids,” Sette says.\n\nThird, as transmission rates go down (as they have in Israel), that will also control the variants. “If you don’t control the number of infections, you have millions of people who are walking incubators, where the virus continues to replicate and more mutations and more variants can occur,” Sette says. “Whatever can be done to stop the spread at the same time that more people are vaccinated is a major variable.”\n\nMore important, though, is that there is increasing evidence that the virus only has so many tricks up its sleeve, Sette says. He points to the fact that a similar mutation originated in both South Africa and Brazil as evidence that the ways in which this virus can mutate may be finite. “It’s not that each variant comes up with a completely new set of mutations,” he says. “The fact that the same set of mutations has been used by two different variants on two different continents is strong genetic evidence that the virus is mutating itself into a corner.”\n\nAnd then, SARS-CoV-2 may wind up as nothing more than the fifth cause of the common cold — behind the four other coronaviruses that currently make us miserable (but don’t usually kill us) the rest of the year.", "opengraph": {"site_name": "AAMC", "type": "Article", "url": "https://www.aamc.org/news-insights/6-myths-about-covid-19-vaccines-debunked", "title": "6 myths about the COVID-19 vaccines — debunked", "description": "Misinformation is causing some to question whether they should get the vaccine. Here are six common misconceptions — and the real truth behind the vaccines.", "image": "https://www.aamc.org/sites/default/files/COVID19_Vaccine_1200x666.jpg"}, "tags": ["More in Health Care", "Equity, Diversity, & Inclusion", "Compensation/Salary", "Public Health", "Research", "Wellness", "Medical Education", "Health Care", "Students", "Coronavirus", "Admissions", "Faculty", "Residency & Fellowship", "Press Releases"], "tweets": [], "movies": [], "links": ["https://www.nytimes.com/interactive/2020/us/covid-19-vaccine-doses.html", "https://www.cnbc.com/2021/02/26/jj-board-member-says-20-million-covid-vaccine-doses-will-be-delivered-by-the-end-of-march.html", "https://img.datawrapper.de/VA6Hd/full.png", "https://www.nejm.org/doi/full/10.1056/NEJMms2101220", "https://www.aamc.org/news-insights/saving-black-lives-during-covid-19-vaccines-matter", "https://www.aamc.org/news-insights/we-need-get-more-latinx-people-vaccinated-heres-how", "https://www.aamc.org/news-insights/here-s-why-we-can-t-rush-covid-19-vaccine", "https://www.nejm.org/doi/full/10.1056/NEJMoa2034577", "https://www.nejm.org/doi/full/10.1056/NEJMoa2035389", "https://www.jnj.com/johnson-johnson-covid-19-vaccine-authorized-by-u-s-fda-for-emergency-usefirst-single-shot-vaccine-in-fight-against-global-pandemic", "https://jamanetwork.com/journals/jama/fullarticle/2776557", "https://www.nejm.org/doi/full/10.1056/NEJMoa2034577", "https://www.cdc.gov/vaccines/acip/recs/grade/covid-19-moderna-vaccine.html", "https://www.jnj.com/johnson-johnson-covid-19-vaccine-authorized-by-u-s-fda-for-emergency-usefirst-single-shot-vaccine-in-fight-against-global-pandemic", "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(21)00448-7/fulltext", "https://science.sciencemag.org/content/371/6529/eabf4063", "https://www.medrxiv.org/content/10.1101/2021.01.29.21250653v1", "https://www.medrxiv.org/content/10.1101/2021.01.30.21250843v4", "https://www.cdc.gov/vaccines/covid-19/info-by-product/clinical-considerations.html#SARS-CoV-2-infection", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/961042/S1095_NERVTAG_update_note_on_B.1.1.7_severity_20210211.pdf", "https://www.cdc.gov/mmwr/volumes/70/wr/mm7003e2.htm#F1_down", "https://www.hhs.gov/about/news/2021/02/11/biden-administration-purchases-additional-doses-covid-19-vaccines-from-pfizer-and-moderna.html", "https://www.gisaid.org/", "https://www.npr.org/sections/health-shots/2021/02/11/966510470/fda-aims-to-be-nimble-on-covid-19-vaccine-changes-for-variants"], "authors": [], "publish_date": null}