{"result_id": "050021", "URL": "http://www.biotechexpressmag.com/bombay-hc-issues-notice-to-bill-gates-serum-institute-dgci-others-over-plea-on-alleged-vaccine-death/", "timestamp": "2023-04-25 12:19:00 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://www.biotechexpressmag.com/bombay-hc-issues-notice-to-bill-gates-serum-institute-dgci-others-over-plea-on-alleged-vaccine-death/", "encoding": "UTF-8"}, "image": null, "domain": "www.biotechexpressmag.com", "title": "Bombay HC Issues Notice To Bill Gates, Serum Institute, DGCI, Others Over Plea On Alleged ‘Vaccine Death’", "cleaned_text": "Bill Gates, Serum Institute of India (SII), Drug Controller of India (DGCI), Maharashtra government and the Union government were issued notices by the Bombay High Court to respond to a petition filed by a man over his daughter’s alleged ‘vaccine death’. The man, in his plea, had blamed Covishield for his daughter’s death and demanded a compensation of Rs 1,000 crore from the Indian vaccine-maker.\n\nIn 2020, the Serum Institute of India entered into a partnership with the Bill and Melinda Gates Foundation, to speed up the process of manufacturing and delivery of up to 100 million doses of Covidshield vaccines for India and other third world countries.\n\nDilip Lunawat, a resident of Aurangabad, told the court that his daughter was a doctor and senior lecturer at the SMBT dental college and hospital at Dhamangaon. He said his daughter was compelled to take the vaccine after all the health workers at the institute were asked to get it.\n\nHe said his daughter was assured that the vaccines were completely safe and had no risk or threats to her body. In the plea, Lunawat said Dr Somani and Guleria had given several interviews and assured the people that the vaccines were safe.\n\nHe also attached his daughter’s vaccine certificate from January 28, 2021. She died on March 1, 2021, due to the “side effects of the Covishield vaccine,” said the petition. The plea added that this was reflected in the central government’s own Adverse Events Following Immunisation (AEFI) report on October 2, 2021.\n\nDilip Lunawat said he wanted to give justice to his daughter and also save the lives “of many more people who are likely to be murdered due to such unlawful activities of the respondent authorities.”", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2022-09-05T10:40:14+00:00"}