{"result_id": "050027", "URL": "http://www.biotechexpressmag.com/nearly-half-of-pregnant-women-in-pfizer-trial-miscarried/", "timestamp": "2023-04-25 12:19:07 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://www.biotechexpressmag.com/nearly-half-of-pregnant-women-in-pfizer-trial-miscarried/", "encoding": "UTF-8"}, "image": null, "domain": "www.biotechexpressmag.com", "title": "Nearly Half of Pregnant Women in Pfizer Trial Miscarried", "cleaned_text": "According to Dr. Naomi Wolf, who runs a crowdsourced project to analyze 300,000 Pfizer documents released via a FOIA request, 44 percent of pregnant women who participated in the drug maker’s COVID-19 vaccine trial lost their babies.\n\nAs first reported by American Greatness, research released by feminist activist and author Dr. Naomi Wolf through her website The Daily Clout indicates that 44 percent of pregnant women in Pfizer’s COVID-19 vaccine trial lost their babies.\n\nWolf, who runs a crowd-sourced analysis project of 300,000 pages of Pfizer documents ordered released in a January ruling by U.S. District Judge Mark Pittman of the Northern District of Texas, appeared on Steve Bannon’s show “War Room” on Tuesday.\n\n“Women will understand how tragic this is. Pfizer took those deaths of babies, those spontaneous abortions and miscarriages, and recategorized them as ‘recovered result adverse effects.’ In other words, if you lost your baby, it was categorized by Pfizer as a resolved adverse event, like a headache that got better,” Wolf told Bannon in an emotional interview.\n\nShe explained that as far as she knew, the documents released through a Freedom of Information Act request did not include emails and other communications between Pfizer and other entities or officials, such as the Food and Drug Administration and Dr. Anthony Fauci.\n\nOn its website, the CDC still recommends that pregnant women get vaccinated:\n\n“COVID-19 vaccination is recommended for all people 6 months and older. This includes people who are pregnant, breastfeeding, trying to get pregnant now, or might become pregnant in the future. CDC also recommends COVID-19 vaccines for infants 6 months and older who’s [sic] mother was vaccinated or had a COVID infection before or while pregnant.”\n\nTech millionaire Steve Kirsch, founder of Vaccine Safety Research Foundation, claimed in a post on Monday that around 12 million people worldwide have been “killed by their governments” as a result of taking one of the COVID-19 vaccines.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2022-08-10T10:05:30+00:00"}