{"result_id": "050006", "URL": "http://www.biotechexpressmag.com/moderna-highlights-more-than-6b-in-revenue-talks-boosters/", "timestamp": "2023-04-25 12:18:41 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://www.biotechexpressmag.com/moderna-highlights-more-than-6b-in-revenue-talks-boosters/", "encoding": "UTF-8"}, "image": null, "domain": "www.biotechexpressmag.com", "title": "Moderna Highlights More than $6B in Revenue, Talks Boosters – Biotech Express Magazine", "cleaned_text": "Moderna enjoyed $5.9 billion in product sales this quarter, with the majority of these occurring outside of the U.S. The company anticipates that sales will become even larger in the second half of 2022 as it introduces its COVID-19 boosters and SARS-CoV-2 becomes endemic. With its capital, Moderna chiefly plans to reinvest in its 46 research and development programs which include its pipeline vaccine programs for COVID-19 and respiratory syncytial virus (RSV) and development-stage vaccine programs which include trials in Zika virus and Epstein-Barr virus (EBV).\n\nNotably, Moderna is full speed ahead for COVID-19 boosters despite growing concerns from the scientific community about their relative usefulness. Moderna highlighted that current COVID-19 vaccination schedules wane in efficacy over time and that a fourth dose of the company’s COVID-19 vaccine increased vaccine effectiveness against infection, symptomatic infection and severe outcomes in high-risk populations in Ontario.\n\n“The emergence of new variants of concern like the BA.2.12.1, BA.4 and BA.5 could accelerate the impact of that waning and broaden the risk of breakthrough infections across the population,” Moderna President Stephen Hoge, M.D., said. “We’re working hard to make improvements to our available boosters.”\n\nHoge said that the ideal booster would provide neutralizing antibodies against Omicron that provide protection throughout the entire northern hemisphere’s fall and winter infection season. The booster would also provide durable protection against older strains of SARS-CoV-2 such as the Delta variant and increase the potential for protection against new emerging variants.\n\nModerna is hopeful of introducing new COVID-19 booster vaccines this fall, with the intention of providing seasonal vaccines for the virus every year, that will be bivalent and provide protection against several mutations.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "January 16, 2021"}