{"result_id": "050010", "URL": "http://www.biotechexpressmag.com/150-plus-research-studies-affirm-naturally-acquired-immunity-to-covid-19-in-2021-ignored-for-vaccine-profiteers/", "timestamp": "2023-04-25 12:18:46 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://www.biotechexpressmag.com/150-plus-research-studies-affirm-naturally-acquired-immunity-to-covid-19-in-2021-ignored-for-vaccine-profiteers/", "encoding": "UTF-8"}, "image": null, "domain": "www.biotechexpressmag.com", "title": "150 Plus Research Studies Affirm Naturally Acquired Immunity to Covid-19 in 2021: Ignored for vaccine profiteers? – Biotech Express Magazine", "cleaned_text": "We should not force COVID vaccines on anyone when the evidence shows that naturally acquired immunity is equal to or more robust and superior to existing vaccines. Instead, we should respect the right of the bodily integrity of individuals to decide for themselves, said an article published in 2021.\n\nPublic health officials and the medical establishment with the help of the politicized media are misleading the public with assertions that the COVID-19 shots provide greater protection than natural immunity. CDC Director Rochelle Walensky, for example, was deceptive in her October 2020 published LANCET statement that “there is no evidence for lasting protective immunity to SARS-CoV-2 following natural infection” and that “the consequence of waning immunity would present a risk to vulnerable populations for the indefinite future.”\n\nImmunology and virology have taught us over a century that natural immunity confers protection against a respiratory virus’s outer coat proteins, and not just one, e.g. the SARS-CoV-2 spike glycoprotein. There is even strong evidence for the persistence of antibodies. Even the CDC recognizes natural immunity for chicken-pox and measles, mumps, and rubella, but not for COVID-19.\n\nThe vaccinated are showing viral loads (very high) similar to the unvaccinated (Acharya et al. and Riemersma et al.), and the vaccinated are as infectious. Riemersma et al. also report Wisconsin data that corroborate how the vaccinated individuals who get infected with the Delta variant can potentially (and are) transmit(ting) SARS-CoV-2 to others (potentially to the vaccinated and unvaccinated).\n\nThis troubling situation of the vaccinated being infectious and transmitting the virus emerged in seminal nosocomial outbreak papers by Chau et al. (HCWs in Vietnam), the Finland hospital outbreak (spread among HCWs and patients), and the Israel hospital outbreak (spread among HCWs and patients). These studies also revealed that the PPE and masks were essentially ineffective in the healthcare setting. Again, the Marek’s disease in chickens and the vaccination situation explains what we are potentially facing with these leaky vaccines (increased transmission, faster transmission, and more ‘hotter’ variants).\n\nMoreover, existing immunity should be assessed before any vaccination, via an accurate, dependable, and reliable antibody test (or T cell immunity test) or be based on documentation of prior infection (a previous positive PCR or antigen test). Such would be evidence of immunity that is equal to that of vaccination and the immunity should be provided the same societal status as any vaccine-induced immunity. This will function to mitigate the societal anxiety with these forced vaccine mandates and societal upheaval due to job loss, denial of societal privileges etc. Tearing apart the vaccinated and the unvaccinated in a society, separating them, is not medically or scientifically supportable.\n\nThe Brownstone Institute previously documented 150 studies on natural immunity as it relates to Covid-19. The study was the most comprehensive library list of 150 of the highest-quality, complete, most robust scientific studies and evidence reports/position statements on natural immunity as compared to the COVID-19 vaccine-induced immunity and allowed to draw own conclusion.\n\nThe report was blindly ignored and vaccines were promoted around the world and the results we can see now that how much profits these vaccine makers are making inspite of the fact that vaccine were not required at first place. Top of that many reports are now coming about long term vaccine side effects including blood clots and cardiovascular events as reported by VAERS in USA and AEFI, India.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "January 16, 2021"}