{"result_id": "050016", "URL": "http://www.biotechexpressmag.com/vaccine-not-mandatory-2116-adverse-events-deaths-after-immunisation-centre-tells-sc/", "timestamp": "2023-04-25 12:18:54 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://www.biotechexpressmag.com/vaccine-not-mandatory-2116-adverse-events-deaths-after-immunisation-centre-tells-sc/", "encoding": "UTF-8"}, "image": null, "domain": "www.biotechexpressmag.com", "title": "Vaccine not mandatory; 2,116 adverse events, deaths after immunisation, Centre tells SC", "cleaned_text": "Covid-19 vaccine was not mandatory, but voluntary, the Centre has said in a submission in the Supreme Court on Monday. On its part, SC said that it would examine any vaccine mandate issued by the executive, if challenged on the ground that it violated personal liberty guaranteed to all citizens under the Constitution.\n\nThe court was reacting to advocate Prashant Bhushan’s submission that state governments were linking vaccination to travel, jobs et al. The Union health ministry said that only 2,116 adverse events following immunisation, including deaths, were reported from across the country. “The percentage of such effects having serious/severe effects (including deaths) in case of covidshield and covaxin was less than 0.01 %, the government claimed.” The 2,116 cases were reported from 1,193,844,741 doses of vaccines administered so far. “This again is in the caveat that any such serious/severe effect including death cannot be attributed to vaccination.”\n\nThe government also denied that the vaccine was mandatory. “It is not linked to any benefits or services.” However, people are being encouraged to vaccinate themselves as any individual’s health may adversely impact the entire society, it said. No indemnity has been granted to any company manufacturing the drug.\n\nThe clinical data generated by trials reside with the sponsor and the data can be submitted to regulatory authorities for obtaining licenses. This data can be verified but there is no provision under which the regulatory authority can ask for the full data on clinical trials, the government said.\n\nThe court led by Justice L Nageswar Rao will now hear the case again on December 13.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://economictimes.indiatimes.com/news/india/vaccine-not-mandatory-2116-adverse-events-deaths-after-immunisation-centre-tells-sc/articleshow/87994260.cms?utm_source=contentofinterest&utm_medium=text&utm_campaign=cppst"], "authors": [], "publish_date": "2021-12-01T18:06:14+00:00"}