{"result_id": "050033", "URL": "http://www.biotechexpressmag.com/does-the-covid-vaccine-kill-more-people-than-it-saves/", "timestamp": "2023-04-25 12:19:15 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://www.biotechexpressmag.com/does-the-covid-vaccine-kill-more-people-than-it-saves/", "encoding": "UTF-8"}, "image": null, "domain": "www.biotechexpressmag.com", "title": "Does the COVID Vaccine Kill More People Than It Saves? – Biotech Express Magazine", "cleaned_text": "According to U.S. Centers for Disease Control and Prevention data, more than 1 million excess deaths — that is, deaths in excess of the historical average — have been recorded since the COVID-19 pandemic began two years ago, and this cannot be explained by COVID-19. Deaths from heart disease, high blood pressure, dementia and many other illnesses rose during that time. “We’ve never seen anything like it,” Robert Anderson, CDC’s head of mortality statistics, told The Washington Post in mid-February 2022.\n\nAccording to University of Warwick researchers, “the scale of excess non-COVID deaths is large enough for it to be seen as its own pandemic.” A number of explanations have been offered, including the fact that lockdowns and other COVID restrictions discouraged or prevented people from seeking care. But another, less discussed factor may also be at play.\n\nAs reported by investigative journalist Jeffrey Jaxen in the April 22, 2022, data from Walgreens’ COVID-19 tracker reveal that COVID-jabbed individuals are testing positive for COVID at higher rates than the unjabbed. A deeper dive into the data reveals that two doses appear to have been protective for a short while, but after five months, it becomes net harmful.\n\nAfrica has had a consistently low vaccination rate throughout, while North America, Europe and South America all have had rapidly rising vaccination rates. Africa has also had a consistently low COVID mortality rate, although a slight rise began around September 2021. Still, it’s nowhere near the COVID death rates of North America, South America and Europe, all of which saw dramatic increases.\n\n We also have the benefit of more than one risk-benefit analysis, and all show that, with very few exceptions, the COVID jabs do more harm than good. For example, a risk-benefit analysis by Stephanie Seneff, Ph.D., and independent researcher Kathy Dopp, published in mid-February 2022, concluded that the COVID jab is deadlier than COVID-19 itself for anyone under the age of 80.\n\nThey looked at publicly available official data from the U.S. and U.K. for all age groups, and compared all-cause mortality to the risk of dying from COVID-19. “All age groups under 50 years old are at greater risk of fatality after receiving a COVID-19 inoculation than an unvaccinated person is at risk of a COVID-19 death,” Seneff and Dopp concluded. And for younger adults and children, there’s no benefit, only risk.\n\nSimilarly, an analysis of data in the U.S. Vaccine Adverse Events Reporting System (VAERS) by researchers Spiro Pantazatos and Herve Seligmann suggests that in those under age 18, the shots only increase the risk of death from COVID, and there’s no point at which the shot can prevent a single COVID death, no matter how many are vaccinated.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "January 16, 2021"}