{"result_id": "050003", "URL": "http://www.biotechexpressmag.com/vaccination-rising-deaths-and-the-false-narrative/", "timestamp": "2023-04-25 12:18:36 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://www.biotechexpressmag.com/vaccination-rising-deaths-and-the-false-narrative/", "encoding": "UTF-8"}, "image": null, "domain": "www.biotechexpressmag.com", "title": "Vaccination, Rising Deaths, And The False Narrative", "cleaned_text": "A popular corporate-run newspaper recently ran this sensational headline, “Doctors fear those hit by Covid now vulnerable to cardiac issues.” The narrative under the headline is scary. It goes on to say that Covid-19 not only killed millions of people, the virus is leaving many more sick and vulnerable to chronic cardiac and nervous system disorders.\n\nThe report goes on to describe two cases in young people in Maharashtra who had clotting and heart issues. The first, a 28-year-old who suffered from Covid-19 a year back landed up in hospital with heart issues. He weighed 130kg. The other youngster, 22-years-old, was rushed to a hospital with a large clot in his heart’s left lower chamber, which travelled to the artery supplying the lung. His medical history revealed Covid-19 infection a year ago.\n\nWhat is conspicuous by its absence in the news report is any history of vaccination against Covid-19 in these two cases. Is it deliberate? Why has coronavirus vaccination status become an elephant in the room in such cases? Against the backdrop of these two cases, cherry-picked news reports from the West are discussed expressing concerns about cardiac and neurological disorders post Covid-19 recovery.\n\n Amid all this, one must give credit to a member of the Covid task force of the state who admitted that while in recent times we’re seeing young people getting hospitalised with stroke or heart attack, it is not easy to straightaway make a correlation with Covid.\n\nAnother doctor said in the same news report that younger people who had Covid and have at least one comorbidity are more vulnerable to these complications compared to those without comorbidities.\n\n Strangely, there is no mention of vaccination status against Covid-19. The WHO’s chief scientist Soumya Swaminathan, meanwhile, has been talking through the hat. She tweeted, “We need to prepare for large increases in cardiovascular, neurological and mental health disorders in countries affected by the #SARSCoV2# pandemic.” For the chief scientist at the WHO, it’s a grave omission indeed not to consider the ill-effects of the experimental vaccine, however remote and unlikely that may be.\n\nSuch biased news reporting will make the reader attribute all complications to “long Covid,” which is increasingly being promoted as an emerging problem. And more disturbingly, it will brush under the carpet any complications due to the experimental vaccines as all adverse events following immunization (AEFI) would be conveniently covered under the blanket of “long Covid.”\n\nLet’s look at the other end of the spectrum.\n\n A volunteer at an AstraZeneca vaccine trial in late 2020 in Utah, US, Brianne Dressen, narrated her scary experience after receiving the AstraZeneca vaccine shot (marketed as Covidshield in India) as a trial participant. She never had Covid-19 in the past, which was one of the criteria for taking part in the trial.\n\n As a former rock climber, she was seriously incapacitated following the vaccine injury. Her vision and hearing were distorted, she had severe heart rate fluctuations, severe muscle weakness, and she had a sensation of internal electric shocks. She had to spend most of her time in a darkened room, unable to brush her teeth, or tolerate the touch of her children.\n\nShe also found other people who had never suffered from Covid-19 but experienced serious and long-lasting health problems after taking the coronavirus vaccine. Researchers were non-committal. Avindra Nath, clinical director at the National Institute of Neurological Disorders and Stroke who had been leading the investigation on behalf of the National Institute of Health (NIH), US, conceded the association of these disorders with Covid-19 vaccination, but fell short of conceding an “etiological association,” implying ignorance whether vaccines directly caused the subsequent health problems.\n\n Such restraint in jumping to conclusions is certainly the right approach in scientific inference. But the same restraint should be used before attributing any short-term adverse event or lingering long-term ill-health to natural infection with Covid.\n\nWhat dismayed the sufferers of these symptoms post-vaccination was the pullback by the NIH as communications with these patients dwindled by late 2021. There are other red signals. Edward Dowd, author of the book, “Cause Unknown: The Epidemic of Sudden Deaths in 2021 and 2022,” has been analyzing data on all mortality since March 2021 after hearing about many anecdotal accounts of vaccine injury.\n\nHe found a huge spike in sudden deaths spanning the fall of 2021 to early 2022 in the working age cohort corresponding to the vaccine mandate in the US for workers. People from 25 to 44 years of age experienced a dramatic 84% rise in excess mortality coinciding with mass vaccine mandates – 61,000 Americans died in the period from March 2021 to February 2022.\n\nHis findings were corroborated by studying insurance claims. Closer to home, a six-fold increase in heart attacks was observed in Mumbai in the year 2021 as observed by a critical-thinking data analyst from IIT Bombay.\n\nAs things stand, there are two contenders for the cause of the unusual health events particularly seen in young people around the world. It may be either be due to a long-term effect of having suffered from Covid-19 or due to the vaccines, or both. A scientific temperament cannot afford to support one over the other without hard evidence.\n\nRegrettably, in the ongoing pandemic, this approach has been found lacking on the part of the WHO, the CDC, and other haloed health research institutions. Eminence-based medicine has taken precedence over evidence-based medicine. Scientists, researchers, academicians and others surrendered the scientific approach and made a beeline for their one minute of fame in the era of 24×7 news channels.\n\nIn fact scientists and haloed scientific institutions seem to have gone a step further. They have blatantly ignored hard evidence that could have guided policy and at the same time resolved the issue of whether the short-term and long-term adverse events post-pandemic are due to the natural infection or the vaccines.\n\nIn the early days of the pandemic, there was evidence that immunity after recovery from natural infection can perhaps last indefinitely. Subsequently, while studies from Israel established that natural immunity is 13 times more robust than vaccine-induced immunity, the WHO continued to ignore the evidence while recommending mass vaccination for COVID.\n\nThe global scientific consensus seems to be on the brink of another major act of omission now, or perhaps, commission. It is relentlessly promoting mass vaccination when most of the people in countries such as India have already experienced the natural infection and therefore are already well protected.\n\nAccording to the evidence we have so far, vaccinating them wouldn’t confer any additional benefit while will subject them to the risk of adverse events, howsoever remote the chances are. More importantly, it is missing out on the opportunity to resolve the dilemma of a sudden spike in deaths among young people across the world – whether they are due to the disease or the vaccine.\n\nThose who have recovered from natural infection need not be vaccinated if we follow the science as well as apply common sense. It is the basic requirement of any experiment to have two different groups. In this case, we have the perfect opportunity to have a group of vaccinated people who have never suffered from the natural infection and the other group of unvaccinated people who have recovered from natural infection.\n\nThese groups could have been followed forward in time to compare the short-term and long-term adverse events and provide hard evidence of the cause-and-effect relationship. On the other hand, it appears that there is a desperate attempt to muddy the waters by eliminating the possibility of gathering this hard evidence.\n\nThe largest mass experiment in human history is being performed without a control group, reminding us of the public health quackery practised during ancient times – incredible stuff like the bloodletting that killed George Washington, the first president of the US.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2022-09-20T06:11:12+00:00"}