{"result_id": "050048", "URL": "http://www.biotechexpressmag.com/bill-gates-tests-positive-for-covid-19-even-after-many-booster-doses-mocked-on-twitter/", "timestamp": "2023-04-25 12:19:33 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://www.biotechexpressmag.com/bill-gates-tests-positive-for-covid-19-even-after-many-booster-doses-mocked-on-twitter/", "encoding": "UTF-8"}, "image": null, "domain": "www.biotechexpressmag.com", "title": "Bill Gates tests positive for COVID-19 even after many booster doses, mocked on twitter", "cleaned_text": "Microsoft co-founder and philanthropist Bill Gates announced that he has tested positive for COVID-19. The 66-year-old tech giant wrote in a tweet Tuesday that he is experiencing mild symptoms and is “following the experts’ advice” by isolating himself until he’s healthy.\n\nThe billionaire further informed that he has been completely vaccinated and received his booster shot too. “I’m fortunate to be vaccinated and boosted and have access to testing and great medical care,” Gates tweeted. Gates has said that the biggest scientific breakthrough that would help end the pandemic would be better and longer-lasting vaccines. Notably, his book, “How to Prevent the Next Pandemic,” came out last week, published by Penguin Random House.\n\nBut other on social media did not support the satings of Bill gates and openly criticized him on various things like what is the benefit of vaccine and boosters if even after that he is positive and how he can prevent pandemic when he cannot prevent himself form covid.\n\nSome of the selected tweets are:\n\n“What’s the use of these stupid shots because they do not prevent covid why shall people take them? If condoms allowed sexually transmitted diseases to pass through would people be still using them? No! Why take vaccines?”\n\n“I don’t believe it, it’s a psychological deception. A person silenced the media and advertised a vaccine. He earned billions of dollars. If he says he’s now covid19, it shows that these vaccines don’t work, why is he doing this because he knows the truth too.”\n\n“They want us to believe they all follow the same rules they impose on us that’s all. Their narrative is that we have a “great vaccine” that supposedly prevents severe illness but that we should still take those fake invasive tests and any stupid authoritarian measures they decide.”\n\n“In one of his statements, he talked about reducing the world population and was partially successful. Now I think it would be better if it was his turn.”\n\n “It will be really nice when people realize there is absolutely no reason for them to make their COVID diagnosis public. Who cares? Why do they think people want or need to know?”\n\n“That vaccine worked just as good as his antiVirus – you still get compromised either Vax or not.”", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2022-05-10T05:58:37+00:00"}