{"result_id": "050037", "URL": "http://www.biotechexpressmag.com/pfizer-ceo-bourla-take-u-turn-now-says-vaccine-not-effective-after-criminal-actions/", "timestamp": "2023-04-25 12:19:20 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://www.biotechexpressmag.com/pfizer-ceo-bourla-take-u-turn-now-says-vaccine-not-effective-after-criminal-actions/", "encoding": "UTF-8"}, "image": null, "domain": "www.biotechexpressmag.com", "title": "Pfizer CEO Bourla take U turn, now says vaccine not effective after criminal actions", "cleaned_text": "In an interview with CNBC, Pfizer CEO Albert Bourla stated that two doses of the vaccine give modest protection, if any, whereas three doses with a booster offer reasonable protection against hospitalisation and mortality but less protection against infection.\n\nIt’s worth noting that Bourla once stated that two doses of the mRNA vaccine were 100 percent effective in preventing the illness. Bourla sought to rewrite the entire COVID narrative in a series of interviews, while also casting serious doubt on the efficiency of his current product line.\n\nThe reaction has come after a tight slap on pfizer by U.S. district judge Mark Pittman who ordered the FDA to produce all remaining data on the vaccine at a rate of 55,000 pages per month, much faster than the 500-page-per month quota the FDA proposed in November. Rather than 75 years, it will now take about eight months for the FDA to make public the information it used to license Pfizer and BioNTech’s COVID-19 vaccine—provided the regulator can keep up with the new schedule.\n\nAccording to news sources, recently a group including former Pfizer vice president Dr. Michael Yeadon filed a complaint with the International Criminal Court (ICC) on behalf of U.K. citizens against Boris Johnson and U.K. officials, Bill and Melinda Gates, CEOs of major pharmaceutical companies, World Economic Forum executive chairman Klaus Schwab, and others for crimes against humanity.\n\nAlso, a new revived lawsuit accuses AstraZeneca, Johnson & Johnson, Pfizer and Roche of making corrupt payments to terrorists who ran Iraq’s health ministry. The suit claims that the companies obtained the contracts through bribes which financed the terrorist attacks on Americans.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2022-01-12T09:39:01+00:00"}