{"result_id": "050040", "URL": "http://www.biotechexpressmag.com/do-not-push-covid-vaccine-for-children-trial-size-is-laughable-says-experts/", "timestamp": "2023-04-25 12:19:24 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://www.biotechexpressmag.com/do-not-push-covid-vaccine-for-children-trial-size-is-laughable-says-experts/", "encoding": "UTF-8"}, "image": null, "domain": "www.biotechexpressmag.com", "title": "Do not Push COVID vaccine for Children, trial size is laughable, says Experts", "cleaned_text": "Global evidence available so far has suggested that the Sars CoV-2 virus that causes Covid-19 has infected kids but it hasn’t caused any severity among them. The mortality rate is as low as two children per 10 lakh. However, in India, the government hasn’t released any data (like other COVID data) on the mortality of children due to Covid-19 in both the first and the second waves.\n\nThe seroprevalence survey conducted in various parts of the country including Delhi has also shown that 70 per cent to 90 per cent of kids have already been exposed to the virus and they have developed natural antibodies.\n\nDr Amitav Banerjee, Clinical epidemiologist, In Dr D Y Patil Medical College, Pune, points out physiological as well as epidemiological evidence which suggests that kids don’t need vaccines. “They have very well-developed thymus glands which produce very good T-Cell and memory cell immunity. They also lack ACE-2 receptors on which the spike protein of the virus latches in the lungs,” Dr Banerjee said. He added, “Also, they have got a very high melatonin level that is very protective against the virus. So physiologically they are very well-protected by the nature.” ” , said.\n\nExperts like Dr Sanjay K Rai, Professor, Centre for Community Medicine, All India Institute of Medical Sciences (AIIMS), New Delhi and Dr Jayaprakash Muliyil, who is chairman of the Scientific Advisory Committee of the National Institute of Epidemiology, are of the view that the risk of Adverse Event Following Immunization (AEFI) is very low but it is not zero at all. “In such scenarios, we should look at a comparative picture of risk from Covid-19 as well as AEFI. If the latter outweighs the former, then vaccination is a costly and risky exercise with no benefits,” Dr Rai said.\n\nDr Muliyil also feels that the death among kids, especially below 12, is almost zero and “there is no reason to vaccinate kids as they are not vulnerable to Covid-19,” he said.\n\nDr Banerjee seconds the view that the vaccine’s side effect is not negligible. “There has been adverse effect from the vaccine particularly Myocarditis after the launch of vaccinations for children in some countries,” he said. Once the mass vaccination process started, countries reported several types of side effects, including changes to women’s menstrual cycles in the UK and blood clotting from the AstraZeneca (Covishield) vaccine among others. In April 2021, various European countries restricted the use of AstraZeneca (Covishield); it is not recommended for the young, based on safety concerns.\n\nBhaskaran Raman, a faculty in the Department of Computer Science and Engineering at IIT Bombay, said, “Data from various countries such as the USA, Israel, and Canada show that this risk of Myocarditis to kids from the mRNA vaccine is about 1 in 6000. Considering this, many European countries recently stopped the use of the Moderna vaccine for those under 30,”. Raman has been carrying out a data study of various countries on the impact of vaccination. He said, “It is important to note here that the above risks were not signalled in the initial vaccine trials: the trial size itself was too small to uncover rare risks (32,449 for AstraZeneca/Covishield). That these risks have been found after mass vaccination is deeply concerning.”\n\nHe added, “The trial sizes for kids’ vaccines (525: Covaxin, 1000: ZyCov-D), are laughably small, except that this is no laughing matter. Such low trial sizes cannot capture anything but the most obvious risks. Would we discover other risks of Covaxin or ZyCov-D after vaccinating millions of children? This is a very worrying unknown indeed.”\n\nRaman in his data research has found that in the USA, for kids aged 5-14, Covid represents a lower risk than each of the following: flu/pneumonia, drowning, heart disease, homicide, suicide, traffic accidents, and cancer.\n\n“In the context of India, other comparisons are even starker: nearly 9 lakh children die of hunger-related causes every year. Almost 2000 infants die every single day in India, of preventable malnutrition-related causes: infant mortality rate of nearly 3% is about 1000-2000 times more than the risk of Covid death for kids!” Raman said.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.biotechexpressmag.com/some-countries-pause-dosing-of-astrazeneca-vaccine-due-to-clotting-concerns/"], "authors": [], "publish_date": "2021-11-30T20:14:46+00:00"}