{"result_id": "050026", "URL": "http://www.biotechexpressmag.com/deaths-due-covid-19-vaccines-should-be-compensated-by-vaccine-makers-expert-hope-on-kerala-hc-remark/", "timestamp": "2023-04-25 12:19:06 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://www.biotechexpressmag.com/deaths-due-covid-19-vaccines-should-be-compensated-by-vaccine-makers-expert-hope-on-kerala-hc-remark/", "encoding": "UTF-8"}, "image": null, "domain": "www.biotechexpressmag.com", "title": "Deaths due Covid-19 vaccines should be compensated by vaccine makers: Expert hope on Kerala HC remark", "cleaned_text": "The Kerala High Court on August 11, 2022 has made serious observations on deaths or adverse events related to Covid-19 vaccines. The court was hearing the case of Sayeeda KA vs Union of India. The Court called for urgent action from the Central Government and the National Disaster Management Authority (NDMA). Court said, they should formulate guidelines for disbursement of compensation to the families of people who died due to reactions to the Covid-19 vaccine. The Court was hearing the petition of a woman who lost her husband, following the administering of the Covid-19 vaccine in August 2021.\n\nThis is not the new thing, many such cases are pending in different state high courts, a vaccine expert from the sector said on being anonymous. He added that the compensation ought to be provided by vaccine maker and not government as it should not be tax payers’ money. As we have seen earlier also how the government played with the compensation of COVID deaths, first it was 4 lakhs, later it was reduced to 50,000 and then the deaths were reduced in database so to save the compensation money, the reasons for deaths were given COVID while declaring COVID deaths, though in early pandemic co-morbidities were considered as COVID.\n\nMost of adverse event and deaths due to vaccines are because due to COVISHIELD, however covaxin cannot be neglected. It was already well established much before that Astrazeneca vaccine which Serum Institute of India was making had some fatal effects, clots were reported and that is what exactly has been reported in AEFI India data. Majority of deaths are reported after Covishield shot and most of them are because of clots in parts of the body.\n\nNow there are many reports coming in prestigious journals that vaccine do not provide any kind of immunity not they reduce the transmission but they were approved in hurry and now we can see how in non-emergency situation people have lost their lives.\n\nComing back to compensation, vaccine makers can easily make payments, they have made billions of rupees and had millions of funding. For example only Serum Institute’s net worth sky rocketed after selling COVID vaccine. In 2020, Serum Institute’s founder Poonawalla had a net worth of $8.2 billion, which has risen by $17.8 billion over the last two covid hit years.\n\nThere are serious issues with the vaccine because the companies have made their profits but the deceased and their family members have suffered. They were not ready to take vaccine but government imposed restrictions like ration, job security etc. to forcefully inoculate them the vaccine that already had reported adverse events.\n\nThe Kerala High Court said, “This is a national calamity which we faced. Of course, I do understand the case is very genuine and it has to be dealt with. As far as the Central government is concerned, similar issues are cropping up in other states also. There has to be an effort to formulate a proper guideline, a proper scheme for compensating these persons and that is being done. Let them bring on record what steps have been taken so that I can pass a reasoned and considered order, rather than an order in vacuum. It is not a laughing matter, I consider it to be very serious”, the judge orally observed.\n\n The Court deeply acknowledged the seriousness of the petition. The submission made by the petitioner sought the pacing of the procedure of redeeming compensation, as the people are facing severe consequences owing to the death of the earning member of the family.\n\nThere are identical issues pertaining in various states informed the Central Government Counsel. The cases of adverse effects following inoculation of Covid-19 vaccines have popped up throughout India.\n\n In the previous article of April 2022, Biotech Express reported total 70,102 adverse events after vaccination in India in which Covishield comprised 63,315 cases, followed by Covaxin at 6,757 and Sputnik at 30. Out of the total cases a total 1,013 fatalities were reported following the COVID-19 vaccines, 921 were after Covishield, 92 after Covaxin, and Sputnik reported zero such incidents.\n\nCompensation in other countries\n\n In 2011, Merck pleaded guilty to criminal charges related to the marketing and sales of Vioxx. One agency scientist, Dr. David Graham, estimated that the use of Vioxx may have contributed to more than 27,000 heart attacks or deaths. The company agreed to pay the U.S. Department of Justice $950 million to resolve its misconduct.\n\nAnd Merck settled with tens of thousands of injured patients in 2007. Merck agreed to pay $4.85 billion to plaintiffs and their families.\n\nIn 2012, GlaxoSmithKline (GSK) agreed to a $3 billion settlement. It was the largest health care fraud settlement in U.S. history. The charges stemmed from certain prescription drugs, including Paxil, Wellbutrin and Avandia.\n\nJohnson & Johnson paid $2.2 billion in 2013 for improperly marketing its drug Risperdal.\n\n A jury ordered Takeda Pharmaceuticals and Eli Lilly to pay $9 billion in 2014. The award went to an Actos user who developed bladder cancer.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2022-08-21T04:58:24+00:00"}