{"result_id": "050035", "URL": "http://www.biotechexpressmag.com/siis-cervevac-the-new-dcgi-approved-vaccine-without-published-clinical-trial-results/", "timestamp": "2023-04-25 12:19:17 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://www.biotechexpressmag.com/siis-cervevac-the-new-dcgi-approved-vaccine-without-published-clinical-trial-results/", "encoding": "UTF-8"}, "image": null, "domain": "www.biotechexpressmag.com", "title": "SII’s Cervevac: The new DCGI approved vaccine without published clinical trial results", "cleaned_text": "According to a recent news, the Indian government is planning to include Serum Institute of India’s indigenously-developed Quadrivalent Human Papillomavirus vaccine (qHPV) against cervical cancer in the National Immunization Programme.\n\nAs per views of a vaccine expert who is furious after this news said, there is no clinical trial study available in public domain to study the benefits or harmful effects of the proposed vaccine but system is in hurry to launch this product while not making data transparent for public scrutiny. We have seen earlier also that how Covishield which was developed by Astrazeneca and manufactured by Serum Institute in India has caused serious adverse events including deaths from blood clots, as per AEFI data. Apart from Indian scenario now data from Pfizer is also telling us the hidden picture of adverse events that are coming after right to information (RTI) request. The Pfizer covid vaccine has affected to large extent and it was in the knowledge of FDA but they kept pushing it.\n\nQuestions about cervical cancer vaccine efficacy, safety and affordability have dominated the debate since it was introduced in 2006 in the USA.\n\nIn one study the researchers in USA looked at results from a large, CDC-led survey of parents of teens aged 13 to 17. From 2015 to 2018, more than 39,000 caregivers of teens who had not received the HPV vaccine responded to the survey and selected 1 of 31 reasons for declining the vaccine.\n\nThe top five selected reasons were:\n\nIn 2015, 13% of parents had cited safety concerns as the main reason for declining the HPV vaccine. But by 2018, that percentage had risen to 23%. During the same period, there was a drop in the percentage of parents citing three of the other most common reasons for declining or delaying the HPV vaccine.\n\nAccording to a research published in January 2020, publications originating from Italy, Japan, Australia, Columbia, India, Ireland, Denmark, Mexico, Norway, Sweden, Canada, France, the USA, and the United Kingdom have reported post-HPV vaccination phenomena that share overlapping clinical features with chronic fatigue syndrome/myalgic encephalomyelitis (CFS/ME), fibromyalgia (FM), postural orthostatic tachycardia syndrome (POTS), complex regional pain syndrome (CRPS), small fiber neuropathy (SFN), and autonomic dysfunction (AD).\n\nTypical symptoms include (but are not limited to) prolonged generalized fatigue, chronic headaches, widespread generalized pain, tremors, orthostatic fainting, postural tachycardia, alterations in gastrointestinal motility, gait disturbance, anxiety, paresthesia’s, sleep disturbance, learning impairment, difficulty in concentration, and other cognitive phenomena. These reported phenomena have created hesitation by some parents to have HPV vaccination administered to their teenage children.\n\nCurrently two companies in the world are making cervical cancer vaccine, they are GlaxoSmithKIine and Merck & Co. The two companies’ respective vaccines — the former’s Cervarix and the latter’s Gardasil — were widely marketed as the best available prophylactic, or preventive, for cervical cancer but have also gained huge criticism.\n\nGardasil, also known as Gardasil-4 or quadrivalent human papillomavirus recombinant vaccine, was approved for use in 2006. It protects against two high-risk HPV types (types 16 and 18) and two low-risk types (types 6 and 11). Gardasil-9, also known as human papillomavirus 9-valent recombinant vaccine, was approved in 2014. It protects against two low-risk HPV types (types 6 and 11) and seven high-risk types (types 16, 18, 31, 33, 45, 52, and 58).\n\nCervarix, also known as human papillomavirus bivalent vaccine recombinant, was approved in 2009. It protects against two high-risk HPV types (types 16 and 18).\n\nIn USA, HPV vaccine lawyers for a group of victims filed a motion in federal court for an MDL HPV class action lawsuit for the long-term side effects caused by the Gardasil vaccine. Specifically, claims that Merck failed to properly warn of the dangerous side effect that include postural orthostatic tachycardia syndrome (POTS), autoimmune disorders, neurologic injuries, and other serious complications. The motion identified 34 pending Gardasil lawsuits in 25 different federal districts.\n\nThe number of HPV vaccine lawsuits will grow exponentially as more people learn about the serious long-term side effects the lawsuits allege were caused by Merck’s HPV vaccinations. There are also another 91 Gardasil cases currently pending in “Vaccine Court” in the U.S. Court of Claims. These HPV lawsuits will convert to traditional tort cases once the vaccine proceeding is finished.\n\nAccording to lawyers, Merck obtained approval for Gardasil in 2006 with “deceptive research trials” which overstated the benefits and vastly understated the risks and side effects of the vaccine. Merck aggressively marketed Gardasil utilizing scare tactics, false advertising, and political lobbyists to induce millions of parents to vaccinate their adolescent girls with Gardasil.\n\nNow thousands of girls who received the Gardasil vaccine are experiencing serious adverse health consequences and hundreds have died as a result of vaccine complications.\n\nMerck obtained a fast-track FDA approval for Gardasil in June 2006. During the fast-track approval process, Merck concealed material facts about the effectiveness (or lack thereof) and safety of Gardasil. Merck also failed to perform full and appropriate medical investigations and studies during the preapproval or post-approval stages. The clinical trials Merck undertook did not even examine Gardasil’s potential to prevent cancer, rather, the trials only analyzed whether Gardasil could prevent potential precursor conditions. Merck then submitted misleading data suggesting that these “precursor conditions” inexorably result in cancer.\n\nBefore Gardasil, there was no HPV public health emergency in the U.S. and few women had even heard of HPV so there was little or no demand for an HPV vaccine. To ensure the financial success of its new “holy grail,” Merk preceded its rollout of Gardasil with years of expensive HPV “disease awareness” marketing.\n\nOnce Gardasil was approved for pre-teen girls, Merck launched an aggressive propaganda campaign aimed at scaring and guilting parents who did not inoculate their daughters with Gardasil. Merk’s campaign implied that “good parents” vaccinate their children with Gardasil.\n\nIn addition to its aggressive advertising campaign, Merk also used political lobbyists and financial incentives to get state legislatures to make the Gardasil vaccine mandatory for all school children. Starting in 2004, Merck pumped millions into political lobbying organizations such as Women in Government and NACCHO. These organizations then started aggressively pushing legislators around the country to mandate Gardasil vaccines for all 6th-grade girls.\n\nIn January 2020, a study from the UK raised significant doubts about whether the Gardasil vaccine prevented cervical cancer as claimed by Merck. The study highlights the fact that Gardasil has never been proven to prevent cervical cancer (or any other type of cancer).\n\nContrary to Merck’s representations, Gardasil may increase the risk of cervical and other cancers, not prevent them, according to lawyers. Several studies (including one from the CDC who has still stood by the vaccine so far) have found that by suppressing certain HPV strains, Gardasil vaccines may promote mutagenetic changes in the virus that can lead to cancer. Public health data seems to support the conclusion that Gardasil may be increasing the rate of cervical cancer. After the introduction of the HPV Vaccine in Britain, cervical cancer rates among young women aged 25 to 29 increased by 54%. In Australia, 13 years after Gardasil was released and pushed upon teenagers, there has been a 16% increase in women 25-29 and a 30% increase for women 30-34. Meanwhile, rates are decreasing for older women (who have not been vaccinated).\n\nThis is the information which is available with Miller & Zois, Attorneys at Law in USA.\n\nThe Cervavac vaccine which is currently approved has completed clinical trial (http://ctri.nic.in/Clinicaltrials/pmaindet2.php?trialid=26674&EncHid=&userName=serum%20institute) according to company sources but still I am not able to find neither any published research about this vaccine nor any data on CDSCO website, expert added.\n\nAccording to PTI, Prime Minister Narendra Modi was likely to make an announcement on August 15 but did not after Biotech Express brought this issue to public on twitter. It suggested why inclusion of vaccine in national immunization program and if he has learned that if something goes wrong how disastrous can the effect be. The trial data is not public in the country where many experts are available, but it was approved by some officials of govt only.\n\nAccording to some press releases but not any published research, the phase 2/3 clinical trial of the vaccine has been completed with support of the Department of Biotechnology. The government’s advisory panel NTAGI approved qHPV after reviewing clinical trial data of the vaccine.\n\nIn the application to the DCGI, Singh, from SII had stated that qHPV vaccine CERVAVAC has demonstrated robust antibody response that is nearly 1,000 times higher than the baseline against all targeted HPV types and in all dose and age groups, though it is just a statement not supported by scientific results, as far as information in public domain considered.\n\nGoing further, it is evident on the CTRI website that it has the registration of the trial but no publication record of the results, though it was recently modified on August 12, 2022.\n\nIf we see cervical cancer vaccine, they are surrounded by controversies and according to some reports they are not effective at all, infact they may show serious side effects including deaths and other lifelong ailments. It is also evident that currently approved SII cervical cancer vaccine trial data is not available in public domain and thus whole issue raise serious questions about approval of vaccine. Why it is not made public by SII if they have done good research and why not by DCGI if they believe they passed a great product or DBT if they think their funding has given fruitful results. In current scenario it is not possible to comment more about approval or denial of vaccine but the trial data should be made public and till then the vaccine should not be pushed for national immunization as it can create disaster among women who are lifeline of the country.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2022-08-20T05:52:55+00:00"}