{"result_id": "050043", "URL": "http://www.biotechexpressmag.com/astrazeneca-covid-19-vaccines-which-uses-a-chimpanzee-adenovirus-inked-to-monkeypox-outbreak/", "timestamp": "2023-04-25 12:19:27 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://www.biotechexpressmag.com/astrazeneca-covid-19-vaccines-which-uses-a-chimpanzee-adenovirus-inked-to-monkeypox-outbreak/", "encoding": "UTF-8"}, "image": null, "domain": "www.biotechexpressmag.com", "title": "AstraZeneca Covid-19 vaccines which uses a chimpanzee adenovirus inked to monkeypox outbreak", "cleaned_text": "Conspiracy theorists claim that monkeypox cases are seen in countries that have vaccinated their population with AstraZeneca, which uses a chimpanzee adenovirus.\n\nAs the world reels under the after-effects of the deadly coronavirus pandemic, conspiracy theorists have now begun to link the Covid-19 vaccines to monkeypox, the cases of which have been reported in a few countries over the last two-three weeks.\n\nTheir theory? Covid-19 vaccines contain a chimpanzee virus that’s causing the monkeypox outbreak.\n\nThe theory is based on the fact that the AstraZeneca vaccine developed by the University of Oxford (available in India under the label Covishield), contains a chimpanzee adenovirus vaccine vector. While there is science behind this (more on that later), conspiracy theorists are using this as yet another reason to drum up anti-vaccine sentiment.\n\nA popular example is Alex Jones of InfoWars who claimed that monkeypox has popped up in countries where people have been taking the AstraZeneca and Johnson & Johnson vaccine.\n\n“What is AstraZeneca and J+J. They’re virus vectors that inject the genome of a chimpanzee into your cells,” Jones claimed.\n\nSeveral conspiracy theories also claim that the Covid-19 vaccines were developed in monkey tissues while some are blaming Bill Gates for the pandemic outbreak and the aftermath.\n\nYes, the AstraZeneca vaccine uses a chimpanzee adenovirus vaccine vector, which is a harmless, weakened virus that usually causes the common cold in chimpanzees. The University of Oxford, during the development of the vaccine, said that Chimpanzee adenoviral vectors are a very well-studied vaccine type, having been used safely in thousands of subjects. “It has been genetically changed so that it is impossible for it to grow in humans,” the University of Oxford has said.\n\nMeanwhile, responding to claims, the Australian Government’s Department of Health has said that the adenovirus vaccine vector, known as ChAdOx1, was chosen as a suitable vaccine technology for the SARS-CoV-2 vaccine as it has been shown to generate a strong immune response from one dose in other vaccines.\n\nDr. Faheem Younus, Vice President and Chief Quality Officer at the University of Maryland Upper Chesapeake Health said that while monkeypox cases are concerning but the risk of this becoming a Covid-like pandemic is zero per cent. He added that the monkeypox virus is not novel unlike SARS-CoV-2.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2022-05-25T11:16:42+00:00"}