{"result_id": "050030", "URL": "http://www.biotechexpressmag.com/science-and-scientists-completely-gone-down-night-curfew-and-vaccine-mandates-again/", "timestamp": "2023-04-25 12:19:11 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://www.biotechexpressmag.com/science-and-scientists-completely-gone-down-night-curfew-and-vaccine-mandates-again/", "encoding": "UTF-8"}, "image": null, "domain": "www.biotechexpressmag.com", "title": "Science and scientists completely gone down? Night curfew and vaccine mandates again", "cleaned_text": "The Coronavirus pandemic has created an authoritarian Covid bureaucracy consisting of politicians, public health leaders, and perpetually fearful elites.. Bureaucracy’s covid mitigation rules are so ridiculously irrational and unscientific that Marty Makary, MD of Johns Hopkins School of Medicine in the US, calls it a “pandemic of lunacy.” Their response to Omicron, the newest variant of the Wuhan Covid-19 virus, falls in the same category – they are redundant, mindless, unscientific, and uncompassionate, said Avatans Kumar in an article written in Times of India Dec. 25, 2021.\n\nClose to two years into the pandemic, while many countries collect and disseminate stratified real-life data on the pandemic and vaccination, India’s Ministry of Health and Family Services’ (MoHHS) brings out its mesh of useless data through its frequent press releases. The release contains – number of tests performed, active Covid-19 “cases,” recoveries, vaccination stats, etc. The rating-hungry media outlets then use this information to hype fear and hysteria, Avant added.\n\nIt is now proved that vaccine do not work but govt. and health officials took it further and mandating vaccine for children.\n\nOnce fearful for terrorism charges, now people are coming forward including scientists and doctors to oppose govts.decisions of mask, vaccination and lockdown mandates.\n\nDr Sanjay Rai, senior epidemiologist & principal investigator of Covaxin trials for adults and children at AIIMS termed the Centre’s decision to vaccinate children against Covid “unscientific” & said it will not yield any additional benefit.\n\nDr Maya Valecha tweeted, Show us the figures how many healthy kids died, had any severe disease because of Corona. These are not free approved injections.\n\nRecent Night curfews have become part of joke as rallies in days are ongoing but night are facing curfews when the chances of transmission are rarest. Actions of Judiciary has also come into question when they allow rallies on one hand but do not take any action against night curfews,\n\nSrinivas Kakkilaya, Physician tweeted, “Night Curfew Starts In UP” Matlab(means), Omicron spreads only during the nights, affects only those who do not go to bed by 11pm. It doesn’t spread at the crowded election rallies or at weddings attended by <199 people & so on.\n\nAll these points indicate that the scientists who sit on topmost positions and are part of COVID task forces do not have guts to contradict govt. policies and/or they have become puppets of politicians in power to save their positions.\n\nBut for what, if it is now for common people someday it can be for elites also. No one will remain in power forever either scientific or political and thus in near future or sometime after they will become general public and will face the same.\n\nAdvocate Dipali N Ojha a part of Awaken India Movement(AIM) asked people to see if whole COVID thing is a scandal. AIM with Indian Bar Association is fighting to stop mandates but not sure of such actions when even after court’s orders govts. are mandating such things.\n\nIs this not disobeying of Judiciary when central govt. filed affidavit in Supreme court that COVID vaccine is not mandatory but health officials in different states are using forces for inoculation, a tweet read.\n\nThe author believe that scientists who are servant of govt. should come forward to curb this covid menace and start advocating to stop this nuisance that is going around in the name of Coronavirus.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2021-12-27T07:47:39+00:00"}