{"result_id": "050018", "URL": "http://www.biotechexpressmag.com/bharat-biotech-and-biofabri-partner-to-develop-manufacture-and-distribute-novel-tb-vaccine/", "timestamp": "2023-04-25 12:18:57 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://www.biotechexpressmag.com/bharat-biotech-and-biofabri-partner-to-develop-manufacture-and-distribute-novel-tb-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "www.biotechexpressmag.com", "title": "Bharat Biotech and BIOFABRI partner to develop, manufacture and distribute novel TB vaccine – Biotech Express Magazine", "cleaned_text": "Bharat Biotech, has partnered with BIOFABRI, a Spanish biopharmaceutical company, to develop, manufacture and market a new tuberculosis vaccine MTBVAC in over 70 countries in Southeast Asia and sub-Saharan Africa.\n\nMTBVAC is the only live attenuated vaccine against Mycobacterium tuberculosis in development. It is currently being developed for two purposes: as a more effective and potentially longer-lasting vaccine than BCG for new-borns and, on the other hand, for the prevention of TB disease in adults and adolescents, for whom there is currently no effective vaccine. MTBVAC will start phase 3 clinical trials in Senegal, South Africa and Madagascar in the second half of 2022.\n\nThe vaccine is being manufactured and developed by BIOFABRI, in close collaboration with the University of Zaragoza, IAVI and the Tuberculosis Vaccine Initiative (TBVI). MTBVAC has been designed and discovered by Carlos Martín team of the University of Zaragoza.\n\nThe agreement between Bharat Biotech and Biofabri would guarantee the worldwide production and the supply of the future vaccine in more than 70 countries with a high TB incidence, such as India which has the highest TB burden in the world, with a 25% of all cases.\n\nThe only currently available TB vaccine, the Bacillus Calmette-Guérin vaccine (BCG), was developed 100 years ago and has limited efficacy in preventing pulmonary TB in adults, who, along with adolescents, are the biggest spreaders of the disease.\n\nThe company has opted for this vaccine candidate owing to its advanced stage of clinical development as well as the extremely promising results from Phase 1 and Phase 2 clinical trials, said Dr. Krishna Ella, Chairman and Managing Director Bharat Biotech.\n\n“For us, this agreement is a milestone in the MTBVAC project. Indonesia, the Philippines, Pakistan and South Africa, among others, where tuberculosis is a public health problem due to its high incidence”, said Esteban Rodríguez, CEO, Biofabri.\n\n“Accelerating efficacy studies for TB vaccines that have shown better protection than BCG in different preclinical models and to be immunogenic and safe in humans, as is the case of MTBVAC, is possible as it has been done for Covid vaccines.\n\nThe experience of Bharat Biotech will reinforce the collaboration with TBVI and IAVI. We are ready, as soon that we can demonstrate that MTBVAC protects against pulmonary forms of TB, the sooner we can begin to save live and to have huge impact in TB pandemic, including multidrug resist forms of TB” stated Professor Carlos Martín, principal investigator, TB Vaccine project, University of Zaragoza, Spain.\n\nDrug-resistant/multidrug-resistant TB is becoming a growing problem due treatment of DR/MDR TB is arduous, expensive and not always successful. A vaccine that prevents TB disease would be a big step to tackle the DR/MDR TB problem.\n\nA vaccine against tuberculosis is more necessary than ever and, thanks to the different agreements promoted by Zendal Group through the biopharmaceutical company BIOFABRI, it is possible to speed it up, stated the company.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "January 16, 2021"}