{"result_id": "050031", "URL": "http://www.biotechexpressmag.com/no-vaccine-mandates-after-supreme-court-order-next-compensation-to-aefi-survivors-from-covid-vaccine-makers-possible/", "timestamp": "2023-04-25 12:19:12 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://www.biotechexpressmag.com/no-vaccine-mandates-after-supreme-court-order-next-compensation-to-aefi-survivors-from-covid-vaccine-makers-possible/", "encoding": "UTF-8"}, "image": null, "domain": "www.biotechexpressmag.com", "title": "No Vaccine Mandates after supreme court order, next compensation to AEFI survivors from COVID Vaccine makers possible?", "cleaned_text": "An Aurangabad resident has approached Bombay High Court seeking compensation of Rs 1000 crore from the Maharashtra government, Centre and Serum Institute of India claiming his daughter, a medical student, died due to side effects of the Covishield vaccine that she was administered in January 2021.\n\nSince the covid vaccination started many individuals are complaining about serious vaccine side effects, most of them reported in Covishield and include blood clotting events in various parts of body. These adverse events are creating many unexpected outcomes in patients like blindness, heart attacks and many more as reported in article appeared in Biotech Express in April 2022 issue.( http://www.biotechexpressmag.com/editorial-what-serious-side-effects-reported-after-inoculation-of-indian-covid-19-vaccines-survey-of-aefi-reports/)\n\nExperts from the field expect that these adverse events are much more than reported in AEFI as the reporting system is not strong enough like developed countries and thus many adverse events go unnoticed. The presence of adverse events in AEFI show us that indeed COVID vaccines have side effects but what will be the compensation for these adverse events either from vaccine makers or government is not clear yet.\n\nThough the government has always said that vaccine is not mandatory but limiting living resources like food, transportation etc. to unvaccinated individuals has forced people to take some action and toward this many NGOs and experts have come forward. Due to their consistent efforts a recent order from supreme court allowed people to choose whether to vaccinate or not and no restrictions on unvaccinated.\n\nThat is OK, but what will be the compensation for vaccine injuries is still a matter of concern as many people have lost their lives due to vaccine side effects and many of them have become ill for lifetime.\n\nThese covid vaccines were approved in emergency mode but was forced to take in non emergent situation like Petitioner Dilip Lunawat, who filed the plea before the principal bench of HC Bombay, claimed about his daughter Snehal, a medical student in Nashik, who was administered both doses of the vaccine as part of the state government’s initiative to vaccinate all health care workers. The plea said Snehal was assured the COVID vaccine was completely safe, and posed no risk or threat to the body, and was, therefore, compelled to take vaccine at the college since she was a health worker. He said his daughter took the vaccine on January 28, 2021 and died a few weeks later on March 1 due to the side effects of those vaccines. He is seeking compensation of Rs 1000 crore from the Maharashtra government, Centre and Serum Institute of India. (https://www.india.com/maharashtra/maharashtra-man-claims-daughter-died-of-covid-vaccine-side-effects-seeks-rs-1000-core-compensation-5218452/)\n\nThe government of India has stated in Parliament that there is no provision of compensation for any side-effects or medical complications (adverse events) due to inoculation under emergency-use but an individual can still take legal recourse to get compensated. Specifically, if, there are adverse side-effects from a vaccination manufactured or administered by any agency, resulting in loss or injury to the vaccinated, including permanent-disablement or death then a legal-action can be brought by the injured-party or his or her representative in a Court of Law under Fatal Accidents Act of 1855.\n\nSimilar case of vaccine death in India due to covishield was filed in the Kerala High Court by the parents of a 19-year-old girl, who died allegedly due to a rare-immunogenic response to the Covishield vaccine seeking compensation of Rs 10 crore. The 19-year-old postgraduate student began feeling unwell a day after getting the Covishield vaccine, as per the petition. A week later, the girl was taken to the hospital where she was given symptomatic treatment and discharged the same day. The girl passed away on 12 August, 2021 exactly two weeks after she was administered the vaccine with the official post-mortem report stating that the cause of death was inter-cranial bleeding. Further, it found that the girl might have suffered from thrombocytopenia, thrombosis syndrome, which is supposed to be a rare immunogenic response to the COVID-19 vaccines. (https://www.firstpost.com/india/couple-moves-kerala-high-court-seeking-rs-10-crore-compensation-alleging-daughters-death-due-to-covishield-vaccine-10563821.html)\n\nCompensation suit are not only restricted to India, in Taiwan, a panel of experts appointed by the Ministry of Health and Welfare agreed that the government should pay NT$6 million (US$209,025) in the case of a woman, whose death is the first to be classified as directly related to receiving a COVID-19 vaccine shot in Taiwan. Because the woman did not have any chronic ailments, nor other conditions that could explain a very rare blood-clotting disorder called “thrombosis with thrombocytopenia syndrome,” a known side effect of the AstraZeneca vaccine she received, the panel determined that her death was linked to the vaccine, Chuang said. The woman was a Taipei resident in her 50s, who was identified only by her surname Yu. She died of a brain hemorrhage, a complication caused by the syndrome, according to the panel’s findings. (https://focustaiwan.tw/society/202203290026)\n\n As per data with Australian government, 37.8 million vaccine doses had been administered till November 7, 2021 and 78,880 adverse events linked to vaccination were recorded. A portal was being made to enable people to claim damages. At least 10,000 people have registered interest to make a claim, till the report came on news portal. (https://www.wionews.com/world/thousands-of-australians-want-compensation-for-covid-vaccine-side-effects-report-429883).\n\nIn UK, Up to 920 compensation applications have been filed by people who were left seriously injured after getting the Covid-19 vaccine as claims could hit £110million. Vikki Spit, from Alston, Cumbria, hopes to qualify for financial support after her fiancé Zion, 48, died of a brain haemorrhage two weeks after getting the AstraZeneca vaccine in May 2021. She claimed his death certificate named the AstraZeneca vaccine but said she has been left in ‘limbo’ after applying for the scheme in June. (https://www.dailymail.co.uk/news/article-10556213/Covid-vaccine-claims-hit-110m-920-compensation-applications-filed.html)\n\nSo, the compensation mechanism exist in most developed countries and many of the vaccine adverse events injuries have been compensated appropriately but will it happen in India is still an important question. In case, the kin of injured people can go to courts as per the directions from the government for which they need proofs but will they be able to provide proof is still another question as AEFI has not registered all the adverse events. Recently, after thorough studies and suggestions from the experts, Supreme court of India has removed any kind of COVID vaccine mandate.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2022-05-19T06:44:38+00:00"}