{"result_id": "050011", "URL": "http://www.biotechexpressmag.com/new-zealand-high-court-ends-vaccine-mandate-its-a-gross-violation-of-human-rights/", "timestamp": "2023-04-25 12:18:48 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://www.biotechexpressmag.com/new-zealand-high-court-ends-vaccine-mandate-its-a-gross-violation-of-human-rights/", "encoding": "UTF-8"}, "image": null, "domain": "www.biotechexpressmag.com", "title": "New Zealand High Court ENDS Vaccine Mandate: “It’s a Gross Violation of Human Rights”", "cleaned_text": "New Zealand Prime Minister Jacinda Ardern was left reeling on Friday after a High Court ruled that her vaccine mandate represented a “gross violation of human rights” for New Zealanders.\n\nThe landmark case means that the police and NZDF cannot be fired for refusing to take the experimental vaccine. This case will be used to overthrow all of Ardern’s illegal mandates in New Zealand.\n\nJustice Francis Cooke ruled that ordering frontline police officers and Defence staff to be vaccinated or face losing their job was not a “reasonably justified” breach of the Bill of Rights.\n\nNzherald.co.nz reports: The lawyer for the police and Defence staff at the centre of the claim is now calling for the suspended workers to return to their jobs immediately, saying many have given decades of service to their community and are still committed to their jobs.\n\nThe challenge, put forward by a group of Defence force and police employees, questioned the legality of making an order under the Covid-19 Public Health Response Act to require vaccination for frontline employees.\n\nThe challenge was supported by a group of 37 employees affected by the mandate, who submitted written affidavits to the court.\n\nThe judge said that while it’s clear the government isn’t forcing Police and NZDF employees to get vaccinated against their will and they still have the right to refuse vaccination, the mandate presents an element of pressure.\n\n“The associated pressure to surrender employment involves a limit on the right to retain that employment, which the above principles suggest can be thought of as an important right or interest recognised not only in domestic law, but in the international instruments,” Justice Cooke stated.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2022-04-01T08:05:44+00:00"}