{"result_id": "050001", "URL": "http://www.biotechexpressmag.com/study-links-increase-in-emergency-heart-events-with-covid-19-vaccine-rollout/", "timestamp": "2023-04-25 12:18:30 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://www.biotechexpressmag.com/study-links-increase-in-emergency-heart-events-with-covid-19-vaccine-rollout/", "encoding": "UTF-8"}, "image": null, "domain": "www.biotechexpressmag.com", "title": "Study Links Increase in Emergency Heart Events With COVID-19 Vaccine Rollout – Biotech Express Magazine", "cleaned_text": "A new study found a correlation between an increase in emergency cardiovascular events among people under 40 years of age and the early months of Israel’s COVID-19 vaccine program. Published in the Nature journal, researchers utilized data from the Israel National Emergency Medical Services between 2019 and 2021 that evaluated emergency, or EMS, calls among 16- to 39-year-olds across Israel “with potential factors including COVID-19 infection and vaccination rates.”\n\nThey found that there was a 25 percent increase in EMS calls between January 2021 to May 2021, as compared with the years 2019 and 2020. Israel, which primarily uses Pfizer’s mRNA vaccine, launched its COVID-19 vaccine program in late December 2020.\n\n“The weekly emergency call counts were significantly associated with the rates of 1st and 2nd vaccine doses administered to this age group but were not with COVID-19 infection rates,” they found. “While not establishing causal relationships, the findings raise concerns regarding vaccine-induced undetected severe cardiovascular side-effects and underscore the already established causal relationship between vaccines and myocarditis, a frequent cause of unexpected cardiac arrest in young individuals.” Also recent study carried out by Swedish researchers across populations in Finland, Denmark, Sweden, and Norway suggested that heart inflammation requiring hospital care was more common among people who received COVID-19 vaccines than individuals who did not.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "January 16, 2021"}