{"result_id": "050038", "URL": "http://www.biotechexpressmag.com/editorial-what-serious-side-effects-reported-after-inoculation-of-indian-covid-19-vaccines-survey-of-aefi-reports/", "timestamp": "2023-04-25 12:19:21 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://www.biotechexpressmag.com/editorial-what-serious-side-effects-reported-after-inoculation-of-indian-covid-19-vaccines-survey-of-aefi-reports/", "encoding": "UTF-8"}, "image": null, "domain": "www.biotechexpressmag.com", "title": "Editorial: What serious side effects reported after inoculation of Indian COVID-19 vaccines: Survey of AEFI reports", "cleaned_text": "According to the latest news article published on Business Today February 7, 2022, total 70,102 adverse events after vaccination are reported in India in which Covishield comprised 63,315 cases, followed by Covaxin at 6,757 and Sputnik at 30. Out of the total cases a total 1,013 fatalities are reported following the COVID-19 vaccines, 921 were after Covishield, 92 after Covaxin, and Sputnik reported zero such incidents, the Ministry of Health and Family Welfare informed the Parliament.\n\nSo we have seen that Covishield has highest rate of adverse event including number of deaths, but it is also important to note that it is also the most inoculated COVID vaccine in India followed by Covaxin and Sputnik. So what is the purpose of this article? This article will discuss about updates on AEFI system in India and what are the side effects people can face while getting injected by vaccines that were granted permission in emergency mode. We will also see how FDA lost the battle in US court in regard to disclosing of vaccine trial data that it used to get approval of the vaccine but later this data revealed hidden secrets.\n\nThe COVID vaccine inoculation in India was started on Jan 16, 2021. Covishield was first vaccine to get EUA from Drugs Controller General of India (DCGI), it was version of Oxford Astrazeneca vaccine which was produced in India and thus Covaxin was the only vaccine that was produced indigenously. Since Oxford vaccine was approved worldwide SII got the advantage of early inoculation and thus comprises large number of doses as compared to Covaxin, even today Covaxin is assumed to be given to 10% out of total around 185 million doses.\n\nSerious adverse events have fuelled mistrust among public from the start of inoculation not only in India but in US and other countries where many serious adverse events after Pfizer and other vaccines were reported but ignored. Vaccine hesitancy then has become a widespread challenge including in India, particularly in rural areas where 65·5% of the population resides.\n\nSince the vaccines were given approval without making trial data public, many of the experts have always argued about long term effects of vaccine. They also asked to strengthen Adverse event reporting system like the USA having where anyone can make entries to public databases whereas in India these events are fed by concerned department only. The government of India also in its reply said that AEFI reported in developed countries is well established, it is self-reporting of adverse drug reactions and using the internet for reporting AEFI online.\n\nAEFI reporting not sufficient\n\n In comparison to developed countries the adverse event reporting system is not strong enough in India. As reported by TOI on Jul 22, 2021, head of the AEFI committee, Dr N K Arora, asked vaccinators to report all events of concern occurring within 28 days of Covid-19 vaccination. He added that due to low AEFI reporting, the country may be missing some adverse events, which could be of relevance to Indian and foreign regulators as some vaccines in use in the country have also been deployed globally. This implies that Dr Arora was also convinced by the fact that proper reporting of adverse events was not taking place. The national Adverse Effects Following Immunisation (AEFI) committee at the time urged all states to ensure all side-effects after Covid-19 jabs are reported to the CoWIN portal. The committee said there was drastic drop in reporting levels by states.\n\nThe co-convenor of the All India Drug Action Network, Malini Aisola, also said that the current reporting system is extremely weak and unresponsive. She said, “Many people were facing difficulties while reporting AEFI, let alone securing medical support from the vaccination programme, even though there is a provision for medical management in the protocols.” She added that the quality of evidence while investigating AEFI at the local level was very poor with many events being brushed aside as unrelated to vaccination, even before the evidence has been collected. “It revealed poor awareness and training among district-level authorities and committees,” Aisola said, adding that the slow pace of reporting does not serve the purpose. She said it’s also unlikely families of the affected have been informed. “So there is little being done to instil confidence in a system that’s meant to protect patient safety”.\n\nSince the start of vaccination many experts are arguing about pitfalls in existing AEFI reporting system but still health ministry has not taken effective steps to overcome the problem and many people are facing difficulties in reporting adverse events. Experts suspect that many of the adverse events are going unnoticed.\n\nTrial Data not provided by Indian manufacturers and Regulators: FDA is doing for Pfizer after US court order\n\n For more expert scrutiny, to gather more adverse event data from Indian Covid vaccine manufacturers, a petition was filed by Dr. Jacob Puliyel, a former member of the National Technical Advisory Group on Immunisation, challenging vaccine mandates, including those that made vaccination a precondition for accessing any benefits or services. He argued that these mandates were violative of the rights of citizens and unconstitutional.\n\nAfter continuous efforts of Indian Bar Association and Awaken India Movement which challenged covid mandates, in last week of February 2022, Honorable Bombay High court has ended all COVID mandates in state and so did Delhi, U.P and other states (https://timesofindia.indiatimes.com/city/mumbai/train-travel-curbs-removed-hc-now-to-scrutinise-if-covid-fines-were-illegal/articleshow/90672933.cms).\n\n But coming back to adverse event data from vaccine trials, “Covid-19 vaccine makers refuse to disclose data on adverse events” as reported by Financial Express, on March 23, 2022 (https://www.financialexpress.com/lifestyle/health/covid-19-vaccine-makers-refuse-to-disclose-data-on-adverse-events/2468515/).\n\nBharat Biotech and SII told the Supreme Court that such motivated pleas like filed by Dr Puliyal are an attempt to cause vaccine hesitancy and public hysteria in the midst of an unprecedented global pandemic.\n\nBharat Biotech said that it had extensively published the findings of clinical trials for its Covid-19 vaccine in publicly available reputed peer reviewed journals, including its website and Lancet medical journal.\n\nSII, which manufactures Covishield vaccine, also opposed any plea for disclosure, saying as a matter of principle the petitioner cannot ask for data. “My data is with the regulator. That is where it should be. There is no locus for them (petitioner). Even under the RTI, they have to show there is public interest,” it said.\n\nSome experts opposed the statement of Bharat Biotech and SII and said that we have seen how disclosing of Pfizer data is unfolding many secrets, it was done only when US court intervened and ordered probe and FDA is now releasing data of around 4.5 lakh pages. If it can be done in USA then why not in India, if the vaccine data has no problem then why there is a problem for manufacturer to disclose complete data.\n\nIn Pfizer case, a federal judge in Texas ordered the FDA to make public the data it relied on to license Pfizer’s COVID-19 vaccine. The court “concludes that this FOIA request is of paramount public importance to ensure transparency in the process and dispel doubts about the vaccine’s safety.\n\n The petition against Pfizer and FDA was filed by a group that includes more than 200 doctors, scientists, professors and public health professionals, including some who have publicly questioned the efficacy of lockdown policies, mask mandates and the vaccine itself. (https://www.reuters.com/legal/government/paramount-importance-judge-orders-fda-hasten-release-pfizer-vaccine-docs-2022-01-07/)\n\nEarlier, the FDA said it may take until 2096 to release all 451,000 pages it used to approve Pfizer’s vaccine. On this, group members argued that if FDA can review these many pages in two months for approval then why it cannot disclose data within a matter of days. The documents released by the FDA now have been uploaded to the Public Health and Medical Professionals for Transparency website (https://phmpt.org/pfizers-documents/) (also the pages cleared in March) – in total, there are now 150 documents available to view.\n\nAfter MARCH 2022 release, documents by the US FDA reveal that drugmaker Pfizer recorded nearly 160,000 adverse reactions to its COVID-19 vaccine in the initial months of its rollout. The reactions ranged from mild to severe and were 1,223 fatal. More than 25,000 nervous system disturbances have been reported, together with 17,000 musculoskeletal and connective tissue disorders and 14,000 gastrointestinal disorders. A range of Several autoimmune conditions have been reported together with some peculiar diseases, including 270 “Spontaneous abortions”, and accidents of herpes, epilepsy, heart failure and blows, among thousands of others.(https://www.tasnimnews.com/en/news/2021/12/13/2625070/variety-of-vaccine-side-effects-revealed-in-pfizer-documents)\n\nIn a separate report by a Whistle blower Paul D Thacker, he revealed poor practices at a contract research company helping to carry out Pfizer’s pivotal covid-19 vaccine trial. The report published in BMJ “Researcher blows the whistle on data integrity issues in Pfizer’s vaccine trial” raised serious questions about data integrity and regulatory oversight. (BMJ 2021; 375 doi: https://doi.org/10.1136/bmj.n2635, Published 02 November 2021)\n\nSimilarly serious adverse events were also reported in Oxford-Astrazeneca vaccine like thrombocytopenia-associated cerebral venous sinus thrombosis, multiple thrombosis, and bleeding within a short timeframe after receipt of the vaccine but the EMA concluded that “benefits still outweigh the risks despite possible link to rare blood clots with low blood platelets and allowed the vaccination to continue (https://www.ema.europa.eu/en/news/covid-19-vaccine-astrazeneca-benefits-still-outweigh-risks-despite-possible-link-rare-blood-clots).\n\nAdverse events after Indian COVID vaccines\n\n In India too, serious adverse events including deaths are also being recorded after covid vaccination. Since the AEFI reporting is not so strong experts suspect the number of adverse event are much higher. These adverse events can be accessed on the Ministry of Health and Family welfare website – https://main.mohfw.gov.in/Organisation/Departments-of-Health-and-Family-Welfare/immunization/aefi-reports. As on April 19, 2022, 13 documents that recorded only 1099 cases can be found on this webpage which again raised one important question that where is the publicly available data of remaining 69003 adverse events (see the business today news in first line of article). This data lis in the form of Press releases dated between March 5, 2021 to March 21, 2022. Since this was the only data present, the following observations were made using this data only. From this data, the observations made are given in the table 1.\n\nAs per the ministry classification, the AEFI event recorded in the category are shown in Table 1.\n\n It is imperative from the reports that some cases occur where COVID 19 emerged in individuals after injecting covid vaccines, for example as reported in IND(CO-AEFI)PBSAN21004 (covishield) and IND(CO-AEFI)WBDJL21015 (covaxin).\n\nCorbevax, which is a protein-based vaccine manufactured by Biological E, got emergency use authorisation from India’s drug regulator on 21 February 2022 for the age group of 12-18 years.Since past 1 months constant news are coming of side effects and deaths in children after vaccine. It is to note that Dr Jayaprakash Muliyil, member of the National Technical Advisory Group on Immunisation in India (NTAGI) said that there is no need for children to get vaccinated against COVID-19 for now. Given that children and adolescents tend to have milder disease compared to adults, the World Health Organization (WHO) states that unless they are part of a group at “higher risk of severe COVID-19”, it is “less urgent” to vaccinate them.\n\nThe covid vaccine for children was not recommended at all but corbevax has been approved for them Without NTAGI Clearance. It is not available in news that if it has any side effects on children but many news are coming about serious side effects after vaccines in children which include deaths in some instances. Since AEFI is weak, one can hope to see the reports after some time and till then we all can just wait for the casualities to happen if any.\n\nDr Sanjay K Rai, professor of community medicine at AIIMS Delhi also warn about the vaccination in children, he said The risk of vaccine led deaths in children is higher than severity of Covid19” (https://www.youtube.com/watch?v=UVZqjOUcDWY).\n\nOnly two news were identified to be included in the article where vaccine and children deaths were connected. Five petitioners filed a petition before the Supreme Court of India say that they lost their children due to adverse effects after taking COVID vaccination.(https://www.livelaw.in/top-stories/supreme-court-pil-covid-19-vaccination-children-deaths-caused-post-immunisation-189701) and Kin of 2 girls in Madhya Pradesh say they died after Covid vaccine, in both cases, deaths occurred more than 24 hours after vaccine (\n\n http://timesofindia.indiatimes.com/articleshow/88766680.cms?utm_source=contentofinterest&utm_medium=text&utm_campaign=cppst)\n\nA recent news from WHO reported that it has suspended the supply of COVAXIN under the Covax facility, citing manufacturing deficiencies. Bharat Biotech has agreed on the same and has not challenged WHO, in such a situation it is has not become clear that what were the deficiencies and was it safe in long term to take covaxin which was produced all around the year with existing deficiencies and are there any long term side effects of these manufacturing deficiencies.\n\nTable 1: Showing overall adverse events after vaccination, it does not include the number of times the event reported but if it has happened it is written here. (diseases are explained in BOX 1)\n\nNote: Some entries in Table 1 may be missing, For complete information please visit MoHFW, India website.\n\nTable 2: Some Media reports of deaths/injusries after vaccination\n\nBOX: A short introduction to Diseases that appeared after COVID-19 vaccine AEFI, India\n\n Source of diseases information – Mayo Clinic online disease data (https://www.mayoclinic.org/)\n\n1. Anaphylaxis – Anaphylaxis is a severe, potentially life-threatening allergic reaction. It can occur within seconds or minutes of exposure to something you’re allergic to.\n\n 2. Thrombocytopenia – It is a condition in which you have a low blood platelet count.\n\n 3. Gastritis – Inflammation of the lining of the stomach.\n\n 4. Febrile illness – Fever of unknown origin.\n\n 5. Cerebral venous sinus thrombosis – occurs when a blood clot forms in the brain’s venous sinuses. This prevents blood from draining out of the brain. Venous sinus, in human anatomy is any of the channels of a branching complex sinus network that lies between layers of the dura mater, the outermost covering of the brain, and functions to collect oxygen-depleted blood.\n\n 6. Hemorrhagic infarct (HI) can be defined as an ischemic infarct in which an area of bleeding exists within necrosing cerebral tissue i.e. bleeding in brain and death of brain tissue.\n\n 7. Myalgia describes muscle aches and pain, which can involve ligaments, tendons and fascia, the soft tissues that connect muscles, bones and organs.\n\n 8. Angioedema is swelling underneath the skin. It’s usually a reaction to a trigger, such as a medicine or something you’re allergic to. It is not normally serious, but it can be a recurring problem for some people and can very occasionally be life-threatening if it affects breathing.\n\n 9. Vasovagal syncope – occurs when you faint because your body overreacts to certain triggers, such as the sight of blood or extreme emotional distress. It may also be called neurocardiogenic syncope. The vasovagal syncope trigger causes your heart rate and blood pressure to drop suddenly.\n\n 10. Vertigo is a sensation that the environment around you is spinning in circles. It can make you feel dizzy and off-balance.\n\n 11. Acute Transverse Myelitis – Transverse myelitis is an inflammation of both sides of one section of the spinal cord. This neurological disorder often damages the insulating material covering nerve cell fibers (myelin). Transverse myelitis interrupts the messages that the spinal cord nerves send throughout the body. This can cause pain, muscle weakness, paralysis, sensory problems, or bladder and bowel dysfunction.\n\n 12. Guillain-Barre syndrome is a rare disorder in which your body’s immune system attacks your nerves. Weakness and tingling in your extremities are usually the first symptoms. These sensations can quickly spread, eventually paralyzing your whole body.\n\n 13. Facial or Bell’s Palsy- The symptoms of Bell’s palsy include sudden weakness in your facial muscles. In most cases, the weakness is temporary and significantly improves over weeks. The weakness makes half of your face appear to droop. Your smile is one-sided, and your eye on that side resists closing.\n\n 14. Myocarditis is an inflammation of the heart muscle (myocardium). The inflammation can reduce the heart’s ability to pump and cause rapid or irregular heart rhythms (arrhythmias). Infection with a virus usually causes myocarditis.\n\n 15. Seizure is a sudden, uncontrolled electrical disturbance in the brain. It can cause changes in your behavior, movements or feelings, and in levels of consciousness. Having two or more seizures at least 24 hours apart that aren’t brought on by an identifiable cause is generally considered to be epilepsy.\n\n 16. Myocardial Infarction – A heart attack (myocardial infarction) happens when one or more areas of the heart muscle don’t get enough oxygen. This happens when blood flow to the heart muscle is blocked.\n\n 17. Ischemic stroke occurs when a blood clot blocks or narrows an artery leading to the brain. A blood clot often forms in arteries damaged by the buildup of plaques (atherosclerosis). It can occur in the carotid artery of the neck as well as other arteries.\n\n 18. Retinal vein occlusion is a blockage of the small veins that carry blood away from the retina.\n\n 19. Acute disseminated encephalomyelitis (ADEM) is a neurological, immune-mediated disorder in which widespread inflammation of the brain and spinal cord damages tissue known as white matter.\n\n 20. Idiopathic thrombocytopenic purpura is a blood disorder characterized by an abnormal decrease in the number of platelets in the blood.\n\n 21. Focal (Partial) Seizures occur when nerve cells in the brain send out sudden, excessive, uncontrolled electrical signals.\n\n 22. Sensorineural deafness is a type of hearing loss. It occurs from damage to the inner ear, the nerve that runs from the ear to the brain (auditory nerve), or the brain.\n\n 23. Subarachnoid hemorrhage is bleeding in the space between your brain and the surrounding membrane.\n\n 24. Optic neuritis occurs when swelling (inflammation) damages the optic nerve — a bundle of nerve fibers that transmits visual information from your eye to your brain causing vision loss.\n\n 25. Urticaria – Hives are red, itchy raised red bumps that result from a skin reaction. The welts vary in size and appear and fade repeatedly as the reaction runs its course. The condition is considered chronic hives if the welts appear for more than six weeks and recur frequently over months or years.\n\n 26. Neuromyelitis optica (NMO), also known as Devic’s disease, is a rare condition where the immune system damages the spinal cord and the nerves of the eyes (optic nerves).\n\n 27. Deep vein thrombosis (DVT) occurs when a blood clot (thrombus) forms in one or more of the deep veins in your body, usually in your legs.\n\n 28. Unstable angina is a condition in which your heart doesn’t get enough blood flow and oxygen. It may lead to a heart attack. Angina is a type of chest discomfort caused by poor blood flow through the blood vessels (coronary vessels) of the heart muscle (myocardium).\n\n 29. Pulmonary edema is a condition caused by excess fluid in the lungs. This fluid collects in the numerous air sacs in the lungs, making it difficult to breathe.\n\n 30. Arthralgia is a term used to describe aching or pain in one or more of the joints in the body.\n\nConclusion\n\n It is discussed here that the AEFI reporting system is not comparable to western systems and the entries are made by healthcare personal or concerned staff only, this left many adverse event unreported. Also the adverse events in trial data should be available in public domain so that people can take informed decision more cautiously as the vaccines have serious side effects including unexplained deaths and sudden cardiac arrests, most of the side effects after covishield have clot related diagnosis. Like Pfizer the data can be made public in India too for more transparency. Covishield vaccine has more and serious side effects as compared to covaxin, but it needs more data to make any conclusion in this regard because the number of covaxin doses administered as compared to covishield are very less. Further, In light of above discussion states should curb vaccine mandates and decision about vaccination of children should be seen more cautiously.\n\nTo Read full article Subscribe this issue from here: https://www.biotechexpressmag.com/subscription/", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.indiatvnews.com/news/india/bihar-woman-dies-after-taking-second-dose-of-covid-vaccine-745937", "https://www.deccanherald.com/state/top-karnataka-stories/man-dies-nine-days-after-receiving-covishield-vaccine-in-karnataka-953127.html", "https://www.deccanherald.com/state/top-karnataka-stories/man-dies-nine-days-after-receiving-covishield-vaccine-in-karnataka-953127.html", "https://www.newindianexpress.com/states/tamil-nadu/2022/mar/09/tn-girl-loses-vision-days-after-covid-vaccine-parents-seek-govt-aid-for-treatment-2427949.html", "https://www.livelaw.in/news-updates/19-year-old-dies-post-covishield-vaccination-kerala-high-court-seeks-centres-response-on-parents-plea-196742", "https://www.aninews.in/news/national/general-news/12-children-fainted-due-to-fear-after-receiving-covid-19-vaccine-in-mps-satna-says-health-official20220325230808/", "https://www.freepressjournal.in/indore/madhya-pradesh-family-of-school-girls-claim-duo-dies-after-covid-19-vaccination-admin-orders-probe", "https://www.livelaw.in/news-updates/bombay-high-court-covid-19-vaccine-death-due-to-side-effect-1-crore-compensation-190899", "https://www.hindustantimes.com/cities/delhi-news/6-of-7-kids-who-died-of-covid-in-delhi-from-jan-9-12-had-comorbidities-101642186989888.html"], "authors": [], "publish_date": "2022-04-25T06:13:12+00:00"}