{"result_id": "050008", "URL": "http://www.biotechexpressmag.com/clotting-risks-cause-fda-to-restrict-use-of-jj-covid-vaccine/", "timestamp": "2023-04-25 12:18:43 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://www.biotechexpressmag.com/clotting-risks-cause-fda-to-restrict-use-of-jj-covid-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "www.biotechexpressmag.com", "title": "Clotting Risks Cause FDA to Restrict Use of J&J COVID Vaccine – Biotech Express Magazine", "cleaned_text": "Janssen (Johnson & Johnson ‘s) COVID-19 vaccine is now limited to certain individuals ages 18 and up after the U.S. Food and Drug Administration downgraded its emergency use authorization (EUA).\n\n The regulator’s decision came after finding that some people develop a greater risk of thrombosis with thrombocytopenia syndrome, a rare and possibly life-threatening blood clotting disorder. People with TTS have low blood platelet counts and the onset of symptoms happens around one to two weeks after receiving Janssen’s COVID-19 vaccine.\n\nThe FDA has already updated the Fact Sheet for Healthcare Providers Administering Vaccine to reflect this change, including a warning statement at the beginning of the guideline to highlight the risk for TTS. The Fact Sheet for Recipients and Caregivers has been revised as well.\n\nThe FDA approved Janssen›s COVID-19 vaccine for emergency use in February 2021 but then paused its use in April when the Centers for Disease Control and Prevention (CDC) started investigating six cases of TTS post-vaccine.\n\nApproximately two weeks after the pause, the CDC’s advisory committee and the FDA lifted the directive but confirmed that there had been 15 TTS cases reported, including the first six mentioned, out of about 8 million doses given. The health agencies then said that the benefits of Janssen’s vaccine outweigh the risks for those 18 and older. However, in December 2021, the CDC’s Advisory Committee on Immunization Practices recommended preferential use of the Janssen product in individuals ages 18 years and up in the U.S.\n\nThe ACIP noted that the Janssen vaccine may be considered in certain situations, such as if the person is contraindicated to receive mRNA vaccines, if the person would remain unvaccinated because of limited access to mRNA vaccines, and if the person voluntarily chooses to receive the Janssen product despite the identified safety concerns. The directive also applies to booster doses.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "January 16, 2021"}