{"result_id": "050002", "URL": "http://www.biotechexpressmag.com/experts-write-to-pm-against-wto-proposal-on-covid-19-vaccine-waivers/", "timestamp": "2023-04-25 12:18:35 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://www.biotechexpressmag.com/experts-write-to-pm-against-wto-proposal-on-covid-19-vaccine-waivers/", "encoding": "UTF-8"}, "image": null, "domain": "www.biotechexpressmag.com", "title": "Experts write to PM against WTO proposal on COVID-19 vaccine waivers – Biotech Express Magazine", "cleaned_text": "Six experts from India, South Africa and the United States have written to Prime Minister Narendra Modi to reject the current version of a proposal at the World Trade Organisation on intellectual property waivers for COVID-19 medicines, that includes vaccines, drugs and diagnostics.\n\nIn October 2020, at the WTO’s Trade Related Aspects of Intellectual Property Rights (TRIPS) Council, India and South Africa proposed that the WTO do away with certain provisions of the TRIPS Agreement for the duration of the pandemic to facilitate access to technologies necessary for the production of vaccines and medicines. Such a waiver would aid scaling up of local production, critical to ensure wider access to affordable and effective vaccines. Most of these patents are held by pharmaceutical companies in the U.S. and the European Union.\n\nThe waiver proposal was blocked at the TRIPS Council and the WTO ministerial Council, though there have been several rounds of discussions involving ministers of several WTO member-countries. In the last year, though 100 countries, including the U.S., supported the proposal, the EU remained a stumbling block. Last month, however, a leaked document that suggested a compromise between the EU, U.S., India and South started doing the rounds. This said that all patent rights that protect the manufacturing of COVID-19 vaccines will be waived for three to five years, but did not include such waivers for diagnostics and drugs.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "January 16, 2021"}