{"result_id": "050013", "URL": "http://www.biotechexpressmag.com/maker-of-dolo-650-pandemics-magic-pill-faces-income-tax-searches-and-pil-petitions/", "timestamp": "2023-04-25 12:18:50 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://www.biotechexpressmag.com/maker-of-dolo-650-pandemics-magic-pill-faces-income-tax-searches-and-pil-petitions/", "encoding": "UTF-8"}, "image": null, "domain": "www.biotechexpressmag.com", "title": "Maker of Dolo-650, pandemic’s ‘magic pill’, faces income tax searches and PIL petitions", "cleaned_text": "Nicknamed “COVID-pandemic’s favourite snack” and the source of multiple social media memes, Dolo-650 mg, which registered a sales of over ₹500 crores during the COVID pandemic since March 2020, is back in the news following the public interest litigation in Supreme Court by the Federation of Medical and Sales Representatives Association of India (FMRAI), a national trade union, that sought enforcement of Right to Life under Article 21 of the Constitution.\n\nIn its petition, FMRAI has alleged mounting instances of unethical marketing practices by pharma companies in their dealings with healthcare professionals, which in turn has a negative effect on the health of those who are already unwell.\n\nThe advocate explained that government price control is applicable till 500 mg of the paracetamol salt. “The idea of Dolo-650 and freebie caught on because it is so widely used especially during COVID. Also it was in the news in July,’’ she added.\n\nDolo-650 is one brand of paracetamol, also known as acetaminophen, and used to treat fever and mild to moderate pain. It is manufactured by Micro Labs Ltd. and is no different from other brands like Crocin, Calpol, Pacimol etc. However, unlike Dolo-650 mg, most other brands sell their paracetamol brand with 500 mg salt. Data from IQVIA also show that Dolo-650 and Calpol (manufactured by GSK Pharmaceuticals) are the key brands driving the paracetamol segment.\n\nThe Central Board of Direct Taxes (CBDT), the administrative body for the I-T department, in July had accused the makers of the widely-used Dolo-650 tablet of indulging in “unethical practices” and distributing freebies of about ₹1,000 crore to doctors and medical professionals in exchange for promoting its products.\n\nThe Income Tax department had on July 6 raided 36 premises of Bengaluru-based Micro Labs Ltd. across nine states.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2022-08-20T09:57:32+00:00"}