{"result_id": "050039", "URL": "http://www.biotechexpressmag.com/no-one-can-be-forced-to-get-vaccinated-supreme-court-of-indias-big-order/", "timestamp": "2023-04-25 12:19:22 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://www.biotechexpressmag.com/no-one-can-be-forced-to-get-vaccinated-supreme-court-of-indias-big-order/", "encoding": "UTF-8"}, "image": null, "domain": "www.biotechexpressmag.com", "title": "No One Can Be Forced To Get Vaccinated”: Supreme Court of India’s Big Order", "cleaned_text": "No one can be forced to take the vaccine, the Supreme Court said in a landmark decision on India’s Covid vaccine policy, also directing the central government to publish reports on the adverse effects of vaccination.\n\n“Bodily integrity is protected under the law and nobody can be forced to be vaccinated,” the Supreme Court said. The court asserted, however, that “certain limitations on individual rights” could be imposed in the interest of community health. “Barring Covid-appropriate behaviour, we suggest no curbs on unvaccinated individuals in access to public places, services and resources if cases are low,” the Supreme Court said.\n\nRestrictions imposed on individuals through vaccine mandates cannot be called to be proportionate, the court said – a reference to many states making it essential for people to get the Covid shot to access public places. “Till infection numbers are low we suggest that no restriction is imposed on individuals on access to public places, services and resources. Recall the same if already done,” the Supreme Court ordered. Supreme Court Justices LN Rao and BR Gavai added that their directives did not extend to Covid-appropriate behaviour, but was limited to vaccines in the “rapidly evolving situation”.\n\nThe Supreme Court also directed the Centre to publish reports on adverse events of vaccines from people and doctors on a publicly accessible system, without compromising the details of the individuals reporting them.\n\n“Regarding segregation of vaccine trial data, subject to the privacy of individuals, all trials already conducted and to be subsequently conducted, all data must be made available to the public without further delay,” the court said. “Regarding vaccine for children, it is not possible for us to second guess the opinion of experts and the vaccination indeed follows the global standards and practices. However, data of adverse reactions should be published at the earliest.”\n\nA petition by Jacob Puliyel, a former member of the National Technical Advisory Group on Immunisation (NTAGI), had argued that states mandating vaccination for accessing benefits or services is a violation of citizens’ rights, and therefore, unconstitutional. Many states, said the petition, had made vaccines necessary for state government employees, for travel in public transport and to access subsidised food grains.\n\nThe petition called for clinical trial data of Covid vaccines to be made public and alleged that vaccines being administered had not been adequately tested for safety or efficacy and were licensed under emergency use authorisation without trial data being disclosed to the public.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2022-05-02T05:47:00+00:00"}