{"result_id": "050017", "URL": "http://www.biotechexpressmag.com/moderna-and-pfizer-lawsuits-and-charitable-giving/", "timestamp": "2023-04-25 12:18:55 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://www.biotechexpressmag.com/moderna-and-pfizer-lawsuits-and-charitable-giving/", "encoding": "UTF-8"}, "image": null, "domain": "www.biotechexpressmag.com", "title": "Moderna and Pfizer: Lawsuits and Charitable Giving – Biotech Express Magazine", "cleaned_text": "Moderna told a Delaware federal court that it was immune from patent-infringement charges over the COVID-19 vaccine because it supplied the vaccine for a U.S. government effort. Alnylam Pharmaceuticals Inc is required under a longstanding federal law to sue the government directly over shots used in its nationwide vaccination effort, Moderna said in a motion to dismiss the lawsuit. Cambridge, Massachusetts-based Alnylam sued Moderna and Pfizer Inc in Delaware in March, seeking royalties for the lipid nanoparticle (LNP) technology their vaccines use to deliver genetic material known as mRNA.\n\nModerna made a motion for the courts to dismiss patent challenges filed by Genevant Sciences and Arbutus Biopharma. In a statement, Moderna said, “The claims brought by Genevant and Arbutus are unfounded because Moderna’s COVID-19 vaccine does not infringe any valid patents.” In a filing, Moderna sought to have the lawsuits dismissed claiming the two companies “have sued the wrong party in the wrong court.” Genevant indicates it will object to Moderna’s motion to dismiss. The Wall Street Journal reported that Genevant said, “Rather than respond to the substance of our claims, Moderna is trying to shift responsibility for its patent infringement to the U.S. taxpayer.”\n\nThey also battled a patent challenge from the National Institutes of Health (NIH), who claimed they should be co-patent owners of the mRNA COVID-19 vaccine because of their involvement in its RNA sequence. This involves a different component of the vaccine than the claims made by Genevant and Arbutus. Moderna argued that it recognized the “substantial role” that the NIH’s National Institute of Allergy and Infectious Diseases (NIAID) scientists played in developing the vaccine and those contributions are highly valued. However, Moderna did not agree that NIAID researchers co-invented the mRNA sequence of the vaccine. They argued they had picked the mRNA sequence without the input of government scientists “who were not even aware of the mRNA sequence until after the patent application had been filed.”\n\nModerna, which currently has no other product on the market, brought in $17.1 billion in vaccine sales in 2021.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "January 16, 2021"}