{"result_id": "050045", "URL": "http://www.biotechexpressmag.com/19-year-old-allegedly-dies-post-covishield-vaccination-kerala-high-court-seeks-centres-response-on-parents-plea/", "timestamp": "2023-04-25 12:19:30 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://www.biotechexpressmag.com/19-year-old-allegedly-dies-post-covishield-vaccination-kerala-high-court-seeks-centres-response-on-parents-plea/", "encoding": "UTF-8"}, "image": null, "domain": "www.biotechexpressmag.com", "title": "19 Year Old Allegedly Dies Post Covishield Vaccination: Kerala High Court Seeks Centre’s Response On Parents’ Plea", "cleaned_text": "The petitioners’ daughter, a postgraduate student, was vaccinated with Covishield on July 28, 2021. Since she started feeling unwell the very next day, on August 5, she was taken to a hospital where an antigen test was taken. But the test result came out to be negative. Therefore, she was given symptomatic treatment for her headache and fever, treated in casualty and was discharged on the same day.\n\nHowever, her condition worsened soon and was thereafter taken to another hospital with complaints of reduced responsiveness, tiredness, headache and a history of vomiting. While at the hospital, she remained unconscious and later developed generalised convulsion. Thereafter, she was intubated and put on a ventilator.\n\nThe petitioners’ daughter expired on August 12 morning, and her cause of death mentioned in post mortem report was that she died of intracranial bleeding.\n\nHer grieving parents filed a complaint before the Human Rights Commission claiming compensation for the same and based on this complaint, an enquiry was conducted by the District Medical Officer (Health). It was found that there was no available documentary evidence to suggest that she had any preceding neurological illness and the enquiry confirmed that her symptoms started after she had taken the first dose of the Covishield vaccine.\n\nThe Medical Officer also recorded his finding that upon verification of her hospital records, it was evident that she might have suffered from thrombocytopenia and thrombosis syndrome which is a rare immunogenic response to the Covishield vaccine.\n\nTherefore, the plea moved through Advocates C. Unnikrishnan and M.R Sudheendran argued that the death of the petitioners’ only daughter is a direct aftereffect of the administration of the Covishield vaccine.\n\nThey asserted that vaccination was made compulsory by the Union and State so the deceased had no choice but to book a slot on Cowin.gov.in. It was also argued that the vaccine was administered to the deceased from the hospital without any communication as to the risk factors of the vaccine.\n\nThe parents have also pointed out that although their daughter was taken to the respondent Hospital on 6th August, she was given only symptomatic treatment and that there was no proper diagnosis as to the illness and appropriate timely treatment.\n\nTherefore, it has been submitted that the manufacturer of the vaccine, the Union and the State are jointly and severally liable to compensate the petitioners.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2022-04-15T07:20:22+00:00"}