{"result_id": "050024", "URL": "http://www.biotechexpressmag.com/killer-music-can-sound-make-a-clot-in-a-boy-who-died-while-dancing-or-it-is-related-to-covid-vaccination/", "timestamp": "2023-04-25 12:19:03 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://www.biotechexpressmag.com/killer-music-can-sound-make-a-clot-in-a-boy-who-died-while-dancing-or-it-is-related-to-covid-vaccination/", "encoding": "UTF-8"}, "image": null, "domain": "www.biotechexpressmag.com", "title": "Killer Music? Can sound make a clot in a boy who died while dancing or it is related to COVID vaccination – Biotech Express Magazine", "cleaned_text": "Sound is used to burst clots according to several studies and this is contrary to the statement made by Ujjain doctor who said that sound has made blood clot and ultimately death. The news raise further questions that the covid vaccination status was taken into consideration while doing autopsy and whether vaccine has role to play in this.\n\nAn 18-year-old boy dancing at his friend’s wedding suddenly collapsed and died. A doctor claims that loud music played by the DJ led to the fatality.\n\nIt is widely acknowledged that noise pollution has adverse health effects, but can it actually kill? The question begs to be asked after a teen dancing to loud music at a baraat (wedding procession) suddenly collapsed and died. Lal Singh, 18, a resident of Ambodia in Madhya Pradesh’s Ujjain district, had travelled to Tajpur to attend a friend’s wedding.\n\nHowever, tragedy struck in the midst of celebrations when, without warning, Lal Singh lost consciousness and fell down. He was first rushed to a nearby hospital, which referred him to another hospital in Ujjain. When he reached the Ujjain hospital, doctors declared him dead on arrival.\n\nA post mortem revealed that there was a blood clot in the 18-year-old boy’s heart. According to Dr Jitendra Sharma, who works at the Ujjain hospital, the clot occurred because of the loud music played by the DJ during the wedding procession.\n\nDr Jitendra Sharma claimed that when loud music is played by the DJ or from any other big sound system, it can trigger abnormal physiological reactions in the body. Sounds that exceed a certain level of decibels can be harmful for humans and effect internal organs like the heart and the brain, he said.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "January 16, 2021"}