{"result_id": "050044", "URL": "http://www.biotechexpressmag.com/long-term-effectiveness-after-moderna-covid-vaccine-is-still-a-mystery/", "timestamp": "2023-04-25 12:19:29 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://www.biotechexpressmag.com/long-term-effectiveness-after-moderna-covid-vaccine-is-still-a-mystery/", "encoding": "UTF-8"}, "image": null, "domain": "www.biotechexpressmag.com", "title": "Long-Term Effectiveness after Moderna COVID vaccine is still a mystery – Biotech Express Magazine", "cleaned_text": "Italy’s National Health Institute reported that efficacy remained stable seven months after the second mRNA COVID-19 vaccine. They evaluated data up to August 29 from more than 29 million people who had received two doses of either the Pfizer-BioNTech or Moderna vaccines. They found that effectiveness against infection after seven months was still 89% in the general population and at six months 96% against hospitalization, and 99% against death.\n\nThis is markedly different from a study run by Pfizer and published on October 4 in the journal The Lancet. In that study, the Pfizer-BioNTech vaccine infection prevention levels dropped from 88% to 47% six months after the second dose.\n\n In seeming contrast to the Italian study, two real-world studies published in the New England Journal of Medicine, found that immunity from infection from the Pfizer-BioNTech vaccine dropped quickly after two shots. One study was out of Israel and the other out of Qatar. The Israeli study analyzed 4,800 health care workers and demonstrated that antibody levels decreased quickly “especially among men, among persons 65 years of age or older, and among persons with immunosuppression.”\n\nThe study from Qatar evaluated actual infections in the country’s population. Like Israel, they were primarily vaccinated with the Pfizer-BioNTech vaccine, BNT162b2.\n\n“BNT162b2-induced protection against infection builds rapidly after the first dose, peaks in the first month after the second dose, and then gradually wanes in subsequent months,” Laith Abu-Raddad of Weill Cornell Medicine-Qatar and colleagues wrote. “The waning appears to accelerate after the fourth month, to reach a low level of approximately 20% in subsequent months.”", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "January 16, 2021"}