{"result_id": "051016", "URL": "https://www.blacklistednews.com/article/84053/bill-gates-secured-hundreds-of-millions-in-profits-from-mrna-stock-sales-before-suddenly-changing.html", "timestamp": "2023-04-25 12:19:42 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.blacklistednews.com/images/tabicon.ico", "canonical": "https://www.blacklistednews.com/article/84053/bill-gates-secured-hundreds-of-millions-in-profits-from-mrna-stock-sales-before-suddenly-changing.html", "encoding": "utf-8"}, "image": null, "domain": "www.blacklistednews.com", "title": "Bill Gates secured hundreds of millions in profits from mRNA stock sales before suddenly changing tune on vaccine technology", "cleaned_text": "As you can see below, Gates just so happened to time the market perfectly, selling the shares during BioNtech’s best performing quarter.\n\nIn September of 2019, just months before Covid hysteria made its way through the world, The Gates Foundation secured its shares in the Pfizer vaccine partner through a pre-IPO equity deal with an agreed upon purchase price of $18.10 per share. With an average sale price of around $300 per share in Q3 of 2021, this means that the Gates Foundation banked roughly $260 million in cash from the sale, with $242 million being untaxed profit, given that the money was invested through the foundation. And that doesn’t account for the additional 2 million shares that the Gates Foundation sold prior to that from its original pre-IPO equity investment. In the Q3 2021 sale, the Gates Foundation secured a return of over 15 times more than its initial investment.\n\nOver the next quarter, Gates unloaded 1.4 million shares of Curevac, another Germany-based mRNA company that has partnered with several mRNA shot manufacturers, banking an estimated $50 million.\n\nAfter selling his mRNA company shares, Gates changed his tune on the tech behind the “miracle cure.” Gates, who once claimed that vaccination with mRNA shots had a preventive effect and “helps your heart,” began to criticize the experimental injections.\n\nIn November of 2021, Gates, after dumping 86 percent of his BioNTech bag, shockingly declared that “we need a new way of doing the vaccines.”\n\n\"We didn't have vaccines that block transmission,\" Gates said, contradicting all of his previous interviews in which he continuously claimed the shots were safe and significantly block transmission. \"We got vaccines that help you with your health, but they only slightly reduce the transmission,” he added.\n\nAnd last week, Gates amped up his doubtful rhetoric about mRNA, continuing to distance himself from the once hyped technology that he used to secure hundreds of millions of dollars in pandemic profits.\n\n“We also need to fix the three problems of [mRNA] vaccines,” Gates said in an interview with an Australian think tank. “The current vaccines are not infection blocking. They’re not broad, so when new variants come up you lose protection, and they have very short duration, particularly in the people who matter, which are old people.”\n\nBill Gates has never publicly commented, as far as The Dossier is aware, on his BioNTech cash out.", "opengraph": {"image": "https://substackcdn.com/image/fetch/w_1200,h_600,c_limit,f_jpg,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd99b8f11-48cf-4fed-a74f-4aa166efbc79_1200x800.jpeg"}, "tags": ["Motherboard"], "tweets": [], "movies": [], "links": ["https://www.sec.gov/Archives/edgar/data/1776985/000119312519241112/d635330dex1037.htm", "https://twitter.com/KanekoaTheGreat/status/1610380950768345088?s=20&t=qfDGQns2bseDVkRMcRCu7A", "https://news.sky.com/story/covid-19-scientists-say-vaccines-slash-infection-as-bill-gates-insists-the-end-to-the-pandemic-will-come-12284080"], "authors": [], "publish_date": null}