{"result_id": "051026", "URL": "https://www.blacklistednews.com/article/84528/how-a-former-cia-fellow-came-to-lead-us-government-efforts-to-stamp-out-disfavored-speech-on-the.html", "timestamp": "2023-04-25 12:19:46 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.blacklistednews.com/images/tabicon.ico", "canonical": "https://www.blacklistednews.com/article/84528/how-a-former-cia-fellow-came-to-lead-us-government-efforts-to-stamp-out-disfavored-speech-on-the.html", "encoding": "utf-8"}, "image": null, "domain": "www.blacklistednews.com", "title": "How a former CIA fellow came to lead US government efforts to stamp out disfavored speech on the Internet", "cleaned_text": "Since the 2016 elections, politicians, journalists, and many others have raised the alarm about “foreign election influence” and “disinformation,” demanding greater “content moderation” by social media platforms. It is too easy, they argued, for foreign and malign actors to quickly “go viral” at low cost, leaving the good guys unable to correct bad information. We must become more “resilient” to disinformation.\n\nIt’s now clear that all of that rhetoric was cover for a sweeping censorship effort by the federal government and government contractors.\n\nSince December, a small but growing group of journalists, analysts, and researchers have documented the rise of a “Censorship Industrial Complex”, a network of U.S. government agencies, and government-funded think tanks. Over the last six years, these entities have coordinated their efforts to both spread disinformation and to censor journalists, politicians, and ordinary Americans. They have done so directly and indirectly, including by playing good cop/bad cop with Twitter and Facebook. Hundreds and perhaps thousands of people have been involved in these censorship and disinformation campaigns in the U.S., Canada, and the UK.\n\nWe now know, thanks to the Twitter Files, emails released by the Attorney Generals of Missouri and Louisiana, and research by others, that the Censorship Industrial Complex is violating the First Amendment by coordinating with government agencies and receiving government funding to pressure and help social media companies to both censor information, including accurate information, while spreading disinformation, including conspiracy theories.\n\nAnd such efforts are continuing if not accelerating. At Biden’s “Summit for Democracy” last week, US allies in Europe demanded that Facebook censor “false narratives” and news that would “weaken our support to Ukraine.” Facebook agreed.\n\nOne of the most intelligent, influential, and fascinating public-facing leaders of the Censorship Industrial Complex is Renee DiResta, Research Manager of the Stanford Internet Observatory. Diresta has, more than anyone else, made the public case for greater government-led and government-funded censorship, writing for The New York Times, The Atlantic, Wired, and other major publications, and through public speaking, including on podcasts with Joe Rogan and Sam Harris.\n\nTo many journalists and policymakers, DiResta is one of the good guys, advocating as a citizen and hobbyist for greater U.S. government action to fight disinformation. DiResta has argued that the U.S. has been unprepared to fight the “information war” with Russia and other nations in her bylined articles for the New York Times, Washington Post, Wired, and many others. And in her 2018 Senate testimony DiResta advocated “legislation that defines and criminalizes foreign propaganda” and for allowing law enforcement to “prosecute foreign propaganda.”\n\nDiResta, as much as any other public person in the Western world, has sounded the alarm, repeatedly and loudly, for stronger governmental and non-governmental coordination to get social media platforms to censor more information. “The Russian disinformation operations that affected the 2016 United States presidential election are by no means over,” wrote DiResta in the New York Times in December 2018. “Russian interference through social media is a chronic, widespread, and identifiable condition that we must now aggressively manage.”\n\nIn 2021, DiResta advocated for creating a government censorship center, which she euphemistically referred to as a “Center of Excellence,” within the federal government. “Creation of a ‘Center of Excellence’ within the federal government,” she said, “could tie in a federal lead with platforms, academics, and nonprofits to stay ahead of these emerging narratives and trends.” DiResta argued that her censorship center could also help spread propaganda. “As narratives emerge,” she explained, “the Center of Excellence could deploy experts to relevant federal agencies to help prepare pre-bunking and messaging, to identify trusted voices in communities, and to build coalitions to respond.”\n\nDid the Department of Homeland Security act on DiResta’s proposal to create a censorship center? It did. But DHS didn’t call it a “Center of Excellence.” Instead, it called it a “Disinformation Governance Board,” which the agency announced publicly in April 2022.\n\nDiResta’s rise to the highest levels of the U.S. intelligence community struck me back in December of last year as improbably meteoric. DiResta had repeatedly described her involvement in fighting disinformation as having started in 2013 when she became a new mom and grew concerned about spreading anti-vaccine information online. “In 2013,” she explained to Kara Swisher, “I had my first kid… You know, you have to do that preschool thing here, you’ve got to get them on a list a year early. I didn’t want to be in a preschool with a bunch of anti-vaxxers, candidly.” Two years later she was helping to fight ISIS online and by 2018 she was testifying before the U.S. Senate Intelligence Committee.\n\nWhile these suspicions nagged at me, I waved them away because DiResta is brilliant, was already working in high tech, and was succeeding in the new field of fighting foreign disinformation on social media platforms. Of all the people in various government agencies and government-funded think tanks making the case for U.S. government censorship, DiResta is, by far, the most persuasive. She received a degree in computer science in 2004, worked as a trader at Jane Street until 2011, was a high-tech VC until 2014, and founded a cloud-based shipping management software company that was acquired in 2021.\n\nAnd, given the historical dominance of high tech by founders in their 20s and 30s, and the challenges of older people to understand social media, I convinced myself that a person with DiResta’s limited experience battling disinformation online might leapfrog over the hundreds if not thousands of researchers, analysts, and intelligence experts who conduct research and combat foreign disinformation for the U.S. government and government-funded think tanks and academic institutions.\n\nBut then I learned that DiResta had worked for the Central Intelligence Agency (CIA). The journalist Matt Taibbi pointed me to the investigative research into the censorship industry by Mike Benz, a former State Department official in charge of cybersecurity. Benz had discovered a little-viewed video of her supervisor at the Stanford Internet Observatory, Alex Stamos, mentioning in an off-hand way that DiResta had previously “worked for the CIA.”\n\nIn her response to my criticism of her on Joe Rogan, DiResta acknowledged but then waved away her CIA connection. “My purported secret-agent double life was an undergraduate student fellowship at CIA, ending in 2004 — years prior to Twitter’s founding,” she wrote. “I’ve had no affiliation since.”\n\nBut DiResta’s acknowledgment of her connection to the CIA is significant, if only because she hid it for so long. DiResta’s LinkedIn includes her undergraduate education at Stony Brook University, graduating in 2004, and her job as a trader at Jane Street from October 2004 to May 2011, but does not mention her time at the CIA.\n\nAnd, notably, the CIA describes its fellowships as covering precisely the issues in which DiResta is an expert. “As an Intelligence Analyst Intern for CIA, you will work on teams alongside full-time analysts, studying and evaluating information from all available sources—classified and unclassified—and then analyzing it to provide timely and objective assessments to customers such as the President, National Security Council, and other U.S. policymakers.”\n\nUnlike DiResta, Stamos didn’t appear to believe that DiResta’s time working for the CIA was too trivial, or too far in the past, to bother mentioning. When Stamos introduced DiResta to a Stanford audience, he described her as having “worked for,” not merely “interned” with, the CIA.\n\nIs DiResta telling the truth when she claims she’s had “no affiliation since”? Perhaps. But one of the things I have heard from multiple people, including people within the intelligence community, is, “Nobody ever retires from the intelligence community.” Such a claim is, no doubt, exaggerated. But there is truth to it. Moreover, one of the main characteristics of spycraft is the deployment of agents and assets not publicly affiliated with the CIA or other intelligence agencies.\n\nA large amount of CIA involvement in content moderation requests was discovered through Twitter Files. “CIA officials attended at least one conference with Twitter in the summer of 2020,” writes Taibbi, “and companies like Twitter and Facebook received ‘OGA [Other Government Agencies, which is code for CIA] briefings,’ at their regular ‘industry meetings held in conjunction with the FBI and the Department of Homeland Security.\n\nAnd it is striking how many former CIA Directors are involved in the censorship industry. Seven former CIA chiefs are on the board of The Atlantic Council, the organization that partnered with DiResta’s Stanford Internet Observatory on the Election Integrity Partnership and Virality Project. The Chief Strategy Officer and the Director of Federal Programs at Graphika, another DiResta partner organization, are former CIA officials.\n\nWhatever DiResta’s true history and continuing affiliations, she is without question one of the most, if not the most, influential leaders within the network of for-profit and nonprofit organizations and government agencies that comprise the Censorship-Industrial Complex. As research director of Stanford Internet Observatory, DiResta was the key leader and spokesperson of both the 2021 “Virality Project,” against covid vaccine “misinformation” and the 2020 “Election Integrity Project.”\n\nThe question now is why. If we hope to defund and dismantle the Censorship Industrial Complex, we must understand what makes its leaders tick, why they rose to the top, and how they can be defeated. Who is Renee DiResta, and why is she, and not somebody else, the public-facing leader of the censorship industry and a trusted advisor to Democrats in Congress? Why is she doing it? And what will it take to defund the Stanford Internet Observatory, dismantle the censorship industry, and disempower DiResta?\n\nTo answer those questions, we first need to understand how DiResta got away with and was even rewarded for participating in one of the most outrageous and likely illegal, election disinformation campaigns in recent history.", "opengraph": {"image": "https://substackcdn.com/image/fetch/w_1200,h_600,c_limit,f_jpg,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F5d2a9e55-059a-4333-a713-82594fc0c4be_1600x900.jpeg"}, "tags": ["Motherboard"], "tweets": [], "movies": [], "links": ["https://www.tabletmag.com/sections/news/articles/guide-understanding-hoax-century-thirteen-ways-looking-disinformation", "https://www.racket.news/p/capsule-summaries-of-all-twitter", "https://www.tabletmag.com/sections/news/articles/guide-understanding-hoax-century-thirteen-ways-looking-disinformation", "https://www.discoursemagazine.com/culture-and-society/2023/03/30/disinformation-is-the-word-i-use-when-i-want-you-to-shut-up/", "https://www.foundationforfreedomonline.com/", "https://censorshipindustrialcomplex.org/", "https://www.politico.com/news/2022/09/08/white-house-renews-call-to-remove-section-230-liability-shield-00055771", "https://www.racket.news/p/capsule-summaries-of-all-twitter", "https://public.substack.com/p/under-white-house-pressure-facebook", "https://www.foundationforfreedomonline.com/", "https://www.nytimes.com/live/2023/03/29/world/russia-ukraine-news?smid=nytcore-ios-share&referringSource=articleShare#ukraine-disinformation-eu-social-media", "http://www.reneediresta.com/", "https://www.intelligence.senate.gov/sites/default/files/documents/os-rdiresta-080118.pdf?utm_campaign=The%20Interface&utm_medium=email&utm_source=Revue%20newsletter", "https://www.youtube.com/watch?v=yNe4MJ351wU&t=2s", "https://apnews.com/article/russia-ukraine-immigration-media-europe-misinformation-4e873389889bb1d9e2ad8659d9975e9d", "https://www.vox.com/2018/7/14/17566188/transcript-data-for-democracy-policy-head-renee-diresta-answers-disinformation-too-embarrassed", "https://www.intelligence.senate.gov/sites/default/files/hearings/CHRG-115shrg30959.pdf", "https://www.foundationforfreedomonline.com/", "https://www.youtube.com/watch?v=ESR9k0BtmXY", "https://reneediresta.substack.com/p/fiction-vs-reality-my-texts-with", "https://reneediresta.substack.com/p/fiction-vs-reality-my-texts-with", "https://www.linkedin.com/in/reneediresta/details/experience/", "https://www.cia.gov/careers/jobs/directorate-of-analysis-fellowship-program/", "https://twitter.com/mtaibbi/status/1606701397109796866", "https://judiciary.house.gov/sites/evo-subsites/republicans-judiciary.house.gov/files/evo-media-document/shellenberger-testimony.pdf", "https://judiciary.house.gov/sites/evo-subsites/republicans-judiciary.house.gov/files/evo-media-document/shellenberger-testimony.pdf", "https://twitter.com/mtaibbi/status/1636729166631432195", "https://public.substack.com/p/why-renee-diresta-leads-the-censorship?utm_source=substack&utm_campaign=post_embed&utm_medium=web"], "authors": [], "publish_date": null}