{"result_id": "051009", "URL": "https://www.blacklistednews.com/article/80663/pfizer-jab-receives-full-approval-from-fda-pentagon-mandates-vaccinations-for-all.html", "timestamp": "2023-04-25 12:19:39 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.blacklistednews.com/images/tabicon.ico", "canonical": "https://www.blacklistednews.com/article/80663/pfizer-jab-receives-full-approval-from-fda-pentagon-mandates-vaccinations-for-all.html", "encoding": "utf-8"}, "image": null, "domain": "www.blacklistednews.com", "title": "Pfizer Jab Receives Full Approval From FDA, Pentagon Mandates Vaccinations For All Troops", "cleaned_text": "The Pentagon’s press secretary has just confirmed that – as expected – the DoD will now require all troops across the armed services to get the vaccine.\n\nTroops who refuse the vaccine could face “disciplinary” measures, including being dragged in front of a military tribunal that would mete out punishment. Commanders have several options for dealing with troops who refuse mandatory COVID-19 vaccines including issuing them a letter of reprimand or taking other administrative action; using nonjudicial punishment to push them to get vaccinated; referring troops to an administrative separation board for failure to obey an order, or even referring service members to courts-martial, which has already happened in the past when some troops refused to get vaccinated for Anthrax.\n\nSimilar mandates are expected in the private sector as well, with companies like Walmart, along with thousands of smaller businesses, expected to require proof of vaccination for all workers.\n\nRoughly 8 months after the Pfizer-BioNTech jab was first approved for public use after receiving an unprecedented emergency authorization, the jab has officially become the first to receive full approval by the FDA on Monday, the Washington Post reports.\n\nThe news, which was telegraphed days in advance, sent shares of Pfizer and BioNTech surging shortly after the open on Monday.\n\nAs the mainstream media immediately pointed out, the approval might prompt some skeptical adults to take the vaccine, while giving businesses the last piece of ammunition they needed to require workers to get the jab, or be fired. According to the CDC, 204MM Pfizer jabs (which will henceforth be known as Comirnaty, the official brand name of the jab) have been doled out since the emergency authorization was first handed down last December.\n\nThe vaccine is officially approved for Americans over the age of 16, while the emergency authorization remains in effect for patients between 12 and 15. Notably, the FDA is requiring Pfizer to conduct more research on the risks of myocarditis and pericarditis and other potential side effects. Pfizer will also develop a registry to help monitor outcomes for infants after vaccinated women give birth.\n\nCNBC reports that a survey from the Kaiser Family Foundation found 3 in 10 unvaccinated adults said they would be more likely to get vaccinated if one of the vaccines receives full approval. Full approval is “more psychological than anything else,” said Dr. Paul Offit, a voting member of the agency’s Vaccines and Related Biological Products Advisory Committee. “I mean you already have more than 320MM doses administered. The vaccines already have an enormous safety and efficacy profile.”\n\n“The FDA will do what it thinks it needs to do to make sure that the American public is safe,” he said.\n\nInitially, full authorization was expected to arrive in September, but the Biden Administration has ramped up the pressure in recent days. Full approval opens the door to several activities that were barred under the emergency authorization: Pfizer can now advertise the jab, and it can now continue to vaccinate people even after the COVID “emergency” is deemed over. Pfizer can also now raise the price of the vaccine. They have already raised the price of the jab in the EU.\n\nPfizer and BioNTech have both said they intend to generate billions of dollars in revenues (and likely profits) from sales of the jab.\n\nAs vaccine proponents celebrate the news, Alex Berenson, a prominent skeptic, has a question: how can a vaccine be fully approved when we don’t even know the optimal number of doses?\n\nHere’s the full press release from the FDA:\n\nToday, the U.S. Food and Drug Administration approved the first COVID-19 vaccine. The vaccine has been known as the Pfizer-BioNTech COVID-19 Vaccine, and will now be marketed as Comirnaty (koe-mir’-na-tee), for the prevention of COVID-19 disease in individuals 16 years of age and older. The vaccine also continues to be available under emergency use authorization (EUA), including for individuals 12 through 15 years of age and for the administration of a third dose in certain immunocompromised individuals.\n\n“The FDA’s approval of this vaccine is a milestone as we continue to battle the COVID-19 pandemic. While this and other vaccines have met the FDA’s rigorous, scientific standards for emergency use authorization, as the first FDA-approved COVID-19 vaccine, the public can be very confident that this vaccine meets the high standards for safety, effectiveness, and manufacturing quality the FDA requires of an approved product,” said Acting FDA Commissioner Janet Woodcock, M.D. “While millions of people have already safely received COVID-19 vaccines, we recognize that for some, the FDA approval of a vaccine may now instill additional confidence to get vaccinated. Today’s milestone puts us one step closer to altering the course of this pandemic in the U.S.”\n\nSince Dec. 11, 2020, the Pfizer-BioNTech COVID-19 Vaccine has been available under EUA in individuals 16 years of age and older, and the authorization was expanded to include those 12 through 15 years of age on May 10, 2021. EUAs can be used by the FDA during public health emergencies to provide access to medical products that may be effective in preventing, diagnosing, or treating a disease, provided that the FDA determines that the known and potential benefits of a product, when used to prevent, diagnose, or treat the disease, outweigh the known and potential risks of the product.\n\nFDA-approved vaccines undergo the agency’s standard process for reviewing the quality, safety and effectiveness of medical products. For all vaccines, the FDA evaluates data and information included in the manufacturer’s submission of a biologics license application (BLA). A BLA is a comprehensive document that is submitted to the agency providing very specific requirements. For Comirnaty, the BLA builds on the extensive data and information previously submitted that supported the EUA, such as preclinical and clinical data and information, as well as details of the manufacturing process, vaccine testing results to ensure vaccine quality, and inspections of the sites where the vaccine is made. The agency conducts its own analyses of the information in the BLA to make sure the vaccine is safe and effective and meets the FDA’s standards for approval.\n\nComirnaty contains messenger RNA (mRNA), a kind of genetic material. The mRNA is used by the body to make a mimic of one of the proteins in the virus that causes COVID-19. The result of a person receiving this vaccine is that their immune system will ultimately react defensively to the virus that causes COVID-19. The mRNA in Comirnaty is only present in the body for a short time and is not incorporated into – nor does it alter – an individual’s genetic material. Comirnaty has the same formulation as the EUA vaccine and is administered as a series of two doses, three weeks apart.\n\n“Our scientific and medical experts conducted an incredibly thorough and thoughtful evaluation of this vaccine. We evaluated scientific data and information included in hundreds of thousands of pages, conducted our own analyses of Comirnaty’s safety and effectiveness, and performed a detailed assessment of the manufacturing processes, including inspections of the manufacturing facilities,” said Peter Marks, M.D., Ph.D., director of FDA’s Center for Biologics Evaluation and Research. “We have not lost sight that the COVID-19 public health crisis continues in the U.S. and that the public is counting on safe and effective vaccines. The public and medical community can be confident that although we approved this vaccine expeditiously, it was fully in keeping with our existing high standards for vaccines in the U.S.”\n\nWhile this is definitely a ‘win’ for Pfizer, BioNTech and their shareholders, it’s not the end of the road as far as the approval process is concerned: The FDA is now expected to weigh approval of a booster dose, which the Biden Administration is pushing for before Sept. 20, when it expects to start doling out jabs to the most vulnerable patients.", "opengraph": {"image": "https://www.naturalblaze.com/wp-content/uploads/2021/08/pfizer-vax-zh.jpg"}, "tags": ["Motherboard"], "tweets": ["<blockquote class=\"twitter-tweet\">&#13;\n<p dir=\"ltr\" lang=\"en\">BREAKING: Pentagon will now mandate all troops be vaccinated against Covid-19, following the FDA’s full approval of the Pfizer shot, says <a href=\"https://twitter.com/PentagonPresSec?ref_src=twsrc%5Etfw\">@PentagonPresSec</a></p>&#13;\n<p>— Lara Seligman (@laraseligman) <a href=\"https://twitter.com/laraseligman/status/1429819652998373382?ref_src=twsrc%5Etfw\">August 23, 2021</a></p>&#13;\n</blockquote>&#13;\n", "<blockquote class=\"twitter-tweet\">&#13;\n<p dir=\"ltr\" lang=\"en\">Hey <a href=\"https://twitter.com/US_FDA?ref_src=twsrc%5Etfw\">@us_fda</a> – before you approve the <a href=\"https://twitter.com/pfizer?ref_src=twsrc%5Etfw\">@pfizer</a> vaccine today, I have one simple question: How many doses is the regimen? Two, three, TBD?</p>&#13;\n<p>How can you approve a “vaccine” – which by its very name is supposed to have a FIXED-DOSE REGIMEN – if you can’t even answer that question?</p>&#13;\n<p>— Alex Berenson (@AlexBerenson) <a href=\"https://twitter.com/AlexBerenson/status/1429796383616286722?ref_src=twsrc%5Etfw\">August 23, 2021</a></p>&#13;\n</blockquote>&#13;\n"], "movies": [], "links": ["https://www.naturalblaze.com/wp-content/uploads/2021/08/pfizer-vax-zh.jpg", "https://twitter.com/PentagonPresSec?ref_src=twsrc%5Etfw", "https://twitter.com/laraseligman/status/1429819652998373382?ref_src=twsrc%5Etfw", "https://www.washingtonpost.com/", "https://www.zerohedge.com/covid-19/us-investigates-moderna-jab-after-data-show-25x-higher-risk-heart-inflammation?fbclid=IwAR2nZEc6-Cjl52nSamnFC6zJQdPY3q8QnoCDx3P9wZlP1N8SBeLVe3aKX1Y", "https://www.zerohedge.com/covid-19/moderna-pfizer-hike-vaccine-prices-25", "https://twitter.com/US_FDA?ref_src=twsrc%5Etfw", "https://twitter.com/pfizer?ref_src=twsrc%5Etfw", "https://twitter.com/AlexBerenson/status/1429796383616286722?ref_src=twsrc%5Etfw", "https://www.fda.gov/news-events/press-announcements/fda-approves-first-covid-19-vaccine"], "authors": [], "publish_date": null}