{"result_id": "051013", "URL": "https://www.blacklistednews.com/article/83399/proof-that-israel-found-serious-safety-problems-with-the-covid-vaccines-then-deliberately-covered.html", "timestamp": "2023-04-25 12:19:41 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.blacklistednews.com/images/tabicon.ico", "canonical": "https://www.blacklistednews.com/article/83399/proof-that-israel-found-serious-safety-problems-with-the-covid-vaccines-then-deliberately-covered.html", "encoding": "utf-8"}, "image": null, "domain": "www.blacklistednews.com", "title": "Proof that Israel found serious safety problems with the COVID vaccines then deliberately covered it up", "cleaned_text": "This is the most IMPORTANT article I’ve written to date\n\nThis is the single most important article on my Substack (which has over 700 articles). This one article should bring down the house of cards if there is just one honest person in a position of authority in the world.\n• The Israeli health authority knew the vaccines were harming people: the side effects of the vaccine are neither mild nor short term. In fact, in 65% of the neurological cases that mentioned duration, the symptoms are all on-going.\n• They also established causality: the side effects were caused by the vaccine. This is something no one else had been able to establish before.\n• They don’t know how serious the harm is because they only looked at the data for the top five categories. Cardiovascular was #6. So they have only looked at a fraction of the data.\n• The researchers do not know the prevalence of these serious side effects because they were just provided with the numerator, not the denominator (similar to VAERS).\n• The Israeli authorities deliberately covered up the safety issues and hid it from the world, issuing a false report essentially saying “there is nothing new to see here folks, move along.”\n• The only good news in all of this is that Israel protected Palestinians from getting this very unsafe vaccine. That was very humane of the Israelis.\n• As of September 4, 2022 no one is being held accountable and everyone is ignoring this bombshell story:\n• There is a press blackout on coverage in Israel of this. The Israel media refuses to even look at the evidence.\n• Nobody in Israel is being held accountable for this corruption. There isn’t even an investigation.\n• Nobody in the worldwide medical community is speaking out about the corruption either despite the fact that it affects people everywhere in the world.\n• There is no coverage of this in any worldwide mainstream media.\n• No public official, public health official, or mainstream media anywhere in the world is even calling for an investigation, nobody wants to see the original expert report, and nobody wants to see the safety data they gathered.\n• We have the full video and we have the slides that were presented; use the Contact Me link if you are a health authority and want to see it before it is released to the public.\n• Just to be sure the CDC knows about this, I just emailed hundreds of people at the CDC who are involved in the COVID vaccines (including Rochelle Walensky) to let them know that the report and video are available. All they have to do is hit reply. I bet not a single person at the CDC wants to see it. We are about to find out just how deep the corruption runs at the CDC.\n• This isn’t surprising that they ignore this. All negative data on the vaccine is ignored. For example, when I discovered that young Canadian doctors were dying at a more than 12X normal after the second booster, the Canadian Medical Association, whose job it is to to be an advocate for the health of doctors, refused to comment. I sent five requests and they ignored all requests. They should change their website to say that they are an advocate for the drug companies, not the health of doctors.\n• The Israel Ministry of Health (MoH) took 18 months from the launch date of the vaccine before they looked at the COVID vaccine safety data to see what it said.\n• They only started collecting safety data in December 2021, one year after rolling out the vaccines to the public. Few people knew this.\n• In December 2021, they tasked an outside expert panel led by Prof. Mati Berkowitz, a leading Israeli expert on pharmacology and toxicology from Asaf Harofe hospital, to examine the safety data they collected over the next 6 months (from early December to the end of May, 2022).\n• The panel presented their findings to MoH personnel on or about Jun 6, 2022 in a Zoom call that was secretly recorded. They found that the COVID vaccines were much more dangerous to people than the world authorities admitted. They found serious adverse events that were never disclosed by Pfizer or any world government. These adverse events were also not found to be short term as the public was told.\n• They also determined causality, something no other world health authority has ever been willing to do (because other governments never looked at the data either). Causality was both obvious and easy to prove using the re-challenge data that was collected (you can’t do this using the US VAERS data, for example).\n• In short, the panel determined that the government was misleading the people of Israel.\n• We still don’t know the whole extent of how dangerous the vaccines are because the outside team only looked at the top 5 most frequently cited events.\n• Both the Israeli authorities and scientists analyzing the Ministry of Health (MoH) data acted to cover up the harms by releasing a fabricated report to the public to make the vaccine look perfectly safe and claim that there was nothing wrong..\n• It is only thanks to the efforts of one courageous individual who released the recording of the full Zoom meeting between the MoH and their expert panel that we now know what was said at that meeting and what the data actually showed. Otherwise the world would still be in the dark.\n• Leaders of our “trusted institutions” all over the world said absolutely nothing after the news broke on August 20, 2022. This suggests that there is widespread corruption in the medical community, government agencies, among public health officials, the mainstream media, and social media companies worldwide: they will not acknowledge any event that goes against the mainstream narrative.\n• This is a level of corruption that is unprecedented. The atrocities here are clear cut. Everyone should be speaking out and calling for a full investigation and fully evaluating the safety data collected by the Israel government.\n\nWhat you should do\n\nThe three most important things you can do to put a stop to these dangerous vaccines are:\n• Read this article including the recommended links in the References section.\n• Share this article with as many people as you know (e.g., share on all your social media accounts now)\n• Please subscribe to my Substack so I can keep you informed of developments. The greater the collective reach of people who are challenging the false narrative, the faster the truth will come out. It’s absolutely free to subscribe.\n\nThe Israeli Ministry of Health (MoH) was informed by their own hand-selected outside expert group headed by Prof. Mati Berkowitz that the COVID vaccines are not as safe as the MoH had been claiming to the Israeli people. It was just the opposite: instead of mild, short term events, the events were serious and long-lasting. For neurological side effects, in 65% of the cases, these did not go away at all (start watching this video at 2:30; the 65% is at 3:09) and the researchers admitted they had no clue if they would ever go away.\n\nInstead of admitting their mistake, the MoH covered it up by issuing a report that distorted the expert report.\n\nIn addition, the experts also effectively covered it up by saying nothing when this happened. They sat by idly while the MoH misrepresented the data. It appears that everyone involved was so intimidated that they felt that they had to bury the truth, even when it can cost lives.\n\nThe news finally broke to the public on August 20 that the government hadn’t been monitoring adverse reactions for a year and then, after they finally gathered the adverse safety data, that they deliberately manipulated the data to make the vaccine look safe when it wasn’t. You’d think there would be major outrage at the violation of the public trust. But there was nothing. No reaction. Dr. Sharon Alroy-Preis, the Health Ministry's head of public services and a top COVID adviser to the Israeli government, issued no public statement. That’s stunning.\n\nThis suggests that she and the others in her organization who knew about this were in on the cover-up. The Israeli people should demand that they be fired and criminally prosecuted.\n\nIn addition, the current Minister of Health, Nitzan Horowitz, is doing nothing. Why isn’t he calling for an investigation? He should be fired as well. Or is corruption of science OK with the Israeli government?\n\nFinally, how deep does the corruption go? Will any Israeli mainstream media cover this story? Why not? Will any member of the Israeli parliament call for an investigation? Will any member of the executive branch call for an investigation?\n\nIt appears to me that they are all bought off by the drug companies. Am I wrong?\n\nThis is a story of corruption, pure and simple.\n\nThere is no way to put a positive spin on this. Anyone in power who is not calling for an investigation and heads to roll is just as corrupt as the people who engaged in the original cover-up of the safety report.\n\nThis story is the “smoking gun” we’ve been waiting for: an official government agency was caught on tape as having received a damaging report from scientists and then deliberately lied to the public about it.\n\nThe response to this story has been crickets so far\n\nThe Israeli press (which is heavily state controlled) refused to go near the story; they wouldn’t even reply when contacted about the story. They do not want to see any of the evidence.\n\nAt the time I am writing this (September 2 and 3), only one news outlet, GB News in the UK, has covered it.\n\nIt is up to us to force our medical, health, and political leaders worldwide to take a stand on what happened. Will they condemn it or will they ignore it?\n\nEvery mainstream medical leader should be saying that what the MoH did is wrong and calling for an immediate investigation into the safety of the vaccines. We should be able to see the full presentation of the expert panel and their report. And the safety data should be released to the public like the VAERS data is.\n\nBut look at what happened: they aren’t condemning what happened and they aren’t asking for the report or the data. They are staying silent… as if it didn’t happen.\n\nThey are all basically saying, “It is OK for a government to not monitor vaccine safety for 12 months, and then, after 6 months of safety monitoring and clear evidence of harm, deliberately misrepresenting the safety data to the public.”\n\nIt turns out the Israeli government never had a vaccine safety monitoring system in place when they launched the COVID vaccines in December, 2020.\n\nFinally, in December of 2021, more than a year into the vaccination program, they decided to fix that defect. They started collecting safety data from that point until the end of May 2022. They then tasked an outside research group headed by a top Israeli scientist to analyze the data.\n\nThe report came back that the side effects were not mild and short lasting as was represented to the Israeli people. The data was clear that the side-effects were serious and long-lasting (sometimes with no end in sight).\n\nIn short, the data showed that the government, which wasn’t monitoring for safety like they claimed, lied to the people of Israel. Also, it’s now clear that Dr. Sharon Alroy-Preis lied to the outside committee of the FDA about the Israeli safety monitoring.\n\nThe Ministry of Health (MOH) concealed the safety report for 2 months, then issued a deceptive public report to make the vaccine look safe. This Sunday, Sept 4, they will \"ask\" the vaccine safety committee to recommend the 5th dose (the combo vax) for 60+. This is corrupt. They are hiding the safety data from the public and they know it.\n\nIt took 2 months for the MOH to distort the findings and present it to the public to make it look like the COVID vaccines were safe.\n\nNobody knew that someone was secretly recording the meeting between the outside researchers and the MoH\n\nNobody knew that the June meeting between the researchers and the MoH was being secretly recorded.\n\nApparently, there was an honest person at the meeting and so when the MoH didn’t act in a way that protected the public, the recording was leaked to the press.\n\nIn the 80 minute recording, one of the researchers said, “We’ll have to think medical-legal – how to present our findings to avoid lawsuits.”\n\nAfter bits of the recording were leaked to the press, none of the Israeli media would cover the story. In fact, only one news outlet in the world, GB News in the UK, was willing to cover it. Watch this video of the GB News interview by Neil Oliver which happened on August 20, 2022.\n\nFox News was notified but declined to cover it (apparently because their advertising contracts with Pfizer prohibits them from covering any negative news about the vaccines).\n\nThe whole scam was fully exposed to the public on Sept 1, 2022 in this Tweet (10 messages long) from Yaffa Shir-Raz who is an honest journalist living in Israel.\n\nI found out about it when Retsef Levi forwarded me the tweet to my WhatsApp (since I’m permanently banned from Twitter for speaking out about how unsafe the vaccines are). My reaction was swift… I started drafting this article within minutes after reading that tweet.\n\nThe tweet discusses the techniques that were used to distort the researchers’ findings:\n\nIf twitter takes down that tweet thread, I have a copy of the video and the full tweet which I will publish if needed.\n\nCausality of new adverse events was proven by the outside team\n\nIn addition, new significant adverse events were identified and causality was established in areas where the researchers weren’t aware of any issues (such as neurological problems where there wasn’t even a survey question asking about these; it was detected in the free-form fields).\n\nThe outside team was hired by the Ministry of Health.\n\nThe meeting with the MoH was early June in front of a senior leader in the MoH who is in charge of adverse event monitoring.\n\nThe MoH officials did not share the findings with the MoH advisory committee when several weeks later it met to discuss the approval of the vaccine to babies and 5th booster to adults.\n\nDr. Alroy-Preis is #2 in the MOH. She is heading the formal collaboration between Israel and Pfizer. She meets with Pfizer regularly and writes papers with them. She is also responsible for all the COVID 19 policies in Israel.\n• The fact that, in most cases, these effects did not resolve quickly (in some cases lasting over a year)\n• The proof that the vaccine caused the events\n• The actual rates; they manipulated the rates by dividing the number of reports by all the doses, hiding the fact that they had the system for 6 months and only one HMO (15 percent of population reported). This makes the denominator huge and the numerator small which masks the significance.\n\nHow could this corruption happen?\n• It was initially caused by blind trust in authority figures like Fauci, the CDC, the FDA, and Pfizer. Fauci conned everyone into the false belief that the vaccine was the only way out.\n• Since everyone wanted to end the pandemic, they looked the other way when safety issues popped up.\n• When authorities are caught red handed as they were in this video, they cover it up so that nobody looks bad (themselves, the government, the media, and the mainstream medical community).\n• All these mitigation strategies were completely unnecessary. We have proven early treatment protocols resulting in close to zero hospitalization and death. But because Fauci controls the NIH, they ignore all this.\n• Fauci created the virus (by funding the gain of function research at the Wuhan Institute of Virology) and single-handedly is also responsible for the response which killed even more people than the virus did.\n\nThere are other perspectives:\n• See “How did the MoH become Pfizer’s agent?” for how the corruption happens, but briefly it is because government officials are misled into thinking the vaccine is the only way out so they sign an agreement that makes pushing the vaccines a high priority and safety issues a low priority.\n\nHere are the key sources:\n• The definitive article on the corruption by Yaffa Shir-Raz\n• “Safe and Effective” by Etana Hecht. If Etana can figure this out, why can’t any Israeli authority?\n• The Yaffa tweet (10 tweet long thread) by Yaffa Shir-Raz. Retsef Levi forwarded me just this tweet and you can see my reaction was instant and immediate when I read the thread:\n• The GB News segment on August 20, 2022 where Neil Oliver interviewsYaffa and Retsef. The Rumble post was published on Aug 28, but as you can see from this tweet that the news came out on August 20. What is also stunning is how little the reaction was (only 427 retweets and 912 likes after 2 weeks).\n• This 4 minute video exposing the MoH report which shows what the scientists actually said at the secret meeting. The scientists proved Pfizer lied to the FDA about the side effects. This video is only 4 minutes long and everyone should watch this. It has the statements showing that in 65% of the neurological cases, the problems didn’t resolve.\n• This one minute clip from the Zoom call shows the researchers requesting that Sharon be informed. There is assurance from the MoH attendees that they will make this happen.\n• This two minute clip shows Dr. Sharon Alroy-Preis assuring the public the vaccines are safe for women juxtaposed with the video of the researchers saying the vaccines are causing damage to women’s reproductive organs that in some cases doesn’t end. They are also pointing out that re-challenge results in the same problem coming back which is evidence of causality, especially when it happens in many patients. Remember, the researchers didn’t know they were being recorded. They would have never said this if they knew they were on camera.\n• The public MoH report that essentially said “nothing to see here folks, move along.”\n• We have the full video of the meeting between the scientists and the MoH officials has not been released publicly... yet. This provides an opportunity for the MoH officials to come forward on their own and admit what happened. Yaffa’s tweet (above) has the info that was sent to the media. We also have a copy of the slides that were presented at the meeting. Use the Contact Me link if you are a health authority (doctor, academic, press, public health official) and want to see it before we release it to the public.\n\nThese references are only on this particular story of course. There are now over a thousand of articles in the peer-reviewed published scientific journals showing the vaccines are not as safe as claimed. See this article for a summary of the evidence.\n\nWe are only seeing the tip of the iceberg right now\n\nKeep in mind that the researchers ONLY analyzed the 5 most commonly reported serious adverse events and they found new things Pfizer didn’t know about.\n\nThey excluded the most severe cases and gave them to another committee to examine.\n\nCardiovascular events were #6 most prevalent so we don’t have any data on those since they weren’t analyzed.\n\nAnd the study didn't even include cases of hospitalization - which is the role of another committee to examine.\n\nSo the current analysis is just the tip of the iceberg.\n\nVAERS shows thousands of symptoms that are elevated by these vaccines compared to normal.\n\nThere is a lot more that has not yet been surfaced to the public. There is honest research going on in Israel that is being ignored.\n\nFor example, did you know that according to an analysis of data from the MoH, the COVID vaccine kills 40 times more old people than it saves?\n\nDr. Herve Seligmann works at the Emerging Infectious and Tropical Diseases Research Unit, Faculty of Medicine, Aix-Marseille University, Marseille, France. He is of Israeli-Luxembourg nationality.\n\nUsing Israel MoH data, Haim Yative and Dr. Seligmann, Israeli researchers, found that the COVID-19 vaccine killed 40 times (40x) the amount of elderly people than the disease would have and 260 times more younger people than would have died from the virus in a 3 week period shortly after the shots.\n• Israeli Health Ministry data: Pfizer Vaccine Killed ‘About 40 Times More Elderly than the Disease Itself would have Killed’\n• The uncovering of the vaccination data in Israel reveals a frightening picture\n• The Israeli press is heavily controlled. Yaffa was fired from the biggest newspaper in Israel a year ago, after working there for 20 years. Her crime? She wrote some articles the MoH did not like. So it’s not surprising that the press in Israel avoided covering this story. It is only going to make a difference if everyone who reads this article shares it on social media.\n• The expert group found side-effects not listed by Pfizer (new signals), including neurological AEs, back pain, and GI problems, especially in kids. Since the group only looked at the top 5 most prevalent side effects, it’s really troubling that they found anything new. This really isn’t much of a surprise as the VAERS data, which is independent of the Israeli data, shows the same thing.\n• Causality: they found many cases of re-challenge - recurrence or worsening of a side effect following repeated doses within the same individual - which the head researcher stresses, increases the chances of causality \"from possible to definite.\" So it is interesting that these researchers were easily able to determine causality when nobody else in the “mainstream medical world” was able to. Of course, the “misinformation spreaders” realized that the VAERS data was saying this back in early 2021 due to dose dependency of the symptoms.\n• The only person who finally tweeted something was the husband of Sharon AlroyPreis. He basically smeared Yaffa. This actually makes sense because when you are unable to attack the merits of an argument, the proper approach is either to censor the attacker or engage in ad hominem attacks.\n\nA comment from one of my readers in Israel\n\nSo now all the people in the US have at least one scapegoat to blame for everything. I’ve been told that the US relied on the Israeli’s for safety monitoring due to the sad state of safety monitoring in the US. They may not have realized that Israel was even worse than the US in safety monitoring; much worse.\n\nIt is a criminal violation of US law for anyone to make a material misrepresentation in any official proceeding (18 USC 1001). Violators are subject to 5 years in prison.\n\nConsider the following statements made at this FDA VRBPAC meeting on September 17, 2021:\n\n“Reckless Levy” is actually “Retsef Levi.” But this statement was made at a time where there was no safety monitoring being done by the Israeli government.\n\nShe is relating to Retsef's claim that the reporting system in Israel was dysfunctional (which it was) and that there was no follow up or monitoring on AEs. Retsef didn’t lie. She did. She said she was “surprised.”\n\nSo this appears to be a deliberate misrepresentation made by Dr. Alroy-Preis which could subject her to criminal prosecution by the DOJ. However, such things are unlikely even though her testimony led the committee to approve the vaccines which have killed hundreds of thousands of Americans.\n\nOn the other hand, maybe she was surprised that anyone outside the MoH knew what was really going on (so she wasn’t lying).\n\nHow do “they” explain this away? They can’t!\n\nThe Twitter trolls initially claimed the videos were taken out of context. But that didn’t last long. Now they are silent. The strategy seems to be let’s ignore it so it will go away.\n\nHow medical experts in the US are reacting\n\nI have the mobile phone number for Dr. Grace Lee, head of the ACIP committee which is the outside committee of the CDC. So I texted her this article and asked for comments.\n\nIf she says anything, I’ll report it here. Don’t hold your breath.\n\nShe should be outraged. But she won’t be. She’ll say nothing. She’ll just go along with what she is told to do, which is to ignore it. That’s how science works. If you want evidence of corruption, this is it.\n\nSimilarly, no member of the mainstream medical community will say a word. None of them will say anything.\n\nWill Professor Vinay Prasad say anything? He knows about this article and I’ve asked for his comments as well.\n\nThis is a defining moment for the world mainstream medical community and medical journals. Will they speak out or do as they are told and remain silent? Who will be the first to speak out?\n\nI’m guessing they will all remain silent and not comment about this. This shows you the level of control and corruption.\n\nHere is a partial list of people I’ve ask for comment from:\n• Stanford Professor Grace Lee (who is also head of the ACIP committee)\n• John Hopkins Professor Bert Vogelstein (the most cited scientist in history)\n\nI know all of these people. I am hoping that at least one of them will want to be on the right side of history here in calling out the corruption at the MoH.\n\nThe only person who responded was Bert Vogelstein who basically said he’s working on something big and didn’t want to get defocused. That’s fair. He’s a class act. This is peripheral for him and I knew that when I reached out.\n\nLet me make my position crystal clear:\n\nI would have asked other people but many top scientists in the infectious disease area requested I never contact them again after I first revealed the COVID vaccines were unsafe back in May, 2021. They believed I was a menace to society at the time (and probably still do).\n\nThis can’t happen in the US because the CDC avoids gathering accurate safety data on vaccines\n\nThe US has a lame system for tracking adverse events after vaccination. They looked at upgrading it over 10 years ago, but the new system, ESP:VAERS, was too accurate and showed all the US vaccines were dangerous. So the CDC canned the system. This is documented near the beginning of RFK Jr’s book The Real Anthony Fauci.\n\nThe CDC would never commission a study to accurately study adverse events so the problem just doesn’t happen in the US because they avoid collecting the data in the first place.\n\nThis is very corrupt but nobody minds including the mainstream medical community. They have all been brainwashed into believing the FDA is legit and all vaccines are safe. But apparently they know this isn’t true because none of them will debate RFK Jr on vaccine safety (he’s been trying for 20 years to find an expert to debate (Alan Dershowitz doesn’t count).\n\nOf course, the US Pfizer vaccines are just as dangerous as the Pfizer vaccine in Israel, but the governments and the mainstream press ensure nobody finds out, just like how you will only see this information on Substack and in other places, but never in the mainstream press.\n\nEven when an FAA whistleblower comes forward with serious accusations that are irrefutable, the US press avoids covering the event:\n\nToday, nobody will challenge the FDA. They now do EUA approvals without any proof of a clinical benefit and without approval by their own captured outside committee. This is outrageous, yet doctors are silent.\n\nThe FDA just approved the combined booster after testing on 8 mice showed that the Omicron protection was sporadic and that it did not prevent infection in a single mouse that was challenged with the virus. No word on data showing there is a hospitalization or death benefit.\n\nWhat I don’t understand is why they didn’t do the Omicron challenge study on 200 mice: 100 who got the full vax series vs. 100 completely unvaxed mice looking for all-cause mortality and morbidity. That would have been real data, far better than 8 mice who got the vaccine looking for antibodies. But they didn’t do this because they knew it would be bad.\n\nInstead, the medical community and the FDA are content with a single arm study with 8 mice which showed no clinical benefit from the vaccine to approve a vaccine that they will try to get everyone to take.\n\nThis is truly stunning. It shows you clearly how broken the medical community is. There should be op-eds in every medical journal on the absurdity of approving a booster with no clinical benefit in humans or mice. Doctors should be outraged at this. But they say nothing.\n\nAll the mice used in the study are now dead (they were killed as part of the study which was convenient since that way they can’t track their mortality).\n\nWas Sharon Alroy-Preis in on it?\n\nIt is highly unlikely that Dr. Sharon Alroy-Preis, the Health Ministry's head of public services and a top COVID adviser to the Israeli government, didn’t know about all of this before the press leak.\n\nHow could she not know? There was no safety monitoring in place before December 2021. If she didn’t know that, she should be immediately fired for incompetence. So she must have known about the data that was being gathered and that it was being analyzed. She should have been on pins and needles waiting for the result of the meeting if she truly cared about public health. And how could she not be at that meeting with the scientists? What could possibly be more important to the health and safety of the Israeli people? Where was she?\n\nEven though she obviously didn’t make the Zoom meeting because she had more important things to do, she would have been notified immediately after the meeting by her staff. That’s the 99.99% most likely scenario.\n\nBut once it was announced in the press, it removed all doubt.\n\nIf she was truly not informed before the GB News story on August 20, she would have immediately issued a press release that she was never told about the report and that there would be an investigation. Instead, we heard nothing. The only possible way that could happen is she was in on the cover up.\n\nMy email to the CDC offering to share the information\n\nI wanted to create a public record that the information was offered to hundreds of people who work at the CDC in vaccine safety. I predict that not a single person wants to see the data. I would be amazed if I am wrong.\n\nHere is the email I sent on September 4, 2022 to hundreds of people at the CDC:", "opengraph": {"image": "https://substackcdn.com/image/fetch/w_1200,h_600,c_limit,f_jpg,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Ff4bffe6d-28a9-47da-a84f-fb2e56d3600c_2027x1269.jpeg"}, "tags": ["Motherboard"], "tweets": [], "movies": [], "links": ["https://www.doctorswithoutborders.org/latest/palestinians-left-out-israels-covid-19-vaccination-success-story", "https://stevekirsch.substack.com/p/how-to-contact-me", "https://stevekirsch.substack.com/p/doctors-in-canada-are-dying-at-a", "https://stevekirsch.substack.com/i/71483079/references-further-reading", "https://stevekirsch.substack.com/p/exclusive-proof-that-the-top-israeli?utm_source=substack&utm_medium=email&utm_content=share&action=share&token=eyJ1c2VyX2lkIjoxMjgwNzk2LCJwb3N0X2lkIjo3MTQ4MzA3OSwiaWF0IjoxNjYyMzE0MDQwLCJleHAiOjE2NjQ5MDYwNDAsImlzcyI6InB1Yi01NDgzNTQiLCJzdWIiOiJwb3N0LXJlYWN0aW9uIn0.Ihs2YOVvX18q5RKJHvVEHlHaXYbq0zDCx7VYF6quM5Q", "https://rumble.com/v1i7gnf-israeleak-no-4.html", "https://www.gov.il/BlobFolder/reports/covid19-side-effect-09122021-31052022/he/files_publications_corona_covid19-side-effect-09122021-31052022.pdf", "https://rumble.com/v1ho8dd-90150241.html", "https://twitter.com/YaffaRaz/status/1565395051374592001?t=JS4n-Md3sUqVCktBCCZ9RA&s=08", "https://twitter.com/YaffaRaz", "https://galileoisback.substack.com/p/how-did-israels-ministry-of-health?utm_source=substack&utm_campaign=post_embed&utm_medium=web", "https://ehden.substack.com/p/pfizerleak-the-israeli-connection", "https://jackanapes.substack.com/p/how-did-the-israeli-ministry-of-health", "https://rtmag.co.il/english/breaking-the-israeli-ministry-of-health-has-been-warned-it-might-open-itself-to-lawsuits-for-encouraging-the-public-to-get-vaccinated-while-claiming-that-the-covid-19-vaccine-is-safe,-and-that-side-effects-are-mild-and-transient", "https://etana.substack.com/p/safe-and-effective-wash-rinse-repeat", "https://twitter.com/YaffaRaz/status/1565395051374592001?t=JS4n-Md3sUqVCktBCCZ9RA&s=08", "https://rumble.com/v1ho8dd-90150241.html", "https://twitter.com/GBNEWS/status/1561083008974835713", "https://rumble.com/v1i7gnf-israeleak-no-4.html", "https://rumble.com/v1hax8y-89529298.html", "https://rumble.com/v1hajz3-89512095.html", "https://www.gov.il/BlobFolder/reports/covid19-side-effect-09122021-31052022/he/files_publications_corona_covid19-side-effect-09122021-31052022.pdf", "https://stevekirsch.substack.com/p/how-to-contact-me", "https://stevekirsch.substack.com/p/the-safe-and-effective-narrative", "https://stevekirsch.substack.com/p/the-vaers-x-factor-analysis", "https://goldenageofgaia.com/2021/03/03/israeli-health-ministry-pfizer-vaccine-killed-about-40-times-more-elderly-than-the-disease-itself-would-have-killed/", "https://www.israelnationalnews.com/News/News.aspx/297051", "http://www.nakim.org/israel-forums/viewtopic.php?t=270812", "https://stevekirsch.substack.com/p/exclusive-proof-that-the-top-israeli/comment/8815114", "https://www.law.cornell.edu/uscode/text/18/1001", "https://youtu.be/WFph7-6t34M?t=21336", "https://www.amazon.com/Real-Anthony-Fauci-Democracy-Childrens-ebook/dp/B08X5YWRRP/ref=sr_1_1?gclid=CjwKCAjw9suYBhBIEiwA7iMhNDxESq-ERVyUMXUaTIJFibTrhCVyx4_Tf6INJb5bQLlCtc89XoZywRoC-fIQAvD_BwE&hvadid=542423015182&hvdev=c&hvlocphy=9032737&hvnetw=g&hvqmt=e&hvrand=8427255127486969791&hvtargid=kwd-1410978370786&hydadcr=27862_10743477&keywords=the+real+fauci+book&qid=1662207181&sr=8-1", "https://etana.substack.com/p/investigate-the-danger?utm_source=substack&utm_campaign=post_embed&utm_medium=web", "https://igorchudov.substack.com/p/ba5-boosters-8-mice-trial-actually", "https://igorchudov.substack.com/p/all-bivalent-boosted-mice-got-covid", "https://www.addtoany.com/share", "https://disqus.com/?ref_noscript", "https://www.blacklistednews.com/article/76389/blacklisted-news-privacy.html", "https://www.blacklistednews.com/article/76390/terms-of.html", "http://www.statcounter.com/", "javascript:window.location.href='https://www.blacklistednews.com/index.php?sc='+Math.random();", "http://creativecommons.org/licenses/by/4.0/deed.en_US"], "authors": [], "publish_date": null}