{"result_id": "051031", "URL": "https://www.blacklistednews.com/article/83242/judge-grants-relief-to-marines-denied-religious-exemption-from.html", "timestamp": "2023-04-25 12:19:48 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.blacklistednews.com/images/tabicon.ico", "canonical": "https://www.blacklistednews.com/article/83242/judge-grants-relief-to-marines-denied-religious-exemption-from.html", "encoding": "utf-8"}, "image": null, "domain": "www.blacklistednews.com", "title": "Judge Grants Relief to Marines Denied Religious Exemption from Vaccine", "cleaned_text": "U.S. District Court Judge Steven D. Merryday on Thursday evening granted a class-wide injunction that prohibits the Marine Corps from enforcing the Biden administration’s military vaccine mandate against or discharging Marines who filed for religious exemption from the mandate and who were denied.\n\nThe injunction gives relief to Marines who were affirmed by a chaplain as harboring a sincere religious objection to the vaccine, submitted a request for religious accommodation, were denied, and who appealed and were denied or will be denied after an appeal.\n\nMerryday wrote in his order that Defense Secretary Lloyd Austin, et. al., are “PRELIMINARILY ENJOINED (1) from enforcing against a member of the class any order, requirement, or rule to accept COVID-19 vaccination, (2) from separating or discharging from the Marine Corps a member of the class who declines COVID-19 vaccination, and (3) from retaliating against a member of the class for the member’s asserting statutory rights under [Religious Freedom Restoration Act].”\n\nMerryday’s order adds the Marine Corps to the branches of the military blocked by court orders from taking punitive action towards those who have sought religious exemption from the mandate. So far, the Navy and the Air Force are also blocked from taking action against service members who have sought relief from the vaccine on the basis of their religious freedom.\n\nMerryday discussed at length the Marine Corps issuing blanket denials to 99.7% of Marines requesting religious accommodation without considering each Marines’ personal circumstance, as the service is required to do by law.\n\nHe noted that there have been 3,733 requests from Marines for religious accommodation as of August 4, 2022, but the Marine Corps has granted only 11 requests, less than three-tenths of a percent — 0.295%, for Marines due for retirement and separation. He wrote:\n\nThe record shows that the other three-thousand-seven-hundred-plus religiously objecting Marine applicants are either denied already or rapidly proceeding to an apparently (on the present record) inevitable denial, and in either instance are awaiting forced separation from service; regardless of seniority; regardless of specialized skill and training; regardless of depth and breadth of experience; regardless of distinguished service; regardless of the current state of international turbulence and danger; regardless of the place and circumstances of each applicant’s service; and regardless of other considerations (for example, the difficulty in recruiting equivalent replacements). The record shows that the Marine Corps’s implementation of the Secretary’s directive enjoys at least two, even if no other, benefits to the Secretary and the Marine Corps: unmistakable clarity and unwavering consistency. But neither is what RFRA commands.\n\n“Any reasonable, informed, and disinterested person looking at this improbably skewed result, especially a person familiar with the law, will acknowledge readily that the authority rendering this uniform course of rejection is highly unlikely to successfully demonstrate the bona fides of the process that produced this monolithic series of rejections,” he added.\n\n“Specifically in this instance and based on the current numbers, a reasonable jurist would conclude preliminarily…that the class of religiously objecting Marines is substantially likely to prevail on the merits of their claim that the Marines never received a fair and particularized evaluation ‘to the person,’ that is, never received the benefit of the process commanded by RFRA,” Merryday wrote.\n\nBreitbart News previously exclusively reported that the Marine Corps was issuing blanket denials to Marines using the same form letter, despite a legal requirement to consider each request on an individual basis.\n\n“[T]he Marine Corps’s formularized denial undermines the contention that the Marine Corps conducts an ‘individualized assessment’ of an applicant. To justify the denial of each applicant’s appeal, the Marine Corps asserts that the denial\n\nfurthers a compelling interest in military readiness and in securing the health of the force,” he wrote.\n\nCiting Davila v. Gladden, he added, “[military] officials cannot simply utter the magic words [‘military readiness and health of the force’] and as a result receive unlimited deference from those of us charged with resolving the dispute.”\n\n“No appellate denial in the record addresses with any meaningful degree of specificity the factual circumstances of the applicant’s service or analyzes the marginal increase, if any, in the risk of contagion incurred by granting the requested accommodation and the marginal detrimental effect, if any, on military readiness and the health of the force flowing from the specific denial of the applicant’s requested accommodation from COVID-19 vaccination,” he concluded.\n\nHe continued: “No denial assesses the age, fitness, health, or natural immunity of the applicant or otherwise assesses, for example, whether the particular applicant is acutely vulnerable to complications from COVID-19 as to warrant the suspension of the applicant’s Free Exercise. No appellate denial assesses whether the daily and tangible circumstances of an applicant’s service are so likely to result in transmission to Marines as to warrant the suspension of the applicant’s Free Exercise.”\n\n“Although each appellate denial affirms that which no party disputes — that COVID-19 vaccination might promote to some extent the health and readiness of the force — no denial demonstrates that accommodating a particular applicant will meaningfully impede the health and readiness of the 95% vaccinated force or meaningfully impede the military’s operations and duties.”\n\n“Obviously, RFRA includes everyone from the President to a park ranger, from the Chief Justice of the United States to a probation officer, from the Speaker of the House to a member’s district office staffer, from the Chairman of the Joint Chiefs of Staff to a military recruiter — even if they don’t like it and even if they don’t agree with it. The Free Exercise Clause and RFRA are the law of the land,” Merryday said. “No exemption, whether express or implied, relieves the military of RFRA’s command.”\n\nThe case is Colonel Financial Management Officer v. Austin, No. 8:22-cv-1275 in the U.S. District Court for the Middle District of Florida.\n\nFollow Breitbart News’s Kristina Wong on Twitter or on Facebook.", "opengraph": {"image": "https://media.breitbart.com/media/2017/03/us-marines-salute-silhouette-getty.jpg"}, "tags": ["Motherboard"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">&#13;\n<p dir=\"ltr\" lang=\"en\">More than 200 Marines have been kicked out of the Marine Corps for choosing not to take the coronavirus vaccine. <a href=\"https://t.co/kIKmK2rV7d\">https://t.co/kIKmK2rV7d</a></p>&#13;\n<p>— Breitbart News (@BreitbartNews) <a href=\"https://twitter.com/BreitbartNews/status/1476651686039109636?ref_src=twsrc%5Etfw\">December 30, 2021</a></p>&#13;\n</blockquote>&#13;\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">&#13;\n<p dir=\"ltr\" lang=\"en\">Six active duty Marines are speaking out against the Biden administration’s coronavirus vaccine mandate in a video that was aired during an anti-vaccine-mandate rally in Los Angeles on Sunday.</p>&#13;\n<p><a href=\"https://t.co/pqAEq59udB\">https://t.co/pqAEq59udB</a></p>&#13;\n<p>— Breitbart News (@BreitbartNews) <a href=\"https://twitter.com/BreitbartNews/status/1513671511126814725?ref_src=twsrc%5Etfw\">April 12, 2022</a></p>&#13;\n</blockquote>&#13;\n"], "movies": [], "links": ["https://t.co/kIKmK2rV7d", "https://twitter.com/BreitbartNews/status/1476651686039109636?ref_src=twsrc%5Etfw", "https://www.breitbart.com/politics/2021/11/02/marine-corps-commanders-form-letter-religious-exemptions/", "https://t.co/pqAEq59udB", "https://twitter.com/BreitbartNews/status/1513671511126814725?ref_src=twsrc%5Etfw", "http://www.twitter.com/kristina_wong", "https://www.facebook.com/kristinawongreporting"], "authors": [], "publish_date": null}