{"result_id": "051051", "URL": "https://www.blacklistednews.com/article/84311/the-cdcs-vaccine-misinformation.html", "timestamp": "2023-04-25 12:19:55 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.blacklistednews.com/images/tabicon.ico", "canonical": "https://www.blacklistednews.com/article/84311/the-cdcs-vaccine-misinformation.html", "encoding": "utf-8"}, "image": null, "domain": "www.blacklistednews.com", "title": "The CDC's Vaccine \"Misinformation\" List", "cleaned_text": "One of the most important findings of the Twitter Files was an email from Stanford’s Virality Project (the favored “disinformation experts” of the Biden White House, the CDC, and the US Surgeon General), which discussed the potential removal of “True content which might promote vaccine hesitancy.”\n\nThis would include “stories of true vaccine side effects” – information that is not “mis or disinformation” but may be “malinformation” that is “exaggerated or misleading”. The Virality Project, like its clients and supporters within the US government, was concerned that these true social media posts “could fuel [vaccine] hesitancy.”\n\nAs the Twitter files have exposed the censors to sunlight, and as evidence of the public-private censorship efforts have been exposed in Louisiana v. Biden (which we discussed at length here), questions have remained about the specific content – the posts and the videos – that caught the government’s interest.\n\nWe now have more answers.\n\nWe have obtained just a sampling of the CDC’s “Weekly Social Listening Report,” distributed by the National Center for Immunization and Respiratory Diseases (NCIRD), a division of the CDC whose focus of late has been awarding billions of dollars in funding to further COVID-19 vaccines for children.\n\nWhat do these reports reveal? That the CDC was very interested in tracking (and likely curbing) “misinformation” that would either contribute to vaccine hesitancy or cause doubts about the effectiveness of COVID-19 vaccines.\n\nTo compile these reports, the government conducted what it called “social listening” that involved the daily monitoring of social media and “private messaging apps” to track “emerging misinformation about the COVID-19 vaccine.” Here’s their methodology from a late November 2021 report:\n\nThe CDC put together this research by targeting specific keywords and hashtags and to report back on how those trended. It targeted rallying cries like “#righttochoose” and “Medical freedom” and “personal choice” and “no mask” – messages that relate to the right of the individual to choose – and labeled those “Anti-Vax.” Discussions about “vaccine injury” and learning the risk of vaccines (#learntherisk), spurred in large part by COVID-19 vaccine mandates all across the country, were also considered “Anti-Vax.”\n\nMore problematic, and more concerning for those who oppose government censorship, was the fact that the CDC was targeting true content as part of the broader social media “misinformation” trends.\n\nOn TikTok, for example, the account MuumboJumbo had legitimate questions about who was spreading COVID-19. As we have known for quite some time, vaccination does not prevent transmission. Yet here was the CDC, stating this TikTok user “promoted COVID-19 vaccine hesitancy by saying there’s no way to know who is spreading COVID-19, vaccinated or unvaccinated.”\n\nIt turns out that after that video was posted, user MuumboJumbo was banned from TikTok. Coincidence, or something else?\n\nTikTok user do0rs also made it to the “disinformation” list. This was for diminishing the “threat of the omicron variant while making a political assertion against one of the two major parties in the U.S.”\n\nAccording to what appears to be her new account, this user was suspended (by our calculation, sometime after posting the offending video). As to the political party she criticized? It’s safe to assume it was the Democrats - meaning the CDC is now keeping tabs on social media users critical of the party in power. \n\n\n\nThe TikTok “Misinformation Trends” also included a woman (another suspended account) who celebrated the stay of COVID-19 vaccine mandates and comedian Tyler Fischer who joked that he got the “Freedom variant” in Texas.\n\n\n\nHere’s his offending video. Safe to say the CDC doesn’t have a sense of humor:", "opengraph": {"image": "https://substackcdn.com/image/fetch/w_1200,h_600,c_limit,f_jpg,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F062da163-ce05-4d1a-b7ca-c9cbb4dc797e_1181x358.png"}, "tags": ["Motherboard"], "tweets": ["<blockquote class=\"twitter-tweet\">&#13;\n<p dir=\"ltr\" lang=\"en\">5.Just before <a href=\"https://twitter.com/ShellenbergerMD?ref_src=twsrc%5Etfw\">@ShellenbergerMD</a> and I testified in the House last week, Virality Project emails were found in the <a href=\"https://twitter.com/hashtag/TwitterFiles?src=hash&amp;ref_src=twsrc%5Etfw\">#TwitterFiles</a> describing “stories of true vaccine side effects” as actionable content. <a href=\"https://t.co/dKxTnxDc3a\">pic.twitter.com/dKxTnxDc3a</a></p>&#13;\n— Matt Taibbi (@mtaibbi) <a href=\"https://twitter.com/mtaibbi/status/1636729177511456770?ref_src=twsrc%5Etfw\">March 17, 2023</a></blockquote>&#13;\n"], "movies": [], "links": ["https://twitter.com/ShellenbergerMD?ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/TwitterFiles?src=hash&ref_src=twsrc%5Etfw", "https://t.co/dKxTnxDc3a", "https://twitter.com/mtaibbi/status/1636729177511456770?ref_src=twsrc%5Etfw", "https://technofog.substack.com/p/censorships-three-headed-monster", "https://www.tiktok.com/@4do0rs1", "https://www.tiktok.com/@tythefisch", "https://www.tiktok.com/@tythefisch/video/7036419925329775919", "https://www.tiktok.com/@tythefisch", "https://www.tiktok.com/@tythefisch/video/7036419925329775919", "https://enable-javascript.com/"], "authors": [], "publish_date": null}