{"result_id": "051021", "URL": "https://www.blacklistednews.com/article/77874/lawsuit-filed-against-merck-for-lying-to-doctors--moms-about-the-hpv-gardasil.html", "timestamp": "2023-04-25 12:19:44 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.blacklistednews.com/images/tabicon.ico", "canonical": "https://www.blacklistednews.com/article/77874/lawsuit-filed-against-merck-for-lying-to-doctors--moms-about-the-hpv-gardasil.html", "encoding": "utf-8"}, "image": null, "domain": "www.blacklistednews.com", "title": "Lawsuit Filed Against Merck For Lying To Doctors & Moms About The HPV Gardasil Vaccine", "cleaned_text": "Attorneys Bijan Esfandiari, Nicole K. H. Maldonado, Michael L. Baum, co-counsel Robert F. Kennedy, Jr and local counsel Christopher E. Hultquist of Hultquist Law in Providence, filed the lawsuit in U.S. District Court for the District of Rhode Island on behalf of Ms. Balasco, who alleges her vaccine injuries were so severe and debilitating, she was physically unable to attend most of high school. The case number is 1:20-cv 00364.\n\nApparently, Merck failed to properly test Gardasil before the HPV vaccine was fast-tracked and then administered to millions of young girls and boys throughout the world. Furthermore, Merck knew or had reason to know that its vaccine was not even effective but did not warm the medical community nor the public. “The company wrongfully concealed information and further made false statements concerning the safety and efficacy of Gardasil.”\n\nWhy This Is Important: This is important because it’s not an isolated incident. Injuries as a result of HPV vaccination have happened quite a bit, and that includes deaths. The HPV vaccine has constantly come under the scrutiny of published peer-reviewed science by a number of independent researchers.\n\nFor example, a study published in Clinical Rheumatology exposes how vaccine manufacturers used phoney placebos in clinical trials to conceal a wide range of devastating risks associated with HPV vaccines. Instead of using genuine inert placebos and comparing health impacts over a number of years, as is required for most new drug approvals, Merck and GlaxoSmithKline spiked their placebos with a neurotoxic aluminum adjuvant and cut observation periods to a matter of months.\n\nMary Holland, Mary Holland, J.D., who recently retired as the directer of the NYU School of Law actually published a book about this type activity by big pharma. The book is called “The HPV Vaccine On Trial: Seeking Justice For A Generation Betrayed.”\n\nAgain, there are multiple examples of HPV vaccine injuries, which is why Japan, for example, stopped recommending it. “Sacrificial Virgins” is one of multiple films to tackle an issue that continues to largely go unacknowledged and it provides more examples.\n\nJennifer Robi is a 24-year-old former athlete and scholar who has been confined to a wheelchair since receiving her third Gardasil vaccines at age sixteen. She suffers continual uncontrolled neuro/muscular contractions (jerking) and postural orthostatic tachycardia syndrome (POTS) and many other symptoms of systemic autoimmune dysregulation. You can read more about that story here.\n\nA new study published in The Royal Society of Medicine is one of multiple studies over the years that has emerged questioning the efficacy of the HPV vaccine. The researchers conducted an appraisal of published phase 2 and 3 efficacy trials in relation to the prevention of cervical cancer and their analysis showed “the trials themselves generated significant uncertainties undermining claims of efficacy” in the data they used. The researchers emphasized that “it is still uncertain whether human papillomavirus (HPV) vaccination prevents cervical cancer as trials were not designed to detect this outcome, which takes decades to develop.” The researchers point out that the trials used to test the vaccine may have “overestimated” the efficacy of the vaccine.The authors point out that it was even questionable whether or not the vaccine prevents pre-cancerous lesions, let alone cancer. You can read more about this specific story here.\n\nIn fact, there is evidence suggesting that cervical cancer rates have increased since the introduction of the vaccine, and we already know that if a woman has been exposed to an HPV infection before the vaccine, their chances of developing cancer from the vaccine increase by nearly 50 percent.\n\nI also recently wrote about The mother and father of Christopher Bunch, at the time a 14 year old boy, who claim that he died as a direct result of the HPV vaccine. The family recently received a letter back from Merck, the manufacturer of the vaccines. You can read more about that story here.\n\nAnother one we’ve written about is Colton Barrett, who took his own life after being unable to cope with his Gardasil vaccine injuries. You can read more about that and watch an interview with him here.\n\nA study published in 2013 in Current Pharmaceutical Design carried out a review of HPV vaccine pre- and post-licensure trials to assess the evidence of their effectiveness and safety. They found that:\n\nHPV vaccine clinical trials design, and data interpretation of both efficacy and safety outcomes, were largely inadequate. Additionally, we note evidence of selective reporting of results from clinical trials (i.e., exclusion of vaccine efficacy figures related to study subgroups in which efficacy might be lower or even negative from peer-reviewed publications). Given this, the widespread optimism regarding HPV vaccines long-term benefits appears to rest on a number of unproven assumptions (or such which are at odds with factual evidence) and significant misinterpretation of available data. For example, the claim that HPV vaccination will result in approximately 70% reduction of cervical cancers is made despite the fact that the clinical trials data have not demonstrated to date that the vaccines have actually prevented a single case of cervical cancer (let alone cervical cancer death), nor that the current overly optimistic surrogate marker-based extrapolations are justified. Likewise, the notion that HPV vaccines have an impressive safety profile is only supported by highly flawed design of safety trials and is contrary to accumulating evidence from vaccine safety surveillance databases and case reports which continue to link HPV vaccination to serious adverse outcomes (including death and permanent disabilities). We thus conclude that further reduction of cervical cancers might be best achieved by optimizing cervical screening (which carries no such risks) and targeting other factors of the disease rather than by the reliance on vaccines with questionable efficacy and safety profiles.\n\nThen we have the issue of aluminum, which the HPV vaccine has much of.\n\nMany people claim that the amount of aluminum we take in from other sources is greater than the aluminum in vaccines, but fail to realize that the aluminum we take into our body from vaccines may not exit our body. Professor Christopher Shaw from the University of British Columbia in Canada explains that injected aluminum doesn’t come into the same methods of excretion as the aluminum we take in from food, for example. When we inject aluminum, it stays in the body, it may cross the blood brain barrier, enter into cells and various organs in the body.\n\nIn 2018, shaw published a paper in the Journal of Inorganic Biochemistry that found almost 100 percent of the intramuscularly injected aluminum in mice as vaccine adjuvants was absorbed into the systemic circulation and traveled to different sites in the body such as the brain, the joints, and the spleen where it accumulated and was retained for years post-vaccination. (source)\n\nA group of scientists from multiple countries recently published a paper in the Journal of Trace Elements in Medicine and Biology titled “The role of aluminum adjuvants in vaccines raises issues that deserve independent, rigorous and honest science.” In their publication, they provide evidence for their position that “the safety of aluminium-based vaccine adjuvants, like that of any environmental factor presenting a risk of neurotoxicity and to which the young child is exposed, must be seriously evaluated without further delay, particularly at a time when the CDC is announcing a still increasing prevalence of autism spectrum disorders, of 1 child in 54 in the USA.”\n\nYou can read more specifically about aluminum, here.\n\nThe Takeaway: At the end of the day it’s quite clear that vaccines are not a one size fits all product, this is why evident by the fact that nearly $4 billion has been paid out to families of vaccine injured children via the National Childhood Vaccine Injury Act (NCVIA). As astronomical as the monetary awards are, they’re even more alarming considering that only an estimated 1% of vaccine injuries are even reported to the Vaccine Adverse Events Reporting System (VAERS).\n\nIf the numbers from VAERS are correct – only 1% of vaccine injuries are reported and only 1/3 of the petitions are compensated – then up to 99% of vaccine injuries go unreported and the families of the vast majority of people injured by vaccines are picking up the costs, once again, for vaccine makers’ flawed products. According to a MedAlerts search of the FDA Vaccine Adverse Event Reporting System (VAERS) database, as of 2/5/19, the cumulative raw count of adverse events from measles, mumps, and rubella vaccines alone was: 93,929 adverse events, 1,810 disabilities, 6,902 hospitalizations, and 463 deaths.\n\nThese are liability free products that are being mandated on us. Should freedom of choice not always remain when it comes to substances we put into our own body? Are unvaccinated children and people really a threat to vaccinated ones?\n\nThese are important questions to ask and answer. Perhaps what we are being told and marketed heavily with is not always true.", "opengraph": {"image": "https://cdn2.collective-evolution.com/assets/uploads/2020/08/MERCK-1000x600.jpg"}, "tags": ["Motherboard"], "tweets": [], "movies": [], "links": ["https://www.baumhedlundlaw.com/attorneys/bijan-esfandiari/", "https://www.baumhedlundlaw.com/attorneys/nicole-k-h-maldonado/", "https://www.baumhedlundlaw.com/attorneys/michael-l-baum/", "https://www.baumhedlundlaw.com/toxic-tort-law/robert-f-kennedy-jr/", "http://www.hultquist-law.com/index.html", "https://www.baumhedlundlaw.com/pdf/Gardasil/Complaint-Court-Stamped-Balasco-v-Merck-1-20-cv-00364-8-19-20.pdf", "https://pubmed.ncbi.nlm.nih.gov/28730271/", "https://www.amazon.ca/HPV-Vaccine-Trial-Generation-Betrayed/dp/1510710809", "https://www.collective-evolution.com/2019/11/04/sacrificial-virgins-a-must-see-documentary-about-young-girls-being-severely-damaged-by-hpv-vaccines/", "https://www.collective-evolution.com/2019/01/30/athlete-confined-to-wheelchair-after-her-third-gardasil-vaccine-takes-merck-to-court/", "https://journals.sagepub.com/doi/10.1177/0141076819899308", "https://www.collective-evolution.com/2020/02/07/new-hpv-vaccine-study-explains-why-its-uncertain-if-the-vaccine-even-prevents-cervical-cancer/", "https://www.collective-evolution.com/2019/02/22/doctor-explains-how-the-hpv-vaccine-is-linked-to-a-rise-in-cervical-cancer-rates/", "https://www.collective-evolution.com/2019/10/10/gardasil-vaccine-found-to-increase-cervical-cancer-risk-by-44-6-in-women-already-exposed-to-hpv/", "https://www.collective-evolution.com/2020/03/02/he-died-as-a-direct-result-of-the-hpv-vaccine-mother-of-deceased-teenager-claims-update/", "https://www.collective-evolution.com/2018/01/08/colten-berrett-dies-from-his-gardasil-hpv-vaccine-injuries-one-of-multiple-deaths-reported/", "https://www.ncbi.nlm.nih.gov/pubmed/23016780", "https://childrenshealthdefense.org/news/gardasil-lawsuit-claims-hpv-vaccine-caused-teen-severe-injuries/", "https://www.baumhedlundlaw.com/prescription-drugs/gardasil-lawsuit-hpv-vaccine/gardasil-ingredients-adjuvants/", "https://www.youtube.com/watch?v=FfTo35UrFPA", "https://www.sciencedirect.com/science/article/pii/S0162013417304749", "https://www.sciencedirect.com/science/article/pii/S0946672X20301978", "https://www.ncbi.nlm.nih.gov/pubmed/26082187", "https://www.collective-evolution.com/2020/08/22/scientists-call-for-safety-testing-of-aluminum-based-vaccine-adjuvants/", "https://www.justice.gov/civil/vicp", "https://healthit.ahrq.gov/sites/default/files/docs/publication/r18hs017045-lazarus-final-report-2011.pdf", "https://vaers.hhs.gov/", "https://medalerts.org/vaersdb/index.php"], "authors": [], "publish_date": null}