{"result_id": "051043", "URL": "https://www.blacklistednews.com/article/84393/the-fiercest-vaccine-advocates-are-starting-to-admit-the-truth-about-the.html", "timestamp": "2023-04-25 12:19:52 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.blacklistednews.com/images/tabicon.ico", "canonical": "https://www.blacklistednews.com/article/84393/the-fiercest-vaccine-advocates-are-starting-to-admit-the-truth-about-the.html", "encoding": "utf-8"}, "image": null, "domain": "www.blacklistednews.com", "title": "The fiercest vaccine advocates are starting to admit the truth about the mRNAs", "cleaned_text": "Even the New York Times can’t hide reality about the mRNA jabs forever.\n\nLast week, the Times published an article headlined, “Should You Get Another Covid Booster?”\n\nThe article’s subheadline noted “Britain and Canada have authorized another round of booster shots,” implying the United States has somehow been negligent in not doing so.\n\nAnd the piece was written by Apoorva Mandavilli, among the worst Covid reporters. So I assumed the article would be filled with the usual nonsense, especially since the first person Mandavilli quoted was Dr. Celine Gounder, who has loudly pushed mRNA jabs.\n\nAfter Gounder’s husband died of an aortic aneurysm, she lashed out in January at mRNA skeptics (including me) who questioned if the shots might be linked to his death - even though doctors have repeatedly reported cases of post-jab aneurysms.\n\nIn her January piece, Gounder even complained Congress’s repeal of the armed forces Covid vaccine mandate “threatens military readiness.” (Nonsense, of course. Frontline soldiers and Marines are young, fit, and healthy, putting them at far higher risk from mRNA-related myocarditis than Covid itself.)\n\nSo I was stunned that Gounder offered the most tepid possible recommendation for further mRNA doses to Mandavilli.\n\nMost people should not have boosters, even once a year, she said. She endorsed regular shots only for “immunocompromised people and people in nursing homes.”\n\nThe real tell there is “nursing homes.”\n\nIn mentioning them, Gounder was not suggesting that everyone over 65 - or even 85 - should get more shots. Nursing homes are effectively hospices for most residents. About one-third of their residents die each year, a 2018 study found; a 2010 study had even grimmer findings, reporting a median survival of five months after admission.\n\nWhat Gounder was saying that only the very frail - who likely have little risk or benefit from the shots (or, in reality, any medical intervention) - should still receive them regularly.\n\nIn contrast, in October, Gounder offered very different advice, recommending boosters for everyone over age 50 “as soon as possible.”\n\nGounder’s rejection of annual boosters is particularly stunning because she and other public health specialists happily promote annual flu jabs despite their demonstrated uselessness. The theory seems to be that flu shots get old folks out of the house, or boost Walgreen’s profits, or something. Anyway they probably don’t do any harm even if they don’t do any good, so why not?\n\nYet Gounder is no longer applying the same logic to the mRNAs. I do not think that annual boosters for everyone makes sense.\n\nWhich implies either Covid is now even less dangerous than the flu (possible but unlikely), or the shots are even more useless (which would imply negative efficacy), or else… they’re actually more dangerous than inactivated virus flu jabs.\n\nWhich they are.\n\nBut Gounder was not the only vaccine advocate quoted in the Times piece. Mandavilli also talked to Dr. Paul Offit. No one will ever confuse Offit with Robert F. Kennedy Jr. - he is director of the Vaccine Education Center at Children’s Hospital of Philadelphia.\n\nIn April 2021, Offit had this to say about the mRNA jabs:\n\nCertainly, no one would have predicted that these mRNA vaccines would have worked as well or been as safe as they are… I don’t think you could have devised a vaccine that appears to be more perfect.\n\nLess than two years later, Offit rejected more doses of those “perfect” vaccines.\n\nFor everyone. Even the immunocompromised.\n\nBut even more stunning than Offit’s rejection were the words he used:\n\n“Given the lack of data, I don’t think it’s fair to say to people, ‘Inject yourself with a biological agent,’” said Dr. Paul Offit.\n\nVaccine advocates strenuously avoid this kind of language, for obvious reasons.\n\nBut the failure of the mRNAs is now so obvious that Offit and his fellow vaccine advocates have no choice but to try to ring-fence it if they want to save other jabs.", "opengraph": {"image": "https://cdn.pixabay.com/photo/2021/01/17/22/03/vaccine-5926664_960_720.jpg"}, "tags": ["Motherboard"], "tweets": [], "movies": [], "links": ["https://www.nytimes.com/2023/03/24/health/covid-booster-older-immunocompromised.html", "https://alexberenson.substack.com/subscribe?utm_source=menu&simple=true&next=https%3A%2F%2Falexberenson.substack.com%2Fp%2Fthe-fiercest-vaccine-advocates-are", "https://theathletic.com/4001302/2022/12/14/grant-wahl-death-cause-soccer/", "https://www.nytimes.com/2023/01/08/opinion/grant-wahl-celine-gounder-vaccine.html", "https://journals.lww.com/pidj/Fulltext/2023/03000/Multiple_MIS_C_Readmissions_and_Giant_Coronary.15.aspx", "https://www.sciencedirect.com/science/article/pii/S1344622322001420", "https://www.nature.com/articles/s41467-022-31401-5", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6143238/", "https://agsjournals.onlinelibrary.wiley.com/doi/abs/10.1111/j.1532-5415.2010.03005.x", "https://khn.org/news/article/covid-spike-fall-tips-omicron-booster-flu-vaccine/", "https://twitter.com/celinegounder/status/1441111373379817482?lang=en", "https://www.acpjournals.org/doi/abs/10.7326/m19-3075", "https://www.healio.com/news/infectious-disease/20210419/past-research-and-unlimited-resources-spur-fast-development-of-covid19-vaccines"], "authors": [], "publish_date": null}