{"result_id": "051015", "URL": "https://www.blacklistednews.com/article/84461/monkeypox-and-leaky.html", "timestamp": "2023-04-25 12:19:42 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.blacklistednews.com/images/tabicon.ico", "canonical": "https://www.blacklistednews.com/article/84461/monkeypox-and-leaky.html", "encoding": "utf-8"}, "image": null, "domain": "www.blacklistednews.com", "title": "Monkeypox and leaky vaccines", "cleaned_text": "Sixth essay in a series, each image is linked to the corresponding article:\n\nYesterday April 04, 2023, we had the next chapter drop in the predictable story line of the great Monkeypox (now officially named M-Pox) global health crisis of 2022. Shout out to Louisa Clary for forwarding her Tweet (hotlinked) from yesterday and bringing this to my attention. Ms. Clary is the Executive Director of the Vaccine Safety Research Foundation @VacSafety and Co-Organizer of Defeat The Mandates @dchomecoming . As you can see from the dataplot (from our world in data) at the top of this essay, the global spread of Monkeypox is most readily described as the logical consequence of the introduction of the virus into the largest Gay rave party in the world, followed by a diaspora into nations with substantial populations who participated in that event, followed by the emergence and logical time course of subsequent infections as the asymptomatic incubation phase and then natural history of the infectious phase in that population played out its predictable epidemiological progression.\n\nAs discussed in the essays which are linked above, the WHO and its Director General, as well as the US HHS, overreacted in an arbitrary and capricious manner, overruling the second panel of experts convened to determine whether this outbreak represented a global health threat. Mr. Tedros declared the vote of 9 (against declaration) to 6 (in favor) a tie requiring his intervention and unilateral declaration that this outbreak did represent a global (and US) health crisis.\n\nFor anyone following the issue of the (US HHS) proposed International Health Regulations “updates” which are pending, and which “alarmists” such as myself have been warning represent a significant threat to both national and individual sovereignty, this sordid affair clearly demonstrates that no-one can trust the WHO and its Director General to act in a calm, rational, objective manner in declaring national or global health emergencies which in turn would be weaponized to justify imposition of required interventions (jabs or other medical procedures, or pretty much anything they want) with enforcement by the World Trade Organization (which is one of the UN’s globalist enforcement arms).\n\nIn the face of this “crisis” of Monkeypox, we saw widespread deployment of a leaky and toxic “third generation” vaccine designed for preventing human Smallpox (an extinct virus) which the US Government had purchased, stockpiled, and then insisted (presciently before the Mpox outbreak based on very little data) be re-labeled as also indicated for prevention of Monkeypox infection. Sound familiar? And of course there was an Event 201-like war game planning event (held in Germany this time) preceding this “outbreak”, based on a scenario which somehow predicted the Mpox outbreak almost to the day. Corporate media and factcheckers will be glad to reassure you that this was purely a coincidence.\n\nAnd now, wait for it, we have the apparent emergence of a cluster of vaccine-resistant Mpox virus recently detected in France among a highly vaccinated sexually active population of men who have sex with men (MSM). Who could have predicted that deploying a leaky vaccine into a susceptible population during a viral outbreak would drive development of vaccine resistant mutant viruses?\n\nPretty much anyone with half a brain that has been paying attention over the last three years of the COVIDcrisis. As well as any viral immunologist that is not bought off or otherwise compromised with COI from the vaccine cartel. However, Dr. Eric Feigel-Ding is shocked, shocked I tell you!\n\nAnyone who was paying attention during the decades of failed attempts to develop and clinically test an AIDS vaccine (based on the thesis that HIV is the sole cause of AIDS) is aware that clinical development and deployment of vaccines for sexually transmitted diseases is complicated by a fundamental paradox. When someone is at high risk (due to their sexual behaviors and/or preferences) for becoming infected with an STD accepts a vaccine for that disease, the mere act of vaccination may increase the behavior associated with spread of the STD under the assumption that they are now protected from the STD pathogen. So this mindless, kneejerk response to a public health crisis (which ended up being largely self-limiting) of panic deployment of a leaky toxic vaccine into a susceptible population may have both increased the risk of transmission (due to behavioral changes) as well as acting to select for more vaccine resistant virus.\n\nFrom this you can see why I sometimes despair for the fate of humanity at the hands of ignorant, arrogant globalists and their hack administrative state bureaucrats. I am reminded of the wisdom of three great 20th century thinkers:\n• There was no global or national US health crisis associated with Mpox. It was all an overreaction, the case fatality rate was extremely low, and the infection and disease was almost exclusively confined to a small but vocal and politically influential cohort of men who have sex with men.\n• STD vaccination policy is very complicated, particularly in behavioral cohorts associated with large numbers of sexual partners. If you are going to deploy a vaccine into such a cohort, it has better be a pretty good one, as the vaccinated are likely to believe that they now have complete protection against the risk of that STD and may actually increase their participation in high risk behaviors such as unprotected intercourse with others.\n• Deployment of a leaky, ineffective vaccine into an ongoing infectious disease outbreak is a very bad idea due to the risk of selection of vaccine resistant (escape) mutant pathogens (viruses). However, panic and a sense of political pressure to “do something” repeatedly results in bad public policy decision making and counterproductive public health policies. Fear is indeed the mind killer.\n• We cannot “trust” the World Health Organization OR the US Department of Health and Human Services to make rational, mature, intelligent, informed, and dispassionate infectious disease threat assessments and policy decisions. Therefore we cannot allow the proposed “International Health Regulations” modifications to proceed to authorization.\n• Those who exploit public health for profit and power are evil. And their evil actions often stem from a failure to think and to recognize risks of unintended consequences (blowback). See this hotlinked Substack essay (below) for further thoughts on this point.\n• The corporate media is amazingly clueless about public health, infectious disease, and pretty much all else. As usual. Not the sharpest tools in the shed. I suppose all the smart ones have already migrated into trading crypto, getting an MBA or JD, or committing professional suicide if they have any fragments of a moral compass left in their souls. You can file the above under the heading “self evident”. And please send a copy of this essay to your favorite corporate media “advocacy journalist”, addressed from Robert Malone, with love. After all, what would I do for a living without them?\n\nAn investigation has been launched in France after 59 per cent of people in a new monkeypox cluster claimed to be fully vaccinated. While the jab does not offer complete protection against the disease, usually only 25 per cent of French cases are in vaccinated individuals. The high vaccine rate in the Centre-Val de Loire cluster – 10 of 17 – has sparked fears of a mutation. Monkeypox – now officially named mpox – causes a blistering rash, fever, chills, exhaustion, and muscle aches. It is passed from person to person through close physical contact, and touching infected clothing, bedding or towels. While most commonly found in west and central Africa, the disease made headlines in 2022 when an outbreak was declared across Europe and the US. Since spring 2022, a total of 25,843 cases have been identified across the European region, mostly among men who have sex with men. Globally, more than 85,000 cases have been reported in locations that have not historically recorded the disease. Those affected in the current French cluster are all men aged between 24 and 56. “No parties or events common to the cases have been identified,\" the French health authority said. “No person has required hospitalisation.” The investigation could throw up several possible explanations, according to Dr Michael Marks, Associate Professor at the London School of Hygiene and Tropical Medicine. “First we need to understand when these individuals were vaccinated and with what dose,” Dr Marks said. “We know it takes a number of weeks for the body to mount a response and that translates to protection. When did they have the vaccine?” If a long stretch of time has passed since vaccination, the health authority will need to assess if the vaccine has waned. The health authority also needs a better understanding of the make-up of the cluster, he said. “Is the group different in some way? Is there any reason they may not have responded to the vaccine well?” Dr Michael asked. “A large proportion of mpox has occurred in people with HIV. HIV may modify how effective the vaccine is. We don’t know the HIV status of this cluster at the moment.” If these options are ruled out, Dr Marks said that the health authority will then assess whether there has been a mutation in the virus which has affected the effectiveness of the vaccine. The investigation is under way, and the French health authority told The Telegraph that it is waiting on “robust data on the real-life efficacy” of the vaccine. Ultimately, however, Dr Marks said there may not be a clear explanation. “It is important to go through the steps of unpicking,” he said. “But the vaccine isn’t 100 per cent effective, and sometimes you will just see a number of cases in the vaccinated.” What do we know about the vaccine? There is no specific mpox vaccine; instead a smallpox vaccine is used, known as Imvanex or Jynneos. In the UK and Europe, this has been offered to people at higher risk of exposure, and those who have contact with confirmed cases. “Although people refer to the vaccine as the mpox vaccine, it is a smallpox vaccine,” said Dr Marks. “We have historically believed that the smallpox vaccine provides good protection against mpox.” Smallpox is in the same viral family as mpox, and its vaccine has been used successfully in previous mpox outbreaks. However, data is lacking. “This is the third generation vaccine, and so even our historic data comes from a different smallpox vaccine,” said Dr Marks. “There have been a number of observational studies that show the vaccine provides some but not complete protection.” One observational UK study found 75 per cent protection after a single dose, he said. The French health authority told the Telegraph it is waiting for “robust data” on the “real-life efficacy of mpox vaccines”. The European outbreak peaked in July 2022, with tens of thousands of cases occurring in a relatively short time period. Since then, cases have declined rapidly. In the first two months of 2023 there was less than one case a fortnight in the UK. “That pattern is broadly consistent across much of Europe,” said Dr Marks. Deaths in Europe have been low throughout the outbreak, with six reported among tens of thousands of cases over the past six months. Nonetheless, Sante Publique France, the French health authority, warned those at risk to be vigilant as Pride season approaches. “The cluster currently monitored in the Centre Val de Loire region calls for vigilance as the season of international MSM festivals and pride marches approaches,” it said.", "opengraph": {"image": "https://substackcdn.com/image/fetch/w_1200,h_600,c_limit,f_jpg,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F22d1de91-adab-4496-b12f-46cc9f39ba9a_2028x1314.png"}, "tags": ["Motherboard"], "tweets": [], "movies": [], "links": ["https://twitter.com/VacSafety", "https://twitter.com/dchomecoming", "https://www.youtube.com/watch?v=SjbPi00k_ME", "https://www.goodreads.com/work/quotes/1023716", "https://www.goodreads.com/work/quotes/3634639", "https://rwmalonemd.substack.com/p/the-banality-of-evil", "https://www.telegraph.co.uk/news/2022/11/28/monkeypox-renamed-racism/", "https://www.telegraph.co.uk/news/0/monkeypox-virus-what-symptoms-treatments-uk-cases/", "https://www.telegraph.co.uk/news/2022/07/30/monkeypox-could-signal-dawn-new-sti-men-uncontrolled-global/", "https://www.telegraph.co.uk/news/2022/08/22/no-vaccine-monkeypox-case-contacts-supplies-run-low/"], "authors": [], "publish_date": null}