{"result_id": "051017", "URL": "https://www.blacklistednews.com/article/79099/merck-scraps-covid-vaccines-says-its-more-effective-to-get-the-virus-and.html", "timestamp": "2023-04-25 12:19:42 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.blacklistednews.com/images/tabicon.ico", "canonical": "https://www.blacklistednews.com/article/79099/merck-scraps-covid-vaccines-says-its-more-effective-to-get-the-virus-and.html", "encoding": "utf-8"}, "image": null, "domain": "www.blacklistednews.com", "title": "Merck Scraps COVID Vaccines; Says It’s More Effective To Get The Virus And Recover", "cleaned_text": "Vaccine manufacturer Merck has abandoned development of two coronavirus vaccines, saying that after extensive research it was concluded that the shots offered less protection than just contracting the virus itself and developing antibodies.\n\nThe company announced that the shots V590 and V591 were ‘well tolerated’ by test patients, however they generated an ‘inferior’ immune system response in comparison with natural infection.\n\nThe company stated that instead it will focus on research into therapeutic drugs labeled as MK-7110 and MK-4482.\n\nThe drugs aim to protect patients from the damage of an overactive immune response to the virus.\n\n“Interim results from a Phase 3 study showed a greater than 50 percent reduction in the risk of death or respiratory failure in patients hospitalized with moderate to severe COVID-19,” the company’s statement noted of the MK-7110 drug.\n\nMerck is to receive around $356 million from the US government to fast-track production of the potential treatments under Operation Warp Speed.\n\nChief Marketing Officer Michael Nally recently told Bloomberg that Merck is aiming to produce some 20 million courses of the MK-4482 drug, an oral antiviral which patients will take twice a day for five days.\n\nMeanwhile, in related news, German scientists have claimed that the UK Oxford/AstraZeneca vaccine is less than 8% effective in over 65s, prompting the vaccine developers to hit back, rubbishing the claims.\n\nThe German media published the claims, alleging it had been ‘confirmed’ by ‘multiple’ unnamed senior German government sources.\n\nUK government ministers have suggested that the claim could be related to the ongoing dispute over delivery of the vaccine between the European Union and AstraZeneca.\n\nThe EU, which is yet to approve the vaccine, has threatened to block exports of shots to Britain, in a move that has been branded ‘spiteful’ by British government sources.\n\nIn an effort to make sure its member states get their ‘fair share’ of vaccines, the EU has also threatened to block the delivery of Pfizer vaccines to the UK, demanding that drug companies provide detailed information on when they plan to export Covid jabs to countries outside the bloc.", "opengraph": {"image": "https://cdn.summit.news/2021/01/GettyImages-1222964736.jpg"}, "tags": ["Motherboard"], "tweets": [], "movies": [], "links": ["https://www.merck.com/news/merck-discontinues-development-of-sars-cov-2-covid-19-vaccine-candidates-continues-development-of-two-investigational-therapeutic-candidates/", "https://www.bloomberg.com/news/articles/2021-01-25/merck-shuts-down-covid-vaccine-program-after-lackluster-data", "https://www.politico.com/", "https://www.dailymail.co.uk/news/article-9187425/Vaccine-battle-EU-threatens-BLOCK-Pfizer-jabs-going-UK.html"], "authors": [], "publish_date": null}