{"result_id": "051001", "URL": "https://www.blacklistednews.com/article/83986/who-shares-video-stating-online-antivaccine-activism-is-deadlier-than-global.html", "timestamp": "2023-04-25 12:19:35 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.blacklistednews.com/images/tabicon.ico", "canonical": "https://www.blacklistednews.com/article/83986/who-shares-video-stating-online-antivaccine-activism-is-deadlier-than-global.html", "encoding": "utf-8"}, "image": null, "domain": "www.blacklistednews.com", "title": "WHO shares video stating online “anti-vaccine activism” is deadlier than “global terrorism”", "cleaned_text": "According to the World Health Organization (WHO), online “anti-vaccine activism” is more dangerous than terrorism, nuclear proliferation, and gun violence.\n\n“We have to recognize that anti-vaccine activism, which I actually call anti-science aggression, has now become a major killing force globally,” said Baylor College of Medicine’s Dr. Peter Hotez, in a video shared by the WHO on Twitter.\n\nDr. Hotez continued to warn that anti-vaccine activism is “a killing force” that is more dangerous than “gun violence, global terrorism, nuclear proliferation, or cyberattacks.”\n\n“And now it’s become a political movement,” he continued. “In the U.S., it’s linked to far extremism on the far Right. Same in Germany. So this is a new face of anti-science aggression.”\n\nThe video concludes with Dr. Hotez saying: “And so we need political solutions to address this.”\n\nHotez has been a vocal critic of vaccine skepticism. In 2021, he wrote that opposing Covid measures was not only anti-science but also a form of “aggression,” which he blamed on conservative politicians, academics, and news outlets.\n\nIn a piece published by Nature Reviews Immunology in September 2022, Hotez said there was a need to seek “outside advice from experts in homeland security, justice, commerce, and even the US State Department,” as well as “the various United Nations agencies” to “protect” people from “anti-science” activists.\n\nIf you're tired of censorship, cancel culture, and the erosion of privacy and civil liberties subscribe to Reclaim The Net.", "opengraph": {"image": "https://reclaimthenet.org/wp-content/uploads/2023/01/whos-23.jpg"}, "tags": ["World Health Organization", "United Nations", "Germany"], "tweets": [], "movies": [], "links": ["https://reclaimthenet.org/topics/world-health-organization/", "https://video.reclaimthenet.org/articles/who-vax-terror-vid.mp4", "https://reclaimthenet.org/topics/germany/", "https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3001369", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9340755/pdf/41577_2022_Article_770.pdf", "https://reclaimthenet.org/topics/united-nations/", "https://reclaimthenet.org/subscribe"], "authors": [], "publish_date": null}