{"result_id": "051024", "URL": "https://www.blacklistednews.com/article/83764/pfizer-and-moderna-to-investigate-their-own-vaccines-for-myocarditis.html", "timestamp": "2023-04-25 12:19:45 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.blacklistednews.com/images/tabicon.ico", "canonical": "https://www.blacklistednews.com/article/83764/pfizer-and-moderna-to-investigate-their-own-vaccines-for-myocarditis.html", "encoding": "utf-8"}, "image": null, "domain": "www.blacklistednews.com", "title": "Pfizer And Moderna To Investigate Their Own Vaccines For Myocarditis Risks", "cleaned_text": "Why is Big Pharma investigating their own covid vaccines for myocarditis side effects if the vaccines were already supposedly tested and proven safe and effective?\n\nBoth Pfizer and Moderna have announced that they will be undertaking studies to determine the longer term risks of Myocarditis (an inflammatory condition of the heart which can lead to death) for people who have been injected with the mRNA based covid vaccines. The decision comes after the release of multiple medical studies which show a correlation and causation between the vaccines and an exponential increase in heart problems, specifically among men 40 years old and younger. Only a year ago the link between covid vaccinations and myocarditis was widely denied.\n\nStudies also show that myocarditis risk increases with the number of boosters a person has taken.\n\nBefore the year 2020, the average vaccine was tested and re-tested by pharmaceutical companies and the FDA for 10 to 15 years before it could be released to the public. This was done not only because testing is a complex process with a lot of red tape involved, but also because it is the only way to discover any long term side-effects that might be associated with a particular immunization product. If you read any medical journal or scientific outline on vaccine development published before 2020, they all agree that long term testing is necessary for public safety.\n\nSuddenly, after 2020 and the advent of public activism against the covid mandates, a host of medical “professionals” and bureaucrats began arguing that the mRNA vaccines do not need the same lengthy testing time frame because government funding allowed for everything to be accomplished much faster. This is a lie.\n\nWhat really happened? Governments fast tracked approval using national emergency measures allowing Big Pharma to skip necessary tests and trials. Example: Pfizer representatives recently admitted under oath that they never tested the covid vaccine to see if it actually prevented transmission of the virus. They simply claimed that it did without verification. And governments began trying to enforce vaccine requirements on the populace based on the false claim that vaccination stops the spread.\n\nMainstream media “fact checkers” insist that the covid vaccines were “initially effective” in preventing transmission of the original strains of the virus. There is no concrete evidence to confirm this. In fact, covid cases of the original variants began to plunge in the US and in other countries before the vaccines were widely distributed. This is a fact, and the incredible drop in cases was likely due to an increase in natural immunity within the population.\n\nSome government and Big Pharma funded scientists also argue that mRNA technology as a whole has been tested for many years. This is a dishonest misdirection. The technology and concept might have been tested in various experiments for years, but the specific covid vaccines were not, and this matters. Any scientist that says this claim is a foundation for safety confirmation for the vaccines should be ashamed of themselves.\n\nStudies which take natural immunity and asymptomatic reactions into account when determining vaccine efficacy are highly limited. There is no way to know if a person survived covid or avoided infection because they were vaccinated, or because they already had the virus, experienced minor symptoms or no symptoms, and developed natural immunity. Government paid virologists and scientists don't seem to care about testing the distinction. What we do know from various studies is that natural immunity is far superior in every way to mRNA vaccination.\n\nThe dangers of releasing a pharmaceutical cocktail for mass consumption or even forced mass consumption without long term study cannot be overstated. The bottom line? Given the current information, no one knows for sure what will happen in terms of vaccine effects over a long timeline (several years). Pharma companies don't know and governments don't know (if we take their production claims for the vaccines as accurate).\n\nIn all likelihood, Pfizer and Moderna are trying to get out ahead of burgeoning side effects with their own studies as a means to spin or mitigate bad press in the future. The chances of these studies providing honest data driven assessments are low.\n\nIt's been less than two years since widespread distribution of the covid vaccines and we are already seeing signs of negative health issues through myocarditis and blood clotting disorders. One has to wonder what further terrible developments will unfold for vaccinated people in another two years.", "opengraph": {"image": "https://assets.zerohedge.com/s3fs-public/styles/inline_image_mobile/public/inline-images/MyocarditismRNAvaccine%20text.jpg?itok=LswND7b9"}, "tags": ["Motherboard"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "100%", "height": "360", "embed_code": "<iframe src=\"//www.youtube.com/embed/mnxlxzxoZx0\" width=\"100%\" height=\"360\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"/>", "src": "//www.youtube.com/embed/mnxlxzxoZx0"}], "links": ["https://www.nbcnews.com/health/health-news/myocarditis-covid-vaccine-research-long-term-effects-rcna55666", "https://jamanetwork.com/journals/jama/fullarticle/2788346", "https://www.nature.com/articles/s41467-022-31401-5#Tab2", "https://www.tctmd.com/news/more-evidence-links-myocarditis-mrna-covid-19-vaccines", "https://www.zerohedge.com/s3/files/inline-images/MyocarditismRNAvaccine%20text.jpg?itok=LswND7b9", "https://www.ifpma.org/wp-content/uploads/2019/07/IFPMA-ComplexJourney-2019_FINAL.pdf", "https://www.statnews.com/2021/07/12/covid-19-decline-preceded-vaccines-still-need-jabs-finish-the-job/", "https://www.zerohedge.com/s3/files/inline-images/covid-chartprevax.jpg?itok=1y33Riol", "https://pubmed.ncbi.nlm.nih.gov/35380632/", "https://www.science.org/content/article/having-sars-cov-2-once-confers-much-greater-immunity-vaccine-vaccination-remains-vital"], "authors": [], "publish_date": null}