{"result_id": "051035", "URL": "https://www.blacklistednews.com/article/82200/newly-released-pfizer-documents-reveal-covid-jab.html", "timestamp": "2023-04-25 12:19:49 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.blacklistednews.com/images/tabicon.ico", "canonical": "https://www.blacklistednews.com/article/82200/newly-released-pfizer-documents-reveal-covid-jab.html", "encoding": "utf-8"}, "image": null, "domain": "www.blacklistednews.com", "title": "Newly Released Pfizer Documents Reveal COVID Jab Dangers", "cleaned_text": "In September 2021, a group called Public Health and Medical Professionals for Transparency (PHMPT) filed a Freedom of Information Act (FOIA) request with the U.S. Food and Drug Administration to obtain the documentation used to approve Comirnaty, including safety and effectiveness data, adverse reaction reports and lists of active and inactive ingredients. When, after a month, the FDA still had not responded to the FOIA request, the PHMPT sued.1 Pfizer and the FDA asked the judge to give them 75 years to release all the documents (doling out just 500 pages per month)2 but, fortunately, the judge ruled that they have to release them at a rate of 55,000 pages per month. In mid-November 2021, the FDA released the first 91 pages,3,4 which alone revealed the FDA has been aware of shocking safety issues since April 30, 2021. For nurse educator John Campbell, featured in the video above, these documents appear to have served as a \"red pill,\"5 waking him up to the possibility that the jabs may be far more dangerous than anyone expected, but he didn’t get around to reviewing them until now. Cumulatively, through February 28, 2021, Pfizer received 42,086 adverse event reports, including 1,223 deaths. The latest tranche of Pfizer documents also includes a whopping nine pages of recorded side effects — 158,000 in all! In his video, Campbell reviews the documents listed as \"5.3.6. Postmarketing Experience,\" which were originally marked \"confidential.\" They reveal that, cumulatively, through February 28, 2021, Pfizer received 42,086 adverse event reports, including 1,223 deaths. As noted by Campbell, \"It would have been good to know about this at the time, wouldn’t it?\" referring to the rollout of the jabs. Campbell has been fairly consistent in his support of the \"safe and effective\" vaccine narrative, but \"This has just destroyed trust in authority,\" he says. To have 1,223 fatalities and 42,086 reports of injury in the first three months is a significant safety signal, especially when you consider that the 1976 swine flu vaccine was pulled after only 25 deaths. Now, the number of doses shipped has been redacted under a FOIA redaction code that stands for \"Trade secrets and commercial or financial information obtained from a person and privileged or confidential.\" Why would the number of doses shipped be confidential? Campbell is clearly bothered by this redaction, as you cannot calculate the incidence rate or side effects if you don’t know what the denominator is. As noted by Campbell, that number cannot be proprietary. It’s being withheld for some other reason (and I just stated what that might be). Even without knowing the underreporting factor, Campbell is appalled by the number of reported side effects. It is very clear that this information red-pilled Campbell. For an overview of the types of side effects recorded, check out Campbell’s video. I’ve already reviewed that in previous articles. Here, we’ll move on to the first really large tranche of Pfizer documents, which was released March 1, 2022. In all, the FDA has some 450,000 pages of data from Pfizer’s COVID jab trials, and we now have just over 10,000 of those pages. You can find them all on PHMPT.org.6 March 7, 2022, investigative journalist Sonia Elijah published a review of her initial findings on Trial Site News,7 having glossed through some of the thousands of newly-released documents. Her review centers primarily on the case report forms (CRFs). These are documents used in clinical research to record standardized data from each patient, including adverse events. As such, they’re a crucial part of the clinical trial process. A majority of the CRFs in this release were from Ventavia-run trial sites. Ventavia is currently facing a lawsuit brought by Brook Jackson, a former Ventavia regional director. Jackson was fired shortly after she brought concerns about potential data falsification and poor laboratory management to the attention of the FDA and higher-ups in the company. Her testimony was published November 2, 2021, in The British Medical Journal — the oldest and most prestigious medical journal in the world — by investigative journalist Paul Thacker.8 Facebook fact checkers actually tried to \"debunk\" this BMJ article and censored it. In her review of the CRFs, Elijah found a number of errors and anomalies that seem to corroborate Jackson’s claims, including the following:9\n\nPatients entered into the \"healthy population\" group who were far from healthy — For example, one such \"healthy\" participant was a Type 2 diabetic with angina, a cardiac stent and a history of heart attack. Serious adverse event (SAE) numbers were left blank — Ventavia site No. 1085 has a particularly large number of missing SAE numbers. Missing barcodes for samples collected — Without those barcodes, you can’t match the sample to the participant. Suspicious-looking SAE start and end dates — For example, the so-called \"healthy\" diabetic suffered a \"serious\" heart attack October 27, 2020. The \"end\" date is listed as October 28, the next day, which is odd because it was recorded as serious enough to require hospitalization. Also, on that same day, October 28, the patient was diagnosed with pneumonia, so likely remained hospitalized. \"This anomaly raises doubt as to the accuracy of these recorded dates, potentially violating ALOCA-C clinical site documentation guidelines for clinical trials,\" Elijah writes. Unblinded teams were responsible for reviewing adverse event reports for signs of COVID cases, and to review severe COVID cases — Yet in some cases they appear to have dismissed the possibility of an event being COVID-related, such as pneumonia. This despite the fact that Pfizer’s protocol (section 8.2.4) lists \"enhanced COVID-19\" (i.e., antibody dependent enhancement) as a potential side effect to be on the lookout for. As noted by Elijah: \"Inadvertently, this could have led to bias, as the unblinded teams would have been aware which participants were assigned the placebo and those who received the vaccine. They might have been under pressure by the sponsor for the trial to go a certain way and for events like 'COVID Pneumonia’ to be classified simply as pneumonia.\" Impossible dating — The diabetic who suffered a heart attack followed by pneumonia (which may have been unacknowledged COVID pneumonia) died, and the date of death is listed as the day before the patient supposedly went for a \"COVID ill\" visit. Clearly, it’s impossible for a dead person to attend a medical visit, so something is wrong here. The clinical investigator note states: \"There cannot be a date later than date of death. Please remove data from the COVID illness visit and add cough and shortness of breath as AEs (adverse events).\" \"What kind of pressure was being exerted here?\" Elijah asks. Second dose administered outside the three-week protocol window. Observation period appears to have been an automatic entry — According to the protocol, each participant was to be observed by staff for a minimum of 30 minutes. A majority of the CRFs state 30 minutes, which raises the question: Were participants observed for adequate amounts of time, or did they simply put down \"30 minutes\" as an automatic entry? Why is there so little variety in the observation times? If participants were not adequately observed, their safety were put at risk, which was one of Jackson’s concerns. Adverse events listed as \"not serious\" despite extended hospital stay — In one case, the participant fell and suffered facial lacerations the day after the second dose and was hospitalized for 26 days, yet the fall was not reported as serious. Other anomalies in this particular case include listing the fall as being caused by a \"fall\" unrelated to the study treatment, and the facial laceration being the result of \"hypotension\" (low blood pressure). The SAE number is also missing for the facial lacerations. Elijah writes, \"Doubts can be raised over the credibility of this information given the fall and facial lacerations were intrinsically related. So, if facial lacerations were due to 'hypotension' then the fall should be due to that too.\" Might low blood pressure be an effect of the experimental shot? Possibly. Especially when you consider the patient fell the day after being given the second dose. Even more suspicious: the causality for the fall was recorded as \"related\" (to the treatment) on the serious adverse event form, but listed as \"not related\" on the adverse event CRF. A note states, \"Please confirm correct causality.\" Dismissing brand new health problems as unrelated to the treatment — For example, in one case, a female participant with no medical history of impaired kidney function was diagnosed with kidney stones and severe hypokalemia, requiring hospitalization, one month after her second dose. Yet despite her having no history of kidney problems, both events were dismissed as \"not related\" to the study treatment and no further investigation was done.\n\nThe Pfizer documents reveal an enormous gap between what we were told about the jab and what the FDA and Pfizer actually knew about it. In a recent article published by The Defender,11 Dr. Meryl Nass asks, \"Pfizer, FDA documents contradict official COVID vaccine safety narrative — Is this fraud?\" As noted by Nass, what we’re told in the media is one thing, and what these documents reveal is another. And, importantly, the content of these documents \"tell us what information Pfizer and the FDA are willing to stand by.\" They also establish what the legal requirements for emergency use authorization and licensing. \"It may come as a shock, but what the FDA said when it issued both the EUA and the license for Pfizer’s vaccines was very different from what you heard from the Centers for Disease Control and Prevention (CDC), the media and other sources,\" Nass writes.12 One glaring example of official recommendations running counter to the data is the CDC’s recommendation to vaccinate during pregnancy. CDC director Dr. Rochelle Walensky has repeatedly assured the public that the jab poses no health risks to pregnant women or their babies. Here’s Walensky in May 2021:\n\nVideo may not work on all browsers How can this be, when as late as December 2021, the FDA and Pfizer claimed there was inadequate information to determine if there are risks in pregnancy? How can Walensky and Fauci make definitive claims about safety when there are no data? The American College of Obstetricians and Gynecologists (ACOG) also make definitive statements about safety, claiming \"Vaccination may occur in any trimester, and emphasis should be on vaccine receipt as soon as possible to maximize maternal and fetal health.\"13 What are they basing this on? The absence of data certainly isn’t a solid basis on which to make safety claims. As noted by Nass:14 \"... the CDC, in its own Jan. 7 Morbidity and Mortality Weekly Report,15 stated there was insufficient data to make any determination of COVID vaccine safety in the first trimester. So, while the federal agencies had no reason to believe the vaccine was safe in pregnancy, and made sure their legal documents said so, they nonetheless advertised the vaccine as safe for pregnant women. Then ACOG, a nonprofit professional organization of obstetricians, not only provided their members with false information on vaccine safety, but furthermore instructed them on the use of propaganda to convince expectant mothers to take the shot.\" She also lists several instances where CDC statements to the public clearly contradict statements on the Comirnaty label. For example:16,17\n• While the CDC initially claimed that anaphylactic reactions to the jab occur at approximately the same rate as other vaccines, they’ve since removed that claim, and both the CDC and the Comirnaty label now states that administration of Comirnaty is limited to facilities that can medically manage anaphylactic reactions. \"This is not the case for other vaccines,\" Nass says, adding that research from Harvard hospitals reveal the rate of anaphylaxis in employees who got the COVID jab was 50 to 100 times higher than the rate claimed by the CDC, which calculates that rate based on reports in the Vaccine Adverse Event Reporting System (VAERS). Interestingly enough, this matches up with what we believe to be the underreporting factor for VAERS might be.\n• While the CDC claims post-jab myocarditis is mild and resolves quickly, the Comirnaty label clearly states that \"Information is not yet available about potential long-term sequelae.\"\n• The CDC recommends the COVID jab for pregnant women, yet the label states that \"available data on Comirnaty administered to pregnant women are insufficient to inform vaccine associated risks in pregnancy.\"\n• The CDC, FDA and mainstream media contend that the COVID jab cannot cause cancer or fertility problems, yet the Comirnaty label clearly states that \"Comirnaty has not been evaluated for the potential to cause carcinogenicity, genotoxicity, or impairment of male fertility.\" If it has not been evaluated, how can they claim to know that it cannot cause these kinds of problems — especially considering the list of reported side effects, above?\n• Even though the stated purpose of mass vaccination is to create \"herd immunity,\" the FDA did not require Pfizer to assess whether the jab could protect against asymptomatic infection or prevent transmission of SARS-CoV-2. What Was It All For?\n\nWith each passing week, the cracks in the official COVID narrative keep multiplying and widening. It’ll be interesting to see what finally breaks the proverbial dam. Pfizer CEO Albert Bourla is now out there pushing for a fourth shot,18 saying a second booster will be \"necessary for most,\" as three shots not only can’t protect against variants, but they rapidly wane in strength. For those same reasons, Americans must expect to get an annual booster each fall. Under normal circumstances, that should have ripped the wool off of people’s eyes, but the COVID brainwashing has been so successful, many still can’t see just how badly they’ve been lied to. I believe the final salvo that will wake up the masses will either be revelations about harms, or the realization of what the planned social credit system would actually mean for the average American. In 2018, Pfizer proudly partnered with a Chinese Communist Party (CCP) payment platform, Alipay, which was used to implement an early Chinese version of vaccine passports, called the \"Internet + Vaccination\" initiative, aimed at creating \"Disease awareness via mobile devices.\"19 According to the U.S. State Department, Alipay is a \"tool\" used by the CCP in its build-up of \"technology-facilitated surveillance and social control\" network, also known as a social credit system. The same sort of system is now being rolled out in other parts of the world, including the U.S., so it’s interesting to note Pfizer’s involvement with that early digital vaccine passport initiative. Mid-March 2022, Bourla gave an interview with Washington Post Live (above), admitting the decision to use mRNA technology in the creation of a COVID \"vaccine\" was \"counterintuitive,\" as Pfizer has \"good experience\" with several other vaccine technologies, but only two years’ worth of experience with mRNA, which had never been used in a commercially available medicine before. In the end, Bourla may come to regret that decision, as it has turned out to be an incredibly lethal one. Although I guess it will depend on whether he’s ever held to account for those choices.", "opengraph": {"image": "https://cdn.pixabay.com/photo/2021/01/07/14/19/vaccine-5897391_960_720.jpg"}, "tags": ["Motherboard"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "100%", "height": "420", "embed_code": "<iframe src=\"//www.youtube.com/embed/7YOD9drZasM\" width=\"100%\" height=\"420\" allowfullscreen=\"allowfullscreen\"/>", "src": "//www.youtube.com/embed/7YOD9drZasM"}, {"embed_type": "iframe", "provider": "youtube", "width": "100%", "height": "420", "embed_code": "<iframe src=\"//www.youtube.com/embed/WSgNTUjzwxQ\" width=\"100%\" height=\"420\" allowfullscreen=\"allowfullscreen\"/>", "src": "//www.youtube.com/embed/WSgNTUjzwxQ"}, {"embed_type": "iframe", "provider": "youtube", "width": "100%", "height": "420", "embed_code": "<iframe src=\"//www.youtube.com/embed/yKh_kPptRGY\" width=\"100%\" height=\"420\" allowfullscreen=\"allowfullscreen\"/>", "src": "//www.youtube.com/embed/yKh_kPptRGY"}, {"embed_type": "iframe", "provider": "youtube", "width": "100%", "height": "420", "embed_code": "<iframe src=\"//www.youtube.com/embed/aDhwZi87IUU\" width=\"100%\" height=\"420\" allowfullscreen=\"allowfullscreen\"/>", "src": "//www.youtube.com/embed/aDhwZi87IUU"}], "links": ["https://media.mercola.com/assets/images/infographic/pfizer-side-effects-list-release.jpg"], "authors": [], "publish_date": null}