{"result_id": "051047", "URL": "https://www.blacklistednews.com/article/83221/proof-the-mainstream-media-is-being-paid-to-ignore-vaccine.html?ref=truth11.com", "timestamp": "2023-04-25 12:19:53 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.blacklistednews.com/images/tabicon.ico", "canonical": "https://www.blacklistednews.com/article/83221/proof-the-mainstream-media-is-being-paid-to-ignore-vaccine.html?ref=truth11.com", "encoding": "utf-8"}, "image": null, "domain": "www.blacklistednews.com", "title": "Proof: The mainstream media is being paid to ignore vaccine injuries/deaths", "cleaned_text": "I was the first person in history to get the truth bombs about vaccine injury/death rates out on Fox. Everyone before me who attempted this has been censored.\n\nI now know why they have been censored.\n\nThe reason I succeeded where others had failed is pure dumb luck which I describe in detail below.\n\nWhy hasn’t this been revealed before on Fox News?\n\nThe media companies are paid lots of money by both the Biden administration/HHS (over $1 billion) and the drug companies to promote the vaccine AND suppress any stories that would increase vaccine hesitancy.\n\nI also recently learned why the CDC hasn’t found a single death from the vaccine. It is because they are not looking for them. Duh!\n\nHere’s the proof below. Please read and share widely.\n\nThe evidence that the media has been paid off to be biased\n\nEvidence for all of the points in this article can be found in this brilliant Substack article by Emerald Robinson. Please look at her credentials, then read her excellent article entitled, “Fox News & Newsmax Took Biden Money To Push Deadly COVID Vaccines To Its Viewers.”\n\nEmerald used to be a mainstream journalist until she found out what was happening. You will not see an article like hers anywhere in the mainstream media. Ever.\n\nI have more evidence if any “fact checker” wants to go on a recorded video call to challenge me on any of this. So does Wayne Root. Wayne is going ballistic over how he was cancelled.\n\nNo “fact checker” is going to accept my offer to speak on a recorded call. That should tell you everything you need to know.\n\nOnly one fact checker, Gabrielle Settles of PolitiFact, has ever agreed to a recorded call and she was exposed (see this article and look at point #5 for a video of the call). After the video of our discussion about VAERS went viral, PolitiFact threatened to never talk to me again unless I removed the video. Are you kidding me?!?! NFW! I refused their generous offer. The video clearly shows the fact checkers have an agenda and it is not to expose the facts. PolitiFact hopes it will just go away.\n• The Biden Administration is paying all the media companies millions of dollars to promote the vaccine and suppress coverage of anything that is anti-vax.\n• The drug companies are spending heavily on ads on media companies but that revenue will disappear if the media runs any story that says the vaccines are not safe.\n• So reporters are told not to cover any anti-vaccine narrative.\n• This is why Fox News (FNC) “can’t” validate my truth bombs even though most all the evidence is in plain sight: it’s because they are paid not to.\n• This is also why Fox News won’t book anyone who is going to level with the American people\n• Fox News never disclosed the conflict to their audience.\n• Only a few brave reporters have quit over this.\n\nWhat Wayne Root has to say\n\nWayne Root is one of the most famous conservative hosts in the US. He used to be on FNC all the time. But FNC has banned him. Why? Because Wayne tells the truth about vaccine injuries and death. He’s seen it first hand and he’s not going to remain silent about what he saw. This is why Brian Kilmeade didn’t simply offer to have Wayne Root on Fox to verify what I said about the stunning statistics of Wayne Root’s wedding guests. It’s because they can’t have him on because they aren’t allowed to by their contracts with the drug companies and the White House.\n\nHow I got my truth bombs on Fox: It was a mistake I made\n\nThe Fox interview was supposed to be me trashing the Democrats. I had talking points I was given. These had been approved by Fox.\n\nBut I talked to the producer before the show and asked, “are there scripted questions?”\n\nHe said “no” just answer the questions.\n\nSo that’s what I did. I answered the questions honestly. That’s what you are supposed to do, right?\n\nMy PR guy told me after the show that he was mad that I didn’t stick to the talking points. I told him, “I thought they were just suggested talking point to try to get in.”\n\nI didn’t realize I was supposed to stick to the script.\n\nBrian Kilmeade was telling the truth when he said “Fox News can’t verify your numbers.” They are not allowed to!\n\nKilmeade said, “So you know we can’t verify those numbers, these are numbers that you have.” Here’s the transcript.\n\nNow we know why.\n\nBrian Kilmeade, to his credit, was telling the truth.\n\nHe just left out the part about why he can’t.\n\nBrian should have said something like this:\n\n“Unfortunately Steve, we can’t verify what you said by having Wayne Root on Fox because we signed a contract with the drug manufacturers and HHS that forbids us to air any negative vaccine coverage. So Fox management won’t let us do that. Sorry about that. I hope that you and the American public understand. We’re not about the truth at Fox. This is a business. We do it to make money. And right now, the government and the drug companies are paying us a lot of money to censor all negative vaccine stories and guests. Sure, people will die. But Fox is going to make a lot of money by providing one-sided coverage of the vaccine issue and that’s more important than looking into whether hundreds of thousands of people died because of that bias. Get it?”\n\nWhy Kim Iversen quit and why I can’t appear on her show\n\nWhat happens to honest journalists like Kim Iversen?\n• The are not permitted to interview Tony Fauci because they ask “unscripted questions”\n• Kim quit The Hill over this\n• Check out this story in The Daily Beast with all the tweets. They basically dump their only truth teller.\n• Guess who got Kim in hot water for inviting her to speak at the Defeat the Mandates rally in Los Angeles that got her in trouble (as mentioned in the Daily Beast article)? Yup. Yours truly!\n• I can’t appear on her show because it’s on YouTube. YouTube would immediately ban her channel and cut off all payments for violation of their terms of service. People who tell the truth are not permitted on YouTube. Every time I try, my video lasts for about 10 minutes and 15 views before it is taken down. Check out one of her recent interviews on her new show.\n\nI’m a big fan of Kim’s work. It’s a shame that YouTube censors her content.\n\nBut that’s how it work… the government believes it’s important for Americans to ONLY hear the government narrative about the vaccine. Everything else gets censored. That’s the way “free speech” works.\n\nToday it is the vaccine. Next it will be anyone speaking out against any US government policies.\n\nHow the media can justify their bias to only report one side of the narrative\n\nHere are four reasons people in the media believes that they are doing no harm by only reporting one side of the story. This is what they use to “justify” their bias:\n• The clinical trials didn’t show anything wrong and the FDA approved the drug\n• The medical community isn’t seeing any vaccine injuries or deaths (fear)\n• The NIH isn’t seeing any connection between the vaccine and the vaccine injured\n• The medical examiners aren’t seeing any deaths caused by the vaccine\n• The CDC is seeing rare cases of myocarditis, but no deaths. They’ve looked at all the safety data in detail and concluded that “Safety data from more than 298 million doses of mRNA COVID-19 vaccine administered in the first 6 months of the US vaccination program show that most reported adverse events were mild and short in duration.”\n\nSo if you are looking at this from a media point of view, everything looks OK and people like me look like misinformation spreaders. If there were truly deaths from the vaccine, at least one of these groups would be speaking out.\n\nPeople will see nothing when they are punished if they see anything. This goes for the CDC, FDA, doctors, the medical community, medical examiners, ... This is why the press feels OK about censorship.\n\nSee how it’s all linked? One side is suppressed and told not to speak out, this has a ripple effect and it’s circular and it reinforces the behavior in everyone.\n\nBut all of these people are lying and none of them will go on camera to defend their position. Not a single one. Ever. Hmmmm…\n\nFor more information on media corruption\n\nBobby Kennedy called me as I was finishing writing this article and suggested that everyone should be aware of Operation Mockingbird. That’s Wikipedia link and, of course, claims it doesn’t exist. Come on.\n\nWikipedia is a very unreliable source for ANYTHING that is counter narrative. Even Larry Sanger, the co-founder of Wikipedia freely admits this! That’s something you rarely see from a high tech company executive: the truth. Kudos to Larry for admitting the corruption in the company he founded!\n\nUnbelievably, Wikipedia did not call out Sanger for spreading misinformation. But they trashed my reputation. They even deleted my National Caring Award just days after I came out against the vaccine. They did this to paint me as an evil person. When I pointed out that the peer reviewed science supported what I said, they said that didn’t count and then they gave me a lifetime ban so I could communicate to the editors any more. If I had a Nobel Peace Prize, they would probably remove that too. They are unethical and you should never donate any money to support them. The people who run Wikipedia are evil and they hide behind pseudonyms so you cannot sue them for defamation and they will certainly never agree to a public livestream to defend what they wrote.\n\nHere are the two article you should read about Operation Mockingbird:\n• Part 2: The Belly of The Daily Beast and Its Perceptible Ties to the CIA\n\nWould anyone from Wikipedia or the mainstream media like to challenge Robert F. Kennedy Jr on this in a public debate?\n\nAnd in a couple of weeks there will be some stunning revelations coming out about this. Not from me. Stay tuned.\n\nThe mainstream media is not going to tell you the truth about the vaccine. There is a lot of corruption happening they aren’t going to admit including payments from the government, drug companies, and involvement of the CIA.\n\nBobby Kennedy, Wayne Root, myself and others would love to have an open recorded discussion about any of the vaccine safety and/or mainstream media corruption with any representatives of the mainstream media.\n\nSuch a discussion will never happen.\n\nAnd that tells you everything you need to know, doesn’t it?", "opengraph": {"image": "https://substackcdn.com/image/fetch/w_1200,h_600,c_limit,f_jpg,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F6b816e37-1708-4987-88b9-b64dc84c1177_760x712.png"}, "tags": ["Motherboard"], "tweets": [], "movies": [], "links": ["https://stevekirsch.substack.com/p/mainstream-media-claims-my-statements", "https://stevekirsch.substack.com/p/the-cdc-isnt-finding-any-vax-deaths", "https://emeralddb3.substack.com/p/fox-news-and-newsmax-took-biden-money", "https://substack.com/profile/25131899-emerald-robinson", "https://substack.com/profile/25131899-emerald-robinson", "https://emeralddb3.substack.com/p/fox-news-and-newsmax-took-biden-money", "https://emeralddb3.substack.com/p/fox-news-and-newsmax-took-biden-money", "https://www.politifact.com/staff/gabrielle-settles/", "https://stevekirsch.substack.com/p/short-takes-truckers-clinical-trial", "https://rumble.com/vvb1aq-politifact-does-a-fact-check-on-vaers-the-nvic-interface.html", "https://stevekirsch.substack.com/p/the-great-debate-politifact-vs-the", "https://silentpartner.substack.com/p/steve-kirsch-on-tucker-carlson-tonight", "https://www.thedailybeast.com/the-hills-rising-star-kim-iversen-a-conspiracy-theorist-abruptly-exits", "https://www.youtube.com/watch?v=qu2qOSPtQy8", "https://www.thelancet.com/journals/laninf/article/PIIS1473-3099(22)00054-8/fulltext#:~:text=During%20the%20study%20period%2C%20298,1%C2%B73%25)%20were%20deaths.", "https://en.wikipedia.org/wiki/Operation_Mockingbird", "https://stevekirsch.substack.com/p/how-wikipedia-changed-me-from-being", "https://en.wikipedia.org/wiki/Larry_Sanger", "https://en.wikipedia.org/wiki/Steve_Kirsch", "https://stevekirsch.substack.com/p/how-wikipedia-changed-me-from-being", "https://childrenshealthdefense.org/defender/cia-liberal-media-outlets-the-real-anthony-fauci/", "https://childrenshealthdefense.org/defender/the-daily-beast-ties-to-cia/"], "authors": [], "publish_date": null}