{"result_id": "051039", "URL": "https://www.blacklistednews.com/article/83364/legal-challenges-to-pentagons-vaccine-mandate-just-getting-started-military-insiders.html", "timestamp": "2023-04-25 12:19:51 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.blacklistednews.com/images/tabicon.ico", "canonical": "https://www.blacklistednews.com/article/83364/legal-challenges-to-pentagons-vaccine-mandate-just-getting-started-military-insiders.html", "encoding": "utf-8"}, "image": null, "domain": "www.blacklistednews.com", "title": "Legal Challenges To Pentagon’s Vaccine Mandate Just Getting Started, Military Insiders Say", "cleaned_text": "The vaccination order has given rise to a spate of lawsuits and is likely to spur more challenges as more people come to see that officials who grant exemptions on other grounds are unwilling to accommodate those who file religious accommodation requests (RARs), service members and military experts have told The Epoch Times.\n\n“I have talked to military members and no one likes this policy; no one thinks it’s a good idea. I agree with them that this policy is going to backfire in a big way. It’s going to force out people who are moral, ethical service members out of the military and will leave a readiness gap. But the other problem is this is a relatively untested vaccine and we’re all just now starting to see what the health effects are,” Susan Katz Keating, a journalist specializing in military affairs and the editor and publisher of Soldier of Fortune magazine, told The Epoch Times.\n\nThe vaccine mandate has been enshrined in DoD policy as a consequence of President Joe Biden’s July 29, 2021, order to the department to add COVID-19 to its list of required vaccinations. Defense Secretary Lloyd Austin’s subsequent memorandum on Aug. 24, 2021, required each branch of the military to vaccinate all service members.\n\nThe order quickly met with resistance from military personnel seeking exemption on various grounds, from concerns about the safety and unknown long-term side effects of vaccines that they felt had been rushed through the Food and Drug Administration (FDA) approval process, to religious objections on the part of those who take issue with the use of fetal cell lines in the development of the drugs.\n\nActive-duty military personnel who spoke to The Epoch Times acknowledged broad disapproval of the DoD’s stance on vaccinations, and some of them signaled that, no matter how mixed the results so far, legal challenges to the policy are just getting started.\n\nOpposition runs high among military personnel, Rob Green, an active-duty Navy commander (O5) currently serving with Maritime Expeditionary Security Group Two, told The Epoch Times.\n\n“I don’t want to speak for 2.1 million of my friends, but I’ll say that there are many who did not want to get vaccinated. They’re being told that they have to, but common sense told these people that if a pandemic has a 99.99 percent survivability rate, and you’re in the healthiest possible age group in America, ‘Why am I going to take this risk?’” Green said.\n\nGreen described Pfizer-BioNTech’s Comirnaty vaccine as an emergency-use product that never went through the twelve-year cycle of approval and review which a vaccine would ordinarily be subject to, but instead was rushed through the process in one year, with important testing left undone.\n\nHe noted that Comirnaty-labeled vaccines—the drug that received full Food and Drug Administration (FDA) approval—became available for the DoD to order only as of May 20 this year. According to Green, this means that, going back as far as Aug. 24, 2021, the DoD had been illegally pushing the use of a drug that still had the status of an Emergency Use Authorized (EUA) product, and one that service members, therefore, had every legal right to refuse.\n\n“The order to vaccinate is not a lawful order. As a matter of fact, in federal court, the Department of Justice, on behalf of the Department of Defense, admitted on May 20 that basically they had no licensed product before then,” Green said.\n\nNo statutory basis exists for denying any American the right to refuse to a EUA drug, Green believes. Under EUA law 21 USC § 306bbb, the government has far-reaching responsibilities when it comes to advising people of their rights concerning the administration of vaccines and other drugs, according to a whistleblower report circulated by Green and obtained by The Epoch Times.\n\nWhile the military can make use of a presidential waiver process under 10 USC §1107a, this waiver does not mean that service members are legally required to use a EUA product, only that the requirement to inform them of their right to refuse does not apply, the report states.\n\nThe vaccines forced on service personnel before May 20, 2022, were not Comirnaty-labeled, and hence did not meet a fundamental legal obligation, Green argued.\n\n“Labeling is a legal requirement in order to have a licensed product. You can’t waive proper labeling. That amounts to fraudulent labeling, which actually has its own statute law. They knew what they did was illegal,” Green said.\n\nThe Pentagon has issued a policy (pdf) saying the FDA-approved Comirnaty and EUA Pfizer-BioNTech vaccines are interchangeable, but the legality of this directive is contested by service members opposing the mandate.\n\nGreen said he knows many service members who have been unfairly, and illegally, penalized for their refusal to take the vaccine, including one young man who he identified for purposes of this article as Owen. In Green’s telling, Owen enlisted under a delayed entry program. The DoD rolled out its vaccine mandate after Owen had signed up, but before he arrived at boot camp. When Owen put in an RAR, he was told that the process required him to confer with a chaplain, but, being in boot camp, he had no access to a chaplain. In the end, the military kicked Owen out after only 39 days of service.\n\nMilitary personnel are not lying dormant in the face of what they view as an illegal and selectively enforced mandate.\n\nLast week, 14 Marines residing in the states of Texas, Washington State, Louisiana, Minnesota, and North Carolina filed a class-action lawsuit in a federal court in Texas against Defense Secretary Austin. In their complaint, the plaintiffs, citing “sincerely held religious beliefs,” claim that military officials have been inconsistent in their treatment of service members seeking exemptions. While, in theory, it is possible to seek an exemption on medical, administrative, or religious grounds, the last category does not carry any weight with DoD officials, the plaintiffs allege. “Religious accommodation requests are universally denied unless the requester is already imminently leaving the Marines,” the complaint charges.\n\nMilitary officials’ refusal to grant exemptions on religious grounds is not only inconsistent with their willingness to exempt service members on other grounds but violates the Religious Freedom Restoration Act of 1993 and the Administrative Procedure Act, the plaintiffs claim.\n\nThe complaint lists a number of negative consequences for the careers and lives of those service members who refuse vaccinations. The DoD threatened those who refused to comply with court martials, involuntary separation from the services, negative performance evaluations, the loss of leadership positions, removal from consideration for promotions, the inability to retire in good standing, non-deployable status, denial of benefits and special pay, and the loss of leave and travel privileges, among other penalties and punishments.\n\nIts legality aside, the DoD’s vaccination push has been largely successful—with the overwhelming majority of active-duty Marines now vaccinated—and recent developments in related cases do not look promising for the plaintiffs in the Texas class-action suit.\n\nIn March, the Supreme Court handed down a ruling that the Navy had the authority to decide whether or not to deploy personnel who refused the vaccine mandate. That case, too, was originally filed in Texas before the Fifth Circuit Court of Appeals took it up.\n\nAs of the end of April, the military had expelled 3,400 troops for refusing vaccine shots, and the numbers continue to rise.\n\nFor the military to lose so many personnel so abruptly, and with more involuntary separations likely as the legal challenges play out, is reckless from a security standpoint, Elaine Donnelly, founder and president of the Center for Military Readiness, a Livonia, Michigan-based public policy institute, told The Epoch Times.\n\n“Of course the size of the All-Volunteer Force matters, and anyone claiming otherwise should be held accountable. Short-handed units put heavy work burdens on others, making deployments more difficult and weakening deterrence, morale, and overall readiness. The military services and academies keep pushing an inflexible, unreasonable ‘get vaccinated or get out’ policy, which has become a national security issue,” Donnelly said.\n\nIn Donnelly’s view, the traditional criteria that guided military leaders’ decision-making—namely, what is in the best interests of American readiness and security—have been eclipsed by a tendency to assert their own absolute power in a context where service members are expected to obey commands without question.\n\n“Military vaccinations have little to do with the health of the force and everything to do with the power of military officials to implement policy. The military is uniquely vulnerable to power plays such as this because personnel are not truly free to dissent, and federal courts are reluctant to second-guess military judgments and decisions,” she said.\n\nDonnelly pointed out the irony that DoD officials should take such an inflexible, and coercive, stance toward those who dissent on religious grounds, given the overall orientation of the military today toward accommodating all who say they want to serve, without regard for such traditional standards and requirements as physical strength and endurance.", "opengraph": {"image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/Lloyd_J._Austin_III_%282021%29_A.jpg/800px-Lloyd_J._Austin_III_%282021%29_A.jpg?20210123082407"}, "tags": ["Motherboard"], "tweets": [], "movies": [], "links": ["https://storage.courtlistener.com/recap/gov.uscourts.flnd.409961/gov.uscourts.flnd.409961.88.1.pdf", "https://childrenshealthdefense.org/wp-content/uploads/COVID-19-COMIRNATY-EUA-BLA-equivalent-memo_v3.1-clean-DIGITAL.pdf", "https://www.theepochtimes.com/www.courthousenews.com/wp-content/uploads/2022/08/marines-covid-vaccine-exemption.pdf", "https://www.military.com/daily-news/2022/03/25/supreme-court-allows-navy-reassign-vaccine-refusing-seals.html", "https://www.theepochtimes.com/biden-accelerating-obamas-push-for-a-woke-military-undermining-combat-readiness-analysts-say_4510597.html", "https://www.theepochtimes.com/legal-challenges-to-pentagons-vaccine-mandate-just-getting-started-military-insiders-say_4692109.html"], "authors": [], "publish_date": null}