{"result_id": "051005", "URL": "https://www.blacklistednews.com/article/82945/the-feds-pile-up-vaccine-adverse-event-reports-as-they-decry-scaremongering.html", "timestamp": "2023-04-25 12:19:37 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.blacklistednews.com/images/tabicon.ico", "canonical": "https://www.blacklistednews.com/article/82945/the-feds-pile-up-vaccine-adverse-event-reports-as-they-decry-scaremongering.html", "encoding": "utf-8"}, "image": null, "domain": "www.blacklistednews.com", "title": "The Feds Pile Up Vaccine 'Adverse Event' Reports as They Decry Scaremongering Elsewhere", "cleaned_text": "Since the Food and Drug Administration authorized the first vaccines for COVID-19 in late 2020, the government and much of the media have insisted that the medicines developed in record time are safe and effective. Those who raised questions about them have been routinely dismissed as conspiracy theorists.\n\nAnd yet an online database co-administered by the FDA and the Centers for Disease Control has compiled more than 1.3 million reports of vaccine-implicated “adverse events” running the gamut from mild to severe, including 29,000 deaths.\n• A 44-year-old male from California with a blood clot in the brain (CVST) five days after receiving Pfizer vaccine, dose unknown.\n• A 31-year-old female from Pennsylvania with heart inflammation (myocarditis) two days after receiving Moderna’s booster.\n• A 58-year-old female from California with blood clots in legs (DVT) after receiving Johnson & Johnson booster. She reported:\n\nThese reports are not anecdotes from “anti-vaxxers” on the dark web. They come from the federal government’s open-source log, the Vaccine Adverse Event Reporting System. It allows anyone to go online and report a bad reaction that could be linked to any vaccine, including those for COVID-19. (RealClearInvestigations has linked above to VAERS reports posted at Openvaers.com, an independently run and easier to navigate database that copies reports verbatim from the CDC’s less user-friendly “WONDER” system.)\n\nWhile the reports are unfiltered and unexamined, the idea is that such public input will allow researchers to identify potential problems. But the sheer number of reports, and their specificity, have the attention of concerned scientists and even some politicians like Senator Ron Johnson of Wisconsin, who has invited people harmed by vaccines to testify before Congress and advocates compensation for them.\n\nJohnson's office said he has been admonishing the health authorities over the VAERS reports for a year. \"The senator believes the CDC and FDA need to take their own adverse event early warning system seriously and be transparent with the American people,\" it said in a statement. \"To date, they have not been.\"\n\nVAERS was created in the late 1980s as an outgrowth of a congressional mandate to create a system for compensating vaccine victims and their families. In 2015, the CDC said the average number of annual reports was roughly 30,000. In 2021, there were nearly 1 million. Given the large increase during a politically charged pandemic, the usefulness of VAERS is the subject of great debate even among scientists\n\nSome health experts believe that the number of reports is primarily a function of increased publicity around the COVID vaccines, a high number indicating only that many more people are aware of the system and concerned about potential side effects from the shots. Others say the number and strong indications in certain symptom categories – such as the cardiovascular examples cited above – paint a bleaker picture of the vaccines’ safety.\n\nDr. Peter McCullough, a renowned cardiologist and academic physician with over 600 papers published in medical literature, was one of the first professionals to publicly question the safety of the COVID-19 injections. On April 21, 2021, on his podcast The McCullough Report, he read out some of the early, alarming statistics from VAERS including reports of 502 heart attacks, 84 miscarriages, 321 cases of low blood platelet counts (thrombocytopenia) and 2,342 deaths. For Dr. McCullough, these numbers were a huge red flag. For comparison, he cites the last “mass vaccination program” undertaken in the United States, the 1976 swine flu vaccine. Dr. McCullough noted that there were approximately 55 million people vaccinated, with an accompanying 500 cases of Guillain-Barré syndrome, and around 25 deaths. “And the government officials at that time said, ‘we’re going to pull it.’”\n\nDr. McCullough said that by April 2021, VAERS reports were already so numerous that he felt the COVID vaccines should be pulled off the market. That same month, Fox News host Tucker Carlson voiced doubts about the vaccines' effectiveness, and Dr. Anthony Fauci, President Biden's top medical adviser, blasted him for pushing \"a typical crazy conspiracy theory.\"\n\nAs of today, the system has more than 29,000 reports of deaths.\n\nVAERS reports, however, are not hard evidence. Its website explains: “A report to VAERS generally does not prove that the identified vaccine(s) caused the adverse event described. It only confirms that the reported event occurred sometime after vaccine was given. No proof that the event was caused by the vaccine is required in order for VAERS to accept the report. VAERS accepts all reports without judging whether the event was caused by the vaccine.” Some of the FDA and CDC’s most senior veterans advise caution in interpreting the data.\n\nSusan Ellenberg, PhD, the former Director of the Office of Biostatistics and Epidemiology at the FDA’s Center for Biologics, told RCI that “anything that gets reported goes directly into the [VAERS] system … so mostly what you get is noise.” She said that it’s nearly impossible to prove causation with this dataset alone. Dr. Walter Orenstein, formerly the CDC’s director of immunization, concurs. He said, “That’s why it’s called adverse ‘events’ as opposed to reaction because reaction implies causation. Event is basically something that follows.” Elderly people, for example, die regularly; if they are dying days or weeks after being vaccinated, that does not necessarily mean the vaccine is killing them.\n\nThere are many reasons why the VAERS data is usually insufficient to prove causality between vaccination and adverse events, including:\n• There is no reliable denominator to establish event rates – and no “control” group against which to measure adverse events.\n• Reports are often messy or incomplete.\n• Underreporting has been a consistent and documented issue. (One CDC study shows that the system may capture as few as 12% of adverse events, meaning the total for COVID-19 vaccines could be as high as 10.8 million.)\n• On the other hand, overreporting is also an issue, as noted in this 2003 CDC review: “Other potential reporting biases include increased reporting in the first few years after licensure, increased reporting of events occurring soon after vaccination, and increased reporting after publicity about a particular known or alleged type of adverse event.”\n• In the case of childhood vaccinations, vaccine sets are co-administered, making it nearly impossible to know which specific vaccine caused the adverse event.\n\nSo why continue using an unreliable system – apart from the fact it was required by Congress? Experts agree that VAERS can be extremely useful in picking up signals of causation, which can be confirmed with further study, usually employing the government’s other major monitoring system: the CDC’s Vaccine Safety Datalink. The VSD uses the combined databases of nine major healthcare systems nationwide, providing detailed patient data, and the ability to look at control groups of unvaccinated patients. The downside to the VSD is that unless an issue comes through the healthcare system, it’s not going to be reported. So if someone dies at home after being vaccinated, it won’t make it into VSD, though it might make it into VAERS.\n\nOne prime example of VAERS picking up a signal leading to an important safety discovery occurred in the late 1990s with the RotaShield vaccine for rotavirus – an ailment that causes diarrhea and vomiting in the very young. While clinical trials revealed a small number of cases of intussusception – the sometimes-deadly folding of the intestine in small children – the finding was not seen as prohibitive. Nonetheless, public health researchers flagged it as something to look for in VAERS as the vaccine was distributed widely. When reports started piling up in VAERS, it led to a review process, which ultimately led to the manufacturer pulling the vaccine off the market and the FDA pulling its license. A clear success for the system.\n\nIn the case of the COVID-19 vaccine products, Dr. Orenstein said VAERS has been a success, and that the large number of reports has been helpful in identifying certain issues. “The increased volume may be a good thing. Because of the increased reporting we’ve been able to detect causally related problems, with mRNA problems with myocarditis and pericarditis, and with J&J coagulation problems and Guillain-Barré, so in essence, VAERS is important.”\n\nJessica Rose, an independent researcher in Israel, agrees, and has devoted the past year and a half to putting VAERS under a microscope. Dr. Rose has a PhD in computational biology from Bar-Ilan University, a post-doc in molecular biology from Hebrew University, and another in biochemistry from the Technion, widely considered Israel’s MIT. She has become a fierce critic of the COVID-19 vaccines and spent countless hours poring over VAERS reports to craft her articles on the emergent issues.\n\nFor Rose, who has been collaborating with Dr. McCullough, the information available in the VAERS system on its own is sufficient to prove causality when it comes to vaccine-induced myocarditis from all three vaccines, especially the mRNA-based shots from Pfizer and Moderna. They specifically raise concerns around the high rate of myocarditis reported among boys ages 12-15. Their paper stating this was received, peer-reviewed, and accepted by Elsevier, the publisher of Current Problems in Cardiology, where the piece was to be released. It was then withdrawn from the site at the discretion of the editor. No basis was given for the removal. Dr. McCullough described the situation in detail to Bret Weinstein on his Dark Horse podcast in December. When asked for comment, Dr. McCullough told RealClearInvestigations:\n\nAsked to respond to the cardiologist's comment, Elsevier issued this statement to RCI: “We do not agree with these assertions; this article in press was withdrawn following our standard policies which are all publicly available on our website.”\n\nDr. Orenstein and the federal health apparatus now acknowledge that adverse outcomes like myocarditis, coagulopathies/thrombosis, and Guillain-Barré have been established as causally related to the COVID-19 shots in certain cohorts – and that VAERS played a role in making those connections – but see them as rare.\n\nFormer FDA epidemiologist Ellenberg says the sheer number of events in VAERS may reflect the revival of an old phenomenon: high adverse publicity around vaccines, similar to what happened with the Lyme disease vaccine and arthritis.\n\nLyme disease can cause arthritis. So can aging. When many reports of arthritis started appearing in VAERS after that vaccine was rolled out in 1998, bad publicity followed. Ellenberg started receiving phone calls from lawyers asking her when FDA was going to pull the vaccine. Ultimately, FDA convened a panel to look into the correlation, and no causal connection was found. “But because of the publicity, use of the vaccine waned and eventually the producer took it off the market.”\n\nRegarding the COVID-19 vaccines, Jessica Rose said VAERS shows a grim picture that has nothing to do with publicity. The reporting system “is functioning as a pharmacovigilance tool right now,” she said. “There are an enormous number and range of safety signals being thrown out.”\n\nIn March 2022, after the COVID-19 vaccine had been available for 15 months (462 days), she compared the number of VAERS reports related to these shots versus those for flu vaccines. Given the greater number of COVID shots administered during that period, she predicted that “the rate of reporting in VAERS…should be about twice for COVID than for flu.” What she found instead was “117.6 times as many reports of adverse events in the context of the COVID shots.”\n\nRose is adamant. “This is not about the number of doses, this is about these products doing more damage [than the flu vaccines],” she said, “systemic, comprehensive damage that we’ve never seen before. There’s no doubting that these products are different.” When RCI queried Rose as to which three adverse events might be most readily proven as being caused by the vaccine with data posted in VAERS, she replied, “Myocarditis, Bell’s palsy, and anything related to clotting.\n\nQuietly, large numbers of peer-reviewed studies have been accumulating in legitimate journals, lending credence to those who believe many adverse events are occurring, and that they are causally related to vaccination. Just recently, a study of vaccines in three Nordic countries revealed a strong correlation between getting the Astra-Zeneca shot and a higher incidence of cardiovascular injury, and a lesser but still significant correlation for recipients of the Pfizer and Moderna products.\n\nFinally, a “preprint” study (not yet peer reviewed) uploaded June 23 and co-authored by Peter Doshi, a senior editor at the British Medical Journal, as well as physicians from UCLA and Stanford, concludes that a careful analysis of all available data now suggests that the benefits of vaccination do not outweigh the potential harms. To make their calculations, the researchers used data from VAERS as well as its European equivalent, EudraVigilance, and the WHO’s VigiBase.\n\nBut the story remains complicated. For instance, Rose agreed drawing conclusions is complicated by the lack of data in VAERS about whether reporting patients have also recovered from COVID. Studies have now shown that having had COVID also increases the risk of cardiovascular events in the year after recovery. On the other hand, an Israeli analysis shows a correlation to vaccine rollout, but not to COVID-19 infection rates.\n\nWith such variables, the task of monitoring vaccine safety can seem almost futile. But Dr. Robert Chen, the creator of VAERS, disagrees. He believes the system, in concert with the Vaccine Safety Datalink and other resources, has worked well in alerting the public health community to issues due to vaccination. He told RCI that “in terms of its main function of telling you that something is going on, it’s amazingly effective.”\n\nDr. Orenstein said the VSD should be expanded if possible as a complement to VAERS but said that without a single national database, the current system of monitoring vaccine safety is “as good as it gets.” For Ellenberg, a statistician by training, “these are horrible, messy databases. You’re looking for a needle in a haystack.” When talking to other epidemiologists and encouraging them to create better systems for analyzing VAERS, Ellenberg said she uses this analogy: “If you can reduce the whole haystack to a handful of hay, then that makes your job just a little bit easier.”\n\nRose acknowledges the messiness of VAERS, but believes it provides enough information to tell a story of danger. She said that in her analysis, 60% of VAERS reports describe events within 48 hours of vaccine administration – one more criteria for causality. Rose said: “It isn’t on me to prove that these products aren’t safe, this is on them [CDC, FDA], legally, to prove that these products are safe. And they’re not doing their jobs.” On that point, a recent public records request by Josh Guetzkow, Ph.D., and the legal team at Robert F. Kennedy Jr.’s Children’s Health Defense found that CDC has not been analyzing the VAERS data on COVID-19 shots using its own stated methods.\n\nIn an email to RCI, the CDC stated, “COVID-19 vaccines are undergoing the most intense safety monitoring in U.S. history.”", "opengraph": {"image": "https://assets.realclear.com/images/58/582239_5_.png"}, "tags": ["Motherboard"], "tweets": [], "movies": [], "links": ["https://openvaers.com/covid-data", "https://openvaers.com/covid-data/covid-reports/2038016", "https://openvaers.com/covid-data/covid-reports/1974770", "https://openvaers.com/covid-data/covid-reports/1959696", "https://wonder.cdc.gov/controller/datarequest/D8", "https://www.realclearpolitics.com/video/2021/10/19/ron_johnson_what_is_going_on_with_covid_vaccines_ivermectin_is_sinister_hopefully_truth_will_come_out.html#!", "https://www.youtube.com/watch?v=6mxqC9SiRh8", "https://www.congress.gov/bill/99th-congress/house-bill/5546", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4632204/", "https://pubmed.ncbi.nlm.nih.gov/?term=McCullough%20PA%5BAuthor%5D&sort=date", "https://www.americaoutloud.com/data-information-misinformation-and-opinions-on-covid-19/", "https://www.cnn.com/videos/health/2021/04/14/dr-anthony-fauci-tucker-carlson-covid-19-vaccines-newday-vpx.cnn", "https://vaers.hhs.gov/data/dataguide.html", "https://www.sciencedirect.com/science/article/pii/S0264410X20312548?via%3Dihub", "https://www.cdc.gov/MMWR/preview/MMWRhtml/ss5201a1.htm", "https://www.cdc.gov/vaccinesafety/ensuringsafety/monitoring/vsd/index.html", "https://www.jessicasuniverse.com/cv-1", "https://61ee839e4c3e409708bac62c--i-do-not-consent.netlify.app/media/A%20Report%20on%20Myocarditis%20Adverse%20Events%20in%20the%20U.S.%20Vaccine%20AdverseEvents%20Reporting%20System%20%28VAERS%29%20in%20Association%20with%20COVID19%20Injectable%20Biological%20Products.pdf", "https://retractionwatch.com/2021/10/25/covid-19-vaccine-myocarditis-paper-to-be-permanently-removed-elsevier/", "https://www.youtube.com/watch?v=HXH573bRSZQ", "https://www.elsevier.com/about/policies/article-withdrawal", "https://www.cnn.com/2021/06/25/health/fda-covid-vaccine-heart-warning/index.html", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-limits-use-janssen-covid-19-vaccine-certain-individuals", "https://www.pharmacytimes.com/view/fda-to-attach-warning-for-guillain-barre-syndrome-to-johnson-johnson-covid-19-vaccine", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2870557/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9233673/", "https://academic.oup.com/cid/advance-article/doi/10.1093/cid/ciac460/6604461", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9212666/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8850379/", "https://www.sciencedirect.com/science/article/pii/S1878540922001128", "https://jamanetwork.com/journals/jamanetworkopen/fullarticle/2793348?resultClick=1", "https://deliverypdf.ssrn.com/delivery.php?ID=769100067111076030001095031003083101037063061035027036094003030010041071069071084082126100119004102082086102016126107012082101122087094101125119124066004120080075005082109065069057027037118020124027084022036082023002103031007090104002009070095097105110077081026084100025099116111103017&EXT=pdf&INDEX=TRUE", "https://www.nature.com/articles/s41591-022-01689-3#Sec19", "https://www.nature.com/articles/s41598-022-10928-z", "https://childrenshealthdefense.org/defender/cdc-vaers-covid-vaccine-safety/", "https://www.cdc.gov/vaccinesafety/pdf/VAERS-COVID19-SOP-02-02-2022-508.pdf"], "authors": [], "publish_date": null}