{"result_id": "051033", "URL": "https://www.blacklistednews.com/article/83910/court-says-no-biden-cannot-enforce-vaccine-mandates-for-federal.html", "timestamp": "2023-04-25 12:19:48 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.blacklistednews.com/images/tabicon.ico", "canonical": "https://www.blacklistednews.com/article/83910/court-says-no-biden-cannot-enforce-vaccine-mandates-for-federal.html", "encoding": "utf-8"}, "image": null, "domain": "www.blacklistednews.com", "title": "Court Says No, Biden Cannot Enforce Vaccine Mandates For Federal Contractors", "cleaned_text": "“The President’s use of procurement regulations to reach through an employing contractor to force obligations on individual employees is truly unprecedented,” the ruling noted, adding “As such, Executive Order 14042 is unlawful, and the Plaintiff States have consequently demonstrated a strong likelihood of success on the merits.”\n\nReferring to Biden’s Executive Order, the ruling also stated that “Congress has not spoken clearly to authorize such a dramatic shift in the exercise of the President’s power under the Procurement Act.”\n\nThe vaccine mandate would affect up to 20 percent of people employed in the U.S., Reuters has noted.\n\nLouisiana Attorney General Jeff Landry, one of the plaintiffs in the case issued a statement asserting that “Today is a victory for freedom,” and vowing “We will continue to stand up against the Biden Administration’s abuses of power that threaten us now and in the future.”\n\nThe Ruling comes a week after The Senate passed the National Defense Authorization Act, which lifted the COVID vaccine mandate for active duty military personnel.\n\nRepublicans in the Senate, led by Rand Paul, had threatened to block the legislation unless the mandate was scrapped.\n\nWhile the mandate will be sidelined, some 8,000 troops who were given the boot for refusing to go along with it have not been reinstated.\n\nGOP Senators Ron Johnson and Ted Cruz argued tnhatthe discharged troops should be reinstated with back pay, reasoning that the mandate was “illegal”.\n\nHowever, Democrats stated that reinstating those service members would send the message that it’s acceptable to disobey orders.\n\n“What we’re telling soldiers is, if you disagree, don’t follow the order and then just lobby Congress and they’ll come along and they’ll restore your rank, they’ll restore your benefits, they’ll restore everything, so orders are just sort of suggestions,” Senate Armed Services Committee Chairman Jack Reed, D-R.I., said on the Senate floor. “They’re not.”\n\nSome of the service members are taking the fight to the courts:\n\n———————————————————————————————————————\n\nBrand new merch now available! Get it at https://www.pjwshop.com/ \n\n\n\nALERT! In the age of mass Silicon Valley censorship It is crucial that we stay in touch.\n\n\n\nWe need you to sign up for our free newsletter here.\n\n\n\nSupport our sponsor – Turbo Force – a supercharged boost of clean energy without the comedown.\n\n\n\nAlso, we urgently need your financial support here.", "opengraph": {"image": "https://cdn.summit.news/2022/12/GettyImages-1236279844.jpg"}, "tags": ["Motherboard"], "tweets": [], "movies": [], "links": ["https://www.ca5.uscourts.gov/opinions/pub/22/22-30019-CV0.pdf", "https://www.reuters.com/legal/appeals-court-says-us-cannot-mandate-federal-contractor-covid-19-vaccines-2022-12-19/", "https://www.nbcnews.com/politics/congress/senate-passes-military-bill-lift-covid-vaccine-mandate-rcna62021", "https://summit.news/2022/12/01/senate-gop-say-they-will-block-military-funding-unless-vaccine-mandate-scrapped/", "https://www.military.com/daily-news/2022/12/16/vote-reinstate-8000-troops-booted-over-vaccine-fails-mandate-dead-new-defense-bill.html", "https://www.pjwshop.com/", "https://summit.news/newsletter", "https://bit.ly/TURBOFORCE", "https://www.subscribestar.com/paul-joseph-watson"], "authors": [], "publish_date": null}