{"result_id": "051032", "URL": "https://www.blacklistednews.com/article/82171/ceo-of-german-insurance-company-fired-after-leaking-data-showing-covid-vaccine.html", "timestamp": "2023-04-25 12:19:48 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.blacklistednews.com/images/tabicon.ico", "canonical": "https://www.blacklistednews.com/article/82171/ceo-of-german-insurance-company-fired-after-leaking-data-showing-covid-vaccine.html", "encoding": "utf-8"}, "image": null, "domain": "www.blacklistednews.com", "title": "CEO Of German Insurance Company FIRED After Leaking Data Showing Covid Vaccine Injur", "cleaned_text": "Andreas Schofbeck, the CEO of one of Germany’s leading health insurance companies, was terminated last month after releasing data that showed health authorities were dramatically underreporting covid vaccine injuries.\n\nThe information has since been removed from the BKK/ProVita health insurance company’s website.\n\nThe Defender reports: Schofbeck, who noticed an unexpected jump in vaccine-related health insurance claims, in February notified the Paul Ehrlich Institute (PEI) — the German equivalent of the Centers for Disease Control and Prevention (CDC) — that BKK billing data indicated the PEI was underreporting adverse events to COVID vaccines.\n\nIn his letter to the PEI, Schofbeck wrote:\n\n“If these figures are extrapolated to the whole year and to the population in Germany, probably 2.5-3 million people in Germany have received medical treatment for vaccination side effects after Corona vaccination.”\n\nDr. Dirk Heinrich, chairman of NAV-Virchow Bund, an association of private medical practitioners in Germany, said PEI and BKK would be working closely to examine the billing code data. Heinrich also stated that the conclusions from Schofbeck’s letter are “complete nonsense.”\n\nAccording to some experts, however, insurance company data may ultimately prove to be the most telling when it comes to accuracy about adverse events and deaths from COVID vaccines — that’s because insurers are highly motivated to carefully track any anomalies in their data that could profoundly affect their profits and losses.\n\nThe BKK data, in concert with U.S. insurance industry data and adverse event reports collected by a survey conducted by the Israeli Ministry of Health (MOH), reveal an emerging pattern of underreporting of COVID vaccine-related injuries and deaths.\n\nAccording to Schofbeck’s Feb. 21 letter to the PEI:\n• According to physician billing data, 216,695 were treated for a vaccine AE during the first 2.5 quarters of 2021.\n• Figures extrapolated over an entire year for a population of 83 million people means that 2.5-3 million people likely received treatment for an AE.\n• 4-5% of vaccinated people received treatment for an AE.\n\nIn his letter, Schofbeck speculated on possible causes for underreporting, stating:\n\n“Our first assumption is that, since no compensation is paid for reporting vaccine adverse events, reporting to the Paul Ehrlich Institute is often not done because of the great expense involved. Physicians have reported to us that reporting a suspected vaccine adverse event takes about half an hour. This means that 3 million suspected cases of vaccine adverse events require about 1.5 million working hours of physicians.”\n\nSchofbeck concluded the data present a “significant warning signal” and that “danger to human life cannot be ruled out.”\n\nAlthough the PEI publicly announced it would work with BKK to review the data, as of Schofbeck’s termination from the company, authorities hadn’t launched an investigation into Schofbeck’s claims about underreporting.\n\nBefore the BKK data disappeared, Florian Schilling, a German researcher and physician, took a deeper look at it, comparing it to existing reports from the PEI.\n• PEI’s reported numbers for 2021 were 7 times lower than BKK’s calculations.\n• PEI’s reported numbers were 13.86 times lower than BKK’s projections when compared to the 14 month period since the vaccine rollout.\n• Using this factor, Schilling calculated more than 400,000 serious AEs and over 31,000 deaths from AEs have occurred since the beginning of the vaccination campaign.\n\nStatistician Matthew Crawford, who also reviewed Schofbeck’s claims, calculated that with potentially 31,000 vaccine-related deaths in Germany — a country of 82 million — it follows that 120,000 vaccine-related deaths may have occurred in the U.S.\n\nHow could so many potentially fatal complications from COVID vaccines escape the attention of the CDC?\n\nAccording to Crawford, the CDC chose to identify risk by using an obscure computation called Proportional Reporting Ratio (PRR). As the name implies, this system is based on ratios of different event types and is utterly blind to the absolute rate of such events.\n\nThe result of using such a formula is that even if a vaccine is associated with substantially higher risk of injury, no alarm will sound if the vaccine raises risks of different types uniformly, no matter to what degree.\n\nIn other words, if the risk of myocarditis from a Covid-19 vaccine is, for example, twenty times higher than from other vaccines, the PRR for myocarditis will not be any higher than with previous vaccines if other adverse events associated with the Covid-19 vaccine are also twenty times higher. No safety signal will be raised.\n\nMethods of extrapolating data, adverse event reporting categories and billing code descriptions will vary by country, agency and within the private sector, making direct comparisons difficult.\n\nHowever, a pattern of underreporting is evident.", "opengraph": {"image": "https://en-volve.com/wp-content/uploads/2022/03/covid-19-vaccine-678x381-1.png"}, "tags": ["Motherboard"], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/defender/german-insurance-fires-andreas-schofbeck-covid-vaccine-injuries-data/", "https://childrenshealthdefense.org/wp-content/uploads/Schofbeck_-letter-translated.pdf", "https://www.pei.de/EN/home/home-node.html", "https://childrenshealthdefense.org/wp-content/uploads/Schofbeck_-letter-translated.pdf", "https://www.virchowbund.de/", "https://www.eugyppius.com/p/german-public-health-insurer-vaccine?utm_source=substack&utm_campaign=post_embed&utm_medium=web&s=r", "https://www.virchowbund.de/pressemitteilungen/details/schwurbel-bkk-gibt-falschen-alarm-bei-impfnebenwirkungen", "https://childrenshealthdefense.org/defender/insurance-companies-report-increase-premature-deaths/", "https://childrenshealthdefense.org/defender/booster-shots-more-injuries-israeli-survey/", "https://www.florianschillingscience.org/", "https://tkp-at.translate.goog/2022/02/22/abrechnungsdaten-der-krankenkassen-belegen-sicherheitsdesaster-der-gen-impfstoffe/?_x_tr_sl=de&_x_tr_tl=en&_x_tr_hl=de&_x_tr_pto=wapp", "https://roundingtheearth.substack.com/p/vaccine-induced-mortality-part-9?s=r", "https://roundingtheearth.substack.com/p/estimating-vaccine-induced-mortality?utm_source=substack&utm_campaign=post_embed&utm_medium=web&s=r", "https://roundingtheearth.substack.com/p/defining-away-vaccine-safety-signals?s=r"], "authors": [], "publish_date": null}