{"result_id": "051014", "URL": "https://www.blacklistednews.com/article/81532/british-medical-journal-exposes-the-facebook-fact-check.html", "timestamp": "2023-04-25 12:19:41 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.blacklistednews.com/images/tabicon.ico", "canonical": "https://www.blacklistednews.com/article/81532/british-medical-journal-exposes-the-facebook-fact-check.html", "encoding": "utf-8"}, "image": null, "domain": "www.blacklistednews.com", "title": "British Medical Journal Exposes the Facebook ‘Fact Check’ Scam", "cleaned_text": "A Brief Recap of the Pfizer Fraud Backstory\n\nWe previously chronicled the under-reported Pfizer “vaccine” trial fraud, which the multinational corporation used to rush its experimental mRNA gene therapy (deceptively marketed as a “vaccine”) through the regulatory hoops.\n\nIn the exposé, a whistleblower (a regional director of Pfizer’s partner contracting firm, Ventavia Research Group, named Brook Jackson) detailed the abuses. She explained how Ventavia and Pfizer systematically skirted regulatory protocols and doctored data to cover up the mRNA shots’ side effects.\n\nYou can read the BMJ’s original piece here.\n\nPfizer, of course, ultimately got approval rammed through despite its criminal malfeasance. As a consequence, pharmacies across the US and the world (which largely follows the American lead) have injected billions of doses of its dangerous genetic material with no long-term safety data. Meanwhile, the corporation generated $131 billion in revenue for itself.\n\nInstead of going after the Pfizer fraudsters in light of the above revelations, Facebook and the corporate media instead sicced their “fact check” attack dogs on the medical journal that outed the fraud.\n\nHere are a few lowlights from Lead Stories’ flimsy hitpiece:\n• “Medical experts say the claims aren’t serious enough to discredit data from the clinical trials.” (more of the “experts say” hustle)\n• “The FDA said… that the allegations don’t change the agency’s assessment of the vaccine’s safety.”\n• “A spokesperson for Texas-based Ventavia Research Group wrote in a November 10, 2021, email to Lead Stories that BMJ did not seek comment in advance of the report. If it had, it would have been told the employee’s report was investigated but found wanting.”\n\nLead Stories doesn’t dispute the factuality of the whistleblower’s core claims. Instead, they rely on dubious “experts” who were not present for the trial to claim that the improprieties — which fly in the face of established protocol — didn’t really impact the veracity of the vaxx safety trial.\n\nWhich begs the question: why even go through the formalities if they’re irrelevant, according to Lead Stories, anyway?\n\nLead Stories also reports that Pfizer contractor Ventavia investigated itself and cleared itself of wrongdoing, which is presented as credible evidence of the company’s innocence.\n\nThe BMJ, in reply to the hitpiece, reiterated the vital importance of their original reporting:\n\nThe authors go on to detail censorship that should be scandalous but is now so normalized as to be considered mundane: Facebook was actively censoring “the Science©” just because it didn’t align with Pfizer’s interests:\n\nSo – no corporate funding except for two of the largest multi-billion-dollar, intelligence service-connected corporations in the world, Facebook and Google.\n\nAnd, they insist, those corporations don’t influence Lead Stories’ editorial decisions – because Lead Stories says so on their website. The claim might lead one to believe Facebook and Google are really philanthropy societies that just want to educate and inform the public with totally unbiased information to create a better world.\n\nBecause, after all, this is a pandemic – we’re all in this together. Social media censorship is altruism.\n\nIn its rebuttal, the BMJ cites multiple specific examples of why the Lead Stories hitpiece was “inaccurate, incompetent, and irresponsible”:\n• “It fails to provide any assertions of fact that The BMJ article got wrong”\n• “It has a nonsensical title: ‘Fact Check: The British Medical Journal Did NOT Reveal Disqualifying And Ignored Reports Of Flaws In Pfizer COVID-19 Vaccine Trials'”\n• “It contains a screenshot of our article with a stamp over it stating ‘Flaws Reviewed,’ despite the Lead Stories article not identifying anything false or untrue in The BMJ article”\n• “It published the story on its website under a URL that contains the phrase ‘hoax-alert'”\n\nThat’s just a small sample of the highly detailed malfeasance that the BMJ chronicles on the part of Facebook partner Lead Stories.\n\nThey really went balls to the wall, and reading the whole report is worthwhile.\n\nOf course, the BMJ isn’t the first, or the bravest, or the most unequivocal, entity to expose the COVID “fact check” racket, which is cynically weaponized to push Big Pharma interests and silence dissidents.\n\nBut, given the BMJ’s status as one of the most well-established medical publications in the world, maybe some liberals who “respect the science©” might pay attention this time.\n\nBut, as the corporate media has largely 9/11’d their mental faculties, don’t hold your breath.\n\nBen Bartee is a Bangkok-based American journalist with opposable thumbs. Follow his stuff via his blog, Armageddon Prose, Substack, Patreon, Gab, and Twitter.", "opengraph": {"image": "https://www.thedailybell.com/wp-content/uploads/2022/01/0000.png"}, "tags": ["Motherboard"], "tweets": [], "movies": [], "links": ["https://www.thedailybell.com/all-articles/news-analysis/vaxx-trial-fraud-pfizer-whistleblower-exposes-how-your-government-is-captured-by-multinational-corporations/", "https://www.bmj.com/content/375/bmj.n2635", "https://ourworldindata.org/covid-vaccinations?country=OWID_WRL", "https://www.fool.com/investing/2021/12/03/pfizers-set-to-make-131-billion-in-covid-sales-in/", "https://wikileaks.org/Response-to-today-s-Bradley.html", "https://leadstories.com/hoax-alert/2021/11/fact-check-british-medical-journal-did-not-reveal-disqualifying-and-ignored-reports-of-flaws-in-pfizer-vaccine-trial.html", "https://www.thedailybell.com/all-articles/news-analysis/covid-propaganda-roundup-the-experts-say-con-game/", "https://www.bmj.com/content/375/bmj.n2635/rr-80", "https://www.factcheck.org/our-funding/", "https://www.bmj.com/content/375/bmj.n2635/rr-80", "https://www.armageddonprose.com/subscribe/", "https://armageddonprose.substack.com/", "https://www.patreon.com/benbartee", "https://gab.com/benbartee", "https://twitter.com/ArmageddonProse"], "authors": [], "publish_date": null}