{"result_id": "051042", "URL": "https://www.blacklistednews.com/article/79388/facebook-posts-back-up-vaers-reports-linking-covid-vaccines-to-injuries-including.html", "timestamp": "2023-04-25 12:19:52 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.blacklistednews.com/images/tabicon.ico", "canonical": "https://www.blacklistednews.com/article/79388/facebook-posts-back-up-vaers-reports-linking-covid-vaccines-to-injuries-including.html", "encoding": "utf-8"}, "image": null, "domain": "www.blacklistednews.com", "title": "Facebook Posts Back Up VAERS Reports Linking COVID Vaccines to Injuries, Including Death", "cleaned_text": "Facebook users have identified people who posted having a COVID-19 vaccination and then dying within hours.\n\nThe most recent Facebook post of 39-year-old Brittany Hall Perez of Atlanta on Jan. 12, for example, shows her wearing a mask while holding up a vaccination card with the slogan, “SAVE LIVES. Say Yes to COVID-19 vaccine,” and framing her photo. An obituary for Brittany Hall Perez of Owens Cross Roads, Alabama on Tribute Archive announced the death of the mother of two young girls on Jan. 13, but does not say how she died.\n\nOther Facebook users have pointed to the latest post of Julie Schlachter Splattstoesser, a 50-year-old from Grand Island, Neb., whose Facebook page features the motto “The love of a family is life’s greatest blessing” and shows her most recent post on Dec. 31, 2020 with her husband and a heart-shaped logo saying, “I GOT MY COVID-19 VACCINE!”\n\nAn obituary in The Grand Island Independent states that Splattstoesser, the mother of five sons, died “unexpectedly” on Dec. 31, 2020. She had been A Clinical Research Coordinator at CHI Health Cancer Treatment Center.\n\nA report from the government’s Vaccine Adverse Event Report System (VAERS) describes a 50-year-old Nebraska woman who died Dec. 31 on the same day that she received a Moderna vaccine after suffering from “cardio-respiratory arrest.” [918518]\n\nA few deaths following vaccinations have been reported in the mainstream media. A celebrated 68-year-old Detroit news anchor died suddenly the day after she received a COVID-19 vaccine, CBS Detroit reported. Karen Hudson-Samuel, who had been a Detroit media celebrity for decades, was found dead at her home by her husband, though the cause of her death is still unknown.\n\n“We suspect it may have just been a stroke, but because of the normal side effects of the vaccine it may have masked that. Hopefully, we’ll know soon from the autopsy report,” her husband, Cliff Samuels, told the news outlet.\n\nA man in his 70s collapsed 25 minutes after receiving a COVID-19 vaccine at the Javits Center in New York, KVOA News reported. He died later in hospital and New York health officials said he did not have an allergic reaction.\n\nThe Windsor Star reported that a woman’s death after the COVID-19 vaccination was being investigated but provided few details.\n\nAs of Feb. 12, 929 deaths, 616 life-threatening adverse events, 316 cases of permanent disability, and more than 5,000 hospitalizations and emergency room visits after COVID vaccinations were reported to VAERS, which is updated weekly.\n\n“VAERS reports alone cannot be used to determine if a vaccine caused or contributed to an adverse event or illness,” according to the CDC VAERS website. Rather, it is considered to be a tool for detecting “signals” or patterns of significant problems with vaccines. Any healthcare worker, vaccine manufacturer or member of the public can submit a report to VAERS, so interpretation is limited.\n\nStill, many VAERS reports give detailed pictures of adverse events that have occurred. For example, the 929 COVID-19 vaccination-associated reported deaths include information about the patient’s age, state and how long after vaccination their symptoms began as in the following samples:\n• A 58-year-old Washington woman took Pfizer’s first dose of COVID vaccine at about 9 a.m. on Jan. 4 at the medical center where she worked as a housekeeper and one hour later began to complain of nausea and feeling like she was going to pass out. By 3 p.m. that day, she “appeared tired and lethargic,” according to a VAERS report, and about 4 p.m. she “went into cardiac arrest and was unable to be revived.” [921768]\n• A 56-year-old man who worked at an extended care community facility in Florida received a second dose of Pfizer’s COVID vaccine on Jan. 12 and was found “unresponsive,” within one hour. He was pronounced “brain dead” the same day and died two days later. [944595]\n• A 58-year-old woman walked to her car 20 minutes after receiving the first Pfizer vaccine dose in the state of Virginia on Jan. 30. According to a VAERS report, she was leaning out of her car saying that she couldn’t breathe and began vomiting. She was administered two epi-pens and an epinephrine gas but became unresponsive shortly after she was put in an ambulance, where a “large amount of fluid was suctioned from the patient’s lungs,” and she was pronounced dead at the emergency department. [989006]\n• A 23-year-old New York man received a first dose of Pfizer’s COVID vaccine on Jan. 17. “Patient developed 104.4 temp approximately 48 hours after being given the vaccine. I treated him with antibiotics, IV fluids, cooling methods,” stated one report filed by a physician. “Unfortunately, he suffered a cardiac arrest on 1/21/21 in the early morning and expired.” [960841]\n• A 28-year-old New Jersey man was due for his second dose of Pfizer’s vaccine Jan. 11 but was found unresponsive at his workplace in the hospital. His pupils were “fixed and dilated,” according to a VAERS report, and attempts to revive him were unsuccessful. [943397]\n• A 33-year-old woman died on Jan. 28 following her first dose of Pfizer’s vaccine. The report filed by a physician stated that “16 hours after receiving the vaccine (the) patient was found dead at her home.” [1000669]\n• A 43-year-old man who received Moderna’s COVID vaccine on Jan. 8 in New York died the following day. [933578]\n• A 43-year-old woman with no pre-existing medical conditions and no known medications died six hours after receiving Pfizer’s COVID-19 vaccine on Jan. 13, according to a VAERS report made by a pharmacist. “An autopsy was not performed. The cause of death was unknown, death unexplained. No follow-up attempts are possible. No further information is expected,” the report stated. [965441]\n• A 48-year-old Tennessee woman experienced a temperature, nausea and vomiting after her first dose of Moderna’s COVID vaccine on Jan. 30 and died Feb. 1. [994913]\n• A 49-year-old Alabama woman had her first dose of Moderna’s vaccine on Jan. 15 and died within hours after suffering a seizure and heart attack. [950057]\n• A 53-year-old California man who received an injection of Pfizer’s COVID vaccine on Jan. 4 began to feel unwell immediately, according to one VAERS report. “He went right home and went to bed.” The man slept intermittently and began vomiting and developed trouble breathing. He was taken by ambulance to an urgent care facility, where became increasingly “agitated,” he continued vomiting and was dehydrated. The following morning, according to the VAERS report, “The patient stated that he couldn’t breathe, and his mind was racing.” He died at 10:15 am on Jan. 6 and, according to the VAERS report filed by his brother, “it was reported that none of the symptoms occurred until the patient received the vaccine.” [934968]\n• A 58-year-old Virginia pharmacist developed fatigue and shortness of breath hours after receiving Moderna’s second dose vaccine on Jan. 21. He was hospitalized two days later as his condition worsened, but he repeatedly tested negative for COVID-19. He died on Feb. 5. [1006168]\n• A 52-year-old Hawaiian woman died two hours after receiving Moderna’s first dose of COVID-19 vaccine, after having a stroke. [930910]\n\nThere are numerous reports of nursing home residents dying after COVID vaccinations.\n\nVAERS data descriptions of hundreds of cases of life-threatening and disabling illnesses include allergic shock reactions (anaphylaxis), paralysis, Guillain Barré Syndrome, sudden hearing loss, sudden blindness, seizures, strokes and encephalitis.", "opengraph": {"image": "https://childrenshealthdefense.org/wp-content/uploads/vaers-vaccine-adverse-event-reporting-covid-feature-1.jpg"}, "tags": ["Motherboard"], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/defender_category/covid/", "https://www.facebook.com/brittany.h.perez", "https://www.tributearchive.com/obituaries/19653656/Brittany-Hall-Perez/Owens-Cross-Roads/Alabama/Hampton-Cove-Funeral-Home", "https://childrenshealthdefense.org/defender/chd-files-first-amended-complaint-lawsuit-against-facebook/", "https://www.facebook.com/julie.schlachtersplattstoesser", "https://www.legacy.com/us/obituaries/theindependent/name/julie-splattstoesser-obituary?pid=197437538", "https://childrenshealthdefense.org/defender/rfk-jr-david-kessler-covid-vaccine-vaers/", "https://childrenshealthdefense.org/defender/pfizer-moderna-vaccines-life-threatening-blood-disorder/", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=918518", "https://childrenshealthdefense.org/defender/latest-data-cdc-vaers/", "https://detroit.cbslocal.com/2021/02/16/former-detroit-tv-anchor-dies-one-day-after-taking-covid-vaccine/", "https://childrenshealthdefense.org/defender/moderna-pfizer-vaccines-blood-clots-brain-inflammation-heart-attacks/", "https://childrenshealthdefense.org/defender/vaers-injuries-covid-vaccine-cdc-data/", "https://kvoa.com/coronavirus-coverage/2021/02/08/new-york-man-dies-25-minutes-after-receiving-covid-19-vaccine/", "http://sports.espn.go.com/mlb/scoreboard", "https://childrenshealthdefense.org/defender/latest-data-cdc-vaers/", "https://wonder.cdc.gov/controller/datarequest/D8;jsessionid=B65122D7057964467A74BB3C3370", "https://childrenshealthdefense.org/defender/thousands-covid-vaccine-injuries-13-deaths-reported-december/", "https://childrenshealthdefense.org/defender/johns-hopkins-scientist-medical-certainty-pfizer-vaccine-caused-death-florida-doctor/", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=921768", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=944595", "https://childrenshealthdefense.org/defender/woman-dies-hours-after-first-dose-pfizer-vaccine/", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=989006", "https://childrenshealthdefense.org/defender/vaers-injuries-covid-vaccine-cdc-data/", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=960841", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=943397", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=1000669", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=933578", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=965441", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=994913", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=950057", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=934968", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=1006168", "https://www.medalerts.org/vaersdb/findfield.php?IDNUMBER=930910", "https://www.lifesitenews.com/news/46-residents-in-spanish-nursing-home-die-after-receiving-covid-19-vaccine", "https://childrenshealthdefense.org/defender/nursing-home-residents-spain-die-pfizer-covid-vaccine/", "https://childrenshealthdefense.org/defender/pfizer-covid-vaccine-reaction-fda-peg/", "https://childrenshealthdefense.org/defender/bells-palsy-vaccines-whats-the-connection/"], "authors": [], "publish_date": null}