{"result_id": "051055", "URL": "https://www.blacklistednews.com/article/80752/red-cross-issues-warning-to-stop-blood-plasma-donations-from-vaccinated.html", "timestamp": "2023-04-25 12:19:56 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.blacklistednews.com/images/tabicon.ico", "canonical": "https://www.blacklistednews.com/article/80752/red-cross-issues-warning-to-stop-blood-plasma-donations-from-vaccinated.html", "encoding": "utf-8"}, "image": null, "domain": "www.blacklistednews.com", "title": "Red Cross issues warning to stop blood plasma donations from vaccinated people", "cleaned_text": "If you took a Wuhan coronavirus (Covid-19) “vaccine,” the American Red Cross will not accept blood plasma donations from you due to the inherent toxicity issues caused by the injection.\n\nAs it turns out, convalescent plasma should only be collected from the unvaccinated who still have clean blood that has not been contaminated with deadly spike proteins and other chemicals that threaten to kill those who receive blood transfusions.\n\nThanks to “Operation Warp Speed,” there is now a massive shortage of pure blood in the United States that has not been tainted with genetic modifications and other damage. Mass vaccination, in other words, is effectively killing people who desperately need unvaccinated blood but cannot find it.\n\nA now-archived document from the American Red Cross explains that anyone who takes “any type of COVID vaccine” is “not eligible to donate convalescent plasma” because of the serious risks involved.\n\n“One of the Red Cross requirements for plasma from routine blood and platelet donations that test positive for high-levels of antibodies to be used as convalescent plasma is that it must be from a donor that has not received a COVID-19 vaccine,” the document explains.\n\nScientifically speaking, it is critical for those receiving donor blood to have sufficient antibodies directly related to their own immune systems. Tainted blood from vaccinated people does not qualify.\n\n“This is to ensure that antibodies collected from donors have sufficient antibodies directly related to their immune response to a COVID-19 infection and not just the vaccine, as antibodies from an infection and antibodies from a vaccine are not the same.”\n\nThe U.S. Food and Drug Administration (FDA) apparently thinks differently about vaccinated blood.\n\nA new document on the Red Cross website now explains that because the FDA “allows people who have received a COVID-19 vaccine to donate dedicated COVID-19 convalescent plasma,” the Red Cross has decided to discontinue its convalescent plasma donation program entirely.\n\n“The FDA allows people who have received a COVID-19 vaccine to donate dedicated COVID-19 convalescent plasma within six months of their infection of the virus, based on data that antibodies from natural infection can decline after six months however, the Red Cross has discontinued our convalescent plasma collection program,” the new document explains.\n\nIn other words, it would appear as though the Red Cross is not comfortable continuing to collect and administer convalescent plasma from people who took the jab, even though the FDA claims that doing so is completely safe.\n\nThis type of thing is par for the course for the FDA, which rarely promotes policies that benefit actual human beings. The agency really is nothing more than an extension of Big Pharma that does whatever is necessary to keep the profits flowing – even at the expense of human life.\n\n“The antibodies naturally produced by covid infection actually work,” wrote one commenter at Citizen Free Press.\n\n“The antibodies artificially produced by covid vaccines do not work as well, and actually wipe out the natural covid antibodies. This is why vaccinated people are increasingly becoming significantly ill with covid.”\n\nAnother commenter wrote that the Red Cross is denying that it does not accept convalescent plasma from vaccinated people, even though the document on its website claims otherwise.\n\n“The FDA says that you can donate convalescent plasma within six months of infection, even if you’ve been vaccinated,” this person wrote, calling it a “legal lie.”\n\n“But the Red Cross guidelines prohibit them from using convalescent plasma if the individual has been vaccinated.”", "opengraph": {"image": "https://www.naturalnews.com/wp-content/uploads/sites/91/2021/09/Science-Lab-Sample-Blood-Test.jpg"}, "tags": ["Motherboard"], "tweets": [], "movies": [], "links": ["https://citizenfreepress.com/breaking/red-cross-vaccine-alert-you-gotta-hear-this/", "https://web.archive.org/web/20210612044557/https://www.redcrossblood.org/content/dam/redcrossblood/docs/covid19_newdonor_vaccine_guide.pdf", "https://www.redcrossblood.org/content/dam/redcrossblood/docs/covid19_newdonor_vaccine_guide.pdf", "https://citizenfreepress.com/breaking/red-cross-vaccine-alert-you-gotta-hear-this/", "https://web.archive.org/web/20210612044557/https://www.redcrossblood.org/content/dam/redcrossblood/docs/covid19_newdonor_vaccine_guide.pdf", "https://www.redcrossblood.org/content/dam/redcrossblood/docs/covid19_newdonor_vaccine_guide.pdf"], "authors": [], "publish_date": null}