{"result_id": "051036", "URL": "https://www.blacklistednews.com/article/84084/kenya-is-being-used-as-a-testing-ground-for-biometricbased-vaccine-tracking-for.html", "timestamp": "2023-04-25 12:19:50 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.blacklistednews.com/images/tabicon.ico", "canonical": "https://www.blacklistednews.com/article/84084/kenya-is-being-used-as-a-testing-ground-for-biometricbased-vaccine-tracking-for.html", "encoding": "utf-8"}, "image": null, "domain": "www.blacklistednews.com", "title": "Kenya is being used as a testing ground for biometric-based vaccine tracking for babies", "cleaned_text": "Advancements are being made in controversial tests carried out in a hospital in a small town in Kenya to develop a biometric vaccination management tracking program for newborns.\n\nThe new method aims to ensure that as soon as a child is born and receives their first vaccine, biometric scanning of four of their fingers takes place, and in addition to fingerprinting babies, their caregivers’ biometric voice data is also collected.\n\nThe purpose of this is to monitor identities and manage vaccination histories, those behind the scheme said, noting that it is supposed to be used for the first 24 months of the babies’ lives and track how eight vaccines and one supplement are given to them.\n\nBoth the fingerprints and the voice data will then allegedly be removed, the group developing the biometric system has promised.\n\nBiometric authentication company NEC, the Kenya Medical Research Institute (KEMRI), and Nagasaki University from Japan are the ones who in 2019 partnered to develop the program, which is currently undergoing clinical trials at Kinango Sub-County Hospital in Kwale, Kenya.\n\nThe trials, which started in September and are scheduled to last through March, have covered a total of 1,000 newborn babies and their caregivers. Even though the tests are not over, the early results are now coming in, which the three partners describe as “highly encouraging.”", "opengraph": {"image": "https://reclaimthenet.org/wp-content/uploads/2023/02/kenya-657.jpg"}, "tags": ["Motherboard"], "tweets": [], "movies": [], "links": ["https://reclaimthenet.org/researchers-are-testing-biometric-recognition-of-newborns-for-vaccinations", "https://www.nec.com/"], "authors": [], "publish_date": null}