{"result_id": "051027", "URL": "https://www.blacklistednews.com/article/84332/white-house-tried-to-censor-private-whatsapp-messages-about-vaccine.html", "timestamp": "2023-04-25 12:19:46 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.blacklistednews.com/images/tabicon.ico", "canonical": "https://www.blacklistednews.com/article/84332/white-house-tried-to-censor-private-whatsapp-messages-about-vaccine.html", "encoding": "utf-8"}, "image": null, "domain": "www.blacklistednews.com", "title": "White House Tried to Censor Private WhatsApp Messages About Vaccine Skepticism", "cleaned_text": "Leaked emails show that the White House was intent on pressuring messaging platform WhatsApp to censor private conversations about ‘vaccine skepticism’.\n\nThe revelation is perhaps even more alarming than the Biden administration’s efforts to shut down dissent on public social media networks such as Facebook and Twitter, because the lobbying pertained to information exchanged between as a few as two people.\n\nThe leaked emails were featured in a Substack article written by journalist and author David Zweig.\n\nFrom March 2021 onwards, Rob Flaherty, the Biden White House’s Director of Digital Strategy, demanded WhatsApp owner Meta explain the actions it was taking to intervene in private conversations about the COVID vaccine between WhatsApp users.\n\n“If you can’t see the message, I’m genuinely curious—how do you know what kinds of messages you’ve cut down on?” Flaherty asked.\n\nFlaherty and Andrew Slavitt, then the White House Senior Advisor on the Covid Response, wanted to set up phone calls with a Meta executive a “couple of times per week” if necessary to oversee the censorship.\n\n“I care mostly about what actions and changes you’re making to ensure you’re not making our country’s vaccine hesitancy problem worse,” Flaherty wrote on April 9, 2021.\n\n“I still don’t have a good, empirical answer on how effective you’ve been at reducing the spread of vaccine-skeptical content and misinformation to vaccine fence sitters,” he added.\n\nThe White House wanted non-public messages about vaccine skepticism to be brought “under control,” a chilling interference in private encrypted conversations.\n\n“What, exactly, was he hoping to get Meta to do?” asks Zweig.\n\n“It was obvious from the start that WhatsApp’s interface didn’t allow for the granular control Flaherty appeared to desire. And his smiley face response suggests he well understood this. Yet he kept badgering the Meta executives anyway.”\n\nMeta was seemingly unable to satisfy the Biden administration’s demands, perhaps wary that directly censoring people’s ability to communicate with their own friends and family would have represented a massive public relations disaster.", "opengraph": {"image": "https://cdn.summit.news/2023/03/270323whatsapp1.jpg"}, "tags": ["Motherboard"], "tweets": [], "movies": [], "links": ["https://davidzweig.substack.com/p/biden-white-house-pressured-meta?sd=pf"], "authors": [], "publish_date": null}