{"result_id": "052045", "URL": "https://www.blckbx.tv/gezondheid/twitter-censureert-topwetenschapper-die-mrna-vaccins-linkt-aan-apenpokken", "timestamp": "2023-04-25 12:20:55 CEST+0200", "meta": {"description": "Prof. Shmuel Shapira MD MPH (Kol.), een van Israëls meest vooraanstaande wetenschappers, suggereerde in een tweet dat de uitbraak van apenpokken verband…", "lang": "nl", "keywords": "", "favicon": "https://www.blckbx.tv/dist/img/favicons/favicon.ico", "canonical": "https://www.blckbx.tv/gezondheid/twitter-censureert-topwetenschapper-die-mrna-vaccins-linkt-aan-apenpokken", "encoding": "utf-8"}, "image": null, "domain": "www.blckbx.tv", "title": "Twitter censureert topwetenschapper die mRNA-vaccins linkt aan…", "cleaned_text": "Prof. Shapira, die in januari 2022 zijn Twitter-account startte, is steeds kritischer geworden over de mRNA-vaccins sinds hij voor het eerst de Israëlische Genesis Award aan de kaak stelde omdat die werd uitgereikt aan Pfizer-CEO Albert Bourla.\n\nOp 18 januari 2022, zei Shapira (vertaald uit het Hebreeuws door Google): \"De Israëlische Genesis Award werd gegeven aan de CEO van Pfizer, zo ellendig. In plaats van hem te geven aan een Israëlische wetenschapper, en dat voor een middelmatig, kortwerkend vaccin dat Pfizer een miljardenwinst opleverde, een ellendige en verbannen. Bourla zal nu benoemd worden tot Koning van Israël. Ik herinner u eraan dat gevaccineerd Israël de vierde plaats inneemt wat betreft het aantal coronapatiënten in de wereld. Er is een kampioenschap!\"\n\nOp 6 februari, 2022, vroeg Shapira: \"Welk cijfer zou u geven aan een vaccin waarmee mensen drie keer worden ingeënt en twee keer ziek worden (vanaf vandaag)? Om nog maar te zwijgen van aanzienlijke bijwerkingen[.]\"\n\nOp 9 april 2022 zei Shapira: \"De CEO van het bedrijf, waarvan miljoenen vaccins in Israël werden gebruikt voor vaccinatie, verklaarde in een interview met NBC dat Israël dient als het laboratorium van de wereld. Voor zover ik weet, is dit het eerste geval in de geschiedenis waarbij experimentele proefkonijnen een exorbitant tarief betaalden voor hun deelname.\"\n\nOp 13 mei 2022, zei Shapira: \"Ik heb 3 vaccinaties gekregen, ik ben lichamelijk zeer ernstig gewond geraakt zoals vele anderen[.] En bovendien is mijn vertrouwen in de aard van de beslissingen en in de processen om ze te nemen ernstig uitgehold. Niemand heeft gevraagd en gecontroleerd. Ik zal uit alle macht ervoor vechten dat er waarheidsgetrouwe antwoorden worden gegeven over alle beslissingen en niet alleen over het vaccin[.]\"\n\nOp 8 juni 2020 sprak premier Benjamin Netanyahu via een videoconferentie met de directeur-generaal van het Israëlisch Instituut voor Biologisch Onderzoek, prof. Shmuel Shapira, en feliciteerde hem met zijn vooruitgang bij de ontwikkeling van een vaccin tegen het nieuwe coronavirus. \n\n\n\nOp 7 juni 2022, zei Shapira: \"We hebben het over vaccin vijf in twee en een half jaar. Wanneer het vaccin is gepland voor de reeks vanaf januari 2020 (de overgrootvader van de overgrootvader van de huidige varianten). Een vaccin dat infectie niet voorkomt, voorkomt ook geen morbiditeit. En het wordt naar verluidt toegeschreven aan aanzienlijke bijwerkingen om het zacht uit te drukken. Waarom? Wat is de logica? Welke autoriteit heeft het goedgekeurd? En zeg niet dat het een ernstige ziekte voorkomt, niemand heeft dat bewezen.\"\n\nOp 8 juni 2022, zei Shapira: \"Ik zal doorgaan en vragen waarom een verouderd vijfde vaccin geven dat geen ziekte voorkomt en blijkbaar veel belangrijke veel voorkomende bijwerkingen veroorzaakt.\"\n\nOp 5 juli 2022 besprak Shapira de ‘zoon van een 36-jarige Australische vriend’ die ‘ernstige ventriculaire aritmieën ontwikkelde en in hartfalen raakte’ slechts ‘dagen na het tweede Pfizer-vaccin’.\n\n\"De compensatie is automatisch door de Australische regering,\" zei hij. \"Ondanks het gedrag van hun regering geven ze het verband toe en komt de uitdrukking 'geen verband' niet in het lexicon voor.\"\n\nOp 15 juli 2022 deelde Shapira een grafiek van COVID-cijfers uit New South Wales die een verhoogd risico op COVID-infectie laat zien met elke nieuwe dosis van het mRNA-vaccin waarop hij commentaar gaf: \"Volgens officiële gegevens uit Australië is de kans dat je ziek wordt groter naarmate je meer injecties krijgt, want bij de vierde injectie neemt de kans dramatisch toe. Volgens deze studie zou het een anti-vaccin zijn, althans volgens wat mij is geleerd.\"\n\nOp 18 juli 2022, zei Shapira: \"Ik ben niet anti-vaccin, ik ben anti-domheid, anti-vervalste wetenschap, en anti-incompetent management.\"\n\nOp 28 juli 2022, zei Shapira: \"T waarschuwde me om de T te verwijderen die MP verbindt met C. Elke dag begrijp ik beter waar we leven en in welk jaar.\"\n\nMet andere woorden, Twitter waarschuwde hem om de tweet te verwijderen die apenpokken verbond met het COVID-vaccin.\n\nOp 31 juli 2022 deelde Shapira een link naar de OpenVaers COVID Vaccine Adverse Event Reports die een totaal van 1.357.937 meldingen lieten zien, waaronder 170.151 ziekenhuisopnames en 29.790 sterfgevallen, waarboven hij simpelweg opmerkte: \"Veilig en efficiënt.\"\n\nSamenvattend kan worden gezegd dat professor Shmuel Shapira, als directeur-generaal van het Israëlisch Instituut voor Biologisch Onderzoek, wellicht de hoogstgeplaatste medisch-wetenschapper ter wereld is die openlijk kritiek heeft op de COVID-vaccins.\n\nHet Israel Institute for Biological Research werd in 1952 opgericht als een onderzoeksinstituut van de overheid, door een groep wetenschappers van de Israel Defense Forces.\n\nSindsdien heeft het IIBR zich beziggehouden met O&O op het gebied van biologie, scheikunde en milieuwetenschappen om de Staat Israël te voorzien van verdedigingsmogelijkheden tegen chemische en biologische wapens.\n\nIn een post-lockdown wereld, waar regeringen steeds meer samenwerken met Twitter, Facebook en YouTube om kritiek op COVID-vaccins te censureren, wordt zelfs een hooggeplaatste medisch-wetenschapper het zwijgen opgelegd omdat hij spreekt over de wetenschap die het verhaal van de farmaceutische industrie tegenspreekt.\n\nHopelijk kan professor Shmuel Shapira – die voorheen de topwetenschapper van het Israëlische leger was in het onderzoek naar chemische en biologische wapens – zich nu richten op de COVID mRNA-vaccins en meer aandacht vestigen op de dood en vernietiging die zij veroorzaken voor velen over de hele wereld.", "opengraph": {"locale": "nl_NL", "site_name": "blckbx", "type": "website", "url": "https://www.blckbx.tv/gezondheid/twitter-censureert-topwetenschapper-die-mrna-vaccins-linkt-aan-apenpokken", "title": "Twitter censureert topwetenschapper die mRNA-vaccins linkt aan…", "description": "Prof. Shmuel Shapira MD MPH (Kol.), een van Israëls meest vooraanstaande wetenschappers, suggereerde in een tweet dat de uitbraak van apenpokken verband houdt met mRNA-vaccins. Dat mag niet van Twitter, dat hem dwong het bericht te verwijderen.", "image": "https://www.blckbx.tv/uploads/2022/08/05/_1200x630_crop_center-center_82_none/2022-08-05-voor-wtenschapper-linkt-mrna-aan-apenpokken.jpg?mtime=1659682898", "image:width": "1200", "image:height": "630"}, "tags": ["mRNA-vaccin", "Pfizer", "COVID-vaccinaties", "Twitter", "Vrijheid van meningsuiting", "The Great Reset", "Apenpokken", "Corona", "blckcheck", "Israël", "meer", "blckbx news", "Prof. Shmuel Shapira", "blckbx today", "mRNA", "Censuur", "Vaccin", "Bijwerkingen", "Documentaires", "Vaccinatieschade", "Privacy"], "tweets": [], "movies": [], "links": ["https://twitter.com/shmuelcshapira/status/1483664103830863876", "https://twitter.com/shmuelcshapira/status/1490580586892869634", "https://twitter.com/shmuelcshapira/status/1513060714356772864", "https://twitter.com/shmuelcshapira/status/1525377945551904768", "https://twitter.com/shmuelcshapira/status/1534409890084532224", "https://twitter.com/shmuelcshapira/status/1534475572495122432", "https://twitter.com/shmuelcshapira/status/1544327996013682690", "https://twitter.com/shmuelcshapira/status/1548215766654148608", "https://twitter.com/shmuelcshapira/status/1549029219937787905", "https://twitter.com/shmuelcshapira/status/1552607961024962560", "https://openvaers.com/covid-data", "https://twitter.com/shmuelcshapira/status/1553979369504342018", "https://www.iibr.gov.il/Pages/Who-We-are.aspx", "https://www.blckbx.tv/tech-media/amerikaanse-rivm-gaf-big-tech-bedrijven-censuurinstructies"], "authors": [], "publish_date": "8 maanden geleden"}