{"result_id": "052069", "URL": "https://www.blckbx.tv/corona/studie-die-aantoont-dat-mrna-vaccins-immuunsysteem-schaden-nu-peer-reviewed", "timestamp": "2023-04-25 12:21:18 CEST+0200", "meta": {"description": "In januari toonde een preprint studie aan dat COVID-mRNA-vaccins het immuunsysteem onderdrukken, wat het risico op infectieziektes en kanker vergroot. Het…", "lang": "nl", "keywords": "", "favicon": "https://www.blckbx.tv/dist/img/favicons/favicon.ico", "canonical": "https://www.blckbx.tv/corona/studie-die-aantoont-dat-mrna-vaccins-immuunsysteem-schaden-nu-peer-reviewed", "encoding": "utf-8"}, "image": null, "domain": "www.blckbx.tv", "title": "Studie die aantoont dat mRNA-vaccins immuunsysteem schaden nu peer…", "cleaned_text": "Begin dit jaar werd de studie ‘Innate immune suppression by SARS-CoV-2 mRNA vaccinations: The role of G-quadruplexes, exosomes, and MicroRNAs’ in preprint gepubliceerd.\n\nDe bevindingen uit de studie zijn vernietigend voor COVID-mRNA-vaccins. De auteurs, waaronder cardioloog prof. dr. Peter McCullough, zeiden te hebben bewezen dat de producten schade toebrengen aan het aangeboren immuunsysteem en daarmee zorgen voor een verhoogd risico op infectieziektes en kanker. Ook stellen ze dat het spike-eiwit in de mRNA-vaccins neurotoxisch is en DNA-herstelmechanismen schaadt.\n\nDe betreffende studie is sinds kort gepubliceerd in Food and Chemical Toxicology van uitgever Elsevier.\n\n\n\nEen is voor een studie in wetenschappelijke kringen van groot belang. Het betekent dat de studieresultaten onafhankelijk zijn geverifieerd en bevestigd door andere wetenschappers. Er kan dan met meer zekerheid van worden uitgegaan dat de bevindingen uit de studie kloppen.\n\n\n\nHieronder een kort overzicht van de verontrustende bevindingen, die nu dus ook door andere wetenschappers worden onderschreven. In de studie worden de conclusies uitgebreid onderbouwd.\n\n“In deze studie presenteren wij bewijzen dat vaccinatie een diepgaande verstoring van de type I interferonsignalering veroorzaakt, die diverse nadelige gevolgen heeft voor de menselijke gezondheid,” aldus de wetenschappers in de samenvatting van de studie. “Immuuncellen die de nanodeeltjes van het vaccin hebben opgenomen, laten in de circulatie grote aantallen exosomen vrij die spike-eiwit bevatten samen met kritische microRNA's die een signaalreactie induceren in ontvangende cellen op afgelegen plaatsen.”\n\nDe auteurs stelden mogelijke ingrijpende verstoringen vast in de regulerende controle van de eiwitsynthese en de kankerbewaking. “Deze verstoringen hebben mogelijk een oorzakelijk verband met neurodegeneratieve ziekten, myocarditis [hartspierontsteking], immuuntrombocytopenie [een auto-immuunziekte waarbij je te weinig bloedplaatjes hebt], Bell’s palsy [aangezichtsverlamming], leverziekten, verminderde adaptieve immuniteit, verminderde DNA-schaderespons en tumorvorming.”\n\n\n\n“Ten eerste is er de uitvoerig gedocumenteerde ondermijning van de aangeboren immuniteit. Deze onderdrukking zal een hele reeks gevolgen hebben, waaronder niet in de laatste plaats de reactivering van latente virale infecties en het verminderde vermogen om toekomstige infecties effectief te bestrijden.”\n\n“Ten tweede is er de ontregeling van het systeem voor zowel het voorkomen als het opsporen van genetisch gestuurde kwaadaardige transformatie in cellen en de daaruit voortvloeiende mogelijkheid dat vaccinatie die transformatie bevordert.”\n\n“Ten derde kan mRNA-vaccinatie de intracellulaire communicatie door exosomen verstoren, en cellen die mRNA van het spike-glycoproteïne opnemen ertoe aanzetten hoge niveaus van spike-glycoproteïne-dragende exosomen te produceren, met mogelijk ernstige ontstekingsgevolgen.”\n\nBovenstaande gevaren zouden volgens de wetenschappers enorme gevolgen kunnen hebben voor miljarden mensen overal ter wereld en kunnen bijdragen tot de ziektelast op zowel korte als lange termijn waarmee de gezondheidszorg wordt geconfronteerd.", "opengraph": {"locale": "nl_NL", "site_name": "blckbx", "type": "website", "url": "https://www.blckbx.tv/corona/studie-die-aantoont-dat-mrna-vaccins-immuunsysteem-schaden-nu-peer-reviewed", "title": "Studie die aantoont dat mRNA-vaccins immuunsysteem schaden nu peer…", "description": "In januari toonde een preprint studie aan dat COVID-mRNA-vaccins het immuunsysteem onderdrukken, wat het risico op infectieziektes en kanker vergroot. Het onderzoek is nu peer reviewed , ofwel onafhankelijk geverifieerd en bevestigd door andere wetenschappers.", "image": "https://www.blckbx.tv/uploads/2022/11/15/_1200x630_crop_center-center_82_none/2022-11-15-studie-mrna-immuunsysteem.jpg?mtime=1668526586", "image:width": "1200", "image:height": "630"}, "tags": ["Studie", "mRNA-vaccin", "blckbx today", "Kanker", "dr. Peter McCullough", "meer", "Corona", "blckcheck", "Bell's palsy", "Bijwerkingen", "Documentaires", "Trending", "Censuur", "Immuunsysteem", "Vaccin", "blckbx news", "The Great Reset", "Privacy"], "tweets": [], "movies": [], "links": ["https://europepmc.org/article/PPR/PPR445230", "https://www.sciencedirect.com/science/article/pii/S027869152200206X?via%3Dihub", "https://www.sciencedirect.com/science/article/pii/S027869152200206X?via%3Dihub", "https://www.simpto.nl/menselijk-lichaam/interferonen/", "https://saayarelo.com/nl/wat-zijn-exosomen-en-waarom-zijn-ze-belangrijk/", "https://nl.wikipedia.org/wiki/MicroRNA", "https://vetgezond.nl/wat-is-eiwitsynthese/"], "authors": [], "publish_date": "5 maanden geleden"}