{"result_id": "052025", "URL": "https://www.blckbx.tv/corona/vws-misleidde-bevolking-met-vaccin-reclame-slogan-je-doet-het-voor-een-ander", "timestamp": "2023-04-25 12:20:28 CEST+0200", "meta": {"description": "Het RIVM liet al in december 2020 aan het ministerie van VWS weten dat niet bewezen was dat coronavaccins verspreiding voorkwamen. Toch zette het…", "lang": "nl", "keywords": "", "favicon": "https://www.blckbx.tv/dist/img/favicons/favicon.ico", "canonical": "https://www.blckbx.tv/corona/vws-misleidde-bevolking-met-vaccin-reclame-slogan-je-doet-het-voor-een-ander", "encoding": "utf-8"}, "image": null, "domain": "www.blckbx.tv", "title": "VWS misleidde bevolking met vaccin-reclame-slogan ‘Je doet het voor…", "cleaned_text": "Het RIVM liet al in december 2020 aan het ministerie van VWS weten dat niet bewezen was dat coronavaccins verspreiding voorkwamen. Toch zette het ministerie emotionele chantage in om mensen over te halen zich te laten injecteren.\n\nDit blijkt uit een Wob-document dat gisteren door data-analist Cees van den Bos werd gepubliceerd op Twitter. Een RIVM-medewerker uit op 21 december 2020 in een e-mail aan VWS kritiek op de slogan die het ministerie wilde gebruiken bij de vaccinatiecampagne. Het bericht gaat over de volgende zin: ‘Een vaccinatie tegen het coronavirus beschermt uzelf, maar ook uw familie, vrienden, collega’s en de kwetsbare mensen om u heen.’ Daarover schrijft de RIVM-medewerker: “Dat klopt in feite niet. Het vaccin voorkomt dat iemand ziek wordt, maar het is niet bewezen dat het ook verspreiding voorkomt. Wij mogen dit vanuit het RIVM dan ook niet zo zeggen.”\n\nInteressant. VWS vraagt op 21/12/2020 aan het RIVM of hun reclameslogan over de vaccins klopt.\n\n\n\nRIVM wijst VWS erop dat niet bewezen is dat de vaccins verspreiding van het virus voorkomt.\n\n\n\nHoe ging die campagne ook al weer? \"We doen het voor elkaar. Je doet het voor de ander.\" pic.twitter.com/abxGaeuG8v — Cees (@CeesCees72) September 15, 2022\n\nIn deze video zegt de voice over: “Om jezelf en uiteindelijk de mensen om je heen te beschermen tegen het coronavirus, is vaccineren de belangrijkste stap. Dus laten we onze mouwen opstropen. Als we ons laten vaccineren, krijgen we stapje voor stapje onze vrijheid terug.” Gezondheidswetenschapper Yvonne Simons merkt terecht op: “Dat ‘je doet het voor je opa’ was emotionele chantage om de vaccinatiebereidheid te verhogen.” Veel mensen die de mouw niet wilden opstropen hebben dat destijds ook zo ervaren. Zij werden uitgemaakt voor egoïsten die anderen moedwillig in gevaar brachten. Een ander vrijgegeven Wob-document dat Van den Bos gisteren publiceerde laat een pagina zien uit een studieproject van Eugène van Loos (Universiteit Utrecht) dat gaat over vaccinatiebereidheid en desinformatie. Om mensen te enthousiasmeren voor de prik ‘is het van belang het vertrouwen in dit eerste vaccin en de toekomstige vaccins vanaf het begin zo groot mogelijk te krijgen door nu al verschillende communicatie-uitingen te gebruiken’, stelt het document. “Daarin moet het niet alleen gaan over vaccin-informatie, maar ze moeten ook inspelen op emotie,” wordt eraan toegevoegd. Het document raadt verder aan de vaccin-promotie zoveel mogelijk te herhalen en BN’ers in te zetten die zich publiekelijk laten vaccineren om zo mensen over de streep te trekken in de strijd tegen het verkoudheidsvirus. \n\n\n\nBlckbx is een stichting zonder winstoogmerk die wordt gefinancierd door donaties van haar eigen publiek. Voor de mensen, door de mensen en met de mensen: dát is waar blckbx voor staat. Hoewel we ervoor zorgen dat we de kosten zo minimaal mogelijk houden, zijn er toch doorlopende kosten om gedegen en professionele content te maken. Denk hierbij aan de techniek, de regie, de redactie, de webredactie en het onderhoud van de studio. Om de continuïteit van blckbx te waarborgen, hebben we daarom jouw hulp nodig. Als je dit artikel waardeert en de urgentie van Nederlands grootste onafhankelijke nieuwsplatform inziet, dan nodigen we je van harte uit om ons te steunen. Alleen dankzij regelmatige donaties kunnen wij onafhankelijke content blijven produceren en onze reikwijdte vergroten, met als doel om de wereld beter te begrijpen. Voor de mensen, door de mensen en met steeds méér mensen.", "opengraph": {"locale": "nl_NL", "site_name": "blckbx", "type": "website", "url": "https://www.blckbx.tv/corona/vws-misleidde-bevolking-met-vaccin-reclame-slogan-je-doet-het-voor-een-ander", "title": "VWS misleidde bevolking met vaccin-reclame-slogan ‘Je doet het voor…", "description": "Het RIVM liet al in december 2020 aan het ministerie van VWS weten dat niet bewezen was dat coronavaccins verspreiding voorkwamen. Toch zette het ministerie emotionele chantage in om mensen over te halen zich te laten injecteren.", "image": "https://www.blckbx.tv/uploads/2022/09/16/_1200x630_crop_center-center_82_none/2022-09-16-VWS2-Cropped.jpg?mtime=1663324307", "image:width": "900", "image:height": "266"}, "tags": ["VWS", "blckbx today", "Cees van den Bos", "meer", "Corona", "blckcheck", "RIVM", "Censuur", "Documentaires", "Vaccin", "blckbx news", "The Great Reset", "wob-documenten", "Privacy"], "tweets": ["<blockquote class=\"twitter-tweet\"><p lang=\"nl\" dir=\"ltr\">Interessant. VWS vraagt op 21/12/2020 aan het RIVM of hun reclameslogan over de vaccins klopt.<br/><br/>RIVM wijst VWS erop dat niet bewezen is dat de vaccins verspreiding van het virus voorkomt.<br/><br/>Hoe ging die campagne ook al weer? \"We doen het voor elkaar. Je doet het voor de ander.\" <a href=\"https://t.co/abxGaeuG8v\">pic.twitter.com/abxGaeuG8v</a></p>— Cees (@CeesCees72) <a href=\"https://twitter.com/CeesCees72/status/1570364301906300928?ref_src=twsrc%5Etfw\">September 15, 2022</a></blockquote> ", "<blockquote class=\"twitter-tweet\"><p lang=\"nl\" dir=\"ltr\">Verder staan er nog herkenbare zaken in zoals de BN'ers die zich voor de camera lieten prikken, propaganda op social media, etc. <a href=\"https://t.co/XRdZBQv8jY\">pic.twitter.com/XRdZBQv8jY</a></p>— Cees (@CeesCees72) <a href=\"https://twitter.com/CeesCees72/status/1570504509922869248?ref_src=twsrc%5Etfw\">September 15, 2022</a></blockquote> "], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/v_uCeflDfco\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/v_uCeflDfco"}], "links": ["https://twitter.com/CeesCees72", "https://t.co/abxGaeuG8v", "https://twitter.com/CeesCees72/status/1570364301906300928?ref_src=twsrc%5Etfw", "https://www.youtube.com/watch?v=s8TJZYVK2g8", "https://twitter.com/IkNet/status/1570422807888285699", "https://t.co/XRdZBQv8jY", "https://twitter.com/CeesCees72/status/1570504509922869248?ref_src=twsrc%5Etfw", "https://www.blckbx.tv/steun-blckbx"], "authors": [], "publish_date": "7 maanden geleden"}