{"result_id": "052038", "URL": "https://translate.google.com/translate?hl=en&sl=nl&u=https://www.blckbx.tv/corona/fda-linkt-pfizer-vaccin-aan-bloedstolling-maar-adviseert-toch-om-door-te-prikken&prev=search&pto=aue", "timestamp": "2023-04-25 12:20:45 CEST+0200", "meta": {"description": "Een onderzoek van de Amerikaanse Food and Drug Administration (FDA) toont aan dat het COVID-19-vaccin van Pfizer bloedstolling veroorzaakt. Tot ontzetting…", "lang": "nl", "keywords": "", "favicon": "https://www.blckbx.tv/dist/img/favicons/favicon.ico", "canonical": "https://www.blckbx.tv/corona/fda-linkt-pfizer-vaccin-aan-bloedstolling-maar-adviseert-toch-om-door-te-prikken", "encoding": "utf-8"}, "image": null, "domain": "translate.google.com", "title": "FDA linkt Pfizer-vaccin aan bloedstolling maar adviseert toch om door…", "cleaned_text": "Onderzoekers van medicijnwaakhond FDA ontdekten tijdens een grootschalig onderzoek naar de bijwerkingen van COVID-vaccins dat het vaccin van Pfizer de grenswaarden voor het veroorzaken van longembolie – bloedstolling in de longen – overschrijdt.\n\nPfizer overschreed de aanvankelijke drempel voor een statistisch signaal en deed dat ook na een grondiger evaluatie van de criteria.\n\n\n\nTijdens het onderzoek keken de onderzoekers van de FDA naar gegevens van 17,4 miljoen oudere Amerikanen die in totaal 34,6 miljoen vaccin doses ontvingen tussen 10 december 2020 en 16 januari 2022. De studie werd onlangs gepubliceerd door het tijdschrift Vaccine.\n\n\n\nDrie andere bijwerkingen – gebrek aan zuurstof naar het hart, een stoornis in de bloedplaatjes genaamd immuun trombocytopenie, en een ander type stolling genaamd intravasale stolling – gaven aanvankelijk aanleiding tot ‘rode vlaggen’, aldus de onderzoekers. Meer diepgaande evaluaties, zoals vergelijkingen met populaties die griepvaccins kregen, toonden aan dat deze drie niet langer voldeden aan de ‘statistische drempel voor een signaal’.\n\nOndanks de alarmerende resultaten zegt de FDA dat het geen actie onderneemt, ‘omdat het onderzoek niet onomstotelijk bewijst dat de vaccins de uitkomsten veroorzaakten, en omdat de bevindingen nog steeds worden onderzocht en meer robuuste studie vereisen’. De FDA stelt zelfs dat het ‘sterk gelooft dat de potentiële voordelen van COVID-19-vaccinatie opwegen tegen de potentiële risico's van COVID-19-infectie’, zonder daarvoor bewijs aan te voeren.\n\nCardioloog dr. Peter McCullough, hoofd medisch adviseur van de Truth for Health Foundation, vindt de beslissing om geen actie te ondernemen onbegrijpelijk. In een e-mail aan The Epoch Times laat hij weten dat de studie van de FDA ‘de bezorgdheid van artsen bevestigt dat de grote toename van bloedstolsels, progressie van atherosclerotische hartziekten en bloedaandoeningen onafhankelijk geassocieerd is met COVID-19-vaccinatie’.\n\nOp zijn onlangs gereactiveerde Twitter-account voegt McCullough daaraan toe. “Explosie van bloedstolsels in mijn klinische praktijk gedurende de afgelopen twee jaar sinds hun marktintroductie. Van de vroege proeven tot de gepubliceerde literatuur, het signaal is heel duidelijk. Sterke reden om producten van de markt te halen.”\n\nFDA-onderzoekers, met hulp van onderzoekers van de Centers for Medicare & Medicaid Services (CMS), analyseerden gegevens uit de CMS-database. Ze omvatten Medicare Fee-for-Service-begunstigden van 65 jaar of ouder.\n\nDe onderzoekers gebruikten kansberekening om een verhoogd risico op een of meer van veertien uitkomsten na vaccinatie op te sporen. Het doel was na te gaan of vaccinatie het risico op ongunstige uitkomsten kan verhogen, zoals longembolie, of bloedstolling in de longen. Als een resultaat een bepaalde statistische drempel haalde, betekende dit dat het risico verhoogd kon zijn.\n\nDe eerste resultaten van de veiligheidscontrole detecteerden een verhoogd risico van vier gebeurtenissen, kondigde de FDA aan op 12 juli 2021. Het waren dezelfde vier die in de recente studie worden beschreven, wat de eerste update is die het agentschap over de zaak heeft gegeven sinds zijn aankondiging.\n\nVanaf 15 januari 2022 werden 9.065 gevallen van een gebrek aan zuurstof naar het hart – bekend als acuut myocardinfarct – vastgesteld, onthulden onderzoekers in de nieuwe studie. Vanaf dezelfde datum werden 6.346 gevallen van longembolie, 1.064 gevallen van immuuntrombocytopenie en 263 gevallen van stolling ontdekt.\n\n\n\nDe primaire analyse toonde een veiligheidssignaal voor alle vier de uitkomsten. De onderzoekers probeerden de cijfers aan te passen door verschillende variabelen te gebruiken. Zo werd op een gegeven moment gecorrigeerd voor de variatie in achtergrondpercentages, of de percentages van elke uitkomst in de algemene bevolking vóór de ‘pandemie’. Na bepaalde aanpassingen – niet alle – werden myocardinfarct, immuuntrombocytopenie en intravasale stolling niet langer statistisch significant bevonden. Longembolie bleef echter statistisch significant, aldus de onderzoekers. Longembolie is een ernstige aandoening die tot de dood kan leiden.\n\nBeperkingen van het onderzoek waren onder meer mogelijke valse signalen en mogelijk gemiste signalen door factoren als verkeerd gespecificeerde parameters. Tot de aandoeningen die geen signaal veroorzaakten behoorden beroerte, hartontsteking en blindedarmontsteking. De signalen werden alleen gedetecteerd na de vaccinatie met Pfizer. Analyses voor signalen na ontvangst van de vaccins van Moderna en Johnson & Johnson lieten geen problemen zien. Pfizer, Moderna en Johnson & Johnson reageerden niet op verzoeken om commentaar.", "opengraph": {"locale": "nl_NL", "site_name": "blckbx", "type": "website", "url": "https://www.blckbx.tv/corona/fda-linkt-pfizer-vaccin-aan-bloedstolling-maar-adviseert-toch-om-door-te-prikken", "title": "FDA linkt Pfizer-vaccin aan bloedstolling maar adviseert toch om door…", "description": "Een onderzoek van de Amerikaanse Food and Drug Administration (FDA) toont aan dat het COVID-19-vaccin van Pfizer bloedstolling veroorzaakt. Tot ontzetting van critici als dr. Peter McCullough adviseert het agentschap om toch gewoon door te prikken.", "image": "https://www.blckbx.tv/uploads/2022/12/19/_1200x630_crop_center-center_82_none/2022-12-19-fda-bloedstolsels-pfizer3.jpg?mtime=1671466012", "image:width": "1200", "image:height": "630"}, "tags": ["Bloedstolsel", "mRNA-vaccin", "blckbx today", "dr. Peter McCullough", "Pfizer", "FDA", "meer", "Corona", "blckcheck", "Bijwerkingen", "Documentaires", "Censuur", "Vaccin", "blckbx news", "The Great Reset", "Bloedklonters", "Privacy"], "tweets": [], "movies": [], "links": ["https://translate.google.com/website?sl=nl&tl=en&hl=en&prev=search&u=https://www.sciencedirect.com/science/article/pii/S0264410X22014931", "https://translate.google.com/website?sl=nl&tl=en&hl=en&prev=search&u=https://twitter.com/p_mcculloughmd/status/1604206903575207936?s%3D21%26t%3DXWaT2wkz8K3tuhqdb46kyw", "https://translate.google.com/website?sl=nl&tl=en&hl=en&prev=search&u=https://www.theepochtimes.com/health/pfizers-covid-19-vaccine-linked-to-blood-clotting-fda_4930377.html"], "authors": [], "publish_date": "4 maanden geleden"}