{"result_id": "052007", "URL": "https://www.blckbx.tv/corona/miljarden-mensen-waren-proefkonijn-voor-experimentele-vaccins-geeft-obama-toe", "timestamp": "2023-04-25 12:20:05 CEST+0200", "meta": {"description": "Tijdens een speech gaf Barack Obama donderdag toe dat de farmaceutische industrie miljarden mensen wereldwijd heeft gebruikt als proefkonijn voor hun…", "lang": "nl", "keywords": "", "favicon": "https://www.blckbx.tv/dist/img/favicons/favicon.ico", "canonical": "https://www.blckbx.tv/corona/miljarden-mensen-waren-proefkonijn-voor-experimentele-vaccins-geeft-obama-toe", "encoding": "utf-8"}, "image": null, "domain": "www.blckbx.tv", "title": "Miljarden mensen waren proefkonijn voor experimentele vaccins, geeft…", "cleaned_text": "De voormalige Amerikaanse president Barack Obama deed zijn opmerkelijke uitspraken donderdag tijdens een toespraak op Stanford University. Nadat hij toegaf dat de vaccins ‘in wezen klinisch getest zijn’ op miljarden mensen over de hele wereld, maakte hij de Amerikanen ten schande die tot nu toe hebben geweigerd zich te onderwerpen aan de experimenten van Big Pharma. \"Ondanks het feit dat we het vaccin nu in wezen klinisch hebben getest op miljarden mensen wereldwijd, is ongeveer 1 op de 5 Amerikanen nog steeds bereid zichzelf en hun families in gevaar te brengen, in plaats van zich te laten vaccineren,\" zei Obama.\n\n\n\nDe taal die Obama gebruikt, verschilt radicaal van de retoriek die de mondiale politieke klasse tijdens de ‘pandemie’ gebruikte. Politici, reguliere media en leidinggevenden van Big Pharma hebben geprobeerd de massa ervan te verzekeren dat de vaccins geen experiment waren, terwijl miljarden armen over de hele wereld werden geïnjecteerd met experimentele mRNA-vaccins. Ook voormalig minister Hugo de Jonge zei dat de vaccins ‘uit-en-te-na getest’ waren. In dezelfde toespraak vergeleek hij de conservatieve politiek strateeg Steve Bannon met de Russische president Vladimir Poetin. Beiden zouden desinformatie verspreiden: “Mensen zoals Poetin – en Steve Bannon trouwens ook – begrijpen dat het niet nodig is dat mensen deze informatie geloven om democratische instellingen te verzwakken. Je hoeft alleen maar het openbare plein te overspoelen met voldoende ongezuiverd rioolwater. Je moet gewoon genoeg vragen stellen, genoeg vuil verspreiden, genoeg complottheorieën zaaien, zodat burgers niet meer weten wat ze moeten geloven.”\n\n\n\nBlckbx is een stichting zonder winstoogmerk die wordt gefinancierd door donaties van haar eigen publiek. Voor de mensen, door de mensen en met de mensen: dát is waar blckbx voor staat. Hoewel we ervoor zorgen dat we de kosten zo minimaal mogelijk houden, zijn er toch doorlopende kosten om gedegen en professionele content te maken. Denk hierbij aan de techniek, de regie, de redactie, de webredactie en het onderhoud van de studio. Om de continuïteit van blckbx te waarborgen, hebben we daarom jouw hulp nodig. Als je dit artikel waardeert en de urgentie van Nederlands grootste onafhankelijke nieuwsplatform inziet, dan nodigen we je van harte uit om ons te steunen. Alleen dankzij regelmatige donaties kunnen wij onafhankelijke content blijven produceren en onze reikwijdte vergroten, met als doel om de wereld beter te begrijpen. Voor de mensen, door de mensen en met steeds méér mensen.", "opengraph": {"locale": "nl_NL", "site_name": "blckbx", "type": "website", "url": "https://www.blckbx.tv/corona/miljarden-mensen-waren-proefkonijn-voor-experimentele-vaccins-geeft-obama-toe", "title": "Miljarden mensen waren proefkonijn voor experimentele vaccins, geeft…", "description": "Tijdens een speech gaf Barack Obama donderdag toe dat de farmaceutische industrie miljarden mensen wereldwijd heeft gebruikt als proefkonijn voor hun experimentele coronavaccins.", "image": "https://www.blckbx.tv/uploads/2022/04/22/_1200x630_crop_center-center_82_none/2022-04-22-Obama-proefkonijn.jpg?mtime=1650625105", "image:width": "1200", "image:height": "630"}, "tags": ["blckbx news", "blckbx today", "Corona", "blckcheck", "Documentaires", "Censuur", "Barack Obama", "Vaccin", "meer", "The Great Reset", "Privacy"], "tweets": ["<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">NOW - Obama: \"Despite the fact that we have now essentially clinically tested the vaccine on billions of people worldwide. Around 1 in 5 Americans is still going to put themselves at risk... rather than get vaccinated.\" <a href=\"https://t.co/w6KCFhAsXf\">pic.twitter.com/w6KCFhAsXf</a></p>— Disclose.tv (@disclosetv) <a href=\"https://twitter.com/disclosetv/status/1517239870875447297?ref_src=twsrc%5Etfw\">April 21, 2022</a></blockquote> "], "movies": [], "links": ["https://t.co/w6KCFhAsXf", "https://twitter.com/disclosetv/status/1517239870875447297?ref_src=twsrc%5Etfw", "https://thehill.com/policy/technology/3382803-obama-points-finger-at-tech-companies-for-disinformation-in-major-speech/?rl=1", "https://en.wikipedia.org/wiki/Steve_Bannon", "https://www.blckbx.tv/steun-ons"], "authors": [], "publish_date": "1 jaar geleden"}