{"result_id": "052019", "URL": "https://www.blckbx.tv/corona/gezondheidsminister-florida-ontraadt-vaccinatie-mannen-van-18-39-jaar", "timestamp": "2023-04-25 12:20:21 CEST+0200", "meta": {"description": "De gezondheidsminister van de Amerikaanse staat Florida dr. Joseph A. Ladapo ontraadt mannen in de leeftijd van 18-39 om zich te laten vaccineren, ‘omdat…", "lang": "nl", "keywords": "", "favicon": "https://www.blckbx.tv/dist/img/favicons/favicon.ico", "canonical": "https://www.blckbx.tv/corona/gezondheidsminister-florida-ontraadt-vaccinatie-mannen-van-18-39-jaar", "encoding": "utf-8"}, "image": null, "domain": "www.blckbx.tv", "title": "Gezondheidsminister Florida ontraadt vaccinatie mannen van 18-39 jaar", "cleaned_text": "Het ministerie van Volksgezondheid van Florida schrijft in een verklaring: “Uit deze analyse bleek dat er een toename is van 84 procent in de relatieve incidentie van hartgerelateerde sterfte bij mannen van 18-39 jaar, binnen 28 dagen na mRNA-vaccinatie. Met een hoog niveau van wereldwijde immuniteit tegen COVID-19 wordt het voordeel van vaccinatie waarschijnlijk tenietgedaan door dit abnormaal hoge risico van hartgerelateerde sterfte bij mannen in deze leeftijdsgroep. Bij niet-mRNA-vaccins werden deze verhoogde risico's niet aangetroffen.”\n\n“Daarom raadt de gezondheidsminister mannen van 18 tot 39 jaar af om mRNA-COVID-19-vaccins te ontvangen,” aldus het ministerie van Volksgezondheid in de richtlijn. “Personen met reeds bestaande hartaandoeningen, zoals myocarditis en pericarditis, moeten bijzonder voorzichtig zijn bij het nemen van deze beslissing.”\n\nVolgens de richtlijn hebben mannen van boven de 60 een verhoogd risico van 10 procent om binnen 28 dagen na vaccinatie te overlijden als gevolg van hartproblemen.\n\nBinnen 24 uur nadat Ladapo bovenstaande tweet plaatste, verwijderde Twitter het bericht, omdat het ‘betwiste of misleidende informatie’ zou bevatten. Maar nadat het sociale mediaplatform ontplofte van verontwaardiging over het censureren van een regeringsfunctionaris, werd de tweet zondag weer zichtbaar gemaakt.\n\nVolgens viroloog Marion Koopmans deugt de analyse waarop het besluit van Ladapo is gebaseerd niet en zijn de gegevens onbetrouwbaar. Op Twitter verwijst zij naar dit draadje van Health Nerd, die zichzelf in zijn biografie omschrijft als ‘epidemioloog’. Volgens hem redden de vaccins meer levens dan dat ze overlijdens veroorzaken.\n\nTegen de kritiek van Koopmans brengt neuroloog Jan Bonten in dat de bewijslast ligt bij degenen die de bevolking een experimenteel product opdringen. “Wie stelt, bewijst. Wie een groot deel van de bevolking met een nieuwe vaccintechniek wil injecteren, levert de bewijslast dat dit veilig kan. Dat heeft u niet gedaan, sterker nog, het bewijs stapelt zich op dat dit niet veilig is.”\n\nDe Britse cardioloog dr. Aseem Malhotra grijpt de analyse juist aan om nogmaals op te roepen de vaccinaties te staken. “Een verbijsterende toename van 84 procent van de relatieve incidentie van hartgerelateerde sterfgevallen bij mannen tussen 18 en 39 jaar binnen 28 dagen na het mRNA-vaccin. Ze moeten onmiddellijk voor iedereen worden opgeschort totdat dit volledig is onderzocht.”\n\nMalhotra heeft de vaccins lange tijd gepromoot als ‘veilig’, liet zich als één van de eerste artsen vaccineren, maar kwam onlangs tot inkeer.", "opengraph": {"locale": "nl_NL", "site_name": "blckbx", "type": "website", "url": "https://www.blckbx.tv/corona/gezondheidsminister-florida-ontraadt-vaccinatie-mannen-van-18-39-jaar", "title": "Gezondheidsminister Florida ontraadt vaccinatie mannen van 18-39 jaar", "description": "De gezondheidsminister van de Amerikaanse staat Florida dr. Joseph A. Ladapo ontraadt mannen in de leeftijd van 18-39 om zich te laten vaccineren, ‘omdat het voordeel waarschijnlijk niet opweegt tegen het verhoogde risico op hartproblemen’.", "image": "https://www.blckbx.tv/uploads/2022/10/10/_1200x630_crop_center-center_82_none/2022-10-10-Florida4.jpg?mtime=1665405059", "image:width": "1200", "image:height": "630"}, "tags": ["Vaccins", "blckbx today", "VS", "meer", "Corona", "Vaccinatie", "blckcheck", "Documentaires", "Censuur", "Vaccin", "Florida", "The Great Reset", "blckbx news", "Vaccinatieschade", "Privacy"], "tweets": [], "movies": [], "links": ["https://content.govdelivery.com/accounts/FLDOH/bulletins/3312697", "https://floridahealthcovid19.gov/wp-content/uploads/2022/10/20221007-guidance-mrna-covid19-vaccines-doc.pdf?utm_medium=email&utm_source=govdelivery", "https://twitter.com/MarionKoopmans/status/1579018717551550467", "https://twitter.com/GidMK/status/1579243976766656512", "https://twitter.com/john_bumblebee/status/1579112861645025280", "https://www.blckbx.tv/corona/vaccinpromotor-dr-aseem-malhotra-roept-op-om-te-stoppen-met-vaccineren"], "authors": [], "publish_date": "6 maanden geleden"}