{"result_id": "052057", "URL": "https://www.blckbx.tv/corona/kinderen-vaccineren-is-een-doodzonde-geert-vanden-bossche", "timestamp": "2023-04-25 12:21:07 CEST+0200", "meta": {"description": "Na Deel 1 is er nu dan ook Deel 2 in reeks van viroloog & vaccinoloog Dr. Geert Vanden Bossche . Ging Deel 1 nog over de werking van vaccins ten tijde van…", "lang": "nl", "keywords": "", "favicon": "https://www.blckbx.tv/dist/img/favicons/favicon.ico", "canonical": "https://www.blckbx.tv/corona/kinderen-vaccineren-is-een-doodzonde-geert-vanden-bossche", "encoding": "utf-8"}, "image": null, "domain": "www.blckbx.tv", "title": "“Kinderen vaccineren tegen Covid-19 is een doodzonde!” zegt viroloog…", "cleaned_text": "Eind december 2021 reisde programmamaker Flavio Pasquino samen met een cameraploeg af naar België om een tweeluik op te nemen met de roemruchte 9 maanden geleden luidde hij de noodklok bij de WHO en intussen zijn al zijn beweringen uitgekomen. “ Massavaccinatie heeft de pandemie niet bedwongen maar dominante varianten hebben de zaak keer op keer verergerd waardoor we feitelijk de pandemie in stand houden met terugkerende golven ”, aldus Dr. Geert Vanden Bosche, die alles minutieus toelicht.\n\nVanden Bossche werkte in het verleden voor de Bill & Melinda Gates Foundation, voor Gavi The Vaccine Alliance en voor vele commerciële partijen waar hij “hands on” aan de ontwikkeling van vaccins mocht sleutelen en daardoor veel multidisciplinaire kennis opdeed.\n\n“ De discipline die in deze pandemie het meest verwaarloost is geworden, is de immunologie” vertelt de Belgische wetenschapper. Immers, ik ken veel specialisten die alles weten van 1 vakgebied bijvoorbeeld virologie. Echter, ze weten vervolgens weinig of niets van immunologie of vaccinologie. Als iemand al deze drie zaken niet beheerst, kan hij/zij onmogelijk de complexiteit van de problematiek rondom deze pandemie overzien. Ik ben op alle drie deze gebieden bekwaam en zie dat met immunologie en met name de natuurlijke immuniteit en de interactie met het virus en het huidige vaccin, nauwelijks of geen aandacht krijgt”.\n\nTijdens Deel 1 van het tweeluik, wordt Dr. Geert Vanden Bosche onder andere geconfronteerd met twee video fragmenten van de VRT (Belgische publieke omroep) waarin twee collegae kritiek uiten op zijn eerdere stellingen. Vanden Bosche weerlegt de kritiek met verve en deelt zelfs rake klappen uit aan het adres van vaccinoloog Dr. Corinne Vandermeulen en vaccinoloog Prof. Isabel Leroux-Roels.", "opengraph": {"locale": "nl_NL", "site_name": "blckbx", "type": "website", "url": "https://www.blckbx.tv/corona/kinderen-vaccineren-is-een-doodzonde-geert-vanden-bossche", "title": "“Kinderen vaccineren tegen Covid-19 is een doodzonde!” zegt viroloog…", "description": "Na Deel 1 is er nu dan ook Deel 2 in reeks van viroloog & vaccinoloog Dr. Geert Vanden Bossche . Ging Deel 1 nog over de werking van vaccins ten tijde van een pandemie, Deel 2 gaat in op het vaccineren van kinderen en daarover is de vermaarde specialist stellig; “het is een doodzonde” en hij voegt…", "image": "https://www.blckbx.tv/uploads/2022/2022-01/2022-01-05/“Kinderen-vaccineren-tegen-Covid-19-is-een-doodzonde”-zegt-viroloog-vaccinoloog-Dr.-Geert-Vanden-Bossche/_1200x630_crop_center-center_82_none/thumbnail-geert-vanden-bossche.jpg?mtime=1641988447", "image:width": "1200", "image:height": "630"}, "tags": ["blckbx news", "blckbx today", "Corona", "blckcheck", "Documentaires", "Trending", "Censuur", "Dr. Geert Vanden Bossche", "Vaccin", "meer", "The Great Reset", "Privacy"], "tweets": [], "movies": [], "links": ["https://www.gatesfoundation.org/", "https://www.gavi.org/", "https://www.vrt.be/vrtnws/nl/2021/03/24/check-het-is-zeer-onwaarschijnlijk-dat-immune-escape-door-coron/", "https://gbiomed.kuleuven.be/english/networks/LUVAC/Members/00008175/view?pubsonpage=20&pubtype=report&sortby=scdate", "https://www.uzgent.be/patient/zoek-een-arts-of-dienst/laboratorium-voor-klinische-biologie/team/prof-dr-isabel-leroux-roels"], "authors": [], "publish_date": "1 jaar geleden"}