{"result_id": "052066", "URL": "https://www.blckbx.tv/corona/slachtoffers-kunnen-vaccinfabrikanten-wel-aanklagen-zegt-britse-overheid", "timestamp": "2023-04-25 12:21:16 CEST+0200", "meta": {"description": "Vaccinfabrikanten als Pfizer, Moderna en AstraZeneca kunnen wel degelijk aangeklaagd worden door mensen die letsel hebben opgelopen door toedoen van…", "lang": "nl", "keywords": "", "favicon": "https://www.blckbx.tv/dist/img/favicons/favicon.ico", "canonical": "https://www.blckbx.tv/corona/slachtoffers-kunnen-vaccinfabrikanten-wel-aanklagen-zegt-britse-overheid", "encoding": "utf-8"}, "image": null, "domain": "www.blckbx.tv", "title": "Slachtoffers kunnen vaccinfabrikanten wél aanklagen, zegt Britse…", "cleaned_text": "De Britse regering reageerde op een petitie waarin werd verzocht ‘de vrijwaring van de fabrikanten van COVID-19-vaccins in te trekken, zodat particulieren schadeclaims tegen hen kunnen indienen’.\n\nVolgens de overheid is het echter altijd al mogelijk geweest voor particulieren om big pharma voor de rechter te dagen omdat ‘het recht van particulieren om de producenten van het vaccin aan te klagen’ niet is ingetrokken. “Er is geen vrijwaring wat dat betreft.”\n\n\n\nWel is bepaald dat de regering – ofwel de belastingbetaler – na een veroordeling de schadevergoeding zal betalen.\n\n\n\n“In augustus 2021 werden wijzigingen aangebracht in de Human Medicines Regulations 2012 om de uitrol van COVID-19-vaccins te ondersteunen. Hoewel de wetgeving voorziet in gedeeltelijke vrijwaring van wettelijke aansprakelijkheid voor vaccins die in het kader van een noodvergunning worden geleverd, blijft het recht van particulieren om de producenten van het vaccin aan te klagen krachtens deel 1 van de Consumer Protection Act 1987 behouden,” aldus de regering in haar reactie.\n\n“Dit biedt een belangrijke mate van bescherming indien de veiligheid van het product niet zodanig is als mensen in het algemeen, alle omstandigheden in aanmerking genomen, mogen verwachten en indien dat gebrek persoonlijk letsel veroorzaakt.”\n\n\n\nIn Groot-Brittannië kunnen mensen met COVID-vaccinletsel in aanmerking komen voor een schadevergoeding uit het Vaccine Damage Payment Scheme (VDPS). Daarin is bepaald dat, indien bewezen, eenmalig een bedrag van maximaal 120.000 pond uitgekeerd kan worden bij letsel door COVID-vaccins. Volgens de regering staat deze uitkering los van de mogelijkheid van mensen om de vaccinproducenten aan te klagen. \n\n\n\n\"Een succesvolle claim bij de VDPS weerhoudt iemand er niet van een schadeclaim tegen de vaccinfabrikant in te dienen, aangezien de VDPS geen compensatieregeling is.”\n\n\n\nDe regering zegt geen commentaar te kunnen geven op de voorwaarden waaronder de COVID-19-vaccins werden geleverd, aangezien deze vertrouwelijk zijn. Wel wordt eraan vastgehouden dat de experimentele producten veilig én effectief zijn.\n\n\n\n“Hoewel de COVID-19-vaccins in hoog tempo zijn ontwikkeld, is de veiligheid op geen enkel moment en in geen enkel stadium van de ontwikkeling uit het oog verloren. Deze vaccins hebben volledig voldaan aan alle noodzakelijke eisen inzake veiligheid, doeltreffendheid en kwaliteit,” beweert de regering, die al diverse malen het bedrag van 120.000 pond moest uitkeren aan nabestaanden van mensen die door toedoen van de vaccins om het leven kwamen.", "opengraph": {"locale": "nl_NL", "site_name": "blckbx", "type": "website", "url": "https://www.blckbx.tv/corona/slachtoffers-kunnen-vaccinfabrikanten-wel-aanklagen-zegt-britse-overheid", "title": "Slachtoffers kunnen vaccinfabrikanten wél aanklagen, zegt Britse…", "description": "Vaccinfabrikanten als Pfizer, Moderna en AstraZeneca kunnen wel degelijk aangeklaagd worden door mensen die letsel hebben opgelopen door toedoen van COVID-vaccins, laat de Britse regering weten. ‘Fabrikanten zijn hiervoor niet gevrijwaard’.", "image": "https://www.blckbx.tv/uploads/2022/11/16/_1200x630_crop_center-center_82_none/2022-11-16-vaccinfabrikanten-aansprakelijk.jpg?mtime=1668612612", "image:width": "1200", "image:height": "630"}, "tags": ["blckbx today", "Moderna", "Groot-Brittannië", "Pfizer", "meer", "Corona", "blckcheck", "AstraZeneca", "Bijwerkingen", "COVID-vaccinaties", "Documentaires", "Censuur", "Vaccin", "The Great Reset", "blckbx news", "Vaccinatieschade", "Rechtszaak", "Privacy"], "tweets": [], "movies": [], "links": ["https://petition.parliament.uk/petitions/619190", "https://petition.parliament.uk/petitions/619190", "https://www.gov.uk/vaccine-damage-payment", "https://www.revolver.news/2022/07/astrazeneca-vaccine-widow-strikes-out-at-the-mainstream-media/"], "authors": [], "publish_date": null}