{"result_id": "052067", "URL": "https://www.blckbx.tv/corona/cdc-nu-meer-coronabesmettingen-bij-gevaccineerde-kinderen-dan-bij-ongevaccineerde", "timestamp": "2023-04-25 12:21:17 CEST+0200", "meta": {"description": "Terwijl de regering-Biden groen licht geeft voor een nieuwe experimentele prik met mRNA voor 5-11-jarigen, blijkt uit de meest recente gegevens van de CDC…", "lang": "nl", "keywords": "", "favicon": "https://www.blckbx.tv/dist/img/favicons/favicon.ico", "canonical": "https://www.blckbx.tv/corona/cdc-nu-meer-coronabesmettingen-bij-gevaccineerde-kinderen-dan-bij-ongevaccineerde", "encoding": "utf-8"}, "image": null, "domain": "www.blckbx.tv", "title": "CDC: Nu meer coronabesmettingen bij gevaccineerde kinderen dan bij…", "cleaned_text": "Volgens de laatste gegevens van de Amerikaanse Centers For Disease Control and Prevention (CDC) lopen kinderen tussen 5 en 11 jaar sinds februari vaker corona op als ze volledig zijn gevaccineerd dan kinderen die geen coronaprikken hebben gehad. Voor 12 februari was het nog andersom.\n\nDe omgekeerde trend betekent dat volledig gevaccineerde kinderen niet alleen meer kans hebben om corona op te lopen, het betekent ook dat gevaccineerde kinderen het virus meer verspreiden dan niet-gevaccineerde 5-11-jarigen.\n\nOp 12 februari meldde de CDC een wekelijks besmettingscijfer van 250,02 per 100.000 onder volledig gevaccineerde kinderen van 5-11 jaar, vergeleken met 245,82 onder niet-gevaccineerde kinderen in dezelfde leeftijdsgroep.\n\nHoewel de besmettingscijfers zowel bij gevaccineerde als ongevaccineerde kinderen afnemen, worden de verschillen procentueel groter. Op 16 maart was het wekelijks besmettingscijfer 36,23 bij volledig gevaccineerde kinderen tegen 24,98 onder niet-gevaccineerde kinderen in dezelfde leeftijdsgroep.\n\nDe vaccins worden door regeringen en gezondheidsinstanties wereldwijd aangeprezen als ‘effectief’. Volgens de recente cijfers van het CDC is daar bij jonge kinderen in ieder geval absoluut geen sprake van.", "opengraph": {"locale": "nl_NL", "site_name": "blckbx", "type": "website", "url": "https://www.blckbx.tv/corona/cdc-nu-meer-coronabesmettingen-bij-gevaccineerde-kinderen-dan-bij-ongevaccineerde", "title": "CDC: Nu meer coronabesmettingen bij gevaccineerde kinderen dan bij…", "description": "Terwijl de regering-Biden groen licht geeft voor een nieuwe experimentele prik met mRNA voor 5-11-jarigen, blijkt uit de meest recente gegevens van de CDC dat kinderen van die leeftijd een hoger percentage coronabesmettingen hebben dan hun niet-gevaccineerde leeftijdgenoten.", "image": "https://www.blckbx.tv/uploads/2022/05/19/_1200x630_crop_center-center_82_none/2022-05-19-meer-besmettingen-gevacc-kinderen.jpg?mtime=1652970189", "image:width": "1200", "image:height": "630"}, "tags": ["mRNA-vaccin", "blckbx news", "CDC", "blckbx today", "meer", "Pfizer", "Corona", "Privacy", "blckcheck", "Myocarditis", "Documentaires", "Censuur", "Vaccin", "dr. Peter McCullough", "The Great Reset", "Verenigde Staten"], "tweets": [], "movies": [], "links": ["https://covid.cdc.gov/covid-data-tracker/#rates-by-vaccine-status"], "authors": [], "publish_date": "11 maanden geleden"}