{"result_id": "052020", "URL": "https://www.blckbx.tv/corona/hier-is-sprake-van-een-ambtsmisdrijf-gideon-van-meijeren", "timestamp": "2023-04-25 12:20:22 CEST+0200", "meta": {"description": "De meest fundamentele vraag...”is covid 19 een A ziekte en zijn ingrijpende en ontwrichtende maatregelen proportioneel en gerechtvaardigd” kan de minister…", "lang": "nl", "keywords": "", "favicon": "https://www.blckbx.tv/dist/img/favicons/favicon.ico", "canonical": "https://www.blckbx.tv/corona/hier-is-sprake-van-een-ambtsmisdrijf-gideon-van-meijeren", "encoding": "utf-8"}, "image": null, "domain": "www.blckbx.tv", "title": "”Hier is sprake van een Ambtsmisdrijf” zegt Tweede Kamerlid Gideon…", "cleaned_text": "Gideon van Meijeren; “Ik vind dit zo schokkend. De wet die de A status legitimeert wacht al meer dan een jaar op behandeling en dat is strikt genomen heeft minister Hugo de Jonge de wettelijke verplichting niet heeft uitgevoerd is zelfs sprak van een ambstmisdrijf en wordt straks ook de vraag gesteld of hij hier niet voor vervolgd moet worden”.\n\nMomenteel staat Covid-19 niet opgenomen in de Wet Publieke Gezondheid en daarmee ontloopt de minister maar eigenlijk het hele kabinet de confronterende realiteit van de feiten. Een belangrijk feit is dan...hoeveel geïnfecteerden sterven nou werkelijk aan de ziekte, de infection fatality rate oftewel de IFR.\n\nWe weten inmiddels dat de IFR in een Standford University meta analyse over ca. 2 miljard positief geteste personen wereldwijd, is bijgesteld tot 0.15, zie LINK. Eerder bevestigde de WHO ook als dat de IFR was bijgesteld tot 0,23, zie LINK.\n\nEen getal dat uiteraard per leeftijd en per land verschilt want het is een gemiddelde maar toch...de IFR was in den beginnen 3 % en nu dus 0.15.,20 keer lager en minder dodelijk dan gedacht en daarmee staat de A status ter discussie.\n\nDE vraag die iedereen zo spoedig mogelijk beantwoord zou moeten willen zien is...hoort Covid19 in de categorie A of niet? Want als dat niet zo is, zijn alle corona maatregelen per direct van de baan.\n\nKersvers Tweede Kamerlid en staatsrecht deskundige Gideon van Meijeren maakte dit belangrijke punt aanhangig in de kamer en hij is van plan niet los te laten en dus praat ik met hem over de A status van covid 19 en de merkwaardige gang van zaken in de tweede kamer.\n\nGideon van Meijeren heeft twee master op zak en wel:", "opengraph": {"locale": "nl_NL", "site_name": "blckbx", "type": "website", "url": "https://www.blckbx.tv/corona/hier-is-sprake-van-een-ambtsmisdrijf-gideon-van-meijeren", "title": "”Hier is sprake van een Ambtsmisdrijf” zegt Tweede Kamerlid Gideon…", "description": "De meest fundamentele vraag...”is covid 19 een A ziekte en zijn ingrijpende en ontwrichtende maatregelen proportioneel en gerechtvaardigd” kan de minister van VWS, Hugo de Jonge niet onderbouwen, bleek tijdens sessie in de eerste kamer met Alexander van Hattum.", "image": "https://www.blckbx.tv/uploads/2021/2021-06/2021-06-21/”Hier-is-sprake-van-een-Ambtsmisdrijf”-zegt-Tweede-Kamerlid-Gideon-van-Meijeren/_1200x630_crop_center-center_82_none/thumbnail-gideon-van-meijeren.jpg?mtime=1642265736", "image:width": "1200", "image:height": "630"}, "tags": ["blckbx news", "blckbx today", "Corona", "blckcheck", "Documentaires", "Censuur", "Vaccin", "meer", "The Great Reset", "Privacy", "Gideon van Meijeren"], "tweets": [], "movies": [], "links": ["https://nl.wikipedia.org/wiki/Gideon_van_Meijeren", "https://www.rivm.nl/meldingsplicht-infectieziekten/welke-infectieziekten-zijn-meldingsplichtig", "https://www.parlementairemonitor.nl/9353000/1/j9vvij5epmj1ey0/vl6fdc3qfbyr", "https://wetten.overheid.nl/BWBR0024705/2021-06-01", "https://pubmed.ncbi.nlm.nih.gov/33768536/", "https://www.who.int/bulletin/online_first/BLT.20.265892.pdf"], "authors": [], "publish_date": null}