{"result_id": "052058", "URL": "https://www.blckbx.tv/gezondheid/moderna-ontwikkelt-combi-vaccin-tegen-corona-en-griep", "timestamp": "2023-04-25 12:21:09 CEST+0200", "meta": {"description": "Het farmaceutische bedrijf Moderna werkt aan een vaccin tegen corona én griep. En zelfs een drie-in-één injectie is al in de maak.", "lang": "nl", "keywords": "", "favicon": "https://www.blckbx.tv/dist/img/favicons/favicon.ico", "canonical": "https://www.blckbx.tv/gezondheid/moderna-ontwikkelt-combi-vaccin-tegen-corona-en-griep", "encoding": "utf-8"}, "image": null, "domain": "www.blckbx.tv", "title": "Moderna ontwikkelt combi-vaccin tegen corona én griep", "cleaned_text": "Dr. Paul Burton, de Chief Medical Officer van Moderna, maakte dit nieuws zondag bekend toen toen hij sprak met 9News Australia. Het combi-vaccin tegen corona en griep zal binnen enkele maanden getest worden op mensen. Moderna hoopt de dubbelklapper volgend jaar, of begin 2024, op de markt te kunnen brengen.\n\nBurton kondigde ook alvast de komst aan van een vaccin dat bescherming moet bieden tegen maar liefst drie luchtweginfecties. Behalve tegen corona en griep moet dit ‘ vaccin’ de ontvanger ook beschermen tegen het RS-virus. “We hebben een drie-in-één vaccin dat bescherming biedt tegen corona, griep en iets dat het RS-virus heet. Dit zijn allemaal respiratoire pathogenen die elk jaar mensen doden, jong en oud,” aldus Burton. De meest voorkomende klachten van het RS-virus zijn, volgens het RIVM, ‘een neusverkoudheid en hoesten’. Het drie-in-één vaccin moet in 2024, of begin 2025, klaar zijn.\n\nBurton maakt zich ernstige zorgen om de nieuwe omikronvarianten die momenteel rondgaan. “Ik denk dat BA.4 en BA.5 zorgwekkend zijn. Ze zijn besmettelijker en ze ontsnappen sneller aan de immuniteit. Dit is iets wat we heel serieus moeten nemen,” zo waarschuwde hij. Gelukkig heeft Moderna een booster ontwikkeld die specifiek is gericht op de omikronstam. Burton zei dat de Australische medische toezichthouder, de Therapeutic Goods Administration, momenteel bezig is om de nieuwe Moderna-spuit goed te keuren.\n\n“Het originele Moderna-vaccin was twee jaar geleden een goed vaccin. Het is vandaag de dag nog steeds een zeer goed vaccin, maar we hebben een aangepaste booster nodig en dat is wat we nu hebben gemaakt,” zo stelde hij iedereen gerust die net als hij bezorgd is om omikron.\n\nHet bedrijf gebruikt zijn mRNA-technologie ook om een kankervaccin te maken. De resultaten van een proef met 200 patiënten zullen later dit jaar bekend zijn.", "opengraph": {"locale": "nl_NL", "site_name": "blckbx", "type": "website", "url": "https://www.blckbx.tv/gezondheid/moderna-ontwikkelt-combi-vaccin-tegen-corona-en-griep", "title": "Moderna ontwikkelt combi-vaccin tegen corona én griep", "description": "Het farmaceutische bedrijf Moderna werkt aan een vaccin tegen corona én griep. En zelfs een drie-in-één injectie is al in de maak.", "image": "https://www.blckbx.tv/uploads/2022/06/22/_1200x630_crop_center-center_82_none/2022-06-22-Moderna-combi-vaccin3.jpg?mtime=1655904229", "image:width": "1200", "image:height": "630"}, "tags": ["Paul Burton", "Griep", "blckbx today", "Moderna", "meer", "Corona", "Vaccinatie", "blckcheck", "Documentaires", "Censuur", "RS-virus", "Vaccin", "blckbx news", "The Great Reset", "Privacy"], "tweets": [], "movies": [], "links": ["https://www.9news.com.au/national/coronavirus-update-moderna-covid-19-flu-combination-vaccine-trial/5c220de4-dcc9-464e-a731-ca24b999a001", "https://www.rivm.nl/rs-virus"], "authors": [], "publish_date": "10 maanden geleden"}