{"result_id": "052048", "URL": "https://www.blckbx.tv/gezondheid/pfizer-wil-babys-vaccineren-in-de-baarmoeder-met-nieuw-rs-vaccin", "timestamp": "2023-04-25 12:20:58 CEST+0200", "meta": {"description": "Pfizer zegt een 'effectief' vaccin te hebben ontwikkeld tegen het RS-virus dat het via de zwangere moeder wil toedienen aan de ongeboren baby in de…", "lang": "nl", "keywords": "", "favicon": "https://www.blckbx.tv/dist/img/favicons/favicon.ico", "canonical": "https://www.blckbx.tv/gezondheid/pfizer-wil-babys-vaccineren-in-de-baarmoeder-met-nieuw-rs-vaccin", "encoding": "utf-8"}, "image": null, "domain": "www.blckbx.tv", "title": "Pfizer wil baby’s vaccineren in de baarmoeder met nieuw RS-vaccin", "cleaned_text": "RS is de meest voorkomende oorzaak van luchtweginfecties bij kinderen van twee jaar en jonger. Volgens sommige schattingen is meer dan 60 procent van de kinderen tegen de tijd dat ze één jaar oud zijn besmet geweest met RS, en bijna alle kinderen waarschijnlijk tegen de tijd dat ze twee jaar oud zijn. De infectie veroorzaakt meestal milde verkoudheidsverschijnselen zoals een loopneus, verminderde eetlust, hoesten, niezen en soms koorts. Dankzij hun immuunsysteem worden kinderen gelukkig zelden erg ziek van RS.\n\nToch heeft Pfizer als allereerste geneesmiddelenfabrikant een ‘goedwerkend’ vaccin ontwikkeld tegen het RS-virus, meldde het farmaceutische bedrijf vorige week. Pfizer zegt het vaccin te hebben ontwikkeld omdat er nog steeds geen specifieke behandeling beschikbaar is voor RS-infectie. “Het gebrek aan zowel preventieve als antivirale behandelingen voor RS heeft Pfizer ertoe gebracht de werkzaamheid van een bivalent RS-perfusievaccin te ontwikkelen en te testen.”\n\n\n\nHet RS-vaccin van Pfizer wordt niet rechtstreeks toegediend aan de baby, maar wordt tijdens de zwangerschap geïnjecteerd bij de moeder. De immunisatie tegen RS zou zo al voor de geboorte plaatsvinden in de baarmoeder.\n\nUit klinische proeven van Pfizer zou blijken dat het product 82 procent effectief is in het beschermen van zuigelingen gedurende de eerste negentig dagen van hun leven tegen ernstige ziekte als gevolg van RS. Bovendien zou het vaccin gedurende de eerste zes levensmaanden 69,4 procent effectief blijven in het voorkomen van ernstige RS-ziekte. Ernstige ziekte als gevolg van RS komt bij kinderen zoals gezegd zelden voor, maar is sinds begin 2021 bij kinderen wel in opmars.\n\nPfizer test het product naar eigen zeggen in een lopende gerandomiseerde, dubbelblinde, placebogecontroleerde klinische studie (fase III) die gericht is op de evaluatie van de veiligheid, de doeltreffendheid en de immunogeniciteit. Deelnemers zijn ongeveer 7.400 zwangere vrouwen. Tijdens het late tweede tot het derde trimester van hun zwangerschap ontvingen zij een enkele dosis van ofwel het vaccin ofwel een placebo.\n\nVolgens Pfizer is het vaccin veilig. “Het onderzoeksvaccin werd goed verdragen zonder veiligheidsproblemen voor zowel gevaccineerde personen als hun pasgeborenen.”\n\nZuigelingen van moeders die het vaccin of de placebo kregen, werden ten minste één jaar gevolgd om de veiligheid en werkzaamheid van het vaccin vast te stellen. Bovendien werd 50 procent van deze zuigelingen gedurende twee jaar gevolgd, laat Pfizer weten.\n\nPfizer is van plan om tegen het einde van dit jaar een verzoek voor goedkeuring in te dienen bij de Amerikaanse Food and Drug Administration (FDA). “We kijken uit naar de samenwerking met de FDA en andere regelgevende instanties om dit kandidaat-vaccin aan aanstaande moeders aan te bieden om hun baby's te helpen beschermen tegen ernstige RS,” aldus Annaliesa Anderson, en van Pfizer.", "opengraph": {"locale": "nl_NL", "site_name": "blckbx", "type": "website", "url": "https://www.blckbx.tv/gezondheid/pfizer-wil-babys-vaccineren-in-de-baarmoeder-met-nieuw-rs-vaccin", "title": "Pfizer wil baby’s vaccineren in de baarmoeder met nieuw RS-vaccin", "description": "Pfizer zegt een 'effectief' vaccin te hebben ontwikkeld tegen het RS-virus dat het via de zwangere moeder wil toedienen aan de ongeboren baby in de baarmoeder.", "image": "https://www.blckbx.tv/uploads/2022/11/07/_1200x630_crop_center-center_82_none/2022-11-07-vaccinatie-baarmoeder.jpg?mtime=1667838180", "image:width": "1200", "image:height": "630"}, "tags": ["blckbx today", "meer", "Pfizer", "FDA", "Vaccinatie", "Baby's", "Corona", "blckcheck", "Documentaires", "Censuur", "RS-virus", "Vaccin", "blckbx news", "The Great Reset", "Privacy", "RS"], "tweets": [], "movies": [], "links": ["https://www.pfizer.com/news/press-release/press-release-detail/pfizer-announces-positive-top-line-data-phase-3-global"], "authors": [], "publish_date": "5 maanden geleden"}