{"result_id": "052004", "URL": "https://translate.google.com/translate?hl=en&sl=nl&u=https://www.blckbx.tv/corona/vaccinpromotor-dr-aseem-malhotra-roept-op-om-te-stoppen-met-vaccineren&prev=search&pto=aue", "timestamp": "2023-04-25 12:20:02 CEST+0200", "meta": {"description": "Een belangrijke vaccinpromotor uit de medische wereld, dr. Aseem Malhotra, maakt een opmerkelijke draai. Hij roept op om de mRNA-COVID-19-vaccinaties op…", "lang": "nl", "keywords": "", "favicon": "https://www.blckbx.tv/dist/img/favicons/favicon.ico", "canonical": "https://www.blckbx.tv/corona/vaccinpromotor-dr-aseem-malhotra-roept-op-om-te-stoppen-met-vaccineren", "encoding": "utf-8"}, "image": null, "domain": "translate.google.com", "title": "'Vaccinpromotor' dr. Aseem Malhotra roept op om te stoppen met…", "cleaned_text": "Malhotra, die zich als een van de eerste artsen liet vaccineren, staat in Groot-Brittannië bekend om het promoten van de COVID-vaccins. Zo was de cardioloog/adviseur van de National Health Service (NHS) te zien in het TV-programma waar hij het publiek opriep om zich te laten prikken met de ‘veilige en effectieve’ COVID-19-mRNA-producten van Pfizer en Moderna.\n\nMaar de gerenommeerde arts lijkt volledig tot inkeer te zijn gekomen over de ‘veiligheid en effectiviteit’ van de mRNA-vaccins. In een vandaag gepubliceerd tweedelig onderzoeksartikel getiteld ‘ ’ roept hij autoriteiten en de medische wereld op om de vaccinaties te staken. Deel 1 van het artikel lees je hier, deel 2 lees je hier.\n\nVolgens Malhotra blijkt uit een nieuwe analyse van gegevens uit gerandomiseerde gecontroleerde onderzoeken dat er een groter risico bestaat op een ernstig ongewenst voorval door het vaccin dan op opname in het ziekenhuis met COVID-19. Ook zegt hij dat er onevenredig veel mensen moeten worden gevaccineerd om één overlijden met COVID te voorkomen.\n\nDe onderzoeksartikelen van Malhotra zijn gepubliceerd in het Journal of Insulin Resistance. De cardioloog krijgt veel bijval van collega’s, die zijn oproep steunen om te stoppen met vaccineren.\n\nMalhotra wijst er in de publicaties op dat er met name grote zorgen zijn rondom de ‘cardiovasculaire veiligheid’ van de injecties. \"Farmaceutische bewakingssystemen en veiligheidsgegevens, gekoppeld aan plausibele schademechanismen, zijn zeer zorgwekkend, vooral met betrekking tot cardiovasculaire veiligheid,\" aldus Malhotra.\n\nDe arts wijst erop dat in 2021 in Engeland een aanzienlijke stijging van het aantal ambulanceoproepen voor hartstilstand gezien is (een extra 14.000 in vergelijking met 2020) en dat er soortgelijke gegevens uit Israël zijn gemeld, waar in de leeftijdsgroep 16-39 jaar een stijging was van 25 procent van het aantal hartaanvallen of hartstilstanden in verband met de toediening van het Pfizer-vaccin, maar niet in verband met COVID-19.\n\nMalhotra vindt het kwalijk dat mensen van tevoren niet zijn geïnformeerd over de risico’s op (ernstige) bijwerkingen, die aantoonbaar verbonden zijn aan de mRNA-vaccinaties. Volgens de arts is dat ethisch en wettelijk vereist.\n\n“Autoriteiten en delen van de medische wereld hebben onethisch, dwingend en verkeerd geïnformeerd beleid gesteund, zoals vaccin-mandaten en vaccin-paspoorten, waardoor de beginselen van geïnformeerde toestemming zijn ondermijnd. Deze betreurenswaardige acties zijn een symptoom van de ‘medische misinformatie-puinhoop’: het topje van een sterfte-ijsberg waar voorgeschreven medicijnen naar schatting de derde meest voorkomende doodsoorzaak wereldwijd zijn, na hartziekten en kanker,” claimt Malhotra.\n\nIn zijn publicatie schrijft Malhotra dat dit falen onder meer wordt veroorzaakt doordat bewakingsinstanties, die geacht worden het publiek te beschermen, worden gefinancierd door dezelfde bedrijven die baat hebben bij de verkoop van die medicijnen. Falende communicatie over volksgezondheid heeft ook geleid tot een moedwillige verspilling van middelen en een gemiste kans om mensen te helpen een gezonder leven te leiden met relatief eenvoudige – en goedkope – veranderingen in hun levensstijl, aldus Malhotra.\n\n“Er is een sterk wetenschappelijk, ethisch en moreel argument dat de huidige toediening van COVID-vaccins moet stoppen totdat alle ruwe gegevens aan een volledig onafhankelijk onderzoek zijn onderworpen. Met het oog op de toekomst moeten de medische- en volksgezondheidsdeskundigen erkennen dat er fouten zijn gemaakt. Ook moeten zij afstand nemen van het medisch-industrieel complex. Het zal veel tijd en moeite kosten om het vertrouwen in deze instellingen te herstellen, maar de gezondheid van zowel de mensheid als de medische wereld hangt ervan af.\n\n“We moeten dit gebruiken als een kans om het systeem te transformeren om betere artsen, betere besluitvorming en gezondere patiënten te krijgen en het vertrouwen in de geneeskunde en de volksgezondheid te herstellen. Totdat alle ruwe gegevens over de mRNA COVID-19-vaccins onafhankelijk zijn geanalyseerd, kunnen beweringen dat zij een netto voordeel voor de mensheid opleveren niet als bewezen worden beschouwd.”", "opengraph": {"locale": "nl_NL", "site_name": "blckbx", "type": "website", "url": "https://www.blckbx.tv/corona/vaccinpromotor-dr-aseem-malhotra-roept-op-om-te-stoppen-met-vaccineren", "title": "'Vaccinpromotor' dr. Aseem Malhotra roept op om te stoppen met…", "description": "Een belangrijke vaccinpromotor uit de medische wereld, dr. Aseem Malhotra, maakt een opmerkelijke draai. Hij roept op om de mRNA-COVID-19-vaccinaties op te schorten, totdat de ernstige bijwerkingen volledig zijn onderzocht en alle data van de klinische tests zijn vrijgegeven voor onafhankelijk…", "image": "https://www.blckbx.tv/uploads/2022/09/26/_1200x630_crop_center-center_82_none/2022-09-26-vaccinpromotor-vaccinatiesstop.jpg?mtime=1664202615", "image:width": "1200", "image:height": "630"}, "tags": ["mRNA-vaccin", "Pfizer", "COVID-vaccinaties", "Vaccinatieverplichting", "Prof. dr. Jay Bhattacharya", "The Great Reset", "dr. Aseem Malhotra", "Corona", "blckcheck", "meer", "blckbx news", "blckbx today", "Censuur", "Prof. dr. Sherif Sultan", "Vaccin", "Moderna", "Documentaires", "Vaccinatieplicht", "Vaccinatieschade", "Privacy"], "tweets": [], "movies": [], "links": ["https://translate.google.com/website?sl=nl&tl=en&hl=en&prev=search&u=https://insulinresistance.org/index.php/jir/article/view/71", "https://translate.google.com/website?sl=nl&tl=en&hl=en&prev=search&u=https://insulinresistance.org/index.php/jir/article/view/72", "https://translate.google.com/website?sl=nl&tl=en&hl=en&prev=search&u=https://insulinresistance.org/index.php/jir", "https://www-blckbx-tv.translate.goog/gezondheid/britse-ambulances-vorig-jaar-twee-keer-zo-vaak-in-actie-voor-jongeren-met-hartproblemen?_x_tr_sl=nl&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc"], "authors": [], "publish_date": "6 maanden geleden"}