{"result_id": "052071", "URL": "https://www.blckbx.tv/corona/peer-reviewed-studie-bevestigt-spike-eiwit-van-vaccin-in-hart-en-hersenen-van-man-die-stierf-na-booster", "timestamp": "2023-04-25 12:21:20 CEST+0200", "meta": {"description": "Bij een autopsie op een man die stierf kort na zijn booster werd spike-eiwit – afkomstig van het mRNA-vaccin – aangetroffen in beschadigd hersen- en…", "lang": "nl", "keywords": "", "favicon": "https://www.blckbx.tv/dist/img/favicons/favicon.ico", "canonical": "https://www.blckbx.tv/corona/peer-reviewed-studie-bevestigt-spike-eiwit-van-vaccin-in-hart-en-hersenen-van-man-die-stierf-na-booster", "encoding": "utf-8"}, "image": null, "domain": "www.blckbx.tv", "title": "Peer reviewed studie bevestigt: spike-eiwit van vaccin in hart en…", "cleaned_text": "In juni verscheen de gevalsanalyse al in , waar blckbx ook over berichtte. Maar nu heeft het onderzoek dus het wetenschappelijke keurmerk , wat betekent dat de kwaliteit van het onderzoek is beoordeeld en goedgekeurd door collega-wetenschappers.\n\nDe man had nooit eerder corona gehad. Drie weken voor het moment van overlijden ontving hij zijn derde vaccinatie. De eerste prik was van AstraZeneca en ontving hij in mei 2021, gevolgd door twee injecties met het Pfizer-vaccin in juli en december 2021. De autopsie werd uitgevoerd na aandringen van familieleden, omdat de 76-jarige man voor zijn overlijden ‘onduidelijke symptomen’ vertoonde. De klinische diagnose was dood door aspiratiepneumonie.\n\nMichael Mörz van het Instituut voor Pathologie van de Gemeentelijke Kliniek Dresden-Friedrichstadt deed de autopsie, die bevestigde dat de man leed aan Parkinson en tekenen van aspiratiepneumonie en systemische arteriosclerose aantrof. “Maar er werden ook andere opvallende bevindingen gedaan, waaronder acute vasculitis [ontstekingen aan de bloedvaten] en multifocale necrotiserende encefalitis [een vorm van hersenvliesontsteking] door onbekende oorzaak met uitgebreide ontsteking, waaronder gliale en lymfocytaire reacties,” aldus Mörz.\n\nOok in het hart werden aandoeningen aangetroffen. “Het hart vertoonde tekenen van chronische cardiomyopathie en milde acute lymfohistiocytaire myocarditis en vasculitis. Hoewel deze patiënt geen geschiedenis van COVID-19 had, werd immunohistochemie voor SARS-CoV-2-antigenen (spike- en nucleocapside-eiwitten) uitgevoerd. Verrassend genoeg kon alleen spike-eiwit, maar geen nucleocapside-eiwit worden aangetoond in de ontstekingshaarden in de hersenen en het hart, vooral in de endotheelcellen van kleine bloedvaten.”\n\nDe afwezigheid van nucleocapside-eiwit is bewijs dat het aangetroffen spike-eiwit in hart en hersenen geen gevolg is van COVID-19 maar van de vaccins, stelt Mörz. “Aangezien geen nucleocapside-eiwit kon worden aangetoond, moet de aanwezigheid van spike-eiwit eerder worden toegeschreven aan vaccinatie dan aan een virusinfectie. De resultaten bevestigen eerdere meldingen van encefalitis en myocarditis veroorzaakt door op COVID-19-genen gebaseerde vaccins.” Het mRNA-vaccin houdt dus verband met immuungerelateerde veranderingen in de hersenen, het hart en de bloedvaten van de man.\n\nIn de plaatste Mörz nog expliciete kanttekeningen bij de veiligheid van mRNA-vaccins. “De ernstige neurologische en hartgerelateerde complicaties na het mRNA-vaccin zijn reden voor twijfel over de veiligheid van op genen gebaseerde vaccins tegen SARS-CoV-2,” schreef hij daar.\n\nOok uitte hij zorgen over de ontoereikende preklinische studies van de coronavaccins: “In het evaluatierapport van het Europees Geneesmiddelenbureau (EMA) wordt ook duidelijk benadrukt dat de secundaire farmacodynamische studies en de studies naar de veiligheidsfarmacologie niet zijn uitgevoerd.” Daarom beval hij aan meer onderzoek te doen naar de veiligheidsrisico's: “Goed opgezette preklinische studies zijn dringend noodzakelijk voor de toekomstige besluitvorming en uitvoering van het gezondheidsbeleid.”\n\nOpmerkelijk genoeg hebben deze kanttekeningen en aanbevelingen met betrekking tot veiligheid de -versie niet gehaald.", "opengraph": {"locale": "nl_NL", "site_name": "blckbx", "type": "website", "url": "https://www.blckbx.tv/corona/peer-reviewed-studie-bevestigt-spike-eiwit-van-vaccin-in-hart-en-hersenen-van-man-die-stierf-na-booster", "title": "Peer reviewed studie bevestigt: spike-eiwit van vaccin in hart en…", "description": "Bij een autopsie op een man die stierf kort na zijn booster werd spike-eiwit – afkomstig van het mRNA-vaccin – aangetroffen in beschadigd hersen- en hartweefsel, bevestigt een peer reviewed studie in het gezaghebbende medische vakblad Vaccines .", "image": "https://www.blckbx.tv/uploads/2022/10/05/_1200x630_crop_center-center_82_none/2022-10-05-Spike-hart-hersenen-2.jpg?mtime=1664962720", "image:width": "998", "image:height": "307"}, "tags": ["Pfizer", "Trending", "The Great Reset", "Corona", "blckcheck", "Michael Mörz", "meer", "blckbx news", "Vaccins", "blckbx today", "mRNA", "AstraZeneca", "Censuur", "Vaccin", "Hersenen", "Vaccinatie", "Hartfalen", "Documentaires", "Spike-eiwit", "Vaccinatieschade", "Privacy"], "tweets": [], "movies": [], "links": ["https://www.preprints.org/manuscript/202206.0308/v1", "https://www.blckbx.tv/corona/man-sterft-na-booster-autopsie-vindt-spike-eiwit-in-hart-en-hersenen", "https://www.mdpi.com/2076-393X/10/10/1651", "https://www.preprints.org/manuscript/202206.0308/v1"], "authors": [], "publish_date": "6 maanden geleden"}