{"result_id": "052059", "URL": "https://translate.google.com/translate?hl=en&sl=nl&u=https://www.blckbx.tv/corona/pfizer-ceo-wil-snel-kinderen-jonger-dan-vijf-gaan-vaccineren&prev=search&pto=aue", "timestamp": "2023-04-25 12:21:10 CEST+0200", "meta": {"description": "Ondanks dat hij toegeeft dat zijn product vrijwel niet werkt tegen de omikron-variant hoopt Albert Bourla, CEO van Pfizer, dat snel begonnen kan worden…", "lang": "nl", "keywords": "", "favicon": "https://www.blckbx.tv/dist/img/favicons/favicon.ico", "canonical": "https://www.blckbx.tv/corona/pfizer-ceo-wil-snel-kinderen-jonger-dan-vijf-gaan-vaccineren", "encoding": "utf-8"}, "image": null, "domain": "translate.google.com", "title": "Pfizer-CEO wil snel kinderen jonger dan vijf gaan vaccineren", "cleaned_text": "In antwoord op de vraag van interviewster Margaret Brennan wanneer het vaccin er zal zijn voor kleine kinderen van 5 jaar en jonger, zegt de CEO van Pfizer dat er achter de schermen hard gewerkt wordt aan het mRNA-kindervaccin voor de allerjongsten. Hij laat doorschemeren dat de uitrol nog afhangt van de beoordeling [door de Amerikaanse Food and Drug Administration], en of er gevaccineerd zal gaan worden met twee, of drie dosissen, maar dat hij hoopt dat de vaccinaties voor de kleintjes snel van start kunnen gaan.\n\nBourla geeft in het interview ook aan dat wat hem betreft iedereen, ook gezonde kinderen, het COVID-vaccin van Pfizer zouden moeten krijgen.\n\nIn oktober vorig jaar werd bekend dat Pfizer stilzwijgend het middel Tromethamine (Tris) had toegevoegd als ingrediënt van het COVID-vaccin voor kinderen van 5-11 jaar. Volgens de Food and Drug Administration (FDA) om ‘het stabiliteitsprofiel van het vaccin te verbeteren.’ In de medische wereld staat Tromethamine echter bekend als een chemische stof die de zuurgraad van het bloed verlaagt en voorkomt dat mensen een hartaanval krijgen.\n\nHet adviescomité van de FDA stemde 27 oktober 2021, tijdens een hoorzitting, unaniem voor de goedkeuring van de injecties voor kinderen vanaf vijf jaar. De leden namen hun beslissing onder meer op basis van de informatie uit het FDA Briefing Document dat zij vooraf ontvingen.\n\nDe receptwijziging staat vermeld op pagina veertien van het FDA Briefing Document van 26 oktober 2021 onder het kopje : ‘To provide a vaccine with an improved stability profile, the Pfizer-BioNTech Covid-19 Vaccine for use in children 5-11 years of age uses tromethamine (Tris) buffer instead of the phosphate- buffered saline (PBS) as used in the previous formulation and excludes sodium chloride and potassium chloride’.\n\nDe beslissing om massaal jonge kinderen te injecteren met een experimenteel mRNA-vaccin is omstreden. De kans dat een kind jonger dan twintig jaar een COVID-infectie overleeft is maar liefst 99,9987 procent. Daarnaast voorkomen de injecties niet dat het virus wordt overgedragen. De bijwerkingen van het vaccin kunnen bovendien zeer ernstig zijn. Er zijn talloze gevallen bekend van myocarditis en pericarditis bij jonge mensen als gevolg van de mRNA-vaccinaties. Beide aandoeningen staan ook als mogelijke bijwerking vermeld op de bijsluiters van de vaccins en kunnen dodelijk zijn.\n\n\n\nHoe verantwoord is het?\n\nOp de vraag hoe verantwoord het is om jonge kinderen massaal te gaan vaccineren tegen COVID-19, zei dr. Eric Rubin, een van de leden van het FDA-adviescomité tijdens de hoorzitting: \"We zullen nooit te weten komen hoe veilig het vaccin is totdat we het beginnen te geven. Dat is gewoon de manier waarop het gaat.\"\n\nWetenschappers als de uitvinder van de mRNA-techniek dr. Robert Malone, cardioloog dr. Peter McCullough en dr. Geert vanden Bossche, immunoloog, viroloog en vaccinoloog, delen de opvatting van dr. Rubin niet. Zij vinden de beslissing om kinderen te injecteren met het experimentele mRNA-vaccin van Pfizer onverantwoord vanwege de grote risico’s en onzekerheden.", "opengraph": {"locale": "nl_NL", "site_name": "blckbx", "type": "website", "url": "https://www.blckbx.tv/corona/pfizer-ceo-wil-snel-kinderen-jonger-dan-vijf-gaan-vaccineren", "title": "Pfizer-CEO wil snel kinderen jonger dan vijf gaan vaccineren", "description": "Ondanks dat hij toegeeft dat zijn product vrijwel niet werkt tegen de omikron-variant hoopt Albert Bourla, CEO van Pfizer, dat snel begonnen kan worden met het vaccineren van kinderen van vijf jaar en jonger. Dit terwijl bekend is dat kinderen nul risico lopen om te overlijden aan COVID-19 en…", "image": "https://www.blckbx.tv/uploads/2022/03/14/_1200x630_crop_center-center_82_none/2022-03-14-pfizer-kids-vijf-jaar-en-jonger.jpg?mtime=1647262468", "image:width": "1200", "image:height": "630"}, "tags": ["blckbx today", "meer", "Pfizer", "Corona", "Vaccinatie", "blckcheck", "Documentaires", "Censuur", "Vaccin", "The Great Reset", "Albert Bourla", "blckbx news", "Vaccinatieschade", "Privacy"], "tweets": [], "movies": [], "links": ["https://translate.google.com/website?sl=nl&tl=en&hl=en&prev=search&u=https://newsplaneta.com/2022/03/13/full-transcript-pfizer-ceo-albert-bourla-on-face-the-nation-march-13-2022/", "https://translate.google.com/website?sl=nl&tl=en&hl=en&prev=search&u=https://go.drugbank.com/drugs/DB03754", "https://translate.google.com/website?sl=nl&tl=en&hl=en&prev=search&u=https://pubchem.ncbi.nlm.nih.gov/compound/tromethamine%23section%3DInformation-Sources", "https://translate.google.com/website?sl=nl&tl=en&hl=en&prev=search&u=https://www.fda.gov/advisory-committees/advisory-committee-calendar/vaccines-and-related-biological-products-advisory-committee-october-26-2021-meeting-announcement", "https://www-blckbx-tv.translate.goog/uploads/FDA-VRBPAC-10.26.21-Meeting-Briefing-Document-FDA.pdf?_x_tr_sl=nl&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc", "https://translate.google.com/website?sl=nl&tl=en&hl=en&prev=search&u=https://jdfor2020.com/2022/01/professor-covid-survival-rate-for-under-20s-is-99-9987/", "https://translate.google.com/website?sl=nl&tl=en&hl=en&prev=search&u=https://www.ema.europa.eu/en/news/meeting-highlights-pharmacovigilance-risk-assessment-committee-prac-29-november-2-december-2021", "https://translate.google.com/website?sl=nl&tl=en&hl=en&prev=search&u=https://townhall.com/tipsheet/scottmorefield/2021/10/26/fda-panel-member-were-never-gonna-learn-about-how-safe-the-vaccine-is-until-we-start-giving-it-n2598090"], "authors": [], "publish_date": "1 jaar geleden"}