{"result_id": "052076", "URL": "https://translate.google.com/translate?hl=en&sl=nl&u=https://www.blckbx.tv/buitenland/g20-leiders-willen-digitaal-vaccinpaspoort-permanent-invoeren&prev=search&pto=aue", "timestamp": "2023-04-25 12:21:24 CEST+0200", "meta": {"description": "De regeringsleiders op de G20 in Bali hebben verklaard dat ze digitale vaccinpaspoorten willen gaan gebruiken om ‘pandemieën te bestrijden én te…", "lang": "nl", "keywords": "", "favicon": "https://www.blckbx.tv/dist/img/favicons/favicon.ico", "canonical": "https://www.blckbx.tv/buitenland/g20-leiders-willen-digitaal-vaccinpaspoort-permanent-invoeren", "encoding": "utf-8"}, "image": null, "domain": "translate.google.com", "title": "G20-leiders willen digitaal vaccinpaspoort permanent invoeren", "cleaned_text": "In artikel 23 van deze verklaring komen zij overeen ‘internationaal te gaan samenwerken om het succes van digitale COVID-19-certificaten te benutten voor toekomstige reacties op pandemieën’.\n\n\"Wij erkennen het belang van gedeelde technische normen en verificatiemethoden om naadloos internationaal reizen en interoperabiliteit te vergemakkelijken en digitale en niet-digitale oplossingen, waaronder bewijzen van vaccinaties, te erkennen,\" stellen de ondertekenaars.\n\n\"Wij steunen een voortgezette internationale dialoog en samenwerking over de oprichting van betrouwbare wereldwijde digitale gezondheidsnetwerken als onderdeel van de inspanningen om de preventie van en de reactie op toekomstige pandemieën te versterken, die moeten voortbouwen op het succes van de bestaande normen en digitale COVID-19-certificaten.\"\n\nIn een afzonderlijk maar vergelijkbaar document heeft de G20 een update uitgebracht waarin het volgende wordt toegevoegd:\n\n\"Streef naar interoperabiliteit van systemen, inclusief mechanismen die het bewijs van vaccinatie valideren, met inachtneming van de soevereiniteit van het nationale gezondheidsbeleid en relevante nationale regelgeving zoals bescherming van persoonsgegevens en gegevensuitwisseling.\"\n\n\n\nDe steun van de G20 voor digitale gezondheidscertificaten met bewijs van vaccinatie, ook wel vaccinpaspoort genoemd, volgt op aanbevelingen van de B20-top eerder deze week.\n\nVolgens het 132 bladzijden tellende slotcommunique van de B20 'Policy Recommendations to the G20', moeten de lidstaten ‘verdere uitwisselingen en strategisch gebruik en delen van wetenschap, technologie en passende gegevens voor crisisdetectie bevorderen en een mondiaal coördinatiekader voor toekomstige crisisbestrijding creëren’.\n\nDeze beleidsaanbevelingen omvatten, maar zijn niet beperkt tot: goedkeuring van de digitale documentatie van COVID-19-certificaten, het uitvoeren en uitbreiden van de wederzijdse erkenning van COVID-19-vaccins en het opstellen van solide richtlijnen voor de paraatheid bij gezondheidscrises. Dat laatste moet zorgen voor een wereldwijde gecoördineerde reactie op toekomstige crises, versterkt door een technologische wereldwijde gezondheidsinfrastructuur.\n\nOp de eerste dag van de B20-top zei de Indonesische minister van Volksgezondheid Budi Gunadi Sadikin dat de G20-landen een ‘digitaal gezondheidscertificaat met gebruikmaking van WHO-normen’ moeten aannemen en dat zij ernaar streven dit type vaccinpaspoort in te voeren in de ‘internationale gezondheidsvoorschriften’ tijdens de volgende Wereldgezondheidsvergadering in Genève.", "opengraph": {"locale": "nl_NL", "site_name": "blckbx", "type": "website", "url": "https://www.blckbx.tv/buitenland/g20-leiders-willen-digitaal-vaccinpaspoort-permanent-invoeren", "title": "G20-leiders willen digitaal vaccinpaspoort permanent invoeren", "description": "De regeringsleiders op de G20 in Bali hebben verklaard dat ze digitale vaccinpaspoorten willen gaan gebruiken om ‘pandemieën te bestrijden én te voorkomen'. Om te mogen reizen zullen mensen altijd volledig gevaccineerd moeten zijn, ondanks dat bekend is dat vaccinatie virustransmissie niet stopt.", "image": "https://www.blckbx.tv/uploads/2022/11/17/_1200x630_crop_center-center_82_none/2022-11-17-vaccinatiepaspoort-permanent.jpg?mtime=1668698908", "image:width": "1200", "image:height": "630"}, "tags": ["Vaccinatiepaspoort", "blckbx today", "WHO", "G20", "meer", "Corona", "blckcheck", "Documentaires", "Trending", "Censuur", "Vaccin", "blckbx news", "The Great Reset", "Privacy"], "tweets": [], "movies": [], "links": ["https://translate.google.com/website?sl=nl&tl=en&hl=en&prev=search&u=https://www.whitehouse.gov/briefing-room/statements-releases/2022/11/16/g20-bali-leaders-declaration/", "https://translate.google.com/website?sl=nl&tl=en&hl=en&prev=search&u=https://www.g20.org/wp-content/uploads/2022/11/2022-G20-Bali-Update.pdf", "https://translate.google.com/website?sl=nl&tl=en&hl=en&prev=search&u=https://www.b20indonesia2022.org/view-doc-b20/final_communique/AXPIDTWB"], "authors": [], "publish_date": "5 maanden geleden"}