{"result_id": "052022", "URL": "https://www.blckbx.tv/corona/zo-ziet-vaccinatieschade-eruit-lisette-verhoeven", "timestamp": "2023-04-25 12:20:25 CEST+0200", "meta": {"description": "Op 13 maart ging Lisette Verhoeven voor de prik. Het AstraZeneca vaccin viel haar ten deel en dat terwijl en toch al de nodige ophef was in naburige…", "lang": "nl", "keywords": "", "favicon": "https://www.blckbx.tv/dist/img/favicons/favicon.ico", "canonical": "https://www.blckbx.tv/corona/zo-ziet-vaccinatieschade-eruit-lisette-verhoeven", "encoding": "utf-8"}, "image": null, "domain": "www.blckbx.tv", "title": "Zo ziet Vaccinatieschade eruit. Het persoonlijke drama van Lisette…", "cleaned_text": "Sowieso al nooit niet de farmaceutische industrie want daarvoor zijn vantevoren al contracten ondertekend zodat hun nooit aansprakelijk zou kunnen worden gesteld voor enig achterkomende problemen heb ik een tijdje geleden op YouTube gezien! Ik vind het heel erg triest voor Lisette dat het zo is gelopen maar uiteindelijk blijkt er gewoon uit dat je maar een proefkonijn was en dat de keuze bij jou zelf lag en dat het dus aan jezelf legt dat je het vaccine hebt genomen! \n\n Ik denk dat ze dat zullen gaan zeggen want ze proberen onder alles uit te komen stuk voor stuk\n\n Feit is dus dat je helemaal niet in een democratie leeft want velen van ons zijn er gewoon toe gedwongen om het te nemen want anders konden ze dit of dat niet doen en blablabla! Tis jouw lichaam en dus jouw eigen vrije keuze maar goed dat is mijn mening maar hoor. Ik hoop dat ze het sowieso al durven toe te geven en je een schadevergoeding ofiets zullen gaan geven ook al veranderd dat niks aan de situatie... veel sterkte", "opengraph": {"locale": "nl_NL", "site_name": "blckbx", "type": "website", "url": "https://www.blckbx.tv/corona/zo-ziet-vaccinatieschade-eruit-lisette-verhoeven", "title": "Zo ziet Vaccinatieschade eruit. Het persoonlijke drama van Lisette…", "description": "Op 13 maart ging Lisette Verhoeven voor de prik. Het AstraZeneca vaccin viel haar ten deel en dat terwijl en toch al de nodige ophef was in naburige landen rondom trombose bij jonge vrouwen. Lisette studeert Archeologie maar werkt ook parttime in een verzorgingstehuis met ouderen. Ze nam het vaccin…", "image": "https://www.blckbx.tv/uploads/2021/2021-06/2021-06-23/Zo-ziet-Vaccinatie-schade-eruit.-Het-persoonlijke-drama-van-Lisette-Verhoeven/_1200x630_crop_center-center_82_none/thumbnail-lisette-verhoeven.jpg?mtime=1642264694", "image:width": "1200", "image:height": "630"}, "tags": ["blckbx news", "blckbx today", "Privacy", "Corona", "blckcheck", "Documentaires", "Censuur", "Vaccin", "The Great Reset", "meer", "Vaccinatieschade", "Lisette Verhoeven"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "1 jaar geleden"}