{"result_id": "052011", "URL": "https://www.blckbx.tv/corona/vaers-analyse-cdc-toont-alarmerende-veiligheidssignalen-mrna-vaccins", "timestamp": "2023-04-25 12:20:10 CEST+0200", "meta": {"description": "De na een Wob-verzoek vrijgegeven analyse van de VAERS-database door de Amerikaanse CDC toont duidelijke veiligheidssignalen voor overlijden en een reeks…", "lang": "nl", "keywords": "", "favicon": "https://www.blckbx.tv/dist/img/favicons/favicon.ico", "canonical": "https://www.blckbx.tv/corona/vaers-analyse-cdc-toont-alarmerende-veiligheidssignalen-mrna-vaccins", "encoding": "utf-8"}, "image": null, "domain": "www.blckbx.tv", "title": "VAERS-analyse CDC toont alarmerende veiligheidssignalen mRNA-vaccins", "cleaned_text": "De Amerikaanse Centers for Disease Control and Prevention (CDC) analyseerde in de VAERS-vaccinbijwerkingendatabase (Vaccine Adverse Event Reporting System) meldingen over de twee meest toegediende COVID-vaccins, de mRNA-vaccins van Pfizer en Moderna. De meldingen werden gedaan tussen 14 december 2020 en 29 juli 2022. De CDC wilde de resultaten van de analyse eerst niet prijsgeven, maar werd daartoe onlangs gedwongen na een Wob-verzoek.\n\nDe gezondheidsinstantie constateerde na de analyse 770 verschillende soorten ongewenste voorvallen met een veiligheidssignaal bij 18-plussers, waarvan meer dan 500 een groter veiligheidssignaal hadden dan myocarditis/pericarditis.\n\nUit de analyse blijkt dat het aantal in minder dan twee jaar gemelde ernstige ongewenste voorvallen voor mRNA-COVID-19-vaccins 5,5 keer groter is dan alle ernstige meldingen voor vaccins die sinds 2009 in de VS aan volwassenen zijn gegeven (73.000 tegenover 13.000).\n\nTwee keer zoveel meldingen van mRNA-COVID-19-vaccins werden geclassificeerd als ernstig in vergelijking met alle andere vaccins die aan volwassenen werden gegeven (11 procent tegen 5,5 procent). Dit voldoet aan de CDC-definitie van een veiligheidssignaal.\n\nEr zijn 96 veiligheidssignalen voor 12-17-jarigen, waaronder: myocarditis, pericarditis, Bell's Palsy, genitale ulceraties, hoge bloeddruk en hartslag, menstruele onregelmatigheden, hartklep incompetenties, longembolie, hartritmestoornissen, trombose, pericardiale en pleurale effusie, appendicitis en geperforeerde appendix, immuuntrombocytopenie, pijn op de borst, verhoogde troponine niveaus, verblijf op de intensive care, en het hebben van anticoagulantia.\n\nEr zijn 66 veiligheidssignalen voor kinderen van 5-11 jaar, waaronder: myocarditis, pericarditis, ventriculaire disfunctie en hartklep incompetenties, pericardiale en pleurale effusie, pijn op de borst, appendicitis & appendectomieën, ziekte van Kawasaki, menstruele onregelmatigheden, vitiligo, en vaccin doorbraakinfectie.\n\nDe veiligheidssignalen kunnen niet worden afgedaan als het gevolg van ‘gestimuleerde’, overdreven, frauduleuze of anderszins kunstmatig opgeblazen rapportage, noch kunnen ze worden afgedaan als het gevolg van het enorme aantal toegediende COVID-vaccins. Daar zijn verschillende redenen voor, maar de belangrijkste is dat de analyse van het veiligheidssignaal niet afhangt van het aantal meldingen, maar van de vraag of sommige bijwerkingen al dan niet vaker worden gemeld voor deze vaccins dan voor andere, niet-COVID-vaccins.\n\nVeiligheidssignalen betekenen dat een aandoening in verband kan worden gebracht met een vaccin. Signalen vereisen verdere analyse om een mogelijk verband te bevestigen.\n\nVAERS is een passief meldingssysteem dat meldingen van iedereen aanvaardt, maar de meeste worden ingediend door gezondheidswerkers. Mensen die valse rapporten indienen worden bestraft. Meldingen bewijzen geen causaliteit of verband tussen een voorval en een vaccin. Tegelijkertijd blijkt uit studies dat het aantal meldingen vaak een onderschatting is van het werkelijke aantal gebeurtenissen na de vaccinatie. Het CDC zelf schat het aantal meldingen dat gedaan wordt op 1-10 procent van het werkelijke aantal gebeurtenissen.\n\nMeer dan een jaar te laat\n\nHet CDC en de Food and Drug Administration (FDA) verklaarden in documenten met werkprocedures dat ambtenaren VAERS zouden controleren om ‘mogelijke nieuwe veiligheidsproblemen voor COVID-19-vaccins’ te identificeren, waarbij het CDC de PRR-analyse zou uitvoeren. De CDC heeft meerdere valse verklaringen over de datamining afgegeven, maar erkende uiteindelijk dat het pas in 2022 begon met het uitvoeren van de monitoringtechniek – meer dan een jaar nadat de vaccins van Pfizer en Moderna voorwaardelijk werden toegelaten.\n\nPRR omvat het vergelijken van de incidentie van een specifiek ongewenst voorval na een specifiek vaccin met de incidentie na alle andere vaccins. Volgens de CDC wordt een signaal afgegeven wanneer aan drie drempels is voldaan: een PRR van ten minste twee, een chi-kwadraat statistiek van ten minste vier en drie of meer gevallen van het voorval na ontvangst van het geanalyseerde vaccin. Chi-kwadraattests zijn een vorm van statistische analyse die wordt gebruikt om gegevens te onderzoeken.\n\n\n\nUit de door The Epoch Times verkregen resultaten blijkt dat er honderden ongewenste voorvallen (AE's) zijn die aan de definitie voldoen, waaronder ernstige aandoeningen zoals bloedstolling in de longen, intermenstruele bloedingen, zuurstoftekort bij het hart en zelfs overlijden. De hoge aantallen, vooral de chi-kwadraatcijfers, baarden deskundigen zorgen.\n\n“Voor veel gebeurtenissen is de chi-kwadraat zo hoog dat de kans dat het werkelijke percentage van de AE van de COVID-vaccins niet hoger is dan die van de niet-COVID-vaccins in wezen nul is,\" vertelde Norman Fenton, een professor in risicomanagement aan de Queen Mary University of London, in een e-mail aan The Epoch Times, nadat hij de cijfers door een Bayesiaans model had gehaald dat waarschijnlijkheden geeft op basis van beschikbare informatie. Er was bijvoorbeeld een waarschijnlijkheid van minder dan 0,5 procent dat de kans op levercirrose kleiner was na COVID-19-vaccinatie dan zonder COVID-19-vaccinatie. Voor myocarditis, of hartontsteking, in de groep van 12 tot 17 jaar was de kans bijna nul.\n\nUit de resultaten van de CDC blijkt ook dat een veel groter deel van de voorvallen na COVID-19-vaccinatie ernstig was. Voor volwassenen was dit aandeel bijvoorbeeld 11,1 procent, vergeleken met 5,5 procent na niet-COVID-19 vaccins. Het aandeel sterfgevallen voor volwassenen was 15,4 procent na COVID-19 vaccinatie, veel hoger dan de 2,5 procent na andere inentingen.\n\n\"Het is aan de regelgevers om met een andere causale verklaring voor dit verschil te komen als zij willen beweren dat de kans dat een COVID-vaccin AE tot de dood leidt niet significant hoger is dan bij andere vaccins,\" zei Fenton.\n\nDe CDC en de FDA reageerden niet op verzoeken van The Epoch Times om commentaar. Een woordvoerder van de CDC vertelde de krant eerder in een e-mail dat de PRR-resultaten ‘over het algemeen consistent waren met EB [Empirical Bayesian] datamining, waarbij geen extra onverwachte veiligheidssignalen naar voren kwamen’. In een brief bij de resultaten verklaarde de archiefdienst van het agentschap dat de resultaten ‘in het algemeen de bevindingen van EB datamining bevestigden’, een methode die door de FDA wordt gebruikt. De FDA heeft geweigerd de EB mining resultaten vrij te geven.\n\n\n\nDe resultaten van de analyse staan in Excel-sheets. De resultaten kunnen worden gedownload via onderstaande links. De tabellen één en twee zijn niet verstrekt.", "opengraph": {"locale": "nl_NL", "site_name": "blckbx", "type": "website", "url": "https://www.blckbx.tv/corona/vaers-analyse-cdc-toont-alarmerende-veiligheidssignalen-mrna-vaccins", "title": "VAERS-analyse CDC toont alarmerende veiligheidssignalen mRNA-vaccins", "description": "De na een Wob-verzoek vrijgegeven analyse van de VAERS-database door de Amerikaanse CDC toont duidelijke veiligheidssignalen voor overlijden en een reeks zeer zorgwekkende trombo-embolische, cardiale, neurologische, hemorragische, hematologische, immuunsysteem- en menstruatiebijwerkingen van de…", "image": "https://www.blckbx.tv/uploads/2023/01/11/_1200x630_crop_center-center_82_none/2023-01-11-vaerscdc.jpg?mtime=1673448709", "image:width": "1200", "image:height": "630"}, "tags": ["mRNA-vaccin", "CDC", "blckbx today", "Moderna", "meer", "Pfizer", "Corona", "blckcheck", "Bijwerkingen", "Documentaires", "Censuur", "Vaccin", "The Great Reset", "blckbx news", "Vaccinatieschade", "VAERS", "Privacy"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/health/exclusive-cdc-finds-hundreds-of-safety-signals-for-pfizer-and-moderna-covid-19-vaccines_4956733.html?", "/uploads/Final-7-15-Table3-PRR-of-PTs-for-COVID19-Pfizer-Compared-to-Moderna.xlsx", "/uploads/Final-7-15-Table4-PRR-of-PTs-for-COVID19-Moderna-Compared-to-Pfizer.xlsx", "/uploads/Final-7-15-Table5-PRR-of-PTs-for-COVID19-mRNA-Compared-to-2009_2022-NON-COVID19_07.15.2022.xlsx", "/uploads/Final-7-22-Table3-PRR-of-PTs-for-COVID19-Pfizer-Compared-to-Moderna.xlsx", "/uploads/Final-7-22-Table4-PRR-of-PTs-for-COVID19-Moderna-Compared-to-Pfizer.xlsx", "/uploads/Final-7-22-Table5-PRR-of-PTs-for-COVID19-mRNA-Compared-to-2009_2022-NON-COVID19_07.22.2022.xlsx", "/uploads/Final-7-29-Table3-PRR-of-PTs-for-COVID19-Pfizer-Compared-to-Moderna.xlsx", "/uploads/Final-7-29-Table4-PRR-of-PTs-for-COVID19-Moderna-Compared-to-Pfizer.xlsx", "/uploads/Final-7-29-Table5-PRR-of-PTs-for-COVID19-mRNA-Compared-to-2009_2022-NON-COVID19_07.29.2022.xlsx", "https://www.theepochtimes.com/health/exclusive-cdc-finds-hundreds-of-safety-signals-for-pfizer-and-moderna-covid-19-vaccines_4956733.html?"], "authors": [], "publish_date": "3 maanden geleden"}