{"result_id": "053055", "URL": "https://translate.google.com/translate?hl=en&sl=fr&u=https://bonsens.info/le-conseil-detat-vole-au-secours-des-incoherences-du-gouvernement-debriefing-me-protat-me-de-lagarde-et-me-teissedre/&prev=search&pto=aue", "timestamp": "2023-04-25 12:22:26 CEST+0200", "meta": {"description": "Débriefing FranceSoir- BonSens.org Le Conseil d’Etat vole au secours des incohérences du gouvernement - debriefing Me Protat, Me de Lagarde et Me Teissedre - BonSens.org", "lang": "fr", "keywords": "", "favicon": "https://bonsens.info/wp-content/uploads/2020/10/bon-sens-BAT-v2-carree-pm.png", "canonical": "https://bonsens.info/le-conseil-detat-vole-au-secours-des-incoherences-du-gouvernement-debriefing-me-protat-me-de-lagarde-et-me-teissedre/", "encoding": "UTF-8"}, "image": null, "domain": "translate.google.com", "title": "Le Conseil d’Etat vole au secours des incohérences du gouvernement - debriefing Me Protat, Me de Lagarde et Me Teissedre", "cleaned_text": "Nouveau debriefing avec Me Protat, Me de Lagarde et Me Teissedre sur l’ordonnance rendue le 6 mai 2021 du Conseil d’État suite à l’audience en référé-suspension de ce 4 mai 2021. L’octogénaire reste assigné à résidence et sous couvre-feu au motif que l’État n’est pas en mesure de contrôler de manière infaillible la vaccination – autant dire que l’on consacre le pass vaccinal qui devra être revu par le Parlement et le Sénat, ce qui en soit est une consolation. Le CE s’est même fendu d’un communiqué sur son site, fait extrêmement rare, au sujet de cette décision qui ne surprendra plus personne mais dont la motivation change par rapport à celle contenue dans la décision première du mois d’avril 2021. Les avocats évoquent une possible action devant la Cour européenne des droits de l’homme (CEDH).\n\nMe de Lagarde l’explique de manière claire :\n\nDe son côté Me Teissedre, avocat de l’association BonSens qui a fait une intervention volontaire, est plus critique évoquant la perte de libertés petit à petit – la balle va donc être entre les mains des parlementaires et du Sénat pour évaluer cette proposition de loi sur le pass sanitaire, son caractère obligatoire, discriminant et liberticide. Me Teissedre évoque aussi l’alternative à la vaccination des traitements précoces qui fonctionnent, qui pour lui devrait être pris en considération.\n\nUne situation complexe où la rupture d’égalité, la discrimination qui sont des éléments de droits fondamentaux sont au cœur des débats pour « une maladie comme la Covid qui n’est pas Ebola ou le Sida » comme l’explique Me Teissedre.\n\nUne impasse est en train d’être créée puisqu’il faudrait avoir vacciné tout le monde (80%) ou avoir des moyens infaillibles pour vérifier la vaccination (pass vaccinal) avant de pouvoir récupérer ses pleines libertés pour une maladie somme toute peu létale – tout cela au motif du taux d’occupation des lits de réanimation. Les solutions existent, le problème est la volonté de les mettre en œuvre. Beaucoup de questions subsistent :\n\nA en écouter les autorités, il n’y a qu’une solution : vacciner 80% de la population avec un produit dont l’efficacité reste à démontrer, mettre en place un pass vaccinal liberticide infaillible dont une ne sait pas quand ni comment il pourra être mis en place – Ce n’est donc pas demain que les libertés seront récupérées par les citoyens. Un débat qui ne manquera pas d’animer les parlementaires puisque pas plus tard qu’hier les autorités de divers pays se sont soudainement déclarées en faveur de la suspension des brevets des vaccins, après que les sociétés pharmaceutiques aient évoqué des profits substantiels dont la R&D a été financée par des aides gouvernementales. La Terre tourne encore dans le même sens même si les forces en présence semblent s’opposer de manière plus croissantes au bon sens, à la logique et à l’intérêt des citoyens.", "opengraph": {"locale": "fr_FR", "type": "article", "title": "Le Conseil d’Etat vole au secours des incohérences du gouvernement - debriefing Me Protat, Me de Lagarde et Me Teissedre - BonSens.org", "description": "Débriefing FranceSoir- BonSens.org Le Conseil d’Etat vole au secours des incohérences du gouvernement - debriefing Me Protat, Me de Lagarde et Me Teissedre - BonSens.org", "url": "https://bonsens.info/le-conseil-detat-vole-au-secours-des-incoherences-du-gouvernement-debriefing-me-protat-me-de-lagarde-et-me-teissedre/", "site_name": "BonSens.org", "article:published_time": "2021-05-07T14:11:00+00:00", "article:modified_time": "2022-03-24T09:08:12+00:00", "image": "https://bonsens.info/wp-content/uploads/2021/04/protat_lagarde_teissedre4_field_mise_en_avant_principale_0.png", "image:width": "900", "image:height": "360", "image:type": "image/png"}, "tags": ["Santé Humaine", "Tous les Débriefings"], "tweets": [], "movies": [], "links": ["https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.francesoir.fr/videos-les-debriefings/me-protat-et-me-teissedre-pass-vaccinal-et-rupture-degalite", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.conseil-etat.fr/actualites/actualites/les-restrictions-de-deplacement-ne-sont-pas-suspendues-pour-les-personnes-vaccinees-ou-ayant-deja-contracte-la-covid-19", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=http://bonsens.org/", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.francesoir.fr/societe-sante/la-suspension-des-brevets-sur-les-vaccins-une-mesure-pas-si-extraordinaire-que-ca", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.francesoir.fr/videos-les-debriefings/le-conseil-detat-la-rescousse-de-la-politique-liberticide-du-gouvernement"], "authors": ["XadminBonSens02"], "publish_date": "2021-05-07T14:11:00+00:00"}