{"result_id": "053052", "URL": "https://bonsens.info/la-synergie-covid-19-vaccination-augmenterait-elle-la-mortalite-herve-seligmann-et-haim-yativ/", "timestamp": "2023-04-25 12:22:22 CEST+0200", "meta": {"description": "Débriefing FranceSoir- BonSens.org La synergie Covid-19-vaccination augmenterait-elle la mortalité ? Hervé Seligmann et Haim Yativ - BonSens.org", "lang": "fr", "keywords": "", "favicon": "https://bonsens.info/wp-content/uploads/2020/10/bon-sens-BAT-v2-carree-pm.png", "canonical": "https://bonsens.info/la-synergie-covid-19-vaccination-augmenterait-elle-la-mortalite-herve-seligmann-et-haim-yativ/", "encoding": "UTF-8"}, "image": null, "domain": "bonsens.info", "title": "La synergie Covid-19-vaccination augmenterait-elle la mortalité ? Hervé Seligmann et Haim Yativ", "cleaned_text": "Les debriefings de FranceSoir sont proposés en association avec BonSens.org\n\nNous suivons attentivement la situation en Israël, le pays qui a vacciné plus de 50% de sa population à ce jour.\n\nLe Dr Hervé Seligmann et l’ingénieur Haim Yativ ont préparé plusieurs articles sur le site Nakim.org permettant d’avoir une autre vision des chiffres de la vaccination en Israël. Chaque jour amenant son lot de surprises. Leurs articles ont fait l’objet de beaucoup de « debunkages » ou vérification dans plusieurs pays. Ils s’évertuent à répondre à ces vérifications.\n\nDans ce debriefing, ils nous parlent plus particulièrement d’une de ces vérifications.\n\nRetrouvez-le, proposé en partenariat avec BonSens :\n\nUne journaliste allemande, Alice Echtermann, a publié des données obtenues apparemment du ministère israélien de la Santé, cumulées du 20 décembre au 10 mars, sur les patients vaccinés et non vaccinés contre le COVID-19. Son interprétation de ces données, en réaction à une publication de nakim.org, est que la vaccination a diminué les décès, de 1566 (non vaccinés) à 709 (entre les doses), à 84 (dans les 7 jours après la 2e dose) et à 105 (7 jours après 2e dose) (Tableau 1). Ceci est trompeur car les statuts de vaccination diffèrent par la durée et la taille des échantillons. Ajusté en fonction du temps, il y a 20 (= 1566 morts/80 jours), 34, 12 et 4 décès/jour pour les différents statuts vaccinaux, dans le même ordre que ci-dessus. Ajustés pour le nombre total de patients atteints de COVID-19, les décès/jour par personne augmentent de non-vaccinés à complètement vaccinés (tableau 1) et sont multipliés par 11,65, 27,92 et 15 (390-7,49) par rapport aux non vaccinés (tableau 1). Cela confirme une multiplication par trois des taux de détection du COVID-19 au cours des 7 premiers jours après la première dose, par rapport aux taux initiaux de COVID-19 le jour de la première injection. Dr Seligmann et Haim Nakim constatent également que les pourcentages de cas asymptomatiques (communauté) diminuent des non-vaccinés à ceux complètement vaccinés (deux injections). Pour eux la vaccination affaiblit probablement les réactions immunitaires naturelles et augmente les risques précisément pour ceux que la vaccination doit protéger. Les éléments qu’ils soulignent sont :\n• Les résultats ne contredisent pas la possibilité qu’une vaccination complète diminue les incidences du COVID-19. Ce dernier point nécessite des informations qui ne sont pas inclues dans le tableau d’origine, à savoir le nombre d’individus sans COVID-19 pour chaque statut vaccinal. Notamment, contrairement à d’autres pays, le ministère israélien de la Santé ne recommande pas les soins ambulatoires avec des médicaments potentiellement utiles comme le zinc, l’ivermectine ou les vitamines C et D.\n• La vaccination massive doit être reconsidérée et tous les effets indésirables non COVID-19 examinés en relation avec le statut de vaccination.\n\n* Note Morts par jour/total communauté par 10 000 personnes : le calcul est fait à partir du nombre de morts dans le groupe divisé par la durée du statut de vaccination ramené à la taille de la cohorte dans la population\n\n\n\nTableau obtenu de https://correctiv.org/faktencheck/2021/03/11/covid-19-in-israel-nein-die-impfung-erzeugt-keine-40-mal-hoehere-sterblichkeit/. Les data du ministère israélien de la Santé montrent que les cas de COVID-19 pour la période du 20 Décembre au 10 Mars. (Screenshot: CORRECTIV.Faktencheck). Traduit de l’hébreu au français. Nos additions sont soulignées.", "opengraph": {"locale": "fr_FR", "type": "article", "title": "La synergie Covid-19-vaccination augmenterait-elle la mortalité ? Hervé Seligmann et Haim Yativ - BonSens.org", "description": "Débriefing FranceSoir- BonSens.org La synergie Covid-19-vaccination augmenterait-elle la mortalité ? Hervé Seligmann et Haim Yativ - BonSens.org", "url": "https://bonsens.info/la-synergie-covid-19-vaccination-augmenterait-elle-la-mortalite-herve-seligmann-et-haim-yativ/", "site_name": "BonSens.org", "article:published_time": "2021-03-22T18:37:00+00:00", "article:modified_time": "2022-03-24T09:07:34+00:00", "image": "https://bonsens.info/wp-content/uploads/2021/03/israel_3_3_field_mise_en_avant_principale_1_0.png", "image:width": "1111", "image:height": "444", "image:type": "image/png"}, "tags": ["Santé Humaine", "Tous les Débriefings"], "tweets": [], "movies": [], "links": ["https://bonsens.info/", "https://correctiv.org/faktencheck/2021/03/11/covid-19-in-israel-nein-die-impfung-erzeugt-keine-40-mal-hoehere-sterblichkeit/", "https://correctiv.org/faktencheck/2021/03/11/covid-19-in-israel-nein-die-impfung-erzeugt-keine-40-mal-hoehere-sterblichkeit/?fbclid=IwAR1AMeRgb5W0SVdljcsAzJu_hNnktEdgDGurM8175mEhpJRBygTmTzGj42A", "https://www.francesoir.fr/videos-les-debriefings/israel-3"], "authors": ["XadminBonSens02"], "publish_date": "2021-03-22T18:37:00+00:00"}