{"result_id": "053066", "URL": "https://bonsens.info/unispaca-lance-une-sommation-interpellative-a-linitiative-de-lunion-des-collectifs-de-parents/", "timestamp": "2023-04-25 12:22:35 CEST+0200", "meta": {"description": "", "lang": "fr", "keywords": "", "favicon": "https://bonsens.info/wp-content/uploads/2020/10/bon-sens-BAT-v2-carree-pm.png", "canonical": "https://bonsens.info/unispaca-lance-une-sommation-interpellative-a-linitiative-de-lunion-des-collectifs-de-parents/", "encoding": "UTF-8"}, "image": null, "domain": "bonsens.info", "title": "UnisPaca lance une Sommation interpellative à l'initiative de l'Union des Collectifs de parents", "cleaned_text": "SOMMATION INTERPELLATIVE AU RECTEUR DE LA REGION PACA CONCERNANT LES PROTOCOLES SANITAIRES APPLIQUÉS DANS LES ÉTABLISSEMENTS SCOLAIRES, LES CAMPAGNES DE TESTS ET DE VACCINATION\n\nDans le sillage de la Région Grand Est, nous nous sommes unis afin de sommer le recteur de la région académique Provence Alpes Côte d’Azur, de répondre à nos interrogations quant aux conséquences de la politique sanitaire mise en œuvre par le gouvernement dans les établissements scolaires.\n\nNous avons donc déposé par voie d’huissier, le 12 janvier 2022, une sommation interpellative comprenant 21 questions auprès du recteur, à laquelle il lui a été demandé de répondre dans un délai de 48 heures maximum.\n\nDans l’ensemble de la région PACA, où plus de 400 parents se sont portés requérants, ainsi que dans la totalité des régions de France, des citoyens se mobilisent pour défendre la santé et le bien-être de leurs enfants impactés par les protocoles sanitaires mis en œuvre dans les établissements scolaires, au mépris de la propre convention des droits de l’enfant.\n\nNos jeunes générations souffrent de maux de tête liés au port du masque, d’anxiété, de dépression. Certains vont même jusqu’au suicide. On ne compte plus les dommages collatéraux psychologiques et physiques dont nos enfants sont malheureusement victimes.\n\nEn outre, ces protocoles sont en partie discriminatoires (notamment pour l’accès à certains cursus) à l’égard des élèves dont les parents n’ont pas fait le choix de la vaccination qui, rappelons-le, demeure un acte médical qui doit se faire de façon consentie et éclairée. Ils ont par ailleurs donné lieu à des abus quant à la production d’un statut vaccinal ou virologique, protégé par le secret médical et dont seul un médecin peut être informé.\n\nEnfin, selon les déclarations de l’OMS, la Covid-19 n’est pas une maladie à caractère pédiatrique. En revanche, depuis le début de la campagne de vaccination des 12-17 ans, les décès et effets secondaires graves (tels que les myocardites, péricardites, thromboses, AVC…) dus à la vaccination n’ont cessé de se multiplier dans cette tranche d’âge. Chacun est libre de consulter à ce sujet le rapport officiel de l’Agence Nationale de Sécurité du Médicament chiffrant le nombre de décès et effets indésirables graves, post injection, reconnus officiellement.\n\nParents d’élèves scolarisés ou en IEF, enseignants, AESH etc… soutenus dans leur démarche par des grands-parents inquiets, affluent de tous les départements , plus déterminés que jamais, pour exiger des réponses sur le fonctionnement défaillant d’un service public aussi important que celui auquel on confie nos enfants.\n\nA ce jour, nous n’avons toujours pas de réponse du Recteur ou de ses services.\n\nL’intégralité des questions et de la sommation interpellative est accessible sur le site internet : www. unispaca .com", "opengraph": {"locale": "fr_FR", "type": "article", "title": "UnisPaca lance une Sommation interpellative à l'initiative de l'Union des Collectifs de parents - BonSens.org", "description": "SOMMATION INTERPELLATIVE AU RECTEUR DE LA REGION PACA CONCERNANT LES PROTOCOLES SANITAIRES APPLIQUÉS DANS LES ÉTABLISSEMENTS SCOLAIRES, LES CAMPAGNES DE TESTS ET DE VACCINATION   COMMUNIQUÉ Le 22 janvier 2022 Dans le sillage de la Région Grand Est, nous nous sommes unis afin de sommer le recteur de la région académique Provence Alpes Côte d’Azur, […]", "url": "https://bonsens.info/unispaca-lance-une-sommation-interpellative-a-linitiative-de-lunion-des-collectifs-de-parents/", "site_name": "BonSens.org", "article:published_time": "2022-02-01T10:09:36+00:00", "article:modified_time": "2022-02-01T10:15:26+00:00", "image": "https://bonsens.info/wp-content/uploads/2022/02/unispaca-scaled.jpg", "image:width": "2560", "image:height": "1272", "image:type": "image/jpeg"}, "tags": ["Actions judiciaires", "Vidéos Association", "News"], "tweets": [], "movies": [], "links": ["https://www.unispaca.com/", "https://www.unispaca.com/Citoyens-Parents-Recours-juridiques.m.htm"], "authors": ["XadminBonSens02"], "publish_date": "2022-02-01T10:09:36+00:00"}