{"result_id": "053019", "URL": "https://bonsens.info/lettre-aux-deputes-et-senateurs/", "timestamp": "2023-04-25 12:21:42 CEST+0200", "meta": {"description": "", "lang": "fr", "keywords": "", "favicon": "https://bonsens.info/wp-content/uploads/2020/10/bon-sens-BAT-v2-carree-pm.png", "canonical": "https://bonsens.info/lettre-aux-deputes-et-senateurs/", "encoding": "UTF-8"}, "image": null, "domain": "bonsens.info", "title": "Lettre aux Députés et Sénateurs", "cleaned_text": "Voici ce que le Ministre des solidarités et de la santé, Monsieur Olivier VÉRAN, a écrit dans ses mémoires en défense transmis au Conseil d’État dans le cadre des recours introduits par des citoyens français « vaccinés », enregistrées auprès de la plus haute juridiction administrative fin février 2021 et fin mars 2021.\n\n« Dans ces écritures du 28 mars 2021, le Ministre des solidarités et de la santé affirme que « les connaissances scientifiques actuelles font apparaître en tout état de cause comme relatives aux limitations de circulation que les personnes des doses de vaccins ». Autrement dit, les personnes « vaccinées » continueront d’être soumises aux mêmes restrictions des droits et libertés fondamentaux que les personnes « non vaccinées ». Pour justifier ce traitement identique, il avance les arguments suivants :\n• Il soutient : « En premier lieu, comme on le sait, ». Et, lorsqu’il évoque l’«efficacité clinique », il ne parle que des formes « symptomatiques » entre les formes légères, modérées et « graves ». Il explique que « de ces vaccins, il n’y avait donc pas de garantie d’immunité associée pour les personnes qui se le voyaient administré » ;\n• Il ajoute : « En deuxième lieu, cette du fait de l’apparition des nouveaux variants » ;\n• Il poursuit : « En troisième lieu (…), les personnes vaccinées sont aussi celles qui sont les plus exposées aux formes graves et aux décès du vaccin , du fait d’une immuno-sénécence (…) ou de la virulence d’un variant » ;\n• Il termine : « En quatrième lieu, même lorsqu’il a une efficacité sur les personnes concernées, en l’état des connaissances scientifiques, le vaccin ne les empêche pas de transmettre le virus aux tiers ».\n\nEt eu égard à ces quatre arguments, le Ministre des solidarités et de la santé, Monsieur Olivier VÉRAN, conclut :\n\n« Il n’y a donc pas de justification à exempter les personnes de l’application de circulation actuelles comme leur proche ainsi que l’ensemble de la population. ne va d’ailleurs dans le sens de telles exemptions. »\n\nC’est bien le Ministre des solidarités et de la santé, Monsieur Olivier VÉRAN, qui a soutenu ces affirmations auprès du juge administratif. Elles ne sont qu’une confirmation de ses précédentes écritures, datant de fin février 2021, qui avaient été enregistrées par ce même Conseil d’État. Et que le CTIAP a porté à votre connaissance dans notamment son article publié, le 4 mars 2021, sous le titre : « Efficacité des vaccins contre la Covid-19 : le Conseil d’État relève les contradictions de l’« administration » française ». On peut rappeler notamment ce qui suit :\n\n« L’administration fait néanmoins valoir, d’une part l’existence d’études récentes invitant à la de contagiosité des personnes vaccinées, d’autre part, par la vaccination en cours à l’égard des variants du virus, enfin la de résidents et de personnels dans certains EHPAD [établissements d’hébergement de personnes âgées dépendantes] où la campagne de vaccination a eu lieu. »\n\nCe lundi 12 juillet 2021, à 23h48, ce même Ministre, qui a remis en cause l’efficacité de ces vaccins auprès du Conseil d’État dans le but de maintenir les restrictions aux droits et libertés fondamentaux des personnes vaccinées, publie le message suivant sur le réseau social Tweeter :\n\n« Vous êtes des centaines de milliers à avoir réservé un RDV de vaccination ce soir ! Ca tombe bien, on a des vaccins, des centres ouverts partout, et des dizaines de milliers de soignants, pompiers, agents des collectivités qui n’attendent que vous (avec trois smiley) ».\n\n« Des centaines de milliers » de par le dol et la violence notamment, et en direct ?\n\nLe consentement est pourtant une liberté fondamentale. »\n\nAU NIVEAU DE LA MALADIE COVID19\n\nDe nombreuses études montrent que le coronavirus peut-être dangereux pour les sujets âgés, les obèses et les patients atteints de maladies chroniques.\n\nDécès attribués à la Covid19 depuis mars 2020 et à ce jour (période de 15 mois) :\n\nDeux tiers de ces décès avaient au moins une comorbidité et l’âge médian des personnes décédées est de 85 ans\n\nCependant des centaines études publiées dans des revues scientifiques revues par les pairs sur des traitements (hydroxychloroquine, azithromycine, Ivermectine, Vitamine D, Zinc, Colchicine, Budésonide, Anti-histaminiques, fluvoxamine etc) chez ces personnes à risque montrent que la mortalité est divisée au moins par 2 lorsqu’ils sont donnés précocement.\n\nSelon l’Agence Européenne du médicament (EMA), les produits actuellement proposés pour la vaccination ont reçu des autorisations de mise sur le marché conditionnelle. L’EMA attend en retour des données supplémentaires sur la sécurité, l’innocuité et l’efficacité de ces produits car ces produits sont toujours actuellement en phase 3 d’expérimentation (1).\n\nUne analyse (2) du CITIAP CHOLET (Centre Territorial d’Information Indépendante et d’Avis Pharmaceutiques – CENTRE HOSPITALIER DE CHOLET ) a relevé « des incertitudes même sur la qualité intrinsèque des produits, sur leurs procédés de fabrication, sur les lots commercialisés… selon les documents officiels publiés par l’Agence européenne […] les documents officiels publiés soulignent également le caractère incomplet des preuves relatives à la « qualité » de la « substance active » et des « excipients », du « procédé de fabrication », de la « reproductibilité des lots » commercialisés, etc.\n\nC’est ainsi que le délai pour déposer les compléments de preuves concernant la « qualité » de la « substance active » et du « produit fini » (c’est-à-dire le vaccin autorisé et vendu) est fixé aux mois de :\n\nPar ailleurs, il est important de savoir que l’ensemble des études d’innocuité (non toxicité du produit) n’ont pas été menées ou n’ont été que partiellement menées avec ces produits et notamment :\n• la biodistribution (comment les molécules injectées diffusent dans le corps après injection)\n• la génotoxicité (capacité de causer des dommages au matériel génétique du receveur\n• la carcinogénicité (capacité de provoquer des cancers)\n\nCes deux derniers éléments n’ont pas été évalués grâce à une directive de l’OMS concernant les vaccins (normalement des vaccins à virus atténués ou des protéines recombinantes) (3)\n\n« Les études de pharmacologie de sécurité, de génotoxicité et de cancérogénicité n’ont pas été menées, conformément à la directive vaccinale de l’OMS de 2005, car elles ne sont généralement pas considérées comme nécessaires pour soutenir le développement et l’homologation de vaccins contre les maladies infectieuses »\n\nLe problème est que ces produits expérimentaux sont nouveaux et n’ont rien à voir avec des vaccins traditionnels, à tel point que la FDA les qualifie de produit de thérapie génique.(4 )\n\nLa pharmacovigilance sur les vaccins a enregistré au 3 juin 2021 (ANSM)\n\nMême si à ce jour ces effets indésirables graves (EIG) n’ont pas encore été reliés aux traitements expérimentaux, la comparaison aux EIG enregistrés pour les autres vaccins classiques révèlent que ceux-ci sont environ 100 fois plus élevés dans le cas de ces « vaccins » géniques Covid, que pour les vaccins classiques, ce qui révèle un problème majeur qui aurait dû induire l’arrêt de la vaccination de masse, et notamment des jeunes et des enfants qui n’ont aucun risque avec la maladie Covid19.\n\nActuellement les risques de myocardites chez les 16-24 ans ont été évalués jusqu’à 1/3000 avec les vaccins à ARNm (Pfizer, Moderna) , ce qui est considérable. La protéine Spike peut provoquer des inflammations au niveau des cellules endothéliales. Cette même protéine Spike que l’on fait produire par nos cellules par ces produits expérimentaux a en réalité des propriétés pathogènes. Mais cela n’ayant pas été testé initialement par les fabricants, cela n’a été découvert que récemment, notamment par des chercheurs du célèbre Institut SALK (5, 6, 7)\n\nLe CDC américain a reconnu un lien entre les myocardites et les vaccins Pfizer et Moderna, et notamment chez les jeunes (8, 8b)\n\n« Principalement chez les adolescents de sexe masculin et les jeunes adultes âgés de 16 ans ou plus. Plus souvent après avoir reçu la deuxième dose qu’après la première dose de l’un de ces deux vaccins à ARNm COVID-19. Généralement dans les jours qui suivent la vaccination COVID-19 »\n\nComme le montre les très récentes données israéliennes et anglaises où le variant Delta est ultra-majoritaire (+ de 98%), les «vaccins » (Pfizer en Israël et Astrazeneca principalement au Royaume-Uni) n’empêchent ni d’attraper ni de transmettre le virus (9, 10).\n\nCeci est confirmé notamment par l’IHU de Marseille, qui a vu que le variant Delta semblait beaucoup plus résistant à la vaccination, puisque 50% des cas détectés de variants indiens (delta) étaient chez des vaccinés (11)\n\nEn résumé d’après l’ensemble de ces données, ces produits appelés vaccins :\n• sont en phase expérimentale et il manque encore des données de sécurité, d’innocuité et d’efficacité que les fabricants doivent fournir\n• n’empêchent ni d’attraper ni de transmettre le virus, et plus encore contre le variant Delta, ce qui rend caduque le fait qu’un vacciné soit exempté de test PCR pour prouver qu’il n’est pas porteur du virus\n• entrainent des déclarations en pharmacovigilance excessivement supérieures à tous ce que l’on a connu jusqu’ici avec les vaccins classiques\n• ne montrent sans doute pas un bénéfice supérieur aux risques encourus – et notamment sur le long terme – pour une large partie de la population.", "opengraph": {"locale": "fr_FR", "type": "article", "title": "Lettre aux Députés et Sénateurs - BonSens.org", "description": "L’association Bonsens.org a envoyé à chaque député ce vendredi 16 juillet , et aux sénateurs demain samedi 17 juillet, par mail et par lettre recommandée avec accusé reception, cette lettre présentant notre demande de ne pas voter le projet de loi prochain à cause de raisons graves que nous expliquons dans ce courrier De : Association […]", "url": "https://bonsens.info/lettre-aux-deputes-et-senateurs/", "site_name": "BonSens.org", "article:published_time": "2021-07-16T17:34:23+00:00", "article:modified_time": "2021-07-19T18:52:11+00:00", "image": "https://bonsens.info/wp-content/uploads/2021/07/note-2762271_1920.png", "image:width": "1920", "image:height": "782", "image:type": "image/png"}, "tags": ["Communiqué de Presse"], "tweets": [], "movies": [], "links": ["http://ctiapchcholet.blogspot.com/2021/03/efficacite-des-vaccins-contre-la-covid.html", "https://ctiapchcholet.blogspot.com/2021/07/vaccins-contre-la-covid-19-allocution.html", "https://ansm.sante.fr/dossiers-thematiques/covid-19-suivi-hebdomadaire-des-cas-deffets-indesirables-des-vaccins", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/myocarditis.html", "https://www.larevuedupraticien.fr/article/vaccinovigilance-le-point-sur-les-dernieres-donnees"], "authors": ["XadminBonSens02"], "publish_date": "2021-07-16T17:34:23+00:00"}