{"result_id": "053002", "URL": "https://translate.google.com/translate?hl=en&sl=fr&u=https://bonsens.info/communique-special-greffe-dorganes-des-non-vaccines/&prev=search&pto=aue", "timestamp": "2023-04-25 12:21:29 CEST+0200", "meta": {"description": "", "lang": "fr", "keywords": "", "favicon": "https://bonsens.info/wp-content/uploads/2020/10/bon-sens-BAT-v2-carree-pm.png", "canonical": "https://bonsens.info/communique-special-greffe-dorganes-des-non-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "translate.google.com", "title": "Communiqué spécial : Greffe d'organes des non vaccinés", "cleaned_text": "Depuis quelques années, si vous ne vous y opposez pas de votre vivant, vous êtes de fait donneur d’organes à votre mort. Si vous ne le souhaitez pas, vous devez absolument faire une opposition formelle.\n\nAvant de procéder à un prélèvement d’organes, les équipes médicales ont l’obligation de consulter le registre national des refus de dons d’organes.\n\nAujourd’hui, la plupart des CHU refuse des greffes d’organes aux non vaccinés Covid-19, ce qui est totalement inadmissible.\n\nLors du Live de BonSens, a été évoqué par Maitre Diane Protat le cas d’une femme [Madame X] retirée des listes d’attente de greffes de reins par le CHU de Dijon faute d’être vaccinée contre la COVID-19. Elle a saisit le Tribunal Administratif de Dijon, mais quelques jours avant l’audience, le CHU de DIJON a pris la décision de « changer ses pratiques » et l’a ré-intégrée (ainsi que d’autres patients dans la même situation) sur la liste d’attente des greffes en lui faisant signer un document indiquant qu’elle reconnaissait les dangers de ne pas être vaccinée lorsque l’on est en attente de greffe.\n\n” Du fait de la persistance dans le temps de l’épidémie, nous sommes amenés à changer notre pratique consistant à placer les patients en contre-indication temporaire médicale sur la liste d’atteinte nationale et à envisager la transplantation rénale, même en l’absence de vaccination; ceci afin de garantir le principe d’équité dans l’accès à la greffe.”\n\nMais de ce fait, le tribunal administratif de Dijon a radié l’affaire et aucune jurisprudence applicable pour d’autres personnes et à d’autres CHU n’existe .\n\nBonSens qui soutient cette personne, pose la question suivante et interpelle les autorités sanitaires. Que se passerait-il si tous les non vaccinés Covid-19 de France s’opposaient aux prélèvements de leurs organes suite à leur décès, c’est à dire s’ils se retiraient en masse de la liste des donneurs d’organes ?\n\nL’association BonSens.org pense qu’il est urgent que tous les non vaccinés Covid-19 nécessitant une greffe puissent ré-intégrer au plus vite la liste des receveurs afin de garantir le principe d’équité dans l’accès à la greffe\n\nExtrait de la lettre du CHU de Dijon reçue par Madame X", "opengraph": {"locale": "fr_FR", "type": "article", "title": "Communiqué spécial : Greffe d'organes des non vaccinés - BonSens.org", "description": "Le saviez-vous ? Depuis quelques années, si vous ne vous y opposez pas de votre vivant, vous êtes de fait donneur d’organes à votre mort. Si vous ne le souhaitez pas, vous devez absolument faire une opposition formelle. Avant de procéder à un prélèvement d’organes, les équipes médicales ont l’obligation de consulter le registre national […]", "url": "https://bonsens.info/communique-special-greffe-dorganes-des-non-vaccines/", "site_name": "BonSens.org", "article:published_time": "2023-03-07T12:09:04+00:00", "article:modified_time": "2023-03-07T14:56:46+00:00", "image": "https://bonsens.info/wp-content/uploads/2021/03/communique-special-bonsens-v1.jpg", "image:width": "1920", "image:height": "1390", "image:type": "image/jpeg"}, "tags": ["Communiqué de Presse", "News"], "tweets": [], "movies": [], "links": ["https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.youtube.com/live/1rCqqlUdRZo?feature%3Dshare%26t%3D4464"], "authors": ["XadminBonSens02"], "publish_date": "2023-03-07T12:09:04+00:00"}