{"result_id": "053034", "URL": "https://translate.google.com/translate?hl=en&sl=fr&u=https://bonsens.info/obligation-vaccinale/&prev=search&pto=aue", "timestamp": "2023-04-25 12:21:57 CEST+0200", "meta": {"description": "", "lang": "fr", "keywords": "", "favicon": "https://bonsens.info/wp-content/uploads/2020/10/bon-sens-BAT-v2-carree-pm.png", "canonical": "https://bonsens.info/obligation-vaccinale/", "encoding": "UTF-8"}, "image": null, "domain": "translate.google.com", "title": "MODELES DE COURRIERS : Obligation vaccinale", "cleaned_text": "J’accuse réception de la lettre, circulaire note de service en date du ….. par laquelle vous m’ordonnez de me faire « vacciner ».\n\nJe vous informe ou rappelle que tous les « vaccins » actuellement proposés à l’injection ne sont pas des vaccins mais des classées juridiquement comme médicaments et de surcroît tous ces produits ne sont encore qu’au stade expérimental (phase 1 à 3 groupées) et ce jusqu’en 2022 voire 2023. Ces substances géniques ne disposent donc que d’une autorisation temporaire de mise sur le marché.\n\nJe vous rappelle également que sur le site Européen de pharmacovigilance “EUDRAVigilance”, il est mentionné 19.791 décès au 24/07/2021 et environ plus de 2.000.000 d’effets indésirables dont 800.000 graves voire irréversibles (hors notamment Suisse et UK), ce qui est extrêmement alarmant par rapport à toutes les campagnes de vaccinations que nous avons connues par le passé. Il est à noter que d’après de nombreux scientifiques les données de pharmacovigilance ne représentent en général que 5% en moyenne des cas réels et que des essais cliniques sont normalement arrêtés immédiatement si des décès sont constatés (exemple parmi de nombreux : en juillet 2020, la Food and Drug Administration (FDA) américaine a stoppé les essais cliniques de la société Cellectis pour le produit UCARTCS1 pour seulement ).\n\nLe professeur Peter A. McCullough, cardiologue, vice-chef de médecine interne à la Baylor University Medical Center à Dallas au Texas ainsi que professeur principal en médecine interne à l’Université A&M du Texas Health Sciences Center, a précisé dans une interview que :\n\n« La limite pour arrêter un programme de vaccin est 25 à 50 morts. Grippe porcine, 1976, 26 décès, ils ont arrêté.» – COVID : «Le vaccin est l’agent biologique le plus mortel, le plus toxique jamais injecté dans un corps humain».\n\nA ce stade, je suis contraint (e) de constater que nous sommes face à un empoisonnement collectif. Ce n’est pas parce que ce scandale sanitaire n’est pas mentionné par les médias « grand public » qu’il n’existe pas.\n\nCompte tenu notamment de la loi dite « KOUCHNER », du règlement (UE) 2021/953 du PARLEMENT EUROPÉEN ET DU CONSEIL du 14 juin 2021, relatif à un cadre pour la délivrance, la vérification et l’acceptation de certificats COVID-19 interopérables de vaccination, de test et de rétablissement (certificat COVID numérique de l’UE) afin de faciliter la libre circulation pendant la pandémie de COVID-19 (considérants 36 et 62) ainsi que des conventions internationales ratifiées par la France, dont la Convention d’ OVIEDO en vigueur depuis le 1 avril 2012, ayant une valeur juridique supérieure à la loi, et à plus forte raison au décret et selon l’article 55 de la Constitution, nul ne peut être obligé de suivre un traitement expérimental.\n\nSachant que les laboratoires ont décliné toute responsabilité, qui assumera la responsabilité en cas de complication, d’accident, voire de décès post vaccinal ? L’Etat ? L’établissement ? Vous Monsieur Madame ?\n\nEn l’état actuel des informations, tant au sujet du produit que des garanties proposées, je refuse de donner mon consentement éclairé à une injection de l’un quelconque des produits anti COVID proposés à ce jour en France, à moins que vous n’ayez des informations nouvelles que je n’ai pas, qui vous amèneraient à me garantir personnellement :\n\n1- Que je serai protégé(e) contre le Covid-19,\n\n2- Que cette injection ne me rendra pas contagieux (se) vis à vis de mon entourage,\n\n3- Que je ne risque pas d’effets indésirables graves,\n\n4- (optionnel si crédit(s) en cours car clause d’exclusion en cas de participation à un essai clinique) Que mon/mes assurance(s) décès notamment pour mon logement.. prendra/prendront bien en charge le reste de mon/mes crédits à payer afin que mes survivants puissent continuer à vivre paisiblement.\n\nFaute de m’apporter les garanties ci-dessus demandées, l’ordre que vous me donnez est illégal, en l’absence de mon consentement. De plus, dans le cas où vous ne pourriez m’apporter les garanties demandées, cet ordre serait contraire à toute logique, puisque c’est vous qui exigez cette injection, sans pouvoir me garantir que je n’en mourrai pas, ou que je ne serai pas gravement handicapé(e).\n\nPersister à me contraindre à la « vaccination » (le terme « injection » est plus approprié) pourrait vous rendre personnellement passible notamment des dispositions des articles 121-1 et suivants du Code pénal, celles de l’article 221-5, prévoyant des peines criminelles lorsque l’on se rend complice d’un empoisonnement ou d’une tentative d’empoisonnement ainsi que celles de l’article 222-33-2 du même Code.\n\nL’article 7 du Code de procédure pénale précise que « L’action publique des crimes se prescrit par à compter du jour où l’infraction a été commise. […]». L’article 8 dispose « L’action publique des délits se prescrit par à compter du jour où l’infraction a été commise. […]»", "opengraph": {"locale": "fr_FR", "type": "article", "title": "MODELES DE COURRIERS : Obligation vaccinale - BonSens.org", "description": "URGENT Modèles de courriers réponses rédigés par des Avocats et Juristes en cas de demandes menaçantes de Chefs d’entreprises ou de responsables d’établissements scolaires ou universitaires appelant à la “vaccination” obligatoire pour les employés ou pour les élèves ou étudiants. EXPLICATIONS PRÉALABLES : A la suite de la réception par des parents d’élèves ou d’étudiants de […]", "url": "https://bonsens.info/obligation-vaccinale/", "site_name": "BonSens.org", "article:published_time": "2021-07-28T17:26:56+00:00", "article:modified_time": "2021-08-02T18:52:34+00:00", "image": "https://bonsens.info/wp-content/uploads/2021/07/note-2762271_1920.png", "image:width": "1920", "image:height": "782", "image:type": "image/png"}, "tags": ["Communiqué de Presse"], "tweets": [], "movies": [], "links": [], "authors": ["XadminBonSens02"], "publish_date": "2021-07-28T17:26:56+00:00"}