{"result_id": "053009", "URL": "https://bonsens.info/ouverture-pour-les-soignants-dune-deuxieme-vague-de-plaintes-a-la-cedh-contre-la-france/", "timestamp": "2023-04-25 12:21:35 CEST+0200", "meta": {"description": "", "lang": "fr", "keywords": "", "favicon": "https://bonsens.info/wp-content/uploads/2020/10/bon-sens-BAT-v2-carree-pm.png", "canonical": "https://bonsens.info/ouverture-pour-les-soignants-dune-deuxieme-vague-de-plaintes-a-la-cedh-contre-la-france/", "encoding": "UTF-8"}, "image": null, "domain": "bonsens.info", "title": "Ouverture pour les soignants d’une deuxième vague de plaintes à la CEDH contre la France pour avoir conditionné le maintien de l’emploi des soignants à la participation forcée à des essais cliniques ...", "cleaned_text": "La Convention de sauvegarde des droits de l’homme et des libertés fondamentales a été élaborée au sein du Conseil de l’Europe. Ouverte à la signature à Rome le 4 novembre 1950, elle est entrée en vigueur en septembre 1953. La France l’a ratifiée le 3 mai 1974 et a accepté le droit de recours individuel en 1981.\n\nLa Cour européenne des droits de l’homme (CEDH) est l’organe judiciaire du Conseil de l’Europe qui examine notamment des requêtes individuelles émanant de particuliers qui considèrent que leur Etat a violé cette Convention de sauvegarde des droits de l’homme et des libertés fondamentales. Pour plus de détails voir les deux fichiers en téléchargement.\n\nEn septembre 2021, le Collectif des Syndicats et Associations Professionnels Européens (CSAPE) et Guy Froment responsable juridique national des pompiers, ont saisi la Cour européenne des droits de l’homme (CEDH) pour le compte de 268 soignants considérant que la loi du 5 août 2021 dite loi de l’« obligation vaccinale des soignants » constitue une violation caractérisée de leurs droits fondamentaux exprimés dans la Convention de sauvegarde des droits de l’homme et des libertés fondamentales.\n\nCes 268 requêtes ont été acceptées par la CEDH et sont aujourd’hui en instruction.\n\nL’objectif de saisir la Cour européenne des droits de l’homme est notamment d’obtenir réparation si la cour reconnaît que la France s’est rendu coupable de violation des droits fondamentaux des plaignants en les obligeant notamment à se faire injecter les substances géniques en essais cliniques pour pouvoir continuer à exercer leur activité professionnelle.\n\nSi la violation des droits fondamentaux est reconnue par la CEDH, les soignants pourront formuler des demandes d’indemnités évaluées sur les pertes ou les atteintes estimées, de mise sous astreinte de la France, de condamnations pénales des responsables etc ..\n\nEtant donné l’acceptation à l’instruction des 268 premières requêtes, le Collectif des Syndicats et Associations Professionnels Européens (CSAPE) a pris la décision de proposer aux soignants n’ayant pas participé aux premières requêtes, de les accompagner dans une deuxième vague de plaintes à la CEDH contre la France.\n\nL’issue de cette procédure n’est pas garantie mais on ne voit pas comment la CEDH pourrait ne pas reconnaître la violation des droits fondamentaux par la France sans remettre en cause la Convention de sauvegarde des droits de l’homme et des libertés fondamentales en elle-même, fondement de la construction européenne, sachant par ailleurs que l’Assemblée parlementaire du Conseil de l’Europe a adopté une résolution n°2361 le 27 janvier 2021, qui demande aux Etats membre notamment:\n\n” 7.3.1 de s’assurer que les citoyens et citoyennes sont informés que la vaccination n’est pas obligatoire et que personne ne subit de pressions politiques, sociales ou autres pour se faire vacciner, s’il ou elle ne souhaite pas le faire personnellement;\n\n7.3.2 de veiller à ce que personne ne soit victime de discrimination pour ne pas avoir été vacciné, en raison de risques potentiels pour la santé ou pour ne pas vouloir se faire vacciner;”\n\nSi vous souhaitez participer à cette nouvelle vague de dépôts de plaintes, merci cliquer sur le bouton ci-dessous et de remplir le formulaire.\n\nLe Collectif des Syndicats et Associations Professionnels Européens (CSAPE) reprendra contact avec vous rapidement afin de vous informer des modalités de cette procédure.", "opengraph": {"locale": "fr_FR", "type": "article", "title": "Ouverture pour les soignants d’une deuxième vague de plaintes à la CEDH contre la France pour avoir conditionné le maintien de l’emploi des soignants à la participation forcée à des essais cliniques ... - BonSens.org", "description": "Le Collectif des Syndicats et Associations Professionnels Européens (CSAPE) va lancer une nouvelle vague de dépôts de plaintes à la CEDH contre la France Rappel : La Convention de sauvegarde des droits de l’homme et des libertés fondamentales  a été élaborée au sein du Conseil de l’Europe. Ouverte à la signature à Rome le 4 novembre […]", "url": "https://bonsens.info/ouverture-pour-les-soignants-dune-deuxieme-vague-de-plaintes-a-la-cedh-contre-la-france/", "site_name": "BonSens.org", "article:published_time": "2022-01-27T11:24:13+00:00", "article:modified_time": "2022-03-25T07:26:03+00:00", "image": "https://bonsens.info/wp-content/uploads/2021/07/note-2762271_1920.png", "image:width": "1920", "image:height": "782", "image:type": "image/png"}, "tags": ["Actions judiciaires", "Vidéos Association", "News"], "tweets": [], "movies": [], "links": [], "authors": ["XadminBonSens02"], "publish_date": "2022-01-27T11:24:13+00:00"}