{"result_id": "053060", "URL": "https://bonsens.info/actualites-bonsens-n-2021-22-du-31-mai-2021/", "timestamp": "2023-04-25 12:22:31 CEST+0200", "meta": {"description": "Actualités BonSens N° 2021-22 du 31 mai 2021 - BonSens.org", "lang": "fr", "keywords": "", "favicon": "https://bonsens.info/wp-content/uploads/2020/10/bon-sens-BAT-v2-carree-pm.png", "canonical": "https://bonsens.info/actualites-bonsens-n-2021-22-du-31-mai-2021/", "encoding": "UTF-8"}, "image": null, "domain": "bonsens.info", "title": "Actualités BonSens N° 2021-22 du 31 mai 2021", "cleaned_text": "INFO CLÉS : LES ÉLÉMENTS IMPORTANTS DE CETTE SEMAINE\n• \n• Bonne nouvelle: une maladie COVID-19 légère induit une protection durable des anticorps – Les personnes qui ont eu une maladie bénigne développent des cellules productrices d’anticorps qui peuvent durer toute leur vie (étude publiée dans le journal Nature)\n• Une nouvelle étude conclut que les masques n’ont pas ralenti la propagation du COVID aux États-Unis\n\nAu lieu de cela, les chercheurs ont constaté que le port prolongé du masque peut provoquer la déshydratation et augmenter le risque d’infection bactérienne.\n• Dans le rapport Risk Managment de Pfizer émis par l’EMA on peut lire « Aucune étude de pharmacologie de sécurité, de génotoxicité et de carcinogénicité n’a été menée, conformément à la directive de l’OMS sur les vaccins de 2005 » Ils citent en référence le World Health Organization. Annex 1. WHO guidelines on nonclinical evaluation of vaccines. In: World Health Organization. WHO technical report series, no. 927.\n• Israël pourrait reculer sur la vaccination des enfants car l’immunité collective est atteinte. Le ministère de la Santé devrait se prononcer dans les prochains jours sur la question de la vaccination des personnes âgées de 15 à 12 ans Le directeur de l’Unité de prévention et de contrôle des infections à Sheba soutient que rien ne justifie la vaccination des enfants, alors que d’autres pensent le contraire.\n• \n• Lisa Shaw, la présentatrice vedette de la BBC est décédée à l’âge de 44 ans d’un caillot sanguin après avoir reçu le vaccin Astrazeneca selon sa famille.\n• \n• Pfizer a eu l’autorisation de l’EMA pour les enfants. Pfizer se vante d’un taux d’efficacité de 100% oubliant au passage de préciser que les groupes sont de petites tailles ( 1131 enfants vaccinés dont 1005 qui ont reçu 2 doses) dans ses essais, que 98,36% des enfants du groupe placebo n’ont pas attrapé le Covid contre 100% des vaccinés (ce qui permet de mettre en perspective une efficacité absolue finalement faible, pour une maladie qui ne tue pas les enfants) mais que par contre 0,4% des enfants vaccinés ont eu des effets secondaires graves .\n• L’antigène du vaccin SARS-CoV-2 circulant détecté dans le plasma des receveurs du vaccin ARNm-1273. Les protéines du SARS-CoV-2 ont été mesurées dans des échantillons de plasma longitudinaux prélevés sur 13 participants ayant reçu deux doses de vaccin ARNm-1273 (Pfizer). 11 des 13 participants ont montré des niveaux détectables de protéine SARS-CoV-2 dès le premier jour après la première injection de vaccin. Le Canadian Covid Care Alliance alerte sur les vaccins notamment sur les adolescents et les enfants « Des études récentes suggèrent que la protéine de pointe produite en réponse à la vaccination, peut se lier et interagir avec diverses cellules dans tout le corps, via leurs récepteurs ACE2, entraînant potentiellement des dommages à divers tissus et organes. Ce risque, aussi théorique soit-il, doit être étudié avant la vaccination des enfants et des adolescents »\n• \n• En Inde, l’association des avocats a décidé d’attaquer l’OMS pour fraude à la science en n’utilisant pas les bonnes études sur l’ivermectine.\n• Pierre Kory continue avec le FLCCC à évoquer les sujets de l’ivermectine.\n• Le médicament appelé Fluvoxamine, un antidépresseur bien connu des médecins, montrent un effet très important pour empêcher le décès et l’hospitalisation de patients Covid (près de 90% d’amélioration) dans quelques études publiées ou en preprint.\n• \n• Le Pass Sanitaire a été voté au Sénat malgré l’opposition de certains sénateurs comme Loic Hervé , Alain Houpert – sénateur Loic Hervé suite au vote au Sénat sur le pass sanitaire\n• Le conseil constitutionnel a approuvé le Pass sanitaire, malgré la saisine du conseil constitutionnel par Martine Wonner et une soixantaine de députés. « Jugeant que le projet de loi sur la sortie de crise sanitaire donnait trop de pouvoir au gouvernement, certains députés avaient saisi le Conseil constitutionnel mais le recours n’a pas abouti.»\n• Un groupe de médecin de l’académie médecine aurait rendu un avis sur l’obligation vaccinale qui ne leur semble par déraisonnable. Le Pr Fisher a indiqué que cela ne représentait qu’une partie de l’académie de médecine. La vidéo est disponible ici.\n• Israël abandonne son Pass vert le 1er juin. « Yuli Edelstein, le Ministre de la Santé qui a a annoncé la fin du passeport vert. Il ne sera plus obligatoire de présenter un passeport vert émis par le Ministère de la Santé avec une preuve de guérison ou de vaccination pour entrer dans certains lieux fermés à compter du 1er juin 2021». La présentation du “passeport vaccinal” pour aller par exemple au restaurant ou à l’hôtel a été annulée mardi 1er juin, tout comme les dernières jauges de présence pour les établissements recevant du public. Le ministre de la Santé Yuli Edelstein a indiqué que le port du masque, encore obligatoire dans les lieux fermés et les transports publics, pourrait être annulé “d’ici deux semaines”.\n• Après l’abandon d’un Pass vaccinal ou sanitaire par les USA, la Russie et Israël, le Telegraph a révélé hier que « le passeport vaccinal britannique est sur le point d’être abandonné » Cette information capitale a été reprise par Reuters. L’Europe se trouve désormais bien isolée avec son Pass sanitaire.\n• \n• L’enquête a été ouverte en septembre 2020, mais l’AFP la révèle ce vendredi 21 mai. Le parquet national financier (PNF), après une alerte de l’association anticorruption Anticor, a ouvert une enquête préliminaire pour “favoritisme” autour de la gestion de l’application StopCovid devenue quelques mois plus tard TousAntiCovid.\n• \n• Une grosse manifestation a eu lieu à Londres ce weekend avec d’après les organisateurs près d’un million de participants – peu de couverture dans les médias mainstream\n• En France, quelques manifestations ont eu lieu dont une marche à Paris organisée par Paris pour la liberté\n\nLES ACTIONS MENÉES DE LA SEMAINE\n• None il faut arrêter la vaccination Le défi de la vérité avec le Pr Montagnier – la vie utilise les virus pour faire de grandes choses – Pour lui est est clair qu’\n• None , psychologue clinicienne et psychothérapeute. Entretien essentiel avec Marie Estelle Dupont , psychologue clinicienne et psychothérapeute. Une civilisation qui envisage de museler ses enfants est une civilisation qui a cédé à la peur, et ce principe de précaution fait plus de morts que la maladie elle-même. »\n• None Le défi de la vérité avec le Sénateur Alain Houpert – A-t-on été dans le bon cadre de la réalité ?\n• None . Se défendant de toute forme de complotisme, il retrace de manière méthodique et sourcée tous ses travaux. Le journaliste d’investigation se penche sur la corruption, les manipulations diverses qui touchent au parti de Xi Jinping, Président de la République populaire de Chine. Debriefing avec le journaliste Jean Robin . Se défendant de toute forme de complotisme, il retrace de manière méthodique et sourcée tous ses travaux. Le journaliste d’investigation se penche sur la corruption, les manipulations diverses qui touchent au parti de Xi Jinping, Président de la République populaire de Chine.\n• None qui offre 2 millions de dollars à qui serait capable de montrer que les recommandations de l’OMS ou du Debriefing avec l’entrepreneur Steve Kirsch qui offre 2 millions de dollars à qui serait capable de montrer que les recommandations de l’OMS ou du NIH sont justes concernant l’ivermectine ou la fluvoxamine (que ces institutions ont jugé défavorables en date du 21 mai)\n• BonSens.org est en préparation un nouveau sondage sur la vaccination des enfants et sur le consentement éclairé\n\nNous avons mandaté l’avocat Me Teissedre pour 2 nouvelles procédures BonSens : 1 / Intervention au recours devant le conseil d’Etat au sujet du Rivotril à la 10 ème chambre sur le fond n°446888 (contre les décrets des 14 octobre 2020, 29 octobre 2020 et 2 novembre 2020), 2/ Saisine au Tribunal Administratif de Montreuil pour obtenir de l’ANSM les documents concernant les essais cliniques sur l’hydroxychloroquine. La commission d’accès aux documents administratifs avait émis fin mars 2021un avis favorable à la communication par l’ANSM des documents relatifs aux essais cliniques de l’hydroxychloroquine notamment sur tous les documents liés aux causes d’arrêt y compris les échanges avec les autorités, HCSP et membres du gouvernement. Mais l’ANSM n’a rien envoyé dans le délai d’un mois imparti. L’ANSM a finalement répondu qu’il n’y avait aucun enregistrement pour la délivrance des recommandations temporaires d’utilisation RTU/ATU du remdesivir et des anticorps monoclonaux et s’est fondé sur les travaux de l’EMA . Une obscurité sans pareille. Par courrier électronique en date du 12 mai 2021, vous souhaitez prendre connaissance des délibérations des organismes consultatifs d’expertise siégeant auprès de l’Agence, au terme desquelles l’agence aurait délivré les autorisations temporaires d’utilisation (ATU) de cohorte pour des spécialités à base de bamlanivimab et de remdesivir dans la prise en charge de la maladie Covid-19. A cet égard, les articles L. 300-2 et L. 311-1 du Code des relations entre le public et l’administration prévoient que les documents sollicités revêtent le caractère de document administratif, communicable à tout tiers qui en fait la demande. Toutefois, en l’espèce, de tels documents n’existent pas. En effet, les demandes d’ATU en question ont fait l’objet d’une évaluation interne, menée par les services compétents de l’agence, qui se sont notamment appuyés sur la collégialité de l’évaluation européenne, à laquelle la France a pris part, dans le cadre du comité des médicaments à usage humain (CHMP) institué auprès de l’Agence européenne des médicaments. A cet égard, il peut être rappelé que si l’article R. 5322-14 du Code de la santé publique permet au directeur général de l’agence de mettre en place des instances consultatives d’expertise, la mise en place puis la saisine de ces dernières n’est cependant pas une obligation et demeure purement discrétionnaire.\n\nEnfin, les dispositions du Code de la santé publique spécifiques à l’instruction des demandes d’ATU ne prévoient pas non plus de consultation obligatoire de telles instances.\n• \n• BonSens a lancé avec Me Jean-Pierre Joseph une série de plaintes collectives contre l’Ordre des Médecins : https://bonsens.info/plaintes-collectives/\n• \n• Bonsens va lancer une plainte collective contre les autorités de santé ayant recommandé ces vaccins encore en phase expérimentale pour une utilisation à grande échelle.\n• \n• Ivermectine : Après la décision de l’EMA de déconseiller l’ivermectine, et comme attendu, l’ANSM et l’OMS ont suivi cette recommandation fort surprenante. BonSens avec Me Teissedre a décidé de ne pas lâcher l’affaire et de s’allier avec d’autres associations dans cette démarche. Rappelons qu’une fraude à la science existe preuves à l’appui. Me Teissedre pousse avec les instances judiciaires – elles ont jusqu’à fin juin pour se saisir de l’affaire – si la justice ne s’est pas saisi du cas, nous avons d’autres moyens d’actions.\n• Nous continuons à faire les demandes CADA et ANSM pour s’assurer du traitement égalitaire des diverses ATU pour les traitements. L’université de Liverpool a mis au point un panel de 3 experts pour regarder la méta-analye Hill – Nous avons demandé des détails sur les liens d’intérêts de ces individus avec Unitaid, BMGF dans les 5 dernières années.\n• Me Virginie Arujau a mis au point une procédure d’action collective pour mettre fin aux nombreuses mesures liberticides prises en France depuis mars 2020 en groupement avec divers avocats internationaux. BonSens a décidé d’apporter son soutien à cette action qui parait importante étant donné les mesures liberticides que nous subissons. Les documents sont en ligne pour les télécharger.\n• Enquête sur les parcours de Covid19 symptomatique : Cette enquête a pour but d’informer les soignants et les futurs malades des traitements dispensés par des médecins traitants qui ont guéri les patients symptomatiques du COVID19 : https://bonsens.info/racontez-nous-votre-experience-covid-19-symptomatique/\n• \n• Me Protat a fait une requête au Conseil d’Etat car son client de 83 ans vacciné n’avait pas récupéré sa liberté – BonSens, Christian Perronne et Xavier Azalbert ont fait une intervention volontaire, audiencé le 4 mai 2021\n• Etude d’un recours sur le consentement éclairé en cours sur la base de « l’information délivrée » notamment sur la publicité.\n• Recours sur le fond devant le conseil d’état sur la contestation de l’impunité garantie aux vaccins, l’état d’urgence sanitaire, le Rivotril et son impunité garantie, les mesures portant atteinte à la liberté individuelle sous le contrôle du juge administratif au lieu du juge civil. Appuyée par question prioritaire de constitutionnalité. La question prioritaire de constitutionalité a été regrettablement rejetée début février en esquivant les points de fond. L’affaire continue. Des éléments à charge ont été rajoutés suite à la forte hausse du taux de mortalité dans les EHPADs. Les statistiques de mortalité dans les EHPADs suite à la vaccination pourrait montrer qu’il n’y a pas d’effet protecteur contre la maladie. Le vrai problème est l’obtention et l’accès aux données pour enquêter plus en détail sur ce sujet.\n• Lettre à la CNAM sur le traitement de prospection vaccin Covid pour faire respecter le droit d’opposition « pour ne pas être sollicité pour se faire vacciner». La réponse obtenue est inacceptable car c’est un copié collé du texte du décret qui n’est pas pertinent. En l’occurrence, ils expliquent que le droit d’opposition sera à faire valoir qu’une fois inscrit dans la base de donnée. Cela ne respecte pas le droit à la limitation. A l’instant présent, les informations sur les individus sont donc accessibles par n’importe quel médecin via une recherche par numéro de sécurité sociale. Sur la limitation, une nouvelle demande a été faite auprès de la CPAM du 78. Le délai d’un mois étant écoulé une action en justice ou à la CNIL peut-être effectué pour le respect des droits individuels\n• \n• Remdesivir et Union Européenne: action déposée sur la responsabilité des diverses instances sur le Remdesivir y compris sur les conséquences économiques pour la France et le rôle des différentes parties dans le support à la décision et dans la prise en considération des données cliniques disponibles au moment de la décision. Deux actions ont été faites à ce sujet dont une par Réaction 19 et l’autre Me Di Vizio. Ce médicament a fait l’objet d’une nouvelle demande d’extension de l’AMM. Ce qui est surprenant étant donné les effets secondaires du médicament.\n• \n• Une nouvelle analyse des dispositions prises par l’OMS et l’ANSM est en cours y compris de l’étude Recovery ou le surdosage en HCQ a entrainé des décès par overdose. Une dernière publication est parue dans Archive of Microbiology & Immunology. Nous sommes très heureux car des membres de BonSens font partie des auteurs de cette étude et que l’association a soutenu sa publication. Cette publication remet en cause de manière définitive le surdosage en hydroxychloroquine utilisé dans l’étude Recovery. Ce surdosage crée un shunt pulmonaire qui pourrait « mimer un Covid-19 » ou une aggravation Covid-19 ce qui expliquerait les nombreux passages en réanimation et la surmortalité.\n• Mise en demeure des agences sanitaires, des sociétés savantes et de la direction de publication des médias mainstream pour tenir compte des nouvelles informations (lettre du NEJM et Meta analyse récemment publiée) qui avalisent le surdosage de l’étude Recovery et par conséquence invalident non seulement cette étude mais également les méta-analyses qui incluent cette étude, comme la méta analyse Fiolet et al. qui a fait l’objet de plus de 30 communications dans les médias mainstream. La méta analyse Fiolet et al. ainsi que l’étude Recovery ont influencé les stratégies des autorités sanitaires qui doivent donc être revues.\n• Demande à la CADA : Le Compte Rendu de la réunion du 19 décembre du Conseil Scientifique a été publié le 25 février, cependant il manque encore les enregistrements vidéo et les calculs pour d’autres avis.\n• Demande CADA : Les comptes rendus les enregistrements sur les débats concernant les autorisations relatives aux vaccins et sur les points de pharmacovigilance (à l’ANSM et/ou HAS)\n• Demande CADA : Les comptes rendus les enregistrements sur les réunions octroyant une ATU de cohorte du Remdesivir et Bamlanivimab (à l’ANSM )\n\nRAPPEL DES OBJECTIFS CLÉS DE BONSENS EN QUELQUES MOTS\n• L’objectif recherché est d’obtenir l’autorisation des autorités de divers traitements précoces en respect du droit fondamental de l’accès aux soins des citoyens comme beaucoup de pays qui utilisent ces médicaments en prophylactique et en curatif. Les actions menées sont :\n• Actions d’information et pression citoyenne (le procès du médiator dont les résultats ont été connus ce jour est là pour nous rappeler l’importance d’une lanceuse d’alerte et de la pression du collectif citoyen).\n• Actions juridiques sur les traitements précoces (ivermectine et autres traitements) en France et en association avec des médecins et d’autres groupes étrangers\n• Sensibilisation des adhérents et de la population au fait que le bénéfice-risque des traitements précoces est en faveur des traitements.\n• Nous prenons à tous moments la balance bénéfice-risque entre les divers piliers de réponse à une épidémie en accord avec le Comité Scientifique Indépendant\n• Informations et actions sur les mesures de distanciation sociale : la balance bénéfice-risque des confinement ne parait pas en leur faveur d’après les études scientifiques publiées. Les confinements affectent fortement la santé de la population avec les incertitudes qui s’ensuivent – Nous soutenons l’action de Me Virginie Araujo-Recchia.\n\nL’association a été créée par des citoyens, artisans, entrepreneurs, paysans, avocats, ouvriers, scientifiques, médecins, professeurs… des gens de bonne volonté et de bon sens afin d’agir et faire face aux défis sanitaires et écologiques que le monde va affronter dans les prochaines décennies. Cette association a pour vocation de fédérer ces acteurs de la société autour d’actions centrées sur la santé.\n\nLe statut de membres fondateurs ne donne pas de droits mais des devoirs.\n\n« Le bon sens est la chose du monde la mieux partagée car ce n’est pas assez d’avoir l’esprit bon, mais le principal est de l’appliquer bien. Les plus grandes âmes sont capables des plus grands vices aussi bien que des plus grandes vertus; et ceux qui ne marchent que fort lentement peuvent avancer bien davantage, s’ils suivent toujours le droit chemin, que ne font ceux qui courent et qui s’en éloignent.»\n\nNotre mission est de participer activement et durablement pour les générations actuelles et futures: Au maintien, A la promotion, A la transmission des voix de bon sens des acteurs conscients de cet héritage culturel sur la base d’un constat sans appel qui met en exergue les éléments suivants :\n• Méconnaissance répandue de la diversité et de la richesse de nos connaissances.\n• Appauvrissement de notre recherche et raréfaction du choix\n• Drame humain : Des millions de français non soignés pendant la crise de la Covid19 du fait de décisions en décalage et de nombreux conflits d’intérêts\n• Drame social : accès devenu inéquitable, qui entraine anxiété, désespoir et suicides.\n• Drame économique : silence coupable des procédures de licenciements résultant de la Covid19\n• Éclairer les évènements par le bon sens pour aider aux choix des décisions et à leur respect\n• Sauvegarder notre diversité socio-culturelle et notre capacité d’innover et de développer\n• Assurer l’indépendance et la transparence des décisions\n• Garantir une santé de base meilleure pour la population\n• Garantir la priorité absolue d’assurer sécurité, santé, et intérêt des citoyens", "opengraph": {"locale": "fr_FR", "type": "article", "title": "Actualités BonSens N° 2021-22 du 31 mai 2021 - BonSens.org", "description": "Actualités BonSens N° 2021-22 du 31 mai 2021 - BonSens.org", "url": "https://bonsens.info/actualites-bonsens-n-2021-22-du-31-mai-2021/", "site_name": "BonSens.org", "article:published_time": "2021-06-01T17:31:07+00:00", "article:modified_time": "2021-06-01T18:27:10+00:00", "image": "https://bonsens.info/wp-content/uploads/2021/01/communique-presse-rose-1.jpg", "image:width": "1920", "image:height": "1080", "image:type": "image/jpeg"}, "tags": ["Communiqué de Presse"], "tweets": [], "movies": [], "links": ["https://medicine.wustl.edu/news/good-news-mild-covid-19-induces-lasting-antibody-protection", "https://www.nature.com/articles/s41586-021-03647-4", "https://www.infowars.com/posts/huge-new-study-concludes-masks-did-not-slow-covid-spread-in-us/", "https://www.medrxiv.org/content/10.1101/2021.05.18.21257385v1", "•%09https:/www.ema.europa.eu/en/documents/rmp-summary/comirnaty-epar-risk-management-plan_en.pdf", "https://www.who.int/biologicals/publications/trs/areas/vaccines/nonclinical_evaluation/ANNEX%201Nonclinical.P31-63.pdf?ua=1", "https://www.mirror.co.uk/3am/celebrity-news/breaking-lisa-shaw-dead-bbc-24200435", "https://www.linternaute.com/actualite/guide-vie-quotidienne/2542344-vaccination-des-enfants-contre-le-covid-l-ema-autorise-le-vaccin-pfizer-pour-les-12-15ans/", "https://www.aimsib.org/2021/05/24/lettre-dinfos-fin-mai-2021/", "https://academic.oup.com/cid/advance-article/doi/10.1093/cid/ciab465/6279075", "https://files.catbox.moe/k2miut.pdf", "https://takshakpost.com/2021/05/28/indian-bar-association-serves-legal-notice-upon-dr-soumya-swaminathan-the-chief-scientist-who/", "https://www.francesoir.fr/societe-sante/litteralement-criminel-pierre-kory-accuse-la-suppression-des-donnees-sur-livermectine", "https://c19fluvoxamine.com/", "https://www.francesoir.fr/videos-le-defi-de-la-verite/loic-herve", "https://francais.rt.com/france/87271-conseil-constitutionnel-valide-utilisation-pass-sanitaire-grands-rassemblements", "https://www.cnetfrance.fr/news/pass-sanitaire-saisi-par-des-deputes-le-conseil-constitutionnel-approuve-le-projet-de-loi-39923721.htm", "https://www.francesoir.fr/politique-france/lacademie-de-medecine-preconise-la-vaccination-obligatoire", "https://francais.rt.com/france/87250-pour-professeur-alain-fisher-vaccination-obligatoire-pas-vraiment-priorite-covid-19", "https://twitter.com/boutaour/status/1399089517567610882?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1399089517567610882%7Ctwgr%5E%7Ctwcon%5Es1_c10&ref_url=https%3A%2F%2Ffrancais.rt.com%2Ffrance%2F87250-pour-professeur-alain-fisher-vaccination-obligatoire-pas-vraiment-priorite-covid-19", "https://www.businesstravel.fr/israel-suspension-du-passeport-vert-le-1er-juin.html", "https://www.huffingtonpost.fr/entry/israel-leve-la-quasi-totalite-de-ses-restrictions-covid-pour-les-non-vaccines_fr_60b6052be4b0c5658f98425f", "https://www.reuters.com/world/uk/uk-vaccine-passport-plans-be-scrapped-telegraph-2021-05-30/", "https://m.huffingtonpost.fr/amp/entry/application-stopcovid-la-justice-enquete-sur-des-soupcons-de-favoritisme_fr_60a79ba3e4b019ef10d9449a/?__", "https://www.francesoir.fr/videos-le-defi-de-la-verite/pr-luc-montagnier-au-defi-de-la-verite", "https://www.francesoir.fr/videos-lentretien-essentiel/marie-estelle-dupont-lentretien-essentiel", "https://www.francesoir.fr/videos-le-defi-de-la-verite/alain-houpert", "https://www.francesoir.fr/videos-les-debriefings/jean-robin-journaliste-enquete-sous-les-manipulations-du-parti-communiste", "https://www.francesoir.fr/videos-les-debriefings/steve-kirsch", "https://www.francesoir.fr/opinions-tribunes/directives-therapeutiques-oms-nih", "https://www.francesoir.fr/societe-sante/lobscure-transparence-de-lansm", "https://bonsens.info/plaintes-collectives/", "https://www.francesoir.fr/assignation-en-refere-devant-le-president-du-tribunal-judiciaire-de-paris", "https://www.francesoir.fr/opinions-entretiens/interview-me-virginie-de-araujo-recchia-avocate-au-barreau-de-paris", "https://www.francesoir.fr/assignation-en-refere-devant-le-president-du-tribunal-judiciaire-de-paris", "https://bonsens.info/racontez-nous-votre-experience-covid-19-symptomatique/", "https://www.francesoir.fr/societe-sante/debriefing-avec-me-protat-suite-ordonnance-conseil-detat", "https://solidarites-sante.gouv.fr/IMG/pdf/fiche_-_le_recueil_du_consentement.pdf", "https://www.fortunejournals.com/articles/shunt-due-to-hydroxychloroquine-sublethal-dosage-resulted-in-excess-transfer-to-mechanical-ventilation-and-death-in-hospitalized-p.pdf", "https://www.francesoir.fr/opinions-editos/le-temps-de-la-science", "http://www.bonsens.org", "mailto:contact@bonsens.org"], "authors": ["XadminBonSens02"], "publish_date": "2021-06-01T17:31:07+00:00"}