{"result_id": "053020", "URL": "https://bonsens.info/choix-vaccinal-pour-lenfant-de-parents-separes/", "timestamp": "2023-04-25 12:21:43 CEST+0200", "meta": {"description": "", "lang": "fr", "keywords": "", "favicon": "https://bonsens.info/wp-content/uploads/2020/10/bon-sens-BAT-v2-carree-pm.png", "canonical": "https://bonsens.info/choix-vaccinal-pour-lenfant-de-parents-separes/", "encoding": "UTF-8"}, "image": null, "domain": "bonsens.info", "title": "Choix vaccinal pour l'enfant de parents séparés/divorcés", "cleaned_text": "PARENTS SÉPARÉS OU DIVORCÉS, VOUS POUVEZ VOUS OPPOSER À LA DÉCISION DE VACCINATION DE VOTRE ENFANT PAR VOTRE EX-CONJOINT\n\nL’autorité parentale “appartient aux parents jusqu’à la majorité ou l’émancipation de l’enfant pour le protéger dans sa sécurité, sa santé” (art. 371-1 du Code civil) et “les père et mère exercent en commun l’autorité parentale” (art. 372 du Code civil).\n\n\n\nPar conséquent, le parent qui n’est pas avec l’enfant peut\n• None demander conseil à un avocat pour contester, en l’espèce, l’exercice de l’autorité parentale devant le juge aux affaires familiales et\n• None obtenir un référé pour empêcher la décision unilatérale de vaccination de l’enfant par l’autre parent.\n\nL’argument à invoquer est le suivant : si l’autorisation d’un seul représentant légal suffit au sens où il n’est pas nécessaire que les deux autorisations soient constatées administrativement, cela ne règle pas la question de savoir sur quel fondement juridique la volonté de l’un des parents devrait l’emporter sur la volonté de l’autre en cas de désaccord entre eux.\n\nAutrement dit, la loi opère une simplification administrative, mais ne dit pas que la volonté d’un des parents doit l’emporter sur l’autre.", "opengraph": {"locale": "fr_FR", "type": "article", "title": "Choix vaccinal pour l'enfant de parents séparés/divorcés - BonSens.org", "description": "PARENTS SÉPARÉS OU DIVORCÉS, VOUS POUVEZ VOUS OPPOSER À LA DÉCISION DE VACCINATION DE VOTRE ENFANT PAR VOTRE EX-CONJOINT L'autorité parentale \"appartient aux parents jusqu'à la majorité ou l'émancipation de l'enfant pour le protéger dans sa sécurité, sa santé\" (art. 371-1 du Code civil) et \"les père et mère exercent en commun l'autorité parentale\" (art. […]", "url": "https://bonsens.info/choix-vaccinal-pour-lenfant-de-parents-separes/", "site_name": "BonSens.org", "article:published_time": "2021-08-06T14:07:56+00:00", "article:modified_time": "2021-08-06T14:53:08+00:00", "image": "https://bonsens.info/wp-content/uploads/2021/07/note-2762271_1920.png", "image:width": "1920", "image:height": "782", "image:type": "image/png"}, "tags": ["Communiqué de Presse"], "tweets": [], "movies": [], "links": [], "authors": ["XadminBonSens02"], "publish_date": "2021-08-06T14:07:56+00:00"}