{"result_id": "053056", "URL": "https://translate.google.com/translate?hl=en&sl=fr&u=https://bonsens.info/actualites-bonsens-n-2021-19-du-10-mai-2021/&prev=search&pto=aue", "timestamp": "2023-04-25 12:22:26 CEST+0200", "meta": {"description": "Actualités BonSens N° 2021-19 du 10 mai 2021 - BonSens.org", "lang": "fr", "keywords": "", "favicon": "https://bonsens.info/wp-content/uploads/2020/10/bon-sens-BAT-v2-carree-pm.png", "canonical": "https://bonsens.info/actualites-bonsens-n-2021-19-du-10-mai-2021/", "encoding": "UTF-8"}, "image": null, "domain": "translate.google.com", "title": "Actualités BonSens N° 2021-19 du 10 mai 2021", "cleaned_text": "INFO CLÉS : LES ÉLÉMENTS IMPORTANTS DE CETTE SEMAINE\n• \n• 57 scientifiques et médecins demandent l’arrêt immédiat de toutes les “vaccinations” Covid-19\n• La vaccination avec 2 types de vaccins différents (Astrazeneca puis Pfizer ou Moderna) se fait hors AMM et donc le médecin serait 100% responsable. Me Di Vizio a donné une interview à France Info sur le problème de la responsabilité et a été censuré.\n• Des médecins US de America Frontline Doctors soulèvent des inquiétudes concernant l’excrétion potentielle de protéine Spike par les personnes vaccinées et le danger que cela pourrait représenter pour leurs contacts proches non vaccinés. Nous cherchons des d’experts pour réfléchir à ce problème complexe, ce type de vaccin n’ayant jamais été utilisé auparavant sur des personnes en bonne santé.\n• La protéine Spike joue un rôle additionnel dans la maladie: les chercheurs du prestigieux Salk Institute, fondé par le pionnier du vaccin Jonas Salk, développeur du premier vaccin antipoliomyélitique, démontrent dans une publication importante comment la protéine endommage les cellules, confirmant que le Covid-19 est une maladie principalement vasculaire. Ceci soulève un problème majeur car les vaccins Astrazeneca, Johnson&Johnson , Pfizer et Moderna ont pour principe de faire fabriquer par notre corps la protéine de pointe (Spike) du SARS-CoV-2.\n• \n• L’administration Biden s’est déclarée mercredi en faveur de la suspension temporaire des protections de propriété intellectuelle pour les vaccins contre le coronavirus. Cette proposition de suspension des brevets pour les vaccins est une mesure pas si extraordinaire que ça\n• Le Dr Christian Vélot, généticien moléculaire de l’Université de Paris-Saclay et Président du Conseil Scientifique du CRIIGEN a mis en place une site web pour éclairer les gens sur leur choix vaccinal. Ce site a une vocation pédagogique sur la connaissance de la vaccination Covid-19 : https://vitemadose.fr/\n• \n• Le discours de l’Europe qui d’une part met fin aux importations du vaccin AstraZeneca et d’autre part la France qui continue à recommander la vaccination AstraZeneca nous semble incohérent.\n• \n• Pfizer a demandé l’autorisation pour vacciner les 12-15 ans. Après le Canada, la FDA des États-Unis vient déjà d’étendre l’autorisation d’utilisation d’urgence du « vaccin » Pfizer aux 12-15 ans.\n• Nous rappelons que les enfants ne peuvent pas avoir de bénéfice personnel à se faire vacciner vu les risques infimes que leur fait courir le virus. Par contre nous ne connaissons pas tous les risques avec ces vaccins et notamment les risques à moyen et long terme et les risques de génotoxicité.\n• \n• Dans l’état du Goa en Inde, le ministre de la Santé a annoncé que le traitement prophylactique avec ivermectine serait disponible pour toutes personnes de plus de 18 ans.\n• De plus en plus d’essais dans le monde, prouvent l’efficacité de l’Ivermectine. En Turquie, un essai clinique randomisé montre à nouveau la réduction de la mortalité due au Covid19 sur des patients sévères lors de l’ajout d’ivermectine dans leur protocole de référence (à base d’hydroxychloroquine, azithromycine et favipiravir.)\n• \n• Covid : un maire azuréen, médecin de profession, dit avoir trouvé le traitement et écrit à Emmanuel Macron. « Notre retour d’expérience nous montre un traitement à base de corticoïdes ou d’anticoagulants dès le 2ème ou 3ème jour. C’est pour éviter l’évolution dramatique de la maladie. J’ai testé ce traitement sur 200 patients, résultat : zéro décés. Mes confrères ont le même résultat.»\n• \n• Le pass sanitaire a reçu une explication complète par le gouvernement.\n• Comment fonctionne le pass sanitaire ?\n• Il permettra de vérifier le statut vaccinal, le résultat d’un test négatif ou le certificat de rétablissement d’une personne, lui permettant par exemple l’accès à un rassemblement ou un événement de plus de 1 000 personnes.\n• Le pass sanitaire centralisera plusieurs documents relatifs à la Covid-19 :\n• Les fiches de résultats de tests négatifs ;\n• Le certificat de rétablissement de la Covid-19 (notion qui aurait besoin d’être explicitée) ;\n• Nous vous rappelons la position de l’Assemblée Parlementaire du Conseil de l’Europe qui considère à une très large majorité que la vaccination doit être un acte éclairé, volontaire, exempt de pressions sociales ou politiques, fait en fonction du bénéfice personnel que l’on peut en tirer et qui ne doit pas conditionner telle ou telle activité.\n• Les sondages se multiplient sur le Pass sanitaire et le Passeport vaccinal. La grande consultation du CESE avait révélé que près de 73% des français étaient défavorables ou très défavorables sur le sujet du passeport vaccinal\n• \n• De même sur le sujet du Pass Sanitaire, un sondage en ligne du Figaro montre que 55% des presque 190 000 votants sont contre l’idée de ce Pass. Ce qui n’empêche pas les médias mainstream de communiquer sur des chiffres plus favorables à ce Pass via d’autres sondages.\n• \n• Aux USA de plus en plus d’États s’opposent au pass vaccinal – (Texas, Floride, Idaho, Utah, et Montana), l’Arizona devient le sixième État à interdire les passeports vaccinaux).\n• \n• Partout dans le monde, depuis presque un an, des réunions, manifestations, fêtes réunissant des milliers de personnes ont été décriées par les “enfermistes” qui promettaient l’apocalypse. Rien ne s’est jamais passé. Pourquoi continuer à les écouter ?\n• Les courbes comparant les États américains les plus contraignants au niveau des mesures sociales aux États américains les moins contraignants montrent qu’il n’y a aucun différence sur les hospitalisations pour Covid. Ce qui est en accord avec la majorité des publications scientifiques sur ce sujet.\n• \n• L’AFP a été épinglée une nouvelle fois pour publications d’informations inexactes sur le sujet des vaccins\n• La Chine se préparait à une 3ème guerre mondiale Bactériologique\n• Pour rappel, le Professeur Fourtillan est toujours incarcéré\n• Nous vous rappelons les nouveaux livres de Guy Courtois qui après « Et Si Didier Raoult avait raison » publie une série de 14 livres avec des préfaces de Christian Perronne, Jean-François Lesgards, Nicole Délepine, Martine Wonner, et bien d’autres. 22 livres de la série Covid-19 sur 24 sont déjà sortis. Écrits par Guy Courtois et publiés par Investigation Editions, ils reprennent chaque aspect de la crise. Ils sont disponibles sur Amazon https://www.amazon.fr/s?k=guy+courtois&ref=nb_sb_noss\n• A Lyon, une manifestation avec Alexandra Henrion-Caude et Jean-Marie Bigard est prévue le 15 mai 2021 avec le soutien de BonSens\n\nLES ACTIONS MENÉES DE LA SEMAINE\n• None vole au secours de la politique du gouvernement sur la vaccination avec Me Teissedre, Protat et de Lagarde –\n• None Debriefing de l’avocat de Me Grazzini au sujet de la plainte de l’IHU Marseille\n\nNous avons mandaté l’avocat Me Teissedre pour 2 nouvelles procédures BonSens : 1 / Intervention au recours devant le conseil d’Etat au sujet du Rivotril à la 10 ème chambre sur le fond n°446888 (contre les décrets des 14 octobre 2020, 29 octobre 2020 et 2 novembre 2020), 2/ Saisine au Tribunal Administratif de Montreuil pour obtenir de l’ANSM les documents concernant les essais cliniques sur l’hydroxychloroquine. La commission d’accès aux documents administratifs avait émis fin mars 2021un avis favorable à la communication par l’ANSM des documents relatifs aux essais cliniques de l’hydroxychloroquine notamment sur tous les documents liés aux causes d’arrêt y compris les échanges avec les autorités, HCSP et membres du gouvernement. Mais l’ANSM n’a rien envoyé dans le délai d’un mois imparti\n• \n• Ivermectine : Après la décision de l’EMA de déconseiller l’ivermectine, et comme attendu, l’ANSM et l’OMS ont suivi cette recommandation fort surprenante. BonSens avec Me Teissedre a décidé de ne pas lâcher l’affaire et de s’allier avec d’autres associations dans cette démarche. Rappelons qu’une fraude à la science existe preuves à l’appui. Me Teissedre pousse avec les instances judiciaires.\n• Nous continuons à faire les demandes CADA et ANSM pour s’assurer du traitement égalitaire des diverses ATU pour les traitements.\n• Me Virginie Arujau a mis au point une procédure d’action collective pour mettre fin aux nombreuses mesures liberticides prises en France depuis mars 2020, en groupement avec divers avocats internationaux. BonSens a décidé d’apporter son soutien à cette action qui parait importante étant donné les mesures liberticides que nous subissons. Les documents sont en ligne pour les télécharger.\n• Enquête sur les parcours de Covid19 symptomatique : Cette enquête a pour but d’informer les soignants et les futurs malades des traitements dispensés par des médecins traitants qui ont guéri les patients symptomatiques du COVID19 : https://bonsens.info/racontez-nous-votre-experience-covid-19-symptomatique/\n• \n• BonSens a lancé avec Me Jean-Pierre Joseph une série de plaintes collectives contre l’Ordre des Médecins: https://bonsens.info/plaintes-collectives/\n• \n• Me Protat a fait une requête au Conseil d’Etat car son client de 83 ans vacciné n’avait pas récupéré sa liberté – BonSens, Christian Perronne et Xavier Azalbert ont fait une intervention volontaire, audiencé le 4 mai 2021\n• Etude d’un recours sur le consentement éclairé en cours sur la base de « l’information délivrée » notamment sur la publicité.\n• Recours sur le fond devant le conseil d’état sur la contestation de l’impunité garantie aux vaccins, l’état d’urgence sanitaire, le Rivotril et son impunité garantie, les mesures portant atteinte à la liberté individuelle sous le contrôle du juge administratif au lieu du juge civil. Appuyée par question prioritaire de constitutionnalité. La question prioritaire de constitutionalité a été regrettablement rejetée début février en esquivant les points de fond. L’affaire continue. Des éléments à charge ont été rajoutés suite à la forte hausse du taux de mortalité dans les EHPADs. Les statistiques de mortalité dans les EHPADs suite à la vaccination pourrait montrer qu’il n’y a pas d’effet protecteur contre la maladie. Le vrai problème est l’obtention et l’accès aux données pour enquêter plus en détail sur ce sujet.\n• Lettre à la CNAM sur le traitement de prospection vaccin Covid pour faire respecter le droit d’opposition « pour ne pas être sollicité pour se faire vacciner». La réponse obtenue est inacceptable car c’est un copié collé du texte du décret qui n’est pas pertinent. En l’occurrence, ils expliquent que le droit d’opposition sera à faire valoir qu’une fois inscrit dans la base de donnée. Cela ne respecte pas le droit à la limitation. A l’instant présent, les informations sur les individus sont donc accessibles par n’importe quel médecin via une recherche par numéro de sécurité sociale. Sur la limitation, une nouvelle demande a été faite auprès de la CPAM du 78. Le délai d’un mois étant écoulé une action en justice ou à la CNIL peut-être effectuée pour le respect des droits individuels\n• \n• Remdesivir et Union Européenne: action déposée sur la responsabilité des diverses instances sur le Remdesivir y compris sur les conséquences économiques pour la France et le rôle des différentes parties dans le support à la décision et dans la prise en considération des données cliniques disponibles au moment de la décision. Deux actions ont été faites à ce sujet dont une par Réaction 19 et l’autre Me Di Vizio. Ce médicament a fait l’objet d’une nouvelle demande d’extension de l’AMM. Ce qui est surprenant étant donné les effets secondaires et mutagènes du médicament.\n• \n• Une nouvelle analyse des dispositions prises par l’OMS et l’ANSM est en cours y compris de l’étude Recovery ou le surdosage en HCQ a entrainé des décès par overdose. Une dernière publication est parue dans Archive of Microbiology & Immunology. Nous sommes très heureux car des membres de BonSens font partie des auteurs de cette étude et que l’association a soutenu sa publication. Cette publication remet en cause de manière définitive le surdosage en hydroxychloroquine utilisé dans l’étude Recovery. Ce surdosage crée un shunt pulmonaire qui pourrait « mimer un Covid-19 » ou une aggravation Covid-19 ce qui expliquerait les nombreux passages en réanimation et la surmortalité.\n• Mise en demeure des agences sanitaires, des sociétés savantes et de la direction de publication des médias mainstream pour tenir compte des nouvelles informations (lettre du NEJM et Meta analyse récemment publiée) qui avalisent le surdosage de l’étude Recovery et par conséquence invalident non seulement cette étude mais également les méta-analyses qui incluent cette étude, comme la méta analyse Fiolet et al. qui a fait l’objet de plus de 30 communications dans les médias mainstream. La méta analyse Fiolet et al. ainsi que l’étude Recovery ont influencé les stratégies des autorités sanitaires qui doivent donc être revues.\n• Demande à la CADA : Le Compte Rendu de la réunion du 19 décembre du Conseil Scientifique a été publié le 25 février, cependant il manque encore les enregistrements vidéo et les calculs pour d’autres avis.\n• Demande CADA : Les comptes rendus les enregistrements sur les débats concernant les autorisations relatives aux vaccins et sur les points de pharmacovigilance (à l’ANSM et/ou HAS)\n• Demande CADA : Les comptes rendus les enregistrements sur les réunions octroyant une ATU de cohorte du Remdesivir et Bamlanivimab (à l’ANSM )\n• L’objectif recherché est d’obtenir des autorités l’autorisation de divers traitements précoces en respect du droit fondamental de l’accès aux soins des citoyens comme beaucoup de pays qui utilisent ces médicaments en prophylactique et en curatif. Les actions menées sont :\n• Actions d’information et pression citoyenne (le procès du médiator dont les résultats ont été connus ce jour est là pour nous rappeler l’importance d’une lanceuse d’alerte et de la pression du collectif citoyen).\n• Actions juridiques sur les traitements précoces (ivermectine et autres traitements) en France et en association avec des médecins et d’autres groupes étrangers\n• Sensibilisation des adhérents et de la population au fait que le bénéfice-risque des traitements précoces est en faveur de ces traitements.\n• Nous prenons à tous moments la balance bénéfice-risque entre les divers piliers de réponse à une épidémie en accord avec le Comité Scientifique Indépendant\n• Informations et actions sur les mesures de distanciation sociale : la balance bénéfice-risque des confinement ne parait pas en leur faveur d’après les études scientifiques publiées. Les confinements affectent fortement la santé de la population avec les incertitudes qui s’ensuivent – Nous soutenons l’action de Me Virginie Araujo-Recchia.\n\nA ce jour nous sommes près de 24 500 personnes à s’être retrouvées dans BonSens.org depuis le lancement il y a quelques mois. Retrouvez toutes les actions et actualités sur le site BonSens.org ainsi que sur le Facebook @BonSensAssociation et sur twitter @BonSensOrg. Merci beaucoup d’éviter de nous envoyer des emails à ce sujet, nous ne pourrons pas y répondre car nous avons chaque jour de très nombreux messages à traiter.\n\nComme vous le savez, notre association BonSens.org n’a eu son numéro d’agrément qu’au mois de mars. Depuis nous faisons l’impossible avec le service des impôts pour pouvoir faire bénéficier à nos adhérents d’une ristourne fiscale. Cela ne sera peut-être pas possible. Conscients que certains d’entre vous ont fait des dons dans l’espoir de celle-ci, nous nous engageons à vous rembourser la partie fiscale. Merci de nous écrire par e-mail à l’adresse contact@bonsens.org pour faire votre demande.\n\nL’association a été créée par des citoyens, artisans, entrepreneurs, paysans, avocats, ouvriers, scientifiques, médecins, professeurs… des gens de bonne volonté et de bon sens afin d’agir et faire face aux défis sanitaires et écologiques que le monde va affronter dans les prochaines décennies. Cette association a pour vocation de fédérer ces acteurs de la société autour d’actions centrées sur la santé.\n\nLe statut de membres fondateurs ne donne pas de droits mais des devoirs.\n\n« Le bon sens est la chose du monde la mieux partagée car ce n’est pas assez d’avoir l’esprit bon, mais le principal est de l’appliquer bien. Les plus grandes âmes sont capables des plus grands vices aussi bien que des plus grandes vertus; et ceux qui ne marchent que fort lentement peuvent avancer bien davantage, s’ils suivent toujours le droit chemin, que ne font ceux qui courent et qui s’en éloignent.»\n\nNotre mission est de participer activement et durablement pour les générations actuelles et futures: Au maintien, A la promotion, A la transmission des voix de bon sens des acteurs conscients de cet héritage culturel sur la base d’un constat sans appel qui met en exergue les éléments suivants :\n• Méconnaissance répandue de la diversité et de la richesse de nos connaissances.\n• Appauvrissement de notre recherche et raréfaction du choix\n• Drame humain : Des millions de français non soignés pendant la crise de la Covid19 du fait de décisions en décalage et de nombreux conflits d’intérêts\n• Drame social : accès devenu inéquitable, qui entraine anxiété, désespoir et suicides.\n• Drame économique : silence coupable des procédures de licenciements résultant de la Covid19\n• Éclairer les évènements par le bon sens pour aider aux choix des décisions et à leur respect\n• Sauvegarder notre diversité socio-culturelle et notre capacité d’innover et de développer\n• Assurer l’indépendance et la transparence des décisions\n• Garantir une santé de base meilleure pour la population\n• Garantir la priorité absolue d’assurer sécurité, santé, et intérêt des citoyens", "opengraph": {"locale": "fr_FR", "type": "article", "title": "Actualités BonSens N° 2021-19 du 10 mai 2021 - BonSens.org", "description": "Actualités BonSens N° 2021-19 du 10 mai 2021 - BonSens.org", "url": "https://bonsens.info/actualites-bonsens-n-2021-19-du-10-mai-2021/", "site_name": "BonSens.org", "article:published_time": "2021-05-11T12:56:40+00:00", "article:modified_time": "2021-05-12T13:36:04+00:00", "image": "https://bonsens.info/wp-content/uploads/2021/01/communique-presse-mauve.jpg", "image:width": "1920", "image:height": "1080", "image:type": "image/jpeg"}, "tags": ["Communiqué de Presse"], "tweets": [], "movies": [], "links": ["mailto:vaccins@bonsens.org?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.francesoir.fr/societe-sante/57-scientifiques-et-medecins-demandent-larret-immediat-de-toutes-les-vaccinations", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.francesoir.fr/societe-sante/la-proteine-de-pointe-du-nouveau-coronavirus-joue-un-role-cle", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.francesoir.fr/societe-sante/la-suspension-des-brevets-sur-les-vaccins-une-mesure-pas-si-extraordinaire-que-ca", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://vitemadose.fr/", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.huffingtonpost.fr/entry/coronavirus-les-etats-unis-vont-vacciner-des-12-ans-avec-le-pfizerbiontech_fr_609a3a33e4b063dccea09499?ncid%3Dtweetlnkfrhpmg00000001", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://trialsitenews.com/small-randomized-clinical-trial-in-turkey-results-reveals-ivermectin-added-to-local-reference-treatment-reduced-mortality-rate-in-severe-covid-cases/", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.francebleu.fr/emissions/le-temoin-de-l-actu/azur/le-temoin-de-l-actu-282", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.gouvernement.fr/pass-sanitaire-toutes-les-reponses-a-vos-questions", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.lefigaro.fr/actualite-france/covid-19-etes-vous-favorable-a-l-instauration-d-un-pass-sanitaire-pour-acceder-aux-salons-et-grands-evenements-sportifs-et-culturels-20210510", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=http://echelledejacob.blogspot.com/2021/04/larizona-devient-le-sixieme-etat.html", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.francesoir.fr/opinions-tribunes/lafp-epinglee-une-nouvelle-fois-pour-publication-dinformations-inexactes-sur-le", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.francesoir.fr/politique-monde/la-chine-se-preparait-une-3eme-guerre-mondiale-avec-des-armes-biologiques-depuis-6", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.amazon.fr/s?k%3Dguy%2Bcourtois%26__mk_fr_FR%3D%25C3%2585M%25C3%2585%25C5%25BD%25C3%2595%25C3%2591%26ref%3Dnb_sb_noss_2", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.amazon.fr/s?k%3Dguy%2Bcourtois%26ref%3Dnb_sb_noss", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.francesoir.fr/videos-les-debriefings/le-conseil-detat-la-rescousse-de-la-politique-liberticide-du-gouvernement", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.francesoir.fr/videos-les-debriefings/me-protat-et-me-teissedre-pass-vaccinal-et-rupture-degalite", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.francesoir.fr/videos-les-debriefings/le-point-de-vue-direne-grosjean-naturopathe-medecine-de-sante-ou-medecine-de", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.francesoir.fr/videos-le-defi-de-la-verite/me-brice-grazzini-avocat-de-didier-raoult-au-defi-de-la-verite", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.francesoir.fr/societe-sante/lihu-contre-attaque-et-porte-plainte-pour-harcelement-et-extorsion-de-fonds", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.francesoir.fr/assignation-en-refere-devant-le-president-du-tribunal-judiciaire-de-paris", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.francesoir.fr/opinions-entretiens/interview-me-virginie-de-araujo-recchia-avocate-au-barreau-de-paris", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.francesoir.fr/assignation-en-refere-devant-le-president-du-tribunal-judiciaire-de-paris", "https://bonsens-info.translate.goog/racontez-nous-votre-experience-covid-19-symptomatique/?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc", "https://bonsens-info.translate.goog/plaintes-collectives/?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.francesoir.fr/societe-sante/debriefing-avec-me-protat-suite-ordonnance-conseil-detat", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://solidarites-sante.gouv.fr/IMG/pdf/fiche_-_le_recueil_du_consentement.pdf", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.fortunejournals.com/articles/shunt-due-to-hydroxychloroquine-sublethal-dosage-resulted-in-excess-transfer-to-mechanical-ventilation-and-death-in-hospitalized-p.pdf", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.francesoir.fr/opinions-editos/le-temps-de-la-science", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.facebook.com/BonSensAssociation", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://twitter.com/BonsensOrg", "mailto:contact@bonsens.org?_x_tr_sl=fr&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=sc"], "authors": ["XadminBonSens02"], "publish_date": "2021-05-11T12:56:40+00:00"}