{"result_id": "053028", "URL": "https://translate.google.com/translate?hl=en&sl=fr&u=https://bonsens.info/information-demande-de-creation-dune-commission-denquete-senatoriale-sur-les-effets-secondaires-des-vaccins-contre-le-covid-19-par-le-dr-devilleger/&prev=search&pto=aue", "timestamp": "2023-04-25 12:21:48 CEST+0200", "meta": {"description": "", "lang": "fr", "keywords": "", "favicon": "https://bonsens.info/wp-content/uploads/2020/10/bon-sens-BAT-v2-carree-pm.png", "canonical": "https://bonsens.info/information-demande-de-creation-dune-commission-denquete-senatoriale-sur-les-effets-secondaires-des-vaccins-contre-le-covid-19-par-le-dr-devilleger/", "encoding": "UTF-8"}, "image": null, "domain": "translate.google.com", "title": "IMPORTANT: Demande de création d’une commission d'enquête sénatoriale sur les effets secondaires des vaccins contre le Covid-19 par le Dr DEVILLEGER", "cleaned_text": "PÉTITION DEMANDANT LA CRÉATION D’UNE COMMISSION D’ENQUÊTE SÉNATORIALE SUR LES EFFETS SECONDAIRES DES VACCINS CONTRE LE COVID-19\n\nL’épidémie due au covid-19 a provoqué au courant de l’année 2020 une situation considérée comme une urgence sanitaire majeure. Devant ce coronavirus inconnu, dont la première forme a été déclarée à Wuhan en 2019, les gouvernements se sont retrouvés face à une situation complexe.\n\nLa France a décidé d’appliquer des mesures plus sécuritaires que sanitaires, qui ont affecté une grande partie de nos citoyens : mesures barrières, confinement, couvre-feu, et masques y compris chez les enfants encore aujourd’hui, etc.\n\nPuis, le Gouvernement a choisi d’appliquer une stratégie uniquement « vaccinale » s’appuyant sur des injections de médicaments préventifs géniques expérimentaux, promettant des effets rapides. Une stratégie du « tout vaccinal » s’est alors mise en place, réponse unique aux vagues successives de cas positifs, en interdisant les traitements précoces (pour des raisons qu’il restera à évaluer lors d’autres commissions d’enquête), pourtant utilisés avec succès dans de nombreux pays comme en Inde.\n\nCes « vaccins » ne reposent pas, dans leur conception et dans leur action, sur des méthodes traditionnelles d’élaboration des vaccins selon Pasteur. Ces médicaments préventifs géniques expérimentaux utilisent de nouvelles technologies, pour la majorité à ARN messager et ADN recombinés, jamais utilisées chez l’homme pour lutter contre une infection.\n\nLeur autorisation de mise sur le marché (AMM) a été donnée dans le cadre d’une procédure d’urgence, après étude accélérée de phase I et II dont les conditions d’exécution n’ont pas été transparentes. La phase III est toujours en cours, les premiers résultats sont attendus pour 2023 : il s’agit de substances expérimentales dont les effets bénéfiques, s’ils existent, semblent de très courte durée et dont les effets indésirables à long et moyen terme sont inconnus et, pour certains, inquiétants (modification du génome et de l’épigénétique ?).\n\nDu fait de son ampleur même, cette campagne « vaccinale », réalisée en pleine épidémie et à un rythme très soutenu, devrait être suivie d’une campagne de surveillance et de gestion du risque, similaire aux procédés habituels de surveillance et d’évaluation des risques en population générale.\n\nL’incertitude de sécurité de ces nouveaux « vaccins » utilisés en France s’est confirmée par le suivi des stratégies vaccinales mises en œuvre tant sur notre territoire, que sur celui des pays européens voisins.\n\nLe vaccin Astrazeneca, d’abord proposé sans contre-indication particulière à l’ensemble de notre population, a été remis en cause du fait de nombreux cas de thromboses dans de nombreux pays européens, constatant une balance bénéfice de la « vaccination » et risque du covid, au moins incertaine, si ce n’est négative. Puis, un avis de la Haute Autorité de Santé du 9 juillet a demandé de vacciner par les autres vaccins disponibles. La France a d’ailleurs arrêté de commander ce vaccin.\n\nConcernant le « vaccin » Moderna, après avoir été injecté sans restriction particulière concernant les catégories d’âge ou état de santé, il est maintenant remis en question par des pays voisins européens, en particulier scandinaves (Suède, Norvège, Danemark puis Finlande) et le Japon qui l’ont interdit aux hommes de moins de 30 ans.\n\nCes revirements dans les stratégies « vaccinales » confirment l’incertitude qui règne sur les effets secondaires de ces injections.\n\nCette incertitude, illustrée par ces deux revirements, interpelle, car les effets secondaires avérés touchent une population relativement jeune, peu ou pas sujette aux complications du covid, mais risquant de développer un effet grave post-vaccinal.\n\nIl convient de mettre ces deux faits en perspective des effets secondaires déclarés par différents organismes officiels dépendant des Etats.\n\nLe VAERS (Vaccine Adverse Events Reports, base de données des effets secondaires des vaccins aux États-Unis) rapporte plus d’un million d’effets secondaires, dont 21 000 décès confirmés au 27 décembre 21 et 20 560 myocardites. Selon le VAERS, les inoculas contre le covid-19 ont accumulé, en 1 an, plus d’effets secondaires graves que TOUS LES AUTRES VACCINS RÉUNIS EN 34 ANS.\n\nL’agence européenne du médicament (EMA) relève des effets secondaires suspectés d’être associés à cette campagne de vaccination, publiés sur EudraVigilance (base de données de l’EMA, de rapport d’effets indésirables de l’UE hors UK )[1] :\n\nles effets indésirables globaux retenus par EudraVigilance sont publiés pour un total de signalements de 1 327 876 observations, au 1er janvier 2022.\n\nPfizer : 668 442 ; Moderna : 188 082 ; Astra: 428 330 ; Janssen: 43 022.\n\nEt, un total de 36 267 décès susceptibles d’être en rapport avec l’administration de l’injection.\n\n(Pfizer : 16 481 décès ; Moderna : 10 170 décès ; AstraZeneca : 7 371 décès ; Janssen : 2 245 décès).\n\nD’autres chiffres dans le monde interpellent, 50 % des myocardites et des péricardites sont survenues après l’injection de la seconde dose singulièrement chez les moins de 30 ans, (chiffres VAERS confirmés en UE, en UK, en Israël) et touchent d’autant plus les plus jeunes (moins de 20 ans).\n\nEn France, selon les mots de la directrice générale de l’ANSM, elle-même, lors de son audition au Sénat, le 29 décembre 2021, « on le sait, il y a une sous-déclaration en pharmacovigilance ». Malgré tout, elle s’inquiète du taux élevé de déclarations, comparativement aux années précédentes :\n\n« A mi-novembre 2021, nous avons 110 000 déclarations d’effets indésirables pour les 4 vaccins anticovid. Dans une année normale, nous avons 45 000 déclarations tous médicaments confondus ».\n\nLes effets secondaires déclarés à l’ANSM en moins d’un an en France s’élèvent à 121 486 cas dont 24 % graves. Thrombose, myocardite, péricardite, pancréatite aigüe, polyarthrite, troubles du rythme cardiaque, zona et maintenant encéphalites et maladie à prions (dite de la vache folle) sont des complications bien décrites. Plus de 1 100 décès, rien que pour le vaccin Pfizer, sont signalés sur le site de l’ANSM.\n\nOn estime habituellement que 10 % seulement des cas sont déclarés.\n\nCette absence dans le suivi de pharmacovigilance est constatée par nombre de travaux universitaires, soulignant le manque d’informations des soignants, leur temporalité restreinte pour exercer un suivi des patients. Ce déficit de moyens peut entraîner des dérives, comme un fort taux de non-prise en compte d’effets secondaires et l’autocensure des soignants sur les déclarations par méconnaissance du mécanisme compliqué de déclaration en pharmacovigilance.\n\nDe plus, les vaccinodromes n’ont pas assuré le service « après-vente », laissant les personnes en situation de détresse et sans réel recours possible.\n\nL’incertitude sur les effets secondaires de ces vaccins doit être levée\n\nLes effets secondaires des pseudo-vaccins ne sont pas pris en compte dans l’action gouvernementale, le ministre de la Santé s’obstinant à nier les décès, pourtant signalés par l’agence gouvernementale française.\n\nCes déclarations négationnistes sont suivies d’une forte incitation vaccinale de la part du Gouvernement, que ce soit par des discours, mais également par des mesures restrictives de liberté qui ont été votées au sein de l’hémicycle.\n\nLa loi n° 2021-1465 du 10 novembre 2021 prolonge l’obligation vaccinale pour les soignants et soumet les libertés fondamentales au pass sanitaire pour les citoyens à partir de 12 ans et risque d’être aggravée par le vote de la loi en cours d’examen en ce début janvier, transformant le pass sanitaire en vaccinal.\n\nActuellement, les autorités sanitaires poussent à la vaccination des enfants à partir de 5 ans, alors que les enfants de moins de 19 ans risquent moins du covid que de la grippe saisonnière ordinaire (zéro risque du covid chez les enfants sans comorbidités) et que le pseudo-vaccin ne protège pas des contaminations : aucun intérêt individuel, ni collectif, mais des effets indésirables qui pourraient se révéler catastrophiques pour notre pays dans un futur proche.\n\nL’action gouvernementale ne prend pas en compte les effets secondaires déclarés liés aux « vaccins » et poursuit une politique de quasi-obligation vaccinale, sans un système de pharmacovigilance proportionné à ces mesures.\n\nLe rôle du Parlement est de contrôler l’action gouvernementale. Il est aussi de faire le lien entre politiques et citoyens, indispensable à la vie démocratique de notre pays.\n\nDepuis plusieurs mois, ce lien est distendu et une rupture de confiance s’observe entre une partie de la population et le pouvoir. Des manifestations citoyennes d’ampleur et à l’opposé, les mesures attentatoires aux libertés fondamentales du Gouvernement s’accentuent.\n\nL’impératif est d’autant plus grand, au vu de l’échelle de « vaccination », avec pour rappel une troisième dose nécessaire pour la validité du passe sanitaire et bientôt une quatrième et l’élargissement de la vaccination des enfants à partir de 5 ans.\n\nDevant le nombre de décès et d’accidents graves laissant des séquelles à long terme, un moratoire de la « vaccination » est urgent.\n\nAfin d’éviter une catastrophe sanitaire d’ampleur nationale dans les prochaines années, le Sénat se doit, avant de laisser l’exécutif poursuivre sa stratégie d’obligation indirecte de participation à des essais cliniques d’injections géniques, de s’assurer que la pharmacovigilance est suffisante pour détecter des effets secondaires sur court, moyen et long terme.\n\nA ce stade, il n’est pas exclu que le nombre de morts à venir des effets secondaires des « vaccins » soient supérieurs, et de loin, au nombre de morts causés par le covid-19. Souvenons-nous notamment de la Dépakine et du Dengvaxia de SANOFI qui a causé la mort de centaines d’enfants aux Philippines.\n\n[1] Base de données européenne des rapports sur les effets indésirables suspectés des médicaments – Décharge de responsabilité (adrreports.eu)", "opengraph": {"locale": "fr_FR", "type": "article", "title": "IMPORTANT: Demande de création d’une commission d'enquête sénatoriale sur les effets secondaires des vaccins contre le Covid-19 par le Dr DEVILLEGER - BonSens.org", "description": "  Une pétition a été déposée sur le site des pétitions du Sénat, le 7 janvier 2022, par le Docteur J DEVILLEGER, demandant un arrêt immédiat des injections et la constitution d’une commission d’enquête sénatoriale chargée de faire un état des lieux des effets secondaires consécutifs aux injections \"vaccinales\" contre le covid-19, ainsi que du […]", "url": "https://bonsens.info/information-demande-de-creation-dune-commission-denquete-senatoriale-sur-les-effets-secondaires-des-vaccins-contre-le-covid-19-par-le-dr-devilleger/", "site_name": "BonSens.org", "article:published_time": "2022-02-01T14:46:12+00:00", "article:modified_time": "2022-02-01T14:46:14+00:00", "image": "https://bonsens.info/wp-content/uploads/2022/01/injection-1674900.png", "image:width": "1920", "image:height": "1920", "image:type": "image/png"}, "tags": ["Actions judiciaires", "Vidéos Association", "News"], "tweets": [], "movies": [], "links": ["https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.adrreports.eu/fr/disclaimer.html", "https://translate.google.com/website?sl=fr&tl=en&hl=en&prev=search&u=https://www.adrreports.eu/fr/disclaimer.html"], "authors": ["XadminBonSens02"], "publish_date": "2022-02-01T14:46:12+00:00"}