{"result_id": "054022", "URL": "https://brandnewtube.com/watch/JcrpM5iuupCORhS", "timestamp": "2023-04-25 12:22:56 CEST+0200", "meta": {"description": "BrandNewTube.com is a Video Sharing Platform. Focusing on news of the world. A platform which wouldn’t suppress your opinions. We will not hide the truth!!", "lang": "en", "keywords": "", "favicon": "https://brandnewtube.com/legacy/img/icon.png", "canonical": "https://brandnewtube.com/watch/JcrpM5iuupCORhS", "encoding": "UTF-8"}, "image": null, "domain": "brandnewtube.com", "title": "The Vaccinated Girls – Sick and Betrayed (2015 Documentary) - Brand New Tube", "cleaned_text": "⁣This is a 2015 documentary out of Denmark, which centers around 3 girls who received the Gardasil vaccine against HPV and are now facing serious illness, just like others around the world.Gardasil is a vaccine that protects women against human papillomavirus, or HPV, a common sexually transmitted disease that can give rise to cervical cancer. It’s also the subject of hot debate both in the United States and abroad. After being approached by a young woman who linked a crippling illness to her recent vaccination, Danish journalists Michael Bech Nielsen and Signe Walgren Daugbjerg decided to dig deeper—and they were astounded by what they found.Their 2015 documentary \"The Vaccinated Girls\" gave voice to roughly thirty women who suffered side effects coinciding with their inoculation. Doctors who had treated the women also came forward, explaining that the link between their vaccination and symptoms like dizziness, chest pain, and fainting was too strong to ignore—and reaching some frightening conclusions. The documentary also exposed government officers’ caginess regarding the vaccine’s dangers and admissions that they quashed evidence. Once the documentary aired, more victims came forward in droves—leading the European Medicines Agency to launch a safety review of three common anti-HPV vaccines.Video Source: http://www.renegadetribune.com/the-vaccinated-girls-sick-and-betrayed/ Note: I've been having issues with my RUMBLE account. It has been suspended and I just got it back online.Please subscribe to my Bitchute channel as well in case this account gets shut down again: https://www.bitchute.com/channel/mMWaEItrFpIf/", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.renegadetribune.com/the-vaccinated-girls-sick-and-betrayed/", "https://www.bitchute.com/channel/mMWaEItrFpIf/"], "authors": [], "publish_date": null}