{"result_id": "054009", "URL": "https://brandnewtube.com/watch/p7mbY2Ry6T5UVBn", "timestamp": "2023-04-25 12:22:47 CEST+0200", "meta": {"description": "BrandNewTube.com is a Video Sharing Platform. Focusing on news of the world. A platform which wouldn’t suppress your opinions. We will not hide the truth!!", "lang": "en", "keywords": "", "favicon": "https://brandnewtube.com/legacy/img/icon.png", "canonical": "https://brandnewtube.com/watch/p7mbY2Ry6T5UVBn", "encoding": "UTF-8"}, "image": null, "domain": "brandnewtube.com", "title": "Immunity, Infectious Disease, and Vaccination - THE DEADLY TRUTH - Dr Raymond Obomsawin (2013) - Brand New Tube", "cleaned_text": "⁣Original \"⁣Amazing Discoveries\" ---> https://youtu.be/KtN0PMJOOjM This is an important fact filled presentation of the vaccine hoax by ⁣Raymond Obomsawin (2013). I have provided a synopsis in below, if someone finds the actualy presentation slides put a link in the comments. Blessings.⁣Dr Raymond Obomsawin Bio ---> ⁣ http://whale.to/vaccines/obomsawin_h.html ⁣THE VACCINATION RACKET ---> ⁣ http://whale.to/vaccines.html ⁣VACCINATION IS CHILD ABUSE ----> ⁣ http://whale.to/c/vaccination_is_child_abuse.html ⁣“Natural immunity is the only true immunity. Everything else is an artificial attempt to cheat nature – and nature is never cheated. … If we think we can fool Mother Nature, we are only fooling ourselves.”Dr Raymond Obomsawin, PhD⁣SYNOPTIC OVERVIEW: ISSUES IN IMMUNIZATION THEORY AND PRACTICEPrepared by: Raymond Obomsawin ---> ⁣ http://whale.to/vaccine/obomsawin3.html Raymond Obomsawin, PhD (Canada) [Host: Suzanne Humphries, MD (USA)]November 1, 2010- His children have never been vaccinated and were never sick even when exposed to measles.- Natural immunity is the only immunity, all other efforts try to \"cheat\" or fool nature and nature is never cheated.- Natives in Australia were dying, every other child because of forced vaccination- Also Native Americans greatest threat to health was vaccine damage.- The first drugs were magic potions from Egypt. The Rx symbol of Pharmacy is the eye of Horus from Egypt (the son of Isis and Osiris) the god of war. The medical industry claims to make war on cancer but they are warring upon the human constitution.- Jesuits picked up the method of variolation in India and Lady Montague brought back this method from Turkey to the UK.- Jenner took cowpox pus and injected it into a boy to inoculate for smallpox. In 1871 statistics showed that the higher the vaccinated % of people, the higher rate of infection of smallpox.- 1928 study - Smallpox is more fatal to those who are vaccinated.- 1936 - William Howard Hay We have never proved that smallpox vaccination has saved a single person but we have proof that many have been made sick by them.- The lower the vaccination of smallpox the lower the smallpox cases- Smallpox was NOT eradicated by vaccination because 90% of the world was not vaccinated it was eradicated because of the stain because less varilant (1) isolation of the sick (2) nutrition and sanitation.- He cured his wife of Hepatitis by IV of vitamin C.- Memory T cells are slow learners, requiring multiple exposure to sickness ... but not from vaccination, this is your \"adaptive part of your immune system\" but 98% of the early response comes from your innate immune system. This is why it's more important to maintain a healthy body! The drugs are like the light of a candle in comparison to the sun!-1918 Flu pandemic were killed by over dosing of aspirin which caused their lungs to fill up with fluid but Dr Shelton treated 1,000 patients by natural methods and didn't lose a single one.- Ellen White, restorative power is not in drugs but in nature, since disease is an effort of nature to free the body from conditions that are a result of violations of the laws of health.Nature should be assisted in curing sickness.- Western medicine thinks prevention of disease and cure of disease is two seperate processes but whatever will most prevent a disease will also cure the disease ... it's called common sense!More polio cases now caused by vaccine than by wild virus ---> https://abcnews.go.com/Health/wireStory/polio-cases-now-caused-vaccine-wild-virus-67287290 - All non-paralytic polio cases (many thousand) were re-diagnosed as Coxsackie virus, this is one way it was eliminated. But the bigger reason was when neurotoxins like DDT, BHC, arsenic and lead based pesticides were banned. And in places where these pesticides are used polio continues in spite of vaccination!- 1997-2000 shows that the BCG vaccine given to Aboriginals in Canada have 25 times higher rate of TB than other Canadians!- Russel Blaylock - discovered that metal antigens in vaccines causes brain issues (like Autism) especially to the young and when given administered with other different vaccines at same time- No vaccine has ever done any good - \"Corrupt to the Core\": Memoirs of a Health Canada Whistleblower Book by Shiv ChopraRevelation 18:23 \"Her merchants ruled the earth and by her sorceries (Pharmakeia) were all the nations deceived\".You cannot get healthy by injecting disease matter and metals into your body!- Measles had decreased prior to vaccination- Scurvy also has the same pattern of eradication as measles which is know to be cured by Vitamin C.- TB has the same pattern of eradication in the US and no vaccine was ever adopted- Same for Scarlet Fever and for Influenza- 2006 Ontario spent $200 million to eradicate the flu by vaccine but the flu indicents when UP! Vaccines were useless!- Flu vaccines for children are 0% effective- BCG vaccine for TB is 0% effective and in fact it caused TB- Mumps outbreak 92% in vaccinated and 8% in unvaccinated- Chickenpox 2001 in Oregon 86% in vaccinatedMeasles Vaccination linked to Bowel problems.Pertussis Vaccination linked to Diabetes.Netherland study in 2004, children fully vaccinated were sicker than those not vaccinated ... it impairs and destroys the immune system!- in 2002 CDC required children get flu shot and caused a massive increase in death rates- the more vaccines administered to children, the higher the death rate - the US the highest with the highest number of vaccines given!- VAERS - reporting system, only receives between 2-10% of the actual events- Gardasil - HPV vaccine was a disaster to health and up to 700 deaths of young women!- Sudden Infant Death Syndrome (SIDS) - there was correlation to their death at the time of their vaccination.- Shaken Baby Syndome is also possibly caused by vaccines.- Vaccines have dangerous metals and ingredients but also were found to be contamination with other things- All vaccines should be stopped, The medical field and Big Pharma are corrupt!- Aluminum given to mice caused death ... the link to Autism is very compelling.- Type 2 diabetics in Japan was caused by the BCG vaccine!- Depression in the elderly is caused by the annual flu shot!- We need to go back to nature and work with it and not have a war on nature with artificial immunity.⁣=================================================================Your Rights! ---> ⁣ https://www.peoplesrights.org/your-rights To be on the safe side, anyone who has taken the pseudo vaccine should be banned from all businesses and all public spaces ... They could be super spreaders of stupidity and ignorance!5 questions to ask your friends who plan to get the Covid vaccine ---> https://off-guardian.org/2021/02/15/5-questions-to-ask-your-friends-who-plan-to-get-the-covid-vaccine/ People's International Court oF Justice ---> https://peoplesinternationalcourtofjustice.org/ *LOTS OF LINKS* Medical Opposition to CoVid-19 LockDowns, Vaccine Dangers, Disturbing Global Agendas, 5G Radiation, Boost Immune System Naturally ---> http://might-want-to-know.medianewsonline.com/ Great Barrington Declaration ---> https://medicalkidnap.com/2020/10/18/doctors-for-truth-tens-of-thousands-medical-professionals-suing-and-calling-for-end-to-covid-tyranny/ Effective Treatments for COVID-19 - Ivermectin and Vitamin D ---> https://ivmmeta.com/ Dr. Richard Bartlett has found the “Silver Bullet” in the fight against COVID-19 by using \"Budesonide\" as part of his treatment ---> https://budesonideworks.com/ TEXT 850-750-1321 & get your FREE DOCTOR consult now! ---> https://myfreedoctor.com/ Our customizable COVID COCKTAIL includes these Prescription only drugs: HCQ Ivermectin Prednisone Doxycycline BudesonideFront Line COVID-19 Critical Care Alliance (FLCCC) ---> https://covid19criticalcare.com/ Latest Coronavirus News ---> https://www.mercola.com/coronavirus-resources.htm#latest-news Get a card and lanyard - A FACE MASKE POSES A HEALTH RISK TO ME ---> https://www.citizensforfreespeech.org/ STOP MEDICAL DISCRIMINATION - The Petition To Stop Forced Experimental Vaccines ---> https://stopmedicaldiscrimination.org/home Map of Adverse Reactions to the COVID VAXX ---> https://hpv-vaccine-side-effects.com/covid-19-vaccine-side-effects-world-map/ ⁣⁣Vaccine Adverse Event Reporting System ---> https://vaers.hhs.gov/data.html National Vaccine Information Center ---> https://www.nvic.org/ *VAERS USa Covid Vax Records (Details and videos) ---> https://vaxpain.us/ *VAERS USA COVID REPORTS (Quick Display of VAXX Injury) ----> https://www.openvaers.com/covid-data *VACCINE UK DEATH AND INJURTY report ---> https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/958616/COVID-19_mRNA_Pfizer-_BioNTech_Vaccine_Analysis_Print.pdf Coronavirus (COVID-19) Vaccinations (WORLD VAXX TRACKER ROLLOUT) ---> https://ourworldindata.org/covid-vaccinations MedAlerts Website – Alternative VAERS Search Engine ---> https://medalerts.org/ MedAlerts Search Result Covid-19 Vaccine Deaths ----> https://www.medalerts.org/vaersdb/findfield.php?EVENTS=ON&VAX=COVID19&VAXTYPES=COVID-19&DIED=YesHow Changing the Definition of Pandemic Altered Our World ---> https://articles.mercola.com/sites/articles/archive/2020/12/10/1976-swine-flu-pandemic.aspx Take no part in the worthless deeds of evil and darkness; instead, expose them - Ephesian 5:11The Contagion Myth: Why Viruses (including \"Coronavirus\") Are Not the Cause of Disease --- > https://aim4truth.org/wp-content/uploads/2020/10/The_Contagion_Myth_Why_Viruses_Including_Coronavirus_Are_Not_the_Cause_of_Disease_by_Thomas_S._Cowan_Sally_Fallon_Morell.pdf?fbclid=IwAR13ccV72OVt-xgotfB4BCZv9Q8hXlyoaQOWS0VBkrHKdYrOxD-y0NNqrHA COVID19 – Evidence Of Global Fraud ---> https://off-guardian.org/2020/11/17/covid19-evidence-of-global-fraud/ Zionist Agenda Exposed by Dr Lorraine Day ---> https://www.goodnewsaboutgod.com/studies/spiritual/home_study/PDF/Judge%20Not%20that%20ye%20be%20not%20judged%202.pdf Government Vaccination Programs: Crimes Against Humanity ---> ⁣ https://www.vaccinationdecisions.net/government-vaccination-programs-crimes-against-humanity/ How Can I Get Medicine for COVID-19? ---> https://www.americasfrontlinedoctors.com/medications/ Zelensky Covid-19 Treatment Protocol, 0420 ---> ⁣ https://faculty.utrgv.edu/eleftherios.gkioulekas/zelenko/ZelenkoProtocol.pdf ⁣COVID-19 Outpatients – Early Risk-Stratified Treatment with Zinc Plus Low Dose Hydroxychloroquine and Azithromycin: A Retrospective Case Series Study ---> ⁣ https://www.preprints.org/manuscript/202007.0025/v1 PREVENTING COVID-19: Dr. Pierre Kory (FLCCC) is a champion for the Approval of Ivermectin Treatment also this is the recommended Hospital Treatment For Covid-19 ---> ⁣⁣ https://covid19criticalcare.com/ math-hospital-treatment/Dr Carrie Madej has set up a website exposing this whole Plan-demic ... focusing on the \"Fake Science\" concerning the \"lie-rus\" with a 99.98% survival rate for people under 50 years old. ---> https://www.stopworldcontrol.com/full This is NOT a vaccine it's a Genetic Code Injection \"GCI\" and it is only ALLOWED to be classified as a vaccine because America is under a National Public Health Emergency (which has been extended until end of April 2021). GCI is an experimental disease \"treatment method\" to cause your body's immune system to produce an \"antibody\" protein in order to counter the production of a \"spike\" protein introduced into the cell by nRNA incased in Lipid nanoparticles. This \"spike\" protein is NOT the entire virus sequence of 30,000 base pairs of mRNA code but the spike protein is only 1 of the 29 proteins that represents the SARS-CoV-2 ... so let's say 1,000 base pairs. Many doctors are sounding the alarm that your immune system is being \"tricked\" like a sucker punch to react to a UNNATURAL occurring \"spike protein\" and at some later time when the NATURALLY occurring virus DOES appear in the body, your immune system will overreact to destroy healthy cells in your body ... which is called an Enhanced Immunity Response! ---> https://www.the-scientist.com/news-opinion/covid-19-vaccine-researchers-mindful-of-immune-enhancement-67576 The dangers of vaccines are well documented and many doctors believe vaccines are unnecessary with no benefit therefore this rushed \"Warp Speed\" experimental mRNA vaccine executed under Medical Martial Law should be avoided until \"real\" scientists and doctors have a chance to speak. The real reason this vaccine is being rushed to market is because the whole world is being deceived by a Luciferian agenda to implement a Great Reset NWO Antichrist Kingdom and all government leaders (including Trump and Biden) are guilty of willingly participating in crimes against humanity in order to advance this agenda!A mRNA vaccine has never been used before on humans. The ingredients for the COVID-19 vaccines are NOT listed. There is NO consent form. There is NO liability for the vaccine manufacturer. The FDA has however provided a list of possible side effect! It's a NO from me dawg.Pharmakeia: Sorcery, Witchcraft, Pharmaceutical, Pharmacy, Pharmacist & the Roots of Modern Day Drug Industry ---> ⁣ http://ernestlmartin.com/images/Pharmacy,%20Drugs,%20Sorcery,%20IG%20Farbin.pdf Cryptocurrency system using body activity data ---> https://patents.google.com/patent/WO2020060606A1/en Vaccine Dangers ... especially this new experimental mRNA Genetic Code Injection!Vaccination is penetration of the body, mind and spirit by the state. The covid-19 vaccine is not proven safe or effective This is not a real medical pandemic.Are mRNA Vaccines for COVID-19 helpful or harmful? (Note, this is PRO-Vaccine article so you can see the Big Pharma narrative) ---> http://www.educatetruth.com/featured/are-mrna-vaccines-for-covid-19-helpful-or-harmful/ How COVID-19 Vaccine Can Destroy Your Immune System ---> https://articles.mercola.com/sites/articles/archive/2020/11/11/coronavirus-antibody-dependent-enhancement.aspx Dr. Lee Merritt: In Animal Studies, After Being Injected With mRNA Technology, All Animals Died Upon Reinfection ---> https://truth11.com/2021/01/29/dr-lee-merritt-in-animal-studies-after-being-injected-with-mrna-technology-all-animals-died-upon-reinfection/ PLOS PATHOGENS - Enhanced inflammation in New Zealand white rabbits when MERS-CoV reinfection occurs in the absence of neutralizing antibody ---> https://journals.plos.org/plospathogens/article?id=10.1371/journal.ppat.1006565 Pfizer COVID vaccine trial shows alarming evidence of pathogenic priming in older adults ---> https://www.lifesitenews.com/opinion/pfizer-covid-vaccine-trial-shows-alarming-evidence-of-pathogenic-priming-in-older-adults As for the RNA-based ‘vaccines’ that would re-program my body’s physical responses, thank you but I prefer the programming that I received from the Lord when I was born.\"My Body, My Choice\" Official video ---> ⁣ https://youtu.be/j41dQx-Pk10 ⁣31 Reasons Why I Won’t Take the Vaccine by Chananya Weissman ---> ⁣ https://gatesofvienna.net/2021/02/31-reasons-why-i-wont-take-the-vaccine/ For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life. - John 3:16The ABCs of Salvation explained --> https://youtu.be/XyNuvJNE3-Q A - Admit your a sinner (Romans 3:23)B - Believe Jesus is Lord (John 3:16)C - Call upon His name (Romans 10:13)The UDB's of Salvation explained Rogersings web site ---> ⁣ http://die2live.worthyofpraise.org/ U – Understand that God is holy and God hates sin because sin has destroyed His world and sin separates you from His love and sin separates you from eternal life with God.D – Desire to be reconciled to God and saved from the eternal death sentence that you are under because you were born with a sin nature.B – Believe that Jesus died, was buried and rose from the grave proving He is the only begotten Son of God who will take away your sin.Blessings to the Family of God - Jesus Only Y'all - JOY! - Rogersings", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://amazingdiscoveries.tv/c/192/Life_Science_Seminars_International/", "https://www.vaccinationinformationnetwork.com/dr-raymond-obomsawin-on-vaccination/", "https://www.alternative-doctor.com/vaccination/obomsawin.html", "https://youtu.be/KtN0PMJOOjM", "http://whale.to/vaccines/obomsawin_h.html", "http://whale.to/vaccines.html", "http://whale.to/c/vaccination_is_child_abuse.html", "http://whale.to/vaccine/obomsawin3.html", "https://abcnews.go.com/Health/wireStory/polio-cases-now-caused-vaccine-wild-virus-67287290", "https://www.peoplesrights.org/your-rights", "https://off-guardian.org/2021/02/15/5-questions-to-ask-your-friends-who-plan-to-get-the-covid-vaccine/", "https://peoplesinternationalcourtofjustice.org/", "http://might-want-to-know.medianewsonline.com/", "https://medicalkidnap.com/2020/10/18/doctors-for-truth-tens-of-thousands-medical-professionals-suing-and-calling-for-end-to-covid-tyranny/", "https://ivmmeta.com/", "https://budesonideworks.com/", "https://myfreedoctor.com/", "https://covid19criticalcare.com/", "https://www.mercola.com/coronavirus-resources.htm#latest-news", "https://www.citizensforfreespeech.org/", "https://stopmedicaldiscrimination.org/home", "https://hpv-vaccine-side-effects.com/covid-19-vaccine-side-effects-world-map/", "https://vaers.hhs.gov/data.html", "https://www.nvic.org/", "https://vaxpain.us/", "https://www.openvaers.com/covid-data", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/958616/COVID-19_mRNA_Pfizer-_BioNTech_Vaccine_Analysis_Print.pdf", "https://ourworldindata.org/covid-vaccinations", "https://medalerts.org/", "https://articles.mercola.com/sites/articles/archive/2020/12/10/1976-swine-flu-pandemic.aspx", "https://aim4truth.org/wp-content/uploads/2020/10/The_Contagion_Myth_Why_Viruses_Including_Coronavirus_Are_Not_the_Cause_of_Disease_by_Thomas_S._Cowan_Sally_Fallon_Morell.pdf?fbclid=IwAR13ccV72OVt-xgotfB4BCZv9Q8hXlyoaQOWS0VBkrHKdYrOxD-y0NNqrHA", "https://off-guardian.org/2020/11/17/covid19-evidence-of-global-fraud/", "https://www.goodnewsaboutgod.com/studies/spiritual/home_study/PDF/Judge%20Not%20that%20ye%20be%20not%20judged%202.pdf", "https://www.vaccinationdecisions.net/government-vaccination-programs-crimes-against-humanity/", "https://www.americasfrontlinedoctors.com/medications/", "https://faculty.utrgv.edu/eleftherios.gkioulekas/zelenko/ZelenkoProtocol.pdf", "https://www.preprints.org/manuscript/202007.0025/v1", "https://covid19criticalcare.com/", "https://www.stopworldcontrol.com/full", "https://www.the-scientist.com/news-opinion/covid-19-vaccine-researchers-mindful-of-immune-enhancement-67576", "http://ernestlmartin.com/images/Pharmacy,%20Drugs,%20Sorcery,%20IG%20Farbin.pdf", "https://patents.google.com/patent/WO2020060606A1/en", "http://www.educatetruth.com/featured/are-mrna-vaccines-for-covid-19-helpful-or-harmful/", "https://articles.mercola.com/sites/articles/archive/2020/11/11/coronavirus-antibody-dependent-enhancement.aspx", "https://truth11.com/2021/01/29/dr-lee-merritt-in-animal-studies-after-being-injected-with-mrna-technology-all-animals-died-upon-reinfection/", "https://journals.plos.org/plospathogens/article?id=10.1371/journal.ppat.1006565", "https://www.lifesitenews.com/opinion/pfizer-covid-vaccine-trial-shows-alarming-evidence-of-pathogenic-priming-in-older-adults", "https://youtu.be/j41dQx-Pk10", "https://gatesofvienna.net/2021/02/31-reasons-why-i-wont-take-the-vaccine/", "https://youtu.be/XyNuvJNE3-Q", "http://die2live.worthyofpraise.org/"], "authors": [], "publish_date": null}