{"result_id": "054031", "URL": "https://brandnewtube.com/watch/gebsOizxCHvNfoa", "timestamp": "2023-04-25 12:23:03 CEST+0200", "meta": {"description": "BrandNewTube.com is a Video Sharing Platform. Focusing on news of the world. A platform which wouldn’t suppress your opinions. We will not hide the truth!!", "lang": "en", "keywords": "", "favicon": "https://brandnewtube.com/legacy/img/icon.png", "canonical": "https://brandnewtube.com/watch/gebsOizxCHvNfoa", "encoding": "UTF-8"}, "image": null, "domain": "brandnewtube.com", "title": "Professor Dolores Cahill on the mRNA Vaccines. Are the Vaccines a Trojan horse? - Brand New Tube", "cleaned_text": "Professor Dolores Cahill on the mRNA Vaccines. Are the Vaccines a Trojan horse?\n\n⁣Covid19 vaccines do not prevent infection or transmission. We've seen outbreak infections where vaccination rates are high; Covid deaths in double vaccinated people. It’s now also clear that natural immunity confers longer lasting and better protection against infection. Not only are we mandating vaccination but authorities are doubling down on their targets targets and threatening further restrictions and denial of vital services such healthcare. The media, community and business leaders, professional class and politicians of all colours are mute. \n\n \n\n \n\n \n\nTo talk about the adverse effects of Covid19 vaccines and Government intrusion on our rights is Dr Dolores Cahill, a renowned expert in immunology and a Professor of University College Dublin. Dr Cahill is an inventor, founder of companies and has international Patents for improving the early diagnosis of diseases such as auto immune diseases & cancer. She is a recognised international expert and President of the World Freedom Alliance, a worldwide platform of organisations offering access to justice, dialogue for health science and politics and Government accountability. \n\n \n\n \n\nGeorge Christensen MP is the Parliamentary Member for Dawson following a career as a local councillor, community newspaper publisher and journalist. George has been one of the few Federal Parliamentarians prepared to criticise his Government’s response to Covid19 and the shocking impact of restrictions and mandates on individual freedoms and public health. In a recent speech to Parliament, where he called for an end to lockdowns, masks and vaccine passports, Mr Christensen was officially condemned for undermining the response to Covid-19 and accused for spreading misinformation. George spoke out recently against the imprisonment of Anti Lockdown campaigner Monica Smit on charges of incitement and the denial of bail unless she agreed to shut down her political organisation. \n\n \n\n \n\nAlbert Benavides has over 25 years’ experience working in the US as a professional systems data analyst and auditor. Albert is a respected VAERS data analyst who has exposed critical Covid19 vaccine safety issues from The Vaccine Adverse Event Reporting System, managed by CDC and the FDA. Albert joins us to discuss what he's just discovered in VAERS. \n\n \n\n \n\n \n\nWe all saw the images and reports of a Police horse allegedly punched by a protestor in Sydney. To us, it looked nothing like a punch, more of a forearm pushing the horse away so the protestor would not be hurt. Today that protestor, Kristian Pulkownik appeared in court. The lawyer representing him is Tony Nikolic. \n\n \n\n \n\n \n\nAsia Pacific Today. September 8, 2021 \n\n \n\n \n\n \n\nAsia Pacific Today believes that your opinion is legitimate. And we believe that our guests have something to say and that their opinion is also legitimate. Throughout the week, Mike Ryan has discussions about politics, polarising issues, current events, and more. We really are connecting with people all over the world that simply speak their mind. There's new videos throughout the week, every week. And we also need our audience to grow. It would really help us grow if you could subscribe to our Channel.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.facebook.com/sharer/sharer.php?u=https://brandnewtube.com/watch/gebsOizxCHvNfoa", "https://twitter.com/intent/tweet?url=https://brandnewtube.com/watch/gebsOizxCHvNfoa", "https://plus.google.com/share?url=https://brandnewtube.com/watch/gebsOizxCHvNfoa", "https://www.linkedin.com/shareArticle?mini=true&url=https://brandnewtube.com/watch/gebsOizxCHvNfoa&title=Professor Dolores Cahill on the mRNA Vaccines. Are the Vaccines a Trojan horse?", "https://pinterest.com/pin/create/button/?url=https://brandnewtube.com/watch/gebsOizxCHvNfoa&media=https://fra1.digitaloceanspaces.com/videos.brandnewtube.com/photos/2021/10/9nL87aKFwnQQCqYCC57Y_06_d039f4c81f68aba0adc8a145491a3601_image.jpg?response-content-type=application%2Foctet-stream&X-Amz-Content-Sha256=UNSIGNED-PAYLOAD&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=DO00VQ2RPUWHYMVT3GTM%2F20230425%2Ffra1%2Fs3%2Faws4_request&X-Amz-Date=20230425T102303Z&X-Amz-SignedHeaders=host&X-Amz-Expires=300&X-Amz-Signature=8f0635b16ad1960a787bf6e2a5292b425b7cc7969ed43741a0d1ebc04923c7bc", "https://brandnewtube.com/channels/@AsiaPacificToday"], "authors": [], "publish_date": null}