{"result_id": "055013", "URL": "https://www.brighteon.com/f7192a48-1bac-484d-9db1-75f876b1234f", "timestamp": "2023-04-25 12:23:42 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/static/icons/favicon/favicon.ico", "canonical": "https://www.brighteon.com/f7192a48-1bac-484d-9db1-75f876b1234f", "encoding": "utf-8"}, "image": null, "domain": "www.brighteon.com", "title": "PFIZER VACCINE - Woman Paraylized 12 Hours After Getting Pfizer Vaccine", "cleaned_text": "Report any serious side effects ( damage ) or death to the Vaccine Adverse Effect Reporting System ( VAERS ).\n\nKnow that all the Dangerous Covid19 Vaccines are unapproved and experimental.\n\nThe Vaccine companies can add as many toxic ingredients into their vaccines as they wish because they can not be sued for any damages or death caused by their vaccines since they have convinced all corrupt governments that Vaccines are Safe and Necessary. So yeah, these criminal vaccine & drug companies are NOT LIABLE if your family member dies or gets seriously injured by their vaccine.\n\nThe lying mainstream media ( Fake News Media ), CDC, FDA, W.H.O., NATO & UNITED NATIONS is in on this giant Vaccine Scheme to poison the world, orders coming down from the Queen of England ( Royal Family ), Vatican & City of London within London to manufacture this covid19 pandemic in order to promote deadly vaccines to help them REDUCE WORLD POPULATIONS.\n\nThe AstraZeneca and J & J Vaccines have been found to contain the same blood clotting ingredients. The Moderna & Pfizer Vaccines causes similar life threatening side effects which are common. Do not believe the lies told by corrupt medical officials, hospitals, and doctors. Their goal of these vaccine puppets are to promote and sell as many of these toxic and dangerous vaccines as soon as possible before the uneducated SHEEPLE find out the truth. This is done to brain damage and paralyze as many global citizens as possible before they manufacture more SHOOTINGS to take away your guns and firearms so you will not only have no protection for your family against all the millions of violent illegals brought in by plane, train and buses into Canada & the U.S. by Biden & Trudeau to overwhelm the populations in order to bring in ISLAM'S SHARIA LAW ...without your guns you can not protect against the ISLAMIC RAPE & GROOMING GANGS that use corrosive acid thrown into the face of women that reject their sexual advances. Without your guns, you can not protect your family from the deadly vaccines promoted by Biden & the Democrats. Without your guns, you can not protect yourself from the paid Antifa Terrorist & BLM funded by George Soros and the Cult of Islam that burned, looted and shot people during the peaceful rallies turned violent to attract your attention off of the FAKE NEWS used to promote the cancer causing vaccines and to coverup the FED & Central Banks creating their Financial Collapse by printing more money which in turn DEVALUES ALL FIAT CASH as they RESET ALL GLOBAL CURRENCIES into the trackable and corrupt FED COIN & Central Bank Digital Currencies ( CBDC )...so buy as much Bitcoin, Litecoin & Digibyte plus PHYSICAL GOLD & SILVER as soon as possible to protect your family from the coming MEGA HYPERINFLATION & FOOD SHORTAGE manufactured by the Democrats under the control of the Communist Party.\n\nIn order for BIDEN & the Democrats plus many corrupt world leaders like Trudeau to create their ILLUMINATI - ONE WORLD GOVERNMENT/New World Order, they need the world to be under ONE RELIGION so the rich pedophile elites inside the City of London within London chose the Cult of ISLAM of the Muslims to be the ONE RELIGION because it is not only the fastest growing religion that forces many to enter it's doors but it also allows for the rape and marriage of little girls as young as 8 and the beating to death of any woman who dares go against the laws of islam. The law also allow the copping off of the hands and even foot of any person that dares defy the corrupt laws of ISLAM. As soon as Trudeau and Biden has transported enough MUSLIMS under ISLAM, their numbers will increase because each many can take as many as 3 wives bearing over 10 kids...when they outnumber the existing citizens they will demand to have their SHARIA LAW overshadow your righteous country's laws.", "opengraph": {"url": "https://www.brighteon.com/f7192a48-1bac-484d-9db1-75f876b1234f", "image": "https://video.brighteon.com/file/BTBucket-Prod/poster/c5ba4193-fb79-4ed9-81e6-465c76d0c0b7.0000001.jpg", "title": "PFIZER VACCINE - Woman Paraylized 12 Hours After Getting Pfizer Vaccine", "description": "Report any serious side effects ( damage ) or death to the Vaccine Adverse Effect Reporting System ( VAERS ).\nKnow that all the Dangerous Covid19 Vaccines are unapproved and experimental.\nThe Vaccine companies can add as many toxic ingredients into their vaccines as they wish because they can not be sued for any damages or death caused by their vaccines since they have convinced all corrupt governments that Vaccines are Safe and Necessary.  So yeah, these criminal vaccine &amp; drug companies are NOT LIABLE if your family member dies or gets seriously injured by their vaccine.\nThe lying mainstream media ( Fake News Media ), CDC, FDA, W.H.O., NATO &amp; UNITED NATIONS is in on this giant Vaccine Scheme to poison the world, orders coming down from the Queen of England ( Royal Family ), Vatican &amp; City of London within London to manufacture this covid19 pandemic in order to promote deadly vaccines to help them REDUCE WORLD POPULATIONS.\nThe AstraZeneca and J &amp; J Vaccines have been found to contain the same blood clotting ingredients.  The Moderna &amp; Pfizer Vaccines causes similar life threatening side effects which are common.  Do not believe the lies told by corrupt medical officials, hospitals, and doctors.  Their goal of these vaccine puppets are to promote and sell as many of these toxic and dangerous vaccines as soon as possible before the uneducated SHEEPLE find out the truth.  This is done to brain damage and paralyze as many global citizens as possible before they manufacture more SHOOTINGS to take away your guns and firearms so you will not only have no protection for your family against all the millions of violent illegals brought in by plane, train and buses into Canada &amp; the U.S. by Biden &amp; Trudeau to overwhelm the populations in order to bring in ISLAM'S SHARIA LAW ...without your guns you can not protect against the ISLAMIC RAPE &amp; GROOMING GANGS that use corrosive acid thrown into the face of women that reject their sexual advances.  Without your guns, you can not protect your family from the deadly vaccines promoted by Biden &amp; the Democrats.  Without your guns, you can not protect yourself from the paid Antifa Terrorist &amp; BLM funded by George Soros and the Cult of Islam that burned, looted and shot people during the peaceful rallies turned violent to attract your attention off of the FAKE NEWS used to promote the cancer causing vaccines and to coverup the FED &amp; Central Banks creating their Financial Collapse by printing more money which in turn DEVALUES ALL FIAT CASH as they RESET ALL GLOBAL CURRENCIES into the trackable and corrupt FED COIN &amp; Central Bank Digital Currencies ( CBDC )...so buy as much Bitcoin, Litecoin &amp; Digibyte plus PHYSICAL GOLD &amp; SILVER as soon as possible to protect your family from the coming MEGA HYPERINFLATION &amp; FOOD SHORTAGE manufactured by the Democrats under the control of the Communist Party.\nIn order for BIDEN &amp; the Democrats plus many corrupt world leaders like Trudeau to create their ILLUMINATI - ONE WORLD GOVERNMENT/New World Order, they need the world to be under ONE RELIGION so the rich pedophile elites inside the City of London within London chose the Cult of ISLAM of the Muslims to be the ONE RELIGION because it is not only the fastest growing religion that forces many to enter it's doors but it also allows for the rape and marriage of little girls as young as 8 and the beating to death of any woman who dares go against the laws of islam.  The law also allow the copping off of the hands and even foot of any person that dares defy the corrupt laws of ISLAM.  As soon as Trudeau and Biden has transported enough MUSLIMS under ISLAM, their numbers will increase because each many can take as many as 3 wives bearing over 10 kids...when they outnumber the existing citizens they will demand to have their SHARIA LAW overshadow your righteous country's laws."}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}