{"result_id": "055021", "URL": "https://www.brighteon.com/9c42faba-f4b0-4d47-90b8-28fb14eca6a2", "timestamp": "2023-04-25 12:23:46 CEST+0200", "meta": {"description": "", "lang": "de", "keywords": "", "favicon": "/static/icons/favicon/favicon.ico", "canonical": "https://www.brighteon.com/9c42faba-f4b0-4d47-90b8-28fb14eca6a2", "encoding": "utf-8"}, "image": null, "domain": "www.brighteon.com", "title": "Pfizer's COVID Vaccine Fatal Flaws", "cleaned_text": "Patrick Hahn, a completely honest independent researcher and university biology instructor, clarifies and reviews the fatal flaws behind Pfizer’s COVID vaccine including the paring down of endpoints, the failure to test for communicability that remains after vaccination, Antibody-dependent enhancement ( ADE ), and Original Antigenic Sin. We also review the suppression of good drugs for treating COVID with antivirals like hydroxychloroquine and ivermectin, antibiotics for secondary infection, and even steroids. More personally, Patrick describes his stroke following the vaccine that his universities mandated. We also review the CDC’s refusal to examine the data in its own VAERS reporting system which show such vaccine adverse effects as This is a very good review for those who are new to these issues and those who would like a refresher course. We conclude with the tragedy of intentional culling of the population by empires, including the new global empires.", "opengraph": {"url": "https://www.brighteon.com/9c42faba-f4b0-4d47-90b8-28fb14eca6a2", "image": "https://photos.brighteon.com/file/brighteon-thumbnails/poster/91225c1a-0246-41f4-a2cb-98b818f4e341", "title": "Pfizer's COVID Vaccine Fatal Flaws", "description": "Patrick Hahn, a completely honest independent researcher and university biology instructor, clarifies and reviews the fatal flaws behind Pfizer’s COVID vaccine including the paring down of endpoints, the failure to test for communicability that remains after vaccination, Antibody-dependent enhancement ( ADE ), and Original Antigenic Sin.  We also review the suppression of good drugs for treating COVID with antivirals like hydroxychloroquine and ivermectin, antibiotics for secondary infection, and even steroids.  More personally, Patrick describes his stroke following the vaccine that his universities mandated.  We also review the CDC’s refusal to examine the data in its own VAERS reporting system which show such vaccine adverse effects as This is a very good review for those who are new to these issues and those who would like a refresher course.  We conclude with the tragedy of intentional culling of the population by empires, including the new global empires."}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}