{"result_id": "056013", "URL": "https://brightside.me/wonder-curiosities/11-phenomena-that-humanity-has-only-seen-once-796547/", "timestamp": "2023-04-25 12:24:06 CEST+0200", "meta": {"description": "There are countless events that have made a mark on the history of humanity in one way or another. And although some of the more important events have overshadowed smaller ones, each one has its importance and encouraged future scientific research.", "lang": "en", "keywords": "Inspiration, Creativity, Wonder", "favicon": "/favicon.ico", "canonical": "https://brightside.me/wonder-curiosities/11-phenomena-that-humanity-has-only-seen-once-796547/", "encoding": null}, "image": null, "domain": "brightside.me", "title": "11 Phenomena That Humanity Has Only Seen Once", "cleaned_text": "There are countless events that have made a mark on the history of humanity in one way or another. And although some of the more important events have overshadowed smaller ones, each one has its importance and encouraged future scientific research.\n\nAlthough these creatures have been seen mostly in Japanese waters, American scientists were able to capture a giant squid on camera over 750 meters underwater for the first time in the United States. To do so, they used a specialized camera system that used red light undetectable to deep-sea creatures with over 120 hours of recording!\n\nMore than 43 years ago in 1977, a telescope called The Big Ear received a signal of a much stronger sound wave than is commonly heard in space. Radio astronomer Jerry Ehman was so impressed by the powerful signal from space, that he circled the reading on the computer printout that said “6EQUJ5” and wrote the comment, “Wow!” next to it, hence the signal’s name. Was that evidence of alien life or not? We don’t know that yet and the mystery of the “Wow!” signal still remains.\n\nThis is the explosion that happened in 1908 near the Stony Tunguska River. Some theories say that the explosion was caused by a meteorite that penetrated the atmosphere and exploded before reaching the ground, releasing energy that would be equivalent to 185 Hiroshima bombs. There were no craters left because the giant stone disintegrated before impacting the earth, but it burned vegetation, killed animals, and to this day, no trees grow in that area.\n\nThis event occurred in 1859 and is considered one of the most extreme in the history of solar storms. More precisely, what happened was that a number of solar particles collided with the earth’s magnetic field, thus exhibiting another phenomenon known as aurora borealis. But the one in Carrington was much more powerful and the lights were seen in many regions at the same time.\n\nIn 1986, thanks to the Voyager 2 space probe, NASA managed to approach Uranus for the first time. It’s the coldest planet in our solar system, although not the farthest from the sun. This phenomenon, as scientists discovered, is due to the fact that it does not have an internal heat source. Also, there was evidence of a boiling ocean below the cloud tops.\n\nSupervolcano Toba caused the near extinction of the human species around 74,000 years ago. Its explosion ejected such a quantity of ash and sulfur gas that they blocked the sunlight and made life on earth impossible: plants and animals died and the air became toxic and difficult to breathe. From that day, Lake Toba on the island of Sumatra remains the largest crater lake in the world. But how did humans survive after that terrible catastrophe? It’s believed that the eruption likely created areas called refugia, where humans could survive harsh conditions. Coastal regions were especially important, as shellfish were less affected by the eruption than mainland plants and animals, providing a nutritious source of food for humans before hunting became an option again.\n\nThis impressive comet crossed the skies during the 1970s, leaving a bright trail. These large balls of ice, rock, and dust that are disintegrating usually have a large tail of dirt that they give off and another made of gases that burn. In the West, they appeared to be much brighter than other comets and their tails could be clearly distinguished, said to be brighter than Venus. It’s an event that rarely occurs in life.\n\n9. Smallpox: the only human disease that has been successfully eradicated.\n\nThis is a unique disease because it’s one of the deadliest known to humanity and the only one that was completely eradicated. Smallpox has no cure or treatment and the smallpox vaccine was the first successful vaccine to ever be invented. It was discovered that peasants who worked with cattle contracted a much more benign version of the disease and thanks to that, they were immunized against it. This showed that administering the attenuated virus could generate antibodies to any strain of the same virus. Later, this would become the vaccine we know today.\n\nThis strange event dates back to the 16th century in Strasbourg, where somewhere between 50 to 400 people took to the streets to dance uncontrollably for days. About 15 people were dying every day due to exhaustion and heart attacks and many others were taken to a healing sanctuary. Although this phenomenon cannot be explained, there are many theories about it, one of which is the overwhelming living standards of the poor population of Strasbourg.\n\n11. Cyclone Catarina, the only hurricane recorded in the South Atlantic\n\nThis hurricane is unique because it’s the first and the last so far to hit the coasts of Brazil and the only one on record that has reached South America. It was a category 2 hurricane, hitting the Santa Catarina coast as a category 1, with winds between 120 and 150 km per hour.", "opengraph": {"description": "There are countless events that have made a mark on the history of humanity in one way or another. And although some of the more important events have overshadowed smaller ones, each one has its importance and encouraged future scientific research.", "site_name": "Bright Side — Inspiration. Creativity. Wonder.", "article:published_time": "2020-04-05T23:30:00+03:00", "updated_time": "2020-04-03T11:56:50+03:00", "article:publisher": "https://www.facebook.com/brightside", "article:author": "https://www.facebook.com/brightside", "type": "article", "url": "https://brightside.me/wonder-curiosities/11-phenomena-that-humanity-has-only-seen-once-796547/", "title": "11 Phenomena That Humanity Has Only Seen Once", "image": "https://wl-brightside.cf.tsp.li/resize/1200x630/jpg/ed0/76f/0c4955510a86af12a705450cd8.jpg", "image:width": "1200", "image:height": "630"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.pexels.com/photo/aerial-photography-of-river-1629803/", "https://www.bbc.com/news/science-environment-19435026", "https://commons.wikimedia.org/wiki/File:Architeuthis_princeps_image_modified.PNG", "https://edition.cnn.com/2019/06/21/us/giant-squid-on-camera-in-us-trnd/index.html", "https://commons.wikimedia.org/wiki/File:Wow_signal.jpg", "https://phys.org/news/2017-06-wow-mystery-space.html", "https://commons.wikimedia.org/wiki/File:Tunguska_Ereignis.jpg", "http://www.bbc.com/earth/story/20160706-in-siberia-in-1908-a-huge-explosion-came-out-of-nowhere", "https://commons.wikimedia.org/wiki/File:Magnetosphere_rendition.jpg", "https://agupubs.onlinelibrary.wiley.com/doi/full/10.1029/2019SW002269", "https://commons.wikimedia.org/wiki/File:Titan_3E_Centaur_launches_Voyager_2.jpg", "https://www.nasa.gov/feature/jpl/voyager-mission-celebrates-30-years-since-uranus", "https://commons.wikimedia.org/wiki/File:Tobaeruption.png", "https://www.sciencedaily.com/releases/2018/03/180312132956.htm", "https://commons.wikimedia.org/wiki/File:C-west-1976-ps.jpg", "https://en.wikipedia.org/wiki/Comet_West", "http://www.fallofathousandsuns.com/comet-west.html", "https://commons.wikimedia.org/wiki/File:Directors_of_Global_Smallpox_Eradication_Program.jpg", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3110218/", "https://commons.wikimedia.org/wiki/File:Die_Wallfahrt_der_Fallsuechtigen_nach_Meulebeeck.jpg", "https://www.bbc.com/future/article/20161028-the-town-the-nearly-danced-itself-to-death", "https://commons.wikimedia.org/wiki/File:Catarina_27_mar_2004_1630Z.jpg", "https://journals.ametsoc.org/doi/10.1175/MWR3330.1", "https://commons.wikimedia.org/wiki/File:Die_Wallfahrt_der_Fallsuechtigen_nach_Meulebeeck.jpg"], "authors": [], "publish_date": "2020-04-05T23:30:00+03:00"}