{"result_id": "056004", "URL": "https://brightside.me/inspiration-tips-and-tricks/11-money-mistakes-we-make-in-our-youth-that-we-come-to-regret-later-801717/", "timestamp": "2023-04-25 12:24:03 CEST+0200", "meta": {"description": "According to this study, nearly a third of young adults lack financial literacy, good money management skills, and income stability. Learning how to properly handle our money and how to make the right financial decisions when we’re younger is something everyone should learn. And the best thing we can do before going out into the world and handling our money is to try and educate ourselves so that we don’t end up in trouble.", "lang": "en", "keywords": "Inspiration, Creativity, Wonder", "favicon": "/favicon.ico", "canonical": "https://brightside.me/inspiration-tips-and-tricks/11-money-mistakes-we-make-in-our-youth-that-we-come-to-regret-later-801717/", "encoding": null}, "image": null, "domain": "brightside.me", "title": "11 Money Rules We Wish Were Taught in School", "cleaned_text": "According to this study, nearly a third of young adults lack financial literacy, good money management skills, and income stability. Learning how to properly handle our money and how to make the right financial decisions when we’re younger is something everyone should learn. And the best thing we can do before going out into the world and handling our money is to try and educate ourselves so that we don’t end up in trouble.\n\n1. Trying to keep up with wealthier friends\n\nWhen we are hanging out with friends who are wealthier than us, we might feel forced to keep up with them, to buy designer clothes and fancy cars, and afford fancy trips all over the world. It is important to know your limit and not get yourself into debt, just so you can match the lifestyle of someone who is wealthy. After all, success and money come at different stages in life for some people, and we need to be smart about them.\n\nWhen you move away of home and you don’t have nice, warm, cooked meals all the time, you might be tempted to start ordering food again, and again, and again. That means you start overspending on food and you might not be financially stable enough to be able to afford that. Instead, go to the grocery store, get products you need, and cook for yourself. If you can’t cook, you should try to learn how to.\n\nYou may not want to think that far into the future when you’re in your 20s and having the time of your life, but that would be a mistake. You should look to put money into a retirement account as soon as you can, because over time it will gather interest and you will find yourself with a lot of money to spend in your golden years.\n\nYou may feel like a superhero in your 20s, but you are not invincible and you shouldn’t think that you’re fully safe from injuries, illnesses, disasters, and other problems. You shouldn’t ignore insurance. For example, renter’s insurance will save you money in case of an emergency, like a break-in, a fire, or a flood. Medical insurance could potentially save you thousands of dollars in case something bad happens. It’s important to do the most you can to keep yourself protected.\n\nYou might not like your current job in retail, or driving for Uber or Lyft, but you are too scared to quit, because at least you have a stable income and the job feels safe. However, if that’s not what you want to do with your life, you shouldn’t be afraid to take a risk, especially in your 20s, even if it means taking an internship. It might be unpaid, or it might pay less, but if it’s an internship for a job you like and would want to do, then you shouldn’t be afraid to start from the bottom again if it means it will make your future better. And, after all, your 20s is the best time for you to learn a skill, it’s better to start now than to have to switch careers a lot later in your life.\n\nGetting a pet might seem like the next step of your independent life after you’ve gotten your own place, but that might not be the best idea. Sure, they’re adorable and fluffy, they’re your best friends, and they make for some great pictures, but it’s not all fun and games. Pets are actually very expensive to care for, because they too have needs. Whether it’s food, toys, vaccines, vet bills, or grooming if it’s needed. Those things add up and it can take a big chunk out of your paycheck, so you need to consider if you are able to afford to own and take care of a pet, because it is a very big and important responsibility.\n\nA lot of us have probably bought something that we don’t necessarily need, just because we felt sad. The truth is these purchases might make us feel better at first, but they’re not the solution to our problems: all they do is make us waste our hard-earned money when we could put it toward something we really need. Treating yourself is important and good a lot of the time, but it has to be done responsibly.\n\n10. Moving out too soon\n\nYou may think that the moment you reach 18 or 21 you should leave your parents’ home to be independent and on your own in the big world. Sure, it’s good to learn to fend for yourself and to learn independence, but you should be smart about it. Moving out would mean that you’d have to start paying your own rent and bills, you’d have to learn to cook for yourself, and your first home might not be as nice and cozy as the one you grew up in. These things should be considered when making this very big step in your adult life. And it is okay to wait a bit before moving out, once you have a decent, stable job with a decent and stable income, then you can feel a lot more comfortable moving out, as you’ll have the means to take care of yourself.\n\n11. Expecting to have it all figured out while still in your 20s\n\nA lot of young people stress and panic about their life and problems, whether it’s college, work, paying rent, or all of that together. Not many people find their calling and start their adult life on a high, and not many people have everything figured out. You might expect your first job to be amazing, highly paid, and your ideal career, but in many instances, that’s just not going to be the case, and that’s okay. You’ll change jobs, change apartments, deal with your car giving you trouble, and all these experiences will help you in the end. It’s okay to not know where you’re headed or what you’re doing just yet: you will figure this out with time.\n\nMy ex-husband and I agreed that it would be easier to save money with me putting all of our household expenses on my salary, and he’d do the saving and big purchases and tax bills with his salary.\n\nWe’re divorced, and he stuck me with half the tax bills he never paid. Oh, and all that money he was saving...yeah I didn’t get any of that either. His new wife got a nice ring and a honeymoon, though.\n\nWill never trust someone with my money again. Halfsies for everything, or nothing. © flyingcatpotato / Reddit\n\nPlease note: This article was updated in August 2022 to correct source material and factual inaccuracies.", "opengraph": {"description": "According to this study, nearly a third of young adults lack financial literacy, good money management skills, and income stability. Learning how to properly handle our money and how to make the right financial decisions when we’re younger is something everyone should learn. And the best thing we can do before going out into the world and handling our money is to try and educate ourselves so that we don’t end up in trouble.", "site_name": "Bright Side — Inspiration. Creativity. Wonder.", "article:published_time": "2021-04-24T06:30:00+03:00", "updated_time": "2022-08-08T12:19:05+03:00", "article:publisher": "https://www.facebook.com/brightside", "article:author": "https://www.facebook.com/brightside", "type": "article", "url": "https://brightside.me/inspiration-tips-and-tricks/11-money-mistakes-we-make-in-our-youth-that-we-come-to-regret-later-801717/", "title": "11 Money Rules We Wish Were Taught in School", "image": "https://wl-brightside.cf.tsp.li/resize/1200x630/jpg/131/1ad/d619e656c88807fb7f0aa520f1.jpg", "image:width": "1200", "image:height": "630"}, "tags": [], "tweets": [], "movies": [], "links": ["https://news.illinois.edu/view/6367/686400", "https://youtu.be/YDfjtcs9WGQ?t=25", "https://youtu.be/YDfjtcs9WGQ?t=91", "https://youtu.be/YDfjtcs9WGQ?t=153", "https://youtu.be/YDfjtcs9WGQ?t=185", "https://youtu.be/YDfjtcs9WGQ?t=258", "https://youtu.be/YDfjtcs9WGQ?t=351", "https://youtu.be/YDfjtcs9WGQ?t=427", "https://youtu.be/YDfjtcs9WGQ?t=502", "https://journals.sagepub.com/doi/full/10.1177/1948550619835215", "https://www.betterhealth.vic.gov.au/health/HealthyLiving/moving-out-of-home-tips-for-young-people", "https://youtu.be/YDfjtcs9WGQ?t=534", "https://www.reddit.com/r/AskReddit/comments/2a2c00/comment/ciqu1go/?utm_source=share&utm_medium=web2x&context=3", "https://www.reddit.com/r/AskReddit/comments/2a2c00/comment/ciqu1go/?utm_source=share&utm_medium=web2x&context=3"], "authors": [], "publish_date": "2021-04-24T06:30:00+03:00"}