{"result_id": "056027", "URL": "https://brightside.me/wonder-animals/holland-becomes-the-first-country-without-street-dogs-and-heres-how-they-achieved-it-753010/", "timestamp": "2023-04-25 12:24:12 CEST+0200", "meta": {"description": "Can you imagine how much greater the world would be without stray dogs? Holland took the lead and saved them by finding them all a home. They’re entirely changing the dogs’ destinies and allowing them to have a life full of happiness and love. The government took specific action to accomplish this by implementing the PSVIR method (pick, sterilize, vaccinate, identify, and return). Thanks to this, in 2016, it became the first country to free these living creatures from the loneliness and terror of the streets. Those of us who love animals want this idea to be copied around the rest of the world.", "lang": "en", "keywords": "Inspiration, Creativity, Wonder", "favicon": "/favicon.ico", "canonical": "https://brightside.me/wonder-animals/holland-becomes-the-first-country-without-street-dogs-and-heres-how-they-achieved-it-753010/", "encoding": null}, "image": null, "domain": "brightside.me", "title": "Holland Becomes the First Country Without Street Dogs, and Here’s How They Achieved It", "cleaned_text": "Can you imagine how much greater the world would be without stray dogs? Holland took the lead and saved them by finding them all a home. They’re entirely changing the dogs’ destinies and allowing them to have a life full of happiness and love. The government took specific action to accomplish this by implementing the PSVIR method (pick, sterilize, vaccinate, identify, and return). Thanks to this, in 2016, it became the first country to free these living creatures from the loneliness and terror of the streets. Those of us who love animals want this idea to be copied around the rest of the world.\n\nSince the 19th century, Holland has had a huge dog population. Almost every family in the country had a dog as a pet because people viewed it as a symbol of social status. But the large number of dogs that lived there sparked an outbreak of rabies which soon became one of the leading causes of death. Out of fear, many owners began abandoning their pets and since this action was considered legal, streets became filled with stray dogs of all kinds.\n\nHolland wanted to change these unfortunate circumstances. They began to do this by organizing days in which sterilization and castration were mandatory. All were free of charge; the government covered all the expenses. With this, they were able to sterilize 70% of female dogs. Every dog also had medical examinations to verify which vaccines and medical services it needed.\n\nTo take more control and end the problem once and for all, the government passed a law that protected animals and approved another law related to animal health and welfare. The new legislation encouraged owners to provide pets with adequate treatment and to eliminate abuse. If owners didn’t follow them, they could be punished with up to 3 years in prison and a fine higher than $16,000.\n\nHigher taxes for the purchase of breeding dogs\n\nPeople who decide to have a dog at home usually choose to adopt or buy breeding dogs because they consider them to be more beautiful and healthy. This is why the Dutch government resolved to raise taxes on the purchase of dogs in stores. Consequently, this added expense forced dog owners to start considering other ways to get pets and increased the chance of stray dog adoption.\n\nThe state also began to run another campaign to raise awareness. This time people had the opportunity to take care of homeless puppies. Slowly but surely, people fell in love with them and over a million stray dogs managed to find a family and a safe place to live. This operation had a massive impact on citizens and led 90% of the population to adopt a dog as a pet.\n\nThis government program worked against all adversity. Following their achievements, they delegated the job to “Animal Cops” in 2011, a group of policemen in charge of the protection and safety of dogs. Today, puppies living in the Netherlands are not only living comfortably in homes, but they’re also accepted in most of the country’s stores, restaurants, and other establishments.\n\nWhat do you think of this Dutch initiative? Would you like to see the rest of the world join? Share your answers in the comments and if you’re already committed to helping stray dogs, we’d love to know.", "opengraph": {"description": "Can you imagine how much greater the world would be without stray dogs? Holland took the lead and saved them by finding them all a home. They’re entirely changing the dogs’ destinies and allowing them to have a life full of happiness and love. The government took specific action to accomplish this by implementing the PSVIR method (pick, sterilize, vaccinate, identify, and return). Thanks to this, in 2016, it became the first country to free these living creatures from the loneliness and terror of the streets. Those of us who love animals want this idea to be copied around the rest of the world.", "site_name": "Bright Side — Inspiration. Creativity. Wonder.", "article:published_time": "2019-06-07T22:30:00+03:00", "updated_time": "2019-06-06T14:58:40+03:00", "article:publisher": "https://www.facebook.com/brightside", "article:author": "https://www.facebook.com/brightside", "type": "article", "url": "https://brightside.me/wonder-animals/holland-becomes-the-first-country-without-street-dogs-and-heres-how-they-achieved-it-753010/", "title": "Holland Becomes the First Country Without Street Dogs, and Here’s How They Achieved It", "image": "https://wl-brightside.cf.tsp.li/resize/1200x630/jpg/8dd/955/b1ff1057d1b6fdd231ac3e35a8.jpg", "image:width": "1200", "image:height": "630"}, "tags": [], "tweets": [], "movies": [], "links": ["https://pixabay.com/es/photos/perros-cachorros-mascota-animales-984015/", "http://dogresearch.files.wordpress.com/2012/11/dr_dutch-straydogs.pdf", "https://pixabay.com/es/photos/perro-cachorro-mascota-animales-918620/", "https://pixabay.com/es/photos/perros-negro-blanco-mascotas-439958/", "https://pixabay.com/es/photos/d%C3%A1lmatas-perros-mascotas-buena-3210166/", "https://pixabay.com/es/photos/perro-amistad-naturaleza-confianza-1861839/", "https://pixabay.com/es/photos/perro-animales-feliz-juguet%C3%B3n-3590437/", "http://www.nytimes.com/2018/01/29/world/europe/netherlands-animal-police.html", "https://pixabay.com/es/photos/perro-cachorro-mascota-animales-918620/"], "authors": [], "publish_date": "2019-06-07T22:30:00+03:00"}