{"result_id": "056038", "URL": "https://brightside.me/wonder-people/16-men-experienced-firsthand-that-parental-leave-and-vacation-are-not-the-same-thing-801038/", "timestamp": "2023-04-25 12:24:16 CEST+0200", "meta": {"description": "Being on maternity leave, raising children, changing diapers, and taking them to classes — some people think that these are things only women do. That’s simply because “men work and they have a lot of other stuff to do.” But there are some men that have experienced those crazy times after their children were born, including all the sleepless nights and the attempts to work and be a parent at the same time.", "lang": "en", "keywords": "Inspiration, Creativity, Wonder", "favicon": "/favicon.ico", "canonical": "https://brightside.me/wonder-people/16-men-experienced-firsthand-that-parental-leave-and-vacation-are-not-the-same-thing-801038/", "encoding": null}, "image": null, "domain": "brightside.me", "title": "16 Men Experienced Firsthand That Parental Leave and Vacation Are Not the Same Thing", "cleaned_text": "In a home with 3 female redheads, I get very little in terms of gratitude or even respect. It’s not my lady’s fault, it’s my own. Until I got sick, I had the energy and determination to do all, be all. Now though, getting the girls ready for school is such a chore, I could go to bed for the remainder of the day. Instead, I spend 3 hours on transit to get them to school, come home, and choose to either clean, eat, or nap in the 1 to 1.5 hours I have before I have to spend another 3 to 4 hours trying to get back to the school to get them and bring them home. © Nicholas Cobb / Quora\n\nI took 5 months of parental leave for my firstborn when she was 14 months old. The single hardest thing to adjust to was having no breaks. Never. To illustrate this a little better: In the last month, I spent one day a week at the office to help with re-transitioning into my old role and get back up to speed. Those were my days of vacation! All of a sudden, I had adult conversations. When I needed a break, I would pour myself a cup of coffee and just flip through a magazine. There’d be other people, but they’d never yell into my ear when they needed something from me. In fact, there was surprisingly little that people needed from me that was more than my thoughts on certain topics. When I’d tell people, “No, I can’t do that,” they’d accept it. When I told them something would be done by “next week,” they’d be okay with it. When I wanted to think something through, I’d go to another room and just stare at the whiteboard and my notes for an hour. I would go to the bathroom by myself. With the door closed. © Markus Finster / Quora", "opengraph": {"description": "Being on maternity leave, raising children, changing diapers, and taking them to classes — some people think that these are things only women do. That’s simply because “men work and they have a lot of other stuff to do.” But there are some men that have experienced those crazy times after their children were born, including all the sleepless nights and the attempts to work and be a parent at the same time.", "site_name": "Bright Side — Inspiration. Creativity. Wonder.", "article:published_time": "2021-03-02T00:30:00+03:00", "updated_time": "2021-07-15T19:33:23+03:00", "article:publisher": "https://www.facebook.com/brightside", "article:author": "https://www.facebook.com/brightside", "type": "article", "url": "https://brightside.me/wonder-people/16-men-experienced-firsthand-that-parental-leave-and-vacation-are-not-the-same-thing-801038/", "title": "16 Men Experienced Firsthand That Parental Leave and Vacation Are Not the Same Thing", "image": "https://wl-brightside.cf.tsp.li/resize/1200x630/jpg/a47/8c3/1f70805169b9a8dfc7224865c5.jpg", "image:width": "1200", "image:height": "630"}, "tags": [], "tweets": [], "movies": [], "links": ["https://qr.ae/pNzl9K"], "authors": [], "publish_date": "2021-03-02T00:30:00+03:00"}