{"result_id": "057003", "URL": "https://www.bugout.news/2021-05-13-how-to-outsmart-the-doomed-death-cult-masses-who-now-surround-us.html", "timestamp": "2023-04-25 12:24:19 CEST+0200", "meta": {"description": "The masses walking around society today have become a death cult of lunatics who believe a long list of insane, ...", "lang": "en", "keywords": "chaos,civilization,Collapse,death cult,Leftists,lunatics,survival,violence,zombies", "favicon": "https://www.bugout.news/images/icon.ico", "canonical": "https://www.bugout.news/2021-05-13-how-to-outsmart-the-doomed-death-cult-masses-who-now-surround-us.html", "encoding": "UTF-8"}, "image": null, "domain": "www.bugout.news", "title": "How to outsmart the doomed DEATH CULT masses who now surround us", "cleaned_text": "The masses walking around society today have become a death cult of lunatics who believe a long list of insane, self-destructive things:\n• That being injected with deadly, experimental vaccines will “save” them.\n• That America needs to be destroyed because of “systemic racism.”\n• That men can have babies, women can produce sperm and children should be physically maimed as young as six years old to achieve “gender equality.”\n• That nobody needs to work any longer, and that government should simply pay everyone to be consumers, not producers.\n• That Big Pharma, the CDC and Fauci are all good faith operators who are trying to help humanity and save lives.\n• That all fossil fuels are inherently bad, and society should shut down all pipelines and refineries, plunging America into mass starvation, lawlessness and chaos, all in the name of “the environment.”\n• That all White people are racist, and that violence and discrimination against Whites is “justice” or “equality.”\n• That communist is wonderful, and America would be a much better country if it were ruled by China.\n• That all police are bad, and society would be far better off if all police were eliminated, and criminal gangs allowed to run free.\n\nThese are insane, destructive ideas, yet they are being pushed so aggressively by the contrived fake news media and culture programming channels that most Americans now believe these things.\n\nAt least half of all Americans may not survive the next five years\n\nThe Deagel.com website has long predicted a plunge in U.S. population from 330+ million to under 100 million. Although this prediction was removed on April 20th of this year, Deagel.com’s prediction foreshadows a simple, powerful truth about the American people: The majority of Americans have joined a death cult of sorts, where their own beliefs and actions can only lead to their own destruction.\n\n– Those who demand the shutting down of fossil fuels are begging to die from starvation.\n\n– Those who demand to be repeatedly injected with experimental “vaccines” are begging to die from adverse reactions like blood clots.\n\n– Those who demand a race-based civil war are begging to die that civil war. (The racist, anti-White leftists own the fewest guns…)\n\n– Those who demand a communist takeover of America have no clue that they would be exterminated by those very same communists.\n\n– Those who demand free government handouts and refuse to work are begging to die from starvation and violence as society collapses due to the fact that nobody is working or producing anything.\n\nWe are surrounded by death cultists who pretend to be “woke.” They’ve become insane lunatics who lack any last semblance of cognition or logic. They are very nearly zombified former humans who behave as if they no longer have souls.\n\nAs a stunning, easily observable example of this, note that the CDC has just announced that “fully vaccinated” people no longer need to wear masks at all, not indoors or outside. Not even in social situations.\n\nWatch and see how many obedient zombies continue to wear masks anyway, because they are emotionally and psychologically tied to the virtue signaling obedience of mask wearing. They love their servitude! They love their masks! Anyone walking around wearing a mask after this CDC announcement is a brainless, soulless zombie.\n\nIn every city in America, you will notice the zombies are now the majority.\n\nSo it’s not difficult to understand how nearly three out of four Americans might be exterminated in the next five years, should this insanity continue. There’s no doubt in my mind that at least half the nation would gladly to die if it meant virtue signaling to the “woke” crowd.\n\nBut as I mention in today’s Situation Update podcast, if there are fewer than 100 million Americans still alive after all this, those survivors are going to be the toughest, most prepared, survival-mindset Americans of all. The mass death wave now targeting American’s oblivious zombies will only remove the stupid and the weak… that is, people stupid enough to get vaccines and weak-minded enough to believe what “authorities” tell them.\n\nYou can bet the remaining survivors won’t be libtards and soy boys.\n\nIn a twisted kind of way, Bill Gates and the vaccine industry are actually getting rid of the most useless members of society — people who are nothing more than obedient zombies who have absolutely nothing to contribute to the real progress of human civilization.\n\nObedience is not a virtue. It’s a death cult. And just because a death cult becomes wildly popular doesn’t mean it isn’t still a death cult.\n\nLeftist lunatics won’t be happy until they destroy themselves and as many others who willingly go along with their suicidal agendas. Your job is to avoid getting swept into this death wish / “Heaven’s Gate” cult mindset and maintain your sanity over the next few years as all this unfolds.\n\nDiscover a new podcast each weekday — plus lots of new interviews (six new ones recorded this week) — at Brighteon.com:", "opengraph": {"title": "How to outsmart the doomed DEATH CULT masses who now surround us", "type": "article", "url": "http://www.bugout.news/2021-05-13-how-to-outsmart-the-doomed-death-cult-masses-who-now-surround-us.html", "site_name": "Bugout News", "description": "The masses walking around society today have become a death cult of lunatics who believe a long list of insane, ...", "image": "http://www.bugout.news/wp-content/uploads/sites/45/2021/05/HRR-2021-05-13-Situation-Update.jpg"}, "tags": ["death cult", "lunatics", "survival", "civilization", "violence", "zombies", "chaos", "Collapse", "Leftists"], "tweets": [], "movies": [], "links": ["http://Brighteon.com/3ca58c96-530e-4b37-89f4-bf7c111aedc6", "https://www.brighteon.com/channels/hrreport"], "authors": ["Virgilio Marin"], "publish_date": "2021-12-14T19:50:43+00:00"}