{"result_id": "057002", "URL": "https://www.bugout.news/2021-09-03-labor-day-exclusive-discounts-and-coupon-codes-from-multiple-online-retailers.html", "timestamp": "2023-04-25 12:24:18 CEST+0200", "meta": {"description": "We’ve gathered up some exclusive discounts and coupon codes for Labor Day sales on preparedness gear, survival supplies and other ...", "lang": "en", "keywords": "emergency food,firearms,food supply,Gear,Labor Day,preparedness,prepping,specials,survival", "favicon": "https://www.bugout.news/images/icon.ico", "canonical": "https://www.bugout.news/2021-09-03-labor-day-exclusive-discounts-and-coupon-codes-from-multiple-online-retailers.html", "encoding": "UTF-8"}, "image": null, "domain": "www.bugout.news", "title": "Labor Day exclusive discounts and coupon codes (from multiple online retailers) for readers and listeners", "cleaned_text": "We’ve gathered up some exclusive discounts and coupon codes for Labor Day sales on preparedness gear, survival supplies and other goodies that seem to be of particular interest right now. Some of the retailers listed below are sponsors of the HRR Situation Update podcast, but others are not. Almost all of them are sold out of many of the items they have, because all retailers share the same challenge right now with collapsing supply lines.\n\nSince supply lines are breaking down — and the dollar is becoming increasingly worthless with each passing day — it seems to be a smart time to invest in preparedness items that hold their value.\n\nThis article will self-destruct after Labor Day.\n\nThe Health Ranger Store Labor Day specials begin Saturday morning. We have huge discounts on the AirDoctor air purifiers, a large selection of #10 cans of storable foods, and free colloidal silver extra strength spray for orders over $125. See all the specials through this landing page:\n\nOne of my favorite new suppliers for American-made swords, tactical knives, survival knives and more is Dawson Knives (DawsonKnives.com). Use coupon code LABOR15 for 15% off site-wide, through Sep 10th.\n\nThe Kali Key company makes a drop-in replacement for your AR-15 BCG (bolt carrier group) that instantly converts your semi-auto rifle into a single-shot, bolt-action rifle. This makes it compliant with current California law (check your local laws for complete details), while also allowing you to revert the rifle to semi-auto status by swapping your original BCG back into the action (which takes less than a minute).\n\nI own these devices and love ’em! Use coupon code “ranger” at KaliKey.com for 15% off. (Hint, they also make your suppressed rifle .)\n\nFront Site firearms training near Las Vegas – huge discounts for our readers\n\nThe discount is too large to even mention publicly, but if you’re withing driving distance of Vegas, and you want top-notch firearms training for self-defense, visit www.Duty-Bound.net for full details.\n\nLearn to grow a huge amount of food in minimal space – the Food Grow Network\n\nTomorrow (Saturday) is the broadcast day for the Marjory Wildcraft event on how to grow a massive amount of food in a limited space. I’ve been to Marjory’s farm (her previous one, in Texas) and have seen firsthand how she’s able to produce an astonishing amount of food in such a small space.\n\nHer course is free to watch, and you can optionally purchase the digital downloads of the entire course (which pays us an affiliate fee). Register for free at:\n\nAR15parts.com has a 15% off sitewide sale – use coupon code LaborDay2021\n\nAR15parts.com is a great company offering all sorts of AR uppers, complete lowers, and various parts that are going to be extremely valuable in the coming chaos. I’m a customer of theirs.\n\nUse coupon code LaborDay2021 for 15% off site-wide at AR15parts.com\n\nPalmetto State Armory also running a Labor Day Sale on AR uppers and more…\n\nSee their specials here, which includes firearms, AR uppers, AR lowers, AR pistols and more.\n\nI cover some additional Labor Day specials, including counseling services and a raw chocolate protein bar company, in this special podcast:\n\nUse this time to get prepared for what’s coming\n\nIt’s quite clear to anyone paying attention that the following events are coming:\n\n1) A deep state false flag event to try to blame gun owners and anti-vaxxers. (Watch for the deep state to shoot up a clinic, murder a bunch of nurses, and try to blame anti-vaxxers.)\n\n2) A financial crisis of some kind, possibly bank holidays, accelerating hyperinflation or a dollar collapse.\n\n3) Social chaos across America when new videos and documents get released proving 2020 election fraud. (Bombshells coming soon our of Georgia and Arizona.)\n\nIt’s going to be a chaotic rest of the year, and 2022 promises to take the chaos even further with widespread vaccine deaths and collapsed supply lines. Plus there will be shortages, mass evictions, starvation and homelessness across America’s cities.", "opengraph": {"title": "Labor Day exclusive discounts and coupon codes (from multiple online retailers) for readers and listeners", "type": "article", "url": "http://www.bugout.news/2021-09-03-labor-day-exclusive-discounts-and-coupon-codes-from-multiple-online-retailers.html", "site_name": "Bugout News", "description": "We’ve gathered up some exclusive discounts and coupon codes for Labor Day sales on preparedness gear, survival supplies and other ...", "image": "http://www.bugout.news/wp-content/uploads/sites/45/2021/09/HRR-2021-09-03-Labor-Day-specials-and-discounts.jpg"}, "tags": ["emergency food", "Labor Day", "preparedness", "survival", "specials", "prepping", "food supply", "firearms", "Gear"], "tweets": [], "movies": [], "links": ["http://healthrangerstore.com/laborday", "http://DawsonKnives.com", "http://KaliKey.com", "http://www.Duty-Bound.net", "http://ICanGrowFood.com", "http://AR15parts.com", "https://palmettostatearmory.com/labor-day-sale.html", "http://Brighteon.com/46c08227-49e4-4292-936e-efccbf82cd2e"], "authors": ["Virgilio Marin"], "publish_date": "2021-12-14T19:50:43+00:00"}