{"result_id": "057001", "URL": "https://www.bugout.news/2022-07-18-trust-yourself-preparedness-actions-will-save-you-from-collapse.html", "timestamp": "2023-04-25 12:24:17 CEST+0200", "meta": {"description": "The well prepared will survive the horrors that are being unleashed against humanity. Even as the oblivious, unprepared masses are ...", "lang": "en", "keywords": "chaos,Collapse,currency collapse,depopulation,financial collapse,global reset,great reset,obey,preparedness,prepping,risk,survival,Tyranny", "favicon": "https://www.bugout.news/images/icon.ico", "canonical": "https://www.bugout.news/2022-07-18-trust-yourself-preparedness-actions-will-save-you-from-collapse.html", "encoding": "UTF-8"}, "image": null, "domain": "www.bugout.news", "title": "TRUST YOURSELF: The preparedness actions you are taking right now will SAVE you from the horrific collapse that’s approaching", "cleaned_text": "The well prepared will survive the horrors that are being unleashed against humanity. Even as the oblivious, unprepared masses are exterminated by the billions, there will also be billions who survive the carnage, and those people will be among the most resilient and prepared — people who saw what was coming, planned ahead and took action to navigate the chaos.\n\nIf you’ve been following this website and podcast for very long, consider yourself among the most informed human beings on planet Earth. You’re probably among the most well-prepared, too, as you have the knowledge, wisdom and courage to see what’s coming and take the necessary steps to mitigate the worst effects.\n\nHave confidence in your knowledge and faith in God. You are here in this moment of human history for a very important reason. God wants you to see this and be part of the great cosmic defeat of evil. Your role is extremely important, both in helping prepare others for what’s emerging right now and also in America after the coming collapse of the empire.\n\nRecognize how well off you are right now in terms of knowledge and preparedness action\n\nWhile the uninformed, low-information masses took experimental vaccine jabs that will kill tens of millions, you learned how to grow food and began stockpiling extra food supplies to avoid the engineered mass starvation that’s being rolled out.\n\nWhile the masses kept their fiat currency “savings” in banks, bonds and overpriced stocks, you sought out alternative systems of wealth preservation such as owning hard assets like gold, silver, land, vehicles, ammunition and real estate.\n\nWhile the oblivious masses kept their minds glued to the disinformation propaganda media like CNN, NPR, WashPost and NYT, you deliberately sought out truthful, honest, independent information from the indy media. As a result, you are well informed and well prepared to understand and navigate what’s really happening in the world.\n\nWhile the masses are confused and panicked as scarcity and inflation worsen, you have been expecting this so you don’t panic. Instead, you simply invoke the preparedness actions you’ve had ready far in advance of current events.\n\nThis is why people like you and I will survive what’s coming while the unprepared, uninformed, ignorant masses will be largely exterminated in the global depopulation purge of 2022 – 2030.\n\nIn today’s podcast, below, I give you a “Preparedness Self-Audit” checklist to help you confirm your readiness and wisdom in preparedness planning. This checklist will give you confidence and likely help you learn to trust yourself in knowing what to do next, because you are way ahead of the curve on all this. You are among the top 1% of the most informed and most prepared, and your survival is almost certainly assured as long as you follow your own plan and don’t let your guard down.\n\nIn today’s Situation Update podcast, I give you all the details on this and much more, including news coverage of the announcement that hematologists are ready to treat Americans for post-nuclear-war radiation poisoning at 74 centers across America. In addition, I reveal the name of the painter’s pigment powder that is recognized by the FDA as a treatment to remove radioactive cesium-137 isotopes from the human body.\n\nGet all this and more in today’s Situation Update podcast via Brighteon.com:\n\nDiscover more information-packaged podcasts, raw intel reports and interviews each day:\n\nBrighteon.social: Brighteon.social/@HealthRanger (my breaking news gets posted here first)\n\nTelegram: t.me/RealHealthRanger (breaking news is posted here second)\n\nJoin the free NaturalNews.com email newsletter to stay alerted about breaking news each day.\n\nDownload my current audiobooks — including Ghost World, Survival Nutrition, The Global Reset Survival Guide and The Contagious Mind — at:\n\nDownload my new audiobook, “Resilient Prepping” at ResilientPrepping.com – it teaches you how to survive the total collapse of civilization and the loss of both the power grid and combustion engines.", "opengraph": {"title": "TRUST YOURSELF: The preparedness actions you are taking right now will SAVE you from the horrific collapse that’s approaching", "type": "article", "url": "http://www.bugout.news/2022-07-18-trust-yourself-preparedness-actions-will-save-you-from-collapse.html", "site_name": "Bugout News", "description": "The well prepared will survive the horrors that are being unleashed against humanity. Even as the oblivious, unprepared masses are ...", "image": "http://www.bugout.news/wp-content/uploads/sites/45/2022/07/HRR-2022-07-18-Situation-Update-VIDEO.jpg"}, "tags": ["Tyranny", "prepping", "financial collapse", "currency collapse", "preparedness", "great reset", "risk", "depopulation", "obey", "chaos", "Collapse", "global reset", "survival"], "tweets": [], "movies": [], "links": ["http://Brighteon.com/e03bb1e4-125c-4dfa-a200-de4e40e785b6", "https://www.brighteon.com/channels/hrreport", "http://Brighteon.social/@HealthRanger", "https://t.me/RealHealthRanger", "https://truthsocial.com/@healthranger", "http://GETTR.com/user/healthranger", "http://Parler.com/user/HealthRanger", "https://Rumble.com/c/HealthRangerReport", "http://Bitchute.com/channel/9EB8glubb0Ns/", "http://app.clouthub.com/#/users/u/naturalnews/posts", "https://www.naturalnews.com/readerregistration.html", "https://audiobooks.naturalnews.com/", "http://ResilientPrepping.com", "https://www.addtoany.com/add_to/facebook?linkurl=%2Fbugout%2F2022-07-18-trust-yourself-preparedness-actions-will-save-you-from-collapse.html&linkname=TRUST%20YOURSELF%3A%20The%20preparedness%20actions%20you%20are%20taking%20right%20now%20will%20SAVE%20you%20from%20the%20horrific%20collapse%20that%E2%80%99s%20approaching", "https://www.addtoany.com/add_to/twitter?linkurl=%2Fbugout%2F2022-07-18-trust-yourself-preparedness-actions-will-save-you-from-collapse.html&linkname=TRUST%20YOURSELF%3A%20The%20preparedness%20actions%20you%20are%20taking%20right%20now%20will%20SAVE%20you%20from%20the%20horrific%20collapse%20that%E2%80%99s%20approaching", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fbugout%2F2022-07-18-trust-yourself-preparedness-actions-will-save-you-from-collapse.html&linkname=TRUST%20YOURSELF%3A%20The%20preparedness%20actions%20you%20are%20taking%20right%20now%20will%20SAVE%20you%20from%20the%20horrific%20collapse%20that%E2%80%99s%20approaching", "https://www.addtoany.com/share"], "authors": ["Mike Adams"], "publish_date": "2022-07-18T15:21:02+00:00"}