{"result_id": "058030", "URL": "https://campusinsanity.com/2022-09-08-teacher-arrested-imprisoned-using-wrong-student-pronouns.html", "timestamp": "2023-04-25 14:33:52 CEST+0200", "meta": {"description": "An Irish teacher faces punishment after he refused to address a transgender student as “they” due to his Christian religious convictions. Enoch Burke, who taught at Wilson’s Hospital School, was initially suspended for not playing the pronoun game with a gender dysphoric trans student who demanded that he be addressed grammatically incorrectly using the plural […]", "lang": "en", "keywords": "Christian,culture wars,Enoch Burke,fascism,freedom,gay mafia,gender confused,gender issues,identity politics,insanity,jail,left cult,LGBT,political correctness,prison,pronouns,Resist,social justice,Teacher,transhumanism,Tyranny,wokies", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://campusinsanity.com/2022-09-08-teacher-arrested-imprisoned-using-wrong-student-pronouns.html", "encoding": "UTF-8"}, "image": null, "domain": "campusinsanity.com", "title": "TRANS TYRANNY: Teacher arrested and IMPRISONED for using “wrong” student pronouns", "cleaned_text": "TRANS TYRANNY: Teacher arrested and IMPRISONED for using “wrong” student pronouns\n\nAn Irish teacher faces punishment after he refused to address a transgender student as “they” due to his Christian religious convictions.\n\nEnoch Burke, who taught at Wilson’s Hospital School, was initially suspended for not playing the pronoun game with a gender dysphoric trans student who demanded that he be addressed grammatically incorrectly using the plural pronoun. Burke was told by school officials to stay home and temporarily stop teaching.\n\nBurke refused and returned to the classroom in defiance, which prompted his arrest and imprisonment, we are told. (Related: A middle school teacher was accused of “harassing” students for refusing to expose them to explicit LGBT reading materials in her classroom.)\n\n“The heavy hand of the law is way too heavy here,” tweeted someone named Michael Barry about Burke’s arrest. “This is simply repressive and downright wrong.”\n\nWhile in court, Burke explained that he is facing all this persecution “because I said I would not call a boy a girl.”\n\nBurke deserves commendation for upholding his Christian religious convictions in the face of persecution\n\nBurke never wanted to go to jail, of course. He merely stood up for his own religious rights and was persecuted by the LGBT mafia as a result.\n\nIt turns out that Ireland has some pretty strict rules about playing the LGBT game. Any trans or other cultist can play the “hate crime” game and get a Christian like Burke in trouble for refusing to play along.\n\nSomehow the “right” of LGBTs supersede the rights of Christians, who are under no legal obligation to use made-up pronouns on demand.\n\nNo matter what happens to him next, Burke has indicated that he will not, under any circumstances, call a boy a girl – or vice versa.\n\n“I love my school,” Burke, who now sits in the Mountjoy Prison for contempt of court, said. “(But) it is not something I will do,” he added about calling a boy a girl.\n\n“It is in violation of my conscience.”\n\nA similar situation took place in Kansas where a middle school math teacher was told that she had to use “preferred gender pronouns” when demanded by students.\n\nPamela Ricard, the teacher in question, refused, instead calling two trans students by their legal names. She also refused to hide these students’ “transition” from their parents, having been told to use “dead” names around family members but preferred pronouns in the classroom.\n\nRicard’s refusal was dubbed a “violation,” according to the Geary County School District’s official policy. As a result, Ricard was suspended from her position, despite having worked at the school for 17 years.\n\nRicard proceeded to file a lawsuit against the Geary County School District over the matter that resulted in her receiving an award of $95,000 in damages. This is a major victory that hopefully sets a precedent across the country.\n\nIn her suit, Ricard argued, as Burke is also doing, that playing the LGBT pronouns game represents a violation of her Christian beliefs. It is also a violation of the United States Constitution, which Burke does not have as protection in Ireland.\n\n“She believes God created each person as male or female and that there are only two anatomical sexes (except in very rare medical circumstances),” one report explains about Ricard’s position. “She also said the Bible prohibits dishonesty and lying.”\n\nIn addition to having to pay Ricard $95,000, the school district changed is policy about communication with parents and issued a statement that Ricard remains in good standing as a teacher. Ricard is scheduled to retire in May.\n\nYou can keep up with the latest perversions coming out of the LGBT cult at Transhumanism.news.", "opengraph": {"title": "TRANS TYRANNY: Teacher arrested and IMPRISONED for using “wrong” student pronouns", "type": "article", "url": "https://www.campusinsanity.com/2022-09-08-teacher-arrested-imprisoned-using-wrong-student-pronouns.html", "site_name": "Campus Insanity Com", "description": "An Irish teacher faces punishment after he refused to address a transgender student as “they” due to his Christian religious convictions. Enoch Burke, who taught at Wilson’s Hospital School, was initially suspended for not playing the pronoun game with a gender dysphoric trans student who demanded that he be addressed grammatically incorrectly using the plural […]", "image": "https://www.campusinsanity.com/wp-content/uploads/sites/61/2022/09/LGBT-Censorship-Gender_165537588.jpg"}, "tags": ["left cult", "Resist", "gender issues", "prison", "gender confused", "identity politics", "pronouns", "Teacher", "culture wars", "Enoch Burke", "wokies", "social justice", "Christian", "LGBT", "insanity", "Tyranny", "political correctness", "fascism", "gay mafia", "transhumanism", "freedom", "jail"], "tweets": [], "movies": [], "links": ["https://100percentfedup.com/fight-for-freedom-teachers-risk-jobs-and-jail-for-refusing-to-violate-their-religious-convictions-by-using-preferred-pronouns-video/", "https://naturalnews.com/2021-07-15-teacher-accused-for-opposing-use-lgbtq-books.html", "https://archive.ph/5xIFD", "http://transhumanism.news", "https://100percentfedup.com/fight-for-freedom-teachers-risk-jobs-and-jail-for-refusing-to-violate-their-religious-convictions-by-using-preferred-pronouns-video/", "https://naturalnews.com/2021-07-15-teacher-accused-for-opposing-use-lgbtq-books.html", "https://archive.ph/5xIFD", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcampusinsanity%2F2022-09-08-teacher-arrested-imprisoned-using-wrong-student-pronouns.html&linkname=TRANS%20TYRANNY%3A%20Teacher%20arrested%20and%20IMPRISONED%20for%20using%20%E2%80%9Cwrong%E2%80%9D%20student%20pronouns", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}