{"result_id": "058036", "URL": "https://www.campusinsanity.com/2021-08-23-three-arrested-for-refusing-to-leave-school-premises.html", "timestamp": "2023-04-25 14:33:55 CEST+0200", "meta": {"description": "The Sahuarita police arrested three people for trespassing on Friday, August 13, after refusing to leave Walden Grove High School (WGHS). The people involved were a part of a larger group who wanted to meet with the school’s principal to discuss the attendance of a student who was prohibited from returning to school after possibly being […]", "lang": "en", "keywords": "Arizona,arrests,badhealth,badmedicine,campus insanity,coronavirus,covid-19,pandemic,police state,public education,public schools,quarantine,Sahuarita Unified School District,school policies,vaccinations", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.campusinsanity.com/2021-08-23-three-arrested-for-refusing-to-leave-school-premises.html", "encoding": "UTF-8"}, "image": null, "domain": "www.campusinsanity.com", "title": "OBEY OR ELSE: Police arrest 3 people for wanting to meet with school principal who barred a student from returning to class", "cleaned_text": "OBEY OR ELSE: Police arrest 3 people for wanting to meet with school principal who barred a student from returning to class\n\nThe Sahuarita police arrested three people for trespassing on Friday, August 13, after refusing to leave Walden Grove High School (WGHS). The people involved were a part of a larger group who wanted to meet with the school’s principal to discuss the attendance of a student who was prohibited from returning to school after possibly being exposed to a person who tested positive for COVID-19.\n\nA policy from the Sahuarita Unified School District requires persons subject to such exposures to leave school premises. The district posted on its website that individuals believed to have been in close or direct contact with a confirmed positive case will be contacted directly to take appropriate preventive health measures, which may include isolation or quarantine.\n\nThe number of days of the separation varies on whether or not the person obtains a negative COVID-19 test.\n\nAccording to the police, the group met briefly with the WGHS principal, Teresa Hill, who asked them to leave the school grounds. The group refused, even after police arrived to mediate a solution. They were said to mainly be in the lobby of the school’s business office, and school staff wanted trespassing enforced on the group for refusing to leave the school.\n\nPolice also said that the group was informed that they will be facing arrests for failing to leave the property.\n\nAmong those arrested were a juvenile and two adults. The adults were identified to be the juvenile’s parents. The family did not consider the juvenile to be suffering from an illness and insisted she go back to school. However, the police carried out the policy of the school district and arrested, booked and released the individuals with a citation. (Related: Excluding Unvaccinated Children from School During Outbreaks: Standard Policy, But is it Legal?.)\n\nSchool boards across the country debated mask mandates and other safety restrictions for the “new normal.” Some parents pressured local officials to require masks in defiance of laws while others argue masks should not be required.\n\nAnna Penola, a parent of four, told the Michigan State Board of Education that “The parents need to be the boss of what’s best for their children.”\n\nIn another state, Mike Siegel, a parent of two in Austin, Texas, urged his county to require masks as the issue is “a matter of life and death.”\n\nHealth authorities say that the delta variant of the coronavirus has run rampant in the country, with more and more children becoming infected and ending up in hospitals. More than 90 percent of COVID-19 cases affecting children are now caused by the variant.\n\nIn Arizona, the Chandler Unified School District No. 80 modified its quarantine policy, allowing students who have been exposed to COVID-19 the option to quarantine for up to 10 days; however, this has not been mandated, unless there are symptoms, or if the county reaches high community spread at the same time as the campus spread of above one to two percent, depending on the grade level. Governor Doug Ducey’s education policy adviser demanded that school districts change their policies to quarantine unvaccinated students who are exposed to COVID-19, arguing that it violates state law that prohibits districts from mandating masks or vaccinations.\n\nThe disputes have not been clearly resolved as school districts are keeping their quarantine policies, and have had no further contact from the governor’s office.\n\nThe Arizona Department of Health Services director, Dr. Cara Christ, said that school districts are encouraged to use a variety of tools to keep schools safe, and this could include social distancing and quarantine policies.\n\n“Asymptomatic vaccinated people may be exempted from quarantine,” she said.\n\nRead more updates about the COVID-19 effects on the school systems at Pandemic.news.", "opengraph": {"title": "OBEY OR ELSE: Police arrest 3 people for wanting to meet with school principal who barred a student from returning to class", "type": "article", "url": "https://www.campusinsanity.com/2021-08-23-three-arrested-for-refusing-to-leave-school-premises.html", "site_name": "Campus Insanity Com", "description": "The Sahuarita police arrested three people for trespassing on Friday, August 13, after refusing to leave Walden Grove High School (WGHS). The people involved were a part of a larger group who wanted to meet with the school’s principal to discuss the attendance of a student who was prohibited from returning to school after possibly being […]", "image": "https://www.campusinsanity.com/wp-content/uploads/sites/61/2021/08/Coronavirus-Children-School-Learning.jpg"}, "tags": ["pandemic", "covid-19", "quarantine", "Arizona", "arrests", "school policies", "public education", "vaccinations", "public schools", "coronavirus", "Sahuarita Unified School District", "campus insanity", "police state"], "tweets": [], "movies": [], "links": ["https://nationalfile.com/teen-girl-arrested-with-parents-for-trespassing-for-trying-to-go-to-school/", "https://susd30.us/2021/08/04/2021-2022-covid-dashboard/?utm_source=rss&utm_medium=rss&utm_campaign=2021-2022-covid-dashboard", "https://www.naturalnews.com/045897_schoolchildren_forced_vaccinations_pandemic_outbreaks.html", "https://www.usatoday.com/story/news/nation/2021/08/15/school-mask-mandates-spark-protests-parents-covid-cases-rise/8124375002/", "https://www.azcentral.com/story/news/local/arizona-education/2021/07/20/arizona-school-districts-weigh-covid-19-rules-students-return/8013405002/", "http://pandemic.news", "https://nationalfile.com/teen-girl-arrested-with-parents-for-trespassing-for-trying-to-go-to-school/", "https://www.usatoday.com/story/news/nation/2021/08/15/school-mask-mandates-spark-protests-parents-covid-cases-rise/8124375002/", "https://www.azcentral.com/story/news/local/arizona-education/2021/07/20/arizona-school-districts-weigh-covid-19-rules-students-return/8013405002/"], "authors": [], "publish_date": null}