{"result_id": "058014", "URL": "https://campusinsanity.com/2023-03-23-university-of-helsinki-awards-doctorate-greta-thunberg.html", "timestamp": "2023-04-25 14:33:40 CEST+0200", "meta": {"description": "The University of Helsinki in Finland has announced that this year’s Conferment Jubilee ceremony, which began on March 20, includes the issuance of an honorary Doctorate of Theology to climate activist Greta Thunberg. On June 9, Thunberg will be awarded her Doctorate of Theology alongside various professors and bishops. In essence, the school is treating […]", "lang": "en", "keywords": "absurd,Climate,climate alarmism,climate change,doctorate,global warming,green,green tyranny,greta thunberg,honorary doctorate,insanity,left cult,PhD,religion,theology,University of Helsinki", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://campusinsanity.com/2023-03-23-university-of-helsinki-awards-doctorate-greta-thunberg.html", "encoding": "UTF-8"}, "image": null, "domain": "campusinsanity.com", "title": "CLIMATE CULT CLOWNS: University of Helsinki awards Greta Thunberg an honorary doctorate in THEOLOGY for her evangelical work in converting world to “green” religion", "cleaned_text": "CLIMATE CULT CLOWNS: University of Helsinki awards Greta Thunberg an honorary doctorate in THEOLOGY for her evangelical work in converting world to “green” religion\n\nThe University of Helsinki in Finland has announced that this year’s Conferment Jubilee ceremony, which began on March 20, includes the issuance of an honorary Doctorate of Theology to climate activist Greta Thunberg.\n\nOn June 9, Thunberg will be awarded her Doctorate of Theology alongside various professors and bishops. In essence, the school is treating the global warming fanatic like some kind of religious prophet whose efforts to scare everyone about climate change have apparently contributed greatly to the spread of the “green” religion around the world.\n\nReports indicate that Thunberg will receive the title of “doctor honoris causa” at the University of Finland, this being its highest recognition.\n\n“Among the most high-profile names included in the list was Sauli Niinistö, Finland’s president since 2012, who has been appointed an honorary doctorate in philosophy,” reported Fox News‘ Bradford Betz about the announcement.\n\n“The ceremony is part of Finland’s centuries-old Conferment of Jubilee, in which individuals are recognized for their professional and artistic achievements … Thunberg, a world-recognized climate protester from Sweden, was previously appointed an honorary doctorate at the Belgian University of Mons.”\n\nDo you trust Pastor Greta to save you from the climate apocalypse she feels is coming?\n\nAs you may recall, Thunberg also received a prominent accolade from TIME magazine in 2019, having been named its “Person of the Year” for her efforts to raise awareness about global warming.\n\nThunberg first launched to fame following a speech she delivered to world leaders at the United Nations (UN) while she was still a teenager. Thunberg scolded the room for refusing to put an end to “eternal economic growth,” which she hysterically claimed is responsible for a coming “mass extinction” event.\n\n“How dare you!” Thunberg howled as crocodile tears began to form in her eyes. “You have stolen my dreams and my childhood with your empty words, and yet, I am one of the lucky ones.”\n\nThe University of Helsinki’s announcement about Thunberg’s Doctorate of Theology award comes at the same time that a Swedish court has given her and hundreds of other climate extremists the go-ahead to proceed with a class-action lawsuit against the Swedish state for “insufficient climate policy.”\n\nThunberg, along with about 600 other extremists who belong to a global warming group called Aurora, filed a lawsuit against the Swedish government back in November. Their claim is that not enough is being done in Sweden to fight global warming and live up to the European Convention on Human Rights.\n\nIn the comments, numerous readers suggested that the University of Helsinki just massively devalued its degrees, which are now worth “zero,” due to its embrace of Thunberg as some kind of globalist-approved “Pastor Greta” who will teach the world the gospel of “green.”\n\n“Whoopi Goldberg says that Greta is a wonderful surgeon,” joked another about the ridiculousness of this whole situation – because why not also give Thunberg a medical degree while they are at it? “I hear that Greta will be performing gastric bypass surgery on Whoopi in Juarez, Mexico. That would be fun to watch.”\n\nAnother took pity on Thunberg for embracing all the laud and praise she is receiving, which is exploitative to the core.\n\n“Poor Greta,” this person wrote. “She had to drop out of middle school because her autism prevented her from coping with rigorous classes. But that does not stop her from lecturing us all on a field that she is clueless about.”\n\nThe latest news about this and other ridiculous clown world events can be found at ROFL.news.", "opengraph": {"title": "CLIMATE CULT CLOWNS: University of Helsinki awards Greta Thunberg an honorary doctorate in THEOLOGY for her evangelical work in converting world to “green” religion", "type": "article", "url": "https://www.campusinsanity.com/2023-03-23-university-of-helsinki-awards-doctorate-greta-thunberg.html", "site_name": "Campus Insanity Com", "description": "The University of Helsinki in Finland has announced that this year’s Conferment Jubilee ceremony, which began on March 20, includes the issuance of an honorary Doctorate of Theology to climate activist Greta Thunberg. On June 9, Thunberg will be awarded her Doctorate of Theology alongside various professors and bishops. In essence, the school is treating […]", "image": "https://www.campusinsanity.com/wp-content/uploads/sites/61/2023/03/Greta-Thunberg-eco-fascist.png"}, "tags": ["Climate", "climate change", "doctorate", "honorary doctorate", "PhD", "left cult", "religion", "insanity", "absurd", "theology", "greta thunberg", "green tyranny", "global warming", "green", "University of Helsinki"], "tweets": [], "movies": [], "links": ["http://www.helsinki.fi", "https://www.helsinki.fi/en/news/science-policy/thirty-new-honorary-doctorates-be-conferred-conferment-jubilee", "https://www.foxnews.com/world/greta-thunberg-receive-honorary-doctorate-finnish-university", "https://web.umons.ac.be/en/", "http://rofl.news", "https://www.helsinki.fi/en/news/science-policy/thirty-new-honorary-doctorates-be-conferred-conferment-jubilee", "https://www.foxnews.com/world/greta-thunberg-receive-honorary-doctorate-finnish-university", "https://naturalnews.com/2020-05-14-cnn-adds-greta-thunberg-to-its-expert-coronavirus-panel.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcampusinsanity%2F2023-03-23-university-of-helsinki-awards-doctorate-greta-thunberg.html&linkname=CLIMATE%20CULT%20CLOWNS%3A%20University%20of%20Helsinki%20awards%20Greta%20Thunberg%20an%20honorary%20doctorate%20in%20THEOLOGY%20for%20her%20evangelical%20work%20in%20converting%20world%20to%20%E2%80%9Cgreen%E2%80%9D%20religion", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}