{"result_id": "058011", "URL": "https://campusinsanity.com/2022-01-17-uchicago-must-end-its-booster-mandate.html", "timestamp": "2023-04-25 14:33:38 CEST+0200", "meta": {"description": "Per the University of Chicago’s newly announced booster mandate, all students and employees must obtain a booster shot by January 24. Those who do not comply will be barred from campus and restricted from attending in-person classes, among other activities. (Article republished from TheChicagoThinker.com) This booster mandate is demonstrably unsafe, ineffective, unnecessary, inconsistent, and unethical. We’ve struggled beneath UChicago’s […]", "lang": "en", "keywords": "badhealth,badmedicine,Big Pharma,booster mandate,boosters,campus insanity,COVID,medical fascism,Medical Tyranny,pandemic,pharmaceutical fraud,public schools,UChicago,vaccine damage,vaccine injury,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://campusinsanity.com/2022-01-17-uchicago-must-end-its-booster-mandate.html", "encoding": "UTF-8"}, "image": null, "domain": "campusinsanity.com", "title": "Editorial: UChicago must end its booster mandate … we are not lab rats", "cleaned_text": "Editorial: UChicago must end its booster mandate … we are not lab rats\n\nPer the University of Chicago’s newly announced booster mandate, all students and employees must obtain a booster shot by January 24. Those who do not comply will be barred from campus and restricted from attending in-person classes, among other activities.\n\nThis booster mandate is demonstrably unsafe, ineffective, unnecessary, inconsistent, and unethical. We’ve struggled beneath UChicago’s draconian COVID decrees for years, but the university’s booster mandate reaches a new height of absurdity.\n\nUChicago claims to rely upon “expert” opinion in structuring its COVID regime. Yet, even advisory committees at the FDA and CDC initially declined to recommend the COVID booster for those under the age of 65.\n\nThe FDA’s Vaccines and Related Biological Products Advisory Committee made an official recommendation to approve Pfizer’s application for boosters only for those 65 and older and certain high-risk populations after rejecting, in a 16-2 vote, Pfizer’s application for broader approval for the general population. The committee cited a lack of data on potential adverse effects, particularly the risks of developing myocarditis and pericarditis.\n\nHowever, the FDA chose to cast aside this concern and granted “approval” anyways. ??But even this “approval” is itself questionable. The FDA only granted approval to Comirnaty, a legally distinct version of the Pfizer-BioNtech vaccine that isn’t actually available in the United States. The version of the vaccine currently available in the US remains under Emergency Use Authorization, not formal approval.\n\nSimilarly, the CDC’s initial recommendation that Americans under the age of 65 receive boosters was made against the counsel of its own Advisory Committee on Immunization Practices, which voted to recommend boosters only for those over the age of 65 or who have underlying conditions. Director Rochelle Walensky overruled this vote in an unusual departure from agency protocol. The committee later reversed course, recommending a booster for 12-17 year olds. But the calculus behind its sudden 180-degree turn remains unclear, given that the initial concerns regarding myocarditis and pericarditis remain unresolved.\n\nVaccine-induced heart issues merit legitimate concern, especially for young males. A recent Danish study found that “??pharmacovigilance reports, health system surveillance studies, and case series suggest an association between SARS-CoV-2 vaccination and myocarditis and myopericarditis. This association is thought to occur particularly after the second booster dose of mRNA vaccines BNT162b2 (Pfizer-BioNTech) and mRNA-1273 (Moderna).” An analysis published in the New England Journal of Medicine reached similar conclusions, particularly in males between the ages of 12 and 29.\n\nMeanwhile, a new study published in the journal Obstetrics & Gynecology found a positive association between COVID vaccination and increased menstrual cycle length.\n\nAccording to Diana Bianchi, director of the National Institute of Child Health and Human Development, “Nobody expected [the COVID vaccine] to affect the menstrual system, because the information wasn’t being collected in the early vaccine studies.” The study’s authors note that “questions remain about other possible changes in menstrual cycles, such as menstrual symptoms, unscheduled bleeding, and changes in the quality and quantity of menstrual bleeding.”\n\nIronically, despite the speed with which the vaccine and booster have been infallibly declared “safe and effective” in disregard for potential long-term risks, the FDA is in no such rush to release its data on the vaccine.\n\nAccording to the FDA’s statement on expanding eligibility for boosters to individuals 18 years of age and older, “Both Pfizer and Moderna are conducting post-authorization/post-marketing studies to assess known serious risks of myocarditis and pericarditis.” However, a post-authorization study is useless if everyone has already been boosted 50 times by the time the study is complete.\n\nThe Public Health and Medical Professionals for Transparency (PHMPT) filed a formal request to the FDA for the expedited release of all data on the Pfizer vaccine under the Freedom of Information Act. Members of PHMPT include well-established professors in the relevant fields from Yale, Brown, University of Maryland, UCLA, and other universities. The FDA denied this request, arguing the absence of a “compelling need.”\n\nIn fact, the FDA requested that a federal judge grant it until the year 2076 to release Pfizer’s data on the COVID vaccine, before it was recently ordered to release it all in eight months.\n\nDespite the lack of transparency, and the booster’s observed and potential adverse health effects, UChicago forces its students and employees to accept its cost-benefit analysis: that the booster is “preferable” to the risk of contracting COVID while unboosted. In so doing, our anti-science university unsafely denies us the right to evaluate the cost-benefit analysis for ourselves.\n\nDon’t Be Fooled! It’s Not Just One More Jab\n\nIf being “boosted” becomes a prerequisite for participation in normal life, the vaccine’s diminishing efficacy means the booster campaign will never end.\n\nComprehensive evidence suggests that the level of vaccination does not have a positive influence on lowering COVID cases. On these very lines, CDC Director Rochelle Walensky contended in August that vaccines no longer prevent transmission, despite confident promises she and many of her fellow “experts” previously made to the contrary.\n\nMoreover, the original vaccine regime has proven ineffective over time, with another Israeli study showing that effectiveness declined from 95% in January to a mere 39% in June.\n\nWhen first introduced, the boosters were posited as a way to rebuild the vaccine’s effectiveness. Yet, the COVID booster contains the same formula as the original, ineffective vaccinations, which means it, too, loses efficacy.\n\nTo this point, Cornell, which currently has both a mask and vaccine requirement, and a 97% on-campus vaccination rate, recently experienced a surge of COVID cases. In response, the administration declared an “Alert Level Red” zone, moved exams online, and shut down the campus. Out of the 930 confirmed cases, “Virtually every case of the Omicron variant to date has been found in fully vaccinated students, a portion of whom had also received a booster shot,” Vice President for University Relations Joel Malina stated.\n\nIf UChicago is planning to mandate recurring boosters (which is the only logical conclusion of its present decrees), then it should just own up and admit it immediately, rather than continue to deceive students with the false impression that these measures are temporary.\n\nWe Will Not Play Pretend—COVID Is Not the Plague\n\nMandates for the COVID vaccine and booster are unnecessary to protect the health of the UChicago community.\n\nCOVID has a survival rate of over 99.87% for individuals under the age of 65.\n\nAccording to the CDC, only 5% of “COVID deaths” are solely attributable to COVID as the cause. The other 95% of “COVID deaths” involve, on average, almost 4 additional conditions (comorbidities) or causes per death.\n\nWe will not play pretend by accepting our university’s gross exaggerations of the public health risks of catching and transmitting COVID. We will not live in fear.\n\nIf slowing the spread of this glorified flu were the goal, UChicago would recognize natural immunity as a robust protection against reinfection—but it doesn’t.\n\nAs it stands, UChicago’s vaccine requirement cannot be satisfied with proof of T-cell immunity or a positive antibody or antigen test. This is unreasonable, as those who have been vaccinated not only have increased risk for infection, but an increased risk for symptomatic infection, in comparison to those possessing natural immunity.\n\nThis is made clear by a recent Israeli study, which “demonstrated that natural immunity confers longer lasting and stronger protection against infection, symptomatic disease and hospitalization caused by the Delta variant of SARS-CoV-2, compared to the BNT162b2 two-dose vaccine-induced immunity.”\n\nUChicago’s continued refusal to acknowledge natural immunity leads to only one conclusion: our university does not care about science, but only uses “science” as a guise for mandating recurring injections.\n\nNo, You Didn’t Misread: Doctors and Scientists Are Exempt (Read the Fine Print)\n\nThe Chicago Thinker recently confirmed that the university exempts University of Chicago Medical Center (UCMC) employees from the booster mandate, precisely because a significant number of doctors will resign if forced to get the jab. The university admitted to the Thinker that its UCMC exemption is an attempt to maintain medical staff, since presumably a significant number of UCMC’s 9,000-plus employees will resign if beholden to a booster mandate.\n\nUChicago also exempts clinically active faculty and staff within its Biological Sciences Division (BSD) from its booster mandate, presumably for the same reason.\n\nThe lessons here are manifold.\n\nFirst, UChicago is much less immune to protest than it pretends. If we speak out loudly now, we might just accomplish something.\n\nSecond, “the science” isn’t what the university claims and it’s actually bad business to pretend otherwise.\n\nConsider that the UCMC’s total staff is larger than the total undergraduate population at UChicago. If our university truly believes the COVID booster is necessary to save lives, why are UCMC staff—who are arguably most at risk for catching and spreading the coronavirus—exempt from the booster mandate? The answer is clear: even the university itself doesn’t believe “the risks” posed by un-boostered employees outweigh the costs of losing crucial personnel.\n\nRather than allow all UChicago community members to engage in a cost-benefit analysis of our own, the university deceptively exploits tuition payers, in addition to countless employees, by forcing us to get the booster. Meanwhile, UChicago’s world-renowned medical health professionals and scientists get to live quietly by a different set of rules.\n\nMoreover, the UCMC and BSD include some of the country’s top doctors and scientists, including experts in immunology. Take that in: Those who know the most about the booster are refusing to get it. What do these experts know about the booster that we don’t? And if they’re refusing to inject themselves with the booster, how is it remotely ethical to force us to inject ourselves? It’s not.\n\nUChicago’s COVID caste system prioritizes the health and freedoms of a chosen few, while trampling on the rest. University instructors and tenured faculty members, University of Chicago police officers, dining hall workers, and twenty-something-year-old college students are all being coerced into getting the booster, but not doctors and select, “special” scientists.\n\nObviously, we need instructors in order to learn. Three UChicago community members were shot to death in Chicago in 2021 alone, so, clearly, we also need police officers to defend our community. Yet, by imposing such a discriminatory mandate, our university wrongly suggests some lives are more valuable than others. Or, at the very least, it shows it cares more about maintaining doctors and select scientists than professors and police officers, among others.\n\nTo be clear, we’re not calling for the UCMC and BSD to implement a booster requirement, but we do condemn UChicago for unethically discriminating against its employees and students. We’d expect such behavior from a Soviet committee, not a prestigious university purportedly dedicated to the production of knowledge in a free country.\n\nThis Isn’t Just Bad Science—It’s Also Wildly Unethical\n\nUChicago directly violates established medical ethics by coercing its community members into experimental vaccination.\n\nFree and informed consent is a precondition for all medical treatments and procedures, including vaccination. For consent to be truly informed, the potential recipient must be proactively informed of all the observable and potential risks, side-effects, and dangers. And for consent to be truly free, the potential recipient must be made aware of all options, including the option to freely decline. Most importantly, this decision must be free of coercion, pressure, or threat of punishment.\n\nFor the first time in history, universities like our own are requiring experimental vaccination as a condition of attendance and employment.\n\nThe university’s threat of expulsion constitutes unjustifiable pressure, especially considering the vaccine’s experimental nature; this absolutely qualifies as an element of “duress,” “overreaching,” and “coercion.”\n\nTo make matters worse, we find ourselves in a position where those who wish to infringe upon our bodily autonomy have relieved themselves of the responsibility of even having to prove their scientific assertions. Instead, they’ve shifted the burden of proof onto us; we must conclusively demonstrate why their hypochondriacal impositions do not make sense, which is a total inversion of the normal process of scientific inquiry.\n\nRather than allow us to engage in the intimately personal and inherently subjective process of making our own risk-assessments concerning these novel injections, UChicago refuses to allow us to freely consent or decline. Instead, it treats us like lab rats.\n\nThe yes-men will try to interject that we can all apply for exemptions and disenroll from UChicago if denied, but this counterargument is as immoral as it is lousy.\n\nFirst, universities across the country, including UChicago, have consistently announced their new COVID policies on a whim—not even leaving students the time or ability to create contingency plans. Second, choosing a college isn’t a game of plug-and-play. It’s a process that entails a significant investment of hard work, time, financial resources, and effort to find the right match.\n\nTo tell a student who has invested two or three years of hard work and over $100,000 in tuition to attend UChicago that he must suddenly find a way to transfer to a school in a different state—a school that might not even be able to properly accommodate his specific academic interests and career track—in the middle of his winter quarter is ludicrous.\n\nFor the past two academic years, we’ve endured mandatory weekly invasive COVID testing; a laundry list of restrictions on movement and socialization enforced by a suffocating surveillance-and-reporting apparatus; needless quarantines in dorm rooms, even after testing negative; lackluster online classes; barred access to countless campus amenities and resources, including libraries and gyms; and, now, vaccine and booster requirements with limited exemptions, all while footing the same $60,000+ in annual tuition.\n\nWe went along with these initial edicts for convenience’s sake, perhaps contending that compliance in the short term would mean a long-term return to normalcy.\n\nWe rationalized that after bearing one year of Zoom classes to “slow the spread,” we’d finally be able to enjoy the state-of-the-art research facilities, nerdy camaraderie, and beautiful campus we were attracted to when we first applied to UChicago.\n\nIf we got the vaccine, we thought we’d finally be able to take off our masks and breathe, sit in a classroom with our friends, hang out in our dorms, and go to parties.\n\nThose who thought we’d be free to enjoy the normal college experience we so desperately wanted if we just got the first two vaccine doses were completely wrong. This isn’t over. It’s only just begun.\n\nWe’ve become lab rats in a perpetual war against a glorified flu—and there’s no end in sight. UChicago continues to defy scientific and moral standards, dehumanizing us in the process.\n\nClearly, this is not about saving lives. It’s about control. We will not be controlled.\n\nOur demands are as follows:\n\n1. We demand that the University of Chicago withdraw its unsafe, ineffective, unnecessary, inconsistent, and unethical vaccine and booster mandates.\n\n2. We demand that the university name those responsible for creating and implementing its COVID decrees, especially with regards to vaccination. We also demand it name those responsible for reviewing and approving both medical and religious exemptions to vaccine and booster mandates.\n\n3. We demand that the university make a public statement to all community members explaining why UCMC staff and BSD personnel are not required to receive boosters, but students and other university employees are.\n\n4. Lastly, we call on all members of our university community to fight back. This mandate is wrong. Do not allow University President Paul Alivisatos’s administration to pretend otherwise.\n\nThe 2021-2022 Editorial Board of the Chicago Thinker:", "opengraph": {"title": "Editorial: UChicago must end its booster mandate … we are not lab rats", "type": "article", "url": "https://www.campusinsanity.com/2022-01-17-uchicago-must-end-its-booster-mandate.html", "site_name": "Campus Insanity Com", "description": "Per the University of Chicago’s newly announced booster mandate, all students and employees must obtain a booster shot by January 24. Those who do not comply will be barred from campus and restricted from attending in-person classes, among other activities. (Article republished from TheChicagoThinker.com) This booster mandate is demonstrably unsafe, ineffective, unnecessary, inconsistent, and unethical. We’ve struggled beneath UChicago’s […]", "image": "https://www.campusinsanity.com/wp-content/uploads/sites/61/2022/01/Covid-19-Montage-Vaccine-Syringe.jpg"}, "tags": ["pandemic", "vaccine wars", "medical fascism", "Big Pharma", "COVID", "UChicago", "vaccine injury", "Medical Tyranny", "public schools", "vaccines", "vaccine damage", "booster mandate", "boosters", "campus insanity", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://thechicagothinker.com/uchicago-hospital-employees-dont-have-to-get-covid-19-booster-shot-but-students-do/", "https://goforward.uchicago.edu/faqs#vac-requirements", "https://thechicagothinker.com/editorial-uchicago-must-end-its-booster-mandate-we-are-not-lab-rats/", "https://www.pfizer.com/news/press-release/press-release-detail/fda-advisory-committee-votes-unanimously-favor-comirnatyr", "https://www.statnews.com/2021/09/17/tracking-the-fda-advisory-panel-meeting-on-covid-19-booster-shots/", "https://www.cnn.com/2021/09/17/health/fda-advisers-booster-five-things/index.html", "http://ronpaulinstitute.org/archives/featured-articles/2021/december/29/bait-and-switch-there-remains-no-fda-approved-covid-vaccine-in-the-united-states/", "https://www.nytimes.com/2021/09/24/world/covid-boosters-vaccine-cdc-director.html", "https://www.statnews.com/2022/01/05/cdc-advisers-recommend-teens-should-receive-covid-booster/", "https://www.statnews.com/2022/01/05/cdc-advisers-recommend-teens-should-receive-covid-booster/", "https://www.bmj.com/content/375/bmj-2021-068665", "https://www.nejm.org/doi/full/10.1056/NEJMoa2110737", "https://nypost.com/2022/01/07/covid-vaccine-can-lengthen-the-menstrual-cycle-study/", "https://nypost.com/2022/01/07/covid-vaccine-can-lengthen-the-menstrual-cycle-study/", "https://journals.lww.com/greenjournal/Fulltext/9900/Association_Between_Menstrual_Cycle_Length_and.357.aspx", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-expands-eligibility-covid-19-vaccine-boosters#:~:text=Today's%20action%20expands%20the%20use,after%20completion%20of%20primary%20vaccination", "https://fingfx.thomsonreuters.com/gfx/legaldocs/klvykdlryvg/vaccine%20foia%20complaint.pdf", "https://www.reuters.com/legal/government/wait-what-fda-wants-55-years-process-foia-request-over-vaccine-data-2021-11-18/", "https://www.reuters.com/legal/government/paramount-importance-judge-orders-fda-hasten-release-pfizer-vaccine-docs-2022-01-07/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8481107/", "https://www.realclearpolitics.com/video/2021/08/06/cdc_director_vaccines_no_longer_prevent_you_from_spreading_covid.html", "http://ronpaulinstitute.org/archives/featured-articles/2021/december/20/memory-hole-virtually-every-major-health-official-in-the-united-states-has-claimed-that-covid-shots-stop-the-virus/", "https://www.nytimes.com/2021/07/23/science/covid-vaccine-israel-pfizer.html", "https://thehill.com/policy/healthcare/587212-uk-health-agency-report-suggests-booster-effectiveness-against-omicron", "https://www.yahoo.com/entertainment/cornell-university-over-900-covid-220134550.html", "https://brownstone.org/articles/patriotic-duty-my-eye/", "https://www.cdc.gov/nchs/nvss/vsrr/covid_weekly/index.htm", "https://www.medrxiv.org/content/10.1101/2021.08.24.21262415v1", "https://thechicagothinker.com/uchicago-hospital-employees-dont-have-to-get-covid-19-booster-shot-but-students-do/", "https://thechicagothinker.com/breaking-recent-uchicago-graduate-shot-and-killed-at-54th-place-and-ellis/", "https://www.sfcatholic.org/bishop-degrood/covid-19-vaccination-requirements/", "https://www.wsj.com/articles/dangerous-push-to-give-boosters-to-teens-vacccine-covid-19-omicron-vaxx-requirement-mandate-11640107759", "https://www.hhs.gov/ohrp/regulations-and-policy/belmont-report/read-the-belmont-report/index.html", "https://research.unc.edu/human-research-ethics/resources/ccm3_019064/", "https://thechicagothinker.com/university-administrators-need-to-stop-infantilizing-college-students-with-communist-covid-rules/", "https://thechicagothinker.com/science-proves-fitness-protects-against-covid-but-uchicago-makes-it-impossible-to-work-out/", "https://thechicagothinker.com/university-of-chicago-mandates-covid-vaccine-for-all-students/", "https://financialaid.uchicago.edu/undergraduate/costs", "https://thechicagothinker.com/editorial-uchicago-must-end-its-booster-mandate-we-are-not-lab-rats/"], "authors": [], "publish_date": null}