{"result_id": "058024", "URL": "https://campusinsanity.com/2021-12-16-highly-vaccinated-cornell-university-shuts-down-campus.html", "timestamp": "2023-04-25 14:33:47 CEST+0200", "meta": {"description": "Well-vaccinated Cornell University is forced to shut down just a few days before the end of the semester due to a recent surge of the Wuhan coronavirus (COVID-19). According to the Ivy League school’s website, 97 percent of the overall population on the Ithaca, New York campus are fully vaccinated – including 100 percent of professional faculty, 93 percent […]", "lang": "en", "keywords": "badhealth,badmedicine,Big Pharma,campus insanity,Cornell University,coronavirus,covid-19,deception,fully vaccinated,immune system,immunocompromised,infections,omicron,outbreak,pandemic,pharmaceutical fraud,propaganda,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://campusinsanity.com/2021-12-16-highly-vaccinated-cornell-university-shuts-down-campus.html", "encoding": "UTF-8"}, "image": null, "domain": "campusinsanity.com", "title": "Highly vaccinated Cornell University SHUTS DOWN campus due to COVID-19 surge", "cleaned_text": "Well-vaccinated Cornell University is forced to shut down just a few days before the end of the semester due to a recent surge of the Wuhan coronavirus (COVID-19).\n\nAccording to the Ivy League school’s website, 97 percent of the overall population on the Ithaca, New York campus are fully vaccinated – including 100 percent of professional faculty, 93 percent of other employees and 99 percent of undergraduate students.\n\nCornell University President Martha Pollack said on Tuesday, Dec. 14, that final exams will be held online after the university’s surveillance testing found that COVID-19 continues to spread to its well-vaccinated population. There are currently 469 active student cases, including 214 newly confirmed positives.\n\nPollack said the lab team detected the highly-transferrable omicron variant in a significant number of student samples. “While faculty and staff case numbers currently remain low, just last evening our COVID-19 testing lab team identified evidence of the highly contagious omicron variant in a significant number of Monday’s [Dec. 13] positive student samples,” she said.\n\nAll university activities involving undergraduates and all university-sponsored events, including the Dec. 18 graduation ceremony, will be canceled. Libraries and gyms will be closed. Students are also advised to get a negative COVID-19 test result before any travel. Visitors and guests are not allowed on campus, except those coming to pick up students for break.\n\n“Any student who has not tested negative in the past 48 hours should get a supplemental test as soon as possible,” Pollack said. “Students are encouraged to stay in Ithaca, in their residences, until their test results are received, and severely limit interactions with others during that time.”\n\nPollack said the university has suspended all classes, and that students have until March 29 to move out – except international students who cannot return home. Undergraduate students and professional master’s students with research or other projects will not be able to continue them on campus. Cornell had already imposed strict measures in hopes of limiting the spread of the virus prior to Pollack’s announcements.\n\nAccording to Pollack, Cornell has a role in reducing the spread of the disease in the broader community.\n\n“While I want to provide reassurance that, to date, we have not seen severe illness in any of our infected students, we do have a role to play in reducing the spread of the disease in the broader community,” Pollack said. “The fact that we have not experienced severe illness among our student population may lead some to ask why we are imposing such serious steps.”\n\nMore than a dozen U.S. states have reported omicron variant cases earlier this month.\n\nAmong the measures implemented are the wearing of mask at all times indoor regardless of vaccination status, except when eating or drinking or alone in a private space like an office or a dorm room. The few remaining unvaccinated students are required to maintain a six-foot physical distance with others whenever possible.\n\nAs of Dec. 12, New York Gov. Kathy Hochul’s office has reported 38 confirmed omicron cases across the state, including two in Tompkins County, where Cornell is located.\n\nA new study conducted by Pfizer researchers found that breakthrough COVID-19 cases are more common and severe in people with weakened immune systems. Breakthrough infections are those that occur in vaccinated people.\n\nThey analyzed nearly 1.2 million records from the HealthVerity database and published their findings in the Journal of Medical Economics.\n\nThe researchers found that immunocompromised vaccinated people were three times more likely to contract COVID-19. While immunocompromised people only represented 18 percent of those studied, they accounted for over 38 percent of infections, nearly six in 10 hospitalizations and all the deaths. (Related: Smoking gun: Pfizer logs 1,223 deaths, 42,086 adverse reactions after just three months of vaccine rollout.)\n\n”The results supplement other real-world studies, and support the introduction of a third dose of a COVID-19 vaccine to increase protection among the immunocompromised individuals,” Manuela Di Fusco, the lead author and a part of Pfizer’s health economics and outcomes research team, said in a statement.\n\nHowever, a study from Israel showed that three doses of Pfizer’s COVID-19 vaccine do not provide enough protection against the post-vaccine omicron variant. The study actually found that the vaccine provides four times less protection against omicron than against the delta variant. Researchers from the Sheba Medical Center in Tel Avid and the Ministry of Health’s Central Virology Lab conducted the study.\n\nThe researchers used data exclusively available to the Sheba Medical Center as part of a larger serology study conducted among the hospital’s healthcare workers.\n\nWatch the video below to know the hidden truth behind the global pandemic.\n\n\n\nFollow Pandemic.news for more news and information related to the coronavirus pandemic.", "opengraph": {"title": "Highly vaccinated Cornell University SHUTS DOWN campus due to COVID-19 surge", "type": "article", "url": "https://www.campusinsanity.com/2021-12-16-highly-vaccinated-cornell-university-shuts-down-campus.html", "site_name": "Campus Insanity Com", "description": "Well-vaccinated Cornell University is forced to shut down just a few days before the end of the semester due to a recent surge of the Wuhan coronavirus (COVID-19). According to the Ivy League school’s website, 97 percent of the overall population on the Ithaca, New York campus are fully vaccinated – including 100 percent of professional faculty, 93 percent […]", "image": "https://www.campusinsanity.com/wp-content/uploads/sites/61/2021/12/Coronavirus-Omicron-Sample-Covid-19-Variant.jpg"}, "tags": ["pandemic", "Cornell University", "covid-19", "Big Pharma", "outbreak", "deception", "fully vaccinated", "infections", "vaccines", "immunocompromised", "coronavirus", "immune system", "campus insanity", "propaganda", "omicron", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://www.cornell.edu/", "https://www.theepochtimes.com/overwhelmingly-vaccinated-cornell-university-shuts-down-campus-as-covid-19-cases-spike_4157029.html", "https://campusinsanity.com", "https://www.kget.com/health/coronavirus/cornell-shuts-down-campus-amid-coronavirus-case-surge/", "https://www.theepochtimes.com/covid-19-infections-among-vaccinated-more-common-and-severe-in-immunocompromised-study_4130766.html?utm_source=ai_recommender&utm_medium=a_bottom_above_etv", "https://www.naturalnews.com/2021-12-14-pfizer-logs-1223-deaths-42086-adverse-reactions.html", "https://www.jpost.com/breaking-news/two-covid-vaccine-shots-does-not-protect-against-omicron-sheba-688496", "https://pandemic.news/", "https://www.theepochtimes.com/overwhelmingly-vaccinated-cornell-university-shuts-down-campus-as-covid-19-cases-spike_4157029.html", "https://www.kget.com/health/coronavirus/cornell-shuts-down-campus-amid-coronavirus-case-surge/", "https://www.theepochtimes.com/covid-19-infections-among-vaccinated-more-common-and-severe-in-immunocompromised-study_4130766.html?utm_source=ai_recommender&utm_medium=a_bottom_above_etv", "https://www.jpost.com/breaking-news/two-covid-vaccine-shots-does-not-protect-against-omicron-sheba-688496"], "authors": [], "publish_date": null}