{"result_id": "058007", "URL": "https://campusinsanity.com/2021-10-07-canada-university-vaccine-mandate-on-online-students.html", "timestamp": "2023-04-25 12:24:23 CEST+0200", "meta": {"description": "Wilfrid Laurier University (WLU) in Ontario, Canada is forcing all of its students – even the ones taking online classes – to get the Wuhan coronavirus (COVID-19) vaccines. Those who refuse to get vaccinated or report their vaccination status will not be allowed to take classes. In a statement published Sept. 29, WLU ordered all students to either be […]", "lang": "en", "keywords": "badhealth,badmedicine,campus insanity,Canada,coronavirus,coronavirus vaccines,covid-19,medical fascism,Medical Tyranny,Ontario,public education,universities,vaccine mandate,Wilfrid Laurier University", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://campusinsanity.com/2021-10-07-canada-university-vaccine-mandate-on-online-students.html", "encoding": "UTF-8"}, "image": null, "domain": "campusinsanity.com", "title": "Canadian university forcing online students to report their vaccination status or be PUNISHED", "cleaned_text": "Canadian university forcing online students to report their vaccination status or be PUNISHED\n\nWilfrid Laurier University (WLU) in Ontario, Canada is forcing all of its students – even the ones taking online classes – to get the Wuhan coronavirus (COVID-19) vaccines. Those who refuse to get vaccinated or report their vaccination status will not be allowed to take classes.\n\nIn a statement published Sept. 29, WLU ordered all students to either be vaccinated by Oct. 8 or to have a valid exemption. Unvaccinated students that receive a valid exemption will be allowed to attend in-person classes and other activities at WLU campuses.\n\nThese exemptions are assessed by the university’s human resources department. Exemptions that are based on religious beliefs or other spiritually-inclined creeds must have a sworn attestation from a Commissioner of Oaths, such as lawyers and paralegals. Students with approved exemptions have to submit themselves for COVID-19 testing twice a week on Monday and Thursday. (Related: Universities are keeping extreme COVID-19 restrictions in place, despite total lack of supporting science.)\n\nWLU is not recognizing “socially based or conscientiously held beliefs” against COVID-19 vaccinations. WLU students who remain unvaccinated by the deadline and without recognized and approved exemptions will not be able to attend classes and extracurricular activities at WLU campuses and other off-campus locations.\n\nThe unvaccinated students will also be de-registered from all fall semester in-person classes, and their access to the university’s online learning management system for their courses will be suspended.\n\nThese coercive actions go even further. If the unvaccinated students continue to refuse to get vaccinated, they will be unable to sign up for courses during the winter term because all students are expected to be on campus by 2022.\n\nWhen asked for a statement regarding these extreme regulations regarding vaccines for healthy young people, a spokesperson for WLU said the university is following the directive of Ontario’s Chief Medical Officer of Health Kieran Moore in creating the vaccination policy for the institution.\n\nOnline students not covered by vaccine mandate, but still have to reveal their vaccination status\n\nStudents who are enrolled in fully online degree programs at WLU, are not required to attend campus at any time and promise to not visit the campus for any other reason, are not required to get vaccinated.\n\nBut fully online students have still been asked “to upload their vaccination status to the vaccine passport on the SAFEHawk app to help fulfill the university’s reporting requirements to the Ministry of Colleges and Universities.” This is Ontario’s state-level government department responsible for the execution of laws regarding higher-level educational institutions.\n\nAccording to reports, WLU has taken inspiration from Mount Royal University (MRU) in the western province of Alberta. MRU has instituted vaccine mandates for fully online students. But the university has later backed down following threats of legal intervention by the conservative legal group, the Justice Centre for Constitutional Freedoms (JCCF).\n\n“The entirely unnecessary requirement for online students to disclose their vaccination is indicative of the irrational abuse of power public authorities are exercising in the current atmosphere of pandemonium,” says JCCF attorney Mary Moore. “It is essential that people stand up and push back against these abuses of power.”\n\nFearing more backlash and potential legal threats from groups like the JCCF, WLU has clarified its position regarding fully online students. In a statement, the university says that fully online students who do not meet the university’s reporting requirements will not face any consequences for not uploading their vaccination status.\n\nLearn more about how campuses all over the United States and Canada are keeping their excessive COVID-19 restrictions by reading the latest articles at CampusInsanity.com.", "opengraph": {"title": "Canadian university forcing online students to report their vaccination status or be PUNISHED", "type": "article", "url": "https://www.campusinsanity.com/2021-10-07-canada-university-vaccine-mandate-on-online-students.html", "site_name": "Campus Insanity Com", "description": "Wilfrid Laurier University (WLU) in Ontario, Canada is forcing all of its students – even the ones taking online classes – to get the Wuhan coronavirus (COVID-19) vaccines. Those who refuse to get vaccinated or report their vaccination status will not be allowed to take classes. In a statement published Sept. 29, WLU ordered all students to either be […]", "image": "https://www.campusinsanity.com/wp-content/uploads/sites/61/2021/10/facebook-oped-64.jpg"}, "tags": ["Wilfrid Laurier University", "Ontario", "campus insanity", "Medical Tyranny", "public education", "universities", "Canada", "covid-19", "vaccine mandate", "medical fascism", "coronavirus vaccines", "coronavirus"], "tweets": [], "movies": [], "links": ["https://www.wlu.ca/", "https://www.lifesitenews.com/news/another-university-asks-online-remote-students-to-report-covid-vaccination-status/", "https://www.naturalnews.com/2021-10-04-universities-keeping-their-extreme-covid-restrictions.html", "https://toronto.ctvnews.ca/ontario-university-will-not-allow-unvaccinated-students-who-normally-learn-in-person-to-take-online-courses-1.5607909", "https://vaccines.news/", "https://www.mtroyal.ca/", "https://www.kitchenertoday.com/coronavirus-covid-19-local-news/laurier-clears-up-confusion-surrounding-vaccine-requirements-4486597", "https://campusinsanity.com/", "https://www.lifesitenews.com/news/another-university-asks-online-remote-students-to-report-covid-vaccination-status/", "https://toronto.ctvnews.ca/ontario-university-will-not-allow-unvaccinated-students-who-normally-learn-in-person-to-take-online-courses-1.5607909", "https://www.kitchenertoday.com/coronavirus-covid-19-local-news/laurier-clears-up-confusion-surrounding-vaccine-requirements-4486597"], "authors": [], "publish_date": null}