{"result_id": "058028", "URL": "https://campusinsanity.com/2023-03-24-dr-malone-top-universities-now-puppets-wef.html", "timestamp": "2023-04-25 14:33:50 CEST+0200", "meta": {"description": "The World Economic Forum’s Global University Leaders Forum is yet another way that the globalist organization has co-opted world leaders. (Article by Robert Malone, M.D. republished from LifeSiteNews.com) One of the most unsettling events of the past three years has been the globalized, coordinated messaging of socio-economic missives and policies throughout the world. All of […]", "lang": "en", "keywords": "Agenda 2030,big government,campus insanity,conspiracy,corruption,deception,Dr. Robert Malone,education system,globalism,Harvard University,left cult,Princeton University,public education,Stanford University,Tyranny,United Nations,woke mob,wokies,world economic forum,Yale University", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://campusinsanity.com/2023-03-24-dr-malone-top-universities-now-puppets-wef.html", "encoding": "UTF-8"}, "image": null, "domain": "campusinsanity.com", "title": "Dr. Robert Malone: Top universities worldwide are now puppets of the World Economic Forum", "cleaned_text": "Dr. Robert Malone: Top universities worldwide are now puppets of the World Economic Forum\n\nThe World Economic Forum’s Global University Leaders Forum is yet another way that the globalist organization has co-opted world leaders.\n\nOne of the most unsettling events of the past three years has been the globalized, coordinated messaging of socio-economic missives and policies throughout the world. All of us in the liberty movement have wondered: who is controlling this? How does this happen?\n\nI remember spending time last fall with Nick Hudson of the Pandata Group (Panda). We were discussing transgender policies across the world. We both were very disturbed, not just by the policies, but also how they came about.\n\nHow did the policies of teaching supposed non-binary genders in schools and the importance of youth “transitioning” spread across world so quickly? How is it possible that South Africa would be immersed in the same battles for “trans rights” as the U.S. and most of Europe? Of course, it isn’t possible without coordination.\n\nThen our minds turned not just to the pandemic policies of masking, mandates, and lockdowns, but to climate change, the elimination of gas fueled cars, Agenda 2030, the move to eliminate private ownership items such as autos and housing, digital IDs, digital currency, 15-minute cities, taking away private land for conservation, globalized censorship, etc., in not just one country, but across the world. The coordinated list seems endless.\n\nI don’t remember a period in my life where most of the world governments agreed on so much. Where did these policies originate? Who is co-ordinating them? How did this happen?\n\nWell, a reader of this Substack wrote me about their discovery that the World Economic Forum (WEF) has a formal committee of presidents from the world’s best universities and that these presidents are coming together regularly to discuss and decide policy at the top universities in the world. These presidents are committed to supporting the World Economic Forum.\n\nThe Global University Leaders Forum (GULF) community consists of the presidents of the world’s leading universities who are committed to supporting the Forum’s mission of improving the state of the world. Together GULF presidents identify and address matters of common interest, including trends, challenges and best practices in higher education, research and societal impact. The community is comprised of 29 members and is chaired by Suzanne Fortier, Principal and Vice-Chancellor, McGill University. In 2021, the GULF community will focus on how universities can facilitate a more equal and inclusive recovery from the COVID-19 pandemic, including through exploring the skills for the future and reskilling, social inclusion, and climate action. GULF presidents and faculty engage in multiple ways with the Forum:\n• Expert networks: opportunities for experts to contribute to expert communities including the Global Future Councils\n• Insight development: opportunities to contribute to new research, disseminate new insights and collaborate on enhancing Strategic Intelligence\n• Action: opportunities to shape the world through 18 platforms addressing social, environmental, technological and industry challenges\n• Learning: opportunities to develop and pilot educational modules with Forum communities\n\nThe 29 members of GULF are listed below:\n\nUniversities such as Stanford, MIT, Princeton, Yale, Berkeley, University of Pennsylvania, and University of Chicago are members. International college president memberships include Oxford, University of Cape Town (South Africa), and top Chinese and European universities. There is a platform of 18 ideologies that these presidents are asked to support and disseminate throughout their campuses and society.\n\nThese university leaders have been awarded special status within the WEF and are asked to sit on other councils, such as the “Global Future Councils.”\n\nAccording to the WEF website:\n\nIt seems to me that the Global University Leaders Forum is yet another way that the WEF has co-opted world leaders. These are doing the work of the WEF in ways we can only imagine.\n\nPeople often remark that the WEF holds no positions of great authority, that is full of pomp and circumstance, but no substance. Nothing could be further from the truth.\n\nRemember in 2019, when the WEF and the United Nations signed a massive partnership agreement? Now, the power of the WEF is backed up the power of the UN and vice-versa.\n\nThe following is from a WEF press release, published on June 13, 2019:\n\nThe United Nations no longer represents nations, it is a partner with the 1000 largest transnational corporations in the world: the WEF. We can only assume that with this partnership a massive amount of money flowed into the coffers of the United Nations.\n\nThe United Nations and the World Economic Forum do not have officials which represent the people. Their leaders have not been elected to make decisions on our behalf or on our nation’s behalf. The agendas of these organization are not those of our nation and do not reflect our concepts of rights to personal sovereignty. Yet through vessels such as Agenda 2030 and the World Health Organization’s (a UN umbrella organization) proposed International Health Regulations, there is the appearance that the UN wishes to supersede national law and both national and personal sovereignty.\n\nThose politicians with affiliations to the WEF need to declare themselves as foreign agents. It is an inherent conflict of interest to both represent and support the WEF and the U.S. government.\n\nLikewise, many of the university presidents named as WEF GULF leaders are from public institutions. They have a duty, as public officials, to report this as a conflict of interest with their institution. Taxpayer money should not be supporting university presidents who have fealty to a foreign NGO.", "opengraph": {"title": "Dr. Robert Malone: Top universities worldwide are now puppets of the World Economic Forum", "type": "article", "url": "https://www.campusinsanity.com/2023-03-24-dr-malone-top-universities-now-puppets-wef.html", "site_name": "Campus Insanity Com", "description": "The World Economic Forum’s Global University Leaders Forum is yet another way that the globalist organization has co-opted world leaders. (Article by Robert Malone, M.D. republished from LifeSiteNews.com) One of the most unsettling events of the past three years has been the globalized, coordinated messaging of socio-economic missives and policies throughout the world. All of […]", "image": "https://www.campusinsanity.com/wp-content/uploads/sites/61/2023/03/yale-university.jpg"}, "tags": ["conspiracy", "world economic forum", "big government", "globalism", "left cult", "deception", "corruption", "Harvard University", "campus insanity", "Agenda 2030", "Stanford University", "wokies", "United Nations", "Princeton University", "woke mob", "Tyranny", "Yale University", "public education", "Dr. Robert Malone", "education system"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/opinion/dr-robert-malone-top-universities-worldwide-are-now-puppets-of-the-world-economic-forum/", "https://www.weforum.org/communities/global-university-leaders-forum", "https://www.weforum.org/press/2019/06/world-economic-forum-and-un-sign-strategic-partnership-framework", "https://www.lifesitenews.com/opinion/dr-robert-malone-top-universities-worldwide-are-now-puppets-of-the-world-economic-forum/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcampusinsanity%2F2023-03-24-dr-malone-top-universities-now-puppets-wef.html&linkname=Dr.%20Robert%20Malone%3A%20Top%20universities%20worldwide%20are%20now%20puppets%20of%20the%20World%20Economic%20Forum", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}