{"result_id": "058045", "URL": "https://campusinsanity.com/2022-09-23-va-educ-dept-requires-adherence-students-biological.html", "timestamp": "2023-04-25 14:34:01 CEST+0200", "meta": {"description": "The Virginia Department of Education (VDOE) updated its model policies for public schools, with the revisions requiring schools to adhere to students’ biological sex. The new policies, which were disseminated through a Sept. 16 report, emphasized the return of parental consent and participation to the education system. They superseded the 2021 model policies put in […]", "lang": "en", "keywords": "biological sex,campus insanity,education system,gender confused,gender confusion,Gender identity,gender issues,Glenn Youngkin,model policies,parental consent,parenting,preferred pronoun,public education,public schools,Ralph Northam,segregation,Virginia,Virginia Department of Education", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://campusinsanity.com/2022-09-23-va-educ-dept-requires-adherence-students-biological.html", "encoding": "UTF-8"}, "image": null, "domain": "campusinsanity.com", "title": "VA Education Department updates model policies for public schools, requires adherence to students’ BIOLOGICAL SEX", "cleaned_text": "The Virginia Department of Education (VDOE) updated its model policies for public schools, with the revisions requiring schools to adhere to students’ biological sex.\n\nThe new policies, which were disseminated through a Sept. 16 report, emphasized the return of parental consent and participation to the education system. They superseded the 2021 model policies put in place by former Virginia Gov. Ralph Northam, a Democrat.\n\nAmong the new policies were the requirement for students to use bathrooms and locker rooms designated for their biological sex. Sports teams participants are also to be segregated by sex.\n\nThe VDOE’s proposed policies last year were the complete opposite of these. The earlier edicts called for bathrooms and locker rooms to be accessible to all regardless of biological sex. It also permitted students to “change genders” with nothing more than a verbal declaration of their gender identity.\n\nThe report also indicated that school faculty and staff are not permitted to keep information such as “gender identity” from parents, and no teacher or student can be forced to call students any name or pronoun that “would violate their constitutionally protected rights.”\n\n“To ensure parents are able to make the best decisions with respect to their child, school personnel shall keep parents fully informed about all matters that may be reasonably expected to be important to a parent, including, and without limitation, matters related to their child’s health, and social and psychological development,” it stated. “Parents’ rights are affirmed by the U.S. Supreme Court that characterized a parent’s right to raise his or her child as ‘perhaps the oldest of the fundamental liberty interests recognized by this court.'”\n\n“Parents are in the best position to work with their children and, where appropriate, their children’s health care providers to determine what names, nicknames and/or pronouns, if any, shall be used for their child by teachers and school staff while their child is at school.” (Related: Virginia reverses transgender school policy, returns right to affirm children’s gender to parents.)\n\nThe Sept. 16 document with its policies against transgenderism was the brainchild of incumbent Virginia Gov. Glenn Youngkin, a Republican elected as the Old Dominion’s chief executive in 2021.\n\nIt blasted the previous policies from Northam because they “promoted a specific viewpoint aimed at achieving cultural and social transformation in schools.” Moreover, the edict by Youngkin’s predecessor “disregarded the rights of parents and ignored other legal and constitutional principles that significantly impact how schools educate students.”\n\nAs a result, the Sept. 16 report superseded the 2021 policies, which are no longer effective in any capacity. However, the report is still subject to a 30-day public comment period, which will start on Sept. 26.\n\nMike Mullin, Democratic whip at the Virginia House of Delegates, slammed the new policies. He tweeted that Youngkin’s “absolutely shameful” policy “calls for the misgendering and outing of children in schools where they’re supposed to be safe.”\n\nMeanwhile, Democrats in the U.S. Senate described the changes in a joint statement as “an outright violation of Virginians’ civil rights.”\n\nMacaulay Porter, press secretary for Youngkin, said the new policies deliver on “the governor’s commitment to preserving parental rights and upholding the dignity and respect of all public school students.”\n\n“It is not under a school’s or the government’s purview to impose a set of particular ideological beliefs on all students. Key decisions rest, first and foremost, with the parents,” she added.\n\n“The previous policies implemented under the Northam administration did not uphold constitutional principles and parental rights, and will be replaced.”\n\nVisit PublicEducation.news for more stories like this.\n\nWatch Martin Brodel talk about the pro-LGBT school platform of Virginia gubernatorial candidate Terry McAuliffe, who Youngkin defeated in the 2021 state elections.\n\nThis video is from the Martin Brodel channel on Brighteon.com.\n\nSchool choice quickly becoming the “law of the land” – Republicans should jump aboard and follow Virginia Governor Youngkin’s lead.\n\nVirginia school board actually considering new curriculum that teaches kids there is NO such thing as “biological sex.”\n\nBack-to-school students are being subjected to a whole new wave of transgender indoctrination and left-wing lunacy.\n\nVA Education Department finalizing policies to ensure transparency of sex education materials for public schools.", "opengraph": {"title": "VA Education Department updates model policies for public schools, requires adherence to students’ BIOLOGICAL SEX", "type": "article", "url": "https://www.campusinsanity.com/2022-09-23-va-educ-dept-requires-adherence-students-biological.html", "site_name": "Campus Insanity Com", "description": "The Virginia Department of Education (VDOE) updated its model policies for public schools, with the revisions requiring schools to adhere to students’ biological sex. The new policies, which were disseminated through a Sept. 16 report, emphasized the return of parental consent and participation to the education system. They superseded the 2021 model policies put in […]", "image": "https://www.campusinsanity.com/wp-content/uploads/sites/61/2022/09/Exterior-View-School-Building-Playground.jpg"}, "tags": ["Ralph Northam", "gender confused", "Gender identity", "model policies", "public education", "segregation", "Virginia Department of Education", "parental consent", "public schools", "preferred pronoun", "biological sex", "gender issues", "Virginia", "parenting", "gender confusion", "Glenn Youngkin", "campus insanity", "education system"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/news/updated-virginia-public-school-policies-require-adherence-to-students-biological-sex/", "https://doe.virginia.gov/support/gender-diversity/2022-model-policies-on-the-privacy-dignity-and-respect-for-all-students-town-hall.pdf", "https://naturalnews.com/2022-09-20-virginia-reverses-transgender-school-policy-parents-affirm-gender.html", "https://nypost.com/2022/09/17/virginia-gov-glenn-youngkin-reverses-protections-for-transgender-students/", "https://publiceducation.news/", "https://www.brighteon.com/43c4d13a-2fad-41b9-a3aa-6a896a14205e", "https://www.brighteon.com/channels/martinbrodel", "https://publiceducation.news/2022-07-29-school-choice-becoming-law-of-the-land-republicans-should-jump-aboard.html", "https://genderconfused.com/2018-05-29-virginia-school-board-new-curriculum-teaches-kids-there-is-no-such-thing-as-biological-sex.html", "https://genderconfused.com/2019-09-05-students-subjected-to-new-wave-of-transgender-indoctrination.html", "https://publiceducation.news/2022-08-10-va-educ-department-finalizing-policies-school-materials.html", "https://www.lifesitenews.com/news/updated-virginia-public-school-policies-require-adherence-to-students-biological-sex/", "https://doe.virginia.gov/support/gender-diversity/2022-model-policies-on-the-privacy-dignity-and-respect-for-all-students-town-hall.pdf", "https://nypost.com/2022/09/17/virginia-gov-glenn-youngkin-reverses-protections-for-transgender-students/", "https://www.brighteon.com/43c4d13a-2fad-41b9-a3aa-6a896a14205e", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcampusinsanity%2F2022-09-23-va-educ-dept-requires-adherence-students-biological.html&linkname=VA%20Education%20Department%20updates%20model%20policies%20for%20public%20schools%2C%20requires%20adherence%20to%20students%E2%80%99%20BIOLOGICAL%20SEX", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}