{"result_id": "058016", "URL": "https://campusinsanity.com/2023-01-30-heart-disease-sudden-death-youth-schools-defibrillators.html", "timestamp": "2023-04-25 14:33:41 CEST+0200", "meta": {"description": "By the end of 2023, nearly 18,000 schools across the United Kingdom will be furnished with more than 20,000 defibrillators to address escalating rates of heart disease in children – all thanks to covid “vaccines.” All state-funded schools across England, we are told, have defibrillators on the way. Even though heart attacks and other cardiac […]", "lang": "en", "keywords": "badhealth,badmedicine,Big Pharma,campus insanity,children's health,COVID,defibrillator,heart damage,heart disease,heart health,medical violence,pandemic,pharmaceutical fraud,public schools,schools,UK,vaccination,vaccine damage,Vaccine deaths,vaccine injury,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://campusinsanity.com/2023-01-30-heart-disease-sudden-death-youth-schools-defibrillators.html", "encoding": "UTF-8"}, "image": null, "domain": "campusinsanity.com", "title": "Rising rates of sudden death among youth prompt UK children’s schools to install thousands of defibrillators", "cleaned_text": "Rising rates of sudden death among youth prompt UK children’s schools to install thousands of defibrillators\n\nBy the end of 2023, nearly 18,000 schools across the United Kingdom will be furnished with more than 20,000 defibrillators to address escalating rates of heart disease in children – all thanks to covid “vaccines.”\n\nAll state-funded schools across England, we are told, have defibrillators on the way. Even though heart attacks and other cardiac issues are exceptionally rare in children – and especially those that require rapid electrical stimulation – UK officials recognize the need for more defibrillators.\n\nDr. Suneel Dhand explains more about what is going on in a video you can watch at the RAIR Foundation website.\n\nLast July, The Guardian reported that the move came after Department of Education (DoE) officials met with campaigners, including Mark King, whose 12-year-old son Oliver suffered a sudden cardiac arrest incident while competing in a swimming race.\n\nThat report does not mention covid jabs (of course), but it does suggest that there is a growing and urgent need to have more defibrillators at children’s schools – obviously because of the injections and what they are doing to people. (Related: This is why Sweden, Denmark, and several other European countries banned the Moderna injections for young people – because they destroy people’s hearts.)\n\n“That’s a staggering number of defibrillators – 20,000 defibrillators,” Dhand states in the above-linked video. “And I’m sure many other countries may follow suit.”\n\nPrior to covid injections, children suffering or dying suddenly from cardiac events was extremely rare\n\nWhile it is certainly never a bad thing to prepare for medical emergencies in this manner, the fact of the matter is that this is odd timing if covid injections are somehow not the impetus behind the move.\n\nWhy is it suddenly urgent to get defibrillators into all UK schools before the end of the year, especially since King’s son Oliver suffered his cardiac incident in 2011.\n\nUK officials have obviously been working on this plan for a while – or so they are making it seem. If Oliver had a heart attack 12 years ago, why is it suddenly a top priority now in 2023 to get tens of thousands of defibrillators into all UK children’s schools?\n\n“When I was growing up, it would have been absolutely unthinkable – I’m thinking of when I was in primary school, when I was in grammar school – the thought never even entered our collective minds that we would even request defibrillators,” Dhand says about the idea of needing defibrillators to treat lots of children for cardiac events that almost always and exclusively affect older people.\n\n“I hadn’t really heard of young children dying suddenly. Of course, it’s something that has happened ever since humans have existed, but it was really, really rare – it wouldn’t have even entered our minds to think about it.”\n\nDhand is right: prior to Operation Warp Speed, how many children did you hear about who suffered a heart attack out of nowhere or dropped dead while going about normal activities? Now, we hear of at least a few new cases almost daily as if it is perfectly normal.\n\nDhand says he is working hard right now to unearth any and all data on statistics of sudden cardiac arrest or death in children to see if there has, in fact, been an uptick ever since Donald “father of the vaccine” Trump unleashed these things as part of a global military operation.\n\n“Don’t forget who pays for all those defibrillators,” wrote a commenter about the situation. “The government caused the problem – first with covid, then the vaxx – and now they extort the people to pay for the fix, too. All the while, the money changes hands and the people at the top get their cut.”\n\nThe latest news about covid “vaccines” can be found at ChemicalViolence.com.", "opengraph": {"title": "Rising rates of sudden death among youth prompt UK children’s schools to install thousands of defibrillators", "type": "article", "url": "https://www.campusinsanity.com/2023-01-30-heart-disease-sudden-death-youth-schools-defibrillators.html", "site_name": "Campus Insanity Com", "description": "By the end of 2023, nearly 18,000 schools across the United Kingdom will be furnished with more than 20,000 defibrillators to address escalating rates of heart disease in children – all thanks to covid “vaccines.” All state-funded schools across England, we are told, have defibrillators on the way. Even though heart attacks and other cardiac […]", "image": "https://www.campusinsanity.com/wp-content/uploads/sites/61/2023/01/Defibrillator-Cpr-Hospital.jpg"}, "tags": ["pandemic", "schools", "Big Pharma", "COVID", "medical violence", "campus insanity", "vaccination", "public schools", "defibrillator", "heart damage", "UK", "vaccine wars", "heart health", "pharmaceutical fraud", "heart disease", "children's health", "Vaccine deaths", "vaccine injury", "vaccines", "vaccine damage"], "tweets": [], "movies": [], "links": ["https://rairfoundation.com/tens-of-thousands-of-defibrillators-being-installed-in-uk-childrens-schools/", "https://rairfoundation.com/tens-of-thousands-of-defibrillators-being-installed-in-uk-childrens-schools/", "https://www.theguardian.com/education/2022/jul/17/defibrillators-to-be-installed-in-all-english-state-schools-by-end-of-next-school-year", "https://naturalnews.com/2021-10-06-sweden-denmark-ban-moderna-covid-vaccine-myocarditis-young-people.html", "http://chemicalviolence.com", "https://rairfoundation.com/tens-of-thousands-of-defibrillators-being-installed-in-uk-childrens-schools/", "https://www.theguardian.com/education/2022/jul/17/defibrillators-to-be-installed-in-all-english-state-schools-by-end-of-next-school-year", "https://naturalnews.com/2021-10-06-sweden-denmark-ban-moderna-covid-vaccine-myocarditis-young-people.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcampusinsanity%2F2023-01-30-heart-disease-sudden-death-youth-schools-defibrillators.html&linkname=Rising%20rates%20of%20sudden%20death%20among%20youth%20prompt%20UK%20children%E2%80%99s%20schools%20to%20install%20thousands%20of%20defibrillators", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}