{"result_id": "058013", "URL": "https://campusinsanity.com/2021-10-27-student-forced-to-tape-mask-to-face.html", "timestamp": "2023-04-25 14:33:40 CEST+0200", "meta": {"description": "The Wuhan coronavirus (COVID-19) pandemic forced millions of students to learn through online classes. Studying online suddenly doesn’t sound that bad for one Colorado Springs student who was forced to tape her mask to her face. The teenaged girl, a student at Academy School District 20, said that she was forced to tape her mask to her face while […]", "lang": "en", "keywords": "badhealth,badmedicine,campus insanity,colorado springs,covid-19,education system,health freedom,medical fascism,Medical Tyranny,pandemic,public education,public schools,vaccination", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://campusinsanity.com/2021-10-27-student-forced-to-tape-mask-to-face.html", "encoding": "UTF-8"}, "image": null, "domain": "campusinsanity.com", "title": "Colorado Springs student forced to have mask TAPED to her face while at school", "cleaned_text": "Colorado Springs student forced to have mask TAPED to her face while at school\n\nThe Wuhan coronavirus (COVID-19) pandemic forced millions of students to learn through online classes. Studying online suddenly doesn’t sound that bad for one Colorado Springs student who was forced to tape her mask to her face.\n\nThe teenaged girl, a student at Academy School District 20, said that she was forced to tape her mask to her face while at school. According to the student’s mother, the incident occurred because the student’s face mask kept falling off while she was in class.\n\nThe school district explained that it started getting reports about this happening at Chinook Trail Middle School in mid-October. It’s still unclear what happened leading up to the mask taping incident. (Related: Segregation returns to America as universities threaten, harass, intimidate unvaxxed students.)\n\nAllison Cortez, chief communications officer for District 20, advised others not to speculate on the matter. “Because of social media, we now have so many other voices in the mix that may not have been involved and so now there’s misinformation that’s mingled in with actual facts,” warned Cortez.\n\nAccording to reports, the same thing happened to some other students in Colorado Springs. After finding out about the incident, concerned parents are now demanding answers.\n\nIt is believed that teachers are forcing middle school students to tape their masks to their faces. Over 100 students and staff members are being interviewed for the investigation.\n\nStudent: Teachers have been enforcing taped masks policy for weeks\n\nParent Stephanie M. first posted on social media a picture of her sixth-grade daughter from Chinook Trail Middle School with a mask taped to her face. She asked on her post if other parents knew about a “policy” of taped masks. The mother also wanted to know if other students have experienced the same thing.\n\nHer daughter said that teachers have been enforcing the taped masks policy for weeks.\n\nParent Tori Skeldum added that her daughter said teachers were carrying the masking tape around their wrists like bracelets. When teachers saw someone’s mask fall down, they would tape the mask to the student’s face.\n\nWhile Academy School District 20 enforced a mask mandate since Sept. 27 because a lot of students were forced to quarantine, parents said that the district is going too far by taping masks to children’s faces. The district said an email was sent out to parents about the situation.\n\nCortez said that there were rumors that the students taped the masks to their faces on their own. Because there are many versions of the story, Cortez emphasized the need to talk to all students and find out the truth.\n\nThe principal of Chinook Trail Middle School requested a meeting with Stephanie and her daughter to discuss what happened. However, Stephanie declined the invitation.\n\nStephanie is now seeking advice from an attorney while her daughter will attend school online until the investigation is complete. The district encompasses the northern part of Colorado Springs and the area surrounding the Air Force Academy. Officials asked the public for patience while they’re investigating the incident.\n\nVisit CampusInsanity.com to learn more about these shocking incidents amid the coronavirus pandemic.", "opengraph": {"title": "Colorado Springs student forced to have mask TAPED to her face while at school", "type": "article", "url": "https://www.campusinsanity.com/2021-10-27-student-forced-to-tape-mask-to-face.html", "site_name": "Campus Insanity Com", "description": "The Wuhan coronavirus (COVID-19) pandemic forced millions of students to learn through online classes. Studying online suddenly doesn’t sound that bad for one Colorado Springs student who was forced to tape her mask to her face. The teenaged girl, a student at Academy School District 20, said that she was forced to tape her mask to her face while […]", "image": "https://www.campusinsanity.com/wp-content/uploads/sites/61/2021/10/Mask-Close-Up-Pandemic-Covid-19.jpg"}, "tags": ["pandemic", "covid-19", "medical fascism", "public education", "Medical Tyranny", "public schools", "colorado springs", "campus insanity", "education system", "health freedom", "vaccination"], "tweets": [], "movies": [], "links": ["https://denver.cbslocal.com/2021/10/19/face-masks-colorado-springs-tape/", "https://www.naturalnews.com/2021-07-29-segregation-returns-as-universities-threaten-unvaxxed-students.html", "https://www.fox21news.com/top-stories/colorado-springs-school-district-investigating-masks-being-taped-to-students-faces/", "https://campusinsanity.com/", "https://denver.cbslocal.com/2021/10/19/face-masks-colorado-springs-tape/", "https://www.fox21news.com/top-stories/colorado-springs-school-district-investigating-masks-being-taped-to-students-faces/"], "authors": [], "publish_date": null}