{"result_id": "058003", "URL": "https://campusinsanity.com/2022-05-09-professors-seek-probe-university-president-push-vaccines.html", "timestamp": "2023-04-25 12:24:21 CEST+0200", "meta": {"description": "Professors in a Canadian university called for an investigation of a possible conflict of interest regarding its president mandating Wuhan coronavirus (COVID-19) vaccines. LifeSiteNews reported that faculty members at the University of Waterloo (UW) in Ontario, Canada were responsible for the endeavor. It stemmed from an open letter sent to all faculty, staff members and students […]", "lang": "en", "keywords": "badhealth,badmedicine,campus insanity,Canada,compliance,conflict of interest,covid-19,freedom,health freedom,medical fascism,Medical Tyranny,pandemic,public schools,University of Waterloo,vaccine mandate,vaccine wars,vaccines,Vivek Goel", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://campusinsanity.com/2022-05-09-professors-seek-probe-university-president-push-vaccines.html", "encoding": "UTF-8"}, "image": null, "domain": "campusinsanity.com", "title": "Professors in Canadian university seek probe on possible CONFLICT OF INTEREST behind its president’s push for COVID vaccines", "cleaned_text": "Professors in Canadian university seek probe on possible CONFLICT OF INTEREST behind its president’s push for COVID vaccines\n\nProfessors in a Canadian university called for an investigation of a possible conflict of interest regarding its president mandating Wuhan coronavirus (COVID-19) vaccines.\n\nLifeSiteNews reported that faculty members at the University of Waterloo (UW) in Ontario, Canada were responsible for the endeavor. It stemmed from an open letter sent to all faculty, staff members and students on the entire campus in September 2021. Initially having only 32 signatories, the number of people who affixed their names to the open letter grew to 155.\n\n“Any mandates involving vaccination, declaration of vaccination status and testing violate all employment contracts that were concluded, as well as all offers of admission that were accepted before the mandates were imposed. The rights infringed upon include those enshrined in the Canadian Charter of Rights and Freedoms – the highest law of the land. Thus, the mandates are unlawful and invalid,” said the open letter.\n\nA subsequent letter sent to UW’s Board of Governors and school Senate in March pointed out that the COVID-19 vaccine mandate imposed by UW President Vivek Goel “may have been significantly influenced by his membership in the federal COVID-19 Immunity Task Force.” Goel, who assumed the leadership of UW in July 2021, had also served as the founding president and CEO of Public Health Ontario.\n\nThe UW president’s membership in Ottawa’s COVID-19 Immunity Task Force violated university policy with regard to conflicts of interest, the letter argued.\n\nOnly one document in the university’s archives mentioned Goel’s link to the task force. It did not include a statement from the UW president saying that his association with the entity “could affect, or could be perceived to affect, the decisions he would make.” The March letter explained that university policy “requires proactive disclosure of conflicts and potential conflicts, but Goel failed to do this.”\n\nSeveral UW faculty members spoke out against Goel’s vaccine mandate, sharing their thoughts on the matter to LifeSiteNews.\n\nApplied mathematics professor Edward Vrscay, a signatory of the September 2021 open letter, said the university’s handling of COVID-19 shows that it is more concerned with compliance rather than public health. Incidentally, Vrscay’s tenure of more than 35 years at UW is threatened due to his non-compliance with the university’s COVID-19 vaccine mandate. (Related: Canadian professor fired for refusing to get injected with covid vaccine.)\n\nHe quoted a March 23 statement Goel gave to the Waterloo Region Record, in which he said the success of the vaccine mandate is measured “in the high level of compliance” among the university population instead of the reduction of COVID-19 cases since the mandate’s introduction.\n\nPhilosophy and cognitive science professor John Turri, meanwhile, scrutinized UW’s COVID-19 case data. He pointed out that over a period of eight months, the vaccine mandate is only “associated [with] one fewer positive COVID-19 test on campus every two months.” This, Turri pointed out, is a number “not meaningfully different than zero.”\n\nThe philosophy and cognitive science professor later responded to the UW president’s comments about his initial observation: “Goel shockingly implies that compliance itself was the goal; high compliance shows that the policy succeeded. This contradicts the requirement’s stated objective [of reducing the spread of COVID-19].”\n\nVrscay ultimately remarked that the vaccine mandate espoused by Goel is but a symptom of a larger cultural shift occurring at universities across Canada.\n\n“In a sense, it is even deeper than just an institution where you are not free to say what you want. It filters down into everything, into a ‘censorship’ if you will. This is not just about vaccination. This is a spiritual war, [and it’s] happening for a reason: To show how corrupt every man-made institution is.”\n\nMedicalTyranny.com has more stories about COVID-19 vaccine mandates in universities.\n\nWatch Joe Imbriano talk about COVID-19 vaccine mandate for colleges in the state of California.\n\nThis video is from the Truth or Consequences channel on Brighteon.com.\n\nTucker Carlson: University vaccine mandates forbid kids from getting an education.\n\nTop Canadian university fires 49 staff members for not getting the COVID-19 vaccine.\n\nCanadian university forcing online students to report their vaccination status or be PUNISHED.", "opengraph": {"title": "Professors in Canadian university seek probe on possible CONFLICT OF INTEREST behind its president’s push for COVID vaccines", "type": "article", "url": "https://www.campusinsanity.com/2022-05-09-professors-seek-probe-university-president-push-vaccines.html", "site_name": "Campus Insanity Com", "description": "Professors in a Canadian university called for an investigation of a possible conflict of interest regarding its president mandating Wuhan coronavirus (COVID-19) vaccines. LifeSiteNews reported that faculty members at the University of Waterloo (UW) in Ontario, Canada were responsible for the endeavor. It stemmed from an open letter sent to all faculty, staff members and students […]", "image": "https://www.campusinsanity.com/wp-content/uploads/sites/61/2022/05/vaccines.jpg"}, "tags": ["health freedom", "campus insanity", "Medical Tyranny", "Vivek Goel", "compliance", "Canada", "covid-19", "vaccine mandate", "University of Waterloo", "conflict of interest", "vaccines", "vaccine wars", "pandemic", "medical fascism", "public schools", "freedom"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/news/university-profs-want-conflict-of-interest-investigation-into-president-who-pushed-vaccine-mandate/", "https://uwaterloo.ca/", "https://links.uwaterloo.ca/Repeal_UW_Mandatory_Vaccination_Policy/UW-open-letter-Sep29b.pdf", "https://www.yahoo.com/now/vivek-goel-named-president-vice-113000419.html", "https://campusinsanity.com", "https://naturalnews.com/2021-09-14-canadian-professor-fired-for-refusing-coronavirus-vaccine.html", "https://medicaltyranny.com/", "https://www.brighteon.com/f6fae2f1-04e0-49fc-b8bf-85910b5dab03", "https://www.brighteon.com/channels/triplee495", "https://healthfreedom.news/2021-12-20-uci-professor-sues-school-covid-vaccine-mandate.html", "https://pandemic.news/2021-09-06-harvard-professor-exposes-vaccine-passports-scientific-nonsense.html", "https://vaccines.news/2021-05-10-tucker-vaccine-mandates-forbid-kids-from-education.html", "https://medicalfascism.news/2022-04-05-canadian-university-fires-49-unvaccinated-staff-members.html", "https://campusinsanity.com/2021-10-07-canada-university-vaccine-mandate-on-online-students.html", "https://www.lifesitenews.com/news/university-profs-want-conflict-of-interest-investigation-into-president-who-pushed-vaccine-mandate/", "https://links.uwaterloo.ca/Repeal_UW_Mandatory_Vaccination_Policy/UW-open-letter-Sep29b.pdf", "https://www.yahoo.com/now/vivek-goel-named-president-vice-113000419.html", "https://www.brighteon.com/f6fae2f1-04e0-49fc-b8bf-85910b5dab03", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcampusinsanity%2F2022-05-09-professors-seek-probe-university-president-push-vaccines.html&linkname=Professors%20in%20Canadian%20university%20seek%20probe%20on%20possible%20CONFLICT%20OF%20INTEREST%20behind%20its%20president%E2%80%99s%20push%20for%20COVID%20vaccines", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}