{"result_id": "058050", "URL": "https://campusinsanity.com/2022-09-27-new-jersey-new-curriculum-transgenderism-gender-ideology.html", "timestamp": "2023-04-25 14:34:05 CEST+0200", "meta": {"description": "The New Jersey Department of Education (NJ DOE) is requiring second graders in all schools to learn about transgenderism and gender identity as part of the state’s new sex education curriculum. School boards that refuse to implement the new curriculum can be disciplined by the state government. The revised sex education standards were adopted by the New […]", "lang": "en", "keywords": "big government,campus insanity,culture wars,curriculum,demonic,education system,evil,gender,gender ideology,gender issues,identity politics,indoctrination,left cult,New Jersey,Parental rights,propaganda,public education,sex education,transgenderism", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://campusinsanity.com/2022-09-27-new-jersey-new-curriculum-transgenderism-gender-ideology.html", "encoding": "UTF-8"}, "image": null, "domain": "campusinsanity.com", "title": "New Jersey’s new sex education curriculum teaches second graders about transgenderism and gender ideology", "cleaned_text": "New Jersey’s new sex education curriculum teaches second graders about transgenderism and gender ideology\n\nThe New Jersey Department of Education (NJ DOE) is requiring second graders in all schools to learn about transgenderism and gender identity as part of the state’s new sex education curriculum. School boards that refuse to implement the new curriculum can be disciplined by the state government.\n\nThe revised sex education standards were adopted by the New Jersey Board of Education in 2020, but they are being implemented for the first time this school year. The standards were adopted to “address topics that students should know about,” including personal growth and development, pregnancy and parenting and social and sexual health. This includes other sex education topics that were already being taught like health conditions, diseases, personal safety and other health-related topics.\n\nAccording to the new curriculum, by second grade, students will learn about “gender-role stereotypes” and transgenderism and other ways people express their preferred gender. By fifth grade, public school students in New Jersey will be taught about hormones and sexual development.\n\nIn addition, fifth graders will be told that they “should feel welcome and included regardless of their gender, gender expression or sexual orientation,” meaning that they will be encouraged to become transgender at the young age of 10 or 11.\n\nEighth-grade students will receive instruction on factors that contribute to making “healthy decisions” about sex. They will also be taught about vaginal, anal and oral sex. (Related: VA Education Department updates model policies for public schools, requires adherence to students’ BIOLOGICAL SEX.)\n\nState government to “discipline” school boards that refuse to implement curriculum\n\nSchool districts that refuse to implement the new sex education curriculum can be disciplined by the state. This warning comes after several school boards and county governments heavily criticized the new curriculum as being inappropriate\n\nIn its statement, the NJ DOE made it clear that parents who do not want their children to participate in these classes are welcome to remove their children from sex education classes after they write a letter to the principal explaining that the lessons “conflict with their conscience or sincerely held moral or religious beliefs,” wrote the department.\n\nThe Lakewood School District board in south-central New Jersey has officially adopted an opt-in policy, wherein parents and guardians must report to the board if they would like their children to participate in the “Social and Sexual Health” and “Pregnancy and Parenting” components of the updated sex education curriculum. Students and parents who fail to fill up the opt-in forms will automatically be excluded.\n\nGarwood School District in northern New Jersey passed a resolution not to adopt a curriculum that discusses some of the topics required by the state.\n\nThe Board of County Commissioners for Sussex County passed a resolution asserting that parents should decide immediately whether they want their children in these new sex education classes. The Sussex-Wantage Regional School District in the same county passed a resolution saying it “disagrees” with the NJ DOE’s changes to the sex education curriculum.\n\nBack in May, the Board of County Commissioners for Atlantic County passed a resolution urging the NJ DOE and state Gov. Phil Murphy “to cease from implementing their sexuality education curriculum for grammar/elementary school children and require that all local school boards have public meetings for public input on the sexuality education prior to implementation.”\n\nOther school districts are attempting to avoid censure from the NJ DOE while still trying to circumvent the curriculum. The Hoboken School District, for example, is hosting a “family health night” to discuss the new topics brought up by the new curriculum with both parents and children. These open events include experts who are talking families through the topics.\n\nMillstone Township Schools is implementing all of the new topics in the updated curriculum, but many lessons will be left for parents to teach at home if they wish. These include topics on sexual orientation, gender identity and sexual intercourse leading to reproduction for fifth graders. The topic regarding strategies used by sex traffickers and laws around consent that are designed to keep children safe from pornography is also excluded from in-class instruction. Resources are being provided for parents that want to teach these topics at home.\n\nLearn more about public education in America at PublicEducation.news.\n\nWatch this video as Gabe Zolna of the “Zolna Report” reacts to the news that New Jersey students will be taught about gender identity in schools.\n\nThis video is from the ZolnaReport.com channel on Brighteon.com.\n\nVirginia reverses transgender school policy, returns right to affirm children’s gender to parents.\n\nTRANS TYRANNY: Teacher arrested and IMPRISONED for using “wrong” student pronouns.\n\nBooks on gender transitioning recommended to kindergartners in Newsom’s California.\n\nCalifornia K-12 reading list includes books about transgender toddlers, how Trump and Founding Fathers are racist.", "opengraph": {"title": "New Jersey’s new sex education curriculum teaches second graders about transgenderism and gender ideology", "type": "article", "url": "https://www.campusinsanity.com/2022-09-27-new-jersey-new-curriculum-transgenderism-gender-ideology.html", "site_name": "Campus Insanity Com", "description": "The New Jersey Department of Education (NJ DOE) is requiring second graders in all schools to learn about transgenderism and gender identity as part of the state’s new sex education curriculum. School boards that refuse to implement the new curriculum can be disciplined by the state government. The revised sex education standards were adopted by the New […]", "image": "https://www.campusinsanity.com/wp-content/uploads/sites/61/2022/09/Sad-Bored-School-Classroom-Problem-Unhappy-Stress.jpg"}, "tags": ["big government", "left cult", "gender issues", "campus insanity", "identity politics", "New Jersey", "demonic", "culture wars", "gender", "Parental rights", "propaganda", "indoctrination", "evil", "public education", "gender ideology", "curriculum", "transgenderism", "sex education", "education system"], "tweets": [], "movies": [], "links": ["https://bigleaguepolitics.com/nj-department-of-education-threatens-schools-who-refuse-to-promote-gender-identity-to-minors/", "https://www.northjersey.com/story/news/education/2022/09/20/nj-sex-education-standards-discipline-schools/69497535007/", "https://www.nytimes.com/2022/09/02/nyregion/sex-ed-new-jersey-midterms.html", "https://gothamist.com/news/will-nj-usurp-schools-control-state-hints-at-consequences-for-rejecting-sex-ed-standards", "http://leftcult.com", "https://naturalnews.com/2022-09-23-va-educ-dept-requires-adherence-students-biological.html", "https://campusinsanity.com", "https://www.northjersey.com/story/news/education/2022/09/22/nj-sex-education-curriculum-how-schools-will-teach-avoid-discipline/69510211007/", "https://publiceducation.news/", "https://www.brighteon.com/dff3c912-48a4-4bcb-8594-fad826d16dad", "https://www.brighteon.com/channels/zolareportcom", "https://www.brighteon.com/channels/zolareportcom", "https://educationsystem.news/2022-09-20-virginia-reverses-transgender-school-policy-parents-affirm-gender.html", "https://gender.news/2022-09-15-school-board-refuses-recognize-october-lgbtq-history-month.html", "https://campusinsanity.com/2022-09-08-teacher-arrested-imprisoned-using-wrong-student-pronouns.html", "https://publiceducation.news/2022-08-17-books-on-gender-transitioning-recommended-to-kindergartners.html", "https://www.publiceducation.news/2022-08-15-california-k12-books-about-transgender-toddlers.html", "https://bigleaguepolitics.com/nj-department-of-education-threatens-schools-who-refuse-to-promote-gender-identity-to-minors/", "https://www.northjersey.com/story/news/education/2022/09/20/nj-sex-education-standards-discipline-schools/69497535007/", "https://www.nytimes.com/2022/09/02/nyregion/sex-ed-new-jersey-midterms.html", "https://gothamist.com/news/will-nj-usurp-schools-control-state-hints-at-consequences-for-rejecting-sex-ed-standards", "https://www.northjersey.com/story/news/education/2022/09/22/nj-sex-education-curriculum-how-schools-will-teach-avoid-discipline/69510211007/", "https://www.brighteon.com/dff3c912-48a4-4bcb-8594-fad826d16dad", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcampusinsanity%2F2022-09-27-new-jersey-new-curriculum-transgenderism-gender-ideology.html&linkname=New%20Jersey%E2%80%99s%20new%20sex%20education%20curriculum%20teaches%20second%20graders%20about%20transgenderism%20and%20gender%20ideology", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}