{"result_id": "058042", "URL": "https://campusinsanity.com/2021-08-19-nih-director-school-mask-mandates-not-scientific.html", "timestamp": "2023-04-25 14:33:59 CEST+0200", "meta": {"description": "The director of the National Institutes of Health (NIH) admitted on Tuesday, Aug. 17, that the push to make schoolchildren wear masks to supposedly protect them against the Wuhan coronavirus (COVID-19) is not based on scientific data. The director, Dr. Francis Collins, talked about the debate surrounding forcing children to wear masks while in schools during an interview with […]", "lang": "en", "keywords": "American schools,badhealth,badmedicine,campus insanity,children's health,coronavirus,covid-19,mask mandate,masks,Medical Tyranny,public education,school mask mandates,truth", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://campusinsanity.com/2021-08-19-nih-director-school-mask-mandates-not-scientific.html", "encoding": "UTF-8"}, "image": null, "domain": "campusinsanity.com", "title": "NIH director admits school mask mandates not based on science", "cleaned_text": "The director of the National Institutes of Health (NIH) admitted on Tuesday, Aug. 17, that the push to make schoolchildren wear masks to supposedly protect them against the Wuhan coronavirus (COVID-19) is not based on scientific data.\n\nThe director, Dr. Francis Collins, talked about the debate surrounding forcing children to wear masks while in schools during an interview with conservative radio host Hugh Hewitt on his program, “The Hugh Hewitt Show.”\n\nHewitt asked Collins about the recent federal recommendation that children from kindergarten up to third grade should wear masks at all times while in school. Collins said that he believes wearing masks can help prevent COVID-19 outbreaks at schools. He claims such a situation would force these schools to shut down, and the kids would have to go back to remote learning.\n\nAt the same time, Collins acknowledged that it is very rare for a child or a teenager to contract COVID-19, let alone have enough viral load to spread it to others. (Related: Indiana family doctor STANDS UP to school board with speech about how masks, vaccines do not work.)\n\n“It is still pretty rare, but it is not zero, and we now have more than 400 kids that have died of this,” said Collins. “So, we have to think about that.”\n\nCollins insisted that if children remain unmasked in school, they will spread COVID-19. He warned that such an outcome – which he just said was very rare and unlikely to occur – would also affect their parents and school staff.\n\nHewitt was unconvinced, and pressed Collins for data proving that kids from kindergarten to third grade “are at greater risk of hospitalization or illness of serous sort from taking their mask off.” Collins answered with:\n\nCollins then attempted to backtrack on his admission that the push to mandate masks in schools is not based on data. He tried to argue that school districts have already shut down because of COVID-19 cases.\n\nBut Hewitt was not convinced. He argued that those school districts overreacted to their COVID-19 cases. He believes his assessment of the situation is supported by Collins’ own admission that there is no data showing that children are more likely to suffer from severe COVID-19 infections if they did not wear masks.\n\n“You tell me, they closed because of the number of positive tests. But was there real harm?” asked Hewitt. “Because if it’s the flu or a common cold in children, that was a bad decision and a panicky one.”\n\nHewitt continued by saying that he believes public health officials and institutions have fearmongered about COVID-19 outbreaks among children without any evidence of actual outbreaks.\n\nHe continued by pressing Collins further. He accused the director of the NIH of not having any data proving that children have a greater risk of being infected with COVID-19.\n\nHewitt pointed out that many young children are vulnerable to developing speech problems if they are unable to see people’s full faces. He believes this is a much bigger threat to children than COVID-19.\n\nTo these accusations, all Collins could argue is that the director believes not even Hewitt has the data to prove his case.\n\n“I don’t think we have the data on either side of it Hugh,” said Collins. “I think right now, we’re all trying to do the best we can.”\n\nData shows children account for less than one percent of all COVID-19 deaths\n\nData from the Centers for Disease Control and Prevention (CDC) show that, as of Wednesday, Aug. 18, only 430 children have died due to COVID-19 out of 614,530 total deaths. Of these deaths, 134 were between the ages of 0 to four and 296 were between the ages of 5 and 18.\n\nThis represents 0.069 percent of all deaths attributed to COVID-19 and recognized by the CDC.\n\nFurthermore, additional child mortality data from the American Academy of Pediatrics shows that, among 43 states, New York City, Puerto Rico and Guam, children represented at most 0.25 percent of all COVID-19 deaths. Seven reporting states said no children within their jurisdictions have ever died due to COVID-19.\n\nEven going beyond mortality rates, hospitalization rates also show that children make up a very small chunk of hospitalized COVID-19 cases.\n\nAmong 23 states and New York City, children made up between 1.6 to 3.5 percent of total cumulated hospitalizations. Furthermore, in these 23 states and New York City, hospitalized child COVID-19 cases only accounted for 0.2 to 1.9 percent of all coronavirus cases.\n\nThe data clearly shows that children are not in danger of contracting COVID-19, and if they do, they will most likely come out of it with little trouble.\n\nLearn more about the unscientific push to mandate masks in schools by reading the latest articles at Pandemic.news.", "opengraph": {"title": "NIH director admits school mask mandates not based on science", "type": "article", "url": "https://www.campusinsanity.com/2021-08-19-nih-director-school-mask-mandates-not-scientific.html", "site_name": "Campus Insanity Com", "description": "The director of the National Institutes of Health (NIH) admitted on Tuesday, Aug. 17, that the push to make schoolchildren wear masks to supposedly protect them against the Wuhan coronavirus (COVID-19) is not based on scientific data. The director, Dr. Francis Collins, talked about the debate surrounding forcing children to wear masks while in schools during an interview with […]", "image": "https://www.campusinsanity.com/wp-content/uploads/sites/61/2021/08/Children-School-Pandemic-Mask-Hand-Sanitizer.jpg"}, "tags": ["covid-19", "mask mandate", "masks", "school mask mandates", "public education", "American schools", "Medical Tyranny", "truth", "coronavirus", "children's health", "campus insanity"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/nih-director-admits-school-mask-mandates-are-not-based-on-data-of-covid-19s-effect-on-children_3952495.html", "https://www.naturalnews.com/2021-08-13-family-doctor-indiana-school-board-masks-vaccines.html", "http://propaganda.news", "https://data.cdc.gov/NCHS/Provisional-COVID-19-Deaths-Focus-on-Ages-0-18-Yea/nr4s-juj3/data", "https://www.aap.org/en/pages/2019-novel-coronavirus-covid-19-infections/children-and-covid-19-state-level-data-report/", "https://pandemic.news/", "https://www.theepochtimes.com/nih-director-admits-school-mask-mandates-are-not-based-on-data-of-covid-19s-effect-on-children_3952495.html", "https://data.cdc.gov/NCHS/Provisional-COVID-19-Deaths-Focus-on-Ages-0-18-Yea/nr4s-juj3/data", "https://www.aap.org/en/pages/2019-novel-coronavirus-covid-19-infections/children-and-covid-19-state-level-data-report/"], "authors": [], "publish_date": null}