{"result_id": "058038", "URL": "https://campusinsanity.com/2022-04-05-canadian-university-fires-49-unvaccinated-staff-members.html", "timestamp": "2023-04-25 14:33:57 CEST+0200", "meta": {"description": "The University of Waterloo in Ontario has fired 49 staff members for not complying with its mandatory COVID-19 vaccine policy, even as the institution relaxes its virus-related rules for other people on campus. CTV News reports that the 49 staff members were terminated last week over their unwillingness to get the jab. The move came […]", "lang": "en", "keywords": "badhealth,badmedicine,campus insanity,Canada,covid-19,health freedom,Liberty,medical fascism,Medical Tyranny,pandemic,public schools,University of Waterloo,vaccine mandates,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://campusinsanity.com/2022-04-05-canadian-university-fires-49-unvaccinated-staff-members.html", "encoding": "UTF-8"}, "image": null, "domain": "campusinsanity.com", "title": "Top Canadian university fires 49 staff members for not getting the COVID-19 vaccine", "cleaned_text": "Top Canadian university fires 49 staff members for not getting the COVID-19 vaccine\n\nThe University of Waterloo in Ontario has fired 49 staff members for not complying with its mandatory COVID-19 vaccine policy, even as the institution relaxes its virus-related rules for other people on campus.\n\nCTV News reports that the 49 staff members were terminated last week over their unwillingness to get the jab. The move came after the province of Ontario dropped all of its COVID-19 mandates and other schools announced they would be phasing out their own policies soon.\n\nThe school’s vice president of university relations, Nick Manning, said: “We have an obligation under the Health and Safety Act to protect our employees, and the employees have the obligation to comply.”\n\n“All of those who weren’t able to be compliant after progressive measures faced the ultimate result of termination,” he added, referring to progressive measures used against these employees that included both paid and unpaid leave.\n\nManning also told the outlet that 170 employees and students had been given an accommodation for religious or medical grounds.\n\nThe school recently posted on its COVID-19 informational website and social media accounts that although it will stop enforcing mask and vaccine mandates beginning May 1 for entry to campus, its injection policy will remain in place for “all members of our community.” They added that the vaccine and mask requirements for visitors may be brought back on short notice depending on how the pandemic continues to play out.\n\nIn their posting, they stated: “To ensure we can minimize any disruption to work and learning if this happens, we will maintain a requirement for all members of our community to provide information on their up to date vaccination status.”\n\nThey went on to recommend that everyone get their third and fourth doses when eligible and ensure they have access to proof of vaccination.\n\nOther Canadian universities plan to welcome back employees who chose not to get vaccinated\n\nAlthough the University of Waterloo is diverging from the government’s stance, several other schools have taken a more accepting view of those wishing to exercise their health freedom. The University of Toronto, the University of Guelph, Wilfrid Laurier University and Ryerson University have all recently announced that people who had been placed on leave over their vaccination status will be able to return to their jobs later this spring when the mandates are lifted.\n\nAt the University of Waterloo, the “vast majority” of the 49 employees terminated last week are believed to be non-faculty members. However, at least one faculty member, a chemistry professor, was recently fired, while at least two other professors and one lecturer were also said to be facing termination.\n\nIn contrast to the University of Waterloo’s hardline stance, neighboring institution Wilfrid Laurier University has not terminated a single employee under its mandatory vaccination policy; those employees who did not comply were given an unpaid leave of absence instead. However, they will be pausing the proof of vaccination requirement after May 1, when all staff and faculty with active contracts will be invited to return to working in-person.\n\nIt is disappointing but not surprising to see universities remaining steadfast in these requirements, even as growing evidence shows that vaccine mandates are not effective in tackling the virus. Many experts have expressed concerns that the potential harm caused by these jabs outweigh the benefits for many people given the millions of injuries and thousands of deaths that have been reported related to the vaccine and the virus’s high survivability among most groups of people, along with the minimal risk of asymptomatic spread.", "opengraph": {"title": "Top Canadian university fires 49 staff members for not getting the COVID-19 vaccine", "type": "article", "url": "https://www.campusinsanity.com/2022-04-05-canadian-university-fires-49-unvaccinated-staff-members.html", "site_name": "Campus Insanity Com", "description": "The University of Waterloo in Ontario has fired 49 staff members for not complying with its mandatory COVID-19 vaccine policy, even as the institution relaxes its virus-related rules for other people on campus. CTV News reports that the 49 staff members were terminated last week over their unwillingness to get the jab. The move came […]", "image": "https://www.campusinsanity.com/wp-content/uploads/sites/61/2022/04/Woman-Nurse-Vaccine-Mask-Covid-19-Coronavirus.jpg"}, "tags": ["pandemic", "covid-19", "Liberty", "medical fascism", "vaccine wars", "Canada", "vaccine mandates", "Medical Tyranny", "public schools", "vaccines", "health freedom", "University of Waterloo", "campus insanity"], "tweets": [], "movies": [], "links": ["https://uwaterloo.ca/", "https://www.lifesitenews.com/news/top-canadian-university-terminates-49-staff-over-vaccination-status/", "https://kitchener.ctvnews.ca/university-of-waterloo-terminates-49-staff-over-vaccine-rules-1.5835128", "https://uwaterloo.ca/coronavirus/news/changing-our-public-health-restrictions", "https://www.wlu.ca/", "https://www.therecord.com/news/waterloo-region/2022/03/24/wilfrid-laurier-university-says-no-staff-or-faculty-fired-over-vaccine-mandate.html", "https://healthfreedom.news/", "https://www.lifesitenews.com/news/top-canadian-university-terminates-49-staff-over-vaccination-status/", "https://uwaterloo.ca/coronavirus/news/changing-our-public-health-restrictions", "https://kitchener.ctvnews.ca/university-of-waterloo-terminates-49-staff-over-vaccine-rules-1.5835128", "https://www.therecord.com/news/waterloo-region/2022/03/24/wilfrid-laurier-university-says-no-staff-or-faculty-fired-over-vaccine-mandate.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcampusinsanity%2F2022-04-05-canadian-university-fires-49-unvaccinated-staff-members.html&linkname=Top%20Canadian%20university%20fires%2049%20staff%20members%20for%20not%20getting%20the%20COVID-19%20vaccine", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}