{"result_id": "058029", "URL": "https://www.campusinsanity.com/2022-08-25-brown-withheld-covid-vaccine-injury-facts-students.html", "timestamp": "2023-04-25 14:33:51 CEST+0200", "meta": {"description": "Lawmakers from Rhode Island and elsewhere are calling on Brown University to provide answers about a student who had to be hospitalized after receiving a mandatory Wuhan coronavirus (Covid-19) “vaccine.” The young man became very ill following his injections, his doctor indicating that he developed “very high troponin” levels – troponin in excess is linked […]", "lang": "en", "keywords": "brown university,campus insanity,chemical violence,coersion,COVID,crimes against humanity,disinformation,informed consent,injury,mandate,medical ethics,Plandemic,public education,science deception,vaccination,vaccine,vaccine injury facts,vaccine mandates,vaccine wars", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.campusinsanity.com/2022-08-25-brown-withheld-covid-vaccine-injury-facts-students.html", "encoding": "UTF-8"}, "image": null, "domain": "www.campusinsanity.com", "title": "Brown University withheld covid vaccine injury facts from students and staff, participating in crimes against humanity", "cleaned_text": "Brown University withheld covid vaccine injury facts from students and staff, participating in crimes against humanity\n\nLawmakers from Rhode Island and elsewhere are calling on Brown University to provide answers about a student who had to be hospitalized after receiving a mandatory Wuhan coronavirus (Covid-19) “vaccine.”\n\nThe young man became very ill following his injections, his doctor indicating that he developed “very high troponin” levels – troponin in excess is linked to myocarditis, pericarditis and myopericarditis, three types of heart inflammation.\n\n“He got hospitalized my last night on call,” the young man’s doctor said. “I remember his parents were extremely concerned. I had administrators calling me from down south where his parents lived.”\n\nThe incident was reported to the government’s Vaccine Adverse Event Reporting System (VAERS), indicating that a 20-year-old male had to be hospitalized on March 22, 2021, four days after getting shot with Pfizer’s mRNA (messenger RNA) covid injection.\n\nThe young man ended up being diagnosed with myopericarditis, according to the VAERS report. Brown was also notified, though it kept the incident secret from its student and faculty body while continue to require that all students get injected in order to stay enrolled. (Related: Last year, Brown researchers produced a study showing that children who are forced to wear a mask at school all day end up with brain damage.)\n\n“The Rhode Island Department of Health’s hospital database lists a male aged 20 from Florida being admitted in Rhode Island in March 2021 for acute pericarditis, ventricular tachycardia (another heart issue), and trouble breathing,” reports The Epoch Times, noting that Brown president Christina Paxson was notified about the incident.\n\nHow many other students were injured or killed by Brown’s covid jab mandate?\n\nRep. Patricia Morgan (R-R.I.) wrote a letter signed by four doctors to Paxson asking why nobody at Brown acknowledged the hospitalization, and why the student and faculty body was not warned about similar potential adverse events.\n\nTo withhold this information “violates the ethics of risk / benefit-based informed consent, which applies to all vaccinations,” that letter reads.\n\n“Members of their own student body have contracted serious illnesses that are vaccination-induced that the university is not only not telling their students about, but they use coercion to make them take a vaccine that might be harmful to them,” Morgan is quoted as saying to the Times.\n\n“And it’s not giving them a choice, not a realistic choice: ‘Here, either you take the vaccine or we’re gonna derail your future.’ How’s that for a choice? It’s just unethical.”\n\nMorgan and the doctors, along with many others, are now calling on Brown to immediately rescind its Fauci Flu shot mandate for the protection of the rest of the student and faculty body. Neither Brown nor Paxson have responded to that request.\n\nAccording to a study conducted by Brown cardiologists, there are at least five other similar cases of post-injection myocarditis that occurred within the school’s student population that were never acknowledged or addressed.\n\n“I just don’t think that there’s any rationale at this point for mass vaccination, particularly people who are low risk to even the ancestral strains,” argues Dr. Andrew Bostom, a former Brown professor of medicine and one of the doctors who signed Morgan’s letter to school officials.\n\nIn the comment section, someone emphasized that all schools and institutions, and not just Brown, need to immediately rescind all covid jab mandates.\n\n“I’m a nurse and I want my job back,” wrote another about how she was fired from her position for refusing to get shot.\n\n“All mandates should have been stopped a long time ago,” added someone else.\n\nThe latest news about Wuhan coronavirus (Covid-19) “vaccine” tyranny can be found at ChemicalViolence.com.", "opengraph": {"title": "Brown University withheld covid vaccine injury facts from students and staff, participating in crimes against humanity", "type": "article", "url": "https://www.campusinsanity.com/2022-08-25-brown-withheld-covid-vaccine-injury-facts-students.html", "site_name": "Campus Insanity Com", "description": "Lawmakers from Rhode Island and elsewhere are calling on Brown University to provide answers about a student who had to be hospitalized after receiving a mandatory Wuhan coronavirus (Covid-19) “vaccine.” The young man became very ill following his injections, his doctor indicating that he developed “very high troponin” levels – troponin in excess is linked […]", "image": "https://www.campusinsanity.com/wp-content/uploads/sites/61/2022/08/Covid-19-Coronavirus-Nurse-Vaccine-Syringe-Vial.jpg"}, "tags": ["informed consent", "injury", "COVID", "mandate", "campus insanity", "vaccination", "science deception", "vaccine injury facts", "vaccine", "coersion", "medical ethics", "chemical violence", "vaccine wars", "vaccine mandates", "disinformation", "brown university", "crimes against humanity", "public education", "Plandemic"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/doctors-lawmaker-demand-answers-on-hospitalization-of-young-male-after-covid-19-vaccination_4680351.html", "http://www.brown.edu", "https://naturalnews.com/2021-12-30-masks-forced-children-dumb-down-brain-oxygen.html", "http://chemicalviolence.com", "https://www.theepochtimes.com/doctors-lawmaker-demand-answers-on-hospitalization-of-young-male-after-covid-19-vaccination_4680351.html", "https://naturalnews.com/2021-12-30-masks-forced-children-dumb-down-brain-oxygen.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcampusinsanity%2F2022-08-25-brown-withheld-covid-vaccine-injury-facts-students.html&linkname=Brown%20University%20withheld%20covid%20vaccine%20injury%20facts%20from%20students%20and%20staff%2C%20participating%20in%20crimes%20against%20humanity", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}