{"result_id": "058040", "URL": "https://campusinsanity.com/2022-03-18-math-nazis-demand-nonwoke-colleagues-enemies-lists.html", "timestamp": "2023-04-25 14:33:58 CEST+0200", "meta": {"description": "The field of mathematics is “informed by white supremacy,” according to Chad Topaz, founder of the Institute for the Quantitative Study of Inclusion, Diversity and Equity (QSIDE). And the only way to combat this is to identify all suspected “white supremacist” mathematicians in order to put them on “enemies lists.” Topaz, a math professor at […]", "lang": "en", "keywords": "Chad Topaz,Crybullies,culture wars,enemies lists,fascism,gay dog,insanity,LGBT,lgbtq,Liberal Mob,mathemeticians,obey,Public Stances on DEI in Mathematics,QSIDE,speech police,surveillance,thought police,Williams College,woke,wokies", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://campusinsanity.com/2022-03-18-math-nazis-demand-nonwoke-colleagues-enemies-lists.html", "encoding": "UTF-8"}, "image": null, "domain": "campusinsanity.com", "title": "Far-left mathematicians go FULL NAZI, demand their non-woke colleagues be monitored and put on “enemies lists”", "cleaned_text": "Far-left mathematicians go FULL NAZI, demand their non-woke colleagues be monitored and put on “enemies lists”\n\nThe field of mathematics is “informed by white supremacy,” according to Chad Topaz, founder of the Institute for the Quantitative Study of Inclusion, Diversity and Equity (QSIDE). And the only way to combat this is to identify all suspected “white supremacist” mathematicians in order to put them on “enemies lists.”\n\nTopaz, a math professor at Williams College in Williamstown, Mass., is a self-proclaimed expert in “antiracist teaching.” He recently wrote an essay explaining why he believes his non-woke colleagues need to be surveilled and essentially punished for not embracing his ideologies.\n\nThe surveillance lists that Topaz is putting together are supposedly intended to “study” the “racist views” of his colleagues. And many of these colleagues are “really mad” about it, he says.\n\nAs of this writing, QSIDE’s surveillance lists has more than 4,000 names lumped into 26 different categories based on whether or not they signed certain letters that oppose Topaz’s agenda, or if they belong to certain professional organizations that he does not support.\n\nOne letter that raises concerns about “attempts to intimidate a voice within our mathematical community” has 680 signatures. That one calls on the American Mathematical Society (AMS) to “make a clear statement that bullying and intimidation have no place in our community.”\n\nThe “bullying and intimidation” mentioned in that letter refers to an incident from back in 2019 when Topaz tried to get University of California, Davis math professor Abigail Thompson fired for her opposition to mandatory diversity statements.\n\n“Topaz funds [QSIDE] in part by giving donors the gift of ‘diversity statement help’ from his organization,” says Jerry Coyne, an emeritus professor of biology at The University of Chicago.\n\n“Thus, by promoting requirements for diversity statements, Topaz is also plumping for donations to his own organization.”\n\nWhy are the worst fascists in society those who claim to be “anti-fascist?”\n\nThompson herself wrote an opinion piece for The Wall Street Journal that calls out mandatory diversity statements for “too easily becom[ing] a test of political ideology and conformity,” which appears to be Topaz’s goal.\n\nChris from the Karlstack Substack says he tried to contact all 680 signatories of Letter B, of which 125 responded. He says their reactions ranged from “mild amusement, to complete indifference, to anger, shock and disgust.”\n\n“Many said that the point of this list was for Topaz to damage the career prospects of his enemies,” Chris adds.\n\nAnti-math extremism has been on the rise for years now. Back in 2018, for instance, Cacey Wells, a teaching professor at The University of Oklahoma, called for all “gifted” math classes to be abolished because not enough “minorities” are performing well enough to qualify, which Wells says makes the classes “racist.”\n\nTopaz is on a similar crusade, though instead of abolishing certain math classes he is trying to abolish math professors with whom he politically and ideologically disagrees.\n\nThis is the very definition of fascism, which leftists like Topaz claim to oppose. Ironically enough, leftists like Topaz are the epitome of what it means to be a fascist.\n\nTopaz recently deleted his Twitter account in shame after being exposed for manipulating data, meaning he is both an agitator and a liar. Topaz now has a new Twitter account that contains no trace of what he was caught spreading previously.\n\n“This country has gone insane,” wrote someone at the Karlstack Substack.\n\n“It’s MATH for crying out loud!!! Numbers! How can you claim math is white? Who gets the highest scores in math based on research and testing scores? Hint … it’s not us white people! The USA doesn’t even crack the top 5 countries. They’re all Asian countries.”\n\nMore related stories can be found at Fascism.news.", "opengraph": {"title": "Far-left mathematicians go FULL NAZI, demand their non-woke colleagues be monitored and put on “enemies lists”", "type": "article", "url": "https://www.campusinsanity.com/2022-03-18-math-nazis-demand-nonwoke-colleagues-enemies-lists.html", "site_name": "Campus Insanity Com", "description": "The field of mathematics is “informed by white supremacy,” according to Chad Topaz, founder of the Institute for the Quantitative Study of Inclusion, Diversity and Equity (QSIDE). And the only way to combat this is to identify all suspected “white supremacist” mathematicians in order to put them on “enemies lists.” Topaz, a math professor at […]", "image": "https://www.campusinsanity.com/wp-content/uploads/sites/61/2022/03/Authoritarianism-Autocracy-Despotism-Dictatorship-Fascism-Isolationism-Jingoism.jpg"}, "tags": ["Public Stances on DEI in Mathematics", "speech police", "lgbtq", "culture wars", "mathemeticians", "obey", "enemies lists", "wokies", "Chad Topaz", "Liberal Mob", "Crybullies", "surveillance", "thought police", "gay dog", "LGBT", "insanity", "woke", "Williams College", "fascism", "QSIDE"], "tweets": [], "movies": [], "links": ["https://math.williams.edu/profile/cmt6/", "https://www.ucdavis.edu/", "https://www.uchicago.edu/", "https://www.ou.edu/", "http://fascism.news", "https://karlstack.substack.com/p/woke-mathematicians-are-putting-their?s=r", "https://naturalnews.com/2018-09-14-leftists-now-claim-gifted-math-classes-are-racist.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcampusinsanity%2F2022-03-18-math-nazis-demand-nonwoke-colleagues-enemies-lists.html&linkname=Far-left%20mathematicians%20go%20FULL%20NAZI%2C%20demand%20their%20non-woke%20colleagues%20be%20monitored%20and%20put%20on%20%E2%80%9Cenemies%20lists%E2%80%9D", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}