{"result_id": "058001", "URL": "https://campusinsanity.com/2022-01-27-los-angeles-charter-school-segregating-discriminating-unvaccinated.html", "timestamp": "2023-04-25 12:24:19 CEST+0200", "meta": {"description": "A group of students and their parents in Los Angeles are suing a charter school for its discriminatory policies towards students who are not vaccinated against the Wuhan coronavirus (COVID-19). The COVID-19 vaccine mandate for eligible students in New West Charter School in Lost Angeles Westside went into effect last Monday. Many students refused to […]", "lang": "en", "keywords": "badhealth,badmedicine,California,campus insanity,Charter Schools,coronavirus vaccines,covid-19,discrimination,education,health freedom,Los Angeles,medical fascism,Medical Tyranny,New West Charter School,pandemic,school vaccine mandate,schools,segregation,vaccine wars", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://campusinsanity.com/2022-01-27-los-angeles-charter-school-segregating-discriminating-unvaccinated.html", "encoding": "UTF-8"}, "image": null, "domain": "campusinsanity.com", "title": "Los Angeles charter school being sued for SEGREGATING and DISCRIMINATING against unvaccinated students", "cleaned_text": "Los Angeles charter school being sued for SEGREGATING and DISCRIMINATING against unvaccinated students\n\nA group of students and their parents in Los Angeles are suing a charter school for its discriminatory policies towards students who are not vaccinated against the Wuhan coronavirus (COVID-19).\n\nThe COVID-19 vaccine mandate for eligible students in New West Charter School in Lost Angeles Westside went into effect last Monday. Many students refused to comply with the mandate, including six who are now suing the school over their right to be educated. (Related: California school board votes not to support, enforce or comply with pending COVID-19 vaccine mandate.)\n\nThe six female students who are part of the lawsuit showed up for school despite being unvaccinated. They believed they would be able to go to class regardless. However, as soon as they arrived school officials denied them entry. They shot videos of the incident on their smartphones while they waited outside the school.\n\nThe video the students took was then shared by the pro-vaccine-choice organization Let Them Breathe. It showed the unvaccinated students being cordoned off behind roped barriers while school officials refused to let them enter their classrooms.\n\n“We’re being threatened to be suspended because we don’t have the COVID-19 vaccine and we’re being refused of the right to attend school,” said one of the students in the video.\n\nSince the video’s release, the unvaccinated students featured in it say they have received even more harassment. One of the students said she has received a constant barrage of messages asking her why she isn’t vaccinated.\n\n“They literally come to message me to fight me about it,” she said. “One, why is it their business? And two, I don’t know why they should care and it’s my personal information.”\n\nAccording to New West, it informed students and parents of the COVID-19 vaccine in Oct. 2021, telling them students would need to provide proof of vaccination and a negative COVID-19 PCR test to be allowed on campus “just like every indoor establishment in Los Angeles is doing.”\n\nOfficials stated students who chose to remain unvaccinated would be provided with “independent study options,” and that their parents were well informed of these options.\n\nThe school bragged about achieving a compliance rate of 96 percent, but “six students who did not follow the new policy still attempted to participate in classes.\n\nSchool officials asked the students to leave, but they refused and insisted on going to class.\n\n“The students proceeded to stage a sit-in directly behind designated areas for student PCR screenings on campus, which was cordoned off with tape,” said the school in its statement. “New West Charter School administration notified local authorities who came to campus and helped alleviate the disruption.”\n\n“Female students were segregated, harassed and threatened with suspension just for trying to participate in their classes, and we will prove in court that this is unjust and unlawful,” said Sharon McKeeman, founder of Let Them Breathe, which is representing the students and their parents in the lawsuit against New West.\n\nLet Them Breathe previously won a lawsuit against San Diego Unified School District’s vaccine mandate late last year. McKeeman said her organization’s lawsuit against New West is very similar and very likely to be successful.\n\n“New West Charter School’s student vaccine mandate is even more egregious than San Diego Unified’s,” said McKeeman.\n\n“We have filed a lawsuit against New West arguing that they are violating state law by mandating this new vaccine, not allowing personal belief exemptions and segregating and denying unvaccinated students their education,” she added.\n\nLet Them Breathe’s lawsuit claims New West’s vaccine mandate violates the Equal Protection Clause in California’s constitution.\n\nThe charter school’s mandate grants “conditional admission” without vaccination for students who are foster youth, homeless, migrants, in a military family or who are participating in an individualized education program.\n\nThe lawsuit says treating these unvaccinated children “more favorably than other unvaccinated children” amounts to discrimination.\n\nAdditionally, the lawsuit claims New West broke California law by not providing a personal beliefs exemption in its vaccine mandate, by violating the students’ right to privacy and by denying California children their “fundamental right to a free public education.”\n\nEditorial: UChicago must end its booster mandate … we are not lab rats.\n\nCovid fascism: Yale threatens students, says they can’t eat at off-campus restaurants.\n\nCanadian university forcing online students to report their vaccination status or be PUNISHED.\n\nWatch this video of one of the New West Charter School students being effectively segregated from the rest of the school due to their vaccination status.\n\nThis video can be found on the channel ZGoldenReport on Brighteon.com.\n\nRead more stories about schools forcing students to get vaccinated at EducationSystem.news.", "opengraph": {"title": "Los Angeles charter school being sued for SEGREGATING and DISCRIMINATING against unvaccinated students", "type": "article", "url": "https://www.campusinsanity.com/2022-01-27-los-angeles-charter-school-segregating-discriminating-unvaccinated.html", "site_name": "Campus Insanity Com", "description": "A group of students and their parents in Los Angeles are suing a charter school for its discriminatory policies towards students who are not vaccinated against the Wuhan coronavirus (COVID-19). The COVID-19 vaccine mandate for eligible students in New West Charter School in Lost Angeles Westside went into effect last Monday. Many students refused to […]", "image": "https://www.campusinsanity.com/wp-content/uploads/sites/61/2022/01/Coronavirus-Children-School-Learning.jpg"}, "tags": ["Los Angeles", "segregation", "health freedom", "campus insanity", "Medical Tyranny", "discrimination", "Charter Schools", "covid-19", "California", "New West Charter School", "vaccine wars", "medical fascism", "pandemic", "coronavirus vaccines", "schools", "education", "school vaccine mandate"], "tweets": [], "movies": [], "links": ["https://www.dailymail.co.uk/news/article-10444529/Los-Angeles-charter-school-facing-suit-unvaxxed-students-denied-access-classrooms.html", "https://ktla.com/news/local-news/unvaccinated-students-challenge-l-a-charter-school-over-right-to-be-in-classroom/", "https://naturalnews.com/2021-11-17-california-school-board-wont-enforce-vaccine-mandate.html", "https://campusinsanity.com/", "https://www.foxnews.com/politics/los-angeles-charter-students-sue-vaccine-segregated", "http://medicaltyranny.com", "https://campusinsanity.com/2022-01-17-uchicago-must-end-its-booster-mandate.html", "https://educationsystem.news/2022-01-11-covid-fascism-yale-threatens-students-eat-restaurants-off-campus.html", "https://campusinsanity.com/2022-01-07-university-fires-medical-ethics-director-challenging-vax-mandates.html", "https://naturalnews.com/2021-12-20-uci-professor-sues-school-covid-vaccine-mandate.html", "https://homeschooling.news/2021-10-07-canada-university-vaccine-mandate-on-online-students.html", "https://www.brighteon.com/e63f28ef-edd1-490b-a075-5b1abe420656", "https://www.brighteon.com/channels/zgoldenreport", "https://www.brighteon.com/channels/zgoldenreport", "https://educationsystem.news/", "https://www.dailymail.co.uk/news/article-10444529/Los-Angeles-charter-school-facing-suit-unvaxxed-students-denied-access-classrooms.html", "https://ktla.com/news/local-news/unvaccinated-students-challenge-l-a-charter-school-over-right-to-be-in-classroom/", "https://www.foxnews.com/politics/los-angeles-charter-students-sue-vaccine-segregated", "https://www.brighteon.com/e63f28ef-edd1-490b-a075-5b1abe420656", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}