{"result_id": "058037", "URL": "https://campusinsanity.com/2022-09-16-ohio-teachers-can-carry-guns-under-hb99.html", "timestamp": "2023-04-25 14:33:56 CEST+0200", "meta": {"description": "School teachers in Ohio can now carry guns to defend their students under the state’s House Bill (HB) 99, which took effect Monday, September 12. HB 99, signed into law by Ohio Gov. Mike DeWine on June 13, also allows principals and school staff to carry firearms on campus and in classrooms. “Our goal continues to […]", "lang": "en", "keywords": "AFT,armed teachers,educators,firearms,first responders,guns,HB 99,law enforcement,Mike DeWine,NEA,ohio,school shooting,Second Amendment,self-defense,shootings,teachers union,Uvalde shooting,violence", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://campusinsanity.com/2022-09-16-ohio-teachers-can-carry-guns-under-hb99.html", "encoding": "UTF-8"}, "image": null, "domain": "campusinsanity.com", "title": "Teachers in Ohio now allowed to carry GUNS as state’s House Bill 99 takes effect", "cleaned_text": "Teachers in Ohio now allowed to carry GUNS as state’s House Bill 99 takes effect\n\nSchool teachers in Ohio can now carry guns to defend their students under the state’s House Bill (HB) 99, which took effect Monday, September 12.\n\nHB 99, signed into law by Ohio Gov. Mike DeWine on June 13, also allows principals and school staff to carry firearms on campus and in classrooms.\n\n“Our goal continues to be to help our schools – public schools, parochial schools [and] private schools – to have the tools they need to help protect our children,” said the Republican governor. “We have an obligation to do everything we can every single day to try and protect our kids.”\n\nPrior to the bill’s passing, only security officers or persons specifically authorized by a board of education were allowed to carry weapons. Persons authorized by education boards must have either 20 years’ experience in law enforcement or 700 hours of peace officer training, as ruled by the Ohio Supreme Court in 2021.\n\nHowever, the requirement can be expensive and time-consuming for any educator wanting to carry a firearm to protect children. Renewed calls to arm educators came following the May 2022 Uvalde, Texas school shooting that saw 21 dead.\n\nHB 99 loosened this requirement by mandating up to 24 hours of initial training and eight more hours of supplemental training annually. Employees allowed to carry firearms must also submit to a yearly criminal record check. Moreover, the specific school or the district that oversees it must provide notice that it has authorized one or more persons to carry guns on campus.\n\nHB 99 helpful for areas not easily accessible to first responders\n\nGOP State Rep. Thomas Hall, the bill’s sponsor, said HB 99 is helpful for rural areas where schools are not easily accessible to first responders. “[While] some of the inner city schools have police officers at their school, some of these rural schools don’t have that luxury.”\n\nGOP State Rep. Phil Plummer, a former county sheriff, agreed with the bill. He explained that HB 99 shortens the “lengthy” process it takes to get first responders to schools in an active shooter situation.\n\n“I’m comfortable my school district would set adequate training and they wouldn’t authorize anybody that wasn’t capable of doing it safely,” said Ohio State House Speaker Bob Cupp, also from the GOP. (Related: Reason versus delusion: Why we need armed defenders in schools to protect the lives of our children.)\n\nDespite the GOP’s support of HB 99, many educators voiced disagreement over the bill. In fact, the leaders of three teachers’ unions vehemently opposed the measure that permitted teachers to arm themselves.\n\nOne union, the National Education Association (NEA), had been critical of allowing school employees to carry guns on campus even before HB 99 became law.\n\n“We need fewer guns in schools, not more,” said NEA President Becky Pringle. “Teachers should be teaching, not acting as armed security guards.”\n\n“Bringing more guns into schools makes schools more dangerous and does nothing to shield our students and educators from gun violence.\n\nAmerican Federation of Teachers (AFT) President Randi Weingarten agreed with Pringle, saying: “The answer to gun violence is not ‘more guns.'” AFT is the second-largest teachers’ union, after the NEA.\n\nJoe Eaton of the Buckeye Firearms Foundation, however, begs to differ.\n\n“We think that’s a benefit for schools. It returns them the option of having enhanced safety and security options in their schools,” said Eaton, who leads the foundation’s FASTER Saves Lives program.\n\nSecondAmendment.news has more stories like this.\n\nWatch this episode of “The Dr. Duke Show” that touches on Ohio Gov. Mike DeWine’s promise to sign HB 99 into law.\n\nThis video is from the FreedomProject Media channel on Brighteon.com.\n\nGunman shoots two students at Maryland high school — armed security officer halts attack in 60 seconds using a loaded weapon.\n\nBreaking: School resource officer shoots and kills ‘suspicious’ man attempting to enter elementary school in Alabama\n\nArmed bystander at Indiana mall as good as 400 cops in Texas: Takes out mass shooter in 15 seconds.\n\nGallup poll: 64 percent of Americans want school officials armed to protect children.\n\nSchools that fail to provide armed defense for children can all be sued.", "opengraph": {"title": "Teachers in Ohio now allowed to carry GUNS as state’s House Bill 99 takes effect", "type": "article", "url": "https://www.campusinsanity.com/2022-09-16-ohio-teachers-can-carry-guns-under-hb99.html", "site_name": "Campus Insanity Com", "description": "School teachers in Ohio can now carry guns to defend their students under the state’s House Bill (HB) 99, which took effect Monday, September 12. HB 99, signed into law by Ohio Gov. Mike DeWine on June 13, also allows principals and school staff to carry firearms on campus and in classrooms. “Our goal continues to […]", "image": "https://www.campusinsanity.com/wp-content/uploads/sites/61/2022/09/Woman-Conceal-Gun-Purse-Pistol-Protection.jpg"}, "tags": ["NEA", "shootings", "Uvalde shooting", "firearms", "HB 99", "educators", "armed teachers", "self-defense", "teachers union", "AFT", "law enforcement", "Mike DeWine", "ohio", "guns", "violence", "Second Amendment", "school shooting", "first responders"], "tweets": [], "movies": [], "links": ["https://www.westernjournal.com/ohio-house-bill-99-goes-effect-teachers-can-now-carry-firearms-try-protect-kids/", "https://www.washingtonexaminer.com/restoring-america/faith-freedom-self-reliance/ohio-teachers-can-now-carry-firearms-in-schools", "https://naturalnews.com/038431_school_shootings_gun_free_zone_police_protection.html", "https://secondamendment.news/", "https://www.brighteon.com/72501535-21f9-4863-a0e7-29deaf5bb645", "https://www.brighteon.com/channels/freedomproject", "https://shootings.news/2018-03-20-gunman-shoots-two-students-at-maryland-high-school.html", "https://secondamendment.news/2022-07-07-officer-shoots-kills-suspicious-man-in-alabama.html", "https://secondamendment.news/2022-08-22-armed-bystander-as-good-as-400-cops-in-texas.html", "https://naturalnews.com/038430_school_shootings_armed_defense_Gallup_poll.html", "https://naturalnews.com/038590_schools_armed_guards_lawsuits.html", "https://www.westernjournal.com/ohio-house-bill-99-goes-effect-teachers-can-now-carry-firearms-try-protect-kids/", "https://www.washingtonexaminer.com/restoring-america/faith-freedom-self-reliance/ohio-teachers-can-now-carry-firearms-in-schools", "https://www.brighteon.com/72501535-21f9-4863-a0e7-29deaf5bb645", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcampusinsanity%2F2022-09-16-ohio-teachers-can-carry-guns-under-hb99.html&linkname=Teachers%20in%20Ohio%20now%20allowed%20to%20carry%20GUNS%20as%20state%E2%80%99s%20House%20Bill%2099%20takes%20effect", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}