{"result_id": "058009", "URL": "https://campusinsanity.com/2022-12-13-chicagos-school-lgbt-grooming-scandal-wake-up-call.html", "timestamp": "2023-04-25 12:24:24 CEST+0200", "meta": {"description": "Christopher Rufo, who has been exposing radical gender ideology in American schools for just over half a year now, has broken another story. The details are genuinely difficult to believe.  (Article by Jonathon Van Maren republished from LifeSiteNews.com) To summarize: Joseph Bruno, the dean of students at Francis W. Parker School, a private prep institution […]", "lang": "en", "keywords": "campus insanity,Chicago,culture wars,education system,evil,gay mafia,gender confused,grooming,indoctrination,left cult,LGBT,lunatics,Pedophilia,Project Veritas,propaganda,public education,trafficking,Twisted,wokies", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://campusinsanity.com/2022-12-13-chicagos-school-lgbt-grooming-scandal-wake-up-call.html", "encoding": "UTF-8"}, "image": null, "domain": "campusinsanity.com", "title": "Chicago’s school LGBT grooming scandal is a wake-up call for America", "cleaned_text": "Christopher Rufo, who has been exposing radical gender ideology in American schools for just over half a year now, has broken another story. The details are genuinely difficult to believe.\n\nTo summarize: Joseph Bruno, the dean of students at Francis W. Parker School, a private prep institution in Chicago that charges $42,000 per year, was filmed by Project Veritas boasting about bringing in the LGBTQ+ Health Center during “Pride Week” to introduce the students to various sexual practices and to distribute sex toys. (The week’s events also included the school bringing in drag queen Alexis Bevels).\n\n\n\n “They were passing around butt plugs and dildos to my students,” Bruno boasted, sporting bright nail polish. “Talking about queer sex. Using lube versus using spit. They’re just like passing around dildos and butt plugs. The kids are just playing with ‘em… in a classroom, while I’m sitting there. They’re like, ‘How does this butt plug work? How do we—like how does this work?”\n\nThe children, he noted, are often as young as fourteen, and the drag queen is there to “pass out cookies and brownies and do photos.”\n\nThe Veritas journalist asked: “And everybody’s cool with that? The butt plugs and the dildos? Any complaints?”\n\n“No,” Bruno replied. He then noted that parents would, in his view, be fine with all of this, and that as far as he knows, the trustees are unaware of what he’s up to because he has “so much freedom.” He was certain they’d find it “wonderful”: “Why would I tell them?”\n\nBruno, as it turns out, was correct in his assumption that the school would back his activities. The Project Veritas videos went viral, but Principal Dan Frank released a letter titled “In Support of our Curriculum, Students, and Employees” to the entire school community. Frank stated that he was “heartbroken” that Bruno’s words “have been severely misrepresented for a malicious purpose” by a “far-right activist group” in “an effort to discredit” “mainstream media organizations, progressive groups, and educational institutions.”\n\nFrank thus claims simultaneously that the videos are “deceptively edited” but defends the content being described in said videos; he also insists that the programming that attracted such backlash has the support of everyone in charge. For Frank, Bruno, and Parker’s higher-ups, “inclusivity” means “handing out sex toys to students” and spending a week doing what amounts to grooming. (If literally instructing children in how to use butt plugs is not grooming, then nothing is, regardless of how much gaslighting the LGBT movement attempts to unleash on this issue).\n\nMany of us have been sounding the alarm on the sexualization of children for several years now, noting that this has always been the goal of the sexual revolutionaries right from the beginning. Stories like this are important because they highlight not only that it is happening, but that when confronted with evidence that it is happening, those who are perpetrating the grooming insist that they are only doing good work in the service of inclusivity and tolerance—while those exposing the grooming are mean, “far-right” hatchet artists. If “far-right” means opposing handing out sex toys to kids, I think that category includes far, far more people than Parker’s elites might suspect. They are trying to gaslight us. They should not be allowed to get away with it.", "opengraph": {"title": "Chicago’s school LGBT grooming scandal is a wake-up call for America", "type": "article", "url": "https://www.campusinsanity.com/2022-12-13-chicagos-school-lgbt-grooming-scandal-wake-up-call.html", "site_name": "Campus Insanity Com", "description": "Christopher Rufo, who has been exposing radical gender ideology in American schools for just over half a year now, has broken another story. The details are genuinely difficult to believe.  (Article by Jonathon Van Maren republished from LifeSiteNews.com) To summarize: Joseph Bruno, the dean of students at Francis W. Parker School, a private prep institution […]", "image": "https://www.campusinsanity.com/wp-content/uploads/sites/61/2023/04/Girl-Cry-Scarf.jpg"}, "tags": ["LGBT", "Chicago", "culture wars", "grooming", "Twisted", "public education", "campus insanity", "gender confused", "evil", "education system", "indoctrination", "Project Veritas", "lunatics", "wokies", "gay mafia", "propaganda", "Pedophilia", "left cult", "trafficking"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe title=\"YouTube video player\" src=\"https://www.youtube.com/embed/BQT10dSPldw\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe>", "src": "https://www.youtube.com/embed/BQT10dSPldw"}], "links": ["https://www.lifesitenews.com/blogs/chicagos-school-lgbt-grooming-scandal-is-a-wake-up-call-for-america/", "https://www.projectveritas.com/news/elite-chicago-private-schools-dean-of-students-brags-about-bringing-in-lgbtq/", "https://jonathonvanmaren.substack.com/p/the-architects-of-the-sexual-revolution?utm_source=%2Fprofile%2F26294840-jonathon-van-maren&utm_medium=reader2", "https://www.lifesitenews.com/blogs/chicagos-school-lgbt-grooming-scandal-is-a-wake-up-call-for-america/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcampusinsanity%2F2022-12-13-chicagos-school-lgbt-grooming-scandal-wake-up-call.html&linkname=Chicago%E2%80%99s%20school%20LGBT%20grooming%20scandal%20is%20a%20wake-up%20call%20for%20America", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}