{"result_id": "059022", "URL": "https://cancer.news/2022-04-15-ivermectin-cancer-cure-nine-studies-conclude.html", "timestamp": "2023-04-25 14:34:20 CEST+0200", "meta": {"description": "By now, most plandemic skeptics are aware of the fact that ivermectin, a cheap, off-patent anti-malaria drug, is a powerful remedy for the Wuhan coronavirus (Covid-19), hence why the government does not want people to have it. But did you also know that ivermectin treats cancer? At least nine different peer-reviewed studies demonstrate how safe […]", "lang": "en", "keywords": "alternative medicine,anticancer,cancer solutions,cancer treatments,COVID,discoveries,goodcancer,goodhealth,goodmedicine,goodscience,ivermectin,Oncology,remedy,research", "favicon": "wp-content/themes/ScienceTheme/images/Cancer-fav.png", "canonical": "https://cancer.news/2022-04-15-ivermectin-cancer-cure-nine-studies-conclude.html", "encoding": "UTF-8"}, "image": null, "domain": "cancer.news", "title": "Ivermectin is a powerful anti-cancer remedy, 9 peer-reviewed studies conclude", "cleaned_text": "By now, most plandemic skeptics are aware of the fact that ivermectin, a cheap, off-patent anti-malaria drug, is a powerful remedy for the Wuhan coronavirus (Covid-19), hence why the government does not want people to have it. But did you also know that ivermectin treats cancer?\n\nAt least nine different peer-reviewed studies demonstrate how safe and effective ivermectin wards off the Big C, threatening the multi-billion dollar cancer industry. There are two industries, in other words, that ivermectin threatens: the covid industry and the cancer industry.\n\n1) In 2017, research published in the journal Biochemical and Biophysical Research Communications found that ivermectin preferentially treats renal cell carcinoma (RCC) while protecting normal kidney cells. RCC tumor growth is also delayed by ivermectin, which induces mitochondrial dysfunction and oxidative stress while increasing mitochondrial biogenesis.\n\n2) A year later, research published in the journal Molecular Medicine Reports found that ivermectin preferentially targets stem cell population in MDA-MB-231 human breast cancer cells.\n\n“Ivermectin has been demonstrated to be safe, following treatment of millions of patients with onchocerciasis and other parasitic diseases, which makes it a strong candidate for further studies investigating its potential use as a repurposed drug for cancer therapy,” reported the National Cancer Institute in Mexico City.\n\n3) Another study published that same year in the American Journal of Cancer Research, also out of Mexico, determined that ivermectin is “a strong candidate for repositioning” as an anti-tumor remedy.\n\n4) An earlier study published in EMBO Molecular Medicine back in 2014 similarly found that ivermectin inhibits the expression of WNT-TCF targets, which are implicated in both intestinal and lung cancers.\n\nIvermectin selectively inhibits TCF-dependent, but not TCF-independent, xenograft growth without causing any obvious side effects.\n\n“In vivo, Ivermectin selectively inhibits TCF-dependent, but not TCF-independent, xenograft growth without obvious side effects. Given that Ivermectin is a safe anti-parasitic agent used by 200 million people against river blindness, our results suggest its additional use as a therapeutic WNT-TCF pathway response blocker to treat WNT-TCF-dependent diseases including multiple cancers,” researchers wrote.\n\nIvermectin works wonders against cancers of all types\n\n5) In 2020, research published in Pharmacological Research identified ivermectin as a drug that promotes the death of cancer cells by regulating the tumor micro-environment in breast cancer.\n\nIvermectin also preferentially targets leukemia cells at low concentrations while leaving normal hematopoietic cells alone. The drug also targets various ovarian cancer cells lines and also inhibits the proliferation of five renal cell carcinoma cell lines without affecting normal kidney cells.\n\n6) Also in 2020, a study published in the EPMA Journal found that ivermectin hits specific targets in ovarian cancer, suppressing ovarian cancer cells. The drug worked so well that researchers said it can be used to make personalized drug therapy, also known as predictive, preventive, and personalized medicine (PPPM), for ovarian cancer.\n\n7) Researchers from the Instituto Nacional de Cancerologia in Mexico City discovered that same year that ivermectin reduces both cell viability and colony formation capacity while fighting against tumors.\n\n8) In 2021, research published in the journal Frontiers in Pharmacology concluded that ivermectin increases ROS production and inhibits the cell cycle in the S phase to inhibit colorectal cancer cells.\n\n9) Also in 2021, research published in the journal BMC Cancer found that ivermectin inhibits the proliferation of esophageal squamous cell carcinoma (ESCC) cells by inducing mitochondrial dysfunction, suppressing NF-?B signaling and promoting apoptosis.\n\nAs you can see, ivermectin is something of a wonder drug when it comes to cancer. This is precisely why it is off-limits, and why Americans need to speak out and start demanding access to this inexpensive, life-saving medication.\n\nMore related news coverage can be found at Cancer.news.", "opengraph": {"title": "Ivermectin is a powerful anti-cancer remedy, 9 peer-reviewed studies conclude", "type": "article", "url": "https://www.cancer.news/2022-04-15-ivermectin-cancer-cure-nine-studies-conclude.html", "site_name": "Cancer News", "description": "By now, most plandemic skeptics are aware of the fact that ivermectin, a cheap, off-patent anti-malaria drug, is a powerful remedy for the Wuhan coronavirus (Covid-19), hence why the government does not want people to have it. But did you also know that ivermectin treats cancer? At least nine different peer-reviewed studies demonstrate how safe […]", "image": "https://www.cancer.news/wp-content/uploads/sites/380/2022/04/Ivermectin-Prescription-Pills.jpg"}, "tags": ["Oncology", "alternative medicine", "research", "COVID", "ivermectin", "remedy", "anticancer", "cancer treatments", "discoveries"], "tweets": [], "movies": [], "links": ["https://thecovidblog.com/2022/04/11/truth-bombshell-9-peer-reviewed-studies-conclude-that-ivermectin-is-a-powerful-highly-effective-anti-cancer-drug/", "https://naturalnews.com/2022-02-04-japanese-study-ivermectin-safe-effective-treating-covid.html", "https://www.sciencedirect.com/science/article/abs/pii/S0006291X1731656X?via%3Dihub", "https://thecovidblog.com/wp-content/uploads/2022/04/Ivermectin-Cancer4.pdf", "https://thecovidblog.com/wp-content/uploads/2022/04/Ivermectin-Cancer1.pdf", "https://www.brighteon.tv", "https://thecovidblog.com/wp-content/uploads/2022/04/Ivermectin-Cancer9.pdf", "https://thecovidblog.com/wp-content/uploads/2022/04/Ivermectin-Cancer2.pdf", "https://thecovidblog.com/wp-content/uploads/2022/04/Ivermectin-Cancer6.pdf", "https://pubmed.ncbi.nlm.nih.gov/32474842/", "https://thecovidblog.com/wp-content/uploads/2022/04/Ivermectin-Cancer3.pdf", "https://thecovidblog.com/wp-content/uploads/2022/04/Ivermectin-Cancer7.pdf", "https://cancer.news", "https://thecovidblog.com/2022/04/11/truth-bombshell-9-peer-reviewed-studies-conclude-that-ivermectin-is-a-powerful-highly-effective-anti-cancer-drug/", "https://naturalnews.com/2022-02-04-japanese-study-ivermectin-safe-effective-treating-covid.html", "https://www.sciencedirect.com/science/article/abs/pii/S0006291X1731656X?via%3Dihub", "https://thecovidblog.com/wp-content/uploads/2022/04/Ivermectin-Cancer4.pdf", "https://thecovidblog.com/wp-content/uploads/2022/04/Ivermectin-Cancer1.pdf", "https://thecovidblog.com/wp-content/uploads/2022/04/Ivermectin-Cancer9.pdf", "https://thecovidblog.com/wp-content/uploads/2022/04/Ivermectin-Cancer2.pdf", "https://thecovidblog.com/wp-content/uploads/2022/04/Ivermectin-Cancer6.pdf", "https://pubmed.ncbi.nlm.nih.gov/32474842/", "https://thecovidblog.com/wp-content/uploads/2022/04/Ivermectin-Cancer3.pdf", "https://thecovidblog.com/wp-content/uploads/2022/04/Ivermectin-Cancer7.pdf", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcancernews%2F2022-04-15-ivermectin-cancer-cure-nine-studies-conclude.html&linkname=Ivermectin%20is%20a%20powerful%20anti-cancer%20remedy%2C%209%20peer-reviewed%20studies%20conclude", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}