{"result_id": "059017", "URL": "https://www.cancer.news/2019-03-20-the-scary-truth-about-bpa-free-cans-revealed.html", "timestamp": "2023-04-25 14:34:16 CEST+0200", "meta": {"description": "Bisphenol A (BPA) is found in many consumer products such as plastic containers, wraps, water bottles, and the lining of metal cans. It has been used since the 1960s to harden plastic or form a protective layer between the food and the can. Previous studies, however, have shown that BPA can sometimes leach into the […]", "lang": "en", "keywords": "badhealth,bisphenol A,BPA,cancer causes,cans,health risk,hormone disruptor,Plastic,products,toxic chemicals", "favicon": "wp-content/themes/ScienceTheme/images/Cancer-fav.png", "canonical": "https://www.cancer.news/2019-03-20-the-scary-truth-about-bpa-free-cans-revealed.html", "encoding": "UTF-8"}, "image": null, "domain": "www.cancer.news", "title": "The scary truth about BPA-free cans revealed", "cleaned_text": "Bisphenol A (BPA) is found in many consumer products such as plastic containers, wraps, water bottles, and the lining of metal cans. It has been used since the 1960s to harden plastic or form a protective layer between the food and the can. Previous studies, however, have shown that BPA can sometimes leach into the food, eventually ending up in our body. In 2004, the U.S. Centers for Disease Control and Prevention (CDC), found BPA traces in the urine samples of nearly all the people they tested, young children included.\n\nThough the U.S. Food and Drug Administration (FDA), claims that the levels of BPA found in our food are safe, others have sounded the alarm about the potential risks of BPA. Even in small doses, this disruptive chemical can cause dramatic changes in metabolism, and affect the reproductive and nervous system. It has been linked to infertility, breast and prostate cancer, heart diseases, type 2 diabetes, obesity, and asthma. Also, BPA may affect the brain development of young children, causing behavioral problems or ADHD.\n\nIn response to consumers concerns, health advocacy groups have relentlessly fought for the removal of the chemical from the market. In 2013, the FDA banned BPA from baby bottles and baby food packaging. Though many food companies have voluntarily agreed to go BPA-free, according to a recent study, many major food companies are still coating their metal food cans with BPA.\n\nThe study, conducted by a group of nonprofit organizations including the Breast Cancer Fund and Ecology Center, also found that the majority of the so-called safe cans that bear the BPA-free claim on their label aren’t always the better solution.\n\nFor their study, the researchers analyzed nearly 200 cans from food giants such as Campbell Soup Company, Del Monte, General Mills, Annie’s Homegrown, and Eden Foods. The authors of the study reported that two out of three cans still had BPA in their lining. From all the brands tested, Campbell ranked worst.\n\nAside from BPA, acrylic resins, oleoresin, polyester resins, and polyvinyl chloride (PVC) copolymers were identified during the testing. The researchers found that 18 percent of retailers’ private-label food and 36 percent of national brands were coated with a PVC-based copolymer. PVC is far from a safe BPA alternative. It is a known human carcinogen made from dangerous chemicals such as vinyl chloride.\n\nShortly after the release of the report, Campbell Soup announced to eliminate all BPA in canned foods by mid-2017, while Del Monte promised to switch to BPA-free lining in all fruit, tomato, and most vegetable items.\n\nCampbell Soup said that they started to use alternative linings made from acrylic and polyester in March, noting that they are still on track to have 75 percent of the cans BPA-free by the end of the year. The products include all soups, gravies, SpaghettiOs pasta, and Swanson broth.\n\n“Our priority throughout this transition has been, and will continue to be, food safety,” Mike Mulshine, senior program manager of packaging, said in a statement. “We have tested and conducted trials with hundreds of alternatives to BPA lining and believe the acrylic and polyester options will ensure our food remains safe, affordable and tastes great.”\n\nGiven the adverse effects of BPA and some BPA-free replacements, the authors of the study noted that big brands, grocery, retail, and dollar stores should eliminate all BPA from their products and clearly state the substitute on the label.\n\nNext time you buy BPA-free products, don’t assume you are making a better decision. To avoid these questionable chemicals, opt for home-canned foods or products canned in glass jars. Or even better, forget about canned foods altogether and feed your family fresh, organic foods – homegrown if possible.", "opengraph": {"title": "The scary truth about BPA-free cans revealed", "type": "article", "url": "https://www.cancer.news/2019-03-20-the-scary-truth-about-bpa-free-cans-revealed.html", "site_name": "Cancer News", "description": "Bisphenol A (BPA) is found in many consumer products such as plastic containers, wraps, water bottles, and the lining of metal cans. It has been used since the 1960s to harden plastic or form a protective layer between the food and the can. Previous studies, however, have shown that BPA can sometimes leach into the […]", "image": "https://www.cancer.news/wp-content/uploads/sites/380/2019/03/Canned-Food.jpg"}, "tags": ["bisphenol A", "cans", "Plastic", "products", "health risk", "toxic chemicals", "hormone disruptor", "BPA"], "tweets": [], "movies": [], "links": ["https://www.motherearthnews.com/natural-health/be-wary-of-bpa-replacements-zm0z16aszkin", "https://www.naturalnews.com/054946_bisphenol_A_reproductive_health_nervous_system.html", "http://www.toxicfoodcans.org/wp-content/uploads/2016/03/BPA-BuyerBeware.pdf", "http://www.naturalnews.com/99-Health-Ranger-Rules-for-Reading-Labels.html", "https://www.brighteon.tv", "https://www.theguardian.com/sustainable-business/2016/mar/31/bpa-chemical-canned-food-general-mills-campbells-soup-del-monte-fda", "http://chemicals.news/", "http://growbox.naturalnews.com/growbox.html", "http://www.motherearthnews.com/natural-health/be-wary-of-bpa-replacements-zm0z16aszkin", "https://www.theguardian.com/sustainable-business/2016/mar/31/bpa-chemical-canned-food-general-mills-campbells-soup-del-monte-fda", "http://www.toxicfoodcans.org/wp-content/uploads/2016/03/BPA-BuyerBeware.pdf", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcancernews%2F2019-03-20-the-scary-truth-about-bpa-free-cans-revealed.html&linkname=The%20scary%20truth%20about%20BPA-free%20cans%20revealed", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}