{"result_id": "059026", "URL": "https://www.cancer.news/2022-10-02-vaccine-promoting-doctor-says-covid-jab-accelerated-his-cancer.html", "timestamp": "2023-04-25 14:34:23 CEST+0200", "meta": {"description": "A Belgian immunologist and top medical analyst got a Covid booster shot, his third dose of Pfizer’s clot shot, and is now suffering a barrage of cancer lesions like “fireworks” in his lymph nodes. Michel Goldman, who used to run an institute for vaccine technology analysis, had previously been very outspoken about promoting the “security” […]", "lang": "en", "keywords": "badcancer,badhealth,badmedicine,Big Pharma,cancer,cancer causes,cancer fuel,cancer trigger,chemical violence,clot shots,covid vaccines,disease causes,immunology,lymphoma,medical violence,mRNA,pharmaceutical fraud,science deception,spike protein,vaccine cancer,vaccine danger,Vaccine deaths,vaccine injury,vaccine wars,vaccines", "favicon": "wp-content/themes/ScienceTheme/images/Cancer-fav.png", "canonical": "https://www.cancer.news/2022-10-02-vaccine-promoting-doctor-says-covid-jab-accelerated-his-cancer.html", "encoding": "UTF-8"}, "image": null, "domain": "www.cancer.news", "title": "Vaccine promoting doctor now says Covid jab ACCELERATED his cancer, leading to a barrage of new lymphoma cancer lesions", "cleaned_text": "Vaccine promoting doctor now says Covid jab ACCELERATED his cancer, leading to a barrage of new lymphoma cancer lesions\n\nA Belgian immunologist and top medical analyst got a Covid booster shot, his third dose of Pfizer’s clot shot, and is now suffering a barrage of cancer lesions like “fireworks” in his lymph nodes. Michel Goldman, who used to run an institute for vaccine technology analysis, had previously been very outspoken about promoting the “security” of Covid jabs, especially mRNA, claiming that if there was any “actual downside” to the clot shots, that we would know already. He was dead wrong.\n\nLike so many others who splatter their unfounded opinions about Fauci Flu shots all over the news and medical journals, Goldman is now suffering the irony of his own advice. His cancer prognosis, according to diagnostics, has been severely exacerbated by the clot shots, and the booster in particular.\n\nCancer preys on weakened tissue, and Covid vaccines clog the vascular system, depriving organs and tissues of vital oxygen and nutrients\n\nThe risk outweighs the benefits when it comes to the Covid clot shots. That has become more than obvious with time, and now even top immunologists who got the clot shots are not only admitting it, but suffering the consequences themselves. The mRNA vaccines instruct human cells to create an endless barrage of toxic spike proteins (prions) in the vascular system, that spread throughout the body, despite what was said at the beginning (that they remain at the site of injection).\n\nNow, most cancers are linked to the mRNA vaccines, and the vaccine industrial complex and the fake news mass media (MSM) are trying their best to keep it all under wraps. Goldman’s cancer is the kind that attacks T cells that coordinate the body’s immune response to invading pathogens. Yet, mRNA vaccines create billions of invading pathogens in order to stimulate an immune response to SARS-CoV-2. Now, Goldman’s T-cell lymphoma just got assisted in its invasion by a whole army of pathogens, and there’s no end in sight for their continued barrage. It seems the mRNA vaccines have stimulated tumors and lesions, making Goldman’s cancer much, much worse.\n\nToxic Covid vaccines can tip the scales and trigger the next stage of cancer tumors and lesions\n\nA longtime immunologist, medical innovator and vaccine promoter is now second-guessing the mRNA jabs as his cancer has gotten much worse since the Pfizer booster shot. Cancer is defined as the uncontrollable division and multiplication of mutated cells that turn and attack healthy cells. Cancer feeds off chemicals and pathogens in the body, and the continued development and spread of cancer is fueled by a lack of oxygen and nutrients in the blood.\n\nIn general, lymphoma is considered to be fairly treatable, but that success can vary greatly based on several factors, and when the body is invaded by new pathogens, lymphoma can become quite aggressive and progress rapidly. One recent study done at an immunosciences lab revealed that spike proteins can …”increase the risk of developing autoimmunity and implies that the mRNA and DNA vaccines, which cause the body to make large amounts of spike protein, would do the same.”\n\nIn other words, the jab-induced spike proteins are causing sudden cancers to develop and others to immediately relapse, including reports of neuromyelitis, multiple sclerosis, Guillain-Barre syndrome, rheumatoid arthritis, shingles, lupus, diabetes and many other autoimmune conditions.\n\nThe Covid jab is causing autoimmunity, where the body’s immune system is becoming confused and attacking its own tissues. Covid vaccines, which are not really vaccines at all, are exposing the body to unnecessary toxins and clogging the vascular system all the while. Now those suffering spike protein syndrome are seeing an uptick in cancer cells and wondering how it’s happening, because most medical doctors and oncologists are told to never blame vaccines. Still, the truth is coming out, and even top immunologists are exposing the Fauci Flu jabs as more of a risk than a benefit.\n\nTune your scamdemic frequency to Censored.news for truth news about the Covid clot shots that’s being censored from the rest of media as you read this.", "opengraph": {"title": "Vaccine promoting doctor now says Covid jab ACCELERATED his cancer, leading to a barrage of new lymphoma cancer lesions", "type": "article", "url": "https://www.cancer.news/2022-10-02-vaccine-promoting-doctor-says-covid-jab-accelerated-his-cancer.html", "site_name": "Cancer News", "description": "A Belgian immunologist and top medical analyst got a Covid booster shot, his third dose of Pfizer’s clot shot, and is now suffering a barrage of cancer lesions like “fireworks” in his lymph nodes. Michel Goldman, who used to run an institute for vaccine technology analysis, had previously been very outspoken about promoting the “security” […]", "image": "https://www.cancer.news/wp-content/uploads/sites/380/2022/10/Cancer-Cell-Background-Disease-Abstract-Metastasis-Defense.jpg"}, "tags": ["vaccine danger", "Big Pharma", "medical violence", "cancer trigger", "covid vaccines", "vaccine cancer", "science deception", "disease causes", "spike protein", "chemical violence", "immunology", "clot shots", "vaccine wars", "lymphoma", "cancer fuel", "cancer", "Vaccine deaths", "vaccine injury", "vaccines", "mRNA", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://www.theatlantic.com/science/archive/2022/09/mrna-covid-vaccine-booster-lymphoma-cancer/671308/", "https://breast-cancers.com/2022/09/24/did-a-well-known-physicians-covid-shot-make-his-most-cancers-worse/", "https://www.brighteon.tv", "https://www.theepochtimes.com/spike-protein-from-infection-and-vaccines-contributing-to-autoimmune-diseases-studies-suggest_4735518.html", "https://www.naturalnews.com/2022-01-29-rubbery-blood-clots-in-bodies-of-vaccinated.html", "https://www.naturalnews.com/2022-07-16-spike-protein-syndrome-is-sweeping-america.html", "https://www.naturalnews.com/2022-07-28-dna-testing-kits-scam-ethnicity-specific-bioweapons.html", "https://breast-cancers.com/2022/09/24/did-a-well-known-physicians-covid-shot-make-his-most-cancers-worse/", "https://www.theatlantic.com/science/archive/2022/09/mrna-covid-vaccine-booster-lymphoma-cancer/671308/", "https://www.naturalnews.com/2022-06-29-covid-vaccines-killed-750000-people-united-states.html", "https://www.theepochtimes.com/spike-protein-from-infection-and-vaccines-contributing-to-autoimmune-diseases-studies-suggest_4735518.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcancernews%2F2022-10-02-vaccine-promoting-doctor-says-covid-jab-accelerated-his-cancer.html&linkname=Vaccine%20promoting%20doctor%20now%20says%20Covid%20jab%20ACCELERATED%20his%20cancer%2C%20leading%20to%20a%20barrage%20of%20new%20lymphoma%20cancer%20lesions", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}