{"result_id": "059016", "URL": "https://www.cancer.news/2022-01-21-mrna-covid-vaccines-increase-hospitalization-death-rates.html", "timestamp": "2023-04-25 14:34:15 CEST+0200", "meta": {"description": "Dr. Sherri Tenpenny told Dr. Steve Hotze that the Pfizer and Moderna mRNA vaccines being used against the Wuhan coronavirus (COVID-19) are increasing hospitalization and death rates. “Vaccines, by definition, are supposed to keep you from getting sick, keep you from transmitting the infection to other people, lower the hospitalization rate and lower the death […]", "lang": "en", "keywords": "badcancer,badhealth,badmedicine,Big Pharma,biological weapon,booster,CDC,Dangerous Medicine,heart disease,heart health,hospitalization,immune system,Moderna,mRNA vaccines,pandemic,Pfizer,pharmaceutical fraud,spike protein,vaccine damage,Vaccine deaths,vaccine injury", "favicon": "wp-content/themes/ScienceTheme/images/Cancer-fav.png", "canonical": "https://www.cancer.news/2022-01-21-mrna-covid-vaccines-increase-hospitalization-death-rates.html", "encoding": "UTF-8"}, "image": null, "domain": "www.cancer.news", "title": "Dr. Sherri Tenpenny: mRNA COVID vaccines increase hospitalization and death rates – Brighteon.TV", "cleaned_text": "Dr. Sherri Tenpenny told Dr. Steve Hotze that the Pfizer and Moderna mRNA vaccines being used against the Wuhan coronavirus (COVID-19) are increasing hospitalization and death rates.\n\n“Vaccines, by definition, are supposed to keep you from getting sick, keep you from transmitting the infection to other people, lower the hospitalization rate and lower the death rate. But the COVID shots do just the opposite,” Tenpenny said during the January 17 episode of “The Dr. Hotze Report” on Brighteon.TV.\n\n“They do not keep you from getting sick; they do not stop the transmission to others; they do not lower the hospitalization rate; and they do not lower the death rate. In fact, they increase the hospitalization rate. And they increased the death rate. And by some estimations and some reports, they now say, upwards to 70 percent of people that are in the hospital are due to the side effects of the shots.\n\nSadly, she said, members of the mainstream media are distorting those numbers and lying about them.”\n\nTenpenny pointed out that the mRNA vaccines are experimental injections never before used in human beings. They create spike proteins that cause devastating effects on the immune system and the cardiovascular system. She added that the vaccines also suppress the immune system to allow cancers to grow inside the body.\n\nAccording to the Centers for Disease Control and Prevention (CDC), the mRNA vaccines are teaching cells how to make a protein that will trigger an immune response. The CDC further claims that the vaccines benefit people who get vaccinated by giving them protection against diseases like COVID-19 without the risk of potentially serious consequences.\n\nThe doctor who founded the Tenpenny Integrative Center in Cleveland, Ohio added that having additional vaccination and boosters will cause a massive increase in the number of cases of atrial fibrillation, myocarditis, congestive heart failure and cardiomyopathy.\n\n“What the messenger RNA vaccines do is they ablate, they completely obliterate toll-like receptor 3, 7 and 8, the primary defense of our immune system which makes people more susceptible to getting COVID and any other type of infection. Every single shot that you take damages your heart and makes you more susceptible,” Tenpenny explained.\n\n“The spike protein also makes you more susceptible to get cancer because the spike protein actually can pass inside the nucleus of your cell binding to your DNA and makes that cell divide abnormally, which by definition is a cancer cell.”\n\nTenpenny, who is an osteopathic medical doctor, also cited the explosion of cancer in people who got the shots.\n\n“We’re seeing cancer exploding and becoming a non-treatable resistant cancer to almost any type of chemotherapy that is out there. So we are destroying the heart, destroying the cardiovascular system, destroying our toll-like receptors, our primary innate immune system and we are causing people to get cancer,” the physician from Cleveland, Ohio stressed. (Related: Scientists warn that mRNA vaccines developed by Pfizer and Moderna are causing BLOOD CLOTS.)\n\nTenpenny also talked about using masks, social distancing and the fraudulent use of the polymerase chain reaction (PCR) test.\n\n“What I’ve said from the beginning, we’ve got the myth of the mask. We’ve got hundreds of published studies showing that all the masks do is to make the person who wears them sick. That’s the only thing they do. And they label you as the person out in society who was willing to be compliant, so they can look around and know who the non-compliant people are,” clarified Tenpenny, who has guested on hundreds of radio and national television programs.\n\n“The second thing is about the nonsense of social distancing. It’s just absolutely the biggest joke ever that people believe they’re somehow protected if they stand six feet apart from somebody.”\n\n“What they are doing with these swab samples is DNA harvesting. Harvesting your DNA to put them into the supercomputers and to put them into the place where they are doing quantum computing,” Tenpenny said when asked by Dr. Hotze why people from the medical community are collecting the PCR test results.\n\n“Quantum computers operate at a hundreds if not thousands of times faster than what regular computers do. And what makes them really so nefarious is that quantum computers analyze every possible answer that could possibly be out there all at the same time. And then the computer chooses what the right answer is and tells you how to think in terms of what the best answer is.\n\nWatch the full Jan. 17 episode of “The Dr. Hotze Report” below. Catch new episodes of the program every Monday at 5-6 p.m. on Brighteon.TV.\n\nFollow VaccineDeaths.com to know more about COVID-19 vaccine-related injuries and deaths.", "opengraph": {"title": "Dr. Sherri Tenpenny: mRNA COVID vaccines increase hospitalization and death rates – Brighteon.TV", "type": "article", "url": "https://www.cancer.news/2022-01-21-mrna-covid-vaccines-increase-hospitalization-death-rates.html", "site_name": "Cancer News", "description": "Dr. Sherri Tenpenny told Dr. Steve Hotze that the Pfizer and Moderna mRNA vaccines being used against the Wuhan coronavirus (COVID-19) are increasing hospitalization and death rates. “Vaccines, by definition, are supposed to keep you from getting sick, keep you from transmitting the infection to other people, lower the hospitalization rate and lower the death […]", "image": "https://www.cancer.news/wp-content/uploads/sites/380/2022/01/Covid-19-Coronavirus-Pfizer-Syringe-Vaccine-Vial.jpg"}, "tags": ["pandemic", "vaccine damage", "heart health", "Big Pharma", "Vaccine deaths", "Moderna", "mRNA vaccines", "vaccine injury", "hospitalization", "Pfizer", "pharmaceutical fraud", "heart disease", "spike protein", "immune system", "CDC", "biological weapon", "booster"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/9b7d3230-c858-43f7-9d52-da27d6b61496", "https://brighteon.tv/", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/different-vaccines/mrna.html", "https://www.brighteon.tv", "http://spikeprotein.news", "http://naturalnews.com/2021-05-07-mrna-vaccines-by-pfizer-moderna-blood-clots.html", "http://www.brighteon.com/9b7d3230-c858-43f7-9d52-da27d6b61496", "https://brighteon.tv/", "http://vaccinedeaths.com", "https://www.brighteon.com/9b7d3230-c858-43f7-9d52-da27d6b61496", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/different-vaccines/mrna.html"], "authors": [], "publish_date": null}