{"result_id": "059029", "URL": "https://www.cancer.news/2022-11-15-t-cell-lymphoma-progress-rapidly-mrna-booster-shot.html", "timestamp": "2023-04-25 14:34:26 CEST+0200", "meta": {"description": "Dr. Charles Hoffe, a medical doctor of 28 years in British Columbia, now working at the Lytton Clinic, has done the unthinkable, when it comes to inspecting the so-called “safety and efficacy” of the Fauci Flu jabs that the CDC calls “vaccines.” He ran PET/CT scans on cancer patients who had received the Pfizer mRNA […]", "lang": "en", "keywords": "badcancer,badhealth,badmedicine,Big Pharma,biological weapon,cancer causes,cancer criminals,clot shots,Dangerous Medicine,dr. hoffe,fauci flu,pandemic,pharmaceutical fraud,spike protein,vaccine damage,vaccine injury,vaccines,vascular clots", "favicon": "wp-content/themes/ScienceTheme/images/Cancer-fav.png", "canonical": "https://www.cancer.news/2022-11-15-t-cell-lymphoma-progress-rapidly-mrna-booster-shot.html", "encoding": "UTF-8"}, "image": null, "domain": "www.cancer.news", "title": "VACCINE-INDUCED TURBO CANCER: T-cell lymphoma can progress rapidly due to mRNA booster shot", "cleaned_text": "Dr. Charles Hoffe, a medical doctor of 28 years in British Columbia, now working at the Lytton Clinic, has done the unthinkable, when it comes to inspecting the so-called “safety and efficacy” of the Fauci Flu jabs that the CDC calls “vaccines.” He ran PET/CT scans on cancer patients who had received the Pfizer mRNA booster shot just eight days prior, and found rapid progression of T-cell lymphoma, a dramatic increase of gastrointestinal lesions, and a turbo-effect of spreading of cells in the lymph nodes under the arms near the armpits.\n\nThis is called turbo-cancer, where spike proteins from mRNA jabs serve as a carcinogen – literally food that feeds the cancer, propelling it to multiply exponentially to invade the rest of the body. This happens because the spike protein turns OFF genes that fight off cancer (P-53, a.k.a. ‘guardian of the genome’), so by getting the Covid jab it’s like disarming your own army during a critical battle. This PET/CT scan shows how the cancer cells were fed by spike proteins and have spread significantly throughout different parts of the body.\n\nSpike proteins from mRNA pokes are food for fueling turbo cancer\n\nT-cell lymphoma begins in white blood cells called T cells (T lymphocytes) that help your body’s immune system fight off germs, but the cancer makes the cells mutate and develop abnormalities, and they turn and attack the skin. The overall survival rate for all types of T-cell non-Hodgkin lymphoma (past 5 years from diagnosis) is just over 63 percent. It’s a slow-growing cancer that develops over several years and is classified into stages.\n\nYet, Dr. Charles Hoffe is warning the world that the majority of Covid-vaccinated patients could experience critical health damage, including accelerating cancer and/or suffering from vascular clots that permanently damage the heart. In fact, 62% of Dr. Hoffe’s patients who received the Covid mRNA stabs tested positive for blood clots. This is causing increased vascular resistance through their lungs, he attests, and may shorten their lifespan significantly.\n\nTurbo cancer and vascular clots caused by the Fauci Flu stabs\n\nAre you feeling tired all the time, since you got stabbed with the Fauci Flu injection of billions of spike proteins? When will your body STOP creating them, now that the pandemic is over and done? These toxic spike proteins are recognized by your immune system as enemies, foreign particles, that resemble a deadly virus. Your body is trying to attack those spike prions, that have traveled throughout your body to cleansing organs, reproductive organs, the heart, and the brain.\n\nNow any cancer cells in your body are also being fed, as your vascular system delivers less oxygen and less nutrients to fight them off, all thanks to the spike protein injections. Spike protein injections prevent your own immune system from recognizing mutations of your cells when they divide, enabling cancer cells to develop and multiply uncontrollably and under the radar of your natural defense system.\n\nThis is because the Fauci Flu jabs turn OFF your P-53 gene. Now your body can no longer fight against cancer, as Dr. Hoffe has described, and all of this while the spike proteins clog the vascular system, depriving the body of oxygen and nutrients. Most natural health advocates already know that the clot shot effect is real and dangerous, but this research by Dr. Hoffe confirms any doubts or second guessing about it, so move forward with your organic lifestyle and natural remedies, and never look back.\n\nKeep your truth news in check by adding preparedness.news to your favorites list and tuning in daily for updates on real news about the surviving and thriving in the near future, by eating clean and avoided all these dirty vaccines.", "opengraph": {"title": "VACCINE-INDUCED TURBO CANCER: T-cell lymphoma can progress rapidly due to mRNA booster shot", "type": "article", "url": "https://www.cancer.news/2022-11-15-t-cell-lymphoma-progress-rapidly-mrna-booster-shot.html", "site_name": "Cancer News", "description": "Dr. Charles Hoffe, a medical doctor of 28 years in British Columbia, now working at the Lytton Clinic, has done the unthinkable, when it comes to inspecting the so-called “safety and efficacy” of the Fauci Flu jabs that the CDC calls “vaccines.” He ran PET/CT scans on cancer patients who had received the Pfizer mRNA […]", "image": "https://www.cancer.news/wp-content/uploads/sites/380/2022/11/Cancer-Cell-Background-Disease-Abstract-Metastasis-Defense.jpg"}, "tags": ["pandemic", "vaccine damage", "clot shots", "Big Pharma", "vascular clots", "dr. hoffe", "cancer criminals", "vaccine injury", "vaccines", "spike protein", "fauci flu", "biological weapon", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://assets-global.website-files.com/606d3dece4ec3c3866cc798a/60a601ccd6eac8d0fc8a311e_53%20Health%20Impact%20News%202021%20Canadian%20Doctor%20Defies%20Gag%20Order%20and%20Tells%20the%20Public.pdf", "https://rumble.com/v1qtt9k-dr.-charles-hoffe-explains-cancer-link-with-covid-19-jabs.html", "https://pubmed.ncbi.nlm.nih.gov/1614522/", "https://www.brighteon.tv", "https://www.austintexas.gov/edims/document.cfm?id=364941", "https://www.naturalnews.com/2022-09-29-hundreds-thousands-fully-vaccinated-dying-weekly-pfizergate.html", "http://spikeprotein.news", "https://www.preparedness.news/2022-08-19-12-ways-prep-without-spending-too-much.html", "http://vaccines.news", "https://www.naturalnews.com/2022-07-28-dna-testing-kits-scam-ethnicity-specific-bioweapons.html", "https://rumble.com/v1qtt9k-dr.-charles-hoffe-explains-cancer-link-with-covid-19-jabs.html", "https://www.naturalnews.com/2022-09-29-hundreds-thousands-fully-vaccinated-dying-weekly-pfizergate.html", "https://www.austintexas.gov/edims/document.cfm?id=364941", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcancernews%2F2022-11-15-t-cell-lymphoma-progress-rapidly-mrna-booster-shot.html&linkname=VACCINE-INDUCED%20TURBO%20CANCER%3A%20T-cell%20lymphoma%20can%20progress%20rapidly%20due%20to%20mRNA%20booster%20shot", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}