{"result_id": "059003", "URL": "https://cancer.news/2022-02-07-covid-vaccines-are-causing-cancers-and-aids.html", "timestamp": "2023-04-25 14:34:08 CEST+0200", "meta": {"description": "Ben Armstrong discussed how doctors are saying Wuhan coronavirus (COVID-19) vaccines are causing cancer and vaccine-induced AIDS at an alarming rate during the February 2 episode of “The Ben Armstrong Show.” Armstrong said that there were three whistleblowers who managed to get data from the Department of Justice, and were able to find information about the vaccines […]", "lang": "en", "keywords": "badcancer,badhealth,badmedicine,Ben Armstrong,Big Pharma,biological weapon,cancer causes,Clay Clark,covid-19,Dangerous Medicine,immune system,pandemic,pharmaceutical fraud,spike protein,truth,vaccine damage,vaccine injury,vaccines,VAIDS,Vladimir Zelenko", "favicon": "wp-content/themes/ScienceTheme/images/Cancer-fav.png", "canonical": "https://cancer.news/2022-02-07-covid-vaccines-are-causing-cancers-and-aids.html", "encoding": "UTF-8"}, "image": null, "domain": "cancer.news", "title": "Whistleblowers reveal COVID vaccines are causing cancers and AIDS", "cleaned_text": "Ben Armstrong discussed how doctors are saying Wuhan coronavirus (COVID-19) vaccines are causing cancer and vaccine-induced AIDS at an alarming rate during the February 2 episode of “The Ben Armstrong Show.”\n\nArmstrong said that there were three whistleblowers who managed to get data from the Department of Justice, and were able to find information about the vaccines and their adverse effects. In fact, the vaccines have massive adverse effects that the pharmaceutical companies that produced them need special protection from the Senate.\n\nSenator Ron Johnson’s panel titled “COVID-19: Second Opinion” talked about how the cancer is spreading like wildfire, and the increase in cases has been going on for months. (Related: Stunning German analysis finds that COVID-19 vaccine death rates are FAR higher than previously reported.)\n\nOne of the panelists, physician Ryan Cole, said that he noticed certain viruses increasing while the same T-cells or immune cells keep cancers in check. He shared that he had to do about 40,000 biopsies in the past year, and he has been seeing many certain types of cancers.\n\nHowever, upon talking to other laboratories to aggregate a bigger data set, Cole said that he has been ridiculed and maligned instead. “And now when we travel with these groups and summits, I have oncologists, I have radiation oncologist, I am seeing an uptick in cancers. I’m seeing these odd stable cancers take off like wild fires after the vaccines. It is happening.”\n\nA study published last year showed that the coronavirus vaccines have spike proteins that inhibit natural DNA damage repair, which is needed for the body’s adaptive immune response. Spike proteins localize themselves in the nucleus of the cells and block DNA repair proteins from doing their jobs.\n\nThe study explained that the SARS-CoV-2 spike proteins can weaken the DNA repair system of other people and impede recombination and adaptive immunity. In contrast, data are providing valuable details on the involvement of spike protein subunits in DNA damage repair, including spike-based vaccines that may inhibit the recombination of V (D) J in B cells. V (D) J is the recombination of the mechanism of somatic recombination that occurs in developing lymphocytes during the early stages of T and B cell maturation.\n\nThe study concluded: “Our findings reveal a potential molecular mechanism by which the spike protein might impede adaptive immunity and underscore the potential side effects of full-length spike-based vaccines.”\n\nArmstrong shared a clip from “Thrive Time Show” where host Clay Clark discussed with Dr. Vladimir Zelenko how the COVID-19 vaccines are causing AIDS. It’s not an HIV-induced AIDS, but a similar one that weakens the immune system.\n\nZelenko said that by taking a shot that damages the tumor suppressor genes, people are killing their innate immune system. (Related: Thrive Time Show: Covid vaccines part of bigger plan to ELIMINATE free will – Brighteon.TV.)\n\n“And so that’s why there’s a huge spike in cancers. A huge spike in autoimmune diseases, opportunistic infections. Not to mention blood clots, heart attacks, strokes, myocarditis, miscarriages, ovarian testicular dysfunction, most likely infertility and antibody-dependent enhancement,” Zelenko said.\n\nArmstrong noted that calling the adverse effect “AIDS” freaks people out, so public health authorities chose to call it Vaccine-Acquired Immune Deficiency Syndrome (VAIDS) instead.\n\nVAIDS is basically AIDS given by a vaccine. “Think of it as your immune system not performing like it’s supposed to,” Armstrong said.\n\nCDC report shows 40 percent increase in excess deaths among Americans ages 18 to 49.\n\nStudy proves that coronavirus vaccine would never work; might actually create MORE new viruses through recombination in human hosts.\n\nAnthony Fauci wants coronavirus vaccines to be forced on all Americans.\n\nThe coronavirus vaccine might kill up to 110,000 Americans, suggest estimates from health author.\n\nWatch the full February 2 episode of “The Ben Armstrong Show” below.\n\nThis video is from the channel Truthchannel on Brighteon.com.\n\nFollow Pandemic.news for more updates related to the coronavirus pandemic.", "opengraph": {"title": "Whistleblowers reveal COVID vaccines are causing cancers and AIDS", "type": "article", "url": "https://www.cancer.news/2022-02-07-covid-vaccines-are-causing-cancers-and-aids.html", "site_name": "Cancer News", "description": "Ben Armstrong discussed how doctors are saying Wuhan coronavirus (COVID-19) vaccines are causing cancer and vaccine-induced AIDS at an alarming rate during the February 2 episode of “The Ben Armstrong Show.” Armstrong said that there were three whistleblowers who managed to get data from the Department of Justice, and were able to find information about the vaccines […]", "image": "https://www.cancer.news/wp-content/uploads/sites/380/2022/02/Coronavirus-Covid-19-Nurse-Vaccine-Vial.jpg"}, "tags": ["pandemic", "vaccine damage", "Vladimir Zelenko", "covid-19", "Big Pharma", "vaccine injury", "vaccines", "spike protein", "truth", "VAIDS", "immune system", "Clay Clark", "Ben Armstrong", "biological weapon", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/11563f5c-facc-44a8-b6ae-5052058eab7f", "https://www.naturalnews.com/2022-02-02-german-analysis-finds-covid-vaccine-death-rate-higher-than-reported.html", "https://www.mdpi.com/1999-4915/13/10/2056/htm#app1-viruses-13-02056", "https://www.brighteon.tv", "http://spikeprotein.news", "https://www.naturalnews.com/2022-02-02-covid-vaccines-bigger-plan-eliminate-free-will.html", "https://www.naturalnews.com/2022-01-24-increase-in-excess-deaths-among-americans.html", "https://vaccines.news/2020-04-24-study-coronavirus-vaccine-never-work.html", "https://pandemic.news/2020-04-10-anthony-fauci-wants-coronavirus-vaccines-forced-on-all-americans.html", "https://vaccinedeaths.com/2020-04-02-coronavirus-vaccine-will-kill-110000-americans.html", "https://www.naturalnews.com/2020-03-19-flu-vaccine-increases-coronavirus-infection-risk.html", "https://www.brighteon.com/11563f5c-facc-44a8-b6ae-5052058eab7f", "https://www.brighteon.com/channels/truthchannel", "http://Pandemic.news", "https://www.brighteon.com/11563f5c-facc-44a8-b6ae-5052058eab7f", "https://www.mdpi.com/1999-4915/13/10/2056/htm#app1-viruses-13-02056", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcancernews%2F2022-02-07-covid-vaccines-are-causing-cancers-and-aids.html&linkname=Whistleblowers%20reveal%20COVID%20vaccines%20are%20causing%20cancers%20and%20AIDS", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}