{"result_id": "059012", "URL": "https://www.cancer.news/2022-08-17-ryan-cole-covid-shots-linked-cancer-rates.html", "timestamp": "2023-04-25 14:34:13 CEST+0200", "meta": {"description": "Board-certified pathologist Dr. Ryan Cole believes that the Wuhan coronavirus (COVID-19) vaccines are linked to rising cancer rates. The owner of Idaho-based medical laboratory Cole Diagnostics cited a January 2018 paper published in Nature Reviews Drug Discovery to bolster his claim. The paper, written by researchers from Duke University and  the University of Pennsylvania, warned of a […]", "lang": "en", "keywords": "badcancer,badhealth,badmedicine,Big Pharma,biological weapon,cancer causes,cancer criminals,Cole Diagnostics,covid-19,Dangerous Medicine,immune system,mRNA vaccine,pandemic,pharmaceutical fraud,Ryan Cole,SARS-CoV-2,spike protein,toll-like receptors,vaccine damage,vaccine injury", "favicon": "wp-content/themes/ScienceTheme/images/Cancer-fav.png", "canonical": "https://www.cancer.news/2022-08-17-ryan-cole-covid-shots-linked-cancer-rates.html", "encoding": "UTF-8"}, "image": null, "domain": "www.cancer.news", "title": "Dr. Ryan Cole: COVID shots linked to rising CANCER rates", "cleaned_text": "Board-certified pathologist Dr. Ryan Cole believes that the Wuhan coronavirus (COVID-19) vaccines are linked to rising cancer rates.\n\nThe owner of Idaho-based medical laboratory Cole Diagnostics cited a January 2018 paper published in Nature Reviews Drug Discovery to bolster his claim. The paper, written by researchers from Duke University and the University of Pennsylvania, warned of a “possible concern” with mRNA vaccines – including the ones for COVID-19.\n\n“Some mRNA-based vaccine platforms induce potent type I interferon responses, which have been associated not only with inflammation, but also potentially with autoimmunity. Thus, identification of individuals at an increased risk of autoimmune reactions before mRNA vaccination may allow reasonable precautions to take,” the paper stated.\n\nCole also cited animal trials for mRNA vaccines as evidence of their dangers. Test subjects developed “odd cancers” and “autoimmune diseases” up to a year after they were injected, he added.\n\nMoreover, the pathologist’s direct clinical experience also lent credence to his argument. According to Cole, he saw a dramatic increase in the number of people coming into his practice with gynecological cancers. The number of endometrial cancers he encountered rose by 20 times compared to what he typically sees on an annual basis. (Related: Mass COVID-19 vaccination is a deadly and unscientific policy that will cause surge in cancer rates, warns pathologist.)\n\nGiven this, Cole interpreted this increase in cancers and autoimmune problems as caused by the COVID-19 vaccines damaging the immune system.\n\nBack in July 2021, the Idaho pathologist revealed that the COVID-19 vaccines causes catastrophic damage to human organs. The SARS-CoV-2 spike protein used as the main component in the vaccines was responsible for this vaccine damage, he said.\n\n“The spike protein doesn’t just stay in the deltoid. [It] circulates in [the] blood and lands in multiple organs in the body,” Cole said during the July 2021 White Coat Summit organized by America’s Frontline Doctors.\n\nCole explained how the vaccines compromise the immune system during a January 2022 interview with Veronika Kyrylenko of the New American. He reiterated that the SARS-CoV-2 spike protein used in the shot attacks receptors in the human cells that identify healthy cells from disease-causing ones.\n\nAccording to the Idaho doctor, he initially saw viral skin lesions – commonly found in children – developing in his adult patients. Following many biopsies, he noticed an upward trend in women’s cancers, including endometrial and cervical cancers, among older individuals.\n\n“After I reported those, I had tons of oncologists coming forward and saying ‘Yeah, I’m seeing the weird cancers – [those] we’ve been able to keep in check and treat – taking off like wildfire,” he told Kyrylenko. “That’s because of the immune dysregulation that these shots cause.”\n\nCole pointed out that the COVID-19 vaccines turn off some of the toll-like receptors (TLRs) in human cells, compromising the immune system’s alert mechanism. The deactivated receptors include TLR7 and TLR8, which detect viruses, and TLR3 and TLR4, which keep cancer in check.\n\nThe spike protein also binds to different genes, including the P53 gene that suppresses tumors; the TMPRSS-2 gene linked to prostate cancer; and the BRCA genes linked to breast cancer in women.\n\n“We’re giving a shot that makes a spike protein. That’s a toxin that triggers cancer genes in bad ways and turns off other pattern receptors,” said Cole. “[It] causes the same disease as the virus and is predisposing people to auto-immune attacks and potentially short-term cancer risks.”\n\n“We don’t know how long the immune system is suppressed after these shots and how long these receptors are shut off – because those studies aren’t done,” he concluded.\n\nHead over to VaccineDamage.news for more about how the COVID-19 vaccines cause cancer.\n\nWatch Dr. Ryan Cole’s interview with Veronika Kyrylenko below, where he discusses how the COVID-19 vaccines impact the immune system.\n\nThis video is from The New American channel on Brighteon.com.\n\nDr. Ryan Cole explains how the COVID vaccines compromise the immune system.\n\nIdaho doctor reports “20 times increase” in cancer among those “vaccinated” for covid.\n\nIdaho pathologist says data show that “cancers are taking off like wildfire” thanks to COVID vaccines.", "opengraph": {"title": "Dr. Ryan Cole: COVID shots linked to rising CANCER rates", "type": "article", "url": "https://www.cancer.news/2022-08-17-ryan-cole-covid-shots-linked-cancer-rates.html", "site_name": "Cancer News", "description": "Board-certified pathologist Dr. Ryan Cole believes that the Wuhan coronavirus (COVID-19) vaccines are linked to rising cancer rates. The owner of Idaho-based medical laboratory Cole Diagnostics cited a January 2018 paper published in Nature Reviews Drug Discovery to bolster his claim. The paper, written by researchers from Duke University and  the University of Pennsylvania, warned of a […]", "image": "https://www.cancer.news/wp-content/uploads/sites/380/2022/08/Covid-19-Coronavirus-Vaccine-Vial-Syringe.jpg"}, "tags": ["pandemic", "vaccine damage", "covid-19", "Big Pharma", "cancer criminals", "vaccine injury", "Ryan Cole", "toll-like receptors", "spike protein", "SARS-CoV-2", "immune system", "Cole Diagnostics", "mRNA vaccine", "biological weapon", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://www.naturalhealth365.com/doctor-believes-covid-shots-may-be-responsible-for-rising-cancer-rates.html", "https://www.nature.com/articles/nrd.2017.243", "https://duke.edu/", "https://www.upenn.edu/", "https://naturalnews.com/2022-05-09-mass-covid-vaccination-causes-deadly-cancer-surge.html", "https://www.brighteon.tv", "https://www.brighteon.com/a171374a-103f-4bc9-a211-e2ccb798e400", "https://www.brighteon.com/898419ab-e36f-43a5-8700-e0e35b126273", "https://cancercriminals.com/", "https://vaccinedamage.news/", "https://www.brighteon.com/898419ab-e36f-43a5-8700-e0e35b126273", "https://www.brighteon.com/channels/thenewamerican", "https://pandemic.news/2022-02-20-covid-vaccines-cause-catastrophic-damage-to-organs.html", "https://cancercauses.news/2022-07-07-idaho-doctor-warns-covid-vaccines-cause-cancer.html", "https://immunesystem.news/2022-01-28-ryan-cole-covid-vaccines-compromise-immune-system.html", "https://dangerousmedicine.com/2021-09-14-idaho-doctor-20times-increase-cancer-vaccinated-covid.html", "https://vaccinewars.com/2022-02-07-idaho-pathologist-cancers-spreading-like-wildfire-covid-vaccines-data.html", "https://www.naturalhealth365.com/doctor-believes-covid-shots-may-be-responsible-for-rising-cancer-rates.html", "https://www.nature.com/articles/nrd.2017.243", "https://www.brighteon.com/a171374a-103f-4bc9-a211-e2ccb798e400", "https://www.brighteon.com/898419ab-e36f-43a5-8700-e0e35b126273", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcancernews%2F2022-08-17-ryan-cole-covid-shots-linked-cancer-rates.html&linkname=Dr.%20Ryan%20Cole%3A%20COVID%20shots%20linked%20to%20rising%20CANCER%20rates", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}