{"result_id": "059025", "URL": "https://cancer.news/2022-02-01-miscarriages-cancer-neurological-problems-skyrocketing-covid-vaccines.html", "timestamp": "2023-04-25 14:34:22 CEST+0200", "meta": {"description": "On January 24, attorney Thomas Renz, a member of the America’s Frontline Doctors (AFLDS) legal team, revealed to a panel that Wuhan coronavirus (Covid-19) “vaccines” are extremely dangerous, despite constant reassurances from the government that they are “safe and effective.” Three military doctors from the Department of Defense (DoD) who have access to vaccination data […]", "lang": "en", "keywords": "America's Frontline Doctors,badcancer,badhealth,badmedicine,badscience,cancer,COVID,depopulation,genocide,miscarriages,neurological problems,Plandemic,Thomas Renz,vaccination,Vaccine deaths,vaccine injury,vaccines", "favicon": "wp-content/themes/ScienceTheme/images/Cancer-fav.png", "canonical": "https://cancer.news/2022-02-01-miscarriages-cancer-neurological-problems-skyrocketing-covid-vaccines.html", "encoding": "UTF-8"}, "image": null, "domain": "cancer.news", "title": "Miscarriages and cancer up 300%, neurological problems up 1,000% due to covid “vaccines”", "cleaned_text": "Miscarriages and cancer up 300%, neurological problems up 1,000% due to covid “vaccines”\n\nOn January 24, attorney Thomas Renz, a member of the America’s Frontline Doctors (AFLDS) legal team, revealed to a panel that Wuhan coronavirus (Covid-19) “vaccines” are extremely dangerous, despite constant reassurances from the government that they are “safe and effective.”\n\nThree military doctors from the Department of Defense (DoD) who have access to vaccination data that has been withheld from the general public procured the information. They are Lt. Col. Theresa Long, Dr. Samuel Sigoloff and Lt. Colonel Peter Chambers.\n\n“All three have given me this data in declarations that stated this is under penalty of perjury, we intend to submit this to the courts,” Renz said.\n\nWhat these three whistleblowers showed with the data is that miscarriages have increased by 300 percent over the past year, as have cancers. Neurological problems increased 1,000 percent during the same timeframe.\n\n“Our soldiers are being injured, experimented on, and sometimes possibly killed,” Renz further explained.\n\nBiden regime ignored affidavit warning that covid jabs are killing military servicemen\n\nLt. Col. Long is a senior U.S. Army flight surgeon with specialized training in infectious diseases. She testified under the Military Whistleblower Protection Act, which protects members who make lawful disclosures of wrongdoing to members of Congress or the Inspector General.\n\nLong told Sen. Ron Johnson (R-Wisc.) that she actually had to ground vaccinated pilots in order to place them under monitoring for symptoms of myocarditis, which include chronic fatigue, so as to avoid them potentially dying from heart failure mid-air.\n\nOn Nov. 3, 2021, The Washington Times reported that Long had made “numerous efforts to get senior medical leaders to at the very least inform soldiers of this risk,” only to be ignored.\n\n“The military didn’t even pause their vaccination efforts to rush out the Pfizer and Moderna shots,” she is quoted as saying.\n\nLong initially decided to speak up after the U.S. Centers for Disease Control and Prevention (CDC) announced back in June an “emergency meeting to discuss higher than expected myocarditis in 16 to 24-year-olds.”\n\nLong then filed an affidavit against the Biden regime over its jab mandate for active-duty military personnel, warning that heart side effects could cause pilots to die mid-flight.\n\nLong is directly responsible, by the way, for certifying the fitness of 4,000 flight-ready airmen at the 1st Aviation Brigade in Ft. Rucker, Ala. It is her job, in other words, to be on the lookout for things that could harm them, including covid jabs.\n\n“The vaccines can cause inflamed heart muscles in young men in the age range of most flight-ready pilots and … the Department of Defense has not followed its own protocols by requiring an MRI scan of each airman after vaccination,” the affidavit reads.\n\n“The majority of young new Army aviators are in their early twenties. We know there is a risk of myocarditis with each mRNA vaccination.”\n\nA lawsuit was also filed, but the Biden regime has thus far ignored both the affidavit and that legal filing.\n\nDr. Peter McCullough backed all this up when he spoke at a second opinion meeting, revealing that myocarditis “is not mild,” and is not something to be balked at as being no big deal.\n\n“When they do an MRI on these individuals with suspected myocarditis, 100 percent are having heart damage,” he explained.\n\nScientific studies show that around 13 percent of jab-induced myocarditis victims will have permanent heart injury, while 32 percent will never return back to normal.\n\n“We are seeing unprecedented numbers of athletes dying on the field in Europe,” he added. “Of these cardiac arrests half of them don’t come back.”\n\nThe latest news about injuries and deaths caused by Wuhan coronavirus (Covid-19) “vaccines” can be found at ChemicalViolence.com.", "opengraph": {"title": "Miscarriages and cancer up 300%, neurological problems up 1,000% due to covid “vaccines”", "type": "article", "url": "https://www.cancer.news/2022-02-01-miscarriages-cancer-neurological-problems-skyrocketing-covid-vaccines.html", "site_name": "Cancer News", "description": "On January 24, attorney Thomas Renz, a member of the America’s Frontline Doctors (AFLDS) legal team, revealed to a panel that Wuhan coronavirus (Covid-19) “vaccines” are extremely dangerous, despite constant reassurances from the government that they are “safe and effective.” Three military doctors from the Department of Defense (DoD) who have access to vaccination data […]", "image": "https://www.cancer.news/wp-content/uploads/sites/380/2022/02/Cancer-Patient-Chemo-Chemotherapy-Hair-Treatment-Women.jpg"}, "tags": ["Plandemic", "cancer", "Thomas Renz", "Vaccine deaths", "COVID", "America's Frontline Doctors", "vaccine injury", "genocide", "depopulation", "vaccines", "neurological problems", "miscarriages", "vaccination"], "tweets": [], "movies": [], "links": ["https://dailyexpose.uk/2022/01/26/substantial-data-shows-miscarriages-up-300-cancers-up-300-neurological-problems-up-1000-according-to-u-s-attorney/", "https://www.brighteon.tv", "https://naturalnews.com/2022-01-26-sudden-cardiac-deaths-fifa-increased-500-percent-2021.html", "http://chemicalviolence.com", "https://dailyexpose.uk/2022/01/26/substantial-data-shows-miscarriages-up-300-cancers-up-300-neurological-problems-up-1000-according-to-u-s-attorney/", "https://naturalnews.com/2022-01-26-sudden-cardiac-deaths-fifa-increased-500-percent-2021.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcancernews%2F2022-02-01-miscarriages-cancer-neurological-problems-skyrocketing-covid-vaccines.html&linkname=Miscarriages%20and%20cancer%20up%20300%25%2C%20neurological%20problems%20up%201%2C000%25%20due%20to%20covid%20%E2%80%9Cvaccines%E2%80%9D", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}