{"result_id": "059021", "URL": "https://www.cancer.news/2022-09-01-some-cancers-exploded-1000percent-since-covid-vaccines.html", "timestamp": "2023-04-25 14:34:19 CEST+0200", "meta": {"description": "The Health Ranger sat down recently with Jonathan Landsman to talk about the explosion of cancer cases that many doctors are seeing in the age of Wuhan coronavirus (Covid-19) “vaccines.” Landsman is a natural health veteran who has been focused on cancer for some years now, observing details that often fall through the cracks linking […]", "lang": "en", "keywords": "badcancer,badhealth,badmedicine,Big Pharma,biological weapon,cancer causes,cancer criminals,COVID,Dangerous Medicine,immunizations,Jonathan Landsman,pharmaceutical fraud,Plandemic,spike protein,Stop Cancer Class,vaccine,vaccine damage,vaccine injury", "favicon": "wp-content/themes/ScienceTheme/images/Cancer-fav.png", "canonical": "https://www.cancer.news/2022-09-01-some-cancers-exploded-1000percent-since-covid-vaccines.html", "encoding": "UTF-8"}, "image": null, "domain": "www.cancer.news", "title": "EXPERTS: Some cancers have exploded by 1,000% since the release of covid “vaccines”", "cleaned_text": "EXPERTS: Some cancers have exploded by 1,000% since the release of covid “vaccines”\n\nThe Health Ranger sat down recently with Jonathan Landsman to talk about the explosion of cancer cases that many doctors are seeing in the age of Wuhan coronavirus (Covid-19) “vaccines.”\n\nLandsman is a natural health veteran who has been focused on cancer for some years now, observing details that often fall through the cracks linking the disease to modern medicine.\n\nIn this case, Fauci Flu shots were unleashed under Operation Warp Speed, and now some cancers are raging at rates 1,000 percent higher than previously. (Related: Covid jab spike proteins destroy human DNA, paving the way for the growth and spread of cancer cells.)\n\n“What’s happening is, the spike proteins … are attaching and decreasing the ACE2 receptor expression,” Landsman explained to the Health Ranger, emphasizing that ACE2 receptors are located all throughout the body.\n\n“These spike proteins are spreading and infecting all the cells in the body. And what’s happening is this is allowing those infections to attach to the outside of the cell, and then inject themselves inside the cell, causing organ damage and severe illness … and is especially increasing the risk of advanced-stage cancers.”\n\nYou can watch the full interview from Brighteon.com below:\n\nIt is only a matter of time before every fully jabbed person experiences the consequences of the shots\n\nLandsman says he gets emails every single day from people who are concerned that covid jabs are causing themselves and their loved ones to get sick, including with cancer.\n\nCancer patients who were previously in remission are now seeing their cancers reappear post-injection, which only further supports the notion that the jabs are responsible.\n\nLandsman describes the vaccine spike proteins as the key, and the body’s ACE2 receptors are the doorway through which disease and ultimately death are delivered to a “fully vaccinated” person’s body.\n\nBoth the government and the corporate-controlled media still insist that mRNA (messenger RNA) technology – this is what replicates spike protein production throughout the body, just as a reminder, turning it into a spike protein factory – is not permanent and does not affect DNA. Nothing could be further from the truth.\n\nDr. Judy Mikovits told the Health Ranger in a previous interview that the presence of glyphosate inside the body – and most people today have this deadly chemical circulating in their bloodstream – only amplifies the damage caused by vaccine spike proteins.\n\n“Because of the presence of glyphosate, and the fact that there’s a phosphate group in that … it potentiates the cell membrane pathway that is used by mRNA to enter the cells,” the Health Ranger explained during his interview with Landsman.\n\n“What that means is … one of the explanations for why some people are more damaged than others is that some people are eating non-organic foods.”\n\nThis and so much more is discussed in the interview, which you will not want to miss.\n\n“People I know are battling breast and brain cancers since they took the Jaberwalkie!” wrote a commenter at Brighteon.com, affirming what Landsman and the Health Ranger are saying.\n\n“Cancer came back in one person and a relative went to three funerals in one week, but didn’t realize the cause,” added another.\n\n“Roundup is everywhere, including in corn syrup, which is used in candy and soda,” added another. “It is also sprayed on corn, wheat, oats, peanuts, beans, canola oil, and more.”\n\nBe sure to check out the Stop Cancer Class, which is Landsman’s docu-class for avoiding and overcoming cancer, to learn more. (NOTE: This Stop Cancer affiliate link benefits and supports Brighteon.com.)\n\nMore of the latest news about cancer can be found at Cancer.news.", "opengraph": {"title": "EXPERTS: Some cancers have exploded by 1,000% since the release of covid “vaccines”", "type": "article", "url": "https://www.cancer.news/2022-09-01-some-cancers-exploded-1000percent-since-covid-vaccines.html", "site_name": "Cancer News", "description": "The Health Ranger sat down recently with Jonathan Landsman to talk about the explosion of cancer cases that many doctors are seeing in the age of Wuhan coronavirus (Covid-19) “vaccines.” Landsman is a natural health veteran who has been focused on cancer for some years now, observing details that often fall through the cracks linking […]", "image": "https://www.cancer.news/wp-content/uploads/sites/380/2022/09/Patient-Woman-Heart-Ache-Breast-Cancer.jpg"}, "tags": ["immunizations", "Jonathan Landsman", "Big Pharma", "COVID", "cancer criminals", "vaccine", "vaccine injury", "spike protein", "Stop Cancer Class", "vaccine damage", "Plandemic", "biological weapon", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/f5ad2a91-1513-42b4-8389-4d91f07c0930", "https://naturalnews.com/2021-11-05-covid-vaccine-spike-proteins-destroy-dna-repair.html", "https://www.brighteon.tv", "http://www.stopcancerclass.com", "http://cancer.news", "https://www.brighteon.com/f5ad2a91-1513-42b4-8389-4d91f07c0930", "https://naturalnews.com/2021-11-05-covid-vaccine-spike-proteins-destroy-dna-repair.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcancernews%2F2022-09-01-some-cancers-exploded-1000percent-since-covid-vaccines.html&linkname=EXPERTS%3A%20Some%20cancers%20have%20exploded%20by%201%2C000%25%20since%20the%20release%20of%20covid%20%E2%80%9Cvaccines%E2%80%9D", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}