{"result_id": "059013", "URL": "https://cancer.news/2021-07-16-cancer-patients-developed-no-antibodies-coronavirus-vaccines.html", "timestamp": "2023-04-25 14:34:13 CEST+0200", "meta": {"description": "Seven out of 131 cancer patients developed no protective antibodies at all against the Wuhan coronavirus (COVID-19) weeks after being given a second dose of either the Moderna or Pfizer-BioNTech mRNA vaccines, according to researchers at the Mays Cancer Center in Texas and the University of Geneva in Switzerland. Published recently in the journal Cancer Cell, the study reported that five […]", "lang": "en", "keywords": "antibodies,badcancer,badhealth,badmedicine,badscience,Big Pharma,Chemotherapy,coronavirus,coronavirus vaccine,covid-19,harmful medicine,immune response,immune system,pandemic,pharmaceutical fraud,research,vaccines", "favicon": "wp-content/themes/ScienceTheme/images/Cancer-fav.png", "canonical": "https://cancer.news/2021-07-16-cancer-patients-developed-no-antibodies-coronavirus-vaccines.html", "encoding": "UTF-8"}, "image": null, "domain": "cancer.news", "title": "More than 5% of cancer patients developed no antibodies weeks after receiving coronavirus vaccines", "cleaned_text": "More than 5% of cancer patients developed no antibodies weeks after receiving coronavirus vaccines\n\nSeven out of 131 cancer patients developed no protective antibodies at all against the Wuhan coronavirus (COVID-19) weeks after being given a second dose of either the Moderna or Pfizer-BioNTech mRNA vaccines, according to researchers at the Mays Cancer Center in Texas and the University of Geneva in Switzerland.\n\nPublished recently in the journal Cancer Cell, the study reported that five of those seven patients all had blood cancer. Meanwhile, four other patients who received the chemotherapy drug, rituximab, within six months prior to vaccination also developed no antibodies for the COVID-19 virus.\n\nThe researchers said the patients’ lack of antibodies even after vaccination is troubling because it suggests that some cancer patients, who are already at high risk of severe COVID-19, may be left without any means to protect themselves.\n\n“With other vaccines and infectious diseases, cancer patients have been shown not to develop as robust an immune response as the general population,” said Ruben Mesa, the study’s senior co-author and the executive director of the Mays Cancer Center. Therefore, it made sense to hypothesize that some high-risk groups may not develop antibody responses against the coronavirus even after vaccination.\n\nThe study builds on a previous report by Israeli researchers, who found that certain cancer patients could still be vulnerable to COVID-19 even after vaccination. In the latest study, the researchers observed 131 cancer patients who were fully vaccinated with either the Moderna or Pfizer-BioNTech mRNA vaccines.\n\nThe participants had a median age of 63, and 106 of them had solid cancer, or a cancer marked by abnormal cellular growth in “solid” organs, such as the breasts or prostate.\n\nThe findings showed that seven high-risk patients developed no protective antibodies three to four weeks after receiving the second dose of an mRNA vaccine. The researchers also found that patients with blood cancers were less likely to develop an antibody response to the coronavirus. In the even that they do, the response is likely to be weaker than those of other cancer patients or the general population.\n\nThe researchers also observed a trend involving the treatments that the patients were receiving prior to vaccination. In particular, patients who received rituximab, a monoclonal antibody typically used together with chemotherapy to treat blood cancers, didn’t develop an antibody response. Meanwhile, patients who were on chemotherapy developed a “muted” antibody response.\n\n“How that relates to protection against COVID-19, we don’t know yet,” said study co-author Dimpy Shah. However, it is likely that chemotherapy drugs weaken cancer patients’ immune systems, an idea that has been the subject of numerous studies on the long-term adverse effects of chemotherapy.\n\nChemotherapy has been credited with reducing remission rates in cancer patients. However, it is a double-edged sword because many chemo drugs also kill healthy cells. Experts are only beginning to understand the disadvantageous and lasting effects of chemotherapy on multiple organs and organ systems, particularly the hematopoietic and immune systems. (Related: WARNING: Chemotherapy contributes to mitochondrial dysfunction.)\n\nAccording to recent studies, cancer survivors are more susceptible to viral and bacterial infections, such as the common cold, the flu and streptococcal pneumonia. Cancer survivors are also more likely to experience severe complications due to infections, including hospitalization and, in extreme cases, death. In addition, they generally show a weaker response to vaccines than people who have never had cancer. All of these may stem from how chemotherapy negatively affects their bodies and weakens their immune systems.\n\nTo learn more about how COVID-19 vaccines fail to protect cancer patients and other immunocompromised individuals, visit Vaccines.news.", "opengraph": {"title": "More than 5% of cancer patients developed no antibodies weeks after receiving coronavirus vaccines", "type": "article", "url": "https://www.cancer.news/2021-07-16-cancer-patients-developed-no-antibodies-coronavirus-vaccines.html", "site_name": "Cancer News", "description": "Seven out of 131 cancer patients developed no protective antibodies at all against the Wuhan coronavirus (COVID-19) weeks after being given a second dose of either the Moderna or Pfizer-BioNTech mRNA vaccines, according to researchers at the Mays Cancer Center in Texas and the University of Geneva in Switzerland. Published recently in the journal Cancer Cell, the study reported that five […]", "image": "https://www.cancer.news/wp-content/uploads/sites/380/2021/07/Woman-Nurse-Vaccine-Mask-Covid-19-Coronavirus.jpg"}, "tags": ["pandemic", "covid-19", "Big Pharma", "harmful medicine", "research", "coronavirus vaccine", "vaccines", "coronavirus", "immune system", "antibodies", "immune response", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://www.dailymail.co.uk/health/article-9745735/6-cancer-patients-little-response-COVID-19-vaccines-4-weeks-second-dose.html", "https://www.unige.ch/en/university/", "https://www.sciencedirect.com/science/article/pii/S1535610821003305?via%3Dihub", "https://naturalpedia.com/cancer-causes-side-effects-and-treatments-at-naturalpedia-com.html", "https://www.brighteon.tv", "https://naturalpedia.com/fibrocystic-breasts-causes-side-effects-and-treatments-at-naturalpedia-com.html", "https://naturalpedia.com/leukemia-causes-side-effects-and-treatments-at-naturalpedia-com.html", "https://researchfeatures.com/tackling-long-term-adverse-effects-chemotherapy/", "https://www.naturalnews.com/2019-01-24-chemotherapy-contributes-to-mitochondrial-dysfunction.html", "https://naturalpedia.com/common-cold-causes-side-effects-and-treatments-at-naturalpedia-com.html", "http://chemo.news", "https://vaccines.news/", "https://www.dailymail.co.uk/health/article-9745735/6-cancer-patients-little-response-COVID-19-vaccines-4-weeks-second-dose.html", "https://www.sciencedirect.com/science/article/pii/S1535610821003305?via%3Dihub", "https://researchfeatures.com/tackling-long-term-adverse-effects-chemotherapy/"], "authors": [], "publish_date": null}