{"result_id": "060041", "URL": "https://www.catholic.org/news/health/story.php?id=51576", "timestamp": "2023-04-25 14:35:00 CEST+0200", "meta": {"description": "As a parent, I find the medical community somewhat unwilling to disclose that HPV is a sexually transmitted disease However, as HPV is a sexually transmitted disease (STD), the success of a ...", "lang": "en", "keywords": "HPV, STD, Vaccination, HPV vaccination, Catholic Medical Association, CDC, Patrick Hayes MD", "favicon": "/assets/img/apple-touch-icon-144-precomposed.png", "canonical": "https://www.catholic.org/news/health/story.php?id=51576", "encoding": "utf-8"}, "image": null, "domain": "www.catholic.org", "title": "HPV Vaccination: Is There An Elephant In This Room? - Health & Wellness - News", "cleaned_text": "However, as HPV is a sexually transmitted disease (STD), the success of a 'medicine' that appears to remove the consequences of sin, by preventing genital warts and cervical cancer in persons who have one or multiple sexual partners who have had multiple sexual partners, leaves persons of faith and chastity questioning the motives and wisdom of governments, pharmaceutical companies and doctors.\n\nP>CORPUS CHRISTI, TX (Catholic Online) - As Christians and men and women of good will, what are we to make of the Human Papilloma Virus (HPV) vaccine and, more specifically, the recent study by the Center for Disease Control and Prevention (CDC) hailed as evidence of a great success? There are many factors to consider in judging this medical intervention that may legitimately come to be a successful measure to improve health for all in an imperfect world.\n\nHowever, as HPV is a sexually transmitted disease (STD), the success of a 'medicine' that appears to remove the consequences of sin, by preventing genital warts and cervical cancer in persons who have one or multiple sexual partners who have had multiple sexual partners, leaves persons of faith and chastity questioning the motives and wisdom of governments, pharmaceutical companies and doctors.\n\nIn this brief review, I will consider facts concerning the virus itself, cervical cancer and the results of the CDC study. I will also address the questions of vaccine safety, vaccine influence on behavior and the points made by the Catholic Medical Association.\n\nFrom the fact sheet by the CDC (2010):\n\n- HPV is the most commonly diagnosed STD in the United States. \n\n- There are about 110 million total STD infections in the U.S. each year, 20 million of which are new.\n\n- Of that STD total, 79 million are HPV and of the new STDs, 14 million are new HPV infections.\n\n- HPV infections are \"cleared\" from detectable levels in the body at a rate of 90% within 2 years of infection.\n\n- There are two different HPV vaccines: Gardasil which became available in late 2006 and Ceravix which became available in 2009. Both are administered in 3 doses. Gardasil, the 'quadrivalent' vaccine, is designed to protect against virus subtypes 16, 18, 6 and 11, while Ceravix works to protect against subtypes 16 and 18 only.\n\nBecause infection with certain high risk HPV subtypes is necessary but not sufficient to acquire cervical cancer, to be well-informed we should know more about the virus and the cancer.\n\nAvailable online information includes:\n\n- Over 40 mucosal HPV genotypes infect the lower female genital tract.\n\n- The virus is transmitted through skin-to-skin contact with the genitals of an infected person, not through nonsexual social interaction.\n\n- The risk of HPV infection in women is directly related to the number of male sex partners and to the male partners' number of sex partners\n\n- Low risk subtypes of HPV, such as 6 and 11, cause some 90% of all genital warts, do not integrate into the host genome as high risk subtypes (those associated with cancer) can.\n\nAnd concerning cervical cancer:\n\n- In developed countries in 2008, cervical cancer was the tenth most common type of cancer in women (9.0 per 100,000 women) and ranked below the top ten causes of cancer mortality (3.2 per 100,000).\n\n- or approximately 3,700 - 4,000 cancer deaths out of 9,800 - 12,000 women who are diagnosed with cervical cancer in the United States annually.\n\n- In contrast, in developing countries it was the second most common type of cancer (17.8 per 100,000) and cause of cancer deaths (9.8 per 100,000) among women (and the most common cause of cancer death in women worldwide).\n\n- The two major factors associated with development of cervical cancer, after promiscuity, are HPV subtype and persistence of infection.\n\n- Environmental factors (e.g., cigarette smoking) and immunologic influences also appear to play a role.\n\n- In one study, the relative risk of cervical cancer in smokers was two to four-fold that of nonsmokers.\n\n- Long-term use of oral contraceptives has been considered as a cofactor for higher risk of cervical cancer in HPV-positive women. This may simply be a marker of more promiscuous individuals rather than a causal relationship.\n\n- Approximately 13 to 18 HPV subtypes are considered to cause all cervical cancer worldwide and are known as carcinogenic, high risk, or cancer-associated HPV types (16, 18, 31, 33, 35, 39, 45, 51, 52, 56, 58, 59 and 68), of which subtype 16 and 18 cause about 70 percent of cervical cancer cases.\n\n- A persistent HPV infection is variably defined as one that is present (not cleared by the immune system within) at least 6 to 12 months.\n\nIn the CDC study, researchers observed a reduction in HPV prevalence in young women in the United States due to Gardasil vaccination starting in late 2006. Authored by L. Markowitz, et al., the study appeared this spring in the Journal of Infectious Disease. Data from the NHANES included 4,150 females in the pre-vaccine period and 4,253 females in the vaccine period. Ages ranged from 14 to 59, but only the 14 to 19 year old group showed reduction in HPV 'vaccine type (6, 11, 16, 18)' prevalence which fits with a vaccine program in the U.S. targeting that segment of population primarily.\n\nHigh risk HPV vaccine types (16, 18) were reduced by 56% and the low risk, genital wart types (6, 11) by 50%. Self-reporting of at least 1 dose vaccine was noted in 34% of these girls with 62% of that number having received all 3 doses. Sexual behavior reporting for this group was similar over the two periods with 54% in the first and 50% in the second having had sex previously. Samples size for the first group was 1,363 and the second, 740. So, there was sufficient power in participant numbers to confirm the conclusion of vaccine effectiveness. Also highlighted was the finding of 82% effectiveness with just one dose of the vaccine.\n\nTurning to safety, the Vaccine Adverse Event Reporting System linked through the Food and Drug Administration and the CDC gives some idea as to the number and type of reactions people considered related to vaccine administration. For Gardasil, from its introduction in 2006, through 2008, some 23 million doses were administered with 12,424 adverse events recorded. Of those, 777 (6%) were considered serious and 32 of these were deaths that were investigated to search for a causal relationship with the vaccine.\n\nWhere an autopsy, death certificate or medical record was available, the deaths could be attributed to other causes. Two deaths were related to apparent variants of Lou Gehrig's disease in young girls and were still under investigation. Increased reporting of blood clots with this vaccine was also found coincident with other risk factors such as smoking or oral contraceptive use\n\nIronically, during the same week in which the CDC study reported reductions in HPV infection in the United States, the Japanese Ministry of Health, Labor and Welfare withdrew its recommendation (without suspending vaccinations) after reviewing adverse events reports. Japanese officials found that rates of adverse reactions reported after the HPV vaccines were higher than those with influenza and polio vaccines approved simultaneously in 2010 .\n\nMany have expressed concern over the possibility of increased promiscuity due to a sense of invulnerability after vaccinating children for HPV. This is a valid question as the use of condoms has done just this. Unlike the condom problem, HPV vaccination is not an ongoing lesson to children in their parents' lack of faith in them. Also, parents may be concerned about problems such as date rape leading to HPV infection regardless of their child's self-control.\n\nThere is evidence against the idea of increased promiscuity from a 2006-2010 retrospective cohort study of 1,398 girls age 11 to 12 years in Atlanta, Georgia. Lead researcher Robert Bednarczyk, et al., found no difference in sexual activity before or after vaccination. Of the participants, 493 had received at least one dose of the HPV vaccine and 905 had only received other age-appropriate vaccines.\n\nThe Catholic Medical Association position paper on HPV vaccination from January 2007 sums up the ethical points well. The vaccine appears to be effective and safe compared to other vaccines. It is not produced using aborted fetal cell lines [with human DNA contaminants]. The vaccination should not be mandated, because in the absence of sexual contact, unvaccinated students pose no threat to others.\n\nParents should be well-informed regarding the vaccine and alternative management of HPV. It should be kept in mind that duration of effectiveness for this vaccine is not yet known and that this vaccine does not protect against other STDs. Children and parents alike should be encouraged in chastity to promote full emotional and physical health and happiness.\n\nAs a parent, I find the medical community somewhat unwilling to disclose that HPV is a sexually transmitted disease. This appears to be related to medical providers' fear of delayed vaccination in the face of a rise in parent skepticism regarding vaccination generally. As a family physician, I find that parents appreciate discussing the risks of sexual activity and that sexual contact is necessary to be infected with HPV. Often they will decline the vaccine, especially when they have good rapport with their daughter or son.\n\nPatrick Hayes MD is a faithful Catholic who practices family medicine in Corpus Christi, Texas and serves as the President of the Corpus Christi Right to Life Committee http://corpuschristirighttolife.com/\n\n'Help Give every Student and Teacher FREE resources for a world-class Moral Catholic Education'", "opengraph": {"title": "HPV Vaccination: Is There An Elephant In This Room? - Health & Wellness - News - Catholic Online", "description": "As a parent, I find the medical community somewhat unwilling to disclose that HPV is a sexually transmitted disease However, as HPV is a sexually transmitted disease (STD), the success of a ...", "image": "https://www.catholic.org/files/images/ins_news/2013070037elephant_in_the_room_300.jpg", "url": "https://www.catholic.org/news/health/story.php?id=51576", "site_name": "Catholic Online"}, "tags": [], "tweets": [], "movies": [], "links": ["https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=Top%20Ad&utm_medium=We%20Humbly_orangeBlue", "https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=Top%20Ad&utm_medium=We%20Humbly_orangeBlue", "/search/?q=Patrick+Hayes+MD+", "https://www.catholic.org", "/news/health/", "/search/?q=HPV", "/search/?q=STD", "/search/?q=Vaccination", "/search/?q=HPV+vaccination", "/search/?q=Catholic+Medical+Association", "/search/?q=CDC", "/search/?q=Patrick+Hayes+MD", "http://jid.oxfordjournals.org/content/early/2013/06/18/infdis.jit192.full", "https://www.catholiconline.school/collections/st-angela-merici?utm_campaign=Catholic%20Online%20Ads&utm_source=Course%20Layout%201&utm_medium=angel", "https://www.catholiconline.school/collections/st-angela-merici?utm_campaign=Catholic%20Online%20Ads&utm_source=Course%20Layout%201&utm_medium=angel", "https://www.catholiconline.school/bundles/explore-the-bible-collection?utm_campaign=Catholic%20Online%20Ads&utm_source=Course%20Layout%201&utm_medium=Bible", "https://www.catholiconline.school/bundles/explore-the-bible-collection?utm_campaign=Catholic%20Online%20Ads&utm_source=Course%20Layout%201&utm_medium=Bible", "https://www.catholiconline.school/courses/first-holy-communion-with-certificate-of-completion?utm_campaign=Catholic%20Online%20Ads&utm_source=Course%20Layout%201&utm_medium=Certificate", "https://www.catholiconline.school/courses/first-holy-communion-with-certificate-of-completion?utm_campaign=Catholic%20Online%20Ads&utm_source=Course%20Layout%201&utm_medium=Certificate", "https://www.catholiconline.school/collections/blessed-virgin-mary?utm_campaign=Catholic%20Online%20Ads&utm_source=Course%20Layout%201&utm_medium=Mary", "https://www.catholiconline.school/collections/blessed-virgin-mary?utm_campaign=Catholic%20Online%20Ads&utm_source=Course%20Layout%201&utm_medium=Mary", "http://www.cdc.gov/vaccinesafety/Vaccines/HPV/jama.html", "https://login.medscape.com/login/sso/getlogin?urlCache=aHR0cDovL3d3dy5tZWRzY2FwZS5jb20vdmlld2FydGljbGUvODA2NjQ1&ac=401", "http://www.ncbi.nlm.nih.gov/pubmedhealth/behindtheheadlines/news/2012-10-16-hpV-jab-and-teen-promiscuity-no-link/", "http://www.cathmed.org/assets/files/Position%20Paper%20on%20HPV%20Immunization.pdf", "https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=ROS&utm_medium=We%20Humbly_success", "https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=ROS&utm_medium=We%20Humbly_success", "https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=ROS&utm_medium=We%20Humbly_success", "http://corpuschristirighttolife.com/", "https://ycvf.org"], "authors": ["Patrick Hayes MD "], "publish_date": "2013-07-04T19:00:37Z"}