{"result_id": "060006", "URL": "https://www.catholic.org/prwire/headline.php?ID=10190&wf=rsscol", "timestamp": "2023-04-25 14:34:31 CEST+0200", "meta": {"description": "For More Information: Tim Lilley, 678-990-9032 or TLilley@MaximusMG.com; Kevin ...", "lang": "en", "keywords": "", "favicon": "/assets/img/apple-touch-icon-144-precomposed.png", "canonical": "https://www.catholic.org/prwire/headline.php?ID=10190&wf=rsscol", "encoding": "utf-8"}, "image": null, "domain": "www.catholic.org", "title": "New California law frightens bestselling author Teresa Tomeo - Catholic PRWire and Events Calendar", "cleaned_text": "For More Information: \n\nTim Lilley, 678-990-9032 or \n\nTLilley@MaximusMG.com; \n\nKevin Wandra, 678-990-9032 or \n\nKWandra@MaximusMG.com\n\n\n\nMeasure enables girls 12 and older to get HPV vaccine - sans parental consent\n\nSAN FRANCISCO, CA (October 11, 2011) - With little fanfare, California Gov. Jerry Brown signed a bill Sunday that enables girls 12 and older to get the human papillomavirus (HPV) vaccine without parental consent.\n\nBestselling author Teresa Tomeo finds it disquieting, to say the least. \"It is frightening that some in our society continue to push parents out of the picture when it comes to major decisions involving their sons' and daughters' health and welfare,\" said Tomeo, author of the new book EXTREME MAKEOVER: WOMEN TRANSFORMED BY CHRIST NOT CONFORMED TO THE CULTURE.\n\n\"Children can't sign up for athletics - or be given as much as an aspirin in school - without Mom's or Dad's approval; but now, 12-year-olds in California can get the HPV vaccine without parental consent?!\n\n\"We don't pass out filtered cigarettes or light beer to our youth,\" Tomeo added. \"Why would we give them more reason to engage in unsafe behavior?\"\n\nIn EXTREME MAKEOVER, Tomeo writes, \"...when a tween or teen girl is given the vaccine, what are we saying to her? We are saying the same thing when we give her birth control pills or condoms: 'You're probably going to have sex soon anyway, so better safe than sorry.'\"\n\nTomeo challenges women to shed messages like this, and the toxic images that objectify and enslave them, and instead embrace the truth about their human dignity.\n\nTo schedule an interview with Tomeo and/or to request a review copy of EXTREME MAKEOVER, contact Tim Lilley (TLilley@MaximusMG.com) or Kevin Wandra (KWandra@MaximusMG.com) of The Maximus Group at 678-990-9032, or at the email addresses above. \n\n\n\nWe ask you, humbly: don't scroll away. Hi readers, it seems you use Catholic Online a lot; that's great! It's a little awkward to ask, but we need your help. If you have already donated, we sincerely thank you. We're not salespeople, but we depend on donations averaging $14.76 and fewer than 1% of readers give. If you donate just $5.00, the price of your coffee, Catholic Online School could keep thriving. Thank you. \n\n\n\n Help Now >", "opengraph": {"title": "New California law frightens bestselling author Teresa Tomeo - Catholic PRWire and Events Calendar - Catholic Online", "description": "For More Information: Tim Lilley, 678-990-9032 or TLilley@MaximusMG.com; Kevin ...", "url": "https://www.catholic.org/prwire/headline.php?ID=10190&wf=rsscol", "site_name": "Catholic Online"}, "tags": [], "tweets": [], "movies": [], "links": ["https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=ROS&utm_medium=We%20Humbly_success", "https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=ROS&utm_medium=We%20Humbly_success", "https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=ROS&utm_medium=We%20Humbly_success", "http://www.MaximusMG.com", "https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=Top%20Ad&utm_medium=We%20Humbly_orangeBlue", "https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=Top%20Ad&utm_medium=We%20Humbly_orangeBlue"], "authors": ["Catholic Online"], "publish_date": null}