{"result_id": "060005", "URL": "https://www.catholic.org/news/hf/faith/story.php?id=84871", "timestamp": "2023-04-25 14:34:30 CEST+0200", "meta": {"description": "There's reason to be hopeful about the future. There's reason for hope as we cope with these challenging times. Here's six reasons why hope is justified.  LOS ANGELES, CA (California Network) - ...", "lang": "en", "keywords": "Hope, COVID, coronavirus, economy, faith", "favicon": "/assets/img/apple-touch-icon-144-precomposed.png", "canonical": "https://www.catholic.org/news/hf/faith/story.php?id=84871", "encoding": "utf-8"}, "image": null, "domain": "www.catholic.org", "title": "Good News! Here's six reasons to be hopeful for the future! - Living Faith - Home & Family - News", "cleaned_text": "There's reason for hope as we cope with these challenging times. Here's six reasons why hope is justified.\n\nLOS ANGELES, CA (California Network) - Amid the worry and despair, there's reason to hope if one looks for reasons. Certainly, there's plenty to worry about. From COVID to economic problems, to civil unrest, many people are struggling with unprecedented challenges. But it's important to keep perspective and to know despite these problems, there's reason for hope.\n\n1. A vaccine is coming! - Vaccines are a cornerstone of modern health. As soon as COVID-19 started to spread several firms launched crash programs to produce a vaccine. Several of these vaccines show promise and a few are in their final testing phase. The vaccines will be distributed as soon as possible. Most estimates suggest we will get them early next year. And while that seems like a long time, it's fast for a vaccine. It will save lives and prevent many people from becoming seriously ill.\n\n2. Our strategies are working! - We may not like it, but social distancing, hand washing, closing gathering places, and wearing a mask are incredibly effective when simultaneously practiced. That's the trick. We have to do all these things at the same time. But in places where people have agreed to use these tactics we've seen COVID numbers drop quickly. Even though the number of cases reported each day is rising, we have the tools to keep ourselves well and to stop this disease. All we have to do is stick to the strategy. The sooner this disease is beaten, the happier we will be. It's up to you!\n\n3. Help is coming! - Today, the Senate agreed to provide Americans with more funds to weather the economic crisis caused by the pandemic. In other nations, similar programs have kept people fed and housed. We may not like accepting help from others, but in a moment of need we should be grateful that we live in a time where goods can be shared for the common good.\n\n4. There's a silver lining! - Although many businesses have closed, and unemployment is up, such economic troubles often come before better times. They're almost necessary because while they are painful, they free up labor for employment in new economic sectors. For example, advancements in agriculture during the 17th century caused many people to be pushed from rural areas into urban ones. The influx of labor made the industrial revolution possible. The hard times enabled the good times that eventually resulted in better living for all.\n\nThe businesses that close will be replaced with new ones that are innovative and strong. While the present feels dark, the future is getting brighter.\n\n5. We are called to hope! - As Christians, we are called to place our trust in the Lord. For the faithful, there is no need to worry because we know salvation awaits us. And we know even in the hardest times, we can thrive by clinging to our faith.\n\n6. We are resilient! - The human race survives. COVID-19 is not our first pandemic. Our ancestors survived worse with less help. Humanity has never been destroyed by any disaster. No disease, no conflict, no political upheaval has stopped us. Some people view humanity with pessimism, but we are also clever, creative, inventive, compassionate, and resilient. These traits still serve us.\n\nJust know, whatever the future holds, chances are you will survive it and even thrive in the times to come!", "opengraph": {"title": "Good News! Here's six reasons to be hopeful for the future! - Living Faith - Home & Family - News - Catholic Online", "description": "There's reason to be hopeful about the future. There's reason for hope as we cope with these challenging times. Here's six reasons why hope is justified.  LOS ANGELES, CA (California Network) - ...", "image": "https://www.catholic.org/files/images/ins_news/2020074855.jpg", "video": "https://www.youtube.com/watch?v=DdWORhNai9M", "url": "https://www.catholic.org/news/hf/faith/story.php?id=84871", "site_name": "Catholic Online"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.youtube.com/watch?v=DdWORhNai9M&autoplay=1", "https://catholiconline.shopping/collections/prayer-cards?utm_campaign=Catholic%20Online%20Ads&utm_source=ROS&utm_medium=PrayerCards", "/search/?q=Marshall+Connolly+%28NEWS+CONSORTIUM%29", "/news/hf/faith/", "/search/?q=Hope", "/search/?q=COVID", "/search/?q=coronavirus", "/search/?q=economy", "/search/?q=faith", "https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=ROS&utm_medium=We%20Humbly_success", "https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=ROS&utm_medium=We%20Humbly_success", "https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=ROS&utm_medium=We%20Humbly_success"], "authors": ["Marshall Connolly (NEWS CONSORTIUM)"], "publish_date": "2020-07-27T14:35:00Z"}