{"result_id": "060011", "URL": "https://www.catholic.org/news/health/story.php?id=68399", "timestamp": "2023-04-25 14:34:35 CEST+0200", "meta": {"description": "'Most of what we've learned is not reassuring.' The Centers for Disease Control and Prevention (CDC) reported the number of Zika cases in Puerto Rico has been doubling every week since the outbreak ...", "lang": "en", "keywords": "Zika, virus, CDC, microcephaly, warning", "favicon": "/assets/img/apple-touch-icon-144-precomposed.png", "canonical": "https://www.catholic.org/news/health/story.php?id=68399", "encoding": "utf-8"}, "image": null, "domain": "www.catholic.org", "title": "'Scarier than we initially thought': CDC discovers frightening details about the Zika virus - Health & Wellness - News", "cleaned_text": "The Centers for Disease Control and Prevention (CDC) reported the number of Zika cases in Puerto Rico has been doubling every week since the outbreak began. With no vaccine and no cure, there is no reason to believe the same will not happen in the United States.\n\nLOS ANGELES, CA (Catholic Online) - A recent Harvard study revealed most Americans are ignorant of Zika facts - particularly that it has no vaccine and no cure.\n\nThe Obama Administration lobbied Congress for $1.9 billion to help research the Zika virus - and got it.\n\nThe $1.9 billion, paired with over $510 million previously to be used to fight Ebola in Africa, will be utilized by scientists in the United States to research Zika and, hopefully, create a vaccine and cure.\n\nDoug Andres, a spokesman for House Speaker Paul Ryan, admitted: \"We're glad the administration has agreed to our request to use existing Ebola funds to address the Zika epidemic. If additional Zika resources are needed those funds could and should be addressed through the regular appropriations process.\"\n\nSenator Bill Nelson stated: \"Down the road we'll find a vaccine. Down the road we will be able to manage this problem. But in the meantime there's a great deal of trauma (and) some extraordinary heartbreak to some families.\"\n\nDr. Anne Schuchat, the principal deputy director of the CDC stated: \"Most of what we've learned is not reassuring. Everything we look at with this virus seems to be a bit scarier than we initially thought.\"\n\nThe most up-to-date information concerning the virus can be found at the CDC website , where you can find updated information concerning:\n\nZika, which has been around for quite a while, has never before been known to cause microcephaly death in the womb or neurological problems\n\n\"This is a very unusual virus that we can't pretend to know everything about it that we need to know,\" Dr. Anthony Fauci, the director of the National Institute of Allergy and Infections Diseases stated. \"I am not an alarmist and most of you who know me know that I am not, but the more we learn about the neurological aspects, the more we look around and say this is very serious.\"\n\nZika virus is spread through bites from Aedes species mosquitoes and sexual acts. The best way to protect yourself is to stop all sexual relations with anyone who has traveled to a Zika-infested area and to wear insect repellent.\n\nOther methods of protecting yourself can be found here.\n\nThe California Network is the Next Wave in delivery of information and entertainment on pop culture, social trends, lifestyle, entertainment, news, politics and economics. We are hyper-focused on one audience, YOU, the connected generation. JOIN US AS WE REDEFINE AND REVOLUTIONIZE THE EVER-CHANGING MEDIA LANDSCAPE.", "opengraph": {"title": "'Scarier than we initially thought': CDC discovers frightening details about the Zika virus - Health & Wellness - News - Catholic Online", "description": "'Most of what we've learned is not reassuring.' The Centers for Disease Control and Prevention (CDC) reported the number of Zika cases in Puerto Rico has been doubling every week since the outbreak ...", "image": "https://www.catholic.org/files/images/ins_news/2016043849cdc_releases_new_zika_warning.jpg", "url": "https://www.catholic.org/news/health/story.php?id=68399", "site_name": "Catholic Online"}, "tags": [], "tweets": [], "movies": [], "links": ["https://catholiconline.shopping/collections/prayer-cards?utm_campaign=Catholic%20Online%20Ads&utm_source=ROS&utm_medium=PrayerCards", "/search/?q=Kenya+Sinclair+%28CALIFORNIA+NETWORK%29", "https://www.youtube.com/c/californianetwork", "/news/health/", "/search/?q=Zika", "/search/?q=virus", "/search/?q=CDC", "/search/?q=microcephaly", "/search/?q=warning", "https://www.catholic.org/news/health/story.php?id=68187", "http://www.123contactform.com/form-1829073/?utm_source=Catholic%20Online&utm_medium=Survey&utm_content=Prayers%20Trivia%20Quiz%20Questions&utm_campaign=Prayers%20Trivia%20Quiz", "https://ycvf.org/collections/where-most-needed", "http://www.cdc.gov/zika/", "https://www.catholic.org/news/health/story.php?id=66615", "https://www.catholic.org/news/health/story.php?id=67743", "https://www.google.com/url?q=https://www.catholic.org/news/health/story.php%3Fid%3D67477&sa=U&ved=0ahUKEwiNuJmAz4nMAhWPth4KHQ4-DUQQFggFMAA&client=internal-uds-cse&usg=AFQjCNFKkehLGoHWRReTelulMx3_NpCKeA", "https://www.niaid.nih.gov/Pages/default.aspx", "http://www.cdc.gov/zika/prevention/index.html", "https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=ROS&utm_medium=We%20Humbly_success", "https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=ROS&utm_medium=We%20Humbly_success", "https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=ROS&utm_medium=We%20Humbly_success"], "authors": ["Kenya Sinclair (CALIFORNIA NETWORK)"], "publish_date": "2016-04-12T13:58:00Z"}