{"result_id": "060042", "URL": "https://www.catholic.org/news/health/story.php?id=84853", "timestamp": "2023-04-25 14:35:01 CEST+0200", "meta": {"description": "Vaccine could be ready by year end. The first of several COVID-19 vaccines tested in the USA has entered its final testing phase, after showing promising results in early trials. If successful, the ...", "lang": "en", "keywords": "COVID-19, vaccine", "favicon": "/assets/img/apple-touch-icon-144-precomposed.png", "canonical": "https://www.catholic.org/news/health/story.php?id=84853", "encoding": "utf-8"}, "image": null, "domain": "www.catholic.org", "title": "COVID-19 Vaccine in Final Testing Phase - Health & Wellness - News", "cleaned_text": "The first of several COVID-19 vaccines tested in the USA has entered its final testing phase, after showing promising results in early trials. If successful, the vaccine could be administered early next year.\n\nLOS ANGELES, CA (California Network) - The world will grapple with COVID-19 until a vaccine is developed and deployed in sufficient measure to ensure herd immunity. Around the globe, governments continue to take severe measures to contain the virulent disease. Borders are closed, entire industries shuttered, and people are compelled to remain indoors. Those allowed outside are almost universally required to wear masks. Social distancing is enforced and there are limits on who can go where and how much people can buy.\n\nThese restrictions are everywhere in much of the world. They are not merely an American phenomenon. Even in nations where COVID-19 infection rates are dropping, these restrictions remain in force. It is understood that even one infected person can cause a resurgence of the disease, and until it is eradicated, caution must be exercised.\n\nThe best hope for eradication comes in the form of a vaccine. And the vaccine must be universally distributed, something anti-vaxxers and those who mistrust such programs will resist. It remains to be seen how harshly governments will enforce mandatory vaccination, which is certain to happen, regardless of personal beliefs. Those who ultimately refuse vaccination may find themselves restricted from international travel, public schools, and other places.\n\nThe vaccine does hold significant promise. The vaccine is developed by the National Institutes of Health and Moderna Inc. A final test of 30,000 people will begin on July 27. The results will be available by the end of the year, and if successful the vaccine could enter production and be distributed by early next year.\n\nBased on early results, tests on 45 people showed good results. The vaccine provided the immune boost required. Their bodies produced the correct antibodies in the bloodstream.\n\nThis is important. While some argue you can consume certain foods or vitamins to \"boost\" your immune system, such activities produce only a marginal result, if at all. Antibodies are specific for each pathogen at a molecular level. No food can provide the correct molecular combination to replace the antibodies produced by your body. And the only way to get the body to produce the disease specific antibodies is to expose the body to the disease. Vaccines use bits of neutralized viruses to provoke immune responses. Contrary to common belief, they do not give people the illness because the virus isn't a whole, live virus.\n\nOf course, vaccines aren't perfect. Some people have suffered reactions to vaccines, but their numbers are relatively rare, and much fewer than those who would otherwise suffer from any disease. Vaccines have become a cornerstone of global health.\n\nThere are other firms developing COVID vaccines around the world. Each nation will employ their own versions of the vaccine, with the most successful versions being mass produced and shared around the world.\n\nUntil next year, we should expect COVID restrictions to persist. While local economies may cautiously open, additional closures should be expected as the cases surge and decline over time. This is a normal pattern, usually caused by reopening too soon. It was observed in the 1918 Spanish Flu pandemic, which came in waves. The waves were caused by premature reopening, which required re-closing.\n\nIn many countries, not just the USA, there is great pressure to return to normal. But such a return simply isn't possible without a strict 30-day lockdown, long enough for the virus to stop spreading. The virus is spread by people, when people move, the virus moves. If people stop moving, the virus stops and cannot infect another victim.\n\nSuch lockdowns aren't possible in much of the world because the people will not tolerate them and governments cannot enforce them. This leaves vaccination as the next best hope for controlling the virus. But a vaccine will not be ready until next year. So until then, we will have to cope as we have these past several months.", "opengraph": {"title": "COVID-19 Vaccine in Final Testing Phase - Health & Wellness - News - Catholic Online", "description": "Vaccine could be ready by year end. The first of several COVID-19 vaccines tested in the USA has entered its final testing phase, after showing promising results in early trials. If successful, the ...", "image": "https://www.catholic.org/files/images/ins_news/2020073910.jpg", "video": "https://www.youtube.com/watch?v=3OK5BUYW-To", "url": "https://www.catholic.org/news/health/story.php?id=84853", "site_name": "Catholic Online"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.youtube.com/watch?v=3OK5BUYW-To&autoplay=1", "https://www.catholiconline.school/", "/search/?q=Marshall+Connolly+%28NEWS+CONSORTIUM%29", "/news/health/", "/search/?q=COVID-19", "/search/?q=vaccine", "https://ycvf.org/products/saved-by-hope"], "authors": ["Marshall Connolly (NEWS CONSORTIUM)"], "publish_date": "2020-07-15T14:36:00Z"}