{"result_id": "060002", "URL": "https://www.catholic.org/news/health/story.php?id=85433", "timestamp": "2023-04-25 14:34:28 CEST+0200", "meta": {"description": "As Catholics, and as Americans, we have a choice. The rest of the world has a choice as well. United States Senator Rand Paul is inspiring COVID mandate resistance by telling everyone he will resist ...", "lang": "en", "keywords": "COVID, choice, mandates, vaccine", "favicon": "/assets/img/apple-touch-icon-144-precomposed.png", "canonical": "https://www.catholic.org/news/health/story.php?id=85433", "encoding": "utf-8"}, "image": null, "domain": "www.catholic.org", "title": "How should Catholics respond to new mandates? - An opinion - Health & Wellness - News", "cleaned_text": "United States Senator Rand Paul is inspiring COVID mandate resistance by telling everyone he will resist any new mandates. In a video posted to Twitter, he calls for an end to COVID restrictions and a reopening of all government agencies and schools. Yet, COVID continues to spread across the nation, and around the world. Concerned Catholics want to know how to respond to this issue.\n\nLOS ANGELES, CA (California Network) - Senator Rand Paul is making headlines with his defiant stand against a return to COVID restrictions in the United States.\n\nCatholics want to know how they should respond to this issue. Because it is a question of choice, guidance is often lacking and varied. It's a confusing issue. By way of opinion, I wish to share some perspective.\n\nCOVID is a real and serious condition caused by a virus known as SARS-CoV-2. It is worse than the flu. In addition to causing flu-like symptoms and extreme fatigue, the virus appears to attack the vascular system and in some cases can cause a variety of long-term chronic conditions.\n\nAccording to CDC and other global statistics, COVID is more fatal than the garden variety flu. Generally those who die suffer from comorbidities, such as obesity and heart disease. However, seemingly healthy, young people have also died.\n\nFor most people, the severity of conditions depends on age. Elderly people can suffer mild-to-severe symptoms while children can experience few symptoms, if any.\n\nWhat troubles experts about COVID are two things. First, the disease is exceptionally contagious, and can be carried and spread by people for as long as two weeks before symptoms appear. This makes the virus quite transmissible, and it can spread in a community long before anyone realizes they are sick.\n\nSecond, the virus seems to mutate rapidly, and scientists don't know how bad it can potentially become. All viruses seem to have a limit to their virulence, but there is no indication that COVID has reached that limit. For this reason, the virus could become a serious threat to human life in the future, even for people who are vaccinated.\n\nMasks, social distancing, and hand washing help reduce transmission, but as we've seen none of these measures are 100 percent effective. They help, but they aren't magic. Generally, this is because compliance isn't universal.\n\nThe vaccine is effective, so far. However, the vaccine was rushed into production, was given emergency approval, and there are some who are concerned over long term impacts as well as the precedent of mandating vaccinations for COVID.\n\nThere is also the question of how these vaccines were produced, using questionable stem cell lines, some taken from aborted children. While the Church has granted pass, giving its \"okay\" to use these vaccines, this is still a grave moral question that should be carefully considered.\n\nWe also know COVID mandates have themselves proved to be destructive. Everyone knows someone who lost their job or business due to COVID. And even those who remained employed likely experienced drastic changes because of the mandates.\n\nNow, as a new COVID variant, \"Delta\" spreads across the United States, officials are faced with the tough choice to either reinstitute COVID mandates, or not. This decision comes at a time when the nation is returning to work and some semblance of \"normal\" following the pandemic (which is still ongoing).\n\nSo, how should Catholics respond?\n\nOne point presented by Senator Paul is this: most Americans have either had COVID, been offered the vaccine, or have chosen not to get it. And that makes the present situation different. Now, people who choose to face COVID without the aid of a vaccine are making a personal, informed choice. Reinstituting mandates on their account will do little good. Keeping children home from another year of school won't make much positive difference to their health. And keeping government offices closed only means everything continues to run sluggishly.\n\nIn fact, the only argument in favor of mandates is that they can offer some degree of protection to those who are immune-compromised and cannot have the vaccine. But there are other ways to protect these vulnerable individuals without closing offices, schools, and churches.\n\nInstead of plotting a massive do-over of 2020 with trillions of dollars in stimulus added to the deficit, the nation should simply reopen. Mask mandates, social distancing, and certain reasonable restrictions may have some benefit, but in general people have the opportunity to get vaccinated. At this point, the risk is theirs. Those who are endangered by COVID and cannot get vaccinated can be given stimulus funds and the assistance they need. Yes, a law will have to be passed by Congress to authorize this assistance, but that shouldn't be a problem since it will be far cheaper and more effective than shuttering million of businesses and sending everyone checks.\n\nAs Americans, we have medical autonomy, that is the right to make our own healthcare decisions. Included is the right to refuse care. Naturally, if we choose to be unvaccinated, then we have a moral obligation to others in our society. If exposed, we should get tested. If infected, we must quarantine. We should mask up, wash our hands, and practice social distancing, even if we are vaccinated. And, we need to go back to work. We need to return to Mass. We can distance during Mass and use hand sanitizer. There are plenty of ways to return to normal, safely.\n\nWe may not like masks or standing in lines created by social distancing guidelines, but these are minor, reasonable inconveniences, and a much better alternative to edicts that violate individual freedom and destroy hard-built businesses.\n\nLet us be sensible, cooperative, and industrious, these are not exclusive choices.", "opengraph": {"title": "How should Catholics respond to new mandates? - An opinion - Health & Wellness - News - Catholic Online", "description": "As Catholics, and as Americans, we have a choice. The rest of the world has a choice as well. United States Senator Rand Paul is inspiring COVID mandate resistance by telling everyone he will resist ...", "image": "https://www.catholic.org/files/images/ins_news/2021081835.jpg", "url": "https://www.catholic.org/news/health/story.php?id=85433", "site_name": "Catholic Online"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">We are at a moment of truth and a crossroads. Will we allow these people to use fear and propaganda to do further harm to our society, economy, and children?</p>\n<p>Or will we stand together and say, absolutely not. Not this time. I choose freedom. <a href=\"https://t.co/XrI2tjdAHW\">pic.twitter.com/XrI2tjdAHW</a>- Senator Rand Paul (@RandPaul) <a href=\"https://twitter.com/RandPaul/status/1424399282447298563?ref_src=twsrc%5Etfw\">August 8, 2021</a></p></blockquote>\n"], "movies": [], "links": ["https://holygrind.org/collections/sale", "/search/?q=Marshall+Connolly+%28NEWS+CONSORTIUM%29", "/news/health/", "/search/?q=COVID", "/search/?q=choice", "/search/?q=mandates", "/search/?q=vaccine", "https://t.co/XrI2tjdAHW", "https://twitter.com/RandPaul/status/1424399282447298563?ref_src=twsrc%5Etfw", "https://catholiconline.shopping/collections/prayer-cards?utm_campaign=Catholic%20Online%20Ads&utm_source=ROS&utm_medium=PrayerCards", "https://www.catholiconline.school/"], "authors": ["Marshall Connolly (NEWS CONSORTIUM)"], "publish_date": "2021-08-10T14:16:00Z"}