{"result_id": "060029", "URL": "https://www.catholic.org/news/health/story.php?id=73035", "timestamp": "2023-04-25 14:34:53 CEST+0200", "meta": {"description": "'We are specifically looking at pneumonic plague because the mortality rate associated with pneumonic plague is very high ďż˝ The Medieval disease notorious for killing off one-third of Europe's ...", "lang": "en", "keywords": "Terror, threat, plague, pneumonic, scientists, vaccine", "favicon": "/assets/img/apple-touch-icon-144-precomposed.png", "canonical": "https://www.catholic.org/news/health/story.php?id=73035", "encoding": "utf-8"}, "image": null, "domain": "www.catholic.org", "title": "Scientists scramble for PLAGUE VACCINE in face of possible BIOLOGICAL WARFARE - Health & Wellness - News", "cleaned_text": "The Medieval disease notorious for killing off one-third of Europe's entire population may be making a comeback - this time aimed straight for the United States.\n\nLOS ANGELES, CA (Catholic Online) - The bubonic plague, which originally spread through Europe at the hands of filthy, diseased rats, was called the Black Death.\n\nIn 13th century Europe, there had been rumors of a strange death in other countries but it didn't reach them until fleets of ships arrived with most of their crews dead or deathly ill.\n\nThe ships were all sent away but it was too late. Europe was forever changed as the disease spread at the hands of diseased rats and their fleas.\n\nRoughly 20 million people were killed and Europe was devastated. It was so deadly, a person with an impaired immune system could go to sleep feeling and looking healthy but would be discovered dead by morning.\n\nToday the disease has rarely cropped up and is treated with antibiotics but it has also changed. Scientists understand the Black Death can be spread through the air as well as through infected flea or rat bites in what is classified as the pneumonic plague.\n\nThe World Health Organization has classified the plague a \"re-emerging human pathogen,\" which Dr. Ashok Chopra, a professor of microbiology and immunology at the University of Texas, explained is dangerous enough to wipe out millions.\n\nSpeaking to The Sun Online, Dr. Chopra stated: \"We are specifically looking at pneumonic plague because the mortality rate associated with pneumonic plague is very high - almost 100 percent.\"\n\nDr. Chopra knows how deadly the disease is and what the price would be to any unprepared country.\n\n\"It's very easy to grow, the bacteria, you don't need any sophisticated equipment so if it falls into the wrong hands they can grow it and spread it easily,\" Dr. Chopra warned.If terrorists use those organisms - they could utilise the bacteria.\n\n\"It could lead to mass deaths in a very short period of time. It would spread very, very quickly. Think about the bubonic plague in Europe in the 13th, 14th century. One third of the population was wiped out because of infection. That's the typical scenario that you should think of.\n\n\"At the time it started with the bubonic plague and then it went to the pneumonic plague and one third of the population died so the consequences could be enormous.\"\n\nTrials to test vaccines on rats have been successful - so far. Dr. Chopra announced lab rats were vaccinated from the disease and remain immune after five months.\n\nHis trials have caught the attention of the Department of Defense, which is prepared to grant him additional funding to begin trials on monkeys.\n\nThe preemptive precautions are not without reasonable cause.\n\n\"We had more cases of plague in 2015, 2016, after a very long period of time,\" Dr. Chopra explained. \"The last case was in 1924 in LA ... then it was 2015, 2016. So that is quite scary, that there may be more cases of natural infections in the area - so it is important not only for cases of terrorism.\"\n\nThere are antibiotics available to cure the plague but the drugs are useless if it is not administered within 24 hours of symptoms. Since the disease is so old and rare, most doctors will be unlikely to correctly diagnose it until it is too late.\n\nDr. Chopra said the symptoms are often mistaken for those of the common flu, which is why a vaccine is so important.\n\n\"The window for antibiotic treatment is very narrow, so it is usually between 20 - 24 hours after the appearance of the symptoms of the disease,\" Dr. Chopra explained. \"If you delay the treatment then you will still see people dying.\n\n\"Therefore it's very important that we have a vaccine to be given to people, especially to military people who go overseas.\"\n\nThe California Network is the Next Wave in delivery of information and entertainment on pop culture, social trends, lifestyle, entertainment, news, politics and economics. We are hyper-focused on one audience, YOU, the connected generation. JOIN US AS WE REDEFINE AND REVOLUTIONIZE THE EVER-CHANGING MEDIA LANDSCAPE.", "opengraph": {"title": "Scientists scramble for PLAGUE VACCINE in face of possible BIOLOGICAL WARFARE - Health & Wellness - News - Catholic Online", "description": "'We are specifically looking at pneumonic plague because the mortality rate associated with pneumonic plague is very high ďż˝ The Medieval disease notorious for killing off one-third of Europe's ...", "image": "https://www.catholic.org/files/images/ins_news/2017013521acientists_race_to_develop_plague_vaccine_in_face_of_terrorist_threats.jpg", "video": "https://www.youtube.com/watch?v=ATrIyT78iVY&t=1s", "url": "https://www.catholic.org/news/health/story.php?id=73035", "site_name": "Catholic Online"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.youtube.com/watch?v=ATrIyT78iVY&autoplay=1", "https://catholicresources.education/collections/most-popular", "/search/?q=Kenya+Sinclair+%28CALIFORNIA+NETWORK%29", "https://www.youtube.com/c/californianetwork", "/news/health/", "/search/?q=Terror", "/search/?q=threat", "/search/?q=plague", "/search/?q=pneumonic", "/search/?q=scientists", "/search/?q=vaccine", "https://prayercandles.org/", "https://www.thesun.co.uk/news/2599633/scientists-race-to-develop-vaccine-for-the-plague-amid-fears-terrorists-could-use-the-medieval-disease-to-kill-millions/", "https://prayercandles.org/products/lenten-easter-virtual-prayer-candle", "http://catholicshopping.com/collections/crosses-crucifixes"], "authors": ["Kenya Sinclair (CALIFORNIA NETWORK)"], "publish_date": "2017-01-15T13:35:00Z"}