{"result_id": "060032", "URL": "https://www.catholic.org/news/ae/movies/story.php?id=29777", "timestamp": "2023-04-25 14:34:56 CEST+0200", "meta": {"description": "The Philadelphia Inquirer (MCT) - 'Autism's False Prophets: Bad Science, Risky Medicine and the Search for a Cure' by Paul A. Offit; Columbia University Press ($24.95) Next to clean drinking water, ...", "lang": "en", "keywords": "", "favicon": "/assets/img/apple-touch-icon-144-precomposed.png", "canonical": "https://www.catholic.org/news/ae/movies/story.php?id=29777", "encoding": "utf-8"}, "image": null, "domain": "www.catholic.org", "title": "'Autism's False Prophets': Defending vaccines in the debate - Movies & Theatre - Entertainment - News", "cleaned_text": "The Philadelphia Inquirer (MCT) - \"Autism's False Prophets: Bad Science, Risky Medicine and the Search for a Cure\" by Paul A. Offit; Columbia University Press ($24.95)\n\nNext to clean drinking water, vaccines are arguably the most important advance in public health in the last 300 years. Thanks to vaccines, we have eradicated smallpox, wiped out polio virus in the Western hemisphere, closed in on measles, and brought many other once fatal or debilitating diseases under control.\n\nBut despite the indisputable track record of vaccines in lowering mortality and morbidity here and around the world, the American public has been embroiled, over the last decade, in a heated debate about whether vaccines are safe. In particular, the notion that vaccines cause autism has taken hold of the public imagination and refuses to let go, even in the face of growing scientific evidence to the contrary.\n\nIn \"Autism's False Prophets,\" Paul A. Offit, co-inventor of the rotavirus vaccine and chief of infectious disease at Children's Hospital of Philadelphia, helps to explain why. He has done a huge public service by exposing the tragic and dangerous place the anti-vaccine hysteria has taken us.\n\nOffit's account, written in layman's terms and with the literary skill of good storytellers, provides important insight into the fatal flaws of the key arguments of vaccine alarmists, including such well-known names as Robert F. Kennedy Jr., Sen. Joseph Lieberman, I-Conn., and Sen. John Kerry, D-Mass.\n\nOffit rightly takes major news organizations to task for failing to stress that the overwhelming majority of the scientific community has rejected the hypothesis that vaccines cause autism. But the book's chief failing is that it does not hold scientists sufficiently accountable for their failure to communicate well enough with the media and the lay public.\n\nOn the face of it, it's not so unreasonable to look for a possible causal link between vaccines and autism. Two decades ago, autism was diagnosed in one in 10,000 births; today, the ratio is one in 150. During roughly the same period, the number of vaccines routinely given during childhood has doubled, from 7 to 14.\n\nMoreover, the signs of autism often appear during the infant toddler years, the very time when children get most of their vaccinations. And despite the best efforts of science, no one has yet pinned down a cause of autism, although studies in twins point strongly to a genetic basis.\n\nSo it didn't take much _ one tiny study, involving 12 autistic children _ to light a firestorm of controversy about whether childhood immunizations are the causative agent of autism.\n\nThe study, conducted by Andrew Wakefield, a British doctor, was published in the Lancet, a prestigious medical journal, in 1998. He suggested that the measles part of the combination measles-mumps-and-rubella vaccine set off gastrointestinal problems that led to autism.\n\nIn 2004, Wakefield's study was found to be fraudulent, and the Lancet retracted the findings. But by then, the controversy had morphed into a broader claim: that the ethyl mercury in thimerosal, a chemical used to preserve vaccines, caused autism.\n\nAlthough there had been no evidence that the small amounts of thimerosal in vaccines were a danger to humans, much less caused autism, U.S. public health officials and the American Academy of Pediatrics were concerned about the cumulative amount of mercury exposure in childhood vaccines taken together. In 1999, they recommended that thimerosal be removed and, by 2001, childhood vaccines were largely free of mercury.\n\nStill, the controversy goes on. The parents of more than 5,000 children with autism have filed suit in a special federal court, seeking compensation for the autism that they allege was caused by their children's vaccines. Their touching stories, which are sympathetically described by Offit, have won the hearts _ if not the minds _ of many in the public and the media.\n\nBut appearances, as Offit points out, can be deceptive.\n\nAs it turns out, the increase in autism may not be an increase at all. Rather, doctors may be diagnosing autism in more children now because we have expanded the definition of autism _ now called autistic spectrum disorders _ and doctors, more aware of the problem, are spotting it more often. What's more, as logic dictates, the rooster crows before the sun comes up, but that doesn't mean the rooster caused the sun to rise. It just so happens that vaccines are given about the same time that children develop language and that the first signs of autism emerge.\n\nAs Offit points out, since the controversy first erupted with Wakefield's paper, six large epidemiological studies have found no connection between the measles-mumps-and-rubella vaccine and autism. Another study, led by scientists at Columbia University and reported just two weeks ago, was unable to replicate Wakefield's results.\n\nOn the broader issue of thimerosal, there have been nine epidemiological studies that have found no causal connection between the traces of ethyl mercury in the preservative and autism or less obvious but related neurological problems. At this point, the scientific evidence is very hard to dispute.\n\nIf that were all Offit discussed, his book would be unremarkable. What makes this a riveting read is that Offit goes behind the scenes and takes us inside laboratories, public-health organizations, congressional hearing rooms, and parent lobbying groups to tell the inside story of how desperate parents and a gullible public have been sold a bill of goods by renegade scientists, timid public-health officials, overly zealous politicians, aggressive personal-injury lawyers, unscrupulous public-relations firms and, perhaps most powerful of all, media more interested in anecdote than careful analysis.\n\nLast fall, for example, actress Jenny McCarthy made the media rounds promoting her book, \"Louder Than Words,\" about using B-12 shots to cure her autistic son, Evan. She appeared on the \"Oprah Winfrey Show,\" \"Good Morning America,\" and \"Larry King Live.\" Asked by Oprah about scientific evidence that vaccines don't cause autism, McCarthy replied, \"My science is Evan, and he's at home. That's my science.\" The audience roared its approval.\n\nThe incident, cited by Offit, illustrates the larger point of his book. The bigger picture, of which the vaccine-autism controversy is but a small part, is that we live in an age when, despite our technological advances, few people understand how science works or, in larger terms, the need for reason.\n\nHow else to explain, for example, the results of various polls, which have found most Americans believe in angels; nearly half believe in ghosts; some three-quarters believe in miracles; and, according to the Pew Forum on Religion & Public Life, 42 percent believe life has existed in its present form since the beginning of time? In that regard, Alaska Gov. Sarah Palin, now the Republican vice-presidential nominee, a woman who has advocated the teaching of creationism alongside evolution in Alaska's public schools, is in step with the anti-intellectual mind-set that pervades American culture. As Susan Jacoby has written, we are living in an age of American unreason.\n\nCritics will say Paul Offit does not join the vaccine/autism debate as an objective observer. Indeed, he has been a key combatant on one side over the last decade.\n\nOffit is a champion of childhood vaccines to protect children from crippling and sometimes fatal disease. He has served on the committee that advises the U.S. Centers for Disease Control and Prevention, which sets immunization policy for the nation's children. Along with colleagues Stanley Plotkin and Fred Clark, Offit was the co-inventor of the rotavirus vaccine made by Merck & Co. It aims to prevent a disease that kills 2,000 children a day, most of them in developing countries.\n\nBut Offit is also a world-class scientist who knows that, if the data aren't there, they aren't there. To act on unfounded claims that vaccines cause autism is to put children and communities at risk.\n\nFor fear of autism, more American parents are refusing to have their children vaccinated; there has been a bump up in measles and other vaccine-preventable diseases. Autistic children have been subjected to expensive, ineffective and sometimes dangerous treatments to reverse the damage supposedly done by vaccines, and research dollars that might be spent on investigating the true causes and treatments for autism have been squandered on junk science.\n\nOffit, who has not been afraid to speak out before, has done it again, this time in a book that names names and calls nonsense nonsense. Even before the book came out, the anti-vaccine lobby was all over Offit, calling him a dupe of the drug companies and much worse. Veiled threats of physical harm against him and his children have arrived in his inbox and voice mail. For understandable reasons, there will be no book tour for \"Autism's False Prophets.\n\nHuntly Collins is an assistant professor of communication at La Salle University and former medical writer at The Philadelphia Inquirer, where she covered AIDS and other infectious diseases.", "opengraph": {"title": "'Autism's False Prophets': Defending vaccines in the debate - Movies & Theatre - Entertainment - News - Catholic Online", "description": "The Philadelphia Inquirer (MCT) - 'Autism's False Prophets: Bad Science, Risky Medicine and the Search for a Cure' by Paul A. Offit; Columbia University Press ($24.95) Next to clean drinking water, ...", "url": "https://www.catholic.org/news/ae/movies/story.php?id=29777", "site_name": "Catholic Online"}, "tags": [], "tweets": [], "movies": [], "links": ["https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=Top%20Ad&utm_medium=We%20Humbly_blackRed", "https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=Top%20Ad&utm_medium=We%20Humbly_blackRed", "/search/?q=Huntly+Collins", "http://www.mctdirect.com", "/news/national/", "https://montanaranchandcattle.com/discount/SPRING50?redirect=%2Fcollections%2F50-off-spring-sale", "https://www.catholiconline.school/", "https://catholiconline.shopping/collections/prayer-cards?utm_campaign=Catholic%20Online%20Ads&utm_source=ROS&utm_medium=PrayerCards"], "authors": ["Huntly Collins"], "publish_date": "2008-10-01T15:20:15Z"}