{"result_id": "060010", "URL": "https://www.catholic.org/news/health/story.php?id=77463", "timestamp": "2023-04-25 14:34:34 CEST+0200", "meta": {"description": "Poor nutrition, anti-vaccination movement, a lack of sanitation are contributing factors. Victorian-era diseases are making a comeback. Declining public health standards, poverty, and skipping ...", "lang": "en", "keywords": "diseases, Victorian, vaccination, sanitation", "favicon": "/assets/img/apple-touch-icon-144-precomposed.png", "canonical": "https://www.catholic.org/news/health/story.php?id=77463", "encoding": "utf-8"}, "image": null, "domain": "www.catholic.org", "title": "Polio? Rickets? Here's why Victorian-era diseases are coming back - Health & Wellness - News", "cleaned_text": "Victorian-era diseases are making a comeback. Declining public health standards, poverty, and skipping vaccinations are to blame. Polio, rickets, measles, syphilis, and gonorrhea are coming back.\n\nLOS ANGELES, CA (California Network) - A case of polio has been reported in Venezuela, where government collapse and poverty have caused a public health crisis. Venezuela is a hotbed of infectious diseases due to high rates of malnutrition and low rates of vaccination.\n\nThe victim is a child, who officials say has not been vaccinated. Polio is a serious disease and can be fatal in about 1 in 100 cases. Polio was almost eradicated and was on track to follow smallpox and rinderpest to extinction, but there are a few places where the disease remains. People, beset by poverty and mistrust for vaccinations often skip getting vaccinated and are therefore vulnerable.\n\nThe disease exists in the wild, and not just in human hosts, making ongoing vaccinations essential to eradication.\n\nPolio isn't the only disease coming back. Despite living in a world with unprecedented wealth and productivity, the scandalous distribution of those riches has millions of people without decent nutrition. Diseases like rickets and gout have returned due to poor nutrition. It isn't just the poor suffering, but the rich too. Malnutrition has become bad enough in the developed world that people are suffering because they are not eating a balanced diet.\n\nSexually transmitted diseases are also on the rise due to promiscuity. Some diseases, like syphilis and gonorrhea, are returning because so many people are engaged in risky behavior. Typically, these diseases can be cured with antibiotics, but resistant strains have emerged which are very difficult to cure. It is possible if such diseases spread into regions with poor health infrastructure they could become deadly again.\n\nSanitation is a key factor in eradicating and preventing disease. Government collapse in places like Venezuela is compromising sanitation, causing disease. It is critical for basic infrastructure to be restored.\n\nComprehensive healthcare matters so that people get their vaccinations and treatments without barriers. Geography, expense, and a lack of available resources must all be overcome.\n\nFinally, people need to get their vaccinations and other treatments. Vaccination is a cornerstone of modern public health and while a few people cannot get vaccinated due to sincere medical or religious concerns, most people can and should be vaccinated. A growing number of people who are choosing to skip vaccinations due to misinformation are becoming a public health hazard, threatening to compromise herd immunity. Such people are generally not a danger to the vaccinated, but not all people can be vaccinated. Some people have compromised immune systems, and in a small number of cases, the vaccinations may not work at all. Diminished public vaccination rates threaten these people as well as small children who cannot yet be fully vaccinated. All people should consult with their doctors to make a properly informed decision over whether or not to vaccinate.\n\n'Help Give every Student and Teacher FREE resources for a world-class Moral Catholic Education'", "opengraph": {"title": "Polio? Rickets? Here's why Victorian-era diseases are coming back - Health & Wellness - News - Catholic Online", "description": "Poor nutrition, anti-vaccination movement, a lack of sanitation are contributing factors. Victorian-era diseases are making a comeback. Declining public health standards, poverty, and skipping ...", "image": "https://www.catholic.org/files/images/ins_news/2018062634.jpg", "video": "https://www.youtube.com/watch?v=gDBBOsY79vs", "url": "https://www.catholic.org/news/health/story.php?id=77463", "site_name": "Catholic Online"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.youtube.com/watch?v=gDBBOsY79vs&autoplay=1", "https://catholiconline.shopping/collections/prayer-cards?utm_campaign=Catholic%20Online%20Ads&utm_source=ROS&utm_medium=PrayerCards", "https://www.catholic.org", "/news/health/", "/search/?q=diseases", "/search/?q=Victorian", "/search/?q=vaccination", "/search/?q=sanitation", "https://ycvf.org/products/prayer-request-live", "https://catholiconline.shopping/collections/prayer-cards?utm_campaign=Catholic%20Online%20Ads&utm_source=ROS&utm_medium=PrayerCards", "https://ycvf.org/products/prayer-request-live", "https://ycvf.org"], "authors": ["Marshall Connolly (Catholic Online) "], "publish_date": "2018-06-11T11:16:00Z"}