{"result_id": "060030", "URL": "https://www.catholic.org/news/sports/story.php?id=86041", "timestamp": "2023-04-25 14:34:54 CEST+0200", "meta": {"description": "Football player faces a long road to recovery. Players are asked for NFL professional athlete, Damar Hamlin. Hamlin collapsed last week during a football game against the Cincinnati Bengals.   LOS ...", "lang": "en", "keywords": "Damar Hamlin, recovery, football, cardiac arrest", "favicon": "/assets/img/apple-touch-icon-144-precomposed.png", "canonical": "https://www.catholic.org/news/sports/story.php?id=86041", "encoding": "utf-8"}, "image": null, "domain": "www.catholic.org", "title": "We Pray for Damar Hamlin - Sports - News", "cleaned_text": "Players are asked for NFL professional athlete, Damar Hamlin. Hamlin collapsed last week during a football game against the Cincinnati Bengals.\n\nLOS ANGELES, CA (California Network) - Buffalo Bills football player, Damar Hamlin is slowly recovering from a near-fatal collapse suffered last Monday during a game against the Cincinnati Bangles. Many members of the NFL have launched a social media campaign asking that we \"Pray for Damar.\" Seemingly in response, Hamlin's condition has improved, and he appears to be coming back from the brink of death.\n\nHamlin's breathing tube was removed today, and he wrote his first message to his friends and family from his hospital bed, asking if the team had won the game.\n\nThe game was canceled following his collapse on the field, and the players spent some of their time on the field in prayer, waiting for updates on his condition.\n\nHamlin joins a remarkable list of young athletes who in the past year have collapsed or died due to injuries or from unknown causes, often related to heart injuries. There is some speculation that these injuries are related to the COVID vaccine, and others simply claim the fatalities are normal in activities where physical exertion is common.\n\nWe join the multitudes praying for the recovery of Damar Hamlin, and all those who serve as role models and examples to all. We pray for those who are injured, both by events on the field and off, and we pray for safety and sensibility as we work to protect athletes across the multitude of sports.", "opengraph": {"title": "We Pray for Damar Hamlin - Sports - News - Catholic Online", "description": "Football player faces a long road to recovery. Players are asked for NFL professional athlete, Damar Hamlin. Hamlin collapsed last week during a football game against the Cincinnati Bengals.   LOS ...", "image": "https://www.catholic.org/files/images/ins_news/2023013623.jpg", "url": "https://www.catholic.org/news/sports/story.php?id=86041", "site_name": "Catholic Online"}, "tags": [], "tweets": [], "movies": [], "links": ["https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=ROS&utm_medium=We%20Humbly_success", "https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=ROS&utm_medium=We%20Humbly_success", "https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=ROS&utm_medium=We%20Humbly_success", "/news/sports/", "/search/?q=Damar+Hamlin", "/search/?q=recovery", "/search/?q=football", "/search/?q=cardiac+arrest"], "authors": ["Marshall Connolly (Catholic Online)"], "publish_date": "2023-01-05T22:00:00Z"}