{"result_id": "060026", "URL": "https://www.catholic.org/news/health/story.php?id=83815", "timestamp": "2023-04-25 14:34:51 CEST+0200", "meta": {"description": "Public mistrust of vaccines to blame for surge in cases. According to the World Health Organization, measles cases have surged by 17 percent worldwide this year. The Organization attributes the ...", "lang": "en", "keywords": "Measles, vaccination, anti-vaccination", "favicon": "/assets/img/apple-touch-icon-144-precomposed.png", "canonical": "https://www.catholic.org/news/health/story.php?id=83815", "encoding": "utf-8"}, "image": null, "domain": "www.catholic.org", "title": "Measles cases surge amid anti-vaccination push - Health & Wellness - News", "cleaned_text": "According to the World Health Organization, measles cases have surged by 17 percent worldwide this year. The Organization attributes the surge to the growing public mistrust of vaccines.\n\nLOS ANGELES, CA (California Network) - The World Health Organization is warning people to get their measles vaccinations as the disease surges. According to the WHO, only 86 percent of children are being vaccinated against the measles, and only 70 percent get the follow-up vaccination. To be most effective, two doses are required.\n\nAt least 95 percent of a population must be vaccinated to provide herd immunity. Herd immunity is a communal resistance to a disease once enough people have become immune. In such a community, an infected person will have difficulty spreading their disease to others, since so many are immune. Without herd immunity, sick individuals are much more likely to spread their illness to others.\n\nThe WHO says there were 353,236 reported measles cases in 2018. But this year, there are already 413,000 reported cases. And the number of reported cases is far below the actual number, which the Organization estimates to be around 9.7 million cases in 2018.\n\nMore than 142,000 people died from measles in 2018. Most of the victims were children under the age of five. Worldwide, measles cases have risen each year since 2017.\n\nMeasles is a highly contagious disease caused by a virus. A person may infect others days before their symptoms appear, which makes the illness particularly dangerous. A person who does not know they are sick and spreading germs cannot isolate themselves to protect others. The disease is among the most contagious known to exist.\n\nThe disease produces a rash on the skin, a high fever, usually around 104F, and a cough. Symptoms last for about one week to ten days. Complications are common and are most severe in adults. Pneumonia is the most common complication. A century ago, the death rate for measles-induced pneumonia was around 30 percent. Swelling of the brain is another significant complication. Presently, for every 1,000 cases, about one or two result in swelling of the brain that also results in permanent brain damage. Fatalities still occur, despite modern medicine.\n\nIn underdeveloped countries, death rates can be as high as 28 percent. For the immune compromised, rates can be as high as 30 percent.\n\nA recent outbreak in Samoa lasting one month so far, has resulted in 4,400 cases, infecting one in every 50 people on the island. There are already 63 reported deaths. Edwin Tamasese, a prominent anti-vaccination activist has been arrested, although it is unclear what law he violated. The government is working to immunize the island's population as quickly as possible. Tamasese has suggested a natural cure for measles which involves doses of vitamins C and A, but it is unclear how this remedy might work against a viral infection, if at all.\n\nDoctors stress that measles is preventable with a vaccination. Vaccinations are remarkably safe and effective, however there have been claims of injury. Vaccine manufacturers have paid claims for some injuries. A small percentage of people report symptoms of various kinds following vaccinations. It is unclear if these cases are all coincidences or a direct result of the vaccination. Given the sheer number of vaccinations administered, it is inevitable some people will become ill immediately afterwords with unrelated illnesses. Such illness may appear related by proximity in time.\n\nThere are several competing issues in the current controversy. The first is the issue of autonomy and human freedom to choose what is put into one's body, and if the state ever has the right to mandate such an intrusion. Then there's the issue of free speech. Why are opponents of mandatory vaccination targets for suppression and even arrest? If vaccines are safe and effective, shouldn't their value be obvious to all and not require coercion?\n\nBoth doctors and historians point out that in our modern age of vaccination, nutrition, and sanitation (which are pillars of modern health), many have forgot how serious diseases can be. Sanitation and nutrition have an impact on public health, but vaccinations are uniquely powerful in suppressing disease. The evidence is straightforward and indisputable, although activists will dispute it anyway.\n\nHistorically, diseases have influenced the course of human events. They have broke sieges, collapsed societies, and most recently, wiped out an estimated 100 million indigenous people in the Americas between 1492 and 1600 AD. Until the advent of modern vaccination, diseases were the leading killer of troops, easily taking more lives than those lost in combat. Between 1918 and 1919, the Spanish Flu pandemic killed more people than four the prior years of all-out global warfare (World War I). Not even machine guns killed as many people as the flu.\n\nPeople in the developing world still walk for hours or even days to vaccinate their children, since they appreciate the impact of infectious diseases on their societies. The Catholic Church provides immunizations around the world through its medical missions.\n\nInfectious diseases deserve respect and appreciation, as should any serious threat to public safety. Unfortunately, we have lost much of that respect thanks to the effectiveness of vaccinations in nearly eradicating many diseases. Now public fear of injury outweighs the memory of the diseases they prevent, so the diseases are returning. In time, the public will recognize the disease is much worse than the dangers and momentary intrusion of prevention. What's unclear is how many people will become sick and suffer lifelong injury or death from preventable diseases before that happens.\n\n'Help Give every Student and Teacher FREE resources for a world-class Moral Catholic Education'", "opengraph": {"title": "Measles cases surge amid anti-vaccination push - Health & Wellness - News - Catholic Online", "description": "Public mistrust of vaccines to blame for surge in cases. According to the World Health Organization, measles cases have surged by 17 percent worldwide this year. The Organization attributes the ...", "image": "https://www.catholic.org/files/images/ins_news/2019121327.jpg", "video": "https://www.youtube.com/watch?v=_9xLb36JkAs", "url": "https://www.catholic.org/news/health/story.php?id=83815", "site_name": "Catholic Online"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.youtube.com/watch?v=_9xLb36JkAs&autoplay=1", "https://holygrind.org/collections/sale", "https://www.catholic.org", "/news/health/", "/search/?q=Measles", "/search/?q=vaccination", "/search/?q=anti-vaccination", "https://prayercandles.org/products/lenten-easter-virtual-prayer-candle", "https://catholicresources.education/collections/most-popular", "https://ycvf.org"], "authors": ["Marshall Connolly (Catholic Online) "], "publish_date": "2019-12-06T12:55:00Z"}