{"result_id": "060016", "URL": "https://www.catholic.org/news/blog/story.php?id=52732", "timestamp": "2023-04-25 14:34:41 CEST+0200", "meta": {"description": "Do vaccines cause Autism? In the United States, the number of unvaccinated children is climbing. LOS ANGELES, CA (Rise Above Health Blog) - Today, all 50 states have vaccine laws that require proof ...", "lang": "en", "keywords": "safe,vaccines, vaccine, vaccination, chlidhood, illness, prevention, disease, community immunity, immune system, myth, laws, school, eldery, children, autism, mumps, measles, medical, doctor, science, formaldehyde, antigen, antibodiy, antibodies, toxins, a", "favicon": "/assets/img/apple-touch-icon-144-precomposed.png", "canonical": "https://www.catholic.org/news/blog/story.php?id=52732", "encoding": "utf-8"}, "image": null, "domain": "www.catholic.org", "title": "The Myths and Truth about Childhood Vaccines - Blog - News", "cleaned_text": "In the United States, the number of unvaccinated children is climbing.\n\nLOS ANGELES, CA (Rise Above Health Blog) - Today, all 50 states have vaccine laws that require proof of vaccination for children to attend daycare, elementary, junior and high school and college.\n\nThe exact vaccine requirements vary from state to state and all 50 states allow a medical exemption to vaccination; 48 states allow a religious exemption to vaccination; and 18 states allow a personal, philosophical or conscientious belief exemption to vaccination.\n\nWith fewer vaccinated children in schools, the impact of \"community immunity\" is breaking down. Community immunity prevents epidemics and outbreaks from taking hold and spreading. Community immunity also protects those that cannot be vaccinated, as well as those that are under vaccinated, including our very young children, the elderly and the immunocompromised.\n\nIn 1998, Andrew Wakefield first suggested that measles, mumps, rubella (MMR) might be linked to autism. In 2010, after years of investigation his paper was retracted and he was struck from the medical register as dishonest, unethical. The British Medical Journal accused him of deliberate fraud. In fact he had an application for a patent on a measles vaccine at that time.\n\nDr. Paul Offit, Chief of the Division of Infectious Diseases at the Children's Hospital of Philadelphia stated \"In a more rational world, this discussion would be un-reopenable. The answerable questions have all been answered. It's not the vaccine, or anything in the vaccine, it's not the number or timing of vaccinations. Scientifically we know that.the best data available shows the genes required for brain development may be a fault. Some researchers think older fathers may increase the risk, or the broader definitions and increased awareness of autism has contributed to higher numbers. Regardless, autism in itself requires more research, not the vaccines.\n\n2. The unvaccinated child should be of no concern to vaccinated children.\n\nThis is the key element in the break down of \"community immunity\" and its ramifications.\n\nWild claims abound of multiple toxins in vaccines from anti-freeze to aborted fetus cells. It boggles the mind with these absurd accusations. Vaccines in fact do have poison in the dose in miniscule amounts. These are the antigens our bodies need to develop antibodies to disease. An antigen is a substance that, when injected or absorbed into our bodies, stimulates the production of antibodies. Antibodies are used by our immune system to fight disease and illness.\n\nAs to the claim that there is formaldehyde in vaccines, yes, there are, in teeny-tiny amounts. But one pear has 600 times the amount of formaldehyde the complete childhood vaccination series has.\n\n\n\n4. Multiple vaccines overwhelm children's immune system.\n\nThe Institute of Medicine, did a detailed analysis of the US childhood immunization schedule, and looked for evidence that multiple vaccines were linked to autism, asthma, autoimmune diseases, seizures, ADD, ADHD and delayed childhood development. The conclusion was that childhood vaccinations are safe.\n\nOur children are exposed to antigens in our environment every day that challenge their immune systems.\n\nThe Centers for Disease Control and Prevention (CDC) web site states that multiple vaccines are safe. \"No evidence suggests that the recommended childhood vaccines can 'overload' the immune system. From the moment babies are born, they are exposed to numerous bacteria and viruses on a daily bases. Eating food introduces new bacteria into the body; numerous bacteria live in the mouth and nose, and an infant places his or her hands and other objects in his or her mouth hundreds of times every hour, exposing the immune system to still more antigens. When a child has a cold they are exposed to at least 4 to 10 antigens and exposure to 'strep throat' is about 25 to 50 antigens.it seems unlikely that the number of separate antigens contained in childhood vaccines would represent an appreciable added burden on the immune system.\"\n\nI understand why parents want to protect their children regardless of which side of the vaccine fence they are on.\n\nThis is just one nurses evidence based view, Childhood vaccinations are necessary.\n\nI hope this helps shine some light on childhood vaccinations, and helps parents make an informed decision based on fact not myth.\n\nClick here to read the follow up to this blog.\n\nMy tip for the day; Laugh, and laugh out loud, it improves blood flow, boosts the immune system, lowers blood sugar, improves sleeping habits and much more.\n\nUntil next time, I believe that Faith can move mountains.\n\n\n\nA birth foretold: click here to learn more!\n\n'Help Give every Student and Teacher FREE resources for a world-class Moral Catholic Education'", "opengraph": {"title": "The Myths and Truth about Childhood Vaccines - Blog - News - Catholic Online", "description": "Do vaccines cause Autism? In the United States, the number of unvaccinated children is climbing. LOS ANGELES, CA (Rise Above Health Blog) - Today, all 50 states have vaccine laws that require proof ...", "image": "https://www.catholic.org/files/images/ins_news/2013100250vaccine300.jpg", "url": "https://www.catholic.org/news/blog/story.php?id=52732", "site_name": "Catholic Online"}, "tags": [], "tweets": [], "movies": [], "links": ["https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=Top%20Ad&utm_medium=We%20Humbly_blackRed", "https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=Top%20Ad&utm_medium=We%20Humbly_blackRed", "/search/?q=Wendy+RN.%2C+BA", "https://www.catholic.org", "/news/blog/", "/search/?q=safe", "/search/?q=vaccines", "/search/?q=vaccine", "/search/?q=vaccination", "/search/?q=chlidhood", "/search/?q=illness", "/search/?q=prevention", "/search/?q=disease", "/search/?q=community+immunity", "/search/?q=immune+system", "/search/?q=myth", "/search/?q=laws", "/search/?q=school", "/search/?q=eldery", "/search/?q=children", "/search/?q=autism", "/search/?q=mumps", "/search/?q=measles", "/search/?q=medical", "/search/?q=doctor", "/search/?q=science", "/search/?q=formaldehyde", "/search/?q=antigen", "/search/?q=antibodiy", "/search/?q=antibodies", "/search/?q=toxins", "/search/?q=a", "https://ycvf.org/products/saved-by-hope", "https://www.catholic.org/news/blog/story.php?id=52741", "https://www.catholic.org/clife/advent/", "https://ycvf.org"], "authors": ["Wendy RN., BA"], "publish_date": "2013-10-12T10:02:00Z"}