{"result_id": "060003", "URL": "https://www.catholic.org/featured/headline.php?ID=2410", "timestamp": "2023-04-25 14:34:29 CEST+0200", "meta": {"description": "'It is a Grave Responsibility to Use Alternative Vaccines' VATICAN CITY, JULY ...", "lang": "en", "keywords": "", "favicon": "/assets/img/apple-touch-icon-144-precomposed.png", "canonical": "https://www.catholic.org/featured/headline.php?ID=2410", "encoding": "utf-8"}, "image": null, "domain": "www.catholic.org", "title": "On Vaccines Made From Cells of Aborted Fetuses - Featured Today", "cleaned_text": "\"It is a Grave Responsibility to Use Alternative Vaccines\"\n\nVATICAN CITY, JULY 27, 2005 (Zenit) - Here is a letter sent by Bishop Elio Sgreccia, president of the Pontifical Academy for Life, to Mrs. Debra Vinnedge, executive director, Children of God for Life.\n\nThe letter presents the following study conducted by the academy entitled \"Moral Reflections on Vaccines Prepared from Cells Derived from Aborted Human Fetuses.\"\n\nOn June 4, 2003, you wrote to His Eminence Cardinal Joseph Ratzinger, with a copy of this letter forwarded to me, asking to the Sacred Congregation of the Doctrine of Faith a clarification about the liceity of vaccinating children with vaccines prepared using cell lines derived from aborted human fetuses. Your question regarded in particular the right of the parents of these children to oppose such a vaccination when made at school, mandated by law.\n\nAs there were no formal guidelines by the magisterium concerning that topic, you said that catholic parents were often challenged by state courts, health officials and school administrators when they filed religious exemptions for their children to this type of vaccination\n\nThis Pontifical Academy for Life, carrying out the commission entrusted to us by the Congregation for the Doctrine of Faith, in answer to your request, has proceeded to a careful examination of the question of these \"tainted\" vaccines, and has produced as a result a study -- in Italian -- that has been realized with the help of a group of experts.\n\nThis study has been approved as such by the congregation and we send you, here enclosed, an English translation of a synthesis of this study. This synthesis can be brought to the knowledge of the interested officials and organisms.\n\nA documented paper on the topic will be published in the journal \"Medicina e Morale,\" edited by the Center of Bioethics of the Catholic University in Rome.\n\nThe study, its synthesis, and the translation of this material took some time. We apologize for the delay.\n\nWith my best regards,\n\n* * * \n\nMoral Reflections on Vaccines Prepared From Stem Cells Derived From Aborted Human Fetuses\n\nThe matter in question regards the lawfulness of production, distribution and use of certain vaccines whose production is connected with acts of procured abortion. It concerns vaccines containing live viruses which have been prepared from human cell lines of fetal origin, using tissues from aborted human fetuses as a source of such cells.\n\nThe best known, and perhaps the most important due to its vast distribution and its use on an almost universal level, is the vaccine against Rubella -- German measles.\n\nRubella -- German measles -- [1] is a viral illness caused by a Togavirus of the genus Rubivirus and is characterized by a maculopapular rash. It consists of an infection which is common in infancy and has no clinical manifestations in one case out of two, is self-limiting and usually benign. Nonetheless, the German measles virus is one of the most pathological infective agents for the embryo and fetus.\n\nWhen a woman catches the infection during pregnancy, especially during the first trimester, the risk of fetal infection is very high -- approximately 95%. The virus replicates itself in the placenta and infects the fetus, causing the constellation of abnormalities denoted by the name of Congenital Rubella Syndrome. For example, the severe epidemic of German measles which affected a huge part of the United States in 1964 thus caused 20,000 cases of congenital rubella [2], resulting in 11,250 abortions -- spontaneous or surgical -- 2,100 neonatal deaths, 11,600 cases of deafness, 3,580 cases of blindness, 1,800 cases of mental retardation. It was this epidemic that pushed for the development and introduction on the market of an effective vaccine against rubella, thus permitting an effective prophylaxis against this infection.\n\nThe severity of congenital rubella and the handicaps which it causes justify systematic vaccination against such a sickness. It is very difficult, perhaps even impossible, to avoid the infection of a pregnant woman, even if the rubella infection of a person in contact with this woman is diagnosed from the first day of the eruption of the rash. Therefore, one tries to prevent transmission by suppressing the reservoir of infection among children who have not been vaccinated, by means of early immunization of all children -- universal vaccination.\n\nUniversal vaccination has resulted in a considerable fall in the incidence of congenital rubella, with a general incidence reduced to less than 5 cases per 100,000 live births. Nevertheless, this progress remains fragile.\n\nIn the United States, for example, after an overwhelming reduction in the number of cases of congenital rubella to only a few cases annually, i.e. less than 0.1 per 100,000 live births, a new epidemic wave came on in 1991, with an incidence that rose to 0.8/100,000. Such waves of resurgence of German measles were also seen in 1997 and in the year 2000.\n\nThese periodic episodes of resurgence make it evident that there is a persistent circulation of the virus among young adults, which is the consequence of insufficient vaccination coverage. The latter situation allows a significant proportion of vulnerable subjects to persist, who are a source of periodic epidemics which put women in the fertile age group who have not been immunized at risk.\n\nTherefore, the reduction to the point of eliminating congenital rubella is considered a priority in public health care.\n\nTo date, there are two human diploid cell lines which were originally prepared from tissues of aborted fetuses -- in 1964 and 1970 -- and are used for the preparation of vaccines based on live attenuated virus.\n\nThe first one is the WI-38 line (Winstar Institute 38), with human diploid lung fibroblasts, coming from a female fetus that was aborted because the family felt they had too many children. It was prepared and developed by Leonard Hayflick in 1964 [3] and bears the ATCC number CCL-75. WI-38 has been used for the preparation of the historical vaccine RA 27/3 against rubella [4].\n\nThe second human cell line is MRC-5 (Medical Research Council 5) -- human, lung, embryonic -- (ATCC number CCL-171), with human lung fibroblasts coming from a 14 week male fetus aborted for \"psychiatric reasons\" from a 27 year old woman in the UK. MRC-5 was prepared and developed by J.P. Jacobs in 1966 [5]. Other human cell lines have been developed for pharmaceutical needs, but are not involved in the vaccines actually available [6].\n\nThe vaccines that are incriminated today as using human cell lines from aborted fetuses, WI-38 and MRC-5, are the following: [7]\n\n-- Combined vaccine MR against rubella and measles, commercialized with the name of M-R-VAX® (Merck, United States) and Rudi-Rouvax® (AVP, France)\n\n-- Combined vaccine against rubella and mumps marketed under the name of Biavax® (Merck, United States)\n\n-- Combined vaccine MMR -- measles, mumps, rubella -- marketed under the name of M-M-R® II (Merck, United States), R.O.R.®, Trimovax® (Sanofi Pasteur, France), and Priorix® (GlaxoSmithKline, Belgium)\n\nB) Other vaccines, also prepared using human cell lines from aborted fetuses\n\n-- Two vaccines against hepatitis A, one produced by Merck (VAQTA), the other one produced by GlaxoSmithKline (HAVRIX), both of them being prepared using MRC-5\n\n-- One vaccine against chicken pox, Varivax®, produced by Merck using WI-38 and MRC-5\n\n-- One vaccine against poliomyelitis, the inactivated polio virus vaccine Poliovax® (Aventis-Pasteur, France) using MRC-5\n\n-- One vaccine against rabies, Imovax®, produced by Aventis Pasteur, harvested from infected human diploid cells, MRC-5 strain\n\n-- One vaccine against smallpox, AC AM 1000, prepared by Acambis using MRC-5, still on trial.\n\nThe position of the ethical problem related to these vaccines\n\nFrom the point of view of prevention of viral diseases such as German measles, mumps, measles, chicken pox and hepatitis A, it is clear that the making of effective vaccines against diseases such as these, as well as their use in the fight against these infections, up to the point of eradication, by means of an obligatory vaccination of all the population at risk, undoubtedly represents a \"milestone\" in the secular fight of man against infective and contagious diseases.\n\nHowever, as the same vaccines are prepared from viruses taken from the tissues of fetuses that had been infected and voluntarily aborted, and the viruses were subsequently attenuated and cultivated from human cell lines which come likewise from procured abortions, they do not cease to pose ethical problems.\n\nThe need to articulate a moral reflection on the matter in question arises mainly from the connection which exists between the vaccines mentioned above and the procured abortions from which biological material necessary for their preparation was obtained.\n\nIf someone rejects every form of voluntary abortion of human fetuses, would such a person not contradict himself by allowing the use of these vaccines of live attenuated viruses on their children?\n\nWould it not be a matter of true -- and illicit -- cooperation in evil, even though this evil was carried out forty years ago?\n\nBefore proceeding to consider this specific case, we need to recall briefly the principles assumed in classical moral doctrine with regard to the problem of cooperation in evil [9], a problem which arises every time that a moral agent perceives the existence of a link between his own acts and a morally evil action carried out by others.\n\nThe principle of licit cooperation in evil\n\nThe first fundamental distinction to be made is that between formal and material cooperation. Formal cooperation is carried out when the moral agent cooperates with the immoral action of another person, sharing in the latter's evil intention. On the other hand, when a moral agent cooperates with the immoral action of another person, without sharing in the intention, it is a case of material cooperation.\n\nMaterial cooperation can be further divided into categories of immediate -- direct -- and mediate -- indirect -- depending on whether the cooperation is in the execution of the sinful action per se, or whether the agent acts by fulfilling the conditions -- either by providing instruments or products -- which make it possible to commit the immoral act.\n\nFurthermore, forms of proximate cooperation and remote cooperation can be distinguished, in relation to the \"distance\" -- be it in terms of temporal space or material connection -- between the act of cooperation and the sinful act committed by someone else. Immediate material cooperation is always proximate, while mediate material cooperation can be either proximate or remote.\n\nFormal cooperation is always morally illicit because it represents a form of direct and intentional participation in the sinful action of another person [10]. Material cooperation can sometimes be illicit -- depending on the conditions of the \"double effect\" or \"indirect voluntary\" action -- but when immediate material cooperation concerns grave attacks on human life, it is always to be considered illicit, given the precious nature of the value in question [11].\n\nA further distinction made in classical morality is that between active -- or positive -- cooperation in evil and passive -- or negative -- cooperation in evil, the former referring to the performance of an act of cooperation in a sinful action that is carried out by another person, while the latter refers to the omission of an act of denunciation or impediment of a sinful action carried out by another person, insomuch as there was a moral duty to do that which was omitted [12].\n\nPassive cooperation can also be formal or material, immediate or mediate, proximate or remote. Obviously, every type of formal passive cooperation is to be considered illicit, but even passive material cooperation should generally be avoided, although it is admitted, by many authors, that there is not a rigorous obligation to avoid it in a case in which it would be greatly difficult to do so.\n\nApplication to vaccines prepared from cells of aborted fetuses\n\nIn the specific case under examination, there are three categories of people who are involved in the cooperation in evil, evil which is obviously represented by the action of a voluntary abortion performed by others: a) those who prepare the vaccines using human cell lines coming from voluntary abortions; b) those who participate in the mass marketing of such vaccines; c) those who need to use them for health reasons.\n\nFirstly, one must consider morally illicit every form of formal cooperation -- sharing the evil intention -- in the action of those who have performed a voluntary abortion, which in turn has allowed the retrieval of fetal tissues, required for the preparation of vaccines. Therefore, whoever -- regardless of the category to which he belongs -- cooperates in some way, sharing its intention, to the performance of a voluntary abortion with the aim of producing the above-mentioned vaccines, participates, in actuality, in the same moral evil as the person who has performed that abortion.\n\nSuch participation would also take place in the case where someone, sharing the intention of the abortion, refrains from denouncing or criticizing this illicit action, although having the moral duty to do so -- passive formal cooperation.\n\nIn a case where there is no such formal sharing of the immoral intention of the person who has performed the abortion, any form of cooperation would be material, with the following specifications.\n\nAs regards the preparation, distribution and marketing of vaccines produced as a result of the use of biological material whose origin is connected with cells coming from fetuses voluntarily aborted, such a process is stated, as a matter of principle, morally illicit, because it could contribute in encouraging the performance of other voluntary abortions, with the purpose of the production of such vaccines.\n\nNevertheless, it should be recognized that, within the chain of production-distribution-marketing, the various cooperating agents can have different moral responsibilities.\n\nHowever, there is another aspect to be considered, and that is the form of passive material cooperation which would be carried out by the producers of these vaccines, if they do not denounce and reject publicly the original immoral act -- the voluntary abortion -- and if they do not dedicate themselves together to research and promote alternative ways, exempt from moral evil, for the production of vaccines for the same infections. Such passive material cooperation, if it should occur, is equally illicit.\n\nAs regards those who need to use such vaccines for reasons of health, it must be emphasized that, apart from every form of formal cooperation, in general, doctors or parents who resort to the use of these vaccines for their children, in spite of knowing their origin -- voluntary abortion -- carry out a form of very remote mediate material cooperation, and thus very mild, in the performance of the original act of abortion, and a mediate material cooperation, with regard to the marketing of cells coming from abortions, and immediate, with regard to the marketing of vaccines produced with such cells.\n\nThe cooperation is therefore more intense on the part of the authorities and national health systems that accept the use of the vaccines.\n\nHowever, in this situation, the aspect of passive cooperation is that which stands out most. It is up to the faithful and citizens of upright conscience -- parents, doctors, etc. -- to oppose, even by making an objection of conscience, the ever more widespread attacks against life and the \"culture of death\" which underlies them.\n\nFrom this point of view, the use of vaccines whose production is connected with procured abortion constitutes at least a mediate remote passive material cooperation to the abortion, and an immediate passive material cooperation with regard to their marketing. Furthermore, on a cultural level, the use of such vaccines contributes in the creation of a generalized social consensus to the operation of the pharmaceutical industries which produce them in an immoral way.\n\nTherefore, doctors and parents have a duty to take recourse to alternative vaccines [13] -- if they exist -- putting pressure on the political authorities and health systems so that other vaccines without moral problems become available. They should take recourse, if necessary, to the use of conscientious objection [14] with regard to the use of vaccines produced by means of cell lines of aborted human fetal origin.\n\nEqually, they should oppose by all means -- in writing, through the various associations, mass media, etc. -- the vaccines which do not yet have morally acceptable alternatives, creating pressure so that alternative vaccines are prepared, which are not connected with the abortion of a human fetus, and requesting rigorous legal control of the pharmaceutical industry producers.\n\nAs regards the diseases against which there are no alternative vaccines which are available and ethically acceptable, it is right to abstain from using these vaccines if it can be done without causing children, and indirectly the population as a whole, to undergo significant risks to their health.\n\nHowever, if the latter are exposed to considerable dangers to their health, vaccines with moral problems pertaining to them may also be used on a temporary basis.\n\nThe moral reason is that the duty to avoid passive material cooperation is not obligatory if there is grave inconvenience. Moreover, we find, in such a case, a proportional reason, in order to accept the use of these vaccines in the presence of the danger of favoring the spread of the pathological agent, due to the lack of vaccination of children. This is particularly true in the case of vaccination against German measles [15].\n\nIn any case, there remains a moral duty to continue to fight and to employ every lawful means in order to make life difficult for the pharmaceutical industries which act unscrupulously and unethically.\n\nHowever, the burden of this important battle cannot and must not fall on innocent children and on the health situation of the population -- especially with regard to pregnant women.\n\nTo summarize, it must be confirmed that there is a grave responsibility to use alternative vaccines and to make a conscientious objection with regard to those which have moral problems.\n\nAs regards the vaccines without an alternative, the need to contest so that others may be prepared must be reaffirmed, as should be the lawfulness of using the former in the meantime insomuch as is necessary in order to avoid a serious risk not only for one's own children but also, and perhaps more specifically, for the health conditions of the population as a whole -- especially for pregnant women\n\nThe lawfulness of the use of these vaccines should not be misinterpreted as a declaration of the lawfulness of their production, marketing and use, but is to be understood as being a passive material cooperation and, in its mildest and remotest sense, also active, morally justified as an \"extrema ratio\" due to the necessity to provide for the good of one's children and of the people who come in contact with the children -- pregnant women.\n\nSuch cooperation occurs in a context of moral coercion of the conscience of parents, who are forced to choose to act against their conscience or otherwise, to put the health of their children and of the population as a whole at risk. This is an unjust alternative choice, which must be eliminated as soon as possible.\n\n[2] S.A. Plotkin. \"Virologic Assistance in the Management of German Measles in Pregnancy,\" JAMA, Oct. 26, 1964, vol.190, pp. 265-268.\n\n[3] L. Hayflick. \"The Limited In-Vitro Lifetime of Human Diploid Cell Strains,\" Experimental Cell Research, March 1965, vol.37, no. 3, pp. 614-636.\n\nG. Sven, S. Plotkin, K. McCarthy. \"Gamma Globulin Prophylaxis; Inactivated \n\nRubella Virus; Production and Biological Control of Live Attenuated Rubella Virus Vaccines,\" American journal of Diseases of Children, August 1969, vol. 118, no. 2, pp. 372-381.\n\n[4] S. A. Plotkin, D. Cornfeld, Th.H. Ingalls. \"Studies of Immunization With Living Rubella Virus, Trials in Children With a Strain Coming From an Aborted Fetus,\" American Journal of Diseases in children, October 1965, vol. 110, no. 4, pp. 381-389.\n\n[6] Two other human cell lines, that are permanent, HEK 293 aborted fetal cell line, from primary human embryonic kidney cells transformed by sheared adenovirus type 5. The fetal kidney material was obtained from an aborted fetus, in 1972 probably, and PER.C6, a fetal cell line created using retinal tissue from an 18 week gestation aborted baby, have been developed for the pharmaceutical manufacturing of adenovirus vectors --for gene therapy.\n\nThey have not been involved in the making of any of the attenuated live virus vaccines presently in use because of their capacity to develop tumorigenic cells in the recipient. However some vaccines, still at the developmental stage, against Ebola virus (Crucell N.V. and the Vaccine Research Center of the National Institutes of Health's Allergy and Infectious Diseases, NIAID), HIV (Merck), influenza (Medlmmune, Sanofi pasteur), Japanese encephalitis (Crucell N.V. and Rhein Biotech N.V.) are prepared using PER.C6® cell line (Crucell N.V., Leiden, The Netherlands).\n\n[7] Against these various infectious diseases, there are some alternative vaccines that are prepared using animals' cells or tissues, and are therefore ethically acceptable. Their availability depends on the country in question.\n\nConcerning the particular case of the United States, there are no options for the time being in that country for the vaccination against rubella, chickenpox and hepatitis A, other than the vaccines proposed by Merck, prepared using the human cell lines WI-38 and MRC-5.\n\nThere is a vaccine against smallpox prepared with the Vero cell line -- derived from the kidney of an African green monkey -- ACAM2000 (Acambis-Baxter), a second-generation smallpox vaccine, stockpiled, not approved in the US, which offers, therefore, an alternative to the Acambis 1000.\n\nThere are alternative vaccines against mumps (Mumpsvax, Merck, measles (Attenuvax, Merck), rabies (RabAvert, Chiron therapeutics) -- prepared from chicken embryos, however serious allergies have occurred with such vaccines -- poliomyelitis (IPOL, Aventis-Pasteur, prepared with monkey kidney cells) and smallpox (a third-generation smallpox vaccine MVA, Modified Vaccinia Ankara, \n\nAcambis-Baxter).\n\nIn Europe and in Japan, there are other vaccines available against rubella and hepatitis A, produced using non-human cell lines. The Kitasato Institute produce four vaccines against rubella, called Takahashi, TO-336 and Matuba, prepared with cells from rabbit kidney, and one (Matuura) prepared with cells from a quail embryo.\n\nThe Chemo-sero-therapeutic Research Institute Kaketsuken produce one another vaccine against hepatitis A, called Ainmugen, prepared with cells from monkey kidney. The only remaining problem is with the vaccine Varivax® against chicken pox, for which there is no alternative.\n\n[8] The vaccine against rubella using the strain Wistar RA27/3 of live attenuated rubella virus, adapted and propagated in WI-38 human diploid lung fibroblasts is at the center of the present controversy regarding the morality of the use of vaccines prepared with the help of human cell lines coming from aborted fetuses.\n\nK.H. Peschke. \"Cooperation in the sins of others,\" Christian Ethics: Moral Theology in the Light of Vatican II, vol.1, General Moral Theology, C. Goodliffe Neale Ltd., Arden Forest Industrial Estate, Alcester, Warwickshire, B49 6Er, revised edition, 1986, pp. 320-324.\n\nE. Sgreccia, \"Manuale di Bioetica,\" vol. I, Reprint of the third edition, Vita e Pensiero, Milan, 1999, pp. 362-363.\n\n[13] The alternative vaccines in question are those that are prepared by means of cell lines which are not of human origin, for example, the Vero cell line -- from monkeys -- the kidney cells of rabbits or monkeys, or the cells of chicken embryos.\n\nHowever, it should be noted that grave forms of allergy have occurred with some of the vaccines prepared in this way. The use of recombinant DNA technology could lead to the development of new vaccines in the near future which will no longer require the use of cultures of human diploid cells for the attenuation of the virus and its growth, for such vaccines will not be prepared from a basis of attenuated virus, but from the genome of the virus and from the antigens thus developed.\n\nSome experimental studies have already been done using vaccines developed from DNA that has been derived from the genome of the German measles virus.\n\nMoreover, some Asiatic researchers are trying to use the Varicella virus as a vector for the insertion of genes which codify the viral antigens of Rubella.\n\nThese studies are still at a preliminary phase and the refinement of vaccine preparations which can be used in clinical practice will require a lengthy period of time and will be at high costs.\n\nD. Vinnedge. \"The Smallpox Vaccine,\" The National Catholic Bioethics Quarterly, Spring, 2000, vol.2, no. 1, p. 12.\n\nG.C. Woodrow. \"An Overview of Biotechnology as Applied to Vaccine Development,\" in New Generation Vaccines, G.C. Woodrow, M.M. Levine eds., Marcel Dekker Inc., New York and Basel, 1990, see pp. 32-37.\n\n[14] Such a duty may lead, as a consequence, to taking recourse to \"objection of conscience\" when the action recognized as illicit is an act permitted or even encouraged by the laws of the country and poses a threat to human life. The encyclical \"Evangelium Vitae\" underlined this \"obligation to oppose\" the laws which permit abortion or euthanasia \"by conscientious objection\" (no. 73)\n\n[15] This is particularly true in the case of vaccination against German measles, because of the danger of congenital rubella syndrome. This could occur, causing grave congenital malformations in the fetus, when a pregnant woman enters into contact, even if it is brief, with children who have not been immunized and are carriers of the virus. In this case, the parents who did not accept the vaccination of their own children become responsible for the malformations in question, and for the subsequent abortion of fetuses, when they have been discovered to be malformed.", "opengraph": {"title": "On Vaccines Made From Cells of Aborted Fetuses - Featured Today - Catholic Online", "description": "'It is a Grave Responsibility to Use Alternative Vaccines' VATICAN CITY, JULY ...", "url": "https://www.catholic.org/featured/headline.php?ID=2410", "site_name": "Catholic Online"}, "tags": [], "tweets": [], "movies": [], "links": ["https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=Top%20Ad&utm_medium=We%20Humbly_orangeBlue", "https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=Top%20Ad&utm_medium=We%20Humbly_orangeBlue", "https://www.catholiconline.school/", "https://prayercandles.org/products/lenten-easter-virtual-prayer-candle", "https://catholiconline.shopping/products/st-benedict-home-blessing?utm_campaign=Catholic%20Online%20Ads&utm_source=ROS&utm_medium=DoorHang", "https://catholiconline.shopping/collections/prayer-cards?utm_campaign=Catholic%20Online%20Ads&utm_source=ROS&utm_medium=PrayerCards", "https://catholicresources.education/collections/most-popular", "https://www.catholiconline.school/collections/archangels?utm_campaign=Catholic%20Online%20Ads&utm_source=Course%20Layout%201&utm_medium=angel", "https://www.catholiconline.school/collections/archangels?utm_campaign=Catholic%20Online%20Ads&utm_source=Course%20Layout%201&utm_medium=angel", "https://www.catholiconline.school/bundles/explore-the-bible-collection?utm_campaign=Catholic%20Online%20Ads&utm_source=Course%20Layout%201&utm_medium=Bible", "https://www.catholiconline.school/bundles/explore-the-bible-collection?utm_campaign=Catholic%20Online%20Ads&utm_source=Course%20Layout%201&utm_medium=Bible", "https://www.catholiconline.school/courses/stations-of-the-cross?utm_campaign=Catholic%20Online%20Ads&utm_source=Course%20Layout%201&utm_medium=Certificate", "https://www.catholiconline.school/courses/stations-of-the-cross?utm_campaign=Catholic%20Online%20Ads&utm_source=Course%20Layout%201&utm_medium=Certificate", "https://www.catholiconline.school/collections/saint-mary-magdalene?utm_campaign=Catholic%20Online%20Ads&utm_source=Course%20Layout%201&utm_medium=Mary", "https://www.catholiconline.school/collections/saint-mary-magdalene?utm_campaign=Catholic%20Online%20Ads&utm_source=Course%20Layout%201&utm_medium=Mary", "https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=ROS&utm_medium=We%20Humbly_success", "https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=ROS&utm_medium=We%20Humbly_success", "https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=ROS&utm_medium=We%20Humbly_success", "https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=Top%20Ad&utm_medium=We%20Humbly_blackRed", "https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=Top%20Ad&utm_medium=We%20Humbly_blackRed", "https://montanaranchandcattle.com/discount/SPRING50?redirect=%2Fcollections%2F50-off-spring-sale", "https://www.catholic.org"], "authors": ["Catholic Online"], "publish_date": null}