{"result_id": "060019", "URL": "https://www.catholic.org/news/health/story.php?id=73059", "timestamp": "2023-04-25 14:34:45 CEST+0200", "meta": {"description": "When can we expect a universal influenza vaccine? Science has elongated the human lifespan by decades through the invention of vaccines, medication and treatment options for the ill - but there is ...", "lang": "en", "keywords": "Flu, vaccine, influenza, universal", "favicon": "/assets/img/apple-touch-icon-144-precomposed.png", "canonical": "https://www.catholic.org/news/health/story.php?id=73059", "encoding": "utf-8"}, "image": null, "domain": "www.catholic.org", "title": "The end of all flu shots? Universal influenza vaccine just around the corner - Health & Wellness - News", "cleaned_text": "Science has elongated the human lifespan by decades through the invention of vaccines, medication and treatment options for the ill - but there is one cure that has eluded scientists for centuries: the cure to the common cold.\n\nLOS ANGELES, CA (Catholic Online) - When you catch a cold, all you can do is wait it out, drink some soup and get your rest but scientists believe the cure can come in the form of a universal influenza vaccine well within the next few decades.\n\nAccording to the CDC, even if a vaccine was created today, it would take approximately six months to create the over 150 million injection doses required to help the American population.\n\nIt would take over a year to create enough batches of vaccine to help the people of the world.\n\nColds are a pain but aren't that bad so why are scientists searching for a cure?\n\nInfluenza, or the seasonal flu, is responsible for up to 50 million deaths in the last century. When H1N1 appeared in 2009, there were 18,000 confirmed deaths - so a vaccine or cure would be really helpful in dealing with the illness.\n\nEach year epidemiologists research the common cold and flu trends and coordinate with several health centers around the world to target specific flu strains to be used in the annual flu vaccine.\n\nUnfortunately, sometimes new strains, such as H1N1, appear and render the vaccines useless, so scientists have been working on a universal influenza vaccine to protect everyone from every strand.\n\nWhat makes this difficult is each virus' constant mutations. For vaccine developers, the mutations change so rapidly that creating the perfect vaccine is nearly impossible - using the old methods.\n\nBy using a technique called rational design, researchers can, theoretically, design a \"immunogen\" that creates effective antibodies without the immune system being exposed to the dead virus, which is how vaccines are used today.\n\nInfluenza-neutralizing antibodies are present in our bodies but by the time we start feeling symptoms it is too late. Researchers have already made good headway in their experiments and have discovered several possible approaches.\n\nAnimal trials have delivered promising results but with our current technology and lack of more data, it would appear a universal vaccine remains years away.\n\nIan Setliff and Amyn Murji, Vanderbilt Vaccine Center students, believe it is possible for the creation of a universal cure within \"a few years,\" given more data, trials and emerging technology.\n\nThe California Network is the Next Wave in delivery of information and entertainment on pop culture, social trends, lifestyle, entertainment, news, politics and economics. We are hyper-focused on one audience, YOU, the connected generation. JOIN US AS WE REDEFINE AND REVOLUTIONIZE THE EVER-CHANGING MEDIA LANDSCAPE.", "opengraph": {"title": "The end of all flu shots? Universal influenza vaccine just around the corner - Health & Wellness - News - Catholic Online", "description": "When can we expect a universal influenza vaccine? Science has elongated the human lifespan by decades through the invention of vaccines, medication and treatment options for the ill - but there is ...", "image": "https://www.catholic.org/files/images/ins_news/2017012230is_the_influenza_vaccine_imminent.jpg", "url": "https://www.catholic.org/news/health/story.php?id=73059", "site_name": "Catholic Online"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.catholiconline.school/", "/search/?q=Kenya+Sinclair+%28CALIFORNIA+NETWORK%29", "https://www.youtube.com/c/californianetwork", "/news/health/", "/search/?q=Flu", "/search/?q=vaccine", "/search/?q=influenza", "/search/?q=universal", "https://www.cdc.gov/flu/about/season/vaccine-selection.htm", "https://prayercandles.org/", "http://catholicshopping.com/collections/crosses-crucifixes"], "authors": ["Kenya Sinclair (CALIFORNIA NETWORK)"], "publish_date": "2017-01-16T12:22:00Z"}