{"result_id": "060037", "URL": "https://www.catholic.org/news/politics/story.php?id=85655", "timestamp": "2023-04-25 14:34:58 CEST+0200", "meta": {"description": "Justices block Biden mandate, allow private businesses to make their own rules. The Supreme Court blocked President Biden's sweeping vaccine mandate on Thursday, stopping the administration from ...", "lang": "en", "keywords": "COVID, vaccine, mandate, Biden", "favicon": "/assets/img/apple-touch-icon-144-precomposed.png", "canonical": "https://www.catholic.org/news/politics/story.php?id=85655", "encoding": "utf-8"}, "image": null, "domain": "www.catholic.org", "title": "Supreme Court strikes down vaccine mandate - Politics & Policy - News", "cleaned_text": "The Supreme Court blocked President Biden's sweeping vaccine mandate on Thursday, stopping the administration from forcing the rule on private companies. The mandate will remain for some medical facilities.\n\nLOS ANGELES, CA (California Network) - The idea of a vaccine mandate is difficult for many Americans. On the one hand, the government is entrusted with the public welfare, which includes managing outbreaks of disease. George Washington himself issued one of the first vaccine mandates, requiring soldiers in his army to be vaccinated against small pox as early as 1777. At the same time, we consider bodily autonomy to be almost sacrosanct. So much so we forbid the taking of donor organs unless the deceased has given explicit permission, and we allow the evil of abortion. What a person puts into their body (or keeps) is subject to their choice, even when it comes to human life itself.\n\nWhen COVID vaccines became available a year ago, leaders argued that the public should be vaccinated in order to allow businesses to safely reopen and ease the burden on public health infrastructure. However, many people in the public proved hesitant to accept a vaccine that was approved on an emergency basis. Typically, vaccines go through years of testing and development to ensure their safety.\n\nSo what gives? The Biden administration issued a mandate that clearly demonstrated their position on the issue. Workers in all businesses that employ more than 100 people were to either show proof of vaccination, or submit to weekly testing before entering the workplace. This caused a lot of concern for teachers and other people who were reluctant to inject themselves with the vaccine, but could not afford the hassle and expense of weekly testing.\n\nThe mandate also required the unvaccinated to wear masks at work, effectively singling them out from their peers.\n\nHealth officials might praise these regulations, however there is the question of whether or not the federal government has the right to issue such rules, especially to private businesses. The mandate was to be enforced by the Occupational Safety and Health Administration (OSHA).\n\nThe question matters because without a check on government mandates such as these, the rules could quickly become controlling in such a way as to empower government more than it ought to be. There are limits to what the government can do, even in the interest of the public good, because that excuse can also be used to justify tyranny and all kinds of evil.\n\nToday, the Supreme Court ruled that this was one such mandate. The mandate for vaccines or testing is now unenforceable for private businesses. It remains in place only for healthcare workers in places that accept Medicare and Medicaid. With government money comes government control.\n\nThe decision is a victory for private industry, which stood to lose many employees to the mandates, especially in a time of high unemployment and a lack or workers willing to work.\n\nThe court ruled: \"Although Congress has indisputably given OSHA the power to regulate occupational dangers, it has not given that agency the power to regulate public health more broadly. Requiring the vaccination of 84 million Americans, selected simple because they work for employers with more than 100 employees, certainly falls in the later category.\"\n\nAs a private citizen, the choice to be vaccinated is your own. For many it is a moral issue, for others, it is a matter of personal health. For all of us, it is a matter of freedom. It is of course, also an ethical issue, since the unvaccinated are more likely to contract and spread COVID and suffer complications. Nonetheless, it is a personal decision, and one that we alone have the right to make. We can pray that people make the choices that reflect their desire to be charitable to their neighbors, but we cannot compel such virtue, or else it is coercion, not virtue.\n\nIn the great scheme of things, while we want to uphold public safety, we must remember that safety is more compromised by government overreach than even by pandemic disease. In the history of humanity, it is tyranny, not germs that pose the greater threat to all.\n\nIn any case, people are urged to make a wise decision, based on science and ethics, but it must be their own, it cannot be forced.", "opengraph": {"title": "Supreme Court strikes down vaccine mandate - Politics & Policy - News - Catholic Online", "description": "Justices block Biden mandate, allow private businesses to make their own rules. The Supreme Court blocked President Biden's sweeping vaccine mandate on Thursday, stopping the administration from ...", "image": "https://www.catholic.org/files/images/ins_news/2022012511.jpg", "url": "https://www.catholic.org/news/politics/story.php?id=85655", "site_name": "Catholic Online"}, "tags": [], "tweets": [], "movies": [], "links": ["https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=Top%20Ad&utm_medium=We%20Humbly_blackRed", "https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=Top%20Ad&utm_medium=We%20Humbly_blackRed", "/news/politics/", "/search/?q=COVID", "/search/?q=vaccine", "/search/?q=mandate", "/search/?q=Biden", "https://ycvf.org/products/saved-by-hope"], "authors": ["Marshall Connolly (Catholic Online)"], "publish_date": "2022-01-13T21:23:00Z"}