{"result_id": "060023", "URL": "https://www.catholic.org/news/international/asia/story.php?id=56776", "timestamp": "2023-04-25 14:34:50 CEST+0200", "meta": {"description": "World Health Organization struggles with immunization in the Philippines A mass immunization campaign has started in the Philippines, with the health of the World Health Organization (WHO) and the ...", "lang": "en", "keywords": "Asia, Pacific, News, Health, Science, Immunization, Philippines", "favicon": "/assets/img/apple-touch-icon-144-precomposed.png", "canonical": "https://www.catholic.org/news/international/asia/story.php?id=56776", "encoding": "utf-8"}, "image": null, "domain": "www.catholic.org", "title": "Would you let your child get a deadly disease? - Asia & Pacific - International - News", "cleaned_text": "A mass immunization campaign has started in the Philippines, with the health of the World Health Organization (WHO) and the British government, but it may face an uphill battle because of many parents who will not immunize their children because of religious fears.\n\nLOS ANGELES, CA (Catholic Online) - The drive by the Philippines government is to immunize children against measles, polio and rubella, but it may not be easy because of a superstitious population.\n\nA dose of medicine can save a life, please donate today.\n\n\"We encounter parents who refuse to have their children immunized because it is supposed to be against their religion,\" said Dr. Abdullah Dumama, the regional health director for Davao. \"We try to convince them that there is nothing in the vaccine that counters their religion.\"\n\nDumama said that mothers would hide their children from community health workers over their fears. He lamented that the \"vulnerability\" of unimmunized children is putting other children at risk.\n\nMarianelle, a 25-year-old mother from Davao region, said that she is scared to have her three-year-old daughter vaccinated after her neighbors warned her of the \"bad effects\" of the vaccine.\n\n\"I was told my child would get sick once she gets the medicine,\" she said. She claimed that a baby in her village got sick after receiving the measles vaccine and also said that neither she nor her siblings received any kind of vaccine when they were young.\n\n\"All of us are healthy. I don't think there is a need for vaccination.\"\n\nArmi Capili, the coordinator of the Pulse Polio Immunization program, admitted that parents without medical knowledge have become a major problem.\n\n\"We try to spend time with them. They have to understand the importance of having their children immunized,\" she said.\n\nThe WHO aims to immunize 13 million children in the Philippines over the next few months.\n\nIn January, the Philippines Department of Health declared an outbreak of measles in several districts in at least nine cities that are in the Metro Manila area. Records from the National Epidemiology Center show that last year there were 1,724 measles cases, including 21 deaths.\n\n'Help Give every Student and Teacher FREE resources for a world-class Moral Catholic Education'", "opengraph": {"title": "Would you let your child get a deadly disease? - Asia & Pacific - International - News - Catholic Online", "description": "World Health Organization struggles with immunization in the Philippines A mass immunization campaign has started in the Philippines, with the health of the World Health Organization (WHO) and the ...", "image": "https://www.catholic.org/files/images/ins_news/2014091107pip-p.jpg", "url": "https://www.catholic.org/news/international/asia/story.php?id=56776", "site_name": "Catholic Online"}, "tags": [], "tweets": [], "movies": [], "links": ["https://catholicresources.education/collections/most-popular", "https://www.catholic.org", "/news/international/asia/", "/search/?q=Asia", "/search/?q=Pacific", "/search/?q=News", "/search/?q=Health", "/search/?q=Science", "/search/?q=Immunization", "/search/?q=Philippines", "http://ycvf.org/collections/medicine", "https://ycvf.org"], "authors": ["Catholic Online (NEWS CONSORTIUM)"], "publish_date": "2014-09-04T07:11:00Z"}