{"result_id": "060004", "URL": "https://www.catholic.org/news/health/story.php?id=42745", "timestamp": "2023-04-25 14:34:30 CEST+0200", "meta": {"description": "Researchers cautiously optimistic after HPV vaccine study. Just two doses of human papillomavirus (HPV) vaccine may be enough to prevent women from cervical cancer. Currently doctors give three ...", "lang": "en", "keywords": "HPV, vaccine, doses, STD", "favicon": "/assets/img/apple-touch-icon-144-precomposed.png", "canonical": "https://www.catholic.org/news/health/story.php?id=42745", "encoding": "utf-8"}, "image": null, "domain": "www.catholic.org", "title": "Less HPV vaccine may be better - Health & Wellness - News", "cleaned_text": "Just two doses of human papillomavirus (HPV) vaccine may be enough to prevent women from cervical cancer. Currently doctors give three doses.\n\nLOS ANGELES, CA (Catholic Online) - New research by the U.S. government's National Cancer Institute conducted in what is known as the Costa Rica Vaccine Trial, suggests that women need only two doses of HPV vaccine instead of three. The good news might mean fewer injections and less expense for patients.\n\nThe study evaluated 7,466 women who volunteered and was published in the Journal of the National Cancer Institute on Thursday. The findings appear to have happened somewhat by accident. Women were set to be given three doses of the vaccine, but for a variety of reasons many got only two doses or even just one. Twenty percent of the women had less than the three planned doses.\n\nAfter four years, researchers found that even one dose offered substantial protection against the virus. More importantly, the results suggested that women who had fewer does actually did better than those with three doses.\n\nIn an editorial next to the article, Cosette Marie Wheeler of the University of New Mexico said,\"The age-old adage of less is more may apply to HPV vaccination, and if so, the report represents an important step on the road to more effective and sustainable cervical cancer prevention programs.\"\n\nResearchers are cautiously optimistic. They say that while the findings are good news, further study is needed to assess the efficacy of lower doses of the vaccine.\n\nHPV is a serious sexually transmitted disease. Although in most cases, the body can clear the virus on its own, it can survive in some victims and can manifest itself years after infection. The virus has been linked to cervical cancer. In less serious, but embarrassing cases, the disease can cause genital warts.\n\n'Help Give every Student and Teacher FREE resources for a world-class Moral Catholic Education'", "opengraph": {"title": "Less HPV vaccine may be better - Health & Wellness - News - Catholic Online", "description": "Researchers cautiously optimistic after HPV vaccine study. Just two doses of human papillomavirus (HPV) vaccine may be enough to prevent women from cervical cancer. Currently doctors give three ...", "image": "https://www.catholic.org/files/images/ins_news/2011090921hpv-p.jpg", "url": "https://www.catholic.org/news/health/story.php?id=42745", "site_name": "Catholic Online"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.catholiconline.school/", "https://www.catholic.org", "/news/health/", "/search/?q=HPV", "/search/?q=vaccine", "/search/?q=doses", "/search/?q=STD", "https://ycvf.org"], "authors": ["Catholic Online (NEWS CONSORTIUM)"], "publish_date": "2011-09-09T23:09:29Z"}