{"result_id": "060044", "URL": "https://www.catholic.org/news/health/story.php?id=85505", "timestamp": "2023-04-25 14:35:02 CEST+0200", "meta": {"description": "COVID vaccine is not yet approved for children, but soon will be. California Gov. Newsom today ordered children ages 5 and up to be vaccinated for COVID before returning to school after January 1. ...", "lang": "en", "keywords": "COVID, vaccine, California, children", "favicon": "/assets/img/apple-touch-icon-144-precomposed.png", "canonical": "https://www.catholic.org/news/health/story.php?id=85505", "encoding": "utf-8"}, "image": null, "domain": "www.catholic.org", "title": "Another step too far? California Gov. mandates COVID vax for children - Health & Wellness - News", "cleaned_text": "California Gov. Newsom today ordered children ages 5 and up to be vaccinated for COVID before returning to school after January 1. The order is contingent upon the vaccine receiving FDA approval for use in children. California is the first state to take such a measure.\n\nLOS ANGELES, CA (California Network) - Gov. Newsom today issued a sweeping COVID order, requiring all K-12 students in the state to be vaccinated against COVID before they return to school after January 1, 2022. The order is contingent on FDA approval for the vaccine in children. FDA approval for children is forthcoming. The order comes just a few weeks after a large effort to remove him from office by recall vote. After July 1, 2022, the requirement will include students in grades K-6 and those who attend private schools.\n\nWhile the vaccine mandate will likely be challenged almost immediately, it will probably survive in the state's courts. What happens if the mandate is appealed to higher courts remains to be seen.\n\nThe vaccine mandate does allow for religious and medical exemptions.\n\nCalifornia already requires vaccines for all schoolchildren attending public K-12 schools. However, those vaccines have a long history of use, and are also a point of debate with some parents who oppose them on various grounds.\n\nGenerally speaking, vaccines are safe and effective preventatives for many diseases. However, the COVID vaccine is questioned for a variety of reasons. Most vaccines require years before they are approved, while the COVID shots were approved within a year. They have not been used in the long-term, and have barely been tested on children. There are concerns the vaccines are developed using stem cells from aborted children. Democrats in the state, who are fond of the concept of bodily autonomy, are remarkably silent on the same issue when it comes to injecting a vaccine. Republicans in California have virtually no voice in state issues because they are a shrinking political minority.\n\nDespite these concerns, medical and government officials are urging the public to be vaccinated. Even Pope Francis is requiring staff at the Vatican to be vaccinated.\n\nThere is another concern. Children are generally impervious to the effects of COVID. Most experience only mild symptoms. Some experience none. Many children are previously infected and already carry antibodies and better immunity to the virus than the vaccine can confer. Yet, under this edict, they are still required to have the shot. There is no allowance for children who are virtually immune to COVID.\n\nOne response to this concern is that children can still carry the disease to more vulnerable people. However, vaccination doesn't prevent this either. Vaccinated people can still carry the illness, and can still pass it to others, even if they have few or no symptoms, even if they are children. The counter-response is that the viral load is smaller, but this may not always be the case, nor may it always matter. A question: is the benefit worth the loss of bodily autonomy, parental rights, and civil liberty? Is it worth the precedent that is being established? The answer could be yes, but it should come from science, not politicians. Thankfully exemptions are available --for now.\n\nMeanwhile, employees across a number of sectors, both government and private, are facing a requirement to be vaccinated or lose their jobs. Unvaccinated people face shunning and denial of access to an increasing number of places.\n\nIs this a step too far?\n\nMost people have strong opinions on this issue, however one thing is certain. Public messaging on COVID and the vaccine is weak or nonexistent. It isn't persuasive, or else there would be little need to coerce people into accepting the vaccine, or having their children vaccinated. And what about the rights of people to choose what goes into their bodies, or their child's? What about basic liberties, such as to peaceably assemble or practice religious faith?\n\nOne thing is certain, a preference for coercion, a lack of clear, easily understood public messaging, and widespread mistrust in government is interfering with public health and civil liberties.", "opengraph": {"title": "Another step too far? California Gov. mandates COVID vax for children - Health & Wellness - News - Catholic Online", "description": "COVID vaccine is not yet approved for children, but soon will be. California Gov. Newsom today ordered children ages 5 and up to be vaccinated for COVID before returning to school after January 1. ...", "image": "https://www.catholic.org/files/images/ins_news/2021101702.jpg", "url": "https://www.catholic.org/news/health/story.php?id=85505", "site_name": "Catholic Online"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.catholiconline.school/", "/search/?q=Marshall+Connolly+%28NEWS+CONSORTIUM%29", "/news/health/", "/search/?q=COVID", "/search/?q=vaccine", "/search/?q=California", "/search/?q=children", "https://www.catholiconline.school/collections/saint-gabriel-the-archangel?utm_campaign=Catholic%20Online%20Ads&utm_source=Course%20Layout%201&utm_medium=angel", "https://www.catholiconline.school/collections/saint-gabriel-the-archangel?utm_campaign=Catholic%20Online%20Ads&utm_source=Course%20Layout%201&utm_medium=angel", "https://www.catholiconline.school/bundles/the-bible?utm_campaign=Catholic%20Online%20Ads&utm_source=Course%20Layout%201&utm_medium=Bible", "https://www.catholiconline.school/bundles/the-bible?utm_campaign=Catholic%20Online%20Ads&utm_source=Course%20Layout%201&utm_medium=Bible", "https://www.catholiconline.school/courses/first-holy-communion-with-certificate-of-completion?utm_campaign=Catholic%20Online%20Ads&utm_source=Course%20Layout%201&utm_medium=Certificate", "https://www.catholiconline.school/courses/first-holy-communion-with-certificate-of-completion?utm_campaign=Catholic%20Online%20Ads&utm_source=Course%20Layout%201&utm_medium=Certificate", "https://www.catholiconline.school/collections/blessed-virgin-mary?utm_campaign=Catholic%20Online%20Ads&utm_source=Course%20Layout%201&utm_medium=Mary", "https://www.catholiconline.school/collections/blessed-virgin-mary?utm_campaign=Catholic%20Online%20Ads&utm_source=Course%20Layout%201&utm_medium=Mary"], "authors": ["Marshall Connolly (NEWS CONSORTIUM)"], "publish_date": "2021-10-01T21:14:00Z"}