{"result_id": "060014", "URL": "https://www.catholic.org/news/health/story.php?id=46713", "timestamp": "2023-04-25 14:34:39 CEST+0200", "meta": {"description": "Developing nations are seeing a reemergence of the disease as children go without immunization. Parents who do not get their children properly vaccinated against polio are largely responsible for a ...", "lang": "en", "keywords": "Polio immunization, refusal, disease, WHO, UNICEF, UN, Nigeria, Afghanistan, Pakistan, Muslim", "favicon": "/assets/img/apple-touch-icon-144-precomposed.png", "canonical": "https://www.catholic.org/news/health/story.php?id=46713", "encoding": "utf-8"}, "image": null, "domain": "www.catholic.org", "title": "Polio comes back as parents refuse immunzations - Health & Wellness - News", "cleaned_text": "Parents who do not get their children properly vaccinated against polio are largely responsible for a resurgence of the disease in Nigeria, Afghanistan, and Pakistan. This is according to statistics published by the United Nations Children's Emergency Fund (UNICEF).\n\nNEW YORK, NY (Catholic Online) - Polio is a very infectious disease that in rare cases can be debilitating. Victims contract the virus from fecal-oral or oral-oral transmission. In about 1 percent of all cases, the virus attacks the nervous system, especially the spinal cord, and a victim can lose the use of their limbs as a result.\n\nSince the 1950's a vaccine has existed for polio, and thanks for organizations such as UNICEF, the vaccine is widely available around the globe. All that's required is cooperation of the parent to bring the child to a clinic to receive the orally administered vaccination.\n\nBut in parts of the developing world, a lack of infrastructure, economic and cultural barriers, and occasionally ignorance, conspire to keep some children unprotected. In Kano state, Nigeria, one Muslim leader objected to the vaccination programs as part of a Western plan to sterilize children, leading to a local increase in the disease. Many Muslim parents refuse to immunize their children.\n\n \n\nThe disease remains active in at least 20 countries today, all in the developing world, but only the three countries listed above have endemic polio transmission.\n\nIndia was removed from the list in 2012 after successful eradication efforts in that country.\n\nAs parents fail to vaccinate their children, they put other children at risk. According to the World Health Organization, although polio has been eradicated in neighboring Niger, infections cross the border from Nigeria and are reintroducing the disease.\n\nComplicating eradication efforts in Nigeria is the rampant corruption in the country. Nigerian president Goodluck Johnathan has pledged 30 million dollars to that nation's eradication programs, but government efforts may not meet with full success.\n\nPart of the problem is that health centers are not always accessible for people who live far from urban centers and towns. The lack of a program to provide easy access to health centers is just part of the problem that keeps the disease endemic.\n\nIn all, the long-term solution is a matter of responsibility. Parents much vaccinate their children properly, governments must provide education and access to their people, and aid organizations must build rapport with local populations who are inclined to be suspicious. Only with these approaches are taken together can this scourge of children be stopped.\n\n'Help Give every Student and Teacher FREE resources for a world-class Moral Catholic Education'", "opengraph": {"title": "Polio comes back as parents refuse immunzations - Health & Wellness - News - Catholic Online", "description": "Developing nations are seeing a reemergence of the disease as children go without immunization. Parents who do not get their children properly vaccinated against polio are largely responsible for a ...", "image": "https://www.catholic.org/files/images/ins_news/2012060002pvc-p.jpg", "url": "https://www.catholic.org/news/health/story.php?id=46713", "site_name": "Catholic Online"}, "tags": [], "tweets": [], "movies": [], "links": ["https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=Top%20Ad&utm_medium=We%20Humbly_orangeBlue", "https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=Top%20Ad&utm_medium=We%20Humbly_orangeBlue", "https://www.catholic.org", "/news/health/", "/search/?q=Polio+immunization", "/search/?q=refusal", "/search/?q=disease", "/search/?q=WHO", "/search/?q=UNICEF", "/search/?q=UN", "/search/?q=Nigeria", "/search/?q=Afghanistan", "/search/?q=Pakistan", "/search/?q=Muslim", "https://ycvf.org"], "authors": ["Catholic Online (NEWS CONSORTIUM)"], "publish_date": "2012-06-21T13:00:02Z"}