{"result_id": "060031", "URL": "https://www.catholic.org/news/technology/story.php?id=78019", "timestamp": "2023-04-25 14:34:55 CEST+0200", "meta": {"description": "Could this be the end of censorship? Someone in China has just used blockchain technology to evade censorship, and the implications are staggering. Just as the printing press changed the world of ...", "lang": "en", "keywords": "censorship, China, blockchain, ethereum, cryptocurrency, ledger", "favicon": "/assets/img/apple-touch-icon-144-precomposed.png", "canonical": "https://www.catholic.org/news/technology/story.php?id=78019", "encoding": "utf-8"}, "image": null, "domain": "www.catholic.org", "title": "Someone in China just used blockchain to evade censorship and the implications are staggering - Technology - News", "cleaned_text": "Someone in China has just used blockchain technology to evade censorship, and the implications are staggering. Just as the printing press changed the world of publishing, blockchain may also change digital publishing.\n\nLOS ANGELES, CA (California Network ) - Internet users in China have discovered a way to evade that country's strict censorship policies. They have used the Ethereum blockchain to share a censored news article. Since the Ethereum blockchain is distributed globally, the Chinese government is powerless to censor the article. It is likely the practice will grow.\n\nSince 2010, the Chinese government has released reports critical of the vaccine industry. The reports are intended to shame bad actors in the market and to demonstrate the government is working to protect the people. However, the people have reacted to this news with public outcry, especially following the latest report which showed that at least 250,000 doses of vaccine violated government standards. The reports have exposed corruption and abuse in the nation's pharmaceutical industry.\n\nWhile the government has vowed to crack down on industry corruption, some voices have criticized the government and run afoul of China's strict censorship laws. As a result, reports have been censored. When re-posted by internet users in China, the posts quickly disappear.\n\nInternet users have found a way to respond to this censorship using the Ethereum blockchain.\n\nEthereum is a cryptocurrency, which means it is designed to be used as a form of digital cash on the internet. Like cash, it is anonymous and cannot be traced to a particular user. However, the cryptocurrency relies on a global network of computers which maintains an anonymous record of each transaction. This is called the blockchain. Because the blockchain is distributed globally, the ledger cannot be censored.\n\nInternet users in China have learned they can use the metadata in the ledger to paste and share text. Metadata is information that is attached to a transaction, and this data can be accessed, edited, and is shared as part of the ledger, much the way a conventional ledger may contain notes for a transaction.\n\nIn this case, someone used the blockchain metadata to share the text of a censored blog post criticizing the nation's vaccination program. This is the second such time the blockchain has been used in this way. The first time was in April when a female Chinese student posted an open letter to the blockchain exposing sexual assault and intimidation at her college.\n\nThe open-source nature of the blockchain is such that anyone with an internet connection can access the data, even if cryptocurrency is banned in their country.\n\nThe practice is likely to catch on, not just in China, but around the world. All countries practice some form of internet censorship. Most countries only censor content of a universally illegal nature, while others censor content which is socially unacceptable, or critical of the local government. Several countries censor ideas, such as religious books.\n\nThe Bible is banned in 18 countries, mostly in Asia. It is banned in China, the world's most populous country. In North Korea, mere possession of a Bible is punishable by death.\n\nNow that a way has been discovered to evade censors, missionaries may be able to distribute the Bible and other religious literature in places where they could not do so before.\n\nTo appreciate the development, it could prove as revolutionary to digital media as the printing press was to books. \n\n \n\nThere is no response yet from the pioneers of various cryptocurrencies. Most cryptocurrencies were envisioned as a form of digital cash, not as a publishing platform. However, the use of their blockchains to share banned information could cause a boom in the cryptocurrency market.\n\nAt least one new cryptocurrency, TRON, has been developed with the explicit intent of being used to distribute content.\n\nHowever, not all governments are likely to permit the distribution of censored content without some kind of a fight. And the nature of the content may change from open letters and angry blog posts to content that is much more offensive. The basis of all computer code is text, so where text can be shared, so too can be shared all manner of content.\n\nGiven this workaround, nations like China could use their laws to crack down harder on people trying to access cryptocurrency leaders and all things related to cryptocurrency. Historically, such efforts do not end well for governments as people find ways to work around the censors, but this could have an impact on cryptocurrency markets and the movement as a whole.\n\nIn the meantime, the Great Firewall of China appears to be breached.\n\nAuthor's note: At the time of publication, I hold a small portfolio of cryptocurrencies, including Tron. \n\n\n\n'Help Give every Student and Teacher FREE resources for a world-class Moral Catholic Education'", "opengraph": {"title": "Someone in China just used blockchain to evade censorship and the implications are staggering - Technology - News - Catholic Online", "description": "Could this be the end of censorship? Someone in China has just used blockchain technology to evade censorship, and the implications are staggering. Just as the printing press changed the world of ...", "image": "https://www.catholic.org/files/images/ins_news/2018074745.jpg", "video": "https://www.youtube.com/watch?v=OuVbc6jocyM", "url": "https://www.catholic.org/news/technology/story.php?id=78019", "site_name": "Catholic Online"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.youtube.com/watch?v=OuVbc6jocyM&autoplay=1", "https://catholiconline.shopping/products/st-benedict-home-blessing?utm_campaign=Catholic%20Online%20Ads&utm_source=ROS&utm_medium=DoorHang", "https://www.catholic.org", "/news/technology/", "/search/?q=censorship", "/search/?q=China", "/search/?q=blockchain", "/search/?q=ethereum", "/search/?q=cryptocurrency", "/search/?q=ledger", "https://prayercandles.org/", "https://holygrind.org/collections/sale", "https://ycvf.org/products/catholic-education-fund", "https://ycvf.org"], "authors": ["Marshall Connolly (Catholic Online) "], "publish_date": "2018-07-25T10:44:00Z"}