{"result_id": "060007", "URL": "https://www.catholic.org/news/national/story.php?id=80915", "timestamp": "2023-04-25 14:34:31 CEST+0200", "meta": {"description": "More than 760 cases of measles have been reported in the United States this year, the CDC says. Currently, 23 states have been affected, with 60 new cases reported in the last week. The majority of ...", "lang": "en", "keywords": "Catholic Church, vaccines, catholic online", "favicon": "/assets/img/apple-touch-icon-144-precomposed.png", "canonical": "https://www.catholic.org/news/national/story.php?id=80915", "encoding": "utf-8"}, "image": null, "domain": "www.catholic.org", "title": "What does the Catholic Church teach about vaccines? - U.S. News - News", "cleaned_text": "More than 760 cases of measles have been reported in the United States this year, the CDC says. Currently, 23 states have been affected, with 60 new cases reported in the last week. The majority of cases have been concentrated in Orthodox Jewish communities in New York, with outbreaks in New Jersey, Washington, and California as well.\n\nWashington D.C., (CNA) - Measles was declared eliminated in the U.S. in 2000. But experts say a decline in vaccination rates has left some communities particularly vulnerable to outbreaks, among them communities with religious objections to vaccinations.\n\nAs the U.S. continues to faces its worst measles outbreak in a quarter-century, the national debate about vaccines has been reignited, and with it, questions about whether Catholics can and should vaccinate.\n\nOne reason that some people decline the measles vaccine in particular has to do with the fact that it was developed from cell lines descending from aborted fetal tissue.\n\nThe vaccines for MMR (measles, mumps and rubella), hepatitis A, and chicken pox are the only remaining vaccines that were developed in these cell lines, and for which there are no alternatives on the market.\n\nBut this does not mean that Catholics are prohibited from receiving these vaccines, explained Dr. Jozef Zalot, an ethicist with the National Catholic Bioethics Center (NCBC), a non-profit research and educational institute committed to applying the moral teachings of the Catholic Church to ethical issues arising in healthcare and the life sciences.\n\nZalot pointed to a 2005 document from the Pontifical Academy for Life which considered the moral issues surrounding vaccines prepared in cell lines descended from aborted fetuses. The Vatican group concluded that it is both morally permissible and morally responsible for Catholics to use these vaccines.\n\nThe document also noted that Catholics have an obligation to use ethically-sourced vaccines when available, and when alternatives do not exist, they have an obligation to speak up and request the development of new cell lines that are not derived from aborted fetuses.\n\nThis conclusion, Zalot said, is based on a framework for evaluating ethical dilemmas, \"when you're in a situation where you want to do good, but in doing so, there's some level of cooperation in an immoral act.\"\n\nMoral theologians weigh the level and type of cooperation in the evil act '\" in this case two abortions performed in 1960s from which the cells lines were developed '\" as well as the good of public health that comes from vaccinating.\n\n\"One is morally free to use the vaccine, despite its historical association with abortion, if there is a proportionately serious reason for doing so,\" the NCBC says in its Frequently Asked Questions about vaccines, drawing from the conclusions of the Pontifical Academy for Life.\n\n\"In practice, the risks to personal and public health could permit its use. This is especially important for parents, who have a moral obligation to protect the life and health of their children and those around them.\"\n\nNo additional abortions are performed to maintain the vaccines, and no cells from the abortion victims are contained in the vaccines themselves, the NCBC notes.\n\nOther concerns regarding vaccines involve side effects. Internet groups have voiced concerns that vaccines could be linked to negative outcomes including autoimmune disorders, autism, and learning disabilities.\n\nHowever, the science does not substantiate claims that vaccines pose a significant threat, according to Dr. Paul Cieslak, an infectious disease specialist with the Oregon Health Authority.\n\nSpeaking as a Catholic physician and father of six children '\" all of whom are vaccinated '\" Cieslak told CNA that while all medications, including vaccines, have the potential for side effects, vaccines are largely safe.\n\nTo be approved by the FDA, he said, vaccines undergo clinical trials with hundreds or thousands of people. Once they are licensed for use in the general population, there are additional systems set up to look for possible side effects.\n\n\"When you give vaccines to millions of people, some of them are going to develop a disease or get sick [in a way] that's completely unrelated to the vaccination,\" he said, so further examination is necessary to determine whether the vaccine caused the adverse event.\n\nIf something concerning surfaces in the reporting system, known as VAERS, it is referred to the Vaccine Safety Datalink, a group of healthcare organizations around the country. They monitor data on patients coming in with certain symptoms and problems, to see if these symptoms are more likely to arise in patients who have recently been vaccinated.\n\n\"Those systems give a lot of reassurance that the vaccines are safe,\" he said, noting that 15 articles were published last year \"looking into various suspicions that were raised, and basically weren't finding anything.\"\n\nCieslak said that parents making the decision of whether to vaccinate their children should keep the common good in mind.\n\n\"I would argue that there is a rationale rooted in social justice that people should get their children vaccinated for the greater good. The Church does tell us that we are our brother's keeper, and we can protect other people.\"\n\nIn particular, those who cannot receive vaccines '\" children who are too young to receive them, pregnant women, and people with suppressed immune systems '\" benefit from what is called \"herd immunity.\" If enough of a community is vaccinated, it becomes much more difficult for a disease to spread through a population. This protects those who are most vulnerable to the disease and its complications.\n\nIn a 2017 document on vaccines, the Pontifical Academy for Life noted a \"moral obligation to guarantee the vaccination coverage necessary for the safety of others...,especially the safety more vulnerable subjects such as pregnant women and those affected by immunodeficiency who cannot be vaccinated against these diseases.\"\n\nStill, some parents maintain religious or philosophical objections to vaccinating. All 50 states currently allow exemptions to vaccine requirements for those with certain medical conditions '\" such as life-threatening allergies to a vaccine or a chronically compromised immune system. All but a few states allow exemptions for philosophical and religious objections as well.\n\nIn the wake of the ongoing measles outbreak, several states have proposed tightening or removing these exemptions. And at least five Democratic presidential hopefuls - Pete Buttigieg, Elizabeth Warren, Cory Booker, Eric Swalwell, and Tim Ryan '\" have indicated that they would favor removing religious and personal belief exemptions from vaccine requirements.\n\nThe removal of vaccine exemptions is extremely concerning to people like Barbara Loe Fisher, co-founder and president of the National Vaccine Information Center, a group that says it works to \"prevent vaccine injuries and deaths through public education.\"\n\n\"Vaccines are pharmaceutical products that carry a risk of harm and failure,\" Fisher told CNA. \"People should not be forced by law to violate their conscience when making decisions about vaccination for themselves or their minor children.\"\n\n\"Every person is different, born with different genes and a unique microbiome and epigenetic history. We do not all respond the same way to pharmaceutical products and doctors cannot reliably predict who will be harmed by vaccines,\" she continued. \"One-size-fits-all vaccine policies discriminate against those who are biologically vulnerable to suffering vaccine reactions.\"\n\nThe American Academy of Pediatrics, however, has said that the NVIC puts children and vulnerable populations at risk by promoting \"unfounded and unscientific information\" about vaccines.\n\nZalot did not endorse the NVIC's scientific perspective, but agreed that requiring people to inject a foreign substance into their children's bodies without any exemptions is troubling.\n\n\"That would raise a lot of concerns for me, to make a blanket statement that a parent has no conscience rights, or parental rights in terms of vaccinating or not vaccinating,\" he said, clarifying that he was speaking for himself and not the NCBC.\n\nThis becomes tricky when objections are based on arguments that lack scientific backing, he said.\n\n\"It really is a balancing act,\" he said. \"It's very difficult to make a blanket statement. You have to really look at the individual situation and make a judgment from there.\"\n\nZalot also stressed, however, that parents who do not vaccinate must realize that there may be consequences of that choice '\" for example, they may not be able to attend certain schools that require students to be vaccinated.\n\n\"A parent could exercise a conscientious right not to vaccinate, but at the same time, they have to accept the consequences of that.\"\n\n'Help Give every Student and Teacher FREE resources for a world-class Moral Catholic Education'", "opengraph": {"title": "What does the Catholic Church teach about vaccines?  - U.S. News - News - Catholic Online", "description": "More than 760 cases of measles have been reported in the United States this year, the CDC says. Currently, 23 states have been affected, with 60 new cases reported in the last week. The majority of ...", "image": "https://www.catholic.org/files/images/ins_news/2019052339.jpg", "video": "https://www.youtube.com/watch?v=y6Pcp5jzgC4", "url": "https://www.catholic.org/news/national/story.php?id=80915", "site_name": "Catholic Online"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.youtube.com/watch?v=y6Pcp5jzgC4&autoplay=1", "https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=ROS&utm_medium=We%20Humbly_success", "https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=ROS&utm_medium=We%20Humbly_success", "https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=ROS&utm_medium=We%20Humbly_success", "/search/?q=%28CNA%2FEWTN%29", "https://www.catholic.org", "/news/national/", "/search/?q=Catholic+Church", "/search/?q=vaccines", "/search/?q=catholic+online", "https://ycvf.org/products/prayer-request-live", "https://catholiconline.shopping/collections/prayer-cards?utm_campaign=Catholic%20Online%20Ads&utm_source=ROS&utm_medium=PrayerCards", "https://catholiconline.shopping/products/st-benedict-home-blessing?utm_campaign=Catholic%20Online%20Ads&utm_source=ROS&utm_medium=DoorHang", "https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=Top%20Ad&utm_medium=We%20Humbly_blackRed", "https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=Top%20Ad&utm_medium=We%20Humbly_blackRed", "https://ycvf.org/products/prayer-request-live", "https://ycvf.org"], "authors": ["(CNA/EWTN)"], "publish_date": "2019-05-07T13:23:00Z"}