{"result_id": "060015", "URL": "https://www.catholic.org/news/international/africa/story.php?id=56534", "timestamp": "2023-04-25 14:34:40 CEST+0200", "meta": {"description": "Ebola deaths pass 1,000 in West Africa The Spanish-based San Juan de Dios hospital order has reported that a Catholic nun who was working in Liberia has died of the Ebola virus. LOS ANGELES, CA ...", "lang": "en", "keywords": "Ebola, Health, Africa, International", "favicon": "/assets/img/apple-touch-icon-144-precomposed.png", "canonical": "https://www.catholic.org/news/international/africa/story.php?id=56534", "encoding": "utf-8"}, "image": null, "domain": "www.catholic.org", "title": "Catholic nun dies before experimental drug reaches Liberia - Africa - International - News", "cleaned_text": "The Spanish-based San Juan de Dios hospital order has reported that a Catholic nun who was working in Liberia has died of the Ebola virus.\n\nLOS ANGELES, CA (Catholic Online) - The order reported that Sister Chantal Pascaline from the Congo died on August 9 \"from Ebola in the Hospital San Jose de Monrovia, despite the care she received from a volunteer nurse.\"\n\n\n\nYou can be the light in this dark time.\n\nPascaline belonged to the same order as another Spanish missionary priest and a nun who had been evacuated to Madrid by jet. Both are in stable condition.\n\nThis Ebola outbreak, which began in March of this year, is the largest and longest outbreak ever recorded. The World Health Organization (WHO) reports that now over 1,000 people have died, and that more than 1,800 have become infected by the disease.\n\nMeanwhile, an experimental drug that may halt the disease in its tracks, ZMapp is expected to arrive in Liberia in time to treat two Liberian doctors who came down with the disease, reported the Liberian Health Minister Walter Gwenigale.\n\nDoses of Z Mapp were donated by the San Diego-based company Mapp BioPharmaceuticals at no charge, which has now exhausted its supply of the drug, and will require months to manufacture more.\n\n\"The trouble is, of course, with this very, very limited number of vaccines, who would you give that to?\" said Dr. Gregory Taylor, the deputy head of the agency.\n\nTaylor said the agency has been advised to give the vaccine to health care workers in Africa who are among the most vulnerable because of their close contact with Ebola patients.\n\n'Help Give every Student and Teacher FREE resources for a world-class Moral Catholic Education'", "opengraph": {"title": "Catholic nun dies before experimental drug reaches Liberia - Africa - International - News - Catholic Online", "description": "Ebola deaths pass 1,000 in West Africa The Spanish-based San Juan de Dios hospital order has reported that a Catholic nun who was working in Liberia has died of the Ebola virus. LOS ANGELES, CA ...", "image": "https://www.catholic.org/files/images/ins_news/2014080752africa-p.jpg", "url": "https://www.catholic.org/news/international/africa/story.php?id=56534", "site_name": "Catholic Online"}, "tags": [], "tweets": [], "movies": [], "links": ["https://catholicresources.education/collections/most-popular", "https://www.catholic.org", "/news/international/africa/", "/search/?q=Ebola", "/search/?q=Health", "/search/?q=Africa", "/search/?q=International", "http://catholicshopping.com/collections/prayer-cards", "https://ycvf.org"], "authors": ["Catholic Online (NEWS CONSORTIUM)"], "publish_date": "2014-08-13T08:07:00Z"}