{"result_id": "060028", "URL": "https://www.catholic.org/news/health/story.php?id=58278", "timestamp": "2023-04-25 14:34:52 CEST+0200", "meta": {"description": "43 states now have 'widespread' flu activity, as reports show this year's vaccine only 33 percent effective. This year's flu season continues to weigh down heavily on the United States; 43 states are ...", "lang": "en", "keywords": "flu, influenza, vaccine, shot, United States, H1N1, H3N2", "favicon": "/assets/img/apple-touch-icon-144-precomposed.png", "canonical": "https://www.catholic.org/news/health/story.php?id=58278", "encoding": "utf-8"}, "image": null, "domain": "www.catholic.org", "title": "Faulty flu shots? This year's flu vaccine is not as strong as in previous years. - Health & Wellness - News", "cleaned_text": "This year's flu season continues to weigh down heavily on the United States; 43 states are experiencing \"widespread\" flu activity and six others are reported to have \"regional\" flu activity, according to the Centers for Disease Control and Prevention (CDC).\n\nLOS ANGELES, CA (Catholic Online) - California sat in the \"sporadic\" category just one week ago. Now, California, Alaska, Oregon, Arizona, Nevada and Maine all fall in the \"regional\" flu activity category, according to the CDC.\n\n601 people in the U.S. died from influenza or pneumonia during the last week of the year; this is down from the 837 people who died at the hands of the flu the week prior.\n\n\n\nSave a life today: Give medicine\n\nThe 601 deaths pushed the flu into accounting for 6.8 percent of the total deaths during that week. You only need 6.9 percent for the virus to qualify as an epidemic.\n\nHospitalization rates rose from 9.7 per 100,000 Americans to 12.6 per 100,000. Senior citizens and children under 5 continues to have the highest hospitalization rate.\n\nPrevious years had been focused on the H1N1 strain of influenza; this year H3N2 is the main culprit, accounting for 99.6 percent of the subtyped influenza viruses during that last week of the year.\n\n\"When H3N2 strains are more common than H1N1 strains, the flu usually causes more severe illnesses and deaths,\" explained Dr. Tom Frieden, director of the CDC, in LA Times.\n\n\"This year's flu vaccine isn't as effective as in years past because the virus mutated after the shot was developed and manufactured,\" said Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases. \"As a result, it's only 33 percent effective at preventing the flu. Still, it's wise to get the flu vaccine anyway because it offers more protection than not getting the shot at all.\"\n\n\n\nGet your chance for better health here during health month!\n\nAccording to the CDC, about two-thirds of the H3N2 viruses analyzed were similar to the A/Switzerland/9715293 strain. By the time it was detected, the CDC already picked up a different type of H3N2 to be the main target of the flu vaccine.\n\nIt is important to note that drug resistance was tested and the flu viruses tested were susceptible to the drugs, according to the CDC. Rare cases of drug resistance for H1N1 and H3N2 have, however, been reported elsewhere in the world.\n\n'Help Give every Student and Teacher FREE resources for a world-class Moral Catholic Education'", "opengraph": {"title": "Faulty flu shots? This year's flu vaccine is not as strong as in previous years. - Health & Wellness - News - Catholic Online", "description": "43 states now have 'widespread' flu activity, as reports show this year's vaccine only 33 percent effective. This year's flu season continues to weigh down heavily on the United States; 43 states are ...", "image": "https://www.catholic.org/files/images/ins_news/2015011223kidflu-p.jpg", "url": "https://www.catholic.org/news/health/story.php?id=58278", "site_name": "Catholic Online"}, "tags": [], "tweets": [], "movies": [], "links": ["https://ycvf.org/products/saved-by-hope", "/search/?q=Abigail+James+%28NEWS+CONSORTIUM%29", "https://www.catholic.org", "/news/health/", "/search/?q=flu", "/search/?q=influenza", "/search/?q=vaccine", "/search/?q=shot", "/search/?q=United+States", "/search/?q=H1N1", "/search/?q=H3N2", "http://ycvf.org/collections/medicine", "http://catholicshopping.com/collections/global-health-month", "https://ycvf.org"], "authors": ["Abigail James (NEWS CONSORTIUM)"], "publish_date": "2015-01-06T08:12:00Z"}