{"result_id": "060035", "URL": "https://www.catholic.org/news/health/story.php?id=85113", "timestamp": "2023-04-25 14:34:57 CEST+0200", "meta": {"description": "When will it be safe to return to church? Millions of Catholics across the United States and around the world are yearning to return to Mass. Yet restrictions forbid many parishes from holding Mass. ...", "lang": "en", "keywords": "COVID, Mass, safety, precautions, facts", "favicon": "/assets/img/apple-touch-icon-144-precomposed.png", "canonical": "https://www.catholic.org/news/health/story.php?id=85113", "encoding": "utf-8"}, "image": null, "domain": "www.catholic.org", "title": "Is it safe to return to Mass? - Health & Wellness - News", "cleaned_text": "Millions of Catholics across the United States and around the world are yearning to return to Mass. Yet restrictions forbid many parishes from holding Mass. Some dioceses where Mass is permitted have enacted safety protocols that make it difficult for many to attend. Others are holding Mass outdoors or online, but without distribution of the Eucharist. So when will things return to normal?\n\nLOS ANGELES, CA (California Network) - When will I be able to return to Mass? When will everything in my parish return to normal? The answer is complicated and it's difficult to provide much of an estimate, but spring or summer seems to be the most likely window for a return to Mass. A few pessimists suggest a return won't happen until the fall, or even 2022 at the earliest.\n\nThis isn't the first time the Church has sustained through a pandemic. The Church has survived worse disease outbreaks than this. But the key to surviving an outbreak is caution. While many parishes struggle to survive during the pandemic, imagine how hard it would be for them to survive if a significant number of parishioners perished as as result of getting sick at Mass. And so, the precautions remain.\n\nThe disease we call COVID is worthy of respect. Unlike the flu, the human body has no natural resistance to the SARS-CoV-2 virus. When a flu virus enters the human body, the immune system quickly recognizes the threat and mobilizes the body to fight back. Symptoms appear within days or even hours as the human body resists the infection. Most people can be sick for up to a week or so.\n\nSARS CoV-2 is different. Usually, the body does not recognize the virus for several days after infection. In some cases, it can take two or even three weeks for the body to realize an invasion has occurred and mobilize the immune system to fight back.\n\nThis lengthy delay is why COVID is so dangerous. During the days between infection and the appearance of symptoms, the virus multiplies within the body, increasing the viral load. A greater viral load simply means there are many more viruses within the body. Of course, the virus can be spread while the victim is entirely unaware they are carrying and transmitting the germs. By the time symptoms do appear, the viral load is large enough it has spread throughout the body, forcing the immune system to respond everywhere at once. COVID also appears to attack the nervous system and the circulatory system, so it is harder for the body to fight off. While flu is a respiratory illness, COVID even infects the body's extremities, such as fingers and toes.\n\nThe result of this is a much higher death rate, and a much longer recovery time for survivors. On average, COVID is killing about ten times the number of people killed by the seasonal flu.\n\nA consequence of these factors is that hospitals become overwhelmed, a secondary problem which also causes people to become ill and even die due to a lack of proper care.\n\nThis is why the public response to this disease is so strict. Systems of care are designed to cope with seasonal fluctuations in demand, and with occasional emergencies. But systems simply can't handle a sustained emergency that lasts for months to a year or more. The best way to protect these vital systems is to restrict the movement of people, which also restricts the movement of the virus, since it is carried and transmitted from person-to-person. Theoretically, if all human movement stopped, the virus would become extinct within a month.\n\nMasks, which are loathed by many, do not prevent viral transmission entirely, but they do help. And above all, they reduce the viral load a victim will receive if exposed to someone who is sick. The mask stops most of the sick person's viral particles from escaping into the open air, and limits how many infected particles enter your body. A smaller viral load can make a huge difference, one between suffering a mild case of COVID to one requiring hospitalization.\n\nThe restrictions at your parish are designed to protect you, and vulnerable members of the congregation. They also protect the Church. They protect our priests, deacons, and all who serve from getting sick. And they shield the Church from liability.\n\nIt is possible for Mass to be performed safely, with extensive measures in place. Limited attendance, temperature checks at the door, universal mask usage, suspending the use of holy water at entrances, strict social distancing protocols, and cleanings between every Mass. The Mass could be repeated more frequently to make up for the limited seating at each service. And the Eucharist can be administered on a limited basis by careful means.\n\nAs the vaccine becomes available, it will change the circumstances. The vaccine does not prevent COVID infection, but trains the body to recognize COVID when it invades so the immune system can react quickly. The result is a mild case of COVID, more like a cold than something worse than the flu.\n\nThe warmer weather and the seasonal decline of the virus will also help. But we should be under no illusions. COVID is here to stay and outbreaks will occur seasonally, just as they do with the flu. This scourge will remain indefinitely.\n\nIn all, spring or summer are reasonable guesses for a return to Mass with guidelines still enforced. Mask use may be here to stay for a long time. And the Eucharist might not be widely available until later in the year, except under certain circumstances. But the Mass will return.\n\nLet us use this time to appreciate the gift of the Blessed Sacrament and never again take it for granted.", "opengraph": {"title": "Is it safe to return to Mass? - Health & Wellness - News - Catholic Online", "description": "When will it be safe to return to church? Millions of Catholics across the United States and around the world are yearning to return to Mass. Yet restrictions forbid many parishes from holding Mass. ...", "image": "https://www.catholic.org/files/images/ins_news/2020125229.jpg", "url": "https://www.catholic.org/news/health/story.php?id=85113", "site_name": "Catholic Online"}, "tags": [], "tweets": [], "movies": [], "links": ["https://catholiconline.shopping/collections/prayer-cards?utm_campaign=Catholic%20Online%20Ads&utm_source=ROS&utm_medium=PrayerCards", "/search/?q=Marshall+Connolly+%28NEWS+CONSORTIUM%29", "/news/health/", "/search/?q=COVID", "/search/?q=Mass", "/search/?q=safety", "/search/?q=precautions", "/search/?q=facts", "https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=Top%20Ad&utm_medium=We%20Humbly_orangeBlue", "https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=Top%20Ad&utm_medium=We%20Humbly_orangeBlue", "https://ycvf.org/products/saved-by-hope"], "authors": ["Marshall Connolly (NEWS CONSORTIUM)"], "publish_date": "2020-12-17T15:50:00Z"}