{"result_id": "060038", "URL": "https://www.catholic.org/news/politics/story.php?id=85619", "timestamp": "2023-04-25 14:34:59 CEST+0200", "meta": {"description": "Why all the fuss? The omicron variant of SARS-CoV-2 is grabbing headlines as the world goes on alert over the latest strain of COVID. Yet, by all accounts, omicron is milder and already widespread. ...", "lang": "en", "keywords": "Omicron, COVID, lockdown, parish", "favicon": "/assets/img/apple-touch-icon-144-precomposed.png", "canonical": "https://www.catholic.org/news/politics/story.php?id=85619", "encoding": "utf-8"}, "image": null, "domain": "www.catholic.org", "title": "Why is nobody asking this logical question about Omicron? - Politics & Policy - News", "cleaned_text": "The omicron variant of SARS-CoV-2 is grabbing headlines as the world goes on alert over the latest strain of COVID. Yet, by all accounts, omicron is milder and already widespread. Why then, all the fuss over this latest strain of COVID?\n\nLOS ANGELES, CA (California Network) - The world has spent two years obsessing over COVID, masking up, locking down, and rushing vaccines into service. About 5.4 million people are dead. Although that number is terrible and large, the overall statistics suggest the illness isn't as deadly as we may fear. Only .02 percent of those infected die, and those statistics are declining as doctors learn how to effectively combat the disease. Vaccines are rendering people immune to the worst effects, and as the disease mutates, it seems to become less lethal, even if more transmissible. That's good because infection at confers a significant degree of future immunity.\n\nOnly about 3.5 percent of the people on the planet have been infected by COVID. Pandemic, yes. A human extinction event? By no means.\n\nGiven these statistics, the argument can be made that the lockdowns, the depression, the suicides, the lost businesses and jobs are at least a significant counterbalance offered as objection to all the draconian measures taken to date.\n\nAt first, those measures were understandable, since they were implemented when we knew so little about COVID. What is strange is the insistence on returning to them when we now know a lot more and the disease is less impactful.\n\nWhy is nobody asking this question?\n\nWhy do we need to return to measures taken in the spring of 2020 when COVID first started to spread around the globe? Why is there talk of closing workplaces, schools, and churches?\n\nThese decisions, which debatably made sense the first time, absolutely don't anymore.\n\nAt least in the United States, vaccinations have been available for the past year, and by now they are widely distributed. Most people don't even have to wait to get them, and they are free. Everyone who wants one, has one. Those who don't want them aren't going to accept them. Since the vast majority of people have had plenty of time to choose how they want to respond to COVID, and since the illness is endemic, meaning all people will catch it eventually, there seems to be little logical argument in favor of closing workplaces, schools, and churches.\n\nThere are those individuals who cannot be vaccinated, due to immune deficiency. However, these persons are vulnerable regardless, and must contend with reality no matter what. Protecting them is an individual duty, as each of us have a sacred responsibility to avoid endangering these persons. But this is no longer a reason to shutter the community. Not when closure of workplaces means the destruction of livelihoods and more.\n\nIf there's any argument in favor of restrictions, it is that COVID is a dangerous disease that has the potential to mutate into something more serious, a danger that grows with each infection. But this is not something that can be perfectly prevented. The odds of such an event are astonishingly small. And when weighed against the known impacts of ongoing restrictions, it barely moves the scale.\n\nThe fact is, we cannot live in fear forever. We cannot protect ourselves from danger by sealing ourselves into communities, homes, and rooms. This is not the purpose for which we are created. Ships are safe in harbor, but ships are not made for harbors. Likewise, we are safe in our rooms, but we are not made to live in isolation.\n\nIt's wise to be reasonable and take precautions. But it is also wise to go forth and live, trusting in God, modern medicine, and hand washing. Let us pray our hearts are converted to Christ, and these pestilences are removed, by God's merciful hand.", "opengraph": {"title": "Why is nobody asking this logical question about Omicron? - Politics & Policy - News - Catholic Online", "description": "Why all the fuss? The omicron variant of SARS-CoV-2 is grabbing headlines as the world goes on alert over the latest strain of COVID. Yet, by all accounts, omicron is milder and already widespread. ...", "image": "https://www.catholic.org/files/images/ins_news/2021123724.jpg", "url": "https://www.catholic.org/news/politics/story.php?id=85619", "site_name": "Catholic Online"}, "tags": [], "tweets": [], "movies": [], "links": ["https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=Top%20Ad&utm_medium=We%20Humbly_orangeBlue", "https://ycvf.org/products/donate?utm_campaign=Catholic%20Online%20Ads&utm_source=Top%20Ad&utm_medium=We%20Humbly_orangeBlue", "/news/politics/", "/search/?q=Omicron", "/search/?q=COVID", "/search/?q=lockdown", "/search/?q=parish", "https://holygrind.org/collections/sale"], "authors": ["Marshall Connolly (Catholic Online)"], "publish_date": "2021-12-21T16:35:00Z"}