{"result_id": "061038", "URL": "https://www.charismanews.com/culture/87582-top-of-the-week-a-biblical-response-to-the-vaccine", "timestamp": "2023-04-25 14:36:44 CEST+0200", "meta": {"description": "Also,12 states sue to end this oppressive Biden act.", "lang": "en", "keywords": "Bible, vaccine, vaccine mandate, Joe Biden, Liberty counsel, lawsuit, movies, Thanksgiving, Movieguide, Great Tribulation, end times, child sex trafficking, church leader, Philippines", "favicon": "https://cdn.charismanews.com/favicons/apple-touch-icon.png", "canonical": "https://www.charismanews.com/culture/87582-top-of-the-week-a-biblical-response-to-the-vaccine", "encoding": "UTF-8"}, "image": null, "domain": "www.charismanews.com", "title": "Top of the Week: A Biblical Response to the Vaccine", "cleaned_text": "Following are snippets of the top stories featured this week on charismanews.com. We invite you to visit the links to read the stories in full.\n\nWith the release of the COVID-19 vaccines, there came an influx of differing opinions with many disagreements, specifically arising among Christians. I am not writing this to add to the mix of viewpoints and I hope to keep my personal opinion out of this article as much as possible. Instead, I want to share a simple, biblical response to the vaccine issue I believe the Lord has placed on my heart. When Adam and Eve were in the Garden of Eden, they had a choice to make. They were either going to continue eating from the tree of life, or they were going to choose to eat from the tree of the knowledge of good and evil. One tree represented obedience and trust in God; the other tree represented an unhealthy desire for control. I believe we have that same choice today.\n\n\n\nThe temptation before us is a decision to try to control our lives through knowledge. It's easy to think that if we just know enough, we will be able to make the right decisions. Now, I'm not knocking information or knowledge. It is not a sin to read up on something to be informed. Knowledge is important. God gave us minds so we can learn, experiment and discover but as soon as we put our hope in gaining enough knowledge, we are not fully trusting God. The heart behind our pursuit of knowledge matters to God. (See Isa. 8:12-13 and Prov. 3:5.) 12 States Sue to End This Oppressive Biden Act\n\nState attorneys general across America are fighting to end Joe Biden's COVID-19 shot mandate. Montana Attorney General Austin Knudsen led the charge in a lawsuit joined by 11 other states to block the Biden administration over its unlawful \"job or jab\" COVID-19 shot mandate for health care workers. The lawsuit argues that the Centers for Medicare & Medicaid Service' shot mandate on facilities that receive federal funding for treating patients exceeds the agency's statutory authority and violates the Social Security Act's prohibition on regulations that control the hiring and firing of health care workers. It also violates multiple federal laws, the Spending Clause, the Anti-Commandeering Doctrine and the 10th Amendment to the Constitution. \"The Vaccine Mandate causes grave danger to vulnerable persons whom Medicare and Medicaid were designed to protect—the poor, sick and elderly—by forcing the termination of millions of 'healthcare heroes,'\" the lawsuit reads.\n\nIt's been quite the year for people, with many ups and downs and some who have had incredible hardships. Others have seen amazing blessings and miracles. However, no matter how the year has gone for you, there is always a reason to be thankful to God; that's why Thanksgiving Day is such an important holiday. The holiday puts us into a posture of gratefulness. We've put together a list of 10 of our favorite movies or TV programs, both classic and recent, that exemplify thankfulness and remind us to be thankful for all of our blessings.\n\nJesus gave us a short list of predictions of one-time-in-history events that will take place before His return and the rapture of the church. The most troubling of these prophecies is found in Matthew 24:21-22 (NIV): \"For then there will be great distress, unequaled from the beginning of the world until now—and never to be equaled again. If those days had not been cut short, no one would survive, but for the sake of the elect those days will be shortened.\" We know from many other prophecies that this time is history is short, only 3 1/2 years. Yet we can see from Jesus' own words that this time in history, called the Great Tribulation, will reach such intensity that to live through it will seem a miracle, and it will be.\n\nThe leader of a Philippines-based church was charged with having sex with women and underage girls who faced threats of abuse and \"eternal damnation\" unless they catered to the self-proclaimed \"son of God,\" federal prosecutors announced Thursday. Apollo Carreon Quiboloy and two of his top administrators are among nine people named in a superseding indictment returned by a federal grand jury last week and unsealed Thursday. The indictment includes three Los Angeles-based administrators of Quiboloy's church who were charged last year. The new indictment also names a church administrator in Hawaii. Quiboloy, 71, is head of the Kingdom of Jesus Christ church, founded in 1985. The church claims to have 6 million members in about 200 countries. Its United States headquarters is in the Van Nuys area of Los Angeles.\n\nFollow breaking news like this on our new platform, CHARISMA PLUS.\n\nTo contact us or to submit an article, click here.\n\nGet Charisma's best content delivered right to your inbox! Never miss a big news story again. Click here to subscribe to the Charisma News newsletter.", "opengraph": {"title": "Top of the Week: A Biblical Response to the Vaccine", "url": "https://www.charismanews.com/culture/87582-top-of-the-week-a-biblical-response-to-the-vaccine", "type": "article", "site_name": "Charisma News", "locale": "en_US", "description": "Also,12 states sue to end this oppressive Biden act.", "image": "https://cdn.charismanews.com/images/stories/2021/11/Vaccine_daniel-schludi-unsplash.jpg", "image:width": "618", "image:height": "340"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.charismanews.com/", "https://www.charismanews.com/opinion/87510-a-biblical-response-to-the-vaccine", "https://www.charismanews.com/us/87548-12-states-sue-to-end-this-oppressive-biden-act", "https://www.charismanews.com/culture/87561-top-10-movies-to-watch-this-thanksgiving", "https://www.movieguide.org/reviews/movies/squanto-a-warriors-tale.html", "https://itunes.apple.com/us/movie/squanto-a-warriors-tale/id297288492?at=10lHjf&ct=website_toplist", "https://www.amazon.com/Squanto-Warriors-Tale-Adam-Beach/dp/B00D8MQPZG?tag=mgwebsite01-20", "https://www.charismanews.com/opinion/87514-will-you-survive-the-great-tribulation", "https://www.charismanews.com/world/87522-philippine-church-leader-charged-with-child-sex-trafficking", "https://www.charismaplusapp.com/", "mailto:robert.caggiano@charismamedia.com", "https://www.charismanews.com/newsletters/?utm_source=charismanews.com&utm_medium=mid-article%20text&utm_campaign=plg_cm_midarticletextinjector", "mailto:?subject=Check%20out%20this%20article&body=I%20read%20this%20article%20and%20wanted%20to%20share%20it%20with%20you:%20https%3A%2F%2Fwww.charismanews.com%2Fculture%2F87582-top-of-the-week-a-biblical-response-to-the-vaccine", "mailto:webmaster@charismamedia.com?subject=Website correction for https://www.charismanews.com/culture/87582-top-of-the-week-a-biblical-response-to-the-vaccine"], "authors": ["Charisma News Staff"], "publish_date": "8:00AM EST 11/27/2021"}