{"result_id": "061014", "URL": "https://www.charismanews.com/world/91177-who-committee-that-s-pushing-worldwide-vaccine-passports-represents-dangerous-threat-to-freedom", "timestamp": "2023-04-25 14:35:46 CEST+0200", "meta": {"description": "President Joe Biden signed the Bali Declaration along with other world leaders.", "lang": "en", "keywords": "WHO, COVID passport, COVID, world leaders, control, freedom, Constitution, end times", "favicon": "https://cdn.charismanews.com/favicons/apple-touch-icon.png", "canonical": "https://www.charismanews.com/world/91177-who-committee-that-s-pushing-worldwide-vaccine-passports-represents-dangerous-threat-to-freedom", "encoding": "UTF-8"}, "image": null, "domain": "www.charismanews.com", "title": "WHO Committee That's Pushing Worldwide Vaccine Passports Represents 'Dangerous Threat to Freedom'", "cleaned_text": "A key committee of the World Health Organization is moving ahead with plans to demand vaccine passports for global travel.\n\nThe WHO's International Health Regulations Review Committee (IHRRC) is meeting this week to finalize amendments to its International Health Regulations (IHR), including the passports.\n\nThe 76th World Health Assembly is scheduled to occur in May 2023, and the IHRRC is pushing for the world health conference to institute a system of digital or paper global health vaccine passports, according to Liberty Counsel, a Christian religious rights law firm.\n\nThe controversial passport proposal could be adopted by a simple majority of the 194 member nations.\n\nSeveral people in the U.S. continue to warn that if allowed, the health or vaccine passports would eventually track every aspect of Americans' lives, violating the U.S. Constitution, the Americans With Disabilities Act, and HIPAA, due to the fact that everyone's medical records would be a part of a worldwide database.\n\nLiberty Counsel Founder and Chairman Mat Staver said, \"America's sovereignty is not for sale. Digital health or vaccine passports along with tracking and tracing apps present a serious threat to freedom. Vaccine passports and tracking apps are about collecting data and control.\"\n\n\"COVID has been used to advance this dangerous threat to freedom,\" Staver added. \"We must never accept vaccine passports or tracking apps as the new normal. The implications for freedom are significant. America should not be involved in such an evil organization as the World Health Organization.\"\n\nAs CBN News reported in November, the leaders of the world's largest economies at the G20 meeting held in Bali, Indonesia, drafted and signed a declaration in which the 20 countries agreed to adopt vaccine passports with the purported goal to promote global travel and tourism.\n\nPresident Joe Biden signed the Bali Declaration along with other world leaders. It included a section (s.23) on \"facilitating seamless international travel.\" It acknowledged the importance of shared technical standards and verification methods, including vaccine passports. The declaration also includes the commitment of the leaders to \"support continued international dialogue and collaboration on the establishment of trusted global digital health networks that should capitalize and build on...existing standard and digital COVID-19 certificates.\"\n\nThe impact would be vast because the G20 countries comprise more than 66% of the world's population. It includes Argentina, Australia, Brazil, Canada, China, France, Germany, Japan, India, Indonesia, Italy, Mexico, Russia, South Africa, Saudi Arabia, South Korea, Turkey, United Kingdom, United States and European Union.\n\nTo read the full story visit our content partners at CBN.com.\n\nTo contact us or to submit an article, click here.\n\nGet Charisma's best content delivered right to your inbox! Never miss a big news story again. Click here to subscribe to the Charisma News newsletter.", "opengraph": {"title": "WHO Committee That's Pushing Worldwide Vaccine Passports Represents 'Dangerous Threat to Freedom'  ", "url": "https://www.charismanews.com/world/91177-who-committee-that-s-pushing-worldwide-vaccine-passports-represents-dangerous-threat-to-freedom", "type": "article", "site_name": "Charisma News", "locale": "en_US", "description": "President Joe Biden signed the Bali Declaration along with other world leaders.", "image": "https://cdn.charismanews.com/images/stories/2023/1/COVID_Passport.jpg", "image:width": "618", "image:height": "340"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www1.cbn.com/cbnnews/world/2023/january/dangerous-threat-to-freedom-who-committee-wants-worldwide-vaccine-passports", "https://mycharismashop.com/collections/subscriptions", "mailto:robert.caggiano@charismamedia.com", "https://www.charismanews.com/newsletters/?utm_source=charismanews.com&utm_medium=mid-article%20text&utm_campaign=plg_cm_midarticletextinjector", "mailto:?subject=Check%20out%20this%20article&body=I%20read%20this%20article%20and%20wanted%20to%20share%20it%20with%20you:%20https%3A%2F%2Fwww.charismanews.com%2Fworld%2F91177-who-committee-that-s-pushing-worldwide-vaccine-passports-represents-dangerous-threat-to-freedom", "mailto:webmaster@charismamedia.com?subject=Website correction for https://www.charismanews.com/world/91177-who-committee-that-s-pushing-worldwide-vaccine-passports-represents-dangerous-threat-to-freedom"], "authors": ["Steve Warren"], "publish_date": "8:00AM EST 1/12/2023"}