{"result_id": "061046", "URL": "https://www.charismanews.com/us/88762-texas-judge-grants-first-amendment-protection-for-navy-personnel", "timestamp": "2023-04-25 14:37:01 CEST+0200", "meta": {"description": "President Joe Biden's administration had argued that not allowing the Navy to consider vaccination status in making assignments posed \"intolerable risks to safety and mission success.\"", "lang": "en", "keywords": "protection, First Amendment, Navy, SEALs, sailors, Judge, Texas, First Liberty Institute, vaccine, vaccine mandate, religious exemption, Judge Reed O'Connor", "favicon": "https://cdn.charismanews.com/favicons/apple-touch-icon.png", "canonical": "https://www.charismanews.com/us/88762-texas-judge-grants-first-amendment-protection-for-navy-personnel", "encoding": "UTF-8"}, "image": null, "domain": "www.charismanews.com", "title": "Texas Judge Grants First-Amendment Protection for Navy Personnel", "cleaned_text": "A federal judge in Texas is barring the Navy from taking action for now against sailors who have objected to being vaccinated against COVID-19 on religious grounds.\n\nU.S. District Judge Reed O'Connor had in January issued a preliminary injunction preventing the Navy from disciplining or discharging 35 sailors who sued over the Navy's vaccine policy while their case played out. On Monday, O'Connor agreed the case could go forward as a class action lawsuit and issued a preliminary injunction covering the approximately 4,000 sailors who have objected on religious grounds to being vaccinated.\n\nO'Connor said the larger group of sailors shared common characteristics with those who had sued. They had asked for and been denied an exemption to the vaccine requirement on religious grounds and were facing the threat of being discharged from the Navy, O'Connor wrote.\n\n\"Even though their personal circumstances may factually differ in small ways, the threat is the same—get the jab or lose your job,\" wrote O'Connor, who was nominated to the bench by President George W. Bush.\n\nDefense Secretary Lloyd Austin last year made vaccinations mandatory for service members. More than 99% of the Navy's active duty force has been vaccinated against COVID-19, and the Navy has also discharged 650 people for refusing to be vaccinated. Navy guidelines allow for exemptions to the vaccine requirement on religious and other grounds, including medical reasons and if a service member is about to leave the Navy.\n\nLawyers for the group of sailors who sued, most of them Navy SEALs, argue that the Navy had granted hundreds of exemptions for medical and administrative reasons but granted no religious exemptions for active duty and reserve service members. Nine inactive reserve members have been granted religious exemptions.\n\nMike Berry, the director of military affairs for First Liberty Institute, which is representing the sailors, said in a statement following O'Connor's action that it's \"time for our military to honor its constitutional obligations and grant religious accommodations for service members with sincere religious objections to the vaccine.\"\n\nWhile the case is still at an early stage, the U.S. Supreme Court in a brief order Friday narrowed the impact of O'Connor's original injunction, saying that the Navy could still consider the vaccination status of the sailors who sued in making deployment, assignment and other operational decisions. O'Connor's latest injunction allows the Navy to consider vaccination status in making those decisions about members of the larger group as well.\n\nPresident Joe Biden's administration had argued that not allowing the Navy to consider vaccination status in making assignments posed \"intolerable risks to safety and mission success.\"\n\n\"Navy personnel routinely operate for extended periods of time in confined spaces that are ripe breeding grounds for respiratory illnesses, where mitigation measures such as distancing are impractical or impossible,\" Biden administration lawyers wrote. \"A SEAL who falls ill not only cannot complete his or her own mission, but risks infecting others as well, particularly in close quarters, including on submarines.\" {eoa)\n\nFollow breaking news like this on our new platform, CHARISMA PLUS.\n\nTo contact us or to submit an article, click here.\n\nGet Charisma's best content delivered right to your inbox! Never miss a big news story again. Click here to subscribe to the Charisma News newsletter.", "opengraph": {"title": "Texas Judge Grants First-Amendment Protection for Navy Personnel", "url": "https://www.charismanews.com/us/88762-texas-judge-grants-first-amendment-protection-for-navy-personnel", "type": "article", "site_name": "Charisma News", "locale": "en_US", "description": "President Joe Biden's administration had argued that not allowing the Navy to consider vaccination status in making assignments posed \"intolerable risks to safety and mission success.\"", "image": "https://cdn.charismanews.com/images/stories/2021/3/AP_US_Navy_Pixabay.jpg", "image:width": "618", "image:height": "340"}, "tags": [], "tweets": [], "movies": [], "links": ["https://apnews.com/article/coronavirus-pandemic-health-religion-austin-texas-b8227807672374e6f99edfc851e191dd", "https://apnews.com/article/business-health-coronavirus-pandemic-e08a6e68308b27ad7653ca9210d953dc", "https://www.navy.mil/US-Navy-COVID-19-Updates/", "https://www.supremecourt.gov/opinions/21pdf/21a477_1bo2.pdf", "https://www.supremecourt.gov/DocketPDF/21/21A477/217841/20220307123349362_21A%20Texas%20Navy%20SEALS%20stay%20app.pdf", "https://www.charismaplusapp.com/", "mailto:robert.caggiano@charismamedia.com", "https://www.charismanews.com/newsletters/?utm_source=charismanews.com&utm_medium=mid-article%20text&utm_campaign=plg_cm_midarticletextinjector", "mailto:?subject=Check%20out%20this%20article&body=I%20read%20this%20article%20and%20wanted%20to%20share%20it%20with%20you:%20https%3A%2F%2Fwww.charismanews.com%2Fus%2F88762-texas-judge-grants-first-amendment-protection-for-navy-personnel", "mailto:webmaster@charismamedia.com?subject=Website correction for https://www.charismanews.com/us/88762-texas-judge-grants-first-amendment-protection-for-navy-personnel"], "authors": ["Jessica Gresko/Religion News Service"], "publish_date": "9:00AM EDT 3/30/2022"}