{"result_id": "061022", "URL": "https://www.charismanews.com/us/89633-biden-s-jab-mandate-continues-to-weaken-u-s-military-forces-devastate-loyal-american-families", "timestamp": "2023-04-25 14:36:06 CEST+0200", "meta": {"description": "Their religious freedoms are being trampled upon in the name of appeasing corporate and special interest groups.", "lang": "en", "keywords": "Joe Biden, jab, vaccine, mandate, podcast, Jared Laskey, loyal, American, family U.S. military, COVID-19", "favicon": "https://cdn.charismanews.com/favicons/apple-touch-icon.png", "canonical": "https://www.charismanews.com/us/89633-biden-s-jab-mandate-continues-to-weaken-u-s-military-forces-devastate-loyal-american-families", "encoding": "UTF-8"}, "image": null, "domain": "www.charismanews.com", "title": "Biden's Jab Mandate Continues to Weaken U.S. Military Forces, Devastates Loyal American Families", "cleaned_text": "Due to the COVID-19 emergency-authorized vaccines mandate, the U.S. military is pushing out close to 10% of its operating force. In a time of global crisis, wars and special interests influencing governmental decisions, men and women in uniform like Master Sergeant Nick Kupper are receiving their separation papers.\n\nNick has served the U. S. Air Force honorably for 19 years. He has about 13 months left before fulfilling a career of 20 years to receive full retirement benefits. The Air Force Times named him a servicemember of the year in 2017.\n\nHis wife, Crystal, and their children, including an adopted daughter with special needs, have been by his side through the years as he has trained and deployed overseas on behalf of the U.S. government. And even though he has had natural immunity exemptions for previous vaccines, the Department of Defense is pushing him out.\n\nThe medical care and benefits his family has received over the years is at risk as the Biden administration policies are enforced. However, Nick has been a voice of truth legally challenging the Emergency Use Authorization of the COVID-19 vaccines.\n\nIt is true that EUA is not the same as FDA approval. However, our U.S. military personnel are not being informed of the risks nor are they given any information as to what refusing the COVID-19 vaccine(s) would entail. They are being separated and this is a disservice to them and our nation. The mandates are an unlawful order which need to be fought in the courts.\n\nRecently, Kupper was a special guest on Tucker Carlson Tonight. Tucker said, \"Vaccine mandates have been immoral and un-American. But now we know after a year and a half how many people have been hurt by the vaccines ... The Biden administration is still using vaccine mandates, forcing tens of thousands of American servicemembers to leave because they won't take the COVID shot.\"\n\nMaster Sergeant Kupper said, \"In fact it's hundreds of thousands by the DOD's own numbers today. In the Air Force alone there are over 10,000 people including myself. I've been counting on this retirement for the last 19 years, but I am being separated because they won't grant me a religious exemption waiver. They are looking to kick me out. After 19 years they are going to throw everything away that I've worked for. But I am just one of hundreds of thousands of people who are getting kicked out because we won't take an illegal emergency use vaccine.\"\n\nTucker asked if it's true that the U.S. military is considering recruiting foreign nationals as they are currently unable to meet their recruitment goals. Kupper said, \"It's wild. The Army recently was considering recruiting people without having GEDs. That's how bad recruiting is getting. But at the last second that was scrapped after a lot of backlash.\"\n\nThe American military is being destroyed willingly from the inside out due to bad policies stemming from the White House. What should alarm every American is when Kupper said, \"Over 10% of the military is looking at being canned right now. If I were China or Russia, I'd be chomping at the bit right now.\"\n\nKupper, who is extremely healthy and has natural immunity due to COVID antibodies, further stated, \"I haven't been granted a religious waiver. But I think it is ironic that Secretary Austin was given a waiver by Congress to serve yet he refuses to give any of us a waiver to continue serving,\" a reference to Secretary of Defense Lloyd Austin.\n\nWatch this interview yourself and pray for America. Call your senator and congressional representatives to make a stand for our military that are being unjustly treated and separated. Their religious freedoms are being trampled on by the Biden administration who are gaslighting and appeasing corporate and special interest groups.\n\nJared and Rochelle Laskey co-founded Fireborn Ministries to teach believers how to live a daily Spirit-empowered life. You can find their resources and learn more about their ministry at firebornministries.com. They also have e-courses such as \"Entry Level Prophecy,\" \"The Last Days,\" \"The Baptism with the Holy Spirit\" and more on charismacourses.com, and the popular podcast Adventures in the Spirit, available on the Charisma Podcast Network and anywhere you listen to podcasts.\n\nTo contact us or to submit an article, click here.\n\nGet Charisma's best content delivered right to your inbox! Never miss a big news story again. Click here to subscribe to the Charisma News newsletter.", "opengraph": {"title": "Biden's Jab Mandate Continues to Weaken U.S. Military Forces, Devastates Loyal American Families", "url": "https://www.charismanews.com/us/89633-biden-s-jab-mandate-continues-to-weaken-u-s-military-forces-devastate-loyal-american-families", "type": "article", "site_name": "Charisma News", "locale": "en_US", "description": "Their religious freedoms are being trampled upon in the name of appeasing corporate and special interest groups.", "image": "https://cdn.charismanews.com/images/stories/2022/7/coronavirus_vaccine.jpg", "image:width": "618", "image:height": "340"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\">&#13;\n<p dir=\"ltr\" lang=\"en\">Biden's military is purging heroes like Air Force Master Sergeant Nick Kupper. <a href=\"https://twitter.com/RepThomasMassie?ref_src=twsrc%5Etfw\">@RepThomasMassie</a>, <a href=\"https://twitter.com/RepChipRoy?ref_src=twsrc%5Etfw\">@RepChipRoy</a>, and I are committed to fighting this injustice against patriots.<br/><br/>\"I was on Matt Gaetz's podcast (<a href=\"https://twitter.com/Firebrand_Pod?ref_src=twsrc%5Etfw\">@Firebrand_Pod</a>), and he's definitely been fighting for us.\" –MSgt Kupper <a href=\"https://t.co/NjcS5yEkhY\">pic.twitter.com/NjcS5yEkhY</a></p>&#13;\n— Rep. Matt Gaetz (@RepMattGaetz) <a href=\"https://twitter.com/RepMattGaetz/status/1544865590871031810?ref_src=twsrc%5Etfw\">July 7, 2022</a></blockquote>&#13;\n"], "movies": [], "links": ["https://twitter.com/RepThomasMassie?ref_src=twsrc%5Etfw", "https://twitter.com/RepChipRoy?ref_src=twsrc%5Etfw", "https://twitter.com/Firebrand_Pod?ref_src=twsrc%5Etfw", "https://t.co/NjcS5yEkhY", "https://twitter.com/RepMattGaetz/status/1544865590871031810?ref_src=twsrc%5Etfw", "https://www.charismapodcastnetwork.com/show/adventuresinthespirit", "https://www.charismapodcastnetwork.com/", "mailto:robert.caggiano@charismamedia.com", "https://www.charismanews.com/newsletters/?utm_source=charismanews.com&utm_medium=mid-article%20text&utm_campaign=plg_cm_midarticletextinjector", "mailto:?subject=Check%20out%20this%20article&body=I%20read%20this%20article%20and%20wanted%20to%20share%20it%20with%20you:%20https%3A%2F%2Fwww.charismanews.com%2Fus%2F89633-biden-s-jab-mandate-continues-to-weaken-u-s-military-forces-devastate-loyal-american-families", "mailto:webmaster@charismamedia.com?subject=Website correction for https://www.charismanews.com/us/89633-biden-s-jab-mandate-continues-to-weaken-u-s-military-forces-devastate-loyal-american-families"], "authors": ["Jared Laskey"], "publish_date": "1:00PM EDT 7/8/2022"}