{"result_id": "061031", "URL": "https://www.charismanews.com/us/89724-wife-of-military-member-we-are-terrified-for-our-children-s-future", "timestamp": "2023-04-25 14:36:25 CEST+0200", "meta": {"description": "Civilians need to know that the vaccine mandate for military families has made it a literal nightmare for thousands who love and serve their country.", "lang": "en", "keywords": "civilians, millitary, member, wife, vaccine, Biden administration, deployments, children, nightmare", "favicon": "https://cdn.charismanews.com/favicons/apple-touch-icon.png", "canonical": "https://www.charismanews.com/us/89724-wife-of-military-member-we-are-terrified-for-our-children-s-future", "encoding": "UTF-8"}, "image": null, "domain": "www.charismanews.com", "title": "Wife of Military Member: 'We Are Terrified for Our Children's Future'", "cleaned_text": "When my husband walked through the door last August 24 after finishing his shift, we locked eyes. He probably saw fear in mine, but I only saw resigned determination in his.\n\nWe both knew what had happened: the Secretary of Defense ordered all military members to get the COVID shot. Roll up your sleeve, or else. And I knew that, at least in this case, my man never would.\n\nThe past 11 months, in other words, have been fairly intense. We went from an ordinary military family―deployments, PCS's, honor, TDY's, promotion ceremonies, valor, Space A flights, TRICARE headaches, patriotism―to one in danger of losing nearly everything. When you're a (mostly) single-income family with young children, just a few hundred days from retirement, you don't make a decision raising the ire of an entire government lightly.\n\nIt's a battle that close to zero military spouses saw coming. In a nation that gives plenty of lip service to our \"military heroes,\" the way those heroes have been treated since politely telling their commanders no for the first time has been a spit-laced punch to the face.\n\nMy husband joined while still in high school, heavily influenced by a desire to serve his country. His dad and uncle fought in Vietnam, and the Sept. 11 terrorists had struck less than two years before. He was a small-town boy with big dreams, much like the hordes of bright-eyed youngsters who join every year. \"I want to make a difference,\" he would say during our long teenaged goodbyes on my front porch, boot camp looming. \"I think I can really help.\"\n\nHe immediately began doing just that, quickly making rank and racking up ribbons for his dress uniform. We married, and I discovered that military life was not exactly the swoony dream Hollywood portrayed.\n\nAll of my grandparents had fought directly or indirectly in World War II, and I had grown up listening to their starry-eyed stories of \"Rosie the Riveter,\" boxing on Navy ships, hunting Nazis and the deeply felt patriotism that permeated America. That's what military marriage would be like, I naively guessed.\n\nOf course, I was completely wrong. Deployments were lonely. I barely survived the first year of motherhood, as my husband received zero days off when I gave birth and then deployed a few months later. Moving overseas with several small children―away from any semblance of family support―tested me to my limits. TRICARE, while wonderful for your pocketbook, is a beast to handle, especially when your child has a medical file thicker than San Francisco fog. And I had it easy! My best friend gave birth to twins while her husband picked up body parts in Afghanistan. Others got that dreaded knock on the door.\n\nBesides, I loved America. I have been lucky enough to crisscross the globe and had seen firsthand how good U.S. citizens have it. On countless rough nights, I whispered through clenched teeth, \"Someone has to sacrifice. Freedom isn't free.\" I was willing to forgo my dream of stability, of recreating for my own children the Mayberry life my parents had given me. All the difficulties were worth it, I resolved, to support not only my man, but the very ideals my grandparents risked their lives for.\n\nOur sacrifices seemed to be paying off. We're nearing retirement, and my husband has a spotless record. He's even been honored nationally multiple times by major media outlets for what a military man should be. We have been counting on his pension, insurance and GI Bill for significant portions of our and our kids' futures.\n\nIn the last 11 months, I have talked to hundreds―perhaps thousands―of military families. The members reasons for refusing, as well as their demographics, are varied. Not a single one is afraid of needles (have you ever seen the thesis-length shot record of even one military member?) or is getting information from memes.\n\nThe common thread: almost without exception, they have perfect service records. They all love the United States. They want to preserve the liberty they grew up with. They're terrified for their children's futures.\n\nThese unvaccinated military members have had promotions snatched away; been left stranded overseas; had moves canceled; banned from unit functions; officially reprimanded and kicked out; openly mocked in formations; forced to live in hotels for months on end; separated from dependents; been newly-diagnosed with anxiety; even committed suicide. Their spouses and children, meanwhile, have been thrust into a hell not of their own making. Wives have miscarried; children have started seeing therapists; entire families have been imprisoned to certain locations on base or post; addictions have developed; marriages have teetered.\n\nBoth my mother and my husband's father begged him to take the vaccine. \"Do it for your family,\" they said. \"That's what a real man does, sacrifices himself, even if it means death.\"\n\nHe held me that night, the same arms that have been protecting me for two decades. \"Would it be morally OK for you to let men do what they wanted to your beautiful body, if it meant providing for our kids?\" he asked. When I shook my head, he said, \"Then why are people trying to tell me I have to do the same?\"\n\nAn American flag flies at the front of our house. A few days ago, a grommet broke, leaving the flag hanging awkwardly and in danger of falling completely. \"Quick, take it down!\" my husband texted. \"Don't let it touch the ground.\" Such reverence, I thought, for the symbol of a nation whose government is trying to destroy him.\n\nEven so, the spirit of that flag, in our calculation, is worth risking everything.\n\nTo contact us or to submit an article, click here.\n\nGet Charisma's best content delivered right to your inbox! Never miss a big news story again. Click here to subscribe to the Charisma News newsletter.", "opengraph": {"title": "Wife of Military Member: 'We Are Terrified for Our Children's Future'", "url": "https://www.charismanews.com/us/89724-wife-of-military-member-we-are-terrified-for-our-children-s-future", "type": "article", "site_name": "Charisma News", "locale": "en_US", "description": "Civilians need to know that the vaccine mandate for military families has made it a literal nightmare for thousands who love and serve their country.", "image": "https://cdn.charismanews.com/images/stories/2022/7/Military-family.jpg", "image:width": "618", "image:height": "340"}, "tags": [], "tweets": [], "movies": [], "links": ["mailto:robert.caggiano@charismamedia.com", "https://www.charismanews.com/newsletters/?utm_source=charismanews.com&utm_medium=mid-article%20text&utm_campaign=plg_cm_midarticletextinjector", "mailto:?subject=Check%20out%20this%20article&body=I%20read%20this%20article%20and%20wanted%20to%20share%20it%20with%20you:%20https%3A%2F%2Fwww.charismanews.com%2Fus%2F89724-wife-of-military-member-we-are-terrified-for-our-children-s-future", "mailto:webmaster@charismamedia.com?subject=Website correction for https://www.charismanews.com/us/89724-wife-of-military-member-we-are-terrified-for-our-children-s-future"], "authors": ["Crystal Kupper"], "publish_date": "2:00PM EDT 7/20/2022"}