{"result_id": "061034", "URL": "https://www.charismanews.com/culture/87932-are-vaccine-passports-mark-of-the-beast-franklin-graham-says-not-yet", "timestamp": "2023-04-25 14:36:31 CEST+0200", "meta": {"description": "\"If a scannable chip under the skin can contain vaccine information, adding other personal information and financial data could be a short step away.\"", "lang": "en", "keywords": "Franklin Graham, vaccine, vaccine passports, microchip, Sweden, COVID-19, mark of the beast, Revelation, Billy Graham", "favicon": "https://cdn.charismanews.com/favicons/apple-touch-icon.png", "canonical": "https://www.charismanews.com/culture/87932-are-vaccine-passports-mark-of-the-beast-franklin-graham-says-not-yet", "encoding": "UTF-8"}, "image": null, "domain": "www.charismanews.com", "title": "Are Vaccine Passports Mark of the Beast? Franklin Graham Says Not Yet", "cleaned_text": "Evangelist Franklin Graham knows many Christians are making the connection between the new microchips being implanted as a record of COVID-19 vaccination and the biblical mark of the beast—and he says it's natural to think that way. But Graham, president and CEO of the Billy Graham Evangelistic Association as well as Samaritan's Purse, has a word of both caution and reassurance.\n\nGraham posted about the microchips' potential connection to Revelation 13:16-17 this week in a lengthy Facebook post, noting: \"Christians around the world are wondering if COVID-19 is being used as a way to condition the world population to accept a mark like this, whatever form it may take. If a scannable chip under the skin can contain vaccine information, adding other personal information and financial data could be a short step away.\"\n\nIn words that echo his father, the late evangelist Billy Graham, Franklin added: \" This may sound frightening; but people who have put their faith in God and His Son, Jesus Christ, don't need to be afraid. We should not live in fear. God told us what was coming in His Word. Make sure that your name is written in the Lamb's Book of Life by repenting of your sins and putting your faith and trust in Jesus Christ.\"\n\nOver the course of the year, Graham has been vocal in his support of the COVID-19 vaccine, noting in a March Facebook post that, based on the Parable of the Good Samaritan in Scripture, he believes that \"yes, I think Jesus Christ would advocate for people using vaccines and medicines to treat suffering and save lives. ... So, my own personal opinion is from what we know, a vaccine can help save lives and prevent suffering. ... Since there are different vaccines available, my recommendation is that people do their research, talk to their doctor, and pray about it to determine which vaccine, if any, is right for them. My wife and I have both had the vaccine; and at 68 years old, I want to get as many more miles out of these old bones as possible!\"\n\nIn this week's post, however, Graham noted his concern that \"political leaders are using the pandemic as an excuse to exert more and more control. Many world leaders are still using COVID as an excuse to lock down their countries and it has a huge economic and social impact.\"\n\nFollow breaking news like this on our new platform, CHARISMA PLUS.\n\nTo contact us or to submit an article, click here.\n\nGet Charisma's best content delivered right to your inbox! Never miss a big news story again. Click here to subscribe to the Charisma News newsletter.", "opengraph": {"title": "Are Vaccine Passports Mark of the Beast? Franklin Graham Says Not Yet", "url": "https://www.charismanews.com/culture/87932-are-vaccine-passports-mark-of-the-beast-franklin-graham-says-not-yet", "type": "article", "site_name": "Charisma News", "locale": "en_US", "description": "\"If a scannable chip under the skin can contain vaccine information, adding other personal information and financial data could be a short step away.\"", "image": "https://cdn.charismanews.com/images/stories/2021/12/Graham_Microchip_SCMP.jpg", "image:width": "618", "image:height": "340"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.charismanews.com/world/87664-internet-of-bodies-or-mark-of-the-beast", "https://www.facebook.com/FranklinGraham/posts/459411138887819", "https://www.facebook.com/FranklinGraham/posts/276922917136643", "https://www.facebook.com/FranklinGraham/posts/459411138887819", "https://www.charismaplusapp.com/", "mailto:robert.caggiano@charismamedia.com", "https://www.charismanews.com/newsletters/?utm_source=charismanews.com&utm_medium=mid-article%20text&utm_campaign=plg_cm_midarticletextinjector", "mailto:?subject=Check%20out%20this%20article&body=I%20read%20this%20article%20and%20wanted%20to%20share%20it%20with%20you:%20https%3A%2F%2Fwww.charismanews.com%2Fculture%2F87932-are-vaccine-passports-mark-of-the-beast-franklin-graham-says-not-yet", "mailto:webmaster@charismamedia.com?subject=Website correction for https://www.charismanews.com/culture/87932-are-vaccine-passports-mark-of-the-beast-franklin-graham-says-not-yet"], "authors": ["Charisma News Staff"], "publish_date": "10:00AM EST 12/30/2021"}