{"result_id": "061040", "URL": "https://www.charismanews.com/culture/91573-religious-liberty-victories-guarantee-generational-impact", "timestamp": "2023-04-25 14:36:50 CEST+0200", "meta": {"description": "\"In 2023, with the Lord's blessings, we will achieve yet more victories for His people.\"", "lang": "en", "keywords": "Liberty Counsel, Joe Kennedy, coach, Supreme Court, religious freedom, religious liberty, victories, Shurtleff, Boston, Christian Flag", "favicon": "https://cdn.charismanews.com/favicons/apple-touch-icon.png", "canonical": "https://www.charismanews.com/culture/91573-religious-liberty-victories-guarantee-generational-impact", "encoding": "UTF-8"}, "image": null, "domain": "www.charismanews.com", "title": "Religious Liberty Victories Guarantee Generational Impact", "cleaned_text": "In its 33-year-history, the Liberty Counsel has scored numerous victories in court for religion freedom—from the right to assemble and worship, to sidewalk counselors' right to free speech outside abortion clinics and faith-based clubs' rights to meet on public school grounds.\n\nThis past year especially has seen a great deal of success for Liberty Counsel's kingdom battles, and the Christian ministry that proclaims, advocates, supports, advances and defends the Good News of Christ is making a generational impact with its legal efforts.\n\nIn May 2022, the U.S. Supreme Court ruled unanimously in Liberty Counsel's favor in its case of the \"Christian flag,\" Shurtleff v. the city of Boston. The high court said that Boston had violated the Constitution by censoring Camp Constitution's private flag in a public forum. The high court ruled that censoring the Christian flag was religious viewpoint discrimination and violated the First Amendment.\n\nIn Liberty Counsel's case of the \"Praying Coach,\" Kennedy v. Bremerton, the Supreme Court sided with Coach Joe Kennedy's right to pray on the football field, and in the process struck down the terrible 1971 decision in the Lemon v. Kurtman ruling, which has been used to censor religious speech, songs, Christmas cards, symbols, displays and even our national motto, \"In God We Trust.\"\n\nThese cases have opened a new day for:\n• Nativity displays and much more.\n\nAdditionally, Liberty Counsel continues to fight for the rights of individuals and companies who have been discriminated against when it comes to the federal COVID vaccine mandates.\n\nAnd Liberty Counsel vows it will not stop fighting for the rights of Christians and for religious freedom in this country, which was already supposed to be guaranteed by the Constitution.\n\n\"In 2023, with the Lord's blessings, we will achieve yet more victories for His people,\" says Liberty Counsel founder and Chairman Mat Staver.\n\nFor more of Liberty Counsel's tireless efforts, read this article at lc.org.\n\nShawn A. Akers is the online editor at Charisma Media.\n\nTo contact us or to submit an article, click here.\n\nGet Charisma's best content delivered right to your inbox! Never miss a big news story again. Click here to subscribe to the Charisma News newsletter.", "opengraph": {"title": "Religious Liberty Victories Guarantee Generational Impact", "url": "https://www.charismanews.com/culture/91573-religious-liberty-victories-guarantee-generational-impact", "type": "article", "site_name": "Charisma News", "locale": "en_US", "description": "\"In 2023, with the Lord's blessings, we will achieve yet more victories for His people.\"", "image": "https://cdn.charismanews.com/images/stories/2023/2/Wikipedia-Christian-Flag.jpg", "image:width": "618", "image:height": "340"}, "tags": [], "tweets": [], "movies": [], "links": ["https://mycharismashop.com/collections/subscriptions", "https://lc.org/newsroom/details/230221-this-victory-will-have-generational-impact", "mailto:robert.caggiano@charismamedia.com", "https://www.charismanews.com/newsletters/?utm_source=charismanews.com&utm_medium=mid-article%20text&utm_campaign=plg_cm_midarticletextinjector", "mailto:?subject=Check%20out%20this%20article&body=I%20read%20this%20article%20and%20wanted%20to%20share%20it%20with%20you:%20https%3A%2F%2Fwww.charismanews.com%2Fculture%2F91573-religious-liberty-victories-guarantee-generational-impact", "mailto:webmaster@charismamedia.com?subject=Website correction for https://www.charismanews.com/culture/91573-religious-liberty-victories-guarantee-generational-impact"], "authors": ["Shawn A. Akers"], "publish_date": "8:00AM EST 2/22/2023"}