{"result_id": "061023", "URL": "https://www.charismanews.com/us/89314-side-effects-from-moderna-shot-force-green-beret-purple-heart-recipient-into-medical-retirement", "timestamp": "2023-04-25 14:36:10 CEST+0200", "meta": {"description": "The COVID vaccine did what neither an artillery shell nor a round to the chest could do to this fearless 39-year veteran.", "lang": "en", "keywords": "veteran, Green Beret, Purple Heart, side effects, moderna, shot, vaccine, Liberty Counsel, retirement, medical", "favicon": "https://cdn.charismanews.com/favicons/apple-touch-icon.png", "canonical": "https://www.charismanews.com/us/89314-side-effects-from-moderna-shot-force-green-beret-purple-heart-recipient-into-medical-retirement", "encoding": "UTF-8"}, "image": null, "domain": "www.charismanews.com", "title": "Side Effects From Moderna Shot Force Green Beret Purple Heart Recipient Into Medical Retirement", "cleaned_text": "Lt. Col. Peter Chambers, a medical doctor, is one of only six flight surgeons attached to the legendary \"Green Beret\" Special Forces. For 39 years, Dr. Chambers served fearlessly throughout multiple harrowing combat tours.\n\nIn Afghanistan, he survived a direct artillery hit to his Humvee and got an AK-47 7.62mm round through his left arm that lodged in his ribcage after dragging the men from his shredded vehicle out of enemy fire.\n\nAs the only survivor of that dreadful attack, Chambers earned the Purple Heart and chose to return to full duty. His love for God and America drove him to continue his sacrificial service in the United States Army.\n\nChambers had every intention of continuing to serve his country and his fellow soldiers until he reached the 40-year mark of his career in 2023, at which time he would finally retire to civilian life. But Chambers will not reach that 40-year milestone because side effects from the Moderna shot did what neither an artillery shell nor a round to the chest could do.\n\nThe COVID \"vaccine\" permanently injured Chambers. He will now be medically retired this month, because of Biden's illegal mandate.\n\nChambers has been diagnosed with \"demyelination,\" a side effect that the FDA and the shot makers themselves knew about but failed to tell the world until a recent court order forced the FDA to release the COVID shot safety testing documentation. \"Demyelination\" as a side effect is listed on page 9.\n\nEach of the nerves in your body has a protective coating surrounding them. Much like the plastic coating on a lamp cord, the myelin sheath protects the nerve fibers. Just like a lamp cord, if this sheath is damaged or worn, the nerve fibers \"spark,\" creating intense, unmanageable pain throughout the body.\n\nWhen demyelination hits the nerves and synapses in the brain, it can cause severe migraines as well as cognitive impairment. As demyelination continues, the body suffers unspeakable and often unmanageable constant pain. Demyelination victims often report that their feet, hands, arms and legs feel as though acid is burning through their every muscle.\n\nThanks to the documentation the courts forced the FDA to release, we now know that both the pharmaceutical companies and the FDA knew about this injury and other debilitating and life-threatening side effects from the shots. But they told no one, and instead allowed the shot mandates to go forward.\n\nNo wonder the FDA wanted to wait 75 years to release the data! Thankfully, a federal court has ordered the data released at the rate of 55,000 pages rather than 500 pages per month—as the FDA requested. On March 1, a Pfizer document listed 1,291 adverse injuries from its shot—including demyelination.\n\nChambers says he \"trusted the science\" and trusted his government's \"safe and effective\" narrative when he was pressured to take the Moderna shot as per Joe Biden's military shot mandate. Had Chambers known the shots were neither safe nor effective, or had he known about the aborted fetal cell link, he would not have succumbed to the pressure.\n\nChambers' myelin sheath is now so severely worn that weather-related pressure changes and even being around 5G cell towers or networks can cause vertigo and make him dizzy.\n\nChambers testified in our landmark class action lawsuit (Navy SEAL 1 v. Austin) defending our brave military members against Biden's unlawful shot mandates. Liberty Counsel has filed for class certification to protect not only Chambers, but also every member of the United States military. I will write more about this as soon as I can.\n\nThe truth about the shots is getting out, thanks to lawsuits like the one Liberty Counsel is conducting on behalf of military members. Even many people who have previously been in favor of vaccines or who have had the COVID shot themselves now understand that the world has been duped.\n\nWith understanding comes responsibility. We must stop the unbelievable tyranny of shot mandates and Vaccine Passports so no one else winds up with every nerve in their body feeling as though it is on fire.\n\nAs we remember our fallen heroes, we must not let their sacrifices be in vain. Please, take a stand now to defend the freedom of the men and women who defend freedom—some of whom made the ultimate sacrifice.\n\nPlease help Liberty Counsel stand against the unconstitutional shot mandates. Freedom is never more than one generation from extinction.\n\nFor the original article, visit our content partners at lc.org.\n\nFollow breaking news like this on our new platform, CHARISMA PLUS.\n\nTo contact us or to submit an article, click here.\n\nGet Charisma's best content delivered right to your inbox! Never miss a big news story again. Click here to subscribe to the Charisma News newsletter.", "opengraph": {"title": "Side Effects From Moderna Shot Force Green Beret Purple Heart Recipient Into Medical Retirement", "url": "https://www.charismanews.com/us/89314-side-effects-from-moderna-shot-force-green-beret-purple-heart-recipient-into-medical-retirement", "type": "article", "site_name": "Charisma News", "locale": "en_US", "description": "The COVID vaccine did what neither an artillery shell nor a round to the chest could do to this fearless 39-year veteran.", "image": "https://cdn.charismanews.com/images/stories/2022/6/tired-doctor.jpg", "image:width": "618", "image:height": "340"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.lc.org/newsroom/details/220530-green-beret-purple-heart-downed-by-mandate", "https://www.charismaplusapp.com/", "mailto:robert.caggiano@charismamedia.com", "https://www.charismanews.com/newsletters/?utm_source=charismanews.com&utm_medium=mid-article%20text&utm_campaign=plg_cm_midarticletextinjector", "mailto:?subject=Check%20out%20this%20article&body=I%20read%20this%20article%20and%20wanted%20to%20share%20it%20with%20you:%20https%3A%2F%2Fwww.charismanews.com%2Fus%2F89314-side-effects-from-moderna-shot-force-green-beret-purple-heart-recipient-into-medical-retirement", "mailto:webmaster@charismamedia.com?subject=Website correction for https://www.charismanews.com/us/89314-side-effects-from-moderna-shot-force-green-beret-purple-heart-recipient-into-medical-retirement"], "authors": ["Mat Staver"], "publish_date": "9:00AM EDT 6/1/2022"}