{"result_id": "061001", "URL": "https://www.charismanews.com/culture/90031-christian-frontline-doctor-talks-covid-19-vaccine-from-a-spiritual-perspective", "timestamp": "2023-04-25 14:35:03 CEST+0200", "meta": {"description": "Since the explosive media coverage, she has refused to cower to their attacks and has fought for freedom in medical care.", "lang": "en", "keywords": "Shelby Lindsay, Dr. Stella Immanuel, COVID, vaccines, spiritual perspective, Strang Report, Stephen Strang", "favicon": "https://cdn.charismanews.com/favicons/apple-touch-icon.png", "canonical": "https://www.charismanews.com/culture/90031-christian-frontline-doctor-talks-covid-19-vaccine-from-a-spiritual-perspective", "encoding": "UTF-8"}, "image": null, "domain": "www.charismanews.com", "title": "Christian Frontline Doctor Talks COVID-19 Vaccine from a Spiritual Perspective", "cleaned_text": "Dr. Stella Immanuel is one of the original frontline doctors who spoke up with boldness at the beginning of the pandemic and went viral over her support of drug Hydroxychloroquine.\n\nFollowing her proclamation on the steps of the Supreme Court, Immanuel was harassed by physicians and the mainstream media for going against the World Health Organization (WHO) and the Food and Drug Administration (FDA).\n\nSince the explosive media coverage, she has refused to cower to their attacks and has fought for freedom in medical care.\n\nShe says that if you did receive the COVID vaccination, there are steps you can take to get the contents out of your system. Immanuel has a detox plan on her website as well as prayers against the effects and symptoms on your body.\n\nImmanuel has an active practice in Houston, Texas and is also the founder of Fire Power Ministries in Katy, Texas.\n\nIn a podcast episode of the \"Strang Report,\" Charisma Founder Stephen Strang talked with Immanuel about the conflicting reports that have come out from the CDC and Dr. Anthony Fauci's resignation. The podcast also includes her advice about how to combat adverse affects of taking the vaccine (which she calls \"the shot\") both practically, but also through prayer.\n\nShe says she has observed that people who have taken the vaccine are actually doing worse across the board than those who have not. There are reports of hundreds of perfectly healthy athletes and teenagers who are dropping dead out of the blue, and Immanuel claims it has to do with the COVID shot.\n\n\"The vaccine causes blood clots,\" Immanuel says. If you get a blood clot in your brain you can have a stroke, a blood clot in your heart can lead to a heart attack or a clot in your kidney can lead to kidney failure, and the list goes on.\n\nImmanuel isn't shy about the demonic influence she believes is behind the pandemic, and the tie between the end times and the satanic agenda to change genes through the widely pushed vaccine. She is also a pastor and founder of Fire Power Ministries. She is bold to say she believes in spiritual warfare.\n\n\"COVID was a genetically modified COVID strain,\" Immanuel says. As a physician who has given vaccines for years, she says the COVID vaccine is not a vaccine but gene therapy. \"I would not recommend it to my worst enemy,\" she says.\n\nImmanuel says this should not come as a surprise when you read through the Bible. In our interview with her, she told us that it is imperative for Christians globally to be prepared against the globalist agenda and whatever else may come.\n\n\"I do believe the seals of Revelation 6 have been opened, and people are not seeing this,\" Immanuel says.\n\nDr. Immanuel isn't the first, and won't be the last doctor to challenge government agencies. In her book, \"Let America Live\" Immanuel talks in-depth on the dark, spiritual agenda of the pandemic, the medial communities opposition to her treatment protocols and the natural forces threatening American's health and the future of the nation.\n\nIf you want a telehealth appointment to talk with a doctor about being prescribed Ivermectin or Hydroxychloroquine she has a section on her website to schedule an appointment with a doctor.\n\nShelby Lindsay is an assistant editor for Charisma Media.\n\nTo contact us or to submit an article, click here.\n\nGet Charisma's best content delivered right to your inbox! Never miss a big news story again. Click here to subscribe to the Charisma News newsletter.", "opengraph": {"title": "Christian Frontline Doctor Talks COVID-19 Vaccine from a Spiritual Perspective", "url": "https://www.charismanews.com/culture/90031-christian-frontline-doctor-talks-covid-19-vaccine-from-a-spiritual-perspective", "type": "article", "site_name": "Charisma News", "locale": "en_US", "description": "Since the explosive media coverage, she has refused to cower to their attacks and has fought for freedom in medical care.", "image": "https://cdn.charismanews.com/images/stories/2022/8/Stella-Immanuel.jpg", "image:width": "618", "image:height": "340"}, "tags": [], "tweets": [], "movies": [], "links": ["https://drstellamd.com/", "https://www.charismapodcastnetwork.com/show/strangreport/622630c0-5fc7-44e8-ba0e-d8040b6d965c/Dr.-Stella-Immanuel-Explains-Why-the-American-First-Doctors-Were-Right", "https://mycharismashop.com/products/let-america-live", "https://drstellamd.com/", "mailto:robert.caggiano@charismamedia.com", "https://www.charismanews.com/newsletters/?utm_source=charismanews.com&utm_medium=mid-article%20text&utm_campaign=plg_cm_midarticletextinjector", "mailto:?subject=Check%20out%20this%20article&body=I%20read%20this%20article%20and%20wanted%20to%20share%20it%20with%20you:%20https%3A%2F%2Fwww.charismanews.com%2Fculture%2F90031-christian-frontline-doctor-talks-covid-19-vaccine-from-a-spiritual-perspective", "mailto:webmaster@charismamedia.com?subject=Website correction for https://www.charismanews.com/culture/90031-christian-frontline-doctor-talks-covid-19-vaccine-from-a-spiritual-perspective"], "authors": ["Shelby Lindsay"], "publish_date": "5:30PM EDT 8/30/2022"}