{"result_id": "061033", "URL": "https://www.charismanews.com/culture/88906-why-the-fda-and-pfizer-covered-up-the-lies-about-the-covid-19-jabs", "timestamp": "2023-04-25 14:36:29 CEST+0200", "meta": {"description": "Despite the evidence, the mandates and vaccine passports continue. Do you still trust them?", "lang": "en", "keywords": "evidence, FDA, Pfizer, COVID-19 jabs, vaccines, Mat Staver, Liberty Counsel, death toll, immune system, weaken", "favicon": "https://cdn.charismanews.com/favicons/apple-touch-icon.png", "canonical": "https://www.charismanews.com/culture/88906-why-the-fda-and-pfizer-covered-up-the-lies-about-the-covid-19-jabs", "encoding": "UTF-8"}, "image": null, "domain": "www.charismanews.com", "title": "Why the FDA and Pfizer Covered Up the Lies About the COVID-19 Jabs", "cleaned_text": "Writer's Note: The recent Federal Drug Administration (FDA) data dump shows that both Pfizer and the FDA have known all along that what Liberty Counsel has been saying is true: the COVID jabs are not safe. Yet the push to vaccinate everyone continues. Vaccine passports present a clear and present danger to our freedom. We must stop them now! Read on to learn what we found and what you can do. — Mat Staver\n\nThe FDA attempted to keep Pfizer's COVID shot data secret for 75 years, but thankfully, a Texas federal judge said no way. Now we know why they did not want you to know the truth.\n\nThe first 55,000 pages of data were released March 2, and the second 11,000-plus pages were released April 1. They reveal that as early as February 28, 2021, Pfizer informed the FDA it had to hire 2,400 additional full-time employees to handle the shocking number of \"adverse events\" suffered by those receiving the shots. The FDA and Pfizer also knew about 1,291 serious side effects from the Pfizer shot alone.\n\nThe new information is infuriating, particularly considering the push for vaccine passports designed to keep \"the unvaccinated\" out of public life. Vaccine passports present a serious threat to freedom. If accepted, they will continue long after COVID. The implications are startling.\n\nJournalist Kim Iversen gave an overview of the following highlights from the 11,000 pages released by court order April 1. Everything below was admitted by Pfizer and was known by the FDA for over a year.\n\nNatural immunity works. Study participants who had natural immunity from a previous COVID infection were protected against future COVID exposure. Not a single case of severe COVID was reported from the participants with natural immunity.\n\nThe shots weaken the immune system. Pfizer knew that for seven days after the first injection, white blood cell counts drop sharply, disrupting natural immunity and making it more difficult for the body to fight off viruses, bacteria, illness and serious disease.\n\nThe true death toll is far higher than reported. People who died in the week following the first injection were improperly recorded as \"unvaccinated\" despite having received the shot. Thus, the number of deaths from the Pfizer shots was false and underreported.\n\nShot injuries are more common in younger groups. Pfizer admits the highest prevalence of shot injuries was found in people under 55. In fact, the number of adverse events increased as the age of shot takers decreased. Yet the FDA and CDC have been pushing propaganda campaigns to inject these age groups despite the evidence they are more likely to be harmed.\n\nPfizer lied about myocarditis. The shots have caused 10 TIMES more cases of myocarditis than Pfizer originally said.\n\nPfizer has no idea of the long-term side effects of these shots. Pfizer specifically notes it does not know the long-term effects on fertility, pregnancy, birth defects or safety for nursing children.\n\nPfizer cannot rule out Antibody-Dependent Enhancement (ADE). This is a phenomenon in which the shots cause a worse and more deadly reaction when the person later comes in contact with the virus. The FDA knew about this concern as early as October 22, 2020!\n\nFor over a year, Pfizer and the government knew how deadly these shots are, yet they withheld this information from the people.\n\nWorse, they LIED about it. And the U.S. government deployed vaccine mandates and embarked on a $1 billion propaganda campaign to convince people to get shots they knew were deadly.\n\nFor over a year \"fact checkers,\" many of whom worked for media sources who received some of that billion-dollar propaganda payout, marked messages such as Liberty Counsel's as \"fake news,\" while censoring truth-telling doctors, scientists and even people who were injured from the shots.\n\nDespite the evidence, the mandates and vaccine passports continue.\n\nIn New York City, unvaccinated individuals are not allowed to work in person or with the public. And the World Health Organization (WHO) has released \"guidance\" for all nations to participate in its global vaccine passport program. The WHO recommends this passport be used for domestic and international travel, as well as for jobs, school, events and social gatherings.\n\nIn other words, the WHO is recommending its vaccine passports to be used exactly as we warned — to limit movement and freedom.\n\nBut it's not just the WHO. The Biden administration released its vaccine passport push last year. As of this writing, 25 states plus the District of Columbia have developed or are considering digital vaccine credentials: Alaska, Arizona, California, Colorado, Connecticut, Delaware, Hawaii, Illinois, Kentucky, Louisiana, Massachusetts, Maryland, Minnesota, Mississippi, New Mexico, New Jersey, New York, Nevada, Oklahoma, Oregon, Rhode Island, South Carolina, Utah, Virginia and Washington.\n\nWe will not rest until the mandates are dropped and freedom is restored.\n\nLiberty Counsel was in court again Monday, defending military service members from Biden's unlawful shot orders. I will update you as soon as I can.\n\nFor the original article, visit our content partners at lc.org.\n\nRead articles like this one and other Spirit-led content in our new platform, CHARISMA PLUS.\n\nTo contact us or to submit an article, click here.\n\nGet Charisma's best content delivered right to your inbox! Never miss a big news story again. Click here to subscribe to the Charisma News newsletter.", "opengraph": {"title": "Why the FDA and Pfizer Covered Up the Lies About the COVID-19 Jabs", "url": "https://www.charismanews.com/culture/88906-why-the-fda-and-pfizer-covered-up-the-lies-about-the-covid-19-jabs", "type": "article", "site_name": "Charisma News", "locale": "en_US", "description": "Despite the evidence, the mandates and vaccine passports continue. Do you still trust them?", "image": "https://cdn.charismanews.com/images/stories/2022/4/covid_vaccine-hakan-nural-unsplash.jpg", "image:width": "618", "image:height": "340"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.lc.org/newsroom/details/220413-fda-and-pfizer-hid-this-from-you", "https://www.charismaplusapp.com/", "mailto:robert.caggiano@charismamedia.com", "https://www.charismanews.com/newsletters/?utm_source=charismanews.com&utm_medium=mid-article%20text&utm_campaign=plg_cm_midarticletextinjector", "mailto:?subject=Check%20out%20this%20article&body=I%20read%20this%20article%20and%20wanted%20to%20share%20it%20with%20you:%20https%3A%2F%2Fwww.charismanews.com%2Fculture%2F88906-why-the-fda-and-pfizer-covered-up-the-lies-about-the-covid-19-jabs", "mailto:webmaster@charismamedia.com?subject=Website correction for https://www.charismanews.com/culture/88906-why-the-fda-and-pfizer-covered-up-the-lies-about-the-covid-19-jabs"], "authors": ["Mat Staver/Liberty Counsel"], "publish_date": "1:00PM EDT 4/14/2022"}