{"result_id": "061029", "URL": "https://www.charismanews.com/opinion/88614-here-s-who-wants-to-track-you-american-citizens", "timestamp": "2023-04-25 14:36:20 CEST+0200", "meta": {"description": "Yes, big brother is watching closely. Very closely.", "lang": "en", "keywords": "big brother, World Health Organization, Liberty Counsel, COVID, track, passport, digital", "favicon": "https://cdn.charismanews.com/favicons/apple-touch-icon.png", "canonical": "https://www.charismanews.com/opinion/88614-here-s-who-wants-to-track-you-american-citizens", "encoding": "UTF-8"}, "image": null, "domain": "www.charismanews.com", "title": "Here's WHO Wants to Track You, American Citizens", "cleaned_text": "The World Health Organization has developed guidance and even technical specifications for member states to adopt \"interoperable standards\" for COVID-19 vaccine passports. Labeled \"interim guidance,\" the WHO's latest release pushes new digital vaccine passports to be used on a global scale.\n\nAlarmingly, the WHO website openly admits these personalized digital documents could \"eventually be extended to capture vaccination status to protect against other diseases\" and may \"be used for continuity of care or as proof of vaccination for purposes other than health care.\"\n\nUnder \"possible uses,\" the WHO recommends these COVID passports for work, university education and international travel, among other things.\n\nWHO's recommendation for COVID passport use in international travel is revealing, considering the International Health Regulations Emergency Committee on COVID-19 determined as far back as July 2021 that \"countries should not require proof of COVID-19 vaccination as a condition for international travel,\" a fact the WHO mentions in a brief footnote.\n\nFurther, the Biden administration has refused to comment on the status of the digital health passport program the White House announced on March 2, 2021. However, \"SMART health cards\" have already been deployed in dozens of states across the country.\n\nVaccine Credential Initiative (VCI), the group behind the SMART health cards, intends to fully participate with the WHO program. WHO officials did not give a release date, only commenting that news would be released \"soon.\"\n\nAlready, 22 states have adopted the SMART health cards, including red-leaning states like Louisiana and Mississippi.\n\nEven South Carolina, whose governor signed legislation barring state entities from developing or issuing vaccine passports, will be issuing SMART health cards by the end of the month, according to the state's immunization director, Steven White.\n\nIn Israel, until March 1, proof of vaccination has been required to enter grocery stores, restaurants, bars and \"cultural spaces,\" including the revered Western Wall. Life became very uncomfortable for unvaccinated Israelis, who were often quarantined without symptoms and even forbidden from taking their own garbage to the curb during routine quarantine when entering the country.\n\nIn Ontario, Canada, shoppers must show their vaccine passport or proof of vaccination in order to access everyday goods in a big-box store. Shoppers who flash a passport are allowed to shop at will. Unvaccinated shoppers, however, must be escorted by a store employee and are not allowed to buy anything other than \"essential items,\" as determined by the government.\n\nChina added COVID to its digital \"social credit\" passport, which includes even the most personal information like political party affiliation, amount of debt and shopping preferences. The red, yellow and green lights on the phone app dictate whether a person can enter shops or even leave their own home.\n\nNo one should be forced to take a minimally tested, highly dangerous, abortion-linked drug just to enjoy everyday freedom like grocery shopping or attending church. But that is exactly what tyrants in Washington, many states and globalists are pushing.\n\nYesterday, I was in federal court defending our men and women of the military against Joe Biden's unlawful shot mandates. I will update you on our landmark case Navy SEAL 1 v. Austin and what transpired in court as soon as I am able. Please remain in prayer for a good result.\n\nOur plates are still full helping tens of thousands of people facing unlawful shot mandates. This includes people facing loss of their jobs, discharge from the military and denial of medical treatment (including organ transplants).\n\nFor the original story, visit our content partners at lc.org.\n\nRead articles like this one and other Spirit-led content in our new platform, CHARISMA PLUS.\n\nTo contact us or to submit an article, click here.\n\nGet Charisma's best content delivered right to your inbox! Never miss a big news story again. Click here to subscribe to the Charisma News newsletter.", "opengraph": {"title": "Here's WHO Wants to Track You, American Citizens", "url": "https://www.charismanews.com/opinion/88614-here-s-who-wants-to-track-you-american-citizens", "type": "article", "site_name": "Charisma News", "locale": "en_US", "description": "Yes, big brother is watching closely. Very closely.", "image": "https://cdn.charismanews.com/images/stories/2022/3/COVID-passport.jpg", "image:width": "618", "image:height": "340"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.lc.org/newsroom/details/220311-who-wants-to-track-you-in-america", "https://www.charismaplusapp.com/", "mailto:robert.caggiano@charismamedia.com", "https://www.charismanews.com/newsletters/?utm_source=charismanews.com&utm_medium=mid-article%20text&utm_campaign=plg_cm_midarticletextinjector", "mailto:?subject=Check%20out%20this%20article&body=I%20read%20this%20article%20and%20wanted%20to%20share%20it%20with%20you:%20https%3A%2F%2Fwww.charismanews.com%2Fopinion%2F88614-here-s-who-wants-to-track-you-american-citizens", "mailto:webmaster@charismamedia.com?subject=Website correction for https://www.charismanews.com/opinion/88614-here-s-who-wants-to-track-you-american-citizens"], "authors": ["Mat Staver/Liberty Counsel"], "publish_date": "9:00AM EDT 3/14/2022"}