{"result_id": "061004", "URL": "https://www.charismanews.com/us/90376-three-christian-teachers-in-oregon-fired-over-vaccine-refusal", "timestamp": "2023-04-25 14:35:09 CEST+0200", "meta": {"description": "\"I wasn't going to use my faith at a convenience to keep a job.\"", "lang": "en", "keywords": "Oregon, Teachers, Fired, Vaccine Mandate, Faith, School Board, Fox & Friends", "favicon": "https://cdn.charismanews.com/favicons/apple-touch-icon.png", "canonical": "https://www.charismanews.com/us/90376-three-christian-teachers-in-oregon-fired-over-vaccine-refusal", "encoding": "UTF-8"}, "image": null, "domain": "www.charismanews.com", "title": "Three Christian Teachers in Oregon Fired over Vaccine Refusal", "cleaned_text": "Three teachers in Oregon have been fired for reportedly refusing to get the COVID vaccine, despite the state's teacher shortage. Bend-La Pine School District first put the teachers on unpaid leave a year ago and now they have decided in a 6-0 vote to fire the teachers.\n\nOregon Capital Chronicle says in schools across the state students are being taught by substitute teachers, emergency teachers and put in larger class sizes because of the lack of available teachers. Portland Public Schools has 226 open teaching and staff positions in their school.\n\nDespite the growing concern of teacher shortages, Bend-La Pine School District fired three of their teachers for refusing to get the vaccine or fill out a religious exemption form. Ensworth Elementary School teacher Kelly Lundy, La Pine Middle School teacher Zachary Webb and Mountain View High teacher Mark Schulz appeared on 'Fox & Friends' to talk about why they refused to fill out the religious exemption form.\n\n\"The school district is a secular institution...to request me for a statement of my faith, I wasn't going to use my faith at a convenience to keep a job,\" Lundy says.\n\nThe three teachers were hoping for support from their school district but did not receive any. In Aug. 2021, Oregon Governor Kate Brown announced two key changes to schools across the state. On top of requiring students wear masks, Brown says they would be \"ensuring all the adults around our students are fully vaccinated against COVID.\"\n\nBrown told the Oregon Health Authority to make this a rule statewide for all teachers and classrooms.\n\n\"We didn't want to give up our constitutional rights and were more [than] willing to allow our Lord and Savior Jesus Christ to get rubber-stamped along with everyone else's exceptions. And so, no, we didn't get the support, and it doesn't make any sense,\" Schultz says.\n\nOregon Moms Union posted on Twitter, \"In the wake of dismal summative assessment results, we are still firing teachers based on vaccination status even when the CDC says they no longer differentiate between vaccinated vs unvaccinated individuals.\"\n\nThe group collected over 1,000 signatures to demand the sate repeal the teacher and volunteer vaccine mandate.\n\nAmerican Enterprise Institute released a report showing public school teachers enroll their own children in private school at twice the rate than the general public. Economist Walter Williams raises questions at why so many public school teachers are now sending their own kids to private school.\n\n\"What would you think, after having accepted a dinner invitation, if you discovered that the owner, chef, waiters and busboys at the restaurant to which you were being take don't eat there? That would suggest they have some inside information from which you might benefit,\" Walter says.\n\nShelby Lindsay is an assistant editor for Charisma Media.\n\nTo contact us or to submit an article, click here.\n\nGet Charisma's best content delivered right to your inbox! Never miss a big news story again. Click here to subscribe to the Charisma News newsletter.", "opengraph": {"title": "Three Christian Teachers in Oregon Fired over Vaccine Refusal", "url": "https://www.charismanews.com/us/90376-three-christian-teachers-in-oregon-fired-over-vaccine-refusal", "type": "article", "site_name": "Charisma News", "locale": "en_US", "description": "\"I wasn't going to use my faith at a convenience to keep a job.\"", "image": "https://cdn.charismanews.com/images/stories/2022/10/OREGON_TEACHERS.jpg", "image:width": "618", "image:height": "340"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\">&#13;\n<p dir=\"ltr\" lang=\"en\">In the wake of dismal summative assessment results, we are still firing teachers based on vaccination status even when the CDC says they no longer differentiate between vaccinated vs unvaccinated individuals ‍♀️<br/><br/>This is why we petitioned <a href=\"https://twitter.com/OHAOregon?ref_src=twsrc%5Etfw\">@OHAOregon</a> over this outdated rule!!! <a href=\"https://t.co/NhhSusN6X4\">https://t.co/NhhSusN6X4</a></p>&#13;\n— Oregon Moms Union (@OregonMomsUnion) <a href=\"https://twitter.com/OregonMomsUnion/status/1577841442520989696?ref_src=twsrc%5Etfw\">October 6, 2022</a></blockquote>&#13;\n &#13;\n"], "movies": [], "links": ["https://www.foxnews.com/media/oregon-schools-fire-unvaccinated-teachers-doesnt-make-sense", "https://twitter.com/OHAOregon?ref_src=twsrc%5Etfw", "https://t.co/NhhSusN6X4", "https://twitter.com/OregonMomsUnion/status/1577841442520989696?ref_src=twsrc%5Etfw", "https://www.aei.org/carpe-diem/why-do-public-school-teachers-send-their-own-children-to-private-schools-at-a-rate-2x-the-national-average/", "https://mycharismashop.com/collections/subscriptions", "mailto:robert.caggiano@charismamedia.com", "https://www.charismanews.com/newsletters/?utm_source=charismanews.com&utm_medium=mid-article%20text&utm_campaign=plg_cm_midarticletextinjector", "mailto:?subject=Check%20out%20this%20article&body=I%20read%20this%20article%20and%20wanted%20to%20share%20it%20with%20you:%20https%3A%2F%2Fwww.charismanews.com%2Fus%2F90376-three-christian-teachers-in-oregon-fired-over-vaccine-refusal", "mailto:webmaster@charismamedia.com?subject=Website correction for https://www.charismanews.com/us/90376-three-christian-teachers-in-oregon-fired-over-vaccine-refusal"], "authors": ["Shelby Lindsay"], "publish_date": "5:00PM EDT 10/10/2022"}