{"result_id": "061015", "URL": "https://www.charismanews.com/us/84691-americans-rights-of-paramount-importance-covid-19-vaccinations-cannot-be-mandated", "timestamp": "2023-04-25 14:35:48 CEST+0200", "meta": {"description": "\"[I]f you decide to not receive it, it will not change your standard of medical care.\"", "lang": "en", "keywords": "COVID-19 Vaccine, medical care, America, rights, Liberty Counsel", "favicon": "https://cdn.charismanews.com/favicons/apple-touch-icon.png", "canonical": "https://www.charismanews.com/us/84691-americans-rights-of-paramount-importance-covid-19-vaccinations-cannot-be-mandated", "encoding": "UTF-8"}, "image": null, "domain": "www.charismanews.com", "title": "Americans' Rights of 'Paramount Importance': COVID-19 Vaccinations Cannot Be Mandated", "cleaned_text": "Federal law provides that at least until a vaccine is fully approved by the FDA, individuals must have the option to accept or decline the experimental drug.\n\nOn March 27, 2020, the Health and Human Services Secretary declared that circumstances exist justifying the authorization of emergency use (EUA) of drugs and biological products for COVID-19. That means people must be told the risks and benefits, and they have the right to decline a medication that is not fully licensed. The same section of the Federal Food, Drug, and Cosmetic Act that authorizes the FDA to grant EUA also requires the secretary of Health and Human Services to \"ensure that individuals to whom the product is administered are informed ... of the option to accept or refuse administration of the product.\"\n\nAll of the COVID-19 mRNA injections (Pfizer/BioNTech and Moderna) or vaccines (Johnson & Johnson and Astra Zeneca) have received only EAU authorization and not full FDA approval.\n\nWhen the FDA grants EUA for a vaccine, many questions about the product cannot be answered because the testing data is unavailable. Therefore, when Congress granted the authority to issue EUAs, it mandated that individuals must be allowed to decide for themselves whether to receive an EUA product. The FDA and Center for Disease Control and Prevention considered this fundamental requirement of choice important enough that even during the height of the COVID-19 pandemic, they reinforced that policy decision when issuing their guidance related to the experimental \"vaccines.\"\n\nDr. Amanda Cohn, executive secretary of the CDC's advisory committee on immunization practices, was asked if COVID-19 vaccination can be required. Cohn responded that under an EUA, \"vaccines are not allowed to be mandatory. So, early in this vaccination phase, individuals will have to be consented [sic] and they won't be able to be mandatory.\"\n\nThe EUAs for both the Pfizer/BioNTech and Moderna mRNA experimental injections and any other EUA vaccine require fact sheets to be given to vaccination providers and recipients. These fact sheets make clear that getting the vaccine is optional. For example, the one for recipients states, \"It is your choice to receive or not receive the COVID-19 vaccine,\" and if \"you decide to not receive it, it will not change your standard of medical care.\"\n\nThe so-called \"vaccines\" against COVID-19 have only been approved for experimental use. Much remains unknown about their safety and efficacy. It not only typically takes years to create a new vaccine, but most often, despite the best efforts of scientists, a successful vaccine proves impossible.\n\nFor example, scientists (including Dr. Anthony Fauci) tried to create an HIV vaccine for more than 40 years.\n\nEven though the FDA granted EUA for the Pfizer/BioNTech and Moderna mRNA injections in December 2020, and most recently Johnson & Johnson, the clinical trials the FDA will rely on to ultimately decide whether to license these vaccines are still underway and are designed to last for approximately two years to collect adequate data to establish if these mRNA injections and vaccines are safe and effective enough for the FDA to license.\n\nGiven the uncertainty, the EUAs are explicit that each is \"an investigational vaccine not licensed for any indication\" and that all \"promotional material relating to the COVID-19 Vaccine clearly and conspicuously ... state that this product has not been approved or licensed by the FDA, but has been authorized for emergency use by FDA\" (emphasis added).\n\nLast week, a coalition of four U.S.-based medical organizations, including the American College of Pediatricians, Catholic Medical Association, Christian Medical and Dental Association and the National Association of Catholic Nurses–USA, representing approximately 20,000 healthcare professionals, emphasized that free citizens should never be mandated to receive the coronavirus \"vaccine.\"\n\nIn their statement they said, \"Governing authorities must respect an individual's right to accept or decline a vaccine,\" adding that there is \"no justifiable moral obligation to accept vaccination. While the pandemic remains a significant public health crisis, the individual rights of American citizens also remain of paramount importance,\" the statement reads. \"The guarantee of 'life, liberty and the pursuit of happiness' includes the right to make individual health care decisions while taking into account our responsibility for the common good.\n\n\"If a vaccine has been developed, tested or produced with technology that an individual deems morally unacceptable, such as the use of abortion-derived fetal cell lines, vaccine refusal is morally acceptable,\" the statement reads. \"An individual's decision to be vaccinated will also depend upon their personal assessment of the medical risks, a choice that should be respected,\" their joint statement read.\n\nIn addition to this federal law, the FDA includes the Nuremberg Code and the Helsinki Declaration on its website, emphasizing the fact that people cannot be forced to take experimental drugs without their full consent. Learn more at lc.org/vaccine.\n\nLiberty Counsel founder and chairman Mat Staver said, \"Forcing any person to receive one of these COVID injections is a violation of federal law. The COVID injections are not licensed by the FDA and are still in the investigation and experimental phase. No employer or government may force or coerce anyone to take these injections. Federal law requires full informed consent.\"\n\nFollow breaking news like this and more in our new platform, CHARISMA PLUS.\n\nTo contact us or to submit an article, click here.\n\nGet Charisma's best content delivered right to your inbox! Never miss a big news story again. Click here to subscribe to the Charisma News newsletter.", "opengraph": {"title": "Americans' Rights of 'Paramount Importance': COVID-19 Vaccinations Cannot Be Mandated", "url": "https://www.charismanews.com/us/84691-americans-rights-of-paramount-importance-covid-19-vaccinations-cannot-be-mandated", "type": "article", "site_name": "Charisma News", "locale": "en_US", "description": "\"[I]f you decide to not receive it, it will not change your standard of medical care.\"", "image": "https://cdn.charismanews.com/images/2021/1/covid_vaccine-hakan-nural-unsplash.jpg", "image:width": "618", "image:height": "340"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.fda.gov/emergency-preparedness-and-response/mcm-legal-regulatory-and-policy-framework/emergency-use-authorization", "https://www.fda.gov/media/97321/download", "https://acpeds.org/press/joint-statement-on-vaccines-and-conscience-protection", "https://lc.org/vaccine", "https://lc.org/newsroom/details/030921-experimental-covid-shots-cannot-be-mandated", "https://www.charismaplusapp.com/", "mailto:robert.caggiano@charismamedia.com", "https://www.charismanews.com/newsletters/?utm_source=charismanews.com&utm_medium=mid-article%20text&utm_campaign=plg_cm_midarticletextinjector", "mailto:?subject=Check%20out%20this%20article&body=I%20read%20this%20article%20and%20wanted%20to%20share%20it%20with%20you:%20https%3A%2F%2Fwww.charismanews.com%2Fus%2F84691-americans-rights-of-paramount-importance-covid-19-vaccinations-cannot-be-mandated", "mailto:webmaster@charismamedia.com?subject=Website correction for https://www.charismanews.com/us/84691-americans-rights-of-paramount-importance-covid-19-vaccinations-cannot-be-mandated"], "authors": ["Liberty Counsel"], "publish_date": "4:00PM EST 3/10/2021"}