{"result_id": "061008", "URL": "https://www.charismanews.com/opinion/88510-vaccine-passports-are-here-what-will-you-do", "timestamp": "2023-04-25 14:35:24 CEST+0200", "meta": {"description": "More than 21 states, as well as the District of Columbia and Puerto Rico, have adopted some form of a digital vaccine passport.", "lang": "en", "keywords": "vaccines, vaccine passport, COVID-19, vaccine mandate, freedom, religious freedom, Mat Staver, Liberty Counsel, petition, fax", "favicon": "https://cdn.charismanews.com/favicons/apple-touch-icon.png", "canonical": "https://www.charismanews.com/opinion/88510-vaccine-passports-are-here-what-will-you-do", "encoding": "UTF-8"}, "image": null, "domain": "www.charismanews.com", "title": "Vaccine Passports Are Here; What Will You Do?", "cleaned_text": "More than 21 states have or are in the process of adopting vaccine passports. In America, these passports have been used to exclude people from restaurants, gyms and public places. In Quebec, the unvaccinated are escorted while in big-box stores and can only purchase pharmaceuticals.\n\nAlthough Israel will roll back its Green Pass on Mar. 1, since Feb. 21, 2021, it has restricted access to those who do not have the shots. I warned about this nearly two years ago, and now vaccine passports are here. But we can still stop them if we act now. — Liberty Counsel founder and Chairman Mat Staver\n\nOn Feb. 21, 2021, the Israeli government began implementing COVID vaccine passports—one of the first nations in the world to do so, that is after China. Aware that its citizenry would resist a government-forced vaccine, Sheba Medical Center Chief Medical Officer and Chief Innovation Officer Dr. Eyal Zimlichman instructed the Israeli Knesset how citizens could be coerced into taking it.\n\nAt that time, Zimlichman told the Special Knesset Coronavirus Committee, \"you can't force the population; it won't work. ... What is possible is to create motivation.\"\n\nZimlichman's plan to \"motivate\" the citizenry was to simply bar the unvaccinated from the pleasures and necessities of daily life, and/or make attending such functions so difficult and uncomfortable that people would \"understand by themselves that the vaccine will return them to regular life, and they'll vaccinate themselves.\"\n\nThis same, psychological manipulation is in full force here in America.\n\nConservative commentator Mike Cernovich summarized it best, saying, \"Government won't force you to take [the] vaccine. Amazon will. Airlines will. Banks will. You won't be able to buy, sell or trade without the vaccine.\"\n\nProof of vaccination in Israel was required to enter grocery stores, restaurants, bars and \"cultural spaces,\" including the Western Wall. Life became very uncomfortable for unvaccinated Israelis, who were often quarantined without symptoms, and forbidden from even taking their own garbage to the curb.\n\nFifteen months later, Israel has one of the highest vaccination rates in the world. The compulsion campaign worked. By the way, Israel also has the highest per capita infection rate in the world. The vax has not worked!\n\nCloser to home, Canadians in Quebec must show their vaccine passport to access everyday services. Unvaccinated shoppers in big-box stores (over 16,146 sq. ft.) must be escorted by an employee and are not allowed to buy whatever they want like vaccinated shoppers.\n\nIn stores like Walmart, the unvaccinated cannot buy and the stores cannot sell most of their goods. For now, food, gas and pharmaceuticals are exempt.\n\nThis same sort of vaccination campaign is gaining ground in America.\n\nOn Mar. 2, 2021, the Biden administration held a \"COVID-19 Vaccine Credentials Discussion.\" The purpose was implementation of a domestic and international vaccine passport that will report directly to the White House.\n\nNow more than 21 states, as well as the District of Columbia and Puerto Rico, have adopted some form of a digital vaccine passport. One leading digital service called the \"Smart Health Card\" was developed by the Vaccination Credential Initiative, a group Forbes magazine calls \"a global coalition of public and private stakeholders including Microsoft, Salesforce, Oracle, the Mayo Clinic and other health and tech heavyweights.\"\n\nThe Smart Health Card stores personal details, including name, date of birth, health details and vaccination record, in a small digital picture or mark called a QR code that is to be stored on a person's phone. There are several other digital service providers that offer similar services with more likely on the way.\n\nEven \"red\" states like Arizona, Mississippi, South Carolina, Utah and West Virginia are getting on board with digital vaccine credentials despite concerns that the systems and restrictions are reminiscent of not being able to buy or sell as stated in Revelation 16. South Carolina's program will go live within weeks.\n\nCorporate giants like Walmart, Walgreens, CVS and Kroger have gotten on board, offering digital passports at their stores.\n\nWe have a short window to stop this commercialized medical tyranny.\n\nSend faxes now to stop the vaccine passports, and sign our petition to state and federal lawmakers.\n\nRead articles like this one and other Spirit-led content in our new platform, CHARISMA PLUS.\n\nTo contact us or to submit an article, click here.\n\nGet Charisma's best content delivered right to your inbox! Never miss a big news story again. Click here to subscribe to the Charisma News newsletter.", "opengraph": {"title": "Vaccine Passports Are Here; What Will You Do?", "url": "https://www.charismanews.com/opinion/88510-vaccine-passports-are-here-what-will-you-do", "type": "article", "site_name": "Charisma News", "locale": "en_US", "description": "More than 21 states, as well as the District of Columbia and Puerto Rico, have adopted some form of a digital vaccine passport.", "image": "https://cdn.charismanews.com/images/stories/2022/3/LC_Vaccine_Passports_jeremy-bezanger_unsplash.jpg", "image:width": "618", "image:height": "340"}, "tags": [], "tweets": [], "movies": [], "links": ["https://lc.org/lcemail/elc2006faxnmvdonate?t=ELC2006-FaxNMV&c=ELC2006-FaxNMV", "https://lc.org/lcemail/elc2006-pet-nmv", "https://lc.org/newsroom/details/220301-digital-passports-are-now-here", "https://www.charismaplusapp.com/", "mailto:robert.caggiano@charismamedia.com", "https://www.charismanews.com/newsletters/?utm_source=charismanews.com&utm_medium=mid-article%20text&utm_campaign=plg_cm_midarticletextinjector", "mailto:?subject=Check%20out%20this%20article&body=I%20read%20this%20article%20and%20wanted%20to%20share%20it%20with%20you:%20https%3A%2F%2Fwww.charismanews.com%2Fopinion%2F88510-vaccine-passports-are-here-what-will-you-do", "mailto:webmaster@charismamedia.com?subject=Website correction for https://www.charismanews.com/opinion/88510-vaccine-passports-are-here-what-will-you-do"], "authors": ["Liberty Counsel"], "publish_date": "3:00PM EST 3/1/2022"}