{"result_id": "061045", "URL": "https://www.charismanews.com/us/88251-the-fight-s-not-over-for-new-york-healthcare-workers-wanting-vaccine-exemption", "timestamp": "2023-04-25 14:37:00 CEST+0200", "meta": {"description": "The conflict between Gov. Hochul's will and federal law is now beyond dispute.", "lang": "en", "keywords": "Thomas More Society, vaccine mandates, New York, religious exemptions, healthcare workers, Governor Hochul, Supreme Court, courts", "favicon": "https://cdn.charismanews.com/favicons/apple-touch-icon.png", "canonical": "https://www.charismanews.com/us/88251-the-fight-s-not-over-for-new-york-healthcare-workers-wanting-vaccine-exemption", "encoding": "UTF-8"}, "image": null, "domain": "www.charismanews.com", "title": "The Fight's Not Over for New York Health Care Workers Wanting Vaccine Exemption", "cleaned_text": "A group of New York health care workers being persecuted for their religious objections to the COVID-19 vaccine is seeking a new injunction after a United States Supreme Court ruling in a federal healthcare lawsuit. Thomas More Society attorneys filed a renewed motion on Jan. 30, 2022, seeking emergency and preliminary injunctive relief against the state for the health professionals in United States District Court. New York Gov. Kathy Hochul and her administration were ordered by Judge David Hurd to respond by Feb. 11, and the health care workers will have until Feb. 18 to reply.\n\nThe lawsuit centers around the state of New York's refusal to honor religious exemptions for the health care worker COVID-19 vaccine mandate. The filing is in light of the Supreme Court's Jan. 13 decision upholding the Biden administration's COVID-19 vaccine mandate for Medicaid and Medicare-participating health care facilities, for which the high court acknowledged religious exemptions.\n\nThomas More Society attorneys filed the renewed motion, along with an amended complaint on behalf of New York doctors, nurses and other medical professionals who hold religious objections to the COVID vaccine. The health workers received an original preliminary injunction against Hochul's categorical ban on religious exemptions to COVID-19 vaccination in October 2021 from the district court. The United States Court of Appeals for the 2nd Circuit vacated that decision shortly thereafter. A subsequent emergency appeal to the United States Supreme Court was denied, though accompanied by a strong dissent from Justice Neil Gorsuch who wrote of the high court that, \"we fail ourselves,\" by not granting the motion.\n\n\"Gov. Hochul's now obviously pointless vaccination crusade contradicts, not only Title VII, but the Centers for Medicare and Medicaid Services mandate, both of which require what she refuses to allow: religious exemptions from COVID-19 vaccination,\" said Thomas More Society Special Counsel Christopher Ferrara.\n\n\"The 2nd Circuit did not have benefit of the federal healthcare mandate in holding that Title VII permits only 'accommodations' under Hochul's mandate, but not 'exemptions.' The two terms are equivalent, as the federal mandate makes clear,\" Ferrara added.\n\nThe original lawsuit emphasized that the New York mandate's direct conflict with the required religious accommodations afforded under Title VII of the federal Civil Rights Act of 1964 and the necessary neutrality compelled by the Free Exercise Clause of the First Amendment.\n\n\"The conflict between Gov. Hochul's will and federal law is now beyond dispute. The entire situation has been a nightmare for these medical professionals who were once hailed as the heroes of the pandemic,\" said Ferrara. \"These doctors, nurses and other health workers were terminated or voluntarily resigned from their employment as a result of their religious inability to obtain the vaccine. One lost his private practice partnership, one moved out of state, and five submitted under duress to initial COVID-19 vaccination to avoid losing their employment but continue to religiously oppose additional booster shots as are now additionally required as of Jan. 21, 2022. The 16 health care heroes who remain in New York are in dire need of immediate relief to avoid further violations of their constitutional rights, ongoing unemployment and/or imminent additional violations of their religiously formed consciences.\"\n\nAs the group of medical professionals prepare a regular appeal to the Supreme Court from the proceedings last fall, that court's decision in the federal healthcare vaccine mandate case requires that covered medical facilities, including those in New York, protect the ability to seek \"religious exemptions.\" That is the basis for the renewed motion for injunctive relief in the district court.\n\nThe new filings report that it has become apparent that COVID vaccines do not prevent transmission of the virus, and that health care professionals across the state are contracting COVID and are required to quarantine, but then are required to return to work after only five days per new Centers for Disease Control and Prevention guidance on self-isolation. And because of vaccine failure, the guidance now also provides that both unvaccinated and vaccinated workers infected by the virus can return to work, even if \"mildly symptomatic,\" in order to address a staffing crisis.\n\nThe filed motion noted that \"it has now become obvious that New York's COVID-19 vaccine mandate is utterly ineffective and counterproductive. It notably provoked the firing or forced resignations of 37,000 health care workers across New York, only to be followed by Gov. Hochul declaring a statewide crisis in health care staffing. And the prevailing science now shows that COVID-19 vaccination does not prevent health care workers from getting and transmitting the virus (especially the now-dominant omicron variant).\"\n\n\"This farce must be brought to an end,\" declared Ferrara. \"As jurisdictions in 47 states and around the world have refused to adopt or have abandoned such draconian vaccine mandates, New York's governor and her health bureaucrats are in need of adult supervision regarding respect for religious freedom.\"\n\nThe health care workers are represented by Ferrara, along with Thomas More Society Senior Counsel Steve Crampton and Counsel Michael McHale.\n\nRead the First Amended Verified Complaint filed with the United States District Court for the Northern District of New York on Jan. 30, 2022, by Thomas More Society attorneys in Dr. A, et al. v. Kathy Hochul, Governor of the State of New York, et al. here, along with the accompanying Memorandum of Law in Support of Plaintiffs' Renewed Motion for a Temporary Restraining Order and a Preliminary Injunction here.\n\nRead more about the Thomas More Society attorneys' actions on behalf of New York's professional health workers with religious objections to the state's mandatory COVID-19 vaccine here.\n\nThe Thomas More Society is a national not-for-profit law firm dedicated to restoring respect in law for life, family and religious liberty. Headquartered in Chicago and with offices across the country, the Thomas More Society fosters support for these causes by providing high quality pro bono legal services from local trial courts all the way up to the United States Supreme Court. For more information, visit thomasmoresociety.org.\n\nRead articles like this one and other Spirit-led content in our new platform, CHARISMA PLUS.\n\nTo contact us or to submit an article, click here.\n\nGet Charisma's best content delivered right to your inbox! Never miss a big news story again. Click here to subscribe to the Charisma News newsletter.", "opengraph": {"title": "The Fight's Not Over for New York Health Care Workers Wanting Vaccine Exemption", "url": "https://www.charismanews.com/us/88251-the-fight-s-not-over-for-new-york-healthcare-workers-wanting-vaccine-exemption", "type": "article", "site_name": "Charisma News", "locale": "en_US", "description": "The conflict between Gov. Hochul's will and federal law is now beyond dispute.", "image": "https://cdn.charismanews.com/images/Doctors_luis-melendez-Pd4lRfKo16U-unsplash.jpg", "image:width": "618", "image:height": "340"}, "tags": [], "tweets": [], "movies": [], "links": ["https://thomasmoresociety.org/wp-content/uploads/2022/01/Filed-Amended-Complaint-121cv1009-01302022.pdf", "https://thomasmoresociety.org/wp-content/uploads/2022/01/Filed-Memo-in-Support-of-Renewed-Motion-for-TRO-PI-121cv1009-01302022.pdf", "https://thomasmoresociety.org/client/ny-medical-workers-against-vaccine-mandate/", "http://www.thomasmoresociety.org/", "https://www.charismaplusapp.com/", "mailto:robert.caggiano@charismamedia.com", "https://www.charismanews.com/newsletters/?utm_source=charismanews.com&utm_medium=mid-article%20text&utm_campaign=plg_cm_midarticletextinjector", "mailto:?subject=Check%20out%20this%20article&body=I%20read%20this%20article%20and%20wanted%20to%20share%20it%20with%20you:%20https%3A%2F%2Fwww.charismanews.com%2Fus%2F88251-the-fight-s-not-over-for-new-york-healthcare-workers-wanting-vaccine-exemption", "mailto:webmaster@charismamedia.com?subject=Website correction for https://www.charismanews.com/us/88251-the-fight-s-not-over-for-new-york-healthcare-workers-wanting-vaccine-exemption"], "authors": ["Thomas More Society"], "publish_date": "3:00PM EST 2/1/2022"}