{"result_id": "061020", "URL": "https://www.charismanews.com/us/90677-trump-needs-to-read-the-room-and-exercise-humility-if-he-wants-his-base-to-support-him-in-2024", "timestamp": "2023-04-25 14:36:02 CEST+0200", "meta": {"description": "Ahead of Trump's anticipated Tuesday announcement, conservative Candace Owens questions former president's leadership.", "lang": "en", "keywords": "All Israel News, Standing With Israel, Donald Trump, read the room, exercise humility, Candace Owens, COVID, presidential announcement", "favicon": "https://cdn.charismanews.com/favicons/apple-touch-icon.png", "canonical": "https://www.charismanews.com/us/90677-trump-needs-to-read-the-room-and-exercise-humility-if-he-wants-his-base-to-support-him-in-2024", "encoding": "UTF-8"}, "image": null, "domain": "www.charismanews.com", "title": "Trump Needs to 'Read the Room' and 'Exercise Humility if He Wants His Base to Support Him in 2024", "cleaned_text": "With Donald Trump poised to make a much anticipated announcement on Tuesday, a conservative commentator said last week that the former president needs to \"read the room\" and \"exercise humility\" in order to win back his supporters.\n\nDuring her show on The Daily Wire, Candace Owens said that Trump has missed the point that some of his base has turned on him because he promotes the COVID vaccine.\n\n\"He should have tried to understand why the base was so upset with him which would have led him to the fact that his base is not pro-COVID vaccine,\" Owens explained in her seven-minute riff. \"It's that simple—I understood that. I could have told him that. But at that moment, I realize that he's not listening.\"\n\nOwens, who said she has spent years defending Trump, noted that much of Trump's base is upset that the former president has failed to reject the vaccine whose production he fast tracked.\n\nDuring his last year in office, Trump responded to the COVID pandemic by allowing pharmaceutical companies to speed up certain steps and trials in order to get the nascent vaccine to market. Most nations—including the United States—mandated this injection as a prerequisite for employment, schooling and military service in the public and private sectors. Many Americans, particularly conservatives, resisted these mandates, driving a wedge between Trump and his base.\n\nTrump seemed to have turned on Owens, however, over a misleading headline that appeared in the Daily Beast which read, \"Candace Owens: Trump is Pro-Vax Because He's 'Too Old' to Understand the Internet.\"\n\n\"I never once called Trump 'too old.' I never once said Trump could not understand the internet. And yet, somehow, he got that information and believed it to be true,\" Owens said. \"Actually, what I was saying was a defense of him so that his supporters would still believe in him.\"\n\nHe then became \"rude\" to her, Owens said, after this article was published. She added that she felt the need to share \"this personal story because I think it is something that made me, for the first time, question him as a person.\"\n\n\"I've realized that these discussions that everybody is having, these conservative influencers people are having behind Trump's back, should be also had with the public as well,\" Owens said.\n\nLately, Trump appears to be distrustful and vengeful after years of excoriation at the hands of what he calls the \"fake news\" media, Owens said.\n\n\"He has every right to be angry. But if you stay at a place of anger you are ignoring everything that is going on around you. You're no longer looking and assessing things in the way that you should be assessing them because you're holding on to this almost vengeful spirit,\" she said. \"That is the question that I have with Trump. Is he going to get over the trauma of the election of 2020 and begin to paint a vision for 2024?\"\n\nShe also said that Trump's \"trepidation,\" even \"paranoia,\" is showing with his recent attacks on Florida Gov. Ron DeSantis, who is a rising star among conservatives and likely to peel support from Trump due to his state's anti-COVID policies.\n\n\"They're wondering about what the leadership looks like and I am not at all under any impression that Trump can't win in 2024,\" Owens said. \"What I am saying is that Trump needs to take a good look in the mirror.\"\n\nOwens stopped short of counting out support of Trump but did say that he needs to recalibrate. She speculated whether Trump would evoke the same energy and response as he did ahead of the 2016 run and wondered what his vision for the country will be if he truly embarks on a 2024 run.\n\n\"It needs to be more than, 'I'm back,'\" she said.\n\nFor the original article, visit our content partners at allisrael.com.\n\nNicole Jansezian is the news editor for both ALL ISRAEL NEWS and ALL ARAB NEWS and senior correspondent for ALL ISRAEL NEWS.\n\nTo contact us or to submit an article, click here.\n\nGet Charisma's best content delivered right to your inbox! Never miss a big news story again. Click here to subscribe to the Charisma News newsletter.", "opengraph": {"title": "Trump Needs to 'Read the Room' and 'Exercise Humility if He Wants His Base to Support Him in 2024", "url": "https://www.charismanews.com/us/90677-trump-needs-to-read-the-room-and-exercise-humility-if-he-wants-his-base-to-support-him-in-2024", "type": "article", "site_name": "Charisma News", "locale": "en_US", "description": "Ahead of Trump's anticipated Tuesday announcement, conservative Candace Owens questions former president's leadership.", "image": "https://cdn.charismanews.com/images/stories/2022/11/Candace-Owens.jpg", "image:width": "618", "image:height": "340"}, "tags": [], "tweets": [], "movies": [], "links": ["https://mycharismashop.com/collections/subscriptions", "https://allisrael.com/trump-needs-to-read-the-room-and-exercise-humility-if-he-wants-his-base-to-support-him-in-2024", "mailto:robert.caggiano@charismamedia.com", "https://www.charismanews.com/newsletters/?utm_source=charismanews.com&utm_medium=mid-article%20text&utm_campaign=plg_cm_midarticletextinjector", "mailto:?subject=Check%20out%20this%20article&body=I%20read%20this%20article%20and%20wanted%20to%20share%20it%20with%20you:%20https%3A%2F%2Fwww.charismanews.com%2Fus%2F90677-trump-needs-to-read-the-room-and-exercise-humility-if-he-wants-his-base-to-support-him-in-2024", "mailto:webmaster@charismamedia.com?subject=Website correction for https://www.charismanews.com/us/90677-trump-needs-to-read-the-room-and-exercise-humility-if-he-wants-his-base-to-support-him-in-2024"], "authors": ["Nicole Janesezian/All Israel News"], "publish_date": "12:00PM EST 11/14/2022"}