{"result_id": "061044", "URL": "https://www.charismanews.com/us/88750-the-white-house-s-plan-to-trace-track-and-control-every-american", "timestamp": "2023-04-25 14:36:58 CEST+0200", "meta": {"description": "Digital health passports will be a reality unless you help do something about it.", "lang": "en", "keywords": "digital health passport, Liberty Counsel, vaccines, COVID-19, trace, track, control, Americans, White House", "favicon": "https://cdn.charismanews.com/favicons/apple-touch-icon.png", "canonical": "https://www.charismanews.com/us/88750-the-white-house-s-plan-to-trace-track-and-control-every-american", "encoding": "UTF-8"}, "image": null, "domain": "www.charismanews.com", "title": "The White House's Plan to Trace, Track and Control Every American", "cleaned_text": "Liberty Counsel has reviewed a copy of a White House PowerPoint presentation that lays out, in shocking detail, the government's plan to vaccinate, track, trace and control every American.\n\nCalling for \"coordination and alignment of vaccine credential activities across HHS [Health and Human Services] agencies,\" the document states that vaccine passports are \"a critical driver for restoring baseline population health and promoting safe return to social, commercial and leisure activities.\"\n\nThe presentation clearly states that the \"Federal government will inevitably be involved with vaccine credential solutions.\"\n\nAnd that it is implementing a \"vaccine credential\" to be used for \"international and domestic travel\" and will be \"communicating progress to the White House.\"\n\nI don't know about you, but I do not want Joe Biden, Kamala Harris or any other government official to track me and, worse, take away my freedom. Nor do I want any government official capturing the names, addresses or phone numbers of friends with whom I associate.\n\nBut that is exactly what the Biden administration is developing, according to the Department of Health and Human Services presentation.\n\nChina and Israel have implemented their own \"digital health passports.\"\n\nA good friend who lives in Israel showed me his digital vaccine passport phone app that tracks and traces his every move. It is disturbingly similar to the Chinese app that traces, tracks and controls all Chinese citizens' movements.\n\nOn the Israeli app, each person has an individualized QR code on his or her cell phone. His \"vaccination passport\" must be scanned before he travels, enters a store or business or even goes to worship. An app tracks where he is at all times and how close he is to other people. When the government tells him to go home, he must comply. If sent home and he then leaves his assigned \"zone,\" his phone will alert authorities.\n\nIsrael even threatened to cancel the Green Pass of parents who refuse to have their children receive the shots.\n\nA growing number of states have already enacted digital vaccine credential systems, including Hawaii, Washington, Oregon, California, Nevada, Colorado, New Mexico, Minnesota, Illinois, Kentucky, New York, Massachusetts, Rhode Island, New Jersey, Connecticut, Delaware, Maryland, West Virginia and Virginia as well as Washington, D.C.\n\nThe Massachusetts Institute of Technology's Technology Review publication is a key source of tracking propaganda. One article states, \"This new social order will seem unthinkable to most people in so-called free countries. But any change can quickly become normal if people accept it\" (emphasis added).\n\nThe MIT publication's editor-in-chief writes, \"The new normal will be that we are used to the idea that in some cases being able to move around freely is dependent on us being able to show that we're healthy.\" He adds, \"There will be a greater acceptance, I think, of that kind of public health monitoring.\"\n\nFormer Baltimore City Health Commissioner and President Emeritus of Planned Parenthood Dr. Leana Wen said on CNN, \"We have a very narrow window to tie reopening policy to vaccination status because otherwise, if everything is reopened, then what's the 'carrot' going to be? How are we going to incentivize people to actually get the vaccine?\"\n\nThe \"carrot\" to compel you to accept a new experimental drug is to revoke all freedom until the populace accepts the tyrants' demands. The same \"carrot\" will be used to threaten yet more freedom beyond COVID.\n\nWe saw this when Illinois Gov. J.B. Pritzker stated he would not free his state's residents from his restrictions until vaccinations were in place.\n\nLiberty Counsel helped disabuse Pritzker of this bad idea when we sued him to free the state's churches. Illinois churchgoers are now free to attend church without any restrictions—and without the governor's COVID shot.\n\nBut power-hungry politicians are pushing for ever more restrictions!\n\nSend your faxes demanding governors and federal legislators stop Vaccine Passports and tracking and tracing apps.\n\nWe continue to fight for freedom on several fronts and need financial support from friends like you to stay on the front lines of this battle against tyranny.\n\nFor the original article, visit our content partners at lc.org.\n\nRead articles like this one and other Spirit-led content in our new platform, CHARISMA PLUS.\n\nTo contact us or to submit an article, click here.\n\nGet Charisma's best content delivered right to your inbox! Never miss a big news story again. Click here to subscribe to the Charisma News newsletter.", "opengraph": {"title": "The White House's Plan to Trace, Track and Control Every American", "url": "https://www.charismanews.com/us/88750-the-white-house-s-plan-to-trace-track-and-control-every-american", "type": "article", "site_name": "Charisma News", "locale": "en_US", "description": "Digital health passports will be a reality unless you help do something about it.", "image": "https://cdn.charismanews.com/images/stories/2022/3/vaccine_passport-lukas-unsplash.jpg", "image:width": "618", "image:height": "340"}, "tags": [], "tweets": [], "movies": [], "links": ["https://lc.org/lcemail/elc2006faxnmvdonate?t=ELC2006-FaxNMV&c=ELC2006-FaxNMV", "https://www.lc.org/newsroom/details/220328-the-plan-to-trace-track-and-control", "https://www.charismaplusapp.com/", "mailto:robert.caggiano@charismamedia.com", "https://www.charismanews.com/newsletters/?utm_source=charismanews.com&utm_medium=mid-article%20text&utm_campaign=plg_cm_midarticletextinjector", "mailto:?subject=Check%20out%20this%20article&body=I%20read%20this%20article%20and%20wanted%20to%20share%20it%20with%20you:%20https%3A%2F%2Fwww.charismanews.com%2Fus%2F88750-the-white-house-s-plan-to-trace-track-and-control-every-american", "mailto:webmaster@charismamedia.com?subject=Website correction for https://www.charismanews.com/us/88750-the-white-house-s-plan-to-trace-track-and-control-every-american"], "authors": ["Mat Staver/Liberty Counsel"], "publish_date": "8:00AM EDT 3/29/2022"}