{"result_id": "062005", "URL": "https://childrenshealthdefense.org/defender/rebuttal-rosemary-frei-bossche-vaccination-concern/", "timestamp": "2023-04-25 14:37:09 CEST+0200", "meta": {"description": "In her rebuttal to Dr. Geert Vanden Bossche’s open letter to the WHO, Rosemary Frei, MSc, outlines what she says are “a few of the dozens of clues” suggesting that Bossche’s argument “is a continuation of the overall COVID deception.”", "lang": "en", "keywords": "", "favicon": "https://childrenshealthdefense.org/wp-content/themes/chd-theme/images/favicon.ico", "canonical": "https://childrenshealthdefense.org/defender/rebuttal-rosemary-frei-bossche-vaccination-concern/", "encoding": "utf-8"}, "image": null, "domain": "childrenshealthdefense.org", "title": "Rebuttal: The ‘Not-So-Hidden Agenda’ Behind Bossche’s Concern Over COVID Mass Vaccination", "cleaned_text": "Miss a day, miss a lot. Subscribe to The Defender's Top News of the Day. It's free.\n\nEDITOR’S NOTE: The Defender is committed to providing a space for scientific debate. This piece is a rebuttal to this article regarding an open letter Geert Vanden Bossche, Ph.D., DVM wrote to the World Health Organization.\n\nOn March 6, an open letter by Geert Vanden Bossche, Ph.D., DVM, and a video interview of him by Phillip McMillan, MD, from a company called Vejon Health, were posted online.\n\nOn the surface, Vanden Bossche appears to perhaps be addressing credible concerns about COVID.\n\nHe’s saying that the current crop of COVID vaccines will cause the novel coronavirus to mutate into a “super-infectious virus.” And therefore he’s calling for an immediate halt of the use of the current vaccines.\n\nIf humans are “committed to perpetuating our species, we have no choice but to eradicate these highly infectious viral variants” via “large vaccination campaigns,” Vanden Bossche claims at the conclusion of his open letter. However, he continues, in contrast to the currently used COVID vaccines, these new vaccines must focus on stimulation of mass production of the component of the immune system known as natural killer cells, he asserts.\n\nBut Vanden Bossche bases his views on unproven hypotheses. This is similar to, and builds on, high-profile modeling-paper authors who use theoretical frameworks to inflame fears about the supposed dangerousness of the new variants.\n\nDespite this, Vanden Bossche’s views were very quickly and positively received by high-profile vaccine sceptics such as Del Bigtree in his March 11 episode (starting at 57:25) and Vernon Coleman in his March 13 video and article.\n\nBigtree and Coleman virtually unquestioningly accept and amplify Vanden Bossche’s views. They strongly insinuate to their overwhelmingly credulous subscribers that there’s virtually no fact-checking or pause for sober second thought required.\n\nBut from my experience as a former long-time medical writer and journalist (1988-2016) — particularly a four-month stint with media-relations giant FleishmanHillard in 1994 (yes, I’ve worked for the dark side) — this has all the hallmarks of a drug-company astroturf campaign. It’s another step in the decades-long erasure of the fact that our sophisticated and highly effective immune systems work well and don’t need any assistance from the biomedical/pharmaceutical industry.\n\nThere’s abundant evidence that Vanden Bossche has a not-so-hidden agenda. For example, just before the three-minute mark in the video interview of Vanden Bossche by McMillan, Vanden Bossche indicates he’s a long-time vaccine developer. He adds he’s now focusing on vaccines that “educate the immune system in ways that are to some extent more efficient than we do right now with our conventional vaccines.” Clearly he’s got significant conflicts of interest. Therefore he has zero credibility when it comes to advising the public or anyone else about how to avoid negative effects of mass vaccination.\n\nHowever, Bigtree, Coleman and others don’t point out any of the red flags. Despite taking Vanden Bossche’s assertions extremely seriously, these high-profile alternative-media figures don’t even do basic due diligence such as looking into McMillan, who’s the man who interviewed Vanden Bossche, or the company McMillan is apparently affiliated with, Vejon Health. Bigtree, for example, relies heavily on the McMillan interview for the content of his March 11 segment.\n\nAs far as I know, McMillan and Vanden Bosch aren’t among the thousands of M.D.s, Ph.D.s, and other people with graduate degrees or equivalent qualifications who have thoroughly debunked the official COVID narrative over the last 12 months. Rather, the pair suddenly popped out of the woodwork.\n\nAlso, McMillan isn’t anything close to an expert on vaccines. On his website he describes himself as a “dementia authority.” The most recently published paper of his that I can find is from 2016 and is on Alzheimer’s in the journal Medical Hypotheses. (In that paper, he and his co-author propose nutritional supplementation to lower the body’s burden of aluminum, a high level of which is linked to Alzheimer’s.) In addition, when one clicks on Vejonhealth.com one gets a message indicating the website isn’t in use. Indeed, Vejon appears to be a dormant company.\n\nSo I ignored McMillan’s interview and Vanden Bossche’s open letter when I first learned about them last week. But then on March 12, I was contacted by the producer of something called the Gary Null Show on the Progressive Radio Network. The producer, Richard Gale, asked me to be a guest. I agreed to do the interview on March 15.\n• None This field is for validation purposes and should be left unchanged.\n\nAbout 1.5 hours before the interview was to start, I contacted Gale and asked what the interview would focus on. Gale told me Null wanted to discuss Bigtree’s segment on the Vanden Bossche letter and Gale sent me a link to it. So I quickly read the open letter and watched the full interview and Bigtree segment on it. A field of red flags popped up in my mind.\n\nAt the appointed interview start time of 12:30 p.m. on March 15, Null proceeded to read live to air, for about 12 minutes, some key points from the open letter. He told the audience to take them seriously. Then Null put me on the air. But he wouldn’t let me talk about the letter. Instead, he repeatedly interrupted my efforts to do so and he insisted I only discuss the new variants. So I hung up. And I’ve been edited out of the archived broadcast of Null’s show.\n\nI’m going to be interviewed live today (March 16) starting at 4:30 p.m. Eastern Standard Time by Ryan Cristián of The Last American Vagabond. We’ll talk about the Vanden Bossche letter and McMillan interview. Apparently Ryan’s on the same page as me.\n\nMeanwhile, my tweets about the open letter and the Null interview have gotten a lot of reaction. And, as it happens, since Sunday people have been emailing to encourage me to read Vanden Bossche’s letter and watch his interview. Many are swayed by his calling for an immediate halt of the use of the current crop of COVID vaccines and by the fact that people like Bigtree are propagating his messages.\n\nSo I decided to write this article to expose a few of the dozens of clues showing that this curious case is a continuation of the overall COVID deception.\n\nHere are some more of those clues:\n• In his March 11 segment, Bigtree shows a slide with Vanden Bossche’s background. It indicates he’s affiliated with the Bill & Melinda Gates Foundation, the Global Alliance for Vaccines and Immunization (GAVI), GlaxoSmithKline, Novartis and other vaccine proponents. Del dubs Vanden Bossche a “world-renowned vaccine creator.” Coleman calls him “a very eminent vaccine specialist.”\n\nBut, when combined with the contents of his open letter, it’s impossible to believe that he’s in fact an insider who’s now turned against his very high-powered comrades. (More on this below.) It’s more likely that he’s their accomplice.\n\nAnother indication that the letter is designed to propagandize rather than to let objective evidence speak for itself is the wording Vanden Bossche uses. He writes, for example, that he was “racing against the clock” to write “this agonizing letter” in which he “put[s] all of my reputation and credibility at stake” to help “turn the tide” against this “irrepressible monster” that the virus could soon become unless we heed Vanden Bossche.\n• In his open letter Vanden Bossche also writes, “I can assure you that each of the current vaccines have been designed, developed and manufactured by brilliant and competent scientists.” However, he doesn’t say a word about the massive adverse-event rate and very scant efficacy profile of the vaccines that were created by these “brilliant scientists.”\n• Vanden Bossche also asserts that there’s an “ever[-]increasing threat from rapidly spreading, highly infectious variants.” But as I detailed in my Feb. 3 article and accompanying video on the new variants, there is no proof that they are highly infectious or will be any time soon.\n• There is the possibility of viral resistance, as for example I note in my March 9, 2021, article and accompanying video. But it’s not the major threat Vanden Bossche attempts to scare us about by saying the virus is likely to mutate so much and so quickly because of the current mass vaccination campaigns that soon it could escape all current attempts to stop its spread. Remember, for example, that yearly flu mass vaccination hasn’t caused influenza to spiral out of control and decimate the global population.\n• Vanden Bossche also writes that some antibodies are made by the innate immune system, but that these ‘natural’ antibodies are non-specific. He also states that they have “suboptimal” “maturity, and are “rather limited and only short-lived.” He claims they are a very weak link in our immune reactions to pathogens such as the novel coronavirus: “the combination of viral infection on a background of suboptimal Ab [antibody] maturity and concentration enables the [novel corona] virus to select mutations [, thereby] allowing it to escape the immune pressure.”\n\nHowever, this is on very shaky ground. Because, among other things: 1) Neither in the original March 6 piece nor his March 13 follow-up does Vanden Bossche provide any direct, non-theoretical evidence that this is happening; 2) The ‘natural antibodies’ that are produced after encountering a pathogen are only a small part of a quick, effective and broad-based first-line immune-system defense — known as ‘innate’ or ‘passive’ immunity — which in fact largely comprises other components; and 3) Vanden Bossche downplays the effectiveness of the antibodies our bodies naturally produce as part of the second-line (‘adaptive’) part of the immune system that also has served us extremely well for millennia.\n\nA March 11 commentary by Michael Yeadon and Marc Girardot has similar information to my points 3, 4 and 5. However the pair present it in a way that’s very pro-mRNA-vaccine and pro- much of the official-COVID-narrative — neither of which I endorse.\n• Vanden Bossche also has no references in that original document. He does include some in his follow-up, March 13, document posted on his website. But that March 13 document, like the March 6 one, hasn’t been posted on the website of a journal, never mind a peer-reviewed one, nor reviewed in any more serious a manner. And in an unusual approach, he doesn’t attach each reference to a particular statement in his document; rather, he lists the references at the end of the article under categories such as ‘Natural antibodies.’\n• Vanden Bossche drives at the need for “large vaccination campaigns.” These, he writes, should be for “NK [natural-killer]-cell–based vaccines” that “will primarily enable our natural immunity to be better prepared … and to induce herd immunity.”\n\nBut it’s not very logical to believe that the only solution to the theoretical possibility of immune escape, as espoused by someone who’s got a long and strong focus on vaccination as opposed to other ways to improve health, is yet more mass vaccination.\n\nNot to mention that the concept of herd immunity is contrived. After all, if your immune system is protecting you against a pathogen, it doesn’t matter whether someone else’s is or not.\n\nI do agree that we should stop the use of the current vaccines. But we also need to stop production and use of antivirals and antibodies and all other parts of the COVID-industrial complex.\n\nCOVID has an extremely high survival rate. So why develop yet another expensive, invasive and experimental solution to a problem that barely exists, if it does at all?", "opengraph": {"locale": "en_US", "type": "article", "title": "Rebuttal: The ‘Not-So-Hidden Agenda’ Behind Bossche’s Concern Over COVID Mass Vaccination", "description": "In her rebuttal to Dr. Geert Vanden Bossche’s open letter to the WHO, Rosemary Frei, MSc, outlines what she says are “a few of the dozens of clues” suggesting that Bossche’s argument “is a continuation of the overall COVID deception.”", "url": "https://childrenshealthdefense.org/defender/rebuttal-rosemary-frei-bossche-vaccination-concern/", "site_name": "Children's Health Defense", "article:publisher": "https://www.facebook.com/ChildrensHealthDefense/", "article:modified_time": "2021-03-17T17:39:41+00:00", "image": "https://childrenshealthdefense.org/wp-content/uploads/Bossche-not-so-hidden-agenda-feature.jpg", "image:width": "1600", "image:height": "834", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/about-us/sign-up/?utm_source=top_of_article&utm_medium=the_defender&utm_campaign=sign_ups", "https://childrenshealthdefense.org/defender/virologist-huge-price-covid-mass-vaccination/", "https://www.geertvandenbossche.org/", "https://childrenshealthdefense.org/defender/virologist-huge-price-covid-mass-vaccination/", "https://childrenshealthdefense.org/defender_category/covid/", "https://www.rosemaryfrei.ca/the-modelling-paper-mafiosi/", "https://thehighwire.com/videos/vaccine-disaster-ahead/", "https://vernoncoleman.org/videos/covid-19-vaccines-are-weapons-mass-destruction-and-could-wipe-out-human-race", "https://prospect.org/health/pharma-backed-astroturf-group-drug-prices/", "https://www.merriam-webster.com/dictionary/astroturfing", "https://drphilipmcmillan.com/about/", "https://pubmed.ncbi.nlm.nih.gov/27142155/", "http://www.vejonhealth.com/", "https://find-and-update.company-information.service.gov.uk/company/11190028", "https://prn.fm/", "https://prn.fm/gary-null-show-03-15-21/", "https://www.thelastamericanvagabond.com/category/interviews/", "https://twitter.com/RosemaryFreiTO/status/1371510774137520129", "https://twitter.com/RosemaryFreiTO/status/1371513004664233994", "https://thehighwire.com/videos/vaccine-disaster-ahead/", "https://childrenshealthdefense.org/news/vaccines/gates-pushes-gene-altering-technology-on-seven-billion-humans/", "https://www.who.int/workforcealliance/members_partners/member_list/gavi/en/", "https://be.linkedin.com/in/geertvandenbossche", "https://vernoncoleman.org/videos/covid-19-vaccines-are-weapons-mass-destruction-and-could-wipe-out-human-race", "https://www.rosemaryfrei.ca/laying-out-the-evidence/", "https://www.rosemaryfrei.ca/no-safety-data/", "https://www.geertvandenbossche.org/", "https://www.geertvandenbossche.org/", "https://www.healthline.com/health/acquired-immunity#what-is-it", "https://www.pandata.org/how-broad-is-covid-immunity/", "https://childrenshealthdefense.org/news/editorial/an-mrna-vaccine-against-sars-cov-2-preliminary-report-a-researcher-reacts/", "https://www.geertvandenbossche.org/", "https://www.rosemaryfrei.ca/the-curious-case-of-geert-vanden-bossche/"], "authors": [], "publish_date": null}