{"result_id": "062048", "URL": "https://childrenshealthdefense.org/defender/mounting-evidence-covid-vaccines-risk/", "timestamp": "2023-04-25 14:37:54 CEST+0200", "meta": {"description": "Two new studies — one about thyroid eye disease and one about encephalitis — highlighted negative health outcomes associated with COVID-19 vaccination, and a third study suggested the COVID-19 vaccine provided only 15% protection against the risk of “long COVID.”", "lang": "en", "keywords": "", "favicon": "https://childrenshealthdefense.org/wp-content/themes/chd-theme/images/favicon.ico", "canonical": "https://childrenshealthdefense.org/defender/mounting-evidence-covid-vaccines-risk/", "encoding": "utf-8"}, "image": null, "domain": "childrenshealthdefense.org", "title": "3 New Studies Add to Mounting Evidence That COVID Vaccines May Not Be Worth the Risk", "cleaned_text": "Miss a day, miss a lot. Subscribe to The Defender's Top News of the Day. It's free.\n\nTwo new studies — one about thyroid eye disease and one about encephalitis — highlighted negative health outcomes associated with COVID-19 vaccination, and a third study suggested the COVID-19 vaccine provided only 15% protection against the risk of “long COVID.”\n\nTaken together, the studies highlight the fact that COVID-19 vaccines are associated with serious risks for some, while their protective benefit has been overestimated.\n\nDr. Peter Kally reported on a small case series at last month’s American Society of Ophthalmic Plastic and Reconstructive Surgery’s fall scientific symposium.\n\nKally, of Consultants in Ophthalmic and Facial Plastic Surgery and Beaumont Eye Institute in Michigan, concluded ophthalmologists should monitor patients with thyroid eye disease if they receive a COVID-19 vaccine because the shot may trigger thyroid eye disease flare.\n\n“It stands to reason that the immune response that you may get from a COVID vaccine or any vaccination may also trigger an autoimmune response,” Kally said, adding, “COVID vaccination is possibly associated with thyroid eye disease reactivation.”\n\nThe case series, Kally said, involved five patients — four women and one man, average age of 60.2 years — who were seen between March 2020 and March 2022 at a single medical center for thyroid eye disease reactivation following their COVID-19 vaccination.\n\nThree patients received the Pfizer shot, one received the Moderna vaccine and one received the Johnson & Johnson vaccine.\n\nThe patients, who had received prior evaluations, including thyroid-specific tests and examinations, presented with worsening thyroid eye disease after their vaccinations.\n\nThe average presentation was 43 days after vaccination, with a range of 10-65 days, he noted.\n\nThe post-vaccination labs showed elevation of thyroid-stimulating immunoglobulin (TSI) with an average increase of 5 points. “TSI was a marker for current disease activity,” Kally explained.\n\n“Correlation does not prove causation with any of this,” he added … “but this report is in alignment with other reports we have seen.”\n\nA case report published Oct. 1 in the journal Vaccines presented the autopsy results of a 76-year-old man with Parkinson’s disease who died three weeks after his third COVID-10 shot. The autopsy showed that vaccine-related encephalitis and myocarditis were “contributors to the death.”\n\nReport author Dr. Michael Mörz, of the Georg Schmorl Institute of Pathology at the Municipal Hospital Dresden-Friedrichstadt, Germany, said, “The stated cause of death appeared to be a recurrent attack of aspiration pneumonia, which is indeed common in Parkinson’s disease.”\n\nHowever, the detailed autopsy — done at the request of the patient’s family due to his “ambiguous symptoms” — revealed additional pathology, in particular necrotizing encephalitis and myocarditis.\n\n“A causal connection of these findings to the preceding COVID-19 vaccination was established by immunohistochemical demonstration of SARS-CoV-2 spike protein.”\n\nThe patient’s histopathological signs of myocarditis were “comparatively mild,” Mörz noted, however, the patient’s encephalitis had resulted in “significant multifocal necrosis and may well have contributed to the fatal outcome.”\n\nEncephalitis often causes epileptic seizures — and the autopsy found the patient was biting his tongue at the time of death, suggesting he may have suffered a seizure. Prior research on other cases of COVID-19 vaccine-associated encephalitis with status epilepticus reported this occurring in other patients.\n\nBut Mörz’s case report, he said, was the first to show there was spike protein within the encephalitic lesions of the patient that could only be attributed to the COVID-19 vaccine — and not a possible COVID-19 infection.\n\nIf a person suffers a COVID-19 infection, two proteins show up in the tissue: spike protein and nucleocapsid protein. “During an infection with the [COVID-19] virus, both proteins should be expressed and detected together,” Mörz explained.\n\n“On the other hand, the gene-based COVID-19 vaccines encode only the spike protein and therefore, the presence of spike protein only (but no nucleocapsid protein) in the heart and brain of the current case can be attributed to vaccination rather than to infection,” he concluded, noting that this matched the patient’s health history, which included three COVID-19 vaccinations but no positive COVID-19 lab tests or clinical diagnoses of a COVID-19 infection.\n\n“Since no nucleocapsid protein could be detected, the presence of spike protein must be ascribed to vaccination rather than to [COVID-19] viral infection.”\n\nMörz also noted that the clinical history of the case showed “some remarkable events” in correlation to his COVID-19 vaccinations, further suggesting that the vaccine-related encephalitis and myocarditis contributed to the man’s death.\n\nUpon receiving a first dose of the AstraZeneca vaccine May 2021, the man “experienced cardiovascular symptoms which needed medical care and from which he recovered only slowly.”\n\nThen in July 2021, the man received a second COVID-19 shot — this time with the Pfizer vaccine — and suffered a “sudden onset of marked progression” of his Parkinson’s disease symptoms, leading to “severe motor impairment” and a recurrent need to use a wheelchair from which he “never fully recovered.”\n\nFinally, in December 2021, the man received his third COVID-19 vaccination — again with the Pfizer shot. Two weeks later while eating dinner, he “suddenly collapsed.”\n\n“Remarkably,” Mörz said, “he did not show any coughing or other signs of food aspiration but just fell from his chair. This raises the question of whether this sudden collapse was really due to aspiration pneumonia.”\n\n“After intense resuscitation, he recovered from this more or less, but one week later, he again suddenly collapsed silently while taking his meal. After successful but prolonged resuscitation attempts, he was transferred to the hospital and directly set into an artificial coma but died shortly thereafter.”\n\nCommenting on Kally’s case series report and Mörz’s case report, Dr. Madhava Setty, senior science editor for The Defender, said, “We are still in an embryonic stage when it comes to understanding how the SARS-COV-2 virus and the mRNA ‘vaccines’ affect our physiology. This is why these kinds of case series and reports are important.”\n\n“In medicine, it is the ‘anecdotal’ stories that lead to case reports and series which lead to larger observational studies that help assess risk vs. benefit.\n\n“With regard to thyroid eye disease ‘flare-ups’ following COVID-19 vaccination, this potential correlation would be vital to those who suffer these conditions.\n\n“The case of encephalitis and myocarditis has unequivocally demonstrated that the vaccine was responsible for this patient’s death. The risks of post-jab sequelae like these are still impossible to quantify even nearly two years out from the vaccine roll-out because of the lack of any long-term safety data from the trials.”\n\nAdditionally, Setty said — referencing a study published May 25 in Nature Medicine — that the “potential risks of non-COVID-19 complications from the vaccine must be weighed against the still unknown benefit of the vaccine in preventing ‘long COVID,’ which may be more meager than advertised.”\n\nVaccine provides only 15% likelihood of protection against long COVID\n\nThe Nature Medicine study involved more than 13 million people and reported that vaccination against COVID-19 appeared to lower the risk of “long COVID” after infection by only about 15%.\n\n“Long COVID” refers to illness that persists for weeks or months after a COVID-19 infection.\n\nThe study authors, Dr. Ziyad Al-Aly, a nephrologist at Veteran Affairs (VA) Saint Louis Health Care System in St Louis, Missouri, and his colleagues, examined VA health records from January to December 2021 of three groups of people: about 34,000 vaccinated people who had breakthrough COVID-19 infections, about 113,000 people were infected but did not receive the vaccine and more than 13 million people who were not infected — making this the largest cohort study on long COVID to date, reported Nature.\n\nBased on their analyses, the authors said that vaccination seemed to reduce the likelihood of long COVID for those who were vaccinated and had a breakthrough infection by only about 15%. That number is substantially lower than smaller previous studies showed.\n\nIt’s also much lower than a U.K. study that used data from 1.2. Million U.K. smartphone users and reported the odds of having COVID symptoms for 28 days or more after a post-vaccination infection were roughly halved by getting two doses of the COVID-19 vaccine.\n\nThe authors compared symptoms such as brain fog and fatigue in vaccinated versus unvaccinated people for up to six months after they tested positive for COVID-19 and found no difference in type or severity of symptoms between the vaccinated versus unvaccinated.\n\n“The findings suggest that vaccination before infection confers only partial protection in the post-acute phase of the disease,” the authors concluded.\n\nReliance on the vaccine as “a sole mitigation strategy may not optimally reduce long-term health consequences” of COVID-19 inflection, they added.", "opengraph": {"locale": "en_US", "type": "article", "title": "3 New Studies Add to Mounting Evidence That COVID Vaccines May Not Be Worth the Risk", "description": "Two new studies — one about thyroid eye disease and one about encephalitis — highlighted negative health outcomes associated with COVID-19 vaccination, and a third study suggested the COVID-19 vaccine provided only 15% protection against the risk of “long COVID.”", "url": "https://childrenshealthdefense.org/defender/mounting-evidence-covid-vaccines-risk/", "site_name": "Children's Health Defense", "article:publisher": "https://www.facebook.com/ChildrensHealthDefense/", "image": "https://childrenshealthdefense.org/wp-content/uploads/covid-vaccines-risk-evidence-feature.jpg", "image:width": "1600", "image:height": "834", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/about-us/sign-up/?utm_source=top_of_article&utm_medium=the_defender&utm_campaign=sign_ups", "https://childrenshealthdefense.org/defender_category/covid/", "https://www.asoprs.org/about-us-", "https://www.asoprs.org/index.php?option=com_jevents&task=icalrepeat.detail&evid=102&Itemid=1&year=2022&month=09&day=29&title=asoprs-53rd-annual-fall-scientific-symposium&uid=13d0a2094e68b9d7264dbf7f2c7ffad1", "https://my.clevelandclinic.org/health/diseases/17558-thyroid-eye-disease", "https://www.healio.com/news/ophthalmology/20221001/covid-vaccination-may-trigger-thyroid-eye-disease-flare", "https://childrenshealthdefense.org/defender/doctor-michael-goldman-pfizer-covid-booster-shot-cancer/", "https://childrenshealthdefense.org/defender/woman-brain-inflammation-moderna-covid-vaccine/", "https://childrenshealthdefense.org/defender/johnson-johnson-very-bad-month/", "https://www.restartmed.com/thyroid-stimulating-immunoglobulin/", "https://pubmed.ncbi.nlm.nih.gov/34570048/", "https://pubmed.ncbi.nlm.nih.gov/35399967/", "https://www.mdpi.com/2076-393X/10/10/1651", "https://www.mdpi.com/journal/vaccines", "https://www.klinikum-dresden.de/patho_khdf", "https://rarediseases.info.nih.gov/diseases/13233/acute-necrotizing-encephalopathy", "https://www.mayoclinic.org/diseases-conditions/myocarditis/symptoms-causes/syc-20352539", "https://scholars.ncu.edu.tw/en/publications/covid-19-vaccine-induced-encephalitis-and-status-epilepticus", "https://www.frontiersin.org/articles/10.3389/fneur.2022.946644/full", "https://pubmed.ncbi.nlm.nih.gov/34367780/", "https://childrenshealthdefense.org/defender/bill-gates-indian-government-lawsuit-snehal-lunawat-death-astrazeneca-vaccine/", "https://childrenshealthdefense.org/authors/madhava-setty-m-d/", "https://childrenshealthdefense.org/defender/", "https://childrenshealthdefense.org/defender/autopsies-vaccinating-teens-covid-heartbreaking/", "https://www.nature.com/articles/s41591-022-01840-0", "https://childrenshealthdefense.org/defender/masks-long-covid-connection/", "https://www.nature.com/articles/d41586-022-01453-0#ref-CR1", "https://www.nytimes.com/article/long-covid-vaccines.html", "https://pubmed.ncbi.nlm.nih.gov/34480857/"], "authors": [], "publish_date": null}