{"result_id": "062040", "URL": "https://childrenshealthdefense.org/defender/switzerland-stops-covid-vaccines-immunity/", "timestamp": "2023-04-25 14:37:47 CEST+0200", "meta": {"description": "In a move that shifts liability for COVID-19 vaccine injuries from the government to physicians, Switzerland said it is not recommending COVID-19 vaccines for spring and summer, even for those people considered to be high risk.", "lang": "en", "keywords": "", "favicon": "https://childrenshealthdefense.org/wp-content/themes/chd-theme/images/favicon.ico", "canonical": "https://childrenshealthdefense.org/defender/switzerland-stops-covid-vaccines-immunity/", "encoding": "utf-8"}, "image": null, "domain": "childrenshealthdefense.org", "title": "Switzerland Stops Recommending COVID Vaccines, Citing High Level of Immunity", "cleaned_text": "Miss a day, miss a lot. Subscribe to The Defender's Top News of the Day. It's free.\n\nSwitzerland is the latest European country to stop recommending the COVID-19 vaccine for the general population.\n\nA new set of guidelines issued by the country’s Federal Office of Public Health (FOPH) and Federal Commission for Vaccination does not recommend the vaccine for individuals, including those considered at high risk, for the spring and summer seasons.\n\nAccording to Medical Daily, Swiss medical authorities cited the high level of immunity in society, either via vaccination or natural immunity, as the basis for their new recommendations.\n\n“In principle, no COVID-19 vaccination is recommended for spring/summer 2023,” the FOPH said. “Nearly everyone in Switzerland has been vaccinated and/or contracted and recovered from COVID-19. Their immune system has therefore been exposed to the coronavirus.”\n\nSwiss seroprevalence data from mid-2022 indicates more than 98% of the country’s population had developed antibodies against COVID-19, The Epoch Times reported.\n\nAccording to Swiss Info, “In Switzerland, about 70% of the population have had at least one COVID [vaccine] dose, a figure that has barely moved over the past year. Only 11.5% got a booster jab in the past six months.”\n\nSwiss public health officials also said data indicate COVID-19 will circulate less this year, with newer variants that cause milder illness than previous strains.\n\nThe decision to not recommend the vaccines will be reevaluated for the autumn and winter seasons, according to public health authorities. Medical Daily reported that the new recommendations would be “adjusted if a new wave of infection were to emerge.”\n\nAccording to Swiss outlet Report 24, as per the new recommendation, doctors can only administer the COVID-19 vaccines on a case-by-case basis and under certain conditions.\n\nMedical Daily, citing the FOPH, reported that high-risk individuals, including those 65 and older, the immunocompromised and pregnant women, can still receive a COVID-19 vaccine, but only after an individual consultation with their doctor.\n\nWhen a vaccine is recommended, it is advised that it be administered at least six months after the last vaccination or last-known COVID-19 infection.\n\n“Even particularly vulnerable people are currently not recommended a COVID-19 vaccination. However, you can get a vaccination after individual consultation with your doctor.\n\n“Vaccination may be wise in individual cases, as it improves protection against developing severe COVID-19 for several months. This applies regardless of the number of vaccinations you have already received.”\n\nHowever, the FOPH also noted that the efficacy of the COVID-19 vaccines against current variants is diminished and short-lived, especially in individuals who are considered at-risk, according to Report 24.\n\nThe FOPH also found that the adaptation of mRNA vaccines has not kept pace with the evolution of new COVID-19 strains.\n\nThe new recommendations also have important implications relating to issues such as payment for the vaccines and vaccine-related liability.\n\n“By no longer recommending the vaccines, this would mean that vaccination is not covered by the government anymore,” Medical Daily reported. “Non-high-risk individuals who want to get the vaccine or the booster would have to pay for it.”\n\nFor high-risk individuals advised to be vaccinated, health insurance would cover the cost of vaccination.\n\nUnder the new recommendations, there is a shift in vaccine-related liability as well. According to guidelines implemented by the FOPH on Nov. 29, 2022, the Swiss government provides compensation to vaccine-injured individuals only in cases where the vaccination is recommended by public health authorities.\n\nAs a result, liability now shifts to the doctors administering the vaccines. According to Report 24, this “should mean that their willingness to vaccinate will decrease significantly.”\n\nSwiss Info reported that on Jan. 23, Dr. Christoph Berger, head of infectious diseases at Children’s Hospital Zurich and chair of the Federal Commission for Vaccination, said the COVID-19 vaccines achieved the Swiss government’s goals of protecting the vulnerable and easing pressures on the healthcare system.\n\nHowever, despite arguing that “vaccination benefits far outweigh the risks,” Berger qualified this statement by saying “It is clear that there are undesirable vaccination symptoms, including severe ones. We must take these people and their suffering seriously and help them too.”\n\n“There is as yet no clear diagnosis of this post-vac syndrome. The term is a collective pot for various symptoms that could at least have a temporal connection with the vaccination. Maybe the connection is causal or not,” he added.\n\nSimilar remarks were made by Germany’s Federal Minister of Health Karl Lauterbach — previously a proponent of a national vaccine mandate who once stated COVID-19 vaccines have “no side effects” — on March 12.\n\nSeveral countries, WHO also revised COVID vaccine recommendations\n\nSwitzerland is not the only European country to stop recommending the COVID-19 vaccines.\n\nIn April 2022, Denmark suspended its national COVID-19 vaccination campaign and shifted to a targeted approach. And as of Feb. 12, the U.K. stopped recommending boosters for healthy individuals and discontinued free distribution of the primary two-dose series of COVID-19 vaccines.\n\nThe World Health Organization (WHO) also made changes to its recommendations.\n\nOn March 28, the WHO announced that its Strategic Advisory Group of Experts on Immunization “revised the roadmap for prioritizing the use of COVID-19 vaccines, to reflect the impact of Omicron and high population-level immunity due to infection and vaccination.”\n\nThe new roadmap shifts away from a universal COVID-19 vaccination recommendation, instead categorizing individuals into one of three “priority-use groups,” with the ongoing administration of boosters recommended only for the “high priority group.”\n\nThis group includes “older adults; younger adults with significant comorbidities (e.g. diabetes and heart disease); people with immunocompromising conditions (e.g. people living with HIV and transplant recipients), including children aged 6 months and older; pregnant persons; and frontline health workers.”\n\n“The public health impact of vaccinating healthy children and adolescents is comparatively much lower than the established benefits of traditional essential vaccines for children,” the WHO stated.\n\nThe revised recommendations come as the U.S. Food and Drug Administration continues to recommend the primary series of COVID-19 vaccines for unvaccinated individuals and, according to Medical Daily, is set to authorize a second bivalent booster in the coming weeks.\n\nEven before the recent revision of its guidelines, Switzerland’s COVID-19 vaccination program was fraught with difficulties.\n\nIn May 2022, Switzerland was slated to destroy 620,000 expired doses of the Moderna COVID-19 vaccine. Endpoints noted at the time that “the number of vaccinations [had] fallen sharply” in the preceding period.\n\nThe following month, the Swiss parliament was divided on the issue of procuring new COVID-19 vaccines, with the Senate arguing that the number of doses the government planned to order was “excessive.” Ultimately, the government purchased only half the planned number of doses.\n\nAnd in September 2022, Switzerland destroyed an additional 10.3 million expired doses of the Moderna COVID-19 vaccine.\n\nA March 11 report by Swiss Info stated that the country “finds itself with a massive stockpile” of COVID-19 vaccines.\n\n“Millions of unused vials that have expired have already been destroyed​.​ ​I​t is likely that millions more will end up in the trash this year, as they cannot be easily sold or donated​​​ to poorer nations to whom they were promised,” according to the Swiss Info report.\n\nThe same report highlighted “vaccine fatigue and pandemic weariness more generally” as explanations for the stagnant demand for COVID-19 vaccines in the country, along with “stronger immunity in the community, exhaustion about public health measures and better awareness about the dangers of COVID.”\n\nA FOPH representative told Swiss public radio SRF at the time that “The coronavirus has also lost some of its shock value in the public’s perception.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Switzerland Stops Recommending COVID Vaccines, Citing High Level of Immunity", "description": "In a move that shifts liability for COVID-19 vaccine injuries from the government to physicians, Switzerland said it is not recommending COVID-19 vaccines for spring and summer, even for those people considered to be high risk.", "url": "https://childrenshealthdefense.org/defender/switzerland-stops-covid-vaccines-immunity/", "site_name": "Children's Health Defense", "article:publisher": "https://www.facebook.com/ChildrensHealthDefense/", "image": "https://childrenshealthdefense.org/wp-content/uploads/switzerland-covid-vaccine-feature.jpg", "image:width": "1600", "image:height": "834", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/about-us/sign-up/?utm_source=top_of_article&utm_medium=the_defender&utm_campaign=sign_ups", "https://www.bag.admin.ch/bag/de/home/krankheiten/ausbrueche-epidemien-pandemien/aktuelle-ausbrueche-epidemien/novel-cov/information-fuer-die-aerzteschaft/covid-19-impfung.html#-1942803447", "https://www.medicaldaily.com/switzerland-no-longer-recommends-covid-19-vaccination-heres-why-469321", "https://childrenshealthdefense.org/defender/covid-infection-natural-immunity-superior/", "https://childrenshealthdefense.org/defender_category/covid/", "https://www.theepochtimes.com/switzerland-stops-recommending-covid-19-vaccination_5180835.html", "https://www.swissinfo.ch/eng/sci-tech/covid-vaccine-doses-go-to-waste-in-switzerland-amid-huge-stockpile/48330402", "https://report24.news/paukenschlag-schweiz-zieht-saemtliche-covid-impfempfehlungen-zurueck/", "https://www.bag.admin.ch/dam/bag/de/dokumente/mt/k-und-i/aktuelle-ausbrueche-pandemien/2019-nCoV/impfstrategie-bag-ekif.pdf.download.pdf/Covid-19-Impfstrategie%20BAG%20EKIF.pdf", "https://www.swissinfo.ch/eng/politics/swiss-claim-covid-vaccine-success-despite-side-effects/48224852", "https://swisspeddose.ch/en/association/persons/", "https://childrenshealthdefense.org/defender/karl-lauterbach-germany-covid-vaccine-injuries/", "https://childrenshealthdefense.org/defender/denmark-covid-campaign/", "https://childrenshealthdefense.org/defender/uk-covid-vaccine-booster-post-pandemic/", "https://www.who.int/news/item/28-03-2023-sage-updates-covid-19-vaccination-guidance", "https://www.medicaldaily.com/fda-approve-second-bivalent-booster-after-first-dose-showed-strong-protection-469307", "https://www.swissinfo.ch/eng/swiss-to-destroy-more-than-620-000-doses-of-expired-covid-vaccine/47627674", "https://endpts.com/switzerland-to-destroy-over-620000-expired-doses-of-moderna-covid-vaccine/", "https://www.swissinfo.ch/eng/politics/swiss-government-forced-to-halve-2023-covid-vaccine-orders/47680604", "https://lenews.ch/2022/09/30/switzerland-to-destroy-10-million-doses-of-covid-vaccine/", "https://www.swissinfo.ch/eng/sci-tech/covid-vaccine-doses-go-to-waste-in-switzerland-amid-huge-stockpile/48330402"], "authors": [], "publish_date": null}