{"result_id": "062007", "URL": "https://childrenshealthdefense.org/transcripts/robert-f-kennedy-jr-vs-alan-dershowitz-the-great-vaccine-debate/", "timestamp": "2023-04-25 14:37:11 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://childrenshealthdefense.org/wp-content/themes/chd-theme/images/favicon.ico", "canonical": "https://childrenshealthdefense.org/transcripts/robert-f-kennedy-jr-vs-alan-dershowitz-the-great-vaccine-debate/", "encoding": "utf-8"}, "image": null, "domain": "childrenshealthdefense.org", "title": "Robert F. Kennedy, Jr. vs Alan Dershowitz: The Great Vaccine Debate!", "cleaned_text": "The following is a transcript of this video. Also see related article.\n\nPATRICK BET-DAVID: There will soon be a new vaccine for the coronavirus pandemic. The question is, are these vaccines safe and can the government force you to take them? When it comes down to lawyers, they itch for things like this.\n\nROBERT F. KENNEDY, JR: One in 40 people are seriously injured by vaccines. It’s not hypothetical.\n\nALAN DERSHOWITZ: If you’re right, why wouldn’t it follow that the flu shot should be illegal.\n\nKENNEDY: CDC is a vaccine company. They are not doing their job as regulators.\n\nDERSHOWITZ: We don’t know what COVID-19 vaccine will look like.\n\nKENNEDY: Anthony Fauci put 500 million of our dollars into that vaccine, and now they’ve got a vaccine and it’s too big to fail.\n\nDERSHOWITZ: Would you urge the American people not to take the vaccine?\n\nDERSHOWITZ: I am asking you the question. What if it was one in 1,000?\n\nKENNEDY: Oh, of course, I’m not gonna tell one in 1,000 people to die.\n\nDERSHOWITZ: I think you overstate it.\n\nKENNEDY: Look at the vaccine inserts, Alan.\n\nKENNEDY: We’re still going to make a profit, so let’s go ahead.\n\nDERSHOWITZ: Certainly, anybody who runs a pharmaceutical company cares deeply about not killing people.\n\nKENNEDY: You can’t sue them. There’s no discovery, there’s nothing. They never get caught.\n\nKENNEDY: The flu shot not only primes you for flu, but it primes you for coronavirus. They are unavoidably unsafe.\n\n– PATRICK BET-DAVID: So, look, we’ve invited a lot of different doctors to want to come and debate the topic of COVID-19 vaccine and everyone’s turned it down. But when it comes down to lawyers, they itch for things like this. So, it’s a different story when we’re talking about my two guests today, who, by the way, both of them have been a guest on “Valuetainment” before, separately on different topics. But today a conversation came up this week. A video popped up about what Alan Dershowitz said that led to a dialogue with Robert Kennedy. And then we said, what we can set up a friendly debate here together. They both agreed. And so, today’s a special episode that we’ll talk about a lot of different things, but prior to going into it, if you don’t know who Alan Dershowitz is, his resume is legendary. 50 years he taught at Harvard. He’s represented some of the most interesting cases. OJ Simpson trial, a lot of different cases. Debate is what he does for a living. And on the complete opposite side, we have Robert Kennedy, where many call him a hero when it comes down to environmental crusader. He’s also obviously a lawyer. They’ve both written books. Alan’s recent book, which you can get free on Kindle right now, it’s “Guilt By Accusation.” It’s on the topic of the Me Too movement. Again, I asked him, do you want us to sell it? He said, no, let him go get the Kindle. So that’s his discretion. You can go get the Kindle. We’ll put the link below as well. Having said that, gentlemen, thank you so much for being a guest on “Valuetainment” and agreeing to do this debate.\n\nKENNEDY: Thank you for having us, Patrick.\n\nBET-DAVID: So, first thing I wanna do is I wanna share my screen and I want the audience to see what led us here. A comment that you made on a podcast you did. And then I’ll go from there asking your thoughts on it. So, here’s what was said in an interview a few weeks ago by Alan. Let’s show a clip of this:\n\nDershowitz – Let me put it very clearly. You have no constitutional right to endanger the public and spread the disease even if you disagree. You have no right not to be vaccinated. You have no right not to wear a mask. You have no right to open up your business.\n\nModerator on video clip – Wait, can I stop you? No right not to vaccinated? Meaning if they decide you have to be vaccinated, we have to be vaccinated?\n\nDershowitz – Absolutely, and if you refuse to be vaccinated, the state has the power to literally take you to a doctor’s office and plunge a needle into your arm.\n\nModerator on video clip – Where is that in The Constitution?\n\nDershowitz – If the vaccination is designed to prevent the spreading disease, if the vaccination is only to prevent a disease that you will get, for example, if there’s a disease that will kill you, you have the right to refuse that, but you have no right to refuse to be vaccinated against a contagious disease. Public health, the police power of the constitution gives the state the power to compel that. And there are cases in the United States that bring forth.\n\nBET-DAVID: So now that interview goes for a while. So, let me bring you back to us here. Alan, those are some strong statements you made. Obviously, his reaction, a lot of people’s reactions, has your position changed since making those statements on that interview.\n\nDERSHOWITZ: The statements I made on the interview were professional statements based on reading Supreme Court cases, not expressing personal views. I have strong personal views, but my constitutional views haven’t changed at all. Let me be very clear. I don’t think this issue is going to come up in the near future because right now, the “New York Times” has a big story today in which they talk about how there’s gonna be a limited number of vaccines and people are gonna be waiting in line to get them. So, the issue is not gonna be confronted as to mandatory vaccines.\n\nYou know, having said that, I wanna just pause for one second and say how important this debate is and how privileged I am to participate in it with a so distinguished conversationalist as Robert Kennedy. I, of course, knew his father. I had actually been offered a job to work with his father when he was Attorney General, but Harvard offered me a job and I decided to take it. I was a great fan of Senator Robert Kennedy, Attorney General Robert Kennedy. And I think I consider myself a friend of the Kennedy family, and I consider myself a friend of Robert Kennedy. I admire enormously the environmental work he’s done. And I think he’s performed an important function by raising issues about vaccination.\n\nWe, as you’ll see in this conversation, we’ll disagree. We’ll probably agree on more things. People will be surprised at our level of agreement, but on the issue of constitutionality, I am confident that this Supreme Court would follow a Supreme Court precedent from 1905 and would say if there is a safe, and that’s crucially important, effective measure that could significantly reduce the contagious impact of a deadly disease, Like the current pandemic virus, that the state would have the power to either directly compel vaccination. Or, for example, condition young students coming to school on being vaccinated or people doing other things that might result in contagion being vaccinated. So, no, I haven’t changed my professional constitutional opinion, but as Robert will tell you, we’ve had conversations offline, and he has persuaded me about a number of things relating to the health and safety and efficacy of vaccines. So, I’ve learned a lot from our conversations and I hope people will learn something from our conversations today, but the constitutional issue in my mind remains the same.\n\nBET-DAVID: So, it’s important to unpack that constitutionally, you remaining same position to say, if the government wanted to mandate and make us take a vaccine, we can’t say anything to it. That position is not changing.\n\nDERSHOWITZ: That’s right. As long as the vaccination is safe and effective. An example, if you have somebody who has unique vulnerability to vaccinations, that person might get a medical exemption. The issue of religious exemption is something the courts have considered most recently. The Supreme Court did just in the last day or two create religious exemptions for private schools, religious schools in terms of whether employment laws operate on religious schools. So we would have to see what the court would say about religious exemptions, but as a general matter, a healthy person who simply has an ideological objection to vaccinations as such, not to this particular vaccination, because of health reasons or vulnerability, the Supreme Court would, I predict, hold that the state could in one way or another compel vaccination either directly or as a condition of people engaging in public activities or activities that could create contagion. Yeah, that’s my position.\n\nBET-DAVID: That’s very important to know because there’s your personal beliefs, which is completely different than what you think will be able to be mandated. So, having said that, Robert, I know you’ve seen this before when this statement was made and in one case, Alan even said he’d be willing to debate Robert Kennedy on this topic, which kind of led to us wanting to do this debate. What was your initial reaction of watching what Alan said and what has changed since you and him have had calls together offline?\n\nKENNEDY: Well, I want to begin by saying thank you Alan for participating in this debate. By the way, Pat you’re familiar, and Alan’s familiar with my voice. I wanna apologize at the outset. It’s really bad in the morning and Alan can only do this in the morning, but hopefully it’ll get better as we proceed. I wanna thank Alan for participating in this debate. I’ve actually been trying to a debate on this issue for 15 years. I’ve asked Peter Hotez, I’ve asked Paul Offit, I’ve asked all of the major leaders who are promoting vaccines to debate me and none of them have. And I think it’s really important for our democracy to be able to have spirited, Civil discussions about important issues like this. This is an issue that’s been on the news 24 hours a day for the last four months, and yet there’s no debate happening about this. It’s all kind of a repetition of the government orthodoxies and government proclamations and democracy functions only when we have the free flow of information. Policy is best often crafted in the furnace of a heated, spirited debate. It is part of our constitutional system, it’s part of America’s tradition. We invented free speech in this country. Is it the First Amendment? And it ought to be something that we celebrate and that we model the world. It shouldn’t be something where you now have democratic leaders, like Adam Schiff, calling on social media sites to censor debate about an important issue. That shouldn’t happen.\n\nSo, I’m very grateful that Alan, who I know loves the First Amendment, for actually agreeing to debate on an issue in which he is at a disadvantage because I’ve spent 15 years working on this issue. I’m in a big disadvantage to him when it comes to talking about constitutional law and I’m gonna try and keep a lot this debate on my side of the issue.\n\nLet me start out by saying I don’t agree with Alan’s, and this is a very small disagreement, because Alan and I have talked a lot offline and I think we’ve come to a place where we really believe this is gonna be a conversation, not a debate, because I think on most of the issues we are in agreement and he made the qualifiers when he came up and he said if it’s safe, if it’s effective. And I think those are the big ifs at the playground where this debate is really happening. And I think in the end, he and I would end up in the same place in that debate.\n\nI will make a minor dispute, which is the Jacobson case, which was decided in 1905 was not a case where the state was claiming the power to go into somebody’s home and plunge a needle into their arm or kick down their door and take them by force. The Jacobson actually what the guy who was resisting was taking the smallpox vaccine. He was from Cambridge, Massachusetts, and the penalty for not taking the vaccine was a $5 fine. It’s like a traffic ticket. He decided to take it. He had been injured in a previous vaccine, so he didn’t want to take this one. He took the case to the Supreme Court, he lost and the remedy was he paid a $5 fine.\n\nThere’s a big constitutional chasm between that remedy, which is paying a fine, and actually going in and holding somebody down and forcibly injecting them. And I’m not convinced the Supreme Court of the United States at this point would uphold that kind of law, nine to zero or eight to one at all. So, let me just say that. Let me now go to the initial place where I think we’re in agreement. I think Alan and I are both in agreement that this should be a voluntary program.\n\nIf there’s mandates, it should be as an ultimate, final, dramatic drastic remedy. And the question is, why can’t we do a voluntary program. When Alan and I were kids people wanted to get vaccinated. There was no fear of this statement of the polio vaccine and people had a tremendous trust in our health regulatory officials. And today, that trust has evaporated to the extent were now 50% of the people who are polled in this country are saying they may not take the COVID vaccine and 27% are hard no. This is even before the vaccine is developed. Why is that happening? That’s the question I think we really have to ask ourselves.\n\nKENNEDY: Why do so many Americans no longer trust our regulatory officials and trust this process? And one of the reasons is, vaccines are very, very interesting and very different kind of medical prerogative because it’s a remedy that is being. It’s a medical intervention that is being given to perfectly healthy people to prevent somebody else from getting sick. And it’s the only medicine that is given to healthy people. So, you would want, and particularly to children who have a whole lifetime in front of them, so you would expect that we would want that particular intervention to have particularly great risk guarantees that it’s safe ’cause you’re saying to somebody, we are going to make you make this sacrifice for the greater good. You have no health problems; you have zero risk of this disease. We are gonna force you to undergo a medical intervention and our side of the bargain should be we want this to be completely safe.\n\nIn fact, what we know about vaccines and this is HHS’s own studies, a 2010 study by the Agency for Healthcare Research. That was commissioned to look at vaccine injury because CDC for many years had been saying vaccine injury only occurs one in a million. What AAHRQ found, which is a federal agency, they looked at one HMO, which was a Harvard Pilgrim HMO, and a machine cluster analysis. In other words, artificial intelligence, counting. Very, very accurate accounting system and they said the actual rate of vaccine injury is 2.6%. That means one at 40 people is seriously injured by vaccines.\n\nDo we have a right to say, we are gonna impose this intervention on people, where there’s a one in 40 chance that you may get injured in order to protect hypothetical people catching that particular disease? For anybody, and this I think is something that Alan really has to, I think Alan, that you need to come to terms with in terms of crafting your own arguments of this, it’s not hypothetical that vaccines cause injury and injuries aren’t rare. The vaccine courts have paid out $4 billion and the threshold for getting into a vaccine court and getting a judgment, HHS admits that fewer than 1% of people who are injured ever even get to court.\n\nThe other thing is vaccines are zero liability. This is an industry that went to Congress in 1996 and it had a diphtheria, tetanus, pertussis vaccine at that time that was causing brain injury in one out of every 300 people. And they said to Congress, we cannot make vaccines safely. They are unavoidably unsafe. That is the phrase in the statute unavoidably unsafe. The only reason that we’re gonna continue to make vaccines is if you give us complete blanket immunity from liability and Congress gave it to them. So today you have a product that if it injured you no matter how negligent the company was, no matter how sloppy their line protocols, no matter how toxic the ingredients they chose to use, no matter how grievous your injury, you cannot sue that company and that company, therefore, no incentive to make that product safe. And that should be troubling to any of us who are part of the legal system that is saying we are gonna force people to take this intervention.\n\nDERSHOWITZ: Look, I agree with much of what Robert has said. First of all, I completely agree the Supreme Court decision in the Jacobson case in 1905 is not binding on the issue of whether or not you can compel somebody to take the vaccine. The logic of the opinion, however, not the holding, the logic of the opinion and subsequent opinions, including some by Justice Oliver Wendell Holmes, strongly suggest that the courts today would allow some form of compulsion if the conditions that we talked about were met. Safe, effective, exemptions in appropriate cases. You talked about healthy people being compelled to take a vaccine, which is not designed to help them. Of course, it’s also designed to help them. But the major function is to make sure that they don’t become typhoid Marys and spread the disease to other people. But when you take a vaccine, you also increase the chances that you will not get the terrible, terrible disease. I think you’re gonna have to concede, Robert, that the smallpox vaccine had an enormous positive impact on wiping smallpox from the face of the earth. Smallpox was a dreaded, dreaded, dreaded disease. The Black Plague back in many, many centuries ago, if there had been a vaccine back then could have saved probably millions of lives. We don’t know what COVID-19 vaccine will look like, but on the assumption, and here we have a real argument, on the assumption that it would be effective and would stop the pandemic and would cause some injury to some people, then you have to ask how the courts would strike the balance.\n\nOliver Wendell Holmes once made an analogy in an unrelated case to being drafted into the Army. When you’re a young 18-year-old healthy person, and we have a draft as we had in the Second World War, we don’t have it now, but at that point in time, a young 18-year-old was told, look, Congress has given the Army complete exemption. We’re not liable if you’re shot by the Nazis or by the Japanese, you have to risk your life in order to protect other innocent people in the country. And it’s not a perfect analogy, obviously, but it does show that the courts have given to the government, the authority to sometimes make decisions that require you to sacrifice your life.\n\nI have to tell you, I don’t wanna become personal about this, but I don’t think there’s any family in the history of America that has ever made more sacrifices in the public interest than the Kennedy family. It broke all of our hearts to see how much sacrifice the Kennedy family personally made in order to, particularly Robert Kennedy. He put himself in harm’s way so many times on behalf of the Civil Rights Movement. People forget how much he put himself in harm’s way on behalf of Israel, He was a great friend of Israel, a great supporter of Israel, and the horrible man who killed him, killed him because he was a Palestinian who hated Bobby Kennedy senior’s views. Sacrifice is part of the American tradition and the Americans owe the Kennedy family an enormous debt of gratitude for their sacrifice. Now those were voluntary sacrifices. President Kennedy went to Dallas, knowing there were risks. Robert Kennedy went to Los Angeles, knowing there were risks. By the way, I was working on his campaign. The night I was woken up in the middle of the night to learn the horrible, horrible, horrible, tragic news. And those were voluntary acts. And obviously we’re talking about a very different thing. We’re talking about involuntary acts, but being drafted as an involuntary act.\n\nAgain, to mention the Kennedy family, the oldest brother of the Kennedy family, volunteered to serve in the Army and was killed in combat as a great hero. But there were others who didn’t volunteer. Many of my own relatives served abroad. So, we demand sacrifices and we don’t demand perfection. I think both Robert and I agree that we live in an age and it’s a terrible time that we live in where everything has become politicized. You mentioned that when we were kids, I remember not being able to swim in the summers of 1953, four or five because of polio. My friend died after being on a lung machine and the blessing that we all made to Salk and Sabin for developing the vaccine. But there were consequences. People took the vaccine and did suffer. In the end though, polio was wiped out. We live in a very divisible age.\n\nLet me mention one other point that I think we should be discussing. Today, “The New York Times” has a very interesting story about who the vaccine will be offered to. The Times story is not about mandatory. It’s about people wanting it and Robert and I completely agree that the program should begin by giving it only to volunteers. We should only get to this terrible tragic choice issue in the end, if it’s absolutely essential that people who don’t want to be vaccinated have to be vaccinated to get the kind of herd immunity. We all agree with that, but we live in such a divided time that everything has become politicized. On July 4th, the Reverend Farrakhan made a speech to almost a million people in which he urged Black people not to take the vaccine because we know the history of how Black people were experimented on during the terrible Tuskegee time. And yet Black people and Latino people and people of color are the most vulnerable to the illness. Is that a smart thing for Farrakhan to have urged his community? The number of people of color who have refused or who have indicated a refusal to take the vaccine is, I think, slightly higher, according to the report, than the number of people not of color, who are refusing to take the vaccine. I understand that. I understand the suspicion that our country has generated among people. People don’t trust people anymore. I wrote an article in early March, right in the beginning, right at the beginning of this, I wrote an article and the title was “Trust Science, but be Skeptical of Scientists.” And at that point, I pointed to two things that were being argued by scientists, including the World Health Organization, which I generally support, saying don’t wear masks, number one. And number two, the COVID-19 is not contagious by air. It has no aerosol contagion.\n\nBET-DAVID: You wrote that article? You wrote that article?\n\nDERSHOWITZ: No, I wrote the article against it.\n\nDERSHOWITZ: I wrote an article saying, don’t believe that. Masks work, number one. If they didn’t work, why would so many doctors be using them? And why would it be so necessary for doctors to have them? And second, I don’t believe that there’s no aerosol transmission. The disease could not have developed so quickly around the world just by touching surfaces. So, I challenged the medical establishment on that. And I turned out, of course, as we all know, to be right, we know there’s aerosol transmission. We know masks have an impact, whether they help you who are wearing it, or whether they only help you in transmitting it. But I would like to throw a question out to Robert. I think I know the answer. Robert, would you be against a law that mandated the wearing of masks in public for everybody, even by people who don’t approve of the wearing of masks. ‘Cause masks don’t kill you. They don’t pose the risk that vaccine do, but they do deprive you of freedom. Do you think the state, the government, has the legitimate constitutional power to mandate the wearing of masks by people who refuse to wear masks?\n\nKENNEDY: Let me come back to that. Let me address some of the other things. ‘Cause I think that’s actually a complex question, and I think the science is very controversial on that. Let me address the earlier thing that you said first. One is, this is a rather esoterical discussion and one that I’m not gonna really drag you into other than to say this. The proposition and the theology that smallpox and polio were abolished due to vaccination is controversial. That is not a proposition that is universally accepted. And if you notice all the infectious diseases, whether it was scurvy or tuberculosis for which there were no vaccines, along with puerperal fever and diphtheria and pertussis and measles all disappeared at the same time without vaccination. Now, the CDC actually examined that because it became such a part of the orthodoxy of vaccines that the idea that smallpox and polio were abolished because of vaccines and these other diseases. Johns Hopkins and the CDC, in 2000, did a comprehensive study of that proposition. The study was published in Pediatrics, which is the Journal for the American Association of Pediatrics, which is a readout fortification for vaccine orthodoxy. So, it’s a publication very, very friendly and supportive of vaccination. For people who want to look up this study, the lead author is Guyer, G-U-I-E-R. And the conclusion of that study is at the abolishment of mortality from infectious diseases that took place during the first half of the 20th Century had virtually nothing to do with vaccines. It had everything to do with sanitation, with nutrition, with hygiene, with electric refrigerators, with reduction in population densities and essentially engineering solution, clean water and good food. And actually that was a guy called Edward Kass, who was the head of Harvard Medical School at that time, who gave a very, very famous speech in which he warned that people who were promoting vaccines and other technologies would try to take credit for those reductions in mortalities from infectious disease, and he said beware of them because they’ll try to monetize them and use that to increase their power and their prestige. So, it’s something that you might look at it. Again, it’s called Guyer, G-U-I-E-R.\n\nI agree with you. There was tremendous faith in vaccination during that period. When you grew up, I grew up Alan, we had to be vaccinated and all of them were deemed as necessary. They were feared diseases. Today’s kids have to take 72 vaccines. 72 doses of 16 vaccines in order to stay in school. And that explosion of new vaccination came in 1989. Right after the passage of VCA, vaccine act. The vaccine act gave blanket immunity from liability to vaccine companies. And so those companies all of a sudden looked around and said holy cow, now we’ve got a product where we are completely excused from the highest cost that afflicts every other medical product, which is downstream liability for injuries. That’s the biggest cost for every medicine.\n\nNot only that, the vaccines have another exemption that most people don’t know about. They are the only medical product that does not have to be safety tested against a placebo. That exemption is an artifact of CDC’s legacy as the public health service, which was a quasi-military agency, which is why people at CDC have military ranks, like Surgeon General and they wear uniforms. The vaccine program was conceived as a national security defense against biological attacks on our country, and they wanted to make sure that if the Russians attacked us with a biological agent, anthrax or something like that, that we could quickly formulate a vaccine and deploy it to 200 million Americans civilians without regulatory impediments. They said if we call it a medicine, we’re gonna have to test it and that takes five years to do double blind placebo testing. Let’s call it something else. We’ll call it a biologic and we’ll exempt biologics from safety testing. So, not a single one of the vaccines, the 72 vaccines now administered to our children, have ever been tested against a placebo. And I, in fact, sued HHS in 2016 and said, show me any placebo studies that you have for any vaccines. And they were unable to do so. None of them have been tested and you don’t have to sue them like I did.\n\nAnybody can go on their cellphone and look up manufacturers insert. Hepatitis B vaccine, Gardasil vaccine, polio vaccine. You know how many days the current polio vaccine. You know how many days it was safety testing for Alan? 48 hours. The hepatitis B vaccine, the Glaxo version, was four days, The Merck version five days. That means that if a baby they gave that to had a seizure on six, it never happened. If the baby died on day six, it never happened. If the baby got food allergies and were diagnosed two years later, it never happened. If the baby got autism, which is not diagnosed until four years of age, 4.2 years of age, it never happened. Autoimmune diseases, you cannot see those if you have short-term studies and you can’t see any risk, if you don’t test it against a placebo. My question is, because of that, nobody knows the risk profile for any vaccine that is currently on the schedule. And that means nobody can say with any scientific certainty that that vaccine is averting more injuries and deaths than it’s causing. And my question is how in the heck can we be mandating to children that they take a medical product for which we do not know risk? And to me, that is criminal.\n\nAnd you know, we started this discussion by talking about how do you avoid a whole discussion about mandating vaccines? The way that you do that is you have a transparent process where people see a vaccine is gonna be tested. They see that it’s tested fairly against a placebo. That there’s long-term tests that are gonna be able to spot all of these difficulties and at its transparent and open, and yet what we’ve seen from the current group of COVID vaccines is none of that’s happening. They’re skipping key parts of the test. Moderna vaccine, which is the lead candidate, skipped the animal testing altogether. When they came to human testing, they tested it on 45 people. They had a high-dose group of 15 people, a medium-dose of 15 people and a low-dose group of 15 people. In the low-dose group, one of the people got so sick from the vaccine they had to be hospitalized. That’s 6%. In the high-dose group, three people got so sick they had to be hospitalized. That’s 20%. They’re going ahead and making two billion doses of that vaccine.\n\nAnd by the way, people that they test them on, Alan, are not typical Americans. They use what they call exclusionary criteria. They are only giving these vaccines, in these tests that they’re doing, to the healthiest people. If you look at their exclusionary criteria, you cannot be pregnant. You cannot be overweight. You must have never smoked a cigarette. You must have never vaped. You must have no respiratory problems in your family. You can’t suffer asthma. You can’t have diabetes. You can’t have rheumatoid arthritis or any autoimmune disease. There has to be no history of seizure in your family. These are the people they’re testing the vaccine on, but that’s not who they’re gonna give them to. What happens? These people are like the Avengers. They’re like Superman. You can shoot them with a bullet and they won’t go down. What happens when they give them to the typical American? Sally Six-Pack and Joe Bag of Donuts, who’s 50 pounds overweight and has diabetes. What is gonna happen then? You’re not gonna see 20%, you’re gonna see a lot of people dropping dead. These people lost consciousness. They had to go to hospital. They had huge fevers. They’re the healthiest people in the world. Unlike any other medicine, Alan, that had that kind of profile in its original phase one study would be DOA.\n\nThe problem is Anthony Fauci put $500 million of our dollars into that vaccine. He owns half the patent. He has five guys working for him who are entitled to collect royalties from that. So, you have a corrupt system and now they’ve got a vaccine and it’s too big to fail. And instead of saying, hey, this was a terrible, terrible mistake. They’re saying, we’re gonna order two billion doses of this and you’ve gotta understand, Alan, with these COVID vaccines, these companies are playing with house money. They’re not spending anything on it and they have no liability. So, if they killed 20 people or 200 people, 2,000 people in their clinical trials, big deal. They have zero liability, and guess what? They’ve wasting our money because we’re giving them the money to play with. People like me and people in our community are looking at this process and we’re saying whatever comes out of that process, we don’t wanna take it ’cause we’re seeing how the sausage is made and it’s really sickening. No medical product in the world would be able to go forward with the profile that Moderna has.\n\nDERSHOWITZ: Let me just respond ’cause I think we’re coming to some common ground here. I have no doubt that transparency and testing is essential. I don’t understand why there isn’t a placebo testing and other testing later after the initial vaccine. So, there are many phases in a vaccine. We have an emergency now, and we may have to, in fact, develop a vaccine and make it available to people without placebo testing, without diversity testing, we may have to do that, but there’s no reason why over time, we can’t do the traditional testing, say with polio or smallpox that are now part of our history and have now existed for so many years. Obviously at this point, there’s no reason not to be able to do the placebo and the other kinds of human testing.\n\nThe article in The Times that I referred to made a very interesting point. It said that the people who were most vulnerable to the disease are the people who probably won’t be part of the original testing. The testing is, as you said, done, mostly on people who are quite healthy, but isn’t there a natural test that occurs?\n\nYou say the pharmaceutical industry has nothing to lose, but look at what happened to the pharmaceutical companies that put forward some of the opiates. They have been driven out of business. Their names have been taken off buildings. They are regarded as pariahs in the world today. Certainly, anybody who runs a pharmaceutical company cares deeply about not killing people.\n\nAnd even if the government doesn’t mandate this kind of testing, and even if they give them exemption from financial liability, surely good people, and I think we assume that people who run companies today, I have a friend who’s trying to develop one of the vaccines and he’s doing it without profit. He feels so strongly about the need to vaccinate people around the world. So, I think you overstated when you say that the people who are developing those vaccines have no concern whatsoever whether people live or die. I think they do have a concern. I think the government has eliminated their financial liability, but would you be sad?\n\nAnd the other thing is you say there’s no testing, but I’m not the expert. I’m not the medical journal reader, but I’ve read enough medical journals to know that there is a lot of natural testing. You cite some of it, you cite some of the arguments that say that over years people get autism, people get this, people get that. Those results don’t come from the initial testing that allowed the product to go forward. They come from great universities, medical schools and public health institutions that continue to test products over time and report to the public the results of those products. Robert.\n\nKENNEDY: Here’s the answer. You raised a bunch of questions. One is the opiate people got busted, Alan, and by the way, no, they were not moral people, they knew what they were doing. Their killing of 56,000 American young kids a year, knowing what they were doing. More kids every year that were killed in the Vietnam War. These are not moral companies. And they only got busted because plaintiff’s attorneys could sue them.\n\nKENNEDY: And they got the discovery documents and walk them down to the U.S. Attorney’s office and said hey, there’s criminal behavior here. That can ever happen in the vaccine space. You can’t sue them. There’s no discovery. There’s no depositions. There’s no class action suit. There’s no multi district litigation. There’s no interrogatories, nothing. They never get caught out.\n\nNow these four companies make all of our vaccines. All 72 of the vaccines shots that are now mandated for our children. Every one of them is a convicted serial felon. Glaxo, Sanofi, Pfizer, Merck. In the past 10 years, just in the last decade, those companies have paid $35 billion in criminal penalties, damages, fines for lying to doctors, for defrauding science, for falsifying science, for killing hundreds of thousands of Americans knowingly and getting away with it.\n\nVioxx which was Merck’s. Merck’s the biggest vaccine producer. Vioxx, which was their flagship product in 2007, was a pill that they marketed as a headache pill that caused heart attacks. They knew it caused heart attacks ’cause they saw the signals in their clinical trials, they didn’t tell the American public and they killed between 120,000 and 500,000 Americans who did not need to die. And most of those Americans were people who had rheumatoid arthritis or they had headaches and migraines. They took that pill believing, and by the way, when we sued them, we got spreadsheets from their bean counters where they said we’re gonna kill all these people, we’re still gonna make a profit, so let’s go ahead.\n\nDERSHOWITZ: Nobody can justify that. I agree with you.\n\nKENNEDY: And they ended up. They should have all gone to prison. Instead, they paid a $7 billion fine, but how can anybody, it requires a cognitive dissonance for people who understand the criminal corporate culture of these four companies to believe that they’re doing this in every other product that that they have, but they’re not doing it with vaccines. They are, and I just wanna answer your other question. No, placebo testing does not take place after the clinical trials. The reason for that is HHS has adopted a very unethical guidance as it is unethical once vaccine is licensed, recommended, it is unethical to do placebo trials or compare of vaccinated versus unvaccinated people. There are scientists who do it, but they’re punished for it. It’s very difficult for them to publish. They get their funding cut off because nobody wants any study that is going to reveal the truth about vaccine injuries. It just does not happen.\n\nDERSHOWITZ: Look, it’s very important that you’re making these points because we live in a democracy and nobody is gonna compel a vaccine unless you get democratic approval. Legislatures are gonna have to pass laws doing that. And you should testify about this. Your voice should be heard, but in the end, how do you respond when the American public has listened to you, has listened to your argument, that very persuasive and very convincing and they have an impact on people like me with open minds. And yet in the end, there’s a vote by the legislature and the legislature votes to compel vaccinations in the public interest just the way the legislature votes to draft young people to fight wars in which they will die. in a democracy, don’t you have to follow the will of the majority?\n\nI agree transparency is all important, and let’s shift the debate ’cause you said you wanted me to answer the question. Let’s take it out of vaccine for one second because I think it helps analytically. I’m a law professor of 50 years. So, I always do hypotheticals, hypos. So, let’s assume the legislature now passes a law. Every 50 States and the United States Congress passes a law requiring everybody to wear a mask when they’re outdoors. And you say, well, I’m not so sure that masks are helpful. Maybe they are, maybe they aren’t. Congress has hearings. Congress makes a determination that on balance, they are helpful. Wouldn’t you agree that it would be constitutional, let’s start with constitutional and then desirable, wouldn’t you agree that it would be constitutional to mandate the wearing of masks, even if people have political, ideological, medical, religious objections because a, the wearing of a mask is only an inconvenience. Maybe it’ll cause a little irritation by some people that will require a topical pharmaceutical, and it has the potential not to save the world, but to improve the possibility of not having communicable diseases. Wouldn’t you agree that mandatory mask wearing would be constitutional?\n\nKENNEDY: Well, if I accepted all of your precedence, then perhaps I would. The thing is, I know a lot about the mask. And my organizations, CHD, has not taken a position on them, but I’ve read at least three med reviews involving hundreds of studies on masks, and the majority of the studies, in fact, there’s a BMJ study from 2015, that says that a mask is actually likely to spread the disease and to make you less healthy because the carbon dioxide that you’re breathing and the people who wear the mask are more likely to get sick. I’m not saying that that’s my position. I’m just saying there’s a lot of contrary science out there.\n\nDERSHOWITZ: Do you wear a mask personally when you go out?\n\nKENNEDY: If the science was clear, if the science was clear, then I’d be much more sympathetic to your view. Let me ask you this. Let me just answer the other question you had. You said we have to rely on the majority. Well, I grew up in the state of Virginia, Alan. When I grew up, it was illegal. The majority voted and it was illegal for a Black man to marry a White woman, illegal for Blacks to vote. So, the majority is not. No, in a democracy, you have the courts there that protect our rights.\n\nKENNEDY: And unfortunately, we are in a situation today where we have tremendous corruption. I don’t mean in Congress, which receives more money from pharmaceutical companies than any other industry, pharmaceutical gives in lobby twice the amount that oil and gas, which is the next big one, four times what defense and aerospace. There are more pharma lobbyists in Congress than there are members of Congress in the Senate. So, we have lost, the legislative independence body, Unfortunately, Alan, the agencies are also captured. Now you know about agency capture. It happens everywhere. I have sued EPA my entire life. We just sued the EPA. We just sued Monsanto. We got an historic judgment, a $12 billion settlement in the Monsanto case and I was part of that trial team. One of the things that happened during that trial is that EPA took a position against us. They took the position that glyphosate, Roundup, has caused cancer. As it turns out we got internal memorandum that show that the head of the pesticide division in EPA was actually working secretly for Monsanto and killing studies and twisting studies and ghost-writing studies to falsify the science.\n\nKENNEDY: We were able to show that to the jury. Now imagine this, that’s EPA, which is an independent agency. Imagine this, FDA has 50% of its budget from vaccine companies, from the industry, 50%. The CDC has an $11.5 billion budget. And 4.9 billion of that is buying and selling and distributing vaccines. CDC is a vaccine company. It owns 57 vaccine patents. So, it can make money on every sale of a vaccine. NIH owns hundreds of vaccine patents. NIH owns half the patent for the Moderna vaccine. There’s five individuals at NIH, and the rules at NIH, if you’re a scientist or an official working on a vaccine you’re allowed to collect $150,000 a year in royalties on sales that that vaccine makes. These regulatory agencies are actually vaccine companies. The vaccine marketing sales part of those agencies is the tail that is now wagging the regulatory dog. They are not doing their job as regulators.\n\nAnd in fact, the senior scientist at CDC today, the senior vaccine safety scientist, who’s been, he’s still in fact, he was a senior scientist there for 18 years, he is the author or coauthor on all of the major studies that CDC has produced on vaccine safety and particularly the studies that show the vaccine does not cause autism. His name is Dr. William Thompson. Three years ago, he came forward and he said, we have been ordered to fake all the science of the last decade on autism. And he said, in fact, we were in the major study, which is called DeStefano 2004, the most study on this subject on PubMed. And he said in that study we found out that Black boys, who got the MMR vaccine had a 363% greater risk of getting an autism diagnosis in Black boys who waited after three to six months. He said he was ordered to come into a conference room with all that data, with his four other coauthors by their CDC boss, Frank DeStefano, who then ordered them to destroy that data in front of him in CDC headquarters and then published that study saying there is no effect.\n\nSo, you have an agency that is really just an arm of industry and the people who are in my community, who are paying who have derided and vilified these mothers who have vaccine-injured children, are being vilified in the press, who are saying, wait a minute, we have read the scientific studies. We have read about the industry corruption. We need to talk about this. They’re being silenced by the press. They’re not allowed to tell their stories. And nobody is talking, not a single member of Anderson Cooper’s staff or Sanjay Gupta has made any effort to talk to Bill Thompson. And he has been begging to be subpoenaed. And he’s still at CDC.\n\nDERSHOWITZ: Look, the reason to do this debate is because I think you perform an important function by bringing out some of these ties, some of these connections. You perform an important function when you bring lawsuits against corrupt pharmaceutical companies. But my question is this, knowing all that you know now and putting aside the issue of let’s assume we didn’t have mandatory vaccinations, let’s assume you win that debate. And it’s only voluntary vaccinations now. And they come forward with a vaccine that they say will stem the tide of the pandemic. And you’re allowed to go on television, on Anderson Cooper. Would you urge all the American people not to take the vaccine? Would you become part of the campaign not to take the vaccine if it were voluntary?\n\nKENNEDY: You know, look. I’m not anti-vaccine. People call me anti-vaccine because of the way I’m marginalizing being silence.\n\nDERSHOWITZ: That’s why I am asking you the question.\n\nKENNEDY: I’m not anti-vaccine. Alan, I’ve been trying to get mercury out of fish for 37 years. Nobody calls me at anti-fish.\n\nDERSHOWITZ: I support you on that, 100%, but what would you do? What would you tell the American public if the vaccine were available, and if you were invited say to speak to members of the Black community, members of the Latino community, members of the general American community? And they said.\n\nKENNEDY: If the vaccine, listen. If they come out with a vaccine that it does what it says it’s gonna do, you give one shot, you get lifetime immunity and there are vanishingly rare, serious injuries. Well, I don’t mind jab site, red nose itching, forget about it. I don’t care. I’m talking about deaths, brain damage, one in a million that may be acceptable. In that case, and it works, then I’d say, I’d tell people, yeah, I’m gonna get it. Let’s go ahead and get it.\n\nDERSHOWITZ: What if it was one in 1,000, not one in a million? That’s more realistic.\n\nKENNEDY: One in 1,000. No, of course, not. I’m not gonna tell one in 1,000 people to die, so that 999 people can avoid COVID, particularly since the holiday rate for COVID I mean a healthy person has basically zero chance dying from COVID. You need to give it to a tremendous number of people to save one life, and the problem with this vaccine is we don’t know if the vaccine is gonna kill more people when you start giving it to those people with the comorbidities, 54% of Americans now has diabetes, overweight, rheumatoid arthritis. 54% of us. I’m not even talking about smokers and vapers. 54% of us has chronic disease. They’re testing it on one group and they’re going to give it to one other and we need to know what the risk factor is in the people that they give it to.\n\nDERSHOWITZ: I agree with that. Let me put you in.\n\nKENNEDY: Let me just say, I completely thought it was gonna be made before. I’ve sued the EPA for many years and it’s a captive agency. What would happen if EPA made half of its annual budget selling coal? That’s what you got with these regulatory agencies. They’re completely corrupt.\n\nDERSHOWITZ: You’re performing an important function doing this. Let me ask you another question. What if we had a system which said this, you have two choices. One, you can have the vaccine or two, you can refuse to take the vaccine, but if you refuse to take the vaccine, you have to remain in quarantine until such time as the pandemic is basically passed. So, it’s your option. The one option you don’t have. You don’t have the third option that is not taking the vaccine and mingling with the public and risking other people getting COVID, not only young people although young people do die. The Broadway actor who had his leg amputated and recently died tragically without any preexisting conditions. What if we gave people that option? Quarantine is the option for refusing to accept the vaccine, but you don’t have the third option of refusing to accept the vaccine and walking around the public without masks.\n\nKENNEDY: That sounds like a reasonable position. The problem is it’s not the way the world works. Let me explain why. Here’s how the world works. And the best analogy is the flu vaccine. So, a flu vaccine is very much like the coronavirus vaccine. We’ve had the flu vaccine for 90 years. So, every year it’s fine-tuned and we perfected. And originally, they told us the flu vaccine you’ll get one shot, you’ll have immunity for life. And then it turned out, no, we need to get it every year.\n\nDERSHOWITZ: Because there are variations of the flu.\n\nKENNEDY: And the same thing is highly likely to happen with coronavirus. Now the Cochrane collaboration, which is the ultimate arbiter for vaccine safety. it is the highest authority and the British Medical Journal have done three giant meta reviews on the flu vaccine literature. So, they look at all the literature that exists. The peer reviewed literature that is on PubMed. I think 127 studies. They did it in 2010, 2014 and 2017. Here’s what they found. CDC said the flu vaccine is 35% effective. That’s what they claim. Cochrane collaboration is that no. You have to give 100 flu shots to prevent one case of flu, number one. Number two, there is zero evidence that the flu shot prevents any hospitalizations or any deaths. Number three, the flu shot transmits the flu. In fact, if you’ve got a flu shot, you’re six times more likely to give somebody else the flu than if you didn’t get the flu shot. And this is true, Alan, for many, many other shots for example, the polio vaccine, which you know about is so good at giving polio to other people that 70% of the polio cases in the world today come from the vaccine.\n\nDERSHOWITZ: So, let me ask you a specific question.\n\nKENNEDY: And the chicken pox. If you go to the chicken pox manufacturer’s insert. It says, if you get this chicken pox vaccine, you should not go near a pregnant woman for six weeks or anybody who is immune compromised. Same with pertussis, you become an asymptomatic carrier. You’re not guaranteeing. And, in fact, AstraZeneca vaccine, the Oxford vaccine, which is the other leader, when they gave it to monkeys, the monkeys continued to transmit the disease and Bill Gates and Fauci have been going on TV saying we may get a vaccine that protects you, but you may still be transmitting it. So why are you gonna lock that guy up in a house. People who are now asymptomatic carriers, ’cause they got Gates’ vaccine.\n\nDERSHOWITZ: Let me agree with you first of all, if they develop a vaccine that only prevents you from getting it, but doesn’t prevent you from transmitting it, I would not be in favor of compelling that vaccine. And I think the Supreme Court would not accept that as a rationale. But I want to ask you a direct question. I’m 81, almost 82 years old. My doctor, who I love and admire, says to me every year come October, you must get the flu vaccine. you must get the vaccine against pneumonia, you must get the vaccine, whatever it is, against shingles. I listened to my doctor, who I love and admire, he has been taking care of me for years. Should I instead listen to you and not take the flu vaccine?\n\nKENNEDY: Nobody should listen to me. People need to do the science themselves. And I would say to you no, listen to your doctor. What Reagan said about Gorbachev. Trust, but verify. You look at the vaccine inserts, Alan. Looked at some of the science and I would say, in a million years I would not take the flu shot. And I’ll tell you why, because this is what Cochrane and BMJ have found. People who take the flu shot are protected against that strain of flu. But they’re 4.4 times more likely to get a non-flu infection. And you might find, and a lot of people do, that they get the flu shot and then they get sick. They’re usually not getting the flu; they’re getting something that is indistinguishable from the flu because the flu shot gives you something called pathogenic priming. It injures your immune system so you’re more likely to get a non-flu viral upper respiratory infection.\n\nIn fact, the Pentagon published a story and you can cite this. It’s by Wolfe, W-O-L-F-E. In January of this year, in which they said the flu shot not only primes you for flu, but it primes you for coronavirus. They had a placebo group and they had a vaccine group because they wanted it for military readiness to see if the flu shot was prophylactic against coronavirus. What they found is actually the people who got the flu shot were 36% more likely to get coronavirus. And that’s not a lone study. We found six other major studies that say the same thing. If you get the flu shot, you’re more likely to get coronavirus. This is what the science says and you should not listen to me, nobody should.\n\nDERSHOWITZ: So, let me understand the implications of your position on the flu shot. Not only would you not take the flu shot and urge me to look at the science and in the end, decide not to take the flu shot because it’s too dangerous, but you would also, if I take the implications of your position accurately outlaw flu shot, make it illegal, because in your view and in the view of the scientist you quote, the flu shot causes more harm than good and increases the chances of us all getting the coronavirus. Do I understand the implications of your view correctly?\n\nKENNEDY: Yeah, but I wouldn’t take that sort of extreme position. What I would say is we should have vaccines, but we shouldn’t have a one-size-fits-all mandates. There may be some situations where even a flu shot would be beneficial to somebody because a flu shot is not completely ineffective. It does probably give you protection against that year’s flu strain, if they get it right. And there could be a situation where somebody’s life depended on getting that flu shot, but to mandate the flu shot population wide I think is criminal. Look, all you have to do Alan, and this is what Cochran said, is look what’s happened to longevity in the elderly, since we started mandating the flu shot to elderly people. Those are the people; their life expectancy had dramatically gone down as the flu shot proliferated. And if you see the people who died during the COVID crisis, and there’s no science on this, but it’s observational, it tended to be people who got their flu shots. People who were in nursing homes who all get flu shots. People who are first responders who get flu shots.\n\nDERSHOWITZ: So, with all due respect, I don’t understand the implications of your position. If you’re right, why wouldn’t it follow that the flu shot should be illegal? You said it’s criminal to mandate the flu shot because it kills people in my age category. So if you had to cast the deciding vote, if you had decided to run for Congress, instead of doing the great work you’ve done over so many years, and you were the deciding vote in the United States Senate, and there was a bill to outlaw the flu shot, Why wouldn’t you vote for it if you think it causes harm?\n\nKENNEDY: I’m kind of a free market guy, I think. You know what, I’m against mandates. I think there may be situations where that product might do some good for somebody, but I just don’t believe it should be mandated. I wouldn’t think, for example, that Viagra should be mandated to every human being on the planet, right. But there may be somebody who says I wanna take that medication. Let them do it. I’m not gonna order everybody to do it.\n\nDERSHOWITZ: Look, you and I are on the same page there. I’m curious what you think of this. ‘Cause I feel very strongly about this. Let’s assume you have a drug or pharmaceutical that hasn’t been tested, that is potentially dangerous, but has a 10% chance of curing pancreatic cancer in terminally ill patients. Do you agree with me, and with President Trump on this issue, that individuals who are dying should have the opportunity to go off label and to take dangerous drugs that probably will kill them, but increase the chances that they remain alive? That that should be a matter of individual choice.\n\nKENNEDY: I have a big libertarian streak in me. I think people should be left to their own choices wherever possible unless it’s gonna do some harm to others. Let me address just one last thing that you were talking about.\n\nDERSHOWITZ: We agree with that, we both agree with John Stuart Mill.\n\nKENNEDY: I think we agree on most of it. You said if it’s tested against placebo and this, I think is why people like me, are suspicious, are reticent. The Oxford vaccine, which is the other leader. Gates has a huge investment in it, Fauci is pushing it. It is a leader. AstraZeneca now is branding it. That vaccine is run by a guy called Andrew Pollard, who’s at Oxford. A very, very famous, powerful virologist. He originally promised, at the beginning, he said, we’re going to test it against the placebo. We’re gonna do what’s never been done in vaccinology before we’re gonna actually use an inert placebo and test it. And then in the middle of his phase two, he said no, we’re gonna test it against the meningitis vaccine. The meningitis vaccine is a vaccine with a really high injury profile. It has, listed just on its manufacturing insert are 50 deadly serious injuries, including Kawasaki disease, Guillain-Barre, paralysis, seizure, heart attacks and death and hepatitis and all kinds of autoimmune disease. It’s probably, it’s arguably the most dangerous vaccine.\n\nSo instead of giving his placebo group an inert placebo he’s giving him the most dangerous vaccine. Again why? It’s a ploy that vaccinologist use. They give their placebo group something that’s horrendously dangerous to mask injuries in the vaccine. And so, everybody on my side sees this and they say, he’s not being honest. We do not know what the risk profile of that product is. We are never gonna take that product because it was never tested against a placebo. Make them do the science. Don’t say to get angry at people who are skeptical and say, oh you’re skeptical. We’re watching the sausage get made, and it’s an ugly process. And by the way, he gave that vaccine to a bunch of monkeys, macaques, and then he challenged the macaques by exposing them to the wild coronavirus.\n\nKENNEDY: All of the macaques got sick. So, the vaccine doesn’t work, but because the British government put 90,000 pounds into it, he now has an order to make two million doses with a vaccine we know doesn’t work and they’re going forward with it anyway. And he refuses to test it against the placebo. So that gives us zero faith.\n\nDERSHOWITZ: So, let me, first of all, say nobody should be angry at you. People should be praising you for bringing this to the attention of the American public. Let me just summarize if I can, my view, and then you can get the last word. I am thrilled that we had this debate. I think the public watching the debate has learned. We’ve learned how much we agree about. We’re both libertarians. We both agree with John Stuart Mill that the government shouldn’t be compelling you to do anything just for your own good, but they can compel you to do things that prevent harm to others. Oh, we have some disagreements about mandates. I think we both agree that any vaccine should start out by being offered voluntarily. We both agree that people should be offered the vaccine initially and take it on a voluntary basis. And that mandatory vaccination, which presents very daunting, moral and constitutional issues should not be required until it’s proved absolutely necessary by the consensus of medical opinion. I think we also agree that the First Amendment and the spirit of the First Amendment requires that this debate continue.\n\nAnd so, I’m pleased that we had this debate. You’ve persuaded me about some of the medical issues. I will look further into medical issues. I don’t think I’ve persuaded you on the constitutional issues. And I know you haven’t persuaded me on the constitutional issues. I still take the position though in a democracy the courts do have the final word that I do believe that if there were legislation mandating in extreme circumstances with safety and other considerations taken into account, mandatory vaccination, I do believe the Supreme Court would and should uphold mandatory vaccination under those circumstances. That’s the major area we disagree with. But in practical terms, I suspect we don’t have a lot of disagreement that will come to fruition in the next year or so because in the next year the big issue will be how to get the vaccine voluntarily to as many people as possible who are willing to take it. And so, thank you for putting together this debate. I think it really was informative. And thank you Robert, for accepting the idea of debating on this issue.\n\nKENNEDY: Thank you, Alan. I wanna express my gratitude to you on behalf of myself and everybody in this community. People who are called the anti-vax. They’re mainly not anti-vaccine. Almost all of them are the mothers and fathers, of intellectually disabled kids who gave all the vaccines, who did what they were told and then their child was injured and that prompted them to go out and do the research. Those people should be allowed to speak. Those people should not be gagged. They should not be considered heretics. They should be allowed to tell their story and they should be treated with compassion and understanding and patience and intellectual openness toward their stories. They shouldn’t be vilified. They shouldn’t be gaslighted. They shouldn’t be ignored and right now, particularly at a point in our history, where we’re talking about giving lots of people a vaccine their stories are more important to hear than ever.\n\nI wanna thank you. ‘Cause for 15 years, all of us have been trying to do a debate and we haven’t been able to get Peter Hotez to do it. We haven’t been able to Paul Offit, Ian Lipkin, any of the leaders have been have been scared to sit where you are now. And I want to thank you so much on behalf of all of us, but also our democratic traditions for coming here. Thank you, Alan.\n\nDERSHOWITZ: Well, thank you Robert.\n\nBET-DAVID: Gentlemen, one thing I do wanna say, I’m glad I got through my 28 questions with you guys. It was very good. And I know one thing is we have to make this disclaimer that this debate is not sponsored by Viagra, even though Robert brought up Viagra. I’ll make sure next time we’re in Boston, I avoid taking you to my favorite sushi spot since you are anti-fish. I had no clue until today’s debate that Robert is anti-fish. And by the way, based on how this goes, if the audience comes back, we may reach out to you for part two again. If there’s other topics we can touch up. Alan, thank you so much for you time. Robert, thank you so much for your time. Take care, everybody appreciates you guys, thank you.\n\nKENNEDY: Thank you very much, Patrick.\n\nBET-DAVID: So, can you imagine for 15 years, Robert Kennedy has been waiting for one person to wanna debate the issue of vaccine and Alan Dershowitz, the attorney constitutional lawyer, finally said yes, and this took place. You had a chance to watch both of them go at it. I’m curious to know if either one of them change your mind, comment below. And on top of that, you know what I’d like to see take place is to get someone who’s a doctor, any one of them, Offit, Hotez, anybody that you would like to see debate, go on Twitter and tweet them and myself saying, we’d like to see you debate Robert Kennedy on “Valuetainment,” and outside of that, look, I got two other interviews I want you to watch. One of them is my full interview I did with Robert Kennedy, which is an even deeper interview on the topic of vaccine than this one. If you’ve not watched it, click over here. And the other one is a debate format that we had about a year ago, where we had two folks come, somebody who’s from U.S. Navy Intelligence and another person that was a director of a developmental director from normal. And they debated marijuana. We went to cocaine, alcohol, very, very good debate live right here in my office. If you’ve not watched that, click over here. And if this topic of vaccine is important to you, you are directly or indirectly affected by this, help share this video on the topic started out there by people talking about it, whether you’re a pro or anti, shared this video with others. Facebook, Twitter, text, whatever it may be, so we can get a lot of eyeballs for people start talking about this debate as we’re getting closer to possibility of a mandated vaccine for coronavirus. And if you enjoyed the video today, please click the subscribe button. Take care everybody, bye-bye.", "opengraph": {"locale": "en_US", "type": "article", "title": "Robert F. Kennedy, Jr. vs Alan Dershowitz: The Great Vaccine Debate!", "description": "The following is a transcript of this video. Also see related article. Introduction: (Video excerpts)   PATRICK BET-DAVID: There will soon be a new vaccine for the coronavirus pandemic. The question is, are these vaccines safe and can the government force you to take them? When it comes down to lawyers, they itch for things […]", "url": "https://childrenshealthdefense.org/transcripts/robert-f-kennedy-jr-vs-alan-dershowitz-the-great-vaccine-debate/", "site_name": "Children's Health Defense", "article:publisher": "https://www.facebook.com/ChildrensHealthDefense/", "article:modified_time": "2023-01-06T18:43:06+00:00", "image": "https://childrenshealthdefense.org/wp-content/uploads/IMG_5042.jpg", "image:width": "1024", "image:height": "576", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": null, "height": null, "embed_code": "<iframe src=\"https://www.youtube.com/embed/IfnJi7yLKgE\" allowfullscreen=\"\" allow=\"encrypted-media\" style=\"position: absolute; top: 0px; right: 0px; bottom: 0px; left: 0px; width: 100%; height: 100%;\"/>", "src": "https://www.youtube.com/embed/IfnJi7yLKgE"}], "links": ["https://childrenshealthdefense.org/news/vaccine-debate-is-on-robert-f-kennedy-jr-vs-alan-dershowitz/", "https://childrenshealthdefense.org/about-us/sign-up/", "https://childrenshealthdefense.org/about-us/donate/"], "authors": [], "publish_date": null}