{"result_id": "062019", "URL": "https://childrenshealthdefense.org/defender/covid-vaccines-injuries-closed-door/", "timestamp": "2023-04-25 14:37:26 CEST+0200", "meta": {"description": "The National Academies of Science, Engineering, and Medicine met for three days — behind closed doors, except for a two-hour public comment period — to review the epidemiological, clinical and biological evidence on adverse events associated with COVID-19 vaccines.", "lang": "en", "keywords": "", "favicon": "https://childrenshealthdefense.org/wp-content/themes/chd-theme/images/favicon.ico", "canonical": "https://childrenshealthdefense.org/defender/covid-vaccines-injuries-closed-door/", "encoding": "utf-8"}, "image": null, "domain": "childrenshealthdefense.org", "title": "Committee Reviewing COVID Vaccine Injuries Meets Behind Closed Doors", "cleaned_text": "Miss a day, miss a lot. Subscribe to The Defender's Top News of the Day. It's free.\n\nThe National Academies of Science, Engineering, and Medicine (NASEM) met for three days — behind closed doors, except for a two-hour public comment period — to review the epidemiological, clinical and biological evidence on adverse events associated with COVID-19 vaccines.\n\nThe committee will generate a report that will be used to add injuries to the federal vaccine injury table, which lists known adverse events associated with existing vaccines.\n\nThis list helps the National Vaccine Injury Compensation Program (VICP) and Countermeasures Injury Compensation Program (CICP) — both part of the Health Resources and Services Administration (HRSA) — to decide whether to compensate vaccine injury claims.\n\nHistorically, NASEM meetings have been open to the public — but this year’s meetings were closed, except for the two hours of public comment required by federal law.\n\nNASEM livestreamed the public comment period, during which each speaker was limited to three minutes of comments.\n\nBrian Hooker, Ph.D., P.E., chief scientific officer for Children’s Health Defense was among those who delivered comments.\n\n“I have little hope that this National Academies committee of experts will do anything but simply rubber stamp the safety of the COVID-19 vaccines that were recommended and even mandated to the population of the United States.”\n\nThe committee is meant to be a neutral external body, but the review is done at the request of the U.S. Department of Health and Human Services (HHS) and partially funded by the Centers for Disease Control and Prevention (CDC).\n\n“This is the same CDC that discovered as early as February 19, 2021, that mRNA vaccines were causing myocarditis in adolescent and young males, just 10 weeks after the rollout of the first vaccines.\n\n“However, CDC immunization safety officials, including director Dr. Tom Shimabukuro, hid this information until they made the tacit assertion over three months later on May 27, 2021, that there might be a connection between vaccines and myocarditis.\n\n“While CDC officials lied about this adverse event, the U.S. vaccination rate climbed from 8% to over 50% — increasing profit to the vaccine manufacturers who have fully captured this agency.”\n\nVaccine injury lawyer Aaron Siri told the committee that in his experience helping clients to file claims, past NASEM reports were “incredibly consequential.”\n\n“They are documents that are going to be used by the federal government to fulfill their duty … to fight against any claim of compensation,” Siri said, adding:\n\n“Your task, as I understand it, is to review the medical literature. But understand that pharmaceutical companies don’t have an interest in conducting the studies and neither do our federal health agencies.”\n\nHe said the experts he has deposed use the absence of evidence in these reports for any given side effect as evidence the side effect doesn’t exist. They then deny people’s injury claims on that basis.\n\nSiri implored the committee to take seriously the testimonies offered by vaccine-injured people in the public comments when considering what to include in the report.\n\nThe committee is led by Kathleen Stratton, Ph.D., who was involved with the 2004 Institute of Medicine report cited as “proof” that vaccines don’t cause autism when there were 5,000 cases pending with the VICP.\n\nLeaked documents showed that Stratton coordinated with the CDC to deny any links between vaccines and autism.\n\nReed Grimes, M.D., Ph.D., director of the division of injury compensation at the HRSA, and Dr. Tom Shimabukuro, deputy director of the CDC’s Immunization Safety Office, gave presentations at the committee’s first meeting, which was held in January and posted online.\n\nThe committee is also reviewing the literature on the administration of vaccines and shoulder injuries. Its findings are expected in March 2024.\n\nVaccine Injury Compensation Program ‘would be unrecognizable’ to its founders\n\nThe more than 30 people who made public comments included vaccine-injured people, physicians, attorneys, researchers working to identify vaccine injuries and treatments, and members of the React19 advocacy group, which has compiled 3,400 peer-reviewed studies listing COVID-19 vaccine adverse events.\n\nSpeakers shared extensive personal, scientific and legal evidence of adverse events associated with the COVID-19 vaccines.\n\nVaccine-injured speakers included Brianne Dressen, who received a dose of AstraZeneca’s vaccine as a volunteer in a clinical trial. Her debilitating side effects, including POTS, tinnitus and other symptoms were not included in the AstraZeneca clinical trial report, even despite the fact they were recognized by the National Institutes of Health (NIH).\n\nDressen told the committee she remained “perplexed” by the scientific process and said, “I ask for you to please take an honest and unbiased look at the literature that exists. Please do your part and make sure that these people that are suffering are not discarded, that we are not erased and we are not dismissed.”\n\nDr. Joseph Fraiman, the lead author of a peer-reviewed study on serious mRNA vaccine side effects, spoke to share the results of his research with the committee, emphasizing that there was “no question” that serious adverse events were associated with the mRNA vaccines.\n\nThe many speakers drawing attention to severe side effects linked to the vaccines included Dr. Peter McCullough, who drew the committee’s attention to the fact that “Pfizer reported 1,223 deaths that occurred in their 90-day mandatory part post-marketing data.”\n\nHe reminded the committee that the U.S. Food and Drug Administration (FDA) attempted to block the release of Pfizer’s clinical trial data, and that research ongoing at multiple U.S. universities indicates hundreds of thousands of deaths are associated with the vaccine.\n\n“I conclude that the National Academies should join in support for full withdrawal of COVID-19 vaccines from current use in the United States, and they begin a fair evaluation and compensation for the large number of individuals who have suffered vaccine injuries, disabilities, and deaths.”\n\nDr. Meryl Nass, internist and biological warfare epidemiologist, said the committee must bear in mind the FDA’s Benefit-Risk Assessment and drug regulatory decision-making, which, she said, “states for a drug to be approved for marketing FDA must determine that the drug is effective and that its expected benefits outweigh its potential risks to patients.”\n\nShe presented data — noting the committee did not allow any commenters to share slides they had prepared for the committee — showing how quickly efficacy wanes for any of the vaccines.\n\nAlbert Benavides, who runs the Vaersaware.com website told the committee that miscoding or undercoding and delayed publication in the Vaccine Adverse Event Reporting System (VAERS) has hidden thousands of serious adverse events.\n\nSeveral speakers commented on the way these reports are misused by the VICP and the CICP.\n\nProfessor Renee Gentry, director of the Vaccine Injury Litigation Clinic at The George Washington University Law School, told the committee that over the last ten years, she witnessed, “the aggressive delegitimization of all non-table vaccine injuries by HHS.”\n\nShe said the HHS has aggressively fought against any claims regarding injuries not on the list, despite the fact that vaccine-injured people are legally permitted to make claims for injuries whether they are on the list or not.\n\n“The hard line drawn by HHS in contesting these cases, I believe, contravenes congressional intent as well as the intent of this committee and pushed the vaccine court further into the protracted litigation of the civil arena that Congress hopes to avoid.”\n\nShe explained that the stakeholders that created the VICP — vaccine manufacturers, lawyers and parents — set it up to be petitioner-friendly, informal, generous and non-adversarial, adding:\n\n“The congressional record at the time recorded Congress’ admonition that it was better to compensate someone who was not injured by the vaccine than to fail to compensate someone who was …\n\n“I believe the VICP as it exists today would be unrecognizable to those original stakeholders. In some circumstances, HHS’ unrelenting opposition to vaccine injuries using epidemiology discussed by this committee has resulted in the elimination of entire categories of injuries …\n\n“In order to guarantee a strong and successful universal immunization program, you must have a vibrant safety net for those rare individuals who are injured. A compensation program must be a reasonable and meaningful alternative to civil litigation or it has failed.”\n\nThe PREP Act protects vaccine makers from liability for injuries or deaths associated with Emergency Use Authorization vaccines, but they can be held liable for injuries caused by a fully licensed vaccine — unless that vaccine is added to the CDC’s childhood vaccination schedule.\n\nThe COVID-19 vaccine was added to the schedule earlier this year.\n\nPeople injured by vaccines listed on the childhood schedule can seek compensation through the taxpayer-funded VICP, a no-fault alternative to the traditional legal system for resolving vaccine injury claims.\n\nHowever, the revisions voted on by the ACIP committee last year explicitly state (slide 24) that the COVID-19 vaccines are not covered under the VICP.\n\nInstead, the COVID-19 vaccines added to the childhood schedule will remain covered by the CICP.\n\nAs of Jan. 1, 2023, since the CICP was established in 2010, 11,596 claims have been filed (95% COVID-19-related).\n\nOnly 19 claims related to COVID-19 filed with the CICP have been found eligible for compensation, though no compensation has yet been paid.\n\n10,604 claims are still under review.\n\nDuring the first NASEM meeting, Dr. Chandy John, professor of pediatrics at Indiana University School of Medicine, asked HRSA’s Grimes when the COVID-19 vaccines that are fully approved by the FDA would move from coverage under CICP to VICP, saying many concerned parents were asking this question of their infectious disease group.\n\nGrimes gave no timeline. Instead, he simply listed the steps in the process.\n\nHe said to move to VICP coverage, a vaccine needs to be recommended for routine administration for children and pregnant women, it needs to have an excise tax imposed upon it through the legislature, and there needs to be a notice of coverage published in the federal record.\n\n“So once those things all happen that is when the VICP would cover the COVID-19 vaccines, if those three things were all to happen.”\n\nListen to all of the public comments here:", "opengraph": {"locale": "en_US", "type": "article", "title": "Committee Reviewing COVID Vaccine Injuries Meets Behind Closed Doors", "description": "The National Academies of Science, Engineering, and Medicine met for three days — behind closed doors, except for a two-hour public comment period — to review the epidemiological, clinical and biological evidence on adverse events associated with COVID-19 vaccines.", "url": "https://childrenshealthdefense.org/defender/covid-vaccines-injuries-closed-door/", "site_name": "Children's Health Defense", "article:publisher": "https://www.facebook.com/ChildrensHealthDefense/", "article:modified_time": "2023-04-03T15:33:11+00:00", "image": "https://childrenshealthdefense.org/wp-content/uploads/covid-vaccines-injuries-closed-door-feature.jpg", "image:width": "1600", "image:height": "834", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/about-us/sign-up/?utm_source=top_of_article&utm_medium=the_defender&utm_campaign=sign_ups", "https://www.nationalacademies.org/", "https://www.nationalacademies.org/event/03-27-2023/review-of-relevant-literature-regarding-adverse-events-associated-with-vaccines-meeting-2", "https://childrenshealthdefense.org/defender/deaths-adverse-events-updated-covid-booster-shots-vaers/", "https://www.hrsa.gov/sites/default/files/hrsa/vicp/vaccine-injury-table-01-03-2022.pdf", "https://www.hrsa.gov/vaccine-compensation", "https://www.hrsa.gov/cicp/cicp-data", "https://childrenshealthdefense.org/defender/prep-act-covid-vaccine-injury-liability/", "https://www.nationalacademies.org/documents/embed/link/LF2255DA3DD1C41C0A42D3BEF0989ACAECE3053A6A9B/file/D2F51ED2957E6CA28FA1D8A32572C962E9AEAD06EF0F?noSaveAs=1", "https://www.nationalacademies.org/event/03-27-2023/review-of-relevant-literature-regarding-adverse-events-associated-with-vaccines-meeting-2", "https://childrenshealthdefense.org/authors/brian-hooker-ph-d-p-e/", "https://childrenshealthdefense.org", "https://childrenshealthdefense.org/defender_category/covid/", "https://ijvtpr.com/index.php/IJVTPR/article/view/61", "https://pubmed.ncbi.nlm.nih.gov/20669467/", "https://www.putchildrenfirst.org/chapter6.html", "https://vimeo.com/790565335", "https://react19.org", "https://www.science.org/content/article/rare-cases-coronavirus-vaccines-may-cause-long-covid-symptoms", "https://childrenshealthdefense.org/defender/rfk-jr-defender-brianne-dressen-media-censoring-vaccine-injury-stories/", "https://pubmed.ncbi.nlm.nih.gov/36055877/", "https://childrenshealthdefense.org/defender/rfk-jr-podcast-dr-peter-mccullough-vaccines-are-failing/", "https://childrenshealthdefense.org/defender/fda-pfizer-documents-vaccine-adverse-events/", "https://childrenshealthdefense.org/defender/cdc-fda-breaking-law-meryl-nass-rfk-jr-podcast/", "https://www.law.gwu.edu/vaccine-injury-litigation-clinic", "https://childrenshealthdefense.org/defender/prep-act-covid-vaccine-injury-liability/", "https://childrenshealthdefense.org/defender/cdc-covid-mrna-vaccine-childhood-schedule/", "https://www.cdc.gov/vaccines/acip/meetings/downloads/slides-2022-10-19-20/2023-Immunization-Schedule-508.pdf", "https://medicine.iu.edu/faculty/7418/john-chandy"], "authors": [], "publish_date": null}