{"result_id": "062036", "URL": "https://childrenshealthdefense.org/defender/bbc-astrazeneca-vaccine-injuries-lawsuit/", "timestamp": "2023-04-25 14:37:42 CEST+0200", "meta": {"description": "In a departure from its largely pro-COVID-19 vaccine coverage of the past several years, the BBC — Britain’s national broadcaster — is covering news that AstraZeneca is facing lawsuits over claims the drugmaker’s COVID-19 vaccine caused injuries and deaths.", "lang": "en", "keywords": "", "favicon": "https://childrenshealthdefense.org/wp-content/themes/chd-theme/images/favicon.ico", "canonical": "https://childrenshealthdefense.org/defender/bbc-astrazeneca-vaccine-injuries-lawsuit/", "encoding": "utf-8"}, "image": null, "domain": "childrenshealthdefense.org", "title": "BBC Veers From Official Narrative, Reports on AstraZeneca Vaccine Injuries and Lawsuit Against the Drugmaker", "cleaned_text": "Miss a day, miss a lot. Subscribe to The Defender's Top News of the Day. It's free.\n\nIn a departure from its largely pro-COVID-19 vaccine coverage of the past several years, the BBC — Britain’s national broadcaster — is covering news that AstraZeneca is facing lawsuits over claims the drugmaker’s COVID-19 vaccine caused injuries and deaths.\n\nThe BBC last week reported that the husband of a popular BBC newscaster personality who died of complications from the AstraZeneca COVID-19 vaccine is taking legal action.\n\nGareth Eve told the BBC he had not had any success in engaging with the government, leaving him no choice but to go the legal route.\n\n“Any engagement is fleeting at best so that’s the reason that we’re left with no alternative,” Eve said. “If the government or AstraZeneca don’t want to engage with us then what else are we supposed to do?”\n\nEve’s wife, Lisa Shaw, who worked for BBC Radio Newcastle, died in May 2021 at the age of 44, one week after receiving the first dose of the vaccine.\n\nIn August 2021, a coroner ruled that Shaw died of vaccine-induced thrombotic thrombocytopenia — a condition that leads to swelling and bleeding of the brain.\n\nEve joined a group of approximately 75 claimants, represented by solicitor Peter Todd, who are suing AstraZeneca.\n\nComedian Jimmy Dore aired an excerpt from a recent BBC report on AstraZeneca’s legal woes on Monday’s episode of “The Jimmy Dore Show.”\n\nLast week’s BBC report came on the heels of a new peer-reviewed study that identified an increased risk of cardiac death in women after taking a non-mRNA vaccine, including the AstraZeneca and Johnson & Johnson (Janssen, or J&J) COVID-19 vaccines.\n\nAccording to the BBC’s “Look North” program:\n\n“Lawyers acting for families of alleged victims of the AstraZeneca vaccine are asking anyone who feels they may have been affected to come forward.\n\n“Law firms are planning legal action for compensation on behalf of dozens of families whose loved ones died or suffered ill health after having the vaccine lawyers claim as a result of the AstraZeneca jab.”\n\nTodd, who has been active in litigation related to vaccine injuries in the U.K., appeared in the report. He said that under British law, those who allege they were injured have three years from the date of their injury to file a claim.\n\nDore, reacting to the report, said:\n\n“And so, the fact that they’re doing that, I think it’s a major turning point, and people are actually starting now to have rational conversations about what was done to us.”\n\nOn Jan. 10, Children’s Health Defense and other plaintiffs filed an antitrust lawsuit against the BBC, The Associated Press, Reuters and The Washington Post — members of the “Trusted News Initiative” — alleging the media outlets formed a partnership to “collectively censor” non-establishment narratives pertaining to COVID-19.\n\nNew study: Young women who get AstraZeneca Shot at 3.5 times greater risk of heart issues and death\n\nDrawing on official data from England, a peer-reviewed article published March 27 in Nature Communications found “an increase in cardiac death in women after a first dose of non mRNA vaccines.”\n\nNon-mRNA vaccines include the AstraZeneca COVID-19 vaccine — which was not offered in the U.S. — and the J&J COVID-19 vaccine, which was. Both vaccines use a similar adenovirus technology.\n\nAccording to the study, young women ages 12-29 had a 3.5 times higher risk of heart problems and death in the first three months after receiving the first dose of the AstraZeneca vaccine.\n\nThe study used data from the U.K.’s Office for National Statistics, beginning on Dec. 8, 2020, when the first COVID-19 vaccines were made available in the country, until March 31, 2022 (in the case of hospital deaths) and June 8, 2022 (for all other registered deaths).\n\n“The subgroup who received AstraZeneca’s COVID vaccination, was more likely to be clinically vulnerable,” and those “who were extremely clinically vulnerable may be at greater risk of adverse events following vaccination than the general population,” the study read.\n\nAs of July 27, 2022, the Medicines and Healthcare products Regulatory Agency (MHRA) — the U.K.’s vaccines regulator — had received reports of 444 cases, including 80 deaths, of major thromboembolic events (blood clots) with concurrent thrombocytopenia (low platelet counts) in people who received an AstraZeneca COVID-19 vaccine. Six of the deaths occurred after the second dose.\n\nOn April 7, 2021, just months after the AstraZeneca COVID-19 vaccine was made available to the public, EU regulators announced a “possible link” between the vaccine and “very rare” blood clots.\n\nThis followed a review by the European Medicines Agency (EMA) of 62 cases of cerebral venous sinus thrombosis and 24 cases of splanchnic vein thrombosis reported in the EU drug safety database (EudraVigilance) as of March 22, 2021. Eighteen of the cases had resulted in death at the time of the review.\n\nOn the same day, the U.K.’s Joint Committee on Vaccination and Immunisation (JCVI) acknowledged reports of an “extremely rare adverse event of concurrent thrombosis (blood clots) and thrombocytopenia … following vaccination with the first dose of AstraZeneca.”\n\nThrombocytopenia, or low platelet count, is a condition that leads to swelling and bleeding of the brain.\n\nJCVI cited data suggesting “there may be a trend for increasing incidence of this adverse event with decreasing age, with a slightly higher incidence reported in the younger adult age groups.”\n\nA recommendation issued by the MHRA that same day offered those under age 30 an alternative to the AstraZeneca COVID-19 vaccine if one was available after MHRA found that, by March 2021, 79 people had suffered “rare” blood clots after vaccination — and 19 of them died.\n\nA month later, on May 7, 2021, JCVI updated its guidance, advising against the AstraZeneca vaccine for individuals under age 40.\n\nOn Dec. 14, 2021, the U.S. Food and Drug Administration (FDA) issued similar guidance for the J&J vaccine, adding a contraindication to the shot for adults with a history of thrombosis with thrombocytopenia syndrome (TTS) following the J&J or any other adenovirus-vectored vaccine.\n\nAnd two days later, on Dec. 16, 2021, the Centers for Disease Control and Prevention made a “preferential recommendation” that people 18 and older get the Pfizer-BioNTech or Moderna mRNA vaccines instead of the J&J shot.\n\nThe FDA said at the time that TTS was reported in men and women, in a wide range of ages, with the highest rate in women ages 30 to 49. The agency noted approximately 15% of TTS cases were fatal.\n\nPreviously, a May 2021 study published in The BMJ confirmed evidence of blood clotting and found a small risk after receiving just one dose of AstraZeneca’s vaccine.\n\nMore cases of AstraZeneca vaccine injuries and deaths coming to light\n\nSeveral new cases of individuals who died of complications from the AstraZeneca vaccine have been reported recently, including by the BBC.\n\nThe BBC on Dec. 13, 2022, reported that the death of 27-year-old man from a blood clot was a “direct result” of the AstraZeneca COVID-19 vaccine.\n\nJack Last, who was described as “fit and well,” received the vaccine on March 30, 2021. A week later, after experiencing headaches and sickness, he was admitted to the hospital, where on April 10, 2021, he was diagnosed with cerebral venous sinus thrombosis. He died 10 days later.\n\nIn another instance, an inquest concluded in August 2022 that the AstraZeneca COVID-19 vaccine caused the “catastrophic brain injury” that led to the death of a 48-year-old U.K. rock singer known as Zion.\n\nZion developed an “excruciating” headache on May 13, 2021, eight days after receiving the vaccine. Within four days, his speech was impaired, and he was having seizures. He died on May 19, 2021, despite emergency surgery to try to treat his vaccine-induced immune thrombotic thrombocytopenia.\n\nThe coroner concluded that “Zion died due to very rare and aggressive complications of the AstraZeneca covid vaccination.”\n\nHis fiancée, Vikki Spit, became the first person in the U.K. to receive compensation for a COVID-19 vaccine death. She told the inquest that the paramedic who came to her home after Zion began experiencing his first adverse event was “adamant” the migraine was unrelated to the vaccine.\n\nA neurosurgeon who later examined Zion after his condition worsened, said he was “fully aware” that Zion’s blood clot was the result of his recent vaccination.\n\nIn March 2022, U.K. coroners, in two separate cases, concluded that two individuals died due to blood clots brought on by the AstraZeneca COVID-19 vaccine.\n\nKim Lockwood, a 34-year-old mother from South Yorkshire, died in March 2021 of a catastrophic brain bleed nine days after getting the AstraZeneca shot, which was recorded as vaccine-induced thrombotic thrombocytopenia.\n\nAnd Tom Dudley, a 31-year-old father of two who received the AstraZeneca vaccine on April 27, 2021, died of a vaccine-induced brain hemorrhage on May 14, 2021.\n\nA lawsuit filed in India in late 2021 alleged that the AstraZeneca vaccine killed a 23-year-old man, who received the vaccine on Sept. 29, 2021, and died the same day. Bill Gates and Adar Poonawalla, CEO of the Serum Institute of India, the world’s largest vaccine manufacturer by number of doses produced and sold, were named in the suit.\n\nThe Serum Institute, which produces the AstraZeneca vaccine under the “Covishield” label, received funding and grants from the Bill & Melinda Gates Foundation.\n\nIn June 2020, the Gates Foundation committed $750 million toward the development of the AstraZeneca COVID-19 vaccine at Oxford University and conditional funding of $150 million to the Serum Institute. Writing in his blog in December 2020, Gates said his foundation “took on some of the financial risk” for the vaccine.\n\nIn still another case in India, Dr. Snehal Lunawat, a 33-year-old doctor, died March 1, 2021, due to a “rare blood-clotting event” he sustained after taking the Covishield vaccine, with the symptoms — brain bleeding and a decreased platelet count — characteristic of thrombocytopenia.\n\nAn instance of severe vaccine injury — though not death — following administration of the AstraZeneca COVID-19 vaccine, Adam Rowland, who previously worked alongside professional athletes as a medical sports physiotherapist and said he was the “fittest” he’d ever been when he received the AstraZeneca vaccines in February and May 2021.\n\nToday, Rowland cannot work, cannot lie down, and experiences several conditions affecting everything from his heart health to his vision, including pericarditis, pulmonary embolisms, severe thrombotic vasculitis and vascular neuropathy. His wife separated from him and he contemplated committing suicide.\n\nBBC targeted by vaccine-injured individuals, their families, doctors and activists\n\nThe BBC has been targeted in recent months by vaccine-injured individuals and their families, as well as doctors and activists who have been trying to draw public attention to those who were injured as a result of the COVID-19 vaccines.\n\nOn Jan. 13, cardiologist Dr. Aseem Malhotra “truthbombed” the BBC during a live television appearance where, during a discussion of cardiovascular risk, he pivoted and addressed a connection between such risk and mRNA COVID-19 vaccines. He said:\n\n“What is almost certain — if I can just say this — my own research has found, and this is something that is probably a likely contributing factor, is that the COVID mRNA vaccines do carry a cardiovascular risk.\n\n“And I’ve actually called for the suspension of this pending an inquiry, because there’s a lot of uncertainty at the moment over what’s causing the excess deaths.”\n\nThe BBC subsequently “apologized” for not being “better prepared to challenge what Dr. Malhotra said.”\n\nMalhotra’s father, Dr. Kailash Chand — a prominent general practitioner who was formerly deputy chair of the British Medical Association — died in July 2021. Malhotra has since publicly suggested that mRNA vaccines were a contributing factor in his death.\n\nOn Jan. 21, the “Truth Be Told” rally was organized outside the BBC’s headquarters in London as part of “COVID Vaccine Victim Awareness Month.” British MP Andrew Bridgen, who has been outspoken in his criticism of the COVID-19 vaccines, spoke at the event.\n\nThe rally was featured in a Rolling Stone story published Jan. 24, claiming that “anti-vax propaganda hasn’t gone away — it’s just evolving.”\n\nIn a separate set of protests outside at least six BBC buildings throughout northern England on Jan. 7, protesters covered those buildings with placards and stickers containing the photos of people who died as a result of the COVID-19 vaccines.\n\nAnd in August 2021, protesters attempted to enter BBC studios in West London, as part of a protest opposing lockdowns and “vaccine passports.”", "opengraph": {"locale": "en_US", "type": "article", "title": "BBC Veers From Official Narrative, Reports on AstraZeneca Vaccine Injuries and Lawsuit Against the Drugmaker", "description": "In a departure from its largely pro-COVID-19 vaccine coverage of the past several years, the BBC — Britain’s national broadcaster — is covering news that AstraZeneca is facing lawsuits over claims the drugmaker’s COVID-19 vaccine caused injuries and deaths.", "url": "https://childrenshealthdefense.org/defender/bbc-astrazeneca-vaccine-injuries-lawsuit/", "site_name": "Children's Health Defense", "article:publisher": "https://www.facebook.com/ChildrensHealthDefense/", "image": "https://childrenshealthdefense.org/wp-content/uploads/bbc-astrazeneca-covid-vaccine-feature.jpg", "image:width": "1600", "image:height": "834", "image:type": "image/jpeg"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">BREAKING BBC News:</p>\n<p>Cardiologist says likely contributory factor to excess cardiovascular deaths is covid mRNA vaccine and roll out should be suspended pending an inquiry.</p>\n<p>We did it. We broke mainstream broadcast media 🔥🔥🔥 <a href=\"https://t.co/F72YS7JAuE\">pic.twitter.com/F72YS7JAuE</a></p>\n<p>— Dr Aseem Malhotra (@DrAseemMalhotra) <a href=\"https://twitter.com/DrAseemMalhotra/status/1613837487796850688?ref_src=twsrc%5Etfw\">January 13, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">“SHAME ON YOU” – British public to the BBC 💪💪💪</p>\n<p>Truth be Told London, a demonstration outside BBC Broadcasting House, Portland Place, London on 21st Jan 2023. <a href=\"https://t.co/f65tRVb6Ox\">pic.twitter.com/f65tRVb6Ox</a></p>\n<p>— neil by mouth (@nbreavington) <a href=\"https://twitter.com/nbreavington/status/1617479595380416513?ref_src=twsrc%5Etfw\">January 23, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">6 <a href=\"https://twitter.com/hashtag/BBC?src=hash&amp;ref_src=twsrc%5Etfw\">#BBC</a> Buildings got sticker bombed, 🧐👍<a href=\"https://twitter.com/hashtag/ScumMedia?src=hash&amp;ref_src=twsrc%5Etfw\">#ScumMedia</a> Masked the Truth! <a href=\"https://t.co/qX8y0mxxW0\">pic.twitter.com/qX8y0mxxW0</a></p>\n<p>— Eddie Booth. We are under Attack, No illusion. (@SirEdwardBooth) <a href=\"https://twitter.com/SirEdwardBooth/status/1612404144991571970?ref_src=twsrc%5Etfw\">January 9, 2023</a></p></blockquote>\n"], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe title=\"YouTube video player\" src=\"https://www.youtube.com/embed/HIbzc0wh2G0\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/HIbzc0wh2G0"}, {"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe loading=\"lazy\" title=\"YouTube video player\" src=\"https://www.youtube.com/embed/vArKr_Q7EnY\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/vArKr_Q7EnY"}], "links": ["https://childrenshealthdefense.org/about-us/sign-up/?utm_source=top_of_article&utm_medium=the_defender&utm_campaign=sign_ups", "https://childrenshealthdefense.org/defender/lawsuit-trusted-news-initiative-antitrust-first-amendment-censoring-covid-content/", "https://www.bbc.com/news/uk-england-tyne-65187992", "https://childrenshealthdefense.org/defender/lisa-shaw-bbc-radio-host-died-covid-vaccine-complications/", "https://pubmed.ncbi.nlm.nih.gov/34259661/", "https://www.dailymail.co.uk/news/article-11959425/Widower-BBC-presenter-died-jab-no-alternative-file-suit-against-AstraZeneca.html", "https://www.youtube.com/watch?v=HIbzc0wh2G0", "https://www.nature.com/articles/s41467-023-36494-0", "https://childrenshealthdefense.org/defender_category/covid/", "https://childrenshealthdefense.org/", "https://childrenshealthdefense.org/defender/lawsuit-trusted-news-initiative-antitrust-first-amendment-censoring-covid-content/", "https://www.nature.com/articles/s41467-023-36494-0", "https://childrenshealthdefense.org/defender/uk-residents-died-blood-clotting-astrazeneca-vaccine/", "https://www.gov.uk/government/news/mhra-issues-new-advice-concluding-a-possible-link-between-covid-19-vaccine-astrazeneca-and-extremely-rare-unlikely-to-occur-blood-clots", "https://www.gov.uk/government/publications/coronavirus-covid-19-vaccine-adverse-reactions/coronavirus-vaccine-summary-of-yellow-card-reporting", "https://childrenshealthdefense.org/defender/jack-last-astrazeneca-covid-vaccine-death/", "https://childrenshealthdefense.org/defender/eu-possible-link-blood-clots-astrazeneca-vaccine/", "https://www.ema.europa.eu/en/news/astrazenecas-covid-19-vaccine-ema-finds-possible-link-very-rare-cases-unusual-blood-clots-low-blood", "https://childrenshealthdefense.org/defender/eu-possible-link-blood-clots-astrazeneca-vaccine/", "https://www.ema.europa.eu/en/human-regulatory/research-development/pharmacovigilance/eudravigilance", "https://www.gov.uk/government/publications/use-of-the-astrazeneca-covid-19-vaccine-jcvi-statement/jcvi-statement-on-use-of-the-astrazeneca-covid-19-vaccine-7-april-2021", "https://www.hopkinsmedicine.org/health/conditions-and-diseases/thrombosis", "https://www.mayoclinic.org/diseases-conditions/thrombocytopenia/symptoms-causes/syc-20378293'", "https://www.gov.uk/government/publications/use-of-the-astrazeneca-covid-19-vaccine-jcvi-statement/jcvi-statement-on-use-of-the-astrazeneca-covid-19-vaccine-7-april-2021", "https://www.bbc.com/news/health-56665517", "https://www.gov.uk/government/news/jcvi-advises-on-covid-19-vaccine-for-people-aged-under-40", "https://www.fda.gov/media/154870/download", "https://www.nature.com/articles/s41541-022-00569-8", "https://www.cdc.gov/mmwr/volumes/71/wr/mm7103a4.htm#:~:text=On%20December%2016%2C%202021%2C%20after,years%20in%20the%20United%20States.", "https://childrenshealthdefense.org/defender/pfizer-fda-data-clinical-trials-blackrock-advisor/", "https://childrenshealthdefense.org/defender/jeanie-evans-died-allergic-reaction-moderna-covid-vaccine-autopsy/", "https://www.fda.gov/emergency-preparedness-and-response/coronavirus-disease-2019-covid-19/janssen-covid-19-vaccine", "https://www.bmj.com/content/373/bmj.n1114", "https://www.bbc.com/news/uk-england-suffolk-63960457", "https://childrenshealthdefense.org/defender/jack-last-astrazeneca-covid-vaccine-death/", "https://www.hopkinsmedicine.org/health/conditions-and-diseases/cerebral-venous-sinus-thrombosis", "https://childrenshealthdefense.org/defender/zion-fatal-brain-injury-astrazeneca-covid-vaccine-injury/", "https://www.bbc.com/news/uk-england-tyne-61885899", "https://childrenshealthdefense.org/defender/uk-residents-died-blood-clotting-astrazeneca-vaccine/", "https://www.bbc.com/news/uk-england-south-yorkshire-60757293", "https://childrenshealthdefense.org/defender/bill-gates-indian-government-lawsuit-astrazeneca-vaccine-killed-shri-hitesh-kadve/", "https://www.hulldailymail.co.uk/news/health/dad-died-severe-brain-clot-6803381", "https://childrenshealthdefense.org/defender/bill-gates-indian-government-lawsuit-astrazeneca-vaccine-killed-shri-hitesh-kadve/", "https://www.seruminstitute.com/about_us.php", "https://www.theweek.in/news/india/2021/01/02/foreigners-using-indians-as-guinea-pigs-why-swamy-wants-bharat-biotech-vaccine.html", "https://www.gatesnotes.com/About-Bill-Gates/Year-in-Review-2020", "https://childrenshealthdefense.org/defender/bill-gates-indian-government-lawsuit-astrazeneca-vaccine-killed-shri-hitesh-kadve/", "https://childrenshealthdefense.org/defender/adam-rowland-astrazeneca-covid-vaccine-injury/", "https://pubmed.ncbi.nlm.nih.gov/23931796/", "https://t.co/F72YS7JAuE", "https://twitter.com/DrAseemMalhotra/status/1613837487796850688?ref_src=twsrc%5Etfw", "https://childrenshealthdefense.org/defender/aseem-malhotra-bbc-suspension-mrna-vaccines/", "https://childrenshealthdefense.org/defender/cause-unknown-book-edward-dowd-sudden-deaths-cola/", "https://deadline.com/2023/01/bbc-apologizes-for-interview-with-dr-aseem-malhotra-covid-jab-1235226970/", "https://twitter.com/draseemmalhotra/status/1574389600914534400", "https://t.co/f65tRVb6Ox", "https://twitter.com/nbreavington/status/1617479595380416513?ref_src=twsrc%5Etfw", "https://www.leicestermercury.co.uk/news/local-news/andrew-bridgen-says-truth-prevail-8061783", "https://www.youtube.com/watch?v=vArKr_Q7EnY", "https://dailysceptic.org/2023/01/11/andrew-bridgen-suspended-as-conservative-mp-for-criticising-covid-vaccines/", "https://hansard.parliament.uk/Commons/2022-12-13/debates/EAB2E8A2-A721-47DD-A79C-4EFD10F10C2D/VaccinesPotentialHarms", "https://www.rollingstone.com/culture/culture-features/anti-vax-movement-new-misinformation-injuries-deaths-1234666611/", "https://twitter.com/hashtag/BBC?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/ScumMedia?src=hash&ref_src=twsrc%5Etfw", "https://t.co/qX8y0mxxW0", "https://twitter.com/SirEdwardBooth/status/1612404144991571970?ref_src=twsrc%5Etfw", "https://www.thelibertybeacon.com/bbc-windows-covered-in-stickers-representing-deaths-caused-by-covid-jabs/", "https://www.lbc.co.uk/news/anti-vaxxers-try-to-storm-bbc-protest/"], "authors": [], "publish_date": null}