{"result_id": "062047", "URL": "https://childrenshealthdefense.org/defender/covid-nw-orthopedic-surgeon-vaccine-career-ending-condition/", "timestamp": "2023-04-25 14:37:53 CEST+0200", "meta": {"description": "The Defender’s COVID NewsWatch provides a roundup of the latest headlines related to the SARS CoV-2 virus, including its origins and COVID vaccines. The views expressed in the excerpts from other news sources do not necessarily reflect the views of The Defender.", "lang": "en", "keywords": "", "favicon": "https://childrenshealthdefense.org/wp-content/themes/chd-theme/images/favicon.ico", "canonical": "https://childrenshealthdefense.org/defender/covid-nw-orthopedic-surgeon-vaccine-career-ending-condition/", "encoding": "utf-8"}, "image": null, "domain": "childrenshealthdefense.org", "title": "Orthopedic Surgeon Sounds Off on COVID Vaccine After Developing Career-Ending Condition: I’ve Been ‘Abandoned’ + More", "cleaned_text": "Miss a day, miss a lot. Subscribe to The Defender's Top News of the Day. It's free.\n\nOrthopedic Surgeon Sounds Off on COVID Vaccine After Developing Career-Ending Condition: I’ve Been ‘Abandoned’\n\nOne orthopedic surgeon had his career ripped away from him by developing a career-ending condition just seven days after receiving the COVID-19 vaccine.\n\nDuring an appearance on “Fox & Friends Weekend,” Dr. Joel Wallskog shared the chilling details of how he contracted Transverse Myelitis, going from a “completely healthy 50-year-old” to a crippled, unemployed orthopedic surgeon, in a matter of a week.\n\n“I was a completely healthy 50-year-old person with really no medical problems until about seven days after my first — or I should say one and only Moderna shot — that I received on December 30 of 2020. So, I was completely otherwise healthy until seven days after the shot,” Dr. Wallskog shared with co-host Rachel Campos-Duffy.\n\nCampos-Duffy shared her sympathies with Dr. Wallskog, asking the surgeon, “What happens next? Who takes responsibility for this?” Dr. Wallskog replied, “What happens is you’re abandoned.”\n\nCampos-Duffy bolstered Dr. Wallskog’s claim, arguing that Big Pharma has not only evaded the “brunt” of alleged vaccine injuries but made “billions of dollars.” Recognizing that victims are provided no financial support, Dr. Wallskog founded an advocacy organization in an effort to spark change.\n\nThere’s New Light — and Lingering Questions — in the Mystery of Wuhan\n\nMore than three years into the coronavirus pandemic, the question has yet to be answered: How and why did it begin? On April 8, officials in China gave a news conference at which they insisted they had done everything possible to discover the answers about the global outbreak that began there. Zhou Lei, of China’s Center for Disease Control and Prevention, said Chinese scientists “shared all the data we had” and “adhered to principles of openness, objectivity and transparency.”\n\nThey have done neither. A new Post report and a forthcoming Senate investigation once again raise questions that still demand answers from China about what happened in Wuhan in late 2019.\n\nThe latest report on what happened in Wuhan came in an examination by Post reporters Joby Warrick and David Willman of China’s spotty biosafety record. They found that China embarked on a significant expansion of the country’s biotechnology sector, pumping billions of dollars into building dozens of laboratories and encouraging cutting-edge research in fields including genetic engineering, experimental vaccines and therapeutics, all part of a government-mandated drive to rival or surpass the United States and other Western powers. But safety practices failed to keep pace.\n\nThe Post reporters noted that lab accidents happen everywhere, including in the United States. But Chinese government reports and officials described ongoing equipment problems and inadequate safety training that in some cases resulted in lab animals being illegally sold after being used in experiments, and contaminated lab waste getting flushed into sewers. The problems were exacerbated, they reported, “by a secretive, top-down bureaucracy that sets demanding goals while reflexively covering up accidents and discouraging any public acknowledgment of shortcomings.”\n\nWhat really happened in Wuhan? The mystery remains. China holds — and should provide — some of the answers.\n\nThe Ashland County Health Department plans to purchase a van outfitted as a mobile health clinic to bring vaccinations to Amish and “isolated populations” across the county.\n\nThe health department received the green light from the Ohio Department of Health on Monday to use leftover funds from federal COVID-19 stimulus money, according to Jill Hartson, a community health educator for Ashland County Health Department.\n\n“The van will be ready to use immediately. We will need to do some training on using the items provided in the van and ensure the refrigeration is at temperature before we use it for COVID vaccines,” Vickie Taylor, the health commissioner, said.\n\nThe health department has been looking into getting a mobile vaccine unit since October, according to its cover letter dated March 31 to ODH asking for permission to spend up to $300,000 of leftover grant money received from the pandemic.\n\nSARS-CoV-2 Spike Protein Accumulates in the Skull and Brain — Whether Findings Have Implications for Long COVID Is Unclear\n\nSARS-CoV-2 spike protein persisted in the skull and brain, mouse and human autopsy data showed. In mouse models and human postmortem samples, SARS-CoV-2 spike protein was found in the skull marrow, meninges, and parenchyma, according to Ali Ertürk, Ph.D., of the Helmholtz Center Munich in Neuherberg, Germany, and co-authors.\n\nInjecting spike protein into skull marrow niches of healthy mice triggered proteome changes and cell death in the brain parenchyma, the researchers reported in a preprint paper on bioRxiv, which has not yet been peer-reviewed.\n\nThe findings suggest that spike protein in the skull-meninges-brain axis may be a molecular mechanism or therapeutic target for neurologic long COVID, Ertürk and colleagues proposed.\n\nThe clinical relevance of the findings is not clear, added Avindra Nath, MD, of the National Institute of Neurological Disorders and Stroke, who also wasn’t part of the study.\n\nXBB.1.16 ‘Arcturus’ Is New COVID Variant Under Monitoring by the WHO\n\nGuess what? There’s yet another COVID-19 coronavirus variant spreading around the world and in the U.S. This one has the oh-so-easy-to-remember name XBB.1.16 because when has the name of another Omicron subvariant started with the letters XBB, right?\n\nOn March 22, the World Health Organization (WHO) classified the XBB.1.16 as a new variant under monitoring (VUM), which isn’t as serious as a variant of interest (VOI) which isn’t as serious as a variant of concern (VOC).\n\nBut the spread of the XBB.1.16 seems to have fueled what’s been called by the India-based media publication Business Today a “massive surge” of COVID-19 cases in India and sparked the return of face mask mandates there. These days the term “massive surge” isn’t great to hear unless you are talking about chocolate or sex. So the big question is how concerned should you be about this new subvariant that some have unofficially dubbed the “Arcturus” subvariant?\n\nWell, “Acturus-lly,” the XBB.1.16 has gone from being about 0.21% of all COVID-19 cases worldwide in late February to an estimated 3.96% a month later. In the U.S., the XBB.1.16 accounted for an estimated 7.2% of all COVID-19 samples from April 9 to April 15, according to the Centers for Disease Control and Prevention (CDC). That’s up from 3.9% the week before and 2.1% the week prior to that.\n\nShe Died 4 Days After Getting Her COVID Booster Jab. Singapore Paid Her Family in the Philippines U.S. $169,000\n\nThe family of a woman who died about four days after receiving a COVID-19 vaccine booster jab was given S$225,000 (U.S. $169,000) under Singapore’s Vaccine Injury Financial Assistance Programme, the Health Ministry said.\n\nOntal Charlene Vargas, from the Philippines, died on December 13, 2021. The cause of her death was myocarditis or inflammation of the heart, a coroner’s court heard on Friday. State Coroner Adam Nakhoda found that on the balance of probabilities, it was likely to be related to COVID-19 vaccination.\n\nCOVID and Aspergillus Are Dangerous Bedfellows — Attention Must Be Paid to This New, Sometimes Deadly Duo\n\nIn the Fall of 2022, a World Health Organization (WHO) report named 19 key fungal threats, thus creating the agency’s first-ever “fungal priority pathogens” list. WHO also called for better diagnostics and monitoring of antifungal drug resistance, as well as further research, innovation, and public health measures to control invasive fungal pathogens.\n\nI believe the message was overdue. While some people equate “superbugs” solely with bacteria, specialists who care for immunocompromised patients have long dealt with life-threatening and drug-resistant fungi. Today, experts also worry that environmental factors, including climate change, will nurture scary new species.\n\nAspergillus is no stranger to Ashrit Multani, MD, my UCLA infectious diseases colleague who’s an expert in pathogenic fungi, especially in patients with compromised immune systems. So, I recently asked whether he was surprised when he started seeing severely ill patients with COVID suffer aspergillosis.\n\n“No, it didn’t surprise me too much,” Multani said. “I think it was just a matter of time before we started to see more and more cases. We’ve seen similar issues with viral infections…for example, there’s been plenty reported in the literature about aspergillosis following flu.”\n\nQueensland Health Report Suggests Long COVID No More Severe Than Lingering Influenza\n\nQueenslanders with long COVID may experience no more severe symptoms than those of lingering influenza, according to a study by the state’s health officials.\n\nBut while the Queensland government has held up the study as evidence its handling of the early stages of the pandemic was “textbook”, medical experts treating patients for long COVID say it is only a “first step” towards understanding a condition that has been debilitating for many.", "opengraph": {"locale": "en_US", "type": "article", "title": "Orthopedic Surgeon Sounds Off on COVID Vaccine After Developing Career-Ending Condition: I’ve Been ‘Abandoned’ + More", "description": "The Defender’s COVID NewsWatch provides a roundup of the latest headlines related to the SARS CoV-2 virus, including its origins and COVID vaccines. The views expressed in the excerpts from other news sources do not necessarily reflect the views of The Defender.", "url": "https://childrenshealthdefense.org/defender/covid-nw-orthopedic-surgeon-vaccine-career-ending-condition/", "site_name": "Children's Health Defense", "article:publisher": "https://www.facebook.com/ChildrensHealthDefense/", "article:modified_time": "2023-04-17T20:53:36+00:00", "image": "https://childrenshealthdefense.org/wp-content/uploads/covid_news_watch_daily_roundup_feature.jpg", "image:width": "1600", "image:height": "834", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/about-us/sign-up/?utm_source=top_of_article&utm_medium=the_defender&utm_campaign=sign_ups", "https://www.foxnews.com/media/orthopedic-surgeon-covid-vaccine-developing-career-ending-condition-been-abandoned", "https://www.foxnews.com/category/health/infectious-disease/coronavirus", "https://www.foxnews.com/category/shows/fox-friends-weekend", "https://childrenshealthdefense.org/defender/covid-vaccine-injury-vaers-data/", "https://www.foxnews.com/person/c/rachel-campos-duffy", "https://www.foxnews.com/opinion/greedy-pharma-firms-rip-off-americans-while-pfizer-moderna-swim-profits", "https://childrenshealthdefense.org/defender/man-injured-covid-vaccine-canada-compensation/", "https://www.washingtonpost.com/opinions/2023/04/15/covid-origins-china-mystery/", "https://childrenshealthdefense.org/defender_category/covid", "https://www.globaltimes.cn/page/202304/1288727.shtml", "https://www.cbsnews.com/news/china-health-officials-lash-out-at-who-defend-covid-virus-search/", "https://childrenshealthdefense.org/defender/covid-origins-wuhan-lab-energy-department/", "https://www.washingtonpost.com/investigations/interactive/2023/china-lab-safety-risk-pandemic/?itid=lk_inline_manual_8", "https://www.ashlandsource.com/news/ashland-county-health-dept-targeting-amish-isolated-populations-with-230k-mobile-vaccination-clinic/article_f0855048-dae5-11ed-a08e-fb5542ca341d.html", "https://childrenshealthdefense.org/defender_category/covid", "https://www.medpagetoday.com/neurology/longcovid/104037", "https://childrenshealthdefense.org/defender_category/covid", "https://www.biorxiv.org/content/10.1101/2023.04.04.535604v1", "https://www.forbes.com/sites/brucelee/2023/04/16/xbb116-arcturus-is-new-covid-19-variant-under-monitoring-by-the-who/?sh=4b73f6994224", "https://childrenshealthdefense.org/defender_category/covid", "https://childrenshealthdefense.org/defender/uk-data-john-campbell-covid-vaccine-risks-omicron/", "https://www.who.int/activities/tracking-SARS-CoV-2-variants", "https://www.businesstoday.in/coronavirus/story/huge-jump-in-covid-19-cases-over-11000-infections-reported-in-last-24-hours-377357-2023-04-14", "https://covid.cdc.gov/covid-data-tracker/#variant-proportions", "https://childrenshealthdefense.org/defender/cdc-rsv-vaccine-fda-rare-immune-disorder/", "https://www.scmp.com/news/asia/southeast-asia/article/3217275/she-died-4-days-after-getting-her-covid-booster-jab-singapore-paid-her-family-philippines-us169000", "https://www.scmp.com/knowledge/topics/coronavirus-vaccine/news?module=inline&pgtype=article", "https://childrenshealthdefense.org/defender/fda-advisers-bivalent-vaccine/", "https://www.scmp.com/topics/singapore?module=inline&pgtype=article", "https://www.scmp.com/topics/philippines?module=inline&pgtype=article", "https://childrenshealthdefense.org/defender/cdc-criminal-neglect-covid-vaccine-myocarditis-young-males/", "https://childrenshealthdefense.org/defender_category/covid", "https://www.medpagetoday.com/opinion/parasites-and-plagues/104025", "https://www.who.int/news/item/25-10-2022-who-releases-first-ever-list-of-health-threatening-fungi", "https://childrenshealthdefense.org/defender_category/covid", "https://childrenshealthdefense.org/protecting-our-future/flu-shot-facts/", "https://www.theguardian.com/australia-news/2023/apr/17/queensland-health-report-suggests-long-covid-no-more-severe-than-lingering-influenza", "https://www.theguardian.com/australia-news/2023/feb/17/long-covid-causing-job-losses-and-homelessness-in-australia-inquiry-hears", "https://childrenshealthdefense.org/protecting-our-future/flu-shot-facts/", "https://www.theguardian.com/australia-news/queensland", "https://childrenshealthdefense.org/defender_category/covid"], "authors": [], "publish_date": null}