{"result_id": "062046", "URL": "https://childrenshealthdefense.org/defender/big-ag-gene-mrna-vaccines-livestock-cola/", "timestamp": "2023-04-25 14:37:53 CEST+0200", "meta": {"description": "Missouri House Bill 1169 would require labeling of products that can alter your genes. Big Ag lobbyists strongly oppose it, because it would mean labeling livestock injected with mRNA vaccines.", "lang": "en", "keywords": "", "favicon": "https://childrenshealthdefense.org/wp-content/themes/chd-theme/images/favicon.ico", "canonical": "https://childrenshealthdefense.org/defender/big-ag-gene-mrna-vaccines-livestock-cola/", "encoding": "utf-8"}, "image": null, "domain": "childrenshealthdefense.org", "title": "Big Ag Panicking Over Bill to Require Labeling of Gene-Altering Products", "cleaned_text": "Miss a day, miss a lot. Subscribe to The Defender's Top News of the Day. It's free.\n• Pork producers have been using customizable mRNA-based “vaccines” on their herds since 2018, without telling the public.\n• All customized mRNA “vaccines” are untested. Only the mRNA platform itself has been approved.\n• According to the National Cattlemen’s Beef Association, “There are no current mRNA vaccines licensed for use in beef cattle in the United States.” However, a lobbyist for the association claims to have “double-vaccinated” his own herd with an mRNA “vaccine” against bovine respiratory disease.\n• Iowa State University began trialing an mRNA “vaccine” against bovine respiratory syncytial virus on Oct. 1, 2021.\n• Missouri House Bill 1169 would require labeling of products that can alter your genes. Big Ag lobbyists strongly oppose it.\n\nLast week, I reported that pork producers have been using customizable mRNA-based “vaccines” on their herds since 2018 — without telling the public.\n\nThis issue really only rose to the surface after attorney Thomas Renz started promoting new legislation in Missouri (House Bill 1169, which he helped write) that would require labeling of mRNA products.\n\nIn an April 1, tweet (and no, this was not an April Fool’s joke), Renz stated:\n\n“BREAKING NEWS: the lobbyists for the cattleman and pork associations in several states have CONFIRMED they WILL be using mRNA vaccines in pigs and cows THIS MONTH. WE MUST SUPPORT MISSOURI HB1169. It is LITERALLY the ONLY chance we have to prevent this …\n\n“NO ONE knows the impacts of doing this but we are all potentially facing the risk of being a #DiedSuddenly if we don’t stop this.”\n\nThe transhumanist agenda and its focus on food\n\nWithin days, alternative media was abuzz with this story and Renz started making the rounds sharing evidence that shows the U.S. government has been working on the integration of vaccines into foods for at least two decades.\n\nIn an April 2 interview with Naomi Wolf, Ph.D., Renz said:\n\n“[Bill] Gates, the WHO [World Health Organization], a ton of these universities: they’re all talking about including mRNA vaccinations as part of the food. They’re going to modify the genes of these foods to make them mRNA vaccines.”\n\nIndustry doesn’t want you to know what they’re doing\n\nThe pushback by Big Ag lobbyists against this bill to require industry transparency on this important issue has been enormous, and one potential reason for that is because they’d have to admit that all sorts of foods may have been vaccinated with mRNA vaccines, have genetic modifications, or be modified to serve as vaccinations for humans.\n\nNot only might this destroy Big Ag, but it would also seriously impact any surreptitious attempts by Big Pharma to use the food supply as a tool to distribute vaccines unbeknownst to consumers.\n\nIn short, Renz suspects the globalists’ transhumanist agenda is being secretly pushed forward using gene therapy in food production.\n\nI can’t help but wonder whether the industry simply doesn’t understand how mRNA gene therapy in livestock might affect consumers, or whether they want to conceal the fact that they’re using gene therapy because they DO know it can also affect humans.\n\nGlobalists like World Economic Forum founder Klaus Schwab have openly admitted that they intend to alter humanity — both on the genetic level and through the incorporation of artificial intelligence and nanotechnology into the human body.\n\nAnd, using COVID-19 as the cover, they managed to turn the entire world population into test subjects for this dangerous experimentation.\n\nAs noted by Renz in the Real America’s Voice interview above, we know for a fact that the mRNA COVID-19 shots have no beneficial impact in terms of preventing COVID-19 infection.\n\nIf the mRNA COVID-19 shots don’t prevent infection, why would we assume mRNA shots for viral and bacterial infections in swine work any better?\n\nOne of the most disturbing aspects of using mRNA “vaccines” in swine is the fact that all of them are by definition untested. As explained by Merck on its website, its “custom swine vaccine,” Sequivity, is not a vaccine but, rather, a platform that allows for the endless customization of “mRNA vaccines.”\n\nThe customized mRNA shots that are created using it are completely untested. Here’s how it works:\n• A pathogen is collected and sent to a diagnostic lab.\n• The gene of interest is sequenced and sent electronically to Sequivity analysts.\n• A synthetic version of the gene of interest is synthesized and inserted into the RNA production platform.\n• The RNA particles released from incubated production cells are harvested and formulated into a customized “vaccine.”\n\nAs noted by Zoetis, the largest producer of veterinary drugs and vaccines:\n\n“Sequivity has safety and efficacy studies based on the platform with a historical initial isolate, not likely the isolate that customers would be requesting in their product.”\n\nWhat was that initial isolate? Will mRNA against a bacterial disease affect the animals in the same way that mRNA against a viral infection does?\n\nWhat “genes of interest” are being chosen? If spike proteins are selected, might they be as pathogenic as the SARS-CoV-2 spike protein?\n\nIn CAFO environments with high populations of animals, won’t mutations become rampant as the bacteria and viruses are subjected to constant “customized” vaccination pressure to adapt and become more dangerous? These are just some of the questions that need answers.\n\nAt the end of the day, the fact that mRNA shots can be endlessly customized without safety testing shows just how broken the U.S. Department of Agriculture and the U.S. Food and Drug Administration are.\n\nThere’s simply no way they can guarantee that customized mRNA shots are safe. The fact that the platform itself works and allows for this customization does NOT prove the safety and effectiveness of the shots being cooked up.\n\nApproval of the platform also does not prove the food is safe for consumption after it’s been treated with mRNA.\n\nAs reported by Dr. Peter McCullough, Chinese researchers have demonstrated that food can indeed be turned into a vaccine.\n\n“The nation’s food supply can be manipulated by public health agencies to influence population outcomes … Now an oral route of administration is being considered specifically for COVID-19 vaccination using mRNA in cow’s milk.\n\n“Zhang and colleagues have demonstrated that a shortened mRNA code of 675 base pairs could be loaded into phospholipid packets called exosomes derived from milk and then using that same milk, be fed to mice.\n\n“The mice gastrointestinal tract absorbed the exosomes and the mRNA must have made it into the bloodstream and lymphatic tissue because antibodies were produced in fed mice against SARS-CoV-2 Spike protein (receptor binding domain) …\n\n“Given the damage mRNA vaccines have generated in terms of injuries, disabilities, and deaths, these data raise considerable ethical issues. The COVID States project has shown that 25% of Americans were successful in remaining unvaccinated.\n\n“This group would have strong objections to mRNA in the food supply, particularly if it was done surreptitiously or with minimal labeling/warnings …\n\n“For those who have taken one of the COVID-19 vaccines, having milk vaccines as an EUA offering would allow even more loading of the body with synthetic mRNA which has been proven resistant to ribonucleases and may reside permanently in the human body.\n\n“These observations lead me to conclude that mRNA technology has just entered a whole new, much darker phase of development. Expect more research on and resistance to mRNA in our food supply. The Chinese have just taken the first of what will probably be many more dangerous steps for the world.”\n\nWill beef be treated with mRNA too?\n\nAt present, there’s no evidence to suggest beef cattle are being treated with customizable mRNA “vaccines,” either in Europe or the U.S. The National Cattlemen’s Beef Association has also denied it, saying “there are no current mRNA vaccines licensed for use in beef cattle in the United States.”\n\nThat said, the Cattlemen’s Association previously confirmed they do, eventually, intend to use mRNA shots in cattle, which might affect both dairy and beef.\n\nTime will tell whether public outrage will halt such plans. Clearly, the Cattlemen’s Association is concerned about internet rumors that it’s already in use.\n\nOn April 3, Texas Department of Agriculture commissioner Sid Miller issued a statement promising to conduct a risk assessment of the technology before its adoption:\n\n“Since news of the development of mRNA vaccines and mRNA-related treatments for livestock came to the attention of the Texas Department of Agriculture, we have been working towards developing a fact and science-based assessment of the risks associated with this technology.\n\n“Our analysis will include the clinical research, the structure of existing Texas law, and the public policy, economic, and production impact of the different policy prescriptions we may adopt. I aim to ensure that Texas agriculture remains safe, trusted, healthy, and wholly uninfected by dangerous or unproven technology.\n\n“I personally take this issue very seriously. No political hot takes. Just a well-reasoned and well-researched proposal based on a wide range of input from stakeholders, scientists, agriculturalists, and other experts. We are looking at this issue at TDA and will share your concerns. Please stay tuned.”\n\nWhat’s causing significant confusion on this issue is a statement made by National Cattlemen’s Beef Association lobbyist Shannon Cooper before the Missouri House.\n\nCooper told the House members he had recently “double-vaccinated” his herd with “vaccinations that have this mRNA.” According to Cooper, the mRNA “vaccine” given was for bovine respiratory disease.\n\nIs he confused? Did he mistakenly believe the vaccine he gave had mRNA in it? Or is the National Cattlemen’s Beef Association incorrect in stating there are no approved mRNA vaccines for cattle in the U.S.? Or, are experimental mRNA shots being used without approval? Who knows at this point?\n\nWhat we do know is that mRNA “vaccines” against bovine respiratory disease are being developed. Iowa State University began trialing an mRNA “vaccine” against bovine respiratory syncytial virus on Oct. 1, 2021.\n\nThe project end date is listed as Sept. 30, 2026. According to the trial submission, mice would be used to establish proof of concept. Cows would be used in year two of the trial. Assuming they’re on schedule, that means cows will be experimented on somewhere in late 2023 and/or 2024.\n\nConsidering health authorities insist the COVID-19 shots are safe, it’s no wonder they also insist there are no problems associated with eating mRNA-treated meat. But can we trust them?\n\nWhat about the cells now highjacked by the foreign mRNA instruction to create novel proteins? Are these proteins safe to consume? How long are the nano-lipid particles preserved in the tissue?\n\nLivestock such as swine are routinely vaccinated against several diseases, and many of these vaccines must be administered at specific times to ensure there’s no residue left in the meat.\n\nSo, just when are swine receiving these customized mRNA shots? And could there be mRNA vaccine remnants in the pork you buy?\n\nVaccines are nearly always given in the hindquarter of the animal, and according to mRNA jab developers, the mRNA remains at the injection site.\n\nThis theory has long since been proven false, as the mRNA in the COVID-19 jab gets has been shown to be distributed throughout the human body.\n\nBut it makes sense that the mRNA might be more concentrated at the injection site. In livestock, this could be bad news, seeing how the hindquarters are usually where the prime cuts of meat come from.\n\nSo, knowing whether there’s any mRNA left in the animal at the time of slaughter is important. At present, we have no way of knowing this. We don’t even know exactly how long the synthetic lipid-enveloped mRNA stays in the body.\n\nWe also don’t know how long the antigen produced by the animal’s cells in response to a customized mRNA shot sticks around, and whether ingesting that antigen might have repercussions for human health.\n\nStanford researchers found the spike protein produced in response to the COVID-19 shot remains in the human body for at least 60 days, and the spike protein is what’s causing most of the health problems associated with the jab.\n\nCould the same be true for mRNA jabs used in animals?\n\nHogs can be killed anywhere from the age of 6 weeks to 10 months, which doesn’t allow a whole lot of time for the mRNA and/or antigen to get flushed out.\n\nAside from the many open questions, the fact that notorious Big Pharma mouthpieces are the ones cited by media, ensuring us that mRNA jabbed animals are safe to eat is yet another red flag. In this case, we have Dr. Kevin Folta insisting the mRNA is harmless.\n\nFolta, a University of Florida horticulture professor, is a longtime advocate for genetically modified organisms. He has also advocated for the safety of glyphosate, and in 2015, he was caught lying about his financial ties to Monsanto. Now, he’s taken up the advocacy for mRNA shots in livestock.\n\n“Lawmakers in Arizona, Idaho, and Missouri have introduced legislation related to the use of mRNA vaccines in food. The Arizona bill only restricts labeling such food as organic. The Idaho bill amends state law to prohibit the sale of such foods unless conspicuously labeled that the presence of the vaccine is in the food.\n\n“It ‘means they have no idea what they are trying to regulate,’ Folta said, because ‘there is no integration into the DNA. It’s a transient set of instructions, like a USB drive. Not a hard drive’ … Messenger RNA occurs naturally as part of the function of cells in the body. ‘mRNA is everywhere, and you can’t live without mRNA,’ Folta said …\n\n“Folta said that the vaccines can’t get into the food people eat. ‘mRNA is an extremely unstable molecule. That’s why it works. It’s very temporary. So when an animal is slaughtered or when a plant dies, mRNA is the first thing to go,’ Folta said.”\n\nMany of you will know exactly what’s wrong with Folta’s arguments that mRNA is “everywhere” and therefore harmless and that its activity is temporary because it’s so unstable. The mRNA in the shots is synthetic and does NOT break down the way normal mRNA does.\n\nHe is clearly misleading people, and it’s hard to believe it’s not intentional, considering the fact that everyone who knows even the slightest bit about mRNA jab technology knows the synthetic mRNA has been designed to prevent rapid breakdown and is further stabilized by the nano lipid. So, Folta’s arguments are null and void from the get-go.\n\nMoving forward, it’s going to be extremely important to stay on top of what’s happening to our food supply. Many of us were surprised to realize mRNA shots have been used in swine for several years already.\n\nSoon, cattle may get these customizable mRNA shots as well, which could affect both beef and dairy products.\n\nFor now, I strongly recommend avoiding pork products. In addition to the uncertainty surrounding these untested mRNA “vaccines,” pork is also very high in linoleic acid, a harmful omega-6 fat that drives chronic disease.\n\nHopefully, cattle ranchers will realize the danger this mRNA platform poses to their bottom line and reject it. If they don’t find beef and dairy that has not been “gene therapied” could become quite the challenge.\n\nWill Harris, from White Oak Pasture in Bluffton Georgia, is a rancher who has already come out against mRNA “vaccines” in cattle.\n\n“There is talk about domesticated food animals soon being vaccinated with mRNA. We want our customers to know that we will not vaccinate our animals with mRNA vaccines. We believe there is a time and place for vaccinations, but they must be used sparingly.\n\n“If livestock are raised in an environment where they can express their natural instincts, they probably won’t need many (if any) vaccines. We hope to one day move away from all vaccines on our farm — we are close, but not there yet.\n\n“Everyone should know that over 80% of the antibiotics produced today are consumed by domesticated food animals … It would only make sense that in order for vaccine companies to move from ‘very profitable’ to ‘obscenely profitable’ would be to capture the animal agriculture market.\n\n“I’m not sure that this would ever pass legislation, but law or not, Big Ag is highly influenced by Big Pharma. The multinational meat companies would certainly choose to mandate this if there was an opportunity for a shared profit.\n\n“In closing, please know: We don’t believe in a blanket, one-size-fits-all approach to our health or our livestock. We will not add vaccinations for our livestock — we are moving in the other direction hoping to give fewer. (And, we already give very few).\n\n“If this is adopted and there is a ‘panic’ for food from livestock that hasn’t had the mRNA vaccine, we will choose to honor the demand from our loyalty members and employees first. If you are not a part of that group, we cannot guarantee we will have any product for you.\n\n“We are certainly not trying to promote panic — but, we do intend to notify our customers of how we will operate in times of growing demand. We screwed up during the pandemic — we won’t do that again.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Big Ag Panicking Over Bill to Require Labeling of Gene-Altering Products", "description": "Missouri House Bill 1169 would require labeling of products that can alter your genes. Big Ag lobbyists strongly oppose it, because it would mean labeling livestock injected with mRNA vaccines.", "url": "https://childrenshealthdefense.org/defender/big-ag-gene-mrna-vaccines-livestock-cola/", "site_name": "Children's Health Defense", "article:publisher": "https://www.facebook.com/ChildrensHealthDefense/", "article:modified_time": "2023-04-18T17:07:51+00:00", "image": "https://childrenshealthdefense.org/wp-content/uploads/big-ag-gene-mrna-vaccines-livestock-feature.jpg", "image:width": "1600", "image:height": "834", "image:type": "image/jpeg"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Here is where the National Cattlemen’s Association says no there is no <a href=\"https://twitter.com/hashtag/mRNA?src=hash&amp;ref_src=twsrc%5Etfw\">#mRNA</a> in our cows: <a href=\"https://t.co/k7cnEQzxH0\">https://t.co/k7cnEQzxH0</a>. Below are clips (edited for time) from the testimony of the lobbyist from the Missouri Cattlemen’s Association before the <a href=\"https://twitter.com/hashtag/Missouri?src=hash&amp;ref_src=twsrc%5Etfw\">#Missouri</a> House. Hmmm – seems they aren’t… <a href=\"https://t.co/dCE9yCJKVb\">pic.twitter.com/dCE9yCJKVb</a></p>\n<p>— Tom Renz (@RenzTom) <a href=\"https://twitter.com/RenzTom/status/1645416058415718402?ref_src=twsrc%5Etfw\">April 10, 2023</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">There is talk about domesticated food animals soon being vaccinated with <a href=\"https://twitter.com/hashtag/mRNA?src=hash&amp;ref_src=twsrc%5Etfw\">#mRNA</a>. We want our customers to know that we will not vaccinate our animals with <a href=\"https://twitter.com/hashtag/mRNAvaccines?src=hash&amp;ref_src=twsrc%5Etfw\">#mRNAvaccines</a>. We believe there is a time and place for vaccinations, but they must be used sparingly. If livestock are raised… <a href=\"https://t.co/pcN5fbxeOY\">pic.twitter.com/pcN5fbxeOY</a></p>\n<p>— White Oak Pastures (@whiteoakpasture) <a href=\"https://twitter.com/whiteoakpasture/status/1645533068810244100?ref_src=twsrc%5Etfw\">April 10, 2023</a></p></blockquote>\n"], "movies": [], "links": ["https://childrenshealthdefense.org/about-us/sign-up/?utm_source=top_of_article&utm_medium=the_defender&utm_campaign=sign_ups", "https://takecontrol.substack.com/p/eating-pork-treated-with-gene-therapy", "https://legiscan.com/MO/text/HB1169/2023", "https://theconservativetreehouse.com/blog/2023/04/09/sunday-talks-thomas-renz-warns-of-mrna-vaccines-in-u-s-food-supply/", "https://twitter.com/RenzTom/status/1642229969555259395?lang=en", "https://dailyclout.io/mrna-gene-therapy-is-coming-to-the-food-supply-what-we-can-do-about-it-w-attorney-tom-renz/", "https://childrenshealthdefense.org/defender/mrna-vaccines-livestock-big-pharma/", "https://childrenshealthdefense.org/defender_category/big-pharma/", "https://childrenshealthdefense.org/defender_category/big-food/", "https://tomrenz.substack.com/p/eat-your-vaccines-i-mean-vegtables", "https://childrenshealthdefense.org/defender/world-economic-forums-great-reset-plan-for-big-food-benefits-industry-not-people/", "https://childrenshealthdefense.org/defender/klaus-schwab-most-dangerous-man/", "https://childrenshealthdefense.org/defender_category/covid/", "https://www.merck-animal-health-usa.com/species/swine/sequivity", "https://www.zoetisus.com/content/_assets/docs/Pork/FLUSURE-XP-Product-Comparison-Chart.pdf", "https://childrenshealthdefense.org/defender/activists-midwest-factory-farms-cafos/", "https://petermcculloughmd.substack.com/p/chinese-load-cows-milk-with-mrna", "https://www.biorxiv.org/content/10.1101/2022.12.19.517879v1", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8703677/", "https://drgnews.com/2023/04/06/ncba-statement-correcting-internet-falsehoods-about-mrna-vaccines-in-cattle/", "https://drgnews.com/2023/04/06/ncba-statement-correcting-internet-falsehoods-about-mrna-vaccines-in-cattle/", "https://twitter.com/RenzTom/status/1642229969555259395?lang=en", "https://www.texasagriculture.gov/News-Events/Article/7596/Commissioner-Miller-Statement-on-mRNA-Vaccines-in-Livestock", "https://twitter.com/hashtag/mRNA?src=hash&ref_src=twsrc%5Etfw", "https://t.co/k7cnEQzxH0", "https://twitter.com/hashtag/Missouri?src=hash&ref_src=twsrc%5Etfw", "https://t.co/dCE9yCJKVb", "https://twitter.com/RenzTom/status/1645416058415718402?ref_src=twsrc%5Etfw", "https://themissouritimes.com/lobbyist-profile-the-giddens-group/", "https://twitter.com/RenzTom/status/1645416058415718402", "https://portal.nifa.usda.gov/web/crisprojectpages/1027610-novel-mrna-vaccine-technology-for-prevention-of-bovine-respiratory-syncytial-virus.html", "https://yardevetservices.com/userfiles/modules/categorized_content_4/9/Show_Pig_Vaccine_Protocol_2021.pdf", "https://childrenshealthdefense.org/defender/pork-merck-mrna-livestock-vaccine-cola/", "https://www.cell.com/cell/fulltext/S0092-8674(22)00076-9?rss=yes#relatedArticles", "https://www.clarkcountytoday.com/news/health-nightmare-dr-robert-malone-spotlights-study-on-mrna-spike-protein/", "https://www.fao.org/3/t0279e/T0279E05.htm", "https://childrenshealthdefense.org/defender/glyphosate-dna-damage-cancer-oxidative-stress-cg/", "https://cowboystatedaily.com/2023/04/05/vaccine-for-livestock-based-on-covid-19-vaccine-technology-raises-concerns-but-biologist-says-fears-are-unfounded/", "https://takecontrol.substack.com/p/linoleic-acid-health-effects", "https://twitter.com/hashtag/mRNA?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/mRNAvaccines?src=hash&ref_src=twsrc%5Etfw", "https://t.co/pcN5fbxeOY", "https://twitter.com/whiteoakpasture/status/1645533068810244100?ref_src=twsrc%5Etfw", "https://takecontrol.substack.com/p/will-harris-on-regenerative-agriculture", "https://childrenshealthdefense.org/defender/will-harris-white-oak-pastures-regenerative-farming-cola/", "https://twitter.com/i/web/status/1645533068810244100", "https://www.mercola.com/"], "authors": [], "publish_date": null}