{"result_id": "064017", "URL": "https://forums.carm.org/threads/ivermectin.6045/", "timestamp": "2023-04-25 14:38:26 CEST+0200", "meta": {"description": "I think it’s important to stop and reflect how utterly insane the right-wing in America has become.\n\nThe whole Ivermectin “debate” is based on the idea that...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://forums.carm.org/threads/ivermectin.6045/", "encoding": "utf-8"}, "image": null, "domain": "forums.carm.org", "title": "Ivermectin", "cleaned_text": "Well, first of all you wrote:\n\n \n\n \n\n \n\n To which I responded with the following questions:\n\n \n\n Did it? How do you know that the ivermectin had any effect at all?\n\n \n\n I then went on to make a couple of points about how we know drugs are effective, and pointed out that the major study which suggested that Ivermectin has been withdrawn:\n\n \n\n The way in which we know if drugs are effective against particular illnesses is through detailed studies. At best the jury is still out with regards to the effectiveness of Ivermectin against COVID-19. The major study which suggested it was effective has been withdrawn after it became apparent that it misused data.\n\n \n\n So, can you answer the questions asked?\n\n \n\n I then responded to another one of your comments, pointing out that the people who should decide what drugs are used are the people doing the studies:\n\n \n\n \n\n \n\n The people who are in the business of deciding what drugs people should take to treat COVID are the doctors and scientists who are running the studies. At this point there are several studies going on to test the effectiveness of Ivermectin. Until there is a study which shows it is effective then it shouldn't be used.\n\n \n\n Do you agree what we should wait until we have positive studies before using a drug to treat something like COVID-19?\n\n \n\n \n\n \n\n Lastly I responded to this Godwin by giving the actual way in which we can mitigate the effects of COVID:\n\n \n\n The best way of stopping COVID is to get as many people vaccinated as possible, make sure that testing is widely available, ensure the public continues to wear masks in enclosed environments, and that people isolate if they test positive for COVID.\n\n \n\n Do you not think that these few, rather simple precautions is an effective way to minimise the spread of COVID-19? If not, why not?\n\n \n\n So, I responded to what you wrote...can you address my response?", "opengraph": {"description": "I think it’s important to stop and reflect how utterly insane the right-wing in America has become.\n\nThe whole Ivermectin “debate” is based on the idea that all official medical institutions are participating in some international conspiracy to lie to us about the global pandemic.\n\nRight-wingers...", "url": "https://forums.carm.org/threads/ivermectin.6045/", "site_name": "CARM Forums", "type": "website", "title": "Ivermectin"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2021-09-06T21:23:57-0600"}