{"result_id": "064002", "URL": "https://forums.carm.org/threads/unvaxxed-blood-is-at-a-premium.13107/", "timestamp": "2023-04-25 14:38:02 CEST+0200", "meta": {"description": "There are folks on this forum who have been whistle- trained to reject this source. Then there are those with a free mind and curiosity who are following...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://forums.carm.org/threads/unvaxxed-blood-is-at-a-premium.13107/", "encoding": "utf-8"}, "image": null, "domain": "forums.carm.org", "title": "Unvaxxed blood is at a premium", "cleaned_text": "The HIV jab was the problem.The covid pathogen doesn't contain pathogens...BUT...it does contain the gene therapy in the form of mRNA that tells the cell how to produce protein spikes. You should know this vibes.As time went on we learned that Fowl-Chi and Biden..and others said if you take it you won't get covid nor spread covid. There is plenty of video that shows them saying those words. I know there is video...I've seen them.But as it turns out....that was not so. Now, when Fowl-Chi said the words he was flat out lying...when Biden was saying the words he was simply ignorant and reading from a tela-prompter....Bottom line is, the Jab failed and big pharma got rich off of tax payer money.Where is your science saying the blood has no spike proteins in it?Do you have evidence that says it doesn'tIn an article from New Zealand a baby needed a blood transfusion..here's what the sick do not harm surgeon said..Auckland’s Starship Hospital and its pediatric cardiac surgeonThe hospital administrators bullied the parents, mocking them as “conspiracy theorists” for wanting unvaccinated blood for their baby. One doctor threatened the family with attorneys and suggested the mom needed psychiatric help for refusing vaccinated blood from the blood bank.They had the untainted blood for the baby but the surgeion basically said...shove it...to the parents.", "opengraph": {"description": "There are folks on this forum who have been whistle- trained to reject this source. Then there are those with a free mind and curiosity who are following the science. Here’s what real doctors who care for real patients go through when blood is needed...", "url": "https://forums.carm.org/threads/unvaxxed-blood-is-at-a-premium.13107/", "site_name": "CARM Forums", "type": "website", "title": "Unvaxxed blood is at a premium"}, "tags": [], "tweets": [], "movies": [], "links": ["/goto/post?id=997616", "/goto/post?id=997616", "/goto/post?id=997616", "/goto/post?id=997616", "/goto/post?id=997616"], "authors": [], "publish_date": "2022-12-21T06:37:29-0700"}