{"result_id": "064001", "URL": "https://forums.carm.org/threads/the-horror-film-to-end-all-horror-films.12687/", "timestamp": "2023-04-25 14:38:01 CEST+0200", "meta": {"description": "This is without a doubt the most horrific movie I have ever seen in my entire life...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://forums.carm.org/threads/the-horror-film-to-end-all-horror-films.12687/", "encoding": "utf-8"}, "image": null, "domain": "forums.carm.org", "title": "The Horror Film to end all horror films", "cleaned_text": "The film presents a clot of innuendo as well. It shows pictures of what looks like blood clots yet never really confirms the true origins of them. To suggest that these were caused by Covid-19 vaccines as the film did would be kind of like showing pictures of mullets and then claiming that vaccines caused such hairstyles. In the film, a person blurred out did say in a distorted voice what sounded like, “as a Canadian embalmer, I have found that everyone who I have embalmed for over a year had fibrous mass clots.” However, you can’t really tell who this person really is, because saying “Canadian embalmer” isn’t quite the same as saying something like “billionaire who bought Twitter.” It doesn’t really pinpoint who the person is. In fact, you can’t really tell the identities of many of the people featured in the film since there is relatively little use of captions.\n\n\n\n Bruce Y. Lee\n\n Senior Contributor\n\n I am a writer, journalist, professor, systems modeler, computational and digital health expert, avocado-eater, and entrepreneur, not always in that order.\n\n \n\n \n\n Yes, welcome to yet another conspiracy theory about Covid-19 vaccines. Actually, this conspiracy theory isn’t completely new and has been sticking around for the past two years or so, kind of like gum on an Ugg boot. It’s been one of a salad bar of anti-vaxxer claims that have emerged since late 2020, ranging from Covid-19 vaccines turning people into gigantic magnets where keys can stick to their foreheads to Covid-19 vaccines causing completely healthy people to drop dead. The title of this film is kind of like the movie titles Snakes on a Plane and Sausage Party in that it captures the story that the film is trying to tell. Died Suddenly spends much of its hour and eight minute run time suggesting that many people have been dying suddenly after getting Covid-19 vaccines.\n\n \n\n \n\n Note the word “suggesting” rather than “showing” or “proving.” While the film shows headlines and stories of people dying suddenly, it never really provides much concrete scientific evidence linking Covid-19 vaccines to all these sudden deaths. It essentially just says oh look at all these sudden deaths over the past couple years and, oh. people, in general, have been getting Covid-19 vaccines. Never mind the fact that people have been dying suddenly ever since, oh, the beginning of human existence. Never mind the fact that over a million people in the U.S. and over 6.6 million around the world have died from, you know, Covid-19, since early 2020. Never mind the fact that these deaths from the Covid-19 pandemic have resulted in excess mortality. Never mind the fact that people have been dying suddenly since Rep. Marjorie Taylor-Greene (R-Georgia) was elected to Congress when the film doesn’t try to link these two sets of events in same way as it is trying to link vaccines with excess mortality.\n\n \n\n In fact, the film shows images of people falling over who didn’t actually end up dying, as \n\n \n\n {I took out the tweet. Anyone can look up what it says in the article, though}\n\n \n\n In general, the film is a mish-mosh of clips, audio bytes, interviews, and other things often taken completely out of context and cooked together like a gigantic conspiracy theory frittata. New ‘Died Suddenly’ Film Pushes Unfounded Depopulation Claims About Covid-19 VaccineBruce Y. LeeSenior ContributorI am a writer, journalist, professor, systems modeler, computational and digital health expert, avocado-eater, and entrepreneur, not always in that order.Yes, welcome to yet another conspiracy theory about Covid-19 vaccines. Actually, this conspiracy theory isn’t completely new and has been sticking around for the past two years or so, kind of like gum on an Ugg boot. It’s been one of a salad bar of anti-vaxxer claims that have emerged since late 2020, ranging from Covid-19 vaccines turning people into gigantic magnets where keys can stick to their foreheads to Covid-19 vaccines causing completely healthy people to drop dead. The title of this film is kind of like the movie titlesandin that it captures the story that the film is trying to tell.spends much of its hour and eight minute run time suggesting that many people have been dying suddenly after getting Covid-19 vaccines.Note the word “suggesting” rather than “showing” or “proving.” While the film shows headlines and stories of people dying suddenly, it never really provides much concrete scientific evidence linking Covid-19 vaccines to all these sudden deaths. It essentially just says oh look at all these sudden deaths over the past couple years and, oh. people, in general, have been getting Covid-19 vaccines. Never mind the fact that people have been dying suddenly ever since, oh, the beginning of human existence. Never mind the fact that over a million people in the U.S. and over 6.6 million around the world have died from, you know, Covid-19, since early 2020. Never mind the fact that these deaths from the Covid-19 pandemic have resulted in excess mortality. Never mind the fact that people have been dying suddenly since Rep. Marjorie Taylor-Greene (R-Georgia) was elected to Congress when the film doesn’t try to link these two sets of events in same way as it is trying to link vaccines with excess mortality.In fact, the film shows images of people falling over who didn’t actually end up dying, as Angela Rasmussen, PhD , a virologist at the Vaccine and Infectious Disease Organization at the University of Saskatchewan in Canada, indicated in the following tweet:{I took out the tweet. Anyone can look up what it says in the article, though}In general, the film is a mish-mosh of clips, audio bytes, interviews, and other things often taken completely out of context and cooked together like a gigantic conspiracy theory frittata.\n\n\n\n \n\n In the film's trailer, footage of a basketball star collapsing on the court is cited as proof of the vaccine's dangers. In reality, the footage is from 2020, long before the vaccine became available to the entire public.\n\n \n\n Another clip from the trailer shows a woman in Argentina fainting and falling into a moving train. Yet once again, the individual shown in the film never died and no evidence points to a vaccine being responsible.\n\n \n\n A third clip used shows a royal guard fainting while standing next to the casket of Queen Elizabeth, a As with the others highlighted, the guard did not die. And while Twitter has thus far declined to flag the film for misinformation, numerous Twitter users have. A lengthy thread from one such account has revealed that countless examples of vaccine deaths in the documentary are outright false.In the film's trailer, footage of a basketball star collapsing on the court is cited as proof of the vaccine's dangers. In reality, the footage is from 2020, long before the vaccine became available to the entire public.Another clip from the trailer shows a woman in Argentina fainting and falling into a moving train. Yet once again, the individual shown in the film never died and no evidence points to a vaccine being responsible.A third clip used shows a royal guard fainting while standing next to the casket of Queen Elizabeth, a common occurrence among guards who must stand in one place for hours on end.\n\nIt is a waste of time one will never get back:A trailer for the video shows a basketball player, Keyotae Johnson, collapsing on a basketball court, which the film hints was supposedly caused by the covid-19 vaccine. But do note two things: this happened on Dec. 12, 2020--before the vaccines were even available. Also, Johnson didn't die!And:And it gives a good example using Tom Hanks.Here is more, from another source that analyzed the documentary:It noted:When I was in high school, in the Glee Club, one of the boys in the choir told me that in a previous year, while singing in a concert, one of the boys near him, dressed in a suit, started swaying and started to faint. The boys on either side of him caught him by his arms and carried him off the stage to a place where he could lie down. This was in the mid-60's. Happens more often than people think. Heck, some people faint just getting any shot. My 18-year old grandson almost faints when he has to get shots or blood drawn. It is just how he is.Personally, I think one of the greatest horror movies of all time was \"Silence of the Lambs.\" Really creepy. The guy who played \"Hannibal the cannibal\" deserved his Oscar!", "opengraph": {"description": "This is without a doubt the most horrific movie I have ever seen in my entire life.\n\nhttps://rumble.com/v1wcesu-died-suddenly-full-documentary-not-suitable-for-children.html", "url": "https://forums.carm.org/threads/the-horror-film-to-end-all-horror-films.12687/", "site_name": "CARM Forums", "type": "website", "title": "The Horror Film to end all horror films"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.forbes.com/sites/brucelee/2022/11/22/new-died-suddenly-film-pushes-unfounded-depopulation-claims-about-covid-19-vaccine/?sh=6c23db5849d0", "https://angelarasmussen.org/", "https://www.msn.com/en-us/movies/news/anti-vax-film-e2-80-98died-suddenly-e2-80-99-is-littered-with-fake-claims-testing-boundaries-of-musk-e2-80-99s-twitter/ar-AA14qbjW", "https://www.hellomagazine.com/healthandbeauty/health-and-fitness/20220915151182/why-do-queen-royal-guards-faint/"], "authors": [], "publish_date": "2022-11-24T13:27:22-0700"}