{"result_id": "064025", "URL": "https://forums.carm.org/threads/gain-of-function-v-directed-evolution.13606/", "timestamp": "2023-04-25 14:38:41 CEST+0200", "meta": {"description": "Gain of Function v. Directed Evolution\n\nWhat’s the difference?  Well, Jordan Trishton Walker, Pfizer Director of Research and Development says they have one...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://forums.carm.org/threads/gain-of-function-v-directed-evolution.13606/", "encoding": "utf-8"}, "image": null, "domain": "forums.carm.org", "title": "Gain of Function v. Directed Evolution", "cleaned_text": "You thinking you can use \"capsids as delivery agents\" and actually know what you are doing is kinda evil.\n\n \n\n Probably not as evil as Fauci The Science.\n\n \n\n Looking at your vaccine rollout and its effects, I'd say Incompetent is a better word choice.\n\nRetroviral capsids have been domesticated in mammals like us to serve as delivery agents in the brain, where they work quite well.In addition to co-option of the viral capsid, our bodies have also co-opted the envelope gene of these viruses to serve in the formation of the placenta. These env genes found in all placental animals are called syncytins.Why not make use of a natural phenomenon to deliver drugs to where they are needed? A lot of engineers look to effective designs used by living things to create useful products for human use.What is evil about that, and how does it differ from using other natural phenomena like antibiotics to treat humans?And the vaccine has been doing its job, reducing severe disease, hospitalizations and deaths and enabling a return to normal.", "opengraph": {"description": "Gain of Function v. Directed Evolution\n\nWhat’s the difference?  Well, Jordan Trishton Walker, Pfizer Director of Research and Development says they have one answer for the public and another for private conversations caught on hidden cameras… 🤔\n\n\n\nIn either case, we know who started it…\n\nOBAMA...", "url": "https://forums.carm.org/threads/gain-of-function-v-directed-evolution.13606/", "site_name": "CARM Forums", "type": "website", "title": "Gain of Function v. Directed Evolution"}, "tags": [], "tweets": [], "movies": [], "links": ["/goto/post?id=1043797", "https://www.asbmb.org/asbmb-today/science/032821/a-protein-in-your-brain-behaves-like-a-virus", "https://rep.bioscientifica.com/view/journals/rep/152/5/R167.xml"], "authors": [], "publish_date": "2023-01-26T10:53:15-0700"}