{"result_id": "064046", "URL": "https://forums.carm.org/threads/vaccine-efficacy.7755/", "timestamp": "2023-04-25 14:39:10 CEST+0200", "meta": {"description": "We are up to booster number 4 is that right? Could someone who pays more attention to that nonsense confirm how many stabs you need to be effectively...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://forums.carm.org/threads/vaccine-efficacy.7755/", "encoding": "utf-8"}, "image": null, "domain": "forums.carm.org", "title": "Vaccine efficacy", "cleaned_text": "We are up to booster number 4 is that right? Could someone who pays more attention to that nonsense confirm how many stabs you need to be effectively vaccinated for covid? I appreciate it. Thank you in advance. I was going to say \"... effectively vaccinated AGAINST covid but it's not really accurate to say is it? Anyway I will use the number 4 as I think that's the recent number. \n\n \n\n So onto the purpose of this thread. Let's say hypothetically you have a leak in your roof. Water is dripping all over the inside of your house. That stinks right? So you call an expert ie: a roofer. He comes he works on it for some time and leaves. Then the next time it rains water is still coming into the house. Not as much as before but everything is still getting wet. I think you'd be a bit upset. So you call the guy back. Again he works on it and again rain is still getting in. Not as much as before but still intruding. You call him 2 more times and still the water keeps coming. Would you consider that roofer an effective roofer?", "opengraph": {"description": "We are up to booster number 4 is that right? Could someone who pays more attention to that nonsense confirm how many stabs you need to be effectively vaccinated for covid? I appreciate it. Thank you in advance. I was going to say \"... effectively vaccinated AGAINST covid but it's not really...", "url": "https://forums.carm.org/threads/vaccine-efficacy.7755/", "site_name": "CARM Forums", "type": "website", "title": "Vaccine efficacy"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2021-12-17T07:46:26-0700"}