{"result_id": "064042", "URL": "https://forums.carm.org/threads/coming-to-a-farm-near-you.13364/", "timestamp": "2023-04-25 14:39:05 CEST+0200", "meta": {"description": "On the horizon...\n\nGenetically-modified-corn aficionado Bill Gates and his friends in their global cabal are now promoting the widespread vaccination of...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://forums.carm.org/threads/coming-to-a-farm-near-you.13364/", "encoding": "utf-8"}, "image": null, "domain": "forums.carm.org", "title": "Coming to a farm near you.", "cleaned_text": "So, Bill Gates is attempting to ensure that animals are resistant to diseases which could kill them and see the people that depend on them for food starve. And, yet, for the uneducated who don't understand how mRNA vaccines work are so terrified (and duped into believing a vaccine kills numerous people) this becomes some sort of conspiracy.\n\n \n\n It says rather a lot about these conspiracy theorists; they just can't seem to fathom the idea that someone like Bill Gates would want to help people, probably because they can't imagine themselves actually helping people.\n\nYou would be the type that enjoys modified foods.I recently heard of a farmer who back in the 80's grew grain. They produced 40 bushels an acre.Along comes Monsanto who produced a new hybrid seed that give a yeild of 90 bushels an acre...Not a bad deal.Problem is the nutrients in the grain was cut in half. Bottom line...people's tummies were filled but the food was junk. lots of people made money but the people suffered.So, what's next? mRNA gene modifying animal jabs....that should be good for us. We know it will be good for big Pharma.The ironic thing is you libs once were for eating healthy? What happened?", "opengraph": {"description": "On the horizon...\n\nGenetically-modified-corn aficionado Bill Gates and his friends in their global cabal are now promoting the widespread vaccination of animals in order to sanitize the world’s food supply.\n\nSpecifically, Gates and his friends want to give livestock the mRNA-altering COVID jabs...", "url": "https://forums.carm.org/threads/coming-to-a-farm-near-you.13364/", "site_name": "CARM Forums", "type": "website", "title": "Coming to a farm near you."}, "tags": [], "tweets": [], "movies": [], "links": ["/goto/post?id=1022918"], "authors": [], "publish_date": "2023-01-10T08:41:47-0700"}