{"result_id": "064023", "URL": "https://forums.carm.org/threads/end-of-american-sovereignty.13948/", "timestamp": "2023-04-25 14:38:37 CEST+0200", "meta": {"description": "END OF AMERICAN SOVEREIGNTY: Biden Regime Negotiates “Legally Binding” Deal To Give Chinese-Backed World Health Organization Full Authority Over US Pandemic...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://forums.carm.org/threads/end-of-american-sovereignty.13948/", "encoding": "utf-8"}, "image": null, "domain": "forums.carm.org", "title": "END OF AMERICAN SOVEREIGNTY", "cleaned_text": "END OF AMERICAN SOVEREIGNTY: Biden Regime Negotiates “Legally Binding” Deal To Give Chinese-Backed World Health Organization Full Authority Over US Pandemic Policies – No Senate Approval Needed (article)​ \n\n This is what happens when a demonically inspired fake president is installed by the Cabal\n\n \n\n From the article:\n\n Once America officially signs on to this agreement, we will be completely at the mercy of the globalist organization which helped the Chinese Communist Party (CCP) cover up the original COVID-19 outbreak in Wuhan.\n\n \n\n The zero draft gives the WHO the power to declare and manage a global pandemic emergency. Once a health emergency is declared every signatory, including the United States, must submit to the authority of the WHO. This includes caving to them on treatments, lockdowns and vaccine mandates along with government surveillance. This is what happens when a demonically inspired fake president is installed by the CabalFrom the article:Once America officially signs on to this agreement, we will be completely at the mercy of the globalist organization which helped the Chinese Communist Party (CCP) cover up the original COVID-19 outbreak in Wuhan.The zero draft gives the WHO the power to declare and manage a global pandemic emergency. Once a health emergency is declared every signatory, including the United States, must submit to the authority of the WHO. This includes caving to them on treatments, lockdowns and vaccine mandates along with government surveillance.\n\nThe Farce in this one strong is, Luke.You need to look at what you are saying here: \"demonic\", \"fake\", \"Cabal\". You should have realised by now that using that sort of language is a big red flag that this is nonsense.You have no evidence of demons. President Biden is not a \"fake president\" and \"Cabal\" signals conspiracy thinking, somewhat detached from the real world.And the WHO is not a Chinese organisation.", "opengraph": {"description": "END OF AMERICAN SOVEREIGNTY: Biden Regime Negotiates “Legally Binding” Deal To Give Chinese-Backed World Health Organization Full Authority Over US Pandemic Policies – No Senate Approval Needed (article)\n\nThis is what happens when a demonically inspired fake president is installed by the Cabal...", "url": "https://forums.carm.org/threads/end-of-american-sovereignty.13948/", "site_name": "CARM Forums", "type": "website", "title": "END OF AMERICAN SOVEREIGNTY"}, "tags": [], "tweets": [], "movies": [], "links": ["/goto/post?id=1074524", "https://www.thegatewaypundit.com/2023/02/end-of-american-sovereignty-biden-regime-negotiates-legally-binding-deal-to-give-chinese-backed-world-health-organization-full-authority-over-us-pandemic-policies-no-senate-approval-needed/"], "authors": [], "publish_date": "2023-02-20T09:34:57-0700"}