{"result_id": "064037", "URL": "https://forums.carm.org/threads/report-mrna-vaccines-are-being-injected-into-livestock.13808/post-1063336", "timestamp": "2023-04-25 14:38:58 CEST+0200", "meta": {"description": "Dentistry.  A major industry in Mexico, built on American health tourism.\n\nThe important word in your post?\n\nCheap.  Or maybe that should be, affordable...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://forums.carm.org/threads/report-mrna-vaccines-are-being-injected-into-livestock.13808/page-12", "encoding": "utf-8"}, "image": null, "domain": "forums.carm.org", "title": "Report: mRNA vaccines are being injected into livestock", "cleaned_text": "This is an example of misunderstanding statistics. It has been said that one can prove anything with statistics if you try hard enough. In this case a correlation is being turned into causation with justification. There is perfectly reasonable explanation for the statistics of covid deaths shortly after the rollout of the vaccines. Recall that the infections first started spreading early in 2020. At first it was just in a few nursing homes. Infections gradually increased with deaths peaking in April of 2020 and then decreasing as people started spending more time outdoors where covid could not spread as easily. After a small peak in July and brief reduction, covid deaths began really coming back in November of 2020 peaking at a level 50% higher than the April peak as covid became more wide-spread. Then in December 2020 the very first vaccines began rolling out. Of course most of the US was still unvaccinated and the time from infection to death was often 4 to 6 weeks. So even if everyone were vaccinated instantaneously, there would still be a month of continued high deaths due to infections that were prior to any vaccinations. So now we are in early 2021 and vaccines are gradually becoming more available. I remember I had to wait till near the end of February to get mine, even though, being over 55, I was in the higher risk category and was supposedly getting priority. Most people had to wait much longer. As production ramped up the vaccinations gradually began to take effect, but a sizeable portion of the country was still refusing the vaccination. What we see in the covid death rates at that time is a gradual decrease from February 2021 to a low in July much lower than the low during the previous July. And this despite the fact that by now the virus was much more widespread than it was the previous summer, which is partly due to the vaccines and partly due to a better understanding of how to care for covid patients by health care workers. However deaths did start going up in August, possibly due to loosening social distancing requirements, businesses being open again, and the introduction of the Delta variant, which was more transmissible. It was not long before the Delta variant became dominate and deaths peaked in September and again in January 2022. But neither of those peaks was as high as the all time high in January 2021 when hardly anyone was vaccinated. About this time boosters came out. And the death rate in the US continues to decline from the February 2022 peak down to a low in May of 2022 which has been sustained ever since, despite the fact that covid is still circulating and an even more transmissible variant has arisen with the name of Omicron.What we see by this is that we need to look at the details of a statistical claim and not just to a one-sentence sound bite.", "opengraph": {"description": "Dentistry.  A major industry in Mexico, built on American health tourism.\n\nThe important word in your post?\n\nCheap.  Or maybe that should be, affordable.\n\nIt’s cheap because the Drs are subpar and cheap plastic surgery is just that. You get what you pay for.", "url": "https://forums.carm.org/threads/report-mrna-vaccines-are-being-injected-into-livestock.13808/", "site_name": "CARM Forums", "type": "website", "title": "Report: mRNA vaccines are being injected into livestock"}, "tags": [], "tweets": [], "movies": [], "links": ["/goto/post?id=1063258"], "authors": [], "publish_date": "2023-02-11T14:51:57-0700"}