{"result_id": "064021", "URL": "https://forums.carm.org/threads/forced-jabs-in-brazil.13435/post-1031595", "timestamp": "2023-04-25 14:38:34 CEST+0200", "meta": {"description": "PURE EVIL: The Lula da Silva regime in Brazil forcibly injects its political enemies with deadly covid “vaccines”\nNow the new President, Luiz Inácio Lula da...", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://forums.carm.org/threads/forced-jabs-in-brazil.13435/", "encoding": "utf-8"}, "image": null, "domain": "forums.carm.org", "title": "Forced Jabs in brazil", "cleaned_text": "Yes, Bill Clinton didn't go to jail when he sold the Chinese technology to achieve pinpoint accuracy for their ICBMs pointed at New York in Chicago. Hillary didn't go to jail when she sold 10% of our uranium to Russia, nor when she put all of our state secrets on her bathroom server. Nor when she instructed her staff to take ball peen hammers and destroy all their cell phones that have been subpoenaed in a justice department investigation. And Joe Biden hasn't gone to jail for stuffing all of his garage is an outbuildings with top-secret classified material. And he didn't go to jail when he got the prosecutor for Burisma fired while his son was serving on the Board of Directors, by with holding $1 billion in age to your crane on a quid quo pro basis. Come to think of it, John Wilkes Booth may have been the last Democrat to be charged with any crime.", "opengraph": {"description": "PURE EVIL: The Lula da Silva regime in Brazil forcibly injects its political enemies with deadly covid “vaccines”\nNow the new President, Luiz Inácio Lula da Silva, is insisting on persecute his political enemies and forcibly injecting them in makeshift cells. The Lula da Silva regime has...", "url": "https://forums.carm.org/threads/forced-jabs-in-brazil.13435/", "site_name": "CARM Forums", "type": "website", "title": "Forced Jabs in brazil"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2023-01-15T08:07:35-0700"}