{"result_id": "065002", "URL": "https://www2.cbn.com/news/politics/white-house-considers-vaccine-mandate-all-federal-workers-cdc-wants-vaccinated", "timestamp": "2023-04-25 14:39:20 CEST+0200", "meta": {"description": "The White House is strongly considering requiring federal employees to show proof they’ve been vaccinated against the coronavirus or otherwise submit to regular testing and wear a mask — a potentially major shift in policy that reflects growing concerns about the spread of the more infectious delta variant.", "lang": "en", "keywords": "White House, Biden, administration, federal, employees, proof, vaccination, coronavirus, delta, variant, infectious, spread, CBN News, cbnnews.com", "favicon": "/themes/custom/cbn_emulsify/favicon.ico", "canonical": "https://www2.cbn.com/news/politics/white-house-considers-vaccine-mandate-all-federal-workers-cdc-wants-vaccinated", "encoding": "utf-8"}, "image": null, "domain": "www2.cbn.com", "title": "White House Considers Vaccine Mandate for All Federal Workers, CDC Wants Vaccinated Americans to Mask-Up", "cleaned_text": "The Biden administration is ramping up the pressure across the board, calling for masks once again, approving vaccine mandates by employers, and considering a full-blown vaccine mandate for all federal workers.\n\nThe CDC has done an about-face, now doubling down on mask mandates for the fully vaccinated. And the White House is now also considering a vaccine mandate for all government employees.\n\nBack in May, the Centers for Disease Control and Prevention (CDC) said vaccinated people do not need masks inside. But Tuesday officials issued an update, saying some vaccinated people who get breakthrough infections of the Delta variant can be highly contagious.\n\nNow, the CDC is recommending masks in public buildings in parts of the country with significant infection rates. The agency is also now recommending that everyone in schools mask-up, including students and teachers regardless of whether they are vaccinated.\n\nMeanwhile, President Biden may soon announce all federal workers will be required to get vaccinated or face regular COVID tests and be forced to social distance. \n\n \n\n And the Department of Justice and the Equal Employment Opportunity Commission now say it would be fully legal for private employers to require vaccines of their employees.\n\nRight now, 63-percent of counties in the U.S. are seeing COVID cases spike.\n\nThe CDC says the virus is primarily spreading among the unvaccinated. But CDC Director Dr. Rochelle Walenensky also says, \"In rare occasions, some vaccinated people infected with a Delta variant after vaccination may be contagious and spread the virus to others.\"\n\n \n\n Meanwhile, if the Biden White House moves ahead with a vaccine mandate for all federal employees, the federal Office of Management and Budget reports that would apply to more than 4.2 million federal workers nationwide, including those in the military.\n\nRight now 100 million Americans still haven't gotten a vaccine.", "opengraph": {"site_name": "CBN", "type": "article", "url": "https://www2.cbn.com/news/politics/white-house-considers-vaccine-mandate-all-federal-workers-cdc-wants-vaccinated", "title": "White House Considers Vaccine Mandate for All Federal Workers, CDC Wants Vaccinated Americans to Mask-Up", "description": "The White House is strongly considering requiring federal employees to show proof they’ve been vaccinated against the coronavirus or otherwise submit to regular testing and wear a mask — a potentially major shift in policy that reflects growing concerns about the spread of the more infectious delta variant.", "image": "https://www2.cbn.com/sites/default/files/brightcove/videos/images/thumbnails/_v1_jit_734546207001_7818ce88-7dcf-4817-ac33-2bc3bb73983b_main_1280x720_1m47s798ms_match_image.jpg", "updated_time": "2022-12-10T13:45:24-0500", "article:section": "CBN | News", "article:tag": "Not Selected", "article:published_time": "2021-07-28T07:45:00-0400", "article:modified_time": "2022-12-10T13:45:24-0500"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2021-07-28T07:45:00-0400"}