{"result_id": "065016", "URL": "https://www2.cbn.com/news/us/gmu-prof-todd-zywicki-explains-his-vaccine-mandate-exemption-natural-immunity-27-times-more", "timestamp": "2023-04-25 14:39:55 CEST+0200", "meta": {"description": "Since President Joe Biden announced his controversial new vaccine mandates targeting private businesses, critics have been arguing the move is divisive and unconstitutional.", "lang": "en", "keywords": "cbn news, cbnnewsyoutube.com, George Mason University, law professor, natural immunity, Todd Zywicki, Joe Biden, White House, mandates, vaccines, COVID-19, pandemic", "favicon": "/themes/custom/cbn_emulsify/favicon.ico", "canonical": "https://www2.cbn.com/news/us/gmu-prof-todd-zywicki-explains-his-vaccine-mandate-exemption-natural-immunity-27-times-more", "encoding": "utf-8"}, "image": null, "domain": "www2.cbn.com", "title": "GMU Prof. Todd Zywicki Explains His Vaccine Mandate Exemption: 'Natural Immunity Is 27 Times More Protective'", "cleaned_text": "Since President Joe Biden announced his controversial new vaccine mandates targeting private businesses, critics have been arguing the move is divisive and unconstitutional.\n\nGeorge Mason University (GMU) Law Professor Todd Zywicki – who was granted a medical exemption by the university – is one of those critics, telling CBN News' Faith Nation the mandates actually undermine the vaccine message and insult the intelligence of Americans at the same time.\n\nZywicki's own case against GMU earned him an exemption to the vaccination requirement there because he argued he had \"natural immunity\" after getting COVID.\n\nThe Virginia-based university had a mandate requiring all attending students to be inoculated by Aug. 1. Faculty and staff had a deadline of Aug.15 to be vaccinated. Those who did not comply with the mandate had to show a reason for a medical or religious exemption.\n\nThe law professor explained that forcing people to get vaccinated is not the way to address those who are unwilling. In fact, it's causing more tension among Americans.\n\n\"Mandates are certainly not the way to overcome hesitancy which is that compelling somebody to do something is not going to make them more willing to do it. And what I think we're seeing already is a revolution coming about especially among those like me who have natural immunity,\" Zywicki said.\n\n\"There's reports now that nurses who have natural immunity are quitting. There was a report that they're trying to reschedule births. I heard about cardiac units being shut down. People who have natural immunity need to be respected here because of the risks that they're putting on us,\" he added. \"This draconian, just crushing people is not going to overcome vaccine hesitancy. You might force some people to get vaccines but that's not going to improve this country's commitment to come together and fight this pandemic.\"\n\nZywicki said exemptions should apply to the broad vaccine mandates announced by the White House Friday, despite the administration's \"misdirected\" way of dealing with the issue.\n\n\"We are a year and a half into this pandemic by now. What we should be focusing on is people's level of immunity however acquired, whether it's by vaccine or natural immunity ... that's the way out of this,\" he noted. \"It's not by vaccinating people who don't need to be vaccinated like me, forcing people who have health risks, leaving it in the hands of individual employers to determine whether someone has a legitimate medical exemption ... it's just crazy and it violates the Constitution.\"\n\n\"Your right to bodily autonomy and bodily integrity is not a matter of majority vote, and it's not a matter that we put up to suburban voters to determine whether somebody has a right to be free from an involuntary medical activity. We should be focusing on immunity and that's our glide path to get out of this in the long run. Immunity however acquired.\"\n\nHe pointed out that the scientific evidence supporting natural immunity is apparent.\n\n\"The science on this is clear at this point unless you have some superstitious attachment to the vaccines, natural immunity is robust, durable, broad, it protects against variants and we all know the Israel study finds that natural immunity is 27 times more protective than vaccines against symptomatic infections and eight times more protective against hospitalization,\" he said.\n\n\"It's really no contest at this point and the idea that we're going to continue down this one path of vaccination and ignore natural immunity – my students, my colleagues at least are too smart for that and I wish somebody at the White House would wake up to that fact as well.\"\n\n***Please sign up for CBN Newsletters and download the CBN News app to ensure you keep receiving the latest news from a distinctly Christian perspective.***", "opengraph": {"site_name": "CBN", "type": "article", "url": "https://www2.cbn.com/news/us/gmu-prof-todd-zywicki-explains-his-vaccine-mandate-exemption-natural-immunity-27-times-more", "title": "GMU Prof. Todd Zywicki Explains His Vaccine Mandate Exemption: 'Natural Immunity Is 27 Times More Protective'", "description": "Since President Joe Biden announced his controversial new vaccine mandates targeting private businesses, critics have been arguing the move is divisive and unconstitutional.", "image": "https://www2.cbn.com/sites/default/files/brightcove/videos/images/thumbnails/_v1_jit_734546207001_a2f94fd7-e5dd-4e5a-a507-561fad073e1a_main_1280x720_2m11s413ms_match_image.jpg", "updated_time": "2022-12-10T13:45:24-0500", "article:section": "CBN | News", "article:tag": "Not Selected", "article:published_time": "2021-09-15T01:15:00-0400", "article:modified_time": "2022-12-10T13:45:24-0500"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www1.cbn.com/cbnnews/us/2021/august/gmu-exempts-professor-from-covid-vaccine-mandate-following-natural-immunity-lawsuit", "https://www1.cbn.com/cbnnews/email-forms", "https://www1.cbn.com/cbn-apps#cbn-news", "https://www1.cbn.com/cbn-apps#cbn-news"], "authors": [], "publish_date": "2021-09-15T01:15:00-0400"}