{"result_id": "065023", "URL": "https://www2.cbn.com/news/us/weve-been-used-experimented-why-many-black-americans-dont-trust-covid-19-vaccine", "timestamp": "2023-04-25 14:40:11 CEST+0200", "meta": {"description": "According to a report by the National Urban League, African Americans are infected with COVID-19 at nearly three times the rate of white Americans. And blacks are twice as likely to die from the virus. Still, many don't plan to get the vaccine.", "lang": "en", "keywords": "Black Americans, African Americans, the black community, COVID, COVID-19, white Americans, death rate, vaccine, fears, virus, Tuskegee Experiment, Syphilis, used, unethical, National Urban League, Charlene Aaron, CBN News, CBNNews.com, CBN News YouTube", "favicon": "/themes/custom/cbn_emulsify/favicon.ico", "canonical": "https://www2.cbn.com/news/us/weve-been-used-experimented-why-many-black-americans-dont-trust-covid-19-vaccine", "encoding": "utf-8"}, "image": null, "domain": "www2.cbn.com", "title": "'We've Been Used, Experimented On': Why Many Black Americans Don't Trust COVID-19 Vaccine", "cleaned_text": "According to a report by the National Urban League, African Americans are infected with COVID-19 at nearly three times the rate of white Americans. And blacks are twice as likely to die from the virus. Still, many don't plan to get the vaccine.\n\n\"I would not take the COVID-19 [vaccine] just because it kind of came out really fast,\" Virginia Beach native Aaron O'Sullivan told CBN News. \"Just not certain about, you know, all the potential side effects that could come with the vaccine.\"\n\nShaniya Morrison added, \"I already have pre-existing health issues. I would not want to put myself at risk by taking a vaccine that has not had enough time to be developed, in my opinion.\"\n\nO'Sullivan and Morrison are not alone.\n\nSTAY UP TO DATE WITH THE FREE CBN NEWS APP \n\nClick Here Get the App with Special Alerts on Breaking News and Top Stories\n\nA recent Pew Research survey found that only 32 percent of Black American adults answered they would either definitely or probably take a COVID-19 vaccine.\n\nAccording to a report by the COVID Collaborative, just 14 percent trust the vaccine's safety.\n\nTo build confidence among communities of color, a group of black health professionals put out a public service message.\n\n\"'Dear Black America, we love you,'\" the video says. 'We have locked arms to place the health and safety of our community at the heart of the national conversation about COVID-19.'\"\n\nDr. Reed Tuckson, Founder of Black Coalition Against COVID says a vaccine can't come soon enough given the devastating impact he has witnessed.\n\n\"We know that this pandemic is now out of control across this country and we are dying at such high rates just as the rest of the rest of the nation is now dying at extraordinary rates,\" Tuckson said in an interview with CBN News.\n\nHe admits much of the hesitation goes back to the Tuskegee Syphilis Experiment, a 40-year government study involving hundreds of black men.\n\nThe men, mostly poor sharecroppers suffering from Syphilis, were monitored by government health officials but not treated. Many died, went blind, or experienced other severe health problems.\n\n\"There are absolutely legitimate reasons why that we would as people be distrustful of government, distrustful of the health enterprise, the experience with Tuskegee back in the [19]30s,\" explained Tuckson.\n\nIt is a history that still haunts many in the black community.\n\n\"We've been used, experimented on for various vaccines for diseases unethically in the past,\" said O'Sullivan. \"That's just something I don't want to have to go through. My ancestors went through it. That's just something I don't want to have to go through personally.\"\n\nDawn Baker, a local news anchor in Savannah, GA chose a different response. She took part in critical trials for the COVID19 vaccine, something she sees as part of the solution to this deadly problem.\n\n \n\n \"I understand the fear,\" said Baker. \"I know the history. I know about the Tuskegee experiment which was absolutely brutal and lasted 40 years in this country. And what's even worse – after they experimented on those black men, once the cure came out, they wouldn't even give them the cure. I would not have just gone to sign up to do this.\"\n\nTuckson also pointed out that much has changed since the experiment.\n\n\"We are in a different position, I think, when it comes to this issue,\" he said. \"We cannot, in my opinion, allow our historical issues to cause us to take actions that will lead to our demise and our death, misery, and suffering in our community.\"\n\nIn the meantime, Tuckson said the medical community must earn the trust of blacks who are suffering from COVID-19 as well as those affected by the malpractice of the past.\n\n\"We have to make sure that at every level of health and medical care delivery that the people that are doing that are comporting themselves with the highest level of integrity that respects the life and the dignity and the worth and the value of every single person and particularly people of color,\" said Tuckson.", "opengraph": {"site_name": "CBN", "type": "article", "url": "https://www2.cbn.com/news/us/weve-been-used-experimented-why-many-black-americans-dont-trust-covid-19-vaccine", "title": "'We've Been Used, Experimented On': Why Many Black Americans Don't Trust COVID-19 Vaccine", "description": "According to a report by the National Urban League, African Americans are infected with COVID-19 at nearly three times the rate of white Americans. And blacks are twice as likely to die from the virus. Still, many don't plan to get the vaccine.", "image": "https://www2.cbn.com/sites/default/files/brightcove/videos/images/thumbnails/_v1_static_734546207001_632817dc-48f7-493f-9829-526bd4121f30_c90eeba7-0b22-49df-837a-a92a8d4e58bf_1920x1080_match_image.jpg", "updated_time": "2022-12-10T13:45:24-0500", "article:section": "CBN | News", "article:tag": "Not Selected", "article:published_time": "2020-12-17T17:15:00-0500", "article:modified_time": "2022-12-10T13:45:24-0500"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.cbn.com/news/app/", "https://www.youtube.com/watch?v=QoPSHB5gBow&t=36s"], "authors": [], "publish_date": "2020-12-17T17:15:00-0500"}