{"result_id": "065052", "URL": "https://www2.cbn.com/news/health/judge-approves-historic-10m-settlement-health-care-workers-fired-over-covid-19-vaccine", "timestamp": "2023-04-25 14:41:18 CEST+0200", "meta": {"description": "A federal judge has approved a $10 million settlement for Illinois healthcare workers who were denied religious exemptio", "lang": "en", "keywords": "", "favicon": "/themes/custom/cbn_emulsify/favicon.ico", "canonical": "https://www2.cbn.com/news/health/judge-approves-historic-10m-settlement-health-care-workers-fired-over-covid-19-vaccine", "encoding": "utf-8"}, "image": null, "domain": "www2.cbn.com", "title": "Judge Approves Historic 10M Settlement for Health Care Workers Fired Over COVID-19 Vaccine Mandate", "cleaned_text": "A federal judge has approved a $10 million settlement for Illinois healthcare workers who were denied religious exemptions or fired for not getting a COVID shot.\n\nJudge John F. Kness approved a class action settlement last week for more than 500 current and former healthcare workers at NorthShore University HealthSystem who were either forced to receive a COVID-19 shot to avoid termination or fired for refusing the vaccine.\n\nThe settlement is the nation's first classwide lawsuit for healthcare professionals over the COVID-19 shot mandate, the Liberty Counsel reports.\n\n\"Let this case be a warning to employers that violated Title VII,\" Mat Staver, founder, and chairman of Liberty Counsel, told The Washington Examiner. \"It is especially significant and gratifying that this first classwide COVID settlement protects healthcare workers.\"\n\nThe non-profit legal group filed the lawsuit on behalf of employees. In August, a $10.3 million settlement was reached in the federal Northern District Court of Illinois but awaited final approval.\n\nNow NorthShore will pay a total of $10,337,500 to compensate the healthcare employees who were victims of religious discrimination and punished for their religious beliefs because they refused to take an injection associated with aborted fetal cells.\n\n\"We are very pleased with the historic, $10 million settlement achieved in our class action lawsuit against NorthShore University HealthSystem. The drastic policy change and substantial monetary relief required by the settlement will bring a strong measure of justice to NorthShore's employees who were callously forced to choose between their conscience and their jobs,\" said Liberty Counsel Vice President of Legal Affairs and Chief Litigation Counsel Horatio G. Mihet.\n\n\"This settlement should also serve as a strong warning to employers across the nation that they cannot refuse to accommodate those with sincere religious objections to forced vaccination mandates,\" he added.\n\nEmployees who were terminated because of their religious refusal of the COVID shots will be eligible for rehire if they apply within 90 days of final settlement approval. They will also retain their previous seniority level.\n\nNorthShore also changed its policy and will now allow religious accommodations in every position at numerous facilities.\n\nA total of 473 employees are expected to receive compensation. Healthcare professionals who were fired are eligible to receive $25,000 and those who complied with the mandate despite their religious objections could receive $3,000.\n\n***Please sign up for CBN Newsletters and download the CBN News app to ensure you keep receiving the latest news from a distinctly Christian perspective.***", "opengraph": {"site_name": "CBN", "type": "article", "url": "https://www2.cbn.com/news/health/judge-approves-historic-10m-settlement-health-care-workers-fired-over-covid-19-vaccine", "title": "Judge Approves Historic 10M Settlement for Health Care Workers Fired Over COVID-19 Vaccine Mandate", "description": "A federal judge has approved a $10 million settlement for Illinois healthcare workers who were denied religious exemptio", "image": "https://www2.cbn.com/sites/default/files/media/slider/images/hospitalstaff.jpeg", "updated_time": "2022-12-28T11:34:13-0500", "article:section": "CBN | News", "article:tag": "CBN News", "article:published_time": "2022-12-28T08:51:56-0500", "article:modified_time": "2022-12-28T11:34:13-0500"}, "tags": [], "tweets": [], "movies": [], "links": ["https://lc.org/122322NorthshoreOrderFinalJudgmentApprovingClassActionSettlement.pdf", "https://www1.cbn.com/cbnnews/quickstart", "https://www1.cbn.com/cbnnews/email-forms", "https://www1.cbn.com/cbn-apps#cbn-news", "https://www1.cbn.com/cbn-apps#cbn-news"], "authors": [], "publish_date": "2022-12-28T08:51:56-0500"}