{"result_id": "065012", "URL": "https://www1.cbn.com/cbnnews/politics/2022/december/senate-passes-defense-bill-rescinding-covid-vaccine-mandate", "timestamp": "2023-04-25 14:39:44 CEST+0200", "meta": {"description": "A bill to rescind the COVID-19 vaccine mandate for members of the U.S.", "lang": "en", "keywords": "", "favicon": "/themes/custom/cbn_emulsify/favicon.ico", "canonical": "https://www2.cbn.com/news/politics/senate-passes-defense-bill-rescinding-covid-vaccine-mandate", "encoding": "utf-8"}, "image": null, "domain": "www1.cbn.com", "title": "Senate Passes Defense Bill Rescinding COVID Vaccine Mandate", "cleaned_text": "WASHINGTON (AP) — A bill to rescind the COVID-19 vaccine mandate for members of the U.S. military and provide nearly $858 billion for national defense passed the Senate on Thursday and now goes to President Joe Biden to be signed into law.\n\nThe bill provides for about $45 billion more for defense programs than Biden requested and roughly 10% more than last year’s bill as lawmakers look to account for inflation and boost the nation’s military competitiveness with China and Russia. It includes a 4.6% pay raise for servicemembers and the Defense Department's civilian workforce.\n\nThe Senate passed the defense policy bill by a vote of 83-11. The measure also received broad bipartisan support in the House last week.\n\nTo win GOP support for the 4,408-page bill, Democrats agreed to Republican demands to scrap the requirement for service members to get a COVID-19 vaccination. The bill directs Defense Secretary Lloyd Austin to rescind his August 2021 memorandum imposing the mandate.\n\nBefore approving the measure, the Senate voted down a couple of efforts to amend it, including a proposal from Sen. Joe Manchin, D-W.Va., to speed the permitting process for energy projects. The effort had drawn fierce opposition from some environmental advocacy groups who worried it would accelerate fossil fuel projects such as gas pipelines and limit the public's input on such projects.\n\nManchin, who chairs the Senate Energy Committee, secured a commitment from Biden and Democratic leaders last summer to support the permitting package in return for his support of a landmark law to curb climate change.\n\nMachin's legislation sets deadlines for completion of National Environmental Policy Act reviews for major energy and natural resource projects. It would require courts to consider litigation involving energy project permits on an expedited basis. It also directs federal agencies to permit the completion of a natural gas pipeline in his home state and Virginia “without further administrative or judicial delay or impediment.\"\n\n“We're on the verge of doing something unbelievable, but let me tell you, most of it will be for naught. Because without permitting reform, the United States of America is more litigious than any nation on earth,\" Manchin told colleagues.\n\nBiden voiced his support for Manchin's legislation a few hours before Thursday's vote. He said far too many projects face delays and described Manchin's amendment “as a way to cut Americans’ energy bills, promote U.S. energy security, and boost our ability to get energy projects built and connected to the grid.“\n\nNot only did some environmental advocacy groups bash Manchin's proposal, but so did many Republicans. Minority Leader Mitch McConnell, R-Ky., said it didn't go far enough, calling it “reform in name only.\"\n\nThe amendment fell short of the 60 votes needed for passage, 47-47.\n\nAn amendment from Sens. Ron Johnson, R-Wis., and Ted Cruz, R-Texas, also went down to defeat. It would have allowed for the reinstatement of those service members discharged for failing to obey an order to receive the COVID-19 vaccine and compensate them for any pay and benefits lost as a result of the separation.\n\n“People serving our military are the finest among us. Over 8,000 were terminated because they refused to get this experimental vaccine, and so I'm urging all of my colleagues to support Senator Cruz's and my amendment,\" Johnson said.\n\nBut opponents worried about the precedent of rewarding members of the military who disobeyed an order. Rhode Island Sen. Jack Reed, the Democratic chairman of the Senate Armed Services Committee, said orders are not suggestions, they are commands.\n\n“What message do we send if we pass this bill? It is a very dangerous one,\" Reed said. “What we're telling soldiers is, ‘if you disagree, don't follow the order, and then just lobby Congress, and they'll come along and they'll restore your rank, or restore your benefits, or restore everything.'\"\n\nThe amendment failed, with 40 senators supporting it and 54 opposing it.\n\nThe defense bill sets policy and provides a roadmap for future investments. Lawmakers will have to follow up with spending bills to bring many provisions to reality. It’s one of the final bills Congress is expected to approve before adjourning, so lawmakers were eager to attach their top priorities to it.\n\nThe directive to rescind the vaccine mandate for service members proved to be among the most controversial provisions, but Democrats agreed to it to allow the bill to advance.\n\nAs of early this month, about 99% of the active-duty troops in the Navy, Air Force and Marine Corps had been vaccinated, and 98% of the Army. Service members who are not vaccinated are not allowed to deploy, particularly sailors or Marines on ships. There may be a few exceptions to that, based on religious or other exemptions and the duties of the service member.\n\nThe vaccination numbers for the Guard and Reserve are lower, but generally all are more than 90%.", "opengraph": {"site_name": "CBN", "type": "article", "url": "https://www2.cbn.com/news/politics/senate-passes-defense-bill-rescinding-covid-vaccine-mandate", "title": "Senate Passes Defense Bill Rescinding COVID Vaccine Mandate", "description": "A bill to rescind the COVID-19 vaccine mandate for members of the U.S.", "image": "https://www2.cbn.com/sites/default/files/media/slider/images/ap22349610525420.jpg", "updated_time": "2022-12-15T23:57:32-0500", "article:section": "CBN | News", "article:tag": "CBN News", "article:published_time": "2022-12-15T23:57:32-0500", "article:modified_time": "2022-12-15T23:57:32-0500"}, "tags": [], "tweets": [], "movies": [], "links": ["https://apnews.com/article/business-health-coronavirus-pandemic-coronavirus-vaccine-4cf7451267919302de4a7b591508e80c", "https://apnews.com/article/joe-manchin-budget-agreement-7b0ee6e3e0b70357288fd69f44473b9b", "https://apnews.com/article/covid-lloyd-austin-united-states-government-and-politics-ef76a0da58520cacbbfce003d66ed183"], "authors": [], "publish_date": "2022-12-15T23:57:32-0500"}