{"result_id": "065027", "URL": "https://www2.cbn.com/news/us/kids-booted-class-vaccine-crackdown", "timestamp": "2023-04-25 14:40:19 CEST+0200", "meta": {"description": "Public schools in Spokane, Washington, booted 143 students from class earlier this week because they weren't up to date on their vaccines.", "lang": "en", "keywords": "cbnnewsyoutube, vaccincation, innoculation, vaccine, homeschool, parents rights, parental choice, homeschooling, public school, California Senate, Washington state, Spokane,", "favicon": "/themes/custom/cbn_emulsify/favicon.ico", "canonical": "https://www2.cbn.com/news/us/kids-booted-class-vaccine-crackdown", "encoding": "utf-8"}, "image": null, "domain": "www2.cbn.com", "title": "Kids Booted from Class in Vaccine Crackdown", "cleaned_text": "Public schools in Spokane, Washington, booted 143 students from class earlier this week because they weren't up to date on their vaccines.\n\n\n\n\"I just really want to applaud Spokane Public Schools for taking a stand and enforcing the Washington state immunization law,\" said Alexandra Hayes, coordinator for the Spokane health district's Immunization Outreach.\n\n\n\nWashington state has some of the nation's strictest vaccination laws.\n\n\n\nSpokane Public Schools had warned parents their kids would be removed from class if they did not meet the deadline or complete a waiver. But it still came as a shock to some families.\n\n\n\nJim Young had to leave work to get his son. He thought his son was up to date on his shots, but the school said he wasn't.\n\n\n\n\"I got a call saying they haven't got his records yet,\" Young said. \n\n\n\nThe city is offering free vaccine clinics at certain high schools throughout the week, so Young was able to remedy the problem quickly.\n\n\n\n\"I showed up and they said if I come down here it can be done, so I said fine,\" he explained.\n\n\n\nWashington's vaccine law does allow some exemptions.\n\n\n\nMeanwhile, opponents of forced vaccinations rallied once again in California Tuesday. A group called Million Moms organized the rally in Sacramento.\n\n\n\nLawmakers in the California Senate are considering a measure that would bar students from attending school at all if they haven't received all their vaccines.\n\n\n\nThe goal of the California bill is to eliminate parents' option for exemption based on personal beliefs.\n\n\n\nParent Celena Mesa said, \"nothing absolutely nothing\" can change her mind on this issue. \n\n\n\n\"If I have to do jail time, God forbid, if I have to homeschool my kids, I would not vaccinate on their schedule,\" she said.", "opengraph": {"site_name": "CBN", "type": "article", "url": "https://www2.cbn.com/news/us/kids-booted-class-vaccine-crackdown", "title": "Kids Booted from Class in Vaccine Crackdown", "description": "Public schools in Spokane, Washington, booted 143 students from class earlier this week because they weren't up to date on their vaccines.", "image": "https://www2.cbn.com/sites/default/files/cbnnews/VaccineShot2_LW.jpg", "updated_time": "2023-01-15T15:27:41-0500", "article:section": "CBN | News", "article:tag": "Not Selected", "article:published_time": "2023-04-25T08:40:20-0400", "article:modified_time": "2023-01-15T15:27:41-0500"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2023-04-25T08:40:20-0400"}