{"result_id": "065053", "URL": "https://www2.cbn.com/news/us/pfizer-applies-emergency-use-lower-dose-covid-vaccine-children-biden-pushes-vaccine", "timestamp": "2023-04-25 14:41:19 CEST+0200", "meta": {"description": "The fight against COVID-19 is now extending to children as young as five years old.  Smaller doses of the Pfizer vaccine could be given the green light by the end of the month.", "lang": "en", "keywords": "fight, COVID-19, children, doses, vaccine, five years old, Pfizer vaccine, emergency, request, President Biden, pushes, vaccinations, Americans, mandates, Brody Carter, CBN News, October 2021, cbnnewsyoutube", "favicon": "/themes/custom/cbn_emulsify/favicon.ico", "canonical": "https://www2.cbn.com/news/us/pfizer-applies-emergency-use-lower-dose-covid-vaccine-children-biden-pushes-vaccine", "encoding": "utf-8"}, "image": null, "domain": "www2.cbn.com", "title": "Pfizer Applies for Emergency Use of Lower Dose COVID Vaccine for Children, Biden Pushes Vaccine Mandates", "cleaned_text": "Pfizer Applies for Emergency Use of Lower Dose COVID Vaccine for Children, Biden Pushes Vaccine Mandates\n\nThe fight against COVID-19 is now extending to children as young as five years old. Smaller doses of the Pfizer vaccine could be given the green light by the end of the month.\n\nCBN News is following Pfizer's emergency request as the president pushes to vaccinate all Americans.\n\nPfizer applied for emergency use of a lower dose of the COVID-19 vaccine for children ages 5 to 11 on Thursday. Until now, only people 12 and up could be vaccinated.\n\n\"It did hurt for about two days but the pain just went away,\" eight-year-old Sebastian Prybol said.\n\nPrybol received two doses during the Pfizer COVID trial, celebrating with cake and a fresh band-aid.\n\nThe plan is to give children one-third of the dose that's given to people 12 and up. Pfizer's research studied 2,268 children under the age of 11. Data shows children with two kid-sized doses developed antibody levels as strongly as adults.\n\n\"I'm helping other kids get the vaccine,\" Prybol said. \"If I had to get the vaccine, I would honestly.\"\n\nEven though the virus is known to cause serious illness in older populations, COVID-19 has killed at least 520 children in the U.S.\n\nPfizer's vaccine request comes as the Delta Variant makes it hard for many schools to stay fully open. A Kaiser Family Foundation survey found nearly a quarter of classrooms were quarantined due to possible exposure.\n\nAs for adults, President Joe Biden again was making his case for vaccine mandates during a trip to Illinois Thursday.\n\n\"We have to beat this thing,\" Biden said. \"So, while I didn't race to do it right away, that's why I have had to move toward requirements and everyone had to get vaccinated where I had the authority to do that. It wasn't my first instinct.\"\n\nRoughly 22% of American adults haven't been vaccinated. In the coming weeks, more than 100 million workers will be subject to vaccine requirements under a presidential order.\n\n\"The Labor Department is going to shortly issue an emergency rule to require all employers with more than 100 people, whether they work for the federal government or not, to ensure their workers are fully vaccinated or make sure they're tested once a week,\" Biden said.\n\nThe president first spoke about vaccine mandates a month ago, but the government still hasn't issued regulations for it, leaving businesses in the dark.\n\nThe vaccine push comes ahead of what is to be a busy holiday travel season. United Airlines, the first airline to vaccinate 99 percent of its staff, plans to fly 3,500 flights in December, every single day.\n\n***Please sign up for CBN Newsletters and download the CBN News app to ensure you keep receiving the latest news from a distinctly Christian perspective.***", "opengraph": {"site_name": "CBN", "type": "article", "url": "https://www2.cbn.com/news/us/pfizer-applies-emergency-use-lower-dose-covid-vaccine-children-biden-pushes-vaccine", "title": "Pfizer Applies for Emergency Use of Lower Dose COVID Vaccine for Children, Biden Pushes Vaccine Mandates", "description": "The fight against COVID-19 is now extending to children as young as five years old.  Smaller doses of the Pfizer vaccine could be given the green light by the end of the month.", "image": "https://www2.cbn.com/sites/default/files/brightcove/videos/images/thumbnails/_v1_jit_734546207001_f3396c74-fbd4-4463-9b0a-144d0d3cdf0a_main_1280x720_1m23s208ms_match_image.jpg", "updated_time": "2022-12-10T13:45:24-0500", "article:section": "CBN | News", "article:tag": "Not Selected", "article:published_time": "2021-10-08T13:30:00-0400", "article:modified_time": "2022-12-10T13:45:24-0500"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www1.cbn.com/cbnnews/email-forms", "https://www1.cbn.com/cbn-apps#cbn-news", "https://www1.cbn.com/cbn-apps#cbn-news"], "authors": [], "publish_date": "2021-10-08T13:30:00-0400"}