{"result_id": "065033", "URL": "https://www2.cbn.com/news/us/td-jakes-suggests-using-churches-faith-based-groups-encourage-african-americans-take-covid", "timestamp": "2023-04-25 14:40:33 CEST+0200", "meta": {"description": "To better inform the African American community about the coronavirus vaccine, Bishop T.D. Jakes of Dallas' Potters House, brought in big name experts for an online event Monday called \"In Conversations with America: Understanding the COVID-19 Vaccine.\" During the nearly hour-long discussion, Jakes asked the health experts if they had any angst about the vaccine over the long term.", "lang": "en", "keywords": "cbnnewsyoutube, CBN News, T.D. Jakes, Potter's House, Covid-19, Coronavirus, vaccine, Dr. Anthony Fauci, churches, pandemic, prayer", "favicon": "/themes/custom/cbn_emulsify/favicon.ico", "canonical": "https://www2.cbn.com/news/us/td-jakes-suggests-using-churches-faith-based-groups-encourage-african-americans-take-covid", "encoding": "utf-8"}, "image": null, "domain": "www2.cbn.com", "title": "TD Jakes Suggests Using Churches, Faith-Based Groups to Encourage African Americans to Take COVID Vaccine", "cleaned_text": "To better inform the African American community about the coronavirus vaccine, Bishop T.D. Jakes of Dallas' Potters House, brought in big-name experts for an online event Monday called \"In Conversations with America: Understanding the COVID-19 Vaccine.\"\n\nDuring the nearly hour-long discussion, Jakes asked the health experts if they had any angst about the vaccine over the long term.\n\nDr. Kizzmekia Corbett, a viral immunologist and lead scientist on the coronavirus research team at the National Institute of Infectious and Allergic Disease's Vaccine Research Center, did not hesitate to respond.\n\n\"Absolutely no angst at all,\" said Dr. Corbett. \"One of the things that is largely forgotten throughout this is that the first phase one clinical actually trial started on March the 16 which was almost ten months ago. And so, from those people, they've been followed since then. And there are no outcomes for long-term adverse outcomes. \"Long-term side effects is not something to be worried about.\"\n\nMuch of the concern among blacks dates back to the Tuskegee Syphilis Experiment, a 40-year government study involving hundreds of black men.\n\nThe men, mostly poor sharecroppers suffering from syphilis, were monitored yet not treated by government health officials. Many died, went blind or experienced other severe health problems.\n\nDr. Anthony Fauci, the nation's top medical advisor, admitted the skepticism in the black community is understandable.\n\n\"It's a shameful history that we have to just deal with,\" said Fauci. \"So, whenever I talk with my African American friends and colleagues about getting vaccinated, you always have to show respect for their skepticism and then get them to understand why it is safe. It is effective and it's good not only for your own health but for your families and your community.\"\n\nWith that being said, the US has now reported nearly 200 cases of a more contagious COVID-19 variant.\n\nThe variant which was first detected in the UK has spread in 23 states including Maryland and Virginia.\n\nJakes addressed that concern by asking if there were strains on the horizon that could threaten the efficacy of the COVID vaccine.\n\n\"Right now the data do not indicate that the mutations that are being studied right now in both the UK which has spread to other countries and South Africa interfere with the efficacy of the antibodies induced by the currently used vaccine,\" said Fauci. \"However, this is something we need to keep our eye out on and that's the reason why we take mutations very seriously and we study them very seriously.\"\n\nJakes also explained that while hard-hit communities of color desperately need the vaccine, access and distribution could be a problem. He suggested using churches and other faith-based groups as a solution.\n\n\"Is there any thought about getting medical professionals to work through faith-based entities within those local communities where they can go to churches for instance and have medical physicians there that could administer the vaccine because many of our communities are in food deserts and places like that where they can't get the vaccine?\" he asked.\n\n\"You could do it by community centers, churches you mentioned Bishop is important, faith-based organizations getting involved,\" responded Fauci. \"But also, mobile units to go out into those communities which are not readily accessible.\"\n\nMeanwhile, Jakes says while the online conversation provides people with education and knowledge about the shot, he also wants to offer hope to those affected by the pandemic.\n\nSTAY UP TO DATE WITH THE FREE CBN NEWS APP \n\nClick Here Get the App with Special Alerts on Breaking News and Top Stories", "opengraph": {"site_name": "CBN", "type": "article", "url": "https://www2.cbn.com/news/us/td-jakes-suggests-using-churches-faith-based-groups-encourage-african-americans-take-covid", "title": "TD Jakes Suggests Using Churches, Faith-Based Groups to Encourage African Americans to Take COVID Vaccine", "description": "To better inform the African American community about the coronavirus vaccine, Bishop T.D. Jakes of Dallas' Potters House, brought in big name experts for an online event Monday called \"In Conversations with America: Understanding the COVID-19 Vaccine.\" During the nearly hour-long discussion, Jakes asked the health experts if they had any angst about the vaccine over the long term. ", "image": "https://www2.cbn.com/sites/default/files/brightcove/videos/images/thumbnails/_v1_jit_734546207001_d8bb8315-c597-47ee-bde6-fa689f516600_main_1280x720_1m28s171ms_match_image.jpg", "updated_time": "2022-12-10T13:45:24-0500", "article:section": "CBN | News", "article:tag": "Not Selected", "article:published_time": "2021-01-27T13:30:00-0500", "article:modified_time": "2022-12-10T13:45:24-0500"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/JEXB0lyxqqs\" width=\"560\"/>", "src": "https://www.youtube.com/embed/JEXB0lyxqqs"}], "links": ["https://www.cbn.com/news/app/"], "authors": [], "publish_date": "2021-01-27T13:30:00-0500"}