{"result_id": "065017", "URL": "https://www2.cbn.com/news/news/us-share-astrazeneca-shots-world-after-safety-check", "timestamp": "2023-04-25 14:39:58 CEST+0200", "meta": {"description": "The U.S. will begin sharing its entire stock of AstraZeneca COVID-19 vaccines with the world once it clears federal safety reviews, the White House said Monday, with as many as 60 million doses expected to be available for export in the coming months.", "lang": "en", "keywords": "US, vaccine, stockpile, AstraZenaca, doses, CBN News, cbnnews.com", "favicon": "/themes/custom/cbn_emulsify/favicon.ico", "canonical": "https://www2.cbn.com/news/news/us-share-astrazeneca-shots-world-after-safety-check", "encoding": "utf-8"}, "image": null, "domain": "www2.cbn.com", "title": "US to Share AstraZeneca Shots with World After Safety Check", "cleaned_text": "WASHINGTON (AP) — The U.S. will begin sharing its entire stock of AstraZeneca COVID-19 vaccines with the world once it clears federal safety reviews, the White House said Monday, with as many as 60 million doses expected to be available for export in the coming months.\n\nThe move greatly expands on the Biden administration's action last month to share about 4 million doses of the vaccine with Mexico and Canada. The AstraZeneca vaccine is widely in use around the world but has not yet been authorized by the U.S. Food and Drug Administration.\n\nThe White House is increasingly feeling assured about the supply of the three vaccines being administered in the U.S., particularly following the restart of the single-dose Johnson & Johnson shot over the weekend. The U.S. has also been under mounting pressure in recent weeks to share more of its vaccine supply with the world, as countries like India experience devastating surges of the virus and others struggle to access doses needed to protect their most vulnerable populations.\n\n“Given the strong portfolio of vaccines that the U.S. already has and that have been authorized by the FDA, and given that the AstraZeneca vaccine is not authorized for use in the U.S., we do not need to use the AstraZeneca vaccine here during the next several months,\" said White House COVID-19 coordinator Jeff Zients. \"Therefore the U.S. is looking at options to share the AstraZeneca doses with other countries as they become available.”\n\nMore than 3 million people worldwide have died of COVID-19, including more than 572,000 in the U.S. The U.S. has vaccinated more than 53% of its adult population with at least one dose of its three authorized vaccines from Pfizer, Moderna and J&J, and it expects to have enough supply for its entire population by early summer.\n\nAbout 10 million doses of AstraZeneca vaccine have been produced but have yet to pass review by the FDA to “meet its expectations for product quality,” Zients said, noting the U.S. regulator is recognized as the “gold standard” for safety around the world. That process could be completed in the next several weeks. About 50 million more doses are in various stages of production and could be available to ship in May and June pending FDA sign-off.", "opengraph": {"site_name": "CBN", "type": "article", "url": "https://www2.cbn.com/news/news/us-share-astrazeneca-shots-world-after-safety-check", "title": "US to Share AstraZeneca Shots with World After Safety Check", "description": "The U.S. will begin sharing its entire stock of AstraZeneca COVID-19 vaccines with the world once it clears federal safety reviews, the White House said Monday, with as many as 60 million doses expected to be available for export in the coming months.", "image": "https://www2.cbn.com/sites/default/files/media/slider/images/astrazenecawarning_hdv_0.jpg", "updated_time": "2021-04-27T06:00:43-0400", "article:section": "CBN | News", "article:tag": "Not Selected", "article:published_time": "2021-04-27T10:00:00-0400", "article:modified_time": "2021-04-27T06:00:43-0400"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2021-04-27T10:00:00-0400"}