{"result_id": "065029", "URL": "https://www2.cbn.com/news/us/vaccine-or-bust-biden-orders-84m-americans-take-jab-will-third-us-workers-quit", "timestamp": "2023-04-25 14:40:24 CEST+0200", "meta": {"description": "The jab or your job? That's what 84-million Americans are facing after the Biden administration has finally, officially, released the President's vaccine mandate against private businesses. More than two dozen states are pushing back, and millions of employees say they'll lose their jobs rather than take the shot.", "lang": "en", "keywords": "COVID-19, jab, job, vaccine, Americans, Biden administration, President, vaccine mandate, private businesses, millions of employees,", "favicon": "/themes/custom/cbn_emulsify/favicon.ico", "canonical": "https://www2.cbn.com/news/us/vaccine-or-bust-biden-orders-84m-americans-take-jab-will-third-us-workers-quit", "encoding": "utf-8"}, "image": null, "domain": "www2.cbn.com", "title": "Vaccine or Bust: Biden Orders 84M Americans to Take the Jab - Will a Third of US Workers Quit?", "cleaned_text": "Vaccine or Bust: Biden Orders 84M Americans to Take the Jab - Will a Third of US Workers Quit?\n\nWASHINGTON – The jab or your job? That's what 84-million Americans are facing after the Biden administration has finally, officially, released the President's vaccine mandate against private businesses. More than two dozen states are pushing back, and millions of employees say they'll lose their jobs rather than take the shot.\n\nBut the message from the Biden Administration is vaccine or bust. The President is demanding that all businesses with more than 100 employees should force them to take a COVID-19 vaccine.\n\nThe order calls for businesses to either require vaccinations – or – weekly testing for unvaccinated employees, and those tests would be required at the employees' own expense.\n\nThe new mandate gives millions of Americans until January 4th to comply. That includes 17 million healthcare workers in nursing homes and hospitals that receive money from Medicare and Medicaid. They do not have the option of testing out of the vaccine.\n\nBusinesses that don't find a way to enforce the mandate will face a $14,000 fine per violation.\n\nAt a hearing on Capitol Hill, Dr. Anthony Fauci, Chief Medical Advisor on COVID-19, defended the extremely controversial move. \"We know that vaccines absolutely save lives and we know that mandates work,\" Fauci testified.\n\nStates are pushing back with more than two dozen taking legal action.\n\n\"From the very beginning, I've told President Biden that I would defend the freedom of the people of South Dakota and that if he took this action that we would see him in court,\" said South Dakota Gov. Kristi Noem (R) in a video on Twitter. \"Today I'm announcing to you that we are joining several other states in filing litigation against this unconstitutional mandate.\"\n\nHeavy Burden on Businesses and the Supply Chain\n\nSeveral business groups have expressed concern too, arguing that the mandate will burden them during the busy holiday season.\n\nThe mandate does not include a carve-out for truck drivers, sparking concern for an already crippled supply chain that has helped to fuel inflation.\n\n\"There are 80,000 truck drivers that are not on the job as we speak. That's up from 60,000 just a couple of weeks ago,\" CBN News Chief Political Analyst David Brody told CBN's Faith Nation. \"This is getting worse.\"\n\nMore Than a Third of Unvaccinated Americans Threaten to Quit Jobs\n\nA recent survey from the Kaiser Family Foundation shows 37 percent of unvaccinated workers say they would leave if their employer required them to get vaccinated or be regularly tested.\n\nSo what are opponents specifically challenging?\n\nSome point out that while the mandate is supposed to be an \"emergency\" rule, it doesn't take effect until January, about four months after President Biden announced it. For that reason, they question how it can be called an \"emergency.\"\n\nOpponents also note that COVID-19 cases have declined from a recent wave in September and that the U.S. is nearing herd immunity.\n\nSome like Florida Gov. Ron DeSantis (R) argue that the mandate being issued via the Labor Department is government by bureaucracy, inconsistent with the Constitution.\n\nWhat do Christian legal groups say about how to get a religious exemption?\n\n HERE ARE SOME USEFUL RESOURCES:\n• Liberty Counsel offers tools HERE to assess or apply for religious exemption.\n• Alliance Defending Freedom also offers useful information HERE.\n\nMORE FROM CBN NEWS 'Sincerely Held Belief' Key to Religious Objection over COVID Vaccine\n\n***Please sign up for CBN Newsletters and download the CBN News app to ensure you keep receiving the latest news from a distinctly Christian perspective.***", "opengraph": {"site_name": "CBN", "type": "article", "url": "https://www2.cbn.com/news/us/vaccine-or-bust-biden-orders-84m-americans-take-jab-will-third-us-workers-quit", "title": "Vaccine or Bust: Biden Orders 84M Americans to Take the Jab - Will a Third of US Workers Quit?", "description": "The jab or your job? That's what 84-million Americans are facing after the Biden administration has finally, officially, released the President's vaccine mandate against private businesses. More than two dozen states are pushing back, and millions of employees say they'll lose their jobs rather than take the shot.", "image": "https://www2.cbn.com/sites/default/files/brightcove/videos/images/thumbnails/_v1_jit_734546207001_af0f40d2-a50a-4c5f-8286-20d9e269cb54_main_1280x720_5m55s486ms_match_image.jpg", "updated_time": "2022-12-10T13:45:24-0500", "article:section": "CBN | News", "article:tag": "Not Selected", "article:published_time": "2021-11-05T14:15:00-0400", "article:modified_time": "2022-12-10T13:45:24-0500"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www1.cbn.com/cbn-apps#cbn-news", "https://lc.org/exempt", "https://adflegal.org/resources/covid19-vaccine-mandate", "https://www1.cbn.com/cbnnews/us/2021/september/sincerely-held-belief-key-to-religious-objection-over-covid-vaccine", "https://www1.cbn.com/cbnnews/email-forms", "https://www1.cbn.com/cbn-apps#cbn-news"], "authors": [], "publish_date": "2021-11-05T14:15:00-0400"}