{"result_id": "065004", "URL": "https://www2.cbn.com/news/us/west-virginia-winning-vaccination-race-we-didnt-necessarily-take-federal-approach", "timestamp": "2023-04-25 14:39:29 CEST+0200", "meta": {"description": "More than 93,000 Americans died from COVID-19 in January, making it the deadliest month since the pandemic began.", "lang": "en", "keywords": "CBN News, Charolette Lozier Institute, CNBC, Mass Transit, West Virginia, mask mandate, vaccine, COVID-19, pandemic, February, 2021", "favicon": "/themes/custom/cbn_emulsify/favicon.ico", "canonical": "https://www2.cbn.com/news/us/west-virginia-winning-vaccination-race-we-didnt-necessarily-take-federal-approach", "encoding": "utf-8"}, "image": null, "domain": "www2.cbn.com", "title": "West Virginia Is Winning the Vaccination Race: 'We Didn't Necessarily Take the Federal Approach'", "cleaned_text": "West Virginia Is Winning the Vaccination Race: 'We Didn't Necessarily Take the Federal Approach'\n\nMore than 93,000 Americans died from COVID-19 in January, making it the deadliest month since the pandemic began.\n\nStates are still struggling to get the vaccines to people. The CDC says it has shipped 50 million doses, but only 31 million have been given.\n\nOne exception is West Virginia – one of 11 states that have vaccinated 10 percent of their population.\n\nOver the past few weeks, the Mountain State has ranked number one or number two in the country for vaccine doses administered. West Virginia has a first dose administration rate of 108.1 percent and a second dose immunization rate of 69.4 percent, according to vaccine data listed on the state's COVID-19 dashboard Monday.\n\nGov. Jim Justice said, \"If we had an unlimited supply of vaccines, we would have every single breathing 65-year-old-plus vaccinated by Valentine's Day.\"\n\n\"We didn't necessarily take the federal approach, we took a practical approach, and we took an all-in approach,\" Justice added. \"We brought our National Guard, our local pharmacies, our local health care people, and our local health clinics and everything.\"\n\nMeanwhile, a new mask mandate on public transportation is going into effect today.\n\nThe CDC issued an order on Friday detailing the mask requirements for those working on airplanes, trains, buses, and taxis.\n\n\"America's transportation systems are essential,\" said CDC Director Dr. Rochelle P. Walensky, MPH. \"Given how interconnected most transportation systems are across our nation and the world when infected persons travel on public conveyances without wearing a mask and with others who are not wearing masks, the risk of interstate and international transmission can grow quickly.\"\n\nTSA agents will have the power to enforce the rule in airports across the nation. The measure will remain in effect until the Secretary of Health and Human Services cancels the public health emergency.\n\nOn the vaccine front, Johnson & Johnson is expected to apply for emergency authorization for its vaccine within days. The company reports its vaccine is 66 percent effective overall at preventing moderate to severe illness.\n\nBut some pro-life Christians have a problem with that particular vaccine. The Charlotte Lozier Institute reports Johnson & Johnson is one of the few companies that used abortion-derived cells in all phases of its vaccine creation, from design and development to production and testing.\n\n***As certain voices are censored and free speech platforms shut down, be sure to sign up for CBN News emails and the CBN News app to ensure you keep receiving news from a Christian Perspective.***", "opengraph": {"site_name": "CBN", "type": "article", "url": "https://www2.cbn.com/news/us/west-virginia-winning-vaccination-race-we-didnt-necessarily-take-federal-approach", "title": "West Virginia Is Winning the Vaccination Race: 'We Didn't Necessarily Take the Federal Approach'", "description": "More than 93,000 Americans died from COVID-19 in January, making it the deadliest month since the pandemic began.", "image": "https://www2.cbn.com/sites/default/files/media/slider/images/vaccinechart_hdv.jpg", "updated_time": "2021-02-01T17:45:41-0500", "article:section": "CBN | News", "article:tag": "Not Selected", "article:published_time": "2021-02-01T17:30:00-0500", "article:modified_time": "2021-02-01T17:45:41-0500"}, "tags": [], "tweets": [], "movies": [], "links": ["https://dhhr.wv.gov/COVID-19/Pages/default.aspx", "https://www.cnbc.com/2021/01/27/west-virginia-governor-claims-every-person-over-65-could-be-vaccinated-by-valentines-day.html", "https://www.masstransitmag.com/safety-security/article/21208164/face-mask-mandate-for-transit-goes-into-effect-late-feb-1", "https://lozierinstitute.org/update-covid-19-vaccine-candidates-and-abortion-derived-cell-lines/", "https://www1.cbn.com/cbnnews/email-forms", "https://www1.cbn.com/cbn-apps#cbn-news"], "authors": [], "publish_date": "2021-02-01T17:30:00-0500"}