{"result_id": "065057", "URL": "https://www2.cbn.com/news/world/dangerous-threat-freedom-who-committee-wants-worldwide-vaccine-passports", "timestamp": "2023-04-25 14:41:28 CEST+0200", "meta": {"description": "A key committee of the World Health Organization is moving ahead with plans to demand vaccine passports for global trave", "lang": "en", "keywords": "", "favicon": "/themes/custom/cbn_emulsify/favicon.ico", "canonical": "https://www2.cbn.com/news/world/dangerous-threat-freedom-who-committee-wants-worldwide-vaccine-passports", "encoding": "utf-8"}, "image": null, "domain": "www2.cbn.com", "title": "'Dangerous Threat to Freedom': WHO Committee Wants Worldwide Vaccine Passports", "cleaned_text": "A key committee of the World Health Organization is moving ahead with plans to demand vaccine passports for global travel.\n\nThe WHO's International Health Regulations Review Committee (IHRRC) is meeting this week to finalize amendments to its International Health Regulations (IHR), including the passports.\n\nThe 76th World Health Assembly is scheduled to occur in May 2023, and the IHRRC is pushing for the world health conference to institute a system of digital or paper global health vaccine passports, according to Liberty Counsel, a Christian religious rights law firm.\n\nThe controversial passport proposal could be adopted by a simple majority of the 194 member nations.\n\nSeveral people in the U.S. continue to warn that if allowed, the health or vaccine passports would eventually track every aspect of Americans' lives, violating the U.S. Constitution, the Americans With Disabilities Act, and HIPAA, due to the fact that everyone's medical records would be a part of a worldwide database.\n\nLiberty Counsel Founder and Chairman Mat Staver said, \"America's sovereignty is not for sale. Digital health or vaccine passports along with tracking and tracing apps present a serious threat to freedom. Vaccine passports and tracking apps are about collecting data and control.\"\n\n\"COVID has been used to advance this dangerous threat to freedom,\" Staver added. \"We must never accept vaccine passports or tracking apps as the new normal. The implications for freedom are significant. America should not be involved in such an evil organization as the World Health Organization.\"\n\nAs CBN News reported in November, the leaders of the world's largest economies at the G20 meeting held in Bali, Indonesia, drafted and signed a declaration in which the 20 countries agreed to adopt vaccine passports with the purported goal to promote global travel and tourism.\n\nPresident Joe Biden signed the Bali Declaration along with other world leaders. It included a section (s.23) on \"facilitating seamless international travel.\" It acknowledged the importance of shared technical standards and verification methods, including vaccine passports. The declaration also includes the commitment of the leaders to \"support continued international dialogue and collaboration on the establishment of trusted global digital health networks that should capitalize and build on...existing standard and digital COVID-19 certificates.\"\n\nThe impact would be vast because the G20 countries comprise more than 66 percent of the world's population. It includes Argentina, Australia, Brazil, Canada, China, France, Germany, Japan, India, Indonesia, Italy, Mexico, Russia, South Africa, Saudi Arabia, South Korea, Turkey, United Kingdom, United States, and European Union.\n\n***Please sign up for CBN Newsletters and download the CBN News app to ensure you keep receiving the latest news from a distinctly Christian perspective.***\n\nIn August of 2021, the WHO published a 99-page guidebook on the implementation of digital documentation of COVID-19 certificates, also known as vaccine passports.\n\nThe COVID passports could be paper or a digital code or an app that records and displays the user's health information, including vaccination status. Digital health passports would involve a scannable code similar to an airline boarding pass. Then tracking and tracing apps could monitor the user's movement and their interactions with other people. The app would even issue a warning if the user moves outside of a quarantine zone.\n\nIn April of 2021, then-White House Press Secretary Jen Psaki said the U.S. government won't issue so-called vaccine passports. She said the Biden administration wants to protect Americans' privacy and doesn't want vaccination records \"used against people unfairly.\" But the same administration also implemented COVID vaccine mandates across the federal government and U.S. military.\n\nMeanwhile, the U.S. Department of Health and Human Services (HHS) on Wednesday extended the COVID-19 state of emergency.\n\nHHS Secretary Xavier Becerra issued his decision in a declaration titled Renewal of Determination that a Public Health Emergency Exists.\n\nAs CBN News reported in late September, President Biden twice said the COVID-19 pandemic was over during an interview with CBS's 60 Minutes.\n\n\"The pandemic is over,\" Biden said. \"We still have a problem with COVID. We're still doing a lot of work on it. But the pandemic is over. If you notice, no one is wearing masks and everyone seems to be in good shape.\"\n\nCraig DeLisi, M.D., a Family Medicine Specialist at Titus Regional Medical Center in Mt. Pleasant, Texas, told CBN News at the time he didn't think the person who declared the pandemic over would be a politician.\n\n\"I think what he meant was things are improving, but declaring it was over was not the best verbiage,\" Dr. DeLisi said. \"Saying the pandemic is over might make people think, 'OK, we don't need to give any concern whatsoever,' and that's just not true. It's a virus that's here, it's a stinker of a virus, still probably the most contagious one we see, and still affects people profoundly. I've lost patients even in the last couple of months that I care deeply about.\"\n\nWhile health experts may debate whether COVID-19 is now a pandemic or an endemic, one thing is certain: the virus is still going around, and it appears to be here to stay.\n\n\"I think as people who follow Christ,\" said Dr. DeLisi, \"we do that, one, without fear. In other words, we know who holds tomorrow even if that tomorrow is terrible and ugly, our trust is in Him. And the second is that I think we should do that with others' consideration. And I hope we have learned that with COVID that my germs don't just affect me, and I think we should be considerate, and err on the side of caution and love.\"", "opengraph": {"site_name": "CBN", "type": "article", "url": "https://www2.cbn.com/news/world/dangerous-threat-freedom-who-committee-wants-worldwide-vaccine-passports", "title": "'Dangerous Threat to Freedom': WHO Committee Wants Worldwide Vaccine Passports", "description": "A key committee of the World Health Organization is moving ahead with plans to demand vaccine passports for global trave", "image": "https://www2.cbn.com/sites/default/files/media/standard/images/vaccinepassport_0.png", "updated_time": "2023-01-11T16:46:11-0500", "article:section": "CBN | News", "article:tag": "CBN News", "article:published_time": "2023-01-11T16:39:18-0500", "article:modified_time": "2023-01-11T16:46:11-0500"}, "tags": [], "tweets": [], "movies": [], "links": ["https://lc.org/", "https://www1.cbn.com/cbnnews/quickstart", "https://www1.cbn.com/cbnnews/world/2022/november/g20-leaders-agree-to-global-vaccination-passport-to-limit-rights-of-travelers-where-will-it-end", "https://www.whitehouse.gov/briefing-room/statements-releases/2022/11/16/g20-bali-leaders-declaration/", "https://www1.cbn.com/cbnnews/email-forms", "https://www1.cbn.com/cbn-apps#cbn-news", "https://aspr.hhs.gov/legal/PHE/Pages/covid19-11Jan23.aspx", "https://CBN News", "https://www1.cbn.com/cbn-apps#cbn-news"], "authors": [], "publish_date": "2023-01-11T16:39:18-0500"}