{"result_id": "065003", "URL": "https://www2.cbn.com/article/not-selected/pastors-wife-advocates-vaccines-and-receives-death-threats-call-courage", "timestamp": "2023-04-25 14:39:23 CEST+0200", "meta": {"description": "Emily Smith is an epidemiologist at Baylor University, the wife of a Baptist pastor, and a mother.", "lang": "en", "keywords": "", "favicon": "/themes/custom/cbn_emulsify/favicon.ico", "canonical": "https://www2.cbn.com/article/not-selected/pastors-wife-advocates-vaccines-and-receives-death-threats-call-courage", "encoding": "utf-8"}, "image": null, "domain": "www2.cbn.com", "title": "Pastor’s Wife Advocates for Vaccines and Receives Death Threats: A Call to Courage That Glorifies Jesus", "cleaned_text": "Emily Smith is an epidemiologist at Baylor University, the wife of a Baptist pastor, and a mother. She has been working hard to help her fellow evangelicals understand the urgency of getting vaccinated against COVID-19.\n\nThough she has received vociferous criticism and even death threats, she is committed to her calling: “I just feel such a sense of obligation, especially from a Christian perspective, to be the Good Samaritan, and hopefully get people to band together and still wear their mask and get a vaccine.”\n\nJamie Aten is executive director of the Humanitarian Disaster Institute at Wheaton College. In his work, he has helped his fellow evangelicals deal with hurricanes, floods, tornadoes, and other disasters. His ministry has been widely received with gratitude.\n\nWhen he began urging his fellow evangelicals to get vaccinated against COVID-19, however, some of the responses he received were ugly. He even had to file a report with the sheriff’s office where he lives after getting an email claiming his work on vaccines was “punishable by death.”\n\nC. S. Lewis observed that “courage is not simply one of the virtues, but the form of every virtue at the testing point.”\n\nA new policy in China went into effect last Saturday. It requires all clergy and religious leaders in China to “support the leadership of the Communist Party of China, support the socialist system,” and “practice the core values of socialism” while adhering to the “autonomous management of religion.” As a result of this policy, Chinese Communist officials removed Bible apps and public Christian WeChat accounts. Bibles in hard copy are no longer available for sale online.\n\nCommunist authorities recently closed Catholic Church-run children’s homes and orphanages and have ordered Christians to fly the Chinese flag and sing patriotic songs in their services. A recent publication includes China among sixty-two countries, comprising two-thirds of the world’s population, that violate religious freedom.\n\nFinland is not on the list, but a member of its parliament is facing six years imprisonment for allegedly committing three crimes, including “hate speech.” A medical doctor and the mother of five, she has publicly voiced her opinion defending biblical sexual morality. One of her “crimes” was quoting Romans 1:24 So God abandoned them to do whatever shameful things their hearts desired. As a result, they did vile and degrading things with each other's bodies. OPEN VERSE IN BIBLE (nlt) –27, a tweet for which she was accused of hate speech and interrogated by the police.\n\n“I will not back down from my views,” she said. “I will not be intimidated into hiding my faith. The more Christians keep silent on controversial themes, the narrower the space for freedom of speech gets.”\n\n“God’s story, my story, and their story”\n\nJacob Bland is the new president and CEO of Youth for Christ, a ministry that began in 1944 when Billy Graham served as its first full-time staff member. Today, it operates in over one hundred nations and has more than 160 chapters across the US. Bland explained his organization’s strategy in a way I found compelling: “The way we look at it, there are three stories that are overlapping: God’s story, my story, and their story.”\n\nTo advance God’s kingdom, we learn the stories of those who need Jesus, then we share his story by showing how he has changed our story and can change their story.\n\nIn a recent Daily Article, I described the urgency of defending biblical morality in an increasingly antagonistic culture. I also noted the importance of living the truth we proclaim, knowing that our lives must be the first sermon we preach.\n\nHow can we be the change we wish to see? Paul’s letter to a church in an antagonistic culture offers us clear and compelling guidance.\n\nWhen Paul came to the Greek city of Thessalonica, a mob responded to the gospel by attacking followers of Jesus ( Acts 17:1 Paul and Silas then traveled through the towns of Amphipolis and Apollonia and came to Thessalonica, where there was a Jewish synagogue. OPEN VERSE IN BIBLE (nlt) –10). Nonetheless, the apostle encouraged Thessalonian Christians to “stand firm and hold to the traditions that you were taught by us” ( 2 Thessalonians 2:15 With all these things in mind, dear brothers and sisters, stand firm and keep a strong grip on the teaching we passed on to you both in person and by letter. OPEN VERSE IN BIBLE (nlt) ). He reminded them that their salvation came “through sanctification by the Spirit and belief in the truth” (v. 13), that divine-human partnership by which we accept God’s word as true and the Spirit uses that truth to transform our lives.\n\nThe basis for our salvation is “our Lord Jesus Christ himself, and God our Father, who loved us and gave us eternal comfort and good hope through grace” (v. 16). Paul could therefore pray for the Lord to “comfort your hearts and establish them in every good work and word” (v. 17).\n\nThis passage calls us to four simple commitments that are transforming for us and our influence:\n\nOne: Remember that God is love ( 1 John 4:8 But anyone who does not love does not know God, for God is love. OPEN VERSE IN BIBLE (nlt) ). Because he “loved us” in the past, he has given us “good hope through grace” for the present and “eternal comfort” for the future. No matter who you are or where you are, God loves you.\n\nTwo: Believe God’s word is truth ( John 17:17 Make them holy by your truth; teach them your word, which is truth. OPEN VERSE IN BIBLE (nlt) ). What the Bible says about sexuality or any other issue we face is the unchanging, life-giving truth of God.\n\nThree: Submit to the sanctification of the Spirit ( Ephesians 5:18 Don't be drunk with wine, because that will ruin your life. Instead, be filled with the Holy Spirit, OPEN VERSE IN BIBLE (nlt) ; 1 Peter 1:2 God the Father knew you and chose you long ago, and his Spirit has made you holy. As a result, you have obeyed him and have been cleansed by the blood of Jesus Christ. May God give you more and more grace and peace. OPEN VERSE IN BIBLE (nlt) ). He alone can make us like Jesus ( Romans 8:29 For God knew his people in advance, and he chose them to become like his Son, so that his Son would be the firstborn* among many brothers and sisters. OPEN VERSE IN BIBLE (nlt) ), transforming us into the kind of people whose lives will draw the world to our Lord.\n\nFour: Stand firm for your Lord ( 1 Corinthians 15:58 So, my dear brothers and sisters, be strong and immovable. Always work enthusiastically for the Lord, for you know that nothing you do for the Lord is ever useless. OPEN VERSE IN BIBLE (nlt) ; 16:13). The greater the opposition to Jesus, the greater the opportunity for courage that glorifies our Lord.\n\nAs we choose to follow Jesus with courage, it is vital to remember that we need God’s grace just as much as anyone who rejects God’s grace. The other day, I was driving home from the office and heard a powerful song by Sidewalk Prophets on the radio. Titled “You Love Me Anyway,” it includes these lyrics:\n\nI am the thorn in your crown\n\nBut you love me anyway\n\nI am the sweat from your brow\n\nBut you love me anyway\n\nI am the nail in your wrist\n\nBut you love me anyway\n\nI am Judas’ kiss\n\nBut you love me anyway\n\nWill you celebrate and share this love today?\n\n******\n\nDr. Jim Denison is the founder of the Denison Forum. His Daily Article reaches 1.5 million people monthly with subscribers in 226 countries, and exists to engage contemporary culture with biblical truth. To subscribe to his Daily Article, go to DenisonForum.org.", "opengraph": {"site_name": "CBN", "type": "article", "url": "https://www2.cbn.com/article/not-selected/pastors-wife-advocates-vaccines-and-receives-death-threats-call-courage", "title": "Pastor’s Wife Advocates for Vaccines and Receives Death Threats: A Call to Courage That Glorifies Jesus", "description": "Emily Smith is an epidemiologist at Baylor University, the wife of a Baptist pastor, and a mother.", "image": "https://www2.cbn.com/sites/default/files/media/slider/images/covidvaccines_si_1.jpg", "updated_time": "2023-01-15T17:39:28-0500", "article:section": "CBN | Articles", "article:tag": "Not Selected"}, "tags": [], "tweets": [], "movies": [], "links": ["http://bible.cbn.com/#!/bible/nlt/45/1/24-27", "http://bible.cbn.com/#!/bible/nlt/45/1/24", "http://bible.cbn.com/#!/bible/nlt/44/17/1-10", "http://bible.cbn.com/#!/bible/nlt/44/17/1", "http://bible.cbn.com/#!/bible/nlt/53/2/15", "http://bible.cbn.com/#!/bible/nlt/53/2/15", "http://bible.cbn.com/#!/bible/nlt/62/4/8", "http://bible.cbn.com/#!/bible/nlt/62/4/8", "http://bible.cbn.com/#!/bible/nlt/43/17/17", "http://bible.cbn.com/#!/bible/nlt/43/17/17", "http://bible.cbn.com/#!/bible/nlt/49/5/18", "http://bible.cbn.com/#!/bible/nlt/49/5/18", "http://bible.cbn.com/#!/bible/nlt/60/1/2", "http://bible.cbn.com/#!/bible/nlt/60/1/2", "http://bible.cbn.com/#!/bible/nlt/45/8/29", "http://bible.cbn.com/#!/bible/nlt/45/8/29", "http://bible.cbn.com/#!/bible/nlt/46/15/58", "http://bible.cbn.com/#!/bible/nlt/46/15/58", "http://bible.cbn.com/#!/bible/nlt/46/16/13", "http://www.denisonforum.org/?utm_source=CBN&utm_medium=CBN&utm_campaign=CBN"], "authors": [], "publish_date": null}