{"result_id": "065046", "URL": "https://www2.cbn.com/news/health/cdc-fda-downplay-safety-signal-flagged-covid-vaccine-stroke-risk", "timestamp": "2023-04-25 14:41:06 CEST+0200", "meta": {"description": "The Centers for Disease Control and Prevention (CDC) and the Food and Drug Administration (FDA) have announced a safety", "lang": "en", "keywords": "", "favicon": "/themes/custom/cbn_emulsify/favicon.ico", "canonical": "https://www2.cbn.com/news/health/cdc-fda-downplay-safety-signal-flagged-covid-vaccine-stroke-risk", "encoding": "utf-8"}, "image": null, "domain": "www2.cbn.com", "title": "CDC, FDA Downplay 'Safety Signal' that Flagged COVID Vaccine Stroke Risk", "cleaned_text": "The Centers for Disease Control and Prevention (CDC) and the Food and Drug Administration (FDA) have announced a safety monitoring system that has flagged a concern for ischemic stroke in people ages 65 and older who received the Pfizer-BioNTech COVID-19 Vaccine, Bivalent.\n\nThat bivalent version of the vaccine covers two strains of COVID-19 – the original virus strain as well as the omicron variant.\n\nReuters reports a CDC vaccine database had uncovered a possible safety issue in which people 65 and older were more likely to have an ischemic stroke 21 days after receiving the Pfizer/BioNTech bivalent shot, compared with days 22-44.\n\nAccording to the Mayo Clinic, an ischemic stroke occurs when the blood supply to part of the brain is interrupted or reduced, preventing brain tissue from getting oxygen and nutrients.\n\nThe CDC and the FDA said the preliminary signal had not been identified with the Moderna COVID-19 Vaccine, Bivalent.\n\nThe U.S. health agencies suggested there may be other factors contributing to the signal identified in the CDC's Vaccine Safety Datalink (VSD), a near real-time surveillance system, that merit further investigation.\n\nThe agencies said it is important to note that no other safety systems have shown a similar signal and multiple subsequent analyses have not validated this signal. The safety systems include other large studies, CDC's Vaccine Adverse Event Reporting System, other countries' reporting systems, and Pfizer-BioNTech's databases.\n\nThe health authorities also noted the reason they made the information public.\n\n\"Although the totality of the data currently suggests that it is very unlikely that the signal in VSD represents a true clinical risk, we believe it is important to share this information with the public, as we have in the past when one of our safety monitoring systems detects a signal,\" the CDC and FDA said.\n\nIn a statement to Fox News, a spokesperson for Pfizer said, \"Pfizer and BioNTech have been made aware of limited reports of ischemic stroke that have been observed in the CDC Vaccine Safety DataLink (VSD) database in people 65 and older following vaccination with the Omicron BA.4/BA.5-adapted bivalent COVID-19 Vaccine by Pfizer and BioNTech.\"\n\n\"Neither Pfizer and BioNTech nor the CDC or the U.S. Food and Drug Administration (FDA) have observed similar findings across numerous other monitoring systems in the U.S. and globally and there is no evidence to conclude that ischemic stroke is associated with the use of the companies' COVID-19 vaccines,\" the spokesperson contends.\n\nFox News medical contributor Dr. Mark Siegel told the outlet this does not prove there's a link between the vaccine and strokes in seniors. \"This is not proof. This is that they see there may be a link here, and they want to investigate it, and they're trying to be transparent,\" he said.\n\nThe CDC is not changing its stance on recommending COVID-19 vaccinations for everyone.\n\n***Please sign up for CBN Newsletters and download the CBN News app to ensure you keep receiving the latest news from a distinctly Christian perspective.***", "opengraph": {"site_name": "CBN", "type": "article", "url": "https://www2.cbn.com/news/health/cdc-fda-downplay-safety-signal-flagged-covid-vaccine-stroke-risk", "title": "CDC, FDA Downplay 'Safety Signal' that Flagged COVID Vaccine Stroke Risk", "description": "The Centers for Disease Control and Prevention (CDC) and the Food and Drug Administration (FDA) have announced a safety", "image": "https://www2.cbn.com/sites/default/files/media/standard/images/ap21159373552295.jpg", "updated_time": "2023-01-17T16:45:35-0500", "article:section": "CBN | News", "article:tag": "CBN News", "article:published_time": "2023-01-17T15:45:09-0500", "article:modified_time": "2023-01-17T16:45:35-0500"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.reuters.com/business/healthcare-pharmaceuticals/us-says-pfizers-bivalent-covid-shot-may-be-linked-stroke-older-adults-2023-", "https://www.mayoclinic.org/diseases-conditions/stroke/symptoms-causes/syc-20350113#:~:text=An%20ischemic%20stroke%20occurs%20when,brain%20damage%20and%20other%20complications.", "https://www1.cbn.com/cbnnews/quickstart", "https://www.foxnews.com/health/cdc-identifies-possible-safety-concern-certain-people-receiving-covid-vaccines", "https://www1.cbn.com/cbnnews/email-forms", "https://www1.cbn.com/cbn-apps#cbn-news", "https://www1.cbn.com/cbn-apps#cbn-news"], "authors": [], "publish_date": "2023-01-17T15:45:09-0500"}