{"result_id": "065054", "URL": "https://www2.cbn.com/news/us/what-communists-did-bidens-vaccine-mandate-means-more-misery-millions-americans", "timestamp": "2023-04-25 14:41:21 CEST+0200", "meta": {"description": "66 million Americans remain unvaccinated, and those on the job now face the prospect of unemployment and economic ruin. Companies are reportedly nervous about worker shortages while city governments scramble to protect their citizens after firing police, and other first responders, placing them on unpaid leave or seeing them resign.", "lang": "en", "keywords": "vaccine, mandate, unvaccinated, unemployment, fired, quit, economic ruin, companies, private employers, state, city, governments, citizens, fire, police, rescue, first responders, resign, resignations, Joe Biden, Americans, America, military, service members, CBN News, CBNNews.com, CBN News YouTube, Dale Hurd", "favicon": "/themes/custom/cbn_emulsify/favicon.ico", "canonical": "https://www2.cbn.com/news/us/what-communists-did-bidens-vaccine-mandate-means-more-misery-millions-americans", "encoding": "utf-8"}, "image": null, "domain": "www2.cbn.com", "title": "'This Is What the Communists Did': Biden's Vaccine Mandate Means More Misery for Millions of Americans", "cleaned_text": "'This Is What the Communists Did': Biden's Vaccine Mandate Means More Misery for Millions of Americans\n\nSixty-six million Americans remain unvaccinated, and those on the job now face the prospect of unemployment and economic ruin. Companies are reportedly nervous about worker shortages while city governments scramble to protect their citizens after firing police, and other first responders, placing them on unpaid leave or seeing them resign.\n\nAs one Seattle Police officer put it, \"I love what I do and now I'm put in a situation where I have to either go against my sincerely held beliefs, my faith, and what I believe in.\"\n\nJoe Biden's vaccine mandate, however well-intentioned it may be, threatens to create even more suffering and misery in what has already been a very tough year.\n\nForty percent of TSA employees have yet to meet the deadline to be fully vaccinated which hits just before Thanksgiving. That's a recipe for holiday travel chaos.\n\nAirline Travel Expert Henry Harteveldt says, \"The fact that 40 percent of TSA employees are not vaccinated. Something's going to have to give. I'm really worried.\"\n\nAlso facing termination: many airline pilots, teachers, doctors, nurses, and military service members.\n\n\"I'm asking everyone, everyone who hasn't gotten vaccinated, please get vaccinated, Biden pleaded with the nation, \"That's how we put this pandemic behind us and accelerate our economic recovery.\"\n\nREAD 'We Have No King but King Jesus': 101 Ohio Pastors Push Back Against Vaccine Mandate in Open Letter to Biden\n\nBut outgoing NIH Director Dr. Francis Collins admits officials underestimated opposition to the vaccine.\n\n\"I wish we had seen that coming and come up with some kind of a myth-buster approach,\" Collins told MSNBC, \"To try to block all of the misinformation and disinformation that has gotten out there, all tangled up with politics and which is costing lives.\"\n\nFor One Christian, There Was Never a Choice on the Vaccine\n\nBut those who believe the vaccine is unsafe or morally wrong say there wasn't ever really a choice.\n\n\"There really was no decision for me. There was no way I was going to put it in my body, said Beth Faber, a producer at ESPN Radio for 29 years. Faber covered college football championship games, the NBA, and Major League Baseball.\n\nA Christian, Faber was fired for refusing to be vaccinated.\n\n\"And once I knew what was in it, I knew that I would be sinning and there was no way I could inject it in my body,\" Faber said, \"So they just let me go, salary over, no benefits, no severance, after 29 years.\n\nESPN says by not getting vaccinated, Faber chose to voluntarily separate from the company. A single mom with two kids in college as she homeschools her youngest, Faber choked back tears as she explained how the financial hardship hit after just recently losing her father.\n\n\"Everything's been, everything's been a little rough,\" she said.\n\n'This is What the Communists Did'\n\nDr. Jaroslav Flidr is a physicist and cyber security expert who was fired by George Washington University for refusing to be vaccinated. Flidr grew up in communist Czechoslovakia and was a student leader during Czechoslovakia's Velvet Revolution. He says the vaccine mandate is the sort of thing a communist government would do.\n\n\"This is exactly what the communists did in the old olden days. That is how they rolled. And so, when I saw (the school's demand to be vaccinated), I was quite surprised, and I thought, 'No way, absolutely no way I would actually comply with this.' They couldn't force me to take an aspirin pill doing it this way.\"\n\n\"You want the fire me, fire me,\" Flidr said.\n\nBased on his experience under communism, Flidr believes that when citizens submit to government orders like the vaccine mandate, it only encourages governments to do it again. Flidr said, \"For me, there was this message, you know, 'We own you and we will make you do whatever we want.'\"\n\n\"He said to himself, 'No, you're not going to do anything to me. And I don't care what the cost is.'\"\n\nLawyer: The Mandate is \"Reprehensible, Un-American, Unconstitutional, and Illegal\"\n\nTony Perkins of the Family Research Council calls the vaccine mandate \"a massive overreach by the federal government.\"\n\n\"And look, I am not against the vaccine,\" Perkins said, \"In fact, I've encouraged people who are in high-risk categories that they need to talk with their medical provider and make that decision which is best for them. So, I'm not anti-vaccine at all, but I am antigovernment mandate.\"\n\nREAD Resistance to Vaccine Mandates Grows Among Police Forces Across USA: 'This is About Saving Jobs'\n\nSome states are fighting back with new laws blocking the federal mandate. Liberty Counsel has filed a class-action lawsuit and temporary injunction against the white house and all five branches of the military to stop it.\n\nMat Staver of Liberty Counsel calls the vaccine mandate, \"…reprehensible. It's un-American, it's unconstitutional, it's illegal to force individuals, particularly our healthcare working heroes against their will, and that is just despicable.\"\n\nStill, many legal experts believe the government will win. And if the mandate isn't blocked, millions of Americans not only face unemployment but the possibility that unemployment benefits could be blocked as well.\n\n***Please sign up for CBN Newsletters and download the CBN News app to ensure you keep receiving the latest news from a distinctly Christian perspective.***", "opengraph": {"site_name": "CBN", "type": "article", "url": "https://www2.cbn.com/news/us/what-communists-did-bidens-vaccine-mandate-means-more-misery-millions-americans", "title": "'This Is What the Communists Did': Biden's Vaccine Mandate Means More Misery for Millions of Americans", "description": "66 million Americans remain unvaccinated, and those on the job now face the prospect of unemployment and economic ruin. Companies are reportedly nervous about worker shortages while city governments scramble to protect their citizens after firing police, and other first responders, placing them on unpaid leave or seeing them resign.  ", "image": "https://www2.cbn.com/sites/default/files/brightcove/videos/images/thumbnails/_v1_jit_734546207001_1b5be06a-d965-485f-8de2-c114d04ddc29_main_1280x720_2m37s77ms_match_image.jpg", "updated_time": "2022-12-10T13:45:24-0500", "article:section": "CBN | News", "article:tag": "Not Selected", "article:published_time": "2021-10-20T18:45:00-0400", "article:modified_time": "2022-12-10T13:45:24-0500"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www1.cbn.com/cbnnews/us/2021/september/united-airlines-putting-staff-granted-religious-exemptions-from-vaccine-on-indefinite-unpaid-leave", "https://www1.cbn.com/cbnnews/us/2021/october/battle-over-vaccine-mandates-heats-up-across-the-nation", "https://www1.cbn.com/cbnnews/us/2021/september/vaccine-mandates-lead-to-mass-firings-and-mass-walkouts-from-state-troopers-to-hospital-workers", "https://www1.cbn.com/cbnnews/2021/october/coercion-bullying-censorship-military-service-members-and-govt-contractors-sue-to-block-bidens-dod-vax-mandates", "https://www1.cbn.com/cbnnews/us/2021/october/we-have-no-king-but-king-jesus-101-ohio-pastors-push-back-against-vaccine-mandate-in-open-letter-to-biden", "https://www1.cbn.com/cbnnews/us/2021/october/this-is-about-saving-jobs-resistance-to-vaccine-mandates-grows-among-public-and-private-employees-across-america", "https://www1.cbn.com/cbnnews/email-forms", "https://www1.cbn.com/cbn-apps#cbn-news", "https://www1.cbn.com/cbn-apps#cbn-news"], "authors": [], "publish_date": "2021-10-20T18:45:00-0400"}