{"result_id": "065055", "URL": "https://www2.cbn.com/news/news/cdc-recommends-nursing-home-residents-health-care-workers-get-vaccines-first", "timestamp": "2023-04-25 14:41:23 CEST+0200", "meta": {"description": "Health care workers and nursing home residents should be at the front of the line when the first coronavirus vaccine shots become available, an influential government advisory panel said Tuesday.", "lang": "en", "keywords": "cbnnewsyoutube, CBN News, Covid-19, CDC, Vaccine, Pfizer, Moderna, BioNTech, nursing homes, health care workers, hospitals, pandemic, coronavirus", "favicon": "/themes/custom/cbn_emulsify/favicon.ico", "canonical": "https://www2.cbn.com/news/news/cdc-recommends-nursing-home-residents-health-care-workers-get-vaccines-first", "encoding": "utf-8"}, "image": null, "domain": "www2.cbn.com", "title": "CDC Recommends Nursing Home Residents, Health Care Workers Get Vaccines First", "cleaned_text": "An independent panel of advisors for the Centers for Disease Control and Prevention voted Tuesday that the first doses of the coronavirus vaccine should go to at risk seniors and frontline healthcare workers.\n\n\"In discussions with the jurisdictions, most of them believe that they can vaccinate, all of their health care workers within three weeks,\" said Nancy Messonier, director of the National Center for Immunization and Respiratory Diseases at the Centers for Disease Control and Prevention.\n\nThe panel voted 13 to one to recommend those groups get priority in the first days of any vaccine when doses are expected to be very limited.\n\nIt includes 21 million health care workers who work in hospitals, pharmacies, and clinics, and about 3 million highest risk seniors and their caregivers in long term care facilities, where 40 percent of all coronavirus deaths in America take place.\n\n\"We have plans that will start with all 37 Chicago hospitals receiving vaccine for health care workers--not yet for patients,\" said Dr. Allison Arwady, commissioner of Chicago Department of Health. \"And we have plans for all 128 long term care facilities in Chicago.\"\n\nExperts say getting the vaccine out soon will have a huge impact.\n\n\"If we can hold together as a country, and in the next 60 days, vaccinate all of these residents, we can cut the death rate almost in half,\" said Mark Parkinson, CEO of American Health Care Association.\n\nWhile the Food and Drug Administration has yet to approve vaccines for emergency use, it says it is moving as fast as possible. The Pfizer vaccine could get a green light after a meeting next week and Moderna's one week after that.\n\n \n\n \"No one at FDA is sitting on his hands or her hands explained FDA Commissioner Dr. Stephen Hahn. \"Everybody's working really hard to look at these applications and get this done.\"\n\nPresident Trump's coronavirus vaccine czar said Tuesday that Pfizer's and Moderna's COVID-19 vaccines are safe with only 10 to 15 percent of volunteers reporting significantly noticeable side effects.\n\nThe president is set to host a vaccine summit with manufacturers, distributors, and government officials at the White House next week.\n\nThe CDC also says new information reveals that the virus was in the US earlier than previously thought. Scientists say that an analysis of blood donations shows some Americans were infected in mid-December.\n\nNearly 100,000 Americans are now hospitalized, a new milestone amid a nationwide surge in cases.\n\nCalifornia Gov. Gavin Newsom (D) is warning that ICU's in Los Angeles could reach 112 percent capacity by Christmas Eve.\n\n\"If these trends continue, we're going to have to take much more dramatic, arguably drastic action,\" said Newsom.\n\nHealth and Human Services Secretary Alex Azar issued an appeal Wednesday urging those who have recovered from COVID to donate blood plasma in order to help others fight off the disease.\n\nMeanwhile, drug makers Pfizer and BioNTech have won permission for the emergency use of their COVID-19 vaccine in Britain.\n\nSTAY UP TO DATE WITH THE FREE CBN NEWS APP \n\nClick Here Get the App with Special Alerts on Breaking News and Top Stories", "opengraph": {"site_name": "CBN", "type": "article", "url": "https://www2.cbn.com/news/news/cdc-recommends-nursing-home-residents-health-care-workers-get-vaccines-first", "title": "CDC Recommends Nursing Home Residents, Health Care Workers Get Vaccines First", "description": "Health care workers and nursing home residents should be at the front of the line when the first coronavirus vaccine shots become available, an influential government advisory panel said Tuesday.", "image": "https://www2.cbn.com/sites/default/files/brightcove/videos/images/thumbnails/_v1_static_734546207001_544282fe-1bc3-4481-bdd9-7111ceccd2c5_483f110d-4186-4df0-a085-11ede6d16791_1920x1080_match_image.jpg", "updated_time": "2022-12-10T13:45:24-0500", "article:section": "CBN | News", "article:tag": "Not Selected", "article:published_time": "2020-12-02T12:30:00-0500", "article:modified_time": "2022-12-10T13:45:24-0500"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.cbn.com/news/app/"], "authors": [], "publish_date": "2020-12-02T12:30:00-0500"}