{"result_id": "065036", "URL": "https://www2.cbn.com/news/news/israel-faces-misinformation-legal-questions-fight-vaccinate-population", "timestamp": "2023-04-25 14:40:40 CEST+0200", "meta": {"description": "Israel is a world leader in vaccinations although the pace of Israelis getting their shots has slowed down. While government leaders work to vaccinate greater numbers of people, they face obstacles in the form of misinformation, public health and personal privacy.", "lang": "en", "keywords": "Israel, vaccine, leader, freedom, safety, health, government, CBN News, cbnnews.com", "favicon": "/themes/custom/cbn_emulsify/favicon.ico", "canonical": "https://www2.cbn.com/news/news/israel-faces-misinformation-legal-questions-fight-vaccinate-population", "encoding": "utf-8"}, "image": null, "domain": "www2.cbn.com", "title": "Israel Faces Misinformation, Legal Questions in Fight to Vaccinate Population", "cleaned_text": "JERUSALEM - Israel is a world leader in vaccinations although the pace of Israelis getting their shots has slowed down. While government leaders work to vaccinate greater numbers of people, they face obstacles in the form of misinformation, public health, and personal privacy.\n\nIsrael recently celebrated the 4 millionth Israeli to get their first vaccination shot. Out of that four million, nearly three million have had both shots. That's quite an accomplishment for a country of just over nine million citizens. Israel has seen more than 700,000 COVID-19 cases and 5400 deaths.\n\nIsraeli Prime Minister Benjamin Netanyahu worries misinformation is keeping many Israelis from lining up for the shot.\n\n\"The only thing that currently prevents the completion of this (vaccination) process is fake news and the superstitious and sometimes malicious beliefs that are planted (among) the public and on the internet and other places. Don't believe them,\" said Netanyahu.\n\nIn an effort to increase numbers, Netanyahu wants legislation that would provide the names of those not vaccinated to local governments. Health Minister Yuli Edelstein advocates allowing employers to prevent unvaccinated citizens from coming to work.\n\nThey face major pushback as so-called anti-vaxxers use posters and the web to spread messages like \"You're experimented on like lab rats. The vaccine is a death shot.\" Or one poster which reads, \"False information and lies endanger us.\"\n\n\"People in the emergency fake newsroom, they are monitoring the social media,\" said Einav Shimron, Israeli Health Ministry's Deputy Director for Information And International Relations.\n\n\"The moment they see fake news, they transfer the information to the cyber department in the Ministry of Justice, and they transfer a request to the social media. There are several times we even call the police against the rumor that puts in great risk the population in Israel because they convince people to avoid the vaccine.\"\n\nWhile the government is monitoring and censoring social media, a number of Israelis remain convinced the vaccinations are not safe.\n\n\"This whole thing, it's research, an experiment, with unknown side effects,\" said Avishai Matia, a personal coach, and anti-vaccine activist. \"It's not like taking today a measles or flu vaccine. This is totally new drug, new technology. No one knows what will become of it and what will happen with it. I think that anyone taking the vaccine today is simply gambling with their own life.\"\n\nOn Sunday, the government will enforce new regulations stopping the unvaccinated from using gyms, attending sporting events, or going to a hotel. Israelis completing the two-step vaccination process will be issued a new \"green passport\" that will permit them access to those same venues.\n\n\"This has raised a bit of a dilemma, which is how should society, how should the government relate to people who have not been inoculated or vaccinated or who refuse to do so,\" said columnist and commentator Michael Freund.\n\nFreund says the growing fight over public health versus individual privacy and freedom could soon boil over.\n\n\"On the one hand, you have the government's responsibility to ensure the safety and well-being of the public and its health which is of paramount importance. On the other hand, you have the government's responsibility to ensure the basic freedoms and civil liberties of the people,\" he explained.\n\n\"Israel becomes one of the world's first democracies to reach this stage in the pandemic fight,\" Freund continued. \"What's more important? Protecting public safety with strict vaccination measures or preserving the beliefs, rights, and freedoms of its citizens?\"\n\n***Be sure to sign up for CBN News emails and the CBN News app to ensure you keep receiving news from a Christian Perspective.***", "opengraph": {"site_name": "CBN", "type": "article", "url": "https://www2.cbn.com/news/news/israel-faces-misinformation-legal-questions-fight-vaccinate-population", "title": "Israel Faces Misinformation, Legal Questions in Fight to Vaccinate Population ", "description": "Israel is a world leader in vaccinations although the pace of Israelis getting their shots has slowed down. While government leaders work to vaccinate greater numbers of people, they face obstacles in the form of misinformation, public health and personal privacy. ", "image": "https://www2.cbn.com/sites/default/files/brightcove/videos/images/thumbnails/_v1_jit_734546207001_8d6dc518-9bb6-4110-b69b-315c5d763250_main_1280x720_1m32s822ms_match_image.jpg", "updated_time": "2022-12-10T13:45:24-0500", "article:section": "CBN | News", "article:tag": "Not Selected", "article:published_time": "2021-02-19T08:15:00-0500", "article:modified_time": "2022-12-10T13:45:24-0500"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www1.cbn.com/cbnnews/email-forms", "https://www1.cbn.com/cbn-apps#cbn-news"], "authors": [], "publish_date": "2021-02-19T08:15:00-0500"}