{"result_id": "065031", "URL": "https://www2.cbn.com/news/politics/hes-crossed-line-bidens-private-sector-vaccine-mandate-now-its-way-after-long-delay", "timestamp": "2023-04-25 14:40:28 CEST+0200", "meta": {"description": "COVID-19 cases in the US are down by nearly 50 percent, hospitalizations are down about 40 percent, but President Biden's next round of vaccine mandates are still coming. And now as we head into the winter months, the government is close to recommending more Americans get booster shots.", "lang": "en", "keywords": "Covid, Covid 19, coronavirus, vaccine, vaccine mandate, Joe Biden, White House, president, Ohio, private companies, Jennifer Wishon, JWI1062", "favicon": "/themes/custom/cbn_emulsify/favicon.ico", "canonical": "https://www2.cbn.com/news/politics/hes-crossed-line-bidens-private-sector-vaccine-mandate-now-its-way-after-long-delay", "encoding": "utf-8"}, "image": null, "domain": "www2.cbn.com", "title": "He's 'Crossed a Line': Biden's Private Sector Vaccine Mandate Is Now on Its Way After a Long Delay", "cleaned_text": "WASHINGTON – COVID-19 cases in the US are down by nearly 50 percent, hospitalizations are down about 40 percent, but President Biden's next round of vaccine mandates are still coming. And now as we head into the winter months, the government is close to recommending more Americans get booster shots.\n\n \n\n An FDA panel voted unanimously in favor of recommending a third shot for the Moderna vaccine. It would be a half dose given at least six months after the second shot to seniors and Americans at high risk. The full FDA still has to approve it.\n\n \n\n Many Americans who got the Pfizer vaccine at least six months ago are already getting their booster shots and the application process for a Johnson & Johnson booster is underway.\n\nREAD 'We Have No King but King Jesus': 101 Ohio Pastors Push Back Against Vaccine Mandate in Open Letter to Biden\n\nThe FDA panel stressed there's no evidence it's necessary to open booster shots to everyone despite the Biden administration's attempts to do so. Meanwhile, in a brief address in which he took no questions from reporters, the president announced his private-sector vaccine mandate will soon take effect.\n\n \n\n \"The Labor Department is going to soon be issuing an emergency rule for companies with 100 or more employees to implement vaccination requirements in their — among their workforce,\" the president said.\n\nThose employees will have to get the vaccine or submit to regular COVID testing. It's an effort by the government to force shots into the arms of the 66 million Americans who remain unvaccinated.\n\n \n\n \"Let's be clear: Vaccination requirements should not be another issue that divides us,\" the president said.\n\nBut critics say his vaccine mandates will only divide us. The Republican National Committee has said it's suing over the private-sector mandate. Texas Gov. Greg Abbott this week signed an executive order he says nullifies the federal mandate for businesses in the Lone Star State, and at least 24 attorneys general have announced they'll sue over the mandate.\n\n \n\n Also, according to Front Lines Ohio, a group of Ohio clergy representing 100 churches sent a letter to Biden pointing out his promise as president-elect not to issue a vaccine mandate and the group says he's now \"crossed a line.\"\n\n\"The people should have the ability to make their own health decisions,\" the letter reads.\n\nIn the next few weeks, the federal government's Food & Drug Administration will determine whether the COVID vaccine is authorized for children ages 5-11. But the federal government has already purchased enough doses for that age group in advance.\n\n**Please sign up for CBN Newsletters and download the CBN News app to ensure you keep receiving the latest news from a distinctly Christian perspective.***", "opengraph": {"site_name": "CBN", "type": "article", "url": "https://www2.cbn.com/news/politics/hes-crossed-line-bidens-private-sector-vaccine-mandate-now-its-way-after-long-delay", "title": "He's 'Crossed a Line': Biden's Private Sector Vaccine Mandate Is Now on Its Way After a Long Delay", "description": "COVID-19 cases in the US are down by nearly 50 percent, hospitalizations are down about 40 percent, but President Biden's next round of vaccine mandates are still coming. And now as we head into the winter months, the government is close to recommending more Americans get booster shots.", "image": "https://www2.cbn.com/sites/default/files/brightcove/videos/images/thumbnails/_v1_jit_734546207001_86a1a26f-016a-4849-b401-40617dc4f3c9_main_1280x720_1m16s45ms_match_image.jpg", "updated_time": "2022-12-10T13:45:24-0500", "article:section": "CBN | News", "article:tag": "Not Selected", "article:published_time": "2021-10-15T14:00:00-0400", "article:modified_time": "2022-12-10T13:45:24-0500"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www1.cbn.com/cbnnews/us/2021/october/we-have-no-king-but-king-jesus-101-ohio-pastors-push-back-against-vaccine-mandate-in-open-letter-to-biden", "https://frontlinesohio.com/wp-content/uploads/2021/10/BIDENVACCINEMANDATERESPONSE101021-1.pdf", "https://www1.cbn.com/cbnnews/email-forms", "https://www1.cbn.com/cbn-apps#cbn-news", "https://www1.cbn.com/cbn-apps#cbn-news"], "authors": [], "publish_date": "2021-10-15T14:00:00-0400"}