{"result_id": "065022", "URL": "https://www2.cbn.com/news/news/medical-miracle-coronavirus-vaccine-rollout-begins-week-across-nation", "timestamp": "2023-04-25 14:40:08 CEST+0200", "meta": {"description": "The coronavirus vaccine is being given to high-risk individuals this week.", "lang": "en", "keywords": "Covid-19, Coronavirus, Vaccine, health, healthy, wellness, Pfizer, Lorie Johnson, CBN News, December 2020, cbnnewsyoutube", "favicon": "/themes/custom/cbn_emulsify/favicon.ico", "canonical": "https://www2.cbn.com/news/news/medical-miracle-coronavirus-vaccine-rollout-begins-week-across-nation", "encoding": "utf-8"}, "image": null, "domain": "www2.cbn.com", "title": "'A Medical Miracle': Coronavirus Vaccine Rollout Begins This Week Across the Nation", "cleaned_text": "As COVID-19 deaths continue to mount in the US nearly reaching 300,000, history is being made as millions of Americans are getting their coronavirus vaccinations.\n\nAfter the FDA gave the emergency go-ahead for the Pfizer coronavirus vaccine, the pharmaceutical giant immediately began shipping millions of doses so that those at greatest risk can start getting their shots this week.\n\nThree million doses were transported in freezers keeping the vaccine at the required minus 94 degrees Fahrenheit. President Trump weighed in on the vaccine rollout Saturday.\n\n\"This has been a great, really a medical miracle, they call it a medical miracle,\" he said, \"And it's going to have a tremendous impact. 95 percent effective. We have Moderna coming out next week. We have Johnson and Johnson, a one-shot vaccine coming out, all great companies.\"\n\nThe vaccines are being sent to more than 600 facilities such as nursing homes and health care centers.\n\nRead Pro-Life Researchers Find Majority of 'Operation Warp Speed' Vaccines Not Produced with Abortion-Derived Cells\n\nIn the Midwest, Chicago's Rush University Hospital will vaccinate its 12,000 employees. On the west coast, Cedars-Sinai in Los Angeles was chosen because of their ultra-cold storage freezers and because of the vulnerability of frontline staff.\n\nDr. Sam Torbati, who works in the emergency department at Cedars-Sinai said, \"Healthcare workers, you know, we get it, we have to fight. This is a battle.\"\n\nLikewise, on the east coast, Baltimore's Maryland Medical Center workers in the COVID-19 unites get their shots first.\n\nIt too late for some. 42-year-old Ohio nurse Tawauna Averette gave birth while infected. She died before she could hold her newborn, leaving behind her husband Charles Averette and their seven children.\n\n\"Just take it serious and be careful,\" he said, \"Because this is real and it can strike without warning.\"\n\nThe FDA is expected to approve Moderna's coronavirus vaccine later this week. It will likely be distributed within days. Health and Human Services Secretary Alex Azar said Sunday that he expects all nursing home residents to be vaccinated by Christmas. He also predicted 100 million Americans, or about one-third of the population, to be vaccinated by the end of February.\n\nSTAY UP TO DATE WITH THE FREE CBN NEWS APP \n\nClick Here Get the App with Special Alerts on Breaking News and Top Stories\n\nAfter hospital workers and nursing home residents, the vaccine will probably be offered to others with a high risk of complications and death from the virus. That includes the elderly and people suffering from serious health complications such as heart disease, diabetes, and autoimmune issues.\n\nWhile the nation's most vulnerable populations are the priority, the Pfizer and Moderna vaccines wouldn't be possible without the sacrifice of 70,000 volunteers who took part in testing, such as Ashley Nealy, who was a Pfizer participant.\n\n\"I think everyone's just trying to figure out how they can help in this pandemic,\" she said, \"And for some of us, that was raising our hands to be part of this experimental trial.\"\n\nALSO, READ Will COVID Vaccines Be Safe? Christian Leaders Respond to Anti-Vaccine Theories\n\nUS Army Gen. Gustave Perna of Operation Warp Speed, the Trump administration's vaccine development program, compared the vaccine distribution effort to D-Day, the US-led military offensive that turned the tide in World War II.\n\n\"D-Day was the beginning of the end and that's where we are today,\" Perna said at a news conference. But he added that it would take months of work and \"diligence, courage and strength to eventually achieve victory.\"", "opengraph": {"site_name": "CBN", "type": "article", "url": "https://www2.cbn.com/news/news/medical-miracle-coronavirus-vaccine-rollout-begins-week-across-nation", "title": "'A Medical Miracle': Coronavirus Vaccine Rollout Begins This Week Across the Nation ", "description": "The coronavirus vaccine is being given to high-risk individuals this week.", "image": "https://www2.cbn.com/sites/default/files/brightcove/videos/images/thumbnails/_v1_static_734546207001_b615fac9-1f56-41b9-8c8b-e690def44a1a_d2a5ca60-ee1c-4330-892a-fb344f0a874e_1920x1080_match_image.jpg", "updated_time": "2022-12-10T13:45:24-0500", "article:section": "CBN | News", "article:tag": "Not Selected", "article:published_time": "2020-12-14T15:15:00-0500", "article:modified_time": "2022-12-10T13:45:24-0500"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www1.cbn.com/cbnnews/2020/december/pro-life-researchers-find-majority-of-operation-warp-speed-vaccines-not-produced-with-abortion-derived-cells", "https://www.cbn.com/news/app/", "https://www1.cbn.com/cbnnews/health/2020/december/will-covid-vaccines-be-safe-christian-leaders-respond-to-anti-vaccine-theories"], "authors": [], "publish_date": "2020-12-14T15:15:00-0500"}