{"result_id": "065024", "URL": "https://www2.cbn.com/news/us/being-part-solution-news-anchor-volunteers-covid-vaccine-trial", "timestamp": "2023-04-25 14:40:13 CEST+0200", "meta": {"description": "In this COVID world, a Savannah, Georgia news anchor stepped outside of her comfort zone to help solve the crisis. Dawn Baker became the first volunteer to literally take her shot at a phase three vaccine trial.", "lang": "en", "keywords": "Dawn Baker, Savannah, Georgia, news anchor, COVID, COVID-19, Coronavirus, vaccine, vaccine trial, phase three, shot, shots, volunteer, God, regrets, no regrets, part of the solution, immune system, Tuskegee experiments, CBN News, CBNNews.com, Eric Philips, CBN News YouTube", "favicon": "/themes/custom/cbn_emulsify/favicon.ico", "canonical": "https://www2.cbn.com/news/us/being-part-solution-news-anchor-volunteers-covid-vaccine-trial", "encoding": "utf-8"}, "image": null, "domain": "www2.cbn.com", "title": "Being Part of The Solution: News Anchor Volunteers for COVID Vaccine Trial", "cleaned_text": "In this COVID world, a Savannah, Georgia news anchor stepped outside of her comfort zone to help solve the crisis. Dawn Baker became the first volunteer to literally take her shot at a phase three vaccine trial. Baker says she did not enter this lightly. After extensive research and talks with her doctor, she decided joining this fight was bigger than herself.\n\n\"I feel God in this for me,\" Baker said. \"So, I haven't had any regrets. I've been doing great.\"\n\n \n\n The shot regimen consisted of two doses. The first one back in July, which led to some soreness in her arm and another unexpected but positive reaction.\n\n \n\n \"All the sudden I got a sudden burst of energy,\" Baker said. \"For about six weeks I was just cleaning my house and getting caught up on chores that I had not felt like doing in the past.\"\n\n \n\n The second shot came about a month later.\n\n \n\n \"I had a mild headache that lasted until about 12 o'clock the next morning, but after that, I was back to normal.\"\n\n \n\n Well worth it, Baker adds, to be part of the solution to this deadly problem.\n\n \n\n \"I know three people who have passed away, it hurt even deeper,\" Baker said.\n\n\"Of course there's no cure for COVID-19, just like there's no cure for the flu. But it is going to make it less likely, hopefully, it'll pump up that immune system so that if we were to come in contact with COVID-19, we'd be less likely to get it or if we did get it would be a milder case of it.\"\n\n \n\n The president has promised a vaccine before the end of the year. Baker has her doubts.\n\n\"I don't believe there'll be a vaccine released this year, that sounds like some magical fairy story to me,\" Baker said. \"My prayer is always that we can stay the course, follow all the rules, and somehow get this vaccine to people in a timely manner.\"\n\n \n\n While Baker has received a lot of support for her efforts, she has also faced criticism for putting her health at risk and even trusting the process, especially as an African American. Some have brought up the Tuskegee Syphilis Experiment, a 40-year government study that impacted hundreds of black men.\n\n\"I understand the fear, I know the history,\" Baker explained. \"I know about the Tuskegee Experiment which was absolutely brutal and last 40 years in this country and what's even worse – after they experimented on those black men once the cure came out they wouldn't even give them the cure. I would not have just gone to sign up to do this.\" \n\n \n\n Her doctor of more than 30 years is overseeing trials in her area and asked Baker to take part. \n\n \n\n \"My first question like everybody else was 'is this a live vaccine?' He said no. I said 'well, am I going to be more likely to get COVID-19 if I take this vaccine?' He said no.\"\n\n \n\n \"So would we rather be scared and just worry and talk about losing our loved ones and the fact that we could not go to the funeral or go to the hospital and see them or do we want to be part of fixing the problem,\" Baker questioned. \"I feel that this is how we're going to save our people. And when I say 'our' I mean people of all races.\"\n\n \n\n She's also received push back from anti-vaxxers.\n\n \n\n \"I don't feel like it's my job to change minds or change perceptions that are so deep and so personal because we're all in charge of our own bodies and our own destiny,\" Baker said. \"But I do know that in order for us to get out of this, at least a large percentage of us are going to need to get the vaccine because if we get a handful of us taking a vaccine and the rest of the world isn't, we're still going to be stuck in these masks in order to be safe.\"\n\n \n\n Pointing out that African Americans are among those highest at risk, Baker says the trust in her doctor paired with a divine conviction prompted her to roll up her sleeve.\n\n \n\n \"This girl is on a mission to try and save lives,\" Baker said. \"I am really praying for the whole world.\"\n\n \n\n Baker does not know whether she received the vaccine or a placebo. Over the next two years, she will have seven doctor's appointments and 24 phone calls as physicians monitor and document the status of her health.", "opengraph": {"site_name": "CBN", "type": "article", "url": "https://www2.cbn.com/news/us/being-part-solution-news-anchor-volunteers-covid-vaccine-trial", "title": "Being Part of The Solution: News Anchor Volunteers for COVID Vaccine Trial", "description": "In this COVID world, a Savannah, Georgia news anchor stepped outside of her comfort zone to help solve the crisis. Dawn Baker became the first volunteer to literally take her shot at a phase three vaccine trial.", "image": "https://www2.cbn.com/sites/default/files/brightcove/videos/images/thumbnails/_v1_static_734546207001_13ef2806-e1e8-4b85-9999-83c419c44935_e9758977-2ca3-4572-be60-f559de996ed0_1920x1080_match_image.jpg", "updated_time": "2022-12-10T13:45:24-0500", "article:section": "CBN | News", "article:tag": "Not Selected", "article:published_time": "2020-10-15T18:00:00-0400", "article:modified_time": "2022-12-10T13:45:24-0500"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2020-10-15T18:00:00-0400"}