{"result_id": "065028", "URL": "https://www2.cbn.com/news/news/israeli-lab-reportedly-completes-successful-vaccine-trial-rodents", "timestamp": "2023-04-25 14:40:21 CEST+0200", "meta": {"description": "A laboratory run by Israel’s Defense Ministry has completed a successful coronavirus vaccine trial on rodents, Israel’s Channel 12 reported.", "lang": "en", "keywords": "Israel, Defense, Ministry, coronavirus, vaccine, rodents, Institute, biological, research, CBN News, cbnnews.com", "favicon": "/themes/custom/cbn_emulsify/favicon.ico", "canonical": "https://www2.cbn.com/news/news/israeli-lab-reportedly-completes-successful-vaccine-trial-rodents", "encoding": "utf-8"}, "image": null, "domain": "www2.cbn.com", "title": "Israeli Lab Reportedly Completes Successful Vaccine Trial on Rodents", "cleaned_text": "JERUSALEM, Israel – A laboratory run by Israel’s Defense Ministry has completed a successful coronavirus vaccine trial on rodents, Israel’s Channel 12 reported.\n\nDuring the trials, the Israel Institute for Biological Research split the rodents into two groups – one that received the vaccine and one that did not.\n\nResearchers infected both groups of rodents with the coronavirus. The group that did not receive the vaccine became sick while the vaccinated group remained unharmed, the report said.\n\nThe next stage is testing the vaccine on other animals before moving on to human trials.\n\nResearchers hope to have a coronavirus vaccine completed in a year or less.\n\nEarlier this month, the Institute for Biological Research announced it had isolated an antibody that it claims can neutralize the coronavirus.\n\nThe antibody, which is taken from one’s blood, would not be used to create a vaccine, but a treatment for those already infected with the virus.\n\nNumerous groups of researchers around the world have also said to have found antibodies, but the Israeli lab claims it is the first in the world to isolate an antibody that meets three parameters: specifically targets the virus, destroys the virus, and does not have additional proteins that can cause complications for patients.\n\nThe lab has since identified eight other antibodies to COVID-19 and filed for a patent on the technology, Channel 12 reported.\n\nGlobally, approximately 4.8 million people have been infected by COVID-19 and over 316,000 have died. In Israel, more than 16,600 people have been infected and at least 12,900 have recovered, while 272 have died.", "opengraph": {"site_name": "CBN", "type": "article", "url": "https://www2.cbn.com/news/news/israeli-lab-reportedly-completes-successful-vaccine-trial-rodents", "title": "Israeli Lab Reportedly Completes Successful Vaccine Trial on Rodents", "description": "A laboratory run by Israel’s Defense Ministry has completed a successful coronavirus vaccine trial on rodents, Israel’s Channel 12 reported.", "image": "https://www2.cbn.com/sites/default/files/fluvaccineas_hdv.jpg", "updated_time": "2022-12-10T13:45:24-0500", "article:section": "CBN | News", "article:tag": "Not Selected", "article:published_time": "2020-05-18T12:30:00-0400", "article:modified_time": "2022-12-10T13:45:24-0500"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2020-05-18T12:30:00-0400"}