{"result_id": "065048", "URL": "https://www2.cbn.com/news/news/covid-19-vaccine-mandate-likely-or-legal-why-some-states-and-employers-may-have-right", "timestamp": "2023-04-25 14:41:09 CEST+0200", "meta": {"description": "As the world eagerly awaits the development of a COVID-19 vaccine, the question has come up regarding whether or not the government and employers can mandate that people get vaccinated.", "lang": "en", "keywords": "CBN News, vaccine, COVID-19, pandemic, Healthline, KGTV News, Dov Fox, Dr. William Schaffner, patients, government, employers, mandated, August, 2020", "favicon": "/themes/custom/cbn_emulsify/favicon.ico", "canonical": "https://www2.cbn.com/news/news/covid-19-vaccine-mandate-likely-or-legal-why-some-states-and-employers-may-have-right", "encoding": "utf-8"}, "image": null, "domain": "www2.cbn.com", "title": "Is a COVID-19 Vaccine Mandate Likely or Legal? Why Some States and Employers May Have the Right to Force You", "cleaned_text": "Is a COVID-19 Vaccine Mandate Likely or Legal? Why Some States and Employers May Have the Right to Force You\n\nAs the world eagerly awaits the development of a COVID-19 vaccine, the question has come up regarding whether or not the government and employers can mandate that people get vaccinated.\n\n\n\nVaccine requirements for diseases like tuberculosis and chickenpox have been a standard practice upon starting school, beginning a job, and for student-athletes.\n\nSo why would a vaccine against the coronavirus pandemic be any different?\n\nDov Fox, a law professor and the director of the Center for Health Law Policy and Bioethics at the University of San Diego says COVID-19 presents a similar scenario that could provoke the government to make the vaccine a requirement.\n\n\"States can compel vaccinations in more or less intrusive ways,\" Fox told KGTV. \"They can limit access to schools or services or jobs if people don't get vaccinated. They could force them to pay a fine or even lock them up in jail.\"\n\nFox further explained that states would most likely make an exemption for people with health conditions, like pregnancy, but not for religious purposes.\n\n\"Religious exemptions are not constitutionally required by the First Amendment's Free Exercise clause, provided that the vaccine mandates don't single out religion; they're not motivated by a desire to interfere with it,\" he added.\n\nSTAY UP TO DATE WITH THE FREE CBN NEWS APP \n\nClick Here Get the App with Special Alerts on Breaking News and Top Stories\n\nThe legal rights to enforce a vaccine requirement can be traced back to 1905 in a case that went through the US Supreme Court. In the Jacobson v. Massachusetts case, the court ruled that Massachusetts had the power to fine people who refused vaccination for smallpox.\n\nBut what if the public, who does not fall into the exempt category, chooses not to comply with the state mandate?\n\nFox says the US has never jailed someone for refusing a vaccine, but it's not unheard of. Countries like France have adopted the forceful measure.\n\n\"Courts have found that when medical necessity requires it, the public health outweighs the individual rights and liberties at stake,\" Fox said.\n\nStates that consider a vaccine requirement must ensure that access to the immunization is easily obtainable.\n\n\"Otherwise you create an underclass of people who are less safe and without access to the basic means of society,\" Fox argues.\n\nDr. William Schaffner, an infectious disease expert at Vanderbilt University in Tennessee, told Healthline that medical facilities could require their workers to get the COVID-19 vaccine since some states already require them to get a flu shot.\n\nBut he notes that a COVID-19 vaccine would have to be readily available before a mandate was in place.\n\n\"When vaccines first become available, they won't be available in sufficient quantities to vaccine everyone on day one,\" Schaffner said. \"There may be some subpopulations where there is a requirement, but I would be hugely surprised if there's a broader requirement.”\n\nA recent poll revealed that 7 in 10 Americans agreed to get a COVID-19 vaccine if the immunization was free and available to anyone.\n\nWe encourage readers who wish to comment on our material to do so through our Facebook, Twitter, YouTube, and Instagram accounts. God bless you and keep you in His truth.", "opengraph": {"site_name": "CBN", "type": "article", "url": "https://www2.cbn.com/news/news/covid-19-vaccine-mandate-likely-or-legal-why-some-states-and-employers-may-have-right", "title": "Is a COVID-19 Vaccine Mandate Likely or Legal? Why Some States and Employers May Have the Right to Force You", "description": "As the world eagerly awaits the development of a COVID-19 vaccine, the question has come up regarding whether or not the government and employers can mandate that people get vaccinated.", "image": "https://www2.cbn.com/sites/default/files/media/slider/images/vaccine_hdv_0_1.jpg", "updated_time": "2020-08-25T15:04:35-0400", "article:section": "CBN | News", "article:tag": "Not Selected", "article:published_time": "2020-08-09T16:15:00-0400", "article:modified_time": "2020-08-25T15:04:35-0400"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.healthline.com/health-news/covid-19-vaccination-refusal-mandate#Plan-A:-Education", "https://www.10news.com/news/local-news/states-have-authority-to-fine-or-jail-people-who-refuse-coronavirus-vaccine-attorney-says", "https://www.10news.com/news/local-news/states-have-authority-to-fine-or-jail-people-who-refuse-coronavirus-vaccine-attorney-says", "https://www.10news.com/news/local-news/states-have-authority-to-fine-or-jail-people-who-refuse-coronavirus-vaccine-attorney-says", "https://www.cbn.com/news/app/", "https://www.10news.com/news/local-news/states-have-authority-to-fine-or-jail-people-who-refuse-coronavirus-vaccine-attorney-says", "https://www.healthline.com/health-news/covid-19-vaccination-refusal-mandate#Plan-C:-General-mandates", "https://www.washingtonpost.com/context/may-25-28-2020-washington-post-abc-news-poll/bb30c35e-797e-4b5c-91fc-1a1cdfbe85cc/?itid=lk_inline_manual_2&itid=lk_inline_manual_2&itid=lk_inline_manual_2", "https://www.facebook.com/cbnnews/", "https://twitter.com/CBNNews", "https://www.youtube.com/user/CBNnewsonline/featured", "https://www.instagram.com/cbnnews/?hl=en"], "authors": [], "publish_date": "2020-08-09T16:15:00-0400"}