{"result_id": "065032", "URL": "https://www2.cbn.com/news/news/should-christians-take-vaccine-was-developed-using-cells-aborted-babies", "timestamp": "2023-04-25 14:40:31 CEST+0200", "meta": {"description": "Some Covid-19 vaccines were formulated using cell lines from babies aborted decades ago.  Some were not made using these cells.", "lang": "en", "keywords": "vaccine, Covid-19, abortion, health, healthy, wellness, Christian, pro-life, Catholic, cbnnewsyoutube", "favicon": "/themes/custom/cbn_emulsify/favicon.ico", "canonical": "https://www2.cbn.com/news/news/should-christians-take-vaccine-was-developed-using-cells-aborted-babies", "encoding": "utf-8"}, "image": null, "domain": "www2.cbn.com", "title": "Should Christians Take a Vaccine that was Developed Using Cells from Aborted Babies?", "cleaned_text": "Some COVID-19 vaccines were developed using cell lines from two babies who were aborted decades ago. The cells from these two abortions were modified in a way that allows them to continuously reproduce in a laboratory. The two cell lines have been used in numerous vaccines, treatments, and research in the last fifty years including some COVID-19 vaccine research and development.\n\nAccording to the pro-life Charlotte Lozier Institute some vaccines, including the ones made by pharmaceutical companies AstraZeneca as well as Johnson and Johnson were developed using cells derived from abortions.\n\nHowever, other vaccines reportedly do not use the cell lines, such as the one formulated by Pfizer, which this week announced they are close to asking the FDA for Emergency Use Authorization after revealing their vaccine demonstrated 90% effectiveness in the final Phase 3 Clinical trials.\n\nThe organization lists the top COVID-19 contenders and indicates whether each vaccine candidate used cell lines derived from aborted fetuses and if so, to what degree.\n\n\"Accurate information about the development and production of COVID-19 vaccines is essential, especially because many proposed candidates use newer molecular technologies for production of a viral vaccine,\" the website states.\n\nIt continues, \"One concern regarding the ethical assessment of viral vaccine candidates is the potential use of abortion-derived cell lines in the development, production or testing of a vaccine. This analysis utilizes data from the primary scientific literature when available, along with data from clinical trial documents, reputable vaccine tracking websites, and published commercial information. It is the hope that by providing accurate data, recipients can make well-informed decisions regarding vaccine choices.\"\n\nSTAY UP TO DATE WITH THE FREE CBN NEWS APP \n\nClick Here Get the App with Special Alerts on Breaking News and Top Stories\n\nCBN News spoke with Dr. Craig DeLisi, M.D., a Christian physician who practices at Titus Regional Medical Center in Mount Pleasant, Texas and believes once a vaccine has been proven to be safe and effective and is cleared by the US Food and Drug Administration, Christians can receive it with a clear conscience.\n\n\"I'm very pro-vaccine. I take care of adults and kids. I've traveled to Sudan several times and seen so many vaccine-preventable diseases. I'm very grateful we have them,\" he said, \"But I'm also very strongly pro-life. Human life begins at conception and it was created by God. Anything we do to end that life prematurely is evil.\"\n\n\"The issue with the aborted cells, first of all the Pfizer vaccine was not derived from that,\" he said, adding that the other vaccines that are derived from aborted fetal cell lines are not using cells from recently aborted babies, but rather the same cell lines that have been used for decades.\n\n\"There were two cell lines that were derived from abortions, which was evil and sinful, and then from that, they've grown viruses in those cell lines, in those cultures and they've lasted this long...the same cell lines from the same two abortions and had them for fifty-plus years and it's the same cell lines from those two abortions,\" Dr. DeLisi continued.\n\n\"While I do believe it was wrong for abortions, it was an evil act, but in the case where something good comes from it, I don't think as a believer we have to have a moral objection of receiving that,\" the Christian physician noted.\n\nDeLisi compares it to organ donation, saying, \"If someone was murdered and was an organ donor, as a Christian we shouldn't have any hesitation of taking that person's heart for grandpa, or this person's cornea or this person's kidney. Just because there was an evil act that preceded something and something good came from it.\"\n\nHe thinks using the two old cell lines is different from using cells from recently aborted babies for medical purposes, which he says is wrong.\n\n\"I would have more objections than anyone else. I don't care how good they are. I feel that way about any medical treatment including embryonic stem cells. So I do think it's different,\" Dr. DeLisi said. \"I think that we can have solace that even though there was something evil that was done, it's not being perpetuated and I think that with a clear conscience we can take a vaccine knowing something good is coming from something that was evil.\"\n\nLikewise, the Catholic Church permits the use of vaccines using cell lines derived from aborted fetuses. The National Catholic Bioethics Center advises taking vaccines that are not made using such cell lines as long as the vaccine is equally safe and effective. However, if none is available, \"One is morally free to use the vaccine, despite its historical association with abortion, if there is a proportionately serious reason for doing so. In practice, the risks to personal and public health could permit its use,\" according to the center's website.\n\nLast year the Trump administration banned the use of new aborted fetal tissue for government-funded medical research and development. However, using existing cell lines is permitted.", "opengraph": {"site_name": "CBN", "type": "article", "url": "https://www2.cbn.com/news/news/should-christians-take-vaccine-was-developed-using-cells-aborted-babies", "title": "Should Christians Take a Vaccine that was Developed Using Cells from Aborted Babies?", "description": "Some Covid-19 vaccines were formulated using cell lines from babies aborted decades ago.  Some were not made using these cells. ", "image": "https://www2.cbn.com/sites/default/files/brightcove/videos/images/thumbnails/_v1_static_734546207001_4b70f068-b376-4067-a72c-d1e157677ab1_7252f1ef-b151-400c-9953-6669b950d419_1920x1080_match_image.jpg", "updated_time": "2022-12-10T13:45:24-0500", "article:section": "CBN | News", "article:tag": "Not Selected", "article:published_time": "2020-11-11T22:00:00-0500", "article:modified_time": "2022-12-10T13:45:24-0500"}, "tags": [], "tweets": [], "movies": [], "links": ["https://lozierinstitute.org/update-covid-19-vaccine-candidates-and-abortion-derived-cell-lines/", "https://www.cbn.com/news/app/", "https://lozierinstitute.org/update-covid-19-vaccine-candidates-and-abortion-derived-cell-lines/", "https://www.ncbcenter.org/resources-and-statements-cms/ncbc-statement-on-covid-19-pandemic", "https://www.hhs.gov/about/news/2019/06/05/statement-from-the-department-of-health-and-human-services.html", "http://www1.cbn.com/cbnnews/us/2019/june/trump-admin-says-nih-will-no-longer-conduct-research-using-aborted-baby-body-parts"], "authors": [], "publish_date": "2020-11-11T22:00:00-0500"}