{"result_id": "065005", "URL": "https://www2.cbn.com/news/us/fda-approves-pfizer-vaccine-clears-path-epic-vaccination-campaign", "timestamp": "2023-04-25 14:39:31 CEST+0200", "meta": {"description": "The US is just one step away from launching an epic vaccination campaign against the outbreak that has killed close to 300,000 Americans. A government advisory panel has endorsed the widespread use of Pfizer's COVID-19 vaccine.", "lang": "en", "keywords": "vaccine, Pfizer, FDA, vaccination, campaign, COVID-19, coronavirus, advisory panel, safe, effective, endorsed, Americans, US, doctors, health care, nursing homes, side effects, Dr. Anthony Fauci, Caitlin Burke, CBNNews, watch", "favicon": "/themes/custom/cbn_emulsify/favicon.ico", "canonical": "https://www2.cbn.com/news/us/fda-approves-pfizer-vaccine-clears-path-epic-vaccination-campaign", "encoding": "utf-8"}, "image": null, "domain": "www2.cbn.com", "title": "FDA Approves Pfizer Vaccine, Clears Path for 'Epic Vaccination Campaign'", "cleaned_text": "Late Friday evening, the FDA approved the widespread use of Pfizer's coronavirus vaccine in a move that could mark the beginning of the end of the pandemic.\n\nIt comes after a preliminary US government advisory panel endorsed it in a 17-4 vote with one abstention over a Zoom call on Thursday. The experts concluded that the vaccine appears safe and effective for emergency use in adults and teenagers 16 and over.\n\n“I don’t think you would have found a scientist on this planet that would have predicted this 11 months ago,” said Dr. Paul Offit, a vaccine expert at Children’s Hospital of Philadelphia who advises the FDA.\n\nThe FDA's final endorsement opens the door for an epic vaccination campaign against the virus that has killed nearly 300,000 Americans.\n\n\"We really want to treat this vaccine as the liquid gold that it is because it's really the only tool that we have right now in our toolbox to cure this disease,\" said Susan Mashni, Vice President of Pharmacy for the Mount Sinai Health System.\n\nWithin 24-hours Pfizer will be able to send out the first 2.9 million doses.\n\n\"We can act quickly and we intend to and understand the urgency of the situation...we want to make sure we make the best decision for the American people,\" said FDA Commissioner Dr. Stephen Hahn.\n\nThe Pfizer vaccine was found to be 95 percent effective with no serious side effects. While there are a number of remaining unknowns about the vaccine, in an emergency, \"the question is whether you know enough\" to press ahead, said panel member Dr. Paul Offit. He concluded that the potential benefits outweigh the risks.\n\nSTAY UP TO DATE WITH THE FREE CBN NEWS APP \n\nClick Here Get the App with Special Alerts on Breaking News and Top Stories\n\nThe first doses of the vaccine will go to health care workers and nursing home residents.\n\nThis pivotal moment comes as the US reaches another grim milestone – over 300,000 deaths in a single day. That's a reported fatality from the virus every 30 seconds.\n\n\"People still don't think this is a big deal, they think it's kind of fake news... it's not, it's real. The numbers are absolutely real,\" said Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases.\n\nMany Americans still have questions about vaccines. According to a new Associated Press poll, only about half say they're ready to take the shot.\n\nPfizer says it can have about 25 million doses of the vaccine for the US by the end of December, and it likely won't be the only option for long.\n\nOfficials are hopeful we'll soon have authorization from the FDA for Moderna, AstraZeneca, and Johnson & Johnson's vaccines as health experts hope these preventive medicines will finally defeat the outbreak.", "opengraph": {"site_name": "CBN", "type": "article", "url": "https://www2.cbn.com/news/us/fda-approves-pfizer-vaccine-clears-path-epic-vaccination-campaign", "title": "FDA Approves Pfizer Vaccine, Clears Path for 'Epic Vaccination Campaign'", "description": "The US is just one step away from launching an epic vaccination campaign against the outbreak that has killed close to 300,000 Americans. A government advisory panel has endorsed the widespread use of Pfizer's COVID-19 vaccine. ", "image": "https://www2.cbn.com/sites/default/files/brightcove/videos/images/thumbnails/_v1_static_734546207001_fcab900d-aa4c-414b-bb36-26ca3cc24d20_acc60add-3951-431b-ba8b-fee7b8a014ad_1920x1080_match_image.jpg", "updated_time": "2022-12-10T13:45:24-0500", "article:section": "CBN | News", "article:tag": "Not Selected", "article:published_time": "2020-12-11T14:45:00-0500", "article:modified_time": "2022-12-10T13:45:24-0500"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"und\" xml:lang=\"und\"><a href=\"https://t.co/ofLq3OMicv\">pic.twitter.com/ofLq3OMicv</a></p>\n— Donald J. Trump (@realDonaldTrump) <a href=\"https://twitter.com/realDonaldTrump/status/1337586206683574272?ref_src=twsrc%5Etfw\">December 12, 2020</a></blockquote>\n"], "movies": [], "links": ["https://t.co/ofLq3OMicv", "https://twitter.com/realDonaldTrump/status/1337586206683574272?ref_src=twsrc%5Etfw", "https://www.cbn.com/news/app/", "https://apnews.com/article/ap-norc-poll-us-half-want-vaccine-shots-4d98dbfc0a64d60d52ac84c3065dac55"], "authors": [], "publish_date": "2020-12-11T14:45:00-0500"}