{"result_id": "065047", "URL": "https://www2.cbn.com/news/us/franklin-graham-talks-vaccine-passport-microchip-implants-and-whether-theyre-mark-beast", "timestamp": "2023-04-25 14:41:06 CEST+0200", "meta": {"description": "Evangelist Franklin Graham — son of the late Rev. Billy Graham — said this week he doesn’t believe the “vaccine passport” microchip implant is the biblical “mark of the beast.”", "lang": "en", "keywords": "cbnnews, Evangelist Franklin Graham, vaccine passport, microchip implant, mark of the beast, end times,", "favicon": "/themes/custom/cbn_emulsify/favicon.ico", "canonical": "https://www2.cbn.com/news/us/franklin-graham-talks-vaccine-passport-microchip-implants-and-whether-theyre-mark-beast", "encoding": "utf-8"}, "image": null, "domain": "www2.cbn.com", "title": "Franklin Graham Talks Vaccine Passport Microchip Implants and Whether They're the 'Mark of the Beast'", "cleaned_text": "Evangelist Franklin Graham — son of the late Rev. Billy Graham — said this week he doesn’t believe the “vaccine passport” microchip implant is the biblical “mark of the beast.”\n\nGraham shared his perspective after news of the Swedish-designed microchip made headlines.\n\n“I personally do not think this particular chip is the mark the Bible talks about, but it does make you think how close we may be,” he wrote. “Christians around the world are wondering if COVID-19 is being used as a way to condition the world population to accept a mark like this, whatever form it may take. If a scannable chip under the skin can contain vaccine information, adding other personal information and financial data could be a short step away.”\n\nRELATED UN Sculpture Looks a Lot Like the End Times Beast Referred to in Daniel 7 and Revelation 13\n\n“This may sound frightening; but people who have put their faith in God and His Son, Jesus Christ, don’t need to be afraid,” the evangelist continued. “We should not live in fear. God told us what was coming in His Word. Make sure that your name is written in the Lamb’s Book of Life by repenting of your sins and putting your faith and trust in Jesus Christ.”\n\nAccording to CBN News, a great deal of Swedes have opted to have microchips the size of a grain of rice implanted under their skin. The microchips contain identifying information and vaccination data for those who receive the implants.\n\nThe Swedish government implemented new rules Dec. 1 requiring people to have a “vaccine passport” verifying their inoculation status for all events with 100 or more people.\n\nKarin Tegmark Wisell of the Swedish Public Health Agency said in November vaccination passes “are a measure that we see as necessary,” adding, “We cannot just kick back and hope for the best.”\n\nMary Lee, a fellow for the RAND Corporation, described the microchips as part of “an ecosystem.”\n\n“It’s a bunch of devices that are connected to the internet that contain software and that either collect personal health data about you or can alter the body’s function,” she said. “We think of this ‘internet bodies’ as a collection of all these devices as well as all the data.”\n\nAs for Graham, the Samaritan’s Purse president has openly advocated vaccines.\n\nIn March 2021, he wrote in a Facebook post he believes Jesus would have supported inoculation against COVID-19 had the pandemic occurred during His earthly ministry.\n\n“I have been asked my opinion about the vaccine by the media and others,” Graham wrote. “I have even been asked if Jesus were physically walking on earth now, would He be an advocate for vaccines. My answer was that based on the parable of the Good Samaritan in the Bible, I would have to say—yes, I think Jesus Christ would advocate for people using vaccines and medicines to treat suffering and save lives.”\n\n***As the number of voices facing big-tech censorship continues to grow, please sign up for Faithwire’s daily newsletter and download the CBN News app to stay up-to-date with the latest news from a distinctly Christian perspective.***", "opengraph": {"site_name": "CBN", "type": "article", "url": "https://www2.cbn.com/news/us/franklin-graham-talks-vaccine-passport-microchip-implants-and-whether-theyre-mark-beast", "title": "Franklin Graham Talks Vaccine Passport Microchip Implants and Whether They're the 'Mark of the Beast'", "description": "Evangelist Franklin Graham — son of the late Rev. Billy Graham — said this week he doesn’t believe the “vaccine passport” microchip implant is the biblical “mark of the beast.”", "image": "https://www2.cbn.com/sites/default/files/media/standard/images/franklingraham3ap_hdv_0.jpg", "updated_time": "2021-12-30T11:19:31-0500", "article:section": "CBN | News", "article:tag": "Not Selected", "article:published_time": "2021-12-30T14:15:00-0500", "article:modified_time": "2021-12-30T11:19:31-0500"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www1.cbn.com/cbnnews/cwn/2021/december/people-are-getting-vaccine-passport-microchips-embedded-in-their-hands-as-covid-advances-the-internet-of-bodies", "https://www1.cbn.com/cbnnews/cwn/2021/december/people-are-getting-vaccine-passport-microchips-embedded-in-their-hands-as-covid-advances-the-internet-of-bodies", "https://www1.cbn.com/cbnnews/cwn/2021/december/people-are-getting-vaccine-passport-microchips-embedded-in-their-hands-as-covid-advances-the-internet-of-bodies", "https://www1.cbn.com/cbnnews/world/2021/december/un-sculpture-looks-a-lot-like-the-end-times-beast-referred-to-in-daniel-7-and-revelation-13", "https://www1.cbn.com/cbnnews/cwn/2021/december/people-are-getting-vaccine-passport-microchips-embedded-in-their-hands-as-covid-advances-the-internet-of-bodies", "https://www.facebook.com/FranklinGraham/posts/276922917136643", "https://www.faithwire.com/newsletter/", "https://www1.cbn.com/cbn-apps#cbn-news"], "authors": [], "publish_date": "2021-12-30T14:15:00-0500"}