{"result_id": "065056", "URL": "https://www2.cbn.com/news/us/battle-over-vaccine-mandates-heats-across-nation", "timestamp": "2023-04-25 14:41:25 CEST+0200", "meta": {"description": "Protests are erupting across the country over COVID -19 mandates. Parents in California are fired up, protesting outside the state Capitol and across the state.", "lang": "en", "keywords": "Capitol, California, football, parents, vaccine, mandate, state, nation, police, protest, COVID-19, virus, delta, variant, UK, US, death, sick, schools, CBN News, cbnnews.com", "favicon": "/themes/custom/cbn_emulsify/favicon.ico", "canonical": "https://www2.cbn.com/news/us/battle-over-vaccine-mandates-heats-across-nation", "encoding": "utf-8"}, "image": null, "domain": "www2.cbn.com", "title": "Battle Over Vaccine Mandates Heats Up Across the Nation", "cleaned_text": "Protests are erupting across the country over COVID-19 vaccine mandates. Parents in California are fired up, protesting outside the state Capitol and across the state.\n\n\"The harder they push, the louder we'll get,” said Angie Matthews, a parent from Stockton.\n\nCalifornia teachers are now required to get the shot. The mandate is coming for students too once the vaccine is fully approved for their age groups. \"I'm not a parent that wants my child to be controlled by the government,” said parent Tykie Rodriguez. So, I want my child to not be vaccinated.\"\n\nResistance to Vaccine Mandates Grows Among Police Forces Across USA: 'This is About Saving Jobs'\n\nIn Chicago, police officers are facing off with the mayor. Thirty-five percent of officers haven't reported their vaccine status and risk losing their jobs. In Washington state, an officer signed off for the last time after being forced to leave for not complying.\n\nNationwide, 62% of all officer deaths last year were from COVID.\n\nIn the sports world, Washington state has fired its head football coach Nick Rolovich and four assistants for refusing the state mandate. \"I mean it's just unfortunate,” said Pat Chun, Washington State University’s Director of Athletics. “This team, they don't deserve this. I mean that this is a real point of heartbreak.\"\n\nESPN Reporter Allison Williams Walks Away from Job Over Vaccine Mandate: 'I'm Going to Hold on to My Faith'\n\nIt all comes as a so-called sub-variant called “Delta Plus” ramps up its spread. About 6% of all cases in the UK are from this new strain, which has spread to the US. \n\n \n\n Meanwhile, some governors are pushing back against the mandates.\n\n\"This Delta variant is dangerous; it's spreading quickly, but it's spreading whether there are mandates or not. And unfortunately, these mandates have created an economic pandemic where previously we only had a health pandemic,” Montana Gov. Greg Gianforte (R) told CBN News.\n\nBut a new study from the “Covid States Project” shows support for governors slipping in states without mandates. \n\n \n\n While the battle brews, the FDA could make an announcement on booster shots this week. The agency is expected to recommend people get boosters that match their original doses but could still allow mixing and matching.\n\n\"I think mixing and matching would reduce supply chain complexity quite a bit. And so, the end result would be more boosters and more arms and that matters a lot,” said Dr. Ryan Ribeira of Stanford Hospital’s Emergency Department.\n\nMeanwhile, at midnight, a vaccine mandate went into effect in Seattle. The city reports 99% of its 11,000 thousand employees have complied.\n\n***Please sign up for CBN Newsletters and download the CBN News app to ensure you keep receiving the latest news from a distinctly Christian perspective.***", "opengraph": {"site_name": "CBN", "type": "article", "url": "https://www2.cbn.com/news/us/battle-over-vaccine-mandates-heats-across-nation", "title": "Battle Over Vaccine Mandates Heats Up Across the Nation", "description": "Protests are erupting across the country over COVID -19 mandates. Parents in California are fired up, protesting outside the state Capitol and across the state.  ", "image": "https://www2.cbn.com/sites/default/files/brightcove/videos/images/thumbnails/_v1_jit_734546207001_2a97b67e-49ed-41a9-b072-e936ecdde5b5_main_1280x720_1m25s525ms_match_image.jpg", "updated_time": "2022-12-10T13:45:24-0500", "article:section": "CBN | News", "article:tag": "Not Selected", "article:published_time": "2021-10-19T10:30:00-0400", "article:modified_time": "2022-12-10T13:45:24-0500"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\" xml:lang=\"en\">“This is the last time you’ll hear me in a patrol car and Jay Inslee can kiss my ass.”<br/><br/>\nWashington State Trooper in Yakima, Wash. signs off after 22 years — fired by <a href=\"https://twitter.com/GovInslee?ref_src=twsrc%5Etfw\">@GovInslee</a> for being unvaccinated. <a href=\"https://t.co/RGLDs5BZxg\">pic.twitter.com/RGLDs5BZxg</a></p>\n— Jason Rantz on KTTH Radio (@jasonrantz) <a href=\"https://twitter.com/jasonrantz/status/1449538761474199555?ref_src=twsrc%5Etfw\">October 17, 2021</a></blockquote>\n"], "movies": [], "links": ["https://www1.cbn.com/cbnnews/us/2021/october/this-is-about-saving-jobs-resistance-to-vaccine-mandates-grows-among-public-and-private-employees-across-america", "https://twitter.com/GovInslee?ref_src=twsrc%5Etfw", "https://t.co/RGLDs5BZxg", "https://twitter.com/jasonrantz/status/1449538761474199555?ref_src=twsrc%5Etfw", "https://www1.cbn.com/cbnnews/us/2021/october/washington-state-coach-rolovich-fired-for-refusing-vaccine", "https://www1.cbn.com/cbnnews/entertainment/2021/october/im-going-to-hold-on-to-my-faith-espn-reporter-allison-williams-walks-away-from-job-over-covid-vaccine-mandate", "https://osf.io/dva5r/", "https://thehill.com/policy/healthcare/577132-support-for-governors-sliding-in-states-without-vaccine-mandates-survey", "https://www1.cbn.com/cbnnews/email-forms", "https://www1.cbn.com/cbn-apps#cbn-news", "https://www1.cbn.com/cbn-apps#cbn-news"], "authors": [], "publish_date": "2021-10-19T10:30:00-0400"}