{"result_id": "065042", "URL": "https://www2.cbn.com/news/news/novavax-says-its-covid-shot-90-effective-promises-100-million-doses-fall", "timestamp": "2023-04-25 14:40:56 CEST+0200", "meta": {"description": "Vaccine maker Novavax said Monday its shot has been determined to be highly effective against COVID-19 and also protects against variants in a large, late-stage study in the U.S. and Mexico.", "lang": "en", "keywords": "vaccine maker, Novavax, shot, highly effective, COVID-19, large study, 90% effective, safe, stored, standard refrigerators, easier to distribute, 100 million doses a month, September, 150 million doses a month, December, 110 million doses, U.S., 1.1 billion doses, developing countries, Stanley Erck, The Associated Press, more than half of the U.S. population, at least one COVID-19 vaccine dose, Our World In Data, Side effects, mostly mild, coronavirus vaccine work, partly funded, U.S. government, CBN News, June 2021", "favicon": "/themes/custom/cbn_emulsify/favicon.ico", "canonical": "https://www2.cbn.com/news/news/novavax-says-its-covid-shot-90-effective-promises-100-million-doses-fall", "encoding": "utf-8"}, "image": null, "domain": "www2.cbn.com", "title": "Novavax Says Its COVID Shot Is 90% Effective, Promises 100 Million Doses by Fall", "cleaned_text": "Vaccine maker Novavax said Monday its shot has been determined to be highly effective against COVID-19 and also protects against variants in a large, late-stage study in the U.S. and Mexico.\n\nThe vaccine was about 90% effective overall and preliminary data showed it was safe, the company said.\n\nWhile demand for COVID-19 shots in the U.S. has dropped off dramatically, the need for more vaccines around the world remains critical. The Novavax vaccine, which is easy to store and transport, is expected to play an important role in boosting vaccine supplies in the developing world.\n\nThe company's vaccine can be stored in standard refrigerators, making it easier to distribute than the vaccines that are already being widely used in the U.S.\n\nNovavax previously announced manufacturing delays due to supply shortages. The company now expects to reach production of 100 million doses a month by the end of September and 150 million doses a month by December.\n\n***Please sign up for CBN Newsletters and download the CBN News app to ensure you keep receiving the latest news from a distinctly Christian perspective.***\n\nThe company has committed to supplying 110 million doses to the U.S. over the next year and a total of 1.1 billion doses to developing countries.\n\n“Many of our first doses will go to … low- and middle-income countries, and that was the goal to begin with,” Novavax Chief Executive Stanley Erck told The Associated Press.\n\nWhile more than half of the U.S. population has had at least one COVID-19 vaccine dose, less than 1 percent of people in the developing world have had one shot, according to Our World In Data.\n\nNovavax's study involved nearly 30,000 people ages 18 and up in the U.S. and Mexico. Two-thirds received two doses of the vaccine, three weeks apart, and the rest got a placebo instead.\n\nThere were 77 cases of COVID-19. Fourteen in the group got the vaccine and the rest were volunteers who received the inactive substance. None in the vaccine group had moderate or severe COVID, compared to 14 in the placebo group.\n\nThe vaccine was similarly effective against several variants including the one first detected in the U.K. that's dominant in the U.S., and in high-risk populations including the elderly and people with other health problems.\n\nSide effects were mostly mild, including tenderness and pain at the injection site. There were no reports of unusual blood clots or heart problems, Erck said.\n\nNovavax reported the results in a press release and plans to publish in a medical journal, where it will be vetted by independent experts. The Maryland-based company previously released findings from smaller studies in Britain and South Africa.\n\nCOVID-19 vaccines train the body to recognize the coronavirus, especially the spike protein that coats it, creating an immune system defense to help fight the virus off. The Novavax vaccine is made with lab-grown copies of that protein. That's different from some of the other vaccines now widely used, which include genetic instructions for the body to make its own spike protein.\n\nLast month, vaccines alliance Gavi announced it had signed an agreement to buy 350 million doses of Novavax’s vaccine, with deliveries estimated to begin in the third quarter. COVAX, the global initiative to provide vaccines to countries, is facing a critical shortage of vaccines after its biggest supplier in India suspended exports until the end of the year.\n\nNovavax has been working on developing vaccines for more than three decades but hasn't brought one to market. The company’s coronavirus vaccine work is partly funded by the U.S. government.", "opengraph": {"site_name": "CBN", "type": "article", "url": "https://www2.cbn.com/news/news/novavax-says-its-covid-shot-90-effective-promises-100-million-doses-fall", "title": "Novavax Says Its COVID Shot Is 90% Effective, Promises 100 Million Doses by Fall", "description": "Vaccine maker Novavax said Monday its shot has been determined to be highly effective against COVID-19 and also protects against variants in a large, late-stage study in the U.S. and Mexico. ", "image": "https://www2.cbn.com/sites/default/files/media/slider/images/noravaxvaccine_hdv.jpg", "updated_time": "2021-06-14T10:17:26-0400", "article:section": "CBN | News", "article:tag": "Not Selected", "article:published_time": "2021-06-14T13:45:00-0400", "article:modified_time": "2021-06-14T10:17:26-0400"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www1.cbn.com/cbnnews/email-forms", "https://www1.cbn.com/cbn-apps#cbn-news", "https://www1.cbn.com/cbn-apps#cbn-news"], "authors": [], "publish_date": "2021-06-14T13:45:00-0400"}