{"result_id": "065044", "URL": "https://www2.cbn.com/news/news/will-covid-vaccines-be-safe-christian-leaders-respond-anti-vaccine-theories", "timestamp": "2023-04-25 14:41:01 CEST+0200", "meta": {"description": "NIH director and Christian author Dr. Francis Collins and Southern Baptist Ethics president Russell Moore address vaccine safety in a webinar Thursday.", "lang": "en", "keywords": "vaccine, Francis Collins, Russell Moore, Covid-19, coronavirus, pandemic, health, healthy, wellness, Christian, Christianity, vaccines, abortion, Bill Gates", "favicon": "/themes/custom/cbn_emulsify/favicon.ico", "canonical": "https://www2.cbn.com/news/news/will-covid-vaccines-be-safe-christian-leaders-respond-anti-vaccine-theories", "encoding": "utf-8"}, "image": null, "domain": "www2.cbn.com", "title": "Will COVID Vaccines Be Safe? Christian Leaders Respond to Anti-Vaccine Theories", "cleaned_text": "Don't believe everything you see on the internet. That was the message Thursday from two prominent Christian leaders who held a joint webinar to discuss the Christian response to the coronavirus pandemic.\n\nNational Institutes of Health director Dr. Francis Collins, who wrote the best-selling book The Language of God: A Scientist Presents Evidence for Belief and Russell Moore, president of the Ethics & Religious Liberty Commission of the Southern Baptist Convention and author of The Courage to Stand: Facing Your Fear Without Losing Your Soul called on all Americans, particularly Christians, to get a COVID-19 vaccine as soon as possible while addressing some believers' concerns about it.\n\nMoore asked Collins, \"How do I know that something bad isn't going to happen to me or my family with the vaccine? What would you say to reassure those people?\"\n\nDr. Collins responded, \"Well here's an opportunity for Christians to say, 'Let's really look at the truth.'\"\n\nThe two proceeded to address a number of anti-vaccine theories that have gained traction online.\n\n\"There's an awful lot of information floating around particularly on social media that frankly doesn't represent truth,\" Collins said. \"That represents to a certain degree fear and anxiety and frankly conspiracies that are pretty outrageous.\"\n\nBELOW: Watch the Entire 30-minute Webinar featuring Dr. Francis Collins and Russell Moore\n\nBefore becoming director of the NIH, Dr. Collins led the team of scientists who first sequenced human DNA. He refuted one online account that the messenger-RNA vaccines produced by Pfizer and Moderna alter a person's DNA.\n\n\"The RNA lives a very short time in your body,\" he explained. \"It is quickly degraded because RNA has a very short half-life. So there's no residual of what you've been injected with beyond probably a few hours.\"\n\nSTAY UP TO DATE WITH THE FREE CBN NEWS APP \n\nClick Here Get the App with Special Alerts on Breaking News and Top Stories\n\nBoth Moore and Collins indicated some widespread rumors could be seen as jokes except for the fact that people sometimes believe them and could therefore refuse a potentially life-saving vaccine.\n\n\"No metals that interact with 5G towers and implant ways that people know where you are and track you,\" Moore said.\n\n\"And Bill Gates has not convinced us to put microchips into the syringes,\" Collins said, rejecting one conspiracy theory that's out there. \"I still think there are people who've heard that and think maybe it could be true. I really want to assure people these are wild, crazy ideas.\"\n\nSome vaccines, such as the ones made by AstraZeneca and Johnson & Johnson use material derived from abortion, but he indicated it's not what many people might think. For instance, he said it was a very old cell line that was used in vaccine development and is not in the actual vaccine.\n\n\"There's a cell line that was derived in 1972, a cell line that was derived from a pregnancy that was terminated in Scandinavia, an elective abortion,\" Collins said. \"That cell line has been used in many, many areas of biotechnology.\"\n\nWhile Collins and Moore recognized abortion certainly is an issue of life, they pointed out the fact that vaccines are, too. According to current CDC statistics, COVID-19 contributes to one person's death every minute of the day in the United States.\n\n\"If you have a life-saving intervention and there's no other alternative, it is acceptable, when we're talking about cell lines derived 50 years ago. There's no current use of human fetal tissue at all in any of these vaccines,\" Dr. Collins explained.\n\nFor now, Pfizer and Moderna's vaccines are the most likely ones to be distributed soon since they've been deemed 95 percent effective. At the end of the day, Collins and Moore advise Christians to get a COVID-19 vaccine.\n\n\"If you're trying to size up benefits and risks,\" Collins said, \"and believe that God gives us the opportunity to act as his agents to try to relieve suffering and death, this is a pretty good balance.\"\n\nOther Christian and political leaders also want to show vaccines are okay. Bible teacher Beth Moore and former Presidents Clinton, Bush and Obama volunteered to not only get their COVID-19 vaccine as soon as possible, but they also plan to take their shots on camera as a way to demonstrate it's safe and to encourage others to follow their lead.", "opengraph": {"site_name": "CBN", "type": "article", "url": "https://www2.cbn.com/news/news/will-covid-vaccines-be-safe-christian-leaders-respond-anti-vaccine-theories", "title": "Will COVID Vaccines Be Safe? Christian Leaders Respond to Anti-Vaccine Theories", "description": "NIH director and Christian author Dr. Francis Collins and Southern Baptist Ethics president Russell Moore address vaccine safety in a webinar Thursday.", "image": "https://www2.cbn.com/sites/default/files/brightcove/videos/images/thumbnails/_v1_static_734546207001_c5cdbddc-336b-429e-ba19-6a793bb52539_f6c57f53-1030-45eb-9ae3-20a95edbbc5d_1920x1080_match_image.jpg", "updated_time": "2022-12-10T13:45:24-0500", "article:section": "CBN | News", "article:tag": "Not Selected", "article:published_time": "2020-12-04T16:45:00-0500", "article:modified_time": "2022-12-10T13:45:24-0500"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/Er7XjryDHkg?start=1\" width=\"560\"/>", "src": "https://www.youtube.com/embed/Er7XjryDHkg?start=1"}], "links": ["https://www.nih.gov/about-nih/who-we-are/nih-director", "https://www.amazon.com/Language-God-Scientist-Presents-Evidence/dp/1416542744", "https://www.russellmoore.com/about/", "https://www.amazon.com/Courage-Stand-Facing-without-Losing/dp/1535998539", "https://www.youtube.com/watch?v=Er7XjryDHkg&feature=youtu.be", "https://www.cbn.com/news/app/", "https://www.cdc.gov/nchs/nvss/vsrr/covid_weekly/index.htm", "https://www.lproof.org/"], "authors": [], "publish_date": "2020-12-04T16:45:00-0500"}