{"result_id": "065009", "URL": "https://www2.cbn.com/news/world/g20-leaders-agree-global-vaccination-passport-system-where-will-it-end", "timestamp": "2023-04-25 14:39:39 CEST+0200", "meta": {"description": "The leaders of the world's largest economies at the G20 meeting held in Bali, Indonesia, this week did much more than di", "lang": "en", "keywords": "", "favicon": "/themes/custom/cbn_emulsify/favicon.ico", "canonical": "https://www2.cbn.com/news/world/g20-leaders-agree-global-vaccination-passport-system-where-will-it-end", "encoding": "utf-8"}, "image": null, "domain": "www2.cbn.com", "title": "G20 Leaders Agree to Global Vaccination Passport System: 'Where Will It End?'", "cleaned_text": "The leaders of the world's largest economies at the G20 meeting held in Bali, Indonesia, this week did much more than discuss current economic troubles. They also drafted and signed a declaration in which the 20 countries agreed to adopt vaccine passports with the purported goal to promote global travel and tourism.\n\nBloomberg reported tourism ministers from several countries had backed the use of vaccine passports last year in an effort to boost international travel after the pandemic tanked the tourism industry. The group said it was essential for speeding up global economic recovery efforts, but the move is raising concerns among critics who worry about government overreach and the rights of individuals.\n\nThe world leaders' Bali Declaration, included a section (s.23) on \"facilitating seamless international travel.\" The impact would be vast because the G20 countries comprise more than 66 percent of the world's population.\n\nThe agreement called for shared technical standards and verification methods, including vaccine passports. It also commits to \"support continued international dialogue and collaboration on the establishment of trusted global digital health networks that should capitalize and build on the success of the existing standard and digital COVID-19 certificates.\"\n\nIn a separate updated document, the G20 vows to: \"Endeavour to move towards interoperability of systems including mechanisms that validate proof of vaccination, whilst respecting the sovereignty of national health policies, and relevant national regulations such as personal data protection and data-sharing.\"\n\nIt has been proposed that this digital health certificate would adhere to World Health Organization (WHO) standards. Under the proposal, only if a person has been vaccinated or tested according to those standards would they be able to travel internationally.\n\nThe vaccine passports could be paper or a digital code or an app that records and displays the user's health information, including COVID-19 vaccination status. Digital health passports would involve a scannable code similar to an airline boarding pass. Then tracking and tracing apps could monitor the user's movement and their interactions with other people. The app would even issue a warning if the user moves outside of the quarantine zone.\n\n***Please sign up for CBN Newsletters and download the CBN News app to ensure you keep receiving the latest news from a distinctly Christian perspective.***\n\nWhile the American mainstream media has been mostly silent about the vaccine passports, anchors of the British news outlet GB News posted a video to Twitter discussing the power the WHO would have over people's lives. One anchor even asked, \"Where will it end?\"\n\nMeanwhile, several people in the U.S. are warning that if allowed, the health or vaccine passports would eventually track every aspect of Americans' lives, violating the U.S. Constitution, the Americans With Disabilities Act, and HIPAA, due to the fact that everyone's medical records would be a part of a worldwide database.\n\n\"Digital health or vaccine passports along with tracking and tracing apps present a serious threat to freedom. Vaccine passports and tracking apps are about collecting data and control,\" Liberty Counsel Founder and Chairman Mat Staver said in a press release.\n\n\"The vaccine passport is being promoted worldwide to limit a person's ability to leave home, work, shop, dine, travel, attend a public event, or even worship. COVID is being used to advance this dangerous threat to freedom. We must never accept vaccine passports or tracking apps as the new normal. The implications for freedom are significant,\" Staver said.\n\nSocial media users in the U.S. aren't crazy about the idea of having vaccine passports either.\n\nOne Twitter user commented, \"G20 - BREAKING: leaders have just signed a declaration which states that vaccine passports will be adopted to 'facilitate' all international travel. This means any vaccination the WHO determines you should have. Changing your rights & freedoms forever. Silence from the media.\"\n\n\"Last time I checked, no one voted for the WEF, the UN, the WHO or any of these psychos to govern us at all,\" one user noted. \"There will be NO vaccine passports for anyone who loves freedom.\"\n\nAnother user also wrote, \"Why would you need global digital vaccine passports if the 'vaccines' don't stop transmission? Oh right, because this was never about a virus.\"\n\n\"'Health officials' still insisting on vaccine passports in spite of the fact that we now 100% know vaccines don't work. Either 'health officials' are stupid or the agenda ain't about health,\" another user commented.", "opengraph": {"site_name": "CBN", "type": "article", "url": "https://www2.cbn.com/news/world/g20-leaders-agree-global-vaccination-passport-system-where-will-it-end", "title": "G20 Leaders Agree to Global Vaccination Passport System: 'Where Will It End?'", "description": "The leaders of the world's largest economies at the G20 meeting held in Bali, Indonesia, this week did much more than di", "image": "https://www2.cbn.com/sites/default/files/media/slider/images/vaccinepassport_0.png", "updated_time": "2022-11-18T14:37:56-0500", "article:section": "CBN | News", "article:tag": "CBN News", "article:published_time": "2022-11-18T13:52:59-0500", "article:modified_time": "2022-11-18T14:37:56-0500"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\" xml:lang=\"en\">G20 to adopt Vaccine Passports using WHO standards<br/><br/>\n“Let’s have a digital health certificate acknowledged by WHO… if you have been vaccinated or tested properly, then you can move around”, said the Indonesian health minister in Bali…<br/><br/>\nNo thanks ...<br/><br/>\nsound ... <a href=\"https://t.co/VDM1qK4xW5\">pic.twitter.com/VDM1qK4xW5</a></p>\n— Wall Street Silver (@WallStreetSilv) <a href=\"https://twitter.com/WallStreetSilv/status/1592774471617847297?ref_src=twsrc%5Etfw\">November 16, 2022</a></blockquote>\n", "<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\" xml:lang=\"en\">'We didn't vote for these organizations to have so much power over our lives.'<br/><br/>\nDominique Samuels, Shaun Bailey and Amy Nickell clash over global leaders backing vaccine passports for future international travel. <a href=\"https://t.co/pespl3e4A1\">pic.twitter.com/pespl3e4A1</a></p>\n— GB News (@GBNEWS) <a href=\"https://twitter.com/GBNEWS/status/1593384988052971520?ref_src=twsrc%5Etfw\">November 17, 2022</a></blockquote>\n"], "movies": [], "links": ["https://www.bloomberg.com/news/articles/2021-05-04/leading-20-nations-set-to-back-efforts-for-vaccine-passports?cmpid=BBD050521_MKTEU&utm_medium=email&utm_source=newsletter&utm_term=210505&utm_campaign=marketseurope&leadSource=uverify%20wall", "https://www.whitehouse.gov/briefing-room/statements-releases/2022/11/16/g20-bali-leaders-declaration/", "https://www.g20.org/wp-content/uploads/2022/11/2022-G20-Bali-Update.pdf", "https://t.co/VDM1qK4xW5", "https://twitter.com/WallStreetSilv/status/1592774471617847297?ref_src=twsrc%5Etfw", "https://www1.cbn.com/cbnnews/email-forms", "https://www1.cbn.com/cbn-apps#cbn-news", "https://t.co/pespl3e4A1", "https://twitter.com/GBNEWS/status/1593384988052971520?ref_src=twsrc%5Etfw", "https://lc.org/"], "authors": [], "publish_date": "2022-11-18T13:52:59-0500"}