{"result_id": "065050", "URL": "https://www2.cbn.com/news/us/military-service-members-granted-relief-after-being-denied-religious-exemption-covid-19", "timestamp": "2023-04-25 14:41:14 CEST+0200", "meta": {"description": "A Texas federal judge has granted relief to 10 military service members after the Army denied their religious accommodat", "lang": "en", "keywords": "", "favicon": "/themes/custom/cbn_emulsify/favicon.ico", "canonical": "https://www2.cbn.com/news/us/military-service-members-granted-relief-after-being-denied-religious-exemption-covid-19", "encoding": "utf-8"}, "image": null, "domain": "www2.cbn.com", "title": "Military Service Members Granted Relief After Being Denied Religious Exemption from COVID-19 Vaccine", "cleaned_text": "A Texas federal judge has granted relief to 10 military service members after the Army denied their religious accommodations from the COVID-19 shot mandate.\n\nThe Liberty Counsel filed a lawsuit on behalf of six U.S. Army soldiers and four Army West Point cadets who requested an exemption to the Army's shot mandate due to their religious beliefs but were denied.\n\nMeanwhile, the Army continued to grant medical and administrative accommodations to the COVID vaccine mandate.\n\nAccording to the non-profit legal group, each person opposed the COVID shot because they believed the injections were associated with aborted fetal cell lines.\n\nTexas District Court Judge James Wesley Hendrix granted a preliminary injunction last week stating that the \"soldiers have a right to religious freedom.\"\n\n\"Our first commander in chief cautioned that '(w)hile we are Contending for our own Liberty, we should be very cautious of violating the Rights of Conscience in others...The great majority of the soldiers in the Army express religious preferences,'\" Wesley wrote in his decision.\n\nHe continued, \"The Army does not dispute this history or its ongoing obligation to accommodate its soldiers' religious freedom, including compliance with RFRA. But it has failed to prove that its ongoing imposition of the COVID-19 vaccine mandate, which indisputably burdens some soldiers sincerely held religious beliefs, serves a compelling interest through the least restrictive means available. As a result, the Army must retreat from imposing its mandate in this particular field and permit religious exemptions to these Plaintiffs\".\n\nThe Army is now prohibited from taking any disciplinary, punitive, or separation measures against any of these service members.\n\nAs CBN News reported in August 2021, Secretary of Defense Lloyd Austin announced all U.S. troops would be required to get the COVID vaccine or be forced out.\n\nPentagon spokesman John Kirby told CBN News in December of 2021 that religious exemptions are rare in the military.\n\n\"This is not about liberties, it's about a military medical requirement to keep them safe, to keep their families safe, to keep their units safe and the Secretary continues to strongly believe that these vaccines are the best way to do it with respect to COVID,\" Kirby said.\n\nBut the Texas court wrote that at this point they have reached that goal.\n\n\"Here, with 97% of active forces vaccinated and operating successfully in a post-pandemic world, the Army falls short of its burden. It admitted no evidence at the hearing, and its assertion that allowing the ten named plaintiffs to remain exempt would prevent the Army from satisfying its mission defies logic and is undermined by the record. Thus, the Court grants the plaintiffs' motion for a preliminary injunction; all disciplinary and separation procedures against the plaintiffs must cease,\" it wrote.\n\n\"The Army, like every other branch of the military, is unlawfully denying religious exemptions. The Commander in Chief has disrespected our service members with this shot mandate. Fortunately, the courts continue to rebuff the lawless acts of Joe Biden and the Department of Defense who must be stopped from ever violating the religious freedom rights of all service members,” Staver said.\n\n\n\n “Service members have been punished, demoted, and discharged for merely requesting religious accommodation. They must be reinstated, and their records cleared,\" he added.\n\nMeanwhile, Sen. James Lankford (R-OK) announced that the Defense Secretary Austin will answer the requests of all military service members who have asked for a religious accommodation from the COVID-19 vaccine and are still awaiting a response.\n\nSo far, the Army has only granted 123 requests for religious accommodation while issuing denials to more than 1,900 others.\n\n***Please sign up for CBN Newsletters and download the CBN News app to ensure you keep receiving the latest news from a distinctly Christian perspective.***", "opengraph": {"site_name": "CBN", "type": "article", "url": "https://www2.cbn.com/news/us/military-service-members-granted-relief-after-being-denied-religious-exemption-covid-19", "title": "Military Service Members Granted Relief After Being Denied Religious Exemption from COVID-19 Vaccine", "description": "A Texas federal judge has granted relief to 10 military service members after the Army denied their religious accommodat", "image": "https://www2.cbn.com/sites/default/files/media/slider/images/usmilitary_hdv.jpg", "updated_time": "2022-12-28T12:51:54-0500", "article:section": "CBN | News", "article:tag": "CBN News", "article:published_time": "2022-12-28T12:51:27-0500", "article:modified_time": "2022-12-28T12:51:54-0500"}, "tags": [], "tweets": [], "movies": [], "links": ["https://lc.org/", "https://www1.cbn.com/cbnnews/quickstart", "https://www1.cbn.com/cbnnews/us/2021/august/mandatory-vaccines-for-troops-and-growing-number-of-americans-its-un-american-unconstitutional", "https://www.lankford.senate.gov/news/press-releases/lankford-receives-commitment-on-military-religious-accommodation-requests-for-covid-19-vaccine-mandate-from-dod-secretary-lifts-holds-on-dod-noms#:~:text=Lankford%20Receives%20Commitment%20on%20Military,heroes%20in%20the%20Armed%20Forces", "https://www1.cbn.com/cbnnews/email-forms", "https://www1.cbn.com/cbn-apps#cbn-news", "https://www1.cbn.com/cbn-apps#cbn-news"], "authors": [], "publish_date": "2022-12-28T12:51:27-0500"}