{"result_id": "065014", "URL": "https://www2.cbn.com/news/politics/gop-force-congressional-democrats-drop-military-vaccine-mandate", "timestamp": "2023-04-25 14:39:51 CEST+0200", "meta": {"description": "The mandate requiring military members to get vaccinated against COVID-19 could be on its way out.", "lang": "en", "keywords": "", "favicon": "/themes/custom/cbn_emulsify/favicon.ico", "canonical": "https://www2.cbn.com/news/politics/gop-force-congressional-democrats-drop-military-vaccine-mandate", "encoding": "utf-8"}, "image": null, "domain": "www2.cbn.com", "title": "GOP to Force Congressional Democrats to Drop Military Vaccine Mandate", "cleaned_text": "The mandate requiring military members to get vaccinated against COVID-19 could be on its way out.\n\nRepublicans in Congress are set to end the Pentagon's COVID vaccine mandate for military members. Language repealing the mandate will be included in a bill dealing with the Defense Department budget for 2023.\n\nIt's a move the White House calls a mistake, but Congress is now set to get rid of it.\n\nDoing that will require a major concession from Democrats as both sides take steps to pass the National Defense Authorization Act.\n\nThe compromise with Republicans comes a year after the COVID vaccine mandate was instated. The mandate has led to numerous legal battles for religious exemptions across all branches of the military. It has also fueled a decline in U.S. military recruitment.\n\nHouse Republican leader Kevin McCarthy said the Defense budget bill won't move forward without getting rid of the controversial military vaccine mandate.\n\nPresident Biden's Defense Secretary Lloyd Austin supports the mandate, which requires military members to get vaccinated or face dismissal.\n\nWhile 97 percent of active army personnel have complied with the order to accept the shot, more than 11,000 members of the Army, Army National Guard, and Army Reserve have refused and many have already been forced from service.\n\nAnd more than 10,000 U.S. Air Force personnel were being threatened with discipline or discharge because they refused to take the COVID vaccine due to their religious convictions.\n\nREAD: As Vaccine Mandate Fuels Military Recruiting Crisis, Coast Guard Lifesaver Waits to Be Terminated for Objecting\n\n***Please sign up for CBN Newsletters and download the CBN News app to ensure you keep receiving the latest news from a distinctly Christian perspective.***", "opengraph": {"site_name": "CBN", "type": "article", "url": "https://www2.cbn.com/news/politics/gop-force-congressional-democrats-drop-military-vaccine-mandate", "title": "GOP to Force Congressional Democrats to Drop Military Vaccine Mandate", "description": "The mandate requiring military members to get vaccinated against COVID-19 could be on its way out.", "image": "https://www2.cbn.com/sites/default/files/militaryusflagas_hdv.jpg", "updated_time": "2022-12-07T17:10:27-0500", "article:section": "CBN | News", "article:tag": "CBN News", "article:published_time": "2022-12-07T17:10:27-0500", "article:modified_time": "2022-12-07T17:10:27-0500"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www1.cbn.com/cbnnews/national-security/2022/october/coast-guard-rescue-swimmer-saves-lives-while-waiting-to-be-terminated-due-to-his-covid-vaccine-concerns", "https://www1.cbn.com/cbnnews/email-forms", "https://www1.cbn.com/cbn-apps#cbn-news"], "authors": [], "publish_date": "2022-12-07T17:10:27-0500"}