{"result_id": "065051", "URL": "https://www2.cbn.com/news/national-security/covid-vax-mandate-finally-nixed-all-troops-including-national-guard", "timestamp": "2023-04-25 14:41:17 CEST+0200", "meta": {"description": "All American military service members including the National Guard and the Army Reserve are no longer required to get th", "lang": "en", "keywords": "", "favicon": "/themes/custom/cbn_emulsify/favicon.ico", "canonical": "https://www2.cbn.com/news/national-security/covid-vax-mandate-finally-nixed-all-troops-including-national-guard", "encoding": "utf-8"}, "image": null, "domain": "www2.cbn.com", "title": "COVID Vax Mandate Finally Nixed for All Troops, Including National Guard, Reservists", "cleaned_text": "All American military service members including the National Guard and the Army Reserve are no longer required to get the COVID-19 shot to keep their jobs.\n\nDefense Secretary Lloyd Austin signed a memo Tuesday rescinding his August 2021 mandate requiring all members of the U.S. military to be vaccinated. The memo also canceled his November 2021 mandate requiring the same vaccinations for members of the National Guard and for reservists. But it also gives commanders some discretion in how or whether to deploy troops who are not vaccinated.\n\nAs CBN News reported on Dec. 30, the Department of Defense was forced to rescind the COVID-19 shot mandate for all military service members after Congress passed the National Defense Authorization Act (NDAA). The legislation gave Austin 30 days to rescind the mandate.\n\nIn his memo dated Jan. 10, Austin made it clear his department will continue to advocate for all service members to receive COVID-19 vaccinations.\n\n\"The Department will continue to promote and encourage COVID-19 vaccination for all Service members,\" the defense secretary wrote. \"The Department has made COVID-19 vaccination as easy and convenient as possible, resulting in vaccines administered to over two million Service members and 96 percent of the force ― Active and Reserve ― being fully vaccinated.\"\n\nBut Austin also noted that those who sought an accommodation after refusing to get the shot would not be punished.\n\n\"No individuals currently serving in the Armed Forces shall be separated solely on the basis of their refusal to receive the COVID-19 vaccination if they sought an accommodation on religious, administrative, or medical grounds,\" he wrote. \"The Military Departments will update the records of such individuals to remove any adverse actions solely associated with denials of such requests, including letters of reprimand.\"\n\nThousands of service members sought religious and medical exemptions. Austin's memo ends those exemption requests.\n\n\"The Secretaries of the Military Departments will further cease any ongoing reviews of current Service member religious, administrative, or medical accommodation requests solely for exemption from the COVID-19 vaccine or appeals of denials of such requests,\" Austin added.\n\nThe defense secretary also included in the memo that commanders can review an individual's immigration status when \"making deployment, assignment, and other operational decisions.\" This includes \"when vaccination is required for travel to, or entry into, a foreign nation.\"\n\n***Please sign up for CBN Newsletters and download the CBN News app to ensure you keep receiving the latest news from a distinctly Christian perspective.***\n\nAs CBN News reported, multiple courts have already ruled that the DOD and the various military branches violated the federal Religious Freedom Restoration Act (RFRA) by denying requests for religious accommodation.\n\nIn a statement, Mike Berry, director of Military Affairs for First Liberty Institute, a nonprofit religious rights law firm, responded to Austin's cancellation of his COVID order.\n\n\"We acknowledge that the Secretary of Defense did as Congress directed. But that is the bare minimum owed to our brave service members. In fact, the Secretary's memo still permits military commanders to require the vaccine in making decisions regarding unvaccinated service members,\" Berry said.\n\n\"There are still far too many in our military who were forced out or are still facing career-ending actions because of the COVID vaccine mandate. America owes it to those who defend our Constitution and our freedoms to ensure they do not lose theirs,\" he added.\n\nIn January 2022, First Liberty Institute and Hacker Stephens LLC won the first injunction against the military's vaccine mandate in Navy SEALs v. Biden. First Liberty filed the lawsuit and motion for preliminary injunction on behalf of dozens of U.S. Navy SEALs and other Naval Special Warfare personnel. Oral arguments in the case at the U.S. Court of Appeals for the Fifth Circuit are scheduled for Feb. 6.\n\nMore Than 8,400 Service Members Forced Out of Military\n\nAs CBN News reported, lawmakers on Capitol Hill were concerned the Defense Department's original COVID vaccine mandate was harming the military's recruitment and retention. They had also asked the Pentagon to reinstate any service members who were discharged for refusing to take the vaccine, with back pay. However, the provision did not end up in the final version of the NDAA.\n\nThe contentious political issue forced more than 8,400 troops out of the military for refusing to obey the order to accept the vaccine.\n\nThose who were discharged for refusing to obey a lawful order to take the vaccine received either an honorable discharge or a general discharge under honorable conditions. Austin's memo says that anyone who was discharged can petition their military service to request a change in the \"characterization of their discharge\" in their personnel records. It does not, however, say what possible corrections could be awarded.\n\nAccording to data compiled by the military as of early December, the Marine Corps leads the services with 3,717 Marines discharged. There have been 2,041 discharged from the Navy, 1,841 from the Army, and 834 from the Air Force. The Air Force data includes the Space Force.\n\nWhat's not clear is if the services, who are facing recruiting challenges, will want — or be able to — allow any of those service members to return to duty, if they still meet all necessary fitness and other requirements.\n\nWorship leader, author, and Christian activist Sean Feucht tweeted Tuesday evening of the news of the Pentagon finally dropping the COVID mandates for all service members, including a copy of Austin's memo.\n\n\"The pentagon has FINALLY dropped its Covid mandates for all troops,\" Feucht wrote. \"It's years too late. Now it's time to repay for the lives, careers, and families destroyed by this and ensure it NEVER happens again.\"", "opengraph": {"site_name": "CBN", "type": "article", "url": "https://www2.cbn.com/news/national-security/covid-vax-mandate-finally-nixed-all-troops-including-national-guard", "title": "COVID Vax Mandate Finally Nixed for All Troops, Including National Guard, Reservists", "description": "All American military service members including the National Guard and the Army Reserve are no longer required to get th", "image": "https://www2.cbn.com/sites/default/files/media/slider/images/pentagondefense_hdv.jpg", "updated_time": "2023-01-11T13:32:21-0500", "article:section": "CBN | News", "article:tag": "CBN News", "article:published_time": "2023-01-11T13:28:46-0500", "article:modified_time": "2023-01-11T13:32:21-0500"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\" xml:lang=\"en\">The pentagon has FINALLY dropped its Covid mandates for all troops<br/><br/>\nIt's years too late. Now it's time to repay for the lives, careers and families destroyed by this and ensure it NEVER happens again. <a href=\"https://t.co/tfhoSmxTUa\">pic.twitter.com/tfhoSmxTUa</a></p>\n— Sean Feucht (@seanfeucht) <a href=\"https://twitter.com/seanfeucht/status/1612960328056283136?ref_src=twsrc%5Etfw\">January 10, 2023</a></blockquote>\n"], "movies": [], "links": ["https://media.defense.gov/2023/Jan/10/2003143118/-1/-1/1/SECRETARY-OF-DEFENSE-MEMO-ON-RESCISSION-OF-CORONAVIRUS-DISEASE-2019-VACCINATION-REQUIREMENTS-FOR-MEMBERS-OF-THE-ARMED-FORCES.PDF", "https://www1.cbn.com/cbnnews/health/2022/december/bidens-defense-department-rescinds-mandatory-covid-19-order-service-members-no-longer-required-to-get-shots", "https://www1.cbn.com/cbnnews/quickstart", "https://www1.cbn.com/cbnnews/email-forms", "https://www1.cbn.com/cbn-apps#cbn-news", "https://t.co/tfhoSmxTUa", "https://twitter.com/seanfeucht/status/1612960328056283136?ref_src=twsrc%5Etfw", "https://www1.cbn.com/cbn-apps#cbn-news"], "authors": [], "publish_date": "2023-01-11T13:28:46-0500"}