{"result_id": "065015", "URL": "https://www2.cbn.com/news/us/mandatory-vaccines-troops-and-growing-number-americans-its-un-american-unconstitutional", "timestamp": "2023-04-25 14:39:53 CEST+0200", "meta": {"description": "In a memo to U.S. service members, Secretary of Defense Lloyd Austin today announced all troops will be required to get the COVID vaccine, a move supported by President Joe Biden.", "lang": "en", "keywords": "cbn news, cbnnewsyoutube.com, August, 2021, vaccine, mandate, COVID-19, pandemic, Joe Biden, employees, un-American, un-constitutional", "favicon": "/themes/custom/cbn_emulsify/favicon.ico", "canonical": "https://www2.cbn.com/news/us/mandatory-vaccines-troops-and-growing-number-americans-its-un-american-unconstitutional", "encoding": "utf-8"}, "image": null, "domain": "www2.cbn.com", "title": "Mandatory Vaccines for Troops and Growing Number of Americans: 'It's Un-American, Unconstitutional'", "cleaned_text": "WASHINGTON - In a memo to U.S. service members, Secretary of Defense Lloyd Austin today announced all troops will be required to get the COVID vaccine, a move supported by President Joe Biden.\n\n\"Being vaccinated will enable our service members to stay healthy, to better protect their families, and to ensure that our force is ready to operate anywhere in the world,\" the president wrote in a statement.\n\nThe latest statistics show just half of the country is fully vaccinated and those who haven't taken the shot are facing more repercussions.\n\nCNN has now joined some of the nation's largest employers like Walmart, Google, and Facebook in requiring their workers to get vaccinated. CNN even fired three employees who came to work without getting a COVID vaccine.\n\nHouse Speaker Nancy Pelosi has also changed her take on vaccine mandates. In April she said, \"We cannot require someone to be vaccinated.\"\n\nHowever, now the Speaker says full FDA approval of the Pfizer vaccine, expected next month, could open the door to mandating vaccines for lawmakers and staff.\n\nBoth the Department of Justice and the Equal Opportunity Commission have decided that mandates are acceptable.\n\n\"Certainly, I celebrate when I see businesses deciding that they're going to mandate that for their employees and as a person who runs the National Institutes of Health with 45,000 employees and contractors, I am glad to see the president insisting that we go forward requiring vaccinations or if people are unwilling to do that than regular testing once or twice a week which will be very inconvenient,\" Dr. Francis Collins, Director of the National Institutes of Health, said Sunday on ABC This Week.\n\nHowever, when Veterans Affairs mandated healthcare workers get vaccinated or face possible termination doctors, nurses, and other professionals lit up the phones and Liberty Counsel.\n\n\"Many of them have been distraught, frantic, some have called us in tears to find out how they could openly respond because they love their job, but they didn't want to get the shots,\" Mat Staver, chairman of Liberty Counsel tells CBN News.\n\nLiberty Counsel pressured the government to reveal that employees can legally opt-out for religious reasons, a fact that wasn't publicized.\n\nThat's because of questions regarding both long-term effects, and the reporting of injuries from vaccines.\n\nAdd that to confusion from the CDC about breakthrough infections and masks that's led to mistrust and the fact that the shots are still not fully authorized by the FDA.\n\nLike it or not, getting a vaccine has also become politicized which is something the Biden Administration has worked to tamp down.\n\n\"Why is it that a mandate about vaccines or about wearing a mask suddenly becomes a statement about your political party. We never should have let that happen. Come on America we can separate these, can't we? We're incredibly polarized about politics. We don't really need to be polarized about a virus that's killing people,\" Dr. Collins said.\n\nStaver argues it comes down to one thing: freedom.\n\n\"It is reprehensible, it's un-American, it's unconstitutional, it's illegal to force individuals - particularly our healthcare working heroes - against their will and that is just despicable,\" Staver said.\n\nThis week Liberty Counsel is organizing \"Walkout Wednesday\" encouraging all Americans, vaccinated or not, to walk out of their workplace or school at noon to stand for freedom.\n\n***Please sign up for CBN Newsletters and download the CBN News app to ensure you keep receiving the latest news from a distinctly Christian perspective.***", "opengraph": {"site_name": "CBN", "type": "article", "url": "https://www2.cbn.com/news/us/mandatory-vaccines-troops-and-growing-number-americans-its-un-american-unconstitutional", "title": "Mandatory Vaccines for Troops and Growing Number of Americans: 'It's Un-American, Unconstitutional'", "description": "In a memo to U.S. service members, Secretary of Defense Lloyd Austin today announced all troops will be required to get the COVID vaccine, a move supported by President Joe Biden.", "image": "https://www2.cbn.com/sites/default/files/brightcove/videos/images/thumbnails/_v1_jit_734546207001_6ca42de1-a274-4fed-963f-3c911a8bfb83_main_1280x720_1m21s770ms_match_image.jpg", "updated_time": "2022-12-10T13:45:24-0500", "article:section": "CBN | News", "article:tag": "Not Selected", "article:published_time": "2021-08-11T21:15:00-0400", "article:modified_time": "2022-12-10T13:45:24-0500"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.lc.org/newsroom/details/080321-walkout-wednesday-to-protest-mandatory-shots-1 ", "https://www1.cbn.com/cbnnews/email-forms", "https://www1.cbn.com/cbn-apps#cbn-news", "https://www1.cbn.com/cbn-apps#cbn-news"], "authors": [], "publish_date": "2021-08-11T21:15:00-0400"}