{"result_id": "065006", "URL": "https://www2.cbn.com/news/world/eu-agency-rare-clots-possibly-linked-astrazeneca-shot", "timestamp": "2023-04-25 14:39:33 CEST+0200", "meta": {"description": "The European Union's drug said Wednesday that it found a \"possible link\" between the AstraZeneca coronavirus vaccine and a rare clotting disorder but recommended that vaccinations continue in adults, saying the benefits of the shot still outweigh risks.", "lang": "en", "keywords": "European Union, found, \"possible link\", AstraZeneca coronavirus vaccine, rare clotting disorder, recommended, vaccinations continue in adults, benefits of the shot, still outweigh risks, Associated Press, CBN News, April 2021", "favicon": "/themes/custom/cbn_emulsify/favicon.ico", "canonical": "https://www2.cbn.com/news/world/eu-agency-rare-clots-possibly-linked-astrazeneca-shot", "encoding": "utf-8"}, "image": null, "domain": "www2.cbn.com", "title": "EU Agency: Rare Clots Possibly Linked to AstraZeneca Shot", "cleaned_text": "LONDON (AP) - The European Union's drug said Wednesday that it found a \"possible link\" between the AstraZeneca coronavirus vaccine and a rare clotting disorder but recommended that vaccinations continue in adults, saying the benefits of the shot still outweigh risks.\n\nThe European Medicines Agency described the clots as \"very rare\" side effects. It said most of the cases reported have occurred in women under 60 within two weeks of vaccination - but based on the currently available evidence, it was not able to identify specific risk factors. Experts reviewed several dozen cases that came mainly from Europe and the United Kingdom, where around 25 million people have received the AstraZeneca vaccine.\n\n\"The reported cases of unusual blood clotting following vaccination with the AstraZeneca vaccine should be listed as possible side effects of the vaccine,\" said Emer Cooke, the agency's executive director.\n\nBut it placed no new age restrictions on using the vaccine in people 18 and over, as some countries have done.\n\n\"The risk of mortality from COVID is much greater than the risk of mortality from these side effects.,\" Cooke said.\n\nThe EMA, the World Health Organization, and numerous other health authorities have said repeatedly that the AstraZeneca vaccine is safe and effective and that the protection it offers against COVID-19 outweighs the small risks of rare blood clots - a message the EMA repeated Wednesday.\n\nThe announcement could have far-reaching effects on the use of the shot that is key to global efforts to end the pandemic.\n\nThe EMA is particularly focused on two types of rare blood clots: one that appears in multiple blood vessels and another that occurs in a vein that drains blood from the brain. It also evaluated reports of people who had low levels of blood platelets, which puts them at risk of severe bleeding.\n\nAs recently as last week, the EMA said \"there is no evidence that would support restricting the use of this vaccine in any population\" - a response to several countries doing just that - though an expert said more brain clots were being reported than would be expected.\n\nIn March, more than a dozen countries, mostly in Europe, suspended their use of AstraZeneca over the blood clot issue. Most restarted - some with age restrictions - after the EMA said countries should continue using the potentially life-saving vaccine.\n\nThe suspensions were seen as particularly damaging for AstraZeneca because they came after repeated missteps in how the company reported data on the vaccine's effectiveness and concerns over how well its shot worked in older people. That has led to frequently changing advice in some countries on who can take the vaccine, raising worries that AstraZeneca's credibility could be permanently damaged, spurring more vaccine hesitancy, and prolonging the pandemic.\n\nDr. Peter English, who formerly chaired the British Medical Association's Public Health Medicine Committee, said the back-and-forth over the AstraZeneca vaccine globally could have serious consequences.\n\n\"We can't afford not to use this vaccine if we are going to end the pandemic,\" he said.\n\nThat's because the vaccine is cheaper and easier to store than many others, is critical to Europe's immunization campaign and a pillar of the U.N.-backed program known as COVAX that aims to get vaccines to some of the world's poorest countries. It has been endorsed for use in more than 50 countries, including by the 27-nation EU and WHO. U.S. authorities are still evaluating the vaccine.\n\nThe governor of Italy's northern Veneto region had said earlier Wednesday that any decision to change the guidance on AstraZeneca would cause major disruptions to immunizations - at a time when Europe is already struggling to ramp them up - and could create more confusion about the shot.\n\n\"If they do like Germany, and allow Astra Zeneca only to people over 65, that would be absurd. Before it was only for people under 55. Put yourself in the place of citizens, it is hard to understand anything,\" Luca Zaia told reporters on Wednesday.\n\nThe latest suspension of AstraZeneca came in Spain's Castilla y León region, where health chief Verónica Casado said Wednesday that \"the principle of prudence\" drove her to put a temporary hold on the vaccine that she still backed as being both effective and necessary.\n\n\"If there are in fact individuals of a certain age group that could have a higher risk (of clotting) then we need to adjust its use,\" Casado told Spanish public radio. \"We are not questioning AstraZeneca. We need all the vaccines possible to reach the goal of 70% of the adult population.\"\n\nFrench health authorities said they, too, were awaiting EMA's conclusions and would follow the agency's recommendations, especially for the 500,000 people who have received a first dose of AstraZeneca.\n\nEven officials in Asia said they were keen to hear the EMA's decision. On Wednesday, South Korea said it would temporarily suspend the use of AstraZeneca's vaccine in people 60 and younger. In that age group, the country is only currently vaccinating health workers and people in long-term care settings.\n\nThe Korea Disease Control and Prevention Agency said it would also pause a vaccine rollout to school nurses and teachers that was to begin on Thursday while awaiting the outcome of the EMA's review.\n\nEnglish, the former chair of the British drug regulator, said that even rare, serious side effects are seen with established vaccines and that policymakers often decide that bigger public health goals warrants their use, citing the polio vaccine as an example. For every million doses that are given of the oral polio vaccine, about one child is paralyzed from the live virus contained in the vaccine.\n\nOn Tuesday, AstraZeneca and Oxford University, which developed the vaccine, paused a study of the shot in children while the U.K. regulator evaluates the link between the shot and rare blood clots in adults.\n\nCopyright 2021 by The Associated Press. All rights reserved.\n\nREAD: What You Need to Know About the Leading Coronavirus Vaccines", "opengraph": {"site_name": "CBN", "type": "article", "url": "https://www2.cbn.com/news/world/eu-agency-rare-clots-possibly-linked-astrazeneca-shot", "title": "EU Agency: Rare Clots Possibly Linked to AstraZeneca Shot", "description": "The European Union's drug said Wednesday that it found a \"possible link\" between the AstraZeneca coronavirus vaccine and a rare clotting disorder but recommended that vaccinations continue in adults, saying the benefits of the shot still outweigh risks.", "image": "https://www2.cbn.com/sites/default/files/media/slider/images/astrazenecawarning_hdv_0.jpg", "updated_time": "2021-04-07T14:37:56-0400", "article:section": "CBN | News", "article:tag": "Not Selected", "article:published_time": "2021-04-07T14:45:00-0400", "article:modified_time": "2021-04-07T14:37:56-0400"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www1.cbn.com/cbnnews/2021/february/the-differences-between-some-leading-coronavirus-vaccines"], "authors": [], "publish_date": "2021-04-07T14:45:00-0400"}