{"result_id": "067044", "URL": "https://sentinel.christianscience.com/shared/view/nx21p222u0?s=e", "timestamp": "2023-04-25 14:42:43 CEST+0200", "meta": {"description": "THE\n following account of an interview with the Rev. Mary Baker G. Eddy, Discoverer and Founder of Christian Science, appeared in the New York Herald, May I, 1901. The report will be read with interest by the many readers of the Sentinel, and the honest investigator of Christian Science will find that many false rumors which have come to his ears are without foundation. The Herald&#039;s report of the interview was as follows:—", "lang": "en", "keywords": "", "favicon": "/bundles/mugosentineldigital/images/apple-touch-icon.png", "canonical": "https://sentinel.christianscience.com/shared/view/nx21p222u0?s=e", "encoding": "utf-8"}, "image": null, "domain": "sentinel.christianscience.com", "title": "Mrs. Eddy Talks / Christian Science Sentinel", "cleaned_text": "This interview was later republished in The First Church of Christ, Scientist, and Miscellany: My. 341:17-346:17\n\nTHE following account of an interview with the Rev. Mary Baker G. Eddy, Discoverer and Founder of Christian Science, appeared in the New York Herald, May I, 1901. The report will be read with interest by the many readers of the Sentinel, and the honest investigator of Christian Science will find that many false rumors which have come to his ears are without foundation.\n\nThe Herald's report of the interview was as follows:—\n\nCONCORD, N. H., Tuesday, April 30, 1901.—Christian Science has been so much to the fore of late that unusual public interest centres in the personality of Mrs. Mary Baker Eddy, the Founder of the cult, and in her opinions on the matters which have brought her followers in opposition to state laws and the public opinion behind those laws. More than that, unkind rumors, started doubtless by the unfriendly, have made Mrs. Eddy a myth. She died long ago, said some; she is living but bedridden, said others, and her place is taken by another woman whenever it is a question of a public appearance.\n\nTo settle both these rumors at one stroke was the object of a call at Pleasant View, her handsome home near here. The granting of interviews is not usual. Mrs. Eddy's house would be overrun with reporters, and the followers of Christian Science itself would be present in growing numbers. Hence it was a special favor that Mrs. Eddy received the Herald correspondent. It had been raining all day and was damp without. The change from the misty air outside to the pleasant warmth within the ample, richly furnished house was agreeable. The house represents only a part of Mrs. Eddy's wealth, resulting from the sale of her books. It contains hundreds of costly objects, sent to her with heartfelt good wishes by her \"children in Christ.\"\n\nSeated in the large parlor, I became aware of a white-haired lady slowly descending the stairs. She entered with a gracious smile, walking uprightly and with light step, and after a kindly greeting took a seat on a sofa. It was Mrs. Eddy.\n\nWhile the lady in a clear but not loud voice was telling how she had sought light upon the matter of seeing me, and what had induced her at last to reach a favorable conclusion, let me say first of all that the lady was Mrs. Eddy indeed. There was no mistaking that. Older in years, white haired and frailer, but Mrs. Eddy herself. The likeness to the portraits of twenty years ago, so often seen in reproductions, was unmistakable. There is no mistaking certain lines that depend upon the osseous structure; there is no mistaking the eyes—those eyes the shade of which is so hard to catch, whether blue gray or grayish brown, and which are always bright. And when I say frail, let it not be understood that I mean weak, for weak she was not. Well preserved age is not uncommon now, and Mrs. Eddy seemed very well preserved.\n\nLater, when we were snugly seated in the other smaller parlor across the hall, which serves as a library, Mrs. Eddy sat back to be questioned. She seemed to think that I would want to know about her lawsuit with the Messrs. Woodbury of Boston, but was not anxious to discuss it. It would come on in a couple of weeks, and it had occupied some of her attention, but would we not talk of more fundamental matter?\n\n\"The continuity of the Church of Christ, Scientist,\" she said, in her clear voice, \"is assured. It is growing wonderfully. It will embrace all the churches, one by one because in it alone is the perfecting of man stated Scientifically.\"\n\n\"How will it be governed after all now concerned in its government shall have passed on?\"\n\n\"It will evolve Scientifically. Its essence is evangelical. Its government will develop as it progresses.\"\n\n\"Will there be a hierarchy, or will it be directed by a single earthly ruler?\"\n\n\"In time its present rules of service and present rulership will advance nearer perfection.\"\n\nIt was plain that the answers to questions would be in Mrs. Eddy's own spirit. She has a rapt way of talking, looking large-eyed into space, and works around a question in her own way, reaching an answer often unexpectedly after a prolonged exordium. She explained: \"No present change is contemplated in the rulership. You would ask, perhaps, whether my successor will be a woman or a man. I can answer that. It will be a man.\"\n\n\"Can you name the man?\"\n\n\"I cannot answer that now.\"\n\nHere, then, was the definite statement that Mrs. Eddy's immediate successor would, like herself, be the ruler.\n\n\"I have been called a Pope, but surely I have sought no such distinction. I have simply taught as I learned while healing the sick. It was in 1866 that the light of the Science came first to me. In 1875 I wrote my book. It brought down a shower of abuse upon my head, but it won converts from the first. I followed it up, teaching and organizing, and trust in me grew. I was the mother, but of course the term Pope is used figuratively.\n\n\"A position of authority,\" she went on, \"became necessary. Rules were necessary and I made a code of by-laws, but each one was the fruit of experience and the result of prayer. Intrusting their enforcement to others, I found at one time that they had five churches under discipline. I intervened. Dissensions are dangerous in an infant church. I wrote to each church in tenderness, in exhortation, and in rebuke, and so brought all back to union and love again. If that is to be Pope, then you can judge for yourself. I have even been spoken of as a Christ, but to my understanding of Christ that is impossible. If we say that the sun stands for God, then all his rays collectively stand for Christ, and each separate ray for men and women. God the Father is greater than Christ, but Christ is 'one with the Father,' and so the mystery is Scientifically explained. There can be but one Christ.\"\n\n\"And the soul of man?\"\n\n\"It is not the spirit of God, inhabiting clay withdrawn from it—but God preserving individuality and personality to the end. I hold it absurd to say that when a man dies, the man will be at once better than he was before death. How can it be? The individuality of him must make gradual approaches to Soul's perfection.\"\n\n\"Do you reject utterly the bacteria theory of the propagation of disease?\"\n\n\"Oh,\" with a prolonged inflection, \"entirely. If I harbored that idea about a disease, I should think myself in danger of catching it.\"\n\n\"Then as to the laws—the health laws of the states on the question of infectious and contagious diseases. How does Christian Science stand as to them?\"\n\n\"I say render unto Caesar the things which are Caesar's. We cannot force perfection on the world. Were vaccination of any avail I should tremble for mankind, but knowing it is not and that the fear of catching smallpox is more dangerous than any material infection, I say where vaccination is compulsory let your children be vaccinated and see that your mind is in such a state that by your prayers it will do the children no harm.\n\n\"So long as Christian Scientists obey the laws I don't suppose their mental reservations will be thought to matter much. But every thought tells, and Christian Science will overthrow false knowledge in the end.\"\n\n\"What is your attitude to science in general? Do you oppose it?\"\n\n\"Not,\" with a smile, \"if it is really science.\"\n\n\"Well, electricity, engineering, the telephone, the steam engine—are these too material for Christian Science?\"\n\n\"No, only false science—healing by drugs. I was a sickly child. I was dosed with drugs until they had no effect on me. The doctors said I would live if the drugs could be made to act on me. Then homoeopathy came like blessed relief to me, but I found that when I prescribed pellets without any medication they acted just the same and healed the sick. How could I believe in the science of drugs?\"\n\n\"The work done by the surgeon is the last healing that will be vouchsafed to us or rather attained by us as we near a state of spiritual perfection. At present I am conservative about advice on surgical cases.\"\n\n\"But the pursuit of modern material inventions?\"\n\n\"Oh, we cannot oppose them. They all tend to newer, finer, more etherealized ways of living. They seek the finer essences. They light the way to the Church of Christ. We use them, we make them our figures of speech. They are preparing the way for us.\"\n\nWe talked on many subjects, some only of which are here touched upon, and her views, strictly and always from the standpoint of Christian Science, were continually surprising. She talks as one who has lived with her subject for a lifetime—an ordinary lifetime—and so far from being puzzled by any question, welcomes it as another opportunity for presenting another view of her religion.\n\nThose who have been anticipating nature and declaring Mrs. Eddy non-existent, may learn authoritatively from the Herald that she is in the flesh and in health. Soon after I reached Concord on my return from Pleasant View, Mrs. Eddy's carriage drove into town and made several turns about the court house before returning. She was inside, and as she passed the same expression of looking forward, thinking, thinking, was on her face.", "opengraph": {"image": "https://sentinel.christianscience.com/bundles/mugosentineldigital/images/sentinel_share_logo.png", "title": "Mrs. Eddy Talks / Christian Science Sentinel", "site_name": "Christian Science Sentinel", "type": "article", "article:published_time": "Thu May  9 00:00:00 1901", "article:modified_time": "Wed Jul  6 10:34:03 2016", "article:publisher": "https://www.facebook.com/pages/JSH-Online/298116873586922", "url": "https://sentinel.christianscience.com/shared/view/nx21p222u0?s=e", "description": "THE\n following account of an interview with the Rev. Mary Baker G. Eddy, Discoverer and Founder of Christian Science, appeared in the New York Herald, May I, 1901. The report will be read with interest by the many readers of the Sentinel, and the honest investigator of Christian Science will find that many false rumors which have come to his ears are without foundation. The Herald&#039;s report of the interview was as follows:—"}, "tags": [], "tweets": [], "movies": [], "links": ["https://jsh.christianscience.com/subscribe-with-the-student-discount?icid=mkt:JSH:stu22"], "authors": [], "publish_date": "Thu May  9 00:00:00 1901"}