{"result_id": "067033", "URL": "https://sentinel.christianscience.com/shared/view/yk6zexic44", "timestamp": "2023-04-25 14:42:31 CEST+0200", "meta": {"description": "Usually shadows are associated with disturbance and depression. But one night in a time of sickness and loneliness, a young recruit found a guiding light in the shadows that has helped him ever since.", "lang": "en", "keywords": "", "favicon": "/bundles/mugosentineldigital/images/apple-touch-icon.png", "canonical": "https://sentinel.christianscience.com/shared/view/yk6zexic44", "encoding": "utf-8"}, "image": null, "domain": "sentinel.christianscience.com", "title": "Safe in the shadows / Christian Science Sentinel", "cleaned_text": "Fort Polk, Louisiana, was a bleak place in November of 1969, and that night it looked gloomier than usual. Several men in my barracks were sick. Our company of Army basic trainees had gone through a battery of shots that morning, and we were told that maybe we'd been given bad vaccine.\n\nThat evening we were ordered to line up outside for a physical checkup. I felt confused, mentally darkened. And I began to feel sick myself. The worst part was the feeling that, even in a large training company, I was totally alone.\n\nFloodlights washed the exercise field where we gathered. I walked away from the line into a shadowed area where—strange as it may sound—I felt safer. Not so alone. It was easier to pray in the privacy of darkness. Call it in military jargon, \"a field-expedient closet.\"\n\nInstinctively, as child more than adult, I reached out to God as the Father and Mother of us all, as the friend who's always with us. The words that came to me probably were fewer than those in this paragraph. It was prayer as desire more than plea.\n\nBy later that night I was well. Only a few guys were out of training the next morning, and they were back within a day or two.\n\nI thought of that incident recently, after reading coverage of the growing public concern about the difficulty of preventing further bioterrorist and suicide attacks. A newspaper editorial concluded that \". . . the nation is better off frightened and informed than left happily in the dark\" (The New York Times, \"Life in a Time of Terror,\" October 31, 2001). Some sages say that fear focuses the mind as nothing else does. But what I learned that night during basic training, and what I've learned in my spiritual search since then, tell me that fear is never beneficial. Nor is ignorance ever bliss.\n\nWe can find either fear or comfort in shadows. It all depends on what we believe is there with us—danger or companionship, dimness or the light of the very alive and wellness-bringing Christ.\n\nI felt safe in the shadows because there I sensed the companionship of spiritual power. In that quiet space I could use the medicine I trusted, prayer. I don't remember praying with the 91st Psalm at that moment, but I can see now that I was placing myself \"under the shadow of the Almighty.\"\n\nIt stands to reason that a real Almighty, the all-powerful infinite—understood even to a tiny degree—disallows any other power and removes any effects that may result from believing that evil can have power. That's true whether the sickness is due to contamination or to what medical researchers call the \"nocebo\" effect, the impact of negative thoughts or emotions on health.\n\nIf the Supreme Being really is supreme in our lives, and in the universe, then help is never uncertain or distant. In fact, both disease and moral failings have their roots in some form of belief that there is distance between us and the infinite. Prayer that protects or heals isn't divine intervention. Health-giving inspiration, courage, ideas—they're always pouring our way. What nudges or shakes us awake to the reality of our actual spiritual identity and unbreakable unity with the creator is the Christ, the sum of God's outpouring love and light to humanity.\n\nBut how can we move from specific instances of safety and healing to do something meaningful to counteract global fears and dangers? Can prayer reach terrorists hidden in the shadows of a cave, or in the shadowy webs of people with harmful aims camouflaged by ordinary lives?\n\nI believe that spiritual resources are the only reliable means to find surer safety for all six billion of us. Healing at the macro-level happens as we, one by one, give consent to the power of even a single clear spiritual thought. A groundswell of antidotal love begins with single thoughts of forgiveness. The strength found in international coalitions is amplified in single selfless acts.\n\nDivine intelligence is the source and multiplier of the good that antidotes cruelty. This Mind is the sustaining infinite we crave to know, the Physician whose care is flawless.\n\nWhen I enter a dark house, my battle isn't with the totality of darkness. That's light's job. My struggle is to find and use one switch at a time; to think one clear spiritual thought. As light fills the space, the next switch is easier to find. Darkness can't resist its own elimination, whether it shrouds individual character or organized destructive forces.\n\nThe Psalmist's powerful metaphor of the Almighty's shadow is more than comforting imagery of a caring God. There is individual clarity and an inclusive refuge to be found in turning constantly to God as supreme intelligence. Prayer makes us God-informed, calm in the Almighty's presence, better able to know where danger lies.\n\nOne night several years ago I was walking home, still praying after spending a couple of hours searching for spiritual answers to things that bothered me. I also was connecting the ideas that came to me to community and world problems. That's a way I often pray—connecting what helps me in mind and body to bigger areas of thought. I came to a street corner in shadows. There was no traffic, so I started to cross the intersection. A power I can only explain as God's hand stopped me. An instant later, a bicyclist flew by out of the shadows, right in front of me. We were both saved. A couple of years before this close encounter with a bicycle, I learned a lesson on conflicting mental forces. One day I felt a sharp pain in my chest and back. Woundlike sores appeared on both sides. I prayed for myself, and as I did, I thought of someone I saw regularly who'd expressed open animosity and envy toward me and my wife. I thought, OK, I can return love for hate. That's the Christian demand. But the pain persisted.\n\nFull healing came, and quickly, when I realized that only by being love itself—by seeing clearly the identity of everyone as divine Love's creation—were we all safe and harmless.\n\nWhen the source of danger is invisible spores or viruses, our refuge is the same power that stopped me in my tracks that night and cured me of believing I was a target of hatred. This is the dominion that God gives His spiritual creation \"over every living thing that moveth upon the earth\" (Gen. 1:28). Again, the struggle isn't against mental darkness that uses poisonous agents or against the agents themselves, but against the belief that His power can be less than omnipotent, Her care less than perfect.\n\nIn societies where information is superabundant, where a free press thrives and freedom of movement is the norm, there's concern that those very elements that ordinarily promote good can enable camouflaged \"sleeper\" agents to burrow in and plan harm undetected. Some say the only effective weapon is better intelligence. This includes a more alert public, as well as improved legal surveillance and smarter covert operations. But at the level of our personal response to potential danger, it also means turning to the divine source of intelligence to guide our thinking and action.\n\nIn the Bible, Job's young friend Elihu is dead wrong about Job's being guilty of some hidden flaw, but still gets it right when he speaks of God's power to defend His offspring. Elihu says at one point in the dialogue, \"There is no darkness, nor shadow of death, where the workers of iniquity may hide themselves\" (Job 34:22).\n\nDarkened, ill-willed mentality can't forever hide from the light of the divine central intelligence. This light is also Christ, comforting in presence wherever we are. But it's also focused, laser-like in its ability to expose and transform harmful thinking and acting. It can lead to information that uncovers plots. Eventually it must enlighten darkened, even demented, minds. It's the nature of this sect-free Christ to move everyone within its embrace toward the sustaining intelligence of God, of eternal Love.\n\nJesus faced dense hatred, and hypocrisy that paints the innocent as guilty. Why? Because the full Christ in him uncovered sin, to the discomfort of the sinner. What he said during a time of danger serves today as a promise: \"For there is nothing covered, that shall not be revealed; neither hid, that shall not be known. Therefore whatsoever ye have spoken in darkness shall be heard in the light\" (Luke 12:2, 3).\n\nThere is room for everyone in the Almighty's sheltering shadow, and inexorable light for all who are now held in the grip of mesmeric darkness. The switch is there to be used. And every grace-impelled thought makes a difference in the world.", "opengraph": {"image": "https://sentinel.christianscience.com/bundles/mugosentineldigital/images/sentinel_share_logo.png", "title": "Safe in the shadows / Christian Science Sentinel", "site_name": "Christian Science Sentinel", "type": "article", "article:published_time": "Mon Dec 10 00:00:00 2001", "article:modified_time": "Sun Oct  3 12:45:21 2021", "article:publisher": "https://www.facebook.com/pages/JSH-Online/298116873586922", "article:tag": "shadows", "url": "https://sentinel.christianscience.com/shared/view/yk6zexic44", "description": "Usually shadows are associated with disturbance and depression. But one night in a time of sickness and loneliness, a young recruit found a guiding light in the shadows that has helped him ever since."}, "tags": [], "tweets": [], "movies": [], "links": ["https://jsh.christianscience.com/subscribe-with-the-student-discount?icid=mkt:JSH:stu22", "https://login.concord.christianscience.com/concord3/search/?query=Gen.%201%3A28&book=tfccs.main.hb.kj", "https://login.concord.christianscience.com/concord3/search/?query=Luke%2012%3A2%2C%203&book=tfccs.main.hb.kj"], "authors": [], "publish_date": "Mon Dec 10 00:00:00 2001"}