{"result_id": "067043", "URL": "https://sentinel.christianscience.com/issues/2021/4/123-16/christian-science-and-vaccinations", "timestamp": "2023-04-25 14:42:42 CEST+0200", "meta": {"description": "Published interviews, articles, and letters to newspaper editors in 1900 and 1901 offered a consistent message from Eddy: The practice of her religion was not a threat to public health.", "lang": "en", "keywords": "", "favicon": "/bundles/mugosentineldigital/images/apple-touch-icon.png", "canonical": "https://sentinel.christianscience.com/issues/2021/4/123-16/christian-science-and-vaccinations", "encoding": "utf-8"}, "image": null, "domain": "sentinel.christianscience.com", "title": "Christian Science and vaccinations / Christian Science Sentinel", "cleaned_text": "The following is an excerpt from an article recently published by The Mary Baker Eddy Library. The two-thousand-word article takes a historical look at how the Leader of the Christian Science movement responded to the question of inoculations.\n\nOn March 7, 1900, in a Leavenworth, Kansas, newspaper, Eddy’s guidance to Christian Scientists about vaccination appeared in print. The Christian Scientist parents of seven children who had been kept out of school for over a month because they would not comply with the local school board’s order that all children be vaccinated reversed course. Edward H. Keach, the First Reader of the local Christian Science branch church, explained to the reporter that they had “consulted with Mrs. Eddy of Boston, the [F]ounder of their church, and received the following instructions:\n\n“ ‘Rather than quarrel over being vaccinated, I recommend that, if the law demand an individual to submit to this process, he obey the law; and then appeal to the gospel to save him from any bad results. Whatever belongs to this century, or any epoch, we may safely submit to the providence of God, to common justice, individual rights and governmental usages.’ ”\n\nThis counsel became a key component in statements on vaccination by Eddy and her church. . . . Published interviews, articles, and letters to newspaper editors in 1900 and 1901 offered a consistent message from Eddy: The practice of her religion was not a threat to public health. When required to do so, Christian Scientists and their children would submit to vaccination.\n\nFrom: “Vaccination: what did Eddy say?”\n\nDecember 20, 2020\n\nTo read the full article, scan this code with your phone camera or visit marybakereddylibrary.org/research/what-did-eddy-say-about-vaccination.\n\nThis excerpt is from an article about the century-plus record Christian Scientists have of “respect for public health authorities and conscientious obedience to the laws of the land, including those requiring vaccination.” The article was published by the Manager of the Christian Science Committees on Publication.\n\nMost of our church members normally rely on prayer for healing. It’s a deeply considered spiritual practice and way of life that has meant a lot to us over the years. So we’ve appreciated vaccination exemptions and sought to use them conscientiously and responsibly when they have been granted.\n\nOn the other hand, our practice isn’t a dogmatic thing. Church members are free to make their own choices on all life decisions in obedience to the law, including whether or not to vaccinate their children. These aren’t decisions imposed by their church.\n\nThe public controversy over vaccination has produced strong opinions—and strong divisions—on the competing concerns of public health and toleration of diversity. Whatever the right answer may be for any community, Christian Scientists hope that their long experience as a religious minority working in cooperation with society’s majority might point to the possibility of resolutions based on mutual respect and understanding in the best interest of all.\n\nFrom: “A Christian Science perspective on vaccination and public health”\n\nTo read the full article, scan this code with your phone camera or visit christianscience.com/press-room/a-christian-science-perspective-on-vaccination-and-public-health.", "opengraph": {"image": "https://sentinel.christianscience.comhttps://sentinel.christianscience.com/var/sentinel/storage/images/media/images/qr-pg5-stl_20210419_vaccination/13435040-1-eng-US/qr-pg5-stl_20210419_vaccination.jpg", "title": "Christian Science and vaccinations / Christian Science Sentinel", "site_name": "Christian Science Sentinel", "type": "article", "article:published_time": "Mon Apr 19 00:00:00 2021", "article:modified_time": "Wed May 12 00:09:31 2021", "article:publisher": "https://www.facebook.com/pages/JSH-Online/298116873586922", "url": "https://sentinel.christianscience.com/issues/2021/4/123-16/christian-science-and-vaccinations", "description": "Published interviews, articles, and letters to newspaper editors in 1900 and 1901 offered a consistent message from Eddy: The practice of her religion was not a threat to public health."}, "tags": [], "tweets": [], "movies": [], "links": ["https://marybakereddylibrary.org/research/what-did-eddy-say-about-vaccination", "https://christianscience.com/press-room/a-christian-science-perspective-on-vaccination-and-public-health"], "authors": [], "publish_date": "Mon Apr 19 00:00:00 2021"}