{"result_id": "067046", "URL": "https://sentinel.christianscience.com/shared/view/14j04g6aunc", "timestamp": "2023-04-25 14:42:45 CEST+0200", "meta": {"description": "You can be fearless amid threats of an epidemic, letting God influence your thinking toward health and immunity.", "lang": "en", "keywords": "", "favicon": "/bundles/mugosentineldigital/images/apple-touch-icon.png", "canonical": "https://sentinel.christianscience.com/shared/view/14j04g6aunc", "encoding": "utf-8"}, "image": null, "domain": "sentinel.christianscience.com", "title": "SAFE 'IN THE SECRET PLACE' / Christian Science Sentinel", "cleaned_text": "TO THOSE \"that dwelleth in the secret place of the most High,\" the Bible promises, \"there shall no evil befall thee, neither shall any plague come nigh thy dwelling\" (Ps. 91:1, 10). Dwelling in this secret and sacred place, not running in and out—not claiming that God's goodness fills all space and then speculating on something else \"out there\"—is the way to stay safe from any contagion.\n\nIt has always interested me that flu, influenza (Italian for \"influence\"), got its name because it was thought the disease was influenced by the stars. While I don't feel influenced by stars, this makes me ask, What is influencing me? Are news stories of an avian or bird flu pandemic convincing me that a pandemic of some kind cannot be prevented? That it is preordained?\n\nMany of those who are actively engaged in preventing an avian flu pandemic today are thinking in terms of vaccines and quarantines. The President of the United States called vaccine makers to the White House to forward this process. But the prediction is that there are not currently enough doses of vaccine to prevent an avian flu from spreading. Furthermore, next year's strain, experts say, will change enough that this formula will not be effective. Vaccines will have to be thrown out and financial loss incurred. As for quarantines, many perceive that option as impossible in this vast, fast-moving global society, even if armies were called upon to enforce travel and other restrictions.\n\nSo what's the answer? Many people who trust God and prayer feel that there is right now both a cure and a preventative for influenza and all other diseases—and that this cure and preventative is as present and universal as the stars in the heavens, and far more influential. And it is no small fact that domestic fowl and wild birds are also God's creatures, in need of our prayers to escape the supposedly deadly virus. Prayer for their safety and well-being, as for any other needs for physical healing, should not be trivialized or ignored.\n\nIn the Preface of Science and Health with Key to the Scriptures, Mary Baker Eddy wrote: \"The physical healing of Christian Science results now, as in Jesus' time, from the operation of divine Principle, before which sin and disease lose their reality in human consciousness and disappear as naturally and as necessarily as darkness gives place to light and sin to reformation. Now, as then, these mighty works are not supernatural, but supremely natural. They are the sign of Immanuel, or 'God with us,'—a divine influence ever present in human consciousness ...\" (p. xi).\n\nThis \"divine influence\" is far closer than the stars. It is God, or infinite Mind, who is always with us and always influencing our thinking toward health and immunity.\n\nRecently a friend told me of a healing she'd had of the flu. She and her mother were to catch a train and go into a nearby city. She felt quite ill and just wanted to stay in bed. Her mother asked her, \"Do you think staying in bed is going to heal you, or do you think the truth will heal you?\"\n\nMy friend got herself out of bed, dressed, and onto the train, still feeling quite ill, and she didn't feel any better when they got off the train and into a cab. Then she began thinking about something she'd heard a Christian Science lecturer once say: \"God is right here, right now.\" She reasoned with herself, If God is right here, right now, how can the flu be here, or anything besides God's goodness and health? She asked herself if she believed this or not. And then the thought came to her, \"I have no choice. God is my Mind and knows only the truth, and I can't know anything but the truth.\" She said that right there in the cab she had an instantaneous healing. All the flu symptoms were gone, and she felt marvelous.\n\nI love this healing because it illustrates the fact that this divine influence truly is ever present in human consciousness. This is the grand influence that can crowd out the dark suggestions and fears aroused by present concerns. Instead of being troubled by the attention that a possible influenza pandemic is receiving, perhaps it would help to be grateful for being alerted to pray—to be urged to heed more the divine influence, and to dwell mentally on what it means that God is ever with us. This prayerful dwelling is the secret place that has room for everyone.\n\nLooking back at my earlier quotation from Science and Health, it's helpful to remember that this divine influence is called \"Immanuel.\" The Bible prophesies, \"Behold, a virgin shall conceive, and bear a son, and shall call his name Immanuel\" (Isa. 7:14). In the next chapter, the prophet points to the universal nature of this prophecy: \"... and the stretching out of his wings shall fill the breadth of thy land, O Immanuel\" (8:8).\n\nThis universal reality of Immanuel, or \"God with us,\" assures us that everyone everywhere can be rightly influenced to feel the safety of divine Love's presence. Fears of disease outbreaks as well as of natural disasters threaten to fill our days with dismay. But at any moment, if fears or actual events have suggested that we're separated from God, we can enter that \"secret place of the most High ... the Almighty,\" and be delivered from harm, understanding that Immanuel, or God with us, is a forever fact—and a for-everyone fact.\n\nImmanuel is another name for Christ, which the life of Jesus exemplified. In fact, the Isaiah prophecy is perceived as foretelling the birth of Jesus, who so fully represented Immanuel that he is called the Christ, or Christ Jesus. In Christian Science, Christ is defined in part this way: \"Christ is the true idea voicing good, the divine message from God to men speaking to the human consciousness\" (Science and Health, p. 332).\n\nThe message of Immanuel, or Christ, is ever speaking to us, and is as available as our very next thought. We can be fearless when influenza, or widespread contagion of any kind, is foreseen as inevitable. Keeping thought filled with the recognition that God is right here, right now, and that this God is our Mind—as my friend did—we will be not only increasingly safe from infection, but also able to help others find their freedom.\n\nMy husband was only a little beyond babyhood when he and his parents were exposed to the 1918 influenza pandemic and became ill. According to my mother-in-law, they had great difficulty finding anyone who could help them. She said everyone was afraid of catching the flu, which was proving fatal in many instances.\n\nOne woman, however, agreed to come, and my mother-in-law wondered why this woman was so fearless. They discovered that she was a Christian Scientist, although they knew nothing of her religion. My mother-in-law often spoke of this woman as someone who did not believe in death or destruction of any kind as God-ordained. Obviously, this woman was motivated by Christlike caring, and knew that God was with her and would protect her from contagion.\n\nI was once advised, \"Look at error only long enough to deny it.\" I have added, \"and no longer.\" Right now we are being called upon to look at a possible influenza pandemic for the purpose of denying its inevitability.\n\nImmanuel, or God's Christ with us, is universal and inevitable, both as cure and preventative. It is indeed a divine influence to be recognized as our own true consciousness.\n\nIn order to keep one's thoughts filled with an awareness of \"God with us,\" many thinkers find this counsel for members of The First Church of Christ, Scientist, particularly helpful: \"The members of this Church should daily watch and pray to be delivered from all evil, from prophesying, judging, condemning, counseling, influencing or being influenced erroneously\" (Church Manual, p. 40).\n\nMentally defended through this kind of watching and praying, we won't accept erroneous prophecies, nor be influenced contrary to the divine influence that is ever present in our true dwelling place. No matter how global a threat may be, it need have no more influence over anyone's life than do the stars. And the divine truths that influence us correctly are even more numerous than the panoply of lights that fill the night sky. |CSS", "opengraph": {"image": "https://sentinel.christianscience.com/bundles/mugosentineldigital/images/sentinel_share_logo.png", "title": "SAFE 'IN THE SECRET PLACE' / Christian Science Sentinel", "site_name": "Christian Science Sentinel", "type": "article", "article:published_time": "Mon Nov 14 00:00:00 2005", "article:modified_time": "Wed Sep 14 05:27:10 2022", "article:publisher": "https://www.facebook.com/pages/JSH-Online/298116873586922", "url": "https://sentinel.christianscience.com/shared/view/14j04g6aunc", "description": "You can be fearless amid threats of an epidemic, letting God influence your thinking toward health and immunity."}, "tags": [], "tweets": [], "movies": [], "links": ["https://login.concord.christianscience.com/concord3/search/?query=Ps.%2091%3A1%2C%2010&book=tfccs.main.hb.kj", "https://jsh.christianscience.com/subscribe-with-the-student-discount?icid=mkt:JSH:stu22", "https://login.concord.christianscience.com/concord3/search/?query=SH%20xi%3A9%E2%80%9318&book=tfccs.main.sh", "https://login.concord.christianscience.com/concord3/search/?query=Isa.%207%3A14&book=tfccs.main.hb.kj", "https://login.concord.christianscience.com/concord3/search/?query=SH%20332%3A9%E2%80%9311%20Christ&book=tfccs.main.sh", "https://login.concord.christianscience.com/concord3/search/?query=Man.%2040%3A11&book=tfccs.main.ma"], "authors": [], "publish_date": "Mon Nov 14 00:00:00 2005"}