{"result_id": "067036", "URL": "https://sentinel.christianscience.com/shared/view/26h79moo11c?s=e", "timestamp": "2023-04-25 14:42:34 CEST+0200", "meta": {"description": "I had discovered that Christian Science is not verified by words but by healing.", "lang": "en", "keywords": "", "favicon": "/bundles/mugosentineldigital/images/apple-touch-icon.png", "canonical": "https://sentinel.christianscience.com/shared/view/26h79moo11c?s=e", "encoding": "utf-8"}, "image": null, "domain": "sentinel.christianscience.com", "title": "No more chest pains / Christian Science Sentinel", "cleaned_text": "Many years ago I was traveling across North America by bus to begin a university course on the West Coast. Before leaving England, I’d had occasional chest pains, but when I boarded the bus, these pains were continual.\n\nThis was before cellphones or email, so I sent an airmail letter to a practitioner in the United Kingdom to ask for her prayers. On the bus, I studied the chapter “Christian Science Practice” in Science and Health with Key to the Scriptures by Mary Baker Eddy. Praying with the ideas in this chapter gave me peace, but my physical condition didn’t change, and it was difficult to get comfortable. I couldn’t lean against the window to sleep because it felt as if something heavy in my chest was causing pressure, so I had to sit completely upright.\n\nWhen we drove through the Rocky Mountains, I was enthralled by the grandeur of the snowy peaks and mountain lakes. I forgot about the physical condition, and in the afternoon I suddenly realized that all symptoms had gone. I’d been totally free all day! I was in awe at this instantaneous healing.\n\nThe practitioner later told me that this was when she had received my letter. She shared that she had prayed to know that I am an individual, spiritual idea, governed by God, divine Mind, and that I am sure of this relationship and completely satisfied with it. Therefore, materially based thinking—for instance, my own doubts, opinions of other people, or even human hereditary background that I wasn’t aware of—could have no effect on me.\n\nAfter that, I built on the practitioner’s treatment when praying about other conditions in my life. Understanding that I am a spiritual idea governed by God—Mind, infinite good—makes it clear that I can experience no harmful material effects.\n\nThis healing was also a turning point in my understanding of Christian Science. I had talked with the practitioner before leaving the UK, but at that time, my academic thinking resisted some of the ideas she shared. I thought I’d be deceiving myself to accept as true something I couldn’t confirm with the material senses. It was therefore significant that in her treatment, the practitioner included the fact that I am sure of my relationship with divine Mind and completely satisfied with it. That was key for me, because I had not been accepting this truth myself. But when I thought about how completely my symptoms had gone, I became not only satisfied with my relationship to God but thrilled by it! I had discovered that Christian Science is not verified by words but by healing.\n\nThe symptoms were similar to those that had troubled my grandmother in her later years. And I experienced a recurrence of some of them when I reached the age at which she had passed on. But this time—while traveling on a different bus in a different country—I was able to pray and understand for myself that I am a spiritual idea, free from material effects. The symptoms faded and have never returned in the twenty years since.", "opengraph": {"image": "https://sentinel.christianscience.com/bundles/mugosentineldigital/images/sentinel_share_logo.png", "title": "No more chest pains / Christian Science Sentinel", "site_name": "Christian Science Sentinel", "type": "article", "article:published_time": "Mon Aug 30 00:00:00 2021", "article:modified_time": "Wed Jan 19 15:00:04 2022", "article:publisher": "https://www.facebook.com/pages/JSH-Online/298116873586922", "url": "https://sentinel.christianscience.com/shared/view/26h79moo11c?s=e", "description": "I had discovered that Christian Science is not verified by words but by healing. "}, "tags": [], "tweets": [], "movies": [], "links": ["https://login.concord.christianscience.com/concord3/search/?query=SH%20362%3A-11&book=tfccs.main.sh", "https://jsh.christianscience.com/subscribe-with-the-student-discount?icid=mkt:JSH:stu22"], "authors": [], "publish_date": "Mon Aug 30 00:00:00 2021"}