{"result_id": "067016", "URL": "https://jsh.christianscience.com/a-healing-response-to-a-world-in-need/immunity", "timestamp": "2023-04-25 14:42:15 CEST+0200", "meta": {"description": "JSH-Online is the official website of The Christian Science Journal, Christian Science Sentinel, and The Herald of Christian Science.", "lang": "en", "keywords": "", "favicon": "/extension/jsh/design/standard/images/favicon.ico", "canonical": "https://jsh.christianscience.com/a-healing-response-to-a-world-in-need/immunity", "encoding": "utf-8"}, "image": null, "domain": "jsh.christianscience.com", "title": "Immunity", "cleaned_text": "Ever since I was young, traveling on an airplane has represented a thrilling adventure. As a child, airports were my favorite place to be. But as an adult, I’ve found that there have been times whe...\n\nOne morning I awoke with flu symptoms and was unable to study the weekly Christian Science Bible Lesson (found in the Christian Science Quarterly) as I usually do each morning. I stayed in bed and...\n\nI know someone who used to schedule his sick days in advance because he expected to catch some type of illness every year about the same time. Then he learned about Christian Science, and his exper...\n\nEven though it was written in 1883, this timeless article by Mary Baker Eddy from her Miscellaneous Writings 1883–1896 offers a concise yet thorough analysis of what’s going on durin...\n\nBringing our prayers to the threat of contagion “Today only! Free flu shots!”The bright banners snapping in the late fall breeze seemed to be effective. Lots of cars were turning in at the large chain drugstore near our home. As I drove past, it...\n\nIt always happened like this: A family member or friend had a cold, and then I had a cold. It seemed almost inevitable. However, from the time I was little, I had been learning something diffe...\n\nI WAS CHECKING OUT a room I had booked for a conference. The refrigerator contained something rather unexpected—some unused flu vaccine. When I contacted the building's business office, they told m...\n\nThe immunity that divine Love gives \"A Calm, Christian state of mind is a better preventive of contagion than a drug, or than any other possible sanative method; and the 'perfect Love' that 'casteth out fear' is a sure defense,&...\n\nWhen authorities predict that incidence of a certain disease may reach epidemic proportions, what is the responsibility of Christian Scientists? It is fundamental to the practice of Christian Scie...", "opengraph": {"title": "Immunity\n - JSH-Online", "url": "https://jsh.christianscience.com/a-healing-response-to-a-world-in-need/immunity", "site_name": "JSH-Online", "image": "https://jsh.christianscience.com/extension/jsh/design/ezflow/images/facebook_badge.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://sentinel.christianscience.com/shared/view/bwzci2gg9o", "https://sentinel.christianscience.com/shared/view/bwzci2g8pg", "https://sentinel.christianscience.com/shared/view/7z6z1e62uo", "https://sentinel.christianscience.com/shared/view/31yi7jrvuk", "https://sentinel.christianscience.com/shared/view/7z6z1e501g", "https://sentinel.christianscience.com/shared/view/132bh7m5no", "https://sentinel.christianscience.com/shared/view/yk6zvguxiw", "https://sentinel.christianscience.com/shared/view/1ga8mmcrhog", "https://journal.christianscience.com/shared/view/pp61wn6e44"], "authors": [], "publish_date": null}