{"result_id": "067029", "URL": "https://sentinel.christianscience.com/shared/view/f5vwzyl1re", "timestamp": "2023-04-25 14:42:24 CEST+0200", "meta": {"description": "1. Stop talking and thinking about contagious diseases. 2. On arising in the morning repeat the Lord&#039;s Prayer in the spirit of holiness.", "lang": "en", "keywords": "", "favicon": "/bundles/mugosentineldigital/images/apple-touch-icon.png", "canonical": "https://sentinel.christianscience.com/shared/view/f5vwzyl1re", "encoding": "utf-8"}, "image": null, "domain": "sentinel.christianscience.com", "title": "Cure for Epidemics / Christian Science Sentinel", "cleaned_text": "2. On arising in the morning repeat the Lord's Prayer in the spirit of holiness.\n\n3. As soon as breakfast is over, before taking up your duties of the day, take your Bible and carefully read the Ninety-first Psalm, knowing \"that God is, and that He is a rewarder of them that diligently seek Him.\" You might linger over the lines of this beautiful Psalm: \"He that dwelleth in the secret place of the most High shall abide under the shadow of the Almighty. I will say of the Lord, He is my refuge and my fortress: my God; in him will I trust. Surely he shall deliver thee from the snare of the fowler and from the noisome pestilence. He shall cover thee with his feathers, and under his wings shalt thou trust: His truth shall be thy shield and buckler. . . . Because thou hast made the Lord, which is my refuge, even the most High, thy habitation ; there shall no evil befall thee, neither shall any plague come nigh thy dwelling.\" (You will observe that David said, \" His truth shall be thy shield and buckler.\" Evidently David had more faith in God's protecting power than he had in vaccine virus and poisonous lotions.)\n\n4. When conversation or thoughts about disease and contagion come to you during the day, think over the inspiring words you read in the morning.\n\n5. In the evening read the twenty-third Psalm, re-read the Ninety-first Psalm, repeat the Lord's Prayer, and take care above all, to observe the first of the Ten Commandments, \"Thou shalt have no other gods before me.\" If you observe this commandment \"in spirit and in truth,\" you will not let disease of any name or nature become the chief in your thought and conversation.\n\nIt is but just to state that we got the inspiration for this prevention and cure of disease, from the writings and teachings of Rev. Mary Baker G. Eddy, Discoverer and Founder of Christian Science, and have found this mode of treatment of infinite value in whatever case it has been applied.\n\nIt has been asked what Christian Scientists will do in a time of contagion. This is what one Christian Scientist has done to direct the thoughts of the people into higher and healthier channels. If there is anything pernicious in this advice we hope it will be pointed out to us.", "opengraph": {"image": "https://sentinel.christianscience.com/bundles/mugosentineldigital/images/sentinel_share_logo.png", "title": "Cure for Epidemics / Christian Science Sentinel", "site_name": "Christian Science Sentinel", "type": "article", "article:published_time": "Thu Mar 16 00:00:00 1899", "article:modified_time": "Mon Apr  5 16:31:05 2021", "article:publisher": "https://www.facebook.com/pages/JSH-Online/298116873586922", "article:tag": "prevention", "url": "https://sentinel.christianscience.com/shared/view/f5vwzyl1re", "description": "1. Stop talking and thinking about contagious diseases. 2. On arising in the morning repeat the Lord&#039;s Prayer in the spirit of holiness."}, "tags": [], "tweets": [], "movies": [], "links": ["https://jsh.christianscience.com/subscribe-with-the-student-discount?icid=mkt:JSH:stu22"], "authors": [], "publish_date": "Thu Mar 16 00:00:00 1899"}