{"result_id": "067025", "URL": "https://sentinel.christianscience.com/layout/set/print/issues/2014/5/116-21/letters", "timestamp": "2023-04-25 14:42:21 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/extension/sentinelnew/design/sentinelnew/images/favicon.ico", "canonical": "https://sentinel.christianscience.com/layout/set/print/issues/2014/5/116-21/letters", "encoding": null}, "image": null, "domain": "sentinel.christianscience.com", "title": "Landing Page / Christian Science Sentinel", "cleaned_text": "Being pursued by substance is such a freeing concept. I love it because it speaks to me of the eternal nature of substance. It simply cannot start and stop!\n\nOur Christian Science Reading Room staff were moved by the question on the cover of the April 7, 2014, Sentinel: “Have you forgiven Judas?” We enlarged the cover to go in our window next to a large poster, “Christ is Risen.” Our Reading Room is located in a busy downtown city center in Oakland.\n\nA Nigerian gentleman walked by one day, visiting the San Francisco Bay area. He spotted the poster “Christ is Risen” and came right in. He said he was so happy to see anything about Jesus in a business area. We offered the April 7 Sentinel to him as a welcome gift. He read the cover and said to the effect: “Isn’t this wonderful? For us it may seem difficult to forgive those who hurt us, but imagine how much Jesus had to forgive?”\n\nWe enjoyed a five-minute conversation with him and then he had to leave. My co-worker gave the man a copy of The Christian Science Journal since he now lives in Canada, and showed him the listings for Edmonton and Lagos, Nigeria. He was smiling broadly when he left.\n\nMany thanks to Dorothy Estes for this thoughtful article on forgiveness, and for all the careful editing of the periodicals.\n\nI enjoyed the testimony in the March 3, 2014, issue of the Sentinel, “Dog recovers health and bark” [Tori Dell]. I was reminded of an incident several years ago while I was volunteering at an animal shelter. I had taken a dog named Sancho for vaccinations, and he slipped out of his collar in the parking lot. He took off like a shot. I notified two other volunteers, and I began to follow him on foot. He went down one of the busy streets and into a residential area. Every time I got close to Sancho, he would run away. My heart sank as I watched him run across one of the boulevards more than two blocks away.\n\nThen a very strong thought came to me: “Sancho is God’s dog. God loves him and will keep him safe. You don’t have to worry.” As I began walking back, a car passed and honked. When I looked over, there was Sancho in the back seat with his head hanging out the window. The other volunteers told me they’d gotten into their car but they’d had no idea where to look. They were led to drive down one of the streets and saw Sancho. They opened the car door and called to him. He jumped into the back seat. This “healing” came when I was able to let go of personal responsibility and trust Sancho’s care to God.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/layout/set/print/issues/2014/4/116-16/rethinking-the-pursuit-of-wealth", "/layout/set/print/issues/2014/4/116-14/have-you-forgiven-judas", "/layout/set/print/issues/2014/3/116-09/dog-recovers-health-and-bark"], "authors": [], "publish_date": null}