{"result_id": "067020", "URL": "https://sentinel.christianscience.com/shared/view/mqtvhfyyaw", "timestamp": "2023-04-25 14:42:18 CEST+0200", "meta": {"description": "The ultimate protection from contagion and the fear that goes with it comes from improving the quality and condition of one&#039;s thoughts.", "lang": "en", "keywords": "", "favicon": "/bundles/mugosentineldigital/images/apple-touch-icon.png", "canonical": "https://sentinel.christianscience.com/shared/view/mqtvhfyyaw", "encoding": "utf-8"}, "image": null, "domain": "sentinel.christianscience.com", "title": "PRAYER during an epidemic / Christian Science Sentinel", "cleaned_text": "THESE DAYS YOU CAN'T TURN ON THE TV or open a newspaper without hearing about SARS, a virus that's causing concern around the world. Reported to be highly contagious and without a vaccine or known cure, SARS seems a threat to people's health everywhere. People are afraid to fly and have been canceling travel plans. In some cases, governments have prohibited citizens from visiting certain countries because of fears of the epidemic.\n\nThis whole situation reminds me of a time in the early 1990s when I was traveling to my home country, Argentina, to visit family and do some business. Upon landing, the first sights I encountered at the airport were posters and notices all over the place warning about a serious epidemic spreading not only through Buenos Aires, but throughout the rest of the country.\n\nA lot of people were afraid of traveling because of the spread of the disease from city to city. The notices posted everywhere warned about the dangers of coming into contact with other people in public places, such as restaurants and theaters—anywhere people were congregating. They warned that you could catch this virus simply by shaking hands with an infected person. I soon discovered that the whole city was gripped by this fear.\n\nWith talk of this disease constantly in the news, in just a few days I began to feel the very symptoms I'd been hearing about. As soon as I began to feel ill, I recognized that I was going through all the stages that I'd been warned to recognize. But I knew that I could do something constructive about this situation. For a number of years, I had been using prayer as an effective way to solve my problems, including health problems. I knew I could trust the power of prayer to help me this time, too. And though, of course, I wanted to feel better physically, I also wanted to pray for the rest of the community, too.\n\nThe first thing that came to me when I was praying was the fact that God was right there with me and also with everyone around me. I knew that I had to gain the confidence to trust in God's presence and power. I had to feel more deeply God's comfort and protection—the reassurance of His care for me. And I knew that I could feel right there at that moment that I was well. I had to remind myself that being well was the natural way for me to feel, because that was how God had created me. That was how God was maintaining me.\n\nThis change in perspective had to take place in my own thought. I had to replace the images and fears that had been brought before me by all that I had seen and heard. I had to let thoughts from God—thoughts of the normality, health, and harmony that He had given me—fill my thinking. It wasn't a material virus I had to eradicate, but rather, it was the \"infection\" in my thinking. I had allowed my thoughts to become filled—infected—with fears of disease. Now I had to gain my own mental freedom. I could see that by entertaining and mulling over the negative images of disease, I was, in turn, physically experiencing these very images. The connection between my thinking and my physical state was clear to me.\n\nAnother concept that helped my prayer was that I wasn't fighting against a physical enemy. I didn't need to run away from anything or anyone. I only had to reject the images and predictions I was taking in from the news and accept my true identity as a child of God. I needed to see myself as completely whole and immune from disease. Only God's love was surrounding me.\n\nOf course I respected other people's concerns about contagion and didn't go into public places while I was experiencing the symptoms. However, I knew that my ultimate protection came from protecting my thinking and seeing clearly my identity as God's reflection—as a spiritual being, entirely free from harm. I needed to see that I was fully protected with a natural immunity from all evil.\n\nThe Bible was a strong comfort to me during this time. The 91st Psalm, especially, reassured me that I was free from \"the noisome pestilence,\" that I was under His wings, and that His truth was my shield. My prayers led me to include everyone in the community under this same protection that I knew God was providing for me. We were all sharing in this natural immunity from any kind of evil, including disease.\n\nWithin a few days, I was completely free of all symptoms. And when I left Argentina five days after arriving, I noticed that there had been a distinct lessening of talk about the epidemic in the news media. It seemed to me that the images and discussion of disease were much less intrusive than when I'd arrived. I felt that this would help free people from fear. And I am sure that not only my prayers were being answered in this clearly noticeable way, but that the prayers of all those in Buenos Aires were effectively changing the whole environment.\n\nThis experience helped me see that just as light is immune to darkness—no matter how big, fierce, or dense the darkness is—so, too, each of us, as \"the children of light,\" is immune to the darkness of fear, contagion, and disease.\n\nI have also learned that whenever fears of an epidemic arise in a community—or, as in the case of SARS, worldwide—there is a Bible promise everyone can trust. The first epistle of John says, \"Perfect love casteth out fear\" (I John 4:18). This promise is a protection against disease because the more our thought is filled completely with the assurance of divine Love's presence and protection, the more that fears of contagion, and the effects of these fears, are \"cast out\" of our lives. And this protection is for everyone—it is universal. It is immediate and effective for everyone.", "opengraph": {"image": "https://sentinel.christianscience.com/bundles/mugosentineldigital/images/sentinel_share_logo.png", "title": "PRAYER during an epidemic / Christian Science Sentinel", "site_name": "Christian Science Sentinel", "type": "article", "article:published_time": "Mon May 12 00:00:00 2003", "article:modified_time": "Sun Oct  3 13:30:46 2021", "article:publisher": "https://www.facebook.com/pages/JSH-Online/298116873586922", "url": "https://sentinel.christianscience.com/shared/view/mqtvhfyyaw", "description": "The ultimate protection from contagion and the fear that goes with it comes from improving the quality and condition of one&#039;s thoughts."}, "tags": [], "tweets": [], "movies": [], "links": ["https://jsh.christianscience.com/subscribe-with-the-student-discount?icid=mkt:JSH:stu22", "https://login.concord.christianscience.com/concord3/search/?query=I%20John%204%3A18&book=tfccs.main.hb.kj"], "authors": [], "publish_date": "Mon May 12 00:00:00 2003"}