{"result_id": "067045", "URL": "https://directory.christianscience.com/", "timestamp": "2023-04-25 14:42:43 CEST+0200", "meta": {"description": "The Christian Science Directory is a complete listing of all Christian Science Practitioners, Teachers, Churches, Societies, Informal Groups, Reading Rooms, Christian Science Nurses, College Organizations, Committees on Publication, Christian Science Nursing Facilities, Visiting Christian Science Nurse Services, and Military Chaplains worldwide.", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://directory.christianscience.com/", "encoding": "utf-8"}, "image": null, "domain": "directory.christianscience.com", "title": "Christian Science Directory", "cleaned_text": "The Christian Science Directory is provided by The Mother Church, The First Church of Christ, Scientist, in Boston, Massachusetts, USA. The Directory is a listing of Christian Science resources worldwide. The Directory is available online and at the back of each month’s issue of The Christian Science Journal. Learn more about the resources listed in the Directory on our About Page. To learn more about the Church of Christ, Scientist, visit ChristianScience.com.\n\nAdvertisers in the Christian Science Directory are self-employed or operate independently of The Mother Church* and have provided their contact information solely for the purpose of offering their services. Please be respectful and use their contact information only for this purpose.\n\nThe personal data and contact information provided by Directory advertisers may be protected by laws governing privacy, data protection, and commercial messages.\n\nBy using the Directory, you agree not to collect any email addresses from the Directory in order to send unsolicited commercial email messages. The advertisers in the Directory do not consent to receive commercial email messages at the addresses listed. However, advertisers do consent to receive appropriate, relevant communications from churches and societies of The Mother Church.\n\n*Except for The Mother Church itself providing local church services in Boston, its Reading Room, and its Committee on Publication office in Boston.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://journal.christianscience.com", "/about-the-christian-science-directory", "http://christianscience.com/"], "authors": [], "publish_date": null}