{"result_id": "067010", "URL": "https://sentinel.christianscience.com/shared/view/yk6zvguxiw", "timestamp": "2023-04-25 14:41:53 CEST+0200", "meta": {"description": "I WAS CHECKING OUT\n a room I had booked for a conference. The refrigerator contained something rather unexpected—some unused flu vaccine. When I contacted the building&#039;s business office, they told me the room had been used earlier for a program to administer flu shots. The program had to be curtailed because there were problems with the vaccine. When the personnel said they would dispose of the vaccine, I found my heart going out to those who were depending on the inoculations, and who might be afraid of catching the flu. But I also used this incident as an opportunity to think more about what protects people from infectious diseases. That happened some years ago, and since then, I&#039;ve grown more convinced that the ultimate protection is in spirituality.", "lang": "en", "keywords": "", "favicon": "/bundles/mugosentineldigital/images/apple-touch-icon.png", "canonical": "https://sentinel.christianscience.com/shared/view/yk6zvguxiw", "encoding": "utf-8"}, "image": null, "domain": "sentinel.christianscience.com", "title": "PRAYER OFFERS PROTECTION / Christian Science Sentinel", "cleaned_text": "I WAS CHECKING OUT a room I had booked for a conference. The refrigerator contained something rather unexpected—some unused flu vaccine. When I contacted the building's business office, they told me the room had been used earlier for a program to administer flu shots. The program had to be curtailed because there were problems with the vaccine.\n\nWhen the personnel said they would dispose of the vaccine, I found my heart going out to those who were depending on the inoculations, and who might be afraid of catching the flu. But I also used this incident as an opportunity to think more about what protects people from infectious diseases. That happened some years ago, and since then, I've grown more convinced that the ultimate protection is in spirituality.\n\nThe Bible advises that turning to God frees us from various diseases. One such promise is in the 91st Psalm: \"Because thou hast made the Lord, which is my refuge, even the most High, thy habitation; there shall no evil befall thee, neither shall any plague come nigh thy dwelling\" (Ps. 91:9, 10). Making God our \"habitation\" involves consciously dwelling in what the psalm earlier describes as \"the secret place of the most High\"—in other words, keeping one's thoughts trained on the truth that God protects His creation from all harm.\n\nThe group I was preparing to meet with was seeking ways to stay mentally and spiritually in this secret place. Like so many other people throughout the ages, they found assurance in the 23rd Psalm, which concludes, \"Surely goodness and mercy shall follow me all the days of my life: and I will dwell in the house of the Lord for ever.\" Mary Baker Eddy, the author of Science and Health, interpreted the latter half of that sentence this way: \"I will dwell in the house [the consciousness] of [love ] for ever\" (p. 578). A friend once said that this kind of \"dwelling\" means staying there, not running in and out. Living in Love—in God—and acting as expressions of Love keep us safe.\n\nIn essence, this involves keeping focused on thoughts about God and about ourselves as His good, spiritual creation. Thoughts about ourselves as the children of Love, having safety from all sickness and suffering. Thoughts that say nothing unlike good can enter the secret and sacred dwelling place of prayer, where God is always caring for each of us. A consistent awareness that God is good and is All can keep us and other people safe, including at the times when an epidemic is forecast. Whether or not a person has had a flu shot, prayer offers protection.\n\nDuring the 1918 flu pandemic, many Christian Scientists were healed through prayer (see box, p. 9). At that time, my mother-in-law and her family became too ill to care for themselves. As I was told, a Christian Scientist, confident in her understanding that disease couldn't harm her, cared for them—made meals, fed them, cleaned their home—without becoming ill herself. That has always served as an inspiring reminder to me of what relying on God can accomplish for oneself and for other people.\n\nI remember that when the group I mentioned earlier met in that conference room, their willingness to trust God's power to keep humankind both well and good shone through their comments. Our exploration of God as Love yielded a conviction that God never sends anything that is unhealthful or unlike good. Lots of people in our area were praying at that time. And I feel that all our prayers helped prevent an epidemic of flu despite the lack of usable vaccine.\n\nSo today, instead of being afraid, I've been using this season's shortages of vaccine as a wake-up call to pray—to dwell more consistently in the consciousness of Love.", "opengraph": {"image": "https://sentinel.christianscience.com/bundles/mugosentineldigital/images/sentinel_share_logo.png", "title": "PRAYER OFFERS PROTECTION / Christian Science Sentinel", "site_name": "Christian Science Sentinel", "type": "article", "article:published_time": "Mon Dec  6 00:00:00 2004", "article:modified_time": "Mon Apr 12 22:09:23 2021", "article:publisher": "https://www.facebook.com/pages/JSH-Online/298116873586922", "article:tag": "secret place of the most high", "url": "https://sentinel.christianscience.com/shared/view/yk6zvguxiw", "description": "I WAS CHECKING OUT\n a room I had booked for a conference. The refrigerator contained something rather unexpected—some unused flu vaccine. When I contacted the building&#039;s business office, they told me the room had been used earlier for a program to administer flu shots. The program had to be curtailed because there were problems with the vaccine. When the personnel said they would dispose of the vaccine, I found my heart going out to those who were depending on the inoculations, and who might be afraid of catching the flu. But I also used this incident as an opportunity to think more about what protects people from infectious diseases. That happened some years ago, and since then, I&#039;ve grown more convinced that the ultimate protection is in spirituality."}, "tags": [], "tweets": [], "movies": [], "links": ["https://jsh.christianscience.com/subscribe-with-the-student-discount?icid=mkt:JSH:stu22", "https://login.concord.christianscience.com/concord3/search/?query=Ps.%2091%3A9%2C%2010&book=tfccs.main.hb.kj", "https://login.concord.christianscience.com/concord3/search/?query=SH%20578%3A16&book=tfccs.main.sh", "/issues/2004/12/106-49/christian-scientists-and-the-1918-flu-pandemic"], "authors": [], "publish_date": "Mon Dec  6 00:00:00 2004"}