{"result_id": "067040", "URL": "https://jsh.christianscience.com/layout/set/print/monitor-dnb/how-ebola-might-be-conquered", "timestamp": "2023-04-25 14:42:36 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/extension/jsh/design/standard/images/favicon.ico", "canonical": "https://jsh.christianscience.com/layout/set/print/monitor-dnb/how-ebola-might-be-conquered", "encoding": null}, "image": null, "domain": "jsh.christianscience.com", "title": "Home / JSH-Online", "cleaned_text": "The lives saved since the world put aside fear and indifference to reach out a helping hand to West Africa likely number in the thousands. The new vaccine from that newly engaged world could expand that number many times over.\n\nIn America, fear of the virus mixed with misunderstanding and myth about its operation and origins in West Africa. “Fears of West Africa as the white man’s grave, a view dating back to the 18th century … survive to this day,” noted a column in the New England Journal of Medicine. Ebola, the author said, thrives in the “toxic ecology” of “fears arising from difference and ignorance.”\n\nThe arc of last year’s outbreak in West Africa tracked global engagement. A massive global response has largely reined in the virus, but the world took too long to notice, Doctors Without Borders said. “Months were wasted and lives were lost.”\n\nOne year removed from the largest Ebola outbreak in history, scientists are hopeful of a “remarkable” breakthrough. Recent trials of a new Ebola vaccine have shown 100 percent protection among those immunized.\n\nWhy Turks, Kurds may want to keep wounded peace process alive\n\nThe easy analysis about the clashes between Turkey and Kurdish PKK militants has been that the peace process is finished. But both sides have benefited from peace.\n\nTurkey’s Kurdish peace process is quickly unraveling, with Ankara currently putting more effort into crippling Kurdish militants than stepping up its role in the US-led alliance against Islamic State (IS).\n\nThe government’s real agenda may be to reverse Kurdish gains at home and in the region. Yet neither party to Turkey's gravely wounded peace process seem hesitant to call a time of death – and a review of past events suggest neither want to kill it off altogether.\n\nLast Tuesday, President Recep Tayyip Erdogan declared it impossible for Turkey to continue engaging with Kurdish militants. But that harsh message was toned down just hours later when a spokesman for his political party said the peace process could resume if “terrorist elements” laid down their weapons and left Turkey.\n\nMeanwhile, Turkish F-16 fighter jets have relentlessly pounded Kurdistan Worker’s Party (PKK) camps and depots in the mountains of northern Iraq and targeted Kurdish militants in the southeastern province of Sirnak. And Turkey has arrested hundreds of “terrorism” suspects, the majority accused of links to the PKK. On Sunday, two Turkey soldiers died in a suicide attack at a military police station.\n\nWhile the outlawed PKK says the airstrikes, which coincided with the launch of similar attacks against IS, render the peace process meaningless, it has yet to formally pull out.\n\nBoth parties stand to lose from the collapse of the peace process, which opened up a space for Kurdish identity, language, and political activism, analysts say.\n\nThe grace shown by the members of Emanuel AME Church in Charleston, S.C., revealed the power of faith to promote racial harmony under the most trying conditions. Other congregations believe they also have a crucial role to play.\n\nA hum sweeps across the sanctuary, drifting above the bowed heads of huddled prayer groups, beyond the joined hands of blacks and whites. Earnest whispers carry words like harmony and forgiveness. Outside, a police car idles as day fades to dusk at Oak Mountain Presbyterian Church in Birmingham, Ala.\n\nLess than a week earlier, in a church basement 450 miles away, nine people had been fatally shot during a Bible study class at Emanuel African Methodist Episcopal (AME) Church in Charleston, S.C. But the service here on this June day is not a vigil. It is the product of a bond established months before – between mostly white Oak Mountain and the predominantly black congregation of Urban Hope Community Church.\n\nIn the aftermath of the Charleston shootings, the grace of the members of Emanuel AME showed the power of faith in promoting racial harmony under the most trying conditions. The leaders of Oak Mountain and Urban Hope Community are persuaded that, going forward, churches have a crucial role in bringing that progress to America as a whole.\n\nThat historically has been true, from the abolitionist preachers to the reverends of the civil rights movement. But when the issue is not overthrowing unjust laws but addressing deeper-seated racial perceptions, what can churches do? And can churches focus society as they once did?\n\n“For those on the outside looking in, they’re seeing that the churches can’t even come together,” says Urban Hope member Dion Watts. “That’s something that has been a Goliath – a huge stumbling block. If we can come together on this, the message it will send to the rest of the world will be profound.”\n\nHow should Paris spend its budget? Locals now get to choose.\n\nIn September, Parisians will get to vote directly on how to spend 75 million euros of the city budget, in a bid to tap citizens' knowledge of what their city needs.\n\nFrance might be the model of a centralized state, with its capital’s grip on administrative power near absolute.\n\nBut the city of Paris is undertaking one of the biggest experiments of its kind in putting financial power in the hands of the people.\n\nParisians have been given control of 5 percent of the city’s investment budget, in what leaders tout as the largest “participatory budgeting” experiment in the world – and one they hope will bolster faith in the democratic process.\n\nThe concept of “participatory budgeting,” at its most basic, is to give community members the power to directly decide how to spend part of a public budget, in order to tap into citizens' knowledge as the users of the space they inhabit.\n\n“One of the things you find over and over again is that policymakers and politicians overestimate what they think is their knowledge about citizens’ needs,” says Tiago Peixoto, a global expert in participatory budgeting at the World Bank.\n\nIn all, Parisians have submitted 5,115 projects, and the ones that were technically and legally feasible were unveiled this month. The projects range from grand to granular.\n\nOne calls for Paris’s famed Champs-Elysees to be revitalized, making it more attractive to pedestrians, at a cost of €14.5 million. Another conceives of an “afterlife” for the discarded “love locks” removed from Paris’s iconic bridges this summer. Other ideas include better facilities for state-run daycare, at a cost of €500,000, and new collaborative spaces where the unemployed can go to look for jobs, in part to break the isolation of jobseekers, at a cost of €1 million.\n\nA first-of-its-kind study offers statistical evidence suggesting contagion when it comes to mass shootings. And the study’s authors hypothesize that the national attention on such shootings plays some role in spurring on others.\n\nAs the United States grapples with what seems like a steady drumbeat of deadly mass shootings, concerns have cropped up about whether wall-to-wall news coverage of the killers and their actions may play into their desire for notoriety and encourage similar crimes.\n\nCritics of how media outlets cover such events have been vocal about a need for change. And some point to guidelines for media coverage of suicide, which have been available for more than a decade to help journalists avoid contributing to a “contagion effect” that’s been documented by researchers.\n\nIs it time for similar guidelines for reporting on mass shootings?\n\nThere’s not enough evidence to justify such calls, especially given the constitutional and practical issues involved, some observers say. But overall, this is a wide-open debate, especially since mass shootings are prompted by a complex web of factors that no one claims to fully understand.\n\n“In the high-profile tragedies like mass killings and school shootings ... there was evidence of contagion,” says Sherry Towers, a research professor at Arizona State University in Tempe and the lead author of a new, first-of-its kind study that offers statistical models showing such contagion. “We believe the media may be playing a role, but this requires a lot of further study.”\n\nIn the study, published in the journal PLOS One, mass shootings involving three or fewer deaths did not correlate with a higher probability for more such crimes. But those involving more deaths did, as did the separate category of school shootings. The authors hypothesized that the national attention on significant shootings plays some role in spurring on others.\n\nIn Honduras, a wellspring of new tools to tackle drought\n\nMore than 2 million people living in dry areas in Central America face hunger. Food security is starting to improve in some communities as farmers adopt alternative crops and more efficient water usage.\n\nGumersindo Rodriguez has become accustomed to measuring his family's well-being in inches: of rainfall, of crop growth, and the height of his grandchildren.\n\nAnd by that gauge, the drought that’s afflicted his corner of Central America these past two years is the worst he’s seen. Walking down the steep, rocky patch of farmland behind his house, Mr. Rodriguez points to corn stalks that don't even reach his knees. “Every year it seems to get worse,\" he says.\n\nStill, he is better off than many of his neighbors, thanks to hard work guided by his friend Gabino López Vargas, whose organization helps small-scale farmers adapt to a changing environment. Mr. López and Rodriguez – and scores of others in this increasingly dry region – think they’ve found a way to counter conditions that threaten more than 2 million people in Honduras, Guatemala, El Salvador, and Nicaragua.\n\nIt’s a model based on “harvesting” water, diversifying crops, and avoiding practices like burning farmland between crop cycles. And they’re working to see that their project spreads.\n\nAcross the region, governments and aid agencies that help subsistence farmers survive lean times are struggling to keep up with recurring drought. Some are rolling out improved early warning systems, while farmers are also benefiting from drought-resistant crops.\n\nSubsistence farmers, of which there are roughly 1 million in the so-called dry corridor that runs through Honduras, El Salvador, and Guatemala, are most at risk during droughts. “Food security for families is the number one priority,” says López. “And the key is water. There’s nothing else.”\n\nIn a rare case of finding common cause, thousands of Israelis and Palestinians gathered Saturday in protests. They took to the streets a day after suspected Jewish terrorists set fire to a Palestinian home and burned a toddler to death, presumably to expel more Palestinians from the West Bank and expand Jewish settlements.\n\nThe loss of the child was enough for people on both sides of the Israeli-Palestinian divide to rise up and affirm a basic tenet of their Abrahamic faiths: That innocence is a blessed right and must be protected.\n\nThis moment of unity should not be forgotten. It reflects a search by many religious leaders, whether Jewish, Islamic, or Christian, to define the core doctrine of these sibling Abrahamic faiths.\n\nIn a new book, Jonathan Sacks, the former chief rabbi of the United Kingdom, writes the simplest definition of the Abrahamic faiths is this. “It is not our task to conquer or convert the world or enforce uniformity of belief. It is our task to be a blessing to the world.” The basis for this blessing, he states, is that the Abrahamic faiths have made the claim “that every human being, regardless of color, culture, class or creed, was [created] in the image and likeness of God.”\n\nThe book, “Not in God’s Name: Confronting Religious Violence,” looks at cases in history when this spiritual understanding has challenged religious.\n\nHe says all three monotheistic religions must combat a type of dualism that claims there is not one reality but a grand conflict between two realities, good and evil.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.csmonitor.com/World/Middle-East/2015/0731/Why-Turks-Kurds-may-want-to-keep-wounded-peace-process-alive-video", "http://www.csmonitor.com/USA/Society/2015/0801/Can-churches-lead-on-racial-harmony", "http://www.csmonitor.com/World/Europe/2015/0731/How-should-Paris-spend-its-budget-Locals-now-get-to-choose", "http://www.csmonitor.com/USA/Society/2015/0731/Concern-over-copycat-shooters-has-some-asking-Should-media-coverage-change", "http://www.csmonitor.com/World/Americas/2015/0731/In-Honduras-a-wellspring-of-new-tools-to-tackle-drought", "http://www.csmonitor.com/Commentary/the-monitors-view/2015/0802/A-universal-answer-to-religious-violence"], "authors": [], "publish_date": null}