{"result_id": "067031", "URL": "https://www.christianscience.com/press-room", "timestamp": "2023-04-25 14:42:29 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-152x152.png", "canonical": "https://www.christianscience.com/press-room", "encoding": "utf-8"}, "image": null, "domain": "www.christianscience.com", "title": "Press room", "cleaned_text": "Concern for public health and safety is something that all responsible people share—including Christian Scientists. Grateful as we are to live in communities where honest differences can be respected, Christian Scientists are also mindful of the obligations all citizens have to respect the rights of others in their communities. Hope. Courage. Resilience. Forgiveness. These words mean more, not less, against a backdrop of war, suffering and violence. The June 6 annual meeting of The First Church of Christ, Scientist, in Boston, Massachusetts highlighted this message. Church members gathered in-person and online to affirm the promise to be found in these enduring qualities of grace. God’s grace enables progress and joy, say Christian Scientists at annual meeting In a year often defined by uncertainty, Christian Scientists gathered at their online annual meeting to acknowledge the ways in which God’s love and mercy have opened paths of progress and joy in individual lives and collective church experience. The meeting was live-streamed to members around the globe on June 7 from The First Church of Christ, Scientist, the church’s headquarters in Boston, Massachusetts.\n\nA comment posted by the Committee on Publication response to the program “Here & Now” on National Public Radio in the U.S. --\n\nAs a Christian Scientist, I’m always grateful for the understanding and respect shown by physicians toward our religious practice, so I particularly appreciate the thoughtful understanding Dr. Ray Barfield seeks to encourage in his medical students toward the varying religious views of those they encounter. I agree with him that the respect needs to be mutual and the listening two-way… Read more\n\nThis letter to the editor was submitted to The Wall Street Journal, in response to an opinion piece that referred to Mary Baker Eddy, the founder of the Church of Christ, Scientist.… Read more\n\nWhy would reasonable people turn to the practice of spiritual healing in today’s high tech, pervasively medical culture? Many automatically assume that Christian Scientists, who have been widely known for their practice of spiritual healing through more than a century, must not be “reasonable people.” Journalists often characterize them as “faith healers” – usually a term of derision implying ignorance and fanatical belief. And yet, this label is seriously misleading, as most such stereotypes are. Christian Scientists are a diverse, substantial religious body. They’re conscientious, thinking people, on the whole. Deep as their religious convictions are, they make their own choices and respect the rights of others to do the same. They appreciate the humanitarian efforts of doctors for those who turn to them. They see Christianity not as a narrow church dogma to be blindly adhered to, but as a way of life that has to be responsibly approached and profoundly thought through. Even in the face of public opposition – Christian Science was banned in Germany under the Nazi regime, for instance – this is the spirit in which Christian Scientists strive to approach the practice of spiritual healing. The study republished here suggests the real reason for Christian Scientists’ continuing devotion to this practice: the actual experience of healing that it has repeatedly brought in their lives. The study carefully quantifies the medical evidence referred to in many thousands of testimonies of healing published in the Christian Science Sentinel and Journal over a twenty-year period. Undertaken in 1989, it wasn’t (and isn’t) an effort to “prove” the truth of Christian Scientists’ faith, but simply to look at a large and challenging body of evidence that is generally ignored in public and academic discussion. Christian Scientists themselves find these healings deeply humbling. We certainly recognize how much more we have to learn. We grieve just as others do when healing does not come. The study simply points to the breadth and scope of healing that has come through this consistent spiritual practice, and why Christian Scientists see such healing as significant beyond their own denomination. Thoughtful people may differ in their views on the ultimate explanation of these experiences, but it’s neither honest nor scientific to dismiss them in a world that, for all its technical advances, still cries out for a deeper understanding of the spiritual sources of healing in every sphere of human life.\n\nThe division of the Christian Science church that engages with members of the media, lawmakers, and the public is known as the Committee on Publication. The Committee is not the publishing arm of the Church, but serves as an informational resource to answer questions and clear up misconceptions about the practice of Christian Science. The Manager of the Committees on Publication, Kevin Ness, guides the Church’s 135 representatives (Committees) throughout the world as they interact with journalists and local lawmakers. Use the directory at the bottom of this page to find a press/legislative contact near you.", "opengraph": {"site_name": "Christian Science", "locale": "en_US", "url": "https://www.christianscience.com/press-room", "ezObjID": "779", "image": "https://www.christianscience.com/var/cscom/storage/images/media/images/masthead-images/press-room-deep-masthead-v2-1300x300/5767-3-eng-US/press-room-deep-masthead-v2-1300x300.jpg?v3.6.88", "image:height": "645", "image:width": "2710", "title": "Press room", "type": "website"}, "tags": ["Find a Sunday School", "Find a Christian Science Nurse", "Find a church", "Find a Reading Room", "Find a Christian Science Organization", "Find a Christian Science Practitioner"], "tweets": [], "movies": [], "links": ["/press-room/questions-and-answers", "/christian-healing-today/how-can-i-be-healed#experiences", "/press-room/how-do-you-see-the-world-experience-press-kit", "/press-room/christian-science-wikipedia-and-american-religious-history", "/press-room/a-christian-science-perspective-on-vaccination-and-public-health", "/press-room/2022-annual-meeting-report", "/press-room/god-s-grace-enables-progress-and-joy-say-christian-scientists-at-annual-meeting", "/press-room/the-respect-mutual-and-the-listening-two-way", "/press-room/the-respect-mutual-and-the-listening-two-way", "/press-room/a-letter-about-mary-baker-eddy", "/press-room/a-letter-about-mary-baker-eddy", "#collapse_9ebc13a6e0-1", "/press-room/a-study-of-christian-science-testimonies-of-healing", "/press-room/a-study-of-christian-science-testimonies-of-healing?download", "#collapse_a9f0f06781-2", "mailto:ComManager@csps.com", "http://directory.christianscience.com/search?query=&manual_location=&distance_select=any&types%5B%5D=committees_on_publication&language=all&searchType=Quick"], "authors": [], "publish_date": null}