{"result_id": "067007", "URL": "https://www.christianscience.com/additional-resources/committee-on-publication/u.s.-federal-office/insurance-and-christian-science", "timestamp": "2023-04-25 14:41:47 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-152x152.png", "canonical": "https://www.christianscience.com/additional-resources/committee-on-publication/u.s.-federal-office/insurance-and-christian-science", "encoding": "utf-8"}, "image": null, "domain": "www.christianscience.com", "title": "Insurance and Christian Science", "cleaned_text": "Various U.S. federal, state, and private health insurance plans provide for the reimbursement of Christian Science nursing care and practitioner treatment. The U.S. Federal Office has been working to increase the availability of insurance options that cover these types of care.\n\nBy clicking on the links below, you can find a sampling of insurance plans we have on record that accommodate Christian Science care.\n\nIf you are aware of changes to any of these plans such that they no longer include Christian Science care services or know of other plans that do that we haven’t listed, please let us know.\n\nNote that this is an informational resource only; you will want to check directly with your insurance provider to learn more about the specific plans and most current coverage information.\n\nDoes the health insurance plan offered by your employer not include Christian Science care services? Write to your employer to ask that Christian Science care services be included as a covered benefit!\n\nThere are many resources available that provide a general overview of Medicare. These include:\n• None https://www.ssa.gov/benefits/medicare/: The Social Security Administration website provides a good general overview of the Medicare program with an emphasis on eligibility and enrollment procedures.\n• None https://www.medicare.gov/: This federal government website provides detailed information on Medicare benefits (including the various parts of Medicare), coverage options, and when and how to enroll.\n• None https://www.shiptacenter.org/: Every State provides free counseling about Medicare and other types of government benefits to individuals who are Medicare eligible. This link leads to a list of contact information for the benefits counseling program in each State.\n• None https://csncommission.org/facilities-organizations/: Christian Science nursing facilities can also be a good source of information about Medicare, including how Medicare pays for care in those facilities under certain circumstances. This link provides contact information for the Christian Science nursing facilities that participate in Medicare. Some questions to consider when navigating Medicare enrollment Question: Do I need to enroll in any or all of the parts of Medicare? The Medicare program has four parts:\n• None Part A: Institutional and inpatient health care, such as hospital, skilled nursing facility and religious nonmedical health care institution (RNHCI) care. (Those Christian Science nursing facilities that participate in Medicare are categorized as RNHCIs under federal law.)\n• None Part B: Outpatient health care, such as x-ray, emergency room visits, laboratory tests, ambulance services, durable medical equipment, and preventive vaccines (including the COVID-19 vaccine if received during the national public health emergency). (Parts A and B are often collectively referred to as “Original Medicare”.)\n• None Part C (Medicare Advantage): Private managed care health insurance plans that replace coverage under Medicare Part A and B. There is no legal requirement to sign up for (enroll in) any or all of the parts of Medicare. As explained below, however, people who do not enroll when they first become eligible* but decide to do so later may be subject to late enrollment penalties. Most people who are receiving Social Security payments when they become Medicare age will be automatically enrolled in Parts A and B of Medicare and receive a Medicare card in the mail. To learn more about Medicare entitlement and enrollment, as well as what to do if you were automatically enrolled but wish to decline, please contact the Social Security Administration. *Under federal law, Medicare is the secondary payer for individuals over 65 who are still covered by an employer group health plan because they or a spouse are currently working. These individuals usually have the option of waiting to enroll in Medicare until their employer-provided coverage ends. Individuals in this situation should check with their employer and the Social Security Administration concerning these rules. Question: Do I want to enroll in Original Medicare (Parts A and B) or a Medicare Advantage plan? Original Medicare and Medicare Advantage are alternatives — you can’t enroll in both at the same time. Under Original Medicare, health care providers are paid directly by the government. Medicare Advantage plans are private insurance plans that provide the same benefits as Original Medicare. They may also offer additional benefits (e.g., vision, dental, gym memberships), and often cost less than Original Medicare. Medicare Advantage plans are required to cover RNHCI (religious nonmedical health care institutions, including participating Christian Science nursing facilities) care under federal law. However, actually obtaining payment for this service has historically been more difficult under Medicare Advantage than under Original Medicare. If I’m considering a Medicare Advantage plan, does the plan I’m interested in refer to coverage of religious nonmedical health care institution (RNHCI) services ? It is important to review the terms and benefits of any health insurance plan you are considering. If coverage of RNHCI (participating Christian Science nursing facilities) services is a motivating factor in your selection of Medicare coverage, it can be particularly helpful to determine whether a Medicare Advantage plan specifically refers to RNHCI coverage in the plan documents. This is because Medicare Advantage plans follow managed care procedures that involve additional rules that do not apply under Original Medicare. For example, you may be required to use “‘in-network” providers or to obtain prior authorization from the plan for inpatient admissions and re-approval for a continued stay. Even if Medicare Advantage plan documents refer to coverage of RNHCI services, whether a particular stay is covered will depend on the individual situation. However, it can be helpful to know about managed care requirements in advance and to be able to point to RNHCI coverage language if you disagree with a plan’s decision that a particular stay at a Medicare-participating Christian Science nursing facility is non-covered. Question: Do I want to enroll in Medicare Part B? Medicare Part B covers outpatient health care services such as emergency room visits, ambulance services, X-rays, physician care, laboratory testing, durable medical equipment, and preventive vaccines (including the COVID-19 vaccine if received during the national public health emergency). A few important considerations with regard to Part B include:\n• None If you do not enroll in Part B when you are initially eligible for Medicare but enroll later, you will be required to pay a late enrollment penalty.\n• None Some forms of insurance coverage (e.g., TRICARE, some employer retiree plans, Medigap policies, Medicare Advantage plans) may require you to be enrolled in Part B.\n• None Some providers have contractual relationships that require them to bill Medicare for covered services provided to someone who is eligible but not enrolled. In this circumstance, Medicare will usually pay for the services, but the individual will be automatically enrolled in Part B and required to pay the late enrollment penalty. Question: If I’m considering a Medicare Advantage plan, does the plan include prescription drug (Part D) coverage? Like Medicare Part B, Medicare Part D has a late enrollment penalty if you don’t enroll during your initial eligibility period but decide to enroll later. Some Medicare Advantage plans include prescription drug coverage but others do not. If you enroll in a Medicare Advantage plan that includes drug coverage and you were not previously enrolled in Part D, you will be assessed a Part D late enrollment penalty. Medigap plans are available to people enrolled in Original Medicare (but not Medicare Advantage). They pay for out-of-pocket costs related to services that are covered by Medicare (e.g., coinsurance, deductibles). The benefits available in Medigap plans are standardized, but the cost and availability of plans vary widely. These plans cost less if purchased at initial enrollment due to certain federal rules; if you are initially enrolled in Original Medicare and later choose to switch to a Medicare Advantage plan, you will be required to drop any Medigap coverage you have. If you later decide to return to Original Medicare and want a Medigap plan again, you will likely end up paying a higher premium for the new Medigap plan.\n\nHealth savings accounts (HSAs) are custodial accounts that can be set up through financial institutions such as banks and credit unions, either directly by an individual or through an employer-sponsored plan. HSAs provide tax benefits to an individual for setting aside money to pay for current and future health care expenses. Tax laws only allow establishment of and contribution to an HSA when the account holder has health coverage through an HSA-compatible health plan (also sometimes referred to as a “high-deductible”, “self-directed”, or “catastrophic” health insurance plan).* Those kinds of plans usually have lower monthly premiums than other health plans do—because the annual deductibles are higher. The motivation behind the HSA-compatible plan is to encourage saving (or investing) of money that would otherwise be spent on health insurance premiums, to give the account holder more discretion in how those dollars are used to pay for immediate or future out-of pocket health care needs. Who can set up an HSA? Generally speaking, if you are covered by an HSA-compatible health plan, you can set up an HSA. Except for some limited exceptions, such as dental, vision, accident, disability and long term care plans, you are not eligible to establish an HSA if you have other health coverage through a non-HSA-compatible health plan, including Medicare. Contributions to the HSA can only be made when the account holder has health coverage through an HSA-compatible health plan. The IRS sets annual contribution limits, and contributions can come from a variety of sources, including account holders, employers, family members, and even from a limited one-time roll-over of IRA funds. These contributions are not taxed, nor are distributions (provided they are used for qualifying health care expenses). If HSA funds are used for non-qualifying expenses before age 65, the account holder not only is obligated to pay regular income tax on the distribution, but is also subject to a penalty for early withdrawal. Once the account holder turns 65, non-qualifying distributions are subject only to regular income tax, without penalty. The determination of what health/medical expenses can be legally paid for by an HSA is governed by Section 213(d) of the Internal Revenue Code, which defines “medical expense” for purposes of income tax deduction to include amounts paid “for the diagnosis, cure, mitigation, treatment, or prevention of disease, or for the purpose of affecting any structure or function of the body.” Accordingly, over the years, payments made by individuals to Christian Science practitioners, Christian Science nurses, and Christian Science nursing facilities that relate to the healing of physical or mental conditions generally have been treated as tax-deductible under Section 213(d) of the Internal Revenue Code. This is consistent with IRS regulations interpreting this section, which approve expenses for “treatments affecting any portion of the body” and for the “prevention or alleviation of a physical or mental defect or illness”, including “hospital” and “nursing services” and “other diagnostic and healing services”. While this would not likely extend to expenses unrelated to a health condition, there appears to be great flexibility for coverage of expenses that directly relate to healing of a physical or mental condition. However, you should not construe this as individual legal advice. Your eligibility to establish and contribute to an HSA, as well as the eligibility of specific health/medical expenses, should be discussed with an attorney, tax advisor, or benefits consultant that is qualified to advise you under your particular tax circumstances. * Please note that some high-deductible coverage is compatible for using in conjunction with a health savings account (HSA) and some is not. If you are interested in pairing with an HSA, you will want to verify that the coverage is an HSA-compatible health plan. It should reference \"HSA\" somewhere in the plan name or description, but you should also verify that", "opengraph": {"site_name": "Christian Science", "locale": "en_US", "url": "https://www.christianscience.com/additional-resources/committee-on-publication/u.s.-federal-office/insurance-and-christian-science", "ezObjID": "1361", "image": "https://www.christianscience.com/var/cscom/storage/images/member-resources/committee-on-publication/u.s.-federal-office/us-federal-banner-masthead/8634-1-eng-US/us-federal-banner-masthead.jpg?v3.6.88", "image:height": "200", "image:width": "1300", "title": "Insurance and Christian Science", "type": "website"}, "tags": ["Find a Sunday School", "Find a Christian Science Nurse", "Find a church", "Find a Reading Room", "Find a Christian Science Organization", "Find a Christian Science Practitioner"], "tweets": [], "movies": [], "links": ["mailto:federal@csps.com", "#collapse_945b2667ed-1", "https://www.ssa.gov/benefits/medicare/", "https://www.medicare.gov/", "https://www.shiptacenter.org/", "https://csncommission.org/facilities-organizations/", "https://www.ssa.gov/benefits/medicare/", "https://www.medicare.gov/your-medicare-costs/part-b-costs/part-b-late-enrollment-penalty", "https://www.medicare.gov/drug-coverage-part-d/costs-for-medicare-drug-coverage/part-d-late-enrollment-penalty", "#collapse_d92a92c1b9-2", "#collapse_4406af3b49-3", "https://www.mycrbg.com/edocuments/2022/HealthPlan/2022_Compass_Rose_Health_Plan_FEHB_Plan_Brochure.pdf", "https://www.geha.com/~/media93/Project/GEHA/GEHA/documents-files/medical/2022/2022-geha-high-and-standard-options-medical-plan-brochure.pdf", "#collapse_fc2c368bc2-4", "#collapse_26ecbfc657-5", "#collapse_7a88de4d3f-6", "mailto:federal@csps.com"], "authors": [], "publish_date": null}