{"result_id": "067041", "URL": "https://sentinel.christianscience.com/shared/view/24i8kuv5nqs", "timestamp": "2023-04-25 14:42:37 CEST+0200", "meta": {"description": "As I watched my son play little league baseball, I rejoiced. Two years earlier, I&#039;d been told by a doctor that he should never play sports again because of a heart condition. At that time, I&#039;d taken my son to the doctor&#039;s office for his school vaccinations. My husband, who is not a Christian Scientist, asked that our children be vaccinated, and I wanted to honor his request.", "lang": "en", "keywords": "", "favicon": "/bundles/mugosentineldigital/images/apple-touch-icon.png", "canonical": "https://sentinel.christianscience.com/shared/view/24i8kuv5nqs", "encoding": "utf-8"}, "image": null, "domain": "sentinel.christianscience.com", "title": "DIAGNOSED HEART MURMUR HEALED / Christian Science Sentinel", "cleaned_text": "As I watched my son play little league baseball, I rejoiced. Two years earlier, I'd been told by a doctor that he should never play sports again because of a heart condition.\n\nAt that time, I'd taken my son to the doctor's office for his school vaccinations. My husband, who is not a Christian Scientist, asked that our children be vaccinated, and I wanted to honor his request.\n\nThe doctor examined my son and, as he was listening to his heart, said, \"Did you know he has a huge heart murmur?\" He then began to tell me all of the physical causes and diseases associated with this condition. He also told me that my son would never be able to participate in sports. Although I appreciated the doctor's concern, all the \"what ifs\" about my child's health came into my thought, and fear set in. At the conclusion of the appointment, the doctor advised me to take my son to a heart specialist for further examination.\n\nOnce I arrived home, I told my husband about the doctor's comments, and we agreed to set up an appointment with a specialist for the following week. In the meantime, I wanted to calm my own fears, so I immediately called Christian Science practitioner for prayerful support. The practitioner and I talked about trusting my child's health to God, his divine Parent. A few hours later, praying with this idea, I headed out of town for my annual Christian Science association meeting.\n\nSince I was away for a few days, I had plenty of time to pray. In fact, I prayed constantly and continued to think about trusting my child's well-being to God wholeheartedly. I felt I had to take a mental stand for my son's perfection. While I was studying the Bible that weekend, I found a passage that states, \"Ask me of things to come concerning my sons\"(Isa. 45:11). The \"me\" in that sentence especially stood out. Before walking into the heart specialist's office the next week, I wanted to feel confident that I did not need a confirmation of health from a doctor, or any other person, about my son. Instead, God would tell me what I needed to know about this child's perfection as His reflection.\n\nI also asked myself some tough questions such as, If my husband came to me and said, \"Let's cancel the doctor's appointment,\" would I be all right with that? At first my answer was a panicky no. But gradually, as I trusted what I was learning about God's care, the answer became a joyous yes. I prayed to know that this experience could be an opportunity to express my God-given capabilities to be a healer, and witness His work in action.\n\nI also prayed to challenge fears and well-known assumptions about human heredity because years ago I'd been told that I had a heart murmur.\n\nOver the years, through my growth and study of Christian Science, any concerns about this condition had naturally disappeared. When I was pregnant with my children, standard exams often included physicians listening to my heart, and no abnormality was ever detected. To me, this had been clear proof of God's healing love.\n\nAnd so, in this case, I prayed to know that my son's true spiritual identity was a direct result of his being God's reflection. I also saw more clearly that my son was not a possession of mine. He did not belong exclusively to me, but was God's child. My son and I had both received our heritage from our Father-Mother God.\n\nSeveral psalms from the Bible inspired me, especially Psalm 119 which is full of references to \"heart,\" such as, \"I will praise thee with uprightness of heart,\" and \"Let my heart be sound in thy statutes\" (verses 7, 80). I also studied Mary Baker Eddy's comments about \"change of heart\" in Miscellaneous Writings 1883-1896. She stated: \". . . there must be a change from the belief that the heart is matter and sustains life, to the understanding that God is our Life, that we exist in Mind, live thereby, and have being. This change of heart would deliver man from heart disease . . .\" (p. 50). Gradually, I began to glimpse the truth in that statement.\n\nAs my spiritual study continued, I realized that God was the real authority on the health of my son. I saw that I wasn't handling a \"heart problem\" but the suggestion that any of God's children could be less than whole, complete, and satisfied. Every time fear would knock on the door of my thought, I would immediately pause and pray to better understand God's allness. My son did not live because his heart beat; rather, his heart beat because he lived.\n\nEvery time those \"what ifs\" crept into my thinking, and nervousness and emotion tried to gain hold, I replaced those suggestions with what I knew to be true about God's constant care. I realized that there would have to be something unknown for me to be nervous. Since God was communicating to me all I needed to know, there was no reason to be nervous.\n\nWhile I studied and prayed, there was no sense of heaviness, which I'd sometimes experienced on previous occasions when I'd prayed about a problem. There was only a constant sense of joy, knowing that I was making progress in understanding the source of my son's health. Before the planned visit to the heart specialist's office, I felt I'd already arrived at the knowledge that my son was completely well.\n\nI took him to see the specialist a week later. After running several tests, doing sonograms and an EKG, the specialist found my son to have a \"sound heart.\" I was grateful to be able to report these results to my husband.\n\nBut the healing hadn't been in hearing the doctor's confirmation that my son didn't have a heart murmur. It had been walking into that doctor's office with the knowledge that God had already confirmed the wholeness and perfection of His son directly to me.", "opengraph": {"image": "https://sentinel.christianscience.com/bundles/mugosentineldigital/images/sentinel_share_logo.png", "title": "DIAGNOSED HEART MURMUR HEALED / Christian Science Sentinel", "site_name": "Christian Science Sentinel", "type": "article", "article:published_time": "Mon Sep  3 00:00:00 2007", "article:modified_time": "Sun Oct  3 14:02:33 2021", "article:publisher": "https://www.facebook.com/pages/JSH-Online/298116873586922", "article:tag": "heart", "url": "https://sentinel.christianscience.com/shared/view/24i8kuv5nqs", "description": "As I watched my son play little league baseball, I rejoiced. Two years earlier, I&#039;d been told by a doctor that he should never play sports again because of a heart condition. At that time, I&#039;d taken my son to the doctor&#039;s office for his school vaccinations. My husband, who is not a Christian Scientist, asked that our children be vaccinated, and I wanted to honor his request."}, "tags": [], "tweets": [], "movies": [], "links": ["https://jsh.christianscience.com/subscribe-with-the-student-discount?icid=mkt:JSH:stu22", "https://login.concord.christianscience.com/concord3/search/?query=Isa.%2045%3A11&book=tfccs.main.hb.kj"], "authors": [], "publish_date": "Mon Sep  3 00:00:00 2007"}