{"result_id": "067012", "URL": "https://journal.christianscience.com/blogs/church-news/a-message-from-the-christian-science-board-of-directors", "timestamp": "2023-04-25 14:41:56 CEST+0200", "meta": {"description": "A message from the Christian Science Board of Directors.", "lang": "en", "keywords": "", "favicon": "/extension/jsh/design/standard/images/favicon.ico", "canonical": "https://journal.christianscience.com/blogs/church-news/a-message-from-the-christian-science-board-of-directors", "encoding": "utf-8"}, "image": null, "domain": "journal.christianscience.com", "title": "A Message from the Christian Science Board of Directors", "cleaned_text": "Challenging times have a way of focusing thought on what really matters. For us, this has included a deepening sense of how truly grateful we are for each of you, and the comfort we feel in knowing that Christian Scientists all over the world are rededicating themselves to healing during this time of heightened need. We understand better what Paul was feeling when he wrote to the early church at Philippi, “I thank my God upon every remembrance of you” (Phillippians 1:3).\n\nAs you might imagine, over the last several months we’ve been hearing from many members and churches from all over the world. Generally, the focus of what we’ve been hearing has not been about the ways the pandemic has claimed to diminish church, but rather how our members’ and churches’ response to it has enlarged their sense of worship and love for their neighbors. We’ve been hearing about members reaching out to others in the church who had felt isolated, to make sure they had what they needed. We’ve been hearing about churches deciding to temporarily hold services online because of local restrictions and recommendations on gathering, and have found a new sense of dedication and a surprising renewal of interest from those who had been out of touch. Often, this has also led to connecting with people in the community who were looking for a way to worship God during this challenging time. Unsurprisingly, there have also been setbacks and disagreements to work through along the way. But it is fair to say that the overall focus has not just been on how to maintain a sense of church in the midst of highly unusual circumstances, but also on what sort of church community we are building and going to be as we move forward into whatever comes next.\n\nAs efforts to meet the needs of the moment have evolved into efforts to meet the needs of many months, we understand that members are wrestling with new questions. We realize all of us need to be listening for Mind’s direction and that there are no “one size fits all” solutions, yet we thought it might be helpful to share our current thinking about some of the more frequently asked questions we’ve been receiving.\n\nQuestion: “Now that more areas are reopening, our members have differing views about what to do about church services. Should we be following The Mother Church’s example?”\n\nThroughout the pandemic, The Mother Church has sought to do the following: maintain uninterrupted, meaningful worship services; follow our Leader’s counsel to be law abiding; and live the Golden Rule in making sure our actions demonstrate love for our neighbors. We feel that same guidance applies across the Movement, but it will look different in each locale depending on the needs and demands of individual communities. Because The Mother Church is located in Boston, Massachusetts, we have adhered closely to governmental requirements and community concerns about large gatherings, which have to this point prevented us from holding in-person services. The fact that we have felt such a strong sense of the Holy Ghost in our online services is testament to the prayerful support and engagement of members around the world.\n\nWe also recognize that local laws will vary from place to place. Many branch churches have been able to resume services because the size of their gatherings and the local guidelines allow for it in ways that don’t subtract from the spirit of services. We certainly look forward to resuming in-person services at The Mother Church as soon as possible. In the meantime, we will continue to pour in love and attention to our online services and watch for how the ever-present Christ is bringing healing and light to all those who are joining in these opportunities to worship God together.\n\nQuestion: “How does The Mother Church view current governmental restrictions on holding worship services within the context of the guarantees the Constitution of the United States provides for the free exercise of religion? Should The Mother Church consider defying governmental restrictions as an act of defending our right to worship?”\n\nProtecting humanity’s right to worship freely is something we all must stay watchful and vigilant about. In this instance, however, the government is not saying it is illegal to worship as Christian Scientists. On the contrary, the message we’re hearing is about how crucial churches and people of faith are during this time to help support and strengthen society as we face the challenge of a pandemic together. We do not feel we are at odds with the authorities over this issue. Although we cherish the opportunity to gather in person, that in and of itself doesn't define our worship, which is not based on ritual or location, but on the strength of our collective metaphysical activity for our communities and our world. We feel so grateful that Christian Scientists all over the world have been looking for ways to make a healing difference in their communities by allaying fear, praying effectively for those in need, and supporting righteous government. This has included a strong expression of the Golden Rule, of acting toward our neighbors in ways that show practical respect for the concerns many are feeling, while also showing how present challenges can actually be a time for deepening our understanding of God’s presence and power. We’ve been recognizing the importance of guarding against any suggestions about moving forward that are centered on our own interests but disregard those of our neighbors. One of the core challenges of what society is facing right now is the strong argument that what we’re dealing with is separating us from God, from each other, and from our best expression of ourselves. Our great desire is to make sure our steps unite rather than divide. Our periodicals and online activities have been, and will continue to be, a powerful voice to the world of the availability of Jesus’ promised Comforter to bring out wholeness and harmony in our lives.\n\nQuestion: “We’re hearing a lot in the news about an anticipated vaccine. How should Christian Scientists be thinking about this issue?”\n\nWe continue to hope and are working to see that any vaccine being developed for COVID-19 will be offered to the public as an option of individual choice, rather than a mandate of collective will. As always, however, we find our Leader’s words enormously instructive on this issue. See especially The First Church of Christ, Scientist, and Miscellany 219:26–222:32. We are particularly struck by the spirit of calm in her words. She makes it clear that the greatest demand is to rise above any sense of life in matter, which would make people believe that a vaccine could help or harm them. As she says, “Rather than quarrel over vaccination, I recommend, if the law demand, that an individual submit to this process, that he obey the law, and then appeal to the gospel to save him from bad physical results.”\n\nWhile the world may be waiting for certain material advances before it expects to see immunity from disease, Christian Scientists are realizing that right now is the time to be inoculating ourselves from fear, the infection of error, and the sense that disease has power to spread undetected. As Christian Scientists, we do not claim that we aren’t having to work through the same challenges that the rest of the world is facing. But we do insist that in these times, as in all times, an understanding of God as always present and supremely powerful will prove to be more than enough to establish the tangible sense of health and peace so needed now.\n\nQuestion: “What is our Church’s response to the protests for social justice that we are seeing in the United States, as well as many other places in the world?”\n\nAnyone who has carefully studied Christian Science, and been healed by its treatment, realizes deep within themselves the higher, spiritual sense of identity it brings out. There’s no room for anything but the fullest expression of equality and respect for one another within the theology of Christian Science. At the same time, many, including those currently serving at The Mother Church, have been enormously grateful for the opportunity for self-examination and purification that the current calls for greater social justice have brought to light. Some questions we’ve been wrestling with are: Since we know there is no basis for prejudice or division within the teachings of Christian Science, shouldn’t we expect the expression of Church throughout the Movement to reflect the same level of diversity that exists within the wider community? And if we find we are falling short, isn’t this an opportunity to deepen our love for all those in our surrounding neighborhoods so that they don’t just see the words, “All are welcome,” but genuinely feel the love from us that animates those words? Some practical steps we’ve been taking at The Mother Church have included asking the editors of our periodicals to specifically reach out to members of color to let them know how much their experiences and voices are needed right now by all of us. We’ve also been evaluating opportunities to include greater diversity in our hiring practices.\n\nIn our meetings with members over the past several years, we’ve seen that our Church is made up of people of good will who have no desire to express racism or tolerate injustice. We also realize that one of the valuable lessons that has been emerging from recent efforts for reform in our society is a recognition that these evils often operate unseen and undetected unless there are committed efforts to expose and rise above them. The demand on all of us is to make sure the desire in our hearts for everyone to experience equality and justice is truly matched by the actions we take. We believe we have work to do. And we know the foundation of that effort starts with the willingness of each member of this Church to actively and persistently pray to purify our hearts and actions, enabling us to love our neighbor as Jesus loved us.\n\nWe have only just touched on the issues raised in these frequently asked questions. We are always happy to hear from you about what you’re learning and proving of Christian Science on these subjects, especially if you feel there are ways The Mother Church can be better supporting our members and branch churches in their efforts to put their spiritual light on a hill and not under a bushel, as Christ Jesus told us we must do. We wanted to let you know how much your work matters, and to assure you that we are working right alongside you to respond to these opportunities for healing in our world. If ever there was a time when scientific evidence of the effectiveness of Christian healing was needed, this moment certainly qualifies.\n\nTHE CHRISTIAN SCIENCE BOARD OF DIRECTORS\n\nRich Evans, Barbara Fife, Robin Hoagland, Scott Preller, and Keith Wommack", "opengraph": {"title": "A Message from the Christian Science Board of Directors\n - The Christian Science Journal", "url": "https://journal.christianscience.com/blogs/church-news/a-message-from-the-christian-science-board-of-directors", "site_name": "The Christian Science Journal", "type": "article", "article:published_time": "2020-09-16T00:00:00-04:00", "article:modified_time": "2021-04-02T14:54:10-04:00", "article:publisher": "https://www.facebook.com/pages/JSH-Online/298116873586922", "image": "https://journal.christianscience.com/extension/journal/design/journal/images/facebook_badge.jpg", "description": "A message from the Christian Science Board of Directors. "}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2020-09-16T00:00:00-04:00"}