{"result_id": "067023", "URL": "https://journal.christianscience.com/shared/view/19d2xhcj9nc?s=t", "timestamp": "2023-04-25 14:42:20 CEST+0200", "meta": {"description": "“There is No fear in love; but perfect love casteth out fear” (I John 4:18). This timeless assurance that divine Love halts and eliminates fear can be applied to every aspect of our lives. In fact, it’s worth considering whether this biblical promise has practical relevance t...", "lang": "en", "keywords": "", "favicon": "/extension/jsh/design/standard/images/favicon.ico", "canonical": "https://journal.christianscience.com/issues/2020/3/138-03/thinking-about-vaccination-and-public-health", "encoding": "utf-8"}, "image": null, "domain": "journal.christianscience.com", "title": "Thinking about vaccination and public health", "cleaned_text": "“There is No fear in love; but perfect love casteth out fear” (I John 4:18). This timeless assurance that divine Love halts and eliminates fear can be applied to every aspect of our lives. In fact, it’s worth considering whether this biblical promise has practical relevance to the present public health concerns about the spread of contagious disease.\n\nAs society seeks to address these concerns in part through compulsory vaccinations for children, including sorting out whether exceptions should be permitted, the public discussion has tended to force individuals into factions: “pro-vaccination” versus “anti-vaccination,” with strong feelings on both sides based largely on fear.\n\nAlthough no one is exempt from having to deal with this fear, students of Christian Science strive to live lives of trust in God, above the fear of both disease and vaccine. And the elimination of fear through an understanding of God as omnipotent Love is part of the unique contribution Christian Scientists can make to the conversation. Mary Baker Eddy writes, “At a time of contagious disease, Christian Scientists endeavor to rise in consciousness to the true sense of the omnipotence of Life, Truth, and Love, and this great fact in Christian Science realized will stop a contagion” (The First Church of Christ, Scientist, and Miscellany, p. 116).\n\nThis “rise in consciousness,” along with the good that results from it, is available to all because it comes from a spiritual understanding of God as the all-powerful, all-loving creator of all good, as the Bible describes in the first chapter of Genesis. This light-filled creation includes each of us as the perfect, spiritual image and likeness of divine Love, with God-given dominion over “every creeping thing” (Genesis 1:26). This apprehension of our spiritual identity naturally causes each of us to express strength, wisdom, and joy in our lives, and to rise above “creepers” such as fear of disease.\n\nWhen our thought is filled with this understanding of divine Truth and Love, then “sin, disease, and death cannot enter” it, because, as Mary Baker Eddy writes logically, “nothing can be added to the mind already full” (Miscellany, p. 210). Taking this spiritual reasoning one step further, when our thought is filled with divine Truth and Love, it is inoculated with good, which can leave no room for fear or disease.\n\nThis inspired state of thought helps one see that freedom from fear of disease and vaccine alike is not only possible, but natural and reliable. This is evidenced by many examples of the effectiveness of this approach, even in situations where there might have been reason for concern. We also realize that one’s ability to experience healing doesn’t come from religious rights or laws intended to accommodate spiritual healing. Rather, effective spiritual healing itself makes modest space in law for its free practice. Free from fear, both those who choose to be vaccinated, and those who take a religious approach to preventing and treating disease, can proceed with courage in whichever direction they choose in obedience to law, and trust the resolution of any concerns wholly to God.\n\nFor example, a private school attended by a Christian Scientist determined that all students would be required to be vaccinated within one week, despite an accommodation in law generally allowing students to choose not to be vaccinated for religious reasons. Although initially disturbed, the parent of this student saw this requirement as an opportunity to embrace the school in love rather than focus on legal rights, and to pray to heal the fear in the community underlying this issue. The parent met with the dean of the school and respectfully shared her family’s approach to health care in Christian Science. This changed the way the school had been thinking about the issue. The dean indicated she understood that Christian Science was an entire way of life for this family and could see it in the way this student conducted himself. This recognition that spiritual living is substantial and possible in today’s world made a difference. And in the end, the school honored the request for exemption for the remainder of this student’s high school years.\n\nChristian Science impels us to recognize spiritual immunity not for ourselves alone but for the benefit of all humanity. Caring deeply about public health and striving to allay the fears of others as well as ourselves are natural expressions of Jesus’ two great commandments—to love God and to love our neighbor as ourselves. This healing practice embraces Golden Rule ethics: to treat others as one would want to be treated, to respect all differing views, and to abide by the law. This may include being vaccinated where the law requires it. “Rather than quarrel over vaccination,” Mary Baker Eddy writes, “I recommend, if the law demand, that an individual submit to this process, that he obey the law, and then appeal to the gospel to save him from bad physical results” (Miscellany, pp. 219–220).\n\nAnd in an interview she said, “ ‘Render to Caesar the things that are Caesar’s.’… Where vaccination is compulsory, let your children be vaccinated, and see that your mind is in such a state that by your prayers vaccination will do the children no harm” (Miscellany, pp. 344–345).\n\nJesus instructed his disciples, “These signs shall follow them that believe;… if they drink any deadly thing, it shall not hurt them” (Mark 16:17, 18), and in the same way there have been numerous illustrations that in an occasion where vaccination is required, it can be done without negative consequences. For instance, when a Christian Scientist in the United States military was required to be immunized prior to serving overseas, he was unafraid, knowing the vaccines had no power to hurt him any more than the diseases they were designed to prevent. In fact, he proved this requirement to be but a further opportunity to demonstrate God’s ever-present care and protection. Some of his fellow soldiers went to see him receive all of the required immunizations at once, expecting to witness him suffering a reaction to them. But there were no negative effects either at that time or afterward.\n\nWhether it is a concern of contagion, vaccination, or any other fear, Love delivers, and we can proceed with confidence, knowing that we dwell “in the secret place of the most High” and “abide under the shadow of the Almighty.” In this place of safety, above the fray of volatility or public debate, “there shall no evil befall thee, neither shall any plague come nigh thy dwelling. For he shall give his angels charge over thee, to keep thee in all thy ways” (Psalms 91:1, 10, 11).", "opengraph": {"title": "Thinking about vaccination and public health\n - The Christian Science Journal", "url": "https://journal.christianscience.com/shared/view/19d2xhcj9nc?s=f", "site_name": "The Christian Science Journal", "type": "article", "article:published_time": "2020-03-01T00:00:00-05:00", "article:modified_time": "2021-05-10T18:08:20-04:00", "article:publisher": "https://www.facebook.com/pages/JSH-Online/298116873586922", "article:tag": "vaccination", "image": "https://jsh.christianscience.com/extension/journal/design/journal/images/facebook_badge.jpg", "description": "“There is No fear in love; but perfect love casteth out fear” (I John 4:18). This timeless assurance that divine Love halts and eliminates fear can be applied to every aspect of our lives. In fact, it’s worth considering whether this biblical promise has practical relevance t..."}, "tags": [], "tweets": [], "movies": [], "links": ["https://login.concord.christianscience.com/concord3/search/?query=I+John+4%3A18&book=tfccs.main.hb.kj", "https://login.concord.christianscience.com/concord3/search/?query=My.+116%3A2", "https://login.concord.christianscience.com/concord3/search/?query=Genesis+1%3A26&book=tfccs.main.hb.kj", "https://login.concord.christianscience.com/concord3/search/?query=My.+210%3A4%E2%80%935", "https://login.concord.christianscience.com/concord3/search/?query=My.+219%3A29%E2%80%931", "https://login.concord.christianscience.com/concord3/search/?query=My.+344%3A25%E2%80%933", "https://login.concord.christianscience.com/concord3/search/?query=Mark+16%3A17%2C+18&book=tfccs.main.hb.kj", "https://login.concord.christianscience.com/concord3/search/?query=Psalms+91%3A1%2C+10%2C+11&book=tfccs.main.hb.kj"], "authors": [], "publish_date": "2020-03-01T00:00:00-05:00"}