{"result_id": "067017", "URL": "https://www.christianscience.com/press-room/a-christian-science-perspective-on-vaccination-and-public-health", "timestamp": "2023-04-25 14:42:16 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon-152x152.png", "canonical": "https://www.christianscience.com/press-room/a-christian-science-perspective-on-vaccination-and-public-health", "encoding": "utf-8"}, "image": null, "domain": "www.christianscience.com", "title": "A Christian Science perspective on vaccination and public health", "cleaned_text": "Concern for public health and safety is something that all responsible people share—including Christian Scientists. Grateful as we are to live in communities where honest differences can be respected, Christian Scientists are also mindful of the obligations all citizens have to respect the rights of others in their communities.\n\nFor more than a century, our denomination has counseled respect for public health authorities and conscientious obedience to the laws of the land, including those requiring vaccination. Christian Scientists report suspected communicable disease, obey quarantines, and strive to cooperate with measures considered necessary by public health officials. We see this as a matter of basic Golden Rule ethics and New Testament love.\n\nAs for the issue of exemptions for vaccination in the law, Christian Scientists’ perspective on this issue may be unique. In the past, many public officials have been broadly supportive of exemptions when these have not been considered a danger to the wider community. In more recent years, public health concerns relating to vaccinations have risen as exemptions from them have been claimed by larger numbers. Christian Scientists recognize the seriousness of these concerns.\n\nMost of our church members normally rely on prayer for healing. It’s a deeply considered spiritual practice and way of life that has meant a lot to us over the years. So we’ve appreciated vaccination exemptions and sought to use them conscientiously and responsibly, when they have been granted.\n\nOn the other hand, our practice isn’t a dogmatic thing. Church members are free to make their own choices on all life-decisions, in obedience to the law, including whether or not to vaccinate. These aren’t decisions imposed by their church.\n\nThe public controversy over vaccination has produced strong opinions—and strong divisions—on the competing concerns of public health and toleration of diversity. Whatever the right answer may be for any community, Christian Scientists hope that their long experience as a religious minority working in cooperation with society’s majority might point to the possibility of resolutions based on mutual respect and understanding in the best interest of all.\n\nAnd most of all, we hope that our collective care and effort can promote public health and healing to all affected by disease and contagion around the world.\n\nThis article is also available in the following languages: DEUTSCH | ESPAÑOL | FRANÇAIS | ITALIANO | PORTUGUÊS", "opengraph": {"site_name": "Christian Science", "locale": "en_US", "url": "https://www.christianscience.com/press-room/a-christian-science-perspective-on-vaccination-and-public-health", "ezObjID": "10021", "image": "https://www.christianscience.com/var/cscom/storage/images/media/images/masthead-images/generic-banner-light-and-color-reflected-thinkstockphotos-87727786/577-2-eng-US/generic-banner-light-and-color-reflected-thinkstockphotos-87727786.jpg?v3.6.88", "image:height": "200", "image:width": "1300", "title": "A Christian Science perspective on vaccination and public health", "type": "website"}, "tags": ["Find a Sunday School", "Find a Christian Science Nurse", "Find a church", "Find a Reading Room", "Find a Christian Science Organization", "Find a Christian Science Practitioner"], "tweets": [], "movies": [], "links": ["https://www.christianscience.com/de/eine-sichtweise-der-christlichen-wissenschaft-auf-impfungen-und-oeffentliche-gesundheit", "https://www.christianscience.com/es/una-perspectiva-de-la-ciencia-cristiana-sobre-la-vacunacion-y-la-salud-publica", "https://www.christianscience.com/fr/point-de-vue-de-la-science-chretienne-sur-la-vaccination-et-la-sante-publique", "https://www.christianscience.com/it/punto-di-vista-della-scienza-cristiana-sulle-vaccinazioni-e-sulla-salute-pubblica", "https://www.christianscience.com/pt/uma-perspectiva-da-ciencia-crista-sobre-vacinacao-e-saude-publica"], "authors": [], "publish_date": null}