{"result_id": "067018", "URL": "https://www.christianscience.com/de/weitere-ressourcen/komitee-fuer-veroeffentlichungen/u.s.-federal-office/insurance-and-christian-science", "timestamp": "2023-04-25 14:42:17 CEST+0200", "meta": {"description": "", "lang": "de", "keywords": "", "favicon": "/apple-touch-icon-152x152.png", "canonical": "https://www.christianscience.com/de/weitere-ressourcen/komitee-fuer-veroeffentlichungen/u.s.-federal-office/insurance-and-christian-science", "encoding": "utf-8"}, "image": null, "domain": "www.christianscience.com", "title": "Insurance and Christian Science", "cleaned_text": "Various U.S. federal, state, and private health insurance plans provide for the reimbursement of Christian Science nursing care and practitioner treatment. The U.S. Federal Office has been working to increase the availability of insurance options that cover these types of care.\n\nIf you are aware of changes to any of these plans such that they no longer include Christian Science care services or know of other plans that do that we haven’t listed, please let us know.\n• None https://www.ssa.gov/benefits/medicare/: The Social Security Administration website provides a good general overview of the Medicare program with an emphasis on eligibility and enrollment procedures.\n• None https://www.shiptacenter.org/: Every State provides free counseling about Medicare and other types of government benefits to individuals who are Medicare eligible. This link leads to a list of contact information for the benefits counseling program in each State.\n• None https://csncommission.org/facilities-organizations/: Christian Science nursing facilities can also be a good source of information about Medicare, including how Medicare pays for care in those facilities under certain circumstances. This link provides contact information for the Christian Science nursing facilities that participate in Medicare. Question: Do I need to enroll in any or all of the parts of Medicare? There is no legal requirement to sign up for (enroll in) any or all of the parts of Medicare. As explained below, however, people who do not enroll when they first become eligible* but decide to do so later may be subject to late enrollment penalties. Most people who are receiving Social Security payments when they become Medicare age will be automatically enrolled in Parts A and B of Medicare and receive a Medicare card in the mail. To learn more about Medicare entitlement and enrollment, as well as what to do if you were automatically enrolled but wish to decline, please contact the Social Security Administration. *Under federal law, Medicare is the secondary payer for individuals over 65 who are still covered by an employer group health plan because they or a spouse are currently working. These individuals usually have the option of waiting to enroll in Medicare until their employer-provided coverage ends. Individuals in this situation should check with their employer and the Social Security Administration concerning these rules. Original Medicare and Medicare Advantage are alternatives — you can’t enroll in both at the same time. Under Original Medicare, health care providers are paid directly by the government. Medicare Advantage plans are private insurance plans that provide the same benefits as Original Medicare. They may also offer additional benefits (e.g., vision, dental, gym memberships), and often cost less than Original Medicare. Medicare Advantage plans are required to cover RNHCI (religious nonmedical health care institutions, including participating Christian Science nursing facilities) care under federal law. However, actually obtaining payment for this service has historically been more difficult under Medicare Advantage than under Original Medicare. If I’m considering a Medicare Advantage plan, does the plan I’m interested in refer to coverage of religious nonmedical health care institution (RNHCI) services ? It is important to review the terms and benefits of any health insurance plan you are considering. If coverage of RNHCI (participating Christian Science nursing facilities) services is a motivating factor in your selection of Medicare coverage, it can be particularly helpful to determine whether a Medicare Advantage plan specifically refers to RNHCI coverage in the plan documents. This is because Medicare Advantage plans follow managed care procedures that involve additional rules that do not apply under Original Medicare. For example, you may be required to use “‘in-network” providers or to obtain prior authorization from the plan for inpatient admissions and re-approval for a continued stay. Even if Medicare Advantage plan documents refer to coverage of RNHCI services, whether a particular stay is covered will depend on the individual situation. However, it can be helpful to know about managed care requirements in advance and to be able to point to RNHCI coverage language if you disagree with a plan’s decision that a particular stay at a Medicare-participating Christian Science nursing facility is non-covered.\n• None If you do not enroll in Part B when you are initially eligible for Medicare but enroll later, you will be required to pay a late enrollment penalty.\n• None Some providers have contractual relationships that require them to bill Medicare for covered services provided to someone who is eligible but not enrolled. In this circumstance, Medicare will usually pay for the services, but the individual will be automatically enrolled in Part B and required to pay the late enrollment penalty. Like Medicare Part B, Medicare Part D has a late enrollment penalty if you don’t enroll during your initial eligibility period but decide to enroll later. Some Medicare Advantage plans include prescription drug coverage but others do not. If you enroll in a Medicare Advantage plan that includes drug coverage and you were not previously enrolled in Part D, you will be assessed a Part D late enrollment penalty. Medigap plans are available to people enrolled in Original Medicare (but not Medicare Advantage). They pay for out-of-pocket costs related to services that are covered by Medicare (e.g., coinsurance, deductibles). The benefits available in Medigap plans are standardized, but the cost and availability of plans vary widely. These plans cost less if purchased at initial enrollment due to certain federal rules; if you are initially enrolled in Original Medicare and later choose to switch to a Medicare Advantage plan, you will be required to drop any Medigap coverage you have. If you later decide to return to Original Medicare and want a Medigap plan again, you will likely end up paying a higher premium for the new Medigap plan.", "opengraph": {"site_name": "Christliche Wissenschaft", "locale": "de_DE", "locale:alternate": "en_US", "url": "https://www.christianscience.com/de/weitere-ressourcen/komitee-fuer-veroeffentlichungen/u.s.-federal-office/insurance-and-christian-science", "ezObjID": "1361", "image": "https://www.christianscience.com/var/cscom/storage/images/member-resources/committee-on-publication/u.s.-federal-office/us-federal-banner-masthead/8634-1-eng-US/us-federal-banner-masthead.jpg?v3.6.88", "image:height": "200", "image:width": "1300", "title": "Insurance and Christian Science", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["mailto:federal@csps.com", "#collapse_945b2667ed-1", "https://www.ssa.gov/benefits/medicare/", "https://www.medicare.gov/", "https://www.shiptacenter.org/", "https://csncommission.org/facilities-organizations/", "https://www.ssa.gov/benefits/medicare/", "https://www.medicare.gov/your-medicare-costs/part-b-costs/part-b-late-enrollment-penalty", "https://www.medicare.gov/drug-coverage-part-d/costs-for-medicare-drug-coverage/part-d-late-enrollment-penalty", "#collapse_d92a92c1b9-2", "#collapse_4406af3b49-3", "https://www.mycrbg.com/edocuments/2022/HealthPlan/2022_Compass_Rose_Health_Plan_FEHB_Plan_Brochure.pdf", "https://www.geha.com/~/media93/Project/GEHA/GEHA/documents-files/medical/2022/2022-geha-high-and-standard-options-medical-plan-brochure.pdf", "#collapse_fc2c368bc2-4", "#collapse_26ecbfc657-5", "#collapse_7a88de4d3f-6", "mailto:federal@csps.com"], "authors": [], "publish_date": null}