{"result_id": "068033", "URL": "https://www.legitgov.org/fda-assigned-pfizers-covid-vaccine-license-number-months-prior-actually-licensing-it", "timestamp": "2023-04-25 14:43:01 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.legitgov.org/favicon_1.jpg", "canonical": "https://www.legitgov.org/fda-assigned-pfizers-covid-vaccine-license-number-months-prior-actually-licensing-it", "encoding": "utf-8"}, "image": null, "domain": "www.legitgov.org", "title": "FDA assigned Pfizer's COVID vaccine a license number months prior to actually licensing it | CLG News", "cleaned_text": "FDA assigned Pfizer's COVID vaccine a license number months prior to actually licensing it | 6 Jan 2023 | Back in July 2020, when the U.S. Government committed to purchasing millions of doses of Pfizer's Covid vaccines prior to the vaccines actually being authorized for use in the American public, some wondered whether the FDA's \"review\" process for granting Emergency Use Authorization (EUA) was just a mere formality... Based on an FDA document that ICAN's (Informed Consent Action Network) attorneys recently obtained, it appears we can now say that the FDA's post-EUA procedure for determining whether to formally license Pfizer's Covid vaccine was indeed just that - a mere formality. On June 17, 2021, the FDA drafted a memo announcing that it was issuing a license number for Pfizer's Covid vaccine. But the FDA didn't actually license the Pfizer's Covid vaccine until several months later on August 23, 2021. In the document, the FDA makes the stunning admission that, while granting a BLA license number prior to actual licensing was a \"deviation from [the FDA's] normal practice,\" it was doing so to \"facilitate product labeling and distribution\" because it had reviewed \"much\" of the information in Pfizer's licensing application.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://icandecide.org/press-release/fda-assigned-pfizers-covid-vaccine-a-license-number-months-prior-to-actually-licensing-it/", "https://icandecide.org/wp-content/uploads/2023/01/7_BLA_125742-0_06-17-2021_Memo_Other.pdf.pdf", "https://www.fda.gov/news-events/press-announcements/fda-approves-first-covid-19-vaccine"], "authors": [], "publish_date": null}