{"result_id": "068029", "URL": "https://www.legitgov.org/lawyers-us-navy-seals-battle-over-revoked-covid-19-vaccine-mandate", "timestamp": "2023-04-25 14:43:00 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.legitgov.org/favicon_1.jpg", "canonical": "https://www.legitgov.org/lawyers-us-navy-seals-battle-over-revoked-covid-19-vaccine-mandate", "encoding": "utf-8"}, "image": null, "domain": "www.legitgov.org", "title": "Lawyers for U.S., Navy SEALs battle over revoked Covid-19 vaccine mandate | CLG News", "cleaned_text": "Lawyers for U.S., Navy SEALs battle over revoked Covid-19 vaccine mandate --5th Circuit hears arguments on whether to wipe out injunctions against policy Congress overturned last year over Biden's objection | 6 Feb 2023 | A lawyer representing Navy SEALs who do not want to be vaccinated against Covid-19 experimental and often deadly mRNA gene therapy injections told a federal appeals court Monday that their lawsuit over a now-withdrawn vaccine mandate isn't moot even though Congress passed legislation last December ordering the policy canceled. During arguments before the 5th Circuit Court of Appeals in New Orleans, attorney Heather Hacker said the service members still face the possibility of discipline over their refusal to get vaccinated and the government has not ruled out taking vaccination status into account when doling out future assignments. \"Even though the mandate has been repealed, the Navy will continue to use vaccination status as a requirement for the class members to be able to fulfill their job duties,\" Hacker said during the 40-minute argument. \"It's even worse now because the Navy will not even consider the plaintiffs requests for religious accommodation anymore.\" The appeals court issued no immediate rulings Monday.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.politico.com/news/2023/02/06/navy-seals-covid-19-vaccine-mandate-00081437"], "authors": [], "publish_date": null}