{"result_id": "068042", "URL": "https://legitgov.org/madness-vaccine-mandates-colleges-ivy-league-universities-charge-75k-year-are-still-refusing-teach", "timestamp": "2023-04-25 14:43:04 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://legitgov.org/favicon_1.jpg", "canonical": "https://legitgov.org/madness-vaccine-mandates-colleges-ivy-league-universities-charge-75k-year-are-still-refusing-teach", "encoding": "utf-8"}, "image": null, "domain": "legitgov.org", "title": "Madness of vaccine mandates in colleges: Ivy League universities that charge up to $75k a year are STILL refusing to teach students in-person who are not up to date with their Covid vaccines - with Harvard demanding up to FIVE | CLG News", "cleaned_text": "Madness of vaccine mandates in colleges: Ivy League universities that charge up to $75k a year are STILL refusing to teach students in-person who are not up to date with their Covid vaccines - with Harvard demanding up to FIVE --Students must receive a bivalent booster dose on top of their other Covid shots --If they don't without exemption, they will not be able to access in-person classes --Most Americans with bivalent booster are not protected against latest variant | 10 March 2023 | Ivy League schools are still refusing to teach students in-person who are not up to date with their Covid vaccines [mRNA clot shots] -- in a move slammed as \"senseless\" and \"non-scientific.\" Harvard, Yale, Columbia and Pennsylvania have the most stringent mandates that make having the new bivalent booster a condition of entry. This means students at those schools who have already received four of the older shots would still need to get the new shot to continue their studies.The rest of the Ivy League universities demand at least two Covid jabs, with some requiring a booster too. Multiple experts told DailyMail.com the mandate \"does not make sense\" now that evidence shows the vaccines do not prevent transmission on a large scale.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.dailymail.co.uk/health/article-11845207/Harvard-university-requiring-FIVE-Covid-jabs-person-class.html", "https://www.dailymail.co.uk/health/article-11356647/New-bivalent-Covid-vaccines-DONT-people-better-immunity-studies-show.html"], "authors": [], "publish_date": null}