{"result_id": "068007", "URL": "https://www.legitgov.org/over-60-scientists-call-end-covid-19-vaccines-after-documenting-foreign-toxins-damage-blood-and", "timestamp": "2023-04-25 14:42:52 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.legitgov.org/favicon_1.jpg", "canonical": "https://www.legitgov.org/over-60-scientists-call-end-covid-19-vaccines-after-documenting-foreign-toxins-damage-blood-and", "encoding": "utf-8"}, "image": null, "domain": "www.legitgov.org", "title": "Over 60 scientists call for an end to Covid-19 'vaccines' after documenting foreign toxins that damage the blood and impede circulation | CLG News", "cleaned_text": "Over 60 scientists call for an end to Covid-19 'vaccines' after documenting foreign toxins that damage the blood and impede circulation | 17 Feb 2023 | The German Working Group for Covid Vaccine Analysis -- which includes over 60 scientists, doctors, lawyers, and journalists -- published their \"Summary of Preliminary Findings\" on the toxic substances they are finding in covid-19 vaccine samples and the changes they are seeing in the blood samples taken from vaccinated individuals. The scientists \"frequently observed an unusually rapid disintegration of the different types of cells in the vaccinated blood\" and found concerning rouleaux formations of red blood cells specifically in the vaccinated samples. Because of these issues, the Working Group is calling for all covid-19 vaccine programs to end. \"In order to avert a direct and imminent danger to human life and public safety, we ask that the Covid-19 vaccination programmes be discontinued immediately,\" the Group's report stated. The report has been sent to all members of the Lower House of Parliament in Germany and is being investigated by scientists and doctors of various disciplines.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com/2023-02-17-scientists-call-for-end-to-covid19-vaccines.html"], "authors": [], "publish_date": null}