{"result_id": "068026", "URL": "https://www.legitgov.org/harris-required-people-sign-attestation-vaccination-paper-attend-her-florida-speech-reports", "timestamp": "2023-04-25 14:42:59 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.legitgov.org/favicon_1.jpg", "canonical": "https://www.legitgov.org/harris-required-people-sign-attestation-vaccination-paper-attend-her-florida-speech-reports", "encoding": "utf-8"}, "image": null, "domain": "www.legitgov.org", "title": "Harris required people to sign 'attestation of vaccination' paper to attend her Florida 'speech' - reports | CLG News", "cleaned_text": "Harris required people to sign 'attestation of vaccination' paper to attend her Florida 'speech' - reports | 22 Jan 2023 | Kamala Harris required all attendees of her event on Sunday in Tallahassee, Florida, to sign a form confirming whether they have been vaccinated or not, according to reports. The requirement is a counter-approach to Florida Gov. Ron DeSantis's claims that the vaccine is being used as a weapon. The governor plans to propose protections for residents, such as a ban on vaccine and mask requirements, during the next legislative session. The form was titled \"Attestation of Vaccination,\" and it required guest to indicate whether they are unvaccinated, partially vaccinated or vaccinated. The Republican National Committee Research Twitter handle @RNCResearch tweeted about the form on Sunday. \"Kamala Harris made people sign an 'attestation of vaccination' to attend her incoherent speech in Florida today,\" the tweet read. Followers of the page had mixed responses, with some agreeing for the necessity of the form, and many others mocking the requirement on the basis that vaccines do not stop transmission.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.foxnews.com/politics/vp-harris-required-people-sign-attestation-vaccination-paper-attend-florida-speech-reports", "https://twitter.com/RNCResearch/status/1617223609834999809"], "authors": [], "publish_date": null}