{"result_id": "068001", "URL": "https://www.legitgov.org/cdc-confirms-100-reported-covid-19-vaccine-deaths-were-caused-just-5-batches-produced-majority-were", "timestamp": "2023-04-25 14:42:50 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.legitgov.org/favicon_1.jpg", "canonical": "https://www.legitgov.org/cdc-confirms-100-reported-covid-19-vaccine-deaths-were-caused-just-5-batches-produced-majority-were", "encoding": "utf-8"}, "image": null, "domain": "www.legitgov.org", "title": "CDC confirms 100% of reported Covid-19 vaccine deaths were caused by just 5% of batches produced - the majority were sent to Republican 'red' states across the U.S. | CLG News", "cleaned_text": "CDC confirms 100% of reported Covid-19 vaccine deaths were caused by just 5% of batches produced - the majority were sent to Republican 'red' states across the U.S. | 19 Feb 2023 | On October 31, we exclusively revealed how an investigation of the U.S. Vaccine Adverse Event Reporting System (VAERS) found extremely high numbers of adverse reactions and deaths have been reported against specific lot numbers of the Covid-19 vaccines numerous times, meaning deadly batches of the experimental injections have now been identified. That investigation also led to the discovery that 130 different lot numbers of Pfizer Covid-19 vaccine distributed to more than 13 states, harmed on average 639 times more people, hospitalised on average 109 times more people, and killed on average 22 times more people than the 4,289 different lot number of Pfizer vaccine distributed to 12 states or less. However, the most shocking finding of the investigation was that 100% of Covid-19 vaccine deaths reported to VAERS with identified lot numbers had been caused by just 5% of the batches produced. But...we've also discovered that the majority of the deadliest batches were clearly sent to Republican-controlled \"red\" states across the U.S.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.2ndsmartestguyintheworld.com/p/cdc-confirms-100-of-reported-covid", "https://expose-news.com/2021/10/31/100-percent-of-covid-19-vaccine-deaths-caused-by-just-5-percent-of-the-batches-produced/"], "authors": [], "publish_date": null}