{"result_id": "068006", "URL": "https://www.legitgov.org/autopsy-suggests-link-between-covid-19-vaccine-and-encephalitis-brain-case-german-death", "timestamp": "2023-04-25 14:42:52 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.legitgov.org/favicon_1.jpg", "canonical": "https://www.legitgov.org/autopsy-suggests-link-between-covid-19-vaccine-and-encephalitis-brain-case-german-death", "encoding": "utf-8"}, "image": null, "domain": "www.legitgov.org", "title": "Autopsy Suggests Link Between COVID-19 Vaccine and Encephalitis in Brain in Case of German Death | CLG News", "cleaned_text": "Autopsy Suggests Link Between COVID-19 Vaccine and Encephalitis in Brain in Case of German Death | 3 March 2023 | A case study reported in the peer-viewed journal Vaccine found that a patient who had Parkinson's Disease and who died after receiving his third Covid-19 vaccination had developed necrotizing encephalitis in the brain and spike proteins from the vaccine were present in the location of the inflammation. The paper said that while \"numerous\" cases of encephalitis \"have been reported in connection with the gene-based COVID-19 vaccines,\" this was \"the first report to demonstrate the presence of the spike protein within the encephalitic lesions and to attribute it to vaccination rather than infection.\" Dr Michael Mörz, a researcher in Pathology at Hospital Dresden-Friedrichstadt, in Germany, wrote that the family of a 76-year-old patient with Parkinson's Disease, who died three weeks after receiving his third Covid-19 vaccination, had \"requested an autopsy due to ambiguous clinical signs before death.\" The patient was first vaccinated in May 2021 with the Astra Zeneca vector vaccine, followed by two doses of the Pfizer mRNA vaccine in July and December 2021.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://gript.ie/autopsy-suggests-link-between-covid-19-vaccine-and-encephalitis-in-brain/", "https://www.mdpi.com/2076-393X/10/10/1651"], "authors": [], "publish_date": null}