{"result_id": "068021", "URL": "https://www.legitgov.org/florida-surgeon-general-reports-84-increase-cardiac-related-deaths-among-males-18-39-within-28-days", "timestamp": "2023-04-25 14:42:57 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.legitgov.org/favicon_1.jpg", "canonical": "https://www.legitgov.org/florida-surgeon-general-reports-84-increase-cardiac-related-deaths-among-males-18-39-within-28-days", "encoding": "utf-8"}, "image": null, "domain": "www.legitgov.org", "title": "Florida Surgeon General Reports an 84% Increase in Cardiac-Related Deaths Among Males 18-39 Within 28 Days After mRNA Vaccination | CLG News", "cleaned_text": "Florida Surgeon General Reports an 84% Increase in Cardiac-Related Deaths Among Males 18-39 Within 28 Days After mRNA Vaccination --Florida Surgeon General now recommends against the COVID-19 mRNA vaccines for males ages 18-39 years old. | 7 Oct 2022 | Guidance for mRNA COVID-19 Vaccines, October 7, 2022: Florida Surgeon General Joseph A. Ladapo, MD, Ph.D., has reported on an increased cardiac risk of the mRNA COVID-19 vaccine. On Friday, he tweeted: \"Today, we released an analysis on COVID-19 mRNA vaccines the public needs to be aware of. This analysis showed an increased risk of cardiac-related death among men 18-39. FL will not be silent on the truth.\" Quoting from the report: \"The Florida Department of Health (Department) conducted an analysis through a self-controlled case series, which is a technique originally developed to evaluate vaccine safety. This studied mortality risk following mRNA COVID-19 vaccination. This analysis found there is an 84% increase in the relative incidence of cardiac-related death among males 18-39 years old within 28 days following mRNA vaccination. Individuals with preexisting cardiac conditions, such as myocarditis and pericarditis, should take particular caution when considering vaccination and discuss with their health care provider...As such, the Florida Department of Health has issued the following guidance: Based on currently available data, patients should be informed of the possible cardiac complications that can arise after receiving a mRNA COVID-19 vaccine. With a high level of global immunity to COVID-19, the benefit of vaccination is likely outweighed by this abnormally high risk of cardiac- related death among men in this age group.\"", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.legitgov.org/florida-surgeon-general-reports-84-increase-cardiac-related-deaths-among-males-18-39-within-28-days", "https://floridahealthcovid19.gov/wp-content/uploads/2022/10/20221007-guidance-mrna-covid19-vaccines-doc.pdf", "https://twitter.com/FLSurgeonGen/status/1578515633159180289", "https://www.bmj.com/content/354/bmj.i4515"], "authors": [], "publish_date": null}