{"result_id": "069043", "URL": "https://climatechangedispatch.com/the-so-called-science-of-climate-change/", "timestamp": "2023-04-25 14:43:30 CEST+0200", "meta": {"description": "Why do politicians want to hype a nonexistent climate crisis? In a word: power.", "lang": "en", "keywords": "", "favicon": "/wp-content/themes/yoo_avanti_wp/favicon.ico", "canonical": "https://climatechangedispatch.com/the-so-called-science-of-climate-change/", "encoding": "UTF-8"}, "image": null, "domain": "climatechangedispatch.com", "title": "The So-Called 'Science' Of Climate Change", "cleaned_text": "Written by Norman Rogers on . Posted in Latest news\n\nThe science surrounding COVID has been hijacked for political purposes.\n\nPeople who recovered from the disease are pushed to get vaccinated, even though they have a natural immunity that is stronger than vaccine immunity.\n\nPeople are required to wear masks even though masks are essentially useless for preventing infection. People that die are reported as dying of COVID even though they died of something else.\n\nThe government demands that children be vaccinated even though they are naturally resistant to the disease and suffer disturbing side effects from the vaccine. Schools are closed for no good reason.\n\nThe “science” of climate change is also BS. That should be easier to accept after seeing what the government did to COVID science. Why do politicians want to hype a nonexistent climate crisis? In a word: power.\n\nBy claiming that there is an urgent climate crisis, the politicians can spend billions to fight the imaginary foe. Those billions create political allies and reward friends. H.L. Mencken put it nicely in 1918:\n\nThe parade of imaginary environmental catastrophes during the last 70 years is very long.\n\nHere are some books predicting this or that environmental disaster: Our Plundered Planet (1948), Road to Survival (1948), Silent Spring (1962), Famine 1975! (1967), The Population Bomb (1968), The Limits to Growth(1972), An Inconvenient Truth (2006), This Changes Everything: Capitalism vs. Climate (2014), The Uninhabitable Earth: Life After Warming (2019).\n\nRichard Lindzen, one of the most accomplished climate scientists in the world by virtue of his discoveries, does not have to kowtow to the global warming mob.\n\nIn an essay, he pointed out that scientific data that challenge the global warming hypothesis are simply changed. He cites examples of how environmental extremists have infiltrated scientific organizations.\n\nTony Heller, an engineer and geologist, operates a long-running website, Real Climate Science. He specializes in exposing the changed data mentioned by Richard Lindzen.\n\nThe promoters of climate change cherry-pick data when they are not changing it. Heller exposes the lie in the National Climate Assessment that heatwaves are becoming more common.\n\nHe exposes “adjustments” to the U.S. temperature record to bring it into line with climate change predictions.\n\nIn her book The Delinquent Teenager Who Was Mistaken for the World’s Top Climate Expert, Donna Laframboise exposes the International Panel on Climate Change (IPCC), a UN organization that pretends to produce very careful and serious reports on the Earth’s climate.\n\nMost climate hysteria traces back to the IPCC’s reports. The IPCC does not follow its own procedures and is populated by environmental activists with limited scientific credentials.\n\nIts reports are masterful examples of wordy expositions that circle around scientific problems rather than presenting solid ideas backed by facts. The IPCC is a political organization, not a scientific one.\n\nAmusingly, the longtime head of the IPCC, Rajendra Pachauri, an Indian railroad engineer, is also the author of a porn novel: Return to Almora.\n\nThe 75-year-old bureaucrat was forced out of an Indian environmental organization for making persistent and improper advances to young women that worked for him. But, of course, that is irrelevant to his accomplishments as head of the IPCC.\n\nThe predictions of climate doom are based on complex computer models of the Earth’s atmosphere. Kevin E. Trenberth, an accomplished climate scientist at the National Center for Atmospheric Research said this about these models:\n\nThe method of the IPCC is to average together the results from dozens of computer models to make their predictions. They don’t actually say “predictions,” they say “projections,” but the rest of the world sees predictions.\n\nThe model developers try to make their models fit climate history on the assumption that if they fit the past, the models might have predictive value for the future.\n\nThere are a few problems. The models are so complex and have so many adjustable parameters, that fitting the past becomes an exercise in curve fitting.\n\nFurther, the modelers are each permitted to have their own climate history. Parts of climate history that are poorly known, such as aerosols, can be fiddled to make a particular model fit better.\n\nThis method, applied to the stock market, would be to make a model and adjust it so that it explains past gyrations of the market. Then wahoo… the modeler can make billions. It doesn’t work, as the scarcity of mathematicians that are billionaires testifies.\n\nI spent 10 years going to the Fall Meeting of the American Geophysical Union. I spoke with many climate scientists including many who freely admitted in private that global warming is a very dubious enterprise.\n\nI remember a Danish guy who visited beaches in northern Greenland by dog sled. He discovered 6,000-year-old driftwood on a beach always blocked by ice, year-round.\n\nThat was clear evidence that the Arctic Ocean was summer ice-free during a time called the Holocene Optimum.\n\nPresent-day global warmers claim that our coming climate disaster will again make the Arctic Ocean summer ice-free, something that happened 6,000 years ago with no help from SUVs or belching cows.\n\nOf course, the guy was afraid to make too much of his discovery because it challenges the climate doom theory.\n\nThere is no such thing as an early career climate scientist that is skeptical concerning global warming. I actually tried to find one and did a poster at a scientific meeting on the subject.\n\nThe reason is simple. It is not because the science is so clear that only an idiot would question it. It is because our early-career climate scientist would soon be looking for a new job.\n\nInterfering with the flow of money from Washington is grounds for dismissal.\n\nI still believe in science and I feel sorry for all the closeted climate scientists. Like the Soviet geneticists forced to cheer for Lysenkoism, these academics must cheer the global warming racket. They have wives, children, and mortgages.\n\nNorman Rogers writes often on climate. He is the author of the book Dumb Energy about wind and solar energy.", "opengraph": {"locale": "en_US", "type": "article", "title": "The So-Called 'Science' Of Climate Change", "description": "Why do politicians want to hype a nonexistent climate crisis? In a word: power.", "url": "https://climatechangedispatch.com/the-so-called-science-of-climate-change/", "site_name": "Climate Change Dispatch", "article:publisher": "https://www.facebook.com/ccdispatch/", "article:author": "https://www.facebook.com/ccdeditor", "article:published_time": "2021-09-25T16:22:45+00:00", "image": "https://i0.wp.com/climatechangedispatch.com/wp-content/uploads/2021/09/aoc-politicians-green-deal.jpg?fit=1727%2C1280&ssl=1", "image:width": "1727", "image:height": "1280", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://climatechangedispatch.com/covid-vs-climate-models-cloudy-with-a-chance-of-politics/", "https://climatechangedispatch.com/48-of-79-catastrophic-climate-predictions-have-failed-other-31-havent-expired-yet/", "https://arxiv.org/abs/0809.3762", "https://realclimatescience.com/who-is-tony-heller/", "https://realclimatescience.com/", "https://realclimatescience.com/fraud-in-the-national-climate-assessment-part-1/", "https://realclimatescience.com/alterations-to-the-us-temperature-record/", "https://i0.wp.com/climatechangedispatch.com/wp-content/uploads/2021/09/232626_5_.png?ssl=1", "https://amzn.to/3EStyZ1", "https://climatechangedispatch.com/debunked-ipcc-climate-report-is-distortions-fearmongering-and-lies/", "https://climatechangedispatch.com/legacy-un-climate-activist-rajendra-pachauri/", "http://blogs.nature.com/climatefeedback/2007/06/predictions_of_climate.html", "https://climatechangedispatch.com/climate-models-incompetence/", "https://climatechangedispatch.com/climate-model-incompetence/", "https://theconversation.com/the-tragic-story-of-soviet-genetics-shows-the-folly-of-political-meddling-in-science-72580", "https://amzn.to/3lSUizY", "https://www.americanthinker.com/articles/2021/09/the_science_of_climate_change.html", "https://climatechangedispatch.com/the-so-called-science-of-climate-change/?share=twitter", "https://climatechangedispatch.com/the-so-called-science-of-climate-change/?share=facebook", "https://climatechangedispatch.com/the-so-called-science-of-climate-change/?share=custom-1676469285", "https://climatechangedispatch.com/the-so-called-science-of-climate-change/?share=custom-1654795995", "https://climatechangedispatch.com/the-so-called-science-of-climate-change/?share=telegram", "https://climatechangedispatch.com/the-so-called-science-of-climate-change/?share=mastodon", "https://climatechangedispatch.com/the-so-called-science-of-climate-change/?share=custom-1610376378", "mailto:?subject=%5BShared%20Post%5D%20The%20So-Called%20%27Science%27%20Of%20Climate%20Change&body=https%3A%2F%2Fclimatechangedispatch.com%2Fthe-so-called-science-of-climate-change%2F&share=email", "#", "https://climatechangedispatch.com/the-so-called-science-of-climate-change/?share=linkedin", "https://climatechangedispatch.com/the-so-called-science-of-climate-change/?share=reddit", "https://climatechangedispatch.com/the-so-called-science-of-climate-change/?share=skype", "https://climatechangedispatch.com/the-so-called-science-of-climate-change/?share=pinterest", "https://climatechangedispatch.com/the-so-called-science-of-climate-change/?share=jetpack-whatsapp", "https://climatechangedispatch.com/the-so-called-science-of-climate-change/?share=pocket", "https://climatechangedispatch.com/the-so-called-science-of-climate-change/?share=tumblr", "https://climatechangedispatch.com/the-so-called-science-of-climate-change/#print"], "authors": ["ccdeditor"], "publish_date": "2021-09-25T16:22:45+00:00"}