{"result_id": "069038", "URL": "https://climatechangedispatch.com/its-time-to-stop-tormenting-our-kids-with-climate-terrorism/", "timestamp": "2023-04-25 14:43:27 CEST+0200", "meta": {"description": "The facts on the ground put the lie to the climate fear the left inflicts on children.", "lang": "en", "keywords": "", "favicon": "/wp-content/themes/yoo_avanti_wp/favicon.ico", "canonical": "https://climatechangedispatch.com/its-time-to-stop-tormenting-our-kids-with-climate-terrorism/", "encoding": "UTF-8"}, "image": null, "domain": "climatechangedispatch.com", "title": "It's Time To Stop Tormenting Our Kids With Climate Terrorism", "cleaned_text": "Written by Dale Lowdermilk on . Posted in Latest news\n\nIf you are a male or a female (or know someone who is) and have been sleeping too soundly lately, type “billions of children facing climate shock” into Google and you will discover dozens of articles from last week warning that almost half the world’s 2.2 billion children will face, as one article says, “climate-related disasters in their lifetimes, [a UNICEF] report found.”\n\nWith that extremely abstract, unprovable prediction, extreme bureaucratic solutions may seem too harsh, but remember, the “consensus” among successful politicians is, as Governor Cuomo said, “…if it saves one life, it’s worth it…” (Except in nursing homes, of course.)\n\nOur children are constantly being terrorized with theoretical 500-year forecasts, based upon phantom science, and even worse, they’re being taught to mentally “shelter in place” whenever possible.\n\nThis is not a recipe for long-term survival. A rigorous “better-safe-than-sorry” attitude is extremely dangerous in this jungle called the Real World.\n\nFew journalists have the huevos to ask or investigate whether humans are really capable of lowering ocean levels or preventing millions of wildebeest in Africa from emitting methane.\n\nThese reckless antelopes-on-steroids are gassing more than their low-lying meercat neighbors. They’re also suffocating many underground (pre-endangered) species, including isolated colonies of the naked mole rats. Who gnu? (And please, ignore the fact the ruminants and their methane are an important part of the food chain.)\n\nIf mankind is responsible for giving Earth a fever, why was the highest surface temperature ever recorded (134° F) in Death Valley, California, on July 10, 1913? This heatwave happened several months before the invention of smog and commercial aviation.\n\nPollution from a volcanic eruption (Mount Tambora) in April of 1815, cooled the planet enough to create a year without a summer. What Unicorn Factory or government agency is capable of manufacturing a cork large enough to prevent the next cauldron bottle of vintage Mountain Magma from popping?\n\nInstead of inducing constant panic, why can’t liberal idealogues offer sleepless children some comfort by suggesting that plate tectonics, climate cycles, and asteroid impacts are part of a much bigger plan?\n\nAs unsettling it sounds to news desk editors headline writers, uncontrollable scenarios involving Mother Nature’s tempest are…uncontrollable.\n\nAnyone still yearning for insomnia can Google Toba, Taupo, or Krakatoa, then spend an ulcerating hour reviewing the “deadly” weather forecasted (50+ years in advance) from a gestating monster called Yellowstone.\n\nNow, let’s pretend you’re a 7 (or 38) year old, lying awake all night, worrying and struggling to solve pollution, injustice, and extinction problems.\n\nWith these stress-inducing “unfixable” homework assignments, is it any wonder that so many kids (and child-like adults) are consuming record levels of ADHD meds and antidepressants? If Captain Picard were watching this episode unfold, he’d put the entire Enterprise crew on “Borg Alert.”\n\nThere are more than 31,400 American scientists, including 9,000 with PhDs, who’ve signed a petition declaring that rising global temperatures might not be occurring, exclusively, because of humans.\n\nThis list includes astronomers, geologists, meteorologists, and researchers who have put their reputations, careers, and even their lives on the line by merely “suggesting” this issue is not “settled science.”\n\nAnd, despite what enlightened nightly news anchors declare, “science” is not determined by a majority vote or a consensus. Until “wokeness” recently overtook our universities, “science” meant roiling debate, challenges, peer reviews, repeatable results, and verifiable, openly accessible data.\n\nThankfully, for the plants and first animals of our early snow-cone-planet, there was global warming, not once, but several times.\n\nThere are lesser-known “climate” computer projections indicating that many more humans will die with the next Ice Age, asteroid impact, or Carrington Event (1859) than a prolonged heatwave.\n\nIn each of those cases, melting glaciers, face coverings, vaccine passports, and social diversity will be the least of our worries.\n\nAdditionally, there is some little-known anecdotal evidence indicating that most green plants seem to prefer intense sunshine over icicles. The homework assignment for adults is to question whether to trust the botanist over the bureaucrat.\n\nPrognosticators, strutting around as experts, tell us to obey their commands and have even suggested that failure to instill climate “stress” in our children is a form of child abuse by “proxy” and omission.\n\nIt seems that leftists are creeping ever closer to “parental licensing,” an idea that I thought was a funny joke in 2006.\n\nWe are now careening downhill towards federally (and internationally) imposed parental re-education programs, “justified” using climate anxiety, vaccination/masking paranoia, and newly discovered “enhanced” child-stress data.\n\nShould UNESCO, CDC, NIH, Fauci, Pelosi, Biden, and teachers’ union propagandists be in charge of rewiring our children’s minds to be synchronized with the faux-science “consensus” page?\n\nWe are becoming part of the Great Borg “cancel culture” collective. Is assimilation inevitable and resistance futile?\n\nMany of Grimm’s Fairy Tales have been banned or deemed too “violent” for children. However, politically correct Saturday morning cartoons pound home the message that little boys and girls are going to die horrible deaths unless their parents give up their cars, wash their hands properly, become vegans, and stop challenging the effectiveness of wearing masks.\n\nUnfortunately, the “uncomfortable” childhood stories from Brothers Wilhelm and Jacob warning about big bad wolves or cannibalistic witches selling gingerbread have been replaced.\n\nWe now must understand the traumatic puppyhood of canus lupus, ignoring its sharp teeth and trail of ripped sheep carcasses.\n\nModern forensics, inclusivity training, and Critical Race Theory now describe the former serial killer who lured lost children with cookies as a misunderstood, lonely old lady with an iron deficiency.\n\nToday’s moral lessons teach that surrendering grandma’s basket of food and redistributing everyone’s wealth will prevent violence, promote sharing…and probably get everyone killed.\n\nWith the government in charge of “protecting” our children, cooling the planet, and deflecting nearby galaxies, what could possibly go wrong?\n\nEntrenched bureaucrats become instantly enraged at any challenge to their authority, conclusions, or motives. These, the “oracles” of mass evacuations from Afghanistan, experts on pandemics, climate change, and protecting our southern border, are first cousins to economists and political analysts.\n\nThey’re all certified professionals who may not know what you’re thinking or your phone number, but they’re willing to take a guess.\n\nApparently, too much safety is never enough, even if it means producing nightmares (and years of therapy) for our children and those who think like children—cautiously striving, to protect everyone, from everything, at any cost.", "opengraph": {"locale": "en_US", "type": "article", "title": "It's Time To Stop Tormenting Our Kids With Climate Terrorism", "description": "The facts on the ground put the lie to the climate fear the left inflicts on children.", "url": "https://climatechangedispatch.com/its-time-to-stop-tormenting-our-kids-with-climate-terrorism/", "site_name": "Climate Change Dispatch", "article:publisher": "https://www.facebook.com/ccdispatch/", "article:author": "https://www.facebook.com/ccdeditor", "article:published_time": "2021-08-25T13:01:03+00:00", "image": "https://i0.wp.com/climatechangedispatch.com/wp-content/uploads/2021/08/scared-child.jpg?fit=1920%2C1267&ssl=1", "image:width": "1920", "image:height": "1267", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.msn.com/en-gb/news/environment/unimaginably-dire-half-of-worlds-children-at-risk-of-climate-shock-unicef-warns/ar-AANwGSK?ocid=uxbndlbing", "https://climatechangedispatch.com/monster-children-eco-anxiety/", "https://www.shapingtomorrowsworld.org/wahlquistmethane.html", "https://en.m.wikipedia.org/wiki/Highest_temperature_recorded_on_Earth", "https://www.thoughtco.com/mount-tambora-1773768", "https://climatechangedispatch.com/vogue-kids-climate-nightmares/", "https://climatechangedispatch.com/three-planetary-threats-not-co2/", "https://theconversation.com/climate-explained-how-volcanoes-influence-climate-and-how-their-emissions-compare-to-what-we-produce-125490", "http://petitionproject.org/", "https://climatechangedispatch.com/climate-science-anti-science/", "https://en.wikipedia.org/wiki/Solar_storm_of_1859", "https://notsafe.org/Parental_Licensing_Plan", "https://climatechangedispatch.com/kids-treatment-climate-anxiety/", "https://www.americanthinker.com/articles/2021/08/its_time_to_stop_terrorizing_our_children.html", "https://climatechangedispatch.com/its-time-to-stop-tormenting-our-kids-with-climate-terrorism/?share=twitter", "https://climatechangedispatch.com/its-time-to-stop-tormenting-our-kids-with-climate-terrorism/?share=facebook", "https://climatechangedispatch.com/its-time-to-stop-tormenting-our-kids-with-climate-terrorism/?share=custom-1676469285", "https://climatechangedispatch.com/its-time-to-stop-tormenting-our-kids-with-climate-terrorism/?share=custom-1654795995", "https://climatechangedispatch.com/its-time-to-stop-tormenting-our-kids-with-climate-terrorism/?share=telegram", "https://climatechangedispatch.com/its-time-to-stop-tormenting-our-kids-with-climate-terrorism/?share=mastodon", "https://climatechangedispatch.com/its-time-to-stop-tormenting-our-kids-with-climate-terrorism/?share=custom-1610376378", "mailto:?subject=%5BShared%20Post%5D%20It%27s%20Time%20To%20Stop%20Tormenting%20Our%20Kids%20With%20Climate%20Terrorism&body=https%3A%2F%2Fclimatechangedispatch.com%2Fits-time-to-stop-tormenting-our-kids-with-climate-terrorism%2F&share=email", "#", "https://climatechangedispatch.com/its-time-to-stop-tormenting-our-kids-with-climate-terrorism/?share=linkedin", "https://climatechangedispatch.com/its-time-to-stop-tormenting-our-kids-with-climate-terrorism/?share=reddit", "https://climatechangedispatch.com/its-time-to-stop-tormenting-our-kids-with-climate-terrorism/?share=skype", "https://climatechangedispatch.com/its-time-to-stop-tormenting-our-kids-with-climate-terrorism/?share=pinterest", "https://climatechangedispatch.com/its-time-to-stop-tormenting-our-kids-with-climate-terrorism/?share=jetpack-whatsapp", "https://climatechangedispatch.com/its-time-to-stop-tormenting-our-kids-with-climate-terrorism/?share=pocket", "https://climatechangedispatch.com/its-time-to-stop-tormenting-our-kids-with-climate-terrorism/?share=tumblr", "https://climatechangedispatch.com/its-time-to-stop-tormenting-our-kids-with-climate-terrorism/#print"], "authors": ["ccdeditor"], "publish_date": "2021-08-25T13:01:03+00:00"}