{"result_id": "069007", "URL": "https://climatechangedispatch.com/how-global-warmists-package-panic/", "timestamp": "2023-04-25 14:43:10 CEST+0200", "meta": {"description": "Using the World Weather Attribution's logic, a rooster crowing before sunrise means he caused the sun to rise.", "lang": "en", "keywords": "", "favicon": "/wp-content/themes/yoo_avanti_wp/favicon.ico", "canonical": "https://climatechangedispatch.com/how-global-warmists-package-panic/", "encoding": "UTF-8"}, "image": null, "domain": "climatechangedispatch.com", "title": "How Global Warmists Package Panic", "cleaned_text": "Written by Michael Kile on . Posted in Latest news\n\nThat the latest World Weather Attribution (WWA) post, Rapid attribution analysis of the extraordinary heatwave on the Pacific Coast of the US and Canada June 2021, has twenty-one contributors from prestigious research groups around the world gave it even more piquancy.\n\nWhat a treat! I had not been so flummoxed since reading Alan Sokal’s scholarly hoax over two decades ago: “Transgressing the Boundaries: Towards a Transformative Hermeneutics of Quantum Gravity.”\n\nThe WWA post, alas, is neither hoax nor parody, but the real deal: a collaboration — in record time, no less — “to assess to what extent human-induced climate change made this heatwave hotter and more likely.”\n\nWhether “human-induced climate change” – whatever that is – was present at all was not on the menu.\n\nSo it’s down the rabbit hole of questionable-cause logical fallacies in search of an answer: post hoc ergo propter hoc: ‘after this, therefore because of this’; “since event Y followed event X, event Y must have been caused by event X”; or if you prefer, cum hoc ergo propter hoc: ‘with this, therefore because of this’.\n\nA rooster crowing before sunrise does not mean it caused the sun to rise. A lot of cocks crowing before a big conference, however, could cause an increase in the flow of money into the Green Climate Fund. Cock-a-doodle-do.\n\nWhatever the case, we clearly need a New Law of Climate Change:\n\nClimate alarmism (CA) increases exponentially as time, T, to the next United Nations Conference of the Parties (COP) or atmospheric Armageddon (AA) declines to zero; where CA is measured by the frequency of MSM and social media amplification occurring in a specific period of observation, P.\n\nAs for the “extraordinary heatwave” last month, when competition with COVID threatens to steal your thunder it pays to be as quick as greased lightning to trumpet panic and hyperbole. The paint was barely dry on June 2021, when WWA concluded that while:\n\nan event such as the Pacific Northwest 2021 heatwave is still rare or extremely rare in today’s climate, yet would be virtually impossible without human-caused climate change . As warming continues, it will become a lot less rare.\n\nYou might wonder how WWA could distinguish “human-caused climate change” from the weather over such a short period, and determine “how much less severe” the heatwave “would have been in a [computer-generated] world without human-caused climate change.”\n\nWell, it used published peer-reviewed methods to analyze maximum temperatures in the region most affected by the heat (45–52 ºN, 119–123 ºW).\n\nYet “the Earth is large and extreme weather occurs somewhere almost every day.” So which EWEs merit an attribution study? WWA prioritizes those that “have a large impact or provoke strong discussion,” so that its “answers will be useful for a large audience.”\n\nFor WWA the heatwave was a “strong warning” of worse to come:\n\nOur results provide a strong warning: our rapidly warming climate is bringing us into uncharted territory that has significant consequences for health, well-being, and livelihoods . Adaptation and mitigation are urgently needed to prepare societies for a very different future. Adaptation measures need to be much more ambitious and take account of the rising risk of heatwaves around the world, including surprises such as this unexpected extreme…… In addition, greenhouse gas mitigation goals should take into account the increasing risks associated with unprecedented climate conditions if warming would be allowed to continue. (media release, 7 July 2021)\n\nIt is important to highlight that, because the temperature records of June 2021 were very far outside all historical observations, determining the likelihood of this event in today’s climate is .\n\nBased on this first rapid analysis, we cannot say whether this was a so-called “freak” event (with a return time on the order of 1 in 1000 years or more) that largely occurred by chance, or whether our changing climate altered conditions conducive to heatwaves in the Pacific Northwest, which would imply that “bad luck” played a smaller role and this type of event would be more frequent in our current climate.\n\nYet WWA still concluded that:\n\nIn either case, the future will be characterized by more frequent, more severe, and longer heatwaves, highlighting the importance of significantly reducing our greenhouse gas emissions to reduce the amount of additional warming.\n\nThis kind of science might be alright as an academic game with complex computer models. During the past decade, however, so-called “rapid attribution analysis” has moved outside its core business into climate politics. Researchers have become activists.\n\nGaming uncertainty is the only game in town and the profession knows how to play it. Its media releases are a key driver of the UN’s multi-trillion dollar “ambition” to monetize “climate change” and greenmail the developed world.\n\nDid WWA assess all the factors, including natural variability? Not according to the Cliff Mass Weather Blog:\n\nSociety needs accurate information in order to make crucial environmental decisions. Unfortunately, there has been a substantial amount of miscommunication and unscientific hand-waving about the recent Northwest heatwave. This blog post uses rigorous science to set the record straight…. It describes the origins of a meteorological black swan event and how the atmosphere is capable of attaining extreme, unusual conditions without any aid from our species .\n\nIt ultimately comes down to the modeling. Is it meaningful or meaningless? WWA’s “validation criteria” assessed the similarity between the modeled and observed seasonal cycle and other factors.\n\nThe outcomes were described as “good”, “reasonable” or” bad”. All the “validation results” appear in Table 3 of the WWA analysis.\n\nOf the 36 models used, the results from nine were deemed “bad” (25%), 13 were “reasonable” (36%), and the remaining 14 were “good” (39%).\n\nIn a 2009 paper by Reno Knutti, et al., Challenges in combining projections from multiple climate models, the five authors stressed that\n\nthere is little agreement on metrics to separate “good” and “bad” models, and there is concern that model development, evaluation and posterior weighting or ranking are all using the same datasets.\n\nIn what other field would it be legitimate to select only the models merely considered “good”, or to average them in some way, then claim the process produces an acceptable approximation to the truth and reality? Imagine how the public would react to a COVID vaccine with an efficacy of only 39 percent.\n\nHow did we get to this point? It all began with ACE, the Attribution of Climate-related Events initiative.\n\nACE’s inaugural meeting was held in Boulder, Colorado, on January 26, 2009, at the National Center for Atmospheric Research (NCAR). ACE released a four-paragraph statement.\n\nIts mission would be “to provide authoritative assessments of the causes of anomalous climate conditions and EWEs”, presumably for the Intergovernmental Panel on Climate Change (IPCC).\n\nACE’s “conceptual framework for attribution activities” would be: “elevated in priority and visibility, leading to substantial increases in resources (funds, people and computers).” Everyone had to sing from the same song-sheet:\n\nA consistent use of terminology and close collaborative international teamwork will be required to when explaining complex multi-factorial events such as the recent Australian bushfires”.\n\nThree years later, Dr Peter Stott, now the Hadley Centre’s head of climate monitoring and attribution, again stressed the importance of reining in mavericks and having a unified “authoritative voice”; this time in a conference paper.\n\n“Unusual or extreme weather and climate-related events are of great public concern and interest,” he noted, “yet there are often conflicting messages from scientists about whether such events can be linked to climate change.”\n\nAll too often the public receives contradictory messages from reputable experts. If the public hears that a particular weather event is consistent with climate change they may conclude that it is further proof of the immediate consequences of human-induced global warming. On the other hand, if the public hears that it is not possible to attribute an individual event, they may conclude that the uncertainties are such that nothing can be said authoritatively about the effects of climate change as actually experienced.”\n\nDo not confuse them with chatter about uncertainties. Imagine the furor if too many suspect that nothing “can be said authoritatively about climate change”.\n\nYes, change is what the planet’s climate and weather do and have always done; but we can’t tell them it’s impossible to make predictions, given all the complexity.\n\nAs for seeing EWEs as having anything other than a human cause, WWA, ACE, and Net Zero advocates prefer to look the other way. They are determined to ensure no “conflicting messages” emerge about “climate change”.\n\nThis influential 2020 paper (ten authors) – A protocol for probabilistic extreme event attribution analyses – actually includes tips on how to “successfully communicate an attribution statement”.\n\nThe eighth and final step in the extreme event attribution analysis is the communication of the attribution statement. . Communication here concerns writing a scientific report, a more popular summary, targeted communication to policymakers, and a press release. We found that the first one is always essential; which of the other three are produced depends on the target audiences … For all results it is crucial that during this chain the information is translated correctly into the different stages. This sounds obvious, but in practice it can be hard to achieve.\n\nFor struggling communicators, the authors offer some helpful suggestions:\n\nA 1-page summary in non-scientific language may be prepared for local disaster managers, policymakers, and journalists with the impacts, the attribution statement, and the vulnerability and exposure analysis, preferably with the outlook to the future if available. The local team members and other stakeholders in the analysis can be invited to be points of contact for anyone seeking further clarification of contextual information, or they may be brought closer into the project team to collaborate and communicate key attribution findings.\n\nshould contain understandable common language. Furthermore, we found that after inserting quotes from the scientists that performed the analysis, people gain more confidence in the results. This may include accessible graphics, such as the representation [at right] of the change in intensity and probability of very mild months in the high Arctic as observed in November–December 2016, (van Oldenborgh et al., 2016a).\n\nIt “can be used to amplify the spread of attribution findings and contribute to public discourse on the extreme event being studied. Social media can help to reach younger audiences (Hermida et al., 2012; Shearer and Grieco, 2019; Ye et al., 2017).\n\nSocial media monitoring and analytics can also be used to assess awareness and the spread of attribution findings” (Kam et al., 2019.\n\nAs for the text, WWA noted some intriguing “research into the efficacy of different ways to communicate results and uncertainties to a large audience.”\n\nFor instance, van der Bles et al. (2018) found that a numerical uncertainty range hardly decreases trust in a statement, whereas a language qualification does decrease it significantly. We also found that communicating only a lower bound, because it is mathematically better defined in many cases, is not advisable. In the first place a phrase like “at least” was found to be dropped in the majority of popular accounts. Secondly, quoting only the lower bound de-emphasizes the most likely result and therefore (Lewandowsky et al., 2015).\n\nWhat goes around comes around. Here we have a paper by cognitive psychologist, Professor Stephan Lewandowsky, et al., Seepage: Climate change denial and its effect on the scientific community\n\nVested interests and political agents have long opposed political or regulatory action in response to climate change by appealing to scientific uncertainty. Here we examine the effect of such contrarian talking points on the scientific community itself. We show that although scientists are trained in dealing with uncertainty, there are several psychological reasons why scientists may nevertheless be susceptible to uncertainty-based argumentation, even when scientists recognize those arguments as false and are actively rebutting them.\n\nIf real uncertainty– the alleged driver of Lewandowsky’s “seepage” and “ambiguity aversion” – has “arguably contributed to a widespread tendency to understate the severity of the climate problem”, and indeed to question its alleged severity, is it not a better outcome to pervasive confirmation bias and a multi-trillion dollar heist?\n\nNature is tricky too, and indifferent to our attempts to understand and control it. While the extreme summer heatwave was affecting the Pacific Northwest of North America last month, “global warming” apparently took a winter vacation in continental Antarctica.\n\nAntarctica New Zealand, (ANZ), the government agency responsible for that country’s activities in Antarctica, issued this media statement on 16 June 2021:\n\nThis winter Antarctica is freezing, no surprises there– but it’s As midwinter approaches on Monday, Antarctica is two degrees away from recording its coldest temperature ever !\n\nThis week the temperature at (Dome Fuji Station) – that’s (2400km) away from Scott Base plunged to -81.7C (the record is -83.0C),\n\nThese temperatures are being caused by positive SAM (Southern Annular Mode) and a strong polar vortex.\n\nIt’s good news for this year’s sea ice, and will mean lots of sea ice growth. Sea ice is frozen ocean water that floats on top of the sea.\n\nDome Fuji Station is 3,810 meters above sea level and located on the second-highest summit of the East Antarctic ice sheet, at 77°30′S 37°30′E.\n\nAntarctica’s coldest recorded temperature at ground level is -89.6°C at Vostok station on 21 July 1983, but the Dome Fuji reading last month is close.\n\nOne swallow does not a summer make, of course, nor do a few unusually cold – or hot – days say much, if anything, about “climate change”.\n\nAntarctica’s hottest day? Not so fast. Ironically, a few days ago, on July 1, 2021, the World Meteorological Organization (WMO) recognized a new record high temperature for the Antarctic “continent” of 18.3° Celsius on 6 February 2020 at the Esperanza station (Argentina). (See the latest online issue of the Bulletin of the American Meteorological Society.)\n\nThe Antarctic Peninsula (the northwest tip near to South America) is among the fastest-warming regions of the planet, almost 3°C over the last 50 years. This new temperature record is therefore consistent with the climate change we are observing.\n\nYet temperatures at the “northwest tip near South America” tell us next to nothing about the Antarctic continent itself, but that’s another story.\n\nstressed the need for increased caution on the part of both scientists and the media in releasing early announcements of this type of information. This is due to the fact that many media and social media outlets often tend to sensationalize and mischaracterize potential records before they have been thoroughly investigated and properly validated.", "opengraph": {"locale": "en_US", "type": "article", "title": "How Global Warmists Package Panic", "description": "Using the World Weather Attribution's logic, a rooster crowing before sunrise means he caused the sun to rise.", "url": "https://climatechangedispatch.com/how-global-warmists-package-panic/", "site_name": "Climate Change Dispatch", "article:publisher": "https://www.facebook.com/ccdispatch/", "article:author": "https://www.facebook.com/ccdeditor", "article:published_time": "2021-07-16T18:27:34+00:00", "image": "https://i0.wp.com/climatechangedispatch.com/wp-content/uploads/2021/07/rooster-sun.jpg?fit=1198%2C899&ssl=1", "image:width": "1198", "image:height": "899", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.worldweatherattribution.org/about/", "https://www.worldweatherattribution.org/wp-content/uploads/NW-US-extreme-heat-2021-scientific-report-WWA.pdf", "https://en.wikipedia.org/wiki/Sokal_affair", "https://www.worldweatherattribution.org/pathways-and-pitfalls-in-extreme-event-attribution/", "https://cliffmass.blogspot.com/2021/07/was-global-warming-cause-of-great.html", "https://www.worldweatherattribution.org/wp-content/uploads/NW-US-extreme-heat-2021-scientific-report-WWA.pdf", "https://www.semanticscholar.org/paper/Challenges-in-Combining-Projections-from-Multiple-Knutti-Furrer/d9f4c9f419772a290684da72c310a2b2d2e42ffa", "https://quadrant.org.au/opinion/doomed-planet/2013/02/weird-weather-shenanigans-part-i/", "http://www.cgd.ucar.edu/cas/ace/", "http://en.wikipedia.org/wiki/NCAR", "http://www.cgd.ucar.edu/cas/Trenberth/trenberth.papers/stott_eos.pdf", "http://www.metoffice.gov.uk/research/people/peter-stott", "http://www.wcrp-climate.org/conference2011/documents/Stott.pdf", "https://ascmo.copernicus.org/articles/6/177/2020/ascmo-6-177-2020.html", "https://i0.wp.com/climatechangedispatch.com/wp-content/uploads/2021/07/kile-chart-400x485-1.png?ssl=1", "https://ascmo.copernicus.org/articles/6/177/2020/#bib1.bibx97", "https://ascmo.copernicus.org/articles/6/177/2020/#bib1.bibx97", "https://ascmo.copernicus.org/articles/6/177/2020/#bib1.bibx97", "https://ascmo.copernicus.org/articles/6/177/2020/#bib1.bibx31", "https://ascmo.copernicus.org/articles/6/177/2020/#bib1.bibx31", "https://ascmo.copernicus.org/articles/6/177/2020/#bib1.bibx75", "https://ascmo.copernicus.org/articles/6/177/2020/#bib1.bibx75", "https://ascmo.copernicus.org/articles/6/177/2020/#bib1.bibx107", "https://ascmo.copernicus.org/articles/6/177/2020/#bib1.bibx107", "https://ascmo.copernicus.org/articles/6/177/2020/#bib1.bibx37", "https://ascmo.copernicus.org/articles/6/177/2020/#bib1.bibx37", "https://ascmo.copernicus.org/articles/6/177/2020/#bib1.bibx87", "https://ascmo.copernicus.org/articles/6/177/2020/#bib1.bibx87", "https://ascmo.copernicus.org/articles/6/177/2020/#bib1.bibx49", "https://ascmo.copernicus.org/articles/6/177/2020/#bib1.bibx49", "https://www.abc.net.au/news/2011-03-28/lewandowsky/45638", "https://www.sciencedirect.com/science/article/pii/S0959378015000515?via%3Dihub", "https://climatechangedispatch.com/heatwave-reporting-shows-how-science-has-been-corrupted-by-climate-groupthink/", "https://www.antarcticanz.govt.nz/", "https://www.antarcticanz.govt.nz/media/news/cold-antarctica-and-what-this-might-mean-for-nzs-ski-season", "https://www.msn.com/en-nz/news/national/scott-base-crew-enduring-near-record-breaking-antarctica-winter-10c-colder-than-usual/ar-AALaP9s", "https://quadrant.org.au/opinion/doomed-planet/2020/02/antarcticas-hottest-day-not-so-fast/", "https://public.wmo.int/en/media/press-release/wmo-verifies-one-temperature-record-antarctic-continent-and-rejects-another", "https://climatechangedispatch.com/antarctica-record-high-temp-media-hoax/", "https://journals.ametsoc.org/view/journals/bams/aop/BAMS-D-21-0040.1/BAMS-D-21-0040.1.xml", "https://quadrant.org.au/opinion/doomed-planet/2021/07/how-warmists-package-panic/", "https://climatechangedispatch.com/how-global-warmists-package-panic/?share=twitter", "https://climatechangedispatch.com/how-global-warmists-package-panic/?share=facebook", "https://climatechangedispatch.com/how-global-warmists-package-panic/?share=custom-1676469285", "https://climatechangedispatch.com/how-global-warmists-package-panic/?share=custom-1654795995", "https://climatechangedispatch.com/how-global-warmists-package-panic/?share=telegram", "https://climatechangedispatch.com/how-global-warmists-package-panic/?share=mastodon", "https://climatechangedispatch.com/how-global-warmists-package-panic/?share=custom-1610376378", "mailto:?subject=%5BShared%20Post%5D%20How%20Global%20Warmists%20Package%20Panic&body=https%3A%2F%2Fclimatechangedispatch.com%2Fhow-global-warmists-package-panic%2F&share=email", "#", "https://climatechangedispatch.com/how-global-warmists-package-panic/?share=linkedin", "https://climatechangedispatch.com/how-global-warmists-package-panic/?share=reddit", "https://climatechangedispatch.com/how-global-warmists-package-panic/?share=skype", "https://climatechangedispatch.com/how-global-warmists-package-panic/?share=pinterest", "https://climatechangedispatch.com/how-global-warmists-package-panic/?share=jetpack-whatsapp", "https://climatechangedispatch.com/how-global-warmists-package-panic/?share=pocket", "https://climatechangedispatch.com/how-global-warmists-package-panic/?share=tumblr", "https://climatechangedispatch.com/how-global-warmists-package-panic/#print"], "authors": ["ccdeditor"], "publish_date": "2021-07-16T18:27:34+00:00"}