{"result_id": "069036", "URL": "https://climatechangedispatch.com/tucker-carlson-climate-experts-want-to-control-you-not-save-the-earth/", "timestamp": "2023-04-25 14:43:26 CEST+0200", "meta": {"description": "Tucker shreds climate change 'experts' and their predictions, which have not held up well over time.", "lang": "en", "keywords": "", "favicon": "/wp-content/themes/yoo_avanti_wp/favicon.ico", "canonical": "https://climatechangedispatch.com/tucker-carlson-climate-experts-want-to-control-you-not-save-the-earth/", "encoding": "UTF-8"}, "image": null, "domain": "climatechangedispatch.com", "title": "Tucker Carlson: Climate Experts Want To Control You, Not Save The Earth", "cleaned_text": "Written by Tucker Carlson on . Posted in Latest news\n\nFox News host Tucker Carlson calls out climate change ‘experts’ and their failed predictions on ‘Tucker Carlson Tonight.’\n\nIt’s been a tough couple of years for the experts. When it comes to big public policy questions, complicated adult stuff like war and disease and the economy – really the only things that matter – the assumption in Washington has for many years been that you should not worry about it. Don’t sweat the details.\n\nThat’s not your role as a citizen and as a voter. We don’t have that kind of democracy, the kind where you might actually participate. No, your job is to trust the experts and their conclusions and then obey them.\n\nBut COVID kind of blew that up. If there’s one thing we learned from that disaster, it’s that public policy experts very often had no clue what they were talking about. Your hippie aunt in Mendocino County knew a lot more about how to beat a flu virus than your average virologist on CNN.\n\nThey’re not going to tell you to go outside, get some exercise, some sunlight, some fresh air, stop eating junk food, turn off your computer once in a while, or spend time with other people. Be healthy. That advice worked. The experts, by contrast, made you get the vaccine and that did not work.\n\nBy March of 2021, people are starting to figure this out. Anyone who was paying attention in America understood that the experts, many of them, were full of it. And it was exactly at that moment that The Atlantic Magazine in Washington published a piece pushing back against a growing consensus. That story was entitled “Following Your Gut Isn’t the Right Way to Go.”\n\nIt’s hard to think of a funnier headline, really mostly because it’s so spectacularly absurd. You should always trust your gut, obviously. It is the one thing that will never betray you. But The Atlantic Magazine wanted you to know that your natural instincts are, in fact, worthless. “The experts had a rough year,” the magazine concedes, “but we still have to trust them.” Right.\n\nActually, we don’t have to trust them and on big questions of public policy, we absolutely should not trust them. It’s a democracy. But Washington is continuing to demand that we trust them. Why? There may be a reason. Maybe COVID isn’t the only big project they have in mind for us, a project the experts will justify and MSNBC.\n\nAnd indeed it’s not. There is the and the climate change agenda is the single most ambitious effort to remake human civilization in all recorded history, and it’s coming. In fact, it’s already in progress.\n\nThe only reason that millions and millions of Americans aren’t protesting in the streets tonight over this effort to completely overturn their lives is that on some level, many people still do trust the experts, at least on climate change, but should they?\n\nWe were pondering that this morning when we saw that the world’s most famous climate change expert, Greta Thunberg of Sweden, just deleted a tweet she wrote in June of 2018.\n\nHere it is: “A top climate scientist is warning that climate change will wipe out all of humanity unless we stop using fossil fuels over the next five years.” That scientist, of course, was a Harvard professor so obviously, that prediction was going to be correct, but here we are still driving our Silverados and still alive and some of us are still happy.\n\nSo, it does make you wonder if Greta Thunberg, the greatly revered Greta Thunberg, a perennial finalist for the Nobel Peace Prize, could have gotten that so wrong, what else have the climate experts gotten wrong and how long have they been getting it wrong?\n\nWell, fortunately, the Competitive Enterprise Institute has done the research on this, and it turns out these people have been very wrong for a very long time.\n\nIn 1969, The New York Times was printing climate hysteria from an expert called Paul Ehrlich “We must realize that unless we are extremely lucky, everybody will disappear in a cloud of blue steam in 20 years.”\n\nThat was Paul Ehrlich in 1969. Well, here it is, 2023, and that same Paul Ehrlich, who’s now 90 and still publishing books and still being cited on “60 Minutes,” is still telling us that we’re all going to die.\n\nNow, clearly, Paul Ehrlich had some sort of traumatic childhood. He’s been inflicting it on the rest of us for over 50 years, and for 50 years, his fellow experts have taken him seriously.\n\nNow, back then, of course, climate change didn’t mean . It meant a new ice age. In 1970, The Boston Globe reported, “Scientists predict a new ice Age by the 21st century.” According to the Globe, “air pollution may obliterate the sun and cause a new ice age in the first third of the next century.” An ice age!\n\nIn 1972, Brown University’s science department sent a letter to the White House explaining that they had “deep concern with the future of the world because this ice age falls within the rank of processes which produced the last Ice Age.”\n\nTwo years later, in 1974, the Guardian reported, “Spy satellites show new ice age is coming fast” and the report cited for moral weight analysis carried out at Columbia University. Then, a few years later, in 1977, the actor Leonard Nimoy – who was not a science expert technically, but played one at one point on television – shot this video.\n\nLEONARD NIMOY: If we are unprepared for the next advance, the result could be hunger and death on a scale unprecedented in all of history. What scientists are telling us now is that the threat of an ice age is not as remote as they once thought. During the lifetime of our grandchildren, arctic cold and perpetual snow could turn most of the inhabitable portions of our planet into a polar desert.\n\nHunger and death are on an unprecedented scale! Someone else with a tragic childhood he inflicted on the rest of us.\n\nBut by the early 1980s, when the ice didn’t arrive well, the expert decided the problem wasn’t too much cold. It was too much heat. It was global warming. In 1989, the Associated Press ran this story “A senior U.N. environmental official says entire nations could be wiped off the face of the earth by rising sea levels if global warming trend is not reversed by the year 2000.” In other words, 23 years ago.\n\nThat same year, 1989, a climate expert called Jim Hansen met with a reporter from Salon. According to Salon, Hansen explained that within 20 or 30 years, “The West Side Highway, which runs along the Hudson River in Manhattan, will be underwater,” Underwater! We checked tonight, and actually, it’s congested, but still a road.\n\nThen in March of 2000, the Independent newspaper had a piece explaining that snowfalls are now just a thing of the past: “Snow is starting to disappear from our lives.” The piece quoted a climate expert claiming that “children just aren’t going to know what snow is.” No idea what snow is! It’ll be a relic of the Ice Age, but of the great inferno of global warming.\n\nThen in 2004, amazingly, civilization still existed. The Guardian predicted that “Major European cities will be sunk beneath rising seas as Britain is plunged into a Siberian climate by 2020” – which is a little confusing because global warming doesn’t typically produce a Siberian climate.\n\nAnd it was around this time that they decided, “Hey, we don’t want to get pinned down on the details. Will it be too hot? Will it be too cold? We don’t want to say. Something bad is going to happen, so we’re going to call it climate change.”\n\nAnd that paved the way for Al Gore, who in 2006 released his famous documentary, “An Inconvenient Truth.” The beauty of An Inconvenient Truth is now that it’s been well, inconveniently more than 15 years since it came out, we can fact-check its claims. Here’s the trailer.\n\nAL GORE: If you look at the ten hottest years ever measured, they’ve all occurred in the last 14 years and the hottest of all was 2005. This is Patagonia 75 years ago and the same glacier today. This is Mount Kilimanjaro 30 years ago and last year. Within the decade, there will be no more “Snows of Kilimanjaro.”\n\nAl Gore also said there would be no ice in the Arctic. He quoted researchers, climate researchers, and experts, and he explained that “The North Pole will be ice-free in the Summer by 2013 because of man-made global warming.”\n\nNow, it does take a certain level of hutzpah to make a prediction that precise and Al Gore made many of them and all of them turned out to be wrong and for a normal person, that would be a cue maybe it’s time to retire. I’m rich on Google stock. Maybe I could just stop talking because, of course, I’ve been disgraced by my own foolish predictions,\n\nBut no, he kept going, and he was helped in that by the entire news media. It makes you wonder why? News organizations exist to bring you the news, to assess whether things are true or not, but if all of them collude to hide lying, you have to ask, is there something else going on here? We will let you decide.\n\nWe do know that by 2006, NBC News informed the world that, “a leading U.S. climate researcher says the world has a ten-year window” (till 2016) “a window of opportunity to take decisive action on global warming and avert catastrophe.” Of course, by their predicted date, Donald Trump became president, but that’s not what they were predicting.\n\nIn 2008, the Associated Press reported that according to a top NASA scientist, “in 5 to 10 years, the Arctic will be free of sea ice in the summer.” That didn’t happen, but of course, no one was ever held to account for bad predictions. So, this kept going. John Kerry, now our climate czar, cited that very same science in 2009.\n\nJOHN KERRY: You have sea ice, which is melting at a rate that the Arctic Ocean now increasingly is exposed. In five years, scientists predict we will have the first ice-free Arctic summer.\n\nWhat’s hilarious is this is a guy who’s never had a job. He’s only been in politics. He never did one useful thing. He’s not a scientist. He has never done the research. He’s actually not an expert. But because he’s way more aggressive than you are and because he has access to the media, which amplifies his claims, he poses as one.\n\nNow, what’s strange about the prediction you just heard is that John Kerry’s prediction contradicts Barack Obama’s famous climate prediction from a year earlier. You probably remember this.\n\nBARACK OBAMA: Because if we are willing to work for it and fight for it and believe in it, then I am absolutely certain that generations from now we will be able to look back and tell our children that this was the moment when we began to provide care for the sick and good jobs for the jobless. This was the moment when the rise in the oceans began to slow and our planet began to heal.\n\nSad to watch that. All the cheering people, they seem so sincere. He’s going to save the world and control the weather. He’s Jesus. But in fact, the global healing Obama promised at the beginning of his first term never came, and neither did the global destruction.\n\nHere, by the way, is Neil deGrasse Tyson, another great predictor of things, saying that by 2014, the Statue of Liberty will soon be underwater.\n\nNEIL DEGRASSE TYSON: You know what I tell people? This really wakes them. Here in the New York metropolitan area, I say, you know, if we lose the ice caps, you know how high the water will be? “Oh, maybe a couple of feet.” No, it would come up to the Statue of Liberty’s elbow, the one that’s holding the Declaration of Independence. That’s where the waterline will be.\n\nThat man is a scientist and of course, climate does change, it has always, changed. In fact, the landscape we live in now is formed by climate change. The glaciers are a product of climate change. The climate is changing now. It never stops changing.\n\nThat is a process that we didn’t cause and that we can’t control to any great degree, we will never be able to control and there are upsides to it and downsides to it.\n\nBy the way, if the Earth is indeed getting warmer and it seems to be, well, then that will make more arable land in places like Canada and Northern Europe.\n\nSo, like everything in this life in the temporal world, it’s a mixed blessing, but you only hear the downsides, which tells you a lot. It tells you this is not . It’s manipulation. These aren’t reports from the experts. These are threats. Here’s Joe Biden.\n\nPRESIDENT BIDEN: That’s what climate change is about. It is literally, not figuratively, a clear and present danger. The latest climate report, is nothing less than “code red for humanity.” Let me say it again, code red for humanity.\n\nCode red for humanity! Of course, he never explains what that means. You’re going to have to check your book of science to find out.\n\nOf course, in the details, they don’t offer as many details now because they’ve all been wrong, but to the extent they do, they are provably wrong over time.\n\nSo, the question is, why are we still being bullied by these climate experts? It has nothing to do with saving the Earth. They hate the Earth. They hate nature. It’s about controlling us, and maybe we should recognize that.", "opengraph": {"locale": "en_US", "type": "article", "title": "Tucker Carlson: Climate Experts Want To Control You, Not Save The Earth", "description": "Tucker shreds climate change 'experts' and their predictions, which have not held up well over time.", "url": "https://climatechangedispatch.com/tucker-carlson-climate-experts-want-to-control-you-not-save-the-earth/", "site_name": "Climate Change Dispatch", "article:publisher": "https://www.facebook.com/ccdispatch/", "article:author": "https://www.facebook.com/ccdeditor", "article:published_time": "2023-03-17T13:22:49+00:00", "article:modified_time": "2023-03-17T13:26:41+00:00", "image": "https://climatechangedispatch.com/wp-content/uploads/2023/03/tucker-climate-experts-gore.jpg", "image:width": "1600", "image:height": "1098", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.foxnews.com", "https://www.foxnews.com/media/biden-warns-people-cant-deny-climate-change-wrath-mother-nature-whole-generation-damned", "https://i0.wp.com/climatechangedispatch.com/wp-content/uploads/2021/11/greta-thunberg-cop26.jpg?ssl=1", "https://climatechangedispatch.com/climate-experts-0-41-wrong-predictions/", "https://climatechangedispatch.com/60-minutes-touts-apocalyptic-fake-news-with-eco-doom-peddler/", "https://www.foxnews.com/world/european-farmers-fed-climate-policies-shock-political-establishment", "https://climatechangedispatch.com/in-search-of-the-coming-ice-age/", "https://climatechangedispatch.com/children-just-arent-going-to-know-what-snow-is-part-ii/", "https://i0.wp.com/climatechangedispatch.com/wp-content/uploads/2020/04/the-day-after-tomorrow-3.jpg?ssl=1", "https://climatechangedispatch.com/revisiting-al-gores-an-inconvenient-truth-15-years-later/", "https://climatechangedispatch.com/gore-proven-spectacularly-wrong-snows-kilimanjaro/", "https://climatechangedispatch.com/liberal-media-made-slew-of-dubious-climate-change-claims-new-report-finds/", "https://i0.wp.com/climatechangedispatch.com/wp-content/uploads/2022/05/john-kerry-wef.jpg?ssl=1", "https://climatechangedispatch.com/from-record-snow-to-no-snow-activist-media-use-climate-change-to-stoke-fear/", "https://climatechangedispatch.com/sea-level-rise-an-obama-photo-proves-the-many-lies-of-climate-doomsters/", "https://climatechangedispatch.com/no-neil-degrasse-tyson-squashing-curiosity-and-wonder-is-never-okay/", "https://i0.wp.com/climatechangedispatch.com/wp-content/uploads/2017/07/liberty-statue-underwater.jpg?ssl=1", "https://climatechangedispatch.com/climate-changes-it-always-has-it-always-will/", "https://climatechangedispatch.com/climate-change-is-about-control-stupid-not-the-environment/", "https://www.foxnews.com/politics/biden-climate-change-cause-colorado-river-dry-up-ritzy-dnc-dinner", "https://climatechangedispatch.com/biden-fixates-on-nonexistent-climate-crisis-while-ignoring-real-problems/", "https://www.foxnews.com/opinion/tucker-carlson-climate-change-experts-bullying-helping-earth-controlling-us", "https://climatechangedispatch.com/tucker-carlson-climate-experts-want-to-control-you-not-save-the-earth/?share=twitter", "https://climatechangedispatch.com/tucker-carlson-climate-experts-want-to-control-you-not-save-the-earth/?share=facebook", "https://climatechangedispatch.com/tucker-carlson-climate-experts-want-to-control-you-not-save-the-earth/?share=custom-1676469285", "https://climatechangedispatch.com/tucker-carlson-climate-experts-want-to-control-you-not-save-the-earth/?share=custom-1654795995", "https://climatechangedispatch.com/tucker-carlson-climate-experts-want-to-control-you-not-save-the-earth/?share=telegram", "https://climatechangedispatch.com/tucker-carlson-climate-experts-want-to-control-you-not-save-the-earth/?share=mastodon", "https://climatechangedispatch.com/tucker-carlson-climate-experts-want-to-control-you-not-save-the-earth/?share=custom-1610376378", "mailto:?subject=%5BShared%20Post%5D%20Tucker%20Carlson%3A%20Climate%20Experts%20Want%20To%20Control%20You%2C%20Not%20Save%20The%20Earth&body=https%3A%2F%2Fclimatechangedispatch.com%2Ftucker-carlson-climate-experts-want-to-control-you-not-save-the-earth%2F&share=email", "#", "https://climatechangedispatch.com/tucker-carlson-climate-experts-want-to-control-you-not-save-the-earth/?share=linkedin", "https://climatechangedispatch.com/tucker-carlson-climate-experts-want-to-control-you-not-save-the-earth/?share=reddit", "https://climatechangedispatch.com/tucker-carlson-climate-experts-want-to-control-you-not-save-the-earth/?share=skype", "https://climatechangedispatch.com/tucker-carlson-climate-experts-want-to-control-you-not-save-the-earth/?share=pinterest", "https://climatechangedispatch.com/tucker-carlson-climate-experts-want-to-control-you-not-save-the-earth/?share=jetpack-whatsapp", "https://climatechangedispatch.com/tucker-carlson-climate-experts-want-to-control-you-not-save-the-earth/?share=pocket", "https://climatechangedispatch.com/tucker-carlson-climate-experts-want-to-control-you-not-save-the-earth/?share=tumblr", "https://climatechangedispatch.com/tucker-carlson-climate-experts-want-to-control-you-not-save-the-earth/#print", "https://climatechangedispatch.com/tucker-carlson-climate-experts-want-to-control-you-not-save-the-earth/trackback/"], "authors": ["ccdeditor"], "publish_date": "2023-03-17T13:22:49+00:00"}