{"result_id": "069025", "URL": "https://climatechangedispatch.com/michael-moore-the-green-new-deals-worst-enemy/", "timestamp": "2023-04-25 14:43:20 CEST+0200", "meta": {"description": "Moore's new doc ruins the entire basis of the Green New Deal and its many facsimiles.", "lang": "en", "keywords": "", "favicon": "/wp-content/themes/yoo_avanti_wp/favicon.ico", "canonical": "https://climatechangedispatch.com/michael-moore-the-green-new-deals-worst-enemy/", "encoding": "UTF-8"}, "image": null, "domain": "climatechangedispatch.com", "title": "Michael Moore: The Green New Deal’s Worst Enemy", "cleaned_text": "Written by James Delingpole on . Posted in Latest news\n\nLeft-wing documentary filmmaker Michael Moore is promoting a new documentary he executive produced about the environment — Planet of the Humans — and many of his usual supporters are going nuts.\n\nWhat can the veteran left-wing activist possibly have done to earn such disapproval?\n\nSimple. Moore has backed the most powerful, brutally honest, and important documentary of his career.\n\nIt’s also by far his bravest because it not only confronts the modern left’s greatest shibboleth — “clean” energy — but it does indeed offer a great deal of succor to Moore’s avowed enemy President Donald Trump.\n\nIt might even help Trump clinch the next presidential election for it undermines the entire basis of the Green New Deal being pushed in one form or another by his opponents.\n\nRenewable energy, the documentary makes abundantly clear, is not the solution to the problem — but an even bigger problem than the one it is supposedly solving.\n\nThe documentary was directed by Jeff Gibbs, who, like Moore, is very much a man of the left. Gibbs was a producer and composer on Moore’s Fahrenheit 9/11 and Bowling for Columbine.\n\nIn his youth, he was the kind of committed, long-haired eco-activist who sabotages diggers by putting sugar in their gas tanks.\n\nAnd it’s this left-wing, activist background of Gibbs and Moore which makes the movie’s message so much more compelling.\n\nRenewable energy, it tells us, is not clean energy but dirty energy because it does tremendous damage to the environment.\n\nThe people who make money out of it are the worst kind of crony-capitalists. Anyone who claims to believe otherwise is either an idiotic dupe or a wicked liar.\n\nThough I’ve written about this myself in countless Breitbart columns, I’m a conservative writer largely preaching to the choir.\n\nComing from two ardent leftists, on the other hand, and aimed at least in part at a leftist audience, the message of Planet of the Humans is dynamite.\n\n“I’m in a strange position,” the soft-spoken Gibbs tells us at the beginning of the movie. “I’m against our addiction to fossil fuels and have long been a fan of green energy. But everywhere I encountered green energy, it wasn’t what it seemed.”\n\nAnd so we watch the scales begin to fall from Gibbs’s eyes.\n\nWe visit a zoo — powered, according to a local news story, by “renewable” elephant dung — which turns out on inspection not even to produce enough elephant dung power to heat the elephant barn.\n\nWe visit a “solar-powered” music festival where we discover that behind the scenes it is largely powered by diesel generators.\n\nWe visit an ethanol plant — whose wood has to be harvested using fossil-fuel-powered equipment and depends on its operational effectiveness on coal.\n\nWe visit a lovely old wood beloved by hikers and nature lovers in rural Vermont being trashed to build a wind farm.\n\nWe see 500-year old yuccas in the Mojave desert being torn up and shredded by diggers to make way for a “clean” energy solar plant.\n\n“It was enough to make my head explode,” Gibbs confesses at one point. “Green energy is not going to save us.”\n\nNo indeed. But it’s going to make a few ugly and cynical crony capitalists very, very rich.\n\nGibbs follows the money trail and discovers — Quelle surprise! — that the people and organizations most assiduously stoking the war on fossil fuels and most aggressively promoting “renewables” as an alternative are invariably the ones who stand to benefit most financially.\n\nAmong the Hall of Shame: Canadian activist Bill McKibben; Al Gore; Van Jones; Robert F Kennedy Jr (pictured); Jeremy Grantham; Michael Bloomberg; Richard Branson.\n\nThese are revealed to have an unhealthily cozy relationship with green NGOs like the Sierra Club and The Nature Conservancy, which mouth the usual environmental pieties while yet quietly promoting energy which is every bit as environmentally destructive as fossil fuels.\n\nThe worst of these, the documentary suggests, are biofuels and biomass.\n\nWe visit one biomass plant on the shores of Lake Superior — awarded an $11.5 million government grant because it qualifies as “renewable” energy — which encourages its green wood chips to burn with the help of tire fragments and creosote (causing the snow to turn black).\n\nTime and again — because Gibbs hangs out among his own kind: liberal-leaning environmental activists; lefty academics; etc — we witness the shock in these people’s eyes.\n\nThey consider themselves to be green; they want desperately to save the planet; yet here are these monstrosities being erected across the U.S. in the name of the environment which wipe out native forests, pollute the air, and ravage the landscape with wind towers and solar panels which are left to rot once their useful life (less than 20 years, often) is over.\n\nThis is maybe the most important thing of all about this very important movie: it will drive a wedge into the heart of the green movement and force its adherents to take sides.\n\nWill they choose to go with the evidence: which clearly shows that renewable energy is damaging to the landscape and to wildlife and does NOT reduce the use of fossil fuels (which must be kept as back up for when the wind doesn’t blow and the sun doesn’t shine)?\n\nOr will they continue to promote the fake news narrative that renewables are an eco-friendly alternative to fossil fuels?\n\nRenewable energy may well be the biggest scam in the gross, corrupt, and mendacious history of crony capitalism. It’s a scam so far-reaching that even the U.S. Navy has been persuaded to power its fleet in part with renewables.\n\nIt’s a scam so brazen that an environmental fund — Green Century Funds — promoted by Bill McKibben’s 350.org turns out on examination to have less than one percent of its holdings in the solar and wind industry; the other 99 percent comprises oil and gas infrastructure (including tar sands); biofuels; logging companies, and banks.\n\nIt’s a scam so hypocritical that last year’s Earth Day festival was sponsored by companies including car manufacturer Toyota and Caterpillar.\n\n“How can men destroy what’s left of nature to enrich themselves?” Gibbs asks of the crony-capitalist renewables industry, which has made a fortune for rent-seekers like Al Gore. He answers: “That’s why they’re billionaires and you’re not.”\n\nThough I can’t say I share many of Michael Moore’s and Jeff Gibbs’s political assumptions — certainly not the Malthusian belief underpinning the movie that overpopulation is killing our planet — I’m full of gratitude and admiration that they should have made this bold, brave documentary.\n\nWhat has always motivated me above all in my climate skepticism is my utter horror at what is being done to the planet in the name of saving it.", "opengraph": {"locale": "en_US", "type": "article", "title": "Michael Moore: The Green New Deal’s Worst Enemy", "description": "Moore's new doc ruins the entire basis of the Green New Deal and its many facsimiles.", "url": "https://climatechangedispatch.com/michael-moore-the-green-new-deals-worst-enemy/", "site_name": "Climate Change Dispatch", "article:publisher": "https://www.facebook.com/ccdispatch/", "article:author": "https://www.facebook.com/ccdeditor", "article:published_time": "2020-04-24T15:26:08+00:00", "image": "https://climatechangedispatch.com/wp-content/uploads/2020/04/rfk-jr-gibbs.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://i0.wp.com/climatechangedispatch.com/wp-content/uploads/2020/04/wind-farm-mountaintop-removal.jpg?ssl=1", "https://www.breitbart.com/entertainment/2020/04/23/delingpole-michael-moore-is-now-the-green-new-deals-worst-enemy/", "https://climatechangedispatch.com/michael-moore-the-green-new-deals-worst-enemy/?share=twitter", "https://climatechangedispatch.com/michael-moore-the-green-new-deals-worst-enemy/?share=facebook", "https://climatechangedispatch.com/michael-moore-the-green-new-deals-worst-enemy/?share=custom-1676469285", "https://climatechangedispatch.com/michael-moore-the-green-new-deals-worst-enemy/?share=custom-1654795995", "https://climatechangedispatch.com/michael-moore-the-green-new-deals-worst-enemy/?share=telegram", "https://climatechangedispatch.com/michael-moore-the-green-new-deals-worst-enemy/?share=mastodon", "https://climatechangedispatch.com/michael-moore-the-green-new-deals-worst-enemy/?share=custom-1610376378", "mailto:?subject=%5BShared%20Post%5D%20Michael%20Moore%3A%20The%20Green%20New%20Deal%E2%80%99s%20Worst%20Enemy&body=https%3A%2F%2Fclimatechangedispatch.com%2Fmichael-moore-the-green-new-deals-worst-enemy%2F&share=email", "#", "https://climatechangedispatch.com/michael-moore-the-green-new-deals-worst-enemy/?share=linkedin", "https://climatechangedispatch.com/michael-moore-the-green-new-deals-worst-enemy/?share=reddit", "https://climatechangedispatch.com/michael-moore-the-green-new-deals-worst-enemy/?share=skype", "https://climatechangedispatch.com/michael-moore-the-green-new-deals-worst-enemy/?share=pinterest", "https://climatechangedispatch.com/michael-moore-the-green-new-deals-worst-enemy/?share=jetpack-whatsapp", "https://climatechangedispatch.com/michael-moore-the-green-new-deals-worst-enemy/?share=pocket", "https://climatechangedispatch.com/michael-moore-the-green-new-deals-worst-enemy/?share=tumblr", "https://climatechangedispatch.com/michael-moore-the-green-new-deals-worst-enemy/#print"], "authors": ["ccdeditor"], "publish_date": "2020-04-24T15:26:08+00:00"}