{"result_id": "069014", "URL": "https://climatechangedispatch.com/weve-never-been-safer-from-the-climate-than-right-now/", "timestamp": "2023-04-25 14:43:15 CEST+0200", "meta": {"description": "If somebody talks about future climate danger and they don't recognize the present, they're either ignorant or a fraud.", "lang": "en", "keywords": "", "favicon": "/wp-content/themes/yoo_avanti_wp/favicon.ico", "canonical": "https://climatechangedispatch.com/weve-never-been-safer-from-the-climate-than-right-now/", "encoding": "UTF-8"}, "image": null, "domain": "climatechangedispatch.com", "title": "We've Never Been Safer From The Climate Than Right Now", "cleaned_text": "Written by Alex Epstein on . Posted in Latest news\n\nFears about climate change have reached a fever pitch. Governments, NGOs, and the media all warn that we are facing catastrophe – and it’s all our fault.\n\nOur ‘addiction’ to fossil fuels, to cheap energy, consumer goods, and travel – that is, our desire to live more materially rich lives – is now sowing the seeds of our downfall.\n\nBut is it fair to damn human progress in this way?\n\nAlex Epstein is president of the Center for Industrial Progress and author of The Moral Case for Fossil Fuels.\n\nHe joined Brendan O’Neill for the latest episode of his podcast, The Brendan O’Neill Show, to talk about humanity’s impact on nature, and why it is something to celebrate.\n\nWhat follows is an edited extract from their conversation. Listen to the full episode here.\n\nBrendan O’Neill: Language about the climate has changed a great deal. First, we went from global warming to climate change. Now, we are going from climate change to climate crisis or climate emergency.\n\nThere is this constant drumming up of awful, apocalyptic scenarios. We’re told this is a unique emergency that could end life on Earth. You have highlighted the role that the IPCC plays in stoking up these ideas.\n\nLots of people say the IPCC is relatively reasonable and that the problem is journalists and activists who take what it says out of context.\n\nBut you have a more subtle take on the interplay of these different groups. Could you tell us where you think the notion of the climate emergency is coming from and why it is so problematic?\n\nAlex Epstein: It is just a fact that human beings are far safer from the climate than they have ever been. Climate-related disaster deaths – deaths from storms, floods, extreme temperatures, and so on – have gone down 98 to 99 percent over the past century.\n\nIf somebody is talking about the future of climate danger and they do not recognize the present, they are either ignorant or a fraud.\n\nIn the past, we have had 10 times more CO2 in the atmosphere than we have now and we have also had much warmer temperatures.\n\nThere is nothing that we could conceivably do that would make the planet unliveable for humans – the most adaptable species in history. So changes in the climate are not the end of the world.\n\nThe whole idea of the climate ‘emergency’ is baseless.\n\nThe UN secretary-general, António Guterres is also indirectly the head of the IPCC. He talks about ‘code red for humanity’ and about our extinction.\n\nThat this guy is leading the organization tells you something about it. We should question how it is that this allegedly scientific organization, the IPCC, is happily participating in a process of telling the public we are in an emergency and we need to get rid of fossil fuels.\n\nNewspapers are screwing up, too. There are many documented examples in which they just wildly distort what the IPCC says.\n\nBut the IPCC itself never mentions that we are safer from the climate than ever. It is like a polio charity not mentioning that we have a polio vaccine.\n\nThe IPCC has this belief that humanity’s impact on nature is evil. Because of this, it ignores the amazing benefits of fossil fuels and the improving state of the world.\n\nO’Neill: You argue that fossil fuels do not take a safe climate and make it dangerous – they take a dangerous climate and make it safe. That is arguably the most counterintuitive thing someone could say in 2021.\n\nBut it also makes perfect sense. When I heard Boris Johnson and Greta Thunberg indicting the Industrial Revolution, I just wanted to shake them both by the scruff of the neck.\n\nIt seems so obvious to me that from the Industrial Revolution onwards, we have made the world a safer, better place. Can you tell us what you mean when you say that fossil fuels make the climate safer?\n\nEpstein: There are two ways of seeing the climate issue: through the human-flourishing framework or the anti-human-impact framework.\n\nWith the human-flourishing framework, the goal is to advance human progress, recognizing that the planet is potentially dangerous and wild. The anti-human-impact framework aims to eliminate the human impact on nature.\n\nThe starting point should be that the climate is naturally dangerous. We have to take that seriously. In my forthcoming book, Fossil Future, I write about what I call climate mastery.\n\nI look at what climate dangers look like when humans are at a low level of productive ability. It is scary – you have these devastating droughts and famines year after year.\n\nTake drought, which is historically the biggest climate-related killer. Drought-related deaths are down by over 99 percent over the past century. That is because we have been able to produce all these protections against droughts.\n\nFor example, we have irrigation through machines. Machines amplify and expand human productive ability very dramatically. We also have amazing drought-relief convoys that can save millions and millions of lives.\n\nAll this is because we have this incredible productive ability – we have figured out how to get these machines to do all of this work for us.\n\nThe dangers the IPCC is talking about are so trivial compared to the magnitude of the climate-mastery abilities we have and what losing them would mean for our safety from the climate.\n\nO’Neill: The anti-human-impact side of this discussion is sadly the dominant side. You argue that these people present themselves as part of a science-led movement.\n\nBut fundamentally, isn’t this a manifestation of anti-humanism? A manifestation of a loss of faith in humankind and a belief that any human interference with nature is in itself problematic?\n\nIt is a call to push humanity back, to rein in human aspirations and progress to create some fantasy land where we live in communion with nature.\n\nTo what extent do you think the anti-human-impact movement is simply anti-human – a movement of misanthropy?\n\nEpstein: At its core, it is. Look at the total indifference towards humanity’s need for energy in general and fossil fuels in particular.\n\nA lack of energy is a life-or-death problem for billions of people, yet there is just no concern about this, while there is a total obsession with CO2.\n\nPeople oppose fossil fuels and rationalize them by saying they care about making the climate safer. But the same people often oppose nuclear as well, even though it does not cause significant CO2 emissions.\n\nAnd there is opposition to hydro, solar, and wind. That is because the real goal of environmentalists is to eliminate humanity’s impact on nature.\n\nWe are evaluating forms of energy not by how much they benefit human flourishing, but by how little they impact nature.\n\nPeople say they want to protect the environment. But do they want to protect a good environment for human beings? Or do they want to protect the rest of nature from human beings?\n\nOften, the two get blended. I do not want to save the planet from humans – I want to improve the planet for humans.", "opengraph": {"locale": "en_US", "type": "article", "title": "We've Never Been Safer From The Climate Than Right Now", "description": "If somebody talks about future climate danger and they don't recognize the present, they're either ignorant or a fraud.", "url": "https://climatechangedispatch.com/weve-never-been-safer-from-the-climate-than-right-now/", "site_name": "Climate Change Dispatch", "article:publisher": "https://www.facebook.com/ccdispatch/", "article:author": "https://www.facebook.com/ccdeditor", "article:published_time": "2021-12-07T19:58:55+00:00", "image": "https://i0.wp.com/climatechangedispatch.com/wp-content/uploads/2021/12/protest-no-planet-b-emergency.jpg?fit=1862%2C1240&ssl=1", "image:width": "1862", "image:height": "1240", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.amazon.com/Moral-Case-Fossil-Fuels/dp/1591847443/ref=as_li_ss_tl?keywords=The+Moral+Case+for+Fossil+Fuels&qid=1638906944&sr=8-1&linkCode=sl1&tag=ccdnnsw20-20&linkId=91b25d74492ad919236267884c6f3726&language=en_US", "https://www.spiked-online.com/podcast/the-brendan-oneill-show/", "https://www.spiked-online.com/podcast-episode/why-the-world-needs-fossil-fuels/", "https://climatechangedispatch.com/why-climate-change-is-not-a-crisis/", "https://climatechangedispatch.com/after-a-century-of-global-warming-climate-related-deaths-near-zero/", "https://climatechangedispatch.com/there-is-no-climate-emergency-heres-why/", "https://climatechangedispatch.com/code-red-climate-hype-the-united-nations-is-a-propaganda-machine/", "https://www.amazon.com/gp/product/B098M3Y7VC/ref=as_li_ss_tl?ie=UTF8&linkCode=sl1&tag=ccdnnsw20-20&linkId=e4be09ccef7b57465b8baa8f30407f37&language=en_US", "https://climatechangedispatch.com/climate-related-deaths-since-1932/", "https://climatechangedispatch.com/greens-oppose-what-works-and-promote-what-doesnt/", "https://www.spiked-online.com/2021/12/06/we-are-safer-from-the-climate-than-ever/", "https://climatechangedispatch.com/weve-never-been-safer-from-the-climate-than-right-now/?share=twitter", "https://climatechangedispatch.com/weve-never-been-safer-from-the-climate-than-right-now/?share=facebook", "https://climatechangedispatch.com/weve-never-been-safer-from-the-climate-than-right-now/?share=custom-1676469285", "https://climatechangedispatch.com/weve-never-been-safer-from-the-climate-than-right-now/?share=custom-1654795995", "https://climatechangedispatch.com/weve-never-been-safer-from-the-climate-than-right-now/?share=telegram", "https://climatechangedispatch.com/weve-never-been-safer-from-the-climate-than-right-now/?share=mastodon", "https://climatechangedispatch.com/weve-never-been-safer-from-the-climate-than-right-now/?share=custom-1610376378", "mailto:?subject=%5BShared%20Post%5D%20We%27ve%20Never%20Been%20Safer%20From%20The%20Climate%20Than%20Right%20Now&body=https%3A%2F%2Fclimatechangedispatch.com%2Fweve-never-been-safer-from-the-climate-than-right-now%2F&share=email", "#", "https://climatechangedispatch.com/weve-never-been-safer-from-the-climate-than-right-now/?share=linkedin", "https://climatechangedispatch.com/weve-never-been-safer-from-the-climate-than-right-now/?share=reddit", "https://climatechangedispatch.com/weve-never-been-safer-from-the-climate-than-right-now/?share=skype", "https://climatechangedispatch.com/weve-never-been-safer-from-the-climate-than-right-now/?share=pinterest", "https://climatechangedispatch.com/weve-never-been-safer-from-the-climate-than-right-now/?share=jetpack-whatsapp", "https://climatechangedispatch.com/weve-never-been-safer-from-the-climate-than-right-now/?share=pocket", "https://climatechangedispatch.com/weve-never-been-safer-from-the-climate-than-right-now/?share=tumblr", "https://climatechangedispatch.com/weve-never-been-safer-from-the-climate-than-right-now/#print"], "authors": ["ccdeditor"], "publish_date": "2021-12-07T19:58:55+00:00"}