{"result_id": "069044", "URL": "https://climatechangedispatch.com/top-un-official-we-own-the-science-and-the-world-should-know-it/", "timestamp": "2023-04-25 14:43:30 CEST+0200", "meta": {"description": "The UN rep also bragged about how they partnered with Google so only UN climate talking points would appear.", "lang": "en", "keywords": "", "favicon": "/wp-content/themes/yoo_avanti_wp/favicon.ico", "canonical": "https://climatechangedispatch.com/top-un-official-we-own-the-science-and-the-world-should-know-it/", "encoding": "UTF-8"}, "image": null, "domain": "climatechangedispatch.com", "title": "Top UN Official: 'We Own The Science And The World Should Know It'", "cleaned_text": "Written by Tim Hinchliffe on . Posted in Latest news\n\nThe United Nations’ global communications rep tells the WEF, “We own the science, and we think that the world should know it, and the platforms themselves also do,” during a panel on disinformation.\n\nDuring the World Economic Forum’s (WEF) Sustainable Development Impact Meetings last week, the unelected globalists held a panel on “Tackling Disinformation” where participants from the UN, CNN, and Brown University discussed how to best control narratives. [bold, links added]\n\nMelissa Fleming, [pictured above, right] Under-Secretary-General for Global Communications at the United Nations, highlighted that the UN had partnered with several big tech companies, including TikTok and Google, to control COVID and climate narratives while claiming, “We own the science.”\n\nOn the topic of controlling the climate change narrative, Fleming remarked that the UN had partnered with Google so that the unelected globalists’ authoritative narratives would appear at the top of search results.\n\n“We partnered with Google,” said Fleming, adding, “for example, if you Google ‘climate change,’ you will, at the top of your search, you will get all kinds of UN resources.\n\n“We started this partnership when we were shocked to see that when we Googled ‘climate change,’ we were getting incredibly distorted information right at the top.\n\n“We’re becoming much more proactive. We own the science, and we think that the world should know it, and the platforms themselves also do,” she added.\n\nBut the unelected globalists’ efforts on narrative control didn’t end with partnering with Google to manipulate search results on climate change.\n\nFleming also highlighted that the UN worked with TikTok on the “Team Halo” project to boost COVID messaging from medical and scientific communities on the Chinese-owned video sharing platform.\n\n“We had another trusted messenger project, which was called ‘Team Halo’ where we trained scientists around the world and some doctors on TikTok, and we had TikTok working with us,” she said.\n\nThe UN claims to own the science, but if we take a closer look at who funds the UN’s “directing and coordinating authority on international health” — the World Health Organization (WHO) — we get a clearer picture of who is really calling the shots.\n\nHistorically, the Bill and Melinda Gates Foundation, along with the Gates-backed GAVI vaccine alliance, have contributed more to the WHO program budget than all member nations, save two — the US and the UK.\n\nWho owns the science again?\n\nDuring last week’s WEF panel, the UN global communications rep went on to admit that people didn’t trust institutions like the UN when it came to information related to COVID, and so to counter this, the UN looked to influencers to get its message across through the backdoor.\n\n“Another really key strategy we had was to deploy influencers,” she said, adding, “influencers who were really keen, who have huge followings, but really keen to help carry messages that were going to serve their communities, and they were much more trusted than the United Nations telling them something from New York City headquarters.”\n\nThe idea of infiltrating and subverting online groups from within by targeting influencers mirrors recommendations from a Google-backed RAND report published in April 2021.\n\nAccording to the report’s policy recommendations:\n\n“Conspiracists have their own experts on whom they lean to support and strengthen their views, and their reliance on these experts might limit the impact of formal outreach by public health professionals.\n\n“Our review of the literature shows that one alternative approach could be to direct outreach toward moderate members of those groups who could, in turn, exert influence on the broader community.”\n\nThe report went on to say, “Commercial marketing programs use a similar approach when they engage social media influencers (or brand ambassadors), who can then credibly communicate advantages of a commercial brand to their own audiences on social media.”\n\nModerating last week’s “Tackling Disinformation” panel was WEF managing director Adrian Monck, who in recent months has been name-calling critics of the WEF and components of its Great Reset agenda as white supremacists and anti-Semites engaged in far-right disinformation campaigns.\n\nWhen addressing CNN’s Rachel Smolkin, Monck said that CNN was part of a political war strategy to “own the narrative.”\n\n“CNN is both an organization that’s trying to make sense of the world and trying to establish the facts; it’s also part of a political war on who owns the narrative,” he said.\n\nAccording to MintPress News, CNN received $3.6 million in donations from none other than the Bill and Melinda Gates Foundation — the same organization that’s been heavily invested in the WHO.\n\nThe investigation revealed that Gates had also donated a whopping $319 million to many of the biggest and most influential corporate news outlets in the world.\n\nWho’s really engaged in the “political war on who owns the narrative” again?\n\nSpeaking of owning narratives, last year the WEF launched the Great Narrative initiative as a sequel to the Great Reset, with the goal of reshaping all aspects of society and the global economy.\n\nThe idea of a great narrative is something that the French philosopher Jean-Francois Lyotard called a “grand narrative,” (aka “metanarrative“) which, according to Philo-Notes, “functions to legitimize power, authority, and social customs” — everything that the great reset is trying to achieve.\n\nOnce the Great Reset has its great narrative implemented, any opposing narrative can be dismissed as disinformation, conspiracy, or extremism that must be censored and suppressed for the greater, collective good.\n\nIn one WEF panel on “Tackling Disinformation,” we saw unelected globalists claim that they basically had a monopoly on science and that corporate media was embroiled in a battle to own the narrative.\n\nAt the same time, the UN rep claimed that people who questioned the vaccine narrative were “seizing the opportunity of people being afraid” to inject disinformation.\n\nAccording to Fleming, “People who are very active in the anti-vaccine scene and others were seizing the opportunity of people being so afraid — injecting disinformation and misleading information — fueled also by some leaders and governments.”\n\nHowever, it was Britain’s King Charles III, who was a prince at the time of the great reset launch, who said in June 2020,\n\nSimilarly, WEF founder Klaus Schwab said that the pandemic represented “a rare but narrow window of opportunity” to initiate the Great Reset agenda.\n\nIf anyone was “seizing the opportunity” to exploit people’s fears during the pandemic, unelected globalists and the British crown would certainly be at the top of that list.\n\nOn the subject of free speech, Brown University’s Claire Wardle, who is “one of the world’s leading experts on misinformation,” told last week’s WEF disinformation panel that she was frustrated that people couldn’t have a “more nuanced conversation about speech” as she simultaneously engaged in a nuanced conversation about free speech.\n\nFree speech is free speech. It allows for nuanced conversation by default.\n\nHowever, that didn’t stop Wardle from complaining about free speech even as she was actively participating in it in real time.\n\n“I just wish we could have a more nuanced conversation about speech,” she said.\n\n“This idea that all speech is equal is not true, and I wish we could just have that conversation properly,” Wardle added, as she had exactly that type of conversation.\n\nBy declaring they “own the science,” partnering with big tech companies to manipulate search results to influence public opinion, and pouring millions of dollars into media outlets, the unelected globalists are once again showing their true colors for all to see.\n\nOwning the science leads to owning the narrative.\n\nControlling thought and speech means the end of a free society.\n\nWelcome to the great reset.\n\nThe unelected globalists’ authoritarian attempts to remake society out of the destruction of the old are becoming increasingly more obvious and desperate as the people’s trust in the global elites continues to crumble.", "opengraph": {"locale": "en_US", "type": "article", "title": "Top UN Official: 'We Own The Science And The World Should Know It'", "description": "The UN rep also bragged about how they partnered with Google so only UN climate talking points would appear.", "url": "https://climatechangedispatch.com/top-un-official-we-own-the-science-and-the-world-should-know-it/", "site_name": "Climate Change Dispatch", "article:publisher": "https://www.facebook.com/ccdispatch/", "article:author": "https://www.facebook.com/ccdeditor", "article:published_time": "2022-10-03T13:17:29+00:00", "article:modified_time": "2022-10-03T13:21:14+00:00", "image": "https://climatechangedispatch.com/wp-content/uploads/2022/10/un-rep-own-science.jpg", "image:width": "1600", "image:height": "1086", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe title=\"YouTube video player\" src=\"https://www.youtube.com/embed/WnarHXcGN8M?start=2797\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/WnarHXcGN8M?start=2797"}], "links": ["https://www.weforum.org/events/sustainable-development-impact-meetings-2022/sessions/tackling-disinformation", "https://www.un.org/sg/en/content/profiles/melissa-fleming", "https://climatechangedispatch.com/in-the-climate-debate-its-either-fake-news-biased-news-or-no-news/", "https://teamhalo.org/", "https://www.un.org/en/academic-impact/who", "https://i0.wp.com/climatechangedispatch.com/wp-content/uploads/2022/10/WHO-budget.png?ssl=1", "https://sociable.co/government-and-policy/google-rand-report-recommends-infiltrating-subverting-online-conspiracy-groups-within/", "https://www.rand.org/pubs/research_reports/RRA676-1.html", "https://sociable.co/web/wef-director-youll-own-nothing-be-happy-disinformation-campaign/", "https://climatechangedispatch.com/the-great-reset-is-real-and-wreaking-havoc-across-the-world/", "https://www.mintpressnews.com/documents-show-bill-gates-has-given-319-million-to-media-outlets/278943/", "https://climatechangedispatch.com/soros-gates-funded-org-says-world-may-need-climate-lockdown/", "https://sociable.co/?s=great+narrative", "https://climatechangedispatch.com/bidens-big-shift-on-climate-change-is-the-great-reset-by-stealth/", "https://philonotes.com/index.php/2020/12/08/grand-narrative/", "https://sociable.co/government-and-policy/wef-klaus-schwab-great-narrative-humankind/", "https://climatechangedispatch.com/anti-science-climate-scientists-ban-dissenting-climate-crisis-study/", "https://sociable.co/technology/skeptical-great-reset-technocratic-agenda-waited-years-crisis-exploit/", "https://sociable.co/government-and-policy/timeline-great-reset-agenda-event-201-pandemic-2020/", "https://climatechangedispatch.com/how-biden-is-laying-the-foundation-for-americas-great-reset/", "https://vivo.brown.edu/display/cwardle", "https://sociable.co/government-and-policy/wef-great-narrative-tech-society-economy-politics-nature/", "https://sociable.co/government-and-policy/we-own-science-world-should-know-un-wef-disinformation/", "https://climatechangedispatch.com/top-un-official-we-own-the-science-and-the-world-should-know-it/?share=twitter", "https://climatechangedispatch.com/top-un-official-we-own-the-science-and-the-world-should-know-it/?share=facebook", "https://climatechangedispatch.com/top-un-official-we-own-the-science-and-the-world-should-know-it/?share=custom-1676469285", "https://climatechangedispatch.com/top-un-official-we-own-the-science-and-the-world-should-know-it/?share=custom-1654795995", "https://climatechangedispatch.com/top-un-official-we-own-the-science-and-the-world-should-know-it/?share=telegram", "https://climatechangedispatch.com/top-un-official-we-own-the-science-and-the-world-should-know-it/?share=mastodon", "https://climatechangedispatch.com/top-un-official-we-own-the-science-and-the-world-should-know-it/?share=custom-1610376378", "mailto:?subject=%5BShared%20Post%5D%20Top%20UN%20Official%3A%20%27We%20Own%20The%20Science%20And%20The%20World%20Should%20Know%20It%27&body=https%3A%2F%2Fclimatechangedispatch.com%2Ftop-un-official-we-own-the-science-and-the-world-should-know-it%2F&share=email", "#", "https://climatechangedispatch.com/top-un-official-we-own-the-science-and-the-world-should-know-it/?share=linkedin", "https://climatechangedispatch.com/top-un-official-we-own-the-science-and-the-world-should-know-it/?share=reddit", "https://climatechangedispatch.com/top-un-official-we-own-the-science-and-the-world-should-know-it/?share=skype", "https://climatechangedispatch.com/top-un-official-we-own-the-science-and-the-world-should-know-it/?share=pinterest", "https://climatechangedispatch.com/top-un-official-we-own-the-science-and-the-world-should-know-it/?share=jetpack-whatsapp", "https://climatechangedispatch.com/top-un-official-we-own-the-science-and-the-world-should-know-it/?share=pocket", "https://climatechangedispatch.com/top-un-official-we-own-the-science-and-the-world-should-know-it/?share=tumblr", "https://climatechangedispatch.com/top-un-official-we-own-the-science-and-the-world-should-know-it/#print"], "authors": ["ccdeditor"], "publish_date": "2022-10-03T13:17:29+00:00"}