{"result_id": "070019", "URL": "https://www.climatedepot.com/2022/11/09/analysis-the-great-reset-a-perfect-storm/", "timestamp": "2023-04-25 14:43:44 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.climatedepot.com/2022/11/09/analysis-the-great-reset-a-perfect-storm/", "encoding": "UTF-8"}, "image": null, "domain": "www.climatedepot.com", "title": "Analysis: The Great Reset: A Perfect Storm", "cleaned_text": "Storms come in many forms and may consist of many different constituent elements, but when all these elements combine at the same critical moment, we call it a “perfect storm.” When such a storm is transposed analogically to the cultural, political, and economic realms, that is, when it seems to impact the entire social environment, we have no choice but to grasp its significance and prepare for its onset by taking protective measures.\n\nSuch a storm is now upon us. All its elements clearly point to an orchestrated intention; in other words, it cannot be an accident. And the intention we discern in the current historical moment, the underlying plan, would appear to lay the ground for what has been called a “ techno-totalitarian digital dark ageClub of RomeUnited NationsWorld Economic Forum , that is, what has come to be known as the Great Reset — the corporate takeover of property, health, currency, travel, energy, and sustenance. The upshot involves a thorough restructuring of democratic society along neo-medieval lines , an elimination of the middle class, a two-tier political order, and a reduction of the global census.\n\nThe sinister elements composing this storm are readily observable to anyone paying attention:\n• The imposition of a viral pandemic and its official response — lockdowns, social distancing, masks, quarantines, medical apartheid — that effectively closed down the public life and economic structures of entire nations, leading to loss of livelihoods, physical and psychological illness, and spiraling suicide rates.\n• The mandating of novel genomic “vaccines” that are creating mass casualties, as witnessed in the phenomenon of SADS — Sudden Adult Death Syndrome — which came into prominence post-vaccine. The plethora of dissuasive “fact-checks” on social media and the Internet are further signs that we are living in an age of censorship. The correlation between SADS and the vaccine rollout is overwhelming and may even suggest a causal link. The massive rise in stillbirths may also be attributed to the vaccines.\n• A “climate change” policy entailing carbon taxes, bans on fertilizers, the shutting down of standard energy production, the marketing of costly and inefficient electric vehicles that threaten to deplete the power grid, and the legislating of largely unworkable and extortionate green renewables based on insecure and fabricated science and dodgy computer models, whose effect has been to impoverish both producers and ordinary citizens in bringing about a new and despotic dispensation.\n• Rampant inflation, pricing the necessities of life beyond the ability of vast numbers of people to afford them.\n• The official insistence on so-called “abortion rights.”\n• The focus on and pursuit of LGBTQ+, “non-binary,” transgender, and sexual indoctrination of preschoolers and minors, creating a growing cohort of human beings who do not reproduce, i.e., a condition of sterility.\n• The proposed creation of a cashless digital economy and the introduction of digital ID with the aim of establishing a China-style social credit system, depriving the individual of personal freedom and discretionary choice.\n• The initiating of proxy wars, as in Ukraine, further resulting in crippling forms of material scarcity, economic pain, and population stress.\n\nAll these factors are occurring at the same time, that is, they are components of a perfect storm brought to bear on the global community — or, more accurately, on the community of Western nations. (“Civilization states” like Russia, China, and India, are largely immune to the concerted onslaught.)\n\nOne cannot credibly deny that there exists a conscious purpose behind so evident a concatenation of simultaneous events, envisaging a new and reductionist world order and population diminishment in every sense of the term. The liberal civilization of the West is to be replaced by an anti-capitalist global coup favoring a totalitarian governing class. Indeed, to change the metaphor, what is impending is a kind of “mass extinction event” on the level of culture, state, and civilization, a kind of ideological asteroid or “planet killer,” orbiting very close to the future.\n\nIn his 2020 Ted Talk, Bill Gates asserts that “if we do a really great job on new vaccines, health care, and reproductive health services, we could lower [world population] by ten or fifteen percent.” Vaccines and boosters seem to be having precisely that effect. Gates’ posing with WHO Director-General Tedros Adhanom Ghebreyesus, an Ethiopian Marxist revolutionary, should tell us all we need to know. Klaus Schwab’s Great Reset, backed by leading politicians, NGOs, technocrats, and globalist oligarchs, would reduce the free world geopolitically and demographically to near-global servitude.\n\nFor additional confirmation, one need only read the Meadows/Randers influential and updated book, Limits to Growth, adopted by the Club of Rome. As Dennis Meadows claims in a recent interview with the leftist online magazine Resilience, “I don’t know what a sustainable population level is now, but it’s probably much closer to a billion people, or fewer.” The authors are skeptical of growth as a function of what they call “overshoot,” of “go[ing] beyond limits accidentally,” which can ultimately produce an “ecological footprint” that is unsustainable. They do not recognize that growth and its negative offshoots can be managed without employing drastic solutions — solutions that are themselves a product of overshoot. “If a profound correction is not made soon,” they warn, “a crash of some sort is certain.” The trouble is, they are the crash.\n\nOf course, there is nothing new in their deposition. They advance what is essentially a Malthusian argument that posits an inverse ratio between (geometrically increasing) population growth and (arithmetically increasing) material resources. Paul Ehrlich’s 1968 bestseller The Population Bomb, in true Malthusian fashion, famously proclaimed that “the battle to feed all of humanity is over [and that] civilization collapse is imminent.” Interestingly, none of his dated predictions have come to pass.\n\nIndeed, the theory of universal implosion has been long discredited. Science writer Ronald Bailey, for example, puts paid to the thesis in The End of Doom, ridiculing the Malthusian refusal to “let go of the simple but clearly wrong idea that human beings are no different than a herd of deer when it comes to reproduction.” Humans are reasoning animals — at any rate, some humans — capable of dealing with pressing and seemingly intractable problems through genuine scientific discoveries and innovative approaches developed over time. As Matt Ridley mentions in his informative The Evolution of Everything, even Malthus was not a thoroughgoing catastrophist, proposing late marriage as a solution to overpopulation.\n\nNevertheless, our latter-day Malthusians, Resetters, and plutocratic Marxists persist in advancing their campaign, like avid but errant disciples of Francis Galton who claimed, “What nature does blindly, slowly, and ruthlessly, man may do providently, quickly and kindly.” The “kindly” part soon dropped out of the formulation and negative eugenics, entailing involuntary sterilization, eventually emerged as a solution to the problem of overpopulation and declining resources. (As Nicholas Wright Gillham writes in his fascinating biography A Life of Sir Francis Galton, “What eugenics wrought in the first half of the twentieth century was much worse than anything Galton would have envisioned.”)\n\nFortunately, resistance is mounting. Important books have been published, like Michael Walsh’s edited volume Against the Great Reset, Alex Jones’ The Great Reset: And the War for the World, and Marc Morano’s The Great Reset: Global Elites and the Permanent Lockdown (all highly recommended), that are eloquently and passionately sounding the alarm. So-called “populist revolts” in countries like France, Italy, and Sweden, (the latter two having elected new conservative administrations), as well as the MAGA movement in the U.S., are challenging a powerful conspiracy — not a conspiracy theory but a conspiracy fact — that seeks to destabilize the world order, uproot the foundations of long-standing usages and traditions, collapse the economic basis of the West and, in short, build back worse.\n\nThe class of power-mad manipulators behind the Great Reset pass themselves off as humanity’s benefactors. We should be neither impressed nor influenced by their presumed concern for the welfare of mankind. They are agents of destruction, not laborers in the vineyard. Murray Rothbard wisely urges in Egalitarianism as a Revolt Against Nature that “the challenge must take place at the core — at the presumed ethical supremacy of a nonsensical goal.” The goal may be nonsensical, but it is real and dangerous. Nor do ethical considerations even remotely figure in the revolutionary agenda of our presumed Samaritan patrons.\n\nPerhaps the perfect storm can be weathered. Perhaps the ideological asteroid can be deflected. But it will take awareness, knowledge, and commitment on the part of more and more people if we are to emerge on the other side of the gathering cataclysm.", "opengraph": {"type": "article", "title": "Analysis: The Great Reset: A Perfect Storm", "url": "https://www.climatedepot.com/2022/11/09/analysis-the-great-reset-a-perfect-storm/", "description": "BY DAVID SOLWAY Storms come in many forms and may consist of many different constituent elements, but when all these elements combine at the same critical moment, we call it a “perfect storm.” When…", "article:published_time": "2022-11-09T09:32:31+00:00", "article:modified_time": "2022-11-09T09:32:31+00:00", "site_name": "Climate Depot", "image": "https://s0.wp.com/i/blank.jpg", "locale": "en_US"}, "tags": ["mediacd", "reset"], "tweets": [], "movies": [], "links": ["https://pjmedia.com/columns/david-solway-2/2022/11/04/the-great-reset-a-perfect-storm-n1642854", "https://pjmedia.com/columnist/david-solway-2", "https://beforeitsnews.com/eu/2022/10/globalists-making-final-push-for-depopulated-one-world-order-how-do-we-resist-2696602.html", "https://www.clubofrome.org/impact-hubs/climate-emergency/a-green-reboot-after-the-pandemic/", "https://www.youtube.com/watch?v=RhFBzsEErvQ", "https://sociable.co/business/wef-director-youll-own-nothing-be-happy-disinformation-campaign/", "https://www.amazon.com/Coming-Neo-Feudalism-Warning-Global-Middle/dp/1641770945/ref=sr_1_1?crid=1ZESVQZZDHU1F&keywords=joel+kotkin&qid=1667331936&qu=eyJxc2MiOiIzLjQ0IiwicXNhIjoiMy4xNCIsInFzcCI6IjMuNTMifQ%3D%3D&s=books&sprefix=joel+kotkin%2Cstripbooks-intl-ship%2C126&sr=1-1", "https://www.nature.com/articles/s41598-022-10928-z.pdf?origin=ppub", "https://www.bitchute.com/video/0Yvcjovs2YkI/?fbclid=IwAR1OI5iJ4mnwqp3Ax21g-buqHt6HxFSpWSf7YXj54gZ4dEy5H0NIsJNu_os", "https://www.theepochtimes.com/exclusive-leaked-hospital-memo-reveals-500-rise-in-stillbirths-fetal-specialist-explains-likely-cause-facts-matter_4834951.html?utm_source=News&src_src=News&utm_campaign=breaking-2022-11-02-3&src_cmp=breaking-2022-11-02-3&utm_medium=email&est=y4nUZgZ3PHjGcRalUrI0wwWYSt5lfZM3VX20HmQ3aobkWuQqt8tAKHP0gKdkRPcig3I%3D", "https://www.theepochtimes.com/a-surprising-threat-to-the-us-power-grid-could-plunge-the-country-into-darkness_4833105.html?utm_source=Opinion&src_src=Opinion&utm_campaign=opinion-2022-11-02&src_cmp=opinion-2022-11-02&utm_medium=email&est=6uYV4hADBJR3MLkdxL7u3plUC5CcyXwZTaMeBAlV3dQ6Z%2BfIUb1XBC2Yb%2BQGwjMXvrs%3D", "https://www.amazon.com/Green-Tyranny-Exposing-Totalitarian-Industrial/dp/1641770449/ref=sr_1_1?crid=3OEQJH6CK1KNR&keywords=green+tyranny&qid=1667434531&qu=eyJxc2MiOiIxLjIzIiwicXNhIjoiMC45MiIsInFzcCI6IjAuNzQifQ%3D%3D&s=books&sprefix=green+tyranny%2Cstripbooks-intl-ship%2C142&sr=1-1", "https://www.cato.org/commentary/nato-vs-russia-proxy-war-ukraine-could-become-real-war", "https://www.amazon.com/Rise-Civilizational-State-Christopher-Coker/dp/1509534636/ref=sr_1_1?crid=H298M9FLC46E&keywords=Christopher+Coker+The+Rise+of+the+Civilizational+State&qid=1667419240&qu=eyJxc2MiOiIxLjU3IiwicXNhIjoiMC4wMCIsInFzcCI6IjAuMDAifQ%3D%3D&s=books&sprefix=christopher+coker+the+rise+of+the+civilizational+state%2Cstripbooks-intl-ship%2C148&sr=1-1&ufe=app_do%3Aamzn1.fos.006c50ae-5d4c-4777-9bc0-4513d670b6bc", "https://www.ted.com/talks/bill_gates_innovating_to_zero/transcript?language=en", "https://www.theepochtimes.com/dr-meryl-nass-more-vaccine-deaths-reported-to-vaers-in-the-last-20-months-than-all-vaccines-in-the-last-30-years-combined_4832677.html?utm_source=Morningbrief&src_src=Morningbrief&utm_campaign=mb-2022-11-02&src_cmp=mb-2022-11-02&utm_medium=email&est=XZ9vUmF8Gti1Tot9bEP8esdkWQnN2NnezmJ3Gc8C45hpbUYLGMJwoVWTZ8pisxtUQio%3D", "https://www.lifesitenews.com/opinion/billionaire-barbarian-at-the-gates-part-1/", "https://www.frc.org/updatearticle/20220525/who-china", "https://www.opendemocracy.net/en/oureconomy/conspiracy-theories-aside-there-something-fishy-about-great-reset/", "https://www.amazon.com/Limits-Growth-Donella-H-Meadows/dp/193149858X/ref=sr_1_1?crid=ZEQ6B92C100O&keywords=limits+to+growth&qid=1667334688&qu=eyJxc2MiOiIyLjYzIiwicXNhIjoiMS44MyIsInFzcCI6IjIuMDIifQ%3D%3D&s=books&sprefix=limits+to+growth%2Cstripbooks-intl-ship%2C175&sr=1-1&asin=193149858X&revisionId=&format=4&depth=1", "https://www.clubofrome.org/ltg50/", "https://www.resilience.org/stories/2022-02-22/dennis-meadows-on-the-50th-anniversary-of-the-publication-of-the-limits-to-growth/", "https://www.amazon.com/Essay-Principle-Population-Thomas-Malthus/dp/1450535542/ref=sr_1_2?crid=128DI81EU91TW&keywords=malthus+an+essay&qid=1667415644&qu=eyJxc2MiOiIxLjEzIiwicXNhIjoiMC4wMCIsInFzcCI6IjAuMDAifQ%3D%3D&s=books&sprefix=malthus+an+essay%2Cstripbooks-intl-ship%2C128&sr=1-2", "https://www.amazon.com/Population-Bomb-Paul-R-Ehrlich/dp/B000EI3XOS/ref=sr_1_1?crid=3CD7GPP4EUPID&keywords=paul+ehrlich+the+population+bomb&qid=1667421864&qu=eyJxc2MiOiIwLjAwIiwicXNhIjoiMC4wMCIsInFzcCI6IjAuMDAifQ%3D%3D&s=books&sprefix=paul+erlich+the+populstion+bomb%2Cstripbooks-intl-ship%2C138&sr=1-1", "https://www.amazon.com/End-Doom-Environmental-Renewal-Twenty-first/dp/1250057671/ref=sr_1_1?crid=1CUDHJISDXSWD&keywords=ronald+bailey+The+End+of+Doom&qid=1667419974&qu=eyJxc2MiOiIwLjg1IiwicXNhIjoiMC4wMCIsInFzcCI6IjAuMDAifQ%3D%3D&s=books&sprefix=ronald+bailey+the+end+of+doom%2Cstripbooks-intl-ship%2C137&sr=1-1", "https://www.amazon.com/Evolution-Everything-How-Ideas-Emerge/dp/0062296019/ref=sr_1_2?crid=5H2DTTBASLFS&keywords=matt+ridley&qid=1667507197&qu=eyJxc2MiOiI0LjI3IiwicXNhIjoiMy45NiIsInFzcCI6IjQuMDYifQ%3D%3D&s=books&sprefix=matt+ridley%2Cstripbooks-intl-ship%2C171&sr=1-2", "https://www.amazon.com/Life-Sir-Francis-Galton-Exploration/dp/0195143655/ref=sr_1_5?crid=2X4LLAK5V8UII&keywords=frANCIS+GALTON&qid=1667496672&qu=eyJxc2MiOiI0LjU4IiwicXNhIjoiNC4xOCIsInFzcCI6IjMuNjIifQ%3D%3D&s=books&sprefix=francis+galton%2Cstripbooks-intl-ship%2C132&sr=1-5", "https://www.amazon.com/Against-Great-Reset-Eighteen-Theses/dp/1637586302/ref=sr_1_12?crid=2HYJ1S6S1PGSQ&keywords=the+great+reset&qid=1667342632&qu=eyJxc2MiOiIzLjU3IiwicXNhIjoiMy4xMyIsInFzcCI6IjMuMDMifQ%3D%3D&sprefix=the+great+reset%2Caps%2C151&sr=8-12", "https://www.amazon.com/Great-Reset-War-World/dp/1510774041/ref=sr_1_1?crid=2HYJ1S6S1PGSQ&keywords=the+great+reset&qid=1667342532&qu=eyJxc2MiOiIzLjU3IiwicXNhIjoiMy4xMyIsInFzcCI6IjMuMDMifQ%3D%3D&sprefix=the+great+reset%2Caps%2C151&sr=8-1", "https://www.amazon.com/Great-Reset-Global-Permanent-Lockdown/dp/1684512387/ref=sr_1_4?crid=2HYJ1S6S1PGSQ&keywords=the+great+reset&qid=1667342632&qu=eyJxc2MiOiIzLjU3IiwicXNhIjoiMy4xMyIsInFzcCI6IjMuMDMifQ%3D%3D&sprefix=the+great+reset%2Caps%2C151&sr=8-4", "https://www.amazon.com/Egalitarianism-Revolt-Against-Nature-Essays/dp/0945466234/ref=sr_1_5?crid=3CEGCPCPX1O8I&keywords=murray+rothbard&qid=1667352552&qu=eyJxc2MiOiI1LjUzIiwicXNhIjoiNS4yMiIsInFzcCI6IjUuMDQifQ%3D%3D&s=books&sprefix=murray+rothbard%2Cstripbooks-intl-ship%2C129&sr=1-5"], "authors": [], "publish_date": "2022-11-09T09:32:31+00:00"}