{"result_id": "070011", "URL": "https://www.climatedepot.com/2022/11/16/morano-bongino-slam-john-kerry-vowing-to-use-covid-template-to-fight-climate-change/", "timestamp": "2023-04-25 14:43:39 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.climatedepot.com/2022/11/16/morano-bongino-slam-john-kerry-vowing-to-use-covid-template-to-fight-climate-change/", "encoding": "UTF-8"}, "image": null, "domain": "www.climatedepot.com", "title": "Morano & Bongino Slam John Kerry Vowing to Use ‘COVID Template’ to Fight Climate Change", "cleaned_text": "Climate Depot founder Marc Morano and Fox News host Dan Bongino slammed U.S. climate czar John Kerry’s “suicidal, climate change, global warming rollout” on Saturday after he boasted to world leaders that his climate scheme would be similar to COVID-19 restrictions.\n\n“We modeled it somewhat on the experience of what happened with vaccines,” Special Presidential Envoy for Climate Change John Kerry proclaimed at the COP27 climate conference in Sharm-el-Sheikh, Egypt, in a presentation about the “global climate crisis.”\n\nMorano, who authored the 2022 book The Great Reset: Global Elites and the Permanent Lockdown, blasted Kerry’s climate plan as a thin cover for “authoritarianism” by using the “COVID template to fight climate.”\n\nWhat a “COVID template” really means is that Americans “don’t have a say” in climate policy, Morano explained. “Democracy goes to die when they talk like that,” Morano said on the Nov. 12 edition of Unfiltered. “This is all about control,” he added.\n\nBongino went on to lambaste Kerry’s eco-fanaticism.\n\n“This has nothing to do with science,” Bongino said. “When the vax started to lose effectiveness against transmission, they almost doubled down on mandates. Their push for digital ID, digital currencies, you know, CO2 monitors – this is just a totalitarian way to control people. This has nothing to do with climate science.”\n\n“Making friendly corporations a bunch of money, mandating people to do stuff, crony capitalism,” Bongino said, summing up Kerry’s climate vision. “Sounds to me like The Great Reset.” [Emphasis added].\n\nThe Great Reset is a totalitarian set of policies endorsed by the World Economic Forum (WEF) that advocates for a “CommonPass” vaccine tracking system, woke environmental, social and governance (ESG) funds and a greater focus on “climate change.”\n\nBut similar to the disastrous government policies enacted during the heyday of the COVID-19 pandemic — online schooling, forced vaccinations and social distancing — the people in charge refuse to take responsibility for any of them, whether it’s COVID-19 or climate change. As Morano said: It’s almost like saying that “‘socialism never failed; it wasn’t done correctly in the Soviet Union; it wasn’t done correctly in Venezuela; it wasn’t done correctly in Eastern Europe; it wasn’t done correctly in Cuba.”\n\nIt’s almost as if “all the failure we see everywhere” in the wake of destructive climate change policies “is more of a reason to double down,” Morano said.\n\nMorano ripped the World Health Organization for reportedly trying to fuse COVID-19 and climate fear into a hybrid issue: “The World Health Organization was also here to morph COVID and climate together, by declaring climate a massive public health threat.”\n\nThat’s despite the fact that, as Morano criticized, “climate-related deaths have dropped ninety-nine percent in the last hundred years, and they’ve declined due to wealth creation, and development, infrastructure and fossil fuels.”\n\nFormer Vice President Al Gore also attended COP27 to push for a “climate trace app” that will track “all individual CO2 contributors globally.” But “remember,” Morano added, “Humans inhale oxygen. We exhale CO2.”", "opengraph": {"type": "article", "title": "Morano & Bongino Slam John Kerry Vowing to Use ‘COVID Template’ to Fight Climate Change", "url": "https://www.climatedepot.com/2022/11/16/morano-bongino-slam-john-kerry-vowing-to-use-covid-template-to-fight-climate-change/", "description": "By Jeffrey Clark Climate Depot founder Marc Morano and Fox News host Dan Bongino slammed U.S. climate czar John Kerry’s “suicidal, climate change, global warming rollout” on Saturday after he boast…", "article:published_time": "2022-11-16T15:58:41+00:00", "article:modified_time": "2022-11-16T15:58:41+00:00", "site_name": "Climate Depot", "image": "https://s0.wp.com/i/blank.jpg", "locale": "en_US"}, "tags": ["un", "kerry", "mediacd", "reset", "egypt"], "tweets": [], "movies": [], "links": ["https://www.state.gov/biographies/john-kerry/", "https://twitter.com/UnfilteredOnFox/status/1591619357984976896?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1591633494954115073%7Ctwgr%5E75b635b71ee847e7ec59737b1c776b46138272b6%7Ctwcon%5Es2_&ref_url=https%3A%2F%2Fwww.climatedepot.com%2F2022%2F11%2F14%2Fwatch-morano-on-fox-news-dan-bongino-reveals-the-un-climate-great-reset-summit-in-egypt-where-covid-climate-merge-democracy-goes-to-die%2F", "https://cop27.eg/#/", "https://www.climatedepot.com/about/", "https://www.amazon.com/Great-Reset-Global-Permanent-Lockdown/dp/1684512387", "https://www.foxnews.com/shows/unfiltered-with-dan-bongino", "https://www.foxnews.com/person/b/dan-bongino", "https://www.weforum.org/great-reset/", "https://www.weforum.org/videos/common-pass-travelling-the-world-in-the-covid-era", "https://www.weforum.org/agenda/2020/08/building-blocks-of-the-great-reset/", "https://www.weforum.org/agenda/2020/08/building-blocks-of-the-great-reset/", "https://www.theatlantic.com/ideas/archive/2022/10/americas-lack-of-moral-imagination-about-covid/671881/", "https://algore.com/about"], "authors": [], "publish_date": "2022-11-16T15:58:41+00:00"}