{"result_id": "070017", "URL": "https://www.climatedepot.com/2022/11/11/john-kerry-at-un-summit-says-climate-strategy-modeled-on-covid-vaccine-rollout-at-world-economic-forum-panel/", "timestamp": "2023-04-25 14:43:42 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.climatedepot.com/2022/11/11/john-kerry-at-un-summit-says-climate-strategy-modeled-on-covid-vaccine-rollout-at-world-economic-forum-panel/", "encoding": "UTF-8"}, "image": null, "domain": "www.climatedepot.com", "title": "John Kerry at UN Summit Says Climate Strategy ‘Modeled’ on Covid Vaccine Rollout at World Economic Forum Panel", "cleaned_text": "The World Economic Forum’s ‘First Movers Coalition’ climate change agenda was “modeled” off the effort to roll out vaccines during the Chinese coronavirus crisis, John Kerry said at a COP27 panel in Egypt on Tuesday. “We have an enormous challenge before us to bring to scale new technologies and to harness the deeply capable capacity of private sector entrepreneurs in order to bring them to the table because without it, no government has enough money… we need everybody behind this,” Kerry said in a speech before the panel.\n\n“The idea behind the launch of the First Movers Coalition is pretty straightforward, we needed to create demand signals in the market where they didn’t exist, which takes boldness, it takes courage from these executives who have made the decision to be a part of this.”\n\nThe First Movers Coalition was established ahead of last year’s COP26 climate summit in Glasgow in partnership between the U.S. State Department and Klaus Schwab’s World Economic Forum. The green project seeks to sign up private firms to commit to green agenda efforts to reduce carbon emissions. “We modeled it somewhat on the experience on what happened with vaccines, the government said ‘we’ll pay for it, build it,’ and the same thing with SpaceX, if you build it we are going to use it and we’ll pay for it.\n\n“People who were putting capital at risk knew that they could get a return on that capital or at least cover their expenses in the case of something like vaccines, where human life was so at risk. Well, human life is at risk now in the context of the challenges of the global climate crisis,” Kerry warned.\n\nThe World Economic Forum’s ‘First Movers Coalition’ climate change agenda was “modelled” off the effort to roll out vaccines during the Chinese coronavirus crisis, John Kerry said at a COP27 panel in Egypt on Tuesday.\n\nAppearing alongside WEF President Børge Brende and various corporate executives, US Special Presidential Envoy for Climate John Kerry said that it is urgent for the private sector to pair with governments to realise the goal of preventing the global temperature from rising and to save lives in the allegedly looming global climate crisis.\n\n“We have an enormous challenge before us to bring to scale new technologies and to harness the deeply capable capacity of private sector entrepreneurs in order to bring them to the table because without it, no government has enough money… we need everybody behind this,” Kerry said in a speech before the panel.\n\n“The idea behind the launch of the First Movers Coalition is pretty straightforward, we needed to create demand signals in the market where they didn’t exist, which takes boldness, it takes courage from these executives who have made the decision to be a part of this.\n\nThe First Movers Coalition was established ahead of last year’s COP26 climate summit in Glasgow in partnership between the U.S. State Department and Klaus Schwab’s World Economic Forum. The green project seeks to sign up private firms to commit to green agenda efforts to reduce carbon emissions.\n\n“We modelled it somewhat on the experience on what happened with vaccines, the government said ‘we’ll pay for it, build it,’ and the same thing with SpaceX, if you build it we are going to use it and we’ll pay for it.\n\n“People who were putting capital at risk knew that they could get a return on that capital or at least cover their expenses in the case of something like vaccines, where human life was so at risk. Well, human life is at risk now in the context of the challenges of the global climate crisis,” Kerry warned.\n\nKerry was joined on the WEF panel by fellow DC swamp veteran John Podesta, who now serves as Biden’s senior advisor on clean energy innovation and implementation. The former Chief of Staff for Barack Obama and longtime Clinton ally said that President Biden’s ‘Inflation Reduction Act’ will be integral in pushing the climate movement forward through various tax incentives and other methods to prop up supposedly green industries.\n\nWhile the current global energy and inflationary crises were caused in large part by left-wing governments, such as the Biden administration, spurning domestic fossil fuel production, Podesta said that the Inflation Reduction act will serve as the “backdrop and the background for those investments across those sectors, whether you are talking about clean power, carbon capture, green hydrogen, clean manufacturing.”\n\nPodesta went on to say that it should be “exciting” that global leaders are seeking to enact a “transformation of the global economy on a size and scale that’s never occurred in human history”.\n\n“You should be excited here that you are the point of that spear, transforming the global economy across the range of manufacturing, power, transportation, [and] buildings to produce the result that we are going to give.”", "opengraph": {"type": "article", "title": "John Kerry at UN Summit Says Climate Strategy ‘Modeled’ on Covid Vaccine Rollout at World Economic Forum Panel", "url": "https://www.climatedepot.com/2022/11/11/john-kerry-at-un-summit-says-climate-strategy-modeled-on-covid-vaccine-rollout-at-world-economic-forum-panel/", "description": "The World Economic Forum’s ‘First Movers Coalition’ climate change agenda was “modeled” off the effort to roll out vaccines during the Chinese coronavirus crisis, John Kerry said at a COP27 panel i…", "article:published_time": "2022-11-11T09:08:13+00:00", "article:modified_time": "2022-11-11T09:08:13+00:00", "site_name": "Climate Depot", "image": "https://s0.wp.com/i/blank.jpg", "locale": "en_US"}, "tags": ["covid", "un", "kerry", "egypt", "lockdown", "wef"], "tweets": [], "movies": [], "links": ["https://www.breitbart.com/europe/2022/11/08/john-kerry-compares-climate-strategy-to-covid-vaccine-rollout-at-world-economic-forum-panel/", "https://www.breitbart.com/author/kzindulka/", "https://www.weforum.org/first-movers-coalition"], "authors": [], "publish_date": "2022-11-11T09:08:13+00:00"}