{"result_id": "070008", "URL": "https://www.climatedepot.com/2020/12/28/you-may-need-a-covid-vaccine-passport-to-travel-in-2021/", "timestamp": "2023-04-25 14:43:37 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.climatedepot.com/2020/12/28/you-may-need-a-covid-vaccine-passport-to-travel-in-2021/", "encoding": "UTF-8"}, "image": null, "domain": "www.climatedepot.com", "title": "You May Need A COVID Vaccine Passport To Travel In 2021 – ‘Shown in order to enter concert venues, stadiums, movie theaters, offices, or even countries’", "cleaned_text": "MIAMI (CBSMiami/CNN) – In order for people to travel in 2021, they may eventually need a COVID vaccine passport.\n\nSeveral companies and technology groups have begun developing smartphone apps or systems for individuals to upload details of their COVID-19 tests and vaccinations, creating digital credentials that could be shown in order to enter concert venues, stadiums, movie theaters, offices, or even countries.\n\nThe Common Trust Network, an initiative by Geneva-based nonprofit The Commons Project and the World Economic Forum, has partnered with several airlines including Cathay Pacific, JetBlue, Lufthansa, Swiss Airlines, United Airlines and Virgin Atlantic, as well as hundreds of health systems across the United States and the government of Aruba.\n\nThe CommonPass app created by the group allows users to upload medical data such as a COVID-19 test result or, eventually, a proof of vaccination by a hospital or medical professional, generating a health certificate or pass in the form of a QR code that can be shown to authorities without revealing sensitive information. For travel, the app lists health pass requirements at the points of departure and arrival based on your itinerary.\n\n“You can be tested every time you cross a border. You cannot be vaccinated every time you cross a border,” Thomas Crampton, chief marketing and communications officer for The Commons Project, told CNN Business. He stressed the need for a simple and easily transferable set of credentials, or a “digital yellow card,” referring to the paper document generally issued as proof of vaccination.\n\nLarge tech firms are also getting in on the act. IBM developed its own app, called Digital Health Pass, which allows companies and venues to customize indicators they would require for entry including coronavirus tests, temperature checks and vaccination records. Credentials corresponding to those indicators are then stored in a mobile wallet.\n\nIn an effort to address one challenge around returning to normalcy after vaccines are distributed widely, developers may now have to confront other challenges, ranging from privacy issues to representing the varied effectiveness of different vaccines. But the most pressing challenge may simply be avoiding the disjointed implementation and mixed success of tech’s previous attempt to address the public health crisis: contact tracing apps.", "opengraph": {"type": "article", "title": "You May Need A COVID Vaccine Passport To Travel In 2021 – ‘Shown in order to enter concert venues, stadiums, movie theaters, offices, or even countries’", "url": "https://www.climatedepot.com/2020/12/28/you-may-need-a-covid-vaccine-passport-to-travel-in-2021/", "description": "MIAMI (CBSMiami/CNN) – In order for people to travel in 2021, they may eventually need a COVID vaccine passport. Several companies and technology groups have begun developing smartphone apps or sys…", "article:published_time": "2020-12-28T18:47:39+00:00", "article:modified_time": "2020-12-28T19:21:46+00:00", "site_name": "Climate Depot", "image": "https://miami.cbslocal.com/wp-content/uploads/sites/15909786/2020/12/hypatia-h_3e390c6e029a70017c6dc9004b51f6cd-h_7136b89346e1b626d732755d64021e59.jpg?w=420", "image:width": "420", "image:height": "332", "locale": "en_US"}, "tags": ["clampdown", "reset"], "tweets": [], "movies": [], "links": ["https://miami.cbslocal.com/2020/12/28/covid-vaccine-passport-travel/", "https://miami.cbslocal.com/wp-content/uploads/sites/15909786/2020/12/hypatia-h_3e390c6e029a70017c6dc9004b51f6cd-h_7136b89346e1b626d732755d64021e59.jpg"], "authors": [], "publish_date": "2020-12-28T18:47:39+00:00"}