{"result_id": "070045", "URL": "https://www.climatedepot.com/2021/09/13/new-co2-monitoring-credit-card-enables-tracking-of-carbon-footprint-on-every-purchase-monitors-cuts-off-spending-when-we-hit-our-carbon-max-mastercard-un-join-forces/", "timestamp": "2023-04-25 14:44:00 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.climatedepot.com/2021/09/13/new-co2-monitoring-credit-card-enables-tracking-of-carbon-footprint-on-every-purchase-monitors-cuts-off-spending-when-we-hit-our-carbon-max-mastercard-un-join-forces/", "encoding": "UTF-8"}, "image": null, "domain": "www.climatedepot.com", "title": "Climate Lockdowns: New CO2 monitoring credit card enables tracking of ‘carbon footprint on every purchase’ – ‘Monitors & cuts off spending when we hit our carbon max’ – Mastercard & UN join forces", "cleaned_text": "Get ready for a Chinese-style social credit system scoring when it comes to your personal spending habits and how they impact “climate change.” A new credit card called Doconomy, has launched that is “working in tight collaboration with Mastercard” and an alliance with the UN Framework Convention on Climate Change (UNFCCC) is now available so you can monitor your personal CO2 budget on every purchase you make.\n\nThe new CO2 monitoring Mastercard called Doconomy debuted in order to enable “all users to track, measure and understand their impact by presenting their carbon footprint on every purchase.” The credit cards feature the slogan on them reading “DO. Everyday Climate Action” and have a personal pledge on the rear of the card boasting: “I am taking responsibility for every transaction I make to help protect the planet.” The Mastercards feature the UN “Global Climate Action” logo on them as well.\n\nThe World Economic Forum praised Doconomy. “While many of us are aware that we need to reduce our carbon footprint, advice on doing so can seem nebulous and keeping a tab is difficult. DO monitors and cuts off spending, when we hit our carbon max,” the World Economic Forum wrote on the Doconomy CO2 monitoring website.\n\nThe Doconomy credit card website explains: “With fat, sugar and salt levels labeled on food we buy, why shouldn’t our CO2 emissions be just as visible?” asks the Doconomy website. “This type of information shouldn’t be a premium or luxury that consumers pay for, but rather an essential part of every shopping journey.” The website details how the credit card will help consumers “understand their impact by presenting their carbon footprint on every purchase.”\n\nMathias Wikström, the CEO of Doconomy, explained, “Reducing carbon emissions needs to be prioritized by all parties. At Doconomy we are proud to engage and educate around our lifestyle’s impact on the planet…The financial sector has developed a tremendous efficiency. Now that same force can address the planetary fragility.”\n\nThis new CO2 monitoring credit card follows on the heels of the new study in the Journal Nature in August 2021 calling for “personal carbon allowances” that would monitor individuals’ CO2 emissions through smart meters and tracking apps.\n\nDoconomy’s new CO2 monitoring card boasts that it has started “providing 90 million consumers with carbon footprint insights.” The credit card was launched with the aim of “educating all consumers around climate impact information as a first step towards driving awareness around the climate crisis.” The Doconomy CO2 credit card website claims it is the “largest initiative ever taken by a bank in educating its users on the impact of consumption.”\n\n“Working in tight collaboration with Mastercard, setting a global standard for carbon calculations on everyday transactions, and other frontrunners like Klarna in banking, Doconomy aims to reach 1 billion users by COP26 in November,” the Doconomy CO2 credit card website explains.\n\nMastercard unveils new Carbon Calculator tool for banks globally, as consumer passion for the environment grows – New study of consumers in 24 countries shows the pandemic is prompting billions1 to consider more sustainable behaviors – New research on sustainability, commissioned by Mastercard, reveals a marked increase in consumer passion for the environment as a result of COVID-19. More than half of those surveyed across the world (54%) see reducing their carbon footprint as more important now than pre-pandemic. … To address this, Mastercard, in collaboration with Swedish fintech Doconomy, developed the Mastercard Carbon Calculator. Now integrated across Mastercard’s global network, this feature is easy for banks to adopt and customize for eco-conscious consumers who are looking for more ways to be informed about their spending.\n\n‘FIGHT CLIMATE CHANGE WITH EVERY SWIPE’: New climate change debt card debuting: Monitors your ‘personal sustainability score’ – ‘Plant a tree every time you make a purchase’\n\nOur COVID Lockdowns, mask, mandate inspired future?! Flashback 2019 Wired Mag: ‘China’s Social Credit System’ – Compared to ‘Big Brother & every other dystopian future…the reality is…in some ways, worse’ – “China’s social credit system has been compared to Black Mirror, Big Brother and every other dystopian future sci-fi writers can think up. The reality is more complicated — and in some ways, worse. … China’s social credit system expands that idea to all aspects of life, judging citizens’ behavior and trustworthiness. Caught jaywalking, don’t pay a court bill, play your music too loud on the train — you could lose certain rights, such as booking a flight or train ticket.”\n\nChase sends letter to General Flynn’s wife telling her they’re cancelling her card because she’s a ‘reputational risk’ to the bank – then backtracks and claims it was an ‘error’\n\nCandace Owens says COVID-19 testing lab denied her service due to her political views: In the screenshot of Lee’s email that Owens posted, the co-founder of the lab wrote that her establishment “cannot support anyone who has pro-actively worked to make this pandemic worse by spreading misinformation, politicizing and DISCOURAGING the wearing of masks and actively dissuading people from receiving life-saving vaccinations.”\n\nDr. Leana Wen of the Washington Post & a CNN medical analyst: It Is Not a Constitutional Right to Board a Plane So If You Want to Travel, You Better Go Get that Vaccine – “I think we need to make it clear that there are privileges associated with being an American. That if you wish to have these privileges, you need to get vaccinated. Travel, and having the right to travel in our state, it’s not a constitutional right as far as I know to board a plane, and so saying that you want to stay unvaccinated, that is your choice, but if you want to travel, you better go get that vaccine.”\n\nFauci flip flops on vaccine mandates: “You don’t want to mandate, and try and force anyone to take a vaccine,” Fauci said earlier this year. “We’ve never done that.”\n\nFast Forward: Anthony Fauci says he would support vaccination requirement for air travel\n\nA Nigerian State Governor Godwin Obaseki stops bank access to unvacinated: Residents have until mid-September to get vaccinated or risk being barred from certain places, including banks, private functions, churches and mosques\n\nIslamabad — Pakistan’s most populous province, Punjab, has decided to combat residents’ COVID-19 vaccination hesitancy by threatening to block cell phone service to anyone who refuses inoculation. The decision to issue the threat came out of a meeting last week, led by provincial Health Minister Dr. Yasmin Rashid, as officials scrambled for ways to boost the province’s dismal vaccination rate.\n\nWatch: Glenn Beck on new climate financial rules: ‘This is the end of capitalism’ – Rips ESG or Environmental, Social, & Governance – Beck: “I want to invest in this company, it’s a gun company oh they’ve got an ESG score of two. Well I don’t care because I believe that’s going to go up. But it doesn’t matter. You’re not doing it for that anymore you’re not doing it to make money, you’re doing it for the overall good of society this is the end of capitalism.” … “It doesn’t matter that these companies might be worth more we think the investment should go to these companies because they’re socially woke. When that happens, the stock market means nothing, nothing because it is basically at the barrel of a gun the government and the big businesses have decided who’s going to get the money.”\n\n‘Genocidal…Preposterous’: Alex Epstein on ESG (Environmental Social Governance): A ‘financially ruinous, & deeply immoral movement that perpetuates poverty…threatens the security of the free world’", "opengraph": {"type": "article", "title": "Climate Lockdowns: New CO2 monitoring credit card enables tracking of ‘carbon footprint on every purchase’ – ‘Monitors & cuts off spending when we hit our carbon max’ – Mastercard & UN join forces", "url": "https://www.climatedepot.com/2021/09/13/new-co2-monitoring-credit-card-enables-tracking-of-carbon-footprint-on-every-purchase-monitors-cuts-off-spending-when-we-hit-our-carbon-max-mastercard-un-join-forces/", "description": "Get ready for a Chinese-style social credit system scoring when it comes to your personal spending habits and how they impact “climate change.” A new credit card called Doconomy, has la…", "article:published_time": "2021-09-13T16:06:52+00:00", "article:modified_time": "2022-08-24T18:39:11+00:00", "site_name": "Climate Depot", "image": "https://doconomy.com/wp-content/uploads/2020/09/white-card-solo-no-shadow.png", "image:width": "366", "image:height": "232", "image:alt": "DO. Everyday Climate Action â\u0080\u0093 Doconomy", "locale": "en_US"}, "tags": ["econoimcs", "clampdown", "reset", "lockdown", "astrology"], "tweets": [], "movies": [], "links": ["https://www.climatedepot.com/2021/09/24/fight-climate-change-with-every-swipe-new-climate-change-debt-card-debuting-monitors-your-personal-sustainability-score-plant-a-tree-every-time-you-make-a-purchase/", "https://www.climatedepot.com/2021/09/04/study-in-journal-nature-covid-passports-tracking-apps-home-smart-meters-are-key-to-implement-personal-carbon-allowances-restrictions-on-individuals-that-were-unthinkable-only-one-year-befo/", "https://www.climatedepot.com/2021/09/04/study-in-journal-nature-covid-passports-tracking-apps-home-smart-meters-are-key-to-implement-personal-carbon-allowances-restrictions-on-individuals-that-were-unthinkable-only-one-year-befo/", "https://www.climatedepot.com/2021/09/04/study-in-journal-nature-covid-passports-tracking-apps-home-smart-meters-are-key-to-implement-personal-carbon-allowances-restrictions-on-individuals-that-were-unthinkable-only-one-year-befo/", "https://www.climatedepot.com/2020/10/19/our-covid-lockdowns-mask-mandate-inspired-future-flashback-2019-wired-mag-chinas-social-credit-system-compared-to-big-brother-every-other-dystopian-future-the-reality-is-in-some-w/", "https://doconomy.com/sv/klarna-teams-up-with-doconomy-2/", "https://www.dezeen.com/2019/05/03/doconomy-climate-change-credit-card/", "http://www.climatedepot.com/wp-content/uploads/2021/09/Screen-Shot-2021-09-13-at-09.08.22.png", "https://www.climatedepot.com/2021/09/04/study-in-journal-nature-covid-passports-tracking-apps-home-smart-meters-are-key-to-implement-personal-carbon-allowances-restrictions-on-individuals-that-were-unthinkable-only-one-year-befo/", "https://www.climatedepot.com/2021/09/04/study-in-journal-nature-covid-passports-tracking-apps-home-smart-meters-are-key-to-implement-personal-carbon-allowances-restrictions-on-individuals-that-were-unthinkable-only-one-year-befo/", "https://www.climatedepot.com/2021/09/04/study-in-journal-nature-covid-passports-tracking-apps-home-smart-meters-are-key-to-implement-personal-carbon-allowances-restrictions-on-individuals-that-were-unthinkable-only-one-year-befo/", "https://www.nature.com/articles/s41893-021-00756-w#ref-CR29", "http://www.climatedepot.com/wp-content/uploads/2021/09/Screen-Shot-2021-09-13-at-09.07.42.png", "http://www.climatedepot.com/wp-content/uploads/2021/09/Screen-Shot-2021-09-13-at-09.08.55.png", "http://www.climatedepot.com/wp-content/uploads/2021/09/Screen-Shot-2021-09-13-at-09.09.17.png", "http://www.climatedepot.com/wp-content/uploads/2021/09/Screen-Shot-2021-09-13-at-09.10.48.png", "https://www.mastercard.com/news/press/2021/april/mastercard-unveils-new-carbon-calculator-tool/", "https://www.mastercard.com/news/press/2021/april/mastercard-unveils-new-carbon-calculator-tool/#ref1", "https://www.mastercard.us/en-us/vision/corp-responsibility/priceless-planet/carbon-calculator.html", "https://www.climatedepot.com/2021/09/24/fight-climate-change-with-every-swipe-new-climate-change-debt-card-debuting-monitors-your-personal-sustainability-score-plant-a-tree-every-time-you-make-a-purchase/", "https://www.climatedepot.com/2021/09/24/fight-climate-change-with-every-swipe-new-climate-change-debt-card-debuting-monitors-your-personal-sustainability-score-plant-a-tree-every-time-you-make-a-purchase/", "https://www.climatedepot.com/2020/10/19/our-covid-lockdowns-mask-mandate-inspired-future-flashback-2019-wired-mag-chinas-social-credit-system-compared-to-big-brother-every-other-dystopian-future-the-reality-is-in-some-w/", "https://www.dailymail.co.uk/news/article-9944457/Chase-tells-General-Flynns-wife-theyre-cancelling-card.html", "https://thehill.com/homenews/media/570613-candace-owens-says-covid-19-testing-lab-denied-her-service", "https://grabien.com/file.php?id=1324447 Dr. Leana Wen: It Is Not a Constitutional Right to Board a Plane So If You Want to Travel, You Better Go Get that Vaccine", "https://news.grabien.com/story-biden-admin-dont-worry-wed-never-impose-vaccine-mandate-supe", "https://nypost.com/2021/09/13/fauci-says-he-would-support-vaccine-requirement-for-air-travel/ Anthony Fauci says he would support vaccination requirement for air travel", "https://www.africanews.com/2021/09/01/nigeria-covid-health-pass-may-soon-be-imposed-in-two-states/", "https://www.cbsnews.com/amp/news/pakistan-covid-vaccine-punjab-threat-cell-phone-cut-off-no-vaccination/#app", "https://www.climatedepot.com/2021/03/09/watch-glenn-beck-on-new-climate-financial-rules-this-is-the-end-of-capitalism-rips-esg-or-environmental-social-governance/", "https://www.climatedepot.com/2021/03/09/benjamin-zycher-on-esg-environmental-social-governance-responsibility-a-blatant-effort-to-use-private-sector-resources-for-ideological-purposes/", "https://www.climatedepot.com/2021/06/25/genocidal-preposterous-alex-epstein-on-esg-environmental-social-governance-a-financially-ruinous-deeply-immoral-movement-that-perpetuates-poverty-threatens-the-security-of-the-free-wo/"], "authors": [], "publish_date": "2021-09-13T16:06:52+00:00"}