{"result_id": "070029", "URL": "https://www.climatedepot.com/2022/11/", "timestamp": "2023-04-25 14:43:50 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.climatedepot.com/2022/11/", "encoding": "UTF-8"}, "image": null, "domain": "www.climatedepot.com", "title": "November 2022 – Climate Depot", "cleaned_text": "\n• Watch: Morano on Fox & Friends on Biden okaying Venezuelan oil: We can’t drill for more U.S. energy but we can buy from ‘countries with the most egregious human rights violations & lowest environmental standards’ Fox News Channel: Marc Morano slams Biden administration for relying on Venezuelan oil: 'It's all part of their plan' - ClimateDepot.com publisher Marc Morano slams the Biden administration for restricting U.S. energy production while easing sanctions on Venezuelans for oil production. \"They are literally more concerned about hostile nations being allowed to drill than they are Pennsylvania, Oklahoma, Texas and American domestic energy. ... Let's buy energy from the countries with the most egregious human rights violations and lowest environmental standards to produce energy, but no way are we going to allow Americans. ... All they are doing is offshoring U.S. emissions.\" \"They had defunded the oil and gas industry from day one through executive orders, through the Treasury Department, through pushing environment, social governance, ESG,\" Morano told Fox & Friends co-host Carley Shimkus. \"And they've also allowed these environmental groups in sometimes in collusion with the feds to sue.\" \"So they give a permit, but then they get tied up for years and years and years, and the funding is questionable, and of course, the future permits are questionable, so that is just a red herring argument,\" he continued. \"It's not like the Biden administration is opposed to energy extraction and drilling, no, they're just opposed to it domestically for cheap political accounting tricks that claim that they're fighting global warming while offshoring U.S. emissions,\" Morano said. \"This is something that Americans have to recognize.\"\n• Watch: Federalist interviews Morano: ‘The West will be more reliant on China with this UN Green New Deal agenda’ & Explains why Trump was seen as ‘Satan’ for nixing Paris climate pact Morano: \"China doesn’t only benefit from not having to pay so-called climate reparations. But they benefit from the entire UN Green New Deal [and] net-zero agenda because the world is going to be looking to China. The U.S. buys over 80 percent of our solar panels currently from China. We rely on China for all the rare earth mining for lithium and cobalt. China is expanding mining operations in Africa — places like the Congo with allegations of underage labor of children of 8, 9 years old by international human rights groups. So this whole UN climate summit we saw in Egypt was actually the China empowerment summit.\" .. \"I interviewed as a member of the Ukrainian delegation at this conference, and they actually told me with a straight face that [what] Vladimir Putin fears [the most] is European nations doubling down on green energy. I can tell you right now, the Middle East, Venezuela, China, and Vladimir Putin’s Russia would laugh hysterically at European nations doubling down on green energy.\" ... \"The flip side of that is how do you get African nations and poor nations where a billion people don’t have adequate running water and electricity — how do you get them to sign on to these UN deals? You pay them off. You come up with a climate slush fund, the climate reparations fund. So the one thing you have to understand is the UN is very competent at one thing, Evita, and that is A) throwing a party and B) knowing how to play politics, knowing how to transfer money, knowing how to put the right interests in the right place to make things happen.\" ... \"Donald Trump was seen as Satan himself for not supporting the UN Paris climate accords and withdrawing from them.\"\n• Netherlands to forcefully shut down 3,000 farms The Great Reset is in full gear in the Netherlands as the country’s government moves to shut down thousands of farms. According to nitrogen minister Christianne van der Wal, the government purchase will be compulsory. “There is no better offer coming,” claimed van der Wal. Recent EU nature preservation rules require member states to reduce emissions across sectors of the economy. As one of Europe’s most prominent farming nations, half of the Netherlands’ emissions come from agricultural activity.\n• Snow Extent in the Northern Hemisphere in November 2022 Among the Highest in 56 years Via: SEVERE WEATHER EUROPE: Snow extent in the Northern Hemisphere at the end of November represents an important parameter for the early winter forecast. This year snow extent is running much higher than average and according to existing global estimates, it is now beyond the highest ever observed so far..Northern Hemisphere snow extent is currently indeed very high, now at about 41 million square kilometers, according to the NOAA/Rutgers Global Snow Lab. The most recent snow cover information is given in the image below.\n• Morano on Fox News Primetime: ‘You can rename UN COP27 climate summit the China Empowerment Summit’ – Let’s apply ‘ESG to Chinese-run firms in Africa’ Marc Morano, author of 'The Green Fraud,' calls out Democrats' green energy 'scam' and exploitation of African children on 'Jesse Watters Primetime.' Fox News Channel - Broadcast November 25, 2022 - Jesse Watters Primetime - w/ Rachel Campos-Duffy - Marc Morano: US is 'empowering China' with the green energy agenda Morano: \"You can rename the UN climate summit the China empowerment summit. All it’s going to do is make the once energy-dominant West more reliant on China for all this rare earth mining and with lower environmental standards and this is the most important aspect, Rachel, lower human rights standards. Whether you are talking about the Uyghurs in China or particularly in relation to your opening, kids as young as 8, and 9 years old in the coming go mining cobalt. Now, this has been reported over the years, years ago by CBS News, by CNN, so, the mainstream media is aware of it.\" \"Imagine if we applied ESG to Chinese-run firms in Africa, to Chinese Rare Earth mining in China. The media would never go along with that, the climate activists would never go along with it. But somehow, China gets a pass here and it's the same thing with climate reparations since China gets a pass they're able to do this and there's no reason to believe they're not going to be able to continue to exploit children in Africa as this goes forward because you're right there is no real pushback internationally on this.\"", "opengraph": {"type": "website", "title": "November 2022 – Climate Depot", "site_name": "Climate Depot", "image": "https://s0.wp.com/i/blank.jpg", "locale": "en_US"}, "tags": ["esg", "mediacdf", "un", "development", "mediacd", "kids", "transportation", "egypt", "china"], "tweets": [], "movies": [], "links": ["https://www.climatedepot.com/2022/11/30/apple-ceo-tim-cook-claimed-china-aligns-completely-with-apples-values-on-climate-cook-defended-ccp-as-very-fixated-on-doing-the-right-things-to-avert-climate-change/", "https://www.foxnews.com/opinion/tucker-carlson-apple-now-active-collaborator-chinas-murderous-police-state", "https://twitter.com/tomselliott/status/1597958632930353152", "https://www.yahoo.com/video/world-economic-forum-chair-klaus-005843303.html", "https://www.climatedepot.com/2021/09/10/raw-authoritarian-power-morano-on-newsmax-tv-covid-lockdowns-vaccine-passports-are-transforming-usa-into-chinese-style-one-party-state/", "https://www.climatedepot.com/2022/11/29/watch-morano-on-fox-friends-on-biden-okaying-venezuelan-oil-we-cant-drill-for-more-u-s-energy-but-we-can-buy-from-countries-with-the-most-egregious-human-rights-violations-lowest-environmen/", "https://www.climatedepot.com/2022/11/29/watch-morano-on-fox-friends-on-biden-okaying-venezuelan-oil-we-cant-drill-for-more-u-s-energy-but-we-can-buy-from-countries-with-the-most-egregious-human-rights-violations-lowest-environmen/", "https://video.foxnews.com/v/6316301227112", "https://www.foxnews.com/person/s/carley-shimkus", "https://www.climatedepot.com/2022/11/29/watch-federalist-interviews-morano/", "https://www.climatedepot.com/2022/11/29/watch-morano-explains-climate-alarmists-plan-to-follow-the-covid-emergency-lockdown-playbook/", "https://twitter.com/evitaduffy_1", "https://www.climatedepot.com/", "https://www.climatedepot.com/2022/11/28/netherlands-to-forcefully-shut-down-3000-farms/", "https://www.telegraph.co.uk/world-news/2022/11/28/netherlands-close-3000-farms-comply-eu-rules/", "https://www.climatedepot.com/2022/11/28/biden-admin-energy-policy-yes-to-drilling-in-venezuela-no-to-drilling-in-america/", "https://www.climatedepot.com/2022/11/27/watch-morano-on-oan-tv-on-klaus-schwab-praising-china-the-great-reset-central-bank-digital-currency/", "https://www.climatedepot.com/2022/11/27/snow-extent-in-the-northern-hemisphere-in-november-2022-among-the-highest-in-56-years/", "https://www.severe-weather.eu/global-weather/snow-extent-northern-hemisphere-highest-56-years-winter-cold-rrc/", "https://globalcryospherewatch.org/state_of_cryo/snow/", "https://www.climatedepot.com/2022/11/27/2022-global-tropical-cyclone-activity-likely-to-finish-lowest-in-the-satellite-record/", "https://www.climatedepot.com/2022/11/27/morano-on-fox-news-you-can-rename-un-cop27-climate-summit-the-china-empowerment-summit-china-gets-a-pass-lets-apply-esg-to-chinese-run-firms-in-africa/", "https://www.foxnews.com/video/6316173125112", "https://www.cbsnews.com/news/cobalt-children-mining-democratic-republic-congo-cbs-news-investigation/", "https://www.cnn.com/2021/05/14/energy/china-solar-panels-uyghur-forced-labor-dst-intl-hnk/index.html"], "authors": [], "publish_date": null}