{"result_id": "070036", "URL": "https://www.climatedepot.com/2022/09/22/watch-bill-gates-pivots-from-covid-to-climate-wants-to-mandate-his-patent-pending-synthetic-corn-you-will-eat-corn-and-you-will-be-happy/", "timestamp": "2023-04-25 14:43:54 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.climatedepot.com/2022/09/22/watch-bill-gates-pivots-from-covid-to-climate-wants-to-mandate-his-patent-pending-synthetic-corn-you-will-eat-corn-and-you-will-be-happy/", "encoding": "UTF-8"}, "image": null, "domain": "www.climatedepot.com", "title": "Watch: Bill Gates pivots from COVID to climate — wants to mandate his patent pending synthetic corn – You Will Eat Corn And You Will Be Happy", "cleaned_text": ": Gates touted his GMO corn as a critical solution to climate change in Africa. If this confuses you, he means that he doesn’t want African farmers to invest in and consume nutrient rich livestock, which would actually improve their lives, because Gates believes the cows, chickens, and such are contributing to “climate change.” Therefore, Bill Gates has decided that Africans must subscribe to a lifetime of You Will Eat Corn And You Will Be Happy. ... Between March 18, 2020 (the beginning of COVID Mania) and May 4, 2022, Bill Gates experienced a wealth increase from $98 billion to $129.8 billion, driven in large part from his COVID-related “investments.” Gates leveraged his wealth to successfully monopolize global COVID policy, causing devastation to millions, if not billions of people worldwide. He now seeks to do the same thing in the agriculture space, in attempting to force humanity to consume his patented “food” products in order to “save the planet.”\n\nGiven that COVID Mania is becoming increasingly unpopular with the public at large, the global ruling class has decided to rebrand their relentless campaign for technocratic tyranny. Bill Gates, for his part, is transitioning from a gene juice vaccine (mRNA) salesman to a monopolistic synthetic corn salesman. And once again, he is using the continent of Africa as the patient zero for his latest maniacal experiment.\n\nAt his annual Gatekeepers, I mean Goalkeepers, conference in New York City this week, Gates featured his lab made corn product as a solution to hunger in Africa. Gates Foundation @gatesfoundation\n\nThe Microsoft founder is deeply embedded in the climate hoax movement, and has reoriented most of his “philanthropic” endeavors behind trying to change the earth’s temperature.\n\nAt Goalkeepers, Gates touted his GMO corn as a critical solution to climate change in Africa. If this confuses you, he means that he doesn’t want African farmers to invest in and consume nutrient rich livestock, which would actually improve their lives, because Gates believes the cows, chickens, and such are contributing to “climate change.” Therefore, Bill Gates has decided that Africans must subscribe to a lifetime of You Will Eat Corn And You Will Be Happy.\n\nCorn by itself has very little nutritional value, which is why many African governments end up subsidizing a maize meal product to citizens with added nutrients and vitamins. Many African societies already embrace a corn-heavy diet. However, this diet is a bug, not a feature. It is the product of a dysfunctional agricultural environment, and not some kind of cultural staple.\n\nThe Gates plan takes a real diabolical turn when you learn that Gates and his foundation have spent the last several years buying up farmland and securing hundreds of patents for seeds and all kinds of lab made “food” products.\n\nHere’s some details on Gates’s mission from U.S. Right To Know, a healthcare investigative research non-profit:\n\n“Gates says rich countries should shift entirely to synthetic beef. And he has the intellectual property rights to sell them. As a food that can help fix the climate, Gates touts the Impossible Burger, a plant-based patty made from genetically engineered soy and textured with engineered yeast. Its manufacturer, the Gates-funded Impossible Foods, has two dozen patents and more than 100 patents pending to artificially replicate cheese, beef and chicken and permeate these products with manufactured flavors, scents and textures.\n\nSimilar to the outcome of his COVID “investments,” there is a clear financial motive to Gates’s plan to coerce people into consuming his fake food. If successful, it will surely dramatically increase his wealth and power. Between March 18, 2020 (the beginning of COVID Mania) and May 4, 2022, Bill Gates experienced a wealth increase from $98 billion to $129.8 billion, driven in large part from his COVID-related “investments.”\n\nGates leveraged his wealth to successfully monopolize global COVID policy, causing devastation to millions, if not billions of people worldwide. He now seeks to do the same thing in the agriculture space, in attempting to force humanity to consume his patented “food” products in order to “save the planet.”\n\nHailed by the media outfits he controls as a great philanthropist, the late Jeffrey Epstein’s close friend has invested billions of dollars in Africa through his non-profit. Since retiring from the tech world, Bill Gates has dedicated much of his time and energy to the continent. However, regardless of his true motives, virtually everything that Gates “works on” turns into poison. Africans have suffered greatly because of him, and his campaign to coerce a synthetic corn-based standard of living will continue that theme.", "opengraph": {"type": "article", "title": "Watch: Bill Gates pivots from COVID to climate — wants to mandate his patent pending synthetic corn – You Will Eat Corn And You Will Be Happy", "url": "https://www.climatedepot.com/2022/09/22/watch-bill-gates-pivots-from-covid-to-climate-wants-to-mandate-his-patent-pending-synthetic-corn-you-will-eat-corn-and-you-will-be-happy/", "description": "By Jordan Schachtel Given that COVID Mania is becoming increasingly unpopular with the public at large, the global ruling class has decided to rebrand their relentless campaign for technocratic tyr…", "article:published_time": "2022-09-22T20:31:20+00:00", "article:modified_time": "2022-09-22T20:31:20+00:00", "site_name": "Climate Depot", "image": "https://s0.wp.com/i/blank.jpg", "locale": "en_US"}, "tags": ["development", "reset", "Gates", "funding", "agriculture"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"500\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">.<a href=\"https://twitter.com/BillGates?ref_src=twsrc%5Etfw\">@billgates</a> has the juice. <a href=\"https://twitter.com/hashtag/corn?src=hash&amp;ref_src=twsrc%5Etfw\">#corn</a> <a href=\"https://twitter.com/hashtag/Goalkeepers2030?src=hash&amp;ref_src=twsrc%5Etfw\">#Goalkeepers2030</a> <a href=\"https://t.co/FDpvXD7dI8\">pic.twitter.com/FDpvXD7dI8</a></p>\n<p>— Gates Foundation (@gatesfoundation) <a href=\"https://twitter.com/gatesfoundation/status/1572642135882735616?ref_src=twsrc%5Etfw\">September 21, 2022</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"500\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">The Davos class is gearing up for one of the most egregious and shameless land grabs in human history and if more people don't begin speaking out against their nefarious plans they will likely get what they want; full control over you.<a href=\"https://t.co/UI8UJbZNZg\">https://t.co/UI8UJbZNZg</a></p>\n<p>— Marty Bent (@MartyBent) <a href=\"https://twitter.com/MartyBent/status/1572717247684292608?ref_src=twsrc%5Etfw\">September 21, 2022</a></p></blockquote>\n"], "movies": [], "links": ["https://ips-dc.org/1-million-covid-deaths-billionaire-wealth-up-1-7-trillion/", "https://dossier.substack.com/p/bill-gates-wants-to-force-everyone", "https://twitter.com/BillGates?ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/corn?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/Goalkeepers2030?src=hash&ref_src=twsrc%5Etfw", "https://t.co/FDpvXD7dI8", "https://twitter.com/gatesfoundation/status/1572642135882735616?ref_src=twsrc%5Etfw", "https://www.bbc.com/news/world-africa-49714037", "https://usrtk.org/bill-gates-food-tracker/radical-menu/", "https://t.co/UI8UJbZNZg", "https://twitter.com/MartyBent/status/1572717247684292608?ref_src=twsrc%5Etfw", "https://usrtk.org/bill-gates-food-tracker/radical-menu/", "https://ips-dc.org/1-million-covid-deaths-billionaire-wealth-up-1-7-trillion/", "https://grain.org/en/article/6690-how-the-gates-foundation-is-driving-the-food-system-in-the-wrong-direction"], "authors": [], "publish_date": "2022-09-22T20:31:20+00:00"}