{"result_id": "070006", "URL": "https://www.climatedepot.com/2020/12/29/german-mp-suggests-restrictions-similar-to-covid-19-lockdowns-to-fight-climate-change-warns-there-will-never-be-a-vaccine-against-co2/", "timestamp": "2023-04-25 14:43:35 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.climatedepot.com/2020/12/29/german-mp-suggests-restrictions-similar-to-covid-19-lockdowns-to-fight-climate-change-warns-there-will-never-be-a-vaccine-against-co2/", "encoding": "UTF-8"}, "image": null, "domain": "www.climatedepot.com", "title": "German MP suggests restrictions ‘similar’ to Covid-19 lockdowns to fight ‘climate change’ – Warns ‘there will never be a vaccine against CO2’", "cleaned_text": "Social Democratic MP, Karl Lauterbach, “We need measures to deal with climate change that are similar to the restrictions on personal freedom [imposed] to combat the pandemic,” the professor of health economics and epidemiology at the University of Cologne wrote in a guest piece for Die Welt newspaper. Lauterbach added, “there will never be a vaccine against CO2.” Lauterbach in Die Welt on December 27, 2020: To cope with climate change, steps are necessary that are \"analogous\" to restrictions on personal freedom due to the pandemic. [slightly different translation]: \"For me the impression remains that we in Germany and also in Europe, let alone in the United States, would not have been able to defeat this pandemic without the development of a vaccine. However , there will never be a vaccination against CO2. We, therefore, need measures to deal with climate change that are analogous to the restrictions on personal freedom in combating pandemics. I increasingly dare to doubt whether this can be achieved.\"\n\nHumanity should sacrifice “personal freedom” just as many nations did during the Covid-19 pandemic in order to successfully fight climate change, a German MP has said, adding that there will “never” be a vaccine against CO2.\n\nGermany had barely started its coronavirus vaccination campaign when a Social Democratic MP, Karl Lauterbach, warned that his compatriots need to brace themselves for yet another challenge: global warming. “We need measures to deal with climate change that are similar to the restrictions on personal freedom [imposed] to combat the pandemic,” the professor of health economics and epidemiology at the University of Cologne wrote in a guest piece for Die Welt newspaper. He added that he hoped climate change issues would play “a dominant role” during the upcoming election campaign ahead of the federal ballot scheduled for September 2021. Lauterbach admitted he was rather skeptical about whether his dream future, in which humanity would beat climate change through the sacrifice of freedoms, would ever be achieved. “My experience of combating the coronavirus pandemic has unfortunately made me extremely pessimistic about whether we will be able to successfully stop climate change in time,” he admitted.The politician said he “had an impression” that Germany, Europe, and particularly the US “would not have been able to defeat the Covid pandemic without the development of a vaccine.” All these nations are still quite far from defeating the virus, as their vaccination campaigns have only just started, and the number of new infections in these nations remains relatively high. But he appeared much more concerned about the fact “there will never be a vaccine against CO2.” According to the MP, the problem lies with the fact that Germans have “underestimated” the pandemic and continue to do so. Now, as the vaccination campaign kicks off, some might be too tempted to throw off the shackles of yet another lockdown well before the time is right to ease the restrictions, he warned. If you didn't see this coming, you are a flaming fool. https://t.co/Ex3O3Srblw", "opengraph": {"type": "article", "title": "German MP suggests restrictions ‘similar’ to Covid-19 lockdowns to fight ‘climate change’ – Warns ‘there will never be a vaccine against CO2’", "url": "https://www.climatedepot.com/2020/12/29/german-mp-suggests-restrictions-similar-to-covid-19-lockdowns-to-fight-climate-change-warns-there-will-never-be-a-vaccine-against-co2/", "description": "Humanity should sacrifice “personal freedom” just as many nations did during the Covid-19 pandemic in order to successfully fight climate change, a German MP has said, adding that there will “never…", "article:published_time": "2020-12-29T21:33:29+00:00", "article:modified_time": "2020-12-31T15:04:05+00:00", "site_name": "Climate Depot", "image": "https://img.welt.de/img/politik/deutschland/mobile223275190/1752509827-ci102l-w1024/SPD-Regionalkonferenz.jpg", "image:width": "348", "image:height": "340", "image:alt": "SPD health politician Karl Lauterbach", "locale": "en_US"}, "tags": ["clampdown", "reset", "germany"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"500\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">If you didn't see this coming, you are a flaming fool. <a href=\"https://t.co/Ex3O3Srblw\">https://t.co/Ex3O3Srblw</a></p>\n<p>— William M Briggs (@FamedCelebrity) <a href=\"https://twitter.com/FamedCelebrity/status/1344027710985805824?ref_src=twsrc%5Etfw\">December 29, 2020</a></p></blockquote>\n"], "movies": [], "links": ["https://www.welt.de/politik/deutschland/article223275012/Kampf-gegen-Klimawandel-Lauterbach-wegen-Coronazeit-pessimistisch.html", "https://www.rt.com/news/510943-germany-covid-restrictions-climate-change/", "https://t.co/Ex3O3Srblw", "https://twitter.com/FamedCelebrity/status/1344027710985805824?ref_src=twsrc%5Etfw"], "authors": [], "publish_date": "2020-12-29T21:33:29+00:00"}