{"result_id": "070024", "URL": "https://www.climatedepot.com/2022/05/31/climate-change-to-blame-for-monkeypox-outbreak-says-professor/", "timestamp": "2023-04-25 14:43:47 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.climatedepot.com/2022/05/31/climate-change-to-blame-for-monkeypox-outbreak-says-professor/", "encoding": "UTF-8"}, "image": null, "domain": "www.climatedepot.com", "title": "Climate change to blame for monkeypox outbreak, says professor", "cleaned_text": "Climate change is likely behind the global outbreak of monkeypox, a professor of health systems has said. The disease had largely been eradicated due to smallpox vaccines but the few people who do contract it usually do so in tropical rainforest areas of central and west Africa - often after coming into contact with animals. ... “Climate change is driving animal populations out of their normal ranges and human populations into areas where animals live,” Professor Staines of DCU explained to On The Record with Gavan Reilly. ... “So this is what living with climate change looks like.”\n\nClimate change is likely behind the global outbreak of monkeypox, a professor of health systems has said.\n\nThe disease had largely been eradicated due to smallpox vaccines but the few people who do contract it usually do so in tropical rainforest areas of central and west Africa – often after coming into contact with animals.\n\n“Climate change is driving animal populations out of their normal ranges and human populations into areas where animals live,” Professor Staines of DCU explained to On The Record with Gavan Reilly.\n\n“There’s a very detailed analysis of about 40 years of data published in [the journal] Nature a few months ago that documents what has happened and predicts what may happen in the future and it’s very much driven now by climate change – and to an extent by human population growth.\n\n“But climate change is pushing people into cities, it’s pushing animals into closer proximity with people and we’re seeing connections that we never saw before.\n\n“So this is what living with climate change looks like.”\n\nMonkeypox is very rarely fatal and most sufferers develop a fever, rash and swollen lymph nodes. Symptoms last for up to a month and the disease is transmitted through skin to skin contact, body fluids, respiratory droplets or contaminated items such as bedding and clothing.\n\nCOVID/Climate Merging: Modeling study claims: ‘Climate Change Will Make Pandemics Like COVID More Likely’\n\n“Climate change is creating a new age of infectious dangers.” Climate Change Could Spark Future Pandemics – “The research, published in Nature, uses modeling to map how climate change could shift the geographic ranges of 3,100 mammals species and the viruses they carry by 2070. … The findings suggest that climate change could “easily become the dominant [human] driver” of cross-species virus transmission by 2070, the authors say.” Marc Morano: “They want to keep both climate and COVID fears humming along to push their so-called solutions, so what better way than to merge the two issues!? Worried about COVID-19, then support the UN Paris climate pact, the Green New Deal, carbon taxes, etc. or else you are a gramma killer!” Meanwhile, the data does not support this latest speculative computer model COVID/Climate scare story: See: H. Sterling Burnett’s analysis: Science Crushes Claimed Link Between COVID & Climate– ‘In reality, if a modestly warming Earth has any impact on viruses and pandemics, it is to make them less likely and less severe…Historically, we know that the Black Plague arose and ran rampant in Europe and elsewhere during the Little Ice Age.’ Bill Gates warns ‘climate change’ will cause more viruses like COVID-19 – Claims ‘it’s quite clear’ it originated in bats Bill Gates: “It’s quite clear in this case, [Covid] came across through animals. And almost all our diseases, like HIV, crossed over from chimpanzees in Africa quite some time ago; Ebola came from bats, this also, with one step in between came across from bats.” – “So it’s going to keep happening, particularly with climate change where we’re invading a lot of habitats. And you want to catch it as soon as you can.”", "opengraph": {"type": "article", "title": "Climate change to blame for monkeypox outbreak, says professor", "url": "https://www.climatedepot.com/2022/05/31/climate-change-to-blame-for-monkeypox-outbreak-says-professor/", "description": "By James Wilson Climate change is likely behind the global outbreak of monkeypox, a professor of health systems has said.  The disease had largely been eradicated due to smallpox vaccines but the f…", "article:published_time": "2022-05-31T19:25:38+00:00", "article:modified_time": "2022-05-31T19:32:40+00:00", "site_name": "Climate Depot", "image": "http://www.climatedepot.com/wp-content/uploads/2022/05/Screen-Shot-2022-05-31-at-3.29.55-PM-300x215.png", "image:width": "300", "image:height": "215", "locale": "en_US"}, "tags": ["cru", "covid", "wacky", "astrology"], "tweets": [], "movies": [], "links": ["https://www.newstalk.com/news/climate-change-to-blame-for-monkeypox-outbreak-says-professor-1348966", "https://www.newstalk.com/author/jameswilson", "http://www.climatedepot.com/wp-content/uploads/2022/05/Screen-Shot-2022-05-31-at-3.20.21-PM.png", "https://www.dublinlive.ie/news/climate-change-likely-blame-monkeypox-24095087", "http://www.climatedepot.com/wp-content/uploads/2022/05/Screen-Shot-2022-05-31-at-3.29.55-PM.png", "https://www.climatedepot.com/2022/04/29/covid-climate-merging-modeling-study-claims-climate-change-will-make-pandemics-like-covid-more-likely/", "https://www.climatedepot.com/2022/04/29/covid-climate-merging-modeling-study-claims-climate-change-will-make-pandemics-like-covid-more-likely/", "https://www.theatlantic.com/science/archive/2022/04/how-climate-change-impacts-pandemics/629699/", "https://www.nature.com/articles/s41586-022-04788-w", "https://www.climatedepot.com/2020/12/14/science-crushes-rolling-stones-claimed-link-between-covid-climate/", "https://www.climatedepot.com/2022/05/04/bill-gates-warns-climate-change-will-cause-more-viruses-like-covid-19-claims-its-quite-clear-it-originated-in-bats/"], "authors": [], "publish_date": "2022-05-31T19:25:38+00:00"}