{"result_id": "070028", "URL": "https://www.climatedepot.com/2020/08/25/tucker-carlson-who-links-pandemic-to-fighting-climate-change/", "timestamp": "2023-04-25 14:43:49 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.climatedepot.com/2020/08/25/tucker-carlson-who-links-pandemic-to-fighting-climate-change/", "encoding": "UTF-8"}, "image": null, "domain": "www.climatedepot.com", "title": "Tucker Carlson: WHO Links Pandemic To Fighting Climate Change", "cleaned_text": "Fox News host Tucker Carlson said Monday that the World Health Organization (WHO) and global elites are trying to link the coronavirus to climate change.\n\n“At first, authorities told us that we could resume our lives after the curb was flattened. The curve stayed flat,” Carlson said on “Tucker Carlson Tonight.”\n\n“So, we have a new benchmark for when we can get back. When we get a vaccine. Everything will be fine once we can vaccinate against COVID-19. Many in authority told us that. They are still telling us that.”\n\nCarlson noted how Virginia is planning to make the vaccine mandatory when it is available.\n\nVaccine or not, that “will not be the end of all of this,” Carlson said. “It will never end. You can get your injection, they’ll make you get it, but you’ll still be under arrest.”\n\n“The World Health Organization says that finding a vaccine is not the goal; reordering society is the goal. Quote, ‘We will not, we cannot go back to the way things were.’ That’s a direct quote from the leader of the World Health Organization, Dr. Tedros, who by the way it is not really a doctor.”\n\nCarlson said Dr. Tedros Adhanom Ghebreyesus does not ultimately see the coronavirus as just “a public health crisis really or even a mere virus. COVID-19 … is really about global warming.\n\nAs he puts it, quote, ‘The COVID-19 pandemic has given new impetus to the need to accelerate efforts to respond to climate change.’”\n\nThe Fox News host also pointed to comments from billionaire Bill Gates, who argued that the coronavirus pandemic is really a lesson in learning how to “sacrifice even more to save the Earth from warming.”\n\nIn 2015, Gates predicted an influenza pandemic that would kill millions of people.\n\n“Now, for people who are not billionaire global influencers, this is all pretty confusing. Quick, what does the coronavirus have to do with climate change? Well, for one thing, China caused both of them.”\n\nBut Carlson said that this not the point for either Tedros or Gates.\n\n“No. For Dr. Tedrose and Bill Gates, pandemic and climate change share a very different connection. Both are useful pretexts for mass social control. Both are essentially unsolvable crises they can harness to bypass democracy and force powerless populations to obey their commands.”\n\nWHO has also linked the coronavirus with abortion, insisting that “reproductive rights” are essential medical services during the pandemic.\n\n“Now it makes sense. Ever wondered why our leaders consider the coronavirus a major public health crisis but not suicides and drug ODs? This is why. When a 26-year-old mother in New Hampshire drops dead from fentanyl, Bill Gates and Dr. Tedros don’t get more powerful. Her death is useless to them.”\n\nThe post Tucker Carlson: WHO Links Pandemic To Fighting Climate Change first appeared on Climate Change Dispatch.", "opengraph": {"type": "article", "title": "Tucker Carlson: WHO Links Pandemic To Fighting Climate Change", "url": "https://www.climatedepot.com/2020/08/25/tucker-carlson-who-links-pandemic-to-fighting-climate-change/", "description": "Tucker Carlson: WHO Links Pandemic To Fighting Climate Change Climate Change Dispatch / by David Krayden / 1h Tucker Carlson: “For Dr. Ted Tedros and Bill Gates, the pandemic and climate chan…", "article:published_time": "2020-08-25T14:37:09+00:00", "article:modified_time": "2020-08-26T19:55:23+00:00", "site_name": "Climate Depot", "image": "https://s0.wp.com/i/blank.jpg", "locale": "en_US"}, "tags": ["mediacd", "clampdown", "coronavirus", "gnd", "who", "astrology"], "tweets": [], "movies": [], "links": ["https://dailycaller.com/2020/08/24/virginia-vaccine-coronavirus-mandate/", "https://dailycaller.com/2020/03/23/bill-gates-pandemic-flu-coronavirus/", "https://dailycaller.com/2020/04/04/who-abortion-essential-coronavirus-covid-19/", "https://dailycaller.com/2020/08/25/tucker-carlson-world-health-organization-linking-coronavirus-climate-change/", "https://climatechangedispatch.com/tucker-carlson-who-links-pandemic-to-fighting-climate-change/", "https://climatechangedispatch.com/"], "authors": [], "publish_date": "2020-08-25T14:37:09+00:00"}