{"result_id": "070022", "URL": "https://www.climatedepot.com/2020/08/23/who-warns-coronavirus-vaccine-alone-wont-end-pandemic-we-cannot-go-back-to-the-way-things-were-in-particular-the-covid-19-pandemic-has-given-new-impetus-to-the-need-to-accelerate-efforts/", "timestamp": "2023-04-25 14:43:45 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.climatedepot.com/2020/08/23/who-warns-coronavirus-vaccine-alone-wont-end-pandemic-we-cannot-go-back-to-the-way-things-were-in-particular-the-covid-19-pandemic-has-given-new-impetus-to-the-need-to-accelerate-efforts/", "encoding": "UTF-8"}, "image": null, "domain": "www.climatedepot.com", "title": "The Great Reset: WHO declares ‘We cannot go back to the way things were’ – WHO Dir-Gen: ‘Covid-19 has given new impetus to the need to accelerate efforts to respond to climate change’", "cleaned_text": "The World Health Organization said Friday that a vaccine will be a “vital tool” in the global fight against the coronavirus, but it won’t end the Covid-19 pandemic on its own and there’s no guarantee scientists will find one. World leaders and the public must learn to manage the virus and make permanent adjustments to their daily lives to bring the virus down to low levels, WHO Director-General Tedros Adhanom Ghebreyesus said during a news conference from the agency’s Geneva headquarters. “At the same time, we will not, we cannot go back to the way things were.” Throughout history, outbreaks and pandemics have changed economies and societies, he said. “In particular, the Covid-19 pandemic has given new impetus to the need to accelerate efforts to respond to climate change,” he said. “The Covid-19 pandemic has given us a glimpse of our world as it could be: cleaner skies and rivers.”\n\nThe virus has infected more than 22.7 million people worldwide and killed at least 794,100 in more than seven months, according to data compiled by Johns Hopkins University. There are at least 30 potential vaccines currently in clinical trials, according to the WHO, but there is no guarantee they will be safe and effective, he said. Even though human trials for potential vaccines are progressing, scientists say key questions remain. Covid-19 was discovered in December. While numerous research papers and studies have been produced on the virus, scientists still don’t fully understand how it affects the body or how well someone is protected from reinfection after recovering. Earlier this month, Tedros said there was no “silver bullet” to the coronavirus and “there might never be.” He said world leaders can stop new outbreaks by practicing the “basics” of public health and disease control. “Testing, isolating and treating patients and tracing and quarantining their contacts. Do it all. Inform, empower and listen to communities. Do it all,” he said Aug. 3. Tedros said Friday that “every single person” can make a difference in the pandemic. “Every person and family has a responsibility to know the level of Covid-19 transmission locally and to understand what they can do to protect themselves and others,” he said.\n\nDr. Maria Van Kerkhove, head of the WHO’s emerging diseases and zoonosis unit, said it’s “very important” for the public to learn “how to live with this virus.” That will help “continue to suppress transmission, identify cases and clusters that pop up so we can quickly put those out and minimize as many deaths as possible,” she said. “In doing so, some countries may need to implement some measures again.” Van Kerkhove said some countries, using data, are now choosing to implement social distancing measures in areas where there is a high level of transmission. “What we are seeing now is a targeted approach to adding interventions that need to be put in place to get outbreaks under control and reduce the number of infections that are happening,” she said.\n\nAl Gore, UN Head, Other Elites Call For ‘Great Reset’ Of World Economy\n\nExposing Al Gore’s Deep Connection to the Post COVID Eco-Socialist ‘Great Reset’ Proposal – Earlier in June, the World Economic Forum (WEF), a highly influential nonprofit organization based in Europe, announced its plan to push for a “Great Reset” of global capitalism…The stated purpose of the “Great Reset” is to use the coronavirus pandemic as a justification to completely overhaul the entire global economy, including the U.S. economy, to make a more “equitable” world and to fight climate change…\n\nOn NBC’s Today show, Gore evoked the “Great Reset” directly and called for radical economic changes to the world economy to fight climate change. “So, I think this is a time for a ‘Great Reset,’” Gore said. “We’ve got to fix a lot of these problems that have been allowed to fester for way too long. And the climate crisis is an opportunity to create tens of millions of new jobs, clean up the air, and reduce the death rate from pandemics, by the way, because the air pollution from burning fossil fuels heightens the death rates from coronavirus.” “So, this is a time for a reset to fix a bunch of challenges, first among them the climate crisis,” Gore added.\n\nGlobal Elites Announce ‘Great Reset’ Plan—And It’s Even More Radical Than the Green New Deal\n\nThe great green reset is at odds with economic and energy reality\n\nPandemic is chance to reset global economy, says Prince Charles", "opengraph": {"type": "article", "title": "The Great Reset: WHO declares ‘We cannot go back to the way things were’ – WHO Dir-Gen: ‘Covid-19 has given new impetus to the need to accelerate efforts to respond to climate change’", "url": "https://www.climatedepot.com/2020/08/23/who-warns-coronavirus-vaccine-alone-wont-end-pandemic-we-cannot-go-back-to-the-way-things-were-in-particular-the-covid-19-pandemic-has-given-new-impetus-to-the-need-to-accelerate-efforts/", "description": "PUBLISHED FRI, AUG 21 2020 11:53 AM EDT By Berkeley Lovelace Jr. KEY POINTS World leaders and the public must learn to manage the virus and make permanent adjustments to their daily lives to bring …", "article:published_time": "2020-08-23T11:12:04+00:00", "article:modified_time": "2020-09-19T13:38:15+00:00", "site_name": "Climate Depot", "image": "https://s0.wp.com/i/blank.jpg", "locale": "en_US"}, "tags": ["clampdown", "economics", "mkey", "coronavirus"], "tweets": [], "movies": [], "links": ["https://www.cnbc.com/coronavirus/", "https://www.cnbc.com/2020/08/21/coronavirus-live-updates.html", "https://www.cnbc.com/2020/08/03/who-says-no-silver-bullet-to-coronavirus-and-there-might-never-be.html", "https://www.climatedepot.com/2020/07/07/al-gore-un-head-other-elites-call-for-great-reset-of-world-economy/", "https://www.climatedepot.com/2020/06/23/exposing-al-gores-deep-connection-to-the-post-covid-eco-socialist-great-reset-proposal/", "https://www.climatedepot.com/2020/06/06/global-elites-announce-great-reset-plan-and-its-even-more-radical-than-the-green-new-deal-stopping-socialism/", "https://www.climatedepot.com/2020/06/12/the-great-green-reset-is-at-odds-with-economic-and-energy-reality/", "https://www.climatedepot.com/2020/06/08/pandemic-is-chance-to-reset-global-economy-says-prince-charles/", "https://www.climatedepot.com/2020/08/25/tucker-carlson-who-links-pandemic-to-fighting-climate-change/"], "authors": [], "publish_date": "2020-08-23T11:12:04+00:00"}