{"result_id": "070040", "URL": "https://www.climatedepot.com/2023/02/07/horowitz-republicans-must-stop-accepting-the-premise-of-the-carbon-climate-fascism-agenda/", "timestamp": "2023-04-25 14:43:56 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.climatedepot.com/2023/02/07/horowitz-republicans-must-stop-accepting-the-premise-of-the-carbon-climate-fascism-agenda/", "encoding": "UTF-8"}, "image": null, "domain": "www.climatedepot.com", "title": "Horowitz: Republicans must stop accepting the premise of the carbon/climate fascism agenda", "cleaned_text": "Daniel Horowitz: \"Republicans [should] finally stop accepting the pseudo-science and moral premise of the left’s climate agenda. If COVID didn’t teach them the lesson about industry experts and scientific consensus being used to fundamentally transform our lives, create monopolies, and centralize power, then nothing will. COVID should serve as the Great Reset of the two-decade GOP mistake of accepting climate fascism.\" ... Carbon capture is the perfect political issue, because it allows Republicans to feign triangulation with the greenies while enriching an industry that could never naturally thrive on its own without government mandates, marketing, subsidies, and regulatory capture. ... The worst thing we could be doing now is validating the left’s premise about climate and carbon and pushing expensive ideas built upon those fallacies.\" ... \"Just as with COVID, Republicans have largely accepted the false premise behind the global warming agenda, which is depleting our quality of life, crushing our freedoms, and making everything expensive. They merely object to the extreme to which Democrats are taking it. However, once you accept the premise, you lose the argument, which is why Republicans have joined in with climate regulations on appliances, green energy mandates and subsidies, and ethanol for years. Now, with so much of the scientific premise being exposed as a scam, just like the COVID vaccine and mask $cience, it’s time to reverse every “climate” policy rooted in the premise of carbon being a pollutant.\"\n\nJust as with COVID, Republicans have largely accepted the false premise behind the global warming agenda, which is depleting our quality of life, crushing our freedoms, and making everything expensive. They merely object to the extreme to which Democrats are taking it. However, once you accept the premise, you lose the argument, which is why Republicans have joined in with climate regulations on appliances, green energy mandates and subsidies, and ethanol for years. Now, with so much of the scientific premise being exposed as a scam, just like the COVID vaccine and mask $cience, it’s time to reverse every “climate” policy rooted in the premise of carbon being a pollutant.\n\nCarbon dioxide is not a pollutant; we could not live without it. Our food comes through photosynthesis, which works off the very carbon dioxide climate alarmists are trying (but failing) to expunge from the air. The entire premise that carbon is bad and that green energy, aka devolution of society, will somehow mitigate carbon levels in the atmosphere and change the climate is as absurd as stopping a respiratory virus with a mask. Furthermore, the notion that you can (and should) somehow capture the carbon in the air in substantial quantities in a cost-effective way is lunacy, yet most Republicans buy into it.\n\nCarbon capture, the energy equivalent of masks, got top billing in North Dakota Governor Doug Burgum’s state of the state address, and he is working with Energy Secretary Jennifer Granholm and getting this gravy train funded with as much gusto as the wind and solar scams. Ditto for Wyoming Governor Mark Gordon.\n\nIndiana and Iowa are also knee-deep in the venture socialist lobbyist scam, which is capturing the upper Midwestern states. Summit Carbon Solutions is pushing for carbon dioxide pipelines for capture operations in the upper Midwest and Dakotas. The company donated to Kristi Noem’s inauguration, and its main lobbyist in South Dakota is SDGOP chair Dan Lederman. In his state of the state address, North Dakota Governor Burgum bragged, “Today, we’re on our way toward achieving carbon neutrality as a state by 2030, thanks to our extraordinary capacity to safely store over 252 billion tons of CO2, or 50 years of the nation’s CO2 output.” Nice shout-out to the globalists’ Agenda 2030!\n\nCarbon capture is the perfect political issue, because it allows Republicans to feign triangulation with the greenies while enriching an industry that could never naturally thrive on its own without government mandates, marketing, subsidies, and regulatory capture. Carbon capture is the attempt to sequester carbon emissions from power plants and route it underground, eventually landing in some sort of containment vessel. Much like wind and solar when they began, there is no commercially viable way of doing this on a large scale without having to consume as much energy as you would supposedly save in the first place – just at an astronomical cost!\n\nHowever, with enough mandates and subsidies in place, the climate fascists might eventually be able to get a tiny share of the market at a painful cost, just as they did with wind and solar. It’s the ultimate cottage industry, almost akin to the mRNA vaccine industry. This is why there’s almost not a single GOP governor who has not acceded to the need for and ability to engage in carbon capture.\n\nIn reality, just like the epidemiological curves of the virus with mask mandates, the last number of years’ worth of data on temperature and carbon levels has shown the opposite of the prevailing narrative. Green energy is skyrocketing (because it’s subsidized and mandated), temperatures have not risen, and nonetheless carbon is still increasing. Thanks to brute government force, “renewable” energy generated a greater share of America’s electricity last year than coal for the first time on record. With the “cleanest” energy at record levels and the “dirtiest” at the lowest levels, we should be on our way to a green paradise, right? Carbon delenda est?\n\nWell, it turns out that in the same year renewables increased by 12% and coal decreased by 8%, U.S. carbon emissions still ticked up by 1.3 percent in 2022. Meanwhile, despite increasing CO2 levels over the past decade – regardless of our energy policies – NOAA data shows no evidence of any warming since 2015.\n\nThus, this elusive quest to fight carbon like an enemy is all pain and no gain. Which is why China is smartly declining to participate in this civilizational masochism. In 2022, China mined 4.5 billion tons of coal, an increase of 9%, and 218 billion cubic meters of natural gas, an increase of 6.4% from 2021.\n\nOur electricity generation from coal power plants, on the other hand, is down by nearly two-thirds since 2008, and we are left with just 24 coal plants, less than a quarter of China’s inventory, even while our recoverable coal assets are enormous – 60% greater than China’s reserves.\n\nThe worst thing we could be doing now is validating the left’s premise about climate and carbon and pushing expensive ideas built upon those fallacies. Every dollar spent on carbon capture is another dollar digging our grave into an energy nuclear winter that could instead be going toward shoring up our grids with real natural fuel – oil, gas, and coal – which are indeed renewable by God. Carbon capture is another scam that is designed to stigmatize the use of the only energy sources that work in the hopes of phasing them out. Meanwhile, the energy industry will get in on the venture socialism and monetize the process itself before all coal and oil are banned.\n\nGuess who will pay for this? Every time you fill up your tank, or the truck transporting America’s vital goods fills up with diesel … you could be paying $2 more per gallon.\n\nTo that end, instead of focusing on more convoluted “all of the above” quests for “alternative” welfare queens, we should unshackle the energy sources we know are reliable. We should block all the impediments to the progress that allowed us to build the Empire State Building in a little over a year with the primitive technology of a century ago. We should focus on reforming the regulations and litigation structure that encumber every pipeline, power plant, and nuclear reactor so that we don’t keep losing more plants and reactors than we build. We must stop punishing those forms of energy, products, appliances, and vehicles that have worked for us for years and rewarding those that are unreliable, expensive, and scarce.\n\nMost of all, this will require Republicans to finally stop accepting the pseudo-science and moral premise of the left’s climate agenda. If COVID didn’t teach them the lesson about industry experts and scientific consensus being used to fundamentally transform our lives, create monopolies, and centralize power, then nothing will. COVID should serve as the Great Reset of the two-decade GOP mistake of accepting climate fascism.", "opengraph": {"type": "article", "title": "Horowitz: Republicans must stop accepting the premise of the carbon/climate fascism agenda", "url": "https://www.climatedepot.com/2023/02/07/horowitz-republicans-must-stop-accepting-the-premise-of-the-carbon-climate-fascism-agenda/", "description": "By DANIEL HOROWITZ Just as with COVID, Republicans have largely accepted the false premise behind the global warming agenda, which is depleting our quality of life, crushing our freedoms, and makin…", "article:published_time": "2023-02-07T15:41:27+00:00", "article:modified_time": "2023-02-07T15:41:27+00:00", "site_name": "Climate Depot", "image": "https://s0.wp.com/i/blank.jpg", "locale": "en_US"}, "tags": ["debate", "emissions", "gop", "co2", "funding"], "tweets": [], "movies": [], "links": ["https://www.theblaze.com/op-ed/horowitz-republicans-must-stop-accepting-the-premise-of-the-carbon-climate-fascism-agenda", "https://www.climatedepot.com/2023/02/01/were-saved-gop-announces-that-addressing-climate-change-is-absolutely-a-prime-priority-wants-to-appease-climate-conscious-voters-powerful-business-interests/", "https://www.theblaze.com/op-ed/horowitz-republicans-must-stop-accepting-the-premise-of-the-carbon-climate-fascism-agenda", "https://www.theblaze.com/u/danielhorowitz", "https://www.governor.nd.gov/news/burgum-stresses-opportunities-carbon-capture-storage-and-utilization-us-energy-secretary", "https://www.wyomingpublicmedia.org/natural-resources-energy/2023-01-11/gordon-speaks-about-energy-in-his-state-of-the-state-address", "https://www.insideindianabusiness.com/articles/governor-signs-carbon-capture-bill-adding-to-indianas-hydrogen-plans", "https://www.reuters.com/world/us/us-midwest-carbon-pipelines-backers-have-close-ties-iowa-government-2022-04-25/", "https://dakotafreepress.com/2023/01/11/summit-carbon-solutions-big-tobacco-avera-sponsor-noem-inauguration-navigator-sanford-do-not/", "https://www.governor.nd.gov/sites/www/files/documents/2023%20State%20of%20the%20State%20Address%20script%20-%20FINAL%20for%20upload.pdf", "https://rhg.com/research/us-greenhouse-gas-emissions-2022/", "https://www.nytimes.com/2023/01/10/climate/us-carbon-emissions-2022.html#:~:text=Emissions%20ticked%20up%201.3%20percent%20even%20as%20renewable%20energy%20surpassed,with%2020%20percent%20from%20coal.", "https://www.jwnenergy.com/article/2023/1/17/china-posts-record-fossil-fuel-output-as-security-/#:~:text=Fossil%20fuel%20production%20in%20China,a%20tumultuous%20year%20for%20prices.", "https://www.statista.com/statistics/253356/us-electricity-net-generation-from-coal/", "https://www.statista.com/statistics/859266/number-of-coal-power-plants-by-country/", "https://www.worldometers.info/coal/coal-reserves-by-country/", "https://www.theblaze.com/op-ed/horowitz-energy-crisis-design"], "authors": [], "publish_date": "2023-02-07T15:41:27+00:00"}