{"result_id": "070035", "URL": "https://www.climatedepot.com/2020/10/09/pm-boris-johnson-announces-britains-great-reset-no-return-to-normal-sees-lockdowns-as-trigger-for-economic-social-change/", "timestamp": "2023-04-25 14:43:53 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.climatedepot.com/2020/10/09/pm-boris-johnson-announces-britains-great-reset-no-return-to-normal-sees-lockdowns-as-trigger-for-economic-social-change/", "encoding": "UTF-8"}, "image": null, "domain": "www.climatedepot.com", "title": "PM Boris Johnson announces Britain’s ‘Great Reset’ – No return to ‘normal’ – Sees lockdowns as ‘trigger for economic & social change’", "cleaned_text": "Neil Clark: In his keynote speech yesterday, Prime Minister Boris Johnson specifically ruled out a return to normal, not even with a vaccine. Johnson: “After all we have been through, it isn’t enough just to go back to normal. We have lost too much. History teaches us that things of this magnitude – wars, famines, plagues, events that affect the vast bulk of humanity, as this virus has – they do not just come and go. They can be the trigger for economic and social change.”\n\nWhen I heard Johnson utter those words I thought, ‘where have I heard this stuff before?’ Well, the answer is in the book ‘Covid-19: The Great Reset’ by Klaus Schwab, the executive chairman of the World Economic Forum, and Thierry Malleret. They too, like Johnson, invoked the Second World War as the trigger for fundamental changes, not only to the global order and global economy, but to society and the way human beings interact with one another. Like Johnson, they don’t want to return to normal. “Many of us are pondering when things will return to normal. The short response is never.”\n\nSchwab’s elitist Davos-man utopia is a trans-human, socially distanced, utterly soulless dystopia for the rest of us. Think of the most terrifying sci-film you’ve ever watched and that still doesn’t go anywhere near it. And the worst thing is that it is sold to us as some kind of ‘progressive’ vision.Instead, Schwab and Malleret want a world changed forever by a virus which they admit is only ‘mild’ compared to others in history. Covid-19 is seen as the catalyst for the ‘Fourth Industrial Revolution’.\n\nAlthough Johnson didn’t use the phrase ‘The Fourth Industrial Revolution’, he did mention a ‘Green Industrial Revolution’ twice. … Johnson foresees a future in which every home in Britain relies on wind power (he certainly produces a lot of that), and “instead of being dragged on big commutes to the city” people can “start a business in their home town… and bring up their children in the neighbourhoods where they grew up themselves.”\n\nWorking from home is here to stay, with “gigabit broadband,” shopping from home, conferencing from home… in fact, let’s do everything from home. Who needs to meet other human beings? Not that there’d be anywhere to meet, with pubs, cinemas and theatres all closed down due to the never-ending coronavirus restrictions. … It was the WEF that in July was promoting a Covid-19 ‘Health Passport’ app, the ‘brainchild’ of one of its ‘Young Global Leaders’, as the future for travel and attending events.\n\nIf you take a look at the ‘founding partners’ of the WEF’s Centre for the Fourth Industrial Revolution you’ll see names such as Microsoft, Palantir, Facebook, Netflix and Gavi, The Vaccine Alliance, founded by the Bill and Melinda Gates Foundation. Yes, that’s right, hi-tech online giants and hi-tech multi-billionaires supporting a big shift towards a stay-at-home, ‘do everything on the Internet’ society.\n\nThe UK Prime Minister’s remote speech to his party conference saw him dismiss the idea of returning to normality. Is he using Covid-19 to follow the World Economic Forum’s ‘Great Reset’ agenda, as many have warned?\n\n‘It’s not really about public health or a virus. They have another agenda.’ That’s what the so-called ‘conspiracy theorists’ have been saying since March, when the first British lockdowns were imposed and our lives were turned upside down. Those ‘conspiracy theorists’ were denounced, as always, as ‘cranks’ and ‘flat-Earthers’ but here we are in October, and, let’s face it, there is absolutely no sign, despite very low numbers of deaths ‘with’ Coronavirus, that we are returning to anything like normal. In fact, in his keynote speech yesterday, Prime Minister Boris Johnson specifically ruled out a return to normal, not even with a vaccine. “After all we have been through, it isn’t enough just to go back to normal. We have lost too much. History teaches us that things of this magnitude – wars, famines, plagues, events that affect the vast bulk of humanity, as this virus has – they do not just come and go. They can be the trigger for economic and social change.” When I heard Johnson utter those words I thought, ‘where have I heard this stuff before?’ Well, the answer is in the book ‘Covid-19: The Great Reset’ by Klaus Schwab, the executive chairman of the World Economic Forum, and Thierry Malleret. They too, like Johnson, invoked the Second World War as the trigger for fundamental changes, not only to the global order and global economy, but to society and the way human beings interact with one another. Like Johnson, they don’t want to return to normal. “Many of us are pondering when things will return to normal. The short response is never.” As to where all this is heading, I recommend you read Schwab’s ‘Great Reset’, and his earlier ‘The Fourth Industrial Revolution’, but please don’t do so late at night, because they will probably give you nightmares. Schwab’s elitist Davos-man utopia is a trans-human, socially distanced, utterly soulless dystopia for the rest of us. Think of the most terrifying sci-film you’ve ever watched and that still doesn’t go anywhere near it. And the worst thing is that it is sold to us as some kind of ‘progressive’ vision.Instead, Schwab and Malleret want a world changed forever by a virus which they admit is only ‘mild’ compared to others in history. Covid-19 is seen as the catalyst for the ‘Fourth Industrial Revolution’. Johnson, in his speech yesterday, showed he’s a fully-signed up ‘Great Resetter’. It was, for me, the most chilling oration ever made by any British prime minister at a party conference. The man who justified a national lockdown in March on a purely temporary three-week basis to ‘flatten the curve’, and ‘protect the NHS’, and who said in the summer, after the lockdown had lasted three months, that he hoped Britain would return to ‘significant normality’ by November, now tells us: “We have been through too much frustration and hardship just to settle for the status quo ante – to think that life can go on as it was before the plague; and it will not… We are resolving not to go back to 2019.” For Johnson, using the globalists’ phrase ‘Build Back Better’, this is the time to launch Britain on the ‘Fourth Industrial Revolution’. “From internet shopping to working from home, it looks as though Covid has massively accelerated changes in the world of work… as old jobs are lost and as new ones are created… The Covid crisis is a catalyst for change…” he said. Did Schwab actually write his speech? It looks like it. Although Johnson didn’t use the phrase ‘The Fourth Industrial Revolution’, he did mention a ‘Green Industrial Revolution’ twice. Johnson foresees a future in which every home in Britain relies on wind power (he certainly produces a lot of that), and “instead of being dragged on big commutes to the city” people can “start a business in their home town… and bring up their children in the neighbourhoods where they grew up themselves.” Working from home is here to stay, with “gigabit broadband,” shopping from home, conferencing from home… in fact, let’s do everything from home. Who needs to meet other human beings? Not that there’d be anywhere to meet, with pubs, cinemas and theatres all closed down due to the never-ending coronavirus restrictions. Johnson pledged to make Britain “the greatest place on Earth” but to me it sounds more like hell. The question, as ever, is who benefits? ALSO ON RT.COMBoris Johnson’s £100bn Operation Moonshot needs to be shot down – fastThe World Economic Forum, founded by Schwab, has been incredibly influential when it comes to the changes we’ve already seen in 2020, and what is being openly planned for the future. It was the WEF which co-hosted the ‘Event 201’ conference in New York in October 2019, which modelled a fictional global pandemic. It was at the WEF’s annual meeting in Davos on January 24, 2020 that Bill Gates’ Coalition for Epidemic Preparedness and Innovations (CEPI) held a press conference to announce a ‘new partnership’ to develop vaccines for the virus, when the number of confirmed worldwide cases was still in the hundreds. It was the WEF’s Schwab who declared in June: “The pandemic represents a rare but narrow window of opportunity to reflect, reimagine and reset our world.” It was the WEF that in July was promoting a Covid-19 ‘Health Passport’ app, the ‘brainchild’ of one of its ‘Young Global Leaders’, as the future for travel and attending events. And for those who don’t have the app or a ‘negative‘ test result? Well, you can just stay at home. If you take a look at the ‘founding partners’ of the WEF’s Centre for the Fourth Industrial Revolution you’ll see names such as Microsoft, Palantir, Facebook, Netflix and Gavi, The Vaccine Alliance, founded by the Bill and Melinda Gates Foundation. Yes, that’s right, hi-tech online giants and hi-tech multi-billionaires supporting a big shift towards a stay-at-home, ‘do everything on the Internet’ society. Is it a ‘conspiracy theory’ to say that Covid-19 is being used as a convenient opportunity to introduce long-planned changes to the economy and society, when those pushing for such changes like Schwab openly talk of there being a “rare but narrow window” for a major ‘reset’? Actually, after Johnson’s speech yesterday, the biggest ‘conspiracy theorists’ now are those who DON’T think the British government is working to another agenda. Think your friends would be interested? Share this story!", "opengraph": {"type": "article", "title": "PM Boris Johnson announces Britain’s ‘Great Reset’ – No return to ‘normal’ – Sees lockdowns as ‘trigger for economic & social change’", "url": "https://www.climatedepot.com/2020/10/09/pm-boris-johnson-announces-britains-great-reset-no-return-to-normal-sees-lockdowns-as-trigger-for-economic-social-change/", "description": "Neil Clark: In his keynote speech yesterday, Prime Minister Boris Johnson specifically ruled out a return to normal, not even with a vaccine. Johnson: “After all we have been through, it isn’t enou…", "article:published_time": "2020-10-09T12:50:55+00:00", "article:modified_time": "2020-10-09T12:55:23+00:00", "site_name": "Climate Depot", "image": "https://s0.wp.com/i/blank.jpg", "locale": "en_US"}, "tags": ["clampdown", "economics", "coronavirus", "reset"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"500\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">No holidays, no weddings, no family celebrations, no live music, no live sport, no nights out, no cinemas, no theatre, no bustling bars, no buzzing restaurants. <br/>No spontaneity, nor any way to plan for the future.<br/>No life. <br/>Enough is enough.</p>\n<p>— Oliver Smith (@ollysmithtravel) <a href=\"https://twitter.com/ollysmithtravel/status/1314095805888958466?ref_src=twsrc%5Etfw\">October 8, 2020</a></p></blockquote>\n"], "movies": [], "links": ["https://www.rt.com/op-ed/502795-boris-johnson-uk-great-reset/", "https://www.conservatives.com/news/boris-johnson-read-the-prime-ministers-keynote-speech-in-full", "https://www.cnbc.com/2020/07/14/coronavirus-must-lead-to-real-change-to-avoid-risk-of-revolutions-wef-founder.html", "https://www.rt.com/op-ed/501395-boris-johnson-operation-moonshot/", "https://www.centerforhealthsecurity.org/event201/", "https://www.youtube.com/watch?v=0-FQbhkWYuY&ab_channel=WorldEconomicForum", "https://www.weforum.org/agenda/2020/01/wuhan-coronavirus-china-cepi-vaccine-davos/", "https://www.weforum.org/agenda/2020/06/now-is-the-time-for-a-great-reset/", "https://www.weforum.org/agenda/2020/07/covid-19-passport-app-health-travel-covidpass-quarantine-event/", "https://www.rt.com/op-ed/497272-clear-health-pass-covid-dystopian/", "https://www.weforum.org/centre-for-the-fourth-industrial-revolution", "https://twitter.com/ollysmithtravel/status/1314095805888958466?ref_src=twsrc%5Etfw"], "authors": [], "publish_date": "2020-10-09T12:50:55+00:00"}