{"result_id": "070014", "URL": "https://www.climatedepot.com/2022/09/02/energy-lockdowns-have-arrived-during-colorado-heatwave-thousands-locked-out-of-control-over-their-home-thermostat-during-energy-emergency/", "timestamp": "2023-04-25 14:43:40 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.climatedepot.com/2022/09/02/energy-lockdowns-have-arrived-during-colorado-heatwave-thousands-locked-out-of-control-over-their-home-thermostat-during-energy-emergency/", "encoding": "UTF-8"}, "image": null, "domain": "www.climatedepot.com", "title": "Energy Lockdowns Have Arrived: During Colorado heatwave, thousands locked out of control over their home thermostat during ‘energy emergency’", "cleaned_text": "But Talarico said he had no idea that he could be locked out of the thermostat. While he has solar panels and a smart thermostat to save energy, he says he did not sign up to have this much control taken away. \"To me, an emergency means there is, you know, life, limb, or, you know, some other danger out there — some, you know, massive wildfires,\" Talarico said. \"Even if it's a once-in-a-blue-moon situation, it just doesn't sit right with us to not be able to control our own thermostat in our house.\"\n\nXcel confirmed to Contact Denver7 that 22,000 customers who had signed up for the Colorado AC Rewards program were locked out of their smart thermostats for hours on Tuesday. \"It's a voluntary program. Let's remember that this is something that customers choose to be a part of based on the incentives,\" said Emmett Romine, vice president of customer solutions and innovation at Xcel. ...\n\n\"Normally, when we see a message like that, we're able to override it,\" Talarico said. \"In this case, we weren't. So, our thermostat was locked in at 78 or 79.\"\n\nThat's when he saw a message on the thermostat stating the temperature was locked due to an \"energy emergency.\"\n\n\"I mean, it was 90 out, and it was right during the peak period,\" Talarico said. \"It was hot.\"\n\nThousands of Xcel customers locked out of thermostats during ‘energy emergency’\n\n22,000 people lost control of temperatures in their homes for hours Tuesday\n\nDENVER — During the dog days of summer, it’s important to keep your home cool. But when thousands of Xcel customers in Colorado tried adjusting their thermostats Tuesday, they learned they had no control over the temperatures in their own homes.\n\nTemperatures climbed into the 90s Tuesday, which is why Tony Talarico tried to crank up the air conditioning in his partner’s Arvada home.\n\n“I mean, it was 90 out, and it was right during the peak period,” Talarico said. “It was hot.”\n\nThat’s when he saw a message on the thermostat stating the temperature was locked due to an “energy emergency.”\n\n“Normally, when we see a message like that, we’re able to override it,” Talarico said. “In this case, we weren’t. So, our thermostat was locked in at 78 or 79.”\n\nOn social media, dozens of Xcel customers complained of similar experiences — some reporting home temperatures as high as 88 degrees.\n\nXcel confirmed to Contact Denver7 that 22,000 customers who had signed up for the Colorado AC Rewards program were locked out of their smart thermostats for hours on Tuesday.\n\n“It’s a voluntary program. Let’s remember that this is something that customers choose to be a part of based on the incentives,” said Emmett Romine, vice president of customer solutions and innovation at Xcel.\n\nCustomers receive a $100 credit for enrolling in the program and $25 annually, but Romine said customers also agree to give up some control to save energy and money and make the system more reliable.\n\n“So, it helps everybody for people to participate in these programs. It is a bit uncomfortable for a short period of time, but it’s very, very helpful,” said Romine.\n\nThis is the first time in the program’s six year span that customers could not override their smart thermostats, Romine said. He said the “energy emergency” was due to an unexpected outage in Pueblo combined with hot weather and heavy air conditioner usage.\n\nBut Talarico said he had no idea that he could be locked out of the thermostat. While he has solar panels and a smart thermostat to save energy, he says he did not sign up to have this much control taken away.\n\n“To me, an emergency means there is, you know, life, limb, or, you know, some other danger out there — some, you know, massive wildfires,” Talarico said. “Even if it’s a once-in-a-blue-moon situation, it just doesn’t sit right with us to not be able to control our own thermostat in our house.”", "opengraph": {"type": "article", "title": "Energy Lockdowns Have Arrived: During Colorado heatwave, thousands locked out of control over their home thermostat during ‘energy emergency’", "url": "https://www.climatedepot.com/2022/09/02/energy-lockdowns-have-arrived-during-colorado-heatwave-thousands-locked-out-of-control-over-their-home-thermostat-during-energy-emergency/", "description": "Thousands of Xcel customers locked out of thermostats during ‘energy emergency’ 22,000 people lost control of temperatures in their homes for hours Tuesday By: Jaclyn Allen DENVER — Dur…", "article:published_time": "2022-09-02T15:55:18+00:00", "article:modified_time": "2022-09-07T23:33:14+00:00", "site_name": "Climate Depot", "image": "http://www.climatedepot.com/wp-content/uploads/2022/09/Screen-Shot-2022-09-02-at-11.53.44-300x243.png", "image:width": "300", "image:height": "243", "locale": "en_US"}, "tags": ["lockdown", "reset", "energy", "gnd"], "tweets": [], "movies": [], "links": ["https://co.my.xcelenergy.com/s/residential/heating-cooling/ac-rewards"], "authors": [], "publish_date": "2022-09-02T15:55:18+00:00"}