{"result_id": "070031", "URL": "https://www.climatedepot.com/2023/03/23/when-the-science-journal-nature-endorsed-biden-trump-voters-tuned-it-out/", "timestamp": "2023-04-25 14:43:51 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.climatedepot.com/2023/03/23/when-the-science-journal-nature-endorsed-biden-trump-voters-tuned-it-out/", "encoding": "UTF-8"}, "image": null, "domain": "www.climatedepot.com", "title": "When the science journal Nature endorsed Biden, Trump voters tuned it out", "cleaned_text": "Michael Jordan famously declined to cross the line from athletics to politics, saying, “Republicans buy sneakers, too.”\n\nNature magazine is finding out that Republicans also consume scientific literature — but they are less likely to do so when they think the publication has turned political.\n\nFloyd Zhang, the Stanford University professor who conducted the research, used a group of more than 4,000 people. He showed half of them a summary of Nature’s October 2020 endorsement of Mr. Biden. He provided a “placebo” message to the other half.\n\nHe found no increase in support for Mr. Biden based on Nature’s opinion, but he found that Trump supporters in the group who had been shown the endorsement were significantly less likely than the placebo group to want to see Nature’s work on coronavirus variants and vaccine effectiveness.\n\nNature said the study, though limited to one election and one journal, raised big questions about scientific credibility and the taint of politics.\n\n“This is an important question, and there are, sadly, no easy answers,” the publication’s editors wrote. “The study shows the potential costs of making an endorsement. But inaction has costs, too.”\n\nIn the end, Nature’s editors vowed not to cave to pressure for the sake of their credibility. They said they owed it to themselves to say what they believe.\n\n“Political endorsements might not always win hearts and minds, but when candidates threaten a retreat from reason, science must speak out,” Nature said in an editorial on the matter.", "opengraph": {"type": "article", "title": "When the science journal Nature endorsed Biden, Trump voters tuned it out", "url": "https://www.climatedepot.com/2023/03/23/when-the-science-journal-nature-endorsed-biden-trump-voters-tuned-it-out/", "description": "By Stephen Dinan – The Washington Times – Wednesday, March 22, 2023 Michael Jordan famously declined to cross the line from athletics to politics, saying, “Republicans buy sneakers, too…", "article:published_time": "2023-03-23T22:20:13+00:00", "article:modified_time": "2023-03-23T22:20:26+00:00", "site_name": "Climate Depot", "image": "https://s0.wp.com/i/blank.jpg", "locale": "en_US"}, "tags": ["trump", "cru", "biden", "polling"], "tweets": [], "movies": [], "links": ["https://www.washingtontimes.com/topics/donald-trump/", "https://www.washingtontimes.com/topics/floyd-zhang/", "https://www.washingtontimes.com/topics/donald-trump/"], "authors": [], "publish_date": "2023-03-23T22:20:13+00:00"}