{"result_id": "070009", "URL": "https://www.climatedepot.com/2021/01/18/the-climate-impact-of-mass-coronavirus-vaccinations-co2-spewing-airplanes-trucks-needed-to-distribute-hospitals-got-creative-using-bike-delivery-to-reduce-the-environmental-footprint/", "timestamp": "2023-04-25 14:43:37 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.climatedepot.com/2021/01/18/the-climate-impact-of-mass-coronavirus-vaccinations-co2-spewing-airplanes-trucks-needed-to-distribute-hospitals-got-creative-using-bike-delivery-to-reduce-the-environmental-footprint/", "encoding": "UTF-8"}, "image": null, "domain": "www.climatedepot.com", "title": "Angst over climate impact of COVID vaccinations – ‘CO2-spewing airplanes & trucks needed’ to distribute – ‘Hospitals got creative, using bike delivery to reduce the environmental footprint’", "cleaned_text": "Governments across the world are frantically trying to vaccinate as many people as possible to bring the coronavirus pandemic to heel — but doing so carries some negative environmental consequences.\n\n\n\nEverything from the massive freezers used to keep vaccines cold, to the trucks and airplanes needed to get the jabs out to patients, to the millions of waste vials and syringes pose potential problems.\n\n\n\n“If we don’t do this in a sustainable way, using low impact technologies, natural refrigerants rather than synthetic ones, we’re going to have pieces of technology [for ultra-cold transportation] sitting here for the next 10, 15 years with big climate impact,” said Toby Peters, a professor specialized in the cold economy at the University of Birmingham.\n\n\n\n\n\nCompanies use hydrofluorocarbons (HFC) gases to freeze vaccines to a very low temperature — minus 70 degrees Celsius for the BioNTech/Pfizer jab — and allow their storage and transportation over long distances. HFC emissions have a global warming effect up to 23,000 times greater than CO2 but have been decreasing in the EU since 2015 thanks to a progressive phase-out under the bloc’s F-gas Regulation.\n\n\n\nThis progress could be compromised by the vaccination campaign, complicating the EU’s Green Deal target of becoming climate neutral by 2050, according to Peters. “It’s all going to add to emissions at a time where we’re trying to get to net zero,” he said.\n\n\n\nThere is also the environmental cost of logistics — the CO2-spewing airplanes and trucks needed to shift vaccines from factories to the eager arms of millions of people. The key is distributing the jabs in an efficient way.\n\n\n\n“From a sustainability perspective, the more centers the better for the environment for the simple reason that the more centers you have, potentially the less kilometers every individual patient needs to make to get vaccinated,” said Roel Gevaers, economics and logistics professor at the University of Antwerp, adding that a good connection with public transport is essential to reduce carbon emissions from the vaccination campaign.\n\n\n\n\n\nGevaers said it’s more efficient to have trucks delivering to a few centers that are equipped with large storage spaces able to keep the vaccines frozen a longer time, rather than using a multitude of small vaccination points that have a shorter window to use the vaccine once it’s defrosted.\n\n\n\nVaccine manufacturer AstraZeneca said it’s making efforts to minimize the campaign’s environmental impact.\n\n\n\n“To produce the vaccine for markets around the world, we have built a number of regional supply chains, meaning not only rapid access to as many countries as possible but also reduced need for transportation,” an AstraZeneca spokesperson said.\n\nIn Paris, some hospitals got creative, using bike delivery to reduce the environmental footprint of the last mile. But French officials estimated that 25 percent to 30 percent of vaccine doses will be wasted due to logistics constraints.\n\n\n\nSyringes and vials\n\n\n\nAnother concern is the potential increase in waste from the vaccination campaign, which adds to the waste already generated by single-use personal protective equipment (PPE) — the masks, suits and shields used to protect people and medical staff from the virus.", "opengraph": {"type": "article", "title": "Angst over climate impact of COVID vaccinations – ‘CO2-spewing airplanes & trucks needed’ to distribute – ‘Hospitals got creative, using bike delivery to reduce the environmental footprint’", "url": "https://www.climatedepot.com/2021/01/18/the-climate-impact-of-mass-coronavirus-vaccinations-co2-spewing-airplanes-trucks-needed-to-distribute-hospitals-got-creative-using-bike-delivery-to-reduce-the-environmental-footprint/", "description": "… Governments across the world are frantically trying to vaccinate as many people as possible to bring the coronavirus pandemic to heel — but doing so carries some negative environmental cons…", "article:published_time": "2021-01-19T02:27:23+00:00", "article:modified_time": "2021-01-19T02:29:16+00:00", "site_name": "Climate Depot", "image": "https://s0.wp.com/i/blank.jpg", "locale": "en_US"}, "tags": ["wacky", "coronavirus", "astrology", "emissions"], "tweets": [], "movies": [], "links": ["https://www.politico.eu/article/mass-coronavirus-vaccinations-environmental-impact-climate-change/"], "authors": [], "publish_date": "2021-01-19T02:27:23+00:00"}