{"result_id": "070042", "URL": "https://www.climatedepot.com/2022/09/22/world-economic-forum-touts-personal-carbon-allowance-programs-as-now-possible-due-covid-lockdowns-huge-number-of-unimaginable-restrictions-for-public-health-were-adopted-by-billions/", "timestamp": "2023-04-25 14:43:57 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.climatedepot.com/2022/09/22/world-economic-forum-touts-personal-carbon-allowance-programs-as-now-possible-due-covid-lockdowns-huge-number-of-unimaginable-restrictions-for-public-health-were-adopted-by-billions/", "encoding": "UTF-8"}, "image": null, "domain": "www.climatedepot.com", "title": "World Economic Forum touts ‘personal carbon allowance programs’ – ‘COVID-19 was the test of social responsibility’ – ‘Huge number of unimaginable restrictions for public health were adopted by billions of citizens’", "cleaned_text": "There have been significant developments in last five to seven years on social, environment and technology fronts that could help realize “My Carbon” initiatives for shaping the future towards smart and sustainable cities. ... COVID-19 was the test of social responsibility – A huge number of unimaginable restrictions for public health were adopted by billions of citizens across the world. There were numerous examples globally of maintaining social distancing, wearing masks, mass vaccinations and acceptance of contact-tracing applications for public health, which demonstrated the core of individual social responsibility. ... Fourth Industrial Revolution technology breakthroughs – Advances in emerging technologies like AI, blockchain and digitization can enable tracking personal carbon emissions, raise awareness and also provide individual advisories on lower carbon and ethical choices for consumption of product and services.\n\n‘My Carbon’: An approach for inclusive and sustainable cities\n\nBy Mridul Kaushik – , Ministry of Housing and Urban Affairs of India\n• While transport and buildings are the major drivers for emissions in cities, the share of individual emissions is significant.\n• Personal carbon allowance programs have had limited success due to a lack of awareness and fair mechanism for tracking emissions.\n• Yet there have been major developments in recent years that could help realise “My Carbon” initiatives.\n\nCities across the world account for almost 75% of our total carbon emissions. As countries move towards implementing their pledges for a net zero future, urban areas will remain the action ground for decades to come. While transport and buildings are the major drivers for emissions in cities, the share of individual emissions are significant at around 40%.\n\nThere have been numerous examples of personal carbon allowance programs in discussions for the last two decades, however they had limited success due to a lack of social acceptance, political resistance, and a lack of awareness and fair mechanism for tracking “My Carbon” emissions.\n\nThere have been major advances in smart home technologies, transport choices with carbon implications, the roll-out of smart meters in providing individual choices to reduce their energy-related emissions, the development of new personalized apps to account for personal emissions, and better personal choices for food and consumption-related emissions. AI can also help strengthen circular economy business models like product as a service models, demand predictions, and smart asset management by combining real time and historical data from products and users.\n\n3. Raised awareness and ownership for nature and environment – In the last few years, there is an increased awareness and public concern on climate change and specially among youth. The UNDP’s “Peoples’ Climate Vote” reflects that over 64% of people believe climate change is a global emergency. A new Pew Research Center survey in 17 advanced economies found widespread concern about the personal impact of global climate change: 80% of citizens say they are willing to change how they live and work to combat the effects of climate change. Young adults, who have been at the forefront of some of the most prominent climate change protests in recent years, are more concerned than their older counterparts about the personal impact of a warming planet in many public surveys.\n\nThe three trends provide strong evidence towards enabling a social movement for “My Carbon” initiatives by enabling public-private partnerships to help curate this program. It is suggested to drive a three-way approach to shape this movement.", "opengraph": {"type": "article", "title": "World Economic Forum touts ‘personal carbon allowance programs’ – ‘COVID-19 was the test of social responsibility’ – ‘Huge number of unimaginable restrictions for public health were adopted by billions of citizens’", "url": "https://www.climatedepot.com/2022/09/22/world-economic-forum-touts-personal-carbon-allowance-programs-as-now-possible-due-covid-lockdowns-huge-number-of-unimaginable-restrictions-for-public-health-were-adopted-by-billions/", "description": "Sep 14, 2022 ‘My Carbon’: An approach for inclusive and sustainable cities By Mridul Kaushik -Mission Director, Smart Cities Mission, Ministry of Housing and Urban Affairs of India While transport …", "article:published_time": "2022-09-22T16:21:46+00:00", "article:modified_time": "2022-10-02T12:31:48+00:00", "site_name": "Climate Depot", "image": "https://s0.wp.com/i/blank.jpg", "locale": "en_US"}, "tags": ["wef", "lockdowns", "covid", "reset"], "tweets": [], "movies": [], "links": ["https://www.weforum.org/agenda/2022/09/my-carbon-an-approach-for-inclusive-and-sustainable-cities/", "https://www.weforum.org/agenda/authors/mridul-kaushik", "https://www.weforum.org/impact/net-zero-carbon-future-for-cities/#:~:text=The%20Net%20Zero%20Carbon%20Cities%20programme%20is%20creating%20an%20enabling,built%20environment%20and%20transport%20sectors.", "https://www.nature.com/articles/s41893-021-00756-w.pdf", "https://www.nature.com/articles/s41893-021-00756-w.pdf", "https://www.weforum.org/scale360-circular-innovation/home", "https://www.youtube.com/watch?v=56F49VFt3mw&t=20s", "https://www.pewresearch.org/global/2021/09/14/in-response-to-climate-change-citizens-in-advanced-economies-are-willing-to-alter-how-they-live-and-work/", "https://www.reuters.com/article/climate-change-protests/worlds-youth-rallies-against-climate-change-idUSKCN26G113"], "authors": [], "publish_date": "2022-09-22T16:21:46+00:00"}