{"result_id": "070018", "URL": "https://www.climatedepot.com/2022/06/12/covid-inspired-emergency-measures-to-fight-climate-change-move-towards-application-of-emergency-measures-to-achieve-the-objectives-against-climate-change/", "timestamp": "2023-04-25 14:43:43 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.climatedepot.com/2022/06/12/covid-inspired-emergency-measures-to-fight-climate-change-move-towards-application-of-emergency-measures-to-achieve-the-objectives-against-climate-change/", "encoding": "UTF-8"}, "image": null, "domain": "www.climatedepot.com", "title": "COVID-inspired emergency measures to fight climate change: ‘Move towards application of emergency measures to achieve the objectives against climate change’", "cleaned_text": "“The pandemic has demonstrated that we can take rapid and radical measures,” says Anne Plourde. Emergency measures related to the fight against COVID could then apply to the fight against climate change. For example, the promotion of telework or the restriction of travel. ... Beyond the specific measures, there is a broader legal debate: that of setting aside a traditional legislative process to move towards the application of emergency measures to achieve the objectives against climate change. Canada could, for example, use the Emergencies Act to give itself a free hand in the fight against climate change. ... This \"emergency normalization\" as Professor Maxime St-Hilaire of the University of Sherbrooke calls it, exists, but is limited since an emergency situation is not intended to last. ... The Emergencies Act gives the government broad powers. The government may then, by decree or regulation, limit gatherings or travel. ... Some of the flagship measures to combat COVID-19 have had measurable effects on greenhouse gas (GHG) sources.\n\nThe sixth report of the Intergovernmental Panel on Climate Change (IPCC) is damning. Almost all of global warming is due to human activity, and the world has only four years to begin a major reduction in greenhouse gas (GHG) emissions.\n\nSo here are six reports, which successively alert humanity to the need to act. Anne Plourde, postdoctoral researcher at York University and IRIS, notes the inaction of leaders in the face of the climate crisis while the experts themselves say that structuring and radical measures are needed.\n\nRemember that the global objectives are not aimed at stopping global warming, but at limiting it to 1.5° compared to the pre-industrial era. Only one IPCC scenario, the most constraining, offers a reasonable possibility of meeting this threshold.\n\nWhat can we learn from the fight against COVID-19?\n\nThe pandemic has brought about upheavals in the application of our rights and freedoms. Restrictions such as curfew, telework, border closures, travel have appeared, derogating in part from the Canadian and Quebec charters of rights, with the aim of defeating the COVID-19 threat. “The pandemic has demonstrated that we can take rapid and radical measures,” says Anne Plourde.\n\nEmergency measures related to the fight against COVID could then apply to the fight against climate change. For example, the promotion of telework or the restriction of travel. However, in the case of telecommuting, Ms. Plourde indicates that at present, we have no studies confirming that telecommuting has beneficial effects greater than the reduction in transport that it generates.\n\n“Telework reduces the movement of people, but increases the consumption of electricity and servers. I hope that a study will give us the answer on which of these choices is the least polluting. In addition, not everyone can telecommute. On the other hand, at this level, it is necessary to work on an urbanization of cities which reduces travel as much as possible.\n\nWhat if we adapted the vaccine passport instead? The idea of ​​an “environmental passport”, for those who do not respect their duty in the fight against climate change, would be counterproductive and discriminatory according to Anne Plourde. “It would create resistance in the same way as what we see with the vaccine passport. Such a passport could be discriminatory, because the best endowed would have an easier time complying with environmental measures, for example in terms of food, choice of vehicle or other reasons beyond their control.”\n\nIn such a societal challenge, seeking membership is preferable. It’s about “involving people in a common effort rather than demobilizing them,” she says. Imposing emergency measures would imply a restriction of certain rights and democracy, she explains.\n\nCapitalism is holding back the fight against climate change\n\nWe therefore find ourselves in a situation where legislating towards measures protecting the environment is an almost obligatory step, but this process is long and requires political courage. This governance is undermined by unofficial barriers, one of which is called capitalism, says Anne Plourde, expert at IRIS.\n\n“Under capitalism, the power to make big decisions about how the economy works is not in the hands of governments. This significant economic power is captured […] by the small minority of large business owners and managers who, through their private decisions, determine what we produce, where we invest, at what rate, etc.\n\nMs. Plourde explains in a recent post that governments are simply not in control of their actions. She adds that the changes are achievable via “crossroads”.\n\nAccording to the expert, the democratic sphere must be extended to the economy.\n\nMs. Plourde notes that this idea is not reflected in the speeches of the federal parties, but that this voice is being heard more and more.\n\nBeyond the specific measures, there is a broader legal debate: that of setting aside a traditional legislative process to move towards the application of emergency measures to achieve the objectives against climate change. Canada could, for example, use the Emergencies Act to give itself a free hand in the fight against climate change.\n\nThis “emergency normalization” as Professor Maxime St-Hilaire of the University of Sherbrooke calls it, exists, but is limited since an emergency situation is not intended to last.\n\nThe urgent character inevitably implies a limitation of the rights of the person and a temporary character. Collective interests take precedence over individual interests until the crisis situation is resolved. Except that, as Ms. Plourde explains, the fight against climate change is not temporary.\n\nFor example, restricting the right to movement of people to reduce the impact of GHGs on transportation should be adopted by law since this amounts to putting itself at odds with section 6 of the Canadian Charter of rights and freedoms. The only way to derogate from it is to adopt a rule of law.\n\nIn addition, the derogation that a province can protect itself from certain mentions of the Charter provided for in section 33, remains temporary (5 years) and does not apply to the movement of persons (section 6).\n\nDuring the pandemic, Quebec applied the Public Health Act, which allows it, by decree, to declare a state of health emergency. This has facilitated the implementation of measures to combat COVID-19 such as curfews, telework or the limitation of gatherings.\n\nSeeing one day a law allowing the state of environmental emergency, at the provincial level, is rather questionable for Maxime St-Hilaire. It would have to pass the legislative process and should be constitutional. Moreover, it should be extended indefinitely since the fight against climate change is intended to continue, whereas a state of emergency is temporary.\n\nHowever, it is at the federal level that the room for maneuver is the greatest since it has “emergency” jurisdiction. The Emergencies Act gives the government broad powers. The government may then, by decree or regulation, limit gatherings or travel. During the pandemic, the government did not use this law to limit the movement of Canadians, but rather applied the Quarantine Act to control arrivals in the territory.\n\nBut decrees or regulations related to this law, formerly called the War Measures Act, are subject to parliamentary approval. Moreover, the law has not been used since the crisis of October 1970.\n\nFour anti-covid measures to fight against GHGs\n\nSome of the flagship measures to combat COVID-19 have had measurable effects on greenhouse gas (GHG) sources. Could we imagine an application intended specifically for the fight against climate change? If the idea seems attractive, it would also come with negative impacts and a significant debate on the infringement of the rights and freedoms of citizens.\n\nHere are four of these measures, with their possible benefits and anticipated consequences.\n• Reduces GHGs by limiting daily travel, especially by car.\n• The GHG balance of increased use of internet and electricity at home is not well measured.\n• Certain professions cannot be exercised by teleworking\n• Will city centers become no man’s land ?\n• Would require an increased supply of transport outside peak hours.\n• Possible infringement of individual freedom which would be difficult to justify in court.\n• Would reduce the impact of the aeronautical sector on the environment.\n• Implies a restriction of rights related to the Canadian and Quebec charters.\n• The economic contribution of international tourists would be lost.\n• Access to certain services would be limited for people exceeding a certain GHG emissions threshold.\n• Important incentive to action, just like the vaccine passport.\n• Would create categories of citizens, like social credit in China.\n• May imply a demobilization of citizens rather than support for the climate fight.", "opengraph": {"type": "article", "title": "COVID-inspired emergency measures to fight climate change: ‘Move towards application of emergency measures to achieve the objectives against climate change’", "url": "https://www.climatedepot.com/2022/06/12/covid-inspired-emergency-measures-to-fight-climate-change-move-towards-application-of-emergency-measures-to-achieve-the-objectives-against-climate-change/", "description": "Pandemic-inspired emergency measures to fight climate change By Pascal Gaxet – Metro After nearly two years of the COVID-19 pandemic , Quebec, Canada and the world have had a glimpse of the p…", "article:published_time": "2022-06-12T18:30:26+00:00", "article:modified_time": "2022-06-12T18:33:25+00:00", "site_name": "Climate Depot", "image": "http://www.climatedepot.com/wp-content/uploads/2022/06/Screen-Shot-2022-06-12-at-2.21.12-PM-293x300.png", "image:width": "293", "image:height": "300", "locale": "en_US"}, "tags": ["lockdowns", "covid", "reset"], "tweets": [], "movies": [], "links": ["https://laws.justice.gc.ca/fra/lois/E-4.5/", "https://journalmetro.com/environnement/2686632/mesures-urgence-lutte-changements-climatiques/", "https://journalmetro.com/auteur/pgaxet/", "http://www.climatedepot.com/wp-content/uploads/2022/06/Screen-Shot-2022-06-12-at-2.21.12-PM.png", "https://journalmetro.com/societe/environnement/2678131/changements-climatiques-il-reste-9-ans-pour-eviter-la-catastrophe/", "https://iris-recherche.qc.ca/blogue/rapport-giec-inaction-dirigeant-e-s-face-crise-climatique", "https://laws.justice.gc.ca/fra/lois/E-4.5/", "http://www.climatedepot.com/wp-content/uploads/2022/06/Screen-Shot-2022-06-12-at-2.20.39-PM.png"], "authors": [], "publish_date": "2022-06-12T18:30:26+00:00"}