{"result_id": "070047", "URL": "https://www.climatedepot.com/2022/09/17/bill-gates-buys-the-media-pumps-out-tens-of-millions-of-dollars-annually-to-pay-for-positive-media-moranos-the-great-reset-book-excerpt/", "timestamp": "2023-04-25 14:44:01 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.climatedepot.com/2022/09/17/bill-gates-buys-the-media-pumps-out-tens-of-millions-of-dollars-annually-to-pay-for-positive-media-moranos-the-great-reset-book-excerpt/", "encoding": "UTF-8"}, "image": null, "domain": "www.climatedepot.com", "title": "Bill Gates buys the media: ‘Pumps out tens of millions of dollars annually to pay for positive media’ – Morano’s The Great Reset book excerpt", "cleaned_text": "He also provides funding to the key “Our World in Data” website that bills itself as providing “daily updated research and data” on the “coronavirus pandemic.” Gates funds world-health coverage on ABC News—with cash grants. Even the New York Times was taken aback by Gates paying ABC News. “ABC News has entered into an unusual financial agreement with the Bill and Melinda Gates Foundation to back a yearlong project investigating global health problems and their potential solutions,” the Times reported in 2010. The paper quoted ABC News admitting that the network “had never accepted a cash grant before.” When the PBS NewsHour with Jim Lehrer was given a $3.5 million Gates Foundation grant to set up a special reporting division “to expand global health coverage,” the funding essentially brought Gates’s vision and philosophy to the reporting. “NewsHour correspondents will travel worldwide to produce forty to fifty documentary-style reports on global health issues” reported Philanthropy News Digest in 2008. Gates’s money did not just buy coverage, it turned “reporters” for PBS into paid lobbyists for Gates’s global-health mission. “The NewsHour will also launch an outreach effort to put the coverage in front of policymakers, scientists, medical professionals, and others in the global health community.” During the height of COVID-19 fears, Gates appeared regularly on NewsHour and could always count on softball questions from his paid crew at PBS. An April 2020 “news-segment” interview with Gates by anchor Judy Woodruff revealed the extent of the journalistic rot at the Gates-funded show. Woodruff opened the interview with Gates by gushing, “One of the best-informed voices is that of businessman and philanthropist Bill Gates. The co-founder of Microsoft has spent the last few decades focused through the Bill and Melinda Gates Foundation on improving global health, including reducing the spread of infectious diseases.”\n\nShe said, “You were one of the prescient few years ago who said that an infectious disease outbreak was coming that could kill millions of people”—neglecting to mention that warning cries of the possibility of another Spanish flu hitting someday had been ubiquitous in global health since the time of the original Spanish flu. But Woodruff was not finished performing for Gates’s bought-and-paid-for PR. “Well, Bill Gates, we thank you very much for spending the time with us, for talking with us today. Thank you and we wish you and what you are doing at the Foundation the very best,” Woodruff concluded. In response to concerns that the journalistic integrity of PBS NewsHour was being compromised by the millions in Gates funding, communications chief Rob Flynn defended the show by suggesting that “there are not a heck of a lot of things you could touch in global health these days that would not have some kind of Gates tentacle.” Bill Gates appeared on The Late Show with Stephen Colbert in April 2020 to discuss the “return to normal” from COVID-19. Gates: And then the final solution—which is a year to two years off—is the vaccine. So we’ve got to go full-speed ahead on all three fronts. Colbert: Just to head off the conspiracy theorists, maybe we shouldn’t call the vaccine “the final solution.” Colbert: Maybe just “the best solution.”\n\nInvestigative journalist James Corbett has explained the stranglehold Gates has on public health. “It comes as no surprise, then, that—far beyond the $250 million that the Gates Foundation has pledged to the ‘fight’ against coronavirus—every aspect of the current coronavirus pandemic involves organizations, groups and individuals with direct ties to Gates funding,” Corbett reported.\n\nThe Lancet expressed serious concerns about the Gates Foundation’s influence on public health. “Apart from questions over its investments, the Gates Foundation has received little external scrutiny,” The Lancet said in a May 2009 editorial noting Gates’s $3 billion annual spending at the time. Last year, Devi Sridhar and Rajaie Batniji reported that the Foundation gave most of its grants to organizations in high-income countries…. Their study shows even more robustly that the grants made by the Foundation do not reflect the burden of disease endured by those in deepest poverty. In an accompanying Comment, Robert Black and colleagues discuss the alarm- ingly poor correlation between the Foundation’s funding and childhood disease priorities. The concern expressed to us by many scientists who have long worked in low-income settings is that important health programs are being distorted by large grants from the Gates Foundation. . . . There is also serious anxiety about the transparency of the Foundation’s operation…. The first guiding principle of the Foundation is that it is “driven by the interests and passions of the Gates family.” An annual letter from Bill Gates summarizes those passions, referring to newspaper articles, books, and chance events that have shaped the Foundation’s strategy. For such a large and influential investor in global health, is such a whimsical governance principle good enough? Gates quite literally rules media, academia, government officials around the world, and the WHO. “Control over the Fates of Billions” Fauci has many close ties to both Bill Gates and the WHO, including funding and joint projects. Fauci was chosen to be part of the Leadership Council of the Gates-founded “Decade of Vaccines” project. “The World Health Organization (WHO), UNICEF, the National Institute of Allergy and Infectious Diseases (NIAID) and the Bill & Melinda Gates Foundation have announced a collaboration to increase coordination across the international vaccine community and create a Global Vaccine Action Plan,” read the 2010 WHO press release. Gates committed $10 billion to the project. And in October 2019 it was announced: “NIH, Bill and Melinda Gates Foundation collaborate to develop gene-based HIV treatment.” The Gates Foundation pledged to contribute $100 million to the National Institute of Health to support Fauci’s National Institute of Allergy and Infectious Diseases research into HIV. Gates is a key player in the Great Reset. Klaus Schwab praised Gates in 2008 at the Davos annual meeting: “If in the twenty-second century a book will be written about the entrepreneur of the twenty-first century…. I’m sure that the person who will foremost come to the mind of those historians is certainly Bill Gates.” “Gates’ unimaginable wealth has been used to gain control over every corner of the fields of public health, medical research, and vaccine development. And now that we are presented with the very problem that Gates has been talking about for years, we will soon find that this software developer with no medical training is going to leverage that wealth into control over the fates of billions of people,” investigative journalist James Corbett explained. The World Health Organization, also a key player in the Great Reset, utilized COVID-19 to promote lockdowns and advance the goals of the World Economic Forum. The World Health Organization’s second-largest donor, behind the United States government, is (drumroll, please) . . . the Bill & Melinda Gates Foundation. According to the 2018 WHO financial report, while the U.S. government’s contribution was in the amount of more than $281 million, the Gates Foundation came in at over $228 million—out of the total $2.2 billion that made up the WHO annual budget. (Gates gave over $324 million to WHO in 2017.) The Gates Foundation contributed more to the WHO than many developed nations. Gates played a key role in the COVID-19 lockdowns, mandates, and vaccines. “Bars and restaurants in most of the country will be closed as we go into this wave. And I think, sadly, that’s appropriate,” Gates told CNN in December 2020. Gates helped push massive coronavirus hysteria and lockdowns as the only solution. In August of 2020, Gates praised China for its strict lockdowns. Gates said that the Chinese “in their typical fairly authoritarian way, they did a very good job of suppressing the virus. There may have been a lot of individual rights that were violated there, but the overall macro effect that they achieved is kind of amazing.” He added that China “kept the virus numbers to very low levels compared to most countries.” Gates also personally praised the most authoritarian COVID lock- downs anywhere on the planet. He lauded Australia’s militarization response as the model for the United States to follow. Gates called for a “very different regimen so all countries can get on top of cases very quickly and be more like Australia than Europe or the U.S. ended up being.” Gates said this in August 2021, as Victoria in Australia moved into its sixth lockdown after just eight cases of COVID were reported. “Bill Gates is no public health expert. He is not a doctor, an epidemiologist or an infectious disease researcher. Yet somehow he has become a central figure in the lives of billions of people, presuming to dictate the medical actions that will be required for the world to go ‘back to normal,” Corbett stated. How did Gates go from a computer geek peddling a mediocre operating system to dictating international public health policy to the adulation of the media? Money, money, money. “Gates has surpassed Rockefeller’s legacy with the Bill & Melinda Gates Foundation long having eclipsed The Rockefeller Foundation as the largest private foundation in the world, with $46.8 billion of assets on its books that it wields in its stated program areas of global health and development, global growth, and global policy advocacy,” Corbett reported. Checkbook Journalism: Bought & Paid for Climate ‘News’: NPR Announces Facebook’s Zuckerberg & Rockefeller Foundation Will Be funding NPR’s ‘Climate Desk’ Jimmy Dore on Bill Gates: September 9, 2022: “Bill Gates was a hated billionaire in the late 90s and he was getting pied in the face, right in public people, were throwing pies in his face. And so what he decided to do was take hundreds of millions of dollars and give it to news organizations around the world — invent news training center schools, journalism schools. So with all his money, all those journalism, and all those news outlets, they’re all beholden to him. So that’s why, when if you think he’s a nice guy or a good person — which he’s neither of those things.” “He’s a monopolist who screws other people out of competition and he’s buying up farmland and he’s the guy who pushed for the COVID lockdowns and the vaccine mandates. He’s an evil oligarch. And the reason why you don’t know that is because he bought the media.”\n\nVia: Tim Hinchliffe of Sociable in Sept 2022: Moderating last week’s “Tackling Disinformation” panel was WEF managing director Adrian Monck, who in recent months has been name-calling critics of the WEF and components of its great reset agenda as white supremacists and anti-Semites engaged in far-right disinformation campaigns.When addressing CNN’s Rachel Smolkin, Monck said that CNN was part of a political war strategy to “own the narrative.” “CNN is both an organization that’s trying to make sense of the world and trying to establish the facts; it’s also part of a political war on who owns the narrative,” he said. According to MintPress News, CNN received $3.6 million in donations from none other than the Bill and Melinda Gates Foundation — the same organization that’s been heavily invested in the WHO. The investigation revealed that Gates had also donated a whopping $319 million to many of the biggest and most influential corporate news outlets in the world.", "opengraph": {"type": "article", "title": "Bill Gates buys the media: ‘Pumps out tens of millions of dollars annually to pay for positive media’ – Morano’s The Great Reset book excerpt", "url": "https://www.climatedepot.com/2022/09/17/bill-gates-buys-the-media-pumps-out-tens-of-millions-of-dollars-annually-to-pay-for-positive-media-moranos-the-great-reset-book-excerpt/", "description": "The following is an excerpt from Chapter 12 of The Great Reset: Global Elites and the Permanent Lockdown – By Marc Morano Chapter 2 – The Origins of the Great Reset Page 59 – Excerpt:  …", "article:published_time": "2022-09-17T14:45:11+00:00", "article:modified_time": "2022-10-02T14:23:51+00:00", "site_name": "Climate Depot", "image": "https://sociable.co/wp-content/uploads/2022/04/WHO-budget.png", "image:width": "526", "image:height": "366", "locale": "en_US"}, "tags": ["media", "resetexcerpt", "reset", "Gates", "funding", "intimidation"], "tweets": [], "movies": [], "links": ["https://www.amazon.com/Great-Reset-Global-Permanent-Lockdown/dp/1684512387", "https://ips-dc.org/1-million-covid-deaths-billionaire-wealth-up-1-7-trillion/", "https://www.amazon.com/Great-Reset-Global-Permanent-Lockdown/dp/1684512387", "https://www.climatedepot.com/2022/09/17/checkbook-journalism-bought-paid-for-climate-news-npr-announces-facebooks-zuckerberg-rockefeller-foundation-will-be-funding-nprs-climate-news/", "https://www.youtube.com/watch?v=8jhlki-Z0Gc&t=580s", "https://www.youtube.com/watch?v=iK6SS8CXYZo", "http://www.climatedepot.com/wp-content/uploads/2022/09/Screen-Shot-2022-09-17-at-11.04.02.png", "https://sociable.co/government-and-policy/we-own-science-world-should-know-un-wef-disinformation/", "https://sociable.co/web/wef-director-youll-own-nothing-be-happy-disinformation-campaign/", "https://sociable.co/?s=great+reset", "https://www.mintpressnews.com/documents-show-bill-gates-has-given-319-million-to-media-outlets/278943/", "https://www.politico.com/news/2022/09/14/global-covid-pandemic-response-bill-gates-partners-00053969", "http://www.climatedepot.com/wp-content/uploads/2022/09/Screen-Shot-2022-09-18-at-07.41.49.png", "http://www.climatedepot.com/wp-content/uploads/2022/09/Screen-Shot-2022-09-18-at-07.51.16.png", "http://www.climatedepot.com/wp-content/uploads/2022/09/Screen-Shot-2022-09-18-at-08.03.32.png", "https://www.climatedepot.com/2021/01/10/watch-morano-on-fox-and-friends-on-bill-gates-private-jet-covid-lockdown-hypocrisy-gates-is-1-carbon-footprint-of-all-celebrity-climate-activists-30k-a-month-electricity-bill-at-his-home/", "https://www.climatedepot.com/2021/01/10/watch-morano-on-fox-and-friends-on-bill-gates-private-jet-covid-lockdown-hypocrisy-gates-is-1-carbon-footprint-of-all-celebrity-climate-activists-30k-a-month-electricity-bill-at-his-home/", "https://www.independent.co.uk/life-style/celebrity-super-emitters-bill-gates-jennifer-lopez-study-flights-carbon-footprint-a9169136.html", "https://www.climatedepot.com/2017/06/05/al-gore-i-dont-have-a-private-jet-i-live-a-carbon-free-lifestyle/", "https://www.climatedepot.com/2020/01/12/bernie-the-jets-watch-morano-on-tuckers-fox-news-show-with-mark-steyn-no-sen-sanders-private-jet-hypocrisy/", "https://www.climatedepot.com/2019/12/12/exclusive-video-uns-climate-whopper-un-climate-activists-line-up-for-burger-king-at-madrid-summit-despite-uns-warning-on-dangers-of-eating-meat-actor-harrison-ford-confronted-on-uns-hypocris/", "https://www.weforum.org/videos/bill-gates-explains-how-cutting-co2-emissions-means-transforming-nearly-every-aspect-of-our-lives", "https://www.climatedepot.com/2010/09/02/bill-gates-pushes-carbon-tax-and-lectures-on-energy-efficiency-while-living-in-a-66000-square-foot-mansion-with-30000-a-month-electric-bill/", "https://www.climatedepot.com/2020/04/25/warmist-bill-gates-quietly-buys-43m-oceanfront-home-in-midst-of-pandemic-he-must-not-truly-believe-the-oceans-will-flood-the-coasts/", "https://www.dailywire.com/news/bill-gates-worth-nearly-120-billion-advocates-for-keeping-some-businesses-closed-during-pandemic", "https://www.climatedepot.com/2020/12/03/u-s-billionaires-thriving-gained-1-trillion-up-34-since-the-covid-lockdowns-started/", "https://www.climatedepot.com/2020/11/28/get-ready-in-a-declared-climate-emergency-you-cant-fly-commercial-unless-it-is-morally-justifiable-activist-holthaus-sets-rules-for-the-use-for-luxury-aviation-emissions-in-a-climate/", "https://www.cnbc.com/2020/11/17/coronavirus-bill-gates-says-more-than-50percent-of-business-travel-will-disappear-long-term.html", "https://www.climatedepot.com/2021/01/09/bill-gates-private-jet-hypocrisy-seeks-to-buy-worlds-largest-private-jet-operator-one-month-before-he-releases-book-preaching-about-climate-change-he-pushes-continued-lockdowns/", "https://www.climatedepot.com/2021/01/09/bill-gates-private-jet-hypocrisy-seeks-to-buy-worlds-largest-private-jet-operator-one-month-before-he-releases-book-preaching-about-climate-change-he-pushes-continued-lockdowns/", "https://www.dailywire.com/news/bill-gates-worth-nearly-120-billion-advocates-for-keeping-some-businesses-closed-during-pandemic", "https://www.cnbc.com/2020/11/17/coronavirus-bill-gates-says-more-than-50percent-of-business-travel-will-disappear-long-term.html", "https://www.climatedepot.com/2020/11/28/get-ready-in-a-declared-climate-emergency-you-cant-fly-commercial-unless-it-is-morally-justifiable-activist-holthaus-sets-rules-for-the-use-for-luxury-aviation-emissions-in-a-climate/", "https://www.climatedepot.com/2021/11/05/cnbc-private-jets-multiple-manions-not-to-worry-billionaires-like-bill-gates-jeff-bezos-buy-carbon-offsets/", "https://www.climatedepot.com/2021/07/08/climate-activists-bill-gates-jeff-bezos-others-fly-on-private-jets-to-sun-valley-to-attend-exclusive-billionaire-summer-camp/", "https://www.climatedepot.com/2022/03/26/the-great-food-reset-has-arrived-expect-real-food-shortages-biden-declares-meanwhile-bill-gates-china-buy-up-u-s-farmland/", "https://www.climatedepot.com/2020/11/03/watch-2016-video-world-economic-forums-utopian-great-reset-vision-of-2030-youll-own-nothing-and-youll-be-happy-whatever-you-want-youll-rent-itll-be-delivered-by-drone-meat/", "https://www.ispn-psych.org/legacy-initiative#:~:text=%E2%80%9CWhen%20there%20is%20food%20on,I%20love%20this%20proverb.", "https://www.climatedepot.com/2022/03/11/americans-may-have-to-say-goodbye-to-steak-burgers-as-beef-costs-rise-as-inflation-soars-just-what-the-climate-activists-always-wanted/", "https://www.climatedepot.com/2022/08/09/biden-the-weather-may-be-beyond-our-control-for-now-biden-joins-bill-gates-china-in-seeking-to-control-the-weather/", "https://www.climatedepot.com/2020/12/29/bill-gates-savior-complex-funds-sun-dimming-plan-to-save-the-human-race/", "https://www.climatedepot.com/2021/04/08/watch-morano-on-fox-and-friends-rips-efforts-to-block-the-sun-with-geoengineering-to-stop-global-warming/", "https://www.climatedepot.com/2022/08/09/watch-world-economic-forum-touts-chinas-efforts-to-control-the-weather-with-cloud-seeding-to-create-55-billion-tons-of-artificial-rain-weather-modification-department/", "https://webcache.googleusercontent.com/search?q=cache:-bvy1cA_TbAJ:https://www.washingtontimes.com/news/2021/nov/28/i-represent-science-fauci-claims-gop-detractors-ar/&cd=16&hl=en&ct=clnk&gl=us", "https://www.forbes.com/sites/carlieporterfield/2021/06/09/fauci-on-gop-criticism-attacks-on-me-quite-frankly-are-attacks-on-science/?sh=19b246124542"], "authors": [], "publish_date": "2022-09-17T14:45:11+00:00"}