{"result_id": "070025", "URL": "https://www.climatedepot.com/2022/05/20/the-case-against-the-cdc-as-we-know-it/", "timestamp": "2023-04-25 14:43:47 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.climatedepot.com/2022/05/20/the-case-against-the-cdc-as-we-know-it/", "encoding": "UTF-8"}, "image": null, "domain": "www.climatedepot.com", "title": "The Case Against the CDC as We Know It", "cleaned_text": "The Centers for Disease Control (CDC) was founded in 1946 as a backwater quasi-governmental agency with a negligible budget and a handful of employees tasked with a simple mission: “prevent malaria from spreading across the nation.”\n\nSeventy-five years later it has metastasized into a multi-billion dollar bureaucratic behemoth that oversees and controls virtually all aspects of public health programs, policies, and practices across the United States.\n\nThe CDC is the primary US national public health agency tasked with “protecting America from health, safety and security threats” and advertises that it will “increase the health security of our nation.” Guidelines and recommendations by the CDC set the standards for mainstream medicine in America and are considered the de facto rules by which public health departments and most institutions throughout the country must operate.\n\nThe CDC’s pledge to the American people vows that it will, “be a diligent steward of the funds entrusted to our agency, base all public health decisions on the highest quality scientific data that is derived openly and objectively, and place the benefits to society above the benefits to our institution.”\n\nThis high-minded mission statement gives the impression that the CDC will, above all else, work diligently and honestly to protect the health of all Americans. A careful review of the CDC’s history and current mode of operation indicates a stark contrast between these noble words and how the CDC actually functions.\n\n“The CDC has enormous credibility among physicians, in no small part because the agency is generally thought to be free of industry bias. Financial dealings with bio-pharmaceutical companies threaten that reputation.” -Marcia Angell, former editor in chief of the New England Journal of Medicine\n\nIn the mainstream media vortex, questioning the state religion of CDC decrees and guidelines lands one firmly in the camp of the “conspiracy-minded,” accused of practicing sorcery or some manner of medieval medical quackery.\n\nIn the minds of many Americans, the CDC represents the final word on “all matters health-related.” To question this omnipotent bureaucratic agency is to challenge sacred health commandments and cast doubt on the medical establishment itself.\n\nThe widely accepted belief about the CDC holds that it is a governmental agency that functions outside of health industry relationships and consequently operates free from the monied interests of the health management sector. Nothing could be further from the truth.\n\nDespite this reputation, further scrutiny reveals that the CDC falls far short of its stated purpose. As the scope and budget of this agency have ballooned over the years, including a war chest of corporate contributions, we have to ask ourselves, “Does the CDC fulfill its mission statement of protecting public health or is it now just another bloated quasi-governmental agency that works on behalf of its donors?”\n\nContrary to its disclaimer that “the CDC does not accept commercial support”, the British Medical Journal (BMJ) reported, in 2015, that “the CDC does receive millions of dollars in industry gifts and funding, both directly and indirectly.”\n\nA petition filed in 2019 by several watchdog groups contends that the CDC’s assertion that it is free from influence peddling and has “no financial interests or other relationships with the manufacturers of commercial products” are “indisputably false.”\n\nThe petition goes a step further asserting that the CDC, “knows the claims are false because it has procedures to address from whom and under what circumstances it accepts millions of dollars from contributors, including manufacturers of commercial products.”\n\nThis allegation is supported by multiple examples from the CDC’s own Active Program’s Report.\n\nFor instance, Pfizer Inc. contributed $3.435 million since 2016 to the CDC Foundation for a program on the prevention of Cryptococcal disease.\n\nPrograms like these became commonplace as early as 1983 largely due to Congressional authorization which allowed the CDC to accept “external” gifts “made unconditionally…for the benefit of the [Public Health] Service or for the carrying out of any of its functions.”\n\nDespite the caveat that these donations must be geared towards public health, the reality is these contributions come with strings attached. As noted earlier in the BMJ report, Pharma funds given to the CDC for specific projects return to Pharma pockets via marketing and sales.\n\nThe spigot of funding initiated through Congressional permission would open full blast a decade later, with the creation of the CDC Foundation.\n\nThe CDC Foundation was created by Congress in 1992 and incorporated two years later to “mobilize philanthropic and private-sector resources.”\n\nOnce established, the CDC Foundation became the primary pass-through mechanism utilized by a cornucopia of corporate interests to exert influence over various aspects of the CDC. Large pharmaceutical companies contributed millions of dollars each year to the “separate, philanthropic CDC Foundation.“\n\nThe CDC Foundation would then “donate philanthropically” Big Pharma contributions to the CDC itself. This sleight of hand ensured the CDC could maintain they never accepted money directly from Big Pharma.\n\nA decade after its inception the Foundation had quickly raised $100 million in private funds “to enhance the CDC’s work.”\n\nSome have argued that once this avalanche of monied interests was unleashed, the agency itself was transformed into the primary marketing arm of the Pharmaceutical Industry creating a hornet’s nest of ethics violations, outright corruption, and opening up a slew of questions as to who the CDC actually works for.\n\nWas the CDC Foundation truly established as a philanthropic enterprise or as a way to conceal conflicts of interest?\n\nDid this massive influx of corporate cash cede control of the CDC to the medical and pharmaceutical industry and their financiers, allowing them to control the direction of “public” health policy?\n\nWould business-oriented, for-profit medical programs, using the CDC’s imprimatur, come to dominate public health policy?\n\nThose questions seemed to have their answer in the CDC Foundation’s donor list which reads like a ‘Who’s Who’ of pandemic profiteers and philanthropic mercenaries.\n\nMajor sources of cash for the Foundation include the GAVI Alliance, Bloomberg Philanthropies, Fidelity Investments, Morgan Stanley Global Impact Funding Trust, Microsoft Corporation, Imperial College London, Johns Hopkins University, Google, Facebook, Merck Sharp & Dohme Corp., Johnson & Johnson Foundation and the omnipresent ‘do-gooders’ at the Bill and Melinda Gates Foundation.\n\nIn 2016 a group of concerned senior scientists from within the CDC wrote a letter to then CDC Chief of Staff Carmen Villar alleging that the CDC “is being influenced and shaped by outside parties…[and this] is becoming the norm and not the rare exception.”\n\nThe transgressions cited in that letter include: “questionable and unethical practices,” “cover-up of inaccurate screening data” and “definitions changed and data cooked to make the results look better than they were.”\n\nThe scientists went on to note that the CDC, “essentially suppressed [findings] so media and/or Congressional staff would not become aware of the problems” and “CDC staff [went] out of their way to delay FOIAs and obstruct any inquiry.”\n\nThe indictment also claimed that CDC representatives had “irregular relationships” with corporate entities that suggested direct conflicts of interest.\n\nWhile criticisms of the CDC have increased in recent years, a look back at its history reveals a long list of misconduct and questionable practices.\n\nAs far back as 1976, the CDC was creating mass medical terror campaigns in order to procure increased funding and justify mass vaccination programs. The infamous 1976 swine flu scandal sought to inoculate 213 million Americans for a pandemic that didn’t exist. By the time the program collapsed in late 1976, 46 million Americans were needlessly injected– despite the knowledge that neurological disorders were associated with the vaccines. This resulted in thousands of adverse events including hundreds of incidents of Guillain-Barre Syndrome.\n\nThis deception was meticulously exposed by Mike Wallace on 60 Minutes.\n\nAt the onset of the mass vaccination program, Dr. David Sencer – then head of the CDC – when pushed on national TV, admitted there had only been “several [swine flu] cases reported worldwide and none confirmed.” When asked if he had encountered “any other outbreaks of swine flu anywhere in the world”, he bluntly answered, “No.”\n\nIn contrast to the CDC’s publicly stated position as “protector of public health,” this type of misconduct would become standard operating procedure and serve as the template for future invented pandemics.\n\nA growing rap sheet of scandals would come to define the CDC’s existence.\n\nIn 1999 the CDC was accused of misspending $22.7 million appropriated for chronic fatigue syndrome. Government auditors said they could not determine what happened to $4.1 million of that money and the CDC could not explain where the money went.\n\nIn 2000, the agency essentially lied to Congress about how it spent $7.5 million that had been appropriated for research on the hantavirus. Instead, the CDC diverted much of that money into other programs. “One official said the total diverted is almost impossible to trace because of CDC bookkeeping practices, but he estimated the diversions involved several million dollars.”\n\nIn 2009, in the midst of the now-infamous H1N1 swine flu hoax, the CDC was forced to recall 800,000 doses of swine flu vaccine for children for a pandemic that never materialized.\n\nIn 2010 Congress discovered that the CDC “knowingly endangered DC residents regarding lead in the drinking water.” A Congressional report found that the CDC did not properly warn residents of high levels of lead in the DC drinking water and “left the public health community with the dangerous and wrong impression that lead-contaminated water is safe for children to drink.”\n\nIn 2016 The Hill reported on two scandals at the CDC. One involved the “cover-up” of “the poor performance of a women’s health program called WISEWOMAN.” The allegations asserted that within the program, “definitions were changed and data ‘cooked’ to make the results look better than they were” and the CDC actively suppressed this information.\n\nThe other scandal involved ties between Coca-Cola and two ‘high-ranking’ CDC officials. The two scientists were accused of manipulating studies about the safety of sugar-laden soft drinks. Two days after these connections were revealed one of the accused CDC scientists retired.\n\nThese scandals were brought to light by the CDC Scientists Preserving Integrity, Diligence, and Ethics in Research, or CDC SPIDER.\n\nAs part of their statement, these scientists remarked, “our mission is being influenced and shaped by outside parties and rogue interests…. What concerns us most, is that it is becoming the norm and not the rare exception.”\n\nTheir complaints were filed anonymously “for fear of retribution.”\n\nAnother dodgy, yet textbook, example of the incestuous nature of Big Pharma’s Revolving Door was the case of former CDC commander Julie Gerberding. As director of the CDC from 2002 to 2009 Gerberding, “shepherded Merck’s highly controversial and highly profitable Gardasil vaccine through the regulatory maze.” From there she moved on to a cozy and highly profitable position as Merck’s vaccine division president and was curiously lucky enough to cash in her Merck stock holdings at opportune times.\n\nAnother in a series of collusion scandals hit the CDC in 2018 when director Brenda Fitzgerald was forced to resign as she was caught buying stock in cigarette and junk food companies, the very companies the CDC regulates.\n\nThe CDC and the Vaccine Industry\n\nAlthough the CDC does not regulate the pharmaceutical industry, the agency’s policies and recommendations have profound implications for drugmakers. Nowhere is this more apparent than the national vaccination policy- in particular the CDC Child and Adolescent Immunization Schedule.\n\nDespite pushing the world’s most aggressive vaccination campaign the facts on the ground show a decidedly different reality than CDC advertisements would lead us to believe in the efficacy of this campaign. Chronic disease in American children has skyrocketed from 6% to 54% in the past 40 years and the United States holds the lamentable distinction of the highest infant mortality rates in the developed world.\n\nSome point out that the CDC currently operates as chief vaccine sales and marketing agent for Big Pharma buying, selling, and distributing vaccines even as the agency has direct conflicts of interest by holding multiple patents on vaccines and various aspects of vaccine technologies. Compounding this deceptive state of affairs, the CDC poses as a neutral scientific body that assesses vaccine safety while mandating increased vaccine doses to the American people.\n\nWhile the CDC does not sell vaccines directly, it does receive royalties from companies that acquire licenses to their technologies.\n\nThe CDC’s Advisory Committee on Immunization Practices (ACIP) plays a major role. The 12-member ACIP Committee has extraordinary influence on the health of virtually all US citizens as it is the body tasked with “adding to and/or altering the national recommended vaccine schedule.”\n\nThe CDC and various members of this committee, in what can charitably be called ‘conflicts of interest’, currently own and have profited from an array of vaccine patents. These include vaccine patents for Flu, Rotavirus, Hepatitis A, Anthrax, West Nile virus, SARS, Rift Valley Fever, and several other diseases of note.\n\nOther patents held by the CDC encompass various applications of vaccine technologies including Nucleic acid vaccines for the prevention of flavivirus infection, aerosol delivery systems for vaccines, adjuvants, various vaccination testing methods, vaccine quality control, and numerous other vaccine accessories.\n\nThe CDC and Covid: The Road to Covid Hell is Paved with CDC Obfuscations\n\nAs the central organization commissioned with “protecting America from health, safety and security threats,” the CDC was presented with the most significant assignment in its controversial history when the Covid Crisis of 2020 spread to the shores of the United States.\n\nThe CDC would shift into hyperdrive offering up all manner of advice, guidelines, regulations, decrees, and laws impacting virtually every aspect of life across the country. Most of these decrees represented radical departures from past epidemiological principles.\n\nDuring this existential ‘crisis’ the CDC would initiate an extraordinary campaign of rolling and shifting regulations. This onslaught of new “guidelines” included face coverings, social distancing, contact tracing, quarantines and isolation, Covid testing, travel regulations, school closures, business procedures– little of everyday life did not come under the influence and control of the CDC machinery. No stone was left un-micromanaged— even the mundane task of washing hands was transformed into a 4-page baroque ritual, video included, via CDC guidelines. It seemed the only thing notably omitted from CDC “expert guidelines” during this teachable moment was nutrition and exercise.\n\nThis onslaught of edicts and definitions shifted on a weekly basis creating a climate of confusion and chaos. When questioned, the CDC would sternly proclaim “the science is settled.” When politically expedient they reconfigured their protocols artfully asserting “the science evolved.”\n\nWhile the most visible and contentious dissembling concerned the efficacy of masks – dozens of comparative studies clearly illustrated their ineffectiveness and harms – there were far more profound and disturbing manipulations emanating from the ever-shifting sands at CDC headquarters.\n\nOne of the more egregious examples of CDC duplicity occurred on March 24, 2020, when the CDC changed well-established protocols on ‘how cause of death’ would now be reported on death certificates, exclusively for COVID-19.\n\nThis seemingly benign modification became a watershed moment launching a process by which many deaths would be erroneously coded as U07.1 COVID-19. This led to massive COVID-19 death misattribution, which was used to ramp up the fear and used as justification for the assemblage of draconian Covid policies.\n\nCritics have called for a full audit of the CDC noting that, “These changes in data definition, collection, and analysis were made only for Covid” in violation of federal guidelines. In a statement to Reuters, the CDC said, “it made adjustments to its COVID Data Tracker’s mortality data on March 14 because its algorithm was accidentally counting deaths that were not COVID-19-related.”\n\nTwo years after the problematic change in certification, the CDC would commence the process of removing tens of thousands from its “Covid death” toll.\n\nAs the Covid crisis unfolded, all of the long and winding roads ended up in the same place: experimental mRNA gene therapies which were sold as ‘vaccines’ and advertised as a panacea to extricate the world from this ‘crisis.’ The CDC, as a trusted go-to government body and chief marketing representative, was tasked with leading the country to safer shores by peddling Pharma’s latest cash cow to the American public.\n\nTo sell these experimental injections the CDC relied on the ever-handy marketing mantra of “safe and effective”. Consistent with past maneuverings, CDC communiques on the mRNA injections were chaotic when not outright duplicitous.\n\nCertain problems cropped up almost immediately as it was discovered that this sales pitch was dependent on flawed study designs and data that was clearly massaged and manipulated.\n\nThe very same CDC that originally touted Covid injections as being able to “stop transmission” took an abrupt U-Turn admitting they couldn’t.\n\nOnce the “vaccine” rollout was in full swing the CDC, true to form, ignored all warning signs.\n\nAs early as January 2021 safety signals pointed toward the potential dangers of these controversial injections. Adverse reactions were either downplayed or completely ignored. Risk-benefit analysis was also kept off the table even as the data painted a not-so-rosy portrayal of “safe and effective.”\n\nThe CDC’s reputation took another hit when it was reported that large swaths of Covid data had been hidden from public scrutiny and independent analysis. This added to the pile of pandemic policy scandals and further tarnished the CDC’s veneer as a reliable public health agency.\n\nThe story of CDC kleptocracy parallels the story of contemporary US government institutions. From its humble beginnings as an agency with a mission to manage the swamp, it has degenerated into a bloated bureaucracy that has become a full-fledged member of the swamp.\n\nThat the CDC isn’t telling the truth to Americans on important matters of public health is in plain sight. It is no surprise that polls show public confidence in the CDC plummeting and, in the minds of many, the agency’s once honorable bubble has burst.\n\nAccusations of CDC corruption no longer exist exclusively in the skeptical minds of government critics; they have become commonplace denunciations backed by mountains of easy-to-access evidence. No conspiracy is needed as a litany of scandals have come to characterize ‘business as usual’ at the CDC.\n\nTo find the answer ask a different question.", "opengraph": {"type": "article", "title": "The Case Against the CDC as We Know It", "url": "https://www.climatedepot.com/2022/05/20/the-case-against-the-cdc-as-we-know-it/", "description": "BY MICHAEL BRYANT  The Centers for Disease Control (CDC) was founded in 1946 as a backwater quasi-governmental agency with a negligible budget and a handful of employees tasked with a simple missio…", "article:published_time": "2022-05-20T17:00:23+00:00", "article:modified_time": "2022-05-20T17:00:23+00:00", "site_name": "Climate Depot", "image": "https://s0.wp.com/i/blank.jpg", "locale": "en_US"}, "tags": ["lockdowns", "covid", "reset", "treaty"], "tweets": [], "movies": [], "links": ["https://brownstone.org/articles/the-case-against-the-cdc-as-we-know-it/", "https://www.cdc.gov/about/history/index.html", "https://www.cdc.gov/about/organization/mission.htm", "https://www.cdc.gov/about/organization/pledge.html", "https://static1.squarespace.com/static/58d417c8c534a598c8c22474/t/59df91238dd0414a334e1ecf/1507823909521/BMJ+Lenzer+CDC+private+good.pdf", "https://usrtk.org/wp-content/uploads/2019/11/Petition-to-CDC-re-Disclaimers.pdf", "https://www.cdcfoundation.org/sites/default/files/upload/pdf/CDCFoundation-ActivePrograms-FY2018.pdf", "https://easyhealthoptions.com/cdc-bed-big-pharma/", "https://www.cdcfoundation.org/", "https://www.congress.gov/congressional-report/109th-congress/house-report/510/1", "https://health.economictimes.indiatimes.com/news/pharma/can-cdc-in-the-us-takings-millions-from-pharma-industry-be-unbiased/47357501", "https://www.cdcfoundation.org/FY2021/donors?group=corp", "https://www.gatesfoundation.org/about/committed-grants?q=CDC%20Foundation#committed_grants", "https://usrtk.org/wp-content/uploads/2016/10/CDC_SPIDER_Letter-1.pdf", "https://slate.com/technology/2021/02/swine-flu-vaccine-1976-history.html", "https://www.youtube.com/watch?v=4bOHYZhL0WQ&ab_channel=TheUniversity", "https://m.lasvegassun.com/news/1999/nov/11/nevada-senator-calls-for-criminal-investigation-of/", "https://www.washingtonpost.com/wp-srv/WPcap/2000-02/02/013r-020200-idx.html", "https://www.spiegel.de/international/world/reconstruction-of-a-mass-hysteria-the-swine-flu-panic-of-2009-a-682613.html", "https://www.baltimoresun.com/news/bs-xpm-2009-12-16-0912160005-story.html", "https://affiliates.legalexaminer.com/uncategorized/officials-and-cdc-knowingly-endangered-dc-residents-regarding-lead-in-the-drinking-water/", "https://www.washingtonpost.com/wp-dyn/content/article/2010/05/19/AR2010051902599.html", "https://thehill.com/blogs/pundits-blog/healthcare/301432-the-cdc-is-being-being-influenced-by-corporate-and-political/", "https://www.huffpost.com/entry/cdc-official-exits-agency_b_10760490", "https://usrtk.org/tag/cdc-division-for-heart-disease-and-stroke-prevention/", "https://therevolvingdoorproject.org/the-industry-agenda-big-pharma/", "https://duluthreader.com/articles/2019/12/12/114079-why-you-cant-trust-the-fda-the-who-the-cdc", "https://www.reuters.com/article/us-merck-gerberding/former-cdc-head-lands-vaccine-job-at-merck-idUSTRE5BK2K520091221", "https://namelyliberty.com/former-cdc-director-julie-gerberdings-stock-at-merck/", "https://www.latimes.com/nation/nationnow/la-na-brenda-fitzgerald-20180131-story.html", "https://www.cdc.gov/vaccines/schedules/hcp/imz/child-adolescent.html", "https://www.nvic.org/cmstemplates/nvic/pdf/49-doses-posterb.pdf", "https://flybynews.wordpress.com/2022/04/02/rfk-jr-discusses-fauci-vaccines-and-big-pharmas-power/", "https://www.globalresearch.ca/japan-no-vaccine-mandates-no-mmr-vaccine-healthier-children/5675901", "https://www.sott.net/article/340865-Robert-Kennedy-exposes-CDC-as-cesspool-of-corruption", "https://www.cdc.gov/od/science/technology/techtransfer/faq.htm", "https://www.cdc.gov/vaccines/acip/index.html", "https://www.lawfirms.com/resources/environment/environment-health/cdc-members-own-more-50-patents-connected-vaccinations", "https://www.opendemocracy.net/en/opendemocracyuk/dr-paul-for-profit-offit-measles-and-bbc/", "https://patents.google.com/patent/US6169175?oq=vaccine+inassignee:centers+inassignee:for+inassignee:disease+inassignee:control", "https://patents.google.com/patent/US8357525?oq=vaccine+inassignee:centers+inassignee:for+inassignee:disease+inassignee:control", "https://patents.google.com/patent/US7223535?oq=vaccine+inassignee:centers+inassignee:for+inassignee:disease+inassignee:control", "https://patents.google.com/patent/US9102742?oq=vaccine+inassignee:centers+inassignee:for+inassignee:disease+inassignee:control", "https://patents.google.com/patent/US8715689?oq=vaccine+inassignee:centers+inassignee:for+inassignee:disease+inassignee:control", "https://patents.google.com/patent/US7220852?oq=vaccine+inassignee:centers+inassignee:for+inassignee:disease+inassignee:control", "https://patents.google.com/patent/US8673629?oq=vaccine+inassignee:centers+inassignee:for+inassignee:disease+inassignee:control", "https://patents.google.com/patent/US7417136?oq=vaccine+inassignee:centers+inassignee:for+inassignee:disease+inassignee:control", "https://patents.google.com/patent/US7954486?oq=vaccine+inassignee:centers+inassignee:for+inassignee:disease+inassignee:control", "https://patents.google.com/patent/US8354115?oq=vaccine+inassignee:centers+inassignee:for+inassignee:disease+inassignee:control", "https://patents.google.com/patent/US5212084?oq=vaccine+inassignee:centers+inassignee:for+inassignee:disease+inassignee:control", "https://patents.google.com/patent/US8986933?oq=vaccine+inassignee:centers+inassignee:for+inassignee:disease+inassignee:control", "https://www.cdc.gov/coronavirus/2019-ncov/cdcresponse/laws-regulations.html", "https://www.cdc.gov/coronavirus/2019-ncov/prevent-getting-sick/prevention.html", "https://www.cdc.gov/coronavirus/2019-ncov/prevent-getting-sick/about-face-coverings.html", "https://www.cdc.gov/socialmedia/videos/covid-19/asl/social-distancing/316132-A_SocialDistancing_COVID19_ASL.pdf", "https://www.cdc.gov/coronavirus/2019-ncov/daily-life-coping/contact-tracing.html", "https://www.cdc.gov/coronavirus/2019-ncov/your-health/quarantine-isolation.html", "https://www.cdc.gov/coronavirus/2019-ncov/symptoms-testing/testing.html", "https://www.cdc.gov/coronavirus/2019-ncov/travelers/index.html", "https://www.cdc.gov/coronavirus/2019-ncov/downloads/considerations-for-school-closure.pdf", "https://www.cdc.gov/coronavirus/2019-ncov/community/workplaces-businesses/index.html", "https://www.cdc.gov/handwashing/when-how-handwashing.html", "https://townhall.com/tipsheet/mattvespa/2022/01/24/not-that-were-shocked-but-the-cdc-just-hurled-more-propaganda-about-masks-again-n2602249", "https://thetruthiswhere.wordpress.com/2021/11/06/cdc-emails-our-definition-of-vaccine-is-problematic/", "https://drtrozzi.org/2021/12/21/more-than-150-comparative-studies-and-articles-on-mask-ineffectiveness-and-harms/", "https://healthfreedomdefense.org/counting-covid-deaths/", "https://beyondthecon.com/grand-jury-petition/", "https://www.reuters.com/business/healthcare-pharmaceuticals/cdc-reports-fewer-covid-19-pediatric-deaths-after-data-correction-2022-03-18/", "https://childrenshealthdefense.org/defender/cdc-removes-tens-of-thousands-deaths-covid/", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/safety-of-vaccines.html", "https://childrenshealthdefense.org/defender/cdc-studies-covid-vaccine-narrative/", "https://childrenshealthdefense.org/defender/politics-cdc-u-turn-pandemic-narrative/", "https://stevekirsch.substack.com/p/the-cdc-knew-in-january-2021-that?s=r", "https://childrenshealthdefense.org/defender/cdc-covid-vaccine-reactions-mild-vaers-thousands-deaths-hospitalizations/", "https://tobyrogers.substack.com/p/what-is-the-number-needed-to-vaccinate?s=r", "https://www.nytimes.com/2022/02/20/health/covid-cdc-data.html", "https://www.pewresearch.org/politics/2021/05/17/public-trust-in-government-1958-2021/", "https://www.webmd.com/lung/news/20210609/trust-in-cdc-fda-took-a-beating-during-pandemic"], "authors": [], "publish_date": "2022-05-20T17:00:23+00:00"}