{"result_id": "070020", "URL": "https://www.climatedepot.com/2020/10/11/serfdom-misery-the-great-reset-a-fascist-experiment-being-pushed-by-controlling-elitists/", "timestamp": "2023-04-25 14:43:44 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.climatedepot.com/2020/10/11/serfdom-misery-the-great-reset-a-fascist-experiment-being-pushed-by-controlling-elitists/", "encoding": "UTF-8"}, "image": null, "domain": "www.climatedepot.com", "title": "‘Serfdom & misery’: ‘The Great Reset’ – A ‘fascist experiment being pushed by controlling elitists’", "cleaned_text": "Maurice Newman: \"A lasting side-effect of Covid-19 is the universal growth of state power. Despite global death rates peaking last April and immunity building even without a vaccine, authoritarian leaders are clinging to their recently acquired powers. No doubt they view individual freedom as an optional extra not an inalienable right and want their new powers to become a normal part of governing.\" ... \"The World Economic Forum, a Geneva-based non-profit foundation whose ranks include Prince Charles and other climate change crusaders like Al Gore and Greta Thunberg, together with the secretary general of the United Nations, the president of the European Central Bank, the secretary-general of the OECD, the managing director of the IMF, George Soros, world trade union leaders, chief executives of Big Tech and representatives of NGOs like Greenpeace and WWF, believes climate action must be top of the global agenda as we emerge from Covid-19.\" ... \"Much of the WEF’s agenda can be found in America’s radical Left’s Green New Deal, which addresses climate change and economic inequality. It embraces the spirit of Franklin D. Roosevelt’s New Deal and the social and economic reforms which he introduced to lift the US out of the Great Depression. However, unlike the New Deal, the Great Reset and the Green New Deal share a belief that the world is being governed by fundamentally wrong assumptions and that ‘dramatic transformation is possible with a change of mindset’.\" ... \"Indeed, anyone who fears big government and values free speech, freedom to choose and property rights, should be terrified. Yet, so far, political, business and church leaders, along with the mainstream media, seem oblivious to the threat and turn blind eyes to the dictatorial abuses already perpetrated in the name of the pandemic. There is even bi-partisan support for policies which, two decades ago, would have been considered politically and economically unthinkable.\" ... \"Stripped of the propaganda, the Great Reset is not new. It’s another fascist experiment being pushed by controlling elitists. Economic growth and social mobility must be subordinate to the collective. Connections will be institutionalized and privilege perpetuated. History demonstrates the children of the elites will receive preferential access to higher education and elite positions. ‘Inclusion’ and ‘fairness’? Forget it. Think inequality, serfdom and misery.\"\n\nDavos 2021 will launch its own Green New Deal. Be afraid.\n\nBy Maurice Newman – Former advisor to Aussie PM\n\nA lasting side-effect of Covid-19 is the universal growth of state power. Despite global death rates peaking last April and immunity building even without a vaccine, authoritarian leaders are clinging to their recently acquired powers. No doubt they view individual freedom as an optional extra not an inalienable right and want their new powers to become a normal part of governing. The Victorian government is legislating to that effect.\n\nIronically, it was their gross incompetence, or deliberate intent, which gave them the present commanding heights. First, despite clear evidence of Covid’s virulence, the World Health Organisation kowtowed to Beijing by playing down the risks of infection. Then, when the spread threatened the capacity of global medical resources, health authorities modelled catastrophic scenarios to frighten citizens into submission and to justify enforceable, draconian lockdowns imposed without regard for basic rights or economic cost. Much of the ‘expert’ advice relied upon has since been exposed as politically biased, not scientifically based.\n\nThe response to Covid follows closely the approach taken by global warming activists. But as Prince Charles puts it, ‘The threat of climate-change has been more gradual (than the pandemic) — but its devastating reality for many people and their livelihoods around the world, and its ever greater potential to disrupt, surpasses even that of Covid-19’. He argues we have ‘a golden opportunity to seize something good from the crisis’.\n\nThe World Economic Forum, a Geneva-based non-profit foundation whose ranks include Prince Charles and other climate change crusaders like Al Gore and Greta Thunberg, together with the secretary general of the United Nations, the president of the European Central Bank, the secretary-general of the OECD, the managing director of the IMF, George Soros, world trade union leaders, chief executives of Big Tech and representatives of NGOs like Greenpeace and WWF, believes climate action must be top of the global agenda as we emerge from Covid-19.\n\nThe Forum’s founder and executive chair, Klaus Schwab, also believes ‘The pandemic represents a rare but narrow window of opportunity to reflect, reimagine, and reset our world’. ‘All aspects of our societies and economies must be revamped, from education, to social contracts and working conditions.’ He labels this the ‘Great Reset’. He points to uneven access to healthcare, education, economic opportunities and social progress as well as to growing inequality among and within nations and racial and ethnic groups. At the centre of these multiple crises lies the tension between privilege and meritocracy. Governments will need to intervene more, (coerce) to ensure ‘better’ and ‘fairer outcomes’ from private investments. ‘In short,’ he says, ‘we need a Great Reset of capitalism.’\n\nMuch of the WEF’s agenda can be found in America’s radical Left’s Green New Deal, which addresses climate change and economic inequality. It embraces the spirit of Franklin D. Roosevelt’s New Deal and the social and economic reforms which he introduced to lift the US out of the Great Depression. However, unlike the New Deal, the Great Reset and the Green New Deal share a belief that the world is being governed by fundamentally wrong assumptions and that ‘dramatic transformation is possible with a change of mindset’.\n\nAlready, Professor Schwab and his colleagues have started mobilising vast networks of left-wing activists. Indeed, the 2021 annual summit will include members of the WEF’s thousands strong Global Shapers Community, youth crusaders located in 400 cities across the planet. As Schwab says, ‘The changes we have already seen in response to Covid-19 prove that a reset of our economic and social foundations is possible. This is our best chance to instigate stakeholder capitalism’. Those who scoffed at claims that climate change was a stalking horse for a new world order, should think again. That reality is now in full view\n\nCome January 2021, Professor Schwab’s Great Reset campaign will begin in earnest. Should his ideological opponent, US President Donald Trump, not be re-elected, a major obstacle to achieving his societal and economic revamp will be gone. Schwab is determined that a return to a post-Covid business-as-usual world ‘will not happen’.\n\nIndeed, the World Economic Forum, the United Nations and its various agencies will use the current depressed economic environment, masked as it is by endless government support, together with renewed forecasts of apocalyptic climate change, to push for a ‘more inclusive social contract’, a decarbonised economy and a ‘control without ownership’ business sector, where companies ‘serve all stakeholders not just shareholders’.\n\nIntense pressure will be applied to parliaments everywhere to pass enabling laws and to abdicate more responsibilities to unelected bureaucrats in global institutions. Crony capitalism is anathema to genuine market economies and, giving more leverage to those who encourage it is simply fascistic. No surprise that some of the organisations behind the ‘stakeholder capitalism’ push are accused of corruption, sexual harassment, cover ups and a general abuse of power. Still, the WEF’s oligarchy derives much of its extraordinary influence and wealth from these same institutions and no one should doubt their Big Brother intentions.\n\nIndeed, anyone who fears big government and values free speech, freedom to choose and property rights, should be terrified. Yet, so far, political, business and church leaders, along with the mainstream media, seem oblivious to the threat and turn blind eyes to the dictatorial abuses already perpetrated in the name of the pandemic. There is even bi-partisan support for policies which, two decades ago, would have been considered politically and economically unthinkable.\n\nStripped of the propaganda, the Great Reset is not new. It’s another fascist experiment being pushed by controlling elitists. Economic growth and social mobility must be subordinate to the collective. Connections will be institutionalised and privilege perpetuated. History demonstrates the children of the elites will receive preferential access to higher education and elite positions. ‘Inclusion’ and ‘fairness’? Forget it. Think inequality, serfdom and misery.\n\nFormer Advisor to Aussie PM Declares UN climate agenda ‘more about Marxism than science’ – Laments World succumbing to ‘bogus science & catastrophism’", "opengraph": {"type": "article", "title": "‘Serfdom & misery’: ‘The Great Reset’ – A ‘fascist experiment being pushed by controlling elitists’", "url": "https://www.climatedepot.com/2020/10/11/serfdom-misery-the-great-reset-a-fascist-experiment-being-pushed-by-controlling-elitists/", "description": "Dangerous elites planning ‘the Great Reset’ Davos 2021 will launch its own Green New Deal. Be afraid. By Maurice Newman – Former advisor to Aussie PM October 10, 2020 A lasting side-effect of…", "article:published_time": "2020-10-11T13:18:25+00:00", "article:modified_time": "2020-10-13T17:28:47+00:00", "site_name": "Climate Depot", "image": "https://spectatorau.imgix.net/content/uploads/2020/10/cover_10-oct_post.jpg?auto=compress,enhance,format&crop=faces,entropy,edges&fit=crop&w=820&h=550", "image:width": "686", "image:height": "460", "locale": "en_US"}, "tags": ["mkey", "clampdown", "coronavirus", "reset", "gnd"], "tweets": [], "movies": [], "links": ["https://spectator.com.au/2020/10/dangerous-elites-planning-the-great-reset/", "https://spectator.com.au/author/maurice-newman/", "https://www.climatedepot.com/2015/12/28/former-advisor-to-aussie-pm-declares-un-climate-agenda-more-about-marxism-than-science-laments-world-succumbing-to-bogus-science-catastrophism/", "https://www.climatedepot.com/2015/12/28/former-advisor-to-aussie-pm-declares-un-climate-agenda-more-about-marxism-than-science-laments-world-succumbing-to-bogus-science-catastrophism/"], "authors": [], "publish_date": "2020-10-11T13:18:25+00:00"}