{"result_id": "070007", "URL": "https://www.climatedepot.com/2022/05/05/biden-climate-advisor-boasts-100-rules-this-year-alone-on-appliances-sustainable-airlines-warns-industry-better-be-all-in-or-theyre-gonna-be-out-of-here/", "timestamp": "2023-04-25 14:43:36 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.climatedepot.com/2022/05/05/biden-climate-advisor-boasts-100-rules-this-year-alone-on-appliances-sustainable-airlines-warns-industry-better-be-all-in-or-theyre-gonna-be-out-of-here/", "encoding": "UTF-8"}, "image": null, "domain": "www.climatedepot.com", "title": "Biden climate advisor boasts ‘100 rules this year alone on appliances’ & urges ‘sustainable airlines’ – Warns industry ‘better be’ all in ‘or they’re gonna be out of here’", "cleaned_text": "White House National Climate Advisor & former EPA chief Gina McCarthy: \"We have solutions that can deliver. We're actually going to do 100 rules this year alone on appliances, just like you asked. We are developing partnerships on how we work together for new building standards, even for sustainable airlines. Who'd a thunk that they'd be all in, but they better be, or they're gonna be out of here.\" Climate Depot's Morano comment: \"Welcome the Dystopia USA 2022. The very last thing Americans need right now is a regulatory ambush of 100 additional climate 'rules' that would impact every major home appliance but do absolutely nothing for the climate. After years of COVID lockdowns, mask and vaccine mandates, skyrocketing energy costs and now war, U.S. businesses do not need mandated government 'partnerships' to meet mythical climate 'standards.' The Biden administration's attempt to force so-called 'sustainable airlines' on the public -- or else -- is not a sane path forward.\"\n\nWhite House National Climate Advisor & former EPA chief Gina McCarthy speaking on April 29, 2022, at Massachusetts Climate Summit at Tufts University:\n\nMcCarthy: “We have solutions that can deliver. We’re actually going to do 100 rules this year alone on appliances, just like you asked. We are developing partnerships on how we work together for new building standards, even for sustainable airlines. Who’d a thunk that they’d be all in, but they better be, or they’re gonna be out of here.”\n\nClimate Leaders Call for Urgent Action, Focus on Equity – White House advisor Gina McCarthy, AG81, and Senator Ed Markey, H19, speak at Massachusetts Climate Summit – “This is an important moment in time,” said Gina McCarthy, AG81, White House National Climate advisor. “This is an opportunity for us to really buckle down and realize that the future is in our hands right now.” … As the country moves toward “100% clean electricity, we know we cannot leave the major sources of pollution behind,” she said, “which is why we’ve gone after the strongest vehicle standards ever. All we need is some help with Congress to make sure that everybody can afford [an electric vehicle].” …\n\nBiden’s Climate Czar Declares War on Kitchen Appliances – By Todd Starnes: “Climate advisor Gina McCarthy is waging a war on your appliances. The other day she told an audience at Tufts College the administration is implementing dozens of new rules on kitchen appliances. “We’re actually going to do 100 rules this year alone on appliances,” she boasted to the crowd. “Just like you asked.” This is the same person – who last year – said there needed to be a crackdown on refrigerators. This is what the Green New Deal is going to look like in real life. Americans will soon be scrubbing out stains on a washboard and cooling food in an ice box. Thanks to the Biden Administration, the border has been overrun, gas prices are at an all-time high, inflation is the worst in 40 years, and now — Americans are about to suffer from an outbreak of dishpan hands. In 2015, then-EPA Administrator McCarthy called out washing machines and dryers as the biggest energy users in American households.\n\nThe New Yorker mag claims the refrigerator is ‘an Agent of Climate Catastrophe’\n\nNew Yorker claims air conditioners are the culprits “of our unfolding climate catastrophe.” Rebuttal: The “notion that refrigeration is contributing to a ‘climate catastrophe’ is preposterous,” Steve Milloy of JunkScience.com noted. He also pointed out that the leftist “war against refrigeration” goes all the way back to the 1970s. The “war” has since resurfaced under President Joe Biden’s push for ratification of the radical Kigali Amendment, which seeks to phase out HFCs on a global scale to fight climate change.\n\nJohn Kerry is ‘Coming For Your Refrigerator’ – The real national security threat is your refrigerator – Kerry is pushing for an amendment to the Montreal Protocol to ban HFCs.\n\nKerry: Regulating refrigerator chemicals are ‘of equal importance’ to battling ISIS – Kerry made the remarks as part of a pep talk for negotiators working through the weekend to amend a 1987 treaty called the Montreal Protocol to deal with the chemicals used as refrigerants. “Yesterday, I met in Washington with 45 nations — defense ministers and foreign ministers — as we were working together on the challenge of [the Islamic State], and terrorism,” he said. “It’s hard for some people to grasp it, but what we — you — are doing here right now is of equal importance because it has the ability to literally save life on the planet itself.” How Markets Brought Refrigeration to the Masses: ‘Ordinary person today lives better than most kings of yesteryear’ – The story of refrigeration is a common one: from a task done by many servants, to a luxury good, and to now a common household appliance used by all. This type of progress exists with nearly all household appliances; from ovens to irons, from washing machines to dishwashers, and from air conditioners to water heaters. As Marian L Tupy of the Cato Institute has previously pointed out, due to innovation, capitalism and mass production, “an ordinary person today lives better than most kings of yesteryear.” Obama’s Energy Efficiency Regs Are ‘Making Appliances Way Worse’ – Chip Knappenberger mocks: ‘What is government doing in our kitchen, utility room, bathroom, living room, bedroom? Fighting ‘climate change’ of course!’\n\nPaper: ‘U.S. Goes On An Energy Starvation Diet’ — EPA ‘rules make sense only if you want less energy, higher prices and fewer jobs’ – ‘Remember then-candidate Obama’s comment in January 2008 that the price of electricity would ‘necessarily skyrocket; once his policies went into effect? It’s now coming to pass’", "opengraph": {"type": "article", "title": "Biden climate advisor boasts ‘100 rules this year alone on appliances’ & urges ‘sustainable airlines’ – Warns industry ‘better be’ all in ‘or they’re gonna be out of here’", "url": "https://www.climatedepot.com/2022/05/05/biden-climate-advisor-boasts-100-rules-this-year-alone-on-appliances-sustainable-airlines-warns-industry-better-be-all-in-or-theyre-gonna-be-out-of-here/", "description": "White House National Climate Advisor & former EPA chief Gina McCarthy speaking on April 29, 2022, at Massachusetts Climate Summit at Tufts University: McCarthy: “We have solutions that ca…", "article:published_time": "2022-05-05T21:37:48+00:00", "article:modified_time": "2022-05-10T12:28:03+00:00", "site_name": "Climate Depot", "image": "https://s0.wp.com/i/blank.jpg", "locale": "en_US"}, "tags": ["development. economics", "ukraine", "emissions", "biden", "epa", "transportation", "gnd", "astrology"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"500\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">You wanna see insanity? Watch Gina McCarthy in full flight.<br/>Lord, help us. <a href=\"https://t.co/qOEkkKzBuA\">https://t.co/qOEkkKzBuA</a></p>\n<p>— Patrick Moore (@EcoSenseNow) <a href=\"https://twitter.com/EcoSenseNow/status/1522198448937656321?ref_src=twsrc%5Etfw\">May 5, 2022</a></p></blockquote>\n"], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "360", "embed_code": "<iframe class=\"youtube-player\" width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/vtadgoo7LGI?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-US&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/vtadgoo7LGI?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-US&autohide=2&wmode=transparent"}], "links": ["http://www.climatedepot.com/wp-content/uploads/2022/05/Screen-Shot-2022-05-05-at-5.29.15-PM.png", "http://www.climatedepot.com/wp-content/uploads/2022/05/Screen-Shot-2022-05-05-at-5.30.28-PM.png", "https://now.tufts.edu/2022/05/02/climate-leaders-call-urgent-action-focus-equity", "https://communityrelations.tufts.edu/", "https://tischcollege.tufts.edu/", "https://t.co/qOEkkKzBuA", "https://twitter.com/EcoSenseNow/status/1522198448937656321?ref_src=twsrc%5Etfw", "https://www.toddstarnes.com/us/bidens-climate-czar-declares-war-on-kitchen-appliances/", "https://www.toddstarnes.com/author/todd-starnes/", "https://www.climatedepot.com/2022/01/20/the-new-yorker-mag-claims-the-refrigerator-is-an-agent-of-climate-catastrophe/", "https://www.reuters.com/business/cop/white-house-send-kigali-amendment-climate-warming-gases-senate-officials-2021-11-16/#:~:text=The%20so%2Dcalled%20Kigali%20amendment,States%20has%20not%20yet%20ratified.&text=Biden%20has%20pledged%20that%20the,2030%20compared%20with%202005%20levels.", "https://www.fluorocarbons.org/environment/climate-change/kigali-amendment/", "https://www.climatedepot.com/2015/11/02/john-kerry-is-coming-for-your-refrigerator/", "https://www.climatedepot.com/2016/07/22/kerry-refrigerator-chemicals-are-of-equal-importance-to-battling-isis/", "https://www.climatedepot.com/2021/09/01/how-markets-brought-refrigeration-to-the-masses-ordinary-person-today-lives-better-than-most-kings-of-yesteryear/", "https://www.climatedepot.com/2016/06/10/obamas-energy-efficiency-regs-are-making-appliances-way-worse/", "https://www.climatedepot.com/2011/06/10/paper-us-goes-on-an-energy-starvation-diet-epa-rules-make-sense-only-if-you-want-less-energy-higher-prices-and-fewer-jobs/"], "authors": [], "publish_date": "2022-05-05T21:37:48+00:00"}