{"result_id": "070003", "URL": "https://www.climatedepot.com/2022/11/18/global-leaders-want-vaccine-passports-for-travel-wef-confirms-plan-of-restructuring-the-world/", "timestamp": "2023-04-25 14:43:34 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.climatedepot.com/2022/11/18/global-leaders-want-vaccine-passports-for-travel-wef-confirms-plan-of-restructuring-the-world/", "encoding": "UTF-8"}, "image": null, "domain": "www.climatedepot.com", "title": "Global Leaders Want Vaccine Passports for Travel, WEF Confirms Plan of ‘Restructuring the World’", "cleaned_text": "BALI, INDONESIA — At the G20 meeting this week, world leaders signed a declaration which includes wide-ranging, controversial policies that are set to be implemented – or are already underway – on a global scale. The measures, if realized, will have a significant impact on the lives of citizens – including on rights and freedoms that we in the West have long taken for granted.\n\nA large portion of the G20 declaration is dedicated to the United Nations’ Agenda 2030 and its Sustainable Development Goals (SDGs). As expected, there is a strong focus on core globalist issues, such as climate change, carbon reduction, renewable energy, food security, and public health measures.\n\nIn section 23 of the joint declaration, the signatories of the 19 member countries (plus the European Union) voice their support for implementing so-called vaccine passports for international travel:\n\n“We acknowledge the importance of shared technical standards and verification methods, under the framework of the IHR (2005), to facilitate seamless international travel, interoperability, and recognizing digital solutions and non-digital solutions, including proof of vaccinations,” the declaration states.\n\nIn parallel with the political leadership summit, an official “dialogue forum” for global business called B20 also took place. In a panel discussion, Indonesia’s health minister Budi Sadikin promoted the implementation of vaccine passports:\n\n“Let’s have a digital health certificate acknowledged by the WHO. If you have been vaccinated or tested properly, then you can move around. So for the next pandemic, instead of stopping the movement of people a hundred percent […] you can still provide some movement of the people,” Sadikin said.\n\n“Ultimately, what the G20 leaders want is the suspension of democracy. Nothing says that better than this statement on vaccine passports for travel,” author and political commentator Marc Morano said of the declaration.\n\n“They’re basically announcing that your right to travel is contingent upon World Health Organization approval. This is unprecedented and the ease with which once free Western nations seem to go along with it is astounding. Combined with the climate and carbon tracking programs, it’s clear that they’re creating a social credit system for people in the West – something that we’ve previously only seen in China,” Morano explains.\n\nSince the so-called pandemic started, those paying attention to international affairs have noted the deep involvement of the World Economic Forum (WEF) in all aspects of the COVID-19 response. The organization, which has collected most of the world’s largest corporations as well as political, military and intelligence heads as members, was originally founded as a business roundtable group in 1971 by Klaus Schwab, a German disciple of Henry Kissinger.\n\nMerely a few months after COVID-19 was declared a pandemic by the WHO in early 2020, Schwab, who serves as WEF chairman, released a book called COVID-19: The Great Reset. The thesis of the book is to use the pandemic as a springboard – an “opportunity” – for a worldwide implementation of a type of technocratic corporatist rule, where “stakeholders” designated by an unelected group of elites replace citizens as political subjects.\n\nThe Great Reset – often dismissed as a conspiracy theory by media outlets and commentators who obviously haven’t read Schwab’s book on the topic – nor paid a visit to the WEF’s website where the plan is laid out in exacting detail – is a comprehensive and detailed project for total, global systemic change of the way we live as human beings.\n\nIn his keynote address at the B20 meeting, Klaus Schwab stated:\n\n“What we have to confront is a deep, systemic and structural re-structuring of our world. And this will take some time. And the world will look differently after we have gone through this transition process.”\n\nMarc Morano, who’s written a book on the subject, says that these systemic changes are designed to strip away individual rights and liberties, including democracy itself.\n\n“The elites at the top of this agenda, like King Charles, Klaus Schwab and Bill Gates, think that if we – regular people – are left to our own devices, we will destroy the planet. According to them, we need their expertise to steer all aspects of our lives, because we’re too stupid for our own good. They think that they’re morally as well as intellectually superior. It’s a totalitarian ideology and it’s about total control,” Morano told The Florida Standard.\n\n“The people in charge of this project keep coming out with fear narratives: that we’re facing a climate emergency, a dying earth, food shortages, pandemics and public health emergencies. Any dissenting views, even from Nobel laureates and world-renowned academics – is suppressed and censored. The policies contained in Agenda 2030 are based on the idea that individual rights are no longer tenable, no longer matter. In America, this is something that every progressive politician is pushing, and many Republicans have no problem with it at all,” he said.\n\nAccording to Morano, the crises we are seeing around the world following COVID-19 are artificially created in order to make way for this new totalitarian system:\n\n“They have intentionally collapsed our energy and food supply. They’re going after farmers in the Netherlands and Canada. They want to stop meat consumption. And they’ve collapsed our free speech with Big Tech censorship. Next is our currency and our transportation – our right to free movement – by banning gasoline-powered cars. The vaccine passport that they want to implement is just another lever of control,” Morano explained.\n\nPlans and development efforts for the implementation of a global digital identity have been in the works for several years. Curiously, the digital ID project ID2020 is being pushed by people and organizations we recognize as influencers of the so-called COVID-19 pandemic: Bill Gates and his former company Microsoft, his present vaccine initiative GAVI, and one of the world’s largest consulting firms – Accenture.\n\nDutch legal expert and political commentator Eva Vlaardingerbroek slammed the G20 declaration as another step towards an inversion of the rule of law and justice.\n\n“People have forgotten what the state is for, and that the state serves the citizens, not the other way around. You have an entire population that apparently seems to forget that they pay up to half of their income in taxes. You do that so that the state – supposedly – does things in your interest. Instead, the state treats us as criminals,” she stated on British TV channel GBNews.\n\nMarc Morano doesn’t have much hope that the totalitarian agenda of the ruling elites will turn around.\n\n“We saw during the lockdowns, masking and vaccinations that about 80 percent of people buy the narrative. The other 20 percent will be suppressed and persecuted, similar to what Justin Trudeau did to peaceful protesters in Canada. He invoked emergency measures and turned off their bank accounts. And we’ve seen what the Department of Justice here in America did to parents who simply didn’t want their children exposed to the transgender agenda in schools – they were branded ‘domestic terrorists,” Morano told The Florida Standard.", "opengraph": {"type": "article", "title": "Global Leaders Want Vaccine Passports for Travel, WEF Confirms Plan of ‘Restructuring the World’", "url": "https://www.climatedepot.com/2022/11/18/global-leaders-want-vaccine-passports-for-travel-wef-confirms-plan-of-restructuring-the-world/", "description": "By JONAS VESTERBERG . BALI, INDONESIA — At the G20 meeting this week, world leaders signed a declaration which includes wide-ranging, controversial policies that are set to be implemented – or are …", "article:published_time": "2022-11-18T20:02:57+00:00", "article:modified_time": "2022-11-19T14:26:37+00:00", "site_name": "Climate Depot", "image": "https://pbs.twimg.com/media/Fhwihg9WAAAfhSQ?format=jpg&name=medium", "image:width": "666", "image:height": "315", "image:alt": "Image", "locale": "en_US"}, "tags": ["covid", "mediacd", "reset", "wef", "who"], "tweets": [], "movies": [], "links": ["https://sdgs.un.org/2030agenda", "https://www.whitehouse.gov/briefing-room/statements-releases/2022/11/16/g20-bali-leaders-declaration/", "https://twitter.com/WallStreetSilv/status/1592774471617847297", "https://www.amazon.com/COVID-19-Great-Reset-Klaus-Schwab/dp/2940631123/ref=sr_1_1?crid=2WIF204U5VVVR&keywords=schwab&qid=1668739952&sprefix=schwab%2Caps%2C1281&sr=8-1", "https://www.weforum.org/great-reset/", "https://twitter.com/justin_hart/status/1592564043495411712", "https://rumble.com/v1uqpfs-every-person-needs-to-listen-to-klaus-schwab-on-great-reset-in-his-own-word.html", "https://www.amazon.com/Great-Reset-Global-Permanent-Lockdown/dp/1684512387", "https://m.youtube.com/watch?v=9NMGag1iuYw"], "authors": [], "publish_date": "2022-11-18T20:02:57+00:00"}