{"result_id": "070033", "URL": "https://www.climatedepot.com/tag/co2/", "timestamp": "2023-04-25 14:43:52 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.climatedepot.com/tag/co2/", "encoding": "UTF-8"}, "image": null, "domain": "www.climatedepot.com", "title": "co2 – Climate Depot", "cleaned_text": "\n• Pielke Jr. on 1.5C temperature target: ‘There was essentially no science behind it’ – ‘More grounded in political aspirations than in science’ Pielke Jr.: \"Because climate policy target setting was shifting from carbon dioxide concentrations targets to global temperatures, to keep pace, the discourse needed to change as well. So 450 ppm became recast as 2 degrees Celsius and 350 ppm became 1.5 degrees Celsius, even though 350 ppm had never really been studied and the previous IPCC assessment associated 450ppm with temperature outcomes of 1.4C to 3.1C.\" ... \"The nerdy concept of 350 parts per million of carbon dioxide in the atmosphere had gone global, despite the fact that there was essentially no science behind it, just Hansen’s non-peer-reviewed draft paper and a bunch of sign-ons to a newspaper ad. Well done!\" \"The U.N. FCCC always recognized that the 1.5 C target was much more grounded in political aspirations than in science...\"\n• 1938: ‘A landmark paper in the Royal Meteorological Society’ concluded warming would ‘prove beneficial to mankind’ – ‘Return of the deadly glaciers should be delayed indefinitely’ 1938: Royal Meteorological Society study: \"It may be said that the combustion of fossil fuel, whether it be peat from the surface or oil from 10,000 feet below, is likely to prove beneficial to mankind in several ways, besides the provision of heat and power. The above mentioned small increases of mean temperature would be important at northern margin of cultivation, & growth of favorably situated plants is directly proportional to the CO2 pressure.\" In any case, the return of the deadly glaciers should be delayed indefinitely.\"\n• Horowitz: Republicans must stop accepting the premise of the carbon/climate fascism agenda Daniel Horowitz: \"Republicans [should] finally stop accepting the pseudo-science and moral premise of the left’s climate agenda. If COVID didn’t teach them the lesson about industry experts and scientific consensus being used to fundamentally transform our lives, create monopolies, and centralize power, then nothing will. COVID should serve as the Great Reset of the two-decade GOP mistake of accepting climate fascism.\" ... Carbon capture is the perfect political issue, because it allows Republicans to feign triangulation with the greenies while enriching an industry that could never naturally thrive on its own without government mandates, marketing, subsidies, and regulatory capture. ... The worst thing we could be doing now is validating the left’s premise about climate and carbon and pushing expensive ideas built upon those fallacies.\" ... \"Just as with COVID, Republicans have largely accepted the false premise behind the global warming agenda, which is depleting our quality of life, crushing our freedoms, and making everything expensive. They merely object to the extreme to which Democrats are taking it. However, once you accept the premise, you lose the argument, which is why Republicans have joined in with climate regulations on appliances, green energy mandates and subsidies, and ethanol for years. Now, with so much of the scientific premise being exposed as a scam, just like the COVID vaccine and mask $cience, it’s time to reverse every “climate” policy rooted in the premise of carbon being a pollutant.\"\n• We’re saved! GOP announces ‘that addressing climate change is absolutely a prime priority’ – ‘Wants to appease climate-conscious voters & powerful business interests’ Politico: \"...lawmakers are investing new energy into formulating a Republican response to the crisis, at least on paper.\" \"We believe that our energy solutions are climate solutions and that addressing climate change is absolutely a prime priority,\" Energy and Commerce Chair Cathy McMorris Rodgers of Washington state told Jeremy. That’s in line with McCarthy’s own efforts to craft a GOP climate strategy before last year’s midterms. ... Some Republican lawmakers are promoting measures to boost deployment of renewable energy and sequester carbon through tree planting (while others are stuck on the hoax thing)...“Republicans have moved from denial to an acknowledgment of climate change,” Alex Flint, a former Republican congressional staffer who now leads the conservative group Alliance for Market Solutions, told Emma. The bottom line: The GOP wants to appease climate-conscious voters and powerful business interests that want the party to act on climate.", "opengraph": {"type": "website", "title": "co2 – Climate Depot", "url": "https://www.climatedepot.com/tag/co2/", "site_name": "Climate Depot", "image": "https://s0.wp.com/i/blank.jpg", "locale": "en_US"}, "tags": ["emissions", "germany", "reset", "lockdown", "co2"], "tweets": [], "movies": [], "links": ["https://www.climatedepot.com/2023/04/23/epa-to-propose-first-controls-on-co2-emissions-from-power-plants-will-be-1st-time-fed-govt-has-limited-co2-from-existing-power-plants/", "https://www.climatedepot.com/2023/04/23/epa-to-propose-first-controls-on-co2-emissions-from-power-plants-will-be-1st-time-fed-govt-has-limited-co2-from-existing-power-plants/", "https://www.nytimes.com/2023/04/22/climate/epa-power-plants-pollution.html?smid=tw-share", "https://www.climatedepot.com/2023/04/10/china-uses-more-coal-than-all-other-nations-on-earth-combined-shows-zero-signs-of-changing-course/", "https://www.climatedepot.com/2023/03/15/pielke-jr-on-1-5-c-temperatre-target-there-was-essentially-no-science-behind-it-more-grounded-in-political-aspirations-than-in-science/", "https://www.climatedepot.com/2023/03/08/watch-ian-plimer-a-geologists-view-of-climate-change-at-heartland-institute-climate-conference-2023/", "https://www.climatedepot.com/2023/02/13/1938-a-landmark-paper-in-the-royal-meteorological-society-concluded-warming-would-prove-beneficial-to-mankind-return-of-the-deadly-glaciers-should-be-delayed-indefinitely/", "https://webcache.googleusercontent.com/search?q=cache:kIofnit7fA8J:https://www.theguardian.com/environment/blog/2013/apr/22/guy-callendar-climate-fossil-fuels&cd=1&hl=en&ct=clnk&gl=us", "https://rmets.onlinelibrary.wiley.com/doi/abs/10.1002/qj.49706427503", "https://www.climatedepot.com/2023/02/07/horowitz-republicans-must-stop-accepting-the-premise-of-the-carbon-climate-fascism-agenda/", "https://www.theblaze.com/op-ed/horowitz-republicans-must-stop-accepting-the-premise-of-the-carbon-climate-fascism-agenda", "https://www.climatedepot.com/2023/02/01/were-saved-gop-announces-that-addressing-climate-change-is-absolutely-a-prime-priority-wants-to-appease-climate-conscious-voters-powerful-business-interests/", "https://www.climatedepot.com/2023/02/01/were-saved-gop-announces-that-addressing-climate-change-is-absolutely-a-prime-priority-wants-to-appease-climate-conscious-voters-powerful-business-interests/", "https://www.politico.com/newsletters/power-switch/2023/01/26/does-the-gop-finally-have-a-climate-plan-00079615", "https://www.politico.com/news/2022/06/01/house-republicans-to-introduce-climate-change-strategy-with-eye-on-midterms-00036481", "https://twitter.com/realdonaldtrump/status/265895292191248385", "https://www.climatedepot.com/2023/01/25/chinas-carbon-dioxide-emissions-are-double-u-s-india-close-to-surpassing-usa/", "https://www.climatedepot.com/2023/01/24/whats-the-real-cost-of-co2-the-epa-relies-on-sloppy-science-in-a-new-co2-cost-estimate/", "https://www.climatedepot.com/2023/01/12/german-climate-researcher-schellnhuber-proposes-limiting-amount-of-co2-to-3-tons-of-a-year-enabling-private-emissions-trading/"], "authors": [], "publish_date": null}