{"result_id": "070001", "URL": "https://www.climatedepot.com/tag/mediacdf/", "timestamp": "2023-04-25 14:43:32 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.climatedepot.com/tag/mediacdf/", "encoding": "UTF-8"}, "image": null, "domain": "www.climatedepot.com", "title": "mediacdf – Climate Depot", "cleaned_text": "\n• Watch: Morano on Fox News Channel: Climate agenda is ‘coming for your food’ – ‘They’re always looking for reasons why the rest of us can’t be free’ \"First, they came for your energy. Then they came for your gas-powered cars, your freedom of movement, your cheap flights. Now they're coming for your food,\" Morano, author of \"The Great Reset: Global Elites and the Permanent Lockdown,\" said on \"Fox News Tonight.\" \"They will be monitoring what you eat. What’s coming next are the restrictions,\" Morano said. \"We are already seeing it globally with a net-zero commitment. They’re going after high-yield agriculture trying to collapse them. We saw the disaster in Sri Lanka. You also have Bill Gates… America's number one single farmland owner and his goal is to get us to eat his billions of dollars invested in lab-grown synthetic beef made from the stem cells of animals and literally put it in a steel vat and printed on a 3D printer. Not making that up. The fix is in.\" \"This will only happen if we allow it. They’re going after our modern diet. You will eat nothing and be happy according to this plan,\" he added. They're always looking for reasons why the rest of us can’t be free. Now they’re going after rice production. There’s a big story in major media about rice causing all this global warming and emissions. But going after the meat is a way to make everything a problem in a climate emergency. Therefore, they have to be in charge of all this food. They’re not going to try to ban it. They will take over the means of production so the rest of us don’t destroy the Earth. We have to be managed. That’s what we're looking at.\" Fox News host Brian Kilmeade: \"Marc Morano, Thanks so much. We need some pushback and you are doing it.\"\n• Watch: Morano on Fox & Friends: Identity politics has ‘truly invaded’ the climate & science worlds – Talks Environmental Justice, Green New Deal & China Morano: \"Identity politics has truly invaded the climate world but also the just in general, in the science world. In the last few years, what the Biden administration has been witnessing is NASA scientists saying that climate change is caused by white supremacy. We have a Rhode Island professor saying that the data is racist, that science and technology are racist, and you can't rely on it. So how is it Biden administration can even evaluate whether their programs are working when the data is racist? And they're pushing things like crash test dummies are misogynistic because they're all male dummies -- this is all coming from the Biden administration. And now we will be spending billions of dollars to correct what they call 'environmental justice.' We're no longer Americans who all deal with the environment. We're now going to be subdivided into categories for money and handouts to different communities and to the bureaucracies that manage the money. It won't even go to the people allegedly impacted by this environmental racism when they seek environmental justice. But this is just another playing card and massive federal spending by the government and to divide more and more Americans.\"\n• Watch: Morano debunks Biden’s ‘science-free’ climate/energy claims point-by-point – On Bongino’s Fox News show: ‘I think it’s easier to transition your gender than it is to transition to green energy’ Morano on Energy Dysphoria: \"I think it's easier to transition your gender than it is to transition to green energy. There's just no way to put this. This green energy is not green. It's not clean, and it's not cheaper to replace fossil fuels. It requires fossil fuels to make green energy, wind, and solar require more reliance on China, requires rare earth mining, and renewables dig the earth, not in a Brady Bunch 1970s kind of way -- they dig deep into the earth. And what's amazing here is none of Biden's supporters could care less about China, Venezuela, OPEC in the Middle East, exploring their fossil fuels, but they express horror if we do it here in the U.S., suddenly America's evil. They could care less about all these other regimes doing it with lower human rights and lower environmental standards.\" Morano: \"During the Climategate scandal, when all the emails were released, revealed that top UN scientist Phil Jones said, Where did we even get this number, this temperature of 1.5 or 2 degrees goal from? He said it was likely pulled from thin air with no science behind it.\" Biden claims the weather is getting more extreme: Morano: \"It's completely science free. There are always going to be floods, droughts, hurricanes, tornadoes, and wildfires. That's the history of the Earth. That's completely normal. What's key here is if you look at the peer-reviewed literature and even buried in United Nations climate reports and the National Climate Assessments -- hurricanes, floods, tornadoes, droughts, wildfires are either not increasing, or they are declining on climate timescales of 30, 50, or 100 years.\"\n• Watch: Morano on Jesse Watters Primetime on Fox News talks about how kids propagandized by wokeism – ‘Kids being told ‘data is racist…that white supremacy is the cause of climate change’. Morano: \"Wokeism has invaded their lives and propagandized them on climate change. We have kids out there who believe that you need to defund the police or abolish the police -- that those issues are one of the causes of climate change. Kids are being told by professors -- one at the University of Rhode Island -- that the scientific data is racist. They're being told by NASA scientists that white supremacy is the cause of climate change. These kids aren't being taught how to think anymore. They're being taught to be afraid, and they're being propagandized to be climate activists. And that's what even Leonardo DiCaprio is on record saying. 'We have to get kids young' to turn them into these climate activists who will then sue the government for not ensuring they have a safe climate.\" ... \"If you are worried that there is a climate emergency, which these kids are, the way to solve it is the exact opposite of the climate agenda or Green New Deal. It's wealth, technology, and innovation. That is the way forward.\"\n• Watch: Morano on Tucker Carlson talking the ‘intended consequences’ of skyrocketing electricity prices & proposes naming blackouts after politicians pushing ‘green’ energy Morano: \"These are the intended consequences of these policies...We ought to start naming energy blackouts after the politicians' who push these green policies.\" \"The United States has had electrical grids for over 100 years -- over a century, we know how to provide power. There is no excuse for having energy shortages, blackouts, and high skyrocketing prices. The only excuse is politics, and a net zero Green New Deal climate agenda has crept into our policies. You have solar and wind being subsidized, and there's no penalty for their unreliability, their lack of battery storage, or the lack of energy they produce. They're treated equally, which then forces grids to incorporate them -- solar, and wind mandates -- into the grid, and then you end up with either shortages or, consequently, skyrocketing prices. We ought to start naming energy blackouts after the politicians' who push these green policies.\"\n• Watch: Morano on Fox & Friends on Biden okaying Venezuelan oil: We can’t drill for more U.S. energy but we can buy from ‘countries with the most egregious human rights violations & lowest environmental standards’ Fox News Channel: Marc Morano slams Biden administration for relying on Venezuelan oil: 'It's all part of their plan' - ClimateDepot.com publisher Marc Morano slams the Biden administration for restricting U.S. energy production while easing sanctions on Venezuelans for oil production. \"They are literally more concerned about hostile nations being allowed to drill than they are Pennsylvania, Oklahoma, Texas and American domestic energy. ... Let's buy energy from the countries with the most egregious human rights violations and lowest environmental standards to produce energy, but no way are we going to allow Americans. ... All they are doing is offshoring U.S. emissions.\" \"They had defunded the oil and gas industry from day one through executive orders, through the Treasury Department, through pushing environment, social governance, ESG,\" Morano told Fox & Friends co-host Carley Shimkus. \"And they've also allowed these environmental groups in sometimes in collusion with the feds to sue.\" \"So they give a permit, but then they get tied up for years and years and years, and the funding is questionable, and of course, the future permits are questionable, so that is just a red herring argument,\" he continued. \"It's not like the Biden administration is opposed to energy extraction and drilling, no, they're just opposed to it domestically for cheap political accounting tricks that claim that they're fighting global warming while offshoring U.S. emissions,\" Morano said. \"This is something that Americans have to recognize.\"", "opengraph": {"type": "website", "title": "mediacdf – Climate Depot", "url": "https://www.climatedepot.com/tag/mediacdf/", "site_name": "Climate Depot", "image": "https://s0.wp.com/i/blank.jpg", "locale": "en_US"}, "tags": ["mediacdf", "emissions", "biden", "mediacd", "gnd", "oil"], "tweets": [], "movies": [], "links": ["https://www.climatedepot.com/2023/04/25/watch-morano-on-fox-news-channel-climate-agenda-is-coming-for-your-food-theyre-always-looking-for-reasons-why-the-rest-of-us-cant-be-free/", "https://www.foxnews.com/media/nyc-mayor-adams-coming-food-waging-war-modern-us-diet-boost-climate-agenda-expert", "http://www.climatedepot.com/wp-content/uploads/2023/04/Screenshot-2023-04-25-at-07.48.24.png", "https://www.foxnews.com/media/nyc-mayor-adams-coming-food-waging-war-modern-us-diet-boost-climate-agenda-expert", "http://www.climatedepot.com/wp-content/uploads/2023/04/Screenshot-2023-04-25-at-07.50.38.png", "https://www.amazon.com/Great-Reset-Global-Permanent-Lockdown/dp/1684512387", "https://www.climatedepot.com/2023/04/23/watch-morano-on-fox-friends-identity-politics-has-truly-invaded-the-climate-science-worlds-talks-environmental-justice-green-new-deal-china/", "https://www.climatedepot.com/2021/01/24/the-data-is-racist-rhode-island-professor-denounces-science-statistics-and-technology-as-inherently-racist/", "https://www.climatedepot.com/2023/04/21/watch-dem-congresswoman-praises-sec-buttigieg-for-placing-female-dummies-in-vehicle-crash-tests-to-fight-the-gender-inequity-in-crash-test-dummies/", "https://www.climatedepot.com/2023/04/20/energy-dysphoria-listen-morano-criticized-for-trans-energy-analogy-it-is-easier-to-transition-your-gender-than-it-is-your-energy/", "https://www.climatedepot.com/2023/04/17/watch-morano-on-fox-friends-biden-admins-ev-push-will-make-us-more-dependent-on-china-will-create-car-shortages-you-will-go-nowhere-be-happy/", "https://www.foxnews.com/video/6325256293112", "https://www.climatedepot.com/2023/02/15/cbs-news-for-some-electric-vehicle-owners-recharging-now-more-costly-than-filling-up/", "https://www.climatedepot.com/2023/02/15/cbs-news-for-some-electric-vehicle-owners-recharging-now-more-costly-than-filling-up/", "https://www.climatedepot.com/2022/12/17/electric-vehicle-charging-in-oslo-norway-is-now-more-than-twice-as-expensive-as-filling-gas-powered-vehicle/", "https://www.climatedepot.com/2023/04/14/great-car-reset-is-working-cars-soon-unaffordable-for-50-of-germans/", "https://www.climatedepot.com/2023/01/27/net-zeros-global-winner-is-china-us-hasnt-noticed-yet-that-china-made-cars-are-taking-over-the-world-poised-to-become-no-2-exporter-of-cars-surpassing-us-s-korea/", "https://www.amazon.com/Great-Reset-Global-Permanent-Lockdown/dp/1684512387", "https://www.climatedepot.com/2023/03/26/watch-morano-on-bonginos-fox-news-show-i-think-its-easier-to-transition-your-gender-than-it-is-to-transition-to-green-energy/", "https://www.climatedepot.com/2023/01/30/watch-morano-on-fox-friends-on-lab-grown-meat-insect-eating-theyre-creating-intentional-food-shortages-so-a-desperate-public-is-going-to-be-more-open-to-eating-anything/", "https://www.foxnews.com/video/6319418069112", "https://www.climatedepot.com/2023/01/26/the-great-food-reset-lab-grown-meat-harvested-in-massive-steel-vats-edges-closer-to-fed-approval-u-s-dinner-plates-as-eu-approves-human-consumption-of-worms-crickets/", "https://www.climatedepot.com/2019/08/09/food-police-watch-morano-on-fox-friends-on-un-meat-report-un-seeks-massive-expansion-of-the-uns-regulatory-power-lifestyle-controls/", "https://www.climatedepot.com/2021/06/11/nbc-news-farmers-turned-into-renters-as-bill-gates-becomes-the-nations-largest-farmland-owner-uses-shell-companies-a-web-of-at-least-22-limited-liability-shell-companies-mc/", "https://www.climatedepot.com/2021/02/15/bill-gates-on-green-reset-its-an-all-out-effort-like-a-world-war-but-its-us-against-greenhouse-gases-urges-regulation-to-force-people-to-eat-synthetic-meat-links-covid-climate/", "https://www.climatedepot.com/2022/08/08/netherlands-attempting-to-shut-down-11200-farms-to-meet-climate-goals-1-5-of-total-number-of-farms/", "https://www.climatedepot.com/2022/07/12/sri-lanka-the-global-revolt-against-the-laptop-elites-from-sri-lanka-to-the-netherlands-albania-to-canada-the-masses-are-stirring/", "https://www.climatedepot.com/2022/07/10/trudeaus-nitrogen-policy-will-decimate-canadian-farming/", "https://www.climatedepot.com/2022/08/09/biologist-dr-jennifer-marohasy-explains-how-australias-net-zero-legislation-will-decimate-farming-by-restricting-nitrogen-fertilizers/", "https://www.climatedepot.com/2022/03/26/the-great-food-reset-has-arrived-expect-real-food-shortages-biden-declares-meanwhile-bill-gates-china-buy-up-u-s-farmland/", "https://www.climatedepot.com/2022/03/11/americans-may-have-to-say-goodbye-to-steak-burgers-as-beef-costs-rise-as-inflation-soars-just-what-the-climate-activists-always-wanted/", "https://www.climatedepot.com/2022/08/22/the-great-food-reset-they-really-do-want-you-to-eat-bugs-theyve-made-meat-expensive-launched-a-pr-campaign-to-promote-bug-eating/", "https://www.climatedepot.com/2023/01/22/watch-morano-on-bogingos-fox-news-show-talking-davos-wef-were-living-in-a-time-now-where-conspiracy-realities-outnumber-conspiracy-theories/", "https://www.climatedepot.com/2023/01/17/watch-morano-on-jesse-watters-primetime-on-fox-news-talks-about-how-kids-propagandized-by-wokeism-kids-being-told-data-is-racist-that-white-supremacy-is-the-cause-of-climate-change/", "https://www.climatedepot.com/2023/01/05/watch-morano-on-tucker-carlson-talking-skyrocketing-electricity-prices-naming-blackouts-after-politicians-pushing-the-green-agenda/", "https://www.climatedepot.com/2022/11/29/watch-morano-on-fox-friends-on-biden-okaying-venezuelan-oil-we-cant-drill-for-more-u-s-energy-but-we-can-buy-from-countries-with-the-most-egregious-human-rights-violations-lowest-environmen/", "https://www.climatedepot.com/2022/11/29/watch-morano-on-fox-friends-on-biden-okaying-venezuelan-oil-we-cant-drill-for-more-u-s-energy-but-we-can-buy-from-countries-with-the-most-egregious-human-rights-violations-lowest-environmen/", "https://video.foxnews.com/v/6316301227112", "https://www.foxnews.com/person/s/carley-shimkus"], "authors": [], "publish_date": null}