{"result_id": "071014", "URL": "https://judithcurry.com/2020/03/19/coronavirus-uncertainty/", "timestamp": "2023-04-25 14:44:25 CEST+0200", "meta": {"description": "by Judith Curry My thoughts on coronavirus and deep uncertainty. I and my family are in isolation, in relatively comfortable, well-stocked and in safe circumstances (solar power with Tesla power wall).   My community (Reno NV) has relatively few cases and no apparent transmission as of yet; however Las Vegas NV is pretty hard hit as…", "lang": "en", "keywords": "", "favicon": "https://s0.wp.com/i/webclip.png", "canonical": "https://judithcurry.com/2020/03/19/coronavirus-uncertainty/", "encoding": "UTF-8"}, "image": null, "domain": "judithcurry.com", "title": "Coronavirus uncertainty", "cleaned_text": "My thoughts on coronavirus and deep uncertainty.\n\nI and my family are in isolation, in relatively comfortable, well-stocked and in safe circumstances (solar power with Tesla power wall). My community (Reno NV) has relatively few cases and no apparent transmission as of yet; however Las Vegas NV is pretty hard hit as well as neighboring communities in California.\n\nI am very fortunate not have to worry personally about jobs or $$ through this (apart from the financial well being of our extended family members and employees at CFAN). We also live in a quasi-isolated location near the edge of wilderness, with many walking trails.\n\nI am working to continue supporting the service people that we rely on (housekeeper, personal trainers, handyman etc). My daughter is working to set up online music lessons, and our Tai Chi instructor is working on setting up online instruction. Once the weather is nice, both music lessons and and Tai Chi sessions will be held outside in our very large driveway.\n\nI have no idea where this is all headed, only that I expect us to be surprised.\n\nMy ‘prediction’ (well, hope) is that effective treatments will be identified (I have flagged dozens of such publications on twitter, lets discuss this on the technical thread), and that this will be brought under control within a few months.\n\nPersonally, my most immediate concern is that Netflix streaming doesn’t bring down the internet!\n\nThere is much discussion about parallels with decision making under corona virus and climate change. The climate change alarmists say that CV shows us how and why we need to act urgently on climate change.\n\nAu contraire. The main similarity between CC and CV are that they are both situations of deep uncertainty.\n\nFor CV, we are working from data from countries having the early outbreaks, plus epidemiological models.\n\nExtreme precaution is advised immediately to save lives. Individual people feel the urgent, visceral need for extreme precaution (well not all them, viz. the riotous spring breakers in Florida). The economic and social consequences of this extreme precaution is beginning to be realized; the key is flexibility in our responses so we can shift course as needed.\n\nI have written much on the topic of climate change and the precautionary principle. Simply put, the precautionary principle is wrong trousers from the climate change problem. Apart from the brainwashed Extinction Rebellion folk (assuming that they are doing this not because they are being paid to do it), no one feels the urgent visceral need to drop everything and ‘act’ on climate change. The reason for that is that the potential adverse impacts of climate change have a long time horizon (decades to centuries), there is no simple ‘action’ that will reverse climate change, premature actions could lock us into infrastructure that is not in our best long term interests. And finally, diversion of all our resources to the climate change problem could make us more vulnerable to more urgent problems such as CV.\n\nThis is not to say that we shouldn’t act on climate change; I have long argued for no regrets actions such as energy technology R&D, adaptation to extreme weather events, planning for 21st century infrastructures, and minimizing pollution of air, water and soils.\n\nHowever, inferring that the coronavirus policies will lead to comparably urgent climate change action is misguided, IMO.\n\nWe will eventually get past this. What are the long-term implications of our CV experiences? Some of them arguably have implications for climate change. But there are much broader implications for how we live and work, and also the social safety net.\n\nThe rate of epidemiological and immunological research that is getting conducted and published is breathtaking; after all this settles, the old publication model with peer review and paywall will arguably be dead.\n\nThe insanity of people travelling nonstop all over the world for conferences and meetings has been illuminated. Apart from the CO2 emissions, this travelling is an insane loss of productivity and takes a toll on people’s health. Even the IPCC is conducting its working group meetings via the internet.\n\nWith regards to scientific conferences, these are being posted on the internet. These days on the rare occasions i go to conferences, I don’t attend any talks (look at them later on the internet), but set up meetings with people (collaborators, old friends, clients and potential clients). That is the hard part, but everyone staying home has more of an opportunity to reach out to people over the internet.\n\nTraveling and tourism will undoubtedly change. While I have never been on a big cruise trip, I can’t imagine getting on such a ship after all this. I suspect that air travel won’t recover to its previous level.\n\nRestaurants will change dramatically, more a focus on pick up and delivery than on dining. Apparently millennials are already in this mode, rarely going to restaurants but relying on food pick up or delivery.\n\nHow we value employees at the lower end of the economic ladder will change, e.g. grocery store employees, truck drivers, health care workers, teachers, etc.\n\nThe CV experience has been a real eye-opener for the U.S. in terms of its fragile safety net for vulnerable people (pretty much every one is vulnerable at one time or another). Sick leave (and pay), health care are being reconsidered. Much flux for both political parties in the U.S.; here’s to hoping that something sensible emerges.\n\nThe perception of expertise is in flux. As a result of climate change alarmism (both scientists and the media), scientific expertise took a hit in terms of political and public perceptions. By contrast, the scientific experts on coronavirus are doing a superb job and politicians are taking them seriously. What lessons the climate alarmed and dismissives will eventually learn from this remains to be seen.\n\nWith regards to health care, we are seeing the rise of TeleHealth. Also this experience is highlighting the deep problems with the U.S. FDA; apart from the COV testing regulations fiasco, the latest is that hydroxychlorquine is not approved for coronavirus treatment in the U.S.; approval would take 90 days.\n\nCO2 emissions are down, which is likely only temporary, but some of these post CV changes could have longterm impacts.\n\nWell, this should be enough to kick off the discussion. Stay safe, everyone.", "opengraph": {"type": "article", "title": "Coronavirus  uncertainty", "url": "https://judithcurry.com/2020/03/19/coronavirus-uncertainty/", "description": "by Judith Curry My thoughts on coronavirus and deep uncertainty.", "article:published_time": "2020-03-19T16:05:49+00:00", "article:modified_time": "2020-03-19T17:01:24+00:00", "site_name": "Climate Etc.", "image": "https://s0.wp.com/i/blank.jpg", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["mailto:?subject=%5BShared%20Post%5D%20Coronavirus%20%20uncertainty&body=https%3A%2F%2Fjudithcurry.com%2F2020%2F03%2F19%2Fcoronavirus-uncertainty%2F&share=email", "https://judithcurry.com/2020/03/19/coronavirus-uncertainty/?share=twitter", "https://judithcurry.com/2020/03/19/coronavirus-uncertainty/?share=facebook", "https://judithcurry.com/2020/03/19/coronavirus-uncertainty/#print", "https://judithcurry.com/2020/03/19/coronavirus-uncertainty/?share=reddit", "https://judithcurry.com/2020/03/19/coronavirus-uncertainty/?share=tumblr"], "authors": [], "publish_date": "2020-03-19T16:05:49+00:00"}