{"result_id": "071025", "URL": "https://judithcurry.com/2023/02/06/my-interview-with-jordan-peterson/", "timestamp": "2023-04-25 14:44:43 CEST+0200", "meta": {"description": "by Judith Curry My interview on the Jordan B Peterson podcast is now available. If you don't know who Jordan Peterson is, he is quite an interesting character [Wikipedia].  He is a Canadian psychologist and best selling author, media commentator, and his podcast has over 6M subscribers. Here is a link to the podcast of…", "lang": "en", "keywords": "", "favicon": "https://s0.wp.com/i/webclip.png", "canonical": "https://judithcurry.com/2023/02/06/my-interview-with-jordan-peterson/", "encoding": "UTF-8"}, "image": null, "domain": "judithcurry.com", "title": "My interview with Jordan Peterson", "cleaned_text": "My interview on the Jordan B Peterson podcast is now available.\n\nIf you don’t know who Jordan Peterson is, he is quite an interesting character [Wikipedia]. He is a Canadian psychologist and best selling author, media commentator, and his podcast has over 6M subscribers.\n\nHere is a link to the podcast of my interview [link]. The main interview is 1.5 hours; the supplemental 2nd interview is 30 minutes. From my perspective, the 30 minute add on was most interesting part of the interview (I at least had a chance to mention my new book Climate Uncertainty and Risk)\n\nJordan Peterson is currently quite interested in the climate change topic, he has also done recent interviews with\n\nI haven’t listened to either of these (I prefer reading interviews, rather than listening to podcasts), but I would expect them both to be very good — both have accumulated lot of views, likes and favorable comments on youtube.\n\nJordan Peterson’s podcast is quite a production, here is some ‘behind the scenes’ info. We agreed on a start time for the interview of 8 am local time; I figured this would give me sufficient time to get my act together. The day before the interview, I received an email saying that the production crew would arrive at 6 am! A little after 6 am, about half dozen people arrived, the first arrival shoveled my front walk way (we had overnite snowfall) so they could bring all the equipment in.\n\nFurniture in the selected room was completely rearranged (they even took down the Xmas ornaments from my potted Norfolk pine tree). Big camera and recording setup. At about 6:45 am, the makeup artist/hair stylist arrived. I figured I could wear big headphones like Joe Rogan, which hides a bad hair day; no such luck – earbuds. I insisted on an extremely small amount of makeup and very limited touching of my face (trying to keep my shingles nerve pain under control). I do have to admit I looked significantly better than usual. Start time was delayed to 8:30, with about 30 minutes of sitting in the interview chair and testing everything.\n\nMy dogs had a great time through all of this setup (and the crew was very friendly), but the dogs and Peter were exiled to a bedroom during the actual interview. I have to confess I had not previously listened to a Jordan Peterson podcast, so I was a bit taken aback by his interview style – he talks a lot and encourages his interviewees to interrupt him (interrupting people is not my style, but Peter would disagree).\n\nAll in all, a very interesting experience and I think overall a good podcast. It is rapidly accumulating views on youtube, I will be checking closely to see if this one gets shadowbanned by youtube like my previous interview on BizNews, apparently once it reached 500K views.\n\nThe comments are pretty entertaining, look at the most recent ones to get a better sampling of the strange ones (rather than looking at the most popular ones).\n\np.s. I have been really busy, unfortunately little time for blog posts. I have a few interesting guest posts in the pipeline, stay tuned.", "opengraph": {"type": "article", "title": "My interview with Jordan Peterson", "url": "https://judithcurry.com/2023/02/06/my-interview-with-jordan-peterson/", "description": "by Judith Curry My interview on the Jordan B Peterson podcast is now available.", "article:published_time": "2023-02-06T22:12:30+00:00", "article:modified_time": "2023-02-07T01:16:39+00:00", "site_name": "Climate Etc.", "image": "https://s0.wp.com/i/blank.jpg", "locale": "en_US"}, "tags": ["here"], "tweets": [], "movies": [], "links": ["https://en.wikipedia.org/wiki/Jordan_Peterson", "https://www.youtube.com/watch?v=9Q2YHGIlUDk", "https://judithcurry.com/2023/01/17/climate-uncertainty-and-risk-in-press/", "https://www.youtube.com/watch?v=reaABJ5HpLk&t=1756s", "https://www.youtube.com/watch?v=7LVSrTZDopM&t=36s", "mailto:?subject=%5BShared%20Post%5D%20My%20interview%20with%20Jordan%20Peterson&body=https%3A%2F%2Fjudithcurry.com%2F2023%2F02%2F06%2Fmy-interview-with-jordan-peterson%2F&share=email", "https://judithcurry.com/2023/02/06/my-interview-with-jordan-peterson/?share=twitter", "https://judithcurry.com/2023/02/06/my-interview-with-jordan-peterson/?share=facebook", "https://judithcurry.com/2023/02/06/my-interview-with-jordan-peterson/#print", "https://judithcurry.com/2023/02/06/my-interview-with-jordan-peterson/?share=reddit", "https://judithcurry.com/2023/02/06/my-interview-with-jordan-peterson/?share=tumblr"], "authors": [], "publish_date": "2023-02-06T22:12:30+00:00"}