{"result_id": "071043", "URL": "https://judithcurry.com/2021/02/12/a-climate-of-dialogue/", "timestamp": "2023-04-25 14:45:04 CEST+0200", "meta": {"description": "by Judith Curry A pacated dialogue between two serious thinkers who disagree about climate change. This post provides excerpts of a dialogue between European scholars Andrea Saltelli and Paul-Marie Boulanger. There are some real insights here.  But mostly, I like the idea of 'pacated dialogue'.  Pacated (a new word for me) means to make less…", "lang": "en", "keywords": "", "favicon": "https://s0.wp.com/i/webclip.png", "canonical": "https://judithcurry.com/2021/02/12/a-climate-of-dialogue/", "encoding": "UTF-8"}, "image": null, "domain": "judithcurry.com", "title": "A climate of dialogue", "cleaned_text": "A pacated dialogue between two serious thinkers who disagree about climate change.\n\nThis post provides excerpts of a dialogue between European scholars Andrea Saltelli and Paul-Marie Boulanger.\n\nThere are some real insights here. But mostly, I like the idea of ‘pacated dialogue’. Pacated (a new word for me) means to make less hostile, peaceful.\n\nWhen I first started Climate Etc (over 10 years ago), somehow this is what I envisioned – high-level thinking and civil disagreement (ha!)\n\nI have the permission of both authors and the publisher to reproduce this; the full chapter can be downloaded here [Dialogue]. References are cited in the full chapter.\n\nI really enjoyed reading this, I hope you enjoy this as much as I did.\n\nTwo authors contend here about the urgency of the challenge posed by climate change, and about the different roles of science, policy, media and society in debating how to cope.\n\nOne contendent argues that science’s epistemic authority is today staked on a sense of urgency of impending climatic catastrophe, which he sees as irresponsible; the other considers climatic action urgent in view of our responsibility to future generations. While one contendent considers that an accelerated exit from a fossil fuel dominated energy mix is both unfeasible and undesirable, the other sees it as an objective to pursue with renewed political determination.\n\nThe authors are linked by common interests, including the analysis of controversies involving science and society. While they agree on several of their diagnoses, e.g. on vaccines (Saltelli and Boulanger 2019), they disagree on climate. How is that? The present dialogue explores this disagreement in a style which remains – to the best of the authors’ capacity – pacated.\n\nAS: I take issue with the role of science in the present discussion on the urgency of action on climate. Science is here not just providing dispassionate facts. As noted by U. Beck in 1986:\n\nScientists act as if they held a lease on truth, and they must do this for the outside world, because their entire position depends on it […] Business, science and the like can no longer act as if they were not doing what they are doing, that is, changing the conditions of social life and hence making policy by their own means. (P. U. Beck 1992)\n\nThis ‘making policy by its own means’ is precisely what we see now.\n\nBy talking about an impending climatic Armageddon, science – or a large sector of the scientific establishment – is staking its epistemic authority on climate, thus creating a virtuous image for itself as committed to the saving of the planet, when the role of science in the present socio-economic trajectories would lend itself to a more mixed judgment (Saltelli and Boulanger 2019). As a result, the media thus incited have come to present a series of processes dominated by decadal dynamic (rise in temperature, in sea level, in frequency and intensity of extreme events) as having jumped through the roof, as happening here and now. [W] are told [by the media] that ‘billions will die’, the ‘world will end in 12 days’, and so on.\n\nThis state of excitement – not to say war – on climate is becoming critical. It detracts attention away from other pressing environmental concerns, from the collapse of fisheries to the decline in insects – not to mention a long list including atmospheric pollution, persistent organic pollutants, endocrine disruptors, and so on.\n\nThe unfortunate epithet ‘denier’ may be applied even to those scientists who do not believe that climate is the most urgent environmental threat – let alone the economic and geopolitical one, while “sceptic is a term of derision” (Turner 2015). One needs impeccable ecological credentials to be allowed to say climate is not perhaps the most urgent environmental threat . One of the best-known sociologists of science can be heard declaring his allegiance to the climatic cause and expressing concern about the misuse of his earlier work from deniers . The resemblance of these practices to those of official religion is surprising.\n\nMore in general, focusing on the ‘fear’ of the public for the climatic threat appears a convenient distraction from a rapidly evolving crisis involving new media, loss of democratic representation, rising inequality and insurgent populism and nativism (Saltelli and Boulanger 2019). That policy is being ‘distracted’ by climate has been noted, for example, in relation to the G7 meeting in Biarritz of August 2019, where in spite of work done in Chantilly in July in preparation for the meeting, promising to address ‘fairer capitalism’ and inequality, i.e. economic and financial topics befitting the G7 more that global threats, the climate discussion ended up obliterating these important themes (Jaillet 2019).\n\nPMB: I distinguish two main questions here, each of them deserving an article of its own. The first question has to do with the relationship between science and politics. The second is the question of what should have priority on the global political agenda.\n\nA “Long-Term & Society” configuration sees society collapsing in a medium to long future because of its internal contradictions, class struggles or whatever. “Short-Term & Environment” gives priority to the current threats to health and well-being arising from pollution and shortages of water and other natural resources. “Short-Term & Society” focuses on the tensions, inequalities and social contradictions already at work in our society.\n\nAs advocates of the cultural theory argue, no attitude is necessarily more accurate or legitimate than any other. All are legitimate and necessary in a complex society. Yet, according to the circumstances, it is possible that one of them becomes prominent for a time because of the necessity to act in a domain that has been hitherto neglected. This, I submit, is the current situation with regard to the climate issue. I am convinced that as soon as significant advances will have been made towards its control and/or adaptation, the corresponding attitude will recede, leaving the place to another priority, long or short-term, environmental or social.\n\nThe conclusion of all this is that there is no point in opposing one mode of observation to another. None is inherently more legitimate, more justified than another. As every observation has its unmarked space and its blind spot, no one is complete, totally comprehensive and sufficient. It follows that politics cannot for long favour one point of view at the expense of the others. It must endeavour to satisfy each of them, at least (and necessarily), partially. If climate activists are shouting so loudly at the moment, it is because they feel that their point of view has been for too long neglected since all the Nation-States of the world have endorsed the United Nations Framework Convention on Climate Change, in 1992.\n\nThis being said, let us turn to the wide question of the relationship between science and politics and speculate about what has gone wrong in the climate change case.\n\nParadoxically, in the case of climate change, the relationships between science and policy is very peculiar. Why? Because of the IPCC; it is a rather exceptional institution which had (almost?) no other equivalent in other fields at the moment of its settlement. Actually, the IPCC is a hybrid of science and policy.\n\nNow, has science been successful in staking its epistemic authority on climate? I am not sure. Except perhaps on vaccination, no domain has been as fiercely controversial as the climate one, especially the issue of human influence on climate. It is not to be denied that something unfamiliar has happened with climate science and the climate issue. Whilst “normal science” conforms traditionally to the ethos described by Robert K. Merton as the conjunction of communism, universalism, disinterestedness, and organized scepticism (Merton 1973) – an ethos that guarantee its legitimacy and credibility – climate science, on the contrary, as institutionalized in the IPCC, has been characterized by a stubborn search for consensus, banishing organized scepticism from the scientific arena and leaving room for un-organized scepticism in the media. In some sense, we are here not very far away from what can happen in the religious domain; the climate-sceptics being considered as heretics and being indicated for disrepute.\n\nContrary to what happened with the H-Bomb Committee where two rivals labs have been settled and financed on an equal basis (See Turner (Turner 2015), Chapter 15. “Expertise in Post-Normal Science”), the climate issue has been entrusted to a unique scientific (more exactly, a mix of scientific and administrative) body devoid of internal mechanisms for competition and contest.\n\nParadoxically, it could be possible to argue that the IPCC has done more harm than good to climate science and climate change awareness. It seems that the climate issue was less controversial before its inception in 1988 than after.\n\nOn the other hand, I don’t think that science has “staked its epistemic authority on climate”. There is no evidence that scientific communications on climate change have crowded out scientific communications on fisheries, pesticides, and many other environmental issues. The authors in (Hilgartner and Bosk 1988) have cogently compared the public arena to a Darwinian ecosystem where social problems struggle for recognition, only a few of them succeeding in capturing the attention of the political system. As suggested here above, the fact that the IPCC didn’t provide itself for an internal contradictory debate gave the media an opportunity to organize it itself. As Evelyn Fox Keller notes :\n\n“Even our most responsible newspapers and journals, in their very commitment to the traditional ethic of “balance,” sometimes contribute to the widespread misimpression that climate scientists are deeply divided about both the extent of the dangers we face and the relevance of human activity to global warming.”\n\nOne can regret that the climate issue has overshadowed the theme of sustainable development – clearly too complex and cumbersome a concept to have a chance to become a suitable theme for the media. However, it had the merit of putting the whole environmental issue (not just the climatic one, or any other) on the political agenda and by acknowledging the legitimacy of economic and social concerns with regard to environmental ones, so as to exclude nobody from the debate. In regard to the promises of sustainable development, one can lament over the excessive place climatic concerns have taken today at the expense of others perhaps as urgent and vital environmental issues but this is not a very productive attitude. It is not at all assured that it will help putting these others concerns on the agenda. On the contrary, it could just contribute to discard absolutely all environmental concerns as the examples of Trump or Bolsonaro illustrate.\n\nAS: I amicably disagree with your last statement – as discussed, the point of contention is not presence – absence on the agenda, but the Darwinian competition for attention in the public sphere. Additionally, while you reproach the media of a false ‘balancing’ act, inflating the opinion of doubters – or ‘deniers’, ‘delayers’, ‘contrarians’, ‘confusionists’, ‘lukewarmers’, or other denigratory denominations sprouted in the heat of the confrontation, there are voices which reproach media for being more receptive to Apocalyptic warning of end of mankind than to a reasoned assessment of climate science (Nisbet 2019)(Shellenberger 2019)(Kloor 2017).\n\nPMB: I don’t see the point on which you – amicably- disagree with me. The Darwinian competition is precisely for a place on the public agenda, taking account of the limited capacity of the public to tackle several issues at once.\n\nNuanced observers such as Sarewitz or, still better, the former chairman of the Tyndall Centre for Climate Change Research, Mike Hulme , though acknowledging the legitimacy and urgency of the climate change issue, blame the IPCC for having underestimated the autonomy of the political and overestimated the one of science in society.\n\nBut, as already stated, the IPCC is not THE science of climate. It is an intermediary institution between climate science (and other things too) and the unfinished, flawed political system of the world society. Its crime is to have subscribed to the linear model of the relationship between science and politics, the “truth speaks to power” model (S. Beck 2011). The problem is probably here: in our functionally differentiated society, hybridicity is an uncomfortable situation.\n\nBut we should not throw the baby out with the bath water forgetting that upstream of the IPCC, there are thousands of scientists who are just concerned with finding and communicating the truth, a truth which they know is temporary and incomplete but that, in all honesty, it is their duty – the duty of science – to communicate. They cannot be held responsible for the errors of the IPCC’s Assessment Reports writers; if any.\n\nThe challenge is not to set these concerns against each other, but to show their intertwining, their systemic nature and to adapt our modes of governance accordingly.\n\nThe fight against climate change is therefore also and perhaps above all a social and political fight. As Greta Thunberg brilliantly put it, she indicts the economic and political elites who consciously let the situation deteriorate (“We could not say that we did not know” Chirac said in Johannesburg in 2002). What I think most shocks the young people who are demonstrating is precisely the gap between the major declarations, the so-called international agreements and the concrete actions. It is the characteristic of youth to think that actions must be in harmony with words. Adults have long ago lost any illusion in that respect, in the political sphere, at least.\n\nThis concerns the main difficulty of environmental policies, the beneficial effects of which will only be felt in the medium and long term and therefore benefit future generations, while the costs are borne by current generations. The most sophisticated criticisms of sustainable development are that it seeks to achieve intergenerational justice at the cost of injustice to the poorest of the current generations. And it is obviously a risk, unless public policy instruments are used that place the burden on the most advantaged.\n\nAS: I believe that one should carefully balance the inertia of the elites with the nature of the demands posed by climate activists. The demand to governments to accelerate our transition away from fossil fuel cannot be met without changing our pattern of consumption, lest we meet the same fate of the German Energiewende – whereby the more solar and wind power is installed, the more carbon must be burned to offset the intermittency of renewable energies (Renner and Giampietro 2020). These failures have recently led to disillusionment. To give an example, the failure of Energiewende can be blamed – for some commentators, on a too hastily exit from the German nuclear (Seneviratne 2019).\n\nThe Breakthrough Institute, one of the upholders of the Ecomodernist Manifesto, is tireless in its advocacy of nuclear as the only way to ensure a carbon neutral future, just glance to the Energy section of their online presence at https://thebreakthrough.org/energy.\n\nIn more general terms I see the following paradox at play: a swift transition is being asked from governments – whose elites are charged with inaction.\n\n[W]e are locked by our own pattern of consumption.\n\nPMB: It is clear that we are stuck in our consumer habits and not only by unscrupulous lobbyists, but above all by infrastructure and buildings that were designed and built at a time when the climate issue was not yet an issue. The question of the transition to a low-carbon economy has, in my opinion, been dealt with in the most rational way by researchers at the Rotterdam DRIFT , adopting an approach focusing on the intermediate level of the socio-technological systems of energy, mobility, housing, etc.\n\nThis transition must use many and varied instruments: economic, technological, socio-cultural. But, contrary to what you think, technology is not necessarily “more of the same”.\n\nAS: Well, I hope I have shown that this is unfeasible in the stipulated time windows, both technically and economically. As per the political will, this is not just the will of politicians, but of their constituencies who are not ready to withstand a change of lifestyle. Not all scientists share this ‘can do’ euphoria. British scientists point out that the UK electric car target for 2050 collide with a physical impossibility – the UK would need about two times the current total annual world cobalt production, nearly the entire world production of neodymium, three quarters of that of lithium production and at least half of that of copper (Editors 2019a).\n\nIn order to keep the attention of the citizenry focused on the climate battle, a ‘can do’ attitude is being held, offering simplistic images of an economy which can be made circular, or rapidly decarbonized, against historical evidence of past transformations . Mathematical models are shown as capable of predicting the damage in dollars from hurricanes and draughts up to the year 2050 or 2100 . Problematic quantifications play a key role in these narratives.\n\nFor the authors in (Renner and Giampietro 2020) the low carbon narrative of the European Commission is simultaneously heroic and reductionist. These authors deploy tools from relational biology and societal metabolism to identify physical infeasibilities, economic non-viability and – to conclude, dubious social desirability of what would be needed to equip Europe to deal with renewable intermittent energy sources reliant on wind and solar within a few decades. Based on data for Spain and Germany, this analysis identifies in the problem of energy storage, in the monetary costs, and in the greenhouse gas externalities associated with the creation and use of batteries the existing bottlenecks which prevent a plausible rapid way out of carbon by adoption of intermittent renewable sources – in contrast to the domination narrative and promises. These authors confirm the implausibility (for lack of natural resources) of a Lithium based storage system even at the level of a single country, and note how European leaders cannot simultaneously promise (a) to curtain CO2 emissions and (b) to scale-up the supply of intermittent sources of electricity (wind- and solar-based) to obtain a significant decarbonization of European economies within two or three decades, as the construction of the new infrastructure and storage will in all likelihood more than double the emission during the transition period. The concept that more renewable installed capacity will automatically lead to a new greener future – in the absence of a parallel societal change of institutional regimes and patterns of consumption, clashes against historical records that more renewable is weakly linked to reduction of conventional (fossil) energy production.\n\nAS: There can be little doubt that science has played a very active role in putting climate change at the top of the policy agenda on a planetary scale. Is this priority and urgency justified? Are we right in moving from concern to alarm? Should we panic as suggested by a passionate young activist (Greta Thunberg 2019)?\n\nPMB: Now, panic is never a good counsellor. However, Thunberg’s call for panic is understandable knowing that the main information was already available at the end of the seventies and that even Georges Bush (the father) was very close to take measures that would have helped avoiding any panic or hysteria today.\n\nWhat Nathaniel Rich demonstrates when he says that everything we understand about global warming was understood in 1979 is that we have been very close to a scientific AND political consensus already in the early eighties.\n\nThe problem is that despite all these treaties and repeated commitments, nothing significant has ever been done. No wonder the population stops believing in its leaders and politicians, no wonder young people get outraged by the casual attitude of these leaders towards the fundamental conditions of trust: that the words we use and the words we utter have meaning.\n\nAS: None of us can be an expert in this immense field. Comparing facts is undoubtedly useful, but here we are comparing how us, two different scientists, have come to assimilate their knowledge into an opinion about what should be done, in the hope that something we say may resonate with our readers – or ‘irritate’ them.\n\nComing back to the climate of emergency on climate – pun intended, why do I find it counterproductive? In intimating to be scared Greta Thunberg calls for what Hans Jonas called the hermeneutics of fear – the idea of fear as a paradoxically maximizing energy. Against this moral ‘maximalism of climate emergency’ an appeal to the classical virtues of prudence and phronesis appear in order. The French philosopher Pascal Bruckner shares this vision:\n\n“The idea that decarbonizing economies will be a long and tortuous process, and that an incremental ecological policy therefore makes more sense than thundering declarations, is totally unacceptable to the prophets of the coming Apocalypse. Whereas ecology demands policies that actually work, that take into account the human costs of transition, and that do nothing to harm the poorest among us, they prefer aggressive fanaticism.”\n\nPMB: Greta Thunberg and other whistle-blowers are just the tip of the iceberg.\n\nAS: I am sure that the comparison has been made by others between Greta and Joan of Arc. In both cases the appeal of these figures is extraordinary, and their moral stature is – in a sense, beyond criticism, surely above the non-edifying noise originating from the present contention. In both cases we see ‘sanctity’ of a sort at play.\n\n[B]oth Church and Science have promoted causes which in retrospect we have come to condemn. I stand by my opinion that science cannot prove that climate is more urgent than the Gaza strip, or an incumbent new war in the Gulf, or insectageddon, or too-big-to-fail banks, and I disapprove of those fellow scientists who seem engaged in trying to do precisely that.\n\nPMB: I agree with you on that. It is a thing science can’t prove. It is up to each of us, as citizens, with multiple diplomas or illiterate, to form an opinion based on the information available and our hierarchy of values. However, when you take care of, for instance, what happens in the Gaza strip you can benefit the population living there (but perhaps only a part of it); when you take care of climate change you benefit populations all over the world including of course the one living in the Gaza strip, and this whatever their standing in the conflict. Climate change, more than any other environmental global issue, gives us an opportunity, for the first time in history, to have all nations in the world united in a common endeavour, beyond all that opposes them besides, as is the case in the Gaza strip.\n\nWhat is the role of public intellectuals and politicians in this discussion?\n\nAS: There is no public figure which is not convinced that climate poses the most urgent threat to mankind, and the patent institutional failures to address the climate threat are presented as a symptom of the deterioration of our global political systems. Thus, the tones of the debate have escalated. For New York Times columnist Timothy Snyder (Snyder 2012) climate scepticism is a crime against humanity comparable to the Nazi exterminations of innocent children. Paul Krugman deplores the ‘depravity’ of climate deniers (Krugman 2018), while Vandana Shiva, Naomi Klein, Noam Chomsky and others intellectual sign an open letter calling for citizens to rise up and organise for the climate ‘emergency’.\n\nAs discussed in relation to green taxes on fuel, to use a form of taxation which hits the poor more than the rich to fix the environment appears to many protesters as the ultimate effrontery of the elites. This new phenomenon of protest – which appears to pit the aspirations of the have against the needs of the have-not, takes place after Brexit and the election of Donald Trump. All of these events have come as a surprise to the same elites, and new media have played a role in all, offering an example of the interplay between techno-science on the one hand and policy and society on the other (Saltelli and Boulanger 2019). In relation to climate, a majority of the progressive believe that a climate-dominated agenda, as the Green New Deal is the US, is the best strategy to fight populism and authoritarianism. Perhaps they could follow the pope in not ignoring “social justice”.\n\nPMB: The environmental issue is all through an ethical one. This means that social justice includes environmental justice. In this regard, the attractiveness of the idea of sustainable development as articulated in the Brundtland Report is to be rediscovered. In my opinion, except for the population issue, “Laudato Si” is the best articulation of the sustainable development ideal since the Brundtland Report.\n\nI don’t see where the Green New Deal of US democrats is oblivious of social justice. Personally, what I am more afraid of is the risk of a kind of a political climato-socialism oblivious of civil liberties. Now, you ask what is the role of the public intellectual? I think it is to do exactly what we are doing here: communicating open mindedly with one another, exchanging arguments and only arguments, not insults and without impugning motives, in order to help the people who hear or read us to make their mind in the most rational way. And then, let anybody act personally in accordance with his-her conscience and let the political democratic procedures and law decide what is to be done collectively.\n\nAS: Gro Harlem Brundtland, the UN Secretary-General’s Special Envoy on Climate Change, is rightly remembered for the words: “Doubt has been eliminated”. The words were uttered in 2007 at a speech before the United Nations. In a Greta-ante-litteram style, she went on to say “It is irresponsible, reckless and deeply immoral to question the seriousness of the situation.” This intimation put Brundtland in trouble with the Norwegian Research Ethics Committee for Science and Technology (NENT). The complaint argued that Brundtland had violated the principles of research ethics, in particular academic freedom, anti-dogmatism and organized skepticism. NENT blandly reminded Brundtland that what she said did not amount to ‘scientific language’ but it was considered that hers was a political – as opposed to scientific – speech, be it that she based her arguments on one of IPCC reports (AR4) and on the Stern review on the Economics of Climate Change.\n\nI recall this episode here as it is instructive of how public intellectuals mobilize science – and of what problematic vision of science in society, this role entails. As noted by Strand, a science-based life-philosophy cannot derive authority from science itself. Of course the sin of former prime minister of Norway – a politician after all, pale before the texts of the scientists / activists such as Naomi Klein (latest book: On Fire: The (Burning) Case for a Green New Deal) and Bill McKibben (latest work: Falter: Has the Human Game Begun to Play Itself Out?). I hope not to appear unreasonable insisting that, beyond the limits of the IPCC reporting, we have today a problem with science itself.\n\nWhat will a future historian say?\n\nAS: Take a future historian looking at the XXI century – plagued as it was by a rather normal mix of wars, social and environmental catastrophes, augmented by a rather aggressive season of technological disruptions. This historian might look with puzzlement at humans electing the greenhouse effect as the existential threat of the epoch. She will be studying mathematical models as her predecessors studied papyrus scrolls. To her, models will be read as confessions of an epoch’s unspoken metaphors and zeitgeist. She will be surprised by model-based cost benefit analysis of climate impact. Existential threats, after all, are not counted in monetary numeraires. Yet she knows that each epoch is paradoxical in its own specific way.\n\nPMB: What about a future historian (if it exists at all) looking with puzzlement at humans of the XXI century who whilst having all the information concerning the risks of climate change decided to let go because “the American (or European as well now, with our new EC) way of life is not negotiable”?\n\nAS: We are divided by the relative balance of what we resent; I resent Europeans marching against climate while Erdogan marches against Kurds. By the time this dialogue has been written, the signals of a shifting geopolitical landscape have multiplied, and I resent scientists’ role in forcing us to look elsewhere.\n\nI suspect that the climatic day of reckoning is an idol in the Baconian sense, whose function is to assuage anxieties about the present by projecting the threat into a convenient not-so-close-to-affect-me future. Instead of acting as nourishment for a deeper ecological sensitivity it boxes ecological problem into a single planetary container, where an odourless and colourless gas slowly increases the temperature of the planet. This idol risks subtracting energies from the fight against the messier aspects of our impact on the planet, let alone a disturbing social and geopolitical transient.\n\nScience is thus contributing to a hiatus which is likely to alienate from science a majority. This is regrettable, as science is our most valuable tool, and leaving it as the preserve of the elites, as predicted by the so-called techno-spit scenario , is dystopian. In this scenario one would be left with an affluent super-technological and possibly trans-human/immortal minority , and a useless, confused and distracted majority left glued to its mobile phones and tablets.\n\nBefore leaving the word to Paul-Marie for his final comment, I wish to report a personal episode which perhaps adds to the reason why a civilized dialogue as the present one is necessary. Recently la Repubblica, the second Italian daily newspaper by copies sold, attacked L’ Accademia dei Lincei (usually abridged to The Lincei, plural, ‘Those who see far’), arguably the most venerable Italian academy. The title of La Repubblica was ‘The Lincei organize a workshop on climate, and give the floor to denier Battaglia’ (my translation). Battaglia is an Italian professor faulted by La Repubblica for having attacked Greta. The article also noted that one of the organizers resigning in protest for this presence. The program of the event (I was one of the invitees) listed 14 talks and eight poster presentations. Only one talk, signed by eight authors, and entitled “Critical considerations regarding the anthropogenic global warming theory” included the aforementioned professor. A few days after the article, the academy cancelled the event, thus offering the opportunity to journals of different orientation, which accused The Lincei of censoring dissent. The intellectual suicide of The Lincei poses ethical problems and vindicates the existence of a science police, whereby “On highly charged issues, such as climate change and endangered species, peer review literature and public discourse are aggressively patrolled by self-appointed sheriffs in the scientific community” .\n\nPMB: In both camps, you will find excessive, irrational, even neurotic people and statements. For me, it doesn’t prove anything. It is never the ones who shout the louder who are right. These are just the skum of the wave, the tip of the iceberg. What matters is the wave, the hidden part of the iceberg. The question is not of the kind either-either, but of the kind and-and. As I tried to argue at the very first of our discussion, a complex world doesn’t need simplistic and one-sided views but combinations of long term and short term, society and nature’s oriented, perspectives.\n\nClimate change is only one of the many dimensions of the current socio-political-ecological crisis we are facing now, as part of a human species gone mad by hubris.\n\nThere are certainly lessons to be drawn from what happened with the climate issue, both for the scientific system and for the political one. I think the first should have refrained from mixing itself too closely with the second in the IPCC and kept its full autonomy. Conversely, the second should have endorsed the full responsibility of the collective treatment of the question without putting itself under the authority of science. We see this has been deleterious for both systems and therefore for society as a whole.\n\nJC remarks: keep your discussion and comments ‘pacated.’", "opengraph": {"type": "article", "title": "A climate of dialogue", "url": "https://judithcurry.com/2021/02/12/a-climate-of-dialogue/", "description": "by Judith Curry A pacated dialogue between two serious thinkers who disagree about climate change.", "article:published_time": "2021-02-12T16:41:53+00:00", "article:modified_time": "2021-02-12T16:41:53+00:00", "site_name": "Climate Etc.", "image": "https://s0.wp.com/i/blank.jpg", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.andreasaltelli.eu", "http://www.aedes.be/en/qui_est_qui/administrateurs/m.-paul-marie-boulanger.html", "https://judithcurry.com/wp-content/uploads/2021/02/dialogue.pdf", "https://thebreakthrough.org/energy", "mailto:?subject=%5BShared%20Post%5D%20A%20climate%20of%20dialogue&body=https%3A%2F%2Fjudithcurry.com%2F2021%2F02%2F12%2Fa-climate-of-dialogue%2F&share=email", "https://judithcurry.com/2021/02/12/a-climate-of-dialogue/?share=twitter", "https://judithcurry.com/2021/02/12/a-climate-of-dialogue/?share=facebook", "https://judithcurry.com/2021/02/12/a-climate-of-dialogue/#print", "https://judithcurry.com/2021/02/12/a-climate-of-dialogue/?share=reddit", "https://judithcurry.com/2021/02/12/a-climate-of-dialogue/?share=tumblr"], "authors": [], "publish_date": "2021-02-12T16:41:53+00:00"}