{"result_id": "071036", "URL": "https://judithcurry.com/2016/06/13/a-new-definition-of-academic-misconduct/", "timestamp": "2023-04-25 14:44:55 CEST+0200", "meta": {"description": "by Judith Curry Ridd was punished by James Cook University for “not displaying responsibility in respecting the reputations of other colleagues.” The university even warned that if he does this again, he’ll be tried for serious misconduct. The latest perversion in research ethics comes to us from James Cook University in Australia. The Australian has the…", "lang": "en", "keywords": "", "favicon": "https://s0.wp.com/i/webclip.png", "canonical": "https://judithcurry.com/2016/06/13/a-new-definition-of-academic-misconduct/", "encoding": "UTF-8"}, "image": null, "domain": "judithcurry.com", "title": "A new definition of academic misconduct", "cleaned_text": "Ridd was punished by James Cook University for “not displaying responsibility in respecting the reputations of other colleagues.” The university even warned that if he does this again, he’ll be tried for serious misconduct.\n\nThe latest perversion in research ethics comes to us from James Cook University in Australia. The Australian has the scoop, but it is behind paywall. Michael Bastasch of the Daily Caller has an article on this University Censures Science Prof For Fact-Checking Global Warming Claim. Excerpts:\n\nAn Australian university recently censured marine scientist Paul Ridd for “failing to act in a collegial way and in the academic spirit of the institution,” because he questioned popular claims among environmentalists about coral reefs and global warming.\n\nWhat was Ridd’s crime? He found out two of the world’s leading organizations studying coral reefs were using misleading photographs to make the case that global warming was causing a mass reef die-off. Ridd wasn’t rewarded for checking the facts and blowing the whistle on misleading science. Instead, James Cook University censured Ridd and threatened to fire him for questioning global warming orthodoxy.\n\nRidd’s not alone in criticizing some institutions and environmental groups for over-hyping the impacts global warming will have on coral reefs.\n\nIn fact, the Great Barrier Reef Marine Park Authority’s own chairman had to come out and dispel notions the reef was almost completely gone.\n\n“We’ve seen headlines stating that 93 percent of the reef is prac­tic­ally dead,” Reichelt said. “We’ve also seen reports that 35 percent, or even 50 percent, of the entire reef is now gone.”\n\n“However, based on our ­combined results so far, the overall mortality rate is 22 percent — and about 85 percent of that die-off has occurred in the far north between the tip of Cape York and just north of Lizard Island, 250 kilometers north of Cairns,” he said. “Seventy-five per cent of the reef will come out in a few months time as recovered.”\n\nThe group’s former chairman Ian McPhail even accused environmentalists of “exaggerating the impact of coral bleaching for political and financial gain.”\n\nDespite the campaign to tamp down on reef alarmism, Ridd was punished by James Cook University for “not displaying responsibility in respecting the reputations of other colleagues.” The university even warned that if he does this again, he’ll be tried for serious misconduct.\n\nI just love this statement: “not displaying responsibility in respecting the reputations of other colleagues.” Folks, we have a new definition of serious academic misconduct. Watch out, Michael Mann.\n\nIf this seems like a joke, it isn’t. I was ostracized from the ‘community’ for criticizing my colleagues overconfidence and failure to adequately account for uncertainty (see the infamous article Climate Heretic Judith Curry Turns on Her Colleagues). I thought that, in the midst of all the important issues at play in the climate debate, ‘turning on my colleagues’ was the least of them.\n\nIn my previous post Scientists and Motivated Reasoning, I identified a major ethical conflict for scientists between the microethics of your conscience in adhering to the norms of science, versus the macroethics of your perceived duty to the public, which may be colored by your politics and values.\n\nAlso included in the discussion of microethics versus macro ethics is responsibility to your colleagues. In my previous post, I wrote:\n\nI am particularly concerned about microethical conflicts involving colleagues and scientific institutions that apparently justify self-serving irresponsible professional behavior, both by individuals and institutions. This seems much worse to me than politically motivated reasoning by members of the public. Personally, I have felt the need to break loose of the shackles of loyalty to colleagues and institutions if it comes at the expense of integrity in science and professional conduct.\n\nWhy even bother with loyalty/responsibility to colleagues – beyond giving them credit for their research? Do I really have any responsibility to any and all scientists just because they are members of the same professional society? I would say no, but upon further reflection I can see a tiny point here – it isn’t just a joke.\n\nThe importance of ‘collegiality’ among elite academic researchers seems to be perceived as more important than I have credited. In Michael Polanyi’s Republic of Science, the self-coordination of scientists is of paramount importance.\n\nGoing back to my previous discussion on microethics versus macroethics, I wrote:\n\nAs a researcher, what kinds of responsibilities do you have to\n\nMy previous post illustrated numerous ethical conflicts that can arise for researchers. But when it comes to conflicts between your conscience and your colleagues, or the public and your colleagues, any perceived responsibility to your colleagues has to take a back seat.\n\nBut it seems that in academic science, responsibility to your colleagues and their opinions, their declarations of consensus, their reputations, is apparently regarded by many researchers as the paramount consideration, viz. the circling of the wagons that occurred in Climategate.\n\nThis concern about ‘responsibility’ to your colleagues seems only to extend to colleagues who happen to agree with you.\n\nIn Science on the Verge, and in postnormal science more generally, the importance of extended peer review is emphasized, which is very much needed to break down the clubby, exclusionary academic collegiality that is used as a club to marginalize dissenting voices.\n\nThe sickness of the clubby academic collegiality is absurdly highlighted by this latest episode from James Cook University.", "opengraph": {"type": "article", "title": "A new definition of academic misconduct", "url": "https://judithcurry.com/2016/06/13/a-new-definition-of-academic-misconduct/", "description": "by Judith Curry Ridd was punished by James Cook University for “not displaying responsibility in respecting the reputations of other colleagues.” The university even warned that if he does this aga…", "article:published_time": "2016-06-14T00:23:09+00:00", "article:modified_time": "2016-06-14T00:23:09+00:00", "site_name": "Climate Etc.", "image": "https://s0.wp.com/i/blank.jpg", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["http://dailycaller.com/2016/06/13/university-censures-science-prof-for-fact-checking-global-warming-claim/", "http://www.scientificamerican.com/article/climate-heretic/", "https://judithcurry.com/2013/08/20/scientists-and-motivated-reasoning/", "https://judithcurry.com/2016/05/30/the-republic-of-science/", "https://judithcurry.com/2016/06/09/science-on-the-verge/", "mailto:?subject=%5BShared%20Post%5D%20A%20new%20definition%20of%20academic%20misconduct&body=https%3A%2F%2Fjudithcurry.com%2F2016%2F06%2F13%2Fa-new-definition-of-academic-misconduct%2F&share=email", "https://judithcurry.com/2016/06/13/a-new-definition-of-academic-misconduct/?share=twitter", "https://judithcurry.com/2016/06/13/a-new-definition-of-academic-misconduct/?share=facebook", "https://judithcurry.com/2016/06/13/a-new-definition-of-academic-misconduct/#print", "https://judithcurry.com/2016/06/13/a-new-definition-of-academic-misconduct/?share=reddit", "https://judithcurry.com/2016/06/13/a-new-definition-of-academic-misconduct/?share=tumblr"], "authors": [], "publish_date": "2016-06-14T00:23:09+00:00"}