{"result_id": "071026", "URL": "https://judithcurry.com/2013/01/05/peak-farmland/", "timestamp": "2023-04-25 14:44:44 CEST+0200", "meta": {"description": "by Judith Curry We are confident that we stand on the peak of cropland use, gazing at a wide expanse of land that will be spared for Nature. - Ausubel, Werner and Waggoner Matt Ridley on Peak Farmland Matt Ridley has a post entitled Peak Farmland is Here, which discusses the recent publication Peak Farmland and…", "lang": "en", "keywords": "", "favicon": "https://s0.wp.com/i/webclip.png", "canonical": "https://judithcurry.com/2013/01/05/peak-farmland/", "encoding": "UTF-8"}, "image": null, "domain": "judithcurry.com", "title": "Peak (?) farmland", "cleaned_text": "We are confident that we stand on the peak of cropland use, gazing at a wide expanse of land that will be spared for Nature. – Ausubel, Werner and Waggoner\n\nMatt Ridley has a post entitled Peak Farmland is Here, which discusses the recent publication Peak Farmland and the Prospect for Land Sparing. Excerpts:\n\nJesse Ausubel and Iddo Wernick of Rockefeller University, and Paul Waggoner of the Connecticut Agricultural Experiment Station, have reached this conclusion by documenting the gradual “dematerialization” of agriculture. Globally, the production of a given quantity of crop requires 65% less land than it did in 1961, thanks to fertilizers, tractors, pesticides, better varieties and other factors. Even corrected for different kinds of crops, the acreage required is falling at 2% a year.\n\nIn the U.S., the total corn yield and the total corn acreage tracked each other in lock step between 1870 and 1940-there was no change in average yield per acre. But between 1940 and 2010, corn production almost quintupled, while the acreage devoted to growing corn fell slightly. Similar divergences appeared later in other countries. Indian wheat production increased fivefold after 1970, while wheat acreage crept up by less than 1.5 times. Chinese corn production rose sevenfold over the same period while corn acreage merely doubled.\n\nYet the amount of farmland in the world was still rising until recently. The reason is that increased farm productivity has been matched by rising demand for food, driven by population growth and swelling affluence. But the effects of these trends are waning.\n\nGlobal population growth has slowed markedly in recent years-the rate of change halving since 1970 to about 1% a year today. Growing affluence leads people to eat more calories, and especially more meat. Since it takes two to 10 calories of maize or wheat to produce a calorie of meat, depending on the animal, carnivory demands more cropland. But as a country gets richer, total calorie intake soon levels off, even as wealth continues to rise, and the change in meat consumption decelerates. Chinese meat consumption is now rising less than half as fast as Chinese affluence; Indians have grown richer without taking to meat much at all.\n\nWhat the Rockefeller team did was plug some highly conservative assumptions about the future into a model and see how much land would be required for growing crops in 2060. The researchers find that over the next 50 years people are likely to release from farming a land area “1½ times the size of Egypt, 2½ times the size of France, or 10 Iowas, and possibly multiples of this amount.”\n\nIndeed, the authors find that this retreat from the land would have already begun but for one factor so lunatic that they cannot imagine it will not be reversed soon: biofuels. If the world had not decided to subsidize the growing of energy crops on 3.4% of arable land, then absolute declines in the acreage of arable land “would have begun during the last decade.”\n\nMark Lynas has posted his recent lecture at the Oxford Farming Conference. Read the whole thing, it is stunning. Excerpts:\n\nI want to start with some apologies. For the record, here and upfront, I apologise for having spent several years ripping up GM crops. I am also sorry that I helped to start the anti-GM movement back in the mid 1990s, and that I thereby assisted in demonising an important technological option which can be used to benefit the environment.\n\nAs an environmentalist, and someone who believes that everyone in this world has a right to a healthy and nutritious diet of their choosing, I could not have chosen a more counter-productive path. I now regret it completely.\n\nSo I guess you’ll be wondering – what happened between 1995 and now that made me not only change my mind but come here and admit it? Well, the answer is fairly simple: I discovered science, and in the process I hope I became a better environmentalist.\n\nWhen I first heard about Monsanto’s GM soya I knew exactly what I thought. Here was a big American corporation with a nasty track record, putting something new and experimental into our food without telling us. Mixing genes between species seemed to be about as unnatural as you can get – here was humankind acquiring too much technological power; something was bound to go horribly wrong. These genes would spread like some kind of living pollution. It was the stuff of nightmares.\n\nThese fears spread like wildfire, and within a few years GM was essentially banned in Europe, and our worries were exported by NGOs like Greenpeace and Friends of the Earth to Africa, India and the rest of Asia, where GM is still banned today. This was the most successful campaign I have ever been involved with.\n\nThis was also explicitly an anti-science movement. We employed a lot of imagery about scientists in their labs cackling demonically as they tinkered with the very building blocks of life. Hence the Frankenstein food tag – this absolutely was about deep-seated fears of scientific powers being used secretly for unnatural ends. What we didn’t realise at the time was that the real Frankenstein’s monster was not GM technology, but our reaction against it.\n\nSo I did some reading. And I discovered that one by one my cherished beliefs about GM turned out to be little more than green urban myths.\n\nI’d assumed that it would increase the use of chemicals. It turned out that pest-resistant cotton and maize needed less insecticide.\n\nI’d assumed that GM benefited only the big companies. It turned out that billions of dollars of benefits were accruing to farmers needing fewer inputs.\n\nI’d assumed that Terminator Technology was robbing farmers of the right to save seed. It turned out that hybrids did that long ago, and that Terminator never happened.\n\nI’d assumed that no-one wanted GM. Actually what happened was that Bt cotton was pirated into India and roundup ready soya into Brazil because farmers were so eager to use them.\n\nI’d assumed that GM was dangerous. It turned out that it was safer and more precise than conventional breeding using mutagenesis for example; GM just moves a couple of genes, whereas conventional breeding mucks about with the entire genome in a trial and error way.\n\nBut what about mixing genes between unrelated species? The fish and the tomato? Turns out viruses do that all the time, as do plants and insects and even us – it’s called gene flow.\n\nBut at the same time the growth of yields worldwide has stagnated for many major food crops, as research published only last month by Jonathan Foley and others in the journalNature Communications showed. If we don’t get yield growth back on track we are indeed going to have trouble keeping up with population growth and resulting demand, and prices will rise as well as more land being converted from nature to agriculture.\n\nThe biggest risk of all is that we do not take advantage of all sorts of opportunities for innovation because of what is in reality little more than blind prejudice.\n\nI don’t know about you, but I’ve had enough. So my conclusion here today is very clear: the GM debate is over. It is finished. We no longer need to discuss whether or not it is safe – over a decade and a half with three trillion GM meals eaten there has never been a single substantiated case of harm. You are more likely to get hit by an asteroid than to get hurt by GM food. More to the point, people have died from choosing organic, but no-one has died from eating GM.\n\nJust as I did 10 years ago, Greenpeace and the Soil Association claim to be guided by consensus science, as on climate change. Yet on GM there is a rock-solid scientific consensus, backed by the American Association for the Advancement of Science, the Royal Society, health institutes and national science academies around the world. Yet this inconvenient truth is ignored because it conflicts with their ideology.\n\nI know it is politically incorrect to say all this, but we need a a major dose of both international myth-busting and de-regulation. The plant scientists I know hold their heads in their hands when I talk about this with them because governments and so many people have got their sense of risk so utterly wrong, and are foreclosing a vitally necessary technology.\n\nSo I challenge all of you today to question your beliefs in this area and to see whether they stand up to rational examination. Always ask for evidence, as the campaigning group Sense About Science advises, and make sure you go beyond the self-referential reports of campaigning NGOs.\n\nBut most important of all, farmers should be free to choose what kind of technologies they want to adopt. If you think the old ways are the best, that’s fine. You have that right.\n\nWhat you don’t have the right to do is to stand in the way of others who hope and strive for ways of doing things differently, and hopefully better. Farmers who understand the pressures of a growing population and a warming world. Who understand that yields per hectare are the most important environmental metric. And who understand that technology never stops developing, and that even the fridge and the humble potato were new and scary once.\n\nSo my message to the anti-GM lobby, from the ranks of the British aristocrats and celebrity chefs to the US foodies to the peasant groups of India is this. You are entitled to your views. But you must know by now that they are not supported by science. We are coming to a crunch point, and for the sake of both people and the planet, now is the time for you to get out of the way and let the rest of us get on with feeding the world sustainably.\n\nKeith Kloor has an article at Collide-a-Scape that includes this quote from Mark Lynas:\n\nWell, life is nothing if not a learning process. As you get older you tend to realize just how complicated the world is and how simplistic solutions don’t really work… There was no “Road to Damascus” conversion, where there’s a sudden blinding flash and you go, “Oh, my God, I’ve got this wrong.” There are processes of gradually opening one’s mind and beginning to take seriously alternative viewpoints, and then looking more closely at the weight of the evidence.\n\nWow, what a great statement. Mark Lynas was the hero of previous Climate Etc. posts An opening Mind, Part II.\n\nJC comments: What with peak farmland and GM foods, hopefully there will be sufficient food to support all that obesity that is going around. (JC removes tongue from cheek)\n\nOf the ‘big three’: food, water and energy, it seems like our understanding of the future of food is on a firmer basis. Biofuel and GM are the policy wild cards here.\n\nIf you haven’t read it yet, read Mark Lynas’ essay. If you’ve already read it, read it again. It raises many important points regarding environmentalism, and his personal saga through all this is very enlightening, not to mention courageous.", "opengraph": {"type": "article", "title": "Peak (?) farmland", "url": "https://judithcurry.com/2013/01/05/peak-farmland/", "description": "by Judith Curry We are confident that we stand on the peak of cropland use, gazing at a wide expanse of land that will be spared for Nature. – Ausubel, Werner and Waggoner", "article:published_time": "2013-01-06T02:25:01+00:00", "article:modified_time": "2013-01-06T02:25:01+00:00", "site_name": "Climate Etc.", "image": "https://s0.wp.com/i/blank.jpg", "locale": "en_US"}, "tags": ["http://foodfarmfork.authorsxpress.com/tag/honey-bee-colony-collapse-disorder/"], "tweets": [], "movies": [], "links": ["http://www.rationaloptimist.com/blog/peak-farmland-is-here.aspx", "http://phe.rockefeller.edu/docs/PDR.SUPP%20Final%20Paper.pdf", "http://www.marklynas.org/2013/01/lecture-to-oxford-farming-conference-3-january-2013/", "http://blogs.discovermagazine.com/collideascape/2013/01/03/the-anti-science-tent/#.UOYhQo7A-ZY", "http://judithcurry.com/2011/06/15/an-opening-mind/", "http://judithcurry.com/2011/06/17/an-opening-mind-part-ii/", "http://judithcurry.com/2013/01/04/is-fat-good/", "mailto:?subject=%5BShared%20Post%5D%20Peak%20%28%3F%29%20farmland%20&body=https%3A%2F%2Fjudithcurry.com%2F2013%2F01%2F05%2Fpeak-farmland%2F&share=email", "https://judithcurry.com/2013/01/05/peak-farmland/?share=twitter", "https://judithcurry.com/2013/01/05/peak-farmland/?share=facebook", "https://judithcurry.com/2013/01/05/peak-farmland/#print", "https://judithcurry.com/2013/01/05/peak-farmland/?share=reddit", "https://judithcurry.com/2013/01/05/peak-farmland/?share=tumblr"], "authors": [], "publish_date": "2013-01-06T02:25:01+00:00"}