{"result_id": "071023", "URL": "https://judithcurry.com/2011/01/15/learning-to-love-uncertainty/", "timestamp": "2023-04-25 14:44:39 CEST+0200", "meta": {"description": "by Judith Curry I am returning to the topic of uncertainty (my article for Climate Change on this topic is overdue).  I just spotted this article (h/t Bishop Hill): We must learn to love uncertainty and failure, say leading thinkers Planet's biggest brains answer this year's Edge question: 'What scientific concept would improve everybody's cognitive…", "lang": "en", "keywords": "", "favicon": "https://s0.wp.com/i/webclip.png", "canonical": "https://judithcurry.com/2011/01/15/learning-to-love-uncertainty/", "encoding": "UTF-8"}, "image": null, "domain": "judithcurry.com", "title": "Learning to love uncertainty", "cleaned_text": "I am returning to the topic of uncertainty (my article for Climate Change on this topic is overdue). I just spotted this article (h/t Bishop Hill):\n\nWe must learn to love uncertainty and failure, say leading thinkers Planet’s biggest brains answer this year’s Edge question: ‘What scientific concept would improve everybody’s cognitive toolkit?’\n\nBeing comfortable with uncertainty, knowing the limits of what science can tell us, and understanding the worth of failure are all valuable tools that would improve people’s lives, according to some of the world’s leading thinkers.\n\nThe ideas were submitted as part of an annual exercise by the web magazine Edge, which invites scientists, philosophers and artists to opine on a major question of the moment. This year it was, “What scientific concept would improve everybody’s cognitive toolkit?”\n\nMany responses pointed out that the public often misunderstands the scientific process and the nature of scientific doubt. This can fuel public rows over the significance of disagreements between scientists about controversial issues such as climate change and vaccine safety.\n\nCarlo Rovelli, a physicist at the University of Aix-Marseille, emphasised the uselessness of certainty. He said that the idea of something being “scientifically proven” was practically an oxymoron and that the very foundation of science is to keep the door open to doubt.\n\n“A good scientist is never ‘certain’. Lack of certainty is precisely what makes conclusions more reliable than the conclusions of those who are certain: because the good scientist will be ready to shift to a different point of view if better elements of evidence, or novel arguments emerge. Therefore certainty is not only something of no use, but is in fact damaging, if we value reliability.”\n\nThe physicist Lawrence Krauss of Arizona State University agreed. “In the public parlance, uncertainty is a bad thing, implying a lack of rigour and predictability. The fact that global warming estimates are uncertain, for example, has been used by many to argue against any action at the present time,” he said.\n\n“In fact, however, uncertainty is a central component of what makes science successful. Being able to quantify uncertainty, and incorporate it into models, is what makes science quantitative, rather than qualitative. Indeed, no number, no measurement, no observable in science is exact. Quoting numbers without attaching an uncertainty to them implies they have, in essence, no meaning.”\n\nNeil Gershenfeld, director of the Massachusetts Institute of Technology’s Centre for Bits and Atoms wants everyone to know that “truth” is just a model. “The most common misunderstanding about science is that scientists seek and find truth. They don’t – they make and test models,” he said.\n\n“Building models is very different from proclaiming truths. It’s a never-ending process of discovery and refinement, not a war to win or destination to reach. Uncertainty is intrinsic to the process of finding out what you don’t know, not a weakness to avoid. Bugs are features – violations of expectations are opportunities to refine them. And decisions are made by evaluating what works better, not by invoking received wisdom.”", "opengraph": {"type": "article", "title": "Learning to love uncertainty", "url": "https://judithcurry.com/2011/01/15/learning-to-love-uncertainty/", "description": "by Judith Curry I am returning to the topic of uncertainty (my article for Climate Change on this topic is overdue).  I just spotted this article (h/t Bishop Hill): We must learn to love uncertaint…", "article:published_time": "2011-01-15T18:27:54+00:00", "article:modified_time": "2011-01-16T01:08:27+00:00", "site_name": "Climate Etc.", "image": "https://s0.wp.com/i/blank.jpg", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["http://edge.org/", "http://www.cpt.univ-mrs.fr/~rovelli/", "http://krauss.faculty.asu.edu/", "http://ng.cba.mit.edu/"], "authors": [], "publish_date": "2011-01-15T18:27:54+00:00"}