{"result_id": "071009", "URL": "https://judithcurry.com/2022/12/29/the-yin-and-yang-of-climate-science/", "timestamp": "2023-04-25 14:44:20 CEST+0200", "meta": {"description": "by Judith Curry How the duality of yin-yang can illuminate the climate debate and enlighten transformational research. Ok, this is something different,  I hope you will find it interesting. A little known JC fact is that my main hobby is Tai Chi.  I am very fortunate to be studying under Master Reza Nejad, an exceptionally…", "lang": "en", "keywords": "", "favicon": "https://s0.wp.com/i/webclip.png", "canonical": "https://judithcurry.com/2022/12/29/the-yin-and-yang-of-climate-science/", "encoding": "UTF-8"}, "image": null, "domain": "judithcurry.com", "title": "The yin and yang of climate science", "cleaned_text": "How the duality of yin-yang can illuminate the climate debate and enlighten transformational research.\n\nOk, this is something different, I hope you will find it interesting.\n\nA little known JC fact is that my main hobby is Tai Chi. I am very fortunate to be studying under Master Reza Nejad, an exceptionally accomplished martial artist currently living in Reno, NV. He is also the “Bruce Lee of Iran” [link; scroll down the page for cinema clips]\n\nMaster Nejad recommended me to the organizers of the 2022 International Taiji Science Forum. The organizers invited me to give a talk, which rather astonished me. I was getting ready to politely decline the invitation, when the wheels started turning in my head and I came up with an interesting idea for a talk.\n\nI decided to use the yin-yang framework as the basis for a philosophy of science talk.\n\nYou are probably generally familiar with the concept of yin and yang. Yin and yang is a complex relational concept in Chinese philosophy and culture that has developed over thousands of years. The meaning of yin and yang is that the universe is governed by a cosmic duality – sets of two opposing and complementing principles or cosmic energies that can be observed in nature.\n\nYin and yang elements come in pairs—moon and the sun, female and male, dark and bright, cold and hot, passive and active, etc. While the world is composed of many different and sometimes opposing forces, these can coexist and even complement each other. The nature of yin-yang lies in the interchange and interplay of the two components.\n\nThe yin-yang symbol consists of a circle divided into two halves by a curved line. One half of the circle is black, representing the yin side; the other is white, for the yang side. The two halves are intertwining across a spiral-like curve that splits the whole into semicircles, and the small dots represent the idea that both sides carry the seed of the other. The curvy line signifies that there are no absolute separations between the two opposites. The yin-yang symbol embodies both sides: duality, paradox, unity in diversity, change, and harmony.\n\nMy full presentation can be downloaded [taiji science curry], ppt with audio (19 minutes).\n\nBelow is the relevant text, along with illustrative diagrams.\n\nWith this context, I focus my talk on how the duality of yin-yang can illuminate the climate debate and enlighten transformational scientific research.\n\nIn the west, the concept of yin-yang has been interpreted, applied and appropriated in many different ways. My interpretation here focuses on applications of the essential duality implied by yin-yang. I propose that this duality can enrich our thinking on how to approach the process of science and creativity, towards fostering transformational research.\n\nAt the most fundamental level of scientific research, the duality of binary modes of thinking reflects the essential yin-yang tension. These two modes of thinking have been described from the perspectives of economics, psychology and physics. The idea of two modes of thinking has been most famously portrayed in Daniel Kahnemann’s book Thinking Fast and Slow. System 1 is the fast, automatic multitasking mode that we usually operate in, such as when walking, chatting, looking around. By contrast, System 2 is a more deliberate and focused mode of mindful intent.\n\nYou might think that System 2 thinking is the most important mode for scientific research. However, Guy Claxton’s most important insight in Hair Brain, Tortoise Mind is that the leisurely tortoise mind, for all its apparent aimlessness, is just as intelligent as the more logical hare brain.\n\nBut how can the aimless tortoise brain contribute to scientific research? Tim Palmer’s book The Primacy of Doubt provides some insights. Specifically, on the importance of the stochasticity of System 1 thinking in generating new ideas.\n\nPalmer provides an energy-based interpretation of thinking, whereby System 2 is the high-power, intensive mode. By contrast, System 1 is a lower power mode where power is spread between many active tasks, so that power per active task is especially low.\n\nIn low power mode, the brain is susceptible to noise. Palmer argues that this noise can be a source of random new ideas. This can explain why ‘eureka’ moments, or flashes of insight, often occur when we are relaxing and not concentrating hard on a problem. In this relaxation mode, the presence of noise can help us jump out of a cognitive roadblock and advance our understanding.\n\nThe ‘monkey mind in Tai Chi represents brain chatter that jumps around and darts from one distraction to the other. One objective of Tai Chi and Qigong movements are to bring the brain back to mindfulness (‘repulse the monkey’) . Palmer’s framework suggests that there is a role for the monkey in helping generate the noise that can be the source of random new ideas. So, we don’t want to entirely repulse the monkey, but manage the monkey while nourishing the tortoise.\n\nSo to achieve the most transformative oneness from our binary brain, the idea is to make constructive use of noise in the low-power mode. This can provide new ideas, which our more analytic, power-intensive mode is failing to provide.\n\nWith regards to the actual scientific process, there are many fundamental dualities, which I have presumed to categorize in terms of yin and yang. The major dualities include\n\nMy own scientific education, many decades ago, was focused on the attributes that I have listed on the Yin side. Over time, my research has migrated in the directions that are characterized by the Yang side. These two opposing and complementary approaches, when appropriately integrated, can produce transformational research.\n\nIn addressing a specific scientific problem, frames shape how we conceptualize it. Framing includes what is deemed to be relevant, what is excluded, and even what answers are considered appropriate.\n\nA framing bias occurs when a narrow frame pre-ordains the conclusion to a much more complex problem. On the other hand, if we frame a simple problem too broadly, finding a solution can be much more difficult.\n\nSome problems are tame, in the sense that the appropriate boundaries are clear. This includes problems of engineering and laboratory science for which reductionism, order and control are the appropriate guiding principles. However, tame problems are not necessarily simple ones. Tame problems can be complicated, with many different parts that are causally linked.\n\nComplex problems are different from those that are merely complicated. In the presence of feedbacks and circularity, causal mechanisms are not easily elucidated. Problems related to the environment, such as climate change, and most problems related to human health are complex problems. Complex problems require a much larger frame to accommodate uncertainty, ambiguity, chaos, and contradictions. Any framing of a complex problem is provisional, requiring acknowledgement of what is outside the frame and its potential importance.\n\nThis slide shows two different framings of climate change. On the left, the climate change problem is framed as being caused by excess carbon dioxide in the atmosphere, which can be solved by eliminating fossil fuel emissions. Both the problem and solution are included in a single frame. This framing dominates the UN negotiations on climate change, most recently at the Conference of the Parties in Egypt.\n\nThe framing on the right shows two separate frames, one associated with the causes of climate change and the other associated with solutions that can help reduce vulnerability to climate change. The larger frame on the right also includes natural causes for climate change such as the sun, volcanoes and slow circulations in the ocean. This framing is provisional, acknowledging that our understanding is incomplete and that there may be unknown processes influencing climate change.\n\nThe frame on the left is about controlling the climate, whereas the frame on the right is about understanding the climate. Further, the framing on the right acknowledges the futility of control. Solutions on the right focus on the basic human necessities of energy, water and food. Economic development supports these necessities while reducing our vulnerability to weather and climate extremes.\n\nMy own understanding of climate change and human well being is squarely in the framing on the right.\n\nThe duality here lies in science versus policy, and these two framings reflect very different visions for how science and policy interact.\n\nUsing the framework of normal and postnormal science, the pandemic provides insights into how we understand and conduct science, particularly when it is relevant for urgent policy making.\n\nNormal science is conducted by elite scientists, and ruled by consensus over the problems, concepts and model solutions that together form a paradigm. There have been some great successes for normal science during the pandemic. These include rapid identification of viral structures and pathological mechanisms, and rapid development of vaccines and antiviral drugs.\n\nThe epidemiology of the pandemic provided far greater challenges. Early in the pandemic, scientists, at least in the west, spoke with one voice and great authority. They claimed that 2 to 3 out of every 100 infected people will die, the virus spread by droplets and surfaces, there was no immunity after infection, and all ages were equally at risk. These claims guided early covid policy in the U.S. However, these claims did not survive further scientific scrutiny and turned out to be wrong. Many of these early policies backfired in tragic ways, particularly for the elderly and children.\n\nSo what went wrong? The scientists failed to acknowledge uncertainty and ignorance. An elite group of scientists manufactured a consensus in an attempt to assert authority with the objective of controlling the virus. Attempts to squash disagreement and cancel scientists who disagreed delayed resolution of these mistaken claims and perpetuated these early bad policies.\n\nThe pandemic is clearly an issue for which facts are uncertain, values are in dispute, stakes are high & decisions are urgent, which characterizes post-normal science. Post-normal science doesn’t seek to control, but rather to manage, in a way that seeks robustness in policy strategies. In postnormal science, management of uncertainty and evaluating knowledge quality are paramount. Postnormal science seeks to diversify the knowledge base beyond elite scientists. This occurs in context of an extended peer community that enables broader scientific and public contributions, understanding and acceptance.\n\nWicked problems are challenges that share some commonality with postnormal science, but there are key differences. Wicked problems are characterized by structural complexity, irreducible uncertainties and ignorance. There are multiple problem definitions and contentious methods of understanding. Clashing values are in play, and people don’t even agree on the attributes of desirable solutions. There are unintended consequences associated with all proposed solutions.\n\nBoth climate change and pandemics are wicked problems.\n\nThe wickedness of wicked problems is related to the duality of science and politics. There are two common but inappropriate ways of mixing science and politics.\n\nThe first is scientizing policy, which deals with intractable political conflict by transforming the political issues into scientific ones. The problem is that science is not designed to answer questions about how the world ought to be, which is the domain of politics. The second is politicization of science, whereby scientific research is influenced or manipulated in support of a political agenda. We have seen both of these inappropriate ways of mixing science and politics in dealing with the pandemic and also climate change.\n\nThere’s a third way, which is known as wicked science. Wicked science is tailored to the dual scientific and political natures of wicked societal problems. Wicked science uses approaches from complexity science and systems thinking in a context that engages with decision makers and other stakeholders.\n\nWicked science requires a transdisciplinary approach that treats uncertainty as of paramount importance. Effective use of wicked science requires that policy makers acknowledge that control is limited and the future is unknown. Effective politics provides room for dissent and disagreement about policy options, and includes a broad range of stakeholders.\n\nAs an example of wicked science, I put forward my forthcoming book Climate Uncertainty and Risk. This book encompasses my own philosophy for navigating wicked problems, and provides a slice through the wicked terrain of climate change. The book is massively transdisciplinary, including perspectives from science, technology, politics, policy, philosophy, social psychology, uncertainty and risk. Accomplishing the book’s objectives in 250 pages required careful framing.\n\nThe main point of this slide is to describe the duality of my binary brain in grappling with the research, framing and writing about this wicked problem. For each topic I started in yin mode with a provisional outline. I then switched to yang mode where for each topic I read many articles and books and took copious notes. Of central importance was noise generation that was driven by imaginative internet searching, which helped generate ideas that took me in new directions.\n\nFor a given subsection, I might spend several weeks in this noise generation mode, with sporadic excursions into yin mode where I would slowly winnow down my notes and move things around to create linkages between ideas. At some point the connections in my head would produce a mental model and a substantially revised outline. I would then return to Yin mode, where the writing proceeded quickly. I often felt frustrated that I was spending so much time googling around and generating noise, but upon reflection I realized that this was an essential feature of my thinking process in context of this wicked problem.\n\n30 years ago, I wouldn’t have been able to write this book, without near-instantaneous access to diverse resources online that are enabled by the internet. The internet is a great enabler for the practice of wicked science.\n\nThese approaches to thinking about science are relevant for Taiji and health sciences, which is the focus of this Forum.\n\nThere are several dualities here. The most important one is the duality between the eastern and western approaches to medicine, with the western approach being reductionist and the eastern approach being more of a whole body approach.\n\nAnother duality is basic versus clinical research. There is also the duality of curative versus preventative approaches. The red arrows indicate feedbacks between health science and the practice of Taiji.\n\nParticipating in this Forum was an interesting cultural experience, it had quite a CCP flavor. The Conference was very formal and very deferential to governmental and institutional authorities. Most of the presentations were in Chinese, with English subtitles. I find the objective of the Forum, to integrate eastern and western ways of thinking (particularly in context of Taiji-health) to be interesting and worthwhile.\n\nIn any event, this Forum provided me with an opportunity to think in some new frameworks. The slide above labelled “Climate” illustrates better than anything else I’ve written regarding the difference between the IPCC/UNFCCC (yin) approach and my own interpretation which has a much larger frame (yang approach).", "opengraph": {"type": "article", "title": "The yin and yang of climate science", "url": "https://judithcurry.com/2022/12/29/the-yin-and-yang-of-climate-science/", "description": "by Judith Curry How the duality of yin-yang can illuminate the climate debate and enlighten transformational research.", "article:published_time": "2022-12-29T16:07:49+00:00", "article:modified_time": "2022-12-29T16:15:47+00:00", "site_name": "Climate Etc.", "image": "https://judithcurry.com/wp-content/uploads/2022/12/Screen-Shot-2022-12-27-at-3.11.08-PM.png", "image:width": "2348", "image:height": "1262", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["https://masternejad.com", "https://masternejad.com/gallery/", "https://wtjsf.org/events/", "https://judithcurry.com/wp-content/uploads/2022/12/taiji-science-curry.pptx", "https://www.amazon.com/Thinking-Fast-Slow-Daniel-Kahneman-ebook/dp/B00555X8OA/ref=sr_1_1?crid=2KL9W32AVJ4HR&keywords=daniel+kahneman%2C+thinking+fast+and+slow+2011&qid=1672172183&sprefix=daniel+kahne%2Caps%2C174&sr=8-1", "https://www.amazon.com/Hare-Brain-Tortoise-Mind-Intelligence/dp/0060955414/ref=sr_1_1?crid=2V2EAGG6V7U6P&keywords=guy+claxton+hare+brain&qid=1672172231&sprefix=guy+claxton+hare+brain%2Caps%2C217&sr=8-1", "https://judithcurry.com/2022/10/18/the-primacy-of-doubt/", "https://judithcurry.com/2022/09/06/climate-scientists-politics-simpleton-versus-wicked-scientists/", "https://anthempress.com/climate-uncertainty-and-risk-hb", "https://i0.wp.com/judithcurry.com/wp-content/uploads/2022/12/Screen-Shot-2022-12-27-at-2.56.17-PM.png?ssl=1", "mailto:?subject=%5BShared%20Post%5D%20The%20yin%20and%20yang%20of%20climate%20science&body=https%3A%2F%2Fjudithcurry.com%2F2022%2F12%2F29%2Fthe-yin-and-yang-of-climate-science%2F&share=email", "https://judithcurry.com/2022/12/29/the-yin-and-yang-of-climate-science/?share=twitter", "https://judithcurry.com/2022/12/29/the-yin-and-yang-of-climate-science/?share=facebook", "https://judithcurry.com/2022/12/29/the-yin-and-yang-of-climate-science/#print", "https://judithcurry.com/2022/12/29/the-yin-and-yang-of-climate-science/?share=reddit", "https://judithcurry.com/2022/12/29/the-yin-and-yang-of-climate-science/?share=tumblr"], "authors": [], "publish_date": "2022-12-29T16:07:49+00:00"}