{"result_id": "071035", "URL": "https://judithcurry.com/2022/01/25/managing-personal-covid-risk/", "timestamp": "2023-04-25 14:44:53 CEST+0200", "meta": {"description": "by Javier My perspectives on managing personal Covid risk, based upon my knowledge of microbiology, genetics, immunology, cancer, and neurobiology. 1. My credentials I started my scientific career doing research on a virus in the early 80s. It was an interesting bacteriophage called phi29. A paper published in 1986 included my work with that virus.…", "lang": "en", "keywords": "", "favicon": "https://s0.wp.com/i/webclip.png", "canonical": "https://judithcurry.com/2022/01/25/managing-personal-covid-risk/", "encoding": "UTF-8"}, "image": null, "domain": "judithcurry.com", "title": "Managing personal Covid risk", "cleaned_text": "My perspectives on managing personal Covid risk, based upon my knowledge of microbiology, genetics, immunology, cancer, and neurobiology.\n\nI started my scientific career doing research on a virus in the early 80s. It was an interesting bacteriophage called phi29. A paper published in 1986 included my work with that virus. Afterwards I obtained my PhD in Biochemistry and Molecular Biology and proceeded to acquire, over the next few decades, a good knowledge of microbiology, genetics, immunology, cancer, and neurobiology, by conducting research on those subjects in three countries.\n\nIt was with that knowledge that I raised the alert about a new epidemic likely to become a pandemic on January, 31st 2020 with an article in my blog in Spanish: “Scenarios and consequences of the Wuhan coronavirus pandemic“\n\nIt describes three possible scenarios, and how to protect oneself from the pandemic, a full month before most governments did anything about it. In the end, the result was somewhat between the intermediate and worst-case scenarios I considered. If you are curious about it, you can translate it. Many of my readers thought I was being very alarmist. Had I been in charge, or chief advisor to those in charge, I would have handled the pandemic very differently, perhaps saving tens of thousands of lives in my country and reducing economic damage. We talk a lot about being resilient, yet at the first serious test in decades we have demonstrated a lot more fragility than we expected.\n\nOn February, 25th 2020, a full two weeks before my government did anything about the coming pandemic, and before the virus was discovered in my country (it was already here), I published my final warning: “Coronavirus scenario 2: Enemy at the gates“\n\nIn it (translate it if you wish) I warned that the virus was airborne (aerosols), a full 5 months before my government recognized it, and 14 months before the WHO did it. I also said that eradication of the disease was already nearly impossible, so the disease was likely to become endemic. Something that was been recognized by my country in January 2021.\n\nOn April, 20th 2020, before the issue became widely discussed by the media, I analyzed the evidence that pointed to an accidental release from the Wuhan Institute of Virology: “Possible release of the coronavirus from a Chinese laboratory“\n\nThat was my opinion at the time when it was improper to say so, and it is my opinion today.\n\nThose are my credentials. I saw it coming. I knew what was going to happen. I understood the nature of the disease. I could do very little except warn my readers, family, and friends. There have been no COVID casualties among those close to me and I like to think that listening to me helped them keep safe. I watched in horror as the pandemic developed like a slow-moving train wreck. We will be suffering the social and economic consequences for years.\n\n2. The nature of the disease\n\nThere are two types of immunity: innate immunity and acquired (adaptive) immunity. When we face a new infective disease that is unrelated to any disease or vaccine we’ve had before, only innate immunity can help us. Innate immunity is strong in very young children and virtually non-existent in very old people as it decays with age and immunosenescence. That takes us to the nature of the problem.\n\nSARS-CoV-2 is not the cause of COVID. The cause of COVID is an improper reaction of the immune system to SARS-CoV-2 infection. This is demonstrated by the huge amount of asymptomatic infected people, and by the chronic infection without deleterious effect of immunosuppressed people. See for example: “Long-Term Evolution of SARS-CoV-2 in an Immunocompromised Patient with Non-Hodgkin Lymphoma,” for a patient infected for over 6 months.\n\nIt is not the virus what will put you in hospital, but the inability of your immune system to properly handle the infection. The improper reaction to the infection is due to it being a new disease, so it must be dealt with by innate immunity. The body can support a huge viral load without developing symptoms. This is known from the existence of asymptomatic super-spreaders. However, lack of proper innate immunity reaction might result in strong inflammatory and cytokine responses that can kill the patient. That’s why COVID patients in hospital are treated with corticosteroids that are immunosuppressants, besides being anti-inflammatory.\n\nOmicron is about 10 times less dangerous than previous variants because it is a predominantly upper respiratory tract resident, less likely to trigger a strong improper immune reaction. In exchange, there are less asymptomatic people, as most infected ones develop cold-like symptoms. This is the first wave that we can get with an acceptable level of risk. But that is a personal decision.\n\nRegarding the nature of the disease, I’ve had to confront three successive myths about respiratory viruses. Early on was the idea that the arrival of the warm season would help with the disease by preventing summer waves. Although it is not exactly known why some viruses display strong seasonality, it seems to be a combination of environmental factors, human behavior, and temporary herd immunity locked to the annual cycle. For a largely naive population there was nothing that could prevent a summer wave, and so I said in May 2020 before it took place during that summer in Spain, to the dismay of our tourism industry. It might take a few years for SARS-CoV-2 to develop flu-like seasonality. The strong Christmas Omicron wave in Europe is a step in that direction.\n\nAnother myth was herd immunity. I never bought into the idea that this applied to a rapidly mutating RNA virus. Additionally, the experience with the other four human coronaviruses is that people can get infected every year. The viruses don’t induce long-lasting immunity. I couldn’t understand how entire countries developed their strategy around that faulty concept. In my country it was clearly another government lie to convince people to get the vaccine, because this is well known by experts. My government said the problem would be over if we reached 60% vaccination. No “expert” dared to contradict them in public. We passed 80% vaccination rate and then had the biggest wave in the pandemic.\n\nThe third myth is that viruses evolve to cause less damage to the host. Anybody that has read the excellent and prophetic 2014 book “Spillover” by David Quammen (highly recommended) knows that viruses don’t care about their food’s well-being:\n\n“The first rule of a successful parasite … [is not] ‘Don’t kill your host.’ It’s: ‘Don’t burn your bridges until after you’ve crossed them.’”\n\nHIV has been with us for over 60 years, and it is still almost 100% lethal, because the untreated average survival time is 11 years, providing the virus ample opportunities to cross its bridges. Nothing guarantees that future SARS-CoV-2 variants will be less harmful. That said, the likely evolution of SARS-CoV-2 is towards causing less damage because to outcompete other variants the logical path is to migrate to the upper respiratory tract, as Omicron has done, to become more contagious. Upper respiratory tract infections are generally less dangerous than lower respiratory tract infections.\n\nI was fully vaccinated with Pfizer in June 2021, my strategy was to have my vitamin D levels way up and catch Omicron through a relaxation of preventive measures in the midst of a strong wave in Spain during Christmas. I could not get it on purpose because I don’t live alone and this is not a decision that can be taken for other people, as there are significant risks involved. But if you let youngsters do what they want to do, they will bring it home. I developed my first symptoms on January 5. I was taking vitamin A, C, and D, and I started taking Polaramine (antihistamine) to reduce my immune response. As I said, the main problem is the immune system, not the virus. I was also doing throat washes with Listerine and diluted hydrogen peroxide every few hours to reduce viral load near its center of action. The lower the viral load the lower the risk. Despite that, when the infection was receding, I had elevated blood pressure for a few days, together with fatigue. I think the high blood pressure was due to a decrease in blood oxygen levels, but I didn’t have it checked since the national health system was under a lot of stress and I know how to reduce my blood pressure through intermittent fasting and exercise. My symptoms completely disappeared in two weeks and I am now completely recovered and naturally immunized.\n\nUnder no circumstances is this to be construed as a recommendation to voluntarily get COVID. It is a dangerous disease. Every responsible adult should manage their health risk as any other aspect of their life. This is discussed in section 5 below. And it is very important that if you get COVID you make sure you are a dead-end to the virus by not infecting anybody, through following the recommended quarantine instructions from your health authorities.\n\nTo me the COVID story has ended. I will keep my vitamin D levels high between equinoxes and the winter solstice and will not get any more shots regardless of what the “experts” and governments or the WHO might say.\n\nThe RNA vaccines have a level of risk that would be unacceptable under different circumstances. They have a significant toxicity level. The lipid nanoparticle platform they use is highly inflammatory, which could be related to the vaccine side-effects, but necessary for its immune action. People that die from the vaccine can go very fast. A close friend of mine is a pharmacist, and he had a 35-year-old person come to his pharmacy the same day of his vaccination feeling very bad, he was dead the next day. Some of the deaths have been linked to thrombocytopenia, low blood platelet count. In most cases post-vaccine deaths affect elderly frail people often with co-morbidities. The chief pathologist at Heidelberg University, Peter Schirmacher, urged more autopsies of recently vaccinated people that died and was severely criticized for such a reasonable suggestion. Clearly the authorities want to underplay vaccination risks.\n\nThe reported number of deaths from the vaccine is very low, about 8 per million, much lower than the number of deaths from COVID, and even much lower than background deaths. Nevertheless, the small risk of dying is not the only risk from the new vaccines.\n\nI don’t like the RNA nature of these vaccines. The number of modified-RNA containing lipid nanoparticles in a single shot is huge, in the same order of magnitude as the number of cells in our body. Instead of being delivered to the mucosa, like the virus, they are unevenly distributed throughout the body by the lymphatic and circulatory systems (the liver appears to be a preferred target), where they get into the wrong cells and mark them for destruction by cytotoxic T-lymphocytes. The issue of improper COVID vaccine tissue tropism and its safety concerns is rarely raised. I feared from the beginning that over time quite a lot of people might develop autoimmune diseases from it, and it is already happening: “New-onset autoimmune phenomena post-COVID-19 vaccination.”\n\nGetting an autoimmune disease from the vaccine is for life and much worse than COVID for most people. One might develop an autoimmune disease from the vaccine years after getting the shot. Every additional shot increases the risk. There is a false sense of security in people going for additional vaccine immunizations.\n\nIt makes no sense to vaccinate children (with some exceptions) because it doesn’t help them and it doesn’t help society. The risk of developing future effects is unacceptable at that age. Repeated vaccinations with RNA vaccines are likely to have more negative than positive effects. Old people might need annual shots to manage their much higher risk. Hopefully better, safer vaccines will be developed in the future.\n\nRisk management is the process of identification and assessment of risks, and development of strategies to reduce and manage the identified risks. The strategies to manage risk include avoiding the risk, reducing its negative effect, and accepting some or all its consequences. Risk aversion might not be the optimal strategy if it incurs a large cost of opportunity. Being a responsible adult means accepting the responsibility for managing life risks. Transferring that responsibility to a government or organization might not be a good way of managing some risks.\n\nIn the case of COVID, risk management indicates the best strategy for any adult is to get vaccinated to have some acquired immunity when they get the disease. The risk from the vaccine is thousands of times lower than the risk from infection for anybody older than 45. Only stupid old people face the infection without having been vaccinated with the two shots. Some acquired immunity from the vaccine is much better than none. A true life and death difference for many.\n\nUnless one is prepared to live like a hermit we must all accept that sooner or later we will be infected by SARS-CoV-2, the same way we all get colds and the flu. Very old and frail people, and people with serious pre-conditions might want to delay that moment as much as possible and keep vaccinating every winter if they perceive than their risk from COVID must be avoided at all cost.\n\nFor the rest, particularly for people younger than 65 without pre-conditions there are a lot of options to manage COVID risk:\n\nA) Before you get it\n\n– Keep your vitamin D levels high at all times. It is a very important regulator of the immune system. Sunbathing for a limited time 3-4 times a week is the best way. Take supplements and/or get it in the diet when you cannot go outside frequently.\n\n– Lead a healthy lifestyle. Reduce your weight, exercise regularly, eat a healthy diet, and get enough sleep. Sleep deprivation wrecks the immune system, as does undernutrition.\n\n– Consider resetting your immune system through 2-3 days of fasting once or twice a year, but do not get infected while fasting. Many useless immune cells get cleared during deep fasting sharpening our immune response afterwards.\n\n– Choose when to get infected. Maximal effect from a vaccine shot is obtained 2-3 weeks after, and then it starts decaying and in only two months it is very much reduced. Some parents used to get their kids exposed to chickenpox to make sure they were protected by the mild form of the disease during childhood.\n\nB) Once you get it\n\nIf you develop symptoms and suspect you’ve got COVID, or test positive, there are many things you can do to reduce your risk.\n\n– Take plenty of vitamin D, C, and A, and drink plenty of liquids. Zinc and selenium supplements are also helpful.\n\n– Wash your throat (gargles) with an antiseptic every few hours to reduce viral load. A 1-1.5% hydrogen peroxide solution also works well since it attacks proteins in the viral membrane.\n\n– Take Polaramine (2 mg twice a day) or some other antihistamine to reduce the risk of an improper immune response. Read the prospect to see if you can take it safely or follow your doctor’s advice.\n\nThere are several other recommendations that you might follow, but these are no-regrets measures that should not cause you any harm.\n\nAs I said above, this is not a recommendation to voluntarily get COVID. It is a serious disease with potentially lethal consequences. Everybody will have to manage their own risk. How your immune system has behaved in the past gives you an important clue. People that tend to pass infectious respiratory diseases with little problem have much better chances. Mine is just average. Of the four people at home that got infected, my case was the worst. But I did not require any medical treatment.\n\nTake responsibility for your own health and stop looking up at your government for directions. Your government is not your friend. It never has been, it never will be.\n\nThe help of Andy May in correcting this article’s English language is gratefully acknowledged.", "opengraph": {"type": "article", "title": "Managing personal Covid risk", "url": "https://judithcurry.com/2022/01/25/managing-personal-covid-risk/", "description": "by Javier My perspectives on managing personal Covid risk, based upon my knowledge of microbiology, genetics, immunology, cancer, and neurobiology.", "article:published_time": "2022-01-25T22:44:49+00:00", "article:modified_time": "2022-01-25T22:44:49+00:00", "site_name": "Climate Etc.", "image": "https://s0.wp.com/i/blank.jpg", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.rankia.com/blog/game-over/4468398-escenarios-consecuencias-pandemia-coronavirus-wuhan", "https://www.rankia.com/blog/game-over/4494417-coronavirus-escenario-2-enemigo-puertas", "https://www.forbes.com/sites/jvchamary/2021/05/04/who-coronavirus-airborne/", "https://www.rankia.com/blog/game-over/4579028-posible-liberacion-coronavirus-laboratorio-chino", "https://pubmed.ncbi.nlm.nih.gov/34319130/", "https://www.dailymail.co.uk/news/article-10412465/UK-cases-continue-plunge-Plan-B-curbs-soon-lifted-says-light-end-tunnel.html", "https://davidquammen.com/spillover", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8604799/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8328816/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8160119/", "https://www.augsburger-allgemeine.de/panorama/Corona-Chef-Pathologe-der-Uni-Heidelberg-draengt-auf-mehr-Obduktionen-von-Geimpften-id60235361.html", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8160119/", "https://journals.lww.com/jcma/Fulltext/2021/09000/Does_COVID_19_vaccination_cause_excess_deaths_.2.aspx", "https://www.bmj.com/content/371/bmj.m4037/rr-19", "https://onlinelibrary.wiley.com/doi/10.1111/imm.13443", "https://i0.wp.com/judithcurry.com/wp-content/uploads/2022/01/Fig-Corona.png?ssl=1", "mailto:?subject=%5BShared%20Post%5D%20Managing%20personal%20Covid%20risk&body=https%3A%2F%2Fjudithcurry.com%2F2022%2F01%2F25%2Fmanaging-personal-covid-risk%2F&share=email", "https://judithcurry.com/2022/01/25/managing-personal-covid-risk/?share=twitter", "https://judithcurry.com/2022/01/25/managing-personal-covid-risk/?share=facebook", "https://judithcurry.com/2022/01/25/managing-personal-covid-risk/#print", "https://judithcurry.com/2022/01/25/managing-personal-covid-risk/?share=reddit", "https://judithcurry.com/2022/01/25/managing-personal-covid-risk/?share=tumblr"], "authors": [], "publish_date": "2022-01-25T22:44:49+00:00"}