{"result_id": "071002", "URL": "https://judithcurry.com/2021/05/23/collapse-of-the-fake-consensus-on-covid-19-origins/", "timestamp": "2023-04-25 14:44:04 CEST+0200", "meta": {"description": "by Judith Curry The concerning saga of the creation, enforcement and collapse of a 'consensus' on Covid-19 origins. The Covid-19 virus first appeared in Wuhan, China, where there is a laboratory that conducts research on bat coronaviruses. However from the beginning, the possibility that this virus accidentally escaped from the lab was dismissed quite forcefully…", "lang": "en", "keywords": "", "favicon": "https://s0.wp.com/i/webclip.png", "canonical": "https://judithcurry.com/2021/05/23/collapse-of-the-fake-consensus-on-covid-19-origins/", "encoding": "UTF-8"}, "image": null, "domain": "judithcurry.com", "title": "Collapse of the fake consensus on Covid-19 origins", "cleaned_text": "The concerning saga of the creation, enforcement and collapse of a ‘consensus’ on Covid-19 origins.\n\nThe Covid-19 virus first appeared in Wuhan, China, where there is a laboratory that conducts research on bat coronaviruses. However from the beginning, the possibility that this virus accidentally escaped from the lab was dismissed quite forcefully by prominent virologists.\n\nThe ‘consensus’ that Covid-19 had an entirely natural origin was established by two op-eds in early 2020 – The Lancet in February and Nature Medicine in March. The Lancet op-ed stated, “We stand together to strongly condemn conspiracy theories suggesting that Covid-19 does not have a natural origin.”\n\nIn May 2021, science reporter Nicholas Wade published a lengthy article in the Bulletin of Atomic Scientists stating that the Lancet letter had been organized and drafted by Peter Daszak, president of the EcoHealth Alliance of New York. Daszak’s organization funded coronavirus research at the Wuhan Institute of Virology. If the Covid-19 virus had escaped from research that he funded, Daszak would be potentially culpable. Daszak had corralled other scientists with similar professional interests into making a declaration to the effect that anyone who mentions the obvious possibility that the pandemic might have a connection to the research in the Wuhan Lab could only be doing so with bad intentions.\n\nThe enormous gap between the actual state of knowledge in early 2020 and the confidence displayed in the two op-eds should have been obvious to anyone in the field of virology, or for that matter anyone with critical faculties. There were scientists from adjacent fields who said as much.\n\nHowever, the pronouncements in these op-eds effectively shut down inquiry. The pre-emptive declaration of scientific consensus was highly successful in garnering media enforcement of public opinion. The so-called ‘fact checkers’ of PolitiFact used these op-eds to shut down any discussion of the lab leak hypothesis. Articles in the mainstream press repeatedly stated that a consensus of experts had ruled lab escape out of the question or extremely unlikely.\n\nInvocation of ‘conspiracy theory’ has become a reflex for arresting criticism. Analysis by Matthew Crawford shows how the political environment caused the magic words ‘conspiracy theory’ to trigger a wider epistemic immune reaction in high-prestige opinion. Crawford provides the following political frame for these events. Since Donald Trump publicly floated the idea that Covid-19 may have had its origin in a Chinese lab, it became a point of conviction for all those who believe in science that such a hypothesis could only be a conspiracy theory, probably rooted in ‘Sinophobia’. The ‘conspiracy theory’ of the lab leak hypothesis has been juxtaposed with reporting on anti-Asian hate crimes, thereby subsuming an urgent scientific question to a Trump-era morality play.\n\nPublication of Nicholas Wade’s story on May 2 triggered a cascade of defections. Crawford describes the defections as “not simply from a consensus that no longer holds, but from a fake consensus that is no longer enforceable.” On 14 May, 18 scientists signed a letter in the journal Science with the title “Investigate the origins of COVID-19”. In an interview with the New York Times, an organizer of the letter stated, “Anybody who’s making statements with a high level of certainty about this is just outstripping what’s possible to do with the available evidence.”\n\nPolitifact has just withdrawn its Wuhan-Lab theory ‘fact check.’ [link]\n\nWhat is concerning about this episode is not so much that a consensus has been overturned, but that a fake consensus was so easily enforced for year. This occurred during a key period when understanding the origins of the virus had implications for how it could best be fought. Scientists who understood that there was a great deal of uncertainty surrounding the origins of the virus did not speak up. Probity came from knowledgeable individuals that were outside of the field of virology.\n\nMatthew Crawford states, ” Regardless of how the question of the virus’s origins is ultimately decided, we need to understand how the political drama surrounding the science played out if we are to learn anything from this pandemic and reduce the likelihood of future ones.”\n\nCrawford argues that the scientists who were signatories to the two letters may have been acting as a classic research cartel.\n\nIn 2004, Henry Bauer formulated the idea of research cartels and knowledge monopolies, in context of the institutionalization of science that becomes subordinate to corporate or government values.\n\nA key element of knowledge monopolies and research cartels is stifling of skepticism, premature canonization of preferred hypotheses and consensus enforcement, in the interests of financial or political objectives. With the help of uncritical mass media, this effectively results in near censorship of minority views. Since corporate and government scientific organizations also control the funding of research, by denying funds for unorthodox work they function as research cartels as well as knowledge monopolies.\n\nWade notes that in today’s universities, challenging the consensus can be very costly. Careers can be destroyed for stepping out of line. Any virologist who challenges the community’s declared view risks having his next grant application turned down by the panel of fellow virologists that advises the government grant distribution agency.\n\nThe IPCC and the ‘climate-industrial-government complex’ is a clear example of a knowledge monopoly and research cartel.\n\nHowever, I don’t think that the fake consensus surrounding the Covid-19 origins reflects a research cartel. What I see is a group of scientists appealing to their own authority in protecting their personal interests. The question is why The Lancet and Nature Medicine published these op-eds. It is noted that Daszak had an obvious conflict of interest re the op-ed, but this conflict was not stated. Apparently there are no adverse consequences for not accurately stating your conflicts of interest in journal publications.\n\nDaszak et al. presumably have some influence over which research gets funded, and this may have prevented other virologists with less influence from speaking out. However, the fact that these op-eds successfully defined a ‘consensus’ for a year has more to do with Trump derangement syndrome and the desire not to appear Sinophobic. The media is arguably the most culpable for a complete absence of vigorously investigative science journalism, prior to Wade’s article. Note that Wade’s article was published in the Bulletin of the Atomic Scientists, and as far as I can tell has not been picked up by major media outlets.\n\nWhat does all this mean for institutionalized climate science? Well the IPCC, along with supporting governments and industries, is much more entrenched as a knowledge monopoly and research cartel. But the Covid origins example illuminates the social, political and careerist motivations that are in play in attempts to prematurely canonize and enforce a scientific consensus.\n\nIn closing, a recent essay by Mike Hulme is insightful.\n\nClimategate was a controversy because it appeared that climate scientists were undermining the idea of a ‘well-ordered science’, or what Naomi Oreskes has written about as ‘the conditions necessary to reach a fair and open consensus’. We can discuss the extent to which this ‘appearance’ was real or manufactured, but my point is this: Climategate became a crisis because so much was being staked – by both ends of the political spectrum – on science providing the direction and justification for political action (or inaction). It was a crisis because of the undermining of the probity of the science upon which, it was believed or at least claimed, all sensible climate policy depended. Most notably, this included the prominent environmental commentator George Monbiot.\n\nClimate skepticism has broader roots than this. Mistrust in science is always bound up with other things – politics, culture, ethics, the law. Skepticism often arises from observing how science and expert judgement is being mobilized in debates that are essential political – in other words, climate sceptics are suspicious about how the different interests and values of public actors concerning climate change are being resolved.\n\nSkepticism therefore points to the problem of legitimation; it is the problem of how science – how experts – relate, or are perceived to relate, to democracy. The problem is one of when and how to “open up” public debate and when and how to “close it down”, to use Andy Stirling’s metaphor. And this requires us to recognize that how one ‘closes down’ depends on political culture: Russia, China, USA and Germany all do it very differently.\n\nTo stand in here, I use the case of climate scientist Michael Mann and his militarist vocabulary. The German theorist Carl von Clausewitz characterized war as “an act of violence intended to compel our opponent to fulfil our will.” This is not a good way to think about climate politics in a democracy. In wars there are winners and losers. Sides are taken and the solution is conquering and defeating the enemy.\n\nAs John Besley at Michigan State University asks, “Do we want people to see scientists as angry, embattled, frustrated people … or rather people who are doing [their] best to solve problems to make the world better?” The danger with the combative climate militancy espoused by Mann is that it ends up being a destructive form of advocacy.", "opengraph": {"type": "article", "title": "Collapse of the fake consensus on Covid-19 origins", "url": "https://judithcurry.com/2021/05/23/collapse-of-the-fake-consensus-on-covid-19-origins/", "description": "by Judith Curry The concerning saga of the creation, enforcement and collapse of a ‘consensus’ on Covid-19 origins.", "article:published_time": "2021-05-23T18:30:53+00:00", "article:modified_time": "2021-05-23T18:30:53+00:00", "site_name": "Climate Etc.", "image": "https://s0.wp.com/i/blank.jpg", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.thelancet.com/journals/lancet/article/PIIS0140-6736%2820%2930418-9/fulltext", "https://www.nature.com/articles/s41591-020-0820-9", "https://unherd.com/2021/05/how-scientists-sacrificed-scepticism/", "https://unherd.com/2021/05/how-scientists-sacrificed-scepticism/", "https://science.sciencemag.org/content/372/6543/694.1", "https://www.washingtonexaminer.com/opinion/politifact-retracts-wuhan-lab-theory-fact-check", "https://www.researchgate.net/publication/252797131_Science_in_the_21st_Century_Knowledge_Monopolies_and_Research_Cartels", "http://sawyerseminar.americanassembly.org/blog/communicating-climate-science-three-strategies-mistakes", "https://press.princeton.edu/books/hardcover/9780691179001/why-trust-science", "https://journals.sagepub.com/doi/10.1177/0162243907311265", "https://www.nature.com/articles/nclimate1459", "https://cen.acs.org/policy/global-health/Will-public-trust-in-science-survive-the-pandemic/99/i3", "mailto:?subject=%5BShared%20Post%5D%20Collapse%20of%20the%20fake%20consensus%20on%20Covid-19%20origins&body=https%3A%2F%2Fjudithcurry.com%2F2021%2F05%2F23%2Fcollapse-of-the-fake-consensus-on-covid-19-origins%2F&share=email", "https://judithcurry.com/2021/05/23/collapse-of-the-fake-consensus-on-covid-19-origins/?share=twitter", "https://judithcurry.com/2021/05/23/collapse-of-the-fake-consensus-on-covid-19-origins/?share=facebook", "https://judithcurry.com/2021/05/23/collapse-of-the-fake-consensus-on-covid-19-origins/#print", "https://judithcurry.com/2021/05/23/collapse-of-the-fake-consensus-on-covid-19-origins/?share=reddit", "https://judithcurry.com/2021/05/23/collapse-of-the-fake-consensus-on-covid-19-origins/?share=tumblr"], "authors": [], "publish_date": "2021-05-23T18:30:53+00:00"}