{"result_id": "071030", "URL": "https://judithcurry.com/2020/09/10/covid-19-evidence-shows-that-transmission-by-schoolchildren-is-low/", "timestamp": "2023-04-25 14:44:47 CEST+0200", "meta": {"description": "By Nic Lewis Much fuss has been made in the UK, not least by teachers' unions, about recommencing physical school attendance. As this issue applies to many countries, I thought it worth highlighting research findings in Europe. While it is evident that school age children can be infected by the SARS-CoV-2 virus, it is extremely…", "lang": "en", "keywords": "", "favicon": "https://s0.wp.com/i/webclip.png", "canonical": "https://judithcurry.com/2020/09/10/covid-19-evidence-shows-that-transmission-by-schoolchildren-is-low/", "encoding": "UTF-8"}, "image": null, "domain": "judithcurry.com", "title": "COVID-19: evidence shows that transmission by schoolchildren is low", "cleaned_text": "Much fuss has been made in the UK, not least by teachers’ unions, about recommencing physical school attendance. As this issue applies to many countries, I thought it worth highlighting research findings in Europe.\n\nWhile it is evident that school age children can be infected by the SARS-CoV-2 virus, it is extremely rare for them to become seriously ill with COVID-19, and their risk of dying as a result of infection is almost zero. The relevant issue is therefore how much children’s contribution to the spread of COVID-19 to adults, by themselves or via other children, is affected by school attendance.\n\nA report last month “COVID-19 in children and the role of school settings in COVID-19 transmission” by the European Centre for Disease Prevention and Control analyses evidence from many countries and throws light on these questions. Some key summary conclusions that it reaches on various important issues are as follows:\n\nOverview of outbreaks and transmission in childcare school settings: experiences from Member States[i]\n\nOverview of outbreaks and transmission in school settings: evidence from the literature\n\nWhat is the evidence of transmission between children within the school setting?\n\nWhat is the evidence of transmission from children (students) to adults (teacher/staff) within the school setting?\n\nWhat is the evidence of transmission from adults (teacher/staff) to children (students) within the school setting?\n\nWhat is the evidence of transmission between adults (teacher/staff) within the school setting?\n\nWhat is the effect of school openings on transmission to the community/household?\n\nThere was one outbreak in Israel after school reopening, however the sequence of infection was not reported. Although Ireland closed schools relatively early in the epidemic, data there suggests that schools would be a minor source of infection for children:\n\nEvidence from EU/EEA countries that kept pre- and primary schools/day care open or reopened schools early on\n\nThe ECDC report includes the following information:\n\nIceland kept both childcare institutions and primary schools open throughout the spring term and the rates of SARS-CoV-2 in children under 15 years old remained low compared to rates in the older age groups. Physical distancing rules did not apply to childcare institutions and primary school children.\n\nSimilarly, the Netherlands did not see a sudden increase in their reproductive number or detect significant outbreaks, when primary schools and childcare facilities opened on 11 May, with moderately high notification rates at national level. Children up to and including 12 years did not have to keep 1.5 metres apart from each other or from adults, and this measure was applied in childcare and primary education settings. Children aged 13 to 18 years did not have to physically distance from one another.\n\nDenmark reopened childcare and primary education on 15 April, with moderately high overall notification rates at national level, and did not report any increase in the reproductive number, or detect important school outbreaks. Denmark recommended splitting classes into smaller groups, keeping two metres between children, hand hygiene, and teaching more classes outside.\n\nAs in other areas, some of the most useful evidence involves Sweden, which never closed schools for children under 16. In July its Public Health Authority published a report (English version here) comparing COVID-19 in children between Sweden and Finland, where almost all physical school attendance was stopped from mid-March to mid-May. Key findings in the study are:\n\nOutbreak investigations in Finland have not shown children to be contributing much in terms of transmission:\n\nImpacts of school closures on the health and well-being of children\n\nThe ECDC report also highlights some negative impacts of school closures on the health and well-being of children, on top of the harm to their education, saying:\n\nA number of organisations have identified various negative impacts on children’s wellbeing, learning opportunities and safety caused by school closures. These range from the interruption of learning and the exacerbation of disparities and mental health issues to an increased risk of domestic violence. The negative impacts particularly affect children from vulnerable and marginalised population groups. Other health aspects, both physical and mental, also need consideration. For many students living in poverty, schools are not only a place for learning, but also for healthy eating, and therefore researchers warn that school closures will exacerbate food insecurity. Research has highlighted that the active social life that children aged 2–10 years have at school helps them to learn from peers and has a positive impact on their personality and sense of identity, while disruptions of close peer relationships have been associated with depression, guilt, and anger in children. Furthermore, school and extracurricular activities provide structure, meaning and a daily rhythm for children and youth. For those suffering from anxiety and depression, the loss of such activities can worsen symptoms and reinforce social withdrawal and feelings of hopelessness.\n\nThe evidence shows that concerns about recommencing physical school attendance are misplaced, at least if moderate social distancing measures (not requiring mask wearing, and only for child-adult contact) are mandated.\n\nIt also seems pretty clear that the original decisions by almost all European countries to close schools were, in retrospect, ill-judged measures that caused more harm than good, at least in relation to children under 16 years old.\n\n[i] Based on a survey of EU/EEA and UK countries, 15 of which responded.\n\n[ii] In Sweden, the number of laboratory confirmed cases is affected by change in testing policy.\n\n[iii] The relative risk of teachers catching COVID-19, compared to that in other professions, was 0.9 for day care, 1.1 for primary school (in neither case being statistically significant), and 0.7 for secondary school (just significantly lower than 1).\n\nOriginally posted here, where a pdf copy is also available", "opengraph": {"type": "article", "title": "COVID-19: evidence shows that transmission by schoolchildren is low", "url": "https://judithcurry.com/2020/09/10/covid-19-evidence-shows-that-transmission-by-schoolchildren-is-low/", "description": "By Nic Lewis Much fuss has been made in the UK, not least by teachers’ unions, about recommencing physical school attendance. As this issue applies to many countries, I thought it worth highl…", "article:published_time": "2020-09-10T07:35:42+00:00", "article:modified_time": "2020-09-10T07:37:25+00:00", "site_name": "Climate Etc.", "image": "https://s0.wp.com/i/blank.jpg", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.ecdc.europa.eu/sites/default/files/documents/COVID-19-schools-transmission-August%202020.pdf", "#_edn1", "https://www.folkhalsomyndigheten.se/contentassets/c1b78bffbfde4a7899eb0d8ffdb57b09/covid-19-school-aged-children.pdf", "#_edn2", "#_edn3", "#_ednref1", "#_ednref1", "#_ednref2", "#_ednref3", "https://www.nicholaslewis.org/covid-19-evidence-shows-that-transmission-by-schoolchildren-is-low/", "mailto:?subject=%5BShared%20Post%5D%20COVID-19%3A%20evidence%20shows%20that%20transmission%20by%20schoolchildren%20is%20low&body=https%3A%2F%2Fjudithcurry.com%2F2020%2F09%2F10%2Fcovid-19-evidence-shows-that-transmission-by-schoolchildren-is-low%2F&share=email", "https://judithcurry.com/2020/09/10/covid-19-evidence-shows-that-transmission-by-schoolchildren-is-low/?share=twitter", "https://judithcurry.com/2020/09/10/covid-19-evidence-shows-that-transmission-by-schoolchildren-is-low/?share=facebook", "https://judithcurry.com/2020/09/10/covid-19-evidence-shows-that-transmission-by-schoolchildren-is-low/#print", "https://judithcurry.com/2020/09/10/covid-19-evidence-shows-that-transmission-by-schoolchildren-is-low/?share=reddit", "https://judithcurry.com/2020/09/10/covid-19-evidence-shows-that-transmission-by-schoolchildren-is-low/?share=tumblr"], "authors": [], "publish_date": "2020-09-10T07:35:42+00:00"}