{"result_id": "071020", "URL": "https://judithcurry.com/2011/09/24/whos-anti-science/", "timestamp": "2023-04-25 14:44:33 CEST+0200", "meta": {"description": "by Judith Curry A blogospheric debate has erupted this weekend over who is more anti-science: the political right, or the left. Alex Berezow starts it off in a post at USA Today entitled \"GOP might be anti-science, but so are Democrats.\"  Some excerpts: Is Perry anti-science? And, more generally, is the Republican Party anti-science?  Yes. But so…", "lang": "en", "keywords": "", "favicon": "https://s0.wp.com/i/webclip.png", "canonical": "https://judithcurry.com/2011/09/24/whos-anti-science/", "encoding": "UTF-8"}, "image": null, "domain": "judithcurry.com", "title": "Who’s anti-science?", "cleaned_text": "A blogospheric debate has erupted this weekend over who is more anti-science: the political right, or the left.\n\nAlex Berezow starts it off in a post at USA Today entitled “GOP might be anti-science, but so are Democrats.” Some excerpts:\n\nIs Perry anti-science? And, more generally, is the Republican Party anti-science? Yes. But so are the Democrats.\n\nEach campaign season, the same three hot-button science issues are tossed around like political footballs: evolution, global warming and embryonic stem cells. On these three issues, criticism of Republicans is fair.\n\nSo Democrats might have a point if those three issues were all there was to science. Unfortunately for Democrats, their progressive political allies often hold blatantly anti-science beliefs themselves. And in some cases, progressives actively undermine technological progress.\n\nFederal health data suggest that anti-vaccine sentiment is more common in progressive areas.\n\nProgressives are also often against genetically modified food, despite its known benefits and widespread support among agricultural scientists and molecular biologists.\n\nWe can also thank progressives for blocking the construction of nuclear power plants, even though nuclear power is supported by 70% of the scientific community. Ironically, they oppose this technology despite the fact it would help reduce carbon emissions and limit the impact of global warming.\n\nIn short, for every anti-science Republican that exists, there is at least one anti-science Democrat. Neither party has a monopoly on scientific illiteracy. Indeed, ignorance has reached epidemic proportions inside the Beltway.\n\nChris Mooney objects, with his post on “Classic False Equivalence on Political Science Abuse.” An excerpt:\n\nWhen this kind of thing gets pointed out, there is one response you can count on: Someone tries to show that liberals do the same thing. This typically involves finding a few relatively fringe things that some progressives cling to that might be labeled anti-scientific. But usually, the allegedly anti-science position is not mainstream or has relatively little political influence. Sometimes, the argument is even weaker still, because science-related policy disagreements are confused with cases of science rejection, ignoring a very basic distinction that is central to any discussion in this area.\n\nRight, so let’s continue on your dismiss-a-thon of leftist anti-science, shall we? DDT and cancer, BPA and phthalates as carcinogens and endocrine disruptors; claims that organic food are safer because they have less pesticides/contaminants; claims that eating local foods are better for the environment than foods from elsewhere; claims that re-usable cloth bags are better for the environment than plastic or paper bags; false claims of species endangerment; pseudo-scientific claims about species loss treated as gospel; claims that climate models have predictive power; claims that individual weather events represent climate change…I think you missed a few.\n\nOh, wait, I forgot a few: frogs dying from climate change, alligator penis malformations from endocrine disruptors, bees dying from climate change (or is it cell-phones this week?), butterflies dying from BT crops…And, let’s not forget Alar, or cancer from video displays, or cell phones, or anything vaguely reminiscent of modernity.\n\nOops! Oh yes, then there’s the giant plastic ocean graveyard that was never seen again, and, let’s not forget the now-famous drowning polar bears.\n\nI would add to your impressive list the additional following examples: ALAR and apple juice, hydraulic fracturing risks, hexavalent chromium contamination in Hinkley California, amaranth, saccharin (although all of these might be better classified as the misuse of toxicology, a particular pet peeve of mine) and my favorite, nuclear winter. Mooney brushes this off by alleging that while there may be misuse of science by liberals, the perpetrators are not influential and it has no wide scale impact. Oh contraire. The Food Quality Protection Act of 1996, to name just one, had a mandate that the Environmental Protection Agency develop an endocrine disruption screening program for pesticides. This was based on years of activism from the like of quacks like Theo Coburn and was bolstered by a Tulane study, later retracted after no one could duplicate its results, that appeared just in time to impact the bill. Anther example is Carter, with strong endorsement from the “scientific community”, ending US nuclear waste reprocessing.\n\nAnd Mooney is dead wrong on low dose radiation hazards. The National Academy of Science states that “no dose of radiation is safe” but they have no data to back this statement up, only a hypothesis they cannot test. The linear threshold model is a liberal (no pun intended) application of the precautionary principal as you cannot conduct an epidemiological study of radiation exposure at low levels of exposure and get any meaningful data. This being the case, the linear threshold model for radiation exposure is not science, it’s a philosophical argument.\n\nManipulation of “science” is VERY mainstream among liberals. You can hardly pick up a lefty magazine or newspaper and not see it. The left “science deniers” are similar in pathology to Christian millenarianists who await the Apocalypse. They pinpoint a date for wholesale destruction, and they’re always wrong. But unlike Christian fundamentalists, liberals have the advantageous distinction of never needing to say sorry. In fact, the worst of them, people like John Holdren and Paul Erlich go onto serve in very high places in the scientific community.\n\nKeith Kloor picks up the discussion at Collide-a-Scape with a post entitled “Who you calling anti-science?” Kloor states:\n\nWhat Green fails to address is that an anti-evolution pose and climate change rejectionism have become closely associated with the GOP, because of the influence of religious conservatives and the Tea Party. There are no similarly high profile anti-science stances associated with Democrat leaders or policymakers. For example, President Obama, as Mooney pointed out, is pro-nuclear. Here’s another: The Obama administration has made regulatory decisions on GMO foods that have upset the lefty, anti-GMO types at Grist and Mother Jones. And so on.\n\nSo when looked at this way, there is no equivalence in anti-science attitudes between establishment Republicans and Democrats–as reflected in the kinds of science-related issues that are now fixtures in the political landscape. It’s pretty clear which party is getting the anti-science reputation and why.\n\nJC comments: With the exception of evolution, each of these issues that one side or the other is accused of being anti-science has sociopolitical implications. Science is being used as a proxy for what should be a debate over values and policy. Many of the issues under debate are about complex organisms or environmental systems, where the science is uncertain or ambiguous when applied to policy problems.\n\nUsing science for political purposes is on par with ignoring science in policy decisions, so both sides are guilty of abusing science. It is probably pointless to argue which side is more guilty. The real problem is when all this gets in the way of scientists doing science, which has been the case for climate science.", "opengraph": {"type": "article", "title": "Who’s anti-science?", "url": "https://judithcurry.com/2011/09/24/whos-anti-science/", "description": "by Judith Curry A blogospheric debate has erupted this weekend over who is more anti-science: the political right, or the left.", "article:published_time": "2011-09-24T20:07:00+00:00", "article:modified_time": "2012-09-28T17:27:38+00:00", "site_name": "Climate Etc.", "image": "https://s0.wp.com/i/blank.jpg", "locale": "en_US"}, "tags": ["Republican Party"], "tweets": [], "movies": [], "links": ["http://www.usatoday.com/news/opinion/forum/story/2011-09-20/gop-democrats-science-evolution-vaccine/50482856/News+-+Opinion%29", "http://content.usatoday.com/topics/topic/Organizations/Political+Bodies/Republican+Party", "http://www.usatoday.com/tech/science/2009-07-09-science-survey_N.htm", "http://scienceprogress.org/2011/09/classic-false-equivalence-on-political-science-abuse/", "http://www.collide-a-scape.com/2011/09/23/who-you-calling-anti-science/", "mailto:?subject=%5BShared%20Post%5D%20Who%27s%20anti-science%3F&body=https%3A%2F%2Fjudithcurry.com%2F2011%2F09%2F24%2Fwhos-anti-science%2F&share=email", "https://judithcurry.com/2011/09/24/whos-anti-science/?share=twitter", "https://judithcurry.com/2011/09/24/whos-anti-science/?share=facebook", "https://judithcurry.com/2011/09/24/whos-anti-science/#print", "https://judithcurry.com/2011/09/24/whos-anti-science/?share=reddit", "https://judithcurry.com/2011/09/24/whos-anti-science/?share=tumblr"], "authors": [], "publish_date": "2011-09-24T20:07:00+00:00"}