{"result_id": "071017", "URL": "https://judithcurry.com/2023/03/08/australian-renewables-integration-part-2/", "timestamp": "2023-04-25 14:44:29 CEST+0200", "meta": {"description": "by Planning Engineer (Russ Schussler) and Chris Morris Many are looking towards Australia and seeing bold, innovative steps to increase the penetration levels of wind and solar resources. A grid revolution around the corner? Or just the madness of crowds?  This post discusses what we can discern from their efforts so far. Major New Innovations…", "lang": "en", "keywords": "", "favicon": "https://s0.wp.com/i/webclip.png", "canonical": "https://judithcurry.com/2023/03/08/australian-renewables-integration-part-2/", "encoding": "UTF-8"}, "image": null, "domain": "judithcurry.com", "title": "Australian renewables integration. Part 2", "cleaned_text": "Many are looking towards Australia and seeing bold, innovative steps to increase the penetration levels of wind and solar resources. A grid revolution around the corner? Or just the madness of crowds? This post discusses what we can discern from their efforts so far.\n\nPart 1 covered renewables’ impacts so far on the major power grid in Australia. Many are inspired by this headline: South Australia may be first big grid in world to go without synchronous generation. The article begins by noting:\n\nSouth Australia – already leading the world in the uptake of wind and solar and operating its grid at high levels of renewables – could be the first gigawatt scale grid in the world to operate without synchronous generation… South Australia is unique in the world because it is the first gigawatt scale grid to operate at such high levels of wind and solar, which in the past year have accounted for 64 per cent of local generation, according to AEMO.\n\nReports are that South Australia is set to become the first big grid to run on 100% renewables.\n\nIn far away Western Australia, with a smaller independent grid, is setting records for wind and solar as well. In 2025 they believe there may be enough wind and solar to power the grid entirely by renewables, for at least half an hour. On October 16th 2022 there was more than enough available wind and solar to match local demand there.\n\nIdentified problems associated with a net zero grid are often inappropriately dismissed with some reference to work being done somewhere, or referencing the claims of academics. Frequently industry changing innovations have appeared poised to emerge just “around the corner”. Despite the enthusiasm of their boosters, these just around the corner breakthroughs often tend not to work out very well. The eventual associated complexity and costs of “around the corner” projects often prove crippling. Such claims can be almost impenetrably confusing. “Around the corner” claims are often overblown or misunderstood. Let’s dig a little deeper into the available information here.\n\nFirst off it should be noted that South Australia (SA) is not a grid in the context of being self-contained and independent. It is a relatively small component of a large grid. The resources on the larger grid were described in Part 1:\n\nWind and solar, the unreliables, are now a significant part of the current NEM generation but the backbone is still coal – over 60% of the energy. Wind is less than 15% and grid solar 5%. …. There is also the significant presence of domestic PV. Because it is mainly behind the meter, there is no accurate data on its precise magnitude. But scaling up the contribution of grid solar and allowing for less efficient installations, it would be in the order of another 10%.\n\nThe large grid has a significant number of synchronous generators that support the SA system in many ways. As noted in Part 1, generation in Victoria specifically helps buffer South Australia’s already erratic generation through the Heywood interconnection. The large synchronous machines on the neighboring system work to support the South Australia experiment. The hype that this experiment is receiving would be well more deserved, if the greater grid were participating to the same degree as South Australia.\n\nThis isn’t the first time that exaggerated claims have been made concerning the ability of an independent grid to run at high levels of renewables, based upon the penetration levels within a limited area of the grid. Not too long ago many pointed towards Germany as showing how a grid could accommodate high levels of renewables. This was a very misleading picture. The physics of the grid do not care who owns what. Synchronous resources from a neighbor’s generators provide support across the European grid, despite differences in language and nationality. Electricity flows quickly, approaching the speed of light, over every potential path to support all parts of the system regardless of who owns what. The German component is supported by conventional generation from neighboring systems including coal resources in Poland.\n\nOK, Not an Independent Grid, But a Good Sized Asynchronous Component of a Grid?\n\nIs South Australia going asynchronous? Grid experts reading the claim that, South Australia may be first big grid in world to go without synchronous generation, should know there is a trick somewhere, even if they aren’t quite yet sure what the trick is. The trick (besides that SA is not a grid) is that they are not, as a quick reading of the headline suggests, looking at building a grid that doesn’t rely on synchronous resources.\n\nThere is a loophole in the argument that grids require synchronous generators. The South Australia headline is capitalizing on that loophole. Four synchronous condensers are needed to maintain the grid without their synchronous gas generating units. These synchronous condensers need to be in place before they remove conventional generation. Synchronous condensers are basically the same as synchronous generators, the difference being they lack the ability to generate power. Existing steam plants can be converted to synchronous condensers by removing the prime mover that powers the unit. The rest of the assembly rotates in synchrony with the grid. Synchronous condensers can provide inertia, voltage control and provide or absorb vars. Synchronous condensers function at the point where generators transition to motors. Synchronous condensers are synchronous machines but they consume power, rather than supply it.\n\nPutting this in context, the SA experiment is not to create an asynchronous independent grid operating on wind and solar, as many perceive. The experiment is addressing how well a component of a large grid can integrate a large amount of wind and solar, that benefits from the synchronous generators of its neighbors and which has installed special synchronous condensers to replace the synchronous generators that they are retiring,\n\nIs Using Synchronous Condensers to Support Renewables a New Idea?\n\nNot really. Synchronous condensers have been around for a very long while. In Planning Engineer’s first posting at Climate Etc. in 2014 he noted:\n\nCould a power system operating similar to ours be built that relied on only renewable resources? The answer is yes and no. As noted above there are essential system characteristics that most renewables do not supply or supply well. However, a renewable system could be coupled with extensive batteries and other storage devices, large mechanical flywheels and condensers (basically an unpowered motor/generator that can spit out or consume reactive power). These devices could approximate the behaviors of our conventional power system but they would require huge and prohibitive costs.\n\nTo be clear, synchronous condensers are great things to have on a grid. They were infrequently used in the past because so many synchronous generators were typically present to support the grid. Wind and solar are creating a need for synchronous condensers, which have been rebranded as “syncons”. One of the authors has made recommendations in the past at various times to convert retiring plants to operate as synchronous condensers to better support the grid. However, the structures of ownership and cost sharing doomed such strategic considerations. As Australia is judging it worthwhile to incur the full costs of new synchronous condensers, perhaps policy changes could be made to allow even more economic conversion ,especially as asynchronous renewables are increasing their penetration levels most everywhere. Often it would make sense to keep old coal plants around to provide both emergency generation and synchronous resources when needed. If that’s not possible, consideration should be given to at least keep them as synchronous condensers. Part of why neither is being done is that many are proud to virtuously claim that they are shuttering coal plants. When multiple plants are closed by a solitary action, you know little thought is going into the specifics. Beyond that, flawed market and cost recovery schemes are causing many opportunities to be missed.\n\nIf others learn from Australia the value of synchronous condensers (especially at low cost from retiring plants), that will be a great thing.\n\nWhat else is SA doing?\n\nAs noted by the market operator AMEO, there are detailed engineering challenges that must be solved before allowing 100% renewables on the grid. “They are undertaking various other improvements to cope with the generation changes. Currently there are plans to spend $12.7 Billion to build 5 new high voltage transmission lines to bolster their system. South Australia also has a strong need for storage to enable frequency control and reserves services. Plans to allow more of the wind and solar to be used, also include more exotic procedures such as heavier curtailment of power from rooftop PV under certain conditions. Cutting solar at the residential level to allow greater renewable penetration at the grid level (or because of difficulties introduced by dispatch of solar and wind) provides a good illustration of how challenging and overcomplicated this transition might be. This article notes, ”AEMO’s plan to fix the broken energy system seems so simple, but it’s likely to be anything but.”\n\nIt is doubtful the current approach can be sustained. Remember that coal is still the major generation energy source in Australia. Continuing and expanding the steps they are taking with increasing grid wide penetration will only compound the costs and challenges. Their “solutions” are not the bold innovations needed for the proposed changes in generation, but rather costly, makeshift, stopgap Band-aids.\n\nReplacing generation, adding storage, adding synchronous machines and complicating procedures will likely harm cost and reliability. Leveled cost comparisons of wind and solar to natural gas are very misleading if they ignore the changes needed to support asynchronous renewables. Proponents of wind and solar want these extra costs to be hidden and paid by others. But if wind and solar require large synchronous machines to enable them to work with the grid, and storage as well, some cost reckoning is due when competing resources include synchronous capability as an inherent part of their design. Renewable advocates can’t continually rely on shoddy cost studies ignoring the huge cost differences associated with the competing resources. As wind and solar become more prevalent, the extra costs necessary to address reliability will increase and be harder to hide.\n\nAMEO must realize this ,as they have stated their intent to move towards developing the capability for inverter-based resources (like wind, solar and batteries) to provide the functionality they are now seeking from synchronous condensers. The inverter-based work is much less developed and much further away. If it could be made to work it would likely be much less expensive than their current approach. But can it be made to work on a complicated grid? Nobody is proposing to begin that experiment yet on a large scale. A system primarily dependent on inverter-based support, whether synchronous or asynchronous, would be revolutionary. If that’s where their focus is, the development within Australia would truly be worthy of attention.\n\nWhy is the Focus on Changing Resources and not The Grid Needs?\n\nThe series “Academics and the Grid” (Here, here and here) discussed two different foci of the energy transition. There are two major problem areas:\n• Getting energy from renewables instead of fossil fuels\n• Having the grid work with intermittent asynchronous renewable resources\n\nIt would seem that a grid transformation would need to make progress on these two separate concerns in tandem. The first problem is easier to address while the second is more challenging and becomes increasingly intractable at higher penetration levels of wind and solar. It’s understandable why individuals or groups might choose to address the first problem over the other, especially in terms of personal incentives and rewards. But it is mind-boggling that an entity committed to an energy transition would seek to maximize efforts in regard to changing energy resources while hoping a miracle will occur allowing that energy to be delivered in an economic and reliable manner.\n\nThe mismatch between energy sourcing and energy delivery raises challenges in term of responsibilities and costs. The decarbonization advisor noted the considerable “wrangling over who should foot the construction bill”. Some additional interesting quotes from the decarbonization advisor appear in this article.\n• “The simple task is to estimate when coal is going to come out of the system — that’s number one”\n• “The most difficult thing is enabling the replacement”\n• We know that large-scale batteries and large-scale hydro are going to play a pretty significant role.\n• “(T)here’ll need to be a role for gas and we know there’s going to be a role for [rooftop solar and battery]”\n• “We know there’ll need to be a great deal of attention paid to what happens when that base-load generation comes off”\n• “A lot of the markets that will pay for these new sources don’t yet exist”\n\nExcept for putting the cart before the horse, these quotes suggest we might agree about a lot. It is simple to take out coal, if you don’t care what happens next . It is going to be incredibly difficult, if at all possible , to enable the replacement. Significant roles will be demanded from all resources but that may not be enough . A lot of attention needs to be paid when baseload generation comes off, and a lot of challenges without practical solutions will likely emerge . A lot of needed things needed don’t exist yet and may not ever exist. The energy system may be unrecognizable, maybe because it will no longer resembles an economic and reliable power system .\n\nEvidently there are a lot of individual short-term incentives in the mix, not tied to any long-term gains for the large population of electric consumers. Clearly many relevant policy makers lack information and expertise in needed areas and are greatly influenced by others who are the same boat. From an engineering perspective, it seems obvious that to allow increased penetration of wind and solar, neither of the problem areas can be ignored and that progress must be made concurrently with advancements in both areas. You don’t figure out how to land a plane after you have the passengers in the air.\n\nEnergy is too important for policy makers to invest in a “field of dreams”. You can’t change the basics of energy supply, then just hope the support system will organically emerge. The largely singular focus and magical thinking may best be explained by those with expertise in the areas of human, group, organizational, political or religious behavior perhaps those with a good understanding of the “madness of crowds”.\n\nSouth Australia’s initial efforts are less revolutionary than they appear. Their efforts instead show the importance and centrality of synchronous machines. Australia is retiring synchronous generators and replacing them with other synchronous machines. This step is not revolutionary. That and the other solutions they are incorporating confirm that a net-zero grid faces considerable challenges. Combined with other planned changes, their overall efforts will aggravate existing reliability trends. AEMO is currently seeing inertial shortfalls and poor system security. Will the new efforts continue the trends towards a costlier less reliable grid? The authors believe it is most likely that costs will increase significantly and reliability will degrade considerably even if they do a great job of implementing all the planned changes. Higher energy costs will hurt their consumers and industry while moving manufacturing and industry away from Australia to areas with cheaper (fossil fuel based) energy. The end result may cause far greater environmental harm.\n\nThe effectiveness of South Australia’s future plans remains to be demonstrated. It’s not clear how complicated or expensive it may be to implement the proposed changes. Curtailing residential solar to allow greater grid-based wind and solar, suggest s that it may be inordinately complicated. Australia is not solving these problems, or showing how they might be solved, as much as they are just grappling with them. How well operators will be able to deal with the complexity is unknown. How much this might cost is a complete unknown. How much it costs and how well it operates will need to be carefully considered before declaring this a path to be emulated across other grids and power systems in the future. The work to replace synchronous machines with inverter-based resources is at best in its infancy. Documentation around their efforts shows that concerns about high levels of penetration by asynchronous renewables are well founded. It is premature to declare any kind of a victory here. They may find that things are more challenging than they thought.", "opengraph": {"type": "article", "title": "Australian renewables integration. Part 2", "url": "https://judithcurry.com/2023/03/08/australian-renewables-integration-part-2/", "description": "by Planning Engineer (Russ Schussler) and Chris Morris Many are looking towards Australia and seeing bold, innovative steps to increase the penetration levels of wind and solar resources. A grid re…", "article:published_time": "2023-03-09T02:02:50+00:00", "article:modified_time": "2023-03-09T02:02:50+00:00", "site_name": "Climate Etc.", "image": "https://s0.wp.com/i/blank.jpg", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["https://reneweconomy.com.au/south-australia-may-be-first-big-grid-in-world-to-go-without-synchronous-generation/#:~:text=Great%20Solar%20Business-,South%20Australia%20may%20be%20first%20big%20grid,to%20go%20without%20synchronous%20generation&text=South%20Australia%20%E2%80%93%20already%20leading%20the,to%20operate%20without%20synchronous%20generation.", "https://www.climatechangenews.com/2022/09/16/south-australia-set-to-become-first-big-grid-to-run-on-100-renewables/he%20are", "https://reneweconomy.com.au/w-a-s-isolated-grid-sets-new-instantaneous-and-monthly-records-for-wind-and-solar/", "https://reneweconomy.com.au/the-day-worlds-biggest-isolated-grid-had-enough-wind-and-solar-to-reach-100-pct-renewables/", "https://judithcurry.com/2023/01/04/academics-and-the-grid-part-i-i-dont-think-that-study-means-what-you-think-it-means/", "https://www.aer.gov.au/wholesale-markets/wholesale-statistics/generation-capacity-and-output-by-fuel-source-nem#_blank", "https://www.tdworld.com/grid-innovations/generation-and-renewables/article/20970380/the-myth-of-the-german-renewable-energy-miracle", "https://reneweconomy.com.au/south-australia-may-be-first-big-grid-in-world-to-go-without-synchronous-generation/#:~:text=Great%20Solar%20Business-,South%20Australia%20may%20be%20first%20big%20grid,to%20go%20without%20synchronous%20generation&text=South%20Australia%20%E2%80%93%20already%20leading%20the,to%20operate%20without%20synchronous%20generation.", "https://judithcurry.com/2014/10/22/myths-and-realities-of-renewable-energy/", "https://aemo.com.au/energy-systems/electricity/national-electricity-market-nem/system-operations/general-power-system-risk-review/power-system-frequency-risk-review", "https://www.abc.net.au/news/2022-07-01/how-aemo-plans-to-fix-broken-energy-system-australia/101196758", "https://judithcurry.com/2022/10/03/the-penetration-problem-part-i-wind-and-solar-the-more-you-do-the-harder-it-gets/", "https://judithcurry.com/2023/01/04/academics-and-the-grid-part-i-i-dont-think-that-study-means-what-you-think-it-means/", "https://judithcurry.com/2023/01/09/academics-and-the-grid-part-ii-are-they-studying-the-right-things/", "https://judithcurry.com/2023/01/15/academics-and-the-grid-part-3-visionaries-and-problem-solvers/", "https://www.abc.net.au/news/2022-07-01/how-aemo-plans-to-fix-broken-energy-system-australia/101196758", "https://aemo.com.au/-/media/files/electricity/nem/planning_and_forecasting/operability/2022/2022-inertia-report.pdf?la=en", "https://aemo.com.au/-/media/files/electricity/nem/planning_and_forecasting/operability/2022/2022-system-strength-report.pdf?la=en", "https://cosmosmagazine.com/technology/energy/rooftop-solar-curtailment/", "mailto:?subject=%5BShared%20Post%5D%20Australian%20renewables%20integration.%20Part%202&body=https%3A%2F%2Fjudithcurry.com%2F2023%2F03%2F08%2Faustralian-renewables-integration-part-2%2F&share=email", "https://judithcurry.com/2023/03/08/australian-renewables-integration-part-2/?share=twitter", "https://judithcurry.com/2023/03/08/australian-renewables-integration-part-2/?share=facebook", "https://judithcurry.com/2023/03/08/australian-renewables-integration-part-2/#print", "https://judithcurry.com/2023/03/08/australian-renewables-integration-part-2/?share=reddit", "https://judithcurry.com/2023/03/08/australian-renewables-integration-part-2/?share=tumblr"], "authors": [], "publish_date": "2023-03-09T02:02:50+00:00"}