{"result_id": "071037", "URL": "https://judithcurry.com/2020/10/14/t-cell-cross-reactivity-and-the-herd-immunity-threshold/", "timestamp": "2023-04-25 14:44:56 CEST+0200", "meta": {"description": "By Nic Lewis An interesting new paper by Marc Lipsitch and co-authors, \"Cross-reactive memory T cells and herd immunity to SARS-CoV-2\", has recently been published.[1] It discusses immunological and epidemiological aspects and implications of pre-existing cross-reactive adaptive immune system memory arising from previous exposure to circulating common cold coronaviruses. They argue that key potential impacts…", "lang": "en", "keywords": "", "favicon": "https://s0.wp.com/i/webclip.png", "canonical": "https://judithcurry.com/2020/10/14/t-cell-cross-reactivity-and-the-herd-immunity-threshold/", "encoding": "UTF-8"}, "image": null, "domain": "judithcurry.com", "title": "T cell cross-reactivity and the Herd immunity threshold", "cleaned_text": "An interesting new paper by Marc Lipsitch and co-authors, “Cross-reactive memory T cells and herd immunity to SARS-CoV-2”, has recently been published.[1] It discusses immunological and epidemiological aspects and implications of pre-existing cross-reactive adaptive immune system memory arising from previous exposure to circulating common cold coronaviruses. They argue that key potential impacts of cross- reactive T cell memory are already incorporated into epidemiological models based on data of transmission dynamics, particularly with regard to their implications for herd immunity. I believe that they are mistaken on the herd immunity point, as I will show in this article.\n\nThe first point to make is that cross-reactive T cells were never thought to be the main cause of the herd immunity threshold (HIT)[2] being lower for COVID-19 than the oft-quoted {1 – 1/R0} level, which generally applies for vaccination. Heterogeneity in social connectivity (contact rates) is typically estimated to lower the HIT much more than heterogeneity in biological susceptibility to the causative SARS-CoV-2 virus.[3]\n\nPossible effects of cross-reactive T cells on infection progression\n\nLipsitch and co-authors note that recent reports have shown that SARS- CoV-2 cross-reactive memory T cells, very largely CD4+ T-cells arising from previous exposure to circulating common cold coronaviruses, are detectable in ~28–50% of individuals not exposed to SARS- CoV-2. They say that only tissue-resident memory T cells (T cells) can mount a fast response, with recirculating T and T T cells taking several days to start fighting an infection. They point out that CD4+ T-cells generally limit disease severity, reduce the viral burden and/or limit the duration of the disease rather than preventing an initial infection.\n\nWhile I do not intend to challenge any of the foregoing points here, it should be noted that they treat an ‘infection’ as including a case where so few cells have been infected that any (RT-)PCR test for the virus would be negative.\n\nThe paper states that CD4+ T cell-mediated memory responses to a virus may involve some or all of CD4+ T cell types (required for B cell help and thus almost all neutralizing antibody responses), T 1 and CTL cell types (with direct antiviral activities in infected tissues), and that the CD4+ T cells involved may be T cells, or slower to respond recirculating T /T cells.\n\nThe authors go on to propose four immunological scenarios for the impact of cross-reactive CD4+ memory T cells on COVID-19 severity and viral transmission. The four model scenarios they put forward are:\n• Reduction of lung burden: CD4+ T cells reduce COVID-19 symptoms and lung viral load but have minimal impact on upper respiratory tract (URT) viral load.\n• TFH cell-accelerated antibodies: CD4+ T cells trigger a faster and better antibody response, resulting in accelerated control of virus in the URT and lungs.\n• TRM cells in the URT: CD4+ T cells at the site of infection enable rapid control of virus in the URT and lungs.\n• Transient infection: T cell immunity ‘blitzes’ viral replication in the URT leading to the elimination of all infected cells within a day of the initial infection, at the portal of entry.\n\nThe first three scenarios, along with the case where no cross-reactive T cells exist, are represented in Fig.1 of the paper, reproduced below.\n\nWhich models do the data fit?\n\nThe authors argue that biological evidence implies model scenario 4 is very unlikely where only CD4+ T cells are involved. They point out that if pre-existing CD4+ T cell immunity was so extreme as to preclude significant viral replication, seroconversion (that is, a de novo antibody response to SARS- CoV-2) would not occur. Such individuals would not be detectable by virological (e.g., PCR) or serological diagnostic tests and would not shed virus; effectively, these individuals would be immune to infection and not reported as cases. The authors say that evidence for other human coronaviruses makes this implausible, and that when epidemiological evidence of very high attack rates in some ship-based outbreaks is added scenario 4 is highly unlikely.\n\nHowever, in the most studied ship-based outbreak the proportion infected was under 20%.[4] Moreover, the results of a study that Lipsitch et al. do not cite[5] show that, in households where one person was confirmed as having COVID-19, a substantial proportion of other household members had negative PCR test results, implying that they were not infective, despite most of them having typical COVID-19 symptoms. Moreover, these individuals did not develop detectable SARS-CoV-2 specific antibodies, but did develop SARS-CoV-2 specific (as opposed to cross reactive) T cell responses, implying that they had been infected to some degree by SARS-CoV-2 .\n\nNotwithstanding that the sample size was small in that study, it appears to cast some doubt on Lipsitch et al.’s assertion that scenario 4 is highly implausible. It also casts doubt on their subsequent assertion that almost all people infected by SARS-CoV-2 seroconvert (develop antibodies against it), although the test used might have been insufficiently sensitive to detect low antibody levels. In that connection, Lipsitch et al. say that a recent study[6] observed [only] about 3 cases of non-PCR confirmed potentially asymptomatic COVID-19 cases with T cell responses in the absence of seroconversion, but their interpretation of that study’s results has been challenged.[7]\n\nA substantial proportion of PCR-test positive individuals – in some localised outbreaks, the vast majority of them – have asymptomatic infections. In the most studied ship-based outbreak4 almost half of infected individuals remained asymptomatic throughout.[8] If that is due to T-cell cross reactivity, acting in combination with innate immune responses, then only model scenarios 3 or 4 would fit, since model scenarios 1 and 2 imply significant symptoms.\n\nIn the remainder of this article I will not pursue the possibility of model scenario 4 being relevant. Rather, I will focus on showing that the implications for herd immunity of model scenario 3 (possibly involving also model scenario 2), as varied to take account of variation in viral dose and innate immune system strength, are very likely not already taken into account in simple epidemiological models based on transmission dynamics data. In this connection, it should be noted that the extent and quality of the available data, both biological and epidemiological, does not provide high quality evidence, so drawing firm conclusions either way is difficult.\n\nImportantly, there is quite strong evidence that infected individuals transmit SARS-CoV-2 much more weakly if they are asymptomatic (and not just presymptomatic). Biological evidence neither proves nor disproves that a positive PCR test for SARS-CoV-2 implies significant infectivity (although a negative PCR test can be taken as implying a lack of significant infectivity).[9] However, epidemiological evidence strongly suggests that transmission by asymptomatic individuals is far lower than that by symptomatic or presymptomatic individuals.\n\nA number of studies have investigated transmission from index cases who remained asymptomatic throughout their infections. A review study[10] estimated that the mean household secondary attack rate from asymptomatic cases was only 3.5% of that from symptomatic cases. As that study noted, household secondary attack rate provides a useful estimate of both the susceptibility of contacts and infectiousness of index cases. However, both in that study, and in another review study[11] that estimated a much higher ratio than 3.5%, the statistical analysis appears to be seriously flawed.[12] It is therefore necessary to consider the actual results of the relevant original studies that they reviewed. Two of those studies[13] [14] found no instances of asymptomatic transmission, although the number of contacts concerned was very small in one case. Two other studies each found one case of asymptomatic transmission, out of respectively 305 and 119 contacts,[15] [16] with corresponding relative risks of 6% and 19%. Averaging the risk ratios of all four studies, in a way that gives appropriate weight to the evidence each provides, gives an overall transmission risk ratio estimate of 8% for asymptomatic cases, relative to symptomatic and presymptomatic cases.[17]\n\nThat is, an asymptomatic infected person, as in Lipsitch et al. model scenario 3, appears to be only one-tenth or less as likely to transmit the virus as does a symptomatic or presymptomatic person. This conclusion does not have to depend on asymptomatic infectees having a much lower viral load in their URT, which may not be the case. They could for instance transmit less because of an absence of coughing (particularly that involving expectoration15), less deep breathing or a similar factor; because more of their PCR-measured viral load does not represent viable viruses; and/or because their viral load remains at an infective level for a shorter period.\n\nThe likely importance of viral dose (inoculum) and innate immune responses\n\nTwo factors that Lipsitch et al. do not include in their model scenarios, but which seem likely to be very relevant, are the magnitude of the viral dose and the strength of a person’s fast responding innate immune system. Both the symptoms, as to their likelihood and severity, and the infectivity of an individual exposed to SARS-CoV-2 are expected to depend on the viral dose that their exposure involves[18] [19] and on the strength of their innate immune system, as well as on any cross-reactive T cell and/or antibody adaptive immune system memory. I will concentrate here on differences arising from the interaction between viral dose and cross-reactive T cells, but in reality differences in innate immune system strength, and in general health and other factors, will likewise affect how somebody reacts to viral doses of varying strength and to what extent they become ill and/or infective.\n\nIt seems entirely possible that where the viral dose is sufficiently low, a person with cross reactive CD4+ T cells might either be infected so little that – whether or not a PCR test would be positive, at a sufficiently large cycle threshold (high sensitivity) – they not only remain asymptomatic but also have negligible infectivity. In effect, given a sufficiently low viral dose, Lipsitch et al.’s model scenario 3 might produce rather similar effects to what their model scenario 4 would do for a high viral dose. It appears, for most purposes, to be inappropriate to regard such a non-infective, healthy person as a COVID-19 case or even as being infected at all.[23] Such persons are accordingly treated here as not having been infected. However, it appears possible that a low viral load might, without resulting in symptoms or non-negligible infectivity, nevertheless induce effective immunity through the development of SARS-CoV-2 specific antibodies and/or T cells.\n\nBy contrast, Lipsitch et al. appear to regard someone as having been infected even if only a single cell in their body has been invaded by a virus. While this definition may be logical from a technical biological angle, it does not seem appropriate from an epidemiological viewpoint. For epidemiological purposes, what is relevant is whether and to what extent a person is or will become ill, infective and/or immune.\n\nWhere the viral dose is fairly high, even if a person has cross reactive CD4+ T cells, they would almost certainly test PCR positive, and be more likely to develop symptoms. Model scenarios 2 and 3 in the paper may both be relevant in these cases. While in such a case the person concerned would be infective, albeit much less so if asymptomatic, if they had cross reactive CD4+ T cells they would probably be considerably less infective (and be much more likely to be asymptomatic or to have mild symptoms).\n\nInsofar as infected individuals are asymptomatic and of low (but non-negligible) infectivity, it may be that in cases where they do transmit infection the viral dose is usually sufficiently low for the person thereby infected also to be asymptomatic and of low infectivity, in which case such asymptomatic transmission will contribute to the gradual spread of immunity while not leading to disease.[24]\n\nModelling the effects of varying susceptibility and infectivity arising from cross-reactive T cells\n\nI have built a greatly simplified toy model that illustrates the possible implications for epidemic progression and herd immunity of cross-reactive T cells that have the effects discussed in this article. The model stratifies the population into two equal parts, one possessing cross-reactive T cells and the other not. It distinguishes symptomatic and asymptomatic infections, the latter having only one-ninth as high a probability of causing infection as the former.\n\nThe detailed assumptions made in the model are set out in an Appendix. While these assumptions are purely illustrative, they are intended to be broadly consistent with existing evidence and the foregoing discussion in this article. The key assumptions regarding the effects of cross-reactive T cells are that their presence halves the risk of infection from a potentially infective contact, quarters the probability of any infection being symptomatic, and may result in immunity developing in a substantial proportion of those cases where infection does not occur.\n\nThe modelled epidemic is seeded by the symptomatic infection of one naïve individual (a person without cross-reactive T cells). The number of close contacts per generation is then adjusted to produce, after the epidemic has adjusted from the initial seeding pattern to its natural pattern, a reproduction number early in the epidemic – which will therefore closely approximate R0 – of 2.4.\n\nThe toy model’s projections show that, after initial exponential growth, new infections start to decline, indicating that herd immunity has been achieved. At that point, 41% of the population has been infected, with approximately 43% of infections being asymptomatic. At 41%, the HIT is slightly over two-thirds of the classical HIT level for a homogeneous population, being 58%.[25]\n\nA further 20% of the population will have become immune without, for all practical purposes, having had an infection. If on the other hand no exposed but uninfected (i.e., asymptomatic and non-infective) individuals develop immunity, then the HIT is closer to the classical level, but still lies more than 10% below it. If the probability of being infected is reduced by 85% in the presence of cross-reactive T cell memory, the HIT could be one-third below the classical HIT even if no exposed but uninfected person develops immunity. It is not suggested that such a large differential is likely. However, it does prove that cross-reactive T cell memory, in combination with varying viral dose (and innate immune system strength) can result in a substantially lower herd immunity threshold than that estimated from data earlier in the epidemic using homogeneous population compartmental SIR/SEIR models, as is routinely done.\n\nA more realistic model would incorporate continuous probability distributions for all the key parameters. But the basic point illustrated by the very simple model would remain valid. Homogeneous population based compartmental models imply that epidemic growth will slow pro rata to the shrinking pool of uninfected people. But where there is variation within the population as to how susceptible people are to infection, so that more susceptible individuals are on average infected earlier, the epidemic growth is bound to reduce more rapidly than that. As a result, the herd immunity threshold will be lower than if the population were homogeneous, with the reduction of the HIT being greater if less biologically susceptible individuals also have, if infected, lower biological infectivity.\n\nI have demonstrated that the claim by Lipsitch et al. that the potential impacts on the herd immunity threshold of cross- reactive T cell memory are already incorporated into epidemiological models based on data of transmission dynamics is mistaken, even assuming that they are correct in arguing that their model scenario 4 is highly implausible.\n\nIn this article I have only considered the possible effects of cross-reactive T cells. However, even when combined with other causes of interpersonal variation in biological susceptibility, including age, such heterogeneity is not thought to be the main reason why the herd immunity threshold will be lower than the classical level for a homogeneous population. In practice, interpersonal variation in contact rates (social connectivity) is usually thought to be a much more important reason. 3\n\nAppendix – Assumptions made in the toy model of the effects of cross-reactive T cells\n• The population is one million and is homogeneous except that only 50% of people have cross-reactive memory T-cells.\n• The generation interval is fixed, infected individuals are only infectious in the generation interval after they become infected and are uninfectious and immune thereafter.\n• Infections are by close contact only. The number of close contacts by an infected person is independent of their T cell status and whether or not their infection is asymptomatic (never symptomatic), and each person who becomes infected has only had one contact with an infectious person during the generation interval in which they become infected.\n• A close contact between a symptomatic (including presymptomatic) infectee and a naïve individual (one without cross-reactive T cells) results in infection 90% of the time, with 80% of such infections being symptomatic, due to a high average viral dose being involved.\n• A close contact between an asymptomatic infectee and a naïve individual results in infection 10% of the time, with 20% of such infections being symptomatic, the viral dose being lower.\n• A close contact between a symptomatic infectee and a resistant individual (one with cross-reactive T cells) results in infection 45% of the time, with 20% of such infections being symptomatic.\n• A close contact between an asymptomatic infectee and a resistant individual results in infection 5% of the time, with 5% of such infections being symptomatic.\n• Where such a low viral dose is transmitted on a close contact that a resistant recipient not only has no symptoms but is completely non-infective, they are treated as not being infected but (except if stated otherwise) in 60% of such cases they nevertheless become immune.\n\n[1] Marc Lipsitch, Yonatan H. Grad, Alessandro Sette and Shane Crotty: Cross-reactive memory T cells and herd immunity to SARS-CoV-2. Nature Reviews Immunology 6 October 2020 https://doi.org/10.1038/s41577-020-00460-4\n\n[2] The herd immunity threshold is the proportion of the population that have become infected at the point where each new infection causes, on average, no more than one further infection. For an epidemic in a homogeneous population, it will be {1 – 1/R0}, where R0 is the basic (initial) reproduction number.\n\n[3] e.g., Tkachenko, A.V. et al.: Persistent heterogeneity not short-term overdispersion determines herd immunity to COVID-19. medRxiv 29 July 2020 https://doi.org/10.1101/2020.07.26.20162420\n\n[4] The Diamond Princess. 712 out of 3,711 on board tested PCR-positive, with at least 295 and probably closer to 334 cases (295 from Tokyo plus 40 returned on charter flights, one of whom died from COVID-19) remaining asymptomatic throughout their infection. https://www.mhlw.go.jp/stf/newpage_11441.html\n\n[5] Gallais, F., Velay, A., Wendling, M.J., Nazon, C., Partisani, M., Sibilia, J., Candon, S. and Fafi-Kremer, S., 2020. Intrafamilial exposure to SARS-CoV-2 induces cellular immune response without seroconversion. MedRxiv. https://www.medrxiv.org/content/medrxiv/early/2020/06/22/2020.06.21.20132449.full.pdf\n\n[6] Sekine, T. et al. Robust T cell immunity in convalescent individuals with asymptomatic or mild COVID-19. Cell https://doi.org/10.1016/j.cell.2020.08.017 (2020).\n\n[8] That is consistent with the findings of Sakurai et al., Natural History of Asymptomatic SARS-CoV-2 Infection. New England Journal of Medicine. 2020 Jun 12 https://www.nejm.org/doi/full/10.1056/NEJMc2013020\n\n[10] Madewell, Z.J., Yang, Y., Longini Jr, I.M., Halloran, M.E. and Dean, N.E., 2020. Household transmission of SARS-CoV-2: a systematic review and meta-analysis of secondary attack rate. medRxiv. [1 August version]\n\n[11] Buitrago-Garcia D, et al. (2020) Occurrence and transmission potential of asymptomatic and presymptomatic SARS-CoV-2 infections: A living systematic review and metaanalysis. PLoS Med 17(9): e1003346. https://doi.org/10.1371/journal.pmed.1003346\n\n[12] Madewell et al. included a study where the secondary attack case rather than the index case was asymptomatic. Buitrago-Garcia D, et al., who estimated a relative risk of 0.35 for asymptomatic transmission, included in that estimate a study of presymptomatic transmission (their reference 111) and an estimate based on combined asymptomatic and presymptomatic transmission (from their reference 65), and they wrongly estimated very high asymptomatic transmission risk from studies that found zero cases of it.\n\n[13] Cheng HY, Jian SW, Liu DP, Ng TC, Huang WT, Lin HH, et al. Contact Tracing Assessment of Covid-19 Transmission Dynamics in Taiwan and Risk at Different Exposure Periods before and after Symptom Onset. JAMA Intern Med. 2020. Epub 2020/05/02. https://doi.org/10.1001/jamainternmed.2020.\n\n[15] Luo L, Liu D, Liao X-l, Wu X-b, Jing Q-l, Zheng J-z, et al. Modes of Contact and Risk of Transmission in Covid-19 among Close Contacts. bioRxiv. 2020 [March 26 version] https://www.medrxiv.org/content/10.1101/2020.03.24.20042606v1\n\n[16] Zhang W, Cheng W, Luo L, Ma Y, Xu C, Qin P, et al. Secondary Transmission of Coronavirus Disease from Presymptomatic Persons, China. Emerg Infect Dis. 2020. https://doi.org/10.3201/eid2608.201142\n\n[17] Averaging over the four studies, weighting by the number of contacts by asymptomatic index cases, gives a pooled relative risk estimate of 8.2%. A more sophisticated meta-analysis using the R software Fixed effects (Mantel-Haenszel) function in the rmeta package estimates a pooled study relative risk of 7.9%, with a 75% probability that it does not exceed 13% and a 90% probability that it does not exceed 20% (assuming that the confidence intervals are symmetrical).\n\n[18] Steinmeyer, Shelby H., Claus O. Wilke, and Kim M. Pepin. “Methods of modelling viral disease dynamics across the within-and between-host scales: the impact of virus dose on host population immunity.” Philosophical Transactions of the Royal Society B: Biological Sciences 365.1548 (2010): 1931-1941.\n\n[19] Goyal, Ashish, et al. “Wrong person, place and time: viral load and contact network structure predict SARS-CoV-2 transmission and super-spreading events.” medRxiv (2020) [7 August version].\n\n[20] Hibino, Sawako, et al. “Dynamic Change of COVID-19 Seroprevalence among Asymptomatic Population in Tokyo during the Second Wave.” medRxiv (2020). [23 September version]\n\n[21] Gandhi, Monica, Chris Beyrer, and Eric Goosby. “Masks do more than protect others during COVID-19: Reducing the inoculum of SARS-CoV-2 to protect the wearer.” Journal of general internal medicine (2020): 1-4.\n\n[22] Gandhi, Monica, and George W. Rutherford. “Facial Masking for Covid-19—Potential for “Variolation” as We Await a Vaccine.” New England Journal of Medicine (2020).\n\n[23] While such cases might give a positive result on a PCR test at some point, such a test result might represent detection only of non-viable virus fragments, or a viable viral load that is too low to be infective.\n\n[24] Unfortunately there are too few recorded cases of asymptomatic transmission to provide reliable evidence on this point, but what evidence does appear to exist is consistent with this argument. Zhang et al. identified one case of asymptomatic transmission, which resulted in an asymptomatic infection, while 73% of the eleven cases of symptomatic or presymptomatic transmission they identified resulted in a symptomatic infection. (Luo et al. unfortunately did not indicate the symptom status of the asymptomatic transmission case that they identified.)\n\n[25] For an R0 of 2.4, the classical herd immunity threshold is {1 – 1/2.4} = 0.583", "opengraph": {"type": "article", "title": "T cell cross-reactivity and the Herd immunity threshold", "url": "https://judithcurry.com/2020/10/14/t-cell-cross-reactivity-and-the-herd-immunity-threshold/", "description": "By Nic Lewis An interesting new paper by Marc Lipsitch and co-authors, “Cross-reactive memory T cells and herd immunity to SARS-CoV-2”, has recently been published.[1] It discusses immu…", "article:published_time": "2020-10-14T14:24:11+00:00", "article:modified_time": "2020-10-14T15:59:37+00:00", "site_name": "Climate Etc.", "image": "https://s0.wp.com/i/blank.jpg", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["#_edn1", "#_edn2", "#_edn3", "#_edn4", "#_edn5", "#_edn6", "#_edn7", "#_edn8", "#_edn9", "#_edn10", "#_edn11", "#_edn12", "#_edn13", "#_edn14", "#_edn15", "#_edn16", "#_edn17", "#_edn18", "#_edn19", "#_edn20", "#_edn21", "#_edn22", "#_edn23", "#_edn24", "#_edn25", "#_ednref1", "https://doi.org/10.1038/s41577-020-00460-4", "#_ednref2", "#_ednref3", "https://doi.org/10.1101/2020.07.26.20162420", "#_ednref4", "https://www.mhlw.go.jp/stf/newpage_11441.html", "#_ednref5", "https://www.medrxiv.org/content/medrxiv/early/2020/06/22/2020.06.21.20132449.full.pdf", "#_ednref6", "https://doi.org/10.1016/j.cell.2020.08.017", "#_ednref7", "https://twitter.com/WesPegden/status/1313649435642077184", "#_ednref8", "https://www.nejm.org/doi/full/10.1056/NEJMc2013020", "#_ednref9", "https://www.cebm.net/covid-19/infectious-positive-pcr-test-result-covid-19/", "#_ednref10", "#_ednref11", "https://doi.org/10.1371/journal.pmed.1003346", "#_ednref12", "#_ednref13", "https://doi.org/10.1001/jamainternmed.2020", "#_ednref14", "https://doi.org/10.3201/eid2608.201274", "#_ednref15", "https://www.medrxiv.org/content/10.1101/2020.03.24.20042606v1", "#_ednref16", "https://doi.org/10.3201/eid2608.201142", "#_ednref17", "#_ednref18", "#_ednref19", "#_ednref20", "#_ednref21", "#_ednref22", "#_ednref23", "#_ednref24", "#_ednref25", "mailto:?subject=%5BShared%20Post%5D%20T%20cell%20cross-reactivity%20and%20the%20Herd%20immunity%20threshold&body=https%3A%2F%2Fjudithcurry.com%2F2020%2F10%2F14%2Ft-cell-cross-reactivity-and-the-herd-immunity-threshold%2F&share=email", "https://judithcurry.com/2020/10/14/t-cell-cross-reactivity-and-the-herd-immunity-threshold/?share=twitter", "https://judithcurry.com/2020/10/14/t-cell-cross-reactivity-and-the-herd-immunity-threshold/?share=facebook", "https://judithcurry.com/2020/10/14/t-cell-cross-reactivity-and-the-herd-immunity-threshold/#print", "https://judithcurry.com/2020/10/14/t-cell-cross-reactivity-and-the-herd-immunity-threshold/?share=reddit", "https://judithcurry.com/2020/10/14/t-cell-cross-reactivity-and-the-herd-immunity-threshold/?share=tumblr"], "authors": [], "publish_date": "2020-10-14T14:24:11+00:00"}