{"result_id": "072028", "URL": "https://www.climate.news/2022-10-20-parts-mississippi-river-closed-worsening-drought-conditions.html", "timestamp": "2023-04-25 14:45:28 CEST+0200", "meta": {"description": "Shipping costs for barges continue to hyperinflate as water levels in some parts of the Mississippi River reach record lows. A stretch of the river about 125 miles northeast of Memphis near Hickman, Ky., closed on Monday, after which dredging operations commenced to clear debris from the waterway. The United States Coast Guard announced that […]", "lang": "en", "keywords": "barges,chaos,clean water,crops,disaster,Drought,food collapse,food supply,inflation,Mississippi River,panic,rationing,scarcity,starvation,supply chain,transportation,water,Water Wars,weather terrorism", "favicon": "wp-content/themes/ScienceTheme/images/Climate-fav.png", "canonical": "https://www.climate.news/2022-10-20-parts-mississippi-river-closed-worsening-drought-conditions.html", "encoding": "UTF-8"}, "image": null, "domain": "www.climate.news", "title": "Parts of Mississippi River forced to CLOSE due to worsening drought crisis", "cleaned_text": "Parts of Mississippi River forced to CLOSE due to worsening drought crisis\n\nShipping costs for barges continue to hyperinflate as water levels in some parts of the Mississippi River reach record lows.\n\nA stretch of the river about 125 miles northeast of Memphis near Hickman, Ky., closed on Monday, after which dredging operations commenced to clear debris from the waterway.\n\nThe United States Coast Guard announced that three vessels and 51 barges are still waiting in line at Hickman to get through, though it is unclear when that might be possible. (Related: Barges carrying food crops are unable to pass through certain parts of the Mississippi River, resulting in food being dumped in large covered piles for possible later retrieval.)\n\nAccording to the National Weather Service (NWS), the water level on the Mississippi River in Memphis reached negative 10.79 feet and is still dropping fast.\n\n“The Mississippi River is the lowest it has been since records started in 1954,” NWS Memphis tweeted. “Current stage sits at -10.79 feet.”\n\nAs barges sit with nowhere to go – some of them loaded with this year’s harvest and others waiting to pick it up – the cost of shipping via barges is skyrocketing to levels never before seen.\n\nJust like everything else, the situation is spiraling out of control at warp speed as the breakdown of America’s supply chains continues unabated.\n\nFarmers with beans and other commodities have no way to get them off the farm and to their destinations because barges are unable to travel across areas of the river that are now just piles of sand and sludge with barely any water.\n\nPiles of beans with large tarps have been spotted in various spots along the river as attempts are being made to preserve them until pickup is possible. There is only a limited amount of time before these crops spoil or get consumed by pests, however.\n\nBecause of the crunch, demand for shipping is soaring. Everyone seems to need help all at the same time, and there are only so many trucks and trains available as an alternative to the stranded barges.\n\nKeep in mind that there is also a freight rail strike occurring with at least one union that has rejected the terms put forth by rail companies and the Biden regime as a concession.\n\nEarlier this month, the Coast Guard closed an area of the Mississippi River near Stack Island, Miss., for dredging. Barges there had become stuck in the sludge as water levels dropped.\n\nSome rain could soon be on the way to help alleviate the crisis, says Jeff Graschel, a hydrologist at the Lower Mississippi River Forecast Center, “but nothing that will get us out of the low-water situation.”\n\nIn other words, there is almost no chance that the situation can be rectified anytime soon, which spells serious problems for the food supply as the Mississippi River is America’s most crucial waterway.\n\nThe corporate-controlled media is of course blaming climate change, but with news currently circulating about man-made weather and government geoengineering, it seems more likely that this is an engineered collapse of the food supply and ultimately the economy at large.\n\nOne commenter wrote the following poem about the situation, signing it as something “Hank Williams may as well have written last night:”\n\n“The preacher man says it’s the end of time\n\n And the Mississippi River she’s a-goin’ dry\n\n The interest is up and the Stock Market’s down\n\n And you only get mugged if you go downtown”\n\nAnother quoted Don McLean’s “American Pie” hit, which eerily describes the current state of things with the “levee” being “dry,” as well as the line: “this’ll be the day that I die.”\n\nAs the American food supply chains crumble, we will keep you up-to-date about the latest at Collapse.news.", "opengraph": {"title": "Parts of Mississippi River forced to CLOSE due to worsening drought crisis", "type": "article", "url": "https://www.climate.news/2022-10-20-parts-mississippi-river-closed-worsening-drought-conditions.html", "site_name": "Climate News", "description": "Shipping costs for barges continue to hyperinflate as water levels in some parts of the Mississippi River reach record lows. A stretch of the river about 125 miles northeast of Memphis near Hickman, Ky., closed on Monday, after which dredging operations commenced to clear debris from the waterway. The United States Coast Guard announced that […]", "image": "https://www.climate.news/wp-content/uploads/sites/381/2022/10/Mississippi-River-Missouri-Tugboat-Barge.jpg"}, "tags": ["crops", "starvation", "food collapse", "disaster", "clean water", "scarcity", "transportation", "panic", "chaos", "Drought", "rationing", "Water Wars", "supply chain", "water", "inflation", "barges", "Mississippi River", "food supply", "weather terrorism"], "tweets": [], "movies": [], "links": ["https://www.zerohedge.com/weather/portion-mississippi-river-closes-again-drought-crisis-worsens", "https://naturalnews.com/2022-10-16-bean-piles-mississippi-river-barges-rver.html", "http://supplychainwarning.com", "https://www.brighteon.tv", "http://collapse.news", "https://www.zerohedge.com/weather/portion-mississippi-river-closes-again-drought-crisis-worsens", "https://naturalnews.com/2022-10-16-bean-piles-mississippi-river-barges-rver.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fclimatenews%2F2022-10-20-parts-mississippi-river-closed-worsening-drought-conditions.html&linkname=Parts%20of%20Mississippi%20River%20forced%20to%20CLOSE%20due%20to%20worsening%20drought%20crisis", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}