{"result_id": "072008", "URL": "https://www.climate.news/2023-01-31-greta-wannabe-little-miss-flint-felony-school-shooting.html", "timestamp": "2023-04-25 14:45:15 CEST+0200", "meta": {"description": "A 15-year-old Greta Thunberg fanatic by the name of Mari Copeny is being charged with a 20-year felony for threatening on Snapchat to shoot up a school in Grand Blanc, Mich. “Little Miss Flint,” as Copeny also goes by on social media,” was interviewed by fake president Joe Biden last year concerning the “water crisis” […]", "lang": "en", "keywords": "Biden,conspiracy,Dangerous,domestic terrorism,extremism,felony,greta thunberg,left cult,Liberal Mob,Libtards,Little Miss Flint,lunatics,Mari Copeny,propaganda,psycho,school shooting,SnapChat,social justice,violent activism", "favicon": "wp-content/themes/ScienceTheme/images/Climate-fav.png", "canonical": "https://www.climate.news/2023-01-31-greta-wannabe-little-miss-flint-felony-school-shooting.html", "encoding": "UTF-8"}, "image": null, "domain": "www.climate.news", "title": "Greta Thunberg wannabe “Little Miss Flint” charged with 20-year felony for threatening to shoot up a Michigan school", "cleaned_text": "Greta Thunberg wannabe “Little Miss Flint” charged with 20-year felony for threatening to shoot up a Michigan school\n\nA 15-year-old Greta Thunberg fanatic by the name of Mari Copeny is being charged with a 20-year felony for threatening on Snapchat to shoot up a school in Grand Blanc, Mich.\n\n“Little Miss Flint,” as Copeny also goes by on social media,” was interviewed by fake president Joe Biden last year concerning the “water crisis” in Flint, as well as about “climate change.” Now, this child faces many years in prison for making terroristic threats on the Snapchat platform.\n\n“I can’t vote yet but my generation is going to be impacted by the climate crisis more than any other generation before us,” Copeny told the Sniffer-in-Chief. “What message do you have for the people who vote without the youth or greater good in mind?”\n\n“We’re going to make sure that every single lead pipe in America is out,” Biden answered. “We’re going to pay to have a new one put in in hundreds of thousands of homes.”\n\nThe incident for which Copeny is now being charged with a 20-year felony occurred on November 7 of last year when Copeny made a post stating:\n\nFor some unknown reason, it took months for charges to be filed against Copeny despite the immediacy of her threat.\n\n“I have repeatedly stated that making threats to shoot up a school is no joke,” said Genessee County Prosecutor David Leyton in a statement about the case. “This is a very serious matter; it is a felony charge and we do not condone such threats in any of our schools.”\n\nWhen she is not pushing global warming hysteria and threatening to shoot up schools, Copeny is also an aggressive student activist at her school concerning vaccine compliance.\n\nOn Instagram, Copeny shared a post about a vaccine drive she apparently helped coordinate to accompany a “back to school” event.\n\n“So many happy kids and families,” wrote Little Miss Flint along with a picture of two men standing near a table with a sign reading:\n\n“VACCINES AVAILABLE HERE!!! ASK ME ANY ?s”\n\nPrior to threatening to shoot up her school, Copeny was being showered with praise for her Greta Thunberg-style public activism. Michigan-based corporate media just loved her, as did Biden and other social justice-driven entities.\n\nCopeny was even profiled by MLive for receiving the Billboard Music Awards Changemaker award last year. That profile reads:\n\n“The Billboard Music Awards Changemaker honor is given to pop culture figures that speak truth to power through their commitment to individual action and leadership. They are socially conscious, politically aware, ever-present in their community and charitable with time, crucial resources and influence to improve the lives of others,” the awards organization stated.\n\nSince Greta Thunberg is already becoming something of a has-been in the world of climate activism, it only makes sense that Copeny, another “child star,” was rolled out to take her place. One wonders: who will become the next underage youth star for the Democrats to trot about once Copeny loses her luster – which she maybe already has should she end up in prison for the next two decades.\n\nAccording to ABC 12, Copeny never bothered to follow through on her threat. Grand Blanc Community Schools reportedly sent all students home early that day, went into “secure” mode, and brought in more police presence. No further incidents occurred.\n\nMore related news can be found at Terrorism.news.", "opengraph": {"title": "Greta Thunberg wannabe “Little Miss Flint” charged with 20-year felony for threatening to shoot up a Michigan school", "type": "article", "url": "https://www.climate.news/2023-01-31-greta-wannabe-little-miss-flint-felony-school-shooting.html", "site_name": "Climate News", "description": "A 15-year-old Greta Thunberg fanatic by the name of Mari Copeny is being charged with a 20-year felony for threatening on Snapchat to shoot up a school in Grand Blanc, Mich. “Little Miss Flint,” as Copeny also goes by on social media,” was interviewed by fake president Joe Biden last year concerning the “water crisis” […]", "image": "https://www.climate.news/wp-content/uploads/sites/381/2023/02/Greta-Thunberg-eco-fascist.png"}, "tags": ["conspiracy", "violent activism", "left cult", "lunatics", "greta thunberg", "felony", "psycho", "SnapChat", "Little Miss Flint", "Biden", "extremism", "school shooting", "propaganda", "social justice", "Liberal Mob", "Mari Copeny", "domestic terrorism", "Dangerous", "Libtards"], "tweets": [], "movies": [], "links": ["https://bigleaguepolitics.com/greta-thunberg-wannabe-little-miss-flint-is-reportedly-charged-with-20-year-felony-for-threatening-a-school-shooting/", "http://shootings.news", "https://www.brighteon.tv", "https://naturalnews.com/2021-02-22-indian-activist-protest-toolkit-greta-thunberg-arrested.html", "http://terrorism.news", "https://bigleaguepolitics.com/greta-thunberg-wannabe-little-miss-flint-is-reportedly-charged-with-20-year-felony-for-threatening-a-school-shooting/", "https://naturalnews.com/2021-02-22-indian-activist-protest-toolkit-greta-thunberg-arrested.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fclimatenews%2F2023-01-31-greta-wannabe-little-miss-flint-felony-school-shooting.html&linkname=Greta%20Thunberg%20wannabe%20%E2%80%9CLittle%20Miss%20Flint%E2%80%9D%20charged%20with%2020-year%20felony%20for%20threatening%20to%20shoot%20up%20a%20Michigan%20school", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}