{"result_id": "072032", "URL": "https://climate.news/2022-09-30-carbon-dioxide-nothing-to-do-global-temperatures.html", "timestamp": "2023-04-25 14:45:31 CEST+0200", "meta": {"description": "Meteorologist William Kininmonth with the Global Warming Policy Foundation (GWPF) authored a new paper on so-called “greenhouse gases,” revealing that carbon dioxide (CO2) does not impact global temperatures as many falsely claim. At worst, CO2 has a “minimal effect” on temperature and climate, which is constantly in a state of flux due to factors far […]", "lang": "en", "keywords": "carbon dioxide,Climate,climate alarmism,climate change,climate science,CO2,environment,global warming,Global Warming Policy Foundation,green tyranny,ocean cycles,ocean health,temperature,William Kininmonth", "favicon": "wp-content/themes/ScienceTheme/images/Climate-fav.png", "canonical": "https://climate.news/2022-09-30-carbon-dioxide-nothing-to-do-global-temperatures.html", "encoding": "UTF-8"}, "image": null, "domain": "climate.news", "title": "Carbon dioxide levels have nothing to do with global temperatures, top scientist says", "cleaned_text": "Carbon dioxide levels have nothing to do with global temperatures, top scientist says\n\nMeteorologist William Kininmonth with the Global Warming Policy Foundation (GWPF) authored a new paper on so-called “greenhouse gases,” revealing that carbon dioxide (CO2) does not impact global temperatures as many falsely claim.\n\nAt worst, CO2 has a “minimal effect” on temperature and climate, which is constantly in a state of flux due to factors far outside the bounds of anything mankind can control.\n\nA former consultant at the World Meteorological Organization’s Commission for Climatology, as well as the former head of the Australian government’s National Climate Centre, Kininmonth knows what he is talking about when it comes to the climate. And he is not convinced that CO2 is anything about which to worry.\n\nHe says oceans are the “vital inertial and thermal flywheels” of the climate system. And the oceans, as we can clearly see, are not something that any person or government can control. (Related: Remember when Pete Buttigieg declared that carbon dioxide is a “sin” in the eyes of God?)\n\n“Efforts to decarbonize in the hope of affecting global temperatures will be in vain,” Kininmonth is quoted as saying, adding that recent warming trends are “probably simply the result of fluctuations in the ever-changing ocean circulation.”\n\nOcean movement is largely responsible for planetary warming, not cow farts\n\nKininmonth says it “must be recognized” that CO2 is a non-issue when it comes to warming trends. Humans will always exhale CO2 and plants will always inhale it – and no amount of climate tampering will ever change that.\n\nHe further shared a chart showing that even as CO2 concentration increases from 0 to 600 parts per million (ppm), the total strength of the greenhouse effect barely changes, indicated by a nearly perfect horizontal line across all concentrations.\n\nIn essence, whether there is no CO2 in the air or tons of it, the greenhouse effect remains the same regardless. This basically deconstructs the entire global warming narrative with one simple data point.\n\nNo longer is it necessary to cull all cattle, destroy all gas-powered cars, and exterminate billions of people. Whether life continues on as normal or gets forced into a “green” transition, warming (and cooling) patterns will do what they are going to do regardless.\n\nGood luck trying to convince the climate crazies about any of this, but it is the truth just the same. And it is helpful to have someone like Kininmonth, a renowned climate expert, saying it along with the independent media.\n\nKininmonth says that heat is continually exchanged with the tropical atmosphere and transported by winds to enhance warming at the North Pole. The oceans are doing this, he says, despite it getting blamed on human activity.\n\nTemperatures at the South Pole, meanwhile, have barely moved at all over the past 50 years, which further supports Kininmonth’s hypothesis – which makes a whole lot more sense, by the way, than the cow farts narrative coming from the left.\n\n“Models fail to reproduce accurate energy flows, and this is the guts of how the climate system works,” added Dr. John Christie, a professor of atmospheric and earth sciences at The University of Alabama, supporting Kininmonth’s claims about ocean energy driving climate change.\n\nDespite all this, the prevailing climate claims still point to human use of fossil fuels as the driving factor in global warming. That is because those pushing these claims have a whole lot to gain from a forced global conversion to “green” energy.\n\n“Climate change is a natural process primarily controlled by the cycles of the sun,” added a commenter, pointing to yet another source of global warming that is outside of human control.\n\nThe climate insanity is only getting more and more insane. You can keep up with the latest at Climate.news.", "opengraph": {"title": "Carbon dioxide levels have nothing to do with global temperatures, top scientist says", "type": "article", "url": "https://www.climate.news/2022-09-30-carbon-dioxide-nothing-to-do-global-temperatures.html", "site_name": "Climate News", "description": "Meteorologist William Kininmonth with the Global Warming Policy Foundation (GWPF) authored a new paper on so-called “greenhouse gases,” revealing that carbon dioxide (CO2) does not impact global temperatures as many falsely claim. At worst, CO2 has a “minimal effect” on temperature and climate, which is constantly in a state of flux due to factors far […]", "image": "https://www.climate.news/wp-content/uploads/sites/381/2022/09/Nature-Background-Wave-Ocean-Sea-Sky-Storm.jpg"}, "tags": ["ocean cycles", "Climate", "climate change", "ocean health", "William Kininmonth", "temperature", "Global Warming Policy Foundation", "environment", "green tyranny", "global warming", "climate science", "carbon dioxide", "CO2"], "tweets": [], "movies": [], "links": ["https://www.thegwpf.org/content/uploads/2022/09/Kininmonth-Greenhouse-Effect.pdf", "https://naturalnews.com/2019-09-20-pete-buttigieg-claims-carbon-dioxide-is-a-sin.html", "https://www.brighteon.tv", "https://www.ua.edu/", "https://climate.news", "https://www.thegwpf.org/content/uploads/2022/09/Kininmonth-Greenhouse-Effect.pdf", "https://www.infowars.com/posts/co2-has-almost-no-effect-on-global-temperature-says-leading-climate-scientist-2/", "https://naturalnews.com/2019-09-20-pete-buttigieg-claims-carbon-dioxide-is-a-sin.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fclimatenews%2F2022-09-30-carbon-dioxide-nothing-to-do-global-temperatures.html&linkname=Carbon%20dioxide%20levels%20have%20nothing%20to%20do%20with%20global%20temperatures%2C%20top%20scientist%20says", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}