{"result_id": "072023", "URL": "https://climate.news/2021-06-15-global-warming-capitalism-co2-nuclear-war.html", "timestamp": "2023-04-25 14:45:25 CEST+0200", "meta": {"description": "If you listen to the climate alarmists, you might be forgiven for believing that carbon dioxide is the biggest issue of our time – more dangerous, somehow, than even nuclear war. In fact, some of them are even going so far as to pin the environment’s problems on capitalism, insisting that global capitalism is at […]", "lang": "en", "keywords": "badscience,capitalism,carbon dioxide,climate alarmism,climate change,conspiracy,environment,global warming,lies,nuclear war,nuclear weapons,propaganda,science fraud,war", "favicon": "wp-content/themes/ScienceTheme/images/Climate-fav.png", "canonical": "https://climate.news/2021-06-15-global-warming-capitalism-co2-nuclear-war.html", "encoding": "UTF-8"}, "image": null, "domain": "climate.news", "title": "Global warming and capitalism: Is CO2 more dangerous than impending nuclear war?", "cleaned_text": "Global warming and capitalism: Is CO2 more dangerous than impending nuclear war?\n\nIf you listen to the climate alarmists, you might be forgiven for believing that carbon dioxide is the biggest issue of our time – more dangerous, somehow, than even nuclear war.\n\nIn fact, some of them are even going so far as to pin the environment’s problems on capitalism, insisting that global capitalism is at the heart of every evil facing the world right now.\n\nAccording to these alarmists, the world is going to end soon because there is too much carbon dioxide in the atmosphere and we need to do everything we can to reverse it. And it’s shocking just how urgent those who buy into this notion seem to think the matter is.\n\nAt the UN Climate Change Conference in December 2019 in Madrid, the so-called climate emergency was presented as being “the defining and most urgent issue of our time, and it cannot be avoided without a global shift away from fossil fuel dependency.”\n\nWhat they didn’t mention was that studies have shown that systematic scientific fraud has been undertaken to change temperature data to support the false narrative of global warming. The so-called catastrophic rise in average global temperatures is part of a scam to profit from carbon tax schemes.\n\nMore than 31,000 scientists have signed a petition that includes peer-reviewed research warning the U.S. about signing international treaties that will place a financial burden on the country and restrict our energy production. A letter being circulated with the petition from the president of the U.S. National Academy of Sciences warns about the flawed science against carbon dioxide, which is actually necessary for life on the planet to thrive rather than the dangerous pollutant we need to get rid of that many claim it to be.\n\nThe truth is that the environment is very complicated and is governed by very complex processes. It cannot all be boiled down to CO2 emissions, and it’s certainly not the most pressing issue of our time.\n\nIgnoring the threat of nuclear war could be a catastrophic mistake\n\nMuch of the climate debate is just a big distraction. Thanks to the false global warming narrative, the public is so focused on manufactured and misguided environmental concerns that they aren’t paying enough attention to the growing nuclear threat that could do far more damage to us than any aging car or factory smokestack.\n\nInstead of worrying about how carbon dioxide is going to make us all extinct – which, ironically, it very well may if we reduce it too much – we should be focusing on a far more pressing issue: the fact that nine countries – the U.S., China, France, Israel, India, North Korea, Pakistan, the UK and Russia – have nearly 14,000 nuclear weapons combined.\n\nNearly 2,000 of these are in high alert status, which means they could be launched within just minutes. And these are weapons that are significantly more powerful than the Hiroshima bomb – by as much as 12 times.\n\nIn the past week, Russia has been testing out its hypersonic Mach 8 Zircon missile, which is said to be Putin’s missile of choice for hitting American cities during a nuclear conflict. The country also made a military show of strength by having a trio of its nuclear ballistic missile submarines smash their way through Arctic ice. Together, the three submarines are capable of 28,800 kilotons of firepower; the explosion at Hiroshima was just 16 kilotons.\n\nHow is the fact that there are enough nuclear bombs out there to destroy life on our planet a few times over getting pushed aside over worries about carbon dioxide, something we all need to survive?", "opengraph": {"title": "Global warming and capitalism: Is CO2 more dangerous than impending nuclear war?", "type": "article", "url": "https://www.climate.news/2021-06-15-global-warming-capitalism-co2-nuclear-war.html", "site_name": "Climate News", "description": "If you listen to the climate alarmists, you might be forgiven for believing that carbon dioxide is the biggest issue of our time – more dangerous, somehow, than even nuclear war. In fact, some of them are even going so far as to pin the environment’s problems on capitalism, insisting that global capitalism is at […]", "image": "https://www.climate.news/wp-content/uploads/sites/381/2022/03/Explosion-Nuclear-Bomb-Atomic-Mushroom-Apocalypse-War_906744023.jpg"}, "tags": ["conspiracy", "climate change", "lies", "nuclear weapons", "nuclear war", "capitalism", "environment", "global warming", "carbon dioxide", "propaganda", "war", "science fraud"], "tweets": [], "movies": [], "links": ["https://www.globalresearch.ca/global-warming-and-the-ozone-layer-whats-more-dangerous-co2-or-nuclear-war/5690216", "https://www.naturalnews.com/2017-07-25-global-warming-bombshell-systematic-science-fraud-revealed-in-alteration-of-temperature-data.html", "https://www.naturalnews.com/2017-09-21-over-31000-scientists-say-global-warming-is-a-total-hoax-now-theyre-speaking-out-against-junk-science.html", "https://www.brighteon.tv", "https://extinction.news/", "https://www.globalresearch.ca/global-warming-and-the-ozone-layer-whats-more-dangerous-co2-or-nuclear-war/5690216", "https://www.naturalnews.com/2017-07-25-global-warming-bombshell-systematic-science-fraud-revealed-in-alteration-of-temperature-data.html", "https://www.naturalnews.com/2017-09-21-over-31000-scientists-say-global-warming-is-a-total-hoax-now-theyre-speaking-out-against-junk-science.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fclimatenews%2F2021-06-15-global-warming-capitalism-co2-nuclear-war.html&linkname=Global%20warming%20and%20capitalism%3A%20Is%20CO2%20more%20dangerous%20than%20impending%20nuclear%20war%3F", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}