{"result_id": "072009", "URL": "https://www.climate.news/2022-09-06-world-economic-forum-drinking-recycled-sewage-future.html", "timestamp": "2023-04-25 14:45:15 CEST+0200", "meta": {"description": "So-called “toilet-to-tap” drinking water – meaning water that is recycled through the sewer system and fed back through people’s taps – is going global, thanks to the World Economic Forum (WEF). What up until now has just been a slow-transition experiment in places like Southern California is the new blueprint for watering the world, according […]", "lang": "en", "keywords": "badhealth,clean water,Climate,climate alarmism,drinking water,environment,globalists,great reset,green tyranny,gross,insanity,living free,propaganda,recycled sewage,toilet to tap,Water Wars,weather,wef,world economic forum", "favicon": "wp-content/themes/ScienceTheme/images/Climate-fav.png", "canonical": "https://www.climate.news/2022-09-06-world-economic-forum-drinking-recycled-sewage-future.html", "encoding": "UTF-8"}, "image": null, "domain": "www.climate.news", "title": "World Economic Forum-linked “expert” says “drinking recycled sewage is the future”", "cleaned_text": "World Economic Forum-linked “expert” says “drinking recycled sewage is the future”\n\nSo-called “toilet-to-tap” drinking water – meaning water that is recycled through the sewer system and fed back through people’s taps – is going global, thanks to the World Economic Forum (WEF).\n\nWhat up until now has just been a slow-transition experiment in places like Southern California is the new blueprint for watering the world, according to the globalist outfit, which is also pushing the infamous “Great Reset.” (Related: The WEF also openly bragged in a recent promotional video about communist China chemtrail-ing the world to fight global warming.)\n\nIn order to maximize “sustainability” and ensure a “green” future, the WEF says that the peons of the world will have to drink reclaimed sewage water. The Times writer Sir James Bevan agrees, having written in a recent op-ed that “drinking recycled sewage is the future.”\n\nBevan’s views, by the way, are a reiteration of WEF doctrines that have been circulating for several years now. Both Bevan and the WEF agree that the world is drying up due to “climate change,” and that the only way to ensure enough water for everyone is to send it from toilet back to tap.\n\n“The recent rainfall hasn’t changed the underlying position in this country: many parts are likely to stay in drought for months, and if we have a dry winter then next year will be even more challenging,” Bevan writes.\n\n“We will need to be less squeamish about where our drinking water comes from. Part of the solution will be to reprocess the water that results from sewage treatment and turn it back into drinking water – perfectly safe and healthy, but not something many people fancy.”\n\nEPA claims that 10 areas across America are in worsening drought status\n\nAs of this writing, large swaths of primarily the American West and Southwest are under serious drought conditions. The Environmental Protection Agency (EPA) has named 10 different areas as facing drought conditions that threaten their water supplies.\n\nBevan’s solution, which is also the WEF’s solution, is to force everyone to drink and bathe in water that was previously urinated and defecated in before getting flushed down the toilet.\n\nBevan says people need to “change the way they think about water” by agreeing to use recycled water rather than pure water from the earth.\n\n“If we are going to get there, we are all going to have to think differently,” he goes on to write. “Some of these measures will be unpopular, so future governments will need to show political will.”\n\nThinking back to basic high school science, it is important to keep in mind that there is a fixed amount of water on planet earth. That water moves around from place to place in different forms, which can make it seem like it is “drying up” in some places, but the fact remains that water is a fixed resource.\n\nWith that in mind, if there are drought conditions in one area, chances are there is an excess of water somewhere else. It is just a matter of harnessing water from wherever it is available – and after using it, allowing the earth to filter and replenish our natural resources.\n\nTo suggest that we must all start drinking filtered urine and diarrhea in order to “cool” the planet for a sustainable future is just more unscientific lunacy. This is about control, not preserving precious natural resources.\n\n“The entire cabal should be forced to drink this filth and eat the bugs they want to force on us,” wrote a commenter. “After they’ve received all the poison vaccines they created, of course.”\n\nThe latest news coverage about the WEF and the globalist agenda can be found at Globalism.news.", "opengraph": {"title": "World Economic Forum-linked “expert” says “drinking recycled sewage is the future”", "type": "article", "url": "https://www.climate.news/2022-09-06-world-economic-forum-drinking-recycled-sewage-future.html", "site_name": "Climate News", "description": "So-called “toilet-to-tap” drinking water – meaning water that is recycled through the sewer system and fed back through people’s taps – is going global, thanks to the World Economic Forum (WEF). What up until now has just been a slow-transition experiment in places like Southern California is the new blueprint for watering the world, according […]", "image": "https://www.climate.news/wp-content/uploads/sites/381/2022/09/Pollution-Water-River-Waste-Sewage.jpg"}, "tags": ["weather", "recycled sewage", "great reset", "Climate", "world economic forum", "living free", "globalists", "toilet to tap", "clean water", "gross", "environment", "drinking water", "green tyranny", "insanity", "wef", "propaganda", "Water Wars"], "tweets": [], "movies": [], "links": ["https://newspunch.com/drinking-recycled-sewage-is-the-future-dont-be-squeamish-says-wef-linked-expert/", "https://naturalnews.com/2022-08-11-wef-china-controlling-weather-cloud-seeding-chemtrails.html", "https://www.brighteon.tv", "http://globalism.news", "https://newspunch.com/drinking-recycled-sewage-is-the-future-dont-be-squeamish-says-wef-linked-expert/", "https://naturalnews.com/2022-08-11-wef-china-controlling-weather-cloud-seeding-chemtrails.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fclimatenews%2F2022-09-06-world-economic-forum-drinking-recycled-sewage-future.html&linkname=World%20Economic%20Forum-linked%20%E2%80%9Cexpert%E2%80%9D%20says%20%E2%80%9Cdrinking%20recycled%20sewage%20is%20the%20future%E2%80%9D", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}