{"result_id": "072029", "URL": "https://climate.news/2022-10-18-left-wing-environmentalists-in-germany-praying-for-warm-winter.html", "timestamp": "2023-04-25 14:45:29 CEST+0200", "meta": {"description": "The one thing you can count on when it comes to the left is hypocrisy and boatloads of it. For years, Western environmentalists have screamed about ‘warming winters’ signaling the end of the planet, thanks to ‘human-caused climate change’ — which, by the way, and regardless of what ‘official agencies’ say, is only a theory, […]", "lang": "en", "keywords": "absurd,Collapse,electricity,energy collapse,energy supply,fossil fuel shortage,fossil fuels,freezing temperatures,fuel supply,Germany,green energy,green living,green tyranny,greens,hypocrisy,lunatics,outrage,power,power grid,supply chain,winter", "favicon": "wp-content/themes/ScienceTheme/images/Climate-fav.png", "canonical": "https://climate.news/2022-10-18-left-wing-environmentalists-in-germany-praying-for-warm-winter.html", "encoding": "UTF-8"}, "image": null, "domain": "climate.news", "title": "WARMING NOW GOOD: Left-wing environmentalists in Germany now pray for warm winter amid coming energy shortage, skyrocketing prices", "cleaned_text": "WARMING NOW GOOD: Left-wing environmentalists in Germany now pray for warm winter amid coming energy shortage, skyrocketing prices\n\nThe one thing you can count on when it comes to the left is hypocrisy and boatloads of it.\n\nFor years, Western environmentalists have screamed about ‘warming winters’ signaling the end of the planet, thanks to ‘human-caused climate change’ — which, by the way, and regardless of what ‘official agencies’ say, is only a theory, and an unproven theory at that.\n\nNowhere have their shouts of warm winter doom and gloom been so shrill than in Germany, where lunatic leftism appears to be a citizenship requirement these days. For the past decade especially, ‘green energy’ pushes have led the country to begin shuttering coal and natural gas plants and even zero-emission nuclear power stations in favor of highly unreliable “renewable” energy like wind and solar. Not only are these technologies overrated, the ability for Germany to produce energy from wind and solar is severely limited like it is everywhere else on the planet. Plus, in addition to being unreliable (no wind and no sun equals little-to-no electricity production), natural gas and other fossil fuels are far cheaper and, with today’s technology, burn much cleaner than they did at the turn of the current century.\n\nNevertheless, now that Germany is shunning Russian natural gas over Vladimir Putin’s invasion of Ukraine, Berlin’s government officials and the country’s energy experts are warning that it’s going to be difficult to cheaply provide enough energy to heat homes this winter — which has left Germany’s “greens” to pray for a (wait for it) warm winter — the same kind they claim are the result of human climate change.\n\n“Now that Germany’s energy supply crisis is dangerously intensifying, Federal Economics Minister Robert Habeck (Green Party) is desperately scrambling for ways to somehow get the country through the winter without the gas supply running out and millions of people freezing,” says a post at Watts Up With That. “One way is pleading for Germans to turn the heat in their homes way down in order not to deplete the gas supply before the cold weather ends next May. But that alone won’t be enough.\n\n“Now, ironically, Habeck is also hoping for a warmer winter to bail out the country from its energy crisis. A warm winter will mean burning less gas and help the country avoid untold misery. Alas – warming is rescue!” the post continued.\n\nIn September, Habeck declared, “If everything goes well in terms of saving gas and we are lucky with the weather, then we have a chance of getting through the winter well.” In other words, he is hoping for exactly the kind of winter he and other ‘greens’ have hysterically warned about — not the winters full of tundra-like temperatures and mountains of snow like they have wished for.\n\n“To deal with the looming winter energy crisis, most countries in Europe are aiming to save 15 percent. In Germany, however, the government is pushing for savings of 20 percent, and warm winters are welcome again,” the WUWT post concluded.\n\nTo be honest, though, Germany’s energy shortages are not due entirely to the loss of Russian gas. They are the result of years’ worth of blind worship at the altar of ‘climate change.’ A Natural News report from a year ago noted that Germans are getting less and less energy from reliable fossil fuel-burning plants and more of it from wind and solar power, both of which are far more expensive and entirely reliant on the weather — all because their leaders believe cattle methane and SUVs are destroying the planet.\n\nEven last year as winter approached, energy prices began to skyrocket in part because what remains of fossil-fuel-generating power plants are running out of fossil fuels to burn for power generation, according to Bloomberg News:\n\nThe global energy crunch forced a German electricity producer to halt a power plant after it ran out of coal.\n\nSteag GmbH closed its Bergkamen-A plant in the western part of the country this week due to shortages of hard coal, it said by email. The closure is the first sign that Europe may need to count on mild and windy weather to keep the lights on as the continent faces shortages of natural gas and coal is unlikely to come to rescue.\n\nThis is lunacy on a galactic scale. Germans are going to freeze to death this winter and the best solution their left-wing leaders have is to hypocritically hope for warm temperatures.", "opengraph": {"title": "WARMING NOW GOOD: Left-wing environmentalists in Germany now pray for warm winter amid coming energy shortage, skyrocketing prices", "type": "article", "url": "https://www.climate.news/2022-10-18-left-wing-environmentalists-in-germany-praying-for-warm-winter.html", "site_name": "Climate News", "description": "The one thing you can count on when it comes to the left is hypocrisy and boatloads of it. For years, Western environmentalists have screamed about ‘warming winters’ signaling the end of the planet, thanks to ‘human-caused climate change’ — which, by the way, and regardless of what ‘official agencies’ say, is only a theory, […]", "image": "https://www.climate.news/wp-content/uploads/sites/381/2022/10/Electricity-Power-Out-Cold-Freeze-Man-Indoors-Home.jpg"}, "tags": ["fuel supply", "energy collapse", "lunatics", "green energy", "winter", "energy supply", "absurd", "greens", "electricity", "power grid", "Germany", "fossil fuel shortage", "supply chain", "hypocrisy", "power", "outrage", "freezing temperatures", "green living", "fossil fuels", "Collapse", "green tyranny"], "tweets": [], "movies": [], "links": ["https://www.brighteon.tv", "https://wattsupwiththat.com/2022/10/14/irony-greens-now-praying-for-a-warmer-winter-to-help-germany-survive-energy-crisis/", "http://www.climatealarmism.news", "https://naturalnews.com/2021-10-06-germans-energy-collapse-hastens-power-plant-runs-out-coal.html", "https://www.bloomberg.com/news/articles/2021-10-01/energy-crisis-forces-german-power-plant-to-halt-on-lack-of-coal?sref=6uww027M", "https://wattsupwiththat.com/2022/10/14/irony-greens-now-praying-for-a-warmer-winter-to-help-germany-survive-energy-crisis/", "https://naturalnews.com/2021-10-06-germans-energy-collapse-hastens-power-plant-runs-out-coal.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fclimatenews%2F2022-10-18-left-wing-environmentalists-in-germany-praying-for-warm-winter.html&linkname=WARMING%20NOW%20GOOD%3A%20Left-wing%20environmentalists%20in%20Germany%20now%20pray%20for%20warm%20winter%20amid%20coming%20energy%20shortage%2C%20skyrocketing%20prices", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}