{"result_id": "072004", "URL": "https://climate.news/2022-04-06-sierra-snowpack-lowest-levels-70-years-california-drought.html", "timestamp": "2023-04-25 14:45:12 CEST+0200", "meta": {"description": "California’s three-year drought appears to be growing more severe as the Sierra Nevada snowpack, which provides 30 percent of the state’s water supply, is currently at one of its lowest levels in over seven decades. Automatic sensors spread across the massive mountain range show that snowpack levels are about 39 percent of normal levels. Dozens of […]", "lang": "en", "keywords": "badclimate,California,Climate,climate change,Drought,food,Gavin Newsom,rain,Sierra Mountains,snow storm,snowpack,water,water conservation,water police", "favicon": "wp-content/themes/ScienceTheme/images/Climate-fav.png", "canonical": "https://climate.news/2022-04-06-sierra-snowpack-lowest-levels-70-years-california-drought.html", "encoding": "UTF-8"}, "image": null, "domain": "climate.news", "title": "Sierra snowpack falls to one of lowest levels in 72 years, perpetuating California drought", "cleaned_text": "Sierra snowpack falls to one of lowest levels in 72 years, perpetuating California drought\n\nCalifornia’s three-year drought appears to be growing more severe as the Sierra Nevada snowpack, which provides 30 percent of the state’s water supply, is currently at one of its lowest levels in over seven decades.\n\nAutomatic sensors spread across the massive mountain range show that snowpack levels are about 39 percent of normal levels. Dozens of California communities risked running out of water last fall due to drought conditions.\n\nAccording to reports, the April 1 Sierra snow reading is traditionally considered to be the most important of the year from a water supply standpoint. Since very little snow falls after this date, whatever measurements are gathered tend to be an accurate indicator for what farmers, city planners and wildlife agencies can expect.\n\nLast year on April 1, snowpack levels measured at around 62 percent of normal. That has since dropped by more than a third.\n\nGoing back to 1950, there have only been five other times that snow levels were less on April 1 than they currently are. All of them occurred during major droughts: in 2015 (five percent of normal), 2014 (25 percent), 1977 (25 percent), 1988 (29 percent), and 1976 (37 percent).\n\n“There was so much fanfare in December about the drought being over,” said Andrew Schwartz, lead scientist at the University of California Berkeley Central Sierra Snow Laboratory near Donner Summit west of Lake Tahoe.\n\n“We had a record-breaking December and have gotten very little if anything since.”\n\nIn December, Schwartz’s station at 6,800-feet elevation in Soda Springs received two feet of snow from several large atmospheric river storms. These are the largest in modern times since records began in 1970.\n\nStrangely, everything stopped right after those storms and it has been mostly dry ever since then. In January, February and March combined, only 41 inches of snow fell, which is about 19 percent of the historical average for those three months.\n\n“We’ve still got some snow up here,” Schwartz said. “It’s not barren. But it has definitely started melting. We’ve lost about a foot in the last week. We’re starting to see bigger patches of soil.”\n\nSimilar conditions exist elsewhere in the state. In January, February and March, only 1.13 inches of rain fell on San Francisco, which represents a 173-year low for that three-month period, at least since records started being kept during the Gold Rush of 1849.\n\nThankfully for the Golden State, October and December of last year saw sizable storms, otherwise the Sierra snowpack would be even lower. The same goes for San Francisco and other areas, which also saw rainfall during these months.\n\n“This is the third year in a row of drought for sure,” says University of California Davis Center for Watershed Sciences Director Jay Lund.\n\n“We’ve had more precipitation in Northern California than we had last year, and a little more than in 2020. But we’ve had a very long, dry period with dry temperatures over the last three months, and that isn’t good. It’s drying out all the soils and evaporating the snowpack. We might get less runoff this year into the reservoirs than in 2020 or 2021.”\n\n“Experts” like Schwartz are of course blaming climate change for drought conditions. Even though such events have always occurred, global warming is apparently “making them more severe.”\n\nSince last year, all of California’s 58 counties have been in a drought emergency. Governor Gavin Newsom recently ordered the 420 largest water agencies in the state to increase water conservation by going to “level 2” of their drought contingency plans.\n\n“Dig deep,” wrote someone at Natural News about how California could help mitigate the problem. “Pure water is under the ground hundreds of feet below the surface. Just don’t let the water police see you.”\n\nMore related news coverage can be found at Collapse.news.", "opengraph": {"title": "Sierra snowpack falls to one of lowest levels in 72 years, perpetuating California drought", "type": "article", "url": "https://www.climate.news/2022-04-06-sierra-snowpack-lowest-levels-70-years-california-drought.html", "site_name": "Climate News", "description": "California’s three-year drought appears to be growing more severe as the Sierra Nevada snowpack, which provides 30 percent of the state’s water supply, is currently at one of its lowest levels in over seven decades. Automatic sensors spread across the massive mountain range show that snowpack levels are about 39 percent of normal levels. Dozens of […]", "image": "https://www.climate.news/wp-content/uploads/sites/381/2022/04/Trees-Grass-Mountain.jpg"}, "tags": ["water police", "Gavin Newsom", "snowpack", "Climate", "climate change", "rain", "Sierra Mountains", "water", "Drought", "water conservation", "snow storm", "food", "California"], "tweets": [], "movies": [], "links": ["https://archive.ph/lONgi", "https://naturalnews.com/2021-08-04-dozens-california-communities-running-out-water-drought.html", "http://www.berkeley.edu", "https://www.brighteon.tv", "http://www.ucdavis.edu", "http://collapse.news", "https://archive.ph/lONgi", "https://naturalnews.com/2021-08-04-dozens-california-communities-running-out-water-drought.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fclimatenews%2F2022-04-06-sierra-snowpack-lowest-levels-70-years-california-drought.html&linkname=Sierra%20snowpack%20falls%20to%20one%20of%20lowest%20levels%20in%2072%20years%2C%20perpetuating%20California%20drought", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}