{"result_id": "072021", "URL": "https://www.climate.news/2019-08-14-google-taking-sides-on-medicine-cancer-vaccines-gmos-climate-change.html", "timestamp": "2023-04-25 14:45:24 CEST+0200", "meta": {"description": "With the most recent Google “Core” update, which took place in June, substantial changes were made to the search results that users pull up when querying topics like vaccine safety, genetically-modified organisms (GMOs), cancer, pharmaceuticals, and climate change – with Google, as you probably well know, now actively censoring independent viewpoints that run contrary to […]", "lang": "en", "keywords": "antitrust,bias,big pharma sellout,cancer,Censorship,climate change,content publisher,controlling the narrative,deplatformed,evil corporationf,GMOs,Google,information control,manipulation,medicine,ministry of propaganda,sellout,suppressed information,thought control,Tyranny,vaccines", "favicon": "wp-content/themes/ScienceTheme/images/Climate-fav.png", "canonical": "https://www.climate.news/2019-08-14-google-taking-sides-on-medicine-cancer-vaccines-gmos-climate-change.html", "encoding": "UTF-8"}, "image": null, "domain": "www.climate.news", "title": "Google now taking sides on key issues like medicine, cancer, vaccines, GMOs, climate change and more, and working to obliterate all views that Google doesn’t endorse", "cleaned_text": "Google now taking sides on key issues like medicine, cancer, vaccines, GMOs, climate change and more, and working to obliterate all views that Google doesn’t endorse\n\nWith the most recent Google “Core” update, which took place in June, substantial changes were made to the search results that users pull up when querying topics like vaccine safety, genetically-modified organisms (GMOs), cancer, pharmaceuticals, and climate change – with Google, as you probably well know, now actively censoring independent viewpoints that run contrary to the controlled narrative on these and other controversial issues.\n\nQuite obviously veering from its “don’t be evil” motto of old, Google has decided to now be only evil by willfully manipulating the information that the world is allowed to access through its platform. Rather than encourage free thought and open debate, in other words, Google wants you and everyone else to simply accept what the government and media claim is true about medicine, food, and weather patterns.\n\nWhile it was once the case that Google fomented an internet culture of freedom and honest expression, its new fascist policies aim to ensure that everyone thinks exactly the same as everyone else about concepts like “herd immunity” and “science-based medicine.” There’s simply no room for independent thought when it comes to such topics, at least according to Google’s new “thought police,” which are working overtime to make sure that internet users are only able to access pre-approved propaganda.\n\nWhat this has led to is the systematic removal of websites, pages, and channels that take what you might call an “alternative” approach to accessing and processing news and other information. Natural News, for instance, was recently de-platformed not only by Google, but also by Facebook, Twitter, and YouTube, the latter of which is owned by Google.\n\n“Websites [that] promote or provide a platform for critical perspectives of vaccine safety, questioning the lack of safety studies or vaccine efficacy, found that Google has unilaterally removed the search traffic they once enjoyed, without engaging in any debate or providing any notice, or any explanation!” explains GreenMedInfo.\n\nRather than censor politically incorrect information, why doesn’t Google fund the science necessary to end the vaccine debate once and for all?\n\nGoogle has been trying extra hard to whitewash this digital “book-burning” by claiming that it’s necessary to “save lives” and prevent users from accessing “misinformation” that might harm them. With vaccines, as perhaps the most prominent example, Google doesn’t want anyone to question either their safety nor effectiveness, because any honest inquiry outside of Big Pharma’s own “studies” and claims allegedly puts public health at risk.\n\n“Are mottos like ‘don’t be evil’ or ‘make the world better’ compatible with unilaterally and secretly deciding what specific information is made available to the public by removing honest disagreements and controversial sources of information (claimed to be misinformation), while quietly choosing which narrative will prevail?” asks GreenMedInfo about how Google is somehow trying to justify this tyranny.\n\nThis would seem to be the first time in Google’s history that the company has taken a side with regards to information, as opposed to simply providing the information that people want, no questions asked. Since the multinational corporation has clearly changed course, and is now acting as a content publisher rather than a content provider, it’s more than time for this Silicon Valley conglomerate to be held accountable for breaking antitrust laws, among other crimes.\n\n“Because it has not been proven scientifically that there are no extra risks (with vaccines), the only way to settle this debate is to do the science, not [compel] large tech companies to do the bidding of the vaccine companies,” GreenMedInfo contends.\n\n“This cannot bode well for their reputation which is already on shaky ground, especially if in the future, scientific studies end up proving the risks are higher than currently accepted.”\n\nFor more related news, be sure to check out Censorship.news.", "opengraph": {"title": "Google now taking sides on key issues like medicine, cancer, vaccines, GMOs, climate change and more, and working to obliterate all views that Google doesn’t endorse", "type": "article", "url": "https://www.climate.news/2019-08-14-google-taking-sides-on-medicine-cancer-vaccines-gmos-climate-change.html", "site_name": "Climate News", "description": "With the most recent Google “Core” update, which took place in June, substantial changes were made to the search results that users pull up when querying topics like vaccine safety, genetically-modified organisms (GMOs), cancer, pharmaceuticals, and climate change – with Google, as you probably well know, now actively censoring independent viewpoints that run contrary to […]", "image": "https://www.climate.news/wp-content/uploads/sites/381/2019/08/Evil-Tower-of-Google.jpg"}, "tags": ["Google", "manipulation", "information control", "GMOs", "climate change", "big pharma sellout", "content publisher", "evil corporationf", "bias", "medicine", "sellout", "antitrust", "deplatformed", "controlling the narrative", "ministry of propaganda", "Tyranny", "cancer", "Censorship", "thought control", "vaccines", "suppressed information"], "tweets": [], "movies": [], "links": ["https://www.greenmedinfo.com/blog/google-takes-position-controversial-vaccine-safety-debate", "https://www.naturalnews.com/2019-04-04-natural-news-is-now-de-platformed-by-twitter-youtube-and-google.html", "https://www.brighteon.tv", "http://censorship.news", "https://www.greenmedinfo.com/blog/google-takes-position-controversial-vaccine-safety-debate", "https://www.naturalnews.com/2019-04-04-natural-news-is-now-de-platformed-by-twitter-youtube-and-google.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fclimatenews%2F2019-08-14-google-taking-sides-on-medicine-cancer-vaccines-gmos-climate-change.html&linkname=Google%20now%20taking%20sides%20on%20key%20issues%20like%20medicine%2C%20cancer%2C%20vaccines%2C%20GMOs%2C%20climate%20change%20and%20more%2C%20and%20working%20to%20obliterate%20all%20views%20that%20Google%20doesn%E2%80%99t%20endorse", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}