{"result_id": "072003", "URL": "https://climate.news/2023-01-25-siemens-one-billion-people-stop-eating-meat.html", "timestamp": "2023-04-25 14:45:11 CEST+0200", "meta": {"description": "It’s a wonder the “leaders” at the World Economic Forum aren’t wearing swastikas on their jackets while they warn the planet about the grim future where there’s no more real meat and all the peons are eating insects and seaweed to survive. A keynote speaker, the chairman of the infamous German manufacturing giant Siemens, Mr. […]", "lang": "en", "keywords": "badfood,badhealth,climate alarmism,climate change,concentration camps,conspiracy,Davos,enslaved,fake meat,food collapse,food supply,frankenfood,global warming,globalists,great reset,green tyranny,insanity,insects,nazi company,pollution,propaganda,siemens,slave labor,wef", "favicon": "wp-content/themes/ScienceTheme/images/Climate-fav.png", "canonical": "https://climate.news/2023-01-25-siemens-one-billion-people-stop-eating-meat.html", "encoding": "UTF-8"}, "image": null, "domain": "climate.news", "title": "Industry giant Siemens, which once ran forced labor camps for the Nazi regime in Germany, calls for ONE BILLION PEOPLE to stop eating meat", "cleaned_text": "Industry giant Siemens, which once ran forced labor camps for the Nazi regime in Germany, calls for ONE BILLION PEOPLE to stop eating meat\n\nIt’s a wonder the “leaders” at the World Economic Forum aren’t wearing swastikas on their jackets while they warn the planet about the grim future where there’s no more real meat and all the peons are eating insects and seaweed to survive. A keynote speaker, the chairman of the infamous German manufacturing giant Siemens, Mr. Jim Hagemann Snabe, claims there won’t be any real meat from animals soon, just lab-concocted synthetic meat stuff for “mobilizing for climate” change and the “great reset.” According to the chairman of a company that was the biggest industrial conglomerate for the Nazi slave labor camps, a billion people should stop eating meat in order to save the world from global warming.\n\nEat cockroaches and grub worms, not meat, because the new Nazi globalists want to save the world from the boiling oceans and toxic rain bombs\n\nAre you wondering what the menu looked like at the WEF convention in Davos, Switzerland this year? Filet mignon and organic vegetables? Are you also wondering why all the globalists who attended demanded their private jet pilots be unvaccinated for Covid? No, the globalists do NOT practice what they preach, it’s all just smoke and mirrors for crippling society while they bankroll off Ponzi schemes and insidious scamdemics.\n\nIn fact, Mr. Snabe, the keynote speaker at WEF this year, who holds a powerful position at Siemens AG, Europe’s biggest industrial manufacturing company, represents a company that used slave labor for Nazi armaments in WWII by the hundreds of thousands. Prisoners of war at the concentration camps worked for the “death through work” program that Siemens headed up at the factories inside the death camps of Auschwitz, Buchenwald, Mauthausen, Ravensbruck, Flossenburg, and Sachsenhausen.\n\nSo now, the new age Nazis and Communists, who want to “Master the World,” are telling everyone else to stop washing their clothes, stop eating meat, stop driving vehicles, and eat cockroaches and grub worms, if they care about the world and want to keep all the humans from bursting into flames.\n\nSupposedly, the whole earth is going to be like a Nazi concentration camp gas chamber if all the peons and paupers don’t stop polluting it by eating cows and driving cars that use fuel. “Mobilizing for Climate” requires everyone to give all their “money, money, money” to the already-filthy-rich globalists that will spray chemicals in the atmosphere to block the sun and save the planet (they’ve obviously been watching too many Marvel movies).\n\n“Great Reset” calls for every human to be force-vaccinated, give all their money to Nazi companies, plus eat insects and lab-concocted Franken-food\n\n“God is Dead,” the leaders of the New World Order at the Davos WEF convention tell us. Listen to your new masters, and gobble insects instead of cows and chickens, and you won’t burst into flames and drown in the boiling oceans.\n\n“If a billion people stop eating meat, I tell you, it has a big impact. Not only does it have a big impact on the current food system, but it will also inspire innovation of food systems.” The filthy rich self-anointed speakers at the WEF claim they are being instilled with “divine powers” to rule the universe and force all the peons to be injected with billions of deadly spike proteins, walk to work, eat lab meat, seaweed and cockroaches for all future meals.\n\nSupposedly, it’s the food we eat that’s responsible for the majority of CO2 emissions that are killing off all the cows, chickens, turkeys, and pigs. If everyone would just eat Bill Gates’ Frankenfoods, with a side of centipedes and slugs, then we can save the Godless planet from sure doom and destruction.\n\nThe disastrous “Green” agenda will cripple the whole world’s economy, wreck all agricultural systems, and cause worldwide famine like we’ve never seen. Forget about the atmosphere, droughts, and floods, because the “Masters of the Universe” (rich freaks of the WEF) are here to wreck the world for us. Just send them all your money and keep your Covid mask on tight, and everything will be just fine. Sure.\n\nKeep your truth news in check by adding Preparedness.news to your favorites list and tuning in daily for updates on real news about the surviving and thriving in the near future, without taking advice from Nazis and athiests freaks that think they run the world right now.", "opengraph": {"title": "Industry giant Siemens, which once ran forced labor camps for the Nazi regime in Germany, calls for ONE BILLION PEOPLE to stop eating meat", "type": "article", "url": "https://www.climate.news/2023-01-25-siemens-one-billion-people-stop-eating-meat.html", "site_name": "Climate News", "description": "It’s a wonder the “leaders” at the World Economic Forum aren’t wearing swastikas on their jackets while they warn the planet about the grim future where there’s no more real meat and all the peons are eating insects and seaweed to survive. A keynote speaker, the chairman of the infamous German manufacturing giant Siemens, Mr. […]", "image": "https://www.climate.news/wp-content/uploads/sites/381/2023/01/crickets.jpg"}, "tags": ["conspiracy", "great reset", "climate change", "food collapse", "globalists", "insects", "slave labor", "global warming", "wef", "propaganda", "enslaved", "frankenfood", "insanity", "fake meat", "concentration camps", "food supply", "green tyranny", "siemens", "nazi company", "Davos"], "tweets": [], "movies": [], "links": ["http://globalism.news", "https://historycollection.com/10-famous-companies-collaborated-nazi-germany/6/", "https://www.brighteon.tv", "https://naturalnews.com/2022-11-28-klaus-schwab-god-is-dead.html", "https://www.breitbart.com/europe/2023/01/20/great-reset-siemens-chief-calls-for-billion-people-to-stop-eating-meat-at-world-economic-forum/", "http://foodevolution.news", "https://www.preparedness.news/2022-08-19-12-ways-prep-without-spending-too-much.html", "https://www.naturalnews.com/2022-07-28-dna-testing-kits-scam-ethnicity-specific-bioweapons.html", "https://naturalnews.com/2022-11-28-klaus-schwab-god-is-dead.html", "https://www.breitbart.com/europe/2023/01/20/great-reset-siemens-chief-calls-for-billion-people-to-stop-eating-meat-at-world-economic-forum/", "https://historycollection.com/10-famous-companies-collaborated-nazi-germany/6/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fclimatenews%2F2023-01-25-siemens-one-billion-people-stop-eating-meat.html&linkname=Industry%20giant%20Siemens%2C%20which%20once%20ran%20forced%20labor%20camps%20for%20the%20Nazi%20regime%20in%20Germany%2C%20calls%20for%20ONE%20BILLION%20PEOPLE%20to%20stop%20eating%20meat", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}