{"result_id": "072019", "URL": "https://www.climate.news/2023-02-03-electric-vehicles-are-a-scam-heres-why.html", "timestamp": "2023-04-25 14:45:22 CEST+0200", "meta": {"description": "There is a disturbing overlap between the marketing that was used to sell masks and “vaccines” during the covid scamdemic and the push to convert society to electric vehicles (EVs) only. We are told that in order to save the planet from “global warming” and “climate change,” all gas-powered vehicles – and now gas stoves […]", "lang": "en", "keywords": "cars,Climate,climate alarmism,conspiracy,deception,electric,electric vehicles,electricity,energy supply,EV,fraud,green cult,green tyranny,left cult,power,power grid,products,scam", "favicon": "wp-content/themes/ScienceTheme/images/Climate-fav.png", "canonical": "https://www.climate.news/2023-02-03-electric-vehicles-are-a-scam-heres-why.html", "encoding": "UTF-8"}, "image": null, "domain": "www.climate.news", "title": "Electric vehicles are a SCAM – here’s why", "cleaned_text": "There is a disturbing overlap between the marketing that was used to sell masks and “vaccines” during the covid scamdemic and the push to convert society to electric vehicles (EVs) only.\n\nWe are told that in order to save the planet from “global warming” and “climate change,” all gas-powered vehicles – and now gas stoves – must go. Is there any truth to this? The answer is of course not.\n\nTake the claimed ranges, for instance. Whatever you hear about the distance an EV can travel in one charge, cut that in half during the winter season and you have a more accurate reading. Then there’s load and towing capacity, the figures for which are also overblown.\n\n“…in the case of electric trucks – when used to do the things trucks are expected to do, such as pull a trailer… Instead they were only told – as in the case of Ford’s F-150 Lightning electric truck – that it could pull a 10,000 pound trailer. Which is true. Just not for long. Or rather, far,” reports Eric Peters Autos about this deception.\n\n“Left out was the relevant fact that if they attempted to actually pull a trailer, they’d be stopping for a lengthy recharge every 80 miles or so. They were also told they could recharge at home – which is also true. As far as it goes.”\n\n“But they were not told how very long that takes. Instead, they were led to believe they could get going again in only 30-45 minutes or so. But that is only possible by visiting so-called ‘fast’ chargers, which are not at home.”\n\nEVs are dirty, dangerous, and unreliable: why does the green cult like them again?\n\nJerome Corsi, writing for American Thinker, also tackled this subject, noting that there is nothing economically viable about converting to EVs.\n\nThe entire EV push is driven by ideology rather than practicality or what he describes as “rational economic calculation.” This is part of the reason why four Wyoming state senators and two representatives have introduced a bill to ban all sales of EVs in Wyoming by the year 2035.\n\n“Wyoming’s vast stretches of highway, coupled with a lack of electric vehicle charging infrastructure, make the widespread use of electric vehicles impracticable for the state,” reads Senate Joint Resolution No. SJ004, adding that “the batteries used in electric vehicles contain critical minerals whose domestic supply is limited and at risk of disruption.”\n\nShould left-wingers devoted to green causes ever successfully ban the sale of gas-powered vehicles, especially if the ban includes industrial and commercial vehicles, there are major safety and reliability implications to consider as well. What happens when an EV semi-truck dies by the side of the road in the middle of a blizzard in the middle of nowhere? What will become of the driver and his payload?\n\nThen there are the environmental implications of continuing to have child slave laborers dig up all the rare-earth minerals needed to produce EV batteries, which the same proposed legislation in Wyoming warns “are not easily recyclable or disposable, meaning that landfills in Wyoming and elsewhere will be required to develop practices to dispose of these minerals in a safe and responsible manner.”\n\nFinally, where is all that extra electricity going to come from to charge these things? There are already electric infrastructure problems plaguing certain states at certain times of the year because the current setup is inadequate even for existing quantities of EVs out on the road. What will happen once the entire country is converted to EVs?\n\n“They don’t care that it won’t work,” one commenter wrote about all this. “They want everyone to live in cities and only go where they are told by walking or riding a bike. You will own nothing and be happy.”\n\nThe latest news about the EV push and the lies that often accompany it can be found at GreenTyranny.news.", "opengraph": {"title": "Electric vehicles are a SCAM – here’s why", "type": "article", "url": "https://www.climate.news/2023-02-03-electric-vehicles-are-a-scam-heres-why.html", "site_name": "Climate News", "description": "There is a disturbing overlap between the marketing that was used to sell masks and “vaccines” during the covid scamdemic and the push to convert society to electric vehicles (EVs) only. We are told that in order to save the planet from “global warming” and “climate change,” all gas-powered vehicles – and now gas stoves […]", "image": "https://www.climate.news/wp-content/uploads/sites/381/2023/02/Zero-Emissions-Electric-Vehicle-Car-Green-Leaf.jpg"}, "tags": ["conspiracy", "Climate", "fraud", "electric vehicles", "energy supply", "left cult", "products", "green cult", "deception", "EV", "electricity", "power", "green tyranny", "scam", "electric", "cars", "power grid"], "tweets": [], "movies": [], "links": ["https://www.ericpetersautos.com/2023/01/27/first-they-lied-about-the-range/", "https://naturalnews.com/2022-09-08-climate-greenies-want-natural-gas-eliminated-climate-change.html", "https://www.brighteon.tv", "https://www.americanthinker.com/articles/2023/01/electric_vehicles_are_an_ideologically_driven_economic_misadventure.html", "http://greentyranny.news", "https://www.ericpetersautos.com/2023/01/27/first-they-lied-about-the-range/", "https://naturalnews.com/2022-09-08-climate-greenies-want-natural-gas-eliminated-climate-change.html", "https://www.americanthinker.com/articles/2023/01/electric_vehicles_are_an_ideologically_driven_economic_misadventure.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fclimatenews%2F2023-02-03-electric-vehicles-are-a-scam-heres-why.html&linkname=Electric%20vehicles%20are%20a%20SCAM%20%E2%80%93%20here%E2%80%99s%20why", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}