{"result_id": "072010", "URL": "https://climate.news/2019-03-12-greenpeace-founder-echoes-health-ranger-warning-aocs-green-new-deal-is-deadly-half-the-population-will-die.html", "timestamp": "2023-04-25 14:45:16 CEST+0200", "meta": {"description": "Patrick Moore is the co-founder of Greenpeace, one of the best-known environmental groups in the world. Over the last week, Moore has lashed out against the Alexandria Ocasio-Cortez “Green New Deal,” explaining it would be the “end of civilization” and warning that “half the population will die.” Patrick Moore: The Green New Deal will be […]", "lang": "en", "keywords": "AOC,badclimate,badscience,climate change,Collapse,Ecology,environ,environmentalism,Green New Deal,Greenpeace,insanity,junk science,left cult,Patrick Moore,real science,starvation", "favicon": "wp-content/themes/ScienceTheme/images/Climate-fav.png", "canonical": "https://climate.news/2019-03-12-greenpeace-founder-echoes-health-ranger-warning-aocs-green-new-deal-is-deadly-half-the-population-will-die.html", "encoding": "UTF-8"}, "image": null, "domain": "climate.news", "title": "Greenpeace co-founder echoes Health Ranger warning: AOC’s Green New Deal is deadly, “Half the population will die”", "cleaned_text": "Greenpeace co-founder echoes Health Ranger warning: AOC’s Green New Deal is deadly, “Half the population will die”\n\nPatrick Moore is the co-founder of Greenpeace, one of the best-known environmental groups in the world. Over the last week, Moore has lashed out against the Alexandria Ocasio-Cortez “Green New Deal,” explaining it would be the “end of civilization” and warning that “half the population will die.”\n\nPatrick Moore: The Green New Deal will be the end of civilization\n\nMoore recently appeared on Tucker Carlson’s show with Fox News, saying:\n\nThe Green New Deal will be the end of civilization if 85% of the world’s and 85% of the US coal, oil and natural gas were fazed out over the next few years, like the next ten years. We do not have anything to replace them with… Half of the population will die in a very short period of time. And as I also pointed out, there wouldn’t be a tree left on this planet… because that would be all there was to heat and cook.\n\nIn another interview with Breitbart News, Moore offers more details on how AOC’s insane plan would collapse human civilization via mass starvation:\n\nAnd so you’ve got the green movement creating stories that instill fear in the public. You’ve got the media echo chamber — fake news — repeating it over and over and over again to everybody that they’re killing their children. And then you’ve got the green politicians who are buying scientists with government money to produce fear for them in the form of scientific-looking materials. And then you’ve got the green businesses, the rent-seekers, and the crony capitalists who are taking advantage of massive subsidies, huge tax write-offs, and government mandates requiring their technologies to make a fortune on this. And then, of course, you’ve got the scientists who are willingly, they’re basically hooked on government grants.\n\nWhen they talk about the 99 percent consensus [among scientists] on climate change, that’s a completely ridiculous and false number. But most of the scientists — put it in quotes, scientists — who are pushing this catastrophic theory are getting paid by public money, they are not being paid by General Electric or Dupont or 3M to do this research, where private companies expect to get something useful from their research that might produce a better product and make them a profit in the end because people want it — build a better mousetrap type of idea. But most of what these so-called scientists are doing is simply producing more fear so that politicians can use it to control people’s minds and get their votes because some of the people are convinced, ‘Oh, this politician can save my kid from certain doom.’\n\nMoore is right. In fact, I put out this exact warning weeks ago in a story entitled, “ANALYSIS: How AOC’s Green New Deal would unleash a catastrophic food collapse and Venezuela-style mass starvation across America.” In that story, I write:\n\n[T]he “Green New Deal” appears to be a planned, engineered economic apocalypse plot to destroy America from within. No wonder so many Democrats have signed onto the plan, for it is exactly what they want to see happen: the complete economic destruction of the United States of America.\n\nHere’s the full infographic that accompanies the story:\n\nHave no doubts: Democrats are here to destroy America and collapse human civilization\n\nThe Green New Deal is part of the deliberate plan by Leftists to end human civilization and destroy human life across the planet. Once you understand the astonishing truth of this insidious plan, everything the Democrats are doing suddenly makes sense:\n• Geoengineering and the deliberate pollution of the atmosphere (to collapse the global food supply by dimming the sun)\n• Gun confiscation (to make it easier for governments to carry out mass genocide against civilians)\n• Socialism and communism (to put control over all food production and distribution in the hands of a central government)\n• Mandatory vaccines (to force children and adults to be injected with the “kill shot” depopulation vaccine when the order is given)\n• Public water fluoridation (to dumb people down and make them compliant sheeple who will go along with anything)\n• Pesticides and herbicides in the food supply (to destroy honey bee pollinators and collapse the global food supply while poisoning food consumers)\n\nStay informed. Here are some websites to keep you informed:\n\nCortezWatch.com – Exposes the lunacy and fraud of the Ocasio-Cortez regime that now controls the entire Democrat House of Representatives.\n\nClimate.news – Real science and real news about climate change and global warming.\n\nEnviron.news – Honest environmentalism rooted in real science, not left-wing hysteria and propaganda.\n\nCollapse.news – Breaking news about various collapse scenarios, from a global food collapse to economic collapse.", "opengraph": {"title": "Greenpeace co-founder echoes Health Ranger warning: AOC’s Green New Deal is deadly, “Half the population will die”", "type": "article", "url": "https://www.climate.news/2019-03-12-greenpeace-founder-echoes-health-ranger-warning-aocs-green-new-deal-is-deadly-half-the-population-will-die.html", "site_name": "Climate News", "description": "Patrick Moore is the co-founder of Greenpeace, one of the best-known environmental groups in the world. Over the last week, Moore has lashed out against the Alexandria Ocasio-Cortez “Green New Deal,” explaining it would be the “end of civilization” and warning that “half the population will die.” Patrick Moore: The Green New Deal will be […]", "image": "https://www.climate.news/wp-content/uploads/sites/381/2019/03/Patrick-Moore-Green-New-Deal-Fox-News.jpg"}, "tags": ["climate change", "starvation", "Green New Deal", "environmentalism", "Collapse", "left cult", "Patrick Moore", "environ", "Ecology", "Greenpeace", "insanity", "AOC"], "tweets": [], "movies": [], "links": ["https://www.thegatewaypundit.com/2019/03/greenpeace-co-founder-patrick-moore-drops-a-moab-on-aoc-and-her-green-new-deal-it-will-be-end-of-civilization-half-the-population-will-die-video/", "http://Brighteon.com/6012832793001", "https://www.breitbart.com/radio/2019/03/07/greenpeace-founder-global-warming-hoax-pushed-corrupt-scientists-hooked-government-grants/", "https://www.brighteon.tv", "https://www.naturalnews.com/2019-02-13-aoc-green-new-deal-food-collapse-mass-starvation.html", "http://Brighteon.com/5813005317001", "http://CortezWatch.com", "https://Climate.news", "http://Environ.news", "http://Collapse.news", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fclimatenews%2F2019-03-12-greenpeace-founder-echoes-health-ranger-warning-aocs-green-new-deal-is-deadly-half-the-population-will-die.html&linkname=Greenpeace%20co-founder%20echoes%20Health%20Ranger%20warning%3A%20AOC%E2%80%99s%20Green%20New%20Deal%20is%20deadly%2C%20%E2%80%9CHalf%20the%20population%20will%20die%E2%80%9D", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}