{"result_id": "072015", "URL": "https://www.climate.news/2019-09-17-global-geoengineering-chemtrails-experiment-funded-by-nazi-linked-alfred-p-sloan-foundation.html", "timestamp": "2023-04-25 14:45:19 CEST+0200", "meta": {"description": "The mainstream media is now openly pushing geoengineering and chemtrails as a solution for so-called “global warming,” which is of course a complete hoax to begin with. Globalist propaganda network CNBC has just released a new video (see below) which is a blatant infomercial for chemtrails, touting the benefits of polluting the skies with calcium […]", "lang": "en", "keywords": "Alfred P. Sloan Foundation,badclimate,badpollution,badscience,bill gates,CFR,chemtrails,Collapse,depopulation,eugenics,genocide,geoengineering,insane,Left-wing,lunatics,SCoPEx", "favicon": "wp-content/themes/ScienceTheme/images/Climate-fav.png", "canonical": "https://www.climate.news/2019-09-17-global-geoengineering-chemtrails-experiment-funded-by-nazi-linked-alfred-p-sloan-foundation.html", "encoding": "UTF-8"}, "image": null, "domain": "www.climate.news", "title": "BOMBSHELL: Global geoengineering (chemtrails) experiment pushed by Bill Gates also funded by Nazi-linked Alfred P. Sloan Foundation, linked to eugenics and depopulation", "cleaned_text": "BOMBSHELL: Global geoengineering (chemtrails) experiment pushed by Bill Gates also funded by Nazi-linked Alfred P. Sloan Foundation, linked to eugenics and depopulation\n\nThe mainstream media is now openly pushing geoengineering and chemtrails as a solution for so-called “global warming,” which is of course a complete hoax to begin with. Globalist propaganda network CNBC has just released a new video (see below) which is a blatant infomercial for chemtrails, touting the benefits of polluting the skies with calcium carbonate and sulfur dioxide, two pollutants that would devastate life on Earth. Matt Agorist from The Free Thought Project published an informative write-up.\n\nThe project is called SCoPEx, and it’s being masterminded by the who’s who of eugenicists and depopulation pushers at the highest levels of world government and academia. It’s funded and endorsed by Bill Gates, for example, who openly calls for reducing the human population by billions. We’ve covered this extensively on Natural News, warning how Bill Gates is funding a plan to carry out planetary genocide.\n\nAs I explain in videos at OblivionAgenda.com, this SCoPEx project would pollute the skies across the entire planet, dim the sun, impair photosynthesis and lead to a collapse of the global biosphere. This, of course, would lead to mass starvation around the world as food crops fail and famine sets in. This is the goal of the project, by the way, not an unintended side effect.\n\nSame Alfred P. Sloan Foundation that censored vaccine truth also funding SCoPEx project to commit planetary genocide\n\nIn the video, shown below via YouTube, the non-profit organizations involved in funding this SCoPEx project are listed. Among those funding the project at none other than The Alfred P. Sloan Foundation.\n\nYou need to get familiar with this name, because Alfred P. Sloan has long sought to carry out the mass murder of human beings. As published on NaturalNews.com in 2016:\n\nIndustrialist Alfred P. Sloan, as head of General Motors, was a Nazi collaborator, and ardent admirer of Hitler. Sloan’s hatred of blacks was almost as intense as his hatred of Jews. He had a close connection with the eugenics movement which eventually became the Human Genome Project. The Sloan Foundation, together with the Rockefeller nexus, held a long standing interest in population reduction, including their involvement with the introduction of mysterious new vaccines together with the World Health Organization, which has a stated policy of population reduction, as clearly set forth in Agenda 21.\n\nIt was also the Alfred P. Sloan Foundation that pressured the Tribeca Film Institute to censor the film VAXXED, which exposed the truth about vaccines and infertility, spontaneous abortions and the deliberate damaging of children and adults with toxic substances added to vaccines. Sloan and the WHO have been repeatedly linked to vaccines that are spiked with HCG, an infertility chemical.\n\nThis seemingly altruistic Sloan Foundation also funded the Community Blood Council of Greater New York, Inc., which allowed more than 10,000 hemophiliacs and countless others to become fatally infected with HIV/Aids. Moreover, The Sloan Foundation held 24,000-53,000 shares issued by Merck and Co., whose president George W. Merck was director of America’s biological weapons industry and whose Hepatitis C and polio vaccines have been suspected of transmitting AIDs; and who knows what else.\n\nThe Sloan Foundation is currently headed by a globalist named Paul Joskow, member of the Council on Foreign Relations (CFR), a global elite group with deep ties to depopulation advocate Bill Gates, who also awards large grants to numerous websites that agree to publish pro-vaccine propaganda.\n\nSo now you know the truth about the SCoPEx project, which will also drop enormous quantities of lead — the heavy metal — onto the world’s crops, soils and oceans. This project is nothing less than the mass genocide of humanity, funded by Bill Gates and 14 non-profit foundations as listed here:\n\nJ. Baker Foundation\n\n The Blue Marble Fund\n\n OW Caspersen Foundation\n\n Thw Crows Nest Foundation\n\n The William and Flora Hewlett Foundation\n\n Constance C. and Linwood A. Lacy Jr. Foundation\n\n The Open Philanthropy Project\n\n Pritzker Innovation Fund\n\n Ronin Private Investments LLC\n\n The Alfred P. Sloan Foundation\n\n The Tansy Foundation\n\n Teza Technologies LLC\n\n VoLo Foundation\n\n The Weatherhead Center for International Affairs\n\nWatch the chemtrails infomercial from CNBC, which now openly admits they want to pollute the skies, just as we’ve been warning you for years. That’s why we launched Terraforming.news and Geoengineering.news. This is Adolf Hitler times 1000 in terms of the genocide being carried out here (billions of people will die, which is the goal).\n\nNow you know why they have to desperately try to label Natural News “fake news” or “conspiracy.” Because yesterday’s conspiracy is today’s Harvard science project funded by eugenics advocates who want to murder six billion people (or more). Just two years ago, “chemtrails” was derided as a conspiracy theory. Now CNBC is running puff pieces promoting it!\n\nThe real agenda is the annihilation of humankind. This is why we’ve launched OblivionAgenda.com to explain the truth about the globalist agenda to destroy humanity. It’s no longer science fiction; it’s science fact.", "opengraph": {"title": "BOMBSHELL: Global geoengineering (chemtrails) experiment pushed by Bill Gates also funded by Nazi-linked Alfred P. Sloan Foundation, linked to eugenics and depopulation", "type": "article", "url": "https://www.climate.news/2019-09-17-global-geoengineering-chemtrails-experiment-funded-by-nazi-linked-alfred-p-sloan-foundation.html", "site_name": "Climate News", "description": "The mainstream media is now openly pushing geoengineering and chemtrails as a solution for so-called “global warming,” which is of course a complete hoax to begin with. Globalist propaganda network CNBC has just released a new video (see below) which is a blatant infomercial for chemtrails, touting the benefits of polluting the skies with calcium […]", "image": "https://www.climate.news/wp-content/uploads/sites/381/2019/09/Airplane-Stratosphere-SCOPEX-Spray.jpg"}, "tags": ["geoengineering", "insane", "chemtrails", "Collapse", "lunatics", "Left-wing", "eugenics", "genocide", "bill gates", "depopulation", "CFR", "SCoPEx", "Alfred P. Sloan Foundation"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "500", "height": "281", "embed_code": "<iframe width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/WR6uSXW-8p4?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe>", "src": "https://www.youtube.com/embed/WR6uSXW-8p4?feature=oembed"}], "links": ["https://thefreethoughtproject.com/geoengineering-mainstream-media/", "https://www.naturalnews.com/2019-09-06-project-scopex-bill-gates-has-a-plan-to-carry-out-planetary-genocide.html", "http://OblivionAgenda.com", "https://www.brighteon.tv", "https://www.naturalnews.com/053449_Tribeca_Film_Festival_Sloan_Foundation_eugenics_and_depopulation.html", "https://www.naturalnews.com/053449_Tribeca_Film_Festival_Sloan_Foundation_eugenics_and_depopulation.html", "http://Terraforming.news", "http://Geoengineering.news", "http://OblivionAgenda.com", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fclimatenews%2F2019-09-17-global-geoengineering-chemtrails-experiment-funded-by-nazi-linked-alfred-p-sloan-foundation.html&linkname=BOMBSHELL%3A%20Global%20geoengineering%20%28chemtrails%29%20experiment%20pushed%20by%20Bill%20Gates%20also%20funded%20by%20Nazi-linked%20Alfred%20P.%20Sloan%20Foundation%2C%20linked%20to%20eugenics%20and%20depopulation", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}