{"result_id": "072018", "URL": "https://climate.news/2021-09-21-german-professor-calls-investigation-into-military-geoengineering.html", "timestamp": "2023-04-25 14:45:21 CEST+0200", "meta": {"description": "A German professor is calling on humanity to look into attempts to weaponize the planet. Sociologist and political scientist Claudia von Werlhof of the University of Innsbruck in Austria urged people to talk about military geoengineering, which most dismiss as a conspiracy theory. She claims that patriarchal forces are behind the plot to artificially reshape the […]", "lang": "en", "keywords": "5g radiation,badclimate,badhealth,badmedicine,Claudia von Werlhof,coronavirus vaccines,covid-19 pandemic,Dr. Rosalie Bertell,geoengineering,graphene oxide,military geoengineering,patriarchal forces,polyethlyene glycol,technological advancements,terraforming,transhumanism,weather control,Wuhan coronavirus", "favicon": "wp-content/themes/ScienceTheme/images/Climate-fav.png", "canonical": "https://climate.news/2021-09-21-german-professor-calls-investigation-into-military-geoengineering.html", "encoding": "UTF-8"}, "image": null, "domain": "climate.news", "title": "German professor calls for investigation into military geoengineering", "cleaned_text": "A German professor is calling on humanity to look into attempts to weaponize the planet. Sociologist and political scientist Claudia von Werlhof of the University of Innsbruck in Austria urged people to talk about military geoengineering, which most dismiss as a conspiracy theory. She claims that patriarchal forces are behind the plot to artificially reshape the Earth.\n\nWerlhof says human father figures are responsible for shaping the current world by means of violence that spans thousands of years. This violence has become trauma over time, yet this fact is considered “forbidden knowledge” that needs concealment from humanity. “As long as this patriarchal ‘civilization’ has not totally succeeded in transforming life, nature, humans, the whole world and the planet itself into a completely man-made world, violence will continuously be applied as a necessary means of achieving its dangerous end goals,” she adds.\n\nAccording to the professor, the patriarchal narrative insists that there is no violence involved in the transformation process. It also insists that the end result of transforming the natural to the artificial will be far superior. However, destruction is the true end product of this artificial manipulation – a process Werlhof calls “alchemical.”\n\nShe also cites the work of scientist and environmental activist Dr. Rosalie Bertell, specifically her book “Planet Earth: The Latest Weapon of War.” According to Bertell, the patriarchy is moving to destroy the planet and its living conditions. Thus, Bertell calls on people to “address patriarchy and its systemic, direct and structural violence” to favor what she calls “planetary consciousness.”\n\nHowever, Werlhof notes that Bertell’s work on geoengineering has not been properly debated in public. People often dismiss the activist’s concepts of military geoengineering as uneasy truths and conspiracy theories, she adds. Werlhof notes that the end goal of the patriarchy’s geoengineering efforts is to “change all of life, nature and humanity … into a man-made, artificial one.”\n\nHumanity is seeing both overt and covert methods of geoengineering\n\nWerlhof says: “If we look around, we see always more weaponry … threatening the Earth, [its] climate, the ozone later, [its] cycles and all life.” She cites examples of these – which include nanotechnologies, biotechnologies, artificial intelligence, mind control and 5G radiation. “Geoengineering belongs to the fourth Industrial Revolution that has been proclaimed to build our future – or our no-future – in the 21st century,” Werlhof continues.\n\n“These technologies are already producing ‘lockdowns’ from above … as well as from below. They are meant to use our bodies and brains, and I don’t think all of us are supposed to survive this process of becoming the ‘bio’ part of what I call the ‘mega-machine’ – the new global form of totalitarianism,” the professor warns.\n\nTrue enough, the town of Gateshead in northeast England experiences firsthand the negative effects of 5G radiation from their town’s street lights. Gateshead resident Mark Steele shares stories of three women who suffered miscarriages after the 5G street lights’ installation in 2016. One of them even gives birth to a deformed child who survives for just three hours.\n\nAside from the three women, the Daily Mail also notes other residents who suffer due to the street lights. Local resident Shirley Forster claims the street lights cause her to experience nosebleeds, an illness teenager Shaun Drummond also experiences. Meanwhile, 55-year-old Debbie Chisholm says she suffers sleepless nights due to the lights. (Related: 5G is the gateway to brain damage and manipulations of your health and mind.)\n\nWerlhof also mentions the vaccines against the Wuhan coronavirus (COVID-19) as another form of this geoengineering. “The vaccines against COVID-19, intending to turn us into genetically modified zombies with implanted chips and nanobots, are in the process of application right now,” she says.\n\nThe COVID-19 vaccines contain ingredients such as polyethylene glycol and graphene oxide that harm the human body. The mRNA vaccines from Pfizer and Moderna contain these toxic compounds, yet governments around the world mandate that people take these dangerous chemical cocktails.\n\nTrue enough, researchers discover that Pfizer’s Comirnaty vaccine contains more than 90 percent graphene oxide. Scientists from the University of Almeria in Spain have scrutinized Comirnaty doses. They reveal that each dose of Comirnaty contains around 747 nanograms of graphene oxide – meaning that more than 99 percent of the vaccine is composed entirely of the toxic compound. (Related: Graphene oxide used in coronavirus vaccines linked to adverse events, even death.)\n\n“The laissez-faire attitude toward the question of technology being welcomed as progress has to stop. There is a need to really look at … the intentional destruction of the world, including us humans. They are intended to lead us toward transhumanism … and the end of humanity,” Werlhof concludes.\n\nGeoEngineering.news has more articles about the use of technology to artificially remake the Earth.", "opengraph": {"title": "German professor calls for investigation into military geoengineering", "type": "article", "url": "https://www.climate.news/2021-09-21-german-professor-calls-investigation-into-military-geoengineering.html", "site_name": "Climate News", "description": "A German professor is calling on humanity to look into attempts to weaponize the planet. Sociologist and political scientist Claudia von Werlhof of the University of Innsbruck in Austria urged people to talk about military geoengineering, which most dismiss as a conspiracy theory. She claims that patriarchal forces are behind the plot to artificially reshape the […]", "image": "https://www.climate.news/wp-content/uploads/sites/381/2021/09/earth-fire.jpg"}, "tags": ["geoengineering", "patriarchal forces", "5g radiation", "weather control", "military geoengineering", "covid-19 pandemic", "Dr. Rosalie Bertell", "graphene oxide", "polyethlyene glycol", "transhumanism", "Claudia von Werlhof", "Wuhan coronavirus", "terraforming", "technological advancements", "coronavirus vaccines"], "tweets": [], "movies": [], "links": ["https://www.globalresearch.ca/call-mother-earth-humanity/5755749", "https://www.uibk.ac.at/index.html.en", "https://www.brighteon.tv", "https://www.dailymail.co.uk/health/article-5409921/Residents-enduring-stillbirths-street-lamps.html", "https://www.naturalnews.com/2020-02-27-5g-gateway-brain-manipulate-your-health-mind.html", "https://www.naturalhealth365.com/mrna-jabs-content-3898.html", "https://www.ual.es/en", "https://www.naturalnews.com/2021-08-15-graphene-oxide-in-coronavirus-vaccines-linked-to-death.html", "https://geoengineering.news/", "https://www.globalresearch.ca/call-mother-earth-humanity/5755749", "https://www.dailymail.co.uk/health/article-5409921/Residents-enduring-stillbirths-street-lamps.html", "https://www.naturalhealth365.com/mrna-jabs-content-3898.html"], "authors": [], "publish_date": null}