{"result_id": "072022", "URL": "https://climate.news/2022-06-22-climate-change-agenda-is-exterminate-humans.html", "timestamp": "2023-04-25 14:45:24 CEST+0200", "meta": {"description": "The Health Ranger Mike Adams warned the public that the globalists are pushing the climate change narrative to force mass starvation and ultimately depopulate the world. “They have created an entire system of compliance and support from the oblivious masses who have no idea that they’re taking part in the extermination of the human race,” […]", "lang": "en", "keywords": "badhealth,badmedicine,badscience,big government,Brighteon.com,climate change hoax,CO2 sequestration,Collapse,conspiracy,fossil fuels,Health Ranger,Illinois rolling blackouts,mass starvation,Mike Adams,planetary extermination,survival,terraforming,tissue clots,Tyranny,vaccines", "favicon": "wp-content/themes/ScienceTheme/images/Climate-fav.png", "canonical": "https://climate.news/2022-06-22-climate-change-agenda-is-exterminate-humans.html", "encoding": "UTF-8"}, "image": null, "domain": "climate.news", "title": "Globalists are pushing climate change narrative to force mass starvation and depopulate the world, the Health Ranger warns", "cleaned_text": "Globalists are pushing climate change narrative to force mass starvation and depopulate the world, the Health Ranger warns\n\nThe Health Ranger Mike Adams warned the public that the globalists are pushing the climate change narrative to force mass starvation and ultimately depopulate the world.\n\n“They have created an entire system of compliance and support from the oblivious masses who have no idea that they’re taking part in the extermination of the human race,” said Adams in his special report titled “TERRAFORMING: The Truth Revealed.”\n\nAccording to Adams, these globalists are attacking the food supply with the so-called war on carbon.\n\n“This is a planetary scale, extinction-level event. But it’s all been packaged as a way to save the planet. And anyone who has gone along with this has been fooled at a level that they will probably never grasp,” Adams pointed out.\n\nIt doesn’t help that Big Tech is censoring information about this matter.\n\n“Anyone who questions the climate change official narrative – because they can’t have humanity waking up and realizing that they’re being exterminated – they have to make sure that the cattle being destroyed, that’s the human race, remain oblivious, remain blind to the reality of the great culling that is already underway,” Adams said. (Related: Climate change, diversity, and equity: it’s ALL a scam.)\n\nThe agenda is to starve the world, take away the air and block the blood flow\n\nThe globalists have been pushing that the answer to climate change is carbon dioxide (CO2) sequestration. This will remove carbon dioxide from the atmosphere and reduce crop yields.\n\nAdams said every person pushing the climate change narrative is demanding mass starvation – every one of them whether they realize it or not. Mass starvation will bring down the global population.\n\n“You lower CO2 levels so you can’t grow food crops nearly as efficiently. So this is why they want to move off of fossil fuels and this is why they are shutting down the fossil fuel industry,” Adams noted.\n\nHe also revealed that there’s a giant operation using eminent domain to seize farmland in places like Iowa and Illinois. “They are setting up these massive machines and are being built by us, human beings, to suck carbon dioxide out of the atmosphere and hide the CO2 underground in a carbon sequestration format.”\n\nThe government is shutting down fossil fuel refinery plants and they announced that electricity in Illinois is going to go up by 54 percent starting June and there are going to be rolling blackouts on top of that. Adams said it would not be fair for the people to have to pay more and then have blackouts. But the real reason behind the move, he said, is to stop the CO2 emissions.\n\nBecause that is what the globalists need to achieve global starvation.\n\nAdams, who owns and operates a multimillion dollar lab, explained that lowering CO2 will reduce plant life all across the planet. And when there aren’t as many plants producing oxygen, humans’ oxygen levels will fall.\n\n“As oxygen levels fall, human beings and all the animals will slowly asphyxiate and people will be dropping dead from inability to provide enough oxygen to their brains or to their hearts,” he said.\n\nThe Health Ranger went on to cite more shreds of evidence on the multi-vector attack for mass planetary extermination. He said that “experts” are also altering the blood with an engineered biological weapon that impairs the body’s ability to carry oxygen.\n\n“There’s something else about the vaccines that create these crazy insane tissue clots that are appearing in the bodies, especially in the arteries. These clots are blocking the flow of the blood that carries the oxygen to your brain,” he said, referring to the Wuhan coronavirus (COVID-19) vaccines.\n\nHis point is supported by board-certified embalmer Richard Hirschman, who divulged during his podcast interview with Dr. Betty Martini that he has been seeing “unnatural blood clots combinations with strange fibrous materials” clogging the arteries and veins of the deceased.\n\nAccording to the embalmer, this started approximately six months after the vaccine rollout. Most of the victims reportedly died of heart attacks and strokes.\n\nVisit Climate.news for more stories about the climate change hoax.\n\nWatch the special report by the Health Ranger Mike Adams titled “TERRAFORMING: The Truth Revealed” below.\n\nCatch new episodes of the program on the Health Ranger Report channel on Brighteon.com.\n\nCounterthink video: Mike Adams interviews Marc Morano on the greatest “science” hoax of our time: climate change.\n\nClimate change HOAX has literally convinced a member of Congress that “the world is going to end in 12 years.”\n\nIs ocean acidification another climate change HOAX? Scientists blow the whistle on massive, coordinated data manipulation and FRAUD.", "opengraph": {"title": "Globalists are pushing climate change narrative to force mass starvation and depopulate the world, the Health Ranger warns", "type": "article", "url": "https://www.climate.news/2022-06-22-climate-change-agenda-is-exterminate-humans.html", "site_name": "Climate News", "description": "The Health Ranger Mike Adams warned the public that the globalists are pushing the climate change narrative to force mass starvation and ultimately depopulate the world. “They have created an entire system of compliance and support from the oblivious masses who have no idea that they’re taking part in the extermination of the human race,” […]", "image": "https://www.climate.news/wp-content/uploads/sites/381/2022/06/Scared-Climate-Change.jpg"}, "tags": ["conspiracy", "CO2 sequestration", "big government", "fossil fuels", "Mike Adams", "mass starvation", "planetary extermination", "survival", "Collapse", "tissue clots", "Health Ranger", "climate change hoax", "vaccines", "Brighteon.com", "Illinois rolling blackouts", "terraforming", "Tyranny"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/84ac7082-99d1-408a-86e8-5d098970e7df", "http://globalism.news", "https://naturalnews.com/2022-03-26-climate-change-diversity-equity-all-scam.html", "https://www.brighteon.tv", "https://www.thecentersquare.com/illinois/possible-summertime-rolling-blackouts-a-concern-for-illinois-manufacturers/article_e5f418ea-d798-11ec-80d6-af0dfcdb450b.html", "https://rumble.com/vtcsgw-worldwide-exclusive-embalmers-find-veins-and-arteries-filled-with-never-bef.html?fbclid=IwAR2Fv4vpUYckTr4W1Jzb4TScAh6bMOWqY8C8H8aMSwFeGgN8aat1fHEAzjQ", "https://climate.news", "https://www.brighteon.com/84ac7082-99d1-408a-86e8-5d098970e7df", "https://www.brighteon.com/channels/hrreport", "https://naturalnews.com/2018-05-29-mike-adams-interviews-marc-morano-greatest-science-hoax-climate-change.html", "https://climate.news/2019-01-23-climate-change-hoax-has-convinced-a-member-of-congress-world-is-going-to-end.html", "https://climatesciencenews.com/2021-05-12-ocean-acidification-climate-change-hoax-manipulation-fraud.html", "https://greatreset.news/2022-04-05-mike-adams-resilient-prepping-survive-great-reset.html", "https://www.brighteon.com/84ac7082-99d1-408a-86e8-5d098970e7df", "https://www.thecentersquare.com/illinois/possible-summertime-rolling-blackouts-a-concern-for-illinois-manufacturers/article_e5f418ea-d798-11ec-80d6-af0dfcdb450b.html", "https://rumble.com/vtcsgw-worldwide-exclusive-embalmers-find-veins-and-arteries-filled-with-never-bef.html?fbclid=IwAR2Fv4vpUYckTr4W1Jzb4TScAh6bMOWqY8C8H8aMSwFeGgN8aat1fHEAzjQ", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fclimatenews%2F2022-06-22-climate-change-agenda-is-exterminate-humans.html&linkname=Globalists%20are%20pushing%20climate%20change%20narrative%20to%20force%20mass%20starvation%20and%20depopulate%20the%20world%2C%20the%20Health%20Ranger%20warns", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}