{"result_id": "072030", "URL": "https://climate.news/2019-01-17-retired-climate-scientist-turned-skeptic-global-warming-narrative.html", "timestamp": "2023-04-25 14:45:29 CEST+0200", "meta": {"description": "It isn’t a popular position to take these days, but that doesn’t seem to bother Dr. Anastasios Tsonis, a retired professor of climate studies from the University of Wisconsin-Milwaukee who contends that so-called “global warming” – at least in the way that climate fanatics tend to talk about it – is largely a myth. In […]", "lang": "en", "keywords": "badclimate,carbon dioxide,climate change,climate fanatics,climate lies,climate science,CO2,Dr. Anastasios Tsonis,enviornment,global warming,goodscience,greenhouse gases,narrative,pollutant,rational,real science,settled science,skeptic,skeptics", "favicon": "wp-content/themes/ScienceTheme/images/Climate-fav.png", "canonical": "https://climate.news/2019-01-17-retired-climate-scientist-turned-skeptic-global-warming-narrative.html", "encoding": "UTF-8"}, "image": null, "domain": "climate.news", "title": "Retired climate scientist-turned-skeptic says global warming narrative is completely bogus", "cleaned_text": "It isn’t a popular position to take these days, but that doesn’t seem to bother Dr. Anastasios Tsonis, a retired professor of climate studies from the University of Wisconsin-Milwaukee who contends that so-called “global warming” – at least in the way that climate fanatics tend to talk about it – is largely a myth.\n\nIn his view, accepting the official global warming narrative hook, line, and sinker is rather foolish because the issue is far too complicated to pigeonhole as an entirely human-caused phenomenon that can only be stopped by restricting people’s personal freedoms and taxing them to death.\n\nA recent essay he wrote explains some of his reasoning for rejecting the prevailing climate change positions held by others in his field, which largely posit that too much carbon dioxide (CO2) and other greenhouse gases are rapidly priming the planet for a global warming catastrophe in the very near future.\n\n“Climate is too complicated to attribute its variability to one cause,” says Dr. Tsonis. “We first need to understand the natural climate variability (which we clearly don’t; I can debate anybody on this issue). Only then we can assess the magnitude and reasons of climate change.”\n\nBe sure to follow the latest climate news at ClimateScienceNews.com.\n\nNo, the science isn’t settled on climate change\n\nDespite claims by NBC News and others that the “science is settled” on climate change – as well as completely absurd claims that natural CO2 is somehow a “pollutant” – Dr. Tsonis reveals that this is hardly the case.\n\n“If science were settled, then we should go pack things up and go home,” Dr. Tsonis writes, explaining how there’s a multitude of factors that influence climate fluctuations – many of which are completely independent of human influence.\n\n“It is my educated opinion that many forces have shaped global temperature variation,” he contends.\n\n“Human activity, the oceans, extraterrestrial forces (solar activity and cosmic rays) and other factors are all in the mix … We should be skeptical of claims that the science of a complicated and unpredictable system is settled.”\n\nFor more news about global warming, be sure to check out GlobalWarming.Fetch.news.\n\nMan-made climate change is still just a theory, not irrefutable fact\n\nIt’s important to note that Dr. Tsonis isn’t necessarily claiming that human activity has no effect whatsoever on climate conditions. But if humans are causing the planet to warm in any way, this impact is minimal at best, as science has yet to definitively prove that CO2, cow “farts,” cars, or any of the other bogeymen are substantially impacting global temperature averages.\n\nHe also stresses that consensus, or the idea that simply having a large number of scientists in agreement about man-made climate change, is not the same thing as science.\n\n“Very often, when I talk to the public or the media about global warming (a low-frequency positive trend in global temperature in the last 120 years or so), they ask me the unfortunate question if I ‘believe’ in global warming,” Dr. Tsonis writes.\n\n“And I say ‘unfortunate’ because when we are dealing with a scientific problem ‘believing’ has no place. In science, we either prove or disprove. We ‘believe’ only when we cannot possibly prove a truth.”\n\nThis is an issue not only pertaining to climate change and global warming, but also to many other areas of science – including so-called science that pushes all vaccines as safe and effective when there’s plenty of evidence to the contrary.\n\n“I am a skeptic not just about global warming, but also about many other aspects of science,” says Dr. Tsonis.\n\n“We may form an opinion based on the existing scientific evidence in hand, current knowledge, possible theories and hypotheses … The fact that scientists who show results not aligned with the mainstream are labeled deniers is the backward mentality. We don’t live in medieval times.”\n\nScience has been seriously compromised by the climate change agenda\n\nDr. Tsonis believes there are essentially three schools of thought when it comes to climate change – those who believe mankind is causing it, those who don’t, and those who are merely skeptical – and that all of the infighting between these variant schools of thought has compromised the totality of science on the matter.\n\n“I usually don’t bother with pseudo-scientists, media and ignorant people abusing the freedom of the Internet by writing and posting nonsense comments,” Dr. Tsonis says.\n\n“But I have grown wary of what is going on with the debate on the overblown and misdirected issue of global warming – a case in point being ‘Meet the Press’ host Chuck Todd saying he will no longer give time to global warming ‘deniers’ and also that the ‘science is settled.'”\n\nBe sure to read Dr. Tsonis’ full analysis of the climate change debate at ClimateDepot.com.\n\nYou can also read more about how climate fanatics are trying to “fix” global warming by spraying our skies with “chemtrails” at Geoengineering.news.", "opengraph": {"title": "Retired climate scientist-turned-skeptic says global warming narrative is completely bogus", "type": "article", "url": "https://www.climate.news/2019-01-17-retired-climate-scientist-turned-skeptic-global-warming-narrative.html", "site_name": "Climate News", "description": "It isn’t a popular position to take these days, but that doesn’t seem to bother Dr. Anastasios Tsonis, a retired professor of climate studies from the University of Wisconsin-Milwaukee who contends that so-called “global warming” – at least in the way that climate fanatics tend to talk about it – is largely a myth. In […]", "image": "https://www.climate.news/wp-content/uploads/sites/381/2019/02/Climate-Change-A-Metaphor.jpg"}, "tags": ["settled science", "enviornment", "pollutant", "skeptic", "climate change", "Dr. Anastasios Tsonis", "narrative", "skeptics", "rational", "global warming", "climate science", "carbon dioxide", "climate fanatics", "greenhouse gases", "CO2", "climate lies"], "tweets": [], "movies": [], "links": ["https://uwm.edu", "http://www.climatedepot.com/2019/01/10/climate-scientist-retires-then-declares-i-am-a-skeptic-offers-to-debate-rejects-denier-label-we-dont-live-in-medieval-times/", "http://climatesciencenews.com", "https://www.naturalnews.com/2019-01-07-nbc-declares-no-debate-allowed-on-climate-change-science-is-settled-carbon-dioxide-is-a-pollutant.html", "https://www.brighteon.tv", "http://globalwarming.fetch.news/", "https://www.naturalnews.com/032558_flu_shots_wear_off.html", "http://www.climatedepot.com/2019/01/10/climate-scientist-retires-then-declares-i-am-a-skeptic-offers-to-debate-rejects-denier-label-we-dont-live-in-medieval-times/", "http://www.geoengineering.news/", "http://www.climatedepot.com/2019/01/10/climate-scientist-retires-then-declares-i-am-a-skeptic-offers-to-debate-rejects-denier-label-we-dont-live-in-medieval-times/", "https://www.naturalnews.com/2019-01-07-nbc-declares-no-debate-allowed-on-climate-change-science-is-settled-carbon-dioxide-is-a-pollutant.html", "https://www.naturalnews.com/032558_flu_shots_wear_off.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fclimatenews%2F2019-01-17-retired-climate-scientist-turned-skeptic-global-warming-narrative.html&linkname=Retired%20climate%20scientist-turned-skeptic%20says%20global%20warming%20narrative%20is%20completely%20bogus", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}