{"result_id": "072026", "URL": "https://climate.news/2022-04-11-solar-power-explodes-in-cost.html", "timestamp": "2023-04-25 14:45:27 CEST+0200", "meta": {"description": "The Biden regime is pushing a full-bore transition to expensive (and often impractical) “green energy” and electric vehicles at a time when the global supply chain is in tatters and it is nearly impossible to get some items. And now, that includes solar panels, which means they are about to get insanely expensive. “Over the last […]", "lang": "en", "keywords": "Auxin Solar,big government,conspiracy,corruption,crisis,deception,electricity,energy,expensive,green energy,impractical,power,power grid,products,solar panels,supply chain,supply chain crisis", "favicon": "wp-content/themes/ScienceTheme/images/Climate-fav.png", "canonical": "https://climate.news/2022-04-11-solar-power-explodes-in-cost.html", "encoding": "UTF-8"}, "image": null, "domain": "climate.news", "title": "Solar power set to skyrocket in cost thanks to failing supply chain", "cleaned_text": "Solar power set to skyrocket in cost thanks to failing supply chain\n\nThe Biden regime is pushing a full-bore transition to expensive (and often impractical) “green energy” and electric vehicles at a time when the global supply chain is in tatters and it is nearly impossible to get some items.\n\nAnd now, that includes solar panels, which means they are about to get insanely expensive.\n\n“Over the last six months, the U.S. solar supply chain has been subject to not one, but two, attacks perpetrated by companies attempting to leverage trade laws for their own self-interest when those laws were meant to protect the public interest,” Real Clear Policy reported this week.\n\n“These companies want the U.S. Department of Commerce to apply substantial tariffs to solar modules imported from select Asian countries. These modules are critical inputs to the execution of solar projects installed in the U.S. today by American companies,” the report continued.\n\nUnder current U.S. trade laws, companies doing business in the United States can claim that any or all firms are in violation of those trade laws and the Department of Commerce must then take the allegation as legitimate, even though the department is not actually required to investigate the allegation. That is a discretion that exists in order to prevent abuse of the complaint-based system; it was established to prevent one company from improperly gaming the regulatory system to their advantage.\n\nThat said, the American solar panel industry would like the department to recognize its discretionary power and exercise it to keep a single company from breaking the already fragile supply chain that makes the industry viable in the U.S., providing jobs and environmental benefits.\n\n“Make no mistake, if the complainant is successful, solar energy will become as much as two to three times more expensive than it was just one year ago, setting back our efforts to achieve independence, putting hundreds of thousands of U.S. jobs at risk along with the Biden administration’s renewable energy goals,” Real Clear Policy noted further. “If these tariffs are applied, we expect that far less solar generation will be installed in the U.S. during the four years of the Biden administration as compared to previous administrations.”\n\nThe latest attempt to game the U.S. system stems from a complaint filed by Auxin Solar. The company is claiming that certain solar panel components are coming from nations that ought to be subject to anti-dumping rules and are “countervailing duties on their importation,” the outlet noted. A nearly identical claim was made last year but it was rejected by the Commerce Department; however, “as long as the system entertains these claims, they will keep coming,” Real Clear Policy noted.\n\nThe firm is attempting to get the U.S. government to take an action that will make it far too expensive for solar panel installers to buy panels from overseas suppliers that America needs and that are currently providing crucial value up and down the supply chain, which, again, is stressed already. The company that filed the complaint wants the Biden administration to force all U.S. solar companies to obtain their panels from a very small group of U.S. manufacturers at a much higher cost.\n\n“While we all can agree that having more domestic sources for solar panels would be a good thing, today’s domestic solar panel assemblers simply can’t provide the capacity of panels needed to satisfy the increasing demand for clean, renewable energy,” the outlet noted. “Auxin itself can only supply panels to meet less than 1% of the total U.S. market demand.”\n\nNotably, the top three U.S. solar panel manufacturers, who lead the same industry Auxin claims it is trying to protect, are opposed to the complaint filing and the company’s claim that circumvention action is necessary. Auxin is the only firm that supports a Commerce Department investigation.\n\n“If we want to continue to make progress on America’s clean energy and energy independence goals and preserve the public interest, the Department of Commerce must deny Auxin’s request,” Real Clear Policy concludes.", "opengraph": {"title": "Solar power set to skyrocket in cost thanks to failing supply chain", "type": "article", "url": "https://www.climate.news/2022-04-11-solar-power-explodes-in-cost.html", "site_name": "Climate News", "description": "The Biden regime is pushing a full-bore transition to expensive (and often impractical) “green energy” and electric vehicles at a time when the global supply chain is in tatters and it is nearly impossible to get some items. And now, that includes solar panels, which means they are about to get insanely expensive. “Over the last […]", "image": "https://www.climate.news/wp-content/uploads/sites/381/2022/04/Solar-Panel-House-Energy-Home-Roof-Photovoltaic.jpg"}, "tags": ["conspiracy", "big government", "supply chain crisis", "Auxin Solar", "supply chain", "solar panels", "products", "deception", "expensive", "crisis", "green energy", "electricity", "power", "impractical", "power grid", "corruption", "energy"], "tweets": [], "movies": [], "links": ["https://newstarget.com/2021-08-20-solar-panels-green-energy-releasing-lead-into-the-environment.html", "https://www.realclearpolicy.com/articles/2022/03/28/the_us_solar_supply_chain_is_under_attack_823933.html", "https://www.brighteon.tv", "https://www.realclearpolicy.com/articles/2022/03/28/the_us_solar_supply_chain_is_under_attack_823933.html", "http://www.greenlivingnews.com", "https://www.realclearpolicy.com/articles/2022/03/28/the_us_solar_supply_chain_is_under_attack_823933.html", "https://newstarget.com/2021-08-20-solar-panels-green-energy-releasing-lead-into-the-environment.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fclimatenews%2F2022-04-11-solar-power-explodes-in-cost.html&linkname=Solar%20power%20set%20to%20skyrocket%20in%20cost%20thanks%20to%20failing%20supply%20chain", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}