{"result_id": "072012", "URL": "https://www.climate.news/2022-10-02-video-reveals-gates-admitting-clean-energy-a-scam.html", "timestamp": "2023-04-25 14:45:17 CEST+0200", "meta": {"description": "A video resurfacing on the internet has shown Big Tech mogul Bill Gates laughing at how insufficient “clean energy” resources are in solving the so-called climate change. The media clip now circulating on social media showed Gates, who was speaking to an audience of his inner circle in 2018, saying that wind, solar, battery technology and […]", "lang": "en", "keywords": "badclimate,badfood,badhealth,badscience,big government,bill gates,biotech,Clean Energy,climate alarmism,conspiracy,covid-19,Dangerous,fake meat,food science,food supply,frankenfoods,globalists,GMO,GMO foods,government,green energy,grocery,lunatics,processed food,products,Tyranny", "favicon": "wp-content/themes/ScienceTheme/images/Climate-fav.png", "canonical": "https://www.climate.news/2022-10-02-video-reveals-gates-admitting-clean-energy-a-scam.html", "encoding": "UTF-8"}, "image": null, "domain": "www.climate.news", "title": "Video shows Bill Gates admitting “clean energy” solving climate change is a SCAM", "cleaned_text": "A video resurfacing on the internet has shown Big Tech mogul Bill Gates laughing at how insufficient “clean energy” resources are in solving the so-called climate change.\n\nThe media clip now circulating on social media showed Gates, who was speaking to an audience of his inner circle in 2018, saying that wind, solar, battery technology and other renewable energy sources might be fashionable, but they are not capable of solving man-made global warming.\n\n“That doesn’t solve the reliability problem,” Gates said in the video referring to the renewable energy they were discussing. “Whatever came up with this term ‘clean energy,’ I think it screwed up people’s minds because they don’t understand.”\n\nNow analysts are pointing to the fact that Gates has seemed to contradict the same statement with his commitment to limiting global warming to less than 1.5 degrees Celsius above pre-industrial levels while ensuring that the energy of the future – clean and green resources – is affordable, secure and inclusive.\n\nGates even blamed the cows for producing methane in the animal’s digestive system. It is just questionable to others that he is capitalizing on this as he sells the idea of feeding the world his lab-made “synthetic and fake” meat as an alternative to real beef products and as a solution to climate change.\n\nNational Cattlemen’s Beef Association CEO Colin Woodall said Gates chose to focus on beef production because, in truth, he is heavily invested in the same fake meat companies he is promoting.\n\n“So, it’s not surprising he continues to push an agenda that would replace real beef with protein alternatives in ‘rich countries.’ He has even gone so far as to claim that perhaps a government mandate is the best way to get consumers to eat their dose of fake meat,” Woodall said.\n\nGates has a clear financial motive in promoting fake food\n\nNewsPunch‘s Baxter Dmitry also commented in an article that there is of course a clear financial motive to Gates’ plan in getting people to consume his fake food, just as there had been with his Wuhan coronavirus (COVID-19) “investments.”\n\n“This is the man who admitted he ordered President [Donald] Trump not to investigate the possible side-effects of the new COVID vaccinations,” Dmitry said, noting that Gates has a history of being suspiciously one step ahead of major world disasters and capitalizing on them when they arrive.\n\nThe billionaire has reportedly been buying up vast farmlands all over the United States. Last year, he became the biggest private farmland owner, with some 270,000 acres across dozens of states, according to last year’s edition of the Land Report 100, an annual survey of the nation’s largest landowners. (Related: Bill Gates granted legal approval to purchase 2,100 acres of farmland in North Dakota.)\n\nIncidentally, there have been reports that farmers are incentivized to not farm, there have been various attacks on the food supply and food processing plants are being burned down.\n\nThe Gates-funded Lab Meat and Lab Dairy lobby are gaining significant traction as more and more tycoons hailing from Silicon Valley step up to back the effort. They are wiping out whole foods, along with the family farms and ranches that produce true and organic food.\n\nNatural Health 365 warned the public that they may have been consuming unregulated and unlabeled genetically modified food (GMO) for years and are not aware. The health and wellness website included cream cheese, ice cream and snack bars to often contain GMO additives. These foods have no regulations regarding their GMO status because they fall outside the purview of the agencies that should be regulating our food.\n\n“Companies are using vague or misleading terms and people generally don’t understand that at least some of the ingredients in that list are GMO. Some common terms include ‘fermentation technology’ and ‘synthetic biology,'” the article noted. Lab meats and dairy are also being bioengineered and marketed to the public while pasturing of animals, holistic grazing, and organic farming are becoming increasingly vilified.\n\nCritics are saying the globalists are going this far just to put the farmers and ranchers out of business.\n\nVisit ClimateAlarmism.news for more news related to the globalists’ false climate change narrative to usher in green tyranny and fake foods.\n\nWatch this video where Gates was caught admitting climate change is a scam.\n\nThis video is from the Conservative Politics & NWO channel on Brighteon.com.\n\nJosh Sigurdson: Bill Gates bribing MSM to promote false climate change narrative and usher in Great Reset.", "opengraph": {"title": "Video shows Bill Gates admitting “clean energy” solving climate change is a SCAM", "type": "article", "url": "https://www.climate.news/2022-10-02-video-reveals-gates-admitting-clean-energy-a-scam.html", "site_name": "Climate News", "description": "A video resurfacing on the internet has shown Big Tech mogul Bill Gates laughing at how insufficient “clean energy” resources are in solving the so-called climate change. The media clip now circulating on social media showed Gates, who was speaking to an audience of his inner circle in 2018, saying that wind, solar, battery technology and […]", "image": "https://www.climate.news/wp-content/uploads/sites/381/2022/10/Editorial-Use-Bill-Gates-2.jpg"}, "tags": ["conspiracy", "government", "big government", "lunatics", "green energy", "frankenfoods", "covid-19", "globalists", "products", "biotech", "GMO foods", "Clean Energy", "grocery", "Dangerous", "bill gates", "Tyranny", "fake meat", "food science", "food supply", "GMO"], "tweets": [], "movies": [], "links": ["https://newspunch.com/bill-gates-caught-admitting-climate-change-is-wef-scam-to-inner-circle/", "https://www.weforum.org/topics/future-of-energy", "https://www.drovers.com/opinion/bill-gates-let-them-eat-fake-meat", "https://www.brighteon.tv", "https://frankenfood.news/", "https://landreport.com/2021/01/farmer-bill/", "https://naturalnews.com/2022-07-06-bill-gates-granted-approval-to-purchase-farmland.html", "https://www.naturalhealth365.com/no-escape-bill-gates-wef-push-gmo-foods-end-food-as-we-know-it.html", "https://climatealarmism.news/", "https://www.brighteon.com/618d8551-6538-4d5e-a14d-74f3775c460f", "https://www.brighteon.com/channels/starblazer", "https://naturalnews.com/2022-08-29-gates-bribing-msm-promote-climate-change-narrative.html", "https://greatreset.news/2022-05-27-bill-gates-bioterrorists-plan-for-global-control.html", "https://frankenfood.news/2022-09-22-bill-gates-wef-promoting-dangerous-gmo-foods.html", "https://GMO.news/2022-08-02-bill-gates-transform-natural-bananas-into-gmo-frankenfood.html", "https://newspunch.com/bill-gates-caught-admitting-climate-change-is-wef-scam-to-inner-circle/", "https://www.weforum.org/topics/future-of-energy", "https://www.drovers.com/opinion/bill-gates-let-them-eat-fake-meat", "https://landreport.com/2021/01/farmer-bill/", "https://www.naturalhealth365.com/no-escape-bill-gates-wef-push-gmo-foods-end-food-as-we-know-it.html", "https://www.brighteon.com/618d8551-6538-4d5e-a14d-74f3775c460f", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fclimatenews%2F2022-10-02-video-reveals-gates-admitting-clean-energy-a-scam.html&linkname=Video%20shows%20Bill%20Gates%20admitting%20%E2%80%9Cclean%20energy%E2%80%9D%20solving%20climate%20change%20is%20a%20SCAM", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}