{"result_id": "072024", "URL": "https://climate.news/2022-04-28-world-agency-demands-locking-cities-climate-goals.html", "timestamp": "2023-04-25 14:45:26 CEST+0200", "meta": {"description": "In order to reduce oil use and shift the world over to the “green” energy paradigm demanded by the powers that be, the International Energy Agency (IEA) is calling on governments around the world to impose new climate “lockdowns.” According to the IEA, achieving the “climate goals” of the elite is only possible if politicians […]", "lang": "en", "keywords": "big government,Climate,climate alarmism,climate change,conspiracy,environment,extremism,fascism,fossil fuel,global tyranny,global warming,Green New Deal,green tyranny,insanity,International Energy Agency,lockdowns,propaganda", "favicon": "wp-content/themes/ScienceTheme/images/Climate-fav.png", "canonical": "https://climate.news/2022-04-28-world-agency-demands-locking-cities-climate-goals.html", "encoding": "UTF-8"}, "image": null, "domain": "climate.news", "title": "Here come the CLIMATE LOCKDOWNS: World agency demands locking down cities to achieve “climate goals”", "cleaned_text": "Here come the CLIMATE LOCKDOWNS: World agency demands locking down cities to achieve “climate goals”\n\nIn order to reduce oil use and shift the world over to the “green” energy paradigm demanded by the powers that be, the International Energy Agency (IEA) is calling on governments around the world to impose new climate “lockdowns.”\n\nAccording to the IEA, achieving the “climate goals” of the elite is only possible if politicians force everyone – at gunpoint, if necessary – to stay at home. (Related: China is already imposing another round of lockdowns on its citizens, though the communist regime is still using the covid plandemic script as its cover story.)\n\nSunday laws that restrict the use of private cars in cities on that day is another IEA proposal contained in its “A 10-Point Plan to Cut Oil Use” plan. Other proposals include reducing speed limits, forcing people to work at home, eliminating business air travel, and imposing a new “tax” on SUVs.\n\n“Governments have all the necessary tools at their disposal to put oil demand into decline in the coming years, which would support efforts to both strengthen energy security and achieve vital climate goals,” read the report from IEA.\n\n“Reducing highway speed limits by about 6 miles per hour; more working from home; street changes to encourage walking and cycling; car-free Sundays in cities and restrictions on other days; cutting transit fares; policies that encourage more carpooling; cutting business air travel,” it further stated.\n\nThe “solutions” to COVID, climate change and the war in Ukraine are all exactly the same: global tyranny\n\nThe IEA also suggested “restricting private cars’ use of roads in large cities to those with even number plates some weekdays and to those with odd-numbered plates on other weekdays.”\n\n“Banning the use of private cars on Sundays brings a number of additional benefits to publish health and well being,” the world agency further stated.\n\nAll of this and more, the IEA claimed, will help to “achieve vital climate goals,” which apparently entail imprisoning the entire population of the planet under draconian new policies that restrict movement and force everyone into isolation.\n\nIt sounds a whole lot like the blueprint that was unveiled under the Wuhan coronavirus (COVID-19) plandemic, which laid the groundwork for a global totalitarian medical police state.\n\nAmericans and many others were forced to stay at home, wear a mask and get “vaccinated” before the government slightly pulled back. Soon, the rubber band will release like a slingshot for the next round of tyranny that appears to have climate change and “global warming” as its cover story.\n\nFormer Capitol Hill staffer and owner of the Climate Depot website Marc Morano pointed out that this “sounds an awful lot like an energy version of COVID lockdowns.”\n\n“Instead of opening America back up for domestic energy production, we are told to suffer and do with less and are prescribed the same failed lockdown-style policies we endured for COVID,” Morano wrote.\n\n“It is odd how COVID ‘solutions’ also allegedly helped the climate and now the same solutions are being touted to deal with Russia’s invasion of Ukraine.”\n\nThe proposed “solutions” to COVID, climate change and now the Russia-Ukraine war “are all exactly the same,” Morano noted, explaining that it entails “hammer the poor and middle class with more restrictions on travel, less freedom and even more surrendering of power to unelected government regulators.”\n\nIn the comment section at Neon Nettle, someone wrote that a much better solution would be to overthrow the tyrants pushing this tyranny on us in the first place.\n\n“Lucky for us, the IEA has about as much authority as a feather in a hurricane,” wrote another.\n\nMore related news coverage about climate insanity can be found at Climate.news.", "opengraph": {"title": "Here come the CLIMATE LOCKDOWNS: World agency demands locking down cities to achieve “climate goals”", "type": "article", "url": "https://www.climate.news/2022-04-28-world-agency-demands-locking-cities-climate-goals.html", "site_name": "Climate News", "description": "In order to reduce oil use and shift the world over to the “green” energy paradigm demanded by the powers that be, the International Energy Agency (IEA) is calling on governments around the world to impose new climate “lockdowns.” According to the IEA, achieving the “climate goals” of the elite is only possible if politicians […]", "image": "https://www.climate.news/wp-content/uploads/sites/381/2022/04/Lockdown-House-Concept.jpg"}, "tags": ["conspiracy", "fossil fuel", "big government", "Climate", "climate change", "fascism", "Green New Deal", "extremism", "International Energy Agency", "environment", "global tyranny", "green tyranny", "global warming", "insanity", "lockdowns", "propaganda"], "tweets": [], "movies": [], "links": ["https://neonnettle.com/features/1968-top-global-agency-demands-lockdowns-to-reduce-oil-use", "https://naturalnews.com/2022-04-25-first-shanghai-now-beijing-china-lockdown-spree.html", "https://www.brighteon.tv", "https://climate.news", "https://neonnettle.com/features/1968-top-global-agency-demands-lockdowns-to-reduce-oil-use", "https://naturalnews.com/2022-04-25-first-shanghai-now-beijing-china-lockdown-spree.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fclimatenews%2F2022-04-28-world-agency-demands-locking-cities-climate-goals.html&linkname=Here%20come%20the%20CLIMATE%20LOCKDOWNS%3A%20World%20agency%20demands%20locking%20down%20cities%20to%20achieve%20%E2%80%9Cclimate%20goals%E2%80%9D", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}