{"result_id": "072016", "URL": "https://climate.news/2022-10-04-ny-bans-gasoline-powered-vehicles-by-2035.html", "timestamp": "2023-04-25 14:45:20 CEST+0200", "meta": {"description": "The state of New York is set to follow the example of California, banning new sales of gasoline-powered cars by 2035 in a bid to reach its “zero-emissions target.” A Sept. 29 announcement by New York Gov. Kathy Hochul mandated the New York State Department of Environmental Conservation to “take major regulatory action that will require […]", "lang": "en", "keywords": "badpollution,banned,big government,California,carbon dioxide,climate alarmism,climate change,electric cars,electric vehicles,environment,fossil fuel,gasoline-powered cars,green tyranny,greenhouse gases,insanity,Kathy Hochul,New York,zero emissions", "favicon": "wp-content/themes/ScienceTheme/images/Climate-fav.png", "canonical": "https://climate.news/2022-10-04-ny-bans-gasoline-powered-vehicles-by-2035.html", "encoding": "UTF-8"}, "image": null, "domain": "climate.news", "title": "NY follows California’s example, bans gasoline-powered vehicles by 2035", "cleaned_text": "NY follows California’s example, bans gasoline-powered vehicles by 2035\n\nThe state of New York is set to follow the example of California, banning new sales of gasoline-powered cars by 2035 in a bid to reach its “zero-emissions target.”\n\nA Sept. 29 announcement by New York Gov. Kathy Hochul mandated the New York State Department of Environmental Conservation to “take major regulatory action that will require all new passenger cars, pickup trucks and SUVs sold in New York state to be zero emissions by 2035.”\n\n“This is a crucial regulatory step to achieving significant greenhouse gas emission reductions from the transportation sector and is complemented by new and ongoing investments … including electric vehicle infrastructure progress, zero-emission vehicle incentives and ensuring New York’s communities benefit from historic federal climate change investments.”\n\nThe effort is being supported by hundreds of millions of dollars in taxpayer money. According to the Daily Wire, the Empire State will spend at least $250 million in federal dollars – with about $175 million earmarked toward the construction of electric vehicle (EV) charging stations.\n\nHochul’s order did not ban gasoline-powered vehicles in one fell swoop. Her mandate requires “an increasing percentage of new, light-duty vehicle sales to be zero-emission vehicles starting with 35 percent of sales by 2026, 67 percent of sales by 2030 and 100 percent of sales by 2035.”\n\n“New pollutant standards for model year 2026 through model year 2034 passenger cars, light-duty truck and medium-duty vehicles with internal combustion engines would also be required.” (Related: Barcelona to ban cars over 20 years old in effort to fight air pollution.)\n\nNew York’s move follows that of the Golden State, whose chief executive Gov. Gavin Newsom announced a similar ban. The prohibitions were weaved in as an amendment to a 2020 executive order that sought to “put the state on a path to carbon neutrality by 2045.”\n\nThe California order also applied a progressive phase-out of gasoline-powered vehicles. From 12 percent in the current year, sales of electric vehicles will be increased to 35 percent in 2026. It will then be increased to 51 percent in 2028 and 68 percent in 2030, before reaching 100 percent in 2035.\n\nDuring the Sept. 29 press conference where Hochul announced the ban on gasoline-powered cars, she claimed that EVs have been in New York for “over a hundred years.” The Democratic governor added that car makers built EVs in order for wives to “have some freedom [from] domestic servitude” while their husbands were at work.” Hochul added that EVs ‘”gave women the freedom to drive” as their gasoline-powered counterparts were difficult to operate.\n\nDuggan Flanakin, a policy analyst with the free-market environmental advocacy group Committee for a Constructive Tomorrow, denounced Hochul’s new order. He argued that getting rid of gas-powered cars in New York state shows how the urban elites have “contempt” for rural Americans.\n\n“None of this march away from reliable, proven [internal combustion engines] makes any sense to rural Americans, those who live in hurricane-prone areas and anyone who drives cross-country,” he wrote.\n\n“Farmers today can run their tractors off biodiesel made right down the road, and drive to distant towns for groceries and supplies in their 20-year-old pickups. Hurricanes, earthquakes and other natural and human-caused disruptive events can shut down electric power for days in large areas.”\n\nFlanakin ultimately issued this challenge: “Imagine if 200 million internal combustion engine vehicle owners – or even two million – decided to work together to fight against the outrageous, unworkable, anti-democratic and bankrupting mandates forcing everyone into EVs most cannot afford and do not want, and to effectively exclude billions from being allowed to drive at all.”\n\nWatch Elijah Schaffer of Next News Network discuss New York state’s impending ban on gasoline-powered cars.\n\nThis video is from the NewsClips channel on Brighteon.com.\n\nAll electric in 20 years? California lawmaker floats a bill to ban gasoline cars by 2040.\n\nGREEN GOES STUPID: California to ban sale of gasoline-powered cars by 2035.\n\nThe future of electric cars is not the future California thinks it is.\n\nCalifornia moves to ban sales of gas-powered cars by 2035.", "opengraph": {"title": "NY follows California’s example, bans gasoline-powered vehicles by 2035", "type": "article", "url": "https://www.climate.news/2022-10-04-ny-bans-gasoline-powered-vehicles-by-2035.html", "site_name": "Climate News", "description": "The state of New York is set to follow the example of California, banning new sales of gasoline-powered cars by 2035 in a bid to reach its “zero-emissions target.” A Sept. 29 announcement by New York Gov. Kathy Hochul mandated the New York State Department of Environmental Conservation to “take major regulatory action that will require […]", "image": "https://www.climate.news/wp-content/uploads/sites/381/2022/10/Electrical-car-charging-station-grid-power-energy.jpg"}, "tags": ["fossil fuel", "big government", "climate change", "zero emissions", "banned", "gasoline-powered cars", "electric cars", "New York", "environment", "Kathy Hochul", "green tyranny", "insanity", "carbon dioxide", "California", "electric vehicles", "greenhouse gases"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/news/new-york-set-to-join-california-in-banning-new-gasoline-powered-vehicles-by-2035/", "http://banned.news", "https://naturalnews.com/2017-03-11-barcelona-to-ban-cars-over-twenty-years-old-in-effort-to-fight-air-pollution.html", "https://www.brighteon.tv", "https://nypost.com/2022/08/24/california-to-ban-new-gas-powered-cars-by-2035/", "https://greentyranny.news", "https://www.brighteon.com/5daf7bfe-d5fb-4535-9e28-d2b8459c19b1", "https://www.brighteon.com/channels/newsclipsnow", "https://biggovernment.news/2022-09-12-states-emulating-california-banning-gas-powered-cars.html", "https://robocars.news/2017-12-23-all-electric-in-20-years-california-lawmaker-floats-a-bill-to-ban-gasoline-cars-by-2040.html", "https://stupid.news/2022-08-30-california-to-ban-gas-powered-cars-2035.html", "https://collapse.news/2022-06-06-electric-cars-not-the-future.html", "https://climatealarmism.news/2020-10-09-california-bans-sales-of-gas-cars-2035.html", "https://www.lifesitenews.com/news/new-york-set-to-join-california-in-banning-new-gasoline-powered-vehicles-by-2035/", "https://nypost.com/2022/08/24/california-to-ban-new-gas-powered-cars-by-2035/", "https://www.brighteon.com/5daf7bfe-d5fb-4535-9e28-d2b8459c19b1", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fclimatenews%2F2022-10-04-ny-bans-gasoline-powered-vehicles-by-2035.html&linkname=NY%20follows%20California%E2%80%99s%20example%2C%20bans%20gasoline-powered%20vehicles%20by%202035", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}