{"result_id": "072027", "URL": "https://www.climate.news/2021-11-21-media-blaming-climate-change-sudden-surge-heart-disease.html", "timestamp": "2023-04-25 14:45:27 CEST+0200", "meta": {"description": "In a desperate attempt to deflect from the “clot shots” (Wuhan coronavirus “vaccines”), the mainstream media is now claiming that the sudden and massive spike in heart attacks this year is due to “broken heart syndrome,” “pandemic anxiety,” and even cannabis use. Formerly known as takotsubo or stress cardiomyopathy, so-called broken heart syndrome is supposedly […]", "lang": "en", "keywords": "badclimate,badhealth,badmedicine,badscience,broken heart syndrome,cannabis,climate change,COVID,genocide,global warming,heart attacks,heart health,Journalism,left cult,mainstream media,Media Lies,pandemic,pandemic anxiety,Plandemic,propaganda,stupid,Vaccine deaths,vaccine injury,vaccines", "favicon": "wp-content/themes/ScienceTheme/images/Climate-fav.png", "canonical": "https://www.climate.news/2021-11-21-media-blaming-climate-change-sudden-surge-heart-disease.html", "encoding": "UTF-8"}, "image": null, "domain": "www.climate.news", "title": "Mainstream media blaming “climate change, “broken heart syndrome, “pandemic anxiety” – ANYTHING but the injections – for sudden surge in heart disease", "cleaned_text": "Mainstream media blaming “climate change, “broken heart syndrome, “pandemic anxiety” – ANYTHING but the injections – for sudden surge in heart disease\n\nIn a desperate attempt to deflect from the “clot shots” (Wuhan coronavirus “vaccines”), the mainstream media is now claiming that the sudden and massive spike in heart attacks this year is due to “broken heart syndrome,” “pandemic anxiety,” and even cannabis use.\n\nFormerly known as takotsubo or stress cardiomyopathy, so-called broken heart syndrome is supposedly causing women over the age of 50 to develop weakened heart muscles, shortness of breath, and chest pain – and none of this has anything at all to do with Fauci Flu shots, we are told.\n\nEven though this heart disease surge came about right as the “Operation Warp Speed” injections from the Trump administration started getting plunged into people’s arms, the lying corporate media wants the general public to believe that feeling sad is somehow the true culprit.\n\nThere are also headlines blaming “climate change” and “global warming” for a similar surge in heart problems among young children and even babies born to women who took the injections.\n\n“‘Climate change is changing babies in the womb: they are more susceptible to heart disease,'” reads one ridiculous headline from a Dutch news outlet called De Morgen.\n\nAnother from The Sunday Times blames the rise in heart attacks on “pandemic stress and poor diet.”\n\nOnly the Times, it turns out, broached the real issue in the body of its article, suggesting that there might be an “outside chance” that Covid-19 injection “played a part” in this rising disease trend.\n\nThe plandemic narrative is really starting to crack\n\nAseem Malhotra, a cardiologist and chairman of a charity called the Public Health Collaboration, compared the current plandemic crisis to a war zone, suggesting that people are experiencing some kind of PTSD-like trauma that is causing their hearts to fail.\n\nIn war zones, Malhotra says, heart attacks and strokes have been known to increase among civilians who get caught in the crossfire. The plandemic, he insists, could be creating a similar effect – but not because of the jabs, apparently.\n\nNo, people’s arteries are getting blocked because of the lockdowns, he says.\n\n“With the vaccines we already know that in the short term there was a clotting blood issue,” Malhotra is quoted as saying. “At the moment I do not think there is any strong indication this is vaccine-related.”\n\nAt the same time, “we cannot completely discount it,” Malhotra added. “We should keep one eye on it in the coming months.”\n\nPfizer, meanwhile, claims that there is no risk of heart problems from taking its injections. In a propaganda article it published, Pfizer wrote that “cardiac arrest is not a recognized side effect,” and if you claim otherwise the company’s CEO, Albert Bourla, wants you jailed.\n\n“Is there no end to the lies?” asked one commenter at Information Liberation.\n\nSomeone else responded with a famous quote from former CIA head William Casey (1981-1987) who said:\n\n“We’ll know our disinformation program is complete when everything the American public believes is false.”\n\n“Fauci now admits the ‘vaccine’ isn’t working as planned, meaning it will take more and possibly endless ‘booster’ shots to stop Covid-19,” wrote another commenter about the ever-shifting plandemic narrative surrounding the injections.\n\n“The fundamental flaw in Fauci’s argument, established by the CDC itself, is that the virus was never a serious threat to any but the immunocompromised and those elderly with several co-morbidities whose death could subsequently and dishonestly be attributed to Covid-19 through false PCR positives … It is a fact the shots do not stop the disease, and the claim they ameliorate the symptoms is unwarranted by the evidence and nothing more at this point than a self-serving conjecture.”\n\nMore of the latest news about Chinese Virus injection deception can be found at ChemicalViolence.com.", "opengraph": {"title": "Mainstream media blaming “climate change, “broken heart syndrome, “pandemic anxiety” – ANYTHING but the injections – for sudden surge in heart disease", "type": "article", "url": "https://www.climate.news/2021-11-21-media-blaming-climate-change-sudden-surge-heart-disease.html", "site_name": "Climate News", "description": "In a desperate attempt to deflect from the “clot shots” (Wuhan coronavirus “vaccines”), the mainstream media is now claiming that the sudden and massive spike in heart attacks this year is due to “broken heart syndrome,” “pandemic anxiety,” and even cannabis use. Formerly known as takotsubo or stress cardiomyopathy, so-called broken heart syndrome is supposedly […]", "image": "https://www.climate.news/wp-content/uploads/sites/381/2021/11/heart-attack.jpg"}, "tags": ["pandemic", "climate change", "left cult", "Journalism", "COVID", "Media Lies", "heart attacks", "pandemic anxiety", "global warming", "propaganda", "heart health", "stupid", "broken heart syndrome", "mainstream media", "cannabis", "Vaccine deaths", "vaccine injury", "genocide", "vaccines", "Plandemic"], "tweets": [], "movies": [], "links": ["http://www.informationliberation.com/?id=62669", "https://www.naturalnews.com/2021-11-18-aha-blames-cannabis-heart-disease-covid-vaccines.html", "https://www.brighteon.tv", "https://www.naturalnews.com/2021-11-11-pfizer-ceo-people-spreading-misinformation-should-be-jailed.html", "http://chemicalviolence.com", "http://www.informationliberation.com/?id=62669", "https://www.naturalnews.com/2021-11-18-aha-blames-cannabis-heart-disease-covid-vaccines.html", "https://www.naturalnews.com/2021-11-11-pfizer-ceo-people-spreading-misinformation-should-be-jailed.html"], "authors": [], "publish_date": null}