{"result_id": "073021", "URL": "https://cnnsofake.news/2022-05-25-cnn-suggests-mrna-injections-cause-covid.html", "timestamp": "2023-04-25 14:45:44 CEST+0200", "meta": {"description": "Pigs might be about to fly now that fake news giant CNN is admitting, in a surprising turn of events, that Wuhan coronavirus (Covid-19) “vaccines” may actually be causing the constant and continual waves of covid infection that are being reported all around the world. After denying, denying, and denying some more that the jabs […]", "lang": "en", "keywords": "badhealth,badmedicine,badscience,CNN,COVID,immune system,mRNA,pandemic,Plandemic,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://cnnsofake.news/2022-05-25-cnn-suggests-mrna-injections-cause-covid.html", "encoding": "UTF-8"}, "image": null, "domain": "cnnsofake.news", "title": "CNN now publicly asking whether mRNA injections have CAUSED the current covid wave – exactly as we’ve been saying since day one", "cleaned_text": "CNN now publicly asking whether mRNA injections have CAUSED the current covid wave – exactly as we’ve been saying since day one\n\nPigs might be about to fly now that fake news giant CNN is admitting, in a surprising turn of events, that Wuhan coronavirus (Covid-19) “vaccines” may actually be causing the constant and continual waves of covid infection that are being reported all around the world.\n\nAfter denying, denying, and denying some more that the jabs are doing anything other than “saving lives,” CNN is beginning to question the legitimacy of the baseless government claim that Fauci Flu shots are “safe and effective.”\n\nAccording to CNN, scientists are “urgently trying to solve … another piece of the immunity puzzle” concerning mRNA (messenger RNA) technology and its apparent propensity for making things worse rather than better as far as public health is concerned. (Related: One of the ways the jabs are making this worse is by giving people AIDS.)\n\nCNN speculates that the “drop off in our protection” against the Chinese Virus might be the result of the mRNA injections from Moderna and Pfizer-BioNTech, “which were the first in the world to use this platform.”\n\nTony Fauci has decided to chime in as well, but in a much more deceitful way, of course. He says that “we got a really great platform with mRNA,” but that we need to “try to be better” with it because this version of it is not exactly producing the health outcomes he long promised.\n\n“The United States is at a point in the pandemic now where health officials are grappling with the fact that to maintain immunity against Covid-19 in the community, the nation will either need to administer booster shots on a regular – or possibly annual – basis, or will need to rollout [sic] an entirely new vaccine altogether,” CNN now admits.\n\nUh, oh: that certainly does not sound good or promising. We went from the jabs supposedly providing a pathway out of the plandemic to the jabs now keeping the plandemic going possibly forever when it otherwise would have ended by now.\n\n“What you’re seeing here is the first steps toward an official acknowledgement that the mRNA vaccines have failed and new vaccines are coming sooner or later,” writes Alex Berenson on his Substack.\n\nHow many more injections will people take before they realize the government has been lying to them the entire time?\n\nSince so few people are taking the so-called “booster” shots still being pushed by the Biden regime, that program will likely fall by the wayside and disappear in the coming months, only to be replaced by something else.\n\nThe White House will likely claim that “mRNA vaccine hesitancy has risen to unsustainable levels,” Berenson suggests. This will be followed by the introduction of a “new” jab technology that more than likely has already been waiting in the wings for years to be introduced when the time is just right.\n\n“They may even be cynical enough to blame those of us who were right all along for said hesitancy,” Berenson writes.\n\n“The great mRNA experiment will come to an end, not with a bang but with 200 million expired doses in freezers. The most likely but by no means certain outcome is: zero long-term benefit, zero to some long-term harm, and $100 billion-plus for Pfizer and the gang.”\n\nThese repeated attempts by the powers that be to play God keep failing and they always will fail. Unfortunately, millions of people have yet to wake up to the scam and will likely continue to take whatever the government rolls out next as the solution to the problem it created with its previous solution.\n\nJust as a reminder: Natural News has been warning about all of this since day one. We told our readers to beware of the jabs, especially the ones created using mRNA because the technology has never before been used in a human application – and perhaps more importantly, it has never been successfully used in any application, animal or otherwise.\n\nThe whole thing is a dangerous scam, and the reality of this is even now being admitted, albeit in a roundabout way, by the likes of CNN.\n\n“The harm is monstrous all over the globe,” wrote a commenter at Berenson’s Substack. “Immune systems are now seriously compromised. Every major scientist who warned about this was banned.”\n\n“Geert Vanden Bossche was one, Yeadon, Montagnier, McCullough, more. Pfizer knew. Naomi Wolf found the empty brackets for a total of 6 boosters. Pfizer knew this was a ‘leaky injection.'”\n\nSomeone else responded to this person by explaining how she has so many “formerly healthy girlfriends” in their 40s who are now complaining about constant headaches and gut issues.\n\n“None of them connect it to 3 bouts of spike protein via vaccines and having a bad case of covid,” this person added. “I am there to ask them though they find my question distasteful.”\n\nMore news coverage about the failed plandemic injections can be found at ChemicalViolence.com.", "opengraph": {"title": "CNN now publicly asking whether mRNA injections have CAUSED the current covid wave – exactly as we’ve been saying since day one", "type": "article", "url": "https://www.cnnsofake.news/2022-05-25-cnn-suggests-mrna-injections-cause-covid.html", "site_name": "CNN So Fake News", "description": "Pigs might be about to fly now that fake news giant CNN is admitting, in a surprising turn of events, that Wuhan coronavirus (Covid-19) “vaccines” may actually be causing the constant and continual waves of covid infection that are being reported all around the world. After denying, denying, and denying some more that the jabs […]", "image": "https://www.cnnsofake.news/wp-content/uploads/sites/392/2022/05/Doctor-Mask-Close-Up-Covid-19-Vial-Vaccine.jpg"}, "tags": ["pandemic", "vaccine wars", "COVID", "CNN", "vaccines", "immune system", "Plandemic", "mRNA"], "tweets": [], "movies": [], "links": ["https://alexberenson.substack.com/p/urgent-the-pandemics-wrongest-man/comments?s=r", "https://naturalnews.com/2022-04-13-pfizer-moderna-mrna-vaccines-trigger-aids-syndrome.html", "http://chemicalviolence.com", "https://alexberenson.substack.com/p/urgent-the-pandemics-wrongest-man/comments?s=r", "https://naturalnews.com/2022-04-13-pfizer-moderna-mrna-vaccines-trigger-aids-syndrome.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcnnsofakenews%2F2022-05-25-cnn-suggests-mrna-injections-cause-covid.html&linkname=CNN%20now%20publicly%20asking%20whether%20mRNA%20injections%20have%20CAUSED%20the%20current%20covid%20wave%20%E2%80%93%20exactly%20as%20we%E2%80%99ve%20been%20saying%20since%20day%20one", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}