{"result_id": "073039", "URL": "https://cnnsofake.news/2022-01-27-jake-tapper-sold-his-soul-to-pharma.html", "timestamp": "2023-04-25 14:45:55 CEST+0200", "meta": {"description": "Apparently, appalled by robust sales of my bestseller, “The Real Anthony Fauci,” CNN anchor Jake Tapper — in lieu of critically reviewing the work — used his Twitter feed to unleash a barrage of ad hominem insults against me. (Article by Robert F. Kennedy, Jr. republished from ChildrensHealthDefense.org) Breaking with the traditional restraints of journalistic neutrality, […]", "lang": "en", "keywords": "austism truth,badhealth,badmedicine,Big Pharma,CNN,conspiracy,corruption,coverup,Dangerous Medicine,deception,disinfo,Dr. Anthony Fauci,Jake Tapper,Journalism,mainstream media,news cartels,pharmaceutical fraud,propaganda,traitors,vaccine damage,vaccine injury,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://cnnsofake.news/2022-01-27-jake-tapper-sold-his-soul-to-pharma.html", "encoding": "UTF-8"}, "image": null, "domain": "cnnsofake.news", "title": "The day Jake Tapper sold his soul to pharma", "cleaned_text": "The day Jake Tapper sold his soul to pharma\n\nApparently, appalled by robust sales of my bestseller, “The Real Anthony Fauci,” CNN anchor Jake Tapper — in lieu of critically reviewing the work — used his Twitter feed to unleash a barrage of ad hominem insults against me.\n\nBreaking with the traditional restraints of journalistic neutrality, professional propriety and intellectual rigor, he branded me “dangerous,” a “menace,” a “liar,” a “grifter,” a fraud, “unhinged” and more.\n\nBut Tapper’s defamations hang in the atmosphere without substantiation or citation. If I’m a liar, then what was my lie? If I’m a grifter, then what is my personal profit or advantage? If I am a fraud, then where is my inaccurate statement?\n\nI concede that I’m a dangerous menace, but only to the pharmaceutical industry, its captive technocrats and its media toadies.\n\nWhen I responded to his slander with a respectful tweet inviting him to debate me, Tapper declined, explaining he would not debate a “conspiracy theorist.” Characteristically, he neglected to cite any conspiracy theory he believes I promoted.\n\nAnd is it credible to dismiss me as a conspiracy theorist unworthy of debate? After all, I am founder and former president of the world’s largest water protection group, and founder and current chairman of one of the largest children’s health advocacy groups.\n\nI’ve won hundreds of successful lawsuits, including milestone victories against Monsanto, DuPont, Exxon, Smithfield Foods and leading polluters from the chemical, carbon, pharmaceutical and agricultural industries. (Many of these also initially dismissed me as a “conspiracy theorist.”)\n\nMy current book, “The Real Anthony Fauci,” may be the most heavily footnoted volume to ever sit atop global best-seller lists for six consecutive weeks. With 500,000 copies sold, it has attracted a whopping 5,500+ five-star reviews (92%).\n\nDespite extreme hostility toward this volume from mainstream media and the medical cartel, no one has yet identified a factual inaccuracy in its 250,000 words.\n\nIf my book is baseless conspiracy theories, then shouldn’t Mr. Tapper welcome an opportunity to correct me with facts or arguments that go beyond name-calling?\n\nAllow me, then, to offer my own theory for Mr. Tapper’s apoplexy.\n\nMany people make Faustian bargains during their lives, trading personal integrity for material advantage. Oftentimes the metamorphosis occurs as a gradual erosion of moral fiber. Occasionally it happens in an instant; a man stands at a moral crossroads and chooses the dark side.\n\nI happened to have a front-row seat when Jake Tapper had his moment of moral crisis. I’m guessing his fierce vitriol toward me is a reaction to his embarrassment that I was witness to the instant when Mr. Tapper chose career over character.\n\nIn July 2005, Jake Tapper was ABC’s senior producer when the network ordered him to pull a lengthy exposé on the Centers for Disease Control and Prevention’s (CDC) secret 2000 Simpsonwood conference.\n\nHere is the background:\n\nIn 1999, in response to exploding epidemics of autism and other neurological disorders, CDC decided to study its vast Vaccine Safety Datalink — the medical and vaccination record of millions of Americans, archived by the top HMOs — to learn whether the dramatic escalation of the vaccine schedule, beginning in 1989, was a culprit. CDC’s in-house epidemiologist, Thomas Verstraeten, led the effort.\n\nVerstraeten’s initial data run suggested that mercury-containing hepatitis B vaccines — administered during the first month of life — were associated with a wide range of neurological injuries, including a dramatic 1,135% rise in autism risks among vaccinated children.\n\nVerstraeten’s findings propelled CDC into DEFCON 1. The agency’s top vaccine officials summoned 52 pharmaceutical industry leaders, the foremost vaccinologists from academia and the American Academy of Pediatrics (AAP), and public health regulators from the National Institutes of Health, U.S. Food and Drug Administration (FDA), CDC, World Health Organization (WHO) and European Medicines Agency to a secret two-day meeting at the remote Simpsonwood retreat center in Norcross, Georgia, to strategize about how to hide these awful revelations from the public.\n\nIn 2005, I obtained the explosive transcripts of this meeting and was about to publish excerpts in Rolling Stone (Deadly Immunity, July 18, 2005). Those recordings, ironically, portrayed these leading kingpins of the vaccine cartel poised at their own moral brink, and chronicled their collapse into corruption over two sickening days of debate.\n\nMost of these individuals were physicians and regulatory officials who had committed their lives to public health out of idealism and deep concern for children. Verstraeten’s data confronted them with the fact that the cumulative mercury levels in all those new vaccines they had recommended had overdosed a generation of American children with mercury concentrations over a hundred times the exposures the U.S. Environmental Protection Agency considered safe.\n\nIn recommending a vast battery of new vaccines for children, public health regulators had somehow neglected to calculate the cumulative mercury and aluminum loads in all the new jabs.\n\nDr. Peter Patriarca, the then-director of the FDA Office on Vaccine Research and Review, expressed the general feeling of horror when he asked why no one had calculated the cumulative mercury exposure to children as policymakers added this cascade of new vaccines to the childhood schedule: “Conversion of the percentage thimerosal to actual micrograms of mercury involves ninth-grade algebra. What took the FDA so long to do the calculations?”\n\nIn the tense days leading up to the Simpsonwood conclave, children’s health champion Dr. Ruth Etzel of the EPA pleaded with her fellow public health leaders to publicly admit they made a terrible mistake by inadvertently poisoning American children, and to repair the damage.\n\nDr. Etzel urged AAP and the government regulators to handle the crisis with the same honesty and public remorse that Johnson & Johnson had demonstrated on discovering toxic chemicals in its Tylenol formulations:\n\n“We must follow three basic rules: (1) act quickly to inform pediatricians that the products have more mercury than we realized; (2) be open with consumers about why we didn’t catch this earlier; (3) show contrition. If the public loses faith in the Public Health Services recommendations, then the immunization battle will falter. To keep faith, we must be open and honest and move forward quickly to replace these products.”\n\nConfronted with scientific proof of their role in the chronic disease calamity, the cabal did exactly the opposite. The shocking Simpsonwood transcripts show Dr. Patriarca and the other public health panjandrums warning each other of their reputational liabilities, their vulnerability to litigation by plaintiffs’ lawyers and potential damage to the vaccine program.\n\nDr. Patriarca cautioned that public disclosure of CDC’s explosive findings would make Americans feel that the FDA, CDC and vaccine policymakers had been “asleep at the switch” for decades in allowing Thimerosal to remain in childhood vaccines.\n\nOver two days of intense discussion, these Big Pharma operatives and government technocrats persuaded each other to transform their disastrous error into villainy — by doubling down and hiding their mistake from the public.\n\nTapper saw an early draft of my Rolling Stone story and proposed that, in exchange for exclusivity, he would do a companion piece for ABC timed to air on the magazine’s publication day.\n\nTapper spent several weeks working on the story with me and a team of enthusiastic ABC reporters and technicians. During his frequent conversations with me over that period, he was on fire with indignation over the Simpsonwood revelations. He acted like a journalist hoping to win an Emmy.\n\nThe day before the piece was to air, an exasperated Tapper called me to say that ABC’s corporate officials ordered him to pull the story. The network’s pharmaceutical advertisers were threatening to cancel their advertising.\n\n“Corporate told us to shut it down,” Tapper fumed. Tapper told me that it was the first time in his career that ABC officials had ordered him to kill a story.\n\nABC had advertised the Simpsonwood exposé, and its sudden cancellation disappointed an army of vaccine safety advocates and parents of injured children who deluged the network with a maelstrom of angry emails.\n\nIn response, ABC changed tack and publicly promised to air the piece. Instead, following a one-week delay, the network duplicitously aired a hastily assembled puff piece promoting vaccines and assuring listeners that mercury-laden vaccines were safe.\n\nThe new “bait and switch” segment precisely followed Pharma’s talking points. “I’m putting my faith in the Institute of Medicine,” ABC’s obsequious medical editor, Dr. Tim Johnson, declared in closing. Two pharmaceutical advertisements bracketed the story.\n\nAfter that piece aired, I called Jake to complain. He neither answered nor returned my calls.\n\nDuring the 16 intervening years, Pharma has returned Mr. Tapper’s favor by aggressively promoting his career. Pfizer shamelessly sponsors Tapper’s CNN news show, announcing its ownership of the space — and Mr. Tapper’s indentured servitude — before each episode with the loaded phrase: “Brought to you by Pfizer.”\n\nUnder the apparent terms of that sponsorship, CNN and Tapper provide Pfizer a platform to market its products and allow the drug company — a serial felon — to dictate content on CNN.\n\nThis arrangement has transformed CNN’s The Lead with Jake Tapper into a propaganda vehicle for Pharma and effectively reduced Mr. Tapper to the role of a drug rep — shamelessly promoting fear porn, confusion, and germophobia, and ushering his audience toward high-yield patent pharmaceuticals.\n\nTapper’s main thrust during the pandemic has been to promote levels of public terror sufficient to indemnify all the official lies against critical thinking.\n\nAll that Pharma money naturally requires that Mr. Tapper kowtow to Dr. Fauci, and the CNN host’s slavishness has helped make Tapper’s show the go-to pulpit for the National Institute of Allergy and Infectious Diseases (NIAID) director.\n\nIt’s a safe place for Dr. Fauci to hit all Jake’s reliable softballs out of the park.\n\n“The bootlicking competition at CNN is pretty nauseating,” observed investigative journalist Celia Farber who has chronicled Dr. Fauci’s mismanagement at NIAID for more than 25 years. “It’s ruinous for both democracy and for public health.”\n\nAnother journalist has compared Tapper’s mortifying on-air servility toward Dr. Fauci to the adulation of a loyal and obedient canine. “It’s like a dog watching a chess match,” says former New York Times reporter Alex Berenson. “So much intensity and so little understanding.”\n\nTapper has gone two years without asking Dr. Fauci a single tough question. He has covered up Fauci’s involvement with Wuhan, suppressed news of vaccine injuries, gaslighted the injured, and defended every official orthodoxy on masks, lockdowns, social distancing, vaccines, remdesivir, ivermectin and hydroxychloroquine.\n\nHe has never asked about the public health, mental health, and economic costs of lockdown, about the disproportionate burdens of Dr. Fauci’s policies on minorities, the working class and the global poor.\n\nHe has never asked Dr. Fauci to explain why countries and states that refused Dr. Fauci’s prescription have consistently experienced dramatically better health outcomes. For example, why are U.S. death rates 1,000x the death rates of African countries like Nigeria and Indian states that widely use hydroxychloroquine and ivermectin? Mr. Tapper simply never allows contrary views on his show.\n\nHe continues to extol COVID vaccines as a miracle technology that individuals can take four times and still both get and spread the illness.\n\n“He never calls Dr. Fauci on his vacillating science-free pronouncements,” said Farber. “Dr. Fauci seems to be able to paralyze the curiosity features of Tapper’s brain.”\n\nTapper has to ask Dr. Fauci why, under his direction, America suffered the world’s highest body count. With 4.2% of the global population, our nation suffered 15% of COVID deaths.\n\nInstead, he functions as high priest of every official orthodoxy, working to deify Dr. Fauci and anoint all his absurd, vacillating and contradictory pronouncements with papal infallibility. The sure way to earn Tapper’s indignation is to criticize Dr. Fauci.\n\nHere are just a few examples of Mr. Tapper’s brazen deceptions:\n\nOn Feb. 2, 2021, Tapper “debunked” claims that baseball great Hank Aaron may have died from a COVID shot. The home run king submitted to a CDC-staged press conference 17 days earlier. Tapper assured his audience that the Fulton County coroner had determined Aaron to have died from “natural causes.”\n\nWhen the Fulton County coroner subsequently denied ever having seen Aaron’s body, much less performed an autopsy, Tapper refused to correct his story.\n\nIn August 2021, Tapper gave Dr. Fauci a platform to spread the rumor that deluded Americans were poisoning themselves with a “horse medicine” called ivermectin.\n\nIn an Aug. 29, 2021 interview, Dr. Fauci told Tapper, “There’s no evidence whatsoever that that works, and it could potentially have toxicity… with people who have gone to poison control centers because they’ve taken the drug at a ridiculous dose and wind up getting sick. There’s no clinical evidence that indicates that this works.”\n\nTapper never corrected Dr. Fauci. He never pointed out that there were by then 70 peer-reviewed studies demonstrating ivermectin’s miraculous efficacy against COVID.\n\nHe didn’t dispute Dr. Fauci’s characterization of ivermectin as a horse medicine by noting that the drug had won both a Nobel Prize and WHO’s listing as an “essential medicine” for its miraculous efficacy against human illnesses, and that people have consumed billions of doses with no significant safety signals.\n\nMr. Tapper never thought to ask Dr. Fauci if he was trying to discourage use of a cheap, effective drug that might compete with his experimental vaccines.\n\nInstead, Tapper abjectly parroted Dr. Fauci’s talking points: “Poison control centers are reporting that their calls are spiking in places like Mississippi and Oklahoma, because some Americans are trying to use an anti-parasite horse drug called ivermectin to treat coronavirus, to prevent contracting coronavirus.”\n\nIt mattered not to Tapper that both Mississippi and Oklahoma officials quickly denied that anyone in their state had been hospitalized for ivermectin poisoning. Tapper never corrected his false story.\n\nOn Sept. 14, 2021, Tapper obligingly gave Dr. Fauci a platform to dispute rapper Nicki Minaj’s worry that COVID vaccines may affect fertility. Dr. Fauci simply declared, “The answer to that, Jake, is a resounding no.”\n\nAs usual, Tapper did not ask Dr. Fauci to cite a study to support this assertion. He never pointed out to Dr. Fauci that all of the COVID vaccine manufacturers acknowledge that their products are not tested for effects on fertility, or that recent data has shown dramatic upticks in miscarriages and pre-eclampsia in vaccinated women.\n\nNevertheless, based upon Dr. Fauci’s word alone, CNN rushed on to defame and discredit the rapper and to assure the public that Minaj was wrong. Dr. Fauci, after all, had spoken!\n\nIt’s easy to see how two years of such obsequious deference emboldened Dr. Fauci in November 2021 to declare that “I represent science.”\n\nThere are too many other examples of Tapper’s uncritical promotion of government and pharma falsehoods to even summarize. These are not harmless lies. Each of them has potentially disastrous consequences for public health.\n\nThe term “psychological projection” describes the uncanny precision with which a certain sort of person applies the very pejoratives to others that most accurately depict their own shortcomings.\n\nWhen Mr. Tapper calls me “unhinged,” a “menace to public health,” a “fraud,” a “liar,” is he falling victim to projection?\n\nThe critical functions of journalism in a democracy are to speak truth to power, relentlessly expose official corruption, and to forever maintain a posture of skepticism toward government and corporate power centers.\n\nWhat Jake Tapper does is the opposite of journalism. Tapper, instead, aligns himself with power, and makes himself a propagandist for official narratives and a servile publicist for powerful elites and government technocrats.\n\nNo wonder his fury at those who challenge their narratives.", "opengraph": {"title": "The day Jake Tapper sold his soul to pharma", "type": "article", "url": "https://www.cnnsofake.news/2022-01-27-jake-tapper-sold-his-soul-to-pharma.html", "site_name": "CNN So Fake News", "description": "Apparently, appalled by robust sales of my bestseller, “The Real Anthony Fauci,” CNN anchor Jake Tapper — in lieu of critically reviewing the work — used his Twitter feed to unleash a barrage of ad hominem insults against me. (Article by Robert F. Kennedy, Jr. republished from ChildrensHealthDefense.org) Breaking with the traditional restraints of journalistic neutrality, […]", "image": "https://www.cnnsofake.news/wp-content/uploads/sites/392/2022/05/jake-tapper-halpert-face-1476904566-compressed.jpg"}, "tags": ["conspiracy", "Big Pharma", "Journalism", "deception", "coverup", "corruption", "news cartels", "austism truth", "disinfo", "propaganda", "mainstream media", "pharmaceutical fraud", "Dr. Anthony Fauci", "Jake Tapper", "vaccine injury", "CNN", "vaccines", "traitors", "vaccine damage"], "tweets": [], "movies": [], "links": ["https://www.amazon.com/Real-Anthony-Fauci-Democracy-Childrens/dp/1510766804", "https://childrenshealthdefense.org/defender/jake-tapper-sold-soul-pharma-rfk-jr/", "https://twitter.com/jaketapper/status/1471305905216053264?s=20", "https://twitter.com/RobertKennedyJr/status/1473431894561861632?s=20", "https://twitter.com/jaketapper/status/1473686500055437317", "https://waterkeeper.org/", "https://childrenshealthdefense.org/", "https://trofire.com/2019/03/04/ring-of-fires-rfk-jr-wins-award-for-monsanto-trial/", "https://www.pollutiononline.com/doc/west-virginia-jury-finds-dupont-liable-for-pu-0001", "https://www.nytimes.com/1984/04/26/nyregion/exxon-is-sued-by-new-york-over-use-of-hudson-water.html", "http://www.kennedymadonna.com/press/2017/1/23/waterkeeper-alliance-and-smithfield-foods-reach-agreement-on-environmental-pact", "https://www.amazon.com/Real-Anthony-Fauci-Democracy-Childrens/dp/1510766804", "https://www.amazon.com/Real-Anthony-Fauci-Democracy-Childrens/dp/1510766804#customerReviews", "https://childrenshealthdefense.org/wp-content/uploads/2016/10/The-Simpsonwood-Documents.pdf", "https://www.cdc.gov/vaccinesafety/ensuringsafety/monitoring/vsd/index.html", "https://vaccine-safety.s3.amazonaws.com/CDC_FOIA_Response_UnpublishedStudy.pdf", "https://childrenshealthdefense.org/wp-content/uploads/safeminds-generation-zero.pdf", "https://stevekirsch.substack.com/p/what-really-happened-at-simpsonwood", "https://childrenshealthdefense.org/news/deadly-immunity-government-cover-mercuryautism-scandal/", "https://www.nytimes.com/2002/11/10/magazine/the-not-so-crackpot-autism-theory.html", "https://www.govinfo.gov/content/pkg/CHRG-106hhrg72722/html/CHRG-106hhrg72722.htm", "https://childrenshealthdefense.org/wp-content/uploads/THIMEROSAL-TIMELINE-PRE-1999-TO-2004.pdf", "https://childrenshealthdefense.org/defender/lead-poisoning-children-ruth-etzel-epa-whistleblower/", "https://childrenshealthdefense.org/wp-content/uploads/foia-message-from-ruth-etzel-md-to-the-aap-email.pdf", "https://childrenshealthdefense.org/wp-content/uploads/2016/10/The-Simpsonwood-Documents.pdf", "https://childrenshealthdefense.org/wp-content/uploads/foia-peter-patriarca-asleep-at-the-switch-email.pdf", "https://books.google.com/books?id=Wy-CDwAAQBAJ&pg=PT364&lpg=PT364&dq=I%E2%80%99m+putting+my+faith+in+the+Institute+of+Medicine+tim+johnson+simpsonwood&source=bl&ots=ECgSjag8AZ&sig=ACfU3U23L0pjwgyUcq1eE1507D9-UeTnRQ&hl=en&sa=X&ved=2ahUKEwiD94Tvu5v1AhXOFTQIHXIxBhQQ6AF6BAglEAM#v=onepage&q=I%E2%80%99m%20putting%20my%20faith%20in%20the%20Institute%20of%20Medicine%20tim%20johnson%20simpsonwood&f=false", "https://twitter.com/_whitneywebb/status/1450464402000556039?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1450464402000556039%7Ctwgr%5E%7Ctwcon%5Es1_c10&ref_url=https%3A%2F%2Fchildrenshealthdefense.org%2Fdefender%2Fpfizer-vaccination-ads-news-sponsorships-research%2F", "https://violationtracker.goodjobsfirst.org/parent/pfizer", "https://www.cnn.com/shows/the-lead", "https://www.usatoday.com/story/news/factcheck/2020/11/30/fact-check-coronavirus-deaths-africa-far-less-than-u-s/3766222001/", "https://www.statista.com/statistics/1104709/coronavirus-deaths-worldwide-per-million-inhabitants/", "https://www.statista.com/statistics/1104709/coronavirus-deaths-worldwide-per-million-inhabitants/", "https://www.cnn.com/videos/politics/2020/07/15/jake-tapper-fauci-attacks-disgusting-lead-sot-vpx.cnn", "https://www.cnn.com/TRANSCRIPTS/2102/02/cg.02.html", "https://childrenshealthdefense.org/defender/hank-aaron-dies-days-after-receiving-moderna-vaccine/", "https://childrenshealthdefense.org/translation/national-media-pushes-vaccine-misinformation-coroners-office-never-saw-hank-aarons-body/", "https://www.cnn.com/videos/health/2021/08/29/dr-anthony-fauci-ivermectin-covid-19-sotu-vpx.cnn", "https://ivmmeta.com/", "https://www.nobelprize.org/prizes/medicine/2015/press-release/", "https://list.essentialmeds.org/medicines/58", "https://www.cnn.com/videos/health/2021/08/29/dr-anthony-fauci-ivermectin-covid-19-sotu-vpx.cnn", "https://www.zerohedge.com/covid-19/rolling-stone-horse-dewormer-hit-piece-debunked-after-hospital-says-no-ivermectin", "https://twitter.com/atrupar/status/1437876233535172614", "https://tinyurl.com/mv5hjys", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Pre-eclampsia+%2810036485%29&VAX=COVID19", "https://www.cbsnews.com/news/transcript-dr-anthony-fauci-on-face-the-nation-november-28-2021/", "https://childrenshealthdefense.org/defender/jake-tapper-sold-soul-pharma-rfk-jr/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcnnsofakenews%2F2022-01-27-jake-tapper-sold-his-soul-to-pharma.html&linkname=The%20day%20Jake%20Tapper%20sold%20his%20soul%20to%20pharma", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}