{"result_id": "073026", "URL": "https://cnnsofake.news/2022-03-06-primary-function-pharma-controlled-media-fabricate-hit-pieces-truth-about-vaccines.html", "timestamp": "2023-04-25 14:45:48 CEST+0200", "meta": {"description": "One of the primary functions of the corporate, pharma-controlled media is to fabricate HIT PIECES against anyone who tells the truth about vaccine failure, vaccine fraud and vaccine damage. At the January 23rd “Defeat the Mandates” rally in Washington D.C., several speakers took the stage and lambasted the unethical coercion behind today’s vaccine mandates. The […]", "lang": "en", "keywords": "character assassination,corporate media,disinfo,hit pieces,information war,Journalism,journalistic malpractice,misinformation,narrative,New York Times,NYT,reality,RFK Jr,rigged,scientific debate,smeared,social ostracization,social shaming,truth,vaccine failure,vaccine injury,WashPost", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://cnnsofake.news/2022-03-06-primary-function-pharma-controlled-media-fabricate-hit-pieces-truth-about-vaccines.html", "encoding": "UTF-8"}, "image": null, "domain": "cnnsofake.news", "title": "The primary function of the pharma-controlled media is to fabricate HIT PIECES on anyone telling the truth about vaccines", "cleaned_text": "The primary function of the pharma-controlled media is to fabricate HIT PIECES on anyone telling the truth about vaccines\n\nOne of the primary functions of the corporate, pharma-controlled media is to fabricate HIT PIECES against anyone who tells the truth about vaccine failure, vaccine fraud and vaccine damage. At the January 23rd “Defeat the Mandates” rally in Washington D.C., several speakers took the stage and lambasted the unethical coercion behind today’s vaccine mandates. The speakers, led by Robert F. Kennedy, Jr., pinpointed specific examples of vaccine injury and death and chronicled these historic crimes against humanity. The pharma-controlled media ignored the truthfulness of the event and resorted to HIT PIECES to shut down the reality of vaccine-induced death.\n\nThe Times refuses to acknowledge the reality of vaccine failure and injury, resorts to social shaming tactics instead\n\nThe New York Times was one of the first corporate media arms to target the event. The Times conscripted one of their senior writers, Adam Nagourney, to write a hit piece against Kennedy, to smear his message and to try and socially ostracize him. The Time’s front-page article did NOT provide any rational argument against Kennedy’s conclusions. The article did NOT address Kennedy’s well-cited positions and observations, nor did it respectfully address cases of vaccine injury, coercion and fraud. The writer did not interview anyone from the “Defeat the Mandates” rally nor did the Times attempt to report what is really going on with the covid-19 vaccines and all the injured and fed-up people.\n\nInstead, Adam Nagourney interviewed RFK Jrs.’s RELATIVES, arguing that Kennedy’s positions are a disappointment to his family, which of course has no relevance. Instead of debating the science and discussing important facts, Nagourney appealed to social opinion and tried to shame Kennedy in this way. These underhanded tactics have been tried before, but they do not suppress Kennedy and the truth. Kennedy’s points are cleverly articulated and backed up with evidence, and he cannot be socially censored and banished from society, as the pharma-controlled media would like.\n\nIn fact, Kennedy’s Children’s Health Defense has withstood countless censorship attacks and de-platforming from pharma-controlled fact checkers and Big Tech censors. This human rights organization has even withstood attacks from the federal government. In 2021, the Biden regime tried to label Kennedy a source of “covid-19 vaccine disinformation.” The Biden regime announced that Kennedy was part of a “Disinformation Dozen.” The government conspired with Big Tech companies to stop the spread of any information (that told the truth) about covid-19 vaccines.\n\nPharma-controlled media threatens people’s livelihoods, refuses to address the issues at hand\n\nIn this information war, the corporate media is loyal to a narrative – a belief system – driven by fear and control. Throughout this scandal, the data was never truly evaluated and the fraud was never discussed because the corporate media values social standing over evidence-based discussion and debate. The corporate media gauges their success on how well they can impress the “experts” and stay obedient to the $cience.\n\nTime and time again, these hit pieces referred back to some worn-out authority figure such as Drs. Anthony Fauci, Peter Hotez, and Paul Offit – all of whom have financial ties back to vaccine industry. Corporate media didn’t dare deviate from the hand that feeds them, lest they be socially ostracized and cut off. This is why the Times and the rest of the pharma-controlled media use social shaming tactics against truth tellers; they fear they will be the ones ostracized and cut off, so they shame those who do not comply. Journalistic malpractice and group-think ensues. Bullying takes shape through censorship and social shaming.\n\nBut as more people speak up from experience and declare the truth about vaccines, these so-called experts and narrative controllers become the modern-day pariahs, SHAMING THEMSELVES into a corner of depravity – fear, control and abuse. However, the days of journalists threatening people’s livelihoods over vaccine passports and mandates; the days of news anchors cheerleading for Big Pharma and societal division; the days of journalists ignoring the vaccine-injured MUST come to an end, as these propaganda pushers psychologically fade away – like outcasts in exile.\n\nHit the Times back by sending a letter to the editor. Demand that the Times practice real journalism and address the issues at hand.\n\nThe New York Times can be reached at: [email protected]\n\n The International New York Times can be reached at: [email protected]\n\nDean Baquet\n\n Executive Editor\n\n The New York Times Company\n\n 620 Eighth Avenue\n\n New York, NY 10018\n\n [email protected]\n\nJoseph Kahn\n\n Managing Editor\n\n The New York Times Company\n\n 620 Eighth Avenue\n\n New York, NY 10018\n\n [email protected]", "opengraph": {"title": "The primary function of the pharma-controlled media is to fabricate HIT PIECES on anyone telling the truth about vaccines", "type": "article", "url": "https://www.cnnsofake.news/2022-03-06-primary-function-pharma-controlled-media-fabricate-hit-pieces-truth-about-vaccines.html", "site_name": "CNN So Fake News", "description": "One of the primary functions of the corporate, pharma-controlled media is to fabricate HIT PIECES against anyone who tells the truth about vaccine failure, vaccine fraud and vaccine damage. At the January 23rd “Defeat the Mandates” rally in Washington D.C., several speakers took the stage and lambasted the unethical coercion behind today’s vaccine mandates. The […]", "image": "https://www.cnnsofake.news/wp-content/uploads/sites/392/2022/04/The-New-York-Times-America-Fire.jpg"}, "tags": ["character assassination", "Journalism", "NYT", "scientific debate", "RFK Jr", "information war", "New York Times", "journalistic malpractice", "reality", "social ostracization", "truth", "disinfo", "misinformation", "corporate media", "vaccine failure", "hit pieces", "WashPost", "narrative", "rigged", "vaccine injury", "smeared", "social shaming"], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/defender/ny-times-another-hit-piece-rfk-jr/", "https://naturalnews.com/2021-08-25-facebook-exonerates-disinformation-dozen-internationally-censored-defamed-harassed.html", "http://vaccinedamage.news", "/cdn-cgi/l/email-protection", "/cdn-cgi/l/email-protection", "/cdn-cgi/l/email-protection", "/cdn-cgi/l/email-protection", "/cdn-cgi/l/email-protection", "https://childrenshealthdefense.org/defender/ny-times-another-hit-piece-rfk-jr/", "https://naturalnews.com/2021-08-25-facebook-exonerates-disinformation-dozen-internationally-censored-defamed-harassed.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcnnsofakenews%2F2022-03-06-primary-function-pharma-controlled-media-fabricate-hit-pieces-truth-about-vaccines.html&linkname=The%20primary%20function%20of%20the%20pharma-controlled%20media%20is%20to%20fabricate%20HIT%20PIECES%20on%20anyone%20telling%20the%20truth%20about%20vaccines", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}