{"result_id": "073029", "URL": "https://cnnsofake.news/2023-03-26-msm-not-reporting-vaccine-induced-damage-death-hesitancy.html", "timestamp": "2023-04-25 14:45:49 CEST+0200", "meta": {"description": "Folks in the mainstream media (MSM) refuse to report serious injuries and deaths directly caused by the Wuhan coronavirus (COVID-19) clot shot injections, and their excuse is always the same, in that they don’t want to cause any panic or what they term “vaccine hesitancy.” Yet, did you know that vaccines have killed FAR MORE Americans […]", "lang": "en", "keywords": "banned,censored,Censored news,Censorship,chemical spill,clot shot,disinformation,fake news,Fukushima tragedy,hesitancy,Journalism,mainstream media,news cartels,news media,nuclear leak,nuclear reactor leak,nuclear spill,radiation leak,real news,supressed news,toxic spill,vaccine damage,Vaccine deaths,Vaccine injuries,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://cnnsofake.news/2023-03-26-msm-not-reporting-vaccine-induced-damage-death-hesitancy.html", "encoding": "UTF-8"}, "image": null, "domain": "cnnsofake.news", "title": "Mainstream media’s failure to report vaccine-induced damage due to “vaccine hesitancy” is like NOT reporting a nuclear attack for fear of “nuclear energy hesitancy”", "cleaned_text": "Mainstream media’s failure to report vaccine-induced damage due to “vaccine hesitancy” is like NOT reporting a nuclear attack for fear of “nuclear energy hesitancy”\n\nFolks in the mainstream media (MSM) refuse to report serious injuries and deaths directly caused by the Wuhan coronavirus (COVID-19) clot shot injections, and their excuse is always the same, in that they don’t want to cause any panic or what they term “vaccine hesitancy.” Yet, did you know that vaccines have killed FAR MORE Americans that 9/11? Yes, it’s called PfizerGate, and it’s documented.\n\nIn other words, as the Fauci Flu vaccines are causing mass health carnage, including heart attacks, strokes, and sudden death all around the world, fake news won’t report any of it for fear that less people will go and get the dangerous, experimental vaccines and the booster shots that follow. This makes about as much sense as NOT reporting terrorist bombings of huge buildings, for fear residents (and office employees) at high rise buildings everywhere will suddenly abandon them forever, or leave the metropolitan cities where all the Democrats fester.\n\nWhat if the media refused to report other major disasters that harmed or killed millions of people?\n\nImagine if the MSM refused to report a new Holocaust, for fear people might think that government is mean and move out of that country or nation in mass exodus, while millions of people die by genocide. Or, imagine if the mainstream media refused to report the Fukushima nuclear reactor leak, for fear people might not support nuclear energy anymore, or they might experience “nuclear energy hesitancy,” while millions of people get exposed to cancer-causing radiation.\n\nRemember the horrific gas leak that occurred in Bhopal, India back in 1984? Many people do remember, especially those affected by the 50 tons of deadly gas that leaked from the insecticide factory there, creating the largest industrial disaster in history. Union Carbide, the American “mother” corporation took the blame, but it was too late, as gas drifted over populous areas and KILLED 15,000 people instantly, like a gas chamber.\n\nWhat if that happened today, here in America, and the Environmental Protection Agency (EPA) and the Centers for Disease Control and Prevention (CDC) buried the news for fear of “industry pollution hesitancy,” where people might stop buying produce that comes from the area, or quit planting their gardens in the toxic soil for a few decades there? How dumb would that be?\n\nPeople suffered from respiratory problems that were critical and lethal, kind of like the millions of Americans right now suffering from spike protein syndrome, where millions of toxic nano-particles that resemble the COVID-19 virus are clogging their vascular systems and lungs. But, don’t go reporting all of that, because then people might have “vaccine hesitancy” and not want to die of vaccine-induced respiratory failure or even myocarditis. Complete media blackout. One hundred percent censorship. It should be referred to as “vaccine death fear” instead of “hesitancy.”\n\nMSM not reporting vaccine-induced damage and death due to “vaccine hesitancy” is a death sentence for millions of sheeple\n\nBlindly follow the “herd” and you end up walking right off a cliff or into a hungry wolf pack. Herd “theory” for vaccines was always a hoax, and now the pro-vax-fanatics and the Fauci COVID Cult even admit it, saying the vaccine doesn’t stop anyone from catching the virus or spreading it, but only from getting a “bad case” of it (which is also a lie).\n\nThe only reason mainstream (fake) news puts forward the excuse of “vaccine hesitancy” for not reporting the cases of heart damage, stroke, clots and blindness are because there are too many of them to be completely covered up. This is called “catch and release” news, where MSM addresses the elephant in the room, but then dismisses it as a “rare” case that’s totally harmless to everyone else, then comes a distraction so everyone forgets. This is standard operating procedure for all of fake news, including online news, social media, TV news, and of course, the bloody lying newspapers.\n\nKeep your truth news in check by adding Preparedness.news to your favorites list and tuning in daily for updates on real news about the surviving and thriving in the near future, and news that’s being scrubbed from MSM and social media as you read this.", "opengraph": {"title": "Mainstream media’s failure to report vaccine-induced damage due to “vaccine hesitancy” is like NOT reporting a nuclear attack for fear of “nuclear energy hesitancy”", "type": "article", "url": "https://www.cnnsofake.news/2023-03-26-msm-not-reporting-vaccine-induced-damage-death-hesitancy.html", "site_name": "CNN So Fake News", "description": "Folks in the mainstream media (MSM) refuse to report serious injuries and deaths directly caused by the Wuhan coronavirus (COVID-19) clot shot injections, and their excuse is always the same, in that they don’t want to cause any panic or what they term “vaccine hesitancy.” Yet, did you know that vaccines have killed FAR MORE Americans […]", "image": "https://www.cnnsofake.news/wp-content/uploads/sites/392/2023/03/Nuclear-Bomb-Corn-Field.png"}, "tags": ["chemical spill", "Journalism", "censored", "Vaccine injuries", "news cartels", "nuclear spill", "banned", "clot shot", "radiation leak", "fake news", "mainstream media", "hesitancy", "news media", "disinformation", "real news", "Censored news", "toxic spill", "supressed news", "nuclear reactor leak", "Vaccine deaths", "Censorship", "nuclear leak", "Fukushima tragedy", "vaccines", "vaccine damage"], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com/2022-09-29-hundreds-thousands-fully-vaccinated-dying-weekly-pfizergate.html", "https://naturalnews.com/049241_Fukushima_radiation_nuclear_power.html", "https://www.britannica.com/event/Bhopal-disaster", "https://www.preparedness.news/2022-08-19-12-ways-prep-without-spending-too-much.html", "https://www.naturalnews.com/2022-09-29-hundreds-thousands-fully-vaccinated-dying-weekly-pfizergate.html", "https://naturalnews.com/049241_Fukushima_radiation_nuclear_power.html", "https://www.britannica.com/event/Bhopal-disaster", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcnnsofakenews%2F2023-03-26-msm-not-reporting-vaccine-induced-damage-death-hesitancy.html&linkname=Mainstream%20media%E2%80%99s%20failure%20to%20report%20vaccine-induced%20damage%20due%20to%20%E2%80%9Cvaccine%20hesitancy%E2%80%9D%20is%20like%20NOT%20reporting%20a%20nuclear%20attack%20for%20fear%20of%20%E2%80%9Cnuclear%20energy%20hesitancy%E2%80%9D", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}