{"result_id": "073017", "URL": "https://cnnsofake.news/2021-07-01-cnn-pushes-delta-variant-so-scary-kids-need-vaccine.html", "timestamp": "2023-04-25 14:45:42 CEST+0200", "meta": {"description": "It’s twice as deadly and a-hundred-times as contagious as Covid-19, explains a vaccine-making shill on the Counterfeit News Network. Run for your lives, the Delta Variant is coming! Return to your chemically-disinfected “safe” homes, lock yourself down forever with lots of toilet paper and anti-bacterial everything, and be sure wear your mask at all times, […]", "lang": "en", "keywords": "badhealth,badmedicine,Big Pharma,China Flu,CNN,conspiracy,covid-variant,Dangerous Medicine,Delta Variant,disinfo,Journalism,mainstream media,mRNA,pandemic,propaganda,toxic shots,vaccine death,vaccine injury", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://cnnsofake.news/2021-07-01-cnn-pushes-delta-variant-so-scary-kids-need-vaccine.html", "encoding": "UTF-8"}, "image": null, "domain": "cnnsofake.news", "title": "CNN pushes Delta Variant as SUPER SCARY, claiming teenagers and kids need the dangerous, blood-clotting, heart-inflaming covid vaccine", "cleaned_text": "CNN pushes Delta Variant as SUPER SCARY, claiming teenagers and kids need the dangerous, blood-clotting, heart-inflaming covid vaccine\n\nIt’s twice as deadly and a-hundred-times as contagious as Covid-19, explains a vaccine-making shill on the Counterfeit News Network. Run for your lives, the Delta Variant is coming! Return to your chemically-disinfected “safe” homes, lock yourself down forever with lots of toilet paper and anti-bacterial everything, and be sure wear your mask at all times, even if you’re already vaccinated against Covid – is the message from fake news.\n\nRemember just four years ago it was the Russians that were invading America, fixing elections and turning the whole country into White Supremacist Nazis, they claimed for years. There is a “communist” infiltration though, really, but it’s a lab-concocted disease created by communist scientists who live in a communist-run country that collaborates with the likes of Fauci and Bill Gates. The next lockdown, economy-and-health-crashing “Delta” plandemic is erupting, and the communist playbook is in full view, on stage, in America.\n\nThe clowns on CNN invited a pharma shill and vaccine maker on their pharma-sponsored circus stage to push the deadly Covid jabs on teens, preteens and children, educating them that eating healthy and going to the gym won’t save them from the Delta Variant. It’s the most shilling propaganda you can find, at the always unreliable counterfeit news network.\n\nWould we push for inoculating all adolescents, kids and babies with an “emergency” chicken pox vaccine if the vaccine was causing them blood clots and heart inflammation?\n\nWhose kids are dying from the chicken pox? What about the flu? How many kids died from seasonal influenza between last October and May? The CDC will lie and tell you next to zero, while crediting masks and social distancing. The WHO, the CDC and the FDA all used scare-mongering, media propaganda when Covid-19 hit, saying everyone must be vaccinated to save Earth.\n\nNow, since we’ve all proven that healthy adults, young adults, teens, adolescents, pre-teens, children, babies and pregnant women definitely do NOT need Covid-19 vaccines, the same would apply for the horror-movie-style attack of the “Delta Variant.” Beware… the genetically mutated Franken-virus has escaped the dungeon laboratory, again!\n\n“Delta Variant” is the vaccine industry “secret code” term for vaccine-induced injury and death\n\nVaccines cause horrific injuries that people sustain for life. Whether MSM or the vaccine industrial complex ever admits it, science proves that the neurological bio-weapons, also known as inoculations, cause autism, severe childhood allergies, birth defects, sterilization, involuntary spontaneous abortion, and now blood clots and life-threatening heart inflammation. Dirty and dangerous “immunizations” are responsible for $5 billion in damages that has been paid to families via the vaccine industry’s secret court with their own appointed “judges” who settle for cash and silence.\n\nThere’s more vaccine violence and inoculation-induced death on the way from the next round of Covid vaccines, and it will all surely be blamed on the lab-concocted “Delta Variant.”\n\nIt’s time to stock up, for real, on medicinal mushrooms, including chaga and reishi (natural immune system boosters). It’s time to load the herbal remedy shelf in your refrigerator with some tinctures of vitamin D, zinc, dandelion root, and vitamin B12-methyl. Now is the time to stock up on superfoods, like chia seeds, hemp seed oil, and organic raw sprouted fiber. Add in some licorice root, garlic, turmeric with curcumin and black pepper, cinnamon, and of course, oil of oregano (Nature’s antibiotic and virus killer).\n\nThe science behind natural supplementation is at your fingertips. It’s called Food Forensics. Check it out.\n\nThe China Flu and the Delta Variant can be beat just like all the other viruses, with a healthy body, an organic food base, filtered water and natural remedies. Add in some daily exercise, fresh air, and don’t forget to put your bare feet on sand, soil, grass, or in water for at least 20 minutes a day, as it relieves stress. This has been a public service announcement from Natural Health News.\n\nVisit CovidVaccineReactions.com if you already got a toxic Covid jab or two and you are experiencing side effects, blood clots or other adverse events. Then tune your internet frequency to Pandemic.news for updates on these crimes against humanity being delivered under the guise of inoculation.", "opengraph": {"title": "CNN pushes Delta Variant as SUPER SCARY, claiming teenagers and kids need the dangerous, blood-clotting, heart-inflaming covid vaccine", "type": "article", "url": "https://www.cnnsofake.news/2021-07-01-cnn-pushes-delta-variant-so-scary-kids-need-vaccine.html", "site_name": "CNN So Fake News", "description": "It’s twice as deadly and a-hundred-times as contagious as Covid-19, explains a vaccine-making shill on the Counterfeit News Network. Run for your lives, the Delta Variant is coming! Return to your chemically-disinfected “safe” homes, lock yourself down forever with lots of toilet paper and anti-bacterial everything, and be sure wear your mask at all times, […]", "image": "https://www.cnnsofake.news/wp-content/uploads/sites/392/2021/07/Covid-19-Coronavirus-Vaccine-Vial-Syringe.jpg"}, "tags": ["pandemic", "conspiracy", "China Flu", "Big Pharma", "mainstream media", "Journalism", "vaccine death", "vaccine injury", "CNN", "covid-variant", "Delta Variant", "disinfo", "propaganda", "mRNA", "toxic shots"], "tweets": [], "movies": [], "links": ["https://www.thegatewaypundit.com/2021/06/delta-variant-like-nothing-seen-cnn-uses-doctor-scare-people-getting-covid-vaccine-video/", "https://www.naturalnews.com/2021-06-09-china-moved-their-timetable-for-attack.html", "http://naturalnews.com/2018-04-05-trust-in-mainstream-media-continues-to-tank-led-by-cnns-abysmal-numbers.html", "https://www.naturalnews.com/2021-06-24-covid-delta-variant-is-just-vaccine-injury.html", "https://www.naturalnews.com/055836_natural_cures_indigenous_medicine_healing_plants.html", "https://globalhealing.com/", "https://foodforensics.com/", "https://www.naturalnews.com/2021-03-02-scientists-discover-mrna-inactivates-tumor-suppressing-proteins.html", "https://covidvaccinereactions.com/", "https://www.pandemic.news/2021-03-04-who-insider-exposes-gavi-gates-perpetrating-plandemic.html", "https://www.naturalnews.com/2021-06-01-zelenko-covid-vaccine-mandates-children-human-experimentation.html", "https://www.pandemic.news/2021-03-04-who-insider-exposes-gavi-gates-perpetrating-plandemic.html", "https://www.naturalnews.com/2021-05-29-coming-soon-no-shot-no-service.html", "http://www.truthwiki.org/cdc-centers-for-disease-control-and-prevention/"], "authors": [], "publish_date": null}