{"result_id": "073007", "URL": "https://www.cnnsofake.news/2023-03-02-cnn-blaming-insomnia-erythritol-for-sudden-deaths.html", "timestamp": "2023-04-25 14:45:36 CEST+0200", "meta": {"description": "Ever since the Covid clot shots were administered to 270 million Americans, thousands of vaccine victims have suffered the vascular-clotting consequences, but just can’t seem to figure out what went wrong. Previously perfectly healthy folks are suddenly suffering from irregular heartbeats, cancer tumors, and neurological dysfunctions of all sorts. They can’t sleep right anymore. They’ve […]", "lang": "en", "keywords": "badhealth,badmedicine,Big Pharma,Censored Science,clot shots,CNN,counterfeit news,covid vaccines,Dangerous Medicine,deception,disease causes,disinfo,erythritol,fake news,heart attacks,insomnia,lies,media fact watch,pharmaceutical fraud,propaganda,strokes,sugar substitute", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.cnnsofake.news/2023-03-02-cnn-blaming-insomnia-erythritol-for-sudden-deaths.html", "encoding": "UTF-8"}, "image": null, "domain": "www.cnnsofake.news", "title": "More CLOT SHOT COVER STORIES run by fake news CNN blaming insomnia and erythritol for sudden deaths by heart attack and stroke", "cleaned_text": "More CLOT SHOT COVER STORIES run by fake news CNN blaming insomnia and erythritol for sudden deaths by heart attack and stroke\n\nEver since the Covid clot shots were administered to 270 million Americans, thousands of vaccine victims have suffered the vascular-clotting consequences, but just can’t seem to figure out what went wrong. Previously perfectly healthy folks are suddenly suffering from irregular heartbeats, cancer tumors, and neurological dysfunctions of all sorts. They can’t sleep right anymore. They’ve got incessant ringing in their ears. Their chest feels compressed and they can’t breathe normally when exercising. People are dropping dead unexpectedly from heart attacks and strokes. What could be wrong? The doctors don’t blame the jabs. The TV news won’t blame the jabs. What else could it be?\n\nMSM and CNN blame anything but vaccines for recent massive wave of heart attacks and strokes among healthy Americans\n\nSuddenly, there are all kinds of normal activities that instantly kill healthy people, according to the fake news network (FNN) and other fake news outlets. Referee whistles can now kill you instantly. Cold showers are lethal. Video games too. Now the latest fake news warns the world that “lack of sleep” is leading to massive heart attacks. Oh, and watch out for that sugar substitute that comes from sugar alcohol called erythritol, even though toxicology studies reveal no threat of adverse events for healthy people, unless maybe someone eats a whole barrel full in one sitting on an empty stomach.\n\nThe safety of erythritol is somewhat controversial, but there is no evidence showing it causes sudden heart attacks, unless you watch and believe what you see and read on the counterfeit news network – the kings of misinformation, especially when it comes to anything health related. Still, fake news CNN claims erythritol is suddenly linked to blood clotting, heart attack, and death, according to a “new study.” Researchers concluded that, “Obviously, more research is needed, but in an abundance of caution, it might make sense to limit erythritol in your diet for now.” Note that the results of this study are contrary to DECADES of scientific research showing erythritol is safe for consumption, and that the CNN-sourced study should not be “extrapolated to the general population” since the participants were already at a highly-elevated risk for cardiovascular events.\n\nSuddenly, half of all American adults who have trouble sleeping well are now at risk of heart attack, according to fake news CNN\n\nSleep “deprivation” affects 50 percent of all American adults, a new study found. Yes, the journal of Clinical Cardiology says if you can’t sleep well, and you’re a woman, you could die of a massive myocardial infarction at any moment. Never mind about whether or not these folks have received one or more of the most deadly, experimental, vascular-clotting gene therapy injections for Covid.\n\nIf you or a loved one are suddenly suffering from hardening of the arteries, it could be a side effect of the Covid clot shots that were never approved by the FDA to be safe or effective. Ischemic heart disease is where plaque builds up in the arteries, but the Covid clot shots cause vascular clots that aren’t made up of plaque or blood, and still significantly limit the supply of oxygen to vital parts of the body. CNN will not discuss this.\n\nSuddenly, anyone who gets stressed out and can’t sleep well, according to CNN, is at risk of a heart attack. Are you having difficulty falling asleep or staying asleep? Do you wake early and then have trouble falling back asleep? According to CNN, you are 1.69 times more likely to have a heart attack than people “without insomnia.” Seven to eight hours of sleep is the “magic number,” according to sleep expert and CNN talking head Dr. Gulati. Also, according to the “new study,” increased heart attack risk among people with insomnia persists regardless of age (that’s because the vaccine industrial complex is pushing Covid clot shots for kids now).\n\nWhat’s next? Will CNN blame drinking clean water on all these heart attacks and strokes? Maybe they’ll blame organic food next. Nothing seems out of bounds for the counterfeit news network these days. Remember to bookmark Vaccines.news to your favorite independent websites for updates on experimental gene therapy injections that cause vascular clots, heart attacks and strokes, but never get the blame by MSM.", "opengraph": {"title": "More CLOT SHOT COVER STORIES run by fake news CNN blaming insomnia and erythritol for sudden deaths by heart attack and stroke", "type": "article", "url": "https://www.cnnsofake.news/2023-03-02-cnn-blaming-insomnia-erythritol-for-sudden-deaths.html", "site_name": "CNN So Fake News", "description": "Ever since the Covid clot shots were administered to 270 million Americans, thousands of vaccine victims have suffered the vascular-clotting consequences, but just can’t seem to figure out what went wrong. Previously perfectly healthy folks are suddenly suffering from irregular heartbeats, cancer tumors, and neurological dysfunctions of all sorts. They can’t sleep right anymore. They’ve […]", "image": "https://www.cnnsofake.news/wp-content/uploads/sites/392/2023/03/CNN-fake-news-network.png"}, "tags": ["Big Pharma", "counterfeit news", "deception", "lies", "Censored Science", "covid vaccines", "heart attacks", "insomnia", "erythritol", "disease causes", "disinfo", "propaganda", "media fact watch", "clot shots", "fake news", "sugar substitute", "strokes", "CNN", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://wellnessmama.com/health/erythritol-safety/", "http://cnnsofake.news", "https://www.cnn.com/2023/02/27/health/zero-calorie-sweetener-heart-attack-stroke-wellness/index.html?utm_term=167761254891134a707972fe7&utm_source=cnn_Results+are+in+02.28.23&utm_medium=email&bt_ee=JcP+YI5nVjC4mtQTvRgPePRJc65e0L+4+7BE40DczPSvRHQ7CnM", "https://www.cnn.com/2023/02/24/health/insomnia-heart-attack-risk/index.html", "https://onlinelibrary.wiley.com/doi/10.1002/clc.23984", "https://www.naturalnews.com/2022-09-29-hundreds-thousands-fully-vaccinated-dying-weekly-pfizergate.html", "https://www.naturalnews.com/2022-01-29-rubbery-blood-clots-in-bodies-of-vaccinated.html", "https://www.vaccines.news/2021-12-04-top-8-most-common-serious-adverse-reactions-covid-vaccines.html", "https://naturalnews.com/2022-05-02-clot-shots-create-boom-blood-clot-removal.html", "https://www.pandemic.news/2021-03-04-who-insider-exposes-gavi-gates-perpetrating-plandemic.html", "https://www.cnn.com/2023/02/24/health/insomnia-heart-attack-risk/index.html", "https://www.cnn.com/2023/02/27/health/zero-calorie-sweetener-heart-attack-stroke-wellness/index.html?utm_term=167761254891134a707972fe7&utm_source=cnn_Results+are+in+02.28.23&utm_medium=email&bt_ee=JcP+YI5nVjC4mtQTvRgPePRJc65e0L+4+7BE40DczPSvRHQ7CnM", "https://www.naturalnews.com/2022-09-29-hundreds-thousands-fully-vaccinated-dying-weekly-pfizergate.html", "https://wellnessmama.com/health/erythritol-safety/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcnnsofakenews%2F2023-03-02-cnn-blaming-insomnia-erythritol-for-sudden-deaths.html&linkname=More%20CLOT%20SHOT%20COVER%20STORIES%20run%20by%20fake%20news%20CNN%20blaming%20insomnia%20and%20erythritol%20for%20sudden%20deaths%20by%20heart%20attack%20and%20stroke", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}