{"result_id": "073014", "URL": "https://www.cnnsofake.news/2018-04-05-trust-in-mainstream-media-continues-to-tank-led-by-cnns-abysmal-numbers.html", "timestamp": "2023-04-25 14:45:40 CEST+0200", "meta": {"description": "Two things are happening that prove to me without a shadow of a doubt that President Donald J. Trump’s presidency is succeeding despite the “mainstream media’s” non-stop portrayal of him and his administration in a negative light. First and foremost, Trump’s approval rating has popped to 51 percent, his best overall rating in a year […]", "lang": "en", "keywords": "Alt-Left,American Pravda media,American readers,CNN,deep state,disinfo,distrust,fake news,false reporting,Journalism,lies,mainstream media,Monmouth University,planting stories,President Trump,propaganda,survey,truth", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.cnnsofake.news/2018-04-05-trust-in-mainstream-media-continues-to-tank-led-by-cnns-abysmal-numbers.html", "encoding": "UTF-8"}, "image": null, "domain": "www.cnnsofake.news", "title": "Trust in “mainstream media” continues to tank, led by CNN’s abysmal numbers: Nobody trusts CNN except the stupid", "cleaned_text": "Trust in “mainstream media” continues to tank, led by CNN’s abysmal numbers: Nobody trusts CNN except the stupid\n\nTwo things are happening that prove to me without a shadow of a doubt that President Donald J. Trump’s presidency is succeeding despite the “mainstream media’s” non-stop portrayal of him and his administration in a negative light.\n\nFirst and foremost, Trump’s approval rating has popped to 51 percent, his best overall rating in a year and five points higher than President Obama’s same-day rating (April 4th) during year two of his first term.\n\nSecondly, as Trump’s approval rating soars, the Pravda media’s approval and trust ratings are tanking, led by none other than CNN, whose audience numbers for the first quarter of 2018 ought to embarrass both network executives and on-air “talent.”\n\nAccording to The Daily Caller, the network is far outpaced by Fox News — nothing new there — but also by MSNBC, which is surprising given that its incessant #TrumpHate is really on par with that of CNN’s.\n\nAdWeek noted that Fox News “was the most-watched basic cable network for Q1 2018, both in prime time and total day.” MSNBC ran a fair second; CNN came in at 11th, below ESPN (which has turned far-Left as well), TBS, and The History Channel.\n\nBut none of these networks is drawing the kind of numbers that — say, the “Roseanne” reboot drew recently. And part of that is because fewer and fewer Americans trust them.\n\nAs Breitbart News reported, a new Monmouth University Polling Institute survey found that more than three-quarters of the 800 people surveyed — 77 percent — believe mainstream outlets all report “fake news.”\n\n“President Donald Trump is not alone in thinking media outlets spread ‘fake news,’” Politico reported, citing the Monmouth study, adding:\n\nThe findings also showed Americans diverging on what constitutes “fake news,” with 65 percent saying it applies broadly to the editorial decisions outlets make over what topics to cover and 25 percent more narrowly defining it to apply only to the spread of factually incorrect information.\n\nOf course, Trump did not come up with the moniker “fake news;” the ‘fake news’ Pravda media did, and they used that excuse early on to help ‘explain’ how Trump was able to defeat Hillary Clinton. Which, of course, was fake news. Clinton lost because she was a terrible candidate who could not connect with enough voters in enough states to win enough electoral votes.\n\nBut that helps to explain perfectly the results of the Monmouth survey, which also found that some 42 percent of respondents said they think major media outlets purposefully disseminate false information in order to push a political agenda (which his Alt-Left for the most part).\n\nAnd 83 percent said they were sure that outside interest groups seek to plant fake stories in the media in order to spread ‘fake news’ (given all the phony reporting regarding Trump and his administration, we know that several of these ‘outside interest groups’ belong, collectively, to the U.S. intelligence community and federal law enforcement).\n\nIn recent days Sinclair Broadcasting Group sent a corporate-prepared memo to all 170-plus television stations the company owns and required on-air news broadcasters at each one to read it. The memo was a statement to local viewers that Sinclair stations don’t traffic in fake news; their news teams report the news straight, without bias, and ensure that every fact is correct.\n\n“Unfortunately, some members of the media use their platforms to push their own personal bias and agenda to control exactly what people think,” said a portion of the memo read on-air.\n\nNaturally, the mainstream Pravda media criticized the memo and its contents and expressed outrage that anyone could even suggest that what they report is fake — when, of course, we all know that it so very often is.\n\nAs reflected in the Monmouth survey.\n\nStay current on this issue at NewsFakes.com, and get all your REAL news at Censored.news.\n\nJ.D. Heyes is a senior writer for NaturalNews.com and NewsTarget.com, as well as editor of The National Sentinel.", "opengraph": {"title": "Trust in “mainstream media” continues to tank, led by CNN’s abysmal numbers: Nobody trusts CNN except the stupid", "type": "article", "url": "https://www.cnnsofake.news/2018-04-05-trust-in-mainstream-media-continues-to-tank-led-by-cnns-abysmal-numbers.html", "site_name": "CNN So Fake News", "description": "Two things are happening that prove to me without a shadow of a doubt that President Donald J. Trump’s presidency is succeeding despite the “mainstream media’s” non-stop portrayal of him and his administration in a negative light. First and foremost, Trump’s approval rating has popped to 51 percent, his best overall rating in a year […]", "image": "https://www.cnnsofake.news/wp-content/uploads/sites/392/2019/01/CNN-fake-news-network.png"}, "tags": ["planting stories", "fake news", "deep state", "mainstream media", "Journalism", "American Pravda media", "survey", "CNN", "American readers", "distrust", "false reporting", "Alt-Left", "Monmouth University", "disinfo", "lies", "President Trump", "truth", "propaganda"], "tweets": [], "movies": [], "links": ["http://www.rasmussenreports.com/public_content/politics/trump_administration/prez_track_apr04", "http://dailycaller.com/2018/04/04/cnn-ratings-2018/", "http://www.foxnews.com/entertainment/2018/04/04/roseanne-revival-wins-in-ratings-holds-strong-in-its-second-week.html", "http://www.breitbart.com/big-journalism/2018/04/02/poll-77-percent-believe-traditional-media-guilty-of-fake-news/", "https://www.monmouth.edu/polling-institute/", "https://www.politico.com/story/2018/04/02/poll-fake-news-494421", "https://thenationalsentinel.com/2017/06/28/cnns-fake-news-hall-of-shame-the-many-times-the-network-has-purposefully-lied-about-the-trump-administration/", "https://thenationalsentinel.com/2017/06/28/cnns-fake-news-hall-of-shame-the-many-times-the-network-has-purposefully-lied-about-the-trump-administration/", "http://www.censored.news", "http://www.thenationalsentinel.com/", "https://thenationalsentinel.com/2017/06/28/cnns-fake-news-hall-of-shame-the-many-times-the-network-has-purposefully-lied-about-the-trump-administration/", "https://www.politico.com/story/2018/04/02/poll-fake-news-494421", "http://www.breitbart.com/big-journalism/2018/04/02/poll-77-percent-believe-traditional-media-guilty-of-fake-news/", "http://dailycaller.com/2018/04/04/cnn-ratings-2018/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcnnsofakenews%2F2018-04-05-trust-in-mainstream-media-continues-to-tank-led-by-cnns-abysmal-numbers.html&linkname=Trust%20in%20%E2%80%9Cmainstream%20media%E2%80%9D%20continues%20to%20tank%2C%20led%20by%20CNN%E2%80%99s%20abysmal%20numbers%3A%20Nobody%20trusts%20CNN%20except%20the%20stupid", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}