{"result_id": "073032", "URL": "https://cnnsofake.news/2021-04-05-fascist-cnn-freedom-withheld-american-people-vaccinated.html", "timestamp": "2023-04-25 14:45:51 CEST+0200", "meta": {"description": "CNN‘s Chris “Fredo” Cuomo spoke to former Planned Parenthood president Dr. Leana Wen the other day about the Wuhan coronavirus (Covid-19) mass injection campaign, during which she openly admitted that “freedom” must be dangled in front of Americans like a “carrot” to coerce them into complying. There is still so much vaccine “hesitancy” that Wen […]", "lang": "en", "keywords": "CNN,coronavirus,covid-19,doctor,freedom,health freedom,Leana Wen,Liberty,medical fascism,obey,Orwellian,pandemic,reward,slavery,Tyranny,vaccination,vaccine,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://cnnsofake.news/2021-04-05-fascist-cnn-freedom-withheld-american-people-vaccinated.html", "encoding": "UTF-8"}, "image": null, "domain": "cnnsofake.news", "title": "Fascist left-wing tyrant Dr. Leana Wen says on CNN that “freedom” should be withheld from the American people until they surrender to being vaccinated", "cleaned_text": "Fascist left-wing tyrant Dr. Leana Wen says on CNN that “freedom” should be withheld from the American people until they surrender to being vaccinated\n\nCNN‘s Chris “Fredo” Cuomo spoke to former Planned Parenthood president Dr. Leana Wen the other day about the Wuhan coronavirus (Covid-19) mass injection campaign, during which she openly admitted that “freedom” must be dangled in front of Americans like a “carrot” to coerce them into complying.\n\nThere is still so much vaccine “hesitancy” that Wen feels as though businesses need to remain closed and lives ruined if there is going to be any “incentive” at all for unvaccinated stragglers to finally agree to get jabbed.\n\n“If everything is reopened, then what’s the carrot going to be?” Wen asked Cuomo. “How are we going to incentivize people to actually get the vaccine?”\n\nIn Wen’s view, the Biden regime must team up with the U.S. Centers for Disease Control and Prevention (CDC) to make an even bolder statement about the need to be “vaccinated” in order to bring about a new “normal.”\n\n“So that’s why I think the CDC and Biden [regime] needs to come out a lot bolder and say, ‘If you are vaccinated, you can do all these things. Here are all these freedoms you have,'” Wen stated, indicating that she believes the government grants people “freedom.”\n\n“Because otherwise, people are going to go out and enjoy these freedoms anyway, and I fear a situation of coming into the fall where we never reach herd immunity, and then we get hit by the next surge of Covid-19 in the fall,” she added. “Something we could have prevented, if we just got people vaccinated now.”\n\nGlobalists like Wen and Cuomo want you dead from your “vaccination”\n\nTruth be told, the world reached herd immunity against the Chinese virus a long time ago. The problem is that the concept of herd immunity has been redefined to mean only those who have been “vaccinated.”\n\nThis means that even if an unvaccinated person is healthy and vibrant and never contracts Chinese germs, he or she will always be a “risk” in the eyes of the government. Merely existing as an unvaccinated person, in other words, now means that the new definition of “herd immunity” can never be achieved.\n\n“I know that’s hard for a lot of people to believe … and they’re thinking, ‘oh, it’s just a small percentage of people who are actually anti-vaxxers,’ and that’s true, there’s the anti-science, anti-vaxxer contingent,” Wen whined.\n\n“But there are many more people, millions of people who for whatever reason have concerns about the vaccine, who just don’t know what’s in it for them. And we need to make it clear to them that the vaccine is the ticket back to pre-pandemic life.”\n\nIf it is not already clear, the goal is to get everyone jabbed through any means possible. Whatever is in those syringes must be injected into the bodies of all humans in order for the next phase of the globalist takeover to work.\n\nThis writer has brought to your attention the Mark of the Beast elements associated with this “vaccine.” It appears to be a foundation for later installments of the Mark of the Beast, which cannot be reversed once inserted into the body.\n\nIn fact, even the mRNA (messenger RNA) component cannot be reversed, and many have speculated as to what will soon happen to everyone who has been injected with it – and it is not good, to be clear.\n\nEven so, mainstream fake news outlets like CNN are going to push and push until most people are jabbed. Once that has been accomplished, the plan is more than likely to bully the resistant minority into complying or else face ostracization.\n\nTo learn more about how Chinese virus vaccines are injuring and killing thousands, be sure to check out ChemicalViolence.com.", "opengraph": {"title": "Fascist left-wing tyrant Dr. Leana Wen says on CNN that “freedom” should be withheld from the American people until they surrender to being vaccinated", "type": "article", "url": "https://www.cnnsofake.news/2021-04-05-fascist-cnn-freedom-withheld-american-people-vaccinated.html", "site_name": "CNN So Fake News", "description": "CNN‘s Chris “Fredo” Cuomo spoke to former Planned Parenthood president Dr. Leana Wen the other day about the Wuhan coronavirus (Covid-19) mass injection campaign, during which she openly admitted that “freedom” must be dangled in front of Americans like a “carrot” to coerce them into complying. There is still so much vaccine “hesitancy” that Wen […]", "image": "https://www.cnnsofake.news/wp-content/uploads/sites/392/2021/04/CNN-fake-news-network.png"}, "tags": ["pandemic", "covid-19", "Liberty", "medical fascism", "vaccination", "Orwellian", "doctor", "vaccine", "CNN", "Tyranny", "vaccines", "coronavirus", "obey", "freedom", "reward", "health freedom", "Leana Wen", "slavery"], "tweets": [], "movies": [], "links": ["https://thenationalpulse.com/breaking/use-freedom-as-carrot-to-force-vaccine/", "https://www.naturalnews.com/2020-12-28-who-changes-definition-herd-immunity-removes-natural.html", "https://www.naturalnews.com/2021-02-10-germany-advances-mark-beast-agenda-id2020-ratification.html", "http://chemicalviolence.com", "https://thenationalpulse.com/breaking/use-freedom-as-carrot-to-force-vaccine/", "https://www.naturalnews.com/2020-12-28-who-changes-definition-herd-immunity-removes-natural.html", "https://www.naturalnews.com/2021-02-10-germany-advances-mark-beast-agenda-id2020-ratification.html"], "authors": [], "publish_date": null}