{"result_id": "073019", "URL": "https://cnnsofake.news/2022-04-22-cnn-shut-down-one-month-after-launch.html", "timestamp": "2023-04-25 14:45:43 CEST+0200", "meta": {"description": "Warner Bros. Discovery is shutting down CNN+ as of April 30, marking one of the company’s first significant maneuvers since completing the merger of WarnerMedia and Discovery less than two weeks ago. (Article by Brian Steinberg republished from Variety.com) The decision puts an abrupt end to an ambitious and aggressive venture that people familiar with the matter […]", "lang": "en", "keywords": "big media,CNN,Collapse,corporate media,corporations,David Zaslav,Journalism,mainstream media,news cartels,shut down,streaming news,Warner Bros. Discovery,WarnerMedia", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://cnnsofake.news/2022-04-22-cnn-shut-down-one-month-after-launch.html", "encoding": "UTF-8"}, "image": null, "domain": "cnnsofake.news", "title": "VARIETY exclusive: CNN+ is shutting down one month after launch", "cleaned_text": "VARIETY exclusive: CNN+ is shutting down one month after launch\n\nWarner Bros. Discovery is shutting down CNN+ as of April 30, marking one of the company’s first significant maneuvers since completing the merger of WarnerMedia and Discovery less than two weeks ago.\n\nThe decision puts an abrupt end to an ambitious and aggressive venture that people familiar with the matter say rankled David Zaslav, the new CEO of Warner Bros. Discovery, from the start. Zaslav was annoyed by the decision of Jason Kilar, the former CEO of WarnerMedia when it was owned by AT&T, to launch CNN+ just weeks before Discovery was set to take over operations. But he was unable to communicate with WarnerMedia management, owing to legal boundaries surrounding the merger process.\n\n“This decision is in line with WBD’s broader direct-to-consumer strategy,” said Chris Licht, the incoming CEO of CNN, in a statement. “In a complex streaming market, consumers want simplicity and an all-in service, which provides a better experience and more value than stand-alone offerings.” Zaslav has been open in the recent past about his desire to combine all of the company’s streaming-video assets, which also include Discovery+ and HBO Max, under a single umbrella.\n\nAndrew Morse, the CNN executive vice president who oversees the newly-launched streaming-video outlet, as well as CNN’s digital and Spanish-language operations, was told of the decision ahead of time, these people said, and is expected to depart after a period of transition. Alex MacCallum was named to oversee digital, and CNN+ employees will be paid for the next 90 days and be given opportunities to explore other positions around the company.\n\nThe decision curtails CNN’s efforts to join the TV-news streaming wars, which are already being fought by its direct competition. MSNBC has unveiled plans to roll out more opinion-led shows in a bid to generate more subscriptions for Peacock, its corporate parent’s streaming outlet. Fox News has expanded the purview of Fox Nation, adding true-crime documentaries and even movies to service in a bid to attract not only fans of its cable-news outlet, but also a broader array of potential subscribers CBS News recently overhauled its streaming-video efforts and added new shows led by anchors including Norah O’Donnell and Tony Dokoupil. Both NBC News and ABC News have bet on live news programming, setting up anchors like Tom Llamas and Linsey Davis in early-evening weekday programs.\n\nCNN plowed millions into the venture, raiding news executives and producers from places like ABC News and NBC News, and signing notables like food writer Alison Roman and business professor Scott Galloway. Current staffers like Anderson Cooper and Don Lemon were assigned, respectively, to lead a show on parenting and a talk show with a live audience. A show led by Jemele Hill and Cari Champion had yet to launch. CNN had also made some deals with talent for CNN+ that it had to unveil, according to a person familiar with the situation.\n\nInside CNN, executives were pleased with early progress of the new venture, which two people indicated had nabbed 100,000 to 150,000 subscribers in its first few weeks online. Some executives believed the service was on its way toward meeting first-year goals. They were encouraged by response to new programs like “5 Things,” an early-morning news roundup, and “Reliable Sources Daily,” an extension of CNN’s long-running media-affairs program. Earlier this week, Chris Wallace, who jumped to CNN from Fox News Channel for the streaming venture, landed an interview with White House Press Secretary Jen Psaki on his new CNN+ interview show.\n\nBut little of that mattered to the new leaders of Warner Bros. Discovery, who are determined to bring to market an extremely broad streaming offering that mixes the premium storytelling of HBO programs and the unscripted documentary fare of Discovery’s cable networks. The company had already cut the marketing budget for CNN+, making the prospect of luring new audiences exponentially more difficult.\n\nIt remains unclear if CNN intends to keep on board some of its flashy new hires, which, in addition to Wallace, include Kasie Hunt, formerly of NBC News, and Audie Cornish, the NPR veteran. Some talent deals, according to one person familiar with the matter, were not contingent on working for CNN+, and included the ability to contribute to CNN’s broader array of properties. Indeed, some CNN+ talent hires will be considered for TV or digital opportunities, according to two people familiar with the venture. One of these people suggested that if no spot is found for them, the company has indicated it could be willing to pay out their contracts. Meanwhile, Warner Bros. Discovery has lifted a hiring freeze that was in place at CNN, according to one person familiar with the matter, which may open positions for CNN+ staffers.\n\nIn a noon meeting, Licht and JB Perrette, Warner Bros. Discovery’s head of streaming, told staffers the quality of the product was not at issue, but that CNN+ did not dovetail with the corporation’s strategy. “It is not your fault that you had the rug pulled out from underneath you,” Licht told employees. Even so, dozens of new staffers face the prospect of losing their jobs.\n\nWarner Bros. Discovery’s decision will likely consign CNN+ to the heap of glitzy product launches that never got off the ground, either because of lackluster consumer reaction or shifts in corporate strategy. Quibi Holdings, a start up recently launched by media mogul Jeffrey Katzenberg to devise a streaming portal for short-form programming, didn’t last much more than six months, despite alliances with CBS News and other big media purveyors.", "opengraph": {"title": "VARIETY exclusive: CNN+ is shutting down one month after launch", "type": "article", "url": "https://www.cnnsofake.news/2022-04-22-cnn-shut-down-one-month-after-launch.html", "site_name": "CNN So Fake News", "description": "Warner Bros. Discovery is shutting down CNN+ as of April 30, marking one of the company’s first significant maneuvers since completing the merger of WarnerMedia and Discovery less than two weeks ago. (Article by Brian Steinberg republished from Variety.com) The decision puts an abrupt end to an ambitious and aggressive venture that people familiar with the matter […]", "image": "https://www.cnnsofake.news/wp-content/uploads/sites/392/2022/04/APPROVED-CNN-logo.png"}, "tags": ["Warner Bros. Discovery", "corporations", "big media", "mainstream media", "Collapse", "Journalism", "WarnerMedia", "shut down", "CNN", "news cartels", "streaming news", "David Zaslav", "corporate media"], "tweets": [], "movies": [], "links": ["https://variety.com/t/warner-bros-discovery/", "https://variety.com/t/cnn/", "https://variety.com/2022/tv/news/cnn-plus-shut-down-warner-bros-discovery-1235237913/", "https://variety.com/2021/tv/news/tv-news-streaming-wars-cnn-fox-news-abc-news-1235143944/", "https://variety.com/2022/tv/news/msnbc-nbc-news-streaming-1235224842/", "https://variety.com/2022/tv/news/cbs-news-streaming-wars-norah-odonnell-1235160951/", "https://variety.com/2022/tv/news/cnn-plus-future-warner-bros-discovery-1235235816/", "https://variety.com/2021/tv/news/chris-wallace-fox-news-channel-departure-1235131514/", "https://variety.com/2022/tv/news/cnn-plus-shut-down-warner-bros-discovery-1235237913/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcnnsofakenews%2F2022-04-22-cnn-shut-down-one-month-after-launch.html&linkname=VARIETY%20exclusive%3A%20CNN%2B%20is%20shutting%20down%20one%20month%20after%20launch", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}