{"result_id": "073008", "URL": "https://cnnsofake.news/2021-07-13-cnn-analyst-demands-covid-19-mandate.html", "timestamp": "2023-04-25 14:45:37 CEST+0200", "meta": {"description": "CNN has a reputation for being wrong about nearly everything regarding President Donald Trump, for pushing Democratic propaganda disguised as “news,” and for being highly supportive of authoritarian government, as evidenced by the quality of guests and contributors the network regularly features. Take a couple of analysts the network has had on the air a lot […]", "lang": "en", "keywords": "authoritarianism,badscience,big government,CNN,coronavirus,COVID,covid-19,Delta Variant,Journalism,Lambda variant,left cult,lunatics,medical fascism,Medical Tyranny,obey,pandemic,Tyranny,tyrants,vaccine,vaccine mandate", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://cnnsofake.news/2021-07-13-cnn-analyst-demands-covid-19-mandate.html", "encoding": "UTF-8"}, "image": null, "domain": "cnnsofake.news", "title": "CNN analyst and authoritarian demands COVID-19 vaccine be mandated while calling for life to be much ‘harder’ for unvaccinated Americans", "cleaned_text": "CNN analyst and authoritarian demands COVID-19 vaccine be mandated while calling for life to be much ‘harder’ for unvaccinated Americans\n\nCNN has a reputation for being wrong about nearly everything regarding President Donald Trump, for pushing Democratic propaganda disguised as “news,” and for being highly supportive of authoritarian government, as evidenced by the quality of guests and contributors the network regularly features.\n\nTake a couple of analysts the network has had on the air a lot recently: Both of them alternately argue for the Biden regime to mandate COVID-19 vaccines for every American as well as making it much more difficult for unvaccinated Americans who have very good reasons why they don’t want to get the jab to live in ‘the land of the free.’\n\nCNN political analyst Julian Zelizer called on coronavirus vaccinations and vaccine passports to be made mandatory in the U.S., citing a concern for the Delta variant of the virus, as well as an increase in cases amongst the unvaccinated.\n\nIn a Wednesday column, Zelizer argued that Republicans and Democrats, including President Biden, were focusing too much on individual rights rather than “the good of the collective,” and declared that Americans shouldn’t view the vaccine “as an optional inoculation.”\n\n“It is time to impose vaccine mandates and passports. The Covid-19 vaccines continue to perform extraordinarily well, but the rate of infection is worsening in unvaccinated populations. The Delta variant is offering a sobering reminder that the pandemic has faded in much of the country but certainly not ended,” Zelizer wrote.\n\n“Both political parties have made the mistake of framing vaccines within the tradition of individualism,” he added. “Even President Joe Biden, who has demonstrated his comfort with a muscular role for government, keeps appealing to individuals to make the right and patriotic choice when it comes to receiving their jabs.”\n\nThat’s because we don’t live in North Korea or China; we live in America, where concepts like “freedom” and “liberty” and “individualism” are actually enshrined in our founding government document.\n\nAnd because of that, several states have resorted to incentives to entice more Americans into taking the shots. But even that’s too gentile for Zelizer, who prefers Stalinesque government to that bequeathed us by our founders.\n\n“Easy, accessible and attractive are important; nobody should face barriers toward receiving vaccines. But citizens must also not see this as an optional inoculation,” he wrote.\n\nMeanwhile, another authoritarian wannabe, Dr. Leana Wen, says life should be much more difficult for unvaccinated Americans — because that’s not discriminatory in any way.\n\n“What really need to do at this point is to make vaccination the easy choice. It needs to be hard for people to remain unvaccinated,” she said during a Saturday appearance on the fake news network. “Right now, it’s kind of the opposite. It’s easy if you’re unvaccinated, you can do everything you want to do anyway.”\n\n“But at some point these mandates, by workplaces, by schools, I think it will be important to say, ‘Hey, you can opt out, but if you want to opt out, you have to sign these forms, you have to get twice weekly testing,'” Wen said. “Basically, we need to make getting vaccinated the easy choice.”\n\nAs for Zelizer, he tried to equate mandating an experimental vaccine to mom, apple pie, and ‘Merica.\n\n“Biden and other political leaders need to start thinking about the good of the collective and not just the rights of the individual. Doing so is not some sort of move toward socialism, as conservative critics inevitably argue,” he wrote.\n\n“Thinking of the common good is as American as apple pie,” noted further before listing several government programs Americans have been forced to participate in, like Social Security (and what a disaster that’s going to turn out to be).\n\n“If we want to restore normality on a long-term basis, restore our economy, create opportunity for everyone and live in a society where we and our loved ones are safe, healthy and happy, much more of the population needs to be vaccinated,” he added. “Requiring vaccination must be at the heart of our public health agenda.”\n\nRequiring that our leaders adhere strictly to our founding principles of freedom and liberty is what Americans should actually insist upon.", "opengraph": {"title": "CNN analyst and authoritarian demands COVID-19 vaccine be mandated while calling for life to be much ‘harder’ for unvaccinated Americans", "type": "article", "url": "https://www.cnnsofake.news/2021-07-13-cnn-analyst-demands-covid-19-mandate.html", "site_name": "CNN So Fake News", "description": "CNN has a reputation for being wrong about nearly everything regarding President Donald Trump, for pushing Democratic propaganda disguised as “news,” and for being highly supportive of authoritarian government, as evidenced by the quality of guests and contributors the network regularly features. Take a couple of analysts the network has had on the air a lot […]", "image": "https://www.cnnsofake.news/wp-content/uploads/sites/392/2021/07/Coronavirus-Covid-19-Vaccine-Vials.jpg"}, "tags": ["pandemic", "big government", "left cult", "Journalism", "COVID", "lunatics", "tyrants", "Lambda variant", "covid-19", "vaccine", "vaccine mandate", "coronavirus", "obey", "Medical Tyranny", "Delta Variant", "Tyranny", "medical fascism", "CNN", "authoritarianism"], "tweets": [], "movies": [], "links": ["http://www.disinfo.news", "https://www.foxnews.com/media/cnn-political-analyst-time-to-make-vaccinations-vaccine-passports-mandatory", "https://pandemic.news/2021-07-11-government-document-instructs-vaccine-strike-force-teams-how-to-clear-buildings-violate-trespass-laws-and-flag-anti-vaxxers-for-forced-quarantines.html", "https://www.foxnews.com/media/cnn-political-analyst-time-to-make-vaccinations-vaccine-passports-mandatory", "https://trendingpolitics.com/breaking-cnn-analyst-says-life-needs-to-be-hard-for-unvaccinated-citizens-heres-what-we-know/", "https://pandemic.news/2021-07-11-government-document-instructs-vaccine-strike-force-teams-how-to-clear-buildings-violate-trespass-laws-and-flag-anti-vaxxers-for-forced-quarantines.html"], "authors": [], "publish_date": null}