{"result_id": "073028", "URL": "https://www.cnnsofake.news/2021-07-27-leaked-cnn-email-vaccination-measures.html", "timestamp": "2023-04-25 14:45:49 CEST+0200", "meta": {"description": "Fox News host Tucker Carlson showed a screengrab from a CNN executive hinting that there is a need to use forceful measures to increase COVID-19 vaccination in the U.S. The email’s subject line read: “FW: #NEWS: A majority of unvaccinated Americans say they’re unlikely to get the COVID-19 vaccine, regardless of outreach efforts.” Carlson identified […]", "lang": "en", "keywords": "badhealth,badmedicine,Charlie Kirk,CNN,coronavirus,corporate medical fascism,covid-19,fox news,immunization,Medical Tyranny,pandemic,Tucker Carlson,vaccination", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.cnnsofake.news/2021-07-27-leaked-cnn-email-vaccination-measures.html", "encoding": "UTF-8"}, "image": null, "domain": "www.cnnsofake.news", "title": "Leaked CNN email hints at move toward more forceful vaccination measures", "cleaned_text": "Leaked CNN email hints at move toward more forceful vaccination measures\n\nFox News host Tucker Carlson showed a screengrab from a CNN executive hinting that there is a need to use forceful measures to increase COVID-19 vaccination in the U.S.\n\nThe email’s subject line read: “FW: #NEWS: A majority of unvaccinated Americans say they’re unlikely to get the COVID-19 vaccine, regardless of outreach efforts.”\n\nCarlson identified the author of the email to be CNN’s Washington bureau chief, who wrote to a colleague: “This is the point re: carrot vs. stick. The carrot is no longer going to work…” Although Carlson did not identify the executive by name, the Washington bureau is currently headed by CNN’s senior vice president, Sam Feist.\n\nThis commentary would have been shielded from the public if the executive in question did not accidentally send it to popular activist and commentator, Charlie Kirk.\n\nThe network confirmed the authenticity of the email; however, they insisted that there was nothing newsworthy about the contents.\n\nCNN wrote in a statement: “The email, mistakenly sent to Kirk, was simply acknowledging that current vaccination incentives are losing steam.” Kirk and Carlson discussed the email in the latter’s program. Carlson asked, “Is it CNN’s stated position now that they’re going to try to administer medicine under the threat of punishment?”\n\nReferring to the “carrot vs. stick” analogy used in the email, Kirk then responded: “What does the stick look like in CNN’s world?” CNN’s Brian Stelter reacted to the segment, saying that Carlson twisted the email to push an “outright lie” about the network.\n\nHe said on his Twitter account, “CNN has 4,000 staffers. One exec sends an email about vaccine hostility opining that ‘the carrot is no longer going to work.’ Carlson obtains it. And his show turns it into an outright lie: ‘CNN WANTS TO USE A ‘STICK’ ON THE UNVACCINATED.'” (Related: Fauci tells CNN he thinks there “should be more” local COVID-19 vaccine mandates.)\n\nKirk has a long history of sharing his COVID-19 vaccine skepticism. He speculated on his podcast that twice as many people have died after getting the COVID-19 vaccine than those who have died from the disease itself.\n\nCiting numbers from the Vaccine Adverse Event Reporting System (VAERS) a database on vaccine adverse events, Kirk took the number of deaths in the system. He said they may only account for one percent of total vaccine deaths, coming up with a total of 1.2 million deaths.\n\n“I’m not saying that’s true. I’m saying that according to how we calculate VAERS by the independent study that was administered, this could be true,” he said.\n\nSpeaking about the abovementioned email, Carlson shared, “As a channel, CNN should not have a position on whether you should take medicine or not, because it’s a news channel. It’s not a health station.”\n\nKirk also took the opportunity to blast conservatives who advocated for vaccines during a surge of COVID-19 hospitalizations. “The other question is why all of a sudden in the last 48 hours has there been this almost coordinated effort of people on the establishment center-right kind of virtue signaling and telling every single person to get vaccinated.”\n\nInterestingly, Carlson criticized CNN’s executives for thinking that vaccination requirements may be necessary for businesses and schools while Fox Corporation recently implemented a vaccine passport system for its employees. Over the past few days, Fox News anchors and personalities also made an effort to encourage viewers to get vaccinated, while the network’s news shows shared on-air graphics urging its audience to visit the federal government vaccine website.\n\nThis came as daily COVID cases have risen in the U.S., with the highly transmissible Delta variant now being the dominant strain, prompting some states to reimpose their mask mandates.\n\nFind more COVID-19 news and updates on Pandemic.news.", "opengraph": {"title": "Leaked CNN email hints at move toward more forceful vaccination measures", "type": "article", "url": "https://www.cnnsofake.news/2021-07-27-leaked-cnn-email-vaccination-measures.html", "site_name": "CNN So Fake News", "description": "Fox News host Tucker Carlson showed a screengrab from a CNN executive hinting that there is a need to use forceful measures to increase COVID-19 vaccination in the U.S. The email’s subject line read: “FW: #NEWS: A majority of unvaccinated Americans say they’re unlikely to get the COVID-19 vaccine, regardless of outreach efforts.” Carlson identified […]", "image": "https://www.cnnsofake.news/wp-content/uploads/sites/392/2021/07/APPROVED-CNN-logo.png"}, "tags": ["corporate medical fascism", "pandemic", "covid-19", "immunization", "CNN", "Charlie Kirk", "fox news", "Medical Tyranny", "coronavirus", "Tucker Carlson", "vaccination"], "tweets": [], "movies": [], "links": ["https://www.wakingtimes.com/the-carrot-is-no-longer-going-to-work-leaked-cnn-email-hints-at-more-forceful-measures-for-vaccines/", "https://www.naturalnews.com/2021-07-14-fauci-wants-more-covid-vaccine-mandates.html", "https://www.thedailybeast.com/tucker-carslon-nods-along-as-charlie-kirk-blasts-virtue-signaling-from-vaccine-promoting-conservatives", "http://pandemic.news", "https://www.wakingtimes.com/the-carrot-is-no-longer-going-to-work-leaked-cnn-email-hints-at-more-forceful-measures-for-vaccines/", "https://www.thedailybeast.com/tucker-carslon-nods-along-as-charlie-kirk-blasts-virtue-signaling-from-vaccine-promoting-conservatives"], "authors": [], "publish_date": null}