{"result_id": "073037", "URL": "https://cnnsofake.news/2020-09-08-fake-news-media-issuing-confirmed-claims-fabricated-false-stories.html", "timestamp": "2023-04-25 14:45:54 CEST+0200", "meta": {"description": "Time and time again, mainstream media outlets have been caught parroting each other’s “bombshell” stories using words like “confirmed” to create the illusion that they are all true. But more often than not, such “confirmations” are little more than propaganda fabrications, usually aimed at taking down President Donald Trump. Recall back in December 2017, for […]", "lang": "en", "keywords": "confirmed,deception,fabrication,fake news,mainstream media,media,Trump", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://cnnsofake.news/2020-09-08-fake-news-media-issuing-confirmed-claims-fabricated-false-stories.html", "encoding": "UTF-8"}, "image": null, "domain": "cnnsofake.news", "title": "Fake news media now issuing claims of “CONFIRMED” for utterly fabricated, false stories (usually ones designed to hurt Trump)", "cleaned_text": "Fake news media now issuing claims of “CONFIRMED” for utterly fabricated, false stories (usually ones designed to hurt Trump)\n\nTime and time again, mainstream media outlets have been caught parroting each other’s “bombshell” stories using words like “confirmed” to create the illusion that they are all true. But more often than not, such “confirmations” are little more than propaganda fabrications, usually aimed at taking down President Donald Trump.\n\nRecall back in December 2017, for instance, when CNN aired a “breaking news” segment about how Donald Trump Jr. had supposedly received advanced intelligence from the Russian government about the contents of the WikiLeaks servers. CNN claimed at the time that it had proof of a conspiracy, and many other fake news outlets like MSNBC jumped on the bandwagon by declaring CNN‘s findings as “confirmed.”\n\nWell, it later turned out that Trump Jr. did not receive anything in advance from the Russian government, and had, in fact, received a simple email from someone after the WikiLeaks servers had already gone public urging him to simply take a look at them.\n\nThere was no conspiracy, no funny business, no nothing other than Trump Derangement Syndrome (TDS) being demonstrated by the CNN “journalists” who first put it out there, only to quietly retract it later on in silent shame. And yet, this same pattern of spreading false information under the guise of multiple network “confirmations” has only continued since.\n\nFalse reporting is an endemic problem within the mainstream media, though it often goes unnoticed because many are so entrenched in the idea that such reporting is true that they simply believe it, even when there is no actual corroborating evidence beyond a vague “confirmation.”\n\n“It’s one thing for a news outlet to make a mistake in reporting by, for instance, misreporting the date of an email and thus getting the story completely wrong,” writes Glenn Greenwald for The Intercept. “But how is it possible that multiple other outlets could ‘confirm’ the same false report?\n\n“It’s possible because news outlets have completely distorted the term ‘confirmation’ beyond all recognition,” he adds. “Indeed, they now use it to mean the exact opposite of what it actually means, thereby draping themselves in journalistic glory they have not earned and, worse, deceiving the public into believing that an unproven assertion has, in fact, been proven.”\n\n“Anonymous sources” who “confirm” information are almost always fake\n\nOur readers will probably almost immediately recognize this tactic when it comes to reporting about vaccine safety and effectiveness, or reporting about “global warming” and “climate change.” The science is settled, we are repeatedly told, simply because every “major” news outlet has “confirmed” that it is settled – case closed. Or is it?\n\nYou probably already know that the answer is no, the science is not settled. But this is because you are smart and free-thinking, unlike the millions of Americans who continue to rely on the likes of CNN and MSNBC to uncover “facts” and “truth.”\n\nAnother common tactic is to attribute claims and allegations to “anonymous sources,” which seems to be the only “proof” that the mainstream media ever has when it comes to some new “bombshell” information about Trump. The latest case-in-point is The Atlantic‘s reporting on Trump’s alleged trashing of American military servicemen who died in combat.\n\nThough there is no actual proof that Trump said any of the horrible things that The Atlantic claims he did, the far-left fake news outlet says that “anonymous sources” have “confirmed” that he did, which is apparently all the proof that readers of The Atlantic need in order to know that Trump is a horrible person who needs to be replaced by Joe Biden and Kamala Harris.\n\nBe sure to read Greenwald’s full analysis of the “confirmed” deception tactic at The Intercept.\n\nYou can also keep up with the latest news about the mainstream media’s lies by checking out Propaganda.news.", "opengraph": {"title": "Fake news media now issuing claims of “CONFIRMED” for utterly fabricated, false stories (usually ones designed to hurt Trump)", "type": "article", "url": "https://www.cnnsofake.news/2020-09-08-fake-news-media-issuing-confirmed-claims-fabricated-false-stories.html", "site_name": "CNN So Fake News", "description": "Time and time again, mainstream media outlets have been caught parroting each other’s “bombshell” stories using words like “confirmed” to create the illusion that they are all true. But more often than not, such “confirmations” are little more than propaganda fabrications, usually aimed at taking down President Donald Trump. Recall back in December 2017, for […]", "image": "https://www.cnnsofake.news/wp-content/uploads/sites/392/2020/09/CNN-fake-news-network.png"}, "tags": ["fabrication", "fake news", "Trump", "mainstream media", "confirmed", "deception", "media"], "tweets": [], "movies": [], "links": ["https://theintercept.com/2020/09/05/journalisms-new-propaganda-tool-using-confirmed-to-mean-its-opposite/", "https://www.naturalnews.com/2019-03-04-scientists-who-claim-climate-science-is-settled-earth-atmosphere.html", "https://www.naturalnews.com/2020-09-07-the-atlantic-fake-news-mainstream-media-debunked-hit-piece-trump.html", "https://theintercept.com/2020/09/05/journalisms-new-propaganda-tool-using-confirmed-to-mean-its-opposite/", "http://propaganda.news", "https://theintercept.com/2020/09/05/journalisms-new-propaganda-tool-using-confirmed-to-mean-its-opposite/", "https://www.naturalnews.com/2019-03-04-scientists-who-claim-climate-science-is-settled-earth-atmosphere.html", "https://www.naturalnews.com/2020-09-07-the-atlantic-fake-news-mainstream-media-debunked-hit-piece-trump.html"], "authors": [], "publish_date": null}