{"result_id": "073035", "URL": "https://cnnsofake.news/2022-06-10-official-lied-about-russians-to-get-weapons.html", "timestamp": "2023-04-25 14:45:53 CEST+0200", "meta": {"description": "After being removed from her position for lying about Russian soldiers raping Ukrainians, former Ukrainian Parliamentary Commissioner for Human Rights Lyudmila Denisova finally fessed up to making up the fairy tale in an attempt to score more weapons from the West. In a vote of no confidence that was passed in a 234 to 9 […]", "lang": "en", "keywords": "big government,chaos,CNN,conspiracy,deception,fake news,hoax,honest,insanity,Journalism,lies,Lyudmila Denisova,mainstream media,misinformation,news cartels,rape stories,Russia,smeared,traitors,Ukraine,Washington Post,World War III", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://cnnsofake.news/2022-06-10-official-lied-about-russians-to-get-weapons.html", "encoding": "UTF-8"}, "image": null, "domain": "cnnsofake.news", "title": "ENDLESS LIES: Top Ukrainian official admits to lying about Russians raping Ukrainians in effort to obtain more weapons from West", "cleaned_text": "ENDLESS LIES: Top Ukrainian official admits to lying about Russians raping Ukrainians in effort to obtain more weapons from West\n\nAfter being removed from her position for lying about Russian soldiers raping Ukrainians, former Ukrainian Parliamentary Commissioner for Human Rights Lyudmila Denisova finally fessed up to making up the fairy tale in an attempt to score more weapons from the West.\n\nIn a vote of no confidence that was passed in a 234 to 9 vote, Denisova was pulled from the position and shamed for spreading misinformation that “only harmed Ukraine,” according to parliament member Pavlo Frolov. Denisova presented “numerous details of ‘unnatural sexual offenses’ and child sexual abuses in the occupied territories [that] were unsupported by evidence,” he added.\n\nIn a later interview with a Ukrainian news outlet, Denisova admitted that she manufactured lies on purpose and that they were successful in convincing Italy, which is the example she used, to procure Ukraine more weapons to fight against Russia.\n\n“When, for example, I spoke in the Italian parliament at the Committee on International Affairs, I heard and saw such fatigue from Ukraine, you know? I talked about terrible things in order to somehow push them to make the decisions that Ukraine and the Ukrainian people need,” Denisova explained.\n\nItaly’s Five Star Movement, she went on to reveal, was originally “against the provision of weapons to us, but after my speech, one of the party leaders … said that they will support [Ukraine], including by the provision of weapons.”\n\nCNN and the Washington Post both spread Denisova’s lies (among many others)\n\nEven though it was easily verifiable that Denisova was pulling these rape stories out of her behind, fake news giants such as CNN and the Washington Post ran them, repeating them ad nauseum to their scant viewers.\n\n“The media was quick to put this woman’s BS claims out, but couldn’t care less about correcting the record,” wrote Chris Menahan from Information Liberation about the travesty that is Western “news.”\n\nDenisova’s lies are just a drop in the bucket, though, when it comes to the endless falsehoods being spread against Russia in the West’s desperate effort to rally public support for Ukraine, its deep state playground.\n\nWe know that the Biden Crime Family has extensive dealings in Ukraine that are being upset by the Russian invasion, as do the Clintons and many other deep state villains. Consequently, Western propaganda has reached a fever pitch in trying to demonize Russia through any means possible, including manufacturing and spreading flat-out lies about Russian soldiers raping Ukrainians.\n\nOther lies that the media has spread about the ongoing war include radiation leaks at the Ukrainian nuclear plant that turned out to be fake; complete misinformation about what supposedly happened at Snake Island; the infamous “Ghost of Kiev” hoax; and “attack” on a Holocaust memorial that never occurred; and various other tales.\n\nIn the comment section at Summit.news, one reader offered up a story about how powerful Western propaganda can be in swaying the minds of Americans to support whatever false war narrative the deep state wants them to believe.\n\n“I was talking to a guy yesterday with him saying how Russians weren’t being told the truth and all they had was Putin and government propaganda,” this person wrote.\n\n“I whipped my phone out and VPNd to St. Petersburg. I then looked up the BBC. Got the Russian service and showed him the news on the war. ‘Uhhhhhhh. Yeah but….”. For those kinds of people, this is also a “Yeah but….'”\n\nAnother person joked that Denisova probably now has a job within the Biden regime based on her “proven qualifications.”\n\nMore related news coverage about the conflict in Ukraine can be found at WWIII.news.", "opengraph": {"title": "ENDLESS LIES: Top Ukrainian official admits to lying about Russians raping Ukrainians in effort to obtain more weapons from West", "type": "article", "url": "https://www.cnnsofake.news/2022-06-10-official-lied-about-russians-to-get-weapons.html", "site_name": "CNN So Fake News", "description": "After being removed from her position for lying about Russian soldiers raping Ukrainians, former Ukrainian Parliamentary Commissioner for Human Rights Lyudmila Denisova finally fessed up to making up the fairy tale in an attempt to score more weapons from the West. In a vote of no confidence that was passed in a 234 to 9 […]", "image": "https://www.cnnsofake.news/wp-content/uploads/sites/392/2022/06/Ukraine-Flag-Missles-Launched.jpg"}, "tags": ["conspiracy", "big government", "hoax", "Journalism", "deception", "lies", "news cartels", "honest", "chaos", "rape stories", "misinformation", "fake news", "mainstream media", "Russia", "Washington Post", "World War III", "insanity", "CNN", "smeared", "Ukraine", "traitors", "Lyudmila Denisova"], "tweets": [], "movies": [], "links": ["https://naturalnews.com/2022-06-02-ukraine-fires-human-rights-chief-russian-rape.html", "https://summit.news/2022/06/09/ukrainian-official-admits-she-lied-about-russians-committing-mass-rape-to-convince-countries-to-send-more-weapons/", "http://propaganda.news", "http://wwiii.news", "https://naturalnews.com/2022-06-02-ukraine-fires-human-rights-chief-russian-rape.html", "https://summit.news/2022/06/09/ukrainian-official-admits-she-lied-about-russians-committing-mass-rape-to-convince-countries-to-send-more-weapons/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcnnsofakenews%2F2022-06-10-official-lied-about-russians-to-get-weapons.html&linkname=ENDLESS%20LIES%3A%20Top%20Ukrainian%20official%20admits%20to%20lying%20about%20Russians%20raping%20Ukrainians%20in%20effort%20to%20obtain%20more%20weapons%20from%20West", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}