{"result_id": "073013", "URL": "https://cnnsofake.news/2023-01-24-atlanta-antifa-suspect-worked-at-cnn.html", "timestamp": "2023-04-25 14:45:39 CEST+0200", "meta": {"description": "An Antifa member in Atlanta has been revealed as the daughter of a “Global Diversity Expert” and a New Jersey-based Chinese pharma tycoon, according to a new report. (Article republished from ThePostMillennial.com) The Daily Mail reported that Teresa Yue Shen, 31, one of seven activists arrested at the future Atlanta Public Safety Training Center last week is a mental health consultant […]", "lang": "en", "keywords": "activists,anti-police,antifa,Atlanta,biased,chaos,CNN,conspiracy,domestic terrorism,extremism,insanity,left cult,lunatics,mainstream media,news cartels,night of rage,rioting,Teresa Yue Shen,traitors,violence", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://cnnsofake.news/2023-01-24-atlanta-antifa-suspect-worked-at-cnn.html", "encoding": "UTF-8"}, "image": null, "domain": "cnnsofake.news", "title": "Atlanta Antifa suspect worked at CNN, is daughter of Chinese pharma tycoon and ‘global diversity expert’", "cleaned_text": "Atlanta Antifa suspect worked at CNN, is daughter of Chinese pharma tycoon and ‘global diversity expert’\n\nAn Antifa member in Atlanta has been revealed as the daughter of a “Global Diversity Expert” and a New Jersey-based Chinese pharma tycoon, according to a new report.\n\nThe Daily Mail reported that Teresa Yue Shen, 31, one of seven activists arrested at the future Atlanta Public Safety Training Center last week is a mental health consultant and traveled from Brooklyn to Atlanta to protest the construction of the facility.\n\nAccording to the outlet, James Shen, 58, is the president of publisher WiCON, a New Jersey-based Chinese Media Company that owns Pharma China. In his bio, he claimed to come from a “family with generations of ties with the pharmaceutical industry in China.” He also described himself as a “strategist, advisor and publisher” who specializes in China Healthcare.\n\nHer mother, 63-year-old Xiao-Hua Shen, was one of the first group of university scholarship students sent by the Chinese Government to study in the UK at Exeter University. She calls herself a “Global Diversity Expert” who has an “in-depth knowledge” of how to do “successful business in China” and also worked as a trainer and consultant for Lloyds of London and the British Foreign Office.\n\nAccording to her website, she instructed diplomats on the Chinese language and culture and boasts about ties to the “most multinational pharma companies” across China. She holds both an MA from Exeter University, UK, and a Master of Education from Columbia University.\n\nShen herself interned at both Reuters and CNN. According to the Daily Mail, CNN refused to report on the violence after the “conflict of interest” was revealed.\n\nSince June 2021, Antifa and other far-left extremists from across the US have occupied an area of a forest in Atlanta to prevent the construction of what has been nicknamed “cop city.” Violent clashes between Antifa and police started after one of the activists, Manuel Esteban Paez Teran, 26, was fatally shot after he shot a Georgia State Police officer while authorities were clearing the occupation.\n\nAccording to the Georgia Bureau of Investigations [GBI] the Georgia State Patrol trooper was severely injured during the raid and officers returned fire killing the gunman.\n\nDuring the multi-agency operation, GBI said approximately 25 campsites were located and removed from the site, and mortar-style fireworks, multiple edged swords, pellet rifles, gas masks, and a blow torch were recovered.\n\nShen was arrested along with fellow Antifa activists Sarah Wasilewski, 35, Spencer Liberto, 29, Matt Macar, 30, along with Geoffrey Parson, 20, of Baltimore, Timothy Murphy, 25, of Maine, and Christopher Reynolds, 31, of Ohio.\n\nShen was charged with domestic terrorism and aggravated assault of an officer.\n\nIn 2021, she was previously arrested during an anti-ICE demonstration at the Bergen County Jail.\n\nActivists called for a “Night of Rage” against the police after the shooting and threatened “reciprocal violence” against the authorities.", "opengraph": {"title": "Atlanta Antifa suspect worked at CNN, is daughter of Chinese pharma tycoon and ‘global diversity expert’", "type": "article", "url": "https://www.cnnsofake.news/2023-01-24-atlanta-antifa-suspect-worked-at-cnn.html", "site_name": "CNN So Fake News", "description": "An Antifa member in Atlanta has been revealed as the daughter of a “Global Diversity Expert” and a New Jersey-based Chinese pharma tycoon, according to a new report. (Article republished from ThePostMillennial.com) The Daily Mail reported that Teresa Yue Shen, 31, one of seven activists arrested at the future Atlanta Public Safety Training Center last week is a mental health consultant […]", "image": "https://www.cnnsofake.news/wp-content/uploads/sites/392/2023/01/CNN-headquarters-building.png"}, "tags": ["conspiracy", "left cult", "antifa", "lunatics", "anti-police", "news cartels", "biased", "Teresa Yue Shen", "chaos", "extremism", "activists", "mainstream media", "domestic terrorism", "rioting", "insanity", "Atlanta", "night of rage", "CNN", "violence", "traitors"], "tweets": [], "movies": [], "links": ["https://thepostmillennial.com/breaking-antifa-riot-in-atlanta-after-comrade-shot-dead-by-cop-in-gunfight", "https://thepostmillennial.com/atlanta-antifa-suspect-worked-at-cnn-is-daughter-of-chinese-pharma-tycoon-and-global-diversity-expert", "https://www.dailymail.co.uk/news/article-11667905/Antifa-terror-suspect-daughter-Pharma-China-giant-British-Foreign-Office-consultant.html", "https://thepostmillennial.com/andy-ngo-reports-four-charged-with-domestic-terrorism-following-deadly-shooting-at-atlanta-autonomous-zone", "https://thepostmillennial.com/breaking-treehouse-antifa-calls-for-night-of-rage-on-jan-20-after-cop-shoots-militant-dead-outside-atlanta-in-gunfight", "https://thepostmillennial.com/atlanta-antifa-suspect-worked-at-cnn-is-daughter-of-chinese-pharma-tycoon-and-global-diversity-expert", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcnnsofakenews%2F2023-01-24-atlanta-antifa-suspect-worked-at-cnn.html&linkname=Atlanta%20Antifa%20suspect%20worked%20at%20CNN%2C%20is%20daughter%20of%20Chinese%20pharma%20tycoon%20and%20%E2%80%98global%20diversity%20expert%E2%80%99", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}