{"result_id": "073027", "URL": "https://cnnsofake.news/2022-03-03-wuhan-wen-now-admits-masks-lockdowns-dangerous.html", "timestamp": "2023-04-25 14:45:48 CEST+0200", "meta": {"description": "“Closing educational disparities” is now at the top of the list of advice coming from the mouth of CNN crisis actor Dr. Leana “Wuhan Wen.” “The science has changed,” Wen declares in order to back up her new anti-science narrative. Straight out of communist China, Wen came to America to tell us all to wear […]", "lang": "en", "keywords": "badhealth,badmedicine,Censored Science,cnn crisis actor,covid masks,Dangerous Medicine,deception,disinfo,Leana Wen,lies,mainstream media,mask mandates,news cartels,one way masking,propaganda,vaccine pushers,wen,wuhan wen", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://cnnsofake.news/2022-03-03-wuhan-wen-now-admits-masks-lockdowns-dangerous.html", "encoding": "UTF-8"}, "image": null, "domain": "cnnsofake.news", "title": "CCP plant “Wuhan Wen” now agrees with “anti-science” Americans and admits that Covid masks and lockdowns RUIN children’s cognitive and motor development", "cleaned_text": "CCP plant “Wuhan Wen” now agrees with “anti-science” Americans and admits that Covid masks and lockdowns RUIN children’s cognitive and motor development\n\n“Closing educational disparities” is now at the top of the list of advice coming from the mouth of CNN crisis actor Dr. Leana “Wuhan Wen.” “The science has changed,” Wen declares in order to back up her new anti-science narrative. Straight out of communist China, Wen came to America to tell us all to wear masks indefinitely to protect the world from the China flu, then she said the masks only work in one direction, which she termed “one way masking,” claiming the masks only protect the mask wearer, but nobody else (you really can’t make this stuff up, unless you’re her).\n\nNow “Wuhan Wen” is saying take off those darned masks, because they interfere with cognitive and motor development, especially for children. Has she been wearing her own mask too long to understand that nothing she has said before this, for TWO YEARS, was based on science? Yes, masks are absolutely HORRIFIC for your health all around, restricting oxygen flow by as much as 20 percent all day, obstructing oxygen and nutrient flow to all parts of the body, and THAT IS based on science.\n\nSo are all the previous “anti-science” Americans redeemed, and will all those banned from social media be reinstated? Where are the apologies? If the science simply changes when the wind blows in a new direction, then remove every vaccine and mask mandate across the globe right now.\n\nCrisis actor Dr. Wen now saying what Truth Media has been screaming for 2 years, which was all censored as “anti-science”\n\nWuhan Wen, CNN’s favorite China Flu talking head, now says it’s the “right time to lift mask mandates,” based on nothing scientific, but rather hinged completely on the New York Times editorial board opinion of the situation. (Democrats need to get ready for mid-terms so they’re acting like they care about people’s human rights and medical choice.)\n\nAfter several in-depth studies and lots of research revealing that school closures and masking are destroying children’s cognitive and motor development, including preschoolers, the scamdemic, control-tripping mask and vaccine fanatics are now pulling back, trying to save face so they don’t ALL get voted out of office or put in jail for lying about deadly vaccines and slow-kill-suffocation, bacteria-breeding masks.\n\nIn fact, most of the kids that showed the most pronounced learning LOSS were the youngest ones who suffered not only from school closures, but from suffocating masks when they did attend school. It’s a double-edged sword, these China flu mandates, and the talking heads at CNN lie through their teeth to push the deadly propaganda.\n\nWen pushes her made-up theory “one way masking” on Americans just before saying kids shouldn’t wear them anymore\n\nNow even the far-Left, pro-scamdemic New York Times (NYT) admits it – that mask requirements are a huge mistake for everyone, especially kids. This comes just a couple weeks after crisis actor Dr. Wen made up the “one way masking” conspiracy theory that masks only protect the mask wearer. Now NYT admits it all, saying “…this is the right time to lift the requirement for masks in schools. It’s a lot to ask young children to wear masks for several hours a day, especially when so many adults seem to struggle with it.”\n\nYet, just a few weeks back, Dr. Wen shared her “expert advice” about how the microscopic virus particles cannot penetrate the bandana of the mask wearer going INTO their mouth, but still have no problem coming OUT of their mouth and escaping their cotton-rigged or strap-on polyester face apparatus.\n\nDr. Wen thinks we’re all suffering from amnesia, like her. It just goes to show you that you should never listen to crisis actor advice. Stay tuned and stay frosty. Tune your internet to Censored.news for huge swaths of truth news that’s being censored from the rest of media as you read this.", "opengraph": {"title": "CCP plant “Wuhan Wen” now agrees with “anti-science” Americans and admits that Covid masks and lockdowns RUIN children’s cognitive and motor development", "type": "article", "url": "https://www.cnnsofake.news/2022-03-03-wuhan-wen-now-admits-masks-lockdowns-dangerous.html", "site_name": "CNN So Fake News", "description": "“Closing educational disparities” is now at the top of the list of advice coming from the mouth of CNN crisis actor Dr. Leana “Wuhan Wen.” “The science has changed,” Wen declares in order to back up her new anti-science narrative. Straight out of communist China, Wen came to America to tell us all to wear […]", "image": "https://www.cnnsofake.news/wp-content/uploads/sites/392/2022/03/Coronavirus-Children-School-Learning.jpg"}, "tags": ["vaccine pushers", "one way masking", "cnn crisis actor", "covid masks", "wuhan wen", "mask mandates", "mainstream media", "wen", "deception", "Leana Wen", "disinfo", "lies", "news cartels", "Censored Science", "propaganda"], "tweets": [], "movies": [], "links": ["https://naturalnews.com/2022-02-11-cnn-crisis-actor-dr-leana-wen-now-says-lift-all-covid-restrictions.html", "https://naturalnews.com/2021-10-17-boston-bombing-actor-turns-out-to-be-cnn-dr-leana-wen.html", "http://brain.news", "https://naturalnews.com/2022-02-21-virginia-governor-ends-mask-mandate-in-schools.html", "https://naturalnews.com/2021-07-05-children-gassed-with-carbon-dioxide-mask-mandates.html", "https://citizenfreepress.com/breaking/dr-leana-wen-thinks-you-suffer-from-amnesia/", "https://www.censored.news/", "https://citizenfreepress.com/breaking/dr-leana-wen-thinks-you-suffer-from-amnesia/", "https://www.naturalnews.com/2022-01-02-what-dr-robert-malone-could-not-tell-joe-rogan.html", "https://www.thegatewaypundit.com/2022/01/just-like-soviet-russia-t-mobile-erasing-links-gateway-pundit-articles-send-text-message/", "https://www.censored.news/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcnnsofakenews%2F2022-03-03-wuhan-wen-now-admits-masks-lockdowns-dangerous.html&linkname=CCP%20plant%20%E2%80%9CWuhan%20Wen%E2%80%9D%20now%20agrees%20with%20%E2%80%9Canti-science%E2%80%9D%20Americans%20and%20admits%20that%20Covid%20masks%20and%20lockdowns%20RUIN%20children%E2%80%99s%20cognitive%20and%20motor%20development", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}