{"result_id": "073018", "URL": "https://cnnsofake.news/2021-12-02-cnn-biden-covid-jab-mandates-suffering-setbacks.html", "timestamp": "2023-04-25 14:45:43 CEST+0200", "meta": {"description": "Three major court case decisions have greatly interfered with the Biden regime’s efforts to force-vaccinate all of America. And CNN has resorted to whining about it. The latest ruling came out of Louisiana where a federal judge halted a mandate nationwide that would have required all health care workers within certain government departments to take […]", "lang": "en", "keywords": "badhealth,badmedicine,big government,CNN,COVID,fake news,Joe Biden,lies,mainstream media,medical fascism,Medical Tyranny,Plandemic,unconstitutional,vaccine mandates,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://cnnsofake.news/2021-12-02-cnn-biden-covid-jab-mandates-suffering-setbacks.html", "encoding": "UTF-8"}, "image": null, "domain": "cnnsofake.news", "title": "CNN complains that Biden’s covid jab mandates are “suffering setbacks” due to judges putting them on hold", "cleaned_text": "CNN complains that Biden’s covid jab mandates are “suffering setbacks” due to judges putting them on hold\n\nThree major court case decisions have greatly interfered with the Biden regime’s efforts to force-vaccinate all of America. And CNN has resorted to whining about it.\n\nThe latest ruling came out of Louisiana where a federal judge halted a mandate nationwide that would have required all health care workers within certain government departments to take the jab by early January.\n\nThat decision came after an earlier one that affected just 10 states. Now, health care workers from every state who work in the affected sector are no longer required to get injected at Biden’s command.\n\nIn another ruling, federal contractors who were previously told they must get injected also became exempt, at least temporarily. That decision came from a federal judge in Kentucky.\n\nWe also received word that the Biden regime is planning to voluntarily withdraw its mandates, at least until the holidays are over.\n\nPresumably to avoid embarrassment over widespread non-compliance, the regime is reportedly backing off for now with plans to revisit the issue in the new year, at least according to ABC News.\n\nDepartment of Justice fearmongers about how refusing covid vaccination “threatens human life”\n\nCNN is presenting a slightly different version of events, claiming that the Biden regime “has acted quickly to seek reversals of the orders blocking its vaccine rules.”\n\n“That threat to human life and health far exceeds the potential indirect harms to patients resulting from workers who may quit rather than receive the vaccine,” the Department of Justice reportedly said in a filing asking an appeals court to reinstate the mandate covering certain health care staff at providers that participate in Medicare and Medicaid.\n\nU.S. District Judge Gregory Frederick Van Tatenhove, who ruled in the Kentucky case, said that the question before him about whether the federal government has the authority to mandate injections was “narrow.”\n\n“Can the president use congressionally delegated authority to manage the federal procurement of goods and services to impose vaccines on the employees of federal contractors and subcontractors. In all likelihood, the answer to that question is no,” he stated.\n\nIn his order, Tatenhove blocked the contractor mandate in the states of Kentucky, Ohio and Tennessee.\n\nOther judges used more sweeping language in their decisions, which greatly upset CNN to the point that it accused them of “downplaying vaccines’ effectiveness.”\n\n“During a pandemic such as this one, it is even more important to safeguard the separation of powers set forth in our Constitution to avoid erosion of our liberties,” said U.S. District Judge Terry Doughty of Louisiana, which CNN had to point out was appointed by Donald Trump.\n\nThe Justice Department has already petitioned the 8th Circuit Court of Appeals to revive the now-suspended mandate that was partially blocked in the Missouri case. The other cases, if appealed, would go to different appeals courts.\n\nA White House spokesperson commented that the remaining mandates have supposedly been a success, and that their implementation “sends the clear message to businesses” that the mandates currently on hold, if reversed, will “protect their workforce, protect their customers, and protect our communities.”\n\n“We are confident in the government’s authority to promote economy and efficiency in federal contracting through its vaccine requirement and the Department of Justice will vigorously defend it in court,” this same person added.\n\nA Natural News commenter pointed out that the Biden regime’s alleged suspension of some of the other mandates is just a cover for the fact that they were actually slapped down by these courts.\n\n“When the parasites finally turn on them, they are through,” another wrote about the situation.\n\nThe latest news about the Biden regime’s assault on individual liberty can be found at Fascism.news.", "opengraph": {"title": "CNN complains that Biden’s covid jab mandates are “suffering setbacks” due to judges putting them on hold", "type": "article", "url": "https://www.cnnsofake.news/2021-12-02-cnn-biden-covid-jab-mandates-suffering-setbacks.html", "site_name": "CNN So Fake News", "description": "Three major court case decisions have greatly interfered with the Biden regime’s efforts to force-vaccinate all of America. And CNN has resorted to whining about it. The latest ruling came out of Louisiana where a federal judge halted a mandate nationwide that would have required all health care workers within certain government departments to take […]", "image": "https://www.cnnsofake.news/wp-content/uploads/sites/392/2021/12/CNN-fake-news-network.png"}, "tags": ["Joe Biden", "big government", "fake news", "medical fascism", "unconstitutional", "vaccine wars", "mainstream media", "COVID", "CNN", "Medical Tyranny", "vaccine mandates", "vaccines", "lies", "Plandemic"], "tweets": [], "movies": [], "links": ["https://archive.md/wIV9L", "https://www.naturalnews.com/2021-12-01-biden-suspends-delays-covid-jab-mandate-for-federal-workers.html", "http://fascism.news", "https://archive.md/wIV9L", "https://www.naturalnews.com/2021-12-01-biden-suspends-delays-covid-jab-mandate-for-federal-workers.html"], "authors": [], "publish_date": null}