{"result_id": "073022", "URL": "https://cnnsofake.news/2018-07-30-zika-scare-was-a-fake-science-hoax-pushed-by-the-entire-establishment-media.html", "timestamp": "2023-04-25 14:45:45 CEST+0200", "meta": {"description": "The Zika virus scare of summers past may have come and gone, but it should not be forgotten. After all, it was one of the greatest hoaxes pushed by the legacy media and their masters ever witnessed. After the initial frenzy died down, stories about the threat of Zika have all but been dropped by […]", "lang": "en", "keywords": "badhealth,badmedicine,badscience,Dangerous Medicine,deception,depopulation,evil corporation,fake disease,fake news,fake science,false-flag,globalist agenda,hoax,infectious disease,junk science,lies,mainstream media,propaganda,real investigations,scare stories,vaccines,Zika,zika virua hoax,Zika virus", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://cnnsofake.news/2018-07-30-zika-scare-was-a-fake-science-hoax-pushed-by-the-entire-establishment-media.html", "encoding": "UTF-8"}, "image": null, "domain": "cnnsofake.news", "title": "Has everyone forgotten? The massive “Zika scare” was a fake science HOAX pushed by the entire establishment media… not a single retraction ever published", "cleaned_text": "Has everyone forgotten? The massive “Zika scare” was a fake science HOAX pushed by the entire establishment media… not a single retraction ever published\n\nThe Zika virus scare of summers past may have come and gone, but it should not be forgotten. After all, it was one of the greatest hoaxes pushed by the legacy media and their masters ever witnessed. After the initial frenzy died down, stories about the threat of Zika have all but been dropped by the media like hotcakes. How could this disease have gone from zero to 60 and back again, in such a short span of time?\n\nPerhaps, because it was all a hoax; the Zika scare was conjured up to hide the effects of a toxic chemical pesticide being sprayed aerially in South American countries like Brazil. Since the Zika media circus first began, there have been those who questioned its validity. Was Zika truly the cause of microcephaly in thousands of Brazilian babies, or was it something more sinister?\n\nOne of the first signs that the Zika scare was fake came in 2016: After the 2015 surge in birth defects in Brazil, which were all attributed to the disease, experts expected that a similar spike in microcephaly would come in 2016 when the virus began circulating again. Health officials posited that there would be at least 1,000 cases of the condition in 2016.\n\nThat surge in birth defects never came. Christopher Dye, from the World Health Organization, told NPR, “We apparently saw a lot of cases of Zika virus in 2016. But there was no microcephaly.”\n\nDye and his colleagues found that there were fewer than 100 cases of microcephaly in 2016 — a difference the expert described as “spectacular.”\n\n“This is a huge, huge discrepancy,” Dye commented. “So what could possibly be the explanation for that?”\n\nThere are a few different ideas, according to Dye. He posits that one of the most likely hypotheses is that the cause of microcephaly in Brazil was never the Zika virus to begin with. Dye and other experts have suggested that perhaps it was another virus, or two viruses acting in synergy to cause more deleterious health effects.\n\nWhile all these theories ultimately stick to the narrative that some mosquito-born illness they haven’t yet identified must be the cause, there are a few issues that are clearly being ignored. For example, Mike Adams, founder of Natural News and director of CWC Labs, reported in 2016 that the Zika virus has actually been around since the 1970s. It has never been attributed to a single case of microcephaly before 2015.\n\nInterestingly enough, however, the pesticide being sprayed across Brazil in the months before the outbreak of “Zika” just so happens to be linked to birth defects.\n\n\n\nWas the “Zika scare” by design?\n\nIndeed, the same areas of Brazil afflicted by the so-called Zika crisis also happen to be the same areas where the government dumped large amounts of an insecticide, known as pyroproxyfen. Adams explains:\n\nThose same chemicals, when ingested by pregnant women, also cause neurodevelopmental deformities in human children. This doesn’t mean that Zika can’t also cause microcephaly in rare cases, but Zika is likely to be only a minor factor that’s far outpaced by the causative factor of larvicide exposure.\n\nReports show that pyroproxyfen was sprayed around Brazil by the government for 18 months before the outbreak of supposedly Zika-related birth defects began. How this is not a major red flag for “health officials” is beyond comprehension.\n\nUntil, of course, you consider the fact that the globalist Bayer corporation owns the patent on pyroproxyfen. “The globalist agenda is now set in motion. Birth deformities can now be blamed on a mosquito and used to justify the release of more chemicals into the environment,” Mike Adams contends. What other sinister plans do these tyrants have coming down the pike?\n\nSee more coverage of hoaxes, myths and the truth behind them at Lies.news.", "opengraph": {"title": "Has everyone forgotten? The massive “Zika scare” was a fake science HOAX pushed by the entire establishment media… not a single retraction ever published", "type": "article", "url": "https://www.cnnsofake.news/2018-07-30-zika-scare-was-a-fake-science-hoax-pushed-by-the-entire-establishment-media.html", "site_name": "CNN So Fake News", "description": "The Zika virus scare of summers past may have come and gone, but it should not be forgotten. After all, it was one of the greatest hoaxes pushed by the legacy media and their masters ever witnessed. After the initial frenzy died down, stories about the threat of Zika have all but been dropped by […]", "image": "https://www.cnnsofake.news/wp-content/uploads/sites/392/2018/07/Zika-virus.jpg"}, "tags": ["evil corporation", "fake news", "false-flag", "scare stories", "real investigations", "hoax", "fake disease", "infectious disease", "mainstream media", "deception", "zika virua hoax", "Zika virus", "Zika", "depopulation", "vaccines", "lies", "globalist agenda", "propaganda"], "tweets": [], "movies": [], "links": ["https://www.npr.org/sections/goatsandsoda/2017/03/30/521925733/why-didnt-zika-cause-a-surge-in-microcephaly-in-2016", "https://www.naturalnews.com/054870_Zika_pandemic_aerial_spraying_globalist_agenda.html", "https://www.naturalnews.com/2018-07-20-remember-the-zika-virus-mass-hysteria-pushed-by-the-media-shrunken-head-babies-we-were-warned-would-sweep-across-america.html", "http://www.lies.news", "https://www.naturalnews.com/2018-07-20-remember-the-zika-virus-mass-hysteria-pushed-by-the-media-shrunken-head-babies-we-were-warned-would-sweep-across-america.html", "https://www.npr.org/sections/goatsandsoda/2017/03/30/521925733/why-didnt-zika-cause-a-surge-in-microcephaly-in-2016", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcnnsofakenews%2F2018-07-30-zika-scare-was-a-fake-science-hoax-pushed-by-the-entire-establishment-media.html&linkname=Has%20everyone%20forgotten%3F%20The%20massive%20%E2%80%9CZika%20scare%E2%80%9D%20was%20a%20fake%20science%20HOAX%20pushed%20by%20the%20entire%20establishment%20media%E2%80%A6%20not%20a%20single%20retraction%20ever%20published", "https://www.addtoany.com/share"], "authors": [], "publish_date": null}