{"result_id": "073009", "URL": "https://cnnsofake.news/2022-03-25-shroyer-accuses-mainstream-media-of-spreading-deepfakes.html", "timestamp": "2023-04-25 14:45:37 CEST+0200", "meta": {"description": "Owen Shroyer couldn’t hide his anger with the mainstream media any longer. He chided them for spreading deepfakes not occasionally but consistently. Using the March 17 episode of “War Room” on InfoWars as his platform, Shroyer lashed at MSNBC, Washington Post, New York Times and CNN for all the deepfakes they have pulled over America for a […]", "lang": "en", "keywords": "Ashley Biden,big government,CNN,conspiracy,deception,deepfake,disinfo,fake news,Government Slaves,Hunter Biden,Joe Biden,lies,mainstream media,msnbc,news cartels,NYT,Owen Shroyer,propaganda,Russia,Ukraine,Volodymyr Zelensky,Washington Post", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://cnnsofake.news/2022-03-25-shroyer-accuses-mainstream-media-of-spreading-deepfakes.html", "encoding": "UTF-8"}, "image": null, "domain": "cnnsofake.news", "title": "Owen Shroyer accuses mainstream media of spreading deepfakes", "cleaned_text": "Owen Shroyer couldn’t hide his anger with the mainstream media any longer. He chided them for spreading deepfakes not occasionally but consistently.\n\nUsing the March 17 episode of “War Room” on InfoWars as his platform, Shroyer lashed at MSNBC, Washington Post, New York Times and CNN for all the deepfakes they have pulled over America for a long time. (Related story: The fall of the mainstream media and the biggest lies they told in 2021.)\n\nAmong the examples of deepfakes cited by Shroyer were: vaccine safe and effective, (former President Donald) Trump-Russia collusion, the Hunter Biden laptop story, five cops died on the January 6 Capitol incident, Syria used chemical weapons, Ghost of Kyiv. The list is so long Shroyer said he could go on and on and on.\n\nBut what caught Shroyer’s ire recently is when MSNBC “took an unknown video that nobody saw, and said: This is a deepfake. It’s really dangerous.”\n\nThat faked video purportedly shows Ukraine President Volodymyr Zelensky telling his troops to lay down their arms and yield to the Russian invaders. Although the Ukrainian authorities have warned such deepfakes are forthcoming as part of Russian President Vladimir Putin’s war propaganda just two days before, MSNBC still willingly fell for the crap.\n\nMSNBC even had the gall to claim that the video went viral, according to Shroyer, when it was hardly seen by even those monitoring the Russia-Ukraine conflict.\n\n“And they (MSNBC) say, look how deepfakes are spreading on the internet,” said Shroyer. “All MSNBC does is deepfakes. Your entire operation is a deepfake. You’re not a news organization. You’re a Democratic Party front group, you are a deepfake. MSNBC, warning me about deepfakes. That’s hilarious. Your entire operation is a deepfake.”\n\nThe truth is, Shroyer feels they (MSNBC or Democrats) may have made the clearly faked video themselves, perhaps to divert attention from two damning issues against President Joe Biden that have resurfaced and turned out to be true.\n\nThe first is Hunter Biden’s laptop story. Dismissed as Russian disinformation by the corporate media before the 2020 elections, the New York Times has finally admitted the influence-peddling by the president’s son was real. The Washington Post was obliged to follow suit and now the rest of the mainstream media is trying to catch up.\n\nThe second was the Ashley Biden diary that contained handwritten notes of the presidential daughter alleging her father was doing inappropriate things when they were in the shower together.\n\nLike Hunter’s laptop, Ashley’s diary is around as proof, unless somebody with magical powers manages to make it disappear.\n\nThe fact that the Biden administration has suddenly become “so concerned about pornographic material being leaked” roused suspicions of another cover-up in the making, Shroyer said.\n\nShroyer also cited the case of Natalia Sindeeva and Vera Krichevskaya, who were behind the controversial documentary Tango with Putin. After defying the Russian president, the Kremlin banned their TV station and deleted its media archive. The two women also told columnist Kevin Maher that they have faced arrest and imprisonment.\n\nThese things were familiar to Shroyer, a political activist. “I’ve been completely censored. I’ve had my video archives arranged. I’ve been faced with imprisonment,” said Shroyer.\n\nBut just like the two Russian women, Shroyer won’t be silenced. He’s taking on the Biden administration, the Democrats and the mainstream media to prove that truth still prevails in the end.\n\nFollow MediaFactWatch.com for news related to the deepfakes propagated by mainstream media outlets.\n\nWatch the video below to know how MSNBC got caught deep faking the world.\n\nThis video is from the InfoWars channel on Brighteon.com.\n\nBig Pharma, mainstream media looking to create the next big health scare as COVID fears subside.\n\nHow the mainstream media’s “fake news” undermines democracy and protects the corrupt establishment: new mini-documentary by the Health Ranger.\n\nMainstream media unleashes tsunami of fake news, yet none of them are removed from Google News for being fake.", "opengraph": {"title": "Owen Shroyer accuses mainstream media of spreading deepfakes", "type": "article", "url": "https://www.cnnsofake.news/2022-03-25-shroyer-accuses-mainstream-media-of-spreading-deepfakes.html", "site_name": "CNN So Fake News", "description": "Owen Shroyer couldn’t hide his anger with the mainstream media any longer. He chided them for spreading deepfakes not occasionally but consistently. Using the March 17 episode of “War Room” on InfoWars as his platform, Shroyer lashed at MSNBC, Washington Post, New York Times and CNN for all the deepfakes they have pulled over America for a […]", "image": "https://www.cnnsofake.news/wp-content/uploads/sites/392/2022/03/mainstream-media.jpg"}, "tags": ["conspiracy", "big government", "deception", "NYT", "lies", "news cartels", "Ashley Biden", "deepfake", "disinfo", "propaganda", "Joe Biden", "Volodymyr Zelensky", "fake news", "Hunter Biden", "mainstream media", "Russia", "Washington Post", "Government Slaves", "msnbc", "Owen Shroyer", "CNN", "Ukraine"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/4ee9961e-2817-40e6-846c-d9328b53edcf", "https://naturalnews.com/2022-01-03-fall-of-mainstream-media-biggest-lies-2021.html", "https://www.wsj.com/articles/why-the-biden-laptop-matters-now-hunter-trump-election-2020-new-york-times-11647981178?mod=hp_opin_pos_2", "http://msnbc.news", "https://www.dailymail.co.uk/news/article-10636771/Ashley-Bidens-diary-shopped-Trump-fundraiser-Project-Veritas-bought-it.html", "https://www.thetimes.co.uk/article/tango-with-putin-natalya-sineeva-vera-krichevskaya-interview-0wt8xnkrt", "http://mediafactwatch.com", "https://www.brighteon.com/4ee9961e-2817-40e6-846c-d9328b53edcf", "https://www.brighteon.com/channels/infowarsnetwork", "https://newstarget.com/2022-02-18-big-pharma-media-next-health-scare.html", "https://naturalnews.com/2016-12-09-how-the-mainstream-medias-fake-news-undermines-democracy-protects-corrupt-establishment-documentary-health-ranger.html", "https://naturalnews.com/2019-09-21-mainstream-media-fake-news-google.html", "https://www.brighteon.com/4ee9961e-2817-40e6-846c-d9328b53edcf", "https://www.wsj.com/articles/why-the-biden-laptop-matters-now-hunter-trump-election-2020-new-york-times-11647981178?mod=hp_opin_pos_2", "https://www.dailymail.co.uk/news/article-10636771/Ashley-Bidens-diary-shopped-Trump-fundraiser-Project-Veritas-bought-it.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcnnsofakenews%2F2022-03-25-shroyer-accuses-mainstream-media-of-spreading-deepfakes.html&linkname=Owen%20Shroyer%20accuses%20mainstream%20media%20of%20spreading%20deepfakes", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}