{"result_id": "073005", "URL": "https://cnnsofake.news/2022-05-19-french-marine-ukrainian-troops-committing-war-crimes.html", "timestamp": "2023-04-25 14:45:34 CEST+0200", "meta": {"description": "A former French marine who went to fight on behalf of Ukraine following the invasion of Russian troops says that war crimes are definitely being committed there, but it’s not Russian forces who are guilty, it’s the Ukrainians. Not only that, but several Ukrainian soldiers he came in contact with are neo-Nazis and bigots who […]", "lang": "en", "keywords": "Azov Battalion,bigots,chaos,conspiracy,deception,disinfo,evil,eyewitness,false-flag,French marine,insanity,Journalism,mainstream media,neo-nazis,propaganda,Racists,Russia,torture,traitors,truth,Ukraine,War crimes,World War III", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://cnnsofake.news/2022-05-19-french-marine-ukrainian-troops-committing-war-crimes.html", "encoding": "UTF-8"}, "image": null, "domain": "cnnsofake.news", "title": "Former French marine returns from Ukraine, says “war crimes” are being committed by Ukrainian troops who would “skin Jews or Blacks”", "cleaned_text": "Former French marine returns from Ukraine, says “war crimes” are being committed by Ukrainian troops who would “skin Jews or Blacks”\n\nA former French marine who went to fight on behalf of Ukraine following the invasion of Russian troops says that war crimes are definitely being committed there, but it’s not Russian forces who are guilty, it’s the Ukrainians.\n\nNot only that, but several Ukrainian soldiers he came in contact with are neo-Nazis and bigots who vowed to harm Jews if they could get away with it.\n\nThe former marine, Adrien Bocquet, told Sud Radio, a French station, that he witnessed “a lot of war crimes” by Ukrainians but none by Russian troops, adding that because of that, he is extremely concerned as to why Europe and the United States are sending weapons to racist neo-Nazis and Jew-haters who are wearing Nazi symbols on their uniforms and even go so far as to brag about them.\n\n“I worked with them and gave them medicine. Do you know what they said? That they would skin Jews or blacks if they had the chance,” he told the station, noting that those remarks do not line up with the ‘mainstream’ media narrative of saving “democracy” and “our values” in Ukraine.\n\n“People can say whatever they want. I was there. I saw what happened there,” emphasized Bocquet, who says he has several dozen videos of war crimes.\n\nIn one instance, he saw a barn full of Russian prisoners of war who were tied up and had been beaten.\n\n“Fighters from the Azov battalion asked them who the officers were. Each Russian soldier was shot in the knees with a Kalashnikov. I have videos that prove it, otherwise, I would not dare to say such a thing,” he said.\n\nHe went on to say that Russian officers were immediately killed by being shot in the head.\n\n“That’s how it goes, at least in the Azov battalion,” the French ex-marine said.\n\nHe went on to say that he had witnessed an American cameraman blatantly staging footage — because our news organizations are really just propaganda organs for the deep state — as well as Ukrainian military personnel hiding ammunition in civilian homes at night without informing the residents.\n\nSpeaking of U.S. media, earlier CNN feted a Ukrainian physician who is ordering other doctors in his country to commit war crimes against Russian troops by castrating them.\n\nUkraine’s Mobile Hospital Head Gennadiy Druzenko is celebrating the fact that he gave “strict orders” to Ukrainian troops to castrate all wounded Russian soldiers they capture because Russians “are cockroaches, not humans,” according to Druzenko. And fake news giant CNN is praising Druzenko for doing and saying all this.\n\nWhat Druzenko basically admitted in a translated Channel 24 interview that is going viral amounts to war crimes. And yet, CNN apparently sees nothing wrong with war crimes just so long as they are committed against Russians, which have become the world’s whipping post.\n\nCNN‘s Fareed Zakaria featured Druzenko as a guest during a recent segment in which he called Druzenko an “intellectual” while showering him with praise for “joining the fight” against Russian President Vladimir Putin.\n\nZakaria even went so far as to dub Druzenko a “medical angel,” while also calling the soldiers that Druzenko ordered to castrate wounded Russian soldiers “medical angels” whose job it is to “save lives on the front line.”\n\nBut Zakaria and Durzenko were both called out by Maajid Nawaz, a Twitter account that is exposing the war crimes and brutality.\n\n“People prefer DENIAL over accepting (the fact that) we are ARMING NAZI battalions & those who encourage WAR CRIMES,” one recent tweet noted.\n\nDruzenko then went on Facebook to claim that he and his soldiers are not castrating anyone and are “not going to,” but the Twitter account went on to post very graphic videos proving Druzenko wrong.", "opengraph": {"title": "Former French marine returns from Ukraine, says “war crimes” are being committed by Ukrainian troops who would “skin Jews or Blacks”", "type": "article", "url": "https://www.cnnsofake.news/2022-05-19-french-marine-ukrainian-troops-committing-war-crimes.html", "site_name": "CNN So Fake News", "description": "A former French marine who went to fight on behalf of Ukraine following the invasion of Russian troops says that war crimes are definitely being committed there, but it’s not Russian forces who are guilty, it’s the Ukrainians. Not only that, but several Ukrainian soldiers he came in contact with are neo-Nazis and bigots who […]", "image": "https://www.cnnsofake.news/wp-content/uploads/sites/392/2022/05/Ukraine-Russia-War-NLAW-Anti-Tank-Launcher.jpg"}, "tags": ["conspiracy", "Journalism", "deception", "bigots", "eyewitness", "War crimes", "chaos", "torture", "truth", "disinfo", "French marine", "propaganda", "false-flag", "mainstream media", "Russia", "World War III", "Racists", "insanity", "evil", "neo-nazis", "Azov Battalion", "Ukraine", "traitors"], "tweets": [], "movies": [], "links": ["https://freewestmedia.com/2022/05/14/french-former-marine-returns-from-ukraine-shocked/", "http://www.newscartels.com", "https://freewestmedia.com/2022/05/14/french-former-marine-returns-from-ukraine-shocked/", "https://naturalnews.com/2022-03-22-cnn-celebrates-ukrainian-doctor-war-crimes-russia.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcnnsofakenews%2F2022-05-19-french-marine-ukrainian-troops-committing-war-crimes.html&linkname=Former%20French%20marine%20returns%20from%20Ukraine%2C%20says%20%E2%80%9Cwar%20crimes%E2%80%9D%20are%20being%20committed%20by%20Ukrainian%20troops%20who%20would%20%E2%80%9Cskin%20Jews%20or%20Blacks%E2%80%9D", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}