{"result_id": "074005", "URL": "https://www.coasttocoastam.com/show/2021-12-27-show/", "timestamp": "2023-04-25 14:46:03 CEST+0200", "meta": {"description": "Dr. Peter A. McCullough presented what he considers research-based and balanced information on the prevention and treatment of COVID-19. Followed by author Jon Gabriel on how we move through multiple universes or timelines.", "lang": "en", "keywords": "COVID, COVID treatments, vaccines, weight loss, mind-body", "favicon": "https://i.iheart.com/v3/re/assets.coast2coast/5d4dc9096ea20854764b2ce8?ops=gravity(%22center%22),contain(32,32),quality(65)", "canonical": "https://www.coasttocoastam.com/show/2021-12-27-show/", "encoding": "UTF-8"}, "image": null, "domain": "www.coasttocoastam.com", "title": "COVID Treatments / Living in Multiple Universes", "cleaned_text": "Internist and cardiologist Dr. Peter A. McCullough has been managing the cardiovascular complications of both the coronavirus infection, and injuries developing after the COVID-19 vaccine. In the first half, he discussed his battle to provide what he considers balanced, research-based information on the prevention and treatment of COVID-19. Regarding the spread of the Omicron variant, \"the reason why it's supplanting Delta is that it's multiplying at about 70 times the rate of Delta,\" he explained, adding that it's broken through both natural and vaccine immunity. Over 70% of Omicron patients are fully vaccinated, and that is because the virus has learned to thrive in the vaccinated environment, he asserted. Yet, he noted that for most who get infected with Omicron, the illness is mild and short-lived.\n\nWhile McCullough has been an advocate of using ivermectin as an oral COVID treatment, he reported that the new Pfizer pill looks to be even more effective. He suggested several home treatments that he believes can act as a prophylactic measure against coming down with COVID. This includes spraying the nose with a diluted Povidone-iodine (10%) solution, which McCollough said can kill off the virus, as it starts its growth in the nasal passage. He also recommended such supplements as zinc, quercetin, Vitamins C and D, and the over-counter drug Pepcid, an antihistamine and antacid, \"that actually inhibits bio-replication to some degree.\" He further argued that \"public health agencies are fueling conspiracy theories because of the lack of transparency\" and that doctors in the front line of treating COVID patients should be helping set policy rather than administrators.\n\nA graduate of the Wharton School, Jon Gabriel discovered a mind-body connection that helped him thrive and even lose over 220 pounds. In the latter half, he talked about how combining quantum physics and metaphysics creates a paradigm shift in the way we view the world. Quantum physics has put forward the theory that we are living in a multiverse-- that there could be an infinite number of parallel universes existing simultaneously. There are possible versions of ourselves living in all these different universes, he suggested, and intriguingly \"we're actually moving through these universes all the time without knowing it.\" Further, we can become conscious of this traversing and do certain things that enable us to be in the best timeline possible, he stated.\n\nAs evidence for the multiple world theory, Gabriel cited the Mandela Effect, in which people's memories of certain past events differ from the current reality. When many people experience this, it could be an indicator that we've changed timelines, he commented. After doing a 21-day water-only fast in 2006, he entered into a period of higher perceptions and cosmic consciousness, and became aware of the simultaneous universes. \"It was almost like my body was the multiverse...and each cell was a different universe,\" and he said he could see the energy inside other people's bodies. If you look at the multiverse as an ocean, Gabriel continued, the universes at the bottom may be darker and heavier, while the ones at the top are more buoyant and light-filled, and \"we're going to be somewhere in the middle based on where our energy profiles fit.\" We can use visualization and meditation to raise or open our energy, he added, so that we naturally drift to a higher version of reality.", "opengraph": {"locale": "en_us", "title": "COVID Treatments / Living in Multiple Universes | Coast to Coast AM", "description": "Dr. Peter A. McCullough presented what he considers research-based and balanced information on the prevention and treatment of COVID-19. Followed by author Jon Gabriel on how we move through multiple universes or timelines.", "url": "https://www.coasttocoastam.com/show/2021-12-27-show/", "image": "https://i.iheart.com/v3/re/new_assets/61c56e9f33e3c0a482a8eeca?ops=gravity(%22north%22),fit(1200,675),quality(65)", "image:width": "1200", "image:height": "675", "type": "article", "site_name": "Coast to Coast AM"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.truthforhealth.org/", "https://howtochangeyouruniverse.com/", "https://www.esquire.com/lifestyle/g29077060/mandela-effect-examples", "https://www.vortex.com", "http://drsky.com"], "authors": [], "publish_date": "December 27, 2021"}