{"result_id": "074013", "URL": "https://www.coasttocoastam.com/show/2015-02-11-show/", "timestamp": "2023-04-25 14:46:13 CEST+0200", "meta": {"description": "Various experts who have been on the front lines of the fight over vaccination discussed the medical and ethical arguments both for and against the use of vaccination, and the legal and medical implications of mandatory inoculations for all. Appearing in individual half-hour segments were research scholar Mary Holland, Dr. Andrew Wakefield, author Howard Bloom, editor John Stone, Dr. Gary Ridenour, and Dr. Sherri Tenpenny.       First hour guest, director and producer of the Watchers series of DVDs, Richard Shaw discussed the results of the search for George Noory's name in the Torah Codes.", "lang": "en", "keywords": "coast to coast am, radio, ufos, creatures, extraterrestrial, supernatural, myths, legends, monsters, space, universe, science, mystery, sci-fi, george noory, ian punnett, george knapp, art bell, somewhere in time", "favicon": "https://i.iheart.com/v3/re/assets.coast2coast/5d4dc9096ea20854764b2ce8?ops=gravity(%22center%22),contain(32,32),quality(65)", "canonical": "https://coast-pr.radio.iheart.com/show/2015-02-11-show/", "encoding": "UTF-8"}, "image": null, "domain": "www.coasttocoastam.com", "title": "Vaccine Special", "cleaned_text": "Various experts who have been on the front lines of the fight over vaccination discussed the medical and ethical arguments both for and against the use of vaccination, and the legal and medical implications of mandatory inoculations for all. Guests appeared in individual half-hour segments, starting with legal research scholar Mary Holland, who explained that while US states have mandatory vaccine laws for children entering schools, most offer medical exceptions. While she believes her own child may have been injured by a vaccine, she isn't against vaccines, and noted that the law explains that vaccines can cause damage in some cases. \"I believe that people have to make individual health choices,\" because it's indisputable that vaccines can cause injury and death. Most parents choose to vaccinate their children-- they think it's helpful and protective, and it's what most doctors recommend, she commented.\n\nDr. Andrew Wakefield who faced controversy and fraud charges for his paper that supported the claim that there's a link between the MMR (measles, mumps, rubella) vaccine and autism, suggested there's been a concerted effort to silence dissent when it comes to vaccine safety. He did say that one could make a good case for vaccinating children against measles, but that multiple inoculations like MMR were dangerous, and the mumps vaccine is no longer even necessary. Appearing next, author Howard Bloom argued that vaccinations save thousands of lives, and that it was a \"dark age mentality\" to assume that because government is involved in vaccines, it must be part of some sinister conspiracy.\n\nEditor of the Age of Autism blog, John Stone, talked about the suppression of adverse effects from vaccines, and how the government in the UK has not acknowledged that autism could be one of the effects, event though there's been a steady rise in such cases. Dr. Gary Ridenour, who supports vaccines, believes parents have the right to refuse the procedure for their children, but then they should be prepared to home school them, in order to reduce the chance of spreading infections. Last up, Dr. Sherri Tenpenny asserted that we need to update the conversation about vaccines. Vaccinations came about 150 years ago, when hygiene was an issue, and smallpox was a far more virulent disease. \"Every child does not need every single dose of every single vaccine...we have to bring some rationality to this conversation,\" she remarked.\n\nFirst hour guest, director and producer of the Watchers series of DVDs, Richard Shaw discussed the results of the search for George Noory's name in the Torah Codes. The concept is based on the idea that embedded in the Hebrew version of the Old Testament or Torah are certain equidistant letter sequences, revealed by computer software, which spell out names, phrases, and possible messages. Rabbi Glazerson, one of the team who discovered the codes, conducted a search for George's name and found these words in a particular table: \"Coast to Coast,\" \"In the United States,\" \"Noory,\" \"George,\" \"Radio,\" and \"Broadcaster.\" For more, view Table 1, Table 2, Table 3.", "opengraph": {"locale": "en_us", "title": "Vaccine Special | Coast to Coast AM", "description": "Various experts who have been on the front lines of the fight over vaccination discussed the medical and ethical arguments both for and against the use of vaccination, and the legal and medical implications of mandatory inoculations for all. Appearing in individual half-hour segments were research scholar Mary Holland, Dr. Andrew Wakefield, author Howard Bloom, editor John Stone, Dr. Gary Ridenour, and Dr. Sherri Tenpenny.       First hour guest, director and producer of the Watchers series of DVDs, Richard Shaw discussed the results of the search for George Noory's name in the Torah Codes.", "url": "https://www.coasttocoastam.com/show/2015-02-11-show/", "image": "https://i.iheart.com/v3/re/assets.coast2coast/324ea4c8cce0320488db26e593a606e5?ops=gravity(%22north%22),fit(1200,675),quality(65)", "image:width": "1200", "image:height": "675", "type": "article", "site_name": "Coast to Coast AM"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.vaccineepidemic.com/", "http://www.autismmediachannel.com/", "http://www.howardbloom.net/", "http://www.ageofautism.com/john-stone-uk/", "http://www.sgn80.com/", "http://drtenpenny.com/", "http://www.endtodarkness.com/", "http://www.pinlight.com/about2.htm", "http://www.pinlight.com/about3.htm", "http://www.pinlight.com/about4.htm", "http://www.wnd.com/author/jcorsi", "http://www.enterprisemission.com/", "http://www.vortex.com"], "authors": ["Coast to Coast AM Staff"], "publish_date": "February 11, 2015"}