{"result_id": "074026", "URL": "https://www.coasttocoastam.com/alternate/amp/show/2022-01-17-show/", "timestamp": "2023-04-25 14:46:28 CEST+0200", "meta": {"description": "Constitutional lawyer Jonathan Emord discussed the state of individual rights in light of vaccination mandates and restrictions. Followed by psychotherapist Dr. Laurie Nadel on dealing with pandemic-era stress.", "lang": "en", "keywords": "citizen rights, mandates, ESP, precognition", "favicon": "https://i.iheart.com/v3/re/assets.coast2coast/5d4dc9096ea20854764b2ce8?ops=gravity(%22center%22),contain(32,32),quality(65)", "canonical": "https://www.coasttocoastam.com/show/2022-01-17-show/", "encoding": "UTF-8"}, "image": null, "domain": "www.coasttocoastam.com", "title": "Individual Rights / Anxiety in the Pandemic Era", "cleaned_text": "Constitutional lawyer specializing in food and drug law, Jonathan Emord is the only attorney in history that has defeated the Food and Drug Administration in federal court. In the first half, he discussed the state of individual rights in light of orders, mandates, and restrictions placed on citizens and businesses globally. The vaccination restrictions or mandates \"are actually very counter-productive and...invade our civil liberties and treat us as if a disease is sufficient under the Constitution to suspend our rights,\" he declared. Lockdowns are taking place in China right now, which perhaps could be expected living under an authoritarian regime, but in countries such as Australia, he finds it surprising that people are readily giving up their civil liberties and following in lockstep with their government's approach to public health.\n\nEmord said that we should recognize that each patient has a different medical background, and there shouldn't be a one-size-fits-all approach to vaccinations. We should respect individual freedom of choice and the alternatives that physicians want to take in specific cases, he continued. \"Instead, there's this mass movement of censorship of treatments in order to maximize vaccinations,\" he stated. He argued that the best solution to the pandemic is treatment as needed, adding that \"vaccine fatigue\" will increasingly set in, and the percentage of the US population getting shots will decrease. Through fear-mongering, the US government has seized control and is taking advantage of the situation in a kind of power grab, Emord further commented.\n\nAuthor, researcher, and psychotherapist Dr. Laurie Nadel has been on the front lines of mental health after 9/11, Hurricane Sandy, the Parkland school shooting, and the current pandemic. In the latter half, she discussed her therapeutic strategies for helping people deal with acute stress and anxiety during the COVID era. Based in New York City, she's seen a large spike in people experiencing anxiety since the pandemic began in 2020. Nadel has referred to the pandemic as a \"disaster of uncertainty,\" as we don't long how long it will last or if more new variants are headed our way. For some, the long-term anxiety resembles PTSD, she indicated, and even after the pandemic has subsided, the psychological effects may linger for generations to come.\n\nTo counteract the stress, she recommends a daily five-minute exercise, in which you close your eyes and go back to a place and time where you felt calm and relaxed. Fully inhabit this place, she said, as when you do this, \"you're activating and accessing the molecules of emotion that are actually healing, relaxing, and grounding,\" and can help to reset your nervous system. For the past two years, she has been leading an online support program for \"long haulers\" —a percentage of COVID patients who develop severe neurological and cardiac conditions after surviving the acute respiratory infection stage. She also touched on the importance of intuition or a sixth sense that arrives like a signal to a satellite dish to warn or prepare us, sometimes in the form of a dream.", "opengraph": {"locale": "en_us", "title": "Individual Rights / Anxiety in the Pandemic Era | Coast to Coast AM", "description": "Constitutional lawyer Jonathan Emord discussed the state of individual rights in light of vaccination mandates and restrictions. Followed by psychotherapist Dr. Laurie Nadel on dealing with pandemic-era stress.", "url": "https://www.coasttocoastam.com/content/2022-01-17-show/", "image": "https://i.iheart.com/v3/re/new_assets/61e11b8a436a734a40d98d45?ops=gravity(%22north%22),fit(1200,675),quality(65)", "image:width": "1200", "image:height": "675", "type": "article", "site_name": "Coast to Coast AM"}, "tags": [], "tweets": [], "movies": [], "links": ["https://emord.com/", "http://www.laurienadel.com/", "https://pulmonarywellness.org/covid-bootcamp/", "https://www.vortex.com", "https://theskylive.com"], "authors": [], "publish_date": "January 18, 2022"}