{"result_id": "074020", "URL": "https://www.coasttocoastam.com/show/2020-07-13-show/", "timestamp": "2023-04-25 14:46:21 CEST+0200", "meta": {"description": "Dr. Andrew Wakefield discussed the dangers of vaccinations and concerns over a COVID-19 vaccine. Followed by Robert Stanley on fallen angels.", "lang": "en", "keywords": "vaccines, angels", "favicon": "https://i.iheart.com/v3/re/assets.coast2coast/5d4dc9096ea20854764b2ce8?ops=gravity(%22center%22),contain(32,32),quality(65)", "canonical": "https://www.coasttocoastam.com/show/2020-07-13-show/", "encoding": "UTF-8"}, "image": null, "domain": "www.coasttocoastam.com", "title": "Vaccine Controversies / Fallen Angels", "cleaned_text": "Author of one of the most controversial clinical papers in modern medical history, Dr. Andrew Wakefield linked autism to vaccines, and then experienced a tremendous fallout to his career. In the first half, he discussed his new film, 1986: The Act, which examines the 1986 National Childhood Vaccine Injury Act that spared vaccine manufacturers from product liability and what that means for a potential COVID-19 vaccine. The CDC and pharmaceutical companies covered up findings that mercury-containing vaccines had an association with neurological damage in children, he cited. Children were getting more and more mercury-containing vaccines, he continued. Finally, it was made clear they were getting way in excess of the EPA's guidelines for even adult levels, so the mercury was slowly phased out. Because the pharmaceutical companies had no liability for vaccine damages, they became so wealthy from sales, \"they could buy the politicians...buy the media, and ...buy the doctors,\" Wakefield remarked.\n\nOne of the problems with children's vaccinations, he argued, is that they are administered at too early an age, which is when adverse reactions are more likely. Wakefield expressed concern that medical exclusion from childhood vaccines is becoming so rarefied and difficult to receive that they are essentially becoming mandatory in most US states. Regarding the possible COVID vaccine, he suggested that people like Bill Gates and Dr. Anthony Fauci might push to make it mandatory, and they are disregarding alternative treatments like hydroxychloroquine, zinc, and Vitamin C. Because the vaccine is being rushed forward, he believes safety studies will be circumvented. People need to have as much information as possible in making their choice about taking such a vaccine, he added.\n\nThe editor of UNICUS magazine, Robert Stanley, has passionately researched UFOs for over 30 years. More recently, he has delved into the topic of angels, their interactions with humans, and their supernatural lore. He spoke about the fallen angels, such as Samael, written about in ancient Jewish texts. Samael, who could be thought of as Lucifer, was said to tempt Adam and Eve in the garden of Eden, and father a child with Eve, he recounted. Some accounts tell of savage acts of cannibalism that one might view as the root of evil, Stanley continued. Samael was also said to wed Lilith, who in demon-form bore children with Adam.\n\nAside from the dark, fallen angels there are divine beings of light, and guardian angels who can assist humanity in their struggles, he stated. According to polls, nearly 8 out of 10 Americans believe in angels. Some of the entities associated with UFOs could be considered angels, he said, and allegedly there are covert elements within the US government that are working with fallen angels. Some researchers contend that occult practitioners like Aleister Crowley and Jack Parsons opened portals for these dark angels to enter our world. For more, check out Stanley's archive of material on fallen angels.", "opengraph": {"locale": "en_us", "title": "Vaccine Controversies / Fallen Angels | Coast to Coast AM", "description": "Dr. Andrew Wakefield discussed the dangers of vaccinations and concerns over a COVID-19 vaccine. Followed by Robert Stanley on fallen angels.", "url": "https://www.coasttocoastam.com/show/2020-07-13-show/", "image": "https://i.iheart.com/v3/re/new_assets/5f0808a8946e653e83586764?ops=gravity(%22north%22),fit(1200,675),quality(65)", "image:width": "1200", "image:height": "675", "type": "article", "site_name": "Coast to Coast AM"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.coasttocoastam.com/guest/wakefield-andrew-45843/", "https://1986theact.com/", "http://www.unicusmagazine.com/", "https://www.cbsnews.com/news/poll-nearly-8-in-10-americans-believe-in-angels/", "https://www.unicusmagazine.com/FALLEN_ANGEL_ARCHIVE.htm", "https://www.thetruthaboutrogerstone.com", "https://www.vortex.com", "http://drsky.com"], "authors": [], "publish_date": "July 13, 2020"}