{"result_id": "074025", "URL": "https://www.coasttocoastam.com/show/2003-01-20-show/", "timestamp": "2023-04-25 14:46:27 CEST+0200", "meta": {"description": "\"What we're looking at is a biological weapon,\" said Joyce Riley about Gulf War Illness (GWI) in her appearance on Monday night's show. She believes GWI is a communicable disease, with not only spouses and children in families of veterans coming down with symptoms, but their pets as well.", "lang": "en", "keywords": "coast to coast am, radio, ufos, creatures, extraterrestrial, supernatural, myths, legends, monsters, space, universe, science, mystery, sci-fi, george noory, ian punnett, george knapp, art bell, somewhere in time", "favicon": "https://i.iheart.com/v3/re/assets.coast2coast/5d4dc9096ea20854764b2ce8?ops=gravity(%22center%22),contain(32,32),quality(65)", "canonical": "https://coast-pr.radio.iheart.com/show/2003-01-20-show/", "encoding": "UTF-8"}, "image": null, "domain": "www.coasttocoastam.com", "title": "A Gulf of Illness", "cleaned_text": "\"What we're looking at is a biological weapon,\" said Joyce Riley about Gulf War Illness (GWI) in her appearance on Monday night's show. She believes GWI is a communicable disease, with not only spouses and children in families of veterans coming down with symptoms, but their pets as well. Riley, an impassioned speaker, is a nurse who served as a captain in the Gulf War. \"We're looking at an astronomical figure,\" Riley said estimating that as many as 400,000 veterans have some symptoms of GWI. \n\n \n\n Whether it was our government that was experimenting on the troops with vaccines, or exposure in the Gulf to depleted uranium or biological/chemical weapons, Riley feels \"that what is going on in our military is an abomination,\" because they have not taken responsibility for this devastating illness. \"It is treason to abandon them,\" she exclaimed. Typical symptoms include joint pains, slurred speech, weakness and rashes, but in some cases brain damage and death have also occurred. Riley discussed how a number of Gulf War vets are on death row or in prison, having become violent upon their return, which she suspects may be due to chemical exposure from the war. \n\n \n\nRiley, also warned that the military may be trying to develop \"super soldiers.\" \"DARPA would like to have a very aggressive military...with a goal of having soldiers that do not need to eat or sleep for up to 5-7 days,\" she said. Synthetic adrenaline and implanted biochips were two areas she said they were experimenting with.\n\nJoyce Riley has called attention to the dangers of vaccines. In an article posted on her website, Vexing over Vaccines, Dr. Alan Cantwell Jr. points to a number of alarming issues surrounding their usage. He also details information about the production of vaccines that many people may not be aware of. For instance, in order to develop vaccines, the strains are often grown on animal parts like monkey kidneys and chicken embryos or human cell lines derived from cancer cells. This can potentially lead to contamination and/or the introduction of animal viruses into the human population. \n\n \n\n In fact many believe that the AIDS virus may have been brought into the gay community by an experimental hepatitis B vaccine that was widely targeted to men in that group in Los Angeles, San Francisco and New York from 1978-1981. It has also been posited that HIV in Africa originated from a polio vaccine that was contaminated with chimp and monkey viruses. \n\n \n\n While the debate over the cause of Gulf War Syndrome goes on, researchers Dr. Garth Nicolson and Nancy Nicolson have suggested a bacterial microbe or mycoplasma may be to blame. Some suspect the microbe may have entered soldier's systems via an experimental Anthrax vaccine. Disturbingly, the Nicolson's research showed that HIV was attached to this mycoplasma. \"This microbe could never have occurred naturally. On the contrary, the composition of the microbe suggests a man-made and genetically-engineered biological warfare agent,\" writes Cantwell in his article.", "opengraph": {"locale": "en_us", "title": "A Gulf of Illness | Coast to Coast AM", "description": "\"What we're looking at is a biological weapon,\" said Joyce Riley about Gulf War Illness (GWI) in her appearance on Monday night's show. She believes GWI is a communicable disease, with not only spouses and children in families of veterans coming down with symptoms, but their pets as well.", "url": "https://www.coasttocoastam.com/show/2003-01-20-show/", "image": "https://i.iheart.com/v3/re/assets.coast2coast/de8aede4-644a-4e40-8fd0-5c213988571e?ops=gravity(%22north%22),fit(1200,675),quality(65)", "image:width": "1200", "image:height": "675", "type": "article", "site_name": "Coast to Coast AM"}, "tags": [], "tweets": [], "movies": [], "links": ["http://gulfwarvets.com/", "http://www.gulfwarvets.com/vexing.htm"], "authors": ["Coast to Coast AM Staff"], "publish_date": "January 20, 2003"}