{"result_id": "074009", "URL": "https://www.coasttocoastam.com/show/2020-09-07-show/", "timestamp": "2023-04-25 14:46:09 CEST+0200", "meta": {"description": "Producer and host Del Bigtree spoke about vaccine safety concerns and COVID-19. Followed by Prof. Joseph P. Laycock on his cross-cultural study of exorcism.", "lang": "en", "keywords": "vaccines, exorcism", "favicon": "https://i.iheart.com/v3/re/assets.coast2coast/5d4dc9096ea20854764b2ce8?ops=gravity(%22center%22),contain(32,32),quality(65)", "canonical": "https://www.coasttocoastam.com/show/2020-09-07-show/", "encoding": "UTF-8"}, "image": null, "domain": "www.coasttocoastam.com", "title": "Vaccine Risks & COVID-19 / Exorcisms Across Cultures", "cleaned_text": "Former producer on the daytime talk show The Doctors, Del Bigtree, is the founder of the Informed Consent Action Network (ICAN), and his investigations into drug and vaccine fraud resulted in winning lawsuits against US government agencies. In the first half, he talked about how over the last four years, he has focused on vaccines' safety and found that there is much to be concerned about. Regarding vaccines, the CDC \"has covered up damage and injury to innocent American children,\" he contended. This is complicated by the government taking away all liability from the vaccine manufacturers. Further, the government can't conduct the proper safety studies because they don't want to be sued, he noted.\n\nThrough ICAN, Bigtree pushed for a saline placebo to be added to the Phase III trials for the COVID vaccine. Shortly after, companies such as Moderna announced they would be adding such a placebo to their trials. \"People call me anti-vaccine,\" he said, \"but the truth is millions of people are using these products. At the very least, I want the safest product for those that want to use them.\" He added that he is staunchly against mandatory vaccinations and that we should always have a choice. Bigtree warned about the yearly flu shots, claiming that a military study showed that those who received the injection had a much higher chance of contracting coronavirus. He is an advocate for the concept of herd immunity, and believes that aside from protecting the elderly and vulnerable, society is just delaying the inevitable with the lockdowns and closures.\n\nIn the latter half, Assistant Professor of Religious Studies at Texas State University, Joseph P. Laycock, discussed beliefs and practices surrounding exorcism from across cultures and religions, including information from scientific papers, letters by clergy, and treatises by physicians and theologians. In the Catholic tradition, demons often go after very holy people, he explained. In contrast, among evangelical groups a person may become susceptible to demons after dabbling with a Ouija board or the occult. Some people, he continued, have no memory of their exorcism and parts of their possession, while others have vivid recall, including a woman who wrote a letter to her exorcist in the voice of the demon that inhabited her.\n\nThe number of exorcisms around the world seems to be on the rise, he reported, and the day before Easter Sunday 2020, Carlo Maria Vigano, an Italian archbishop of the Catholic Church called on his fellow clergy to perform a \"mass exorcism\" on Holy Saturday, in order to quell Satan's \"frenzy\" during the coronavirus pandemic. For the Catholic Church to approve an exorcism on an individual, they look for specific signs of possession, including speaking in a language unknown to the person, a type of clairvoyance or knowing things they couldn't possibly know, superhuman strength, and blasphemous rage. Some exorcism attempts can go on for years, Laycock detailed, such as a 1928 case in Iowa. He recounted the fascinating alleged possession of an entire convent of Ursuline nuns in the French town of Loudun in 1634. The nuns were said to vomit up nails, and even a contract signed by demons with an accused priest (who was eventually burned at the stake for witchcraft).", "opengraph": {"locale": "en_us", "title": "Vaccine Risks & COVID-19 / Exorcisms Across Cultures | Coast to Coast AM", "description": "Producer and host Del Bigtree spoke about vaccine safety concerns and COVID-19. Followed by Prof. Joseph P. Laycock on his cross-cultural study of exorcism.", "url": "https://www.coasttocoastam.com/show/2020-09-07-show/", "image": "https://i.iheart.com/v3/re/new_assets/5f51db696867df2b45f1926d?ops=gravity(%22north%22),fit(1200,675),quality(65)", "image:width": "1200", "image:height": "675", "type": "article", "site_name": "Coast to Coast AM"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.icandecide.org/", "https://sites.google.com/site/joelaycock/", "https://www.vortex.com", "http://drsky.com"], "authors": [], "publish_date": "September 7, 2020"}