{"result_id": "074015", "URL": "https://www.coasttocoastam.com/show/2019-03-13-show/", "timestamp": "2023-04-25 14:46:16 CEST+0200", "meta": {"description": "Kent Heckenlively spoke about his concern over the safety of vaccinations. Followed by Dr. Lynne Kitei recalling the Phoenix Lights sighting of 1997.", "lang": "en", "keywords": "coast to coast am, radio, ufos, creatures, extraterrestrial, supernatural, myths, legends, monsters, space, universe, science, mystery, sci-fi, george noory, ian punnett, george knapp, art bell, somewhere in time", "favicon": "https://i.iheart.com/v3/re/assets.coast2coast/5d4dc9096ea20854764b2ce8?ops=gravity(%22center%22),contain(32,32),quality(65)", "canonical": "https://coast-pr.radio.iheart.com/show/2019-03-13-show/", "encoding": "UTF-8"}, "image": null, "domain": "www.coasttocoastam.com", "title": "Vaccine Opposition / The Phoenix Lights", "cleaned_text": "Kent Heckenlively is a science teacher, an attorney, and a founding editor of Age of Autism. In the first half, he spoke about his opposition to the way vaccines are forced upon children. As Robert F. Kennedy Jr. has noted, the US government has admitted to never testing or measuring the safety of the childhood vaccine schedule as was mandated by a 1986 law, which took vaccine injuries out of the civil court system. \"Until safety can be established as required by this law,\" Heckenlively stated, \"we think that they need to call a pause in childhood vaccinations until we can assure their safety.\" It's not just the aluminum, mercury, and other additives in the vaccines, but re-combined animal viruses that may have unintended consequences, he warned.\n\nIf parents do decide to vaccinate their children, Heckenlively suggests waiting until the child is a little older so that their immune system is more developed rather than when they're an infant. Countering the \"truth movement,\" government and mainstream media continue to keep people in the dark and uninformed on this topic, he asserted, as well as big tech companies like Facebook which have in recent times \"de-platformed\" anti-vaccine content. Autism is one of the most serious chronic conditions that can arise from vaccines, he argued, but seizures, allergies, and anxiety disorders may also occur.\n\nOn this, the 22nd anniversary, physician and health educator, Dr. Lynne Kitei, discussed one of the most witnessed, documented and important mass anomalous aerial events in modern history, known as the \"Phoenix Lights.\" In the latter half, she shared her experience as a key witness and her research that including taking photographs of similar UFOs two months before the widespread sighting. On the night of March 13, 1997, a variety of craft were seen over a 12-hour period in Arizona and Nevada, including a large triangular shape (that in some cases seemed to black out the view of stars).\n\nPeople saw a massive object some \"eight miles wide,\" she reported, \"that was actually gliding over people's heads at rooftop level.\" Some said it was totally silent as it took off, and \"other people saw these orbs detach from the main object, go out into the environment, and re-dock with it later.\" It wasn't until months after the March event that the national media picked up the story (though the night of the sighting witnesses called into Art Bell's program). Arizona Gov. Fife Symington initially made fun of the story, though he later conceded that he, too, had seen and been baffled by the strange lights. Other well-known figures who reported seeing the lights include Kurt Russell, who was piloting a plane at the time.", "opengraph": {"locale": "en_us", "title": "Vaccine Opposition / The Phoenix Lights | Coast to Coast AM", "description": "Kent Heckenlively spoke about his concern over the safety of vaccinations. Followed by Dr. Lynne Kitei recalling the Phoenix Lights sighting of 1997.", "url": "https://www.coasttocoastam.com/show/2019-03-13-show/", "image": "https://i.iheart.com/v3/re/assets.coast2coast/c6e9d8dba82d6983182a55bb076b72ed?ops=gravity(%22north%22),fit(1200,675),quality(65)", "image:width": "1200", "image:height": "675", "type": "article", "site_name": "Coast to Coast AM"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.plaguethebook.com/", "https://www.thephoenixlights.net/", "https://www.thephoenixlights.net/Photos.htm", "https://www.indiewire.com/2017/06/kurt-russell-phoenix-lights-ufo-1201842807/", "http://www.standeyo.com", "https://breggin.com", "https://www.vortex.com"], "authors": ["Coast to Coast AM Staff"], "publish_date": "March 13, 2019"}