{"result_id": "074040", "URL": "https://www.coasttocoastam.com/show/2022-03-28-show/", "timestamp": "2023-04-25 14:46:46 CEST+0200", "meta": {"description": "Journalist Nick Corbishley discussed tech-enabled digital IDs and vaccine passports and the erosion of freedom. Followed by emotional clearing expert Jeffrey Seelman on the increase in negative and demonic spirits.", "lang": "en", "keywords": "digital ID, privacy, demons, negative spirits, psychic clearing, Vaccine Passports", "favicon": "https://i.iheart.com/v3/re/assets.coast2coast/5d4dc9096ea20854764b2ce8?ops=gravity(%22center%22),contain(32,32),quality(65)", "canonical": "https://www.coasttocoastam.com/show/2022-03-28-show/", "encoding": "UTF-8"}, "image": null, "domain": "www.coasttocoastam.com", "title": "Vaccine Passports / Negative Spirits", "cleaned_text": "In the first half, journalist, teacher, and translator based in Barcelona, Nick Corbishley, discussed the implications of tech-enabled digital IDs and vaccine passports and how basic freedoms and privacy are being handed over to the state and private companies without our knowledge or consent. Vaccine passports are a form of digital ID that shows whether someone has had COVID vaccinations or a recent infection or test, and have been required for many overseas flights, and entering certain countries and destinations. Corbishley is opposed to the vaccine passport as well as mandates for a variety of reasons. \"They represent a very serious infringement on our bodily autonomy and our right to choose,\" he stated, and once we give away these rights, they could be lost forever.\n\nThe World Health Organization (WHO) is considering embracing vaccine passports on a global level, and this could become a permanent aspect of international travel, he lamented. WHO is also in the process of creating a new global pandemic treaty, which would give them power to sanction countries that didn't enforce the vaccine passport system, he reported. \"It would mean if you are not up to date on your vaccines, you would not be able to travel,\" Corbishley pointed out. \"We are at a tipping point,\" he stressed, in the midst of \"a brief period of time where people can perhaps push back against these developments from happening.\"\n\nIn the latter half, emotional clearing expert, practicing exorcist, and psychic Jeffrey Seelman shared his contention that there is an increase in negative and demonic spirits. He outlined how they manifest destructive forces, take residence in dwellings, and shared tips on combating them. He noted that spirits can take two forms-- former humans who have passed on, and ancient demonic types that were never human. The demonic types are more powerful but also rarer than the deceased spirits. He explained that some of the spirits who have passed over to heaven or the Other Side may continue the negativity and unhappiness they had while alive. In our world, \"there is a percentage of violence...that is being perpetuated and amplified\" by such spirits, he added.\n\nSeelman suggested that we are particularly susceptible to attacks when we're in the dream or sleep state and that the condition of sleep paralysis can be a sort of gateway for negative spirits to come through. Negative spirits don't have enough energy to kill a person, he said, but rather they seek to inflict emotional damage through their rage and anger, which sometimes becomes intertwined with our own feelings so that we think it's just us. The spirits use visualization techniques and non-physical energy to appear as any form they like, he revealed. And so, to protect oneself from them, he advocates fighting fire with fire-- visualizing a field around oneself-- a mirror-like shield that circles the body and can bounce back negative energy.", "opengraph": {"locale": "en_us", "title": "Vaccine Passports / Negative Spirits | Coast to Coast AM", "description": "Journalist Nick Corbishley discussed tech-enabled digital IDs and vaccine passports and the erosion of freedom. Followed by emotional clearing expert Jeffrey Seelman on the increase in negative and demonic spirits.", "url": "https://www.coasttocoastam.com/show/2022-03-28-show/", "image": "https://i.iheart.com/v3/re/new_assets/623d540968a1a69258c5f00d?ops=gravity(%22north%22),fit(1200,675),quality(65)", "image:width": "1200", "image:height": "675", "type": "article", "site_name": "Coast to Coast AM"}, "tags": [], "tweets": [], "movies": [], "links": ["https://nickcorbishley.com/", "http://www.starclear.com/", "https://www.vortex.com", "https://theskylive.com"], "authors": [], "publish_date": "March 28, 2022"}