{"result_id": "074037", "URL": "https://www.coasttocoastam.com/show/2021-12-01-show/", "timestamp": "2023-04-25 14:46:42 CEST+0200", "meta": {"description": "Producer Del Bigtree discussed issues surrounding the COVID vaccines and their safety. Followed by researcher Michael Tellinger on mysterious stone circles and relics from South Africa.", "lang": "en", "keywords": "vaccinations, ancient civilizations, ancient discoveries", "favicon": "https://i.iheart.com/v3/re/assets.coast2coast/5d4dc9096ea20854764b2ce8?ops=gravity(%22center%22),contain(32,32),quality(65)", "canonical": "https://www.coasttocoastam.com/show/2021-12-01-show/", "encoding": "UTF-8"}, "image": null, "domain": "www.coasttocoastam.com", "title": "Vaccination Issues / Africa's Stone Circles", "cleaned_text": "In the first half, producer on the daytime talk show The Doctors, and host of the HighWire, Del Bigtree, discussed issues surrounding the COVID vaccines and their safety. Large parts of Africa have been less affected by the pandemic while highly vaccinated countries are suffering multiple waves of infection, he pointed out. In these parts of Africa, he suggested that people are building herd immunity and taking treatments like ivermectin and hydroxychloroquine to fend off COVID. Bigtree was critical of the push for COVID vaccines because they fail to stop infections and their long-term effects are unknown. \"The vaccine appears to be blocking our ability to reach herd immunity,\" he remarked, adding that the Belgian virologist Geert Vanden Bossche has warned that mass vaccinations are creating more dangerous variants.\n\n\"We're seeing mutations in this virus at a speed that is almost unprecedented under this unnatural vaccine pressure,\" and Vanden Bossche \"believes we are within a year of creating a vaccine-resistant pathogen that may be unstoppable,\" Bigtree cautioned. He reported on an abstract published in the Circulation Journal, which indicated that the vaccine might lead to increased inflammatory cells in the cardiac region (though experts have raised concerns about this study). Bigtree associated the mandates and push for vaccines as part of a larger control and tracking agenda by governments that seek to encroach upon our freedoms.\n\nIn the latter half, researcher Michael Tellinger talked about his ongoing study of ancient artifacts, including South Africa's stone circles and Adam's Calendar, as well as new finds related to ancient advanced technology. He continues to discover curious objects in South Africa that he believes are the fossils of enormous giants, creatures, and Reptilians, and which he features in his Museum (now containing some 1,000 artifacts). He has calculated that there are more than ten million stone ruin circles in South Africa and Zimbabwe, and he contends they are relics of advanced ancient technology, perhaps some 300,000 years old. The stones weren't dwellings but rather energy-generating devices that created electromagnetic fields, he said, adding that they demonstrated \"very advanced knowledge of the use of sound resonance and frequency.\"\n\nThis all points to the presence and work of the Anunnaki (a group of deities or ETs first documented by the Sumerians), and specifically the god known as Enki and his gold mining efforts in southern Africa, he continued. Tellinger spoke about his study of various relics, including cone-shaped tools and related torus stones (which have the shape of a donut). The energy that flowed into the torus stones was in the form of a cone, and such toroidal fields far predate the work of Tesla and his similar free energy devices, he commented. Tellinger also described Adam's Calendar-- the unique stone ring sometimes called Africa's Stonehenge, which may be the oldest man-made structure in the world.", "opengraph": {"locale": "en_us", "title": "Vaccination Issues / Africa's Stone Circles | Coast to Coast AM", "description": "Producer Del Bigtree discussed issues surrounding the COVID vaccines and their safety. Followed by researcher Michael Tellinger on mysterious stone circles and relics from South Africa.", "url": "https://www.coasttocoastam.com/show/2021-12-01-show/", "image": "https://i.iheart.com/v3/re/new_assets/619f46b4e8d75ddd97aa6081?ops=gravity(%22north%22),fit(1200,675),quality(65)", "image:width": "1200", "image:height": "675", "type": "article", "site_name": "Coast to Coast AM"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.icandecide.org/", "https://apnews.com/article/coronavirus-pandemic-science-health-pandemics-united-nations-fcf28a83c9352a67e50aa2172eb01a2f", "https://www.ahajournals.org/doi/10.1161/circ.144.suppl_1.10712", "https://www.reuters.com/article/factcheck-coronavirus-vaccines/fact-check-research-abstract-is-not-reliable-evidence-of-a-link-between-mrna-vaccines-and-heart-disease-idUSL1N2SH1HN", "http://www.michaeltellinger.com/", "https://michaeltellinger.com/category/museum/", "http://www.howardbloom.net", "https://mishtalk.com"], "authors": [], "publish_date": "December 1, 2021"}