{"result_id": "074007", "URL": "https://www.coasttocoastam.com/show/2022-12-21-show/", "timestamp": "2023-04-25 14:46:07 CEST+0200", "meta": {"description": "Edward Dowd of Phinance Technologies discussed the increase in deaths not attributed to COVID among people 18–64 during late 2021. Followed by professional psychic John Russell on supernatural stories of the holiday season.", "lang": "en", "keywords": "sudden deaths, COVID vaccine, supernatural", "favicon": "https://i.iheart.com/v3/re/assets.coast2coast/5d4dc9096ea20854764b2ce8?ops=gravity(%22center%22),contain(32,32),quality(65)", "canonical": "https://www.coasttocoastam.com/show/2022-12-21-show/", "encoding": "UTF-8"}, "image": null, "domain": "www.coasttocoastam.com", "title": "Sudden Deaths / Paranormal Yuletide", "cleaned_text": "In the first half, Edward Dowd of Phinance Technologies discussed the increase in deaths not attributed to COVID among people 18–64 during late 2021. According to Dowd, the official reasons for this increase—which he estimates at 40% higher than pre-pandemic—is that causes of death like suicide and drug overdoses, as well as a decline in preventative health care like cancer screenings, can account for the higher mortality rate. Dowd is skeptical of these explanations, and of other causes attributed to the rise in mortality like \"long COVID,\" he explained.\n\nWhat he finds more credible, he continued, is that the spike in deaths is linked to the introduction of the COVID vaccine, and the mandates that went with it. Citing a mortality rate of 58% for people who were vaccinated, Dowd expressed skepticism that the vaccine was effective at all. Developing and researching the vaccine was rushed, with little known about its potential danger, he added. Even the term \"vaccine\" itself is problematic, because unlike the vaccines in use for polio, which attempted to provide immunization against the virus, this \"COVID therapeutic\" merely caused an immune response, Dowd added.\n\nMore concerning, he claimed, is that official COVID-related data is intentionally obscured, unavailable, or simply inaccurate. This adds up to nothing less than a cover-up, Dowd alleged.\n\nProfessional psychic John Russell was the guest in the second half, sharing a number of supernatural stories that took place around the Christmas holidays. Such events are not necessarily unusual in their timing, Russell argued, because the holidays tend to see a collective focus on the spiritual and the supernatural realms, which increases the energies and vibrations—as well as our awareness of them—causing their manifestations.\n\nRussell's own experiences with holiday strangeness include one from his childhood, in which a closet door in his home mysteriously closed itself repeatedly around Christmastime. Later in his life, Russell lived in a home that was discovered to harbor a massive gas leak; the plumber who responded to his call told him that it was a \"Christmas miracle\" that the entire house hadn't been blown to bits, he recalled. In yet another Christmastime incident at Walmart, he claimed, the ball of a trailer hitch inexplicably slid across a shelf, surprising Russell and his daughter.", "opengraph": {"locale": "en_us", "title": "Sudden Deaths / Paranormal Yuletide  | Coast to Coast AM", "description": "Edward Dowd of Phinance Technologies discussed the increase in deaths not attributed to COVID among people 18–64 during late 2021. Followed by professional psychic John Russell on supernatural stories of the holiday season.", "url": "https://www.coasttocoastam.com/show/2022-12-21-show/", "image": "https://i.iheart.com/v3/re/new_assets/639bce449cfab118e55c3123?ops=gravity(%22north%22),fit(1200,675),quality(65)", "image:width": "1200", "image:height": "675", "type": "article", "site_name": "Coast to Coast AM"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.theyliedpeopledied.com/", "http://www.johnrussell.net/", "http://mishtalk.com", "http://howardbloom.net"], "authors": [], "publish_date": "December 21, 2022"}