{"result_id": "074034", "URL": "https://www.coasttocoastam.com/show/2021-12-21-show/", "timestamp": "2023-04-25 14:46:38 CEST+0200", "meta": {"description": "Pharmacist Ben Fuchs discussed natural remedies, nutrients, and more for maintaining good health. Followed by author Charles Upton on the government's use of UFO disinformation to advance a social engineering agenda.", "lang": "en", "keywords": "alternative health, metaphysics, aliens, UFOs", "favicon": "https://i.iheart.com/v3/re/assets.coast2coast/5d4dc9096ea20854764b2ce8?ops=gravity(%22center%22),contain(32,32),quality(65)", "canonical": "https://www.coasttocoastam.com/show/2021-12-21-show/", "encoding": "UTF-8"}, "image": null, "domain": "www.coasttocoastam.com", "title": "Alternative Health / UFOs & Social Engineering", "cleaned_text": "In the first half, pharmacist Ben Fuchs talked about natural health remedies and the vitamins, nutrients, and minerals that our bodies need to maintain good health. He believes the year 2021 will be remembered as a time when people \"began to wake up\" about the power of the immune system, becoming more conscious about their health and being skeptical of the mainstream medical community. Specifically, Fuchs questioned COVID vaccine requirements, asking \"Why are we mandating pharmacological interventions?\" He also discussed the health benefits of foods like eggs, pomegranates, and the water found inside vegetables.\n\nListeners had a number of health-related questions for Fuchs. In response to a caller in Mississippi asking about the therapeutic use of the psychedelic drug DMT, Fuchs called it \"absolutely fascinating\" and described its effects on the brain and the value of psychedelics in current mental health research. To a California listener wondering about the role of the glycemic index (GI), he said, \"If you want to do one thing to improve your health, take care of your blood sugar.\" He went on to recommend following high-GI food with plenty of water and exercise, in order to move sugar out of the bloodstream and into the muscles. And a caller in Massachusetts reported that, after following Fuchs' advice, his blood pressure had dropped 50 points. Fuchs encouraged him in his efforts, adding that niacin, magnesium, and deep breathing are also ways to treat high blood pressure.\n\nIn the latter half, author and counterculture veteran Charles Upton shared his theory of the government's use of UFO claims to advance a dangerous social engineering agenda. Although he conceded that alien life exists—he's had his own UFO encounter, he related—Upton claims that powerful figures in the intelligence and corporate communities have clouded the conversation about paranormal phenomena in order to attack critical thinking and dissent, and to distract the public from their more objectionable activities. Upton first became aware of this situation through the movie Close Encounters of the Third Kind, he recalled, which led him to wonder whether \"maybe [Steven] Spielberg is in the loop of this social engineering program.\" As evidence for his arguments, he mentioned a number of fraudulent UFO claims by government officials, as well as his contention that the recent government investigations into UAP have not been forthcoming about what they've discovered.\n\nBut the goals of the government's UFO disinformation campaign go beyond the political and social realms, according to Upton; the destruction of religion is one of its central objectives. One of the tactics employed is to turn religions against each other, and another is to lend credibility to the notion that alien beings, rather than God, had some role in human creation and spirituality. For its part, organized religion has been ineffective in combatting this attack because of its own complacency and fear of the truth, he continued. Regardless, Upton concluded, God's plan for humankind will ultimately not be thwarted by perpetrators of the UFO deception.", "opengraph": {"locale": "en_us", "title": "Alternative Health / UFOs & Social Engineering | Coast to Coast AM", "description": "Pharmacist Ben Fuchs discussed natural remedies, nutrients, and more for maintaining good health. Followed by author Charles Upton on the government's use of UFO disinformation to advance a social engineering agenda.", "url": "https://www.coasttocoastam.com/show/2021-12-21-show/", "image": "https://i.iheart.com/v3/re/new_assets/61bc346084b7fffe6dbb6207?ops=gravity(%22north%22),fit(1200,675),quality(65)", "image:width": "1200", "image:height": "675", "type": "article", "site_name": "Coast to Coast AM"}, "tags": [], "tweets": [], "movies": [], "links": ["https://criticalhealthnews.com/", "http://www.sophiaperennis.com/", "http://onlinecolumnist.com", "http://foodsafetycoach.com"], "authors": [], "publish_date": "December 21, 2021"}