{"result_id": "074043", "URL": "https://www.coasttocoastam.com/show/2023-02-10-show/", "timestamp": "2023-04-25 14:46:50 CEST+0200", "meta": {"description": "Podcaster and award-winning former Seinfeld writer Andy Cowan gave his humorous take on neuroticism, and discussed  his new comedy/therapy podcast, The Neurotic Vaccine. Open Lines followed in the later half of the program.", "lang": "en", "keywords": "neuroticism, humor", "favicon": "https://i.iheart.com/v3/re/assets.coast2coast/5d4dc9096ea20854764b2ce8?ops=gravity(%22center%22),contain(32,32),quality(65)", "canonical": "https://www.coasttocoastam.com/show/2023-02-10-show/", "encoding": "UTF-8"}, "image": null, "domain": "www.coasttocoastam.com", "title": "Humor & Neuroticism / Open Lines", "cleaned_text": "Podcaster and award-winning former Seinfeld writer Andy Cowan joined host George Noory to give his humorous take on neuroticism. Cowan discussed his new comedy/therapy podcast, The Neurotic Vaccine, which features comedic skits and celebrity interviews, as well as his mini-therapy sessions with clinical and forensic psychologist, Dr. Scott Kopoian. Cowan described his podcast as the most creative and empowering thing he's ever done. \"Listeners can vicariously sit in for free and have therapy with me without having to spill their guts... and they also get very honest insights of life,\" he said, noting the podcast covers topics including the insanity of dating, growing older, co-existing with a culture that has moved on, how your family drives you nuts, and over-sharers on Facebook.\n\nA neurosis is an irrational anxiety or obsession, and Cowan admitted he has a neurotic fixation with pocket dialing. Cowan was recently pocket dialed by a friend who he revealed pocket dials him more than he actually calls him. Instead of hanging up, Cowan listened in to the conversation between his friend and another person. \"I take it personally and that means I'm neurotic,\" he confessed. George told Cowan he has an obsession with burned-out light bulbs. Cowan explained he started doing comedy with the goal to communicate his own problems in way that was unique and could connect with an audience of people who may have similar issues. Cowan also played clips from his podcast, with one featuring Shark Tank's Kevin O'Leary being pitched crazy business propositions, such as a device that makes it sound like you've dropped various amounts of coins in a tip jar.\n\nOpen Lines followed in the latter half of the program. Sherry in Kentucky phoned in to discuss human grounding, or earthing, which refers to the perceived physiological benefits of having bodily contact with the earth. \"Walking barefoot is beneficial to your health,\" she said, pointing to a football coach who made his players walk barefoot in the grass for fifteen minutes every practice. \"They had significant benefits from it,\" Sherry noted.\n\nNadia in Columbia, South Carolina, told George about a story she heard on NPR about an ancient writing system found in caves which was composed of lines and dots. The symbols had perplexed researchers for decades until an amateur archaeologist deciphered their meaning. \"They were counting days,\" Nadia said about the ancient numbering system. According to the story on NPR, the lines and dots were tracking the life cycle patterns of various animals in order to better hunt them.\n\nJames from San Diego admitted he has a neurotic obsession with website authentication. \"My neurosis is having to click on those teeny tiny boxes with signs, traffic lights, cars, or road markings when you have to authenticate yourself online,\" he disclosed. The final half-hour featured a replay from 10/20/14 with writer Judika Illes discussing her Encyclopedia of Witchcraft.", "opengraph": {"locale": "en_us", "title": "Humor & Neuroticism / Open Lines | Coast to Coast AM", "description": "Podcaster and award-winning former Seinfeld writer Andy Cowan gave his humorous take on neuroticism, and discussed  his new comedy/therapy podcast, The Neurotic Vaccine. Open Lines followed in the later half of the program.", "url": "https://www.coasttocoastam.com/show/2023-02-10-show/", "image": "https://i.iheart.com/v3/re/assets.getty/63dc71d3f43209bd8ae3d198?ops=gravity(%22north%22),fit(1200,675),quality(65)", "image:width": "1200", "image:height": "675", "type": "article", "site_name": "Coast to Coast AM"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.andycowan.net/", "https://podcasts.apple.com/us/podcast/the-neurotic-vaccine-with-andy-cowan-and-dr-scott-kopoian/id1654615518", "https://www.npr.org/2023/01/13/1149135787/amateur-archaeologist-deciphers-20-000-year-old-cave-writing", "https://www.coasttocoastam.com/show/2014-10-20-show/", "http://www.calorey.com/", "http://kevinrandle.blogspot.com/"], "authors": [], "publish_date": "February 10, 2023"}