{"result_id": "074021", "URL": "https://www.coasttocoastam.com/show/2005-03-21-show/", "timestamp": "2023-04-25 14:46:22 CEST+0200", "meta": {"description": "Alternative medicine expert Dr. Sherri Tenpenny offered an in-depth look at vaccines. After her exhaustive research through CDC documents and medical journals, she concluded that vaccines are neither safe nor effective. The whole concept of injecting antigens into a person to keep them healthy, \"causes more problems than it helps,\" she declared.", "lang": "en", "keywords": "coast to coast am, radio, ufos, creatures, extraterrestrial, supernatural, myths, legends, monsters, space, universe, science, mystery, sci-fi, george noory, ian punnett, george knapp, art bell, somewhere in time", "favicon": "https://i.iheart.com/v3/re/assets.coast2coast/5d4dc9096ea20854764b2ce8?ops=gravity(%22center%22),contain(32,32),quality(65)", "canonical": "https://www.coasttocoastam.com/www.coasttocoastam.com/show/2005-03-21-show", "encoding": "UTF-8"}, "image": null, "domain": "www.coasttocoastam.com", "title": "Vaccines & Health Problems", "cleaned_text": "Alternative medicine expert Dr. Sherri Tenpenny offered an in-depth look at vaccines. After her exhaustive research through CDC documents and medical journals, she concluded that vaccines are neither safe nor effective. The whole concept of injecting antigens into a person to keep them healthy, \"causes more problems than it helps,\" she declared. She believes that even small pox and polio vaccines weren't necessary as these diseases were waning at the time the vaccines were introduced.\n\nChildren today receive up to 95 vaccines before kindergarten (up from 33 vaccines in the 1980's) and Tenpenny correlated the increased dosages with such problems as ADHD and autism, which have skyrocketed in recent years. She has also documented connections between vaccines and such medical problems as allergy, asthma, eczema, cancer and auto-immune disorders.\n\n19 states now allow parents to avoid vaccinating their children through a \"philosophical exemption\" waiver (individual state policies are listed at vaclib.org. America's vaccination policy is based on fear and the CDC is \"an incestuous body of people who flip between the pharmaceutical industry and the Defense Department,\" she charged. For those suffering from vaccine related illnesses, Tenpenny recommended treatment with integrated medicine practitioners or referrals from the American Academy of Environmental Medicine.", "opengraph": {"locale": "en_us", "title": "Vaccines & Health Problems | Coast to Coast AM", "description": "Alternative medicine expert Dr. Sherri Tenpenny offered an in-depth look at vaccines. After her exhaustive research through CDC documents and medical journals, she concluded that vaccines are neither safe nor effective. The whole concept of injecting antigens into a person to keep them healthy, \"causes more problems than it helps,\" she declared.", "url": "https://www.coasttocoastam.com/show/2005-03-21-show/", "image": "https://i.iheart.com/v3/re/assets.getty/61b0da23a20dca9b010a6055?ops=gravity(%22north%22),fit(1200,675),quality(65)", "image:width": "1200", "image:height": "675", "type": "article", "site_name": "Coast to Coast AM"}, "tags": [], "tweets": [], "movies": [], "links": ["http://drtenpenny.com/default.aspx", "http://www.vaclib.org/", "http://www.aaem.com"], "authors": ["Coast to Coast AM Staff"], "publish_date": "March 21, 2005"}