{"result_id": "074038", "URL": "https://www.coasttocoastam.com/guest/bigtree-del-78986/", "timestamp": "2023-04-25 14:46:43 CEST+0200", "meta": {"description": "Del Bigtree is one of the preeminent voices of the Vaccine Risk Awareness Movement. His career as an Emmy winning producer of the CBS talk show, The Doctors, changed profoundly when he produced the documentary, Vaxxed: From Cover-up to Catastrophe, which is credited with igniting a revolution against pharmaceutical tyranny around the world. Now Del’s internet news show, The HighWire, is the fastest-growing program in the natural health arena with over 75 million views.", "lang": "en", "keywords": "coast to coast am, radio, ufos, creatures, extraterrestrial, supernatural, myths, legends, monsters, space, universe, science, mystery, sci-fi, george noory, ian punnett, george knapp, art bell, somewhere in time", "favicon": "https://i.iheart.com/v3/re/assets.coast2coast/5d4dc9096ea20854764b2ce8?ops=gravity(%22center%22),contain(32,32),quality(65)", "canonical": "https://www.coasttocoastam.com/www.coasttocoastam.com/guest/bigtree-del/78986", "encoding": "UTF-8"}, "image": null, "domain": "www.coasttocoastam.com", "title": "Del Bigtree", "cleaned_text": "Del Bigtree is one of the preeminent voices of the Vaccine Risk Awareness Movement. His career as an Emmy winning producer of the CBS talk show, The Doctors, changed profoundly when he produced the documentary, Vaxxed: From Cover-up to Catastrophe, which is credited with igniting a revolution against pharmaceutical tyranny around the world. Now Del’s internet news show, The HighWire, is the fastest-growing program in the natural health arena with over 75 million views.\n\nHis non-profit, the Informed Consent Action Network, or ICAN, is leading worldwide investigations into drug and vaccine fraud that have already resulted in multiple winning lawsuits against US government agencies Health and Human Services, National Institutes of Health, CDC, and FDA. But Del is probably best known for his powerful speeches that weave shocking truth, searing wit, and dynamic passion into an experience that is often described as electrifying.", "opengraph": {"locale": "en_us", "title": "Del Bigtree | Coast to Coast AM", "description": "Del Bigtree is one of the preeminent voices of the Vaccine Risk Awareness Movement. His career as an Emmy winning producer of the CBS talk show, The Doctors, changed profoundly when he produced the documentary, Vaxxed: From Cover-up to Catastrophe, which is credited with igniting a revolution against pharmaceutical tyranny around the world. Now Del’s internet news show, The HighWire, is the fastest-growing program in the natural health arena with over 75 million views.", "url": "https://www.coasttocoastam.com/guest/bigtree-del-78986/", "image": "https://i.iheart.com/v3/re/new_assets/5f56dadd9ea3a13bf944297d?ops=gravity(%22north%22),fit(1200,675),quality(65)", "image:width": "1200", "image:height": "675", "type": "article", "site_name": "Coast to Coast AM"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": ["Coast to Coast AM Staff"], "publish_date": "Wednesday - December 1 2021"}