{"result_id": "074017", "URL": "https://www.coasttocoastam.com/show/2020-12-16-show/", "timestamp": "2023-04-25 14:46:17 CEST+0200", "meta": {"description": "Pediatrician Dr. Paul Thomas addressed controversies around vaccines, including the new ones for COVID-19. Followed by researcher Ryan Hurd on coping with sleep paralysis.", "lang": "en", "keywords": "vaccinations, sleep paralysis", "favicon": "https://i.iheart.com/v3/re/assets.coast2coast/5d4dc9096ea20854764b2ce8?ops=gravity(%22center%22),contain(32,32),quality(65)", "canonical": "https://www.coasttocoastam.com/show/2020-12-16-show/", "encoding": "UTF-8"}, "image": null, "domain": "www.coasttocoastam.com", "title": "Vaccination Controversies / Sleep Paralysis", "cleaned_text": "Dr. Paul Thomas has practiced pediatrics for over 30 years in Portland, Oregon where his license to practice medicine was recently suspended by the Oregon Medical Board over vaccination issues (PDF). In the first half, he discussed his study of his patients' health outcomes who were vaccinated vs. unvaccinated (PDF), and the debate over vaccines, including the new ones for COVID-19 (vote in our poll on if you'll take the vaccine). Thomas said he is not against all vaccines and suggested that people decide on an individual basis which ones are most appropriate and safe for them and their children. His study, which compared children who came into his practice, found that those who had fewer or no vaccinations were much healthier than those who did. He reported that they were not having as much chronic or acute illness or various conditions like ADHD, asthma, and autism.\n\nWhat's really damaged kids' health, he asserted, is the massive number of vaccines given out nowadays, as the mercury and aluminum additives can cumulatively reach toxic levels. Thomas expressed concerns about the safety of the new COVID vaccines, arguing that the MRNA technology had not been used on humans before, animal trials were skipped in their rush to get the product out, and there are no long term safety records. Further, he lamented that the original placebo subjects in the Moderna and Pfizer test groups would soon be vaccinated, and we won't have an accurate comparison study to evaluate.\n\nIn the latter half, author and researcher Ryan Hurd talked about the frightening experience of sleep paralysis (SP), as well as lucid dreams. In an episode of sleep paralysis, an awakening person is briefly stuck in a blend of waking and sleeping, and may feel pressure on their throat or chest, while their body is paralyzed (as a remnant of the REM state). The condition is mostly harmless though it can terrify people with visions of hideous entities or \"intruders,\" he detailed. Such encounters with an autonomous \"other,\" Hurd continued, may begin with the sound of footsteps and move into a full apparition that can touch, press down on, or molest the sleeper.\n\nFor Hurd, sleep paralysis is not necessarily to be shunned as the experience can be used as a springboard to enter into freeing or exhilarating out-of-body states or lucid dreaming. He noted that SP is more in common in people such as students and nurses who have erratic schedules and sleep at different intervals, and that stress can also be a factor. To break out of SP, he advised trying to wiggle a toe or finger, or even just controlling your breath. Lucid dreaming (where the sleeper becomes aware that they're dreaming within the dream) is somewhat of a learned skill, he reported. Rather than trying to control such dreams, he relishes the increased options for choices within that framework. Hurd also talked about his design and use of talismans and amulets to protect from SP or inspire lucidity.", "opengraph": {"locale": "en_us", "title": "Vaccination Controversies / Sleep Paralysis | Coast to Coast AM", "description": "Pediatrician Dr. Paul Thomas addressed controversies around vaccines, including the new ones for COVID-19. Followed by researcher Ryan Hurd on coping with sleep paralysis.", "url": "https://www.coasttocoastam.com/show/2020-12-16-show/", "image": "https://i.iheart.com/v3/re/new_assets/5fd31ced1d919709799c7f07?ops=gravity(%22north%22),fit(1200,675),quality(65)", "image:width": "1200", "image:height": "675", "type": "article", "site_name": "Coast to Coast AM"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.drpaul.md/", "https://www.dropbox.com/s/w5d6ql82yzhvk9i/OMB suspension.pdf?dl=0", "https://www.dropbox.com/s/e2dn9tsx04d9jd9/Published IP study JLW-PT.pdf?dl=0", "https://www.coasttocoastam.com/article/c2c-insta-poll-will-you-take-the-covid-vaccine/", "https://dreamstudies.org/", "https://lucidtalisman.com/", "http://www.howardbloom.net", "https://www.thestreet.com/mishtalk"], "authors": [], "publish_date": "December 16, 2020"}