{"result_id": "075012", "URL": "https://collapse.news/2022-02-08-vaccine-mandate-impacting-truck-drivers-from-mexico.html", "timestamp": "2023-04-25 14:46:57 CEST+0200", "meta": {"description": "The Wuhan coronavirus (COVID-19) vaccine mandate implemented by the U.S. has significantly impacted trucking at the southern border. Unvaccinated truckers coming from Mexico have been barred from entering American soil – similar to the situation up north at the Canadian border. On Jan. 22, the U.S. mandated non-citizens entering the country by land via Mexico […]", "lang": "en", "keywords": "badhealth,badmedicine,Collapse,covid-19,drayage,medical martial law,Medical Tyranny,pandemic,southern border,supply chain,transportation,truckers,trucking companies,vaccine mandate,Wuhan coronavirus", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://collapse.news/2022-02-08-vaccine-mandate-impacting-truck-drivers-from-mexico.html", "encoding": "UTF-8"}, "image": null, "domain": "collapse.news", "title": "COVID vaccine mandate impacting truck drivers at southern border, worsening supply chain disruptions", "cleaned_text": "The Wuhan coronavirus (COVID-19) vaccine mandate implemented by the U.S. has significantly impacted trucking at the southern border. Unvaccinated truckers coming from Mexico have been barred from entering American soil – similar to the situation up north at the Canadian border.\n\nOn Jan. 22, the U.S. mandated non-citizens entering the country by land via Mexico and Canada to be vaccinated against COVID-19. Truckers were included in this mandate.\n\nCustoms and Border Protection (CBP) Assistant Director of Field Operations Armando Taboada said his team encountered 111 unvaccinated drivers during the first three days following the mandate’s effectivity. Taboada, who is assigned at CBP’s Laredo, Texas field office, is in charge of overseeing eight ports of entry along the Texas-Mexico border.\n\n“We were capturing the numbers the first few days to give us an idea. For the most part, I believe the carriers got the message that vaccine requirements were being enforced,” he said.\n\nAccording to Taboada, non-compliant drivers returned to Mexico. Those with empty trucks were returned with the tractor-trailer still attached. Meanwhile, loaded shipments were processed for import into the U.S. regardless of the vaccination status of the drivers transporting them.\n\n“The non-compliant drivers with loaded shipments [or] trailers were temporarily held in the cargo import facilities. The non-compliant driver was sent back to Mexico, but the trailer with loaded shipment was allowed to proceed with a replacement vaccinated, compliant driver to keep the flow of trade moving. This was done at all of our ports of entry.” (Related: Biden bans unvaccinated truckers from entering the US, accelerating collapse of supply chains.)\n\nThe U.S. allows trucks from Mexico – called drayage trucks – to travel short distances northbound to drop off shipments. However, these drayage trucks are only permitted to travel generally within a 25-mile zone. The drayage trucking industry along the southern border sees hundreds of trucking companies transporting both raw materials and finished products back and forth across the border daily.\n\nTruckers speak out regarding the new vaccine mandate down south\n\nSeveral trucking companies have spoken out about the COVID-19 vaccine mandate for truckers coming into Mexico. They warned that the mandate can potentially exacerbate the current supply chain crisis.\n\nCold Chain Solutions CEO Gerardo Alanis Barrios said the vaccine mandates have strained the already-tight market for truck drivers. The head of the Laredo-based firm said: “Drayage capacity has been strained for the better part of two years. The vaccine mandate has come to dent it even more.”\n\nBarrios elaborated: “In our fleet, about four percent of our drivers have refused to get vaccinated. Some argue they can’t get it because of medical conditions, while others simply don’t want unknown substances in their bodies. A few have gone so far as to ask for other jobs within the company to support their decision.”\n\nLuis Garcia, carrier relations head at digital logistics platform Nuvocargo, said the company saw a few northbound shipments coming from Mexico face delays following the COVID-19 vaccine mandate for drivers imposed by the United States. Aside from unvaccinated drivers, he also mentioned the impact of COVID-positive truckers calling in sick.\n\n“We’ve seen a few cases. One of our carriers had to change drivers last minute after they got [COVID-19 test] results from an internal policy of testing that they carried out. That made one of our pickups take two hours longer than expected,” said Garcia.\n\nThe Nuvocargo executive pointed out that most of the drivers his company works with “have accepted [COVID-19] vaccines.” He continued: “However, what they’re suffering is sick leaves from their driver base and are hamstrung with [the] capacity to move the loads – and it is backlogging capacity.”\n\nVaccine mandate for truckers entering Canada now in effect; unvaccinated American truckers will be TURNED AWAY.\n\nEXPECT SHORTAGES: Canadian truckers not exempt from new vaccine mandate despite recent announcement.\n\nVaccine mandates in Canada now affecting pig and feed shipments.\n\nWatch the video below of Harrison Smith explaining the impact of vaccine mandates on the food supply.\n\nThis video is from the InfoWars channel on Brighteon.com.\n\nMedicalTyranny.com has more about COVID-19 vaccine mandates on truckers entering the United States.", "opengraph": {"title": "COVID vaccine mandate impacting truck drivers at southern border, worsening supply chain disruptions", "type": "article", "url": "https://www.collapse.news/2022-02-08-vaccine-mandate-impacting-truck-drivers-from-mexico.html", "site_name": "Collapse News", "description": "The Wuhan coronavirus (COVID-19) vaccine mandate implemented by the U.S. has significantly impacted trucking at the southern border. Unvaccinated truckers coming from Mexico have been barred from entering American soil – similar to the situation up north at the Canadian border. On Jan. 22, the U.S. mandated non-citizens entering the country by land via Mexico […]", "image": "https://www.collapse.news/wp-content/uploads/sites/20/2022/02/Semi-Big-Rig-Truck-Cargo-Highway.jpg"}, "tags": ["pandemic", "covid-19", "supply chain", "Collapse", "trucking companies", "vaccine mandate", "Medical Tyranny", "southern border", "drayage", "transportation", "truckers", "Wuhan coronavirus", "medical martial law"], "tweets": [], "movies": [], "links": ["https://www.freightwaves.com/news/vaccine-mandate-has-varied-impacts-on-mexico-cross-border-trucking", "https://www.naturalnews.com/2022-01-26-biden-bans-unvaccinated-truckers-from-entering-america.html", "https://www.brighteon.tv", "http://healthfreedom.news", "https://medicaltyranny.com/2022-01-20-vaccine-mandate-truckers-entering-canada-in-effect.html", "https://collapse.news/2022-01-16-canadian-truckers-not-exempt-new-vaccine-mandate.html", "https://medicalmartiallaw.com/2022-01-21-food-shortages-canada-trucker-covid-vaccine-mandate.html", "https://supplychainwarning.com/2022-01-25-pig-and-feed-shipments-vaccine-mandates.html", "https://www.brighteon.com/72bbdc27-1be9-44e2-a880-1e9a35963502", "https://www.brighteon.com/channels/infowarsnetwork", "https://www.brighteon.com/channels/infowarsnetwork", "https://medicaltyranny.com/", "https://www.freightwaves.com/news/vaccine-mandate-has-varied-impacts-on-mexico-cross-border-trucking", "https://www.brighteon.com/72bbdc27-1be9-44e2-a880-1e9a35963502", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcollapse%2F2022-02-08-vaccine-mandate-impacting-truck-drivers-from-mexico.html&linkname=COVID%20vaccine%20mandate%20impacting%20truck%20drivers%20at%20southern%20border%2C%20worsening%20supply%20chain%20disruptions", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}