{"result_id": "075011", "URL": "https://collapse.news/2023-03-03-insurance-crumbling-covid-vaccine-deaths-investment-losses.html", "timestamp": "2023-04-25 14:46:56 CEST+0200", "meta": {"description": "Estimates suggest that the insurance industry has suffered nearly $1 trillion in losses due to the Wuhan coronavirus (Covid-19) and Operation Warp Speed. Between the claims that are being paid out for all those “excess deaths” and the investment portfolio losses, Peter Halligan suggests that the ballpark of losses across the insurance industry is around […]", "lang": "en", "keywords": "badhealth,badmedicine,Collapse,COVID,debt bomb,depopulation,excess deaths,genocide,insurance,life insurance,Vaccine deaths,vaccines,Wuhan coroanavirus", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://collapse.news/2023-03-03-insurance-crumbling-covid-vaccine-deaths-investment-losses.html", "encoding": "UTF-8"}, "image": null, "domain": "collapse.news", "title": "Insurance industry CRUMBLING amid covid “vaccine” excess deaths and massive investment losses", "cleaned_text": "Estimates suggest that the insurance industry has suffered nearly $1 trillion in losses due to the Wuhan coronavirus (Covid-19) and Operation Warp Speed.\n\nBetween the claims that are being paid out for all those “excess deaths” and the investment portfolio losses, Peter Halligan suggests that the ballpark of losses across the insurance industry is around $911 billion.\n\n“Average value of a Life policy is $168,000, extra deaths are around 560,000 for three years and half of Americans have some form of Life insurance,” Halligan writes about his figure estimates.\n\n“Let’s make a simplifying assumption that half of the extra deaths were insured.\n\n $168,000 times 280,000 deaths times 3 years = around 141 billion dollars. I will take just one third of that number for calendar year 2022 policy pay-outs = 47 billion bucks.”\n\nWill the life insurance industry survive the ongoing covid “vaccine” injury and death fallout?\n\nLike any other well-run company, life insurance companies seek to match assets with liabilities.\n\n“This means that maturity ladders of actuarially determined deaths by year, should be matched with, say fixed income (ideally zero coupon bonds) that at least match those annually expected deaths into the future,” Halligan says.\n\nBased on this, the face value of life insurance policies in the United States is estimated to be around $3.29 trillion. There are some unknowns with the numbers, hence these estimates, but this is meant to be a ballpark assessment.\n\nIn 2019, the top 25 life insurance carriers in the U.S. held assets with a total value of around $5.2 trillion. These appreciated slightly in 2020 and 2021, followed by a much larger appreciation spike in 2022.\n\nIf life insurance companies held to the old 60 / 40 equity / bond portfolio split that year, then they lost 60 percent of their holdings, as well as 20 percent of their S&P 500 holdings, and 10 percent of their 40 percent bond portfolios, which amounts to around 16 percent, or one-sixth, of their investment portfolios.\n\n“A sixth of 5.2 trillion representing assets of the top 25 US Life Insurance companies? Around 870 billion bucks,” Halligan explains. “Combine that with just one third of the three year estimate of extra Life policy pay-outs of 41 billion bucks and your get around 911 billion bucks.”\n\nThis is a massive amount of money that has been lost as a direct result of the chaos that came with the scamdemic, most notably Wuhan coronavirus (Covid-19) “vaccines.”\n\nNumerous commenters on Halligan’s article about all this pointed out that life insurance companies by law are not invested in stock markets. If this is the case and there are no investments in real estate, either – just fixed income – than Halligan says the 16 percent loss figure should be reduced to around 10 percent losses, or roughly half a trillion dollars.\n\n“Seems like I read this someplace … ‘Store not up for yourselves treasures on earth where moth and rust corrupt, and thieves break in and steal …'” wrote another. “Make sure that your primary life insurance policy is not of, or dependent upon, this world.”\n\nAnother questioned why life insurance companies are “not raising alarm bells” about all this, to which someone else suggested that these alarm bells come with every quarterly earnings report.\n\n“Also they very stealthily disguised the reason in gobbledygook so no one could understand. Of course, that doesn’t fool astute individuals that have been paying attention. The way the insurance companies will compensate is by simply raising their rates dramatically. The LAST thing they will do is charge more for people that got the clotshot.”\n\nMore related news about the ongoing covid “vaccine” genocide can be found at Genocide.news.", "opengraph": {"title": "Insurance industry CRUMBLING amid covid “vaccine” excess deaths and massive investment losses", "type": "article", "url": "https://www.collapse.news/2023-03-03-insurance-crumbling-covid-vaccine-deaths-investment-losses.html", "site_name": "Collapse News", "description": "Estimates suggest that the insurance industry has suffered nearly $1 trillion in losses due to the Wuhan coronavirus (Covid-19) and Operation Warp Speed. Between the claims that are being paid out for all those “excess deaths” and the investment portfolio losses, Peter Halligan suggests that the ballpark of losses across the insurance industry is around […]", "image": "https://www.collapse.news/wp-content/uploads/sites/20/2023/03/Insurance-Policy-Glasses-Pen.jpg"}, "tags": ["excess deaths", "debt bomb", "insurance", "Vaccine deaths", "Collapse", "COVID", "life insurance", "genocide", "Wuhan coroanavirus", "depopulation", "vaccines"], "tweets": [], "movies": [], "links": ["https://peterhalligan.substack.com/p/do-us-life-insurance-companies-need", "https://naturalnews.com/2022-01-03-deaths-up-40percent-compared-before-covid-vaccines.html", "https://www.brighteon.tv", "http://genocide.news", "https://peterhalligan.substack.com/p/do-us-life-insurance-companies-need", "https://naturalnews.com/2022-01-03-deaths-up-40percent-compared-before-covid-vaccines.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcollapse%2F2023-03-03-insurance-crumbling-covid-vaccine-deaths-investment-losses.html&linkname=Insurance%20industry%20CRUMBLING%20amid%20covid%20%E2%80%9Cvaccine%E2%80%9D%20excess%20deaths%20and%20massive%20investment%20losses", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}