{"result_id": "075036", "URL": "https://collapse.news/2023-04-05-10000-army-soldiers-too-obese-to-fight.html", "timestamp": "2023-04-25 14:47:03 CEST+0200", "meta": {"description": "If another country wanted to invade and take over the United States, it would be really easy to do so right now because a growing number of American soldiers is too fat to fight. Blaming the Wuhan coronavirus (Covid-19) “pandemic” for the military’s obesity problem, the Associated Press (AP) reported that in the Army branch […]", "lang": "en", "keywords": "Army,badhealth,Dangerous,fat,fight obesity,insanity,junk food,military,military readiness,national security,obesity,obesity epidemic,pandemic,Suppressed", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://collapse.news/2023-04-05-10000-army-soldiers-too-obese-to-fight.html", "encoding": "UTF-8"}, "image": null, "domain": "collapse.news", "title": "TOO FAT TO FIGHT: 10,000 U.S. Army soldiers are now too obese to serve… and a quarter of young men can’t even qualify for recruitment", "cleaned_text": "TOO FAT TO FIGHT: 10,000 U.S. Army soldiers are now too obese to serve… and a quarter of young men can’t even qualify for recruitment\n\nIf another country wanted to invade and take over the United States, it would be really easy to do so right now because a growing number of American soldiers is too fat to fight.\n\nBlaming the Wuhan coronavirus (Covid-19) “pandemic” for the military’s obesity problem, the Associated Press (AP) reported that in the Army branch of the military alone, nearly 10,000 active-duty soldiers developed obesity between February 2019 and June 2021. Because of this, nearly 25 percent of Army troops are now too big to do their jobs.\n\nThe situation is not much different in the Navy and the Marines. Too much sitting inside during the lockdowns eating genetically modified (GMO) slop “food” has left servicemembers in the U.S. military in poorer shape than the average civilian in a foreign country where GMOs and other garbage are not part of the food supply.\n\n“I could notice it,” said U.S. Army Staff Sgt. Daniel Murillo, 27, who reportedly spent “endless hours on his laptop” during the scamdemic while he chowed down on “cookies and chips in the barracks at Fort Bragg in North Carolina.”\n\n“The uniform was tighter,” Murillo told the AP about how his body became misshapen during the plandemic.\n\nIf the U.S. military hopes to survive, it needs to start feeding its soldiers healthier food and bringing back fitness routines\n\nEver since the Fauci Flu began dominating headlines, the obesity situation in the U.S. military has only continued to worsen. Between all the “vaccine” injections soldiers receive, the junk food they eat, and the lack of physical fitness, the U.S. military has become a mere shell of what it once was.\n\n“The Army and the other services need to focus on how to bring the forces back to fitness,” said Tracey Perez Koehlmoos, director of the Center for Health Services Research at the Uniformed Services University in Bethesda, Md., who led new research on the subject.\n\nIf military service members remain fat and sickly, as many of them now are, then they risk succumbing to more injuries and failing to meet the physical demands necessary for their profession.\n\nAccording to Koehlmoos’ assessment, the U.S. military loses more than 650,000 workdays a year because of all the extra weight its service members are packing on, not to mention the $1.5 billion in obesity-related health care costs that are incurred by both current and former service members and their families.\n\nFor more than a decade, military leaders have been sounding the alarm about this trend towards obesity, which started long before the scamdemic. Again, it has a lot to do with the food being fed to service members and the injections they are all forced to take in order to serve.\n\nMarine Corps Brigadier Gen. Stephen Cheney co-authored his own report on the subject, which arrived at grim conclusions.\n\n“The numbers have not gotten better,” Cheney told participants in a November webinar held by the American Security Project, a non-profit think tank. “They are just getting worse and worse and worse.”\n\nFor the first time ever, the U.S. Army failed to achieve its recruiting goal in fiscal year 2022, falling short by about 15,000 recruits, or about one-quarter of the requirement.\n\nThe alleged reason for this is the fact that three-quarters of Americans aged 17 to 24 are not eligible for military service, in part due to being fat. Obesity is now the biggest individual disqualifier, affecting more than one in 10 potential recruits, according to the report.\n\n“It is devastating,” Cheney commented, adding that this has created “a dramatic national security problem.”\n\nThe latest news about the ongoing collapse of America can be found at Collapse.news.", "opengraph": {"title": "TOO FAT TO FIGHT: 10,000 U.S. Army soldiers are now too obese to serve… and a quarter of young men can’t even qualify for recruitment", "type": "article", "url": "https://www.collapse.news/2023-04-05-10000-army-soldiers-too-obese-to-fight.html", "site_name": "Collapse News", "description": "If another country wanted to invade and take over the United States, it would be really easy to do so right now because a growing number of American soldiers is too fat to fight. Blaming the Wuhan coronavirus (Covid-19) “pandemic” for the military’s obesity problem, the Associated Press (AP) reported that in the Army branch […]", "image": "https://www.collapse.news/wp-content/uploads/sites/20/2023/04/Fat-Overweight-Obese-Belly.jpg"}, "tags": ["pandemic", "national security", "obesity epidemic", "Army", "fight obesity", "Dangerous", "Suppressed", "obesity", "military readiness", "insanity", "military", "fat"], "tweets": [], "movies": [], "links": ["https://12ft.io/proxy?q=https%3A%2F%2Fapnews.com%2Farticle%2Fmilitary-obesity-pandemic-army-covid-404bbc1a67408d390a7d462f1ecbef75", "https://naturalnews.com/2022-08-19-military-failing-recruit-nobody-wants-american-degeneracy.html", "https://www.brighteon.tv", "https://collapse.news", "https://12ft.io/proxy?q=https%3A%2F%2Fapnews.com%2Farticle%2Fmilitary-obesity-pandemic-army-covid-404bbc1a67408d390a7d462f1ecbef75", "https://naturalnews.com/2022-08-19-military-failing-recruit-nobody-wants-american-degeneracy.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcollapse%2F2023-04-05-10000-army-soldiers-too-obese-to-fight.html&linkname=TOO%20FAT%20TO%20FIGHT%3A%2010%2C000%20U.S.%20Army%20soldiers%20are%20now%20too%20obese%20to%20serve%E2%80%A6%20and%20a%20quarter%20of%20young%20men%20can%E2%80%99t%20even%20qualify%20for%20recruitment", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}