{"result_id": "075018", "URL": "https://collapse.news/2023-04-02-restrict-act-anti-tiktok-law-is-an-orwellian-nightmare-targeting-americans.html", "timestamp": "2023-04-25 14:46:58 CEST+0200", "meta": {"description": "Any time the government promises to make you “safer,” beware of their intentions. The media-amplified hysteria over TikTok — a video social media platform built and run by communist China — has handed the power opportunists in Washington D.C. a cover story to try to control all online speech through the introduction of the S. […]", "lang": "en", "keywords": "authoritarianism,banned,Censored,Censorship,computing,corruption,domains,e-commerce,First Amendment,free speech,freedom,Glitch,Liberty,obey,publishing,Restrict Act,TikTok,Tyranny", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://collapse.news/2023-04-02-restrict-act-anti-tiktok-law-is-an-orwellian-nightmare-targeting-americans.html", "encoding": "UTF-8"}, "image": null, "domain": "collapse.news", "title": "The RESTRICT ACT (anti-TikTok law) is an Orwellian NIGHTMARE that would seize web domains and imprison Americans for 20 years if they contradict the regime in power", "cleaned_text": "The RESTRICT ACT (anti-TikTok law) is an Orwellian NIGHTMARE that would seize web domains and imprison Americans for 20 years if they contradict the regime in power\n\nAny time the government promises to make you “safer,” beware of their intentions. The media-amplified hysteria over TikTok — a video social media platform built and run by communist China — has handed the power opportunists in Washington D.C. a cover story to try to control all online speech through the introduction of the S. 686 RESTRICT Act, sponsored by an anti-free speech zealot on the Left, Sen. Mark Warner.\n\nThe bill, introduced on March 7th, 2023, uses TikTok’s popularity as an excuse to criminalize American-run websites, platforms and blogs that merely disagree with the government regime on literally any topic: Vaccines, Russia, elections, bank runs, currency, transgenderism, climate change and so on.\n\nThe weaponization potential of the bill is unlimited, as it can be applied to anything merely deemed to be in the “national security interest” of the United States.\n\nThe bill text explicitly states that the government may enforce, “any mitigation measure” against “any person” or “any property” by merely deciding that an article, video, podcast, platform or other content item contains content they don’t like.\n\nThis is not a law that targets Chinese communists or TikTok… it’s a law targeting Americans and threatening them with prison time if they say anything the current regime in power doesn’t like.\n\nUnder the proposed law, any content that the regime decides poses an undue risk to, “the safety of United States persons” can be removed by any means necessary, including domain seizures by the DHS or other forms of sabotage (i.e. “mitigation”) which might include the government fire bombing data centers or assassinating Americans.\n\nTo annihilate all Christian content on the web, the Biden regime can simply declare that Bible scripture compromises the “safety” of the trans community and therefore must be removed by any means necessary. We could literally see the US government burning down churches to destroy web hosting data centers that are held there. (The US government has been running sabotage operations against food and energy infrastructure for at least the last two years, so this isn’t a stretch at all.)\n\nAll your assets can be seized without any due process whatsoever\n\nThose merely deemed in violation of the RESTRICT Act — utterly without any court hearings or opportunity for a legal defense — may have all their assets, properties, computers, websites, servers, bank accounts, databases and other items confiscated at gunpoint by the government, with zero recourse or due process.\n\nEven worse, the act specifically prohibits FOIA requests (Freedom of Information Act) from being honored in order to make sure the tyrannical government can keep the list of RESIST Act targets a secret.\n\nWhat the US government did to Julian Assange, they are about to do to millions of American citizens. Perhaps even you.\n\n\n\nFrom the bill text itself, the RESTRICT Act grants authority to seize or “mitigate” (i.e. destroy or sabotage) all the following:\n\n(C) machine learning, predictive analytics, and data science products and services, including those involving the provision of services to assist a party utilize, manage, or maintain open-source software;\n\nThis would, of course, include all websites, including all e-commerce sites. Thus, if you sell anything the government doesn’t like, they can confiscate all your bank accounts, web domain, company servers, product inventory and anything else they deem to be related.\n\nThe RESTRICT Act would criminalize all decentralized cryptocurrency (i.e. Bitcoin, Ethereum, etc.)\n\nIn addition, the RESTRICT Act threatens total government control over cryptocurrency and other vast technologies such as quantum cryptography, which is a promising tech that could allow private individuals to prevent corrupt governments from spying on their private messages.\n\nTo ban all Bitcoin, the government would merely need to claim that somebody in Russia or China used Bitcoin to carry out some horrible (false flag) terrorism in the United States, and that Bitcoin enabled the funding for the attack. With one declaration, Bitcoin could be outlawed across the country and anyone who transacts in Bitcoin could face 20 years in prison (plus total confiscation of all their wallets, computers, bank accounts, house, etc).\n\nIt’s not just crypto, either, that’s threatened by this insane power grab. Proving that this bill isn’t limited to TikTok, here are all the tech sectors named in the bill text which would be controlled, censored or otherwise lorded over by the tyrannical US government:\n\n(A) artificial intelligence and machine learning;\n\n (B) quantum key distribution;\n\n (C) quantum communications;\n\n (D) quantum computing;\n\n (E) post-quantum cryptography;\n\n (F) autonomous systems;\n\n (G) advanced robotics;\n\n (H) biotechnology;\n\n (I) synthetic biology;\n\n (J) computational biology; and\n\n (K) e-commerce technology and services, including any electronic techniques for accomplishing business transactions, online retail, internet-enabled logistics, internet-enabled payment technology, and online marketplaces.\n\nNote that this includes all e-commerce, all online banking transactions, payment systems, cryptocurrency and so on.\n\nIn effect, the RESTRICT Act is an attempt to seize total control over the entire online economy, online speech and online freedom.\n\nIt should be called the ONLINE TYRANNY Act, as it is the manifestation of absolute tyranny over the American people.\n\nThe tyrants in power want to make sure that all spying is conducted by them, not by China\n\nThe power-hungry tyrants in Washington D.C. are not actually opposed to apps and software systems spying on you, by the way. After all, thanks to the Twitter Files and other leaks, we now know that both the White House and the Department of Homeland Security quite literally ordered Facebook, Google, YouTube, Twitter and other online platforms to censor a long list of websites and individuals who questioned covid vaccine safety.\n\nThe tyrants in Washington absolutely want to spy on the American people and censor all speech they don’t like. They are doing it now. They aren’t opposed to TikTok’s spying on the American people; they just want to be the ones in charge of the spying and censorship.\n\nIt was a moment of peak hypocrisy in the US House hearing recently when US members of Congress grilled TikTok CEO Shou Zi Chew about being engaged in the suppression the free speech of Chinese citizens while seeming to be utterly tone deaf to the US government’s ongoing censorship of the American people.\n\nIt’s almost as if US lawmakers have no idea that the US empire censors the American people in exactly the same way communist China censors its own people. With the RESTRICT Act, the US government wants to monopolize censorship and surveillance power in its own hands. This isn’t about ending censorship, it’s about expanding it to cover all websites, services and apps.\n\nAny political commentary can be designated “election interference” if the regime in power doesn’t like it\n\nThe RESTRICT Act invokes the broad definition of “election interference” to justify literally any action the government wants to take against a publisher or platform it dislikes. These actions can include seizing bank accounts, seizing domain names, seizing servers and so on, and such tyrannical actions could be unleashed against an individual for doing nothing more than sharing a simple meme related to elections.\n\nCase in point: Meme maker Douglass Mackey was just found guilty of a serious felony — election interference — for a funny meme he distributed about Hillary Clinton in the 2016 election. The DOJ prosecuted Mackey over the meme and was easily able to convince a jury of brainwashed liberals to convict Mackey for the very same kind of meme joke that Democrats routinely distribute against Trump and others. But through selective prosecution, Mackey is now facing 10 years in prison.\n\nThis is the kind of weaponization of the legal system — a form of government terrorism against the people — that would be escalated by a factor of a thousand under the RESTRICT Act.\n\nThe act would target anyone who merely criticized a Democrat candidate or who posted something about that candidate which the regime in power says isn’t true. It would only take a “fact check” strike against your content to have you declared engaged in “election interference,” after which the government could confiscate everything you own, including your web domains, bank accounts, computers, mobile phone and even your home if you posted your meme from there.\n\nWhile the RESTRICT Act claims to prevent China from spying on Americans, it actually transforms America into communist China by erecting a massive surveillance and censorship police state over all Americans. The act specifically names all the networks that the government can use for spying on citizens:\n\n(A) wireless local area networks;\n\n (B) mobile networks;\n\n (C) satellite payloads;\n\n (D) satellite operations and control;\n\n (E) cable access points;\n\n (F) wireline access points;\n\n (G) core networking systems;\n\n (H) long-, short-, and back-haul networks; or\n\n (I) edge computer platforms;\n\nThe act also grants the government the power to target entire online platforms, including domain names, cloud computing, databases, CDNs (content delivery networks) and more.\n\nThe tyranny encompasses literally every known computing and e-commerce ecosystem that exists, including gaming. The act specifically names:\n\nThis means there is no website, application, transaction, software or service that isn’t threatened by the RESTRICT Act.\n\nFurthermore, the act specifically grants the government the power to sabotage (“mitigate”) by any means necessary, any person, organization, software system, website, platform or anything else they deem to be unacceptable.\n\nIf the regime decides they don’t like what you are publishing or doing, in other words, they can simply seize it, shut it down, confiscate all your assets and silence you, utterly without any due process or opportunity for legal defense.\n\nThis is tyranny on steroids. If enacted, it will mean the end of the republic… and the end of human freedom for western civilization.\n\nThat’s why it is critical that you join the effort to defeat the RESTRICT Act before it can become law. Make no mistake, if this act becomes law, it will end the website you are currently reading now along with every alternative content platform in America: Rumble, Bitchute, Brighteon, Gab, Truth Social, GETTR and all the rest. Under this tyrannical law, Truth will become Treason in a nation of lies.\n\nTo help defeat the RESTRICT Act, contact your representatives and demand they reject the RESTRICT ACT. It is important to call, not just send an email. You can reach your Senators and House members via the United States Capitol switchboard at (202) 224-3121.\n\nCall your Senators and House representative. Call your state Attorney General as well, and share the warning about the danger of this overzealous, authoritarian, fascist law that seeks to end the First Amendment and criminalize free speech in America.\n\nWe must defeat the RESTRICT Act. And then, in the next election, we must defeat each and every tyrant that supported it. That includes all the following Republican senators who also supported the act (virtually all Democrats support tyranny by default, but in this case even some Republicans are supporting tyranny, too):\n\nIf you are a constituent in any of the states represented by the GOP senators above, it is urgent that you call their offices and register your opposition to the RESTRICT Act. The US Senate cannot pass the act without the support of several republican senators. Make sure your senators are strongly opposed to this act.\n\nAnd to anyone who foolishly says this act is only intended to be used against the communist Chinese and would never be weaponized against the American people, just look at the Patriot Act and how it was originally promoted to surveil radical Islamic extremists. But now, it’s used every day to illegally silence and surveil the American people.\n\nAll new powers granted to the government are eventually weaponized against the people.\n\nThe RESTRICT Act is a weapon against freedom, and if passed, it will be used to silence, oppress and imprison millions of Americans who oppose tyranny, censorship, rigged elections and mandatory vaccines.\n\nTake action now to defeat this outrageously dangerous piece of legislation. And God bless America.", "opengraph": {"title": "The RESTRICT ACT (anti-TikTok law) is an Orwellian NIGHTMARE that would seize web domains and imprison Americans for 20 years if they contradict the regime in power", "type": "article", "url": "https://www.collapse.news/2023-04-02-restrict-act-anti-tiktok-law-is-an-orwellian-nightmare-targeting-americans.html", "site_name": "Collapse News", "description": "Any time the government promises to make you “safer,” beware of their intentions. The media-amplified hysteria over TikTok — a video social media platform built and run by communist China — has handed the power opportunists in Washington D.C. a cover story to try to control all online speech through the introduction of the S. […]", "image": "https://www.collapse.news/wp-content/uploads/sites/20/2023/04/Cyber-Attack-Matrix-Pentagon-America.jpg"}, "tags": ["TikTok", "e-commerce", "Liberty", "Censored", "Restrict Act", "banned", "Censorship", "free speech", "computing", "domains", "First Amendment", "publishing", "obey", "freedom", "corruption", "Glitch", "authoritarianism", "Tyranny"], "tweets": [], "movies": [], "links": ["https://www.govtrack.us/congress/bills/118/s686", "https://www.govtrack.us/congress/bills/118/s686/text", "https://www.brighteon.tv", "https://www.govtrack.us/congress/bills/118/s686/text", "https://pjmedia.com/news-and-politics/robert-spencer/2023/03/31/trump-supporter-found-guilty-faces-ten-years-in-prison-for-2016-anti-hillary-meme-n1683566", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcollapse%2F2023-04-02-restrict-act-anti-tiktok-law-is-an-orwellian-nightmare-targeting-americans.html&linkname=The%20RESTRICT%20ACT%20%28anti-TikTok%20law%29%20is%20an%20Orwellian%20NIGHTMARE%20that%20would%20seize%20web%20domains%20and%20imprison%20Americans%20for%2020%20years%20if%20they%20contradict%20the%20regime%20in%20power", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}