{"result_id": "075019", "URL": "https://collapse.news/2023-04-03-covid-vaccines-irs-estate-tax-vaccinated-deaths.html", "timestamp": "2023-04-25 14:46:59 CEST+0200", "meta": {"description": "An unknown billionaire with a fortune of up to $35 billion died from Wuhan coronavirus (Covid-19) “vaccination”, but nobody noticed until a $7 billion estate tax payment was made to the Internal Revenue Service (IRS). The Treasury Department says it received the $7 billion in “estate and gift” taxes on Feb. 28, 2023, from a […]", "lang": "en", "keywords": "badhealth,big government,COVID,death,depopulation,estate taxes,genocide,IRS,money supply,risk,vaccination,vaccine,Vaccine deaths,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://collapse.news/2023-04-03-covid-vaccines-irs-estate-tax-vaccinated-deaths.html", "encoding": "UTF-8"}, "image": null, "domain": "collapse.news", "title": "VAX FOR TAX: Covid vaccines have caused a surge in IRS estate tax revenues as fully vaccinated wealthy people DIE", "cleaned_text": "VAX FOR TAX: Covid vaccines have caused a surge in IRS estate tax revenues as fully vaccinated wealthy people DIE\n\nAn unknown billionaire with a fortune of up to $35 billion died from Wuhan coronavirus (Covid-19) “vaccination”, but nobody noticed until a $7 billion estate tax payment was made to the Internal Revenue Service (IRS).\n\nThe Treasury Department says it received the $7 billion in “estate and gift” taxes on Feb. 28, 2023, from a contributor who would have been one of the 100 richest people in the world – so who was it?\n\nWe do not know the identity of the individual who died, other than the fact that this kind of thing has been happening a lot ever since the launch of Operation Warp Speed. Estate and gift taxes collected remained relatively stable until the advent of covid jabs, after which IRS collections of this type began to skyrocket.\n\nIn the fiscal year that began in October, the IRS has already collected more than $9 billion in estate and gift taxes. This amount is more than the amount the IRS received in all of 2022 – that is how sizable this sudden influx of payments is.\n\nWill more fully vaccinated billionaires die, providing even more cash to the IRS?\n\nAccording to John Ricco, an economist and the associate director of budget analysis at Penn Wharton Budget Model, this surge in estate and gift tax payments to the IRS is “likely due to a large number of deaths during the covid pandemic,” to quote the Daily Mail Online.\n\nThe hidden truth, though, is that people are dying from covid vaccines, which the establishment still refuses to admit despite prolific evidence to suggest that Operation Warp Speed is one of the biggest, somewhat-covert genocide operations to ever be perpetrated on the world.\n\nCalculations by the Tax Policy Center, a think tank based in Washington, D.C., suggest that whoever made the big $7 billion payment probably had an estate worth at least $35 billion. Since nobody can figure out who this might be, Gabriel Zucman, an economist at the University of California Berkeley says that perhaps Forbes simply “missed” a billionaire in its list of those who died recently.\n\nIt is also possible that the money may have been “a large gift [or] a delayed payment by some billionaire who died several years [ago],” and that the IRS simply found it through a crackdown on missing payments.\n\nAnother possibility is that the $7 billion payment was triggered by a divorce involving a spouse who is not an American citizen, though payments that occur within a year of divorce are generally excluded.\n\n“The IRS is NOT a constitutional agency,” noted one commenter. “It is illegal to collect taxes no matter what Congress has stated.”\n\nAnother noted that the trend of antibody-dependent enhancement (ADE), the AIDS-like condition that afflicts the immune systems of the fully vaccinated, has only just begun, and that the world can expect a lot more of this type of strangeness in the coming days.\n\n“Sadly, it will be interesting when antibody-dependent enhancement (ADE) becomes more noticeable among the vaccinated in the coming months and years,” this person wrote.\n\nAnother wrote those who fell for the covid “vaccination” lie were duped by Tony Fauci and his band of criminals, who basically created an entire religious cult out of covid to dupe the masses.\n\n“Fauci is the high priest of the Branch Covidian Cult,” this person wrote. “The vaccine is its holy sacrament – “to be my disciple, you must partake of the holy sacrament regularly.” The tyrannical world leaders are his apostles.”\n\nThe latest news about the surging death toll from Fauci Flu shots can be found at Genocide.news.", "opengraph": {"title": "VAX FOR TAX: Covid vaccines have caused a surge in IRS estate tax revenues as fully vaccinated wealthy people DIE", "type": "article", "url": "https://www.collapse.news/2023-04-03-covid-vaccines-irs-estate-tax-vaccinated-deaths.html", "site_name": "Collapse News", "description": "An unknown billionaire with a fortune of up to $35 billion died from Wuhan coronavirus (Covid-19) “vaccination”, but nobody noticed until a $7 billion estate tax payment was made to the Internal Revenue Service (IRS). The Treasury Department says it received the $7 billion in “estate and gift” taxes on Feb. 28, 2023, from a […]", "image": "https://www.collapse.news/wp-content/uploads/sites/20/2023/04/Family-Members-Sad-Funeral-Death.jpg"}, "tags": ["big government", "vaccination", "vaccine wars", "Vaccine deaths", "death", "estate taxes", "COVID", "vaccine", "risk", "genocide", "depopulation", "IRS", "vaccines", "money supply"], "tweets": [], "movies": [], "links": ["https://www.dailymail.co.uk/news/article-11916039/US-Treasury-reveals-received-7BILLION-tax-payment-estate-gift-receipts.html", "https://naturalnews.com/2021-10-03-cdc-hospitals-fully-vaccinated-deaths-unvaccinated.html", "https://www.brighteon.tv", "http://www.berkeley.edu", "http://genocide.news", "https://www.dailymail.co.uk/news/article-11916039/US-Treasury-reveals-received-7BILLION-tax-payment-estate-gift-receipts.html", "https://naturalnews.com/2021-10-03-cdc-hospitals-fully-vaccinated-deaths-unvaccinated.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcollapse%2F2023-04-03-covid-vaccines-irs-estate-tax-vaccinated-deaths.html&linkname=VAX%20FOR%20TAX%3A%20Covid%20vaccines%20have%20caused%20a%20surge%20in%20IRS%20estate%20tax%20revenues%20as%20fully%20vaccinated%20wealthy%20people%20DIE", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}