{"result_id": "075006", "URL": "https://collapse.news/2022-01-16-canadian-truckers-not-exempt-new-vaccine-mandate.html", "timestamp": "2023-04-25 14:46:55 CEST+0200", "meta": {"description": "Canada’s federal government announced on Thursday, January 13, that unvaccinated Canadian truckers will not be exempted from the new vaccine mandate for truck drivers. In a joint statement, the country’s transportation, health, and public safety ministers said the initial policy requiring truckers coming into Canada to be fully vaccinated, or face PCR testing and quarantine […]", "lang": "en", "keywords": "Canada,Collapse,coronavirus,covid-19,cross-border,food supply,Inflation,pandemic,risk,scarcity,supply chain,transportation,truck drivers,truckers,trucking,trucking industry,vaccination,vaccine", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://collapse.news/2022-01-16-canadian-truckers-not-exempt-new-vaccine-mandate.html", "encoding": "UTF-8"}, "image": null, "domain": "collapse.news", "title": "EXPECT SHORTAGES: Canadian truckers not exempt from new vaccine mandate despite recent announcement", "cleaned_text": "EXPECT SHORTAGES: Canadian truckers not exempt from new vaccine mandate despite recent announcement\n\nCanada’s federal government announced on Thursday, January 13, that unvaccinated Canadian truckers will not be exempted from the new vaccine mandate for truck drivers.\n\nIn a joint statement, the country’s transportation, health, and public safety ministers said the initial policy requiring truckers coming into Canada to be fully vaccinated, or face PCR testing and quarantine requirements, stands.\n\nOn Wednesday, January 12, a spokesperson from the Canada Border Services Agency told reporters that the country will allow unvaccinated Canadian truckers to cross in from the United States – reversing a decision requiring all truckers to be inoculated against the Wuhan coronavirus (COVID-19). The government is now saying that the information provided was incorrect.\n\nBefore the confusion, it had been announced that unvaccinated Canadian truckers will have to “meet requirements for pre-entry, arrival and day eight testing.” They will also have to go through quarantine requirements although they cannot be denied entry into the country. The mandate takes effect on Saturday, January 15.\n\nUnvaccinated or partially-vaccinated non-Canadian truckers, meanwhile, will be turned away if they are unable to show proof of immunization or a valid medical contraindication to the vaccines.\n\nIn a statement, the ministers noted that certain categories of travelers will only be allowed to enter the country if they are fully vaccinated with one of the vaccines approved for entry into the country. These groups include essential service providers, including truck drivers. (Related: Get ready for more shortages: Truck driver shortage is getting worse and there aren’t enough drivers to fix the problem.)\n\nTo qualify as a fully vaccinated foreign national, non-Canadian truckers will need to complete their vaccine series at least 14 days before entering the country. They will also need to submit the required information through the ArriveCAN app.\n\n“The information shared [Wednesday] was provided in error. Our teams have been in touch with industry representatives to ensure they have the correct information,” the statement read.\n\nThe federal government also denied that it was reversing its decision, saying that because the U.S. is set to enact its own vaccine mandate for essential workers at the border beginning January 22, unvaccinated Canadian truckers are expected to face restrictions once the American policy comes into effect anyway.\n\nCross-border trucking organizations have been sounding the alarm for weeks, saying that requiring drivers to be vaccinated will sideline thousands, exacerbating trucker shortage and putting serious strains on the supply chain. (Related: Trucking industry is short 80,000 truck drivers amid supply chain crisis.)\n\nHead of the Canadian Trucking Alliance Stephen Laskowski said: “What we really have here in the next seven to nine days is the need for Ottawa and Washington to both agree to remove their foreign national requirements.”\n\nHe also stated that it’s not a question of whether or not the mandate should be put in place, but when it should be. He also recommended that both sides of the border work together. “Let’s understand that the supply chain is in a fragile state, and let’s pick a date to impose such measures when the supply chain is in a stronger condition than it is today.”\n\nConservative transport critic Melissa Lantsman expressed discontent on the handling of the decision, saying that the “reversal of a reversal” has resulted in greater uncertainty for many in the industry.\n\nNew Democratic Party’s Don Davies also noted that the handling of the situation has led to considerable confusion in the industry and questioned why it has taken months to roll out the policy. If truckers going into the United States and getting back to Canada must be vaccinated, then American truckers should do it as well. “We should apply the exact same rules to Canadians or else we’re putting economics above public health,” he noted.\n\nWatch the video below for more information on cross-border policies.\n\nThis video is from the What is Happening channel on Brighteon.com.\n\nGet more updates about the COVID-19 situation at Pandemic.news.", "opengraph": {"title": "EXPECT SHORTAGES: Canadian truckers not exempt from new vaccine mandate despite recent announcement", "type": "article", "url": "https://www.collapse.news/2022-01-16-canadian-truckers-not-exempt-new-vaccine-mandate.html", "site_name": "Collapse News", "description": "Canada’s federal government announced on Thursday, January 13, that unvaccinated Canadian truckers will not be exempted from the new vaccine mandate for truck drivers. In a joint statement, the country’s transportation, health, and public safety ministers said the initial policy requiring truckers coming into Canada to be fully vaccinated, or face PCR testing and quarantine […]", "image": "https://www.collapse.news/wp-content/uploads/sites/20/2022/05/Semi-Big-Rig-Truck-Cargo-Highway.jpg"}, "tags": ["pandemic", "covid-19", "trucking", "supply chain", "Collapse", "vaccine", "truck drivers", "Canada", "risk", "scarcity", "Inflation", "trucking industry", "coronavirus", "cross-border", "food supply", "transportation", "truckers", "vaccination"], "tweets": [], "movies": [], "links": ["https://www.ctvnews.ca/health/coronavirus/unvaccinated-canadian-truckers-will-have-to-quarantine-under-new-mandate-feds-say-1.5738185", "https://www.producegrower.com/article/canada-covid-19-vaccine-mandate-change/", "https://naturalnews.com/2021-11-08-truck-driver-shortage-is-getting-worse.html", "https://www.brighteon.tv", "https://naturalnews.com/2021-11-08-truck-driver-shortage-amid-supply-chain-crisis.html", "https://www.brighteon.com/4d8f765e-8ffd-4128-8785-20d027bb36d3", "https://www.brighteon.com/channels/annaka", "http://Pandemic.news", "https://www.ctvnews.ca/health/coronavirus/unvaccinated-canadian-truckers-will-have-to-quarantine-under-new-mandate-feds-say-1.5738185", "https://www.producegrower.com/article/canada-covid-19-vaccine-mandate-change/", "https://www.brighteon.com/4d8f765e-8ffd-4128-8785-20d027bb36d3", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcollapse%2F2022-01-16-canadian-truckers-not-exempt-new-vaccine-mandate.html&linkname=EXPECT%20SHORTAGES%3A%20Canadian%20truckers%20not%20exempt%20from%20new%20vaccine%20mandate%20despite%20recent%20announcement", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}