{"result_id": "075022", "URL": "https://collapse.news/2022-07-25-government-coverup-covid-jab-injuries-chernobyl-radiation.html", "timestamp": "2023-04-25 14:46:59 CEST+0200", "meta": {"description": "A few years after the horrific incident occurred, the radioactive fallout from the Chernobyl disaster was discovered by an independent journalist to have been much worse than what governments originally claimed. Today, we are seeing a similar type of mass coverup concerning the health damage caused by Wuhan coronavirus (Covid-19) “vaccines.” What happened back then […]", "lang": "en", "keywords": "big government,Censored Science,Censorship,chemical violence,Chernobyl,Collusion,conspiracy,corruption,coverup,COVID,deception,government,immune system,injuries,lies,nuclear,propaganda,sheeple,vaccine", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://collapse.news/2022-07-25-government-coverup-covid-jab-injuries-chernobyl-radiation.html", "encoding": "UTF-8"}, "image": null, "domain": "collapse.news", "title": "Government coverup of covid jab injuries just like USSR coverup of Chernobyl radiation damage", "cleaned_text": "Government coverup of covid jab injuries just like USSR coverup of Chernobyl radiation damage\n\nA few years after the horrific incident occurred, the radioactive fallout from the Chernobyl disaster was discovered by an independent journalist to have been much worse than what governments originally claimed. Today, we are seeing a similar type of mass coverup concerning the health damage caused by Wuhan coronavirus (Covid-19) “vaccines.”\n\nWhat happened back then is similar to what is happening today in that government officials are knowingly playing down the extent to which the immune systems of the “fully vaccinated” are degrading because of the injections. In fact, the official story still maintains that getting jabbed keeps a person protected against serious covid illness.\n\nIn the late 1980s, governments were doing the same thing by framing the Chernobyl disaster in a sanitized manner, using language that made it sound not that bad. It was not until a few brave souls investigated a little deeper and presented their findings publicly did the world learn that Chernobyl radiation was a huge problem that was not going away any time soon. (Related: There are concerns even today that the war in Ukraine might disrupt the now-shuttered Chernobyl plant, spreading “radioactive dust” across Europe.)\n\nThe sudden appearance of “monkeypox” on the world stage is believed by some to be part of the covid jab coverup. There is speculation that the symptoms of so-called monkeypox could actually be covid jab symptoms under a different name.\n\nExposé News, as we reported, is one such source that says monkeypox is little more than “a monumental coverup of the devastating damage done to the immune systems of people who have had the Covid-19 vaccine.” This damage, the news outlet adds, is comparable to AIDS, which is why post-injection immune system degradation is being categorized as vaccine-induced AIDS, or VAIDS.\n\nThe corporate-controlled media, meanwhile, denies any such link between the jabs and immune wasting — or any health damage, for that matter. As far as the establishment is concerned, we are all expected to just believe that covid injections are “safe and effective,” no matter how many bodies pile up at the morgue.\n\nIn the now-defunct USSR, similar tactics were used to keep a lid on the number of sick and dead people who were exposed to Chernobyl radiation post-meltdown. In a classic Soviet coverup, the Chernobyl disaster was painted as a minor oopsie that did not harm people or the planet in any significant way.\n\n“Under the Soviet system, it was quite natural that neither the government of the Soviet Union nor the local authorities were prepared to take legal responsibility for the ecological, social, and other problems caused by Chernobyl – even though Gorbachev’s policies of glasnost and perestroika were already in place,” reports DiaNuke.org.\n\n“However, the scale of the accident and the changes that had taken place in the society by that time made it impossible to conceal the fact of the accident altogether; people in the affected territories repeatedly demanded the introduction of legislation to cover their health problems, ecological damage, and compensation for material losses arising from the accident.”\n\nWill society ever wake up from its stupor of blindly trusting the government?\n\nThere are similar efforts today by some to try to hold the government and the pharmaceutical industry accountable for their crimes against humanity with the imposition of Fauci Flu shots. This time around, however, protections were put in place for the government and the drug industry, and not for the general public.\n\nEvery person who took the covid injections incurred all liability in the event of injury or death. Big Pharma and Big Government are both immune to lawsuits stemming from health damage caused by the shots – and this was fully admitted prior to the introduction of Operation Warp Speed.\n\nThat anyone agreed to take the shots at all under such circumstances illustrates the blind obedience that has consumed public consciousness over the years. As society continues to get dumbed down with relentless chemical and propaganda assaults, the average person is losing the ability and even desire to look at things beyond surface level.\n\nToday, there is a widespread belief that if the government says something is okay, then it must be true – no further probing required. Only a small contingent of society seems to be aware of the fact that Big Brother is not there to help us, and that we must perform our own due diligence to get to the bottom of every matter.\n\nSome 20 years later, the Chernobyl disaster is still the subject of ongoing investigations into what is true and false concerning the radioactive fallout. Many more scientists, ecologists, and others have joined the skeptics club in demanding answers as to precisely how much radiation was and is still being released so that victims can be fairly compensated. Covid jabs, meanwhile, have only been around for less than two years, which means it could take more time before a critical mass wakes up and figures out that we were all lied to.\n\nPerhaps once it becomes undeniably clear that people who took the “clot shots” no longer have a functioning immune system that large numbers of people start demanding answers and a solution. By then, however, it will already be too late for those who got jabbed – but maybe, just maybe, it will spark resistance and revolt against any future plandemics that might come our way.\n\nThe latest news about Wuhan coronavirus (Covid-19) “vaccines” can be found at Vaccines.news", "opengraph": {"title": "Government coverup of covid jab injuries just like USSR coverup of Chernobyl radiation damage", "type": "article", "url": "https://www.collapse.news/2022-07-25-government-coverup-covid-jab-injuries-chernobyl-radiation.html", "site_name": "Collapse News", "description": "A few years after the horrific incident occurred, the radioactive fallout from the Chernobyl disaster was discovered by an independent journalist to have been much worse than what governments originally claimed. Today, we are seeing a similar type of mass coverup concerning the health damage caused by Wuhan coronavirus (Covid-19) “vaccines.” What happened back then […]", "image": "https://www.collapse.news/wp-content/uploads/sites/20/2022/07/VOA_Markosian_-_Chernobyl02.jpg"}, "tags": ["conspiracy", "government", "big government", "COVID", "deception", "coverup", "lies", "corruption", "Censored Science", "sheeple", "vaccine", "immune system", "chemical violence", "Chernobyl", "propaganda", "nuclear", "Censorship", "Collusion", "injuries"], "tweets": [], "movies": [], "links": ["https://www.dianuke.org/secret-chernobyl-documents-expose-the-cover-up/#:~:text=Despite%20the%20changes%20brought%20about%20by%20Mikhail%20Gorbachev%E2%80%99s,the%20result%20was%20far%20greater%20mortality%20and%20suffering.", "https://naturalnews.com/2022-02-25-conflict-chernobyl-spread-radioactive-dust-europe-ukraine.html", "https://naturalnews.com/2022-05-27-monkeypox-coverup-distraction-covid-vaccine-adverse-events.html", "https://www.brighteon.tv", "http://Vaccines.news", "https://www.dianuke.org/secret-chernobyl-documents-expose-the-cover-up/#:~:text=Despite%20the%20changes%20brought%20about%20by%20Mikhail%20Gorbachev%E2%80%99s,the%20result%20was%20far%20greater%20mortality%20and%20suffering.", "https://naturalnews.com/2022-02-25-conflict-chernobyl-spread-radioactive-dust-europe-ukraine.html", "https://naturalnews.com/2022-05-27-monkeypox-coverup-distraction-covid-vaccine-adverse-events.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcollapse%2F2022-07-25-government-coverup-covid-jab-injuries-chernobyl-radiation.html&linkname=Government%20coverup%20of%20covid%20jab%20injuries%20just%20like%20USSR%20coverup%20of%20Chernobyl%20radiation%20damage", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}