{"result_id": "075028", "URL": "https://collapse.news/2021-10-17-are-covid-vaccines-giving-people-aids.html", "timestamp": "2023-04-25 14:47:01 CEST+0200", "meta": {"description": "The latest data from the United Kingdom’s PHE Vaccine Surveillance Report suggests that people who have been “fully vaccinated” for the Wuhan coronavirus (Covid-19) are losing about five percent of their immune systems per week. Doubly injected people between the ages of 40 and 70 have already lost about 40 percent of the immune system […]", "lang": "en", "keywords": "Acquired Immunodeficiency Syndrome,AIDs,badhealth,badmedicine,Collapse,COVID,covid vaccines,fully vaccinated,genocide,immune system,immunity,Plandemic,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://collapse.news/2021-10-17-are-covid-vaccines-giving-people-aids.html", "encoding": "UTF-8"}, "image": null, "domain": "collapse.news", "title": "Are covid “vaccines” giving people AIDS? Immune system functions are dropping around 5% EACH WEEK in those who were vaccinated", "cleaned_text": "Are covid “vaccines” giving people AIDS? Immune system functions are dropping around 5% EACH WEEK in those who were vaccinated\n\nThe latest data from the United Kingdom’s PHE Vaccine Surveillance Report suggests that people who have been “fully vaccinated” for the Wuhan coronavirus (Covid-19) are losing about five percent of their immune systems per week.\n\nDoubly injected people between the ages of 40 and 70 have already lost about 40 percent of the immune system capacity from the moment they get injected. They then progressively lose more of it over time, with peak immune system loss for many expected to arrive by Christmas.\n\n“If this continues then 30-50 year-olds will have 100% immune system degradation, zero viral defence by Christmas and all doubly vaccinated people over 30 will have lost their immune systems by March next year,” reports The Exposé.\n\nThere is no denying, based on the data, that fully vaccinated people now suffer from what appears to be acquired immunodeficiency syndrome, more popularly known as AIDS. Their immune systems are fading away, which many have been warning would be the case.\n\n“People aged 40-69 have already lost 40% of their immune system capability and are losing it progressively at 3.3% to 6.4% per week,” The Exposé says.\n\nInterestingly, the worst-off demographic is people aged 40-49, who are suffering total immune system loss in about nine weeks. The best-off group is younger people aged 18-29, who tend to last around 44 weeks.\n\nElderly people over the age of 80 last about 20 weeks, while the 50-59 age category only gets about 15 weeks. The other remaining age groups last anywhere from 12 to 25 weeks.\n\n“Everybody over 30 will have lost 100% of their entire immune capability (for viruses and certain cancers) within 6 months,” warns The Exposé.\n\n“30-50 year-olds will have lost it by Christmas. These people will then effectively have full blown acquired immunodeficiency syndrome and destroy the NHS (National Health Service).”\n\nGetting a “booster” shot will only speed up the death process\n\nIt is not just that the jabs do not provide the claimed amount of protection against the Fauci Flu. The fact of the matter is that they provide no protection at all in the long term and actually destroy a person’s immune system.\n\n“Pfizer originally claimed a 95% efficiency for their vaccine (calculated as in the last column above). The figures above indicate that their figures may well have been correct immediately after vaccination (the younger age groups have had the vaccine for the shortest time),” The Exposé explains.\n\n“But the figures above also show that the vaccines do NOT merely lose efficiency over time down to zero efficiency, they progressively damage the immune system until a negative efficiency is realised. They presently leave anybody over 30 in a worse position than they were before vaccination.”\n\nPeople who take the Biden “Booster” shots will only accelerate this process by adding even more immune-destroying chemicals to their bodies. The downward spiral will move even faster, in other words, the more shots a person gets.\n\n“If we do nothing about this, it will only get much worse than we ever could have imagined,” wrote one Exposé commenter. “I, for one, appreciate all who have stood against and continue to stand against this tyranny.”\n\n“The spike protein hijacks your mitochondria … forever,” wrote another. “Mitochondria is the heart of your immune system. Essentially, it takes over your immune system. The spike proteins are the bioweapons. Your own immune system becomes a deadly weapon. This is HIV on steroids.”\n\nOthers echoed these same sentiments, noting that it is painfully obvious what the agenda is. How anyone could argue with a straight face that this is all for “public health” remains a mystery.\n\nThe latest news about the Wuhan coronavirus (Covid-19) “vaccine” genocide can be found at ChemicalViolence.com.", "opengraph": {"title": "Are covid “vaccines” giving people AIDS? Immune system functions are dropping around 5% EACH WEEK in those who were vaccinated", "type": "article", "url": "https://www.collapse.news/2021-10-17-are-covid-vaccines-giving-people-aids.html", "site_name": "Collapse News", "description": "The latest data from the United Kingdom’s PHE Vaccine Surveillance Report suggests that people who have been “fully vaccinated” for the Wuhan coronavirus (Covid-19) are losing about five percent of their immune systems per week. Doubly injected people between the ages of 40 and 70 have already lost about 40 percent of the immune system […]", "image": "https://www.collapse.news/wp-content/uploads/sites/20/2021/10/Cheat-Aids-Ancient-Biology-Bone-Coin-Concept.jpg"}, "tags": ["immune system", "covid vaccines", "vaccine wars", "Plandemic", "Collapse", "COVID", "genocide", "vaccines", "Acquired Immunodeficiency Syndrome", "fully vaccinated", "AIDs", "immunity"], "tweets": [], "movies": [], "links": ["https://theexpose.uk/2021/10/10/comparison-reports-proves-vaccinated-developing-ade/", "https://www.naturalnews.com/2020-12-23-covid19-vaccines-could-cause-hiv-infection.html", "https://www.brighteon.tv", "http://chemicalviolence.com", "https://theexpose.uk/2021/10/10/comparison-reports-proves-vaccinated-developing-ade/", "https://www.naturalnews.com/2020-12-23-covid19-vaccines-could-cause-hiv-infection.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcollapse%2F2021-10-17-are-covid-vaccines-giving-people-aids.html&linkname=Are%20covid%20%E2%80%9Cvaccines%E2%80%9D%20giving%20people%20AIDS%3F%20Immune%20system%20functions%20are%20dropping%20around%205%25%20EACH%20WEEK%20in%20those%20who%20were%20vaccinated", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}