{"result_id": "075031", "URL": "https://collapse.news/2023-04-10-forced-vaccination-of-chickens-lab-created-bird-flu-now-imminent.html", "timestamp": "2023-04-25 14:47:02 CEST+0200", "meta": {"description": "Germany and France are screaming that there will be mass shortages of chicken and eggs in the coming months. Hundreds of millions of birds are being slaughtered across the globe. Now the USDA is weighing in on having all US chickens vaccinated for bird flu. If approved, this will be mandatory for all US chickens. […]", "lang": "en", "keywords": "avian flu,badhealth,bill gates,biolabs,bird flu,bird flu vaccines,Censored Science,China Flu,deadly vaccines,Fauci,food supply,gain-of-function,outbreak,pandemic,Plandemic,scamdemic,Ukraine,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://collapse.news/2023-04-10-forced-vaccination-of-chickens-lab-created-bird-flu-now-imminent.html", "encoding": "UTF-8"}, "image": null, "domain": "collapse.news", "title": "Globalist-controlled DEMOLITION of protein supply in full effect as forced vaccination of all chickens for LAB-CREATED BIRD FLU now imminent", "cleaned_text": "Globalist-controlled DEMOLITION of protein supply in full effect as forced vaccination of all chickens for LAB-CREATED BIRD FLU now imminent\n\nGermany and France are screaming that there will be mass shortages of chicken and eggs in the coming months. Hundreds of millions of birds are being slaughtered across the globe. Now the USDA is weighing in on having all US chickens vaccinated for bird flu. If approved, this will be mandatory for all US chickens. Will these so-called “vaccines” contain mRNA, and will this transmit the deadly spike proteins to all humans that consume chicken? This is all part of the supply chain shut down, and the beginning of the end of all chicken and egg farmers who don’t bow down and serve the kings of pharma – Pfizer. Make no mistake, as this is all part of a globalist-controlled demolition of the protein supply, so all humans (non-rich peons) will be forced to eat grub worms and crickets instead of meat and eggs. Get ready for the pandemic of gain-of-function “Bird-Gates-Flu.”\n\nBill Gates’ gain-of-function bird flu being created in biolabs in Ukraine right now\n\nWhen will fake news start the rumor that humans are somehow coming down with bird flu from eating infected chicken from a wet market in China? Manufacturers around the world are hinting that a new strain of avian influenza may jump across the species divide and infect humans, so they are rushing to develop a jab for human bird flu. As H5N1 kills off a record number of birds, according to MSM, there’s an untold story regarding gain of function research that’s being funded by you know who, Bill Gates, via Ukrainian biolabs. Is this the next plandemic the globalists and Fauci are saying is coming soon?\n\nAs mainstream media around the globe is flooded with news about the “worst” bird flu pandemic ever, also be aware that the tests the globalists are using for this are the same FRAUDULENT PCR-based tests they used for the Covid-19 scamdemic, and there’s the rub. The Russians took control of US-NATO-funded biolabs in Ukraine and found research regarding spreading gain-of-function bird-flu via migrating birds to all parts of the world. Realize this is part of the fake meat push, that all humans will be terrified of eating real meat and resort to Franken-meat for dinner, crickets and grub worms for lunch and snacks, and Bill Gates’ zombie eggs for breakfast.\n\nBird-Gates Flu? New York Post publishes sensational headline “Scientists say an apocalyptic bird flu could wipe out half of humanity”\n\nGain of function is a way scientists make animal diseases contagious to humans. This is how Bill Gates and Fraudulent Fauci funded, created, and perpetuated the Covid scamdemic. Now they are researching and funding a new scamdemic using bird flu, and they’re already announcing, while smiling from ear to ear, that it’s coming soon. Now that the Covid scamdemic has come to an end, the globalists need a new one, to secure fake elections and further the global depopulation agenda. Covid wiped out nearly a billion people, mostly due to the deadly clot shot gene therapy injections. That was just the beginning. Get ready for a new gain-of-function virus called… wait for it… Bird-Gates Flu.\n\nBill Gates loves talking about the NEXT pandemic, while pushing toxic vaccines to wipe out minorities in Africa and India. Talk about white supremacy – he’s the “king” of it. It’s no longer a matter of if, but when, the bird flu gain-of-function virus will “escape” from the biolabs and attack the human population, wiping out a few billion folks, using more mRNA “vaccines” to help put the nails in the coffins, literally.\n\nHere’s the narrative that mainstream media and the Chinese Communist Party, that runs Washington DC and Beijing Biden, already started to spread (pun intended): The Hong Kong outbreak of bird flu “started with a three-year-old boy in Hong Kong, whose sore throat and tummy ache turned into a disease that curdled his blood and killed him within a week from acute respiratory and organ failure.” Yes, this is the narrative the whole world will get shoved down their throats to start the next scamdemic before the 2024 POTUS election begins. Get ready for masks, lockdowns, more forced (suicide) vaccinations, and the end of food as you know it.\n\nTune your food news frequency to FoodSupply.news to get updates on more food shortages, toxic meat, and tainted eggs coming to stores near you when the Bird-Gates Flu pandemic begins.", "opengraph": {"title": "Globalist-controlled DEMOLITION of protein supply in full effect as forced vaccination of all chickens for LAB-CREATED BIRD FLU now imminent", "type": "article", "url": "https://www.collapse.news/2023-04-10-forced-vaccination-of-chickens-lab-created-bird-flu-now-imminent.html", "site_name": "Collapse News", "description": "Germany and France are screaming that there will be mass shortages of chicken and eggs in the coming months. Hundreds of millions of birds are being slaughtered across the globe. Now the USDA is weighing in on having all US chickens vaccinated for bird flu. If approved, this will be mandatory for all US chickens. […]", "image": "https://www.collapse.news/wp-content/uploads/sites/20/2023/04/Close-Up-Chicken-Face-Head.jpg"}, "tags": ["pandemic", "China Flu", "Plandemic", "outbreak", "deadly vaccines", "Fauci", "bill gates", "gain-of-function", "bird flu vaccines", "avian flu", "food supply", "scamdemic", "Ukraine", "vaccines", "Censored Science", "biolabs", "bird flu"], "tweets": [], "movies": [], "links": ["https://naturalnews.com/2017-03-25-bird-flu-73000-birds-to-be-slaughtered-in-tennessee.html", "https://rumble.com/v10cg2s-bill-gates-bird-flu-created-in-labs-in-ukraine.html", "https://www.reuters.com/business/healthcare-pharmaceuticals/vaccine-makers-prep-bird-flu-shot-humans-just-case-rich-nations-lock-supplies-2023-03-20/", "https://www.brighteon.tv", "https://rumble.com/v10cg2s-bill-gates-bird-flu-created-in-labs-in-ukraine.html", "https://naturalnews.com/042997_Bill_Gates_zombie_eggs_vegan_foods.html", "https://nypost.com/2020/05/30/apocalyptic-bird-flu-could-wipe-out-half-of-humanity-scientists/", "http://www.foodsupply.news/2022-07-14-farmers-threatened-by-deep-state-governments-corporations.html", "https://www.reuters.com/business/healthcare-pharmaceuticals/vaccine-makers-prep-bird-flu-shot-humans-just-case-rich-nations-lock-supplies-2023-03-20/", "https://rumble.com/v10cg2s-bill-gates-bird-flu-created-in-labs-in-ukraine.html", "https://naturalnews.com/2017-03-25-bird-flu-73000-birds-to-be-slaughtered-in-tennessee.html", "https://nypost.com/2020/05/30/apocalyptic-bird-flu-could-wipe-out-half-of-humanity-scientists/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcollapse%2F2023-04-10-forced-vaccination-of-chickens-lab-created-bird-flu-now-imminent.html&linkname=Globalist-controlled%20DEMOLITION%20of%20protein%20supply%20in%20full%20effect%20as%20forced%20vaccination%20of%20all%20chickens%20for%20LAB-CREATED%20BIRD%20FLU%20now%20imminent", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}