{"result_id": "075003", "URL": "https://collapse.news/2022-02-11-alberta-scraps-covid-passports-lifts-restrictions.html", "timestamp": "2023-04-25 14:46:54 CEST+0200", "meta": {"description": "Premier Jason Kenney of Alberta, Can., has announced that most of the province’s Wuhan coronavirus (Covid-19) restrictions are coming to an end, effective immediately. Not only is Alberta’s covid “vaccine passport” scheme going away, but so are “almost all” of the other restrictions that were imposed, including mask mandates. “Now is the time to begin […]", "lang": "en", "keywords": "Alberta,badhealth,badmedicine,big government,Bubble,Canada,civil war,Collapse,COVID,debt collapse,health freedom,insanity,Liberty,medical fascism,Medical Tyranny,Plandemic,restriction,vaccine passport", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://collapse.news/2022-02-11-alberta-scraps-covid-passports-lifts-restrictions.html", "encoding": "UTF-8"}, "image": null, "domain": "collapse.news", "title": "Alberta to scrap covid vaccine passport scheme, announces plans to lift “almost all” restrictions", "cleaned_text": "Premier Jason Kenney of Alberta, Can., has announced that most of the province’s Wuhan coronavirus (Covid-19) restrictions are coming to an end, effective immediately.\n\nNot only is Alberta’s covid “vaccine passport” scheme going away, but so are “almost all” of the other restrictions that were imposed, including mask mandates.\n\n“Now is the time to begin learning to live with covid,” Kenney said. “These restrictions have led to terrible division. We cannot remain at a heightened state of emergency forever. We have to begin to heal.”\n\nThe first thing to go in Alberta is the Restrictions Exemption Program, this being the official name for its vaccine passport scheme. The next phases will allow children to once again breathe in school.\n\n“It’s time to let kids be kids,” Kenney said, explaining that nearly all restrictions for children are over, including the K-12 mask mandate.\n\nAfter three weeks, authorities will determine if “almost all the remaining restrictions” can be lifted, including the general mask mandate for all age groups and the region’s work-from-home orders.\n\nThe goal, Kenney said, is to have things get back to normal by March 1. (Related: The Alberta government was recently caught fudging the numbers to keep covid going.)\n\nFor the final stage, all restrictions will be lifted and everything will return back to normal, save for the fact that most Albertans have now had their genes permanently modified by the “vaccines.”\n\n“The threat of Covid-19 to public health no longer outweighs the damaging impact of public health restrictions,” Kenney explained. “We are well positioned to live with the virus.”\n\nGovernments aren’t quite telling the truth when they say things are going back to “normal”\n\nJournalist Ezra Levant pointed out in a tweet, however, that not everything is going back to normal as Kenney claims.\n\nAccording to Levant, Kenney is only ending the provincially mandated vaccine passport. The QR codes, he says, will still remain.\n\n“And he will still allow other entities, including private businesses, to discriminate based on those QR codes,” Levant tweeted.\n\nThe other problem is that failed Prime Minister Justin Trudeau has a much different agenda for Canada that involves an even greater descent into tyranny.\n\nA masked Trudeau was seen talking to reporters recently about how he and his regime will remain focused on jab mandates “to avoid further restrictions.”\n\nTrudeau also walked out of a legislative session upon being questioned about his position that the tyranny must continue.\n\nThe trucker Freedom Convoy continues for this very reason, some of it blockading the Ambassador Bridge that connects Windsor, Ont., with Detroit, Mich.\n\nAccording to reports, the auto industry could come to a “screeching halt” this week due to the protests, which aim to stop Trudeau’s requirement that truckers get jabbed for the Fauci Flu in order to continue transporting food and consumer goods.\n\n“We have 38 trucks cross at the Detroit border per day and 16 in Sarnia,” said Robert Wildeboer, executive chairman of Martinrea International Inc.\n\n“Basically, if there’s a shutdown of transportation routes, the auto industry comes to a screeching halt in about two days.”\n\nBrian Kingston, president and CEO of the Canadian Vehicle Manufacturers’ Association, added that a full closure of the Ambassador Bridge “would be catastrophic for the Canadian economy.”\n\n“It’s responsible for approximately 25 percent of our goods trade. It is far and away the most important border crossing between Canada and the U.S.”\n\nUnless the Trudeau regime backs down on all the tyranny, the Freedom Convoy protests are unlikely to subside any time soon. Any resulting economic damage to Canada or the U.S. will be the direct fault of Trudeau for refusing to embrace freedom.\n\nMore related news about the Wuhan coronavirus (Covid-19) can be found at Pandemic.news.", "opengraph": {"title": "Alberta to scrap covid vaccine passport scheme, announces plans to lift “almost all” restrictions", "type": "article", "url": "https://www.collapse.news/2022-02-11-alberta-scraps-covid-passports-lifts-restrictions.html", "site_name": "Collapse News", "description": "Premier Jason Kenney of Alberta, Can., has announced that most of the province’s Wuhan coronavirus (Covid-19) restrictions are coming to an end, effective immediately. Not only is Alberta’s covid “vaccine passport” scheme going away, but so are “almost all” of the other restrictions that were imposed, including mask mandates. “Now is the time to begin […]", "image": "https://www.collapse.news/wp-content/uploads/sites/20/2022/02/Canada-Trucks-Protest.jpg"}, "tags": ["restriction", "big government", "Liberty", "medical fascism", "Bubble", "Collapse", "COVID", "insanity", "debt collapse", "Canada", "Medical Tyranny", "vaccine passport", "Alberta", "health freedom", "Plandemic", "civil war"], "tweets": [], "movies": [], "links": ["https://www.zerohedge.com/geopolitical/freedom-convoy-protests-are-spreading-throughout-world-truckers-lead-fight-against", "https://naturalnews.com/2022-01-25-alberta-deletes-data-56percent-covid-deaths-vaccinated.html", "https://www.brighteon.tv", "http://pandemic.news", "https://www.zerohedge.com/geopolitical/freedom-convoy-protests-are-spreading-throughout-world-truckers-lead-fight-against", "https://naturalnews.com/2022-01-25-alberta-deletes-data-56percent-covid-deaths-vaccinated.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcollapse%2F2022-02-11-alberta-scraps-covid-passports-lifts-restrictions.html&linkname=Alberta%20to%20scrap%20covid%20vaccine%20passport%20scheme%2C%20announces%20plans%20to%20lift%20%E2%80%9Calmost%20all%E2%80%9D%20restrictions", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}