{"result_id": "075008", "URL": "https://collapse.news/2022-03-04-romanian-soccer-club-bans-vaccinated-players-dead.html", "timestamp": "2023-04-25 14:46:56 CEST+0200", "meta": {"description": "The owner of Steaua Bucharest, a Romanian soccer club, has announced that no more covid-vaccinated players are allowed on the team since they tend to “lose power” or “die in hospital.” Gigi Becali, the businessman and politician who runs the team, says that no more vaccinated players are allowed because he is tired of seeing […]", "lang": "en", "keywords": "athletes,ban,banned,COVID,dead,heart attacks,Plandemic,Romania,soccer club,spike protein,vaccinated,Vaccine deaths,vaccine injury,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://collapse.news/2022-03-04-romanian-soccer-club-bans-vaccinated-players-dead.html", "encoding": "UTF-8"}, "image": null, "domain": "collapse.news", "title": "Romania’s largest soccer club bans vaccinated players because they keep dropping dead", "cleaned_text": "Romania’s largest soccer club bans vaccinated players because they keep dropping dead\n\nThe owner of Steaua Bucharest, a Romanian soccer club, has announced that no more covid-vaccinated players are allowed on the team since they tend to “lose power” or “die in hospital.”\n\nGigi Becali, the businessman and politician who runs the team, says that no more vaccinated players are allowed because he is tired of seeing otherwise great players turn weak or die. At best, they become shells of their former selves, and he can no longer stand it.\n\nSeveral players on rival teams such as CFR Cluj and Rapid Bucuresti have also been struggling or have died because of getting injected, he says. One of them is 36-year-old winger Ciprian Deac.\n\n“You’re going to laugh, but I might be right,” Becali said to Romanian journalist Emanuel Rosu. “Those vaccinated lose their strength. That’s something scientific.”\n\n“Haven’t you seen it at CFR? With Rapid, the players seemed to be fainting. They slept on the ground. All vaccinated people lose their strength! I also see mine, the vaccinated ones. It doesn’t affect some, but it does affect those who are older. Haven’t you seen Deac? There is no more storm.”\n\nRomanian government condemns Becali, says footballers do not lose strength after getting jabbed\n\nAnother player, Steaua Bucharest striker Claudiu Keseru, returned to the club back in August after six years at the Bulgarian outfit Ludogorets. Since he, too, got vaccinated, he is no longer able to play at the same high level as he did before.\n\n“I gave him the money, I had a contract with him, he was a football player, I was the owner,” Becali said to Sport.ro about Keseru’s return to the team.\n\n“I said, ‘You can’t go to this level anymore. You can play in Romania, but not at FCSB (Steaua Bucharest) and CFR!’ He said he would show me, but he has nothing to show me. It can’t be at this level anymore. It’s possible because of the vaccine. I say what I think. I don’t want to offend him.”\n\nThe Romanian government reacted to Becali’s statements with condemnation, declaring without evidence on its official Facebook page that:\n\n“Vaccinated footballers do NOT lose their strength after being vaccinated against COVID-19!\n\nFrom a medical and scientific point of view, there are no studies that would support a singularity like the one recently promoted on Facebook accounts in Romania.\n\nVaccination against COVID-19 does not affect the performance of football players. In contrast, there are enough studies showing that going through SARS CoV-2 infection leaves long-term sequelae (Long COVID), and these can influence athletes’ performance.”\n\nRosu also says that Becali has a policy on his team that only people that fake getting vaccinated are allowed to play, that way their strength is confirmed. However, according to reports, Rosu’s claim remains unconfirmed.\n\nIn the comment section at Newspunch, one person wrote that one of the goals of the plandemic injection scam is to “make mice of young healthy men, the type who might create revolution for a long time.”\n\nThis same commenter added that they have been demasculinized with all sorts of things, including mind control. The United States especially has also faced many decades of seeing men be disempowered and women empowered, and their roles reversed at every level of family and society.\n\nThe inevitable outcome of America’s perpetual feminization, which occurs in the social, economic and even religious realm, is that society is now largely a passive, compliant freak show. And all the while, the strongest among us, including athletes and those in the military, are being systematically taken out through “science” and “medicine.”\n\nMore Fauci Flu shot news can be found at ChemicalViolence.com.", "opengraph": {"title": "Romania’s largest soccer club bans vaccinated players because they keep dropping dead", "type": "article", "url": "https://www.collapse.news/2022-03-04-romanian-soccer-club-bans-vaccinated-players-dead.html", "site_name": "Collapse News", "description": "The owner of Steaua Bucharest, a Romanian soccer club, has announced that no more covid-vaccinated players are allowed on the team since they tend to “lose power” or “die in hospital.” Gigi Becali, the businessman and politician who runs the team, says that no more vaccinated players are allowed because he is tired of seeing […]", "image": "https://www.collapse.news/wp-content/uploads/sites/20/2022/03/Freestyle-Football-Soccer-Active-Art-Association-Attack.jpg"}, "tags": ["vaccinated", "heart attacks", "Vaccine deaths", "ban", "banned", "COVID", "vaccine injury", "vaccines", "spike protein", "soccer club", "dead", "athletes", "Romania", "Plandemic"], "tweets": [], "movies": [], "links": ["https://newspunch.com/romanias-biggest-soccer-club-bans-vaccinated-players-because-they-keep-dropping-dead/", "https://www.brighteon.tv", "https://www.naturalnews.com/2022-02-25-emails-trump-global-racketeering-collusion-covid-vaccines.html", "http://chemicalviolence.com", "https://newspunch.com/romanias-biggest-soccer-club-bans-vaccinated-players-because-they-keep-dropping-dead/", "https://www.naturalnews.com/2022-02-25-emails-trump-global-racketeering-collusion-covid-vaccines.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcollapse%2F2022-03-04-romanian-soccer-club-bans-vaccinated-players-dead.html&linkname=Romania%E2%80%99s%20largest%20soccer%20club%20bans%20vaccinated%20players%20because%20they%20keep%20dropping%20dead", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}