{"result_id": "075029", "URL": "https://collapse.news/2023-03-14-taxpayers-fund-censorship-vaccine-injuries-deaths.html", "timestamp": "2023-04-25 14:47:01 CEST+0200", "meta": {"description": "Another major Twitter Files bombshell has dropped showing how a foreign dark money group called the Center for Countering Digital Hate (CCDH) oversees a “vast censorship enterprise” that, among other things, works behind the scenes to hide the deadly truth about vaccines from the public. CCDH is just one cog in a much larger wheel […]", "lang": "en", "keywords": "Big Tech,CCDH,Censorship,Center for Countering Digital Hate,Collusion,conspiracy,deaths,deception,disinfo,Financial Times,First Amendment,free press,Glitch,health freedom,injuries,media fact watch,outrage,propaganda,real investifations,speech police,taxpayers,technocrats,thought police,truth,Twitter Files,vaccine", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://collapse.news/2023-03-14-taxpayers-fund-censorship-vaccine-injuries-deaths.html", "encoding": "UTF-8"}, "image": null, "domain": "collapse.news", "title": "Twitter Files BOMBSHELL: Taxpayers unknowingly fund “vast censorship enterprise” hiding truth about vaccine injuries, deaths", "cleaned_text": "Another major Twitter Files bombshell has dropped showing how a foreign dark money group called the Center for Countering Digital Hate (CCDH) oversees a “vast censorship enterprise” that, among other things, works behind the scenes to hide the deadly truth about vaccines from the public.\n\nCCDH is just one cog in a much larger wheel of censorship that aims to silence all true stories and content about injuries and deaths caused specifically by Wuhan coronavirus (Covid-19) “vaccines” – and particularly the experimental mRNA (messenger RNA) varieties from Pfizer-BioNTech and Moderna.\n\nThe Financial Times (FT) is also involved, having at one point threatened Twitter to provide a “steer” on whether the so-called “disinformation dozen” – more on that below – should be deleted from its platform for spreading “misinformation” and “disinformation.”\n\n“In a report embargoed for tomorrow, the Center for Countering Digital Hate is urging Twitter and other platforms (Facebook, Google) to ban the accounts of twelve people which it has found are responsible for around two-thirds of online anti-vaccine content,” reads an email from Hannah Murphy of FT to Katie Rosborough and Liz Kelley over at Twitter.\n\n“The CCDH has said that by not doing so, the platforms are failing to enforce their policies … Does Twitter have any comment? Would these accounts not meet the bar for banning under your new strike system? … Welcoming any steer by the end of the day.”\n\nMurphy named the following 12 entities as the worst “offenders,” from her point of view, in terms of misinformation spread:\n\nThe clear message from Murphy’s correspondence is: delete these people or else. And that is exactly what Twitter did, with GreenMedInfo (run by Sayer Ji) losing its 13-year-old Twitter account just two weeks after Ji personally called out the CCDH for publishing a digital hit list with his name on it.\n\nCCDH’s campaign to de-platform 12 American citizens based on “faulty narrative, without evidence”\n\nIt turns out that the criteria the CCDH used to compile its “disinformation dozen” digital hit list was based entirely on a faulty narrative that lacks any evidence of wrongdoing. Murphy, FT, and the CCDH simply identified popular people they do not like or agree with and falsely accused them of violating social media rules.\n\nIt was Aug. 18, 2021, when Facebook’s VP of Content Policy revealed that the statistics used by the CCDH to compile its list were inaccurate by “an astronomical margin of 300 fold,” to quote Ji.\n\n“It should be noted that not a single retraction or correction from CCDH, a government agency, nor several thousand media outlets has occurred since this came to light,” Ji writes.\n\nIt turns out that the CCDH and FT are just the tip of the iceberg. As discovered by four-time New York Times bestselling author and American journalist Matt Taibbi via the Twitter Files, there is actually a massive “censorship industrial complex,” as he calls it, that includes the U.S. government, various non-governmental organizations (NGOs), and the commercial media, all of which conspired with one another to deprive countless U.S. citizens of their First Amendment rights.\n\nJust a few days ago on March 9, Taibbi testified before the House Judiciary Committee about this vast censorship industrial complex during the Hearing on the Weaponization of the Federal Government on the Twitter Files.\n\n“We learned Twitter, Facebook, Google, and other companies developed a formal system for taking in moderation ‘requests’ from every corner of government: the FBI, DHS, HHS, DOD, the Global Engagement Center at State, even the CIA,” Taibbi said.\n\n“For every government agency scanning Twitter, there were perhaps 20 quasi-private entities doing the same, including Stanford’s Election Integrity Project, Newsguard, the Global Disinformation Index, and others, many taxpayer-funded.”\n\nTaibbi went on to describe how this “fast-growing network” was keeping itself busy compiling lists of people whose opinions, beliefs, associations, and / or sympathies “are deemed ‘misinformation,’ ‘disinformation,’ ‘or malinformation,'” the latter term simply being a euphemism for “true but inconvenient” information.\n\n“Undeniably, the making of such lists is a form of digital McCarthyism,” Taibbi correctly pointed out.\n\n“Ordinary Americans are not just being reported to Twitter for ‘deamplification’ or de-platforming, but to firms like PayPal, digital advertisers like Xandr, and crowdfunding sites like GoFundMe. These companies can and do refuse service to law-abiding people and businesses whose only crime is falling afoul of a distant, faceless, unaccountable, algorithmic judge.”\n\nKeep in mind that Taibbi grew up as “a traditional ACLU liberal” – these were his own words at the hearing. And even he his horrified by what he has discovered in the Twitter Files, which implicate both the government and the private sector – and the NGOs in between – for colluding to deprive Americans of their free speech rights online.\n\n“If Twitter declined to remove an account right away, government agencies and NGOs would call reporters for the New York Times, Washington Post, and other outlets, who in turn would call Twitter demanding to know why action had not been taken,” Taibbi further revealed at the hearing.\n\n“Effectively, news media became an arm of a state-sponsored thought-policing system.”\n\nThe latest news about Big Pharma’s murder-by-drugs crusade can be found at BadMedicine.news.", "opengraph": {"title": "Twitter Files BOMBSHELL: Taxpayers unknowingly fund “vast censorship enterprise” hiding truth about vaccine injuries, deaths", "type": "article", "url": "https://www.collapse.news/2023-03-14-taxpayers-fund-censorship-vaccine-injuries-deaths.html", "site_name": "Collapse News", "description": "Another major Twitter Files bombshell has dropped showing how a foreign dark money group called the Center for Countering Digital Hate (CCDH) oversees a “vast censorship enterprise” that, among other things, works behind the scenes to hide the deadly truth about vaccines from the public. CCDH is just one cog in a much larger wheel […]", "image": "https://www.collapse.news/wp-content/uploads/sites/20/2023/03/Doctor-Mask-Close-Up-Covid-19-Vial-Vaccine.jpg"}, "tags": ["conspiracy", "speech police", "deception", "real investifations", "Center for Countering Digital Hate", "technocrats", "vaccine", "First Amendment", "truth", "Twitter Files", "disinfo", "propaganda", "media fact watch", "Big Tech", "Financial Times", "health freedom", "taxpayers", "free press", "thought police", "outrage", "Glitch", "CCDH", "Censorship", "Collusion", "injuries", "deaths"], "tweets": [], "movies": [], "links": ["https://greenmedinfo.com/blog/breaking-vast-censorship-enterprise-funded-taxpayers-knowingly-suppressed-vaccine", "https://www.brighteon.tv", "https://www.naturalnews.com/2023-02-12-2025-humanity-bug-eating-transgenders-transhumanist-computer.html", "http://badmedicine.news", "https://greenmedinfo.com/blog/breaking-vast-censorship-enterprise-funded-taxpayers-knowingly-suppressed-vaccine", "https://www.naturalnews.com/2023-02-12-2025-humanity-bug-eating-transgenders-transhumanist-computer.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcollapse%2F2023-03-14-taxpayers-fund-censorship-vaccine-injuries-deaths.html&linkname=Twitter%20Files%20BOMBSHELL%3A%20Taxpayers%20unknowingly%20fund%20%E2%80%9Cvast%20censorship%20enterprise%E2%80%9D%20hiding%20truth%20about%20vaccine%20injuries%2C%20deaths", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}