{"result_id": "075010", "URL": "https://collapse.news/2021-09-16-bidens-vax-mandate-could-collapse-trucking-supply-lines.html", "timestamp": "2023-04-25 14:46:56 CEST+0200", "meta": {"description": "The Joe Biden regime continues to threaten the health, livelihood and freedom of Americans. Biden’s seditious vaccine mandates could collapse the trucking industry and threaten supply lines across the Nation. Approximately 3.5 million truckers have been traveling the nation since the beginning of the covid-19 scandal, shipping valuable food, construction, agricultural and medical supplies. Just […]", "lang": "en", "keywords": "abuse,abuse of power,body autonomy,Collapse,constitutional law,control,discrimination,economy,famine,food supply,fragile mentality,groceries,individual rights,Marxism,OSHA,panic,power grab,Resistance,risk,sabotage,SHTF,starvation,trucking industry", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://collapse.news/2021-09-16-bidens-vax-mandate-could-collapse-trucking-supply-lines.html", "encoding": "UTF-8"}, "image": null, "domain": "collapse.news", "title": "Biden’s vax mandate could collapse trucking supply lines, leading to instant shortages of food, fuel and medicines", "cleaned_text": "Biden’s vax mandate could collapse trucking supply lines, leading to instant shortages of food, fuel and medicines\n\nThe Joe Biden regime continues to threaten the health, livelihood and freedom of Americans. Biden’s seditious vaccine mandates could collapse the trucking industry and threaten supply lines across the Nation. Approximately 3.5 million truckers have been traveling the nation since the beginning of the covid-19 scandal, shipping valuable food, construction, agricultural and medical supplies. Just a year ago, these men and women were lauded as “essential workers” and praised for all that they do. Today, the Biden regime is threatening to put hundreds of thousands of truckers out of work, as the federal government prepares a coercive vaccine mandate on their bodies.\n\nWill OSHA be converted to a Marxist organization and be weaponized against Americans?\n\nIf the Biden regime gets its way, they will force the Occupational Safety and Health Administration (OSHA) to create sweeping new medical edicts that require truck drivers, along with the overwhelming majority of American employees, to get COVID-19 injections or face stiff penalties.\n\nSmall trucking companies (ones that run 1,000 or fewer trucks) may buckle under all the new OSHA and Federal Motor Carrier Safety Administration regulations which only discriminate against and push out reliable employees. These companies operate under small margins and cannot afford to have trucks sitting idle. Many truckers won’t comply if covid-19 vaccines become a requirement to pass a physical medical exam every two years. The Department of Transportation already requires that truckers take tests for diabetes and hypertension. The Department mandates prescription drugs and yearly checkups if truckers do not pass the tests.\n\nThese truck drivers don’t want the government to dictate any more of their medical decisions, especially if the medical intervention is needless and puts their health at risk. They may have moral objections to the technology. They may have a medical history of vaccine injury. They might be at low risk to the advertised infection and may already have natural immunity — a scientific reality that is ignored by vaccine mandates.\n\nThe U.S. economy is being sabotaged, as Marxists force Americans to surrender their basic body autonomy rights\n\nIt appears that the Biden regime is already preparing the National Guard to take over many of the jobs that he is taking away from everyday Americans. If the regime is successful at eliminating truckers, trucking and supply lines may soon be controlled by the military, as shortages, item limits and food lines become commonplace across American cities.\n\nFor more than a year, the country has been sabotaged by a fraudulent covid-19 testing program that is used to lock people in their homes, to surveil people’s lives through contact tracing, and to deprive individuals of their rights. These fraudulent testing programs have repeatedly shuttered entire businesses and industries over a single case of illness, an “exposure,” or a fraudulent test result. This sabotage was carried out in the name of “safety” as more people acquiesced to mental fragility — living in a constant state of seeking permission and expecting disease.\n\nFor much of 2020 and 2021, the U.S. Treasury was used to implement Marxist plans. Americans were paid large sums of money to stay on unemployment. For much of 2020, businesses had a hard time paying people. Now these federal unemployment programs are coming to an end, as the federal government threatens to discriminate against millions of people and force them onto unemployment. The next time Joe Biden brags about “creating jobs” – remember how his regime paid people not to work and forced millions of innocent Americans to be fired without pay.\n\nJoe Biden’s forceful medical edicts and vaccine mandates are not rooted in statutory law, let alone Constitutional law. White House Press Secretary Jen Psaki held a press conference bragging that the vaccine mandates increased vaccine uptake throughout corporate America. Using coercion and treating people like property is not admirable or ethical.\n\nAmericans are at a critical juncture, one that will decide the future of the republic. Will the United States remain a nation of laws, governed by the Constitution, or will the nation be overtaken by liars, thieves and murderers, governed by those who seek absolute power and control?", "opengraph": {"title": "Biden’s vax mandate could collapse trucking supply lines, leading to instant shortages of food, fuel and medicines", "type": "article", "url": "https://www.collapse.news/2021-09-16-bidens-vax-mandate-could-collapse-trucking-supply-lines.html", "site_name": "Collapse News", "description": "The Joe Biden regime continues to threaten the health, livelihood and freedom of Americans. Biden’s seditious vaccine mandates could collapse the trucking industry and threaten supply lines across the Nation. Approximately 3.5 million truckers have been traveling the nation since the beginning of the covid-19 scandal, shipping valuable food, construction, agricultural and medical supplies. Just […]", "image": "https://www.collapse.news/wp-content/uploads/sites/20/2022/04/Semi-Round-Gas.jpg"}, "tags": ["body autonomy", "starvation", "sabotage", "power grab", "panic", "discrimination", "abuse of power", "abuse", "famine", "groceries", "SHTF", "individual rights", "control", "OSHA", "Marxism", "economy", "fragile mentality", "trucking industry", "Collapse", "constitutional law", "risk", "food supply", "Resistance"], "tweets": [], "movies": [], "links": ["https://thefederalist.com/2021/09/14/if-truckers-like-me-wont-comply-bidens-vaccine-mandate-could-tank-the-economy/", "https://www.hhs.gov/conscience/complaints/filing-a-complaint/index.html", "https://www.brighteon.tv", "https://www.cdc.gov/vaccines/covid-19/clinical-considerations/myocarditis.html", "https://www.npr.org/2021/09/15/1037307027/massachusetts-calls-national-guard-school-bus-driver-shortage-baker", "https://thenewamerican.com/bidens-draconian-covid-executive-orders-are-unconstitutional/", "http://constitution.news", "http://evil.news", "https://thefederalist.com/2021/09/14/if-truckers-like-me-wont-comply-bidens-vaccine-mandate-could-tank-the-economy/", "https://www.hhs.gov/conscience/complaints/filing-a-complaint/index.html", "https://www.cdc.gov/vaccines/covid-19/clinical-considerations/myocarditis.html", "https://www.npr.org/2021/09/15/1037307027/massachusetts-calls-national-guard-school-bus-driver-shortage-baker", "https://thenewamerican.com/bidens-draconian-covid-executive-orders-are-unconstitutional/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcollapse%2F2021-09-16-bidens-vax-mandate-could-collapse-trucking-supply-lines.html&linkname=Biden%E2%80%99s%20vax%20mandate%20could%20collapse%20trucking%20supply%20lines%2C%20leading%20to%20instant%20shortages%20of%20food%2C%20fuel%20and%20medicines", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}