{"result_id": "075030", "URL": "https://collapse.news/2022-01-25-ghost-world-audiobook-how-to-survive-the-post-vaccine-die-off-and-radical-economic-fracturing.html", "timestamp": "2023-04-25 14:47:01 CEST+0200", "meta": {"description": "Our latest free, downloadable audio book is called, “Ghost World: 2022 – 2032” and it is available now at GhostWorld.co Here’s an overview of what the book delivers: Chapter 1 – The Die-Off Death projections, WHO will be dying and WHERE the deaths will occur. (Hint: largely in blue cities / Democrat strongholds and among […]", "lang": "en", "keywords": "chaos,cities,Collapse,depopulation,Die Off,economic collapse,economics,genocide,Ghost World,medical fascism,predictions,prepping,risk,survival,Tyranny,Vaccine deaths,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://collapse.news/2022-01-25-ghost-world-audiobook-how-to-survive-the-post-vaccine-die-off-and-radical-economic-fracturing.html", "encoding": "UTF-8"}, "image": null, "domain": "collapse.news", "title": "Ghost World audiobook now available for download: How to survive the post-vaccine die-off and radical economic fracturing – full download of MP3 files and PDF transcript", "cleaned_text": "Ghost World audiobook now available for download: How to survive the post-vaccine die-off and radical economic fracturing – full download of MP3 files and PDF transcript\n\nOur latest free, downloadable audio book is called, “Ghost World: 2022 – 2032” and it is available now at GhostWorld.co\n\nHere’s an overview of what the book delivers:\n\nDeath projections, WHO will be dying and WHERE the deaths will occur. (Hint: largely in blue cities / Democrat strongholds and among certain high-vax professions such as doctors and schoolteachers.)\n\nWhat will happen to upcoming elections (if they even take place) after the Democrat-heavy die-off from vaccines? Blue states will lose census numbers, but Democrats are replacing their own dead voters with illegal immigrants as “replacements.”\n\nAnalysis of what happens to the stock market, gold and silver, real estate, supply chains, food supplies and more. Prepare for the most severe disruptions of your life.\n\nHow to maintain the ability to provide value in a collapsed society – barter, trade, production, currencies and the mass decentralization of economic power. The rise of the secondhand economy and repair professions, salvage operations and more.\n\nWhat will happen to the culture as the die-off accelerates? The rule of law, local self-governance, fertility and more.\n\nA detailed look at what items will be in excess supply as the die-off accelerates: Used cars, homes, firearms, clothing, etc. What will be scarce? Vehicle tires, fossil fuels, electronics parts, labor resources and more.\n\nWhere this all leads as the global population collapse takes its course. The elimination of the obedient, brainwashed masses; global government and its control systems and much more.\n\nGet the full, free, instant download at GhostWorld.co\n\nDownload all the MP3 files to your local devices or computers. This way, they cannot censor this book since you will have the “hard” files yourself. Feel free to re-post the MP3s on other platforms or channels. Help spread the word.\n\nWhat will unfold as the vaccine genocide accelerates\n\nTrending post-vaccination death rates show that at least one-third of those who are vaccinated will die over the next decade. With multiple “booster” shots administered, as much as half the global population could be eliminated via vaccines (due to so-called “non-covid” deaths that the media will blame on a lack of medical staffing).\n\nThat’s because these “vaccines” are deliberate depopulation bioweapons, and they are being forced onto the population by globalists who believe they are saving the planet by urgently reducing the human footprint on Earth’s resources. They are convinced this will bring the planet back from the brink of ecological collapse.\n\nEach day, 30 million more human beings are vaccinated with gene-altering, cancer-causing covid “vaccines.” (Source: OurWorldInData.org) That means 10 million more people are condemned to death by lethal injection each day. If this rate of mass vaccination continues through early 2023, it will mean that over half the world’s population could be dead by the end of 2032, given the increased mortality rates we are seeing in early 2022.\n\nThis mass die-off will have catastrophic consequences on human civilization. Blue cities with high vaccination rates will collapse into “Mad Max” conditions. Stock markets will collapse. Nations will fall. War will erupt. Mass starvation, famine, lawlessness and violence will become the norm in many areas. This could be the end of civilization as we know it.\n\nIn many blue cities, the homes and apartments of the dead will be auctioned off to “salvage teams” who will reclaim used appliances, clothing, firearms and will even strip the copper wire out of entire neighborhoods due to the skyrocketing value of practical metals.\n\nBut survivors will gather in rural areas of America and other nations. Red states — “free states” — will launch their own currencies, and in many areas, open commerce and the rebuilding of America will thrive.\n\nGhost World 2022 – 2032 reveals the blueprint of how all this is going to look and how you and your family can survive the global turmoil (and mass genocide) that has already been unleashed.\n\nThe book is free to download right now. You can download the audio MP3 files and printable PDF file for a hardcopy transcript of the entire book (perfect for the hearing impaired).\n\nGet it now at GhostWorld.co\n\nAnd check out all my free, downloadable audiobooks at https://audiobooks.naturalnews.com\n• Battlefield America – An interview series with Steve Quayle (the website, when ready, will be BattlefieldAmerica.co)\n• Resilient Prepping – How to create low-tech, off-grid preparedness and survival solutions for every area of your life (the website, when ready, will be ResilientPrepping.com)\n\nThank you for your support. Stay informed and stay alive. The future of humanity needs you.", "opengraph": {"title": "Ghost World audiobook now available for download: How to survive the post-vaccine die-off and radical economic fracturing – full download of MP3 files and PDF transcript", "type": "article", "url": "https://www.collapse.news/2022-01-25-ghost-world-audiobook-how-to-survive-the-post-vaccine-die-off-and-radical-economic-fracturing.html", "site_name": "Collapse News", "description": "Our latest free, downloadable audio book is called, “Ghost World: 2022 – 2032” and it is available now at GhostWorld.co Here’s an overview of what the book delivers: Chapter 1 – The Die-Off Death projections, WHO will be dying and WHERE the deaths will occur. (Hint: largely in blue cities / Democrat strongholds and among […]", "image": "https://www.collapse.news/wp-content/uploads/sites/20/2022/01/Ghost-World-cover-feature.png"}, "tags": ["chaos", "prepping", "vaccine wars", "medical fascism", "survival", "Die Off", "Vaccine deaths", "Collapse", "economics", "risk", "genocide", "depopulation", "economic collapse", "cities", "vaccines", "predictions", "Ghost World", "Tyranny"], "tweets": [], "movies": [], "links": ["http://GhostWorld.co", "https://www.brighteon.tv", "http://GhostWorld.co", "http://Brighteon.com/2a7fbd72-9868-4e7a-991f-353809de608a", "https://ourworldindata.org/covid-vaccinations", "http://GhostWorld.co", "https://audiobooks.naturalnews.com", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcollapse%2F2022-01-25-ghost-world-audiobook-how-to-survive-the-post-vaccine-die-off-and-radical-economic-fracturing.html&linkname=Ghost%20World%20audiobook%20now%20available%20for%20download%3A%20How%20to%20survive%20the%20post-vaccine%20die-off%20and%20radical%20economic%20fracturing%20%E2%80%93%20full%20download%20of%20MP3%20files%20and%20PDF%20transcript", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}