{"result_id": "075001", "URL": "https://collapse.news/2022-02-09-pentagon-dmed-data-proves-disease-military-covid-vaccines.html", "timestamp": "2023-04-25 14:46:54 CEST+0200", "meta": {"description": "The United States military’s official database for vaccine adverse events is overflowing with evidence to show a massive uptick in serious illnesses due to Wuhan coronavirus (Covid-19) injections. The Defense Medical Epidemiology Database, or DMED for short, clearly reveals a spike in major diseases beginning in 2021 right after Donald Trump unveiled the jabs under […]", "lang": "en", "keywords": "COVID,DMED,military,Pentagon,Plandemic,ron johnson,smoking gun,soldiers,Thomas Renz,Vaccine deaths,vaccine injury,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://collapse.news/2022-02-09-pentagon-dmed-data-proves-disease-military-covid-vaccines.html", "encoding": "UTF-8"}, "image": null, "domain": "collapse.news", "title": "SMOKING GUN: Pentagon’s DMED data proves that skyrocketing disease rates in military servicemen caused by covid “vaccines”", "cleaned_text": "SMOKING GUN: Pentagon’s DMED data proves that skyrocketing disease rates in military servicemen caused by covid “vaccines”\n\nThe United States military’s official database for vaccine adverse events is overflowing with evidence to show a massive uptick in serious illnesses due to Wuhan coronavirus (Covid-19) injections.\n\nThe Defense Medical Epidemiology Database, or DMED for short, clearly reveals a spike in major diseases beginning in 2021 right after Donald Trump unveiled the jabs under Operation Warp Speed.\n\nThe Department of Defense (DoD), which maintains DMED, claims that this sudden increase in post-injection illnesses is just a coincidental “error” that has now been “corrected,” but this is a highly unlikely story.\n\nThe truth is that this information was never supposed to get out in the first place, which is why the corporate-controlled media has been instructed not to touch the DMED story at all.\n\nIt is getting out there, though, and it is damning. Sickness in the military is on the rise like perhaps never before, and the only thing that has changed is that servicemen are now being forced to take these experimental shots.\n\nOn February 1, Sen. Ron Johnson (R-Wisc.) sent a letter to Secretary of Defense Lloyd Austin highlighting the latest DMED data, which clearly shows that the shots are anything but “safe and effective.”\n\n“Essentially, it is the official database of the 1.4M active duty DoD servicemen,” explains Steve Kirsch on his Substack.\n\nDMED is about as reliable as it gets\n\nKirsch says that there are 14 reasons why this data is very important, one of them being that the DMED database is heavily verified for accuracy since it is not a self-reported database.\n\n“Unlike VAERS, this database cannot be dismissed using hand-waving arguments,” Kirsch writes.\n\n“It is a fully reported database where all the reports are from healthcare providers. In short, if the vaccines are safe, the DMED data is hard to explain. For example, you can’t pin the rise in events in 2021 on COVID since total hospital event rates declined in 2020 (relative to 2019) in both the original and corrected results.”\n\nAnother thing is the fact that the increases demonstrated in DMED are absolute rather than relative. Kirsch explains it like this:\n\n“In VAERS, we’ll often compare a baseline rate of an event in prior years with the current year to look for a signal. This is a ‘differential signal’ so high values are possible. For example, the reported VAERS rate for pulmonary embolism is 3 per year. Say it goes to 300 per year, a 100X jump. But if the baseline rates of PE are 1000, then on an absolute basis, this is just a 0.3X increase. So large absolute number jumps are very significant. This is exactly what we have in the DMED database: very large absolute jumps.”\n\nAnother relevant factor is that all of the symptoms with notable increases in the DMED match the data in VAERS (Vaccine Adverse Event Reporting System). VAERS is almost a type of peer review for the DMED, affirming its data points.\n\nPerhaps the most damning aspect of the DMED data is that the DoD is in a panic about its revelations. The government has been working overtime to keep the whole thing contained, but the cat is already out of the bag.\n\n“The military can’t effectively refute it,” Kirsch says. “After being confronted with the data, they now claim the 2016 to 2020 data was wrong. The problem is their new numbers are nonsensical.”\n\nThe government claims that upwards of 93 percent of the military is now vaccinated, though Kirsch estimates that the true number is 85 percent. In either case, the jabs are not treating our servicemen well.\n\nThe latest news about Wuhan coronavirus (Covid-19) “vaccine” injuries and deaths can be found at ChemicalViolence.com.", "opengraph": {"title": "SMOKING GUN: Pentagon’s DMED data proves that skyrocketing disease rates in military servicemen caused by covid “vaccines”", "type": "article", "url": "https://www.collapse.news/2022-02-09-pentagon-dmed-data-proves-disease-military-covid-vaccines.html", "site_name": "Collapse News", "description": "The United States military’s official database for vaccine adverse events is overflowing with evidence to show a massive uptick in serious illnesses due to Wuhan coronavirus (Covid-19) injections. The Defense Medical Epidemiology Database, or DMED for short, clearly reveals a spike in major diseases beginning in 2021 right after Donald Trump unveiled the jabs under […]", "image": "https://www.collapse.news/wp-content/uploads/sites/20/2022/02/Army-Force-Military-British-Soldier-Ops-Battlefield.jpg"}, "tags": ["DMED", "soldiers", "smoking gun", "Thomas Renz", "Vaccine deaths", "COVID", "ron johnson", "vaccine injury", "vaccines", "Pentagon", "Plandemic", "military"], "tweets": [], "movies": [], "links": ["https://stevekirsch.substack.com/p/this-medical-data-from-the-us-dod", "https://naturalnews.com/2022-02-02-dod-database-military-illnesses-skyrocketing-covid-jabs.html", "https://www.brighteon.tv", "http://chemicalviolence.com", "https://stevekirsch.substack.com/p/this-medical-data-from-the-us-dod", "https://naturalnews.com/2022-02-02-dod-database-military-illnesses-skyrocketing-covid-jabs.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcollapse%2F2022-02-09-pentagon-dmed-data-proves-disease-military-covid-vaccines.html&linkname=SMOKING%20GUN%3A%20Pentagon%E2%80%99s%20DMED%20data%20proves%20that%20skyrocketing%20disease%20rates%20in%20military%20servicemen%20caused%20by%20covid%20%E2%80%9Cvaccines%E2%80%9D", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}