{"result_id": "075007", "URL": "https://collapse.news/2021-09-28-nurses-union-canada-vaccine-mandate-staffing-shortage.html", "timestamp": "2023-04-25 14:46:55 CEST+0200", "meta": {"description": "The British Columbia Nurses’ Union (BCNU) has warned the provincial government of British Columbia in Canada that instituting a Wuhan coronavirus (COVID-19) vaccine mandate for healthcare workers would force members to leave the industry, exacerbating the province’s ongoing staffing shortage. The BCNU, established in 1981, represents more than 48,000 professional nurses and other healthcare workers […]", "lang": "en", "keywords": "badhealth,badmedicine,British Columbia,Canada,coronavirus vaccines,covid-19,health freedom,medical fascism,medical staff shortage,Medical Tyranny,nurses,pandemic,vaccine mandate,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://collapse.news/2021-09-28-nurses-union-canada-vaccine-mandate-staffing-shortage.html", "encoding": "UTF-8"}, "image": null, "domain": "collapse.news", "title": "Nurses union in Canada warns COVID-19 vaccine mandates will lead to extreme staffing shortage", "cleaned_text": "Nurses union in Canada warns COVID-19 vaccine mandates will lead to extreme staffing shortage\n\nThe British Columbia Nurses’ Union (BCNU) has warned the provincial government of British Columbia in Canada that instituting a Wuhan coronavirus (COVID-19) vaccine mandate for healthcare workers would force members to leave the industry, exacerbating the province’s ongoing staffing shortage.\n\nThe BCNU, established in 1981, represents more than 48,000 professional nurses and other healthcare workers in the western Canadian province.\n\nOn Sept. 15, the union published a press release making it clear that the union stands for health freedom and is against the left-wing provincial government’s vaccine mandate for healthcare workers.\n\n“In response to the government’s announcement on Sept. 13 of its plans to extend the mandatory vaccination order to all healthcare workers, yesterday BCNU … raised concerns that consequences to this order could contribute to the severe nurse shortage in this province,” reads the press release. (Related: Medical staff shortages feared in France as health care workers balk at COVID-19 vaccine mandates.)\n\n“At a time when the union is imploring with health employers to improve staffing levels across this province, we are concerned that the mandatory nature of the vaccination strategy will force members to leave, further exacerbating a staffing shortage that is increasingly unmanageable.”\n\nBritish Columbia Health Officer Dr. Bonnie Henry and Minister for Health Adrian Dix announced the expansion of the province’s vaccine mandate to include all healthcare workers on Sept. 13.\n\nAccording to the mandate, all healthcare workers in the province must be fully vaccinated against COVID-19 by Oct. 26, or receive an exemption from the provincial health officer.\n\nDix claimed the province did not decide to mandate vaccines lightly. But the left-wing provincial government made this choice because British Columbia supposedly could no longer have a situation where healthcare workers remain unvaccinated.\n\n“We’re in a pandemic. It has very high risks in the healthcare setting. We have these very effective, very safe vaccines,” claimed Dix. “There’s an expectation that everyone who works in the healthcare system is vaccinated. The level of risk in the healthcare system justifies that.”\n\nThe BCNU argued that the worsening COVID-19 situation in British Columbia is precisely why a vaccine mandate would make the province’s response to the pandemic even worse. The union wrote that a vaccine mandate “can pose desperate staffing challenges in worksites where staffing is already stretched extremely thin.”\n\n“Our healthcare system would crash,” said BCNU Vice President Aman Grewal. “It is going to impact the care that is being provided because the resources are not there. That is where the government needs to focus the attention.”\n\nAccording to Grewal, around 20 percent of the union’s members – or nearly 10,000 people – have chosen not to get vaccinated. Among the top reasons for refusing the vaccines are concerns it may affect breastfeeding or pregnancy, and union members generally not being comfortable with getting vaccinated.\n\n“They say they have read the science, but they are not satisfied with the science that is out,” she said. Grewal added that the vaccine’s long-term health effects have not been properly studied, which is another point of contention many union members have noted.\n\nGrewal said that she personally supports the COVID-19 vaccine and has been encouraging BCNU nurses to get them. But her position is different from the union’s because the union is not in a position to support an order “which will serve to remove even a single nurse or other healthcare worker from the healthcare system at a time of severe crisis.”\n\n“It’s just not something that we can do,” said Grewal.\n\nBCNU president forced out due to opposition to vaccine mandates\n\nOn Monday, BCNU President Christine Sorensen resigned due to her being against vaccine mandates.\n\n“The BC Nurses’ Union thanks Christine Sorensen for her years of dedication and service to the BCNU,” read the union’s statement. “Christine Sorensen has resigned as President of the BCNU for personal reasons and to pursue other opportunities.”\n\nWhile the union claims her resignation was personal, the fact that she resigned less than a week after the union declared its opposition to vaccine mandates strongly suggests that the situation is much more complicated.\n\nThe fact that many of the union’s critics have taken to flooding the BCNU’s social media pages with angry comments lends further credence to the possibility that Sorensen was forced out.\n\n“We recognize that [our policy] appears to go against the principle of mass vaccination,” said Grewal. “However, our healthcare system is so fragile right now that we need to be very careful in implementing any kind of measure that will take away any nurse.”\n\nLearn more about how people all over the world are being forced to take the experimental and deadly COVID-19 vaccines by reading the latest articles at Vaccines.news.", "opengraph": {"title": "Nurses union in Canada warns COVID-19 vaccine mandates will lead to extreme staffing shortage", "type": "article", "url": "https://www.collapse.news/2021-09-28-nurses-union-canada-vaccine-mandate-staffing-shortage.html", "site_name": "Collapse News", "description": "The British Columbia Nurses’ Union (BCNU) has warned the provincial government of British Columbia in Canada that instituting a Wuhan coronavirus (COVID-19) vaccine mandate for healthcare workers would force members to leave the industry, exacerbating the province’s ongoing staffing shortage. The BCNU, established in 1981, represents more than 48,000 professional nurses and other healthcare workers […]", "image": "https://www.collapse.news/wp-content/uploads/sites/20/2021/09/Coronavirus-Doctors-Nurses-Staff-Rush-Run-Hospital.jpg"}, "tags": ["pandemic", "covid-19", "medical fascism", "vaccine wars", "nurses", "British Columbia", "Canada", "vaccine mandate", "Medical Tyranny", "vaccines", "health freedom", "medical staff shortage", "coronavirus vaccines"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/news/canadian-nurses-union-warns-covid-jab-mandates-will-lead-to-unmanageable-staffing-shortages/", "https://www.bcnu.org/about-bcnu", "https://www.naturalnews.com/2021-09-16-medical-staff-shortages-feared-in-france-health-care-workers-balk-vaccine-mandates.html", "https://www.brighteon.tv", "https://globalnews.ca/news/8191286/bc-nurses-fear-health-care-system-crash-vaccine-mandate/", "https://pandemic.news/", "https://globalnews.ca/news/8206661/bc-nurses-union-president-resigns/", "https://vancouversun.com/news/local-news/covid-19-b-c-nurses-union-stance-on-vaccine-mandate-sparks-uproar", "https://vaccines.news/", "https://www.lifesitenews.com/news/canadian-nurses-union-warns-covid-jab-mandates-will-lead-to-unmanageable-staffing-shortages/", "https://www.bcnu.org/about-bcnu", "https://globalnews.ca/news/8191286/bc-nurses-fear-health-care-system-crash-vaccine-mandate/", "https://globalnews.ca/news/8206661/bc-nurses-union-president-resigns/", "https://vancouversun.com/news/local-news/covid-19-b-c-nurses-union-stance-on-vaccine-mandate-sparks-uproar", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcollapse%2F2021-09-28-nurses-union-canada-vaccine-mandate-staffing-shortage.html&linkname=Nurses%20union%20in%20Canada%20warns%20COVID-19%20vaccine%20mandates%20will%20lead%20to%20extreme%20staffing%20shortage", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}