{"result_id": "075037", "URL": "https://www.collapse.news/2021-08-18-health-care-collapse-warning-vaccine-spike-protein-neurological-damage-medical-systems.html", "timestamp": "2023-04-25 14:47:03 CEST+0200", "meta": {"description": "Imagine living in a world where every hospital is overrun with vaccine-injured patients of all ages, suffering from extreme neurological damage that places previously able-bodied people in the category of requiring constant medical assistance to survive. Imagine so many people dying from covid spike protein injections (“vaccines”) that entire apartment buildings are abandoned and condemned […]", "lang": "en", "keywords": "badhealth,badmedicine,biowar,bioweapons,brain damage,chaos,Collapse,Dangerous Medicine,doctors,health care,Hospitals,nanoparticles,neurology,spike protein,toxicity,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.collapse.news/2021-08-18-health-care-collapse-warning-vaccine-spike-protein-neurological-damage-medical-systems.html", "encoding": "UTF-8"}, "image": null, "domain": "www.collapse.news", "title": "HEALTH CARE COLLAPSE warning: Vaccine spike protein will unleash widespread neurological damage that overwhelms world’s medical systems", "cleaned_text": "Imagine living in a world where every hospital is overrun with vaccine-injured patients of all ages, suffering from extreme neurological damage that places previously able-bodied people in the category of requiring constant medical assistance to survive. Imagine so many people dying from covid spike protein injections (“vaccines”) that entire apartment buildings are abandoned and condemned even with the spike protein-infested dead bodies inside because no one is willing to remove the dangerous bodies.\n\nThis dark vision of society may soon come to pass as the full effects of spike protein damage are realized. With nearly 2.5 billion around the world already injected with spike protein bioweapons, and with nearly 200 million Americans having lined up to take the shots, the world is rolling the dice on a global medical experiment that risks the survivability of entire nations (if not civilization itself) in the years ahead.\n\nWe already know that as many as 500,000 Americans have already been killed by the “clot shot,” but importantly, those are merely the short term vascular effects from blood clotting. These deaths do not take into account the long-term, slow-acting neurological damage that appears to resemble the human form of Mad Cow Disease, a prion-induced protein folding disorder that irreversibly destroys brain tissue over time. In an interview conducted yesterday (and soon to be posted), Dr. Chris Shaw, an expert in neurology and elemental toxicity, warned me that widespread, accelerating neurological damage is now a very real possibility since the spike protein and mRNA particles cross the blood-brain barrier.\n\nThis means toxic nanoparticles are circulating among the brains of the vaccinated. Bio-distribution studies have further confirmed that spike protein injections do not remain at the injection site. Instead, spike protein nanoparticles (or mRNA instructions) circulate throughout most of the body’s organs, including the brain.\n\nWhat happens when the brain is exposed to a weaponized spike protein, developed via gain-of-function research in a laboratory run by a communist military? (Wuhan lab, via the CCP.)\n\nThe answer shouldn’t be surprising: The spike protein disassembles healthy neurological tissue, destroying brain cells and impairing cognition in the process.\n\nImagine if millions of Americans suddenly collapsed to the cognitive level of Joe Biden. We might see homeless, desperate masses aimlessly wandering the streets of blue cities, crapping on the sidewalks and mumbling nonsensical things to themselves. Of course, we already see that in San Francisco and many liberal cities, but imagine the numbers of those afflicted exploding into many millions.\n\nEven those who are closely watching vaccine injuries and vaccine deaths may be missing the longer term neurological implications of this insidious spike protein assault on humanity. What happens to society when tens of millions of people are injured or killed by a government-created biological weapon designed to attack human tissue? It seems we’re about to find out.\n\nNo matter what happens in the coming months, right now is certainly not a good time to need hospital care. We strongly urge all readers to do everything in your power to maintain a healthy lifestyle rooted in disease prevention and strong nutrition. Over the next year (or less), the health care facilities may be overrun with vaccine-damaged people, and “routine” medical services may collapse as a result.\n\nLearn more in today’s urgent Situation Update podcast, which lays out the full details:\n\nGet more podcasts and interviews each day at:", "opengraph": {"title": "HEALTH CARE COLLAPSE warning: Vaccine spike protein will unleash widespread neurological damage that overwhelms world’s medical systems", "type": "article", "url": "https://www.collapse.news/2021-08-18-health-care-collapse-warning-vaccine-spike-protein-neurological-damage-medical-systems.html", "site_name": "Collapse News", "description": "Imagine living in a world where every hospital is overrun with vaccine-injured patients of all ages, suffering from extreme neurological damage that places previously able-bodied people in the category of requiring constant medical assistance to survive. Imagine so many people dying from covid spike protein injections (“vaccines”) that entire apartment buildings are abandoned and condemned […]", "image": "https://www.collapse.news/wp-content/uploads/sites/20/2021/08/HRR-2021-08-18-Situation-Update.jpg"}, "tags": ["bioweapons", "chaos", "vaccine wars", "health care", "toxicity", "biowar", "neurology", "Collapse", "Hospitals", "brain damage", "nanoparticles", "doctors", "spike protein", "vaccines"], "tweets": [], "movies": [], "links": ["http://spikeprotein.news", "https://www.brighteon.tv", "https://www.naturalnews.com/2021-06-02-horrifying-study-reveals-mrna-vaccine-nanoparticles-are-circulated-throughout-the-entire-body-brain-heart-liver-ovaries-testes.html", "http://vaccinedeaths.com", "http://Brighteon.com/c5c1cbfc-0b83-4231-8c46-9f586b407be5", "https://www.brighteon.com/channels/hrreport", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcollapse%2F2021-08-18-health-care-collapse-warning-vaccine-spike-protein-neurological-damage-medical-systems.html&linkname=HEALTH%20CARE%20COLLAPSE%20warning%3A%20Vaccine%20spike%20protein%20will%20unleash%20widespread%20neurological%20damage%20that%20overwhelms%20world%E2%80%99s%20medical%20systems", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}