{"result_id": "075005", "URL": "https://collapse.news/2023-03-03-covid-vaccine-harms-now-a-global-problem.html", "timestamp": "2023-04-25 14:46:55 CEST+0200", "meta": {"description": "Prominent Japanese scientist Dr. Masanori Fukushima has warned that the harms caused by the Wuhan coronavirus (COVID-19) vaccines, especially those of the mRNA variety, are now a worldwide problem. Fukushima is the chairman of the Translational Research Informatics Center and also serves as professor emeritus at Kyoto University. He has nearly three decades of experience in cancer […]", "lang": "en", "keywords": "badhealth,badmedicine,cardiac inflammation,covid-19,Daniel Horowitz,heart attacks,Masanori Fukushima,mRNA,myocarditis,pericarditis,strokes,sudden deaths,vaccine damage,Vaccine deaths,Vaccine injuries,VAERS,Wuhan coronavirus", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://collapse.news/2023-03-03-covid-vaccine-harms-now-a-global-problem.html", "encoding": "UTF-8"}, "image": null, "domain": "collapse.news", "title": "Japanese scientist warns: COVID vaccine harms are now a global problem", "cleaned_text": "Prominent Japanese scientist Dr. Masanori Fukushima has warned that the harms caused by the Wuhan coronavirus (COVID-19) vaccines, especially those of the mRNA variety, are now a worldwide problem.\n\nFukushima is the chairman of the Translational Research Informatics Center and also serves as professor emeritus at Kyoto University. He has nearly three decades of experience in cancer research and overarching medical care.\n\nAccording to Fukushima, the extensiveness of adverse health outcomes caused by the mRNA injections ultimately put billions of innocent people in harm’s way.\n\nAs early as March last year, data from the U.S. Vaccine Adverse Event Reporting System (VAERS) revealed that deaths caused by the Wuhan coronavirus (COVID-19) vaccines have surpassed those caused by all other vaccines in the past 30 years.\n\nVAERS recorded a total of 26,059 deaths caused by the COVID-19 vaccines in the first 15 months of rollout, nearly three times the 9,066 people killed by non-COVID vaccines in the previous 30 years. (Related: VAERS data show COVID vaccine deaths SURPASS those caused by other shots.)\n\nCOVID-19 vaccines also caused permanent disabilities in 48,342 people in just 15 months, more than double the 20,096 people who suffered from permanent disabilities after being injected with non-COVID vaccines in the past three decades.\n\nWith more nations getting access to the vaccines now, it’s easy to see why Fukushima thinks vaccine-induced harms are now a global concern.\n\nThe doctor also slammed those who promote the mRNA vaccines to the masses, particularly those who lack the proper academic credentials to do so. Fukushima was obviously referring to politicians like President Joe Biden, who are quick to mandate vaccinations despite limited knowledge about the vaccines.\n\nFukushima’s expert analysis of mRNA shots and human health holds sway throughout the worldwide medical community. Based on his analysis, the negative health consequences of the mRNA shots are already a global issue. The vaccines can potentially spur a wave of heart attacks, strokes and sudden deaths.\n\nDaniel Horowitz, senior editor at the Blaze, made a similar point in an article nearly a year ago.\n\n“Reports of myocarditis and pericarditis are so prevalent now that just in the first eight weeks of 2022, we’re already at 47 percent of the total VAERS submissions for 2021. There were 24,177 reports of pericarditis [and] myocarditis submitted to VAERS in 2021. In 2022, just through Feb. 25, there were 11,289 reports – which is nearly half of last year’s total,” he wrote.\n\nHorowitz proposed two possible explanations for the sudden influx of VAERS reports in the first two months of 2022. “Either more people and doctors know about VAERS and know [how] to look for myocarditis, or there is a time bomb with many more people now realizing they have heart problems months later,” he said.\n\n“Either way, this means that the initial estimates of case prevalence were just the tip of the iceberg, and we are likely to see young hearts damaged for years to come.”\n\nTo stop that from happening, Fukushima offered a simple solution: Stop all COVID-19 vaccination programs across the globe.\n\nBut Fukushima said public health agencies first need to acknowledge the problems caused by the vaccines and make it clear that those issues are a direct threat to public health.\n\nRead more stories about COVID-19 vaccines at Vaccines.news.\n\nWatch Dr. Masanori Fukushima discuss his lawsuit against the Japanese government for concealing the truth about the COVID-19 injections below.\n\nThis video is from the Red Voice Media channel on Brighteon.com.\n\nMysterious clots that are killing people caused by covid jab spike proteins, paper reveals.\n\nTexas doctor sues hospital for punishing her over covid jab criticisms.\n\nU.S. citizens are trapped in Australia, being forced to take covid jab.", "opengraph": {"title": "Japanese scientist warns: COVID vaccine harms are now a global problem", "type": "article", "url": "https://www.collapse.news/2023-03-03-covid-vaccine-harms-now-a-global-problem.html", "site_name": "Collapse News", "description": "Prominent Japanese scientist Dr. Masanori Fukushima has warned that the harms caused by the Wuhan coronavirus (COVID-19) vaccines, especially those of the mRNA variety, are now a worldwide problem. Fukushima is the chairman of the Translational Research Informatics Center and also serves as professor emeritus at Kyoto University. He has nearly three decades of experience in cancer […]", "image": "https://www.collapse.news/wp-content/uploads/sites/20/2023/03/Covid-vaccine-world.jpg"}, "tags": ["covid-19", "cardiac inflammation", "heart attacks", "VAERS", "Vaccine deaths", "Masanori Fukushima", "myocarditis", "Daniel Horowitz", "pericarditis", "Vaccine injuries", "sudden deaths", "Wuhan coronavirus", "strokes", "mRNA", "vaccine damage"], "tweets": [], "movies": [], "links": ["https://www.naturalhealth365.com/covid-jab-induced-harm-is-now-a-worldwide-problem-japanese-scientist-warns.html", "https://www.kyoto-u.ac.jp/en", "https://www.globalresearch.ca/covid-19-vaccine-massacre-68000-increase-strokes-44000-increase-heart-disease-6800-increase-deaths-over-non-covid-vaccines/5775802", "https://naturalnews.com/2022-03-31-vaers-covid-vaccine-deaths-surpass-other-vaccines.html", "https://www.brighteon.tv", "https://www.theblaze.com/op-ed/horowitz-vaers-myocarditis-already-47-of-2021-in-just-first-2-months-of-2022", "https://vaccines.news/", "https://www.brighteon.com/0339147a-4952-4be9-947a-9a864b3d7d04", "https://www.brighteon.com/channels/redvoicemedia", "https://naturalnews.com/2022-09-19-untested-bivalent-covid-jab-being-rolled-out.html", "https://naturalnews.com/2022-11-08-massive-clots-killing-covid-jab-spike-proteins.html", "https://naturalnews.com/2022-07-29-texas-doctor-sues-hospital-covid-jab-criticisms.html", "https://naturalnews.com/2022-11-16-twitter-scrubs-footage-emergencies-act-lawyer-collapse.html", "https://naturalnews.com/2021-09-10-us-citizens-trapped-australia-told-take-covid-jab.html", "https://www.naturalhealth365.com/covid-jab-induced-harm-is-now-a-worldwide-problem-japanese-scientist-warns.html", "https://www.globalresearch.ca/covid-19-vaccine-massacre-68000-increase-strokes-44000-increase-heart-disease-6800-increase-deaths-over-non-covid-vaccines/5775802", "https://www.theblaze.com/op-ed/horowitz-vaers-myocarditis-already-47-of-2021-in-just-first-2-months-of-2022", "https://www.brighteon.com/0339147a-4952-4be9-947a-9a864b3d7d04", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcollapse%2F2023-03-03-covid-vaccine-harms-now-a-global-problem.html&linkname=Japanese%20scientist%20warns%3A%20COVID%20vaccine%20harms%20are%20now%20a%20global%20problem", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}