{"result_id": "075034", "URL": "https://www.collapse.news/collapse/2016-04-28-fda-fast-tracks-risky-squalene-adjuvant-flu-vaccine-for-seniors-after-being-banned-in-italy-following-19-deaths.html", "timestamp": "2023-04-25 14:47:02 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "big pharma,culture & society,deception,drugs,flu shots,harmful medicine,toxic chemicals,toxic ingredients,barbara loe fisher,erin elizabeth,flu vaccine,fluad,guillian barre syndrome,gulf war syndrome,health nut news,sorcery,squalene adjuvanted flu shots,swine flu propaganda", "favicon": "wp-content/plugins/genesis-favicon-uploader/favicons/favicon-20.ico", "canonical": "https://www.collapse.news/2016-04-28-fda-fast-tracks-risky-squalene-adjuvant-flu-vaccine-for-seniors-after-being-banned-in-italy-following-19-deaths.html", "encoding": "UTF-8"}, "image": null, "domain": "www.collapse.news", "title": "FDA fast-tracks risky flu vaccine for seniors which was banned in Italy for causing 19 deaths", "cleaned_text": "Definitions are important. Like, for example, the Center for Disease Control (CDC), what does that really mean? Or the Federal Drug Administration (FDA). Our society’s increased disease rates and pharmacological drug pushing point to but one logical conclusion. The CDC is controlling the schedule for release of the next big disease. And the FDA‘s job is to ensure pharmaceutical concoctions are force fed from a Federal level. By the way, the word pharmaceutical comes from the Greek word “φαρμακείᾳ” or “pharmakeia.” In the book of Revelation, pharmakeia is defined as “employment of drugs for any purpose: sorcery, magic, enchantment.”\n\nFraming it from this context, why wouldn’t the FDA fast track an experimental squalene adjuvanted flu vaccine named MF59 or Fluad for seniors over 65? So what if nineteen people died in Italy after taking the injection? Who cares if the Novartis shot was temporarily banned? Since genocide is the goal, maybe the Federal Death Administration were hoping for a higher kill rate. But what exactly does squalene adjuvanted mean? What are the added risks? Health activist and blogger Erin Elizabeth describes it this way:\n\n“Science teaches that oil and water don’t mix. However, the Food and Drug Administration just fast-tracked Novartis’ oil-in water, squalene adjuvant flu shot for approval in individuals 65 and older… Adjuvants are added to vaccines to hyper-stimulate the immune system. They are designed to remain in the body for a prolonged reaction. New adjuvants are composed of phospholipids which are part of the membrane of every cell. When injected, these adjuvants cause the body to mount an autoimmune attack (i.e., antiphospholipid syndrome) against its own cells. It’s a game of ‘Russian Roulette’ resulting in unpredictable adverse side effects ranging from heart attacks, stroke, myelitis and blindness to cognitive disfunction, skin disorders, miscarriages and fetal death.”\n\nAdditionally, Ms. Elizabeth reminds us of the prior usage of squalene adjuvanted shots, including those “experimental” injections during the First Gulf War which led to devastation results:\n\n“In 1991, the squalene adjuvanted anthrax vaccine was first experimentally given to tens of thousands of Gulf War soldiers which resulted in severe, permanent injuries. Squalene antibodies caused a cascade of autoimmune reactions known as Gulf War Syndrome (GWS). Symptoms included severe headaches, nausea, muscular pain, joint swelling, short term memory loss, night sweats, depression. Autoimmune conditions ranged from fibromyalgia, lymphadenopathy, Lupus, Multiple Sclerosis, autoimmune thyroid disease, chronic fatigue syndrome to malar rashes, chronic headaches, non-healing skin lesions, musculoskeletal disorders (ALS), among others. More than twenty years later thousands of veterans are still ill.”\n\nI have a friend who was encouraged by President Ford to get the swine flu shot in the 1970s. Within a few years, she was wheelchair bound after severe bouts with Gullain Barre Syndrome. She is not alone.\n\nYou may have your own story; if you were betrayed my tears are with you and I pray you will be strengthened. For those looking to protect their loved ones from influenza, there are many powerful foods, herbs and methods to combat it.\n\nRemember, this particular flu shot was targeted to persons over 65. This means that your mom, dad, grandmother or grandfather and other older relatives are in their sights. Do all you can to educate them. If they have an appointment, try to go with them. Because one of the first questions they’ll be asked is; “Have you had your flu shot?” Be like this group of nurses. Just say no. You can punctuate your remarks with this statement:\n\nFlu shots are conjured up by sorcerers.", "opengraph": {}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "500", "height": "375", "embed_code": "<iframe width=\"500\" height=\"375\" src=\"https://www.youtube.com/embed/kMeU-818-YA?feature=oembed\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/kMeU-818-YA?feature=oembed"}], "links": ["http://www.cdc.news/", "http://www.fda.news/", "http://biblehub.com/greek/5331.htm", "http://www.biblestudytools.com/commentaries/revelation/revelation-9/revelation-9-21.html", "http://www.vaccinedamage.news/", "http://www.nvic.org/NVIC-Vaccine-News/September-2015/FDA-Fast-Tracks-Adjuvanted-Influenza-Vaccines.aspx", "http://www.fiercevaccines.com/story/novartis-fluad-back-italys-safety-radar-following-13-deaths/2014-12-01", "http://www.healthnutnews.com/squalene-adjuvanted-flu-shots-for-the-elderly/", "https://www.youtube.com/watch?v=5-60WahB2zU", "http://www.gbs-cidp.org/", "http://foodforensics.com/", "http://www.cassingram.com/five-wild-teas-to-keep-you-healthy-all-winter-long/", "http://www.naturalnews.com/038963_flu_vaccine_vitamin_D_probiotics.html", "http://science.naturalnews.com/flu-shot.html", "http://naturalsociety.com/22000-nurses-refuse-mandatory-vaccinations/", "http://brokelyn.com/get-your-free-flu-shot-because-winter-is-full-of-disease/", "http://biblehub.com/greek/5331.htm", "http://www.biblestudytools.com/commentaries/revelation/revelation-9/revelation-9-21.html", "http://www.nvic.org/NVIC-Vaccine-News/September-2015/FDA-Fast-Tracks-Adjuvanted-Influenza-Vaccines.aspx", "http://www.fiercevaccines.com/story/novartis-fluad-back-italys-safety-radar-following-13-deaths/2014-12-01", "http://www.healthnutnews.com/squalene-adjuvanted-flu-shots-for-the-elderly/", "http://www.gbs-cidp.org/", "https://www.youtube.com/watch?v=kMeU-818-YA", "http://www.healingfoodreference.com/", "http://www.cassingram.com/five-wild-teas-to-keep-you-healthy-all-winter-long/", "http://www.naturalnews.com/038963_flu_vaccine_vitamin_D_probiotics.html", "http://naturalsociety.com/22000-nurses-refuse-mandatory-vaccinations/", "http://www.natureofhealing.org/squalene-adjuvanted-flu-shots-for-the-elderly/", "http://science.naturalnews.com/flu-shot.html", "http://foodforensics.com/"], "authors": [], "publish_date": null}