{"result_id": "075032", "URL": "https://collapse.news/2022-04-22-covid-vaccine-complications-will-collapse-health-system.html", "timestamp": "2023-04-25 14:47:02 CEST+0200", "meta": {"description": "One of the most talented vaccine creators in the world has warned that the coming onslaught of Wuhan coronavirus (COVID-19) “vaccine” injuries and deaths will be so large that a total collapse of the health system is inevitable. Dr. Geert Vanden Bossche, who used to work as a senior program manager at the Global Alliance […]", "lang": "en", "keywords": "badhealth,badmedicine,Big Pharma,biological weapon,Collapse,COVID,Dangerous Medicine,GAVI,Geert Vanden Bossche,health system,herd immunity,immune system,innate immunity,pandemic,pharmaceutical fraud,spike protein,vaccine damage,vaccine injury,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://collapse.news/2022-04-22-covid-vaccine-complications-will-collapse-health-system.html", "encoding": "UTF-8"}, "image": null, "domain": "collapse.news", "title": "COVID vaccine complications will soon “collapse our health system,” warns renowned virologist", "cleaned_text": "COVID vaccine complications will soon “collapse our health system,” warns renowned virologist\n\nOne of the most talented vaccine creators in the world has warned that the coming onslaught of Wuhan coronavirus (COVID-19) “vaccine” injuries and deaths will be so large that a total collapse of the health system is inevitable.\n\nDr. Geert Vanden Bossche, who used to work as a senior program manager at the Global Alliance for Vaccines and Immunization (GAVI), warned listeners in a “Message to Austria” regarding that country’s lockdown measures that the true fight for health is in not getting vaccinated.\n\nLast year, as you may recall, Vanden Bossche stated publicly that trying to vaccinate people in the midst of a “pandemic” is about the worst thing you can do if stopping the spread is truly your goal.\n\n“We need to help them as much as we can because they will need extensive treatment, in many cases,” Vanden Bossche said about the “fully vaccinated” who have no idea what will soon become of them.\n\nThe number of fully jabbed requiring hospitalization, he further warned, “is now steadily increasing” with no end in sight.\n\n“Whereas more and more, with training of the innate immune system, with more exposure to the virus, more and more non-vaccinated people get protected,” he further explained.\n\n“This will lead inevitably – and I am not a doomsday preacher – but this will inevitably lead to a collapse of our health system. It cannot be otherwise.”\n\nCOVID “vaccines” actually suppress innate immunity, leaving the body more prone to diseases\n\nContrary to what is widely claimed, injecting these poisons into human bodies does not promote strengthened immunity. In fact, the jabs are suppressing innate immunity, which is required for generalized protection against disease.\n\nMan-made chemical cocktails, in this case experimental in nature, “cannot substitute” for innate immunity, Vanden Bossche stressed, nor do they contribute to so-called “herd immunity.”\n\nWith this in mind, it is especially egregious to inject children with the stuff since their “innate immunity can easily be suppressed by vaccinal antibodies,” Vanden Bossche warned.\n\n“[Their] antibodies are so young and so naïve that they can easily be outcompeted by vaccinal antibodies,” he added.\n\nThis is actually true for all vaccines, which compete against and usually defeat innate immunity, leaving a person prone to autoimmune disorders and other problems throughout his life.\n\nThe fact that children have a zero percent risk of dying from the Fauci Flu, or even showing symptoms of infections, makes the jab push on them even more nefarious. How many vaccinated children will now suffer a lifetime of health problems due to getting injected?\n\nIn Vanden Bossche’s view, jabbing children with these biological agents “is an absolute no go!”\n\n“We cannot vaccinate our children with these vaccines,” he says.\n\nAdults are similarly damaged by the shots, which likewise suppress adult immunity. Depending on a person’s age and existing health status, getting shot could mean a death sentence, even if it does not happen immediately.\n\nAnd the “booster” shots? Vanden Bossche called the concept “absolutely insane” during a recent presentation, further calling them dangerous nonsense that “should not be done!”\n\nThose who remain unvaccinated should stay that way no matter what, Vanden Bossche said. They more than likely already possess immunity to whatever it is that is circulating under the name of covid, and any interference with that via an injection will likely trigger health problems.\n\n“Very importantly, all are protected,” Vanden Bossche said about the unvaccinated. “They all are still protected against severe disease and the majority of them will be protected against very mild or moderate disease.” COVID, he added, “is not a disease of healthy people.”\n\n“People who are in good health have a healthy innate immune system that can deal with a number of respiratory viruses without any problem,” he said.\n\nThe latest news about Chinese Virus injections can be found at ChemicalViolence.com.", "opengraph": {"title": "COVID vaccine complications will soon “collapse our health system,” warns renowned virologist", "type": "article", "url": "https://www.collapse.news/2022-04-22-covid-vaccine-complications-will-collapse-health-system.html", "site_name": "Collapse News", "description": "One of the most talented vaccine creators in the world has warned that the coming onslaught of Wuhan coronavirus (COVID-19) “vaccine” injuries and deaths will be so large that a total collapse of the health system is inevitable. Dr. Geert Vanden Bossche, who used to work as a senior program manager at the Global Alliance […]", "image": "https://www.collapse.news/wp-content/uploads/sites/20/2022/04/Coronavirus-Urgent-Doctors-Emergency-Hospital.jpg"}, "tags": ["pandemic", "Geert Vanden Bossche", "vaccine damage", "GAVI", "Big Pharma", "health system", "herd immunity", "Collapse", "COVID", "innate immunity", "vaccine injury", "vaccines", "spike protein", "immune system", "biological weapon", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://www.globalresearch.ca/renowned-virologist-warns-collapse-health-system-due-complications-covid-vaccines/5763796", "https://naturalnews.com/2021-08-17-geert-vanden-bossche-vaccinating-during-pandemic-promotes-variants.html", "https://www.brighteon.tv", "http://chemicalviolence.com", "https://www.globalresearch.ca/renowned-virologist-warns-collapse-health-system-due-complications-covid-vaccines/5763796", "https://naturalnews.com/2021-08-17-geert-vanden-bossche-vaccinating-during-pandemic-promotes-variants.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fcollapse%2F2022-04-22-covid-vaccine-complications-will-collapse-health-system.html&linkname=COVID%20vaccine%20complications%20will%20soon%20%E2%80%9Ccollapse%20our%20health%20system%2C%E2%80%9D%20warns%20renowned%20virologist", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}