{"result_id": "075014", "URL": "https://www.collapse.news/2020-03-15-flu-vaccine-might-make-you-more-vulnerable-to-coronavirus.html", "timestamp": "2023-04-25 14:46:58 CEST+0200", "meta": {"description": "You’ve probably heard by now that the flu vaccine won’t protect you against coronavirus – nor does it protect many people from the flu – but now it has emerged that it may actually raise your vulnerability to the deadly illness. This is according to a warning issued by Dr. Robert J. Rowen, who wrote […]", "lang": "en", "keywords": "acoustic research,badhealth,badmedicine,badscience,coronavirus,Dangerous Medicine,flu shot,Flu vaccine,infections,influenza,outbreak,pandemic,research,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.collapse.news/2020-03-15-flu-vaccine-might-make-you-more-vulnerable-to-coronavirus.html", "encoding": "UTF-8"}, "image": null, "domain": "www.collapse.news", "title": "The flu vaccine might make you even more vulnerable to coronavirus", "cleaned_text": "The flu vaccine might make you even more vulnerable to coronavirus\n\nYou’ve probably heard by now that the flu vaccine won’t protect you against coronavirus – nor does it protect many people from the flu – but now it has emerged that it may actually raise your vulnerability to the deadly illness.\n\nThis is according to a warning issued by Dr. Robert J. Rowen, who wrote that when a person gets a vaccination, their immune system essentially becomes so artificially “deranged” by it that it can’t respond normally to any secondary challenges it may face.\n\nThis detail is listed right in the first sentence of a new study’s abstract, which says that “Receiving influenza vaccination may increase the risk of other respiratory viruses, a phenomenon known as vaccine interference.”\n\nIn the study, which was published in January in the journal Vaccine, researchers compared the vaccination status of 2,880 individuals with non-flu respiratory viruses to 3,240 people who did not have any flu or virus. When they compared those who had gotten the flu vaccine to those who hadn’t, they discovered that virus interference was associated with coronavirus as well as human metapneumovirus.\n\nUnfortunately, the New York Times recently published an article advising people to get the flu shot in preparation for coronavirus. The piece advised to “wash your hands, keep a supply of medicine, and get a flu shot.”\n\nLet’s hope that not very many people ran out to get jabbed after reading this ill-advised “tip.”\n\nThe article cites a doctor who claims infectious disease specialists are strongly recommending flu vaccines for coronavirus as well as pneumonia. The doctor added that the best way to protect older people from bacterial pneumonia is by vaccinating children!\n\nThat’s baffling and dangerous advice when you consider the fact that the flu vaccine has never actually been shown to offer protection against pneumonia, nevermind the fact that the viruses in the flu vaccine don’t even resemble coronaviruses.\n\nLots of reasons not to get a flu vaccine\n\nThe flu vaccine isn’t even good at protecting against the very illness it was designed for in the first place, often proving completely ineffective at stopping people from getting the flu strain that circulates prominently in a given year. It can even cause mutations in the flu viruses from past flu seasons, which can make people even more vulnerable to getting infected in the future.\n\nIn fact, research that is set to be presented at the American Thoracic Society’s International Conference this May shows that the flu vaccine causes children harm. The study, which looked at more than 260 children between the ages of 6 months and 18 years, found that those who don’t get the flu shot recover from the flu and other infections better and don’t usually require hospitalization.\n\nIn contrast, those who are given the annual flu vaccine have a three times greater likelihood of suffering from complications from flu and are therefore also more likely to be hospitalized and need breathing treatments; the effect is even greater in those who have asthma.\n\nOf course, there are even more reasons you want to avoid the flu vaccine that have nothing to do with coronavirus. For example, the more shots you get, the less effective they become. One study showed that senior citizens who had gotten up to three flu vaccines in the past had a 26 percent efficacy rate with their current flu shot, while those who had been given nine or ten previous flu shots had an efficacy rate of just 7! This compares very poorly to the already appalling efficacy rate of 34 percent noted by those without any previous vaccines.\n\nIn short, not only does the flu vaccine not protect you against coronavirus or the flu, but it may actually make you more vulnerable to both illnesses.", "opengraph": {"title": "The flu vaccine might make you even more vulnerable to coronavirus", "type": "article", "url": "https://www.collapse.news/2020-03-15-flu-vaccine-might-make-you-more-vulnerable-to-coronavirus.html", "site_name": "Collapse News", "description": "You’ve probably heard by now that the flu vaccine won’t protect you against coronavirus – nor does it protect many people from the flu – but now it has emerged that it may actually raise your vulnerability to the deadly illness. This is according to a warning issued by Dr. Robert J. Rowen, who wrote […]", "image": "https://www.collapse.news/wp-content/uploads/sites/20/2020/03/Baby-Asian-Vaccine-Polio-Doctor-Illness-Mmr.jpg"}, "tags": ["pandemic", "outbreak", "research", "influenza", "acoustic research", "infections", "vaccines", "coronavirus", "flu shot", "Flu vaccine"], "tweets": [], "movies": [], "links": ["https://healthimpactnews.com/2020/dr-rowen-flu-vaccine-may-make-you-more-susceptible-to-coronavirus/", "https://www.ncbi.nlm.nih.gov/pubmed/31607599", "https://www.naturalnews.com/2020-03-02-nyt-spreads-dangerous-misinformation-claims-flu-shot-protects-against-coronavirus.html", "https://science.naturalnews.com/vaccination.html", "https://pandemic.news/", "https://healthimpactnews.com/2020/dr-rowen-flu-vaccine-may-make-you-more-susceptible-to-coronavirus/", "https://www.ncbi.nlm.nih.gov/pubmed/31607599", "https://www.naturalnews.com/2020-03-02-nyt-spreads-dangerous-misinformation-claims-flu-shot-protects-against-coronavirus.html"], "authors": [], "publish_date": null}