{"result_id": "076003", "URL": "https://www.collective-evolution.com/blog/the-unseen-damages-fact-checking-has-on-public-discourse", "timestamp": "2023-04-25 14:47:06 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://kajabi-storefronts-production.kajabi-cdn.com/kajabi-storefronts-production/file-uploads/sites/2147641268/images/3d0ee4-cf67-7cd-cd22-25b38f7c0056_de61390a-f929-4af3-814e-24b208b505bd.png?v=2", "canonical": "https://www.collective-evolution.com/blog/the-unseen-damages-fact-checking-has-on-public-discourse", "encoding": "utf-8"}, "image": null, "domain": "www.collective-evolution.com", "title": "The Unseen Damages Fact Checking Has On Public Discourse", "cleaned_text": "The Unseen Damages Fact Checking Has On Public Discourse\n\nBy now the discussion around the potential lab leak origins of COVID-19 is where it should be – in a space where we can admit we don’t know exactly what the truth is, but that there is in fact evidence of lab origins that should be investigated. This evidence was widely available to public health officials and the public as far back as February of 2020 when the pandemic began hitting Western countries and the origins battle began. Yet here we are in disarray, wondering how mainstream media and science labelled this story a ‘conspiracy theory’ in the first place.\n\nWe’ve covered the question of lab origins in depth through multiple pieces we’ve published since the pandemic began. A more recent article we published in March 2021, by Dr. Madhava Setty, pointed to the validity of lab origins even before the famous, Nicholas Wade investigative piece. Due to public sentiment at the time, Dr. Setty’s article was met with criticism of course.\n\nBack in September of 2020, I published a piece exploring the claims of a Chinese virologist named Dr. Li-Meng Yan who said she had proof that COVID was made in a Wuhan lab. Interestingly, our coverage was met with a fact check from PolitiFact claiming that our piece was false because her claims have been widely debunked. And it’s here where I want to turn your attention to how fact checking works and also discuss the unseen damages it causes to not only independent media public also public discourse. Inevitably, we’ll also have to discuss a truth I feel is emerging: fact checkers seems to be glorified journalists that re-enforce mainstream perspectives, as opposed to fact checking content.\n\nThe way it works is, we painstakingly work on a piece, fact check it, edit it, and then publish. We then start disseminating our content to our networks via email and social media. If we’ve made a mistake, we usually catch it within hours as inevitably someone brings it to our attention. While this is not common, it happens, and it is a normal part of running a news/media publication. We then issue a correction and make it clear in the article. But when a fact checker gets involved it’s a bit different. We receive the dreaded email in our inbox claiming that an independent fact checker has rated our content posted on Facebook as false. We know what this means, and it’s rare that it’s actually a mistake.\n\nIt’s important to understand what happens next.\n\nA notice is placed over top of our content on Facebook newsfeeds. Someone on Facebook would see something like this:\n\nReaders are then given the option to read why it was considered “false” or “misleading” by reading an article written by a fact checker. In some cases, the fact checker is correctly ‘debunking’ poor claims made in an article. But in many cases, this isn’t quite what is going on. Sometimes, the fact checker merely disagrees with the objectivity of the article in question.\n\nBefore we continue, this “False Information” notice doesn’t just look bad on brand who produced the content, who’s logo appears next to the post in millions of newsfeeds, it also affects the content reach of the brand and thus their ad revenue.\n\nFrom our data, which admittedly isn’t perfect, we typically see about a 75% reduction in traffic from Facebook when we are hit with a ‘fake news’ claim. That equates to a 75% reduction in our ad revenue as well considering that traffic is now gone. What’s worse is that Facebook seems to keep a log of how many fact checks a brand gets over time, and they claim that repeated false news strikes will result in long term reach reduction .\n\nAccording to a 2021 article in Adweek,\n\nFacebook has also said that repeated sharing of misleading information could result in page deletion as well. Of course, no one knows just how much reach is taken away or how many strikes a brand needs for their page will be removed, but I can tell you we’ve gone from doing about 20 million page views a month in web traffic to about 3 million a month.\n\nAlmost all of our traffic loss is from the Facebook side, with about 15% coming from Google search after they systematically removed us from their search results in 2020.\n\nLooking specifically at the Facebook side, ‘false news’ claims have huge implications on independent media companies, and it directly affects the bottomline. And what we’re about to get into explains how it’s not as though in all cases fact checkers are cleaning up fake stories, they are actually dead wrong – a lot. This attack on objective journalism can literally put a news company out of business. And no one is holding fact checkers accountable when they are flat out wrong. Let’s take our story of the Chinese virologist that PolitiFact claimed was false back in September 2020. As of May 17, 2021, PolitiFact retracted their claim saying: “When this fact-check was first published in September 2020, PolitiFact’s sources included researchers who asserted the SARS-CoV-2 virus could not have been manipulated. That assertion is now more widely disputed. For that reason, we are removing this fact-check from our database pending a more thorough review. Currently, we consider the claim to be unsupported by evidence and in dispute. The original fact-check in its entirety is preserved below for transparency and archival purposes. Read our May 2021 report for more on the origins of the virus that causes COVID-19.” I struggled to include this next bit in this piece because I truly don’t want to become petty here, but I don’t know how else to bring attention to how serious this situation truly is. Having been so intimately connected to this particular example since last year, I feel PolitiFact needs to be more honest and say something like: “Here at PolitiFact we ignored sources of information that provided evidence that COVID may have originated in a lab. We only looked at evidence we thought was trustworthy from establishment sources. We did not spend enough time truly digging and applying objectivity, as journalists would, and thus we made unfounded assertions. We have since updated our story now that mainstream discourse has opened up to the idea of lab origins and now that our parents, mainstream media, told us it is OK to talk about it.” However, this is obviously not what they wrote, because why would they? Instead, they are passing off their lack of objective research and blaming the “researchers” they sourced. For reference, here is what an objective look into this story would have produced, and why an obvious conflict of interest that ‘debunked’ the lab origins theory would have been found. Recently, I’ve heard many people come to the defense of mainstream media and fact checkers when it comes to this ‘new’ information about COVID’s origins. Many have said things like “this is what science and journalism is, we update ideas. When new information comes forward and we see we are wrong we admit it, and move forward – updating our understandings. You should be congratulating people for changing their mind.” But that’s not what happened. It’s not like no one knew what was going on with this information, they were just too busy hating Trump. Mainstream journalists ignored the evidence – and fact checkers followed right behind mainstream media and did the same. They did an objectively bad job of investigating this story and are now trying to celebrate their mind changing, all while continually attacking the sources that got it right from the start – independent media. The position we took in our piece in September 2020 was simple: we don’t know enough about the origins of this virus and we need a call for further research. This was met with “this is a conspiracy theory that has been widely debunked.” And now those debunkers are admitting “we don’t know enough about the origins of this virus and we need a call for further research.” So where is our compensation for lost revenues from Facebook or PolitiFact? Where is an apology and notification to people of Facebook that clears our name of wrong doing? There won’t be one and I’m OK with that. Could we really expect otherwise? At the same time, I feel we need to learn from the choices we’re making right now. The sad part is, this is not the first time this has happened to us. To our tally of ‘fact checks’ since the start of Facebook’s campaign, only 2 of 15 have been correct, and they were more so about providing a bit of deeper context as opposed to incorrect facts. Multiple times we have received ‘fact checks’ that stay on our page for a couple of days, only to be removed by fact checkers a day later claiming “oops this was a mistake” or even sometimes they sit in dead silence. Of course, the damage has already been done by the time they remove their mistaken fact check. One recent fact check we received was from the small outfit called Lead Stories. They applied a fact check to one of our articles, but they cited an article that wasn’t ours. When we asked to discuss what was wrong our piece in particular they said they would look into it. They took over a month to respond, and they still have not provided any clarity as to why our piece is “missing context.” This too might be a case where pride is getting in the way and admitting there is nothing wrong with our piece is just too much – we don’t know, and that’s the problem. We won’t know if this bogus strike will be added to the pile of strikes we receive on Facebook that could one day lead to facebook terminating our account due to ‘repeated publishing of fake news.’ Another company called Science Feedback has a division called Health Feedback. They are who we deal with most. Typically Health Feedback handles health related stories that are usually the most relevant in culture at any given time. Think of things like COVID-19 or vaccine hesitancy. We’ve had multiple interactions with Health Feedback where they fact check our work and use straw-man arguments, that we do not make in our pieces, so they can debunk the straw-man claim and pretend they’ve debunked our piece. Communication with this organization typically goes nowhere productive as they hold strong to their opinions. Since they hold all the power, they wait for you to concede so you can get your business revenue back. This single fact is probably what the public does not understand about fact checking: they have the power to hold your ad revenue hostage by means of holding your social media traffic hostage. Mainstream media often sends out a pretty common narrative across the board. Alternative or independent media often provide more information, another perspective, or even a counter perspective. Yet fact checking seems to have come along and ‘debunked’ that alternative perspective by using the same sources the mainstream uses – and in a lot of cases they are downright false. This makes fact checkers an apparently objective re-enforcement of mainstream narratives. This effectively negates the point of independent media. Look at the COVID lab origins story as just one example of literally hundreds. People gave up on the idea, even called it downright crazy, just because mainstream media and fact checkers wrongly labelled the story a ‘conspiracy theory.’ For over a year, people argued, fought over this story. Companies who stuck with the truth saw their revenues and social media reach cut – only to be vindicated a year later, but with no real benefit to that vindication other than a personal pat on the back. Fact checking does well to debunk obviously and verifiably false claims, but it is not always objective and thus shutting down meaningful discourse in public policy and science. Both important factors to creating a thriving society. People have speculated that fact checking is just a way for powerful corporate interests to further police factually based dissenting ideas – they might be right. After all, look at the people behind some of these organizations. Another way to look at it is, perhaps people began to notice that objectivity in journalism was dying. Fact checking then was a way to bring objectivity back to journalism by being a third party. Only, what’s happening doesn’t seem to support that idea as it appears fact checkers and mainstream media push their narratives in lockstep. There are real problems in media too that aren’t just about facts. The political slanting in most mainstream and alternative media is obvious. Does that cloud the facts of a story? Does it manipulate the viewer? Does an organization choose to cover what supports its view as opposed to what is in the best interest of people? Sure, news organizations have to make money. And in many cases the first step to that is finding out who your target market is and tailor your message towards them. And in most cases, mainstream and alternative organizations are doing just that; usually aligning their content to the political views of their audience. But in the case of mainstream media, they are also aligning with corporate interests or their main TV network sponsors, which is likely why when it comes to health and Pharma, one can’t expect to get ‘the whole story’ from mainstream news. It would be a direct conflict of interest. A conflict of interest that is not widely disclosed to you, the viewer, during every broadcast about these products, which it should be. Now, in June 2021, with the Wuhan lab origins story of COVID being taken seriously by mainstream media, in stead of coming out and admitting they had it wrong from the start because they ignored facts an published improper journalism, they continue to weave a narrative of protection – further confusing the mass populace. Which is why, I hope, you read our news and watch our media, because we have consistently been ahead of the curve over the last 12 years. This won’t be the last time.", "opengraph": {"type": "website", "url": "https://www.collective-evolution.com/blog/the-unseen-damages-fact-checking-has-on-public-discourse", "title": "The Unseen Damages Fact Checking Has On Public Discourse", "image": "https://kajabi-storefronts-production.kajabi-cdn.com/kajabi-storefronts-production/file-uploads/blogs/2147509741/images/01701e3-0003-6e4-e1bf-bd8f5e0f750_Covid-Lie-800x500-1.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.collective-evolution.com/2021/03/15/the-deeper-questions-behind-the-lab-origins-debate/", "https://nicholaswade.medium.com/origin-of-covid-following-the-clues-6f03564c038", "https://www.collective-evolution.com/2020/09/12/chinese-virologist-claims-she-will-be-publishing-evidence-proving-covid-19-is-manmade/", "https://www.politifact.com/li-meng-yan-fact-check/", "https://www.adweek.com/media/facebook-takes-steps-to-reduce-reach-of-repeat-sharers-of-misinformation/", "https://www.adweek.com/media/facebook-takes-steps-to-reduce-reach-of-repeat-sharers-of-misinformation/", "https://www.adweek.com/media/facebook-continues-efforts-to-battle-covid-19-vaccine-misinformation/", "https://www.forbes.com/sites/melissaholzberg/2021/03/22/facebook-banned-13-billion-accounts-over-three-months-to-combat-fake-and-harmful-content/?sh=3114f1cc5215", "https://www.politifact.com/article/2021/may/17/debating-origins-covid-19-virus-what-we-know-what-/", "https://www.youtube.com/watch?v=rpyOJZ0s5q8", "https://sciencefeedback.co/", "https://healthfeedback.org/", "https://www.collective-evolution.com/2019/01/11/new-app-newsguard-promises-to-stop-fake-news-have-a-look-at-who-owns-funds-it/"], "authors": [], "publish_date": null}