{"result_id": "077029", "URL": "https://www.cfact.org/2021/08/04/astounding-lack-of-questioning-of-latest-proof-of-man-made-climate-change/", "timestamp": "2023-04-25 14:47:37 CEST+0200", "meta": {"description": "Be it climate, Covid, or whatever, the press just marches along without bothering to question.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.cfact.org/2021/08/04/astounding-lack-of-questioning-of-latest-proof-of-man-made-climate-change/", "encoding": "utf-8"}, "image": null, "domain": "www.cfact.org", "title": "Astounding lack of questioning of latest \"proof\" of man made climate change", "cleaned_text": "Marc Morano sent me this, as he probably sensed I was in a relaxed mood and was concerned my blood pressure might be too low.\n\nBut this is getting near and dear to my heart as the article is talking about the oceans.\n\nFirst of all, I do not dismiss out of hand the research done here. What is amazing to me and continues to astound me, be it climate, covid, or whatever is a press that just marches along without bothering to question. So I figure I will share some questions with you.\n\nObviously, there is a vast difference in the questioning I am doing here as opposed to the NYT opinion piece on July 15 in which the author was so clueless, he seemed to be in favor of eco-terrorism to stop climate change.. In this case, the research is by a reputable group at Princeton, but it goes completely unchallenged by the media. So here are some things that if the media would actually do their job, would explain why there should be skepticism.\n\nI want you to look at this:\n\nThese are the skin surface temperatures as recorded on this site\n\nand you can go back here and look at the ocean temps of every year back to the around 1980\n\non the extreme left is right now, In the middle is 2005. on the right 1989\n\nHow is it that since 2005 there has been much less visible change than the previous 16 years, yet the input of co2 is supposedly causing runaway warming?\n\nYou can see the big jump in SST is between 1989 and 2005. Since then it has leveled off.\n\nSo I went to this site, an NOAA site, to cross-check\n\nThe first chart shows the difference in temperatures between 2005 and 2021\n\nnotice large areas where its actually cooler ( blue) and the relative areas of warming ( green and yellow)\n\nSure enough when I went to the other difference between 2005 and 1989, much more oceanic warming:\n\nAnother interesting ditty is the temperatures north of 60 north, They were obviously warmer than average in 2005, but appear to be at 1989 levels now. Interesting because these are summertime temperatures. The lion’s share of the warming is in the winter which would be linked to water vapor, not co2. So I went to the DMI arctic temp site, north of 80 north to check out summer temperatures to see if that is right\n\nNorth of 80 north, ITS ACTUALLY COOLER THIS SUMMER!\n\none can get every yearly temperature back to 1958\n\nOne can see there is NO ARCTIC WARMING IN THE SUMMER, more evidence that there is some kind of limiting factor going on contrary to the runaway warming answer that is being pushed!\n\nSo why isn’t the media bringing this up?\n\nNow here are some other questions, Exactly what explains oceanic warming? There is so much WE DO NOT KNOW ABOUT THE OCEANS. Radiation from warming earth is important in the process since there are co2 bands that absorb that radiation. But explaining the warming of the ocean because of the very factor THAT ACTUALLY DEPENDS ON THE EARTHS WARMING, means assuming its co2 that is causing the warming. But what about the oceans naturally warming and then the co2 reaction? So the assumption here could be the tail is wagging the dog and is certainly questionable. Why no questions about the accuracy and amount of large-scale measuring of deep-ocean heat now vs 30 to 50 or even 70 years ago. We could not measure it 70 years ago and the way we measure sst was primitve. Ships would put buckets into the water and then pull them back out and take the temperature. I rather doubt each observer made sure it was 3 feet deep when they put the bucket in the water. So we have a basis of comparison that is almost no basis at all relative to the complex way we can determine ocean temperatures today, In fact, we do not know how much warming is from underwater hydrothermal vents, which are more active in times of low solar. These release large amounts of heat into the ocean. We do not know if there is some type of cyclical intersection of multi-decade and even century cycles. Left on their own accord they may compete against each other so they are un-noticed. But if they intersect, then they can push the oceans one way or the other. Mariners know full well about rogue waves, the sudden development or arrival of a wave that appears out of nowhere. The reason is associated with waves that may have originated far away, and on their own are unnoticed, but if they intersect, can create a large wave.\n\nAnother factor: We have had 200 years of high solar. Just where would the heat from that be stored? It seems very hard to believe that the sun had no effect on the oceans. We actually see oceanic responses to the solar cycle in shorter terms. Which of course leads to weather responses. So why no questions about this and the cumulative warming that may have been stored and ready to respond given what I have just shown above?\n\nThen there is the problem I bring up all the time, there is no respect for the limitations brought about by destructive interference of the system to counter and establish a new balance. The rogue wave theory is the opposite, where events combine to create a bigger event, But that bigger event will then encounter resistance. That could be the reason for, despite the continued increase of co2, the warming rate in the oceans dimishing.\n\nAre there any questions by the media about this? After all Le Cheteliers is a well-known idea taught in chemistry 101.\n\nNow here is a problem also. Let’s look at surface pressures in the Indio-Pacific basin the past 15 years\n\nLower than average over Asia ( which would make sense if it is warmer) and higher than normal in the eastern Pacific.\n\nWhat happens when there is lower pressure to the west. What does that do to the low-level wind in the tropical Pacific?\n\nThey increase from the east. What happens when winds increase from the east over the western Pacific? It leads to La Ninas developing, And how important are La Ninas? Well look at the response in the global temperatures to La Ninas ( black lines)\n\nWhat did it look like in the previous 15 years which had the 97-98 Super Nino in it and the much stronger warmup in the oceans?\n\nhigher pressures over land a lessening of the easterlies and the warming that took place.\n\nYou literally can see the system fighting back, not running off to some kind of the point of no return. In fact, HIGH SOLAR encourages La Ninas. While the La Nina last year that will redevelop this winter is not that strong, it has knocked back the warming from the 15-16 Super Nino and the following el Nino, I suspect we will have another El Nino in response to the current La Nina around 2023 or 2024, but the La Nina behind that may be quite strong near the peak of the Solar Cycle. BTW decreased incoming solar radiation encourages el Ninos. This is why El Ninos like to show up on the downturn and near the end of a solar cycle. I get a lot of the solar people mad when I point out low solar encourages el Ninos. El Nino’s releases water vapor and this leads to warming, a lot of it where it is coldest and driest.\n\nBut if the media knew what to look for, they would ask questions. Is Oceanic warming actually promoting a surface pressure pattern that would lead to the limitation of warming? Again the tendency for any system to try to reestablish equilibrium, not just run off into some atmospheric apocalypse.\n\nAnother problem that is not addressed by the media. The significance of the warming being distorted toward the coldest driest areas in their coldest and driest time of the year, while where life thrives, warming is less\n\nAnd what of using temperatures as the metric of climate? Far better given the nature of water vapor would be the WET BULB TEMPERATURE. Even better: Saturation mixing ratios, which have a direct correlation to temperatures. We have no such correlation with co2. So why not go right to the source? Because it would show this is not the big deal it’s purported to be. And in fact, may actually be a benefit given the advancement of life on the planet and the adaptation to it.\n\nYou see how many questions there are and this is just the tip of the iceberg. But imagine if the research had come out and listed all these doubts. Do you think for one second it would be something being pushed? Of course not. It’s similar to the vaccine. The only answers that are shown are pro-vaccine answers. Yet there is much information out there, be it climate or covid, ( or anything) that raises questions. And is a reason for skepticism\n\nWhen the deck is stacked for one answer, and the media refuse to do what used to be a badge of honor ( try to dig in and find counters to the missive) then this is what you get. In this case, The ( continued) weaponization of weather in a phony climate war. ( wonder where I have heard that before)", "opengraph": {"locale": "en_US", "type": "article", "title": "Astounding lack of questioning of latest \"proof\" of man made climate change", "description": "So lets read this:\r\n\r\nhttps://www.nbcnews.com/science/environment/earths-energy-imbalance-removes-almost-doubt-human-made-climate-change-rcna1562\r\n\r\nMarc Morano sent me this, as he probably sensed I was in a relaxed mood and was concerned my blood pressure might be too low.\r\n\r\nBut this is getting near and dear to my heart as the article is talking about the oceans.\r\n\r\nFirst of all, I do not dismiss out", "url": "https://www.cfact.org/2021/08/04/astounding-lack-of-questioning-of-latest-proof-of-man-made-climate-change/", "site_name": "CFACT", "article:publisher": "http://www.facebook.com/cfact", "article:published_time": "2021-08-04T14:51:11+00:00", "article:modified_time": "2021-08-04T14:54:45+00:00", "image": "https://www.cfact.org/wp-content/uploads/2021/02/where-is-global-warmings-missing-heat-coming-from-part-2.jpg", "image:width": "848", "image:height": "565", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.nbcnews.com/science/environment/earths-energy-imbalance-removes-almost-doubt-human-made-climate-change-rcna1562", "https://maps.weatherbell.com/view/historical-ssts", "https://psl.noaa.gov/data/composites/day/", "http://ocean.dmi.dk/arctic/meant80n.uk.php", "https://www.cfact.org/author/joe-bastardi/"], "authors": ["Joe Bastardi"], "publish_date": "2021-08-04T14:51:11+00:00"}