{"result_id": "077017", "URL": "https://www.cfact.org/2022/04/04/watch-cfacts-morano-on-tucker-carlson-gnd-coming-via-emergency-declarations/", "timestamp": "2023-04-25 14:47:24 CEST+0200", "meta": {"description": "\"They introduced the Green New Deal in Congress and never scheduled hearings, votes, there were no town halls, there were no constituent services. No one wanted, they didn’t want to vote on it. They didn’t need a vote.\"", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.cfact.org/2022/04/04/watch-cfacts-morano-on-tucker-carlson-gnd-coming-via-emergency-declarations/", "encoding": "utf-8"}, "image": null, "domain": "www.cfact.org", "title": "Watch 's Morano on Tucker Carlson: GND coming via \"emergency declarations\"", "cleaned_text": "CFACT’s Marc Morano, editor of Climate Depot and Director of Communications, appeared on Tucker Carlson to discuss how the Left is attempting to implement the Green New Deal by circumventing the democratic process with emergency declarations.\n\nMorano: “They know the Green New Deal won’t pass…The solution to the Russian invasion is the same solution to climate change, it happened to be the same solution to COVID too — which is more working from home, less driving, less freedom, more restrictions on your liberty. Regardless of the crisis, it always empowers the administrative state, the bureaucrats, and those in power. …\n\n“They are going to rule by emergency declaration, by crisis management. This is how they want to do it. The COVID emergency declaration gave us, particularly in blue states, some red states, every governor became a dictator virtually overnight as they imposed whatever mandate they felt like. Whether it was masks, kids, vaccine passports, you name it, they could do it because they were empowered.”\n\nTucker Carlson: “There’s a reason they are focused on Ukraine and it’s to give you the Green New Deal whether you want it or not. Marc Morano is the author of “Green Fraud: Why the Green New Deal is Even Worse than you think. He joins us tonight.\n\n“Marc, thanks so much for coming on. You’ve written and thought so much and reported so much about the Green New Deal. No chance Congress would ever pass anything like that because nobody wants it, but a war into which we are now being drawn because of their policies is a perfect cover for giving us the Green New Deal whether we want it or not.\n\nMorano: “Yes, it is. They introduced the Green New Deal in Congress and never scheduled hearings, votes, there were no town halls, there were no constituent services. No one wanted, they didn’t want to vote on it. They didn’t need a vote. Biden declared that every cabinet agency would be a climate agency. One of the biggest things about our energy that a lot of people miss is the defunding of our energy industry. Through the banking system, through the SEC. They are now forcing climate disclosures on everyone. They now have their claws — federally regulators — in every aspect of pretty much of any business going forward if this keeps up, without a vote of Congress. That’s what they’re looking for.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Watch CFACT's Morano on Tucker Carlson: GND coming via \"emergency declarations\"", "description": "CFACT's Marc Morano, editor of Climate Depot and Director of Communications, appeared on Tucker Carlson to discuss how the Left is attempting to implement the Green New Deal by circumventing the democratic process with emergency declarations.\r\n\r\nWatch the full segment here.\r\n\r\nMorano: \"They know the Green New Deal won't pass...The solution to the Russian invasion is the", "url": "https://www.cfact.org/2022/04/04/watch-cfacts-morano-on-tucker-carlson-gnd-coming-via-emergency-declarations/", "site_name": "CFACT", "article:publisher": "http://www.facebook.com/cfact", "article:published_time": "2022-04-04T13:21:15+00:00", "image": "https://www.cfact.org/wp-content/uploads/2022/04/Morano-Tucker-April-3.png", "image:width": "848", "image:height": "565", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://air.tv/?v=SvUL3J8OTveKVQqxs1cIBw", "https://air.tv/?v=SvUL3J8OTveKVQqxs1cIBw", "https://www.cfact.org/author/cfact/"], "authors": ["CFACT"], "publish_date": "2022-04-04T13:21:15+00:00"}