{"result_id": "077020", "URL": "https://www.cfact.org/2023/03/05/bill-gates-climate-change-deceptions-are-taking-us-for-a-billion-dollar-ride/", "timestamp": "2023-04-25 14:47:27 CEST+0200", "meta": {"description": "BBC journalist Amol Rajan recently braved going off the mainstream media script, asking the Microsoft co-founder how he responds to charges that he’s a hypocrite for claiming to be “a climate change campaigner” while traveling the world on his private jets, even to confabs where global elites tell poor and middle-class families to live simpler lives and stop using fossil fuels.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.cfact.org/2023/03/05/bill-gates-climate-change-deceptions-are-taking-us-for-a-billion-dollar-ride/", "encoding": "utf-8"}, "image": null, "domain": "www.cfact.org", "title": "Bill Gates’ climate change deceptions are taking us for a billion-dollar ride", "cleaned_text": "Bill Gates donates hundreds of millions of dollars to social, health, environmental and corporate media causes. He’s not used to being asked tough questions.\n\nBBC journalist Amol Rajan recently braved going off the mainstream media script, asking the Microsoft co-founder how he responds to charges that he’s a hypocrite for claiming to be “a climate change campaigner” while traveling the world on his private jets, even to confabs where global elites tell poor and middle-class families to live simpler lives and stop using fossil fuels.\n\nOne of his jets is a $40 million Bombardier BD-700.\n\nMr. Gates also spends his riches (estimated 2022 post-divorce net worth: $107 billion) telling people what they should eat, what cars they should drive, what their children should learn in school, and more.\n\nClearly annoyed and caught flat-footed, Mr. Gates defended his use of fuel-guzzling, carbon-spewing aircraft by claiming he purchases “carbon credits” to offset his energy use and generally luxurious lifestyle. He also visits Africa and Asia to learn about farming and malaria and spends billions on “climate innovation.”\n\nIn the real world, carbon offsets are part of the problem, not the solution. They don’t help Main Street. They help the Gates & Friends Climate Armageddon Club become even wealthier.\n\nOver the past five years, Elon Musk’s Tesla Inc. pocketed $5 billion buying, selling and trading carbon credits. In 2021, CNBC discovered that the company’s credit revenue was greater than its automotive cash flow. How times have changed since manufacturing tycoons got rich by selling products, not pushing climate indulgences.\n\nMr. Musk also loves flying around in private jets. Last summer, he even took a 9-minute, 55-mile flight from San Francisco to San Jose instead of driving a Tesla. Many say it goes hand in hand with the way he’s made a science of lobbying government agencies to subsidize his fire-prone cars and SpaceX rockets.\n\nIt’s all to protect the environment, of course. Just ignore how the cars and lifestyles are built on metals extracted and processed with African child labor and lakes of toxic chemicals.\n\nVice President Al Gore left office with $2 million in net worth. He’s since raked in some $330 million railing about “rain bombs” and “boiling oceans” and shilling for government and corporate investments in so-called green energy that also relies on supply chains running through Africa and China.\n\nOf course, Messrs. Gore, Gates, Musk and their World Economic Forum colleagues are much too important to go anywhere commercially. They’re all shepherded between private homes and global gatherings in private jets and limousines.\n\nBut here’s the truly hard reality. Wind and sunshine are clean, renewable and sustainable. But harnessing these unreliable, weather-dependent energy sources to power modern economies requires millions of tons of metals and minerals extracted from billions of tons of ore, using dirty, polluting processes in lands out of sight and mind. None of that is clean, renewable, sustainable or equitable.\n\nReturning to Mr. Gates’ wide-ranging “climate crisis” agenda, his book “How to Avoid a Climate Disaster: The Solutions We Have and the Breakthroughs We Need” calls on the world to replace beef with synthetic meat. Cattle emit methane, a greenhouse gas (00.00019% of Earth’s atmosphere; equivalent to $1.90 out of $1,000,000), so people must eat fake meat made from vegetables and insects.\n\nThat sounds like the ravings of a madman. But Mr. Gates will profit mightily if his scheme comes to fruition. He’s a major investor in the imitation meat company Impossible Foods, as is Mr. Gore.\n\nHow convenient. Wealthy elitists can save the world and get richer at the same time! Although Beyond Meat’s stock is down more than 75% from its previous highs, Messrs. Gates and Gore are likely laughing all the way to the bank, while gullible consumers are left holding bags of rotting fake burgers.\n\nNever mind that the “climate crisis” is based on computer models that predict hurricane, tornado, flood, drought, sea level rise and other disasters far greater than the world is experiencing. The models also ignore five great ice ages and interglacial periods, the Medieval Warm Period and Little Ice Age, the Anasazi and Mayan droughts, and other inconvenient climate truths.\n\nThe climate change movement’s deceptions and contradictions seem to have no bounds. How is the vast majority of the public oblivious to them?\n\nFTX founder and alleged fraudster Sam Bankman-Fried explained it well. He avoided media and regulator scrutiny, he admitted, by donating to influential media outlets, just as Mr. Gates does. That garners favorable press and social media, which also ignore, cancel and deplatform most criticism.\n\nFortunately, influential reporters like Mr. Rajan are slowly but surely publicizing what the rest of the bought-and-paid-for “journalist” classes still won’t. As a result, more people are peeking behind the curtain and finding that self-interest, double-dealing and fake science are conjuring up the climate change Armageddon scare stories.\n\nGates and friends’ climate confidence games are costing society trillions of dollars in the name of saving Mother Earth. Hopefully, these courageous journalists’ work (and troves of Twitter emails) will start saving taxpayers and families from even more destructive policies.\n\nThis article originally appeared in The Washington Times", "opengraph": {"locale": "en_US", "type": "article", "title": "Bill Gates’ climate change deceptions are taking us for a billion-dollar ride", "description": "Bill Gates donates hundreds of millions of dollars to social, health, environmental and corporate media causes. He’s not used to being asked tough questions.\r\n\r\nBBC journalist Amol Rajan recently braved going off the mainstream media script, asking the Microsoft co-founder how he responds to charges that he’s a hypocrite for claiming to be “a climate change", "url": "https://www.cfact.org/2023/03/05/bill-gates-climate-change-deceptions-are-taking-us-for-a-billion-dollar-ride/", "site_name": "CFACT", "article:publisher": "http://www.facebook.com/cfact", "article:published_time": "2023-03-05T10:36:52+00:00", "article:modified_time": "2023-03-01T18:39:24+00:00", "image": "https://www.cfact.org/wp-content/uploads/2020/08/bill-gates-warns-of-climate-disaster.jpg", "image:width": "814", "image:height": "551", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.washingtontimes.com/news/2023/feb/28/bill-gates-climate-change-deceptions-are-taking-us/", "https://www.cfact.org/author/paul3/"], "authors": ["Paul Driessen"], "publish_date": "2023-03-05T10:36:52+00:00"}