{"result_id": "077015", "URL": "https://www.cfact.org/2021/03/12/official-congressional-summary-of-the-1-9-trillion-covid-bill/", "timestamp": "2023-04-25 14:47:22 CEST+0200", "meta": {"description": "Adjusted for today's dollars the Second World War cost $4.1 trillion.  Yesterday the United States committed to spend nearly half of that. The American Rescue Plan Act of 2021 summarized and by the numbers.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.cfact.org/2021/03/12/official-congressional-summary-of-the-1-9-trillion-covid-bill/", "encoding": "utf-8"}, "image": null, "domain": "www.cfact.org", "title": "Congressional summary of the $1.9 trillion \"Covid\" law plus cost breakdown", "cleaned_text": "Adjusted for today’s dollars the Second World War cost $4.1 trillion. On March 11, 2021 the United States committed to spend nearly half of that.\n\nThis bill provides additional relief to address the continued impact of COVID-19 (i.e., coronavirus disease 2019) on the economy, public health, state and local governments, individuals, and businesses.\n\nSpecifically, the bill provides funding for\n• agriculture and nutrition programs, including the Supplemental Nutrition Assistance Program (SNAP, formerly known as the food stamp program);\n• child care and programs for older Americans and their families;\n• payments to state, local, tribal, and territorial governments for economic relief;\n• programs for health care workers, transportation workers, federal employees, veterans, and other targeted populations;\n• state, territorial, and tribal capital projects that enable work, education, and health monitoring in response to COVID-19; and\n\nThe bill also includes provisions that\n• make up to $10,200 of 2020 unemployment compensation tax-free;\n• expand and otherwise modify certain tax credits, including the child tax credit and the earned income tax credit;\n• provide premium assistance for certain health insurance coverage; and\n• require coverage, without cost-sharing, of COVID-19 vaccines and treatment under Medicaid and the Children’s Health Insurance Program (CHIP).\n\nA breakdown of the deficit impact of the law compiled by the Committee For a Responsible Budget. A few provisions were tweaked prior to passage such as the elimination of the $15 minimum wage by the Senate Parliamentarian.\n\nThis table shows the deficit impact of various provisions, which may differ slightly from the total amount of aid offered. For instance, $50 billion is allocated to the Disaster Relief Fund, but CBO estimates that only $47 billion will ultimately be spent, based on past precedent. As another example, there are $15 billion in loans and grants given to airlines, but the previous version of this bill has led CBO to conclude that $3 billion will ultimately be repaid or given to the government as stock as a condition of accepting the support.\n\n*The total removes $14 billion from COBRA subsidies and funding for LIHEAP that are shared between two committees and would be double-counted if summing each committee’s total.", "opengraph": {"locale": "en_US", "type": "article", "title": "Congressional summary of the $1.9 trillion \"Covid\" law plus cost breakdown", "description": "Adjusted for today's dollars the Second World War cost $4.1 trillion.  On March 11, 2021 the United States committed to spend nearly half of that.\r\nAmerican Rescue Plan Act of 2021\r\nSigned into law 03/11/2021\r\nPassed Senate 03/06/2021\r\nCongressional Summary\r\nThis bill provides additional relief to address the continued impact of", "url": "https://www.cfact.org/2021/03/12/official-congressional-summary-of-the-1-9-trillion-covid-bill/", "site_name": "CFACT", "article:publisher": "http://www.facebook.com/cfact", "article:published_time": "2021-03-12T05:57:24+00:00", "article:modified_time": "2021-03-12T06:38:49+00:00", "image": "https://www.cfact.org/wp-content/uploads/2021/03/auto-draft-83.jpg", "image:width": "843", "image:height": "595", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.cfact.org/wp-content/uploads/2021/03/official-congressional-summary-of-the-1-9-trillion-covid-bill-plus-cost-breakdown.jpg", "https://www.crfb.org/blogs/whats-19-trillion-house-covid-relief-bill", "https://www.cfact.org/author/cfact-ed/"], "authors": ["CFACT Ed"], "publish_date": "2021-03-12T05:57:24+00:00"}