{"result_id": "077007", "URL": "https://www.cfact.org/2021/08/09/clivid-derangement-syndrome/", "timestamp": "2023-04-25 14:47:14 CEST+0200", "meta": {"description": "The political linkage between Climate and Covid grows each day.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.cfact.org/2021/08/09/clivid-derangement-syndrome/", "encoding": "utf-8"}, "image": null, "domain": "www.cfact.org", "title": "\"CLIVID\" Derangement Syndrome", "cleaned_text": "I define it as doing or saying anything to avoid confronting facts that would question your position on Climate or Covid. It is similar and heading for the same kind of thing we saw with Trump and before him, George Bush, completely shutting out any positives they may be doing.\n\nThe linkage between Climate and Covid politics grows each day. It makes me more grateful that I included 2 chapters on this in my book, The Weaponization of Weather in the Phony Climate War. The real link is what looks to be a state-influenced form of yellow journalism where only one side is reported. So I am going to give a few examples to make my point\n\nLet’s see. This headline from NOAA:\n\nAtlantic hurricane season shows no signs of slowing down\n\nThis is not factual\n\nYou had a jackrabbit start in JUNE with close to 5x the average ACE Index by July 6th. Its been over a month since anything has developed. Now my company is very bullish and has been from March on the impact season again this year. Please take the time and read our ideas since its not just a number game with us, but we try to show people where they go. In fact, I challenge you to look at ours:\n\nand compare it to other ideas out there as far as showing you things you may not be seeing\n\nAnd by the way, the hurricane season is about to pick up again and dramatically for 3 or 4 weeks because we are going into a similar pattern we saw much of last year and did see in June. But we have been out of it for a month, hence the slow down\n\nBut here is my point, We had a record July last year. The reason had to do with something weatherbell.com subscribers know and probably you too know by now, my belief that what may be the most valuable tool for forecasting and actually linked to the changing conditions on the planet, the MJO is showing us the way better. The problem is models are helpless in forecasting it and there seems to be no urgency out there to improve this for one. What is nuts is as important as it is, no one wants to comment on its link to the climate, an actual valid variable to be concerned with rather than cherry-picking events that can be proven to be questionable if not outright wrong\n\nBack to NOAA. The season certainly did slow down, We had a nothing July once Elsa went by. This was in stark contrast to last year which did not slow down. And instead of the article acknowledging that it headlined the opposite. Now if they had said,, Atlantic hurricane season to roar back to life, I have no problem with that. But that would be forecasting, wouldn’t it? And there is a chance we ( cause I think it is too) can be wrong, maybe it does not. But changing the facts of what has happened with a headline like that is what I refer to as the weather-weaponizing media. They even weaponize non-events.\n\nHow can I tell it’s lowed down? Last year at about this time Jim Cantore was getting a leg workout trying to stand on the beach against Hurricane Isaias. We are way behind that pace and have gone a month with nothing, while last year we had 5\n\nLet’s go to Greenland Ice. Greenland is melting like crazy, right? Every summer we get stories on the Greenland ice cap melting, Imagine that, ice melting is summer.. This looks bad, real bad doesn’t it?\n\nUntil you put it into perspective as to how much its been snowing!\n\nup until recently more mass gain than loss!\n\nIts true it has been warmer than normal. Notice the scorching western US but is anyone telling you how cool much of NAMER has been?\n\nBTW that warmer than average in Greenland may have some big winter implications as it is correlated with blocking over Greenland in the following winter and a quicker and colder than average start to winter in the east. I did a blog on this a couple of weeks ago with the linkage to the spring MJO, cold May, hurricane season than the start to winter. But again there is no framing for perspective in the Greenland missive.\n\nMore than the average number to date, but below-average acreage burnt to date\n\nAnd while I have you here, how come we don’t show people how bad wildfires have been in history\n\nSo more acreage used to be burnt, but then again 100 years ago there were fewer people living in harms way. And there was no cherry picking meteo media with an obvious agenda, was there? The good old fashion yellow journalism left climate and weather alone. Not its dragged into the sewer of politcal agendas.\n\nAnd of course, severe weather this year, when combining tornadoes, hail, and wind damage is the lowest this century. Anyone saying boo about that?\n\nNow to Covid. Again the linkage is a lack of perspective and a seeming willingness for media not to question and in effect engage in a yellow journalism meant to push an agenda ( which seems to me to be taking down the very foundations that have made this nation the envy of the world)\n\nI was watching the Pro football hall of fame induction today in what looked to be a packed arena in Canton Ohio\n\nLast year at this time no such gatherings could take place and football seasons were being shut down or delayed. So how is it Covid is twice as prevalent yet we do not have a consistent response or at least an explanation\n\nNote I am not advocating a shutdown. I do want the people that were hysterical last year and wanted the nation shut down going into the election, to come clean. You either were guilty of a false hysteria, or you decided that by any means necessary you wanted to handicap the electoral process. So which is it? Either way, you can’t simply ignore the facts in front of us relative to last year\n\nBut the lack of perspective gets worse\n\nThis is off the Vaers Site. There are adverse reactions.\n\nNow, THIS IS REMARKABLY LOW!!!! There have been over 350 MILLION. does given out, and the over half million adverse reports give a 1 in 7000 chance of an adverse reaction, For the record, I am anti-sticking needles in me. Someone I knew got a shingles vaccine ( I was tempted and since I got shingles and one minute I was afraid I was going to die, the next minute I was afraid In wouldn’t). But a week after he got it, he was dead, after being perfectly healthy when he got it, And yes he was blaming it . The fact is you don’t know for sure anytime you introduce something foreign into your body what is going to happen. 1 in 7000 is VERY VERY LOW. But ZERO in 7000 means it is impossible to have an adverse reaction and are infinitely better odds.\n\nBut the point lies with even further digging, For if you can still get Covid with the vaccine, why even take the chance? The fact is we are not being told what is going on that matter, We can guess The CDC saying everyone must wear masks speaks volumes, Is it 1%. 10%. or in some cases 80% that can still get Covid? We are seeing examples that have outrageously high percentages of vaccinated people with Covid again. And there are plenty of people speaking up, but it is being muzzled. But the facts are not all out there.\n\nHow about the complete lack of curiosity as to how a 70 plus man arguably 50 lbs overweight, likely stressed out, reportedly sleeping 4 hours a night and accused of being demented, kicked Covid in 4 days. ( President Trump) No one says boo. There was no vaccine, so how did he do it? I suspect I know, but the therapeutics he had mentioned and had been trashed by the media could not be brought up, since we were all in on the Vaccine. A vaccine few people would have taken if Trump had been elected. Does anyone remember this?\n\nWhy does no one question that or at least put it in perspective\n\nThe fact is the only way for the vaccine to get distributed even this widely is to make darn sure Trump did not win. If he did, you would have had 50% of the nation against it because of the facts you see above and a bunch of Trump supporters against it too, cause alot of us to believe it’s no ones business how we take care of ourselves. And why aren’t the demographics on who is and is not getting the vaccine being releases. Almost all people my age and older I know. ARE GETTING IT. My concern for them is they do not know they are still at risk of getting this thing but have been pushed into a false sense of security.\n\nThe Delta surge in the US is very bad in certain states. We had a million largely unvaccinated and untested immigrants that went thru a nation where the variant was surging, released into the country.. What do you think is going to happen? That is not rocket science\n\nBut again, one-sided reporting. Enough so that the linkage can at least be speculated on, if not be the logical conclusion. Its CLIVID derangement syndrome in these cases, making sure only 1 side is reported. A true Super-Spreader event of one-sided information, and in reality, when it comes to objective reporting on either matter,\n\nI long for the day when a super spreader event was not a gathering of a large crowd of people, just what farmers did in the spring, With CLIVID derangement syndrome, we have journalism engaging in a super spreader event of one-sided information. And it leads to tainting the field with what smells like a farmer’s field after it’s fertilized in the spring.\n\nMy advice is to look at all sides of the issue. Seek out what you do not see. Then make your decision with the free will God has gifted you with. Climate, Covid, or whatever.\n\nJoin Joe Bastardi and Climate Depot’s Marc Morano Tuesday evening at 8:00 PM EDT on Zoom for a discussion of their books and the new UN IPCC climate science report.", "opengraph": {"locale": "en_US", "type": "article", "title": "\"CLIVID\" Derangement Syndrome", "description": "Clivid Derangement Syndrome.\r\n\r\nI define it as doing or saying anything to avoid confronting facts that would question your position on Climate or Covid.  It is similar and heading for the same kind of thing we saw with Trump and before him, George Bush, completely shutting out any positives they may be doing.\r\n\r\nThe linkage between", "url": "https://www.cfact.org/2021/08/09/clivid-derangement-syndrome/", "site_name": "CFACT", "article:publisher": "http://www.facebook.com/cfact", "article:published_time": "2021-08-09T17:31:21+00:00", "article:modified_time": "2021-08-09T17:34:03+00:00", "image": "https://www.cfact.org/wp-content/uploads/2021/08/Woman-chain-climate.jpg", "image:width": "871", "image:height": "550", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.cfactstore.com/product/weaponization-of-weather-in-the-phony-climate-war/", "https://www.weatherbell.com/august-1-hurricane-season-update", "http://weatherbell.com/", "https://www.openvaers.com/covid-data", "https://us02web.zoom.us/webinar/register/WN_VLGF9KliS8Gc7ehRg0ubZA?mc_cid=1b6079d35f&mc_eid=UNIQID"], "authors": ["Joe Bastardi"], "publish_date": "2021-08-09T17:31:21+00:00"}