{"result_id": "077023", "URL": "https://www.cfact.org/2023/03/15/what-the-hell-is-going-on-here/", "timestamp": "2023-04-25 14:47:30 CEST+0200", "meta": {"description": "We switch from a known successful source of energy that has led to an exponential rise in the quality and length of life over the past 100 years, with America leading the way, to what?", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.cfact.org/2023/03/15/what-the-hell-is-going-on-here/", "encoding": "utf-8"}, "image": null, "domain": "www.cfact.org", "title": "What (the hell) is Going on Here?", "cleaned_text": "The real title is “Hell is Going on here.” Because the hiding of all the facts on any given matter of importance is an invitation to get on the highway to societal hell.\n\nSo here we go. Yet more, this time from Reuters, on the idea I have been trying to get across. The warming is largely natural and a likely culprit is natural geothermal input, independent of man.\n\nSee this article here.\n\nIt is happening in the Pacific too.\n\nAgain ask yourself. If Water Vapor is the number one GHG, and we can correlate WV to temps, and can not with co2 except for the handwaving argument co2 is going up so that has to be the cause, why are we not quantifying water vapor increase?\n\nWhere would that increase come from? ( The oceans)\n\nHow are the deep oceans warming if not from geothermal sources? The deception would be laughable if it was not the driving mechanism for what some estimate to be a. 300 trillion dollar expenditure by 2050 to wean us off fossil fuels. You don’t think that would be hell? So we switch from a known successful source of energy that has led to an exponential rise in the quality and length of life over the past 100 years, with America leading the way, to what? If you are so darned concerned, why not nuclear power, NG and shock, continue to green the planet more? Its as if you are hellbent on something and hence the title of this. We still don’t have the technology to even get close to what the Green Dealers are pushing, and relying on minerals that are mainly from other countries and that are likely limited, at least compared to the proven US Oil reserves of 400 years, is insanity. Who the heck comes up with this stuff unless it is a purposeful design to stratify the social order in a way where freedoms are curtailed and people are controlled? AKA SHARED MISERY.\n\nWhat is Hell? Create your own definition. But here is what I know. If you are not free to do as you please, think as you please, come and go as you please you can’t be that far from it for it runs EXACTLY OPPOSITE of the teachings that a mighty and merciful God gave us free will. It is anti-human progress, an attempt to stop man from reaching beyond his grasp to see what a heaven is for. It seems like it is not the stairway to heaven this agenda has us on, but a highway to Hell.\n\nSince 75% of the earth’s volcanoes are underwater, and we know next to nothing about them, it is a convenient way for a Wizard of Oz, pay no attention to the man behind the curtain, strategy. I have no ” peer review” on my contention. Just observation and reasoning. But they have no peer review it is not, because they will not push funding toward that research. Everything is to prove it’s co2. A familiar strategy and we are becoming aware of it in what is going on with Covid. But you can look at any issue ( in my lifetime all the way back to the Gulf of Tonkin incident to stir up support for more involvement in Vietnam.. I think RFK jr is channeling thru me ha ha).\n\nAnd what about the Meteorologist and Climatologist that simply go along to get along? How do sea surface temperatures hold steady for 50 years and then jump the last 35-40 years coinciding with the increase in seismic activity? THINK. If you could quantify the total energy of the air, vs the total energy of the ocean, how much more energy is there in the ocean? So why would the warming air which takes much less energy to warm, then somehow force the oceans to warm in tandem? Isn’t it far more likely that the oceans warm, and due to the constant exchange with the air, warm the air? If the oceans had not warmed, would the air have warmed? And given the relationship of WV to temperatures, with the oceans the prime source of WV, what is the source ? And now the kicker. Given co2 needs more Outgoing Longwave radiation from a warming planet to in turn help warm the planet if the ocean was not warming co2 would be a moot point. ( which it may very well be in the first place)\n\nBut here is what you do. Quantify the increase in Water vapor the past. 40 years. Correlate that to the temperature rise, Since there is more warming where it’s cold and dry the relationship is right there for all to see. And since that warming is factored into the missive that the planet is on fire, people will then see what is causing the warming, What is leftover, attribute to man, BUT WITH THE KNOWLEDGE THAT IF WE WERE NOT NATURALLY WARMING, the co2 feedback would be limited even further! Again why do we track co2 increase, but somehow water vapor is ignored?\n\nConsider this: How many things have you seen come out in your life that you did not question, but simply went along with what you were told, that over the years turned out different? And how arrogant do you have to be, or ignorant of history, to think that what you are pushing now may not suffer the same fate? It’s the typical Marxist idea, That Marxism is perfect, it is just that everyone else did it wrong, but now we will do it right. It fails to take into account a vital aspect, that Marxism and its control runs opposite of what nature and natures God designed man for, to be: FREE. I wrote in my book about the Covid climate link ( basically the Covid lockdowns were a warm-up for what would happen with the climate missive), and that means Climate is the mechanism for the control that is craved by those who though they may not deny God, are in a way seeking to play God. One man playing God over another leads to hellish results. So before we go down that road, perhaps we ought to stop and demand from our leaders, all the information on matters of importance where a government supposedly BY THE PEOPLE becomes a government that RULES THE PEOPLE.\n\nLook I don’t know if I have the answers. But I darn sure have the questions, And what I have observed with the oceanic warming can not be explained by the air warming the ocean. Given the US contribution of co2 to the atmosphere is .00000125 and co2 to do what its purported to do needs a warmer surface radiating in the first place, it seems to me that its at least something we should be looking at rather than dismissing or labeling people that question it as crackpots. How many times have we seen that before?\n\nIt is not that they have to be wrong, but there is plenty to look at to suggest they are not right. And asking us to all get in on what may be a highway to hell should have any rational person not willing to be in the vehicle that would do it.", "opengraph": {"locale": "en_US", "type": "article", "title": "What (the hell) is Going on Here?", "description": "The real title is “Hell is Going on here.” Because the hiding of all the facts on any given matter of importance is an invitation to get on the highway to societal hell.\r\n\r\nSo here we go.  Yet more, this time from Reuters, on the idea I have been trying to get across. The warming is", "url": "https://www.cfact.org/2023/03/15/what-the-hell-is-going-on-here/", "site_name": "CFACT", "article:publisher": "http://www.facebook.com/cfact", "article:published_time": "2023-03-15T16:03:06+00:00", "article:modified_time": "2023-03-16T14:12:12+00:00", "image": "https://www.cfact.org/wp-content/uploads/2017/08/Global-warming-thermometer-hype.jpg", "image:width": "450", "image:height": "366", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.reuters.com/business/environment/marine-heatwaves-are-sweeping-seafloor-around-north-america-2023-03-13/"], "authors": ["Joe Bastardi"], "publish_date": "2023-03-15T16:03:06+00:00"}