{"result_id": "077030", "URL": "https://www.cfact.org/2023/04/07/the-great-food-reset-2/?utm_source=rss&utm_medium=rss&utm_campaign=the-great-food-reset-2&utm_source=rss&utm_medium=rss&utm_campaign=the-great-food-reset-2", "timestamp": "2023-04-25 14:47:38 CEST+0200", "meta": {"description": "It’s time for the Great Reject!", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.cfact.org/2023/04/07/the-great-food-reset-2/", "encoding": "utf-8"}, "image": null, "domain": "www.cfact.org", "title": "The Great Food Reset", "cleaned_text": "America’s food security is being threatened by the forces of the Great Reset led by the World Economic Forum in Davos and under the thumb of the United Nations “sustainable development” Agenda 2030. “Biden Says to Expect ‘Real’ Food Shortages Due to Ukraine War,” blared a headline from Bloomberg News in 2022. “It’s going to be real,” Biden asserted. The U.N. estimated that 2.3 billion people are severely or moderately hungry globally.\n\nA food crisis is just the ticket for even more chaos that the WEF can exploit for their Reset agenda. “Over the last decade” China has been “snapping up farmland and purchasing major agribusinesses,” according to a 2021 report by Politico. “By the start of 2020, Chinese owners controlled about 192,000 agricultural acres in the U.S., worth $1.9 billion, including land used for farming, ranching, and forestry, according to the Agriculture Department.”\n\nDuring a House Appropriations Committee hearing, Rep. Dan Newhouse (R-WA) noted that “the current trend in the U.S. is leading us toward the creation of a Chinese-owned agricultural land monopoly.”\n\nBut don’t worry, China has competition for gobbling up U.S. farmland. The quest for a Chinese land monopoly is being challenged by Bill Gates! Gates’s fake-meat agenda could transform American farming. “All rich countries should move to 100% synthetic beef,” Gates has urged.\n\n“Farmers [are being] turned into renters” as Gates becomes the “nation’s largest farmland owner” by using “a web of at least 22 limited liability shell companies,” reported NBC News in 2021. “Young farmers” are “going up against these billionaire investors…. Who can compete with the likes of Bill Gates, right? More and more we are seeing farmers turn into renters,” tech reporter April Glaser explained, noting that more farmland could be “gobbled up by an investor class.” “Bill Gates isn’t the one in overalls,” Glaser pointed out. “He is not the one on the tractor doing the farming. He is the landlord here.”\n\nThe question looms: China or Bill Gates, who is more of a threat to America?\n\nThe World Economic Forum is so eager to promote synthetic “meat” that they are touting numerous ways to print up to 6 kilograms of the fake meat an hour. As part of this new coerced Great Diet Reset, the WEF has been advocating eating bugs to save the planet. The Davos-based group has explained, “Why we might be eating insects soon.” World Economic Forum senior writer Sean Fleming explained, “The global market for edible insects could grow to $1.18 billion by 2023. That’s almost triple its current level.”\n\nAccording to Fleming, “Per kilo of live weight, bugs emit less harmful gas than more mainstream farm animals. A cow, for example, produces 2.8 kg of greenhouse gas per kilo of live body weight. Insects, on the other hand, produce just 2 grams,” WEF claimed.\n\nOur future is being planned by our overlords, load up on eating bugs to save the planet! It is a future that will happen, only if we allow it.\n\nThe New York Times is all on a Great Food Reset. The paper praised inflation as a way “to drive welcome change for the planet” by “adjust[ing] what we eat to save both our pocketbooks and our planet.” Culture & lifestyle journalist Annaliese Griffin writing in the New York Times on June 2, 2022, wrote: “Inflation has the potential to drive welcome change for the planet if Americans think differently about the way they eat.”\n\n“Climate change has motivated some to eat less resource-intensive meat and more vegetables, grains and legumes, but this movement has not reached the scale necessary to bring needed change — yet,” Griffin wrote.\n\nGriffin gushed: “Inflation resulting from the cost of fuel and feed, coupled with supply chain slowdowns, may make meat substitutes more affordable relative to traditional, factory-farmed meats.” She added, “Historically, cost has been a powerful force that has changed Americans’ diets.”\n\nThe New York Times seems bent on updating Gordon Gekko’s phrase from the 1987 film Wall Street: Chaos, for lack of a better word, is GOOD. Climate activists in academia, the Biden administration and the media seem to think the more humans suffer, the more the planet will benefit.\n\nThis is more evidence that economic calamity, debt, inflation, supply chain issues, and skyrocketing meat and energy costs are not the unintended consequences of the climate agenda, but the INTENDED consequences. Chaos conditions the public to accept more centralized control of their lives.\n\nVladimir Lenin reportedly once said, ‘worse is better’ or ‘the worse, the better’ to cheer on chaos and the destruction of the existing order to impose his ideology.\n\nActor and now anti-Great Reset activist Russell Brand eloquently denounced the forces trying to reset our lives and food by declaring they are trying to destroy ordinary people. “You have to recognize that organic farming is not the desired endpoint,” Brand explained. “The displacement of the people is the desired end point. The disempowerment of the farmers — the bankruptcy of the farmers, is the desired endpoint,” Brand added.\n\nMake no mistake about it, what we are witnessing globally and in the U.S is a war against modern civilization. The World Economic Forum, the UN, and the World Health Organization seek nothing short of controlling humans.\n\nSri Lanka’s engaged in a disastrous organic farming experiment that left the nation in revolt and collapse. The farmer revolt in the Netherlands against climate-inspired shut down of family-owned generational farming is spreading globally, including in Canada.\n\nThe global institutions pushing this reset on the world believe that we, the unwashed masses, will create inequity, racism, environmental destruction, and a climate crisis — if we are left to our own devices. These global forces literally want to regulate not just our farming but every aspect of our lives.\n\nYou are the pollution they want to eliminate!\n\nA 2022 study touted by Scientific American claimed “Eating Too Much Protein Makes (Human) Pee a Problem Pollutant in the U.S.” and thus “can contribute to warming.” Scientific American explained: “In the U.S., people eat more protein than they need to.” The “urea can break down to form gases of oxidized nitrogen. These gases reach the atmosphere, where nitrous oxide (N O) can contribute to warming via the greenhouse effect and nitrogen oxides (NOx) can cause acid rain,” the magazine explained.\n\nHuman urine as the new environmental and climate boogeyman is just the latest scare to get you to stop eating meat. Now when you pee, you are allegedly a human pollution machine that is heating up the planet. The voiding of your bladder must be curtailed for the sake of the planet! So says ‘The Science’!\n\nThe last several years have seen endless emergency declarations, wars, massive government spending, debt, runaway inflation, supply chain issues, increases in crime, food shortages, no privacy from Big Brother-style government and corporate snooping, skyrocketing energy prices that chip away at car and home ownership, threats of climate lockdowns, oppressive censorship, crushing of dissent, and limits on freedom of travel and physical autonomy.\n\nAll of this chaos is music to the ears of those who don’t like the messiness of human freedom. The WEF’s vision is to crowd us all into urban areas. They want us to own nothing.\n\nBedlam is a useful way to collapse the current system and install a Great Reset. It is all part of the plan: destroy the old order and make the population so desperate that you can impose policies that make them weaker and more dependent on the government.\n\nAs Bill Gates and BlackRock buy up farmland and single-family homes, driving up food prices and turning more and more citizens into renters, who will realize the root causes of the higher cost of living? Will the public just accept the goal of the Great Reset: “You will own nothing and you will be happy”?\n\nIt’s time for the Great Reject. Rise up and defy the Great Reset.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Great Food Reset", "description": "America’s food security is being threatened by the forces of the Great Reset led by the World Economic Forum in Davos and under the thumb of the United Nations “sustainable development” Agenda 2030. “Biden Says to Expect ‘Real’ Food Shortages Due to Ukraine War,” blared a", "url": "https://www.cfact.org/2023/04/07/the-great-food-reset-2/", "site_name": "CFACT", "article:publisher": "http://www.facebook.com/cfact", "article:published_time": "2023-04-07T08:31:43+00:00", "article:modified_time": "2023-04-08T17:09:26+00:00", "image": "https://www.cfact.org/wp-content/uploads/2019/06/can-we-still-trust-the-usda.jpg", "image:width": "848", "image:height": "564", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://eagleforum.org/publications/efr/sept22/the-great-food-reset.html"], "authors": ["Marc Morano"], "publish_date": "2023-04-07T08:31:43+00:00"}