{"result_id": "077035", "URL": "https://www.cfact.org/2020/11/27/summing-up-the-northern-hemisphere-tropical-season/", "timestamp": "2023-04-25 14:47:43 CEST+0200", "meta": {"description": "The politics that has the government naming more storms will also lead to lower storm intensity. Unintended consequences?", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.cfact.org/2020/11/27/summing-up-the-northern-hemisphere-tropical-season/", "encoding": "utf-8"}, "image": null, "domain": "www.cfact.org", "title": "Summing up the northern hemisphere tropical season", "cleaned_text": "I have been told we should think globally when it comes to climate. At least that is what people pushing this as a man controlled item say. Even now, I am hearing tales of people that may be coming to power wanting to distribute the very Covid Vaccine that the president, by pulling together the public, private partnership in the greatest effort to combat an enemy since world war 2, got done in record time, to others first, the kind of attitude that is designed to go from “Make America Great Again” to “Make America Grovel Again” Obviously solving our problems first would help facilitate the former, so why would you not wish to take care of yourself?.\n\nNow I say this because in my book, The Weaponization of Weather in the Phony Climate War, there are a couple of chapters on the Covid Climate linkage strategy I knew would be used as we got to the end of the Covid situation. But the point is these people want you to think globally about the doom and gloom that they say climate change is, so lets do that okay and lets use the hurricane season we just had\n\n1) Yes , we had most named storms in the Atlantic. I was underdone on total names. I had. 20 before the season. But we are going to find out whats in a name below, and in this case there is a story behind what you are being bombarded with, that you are not being told. Gee where have we seen that before\n\n2) Yes it was the highest impact year on the US coast ( no surprise as we made a huge deal about that from April)\n\nLook at this impact forecast from April 7th. For WHERE THEY WOULD GO, NOT JUST NUMBERS. No one else has been doing this, I have been since 2014 for clients and we show it\n\nNow look at what happened. (. The numbers are the phases of the MJO that these hit in, to show that by correctly forecasting that to be in certain phases for the season, we would have the major impact season\n\n3) The ACE index at. 180 within our ACE range from March! 10th highest on record\n\nWhat is the ACE index.?Well while I think the Power and Impact scale I have developed is far more descriptive, the ACE is a far better metric of tropical prowess than the number of storms.\n\nHere is a nice read on it\n\n4) Here is where it gets interesting: and what is being hidden from the public as the weaponization of this for climate change would be neutralized with these facts: The ACE/Storm. Was 6. ranking LAST, DEAD LAST, way back in Last, as far as ACE/Storm in an active season. In fact how bad was it? The AVERAGE ACE/STORM in the other 21 hyper active seasons was 12.! The closest to this year was another mega name year 2005, but that was a respectable 9. That 6 per/storm is in the bottom 25% for any year!\n\nThe obvious conclusion to anyone objective is 2 fold, 1) some of these should not have been named or would not have been in previous years. Now if you don’t want to accept that fine, but it means more storms, but weaker. It is absolutely astounding to see the ace/storm HALF the average of the all the other samples.\n\nSide fact: We have just finished a decade tied for the LOWEST in major hits on the Saffir Simpson scale in over 100 years!\n\nBut it gets worse as far as the hype, sort of. The total ignoring of the lack of activity in the Pacific Basin. I keep hearing global this and global that which of course applies only if one is going to ignore the fact that the number one area for ACE was so far below normal.\n\nThe total between the two is normally 426 . This year so far 226. So the basin with 4 times the normal of Atlantic, is only 53% of its normal! For the northern hemisphere was 80% of normal. So even with the hyper Atlantic season. GLOBALLY we were BELOW average.\n\nSo there is no question the impact of the western hemisphere is a huge record breaking deal, and should be talked about, But if you want perspective and the whole picture, there is plenty to counter the idea that this is an example of some kind of atmospheric apocalypse, But you have to look and if you do, you will see that there is plenty to talk about on the other side of the coin. Nature find a way to balance out things no matter how much money we want to drain out of our economic lifeline to change it.\n\nOf course, the coin that is flipped when it comes to pushing ideas today always seem to come up one way, and that is to whip up hysteria. Sound familiar?", "opengraph": {"locale": "en_US", "type": "article", "title": "Summing up the northern hemisphere tropical season", "description": "I have been told we should think globally when it comes to climate. At least that is what people pushing this as a man controlled item say. Even now, I am hearing tales of people that may be coming to power wanting to distribute the very Covid Vaccine that the", "url": "https://www.cfact.org/2020/11/27/summing-up-the-northern-hemisphere-tropical-season/", "site_name": "CFACT", "article:publisher": "http://www.facebook.com/cfact", "article:published_time": "2020-11-27T08:56:33+00:00", "article:modified_time": "2020-11-26T18:07:35+00:00", "image": "https://www.cfact.org/wp-content/uploads/2020/11/summing-up-the-northern-hemisphere-tropical-season-2.jpg", "image:width": "1073", "image:height": "559", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.cfact.org/wp-content/uploads/2020/11/summing-up-the-northern-hemisphere-tropical-season.png", "http://www.cfact.org/wp-content/uploads/2020/11/summing-up-the-northern-hemisphere-tropical-season-2.jpg", "https://www.cfact.org/author/cfact-ed/", "https://www.cfact.org/author/joe-bastardi/"], "authors": ["CFACT Ed, Joe Bastardi"], "publish_date": "2020-11-27T08:56:33+00:00"}