{"result_id": "077025", "URL": "https://www.cfact.org/2021/11/29/the-covid-climate-alliance/", "timestamp": "2023-04-25 14:47:32 CEST+0200", "meta": {"description": "Covid or climate there are just too many common links to ignore.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.cfact.org/2021/11/29/the-covid-climate-alliance/", "encoding": "utf-8"}, "image": null, "domain": "www.cfact.org", "title": "The Covid, climate alliance", "cleaned_text": "Maybe it is all just a big Coincidence — Covid and Climate.\n\nI have 2 chapters in my book on this matter. The book was written in March and April of 2020 so it predates the evolution of what you see\n\nIn any case, I have to question whether this is all a coincidence.\n\nThink about it. What does Marxism seek to do? It is a top-down authoritarian form of governance where control of free will and freedom of the individual is a must. This force’s dependence on the state, and in the spiritual aspect, forces a person to choose between that dependence and one’s religious belief.\n\nSo what are you seeing here? Covid policy is a tactic to control. The Virus is GOING TO NATURALLY MUTATE TO GET AROUND ANY TYPE OF ARTIFICIAL RESISTANCE. Nature does that all the time. But think what the reaction, no matter what the intention, has done. It forced a sense of fear and almost blind reliance, and outsourcing of one’s freedom, to someone who will take care of you. The age-old question of is it better to be safe or strong enough to resist a threat comes to mind, Those seeking safety first will trust someone else rather than themselves. How else can you explain an almost blind allegiance to someone who has not actively treated a patient in a practice for over 30 years, over doctors on the front lines offering suggestings on how to stop this. Dr Fauci, who is now floating the trial balloon of renewed lockdowns. Right in time for the holidays.\n\nThey want to talk math and science right? Okay. Tested positives are near 50 million. It is hugely telling that the people pushing a vaccine have not set up antibody testing stations around the country with the availability of testing or vaccination sites, You can get the shot anywhere, but you can’t tell if you have Covid antibodies in the same ratio, It is common knowledge now that natural immunity ( and for goodness sakes. This should be intuitive),. Why isn’t the French vaccine available here? It uses the tried and true method of prevention, stimulating your body to create its own antibodies and then becoming more mutation resistant\n\nNature is a stronger and longer defense against COVID. So why would you not want to get an actual count of people with antibodies?, rather than a tested count? THAT MAKES NO SENSE. And its baffling how people don’t see that. Or don’t ask why vaccines like the one above are not available. Dr Fauci says it spread 5x faster than flu. By HIS IDEA the whole country should have had it by now. But no matter let’s take how many people have been vaccinated. It is over 230,000,000 million, You have 50 million immune. and if the vax is so powerful that it is our patriotic duty to get it, even though there is risk\n\n( that is small given 230 million vaxed, but its still there) then it means that effectively we are at. 280 million people that should be immune\n\nNow given the recent surge, if all this vax talk was true, then how is it we are seeing such a surge with so many fewer people that are supposedly the ones that are responsible. There are only 50 million “unprotected). Something is wrong here with what we are being told. My suspicion is what many of us know, the man-made vax simply fades. And a lot of vaxed people are walking around not understanding that they are likely no better off than an unvaxed person and certainly not better off than someone that had covid ( of which I believe there are many more). They are actually at risk from a false sense of security.\n\nCovid is dangerous, It is a plight. But either the people that are pushing all this are incompetent, or they are purposely hiding the examples above I gave\n\nWhy shut down frontline doctors aggressively treating this with therapeutics? Why isn’t the more classic French Version available here? there are countless questions, and they get blocked with an aggressive campaign to isolate, demonize and destroy, the classic Marxist tactic.\n\nNow to climate. FORCED ADHERENCE IS HERE. You are seeing it in the form of price rise. Biden has created the mess and now has decided we need to look at those evil energy companies for raising prices. There is a calculated step up, Arrogant elitists tell us we can afford an extra dollar a pound for turkeys. Meat prices rise, so more people have to figure out what else to eat. An energy secretary laughs at the problem on the video, saying she wished she had a magic wand to force the now all-powerful again OPEC to lower their prices. And so people, the poorest especially must react. Just like Covid, a form of class warfare and chaos develops ( Covid its the vaxed vs the free choicers, in climate it will be the poor vs the evil oil companies and those who can afford energy as it rises through the roof) Quite frankly I can not believe this is an accident. Nor do I believe Joe Biden hatched this, His history proves he is incapable of such things, but more than willing to adapt such things ( please just look at his record) However those that wish to take down the freedoms of this country or who have written books supporting the redistribution of American wealth as the penalty for what we have done ( gee I wonder who THAT is) are smart enough and also are ENOUGH OF A LEADER, WHERE THEY WILL KEEP THEIR MOUTHS SHUT FOR THE BIGGER CAUSE, can do it, They use setbacks such as Trump’s rise to power to regroup and come on stronger. So for whatever reason, they have a Covid and Climate alliance, along with the other chaos they crave to gain control, that is the wave we are facing\n\nCan you see the link? ITS DECEPTION ( or put it this way, a designed plan to hide all pieces of the puzzle). We are told it is getting worse all the time, yet there is no time better for living on the planet than now. That is why life expectancy has surged. ( and because of that, Covid can claim more lives) The argument that more people are dying is absurd. 1) of course more people are dying there are more living. 2) There should be more people dying from natural disasters ( which of course are now blamed on man) because more people are living in harm’s way, Yet this graphic blows all that out of the water without having to argue over the polar bears or whatever or listen to Bill Nye and Greta drop F-bombs\n\nSo if it’s worse than ever how were there 28x more deaths with 1/4 the population of today in 1930? It’s flat out false to assert man’s influence is ruining life. The earth is greener than ever in the satellite era, more people are living longer, more people are living in disaster-prone areas, YET THE ATTRIBUTED AMOUNTS OF DEATH ARE DROPPING.\n\nWe are in big trouble as far as what this nation was founded on. That the population as a whole is so uncurious about things like this, and not only accept what they are told but become agents for the deception by trying to force what they are told on others who actually look at these things, is the biggest problem. The devil’s biggest tool is to drive wedges into what we love the best. Our families, our friends, our way of life. To destroy what God has given every person and is so wonderfully spoken in the words of the founders. Whether you think the whole thing is a fairy tale or not is your business, but the old adage the road to hell is paved with good intentions is backed up by Mencken’s” the urge to save humanity is almost always a false front for the urge to rule” rings loud and true today. Whoever or whatever is behind all this, and perhaps it is just plain dumb luck, is capitalizing on it. Be it Covid, Climate, or whatever, there are just too many common links to ignore what is an almost otherworldly design to destroy the American experiment. And no matter what the actual cause, the erosion of our foundations are evident. And we have no one to blame but ourselves. If the nation falls, it’s because we became comfortable and complacent rather than virtuous and vigilant.\n\nI think Paul Harvey nailed it back in 1964.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Covid, climate alliance", "description": "Maybe it is all just a big Coincidence -- Covid and Climate.\r\n\r\nI have 2 chapters in my book on this matter. The book was written in March and April of 2020 so it predates the evolution of what you see\r\n\r\n(btw it is available here and it is stocking stuffer size, sort of).  Keep", "url": "https://www.cfact.org/2021/11/29/the-covid-climate-alliance/", "site_name": "CFACT", "article:publisher": "http://www.facebook.com/cfact", "article:published_time": "2021-11-29T17:06:09+00:00", "article:modified_time": "2021-11-29T03:25:08+00:00", "image": "https://www.cfact.org/wp-content/uploads/2020/05/do-lockdowns-stop-viruses.jpg", "image:width": "823", "image:height": "582", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.cfactstore.com/product/weaponization-of-weather-in-the-phony-climate-war/", "http://www.cfactstore.com/product/weaponization-of-weather-in-the-phony-climate-war/", "https://www.abc.net.au/news/2021-05-07/valneva-covid-vaccine-french-shot-supposedly-variant-proof/100124708", "https://www.cfact.org/author/joe-bastardi/"], "authors": ["Joe Bastardi"], "publish_date": "2021-11-29T17:06:09+00:00"}