{"result_id": "077021", "URL": "https://www.cfact.org/2021/10/19/pharmaceutical-production-isometric-multistore-composition/", "timestamp": "2023-04-25 14:47:28 CEST+0200", "meta": {"description": "Biden supports the end of fracking, oil exploration, and oil importing which cuts off the supply chain of crude oil to refineries. Without any crude oil to manufacture, elimination of the supply chain to the 131 operating refineries in the U.S. would eliminate that manufacturing sector.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.cfact.org/2021/10/19/pharmaceutical-production-isometric-multistore-composition/", "encoding": "utf-8"}, "image": null, "domain": "www.cfact.org", "title": "Fossil fuels form the basis of our medical and food supply chains", "cleaned_text": "Under President Joe Biden’s plan to rid America of fossil fuels, such a plan would eliminate the medical industry that is completely reliant on the products made from petroleum derivatives, and eliminate oil-based fertilizers to grow the crops that feed the 8 billion people on planet earth. Surprisingly, Biden must be oblivious to the consequences of his plan, as efforts to cease the use of oil could be the greatest threat to civilization—not climate change.\n\nBiden supports the end of fracking, oil exploration, and oil importing which cuts off the supply chain of crude oil to refineries. Without any crude oil to manufacture, elimination of the supply chain to the 131 operating refineries in the U.S. would eliminate that manufacturing sector.\n\nWithout refineries, there will be none of the oil derivatives that are manufactured from crude oil—the basis of more than 6,000 products in our economy and lifestyles.\n\nWithout the supply chain of crude oil, not only is the refining industry history, but the domino effects of the destructive impacts will be taken upon the medical, food supply, electronics, and communications industries, as they are all totally dependent on the products made from oil derivatives manufactured from crude oil. Any grade-school-educated kid can understand that breezes and sunshine, can only make weather-dependent intermittent electricity.\n\nThe medical industry is reliant on the products derived from the derivatives manufactured from oil that produce all the critical medical equipment such as: ultrasound systems, defibrillators, exhalation valves, inhalation valves, CT systems, X-ray, medicines, masks, gloves, soap, hand sanitizers for hospitals, protective gowns, gloves, and face shields for doctors and nurses.\n\nIs Biden oblivious to the fact that all of those medical products begin from crude oil, or as the Wall Street Journal states—”Big Oil to the Coronavirus Rescue”? Vaccines need refrigeration, and refrigeration needs electricity, especially in the hospital sector where redundant generation capacity for continuous, uninterruptable electricity, is a mandate.\n\nWhile Biden attempts to lower emissions at any cost, in favor of some weather-dependent electricity from breezes and sunshine that can only survive with massive subsidies, coal imports and exports continue to increase internationally to meet the electricity generation needs of developing countries, as reflected in the Merrill Lynch Global Energy Weekly report.\n\nAt least 80 percent of humanity, or more than 6 billion in this world cannot subsidize themselves out of a paper bag as they are living on less than $10 a day. To reduce emissions in the developing countries that control most emissions, the wealthy countries would need to step up and subsidize electricity generation from breezes and sunshine, to then replace more than 3,000 coal fired power plants in developing countries like China, India, Indonesia, Japan, Africa, and Vietnam—with billions of people seeking affordable electricity.\n\nThe oil that reduced infant mortality, extended longevity to more than 80 years of age, and allowed the world to populate from 1 to 8 billion in less than 200 short years, is now required to provide the food, medical, communications, and transportation infrastructures to maintain and grow that population.\n\nA key question for President Biden before America attends the United Nations Framework Convention on Climate Change (UNFCCC/COP26) Conference in Glasgow, Scotland in November:\n• How dare pro-humanity individuals and governments support banishment of fossil fuels, when their banishment would be the greatest threat to civilization resulting in billions dying from starvation, diseases, and weather-related deaths?\n\nEliminating the use of fossil fuels would reverse most of the progress humanity has made over the last few centuries. The inventions of the automobile, airplane, and the use of petroleum in the early 1900’s led us into the Industrial Revolution, and victories in World War I and II. The healthier and wealthier countries of today now have more than 6,000 products that did not exist a few hundred years ago, all manufactured from fossil fuels—the same fossil fuels that Biden wants to eliminate.\n\nUnder Biden’s plan to rid American lifestyles and economies of fossil fuels, such a plan would ground the military, the space program, and Air Force One. It would also mothball the huge energy demands of airlines, cruise ships, merchant ships, and eliminate the medical, electronics, and the communications industry that are totally reliant on the 6,000 products made from petroleum derivatives.\n\nThe first use of oil-based fertilizers took place in 1946, and today our food supply is dependent on hydrocarbons. The world’s population of 8 billion souls depends on oil-based fertilizers in order to grow the crops, and feed the animals that are consumed each year. Any cessation of hydrocarbons will immediately result in the annihilation of billions of souls, returning the globe to a 1950 population count of approximately 2.5 billion souls.\n\nHow can a pro-humanity President Biden support COVID vaccines to save thousands of lives, and simultaneously support ridding the world of fossil fuels that would be the greatest threat to civilization, resulting in billions dying from starvation, diseases, and weather-related deaths?", "opengraph": {"locale": "en_US", "type": "article", "title": "Fossil fuels form the basis of our medical and food supply chains", "description": "Under President Joe Biden’s plan to rid America of fossil fuels, such a plan would eliminate the medical industry that is completely reliant on the products made from petroleum derivatives, and eliminate oil-based fertilizers to grow the crops that feed the 8 billion people on planet earth. Surprisingly, Biden must be oblivious to the", "url": "https://www.cfact.org/2021/10/19/pharmaceutical-production-isometric-multistore-composition/", "site_name": "CFACT", "article:publisher": "http://www.facebook.com/cfact", "article:published_time": "2021-10-19T08:43:31+00:00", "article:modified_time": "2021-10-27T02:05:35+00:00", "image": "https://www.cfact.org/wp-content/uploads/2021/10/Pharmaceutical-production.jpg", "image:width": "979", "image:height": "489", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.atr.org/joe-biden-we-are-going-get-rid-fossil-fuels", "https://youtu.be/R2ZSGuwqFic", "https://www.eia.gov/dnav/pet/pet_pnp_cap1_dcu_nus_a.htm", "https://www.linkedin.com/pulse/partial-list-over-6000-products-made-from-one-barrel-oil-steve-pryor/", "https://www.wsj.com/articles/big-oil-to-the-coronavirus-rescue-11587683239", "http://research1.ml.com/C?q=8WR!QBdtF1DfVKzKs5jWCA&e=ronald.stein%40ptsadvance.com&h=LdFtUg", "https://www.globalissues.org/article/26/poverty-facts-and-stats", "https://www.globalissues.org/article/26/poverty-facts-and-stats", "https://www.linkedin.com/pulse/partial-list-over-6000-products-made-from-one-barrel-oil-steve-pryor/", "https://populationmatters.org/sites/default/files/styles/full_width_image/public/Historical%20human%20population%20growth%20-%20no%20logo_3.png?itok=c-UaNTDc"], "authors": ["Ronald Stein"], "publish_date": "2021-10-19T08:43:31+00:00"}