{"result_id": "077034", "URL": "https://www.cfact.org/2022/12/05/three-examples-of-global-warming-denying-and-deceit/?utm_source=rss&utm_medium=rss&utm_campaign=three-examples-of-global-warming-denying-and-deceit", "timestamp": "2023-04-25 14:47:42 CEST+0200", "meta": {"description": "Distorting science to push an agenda.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.cfact.org/2022/12/05/three-examples-of-global-warming-denying-and-deceit/", "encoding": "utf-8"}, "image": null, "domain": "www.cfact.org", "title": "Three examples of global warming denying and deceit", "cleaned_text": "I want you to watch this.\n\nIn it, we see the drip- drip-drip of the same things many doctors and others were saying about these vaccines, that a) they were not that effective (how could they be, c’mon the flu vaccine is not that effective, b). there was no reason to force it on anyone, c) it now has lead to a sword of Damocles of possible complications down the road hanging over millions of Americans.\n\nWhat in the world does this have to do with climate?\n\nIn my book, the Weaponization of Weather in the Phony Climate War, a great Christmas idea cause when you are done reading it you can burn it for heat in case you are without a means to heat your house. I linked how Covid strategies and climate strategies are the same. Push the issue and then deny and lie when it does not happen. By that time it’s too late.\n\n1) The underwater volcanic activity actually being the source of much of the ocean warming, and water vapor (and CO2 for that matter) released into the atmosphere. The admission that the water vapor launched into the air by the Tonga Volcano was contributing to warming should instantly demand an answer to the question, well what about all the other underwater volcanoes that may not reach the surface but have to be warming the water? Look at the difference in SST over the last 40 years:\n\nThere is no way the atmospheric temperature rises without that kind of warming. And it’s highly unlikely it’s the air warming the water. Any home economics teacher (do they still teach that class, I would take it because I liked to cook and I also thought then some girls would talk to me) would tell you to use a stovetop instead of a blow-dryer. The microwave oven analogy falls apart because the processes in the atmosphere-ocean interaction would render it immeasurable and indistinguishable if not negligible, which is why the CO2 idea, though a nice thought and one that has to be on the table as long as there is warming is a highly unlikely source for this. Yet that is being pushed at the expense of the cyclical nature of proven past warm and cold eras that were not linked to man 40-50 years from now, long after all the phony climate war policies that have shackled our nation are irreversible. Perhaps we will see the research that is needed NOW and should have been a priority on what is going on in the oceans, will drip out. But like the Covid vaccine, it will be too late. It is scientific malfeasance not to be looking at this.\n\n2)The result of the distorted oceanic warming is likely linked to the immense bust on the trapping hot spot over the idea of the tropics. As we said, we can link increased WV and its correlation to temperature to warming. THEY ADMITTED THAT IN A TONGA VOLCANO PAPER.\n\nThe massive January 15 eruption of the Tonga volcano pumped immense amounts of water vapor and ash into the air. The excess water vapor is actually being acknowledged as a reason for warming.\n\nSo IT HAS GONE THE OPPOSITE WAY. IT IS DRYING OUT!\n\nThis means air is sinking, not rising in the means over the tropics. This is why balloon measurements have shown the Hadley cell has weakened. It is also likely the reason for the demise of the Huge Long tracked hurricanes of the past with the shift north to later developing smaller in size storms further north. But it is the opposite of the theory. This would be a huge problem if it were going the way they said. Trapping hot spots in the arctic are a sign of the natural fightback in the atmosphere as they force cooling to counter further south. You are seeing an example in the coming weeks with the weather, something we picked out for you way back at the end of summer. It all works together. But unless you have eyes on the weather you ignore it. Do you hear anyone admitting there is not an increase in WV over these areas? If there was that is a huge problem as the tropics are where energy accumulation and feedback can lead to the kind of runaway warming they speak up. The Arctic is part of the balancing act of distortion.\n\n3. The INCREASE OF SNOW. They deny and lie about saying snow was going to be a thing of the past. Northern hemisphere snows are increasing and snow breeds snow and snow breeds cold. Saying it’s more water vapor causing it is precisely the Le Chatellier’s-type response you would expect. In fact, when I was in 3rd grade my dad gave me a starter book on weather and climate THAT DESCRIBES EXACTLY WHAT YOU SEE TODAY! If it warms, there is more water vapor. More water vapor means more snow since it does not warm enough to stop it from snowing. The it starts to cool from more snow being around longer and another hideous lie. THE ARCTIC IS NOT BURNING UP. It is warming in the winter in direct correlation to increase WV with the very cold temperatures, but it is not warming in the summer. The reason is 2-fold: a) Melting takes heat out of the atmosphere and retards warming so you see that in the summer and, 2) the amount of water vapor increase at the mean summer temperature is not enough to affect temps. In winter it is enough and the arctic ice freezing adds heat to the atmosphere which is precisely the point, the use of temperature is a 3rd rate metric for the climate. Water vapor is first. The source of the excess water vapor is the key, which would come from oceans warming. Why are the oceans warming? There is your key. Why is that not the focus of intense research rather than all the other gibberish we see? Which is what it is. There’s paper after paper on how climate change causes this and that, when in reality life has never been better on planet earth.\n\nBut again the lie is that we heard back in 2000 how snow would become rare. In reality, it is snowing more. When it snows it stays colder longer. That would be the natural climate change response. In a rational world, not driven by a phony climate war, this would be a large consideration and the solution is to adapt and move on and use the current climate optimum to our advantage, not label it something it is not, a climate emergency.\n\nThere are more examples. I showed these 3 for you. You can add more. I am sure in all the cases you will find denying and deception. This is the mainstay of confusion, a tool of people that seek to destroy and then control by their own means. That is what this is about.", "opengraph": {"locale": "en_US", "type": "article", "title": "Three examples of global warming denying and deceit", "description": "I want you to watch this.\r\n\r\nIn it, we see the drip- drip-drip of the same things many doctors and others were saying about these vaccines, that a) they were not that effective (how could they be, c'mon the flu vaccine is not that effective, b). there was no reason to force it on", "url": "https://www.cfact.org/2022/12/05/three-examples-of-global-warming-denying-and-deceit/", "site_name": "CFACT", "article:publisher": "http://www.facebook.com/cfact", "article:published_time": "2022-12-05T10:11:03+00:00", "article:modified_time": "2022-12-09T19:38:13+00:00", "image": "https://www.cfact.org/wp-content/uploads/2022/11/Underwater-Volcano.jpg", "image:width": "848", "image:height": "565", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://twitter.com/Liz_Wheeler/status/1598023126683881472?s=20&t=5blN8aDOQu-8GQ0s_CH3mw", "https://www.space.com/tonga-volcano-plume-highest-ever-warmed-climate"], "authors": ["Joe Bastardi"], "publish_date": "2022-12-05T10:11:03+00:00"}