{"result_id": "077002", "URL": "https://www.cfact.org/2021/11/03/cop-26-armageddon-awaits-at-the-un-climate-conference/", "timestamp": "2023-04-25 14:47:08 CEST+0200", "meta": {"description": "CFACT asked the official NGO question of the World Meteorological Organization. The WMO was wrong.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.cfact.org/2021/11/03/cop-26-armageddon-awaits-at-the-un-climate-conference/", "encoding": "utf-8"}, "image": null, "domain": "www.cfact.org", "title": "COP 26: Armageddon awaits at the UN Climate Conference", "cleaned_text": "Gloom and doom pervade the United Nations 26th Climate Summit here in Glasgow, Scotland. But CFACT is here to push back with some doses of reality.\n\nPrince Charles Windsor, the Duke of (nearby) Edinburgh, spoke this week at the Conference, which he referred to as “the last-chance saloon.”\n\nBritish Prime Minister, Boris Johnson, whose nation graciously hosted this year’s event, said the world was at “one minute to midnight” before, well …something really bad, I guess. Maybe the end of civilization as we know it.\n\nPrince Charles is the immediate heir to the British throne which has been occupied for the last 69 years by his 95-year-old mother, Queen Elizabeth II. If the prince and prime minister are correct about the planet, Charles may never be king; and certainly not Prince William, his elder son.\n\nThis is their way of urging nations to do more to fight climate change, presumably including their own.\n\nAt the opening of the conference, a bevy of world leaders sounded the familiar climate alarmist refrain that is now three decades old. With the beginning day’s excitement now past, world leaders have jetted home. The mundane sessions of panelists are now at hand.\n\nThe conference itself is being held at the Glasgow Scottish Event Campus. It is cumbersome to enter, especially the first day when everyone had to sign in for their badge and pass through airport-like security checks; and that is after walking through several security perimeters.\n\nSince the Covid era very much remains, entering the United Kingdom requires vaccination and a Covid test within two days. UN Climate Summit attendees, however, are exempt from vaccination requirements. Attendees are supposed to take a self-administered Covid test each day before entering the conference and must report results to the British National Health Service website. In other words, it’s the honor system. If one tests positive for Covid, it’s up to them if they want to voluntarily admit it.\n\nThe Covid test packages were given out to all conference attendees in a handy box containing a self-administered test for each day. The supreme irony of these test kits is that they are “Made in China.” That’s right. The nation housing the Wuhan laboratory experimenting in gain-of-function research that unleashed the coronavirus is profiting from Covid testing kits purchased by the United Nations. Just business-as-usual here.\n\nFor all the Covid protocols, not a single person has yet requested proof of my negative Covid tests [P.S.: I was checked on a subsequent day of the conference]. Though everyone at the UN summit is purportedly Covid-free, masks are required attire and all but a handful of the 20,000 attendees are dutifully wearing them.\n\nTo add to the fictional aspect of the UN’s Covid protocols, the session rooms had restricted seating to allow “social distancing.” This was violated everywhere outside the sessions — especially in the long food lines. Many just ignored the seating arrangements, too, by removing or just sitting on the tape barriers.\n\nMore than any conference I can recall, there always seems to be many more people walking around the venue than attending any of the climate sessions. CFACT exploited that opportunity by having a couple of our young activists hand out copies of our Climate Hustle 2 to conference attendees.\n\nThe film was produced by CFACT and released in theaters last year. Narrated by actor Kevin Sorbo, Climate Hustle 2 exposes the unscientific hype and radical political agenda of the worldwide climate change industry.\n\nAmong those who received our DVD included delegates from Nigeria, Korea, Papua New Guinea and other nations. The young CFACT activists particularly enjoyed interacting with a small group of indigenous people dressed in traditional attire, who stopped and posed with them for a picture.\n\nCFACT has sat in on several UN panels and sessions where the subject matter was dry and tedious, such that it’s hard to fault President Joe Biden for nodding off when sitting through some of them when he was here.\n\nDuring one presentation by the World Meteorology Organization’s Regional Climate Councils, panelists presented their respective observations of temperature data and alleged “extreme” weather events among the major regions of the planet. Interestingly, they refused to attribute actual causation to such observations and often admitted to having uneven or “inadequate” data. For example, part of Europe experienced sea level increases of 2.5 millimeters, while other parts were far below. The reason? They gave none.\n\nDuring the question-and-answer period of that session, delegates from several countries were unhappy with the inconclusive answers and lack of recommendations for climate policy. Good for them. We were, too!\n\nCFACT asked the only question by NGOs. Specifically, I asked them to comment about scientific findings which show that increased carbon emissions actually boost crop yields, which have led to record harvests. This would mean CO2 is not a “problem” or “emergency,” but a benefit to helping feed the world. The panelists were having none of it — with one of them saying that any impact from CO2 has only a “negative” effects, particularly on Africa, the region he represented.", "opengraph": {"locale": "en_US", "type": "article", "title": "COP 26: Armageddon awaits at the UN Climate Conference", "description": "Glasgow, Scotland U.K.\r\n\r\nGloom and doom pervade the United Nations 26th Climate Summit here in Glasgow, Scotland. But CFACT is here to push back with some doses of reality.\r\n\r\nPrince Charles Windsor, the Duke of (nearby) Edinburgh, spoke this week at the Conference, which he referred to as “the last-chance saloon.”\r\n\r\nBritish Prime Minister, Boris Johnson, whose", "url": "https://www.cfact.org/2021/11/03/cop-26-armageddon-awaits-at-the-un-climate-conference/", "site_name": "CFACT", "article:publisher": "http://www.facebook.com/cfact", "article:published_time": "2021-11-03T14:26:30+00:00", "article:modified_time": "2022-02-23T14:35:28+00:00", "image": "https://www.cfact.org/wp-content/uploads/2021/11/Armageddon-houses-of-parliament.jpg", "image:width": "850", "image:height": "563", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.dailymail.co.uk/news/article-9776813/Charles-refusing-Edward-Duke-Edinburgh-title-passed-Prince-Philips-death.html", "https://www.cfact.org/2021/10/15/a-royal-space-snit/", "https://www.climatehustle2.com/", "https://nypost.com/cover/november-2-2021/", "https://co2coalition.org/news/global-agricultural-boom-a-million-thanks-to-climate-change/", "https://data.oecd.org/agroutput/crop-production.htm"], "authors": ["Peter Murphy"], "publish_date": "2021-11-03T14:26:30+00:00"}