{"result_id": "077033", "URL": "https://www.cfact.org/2023/03/16/netzero-reality-coalition-forms-and-scores-first-big-win/?utm_source=rss&utm_medium=rss&utm_campaign=netzero-reality-coalition-forms-and-scores-first-big-win&utm_source=rss&utm_medium=rss&utm_campaign=netzero-reality-coalition-forms-and-scores-first-big-win", "timestamp": "2023-04-25 14:47:41 CEST+0200", "meta": {"description": "NZRC stands in opposition to leftist “NetZero” advocates who seek to tear down energy sources that work, while pushing energy sources, such as intermittent wind and solar, that are not up to the challenge of powering the world's needs.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.cfact.org/2023/03/16/netzero-reality-coalition-forms-and-scores-first-big-win/", "encoding": "utf-8"}, "image": null, "domain": "www.cfact.org", "title": "NetZero Reality Coalition forms and scores first big win", "cleaned_text": "CFACT is proud to be a founding member of the new which aims to push back against the growing tide of leftist “green” mandates being foisted on our energy infrastructure.\n\nThe NetZero Reality Coalition (NZRC) includes free market think tanks, energy experts and legislators all dedicated to preserving the reliable, affordable energy we take for granted.\n\nNZRC stands in opposition to leftist “NetZero” advocates who seek to tear down energy sources that work, while pushing energy sources, such as intermittent wind and solar, that are not up to the challenge of powering the world’s needs. Their radical climate and energy agenda is destabilizing our grid, causing blackouts and power disruptions, and driving up costs for average, hardworking Americans.\n\nIt was high time to start pushing back!\n\nThe first such opening salvo of this important coalition has come in Utah. There, NZRC presented information that led to a ground-breaking “ ” that passed the Utah legislature. This bill is now on Governor Spencer Cox’s desk awaiting his signature.\n\nThe Utah energy bill was submitted by Representative Ken Ivory. Take a look at the press release we posted to CFACT.org :\n\nunderscores that Utah supports and promotes both renewable and nonrenewable energy systems – including coal, gas, oil shale, nuclear, wind, solar, hydroelectric, geothermal and other sources. It clearly states that Utah has both a “duty” and “sovereign authority” to defend all necessary electricity generation from “external regulatory interference.”\n\nThe legislation thus requires “at least” 180-day prior notification of any decommissioning, disposal, retirement or closure of electricity generation facilities and equipment, whether proposed or being “forced” due to federal mandates or the high costs of compliance with federal regulations. It gives the Attorney General authority to take legal or other actions to defend the state’s energy interests.\n\nWind and solar profiteers and their strange Green bedfellows believe that if they destroy our reliable energy grid, somehow better energy will come. They couldn’t be more wrong. European countries such as Germany and Spain have already invested billions on wind and solar. The result? Flickering, unreliable power grids, soaring prices, sham solutions such as “biomass,” and no meaningful decrease in greenhouse gas emissions.\n\nConsider “biomass.” Did anyone genuinely believe that cutting down North American trees, grinding them into pellets, shipping the pellets to ports and loading them onto diesel powered freighters to burn in Europe was clean, green, or somehow good for the climate? To the NetZero crowd, at least, that actually counts as “renewable!”\n\nWe cannot leave our energy to NetZero zealots or the businesses shamelessly using them to cash in.\n\nhas reported for duty just in time.\n\nUtah was just the start. Here’s to more energy reality victories ahead!", "opengraph": {"locale": "en_US", "type": "article", "title": "NetZero Reality Coalition forms and scores first big win", "description": "CFACT is proud to be a founding member of the new NetZero Reality Coalition which aims to push back against the growing tide of leftist “green” mandates being foisted on our energy infrastructure.\r\n\r\nThe NetZero Reality Coalition (NZRC) includes free market think tanks, energy experts and legislators all dedicated to preserving the reliable, affordable energy we take", "url": "https://www.cfact.org/2023/03/16/netzero-reality-coalition-forms-and-scores-first-big-win/", "site_name": "CFACT", "article:publisher": "http://www.facebook.com/cfact", "article:published_time": "2023-03-16T08:50:13+00:00", "article:modified_time": "2023-03-17T16:13:53+00:00", "image": "https://www.cfact.org/wp-content/uploads/2023/03/NetZero-Reaoity-Coalition-z.jpg", "image:width": "847", "image:height": "298", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.cfact.org/netzerorealitycoalition/", "https://le.utah.gov/~2023/bills/hbillamd/HB0425S03.pdf", "https://www.cfact.org/2023/03/06/energy-security-bill-is-approved-by-utah-legislature/", "https://le.utah.gov/~2023/bills/hbillamd/HB0425S03.pdf", "https://www.cfact.org/?s=biomass", "https://www.cfact.org/netzerorealitycoalition/"], "authors": ["Craig Rucker"], "publish_date": "2023-03-16T08:50:13+00:00"}