{"result_id": "077008", "URL": "https://www.cfact.org/2022/02/03/biden-hitwomans-poison-pen-stops-twin-metals-mine/", "timestamp": "2023-04-25 14:47:15 CEST+0200", "meta": {"description": "“This is not about law. This is a political action” intended to stop “a world-class underground copper, nickel, cobalt, and platinum group metals mine…. We are confident that a full environmental review will show that the science behind this modern mine will prove that we can advance this project safely under the highest of standards.”", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.cfact.org/2022/02/03/biden-hitwomans-poison-pen-stops-twin-metals-mine/", "encoding": "utf-8"}, "image": null, "domain": "www.cfact.org", "title": "Biden hitwoman’s poison pen stops Twin Metals mine", "cleaned_text": "Did Joe Biden lie to American miners during the 2020 Presidential campaign, or did the lie come from zealous “reporters”?\n\nTwo weeks before the election, one reporter cited “three [unnamed] sources familiar with the matter” to claim that Biden’s support for domestic mining of rare-earth metals, cobalt, copper, and other critical minerals was going to be “a boon for the mining industry.”\n\nAnother acknowledged that, “A Biden presidency had been expected to continue with the Obama-era environmental regulations that curbed growth in the U.S. mining sector,” but – SHAZAM – “the candidate will support U.S.-based production.”\n\nA year into Biden’s term, this rosy scenario looks as sincere as “we will never impose a vaccine mandate” or “we will leave no one behind in Afghanistan.”\n\nThe Biden “reversal” should come as no surprise. It was cemented in stone with Biden’s appointment of anti-mining Native American activist Deb Haaland as Interior Secretary. Minnesota tribal leaders who had opposed the Twin Metals mine cheered her confirmation, which they saw as a clear sign she was going to give them a win.\n\nMining advocates, including Rep. Peter Stauber (R, MN), whose district includes the Twin Metals mining site, saw her appointment as a bad omen. Stauber and 14 GOP colleagues wrote that, the Haaland nomination is “a direct threat to working men and women and a rejection of responsible development of America’s natural resources.”\n\nLast June, however, the Institute for Energy Research warned that President “no longer supported” domestic mining of critical minerals. His “bright idea” was to rely on other nations (China) to supply nearly all of the “green” metals and just focus on domestic processing.\n\nThe U.S. Chamber of Commerce, which had lent its support to the Biden campaign, perhaps did not get the memo. The Chamber was still touting Haaland as a potential mining savior as recently as last December, in a report from its Global Energy Institute entitled, “Secretary Haaland Gives a Glimmer of Hope on Strategic Minerals.”\n\nThe glowing tome wistfully announced that, “Interior Secretary Deb Haaland gave an early Christmas present last week when she suggested in a California meeting that the U.S. government may allow mining for critical minerals on public lands.”\n\nThe article explains that Secretary Haaland had responded favorably to a request from Utah Governor Spencer Cox to clarify the agency’s position on the domestic mining of critical minerals. What she actually said was, “Of course, it’s absolutely imperative that if we’re looking for a way forward that we can do it here in this country…that is absolutely a conversation that we’re always willing to have.”\n\nAnd there’s that telling word – “if.” Brings to mind these lines from Kipling’s famous poem: “If you can bear to hear the truth you’ve spoken twisted by knaves to make a trap for fools.”\n\nSecretary Haaland was likely just being coy (at best). Long before her confirmation, the Biden team brought back fellow Native American activist Ann Marie Bledsoe Downes from a stint at Arizona State University. Downes, who had served the Obama Administration in multiple roles at the Bureau of Indian Affairs, was hired in January 2021 as Deputy Solicitor for Indian Affairs but is now listed as Haaland’s Principal Deputy Solicitor.\n\nDownes was assigned to provide a legal justification for withdrawing the Twin Metals permits, and she did not disappoint. In a legal opinion issued on January 25, Downes concluded that the Twin Metals leases had been wrongfully renewed in 2019 and that the U.S. Forest Service had exercised a veto power over the project that the Trump bureaucrats ignored. A day later, Haaland dropped the bomb: Twin Metals was dead as a doornail.\n\nAxios reporter Torey Van Oot stated that Haaland’s action was both a “big win” for environmentalists and “a potentially fatal blow” to backers of the Twin Metals mine. Stauber agreed that the decision “will have devastating impacts on northern Minnesota and our nation.”\n\nWorse, Stauber said, Biden is “choosing foreign sourced minerals, including mines that use child slave labor, over our own domestic, union workforce that follows the best labor and environmental standards in the world…. This Administration has decided to leave American, blue-collar workers behind and bow to pressure from radicals.”\n\nThe National Mining Association charged that withdrawing Twin Metals’ “long-held” mineral leases “contradicts and will obstruct the realization of the goals established in [Biden’s] own stated jobs, economic, climate, infrastructure, and supply chain agendas.” “This decision,” they added, “is disappointing and foreshadows a global economic, energy, manufacturing, and overarching supply chain race where the U.S. may be watching from the sideline.\n\nTwin Metals, the victim of this high-tech lynching, was hardly surprised at Haaland’s bludgeon blow but promised in a statement to “challenge this attempt to stop our project and defend our valid existing mineral rights.” The company added, “We expect to prevail.”\n\nBut Twin Metals was not done: “This is not about law. This is a political action” intended to stop “a world-class underground copper, nickel, cobalt, and platinum group metals mine…. We are confident that a full environmental review will show that the science behind this modern mine will prove that we can advance this project safely under the highest of standards.”\n\nA year ago, this author asked whether the Biden Administration would put “Rare Earths First? Or Last?” I pointed out that the Chinese near-monopoly control of the rare-earths industry is largely a creation of activist-driven U.S. anti-mining policy.\n\nI added that President Trump’s 2017 [13817] and 2020 [13853] executive orders on critical minerals and the Energy Act of 2021 had “laid the groundwork to let the ‘clean-energy-focused’ [Biden] government have a shot at meeting the raw materials needs for the 21st Century technologies that President Biden has promised will drive tomorrow’s US economy.”\n\nI asked at the time whether the Biden-Harris White House would follow up on President Trump’s approach to rebuilding the U.S. rare-earths mining and processing industry or whether their obeisance to radical activists would “put America’s clean energy future in Chinese hands.”\n\nLooks like we have our answer.", "opengraph": {"locale": "en_US", "type": "article", "title": "Biden hitwoman’s poison pen stops Twin Metals mine", "description": "News flash: January 26, 2022. Headline: Biden Administration Cancels Twin Metals Leases.\r\n\r\nDid Joe Biden lie to American miners during the 2020 Presidential campaign, or did the lie come from zealous “reporters”?\r\n\r\nTwo weeks before the election, one reporter cited “three  sources familiar with the matter” to claim that Biden’s support for domestic mining of", "url": "https://www.cfact.org/2022/02/03/biden-hitwomans-poison-pen-stops-twin-metals-mine/", "site_name": "CFACT", "article:publisher": "http://www.facebook.com/cfact", "article:published_time": "2022-02-03T09:35:37+00:00", "article:modified_time": "2022-02-01T18:40:02+00:00", "image": "https://www.cfact.org/wp-content/uploads/2021/02/wyoming-supreme-court-overturns-ruling-using-guidance-to-block-mining.jpg", "image:width": "848", "image:height": "565", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.reuters.com/article/usa-election-mining-idUSKBN27808B", "US%20election:%20Biden%20supports%20domestic%20critical%20mineral%20production%20-%20Mining%20Technology%20(mining-technology.com)", "https://www.bbc.com/news/world-us-canada-55193939", "https://www.breitbart.com/politics/2021/08/30/21-times-joe-biden-promised-to-leave-no-one-behind/", "https://www.pinejournal.com/news/minnesota-tribal-members-celebrate-deb-haaland-confirmation-while-rep-stauber-opposition-faces-criticism", "https://pjmedia.com/columns/stacey-lennox/2021/02/10/the-u-s-chamber-of-commerce-has-buyers-regret-after-helping-to-fortify-the-election-n1424699", "https://www.globalenergyinstitute.org/secretary-haaland-gives-glimmer-hope-strategic-minerals", "https://www.globalenergyinstitute.org/secretary-haaland-gives-glimmer-hope-strategic-minerals", "https://www.doi.gov/sites/doi.gov/files/m-37072.pdf", "https://news.yahoo.com/biden-administrations-twin-metals-decision-121501593.html", "Stauber%20Issues%20Statement%20Blasting%20Biden%20Administration%20for%20Political%20Decision%20on%20Twin%20Metals%20Permit%20|%20Representative%20Pete%20Stauber%20(house.gov)", "https://www.twin-metals.com/press-release/twin-metals-minnesota-statement-on-cancelation-of-mineral-leases/", "https://www.eurasiareview.com/22012021-rare-earths-first-or-last-oped/", "https://gmail.us7.list-manage.com/track/click?u=fa0af696db3407c7d419116c8&id=0b85998903&e=56cb9e9919", "https://gmail.us7.list-manage.com/track/click?u=fa0af696db3407c7d419116c8&id=6c3b37ef24&e=56cb9e9919", "https://gmail.us7.list-manage.com/track/click?u=fa0af696db3407c7d419116c8&id=2847ee1afd&e=56cb9e9919", "https://gmail.us7.list-manage.com/track/click?u=fa0af696db3407c7d419116c8&id=a9f5797781&e=56cb9e9919", "https://www.cfact.org/author/duggan/"], "authors": ["Duggan Flanakin"], "publish_date": "2022-02-03T09:35:37+00:00"}