{"result_id": "077014", "URL": "https://www.cfact.org/2020/09/02/the-gnd-would-ground-air-force-one/", "timestamp": "2023-04-25 14:47:21 CEST+0200", "meta": {"description": "Just intermittent electricity will ground transportation and commerce.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.cfact.org/2020/09/02/the-gnd-would-ground-air-force-one/", "encoding": "utf-8"}, "image": null, "domain": "www.cfact.org", "title": "The GND would ground Air Force One", "cleaned_text": "According to Biden’s climate plan, America must run on 100 percent emissions-free intermittent electricity by 2050 virtually grounding Air Force One and all transportation industries that needs more than electricity to function.\n\nDemocrats are determined to deliver California’s dysfunctional renewable energy debacle to all. If Joe Biden, AOC, and her Squad get the keys to the White House this November, their New ‘Green’ Deal is guaranteed to deliver rocketing power prices and rolling blackouts across the USA.\n\nAs the COVID-19 pandemic showed us, the thousands of products made from petroleum derivatives were more important than the various fuels needed for the many transportation segments that were brought a standstill to commerce during the pandemic.\n\nDuring the quarantine, it was almost like living in the 1800’s with virtually no transportation systems, BUT and that’s a BIG BUT, we were able to survive the quarantine as we benefited from all those products derived from the derivatives from oil that produced all the critical medical equipment like ultrasound systems, mechanical ventilators, exhalation valves, inhalation valves, CT systems, X-ray, medicines, masks, gloves, soap and hand sanitizers for hospitals, and protective gowns, gloves and face shields gear for doctors and nurses. All those products begin from crude oil, or as the Wall Street Journal states – “Big Oil to the Coronavirus Rescue.” Vaccines need refrigeration, and refrigeration need electricity, especially in the hospital sector where redundant generation capacity is a mandate.\n\nAll the electronics and communications equipment that allowed us to work virtually are powered by electricity but are all made with the derivatives from petroleum that did not exist before 1900.\n\nWhile there’s been plenty of lip service paid to America’s ‘inevitable transition’ to intermittent electricity from wind and solar, the reality is that wind and solar obsessed California suffers the highest power prices in the US. Additionally, over the last month, a run of mass blackouts caused by shuttered power plants that were delivering continuous uninterruptable electricity and collapses in wind and solar intermittent electricity output.\n\nI know politicians both here and abroad are supportive of the GND’s intermittent electricity prospects to sunset the oil industry BUT imagine how life was without the industries we enjoy today, that were not around before 1900.\n\nThe inventions of the automobile, airplane, and the use of petroleum in the early 1900’s led us into the Industrial Revolution and victories in World Wars I and II. The healthier and wealthier countries of today now have fuels for various transportation infrastructure and more than 6,000 products manufactured from petroleum derivatives that did not exist before 1900.\n\nBefore 1900 the world had no medical industry, no electronic communications equipment, no militaries with needs to move ships, planes, tanks and armor, trucks, troop carriers, weaponry, supplies and anything else needed to assault and occupy nations that are increasing each year, and no space programs.\n\nThe airlines that now move 4 billion people around the world, and the cruise ships that now move 25 million passengers around the world, and the merchant ships that are now moving billions of dollars of products monthly throughout the world did not exist before 1900 and cannot exist on just electricity.\n\nOur U.S. politicians’ litigation and regulation grandiloquence seem to be unaware that oil and gas is not just an American business with its 135 refineries in the U.S., but an international industry with more than 700 refineries worldwide that supply oil products and fuels to the world.\n\nThe constant bickering to attract votes from those even less energy literate than our elected politicians seems to support their desires to hamper or close the American oil and gas industry. Without the U.S refineries our country would become a national security risk being dependent on foreign countries for our existence.\n\nShockingly, the U.S. could literally turn off the entire country from any source of fuels and petroleum products and global emissions would still grow according to U.S. Congressional testimony in 2017. The entire U.S. economy, military, and government could disappear, and global pollution, and respiratory illness would still rise. The reason why is “one of the biggest sources of carbon dioxide emissions is developing countries.” Think China, India, and Africa.\n\nJoe Biden’s plan to force Americans to use intermittent electricity from solar and wind will not stop global CO2 levels from rising, because China, India, and others will not be stupid enough to follow suit. The only thing it will bring about is an economic and security crisis in America.\n\nOver half (5,884) of the world’s coal power plants (10,210) are in China and India whose populations of mostly poor peoples is roughly 2.7 billion. Together they are in the process of building 634 new ones. They are putting their money and backs into their most abundant, affordable, and available source of energy – coal.\n\nCurrently, 2 out of every 7 people on our planet are Chinese or Indian. Both countries are desperate for electricity and are rejecting renewables for coal fired power plants. They are not following Germany’s failed climate goals which should be a wake-up all for governments everywhere. Germany’s obsession with intermittent wind and solar has resulted in power prices that are now the highest in Europe, if not the world, for those Germans who are lucky enough to be supplied with it.\n\nThe GND would make America a national security risk as it would rely on foreign sources for the petroleum derivatives that make 6,000 products that are part of modern society, and for all the fuels to operate Air Force One and the various transportation infrastructures that account for the world’s commerce.", "opengraph": {"locale": "en_US", "type": "article", "title": "The GND would ground Air Force One", "description": "According to Biden’s climate plan, America must run on 100 percent emissions-free intermittent electricity by 2050 virtually grounding Air Force One and all transportation industries that needs more than electricity to function.", "url": "https://www.cfact.org/2020/09/02/the-gnd-would-ground-air-force-one/", "site_name": "CFACT", "article:publisher": "http://www.facebook.com/cfact", "article:published_time": "2020-09-02T18:00:29+00:00", "article:modified_time": "2020-09-02T03:37:43+00:00", "image": "https://www.cfact.org/wp-content/uploads/2020/09/the-gnd-would-ground-air-force-one.jpg", "image:width": "847", "image:height": "565", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://joebiden.com/climate-plan/", "https://www.wsj.com/articles/big-oil-to-the-coronavirus-rescue-11587683239", "https://www.amazon.com/Just-Green-Electricity-Citizens-Understand/dp/1480890707", "https://en.wikipedia.org/wiki/Petroleum_refining_in_the_United_States", "https://hrcak.srce.hr/file/65010", "https://docs.house.gov/meetings/SY/SY18/20170228/105632/HHRG-115-SY18-Wstate-DayaratnaK-20170228.pdf", "https://www.heritage.org/energy-economics/commentary/green-new-deal-would-barely-change-earths-temperature-here-are-the", "#gid=0", "https://stopthesethings.com/2020/02/10/full-steam-ahead-china-rejects-wind-solar-power-and-heads-for-coal-fired-future/", "https://www.bloomberg.com/graphics/2018-germany-emissions/", "https://www.cfact.org/author/cfact-ed/", "https://www.cfact.org/author/ronstein/"], "authors": ["CFACT Ed, Ronald Stein"], "publish_date": "2020-09-02T18:00:29+00:00"}