{"result_id": "077038", "URL": "https://www.cfact.org/2023/02/22/you-cannot-run-businesses-hospitals-and-the-military-on-occasional-electricity/", "timestamp": "2023-04-25 14:47:46 CEST+0200", "meta": {"description": "The elephant in the room that politicians refuse to talk about is that renewables only generate electricity, but cannot manufacture any products for society.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.cfact.org/2023/02/22/you-cannot-run-businesses-hospitals-and-the-military-on-occasional-electricity/", "encoding": "utf-8"}, "image": null, "domain": "www.cfact.org", "title": "You cannot run businesses, hospitals, and the military on occasional electricity!", "cleaned_text": "Regardless of the intermittency of the weather, the electrical grid is expected to deliver continuous and uninterrupted electricity no matter what the weather.\n\nPower grid blackouts are driven by the rapid retirement of small acreage coal and natural gas power plants.\n\nWind and solar electricity generation requires vast amounts of pristine acreage, but due to the intermittency and variability of breezes and sunshine being a significant deficiency, wind turbines and solar panels do not work most of the time.\n\nThis is illustrative of why a myopic focus on renewables for reducing carbon-dioxide emissions through a deepening dependence on the intermittency of wind and solar electricity must ultimately come to terms with the laws of physics and the high financial and environmental cost of achieving a reliable electrical grid with these technologies.\n\nFuture carbon dioxide concentrations in the global atmosphere will be largely determined by developing nations who are digging themselves out of abject poverty through the development of coal and natural gas energy resources.\n\nPoliticians have backed utility engineers into a corner as politicians now designing the power grid to their liking. However, politicians are not cognizant enough to know that renewables only generate electricity, and thus have no plans for the replacement of what is now manufactured from fossil fuels, which are supporting the 8 billion on this planet!\n\nOver the last 200 years when the world populated from 1 to 8 billion, we learned that crude oil is virtually useless, unless it’s manufactured (refineries) into oil derivatives that are the basis of more than 6,000 products in our daily lives that did not exist before the 1900’s, and the fuels to move the heavy-weight and long-range needs of more than 50,000 jets moving people and products, and more than 50,000 merchant ships for global trade flows, and the military and space program.\n\nChemical products, such as plastics, solvents, and fertilizers, are essential for supporting modern lifestyles.\n\nWhile we use thousands of chemicals in our lives, most of them are derived from eight primary chemicals, namely ammonia, methanol, ethylene, propylene, benzene, toluene, and mixed xylenes, all of which are manufactured from crude oil.\n• Ammonia is the base chemical for all nitrogen fertilizers, which are critical for improving agricultural yields in food production.\n• Methanol—the simplest alcohol—is a chemical building block for adhesives, paints, and construction materials. Approximately 60 percent of methanol is used as precursor chemicals in production, such as acetic acid (or vinegar) and formaldehyde, used in the production of particle boards and coatings.\n• Ethylene, propylene, and butadiene (the most important olefins) are used as raw materials in the production of chemical and polymer products such as plastics, detergents, adhesives, and rubber.\n• Benzene, toluene, and xylene (known as aromatics) are key building block chemicals for consumer products like aspirin, refrigerants, and textiles. About 45 percent of benzene is used in the production of polystyrene plastics, used in foam insulations and single-use cups, while 82 percent of xylenes are used to produce polyethene terephthalate plastics, used in plastic bottles.\n\nToday, the world’s 8 billion are dependent on the products manufactured from oil. Changing that dependency on oil for all the products and fuels manufactured from oil will inflict product shortages throughout the worldwide economy.\n\nAn educational video for politicians is the 1-minute YouTube clip about the elephant in the room that no one wants to talk about: Renewables only generate electricity, but manufacture nothing for society. The 1-minute video is short, educational, and entertaining to politician. The video has already been viewed by more than 800,000 on social media!\n\nThe challenge for the renewable electricity movement is that refineries only exist economically to manufacture gasoline and diesel fuels for the global fleet of road vehicles in 2022 that numbered about 1.446 billion, that’s with a “B”.\n\nOf this huge global fleet, only 12 million were electric vehicles (EV) in 2021. Thus, less than one percent of the worldwide road vehicle fleet were EVs, and more than 99-percent of the global fleet was “yet to be replaced”.\n\nRefineries are not economically viable JUST to manufacture lower grade bunker fuels for ships, aviation fuels for planes, and the by-products of oil derivatives that are the basis of more than 6,000 products that are now demanded by societies and economies.\n\nWithout a planned replacement for oil, product shortages are imminent to support the 8 billion that’s projected to grow to 9.7 billion by 2050.\n\nWe continue to argue for a more balanced approach where perhaps the most environmentally responsible thing we can do is generate the most electricity possible, on the smallest piece of land possible, and as close to where the electricity will be consumed as possible.\n\nIf carbon dioxide emission reductions are your goal or mandate for electricity generation, then natural gas and nuclear power are the rational near and long-term answers.\n• The Small Modular Nuclear Reactors (SMR’s) are the same technology that’s safely powering 160 ships and submarines all around the world right now, and has been for decades; the USS Nautilus set sail and submerged in 1955, forever changing the model for naval propulsion.\n• Altogether, there are 30 countries where you’ll find nearly 450 nuclear reactors currently operating – as well as the Germans and French – Americans, Canadians, Japanese and Chinese are well aware of the benefits of nuclear power. Another 15 countries are currently building 60 reactors among them.\n• The Inflation Reduction Act, Democrats’ new green energy and healthcare spending law, offers a mix of tax incentives to nuclear power generators and funding to produce the uranium necessary to fuel advanced reactors.\n\nToday’s life without fossil fuels is symptomatic of the lack of energy literacy among world leaders who haven’t the faintest idea about what makes their safe and utterly privileged lives possible.\n• Renewable energy in only occasional electricity from breezes and sunshine.\n• Wind turbines and solar panels CANNOT manufacture anything for society: NO products and NO fuels.\n• Subsidies for EV’s, wind, and solar, are financial incentives to continue the exploitations of folks with yellow, brown, and back skin in the developing countries that are mining for the exotic minerals and metals to go green.\n\nWorld leaders are NOT cognizant that the world has a “products” shortage, not an electricity shortage, but continue their relentless push for renewables that only generate electricity. World leaders have no plans for the replacement of what is now manufactured from fossil fuels, which are supporting the 8 billion on this planet!", "opengraph": {"locale": "en_US", "type": "article", "title": "You cannot run businesses, hospitals, and the military on occasional electricity!", "description": "Regardless of the intermittency of the weather, the electrical grid is expected to deliver continuous and uninterrupted electricity no matter what the weather.\r\nPower grid blackouts are driven by the rapid retirement of small acreage coal and natural gas power plants.\r\nWind and solar electricity generation requires vast amounts of pristine acreage, but due", "url": "https://www.cfact.org/2023/02/22/you-cannot-run-businesses-hospitals-and-the-military-on-occasional-electricity/", "site_name": "CFACT", "article:publisher": "http://www.facebook.com/cfact", "article:published_time": "2023-02-23T02:49:57+00:00", "article:modified_time": "2023-02-23T03:03:20+00:00", "image": "https://www.cfact.org/wp-content/uploads/2023/01/Wind-farm-sunset-red.jpg", "image:width": "847", "image:height": "565", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://urldefense.proofpoint.com/v2/url?u=https-3A__www.youtube.com_shorts_stf2YrznkZU&d=DwMGaQ&c=euGZstcaTDllvimEN8b7jXrwqOf-v5A_CdpgnVfiiMM&r=XIveXu1levogIu1CK8XieKWTe8EQWZ39C112RCHbTsM&m=VkUhVo6yL0ODgWZgpCnJFSi0abK9rV7I9iUnciI15io&s=YTjWbIurv7EmDe0nxzsKjC0nU32yRc70Js1SrUw1rWc&e=", "https://hedgescompany.com/blog/2021/06/how-many-cars-are-there-in-the-world/", "https://www.statista.com/statistics/970958/worldwide-number-of-electric-vehicles/", "https://world-nuclear.org/information-library/non-power-nuclear-applications/transport/nuclear-powered-ships.aspx", "https://www.nei.org/Knowledge-Center/Nuclear-Statistics/World-Statistics", "https://www.cfact.org/author/ronstein/"], "authors": ["Ronald Stein"], "publish_date": "2023-02-23T02:49:57+00:00"}