{"result_id": "077003", "URL": "https://www.cfact.org/2023/03/17/the-esg-pushback-is-on/", "timestamp": "2023-04-25 14:47:10 CEST+0200", "meta": {"description": "The life savings of pensioners, and every one of us engaged in \"the pursuit of happiness\" in America, are not fair game for left-wing social engineering.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.cfact.org/2023/03/17/the-esg-pushback-is-on/", "encoding": "utf-8"}, "image": null, "domain": "www.cfact.org", "title": "The ESG pushback is on!", "cleaned_text": "ESG, or “Environmental, Social and Governance” investing, is a pernicious left-wing tactic designed to achieve policy goals that cannot pass legislatures by distorting investment decisions.\n\nESG represents not only a sneaky false flag means of forcing policy decisions, but a real threat to investors large and small.\n\nESG may have already contributed to the insolvency of Silicon Valley Bank, which carried a portfolio high in investments made, not for the likelihood of achieving solid returns, but to curry favor with the “woke” mob.\n\nHere are three points I made during my testimony at a North Dakota Senate hearing this week (full submission at CFACT.org) that apply equally to every state:\n• ESG is not concerned with advancing the economic interests of North Dakotans. Instead, it is a top-down, elitist inspired effort reflecting the interests and priorities of multibillionaires and internationalists.\n• ESG is random with its ratings, it’s not applied fairly, and it empowers America’s adversaries – notably China.\n• It simply doesn’t work. ESG investing is not getting the returns it promised investors, nor is it changing the world for the better. In fact, it’s doing the opposite!\n\nGovernor Ron DeSantis announced legislation to protect Floridians from ESG which he stated “builds on my commitment to protect consumers’ investments and their ability to access financial services in the Free State of Florida,” said Governor Ron DeSantis. “By applying arbitrary ESG financial metrics that serve no one except the companies that created them, elites are circumventing the ballot box to implement a radical ideological agenda. Through this legislation, we will protect the investments of Floridians and the ability of Floridians to participate in the economy.”\n\n“We will not stand idly by as the stability of our country’s economy is threatened by woke executives who put their political agenda ahead of their clients’ finances,” DeSantis said.\n\nThe Washington Examiner reports that DeSantis will form an anti-ESG alliance “with Alabama, Alaska, Arkansas, Georgia, Idaho, Iowa, Mississippi, Missouri, Montana, Nebraska, New Hampshire, North Dakota, Oklahoma, South Dakota, Tennessee, Utah, West Virginia, and Wyoming.”\n\nThese states are expected, in addition to other measures, to forbid their pension funds from abandoning sound business practice in pursuit of ESG.\n\nThe life savings of pensioners, and every one of us engaged in “the pursuit of happiness” in America, are not fair game for left-wing social engineering.\n\nGovernor Ron DeSantis Announces\n\n Legislation to Protect Floridians from\n\n the Woke ESG Financial Scam\n\n\n\n DeSantis to unveil alliance\n\n with 18 states to combat\n\n Biden’s ‘woke’ ESG agenda\n\nRead the facts at the\n\n Washington Examiner", "opengraph": {"locale": "en_US", "type": "article", "title": "The ESG pushback is on!", "description": "ESG, or \"Environmental, Social and Governance\" investing, is a pernicious left-wing tactic designed to achieve policy goals that cannot pass legislatures by distorting investment decisions.\r\n\r\nESG represents not only a sneaky false flag means of forcing policy decisions, but a real threat to investors large and small.\r\n\r\nESG may have already contributed to the insolvency of", "url": "https://www.cfact.org/2023/03/17/the-esg-pushback-is-on/", "site_name": "CFACT", "article:publisher": "http://www.facebook.com/cfact", "article:published_time": "2023-03-17T14:47:27+00:00", "image": "https://www.cfact.org/wp-content/uploads/2022/12/ESG-business-people.jpg", "image:width": "847", "image:height": "565", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.cfact.org/2023/03/16/svb-esg-and-bidens-erisa-rule/", "http://www.cfact.org/wp-content/uploads/2023/03/Craig-Rucker-CFACT-Comments-HB-1429-2023.pdf", "http://www.cfact.org/wp-content/uploads/2023/03/Desantis-ESG-states-press-release.pdf", "https://www.washingtonexaminer.com/policy/economy/desantis-forms-alliancto-combat-biden-esg-agenda", "https://www.washingtonexaminer.com/policy/economy/desantis-forms-alliancto-combat-biden-esg-agenda", "http://www.cfact.org/wp-content/uploads/2023/03/ESG-Green-to-Red.jpg", "http://www.cfact.org/wp-content/uploads/2023/03/Craig-Rucker-CFACT-Comments-HB-1429-2023.pdf", "http://www.cfact.org/wp-content/uploads/2023/03/Desantis-desk.jpg", "http://www.cfact.org/wp-content/uploads/2023/03/Desantis-ESG-states-press-release.pdf", "http://www.cfact.org/wp-content/uploads/2023/03/Ron-Desantis-State-of-State.jpg", "https://www.washingtonexaminer.com/policy/economy/desantis-forms-alliancto-combat-biden-esg-agenda", "https://www.cfact.org/author/crucker/"], "authors": ["Craig Rucker"], "publish_date": "2023-03-17T14:47:27+00:00"}