{"result_id": "077037", "URL": "https://www.cfact.org/2010/08/27/end-environmental-experiments-on-africans/", "timestamp": "2023-04-25 14:47:45 CEST+0200", "meta": {"description": "By Fiona KobusingyeI wish I had a shilling for every time someone told me spraying homes with DDT to prevent malaria is like using Africans in evil", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.cfact.org/2010/08/27/end-environmental-experiments-on-africans/", "encoding": "utf-8"}, "image": null, "domain": "www.cfact.org", "title": "End environmental experiments on Africans!", "cleaned_text": "I wish I had a shilling for every time someone told me spraying homes with DDT to prevent malaria is like using Africans in evil experiments. I would be a rich woman.\n\nThat claim is a blatant falsehood. Even worse, it hides the many ways poor Africans really are being used in environmental experiments that cause increased poverty, disease and death.\n\nIf any people were ever used in DDT experiments, it was Americans and Europeans. During World War II, this insecticide and mosquito repellant was sprayed on tents and around camps to keep American and British soldiers from getting malaria. After the war, millions of concentration camp survivors, and millions of German and Italian citizens were sprayed with DDT (right on their bodies) to prevent typhus.\n\nThen in the 1950s and 1960s, America and Europe sprayed huge amounts of DDT all over, as a critical part of their campaign to eradicate malaria. Yes, they still had malaria in those countries! But not anymore.\n\nNumerous scientific and medical studies found that DDT was safe, and that it did not cause cancer or other health problems worse that skin rashes, even with high levels of exposure. Anti-insecticide activists still say “some experts think” DDT “may be linked” to things such as low birth weights in newborn babies, lactation failure in nursing mothers or slight reductions in mental power. However, they have never been able to prove any of this – and we know malaria clearly does cause these problems.\n\nAmerica and Europe banned DDT anyway, but only after they had used it to eliminate malaria. And in Africa we only want to spray a little on the walls of houses, to keep mosquitoes out, keep them from biting if they do come in the house, and save millions of lives! Nothing else works as well, at any price.\n\nAmerica and Europe used a chemical (DDT) that environmentalists now claim is dangerous. But the chemical got rid of malaria. Nobody got cancer or other health problems from DDT.\n\nJust as important, around the same time, thousands of brave American and Canadian parents let their children be used in another health experiment: they had them inoculated with the Salk vaccine, to see if it would prevent polio. It worked! And it started a worldwide program that has almost eliminated that terrible disease.\n\nIf Africans used DDT for indoor residual spraying, they will be using a chemical that America, Europe, India, South Africa, Ethiopia, Mozambique, Namibia, Swaziland, Zambia and Zimbabwe have all shown is effective in fighting malaria, and safe for people and the environment.\n\nBut environmentalists still say, don’t do it in Uganda, Rwanda and other countries where malaria is still killing our parents and babies. They say we should just use bed nets, ACT drugs and maybe some Icon. These things certainly help. But they only reduce malaria by 30% or so – whereas we could prevent and almost eradicate this disease, if we would also use DDT.\n\nBluntly put, environmentalists are using African parents and children in anti-DDT experiments. Against all the evidence from decades of using only nets and drugs and maybe other insecticides, they want to keep ignoring DDT as a long-lasting spatial insect repellant. They want to keep us doing what has at best worked only partially, on the assumption that maybe it will work better next year – or that a 30% malaria reduction is good enough.\n\nThey are playing with our lives. So are the government agencies, health NGOs and others who support their policies. This is wrong and immoral. And it is only one of the ways they use Africans as experimental laboratory animals. They are also denying us access to other modern technologies that can improve and save lives.\n\n600 million people in sub-Sahara Africa live on two million shillings ($900 USD) or less per year. Nearly 700 million never have electric power for lights, refrigeration, schools, shops and clinics – or have it only a few hours per week. Millions die from diseases that would be prevented, if they did not have to burn wood and dung, and had safe water, better healthcare and higher living standards that reliable, affordable electrical power would bring.\n\nBut environmentalists constantly block coal, gas and hydro-electric power plants. They want us to live in experimental societies where people get whatever limited electrical power can be generated day to day with wind turbines or solar panels. They pressured the World Bank to reject loan applications for power plants in Ghana and South Africa, and support President Obama when he says Africans should focus on wind, solar and bio-fuel power, instead of fossil fuels.\n\nMeanwhile, they live in wealthy countries, with all the electrical power they need. With the health, opportunity and prosperity electrical power brings. With freedom and mobility that cars and fossil fuels bring. With blessings most Africans can only dream of.\n\nRadical greenies also oppose agricultural technologies that would bring a green revolution to Africa. They denounce seeds that have been “touched by corporations” – even hybrid, but especially biotech seeds – that produce bigger, more nutritious crops, resist plant diseases like banana wilt and cassava brown streak, survive droughts, thrive in nutrient-poor or saline soils, and require fewer pesticide applications.\n\nThey want us to rely on traditional “open-pollinated” seeds that have lower germination rates and crop yields – seeds that require more land and more backbreaking labor, but generate so little income that farmers stay impoverished for life, and people continue to starve.\n\nChina and India put up with this immoral eco-colonialism for decades. Finally, they had enough. They refused to be the environmentalists’ experimental pawns any longer. They took charge of their own destinies, charted their own future, financed their own projects, and refused to be stopped again by anti-development green policies, politicians and pressure groups.\n\nUganda, the Great Lakes Region and all of Africa need to do the same thing. We have the land and natural resources, the bright and hardworking people.\n\nLet us be brave and bold! Let us become prosperous and healthy together.\n\nFiona Kobusingye is co-chair of the Congress of Racial Equality Uganda and Kill Malarial Mosquitoes Now coalition.", "opengraph": {"locale": "en_US", "type": "article", "title": "End environmental experiments on Africans!", "description": "By Fiona KobusingyeI wish I had a shilling for every time someone told me spraying homes with DDT to prevent malaria is like using Africans in evil experiments. I would be a rich woman.That claim is a blatant falsehood. Even worse, it hides the many ways poor", "url": "https://www.cfact.org/2010/08/27/end-environmental-experiments-on-africans/", "site_name": "CFACT", "article:publisher": "http://www.facebook.com/cfact", "article:published_time": "2010-08-27T08:58:33+00:00", "article:modified_time": "2012-09-17T02:32:44+00:00", "image": "http://www.cfact.org/wp-content/uploads/2023/02/3DLogo2023.png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.cfact.org/author/christina/"], "authors": ["Christina Norman"], "publish_date": "2010-08-27T08:58:33+00:00"}