{"result_id": "077019", "URL": "https://www.cfact.org/2023/03/02/reuters-science-correspondent-i-was-wrong-on-climate/", "timestamp": "2023-04-25 14:47:26 CEST+0200", "meta": {"description": "Reuters reporter Neil Winton admitted he \"was wrong\" for going along and not putting in the journalistic effort to question the media's prevailing climate narrative.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.cfact.org/2023/03/02/reuters-science-correspondent-i-was-wrong-on-climate/", "encoding": "utf-8"}, "image": null, "domain": "www.cfact.org", "title": "Reuters science correspondent: \"I was wrong\" on climate", "cleaned_text": "Neil Winton worked at Reuters for 32 years, including as global science and technology correspondent.\n\nWinton recently admitted he “was wrong” for going along and not putting in the journalistic effort to question the media’s prevailing climate narrative.\n\nWhen I became Reuters global Science and Technology Correspondent in the mid-1990s, the global warming story was top of my agenda. Already by then the BBC was scaring us saying we would all die unless humankind mended its selfish ways. Carbon dioxide (CO ) was the culprit and had to be tamed, then eliminated. I had no reason to think this wasn’t established fact. I was wrong.\n\nMy Reuters credentials meant that I had easy access to the world’s finest climate scientists. To my amazement, none of these would say categorically that the link between CO and global warming, now known as climate change, was a proven scientific fact. Some said human production of CO was a probable cause, others that it might make some contribution; some said CO had no role at all. Everybody agreed that the climate had warmed over the last 10,000 years as the ice age retreated, but most weren’t really sure why. The sun’s radiation, which changes over time, was a favoured culprit.\n\nMy reporting reflected the wide range of views, with Reuters typical “on the one hand this, on the other, that” style. But even then, the mainstream media seem to have run out of the energy required, and often lazily went along with the BBC’s faulty, opinionated thesis. It was too much trouble to make the point that the BBC’s conclusion was challenged by many impressive scientists.\n\nWinton went on to make an essential point about the threat Green radicalism poses to freedom that has been essential to CFACT’s mission since our founding:\n\nThe Left had lost all of the economic arguments by the 1990s, and its activists eagerly grabbed the chance to say free markets and small government couldn’t save us from climate change; only government intervention could do that.\n\nThank you Neil Winton for this important peek inside the world of media groupthink and your insight as to how Reuters, and so many others, lost the plot on climate.\n\nAt the dawn of the 20th century, the humorist Finley Peter Dunne wrote about newspapers that “comfort the afflicted and afflict the comfortable.”\n\nNo one has grown more fat and comfortable, and no one more deserving of a little journalistic affliction, than those accumulating vast power and fortunes by cashing in on climate. Just ask Reuters.\n\nReporters, do your job. Ask the tough questions and fully vet the climate narrative and the myriad conflicts that flow from it.\n\nThe public deserves to know.", "opengraph": {"locale": "en_US", "type": "article", "title": "Reuters science correspondent: \"I was wrong\" on climate", "description": "Neil Winton worked at Reuters for 32 years, including as global science and technology correspondent.\r\n\r\nWinton recently admitted he \"was wrong\" for going along and not putting in the journalistic effort to question the media's prevailing climate narrative.\r\n\r\nMarc Morano posted details at CFACT's Climate Depot.\r\nWinton said:", "url": "https://www.cfact.org/2023/03/02/reuters-science-correspondent-i-was-wrong-on-climate/", "site_name": "CFACT", "article:publisher": "http://www.facebook.com/cfact", "article:published_time": "2023-03-02T16:33:26+00:00", "article:modified_time": "2023-03-02T17:16:38+00:00", "image": "https://www.cfact.org/wp-content/uploads/2023/03/News-typewriter-L.jpg", "image:width": "1590", "image:height": "975", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.climatedepot.com/2023/02/27/32-year-reuters-veteran-reporter-comes-clean-on-climate-change-i-had-no-reason-to-think-this-wasnt-established-fact-i-was-wrong/", "http://www.cfact.org/wp-content/uploads/2023/03/Reuters-Neil-Winton.jpg", "https://www.wintonsblog.com/climate-change-an-alternative-view-but-backed-by-top-experts/", "https://www.pulitzer.org/article/voice-underdog-and-underprivileged", "https://www.reuters.com/business/cop/world-needs-5-trillion-annual-climate-finance-by-2030-rapid-action-2021-10-28/", "https://www.cfact.org/author/crucker/"], "authors": ["Craig Rucker"], "publish_date": "2023-03-02T16:33:26+00:00"}