{"result_id": "077041", "URL": "https://www.cfact.org/2023/03/30/blackrocks-larry-fink-and-the-new-post-esg-realism/?utm_source=rss&utm_medium=rss&utm_campaign=blackrocks-larry-fink-and-the-new-post-esg-realism&utm_source=rss&utm_medium=rss&utm_campaign=blackrocks-larry-fink-and-the-new-post-esg-realism", "timestamp": "2023-04-25 14:47:49 CEST+0200", "meta": {"description": "Swept along by climate-change fervor, an investment manager “can’t make such commitments without reneging on its fiduciary duties.\"", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.cfact.org/2023/03/30/blackrocks-larry-fink-and-the-new-post-esg-realism/", "encoding": "utf-8"}, "image": null, "domain": "www.cfact.org", "title": "BlackRock’s Larry Fink and the new post-ESG realism", "cleaned_text": "As regular as the turn of the seasons, each January sees Larry Fink, founder and CEO of BlackRock, the world’s largest asset manager, publish a lengthy letter on the state of the world and its implications for finance and investors. This year, January turned to February, and still no letter. Instead, February saw Tim Buckley, CEO of Vanguard, global number-two asset manager, give a groundbreaking interview explaining Vanguard’s decision late last year to quit the Net Zero Asset Managers (NZAM) initiative, which had been formed ahead of the 2021 Glasgow climate conference to reallocate capital in line with net zero emissions targets.\n\n“It would be hubris to presume that we know the right strategy for the thousands of companies that Vanguard invests in,” Buckley told the Financial Times, adding that Vanguard was “not in the game of politics.” He warned investors against expecting superior returns from environmental, social, and governance (ESG) investing. “Our research indicates that ESG investing does not have any advantage over broad-based investing.”\n\nWriting five days later in the Wall Street Journal, Terrence Keely, former BlackRock executive and author of Sustainable, zeroed in on the conflict of interest highlighted by Vanguard’s departure from NZAM and NZAM’s net zero goal. Swept along by climate-change fervor, an investment manager “can’t make such commitments without reneging on its fiduciary duties,” Keeley argued. Membership of an alliance committed to achieving net zero demands clairvoyance that no investment manager can promise. “If Mr. Buckley is right, then hundreds of other financial institutions with trillions of assets under management are wrong”—Keeley’s unstated implication being that if Vanguard is right, BlackRock is also wrong.\n\nWhen it came earlier this month, Fink’s 2023 letter colored in the new investment climate adumbrated by BlackRock’s chief competitor. Whereas Fink’s 2021 letter to CEOs mentioned net zero 22 times and his 2022 letter, nine times, net zero was referred to only once this year—and then, only in passing (“European governments are also developing incentives to support the transition to a net zero economy and drive growth.”) Similarly, mentions of ESG have fallen from ten in 2021, to one last year, to none this year. How times have changed.\n\nTwo years ago, BlackRock made a blunt demand of the companies that it invests in: “We are asking”—that’s an instruction; you can hardly say no to the world’s largest investor—“companies to disclose a plan for how their business model will be compatible with a net zero economy.” This hasn’t been entirely walked back. BlackRock, Fink says, has been vocal in the past about companies disclosing how they plan to navigate the energy transition, but the tone now is softer and less vocal. It is not the role of an asset manager like BlackRock to engineer a particular outcome in the economy, Fink writes, and it’s not its place to tell companies what to do. Forswearing the clairvoyance that Keeley criticizes, Fink says that BlackRock doesn’t “know the ultimate path and timing of the transition,” a position that is not as crystalline as Buckley’s but is hard to reconcile with BlackRock’s continued membership of NZAM. Had this been BlackRock’s position two years ago, it would have been noisily condemned by climate activists and BlackRock would have been accused of sabotaging the Glasgow climate conference. So far, there has scarcely been a murmur. The world is quietly moving on from net zero.\n\nSo have BlackRock’s priorities. Whereas climate rates five mentions this year, compared with 27 two years ago, there are 122 mentions of clients—over four times the number in the BlackRock Global Executive Committee’s “Dear Clients” letter two years ago. Even more revealing is the change in the number of mentions of trust and fiduciary. There are 21 mentions of trust this year and one in the 2021 letter. That letter, billed “Net zero: a fiduciary approach,” contained only one other mention of fiduciary, a lapse that bears out Keeley’s argument on the incompatibility of imposing climate targets on asset portfolios and investment managers discharging their fiduciary duties.\n\nFink’s emphasis has changed, too. Two years ago, Fink compared climate change with the Covid pandemic as an existential threat exposing the fragility of society. This year, Russia’s invasion of Ukraine and heightened geopolitical tensions bring national and economic security “front and center.” In the short term, making supply chains more resilient is highly inflationary, Fink writes, and it’s fair to say that Fink doesn’t believe that the Inflation Reduction Act will reduce inflation. “I believe inflation is more likely to stay closer to 3.5 percent or 4 percent in the next few years.”\n\nThe crisis that Fink highlights in this year’s letter is not a climate crisis, but a silent crisis of people not saving and investing sufficiently for their retirement. Results of an Edelman Trust Barometer survey asking whether people thought their families would be better off in five years were at an all-time low in 24 out of 28 countries. “When people are afraid, they may save, but they won’t invest,” Fink observes. “We need leaders today who will give people reasons to be hopeful, who can articulate a vision for a brighter future.” Amen to that. It’s high time to end talk about existential crises to be addressed with extraordinarily costly measures that make people poorer, weaken national and economic security and, instead, turn attention to tackling soluble problems with positive solutions.", "opengraph": {"locale": "en_US", "type": "article", "title": "BlackRock’s Larry Fink and the new post-ESG realism", "description": "As regular as the turn of the seasons, each January sees Larry Fink, founder and CEO of BlackRock, the world’s largest asset manager, publish a lengthy letter on the state of the world and its implications for finance and investors. This year, January turned to February, and still no letter. Instead, February saw Tim Buckley,", "url": "https://www.cfact.org/2023/03/30/blackrocks-larry-fink-and-the-new-post-esg-realism/", "site_name": "CFACT", "article:publisher": "http://www.facebook.com/cfact", "article:published_time": "2023-03-30T16:06:10+00:00", "article:modified_time": "2023-03-30T13:58:45+00:00", "image": "https://www.cfact.org/wp-content/uploads/2023/03/Pensioners-retirees-computer.jpg", "image:width": "2508", "image:height": "1672", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.ft.com/content/9dab65dd-64c8-40c0-ae6e-fac4689dcc77", "https://www.realclearbooks.com/articles/2022/12/16/esg_rip_review_of_terrence_keeleys_sustainable_870618.html", "https://www.wsj.com/articles/vanguards-ceo-bucks-the-esg-orthodoxy-tim-buckley-net-zero-emissions-united-nations-initiative-nzam-f6ae910d", "https://www.blackrock.com/corporate/investor-relations/larry-fink-annual-chairmans-letter", "https://www.blackrock.com/us/individual/2021-larry-fink-ceo-letter", "https://www.blackrock.com/corporate/investor-relations/larry-fink-ceo-letter", "https://www.blackrock.com/us/individual/2021-blackrock-client-letter", "https://www.edelman.com/sites/g/files/aatuss191/files/2023-01/2023%20Edelman%20Trust%20Barometer%20Global%20Report_0.pdf", "https://www.cfact.org/author/rupert-darwall/"], "authors": ["Rupert Darwall"], "publish_date": "2023-03-30T16:06:10+00:00"}