{"result_id": "077018", "URL": "https://www.cfact.org/2023/03/28/breakthru-a-big-utility-says-net-zero-may-not-be-reliable/", "timestamp": "2023-04-25 14:47:25 CEST+0200", "meta": {"description": "Dominion Energy, the big Virginia utility, has finally admitted that net zero may not work.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.cfact.org/2023/03/28/breakthru-a-big-utility-says-net-zero-may-not-be-reliable/", "encoding": "utf-8"}, "image": null, "domain": "www.cfact.org", "title": "Breakthrough! A big utility says net zero may not be reliable", "cleaned_text": "Dominion Energy, the big Virginia utility, has finally admitted that net zero may not work. I have been writing about Dominion, which operates under the net zero Virginia Clean Economy Act (VCEA), for awhile now. VCEA requires Dominion to shut down all gas, oil and coal fired power by 2045.\n\nMy point has been that VCEA cannot be done. Now Dominion has met me half way, saying in their new Integrated Resource Plan (IRP) that maybe it cannot be done. So far so good.\n\nIn their new, 2022 IRP the VCEA compliance plan is called Plan D. Here is how Dominion puts it in the Executive Summary:\n\n“Plan D results in the Company purchasing 5,000 MW of capacity in 2045 and beyond, raising concerns about system reliability and energy independence, including over-reliance on out-of-state capacity to meet customer needs. Over time as more renewable energy and energy storage resources are added to the system, the Company will learn if Plan D can maintain a reliable system.”\n\nTo begin with, note that they hope to buy a whopping 5,000 MW of juice when things get tight with the renewables they are forced to use. This is truly funny because in their 2021 IRP they specifically said that buying juice was a bad plan because every nearby utility is planning on doing the same thing. Thus there will be no sellers of said juice. Now they plan on it!\n\nIt gets worse. As I have reported before, Dominion’s VCEA plans have nowhere near the battery storage required to make the planned renewables reliable. See my “Dominion’s VCEA Compliance Plan is Disastrously Unreliable” at\n\nPlan D plays the standard trick of reporting battery storage in MW, which is designed to make batteries look like generators. MW is actually the discharge capacity, not the storage capacity. Imagine buying orange juice this way. Tropicana has twice as big a spout as Minute Maid but that is not what you are buying. You buy the juice not the pour speed.\n\nSo Plan D has roughly 27,000 MW of solar but just 9,000 MW of storage. Assuming standard 4 hour batteries this gives just 36,000 MWh of storage capacity. That stores the solar for just over 1.3 hours, which does not even come close to getting you through the night. Cloudy days? Forget about it.\n\nSo Dominion’s VCEA compliance plan assumes huge amounts of juice coming from somewhere else, which it won’t, plus battery storage that won’t get you through the night. Saying this “might not work” is laughable, but it is a big step up from ignoring the fact that it will not work, which is what all of America’s big utilities have been doing.\n\nKeep in mind that the big utilities are making a fortune off of the bogus net zero game. They make a guaranteed profit on every approved dollar they spend on mandated renewables that do not work reliably.\n\nThe big utilities have zero incentive for blowing the whistle on net zero, but at least Dominion has said it might not work. But of course their ever so weak “time will tell” warning lets them keep on spending untold billions on unworkable renewables.\n\nSpeaking of spending billions there is another trick worth noting in the IRP. Another standard con called discounting future cost to present value.\n\nDominion says that VCEA compliant Plan D will cost just over 88 billion dollars. That is $88,000,000,000. A lot of money, right? Well not compared to the actual cost.\n\nThe way this works is you first figure a future cost, say what folks will pay in 2040. Then you do what amounts to reverse compound interest, taking a percentage off every year from then (2040) until the present (in this case 2022). This is the discounted value.\n\nObviously the discounted value is a lot less than what Dominion’s customers will actually have to pay when 2040 rolls around. What that amount is we are not told. But the total cost of Dominion’s VCEA compliance is likely to be more like 200 to 400 billion dollars, not a “mere” 88 billion.\n\nThe good news is that Dominion finally admits that the net zero VCEA might not work. The bad news is Dominion Energy will spend hundreds of billions of ratepayer’s money before the inevitable failure of VCEA becomes obvious.", "opengraph": {"locale": "en_US", "type": "article", "title": "Breakthrough! A big utility says net zero may not be reliable", "description": "Dominion Energy, the big Virginia utility, has finally admitted that net zero may not work. I have been writing about Dominion, which operates under the net zero Virginia Clean Economy Act (VCEA), for awhile now. VCEA requires Dominion to shut down all gas, oil and", "url": "https://www.cfact.org/2023/03/28/breakthru-a-big-utility-says-net-zero-may-not-be-reliable/", "site_name": "CFACT", "article:publisher": "http://www.facebook.com/cfact", "article:published_time": "2023-03-28T13:12:43+00:00", "article:modified_time": "2023-03-28T19:36:48+00:00", "image": "https://www.cfact.org/wp-content/uploads/2023/03/Net-Zero-City-Blackout.jpg", "image:width": "2543", "image:height": "1649", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.dominionenergy.com/-/media/pdfs/global/company/2022-va-integrated-resource-plan.pdf?la=en&rev=4549a78d3a3a49fdb4850432fbdc9492", "http://www.cfact.org/wp-content/uploads/2022/02/VCEA-Reliability-Research-Report.pdf", "https://www.cfact.org/author/dwojick/"], "authors": ["David Wojick"], "publish_date": "2023-03-28T13:12:43+00:00"}