{"result_id": "077013", "URL": "https://www.cfact.org/2023/03/16/book-review-of-vaclav-smils-how-the-world-really-works/", "timestamp": "2023-04-25 14:47:20 CEST+0200", "meta": {"description": "The key chapter (4) in noted author and Renaissance Man Vaclav Smil’s newest book, How the World Really Works, is subtitled, “The four pillars of modern civilization.” To the uninitiated, this means cement, steel, plastics, and ammonia.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.cfact.org/2023/03/16/book-review-of-vaclav-smils-how-the-world-really-works/", "encoding": "utf-8"}, "image": null, "domain": "www.cfact.org", "title": "Book review of Vaclav Smil's \"How the World Really Works\"", "cleaned_text": "The key chapter (4) in noted author and Renaissance Man Vaclav Smil’s newest book, How the World Really Works, is subtitled, “The four pillars of modern civilization.” To the uninitiated, this means cement, steel, plastics, and ammonia.\n\nCement, the “indispensable component of concrete,” is thus the essential component of major dams, truck-bearing highways, and modern urban buildings (just for starters). But to turn cement (and other components) into concrete requires heating the mixture to at least 1,450° C. China alone uses about 2.2 billion tons of cement a year, just over half the world’s total.\n\nSteel, like concrete, is an essential element of modern construction. But steel does not melt until temperatures reach 1,425° C. Steel requires iron ore, and annual production of iron ore is about 2.5 billion tons. Steel is abundant; not only are there at least 300 years’ worth of iron ore, steel is readily recyclable. If you have a hot enough furnace.\n\nPlastics in general are created by “cracking” hydrocarbon feedstocks to produce ethylene and propylene – at temperatures of up to 950° C. Additional heat is needed to form plastics into any of the thousands of end uses. Global production of plastics in 2019 was about 370 million tons. Plastics, Smil reminds us, have become indispensable in modern health care.\n\nBut it is ammonia, Smil alerts us, that is the gas that feeds the world – and is thus the most important of all. Ammonia is simply one part nitrogen and three parts hydrogen. The typical ammonia plant first converts natural gas, liquefied petroleum gas, or petroleum naphtha into gaseous hydrogen, which is then joined with nitrogen using the Haber-Bosch process.\n\nAbout 80 percent of the current annual production of 150 megatons is used to fertilize crops. Smil says that half of the Earth’s 8 billion people would not be alive today without synthetic ammonia. In China, that number rises to 60 percent. Ammonia today accounts for 55 percent of nitrogen, an essential element for increasing crop yields.\n\nDifferent chapters address food production, globalization, and risks – all important – but this review will focus on the aforesaid Chapter 4 and Chapters 1, 6, and 7.\n\nIn Chapter 1 (Energy), Smil excoriates modern-day economists for ignoring the importance of harnessing energy for the operation of society. He states clearly that “our civilization is so deeply reliant on fossil fuels that the next transition will take much longer than most people think.” On land, he asserts, large nuclear reactors are the most reliable producers of electricity.\n\nSmil continues, stating that, “a poor understanding of energy has the proponents of a new green world naively calling for a near-instant shift” from fossil fuels to green, solar energy. They lack any comprehension of energy density, which is highest by far in liquid hydrocarbons. The idea of decarbonizing society also ignores the manifold petroleum byproducts – including asphalt and plastics — and made affordable by the production of gasoline, kerosene, and other fuels.\n\nSmil then warns that total reliance on intermittent wind and solar energy will require mass-scale, weeks-long electricity storage and/or extensive (low-loss) energy grids of high-voltage lines to transmit electricity across time zones from rural to urban areas.\n\nAlmost mockingly, Smil asks if renewables can actually supplant the energy now received from fossil fuels as well as the energy now supplied by liquid fuels to vehicles, ships, and airplanes – especially within the very short mandated timeframes?\n\nSmil then explains how the obvious advantages of electricity convince some to believe that, despite its many complications (including storage), high costs, and technical challenges, the electrification of all society is an irreversible trend.\n\nBut that can only happen (in a rational society) with a very, very high reliability of supply can be assured. To grid managers, that means only 32 seconds a year of interrupted supply as a goal. For some applications, even short outages can be disastrous. Any prolonged outages can be locally, regionally, or even nationally catastrophic.\n\nOne more statistic – annual global demand for fossil carbon is over 10 billion tons – nearly five times the annual harvest of all staple grains feeding humanity and more than twice the amount of water swallowed annually by the entire global population. This fact alone, Smil says, makes rapid substitution impossible. Moreover, he says, the market, not government, should dictate the speed of the transition.\n\nIn Chapter 6, Smil lists “climate change” (or global warming) as the first of nine critical biospheric boundaries that humanity must not transgress without threatening Earth’s habitability. The list also includes ocean acidification, stratospheric ozone depletion, atmospheric aerosols, interference with nitrogen and phosphorus cycles, freshwater use, land use, biodiversity loss, and chemical pollution.\n\nBut then Smil states as fact that, “The continued rise of greenhouse gas emissions will eventually lead to temperatures high enough to cause many negative environmental impacts, engendering considerable social and economic costs.” He says nothing here about offsetting benefits. He also ignores other factors that affect “global” temperatures – like orbits and solar activity.\n\nSmil notes that, while the supply of new renewables has risen 50-fold in the 21st century to date, the world’s dependence on fossil carbon has declined from 87 to just 85 percent of total supply. He admits that, over the next 20 to 30 years, the fundamental of human lives will not change dramatically despite mandates.\n\nYet, in a world threatened daily with war, disease, and maybe even our own creations, Smil declares that global climate change is the risk that must be tackled most urgently. Not feeding a billion Africans who lack many of the developed world’s amenities; not avoiding nuclear war. President Biden now says the same thing!\n\nThis after spending half the book explaining why we cannot take the “climate change” rhetoric demanding a near-immediate transition that seriously. Renewables have an enormous mountain to climb to supply the world with electricity and also manufacture cement, ammonia (fertilizer), plastics, steel, and other products requiring fossil fuels. As of now, renewables can hardly generate enough heat to make steel, cement, or even plastics and ammonia.\n\nDoes Smil make these statements hoping to win endorsement – and therefore maybe at least a quick read-through – by those now demanding total elimination of fossil fuel energy “by 2050” or even sooner? Or does he feel guilty after proving that this transition cannot happen that fast?\n\nDouble-minded? Or just throwing the climate crowd a bone?\n\nLet’s give Smil the benefit of the doubt. Even though its kinda like he laid out the prosecution’s airtight case and then announced that putting the defendant on trial would not serve the public interest.", "opengraph": {"locale": "en_US", "type": "article", "title": "Book review of Vaclav Smil's \"How the World Really Works\"", "description": "The key chapter (4) in noted author and Renaissance Man Vaclav Smil’s newest book, How the World Really Works, is subtitled, “The four pillars of modern civilization.” To the uninitiated, this means cement, steel,", "url": "https://www.cfact.org/2023/03/16/book-review-of-vaclav-smils-how-the-world-really-works/", "site_name": "CFACT", "article:publisher": "http://www.facebook.com/cfact", "article:published_time": "2023-03-16T07:16:06+00:00", "article:modified_time": "2023-03-16T15:16:50+00:00", "image": "https://www.cfact.org/wp-content/uploads/2023/03/vaclav-smil-how-the-world-really-works-1.jpg", "image:width": "1690", "image:height": "1406", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.cfact.org/author/duggan/"], "authors": ["Duggan Flanakin"], "publish_date": "2023-03-16T07:16:06+00:00"}