{"result_id": "077031", "URL": "https://www.cfact.org/2020/02/18/free-market-develops-coronavirus-vaccine-in-3-hours/", "timestamp": "2023-04-25 14:47:39 CEST+0200", "meta": {"description": "A biotech company called Inovio Pharmaceuticals has developed a vaccine for the deadly coronavirus just three hours after gaining access to the genetic sequence.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.cfact.org/2020/02/18/free-market-develops-coronavirus-vaccine-in-3-hours/", "encoding": "utf-8"}, "image": null, "domain": "www.cfact.org", "title": "Free market develops coronavirus vaccine in 3 hours", "cleaned_text": "A biotech company called Inovio Pharmaceuticals has developed a vaccine for the deadly coronavirus just three hours after gaining access to the genetic sequence.\n\nThe coronavirus has caused widespread death and illness in China, as a total of 1,367 people have died, and over 59,000 people have been diagnosed with the disease. These numbers continue to climb every single day.\n\nChina, which touts its ability to centrally plan its economy via the ruling Communist Party (albeit allowing for various phases of capitalism in certain areas), has been scrambling to construct new hospitals and to mount a sufficient response to the virus since its outbreak about a month ago.\n\nIn contrast, technological innovation through the free market has provided a vaccine to the virus in a matter of hours. Inovio Pharmaceuticals is now working to mass produce the vaccine and get it to the marketplace as soon as possible.\n\nAccording to Fox Business: “Inovio’s vaccine for COVID-19, as health officials have named the virus, could be ready as early as this summer.”\n\nDr. Trevor Smith, research and development director for Inovio, said to KVUE: “We have an algorithm which we designed, and we put the DNA sequence into our algorithm and came up with the vaccine in that short amount of time.”\n\nThe American company is partnering with Beijing Advaccine, a Chinese company, to work on the vaccine.\n\n“Inovio’s participation in this developing effort is based on the ideal suitability of its DNA medicine platform to rapidly develop vaccines against emerging viruses with pandemic potential, proven vaccine development capabilities, and a strong track record of rapidly generating promising countermeasures against previous pandemic threats,” the company said in a statement on Jan. 30. “Inovio was the first to advance its vaccine (INO-4700) against MERS-CoV, a related coronavirus, into evaluation in humans.”\n\nAnother U.S. company, Maryland-based Novavax, is aiming to make a coronavirus vaccine in as little as three months, although such vaccines can take years to develop. The company made an Ebola vaccine in 90 days.", "opengraph": {"locale": "en_US", "type": "article", "title": "Free market develops coronavirus vaccine in 3 hours", "description": "A biotech company called Inovio Pharmaceuticals has developed a vaccine for the deadly coronavirus just three hours after gaining access to the genetic sequence.\r\n\r\nThe coronavirus has caused widespread death and illness in China, as a total of 1,367 people have died, and over 59,000 people have been diagnosed with the disease. These numbers", "url": "https://www.cfact.org/2020/02/18/free-market-develops-coronavirus-vaccine-in-3-hours/", "site_name": "CFACT", "article:publisher": "http://www.facebook.com/cfact", "article:published_time": "2020-02-18T16:17:42+00:00", "article:modified_time": "2020-02-21T03:09:48+00:00", "image": "https://www.cfact.org/wp-content/uploads/2020/02/coronavirus-hope-first-sign-of-a-slow-down.jpg", "image:width": "804", "image:height": "595", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.foxbusiness.com/lifestyle/china-reports-254-new-virus-deaths-and-15152-daily-cases", "https://www.foxbusiness.com/technology/california-lab-coronavirus-vaccine-3-hours?fbclid=IwAR1ECQaQRP6z9JzU8UO_QgC5IZAXbzIFXGBVMOZXt7208Body6lwX_1MdCg", "https://www.kvue.com/article/news/health/coronavirus/coronavirus-vaccine-san-diego/509-e18e37f6-347c-4b08-ad33-910968abb04f", "https://www.foxbusiness.com/technology/california-lab-coronavirus-vaccine-3-hours?fbclid=IwAR1ECQaQRP6z9JzU8UO_QgC5IZAXbzIFXGBVMOZXt7208Body6lwX_1MdCg", "https://www.foxbusiness.com/technology/coronavirus-vaccine-novavax-nvax-maryland", "https://www.cfact.org/author/cfact-ed/", "https://www.cfact.org/author/cfact/"], "authors": ["CFACT Ed, CFACT"], "publish_date": "2020-02-18T16:17:42+00:00"}