{"result_id": "077036", "URL": "https://www.cfact.org/2023/02/26/a-simple-proposal-to-isolate-the-impact-of-co2/?utm_source=rss&utm_medium=rss&utm_campaign=a-simple-proposal-to-isolate-the-impact-of-co2&utm_source=rss&utm_medium=rss&utm_campaign=a-simple-proposal-to-isolate-the-impact-of-co2", "timestamp": "2023-04-25 14:47:44 CEST+0200", "meta": {"description": "What drives sea surface temperature?", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.cfact.org/2023/02/26/a-simple-proposal-to-isolate-the-impact-of-co2/", "encoding": "utf-8"}, "image": null, "domain": "www.cfact.org", "title": "A simple proposal to isolate the impact of CO2", "cleaned_text": "Sea surface temperature (SST) did not increase appreciably from 1951 to 1990.\n\nWith a marked increase in SST as underwater seismic activity increased\n\nThere is a way to approximate how much, if any, CO2 has contributed to the warming:\n\n1) Quantify the change in atmospheric water vapor over the last 40 years\n\n2) Correlate that to the change in temperatures based on the increase of grams/kg of WV(water vapor) in the atmosphere.\n\nThis is why I am so gung-ho on water vapor (WV). THE MAJOR INCREASE SHOWS UP IN THE COLDEST DRIEST AREAS. If we can approximate the increase of WV (we should have been tracking this religiously as it explains temperatures. Temperatures are a poor climate metric Wet bulb temperatures are much better and saturation mixing ratios are best) it will be able to explain much of the warming. What is left over is co2\n\nWe have no correlation between co2 and temperature. We have water vapor and temperature ( saturation mixing ratio). We have been tracking the increase in CO2. It seems that makes little sense if you are not tracking the increase in WV since we can correlate it to temperature changes at different temperatures. We can not do that with CO2. This leaves us with people pushing an agenda and not even showing the major elephant in the room.\n\nIt comes down to this, How much WV is in the air now compared to 40 years ago? Once you approximate that, you then look at changes in temperature relative to that. Since for instance .1gram/kg is correlated with a 10-degree rise at -40F, but it takes 90x more at 85 degrees, with the increase in water vapor having to be greater to affect temperatures the higher the temperature goes, one can figure out what the average increase grams/kg is across the planet and then apply it to the temperature. You can’t do that for CO2. No weather is driven by CO2. The next logical step is to ask where the source of the WV is. It’s the ocean. Why are the oceans warming? The answer that it is because of CO2 makes no sense given we don’t even have a temperature correlation to it. Its assumed and force-fed down people’s throat without even adding in another natural cause, and one that I suspect is purposely ignored or dismissed because of what it may reveal.\n\nWhy should you not be skeptical of CO2 induced warming when 1) there is no attempt to quantify and correlate the increase in the most important GHG, water vapor, 2) There is no attempt to explain the oceanic warming, other than blaming it somehow on the very CO2 that takes a back seat to WV in the first place.\n\nFigure out the rise due to the ocean warming. There is no way that if the oceans were as cold as 40 years ago we would have had the warming we have had. I suspect whatever is leftover can arguably be attributed to man, but would be so small it would blow the whole man-made climate change agenda out of the water.\n\nWhich is what these underwater volcanoes (if we research them) may do in the first place.", "opengraph": {"locale": "en_US", "type": "article", "title": "A simple proposal to isolate the impact of CO2", "description": "Sea surface temperature (SST) did not increase appreciably from 1951 to 1990.\r\n\r\n1951-1950 SST:\r\n\r\n\r\n\r\n1981 to 1990:", "url": "https://www.cfact.org/2023/02/26/a-simple-proposal-to-isolate-the-impact-of-co2/", "site_name": "CFACT", "article:publisher": "http://www.facebook.com/cfact", "article:published_time": "2023-02-26T15:54:38+00:00", "article:modified_time": "2023-02-27T21:02:30+00:00", "image": "https://www.cfact.org/wp-content/uploads/2022/11/Underwater-Volcano.jpg", "image:width": "848", "image:height": "565", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": ["Joe Bastardi"], "publish_date": "2023-02-26T15:54:38+00:00"}