{"result_id": "077026", "URL": "https://www.cfact.org/2023/02/18/run-ins-with-wildlife-on-rise-how-should-governments-respond/", "timestamp": "2023-04-25 14:47:33 CEST+0200", "meta": {"description": "The facts on animal encounters.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.cfact.org/2023/02/18/run-ins-with-wildlife-on-rise-how-should-governments-respond/", "encoding": "utf-8"}, "image": null, "domain": "www.cfact.org", "title": "Run-ins with wildlife on rise: How should governments respond?", "cleaned_text": "Wildlife has been making the news frequently. A black bear attacked a 10-year-old in Connecticut, other black bears attacked a dog in Pennsylvania, killed a dog in New Jersey, burst through a window in Wisconsin, attacked a man in North Carolina, and attacked a woman in Vermont.\n\nThere was even a black bear wandering the Virginia suburbs of Washington, D.C. The stories provoked comments on social media, often with sentiments such as, “So sad that our community/urban expansion and society have driven wildlife to the point of ‘city’ living,” or, “Their homes are being destroyed, [so] they gotta go somewhere.”\n\nThe good news is, while perhaps well-intentioned, many of those comments are simply misinformed.\n\nBlack bears, like many other U.S. species, are doing very well. An October press release from the Massachusetts Department of Fish and Game advised: “As the bear range expands eastward, many communities will begin seeing bears for the first time, and residents will need to learn important strategies to coexist with bears.”\n\nThe bears are expanding their range in Massachusetts because there are many more bears than 50, 100, or even 200 years ago. Black bears were rare in Massachusetts by some point in the 1800s until the early part of the 20th century. Better management and available habitat have resulted in dramatic population growth with perhaps 50 times more bears in the state today than just 50 years ago.\n\nSimilar dramatic population increases occurred in all the states mentioned above. News stories regarding conflicts with bears outside of national parks, national forests, or national wildlife refuges were not a result of bears fleeing rural areas because of habitat destruction. The cause is a dramatically growing bear population, resulting in bears wandering into suburban or even urban environments, where they have not been residents for a century or more.\n\nAlmost as though it’s obligatory, press accounts quote wildlife officials stating that “attacks are rare.” In some sense, that’s warranted, given the inherently sensational nature of animal attacks.\n\nFor perspective, the Centers for Disease Control and Prevention reports that ticks cause tens of thousands of cases of Lyme disease annually, mosquitos vectoring West Nile virus caused 66 deaths in 2020, and there are about 100 deaths from stinging insects in the U.S. annually.\n\nDeer, through collisions with cars, are the wild vertebrate animal that causes the most human fatalities in the 48 contiguous states—just over 200 in 2020.\n\nHowever, while statistically true that attacks on people are comparatively rare, it’s also true that conflicts with black bears—killed or injured pets and serious human injuries—are almost certain to increase. That’s exactly why state wildlife officials issue such statements, and they know black bears are not the only burgeoning wildlife population that are coming into increasing conflict with people.\n\nThe number of coyotes have also dramatically increased. They have expanded their range by nearly 30 states in the past century and a half, and are too numerous to count. Conflicts are mounting with coyotes stalking or attacking children or adults (see here, here, and here), preying upon pets (see here, here, and here), and killing hundreds of thousands of calves and cattle (2015) and lambs and sheep (2019) combined.\n\nThere will be more conflicts with other increasing species, such as mountain lions, which have been dispersing eastward. California Fish and Game reports that out of 22 “verified” attacks in California over the past 36 years, six occurred after 2019 and all but one were upon children age 7 or younger.\n\nThere will be increasing conflicts with alligators that now number in the millions (and were never really were facing extinction) and the javalina, a gnarly relative of the pig. Javalinas have been expanding their range northward from the U.S.-Mexico border since the 1800s. Bobcats, red foxes, and reintroduced gray wolves have multiplied as well.\n\nWildlife authorities have been consistently advising the public against habituating many species by feeding them, something that is often illegal. They also advise eliminating food sources (pet food, unsecured trash, bird feeders, and barbecue grill drip pans) that attract potentially dangerous wildlife, installing 6-foot privacy fences, and always supervising one’s pet when outside, especially at dusk or dawn.\n\nColorado Parks and Wildlife’s “Living with Coyotes” webpage states that coyotes “now thrive in close proximity to people” and has a downloadable flyer to teach children how to react when faced by predators with a handy mnemonic device:\n\nWhile the advice should reduce conflicts or tragedies, it also serves the purpose of habituating people with the idea that they will now be, or are already, living around predators. A big question is, when will people’s willingness to tolerate conflicts be exceeded?\n\nIn a June article on predator management and conservation, the authors say, “Any return of large predators will require people to adjust and learn to live alongside predators, as predators learn to live alongside people … .”\n\nThey go on:\n\nNashville’s WSMV-TV reported that the Tennessee Wildlife Resource Agency said small children are at risk of a coyote attack and, at the same time, that it would not euthanize coyotes unless a human is attacked.\n\nSuch a policy is undoubtedly more acceptable to those who are not the first victim.\n\nThe constant reminders that an animal is probably more scared of us, that what might have seemed like an attack was really “defensive behavior” by the animal, or that a species does not typically attack humans unless it is sick, while often true, are as much for our habituation as education.\n\nThe constant refrain about attacks only coming from unhealthy animals was a monotonous and inaccurate claim of wolf reintroduction advocates. There are also attacks by an unhealthy (i.e., rabid) bobcat and gray fox. It seems unlikely that the animals being unhealthy, triggering rabies treatments, made the incidents any more acceptable to the victims.)\n\nThe environmental movement’s constant misleading mantra about disappearing wildlife and habitat has led many to erroneously believe that many species are on the brink of extinction when, in fact, they have growing populations that need to be controlled.\n\nThis misinformation causes anxiety and conflict, and will hinder the adoption of responsible management policies. Likewise, the animal rights’ anti-hunter movement hinders use of hunting as a means of controlling populations and as a possible means of discouraging habituation to people.\n\nRegardless of whether you like hunting or not, with managed hunting, states can generate conservation dollars from hunters and manage a wildlife population rather than expend limited resources to do the same thing.\n\nHow these conflicts will play out will depend in part on how people interpret the role of humans in and relationship to nature. Fortunately, because the claims that these species and their habitats are rapidly vanishing are false, this isn’t an existential conservation dilemma.\n\nEven if it were, when decisions have to be made, the “ecocentric” view that rejects individual humans and human species as more valuable than animals should itself be rejected. A conservation policy that is bad for humans is just a bad policy.\n\nOne thing is for sure: Rural Westerners who are living through wolf reintroduction and the labyrinth of wolf-management policies forced upon them by people who have not had to “adjust and learn to live alongside” that predator will likely be watching with interest.\n\nThis article originally appeared in The Daily Signal", "opengraph": {"locale": "en_US", "type": "article", "title": "Run-ins with wildlife on rise: How should governments respond?", "description": "Wildlife has been making the news frequently. A black bear attacked a 10-year-old in Connecticut, other black bears attacked a dog in Pennsylvania, killed a dog in New Jersey, burst through a window in Wisconsin, attacked a man in North Carolina, and attacked a woman in Vermont.\r\n\r\nThere was even", "url": "https://www.cfact.org/2023/02/18/run-ins-with-wildlife-on-rise-how-should-governments-respond/", "site_name": "CFACT", "article:publisher": "http://www.facebook.com/cfact", "article:published_time": "2023-02-18T10:00:44+00:00", "article:modified_time": "2023-02-17T04:07:26+00:00", "image": "https://www.cfact.org/wp-content/uploads/2020/07/court-rejects-effort-to-block-ranchers-killing-grizzly-bears.jpg", "image:width": "848", "image:height": "565", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.ctpublic.org/news/2022-10-16/black-bear-euthanized-after-attacking-child-connecticut-environmental-officials-say", "https://www.njherald.com/story/news/2022/08/15/nj-dog-attacked-by-bear-expected-to-recover/65400508007/", "https://www.usnews.com/news/best-states/new-jersey/articles/2022-05-14/bear-sought-after-attack-on-nj-woman-heading-to-check-mail#:~:text=The%20New%20Jersey%20Department%20of,to%20scare%20the%20animals%20off.", "https://www.weau.com/2022/05/21/bear-breaks-through-window-taylor-county-attacks-husband-wife/", "https://www.wect.com/2022/06/25/black-bear-attack-man-says-dog-saved-his-life/", "https://vtdigger.org/2022/08/23/after-rare-bear-attack-strafford-woman-treated-for-injuries/", "https://www.fox5dc.com/news/northern-virginia-black-bear-on-the-loose-dont-approach-it", "https://www.mass.gov/news/state-environmental-officials-remind-public-of-black-bear-presence-and-provide-tips-to-avoid-conflicts", "https://www.cdc.gov/lyme/datasurveillance/index.html?CDC_AA_refVal=https%3A%2F%2Fwww.cdc.gov%2Flyme%2Fstats%2Findex.html", "https://www.cdc.gov/westnile/resources/pdfs/data/WNV-Disease-Cases-PVDs-by-State-2020-P.pdf", "https://www.cdc.gov/niosh/topics/insects/", "https://www.iihs.org/topics/fatality-statistics/detail/collisions-with-fixed-objects-and-animals#collisions-with-animals", "https://www.youtube.com/watch?v=Mr_hBXcSLpw", "https://www.youtube.com/watch?v=GLLMIRZ8j9o", "https://www.youtube.com/watch?v=7M6UfCqpDT8", "https://www.boston.com/news/local-news/2022/08/25/coyotes-killing-dogs-massachusetts", "https://www.newsweek.com/massachusetts-owners-pets-attack-dogs-police-1740277", "https://abc13.com/cat-vs-coyote-wild-animal-attack-surfside-beach-texas-caught-on-video/11943156/", "https://www.aphis.usda.gov/animal_health/nahms/general/downloads/cattle_calves_deathloss_2015.pdf", "https://www.aphis.usda.gov/aphis/dashboards/tableau/sheep-death-dashboard", "https://wildlife.ca.gov/Conservation/Mammals/Mountain-Lion/Attacks", "https://www.myhorrynews.com/news/local/horry_county/south-carolina-alligator-attacks-are-increasing/article_33c3c468-0385-11ed-8cbc-af4508d4e818.html", "https://www.heritage.org/environment/report/lands-and-habitat-the-united-states-reality-check", "https://www.tucsonlocalmedia.com/news/oro_valley/article_e96d49ec-4963-11ec-8b52-3b50a12fcde6.html", "https://scholarsarchive.byu.edu/cgi/viewcontent.cgi?article=2203&context=wnan", "https://cpw.state.co.us/Documents/WildlifeSpecies/LivingWithWildlife/SMART-Animals.pdf", "https://www.frontiersin.org/articles/10.3389/fcosc.2022.881483/full", "https://www.wsmv.com/2022/08/10/residents-share-concerns-over-recent-coyote-attacks/", "https://www.newsweek.com/javelina-attacks-dog-arizona-weeks-after-bit-woman-1669393", "https://www.nbc4i.com/news/women-injured-when-bobcat-attacks-while-they-ate-lunch/", "https://www.semanticscholar.org/paper/Wolf-human-interactions-in-Alaska-and-Canada%3A-a-of-Mcnay/10d954741e33e145ff6927f0c7c5be3b35d069d1", "https://www.wsav.com/video/nc-man-throws-rabid-bobcat-after-it-attacks-wife/6547630/", "https://www.silive.com/news/2022/08/watch-rabid-fox-attacks-woman-in-upstate-new-york.html", "https://www.dailysignal.com/2023/02/15/run-ins-with-wildlife-on-rise-but-no-reason-for-governments-to-overreact/", "https://www.cfact.org/author/rob-gordon/"], "authors": ["Rob Gordon"], "publish_date": "2023-02-18T10:00:44+00:00"}