{"result_id": "077016", "URL": "https://www.cfact.org/2021/06/04/russia-bets-big-on-coal-gas-fossil-fuels-and-not-on-renewables/", "timestamp": "2023-04-25 14:47:23 CEST+0200", "meta": {"description": "The West is switching to trendy unreliable energy while Russia is ramping up coal and gas production.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.cfact.org/2021/06/04/russia-bets-big-on-coal-gas-fossil-fuels-and-not-on-renewables/", "encoding": "utf-8"}, "image": null, "domain": "www.cfact.org", "title": "Russia bets big on coal, gas, fossil fuels, and not on renewables", "cleaned_text": "Russia is building a ten billion dollar railroad to sell coal to Asia, but Australia is building a ten billion dollar hydro bandaid “battery” just to make unreliable energy slightly less useless.\n\nRussia is being left behind on renewables, and they’re probably delighted. The more the West cripples itself in a quest to make sparkly green-electrons that stop the storms, the richer the Russians will get.\n\nWith the second largest coal reserves in the world, they’re well positioned to meet the growing demand from India and China. Indeed, if Russia could just think of a way to stop the USA and Australia from producing coal, they could corner the market.\n\nIf Russian Intel isn’t paying climate activists and child-complainers a retainer, they must have rocks for brains. But since they are apparently paying French and German bloggers to discredit the Pfizer vaccine perhaps they already are some of the great minds behind Greenpeace?\n\nAnd if they were funding climate disinformation campaigns, which media outlet would tell us?\n\nGive me one reason Russia wouldn’t want the west to believe in “Climate change”:\n\nHow to beat the West? Putin is betting that Asia will rely on cheap Russian coal for decades to come\n\nPresident Vladimir Putin’s government is spending more than $10 billion on railroad upgrades that will help boost exports of the commodity. Authorities will use prisoners to help speed the work, reviving a reviled Soviet-era tradition.\n\nThe project to modernize and expand railroads that run to Russia’s Far Eastern ports is part of a broader push to make the nation among the last standing in fossil fuel exports as other countries switch to greener alternatives. The government is betting that coal consumption will continue to rise in big Asian markets like China even as it dries up elsewhere.\n\nThe latest 720 billion ruble ($9.8 billion) project to expand Russia’s two longest railroads — the Tsarist-era Trans-Siberian and Soviet Baikal-Amur Mainline that link western Russia with the Pacific Ocean— will aim to boost cargo capacity for coal and other goods to 182 million tons a year by 2024. Capacity already more than doubled to 144 million tons under a 520 billion ruble modernization plan that began in 2013. Putin urged faster progress on the next leg at a meeting with coal miners in March.\n\n“Russia is trying to monetize its coal reserves fast enough that coal will contribute to GDP rather than being stuck in the ground,” said Madina Khrustaleva, an analyst who specializes in the region for TS Lombard in London.\n\nRussia is making more coal than ever. Soon it will overtake Australia.\n\nLook at how fast the Russian gas share of the global market is increasing:\n\nRussia’s Getting Left Behind in Global Dash for Clean Energy\n\nIn recent years, the Kremlin has bet the country’s economic and geopolitical future on natural gas, building new pipelines to China, Turkey and Germany, while aiming to take a quarter of the global LNG market, up from zero in 2008 and around 8% today.\n\nRussia, China and India know coal is the future. That’s nearly 120 people for every single Australian that won’t cutting back coal use.", "opengraph": {"locale": "en_US", "type": "article", "title": "Russia bets big on coal, gas, fossil fuels, and not on renewables", "description": "Russia is building a ten billion dollar railroad to sell coal to Asia, but Australia is building a ten billion dollar hydro bandaid “battery” just to make unreliable energy slightly less useless.\r\n\r\nRussia is being left behind on renewables, and they’re probably delighted. The more the West cripples itself in a quest to make sparkly green-electrons", "url": "https://www.cfact.org/2021/06/04/russia-bets-big-on-coal-gas-fossil-fuels-and-not-on-renewables/", "site_name": "CFACT", "article:publisher": "http://www.facebook.com/cfact", "article:published_time": "2021-06-04T18:00:41+00:00", "article:modified_time": "2021-06-03T20:41:34+00:00", "image": "https://www.cfact.org/wp-content/uploads/2020/04/russia-salivating-to-become-worlds-biggest-oil-producer.jpg", "image:width": "831", "image:height": "577", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://intelnews.org/2021/05/27/01-3011/", "https://joannenova.com.au/wp-content/coal-reserves-2021a.jpg", "https://www.thegwpf.com/putin-is-betting-that-asia-will-rely-on-cheap-russian-coal-for-decades-to-come/", "https://www.bloomberg.com/news/articles/2021-03-15/russia-s-getting-left-behind-in-global-dash-for-clean-energy?sref=9FMcma5m", "https://en.wikipedia.org/wiki/Baikal%E2%80%93Amur_Mainline", "https://joannenova.com.au/wp-content/russian.coal-productiona..jpg", "https://www.bloomberg.com/news/articles/2021-03-15/russia-s-getting-left-behind-in-global-dash-for-clean-energy?sref=9FMcma5m", "https://joannenova.com.au/", "https://www.cfact.org/author/cap-joanne-nova/"], "authors": ["Joanne Nova"], "publish_date": "2021-06-04T18:00:41+00:00"}