{"result_id": "078003", "URL": "https://consciouslifenews.com/feds-chosen-coronavirus-vaccine-producer-has-billions-in-court-penalties-no-vax-development-experience/11184633/", "timestamp": "2023-04-25 14:47:53 CEST+0200", "meta": {"description": "The company selected by the federal government to fast-track develop a coronavirus vaccine has no track record in creating or manufacturing vaccines.", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/favicon.ico", "canonical": "https://consciouslifenews.com/feds-chosen-coronavirus-vaccine-producer-has-billions-in-court-penalties-no-vax-development-experience/11184633/", "encoding": "UTF-8"}, "image": null, "domain": "consciouslifenews.com", "title": "Fed’s Chosen Coronavirus Vaccine Producer has Billions in Court Penalties, no Vax Development Experience", "cleaned_text": "The company selected by the federal government to fast-track develop a coronavirus vaccine is the subject of billions in court settlements and judgments, in the last year alone, for being a key operator in the opioid epidemic among other criminal activities, and it has no track record in creating or manufacturing vaccines. And the federal agency that issued the contract is part of the same federal department that will oversee every aspect of the vaccine’s evaluation, licensing, and distribution.\n\nJohnson and Johnson (J&J), and it subsidiary Janssen Pharmaceutica, the enormous global medical products firm, was awarded a $450 million contract on Monday by the US federal government. [see: https://www.forbes.com/sites/thomasbrewster/2020/03/30/the-us-just-signed-a-450-million-coronavirus-vaccine-contract-with-johnson–johnson/#43e6c87c2946 ]\n\nJ&J will be committing its own resources to bring the total value of the project to more than $1 billion. Trials of the vaccine are expected to begin in September and production for general use is expected to begin in early 2021. Normally testing and safety analysis of a new vaccine in the US takes 5 to 7 years. J&J will build a new vaccine factory in the US with a goal of producing a billion doses annually beginning next year. Yet no vaccine licensed for use in the US was developed or is manufactured by J&J. And the federal government is already assuming that the vaccine will be safe and effective.\n\nExpedited development of vaccines in the US has a poor track record. In 1976 a vaccine was quickly brought to market for an outbreak of swine flu but just as quickly withdrawn when multiple cases of Guillain Barre Syndrome were caused. And the H1N1 virus rushed to market in 2009 also caused significant numbers of Guillain Barre Syndrome among other side effects.\n\nIt is hard to imagine any company could be facing more lawsuits than J&J. According to the Wall Street journal J&J had 103,000 legal claims by companies, individuals, states, cities, counties and other legal entities in the middle of last year. [see https://www.wsj.com/articles/johnson-johnsons-legal-challenges-mount-11571055242 ] J&J have had legal judgments and settlements of more than $10 billion just in the previous two years.\n\nLast fall an Oklahoma Court fined J&J $465 million for its role in the opioid epidemic in that state. Judge Thad Balkman said J&J had promulgated “false, misleading, and dangerous marketing campaigns” that had “caused exponentially increasing rates of addiction, overdose, deaths” and babies born exposed to opioids. J&J also agreed to a $20 million settlement for damages associated with opioids in two Ohio counties. Thousands of other suits are pending across the US.\n\nJ&J was a major player contracting with poppy growers in Australia to supply 60% of the opiate ingredients used for drugs like oxycodone. It also produced an opioid pill the company sold in 2015, and Duragesic, a fentanyl patch.\n\nIn a statement released with the announcement of a lawsuit in the spring of 2019 against J&J and other opioid manufacturers, New York Attorney General Leticia James said, “We found that pharmaceutical manufacturers and distributors engaged in years of deceptive marketing about the risks of opioids and failed to exercise their basic duty to report suspicious behavior, leading to the crisis we are living with today.”\n\nJ&J’s legal problems go far beyond opioids. Last month a New Jersey court ordered J&J to pay $186 million in four cases where plaintiffs claimed using J&J talcum powder that contained asbestos caused ovarian cancer. Lawyers for the plaintiffs established that J&J knew the powder contained asbestos but denied that fact publicly. The judgment follows multiple other settlements and awards to plaintiffs including a $4.7 billion judgment by Missouri court in 2018.\n\nRobert O’Leary, JD BARA, has had an abiding interest in alternative health products & modalities since the early 1970’s & he has seen how they have made people go from lacking health to vibrant health. He became an attorney, singer-songwriter, martial artist & father along the way and brings that experience to his practice as a BioAcoustic Soundhealth Practitioner, under the tutelage of the award-winning founder of BioAcoustic Biology, Sharry Edwards, whose Institute of BioAcoustic Biology has now been serving clients for 30 years with a non-invasive & safe integrative modality that supports the body’s ability to self-heal using the power of the human voice. Robert brings this modality to serve clients in Greater Springfield, Massachusetts and New England (USA) & “virtually” the world. He can also be reached at romayasoundhealthandbeauty@gmail.", "opengraph": {"locale": "en_US", "type": "article", "title": "Fed’s Chosen Coronavirus Vaccine Producer has Billions in Court Penalties, no Vax Development Experience", "description": "The company selected by the federal government to fast-track develop a coronavirus vaccine has no track record in creating or manufacturing vaccines.", "url": "http://consciouslifenews.com/feds-chosen-coronavirus-vaccine-producer-has-billions-in-court-penalties-no-vax-development-experience/11184633/", "site_name": "Conscious Life News", "article:tag": "opioid epidemic", "article:section": "Corruption", "article:published_time": "2020-04-12T06:00:47-07:00", "article:modified_time": "2020-04-11T18:03:21-07:00", "updated_time": "2020-04-11T18:03:21-07:00", "image": "https://consciouslifenews.com/wp-content/uploads/2019/03/johnson-johnson-kingpin-opioid-epidemic_resize-compressed.jpg", "image:secure_url": "https://consciouslifenews.com/wp-content/uploads/2019/03/johnson-johnson-kingpin-opioid-epidemic_resize-compressed.jpg"}, "tags": ["Janssen Pharmaceutica", "COVID-19", "Johnson & Johnson", "bill gates", "opioid epidemic", "COVID-19 Vaccine"], "tweets": [], "movies": [], "links": ["https://www.forbes.com/sites/thomasbrewster/2020/03/30/the-us-just-signed-a-450-million-coronavirus-vaccine-contract-with-johnson--johnson/#43e6c87c2946", "https://consciouslifenews.com/stop-ear-ringing", "https://www.wsj.com/articles/johnson-johnsons-legal-challenges-mount-11571055242", "https://consciouslifenews.com/hyperbolic-stretching", "https://sarasotavaccinationchoice.wordpress.com/2020/04/03/feds-chosen-coronavirus-vaccine-producer-has-billions-in-court-penalties-no-vax-development-experience/"], "authors": [], "publish_date": "2020-04-12T06:00:47-07:00"}