{"result_id": "078009", "URL": "https://consciouslifenews.com/mrna-vaccines-put-you-at-risk-for-acute-coronary-syndrome-dr-joseph-mercola/11209922/", "timestamp": "2023-04-25 14:48:00 CEST+0200", "meta": {"description": "researchers have found mRNA COVID shots dramatically increase biomarkers associated with thrombosis, cardiomyopathy and other vascular events", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/favicon.ico", "canonical": "https://consciouslifenews.com/?p=209922", "encoding": "UTF-8"}, "image": null, "domain": "consciouslifenews.com", "title": "mRNA Vaccines Put You at Risk for Acute Coronary Syndrome | Dr. Joseph Mercola", "cleaned_text": "A mystery that remains to be solved is why only certain people with antibodies to the spike protein (anti-spike antibodies) go on to develop symptoms of platelet activation and thrombocytopenia. One hypothesis is that only a subset of the anti-spike antibodies formed after vaccination can activate platelets and cause thrombocytopenia\n\nAnother paper details how the mRNA shot can cause thrombocytopenia (low platelet count) through a mechanism that involves the activation of platelets by antibodies against the spike protein (anti-spike antibodies)\n\nThose who got the injection for fear that COVID-19 might adversely affect their heart now face the grim reality that they’ve exchanged a potential risk for a more certain one\n\nPre- and post-injection PULS tests for 566 patients were compared. On average, their PULS scores went from an 11% five-year risk for the acute coronary syndrome to a more than double, 25%, five-year risk\n\nUsing the PULS cardiac test, researchers have found Pfizer and Moderna mRNA COVID shots dramatically increase biomarkers associated with thrombosis, cardiomyopathy, and other vascular events following vaccination\n\nThe abstract he’s talking about is “mRNA COVID Vaccines Dramatically Increase Endothelial Inflammatory Markers and ACS Risk as Measured by the PULS Cardiac Test: A Warning,” published in the November 16, 2021, issue of the journal Circulation.2 (ACS is Acute Coronary Syndrome).\n\nThe PULS (Protein Unstable Lesion Signature) cardiac test3 is a simple blood test that detects unstable cardiac lesion rupture, one of the leading causes of heart attacks. As noted by the authors of that paper, this is “a clinically validated measurement of multiple protein biomarkers,” which include:\n• Hepatocyte growth factor (HGF), a marker for chemotaxis of T-cells into the epithelium and cardiac tissue\n\nThese and several other proteins are indicative of your immune system’s response to arterial injuries that can result in cardiac lesions. These lesions can become unstable, and if they rupture, they can lead to a heart attack.\n\nSo, based on the levels of these biomarkers, the test gives you a score that predicts your 5-year risk, as a percentage chance, of developing acute coronary syndrome (ACS). Elevated levels raise your PULS score while levels below the norm lower it.\n\nCOVID-Jabbed Patients More Than Double Their ACS Risk\n\nAccording to the authors of the Circulation report:4\n\nAs noted by Malhotra, this is indeed extraordinarily disturbing. Patients who received a two-dose regimen of mRNA more than doubled their five-year ACS risk, driving it from an average of 11% to 25%. Just imagine the shape our medical system and society at large will be in if 1 of every 4 people who got the two-dose regimen ends up with acute heart failure.\n\nSigns and Symptoms to Watch For\n\nACS is an umbrella term that doesn’t just include heart attacks, but also a range of other conditions involving abruptly reduced blood flow to your heart. Signs and symptoms of ACS typically begin very suddenly, and include:5\n\nIf you suspect ACS, do not drive yourself to the hospital. Call for an ambulance, as it is a true medical emergency that may need prompt medical attention. Risk factors for ACS have historically included older age, high blood pressure, cigarette smoking, lack of exercise, unhealthy diet, excess body weight, and diabetes.\n\nSARS-CoV-2 infection was recently added to that list, but it seems we must also add the COVID jab as well. Those who got the injection for fear that COVID-19 might adversely affect their heart now face the grim reality that they’ve exchanged a potential risk for a more certain one.\n\nIn related news, a paper published in the journal Blood Advances reviews “SARS-CoV-2 Spike-Dependent Platelet Activation in COVID-19 Vaccine-Induced Thrombocytopenia.”6 Thrombocytopenia is the medical term for low platelet count.\n\nThe authors point out that following the rollout of the mRNA and DNA-based COVID shots, more than 150 cases of thrombocytopenia have been reported. The reference for that statistic is a March 9, 2021, paper in the American Journal of Hematology,7 and injuries are stacking up at breakneck speed.\n\nAs of November 12, 2021, there were 4,387 cases of thrombocytopenia reported to the U.S. Vaccine Adverse Events Reporting System (VAERS),8 so it’s far more frequent than what they’re stating. (There are also 9,332 reports of heart attacks, which we just discussed, and 13,237 reports of myopericarditis, i.e., inflammation of the heart and/or heart sack.9)\n\nAccording to the authors, identifying the mechanism by which the shots cause thrombocytopenia would facilitate the development of a diagnostic test. Historically, heparin-induced thrombocytopenia has been diagnosed using a serotonin release assay (SRA).\n\nUsing SRA, a subset of critically ill COVID-19 patients have tested positive for platelet-activating immune complexes that can cause thrombosis. Other researchers have also shown IgG antibodies from critically ill COVID-19 patients can activate platelets, resulting in a thrombotic event.\n\nHere, using a modified SRA, they discovered spike-dependent, platelet-activating immune complexes in a patient with vaccine-induced thrombocytopenia, suggesting the spike protein is the causative factor. They explain:10\n\nIf you found the section quoted above to be too complex, here’s the take-home message: The mRNA shot may be causing an exceptionally low level of platelets through a mechanism that involves antibodies against the spike protein (anti-spike antibodies) resulting in depletion of platelets by activating them.\n\nPlatelets are specialized cells that stop bleeding, and they have ACE2 receptors, which is what the SARS-CoV-2 spike protein binds to. When the spike protein binds to the ACE2 receptor on the platelets, it activates them.\n\nThis platelet activation can lead to disseminated intravascular coagulation, i.e., a pathological overstimulation of your coagulation system that can result in abnormal, and life-threatening, blood clotting, as well as thrombocytopenia (low platelet count) and hemorrhaging.\n\nDoctors for COVID Ethics described this mechanism in February 28, 2021, letter11 to the European Medicines Agency (EMA). In that letter, they warned that, based on this mechanism, spike protein-based COVID shots are likely to cause blood clots, cerebral vein thrombosis, and sudden death, which is precisely what we’ve been seeing ever since.\n\nIn essence, you basically end up with so many blood clots throughout your vascular system that your coagulation system is exhausted, hence the low platelet count. The low platelet count, in turn, is what allows for hemorrhaging (abnormal bleeding).\n\nA mystery that remains to be solved is why only certain people with antibodies to the spike protein (anti-spike antibodies) go on to develop symptoms of platelet activation and thrombocytopenia. Why not all of them? “One hypothesis is that platelet activation is dependent on unique spike protein epitopes, which are only recognized by a minority of identified antibodies,” the authors suggest.12 In closing, they state:\n\nSince well before the rollout of these COVID shots, scientists and doctors have sounded the alarm, pointing out a host of potential mechanisms by which they may cause harm. Now, nearly a year into it, many of our fears are turning out to have been warranted. They’re causing very serious cardiovascular damage, blood disorders, and reproductive dysfunction.\n\nWorst of all, our health authorities have abandoned the mandate to protect public health and are covering up the wreckage on behalf of the profit makers. On top of that, doctors and nurses who speak out about the collateral damage they’re seeing are being silenced and persecuted by medical boards and government officials alike.\n\nNow, we’re injecting these kill shots into children as young as 5. I see no way for this to end on a pleasant note. As a society, as the deaths and injuries, especially in children, continue to escalate, we’re going to face some excruciatingly difficult times.\n\nTo remind you of where this article started, people who have received two mRNA shots have more than doubled their five-year risk of acute coronary events, on average. If you’ve not yet taken the jab, I reckon you probably won’t at this point. But if you’ve already taken one or two, I strongly urge you to review the mechanisms of harm and evaluate whether it’s worth it to continue with a third.\n\nThe adverse changes caused by the shots persist for at least 2.5 months. That’s the low end. We still do not know what the upper time limit is. It could be a year or more, and the risks certainly do not diminish with subsequent additional doses. In the November 12, 2021, OpenVAERS report,13 they added a graph showing vaccination rates and VAERS reports by state.\n\nAs you can see, there’s a clear correlation between the rate of “fully vaccinated” in a given state and the number of COVID injuries reported from that state. (Indiana, for some reason, sticks out as a lone exception with a disproportionately high number of reports to the number of fully “vaccinated.”)\n\nThe gray zones are population; blue bars are the number of fully vaccinated; the red bars are the number of reported injuries. (All numbers have been divided by 1,000.) This is yet another piece of evidence that we have a serious problem on our hands.\n\nWhat Can You Do if You Have Jab Remorse?\n\nIf you now believe that getting the COVID jab was a mistake and wish to lessen your doubled risk of cardiac complications, there are a few basic strategies I would advise.\n\n1. Make certain you measure your blood vitamin D level and take enough vitamin D orally (typically about 8,000 units/day for most adults) to make sure your level is 60 to 80 ng/ml (150 to 2000 nmol/l). 2. Eliminate all vegetable (seed) oils in your diet, which involves eliminating nearly all processed foods and most meals in restaurants unless you convince the chef to only cook with butter. Avoid any sauces or salad dressings in restaurants as they are loaded with seed oils. Also avoid chicken and pork as they are very high in linoleic acid, the omega-6 fat that is far too high in nearly everyone and contributes to oxidative stress that causes heart disease. 3. Consider taking around 500 mg/day of NAC, as it helps prevent blood clots and is a precursor for your body to produce the important antioxidant glutathione. 4. Consider fibrinolytic enzymes that digest the fibrin that leads to blood clots, strokes, and pulmonary embolisms. The dose is typically two, twice a day, but must be taken on an empty stomach, either an hour before or two hours after a meal. Otherwise, the enzymes will digest your food and not the fibrin in the blood clot.", "opengraph": {"locale": "en_US", "type": "article", "title": "mRNA Vaccines Put You at Risk for Acute Coronary Syndrome | Dr. Joseph Mercola", "description": "researchers have found mRNA COVID shots dramatically increase biomarkers associated with thrombosis, cardiomyopathy and other vascular events", "url": "http://consciouslifenews.com/mrna-vaccines-put-you-at-risk-for-acute-coronary-syndrome-dr-joseph-mercola/11209922/", "site_name": "Conscious Life News", "article:author": "slykush2377", "article:tag": "Pfizer mRNA COVID shots", "article:section": "Hazards, Issues & Diseases", "article:published_time": "2021-12-01T03:00:47-08:00", "article:modified_time": "2021-11-30T13:28:30-08:00", "updated_time": "2021-11-30T13:28:30-08:00", "image": "https://consciouslifenews.com/wp-content/uploads/2021/12/acute-coronary-syndrome.jpg", "image:secure_url": "https://consciouslifenews.com/wp-content/uploads/2021/12/acute-coronary-syndrome.jpg"}, "tags": ["Pfizer mRNA COVID shots", "mRNA vaccines", "Moderna mRNA COVID shots", "mRNA vaccine dangers"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2021-12-01T03:00:47-08:00"}