{"result_id": "078056", "URL": "https://consciouslifenews.com/israelis-cry-out-to-the-world-to-stop-mandatory-covid-injections-as-lawsuit-is-filed-in-international-criminal-court-over-nuremberg-code-violation/11202992/?print=print", "timestamp": "2023-04-25 14:48:50 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://consciouslifenews.com/israelis-cry-out-to-the-world-to-stop-mandatory-covid-injections-as-lawsuit-is-filed-in-international-criminal-court-over-nuremberg-code-violation/11202992/?print=print", "encoding": null}, "image": null, "domain": "consciouslifenews.com", "title": "Israelis Cry Out to the World to Stop Mandatory COVID Injections as Lawsuit is Filed in International Criminal Court Over Nuremberg Code Violation - Conscious Life News", "cleaned_text": "Israelis Cry Out to the World to Stop Mandatory COVID Injections as Lawsuit is Filed in International Criminal Court Over Nuremberg Code Violation\n\nThe entire world is watching in horror as death rates have skyrocketed in Israel since the Israeli government brokered a secret deal with Pfizer to inject the entire population with their experimental COVID shots, which are now being mandated as a condition to participating in society.\n\nThe National File reported this past week that a group of Israeli doctors, lawyers, campaigners, and concerned citizens have hired the services of Tel Aviv-based firm A. Suchovolsky & Co. Law to file a criminal complaint in the International Criminal Court, stating that the mandatory vaccine laws are a violation of the Nuremberg Code.\n\nIsrael became one of the first nations in the world to mandate COVID-19 vaccines, and to introduce a COVID passport system that would only allow individuals to participate in society – including commerce – after they received the vaccine and were approved to join the system. Now, a group of Israeli Jews are suing the Netanyahu administration in international court, making the case that Israel is violating the Nuremberg Code by essentially making Israelis subject to a medical experiment using the controversial vaccines. The Anshe Ha-Emet (People of the Truth) fellowship — comprising Israeli doctors, lawyers, campaigners and concerned citizens — complained to the ICC prosecutor at the Hague, accusing the government of conducting a national “medical experiment” without first seeking “informed consent.” “When the heads of the Ministry of Health as well as the prime minister presented the vaccine in Israel and began the vaccination of Israeli residents, the vaccinated were not advised, that, in practice, they are taking part in a medical experiment and that their consent is required for this under the Nuremberg Code,” the Anshe Ha-Emet suit states. Tel Aviv-based firm A. Suchovolsky & Co. Law argues that Prime Minister Benjamin Netanyahu’s agreement with Pfizer and Netanyahu’s own admission make it clear that Israel’s warp-speed vaccination campaign “is indeed a medical experiment and that this was the essence of the agreement.” The complaint has now been accepted by the International Criminal Court (ICC), and will be considered. The Nuremberg Code was “written after Nazi doctors were put on trial for performing their medical experiments on concentration camp prisoners, stipulates that it is deeply unethical to force or coerce a person to take part in medical experiments,” according to a Jewish anthropologist. Those behind the lawsuit believe this is especially relevant after Pfizer CEO Albert Bourla called Israel the “world’s lab” due to its ready acceptance of the company’s COVID-19 vaccine. This comes after an Israeli group decried the country’s green passport system, which allows only those who have taken the COVID-19 vaccine or developed immunity from the virus to engage in commerce and leave their homes, as “demonic” and a “second Holocaust.”\n\nRead the full article at The National File.\n\nIn an interview that has now been viewed by over a half million people, Ilana Rachel Daniel has made an emotional outcry for help from Jerusalem, the capital of Israel.\n\n“Civil rights are put aside and people can only participate in society again after vaccination,” told Ilana to Flavio Pasquino in the BLCKBX studio via a live stream connection, who tracked down Ilana after an – even – more emotional audio clip on Telegram.\n\nIlana talks about the Green Pass, the Freedom Bracelet, the mRNA vaccine, and human rights violations.\n\nIlana Rachel is active in Jerusalem as a health advisor and information officer for a new political party (Rappeh) that is heavily opposed by the regime. Opening a bank account is not possible and members of the party are also thwarted in their daily lives.\n\nWatch her impassioned plea for help (this is still on YouTube – if it disappears let us know.)\n\nREAD THE REST OF THIS ARTICLE…", "opengraph": {}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "500", "height": "281", "embed_code": "<iframe title=\"OUTCRY TO THE WORLD, FROM ISRAEL!!! (NL+ENG subtitles)\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/WMsn0bj_P6o?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/WMsn0bj_P6o?feature=oembed"}], "links": ["https://healthimpactnews.com/2021/israelis-cry-out-to-the-world-to-stop-mandatory-covid-injections-as-lawsuit-is-filed-in-international-criminal-court-over-nuremberg-code-violation/", "https://nationalfile.com/israeli-jews-petition-international-criminal-court-say-israels-mandatory-covid-vaccines-violate-nuremberg-code/", "https://www.churchmilitant.com/news/article/israel-hauled-before-hague-for-vaccine-holocaust", "https://www.facebook.com/groups/2742266049327128/", "https://drive.google.com/file/d/1JjRt_OjBrHPjuegftFhvRmtdKwv9PFqo/view", "https://nationalfile.com/israeli-jews-petition-international-criminal-court-say-israels-mandatory-covid-vaccines-violate-nuremberg-code/", "https://www.youtube.com/watch?v=WMsn0bj_P6o", "https://healthimpactnews.com/2021/israelis-cry-out-to-the-world-to-stop-mandatory-covid-injections-as-lawsuit-is-filed-in-international-criminal-court-over-nuremberg-code-violation/"], "authors": [], "publish_date": null}