{"result_id": "078020", "URL": "https://consciouslifenews.com/what-bidens-vaccine-mandate-means-for-you-russell-brand-dr-mercola/11207894/", "timestamp": "2023-04-25 14:48:12 CEST+0200", "meta": {"description": "In a sweeping executive order,1 president Joe Biden mandated all U.S. companies with 100 or more employees to require COVID vaccination", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/favicon.ico", "canonical": "https://consciouslifenews.com/what-bidens-vaccine-mandate-means-for-you-russell-brand-dr-mercola/11207894/", "encoding": "UTF-8"}, "image": null, "domain": "consciouslifenews.com", "title": "What Biden's Vaccine Mandate Means for You | Russell Brand & Dr. Mercola", "cleaned_text": "September 9, 2021, in a sweeping executive order, president Joe Biden mandated all U.S. companies with 100 or more employees to require COVID vaccination or weekly testing or face federal fines of up to $14,000 per violation. Biden also ordered businesses to give time off to employees to receive the injections.\n\nBiden is also requiring all federal employees and federal contractors to get the shots. For unspecified reasons, postal workers and members of Congress and their staff are exempt from the vaccine mandate. Biden did not make any exceptions for persons who have already had COVID and recovered, and therefore have antibodies to the virus.\n\nHe also said he’d use his “power as president” against any governor unwilling to follow the order “to get them out of the way.” Biden may be biting off more than he can chew, however, because as of September 11, 2021, 28 states were already pushing back against federal vaccine mandates.\n\nThe many States Vow to Fight Back Unconstitutional Mandate\n\nThe backlash was swift. The Republican National Committee quickly announced they would sue the Biden administration for issuing an “unconstitutional mandate.” GOP Chairwoman Ronna McDaniel issued a statement:\n\nGeorgia Gov. Brian Kemp also issued a statement saying he intends to “pursue every legal option available” to halt Biden’s “blatantly unlawful overreach,” as did Arizona Gov. Doug Ducey, who in a tweet stated:\n\nIn Florida, Gov. Ron DeSantis countered Biden’s edict with one of his own. Any local government that makes COVID vaccination a requirement for employment will be fined $5,000 per violation. During September 13, 2021, press conference, DeSantis said:\n\nI was going to include DeSantis’ speech in this article, but it has since been deleted for “violating YouTube’s community guidelines.” Imagine that, that they would actually remove a legally elected governor’s opinion on this topic because it violates their authoritarian tyranny.\n\nBiden Is Clearly Out of Legal Bounds\n\nBiden’s executive order is unlikely to stand up in court, seeing how federal law prohibits the mandating of emergency use products, which by definition are experimental. As noted in a May 2021 report by The Defender:\n\nIf you’re like most, you’re probably thinking, “Well, Biden’s executive order came after the U.S. Food and Drug Administration gave full approval to the Pfizer/BioNTech COVID shot Comirnaty, so the vaccine is not under EUA.” You’d be partially right. But mostly wrong.\n\nThe Difference Between Pfizer’s BNT162b2 Shot and Comirnaty\n\nThe FDA did indeed give full approval to Comirnaty, but that product is not predicted to be available for over a year. The only Pfizer shot currently available, called BNT162b2, remains under EUA. We have the FDA to thank for this unusual and befuddling situation, but the key take-home is that while approval has been granted to Comirnaty, that product is not obtainable.\n\nThe FDA wants BNT162b2 to be viewed as interchangeable with Comirnaty, but from a legal standpoint, they clearly are not identical. BNT162b2, being under EUA, is indemnified against financial liability, whereas Comirnaty, once it becomes available, will not have that liability shield (unless Pfizer/BioNTech manage to get liability shielding for that product before its release).\n\nIn other words, if you’re injured by the BNT162b2, your only recourse is to apply for compensation from the Countermeasures Injury Compensation Act (CICP). Compensation from CICP is very limited and hard to get. In its 15-year history, it has paid out just 29 claims, fewer than 1 in 10. , ,\n\nYou only qualify if your injury requires hospitalization and results in significant disability and/or death, and even if you meet the eligibility criteria, it requires you to use up your private health insurance before it kicks in to pay the difference.\n\nThere’s no reimbursement for pain and suffering, only lost wages and unpaid medical bills. This means a retired person cannot qualify even if they die or end up in a wheelchair. Salary compensation is of limited duration and capped at $50,000 a year, and the CICP’s decision cannot be appealed.\n\nIf normal circumstances apply to Comirnaty, were you to be injured by that injection, you’d be able to sue for damages under the National Vaccine Injury Compensation Plan (VICP), so from a legal perspective, there’s a rather significant difference between these two products.\n\nLegal Notifications You Can Use\n\nIf your employer or school requires you to get a COVID shot, consider using the legal notifications provided by the Children’s Health Defense legal team. The notices inform employers and educational institutions that they are violating federal law.\n\nThree separate notices are available for download from the Children’s Health Defense Legal Resources page; one for mask mandates, one for PCR testing, and a third for vaccines. There, you can also find information on how to request a religious exemption for COVID-19 vaccine mandates in the workplace.\n\nIn a September 13, 2021, episode of Fox News’ Fox & Friends, co-host Rachel Campos-Duffy warned that vaccine mandates are “the beginning of the communist-style social credit system,” adding:\n\nAre we rushing toward a social credit system where behavior is either rewarded or punished based on the whims of those in charge of the system? Biden’s refusal to make exceptions for those with natural immunity, who by no stretch of the imagination actually need or benefit from a COVID shot, seems to indicate we’re definitely heading that way.\n\nGiving people with natural immunity a health passport won’t work for the technocratic elite because the naturally immune isn’t on a vaccine subscription. The whole point of having a vaccine passport is that you lose your freedom every time a new booster rolls out. You either get the booster or lose your freedom.\n\nPeople with natural immunity can’t be roped into this control scheme. What are they going to force the naturally immune to do in order to keep a valid passport? They can’t make money off natural immunity, and they can’t use it to control.\n\nIn a September 13, 2021, letter to Biden, Consumer Brands Association CEO Geoff Freeman listed 19 of 50 questions received from its member companies. Among those questions is whether Biden’s executive order includes religious or medical exemptions, including exemption due to natural immunity.\n\nAs reported by Newsweek, details of Biden’s plan will be ironed out by the U.S. Occupational Safety and Health Administration (OSHA), but in the meantime, Freeman called on the Biden administration to address some of the most pressing questions.\n\nOSHA Lets Employers Off the Hook for Vaccine Injuries\n\nSpeaking of OSHA, in May 2021, the agency quietly revoked the requirement for employers who mandate the vaccine to record side effects as a work-related event. By doing so, OSHA relieved itself and employers from having to pay out workers’ comp if an employee is injured by a mandated COVID shot. OSHA tried to justify its decision, stating:\n\nPeople With Natural Immunity Turn to the Law\n\nIn the days ahead, our justice system is bound to clog up with lawsuits against employers, schools, and governments alike. Law professor Todd Zywicki recently sued George Mason University in Virginia over their vaccine mandate, as he has natural immunity. Zywicki discussed his lawsuit in August 6, 2021, Wall Street Journal commentary.\n\nHis lawsuit pointed out that people with natural immunity have an increased risk of adverse reactions to the COVID shot — according to one study up to 4.4 times the risk of clinically significant side effects — and that the requirement violates due process rights, the right to refuse unwanted medical treatment, and is noncompliant with the Emergency Use Authorization.\n\nAugust 17, 2021, George Mason University caved before the case went to trial and granted Zywicki a medical exemption. Unfortunately, the school did not revise its general policy.\n\nA number of other lawsuits have also been filed, including one by more than a dozen students and Children’s Health Defense against Rutgers University in New Jersey, and one by six Oregon workers who are suing the state on grounds that they already have natural immunity. The plaintiffs include two corrections officers, an EMT, a medical office manager, a school bus driver, and a special agent in charge of an Oregon Department of Justice investigatory unit.\n\nJason Dudash, director of the Oregon chapter of the Freedom Foundation, which is representing the state employees, accused Oregon Gov. Kate Brown of becoming “power-hungry amid the pandemic.” “The courts must establish a more logical, science-based approach,” he said.\n\nMilitary service members with natural immunity are also suing the Department of Defense, the FDA, and the Department of Health and Human Services. As reported by The Defender:\n\nThe lawsuit also points out that Pfizer’s Phase 3 trials, which is the phase in which long-term side effects are detected, won’t be completed until 2023. Moreover, the lawsuit highlights the fact that Pfizer unblinded the two cohorts in the middle of the trial and eliminated the control group by offering the real “vaccine” to all controls.\n\nIn so doing, Pfizer turned the study from a placebo-controlled blinded trial into an open observational study, and the FDA allowed it. Observational studies carry nowhere near the same weight as placebo-controlled trials, as you don’t have anything to compare the treatment group against. It’s very easy to overlook even severe injuries when you have no control group.\n\nFauci Warns There Will Be ‘Many More Vaccine Mandates’\n\nAs we approach the two-year mark of this pandemic, it’s time for our judicial system to kick in and protect the public. The emergency powers granted to governors are not supposed to last forever, and the rights afforded us by the U.S. Constitution were never intended to be suspended and tossed aside in times of medical crises. It’s time this rampant lawlessness got reined in.\n\nWhether or not that will happen remains to be seen. What we can be sure of is that if our legal system fails to do its duty, the beacon of freedom in this world will be lost. As reported by CNN, Fauci is out there warning that “if more people aren't persuaded to get vaccinated by messaging from health officials and ‘trusted political messengers,’ additional mandates from schools and businesses may be necessary.”\n\nThe technocratic elite will take it all the way because they are fighting for the Great Reset. And the Great Reset won’t work if people are free. They need leverage over the population, which is precisely what vaccine passports are all about.\n\nIn closing, those who support the mandating of experimental COVID shots will typically point to the 1905 Jacobson v. Massachusetts case, which is often interpreted as giving the government the right to force vaccinate everyone for the common good. However, as noted by Alex Berenson in a recent blog post, we ought to really look at the time at which that verdict was given.\n\nIn the years surrounding the 1905 Jacobson v. Massachusetts verdict, the U.S. Supreme Court also ruled in favor of racial discrimination, corporate monopoly, child labor, and making questioning government a jailable offense. That same year, in 1905, they ruled workers have no rights. In 1923, they ruled minimum wage laws are illegal and in 1927 they OK’d forced sterilization based on the Jacobson ruling.\n\nMost of these rulings have since been overturned and for obvious reasons. Most people don’t agree with racial discrimination, monopolies, and child labor anymore. Most agree that minimum wage laws are a good thing, and that questioning government is an unassailable right that is necessary for democracy to work. The 1905 Jacobson v. Massachusetts case is no different. It was made in and for a different time when individual and human rights were routinely quashed.\n\nAs noted by National Vaccine Information Center president Barbara Loe Fisher in “How Fear of a Virus Changed Our World”:\n\nSince the publication of my latest book, “The Truth About COVID-19,” which became an instant bestseller on Amazon.com, there’s been a significant increase in calls for censorship and ruthless attacks against me.\n\nMost recently, so-called “progressive” U.S. Sen. Elizabeth Warren, D-Mass., in an outrageous, slanderous, and basically unconstitutional attempt to suppress free speech, sent a letter to Amazon, demanding an “immediate review” of their algorithms to weed out books peddling “COVID misinformation.”\n\nWarren specifically singled out “The Truth About COVID-19” as a prime example of “highly ranked and favorably tagged books based on falsehoods about COVID-19 vaccines and cures” that she wants to see banned from sale.\n\nTwo days later, U.S. Rep. Adam Schiff, D-Calif., followed in Warren’s footsteps, sending letters to Facebook and Amazon, calling for more prolific censorship of vaccine information. Even President Joe Biden has recently used a debunked report as his sole source to call for my censorship.\n\nSadly, these attacks are being levied by the very people elected to safeguard democracy and our Constitutional rights. Essentially, what they are calling for is modern-day book burning. This is a democracy, not a monarchy.", "opengraph": {"locale": "en_US", "type": "article", "title": "What Biden's Vaccine Mandate Means for You | Russell Brand & Dr. Mercola", "description": "In a sweeping executive order,1 president Joe Biden mandated all U.S. companies with 100 or more employees to require COVID vaccination", "url": "http://consciouslifenews.com/what-bidens-vaccine-mandate-means-for-you-russell-brand-dr-mercola/11207894/", "site_name": "Conscious Life News", "article:author": "slykush2377", "article:tag": "vaccine mandates", "article:section": "Hazards, Issues & Diseases", "article:published_time": "2021-09-23T05:00:13-07:00", "article:modified_time": "2021-09-22T14:58:40-07:00", "updated_time": "2021-09-22T14:58:40-07:00", "image": "https://consciouslifenews.com/wp-content/uploads/2021/09/biden-vaccine-mandate.jpg", "image:secure_url": "https://consciouslifenews.com/wp-content/uploads/2021/09/biden-vaccine-mandate.jpg"}, "tags": ["Biden administration", "russell brand", "vaccine mandates", "Biden Administration vaccine mandate", "COVID vaccine mandate"], "tweets": [], "movies": [], "links": ["https://consciouslifenews.com/stop-ear-ringing", "https://consciouslifenews.com/hyperbolic-stretching", "https://childrenshealthdefense.org/legal/legal-resources/", "https://americanmilitarynews.com/2021/09/biden-orders-all-companies-with-100-employees-to-mandate-covid-19-vaccine-testing-or-face-up-to-14000-fines-per-person/", "https://www.zerohedge.com/political/not-now-not-ever-rnc-sue-biden-over-vaccine-mandate-gop-governors-go-ballistic?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+zerohedge%2Ffeed+%28zero+hedge+-+on+a+long+enough+timeline%2C+the+surviva", "https://amp.dailycaller.com/2021/09/09/biden-vaccine-mandate-gop-republican?__twitter_impression=true", "https://twitter.com/govkristinoem/status/1436060414970892288", "https://twitter.com/dougducey/status/1436061511445729288", "https://thehill.com/homenews/state-watch/572019-desantis-local-governments-will-face-5k-fine-for-vaccine-mandates", "https://childrenshealthdefense.org/defender/resources-federal-law-prohibits-mandates-emergency-use-covid-vaccines-tests-masks/", "https://childrenshealthdefense.org/legal/legal-resources/", "https://childrenshealthdefense.org/defender/under-federal-law-can-your-employer-make-you-get-covid-vaccine/", "https://crsreports.congress.gov/product/pdf/LSB/LSB10584", "https://www.lifesitenews.com/news/hundreds-awaiting-a-decision-from-the-govts-stingy-vaccine-injury-compensation-program", "https://www.insurancejournal.com/news/national/2020/08/14/579150.htm", "https://www.insurancejournal.com/news/national/2020/12/29/595414.htm", "https://www.hrsa.gov/vaccine-compensation/index.html", "https://www.mediamatters.org/fox-friends/fox-host-vaccine-mandates-are-beginning-communist-style-social-credit-system", "https://www.newsweek.com/will-those-natural-immunity-exempt-vaccine-mandate-trade-group-wants-answers-1628450", "https://ogletree.com/insights/osha-revokes-guidance-on-recordability-of-covid-19-vaccine-reactions/?fbclid=IwAR1UsI5-_2kfoAVekzYRPF8OH1pDyH9ZXiTi_FpP08T_hysU_XrDuAvpUNI", "https://ogletree.com/insights/oshas-new-guidance-on-recordability-of-covid-19-vaccine-reactions/", "https://www.bloomberglaw.com/public/desktop/document/ZywickivWashingtonetalDocketNo121cv00894EDVaAug032021CourtDocket?1628101526", "https://www.wsj.com/articles/vaccine-mandate-natural-immunity-lawsuit-covid-19-coronavirus-11628281507", "https://jamanetwork.com/journals/jamainternalmedicine/fullarticle/2782821?guestAccessKey=bda55105-4494-4cda-bac3-ae51e3cde92b&utm_source=silverchair&utm_medium=email&utm_campaign=article_alert-jamainternalmedicine&utm_content=olf&utm_term=081621", "https://www.citizensjournal.us/university-caves-on-vaccine-lawsuit-but-questions-remain/", "https://childrenshealthdefense.org/wp-content/uploads/Rutgers-Complaint.pdf", "https://www.oregonlive.com/coronavirus/2021/09/six-oregon-workers-with-natural-immunity-to-covid-19-sue-to-block-shot-mandate.html", "https://freebeacon.com/coronavirus/democratic-oregon-governor-sued-for-vaccine-mandate/", "https://childrenshealthdefense.org/defender/military-service-members-natural-immunity-lawsuit-dod-fda-hhs-covid-vaccine-mandate/", "https://www.cnn.com/2021/09/13/health/us-coronavirus-monday/index.html", "https://alexberenson.substack.com/p/if-you-like-compulsory-vaccinations", "https://www.nvic.org/nvic-vaccine-news/june-2020/how-fear-of-a-virus-changed-our-world.aspx"], "authors": [], "publish_date": "2021-09-23T05:00:13-07:00"}