{"result_id": "078050", "URL": "https://consciouslifenews.com/vaccine-induced-myocarditis-injuring-record-number-of-young-people-will-shots-also-bankrupt-families/11211680/", "timestamp": "2023-04-25 14:48:42 CEST+0200", "meta": {"description": "Medical debt is the predominant cause for about 25% of consumer bankruptcies triggered by \"sudden adverse events — such as vaccine-induced myocarditis.", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/favicon.ico", "canonical": "https://consciouslifenews.com/vaccine-induced-myocarditis-injuring-record-number-of-young-people-will-shots-also-bankrupt-families/11211680/", "encoding": "UTF-8"}, "image": null, "domain": "consciouslifenews.com", "title": "Vaccine-Induced Myocarditis Injuring Record Number of Young People. Will Shots Also Bankrupt Families?", "cleaned_text": "\n• In one-fourth (or more) of consumer bankruptcies, medical debt is the predominant causal factor, often triggered by “sudden adverse events.”\n• As of 2022, vaccine adverse event reporting of heart disease following COVID vaccines had increased 15,600% in young people under the age of 30, compared to the previous 31 years of heart injuries reported following receipt of FDA-approved vaccines.\n• Autism, linked to vaccines as well as other toxic exposures, furnishes a cautionary tale, potentially saddling families with lifetime care costs of $1.4 to $2.4 million.\n• In 2010, a government study estimated 1 in every 38 vaccine doses (2.6%) produced an adverse reaction. However, the sluggish and adversarial vaccine injury compensation process and a sky-high burden of proof leave two-thirds of claims dismissed or in limbo.\n• Emergency Use Authorization COVID shots are even less likely to garner vaccine injury compensation. Attorneys caution, “If you have suffered a serious injury from a Covid-19 vaccine, you are basically on your own.”\n• With over a million COVID-vaccine-related adverse events reported since December 2020, households are racking up extraordinary debt and turning to crowdfunding for help.\n• Heart conditions, among the 20 most expensive conditions treated in American hospitals, pack a financial wallop.\n• According to CDC, 96% of those under age 30 who experience heart injuries following COVID vaccination are hospitalized.\n• Children tend to have a more sudden and severe myocarditis presentation than adults, with an estimated 7% to 15% mortality rate. Children hospitalized with myocarditis are more likely to die than children admitted with other diagnoses.\n• Studies of children and adolescents who developed myocarditis following COVID vaccination show a “potentially poor prognosis despite the heart seeming to have returned to normal.” According to Mayo Clinic, “the greatest burden of myocarditis may not be apparent for 6-12 years after diagnosis when children die or need to undergo cardiac transplantation.”\n• Cardiac injuries triggered by dangerous COVID injections appear to be good for business.\n• A July 2021 BusinessWire report forecast a booming market for cardiac assist devices, noting “increasing incidence of heart failure is driving growth.”\n• Families, however, are left holding the bag not just emotionally, but financially, blindsided by financial impacts they surely never anticipated.\n\nFor decades, families have been learning bitter lessons about the financial impact of vaccine injuries. In an estimated 18% to 26% of consumer bankruptcies or more, medical debt is the “predominant causal factor” — with medical debt often triggered by “sudden adverse events.”\n\nConsider autism — by now indisputably linked to vaccines as well as other toxic exposures — which can saddle families with lifetime care costs of $1.4 to $2.4 million, setting up a contentious battleground between parents and entities like insurance companies and school systems that don’t want to “pick up that big tab.”\n\nThe government’s National Vaccine Injury Compensation Program (NVICP), too, has gone to great lengths to avoid compensating autism and other childhood vaccine injuries, helped along by the well-known dysfunctions of the Vaccine Adverse Event Reporting System (VAERS).\n\nAlthough an HHS-commissioned study estimated, in 2010, that 1 in every 38 vaccine doses (2.6%) produced an adverse reaction, the conveniently broken surveillance system facilitates propagation of the fiction that adverse events are “rare,” “one in a million” or, according to Dr. Anthony Fauci, “almost nonmeasurable.”\n\nThe taxpayer-funded NVICP has paid out over $4.7 billion since 1988 and professes to be an “accessible and efficient forum for individuals found to be injured by certain vaccines.” But its adversarial — and sluggish — process and sky-high burden of proof result in two-thirds of claims being dismissed or remaining in limbo.\n\nWhen it does pay out, NVICP more often compensates vaccine injuries in adults than children.\n\nRecipients of Emergency Use Authorization (EUA) COVID injections ostensibly have recourse to the special Countermeasures Injury Compensation Program (CICP), but the CICP, from its inception, has proved to be even more of a hollow promise than the NVICP, with no funds set aside to cover eventual compensation, no allowance for attorneys’ fees and a one-year statute of limitations.\n\nAs attorneys wrote in January, “If you have suffered a serious injury from a Covid-19 vaccine, you are basically on your own.”\n\nIn short, the financial stakes for those who take liability-free COVID shots — with their unparalleled health risks — are high.\n\nIn early 2020, the CEO of a crowdfunding platform noted that over one-third of its fundraisers were for medical expenses. With more than 1 million COVID-vaccine-related adverse events reported to VAERS since December 2020, that state of affairs has picked up even more speed, as households rack up extraordinary debt and turn to crowdfunding for help.\n\nWell before COVID, myocarditis (inflammation of the heart muscle) and pericarditis (inflammation of the tissue surrounding the heart) were understood to be the result of “the interaction of an external environmental trigger with the host’s immune system.”\n\nOne of those “environmental triggers,” researchers acknowledged, was vaccination.\n\nFor example, analyses of VAERS and clinical data identified the two cardiac conditions as adverse events reported after vaccines for anthrax, Haemophilus influenzae type b (Hib), hepatitis A, hepatitis B, human papillomavirus (HPV), influenza, meningococcal illness, smallpox, typhoid, varicella (chickenpox) and zoster (shingles).\n\nA 2018 case report described myocarditis in a 6-week-old infant following administration of diphtheria, whole-cell pertussis, and tetanus toxoid (DPT) shot.\n\nWith the advent of COVID shots, cardiac adverse events — myocarditis, pericarditis, and myopericarditis — have skyrocketed to an entirely new level, especially in young males and especially after the second dose.\n\nIn young people under the age of 30, VAERS shows “a 15,600% increase in heart disease following COVID EUA vaccines compared to FDA-approved [U.S. Food and Drug Administration] vaccines for the previous 31 years.”\n\nWith heart problems being some of the most commonly reported, widely published, and life-changing COVID-jab-related injuries, the FDA was forced into requiring warnings about the increased risks in manufacturer fact sheets.\n\nAs University of Pennsylvania researchers put it last year (parroting official silliness about such events being “rare”), “the temporal association of the receipt of the vaccine and absence of other plausible causes suggests the vaccine as the likely precipitant of these rare events.”\n\nHeart conditions pack a financial wallop, predominating among the 20 most expensive conditions treated in American hospitals and accounting for almost half of aggregate hospital costs.\n\nWith the most expensive healthcare in the world, a third of U.S. healthcare spending goes to hospital care.\n\nAnalyzing several hundred confirmed myocarditis and pericarditis cases in young COVID vaccine recipients (< 29 years), a Centers for Disease Control and Prevention (CDC) scientist reported in June 2021 that 96% of the youth with heart injuries had been hospitalized.\n\nPast studies of myocarditis and pericarditis hospitalization costs have found the following:\n• As of 2016, the median inflation-adjusted cost of a single pediatric hospitalization for acute myocarditis (median hospital stay = 6.1 days) was more than $27K — already representing a “significant” increase over 2007 costs and likely much higher today.\n• One in five kids hospitalized with myocarditis has an arrhythmia. A pediatric study published in 2020 reported the median cost of hospitalization for children with myocarditis involving arrhythmia to be far higher — almost $122K versus roughly $38K for myocarditis patients without arrhythmia. Heart rhythm problems also dramatically increased the odds of death.\n• The median cost of hospitalization for acute pericarditis (all age groups), as of 2016, was estimated at around $10K, but nearly one in five patients (18%) reentered the hospital within 30 days of discharge, at a cost of another nearly $10K.\n\nBoth arrhythmias and complications from cardiac treatments are common causes of hospital readmission.\n\nNot ‘mild’ and not short-term\n\nChest pain, malaise and palpitations are common signs of pericarditis. It, too, can lead to heart failure and other longer-term complications.\n\nChildren tend to have a more fulminant — sudden and severe — myocarditis presentation than adults, with an estimated 7% to 15% mortality rate. Children hospitalized with myocarditis are more likely to die than children admitted with other diagnoses.\n\nDiscussing myocarditis in 2012, Mayo Clinic researchers acknowledged that even with a good short-term prognosis, “patients who initially recover might develop recurrent dilated cardiomyopathy and heart failure, sometimes years later.”\n\nOne of the Mayo authors added in 2018, “the greatest burden of myocarditis may not be apparent for 6 to 12 years after diagnosis when children die or need to undergo cardiac transplantation.”\n\nStrangely, Mayo nevertheless continues to propagate the myth of “mild” myocarditis, a dishonest characterization that physicians in the COVID era have strenuously protested.\n\nDr. Steven Pelech of the University of British Columbia explained last August, for example:\n\n“Contrary to what a number of people have said, there is no such thing as ‘mild myocarditis.’ It’s the destruction of the myocytes, the heart cells that contract. When those cells die, they are not replaced in your body and are instead replaced by scar tissue, which is from fibroblasts — skin cells that don’t have contractile activity …Every time you get an inflammatory response, you lose more of that contractility and have a greater chance of heart attack and other problems later in life.”\n\nA New Zealand writer pointedly observed that “mild” clinical manifestations in the present are meaningless for interpreting longer-term risks.\n\nUsing magnetic resonance imaging (MRI) scans with gadolinium contrast — capable of showing “damaged heart areas undetectable by any other means” — studies of children and adolescents who developed myocarditis following COVID vaccination revealed, in the vast majority, a “potentially poor prognosis despite the heart seeming to have returned to normal.”\n\nDescribing their study just published in Neurology, the University of California, San Francisco researchers Laure Rouch and Kristine Yaffe told Medscape “heart health is key to brain health.”\n\nThe study disclosed the alarming finding that abnormalities in cardiac structure and function acquired in young adulthood are a risk factor for cognitive decline in midlife.\n\nMyocarditis treatments are expensive but almost purely supportive, primarily aimed at managing complications.\n\nFor severe cases, interventions can be costly, aggressive, and often futile.\n\nFor complications of severe myocarditis, the last resort is a heart transplant. Ironically, individuals who need a transplant but refuse to get a COVID shot are being taken off transplant waiting lists.\n\nSituations involving acute cardiac failure and heart transplantation may lead to short-term mechanical circulatory support, including the use of ventricular assist devices (VAD) or lung-mimicking extracorporeal membrane oxygenation (ECMO) machines.\n\nThese gizmos come with a high price tag, with total hospitalization costs for pediatric patients receiving such support estimated around $755K (VAD) and $809K (ECMO), versus $457K for patients not getting mechanical support.\n\nUnfortunately, research involving pediatric heart patients suggests these mechanical supports do little good. In one myocarditis study in kids, the development of ventricular arrhythmia strongly predicted both ECMO utilization AND mortality.\n\nCardiac injuries triggered by dangerous COVID injections appear to be good for business. As the Mayo Clinic frankly admits, some myocarditis patients will require lifelong medication — creating customers for life.\n\nMoreover, the corticosteroids — “or other medications to suppress [the] immune system” — and anti-clotting or blood-pressure drugs prescribed for supposedly “mild” cases of myocarditis come with their own set of side effects, setting the stage for further profit-generating medical and pharmaceutical interventions down the road.\n\nA July 2021 BusinessWire report forecast a booming market for cardiac assist devices such as VAD through 2027, noting “increasing incidence of heart failure is driving growth.”\n\nBusinessWire cited the vast pipeline of such products as a market driver and “opportunity.”\n• An “upward trend” for the overall “myocarditis treatment market,” with the market “expected to rise over the projected horizon” (2021–2027).\n• Steady growth in the global market addressing dilated cardiomyopathy (one of the downstream consequences of myocarditis) — from $163 million in 2019 to $258.2 million by 2026.\n• An equally rosy “global pericarditis market” featuring market players such as Pfizer and AstraZeneca as well as other Pharma giants such as Bayer and Merck.\n\nIn addition, Big Pharma is champing at the bit to roll out expensive new pericarditis therapies — which researchers eagerly (coincidentally?) announced in late summer and fall of 2021.\n\nMeanwhile, COVID shots are leaving many young people either dead or facing a broken heart and uncertain future.\n\nEven with definitive autopsy confirmation of a direct vaccine-myocarditis link staring them in the face, the engineers of “this ungodly and criminal medical experiment on humankind” — a key fixture of the push for a global control grid — are content to uphold the ruinous status quo.\n\nWhere does that leave families?\n\nHolding the bag not just emotionally, but financially, blindsided by financial impacts they surely never anticipated.", "opengraph": {"locale": "en_US", "type": "article", "title": "Vaccine-Induced Myocarditis Injuring Record Number of Young People. Will Shots Also Bankrupt Families?", "description": "Medical debt is the predominant cause for about 25% of consumer bankruptcies triggered by \"sudden adverse events — such as vaccine-induced myocarditis.", "url": "http://consciouslifenews.com/vaccine-induced-myocarditis-injuring-record-number-of-young-people-will-shots-also-bankrupt-families/11211680/", "site_name": "Conscious Life News", "article:author": "slykush2377", "article:tag": "vaccine-related myocarditis", "article:section": "Hazards, Issues & Diseases", "article:published_time": "2022-02-01T03:00:21-08:00", "article:modified_time": "2022-01-31T20:36:01-08:00", "updated_time": "2022-01-31T20:36:01-08:00", "image": "https://consciouslifenews.com/wp-content/uploads/2022/01/myocarditis-hurting-young-people.jpg", "image:secure_url": "https://consciouslifenews.com/wp-content/uploads/2022/01/myocarditis-hurting-young-people.jpg"}, "tags": ["myocarditis and COVID vaccine", "covid vaccine dangers", "COVID vaccine injuries", "vaccine-related myocarditis", "vaccine-induced myocarditis", "medical debt"], "tweets": [], "movies": [], "links": ["https://www.mainelawreview.org/volume-67-no-1-2015/medical-debt-as-a-cause-of-consumer-bankruptcy/", "https://www.thebalance.com/medical-bankruptcy-statistics-4154729", "https://childrenshealthdefense.org/defender/autism-cdc-media-vaccine-related-harm/", "https://www.mdpi.com/1099-4300/15/4/1416", "https://tobyrogers.substack.com/p/the-political-economy-of-autism", "https://www.theatlantic.com/business/archive/2012/05/the-economic-impact-of-autism-on-families/257892/", "https://consciouslifenews.com/stop-ear-ringing", "https://www.hrsa.gov/vaccine-compensation/about/index.html", "https://childrenshealthdefense.org/news/misconduct-mitochondria-and-the-omnibus-autism-proceedings/", "https://childrenshealthdefense.org/defender/rfk-jr-david-kessler-covid-vaccine-vaers/", "https://vaers.hhs.gov/", "https://digital.ahrq.gov/sites/default/files/docs/publication/r18hs017045-lazarus-final-report-2011.pdf", "https://childrenshealthdefense.org/defender/rfk-jr-david-kessler-covid-vaccine-vaers/", "https://www.fda.gov/media/83546/download", "https://www.amazon.com/Real-Anthony-Fauci-Democracy-Childrens/dp/1510766804", "https://www.pbs.org/wgbh/frontline/article/anthony-fauci-risks-from-vaccines-are-almost-nonmeasurable/", "https://www.hrsa.gov/sites/default/files/hrsa/vaccine-compensation/data/vicp-monthly-report-template-01-01-22.pdf", "https://www.hrsa.gov/vaccine-compensation/about/index.html", "https://childrenshealthdefense.org/news/ncvia-the-legislation-that-changed-everything-conflicts-of-interest-undermine-childrens-health-part-ii/", "https://consciouslifenews.com/hyperbolic-stretching", "https://childrenshealthdefense.org/news/an-unwelcome-milestone-payouts-for-influenza-vaccine-injuries-exceed-900-million/", "https://childrenshealthdefense.org/defender_category/covid/", "https://www.hrsa.gov/cicp", "https://childrenshealthdefense.org/defender/covid-vaccine-injury-no-compensation-program/", "https://www.natlawreview.com/article/most-vaccine-injuries-are-covered-vicp-except-covid-shots-we-all-just-received", "https://childrenshealthdefense.org/defender/covid-vaccine-injuries-financial-risk/", "https://www.phe.gov/Preparedness/legal/prepact/Pages/prepqa.aspx", "https://childrenshealthdefense.org/defender/covid-vaccines-miscarriages-cancer-neurological-disorders-military/", "http://www.mountholyokenews.com/healthandscience/2020/2/28/health-care-fundraisers-on-gofundme-are-under-scrutiny-for-inability-to-address-significant-gaps-in-coverage", "https://childrenshealthdefense.org/defender/vaers-cdc-covid-vaccine-injuries-children/", "https://childrenshealthdefense.org/defender/hundreds-injured-covid-vaccines-gofundme-expenses/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5814111/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8439515/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8541143/", "https://pubmed.ncbi.nlm.nih.gov/18664932/", "https://pubmed.ncbi.nlm.nih.gov/25793705/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5963245/", "https://childrenshealthdefense.org/defender/covid-nw-new-data-link-between-vaccines-myopericarditis/", "https://vaccineimpact.com/2022/government-vaers-data-reveal-15600-increase-in-heart-disease-among-under-30-year-olds-following-covid-19-vaccination/", "https://childrenshealthdefense.org/defender/vaers-cdc-olympic-sprinter-pericarditis-pfizer-booster/", "http://www.smj.org.sg/sites/default/files/RA-2021-326-epub.pdf", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-june-25-2021", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8270057/", "https://hcup-us.ahrq.gov/reports/statbriefs/sb261-Most-Expensive-Hospital-Conditions-2017.jsp", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5394555/", "https://www.ama-assn.org/about/research/trends-health-care-spending", "https://www.cdc.gov/vaccines/acip/meetings/downloads/slides-2021-06/03-COVID-Shimabukuro-508.pdf", "https://pubmed.ncbi.nlm.nih.gov/33757784/", "https://pubmed.ncbi.nlm.nih.gov/33757784/", "https://link.springer.com/article/10.1007/s00431-020-03687-4", "https://www.tandfonline.com/doi/abs/10.1080/14779072.2021.1876564?journalCode=ierk20", "https://www.patientbond.com/blog/the-top-5-causes-of-hospital-readmissions-and-how-to-prevent-them", "https://pubmed.ncbi.nlm.nih.gov/32603361/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5814110/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8490073/", "https://publications.aap.org/pediatricsinreview/article-abstract/40/1/14/35218/Acute-Myocarditis-and-Pericarditis-in-Children?redirectedFrom=fulltext", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5814111/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5814110/", "https://www.mayoclinic.org/diseases-conditions/myocarditis/diagnosis-treatment/drc-20352544", "https://westernstandardonline.com/2021/08/ubc-scientist-raises-concern-over-vaccine-risks-and-variant-misinformation/", "https://breakingviewsnz.blogspot.com/2021/11/helen-egmont-shots-in-dark-myocarditis.html", "https://www.medscape.com/viewarticle/967416", "https://n.neurology.org/content/early/2022/01/26/WNL.0000000000013249", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8439515/", "https://www.mayoclinic.org/diseases-conditions/myocarditis/diagnosis-treatment/drc-20352544", "https://www.myocarditisfoundation.org/treatment/", "https://boston.cbslocal.com/2022/01/24/covid-19-vaccine-heart-transplant-boston-brigham-womens-hospital-dj-ferguson/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6005754/", "https://link.springer.com/article/10.1007/s00431-020-03687-4", "https://www.businesswire.com/news/home/20210707005399/en/Global-Cardiac-Assist-Devices-Market-to-2027---Increasing-Incidence-of-Heart-Failure-is-Driving-Growth---ResearchAndMarkets.com", "https://www.marketwatch.com/press-release/global-myocarditis-treatment-market-growth-statistics-2021-competitive-landscape-restraining-factors-market-concentration-rate-development-status-and-growth-by-forecast-2027-2021-11-03", "https://rivercountry.newschannelnebraska.com/story/45172214/dilated-cardiomyopathy-market-size-with-comprehensive-growth-research-2021-revenue-analysis-by-regions-industry-trends-and-global-share-forecast-to", "https://www.marketresearchplace.com/report/global-pericarditis-market-research-report-2021-2027-207167.html", "https://childrenshealthdefense.org/defender/joseph-keating-autopsy-death-myocarditis-pfizer-covid-vaccine/", "https://childrenshealthdefense.org/defender/bill-gates-indian-government-lawsuit-astrazeneca-vaccine-killed-shri-hitesh-kadve/", "https://childrenshealthdefense.org/defender/ashley-dalton-merck-gardasil-hpv-vaccine-injuries/", "https://childrenshealthdefense.org/defender_category/big-pharma/", "https://www.ahajournals.org/doi/10.1161/JAHA.121.021685", "https://www.health.harvard.edu/heart-health/new-treatment-for-pericarditis-approved", "https://childrenshealthdefense.org/defender/cdc-not-investigating-myocarditis-death-jacob-clynick-pfizer-vaccine/", "https://pubmed.ncbi.nlm.nih.gov/34374740/", "https://childrenshealthdefense.org/defender/joseph-keating-autopsy-death-myocarditis-pfizer-covid-vaccine/", "https://doctors4covidethics.org/holocaust-survivors-letter-to-international-criminal-court/", "https://home.solari.com/deep-state-tactics-101-the-covid-injection-fraud-its-not-a-vaccine/", "https://pandemic.solari.com/family-financial-disclosure-form-for-covid-19-injections/", "https://childrenshealthdefense.org/authors/childrens-health-defense-team/"], "authors": [], "publish_date": "2022-02-01T03:00:21-08:00"}