{"result_id": "078034", "URL": "https://consciouslifenews.com/covid-shots-intended-to-reduce-worlds-population-by-poisoning-billions-dr-shankara-chetty/11210466/", "timestamp": "2023-04-25 14:48:27 CEST+0200", "meta": {"description": "Dr. Chetty: The purpose of the jab is to “kill off a large proportion of our population without anyone suspecting that we were poisoned.”", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/favicon.ico", "canonical": "https://consciouslifenews.com/covid-shots-intended-to-reduce-worlds-population-by-poisoning-billions-dr-shankara-chetty/11210466/", "encoding": "UTF-8"}, "image": null, "domain": "consciouslifenews.com", "title": "Covid Shots Are Intended to Reduce the World’s Population by Poisoning ‘Billions’ | Dr. Shankara Chetty", "cleaned_text": "“The deaths that are meant to follow the vaccinations will never be able to be pinned on the poison. They will be too diverse, there will be too many, and they will be in too broad a timeframe for us to understand that we have been poisoned.” ~Dr. Shankara Chetty.\n\nDr. Shankara Chetty is a family doctor in South Africa and a world expert on the science and treatment of Covid 19. He is also acutely aware of the Covid-19 agenda which he describes in detail in this brief and concise 11-minute video. In his judgment, the purpose of the pandemic and vaccine agenda is to “control and kill off a large proportion of our population without anyone suspecting that we were poisoned.”\n\nLook, I think I think the perspective around what's happening is vitally important. We need to understand what the aim is. Everyone knows that there are inconsistencies, that there's fear mongering, that there is coercion, but we need to understand why? Why is that?\n\nNow the most important thing, I think for us to understand is the pathogen that was causing all the death in Covid illness. Now, I use the word Covid illness because we haven't really isolated a coronavirus that causes it. But in Covid illness, the pathogen is Spike protein, and spike protein is what the vaccine is meant to make in your body. So if I had to give you my opinion as to what is happening on a global scale and a lot of the work that I'm doing behind the scenes is in this direction. Spike protein is one of the most contrived toxins or poisons, that man has ever made. And the aim of this toxin is to kill billions without anyone noticing it. So, it's a poison with an agenda.\n\nNow, we've got an engineered virus, and we've got a mandated vaccine that follow-on on each other. So basically, what's looks like what's transpired here is they've engineered a virus and put on this weapons-grade package onto it called spike protein.\n\nSo now we've got this most elaborately engineered toxin Now, it's been put into a virus, or let's call it a vector, and we've exposed the planet to a small dose of it. Now initially, a spike protein triggers an allergic reaction. And the allergic reaction, if untreated, causes death. It's what we've seen with covid Illness. But that is not the end game – that is to test the water.\n\nSo you're going to get a small percentage of people to react – we see all the deaths… When this reaction occurs… we isolate the planet for 14 days. So nobody notices when this occurs. People get to the hospital too late. We mandate protocols in hospitals to engineer death and damage – to steer all the fear and the risk that we need. We create all the confusion. We make sure we steal humanity towards mass formation. We take away all the faith that we have, all the hope. We keep people isolated. It.\n\nSo we've been conned into thinking giving away our freedoms – would be the best thing for us. So the safest place for us was in jail, and that's where we all are at this point in time.\n\nBut the game that they played with this engineered virus was to justify the vaccination of the planet. Now, the vaccination of the planet will expose us to spike protein for a longer period. So, spike protein, if we understand what it's meant to do. Yes, initially, it will trigger an immune response and allergic kind of reaction, and we have immediate deaths from that.\n\nBut you don't poison someone and they die immediately. You'll notice the poisoning. So straight away, when you give a vaccine, the first 14 days, after the vaccine, any side effects cannot be attributable to the vaccine, because that is where all the allergic reactions would lie.\n\nFollowing that we're going to see the endothelial injuries that this vaccine causes with the spike protein and its influence on H2 receptors. Those are the deaths that are meant to follow. And they will never be pinned onto spike protein, a very well-engineered toxin.\n\nNow, spike protein is also a membrane protein. So the mRNA will distribute this throughout our body. It will be made in various tissues in our body. It will be incorporated into those membranes around our body, into those specific tissues. Those tissues will be recognized as foreign and we would trigger a host of autoimmune responses. So the deaths that are meant to follow the vaccinations will never be able to be pinned on the poison. They will be too diverse. There will be too many and there will be a too embroidered time frame for us to understand that we have been poisoned. And I think this is the big plan.\n\nThis toxin is dependent on the host's response to it. Just like the eighth day and what followed Covid infection or illness was dependent on a host response. So we got mild, moderate, and severe illness post (?) and it confused all of us. So we keep talking about Covid pneumonia. But we're chasing the virus and the virus was just the vector to give us a taste of the poison.\n\nNow this toxin in the long term, it is going to get people with pre-existing illness to have those illnesses exacerbated. It has bits of (?) in it. It has bits of HIV protein in it. It is definitely engineered. So people with cancers are going to have their cancer flare-up. And we'll say they died of cancer. People with (?) injuries, or predisposition like our diabetics and hypertensives, are going to have strokes and heart attacks and the rest at varying times. And we'll attribute those to their pre-existing conditions. People are going to develop over time autoimmune conditions, the diversity of which will never be addressed by any pharmaceutical intervention because they are far too targeted. And so we've got a rough road coming.\n\nBut I think if people understand what the intention is, then we'll understand why what's happened has happened. The illogic, the coercion, the suppression is all warranted if you understand that there is a bigger plan. This plan is to make sure that we can control and kill off a large proportion of our population without anyone suspecting that we were poisoned. And so I think the justification for everything we see is warranted in understanding the endgame.\n\nWe've given up our freedoms. We were told that jail is the best place for us to be secure. So we willingly went down that road. Now today, if we want our freedoms back, they've got a mandated vaccine. We were herded like cattle into a crawl and the only way out is through the (?) and that is where we lost our freedoms. And so I think there's a huge picture at play.\n\nThe vaccines make absolutely no sense. We were sold the vaccine as our savior from the start. And if we look at the science, the science does not play out. The vaccine is absolutely nonsensical. We keep fighting about how good or bad the vaccine is. I just want to make two points on the vaccinations.\n\n(1) Vaccines are meant to stimulate immunity and in doing so prevent infection and prevent transmission. That is what gives a vaccine a population or group benefit. So if you take the vaccine by not getting the virus of transmitting it, you protect me. Now, clearly, that has not occurred. The [Covid] vaccines do not do that. Now they claim that the vaccine has a benefit in preventing severe illness and death. That is a therapeutic benefit. My intervention with treatment does the same, but I do not expose the entire world to the side effects of my treatment. I only expose sick people to that. And that therapeutic benefits do not come from immunity, but it comes from the vaccine exposing you to spike protein and building a measure of tolerance to an allergen – not to any immune-mediated response to a virus. So the virus distracts us from the big picture. It is spike protein that's the toxin here.\n\n (2) Secondly, the prevention of severe illness and death is an individual benefit if it actually does that. So if you take the vaccine, it prevents you from getting severely ill or dying. It has no group benefit and doesn't benefit me at all. So why am I being coerced into forcing you to take the vaccine to benefit me? To just put that into perspective for laymen: Skydiving is an individual risk and an individual benefit that does not influence anyone around me. And so my right to choose to skydive is vitally important. Now, they want me to skydive, because they say it benefits humanity. Now, they can't prove the science and they can't tell me how this how this act of mine is going to benefit humanity. Yet, they insist I do it. When I didn't and I can see the signs, they offered me a beer and a doughnut, but I still don't want to skydive. You still haven't proven the science and tell me how it's going to benefit humanity. Now, it looks like they want to push me out of the plane. But when I look up, the parachute they provide me is full of holes and they don't want to admit to that, And I see a few dead bodies lying on the ground and they tell me they're fast asleep. I don't believe that. Now, if they can prove a population benefit to the vaccine, maybe I'll take this plunge for the benefit of humanity. But until that point, we are being coerced.", "opengraph": {"locale": "en_US", "type": "article", "title": "Covid Shots Are Intended to Reduce the World’s Population by Poisoning ‘Billions’ | Dr. Shankara Chetty", "description": "Dr. Chetty: The purpose of the jab is to “kill off a large proportion of our population without anyone suspecting that we were poisoned.”", "url": "http://consciouslifenews.com/covid-shots-intended-to-reduce-worlds-population-by-poisoning-billions-dr-shankara-chetty/11210466/", "site_name": "Conscious Life News", "article:tag": "vaccine agenda", "article:section": "Big Pharma, CDC, EPA & FDA", "article:published_time": "2021-12-19T09:45:45-08:00", "article:modified_time": "2021-12-19T12:49:59-08:00", "updated_time": "2021-12-19T12:49:59-08:00", "image": "https://consciouslifenews.com/wp-content/uploads/2021/12/dr-shankara-chetty.jpg", "image:secure_url": "https://consciouslifenews.com/wp-content/uploads/2021/12/dr-shankara-chetty.jpg"}, "tags": ["vaccine agenda", "Dr. Shankara Chetty"], "tweets": [], "movies": [], "links": ["https://consciouslifenews.com/covid-shots-intended-to-reduce-worlds-population-by-poisoning-billions-dr-shankara-chetty/11210466/", "#", "#", "#", "https://consciouslifenews.com/covid-shots-intended-to-reduce-worlds-population-by-poisoning-billions-dr-shankara-chetty/11210466/?print=pdf", "https://consciouslifenews.com/covid-shots-intended-to-reduce-worlds-population-by-poisoning-billions-dr-shankara-chetty/11210466/?print=print", "https://rumble.com/vqu7y0-doctors-best-concise-explanation-of-convid-1984-and-the-shots-in-under-11-m.html", "https://drshankarachetty.com/", "https://consciouslifenews.com/beware-hospital-stay-10-days-likely-kill-car-accident/11117253/", "https://consciouslifenews.com/beware-hospital-stay-10-days-likely-kill-car-accident/11117253/", "https://consciouslifenews.com/find-great-psychologist-6-ways/11162355/", "https://consciouslifenews.com/find-great-psychologist-6-ways/11162355/", "https://consciouslifenews.com/seven-ways-to-find-your-purpose-in-life/11191176/", "https://consciouslifenews.com/seven-ways-to-find-your-purpose-in-life/11191176/", "https://consciouslifenews.com/astronomy-picture-of-the-day-proton-arc-over-lake-superior/11104367/", "https://consciouslifenews.com/astronomy-picture-of-the-day-proton-arc-over-lake-superior/11104367/", "#", "#", "#"], "authors": [], "publish_date": "2021-12-19T09:45:45-08:00"}