{"result_id": "078007", "URL": "https://consciouslifenews.com/as-reports-of-injuries-after-covid-vaccines-near-1-million-mark-cdc-fda-clear-pfizer-moderna-boosters-for-all-adults/11209618/", "timestamp": "2023-04-25 14:47:58 CEST+0200", "meta": {"description": "VAERS data released by the CDC included a total of 894,145 reports of adverse events from all age groups following COVID vaccines", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/favicon.ico", "canonical": "https://consciouslifenews.com/as-reports-of-injuries-after-covid-vaccines-near-1-million-mark-cdc-fda-clear-pfizer-moderna-boosters-for-all-adults/11209618/", "encoding": "UTF-8"}, "image": null, "domain": "consciouslifenews.com", "title": "As Reports of Injuries After COVID Vaccines Near 1 Million Mark, CDC, FDA Clear Pfizer, Moderna Boosters for All Adults", "cleaned_text": "The Centers for Disease Control and Prevention (CDC) released new data today showing a total of 894,145 adverse events following COVID vaccines were reported between Dec. 14, 2020, and Nov. 12, 2021, to the Vaccine Adverse Event Reporting System (VAERS). VAERS is the primary government-funded system for reporting adverse vaccine reactions in the U.S.\n\nThe data included a total of 18,853 reports of deaths — an increase of 392 over the previous week — and 139,126 reports of serious injuries, including deaths, during the same time period — up 3,726 compared with the previous week.\n\nExcluding “foreign reports” to VAERS, 654,413 adverse events, including 8,664 deaths and 54,962 serious injuries, were reported in the U.S. between Dec. 14, 2020, and Nov. 12, 2021.\n\nForeign reports are reports received by U.S. manufacturers from their foreign subsidiaries. Under U.S. Food and Drug Administration (FDA) regulations, if a manufacturer is notified of a foreign case report that describes an event that is both serious and does not appear on the product’s labeling, the manufacturer is required to submit the report to VAERS.\n\nOf the 8,664 U.S. deaths reported as of Nov. 12, 10% occurred within 24 hours of vaccination, 15% occurred within 48 hours of vaccination and 26% occurred in people who experienced an onset of symptoms within 48 hours of being vaccinated.\n\nIn the U.S., 436.9 million COVID vaccine doses had been administered as of Nov. 12. This includes 254.5 million doses of Pfizer, 166.3 million doses of Moderna, and 16.1 million doses of Johnson & Johnson (J&J).\n\nEvery Friday, VAERS publishes vaccine injury reports received as of a specified date. Reports submitted to VAERS require further investigation before a causal relationship can be confirmed. Historically, VAERS has been shown to report only 1% of actual vaccine adverse events.\n\nThis week’s U.S. data for 5- to 11-year-olds show:\n• 1,426 total adverse events, including 9 rated as serious and 1 reported death that occurred in an 11-year-old girl from Georgia vaccinated Sept. 14, prior to the authorization of Pfizer’s COVID vaccine in the 5 to 11 age group.\n• 444 adverse events have been reported in the 5 to 11 age group since Nov. 1.\n• The rest of the reports in VAERS for children in the 5 to 11 age group occurred prior to the authorization of Pfizer’s COVID vaccine, and are due to ”product administered to the patient of inappropriate age.”\n\nThis week’s U.S. data for 12- to 17-year-olds show:\n• 23,105 total adverse events, including 1,429 rated as serious and 30 reported deaths.\n\nThe most recent death includes a 16-year-old girl from Missouri (VAERS I.D. 1823671) who died after receiving her second dose of Pfizer.\n\nOther reported deaths include a 17-year-old female from Washington (VAERS I.D. 1828901) who died Oct. 29 reportedly from a heart condition after receiving her second dose of Pfizer; a 12-year-old girl from South Carolina (VAERS I.D. 1784945) who hemorrhaged 22 days after receiving Pfizer’s COVID vaccine; and a 13-year-old girl from Maryland (VAERS I.D. 1815096) who died from a heart condition 15 days after receiving her first dose of Pfizer’s vaccine.\n• 59 reports of anaphylaxis among 12- to 17-year-olds where the reaction was life-threatening, required treatment or resulted in death — with 96% of cases attributed to Pfizer’s vaccine.\n• 559 reports of myocarditis and pericarditis (heart inflammation) with 549 cases attributed to Pfizer’s vaccine.\n• 134 reports of blood clotting disorders, with all cases attributed to Pfizer.\n\nThis week’s U.S. VAERS data, from Dec. 14, 2020, to Nov. 12, 2021, for all age groups combined, show:\n• 19% of deaths were related to cardiac disorders.\n• 54% of those who died were male, 42% were female and the remaining death reports did not include the gender of the deceased.\n• The average age of death was 72.7.\n• As of Nov. 12, 4,362 pregnant women reported adverse events related to COVID vaccines, including 1,376 reports of miscarriage or premature birth.\n• Of the 3,158 cases of Bell’s Palsy reported, 51% were attributed to Pfizer vaccinations, 41% to Moderna, and 8% to J&J.\n• 743 reports of Guillain-Barré syndrome (GBS), with 42% of cases attributed to Pfizer, 31% to Moderna, and 27% to J&J.\n• 2,125 reports of anaphylaxis where the reaction was life-threatening, required treatment, or resulted in death.\n• 11,058 reports of blood clotting disorders. Of those, 4,888 reports were attributed to Pfizer, 3,937 reports to Moderna, and 2,179 reports to J&J.\n• 3,145 cases of myocarditis and pericarditis with 1,963 cases attributed to Pfizer, 1,041 cases to Moderna, and 130 cases to J&J’s COVID vaccine.\n\nFDA, CDC sign off on Pfizer, Moderna COVID boosters for all adults\n\nThe U.S. Food and Drug Administration (FDA) today authorized Moderna and Pfizer COVID boosters for all adults. The agency made its decision without input from its advisory committee, whose members, on Sept. 17, voted 16 to 2 against recommending boosters, citing a lack of long-term data and stating the risks did not outweigh the benefits.\n\nHours after the FDA announced its decision, the CDC’s Advisory Committee on Immunization Practices (ACIP) signed off with a unanimous endorsement.\n\nThe ACIP said 18- to 49-year-olds “may” get a booster, but people 50 and older should get one. CDC Director Dr. Rochelle Walensky is expected to clear the doses, which will allow boosters to be administered broadly to the general public.\n\nSpeaking for the FDA, Dr. Peter Marks, head of the agency’s Center for Biologics Evaluation and Research, said in a statement:\n\n“The FDA has determined that the currently available data support expanding the eligibility of a single booster dose of the Moderna and Pfizer-BioNTech COVID-19 vaccines to individuals 18 years of age and older.”\n\nDr. Paul Offit, director of the Vaccine Education Center at Children’s Hospital of Philadelphia, and an FDA advisory panel member took issue with how the FDA arrived at its decision.\n\nIn an email to The Epoch Times, Offit said, “I think it would have been of value for the public to hear an open discussion about the need for boosters. I wish we had had the chance to discuss this.”\n\nThe FDA said it did not hold a meeting because “the agency previously convened the committee for extensive discussions regarding the use of booster doses of COVID-19 vaccines and, after review of both Pfizer’s and Moderna’s [Emergency Use Authorization] requests, the FDA concluded that the requests do not raise questions that would benefit from additional discussion by committee members.”\n\nPfizer and BioNTech requested authorization last week after submitting the results of a phase 3 trial involving more than 10,000 participants.\n\nModerna resubmitted its application for its 50-microgram booster dose for all adults just two days ago. The company said the FDA based its decision on the “totality of scientific evidence shared by the company,” including data that showed neutralizing antibodies had waned at about six months.\n\nA 14-year-old Kentucky girl was mistakenly given J&J’s COVID vaccine, which is not authorized for anyone under the age of 18, International Business Times reported.\n\nThe girl was given the jab on Oct. 16 at a vaccine drive-in at a high school in Covington.\n\nThe girl’s mother, Rolina Mason, said her daughter was reluctant to get vaccinated and wanted the J&J vaccine because it was only one dose. Mason agreed that the nurse could administer J&J, but didn’t realize it wasn’t authorized for use in children.\n\nMason said she trusted the nurse who told them that it was okay for her daughter to get it.\n\nThe health department contacted Mason a week later and informed her that her daughter should have received Pfizer’s COVID vaccine instead. Mason’s daughter reportedly experienced skin rashes after receiving the shot.\n\nStates bypass CDC, gave out COVID boosters to all adults before authorization\n\nState officials from California to Maine encouraged and allowed adult residents to get COVID vaccine boosters despite recommendations by the FDA and CDC to reserve the shots for elderly and high-risk groups, CNBC reported.\n\nCalifornia also told medical providers not to turn away any adults who requested a booster.\n\nArkansas, Colorado, Louisiana, Kansas, Kentucky, Maine, New Mexico, Vermont, and West Virginia are also promoting widespread rollout of boosters for any fully vaccinated adult, with governors in Colorado and New Mexico signing executive orders a week before the FDA authorized the shots for the general population.\n\nGov. Jim Justice of West Virginia called for all adults in-state to get their boosters, adding that fully vaccinated residents would be “very foolish” not to register for the third dose.\n\nArkansas Gov. Asa Hutchinson said during a briefing Monday he wanted to make sure everybody 18 and over was eligible and encouraged to get a booster. Danyelle McNeill, a spokesperson for the Arkansas Department of Health, told CNBC in an email “the great majority of adults in Arkansas” were already considered high risk by the CDC before Hutchinson issued his recommendation.\n\nKentucky approved boosters for fully vaccinated adults on Wednesday, while Connecticut, Kansas, Louisiana, Maine, Massachusetts, and Vermont expanded their booster programs this week before the FDA and CDC signed off, today.\n\nSeveral children in California sick after receiving wrong COVID vaccine doses\n\nAt least two children in California are sick after a clinic administered the wrong doses of a COVID vaccine to 14 kids.\n\nDenise Iserloth said she took her two children, ages 8 and 11, to a clinic where they received 20 micrograms of dosage instead of the recommended 10 micrograms.\n\nSutter Health said in a statement it warned parents of the mistake as soon as they learned of it, and contacted parents to advise them of CDC guidance. But Iserloth said she wasn’t made aware of the error until 10 hours after her children were vaccinated.\n\nBoth of her children stayed home from school on Monday with bad stomach aches, and her oldest child fell down twice in the hours following the shot, Iseroth said.\n\n“I understand the mandate, I tried to comply with it, and my children now have been given a double dose and I don’t know the long-term side effects,” Iserloth said. “[…] It is unacceptable and negligent, completely negligent on their part.”\n\nCOVID hospitalizations on the rise among fully vaccinated\n\nCOVID hospitalizations and emergency room visits are on the rise among people who are fully vaccinated, according to Dr. Anthony Fauci, director of the National Institute for Allergy and Infectious Diseases.\n\n“What we’re starting to see now is an uptick in hospitalizations among people who’ve been vaccinated but not boosted,” Fauci said Tuesday. “It’s a significant proportion, but not the majority by any means.”\n\nIn a White House COVID-19 Response Team briefing Wednesday, Fauci stressed the importance of vaccines and highlighted how well they work. At the same panel, CDC Director Walensky reported a decline in vaccine effectiveness among the elderly and residents of long-term care facilities, many of whom were the first to be eligible to be vaccinated last winter.\n\nThe current seven-day rate of COVID hospital admissions is about 5,300 per day, according to the CDC.\n\nIt’s not clear how many hospitalizations are breakthrough cases as the agency stopped reporting hospitalizations among fully vaccinated people and its website shows data only through Aug. 28.\n\nCDC admits to not tracking data on natural immunity\n\nIn response to a Freedom of Information Act (FOIA) request, the CDC said it has no record of an individual previously infected with COVID becoming reinfected or transmitting the virus to others — because the agency doesn’t collect that data.\n\nThe FOIA request, submitted Sept. 2 by attorney Aaron Siri of the Siri & Glimstad law firm on behalf of the Informed Consent Action Network, sought documents reflecting any documented case of an individual who: (1) never received a COVID vaccine; (2) was infected with COVID once, recovered, and then later became infected again; and (3) transmitted SARS-CoV-2 to another person when reinfected.\n\n“A search of our records failed to reveal any documents pertaining to your request. The CDC Emergency Operations Center (EOC) conveyed that this information is not collected.”\n\nAccording to Siri, the revelation that the CDC does not collect data on people who have acquired natural immunity to the virus raises questions about vaccine mandates, specifically how the government or employers can mandate vaccines for people who may not need them and who could be at a greater-than-average risk of experiencing an adverse reaction to the shots.\n\nChildren’s Health Defense asks anyone who has experienced an adverse reaction, to any vaccine, to file a report following these three steps.", "opengraph": {"locale": "en_US", "type": "article", "title": "As Reports of Injuries After COVID Vaccines Near 1 Million Mark, CDC, FDA Clear Pfizer, Moderna Boosters for All Adults", "description": "VAERS data released by the CDC included a total of 894,145 reports of adverse events from all age groups following COVID vaccines", "url": "http://consciouslifenews.com/as-reports-of-injuries-after-covid-vaccines-near-1-million-mark-cdc-fda-clear-pfizer-moderna-boosters-for-all-adults/11209618/", "site_name": "Conscious Life News", "article:author": "slykush2377", "article:tag": "COVID vaccines dangers", "article:section": "Hazards, Issues & Diseases", "article:published_time": "2021-11-21T05:00:23-08:00", "article:modified_time": "2021-11-20T18:13:35-08:00", "updated_time": "2021-11-20T18:13:35-08:00", "image": "https://consciouslifenews.com/wp-content/uploads/2021/11/covid-19-vaccine-vial-bottles.jpg", "image:secure_url": "https://consciouslifenews.com/wp-content/uploads/2021/11/covid-19-vaccine-vial-bottles.jpg"}, "tags": ["COVID vaccines dangers", "COVID booster", "COVID vaccine injuries", "COVID booster shots", "COVID vaccines"], "tweets": [], "movies": [], "links": ["https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=CAT&EVENTS=ON&VAX=COVID19", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&SERIOUS=ON", "https://wonder.cdc.gov/wonder/help/vaers/VAERS%20Advisory%20Guide.htm", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&SERIOUS=ON&STATE=NOTFR", "https://consciouslifenews.com/stop-ear-ringing", "https://wonder.cdc.gov/wonder/help/vaers/VAERS%20Advisory%20Guide.htm", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&STATE=NOTFR&V2DCHECKED=ON&V2DHIGH=1", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&STATE=NOTFR&V2DCHECKED=ON&V2DHIGH=2", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&STATE=NOTFR&V2OCHECKED=ON&V2OLOW=0&V2OHIGH=2", "https://ourworldindata.org/grapher/covid-vaccine-doses-by-manufacturer?country=~USA", "https://consciouslifenews.com/hyperbolic-stretching", "https://childrenshealthdefense.org/defender/rfk-jr-david-kessler-covid-vaccine-vaers/", "https://digital.ahrq.gov/sites/default/files/docs/publication/r18hs017045-lazarus-final-report-2011.pdf", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&STATE=NOTFR&WhichAge=range&LOWAGE=5&HIGHAGE=12", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&SERIOUS=ON&STATE=NOTFR&WhichAge=range&LOWAGE=5&HIGHAGE=12", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes&STATE=NOTFR&WhichAge=range&LOWAGE=5&HIGHAGE=12", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&STATE=NOTFR&WhichAge=range&LOWAGE=5&HIGHAGE=12&VAX_YEAR_LOW=2021&VAX_MONTH_LOW=11&VAX_YEAR_HIGH=2021", "https://childrenshealthdefense.org/defender/fda-endorses-pfizer-covid-vaccine-children/", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&VAXTYPES=COVID-19&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&VAXTYPES=COVID-19&SERIOUS=ON&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&VAXTYPES=COVID-19&DIED=Yes&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1823671", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1828901", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1784945", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1815096", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Anaphylactic+reaction+%2810002198%29&SYMPTOMS[]=Anaphylactic+shock+%2810002199%29&SYMPTOMS[]=Anaphylactoid+reaction+%2810002216%29&SYMPTOMS[]=Anaphylactoid+shock+%2810063119%29&SYMPTOMS[]=Anaphylaxis+prophylaxis+%2810049090%29&SYMPTOMS[]=Anaphylaxis+treatment+%2810002222%29&VAX=COVID19&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Anaphylactic+reaction+%2810002198%29&SYMPTOMS[]=Anaphylactic+shock+%2810002199%29&SYMPTOMS[]=Anaphylactoid+reaction+%2810002216%29&SYMPTOMS[]=Anaphylactoid+shock+%2810063119%29&SYMPTOMS[]=Anaphylaxis+prophylaxis+%2810049090%29&SYMPTOMS[]=Anaphylaxis+treatment+%2810002222%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Myocarditis+%2810028606%29&SYMPTOMS[]=Pericarditis+%2810034484%29&VAX=COVID19&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Myocarditis+%2810028606%29&SYMPTOMS[]=Pericarditis+%2810034484%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS[]=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS[]=Coagulopathy+%2810009802%29&SYMPTOMS[]=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS[]=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS[]=Embolism+%2810061169%29&SYMPTOMS[]=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS[]=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS[]=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS[]=Ischaemic+stroke+%2810061256%29&SYMPTOMS[]=Myocardial+infarction+%2810028596%29&SYMPTOMS[]=Petechiae+%2810034754%29&SYMPTOMS[]=Pulmonary+embolism+%2810037377%29&SYMPTOMS[]=Purpura+%2810037549%29&SYMPTOMS[]=Thrombocytopenia+%2810043554%29&SYMPTOMS[]=Thrombosis+%2810043607%29&SYMPTOMS[]=Vasculitis+%2810047115%29&VAX=COVID19&STATE=NOTFR&WhichAge=range&LOWAGE=12&HIGHAGE=18", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX=COVID19&DIED=Yes", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=DIS&EVENTS=ON&SYMPTOMS[]=Abnormal+labour+%2810000153%29&SYMPTOMS[]=Abnormal+labour+affecting+foetus+%2810000154%29&SYMPTOMS[]=Aborted+pregnancy+%2810000209%29&SYMPTOMS[]=Abortion+%2810000210%29&SYMPTOMS[]=Abortion+complete+%2810061614%29&SYMPTOMS[]=Abortion+early+%2810052846%29&SYMPTOMS[]=Abortion+spontaneous+%2810000234%29&SYMPTOMS[]=Abortion+spontaneous+complete+%2810061616%29&SYMPTOMS[]=Abortion+spontaneous+incomplete+%2810061617%29&SYMPTOMS[]=Exposure+during+pregnancy+%2810073513%29&SYMPTOMS[]=Foetal-maternal+haemorrhage+%2810016871%29&SYMPTOMS[]=Foetal+cardiac+disorder+%2810052088%29&SYMPTOMS[]=Foetal+damage+%2810016852%29&SYMPTOMS[]=Foetal+death+%2810055690%29&SYMPTOMS[]=Foetal+disorder+%2810061157%29&SYMPTOMS[]=Foetal+distress+syndrome+%2810016855%29&SYMPTOMS[]=Foetal+exposure+during+pregnancy+%2810071404%29&SYMPTOMS[]=Foetal+growth+abnormality+%2810077582%29&SYMPTOMS[]=Foetal+heart+rate+abnormal+%2810051139%29&SYMPTOMS[]=Foetal+heart+rate+deceleration+%2810058322%29&SYMPTOMS[]=Foetal+heart+rate+deceleration+abnormality+%2810074636%29&SYMPTOMS[]=Foetal+heart+rate+decreased+%2810051136%29&SYMPTOMS[]=Foetal+heart+rate+disorder+%2810061158%29&SYMPTOMS[]=Foetal+heart+rate+increased+%2810051138%29&SYMPTOMS[]=Foetal+movement+disorder+%2810077576%29&SYMPTOMS[]=Foetal+movements+decreased+%2810016866%29&SYMPTOMS[]=Haemorrhage+%2810055798%29&SYMPTOMS[]=Haemorrhage+in+pregnancy+%2810018981%29&SYMPTOMS[]=Placental+calcification+%2810082008%29&SYMPTOMS[]=Placental+disorder+%2810035132%29&SYMPTOMS[]=Placental+insufficiency+%2810035138%29&SYMPTOMS[]=Placental+necrosis+%2810035139%29&SYMPTOMS[]=Placental+transfusion+syndrome+%2810035146%29&SYMPTOMS[]=Placenta+praevia+%2810035119%29&SYMPTOMS[]=Placenta+praevia+haemorrhage+%2810035121%29&SYMPTOMS[]=Pregnancy+test+positive+%2810036575%29&SYMPTOMS[]=Premature+baby+%2810036590%29&SYMPTOMS[]=Premature+baby+death+%2810076700%29&SYMPTOMS[]=Premature+delivery+%2810036595%29&SYMPTOMS[]=Premature+labour+%2810036600%29&SYMPTOMS[]=Premature+rupture+of+membranes+%2810036603%29&SYMPTOMS[]=Premature+separation+of+placenta+%2810036608%29&SYMPTOMS[]=Stillbirth+%2810042062%29&SYMPTOMS[]=Ultrasound+foetal+abnormal+%2810077578%29&SYMPTOMS[]=Ultrasound+uterus+abnormal+%2810064876%29&SYMPTOMS[]=Uterine+haemorrhage+%2810046788%29&SYMPTOMS[]=Uterine+rupture+%2810046820%29&VAX=COVID19&STATE=NOTFR", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Aborted+pregnancy+%2810000209%29&SYMPTOMS[]=Abortion+%2810000210%29&SYMPTOMS[]=Abortion+spontaneous+%2810000234%29&SYMPTOMS[]=Abortion+spontaneous+complete+%2810061616%29&SYMPTOMS[]=Abortion+spontaneous+incomplete+%2810061617%29&SYMPTOMS[]=Abortion+threatened+%2810000242%29&SYMPTOMS[]=Foetal-maternal+haemorrhage+%2810016871%29&SYMPTOMS[]=Foetal+cardiac+disorder+%2810052088%29&SYMPTOMS[]=Foetal+damage+%2810016852%29&SYMPTOMS[]=Foetal+death+%2810055690%29&SYMPTOMS[]=Foetal+disorder+%2810061157%29&SYMPTOMS[]=Foetal+distress+syndrome+%2810016855%29&SYMPTOMS[]=Foetal+heart+rate+abnormal+%2810051139%29&SYMPTOMS[]=Foetal+heart+rate+deceleration+%2810058322%29&SYMPTOMS[]=Foetal+heart+rate+deceleration+abnormality+%2810074636%29&SYMPTOMS[]=Foetal+heart+rate+decreased+%2810051136%29&SYMPTOMS[]=Foetal+heart+rate+disorder+%2810061158%29&SYMPTOMS[]=Foetal+heart+rate+increased+%2810051138%29&SYMPTOMS[]=Foetal+hypokinesia+%2810068461%29&SYMPTOMS[]=Foetal+malformation+%2810060919%29&SYMPTOMS[]=Foetal+malpresentation+%2810058013%29&SYMPTOMS[]=Foetal+monitoring+abnormal+%2810071507%29&SYMPTOMS[]=Foetal+movement+disorder+%2810077576%29&SYMPTOMS[]=Foetal+movements+decreased+%2810016866%29&SYMPTOMS[]=Foetal+non-stress+test+abnormal+%2810071516%29&SYMPTOMS[]=Placental+disorder+%2810035132%29&SYMPTOMS[]=Pregnancy+induced+hypertension+%2810036563%29&SYMPTOMS[]=Premature+baby+%2810036590%29&SYMPTOMS[]=Premature+baby+death+%2810076700%29&SYMPTOMS[]=Premature+delivery+%2810036595%29&SYMPTOMS[]=Premature+labour+%2810036600%29&SYMPTOMS[]=Premature+rupture+of+membranes+%2810036603%29&SYMPTOMS[]=Premature+separation+of+placenta+%2810036608%29&SYMPTOMS[]=Stillbirth+%2810042062%29&SYMPTOMS[]=Ultrasound+foetal+abnormal+%2810077578%29&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Bell%27s+palsy+%2810004223%29&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Bell%27s+palsy+%2810004223%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Bell%27s+palsy+%2810004223%29&VAX=COVID19&VAXMAN=MODERNA&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Bell%27s+palsy+%2810004223%29&VAX=COVID19&VAXMAN=JANSSEN&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Guillain-Barre+syndrome+%2810018767%29&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Guillain-Barre+syndrome+%2810018767%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Guillain-Barre+syndrome+%2810018767%29&VAX=COVID19&VAXMAN=MODERNA&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS=Guillain-Barre+syndrome+%2810018767%29&VAX=COVID19&VAXMAN=JANSSEN&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Anaphylactic+reaction+%2810002198%29&SYMPTOMS[]=Anaphylactic+shock+%2810002199%29&SYMPTOMS[]=Anaphylactoid+reaction+%2810002216%29&SYMPTOMS[]=Anaphylactoid+shock+%2810063119%29&SYMPTOMS[]=Anaphylaxis+prophylaxis+%2810049090%29&SYMPTOMS[]=Anaphylaxis+treatment+%2810002222%29&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS[]=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS[]=Coagulopathy+%2810009802%29&SYMPTOMS[]=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS[]=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS[]=Embolism+%2810061169%29&SYMPTOMS[]=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS[]=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS[]=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS[]=Ischaemic+stroke+%2810061256%29&SYMPTOMS[]=Myocardial+infarction+%2810028596%29&SYMPTOMS[]=Petechiae+%2810034754%29&SYMPTOMS[]=Pulmonary+embolism+%2810037377%29&SYMPTOMS[]=Purpura+%2810037549%29&SYMPTOMS[]=Thrombocytopenia+%2810043554%29&SYMPTOMS[]=Thrombosis+%2810043607%29&SYMPTOMS[]=Vasculitis+%2810047115%29&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS[]=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS[]=Coagulopathy+%2810009802%29&SYMPTOMS[]=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS[]=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS[]=Embolism+%2810061169%29&SYMPTOMS[]=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS[]=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS[]=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS[]=Ischaemic+stroke+%2810061256%29&SYMPTOMS[]=Myocardial+infarction+%2810028596%29&SYMPTOMS[]=Petechiae+%2810034754%29&SYMPTOMS[]=Pulmonary+embolism+%2810037377%29&SYMPTOMS[]=Purpura+%2810037549%29&SYMPTOMS[]=Thrombocytopenia+%2810043554%29&SYMPTOMS[]=Thrombosis+%2810043607%29&SYMPTOMS[]=Vasculitis+%2810047115%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS[]=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS[]=Coagulopathy+%2810009802%29&SYMPTOMS[]=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS[]=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS[]=Embolism+%2810061169%29&SYMPTOMS[]=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS[]=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS[]=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS[]=Ischaemic+stroke+%2810061256%29&SYMPTOMS[]=Myocardial+infarction+%2810028596%29&SYMPTOMS[]=Petechiae+%2810034754%29&SYMPTOMS[]=Pulmonary+embolism+%2810037377%29&SYMPTOMS[]=Purpura+%2810037549%29&SYMPTOMS[]=Thrombocytopenia+%2810043554%29&SYMPTOMS[]=Thrombosis+%2810043607%29&SYMPTOMS[]=Vasculitis+%2810047115%29&VAX=COVID19&VAXMAN=MODERNA&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Cerebral+venous+sinus+thrombosis+%2810083037%29&SYMPTOMS[]=Cerebral+venous+thrombosis+%2810008138%29&SYMPTOMS[]=Coagulopathy+%2810009802%29&SYMPTOMS[]=Deep+vein+thrombosis+%2810051055%29&SYMPTOMS[]=Disseminated+intravascular+coagulation+%2810013442%29&SYMPTOMS[]=Embolism+%2810061169%29&SYMPTOMS[]=Idiopathic+thrombocytopenic+purpura+%2810021245%29&SYMPTOMS[]=Immune+thrombocytopenia+%2810083842%29&SYMPTOMS[]=Immune+thrombocytopenic+purpura+%2810074667%29&SYMPTOMS[]=Ischaemic+stroke+%2810061256%29&SYMPTOMS[]=Myocardial+infarction+%2810028596%29&SYMPTOMS[]=Petechiae+%2810034754%29&SYMPTOMS[]=Pulmonary+embolism+%2810037377%29&SYMPTOMS[]=Purpura+%2810037549%29&SYMPTOMS[]=Thrombocytopenia+%2810043554%29&SYMPTOMS[]=Thrombosis+%2810043607%29&SYMPTOMS[]=Vasculitis+%2810047115%29&VAX=COVID19&VAXMAN=JANSSEN&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Myocarditis+%2810028606%29&SYMPTOMS[]=Pericarditis+%2810034484%29&VAX=COVID19&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Myocarditis+%2810028606%29&SYMPTOMS[]=Pericarditis+%2810034484%29&VAX=COVID19&VAXMAN=PFIZER/BIONTECH&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Myocarditis+%2810028606%29&SYMPTOMS[]=Pericarditis+%2810034484%29&VAX=COVID19&VAXMAN=MODERNA&STATE=NOTFR", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&SYMPTOMS[]=Myocarditis+%2810028606%29&SYMPTOMS[]=Pericarditis+%2810034484%29&VAX=COVID19&VAXMAN=JANSSEN&STATE=NOTFR", "https://www.rollcall.com/2021/11/17/fda-to-sidestep-advisers-on-boosters-for-all-approval/", "https://childrenshealthdefense.org/defender/fda-authorizes-pfizer-booster-65-older-high-risk/", "https://www.cnbc.com/2021/11/19/cdc-panel-unanimously-endorses-pfizer-and-moderna-boosters-for-all-us-adults.html", "https://www.dailymail.co.uk/health/article-10221459/FDA-authorizes-booster-shots-Pfizers-Modernas-COVID-19-vaccines-adults.html", "https://www.cnbc.com/2021/11/19/fda-clears-modernas-covid-vaccine-booster-shots-for-all-us-adults.html", "https://www.theepochtimes.com/mkt_breakingnews/fda-authorizes-moderna-pfizer-covid-19-vaccine-boosters-for-all-adults_4113551.html", "https://www.cnn.com/2021/11/19/health/covid-vaccine-boosters-fda-cdc/index.html", "https://www.rollcall.com/2021/11/17/fda-to-sidestep-advisers-on-boosters-for-all-approval/", "https://www.cnn.com/2021/11/19/health/covid-vaccine-boosters-fda-cdc/index.html", "https://www.ibtimes.com/14-year-old-kentucky-girl-receives-covid-jab-not-approved-under-18-3341195", "https://www.cnbc.com/2021/11/18/covid-boosters-states-are-already-telling-all-adults-to-get-third-shots.html", "https://www.foxnews.com/us/california-children-sick-wrong-covid-vaccine-dose", "https://www.nbcnews.com/health/health-news/hospitalizations-rising-fully-vaccinated-us-fauci-says-rcna5907", "https://www.amazon.com/Real-Anthony-Fauci-Democracy-Childrens/dp/1510766804", "https://www.whitehouse.gov/briefing-room/press-briefings/2021/11/17/press-briefing-by-white-house-covid-19-response-team-and-public-health-officials-68/", "https://www.nbcnews.com/health/health-news/hospitalizations-rising-fully-vaccinated-us-fauci-says-rcna5907", "https://childrenshealthdefense.org/defender/21-year-old-shawn-kuhn-fully-vaccinated-student-dies-covid/", "https://covid.cdc.gov/covid-data-tracker/#covidnet-hospitalizations-vaccination", "https://childrenshealthdefense.org/defender/cdc-data-natural-immunity-covid/", "https://www.sirillp.com/wp-content/uploads/2021/11/21-02152-Final-Response-Letter-Brehm-1.pdf", "https://www.sirillp.com/wp-content/uploads/2021/11/21-02152-Final-Response-Letter-Brehm-1.pdf", "https://childrenshealthdefense.org/defender/cdc-data-natural-immunity-covid/", "https://childrenshealthdefense.org/", "https://childrenshealthdefense.org/defender/injured-by-vaccine-how-to-report-it/", "https://childrenshealthdefense.org/authors/megan-redshaw/"], "authors": [], "publish_date": "2021-11-21T05:00:23-08:00"}