{"result_id": "078044", "URL": "https://consciouslifenews.com/analysis-what-vanden-bossche-got-right-and-wrong-about-mass-vaccination/11202805/?print=print", "timestamp": "2023-04-25 14:48:39 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://consciouslifenews.com/analysis-what-vanden-bossche-got-right-and-wrong-about-mass-vaccination/11202805/?print=print", "encoding": null}, "image": null, "domain": "consciouslifenews.com", "title": "Analysis: What Vanden Bossche Got Right — and Wrong — About Mass Vaccination - Conscious Life News", "cleaned_text": "Let’s now look at some of the areas where Dr. Vanden Bossche might be pushing the envelope:\n• To be so sure that vaccine or immune escape will drive increasingly more virulent variants of the virus is a big leap. To posit this as a possibility more than a near certainty might seem more plausible. Even more so, devoting effort to the identification of markers of immune or vaccine escape, rather than making the overt claim that the current variants (that are not greatly more virulent, although are definitely more transmissible than earlier circulating epitopes) are direct proof of this.\n• One of the emerging reasons for transmission or severe disease could be related to ineffective vaccination, rather than vaccine escape, caused by batch quality issues. This problem, in relation to the Pfizer vaccine, has been publicized in The BMJ courtesy of leaked documents.\n• To argue that NK cells are the only cellular means of eliminating the virus is an over-simplification, given there is ample evidence that there are other aspects of the innate immune system, such as the role of macrophages and dendritic cells, as well as the activation of the adaptive immune system that has been demonstrated to work together akin to an orchestra in the management of infection in humans, as well as in the co-evolution of host-viral interactions. Let’s not forget that viruses aren’t, most of the time, the bad guys. They’ve been a dominant driver of our species’ evolution since time immemorial and despite the fact that some cause disease, they are overwhelmingly helpful in the long-run despite their tendency to share their genetic material with their host and infiltrate our genome.\n• Dr. Vanden Bossche, with his focus on NK cells, over-simplifies the complexity of the immune response that is unique both to different individuals and pathogen variants. He does not appear to adequately recognize the unclear nature of human/SARS-CoV-2 virus interactions in different population groups.\n• Vaccine resistance is the exception rather than the rule and has been found in a minority of vaccines targeting human pathogens (just 12). However, as Vanden Bossche argues, the circumstances are unique and one or more of the three predisposing factors for vaccine resistance are likely to be met in the case of COVID-19 and the associated mass vaccination strategy. This suggests that Vanden Bossche’s concerns are scientifically legitimate and are worthy of tight monitoring.\n• Experimental NK cell-based vaccines are far from the only way of enhancing the cytotoxic function of NK cells. Ironically — and much more well demonstrated — are dietary and lifestyle-mediated approaches to enhance innate immune function as part of a prevention strategy. Vitamin D, vitamin C, zinc, beta-glucans, and exercise are just some nutrients that have been found to act as immune modulators enhancing NK cell function.\n• NK cell-based vaccines are not currently on ‘the list of next-generation COVID-19 vaccine platforms. They should therefore be regarded as more experimental than mRNA, non-replicating viral vector or protein subunit vaccines that have been in development at least for a few years, their development being massively accelerated by the current pandemic. It may be unrealistic to consider that NK cell-based vaccines could be developed quickly enough to make a difference to the shape of the pandemic — although Dr. Vanden Bossche argues the development would be a lot quicker than for the current crop of frontrunner vaccines because such vaccines are considerably simpler.\n\nVaccine resistance is already targeted as a weak point by the establishment. Speaking of prophets, I need to mention, albeit belatedly, Heidi Larson, Professor of Anthropology, Risk and Decision Science at the Department of Infectious Disease Epidemiology at the UK’s London School of Hygiene & Tropical Medicine, also the founder and Director of the Vaccine Confidence Project, and author of the book “Stuck: How Vaccine Rumors Start ― and Why They Don’t Go Away” (2020, Oxford University Press). The book was completed just before the pandemic broke yet it anticipated a time when vaccine confidence was more central to public health strategy than most could have imagined. As they say: it’s all about timing. Dr. Larson has now found her moment, as well as many admirers.\n\nOne of them is political scientist J. Stephen Morrison, Ph.D., senior vice president and director of the Global Health Policy Center, in Washington DC. Check out what he had to say about Dr. Larson’s assertions, including about vaccine resistance:\n\n“Vaccine resistance fits perfectly into populist agendas,” Larson notes. Especially in moments of heightened political anxiety and stress, “digital wildfires” can ignite, unforeseen, disrupting immunization campaigns and spreading emotional contagion across “global highways.” Social media “swarms” then leapfrog media platforms and continents, rapidly imposing a toll on the health of millions. “When populism and polarization drive a wedge into the heart of democracy, and vaccine decisions are politicized, immunity suffers.”\n\nGeert Vanden Bossche doesn’t mention any prophylactic alternatives to vaccines. His central argument is around ‘immune escape’ risks that may arise as a result of current antigen-based vaccine strategies, lockdowns, and social isolation. He is thus feeding the flames of vaccine hesitancy in relation to the current crop of antigen-based vaccines. Ironically, he makes the subsidiary point that another type of vaccine may resolve the crisis.\n\nFor those grasping at scientific arguments to underpin their distrust of the mass vaccination program, Geert Vanden Bossche may have provided an imperfect but nonetheless useful articulation of the problem. For me, his assertions are overly emphatic and insufficiently evidence-based given the uncertainty and complexity of the science involved.\n\nIt’s a tough ask to try to predict what might happen as a result of Dr. Vanden Bossche’s outpourings. If I was a betting man, I’d say very little. Why? Just like with the Lockdown Skeptics or the Great Barrington scientists, the latter now supported by over 750,000 citizens, nearly 14,000 medical and public health scientists, and almost 42,000 medical practitioners, ‘the system‘ really knows how to prevent the bomb going off. It’s called doing nothing — simply not engaging.\n\nWith propagandist media, heavily censored social media, and near-police states in operation, there’s never been a better time to ignore dissenters.\n\nAs I alluded to earlier, if we see a dramatic ‘third wave’ later in 2021 and that includes a significant number of vaccinated individuals, Geert Vanden Bossche may well be vindicated.\n\nWill the WHO and ‘the establishment’ rush to him to deliver his NK cell-based vaccines to save the world? Probably not.\n\nMight he get funding to work with biotech companies to further explore the potential of NK cell-based vaccines? My view is he might have a lesser, not a greater, chance of being invited into the fold after being perceived as a prostitute to the skeptics of the mainstream narrative.\n\nHas he justified his arguments with enough plausible science? No, in my view. Is there a chance that some of his assertions will be proven right? Yes, again in my view (as I’ve argued above).\n\nI want to finish by saying I have the greatest respect for any scientist who wears his scientific views and emotions on his sleeve. Geert Vanden Bossche clearly has passion. It is a travesty of the currently dominant scientific narrative that Vanden Bossche can’t open the doors of the WHO or the Gates Foundation, both of which he’s worked with previously, and have an in-depth discussion about his concerns.\n\nChances are there is some kind of back story. Possibly one that wouldn’t work in Dr. Vanden Bossche’s favor if it was accessible in the public domain. But, equally, it could also be linked to ideological differences. Could the mainstream vaccine establishment’s disinterest in NK cell-based vaccines be down to the fact that they would be akin to a magic bullet? Being polyspecific, you wouldn’t need to have lots of different vaccines.\n\nIn fact, if they didn’t like the idea of polyspecific NK cell-based vaccines, Vanden Bossche would find himself in much the same place as those of us who promote the importance of natural therapies, nutrients, or lifestyle modifications to help modulate immune systems.\n\nAll things the patent-hungry, ‘business with disease’ system doesn’t consider to be part of a viable or profitable business model.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/defender/pfizer-covid-vaccine-questions-safety/", "https://www.bmj.com/content/372/bmj.n627", "https://childrenshealthdefense.org/defender/regulators-major-concerns-pfizers-mrna-vaccine/", "https://www.nature.com/articles/nri2802", "https://elifesciences.org/articles/12469", "https://www.pbs.org/wgbh/nova/article/endogenous-retroviruses/", "https://www.thelancet.com/article/S0140-6736(20)31976-0/fulltext", "https://www.sciencedirect.com/science/article/pii/S0264410X19308916", "https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3001000&utm_source=ground.news&utm_medium=referral", "https://search.proquest.com/openview/88b82f994e525fe8c381a8bddd0d6bb4/1?pq-origsite=gscholar&cbl=2032353", "https://www.mdpi.com/2076-3921/7/3/41", "https://www.nature.com/articles/nri3174", "https://journals.physiology.org/doi/full/10.1152/ajpregu.00304.2003", "https://www.nature.com/articles/s41563-020-0746-0?fbclid=IwAR0dUHeqq9dWatZYUvEft6ffiietT7t0tRAgNaW8efUMCJncnm5UcFob3kw", "https://www.lshtm.ac.uk/aboutus/people/larson.heidi", "https://www.vaccineconfidence.org/", "https://www.amazon.co.uk/Stuck-Vaccine-Rumors-Start-They/dp/0190077247/ref=sr_1_1?adgrpid=118090251328&dchild=1&gclid=Cj0KCQjw0caCBhCIARIsAGAfuMw4PImei3yG7cSGgMK4-RpW9cm--OcJODm1Bnd_NP4Xw8RvwAVoA1MaAg5ZEALw_wcB&hvadid=477092223820&hvdev=c&hvlocphy=1006753&hvnetw=g&hvqmt=b&hvrand=12586985103647454545&hvtargid=kwd-1035324696179&hydadcr=24398_1748851&keywords=stuck+larson&qid=1616022931&sr=8-1", "https://www.csis.org/people/j-stephen-morrison", "https://childrenshealthdefense.org/defender/covid-vaccine-hesitancy-widespread-medical-professionals/", "https://www.lockdownsceptics.org/", "https://gbdeclaration.org/", "https://childrenshealthdefense.org/defender/white-house-enlists-social-media-suppress-vaccine-misinformation/", "https://childrenshealthdefense.org/defender/gates-planned-social-media-censorship-vaccine-safety/", "https://childrenshealthdefense.org/defender/wsj-facebook-censorship-scientific-debate/", "https://childrenshealthdefense.org/news/bill-gates-fortune-grows-ties-vaccine-makers/", "https://www.anhinternational.org/news/anh-intl-feature-geert-vanden-bossche-conspiracy-theorist-conspirator-or-prophet/"], "authors": [], "publish_date": null}