{"result_id": "079035", "URL": "https://conspiracydailyupdate.com/2016/06/page/2/", "timestamp": "2023-04-25 14:49:40 CEST+0200", "meta": {"description": "25 posts published by Brian Robert Hyland during June 2016", "lang": "en", "keywords": "", "favicon": "https://conspiracydailyupdate.files.wordpress.com/2017/06/cropped-featured3-1.jpg?w=32", "canonical": "https://conspiracydailyupdate.com/2016/06/page/2/", "encoding": "UTF-8"}, "image": null, "domain": "conspiracydailyupdate.com", "title": "Jun 2016 – Page 2 – Conspiracy Daily Update", "cleaned_text": "An historical announcement was made to mankind by peace-loving extraterrestrial civilizations.\n\nWith this announcement a new era begins in human history.\n\nMankind sets out to become part of the cosmic society that lives in peace and harmony!\n\nStarting on this day, the extraterrestrial civilizations offer every single person to get in touch with them.\n\nMore than 100 people have already engaged in advance as part of so called Extraterrestrial Contact – Initial meetings establishing their individual initial contact with representatives of this civilizations.\n\nThese non-public events for a selected audience were held in Germany on April, 16th. -17th, May 14th. -15th. and June, 11th. -12th., 2016.\n\nParticipants included amongst others engineers, University professors, and people with a scientific background. Several young people also took part.\n\nThese events and wonderful individual Initial contacts with representatives of this peaceful extraterrestrial civilizations were overwhelming and will remain unforgotten for all concerned.\n\nContact with these civilizations will remain intact for each Individual participant after these events if they so wish and have since continued very intensively and further developed.\n\nIn the context of these two-day events, participants have been thoroughly prepared for this initial contact and gently accompanied and looked after by experienced telepaths.\n\nWorldwide there is already a large number of telepaths who in part – though not yet publicly known – have been in close contact with these civilizations for many years now.\n\nOver the coming weeks and months, more and more of these telepaths will come forward and are happy to accompany people on their way into the New Age and supporting them in individual initial contacts. Contacts and address details in your country will be gradually be published on this website.\n\nA few days after the promulgation of the message we will – initially in the German-speaking area – start inviting scientists and media representatives to enable an individual initial contact. These initial contacts are prepared and coordinated with the extraterrestrial civilizations.\n\nContacts with extraterrestrial civilizations are for the benefit of all mankind.\n\nThe time has come now, where extraterrestrial civilizations hold out their hands and offer all people to make contact with them.\n\nIt is the time, humanity enters into a new, wonderful era characterised by peace and harmony.\n\nIt is the time, where humanity enters the cosmic society!", "opengraph": {"type": "website", "title": "Jun 2016 – Page 2 – Conspiracy Daily Update", "site_name": "Conspiracy Daily Update", "image": "https://conspiracydailyupdate.files.wordpress.com/2017/06/cropped-featured3-1.jpg?w=200", "image:width": "200", "image:height": "200", "locale": "en_GB"}, "tags": ["MANMADE EPIDEMIC", "vaxxed", "raqqah", "invisible force field", "mit", "announcement", "British Medical Journal", "message to mankind", "Clinton Cash", "dwarka", "greg little", "magnetic pole shift"], "tweets": [], "movies": [], "links": ["https://conspiracydailyupdate.com/2016/06/21/message-to-mankind/#more-2871"], "authors": [], "publish_date": "Jun 22, 2016"}