{"result_id": "079017", "URL": "https://conspiracydailyupdate.com/category/_investigations/vaccinehorror/dtap-vaccine-causes-autism/", "timestamp": "2023-04-25 14:49:15 CEST+0200", "meta": {"description": "Posts about DTap Vaccine (Causes Autism) written by Brian Robert Hyland", "lang": "en", "keywords": "", "favicon": "https://conspiracydailyupdate.files.wordpress.com/2017/06/cropped-featured3-1.jpg?w=32", "canonical": "https://conspiracydailyupdate.com/category/_investigations/vaccinehorror/dtap-vaccine-causes-autism/", "encoding": "UTF-8"}, "image": null, "domain": "conspiracydailyupdate.com", "title": "DTap Vaccine (Causes Autism) – Conspiracy Daily Update", "cleaned_text": "For many years, public health advocates have vainly urged the CDC and WHO to conduct studies comparing vaccinated vs. unvaccinated populations to measure overall health outcomes. Now a team of Scandinavian scientists has conducted such a study and the results are alarming. That study, funded in part by the Danish government and lead by Dr. Soren Wengel Mogensen, was published in January in EBioMedicine. Mogensen and his team of scientists found that African children inoculated with the DTP (diphtheria, tetanus and pertussis) vaccine, during the early 1980s had a 5-10 times greater mortality than their unvaccinated peers.\n\nThe data suggest that, while the vaccine protects against infection from those three bacteria, it makes children more susceptible to dying from other causes.\n\nThe scientists term the study a “natural experiment” since a birthday-based vaccination system employed for the Bandim Health Project (BHP) in Guinea Bissau, West Africa had the effect of creating a vaccinated cohort and a similarly situated unvaccinated control group. In the time period covered by this study, Guinea-Bissau had 50% child mortality rates for children up to age 5. Starting in 1978, BHP health care workers contacted pregnant mothers and encouraged them to visit infant weighing sessions provided by a BHP team every three months after their child’s birth. Beginning in 1981, BHP offered vaccinations at the weighing sessions. Since the DPT vaccine and OPV (oral polio) immunizations were offered only to children who were at least three months of age at the weighing sessions, the children’s random birthdays allowed for analysis of deaths between 3 and 5 months of age depending on vaccination status. So, for example, a child born on January 1st and weighed on April 1st would be vaccinated, but a child born on February 1st would not be vaccinated until their following visit at age 5 months on July 1st…\n\nSource: Study Finds DTP Vaccine Increases Mortality In Young Infants 5 To 10 Fold Compared To Unvaccinated Infants – Collective Evolution", "opengraph": {"type": "website", "title": "DTap Vaccine (Causes Autism) – Conspiracy Daily Update", "url": "https://conspiracydailyupdate.com/category/_investigations/vaccinehorror/dtap-vaccine-causes-autism/", "site_name": "Conspiracy Daily Update", "image": "https://conspiracydailyupdate.files.wordpress.com/2017/06/cropped-featured3-1.jpg?w=200", "image:width": "200", "image:height": "200", "locale": "en_GB"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.collective-evolution.com/2017/04/24/new-study-finds-dtp-vaccine-increases-mortality-in-young-infants-5-to-10-fold-compared-to-unvaccinated-infants/", "http://www.ebiomedicine.com/article/S2352-3964(17)30046-4/fulltext", "http://www.bandim.org/", "http://www.collective-evolution.com/2017/04/24/new-study-finds-dtp-vaccine-increases-mortality-in-young-infants-5-to-10-fold-compared-to-unvaccinated-infants/"], "authors": [], "publish_date": "May 22, 2017"}