{"result_id": "079019", "URL": "https://conspiracydailyupdate.com/opinion-page/", "timestamp": "2023-04-25 14:49:18 CEST+0200", "meta": {"description": "5G is an Area Denial Weapons System - a DEATH RAY. In Joe M's description on Youtube he says he is not JFK jr ~ so many things that will be interesting to find out! He is not JFK Jr because his father is deceased. He is now JFK! \"i heard the same thing about…", "lang": "en", "keywords": "", "favicon": "https://conspiracydailyupdate.files.wordpress.com/2017/06/cropped-featured3-1.jpg?w=32", "canonical": "https://conspiracydailyupdate.com/opinion-page/", "encoding": "UTF-8"}, "image": null, "domain": "conspiracydailyupdate.com", "title": "Brian’s Tidbits", "cleaned_text": "In Joe M’s description on Youtube he says he is not JFK jr ~ so many things that will be interesting to find out! He is not JFK Jr because his father is deceased. He is now JFK!\n\n“i heard the same thing about micheal jackson. i was a teenager when they say he died in 1984. i can believe it because 1985 1986 michael wasn’t doing interviews. all of a sudden janet comes out with a smash album named control. micheals looks started changing. he kept getting lighter and lighter.i think that the real michael jackson’s handlers knew all along that the man they wanted all along for michaels imposter was a white man. so on purpose each imposter got lighter and lighter until they presented their frontman michael jackson. real name frank jespin. from michigan. that explains the weird behaviour from michael. it wasnt micheal!!! during the child molestation charges, they used another imposter. so that the frontman fake white michael jackson could pass lie detector tests. the real child molester of those boys never came to court.” – wanda sapp\n\nWin Keech’s New financial exchange app is going to crowd sourcing.\n\nThe queen has been brought back to life because the ruling elites don’t want charles in charge.\n\n“A Because we need the American people to join in this fight. Do you want our children targeted, raped, damaged? Do we want our politicians belonging to some Saudi, or some Israeli extortionist? Do we want our politicians to be owned by Goldman Sachs? Do you want your daughter to end up alone with a Jeffery Epstein, Alan Dershowitz, or Anthony Wiener?”\n\nDunford has been managing the GESARA transition from the shadows for almost two years now. Which includes military watch over the Trump Administration for the Chinese Elders.\n\nThe RV will commence on General Dunford’s command post Trump inauguration and complete before the beginning of the Chinese New Year 1/28/17 per orders from the Elders.\n\nThe rothschilds are from an older model of human, The Neanderthals. They do not have the brain structures for compassion or change. Too much reptilian DNA I imagine. We are a younger model, descended from Cro Magnon Man with less reptilian DNA?.\n\nThe threats to Donald Trump over the next two days are of such caliber that, according to Russian sources, the tycoon has sent the message in the Davos forum to Putin that “I do not know if I’ll live next week : But if I do, I will end these bastards and everyone will win!”\n\nThat sounds like a negative parasite is hanging around. when you hear the ringing in the left ear it is a warning(Law of One). Barbara Marciniak says to shield yourself at least six times a day. When I hear the ringing I find that I am out of balance. Generally on the left side. Like now, there is a burning sensation as if they are beaming something at me. I go into meditation and centre myself, then shield from the heart. Don’t forget your loved ones too. They seem to load up negative energy while they buzz. It then seems to explode somewhere around me(kids, family, randoms…) If I can stay in love through the whole thing then it passes, and the energy return is good. If they fail they lose energy. If they can’t get a reaction they there is no reason for them to stay. Send them love and compassion and they will leave, I have heard:-) IMHO\n\nThe dark satanic force has joined forces with the AI. This is what we are up against now.\n\nThe structure of the universe is a fractal hologram of the asymmetric geometry of the photon. – David Wilcock – Gaia\n\nWe are two years into the tribulation out of the bible. The ride has got too rough, so they are cutting it short. 14Jan17 is when Freewill is being removed.(-Kent Dunn) What does that mean? Freewill allows us to make unloving actions and therefore accrue Karma “Voltage”. Too much voltage loss and we lose our ability to hang onto the body we are in. Too much voltage loss and you could find yourself on the other side unable to pick up another human body until you raise your voltage again through animal or plant kingdom lives. Every abuser loses voltage to the abused when they act unloving. So make every moment a loving thought!\n\nWe are all counting down until the 20th Trump Inauguration. Then we will see some heads roll!\n\nTHE NEW GOLDEN AGE HAS BEGUN!!!\n\nBad behaviour is like a viral infection, It infects all of the relationships that it is present in.\n\nThe next ascension energy wave event is due on the 14Jan. Freewill will be removed. Time to choose a side, STO or STS. Service to Others vs Service to Self. We are heading towards The bifurcation, choose a side, choose a destination! The dark are going elsewhere! – Kent Dunn\n\nAlien Arrival FEB 2017. Healing Ships coming out of antartica – 8 mins to completely heal you. – Kent Dunn\n\nproject staquake. gamma ray burst to remove the Dark Forces and AI from this star system. started 26th Dec 2017.\n\n7/1/2017 Wow. Energy wave is hitting us now. The Ascension Ride.\n\nThe victory of the light is occurring according to ‘The Plan’. As soon as this plan began, the result was predetermined. The last stages of the plan that we are in now is very fluid. Every move of the dark is being countered. – Kent Dunn\n\nZap says that the next big meeting will occur on 16 Jan 2017. After that there will be no going back.\n\nKent Dunn doesn’t expect anything much to happen before Feb 2017.\n\nWe are all waiting for Trump to take office on the 20th Jan 2017. He has an executive order in his pocket waiting to be signed invalidating all executive orders signed while Obama was in office. via Larrabee\n\nAll of the dark must be brought into the light for the healing to occur.\n\nIt all hangs on Aleppo! then we will have it all.\n\nForgiveness is the way through this thing we are doing together.\n\nWhat is really going on in Syria? ET’s? underground bases? What stories will the liberated Aleppoeans have to tell us?\n\n– The New York Times\n\n – The Washington Post\n\n – CNN\n\n – NBC News\n\n – MSNBC\n\n – CBS News\n\n – ABC News\n\n – Salon.com\n\n – The Huffington Post\n\n – Rolling Stone\n\n – BBC News\n\n – Sky News\n\n – Financial Times\n\n – Politico\n\n – New York Daily News\n\n – L.A. Times\n\n – USA Today\n\n – US News & World Report\n\n – CBC\n\n – Gawker\n\n – Newsweek\n\n – Time\n\n – Business Insider\n\n – Daily Beast\n\n – VICE\n\n – Yahoo News\n\n – Daily Kos\n\n – Young Turks\n\n – Slate\n\n – NPR\n\n – PBS\n\n – Raw Story\n\n – New Yorker\n\n – Buzzfeed\n\n – MoveOn\n\n – Think Progress\n\n – Media Matters\n\n – Wonkette\n\n – Center for American Progress\n\n – Little Green Footballs\n\n – The Economist\n\nTo all those that are suffering with depression, my heart goes out to you! I know what it is like. I just wanted to let everybody know that we are supposed to feel depressed, we’re slaves. When we are no longer slaves, we’ll be FREE!! I wonder how much depression we will see then?\n\nPresident Obama: “I will win the war on Christmas.” This sounds pretty ominous. What has he got planned that he thinks will win him the war on christmas day probably?\n\nWhen you include the ability to time travel into every event and every group, the ripples from tweaking an event would permeate throughout the universe throughout time. That means that at any moment, everything could change. It is probably why we feel like we have been wrenched back and forth, we probably have been.\n\nEvery year we have to work longer hours to afford the same things.\n\n16.11 It’s easy to have compassion for other people when you understand the true nature of the machine in which we live.\n\n30.10 Gratitude is the energic structure in which love can flow.\n\n26.10 [US Elections] “But hackers could post documents, some of which might be falsified”\n\nIf Hillary wins we will know that they control the system.\n\n25.10 The sun must be charging for a massive EMP blast to clear the AI threat from this solar system. I wonder what it will do to us?", "opengraph": {"type": "article", "title": "Brian’s Tidbits", "url": "https://conspiracydailyupdate.com/opinion-page/", "description": "5G is an Area Denial Weapons System – a DEATH RAY. In Joe M’s description on Youtube he says he is not JFK jr ~ so many things that will be interesting to find out! He is not JFK Jr bec…", "article:published_time": "2016-10-25T14:35:36+00:00", "article:modified_time": "2020-05-02T08:12:21+00:00", "site_name": "Conspiracy Daily Update", "image": "https://conspiracydailyupdate.files.wordpress.com/2016/10/img_20160629_195653-11.jpg?w=1200", "image:width": "1200", "image:height": "675", "locale": "en_GB", "article:publisher": "https://www.facebook.com/WordPresscom"}, "tags": [], "tweets": [], "movies": [], "links": ["https://conspiracydailyupdate.com/opinion-page/?share=facebook", "https://conspiracydailyupdate.com/opinion-page/?share=twitter", "https://conspiracydailyupdate.com/opinion-page/?share=pinterest", "https://conspiracydailyupdate.com/opinion-page/?share=tumblr"], "authors": [], "publish_date": "2016-10-25T14:35:36+00:00"}