{"result_id": "079020", "URL": "https://conspiracydailyupdate.com/2016/08/11/vaccine-quackery-bombshell-key-studies-cited-to-prove-vaccines-are-safe-were-funded-almost-entirely-by-vaccine-manufacturers-prepare-for-change/", "timestamp": "2023-04-25 14:49:19 CEST+0200", "meta": {"description": "August 9, 2016 by Edward Morgan Are you surprised by blatant scientific fraud anymore? Every informed person in the world today knows that everything is rigged: the money system, government grants, news media, polls and elections, medicine and even science. In fact, over the last two decades, most “science” has become nothing more than a…", "lang": "en", "keywords": "", "favicon": "https://conspiracydailyupdate.files.wordpress.com/2017/06/cropped-featured3-1.jpg?w=32", "canonical": "https://conspiracydailyupdate.com/2016/08/11/vaccine-quackery-bombshell-key-studies-cited-to-prove-vaccines-are-safe-were-funded-almost-entirely-by-vaccine-manufacturers-prepare-for-change/", "encoding": "UTF-8"}, "image": null, "domain": "conspiracydailyupdate.com", "title": "VACCINE QUACKERY BOMBSHELL: Key studies cited to ‘prove’ vaccines are safe were funded almost entirely by vaccine manufacturers – Prepare for Change", "cleaned_text": "And now, thanks to Brian Hooker and the Alliance for Natural Health USA, we have yet another bombshell example of the outright quackery and science fakery of the vaccine industry. What you read here will probably not surprise you, but to most people who believe the vaccine propaganda and lies of the criminal medical establishment, these realizations are nothing short of bombshells.\n\nScientists who are given loads of money by vaccine manufacturers just happen to conclude vaccines are always safe\n\nIn this critical review of the scientific literature on vaccines, ANH-USA and Brian Hooker carefully scrutinize the gross scientific flaws and blatant financial conflicts of interests that undermine the most commonly cited scientific studies which “prove” vaccines don’t cause autism. In a startling percentage of these studies, the “scientists” were either directly funded by vaccine manufacturers who stood to profit from vaccine safety whitewashing or served as highly paid expert witnesses to defend vaccine makers against lawsuits.\n\nWhat we really see in this critical review is a systemic pattern of scientific fraud, criminal corruption and the complete abandonment of research ethics in the relentless quest to “prove” vaccines are safe (and thereby sell more of them to more vaccine victims).\n\nHere, I’ve reprinted just a few of the descriptions from the ANH-USA analysis. Click here for the full paper.\n\nAs you read the highlights below, remind yourself that if vaccines are safe, then Hillary Clinton is a saint, chemical pesticides are good for you and mercury enhances brain function.\n\nNo evidence for measles, mumps, and rubella vaccine-associated inflammatory bowel disease or autism in a 14-year prospective study (1998)\n\n Authors: Peltola H, Patja A, Leinikki P, Valle M, Davidkin I, Paunio M.\n\nConflicts of interest: This study was funded by Merck, which makes the current formulation (MMR-II) of the measles, mumps, and rubella vaccine, and stands to profit from results that disprove any dangers.\n\nMumps, measles, and rubella vaccine and the incidence of autism recorded by general practitioners: a time trend analysis (2001)\n\n Authors: Kaye JA, del Mar Melero-Montes M, Jick H.\n\nConflicts of interest: The authors of this paper were residents at the Boston Collaborative Drug Surveillance Program at Boston University School of Medicine. This program is supported in part by grants from AstraZeneca, Berlex Laboratories, Boehringer Ingelheim Pharmaceuticals, Boots Healthcare International, Bristol-Myers Squibb Pharmaceutical Research Institute, GlaxoSmithKline, Hoffmann-La Roche, Janssen Pharmaceutica Products, RW Johnson Pharmaceutical Research Institute, McNeil Consumer Products, and Novartis Farmaceutica. Funding for their residency program is directly tied to those profiting from the vaccine companies their claims protect.\n\nConflicts of interest: Major MMR and MMR-II manufacturer Merck funded this study, and held a worldwide monopoly on these vaccines during the time of the research.\n\nPervasive developmental disorders in Montreal, Quebec, Canada: prevalence and links with immunizations (2006)\n\n Authors: Fombonne E, Zakarian R, Bennett A, Meng L, McLean-Heywood D.\n\nConflicts of Interest: The lead author of this study, Dr. Eric Fombonne, has significantconflicts of interest, as he has many times represented vaccine manufacturers as an expert witness in thimerosal litigation, opposing the families of vaccine injured children.\n\nAge at first measles-mumps-rubella vaccination in children with autism and school-matched control subjects: a population-based study in metropolitan Atlanta (2004)\n\n Authors: DeStefano F, Bhasin TK, Thompson WW, Yeargin-Allsopp M, Boyle C.\n\nConflicts of interest: Two of these individuals were employees of the National Immunization Program of the US Centers for Disease Control and Prevention (CDC), which is charged to increase immunization rates in the US in order to prevent outbreaks of infectious diseases. Thus there was a propensity against finding a causal relationship between vaccines and vaccine adverse events, which is demonstrated clearly in the text of the paper by the authors’ faulty explanation when statistically significant relationships are observed. Dr. William Thompson, co-author of the paper and lead statistician with the CDC, has recently (August 2014) come forth with evidence of fraud committed specifically regarding this paper, and has launched a complaint against his co-authors regarding both the outcomes and the interpretations of the results of this study.\n\nA population-based study of measles, mumps, and rubella vaccination and autism (2002)\n\n Authors: Madsen KM, Hviid A., Vestergaard M., Schendel D, Wohlfahrt J, Thorsen, P.\n\nConflicts of interest: This study was funded by the National Immunization Program (NIP) at the US Centers for Disease Control and Prevention (CDC), which had a vested financial interest in increased uptake of the MMR vaccine, as it directly bought the vaccine from Merck and distributed it for reimbursement to the states’ public health departments. Also, one of the co-authors of the study, Dr. Diana Schendel, was a CDC employee at the time of publication. In addition, three of the co-authors (Dr. Mads Melbye, Mr. Jan Wohlfahrt, and Mr. Anders Hviid) were employees of Staten Serum Institut, a for-profit company that manufactures and distributes vaccines in Denmark.\n\nAdditional note: Another of the study authors, Poul Thorsen, is currently an international fugitive, wanted by law enforcement authorities for research fraud, money laundering and various crimes carried out in conjunction with the CDC.\n\nNo evidence for a new variant of measles-mumps-rubella-induced autism (2001)\n\n Authors: Fombonne E, Chakrabarti S.\n\nStudy’s flaws: Comparing purposive samples to convenience samples is not a valid research method and therefore should not be relied upon to make inferences regarding the MMR vaccine and autism. The authors also do not list the source of the third convenience study, further calling into question the validity of the sample.\n\nConflicts of interest: After this paper was published, lead author Dr. Fombonne violated scientific ethics at his post at Montreal Children’s Hospital and McGill University when he improperly used samples derived from autistic children for another study unauthorized by their parents. Dr. Fombonne has also testified as an expert witness for vaccine manufacturers and against families with reportedly vaccine-injured children, both in civil courts and the National Vaccine Injury Compensation Program for the US.\n\nMMR and autism: further evidence against a causal association (2001)\n\n Authors: Farrington CP, Miller E, Taylor B.\n\nStudy’s flaws: Despite the authors’ claims, the data presented as evidence in the paper instead seems to actually confirm a temporal relationship between the MMR vaccine and the age of first diagnosis.\n\nRead the rest of the critical review at ANH USA.", "opengraph": {"type": "article", "title": "VACCINE QUACKERY BOMBSHELL: Key studies cited to ‘prove’ vaccines are safe were funded almost entirely by vaccine manufacturers – Prepare for Change", "url": "https://conspiracydailyupdate.com/2016/08/11/vaccine-quackery-bombshell-key-studies-cited-to-prove-vaccines-are-safe-were-funded-almost-entirely-by-vaccine-manufacturers-prepare-for-change/", "description": "August 9, 2016 by Edward Morgan Are you surprised by blatant scientific fraud anymore? Every informed person in the world today knows that everything is rigged: the money system, government grants,…", "article:published_time": "2016-08-11T00:04:01+00:00", "article:modified_time": "2016-08-11T00:04:01+00:00", "site_name": "Conspiracy Daily Update", "image": "https://conspiracydailyupdate.files.wordpress.com/2016/08/cash-dollars-bribe-vaccine-syringe.jpg", "image:width": "474", "image:height": "267", "locale": "en_GB", "article:publisher": "https://www.facebook.com/WordPresscom"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.anh-usa.org/vaccine-science-is-not-settled-a-critical-review-of-the-literature/", "http://www.naturalnews.com/vaccine.html", "http://www.anh-usa.org/vaccine-science-is-not-settled-a-critical-review-of-the-literature/", "http://www.naturalnews.com/study.html", "http://www.naturalnews.com/vaccines.html", "http://www.naturalnews.com/conflicts_of_interest.html", "http://www.anh-usa.org/vaccine-science-is-not-settled-a-critical-review-of-the-literature/"], "authors": [], "publish_date": "2016-08-11T00:04:01+00:00"}