{"result_id": "079034", "URL": "https://conspiracydailyupdate.com/2020/07/", "timestamp": "2023-04-25 14:49:38 CEST+0200", "meta": {"description": "25 posts published by Brian Robert Hyland during July 2020", "lang": "en", "keywords": "", "favicon": "https://conspiracydailyupdate.files.wordpress.com/2017/06/cropped-featured3-1.jpg?w=32", "canonical": "https://conspiracydailyupdate.com/2020/07/", "encoding": "UTF-8"}, "image": null, "domain": "conspiracydailyupdate.com", "title": "Jul 2020 – Conspiracy Daily Update", "cleaned_text": "Table of Contents\n\n 8. Political Correctness: The Devil’s Thought Police\n\n 9. The Spread of Socialism in Europe\n\n 10. Why Do We Fall for the Devil’s Tricks?\n\nCommunist countries practice strict control over speech and thought. However, since the 1980s, another form of speech and thought control has appeared in the West. Thought police use the banner of “political correctness” to run amok in the media, society, and education system, using slogans and mass criticism to restrain speech and thought. Even though many have already felt the evil power of its control, they have not grasped its ideological origins.\n\nPhrases such as “political correctness,” together with “progress” and “solidarity,” have long been used by communist parties. Their superficial meaning is to avoid using discriminatory language toward minorities, women, the disabled, and others. For example, “black people” are to be called “African Americans,” American Indians are to be called “Native Americans,” illegal immigrants are to be called “undocumented workers,” and so on.\n\nHowever, the hidden implication behind political correctness is to classify individuals into groups according to their victim status. Those who are the most oppressed should, therefore, be accorded the most respect and courtesy. This judgment is rendered solely on one’s identity, disregarding individual conduct and talent, which is the basis of what’s called “identity politics.”\n\nThis style of thinking is extremely popular in the United States and other Western countries. According to such logic, black lesbians, who are oppressed along vectors o race, sex, and sexual preference, are ranked at the forefront of victimhood. At the other extreme, white, heterosexual males are considered the most privileged and, in the logic of victim politics, should be at the bottom of the totem pole.\n\nThis type of classification is identical to what goes on in communist countries, where individuals were classified within the “five classes of red” or the “five classes of black” according to their wealth and class status before the revolution. The Chinese Communist Party eliminated and oppressed landowners and capitalists because of their “wrong” class status, attacked intellectuals as the “Stinking Old Ninth”, and chanted that “the poor are the smartest; the nobles, the dumbest.”\n\n#CCP #China #Communism\n\n Sign the Petition to Investigate, Condemn, and Reject the Chinese Communist Party👉 https://rejectccp.com\n\nWATCH MORE ON YOUTUBE\n\n 🔵[Exclusive investigative report] The first documentary movie on the origin of CCP virus\n\n 👉https://bit.ly/OriginOfVirus\n\n🔵 Investigative Report: The Coverup of the Century\n\n 👉 https://bit.ly/CoverupOfCentury\n\n——————\n\n Get the latest updates as well as exclusive reporting and first-hand videos about the CCP virus from The Epoch Times website.\n\n ▶️ https://ift.tt/2PCDpdG\n\n ——————\n\n SUBSCRIBE TO THE EPOCH TIMES\n\n Print subscription (delivery inside the U.S only):\n\n https://ift.tt/2yubTJA\n\n View on YouTube", "opengraph": {"type": "website", "title": "Jul 2020 – Conspiracy Daily Update", "site_name": "Conspiracy Daily Update", "image": "https://conspiracydailyupdate.files.wordpress.com/2017/06/cropped-featured3-1.jpg?w=200", "image:width": "200", "image:height": "200", "locale": "en_GB"}, "tags": ["Youtube", "Twitter", "Facebook"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "480", "height": "270", "embed_code": "<iframe class=\"youtube-player\" width=\"480\" height=\"270\" src=\"https://www.youtube.com/embed/Mrfd2UjullA?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-gb&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/Mrfd2UjullA?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-gb&autohide=2&wmode=transparent"}], "links": ["https://bit.ly/3f6JVDf", "https://bit.ly/EpochNewspaper", "https://rejectccp.com", "https://bit.ly/ManipulatingAmerica", "https://bit.ly/CoverupOfCentury", "https://ift.tt/2PCDpdG", "https://ift.tt/2yubTJA", "https://youtu.be/Mrfd2UjullA"], "authors": [], "publish_date": "Jul 31, 2020"}