{"result_id": "079028", "URL": "https://conspiracydailyupdate.com/category/potus/drain-the-swamp/robert-kennedy-jr-vaccine-truther/", "timestamp": "2023-04-25 14:49:29 CEST+0200", "meta": {"description": "Posts about Robert Kennedy Jr (VACCINE TRUTHER) written by Brian Robert Hyland", "lang": "en", "keywords": "", "favicon": "https://conspiracydailyupdate.files.wordpress.com/2017/06/cropped-featured3-1.jpg?w=32", "canonical": "https://conspiracydailyupdate.com/category/potus/drain-the-swamp/robert-kennedy-jr-vaccine-truther/", "encoding": "UTF-8"}, "image": null, "domain": "conspiracydailyupdate.com", "title": "Robert Kennedy Jr (VACCINE TRUTHER) – Conspiracy Daily Update", "cleaned_text": "As we get closer and closer to the inauguration of the Trumpster the main stream media will go more and more insane.\n\nIn their latest attempt to try and stop the inauguration and save their own hides from the coming War Tribunals:\n\n1) First – The Department of Homeland Security, a French Based Corporation with over 229,000 employees operating around the world, was started by a Former SS Member of NAZI Germany, began Federalizing the elections. This means the individual states have lost control of the election process.\n\nI was involved with this process when the Father Land Protection Department – later named the Department of Homeland Security – was formed. Rather than leading the Washington State Homeland Security Department I chose to continue to stop these coming Nuclear Wars and Presidential Assassination.\n\nIn an attempt to over turn the last President Election the Directors of Homeland Security, Secretary Jeh Charles Johnson, was given an offer he “NO CANNA REFUSE” and has decided to stand down.\n\nThere is a power here on Earth that would deal with those trying to stop the Trumpster.\n\nThe security the Trumpster has hired are all fully aware of what is at stake here – the survival of Planet Earth.", "opengraph": {"type": "website", "title": "Robert Kennedy Jr (VACCINE TRUTHER) – Conspiracy Daily Update", "url": "https://conspiracydailyupdate.com/category/potus/drain-the-swamp/robert-kennedy-jr-vaccine-truther/", "site_name": "Conspiracy Daily Update", "image": "https://conspiracydailyupdate.files.wordpress.com/2017/06/cropped-featured3-1.jpg?w=200", "image:width": "200", "image:height": "200", "locale": "en_GB"}, "tags": ["The World Mercury Project", "American Academy Of Pediatrics", "Dan Olmsted"], "tweets": [], "movies": [], "links": ["https://www.youtube.com/watch?v=BXtJ3u27bRw&feature=youtu.be"], "authors": [], "publish_date": "May 5, 2017"}