{"result_id": "079030", "URL": "https://conspiracydailyupdate.com/2016/06/22/nesara-republic-now-galactic-news-just-released-british-film-also-investigates-vaccine-autism-connection-manmade-epidemic/", "timestamp": "2023-04-25 14:49:32 CEST+0200", "meta": {"description": "Tuesday, June 21, 2016 By Catherine J. Frompovich Hot on the heels of the CDC-whistleblower and vaccine-fraud-documentary VAXXED, a new feature length film – Man Made Epidemic – made its debut in London (UK) at the Curzon Cinema in Soho on Thursday, June 16, 2016! Kudos go to the producer, filmmaker Natalie Beers, and other…", "lang": "en", "keywords": "", "favicon": "https://conspiracydailyupdate.files.wordpress.com/2017/06/cropped-featured3-1.jpg?w=32", "canonical": "https://conspiracydailyupdate.com/2016/06/22/nesara-republic-now-galactic-news-just-released-british-film-also-investigates-vaccine-autism-connection-manmade-epidemic/", "encoding": "UTF-8"}, "image": null, "domain": "conspiracydailyupdate.com", "title": "JUST-RELEASED BRITISH FILM ALSO INVESTIGATES VACCINE-AUTISM CONNECTION: “MANMADE EPIDEMIC” – NESARANEWS", "cleaned_text": "Kudos go to the producer, filmmaker Natalie Beers, and other production crew members for taking on such an overwhelming project, which took two years to complete. Congratulations and thanks for having the fortitude to work on a much-needed investigation of vaccines, vaccinations and environmental issues relative to ever-increasing autism, also must be given to Lothar Moll, Executive Producer; Lucy Martens, Director of Photography; Simon Modery, Editor; and David Hason, Music Composer.\n\nAccording to the movie’s webpage:\n\nFilmmaker Natalie Beer sets off on a journey around the world speaking to leading doctors, scientists and families to find out the truth about the autism epidemic and whether or not vaccines have a role to play. The film explores the common misconception that autism is solely genetic and looks into scientists concerns over recent years about environmental factors such as medication and pesticides which continue to leave our children with physical and neurological damage. [1]\n\nAsk your local movie theater to show Man Made Epidemic on their movie screens as soon as possible, since it will be an excellent cinematic companion to VAXXED thereby putting much needed pressure on the U.S. HHS, CDC, FDA, the World Health Organization, and others who indiscriminately push vaccines based upon fraudulent, consensus vaccine pseudoscience!\n\nFraudulent is not to be used lightly, as there are various incidences that have exposed fraud:\n• The Simpsonwood Meeting in June 2000 to rework the CDC epidemiologist Verstraeten’s [2] finding that vaccines cause autism. Here’s the transcript of that infamous clandestine meeting.\n• Two Merck & Company employee whistleblowers lawsuit in federal court in Philadelphia, PA, regarding Merck’s fudging for ten years the efficacy ratings of the mumps active in its MMR vaccine. Here’s The Wall Street Journal’s report on that.\n• CDC epidemiologist-whistleblower William Thompson, PhD, proved that the CDC trashed documented study evidence that the MMR vaccine caused autism in young black boys less than three years of age, and handed over copies of those ‘trashed’ documents to a member of the U.S. Congress asking for a congressional investigation, which has not happened YET. The movieVAXXED documents that embarrassing, conniving and fraudulent vaccine science story.\n\nProbably NOTHING explains more why there should be an investigation into vaccines and vaccinology‘science’ than the candid remarks made by the “father of American vaccines,” Dr Maurice Hilleman, MD, the Merck & Company head vaccine maker for years, discussing on video the very real problems with vaccines, their growth mediums—animals and their tissues, cancer viruses, etc. However, now we have to factor in, since Hilleman’s time, newly-added neurotoxic chemicals and nanoparticles [3]. See Dr Hilleman’s nonchalant disclosure, plus how cavalierly colleagues treated the information, to realize why you really have to question vaccine ingredients.\n\n\n\n Personally, I can’t wait to see the movie Man Made Epidemic and to review it.\n\n See you at the movies!\n\nCatherine J Frompovich (website) is a retired natural nutritionist who earned advanced degrees in Nutrition and Holistic Health Sciences, Certification in Orthomolecular Theory and Practice plus Paralegal Studies. Her work has been published in national and airline magazines since the early 1980s. Catherine authored numerous books on health issues along with co-authoring papers and monographs with physicians, nurses, and holistic healthcare professionals. She has been a consumer healthcare researcher 35 years and counting.\n\nCatherine’s latest book, published October 4, 2013, is Vaccination Voodoo, What YOU Don’t Know About Vaccines, available on Amazon.com.\n\nHer 2012 book A Cancer Answer, Holistic BREAST Cancer Management, A Guide to Effective & Non-Toxic Treatments, is available on Amazon.com and as a Kindle eBook.\n\nTwo of Catherine’s more recent books on Amazon.com are Our Chemical Lives And The Hijacking Of Our DNA, A Probe Into What’s Probably Making Us Sick (2009) and Lord, How Can I Make It Through Grieving My Loss, An Inspirational Guide Through the Grieving Process (2008)\n\nCatherine’s NEW book: Eat To Beat Disease, Foods Medicinal Qualities ©2016 Catherine J Frompovich coming in Summer 2016", "opengraph": {"type": "article", "title": "JUST-RELEASED BRITISH FILM ALSO INVESTIGATES VACCINE-AUTISM CONNECTION: “MANMADE EPIDEMIC” – NESARANEWS", "url": "https://conspiracydailyupdate.com/2016/06/22/nesara-republic-now-galactic-news-just-released-british-film-also-investigates-vaccine-autism-connection-manmade-epidemic/", "description": "Tuesday, June 21, 2016 By Catherine J. Frompovich Hot on the heels of the CDC-whistleblower and vaccine-fraud-documentary VAXXED, a new feature length film – Man Made Epidemic – made its debut in L…", "article:published_time": "2016-06-22T05:21:44+00:00", "article:modified_time": "2016-08-03T03:04:59+00:00", "site_name": "Conspiracy Daily Update", "image": "https://conspiracydailyupdate.files.wordpress.com/2016/06/autism-man-made-epidemic.jpg", "image:width": "474", "image:height": "276", "locale": "en_GB", "article:publisher": "https://www.facebook.com/WordPresscom"}, "tags": ["MANMADE EPIDEMIC", "vaxxed"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "474", "height": "267", "embed_code": "<iframe class=\"youtube-player\" width=\"474\" height=\"267\" src=\"https://www.youtube.com/embed/13QiSV_lrDQ?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-gb&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/13QiSV_lrDQ?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-gb&autohide=2&wmode=transparent"}], "links": ["http://thinktwice.com/simpsonwood.pdf", "http://blogs.wsj.com/pharmalot/2015/06/08/merck-is-accused-of-stonewalling-over-effectiveness-of-mumps-vaccine/", "http://activistpost.net/vaccinetruth.html", "http://man-made-epidemic.com/about-the-movie/", "http://www.thinktwice.com/fraud.htm", "https://www.cdc.gov/vaccines/pubs/pinkbook/downloads/appendices/b/excipient-table-2.pdf", "http://www.catherinejfrompovich.com/", "http://www.amazon.com/Vaccination-Voodoo-What-About-Vaccines/dp/1484923820/ref=as_li_tf_sw?&linkCode=wsw&tag=permacultucom-20", "http://www.amazon.com/Cancer-Answer-Management-Effective-Treatments/dp/1477490175/ref=as_li_tf_sw?&linkCode=wsw&tag=permacultucom-20", "http://www.amazon.com/Our-Chemical-Lives-And-Hijacking/dp/1439255369/ref=as_li_tf_sw?&linkCode=wsw&tag=permacultucom-20", "http://www.amazon.com/Lord-Make-Through-Grieving-Loss/dp/1434363880/ref=as_li_tf_sw?&linkCode=wsw&tag=permacultucom-20"], "authors": [], "publish_date": "2016-06-22T05:21:44+00:00"}