{"result_id": "080001", "URL": "https://consumerwellness.org/PR19.html", "timestamp": "2023-04-25 14:49:54 CEST+0200", "meta": {"description": "Empowering consumers with lifesaving knowledge", "lang": "en", "keywords": "nutrition, disease prevention, health, wellness", "favicon": "https://www.consumerwellness.org/images/CWC.ico", "canonical": "https://consumerwellness.org/PR19.html", "encoding": "iso-8859-1"}, "image": null, "domain": "consumerwellness.org", "title": "Urgent health warning issued over Adya Clarity detox liquid containing aluminum, sulfuric acid - Consumer Wellness Center", "cleaned_text": "TUCSON, Ariz. (March 25, 2013) - The non-profit Consumer Wellness Center ( www.ConsumerWellness.org ) has issued a consumer health warning over Adya Clarity, a \"detox\" product that was seized by the FDA in 2012 and tested at over 1200ppm aluminum. The product is currently being marketed through a series of highly deceptive webinars that claim almost magical powers for the product. In reality, the product is primarily made of, and it was imported into the United States using the description \"battery acid\" on import documents\n\nAdya Clarity's two most prominent metals are aluminum and iron. The manufacturer of Adya Clarity intentionally and deliberately refused to list aluminum on the label, instead listing beneficial trace elements such as magnesium. Even so, they recommended the product for internal consumption every 12 hours, saying:\n\n\" As far as super shots are concerned; taking a super shot is an off label use. Mix 1 teaspoon of ADYA in 1 oz. of water. If this is too strong to the taste, you can use more than 1 oz of water. Drink one Supershot immediately upon waking in the morning. Repeat every 12 hours.\"\n\nHere's the chemical breakdown of Adya Clarity, as tested by the FDA after they seized the product:\n\nWould you drink something that's over 1000ppm aluminum and 1000ppm iron? If so, you might also enjoy taking vaccine shots, which have far lower levels of aluminum.\n\nThe primary metal compound in Adya Clarity is aluminum sulfate. In 1988, a 20-ton load of aluminum sulfate was accidentally dumped into the municipal water supply in a town in the UK. What followed was a mass poisoning of the citizens in a 140-square-mile area. As reported in the Dailymail ( http://www.dailymail.co.uk/news/article-502442/A-lethal-cover-Britain... ) :\n\n\" As she starts to walk, it is with a heavy limp and within 50 yards she is so exhausted that her entire body shakes uncontrollably. After Angela finally reaches the local coffee shop, the trembling of her swollen legs is so bad that the table rocks haphazardly, threatening to spill her mug and croissant onto the floor.\n\nNo wonder, near to tears, she declares bravely: \"When I am dead, I want an autopsy done on my body. It might help all the people who, like me and my two children, drank the water in Camelford all those years ago.\"\n\nFor she and her family were victims of one of Britain's most high-profile public health scandals in which victims complained of brain damage, memory loss and joint problems.\"\n\nAlso from the story:\n\n...dead women had \"high levels\" of aluminium in their brains...\n\n...Hundreds began to suffer effects after drinking or bathing - including skin peeling, hands and lips sticking together, hair turning green and fingernails blue.\n\n...By nightfall that day, people were vomiting and had diarrhoea. Next morning, many had skin burns, aching joints and mouth ulcers that took weeks to heal.\n\n...A few months later Angela became ill.\n\n...She was diagnosed with cancer of the lymph glands of the leg. She had an operation to remove the resulting malignant growth on her left thigh. She has since undergone another operation to remove a new growth on the same leg.\"\n\nAdya Clarity was \"recalled\" by its top distributor in 2011, during which that distributor apologized for promoting a product with possible health risks and issued over $1 million in refunds and store credit to customers. His statement includes, \"I feel deeply saddened at this situation; please forgive me for not taking action sooner.\"\n\nAn Adya Clarity shipment was seized by the FDA in 2012, and the FDA confirmed the product's label contained multiple label violations. You can see some of the FDA's findings here.\n\nWhy the Adya webinar is a fraud\n\nThe marketing of Adya Clarity is based on a parlor trick of pouring an acidic liquid containing dissolved metals into a glass of water, which is more alkaline. The sudden shift in alkalinity causes particles (metals) to appear in the water. This is described by the deceptive marketers as a \"cleaning\" of the water. Promoters of Adya Clarity , which include Matt Bakos and Kacper Postawski, claim that when the product is consumed internally, it pulls metals out of your body. In reality, the product introduces potentially toxic levels of non-organic iron and aluminum into your body.\n\nThe following video exposes full truth about Adya Clarity: \n\n http://tv.naturalnews.com/v.asp?v=35BEAD3EF2E4F48D8CCB9E4F6E7B21BB\n\nUsers of Adya Clarity have reported \"black stuff\" coming out of their ears and fingernails. One video shows an Adya Clarity user raving about how great Adya Clarity is, even though the woman appears to be completely insane (medically psychotic). Click here for the video and forward to the end to see this woman.\n\nThe deceptive marketing of Adya Clarity is based on the idea that aluminum binds to other metals. But so does mercury. Mercury is used throughout the mining industry, in fact, to pull gold flakes out of slurry. This does not mean that mercury is safe to drink. Neither is aluminum safe to drink in large quantities. Anyone concerned about chemtrails (aluminum and barium salts) or vaccines should be similarly concerned about drinking Adya Clarity which contains over 1200 ppm aluminum, according to FDA lab tests.\n\nThe claimed \"water purification\" benefits of Adya Clarity are highly deceptive, as the product does not come with a physical filter to trap the aluminum that has bonded with other particles. Thus, anyone who drinks this liquid is drinking both the aluminum as well as whatever it has bonded to. Adya Clarity is mined in Japan near Fukushima, Japan, the site of the nuclear accident.\n\nAdya Clarity has never been approved by the FDA for any purpose, and it is not \"harmonized\" with the FDA as deceptively claimed by its marketers. Adya Clarity is also not approved by Health Canada as the marketers deceptively claim. Rather, Adya is only listed as an \"iron supplement\" with Health Canada, meaning the Health Canada listing was fraudulently acquired by intentionally misstating the intended marketing and use of the product. This is a violation of Health Canada regulations.\n\nAdya Clarity is also now being promoted by Brian Clement at the Hippocrates Health Institute, a claimed \"doctor\" who HushLeaks.com says acquired his doctorate through a diploma mill. NaturalNews confirmed that the accreditation organization overseeing the \"university\" that granted Brian Clement his \"doctorate\" is operated out of a run-down building in North Kansas City where the phone is answered, \"This is bob.\" Everyone promoting Adya Clarity is making huge profits on the product. It was imported as battery acid for pennies per gallon, but it is sold at obscene markups to an unsuspecting public.\n\nAdya Clarity is currently being promoted at Rense.com and other alternative news websites. Jeff Rense is probably not aware of the full story of Adya Clarity, or he would surely not promote it. Alex Jones has long banned Adya Clarity from being promoted on InfoWars.com and PrisonPlanet.com. If Rense.com continues to promote the product after this warning is published, it would greatly harm the credibility of Jeff Rense himself, who has long fought against metals poisoning of food, water and the atmosphere.\n\nAdya Clarity, by the way, threatened to sue Natural News to prevent the website from warning consumers about the possible health risks of consuming the product. This is information the Adya marketers do not want to be widely known.\n\nIf you purchased Adya Clarity from a webinar, request an immediate refund\n\nIf you recently purchased Adya Clarity due to the recent release of a highly deceptive marketing webinar, you are encouraged to. Do not consume the product internally. The product contains a high level of aluminum that far exceeds EPA limits for safe water consumption. Most of the marketing claims for the product are dubious and deceptive.\n\nMany Adya Clarity distributors refuse to honor refund requests, so if necessary, you may wish to issue a chargeback with your credit card company to dispute the charge for the product.\n\nAdya Clarity stands in terrible contradiction to the principles of good health. There are 12 primary contradictions you need to know about, including:\n\n#5) We should avoid aluminum cookware and aluminum foil. \n\n But Adya Clarity contains over 1,000PPM of aluminum sulfate, dissolved in sulfuric acid, and you're supposed to drink it!\n\n#6) Vaccines are dangerous because they contain aluminum and mercury. \n\n But Adya Clarity contains high levels of aluminum and iron in their sulfated forms! And it was marketed as a \"mineral supplement\" so powerful that if you sat in a bathtub with Adya added to the water, the minerals would \"penetrate to your bone marrow,\" claimed the founder of Adya, Inc.\n\nSee more at: \n\n http://www.naturalnews.com/034051_Adya_Clarity_raw_foods.html\n\nHere are some of the health claims that Matt Bakos has made about Adya Clarity, which has been marketed as a dietary supplement for internal ingestion:\n\n\" ...the minerals will penetrate to your bone marrow,\" says Bakos. (Aluminum is the second most common mineral in the product, and aluminum toxicity is strongly linked to dementia, psychosis and delusional thinking.)\n\n\" Water is the number one cause of death on this planet.\"\n\n\" These minerals, because they're pre-digested, your body has to do nothing to get 'em into your cells.\"\n\n\" I once had this woman who's severely obese, who started taking our product, and in the first three days, she passed out three two-to-three foot long sucker fish snakes out of her bowels.\"\n\n\" In fact, if you notice your lips begin to get dry in the beginning, that means your colon is hydrating.\"\n\n\" Believe it or not, our product is harmonized by the FDA to come into the United States. So the FDA actually knows our product's being consumed.\"\n\n\" To achieve a proper health, you've gotta get out those multivalent ions that are trapped in your body that cannot move.\"\n\n\" This product goes right into the system, there's no metabolization needed, you can sit in a hot tub of this [Adya Clarity] water, and the minerals will penetrate to your bone marrow.\"\n\n\" Well, no wonder why everybody's divorcing and can't stand each other, it's because they're demineralized, they can't energetically communicate with one another.\"\n\nAbout Consumer Wellness Center\n\n The Consumer Wellness Center (http://www.ConsumerWellness.org) is a 501(c)3 nonprofit focused on educational initiatives that empower consumers with knowledge and wisdom on disease prevention, nutrition, peak mental and physical health and natural health modalities. The center sells no vitamins, supplements, foods or medical products, and earns no commissions from the sale of such products.", "opengraph": {"title": "Urgent health warning issued over Adya Clarity detox liquid containing aluminum, sulfuric acid   - Consumer Wellness Center", "type": "website", "url": "http://www.consumerwellness.org/PR19.html", "image": "http://www.consumerwellness.org/images/Consumer-Wellness-Center.jpg", "site_name": "consumerwellness.org", "description": "Empowering consumers with lifesaving knowledge"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.addtoany.com/share_save", "http://www.ConsumerWellness.org", "http://www.naturalnews.com/034005_Adya_Clarity_consumer_alert.html", "http://www.naturalnews.com/aluminum.html", "http://www.dailymail.co.uk/news/article-502442/A-lethal-cover-Britains-worst-water-poisoning-scandal.html", "http://www.naturalnews.com/health.html", "http://www.naturalnews.com/034023_Adya_Clarity_Matt_Monarch.html", "http://www.naturalnews.com/036012_Adya_Clarity_FDA_lab_tests.html", "http://www.naturalnews.com/images/Adya-Clarity-Label-FDA-Lab-Summary-Report-p1.jpg", "http://www.naturalnews.com/Adya_Clarity.html", "http://tv.naturalnews.com/v.asp?v=35BEAD3EF2E4F48D8CCB9E4F6E7B21BB", "http://tv.naturalnews.com/v.asp?v=35BEAD3EF2E4F48D8CCB9E4F6E7B21BB", "http://www.naturalnews.com/034022_Adya_Clarity_Health_Canada.html", "http://hushleaks.com/index.php?/archives/12-Brian-Clement-of-Hippocrates-Health-Institute-faked-academic-credentials.html", "http://www.naturalnews.com/039506_beet_juice_Brian_Clement_marijuana_decriminalization.html", "http://www.naturalnews.com/news.html", "http://www.naturalnews.com/034051_Adya_Clarity_raw_foods.html", "http://www.naturalnews.com/034051_Adya_Clarity_raw_foods.html", "http://www.naturalnews.com/036012_Adya_Clarity_FDA_lab_tests.html", "http://www.naturalnews.com/034005_Adya_Clarity_consumer_alert.html", "http://www.ConsumerWellness.org", "News.html"], "authors": [], "publish_date": null}