{"result_id": "081010", "URL": "https://cosmicintelligenceagency.com/sunspotcycle-astrology-venus-sun-conjunction-pandemics/", "timestamp": "2023-04-25 14:50:21 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://cosmicintelligenceagency.com/wp-content/uploads/2018/06/cropped-logo_cia_color_743-32x32.jpg", "canonical": "https://cosmicintelligenceagency.com/sunspotcycle-astrology-venus-sun-conjunction-pandemics/", "encoding": "utf-8"}, "image": null, "domain": "cosmicintelligenceagency.com", "title": "The Sunspot Cycle, Magnetic Field, Venus-Sun Inferior Conjunctions and Pandemics", "cleaned_text": "There has been some research on the relations between the inferior conjunctions of Venus and the influenza pandemics that emerged in the 20th century. Some research I read years ago has clearly stated that inferior conjunctions of Venus were directly related to pandemics. The inferior conjunction of Venus with the Sun occurs every 583.9 days which is approximately every 1.6 years. Of course, we do not experience a pandemic in each inferior conjunction of Venus! However, solar winds which are active during such conjunctions are determinants on this theme. I have emphasised this relation between the inferior conjunctions of Venus and solar activities in my book Maximum which was published in 2012. Under the title Venus Ingress in 2012 and Our Health, I underlined, “Some scientists claim that the virus that causes endemic flu emanates from Venus. Donald Barber from Norman Lockyer Observatory in Britain stated that some fungi-type bacteria that emanated from rainwater were linked with the Venus–Sun inferior conjunction. Barber also stated that six major epidemic diseases emerged 55 days after the geomagnetic storms that followed the Venus–Sun inferior conjunction. To summarize these scientific theories: Because some planetary alignments cause solar activities, Venus–Earth–Sun alignments also cause solar flares. As the magnetic field of Venus is too weak, ionized gases from its upper atmosphere leave the plane due to solar storms. The bacterial colonies in these layers reach the Earth’s atmosphere during the planetary alignment. The viruses, which disseminate through the air from the poles, then cause flu epidemics around the world. We are now reaching the solar maximum phase, where we will experience increased magnetic currents. Because Venus’s plasma tail will be closer to the Earth during this interaction, the possibilities for virus contagion will increase. Throughout history, flu virus mutations and other pandemics were linked with sun spot maximums. For example, following the sun spot maximum in 1917, the Spanish Flu pandemic started in 1918”.[1] When compared with the Earth, Venus has a much weaker magnetic field. It means, solar winds may deteriorate its atmosphere directly and blow its tail like upper atmosphere. Although it is not seen with naked eye, Venus has a tail similar to a comet. In his article The Interaction of the Solar Wind with Venus, Russell Vaisberg tells, “While the Venus ionosphere, rather than magnetosphere as on the earth, deflects the solar wind flow, this deflection is accomplished with the deformation of a bow shock which heats and compresses the solar wind flow, and is closer to the planet and weaker than would be expected for an ideal gas dynamic interaction with a perfectly reflecting obstacle. The ionized magneto sheath flow can interact directly with the neutral atmosphere through charge exchange, which removes momentum from the flow, and photoionization; both processes adding mass to the solar wind because the high altitude neutral atmosphere is mostly composed of oxygen rather than hydrogen. The magneto tail of Venus also differs from that of the earth in that the mass loading of the magneto sheath flow slows the transport of magnetic flux tubes past the planet, while the ends of the tubes continue to travel rapidly in the solar wind, so that the planet accretes interplanetary magnetic flux.[2]\n\nDoes Virus come from Space? According to scientists Hoyle and Wickramasinghe, flu outbreaks are often caused by new viruses from space. Based on a theory, the worst influenza outbreaks peak in correlation with sunspot activities of eleven years. Although particles are scattered all around the world, they are spread by people in places with high population and therefore, the probability of transmission increases. The shortest interval between the geomagnetic storms and pandemics is 35 days, while the longest interval is 67 days. [3] Scientist Donald R.Barber claimed that bacteria reach the polar regions of the world by solar winds from the upper atmosphere of Venus. [4] Another scientist Joseph Norman Lockyer stated they that bacteria reach the ground from the in England through the north-west winds coming from North Polar Region.[5] Therefore, virus spreads quickly because of being transmitted by the winds of by the people. In the region where outbreaks occur, if there is no reason for virus impact, then it is possible that influenza may occur due to the influence of Venus. In an article written by Lauren Compton on May 23, 2003, it is told that in a letter to The Lancet medical journal, Professor Chandra Wickramasinghe of Cardiff University suggests SARS virus might be introduced to Earth by a comet or meteorite. He points to other mysterious modern epidemics like the Plague of Athens and the influenza pandemic of 1917-19 as also originating from the skies.[6] In the article titled “On the Possibility of microbiota transfer from Venus to Earth” written by N.C.Wickramasinghe and J.T. Wickramasinghe it is stated that the action of the solar wind leads to erosion of parts of the atmosphere laden with aerosols and putative microorganisms, forming a comet-like tail in the antisolar direction. As stated by the research, during inferior conjunctions that coincide with transits of the planet Venus this comet-like tail intersects the Earth’s magnetopause and injects aerosol particles.[7] Let’s have a look at the biggest outbreaks which occurred around the dates of Venus-Sun inferior conjunction. Venus-Sun inferior conjunction occurred on May 26, 1518. With the Smallpox epidemic began in the end of 1518, in the beginning of 1519, 5 to 8 million people perished. Venus-Sun inferior conjunction occurred on February 9, 1918 and Spanish Flu emerged on March 11, 1918. Venus-Sun inferior conjunction occurred on June 21, 1956. Asian Flu, which emerged in Moscow in October 1956, spread to countries worldwide after February 1957. Venus-Sun inferior conjunction occurred on June 13, 1988. Human Influenza A (H1N2) was seen in China between December 1988 and March 1989. Venus-Sun inferior conjunction occurred on April 2, 1993. Hanta Virus emerged on May 1993. Venus-Sun inferior conjunction occurred on August 18, 2007. A flu outbreak was seen in Australia on these days. Following the conjunction, Zika Virus emerged in April in the same year. Venus-Sun inferior conjunction occurred on March 27, 2009. Swine Influenza A (H1N1) was seen in human in March 2009. Venus-Sun inferior conjunction occurred on June 6, 2012. The first MERS case was seen on April 2012 (or on June some claims) and the outbreak spread to 26 countries by the end of 2012. It is considered that COVID-19 emerged on December 1, 2019. The last Venus-Sun inferior conjunction occurred on October 26, 2018. It seems to be a long time between these days. And again, we will experience another Venus-Sun inferior conjunction on June 3, 2020 and before this conjunction, we will have a New Moon on May 22, 2020. I will give details about that coming conjunction at the end of my article. By the way, COVID-19 is a type of Coronavirus. In astronomy, corona means the outer sphere of the Sun, resembling a crown. Do you think it is a coincidence that Coronavirus has entered our lives during the transition period to the deep Solar Minimum cycle?\n\nAccording to some scientists, minima in the sunspot cycle present conditions conducive to the entry or activation of new pathogens and also for mutations of already circulating bacteria and viruses. Three grand minima of solar activity on record–the Sporer minimum (1450-1550 AD), Maunder minimum (1650-1700 AD) and the Dalton minimum (1800-1830) have all been marked by a preponderance of pandemics–Small Pox, English Sweats, Plague and Cholera. The sunspot numbers recorded for the present period 2002-2017 include the deepest sunspot minimum (Cycle 23-24) since records began, and a trend to declining numbers throughout the cycle. The same period has seen the resurgence of several pandemics–SARS, MERS, Zika, Ebola, Influenza A. We consider it prudent to take note of these facts whilst planning future strategies for pandemic surveillance and control.[8] The possibility of linking sunspots with pandemics was first suggested in 1977 by Hope-Simpson who pointed out that many pandemics of influenza in history occurred close to times of sunspot maxima. Maxima in the sunspot cycle are characterized by high daily sunspot numbers, frequent solar flares, coronal discharges and X-ray emission. Sunspot minima are characterized by a weakening of the interplanetary magnetic field near the Earth, which allows for the entry of Galactic Cosmic Rays as well as electrically charged bacteria and viruses to the Earth and other microscopic biological entities can penetrate the interplanetary magnetic field barrier and reach the stratosphere. It is also of interest to note that the first descent of viral-sized particles deposited in the stratosphere will occur at places where the stratosphere is thinnest; and by this argument populated areas of China lying eastward of the Himalayan mountain range would present the best candidates. It is therefore not surprising to find that first strikes of new or renewed viral diseases are often recorded in China. According to some scientists, from past records of the correlation of the sunspot cycle (prolonged minima) and pandemics it is clear that the onset of a deep minimum is a signal of action. We have stated elsewhere that the sunspot cycle could be a guide for closer scrutiny of circulating viruses, and monitoring their genetic variations. [9] In my book Maximum, published in 2012, I have stated that the decrease in solar activities had some negative influences on human health and connections with fatal outbreaks: “According to Solco W. Tromp, if we are not stimulated by the Sun we may experience health problems. Our life is restricted during low solar activities. Colonel C.A. Gill and Dr. Conyers Morrel state that the deadly pandemic diseases increase during minimal sun spot activity periods. Gill proved that all malaria cases occurred during low sun spot activities. According to Dr. Conyers Morrel, epidemic diseases were highly related with sun spot cycles. Diphtheria, tetanus and dysentery are triggered when there are no sun spots.”[10] As I stated in the book “Başlangıç 2020” a co-authored book in Turkish, “Based on some prediction techniques, scientists state that the existing Solar Minimum will reach its deepest point in April 2020 (+/- 6 months) and will reach a new Solar Maximum in July 2025”. [11] It means, within the period between April 2020 and October 2020, we will experience the deepest point of the existing Solar Minimum. It is also stated that its trough will be experienced in 2022.\n\nCoronavirus could turn to global pandemic as freak solar minimum means outbreak ‘imminent’ Lead author Chandra Wickramasinghe of the Buckingham Centre for Astrobiology has already stated that a global virus pandemic was imminent. In his article published in January 25, 2020, he says; “The “deepest sunspot minimum” for more than a century is about to force the Sun into partial hibernation, they say. Public health authorities have been warned to be vigilant with the phenomenon linked to historic viral pandemics. Previously unseen strains could emerge through the coming months while existing ones turn super-virulent, according to a report in Current Science. On the basis of sunspot numbers, this could have serious consequences globally during the coming months. The solar slump is causing the Earth’s magnetic field to weaken allowing “biological entities” including DNA to fall to the planet’s surface. Scientists believe infective agents originating from comets and other planets inhabit near space in a type of soup – the so-called panspermia theory. While they can naturally drift towards Earth, they are largely held at bay by magnetic fields which are strengthened by solar activity. The imminent reduction in solar activity will knock a chink in this armour while “opening the floodgates” to a “flux of cosmic rays”. These rays threaten to disrupt the DNA present in bacteria and viruses already present, creating super-virulent versions. There are two problems we fear may arise: Biological entities can penetrate the weakened magnetic field under these circumstances to a much greater degree than under normal conditions. So we could see new, potentially deadly viruses, emerge on Earth after these floodgates are opened. Another aspect is mutations induced by cosmic rays in biological infectious agents already here, this could give them new characteristics and making then super-virulent. It would be prudent for public health authorities the world over to be vigilant and prepared for any necessary action. Previous viral pandemics have coincided with periods of low solar activity although scientists have struggled to find a definitive link. However they now think the effect of the sun on magnetic fields affects solar winds and the flow of charged particles including bacteria and viruses. Now, with space exploration and continuous monitoring of space weather, it is evident that the Earth’s magnetosphere and the interplanetary magnetic field in its vicinity are modulated by the solar wind that in turn controls the flow of charged particles onto the Earth. There appears to be a case for expecting new viral strains to emerge over the coming months.”[12]\n\nWe should also consider that the lowest interplanetary magnetic field values are recorded. Weakening in the Earth’s magnetic field also has an influence here. Virions, phages, bacteria and other microorganism also weaken the interplanetary magnetic field and inevitably help electrically charged new pathogens reach the surface of the Earth easily. Low or zero magnetic fields bring mutations as well. Although experts do not especially claim that Coronavirus stems from Solar Minimum, they tell that the low magnetic field caused by the decrease in the number of sunspots may engender emanation of new viruses. As I stated in the book Başlangıç 2020, “The reason for the changes in climate and economics or the spiritual changes we observe nowadays, is not only the changing magnetic fields but also the increasing number of cosmic rays. As the magnetic field of the Earth weakens rapidly, we are less protected from the harmful rays coming from the outer space.” [13] As I also mentioned in the same book, “The changes in the intensity of the Earth’s magnetic field may also be regional and bring changes related to the health of the people living in certain placed of the world. In 2015, Zika virus outbreak began in Mexico when the magnetic field there weakened strikingly. We may conclude that the virus attack was seen because solar activity decreased, magnetic field is weakened and so harmful rays and other particles from outer space reached the lower layers of our atmosphere more effectively. . In other words, the systematic increase of ZIKA attack cosmic rays seems to be related to low solar activities and consequently weakening magnetic field intensity. It is a warning for us for the future pandemics. That means, even if a solution is found for Coronavirus, other viruses and pandemics may be in our agenda in the near future. We must be prepared for this since we are in a period of time when the solar activities decrease and the magnetic field weakens.” [14] I would like to share a paragraph I wrote for the book “Başlangıç 2020”, a co-authored book in Turkish: “We will experience a Venus-Sun inferior conjunction on June 3, 2020. Venus will be transiting in Gemini, which is associated with the lungs and respiratory tracks in medical astrology. Gemini is associated with breathing and it is also the sign which gives quick reactions, so it indicates spasmodic respiratory disorders and especially the diseases of the upper lobs ıf the lungs. Gemini is also associated with travelling. In June, during Venus transit in Gemini, many people will probably be on vacation. Tokyo Olympics is one of the biggest organizations where numerous people will gather in the summer of 2020. Such crowded places may be dangerous in terms of air-borne diseases. So, special attention should be paid.” After the book has been published, Tokyo Olympics have been cancelled. It was absolutely the right decision! Various activities where lots of people attend including sport activities, concerts and congressed have all been cancelled. We should also be careful about Coronavirus threat during Venus retrograde in Gemini. Being over optimistic about the developments and increase of journeys may bring losses. The number of infested people and the number of hospitalization may increase. Therefore, we should attach special importance to isolation and keep in quarantine between the second half of the May and the end of June, we should not travel unless it is obligatory, we should not remain in crowded places and we should not be in face-to-face communication with the others and care about social distancing. As I stated in my previous article, Jupiter-Pluto conjunction, that occur in every 13 years which was also active in some of the previous pandemics, were in exact conjunction on April 5, 2020. These two planets will be conjoint two times this year; one on June 30 and the other on November 13. As a result, although we will experience a decline in the severity of the outbreak in the summer months, we may expect a second wave of outbreak in fall, especially in November![15] Eclipses in Gemini and Sagittarius are associated with respiration, communication, circulation and journeys. The outbreak of coronavirus may continue by the end of 2021. Additionally, we will have an eclipse on Cancer 0° on June 21 which will bring important developments about the whole world. If we look back to the solar eclipse which occurred in 2001 on the same sign and same degree, we can see that the Twin Towers were attacked on September of that year. According to the ancient astrologers, the sign of our Earth is Cancer and the eclipses on 0 degree of Cancer/Capricorn axis are the signals of events and developments which have impacts on the whole humanity. This eclipse will remind us that WE ARE A BIG FAMILY. In Traditional Astrology, the conjunctions of these planets, especially the sign where the conjunction takes place is extremely important. According to Sadullah al-Ankarawi, a 19th century Ottoman astrologer, plague and deaths increase all over the world during Saturn transits in Aquarius. Mars-Saturn conjunction in Aquarius brings plague and other epidemics. We had Mars-Saturn conjunction in Aquarius on April 1, 2020. The health authorities have been telling that we were in the most difficult period of Covid-19 pandemics around the days of that conjunction. On April 5 2022, we will have another Mars-Saturn conjunction in Aquarius. So, we will still be under the test of epidemics as stated in ancient texts. Saturn will be transiting in Aquarius until March 7, 2023.\n\nThe main actors of the recent pandemics, especially the latest outbreak of Covid-19 which started as of the end of 2019, seem to be the decrease in solar activities, weakening of the magnetic field and Venus-Sun inferior conjunction which we have not experienced yet. Jupiter-Saturn conjunction on December 21, 2020 is also related to changes in the magnetic field and sunspot cycles. As it will be the first conjunction of these two planets in Air signs, it is called the Great Mutation. Jupiter-Saturn conjunctions have a great importance in astrology.\n• In the months following the inferior conjunction of Venus, the outbreak of virus may make an attack. November and December of 2020 are remarkable in this context.\n• As the magnetic field is getting weaker and Solar Minimum is deepening, it is obvious that we are in a risky period not only due to the outbreak of Covid-19 but also in terms of outbreaks of other viruses. Existing virus may also mutate.\n• Jupiter-Pluto conjunctions are linked with great outbreaks as I mentioned in my previous article. The last conjunction of these two planets will occur in November this year. Then, the influences of this conjunction will be decreasing. Jupiter-Pluton conjunctions indicate important developments in health sector and in other scientific fields.\n• Lunar Nodes and eclipses in Gemini/Sagittarius axis will come to an end as of January 18, 2022. You may see the details in my previous article.\n• Ancient astrologers state Jupiter-Saturn conjunctions, the next one which will occur on December 21, 2020, are associated with plague and other epidemics. Saturn which is temporarily in Aquarius now, will return to Capricorn on July 2 and will then enter in Aquarius again on December 17, 2020. Jupiter will also be in Aquarius on December 19, 2020. Together with this transit, we may expect some big developments in medical field. Around the New Moon on February 11, 2021, some huge developments will be experienced and important step for the future will be taken.\n• Saturn will stay in Aquarius until March 7, 2023. On April 5, 2022, we will experience the second Mars-Saturn conjunction in Aquarius which indicates plague, fatal outbreaks and mass disasters. Consequently, it is obvious that Covid-19 will be on the scene in April and May this year. However, we should not relax in June. We should follow the instructions and rules and be strictly cautious. Otherwise, the number of deaths on earth may increase seriously. Developments about vaccine and medication are on the horizon. We should be hopeful about the future, we should be in cooperation and we should fight together against this common enemy. If we are careful about the precautions, then we may sigh with relief in summer months. However, we should be cautious about the possibility of another wave of outbreak in autumn. We are in a period where we will realize what the ancients meant with the term Great Mutation. 2021 will be extremely important within this context. We are at the edge of a huge change as the whole humanity. Through the developments in science, technology, data processing and education, our lives will transform into a new form which is highly different than today. [5] The meteoritic hypothesis; a statement of the results of a spectroscopic inquiry into the origin of cosmical systems. London and New York: Macmillan and Co.. [8] Wickramasinghe NC, Edward J Steele, Wainwright M., Gensuke Tokoro, Manju Fernando and Jiangwen Qu, Sunspot Cycle Minima and Pandemics: The Case for Vigilance?, Journal of Astrobiology & Outreach, June 23, 2017 [9] Wickramasinghe NC, Edward J Steele, Wainwright M., Gensuke Tokoro, Manju Fernando and Jiangwen Qu, Sunspot Cycle Minima and Pandemics: The Case for Vigilance?, Journal of Astrobiology & Outreach, June 23, 2017 [11] Co Authors: Türker Akıncı, Mete Yarar, Ramazan Kurtoğlu, Ali Bektan, Ali Selman Demirbağ, Erkan Türükten, Öner Döşer and Said Ercan, Başlangıç 2020, Destek Yayınları, March 2020, p 178 [13] Co Authors: Türker Akıncı, Mete Yarar, Ramazan Kurtoğlu, Ali Bektan, Ali Selman Demirbağ, Erkan Türükten, Öner Döşer and Said Ercan, Başlangıç 2020, Destek Yayınları, March 2020, p 178 [14] Co Authors: Türker Akıncı, Mete Yarar, Ramazan Kurtoğlu, Ali Bektan, Ali Selman Demirbağ, Erkan Türükten, Öner Döşer and Said Ercan, Başlangıç 2020, Destek Yayınları, March 2020, pp 171-172", "opengraph": {"locale": "en_US", "type": "article", "title": "The Sunspot Cycle,  Magnetic Field, Venus-Sun Inferior Conjunctions and Pandemics", "url": "https://cosmicintelligenceagency.com/sunspotcycle-astrology-venus-sun-conjunction-pandemics/", "site_name": "Cosmic*Intelligence*Agency", "article:published_time": "2022-01-13T00:26:56+00:00", "article:modified_time": "2022-01-13T10:55:28+00:00", "image": "https://cosmicintelligenceagency.com/wp-content/uploads/2022/01/Venus0Sun-magnetic-field-pandemics.png", "image:width": "1000", "image:height": "565", "image:type": "image/png", "description": "There has been some  research on the relations between the inferior conjunctions of Venus and the influenza pandemics that emerged in the 20th century.  Some research I read years ago has clearly stated that inferior conjunctions of Venus were directly related to pandemics.  The inferior conjunction of Venus with the Sun occurs  every 583.9"}, "tags": [], "tweets": [], "movies": [], "links": ["https://astrolojiokulu.com/en/gunes-minimumu-manyetik-alan-zayiflamasi-venus-gunes-inferior-kavusumu-ve-salgin-hastaliklar/?fbclid=IwAR2iteHlo2F0WSkRxXA2nFk1CAFtdp-M7F7f98_Dsjuc6RKX3plAbc5x-5I#_ftn1", "https://astrolojiokulu.com/en/gunes-minimumu-manyetik-alan-zayiflamasi-venus-gunes-inferior-kavusumu-ve-salgin-hastaliklar/?fbclid=IwAR2iteHlo2F0WSkRxXA2nFk1CAFtdp-M7F7f98_Dsjuc6RKX3plAbc5x-5I#_ftn2", "https://astrolojiokulu.com/en/gunes-minimumu-manyetik-alan-zayiflamasi-venus-gunes-inferior-kavusumu-ve-salgin-hastaliklar/?fbclid=IwAR2iteHlo2F0WSkRxXA2nFk1CAFtdp-M7F7f98_Dsjuc6RKX3plAbc5x-5I#_ftn3", "https://astrolojiokulu.com/en/gunes-minimumu-manyetik-alan-zayiflamasi-venus-gunes-inferior-kavusumu-ve-salgin-hastaliklar/?fbclid=IwAR2iteHlo2F0WSkRxXA2nFk1CAFtdp-M7F7f98_Dsjuc6RKX3plAbc5x-5I#_ftn4", "https://astrolojiokulu.com/en/gunes-minimumu-manyetik-alan-zayiflamasi-venus-gunes-inferior-kavusumu-ve-salgin-hastaliklar/?fbclid=IwAR2iteHlo2F0WSkRxXA2nFk1CAFtdp-M7F7f98_Dsjuc6RKX3plAbc5x-5I#_ftn5", "https://astrolojiokulu.com/en/gunes-minimumu-manyetik-alan-zayiflamasi-venus-gunes-inferior-kavusumu-ve-salgin-hastaliklar/?fbclid=IwAR2iteHlo2F0WSkRxXA2nFk1CAFtdp-M7F7f98_Dsjuc6RKX3plAbc5x-5I#_ftn6", "https://astrolojiokulu.com/en/gunes-minimumu-manyetik-alan-zayiflamasi-venus-gunes-inferior-kavusumu-ve-salgin-hastaliklar/?fbclid=IwAR2iteHlo2F0WSkRxXA2nFk1CAFtdp-M7F7f98_Dsjuc6RKX3plAbc5x-5I#_ftn7", "https://astrolojiokulu.com/en/gunes-minimumu-manyetik-alan-zayiflamasi-venus-gunes-inferior-kavusumu-ve-salgin-hastaliklar/?fbclid=IwAR2iteHlo2F0WSkRxXA2nFk1CAFtdp-M7F7f98_Dsjuc6RKX3plAbc5x-5I#_ftn8", "https://astrolojiokulu.com/en/gunes-minimumu-manyetik-alan-zayiflamasi-venus-gunes-inferior-kavusumu-ve-salgin-hastaliklar/?fbclid=IwAR2iteHlo2F0WSkRxXA2nFk1CAFtdp-M7F7f98_Dsjuc6RKX3plAbc5x-5I#_ftn9", "https://astrolojiokulu.com/en/gunes-minimumu-manyetik-alan-zayiflamasi-venus-gunes-inferior-kavusumu-ve-salgin-hastaliklar/?fbclid=IwAR2iteHlo2F0WSkRxXA2nFk1CAFtdp-M7F7f98_Dsjuc6RKX3plAbc5x-5I#_ftn10", "https://astrolojiokulu.com/en/gunes-minimumu-manyetik-alan-zayiflamasi-venus-gunes-inferior-kavusumu-ve-salgin-hastaliklar/?fbclid=IwAR2iteHlo2F0WSkRxXA2nFk1CAFtdp-M7F7f98_Dsjuc6RKX3plAbc5x-5I#_ftn11", "https://astrolojiokulu.com/en/gunes-minimumu-manyetik-alan-zayiflamasi-venus-gunes-inferior-kavusumu-ve-salgin-hastaliklar/?fbclid=IwAR2iteHlo2F0WSkRxXA2nFk1CAFtdp-M7F7f98_Dsjuc6RKX3plAbc5x-5I#_ftn12", "https://astrolojiokulu.com/en/gunes-minimumu-manyetik-alan-zayiflamasi-venus-gunes-inferior-kavusumu-ve-salgin-hastaliklar/?fbclid=IwAR2iteHlo2F0WSkRxXA2nFk1CAFtdp-M7F7f98_Dsjuc6RKX3plAbc5x-5I#_ftn13", "https://astrolojiokulu.com/en/gunes-minimumu-manyetik-alan-zayiflamasi-venus-gunes-inferior-kavusumu-ve-salgin-hastaliklar/?fbclid=IwAR2iteHlo2F0WSkRxXA2nFk1CAFtdp-M7F7f98_Dsjuc6RKX3plAbc5x-5I#_ftn14", "https://astrolojiokulu.com/en/gunes-minimumu-manyetik-alan-zayiflamasi-venus-gunes-inferior-kavusumu-ve-salgin-hastaliklar/?fbclid=IwAR2iteHlo2F0WSkRxXA2nFk1CAFtdp-M7F7f98_Dsjuc6RKX3plAbc5x-5I#_ftn15", "https://astrolojiokulu.com/en/", "https://www.onerdoser.com/", "https://astrolojiokulu.com/en/gunes-minimumu-manyetik-alan-zayiflamasi-venus-gunes-inferior-kavusumu-ve-salgin-hastaliklar/?fbclid=IwAR2iteHlo2F0WSkRxXA2nFk1CAFtdp-M7F7f98_Dsjuc6RKX3plAbc5x-5I#_ftnref1", "https://astrolojiokulu.com/en/gunes-minimumu-manyetik-alan-zayiflamasi-venus-gunes-inferior-kavusumu-ve-salgin-hastaliklar/?fbclid=IwAR2iteHlo2F0WSkRxXA2nFk1CAFtdp-M7F7f98_Dsjuc6RKX3plAbc5x-5I#_ftnref2", "https://www.researchgate.net/publication/23597515_The_interaction_of_the_solar_wind_with_Venus", "https://astrolojiokulu.com/en/gunes-minimumu-manyetik-alan-zayiflamasi-venus-gunes-inferior-kavusumu-ve-salgin-hastaliklar/?fbclid=IwAR2iteHlo2F0WSkRxXA2nFk1CAFtdp-M7F7f98_Dsjuc6RKX3plAbc5x-5I#_ftnref3", "https://astrolojiokulu.com/en/gunes-minimumu-manyetik-alan-zayiflamasi-venus-gunes-inferior-kavusumu-ve-salgin-hastaliklar/?fbclid=IwAR2iteHlo2F0WSkRxXA2nFk1CAFtdp-M7F7f98_Dsjuc6RKX3plAbc5x-5I#_ftnref4", "https://astrolojiokulu.com/en/gunes-minimumu-manyetik-alan-zayiflamasi-venus-gunes-inferior-kavusumu-ve-salgin-hastaliklar/?fbclid=IwAR2iteHlo2F0WSkRxXA2nFk1CAFtdp-M7F7f98_Dsjuc6RKX3plAbc5x-5I#_ftnref5", "https://astrolojiokulu.com/en/gunes-minimumu-manyetik-alan-zayiflamasi-venus-gunes-inferior-kavusumu-ve-salgin-hastaliklar/?fbclid=IwAR2iteHlo2F0WSkRxXA2nFk1CAFtdp-M7F7f98_Dsjuc6RKX3plAbc5x-5I#_ftnref6", "https://edition.cnn.com/2003/TECH/space/05/23/sars.fromspace/index.html", "https://astrolojiokulu.com/en/gunes-minimumu-manyetik-alan-zayiflamasi-venus-gunes-inferior-kavusumu-ve-salgin-hastaliklar/?fbclid=IwAR2iteHlo2F0WSkRxXA2nFk1CAFtdp-M7F7f98_Dsjuc6RKX3plAbc5x-5I#_ftnref7", "https://astrolojiokulu.com/en/gunes-minimumu-manyetik-alan-zayiflamasi-venus-gunes-inferior-kavusumu-ve-salgin-hastaliklar/?fbclid=IwAR2iteHlo2F0WSkRxXA2nFk1CAFtdp-M7F7f98_Dsjuc6RKX3plAbc5x-5I#_ftnref8", "https://astrolojiokulu.com/en/gunes-minimumu-manyetik-alan-zayiflamasi-venus-gunes-inferior-kavusumu-ve-salgin-hastaliklar/?fbclid=IwAR2iteHlo2F0WSkRxXA2nFk1CAFtdp-M7F7f98_Dsjuc6RKX3plAbc5x-5I#_ftnref9", "https://astrolojiokulu.com/en/gunes-minimumu-manyetik-alan-zayiflamasi-venus-gunes-inferior-kavusumu-ve-salgin-hastaliklar/?fbclid=IwAR2iteHlo2F0WSkRxXA2nFk1CAFtdp-M7F7f98_Dsjuc6RKX3plAbc5x-5I#_ftnref10", "https://astrolojiokulu.com/en/gunes-minimumu-manyetik-alan-zayiflamasi-venus-gunes-inferior-kavusumu-ve-salgin-hastaliklar/?fbclid=IwAR2iteHlo2F0WSkRxXA2nFk1CAFtdp-M7F7f98_Dsjuc6RKX3plAbc5x-5I#_ftnref11", "https://astrolojiokulu.com/en/gunes-minimumu-manyetik-alan-zayiflamasi-venus-gunes-inferior-kavusumu-ve-salgin-hastaliklar/?fbclid=IwAR2iteHlo2F0WSkRxXA2nFk1CAFtdp-M7F7f98_Dsjuc6RKX3plAbc5x-5I#_ftnref12", "https://www.express.co.uk/news/world/1232974/coronavirus-china-virus-pandemic-WHO", "https://astrolojiokulu.com/en/gunes-minimumu-manyetik-alan-zayiflamasi-venus-gunes-inferior-kavusumu-ve-salgin-hastaliklar/?fbclid=IwAR2iteHlo2F0WSkRxXA2nFk1CAFtdp-M7F7f98_Dsjuc6RKX3plAbc5x-5I#_ftnref13", "https://astrolojiokulu.com/en/gunes-minimumu-manyetik-alan-zayiflamasi-venus-gunes-inferior-kavusumu-ve-salgin-hastaliklar/?fbclid=IwAR2iteHlo2F0WSkRxXA2nFk1CAFtdp-M7F7f98_Dsjuc6RKX3plAbc5x-5I#_ftnref14", "https://astrolojiokulu.com/en/gunes-minimumu-manyetik-alan-zayiflamasi-venus-gunes-inferior-kavusumu-ve-salgin-hastaliklar/?fbclid=IwAR2iteHlo2F0WSkRxXA2nFk1CAFtdp-M7F7f98_Dsjuc6RKX3plAbc5x-5I#_ftnref15", "https://cosmicintelligenceagency.com/shop/all-products/webinars/big-choices-with-horary-astrology/", "https://cosmicintelligenceagency.com/shop/all-products/webinars/big-choices-with-horary-astrology/", "?add-to-cart=134324", "https://cosmicintelligenceagency.com/shop/all-products/webinars/big-choices-with-horary-astrology/", "https://cosmicintelligenceagency.com/shop/all-products/webinars/chart-shape-standoutsdigging-for-gold-in-the-birthchart/", "https://cosmicintelligenceagency.com/shop/all-products/webinars/chart-shape-standoutsdigging-for-gold-in-the-birthchart/", "?add-to-cart=133437", "https://cosmicintelligenceagency.com/shop/all-products/webinars/chart-shape-standoutsdigging-for-gold-in-the-birthchart/", "https://cosmicintelligenceagency.com/sunspotcycle-astrology-venus-sun-conjunction-pandemics/page/2/", "https://cosmicintelligenceagency.com/sunspotcycle-astrology-venus-sun-conjunction-pandemics/page/4/", "https://cosmicintelligenceagency.com/sunspotcycle-astrology-venus-sun-conjunction-pandemics/page/2/"], "authors": ["AGENT 24 - ONER DOSER"], "publish_date": "2022-01-13T00:26:56+00:00"}