{"result_id": "081005", "URL": "https://cosmicintelligenceagency.com/jupiter-on-aries-2022-2023/", "timestamp": "2023-04-25 14:50:06 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://cosmicintelligenceagency.com/wp-content/uploads/2018/06/cropped-logo_cia_color_743-32x32.jpg", "canonical": "https://cosmicintelligenceagency.com/jupiter-on-aries-2022-2023/", "encoding": "utf-8"}, "image": null, "domain": "cosmicintelligenceagency.com", "title": "Jupiter in Aries - 2022-2023", "cleaned_text": "How fitting that for the sabian oracle of the 1st degree fo the zodiac is \"A mermaid emerging from the ocean\" as Timelords 3 launches at zero Aries with front cover painting of \"Salacia\" by artist Sue Blake. Humanistic astrologer Dane Rudhyar writes that this degree represents : Emergence of new forms and of the potentiality of individual consciousness. Jupiter now expands and accentuates this point. Out of the collective turmoil of the Pisces waters we now seek a new purpose for growth and expansion, as individuals claim their active place in the world. With the potential for many new beginnings all around, like Salacia with the mermaid's tail. What will surface now as a conscious mission is the essence of Jupiter's recent time in Pisces. As he enters this new realm, it is time for new understanding and awareness to come to light. Jupiter represents our living truth, not just about what we believe and philosophise about, but what we do with it in the real world. The mantra's for Jupiter are always \"practice what you preach\" and \"walk your talk\", it's hard to be a fake with Jupiter as truth is his realm! In Aries, Jupiter now embraces the freedom and bravado to do just that, inviting many new experiences and adventure. As a native of Jupiter in Aries, I can relate. There is a radical spirit that comes to life with Jupiter in Aries, an impatience, a drive to move forward and not be held back. There is care less attitude about judgements for what one does, with a great call to follow one's own righteous path. The combination frees us up, from ties and binds and expectations on how we should behave according to others. As Jupiter now traverses Mars' diurnal sign, things are up front and in your face. There is a sense that it maybe time to fight or assert ourselves for what we believe, to fully live our truth. \"Coming Out\" in whichever way is needed are appropriate words. Our natal Mars will tell us more on how this passage will unfold, how we stand up for ourselves and what we believe. Our natal Mars will now get the next evolutionary training and infusion from Jupiter. As a great teacher, we can look where Jupiter has been travelling through our charts and houses over the years and recognise where and how we have grown and wisened up in particular areas of life. Wherever Aries is in our natal charts, will now be highlighted by Jupiter's benevolence and uplifting spirit and show us reasons to believe in better ways forward. Jupiter transits can be overwhelming and quite confronting and put us in our place somehow, to make judgements and difficult decisions for the greater good. Overall this transit asks us to clarify our vision of life. Think back to the last passage here in 2010 and 2011. What changed or shifted in your life back then?\n\nOn the world stage In June 2010 Jupiter's entrance into Aries, was met with Uranus, both at the powerpoint of zero Aries, not only had Wikileaks just released the \"Collateral Murder\" video of civilians being killed by US forces in Iraq, but tensions were rising in the Arab world in response to corruption, economic stagnation, mistrust of governments, all ultimately leading to the Arab Spring uprisings, that spread across much of the Arab world as Jupiter re-entered Aries in January 2011. With the to and fro from Aries to Pisces still to come in this next round with Jupiter crossing the zero point of Aries 3 times in the next year, we will all be awakening any dormant spirits, resentments, or creative seeds awaiting in the depths to arise. As this passage begins May 11th , 2022, just prior to a total lunar eclipse, the Ingress Chart shows a mutual reception to Mars in Pisces. What comes to light around this ingress and eclipse will set the course for the coming months ahead and to add to the \"alarm bells\" of shifts and changes is that Mercury turns for his next retrograde loop. World's can change during Mercury retrograde and eclipses, as new information comes to light or events change our course. Saturn continues to square the nodal axis, as so much doesn't seem to be changing very quickly these days. Saturn in Aquarius overall has seemed to put the future on hold, but let us believe, as always, that what we are in now, is the great seed of what will be birthed from this time. The same inflationary economy separating rich and poor, the same attitude to guns and war, the same draconic laws that serve the patriarchy, the ongoing lies and deceit of governments to stay in power, the same reliance on oil and gas that fuel wars. The ingress chart of 2022, like the Ingress of 2010, shows a significant Jupiter Uranus aspect. With Uranus mid Taurus at 45° to the zero point of Aries, we can see Uranus also in the spotlight, and the eclipses on the axis of Scorpio and Taurus, all indicating the strong urge for collective, innovative and radical ways forward from our reliance on climate polluting fuels, gas, oil.\n\nThe midpoint dial below shows Uranus and Jupiter facing off, but if we look around the dial we also see Saturn and Venus are opposite each other also 45° apart, Mars and Venus straddle Jupiter and Mercury and Eris align with the Jupiter midpoint close to this time. It will be very interesting what comes to the forefront at this zero point, these midpoints also also strongly activated. May the truth be known! Coming up on May 29th Mars enters his own sign to join forces with Jupiter at 3° Aries. What makes this combination particularly potent is that they will both also be parallel by declination at zero N and S of the ecliptic and equator crossing point. I have written about this also in my SKY SPY column (see page) 35, but worth mentioning again. Alarm bells sound a gain as the last time Jupiter and Mars met in Aries was May 2011, when Osama Bin Laden was killed by the US in Pakistan. Yet the last time Jupiter and Mars met at zero declination, was January 7th 1940 at 1° Aries, and as we can recall, the second world war which started on September 1st 1939 was in full swing. Will we see a shift, an escalation a turnaround by the end of May? By the time Jupiter returns to Aries for the solstice 21st December, 2022, Mars will have been retrograde in Gemini, since the end of October. The last time Mars was retrograde in Gemini was in December 2007, a retrograde that began in Cancer and moved back Gemini and we lived through the a period of extreme stress in global financial markets and banking systems. which led to the Global Financial Crisis . Jupiter and Pluto were at the end of Sagittarius and Uranus in the midst of the chaos of Pisces, overinflated lending systems began to fall apart, the banks were eventually bailed out, but many borrowers suffered greatly. A quick google search for the cause of GFC \"rising energy prices on global markets, leading to an increase in the rate of global inflation!\" reminds us of what we are experiencing now. It surely can't happen the same way again , as haven't we learnt by past mistakes, been alarmed by what happened back then? What will we LEARN this time around about how all these system continue to operate and for who they best serve? It's important to note that at this Capricorn solstice, Uranus will be back at 15° Taurus, aligned with Jupiter to the zero point again. We must believe change for the better is possible and even fight for it. As Jupiter's passage continues thru Aries his first main aspect in 2023 is a conjunction to Chiron at 14° 26' Aries, on March 12th, as Saturn enters Pisces a few days earlier. Their last conjunction was 14 years ago in 2009 at 22° Aquarius. With Jupiter and Chiron we get the combination of 2 great wisdom teachers, fusing together. With Chiron we enter the healing and shamanistic field of alternative medicine as Jupiter adds his ritualistic, intentional and spiritual Guru bent. It's particularly interesting to look at this cycle a bit closer, as their meetings in Aries are far and few between, and quite sporadic. As Chiron's cycle and orbit is irregular, with his longest transit thru Aries and Pisces and his shortest transits thru Virgo and Libra, we find their conjunctions and seeding cycles, mostly happen, from Aquarius through to Gemini, and mostly in Pisces and Taurus. (see graphic on next page\n\nLast time these 2 met in Aries was March 1976, when the fashions were wild, and the lifestyles bold. After the psychedelic revolution of the 60's the New Age movement started to emerge. Neptune was in Sagittarius too. The New Age movement was written about by American theosophist David Spangler with his book Revelation: The Birth of a New Age (1976) around this time as many spiritual Guru's, therapists and alternative healers rose to the occasion. The New Age movement grew, bookstores opened that specialized in the sale of New Age books, videos, and meditative aids. Other interesting facts around this seeding in 1976 was we find some significant firsts and Aries martian warrior related themes. NASA releases the famous 'Face on Mars'. Apple computers is formed, with Eris opposite power packed Pluto, another apple that did change the world. This is interesting \"A Program of mass vaccination in the United States against the 1976 swine flu outbreak, suspended due to public fears over side-effects!\". Richard Dawkins publishes \"The Selfish Gene\" which most simply states, that all forms of life on Earth begin with genes, and that the purpose of life is to make sure those genes survive. The tale of the cosmic warriors, Star War begins filming in Tunisia, where as in Argentina military forces depose president Isabel Perón, and Jethro Tull release their album Too Old to Rock 'n' Roll: Too Young to Die! GreenPeace warriors (established 1971) stop their first Russian harpoon ship (wikipedia 1976). To look briefly at the time before Jupiter met Chiron in Aries, it was 1821, 155 years prior, which correlates to the first industrial revolution, when we get a great leap in forward in technology, transport and textile production. Not surprising to find ourselves on the bridge between the next leap and great advance in technology. As Chiron and Jupiter come together we look at progress and its consequences in a new light, as industry, production, over consumption, waste, pollution, climate change come into the foreground, as we work on ways to alleviate the poisons and work to heal the system, with alternatives to a greener new age. It is always good to look back at these times for clarity and inspiration for what these signatures can bring with them and inspire us all to move intentionally ahead.\n\nThe next conjunction Jupiter makes in Aries is to wild and untamed goddess of Discord, Eris at the end of April 2023, again during eclipses and a Mercury retrograde station, with the first eclipse in the Aries polarity at 29° square Pluto, fresh in Aquarius. As Saturn's reign in his own sign eases off in Pisces, perhaps more of the new seeds and innovative ideas will be allowed to take shape. As we anticipate Pluto in Aquarius, it's as if Saturn's time in Aquarius over the past 3 years has been a precursor, as Pluto's passage through the sign of innovation and technological advances, will indeed show us progress and moving forward toward greener and more equal systems for all, that will inevitably slowly transform the world as we know it today. Jupiter's time in Aries ends on May the 16th, 2023 as he enters Taurus to square Pluto in Aquarius. Join me as a host a Webinar on May the 26th for our next C*I*A webinar - on the Jupiter in Aries transit in our charts. Free with a C*I*A Membership or $25 - DETAILS HERE", "opengraph": {"locale": "en_US", "type": "article", "title": "Jupiter in Aries - 2022-2023", "url": "https://cosmicintelligenceagency.com/jupiter-on-aries-2022-2023/", "site_name": "Cosmic*Intelligence*Agency", "article:published_time": "2023-03-01T01:39:02+00:00", "article:modified_time": "2023-03-07T02:46:40+00:00", "image": "https://cosmicintelligenceagency.com/wp-content/uploads/2022/05/Screen-Shot-2022-05-11-at-10.29.06-am.png", "image:width": "902", "image:height": "512", "image:type": "image/png", "description": "Jupiter Enters Aries - May 11th UTC, 2022\nStations retrograde 9° Aries - July 28th,\nRe-enters Pisces - October 28th\nStations direct 28° 50' Pisces - Nov 28th\nReturns to"}, "tags": [], "tweets": [], "movies": [], "links": ["https://en.wikipedia.org/wiki/NASA", "https://en.wikipedia.org/wiki/Face_on_Mars", "https://en.wikipedia.org/wiki/Vaccination", "https://en.wikipedia.org/wiki/1976_swine_flu_outbreak", "https://en.wikipedia.org/wiki/Richard_Dawkins", "https://en.wikipedia.org/wiki/The_Selfish_Gene", "https://en.wikipedia.org/wiki/Argentina", "https://en.wikipedia.org/wiki/Isabel_Per%C3%B3n", "https://en.wikipedia.org/wiki/Jethro_Tull_(band)", "https://en.wikipedia.org/wiki/Too_Old_to_Rock_%27n%27_Roll:_Too_Young_to_Die!", "https://cosmicintelligenceagency.com/shop/all-products/webinars/jupiter-in-aries/", "https://cosmicintelligenceagency.com/timelords-magazine-opt-in/"], "authors": ["AGENT 12 - JULIJA SIMAS"], "publish_date": "2023-03-01T01:39:02+00:00"}