{"result_id": "081002", "URL": "https://cosmicintelligenceagency.com/the-next-venus-star-loop-2022-2023/", "timestamp": "2023-04-25 14:49:58 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://cosmicintelligenceagency.com/wp-content/uploads/2018/06/cropped-logo_cia_color_743-32x32.jpg", "canonical": "https://cosmicintelligenceagency.com/the-next-venus-star-loop-2022-2023/", "encoding": "utf-8"}, "image": null, "domain": "cosmicintelligenceagency.com", "title": "The next Venus Star Loop – Capricorn/Libra/Leo January 2022 - August 2023", "cleaned_text": "The Venus cycle a near perfect orbit of 8 years, creating a 5 pointed star in the zodiac, gives us an endless and regular reference point that is easily calculated once we know the movement of Venus her cycle and her Star! For example as we move toward the Capricorn Star point – exact on January 9th, 12:47am UTC @ 18° 43′ Capricorn, consider what was happening in your life around January 2014 (and leading up to and after the exact retrograde star point) and also in January 2018 when this point was made with the outer conjunction of Venus and the Sun. As well as go back to 2010, 2006 and so on, as the star points, repeat every 4 years in the same place of the zodiac, slowly moving backwards over time, and shifting from inner rx conjunctions to repeat as outer conjunctions 4 years later. In my many years work, researching and teaching on the Venus Star , I have come to see each star point inner or outer as significant as the other. Astrologers tend to focus mostly on the retrogrades and returns of Venus every 8 years, when Venus returns to the same phase and place in the zodiac. Yet when working with the Star Points, their 4 year pulse, the Venusian rhythmic clock, only happens at the exact Star Point phase, inner or outer, revealing to us so much more when followed closely. The Moon too does this! If we look at any new Moon, we know 4 years later (give or take a degree or 2) there will a full Moon in the opposite degree (with the Sun in the same place). Then 4 years later again another new moon occurs in the same degrees. As the Venus point oscillates from inner and outer conjunctions every 9.5 months, from morning star to evening star in her orbit, as depicted in the image above, we can see she returns to the same place in the zodiac every 4 years, but from the opposite place. From the newness of the interior conjunction to the fulness of the outer conjunction, we get the never ending experience and view from another perspective on the recurring themes of from any of the 5 star points. Like the Moon, Venus waxes and wanes, grows in light, ascends and descends and disappears into the light of the Sun, not only once like the Moon with every 28 day cycle, yet twice during her 584 days cycle with the inner and outer conjunction. Since Galileo’s discoveries through his telescopes, we know that Venus has phases, and these days for many practising astrologers looking at and knowing our Venus phase has become quite significant. Like knowing our Moon phase, we look at where in the 19 month synodic loop our Venus was when we were born, giving more detail and archetypal clarity to our particular Venus, not just by sign, house and aspect but now also by phase. The Venus cycle is closely related to the The Fibonacci sequence and the Golden 1.6 ratio connecting our astrology charts to the fractal like nature of natural patterning and repetition, growth and evolution. For a full explanation of Venus cycle please READ Here Take a good look at the Capricorn Star Point dates to help inform you of what was going on in the 4 year and 8 year cycle! As we get ready for the next loop, let’s take a look more closely at what this next loop brings, keeping in mind some personal research from above!\n\nAs Venus retrograde in Capricorn bridges 2021 – 2022 – The Star Point, the Venus /Sun conjunction shows the midpoint of the retrograde, the end of the past 19 month cycle and the begining of the next one. Moving retrograde for 14° degrees, over 40 days/40 nights the retrograde passes are the times of the cycle when Venus falls to earth so to speak, bringing down her wisdom of the past cycle, letting go and shedding the unwanted past, with a renewed purpose and what will now begin her new journey. With Venus retrograde and under the Sun’s beams, many astrologers point to the retrograde as “Her Journey to the underworld” yet it is the outer conjunction that points to the myth of descent to the “underworld”, and her furthest passage away from earth. In the retrograde pass Venus only disappears for 8-10 days, where as at her superior conjunction, she disappears for 60-80 days and takes 7 months and 7 waning Moon gates to get there , after her max elongation. This is what the descent of Inanna and Venus is all about. The 40 day 40 night retrograde, is a re-set, re-view, re-alignment, and a great preparation for the long journey ahead, the next 19 month great mission. I like to say to the Underworld or Upperworld, as either could apply, as not everyone has an underworld experience at this time. At the superior conjunct phase – Venus exposes herself fully to …… fullfill a mission, deal with a relationship issue, embrace the comings and goings of loved ones, confronting her inner self or her dark shadow. The Morning Star phase (begins at retrograde inner conjunction) and the descent, to underworld begins after maximum brightness and elongation. The Evening Star phase (begins at outer conjunction) and is the ascent out of the underworld, that finishes as she is crowned the Queen of the night, form maximum elongation to full brightness as the evening star again. Reflect on the past 19 month cycle as we get ready to birth the New Venus Star and the next 19 month cycle, that begins on January the 9th, 2022 at 18° 45′ Capricorn, after which the crescent of Venus rises as the morning star once again. Find this new Venus Star place, 19° Capricorn, in your astrology chart, check what house it is in and what aspects it makes. Reflect back in 4 year and 8 year cycles, back to Jan 2018 and Jan 2014, 2010, 2006 etc to gather the intell on what this star point is about for you, now upgrading to the next phase of your Venusian evolution!\n\nUse the image above , to keep track of the keypoints in the coming cycle: There has been some debate in our community over the years as to where the cycle of Venus actually begins. The sky watcher shamanic astrologers would say that the cycle begins with the heliacal rising of Venus as she rises as the morning star in the east. Traditionalist astrologers would say, that the cycle begins with Venus rising as an evening star in the west. The reasoning for the latter is that Venus at this part of her cycle is low in the sky, dim, is ascending and from here gains in light, as she also appears like the Moon does when new, in the western evening sky! There a a few things to consider here, with both of the above viewpoints. The shamanic way, is a delight to follow, which I definitely encourage, yet it is much more difficult to co-ordinate, as the rise can happen at slightly different times and days, depending on place, atmosphere and latitudes and is not so simply found by an ephemeris, yet some software is rectifying this. Yet with the shamanic viewpoint and the visual sky gaining importance in our astrology circles this is indeed a practice that I see as important to be followed and even encouraged as it teaches us so much more about the living sky. From the ancient Babylonians to the Mayans and thru many other ancient cultures we know that the heliacal rise (rising out of the Sun’s beams) of the planets and stars as always being most significant. Yet it is much easier and direct to work out phases and co-ordinate timing by using the exact Star Point. One thing that makes no sense to me with the more traditional method, and also perhaps as they were devised before the discovery of Venus’ phases by Galileo, is that to consider Venus as an evening star, rising in the west as the begining of her cycle like a fresh new Moon does, simply makes no sense. The Moon orbits the Earth and Venus orbits the Sun. Their meeting point with the Earth, for the Moon is a New Moon, and is why it makes sense as the reason for Venus’ newness, as she transits between Earth and Sun, not when she rises out of the outer conjunction, but when she moves off to the east, rising before the Sun to become the morning star!\n\nWith the retrograde of Venus in Capricorn and as the Venus Star point perfects and Venus comes to light again as morning star, we are set off on a new Capricorn themed cycle. A cycle that begins with reconnecting and re-evaluating Capricorn themes in our lives, shown by what house and aspects the retrograde and star point have made. CAPRICORN represents our achievements, ambitions, acknowledgments, responsibilities, how we live by the laws of society, how we value ourselves in society, how we are rewarded, what our families expect of us and how we conform in Saturn’s ruled sign, for our own good or detriment! We have all recently, and gathering before this exact star point, been greatly affected as our rights as citizens have changed so much during the pandemic, the need for vaccine passports, living with new mandates, constantly updated and chaotic rules and regulations, as living in society in this new Aquarian Age shows it true controlling colours! We have all been affected differently and have made choices accordingly, by what we value most and chose to stand by! Capricorn themes also bring those in leadership, our governing bodies and corporations and our rulings systems into the spotlight! We’ve witnessed their increasing power and hold over us, we’ve witnessed their triumphs and foibles and lack of transparency, and blatant opportunism in the global mission to fight a pandemic. With this star point, Venus calls in a reshuffle in the system with a response for a shift in leadership around the globe, watch this space over coming months as the consequences of recent events come to light in 2022, as the Capricorn star stays active, like eclipse energies for months after and months before exactness. The Capricorn Star Point also points to the elite and privileged, and those that society looks up too or puts in the spotlight. We can expect a fall from grace from some and a reshuffle of leadership in the months to come. As the Venus retrograde began conjunct Pluto, Ghisliane Maxwell, former socialite went to trail and was convicted for her part in Epstein’s child sex trafficking, implicating also royal Prince Andrew. Ghisliane’s astrology chart shows the Capricorn star point in her 8th house, and Pluto transiting her Saturn, where the current Venus retrograde began. For Prince Andrew, the Capricorn star point squares his MC/IC from the 6th house, and quincunx natal Uranus in his 1st house, Jupiter transits his Pisces Sun and the 8th house and Saturn his Descendant. Novak Djokovic another celebrity in the spotlight at this time, being denied a visa to enter Australia for his much loved Australian Open tournament which he has won 9 times. He is unvaccinated and has no medical exemption, which are the requirements to enter the tournament. The Venus Star Point joins his ASC, and it is still not clear if he will have to leave the country yet, raising a great controversy of the Australia Open’s and the Australian government’s rules and regulations on vaccine mandates. Latest news now is (Jan 14th, 2022) his visa has been cancelled and he will have to leave the country. As this Venus Point gathered momentum with the retrograde that began conjunct the power hungry and deconstructive Pluto in the sign of governments, and a war begins under this Star Point 6 weeks later. as threats of nuclear destruction in the hands of megalomaniacs and untrusted governments who want to rule the world- start a War in Ukraine. The independence chart for the Ukraine has at 16° Capricorn rising Ascendant also – Aust 23rd 1991. With these few example we can see how the Venus Star Point is activated and aligns with the them and story going on in someones’ like and chart. When deciphering transit etc, it is not always so clear which transit maybe the most significant for a time periods, especially when many BIG transits are happening at once. I find that Venus and her magic star, connects the story for us and helps us focus on where to look at what to pay most attention to in our astrology charts. Set yourself for the next 19 month journey ahead, by first RE-evaluating, re-assigning, re-working, re-valuing, re-doing, re-sourcing and re-adjusting life updating to your current values! Dig deep, and allow for what will rise strike during this, saying no, saying yes, are all turning points on the journey ahead! Look forward to October 2022 and the new Libra Star Point , which is the Scorpio star point of the past 100 years moves to Libra, for the first time in our lives, and is sure to bring in a new energy into that area of our charts and lives and on a mundane level could be quite dynamic- watch this space. Assess what maybe brewing for you in this area of the chart, and 20° Leo in August 2023 as the cycle completes. Adapt the same analysis as you do with this Capricorn star point for setting gaols and making plans. Next Star point LIBRA Oct 25th, 2022 is Venus ruled and occurs as Mars stations retrograde in Gemini at 26° in trine to the new star point! Let Venus be you guide to connect the unseen dots in your astrology chart! More info continues in Julija’s SKY SPY column in TIMELORDS Magazine, and our next Venus Star Libra Symposium ONLINE OCT 2nd and our much anticipated VENUS: Magic of the cosmos Retreat -Oct 20-23rd, at the time of the Venus transition", "opengraph": {"locale": "en_US", "type": "article", "title": "The next Venus Star Loop –  Capricorn/Libra/Leo January 2022 - August 2023", "url": "https://cosmicintelligenceagency.com/the-next-venus-star-loop-2022-2023/", "site_name": "Cosmic*Intelligence*Agency", "article:published_time": "2022-01-24T04:50:19+00:00", "article:modified_time": "2022-09-13T00:32:00+00:00", "image": "https://cosmicintelligenceagency.com/wp-content/uploads/2022/01/V-800-x-800-px-Facebook-Post-1000-x-565-px.png", "image:width": "1000", "image:height": "565", "image:type": "image/png", "description": "PART 1 \nSTAR POINT CAPRICORN \nThe Venus cycle a near perfect orbit of 8 years, creating a 5 pointed star in the zodiac, gives us an endless and regular reference point that is easily calculated once we know the movement of Venus her cycle and her Star!\nFor example as we move toward"}, "tags": [], "tweets": [], "movies": [], "links": ["https://cosmicintelligenceagency.com/thefractalnatureofastrologyvenus-star/", "https://cosmicintelligenceagency.com/shop/all-products/webinars/venus-star-libra-2022-astrology/", "https://cosmicintelligenceagency.com/timelords-magazine", "https://cosmicintelligenceagency.com/shop/all-products/webinars/venus-star-libra-2022-astrology/", "https://cosmicintelligenceagency.com/venus-astrology-retreat-melbourne-australia/", "https://cosmicintelligenceagency.com/timelords-magazine-opt-in/", "https://cosmicintelligenceagency.com/venus-astrology-retreat-melbourne-australia/"], "authors": ["AGENT 12 - JULIJA SIMAS"], "publish_date": "2022-01-24T04:50:19+00:00"}