{"result_id": "081015", "URL": "https://cosmicintelligenceagency.com/healingandhomeopathy/", "timestamp": "2023-04-25 14:50:35 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://cosmicintelligenceagency.com/wp-content/uploads/2018/06/cropped-logo_cia_color_743-32x32.jpg", "canonical": "https://cosmicintelligenceagency.com/healingandhomeopathy/", "encoding": "utf-8"}, "image": null, "domain": "cosmicintelligenceagency.com", "title": "The healing light of homeopathy.", "cleaned_text": "The healing light of homeopathy and the legacy of Hahnemann.\n\nThose who follow my writing know that I am deep into the art of healing. My love for astrology is beyond words, however, as I work towards healing people, I find there is a missing link within astrology and in other consciousness work I do, and that is the workings of the body and its energy. Just to talk about the healing that required in any given situation is nothing compared to finding a cure that works.\n\nI am a big fan in helping and facilitating actual change for someone. What I find evident when working with astrology is that it can make us stuck within the limits of our minds, always searching for answers outside of ourselves, instead of understanding and healing the energies that roam inside the body.\n\nWe try a lot of different consciousness remedies, from past life regression therapies to psychotherapy. We see doctors to help us deal with physical ailments and the pains in the body. We try to figure out where psychosomatic pain stems from, as many alternative supermarkets provide only immediate relief to our pains, and rarely any long term cures. We chant our mantras and we do our yoga. But our bodies still carry the pains of the past.\n\nSo, faced with the same challenges as most people on earth, I have explored and ventured into the art of healing for almost two decades, which has eventually brought me to ponder homeopathy, a very fine art that deals with healing life energy. I searched for a homeopath about half a year ago and have since been blessed with a most marvellous healing journey. I have since found that nothing compares and believe me, I have seen and searched a lot.\n\nBy using Homeopathy, I have found ancient ills have lifted from my body, energies that seemed have been with me through the ages, creating tension in my body. Tension no amount of meditation or healing was able to lift. Tension, that I see now, needed homeopathy to be healed.\n\nI am now in love with this fabulous art, for years I’ve paid attention to the army of sceptics constantly invading mainstream media, particularly denigrating the use of homeopathy, the healing method created by Christian Friedrick Samuel Hahnemann back in the 1800’s. Hahnemann himself had to endure much criticism for his work, but he prevailed and left a legacy that has blown many minds and healed many ailments since.\n\nToday, the 10th of April, we celebrate this man born 262 years ago and who spent his life persistently fighting against the mainstream medical field, whilst all the while developing a cleaner, safer, less intrusive(and expensive) way of healing the body, mind and soul.\n\nHahnemann was born with a deeply fiery chart, with both the Moon and the Sun in Aries, and the ascendant in Sagittarius, loyal to the nature of fire, he must have been allergic to the coercion the medical field at that time (and now) demanded. He found the practice of mainstream medicine to even be harmful to the patient and soon left his position as a doctor, to study chemistry and earn his living translating texts instead.\n\n See his astro Chart here http://www.astro.com/astro-databank/Hahnemann,_Samuel\n\nAs the fiery Aries he was, with Pluto in Sagittarius directly on the ascendant, he never gave up, and we see a man who very much fought for what he believed in. Those born with a strong Pluto placement, know well the amount of resistance and pull that comes with the great need to be authentic. A true Plutonic person says it as it is, where as in Sagittarius on the ascendant even more so, as their plutonic essence is drawn from a powerful source deep within, and can come across often as very confronting. Hahnemann was a man of his word, and he walked his talk. It surely helped that he had Saturn in hard-working Capricorn squaring his Sun in Aries. Fire can be unstable and changeable, but with a healthy dose of Saturn in the mix, opposite Neptune, we find strong support and stamina to help seeing his big ideas and concepts pull through. Hahnemann, surely left an incredible legacy, a legacy driven by the enormous energy of all these fire planets and stabilized by the strong Saturn placement. Despite the resistance he found to his work, homeopathy endured, and is still around, as fans and practising users and devotees continue to grow in numbers around the globe.\n\nToday we see people extremely frustrated with the status quo, not only in politics, but also in science and especially in the area of health. People are struggling with issues traditional medicine cannot seem to grasp, especially in the area of chronic diseases. Astrologically we are coming out of the long period of Uranus-Pluto square (2012-2015), which according to Richard Tarnas, denotes a period of revolutionary change in the fields of science and politics. Hahnemann himself was born with the opening square of Pluto and Uranus also, back in 1755, Uranus Pisces, Pluto Sagittarius. Even though the years of the squares are officially over, we seem to be generally coming into a deeper understanding of the health of the planet and what is needing to change, to be transformed for us to heal both collectively and personally. Chiron the wounded healer’s long stay in Pisces, the sign for the collective field of emotion, has also brought attention to the need for each individual to work on healing themselves in order to help free and heal the energy of the collective.\n\nThese days with so much pollution and toxicity circulating on the planet and in our delicate environment, we can see that with Neptune now in Pisces and Pisces being water, symbolically and literally, water binds us all together as a symbol of the universal oneness, in the collective ocean. Through water, pollution travels freely, and in these times with Neptune in Pisces, we have an energy circulating that is driven towards the healing of the collective. With so much pollution on the inside and on the outside, the use of clean water, clean air , clean medicine and clean remedies are the best way to go.\n\nPisces rules the collective and individual’s immune system, and it is here, the borderline between oneself and others, that illnesses and ailments contract as we rub off against each other, as we meet in realms we are not conscious of, exist. Neptune has a correlation to the collective unconscious and makes me think of the theory of miasms, fundamental to understanding homeopathy and illness. I had the great privilege of being able to talk to one of the world’s leading homeopaths Christian Arndt, who was also born the same day April 10th a couple of hundred years later than the forefather of homeopathy, also from the cradle of homeopathy, Germany.\n\nSo I took the opportunity to ask him about miasms:\n\nThe term miasma comes from the Greek and means defilement, unpleasant or unhealthy smell or vapour. It is used as a clarification for the acute and chronic diseases according to the theory of Samuel Hahnemann. The miasma is of great importance in the context of chronic diseases. Hahnemann discovered that almost every patient with a chronic disease either had scabies, syphilis or gonorrhea in their prehistory, and since that particular infection, the patients no longer felt healthy. He called these infections and the resulting illness tendency miasms. The miasm that came from the scabies he called Psora, or the non-venereal miasma. He described the other two as venereal miasms as they were the result of sexual diseases. That which came from the syphilies he called syphilitic miasma and that of the gonorrhea sykotic miasma. This miasmatic disposition is passed on to the next generations and inherited. In the last century more miasms were added because of new illnesses. The most important hereby is the tuberculinic miasm which carries the acquired or inherited tuberculine disposition. All the miasms are acquired and/or inherited dispositions and not an acute disease.\n\n“Vapour”. No doubt relating to Pisces- Hahnemann himself had no less than three planets, Mars, Venus and Uranus plus the South Node in Pisces, and he had an intuitive understanding and connection to the great sea of humanity, where virus’s and bacteria travel freely and challenge the often fragile boundaries between us. Miasms are not necessarily acute illnesses, but dispositions. Generations later, illnesses themselves maybe silenced, but miasms linger. The diseases that Hahnemann proposed as being original diseases are in fact very ancients ills in the body of humanity. According to Hahnemann’s theory, they are the roots of the tree, with many illnesses branching out from each root, which later erupt as individual diseases.\n\nCurious to find out more, I asked Arndt about the different miasmas:\n\nC.A: Here I would like to elaborate the miasma theory.\n\nPsora miasm: Psora means itching and comes from Greek. The basic weakness of this miasm is the basis for all other miasms. Only functional disturbances occur without organic changes, which are annoying but not yet a threat to the person concerned. The psora is characterized by skin diseases (with itching and scratching) and nervous hypersensitivity.\n\nSycotic miasm: Diseases that develop slowly and accompany those who are affected for many years. In the beginning the miasm is manifested with fixed mucus, tough discharges and inflammations in the genital region. Then warts, fibroids, cysts, but also rheumatism or mental problems can occur. Moreover typical symptoms of sykosis are pelvic diseases, tumors and inflammations with yellow-green secretions. We find the symptoms often by night\n\nSyphilis miasm : This miasma destroys both – life and body. The diseases occur suddenly and unexpectedly, they progress rapidly and very aggressive and destructive. Syphilitic disorders are initially mostly painless and are usually recognized only when it is almost too late for healing.\n\n Destruction also manifests itself in the idea that aggressiveness and violence are also self-contradictory (suicide or addiction behavior). Also congenital malformations and birth defects are an expression of this miasm. Especially in the case of syphilitic miasmas, suppression and interference can have fatal consequences. The vitality gets out of balance, the disease progresses dramatically or a “new” disease develops in the shortest possible time.\n\nTuberculosis miasm: Typical signs for this miasma are chronic respiratory diseases, chronic middle ear inflammation, purulent angina and any kind of allergy. Restlessness and hyperactive urge to move lead to weakness and exhaustion.\n\nAs astrologers who take an interest in healing and medical astrology, understanding miasma is very important in our field of work. Medical astrology is a very complex and often confusing area of astrological study and practice and can become very dangerous to for an individual if we generalise about our findings. It is completely necessary for anyone practising medical astrology to firstly have a very good understanding of the way the body works, but also very helpful to have a good knowledge of homeopathy, herbal medicine and energy healing as well. It is imperative to really understand how the energy of the body functions and yet we still seem to quarrel about the planetary rulership of the chakras.. The human body and its energy is a very complex organism and for those that practice Medical astrologer, this needs to taken very seriously.\n\nWhen we consider the hereditary facts regarding miasmas, I asked Arndt about what astrologers often dabble in and with when doing astrology, karma. Working with astrology, it is hard to find a way around the subject as we see so many hereditary patterns in a chart, and the individual often spends a lifetime freeing themselves from the negative ones.\n\nQ:In astrology we attempt to find healing or release through the use of consciousness alone. What could the healing remedy of homeopathy do for us in order to release some of these patterns that people struggle with and that we research in the astrology, for instance deeply inherited issues?:\n\nC.A: Homeopathy is a stimulating and regulation therapy. With the help of the appropriate homeopathic remedy a stimulus is set in the body that activates the self-healing powers and helps the body to be overcome the appropriate illness.\n\nHomeopathy considers disease as an expression of disturbed or weakened vitality. As a result of defective self-regulation, the visible, perceptible and measurable symptoms arise as well as subjective changes in the mind or mental well-being. Homeopathy expands the point of view. If causes are first to be found in the area of vitality (energetically) then causative treatment must also have a strengthening effect in the field of energy.\n\nPisces and the archetype of Neptune correlates to the metaphysical and thus, it is there, that we get to understand that the immune system is not strengthened enough when we merely use drugs to suppress symptoms.\n\nI then asked Arndt about the suppression of illnesses:\n\nC.A: Diseases such as nursing cradle in infancy, neurodermatitis, hay fever and asthma are closely related. In the prehistory of asthmatics are to be found very often skin eruptions (e.g. milk scab). These skin rashes were mostly treated with allopathic medicaments (e.g. cortisone). In the later course, usually only a few years later, the asthmatic complaints begin. By the suppression of the skin eruptions the overall condition of the patient has deteriorated. The disturbance of the vital force has increased and the appearance of the disease has been displaced from the surface of the skin to an internal organ. If symptoms of the body are suppressed – also through operations, vaccinations or e.g desiccation of hemorrhoids or varicose veins – the miasma can deepen and thereby cause more serious diseases.\n\nTherefore in terms of understanding illness, homeopathy offers a deeper understanding to the body. According to Arndt homeopathy’s major theory is “Similia similibus curentur” (like cures like) and that there are practically no illnesses that homeopathy cannot help. Homeopathy really sees the body’s complexities and takes them seriously.\n\nGoing back to the chart of Hahnemann, we see that his Uranus is at 13 degrees Pisces. This is the degree of Neptune’s transit this year. Perhaps now, this year, we can see the work of this genius being brought to new light. Neptune is almost half-way through Pisces and we still have a year with Chiron in this sign, now crossing over the south node of Hahnemann’s chart and later to his Mercury. This astrologer will surely await with the eyes of an eagle to see what developing new sciences come up with. I am certain that it will do credit to the legacy of Hahnemann and greatly help the work of Christian Arndt and his colleagues relentlessly swimming upstream against all odds. Just like astrologers, homeopaths are still around, and of course this is not surprising, as we know that both work.", "opengraph": {"locale": "en_US", "type": "article", "title": "The healing light of homeopathy.", "url": "https://cosmicintelligenceagency.com/healingandhomeopathy/", "site_name": "Cosmic*Intelligence*Agency", "article:published_time": "2017-04-10T01:46:13+00:00", "article:modified_time": "2021-09-29T11:58:11+00:00", "image": "https://cosmicintelligenceagency.com/wp-content/uploads/2017/04/Healing-light.jpg", "image:width": "780", "image:height": "513", "image:type": "image/jpeg", "description": "The healing light of homeopathy and the legacy of Hahnemann.\nThose who follow my writing know that I am deep into the art of healing. My love for astrology is beyond words, however, as I work towards healing people, I find there is a missing link within astrology and in other consciousness work I do,"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.astro.com/astro-databank/Hahnemann,_Samuel", "http://www.christianarndt.de/"], "authors": ["Agent 32 Sol Jonassen"], "publish_date": "2017-04-10T01:46:13+00:00"}