{"result_id": "081013", "URL": "https://cosmicintelligenceagency.com/co-creating-our-future/", "timestamp": "2023-04-25 14:50:30 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://cosmicintelligenceagency.com/wp-content/uploads/2018/06/cropped-logo_cia_color_743-32x32.jpg", "canonical": "https://cosmicintelligenceagency.com/co-creating-our-future/", "encoding": "utf-8"}, "image": null, "domain": "cosmicintelligenceagency.com", "title": "Co-Creating and Re-Imagining our Future", "cleaned_text": "Across the world, people know that times are changing, that we’re moving into uncharted territories. This is an evolutionary moment for humankind, as we undergo a metamorphosis on the physical, psychological, and spiritual levels.\n\nAstrologers have looked ahead to January of 2020, when the Saturn–Pluto conjunction, Jupiter, and a cast of other planets and asteroids would create a stellium in Capricorn. There’s been a voice in our ears whispering of the times of change to come since the last Uranus–Pluto conjunction in Virgo in the mid-1960s, but since 2008, when Pluto entered Capricorn, the volume has steadily increased. Although hindsight is always 20-20, some astrologers, particularly from the financial sector, were able to predict this coronavirus pandemic. (1)\n\nThe current jolting shift in collective consciousness has been simmering for decades, if not centuries. Since the 1800’s, Jupiter–Saturn conjunctions in the earth element have remained constant (with the exception of 1980, when it was in Libra), supporting the Industrial Revolution and its accompanying exploitation of natural resources. The Technological Revolution began in the 1990’s with the Uranus–Neptune conjunction. As we approach the Jupiter–Saturn conjunction in Aquarius in December 2020, attention will gradually swing from material to social concerns. The necessity to learn to live equitably on a planet with an ever-increasing human population, while using new forms of energy and technology to support our lives, are among the more obvious changes we can anticipate. The arrival of the Covid-19 crisis makes it obvious that we’ve come to the boiling point, but at the same time it connects us all across the globe in ways we could never have imagined, both materially and spiritually.\n\nThe Saturn, Pluto, and Jupiter conjunctions in late Capricorn are all in their Balsamic phases, that is, in the very last chapter of their respective cycles. This involves a powerful and mandatory process of letting go of constructs and systems that are no longer viable. In the Balsamic phase there is urgency to plant new seeds for future generations. Uranus in Taurus invites us to fertilize and nurture the old soil before it fails completely. Despite the feeling that we have little to no control in this overwhelming situation, the good news is that we have more capacity to design the future than we think, as long as we don’t let fear reign.\n\nThe times empower us to orient our vision toward the future, inviting us to collectively determine our destiny. What can we do to inspire and fuel the rebirth of humankind? How can we synch up with the organic cycles of nature? It will likely take until 2024, when Pluto fully enters Aquarius, to see the full scope of what needs restoration as we experience the first intimations of a “new world” taking shape.\n\nCapricorn is associated with governments, large corporations, institutions, economics, infrastructure, conservatism, authority, tradition, and austerity. Since Pluto’s ingress into Capricorn in 2008, humanity has been seeing the results of what the prevailing culture has denied. We might recognize that what is being exposed now is the unconscious side of our history, culture, and heritage. Pluto has a way of shedding light on unconscious material, and slowly but surely percolating it up to the surface. We get glimpses of what we fear, and confront the nature of our compulsions and the ways we are disempowered, personally and collectively. The constructs we have relied on for safety are no longer working or holding us together.\n\nSaturn invites us to reassess, review, discard, and restructure. Currently dancing with Pluto in Capricorn, Saturn is exalted in the sign of Libra, which carries the theme of justice, and the pandemic is illuminating injustice across the social spectrum. Saturn also reminds us to get back to basics and to simplify. What do we want our lives to look like? Now is the time to set our new course. With the patience and right effort that Father Time demands, we can imagine and create a new way of life.\n\nThe last time Saturn and Pluto were conjunct in Capricorn happened in 1518, with Uranus in Taurus, just as today. That period was also a turning point in human evolution, signaled by the Reformation and expansion into “the new world.” In this current transit period, we inhabit a world facing environmental destruction. How do we unite our sensibilities, and our hearts and minds, to nurture and restore our precious planet?\n\nJupiter exaggerates whatever it touches, so now, in Capricorn, the sign of its fall, things are looking rather dire. Jupiter can also increase a sense of hope for the future; it is up to us to embrace the spirit of optimism. Jupiter is also magnifying all things Plutonian. There are three Jupiter–Pluto conjunctions in 2020 — April 4; June 30, and the last on November 12. These time periods may amplify the extremes of Pluto, as we simultaneously face death and the hope of rebirth.\n\nWith Neptune in Pisces until 2026, we are confronting the disturbing reality of toxins on our planet. Pisces is the last sign of the zodiac, where everything accumulates — we might imagine a collective landfill. It is important that we recognize the opportunity to take constructive action now if we want to continue harvesting fresh food and drinking clean water. Now more than ever we have the opportunity to connect with the divine universe, and unconditional love and acceptance. What are we willing to sacrifice?\n\nSince March 2019, Uranus has been in Taurus and this is a game changer. The truth comes out about the material world, including agriculture, money, our bodies, and natural resources. To our surprise, the coronavirus has shown us how rapidly our planet can recover, given even a short reprieve from humanity’s assaults. Most of us living today have never seen earth’s true beauty, absent from human impact, air pollution, and noise. Fortunately, the gods are conspiring to help us!\n\nMars retrograde this September 9 – November 13 deserves some special attention. This period looks like a wild ride, as it includes the U.S. presidential election, which has consequences for the entire world. Retrograde Mars and his difficult and often mean-spirited sister, Eris, will conjoin in Aries while opposing the Sun in Libra, and squaring Jupiter, Pluto, Saturn, and the asteroid Pallas Athena in Capricorn. The dates that may be particularly potent are between October 13-19, 2020; the New Moon at 23°53’ Libra on October 16 also falls within this window. It looks like a combative gathering of discord, conflict, and rebellion. Between October 13 and November 3, Mercury, retrograde in Scorpio and Libra, joins the bash. We often grow personally and collectively the most under painful conditions and this may be one of them.\n\nOner Doser, a renowned Turkish astrologer, has researched pandemics, and his article on the subject can be read in the June/Solstice issue of Career Astrologer, published by OPA, Organization of Professional Astrology. It is fascinating that out of seven pandemics throughout the centuries, six have had the lunar nodes on the Gemini-Sagittarius axis and five have had Jupiter–Pluto conjunctions. The Covid-19 pandemic has both. The Jupiter–Pluto conjunctions magnify the themes of the times, and both increase and expansion occur for better and for worse. According to medical astrology, the Gemini-Sagittarius axis corresponds to respiratory diseases. We saw this nodal axis activated during the Spanish flu, the Asian flu, SARS, Hanta, Zika, MERS, and now Covid-19. (Mr. Doser has also observed that these events are often accompanied by decreased solar activity.)\n\nAlthough we may witness a downward turn of infections in May when Mars conjoins Neptune in Pisces, it is likely that there will be another wave and increase of toxins/poisons in June-July and likely October 2020 that is supported by the second Jupiter–Pluto conjunction in late June. It doesn’t appear that this pandemic will be over soon, as there will likely be a third and final wave late this year before we find a vaccine or cure.\n\nFor the next 200 years or so we will experience the Jupiter–Saturn conjunctions in air signs (except one in water, in 2159). The chart of Jupiter and Saturn’s synodic cycle in Aquarius on December 21, 2020, has an exact Pluto–Mars square to Eris at 23° Capricorn and Aries, respectively, with Uranus in Taurus square to Jupiter–Saturn in Aquarius. Change is easy for us all to foresee; global reorganization has already begun.\n\nWe are all co-creators in this Universe, so let’s make conscious and informed choices now and going into the future. In a time of physical, psychological, and spiritual transformation, our infinite wisdom is available to be tapped and applied. The objective is a more wholesome and integrated way of life, within and without, for all people. In this powerful time of co-creating our future, let’s remember that we are the authors of our own lives — for ourselves personally and for the world we are creating as a global family.\n\n(1) Astrologer Christeen Skinner gave a talk at the Alexandria iBase Project in early 2020 regarding a potential upcoming virus in which she referred to Theodore White’s paper “The Grand Minimum: ‘A Major Global Era Begins’ Pandemic on Earth as a New Bright Comet Approaches.” Also, in her book, Navigating the Financial Universe (2019) , Ms. Skinner wrote of the correlation of Pluto aspects with Chiron at the outbreak of disease — e.g., Bubonic plague, Black Death, Spanish flu, Aids and Ebola. She mentioned the quintile aspect between Pluto and Chiron in February 2020 as a potential marker of a pandemic.", "opengraph": {"locale": "en_US", "type": "article", "title": "Co-Creating and Re-Imagining our Future", "url": "https://cosmicintelligenceagency.com/co-creating-our-future/", "site_name": "Cosmic*Intelligence*Agency", "article:published_time": "2020-09-26T23:53:20+00:00", "article:modified_time": "2021-09-05T05:17:28+00:00", "image": "https://cosmicintelligenceagency.com/wp-content/uploads/2020/09/Untitled-design.png", "image:width": "359", "image:height": "226", "image:type": "image/png", "description": "Across the world, people know that times are changing, that we’re moving into uncharted territories. This is an evolutionary moment for humankind, as we undergo a metamorphosis on the physical, psychological, and spiritual levels.\nAstrologers have looked ahead to January of 2020, when the Saturn–Pluto conjunction, Jupiter, and a cast of other planets and asteroids would"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": ["AGENT 122 - ALEXANDRA KARACOSTAS"], "publish_date": "2020-09-26T23:53:20+00:00"}