{"result_id": "081004", "URL": "https://cosmicintelligenceagency.com/monthlysunsignupdatedecember/", "timestamp": "2023-04-25 14:50:04 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://cosmicintelligenceagency.com/wp-content/uploads/2018/06/cropped-logo_cia_color_743-32x32.jpg", "canonical": "https://cosmicintelligenceagency.com/monthlysunsignupdatedecember/", "encoding": "utf-8"}, "image": null, "domain": "cosmicintelligenceagency.com", "title": "Astrology for Month Ahead DECEMBER 2020 - Sun Sign Update", "cleaned_text": "December opens on the heels of a lunar eclipse in Gemini (November 30) and the second wave of Covid-19 in full force. Despite the daily spikes, there’s good news too. Several companies have announced promising Covid-19 vaccine results. Let us hope for a fast and effective rollout. Yes, it is time to look ahead. Mercury in Sagittarius, December 1 to 20, sets the holidays and more into a fuller swing. This Mercury transit increases the search for better answers, opportunities, profits, results, and gratification. On the final stretch of a six-month tour of Aries, Mars the action planet, is also on a punched-up initiative. Mercury and Mars, an optimizing aspect for setting big wheels in motion, are a team through mid month. They’ll reach their peak (a trine) on the solar eclipse December 14. Launching with the sun in trine to Mars and the moon in Scorpio making several dynamic aspects on December 10, Hanukah coincides with a run of significant stellar action. The total solar eclipse in Sagittarius on December 14 coincides with the USA electoral college vote. Supplying fresh fuel to a “future bound” trajectory, this eclipse is particularly auspicious for the launch of new ventures. Venus in Scorpio conjunct Juno, the contract asteroid, underscores the karmic nature of circumstances. Also making their contributions to the action track, Venus begins a four-week tour of Sagittarius and Chiron in Aries ends a 5-month retrograde cycle on December 15. If your natal chart picks up this eclipse it will (a) carry you far, (b) give you no choice but to confront the challenge full on, or (c) a combination of both. This eclipse can be especially catapulting for Gemini, Virgo, Sagittarius, and Pisces folk. Also riding the crest of the total solar eclipse are two more important planetary advances. December 16, Saturn enters Aquarius, to stay until March 2023. December 19, Jupiter enters Aquarius (a one-year transit). On the winter solstice, December 21, Jupiter meets with Saturn (by conjunction) for the first time in 20 years. This is a momentous “signature of the times” planetary pairing. Jupiter/Saturn now begin the next twenty-year growth cycle relative to economic, social, and cultural development. Additionally, they are at work on a bigger picture clock. Jupiter and Saturn are known as the “Great Time-Keepers”, marking chapters of our collective history in (overlapping 180-years to) 240-year cycles. On December 21, Jupiter/Saturn mark the start of the next collective “hour”. Consider this sub-era transit as a fore-runner to the transition of the Ages. When does the Age of Aquarius – or in modern terminology – the Age of Science, Technology, A.I. & Climate Change begin? It is not an overnight process, but suffice to say, we stand on the brink of it now. Evidence of a radically altered reality and global consciousness is already well underway. Despite the holidays still ahead, by December 23, we may have a sense of making it over the hump. Mars square Pluto and Mercury square Chiron can produce a noticeable energy shift. These transits are well timed for a change of pace to observe the holidays. The moon tours Taurus for Christmas Day, suggesting right where you are is the best place to be. Slow down, stay put, keep it simple, easy and relaxed. A Leo moon sets the backdrop for New Year’s Eve. Celebrations and gatherings may be different this year, but it is up to you to make it good for yourself and for your loved ones. My deepest heartfelt best wishes to you and yours, not only for the holidays, but for every day. May you find compassion for self in both the peaceful and challenging moments, help, encouragement, and support when you find yourself in need, kindness and respect from each person you meet.\n\nDecember opens with Mercury in Sagittarius setting the action onto a fuller swing. This transit directs more attention on the fast approaching future. Mars continues in Aries through January 6. This final stretch of the Mars in Aries transit tops you up with fresh fuel, especially for breaking new ground. Even so, Mars in Aries will not have full clearance until it surpasses Pluto (Dec 23). While the new year begins, Mars in Taurus (starting January 6) will not have full clearance until January 20. December 9 to 13 potentials are on brew. Creative projects, the spiritual quest or downtime to heal is a good use of your time. Go with the flow, ease your way along, give in to the moment, even if that means putting it on chill or slipping out of sight for a short time. Launching with the sun in trine to Mars and the moon in Scorpio making several dynamic aspects on December 10, Hanukah coincides with a significant run of stars. December 14 (USA electoral college vote!) delivers a total solar eclipse in Sagittarius. This eclipse sets the future into play in some notable or unexpected way. This is especially so if you are born on or near April 10 to 13. The eclipse and the days close by (especially December 10, 14, 15) are opportune for making a move or taking a big step. That could involve a change of address, career, or lifestyle. It could even set you onto the world stage in some significant way. Mercury is in trine to Mars for the eclipse. This can trigger well timed opportunity or something lucrative. Watch for a special event, or news (perhaps from someone who is a distance away). The eclipse favours publishing, teaching, education, exhibiting or marketing, trading, or relocation. Venus conjunct Juno (the contract asteroid), and the end of Chiron retrograde (Dec 15) dial up the karmic potency and/or a sense of fate connected to events and undertakings. What ends or begins sets the long range into play. Also, the eclipse can see you face a truth full on. That truth could come in the form of a realization, message delivered, or circumstances that put you in the know. Saturn enters Aquarius on December 16 and Jupiter does the same on December 19. They will meet on December 21, the winter solstice, to begin a new twenty-year cycle of economic and cultural development. Additionally, this planetary pairing begins a bigger picture 240-year cycle correlating to a collective era. On the personal note, Jupiter/Saturn in Aquarius now quicken the pace regarding personal life reinvention. A new reality awaits you! For the most part, you are likely to welcome the change. December 23 can take you over the hump. December 24 should hit the spot well thanks to Mercury in trine to Uranus. Despite the changes dictated by Covid-19, the transiting moon in Taurus makes for a smooth go of Christmas Day. The moon transits Leo for New Year’s Eve. It’s up to you to make the most of it! The holidays are upon us, but it is wise to start to think and plan beyond them. Setting wheels in motion, December opens on the heels of a lunar eclipse in Gemini (November 30) and Mercury’s advance into Sagittarius (December 1). Mars has spent the past five months stirring potential from a background or out of sight position. As of January 6, Mars will finally advance into “make-it-real” Taurus. This month and next, Mars will have a few things to get out of the way before it hits full steam ahead. By January 20, Mars will hit a major trigger point. What can you do between now and then to get yourself ready to go? Launching with the sun in trine to Mars and the moon in Scorpio making several dynamic aspects on December 10, Hanukah coincides with a significant run of stars. What you don’t know now, you’ll know soon enough. The total solar eclipse on December 14 can set the future on go in some definitive way. It could give you a significant springboard, jumpstart, or a big shove. Perhaps there will be news, an important meeting or conversation, or papers to sign. Use this eclipse to refinance, invest, to move it in a new direction or to launch something altogether new (self included!). The eclipse enhances fertility prospects too. December 15, Venus enters Sagittarius and Chiron ends a five-month retrograde tour. Both dial up the karmic potency behind circumstances, actions, and decisions. Added expense, effort or investment is in the mix, but it will prove worthwhile, especially when the intention is to stay ahead of the curve. As of December 23, it is time to cut yourself loose. The moon in Taurus for Christmas Day suggests the pace of the day hits it just right. Having said that, whether to do with Covid-19 restrictions or something else, the sun in square to Chiron can put a bittersweet spin on the day. December 29 delivers a full moon in emotional and sentimental Cancer. This full moon also draws from Chiron (by square aspect). It is time to say goodbye to the past and to embrace the new/evolving reality. The Leo moon in opposition to Saturn on Dec 31 sets the backdrop for a toned-down New Year’s Eve celebration. Even so, you should have no problem keeping yourself entertained. Do you feel a compelling drive or a necessity to hit the ground running? That’s the effect of the lunar eclipse in Gemini on November 30, and Mercury’s advance into Sagittarius on December 1. If these planetary prompts haven’t done the trick, look to December 10 (the start of Hanukah) onward to set the dial onto “all systems go”. The sun’s trine to Mars (December 10) sets off a run of facilitating stars. Accompanied by Mercury in trine to Mars, the total solar eclipse in Sagittarius on December 14 sets a good/auspicious backdrop for action, undertakings and new ventures. This is also the date of the USA electoral college vote. Also blended into the destiny producing mix are the transits of Venus into Sagittarius and the end of Chiron retrograde on December 15. The recent lunar eclipse (November 30) holds influence for those born May 28 – 30. The total solar eclipse holds significance for those born June 10 to 14. Mars is on the final stretch of a six-month tour through Aries. Although it is done with retrograde, Mars won’t have full clearance until it surpasses Pluto (December 23). Mars leaves Aries for Taurus on January 6, but it will have more to get through. It will hit full steam ahead by January 20 when it aligns with Uranus (conjunction). The big news this month is the advance of both Saturn (December 16) and Jupiter (December 19) into Aquarius. Both transits set an opportunity backdrop, especially regarding personal and lifestyle reinvention. Don’t know how to play it next? Watch, wait and learn. Stay observant and rely on your instincts and intuition to fill in the missing blanks. Messages and signals will make their way into your awareness. Get ready to catch the wave as soon as you can decipher those messages and/or spot the opportunity. Don’t hesitate to try a new lifestyle, career or relationship on for size. Saturn in Aquarius, starting December 16, and Jupiter in Aquarius, starting December 19, are a plus for your sign. On December 21, the winter solstice, they officially set sail on a new course. As stated in the intro, they begin a new twenty-year economic and social development cycle an also a bigger picture 240-year history-making chapter. Christmas and New Year’s Eve celebrations may require adjustments this year, but over-all the stars set a good backdrop. Take it as it comes and make the most of it. December will be over in the blink of an eye. That does not mean to say that that it will be unremarkable! Quite the opposite. December 1 to 20, Mercury sprints through Sagittarius. One way or another the transit will put you to work. It can set you onto a hunt, for better answers, a better plan or avenue, or for someplace better to be (emotionally or otherwise). Mercury in Sagittarius can prompt you to have a more honest talk, with yourself or another. Launching with the sun in trine to Mars and the moon in Scorpio making several dynamic aspects on December 10, Hanukah coincides with a significant run of stars. The total solar eclipse on December 14 can set you/your life on go in some major way, especially regarding work, funding, legal paperwork, and health-related matters. Initially you could feel overwhelmed, or that a situation has gotten out of hand and is far beyond your control. On the other hand (or despite the onslaught), Mercury’s trine Mars suggests that matters are moving along as they should. Starting December 15, Venus in Sagittarius can help you to make an honest assessment. It is a good starting place. Venus can also set a good backdrop for finding new solutions, better advice, more/better work; also, for renegotiation, upgrades, and for seeing improvement. Investments will prove worth the expense or the time. The end of Chiron retrograde (December 15) also sets wheels in motion. Don’t resist breaking down camp or taking a big step in order to reach higher ground. Of course, how the eclipses transpire for you depends on whether they make dynamic contact to your natal chart. Otherwise you will simply witness the eclipse work indirectly. This solar eclipse coincides with the USA electoral college vote. Saturn enters Aquarius on December 16. Jupiter enters Aquarius on December 19. On December 21, they will meet to begin their next twenty-year cycle. Both transits now bring you to the brink of the next phase of your life. Expect to face significant ground-breaking, now, over the short haul and over the long term too. Some of it you’ll choose, some of it will be heaped on you. The coming years can completely reinvent your finances, a relationship status, and (most importantly) your relationship with your own soul. Welcome change and change will support you with fresh opportunity. Resistance dries up your opportunity/is the harder way to go. Covid-19 may put a dent in the holidays, but it is up to you to make full use of the time you have. Gift yourself and others with the best of yourself.\n\nLaunching on the heels of the recent lunar eclipse in Gemini (November 30) and Mercury’s trek into Sagittarius (December 1), December does not waste any time getting off the ground and neither should you. Despite ongoing uncertainties, the month ahead is built for progress. Some things can go better than anticipated. Hanukah launches on December 10 with the sun in trine to Mars infusing fresh life into it. The week that follows keeps the action and the opportunity going strong. Coinciding with the USA electoral college vote, December 14 delivers a total solar eclipse in Sagittarius. A total solar eclipse infuses a new chapter with greater potency/with a more dynamic life force. Eclipses mark significant karmic passages and thresholds. If this eclipse aligns with your natal chart in a significant way, you will feel a more obvious sense of fate or destiny in play. Neptune’s influence tends to expose or reveal. It can also mark events or passages as historic, even iconic. Watch for the eclipse momentum to pick up steam as of December 9, 10. Coinciding with the eclipse, Mercury trine Mars is good for hitting the ground running. The eclipse holds good promise for the future, for long term benefit or long-range opportunity. Prosperity, profitability, and fertility prospects can be on the upswing. As such, it is an excellent time to make a big move or to take risk on something new. Exhibit, teach, put yourself out on show. Seek the spotlight, it can be your time to stand out, to shine. Special attention can come your way, from one other or from an audience. An investment or a risk (time, money or heart) can be called for, but in truth, if you want to win (and/or win big), when is not? Saturn enters Aquarius on December 16. Jupiter enters Aquarius on December 19. On December 21, Jupiter and Saturn begin a new twenty-year manifesting cycle. The “Great Time-Keepers” also mark a bigger picture cycle in the evolution of consciousness on the planet. On the personal note, Saturn and Jupiter place you at the start of significant personal reinvention. Over time, you’ll become even more adept at observing yourself in action, this regarding how you relate, how you are perceived, and what you attract. Consider the next couple of fast track years as a test pilot for the breaking of new ground. December 23 to 31 is for making the most of what you have going for you. Celebrating with the crowd may be off the table for New Year’s Eve, but the Leo moon sets a backdrop for getting your pleasure fill in some quieter or low-key way. Do you find yourself on a switched track or heading onto next phase? This is the influence of the recent lunar eclipse in Gemini (November 30). The pace picks up from here. As of December 1, Mercury hits go in Sagittarius. The next few weeks are opportune, so take advantage of all that you can, make the most of the moment. Get a headstart on it now – you’ll thank yourself later. Mars continues in Aries through January 6, but it is still working it out with Pluto in Capricorn through December 23. Having said that, through mid month Mars hits a good stride, first with the sun (December 10, the start of Hanukah) and then with Mercury (on the total solar eclipse December 14). The total solar eclipse in Sagittarius places you at the start of a new personal growth curve or family life chapter, especially so if your birthday falls between September 13 to 17. Relocation, a major financial undertaking, or additional training are favoured. Holding jurisdiction over the short range (next six months) and long range (next few years) too, the eclipse advances the process of understanding yourself better and on building something of greater value and benefit to sustain you for the long haul. Future bound – that’s where the train is heading. On December 16, Saturn begins a two-and-one-half-year stint through Aquarius. On December 19, Jupiter will begin its one-year tour. On the winter solstice (December 21) Jupiter will meet with Saturn (by conjunction). This launches a new twenty-year growth cycle (economic, social, personal). The “Great Time-Keepers” also mark the start of a 240-year era of collective and cultural growth. Consider their pairing as one of the signature ribbon-cutting transits regarding the Age of Aquarius – or what will later be recognized as the Age of Technology & Science, Space Colonization, Climate Change, and A.I. December 23 to the end of the month is a time to pull back and relax. Covid-19 may call for adjustments to your holiday activities, but always, life is what you make of it! Despite what’s in the way of clear sailing, the stars place you onto a fast track. The recent lunar eclipse (November 30) and Mercury’s advance into Sagittarius are mobilizing. You are wise to aim for ahead of the curve. One way or another, the first half of the month keeps the focus on the future and the get-ahead plan. Continuing through Aries to January 6, Mars continues to keep you ambitious, perhaps also somewhat challenged. By December 23, Mars will be mostly over the hump, but won’t be completely untethered (or unleashed) until January 20. Launching with the sun in trine to Mars and the moon in Scorpio making several dynamic aspects on December 10, Hanukah coincides with the stars on an energy surge. December 14 delivers a total solar eclipse in Sagittarius. The eclipse is accompanied by Mercury in trine to Mars. The eclipse also draws from Venus into Sagittarius and the end of Chiron retrograde in Aries on December 15. Watch for news, an arrival, departure, or opportunity of significance, or for something fresh to thrust the action switch. Beyond the holidays, there may be something special to celebrate. Setting the future into play in some significant way, the eclipse places you at the departure gateway of what was, what is, and what will be. It is also opportune time for expressing your mind or heart, freeing yourself up, or for hitting the ground running and giving it your all. Someone of significance can enter or exit your life. The eclipse could prompt a large purchase or investment. Among the many possibilities, the eclipse favours teaching, education, writing or publishing, coaching renegotiating, paperwork, marketing, relocation, legal matters, travel, and immigration. December 16, Saturn begins a two-and-one-half-year tour of Aquarius. December 19, Jupiter begins a one-year tour of the same sign. On the winter solstice, December 21, Jupiter and Saturn team up to launch the next twenty-year manifesting cycle and a next 240-year bigger picture/collective era cycle. Although Covid-19 will continue to be with us for awhile yet, both planetary advances can bring a fresh air feel to life and its opportunities. Plenty of new activities and interests, perhaps new challenges too; you aren’t likely to find yourself bored or wondering how to fill your time. Both Jupiter and Saturn support significant personal and lifestyle reinvention. By all means – take the new you for a test drive. Covid-19 may put a dent in the holidays, but each day is what you make of it. Right where you are is the best place to be. Due to the recent retrograde cycle, Mercury has been on an extended tour of Scorpio. Perhaps it has uncovered something important that needs to be addressed. Venus in Scorpio continues the assessment and feel your way along process to December 15. Mercury trek through Sagittarius, December 1 to 20, helps you to cover plenty of ground. Transiting Aries to January 6, Mars continues to push you to correct, fix, improve, or heal it. It’s a trial and error, learn as you go process. Hanukah kicks off on December 10 with the sun trine Mars and the moon in Scorpio making several dynamic aspects. Expect the momentum to continue. The total solar eclipse in Sagittarius on December 14 puts assets, resources, investments, losses and/or gains on the increase. It is time to hit the ground running with plans, conversations, renovations and negotiations. The eclipse is accompanied by Mercury’s trine to Mars and by the end of Chiron’s retrograde tour and Venus into Sagittarius (both on December 15). The karmic nature of circumstances and involvements are likely not lost on you. December 16, Saturn enters Aquarius. December 19, Jupiter follows suit. As of the winter solstice (December 21), Jupiter conjuncts Saturn. This pairing launches the next twenty-year manifesting cycle and a next era for the collective too (a 240-year cycle.) For you personally, Jupiter/Saturn begins a next chapter of personal and lifestyle reinvention. You are poised to make significant personal breakthroughs in the coming years. Off with the old, on with the new and updated version of yourself. You may eventually hear yourself say that you are amazed at all that has transpired, all that you have become, that you hardly recognize yourself any longer. By December 23, you can feel you are over a hump or that you have reached a goal post, even if that is simply a matter of letting yourself off the hook until the holidays are surpassed. Overall, your time is what you make of it. Keep it simple, make it as good for yourself as best you can. Has the recent lunar eclipse (November 30) kicked it up a notch? You can expect to keep on the good roll as Mercury lights a fire in Sagittarius (December 1 to 20). Venus, the attraction planet, favours you from December 15 to January 8. Be here now. In the moment is where its at. Motivation is in good supply. Instincts and intuition serve you well too. Hanukah kicks off on December 10 with the sun trine Mars and the moon in Scorpio making several dynamic aspects. Expect the intensity dial to continue. December 14 delivers a total solar eclipse in Sagittarius. This eclipse places you at the start of a new chapter. It is likely one that’s been in the works for some time. The eclipse also sets you up for the long range. Mercury trine Mars clears the way for you. Your timing is good, your opportunity is ripe for the taking. The lunar eclipse of November 30 is catalyst for those born on or near that eclipse, while the December 15 eclipse is of heightened significance for those born on or near that date. Both eclipses hold a springboard effect. They shorten the timeline to tomorrow. In fact, your future is already knocking on the door. Keeping you held up or in a holding pattern no longer, Saturn enters Aquarius on December 16. Jupiter does the same on December 19. On the winter solstice, December 21, Jupiter and Saturn join forces. In so doing they set go on the next twenty-year manifesting and growth cycle (relevant to economic cycles). The “Great Time-Keepers” now mark the start of a bigger picture 240-year cycle regarding collective growth. The world is a changed place and you are a changed person too. Welcome to the future! It is happening in real time. December 23 to 31, the stars are well set for switching gears and for making the most of it right where you are. The bad news is the virulent second wave of Covid-19. The good news is that vaccines will soon be ready for distribution. December opens on the heels of a lunar eclipse in Gemini (November 30) and Mercury at the start of a quick stint in Sagittarius (December 1 to 20). Aiming to make short regarding the work that lies ahead, Mars in Aries is on an industrious track too. By the time December 23, Mars will surpass Pluto. By this point you should feel you have arrived at a significant threshold. It is the dividing line between what was and what is about to overtake as the new reality. Hanukah kicks off on December 10 with the sun trine Mars and the moon in Scorpio making several dynamic aspects. Action is well timed. Coinciding with the USA electoral college vote, December 14 delivers a total solar eclipse in Sagittarius. You may or may not witness this eclipse in some eventful or obvious way in your personal life, but know it sets a fertile or seeding backdrop regarding future potentials. At some later date, you will come to know what this solar eclipse set into play. Mercury in trine aspect to Mars on the eclipse can put you or it on go in some straight-forward, to the point, well timed, or well directed way. On December 15, Venus enters Sagittarius and Chiron in Aries ends retrograde. You’ll feel their individual influences as a natural progression. It is a time when things can get sorted out and moved forward reasonably well. After the past couple of years touring Capricorn, Saturn is finally moving on. December 16, Saturn advances into Aquarius. On December 19, Jupiter also enters this sign (a one-year tour). On the winter solstice, Jupiter teams up with Saturn to begin a new twelve-year cycle regarding economic and material growth. Known as the “Great Time-Keepers”, this planetary pairing also marks the start of a new 240-year era. Consider this Jupiter/Saturn cycle as a forerunner influence regarding the (already in the works) coming New Age. The holidays may be different this year, but don’t let it stop you from making the most of the moment! December 23 to 31 is a time to shake off the outside world and to gift yourself and loved ones with the best of yourself. Have you had recent news? Do you feel a sense of new prospects around the next corner? December opens on the heels of a lunar eclipse in Gemini providing a sense of fresh air pumped into the tires. Putting everything to do with the holidays into full swing, Mercury tours Sagittarius from December 1 to 20. Hanukah kicks off on December 10. The sun in trine Mars is good for action taking. The moon in Scorpio makes several dynamic aspects, so expect passions or emotions to be a significant driving force. December 14, (the day of the USA electoral college vote), delivers a total solar eclipse in Sagittarius. Clearing the runway for Biden to become president, Mercury’s trine to Mars, a cut to the chase influence, accompanies this eclipse. On December 15, Chiron in Aries ends retrograde, and Venus begins a four-week tour of Sagittarius. The stars are working round the clock to chart a new course, to get us past the election, Covid-19, the holidays and 2020. (Can’t come soon enough you say? Amen to that!) The big news this month is the advance of both Saturn and Jupiter into Aquarius. (Saturn enters Aquarius on December 16 and will tenant your sign until March 7, 2023. (The Saturn return years are upon you. If you don’t know what that means, it is time for an astrology reading!) Jupiter enters Aquarius on December 19. It will take a brief dip into Pisces mid May to the end of July and return to your sign to stay until the end of 2021. Saturn crystalizes and Jupiter enlarges the scope. As such, this planetary pairing is optimal for new initiatives, and especially so for personal and/or lifestyle reinvention. On the winter solstice (December 21) Jupiter meets with Saturn (by conjunction) for the first time in 20 years. It is the official launch of a short and long count. The twenty-year cycle sets the timetable for economic trends. The bigger picture 240-year cycle marks a collective era relative to the advance of new cultural and social norms. Consider this bigger picture transit as a forerunner for the new world age (Age of Science and Technology, Climate Change, A.I.) Also stoking a fresh fire, Pallas Athene, the warrior goddess, tours Aquarius from December 7 to March 7. Pallas assists you to harness your courage and intuition. The transit supports independence, fresh initiatives, and creative enterprise. You are likely to feel the momentum shift as Mars squares Pluto on December 23. Mercury trines Uranus on Christmas Day. The moon tenants Leo for New Year’s Eve. While Covid-19 has put a big dent in our lives, it is up to you to spend your time well, your heart too. The holidays are yours for the taking. The lunar eclipse in Gemini (November 30) has likely been informing or exposing, perhaps surprisingly so. This is due not only to the general influence of an eclipse, but also to the position of Neptune which has been, and continues to be, in dynamic tension to the karmic axis (the north and south nodes of the moon). Some time there are simply no satisfactory answers or explanations to quell anxiety or emotional pain. Time is a healer. There are moments and situations when answers or explanations evade you, when you simply must let it go and move on. December opens with Mercury launching a short stint in Sagittarius. It is a good transit for new projects and activities, for putting greater distance between you and the past, for turning your attention to tomorrow rather than yesterday. Launching with the sun in trine to Mars and the moon in Scorpio making several dynamic aspects on December 10, Hanukah coincides with a run of stars dialing up the action and emotional intensity. December 14 (the date of the USA electoral college vote) delivers a total solar eclipse in Sagittarius. Several important transits contribute to the eclipse: Venus conjunct Juno, the contract asteroid, and Mercury trines Mars in Aries for starters. On December 15, Venus enters Sagittarius and Chiron in Aries ends retrograde. It is an auspicious eclipse for future bound initiatives. The eclipse can set the long range or long term into play. You can feel the momentousness of this eclipse the strongest if your birthday falls between March 10 – 14. Saturn enters Aquarius on December 16 and Jupiter does the same on December 19. On December 21 (the winter solstice), Jupiter will meet with Saturn to launch a new twenty-year economic cycle and a new 240-year era regarding the collective experience. In coming years, Jupiter/Saturn will leave a fresh imprint on social, cultural, and political norms. We have already been working toward a new collective consciousness and a new world age. This Jupiter/Saturn bigger picture is a forerunner transit to the Age of Aquarius (or – take your pick of names: The Age of Science, Technology, A.I., Climate Change and Space Colonization.) Mars turns a corner with Pluto on December 23. You can feel this as reaching a goal post or a well-timed energy shift. The moon in Taurus for Christmas Day is ideal for relaxation and taking it slow.", "opengraph": {"locale": "en_US", "type": "article", "title": "Astrology for Month Ahead DECEMBER 2020 - Sun Sign Update", "url": "https://cosmicintelligenceagency.com/monthlysunsignupdatedecember/", "site_name": "Cosmic*Intelligence*Agency", "article:published_time": "2020-11-23T23:31:59+00:00", "article:modified_time": "2021-09-07T02:34:10+00:00", "image": "https://cosmicintelligenceagency.com/wp-content/uploads/2021/09/eye-008.jpg", "image:width": "359", "image:height": "226", "image:type": "image/jpeg", "description": "December 14: TOTAL SOLAR ECLIPSE in Sagittarius, 8:16 am (23:08 Sagittarius)\nDecember 29: Full Moon in Cancer, 7:28 pm (8:53 Cancer)\nDecember 1: Mercury into Sagittarius: 11:50 am\nDecember 7: Pallas Athene into Aquarius: 12:11 pm\nDecember 15: Venus into Sagittarius: 8:21 am\nDecember 15: Chiron ends"}, "tags": [], "tweets": [], "movies": [], "links": ["https://cosmicintelligenceagency.com/bravenewworldastrology/", "https://cosmicintelligenceagency.com/bravenewworldastrology/", "https://cosmicintelligenceagency.com/bravenewworldastrology/"], "authors": ["AGENT 300 - ROSE MARCUS"], "publish_date": "2020-11-23T23:31:59+00:00"}