{"result_id": "081014", "URL": "https://cosmicintelligenceagency.com/the-emerald-fire-the-new-moon-in-virgo-7th-of-september-2021/", "timestamp": "2023-04-25 14:50:32 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://cosmicintelligenceagency.com/wp-content/uploads/2018/06/cropped-logo_cia_color_743-32x32.jpg", "canonical": "https://cosmicintelligenceagency.com/the-emerald-fire-the-new-moon-in-virgo-7th-of-september-2021/", "encoding": "utf-8"}, "image": null, "domain": "cosmicintelligenceagency.com", "title": "The Emerald Fire: The New Moon in Virgo – 7th of September 2021", "cleaned_text": "Do you know that trees talk? Well, they do. They talk to each other, and they’ll talk to you if you listen. Trouble is, white people don’t listen. They never learned to listen to Indians so I don’t suppose they’ll listen to other voices in Nature. But I have learned a lot from trees: sometimes about the weather, sometimes about animals, sometimes about the Great Spirit.”\n\nIt is because of the existence of Virgo that we can communicate with all of matter.\n\nAccording to esoteric tradition, the heart of our cosmos is an infinite net of luminous, living threads of vegetable matter, perpetually interweaving, along which light travels, filling every part of our universe. Known in the Christian tradition as Paradise, this vegetable being is an isogenic, self-reliant state of consciousness that existed without desire or dissatisfaction. Memorials to this blissful satiation has been retained in the stories of Indra’s Net, the Mother Goddess, the Green Knight, the Green Man and the zodiacal sign of Virgo.\n\nFundamental to the ethereal side of our physical anatomy, this vegetal life force, or Chi, flows along tendrilous filaments concentring outwards from one of seven principle flowers. Known as the chakra system, this ethereal system exists within an elusive realm between spirit and matter, mirroring your physical body, animating and vitalising your life as it flows along these pathways of light.\n\nThis vegetable state is but one aspect of our overall consciousness and is retained within you as an essential part of your body. Less esoterically, the sympathetic nervous system, which helps to regulate your body’s unconscious and involuntary actions, when taken out from our body, looks like a tall plant, akin to a tree with a trunk and branches and is also a remembrance of our pre-hominid form.\n\nYou have retained the ability to talk to nature or matter – plants, rocks, flowers, landscapes, animals and your body, because of its existence, mirrored within the astrological tradition as the zodiacal sign of Virgo, or Mutable Earth. The term Mutable, refers to a pathway of interconnected communication between self and the word at large. The element of Earth merely indicates the physical embodiment of consciousness. Together Mutable Earth simply refers to the aptitude to communicate to the ‘kingdom’ of incarnation. And it is an energetic pathway that everyone contains within them irrespectively of whether they first breath was inhaled between the 23rd/ 24th August and 23rd/ 24th September.\n\nTeeming with life, our world remains immanent, even if it has become increasingly more difficult to ‘hear’ the dialogue from Nature so removed we are becoming as we ensoul digital technology. Further and further we have moved from the sovereignty of Nature as we worship to the Left and dismiss or deride the Right. We trust artificial medicine more than Nature’s medicine, even if the former is engaged in legal discourse to patent the bio-chemical makeup of the later, so that it can synthetize in laboratories what Nature has freely available. We traverse over her body, drawn to places that we intuitively know hold intrinsic meaning, yet merely capture on Reels, selfies or photographs. Have you truly thought why you have been drawn to those places? After all regions of acute beauty, undeveloped by industry, remains the dominant draw of hodophiles.\n\nAnd yet, many continue to ignore their body’s intelligence, dismissing their gut screams not to ingest something that is uncomfortable or damaging to it. Your body, after all, is not alive. Your tummy talking to you is merely a quaint fairy tale we tell children. Isn’t it?\n\nMoreover there is a Rennie tablet to deal with the aftermath of your stomach’s inability to digest that ‘rich’ food; or a vaccine that works better than your immune system; or an insurance policy to protect your house from climate change, even though you bought a dwelling built on a flood plain (after all rivers never flood and it has to be a function of a changing eco-system)! Few, it appears, take the time to question why can’t I ‘stomach’ that food; why do I need to take several additional medicines to deal with the impacts of one; why can’t I live close to the river on this beautiful flat plain?\n\nUnderstandable, though, when we consider how removed from the world we have become with increasing industrialisation and mechanisation, which have encouraged distancing from the body we live upon and the body we live within.\n\nWe merely have to take the time to listen. And yet will we?\n\nMany noticed how quickly Nature ‘recovered’ when many stopped in April 2020. The disaster that was Chernobyl was supposed to be uninhabitable for hundreds of years and yet is thriving with teeming life in less than 40 years. The miracle of naturally growing medicinal cannabis or of other healing plants that have eased chronic pain and stopped the spread of certain illnesses. There are so many examples of our Living Nature and yet it is still dismissed and derided by certain facets of modernity.\n\nInterestingly, and perhaps not coincidentally, as last moved through an Earth sign, at the end of the 1950s to the start of the 1970s, the memory of the animate indigenous worldview and the exploration of complimentary therapies re-emerged at the forefront of human consciousness. James Lovelock termed the title – Gaia – to account for the Earth as a living entity; we had myriad environmental crises at prompted awareness of what the technological advances of humanity was doing at its own expense; and there was a more concentrated movement towards world views that are now terms holistic.\n\nAs those souls born with that awareness imbued within their psyche came of age, the ‘Clean-Up’ generation started to bring to life as professions, what were once considered to be a-vocational pursuits at best. Body and mind practises from homeopathy and herbalism to naturopathy and kinesiology became normalised as our westernised society attempted to directly reconnect to Nature herself. Active interest in ancient indigenous shamanic practises prompted both scientist and medic to review the intellectual framework inherited from a misunderstanding of the Newtonian mind-set that underpinned much of early modern scientism. Breakthroughs in understanding Nature through this holistic paradigm has spurred on archetypally Mutable Earth organisations like the HeartMath Institute and are a reminder to us that Nature is alive and has always been and is fully conscious and communicating with us.\n\nAnd yet, as Pluto has once again being moving through an Earth Sign, we have been reminded of the importance of our relationship to our bodies, as further environmental and health crises have plagued the world. Regardless of the origins of what looks like a gain-of-function virus, it is no surprise that the world is challenged the way that it is. The overall health of many is poor, despite the incredible technological advances and conveniences we now have. Moreover, the abdication of self-responsibility for one’s own health onto an external agency speaks, aside from deeper and more potentially conspiratorial notions, of a further distancing from Nature and our bodies.\n\nComplex and all as the current situation is, and not for one moment suggesting that we should not be looking towards protecting those genuinely vulnerable, there has been little talk of true health care within the Irish system, and I would imagine in many other countries. How many people do you know consume substances that you know that they know are toxic to their system? How many people do you know are conscious of what they put into their system, in terms of food, but are still happy to take synthetic products for recreational stimulation or ‘medical’ purposes, claiming that they can do a three day detox as a form of counteraction? And that is not even to mention the current divisive issue that labels someone anti-science or anti-medicine if you happen to express concerns about the potential long term implications of taking something that is currently on trial.\n\nAs the Sun and Moon move towards their annual conjunction within the sign of Virgo on the 7th of September, I would invite you to set intentions regarding how you communicate with your body and with Nature itself. And that does not merely mean you talking to yourself and chastising your tummy for the covid-spread! I mean, are you listening to your body’s intelligence, or are you over-riding your ‘gut-instinct’ for convenience, entitlement or addiction?\n\nDuring the three days preceding the New Moon an opportunity exists to gain a deeper insight into what needs to be let go of and what needs to be replenished and renewed, as the omens arise to support your deeper conscious awareness of something that is currently liminal. Taking time to listen to those signals, not dismissing them as a curiosity, enables you to participate in this Mutable state, as the external world mirrors and communicates to your inner world. What is it that you wish you physically let go of and what new attitude do you wish to commence? That is a question to hold, as you are being called into a deeper authentic and sovereign state of being, as you better serve your body and therefore your world.\n\nPlease remember that it is because of the existence of Virgo, you do not have to give yourself away, nor do you need to sell yourself short, being diluted by the desires and demands of another. It is because of Her existence, you have the opportunity to bring into manifestation a deeper form of service that can enable you to free yourself from the fetters that bind you.\n\nAnd it is because of the presence of this Emerald Fire, you are being called to see yourself as a Temple and to both purify and sanctify your body so that within your Wholeness you can more clearly receive.\n\nI wish you and yours all the best health, internally and externally, for this lunation and beyond.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Emerald Fire: The New Moon in Virgo – 7th of September 2021", "url": "https://cosmicintelligenceagency.com/the-emerald-fire-the-new-moon-in-virgo-7th-of-september-2021/", "site_name": "Cosmic*Intelligence*Agency", "article:published_time": "2021-09-04T07:44:57+00:00", "article:modified_time": "2021-09-19T07:51:48+00:00", "image": "https://cosmicintelligenceagency.com/wp-content/uploads/2021/09/Virgo-MonthAhead.jpg", "image:width": "751", "image:height": "458", "image:type": "image/jpeg", "description": "Do you know that trees talk? Well, they do. They talk to each other, and they’ll talk to you if you listen. Trouble is, white people don’t listen. They never learned to listen to Indians so I don’t suppose they’ll listen to other voices in Nature. But I have learned a lot from trees:"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": ["AGENT EI - ANDREW SMITH"], "publish_date": "2021-09-04T07:44:57+00:00"}