{"result_id": "081006", "URL": "https://cosmicintelligenceagency.com/full-moon-16-virgo-march-7th-2023/", "timestamp": "2023-04-25 14:50:09 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://cosmicintelligenceagency.com/wp-content/uploads/2018/06/cropped-logo_cia_color_743-32x32.jpg", "canonical": "https://cosmicintelligenceagency.com/full-moon-16-virgo-march-7th-2023/", "encoding": "utf-8"}, "image": null, "domain": "cosmicintelligenceagency.com", "title": "Full Moon 16° Virgo - March 7th, 2023", "cleaned_text": "When the whole world is running headlong towards the precipice, one who walks in the opposite direction is looked at as being crazy. Coming up on March 7th is the sixth Full Moon in a series of seven that fall at around 16 degrees of their sign. In the Tarot, card number 16 is that of The Tower, energy which is sometimes necessary to destroy the narrative you have built your life around and which is often a challenging and disorienting experience. The stories and beliefs we hold about ourselves, our experiences, and our future aspirations provide a sense of coherence and continuity to our lives and help us make sense of the world around us. When events occur that challenge or contradict our narratives, such as the loss of a loved one, a significant setback in our career, or a sudden change in our life circumstances, it can be difficult to reconcile our expectations and beliefs with the new reality we are faced with. It can feel like the foundation of our lives has been irrevocably shaken, and we may struggle to find meaning or purpose in the aftermath. This series of Full Moons have tied in with Uranus, which is slowly moving through mid-Taurus, close to the lunar north node. We can see Tower energy’s obvious and devastating manifestation in the recent Syria-Turkey earthquake that occurred at the last Full Moon, and in the substantial aftershocks that are continuing. The Tower card is associated with the Hebrew letter Peh, meaning mouth. The horror of the catastrophic earthquake has rendered many silent, not only the dead but also their relatives, who in many cases are the sole survivors of several generations in a family. Thankfully we are not all affected in such a momentous and obvious manner, but the same energy works on multiple levels and there are countless ways in which we are being challenged to change. Despite the difficulty of any experience that blasts us out of our sense of safety, whether that be mental, emotional, spiritual or physical, these events also offer an opportunity for growth and transformation. By forcing us to reconsider our inner narratives and how we may have been limiting ourselves, these ‘unwanted’ changes can eventually give us a deeper understanding of ourselves. We may discover new strengths, interests, or values that we had not previously considered, and find new ways to connect with others; all of which can give us a renewed sense of meaning. Rebuilding is challenging, but ultimately transformative, as it helps us to cultivate resilience, expand our perspective, and develop a greater sense of compassion and empathy for ourselves and for others. As an earth sign, Virgo is associated with practicality, attention to detail, and a focus on self-improvement. Therefore, this lunation may bring an urge to organise your life and to focus on self-care and health. On a note of interest, this upcoming Full Moon connects very strongly with the event chart of the first covid vaccination, which took place on December 8th 2020. This is an excellent time to take stock of your habits, routines, and goals; to consider what is working well for you and what might need to be adjusted or improved. You can engage Virgo’s analytical skills and flair for critical thinking to help you make the most of this period, and make some practical and realistic plans to take you forward in a better way.\n\nI love using the Sabian Symbols as a focus for the lunar cycle. The wide variety of images seems to marry extraordinarily well with the shifting cycles of the Moon as it weaves itself through the zodiac signs, fulfilling its phases of fertilisation, growth, blossoming, death and decay. Because the Sun and Moon are in opposition at the Full Moon, there are two symbols; this month we are looking at the following pair: The Moon– “A VOLCANIC ERUPTION-The explosive energy of long-repressed contents of the subconscious. The objective confrontation with an image of the karmic past is replaced by a subjective irruption of repressed memories and primitive cravings. Everything must be released from the psyche seeking to attain the transfigured state. The soul must become empty, the mind translucent. The Sun– “AN EASTER PARADE-The capacity inherent in all great sociocultural Images to unite the members of a community in a display of excellence. The collective dominates the individual, Yin overpowers Yang. It is a time for conformity to what constitutes the highest ideals of one’s culture. The Keynote is PARTICIPATION IN COLLECTIVE PEAK EXPERIENCES.” Dane Rudhyar The imagery of the sign of Virgo has been taken up in more recent times by Christianity’s expression of the Holy Mother, but I always like to consider the myth of Persephone when I think about Virgo, and in light of the pairing of the Sabian Symbols for this Full Moon, I feel it is particularly relevant. Persephone is the daughter of the earth goddess Demeter, who wanders happily with her daughter across a land of endless summer. The world is fertile, and all are blessed. Enter Pluto, the lord of the underworld (probably on a motorbike and wearing a leather jacket), who takes the beautiful Persephone back to his lair. Demeter, distraught at the loss of her daughter and inconsolable, plunges the earth into winter. (My mother did this, when I eloped at the tender age of 17 with a Scorpio, no motorbike, but yes to the leather jacket, and a large black dog into the bargain, although not named Cerberus!) Eventually, Demeter realises that there is no getting away from what has happened and agrees with Pluto that her daughter will reign as queen of the underworld during the winter months and will return to the earth with her mother during the summer; thus restoring some sort of order and ensuring that the planet still supports life. Within the two Sabian images, I see a spotlight being put upon our very human need for connection to others of our tribe, something inherent in all of us at some level; the importance of sharing our cultural symbols, stories, and traditions so we can feel united in our achievements. As the tribes and nations of the world become more fragmented and diluted, the focus on historical sociocultural images, such as national flags, religious icons, or symbols of historical events, can carry deep meaning and serve as powerful reminders of shared values, beliefs, and aspirations. When individuals come together beneath these images, it can create a sense of collective identity and purpose that transcends individual differences and unites people in a common goal. The danger is that long-suppressed grievances could erupt in explosive and unpredictable ways, with individuals unaware of the depth of their collective racial pain or of what will be released as specific memories or emotions come to the surface. As humanity struggles between paradigms, like in the myth of Persephone, it may seem as if winter will never end and that our world is being plunged forever into chaos. However, no birth was ever achieved without blood, pain and tears; the balance will return when peace can be made between the darkness and the light, and, powerless as I am in the face of global change, my own approach is to imagine myself as a tiny version of planet earth, and work on that. In any case, in some schools of thought, the troubles we see in the outside world ARE ONLY a reflection of our internal situations….. and that is a truly mind-bending thought! Full Moons are the perfect time to shed light on what has been hidden, and this particular lunation calls us to let go of mental clutter and distractions and tap into our inner power and creativity. With the applying square to Mars in Gemini, speaking out becomes an issue, and it may be the perfect opportunity to demonstrate your firmly held beliefs. Themes of independence, unorthodox views and going against the prevailing narrative are all likely at this time, although we may do well to remember that through cultivating a state of inner stillness, we are better able to recognise opportunities for growth and transformation. Through taking bold action when the time is right, we can help to contribute to the well-being of our community, uphold our cultural ideals and participate in the shared experiences that give us a greater sense of connection to others and society as a whole. Prayer for the Full Moon in Virgo. When the Moon is in Virgo -I Analyze, I sort and sift, searching for meaning, pattern and purpose. I seek practical understanding and am curious about how best to apply my skills. I am the smooth running of a well-oiled machine, the ordered perfection, the digested meal. My balance is finely tuned, sensitive to what does not belong. Listen to my body awareness, my earthy knowledge, my eternal search for harmony and health. Joanna Grant is an astrologer of some 30 years and gained her Diploma at the F.A.S in 2012. Weaving her knowledge of the stars together with intuitive tarot techniques, she crafts highly personalised guidance for clients who are often navigating difficult life transitions. Lately, she has been very excited to breathe new life into her astrological practice through her study of Horary, where the traditional techniques of the ancients have helped her to interpret her knowledge in a whole new way. Having recently completed the STA Advanced Level Horary Diploma, she feels that in an uncertain world, the integrity of this tradition is an essential tool in giving clients the guidance they seek.\n\nDon’t forget to visit our TIMELORDS magazine full of great articles and regular columns including Joanna’s Horary section to sharpen your agent skills. FEB 2023 Issue NOW OUT FEB 9th", "opengraph": {"locale": "en_US", "type": "article", "title": "Full Moon  16° Virgo - March 7th, 2023", "url": "https://cosmicintelligenceagency.com/full-moon-16-virgo-march-7th-2023/", "site_name": "Cosmic*Intelligence*Agency", "article:published_time": "2023-03-04T00:55:36+00:00", "article:modified_time": "2023-04-03T23:09:01+00:00", "image": "https://cosmicintelligenceagency.com/wp-content/uploads/2023/03/Full-Moon-Virgo-2023.jpg", "image:width": "1230", "image:height": "703", "image:type": "image/jpeg", "description": "Full Moon in Virgo 16° Virgo\n12:40pm UTC March 7th \nFull Moon in Virgo-Feng Shui\nWhen the whole world is running headlong towards the precipice, one who walks in the opposite direction is looked at as being crazy.\n~ T. S. Eliot\nComing up on March 7th is the sixth"}, "tags": [], "tweets": [], "movies": [], "links": ["https://cosmicintelligenceagency.com/cia-academy/cia-academy-membership/", "https://cosmicintelligenceagency.com/timelords-magazine-opt-in/"], "authors": ["AGENT 41 - JOANNA GRANT"], "publish_date": "2023-03-04T00:55:36+00:00"}