{"result_id": "081007", "URL": "https://cosmicintelligenceagency.com/monthlysunsignupdatejan2021/", "timestamp": "2023-04-25 14:50:12 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://cosmicintelligenceagency.com/wp-content/uploads/2018/06/cropped-logo_cia_color_743-32x32.jpg", "canonical": "https://cosmicintelligenceagency.com/monthlysunsignupdatejan2021/", "encoding": "utf-8"}, "image": null, "domain": "cosmicintelligenceagency.com", "title": "Astrology for Month Ahead January 2021- Sun Sign Update", "cleaned_text": "2021 opens with Jupiter and Saturn at the start of their tours in Aquarius. Jupiter visits the sign every 12 years, Saturn every 30. On the winter solstice (Dec 21, 2020) Jupiter formed a conjunction with Saturn. This meeting launched the start of a new twenty-year cycle of social/cultural, and economic growth. Jupiter/Saturn are also at the start of a new 200-year cycle, which is part of an even larger (800-year) cycle. Additionally, Jupiter/Saturn are synchronizing to the much bigger clock, that of a coming new world age. Sounds like a big deal, you say? It is. Jupiter in Aquarius is a signature for social movements and trends, for the modernizing of schools of thought and our everyday reality. To the plus, it is a fresh stimulus or enlivening influence. Following on the heels of all the negativity, depression, fear and pessimism that a Capricorn transit can hold, Jupiter in Aquarius, a fresh air, or saving grace influence, can offer welcome respite. This transit can hold fresh hope, inspiration, and opportunity. It can create a buoyancy effect or bounce back we haven’t seen in a while. Certainly, there’s a lot of hopefulness pinned on the new USA administration, the newly forged Brexit agreement, and the vaccine rollout. Jupiter will spend most of this year in Aquarius (with a short dip into Pisces waters from mid May to the end of June). Saturn in Aquarius will be with us to 2023. Jupiter aims to point the way forward, to show us where opportunity lies. Saturn in Aquarius looks to fix the cracks and potholes, or to scrap the old road and build an entirely new one. While the process of getting a better fix on the new reality and its requirements takes time, Saturn in Aquarius will speed the cementing process along. The year ahead sets us onto a faster track, this regarding the establishing of new reality baselines, a new format for everyday living, and the solidifying of a new structure of consciousness. When it comes to inclusivity, equality, caring for our elders and our young ones, and justice for all, it’s high time we re-invented our moral compass! Neptune, continuing in dynamic (square) aspect to the karmic axis, is a key signature for the second wave pandemic spike and for the mutational strains that have recently caught our attention. Apparently, such viruses are typically mutational. Once again, the astrology agrees with the science. Continue to stay vigilant regarding your health. According to Neptune, the exposure threat continues to stay heightened through the end of January and well into February. Mars has spent the past six months transiting Aries. It’s been quite a fight, wouldn’t you agree? As of January 6 (to March 4), Mars takes up residency in Taurus. While in this sign, Mars looks for something more substantial to have and to hold, for more worthy investments of time, heart, or money. Mars in Taurus sets a fertile and lucrative backdrop. It also finds value in quality over quantity, over slow, steady, and sustained, rather than the overnight one hit wonder. While this can be a gain-better-ground transit, Mars will not be up to full steam until it surpasses Saturn on January 13 and teams up with Uranus (conjunction) on January 21. (Also setting the backdrop for significant progress and reinvention mandates, Uranus ends retrograde on January 14.) Coinciding with Biden’s presidential inauguration on January 20, Mars conjunct Uranus infuse new initiatives with a more dynamic life force. Together, Mars/Uranus launches a next 19-month cycle focused on net worth, self worth, and survival matters. January 22, Mars gains extra turbo from Jupiter. Watch this week for added intensity and significant action regarding money markets, crypto currency, and such. (Covid numbers and the weather could be notable too.) Venus enters Capricorn and Mercury enters Aquarius on January 8. Both transits set a helpful/lucrative backdrop for putting ambition and ingenuity into play, for exploring/finding new avenues and options. Don’t hesitate to try something (or someone) new on for size. It could be the start of something great. There’s more opportunity for the taking than we have heard from the chicken little folks. It is up to you to go out there and meet your life head on. There are three action peaks of the month: January 8 to 14, January 19 to 22, and January 26 to 30. I’ve discussed the first two peaks in the previous paragraphs. The last week of the month hosts a full moon in Leo on January 28. We will feel the energy a few days prior. The Leo full moon is accompanied by a sun/Jupiter and a Venus/Pluto conjunction. It could be a turning point of significance for matters of heart or wallet. Watch for something or someone special to claim spotlight attention. The Leo full moon puts an added spotlight on creative ventures, children and their education, loved ones and their welfare. A relationship of significance can start or end. A birth or a pregnancy brings cause for celebration. Nothing is small or insignificant about this “take flight” or catch the wave full moon. There could be a major announcement, a special event (the Grammy awards show happens Jan 31), significant trend or big wheels set into motion, a powerplay of note, an instant success story, overnight fame, a big prize won, sudden/surprise opportunity, a life-altering moment. A speculative venture could see a pay-off. Trading and stocks are likely to hit a surge track, there’s sure to be plenty of political action too. While there’s exceptional potential wrapped in this full moon package, note that just 2 days later, Mercury in Aquarius, begins a three-week retrograde tour. Over-estimating or counting your chickens too early is unwise. As is typical of the trickster cycle, something that looked like a sure-fire bet may falter. Mercury retrograde can derail, sidetrack, etc. Mercury retrograde in wild-ride Aquarius can surprise, shock, or keep us guessing. On the other hand, Mercury retrograde can be informing. It can take you/us through an important discovery process. It is a good transit for getting back in touch with the parts of yourself you may have lost along the way and for gifting yourself extra time to sort yourself out and/or come up with something new.\n\nMars ends its six-month tour of Aries on January 6, but it will continue to keep you well fuelled for the next several months. Invest in yourself. Aim to make the most of your time and resources and you are likely to get yourself a good distance ahead. Mars squares Saturn on January 13. This transit gets you over the hump, moves you past what-ever has been holding you up, and sets you onto a next phase or trajectory. Mars/Saturn can be a push come to shove influence, so try to keep a good grip on emotions (i.e. resentment, etc.). Mars conjunct Uranus on January 20 can spring something unexpected on you. Both transits set the reality into play in some definitive or striking way. (Be especially careful on Jan 20 or the days around it. Inspiration or opportunity is worth jumping on, but guard against impetuousness, rash action, or risks you cannot afford). Jupiter and Saturn in Aquarius set your new reality into play in some solidifying and well-defined way. Saturn loans you a sense of time on the move. Jupiter makes it opportune. There’s a certain amount of experimentation in the mix, but once you discover the right formula or direction, you’ll find things drop into place or piece together with good “meant to be” synchronicity. Venus enters Capricorn and Mercury enters Aquarius on January 8. One thing after another, to January 14, the stars keep you working at it. Some things require effort, some come easily. Both transits set up a productive backdrop. Supporting your progress and opening the door to more lucrative opportunity, Uranus in Taurus ends retrograde on January 14. January 19 to 23 takes you through the 2nd action peak of the month. The USA Presidential inauguration on January 20 is accompanied by Mars/ Uranus heading onto a new cycle. Whether edgy or exciting, expect this day to be highly charged. Mars/Uranus infuses extra turbo into fresh initiatives. In the days that follow, Mars square Jupiter (January 22) and the sun meets with Saturn (conjunction, January 23). Combined, these transits set a backdrop for hitting the ground running and reinventing the wheel. Starting with a sun/Uranus square and ending with the start of Mercury retrograde in Aquarius, January 26 to 30 delivers the last action peak of the month. As is typical of both sun/Uranus and Mercury retrograde, expect the unexpected! Starting January 6, Mars begins a six-week tour of Taurus. No matter whether the impetuous is desire or need, watch for this transit to boost energy and incentive. Having said that, Mars will not hit full steam ahead until it tees up with Uranus on January 20 (by conjunction) and gains more traction from Jupiter on January 22 (by square aspect). With the flick of a switch, Mars/Uranus sets a new 19-month trajectory into play. Its an ideal transit for personal reinvention, for taking a risk on the new and improve you. You could find yourself on a radical departure from where you have just been. Venus enters Capricorn and Mercury enters Aquarius on January 8. Together, they set a time is ripe or time has come backdrop. Explore fresh options and possibilities, get going on new projects and goals. Stretch yourself. A different choice could be a great fit. Start now and you’ll soon have something more worthwhile to have and to hold. It won’t take long to get your bearings straight. A result or a confirmation can be quick, perhaps even instantaneous. Having said that, make sure to put your attention toward your long-term security and benefit. January 19 to 22 can be an intense, sudden thrust, and/or full to the brim few days. The last week of the month is also on a dial it up trajectory. Be on the watch for the unexpected. The full moon in Leo on January 28 can pump up the drama or excitement. There’s excellent opportunity wrapped up in this full moon, give it your all. A big step or undertaking can be required (and wise). Mercury in Aquarius travels retrograde from January 30 to February 20. The retrograde cycle can be one of added stress and guesswork. The best you can do is to stay present, let the moment reveal itself and take it one step at a time. The world is moving through a time of great change and you are in the process of major personal evolution too. While there’s so much talk about what we’ve lost, it is time to look at what could be gained from a completely reinvented reality. Jupiter and Saturn in Aquarius boost prospects and help you to see with fresh eyes. Watch for both transits to sharpen your intuition. Both are good for staying ahead of the curve. After 6 months in Aries, Mars is finally on the move. As of January 6, Mars takes up a six-week tenancy in Taurus. This fertile transit stirs it up from a background or under the radar position. Mars in Taurus can colour in budding prospects in some real and tangible way. Creativity can flourish. For some, Mars in Taurus can light a romantic spark. Do what you can to get yourself prepared and be ready to hit the ground running (or to deal with the onslaught) later in the month. Mars will not get up to full speed until it aligns with Uranus (by conjunction on January 20) and Jupiter (by square aspect) on January 22. Venus enters Capricorn and Mercury enters Aquarius on January 8. Both can fast track you and/or solidify a course of action. There are three action peaks of the month, January 8 to 14, January 19 to 22, and January 26 to 30. Encompassing a laden with opportunity full moon in Leo (punched up by sun/Jupiter and Venus/Pluto conjunctions) the last week of the month could be somewhat of a wild ride. Seize the moment! The full moon could mark a turning point of significance, it can bring the exceptional to life and/or set you onto a whole new reality. You could hear good news. Someone you love or admire could claim spotlight attention. Mercury in Aquarius begins a three-week retrograde cycle on January 30. By now, you know the drill. The usual Mercury retrograde advice applies.\n\nThe advance of Jupiter and Saturn out of Capricorn and into Aquarius holds the potential to provide a level of relief, especially so if you have felt the past year or so has produced nothing but one roadblock after another. Having said that, the pandemic will continue to present challenge and to permanently alter our everyday living. It can take significant time to make a full bounce-back or to move yourself to higher ground. Jupiter and Saturn in Aquarius urge you to go on the hunt for new sources of income and also to find a new way to communicate your needs, to express what’s in your heart and soul, to get your message across to the right audience (be that one other, the group, or the outside world). Consider adding new skills to your repertoire. Don’t hesitate to sign up for training or to seek advice from new sources. These transits can also alter your relationship with your significant other, with a community or team, or with someone important to you (i.e. a parent, friend, business partner, or advisor). Giving you something more tangible or substantial to work with and/or shoot for, Mars leaves Aries for Taurus on January 6. To the plus, this transit can produce more viable financial prospects. Mars will not be up to full steam until it meets with Uranus (by conjunction) on January 20 and gains an extra boost from Jupiter (square aspect) on January 22. Mars/Uranus is a crack-the-code/crack-it-open transit. If the tension gets to be too much, this could be a breaking point for a relationship or circumstance. The sooner you rip the bandage off and face the truth/the inevitable, the faster you will meet with progress. More and better awaits the brave of heart. Don’t settle for less. Ask for more, from yourself, from your life. Venus enters Capricorn and Mercury enters Aquarius on January 8. Combined, they can bring a sense of right time, right place. A relationship or goal that holds merit thrives under these transits. If it is time to put it to an end, they will make the reality too obvious to ignore. Try to stay ahead of the curve as best you can throughout the month. Encompassing a full moon in Leo on January 28 and the start of Mercury retrograde on January 30 (and a few more triggering transits) the last week of January can produce opportunity, challenge, or an onslaught. Life hits a faster track. Expect to witness or deal with more than you might expect. Jupiter and Saturn in Aquarius set a whole new reality into play. Both transits set a favourable backdrop for personal and lifestyle reinvention, for presenting a new you to the world. It is time to show up for yourself and engage with others in some new way. Even if you opt for a small change, once you get going, it will snowball from there. Both transits keep you quick on the uptake. Watch for instincts and intuition to speak louder. Don’t hesitate to follow their advice. Mars enters Taurus on January 6. Is there good value in the act? Will it hold its value over time? Is it worth it (this (regarding effort, time, emotion, or material investment)? This transit places added attention on the evaluation process, especially regarding a personal and professional goal or priority. To the plus, it can help you to establish a more solid reputation. January 20 to 22, Mars thrusts the action switch, either with a jolt, or with a sense of exceptional opportunity come knocking. Mars/Uranus (January 20) favours all new initiatives. Mars/Jupiter is excellent for hitting the ground running. Nothing is small or insignificant about these two transits! January 26, sun/Uranus light a fresh spark. January 28 the full moon in Leo is accompanied by the sun’s conjunction with Jupiter and Venus conjunct Pluto. The day can produce a dramatic turn of events and/or opportunity in the making. Follow your heart. Trust what you know. Having said that, know this full moon precedes the start of Mercury retrograde by just 2 days. Don’t bank on a promise or high expectation. It could be easy to overshoot it. Mercury tours retrograde in Aquarius through February 20. The transit can dish up the unexpected, and/or keep you guessing. As is typical of the cycle, added expense or unexpected repairs or sidetracks, sudden health flare-ups and added stress are in the mix. Jupiter and Saturn are on fresh tours of Aquarius. As of January 6, Mars ends a six-month tour of Aries and enters Taurus. All three transits are mobilizing. All three help you explore a new way of navigating through opportunities and challenges. As you work your way through discovery process, you’ll find better/more workable solutions for yourself. Jupiter and Saturn can put you in touch with new job prospects. Don’t hesitate to upgrade your technology, equipment, skills or knowledge base, to consult with a specialist, or to explore alternative healing therapies. A major lifestyle change can be the start of something good. Once you are up and running, you are likely to wonder why you waited so long to take it on. Mars in Taurus (to March 4) gives you a more solid sense of where you are heading. Venus in Capricorn, January 8 to February 1 is also a confidence booster. Both transits help you to get it under better control. Mercury in Aquarius, starting January 8, keeps you busy with one thing after another. Along with Jupiter and Saturn in Aquarius, the month ahead is well set for breaking new ground and exploring new options. Try to stay a step ahead as best you can and to give yourself an extra margin or cushion. January 30 to February 20, Mercury in Aquarius tours retrograde. The retrograde could set you on a backtrack (health-wise, financially, or regarding projects, goals, or relationships). Mars lights a fresh spark with Uranus on January 20 and gains added incentive from Jupiter (square aspect) on January 22. Fresh starts and initiatives are favoured. Mars/Uranus launches a new 19 month, hit the ground running, strike while the iron’s hot cycle. There are three peak action cycles of the month: January 7 to 14, January 17 to 22, and January 26 to 30. The last week of the month encompasses a full moon in Leo on January 28 accompanied by the conjunctions of sun/Jupiter and Venus/Pluto. Expect the intensity and drama to be dialed up. Watch for hints on the Mercury retrograde cycle (a wild-card or wild-ride influence) starting as early as January 26.\n\nJupiter and Saturn are at the start of their tours through Aquarius. Your sign gains the maximum benefit from both transits. The year ahead will take you through an important self discovery process. As you break new ground, you’ll also speed up the timeline to that long-awaited promised land labelled “your future”. Both Jupiter and Saturn set an optimal backdrop for personal life or career reinvention. Don’t hesitate to try something or someone new on for size. It/they could be a perfect fit. Mars leaves Aries for Taurus on January 6. This transit puts added emphasis on finances and survival matters (emotional, material, relationship, and mortality). Do it yourself. more self-sufficient you are, the better. Mars meets with Uranus on January 20 to start a new 19-month cycle. Mars/Uranus sets a backdrop of excitement, high stress, sudden onset, wild card, volatile transit. Don’t take risks with faulty equipment, pie in the sky reasoning or dangerous situations. Be careful on the road (don’t speed) and don’t let anger get the better of you. To the plus, Mars/Uranus is a good transit for breaking free, for independence initiatives and new ventures. Risk is the mix. Mars gains added turbo from Jupiter on January 22. Both transits set big wheels in motion, perhaps in a flash. Inspiration, enthusiasm and confidence looks good on you, but also know that Mars/Jupiter, an impetuous combination, can see you get overly carried away. Venus enters Capricorn and Mercury enters Aquarius on January 8. One way or another, both transits are moving you forward in a significant, no turning back way. Where there is a will, there is a way. Both give you a sense of time is right for getting on with the task at hand and for new initiatives. Mercury in Aquarius puts ingenuity and synchronicity on your side. Follow through on those fresh ideas, introduce yourself to someone or something new. The last week of the month keeps the action going strong. January 28 delivers a full moon in Leo, accompanied by sun/Jupiter and Venus/Pluto conjunctions. The full moon could dish up something special, perhaps even exceptional. You can reach an end, a completion, or a goal post. Despite Mercury retrograde starting in just 2 days, it is an ideal time to sign a contract, buy real estate or change your address or to embark on some other major undertaking. Mercury tours retrograde in Aquarius from January 30 to February 20. As is typical of the cycle, expected the unexpected. A reconnection, repeat, sidetrack or revisit is par for the course. You can pick up where you left off, but it won’t be the same as it was. January opens with Jupiter, Saturn and Pallas Athene in Aquarius. As of January 8, Mercury will join the group. These transits can give you a sense that you are on the brink of so much more to come. There’s so much you don’t know, that isn’t nailed down yet. Let time sort it out for you and simply aim to do your part. How, you ask? Give your all to the here and now. Things will unfold from there as they are meant to. Trust there’s a bigger picture agenda in the works. Your soul has already signed up for the program. Mars enters Taurus on January 6. This transit keeps you driven, motivated, and breaking new ground. Whether tension or attainment (or a combination of both) stokes the fire, Mars continues a buildup curve through mid month. Mars squares Saturn on January 13 and moves you past a block or hold up. Uranus ends retrograde on January 14. Mars and Uranus join forces on January 20. Coinciding with Biden’s inauguration, it is sure to be a highly impact/high charge day. Expect this Mars action to be significant in terms of a breakthrough, a threshold crossing, or a springboard time. A new reality sets into play. Mars/Uranus is also a signature for electrical or mechanical issues, accidents, the unleashing of pent up emotions. A sudden and unexpected turn of events is with the range of possibility too. There are 3 peak activation periods of the month: January 7 to 14, Jan 20 to 22, and January 26 to 30. January 28 delivers a full moon in Leo, punched up by sun/Jupiter and Venus/Pluto conjunctions. Watch for the full moon to deliver something big, special, perhaps even exceptional. Grab added attention, showcase yourself or your creativity, try your luck, or put your heart out there on show. You could find yourself on a radical departure from where you expected to be. While there’s an opportunity to go for it big time, also note that Mercury turns retrograde on January 30. Guard against overly high expectations or gambling on something you can’t afford to lose. There are no guarantees in life and especially not while Mercury retrograde is pulling the strings. Despite the ongoing restrictions of the pandemic, Jupiter and Saturn on fresh tours of Aquarius dishes up a fresh air feel, as though some invisible barrier has just been removed. Someplace new to be something new to do, new people to meet; perhaps there’s something actual that gives you this sense of liberation and renewal. Mercury advances into Aquarius on January 8. This transit keeps you inspired, full of fresh ideas, and well on the go. After 6 months in Aries, Mars is finally moving on. As of January 6, Mars begins a six-week transit through Taurus. While this transit can help you to be more productive, you can feel under pressure until Mars surpasses Saturn on January 13. Mars can continue to put you under added stress, expense, or uncertainty until it meets with Uranus on January 20. Coinciding with Biden’s inauguration, this is sure to be a high energy, anything goes day. Keep safety in mind and try to find a healthy outlet for pent-up emotions. To the plus, Mars/Uranus favours a new job, project, initiative, or health regime. January 26 to 30 can also be an action packed few days. It’s an ideal time to dive into something new. The full moon in Leo on January 28 is accompanied by sun/Jupiter and Venus/Pluto (both are conjunctions). There could be something to celebrate. Despite the start of Mercury retrograde just 2 days later (January 30) this full moon sets an auspicious backdrop for signing a contract and for new or speculative ventures. Substantial money can be made or spent. Special attention can come your way. Watch also for a special announcement or an out of the blue opportunity. Mercury in Aquarius tours retrograde from January 30 to February 20. The transit can put you on a rethink, see you resume a project or goal, see you call it quits, take you on a temporary side-track, etc. Unexpected meetings, expenses or health backtracks are also typical of the cycle. Take it one step at a time!\n\nJupiter, Saturn, and Pallas Athene (a shorter transit) have recently exited your sign to take up residency in Aquarius. If you haven’t felt the energy shift, you will soon enough. Both Jupiter and Saturn accelerate a significant self discovery and personal reinvention process, one that has likely been in the works for quite some time. You are in the process of disengaging from who you used to be, from a lifestyle that you feel no longer reflects who you are today. It’s a great time to exploring to test drive the new you. You might stumble upon something that hits the spot quite well. These transits spark new interests and can see you tap parts of yourself (talents and capacities) you didn’t know existed. Jupiter and Saturn also stimulate fresh financial opportunities. Don’t hesitate to put a significant investment (time and/or money) into a new and improved lifestyle – or a new and improved you. Mars tenants Taurus from January 6 to March 4. This transit assists you to make the most of what you have to work with, to extract good value out of your activities and involvements, to feel better loved and appreciated. Creative enterprise can meet with good results. Even so, there’s more foundation laying or plugging away at it yet to be done. Mars needs to work through a few things before it reaches full steam ahead. As of January 20 (Biden’s inauguration), Mars joins forces with Uranus (new phase conjunction). You can feel it as a sudden breakthrough or springboard influence. Mars gains extra turbo from Jupiter on January 22 (square aspect). Expect these few days to be significant in terms of getting it up and rolling, of things taking on a life of their own. You could find yourself on a significant fast-track or departure track from where you have just been. A speculative venture could hit a significant and/or lucrative forward thrust. January 26 to 30 keeps the action well sparked too. The full moon in Leo (January 28) is accompanied by trines from sun/Jupiter and Venus/Pluto. Something pleasing, joyful, lucrative, special, even exceptional could be in the works. Something or someone you love (lover, child) gains spotlight attention. Mercury in Aquarius tours retrograde from January 30 to February 20. As is typical of the cycle, expect backtracks and sidetracks. Unexpected expenses, repeats and revisions are par for the course. Jupiter will zip through Aquarius in 2021, taking a short dip into Pisces waters from mid May to the end of June. Saturn will tenant Aquarius to March 2023. Pluto will assume command in 2024 to stay until 2044. In other words, you are just at the start of so much more to come. You are hard-wired for a leadership role in this time has come moment. The fast track future and its endless possibilities await your special brand of genius. Mars enters Taurus on January 6. Home and the welfare of family continue to be a priority focus. This transit also puts added emphasis on getting a better, more secure foundation laid. Property holds or increases its value. This Mars transit is also favourable for fresh initiatives, but you won’t hit full steam ahead until January 20 to 22 when Mars joins forces with Uranus (conjunction January 20) and gains added incentive from Jupiter (square aspect January 22). By March, Mars in Gemini will get you more fully up and rolling. (Mars/Uranus holds jurisdiction over Biden’s inauguration. It should be a memorable, intense, emotionally high-charged day. Mars/Uranus is always good for a surprise.) Venus enters Capricorn and Mercury advances into Aquarius on January 8. Both transits give you something more tangible to go on and to shoot for. The month ahead is an unfolding or evolving process. It’s bit by bit, one thing leading to another. There are three peak activation periods in the month: January 8 to 14, January 19 to 22, and January 26 to 30. Mars surpasses a pressure point or hold up with Saturn on January 13. Uranus, your ruler, ends a six-month retrograde tour on January 14. I’ve already mentioned January 20 to 22. The sun’s square to Uranus on January 26 can be the kick-off to an intensity building few days. (Watch the money markets, the weather, and world stage). January 28 delivers a full moon in Leo, pumped up by sun/Jupiter (conjunction) and Venus/Pluto (finances, emotions, powerplays, mortality). Nothing is small or insignificant. This full moon could deliver something special, lucrative, or exceptional. What is set into play holds major impact or potential. A fortune could be made or lost. This could even be a lucky transit for some. While something new or speculative could be a golden ticket, note that Mercury in Aquarius begins a retrograde tour on January 30. Try not to go overboard, or to allow overly high expectations to get the better of you. Beyond the usual things the retrograde cycle can deliver, Mercury retrograde in Aquarius can give you an extended time to regroup and/or get yourself better sorted out. Neptune continues to keep the world and you in a crossroads place. Continuing in dynamic aspect to the karmic axis, Neptune is a key signature for the second wave pandemic spike, also for the mutational strains that have recently caught our attention. Apparently, the characteristics of such viruses are typically mutational. Once again, the astrology agrees with the science. Continue to stay vigilant regarding your health. According to Neptune, the threat of exposure stays heightened through the end of January and into February. Jupiter and Saturn (and the shorter transit of Pallas Athene) in Aquarius take up residence in a background, undercurrent, or out of sight way. Even so, they are dynamic influences, so don’t under-estimate their workings. You’ll find the time you spend alone Both Jupiter and Saturn assist you to crack a long running code. It is one that’s buried deep in your programming. Both transits spark a new creative process. You’ll feel this as flashes of inspiration or intuition. The more frequently the flashes occur, the stronger the message or potential. Mars enters Taurus on January 6. On January 13, Mars will be over the hump with Saturn. On January 14, Mars joins forces with planet Uranus. You’ll feel this Mars/Uranus action as a kickstart, kick it up a notch, let off steam, or sudden full thrust influence. An impulse, inspired moment, or quick response could be the it” ticket. Know also that Mars/Uranus can spark an abrupt onset, an onslaught, or take you by surprise. Stay alert for anything goes. Venus enters Capricorn and Mercury advances into Aquarius on January 8. Both transits keep you/it moving along. There are 3 peak action periods of the month, January 8 to 14, January 19 to 22, and January 26 to 30. The last week of the month warehouses a full moon in Leo punched up by sun/Jupiter and Venus/Pluto conjunctions. Expect a lot of whatever sets into motion. To the plus, the full moon can be a lucrative turn-it-around time. There’s good opportunity waiting for the brave of heart or wallet. Even so, please note, that Mercury in Aquarius begins a three-week retrograde tour on January 30. As is typical of the retrograde cycle, sometimes things fall apart or don’t go as planned. Keep on watch for the unexpected.", "opengraph": {"locale": "en_US", "type": "article", "title": "Astrology for Month Ahead January 2021- Sun Sign Update", "url": "https://cosmicintelligenceagency.com/monthlysunsignupdatejan2021/", "site_name": "Cosmic*Intelligence*Agency", "article:published_time": "2020-12-30T02:15:56+00:00", "article:modified_time": "2021-09-07T02:33:34+00:00", "image": "https://cosmicintelligenceagency.com/wp-content/uploads/2021/09/chess-015.jpg", "image:width": "359", "image:height": "226", "image:type": "image/jpeg", "description": "January 2021\nJan 12: New Moon in Capricorn: 9:00 pm (23:13 Capricorn)\nJan 28: Full Moon in Libra: 11:16 am (9:05 Leo)\nJan 6: Mars enters Taurus: 2:06 pm\nJan 8: Venus enters Capricorn:\nJan 10: Eris stations direct: (23:27 Aries)\nJan 14: Uranus stations direct:"}, "tags": [], "tweets": [], "movies": [], "links": ["https://cosmicintelligenceagency.com/bravenewworldastrology/", "https://cosmicintelligenceagency.com/bravenewworldastrology/"], "authors": ["AGENT 300 - ROSE MARCUS"], "publish_date": "2020-12-30T02:15:56+00:00"}