{"result_id": "081016", "URL": "https://cosmicintelligenceagency.com/mars-and-venus-2022/", "timestamp": "2023-04-25 14:50:37 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://cosmicintelligenceagency.com/wp-content/uploads/2018/06/cropped-logo_cia_color_743-32x32.jpg", "canonical": "https://cosmicintelligenceagency.com/mars-and-venus-2022/", "encoding": "utf-8"}, "image": null, "domain": "cosmicintelligenceagency.com", "title": "Patterns, signs and signals : Mars and Venus in 2022", "cleaned_text": "A year that begins with Venus retrograde and ends with Mars retrograde is surely one that will re-structure and re-activate, re-design and re-configure many aspects of our lives. When these two quicker moving planets slow down to make bold statements, to bind the start and end of a year, we may want to take a closer look. With Venus starting retrograde conjunct Pluto, on 19th Dec, 2021 and Mars stationing retrograde in Gemini in trine to the first Venus Star Point in Libra (since 1879) we can connect the micro cycles of each planet and retrograde passes to the macros cycles that are repeating, giving us a better viewpoint on how to navigate and read the times ahead. It is easy to isolate retrogrades as separate events, yet tying them together bring past, present and future into deeper focus. With Venus we have a star pattern created by Venus/Sun conjunctions, that can be measured in many different segments from the micro cycle to the macro. Every 9.5 months Venus moves back and forth from superior to interior conjunctions.\n\n Every 19months Venus makes one full synodic cycle.\n\n Every 8 years 5 x full synodic cycles (and 10 star points) create the Venus Star pattern.\n\n Every 100 years approx, Venus Star Points change signs, moving back into the next sign.\n\n Every 250 years approx a whole star cycle patterns repeats.\n\n Every 1250 years approx, the full Star will complete a 360° turn through the zodiac\n\n (by 2033 we have one star point crossing Zero Aries) * In 2022 our current Venus Star pattern of 5 points – Aries, Capricorn, Scorpio(now turning to Libra), Leo, and Gemini, is the same star pattern that was operating back to the 1770’s when Pluto was also in Capricorn. It was a time of independence for the USA, the conquering of Australia by Captain James Cook for the British crown. A time of revolutions and rebellions when feudalism and absolute monarchies began to give way towards societies based on liberty and equality.\n\nWith Mars our least retrograde of all planets orbiting in a 22-26 month return cycle, his cycle is not so perfect, yet when we tie the two together as we look at a year ahead, we gather the unfolding story in any astrology chart, with Venus focusing on the values and trends upheld in our societies, and popular culture, followed by Mars activating and taking action for the values we uphold and stand by. As Venus makes her next retrograde in Capricorn and Star Point at 18° on January 9th 2022, she has a date to sort our relationship to all things connected to Saturn ruled Capricorn. Governments, Corporations, the Patriarchy, their authority and control become a focus on the world stage. 2021 and the ongoing Saturn Uranus squares (still in square during 2022) have showed clearly the growing power and control of Governments aligning with Corporations over our own autonomy and ability to live with our choices. The ongoing introductions of restrictions, lockdowns, passports, mandates, our civil rights and freedoms amongst are of great global concern. With Venus stationed retrograde conjunct Pluto, what will come to light, what will be revealed, what will be reassessed in the months ahead will have much to do with the systems that govern us? As Mars retrogrades in Gemini at the end of 2022, the sign of information and media, we can foresee the great need in the accountability of the information we receive from those in power, the transparency we continue to ask for, yet more and more censorship, regulations keep us searching for the Truth. With Venus we know that her last retrograde in Capricorn was 8 years ago, the Mars cycle not being as perfect as Venus’s has a 15-17 year cycle, for his retrograde to happen in the he same area of the zodiac, we find it was at the end of 2007 and 2008, when Mars retrograde moved from Cancer back to Gemini and we know what happened then! The great awakening of the Global Financial Crisis, alerted us to what the BIG boys were getting away with. It was around this time, that brave new ideas were seeding in regard to new crypto currencies, and bold moves were on the way toward the decentralisation of corporate control and power, money, finance and the games of the well invested.\n\nHowever to find the year that Venus and Mars made bold retrograde statements that flank the begining and end of a year, we can look back 32 years, as their cycles align for returns to the same places in the zodiac in the same time frame. To look back at this we find ourselves at the end of 1989 and thru into 1990. Back in 1989-1990\n\n Venus stationed retrograde at 6° Aquarius on Dec 1st, 1989\n\n peaked as a Star Point at 28° Capricorn on Jan 18th 1990,\n\n stationed direct at 20° Capricorn on Feb 8th, 1990 Venus also in 1990 as she does every 4 years makes 2 Star Points (See Diagram 1)\n\n Venus exterior conjunction Star Point 9° Scorpio – Oct 25th, 1990 Mars stationed retrograde at 14° Gemini, 20th OCT 1990, \n\n Peaked in opposition to Sun at 5° Gemini, 27th Nov 1990\n\n stationed direct at 28° Taurus, 1st Jan 1991. Some of us may want to recall our personal lives back then, but on the world stage a few very interesting things shifted and were launched that changed the structures of the past and advanced us greatly into the future. The end of 1989, 32 years ago the world was excited about the coming down of the Berlin Wall, and a year of great political shifts followed. A singing revolution in 1989, led to the Baltic States declaring themselves independent from the Soviet Union, East and West Germany were unified as the soviet regimes further collapsed in Yugoslavia and other Eastern Bloc states as many new states and nations were born and reborn. Margaret Thatcher also resigns as UK’s Prime minister. On another front, we have the beginnings of a system that would change the world forever as Tim Berners Lee creates the first server for the coming WWW revolution. Interestingly the great Human Genome Project started and the Hubble Space telescope was launched opening us to the universe we’d never seen before. Harry Potter began to be written by JK Rowling and Nelson Mandela was released from prison after 27 years on Feb 13th 1990. Using these peak points, above and a 2-3° orbs bring the best results. I’ve been using these peaks points of Mars and Venus as a way to connect the astrological story in any given chart for many years now, they clearly show and point to what’s ahead, gathering the focus, as we would using eclipses cycles and where they are coming into effect. Taking a quick look at the charts of Nelson Mandela, JK Rowling and Tim Berners Lee, to see how the above peak points highlight the story that unfolded for them during 1990.\n\nFor Nelson Mandela – The Venus Star point in Capricorn of 1990 targeted his 2nd house and opposed his Sun in the 8th house, with the station retrograde opposite his Neptune, and station direct sextile his Moon. The 2nd star point in Scorpio in Oct, 1990 highlit his 11th house, making a square to Neptune and a sextile and trine to his MC and IC. The Mars station retrograde in Gemini 1990 also targeted his MC and IC, trined his natal Mars and Mars station direct squared natal Uranus. In the same period 1990, Jupiter transited his natal Jupiter, Pluto, his Sun and also Neptune as the nodal axis transited his 9th house planets, Saturn and Mercury. The peak points highlighting aspects n his chart relating to a change in life circumstances and freedom from his long term oppression. For JK what we see is that the Venus Point Capricorn happened in her 12th House, connecting to her Moon by trine, as the 2nd star point at 9° Scorpio in her 9th house squared her Sun in Leo in the 6th. Mars looped in his retrograde at the IC, connecting her Virgo planets by square and her Sun by sextile, the Sagittarius MC and finishing in the 3rd house in trine to her Moon. The sequence connects the 12th, 4th/3rd and 9th houses, in a way we may not otherwise. She was busy writing with a new found inspiration. At the same time, Saturn transited her 12th house, Jupiter her 5th/ 6th houses and her Sun, Pluto her natal Neptune and the Nodal axis her ASC/DSC. For Tim Berbers Lee, chart not shown, we don’t have an exact birth time for him, was born 8th June 1955, London, UK. The sequence above connects the Venus Star Point at 28° Capricorn to oppose his Uranus 25° Cancer and Jupiter conjunction at 29° Cancer. The Scorpio Star Point made a trine to his natal Mars at 9° Cancer and the Mars retrograde transit began conjunct his Sun at 14° Gemini. A great invention that would change our world was birthed. For easier navigation through a chart stick to the peak points to find planets in retrograde vicinity. Remember with Venus she will be here every 8 years, moving backwards over time and every 4 years making an opposing point, signalling a shift in perspective for this area of a chart. Mars will be within the same area either in a 15, 16 or 17 year cycles.\n\nSo from the examples above we may look closer at our own charts and how the coming peaks will target our charts in the year ahead. Venus stations retrograde at 26° Capricorn on Dec 19th, 2021\n\n Venus peaks as a Star Point at 18° 43’Capricorn on Jan 9th 2022,\n\n Venus stations direct at 11° Capricorn on Jan 29th, 2022 Venus makes her 2nd Star Points (See Diagram 1)\n\n Venus exterior conjunction Star Point 29°26’ Libra – Oct 22nd, 1990 (The fist since 1870”) as Mars stations retrograde in trine Mars stations retrograde at 25° Gemini, 30th OCT 2022\n\n Peaks in opposition to Sun at 16° Gemini, 8th Dec 2022\n\n stations direct at 8° Gemini, 11th Jan 2023. The current Mars cycle began at 15° Libra in Oct 2021 and finishes at 25° Scorpio on 18th Nov 2023 Look ahead to connect the 2 Venus Star Points of 2022 and the Mars retrograde peak. Where will you be targeted to re-align your values and readjust your life accordingly? Where will Mars activate the way you take in information, activate your voice, circulate and share your new found truth and ideas. Look back at the last 19 month cycle of Venus to follow the sequence, as this current cycle began with Venus retrograde in Gemini (on the planetary North Node of Uranus 14° Gemini) and how your world, the world has changed since. A new language of social distancing, lockdowns, and masks became de rigueur. Venus’s outer conjunction point of this last cycle was conjunct Chiron and Ceres, in Mars ruled Aries at 4° , as vaccinations became our focus and the freedom to choose the fight! Now as we head toward Capricorn Star Point, how we are governed in amongst all the with new laws, and regulations, the mandates and the passports determining how we can act as a global citizens is of highest concern. What will be revealed in this time on the world stage will be significant in the year ahead, as previous Capricorn moving to Scorpio Star Points show. In early 2018 we saw American Youth uprising against Gun laws in the USA, and violence against women worldwide, calls for Oprah to run for president and Bitcoin’s rapid rise to its highest peak in its history thus far. Epstein and Weinstein were on the world stage and the Extinction Rebellion began. In 2014, the last retrograde point in Capricorn, revolutions in Africa toppled leaders. In 2010 at the outer conjunct point the Arab spring sparked off revolutions throughout the Arab countries. In 2006 Pluto was demoted and the movie The Inconvenient Truth was released on the dire straits on climate change. In 2002, we were getting the intel behind the War on Terror and what lurked behind the 9/11 attacks. All these years also coinciding with the sequence of the Scorpio Star Points that occur in October. What happens next, may not be so clear, but the above exploration gives us an idea of what we are in for both personally and collectively. 2022 is unique as the 2nd Venus Star Point for the first time moves back to Libra (repeating the star pattern of 1770’s, the Age of discovery, invention, independence, revolutions and a new enlightenment) it heralds a shift toward liberty and equality, from greed and power. However the next retrograde of this Star point will be back at 0° Scorpio for one more time in 2026, still a while to go. Together with the Mars in Gemini retrograde cycle, 2022 is sure to open and change our minds to many new things, with new possibilities and social standards emerging and a stronger fight to uncover the information that is hidden from us, with a call to do something bold and brave about it! Put it all together and we can expect the toppling of leaders and chiefs, a reinvigorated impulse for freedom, with a rise of voices challenging those in power, many inconvenient truths arising holding our governing systems accountable. Working out what is real and unreal, truth, propaganda or conspiracy is enough to keep us searching for the best way forward during these most challenging times. As we birth a new world and re-build, uphold thy values, keep them strong, voice your freedom and take an initiative to create a world, on a sacred earth where we all can prosper.\n• for more information on following the Venus Star and Pattern – see Julija’s videos and other articles HERE\n• Original article written for OPA magazine December 2021 edition – download the version here https://opaastrology.org/PUBLIC2021Solsticedec.pdf", "opengraph": {"locale": "en_US", "type": "article", "title": "Patterns, signs and signals : Mars and Venus in 2022", "url": "https://cosmicintelligenceagency.com/mars-and-venus-2022/", "site_name": "Cosmic*Intelligence*Agency", "article:published_time": "2022-12-12T06:16:59+00:00", "article:modified_time": "2022-12-21T00:06:12+00:00", "image": "https://cosmicintelligenceagency.com/wp-content/uploads/2022/02/Mars-and-Venus-2022.png", "image:width": "1000", "image:height": "565", "image:type": "image/png", "description": "A year that begins with Venus retrograde and ends with Mars retrograde is surely one that will re-structure and re-activate, re-design and re-configure many aspects of our lives. When these two quicker moving planets slow down to make bold statements, to bind the start and end of a year,  we may want"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.google.com/search?sxsrf=AOaemvKQFk0VoOenOuXYOotGlbRpqabVqw:1636529457462&q=de+rigueur&spell=1&sa=X&ved=2ahUKEwjKv-eno430AhWVxTgGHfttA9EQkeECKAB6BAgBEDI", "https://cosmicintelligenceagency.com/julija-simas/", "https://opaastrology.org/PUBLIC2021Solsticedec.pdf"], "authors": ["AGENT 12 - JULIJA SIMAS"], "publish_date": "2022-12-12T06:16:59+00:00"}