{"result_id": "083029", "URL": "https://geopolitics.co/2022/02/10/this-medical-data-from-the-us-department-of-defense-is-explosive/", "timestamp": "2023-04-25 14:51:29 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://geopolitics.co/wp-content/uploads/2019/11/cg-icon-150x150.png", "canonical": "https://geopolitics.co/2022/02/10/this-medical-data-from-the-us-department-of-defense-is-explosive/", "encoding": "UTF-8"}, "image": null, "domain": "geopolitics.co", "title": "This Medical Data from the U.S. Department of Defense is Explosive", "cleaned_text": "On February 1st, 2022, US Senator Ron Johnson sent a letter to DoD Secretary Lloyd Austin highlighting the dramatic rise in adverse events reported in the Defense Medical Epidemiology Database (DMED) after the vaccines were rolled out to the military. If the vaccines are truly “safe and effective,” these increases are difficult to explain.\n\nHere are the resources with the original data:\n• Renz Law page on the DMED data with graphs (summary of the data)\n• The Excel spreadsheet with all the numbers. Note that the numbers in the purple coded rows are the “corrected” data which was issued after the “glitch” was noticed. Hospitalized means the patient was in the hospital. Ambulatory are the stats for outpatients. Also note that the percentage calculation is wrong: they should have subtracted 1 since a “2X increase” is the same as a “100% increase.”\n\nYou can read about DMED here. Essentially, it is the official database of the 1.4M active duty DoD servicemen.\n\nFor a quick intro to the database, I highly recommend you watch this 2-minute video of Dr. Robert Malone talking about the DMED database: Dr. Malone states DoD is deleting data from its database to cover up damages done by the “vaccines”.\n\nWhy the DMED data is so important\n\nThere are 14 reasons why the DMED data is very important.\n\n1. The individual doctors themselves realize that the vaccines are causing the harm documented in the DMED database. According to an insider I spoke to, around 40% of military docs realize what is going on, but doctors in the military can’t speak out against the vaccine because they are ordered not to say anything. So all these doctors have to remain silent. The data in DMED is their voice.\n\n2. The original DMED data appears to be very reliable. It is hard for anyone to make excuses for the increased rates in the DMED database quoted in this letter because the event types with increases are all confirmed in the VAERS database. Unlike VAERS, this database cannot be dismissed using hand-waving arguments. DMED is not a self-reported database where reporting rates are unknown. It is a fully reported database where all the reports are from healthcare providers. In short, if the vaccines are safe, the DMED data is hard to explain. For example, you can’t pin the rise in events in 2021 on COVID since total hospital event rates declined in 2020 (relative to 2019) in both the original and corrected results. Note: The DoD now claims the 2016-2020 data was wrong and issued corrected values (graph on the right):\n\n3. These are absolute rate increases. In VAERS, we’ll often compare a baseline rate of an event in prior years with the current year to look for a signal. This is a “differential signal” so high values are possible. For example, the reported VAERS rate for pulmonary embolism is 3 per year. Say it goes to 300 per year, a 100X jump. But if the baseline rates of PE are 1000, then on an absolute basis, this is just a 0.3X increase. So large absolute number jumps are very significant. This is exactly what we have in the DMED database: very large absolute jumps.\n\n4. The effect sizes are huge. For example, the rates of hypertension increased by 21X from average in 2021. Nervous system diseases increased by a factor of 10.\n\n5. Nobody can explain it. If it wasn’t the vaccine causing these huge increases in adverse events, what was it?\n\n6. The military is deleting cases to make the effect size smaller.\n\n7. It’s a great “conversation starter” with your pro-vax friends, local lawmakers, local health authority, and favorite fact-checkers. You simply ask a simple question, “How do you explain these dramatic rate increases in 2021 vs. the 5 year average?” This works particularly well at City Council meetings, school board meetings, and with lawmakers.\n\n8. Symptoms with increases match the VAERS data. It is tough to claim the elevation in event rates is due to something else because a) the range of elevated symptoms is so large and b) the symptoms in DMED that are elevated match the symptoms in VAERS that are elevated.\n\n9. The DoD is in a panic about this leaking out. This data wasn’t ever supposed to leak out. The only reason it leaked out is due to the efforts of three whistleblowers inside the DoD. According to an insider I spoke to, the DoD has no idea how they are going to cover it up. The only thing they’ve done is claim the 2016-2020 data is underreported, but this doesn’t match reality as I explain below.\n\n10. Deliberate mainstream press cover-up. There is evidence that mainstream media reporters have been instructed not to cover this story or talk to Tom Renz. I verified this myself searching for articles about Renz in The New York Times and CNN. So you’ll only hear about it from alternative media. Think about it… this is one of the most explosive stories of the year (if not the decade) and the mainstream press isn’t covering it at all? What does that tell you? You don’t have to have a lot of critical thinking skills to figure that one out. It pretty much tells you everything you need to know: there is a massive cover up of adverse events.\n\n11. It destroys the credibility of the CDC. I just finished watching the latest ACIP meeting where CDC officials said there were no safety signals (other than myocarditis) in both the VAERS and VSD system. Amazingly, there were no deaths from any mRNA vaccine. Zero. It also begs the question how they could possibly completely ignore all the safety signals in the DMED database. They didn’t even consider it. However, they are unlikely to ever answer that question. But when the Republicans come into power in the Senate in 2023, I’d expect that Senator Johnson will ask Rochelle Walensky why the CDC is ignoring this database.\n\n12. The military can’t effectively refute it. After being confronted with the data, they now claim the 2016 to 2020 data was wrong. The problem is their new numbers are nonsensical as I explain below.\n\n13. Symptoms that were not associated with the vaccines were not elevated in 2021. Symptoms unrelated to the vaccines weren’t elevated. So if there was a data glitch causing reduced reporting rates, how come only events related to the vaccine were elevated in 2021?\n\n14. Total hospital event rates declined in 2020 (relative to 2019) in both the original and corrected results. What’s unique about the DMED database is that military hospitals don’t get COVID incentives. Total hospital event rates declined in 2020. If COVID is so dangerous, how do they explain that?\n\nI spoke to a doctor in the military who confirmed the high incidence of vaccine-caused events in his practice\n\nThis doctor estimates that 85% of the military has been vaccinated, although the military official total is 93%.\n\nThe doctor is responsible for thousands of service members and has dozens of significant vaccine injuries that are VAERS reportable (most of which have not been filed).\n\nThis is a significant adverse event rate of more than 0.75%, i.e., nearly 1 in 100 soldiers are vaccine injured, some very seriously.\n\nIt’s important to note that the soldiers are tough and don’t want anything on their medical records that could limit their responsibilities. So many simply don’t report severe symptoms. So our .75% vaccine injury rate is likely an underestimate. And remember, this is in a very healthy young population.\n\nThis doctor has had zero VAERS reportable injuries in nearly two decades. So this suggests that the increased rate of reportable adverse events from these vaccines is far more than 500X. But other physicians I know with larger practices report elevated rates of from 600 to over 20,000 from the shots this year. In short, the number of adverse event reports from these vaccines is off the charts compared to other vaccines. This suggests that the 30X increase in the rate of adverse event reports in VAERS is because the vaccine is dangerous, not from reporting bias. It also suggests that VAERS is severely under-reported this year relative to other years by at least a factor of 10. The FDA has assumed that VAERS is over-reported compared to previous years by 30, our estimate is that VAERS is under-reported compared to previous years by 30. Note that this estimate (comparing the propensity to report between years) doesn’t change our minimum 41 under-reporting factor estimate for events this year.\n\nThis doctor had no doubts that the vaccine is causing these injuries. Over and over again, severe reactions (some never seen before in his/her career) all started happening shortly after the soldier was vaccinated.\n\nDoD spokesman claims that the DMED database was underreported in 2016-2020\n\nOfficials compared numbers in the DMED with source data in the DMSS and found that the total number of medical diagnoses from those years ‘represented only a small fraction of actual medical diagnoses’. The 2021 numbers, however, were up-to-date, giving the ‘appearance of significant increased occurrence of all medical diagnoses in 2021 because of the underreported data for 2016-2020’.\n\nThe DMED system has been taken offline to ‘identify and correct the root-cause of the data corruption’.”\n\nWhat’s interesting is that only the event counts related to adverse events caused by the vaccines (as determined in VAERS) were affected by this “corruption”. That is, huge increases observed prior to the correction were only on symptoms that were vaccine-related, not on other symptoms. That makes their “corruption” explanation hard to explain. Very hard to explain.\n\nHow could a glitch in the computer only affect symptoms associated with the COVID vaccine? That would be the most amazing glitch in computer history. I would love to hear the explanation for that.\n\nWhy did the corruption only affect the years 2016 to 2020 and not 2021? Why, when we looked at the data before the corruption were only symptoms related to the vaccines elevated?\n\nOthers are shocked by this data as well\n\nI’m not the only one with doubts:\n• Evidence of Manipulation of Disease and Injury Data in US Military Database Suggests Fraud and Cover Up\n• MILITARY SPOKESMAN CLAIMS FIVE RANDOM YEARS OF DOD MEDICAL SURVEILLANCE SYSTEM WERE PLAGUED BY A GIANT GLITCH\n\nThe more they try to cover this up, the more complicit they become.\n\nYou can easily determine for yourself who is lying\n\nI wanted to see for myself who was lying so I picked an event that I’ve said for a long time has been highly elevated by the vaccines: pulmonary embolism. I didn’t cherry-pick this event. It was mentioned in my public ACIP testimony on January 4th, before I ever looked at any of the DMED data. But I’ve long highlighted pulmonary embolism as an elevated adverse event from the COVID vaccines.\n\nIf you download Renz’s spreadsheet, look at the spreadsheet tabs where it has the original data on the left and the “after the corruption was fixed” data on the right.\n\nIn the case above, I looked at the pulmonary embolism tab in the spreadsheet. The incidence of PE is estimated to be approximately 60 to 70 per 100,000 in the general population. This means that for the 1.4M members of the military in the DMED database, we’d expect fewer than 839 to 979 events per year since people in the military are healthier in general than the overall population.\n\nOn the left in the chart below are the numbers before the data was “fixed” by the DoD on January 31st, 2022. The rates on the left experienced nearly exactly match what would be expected. In four of the 5 years before the vaccine, the numbers were below 839. And even in the peak year (2020), the numbers are below 979.\n\nThe rates on the right-hand side after the “corruption” was corrected are simply too high to be believed, roughly around 3 times higher than the normal rates. How do they explain that?\n\nBut there are other examples of data manipulation that was done that are even more obvious, even to totally untrained observers. I’ll reveal those later since I don’t want to help them clean up the manipulated data… those smoking guns will be revealed later.\n\nThe corrected increases from the letter\n\nNote that the percentage increases were improperly calculated in the spreadsheet and the letter (which just used the numbers from the spreadsheet). The correct numbers are shown below (a 200% increase means the numbers increased by a factor of 3).\n\nThis data (and the subsequent cover-up attempt) is a smoking gun\n\nThe symptoms that are elevated in DMED match up with the elevated symptoms in VAERS?\n\nHow do they explain that away?\n\nAsk your pro-vax friends, doctors, reporters, public health officials, school board members, city council members, and local, state, and federal lawmakers the next time you see them to explain the DMED data. They will tell you they are “looking into it and will get back to you” and never will.\n\nComments from Jason Fields, active-duty in the Air Force\n\nOne of my readers, Jason Fields, is an active-duty Lieutenant Colonel in the United States Air Force serving in a United States Space Force unit. He has declined to take the COVID-19 vaccine and is seeking a vaccine accommodation waiver from Space Systems Command for both the COVID-19 and influenza vaccines.\n\nHe pointed this out:\n\n“One of the problems, as mentioned in the post, is that a lot of the military medical community is not willing to recognize and/or record possible vaccine injuries. I have a number of documented cases where military members who believe they have suffered a serious vaccine injury are totally blown off by the military medical community. The military members are told ‘there is no way‘ or ‘I guarantee the issues are not related to the vaccine’. Imagine the numbers if the medical community took this seriously. In any other situation it would be considered medical malpractice to not fully investigate these medical issues and the root cause.\n\nFaith in military medicine among the force was already somewhere near the garbage can pre-COVID…now it is sitting somewhere 6 feet under in the landfill. Between the mask and vaccine coercion the rank and file’s trust of the medical community is at an all time low.\n\nThe obvious answer to the rhetorical question of ‘What is the justification for him not issuing such an order?’ is there is no justification and obviously he won’t do it. Nobody likes to admit they were wrong…especially the government and military.”\n\nGeneral Austin needs to step up for transparency\n\nGeneral Austin isn’t being transparent with the American people.\n\nIf General Austin were to issue a blanket order directed to all military doctors to speak freely and honestly about patient statistics without fear of retribution, we would be hearing a far different story than we are hearing now.\n\nBut General Austin, who could easily issue such an order, never will because it would destroy the “safe and effective” narrative and he would be fired.\n\nIn the current situation, now that “the cat is out of the bag,” the fact that he’s not issuing such an order for transparency so that America could hear the truth tells you everything you need to know.\n\nNo mainstream “fact-checker” is going to ask General Austin why he doesn’t issue such an order. The mainstream press will not either; they will not touch this story with a ten-foot pole. I guarantee it.\n\nIf our men in uniform are injured, it should never be due to a deliberate order from their commanding officers requiring them to inject themselves with a known dangerous substance that could kill or disable them. They have a right to know the truth about the vaccines. Ordering the mainstream media and military doctors to remain silent (which is the case today) is not the way for the truth to come out.\n\nEvery American should demand that General Austin allow military doctors to speak the truth and protect them from retribution.\n\nEvery American should demand that General Austin immediately order all military doctors to speak truthfully about what is going on with their own patients after being vaccinated and protect all those doctors from any retribution.\n\nIs there any justification for him not issuing such an order? I can’t think of one.\n\nYou can actually participate in the global efforts to cripple the Deep State organized criminal cabal's ability for genocide, while enjoying healthcare freedom at the same time, by boycotting Big Pharma for good.", "opengraph": {"type": "article", "title": "This Medical Data from the U.S. Department of Defense is Explosive", "url": "https://geopolitics.co/2022/02/10/this-medical-data-from-the-us-department-of-defense-is-explosive/", "description": "On February 1st, 2022, US Senator Ron Johnson sent a letter to DoD Secretary Lloyd Austin highlighting the dramatic rise in adverse events reported in the Defense…", "article:published_time": "2022-02-10T07:22:24+00:00", "article:modified_time": "2022-02-21T08:46:13+00:00", "site_name": "Covert Geopolitics", "image": "https://geopolitics.co/wp-content/uploads/2016/08/pentagon.jpg", "image:width": "1000", "image:height": "541", "locale": "en_US"}, "tags": ["military covid19 deaths"], "tweets": [], "movies": [], "links": ["https://www.ronjohnson.senate.gov/services/files/FB6DDD42-4755-4FDC-BEE9-50E402911E02", "https://geopolitics.co/wp-content/uploads/2022/02/2022-02-01-RHJ-letter-to-DoD-re-DMED.pdf", "https://www.ronjohnson.senate.gov/services/files/FB6DDD42-4755-4FDC-BEE9-50E402911E02", "https://renz-law.com/", "https://renz-law.com/attorney-tom-renz-whistleblowers-dmed-defense-medical-epidemiology-database-reveals-incredibly-disturbing-spikes-in-diseases-infertility-injuries-across-the-board-after-the-military-was-forced-to/", "https://renz-law.com/dmed-data/", "https://health.mil/military-health-topics/combat-support/armed-forces-health-surveillance-division/data-management-and-technical-support/defense-medical-surveillance-system", "https://www.politifact.com/factchecks/2022/jan/31/instagram-posts/numbers-were-based-faulty-data-military-spokespers/", "https://www.politifact.com/factchecks/2022/jan/31/instagram-posts/numbers-were-based-faulty-data-military-spokespers/", "https://dailyexpose.uk/2022/02/05/manipulation-of-military-database-suggests-fraud/", "https://www.theblaze.com/op-ed/horowitz-military-spokesman-claims-5-random-years-of-dod-medical-surveillance-system-were-plagued-by-a-giant-glitch", "https://ricochet.com/1127182/dmed-is-a-game-changer-on-vaccine-safety/", "https://renz-law.com/dmed-data/", "https://geopolitics.co/wp-content/uploads/2022/02/Renz-Law-DMED-Data.xlsx", "https://geopolitics.co/wp-content/uploads/2022/02/Renz-Law-DMED-Data.xlsx", "https://renz-law.com/dmed-data/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3718593/", "https://thecovidworld.com/this-medical-data-from-the-us-dod-is-explosive-mainstream-media-has-been-ordered-to-ignore-it/", "https://virutron.com/", "https://virutron.com/"], "authors": [], "publish_date": "2022-02-10T07:22:24+00:00"}