{"result_id": "083001", "URL": "https://geopolitics.co/2021/04/26/do-you-want-to-finance-a-killer-vaccine-and-be-inoculated-with-it-pass-me-the-cup-of-hemlock/", "timestamp": "2023-04-25 14:51:06 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://geopolitics.co/wp-content/uploads/2019/11/cg-icon-150x150.png", "canonical": "https://geopolitics.co/2021/04/26/do-you-want-to-finance-a-killer-vaccine-and-be-inoculated-with-it-pass-me-the-cup-of-hemlock/", "encoding": "UTF-8"}, "image": null, "domain": "geopolitics.co", "title": "Do You Want to Finance a Killer “Vaccine” and be “Inoculated” with It? Pass Me the Cup of Hemlock!", "cleaned_text": "After my wife carefully read Prof. Chossudovsky‘s startling article “Big Pharma Conglomerate with a Criminal Record: Pfizer ‘Takes Over’ EU Vaccine Market” in “Global Research” (1), she said,\n\n“So we citizens are paying for the poison Big Pharma wants to inject us with.”\n\nIndeed, because of the relentless fear campaign of an unscrupulous “elite”, out of negligent ignorance or out of an incomprehensible good faith towards Big Pharma, we EU citizens are allowing this pharmaceutical conglomerate to inject us with a killer “vaccine”. This is similar to the ancient drink of poisonous “spotted hemlock” used in executions and voluntary suicides in Athens in the 5th and 4th centuries BC.\n\nAccording to Prof. Chossudovsky’s thorough research, the European Commission is currently negotiating a contract with the pharmaceutical conglomerate Pfizer for the production of 1.8 billion mRNA vaccine doses – the largest vaccine project in world history. With this, every single person in the European Union is to be vaccinated four times within two years (2021 to 2021).\n\nBut Pfizer’s mRNA – as well as those of its competitors including Astrazeneca, Moderna and J & J – are illegal drugs. That is, they are classified as “unapproved” and “experimental products” in the US. So it is blatantly illegal to market an “unapproved product”. In addition, the “vaccine” project is flushing $41 billion into Big Pharma’s coffers and there will be no return to the “New Normal” after the “vaccination”.\n\nRegarding the “reliability” of the EU partner Pfizer (von der Leyen), Chossudovsky recalls a “Pandora’s box” that the EU does not want to open:\n\nPfizer, he said, was a “habitual offender” with a criminal record in the US and was indicted by the US Department of Justice in 2009 for “deceptive marketing”. Pfizer pleaded guilty and agreed to a $2.3 billion settlement. Also to be recalled are the many deaths and injuries caused by the “experimental vaccine” mRNA.\n\nSufficiently documented: The vaccine is not required. There is no pandemic!\n\n“Why,” Chossudovsky concludes, “should the EU Commission buy 1.8 billion doses of Pfizer’s mRNA ‘vaccine’, which is known from the outset to have caused deaths and injuries, including autoimmune reactions, blood clotting abnormalities, stroke or internal bleeding?” Next, Chossudovsky demands:\n\nDr Rudolf Hänsel is a graduate psychologist and educationalist. He is a frequent contributor to Global Research.\n\nOn April 14, 2021, the President of the European Commission confirmed that Brussels is negotiating a contract with Pfizer for the production of 1.8 billion mRNA vaccine doses.\n\nThis astronomical figure represents 23 percent of the World’s population. It is exactly four times the population of the 27 member states of the European Union (448 Million, 2020 data).\n\nThis is the largest vaccine project in World history which is accompanied by the imposition of a diabolical “Timeline” on the people of the European Union consisting of recurrent mRNA inoculations over “the next two years and beyond”.\n\nThe entire process will be coupled with a relentless fear campaign and the embedded ID vaccine passport, approved by the European Parliament barely a few weeks prior to the EU’s announcement.\n\nThe EU Digital Vaccine Passport to be implemented by Pfizer BioNTech is part of theinfamous ID2020 project sponsored by Bill Gates’ Global Alliance for Vaccines and Immunization (GAVI) “which uses generalized vaccination as a platform for digital identity“.\n\nIf this EU contract with Pfizer extending into 2023 were to be carried out as planned, every single person in the European Union would be vaccinated four times over a two year period (2021-2023).\n\nAnd bear in mind, at the time of writing, Pfizer’s mRNA (as well as those of its competitors including Astrazeneka, Moderna and J & J) are legally categorized (in the US) as “unapproved” and “experimental products”. They are illegal drugs.\n\nIn the US, the FDA in its ambiguous statement provided a so-called Emergency Use Authorization (EUA) to the Pfizer-BioNTech vaccine, namely “to permit the emergency use of the unapproved product, … for active immunization…” (see below)\n\nI have checked this statement with a prominent lawyer. It is blatantly illegal to market an “unapproved product” (irrespective of government permissions pertaining thereto).\n\nCoinciding with the EU April 14, 2021 historic decision, Pfizer has announced that the price of its vaccine has been hiked up to $23 a dose.\n\nBig Money for Big Pharma. The 1.8 billion doses vaccine project will cost 41 billion dollars, largely to be financed by the creditors of EU member states. The vaccine project will thereby contribute to the spiralling public debt crisis affecting most European countries, which was triggered by the closure of economic activity and the lockdowns in the course of last 13 months.\n\nMeanwhile, Pfizer has extended its global market largely to the detriment of its competitors.\n• A contract to supply the US with up to 600 million doses,\n\nThe Medium Term: 2021-2023 and “Beyond”. No Return to the “New Normal” once Vaccinated\n\nWhat is envisaged in the EU is a so-called “medium term” plan extending into 2022/23. Does this “medium term” timeline imply a fourth and a fifth wave?\n\nThe “medium term” project will be carried out in liaison with the “Great Reset” proposed by the World Economic Forum. It will most probably be accompanied by lockdown and other restrictive measures. No foreseeable return to the “New Normal” is contemplated:\n\nBut let me [President of EU Commission Ursula von der Leyen] also focus on the medium term. ... It is clear that to defeat the virus decisively, we will need to be prepared for the following: … we might need booster jabs to reinforce and prolong immunity; … we will need to develop vaccines that are adapted to new variants; and we will need them early and in sufficient quantities. Having this in mind we need to focus on technologies that have proven their worth. mRNA vaccines are a clear case in point.\n\nBased on all this, we are now entering into a negotiation with BioNTech-Pfizer for a third contract. This contract will foresee the delivery of 1.8 billion doses of vaccine over the period of 2021 to 2023. And it will entail that not only the production of the vaccines, but also all essential components, will be based in the EU.\n\nThe negotiations we are launching today [April 14, 2021]– and hope to conclude very rapidly – are a further important step in Europe’s response to the pandemic.\n\nI want to thank BioNTech-Pfizer. It has proven to be a reliable partner. It has delivered on its commitments, and it is responsive to our needs. This is to the immediate benefit of EU citizens. ( President of EU Commission)\n\nThere is another dimension, a “can of worms” which the EU does not want to open. The largest vaccine project of an “unapproved drug” is to be implemented by a Big Pharma company which has a longstanding record of bribing medical doctors and public health officials.\n\nPfizer has been a “habitual offender,” persistently engaging in illegal and corrupt marketing practices, bribing physicians and suppressing adverse trial results. Since 2002 the company and its subsidiaries have been assessed $3 billion in criminal convictions, civil penalties and jury awards. (Dr Robert G. Evans, National Institutes of Medicine)\n\nMoreover, Pfizer has a criminal record in the US, indicted by the US Department of Justice in 2009 for “fraudulent marketing”.\n\n“Pfizer, the world’s largest drugs company, has been hit with the biggest criminal fine in US history as part of a $2.3bn settlement with federal prosecutors for mispromoting medicines and for paying kickbacks to compliant doctors.”(Guardian)\n\nIn a historic US Department of Justice decision in September 2009, Pfizer Inc. pleaded guilty to criminal charges. It was “The Largest Health Care Fraud Settlement” in the History of the U.S. Department of Justice.\n\nHow on Earth can you trust a Big Pharma vaccine conglomerate which pleaded guilty to criminal charges by the US Department of Justice (DoJ) including “fraudulent marketing” and “felony violation of the Food, Drug and Cosmetic Act”?\n\nIn this 2009 DOJ Judgment, Pfizer was so to speak “Put on Probation” for a four year period. Pfizer was ordered to enter into “a corporate integrity agreement” with the Inspector General of the Department of Health and Human Services (DHHS), acting as a de facto “Parole Officer”. “That agreement provided for “procedures and reviews to … avoid and promptly detect” (future) misconduct on the part of Pfizer, Inc.\n\nCorporate Integrity? Pfizer BioNTech’s “Fraudulent Marketing” behaviour prevails with regard to the projected 1.8 billion doses of its “unapproved” “experimental” mRNA COVID‑19 Tozinameran “vaccine”, sold under the brand name Comirnaty.\n\nWhat we are dealing with is the “fraudulent marketing” of what is best described as a killer “vaccine”.\n\nBut in fact, the mRNA “vaccine” which modifies the human genome “is NOT” a vaccine. It is based on gene therapy combined with an embedded ID vaccine passport.\n\nDeaths and Injuries Resulting From the MRNA “Experimental Vaccine”\n\nIs the European Commission intent on edging out Astrazeneka and J & J (on behalf of Pfizer??). Official statements suggest that Pfizer BioNTech will eventually be taking over the entire EU vaccine market.\n\nIn early March 2o21, 18 European countries including France, Italy, Germany and Spain decided to suspend the AstraZeneka mRNA vaccine. Astrazeneka was the target of national EU governments, the European Medicines Agency (EMA) as well as the EU Commission.\n\nThe EU has now confirmed that it will not renew its contracts with J and J and AstraZeneka despite the fact (according to EU and UK data) that the deaths and injuries resulting from the Pfizer BioNTech “vaccine” are much higher than those of AstraZeneka.\n\nOfficial EU data pertaining to vaccine deaths and injuries for Pfizer, Moderna and AstraZeneca point to: 3,964 Dead and 162,610 Injuries (December 27, 2020 – March 13, 2021)\n\nTotal reactions for the experimental vaccine AZD1222(CHADOX1 NCOV-19) from Oxford/AstraZeneca: 451 deaths and 54,571 injuries to 13/03/2021\n\nTotal reactions for the experimental mRNA vaccine Tozinameran (code BNT162b2, Comirnaty) from Pfizer: 2,540 deaths and 102,100 injuries to 13/03/2021\n\nTotal reactions for the experimental mRNA vaccine mRNA-1273 (CX-024414) from Moderna: 973 deaths and 5,939 injuries to 13/03/2021\n\nUK data also confirms that the so-called side effects of the mRNA are significantly higher for the Pfizer BioNTech “vaccine” (in comparison with AstraZeneka). See British Government Shocking Report on Side Effects of Corona Vaccines: Strokes, Blindness, Miscarriages\n\nSo why are Pfizer’s competitors, namely Astrazeneka and J & J being shoved out of the EU market?\n\nThere is War within Big Pharma.\n\nAmply documented, the vaccine is not required. There is no pandemic.\n\nAnd why would the EU Commission representing 450 million people in 27 countries commit itself to purchasing 1.8 billion doses of Pfizer’s mRNA Tozinameran”vaccine” which at the very outset is known to have resulted in countless deaths and injuries including autoimmune reactions. blood clotting abnormalities, stroke and internal bleeding?\n\nWho is behind this despicable project??\n\nSee the Rebuttal of Doctors for Covid Ethics addressed to the European Medicines Agency (EMA).\n\nSay NO to the Killer Virus. The EU sponsored Pfizer “vaccine” must be the object of a coordinated grassroots movement in all 27 member states of the European Union, as well as Worldwide.\n\nThe scientific evidence amply confirms that a Covid-19 vaccine is NOT required. Quite the opposite.\n\nThe estimates of so-called covid-19 positive cases are based on the RT-PCR test which according to the WHO’s latest statement (January 20, 2021) is totally unreliable and which has served to hike up the numbers, while also justifying the need for a mRNA vaccine, which in effect is not a vaccine.\n\nWhile the media will highlight the “Killer virus”, with scanty and contradictory “evidence”, what is at stake is best described as “a killer vaccine”.\n\nMoreover, the estimates of Covid deaths used to justify the need for a vaccine are fake. In the US, certifiers have been instructed to indicate the “underlying cause of death” as Covid-19 “more often than not”.\n• How to Mislead Humanity and Lock Down Society Using COVID-19 RT-PCR Tests\n• A Global Team of Experts has found 10 Fatal Flaws in the Main Test for Covid\n• Big Pharma’s Most Corrupt Company Plans to Corner the COVID-19 Market\n\nWhen we see our public officials gleefully allowing themselves to be inoculated with the latest mRNA vaccines based on a fake pandemic, we know that we are being managed and ruled by idiocy. Some actions on our part are required.\n\nYou can actually participate in the global efforts to cripple the Deep State organized criminal cabal's ability for genocide, while enjoying healthcare freedom at the same time, by boycotting Big Pharma for good.", "opengraph": {"type": "article", "title": "Do You Want to Finance a Killer “Vaccine” and be “Inoculated” with It? Pass Me the Cup of Hemlock!", "url": "https://geopolitics.co/2021/04/26/do-you-want-to-finance-a-killer-vaccine-and-be-inoculated-with-it-pass-me-the-cup-of-hemlock/", "description": "After my wife carefully read Prof. Chossudovsky‘s startling article “Big Pharma Conglomerate with a Criminal Record: Pfizer ‘Takes Over’ EU Vaccine Market” in “Global Research” (1), she said, “So w…", "article:published_time": "2021-04-26T12:14:48+00:00", "article:modified_time": "2021-05-03T14:07:41+00:00", "site_name": "Covert Geopolitics", "image": "https://geopolitics.co/wp-content/uploads/2021/04/pfizer-vaccine.jpg", "image:width": "992", "image:height": "558", "locale": "en_US"}, "tags": ["pcr tests", "covid-19 lockdown"], "tweets": [], "movies": [], "links": ["https://www.globalresearch.ca/big-pharma-conglomerate-with-a-criminal-record-pfizer-takes-over-the-eu-vaccine-market-1-8-billion-doses/5742812", "https://ec.europa.eu/commission/presscorner/detail/en/statement_21_1741", "https://www.globalresearch.ca/coronavirus-causes-effects-real-danger-agenda-id2020/5706153", "https://www.fda.gov/media/144413/download", "https://www.fda.gov/media/144413/download", "https://www.globalresearch.ca/wp-content/uploads/2021/04/von-der-Leyen.jpg", "https://ec.europa.eu/commission/presscorner/detail/en/STATEMENT_21_1741", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2875889/", "https://www.theguardian.com/business/2009/sep/02/pfizer-drugs-us-criminal-fine", "https://www.justice.gov/opa/pr/justice-department-announces-largest-health-care-fraud-settlement-its-history", "https://virutron.com/big-pharmas-most-corrupt-company-plans-to-corner-the-covid-19-market/", "https://www.c-span.org/video/?288664-1/pfizer-medical-fraud-settlement", "https://www.justice.gov/opa/pr/justice-department-announces-largest-health-care-fraud-settlement-its-history", "https://www.ema.europa.eu/en", "https://www.globalresearch.ca/3964-dead-162610-injuries-european-database-adverse-drug-reactions-covid-19-vaccines/5740942", "https://www.globalresearch.ca/3964-dead-162610-injuries-european-database-adverse-drug-reactions-covid-19-vaccines/5740942", "https://www.globalresearch.ca/british-government-publishes-shocking-report-side-effects-corona-vaccines-strokes-blindness-miscarriages/5742852", "https://doctors4covidethics.medium.com/urgent-open-letter-from-doctors-and-scientists-to-the-european-medicines-agency-regarding-covid-19-f6e17c311595", "https://virutron.com/who-confirms-that-the-covid-19-pcr-test-is-flawed/", "https://virutron.com/how-to-mislead-humanity-and-lock-down-society-using-covid-19-rt-pcr-tests/", "https://virutron.com/covid19-pcr-tests-are-scientifically-meaningless/", "https://virutron.com/a-global-team-of-experts-has-found-10-fatal-flaws-in-the-main-test-for-covid/", "https://virutron.com/pcr-tests-proven-unreliable-in-portuguese-court-msm-ignores/", "https://virutron.com/big-pharmas-most-corrupt-company-plans-to-corner-the-covid-19-market/", "https://virutron.com/", "https://virutron.com/"], "authors": [], "publish_date": "2021-04-26T12:14:48+00:00"}