{"result_id": "083016", "URL": "https://geopolitics.co/2022/01/14/bastille-2022-building-a-worldwide-movement-against-corona-tyranny/", "timestamp": "2023-04-25 14:51:19 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://geopolitics.co/wp-content/uploads/2019/11/cg-icon-150x150.png", "canonical": "https://geopolitics.co/2022/01/14/bastille-2022-building-a-worldwide-movement-against-corona-tyranny/", "encoding": "UTF-8"}, "image": null, "domain": "geopolitics.co", "title": "Bastille 2022: Building a Worldwide Movement Against “Corona Tyranny”", "cleaned_text": "What is presented in this article is a preliminary draft: suggested concepts and ideas pertaining to the formulation of a Worldwide People’s Movement vs. the “Unelected Corona Public-Private Partnership”.\n\nThe Storming of the Bastille occurred in Paris on the afternoon of July 14, 1789. The Bastille was a medieval armory, fortress, and political prison. It was the symbol of Royal Authority under the reign of King Louis XVI.\n\nThe French monarchy was obliged to accept the authority of the newly proclaimed National Assembly as well endorse the Fundamental Rights contained in the “Declaration des Droits de l’Homme et du Citoyen” (Declaration of the Rights of Man and of the Citizen), formulated in early August 1789.\n\nMore than 230 years later, these Fundamental Rights (Liberté, Égalité, Fraternité) are now being contravened by corrupt governments around the World on behalf of a totalitarian and illusive financial establishment.\n\nBastille 2022 pertains not only to the restoration of these fundamental rights. It seeks to reverse and disable the criminal COVID-19 agenda which in the course of the last two years has triggered economic, social and political chaos Worldwide in 193 member states of the United Nations, coupled with bankruptcies, unemployment, mass poverty and despair. Famines have been reported in 25 countries.\n\nStarting in November 2020, an experimental mRNA vaccine launched by our governments (allegedly with a view to combating the spread of the virus) has resulted in an ascending Worldwide trend of vaccine related deaths and injuries. It’s a killer vaccine. It’s a crime against humanity.\n\nWe do not seek to negotiate with corrupt government officials. We question their legitimacy. They are liars.\n\nOur intent is to confront the powerful actors behind this criminal endeavor which is literally destroying people’s lives Worldwide, while creating divisions within society. The impacts on mental health on population groups Worldwide are devastating.\n\nThe numerous lockdowns (stay at home of the work force), fear campaigns, COVID-19 policy mandates imposed on 193 member states of the United Nations have also contributed to undermining and destabilizing:\n• The very fabric of civil society and its institutions including education, culture and the arts, social gatherings, sports, entertainment, etc.\n• All public sector activities including physical and social infrastructure, social services, law enforcement, etc.\n• All major private sector activities which characterize national, regional and local economies including small, medium and large corporate enterprises, family farms, industry, wholesale and retail trade, the urban services economy, transport companies, airlines, hotel chains, etc.\n• The structures of the global economy including international commodity trade, investment, import and export relations between countries, etc. The entire landscape of the global economy has been chattered.\n\nIn turn, a process of enrichment by the elite billionaires together with widening social inequalities has unfolded. The massive debts incurred by the Nation-State resulting from corruption as well fiscal collapse have skyrocketed. Increasingly national governments are in a straitjacket, under the brunt of powerful creditor institutions. Mounting debts at all levels of society are the driving force.\n\nWhat is at stake is the creation of a mass movement (Nationally and Worldwide) which questions the legitimacy and authority of the architects of this insidious project which broadly speaking emanates from: Big Money, Big Pharma, the Information Technology Conglomerates, the Security Apparatus, Intelligence, the Military Industrial Complex, Big Energy, the Corporate Media.\n\nIronically, the architects of the COVID-19 “pandemic” are now actively involved in formulating the “Solution”. The World Economic Forum’s Great Reset consists in installing a Worldwide totalitarian regime. What is contemplated is a system of “Global Governance”.\n\nA 190+ UN member nation states are slated to be weakened and undermined. They are under the grip of the most serious debt crisis in World history. Under the Great Reset, the institutions of parliamentary democracy and the Welfare State are to be replaced by an unelected “public-private partnership” dominated by the upper echelons of the financial establishment. In the words of the late David Rockefeller:\n\n“…The world is now more sophisticated and prepared to march towards a world government. The supranational sovereignty of an intellectual elite and world bankers is surely preferable to the national auto-determination practiced in past centuries.” (quoted by Aspen Times, August 15, 2011, emphasis added)\n\nThe Global Governance scenario imposes an agenda of social engineering and economic compliance:\n\nIt constitutes an extension of the neoliberal policy framework imposed on both developing and developed countries. It consists in scrapping “national auto-determination” and constructing a Worldwide nexus of proxy regimes controlled by a “supranational sovereignty” (World Government) composed of leading financial institutions, billionaires and their philanthropic foundations. (See Michel Chossudovsky E-book, Chapter XIII)\n\nWe will seek all avenues through peaceful means to disable and undermine this totalitarian project including dialogue with and within public and private institutions, law enforcement officials, members of the military and the judicial.\n\nWhat is required is to break down the structures of corruption, hierarchy and abusive authority, namely to pursue what might be described as:\n\n“the democratization of decision-making within our institutions”.\n\nWe must nonetheless understand the limitations of conducting effective judicial procedures against national governments. The judges are often pressured, threatened and corrupt, aligned with both dominant financial interests and politicians.\n\nMoreover, inasmuch as this insidious project is enforced by national governments Worldwide, the International Criminal Court (ICC) which is officially “independent” in regards to the UN Security Council, has a longstanding record of side-stepping US-NATO war crimes. The ICC is controlled by the same financial elites which control the governments.\n\nWe must also understand the complexities of this carefully designed and coordinated totalitarian project, namely the role of various fraudulent financial institutions, corporate advisory and lobby groups, consultants, “scientific advisors’, etc. acting as intermediaries on behalf of Big Pharma and the financial elites.\n\nThere is a hierarchy in the structures of authority. This complex and intricate decision making process is used to co-opt, bribe and manipulate government officials. Almost identical policy mandates (emanating from higher authority) are implemented simultaneously in numerous countries, requiring active coordination. The same powerful lobby firms are acting at one and the same time in different countries (e.g. in North America and the European Union).\n\nAn extensive multi-billion dollar budget has been allocated to the implementation Worldwide of COVID-19 policy mandates. The latter have been conducive to the destabilization of civil society and its institutions including the disruption of health services, education, sports, cultural activities, etc.\n\nThe legitimacy of politicians and their powerful Big Money sponsors must be challenged, including the police state measures adopted to enforce the imposition of a digital vaccine passport as well as the wearing of the face mask, social distancing, etc.\n\nWhat are our Priorities? Counter Propaganda\n\nMore than 7 billion people Worldwide are directly or indirectly affected by the corona crisis. Several billion people have already been vaccinated by an “unapproved” experimental mRNA “vaccine”, which has resulted in a Worldwide wave of mortality and morbidity.\n\nWhile this tendency is confirmed by official figures pertaining to vaccine-related deaths and adverse events, the mainstream media and the governments are in a state of denial.\n\nThe devastating health impacts of the COVID-19 vaccine are rarely acknowledged. It’s the same catch phrase (which is an outright lie) repeated ad nauseam: “the virus is far more dangerous than the vaccine”.\n\n“we actually have more safety data on the vaccine than the virus, and already see that the virus is far more dangerous than the vaccine. (Intercare)\n\nDr. Alan Schroeder thinks it’s very natural for parents to worry, but said for teens, the virus is more dangerous than the vaccine. (NBC)\n\nDoctors are on the lookout for it in children, but the bottom line remains that the virus is far more dangerous than the vaccine.\n\n“The mutations in the omicron variant make it [the virus] more prolific, dangerous, and elusive“\n\nThis propaganda consensus must be broken. With regard to the vaccine, informing people across the land regarding the data on deaths and adverse events is the first step.\n\nThe COVID Crisis initiated in January 2020 is unprecedented in World History. Propaganda under Nuremberg is a Crime.\n\nDismantling the propaganda apparatus is crucial. Counter-propaganda plays a key role in revealing the lies used to justify the policy mandates.\n\nWithout persistent media disinformation, the official COVID narrative falls flat.\n\nFirst and foremost we must forcefully challenge the mainstream media, without specifically targeting mainstream journalists, who have been instructed to abide by the official narrative. We should in this regard favor dialogue with individual (independent) journalists.\n\nWe must ensure that people Worldwide achieve an understanding of the history and devastating impacts of the COVID crisis supported by scientific concepts, analysis, testimonies and data. This endeavor will require a parallel process at the grassroots level, of sensitizing fellow citizens and establishing dialogue on the nature of the alleged pandemic, the mRNA vaccine, the RT-PCR test, as well as the devastating economic and social impacts of the lockdowns.\n\nWhile we must put an end to the fear campaign, we must nonetheless inform our fellow citizens regarding the dangers of the mRNA vaccine as well as the engineered chaos of this totalitarian agenda of “global governance” on the very structures of civil society.\n\nThe “fear campaign” is to be replaced by “information, concepts, analysis and data” as well as “strategies” to confront Big Pharma, corrupt officials in high office as well as their Big Money sponsors.\n\nWe must also ensure the conduct of dialogue and debate at the grassroots of society.\n\nPutting an End to The “Killer Vaccine”\n\nOur first task is to immediately halt and cancel the so-called COVID-19 “vaccine” which has triggered a wave of mortality and morbidity Worldwide.\n\n“The gene injections are unsafe. They can cause anaphylactic reactions, thromboembolism, thrombocytopenia, disseminated intravascular coagulation, and myocarditis in the short term.\n\nThere is possible immunosuppression and antibody-dependent enhancement, ADE, in the medium-term.\n\nAnd in the long term there are possible autoimmune diseases, cancer and infertility, risks that have not been ruled out yet.”\n\nAccording to Doctors for COVID Ethics, in the EU, UK and US the data respectively tabulated by EudraVigilance, MHRA (UK) and VAERS (US):\n\n“have now recorded many more deaths and injuries from the COVID-19 “vaccine” roll-out than from all previous vaccines combined since records began”\n\nWith regard to the mRNA “vaccine”, the catastrophic number of injection related deaths has NOT been reported by the mainstream media, despite the official figures being publicly available.\n\n“The signal of harm is now indisputably overwhelming, and, in line with universally accepted ethical standards for clinical trials, we demand that the COVID-19 “vaccination” programme be halted immediately worldwide.\n\nContinuation of the programme, in the full knowledge of ongoing serious harm and death to both adults and children, constitutes Crimes Against Humanity/Genocide, for which those found to be responsible or complicit will ultimately be held personally liable”\n\nVideo: The COVID-19 vaccine was launched in mid to late December 2020.\n\nIn many countries, there was a significant shift in mortality following the introduction of the mRNA vaccine.\n\nIt is worth noting that a Confidential Pfizer Report released as part of a Freedom of Information (FOI) procedure provides data on deaths and adverse events recorded by Pfizer from the outset of the vaccine project in December 2020 to the end of February 2021, namely a very short period (at most two and a half months):\n\nIn a twisted irony, the data revealed in this “insider report” refutes the official vaccine narrative peddled by the governments and the WHO. It also confirms the analysis of numerous medical doctors and scientists who have revealed the devastating consequences of the mRNA “vaccine”.\n\nWhat is contained in Pfizer’s “confidential” report is detailed evidence on the impacts of the “vaccine” on mortality and morbidity. This data which emanates from the “Horse’s Mouth” can now be used to confront as well formulate legal procedures against Big Pharma, the governments, the WHO and the media.\n\nIn a Court of Law, the evidence contained in this Big Pharma confidential report (coupled with the data on deaths and adverse events compiled by the national authorities in the EU, UK and US) is irrefutable: because it is their data and their estimates and not ours. (Analysis of Pfizer Confidential Report)\n\nIt is an admission on the part of both the governments and Big Pharma that the COVID-19 vaccine is a criminal undertaking “Pfizer knew from the outset that it was a killer vaccine. No attempt has been made by the governments to call for the withdrawal of the killer vaccine.”\n\nIt is with noting that Pfizer has a criminal record (2009) with the US Department of Justice on charges of “fraudulent marketing”.\n\nAs part of the 2009 DoJ settlement, Pfizer was put on parole:\n\n“Pfizer also has agreed to enter into an expansive corporate integrity agreement … [which] provides for procedures and reviews to be put in place to avoid and promptly detect conduct similar to that which gave rise to this matter.”\n\nBut we are no longer dealing with “fraudulent marketing”:\n\n“Killing is Good for Business”: The vaccine is a multibillion dollar operation worldwide. It’s manslaughter.\n\nOnce the “vaccine” has been halted, the criminality of Big Pharma will be fully revealed and understood. In turn, the legitimacy of the official COVID narrative based on lies and fake science will inevitably be impaired. This is the first step towards breaking the “official” COVID narrative.\n\nThe Truth is an important peaceful weapon. Without propaganda and media disinformation, the architects of this project do not have a leg to stand on.\n\nLet us break the “official” COVID-19 consensus and the propaganda apparatus which provides “legitimacy” to a criminal agenda.\n\nOnce it collapses, it will open up the road towards reversing the broader process of economic, social and political chaos generated in the course of the last two years.\n\nWhat is unfolding is a new and destructive phase of US imperialism. It’s a totalitarian project of economic and social engineering.\n\nThe Biden administration has endorsed the COVID Agenda, which has been used to destabilize and weaken national economies including those of “enemy nations”.\n\nWe cannot divorce our understanding of the COVID Crisis from that of US foreign policy and America’s hegemonic agenda: e.g. US-NATO confrontation with Russia in Eastern Europe, the militarization of the South China Sea directed against China, Iran and the geopolitics of the Middle East, the ongoing sanctions regimes against Venezuela and Cuba, etc.\n\n“Big Money including the billionaire foundations are the driving force. It’s a complex alliance of Wall Street and the Banking establishment, The Big Oil and Energy Conglomerates, the so-called “Defense Contractors”, Big Pharma, the Biotech Conglomerates, the Corporate Media, the Telecom, Communications and Digital Technology Giants, together with a network of think tanks, lobby groups, research labs, etc. The ownership of intellectual property also plays a central role.\n\nThis powerful digital-financial decision-making network also involves major creditor and banking institutions: The Federal Reserve, the European Central Bank (ECB), the IMF, the World Bank, the regional development banks, and the Basel based Bank for International Settlements (BIS), which plays a key strategic role.\n\nIn turn, the upper echelons of the US State apparatus (and Washington’s Western Allies) are directly or indirectly involved, including the Pentagon, US Intelligence (and its research labs), the Health authorities, Homeland Security and the US State Department (including US embassies in over 150 countries).” (Michel Chossudovsky, E-book, Chapter XIII)\n\nIt should be noted that organized opposition in many Western countries is weak. Why? Because “progressive forces” including left intellectuals, NGO leaders, trade union and labor leaders both in Western Europe and North America have from the outset endorsed the official COVID narrative. Many of these progressive movements are supported by corporate foundations.\n\nThe same billionaire foundations (Rockefeller, Ford, Gates, et al) which are the unspoken architects of the “Great Reset” and “Global Governance” are also involved in (generously) financing various social movements. “They control the opposition”.\n\nWhat this means is that grassroots activists are often misled and betrayed by their leaders who are routinely coopted by their billionaire sponsors.\n\nIt is essential that these grassroots activists be integrated into the mainstay of the movement against the COVID-19 consensus.\n\nWhat is required is the development of a broad based grassroots network which confronts both the architects of this crisis all well as all levels of government (i.e. national, states, provinces, municipalities, etc.) involved in imposing the vaccine as well carrying out the lockdown and closure of economic activity.\n\nThis network would be established (nationally and internationally) at all levels of society, in towns and villages, work places, parishes. Trade unions, farmers organizations, professional associations, business associations, student unions, veterans associations. Church groups would be called upon to integrate this movement.\n\n“Spreading the word” through social media and independent online media outlets will be undertaken bearing in mind that Google as well as Facebook are instruments of censorship.\n\nLegal procedures and protests are unfolding in all major regions of the World. As part of a Worldwide network of initiatives, it is important to establish mechanisms of communication, dialogue and exchange within and between countries.\n\nThe creation of such a movement, which forcefully challenges the legitimacy of the financial elites, Big Pharma, et al., as well as the structures of political authority at the national level, is no easy task. It will require a degree of solidarity, unity and commitment unparalleled in World history.\n\nWhat is required is the breaking down of political and ideological barriers within society (i.e. between political parties) and acting with a single voice towards Building a Worldwide Consensus against Tyranny.\n\nWorldwide Solidarity and Human Dignity is the Driving Force.\n\nMichel Chossudovsky is an award-winning author, Professor of Economics (emeritus) at the University of Ottawa, Founder and Director of the Centre for Research on Globalization (CRG), Montreal, Editor of Global Research. He has undertaken field research in Latin America, Asia, the Middle East, sub-Saharan Africa and the Pacific and has written extensively on the economies of developing countries with a focus on poverty and social inequality. He has also undertaken research in Health Economics (UN Economic Commission for Latin America and the Caribbean (ECLAC), UNFPA, CIDA, WHO, Government of Venezuela, John Hopkins International Journal of Health Services (1979, 1983)\n\nYou can actually participate in the global efforts to cripple the Deep State organized criminal cabal's ability for genocide, while enjoying healthcare freedom at the same time, by boycotting Big Pharma for good.", "opengraph": {"type": "article", "title": "Bastille 2022: Building a Worldwide Movement Against “Corona Tyranny”", "url": "https://geopolitics.co/2022/01/14/bastille-2022-building-a-worldwide-movement-against-corona-tyranny/", "description": "What is presented in this article is a preliminary draft: suggested concepts and ideas pertaining to the formulation of a Worldwide People’s Movement vs. the “Unelected Corona Public-Private …", "article:published_time": "2022-01-14T12:58:03+00:00", "article:modified_time": "2022-01-19T13:07:01+00:00", "site_name": "Covert Geopolitics", "image": "https://geopolitics.co/wp-content/uploads/2022/01/AP21175312274064_edited.webp", "image:width": "1366", "image:height": "769", "locale": "en_US"}, "tags": ["corporate tyranny"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": null, "height": "0", "embed_code": "<iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" class=\"arve-iframe fitvidsignore\" data-arve=\"arve-youtube-xsrc_s2gqfw6447ccc7e4f39395970159\" data-src-no-ap=\"https://www.youtube-nocookie.com/embed/xSrc_s2Gqfw?feature=oembed&amp;iv_load_policy=3&amp;modestbranding=1&amp;rel=0&amp;autohide=1&amp;playsinline=0&amp;autoplay=0\" frameborder=\"0\" height=\"0\" sandbox=\"allow-scripts allow-same-origin allow-presentation allow-popups allow-popups-to-escape-sandbox\" scrolling=\"no\" src=\"https://www.youtube-nocookie.com/embed/xSrc_s2Gqfw?feature=oembed&amp;iv_load_policy=3&amp;modestbranding=1&amp;rel=0&amp;autohide=1&amp;playsinline=0&amp;autoplay=0\"/>", "src": "https://www.youtube-nocookie.com/embed/xSrc_s2Gqfw?feature=oembed&iv_load_policy=3&modestbranding=1&rel=0&autohide=1&playsinline=0&autoplay=0"}], "links": ["https://www.globalresearch.ca/wp-content/uploads/2022/01/louis-xvi.jpg", "https://www.britannica.com/topic/Declaration-of-the-Rights-of-Man-and-of-the-Citizen", "https://www.aspentimes.com/news/beware-new-world-order/", "https://www.globalresearch.ca/the-2020-worldwide-corona-crisis-destroying-civil-society-engineered-economic-depression-global-coup-detat-and-the-great-reset/5730652", "https://healthhub.intercare.co.za/2021/09/15/part-10-covid-19-vaccines-and-long-term-side-effects/", "https://www.nbcbayarea.com/news/coronavirus/fda-expected-to-approve-vaccinations-for-kids-but-are-parents-ready-to-move-forward/2537309/", "https://www.globalresearch.ca/prevailing-corona-nonsense-narrative/5764429", "https://doctors4covidethics.org/covid-vaccine-necessity-efficacy-and-safety-3/", "https://www.globalresearch.ca/jaccuse-governments-worldwide-lying-you-people-populations-they-purportedly-serve/5750650", "https://www.globalresearch.ca/bombshell-document-dump-pfizer-vaccine-data/5763397", "https://www.globalresearch.ca/bombshell-document-dump-pfizer-vaccine-data/5763397", "https://www.globalresearch.ca/justice-department-announces-largest-health-care-fraud-settlement/5738792", "https://www.globalresearch.ca/the-2020-worldwide-corona-crisis-destroying-civil-society-engineered-economic-depression-global-coup-detat-and-the-great-reset/5730652", "https://www.globalresearch.ca/michel-chossudovsky-biographical-summary/5580999", "https://journals.sagepub.com/doi/10.2190/CTXP-RL02-QGB8-6QQ4", "https://journals.sagepub.com/doi/10.2190/CTXP-RL02-QGB8-6QQ4", "https://journals.sagepub.com/doi/abs/10.2190/K31G-5ACT-BAWB-F7PN", "https://virutron.com/", "https://virutron.com/"], "authors": [], "publish_date": "2022-01-14T12:58:03+00:00"}