{"result_id": "083020", "URL": "https://geopolitics.co/2021/07/31/does-the-covid19-vaccine-trade-secret-ingredients-include-graphene-oxide/", "timestamp": "2023-04-25 14:51:22 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://geopolitics.co/wp-content/uploads/2019/11/cg-icon-150x150.png", "canonical": "https://geopolitics.co/2021/07/31/does-the-covid19-vaccine-trade-secret-ingredients-include-graphene-oxide/", "encoding": "UTF-8"}, "image": null, "domain": "geopolitics.co", "title": "Does COVID19 Vaccine Trade Secret Ingredients Include Graphene Oxide?", "cleaned_text": "The production of vaccines is not the only area of concern whereby the existing corporate system allows trade secrets to trample upon the welfare of the population, and the basic right of the people to an informed decision.\n\nThere is a strong case that Graphene Oxide is wrongfully mixed into the mRNA injections, which are in turn permitted to be coercively used as “vaccines”, although these mRNA injections cannot satisfy the classical definition of a vaccine, and therefore, they’re not qualified to be certified as such, until a redefinition of the word vaccine was done only recently.\n\nThis the reason why the likes of Bill Gates and other vaccine manufacturers refused to release the full details in their mRNA patents because by then the people will know how the mRNA technology is formulated, and weaponized for multiple objectives in order to pin down humanity into perpetual subservience, with the full concurrence of our respective authorities, who know nothing better.\n\nIn 2004, Konstantin Novoselov, Andre Geim and their colleagues from Manchester, UK and Chernogolovka, Russia reported the existence of graphene, a two-dimensional sheet of carbon that is 1 atomic layer thick. This discovery took the world by surprise because, almost 70 years earlier, physicists had argued convincingly that materials like graphene would be too thermodynamically unstable to exist. Graphene was immediately hailed as the “next big thing”, and new information that has emerged about its electrical, chemical and physical properties have only added to the growing excitement.\n\nIn 2010, Novoselov and Geim were awarded the Nobel Prize in Physics for their discovery and characterization of graphene.\n\nSome of graphene’s notable characteristics and possible applications are:\n\nGraphene oxide (GO) is a unique material that can be viewed as a single monomolecular layer of graphite with various oxygen-containing functionalities such as epoxide, carbonyl, carboxyl, and hydroxyl groups. When the GO is reduced with a suitable process, the reduced graphene oxide (rGO) formed resembles graphene but contains residual oxygen and other heteroatoms, as well as structural defects. GO and rGO have been used in nanocomposite materials, polymer composite materials, energy storage, biomedical applications, and catalysis, and as a surfactant with some overlaps between these fields. Photonic polymergraphene composite materials are also very useful in optical communications. Some researchers are trying to develop a new class of polymer-based optoelectronic devices embedding the optical and electronic functionalities of graphene, 2D inorganic-layered materials, and their hybrid hetero-structures. These devices will combine the fabrication advantages of polymer photonics with tunable-active and tunable-passive optical properties of such materials. Such devices are expected to find a wide range of applications not only in optical communications but also in biomedical instruments, chemical analysis, time-resolved spectroscopy, electro-optical sampling, microscopy, and surgery… 1.4.20 Frequency Multiplier\n\nIn 2009, researchers built an experimental graphene frequency multiplier that takes an incoming signal of a certain frequency and outputs a signal at a multiple of that frequency (Wang, H. et al., 2009; Wang,\n\nX. et al., 2009; Wang, Y. et al., 2009; Cricchio et al., 2009). 1.4.21 Optical Modulator\n\nWhen the Fermi level of graphene is tuned, its optical absorption can be changed. In 2011, researchers reported the first graphene-based optical modulator. Operating at 1.2 GHz without a temperature controller, this modulator has a broad bandwidth (from 1.3 to 1.6 μm) and small footprint (B25 μm2) ( Liu et al., 2011). 1.4.22 Infrared Light Detection\n\nGraphene reacts to the infrared spectrum at room temperature, albeit with sensitivity 100- to 1000-times too low for practical applications. However, two graphene layers separated by an insulator allowed an electric field produced by holes left by photo-freed electrons in one layer to affect a current running through the other layer. The process produces little heat, making it suitable for use in night-vision optics.\n\nThe sandwich is thin enough to be integrated in handheld devices, eyeglass-mounted computers, and even contact lenses. 1.4.23 Graphene Photodetectors\n\nPhotodetectors measure photon flux or optical power by converting the absorbed photon energy into electrical current. A wide range of devices (Saleh and Teich, 2007) are available, such as remote controls, televisions, and DVD players. With an internal photo-effect, the absorption of photons results in carriers excited from the valence to the conduction band, outputting an electric current. The spectral band-width is typically limited by the absorption (Saleh and Teich, 2007). Graphene absorbs from the UV to THz (Dawlaty et al., 2008; Wright et al., 2009). As a result, graphene-based photo-detectors could work over a much broader wavelength range. The response time is ruled by the carrier mobility, and graphene has great mobility, so it can be ultrafast (Saleh and Teich, 2007). Graphene’s suitability for high-speed photodetection was demonstrated in a communications link operating at 10 Gbit/s (Mueller et al., 2010). 1.4.24 Piezoelectricity\n\nDensity functional theory simulations predict that depositing certain adatoms on graphene can render it piezoelectricity responsive to an electric field applied in the out-of-plane direction. This type of locally engineered piezoelectricity is similar in magnitude to that of bulk piezoelectric materials and makes graphene a candidate for control and sensing in nanoscale devices (Ong et al., 2012) Reference: Applications of Graphene and Graphene-Oxide Based Nanomaterials by Sekhar Chandra Ray\n\nWhat this synopsis means is that the novel use of graphene is highly compatible with existing 5G and more advanced 6G communication systems in establishing interconnectivity between man and machine.\n\nObviously, graphene oxides can only be declared as part of the “lipid nanoparticle formulations LNP” in vaccine patents because of its inherent toxicity, and the sinister agenda behind its global distribution today.\n\nHowever, if one looks for the production of lipid nanoparticles in China, which is cited as one of the suppliers of vaccine incipients, the link between graphene and Moderna mRNA injections can easily be established. See “Application filed by Modernatx” clause below.\n\nHow is graphene can specifically be used in vaccines?\n\nA PubMed peer-reviewed article says that “functionalized graphene can serve as adjuvant because of its unique physicochemical properties,” like so:\n\nWhat is an adjuvant?\n\nAn adjuvant is an ingredient used in some vaccines that helps create a stronger immune response in people receiving the vaccine. In other words, adjuvants help vaccines work better, according to the CDC.\n\nWhy is Graphene Oxide Toxic to You?\n\nFirst of all, graphene oxide-based lipid nanoparticles are formulated into mRNA vaccines at 4.5pH, meaning it’s highly acidic. High acidity kills healthy cells on the spot.\n\nAs with all animals, the human body is electromagnetic in nature, but the strength of its own electromagnetic forces is so weak that they’re just enough to sustain the body’s form and internal functions to maintain homeostasis, or a state of stability.\n\nIt is therefore very easy to influence its form and internal functions with a stronger electromagnetic force, at will. Any electronic gadgets using at least a 3.5 power supply can do the job just right, especially those that utilizes the S-Band frequencies, e.g. Bluetooth headphones, cellular phones.\n\nWhy the hell did they assign these high voltage, long range signal propagating systems, and wireless consumer products near or at the heat generating frequencies, i.e. 2.495 GHz?\n\nThe short answer is, they cared about us too much. That’s why they’re even giving us a much higher option, i.e., High-band 5G uses frequencies of 25–39 GHz.\n\nThe non-technical masses cannot possibly understand why the Big Tech companies are already working on the use of graphene-based hydrogels, which could be used to link communicatively, as a biosensor at least, with the advancing AI-based control system via closely knitted 5G cellsites.\n\nThe interface is easy to insert into the body when dry, but behaves ‘stealthily’ inside the brain when wet A KAIST research team and collaborators revealed a newly developed hydrogel-based flexible brain-machine interface. To study the structure of the brain or to identify and treat neurological diseases, it is crucial to develop an interface that can stimulate the brain and detect its signals in real time. However, existing neural interfaces are mechanically and chemically different from real brain tissue. This causes foreign body response and forms an insulating layer (glial scar) around the interface, which shortens its lifespan. To solve this problem, the research team of Professor Seongjun Park developed a ‘brain-mimicking interface’ by inserting a custom-made multifunctional fiber bundle into the hydrogel body. The device is composed not only of an optical fiber that controls specific nerve cells with light in order to perform optogenetic procedures, but it also has an electrode bundle to read brain signals and a microfluidic channel to deliver drugs to the brain. The interface is easy to insert into the body when dry, as hydrogels become solid. But once in the body, the hydrogel will quickly absorb body fluids and resemble the properties of its surrounding tissues, thereby minimizing foreign body response. The research team applied the device on animal models, and showed that it was possible to detect neural signals for up to six months, which is far beyond what had been previously recorded. It was also possible to conduct long-term optogenetic and behavioral experiments on freely moving mice with a significant reduction in foreign body responses such as glial and immunological activation compared to existing devices. “This research is significant in that it was the first to utilize a hydrogel as part of a multifunctional neural interface probe, which increased its lifespan dramatically,” said Professor Park. “With our discovery, we look forward to advancements in research on neurological disorders like Alzheimer’s or Parkinson’s disease that require long-term observation.”\n\nThis is how the use of graphene oxide could actually facilitate the interconnectivity between the human body and existing wireless technology today.\n\nAs outlined above, some of the most significant graphene characteristics are:\n• Frequency Multiplier – could certainly be triggered to produce internal frequencies detrimental to healthy human cells, e.g., cancer cells;\n• Infrared Light Detection – “The process produces little heat, making it suitable for use in night-vision optics”; very useful in mass surveillance endeavors;\n• Piezoelectricity – “makes graphene a candidate for control and sensing”; surveillance is not enough, i.e., being able to control the target individual is paramount.\n\nThey are already implementing these allied technologies in an incremental fashion, so that the simpletons could not see the full picture of what they are building brick by brick, with everyone ultimately paying for the cost.\n\nThe mRNA injections produce spike protein can travel away from the injection site and accumulates in the spleen, bone marrow, liver, adrenal glands and with highest concentration in the ovary, according to its own inventor, Dr. Robert Malone, referring to the initial data obtained post vaccination in Japan prior to the Olympics.\n\nMany women across the world after receiving CoViD vaccines are complaining of irregularities in their menstrual bleeding; some experiencing heavy menstrual bleeding (menorrhagia), some bleeding before their periods were due or bleeding frequently (metrorrhagia/polymenorrhea), whereas some are complaining of postmenopausal bleeding. As of 5th April 2021, there have been ~958 cases of post-vaccination menstrual irregularities, including vaginal haemorrhages, that were recorded in MHRA’s adverse event reports. There were twice more cases of menstrual irregularities with CoViD Vaccine AstraZeneca than Pfizer (643 vs 315 respectively) [1]. It is anticipated that the actual numbers of cases are much higher than the numbers recorded in the pharmacovigilance systems as many women in different cultural context may have felt uncomfortable to talk about it, may not have thought that it was vaccine-related, or may have not been encouraged by their clinicians to make an official report into the adverse events reporting system. There have been recent reports of haemorrhage, blood clots and thrombocytopenia following administration of CoViD-19 vaccines that have raised concerns over the safety of genetic vaccines for people with pre-existing coagulation disorders or those on certain medications. Regulatory bodies have also issued warnings to the patients and healthcare professionals to be vigilant and seek prompt medical assistance if they experienced typical symptoms of cerebral venous sinus thrombosis (CVST), a potentially fatal clot in the brain [2,3]. European Medicines Agency has also revised the summary of product characteristics and listed thrombocytopenia (very low platelets) as a ‘common’ side effect (i.e., 1 in 100 to 1 in 10) of Vaxzevria, i.e., the CoViD vaccine AstraZeneca [4]. The pharmacovigilance data also suggests that thrombocytopenia is also a frequent observation followed by mRNA CoViD vaccines such as Pfizer or Moderna. The ‘heavy menstrual bleeding’ has been previously reported in females with underlying platelets disorders [5]. It is plausible that the vaccine-induced thrombocytopenia may be an explanation for the recent incidences of heavy menstrual bleeding experienced by women in different countries after the CoViD-19 vaccination. The significant loss of blood in many women may lead to severe anaemia, further exacerbate thrombocytopenia, and therefore may significantly increase the risk of haemorrhages and clots.\n\nIs the local politician, who declared the vaccine mandate, facemasking and lockdowns, aware of this critical empirical data to date, or is he just riding along to hide his own limitations?\n\nThese verifiable facts can now be superimposed with Bill Gates’ highly publicized statement to reduce the P [people] in his Innovating to Zero bullshit, and his timely prediction of a global pandemic via Event 201, three months prior to the Wuhan COVID19 lockdown.\n\nNot too long ago, the bright boys and girls of the United Nations deemed it necessary to prepare for the inevitable overloading of the planet with more “useless eaters”, coupled with deteriorating food supply and other basic resources [Kissinger’s thesis].\n\nThe problem is, instead of maximizing the use of science and available technologies to enhance the production of all resources necessary for human survival, they chose to trim the population instead, justifying their actions as “saving the planet” for future generations.\n\nThey advertise this plan as the Sustainable Development Goals, or simply Agenda 2030, which is supposedly a collection of 17 interlinked global goals designed to be a “blueprint to achieve a better and more sustainable future for all.”\n\nRealistically, none of those who formulated these goals are intelligent enough to have a direct knowledge as to how to make these things happen. Essentially, the Sustainable Goals are just empty words aimed at making them feel good about themselves.\n\nMost importantly, it’s just a propaganda to project that something is being done somewhere to placate the masses undergoing an accelerated awakening about the evils foisted on them from the very top echelons of power for a very long time.\n\nSmall brain acts in short timeframes, prefers text-based policy or decree, e.g., lockdowns, instead of a full spectrum scientific exploration to end the problems for good. But who’s really looking at the UN for the ultimate solutions to their predicaments?\n\nEach of the individual technology component discussed above has specific useful functions in the industrial sector at large. In fact, the same methods could also be made to work on life enhancing objectives, e.g., improve agricultural yield, monitor and remove environmental pollution in real time, enhance cellular and brain functions, eliminate criminal tendencies, all using the right electromagnetic frequencies.\n\nBut as in all scientific knowledge and existing technologies falling into the wrong hands, they can also be configured to serve a nefarious purpose, that even our elected decision makers may not be privy to, nor are they even qualified to understand how these technologies work in practical applications.\n\nThe authority to make policy decisions without the ideally required knowledge to see the potential effects of those policies is what makes the whole system prone to failure, and vulnerable to globalist manipulation and control.\n\nInitial post-vaccination data from Japan indicate that the spike protein accumulates in the bone marrow, adrenal glands, and various other organs, mostly in the ovary, according to Dr. Robert Malone, a pioneer in mRNA technology.\n\nIt should be very clear by now how the mRNA vaccines fit into the Sustainable Development Agenda of the member countries of the United Nations. The reduction of the population can easily be accomplished with taxpayers’ money and their silent concurrence, while sustaining the life of the whole Corporatocracy with the help of the CRISPR genetic engineering technology.\n\nIronically, some people are even buying into the technical wonder of transhumanism under the delusion that they can make themselves superhumans with embedded electronics, not realizing that the human body is already perfect and complete, that it only needs to clean up its environment from industrial pollutants and psychological stress, in order to achieve physical immortality.\n\nThe introduction of graphene oxides into the equally DNA manipulative mRNA injections is meant to defeat that fact.\n\nThe gross inability of state actors to perform their sworn duties to protect the welfare and interests of the people, with repeated reimplementation of lockdowns and facemasking, and the full implementation of vaccine passports, coupled with an advancing Artificial Intelligence network being developed by the G7 countries, at taxpayers’ expense, is the perfect storm by which individual liberty and healthcare freedom are effectively defeated, as it is now evidently undeniable.\n\nThe ongoing digitization of the financial system, and the ever-dizzying accumulation of personal data, all stored and accessible in cross-platform format, will be the chain that binds us all inescapably to the full AI control that suffers glitches from time to time because each individual component has been supplied by “for profit” companies, and it’s public knowledge by now that millions of bitcoins have been sequestered, or stolen by state actors, for disrupting the Deep State controlled financial system.\n\nInject all of these components into the AI-based control system and the potential for absolute control is very high. Once the Automated Slavery System is fully integrated and operational, there will be no turning back for humanity.\n\nIt is therefore imperative that humanity must act as one in removing these control freaks — the real useless eaters, from the whole equation, and the parasitic system that they’ve built, from the future that our children will inherit.\n\nWe applaud the ongoing weekly street demonstrations of the European population against vaccine passports, facemasking and lockdowns. They have fully understood what’s going on, and they can see where these are all going.\n\nThis type of action cannot be postponed and must be sustained until the people of America, and the rest of the globe, will finally stand up in arms against those who are perpetrating this systematic technocratic oppression, from their own backyard.\n\nYou can actually participate in the global efforts to cripple the Deep State organized criminal cabal's ability for genocide, while enjoying healthcare freedom at the same time, by boycotting Big Pharma for good.", "opengraph": {"type": "article", "title": "Does COVID19 Vaccine Trade Secret Ingredients Include Graphene Oxide?", "url": "https://geopolitics.co/2021/07/31/does-the-covid19-vaccine-trade-secret-ingredients-include-graphene-oxide/", "description": "The production of vaccines is not the only area of concern whereby the existing corporate system allows trade secrets to trample upon the welfare of the population, and the basic right of the peopl…", "article:published_time": "2021-07-31T09:49:29+00:00", "article:modified_time": "2021-08-06T16:51:46+00:00", "site_name": "Covert Geopolitics", "image": "https://geopolitics.co/wp-content/uploads/2021/07/graphene-applications.webp", "image:width": "1440", "image:height": "753", "locale": "en_US"}, "tags": ["graphene", "graphene oxide", "lipid nanoparticles"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": null, "height": "0", "embed_code": "<iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" class=\"arve-iframe fitvidsignore\" data-arve=\"arve-youtube-jaf-fq2zn7i6447cccabc1b9401401273\" data-src-no-ap=\"https://www.youtube-nocookie.com/embed/JaF-fq2Zn7I?feature=oembed&amp;iv_load_policy=3&amp;modestbranding=1&amp;rel=0&amp;autohide=1&amp;playsinline=0&amp;autoplay=0\" frameborder=\"0\" height=\"0\" sandbox=\"allow-scripts allow-same-origin allow-presentation allow-popups allow-popups-to-escape-sandbox\" scrolling=\"no\" src=\"https://www.youtube-nocookie.com/embed/JaF-fq2Zn7I?feature=oembed&amp;iv_load_policy=3&amp;modestbranding=1&amp;rel=0&amp;autohide=1&amp;playsinline=0&amp;autoplay=0\"/>", "src": "https://www.youtube-nocookie.com/embed/JaF-fq2Zn7I?feature=oembed&iv_load_policy=3&modestbranding=1&rel=0&autohide=1&playsinline=0&autoplay=0"}], "links": ["https://en.wikipedia.org/wiki/Lipid", "https://en.wikipedia.org/wiki/Solid_lipid_nanoparticle", "https://geopolitics.co/wp-content/uploads/2021/07/WO2020160397A1.pdf", "https://patents.google.com/patent/WO2020160397A1/en?oq=2020%2f160397", "https://pubmed.ncbi.nlm.nih.gov/?term=Xu+L&cauthor_id=26814441", "https://pubmed.ncbi.nlm.nih.gov/26814441/#affiliation-1", "https://pubmed.ncbi.nlm.nih.gov/?term=Xiang+J&cauthor_id=26814441", "https://pubmed.ncbi.nlm.nih.gov/?term=Liu+Y&cauthor_id=26814441", "https://pubmed.ncbi.nlm.nih.gov/?term=Xu+J&cauthor_id=26814441", "https://pubmed.ncbi.nlm.nih.gov/?term=Luo+Y&cauthor_id=26814441", "https://pubmed.ncbi.nlm.nih.gov/?term=Feng+L&cauthor_id=26814441", "https://pubmed.ncbi.nlm.nih.gov/?term=Liu+Z&cauthor_id=26814441", "https://pubmed.ncbi.nlm.nih.gov/?term=Peng+R&cauthor_id=26814441", "https://pubmed.ncbi.nlm.nih.gov/26814441/", "https://en.wikipedia.org/wiki/S_band", "https://www.sciencedaily.com/releases/2021/07/210713093659.htm", "https://geopolitics.co/wp-content/uploads/2021/07/OFFICIAL-INTERIM-REPORT-IN-ENGLISH-UNIVERSITY-OF-ALMERIA.pdf", "https://virutron.com/", "https://virutron.com/"], "authors": [], "publish_date": "2021-07-31T09:49:29+00:00"}