{"result_id": "083006", "URL": "https://geopolitics.co/page/2/", "timestamp": "2023-04-25 14:51:11 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://geopolitics.co/wp-content/uploads/2019/11/cg-icon-150x150.png", "canonical": "https://geopolitics.co/page/2/", "encoding": "UTF-8"}, "image": null, "domain": "geopolitics.co", "title": "Covert Geopolitics", "cleaned_text": "Last week, Saudi Arabia and Iran announced a landmark deal, brokered by China in Beijing, to formally restore diplomatic relations. The agreement saw the two sectarian arch rivals in the Middle East agree to put aside their differences and to normalize ties.\n\nIt was the first ever deal of its kind overseen by China, framing itself as a peacemaker, and showing that its commitment to have good relations with every country in the region is not just based on rhetoric but actual substance. Some have described it as a sign of a “changing global order.”\n\nTo put it mildly, it is bad news for the United States and deals a massive blow to the near-unlimited geopolitical sway Washington has long held over the region via its strategic relationships with countries such as Saudi Arabia.\n\nAdditionally, it effectively ruins a US led campaign to pressurize and isolate Iran and hinders American efforts to shape regional politics in Israel’s favor via the Abraham Accords. It is no surprise that the Western media is calling the Chinese-brokered deal a “challenge” to the international order, but what order is that? The ability of the US to dominate the Middle East? Perhaps brokering peace is a good thing.\n\nUS foreign policy in the Middle East\n\nSince the decline of European colonial empires, the United States has been the sole military hegemon in the Middle East, using a network of partnerships from Israel to the Gulf States to sustain domination over the region and allowing the US to exploit its energy resources. In order to maintain this position, the US has long needed adversaries in order to perpetuate an ongoing security dilemma and force reliance on it as a security guarantor, which is also beneficial to the US military industrial complex. These policies have accumulated decades worth of wars, insurgencies and attempts at regime change.\n\nDetractors to the US agenda have included revolutionary Arabist regimes, such as Saddam Hussein’s Iraq and Bashar Assad’s Syria, terrorist groups such as Al-Qaeda and ISIS, and of course the post-1979 Islamic Republic of Iran. It was after the US gave up on its botched attempt to topple Assad that policymakers in the Trump administration decided to focus on Tehran, tearing up US participation in the Joint Comprehensive Plan of Action (JCPOA) and imposing a crippling sanctions regime. In retaliation, Iran has waged a series of proxy conflicts against US partners in the region, most notably assisting the Houthis in Yemen against the Saudi-backed government, which has overseen the carpet-bombing of occupied regions.\n\nUnlike the United States, China’s policy in the Middle East is non-interventionist, and assumes a neutral posture in regional conflicts, taking a position of respect for national sovereignty. However, this does not mean Beijing has no interests in the region. As it grows and develops domestically, its need for secure access to energy resources has increased, leading it on a diplomatic push to build good relations with every country in the region, and this has only accelerated as the US has pushed to isolate China from the West. Despite the intra-regional power struggle, in the past two years, Beijing announced strategic partnerships with both Iran and the Gulf States.\n\nBecause China did not have the same military footprint or stakes in the Middle East as the US, many analysts were dismissive of Beijing’s ability to seriously act as a diplomatic mediator in the region. They believed that its attempts to build good ties with everyone were spread too thin. However, the Saudi-Iran deal shows this assumption was wrong. But how did it happen?\n\nFirst, it should be noted that the Gulf States are not “value” allies to the US in the way European countries are, and not “morally obligated” to follow the American cause. Rather, they are self-interested monarchies with very different ideological and value systems (strict Wahhabi Islam) and have seen the US as a “patron” in guaranteeing their economic and security interests (oil for weapons). This is not a “marriage”, just business.\n\nIt should be understood that the world has changed in ways which now lead these states to perceive that unparalleled US dominance, which is its unequivocal foreign policy goal, is no longer in their best interests. They have found a new, bigger partner in Beijing who not only can buy more of their oil, but also doesn’t have a foreign policy doctrine premised on evangelizing its ideology or creating war throughout the region. As such, when the US delivered an ultimatum to the United Arab Emirates that they will block the export of F-35s if they don’t drop Huawei from their 5G networks, Abu Dhabi told Washington where to go.\n\nWhile this shift was already underway by 2022, events last year exacerbated it further as the Gulf States suddenly found the US demanding that they take sides in a war – in Ukraine – which did not concern them, and worse still, demanding that they compromise their own economic interests to suit its sanctions agenda.\n\nThe US fell out with OPEC, and Saudi Arabia publicly rebuffed its demands to increase oil production. Meanwhile, the events of that year also emboldened Iran, who was not being swayed by US pressure, while the return of Benjamin Netanyahu to power in Israel exacerbated Arab-Israeli tensions, damaging the US backed Abraham Accords, and hindering Saudi Arabia’s willingness to normalize with Israel.\n\nThese events have ultimately created the political space for a diplomatic reconciliation between Saudi Arabia and Iran, backed by China. It’s a massive blow to American interests as it is the first major Middle East deal brokered without Washington’s influence, and subsequently dilutes its policy of creating a perpetual war machine in order to legitimize its footprint in the region and its clout over Arab States.\n\nIt also shows that the US campaign to try and isolate and crush Iran has failed, and that the United States no longer holds the power it once did to isolate countries. If the US is wise, it should use this development to rethink its approach to the Middle East, but if other policies are anything to go by, the Washington circle is likely to continue to think every problem is a nail, and more hammers are needed.", "opengraph": {"type": "website", "title": "Covert Geopolitics", "description": "Beyond the Smoke & Mirrors", "url": "https://geopolitics.co/", "site_name": "Covert Geopolitics", "image": "https://geopolitics.co/wp-content/uploads/2019/11/cg-icon.png", "image:width": "400", "image:height": "400", "locale": "en_US"}, "tags": ["bioelectronics", "escalating ww3", "biodigital convergence", "EAEU", "ukraine resignations", "nato arms smuggling", "sco", "master of the world", "CBDC", "svb contagion", "Silicon Valley Bank", "ukraine corruption", "china mediation", "Sarah Beth Clendaniel", "chemical attack", "maidan coup", "russia vs nato", "dumping us tyranny", "west in ruins", "ukraine denazification", "bill ackman", "restoration of ties", "middle east pivot", "dystopian", "svb", "russia vs. us", "putin speech 2023", "svb collapse", "Atomwaffen", "pandemic fund swindle", "ukraine war", "victory of peace", "Saudi Arabia", "us banking collapse", "Volodymyr Zelensky", "historical nazi stronghold", "denazification of ukraine", "WEF", "us aid to ukraine", "truth suppression", "us military", "kiev arms trafficking", "2023", "manichean conflict", "underground cities", "bill gates", "indian nsa", "western narrative", "tool for hegemony", "putin", "iran military", "India", "munich conference", "us false flag in ukraine", "psychopaths", "klaus schwab", "ak doval", "netanyahu", "new financial system", "israeli pm", "Brandon Clint Russell", "counter hegemony", "canada aid to ukraine", "russia china alliance", "cryptocurrency", "saudi iran deal", "Sergey Glazyev", "g20 summit", "western civilization", "iran"], "tweets": [], "movies": [], "links": ["https://www.aljazeera.com/news/2023/3/11/changing-global-order-china-restores-ties-with-iran-and-saudi", "https://www.nytimes.com/2023/03/11/us/politics/saudi-arabia-iran-china-biden.html", "https://www.president.ir/EN/91435", "http://ir.china-embassy.gov.cn/eng/zyxw/202212/t20221210_10988406.htm", "https://www.theguardian.com/commentisfree/2022/oct/13/saudi-arabia-us-oil-prices-opec"], "authors": [], "publish_date": "March 20, 2023"}