{"result_id": "083043", "URL": "https://geopolitics.co/2021/06/22/philippine-prez-duterte-threatens-to-jail-antivaxxers-and-inject-vaccine-in-their-butts/", "timestamp": "2023-04-25 14:51:40 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://geopolitics.co/wp-content/uploads/2019/11/cg-icon-150x150.png", "canonical": "https://geopolitics.co/2021/06/22/philippine-prez-duterte-threatens-to-jail-antivaxxers-and-inject-vaccine-in-their-butts/", "encoding": "UTF-8"}, "image": null, "domain": "geopolitics.co", "title": "Philippine Prez Duterte Threatens to Jail Antivaxxers and ‘inject vaccine in their butts’", "cleaned_text": "Angered by the country’s low vaccination rate, Philippines President Rodrigo Duterte has said he may jail people who refuse to get the shot against coronavirus.\n\nDuterte vented his frustration over vaccine hesitancy during a cabinet meeting late on Monday night.\n\nThe president asked the government to identify those who refuse to get the shot. “I will order their arrest, to be honest,” he said. “Choose – get vaccinated or get imprisoned?”\n\nDuterte, who is known for using straightforward and crass language in public, was quoted by the Rappler news website as saying, “If you don’t want to get vaccinated, I’ll have you arrested [and] then I’ll inject a vaccine into your buttocks.”\n\nLow turnout forced the country’s capital, Manila, to scrap its ‘no walk-in’ vaccination policy on Monday. Rappler reported that authorities invited 28,000 people to vaccination sites via text message, but only 4,402 showed up. Mayor Isko Moreno said that the city will return to the original open-door method, where anyone can show up for a shot.\n\nHealth Undersecretary Maria Rosario Vergeire told reporters on Monday that regional and local officials were instructed to boost border control against the Delta variant, which was previously known as the Indian variant and is more transmissible than the original strain of the coronavirus.\n\nPhilippines health officials recorded 5,249 new cases and 128 deaths on Monday. Overall, more than 1.36 million have been infected with the coronavirus, and 23,749 have died.\n\nAs of Saturday, 2,210,134 Filipinos have been fully vaccinated, according to PNA. The population of the Philippines is close to 111 million, according to the UN.\n\nRussia Today is now a global, round-the-clock news network of eight TV channels, broadcasting news, current affairs, and documentaries, with digital platforms in six languages.\n\nIn the initial stages of the COVID19 plandemic, Duterte offered a PHP50 million reward to anybody who can create the first vaccine. This offer signals early on that he believes in his bones that only vaccination can prevent the further spread of the virus.\n\nVaccine hesitancy started when the Senate of the Philippines found out that Sanofi’s Dengvaxia vaccines were used to inoculate about 740,000 schoolchildren without the required clinical trial stage 3, and an informed consent from the parents’ victims.\n\nThe same senate investigations also revealed that those entities conducting the clinical trials for the Department of Health were actually in the payroll of Sanofi, whose vaccine is yet to be approved by the local FDA.\n\nThousands of children died in that Dengvaxia mass vaccination in the 2016 presidential campaign according to the Public Attorney Office’s own forensic investigations, but most households were silenced by the unofficial USD1000 out of court settlement taken from the Sanofi refund of PHP2.2 billion for the unused Dengvaxia vaccines, according to some independent sources in the media.\n\nThere were talks of missing organs from the children who died from brain hemorrhage and multi-organ enlargements leading to liver, pancreatic failures, all due to the effects of Dengvaxia post vaccination. Yet, until today, and even when Dengvaxia related deaths continue to be reported, the Department of Health can’t release the full account of how many deaths there were, nor the hospitals were willing to give out the names of children victimized by the untested Dengvaxia vaccines to the inquiring authorities in-charge of the case.\n\nAll in all, more than a million were vaccinated with the Dengvaxia vaccines, including adults outside of the program that resulted also to the death of a newly inducted doctor.\n\nToday, the same people in the health department are requiring the use of faceshields on top of the facemasks everywhere, and still want to vaccinate the population, only this time using the gene-editing mRNA pseudovaccines, and under a scientifically ignorant fascist president.\n\nYou can actually participate in the global efforts to cripple the Deep State organized criminal cabal's ability for genocide, while enjoying healthcare freedom at the same time, by boycotting Big Pharma for good.", "opengraph": {"type": "article", "title": "Philippine Prez Duterte Threatens to Jail Antivaxxers and ‘inject vaccine in their butts’", "url": "https://geopolitics.co/2021/06/22/philippine-prez-duterte-threatens-to-jail-antivaxxers-and-inject-vaccine-in-their-butts/", "description": "Angered by the country’s low vaccination rate, Philippines President Rodrigo Duterte has said he may jail people who refuse to get the shot against coronavirus.", "article:published_time": "2021-06-22T12:28:59+00:00", "article:modified_time": "2021-06-28T12:03:32+00:00", "site_name": "Covert Geopolitics", "image": "https://geopolitics.co/wp-content/uploads/2021/06/rp-covid19-vaccination.jpg", "image:width": "980", "image:height": "551", "locale": "en_US"}, "tags": ["covid19 vaccine", "covid-19 lockdown"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": null, "height": "0", "embed_code": "<iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" class=\"arve-iframe fitvidsignore\" data-arve=\"arve-youtube-_hfwrbf2_2y6447ccdc8d95f783217317\" data-src-no-ap=\"https://www.youtube-nocookie.com/embed/_HfWRBf2_2Y?feature=oembed&amp;iv_load_policy=3&amp;modestbranding=1&amp;rel=0&amp;autohide=1&amp;playsinline=0&amp;autoplay=0\" frameborder=\"0\" height=\"0\" sandbox=\"allow-scripts allow-same-origin allow-presentation allow-popups allow-popups-to-escape-sandbox\" scrolling=\"no\" src=\"https://www.youtube-nocookie.com/embed/_HfWRBf2_2Y?feature=oembed&amp;iv_load_policy=3&amp;modestbranding=1&amp;rel=0&amp;autohide=1&amp;playsinline=0&amp;autoplay=0\"/>", "src": "https://www.youtube-nocookie.com/embed/_HfWRBf2_2Y?feature=oembed&iv_load_policy=3&modestbranding=1&rel=0&autohide=1&playsinline=0&autoplay=0"}, {"embed_type": "iframe", "provider": "youtube", "width": null, "height": "0", "embed_code": "<iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" class=\"arve-iframe fitvidsignore\" data-arve=\"arve-youtube-nouthzb8b1a6447ccdc8e5ad951576036\" data-src-no-ap=\"https://www.youtube-nocookie.com/embed/NoUThZB8B1A?feature=oembed&amp;iv_load_policy=3&amp;modestbranding=1&amp;rel=0&amp;autohide=1&amp;playsinline=0&amp;autoplay=0\" frameborder=\"0\" height=\"0\" sandbox=\"allow-scripts allow-same-origin allow-presentation allow-popups allow-popups-to-escape-sandbox\" scrolling=\"no\" src=\"https://www.youtube-nocookie.com/embed/NoUThZB8B1A?feature=oembed&amp;iv_load_policy=3&amp;modestbranding=1&amp;rel=0&amp;autohide=1&amp;playsinline=0&amp;autoplay=0\"/>", "src": "https://www.youtube-nocookie.com/embed/NoUThZB8B1A?feature=oembed&iv_load_policy=3&modestbranding=1&rel=0&autohide=1&playsinline=0&autoplay=0"}], "links": ["https://www.youtube.com/watch?v=nm4nHe6tFpQ", "https://virutron.com/", "https://virutron.com/"], "authors": [], "publish_date": "2021-06-22T12:28:59+00:00"}