{"result_id": "083034", "URL": "https://geopolitics.co/category/bioweapons-germ-warfare/", "timestamp": "2023-04-25 14:51:33 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://geopolitics.co/wp-content/uploads/2019/11/cg-icon-150x150.png", "canonical": "https://geopolitics.co/category/bioweapons-germ-warfare/", "encoding": "UTF-8"}, "image": null, "domain": "geopolitics.co", "title": "Bioweapons / Germ Warfare – Covert Geopolitics", "cleaned_text": "The title of this January 2022 most important article is “Innate Immune Suppression by SARS-CoV-2 mRNA Vaccinations: The role of G-quadruplexes, exosomes and microRNAs.” It is written by very credentialed medical researchers. It presents an extremely detailed analysis that proves COVID vaccines are very unsafe.\n\nHere, I focus on the findings showing a relationship between the vaccines and cancers. Everything below is directly from the paper. It is difficult reading, but the messages are very important.\n\nThe mRNA SARS-CoV-2 vaccines were brought to market in response to the widely perceived public health crises of Covid-19. The utilization of mRNA vaccines in the context of infectious disease had no precedent, but desperate times seemed to call for desperate measures.\n\nThe mRNA vaccines utilize genetically modified mRNA encoding spike proteins. These alterations hide the mRNA from cellular defenses, promote a longer biological half-life for the proteins, and provoke higher overall spike protein production.\n\nHowever, both experimental and observational evidence reveals a very different immune response to the vaccines compared to the response to infection with SARS-CoV-2. As we will show, the genetic modifications introduced by the vaccine are likely the source of these differential responses.\n\nIn this paper, we present the evidence that vaccination, unlike natural infection, induces a profound impairment in type I interferon signaling, which has diverse adverse consequences to human health.\n\nWe explain the mechanism by which immune cells release into the circulation large quantities of exosomes containing spike protein along with critical microRNAs that induce a signaling response in recipient cells at distant sites.\n\nWe also identify potential profound disturbances in regulatory control of protein synthesis and cancer surveillance. These disturbances are shown to have a potentially direct causal link to neurodegenerative disease, myocarditis, immune thrombocytopenia, Bell’s palsy, liver disease, impaired adaptive immunity, increased tumorigenesis, and DNA damage.\n\nWe show evidence from adverse event reports in the VAERS database supporting our hypothesis.\n\nWe believe a comprehensive risk/benefit assessment of the mRNA vaccines excludes them as positive contributors to public health, even in the context of the Covid-19 pandemic. [emphasis added] Innate-Immune-Suppression-by-SARS-CoV-2-mRNA-Vaccinations\n\n\n\nCancer is a disease generally understood to take months or, more commonly, years to progress from an initial malignant transformation in a cell to development of a clinically recognized condition.\n\nSince VAERS reports of adverse events are happening primarily within the first month or even the first few days after vaccination [209], it seems likely that the acceleration of cancer progression following vaccines would be a difficult signal to recognize. Furthermore, most people do not expect cancer to be an adverse event that could be caused by a vaccine.\n\nHowever, as we have outlined in our paper, if the mRNA vaccinations are leading to widespread dysregulation of oncogene controls, cell cycle regulation, and apoptosis, then VAERS reports should reflect an increase in reports of cancer, relative to the other vaccines.\n\nThis is in fact what VAERS reports reflect, and dramatically so. Table 1 illustrates events involving the most common cancers reported to VAERS in the US, cancers either newly identified or stable disease newly progressing. It compares reports related to COVID-19 vaccination to reports related to all other vaccinations over the 31-year history of VAERS information collection. To obtain this table, we searched the online resource, for search terms indicating cancer, such as “cancer,” “carcinoma,” “mass,” “neoplasm,” etc., and summed over all hits related to a particular organ, such as “lung.” These data were collected on December 12, 2021.\n\nNotably, there were three times as many reports of breast cancer following a COVID-19 vaccine, and more than six times the number of reports of B-cell lymphoma. All but one of the cases of follicular lymphoma were associated with COVID-19 vaccines. Pancreatic carcinoma was more than three times as high.\n\nThis cannot be explained by reference to a disproportionately large number of people receiving an mRNA vaccination in the past year compared to all other vaccinations. The total number of people receiving a non-COVID-19 vaccination is unknown, but over the 31 years history of reports VAERS contains it is unquestionably many orders of magnitude larger than the number receiving an mRNA vaccination in the past year. Overall, in the above table, twice as many cancer reports to VAERS are related to a COVID-19 vaccination compared to those related to all other vaccines. That, in our opinion, constitutes a signal in urgent need of investigation.\n\nTable 1: Number of events in the VAERS database from 1990 to December 12, 2021, where several terms indicating cancer occurred in association with COVID-19 vaccines or with all other vaccines, along with the ratio between the two counts. Counts were restricted to data from the United States. Note that counts for all the other vaccines are totals for 31 years, whereas the COVID-19 counts are for a single class of vaccines over less than one year.\n\n[I cannot reproduce Table 1 here, but here is the bottom line finding:\n\nThere has been an unwavering message about the safety and efficacy of mRNA vaccinations against SARS-CoV-2 from the public health apparatus in the US and around the globe. The efficacy is increasingly in doubt, as shown in a recent letter to the Lancet Regional Health by Günter Kampf. Kampf provided data showing that the vaccinated are now as likely as the unvaccinated to spread disease. He concluded: “It appears to be grossly negligent to ignore the vaccinated population as a possible and relevant source of transmission when deciding about public health control measures.”\n\nIn this paper we call attention to three very important aspects of the safety profile of these vaccinations.\n\nFirst is the extensively documented subversion of innate immunity, primarily via suppression of IFN-α and its associated signaling cascade. This suppression will have a wide range of consequences, not the least of which include the reactivation of latent viral infections and the reduced ability to effectively combat future infections.\n\nSecond is the dysregulation of the system for both preventing and detecting genetically driven malignant transformation within cells and the consequent potential for vaccination to promote those transformations.\n\nThird, mRNA vaccination potentially disrupts intracellular communication carried out by exosomes, and induces cells taking up spike mRNA to produce high levels of spike-carrying exosomes, with potentially serious inflammatory consequences. Should any of these potentials be fully realized, the impact on billions of people around the world could be enormous and could contribute to both the short-term and long-term disease burden our health care system faces.\n\nGiven the current rapidly expanding awareness of the multiple roles of G4s in regulation of mRNA translation and clearance through stress granules, the increase in pG4s due to enrichment of GC content as a consequence of codon optimization has unknown but likely far-reaching consequences.\n\nSpecific analytical evaluation of the safety of these constructs in vaccines is urgently needed, including mass spectrometry for identification of cryptic expression and immunoprecipitation studies to evaluate the potential for disturbance of or interference with the essential activities of RNA and DNA binding proteins.\n\nIt is imperative that worldwide administration of the mRNA vaccinations be stopped immediately until further studies are conducted to determine the extent of the potential pathological consequences outlined in this paper.\n\nIt is not possible for these vaccinations to be considered part of a public health campaign without a detailed analysis of the human impact of the potential collateral damage. It is also imperative that VAERS and other monitoring system be optimized to detect signals related to the health consequences of mRNA vaccination we have outlined.\n\nWe believe the upgraded VAERS monitoring system described in the Harvard Pilgrim Health Care, Inc. study, but unfortunately not supported by the CDC, would be a valuable start in this regard.\n\nIn the end, we are not exaggerating to say that billions of lives are at stake. We call on the public health institutions to demonstrate, with evidence, why the issues discussed in this paper are not relevant to public health, or to acknowledge that they are and to act accordingly. Until our public health institutions do what is right in this regard, we encourage all individuals to make their own health care decisions with this information as a contributing factor in those decisions.\n\nThe original source of this article is Pandemic Blunder Newsletter Copyright © Joel S. Hirschhorn, Dr. Stephanie Seneff, Dr. Greg Nigh, Dr. Peter McCullough, and et al., Pandemic Blunder Newsletter, 2022", "opengraph": {"type": "website", "title": "Bioweapons / Germ Warfare – Covert Geopolitics", "url": "https://geopolitics.co/category/bioweapons-germ-warfare/", "site_name": "Covert Geopolitics", "image": "https://geopolitics.co/wp-content/uploads/2019/11/cg-icon.png", "image:width": "400", "image:height": "400", "locale": "en_US"}, "tags": ["bioelectronics", "ebola", "blackrock executive", "great reset", "india vaccination", "military covid19 deaths", "health professionals", "fauci", "pandemic", "freedom convoy", "CBDC", "false testimony", "hunter biden", "ukraine biolabs", "us bioweapons lab", "vaccine adjuvant", "fort detrick biolab", "royalty payment", "vaccine passport", "fauci's royalty", "ukraine false flag ops", "bioweapons program", "lockdowns", "global id", "recover from vaccine", "bat coronavirus", "covid19 coup", "anthony fauci", "edward dowd", "plague", "art of war", "canadian truckers", "economic collapse", "ukraine biolab", "us compensation claim", "us biolabs in ukraine", "immunosuppression", "russian genome", "eu deaths", "metabiota", "vaccine deaths", "covid19 bankruptcy", "janssen", "gain of function research", "pharma cover up", "nih bribery", "nanoblades", "Financial Crisis", "bill gates", "Hamish de Bretton-Gordon", "corporate tyranny", "pentagon bioresearch", "pentagon bioweapons lab", "Social Engineering", "mrna injections", "covid-19 lockdown", "military vaccination", "economic lockdown", "vaccine injuries", "graphene", "modi", "varying toxicity", "mass surveillance", "cryptocurrency", "Central Bank Digital Currency", "vaccines", "graphene oxide", "pfizer vaccines", "covid19 alert", "bioweapons lab in ukraine", "graphene in vaccines", "covid19 vaccine"], "tweets": [], "movies": [], "links": ["https://www.authorea.com/users/455597/articles/552937-innate-immune-suppression-by-sars-cov-2-mrna-vaccinations-the-role-of-g-quadruplexes-exosomes-and-micrornas?commit=d033a57415da0ca976b27f11d81a4cd604f7fdc7", "https://www.authorea.com/users/455597/articles/552937-innate-immune-suppression-by-sars-cov-2-mrna-vaccinations-the-role-of-g-quadruplexes-exosomes-and-micrornas?commit=d033a57415da0ca976b27f11d81a4cd604f7fdc7", "https://geopolitics.co/wp-content/uploads/2022/02/Innate-Immune-Suppression-by-SARS-CoV-2-mRNA-Vaccinations.pdf", "https://wonder.cdc.gov/vaers.html", "https://joelshirschhorn.substack.com/p/excerpts-from-a-new-most-important?r=9gl9v", "https://www.globalresearch.ca/author/et-al", "https://joelshirschhorn.substack.com/p/excerpts-from-a-new-most-important?r=9gl9v"], "authors": [], "publish_date": "March 19, 2023"}