{"result_id": "083030", "URL": "https://geopolitics.co/2021/10/13/elites-depopulation-agenda-is-now-irrefutable/", "timestamp": "2023-04-25 14:51:30 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://geopolitics.co/wp-content/uploads/2019/11/cg-icon-150x150.png", "canonical": "https://geopolitics.co/2021/10/13/elites-depopulation-agenda-is-now-irrefutable/", "encoding": "UTF-8"}, "image": null, "domain": "geopolitics.co", "title": "Elite’s Depopulation Agenda is Now Irrefutable", "cleaned_text": "By now – October 2021 – it’s more than evident that the Big Pharma-Great Reset globalist elite are currently committing human genocide, carrying out their eugenics depopulation agenda.\n\nIn spite of Big Media’s censorship blackout as complicit murderers causing misinformed, lied to hundreds of thousands of innocent victims to die from the killer vaccines already, in response scores of leading medical doctors, expert scientists and insider whistleblowers at great risk to themselves have been shouting from rooftops to sound the apocalyptic alarm.\n\nEarly on during the vaccine rollout, last February 2021 Dr. Sherry Tenpenny accurately predicted that by May through August, thousands of deaths from the vaccines will be falsely blamed on the fake variants. Outspoken Dr. Carrie Medej is now speaking out against the vaccine dangers through nanotechnology and the transhumanist elements of how AI through nanoparticles in vaccines are merging with genetically modified GMO former humans.\n\nVeteran medical vaccine whistleblower Dr. Joseph Mercola exposes the “medical reset” within Klaus Schwab’s NWO reset. Top international cardiologist, internist and epidemiologist Dr. Peter McCullough has been making big waves, in late August 2021 asserting that the vaccinated carry 251 times the viral load than the nonvaccinated. Dr. McCullough also promotes natural immunity and benign drugs HCQ and Ivermectin instead of the harmful vaccines, just declaring:\n\nWe’re in the middle of a major biological catastrophe.\n\nEven the mRNA and DNA vaccine technology inventor, Dr. Robert Malone, MD rails against the Covid-19 mRNA vaccines as bioethically irresponsible and highly dangerous:\n\nWe need to confront the data [and] not try to cover stuff up or hide risks.\n\nCanadian Dr. Charles Hoffe was horrified to learn that 62% of his mostly First Nations patients experienced permanent blood clot damage after receiving their vaccine.\n\nBelow is his interview, with Laura Lynn Tylor Thompson (also available on Rumble channel).\n\nThis week the treating physician of national presidents, Dr. Vladimir Zelenko stated in an interview:\n\nIf we follow the advice of some of the ‘global leaders,’ like Bill Gates said last year, ‘7 billion people need to be vaccinated,’ then the death rate will be over 2 billion people. So wake up! This is World War III.\n\nThe cited medical doctors above are but a handful of countless heroic physicians who’ve gone public raising their concerns and outrage.\n\nRenowned PhD scientists including virologists, immunologists and biochemists have also led the way, calling out the Covid-19 plandemic based on the Rockefeller Foundation’s 2010 Lockstep blueprint. Another Nobel prize winner for inventing the nefariously misused PCR test, Dr. Kary Mullis died on the eve of the fake pandemic Wuhan outbreak after repeatedly exposing Dr. Frankenstein Fauci.\n\nPatent and intellectual rights expert Dr. David Martin deconstructs the criminal etiology of the Covid-19 pandemic while ex-Pfizer VP chief scientist Dr. Michael Yeadon has repeatedly delivered his dire warnings:\n\nThe gene-based design makes your body manufacture virus spike protein, and we know, and we’ve known for years, that virus spike protein triggers blood clots. That’s a fundamental problem.\n\nListen to Dr. Michael Yeadon, former Vice President and Chief Science Officer of Pfizer, talking about the pandemic and the COVID vaccine. Watch the video below.\n\nAdditionally, a growing army of Big Pharma whistleblowers have also courageously shed light on this much needed truth of what humanity is perilously facing in the coming Dark Winter months when likely millions of democide victims the world over will be shockingly laid to rest from fatal blood clots, strokes, heart attacks, multiple organ failure, cancer – all directly linked and caused by the Big Pharma non-vaccines.\n\nIdaho board certified pathologist and diagnostics lab owner Dr. Ryan Cole has observed an unheard of 20 times increase in endometrial cancers since this year’s vaccine rollout, caused by an absence of two types of cells (helper T-cells and CD8 killer T-cells), both vital to a functioning immune system.\n\nThis notorious pharmaceutical killing machine includes the mRNA spike protein DNA altering injections produced by Pfizer and Moderna as well as the Johnson & Johnson, UK’s AstraZeneca and China’s Sinovac.\n\nFrom December 14, 2020 to September 10, 2021 the US government’s own VAERS (Vaccine Adverse Events Reporting System) tracking mechanism reported 14,925 vaccine deaths (though a whistleblower claimed over 45,000 within 3 days from only one of nine districts).\n\nBut estimates of less than 1% of adverse injuries and deaths actually do get reported to VAERS, so a far more accurate and realistic estimate would be to multiply the reported number of deaths by 100, or on the low side, minimally multiply by 10 to account for the truer death toll estimate, that would then range from nearly 150,000 deaths.\n\nCombine that with the EU numbers of 25,248 deaths reported over roughly the same time period till September 18, 2021, and the numbers jump to over a quarter million. Thus, it’s safe to assume that millions around the world have already died as a result of Big Pharma kill shots. And this is just the beginning.\n\nWith 81% of September’s supposed Covid-19 deaths in the United Kingdom among those determined to have already been vaccinated, the evidence of lethal harm caused by the non-vaccines is overwhelming. In related testimony, Ontario emergency room doctor Rochagné Kilian, who just resigned over the local draconian, anti-health Covid-19 protocols, stated recently that 80% of incoming ER patients she treated in the last month suffering from “mysterious issues were double vaxxed.” Running close behind the UK death toll is the 76% of September Covid-19 deaths reported in the US state of Vermont that also were fully vaccinated. By diabolical design, this burgeoning medical holocaust has rapidly become globalized death by injection on a massive, never before seen scale.\n\nNobel prize winner for discovering the HIV virus – Dr. Luc Montagnier, recently submitted a sworn affidavit to the International Criminal Court, concluding:\n\nThis [Covid-19] vaccine is the biggest risk to humanity and the biggest risk to genocide in the history of humanity.\n\nGovernments of the world, Big Pharma and Big Media are clearly guilty.\n\nJoachim Hagopian is a West Point graduate, former Army officer and author of “Don’t Let the Bastards Getcha Down,” exposing a faulty US military leadership system based on ticket punching up the seniority ladder, invariably weeding out the best and brightest, leaving mediocrity and order followers rising to the top as politician-bureaucrat generals designated to lose every modern US war by elite design. After the military, Joachim earned a master’s degree in Clinical Psychology and worked as a licensed therapist in the mental health field with abused youth and adolescents for more than a quarter century. In Los Angeles he found himself battling the largest county child protective services in the nation within America’s thoroughly broken and corrupt child welfare system.\n\nYou can actually participate in the global efforts to cripple the Deep State organized criminal cabal's ability for genocide, while enjoying healthcare freedom at the same time, by boycotting Big Pharma for good.", "opengraph": {"type": "article", "title": "Elite’s Depopulation Agenda is Now Irrefutable", "url": "https://geopolitics.co/2021/10/13/elites-depopulation-agenda-is-now-irrefutable/", "description": "By now – October 2021 – it’s more than evident that the Big Pharma-Great Reset globalist elite are currently committing human genocide, carrying out their eugenics depopulation agenda.", "article:published_time": "2021-10-13T02:59:41+00:00", "article:modified_time": "2021-10-24T08:00:31+00:00", "site_name": "Covert Geopolitics", "image": "https://geopolitics.co/wp-content/uploads/2021/06/self-spreading-vaccines-777x437-1.jpg", "image:width": "777", "image:height": "437", "locale": "en_US"}, "tags": ["vaccine injuries", "vaccine deaths", "depopulation agenda"], "tweets": [], "movies": [], "links": ["https://www.globalresearch.ca/no-basis-benign-explanation-rush-stampede-human-herd-covid-jabs/5742129", "https://www.bibliotecapleyades.net/sociopolitica2/sociopol_globalelite427.htm", "https://www.globalresearch.ca/new-york-times-predicts-massive-population-reduction-alternative-thinking-may-overcome-our-predicament/5746382", "https://forbiddenknowledgetv.net/dr-sherri-tenpenny-explains-how-the-depopulation-covid-vaccines-will-start-working-in-3-6-months/", "https://forbiddenknowledgetv.net/dr-carrie-madej-covid-shots-dna-and-transhumanism/", "https://www.globalresearch.ca/great-reset-accelerating-global-tyranny/5757273", "https://www.globalresearch.ca/video-dr-peter-mccullough-therapeutic-nihilism-untested-novel-therapies/5757885?utm_campaign=magnet&utm_source=article_page&utm_medium=related_articles", "https://www.globalresearch.ca/study-fully-vaccinated-healthcare-workers-carry-251-times-viral-load-pose-threat-unvaccinated-patients-co-workers/5753908", "https://www.lifesitenews.com/news/were-in-the-middle-of-a-major-biological-catastrophe-top-covid-doc-mccullough/", "https://stateofthenation.co/?p=85089", "https://www.rwmalonemd.com/mrna-vaccine-inventor", "https://vaccinefreedom.wordpress.com/2021/07/30/inventor-of-mrna-vaccine-warns-against-the-covid-shot/", "https://podcasts.google.com/feed/aHR0cHM6Ly9mZWVkcy5ibHVicnJ5LmNvbS9mZWVkcy9hbWVyaWNhbnRob3VnaHRsZWFkZXJzLnhtbA/episode/aHR0cDovL3d3dy5ibHVicnJ5LmNvbS9hbWVyaWNhbnRob3VnaHRsZWFkZXJzLzgwNjUxMjc3L2RyLXJvYmVydC1tYWxvbmUtbXJuYS12YWNjaW5lLWludmVudG9yLW9uLWxhdGVzdC1jb3ZpZC0xOS1kYXRhLWJvb3N0ZXItc2hvdHMtYW5kLXRoZS1zaGF0dGVyZWQtc2NpZW50aWZpYy1jb25zZW5zdXMtcGFydC0xLw?sa=X&ved=2ahUKEwissf3S5eryAhVSlJ4KHSvyAssQ8qgGegQIARAE", "https://citizenfreepress.com/column-1/dr-charles-hoffe-issues-vaccine-warning/", "https://www.bitchute.com/video/A6GbcUl6blpJ/", "https://rumble.com/vjuhch-canadian-doctor-62-of-patients-vaccinated-for-covid-have-permanent-heart-da.html", "https://www.bitchute.com/embed/ChQwQBggc8TL/", "https://www.bitchute.com/video/OcOAkV5ViOMT/", "https://www.bitchute.com/video/OcOAkV5ViOMT/", "https://www.globalresearch.ca/57-top-scientists-doctors-release-shocking-study-covid-vaccines-demand-immediate-stop-all-vaccinations/5746848", "http://themillenniumreport.com/2020/07/rockefeller-lockstep-2010-was-blueprint-for-2020-covid-19-pandemic/", "https://www.globalresearch.ca/kary-b-mullis-no-infection-illness-can-accurately-diagnosed-pcr/5757224?utm_campaign=magnet&utm_source=article_page&utm_medium=related_articles", "http://www.davidmartin.world/about/", "https://forbiddenknowledgetv.net/dr-david-martin-just-ended-covid-fauci-doj-politicians-in-one-interview/", "https://www.globalresearch.ca/video-final-warning-humanity-former-pfizer-chief-scientist-michael-yeadon/5756523", "https://stateofthenation.co/?p=78699", "https://www.bitchute.com/embed/8YLXDB9aHRFj/", "https://thenationalpulse.com/news/pfizer-whistleblower-emails-imply-aborted-baby-cells-in-vaccine/", "https://vaccinedeaths.com/2021-10-06-hospital-systems-purge-thousands-of-workers-to-engineer-health-care-collapse-dark-winter-die-off.html", "https://independentdocsid.com/RyanColeMD", "https://www.lifesitenews.com/news/idaho-doctor-reports-a-20-times-increase-of-cancer-in-vaccinated-patients/", "https://childrenshealthdefense.org/defender/vaers-cdc-covid-deaths-vaccine-injuries/", "https://rightsfreedoms.wordpress.com/2021/07/22/vaers-whistleblower-45000-dead-from-covid-19-vaccines-within-3-days-of-vaccination-sparks-lawsuit-against-federal-government/", "https://digital.ahrq.gov/sites/default/files/docs/publication/r18hs017045-lazarus-final-report-2011.pdf", "https://theexpose.uk/2021/10/07/81-percent-of-covid-19-deaths-in-september-were-people-who-had-been-vaccinated/", "https://www.lifesitenews.com/news/ontario-er-doctor-resigns-over-mandatory-vaccines-and-falsehoods/", "https://vermontdailychronicle.com/2021/09/30/76-of-september-covid-19-deaths-are-vaxxed-breakthroughs/", "https://theexpose.uk/2021/09/26/holocaust-survivors-dr-fleming-prof-motagnier-icc-genocide-crimes-against-humanity/", "http://www.redredsea.net/westpointhagopian/indexpage.html", "https://virutron.com/", "https://virutron.com/"], "authors": [], "publish_date": "2021-10-13T02:59:41+00:00"}