{"result_id": "083011", "URL": "https://geopolitics.co/2022/01/19/graphene-covid-kill-shots-let-the-evidence-speak-for-itself/", "timestamp": "2023-04-25 14:51:15 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://geopolitics.co/wp-content/uploads/2019/11/cg-icon-150x150.png", "canonical": "https://geopolitics.co/2022/01/19/graphene-covid-kill-shots-let-the-evidence-speak-for-itself/", "encoding": "UTF-8"}, "image": null, "domain": "geopolitics.co", "title": "Graphene COVID Kill Shots: Let the Evidence Speak for Itself", "cleaned_text": "Graphene Oxide, Graphene Hydroxide and other Graphene variants are in fact being injected into people by governments and Big Pharma.\n\nThis evidence was discovered and proven numerous times already by independent research teams, scientists, Biotech whistleblowers and the few ethical Journalists remaining.\n\nThere’s a concerted effort by the pharmaceutical cartel funded “fact checkers,” Big Tech platforms and mainstream media, to hide the evidence and slander the people bringing this to light.\n\nOnce you go over the evidence provided here, you must take action for the safety of you and your families.\n\nServe all war criminals participating in this COVID death jab program with a Notice of Liability for the murders they are committing.\n\nThis is definitive action that any person can take, worldwide.\n\nThe notices are already drafted by legal teams so why not use them and let our enemies be on the defensive. The criminals will be reminded of the Nuremberg trials, and informed that they will be brought to justice. They need to cease and desist from acting knowingly and willfully in mandating “vaccine” death jabs and enforcing them. The evidence to the danger is clear and deaths have been proven. Anyone administering or mandating these “vaccine” kill shots are doing so without Informed Consent.\n\nOn November 2nd, a prominent Professor at the University of Almeria, Dr. Pablo Campra, revealed his detection of Graphene in multiple Covid-19 “vaccine” vials, using Micro-Raman Spectroscopy. The Dr. Campra’s University of Almeria report demonstrated the detection of Graphene and Graphene Oxide in 8 samples from various “vaccine” manufacturers.\n\nIn response, Dr. Andreas Noack released a scathing video commenting on Dr. Campra’s report. Dr. Noack is a chemist and the world’s leading expert in activated carbon engineering and GRAPHENE. Dr. Noack did his PhD doctoral thesis on how to turn Graphene Oxide into Graphene Hydroxide.\n\nThe video is of crucial importance. Dr. Noack said that two of the frequency bands that Dr. Campra detected were of Graphene Hydroxide. Graphene Hydroxide (GHO) is a mono-layer activated carbon, 50nm long and 0.1nm thick (an atom layer thick). Thus, the injections contain nano-razorblades of exceptional stability, which are non-biodegrable (a fact that every chemist knows).\n\nIn effect, these nano-razorblades cut up and destroy the heart, brain and cardiovascular system. The epithelial cells become rough so things stick to them. He says that toxicologists cannot find them in a petri dish by normal methods as they do not move and they don’t expect to discover nano-sized razor blades. Moreover, any doctor who injects them with knowledge of this issue, is a murderer.\n\nGraphene Hydroxide is a new material and toxicologists aren’t aware of it yet. This is why people are dropping dead from these lethal shots, especially athletes, Dr. Noack explains. This is a “highly intelligent poison”.\n\nWhat’s even more horrifying is that if you perform an autopsy you will not find anything. This stealth weapon is even untraceable after death. The Graphene Hydroxide nano-razerblades cause people to bleed to death internally.\n\n“Even if people don’t drop dead immediately, it cuts up the blood vessels little by little… I can say as a chemist that we are absolutely certain that the Graphene Hydroxide is in there… as a chemist, if you inject this into the blood, you know you are a murderer.”\n\nDr. Noack was killed just days after blowing the whistle and releasing this video.\n\nHis wife made an announcement that it was a brutal sneak attack.\n\nShe pleads with us to have the courage to BELIEVE and to ACT NOW to expose this! She said her husband is a kind soul and he did this for us, he died for all of us.\n\nThere are some rumors being spread to distract and confuse you regarding his suspected murder and the mainstream media is ever silent but here is some additional evidence that he was killed. Dr. Noack’s wife just released an update saying she believes he was attacked by a radiation beam.\n\nSend out this video and my article to all doctors, experts and world leaders now.\n\nGovernments are already injecting 5-year-olds with Pharma’s kill shots containing Graphene Hydroxide razors. This technology will cut up their insides and delivery a gruesome, painful death to our kids!\n\nLast year the Austrian police busted down Dr. Noack’s door and arrested him in an attempt to stop him from speaking out. The incident was recorded on camera. He was clearly a target.\n\nDr Pablo Campra was the first to deduce that the Pfizer serum contains Graphene Oxide flakes using Transmission Electron Microscopy in July, 2021. His techniques of detection also included infrared spectroscopy combined with optical microscopy.\n\nPrior to Dr. Campra’s discovery, another Spanish research team named La Quinta Columna, released their discovery in June, that the COVID serums in all their variants, AstraZeneca, Pfizer, Moderna, Sinovac, Janssen, Johnson & Johnson, etc., contain a considerable dose of Graphene Oxide Nanoparticles, reported by Global Research.\n\nDr. Ricardo Delgado a biostatistician and founder of La Quinta Columna, discovered that 99% of the Pfizer contents are Graphene Oxide. His team was smeared by fact checkers who provided no evidence of their libelous claims.\n\nIn my article entitled, “Graphene Oxide The Vector For Covid-19 Democide,” I explain the chemical process involved in reducing Graphene Oxide to a clear liquid serum by reducing its oxygen content. By doing so, Reduced Graphene Oxide (RGO) is more lethal. So yes, it’s scientifically possible that COVID serums can be 99% Graphene Oxide.\n\nDr. Delgado’s team released a scientific report of their optical and electron microscopy analysis showing Graphene Oxide was found in four “Covid-19 Vaccines”. Orwell City broke the news in English. Then La Quinta Columna requested an Interim Report from the University of Almeria entitled, “DETECTION OF GRAPHENE IN AQUEOUS SUSPENSION SAMPLE”.\n\nLa Quinta Columna’s report was originally published in Spanish on June 28, 2021.\n\n“The problem is that this is not a vaccine, this is a dose of graphene to a person.”– Dr. Ricardo Delgado\n\nWhitney Webb attempted a smear piece on La Quinta Columna and the University of Almeria’s discovery, where she directly attacked Dr. Ricardo Delgado’s credibility without anything substantial. Investigative Journalist Ramola D. and myself debunked Whitney’s Webb of lies.\n\nOn August 19, another research team going by the name “The Scientist Club” found Graphene in 7 prominent Biotech serums using Optical Microscope, Dark-Field Microscope, UV absorbance and fluorescence spectroscope, Scanning Electron Microscopes, Transmission Electron Microscope, Energy Dispersive Spectroscope, X-ray Diffractometer, and Nuclear Magnetic Resonance instruments to verify the serums morphologies and contents. For the high-technology measurements and the care of the investigation, all the controls were activated and reference measurements adopted in order to obtain validated results.\n\nFor obvious reasons, The Scientist Club kept their identity secret. They analyzed Pfizer, Moderna, Janssen and AstraZeneca and found a Carbon-based substrate with nanoparticles embedded, Graphene sheets and Graphene Oxide.\n\nUndeclared metal-containing components were found by scientists in Japan, which caused the Japanese Government to halt the use of Moderna’s serums. The Japanese Ministry reported that the particles found reacted to magnets and was therefore suspected to be a metal contaminant. Graphene, Graphene Oxide (GO) and Reduced Graphene Oxide (RDO) all have paramagnetic properties.\n\nA September, a German team revealed damning evidence of “vaccine” contaminants and autopsies linking “vaccines” to deaths.\n\nDr. T. made a call out to all medical professionals in this urgent announcement asking medical professionals to report magnetic phenomenon because she believes that Graphene Oxide flakes are responsible for the “vaccine”-induced magnetism that we have witnessed internationally. Dr. Andrew Goldsworthy (retired) of Imperial College London has explained the possible mechanism here.\n\nPfizer Whistleblower Karen Kingston revealed in August, how Graphene Oxide was hidden under a trade secret and that’s why it wasn’t listed in the patents. However Kingston explains, it is in fact the key ingredient in the Covid-19 serums.\n\nAnother Chief Scientist for Pfizer blew the whistle in November, leaking internal emails on Stew Peter’s Show from top Pfizer executives and scientists discussing how they were going to hide from the public that Graphene Oxide is in their serums.\n\nIn April 2021, Health Canada recalled a million and a half KN95 face masks containing Graphene. Children had been forced to wear these masks in Canadian schools. Health Canada compared wearing them to breathing in asbestos all day long. These poisonous masks came from China’s Shandong Shengquan New Materials Co. Ltd.\n\nDr. Robert Young used Scanning & Transmission Electron Microscopy which revealed Graphene Oxide in four Covid-19 trade marked serums, September 11, 2021.\n\nDr. Franc Zalewski also found Graphene Oxide in the Pfizer serum.\n\nDr. Antonietta Gatti did a recent video interview on the toxicity of Graphene Oxide Nanometallic particulates to cells. She has found them in the “vaccines”, PCR kits and face masks.\n\nIn her groundbreaking 2017 report with Dr. Stefano Montanari, Dr. Antoinetta Gatti explains Nanoparticles inside cells destroy the innate defense mechanism of cells and cause blood clots, deadly inflammation, thrombi, and multi-organ failure posed by nanometallic particulates, which are non-biodegradable and indeed biopersistent. They can both enter cells, harm DNA, and be carried by the blood to bind with organic matter and coagulate in organs.\n\nA Slovakian team analyzed PCR kit nasal swabs using SD Biosensor, Abbott and Nadal in a hospital laboratory from Bratislava. The team found that when DARPA’s Graphene Oxide Hydrogels come in contact with organic fluid (e.g., saliva) within a few minutes they begin to form rectangular crystal structures. These gradually grow in a fractal manner. A German research team also filmed the crystalline growth of the GO Hydrogels.\n\nSeveral scientific papers show that Graphene Oxide is being used in gene therapy as a scaffold or platform for the delivery of mRNA into cells by way of its high electrical conductivity and ability to permeate cell membranes. The crystalline networks form in bodily fluid and replicate after injection and in the serum itself, as shown in this video of the Pfizer serum. It sure does look like nano high frequency antennas.\n\nScientists have developed a novel way of making carbon nanotubes at the NanoScience Center of the University of Jyväskylä, Finland, and at Harvard University, in the US.\n\nGraphene was part of the first human genome project initiated in 2001. mRNA gene therapy Nanotech using Graphene Oxide as a vector, runs on CRISPR technology and it was developed by Pfizer,Moderna, and BioNTech, as a treatment for sick cancer patients. Due to its cytotoxicity (cell death) in healthy cells and the fact that all the animals died in the animal trials, Graphene Oxide Nanotechnology was never approved for use on Humans! Why is this technology now being used on healthy people and on children, who are at no risk of COVID?\n\nIt should be quite clear to everyone by now that the pharmaceutical cartel is using this technology worldwide, in illegal Human trials and trying to mandate their poisonous “vaccines” on everyone, with impunity.\n\nScientists have already studied the Nose-to-Brain Translocation and Cerebral Biodegradation by intra-nasal spray, using thin Graphene Oxide Nanosheets. Make no mistake about it, nasal spray “vaccines” contain Graphene Oxide Nanoparticles.\n\nIf you’re still not convinced, here’s a main stream media article trying to pitch Graphene Oxide “flu vaccine” nasal spray as some kind of protective intervention.\n\nDr. Chunhong Dong is lead author of a study from the Institute for Biomedical Sciences in China where he boasts,\n\n“This study gives new insights into developing high performance intranasal vaccine systems with two-dimensional sheet-like nanoparticles.”\n\nGraphene Oxide has been carefully engineered as a “vaccine adjuvant for immunotherapy” and Polyethylene glycol (PEG), another highly toxic poison, is used as coating polymers. PEGs are widely used as additives in pharmaceuticals, cosmetics, and food. But PEGs come with potential life-threatening hypersensitivity reactions including anaphylaxis.\n\nThis is not a big name brand but they do mention “Carbon graphene loaded nano particles and micro-particles” in their Sars-Cov2 patent invention.\n\nHere’s a list of peer reviewed medical studies on Graphene Oxide Toxicity and how it coagulates the blood. How much more evidence do you need to BELIEVE?\n\nDr. Armin Koroknay, Research director of Private Consultants and Research Institute of Zürich, analyzed the effects of COVID “Vaccination” on Blood.\n\nDr. Bärbel Ghitalla and her team put different brands under a microscope and found things they could not explain, but are explained in the “Covid-19 vaccine” patents.\n\nYou can actually participate in the global efforts to cripple the Deep State organized criminal cabal's ability for genocide, while enjoying healthcare freedom at the same time, by boycotting Big Pharma for good.", "opengraph": {"type": "article", "title": "Graphene COVID Kill Shots: Let the Evidence Speak for Itself", "url": "https://geopolitics.co/2022/01/19/graphene-covid-kill-shots-let-the-evidence-speak-for-itself/", "description": "Graphene Oxide, Graphene Hydroxide and other Graphene variants are in fact being injected into people by governments and Big Pharma.", "article:published_time": "2022-01-19T13:29:34+00:00", "article:modified_time": "2022-02-03T01:30:03+00:00", "site_name": "Covert Geopolitics", "image": "https://geopolitics.co/wp-content/uploads/2021/03/pfizer-mrna-deaths.jpg", "image:width": "1280", "image:height": "720", "locale": "en_US"}, "tags": ["graphene", "nanoblades", "graphene oxide", "vaccine adjuvant", "graphene in vaccines"], "tweets": [], "movies": [], "links": ["https://worldfreedomalliance.org/documents/", "https://www.notonthebeeb.co.uk/post/breaking-dr-campra-proves-graphene-in-vaccine", "https://www.thecompleteguidetohealth.com/uploads/8/9/4/8/8948721/official_interim_report_in_english__university_of_almeria_.pdf", "https://www.bitchute.com/video/D8IbIcmkzLD3/", "https://www.bitchute.com/video/Ui9oExkyOu1V/", "https://www.bitchute.com/video/yXQD32qqCtR3/", "https://www.notonthebeeb.co.uk/post/englis-translation-of-the-graphene-oxide-almeria-paper", "https://www.globalresearch.ca/urgent-announcement-covid-19-caused-graphene-oxide-introduced-several-ways/5749441", "https://www.bitchute.com/video/TAjRAB1ZiTVv", "https://ambassadorlove.wordpress.com/2021/07/28/graphene-oxide-the-vector-for-covid-19-democide/", "https://www.thecompleteguidetohealth.com/uploads/8/9/4/8/8948721/official_interim_report_in_english__university_of_almeria_.pdf", "https://www.bitchute.com/video/TAjRAB1ZiTVv/", "https://www.orwell.city/2021/06/graphene-oxide-in-vaccination-vials.html", "https://www.docdroid.net/Ov1M99x/official-interim-report-in-english-university-of-almeria-pdf", "http://\"https//www.docdroid.net/rNgtxyh/microscopia-de-vial-corminaty-dr-campra-firma-e-1-fusionado-pdf", "https://www.bitchute.com/video/ISfKasESfG9w/", "https://www.notonthebeeb.co.uk/post/what-is-really-in-the-c19-vaccines", "https://www.redvoicemedia.com/2021/08/covid-vaccine-recall1-6-million-doses-due-to-magnetic-substance-found-in-moderna-vials/", "https://www.notonthebeeb.co.uk/post/german-pr", "https://www.notonthebeeb.co.uk/help", "https://www.notonthebeeb.co.uk/post/dr-andrew-goldsworthy", "https://ambassadorlove.wordpress.com/2021/08/09/confirmed-graphene-oxide-main-ingredient-in-covid-shots/", "https://www.redvoicemedia.com/2021/11/pfizer-emails-confirm-graphene-intentional-cover-up-by-chief-scientist-revealed/", "https://healthycanadians.gc.ca/recall-alert-rappel-avis/hc-sc/2021/75391r-eng.php", "https://www.drrobertyoung.com/post/transmission-electron-microscopy-reveals-graphene-oxide-in-cov-19-vaccines", "https://everydayconcerned.net/2021/10/11/more-sickening-covid-vaccine-findings-dr-franc-zalewski-finds-aluminium-lifeform-tentacled-parasite-in-pfizer-vaccine-vaccine-parasites-found-in-vaccinated-blood-causing-blood-clots-heart-iss/", "https://www.youtube.com/watch?v=DgoQp3bVdAc", "https://www.jewworldorder.org/new-micrographs-reveal-graphene-oxide-and-parasites-in-the-pfizer-biontech-covid-vaccine/", "https://www.nutritruth.org/single-post/analysis-of-test-sticks-from-surface-testing-in-the-slovak-republic-confirmation-of-genocide", "https://everydayconcerned.net/2021/08/15/self-assembling-graphene-oxide-nanotech-now-found-also-in-pfizer-vaccine-german-video-reveals-self-assembling-specks-and-crystalline-networks-forming/", "https://www.youtube.com/watch?v=s8e06KfDWMM", "http://www.zmescience.com/research/studies/novel-way-making-carbon-nanotubes-nanomaterials-041934/", "https://www.graphene-info.com/graphene-dna-sequencing", "https://www.graphene-info.com/graphene-dna-sequencing", "https://ambassadorlove.wordpress.com/2021/11/14/epigenetics-vaccines-are-deleting-human-genes-transfecting-cells-with-ebola-marburg/", "https://nanografi.com/", "https://www.sciencedirect.com/science/article/pii/S2666386420301879", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4936781/", "https://www.walesonline.co.uk/news/uk-news/simple-nasal-flu-spray-being-20517707", "https://www.graphene-info.com/graphene-oxide-gives-boost-new-intranasal-flu-vaccine", "https://pubs.rsc.org/en/content/articlelanding/2016/nr/c5nr09208f", "https://aacijournal.biomedcentral.com/articles/10.1186/s13223-016-0172-7", "https://patents.google.com/patent/WO2021199078A2/en", "https://jdfor2024.com/wp-content/uploads/2021/07/AppendixGrapheneOxide.pdf", "https://ambassadorlove.wordpress.com/2021/12/02/graphene-covid-kill-shots-let-the-evidence-speak-for-itself/", "https://ambassadorlove.wordpress.com/2021/12/02/graphene-covid-kill-shots-let-the-evidence-speak-for-itself/", "https://virutron.com/", "https://virutron.com/"], "authors": [], "publish_date": "2022-01-19T13:29:34+00:00"}