{"result_id": "083013", "URL": "https://geopolitics.co/2021/01/20/the-mrna-covid-vaccine-is-not-a-vaccine/", "timestamp": "2023-04-25 14:51:17 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://geopolitics.co/wp-content/uploads/2019/11/cg-icon-150x150.png", "canonical": "https://geopolitics.co/2021/01/20/the-mrna-covid-vaccine-is-not-a-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "geopolitics.co", "title": "The mRNA COVID Vaccine is Not a Vaccine", "cleaned_text": "It’s NOT a vaccine. The mRNA COVID vaccine now being militarily deployed in many nations around the world, is NOT a vaccine. I repeat: it is not a vaccine. It is many things indeed, but a vaccine is not one of them.\n\nWe have to awaken to the fact that the COVID scamdemic has rapidly accelerated the technocratic and transhumanistic aspects of the New World Order (NWO) to the point where people are blindly lining up to get injected with a “treatment” which is also a chemical device, an operating system, a synthetic pathogen and chemical pathogen production device.\n\nAs covered in previous articles, this new COVID vax is a completely new kind of technology, potentially even more dangerous than your average toxic vaccine. In this article, we will explore in more depth what this mRNA vaccine is.\n\nDoctors David Martin and Judy Mikovits Expose How So-Called COVID Vaccine is Not a Vaccine\n\nListen to this short excerpt featuring doctors David Martin and Judy Mikovits (who have both been very outspoken thus far in exposing the COVID plandemic) who are speaking with Robert Kennedy Jr. and lawyer Rocco Galati, who is representing a Canadian freedom group suing the government for the entire COVID scam.\n\nDavid Martin makes some extremely important points about how we can’t accurately label the device Moderna and Pfizer are pushing as a vaccine, because both medically and legally, is not a vaccine:\n\n“This is not a vaccine … using the term vaccine to sneak this thing under public health exemptions … This is a mRNA packaged in a fat envelope that is delivered to a cell. It is a medical device designed to stimulate the human cell into becoming a pathogen creator. It is not a vaccine! Vaccines actually are a legally defined term … under public health law … under CDC and FDA standards, and a vaccine specifically has to stimulate both an immunity within the person receiving it, but it also has to disrupt transmission … They have been abundantly clear in saying that the mRNA strand that is going into the cell is not to stop transmission. It is a treatment. But if it was discussed as a treatment, it would not get the sympathetic ear of public health authorities, because then people would say “What other treatments are there?” The use of the term vaccine is unconscionable … because it actually is the sucker punch to open and free discourse … Moderna was started as a chemotherapy company for cancer, not a vaccine manufacturer for SARS … if we said we’re going to give people prophylactic chemo for the cancer they don’t have, you’d be laughed out of a room, because it’s a stupid idea. That’s exactly what this is! This is a mechanical device, in the form of a very small packet of technology, that is being inserted into the human system to activate the cell to become a pathogen manufacturing site. The only reason why the term [vaccine] is being used is to abuse the 1905 Jacobsen case that has been misrepresented since it was written. If we were honest with this, we would actually call it what it is: it is a chemical pathogen device, that is actually meant to unleash a chemical pathogen production action within the cell. It is a medical device, not a drug, because it meets the CDRH [Center for Devices and Radiological Health] definition of a device. It is made to make you sick … 80% of the people who are exposed to allegedly the virus [SARS-Cov-2] have no symptoms at all … 80% of people who get this injected into them have a clinical adverse event. You are getting injected with a chemical substance to induce illness, not to induce a[n] immuno-transmissive response. In other words, nothing about this is going to stop you transmitting anything. This is about getting you sick, and having your own cells be the thing that get you sick.”\n\nJudy Mikovits also chips in with this:\n\nCOVID Vaccine is an Operating System, Says Moderna\n\nThe COVID mRNA Vaccine is an operating system which can program your DNA, and therefore program you, at your core essential blueprint level. Is this an exaggeration?\n\nNo it’s not. Moderna states on their website that their mRNA technology platform is a “software of life” and “functions very much like an operating system on a computer.” This is straight from their website:\n\nThe Game Plan: Making Every Human into a Digital Node on the Control Grid\n\nWe are fast moving into the world of transhumanism, where our natural biological bodies are hijacked and infiltrated with synthetic parts, starting at the nanoparticle level.\n\nThe NWO controllers want to download some kind of Microsoft office system or software into your body and brain, and hook you up to the JEDI and/or Amazon-CIA cloud, so they can have direct access to your brain.\n\nThen, they can roll out “vaccines” which are not vaccines to continually update you, just like computer software gets regular updates. Viruses, real or not, and vaccines, real or not, are just means to achieve this goal.\n\nAlison McDowell sums up the current transhumanistic NWO path of highest probability below, which involves social credit, 5G, the Smart Grid and AI to induce planetary-wide compliance:\n\n“Within the tech-no-logic system, total compliance will be demanded. Approved behavior becomes currency, tokenized on blockchain and monitored by sensors and AI. They are training us for a future where we compete with one another to see who is the best behaved, the most docile. Surviving will mean conforming to the strident terms of psychopathic financial agreements. To obtain the data needed to verify claims embedded in twisted “pay for success” deals, our mother, the earth, must be remade as a geo-fenced digital prison using 5G and satellite constellations. All of your data will be added to your “permanent record” to evaluate your value as human capital for investor portfolios. The billionaires envision a future where freedom is a privilege limited to themselves, their functionaries, and the robots they control. Be assured AI is already keeping tabs, and social credit scoring is well underway.”\n\nIt is a grim future, however it is not set in stone. I agree wholeheartedly with McDowell that we do NOT have to accept this as our fate or experience such a painful timeline IF we can wake up quickly and change.\n\nHowever, we must first accept this is the probable path we are on. Like it or not, this is the current trajectory. How do we change it? Firstly by looking within. To change ourselves, we must change our inner world and change our perception, and so therefore change our reality:\n\nThis is not airy-fairy talk, but rather a realization that we are participating in co-creating a nightmare world by allowing our perception to be programmed to bring about the NWO. They are using our energy to do it!\n\nTo reclaim our sovereignty, we must reclaim our perception by breaking down the programming that was inserted into us.\n\nIt is vital to know, and to tell others, that the current mRNA COVID vaccine is not a vaccine.\n\nThis is not just because calling it a vaccine gives Big Pharma legal immunity from damages, but also for all the reasons listed above. These devices are designed to reprogram you at the fundamental level.\n\nThey are not vaccines, they are not drugs, and in my opinion, they are not treatments or medicine.\n\nAs scary as these terms are, I would go beyond just calling them chemical devices, operating systems, synthetic pathogens and chemical pathogen production devices, which are already illuminating terms and horrible enough.\n\nI would call them technocratic, transhumanistic tools to permanently change your genetics and transform you into a synthetic human.\n\nThey are symbolic of just how swiftly the NWO agenda is being made manifest in our physical reality, and hopefully a wake-up call to everyone to strive harder to stop this dark, nefarious agenda while there is still time.\n\nMakia Freeman is the editor of alternative media / independent news site The Freedom Articles, author of the book Cancer: The Lies, the Truth and the Solutions and senior researcher at ToolsForFreedom.com. Makia is on Steemit and Parler.\n\nYou can actually participate in the global efforts to cripple the Deep State organized criminal cabal's ability for genocide, while enjoying healthcare freedom at the same time, by boycotting Big Pharma for good.", "opengraph": {"type": "article", "title": "The mRNA COVID Vaccine is Not a Vaccine", "url": "https://geopolitics.co/2021/01/20/the-mrna-covid-vaccine-is-not-a-vaccine/", "description": "It’s NOT a vaccine. The mRNA COVID vaccine now being militarily deployed in many nations around the world, is NOT a vaccine. I repeat: it is not a vaccine. It is many things indeed, but a vaccine i…", "article:published_time": "2021-01-19T22:24:31+00:00", "article:modified_time": "2021-01-28T02:13:03+00:00", "site_name": "Covert Geopolitics", "image": "https://geopolitics.co/wp-content/uploads/2021/01/moderna-vaccine.jpg", "image:width": "800", "image:height": "534", "locale": "en_US"}, "tags": ["bill gates", "gene-editing", "mrna vaccine", "moderna vaccine"], "tweets": [], "movies": [], "links": ["https://thefreedomarticles.com/10-things-to-know-experimental-covid-vaccines/", "https://www.bitchute.com/video/6LYagqLH5SGa/", "https://geopolitics.co/wp-content/uploads/2021/01/Screenshot_2021-01-20-mRNA-Platform-Enabling-Drug-Discovery-Development.png", "https://www.modernatx.com/mrna-technology/mrna-platform-enabling-drug-discovery-development", "https://thefreedomarticles.com/", "https://www.amazon.com/dp/B08FBQQQ8X/", "http://toolsforfreedom.com/", "https://steemit.com/@makiafreeman", "https://parler.com/profile/makiafreeman/posts", "https://thefreedomarticles.com/10-things-to-know-experimental-covid-vaccines/", "https://www.modernatx.com/mrna-technology/mrna-platform-enabling-drug-discovery-development", "http://www.aevamagazine.co.uk/timpsila-strong-medicine-for-a-tech-no-logic-age—alison-mcdowell.html", "https://virutron.com/", "https://virutron.com/"], "authors": [], "publish_date": "2021-01-19T22:24:31+00:00"}