{"result_id": "083014", "URL": "https://geopolitics.co/2021/09/22/fda-allows-whistleblower-testimony-that-covid-19-vaccines-are-killing-and-harming-people/", "timestamp": "2023-04-25 14:51:18 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://geopolitics.co/wp-content/uploads/2019/11/cg-icon-150x150.png", "canonical": "https://geopolitics.co/2021/09/22/fda-allows-whistleblower-testimony-that-covid-19-vaccines-are-killing-and-harming-people/", "encoding": "UTF-8"}, "image": null, "domain": "geopolitics.co", "title": "FDA Allows Whistleblower Testimony that COVID-19 Vaccines are Killing and Harming People!", "cleaned_text": "The FDA held a Vaccine Advisory Committee meeting yesterday (September 17, 2021) to discuss authorizing a third Pfizer COVID-19 “booster shot.”\n\nThere were signs heading into the meeting this week that there could be some fireworks at this hearing, as two top vaccine research scientists at the FDA, Dr. Marion Gruber and Dr. Phillip Kause, the Director and Deputy Director of the Office of Vaccines Research, recently resigned.\n\nThis followed a report published in The Lancet from 18 officials at the FDA opposing the Biden Administration’s plan to start distributing Pfizer “booster shots” later this month (September, 2021) before the FDA had even approved them.\n\nTo say that there were fireworks at the Vaccine Advisory Committee meeting yesterday might be a gross understatement. The 18 member committee voted 16 to 2 AGAINST approving the booster shots, although later they did give their endorsement on approving them for people 65 and older.\n\nDuring the “open session” part of the meeting, dissenting doctors questioning the Pfizer shots were given a chance to address the public with their concerns, and they presented to the public REAL data about the shots that up until now has been heavily censored.\n\nDr. Joseph Fraiman, an emergency room physician from New Orleans who did his studies at Cornell Medical School, stated that there are no trials large enough yet to prove that the COVID-19 vaccines reduce hospitalization without causing serious harm.\n\nHe lamented the fact that the “vaccine hesitant” coming into his emergency room were more educated on the risks of the COVID-19 vaccine than those vaccinated.\n\nI know many think that vaccine hesitants are dumb, or just misinformed. That’s not at all what I’ve seen. In fact typically, independent of education level, the vaccine hesitant I’ve met in the ER are more familiar with vaccine studies, and more aware of their own COVID risks than the vaccinated. For example, many of my nurses have refused the vaccine despite seeing COVID-19 cause more death and devastation than most people have. I ask them why refuse the vaccine? They tell me while they’ve seen the first hand dangers of COVID, the elderly, the obese, diabetics; they think their risk is low. They’re not wrong. A 30-year-old female has about a 1 in 7000 chance of catching COVID and being hospitalized over it. He pointed out that a recent study showed that the risk of vaccine-induced Myocarditis (heart disease) in young males is higher than their risk from hospitalization from COVID.\n\nHe called for larger studies to be conducted.\n\nSteve Kirsch, the Executive Director of the COVID-19 Early Treatment Fund, also gave testimony, and he began his comments with:\n\nI am going to focus my remarks today with the elephant in the room that nobody likes to talk about, that the vaccines kill more people than they save. He presented data to prove that the belief that these vaccines are “safe” simply isn’t true. He gives several facts to show this, most all of which we have previously covered here at Health Impact News. For example, people have 71 times more risk of heart attack following COVID-19 vaccines than any other vaccine. Kirsch claims that expert analysis of existing data, including the 6-month Pfizer trials and VAERS data, prove that the shots kill more people than they allegedly save. About 411 deaths per million doses. That translates into about 150,000 people have died (from the Pfizer shots).\n\nHe then presented some data from the Israel Ministry of Health.\n\nDr. Jessica Rose, PhD, MSc, BSc, whom we have featured previously here on Health Impact News and has done extensive studies on the VAERS data, also gave a presentation where she showed that we have had a 1000% percent increase in adverse events following COVID vaccines, as compared to all previous vaccines in prior years, something we have covered extensively here at Health Impact News.\n\nListen to the presentations of these three doctors. This is from our Bitchute channel, and it is also on our Rumble channel.\n\nWill the FDA and Biden Administration Approve the 3rd Pfizer COVID-19 “Booster shots”?\n\nIt is important to understand that this was an “Advisory” committee meeting, and they do not set policy. The FDA could still approve the 3rd Pfizer COVID-19 shot against the recommendation of the Advisory Committee.\n\nAlso, these three doctors who shared the truth about the data are not part of that committee, but testified during the “open comments” section of the meeting.\n\nBut the fact that the FDA allowed their comments is very significant, as they are now in the public record.\n\nThere is obviously some infighting going on at the FDA regarding the Pfizer COVID-19 shots. What could be the reasons for this?\n\nI see two potential reasons why this could be happening.\n\nFirst, this could be a “drug war,” where Pfizer’s competitors are upset that Pfizer is getting so much of the market share on the COVID-19 vaccines, and they are applying pressure through their contacts at the FDA to start discrediting Pfizer and slow down their rapid race to dominate this market.\n\nOr, secondly, people are starting to abandon ship on the Biden Administration as the current COVID-19 vaccine narrative is now falling apart very quickly, as hundreds of thousands of people are now screaming to have their voices heard regarding their negative experiences with the COVID-19 shots, and the FDA and others are trying to cover their butts in the event that there is a regime change and people start getting arrested for crimes against humanity.\n\nI hope for the second scenario, but fear it is probably the first one.\n\nIf the Biden Administration and their handlers on Wall Street believe they are still firmly in control of this mass vaccination campaign that is really an act of genocide and crimes against humanity, then they will just go ahead and approve Pfizer’s third shot anyway, without the approval of this committee.\n\nThey will basically tell the American people and their business rivals that they know we are on to them, and that they don’t care because they believe that nobody is going to do anything to stop them.\n\nWe know what side the corporate media is on, as they continue to publish the lies that the unvaccinated are filling up hospitals and responsible for spreading COVID-19 variants, and of course they gave no press coverage to the dissenting doctors who testified at the Committee meeting yesterday (at least I did not find anything after doing a corporate media news search.)\n\nWill America do what is necessary to fight these medical tyrants, who are the minority and could be easily overpowered if enough people resisted, or will the nation continue to stand aside and let them press on with their mass eugenics program to reduce the world’s population?\n\nThis is most certainly a turning point in human history, not just for the United States, but for the entire world.\n\nToday, the U.S. Food and Drug Administration approved the first COVID-19 vaccine. The vaccine has been known as the Pfizer-BioNTech COVID-19 Vaccine, and will now be marketed as Comirnaty (koe-mir’-na-tee), for the prevention of COVID-19 disease in individuals 16 years of age and older. The vaccine also continues to be available under emergency use authorization (EUA), including for individuals 12 through 15 years of age and for the administration of a third dose in certain immunocompromised individuals.\n\n“The FDA’s approval of this vaccine is a milestone as we continue to battle the COVID-19 pandemic. While this and other vaccines have met the FDA’s rigorous, scientific standards for emergency use authorization, as the first FDA-approved COVID-19 vaccine, the public can be very confident that this vaccine meets the high standards for safety, effectiveness, and manufacturing quality the FDA requires of an approved product,” said Acting FDA Commissioner Janet Woodcock, M.D. “While millions of people have already safely received COVID-19 vaccines, we recognize that for some, the FDA approval of a vaccine may now instill additional confidence to get vaccinated. Today’s milestone puts us one step closer to altering the course of this pandemic in the U.S.”\n\nThe entire pharmaceutical industry has an inherent conflict of interest in public healthcare, and it is ridiculous to say that it should not have its own regulating agency that supports such vested interests.\n\nThe ball is now with the people whether to do something decisive and be free, or forever suffer in agonizing silence because they could not see themselves fighting against a government that they believe was their own.\n\nIf the people won’t act now, just imagine the scenario when the likes of Bill Gates own most farmlands in America…\n\nYou can actually participate in the global efforts to cripple the Deep State organized criminal cabal's ability for genocide, while enjoying healthcare freedom at the same time, by boycotting Big Pharma for good.", "opengraph": {"type": "article", "title": "FDA Allows Whistleblower Testimony that COVID-19 Vaccines are Killing and Harming People!", "url": "https://geopolitics.co/2021/09/22/fda-allows-whistleblower-testimony-that-covid-19-vaccines-are-killing-and-harming-people/", "description": "The FDA held a Vaccine Advisory Committee meeting yesterday (September 17, 2021) to discuss authorizing a third Pfizer COVID-19 “booster shot.”", "article:published_time": "2021-09-22T00:41:57+00:00", "article:modified_time": "2021-09-25T05:52:45+00:00", "site_name": "Covert Geopolitics", "image": "https://geopolitics.co/wp-content/uploads/2021/09/FDA-Bldg-SignWeb.jpg", "image:width": "1200", "image:height": "800", "locale": "en_US"}, "tags": ["vaccine injuries", "vaccine deaths"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": null, "height": "0", "embed_code": "<iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" class=\"arve-iframe fitvidsignore\" data-arve=\"arve-youtube-mjvl9hegcr46447ccc67c898214524268\" data-src-no-ap=\"https://www.youtube-nocookie.com/embed/MJVL9HegCr4?feature=oembed&amp;iv_load_policy=3&amp;modestbranding=1&amp;rel=0&amp;autohide=1&amp;playsinline=0&amp;autoplay=0\" frameborder=\"0\" height=\"0\" sandbox=\"allow-scripts allow-same-origin allow-presentation allow-popups allow-popups-to-escape-sandbox\" scrolling=\"no\" src=\"https://www.youtube-nocookie.com/embed/MJVL9HegCr4?feature=oembed&amp;iv_load_policy=3&amp;modestbranding=1&amp;rel=0&amp;autohide=1&amp;playsinline=0&amp;autoplay=0\"/>", "src": "https://www.youtube-nocookie.com/embed/MJVL9HegCr4?feature=oembed&iv_load_policy=3&modestbranding=1&rel=0&autohide=1&playsinline=0&autoplay=0"}], "links": ["https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(21)02046-8/fulltext", "https://healthimpactnews.com/2021/study-analysis-of-vaers-shows-the-covid-shots-are-likely-cause-of-deaths-spontaneous-abortions-cardiovascular-neurological-and-immunological-adverse-events/", "https://www.bitchute.com/video/KwlZU198oGpT/", "https://rumble.com/vmobfc-bombshell-fda-allows-whistleblower-testimony-that-covid-19-vaccines-are-kil.html", "https://healthimpactnews.com/2021/bombshell-fda-allows-whistleblower-testimony-that-covid-19-vaccines-are-killing-and-harming-people/", "https://www.fda.gov/news-events/press-announcements/fda-approves-first-covid-19-vaccine", "https://virutron.com/", "https://virutron.com/"], "authors": [], "publish_date": "2021-09-22T00:41:57+00:00"}