{"result_id": "083035", "URL": "https://geopolitics.co/2021/03/19/vaccines-are-the-keys-to-world-control/", "timestamp": "2023-04-25 14:51:34 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://geopolitics.co/wp-content/uploads/2019/11/cg-icon-150x150.png", "canonical": "https://geopolitics.co/2021/03/19/vaccines-are-the-keys-to-world-control/", "encoding": "UTF-8"}, "image": null, "domain": "geopolitics.co", "title": "“Vaccines” Are the Keys to World Control", "cleaned_text": "“It’s better to die on your feet than to live on your knees”, ascribed to Mexican revolutionary Emiliano Zapata, is quoted by many, but few seem willing to live it. In any case, the pharmaceutical industry and its operatives throughout government, media and the medical establishment have terrorized an already infantilized society and brought it to its collective knees.\n\nA compelling 6-minute video of a 9/11 Truth march in Brussels in 2007 quotes a marcher:\n\n“I’m coming back to Europe, because I saw what happened to the American people. They’ve been taken hostage for the last 20 years by a group of people who destroyed them physically, spiritually and intellectually, and now they’re trying to do the same thing in Europe.”\n\nApplying an inferential form of thought — a connecting of dots, so to speak — to draw logical and highly probable conclusions, once valued as critical thinking, is now shunned as conspiracy theorizing.\n\nConsider a NY Times opinion piece covering the judgments of “digital literacy” experts claiming that “overthinking” an issue, or to “use reasoning”, may be counterproductive. Instead, high school and college students are to be coached in a “SIFT” method allowing one to evaluate a report in mere seconds, like “fact checkers” do.\n\nReally! Almost predictably, Robert F. Kennedy, Jr., introduced without question as “… a prominent anti-vaccine activist, falsely alleging a link between the human papillomavirus vaccine and cancer…”, is used as an example of how SIFT can rapidly assess and reject an article. “Look how fast this is” says an expert as he uses Google to lead in 15 seconds to … Wikipedia!, both famously hostile to views opposing official narrative. Nevertheless, one is prompted to scroll quickly, check out the last sentence, and “move on”.\n\nSuch superficiality as social norm will be fatal, because never has there been greater need at mass level for clear thinking and an unflinching grasp that the vaccine industry has become a weaponized system for taking control of global society, with mandated masking as a social engineering strategy to prepare for mass vaccination by governmental edict. Those who have fathomed the direction of events know that the worst lies ahead. Italian Archbishop C.M. Vigano’, like many others, sees a point at which those refusing injection will be forced into detention centers. The U.S. has many already in place, and there’s plenty of room to spare. Avoiding forced injection would be impossible when imprisoned.\n\nWell before Covid19 was declared a pandemic by the World Health Organization (WHO), the vaccine industry had mobilized its forces at political levels from national to state to local, in media — both print and broadcast — and in the schools of public health that now yield the “health experts” showcased by mainstream journalists. Trust in public health officials has plummeted and deservedly so. WHO has evolved into essentially THE vaccine industry, funded primarily by the Bill and Melinda Gates Foundation and Gavi, the Vaccine Alliance whose interests, according to a recent WHO director, drive WHO policy. A Swiss scientist and whistleblower with impeccable credentials, Dr. Astrid Stuckelberger, who worked for years within WHO, recently exposed the pervasive corruption by Gates and the Vaccine industry, their iron control of WHO and its Member States (i.e., the nations of the world), and the massive death that has resulted from their vaccination programs in India and Africa. Her interview by the Corona Investigative Committee is worth anyone’s 30 minutes. The Corona Investigative Committee itself maintains a bullet-point rundown of its findings.\n\n193 member countries of the United Nations have made themselves “Contracting Parties” of WHO and have agreed to abide by its Constitution which obliges nations (“Members” in caps) to “take action” on rules adopted by the WHO’s Health Assembly. The Assembly has authority to create regulations concerning “quarantine requirements”, “diagnostic procedures” and “labelling of biological, pharmaceutical and other products”. Moreover, the Director-General and his/her representative may “by agreement with Members” gain direct access to national health organizations, both governmental and non-governmental (the latter including medical schools).\n\nArticles 66 and 67 of the Constitution are particularly threatening as they grant that the WHO “shall enjoy in the territory of each Member such legal capacity [and] such privileges and immunities as may be necessary for the fulfillment of its objective and for the exercise of its functions.”\n\nThe Constitution provides the WHO absolute immunity and carte blanche control, and the few world leaders who have rejected the WHO’s Covid19 Pandemic demands have placed themselves at grave risk. The “by agreement with Members” clause in the WHO Constitution is toothless, because the governmental and non-governmental entities of Member nations (e.g., CDC, NIH, schools of public health in the U.S.) are, like the WHO itself, awash in foundation/ pharmaceutical industry cash and are so corrupt that a group of CDC scientists complained (maintaining anonymity). Anthony Fauci’s NIAID (an agency of NIH) has been described as an “incubator for the Pharmaceutical Industry”.\n\nThe CDC exists as a complex public/private entity with 501(c)(3) status allowing for huge infusions of industrial and foundation money and control. Both CDC and NIAID own patents (here here here). In sum, there exists a grid of powerful interlocking elements that include the WHO, the pharmaceutical industry, national bureaus of health, media, medical schools and organizations, and powerful foundations, all dedicated to a future of routinely and heavily injected humanity.\n\nThe PCR test is famous for false positives, as even the World Health Organization now admits. The Nobel laureate creator of PCR stated that it should never be used as a diagnostic tool for infectious diseases. Nevertheless, the WHO says “test, test, test”, so stupidity prevails, PCR continues to be used, and “cha-ching!”, the money rolls in. Philosopher John Lord Griffin, with humorous intent, makes points with brief multiple choice questions to showcase the obvious, e.g.: If PCR tests come up with 97% false positives, identify inoperative fragments of virus, and artificially amplify a minute sample 2 to the 40th times to make it look more impressive, does it make sense to test?\n\nDuring the “Covid19 Pandemic”, flu drops unexpectedly to virtually nil (Here, here, here). A sampling of 685,243 yields not a single case of flu because of … masks? But wait!, both are viruses and should respond similarly. Epidemiologists willing to speak up state the obvious: Flu is being counted as Covid19. A graduate student at Johns Hopkins posts data showing the inverse relationship between Covid19 and flu, and the school removes it, but not before some good soul saves it. At the same time, the CDC inflates Covid mortality.\n\nStudies by the dozens over decades revealed that masking the public does not prevent viral transmission to any statistically measurable degree. Only in Spring 2020 was the remarkable power of the mask to divide a populace newly appreciated and employed as a psychological weapon to be made a “new normal”, even as prolonged masking was declared by neurologists willing to risk their reputations as unhealthy, particularly in children. We’ve been so psychologically bullied that even when allowed to go maskless, many have come to feel naked and in need of their face covers, like children clutching security blankets.\n\nThe mRNA technology in Covid19 “jabs” is not “vaccine” according to standard definition but a form of gene therapy never before tried on humans. Repetitive media reference to “vaccines” is a lie to deceive. Both Moderna and Pfizer have admitted their injectables do not prevent infection or transmission, and that their synthetic mRNA is designed to cause recipients to produce an “S1 spike protein” which itself can produce dangerous side effects (aka “adverse events”). Late health impacts will be coming in years down the road. If in waves they will most certainly be charged to “spikes” or new, more deadly, “variant” forms.\n\nThere is no longer excuse for medical practitioners and researchers to be unaware of the massive corruption in the WHO, NIH, CDC, and in the Pharmaceutical/ Bloomberg/ Gates Foundation “supported” schools of public health. Even a vaccine industry whistleblower – a Pfizer VP no less – sees the “whiff of evil” in mass vaccination of healthy people.\n\nAlthough there are the Great Barrington Declaration, the Frontline Doctors, and other international medics (1, 2, 3, 4, 5, 6 and more) exposing deceit in the Covid19 Pandemic-Lockdown scenario, they are not enough. For doctors to be silent has become a betrayal of “First do no harm”. In connection with this, those who research pre-2020 medical studies find that it was fully understood that mass masking does not hinder viral transmission. Therefore, mask advocacy now by medical practitioners is based on post-Covid19 Pandemic propaganda. This reinforces the suspicion that ongoing relationships with pharmaceutical salespeople have become primary information sources for doctors. In essence, our medical system has been highjacked by the profit-driven pharmaceutical industry.\n\nThe current injection offensive is intended as only the first in a future filled with similar campaigns. Elon Musk may be providing insight into where this can lead with Neuralink. His artificial intelligence (AI) technology uses implanted chips for brain-machine interfacing and control.\n\nBut it should not be long before chip technology melds with injectables, as nanotechnology is expanding so rapidly that what is being written about it is outdated within months. Technology of control that can be downloaded into the human body appears to have no limits. A clear and critical view reveals that humanity is on a path leading to a world in which injectables going by the name of “vaccines” are to be mandatory for all, and on a continuing basis, essentially forever. That’s the harsh reality we’re facing.\n\nThe original source of this article is Global Research Copyright © Prof. Bill Willers, Global Research, 2021\n\nYou can actually participate in the global efforts to cripple the Deep State organized criminal cabal's ability for genocide, while enjoying healthcare freedom at the same time, by boycotting Big Pharma for good.", "opengraph": {"type": "article", "title": "“Vaccines” Are the Keys to World Control", "url": "https://geopolitics.co/2021/03/19/vaccines-are-the-keys-to-world-control/", "description": "“It’s better to die on your feet than to live on your knees”, ascribed to Mexican revolutionary Emiliano Zapata, is quoted by many, but few seem willing to live it. In any case, the pharmaceutical …", "article:published_time": "2021-03-18T17:11:28+00:00", "article:modified_time": "2021-03-21T11:36:10+00:00", "site_name": "Covert Geopolitics", "image": "https://geopolitics.co/wp-content/uploads/2021/03/bill-gates-mrna.jpg", "image:width": "754", "image:height": "501", "locale": "en_US"}, "tags": ["covid19 lockdown", "mrna vaccine", "vaccines", "vaccine passport", "covid passport"], "tweets": [], "movies": [], "links": ["https://theconversation.com/the-infantilization-of-western-culture-99556", "https://911truth.org/91107-truth-march-in-brussels-belgium/", "https://www.nytimes.com/2021/02/18/opinion/fake-news-media-attention.html", "https://www.globalresearch.ca/masks-psychological-preparation-mandatory-vaccinations/5720053", "https://jamesfetzer.org/2021/03/archbishop-vigano-covid-agenda-aims-to-destroy-national-sovereignties-and-the-divine-mission-of-the-church/", "https://concentrationcamps.us/", "https://www.aier.org/article/the-collapse-of-trust-in-public-health/", "https://apps.who.int/gb/ebwha/pdf_files/WHA71/A71_INF2Corr1-en.pdf", "https://www.nytimes.com/2014/09/04/world/africa/who-leader-describes-the-agencys-ebola-operations.html?_r=0", "https://greatgameindia.com/who-whistleblower-astrid-stuckelberger-bill-gates/", "https://foreignaffairsintelligencecouncil.wordpress.com/tag/the-german-corona-investigative-committee/", "https://apps.who.int/gb/bd/PDF/bd47/EN/constitution-en.pdf?ua=1", "https://off-guardian.org/2021/03/12/tanzania-the-second-covid-coup/", "https://thehill.com/blogs/pundits-blog/healthcare/301432-the-cdc-is-being-being-influenced-by-corporate-and-political", "https://www.westonaprice.org/podcast/its-gene-therapy-not-a-vaccine/", "https://www.armstrongeconomics.com/international-news/disease/cdc-is-a-private-organization-not-government/", "https://patents.justia.com/assignee/centers-for-disease-control-and-prevention", "https://www.constitutionallawgroup.us/files/the-faucicovid-19-dossier.pdf", "https://www.niaid.nih.gov/research/anthony-s-fauci-md", "https://www.globalresearch.ca/covid-19-rt-pcr-how-to-mislead-all-humanity-using-a-test-to-lock-down-society/5728483", "https://www.portugalresident.com/judges-in-portugal-highlight-more-than-debatable-reliability-of-covid-tests/", "https://principia-scientific.com/who-finally-admits-covid19-pcr-test-has-a-problem/", "https://www.eclassifie.com/2020/05/what-is-a-pcr-test-kit-by-kary-mullis/", "https://www.youtube.com/watch?v=NsRW2B5iM6c", "https://off-guardian.org/2021/01/24/covid-odyssey/", "https://www.theguardian.com/society/2020/sep/17/falling-flu-rates-in-southern-hemisphere-offers-hope-as-winter-approaches-coronavirus", "https://www.usnews.com/news/best-states/wisconsin/articles/2021-02-10/wisconsin-supreme-court-asked-to-block-statewide-mask-order", "https://www.zerohedge.com/medical/uk-health-authorities-announce-not-single-case-flu-detected-year", "https://summit.news/2021/01/05/epidemiologist-says-influenza-cases-are-being-counted-as-covid-19/", "https://corona-transition.org/IMG/pdf/a_closer_look_at_u.s._deaths_due_to_covid-19_-_the_johns_hopkins_news-letter.pdf", "https://jdfor2020.com/wp-content/uploads/2020/11/adf864_165a103206974fdbb14ada6bf8af1541.pdf", "https://www.globalresearch.ca/mandated-public-masking-wisconsin-usa/5723724", "https://www.spectator.co.uk/article/do-masks-stop-the-spread-of-covid-19-", "https://www.bostonglobe.com/2020/08/12/metro/masks-need-be-new-normal-according-aamc-guidelines/", "https://www.technocracy.news/blaylock-face-masks-pose-serious-risks-to-the-healthy/", "https://catholictruthblog.com/2020/10/20/brain-damage-from-masks-cannot-be-reversed-stop-wearing-yours/", "https://off-guardian.org/2021/03/12/on-the-psychology-of-the-conspiracy-denier/", "https://www.constitutionallawgroup.us/files/the-faucicovid-19-dossier.pdf", "https://off-guardian.org/2021/03/11/doctors-scientists-write-to-european-medicines-agency-warning-of-covid-19-vaccine-dangers/", "https://www.aier.org/article/an-education-in-viruses-and-public-health-from-michael-yeadon-former-vp-of-pfizer/", "https://gbdeclaration.org/", "https://www.americasfrontlinedoctors.com/", "https://fromrome.info/2020/08/24/1000-german-doctors-say-covid-19-is-100-a-scam/", "https://brandnewtube.com/watch/ask-the-experts-covid-19-vaccine-now-banned-on-youtube-and-facebook_qIsNohSIeSgfz2J.html", "https://off-guardian.org/2020/03/24/12-experts-questioning-the-coronavirus-panic", "https://off-guardian.org/2020/03/28/10-more-experts-criticising-the-coronavirus-panic/", "https://www.globalresearch.ca/wp-content/uploads/2021/02/Health-Professionals.pdf", "https://off-guardian.org/2021/03/11/doctors-scientists-write-to-european-medicines-agency-warning-of-covid-19-vaccine-dangers/", "https://neuralink.com/", "https://www.globalresearch.ca/author/bill-willers", "https://virutron.com/", "https://virutron.com/"], "authors": [], "publish_date": "2021-03-18T17:11:28+00:00"}