{"result_id": "083003", "URL": "https://geopolitics.co/2021/07/14/spike-protein-the-killer-in-the-bloodstream/", "timestamp": "2023-04-25 14:51:09 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://geopolitics.co/wp-content/uploads/2019/11/cg-icon-150x150.png", "canonical": "https://geopolitics.co/2021/07/14/spike-protein-the-killer-in-the-bloodstream/", "encoding": "UTF-8"}, "image": null, "domain": "geopolitics.co", "title": "“Spike Protein” The Killer in the Bloodstream", "cleaned_text": "“From the beginning Covid has been a conspiracy against health and life. Covid is a profit-making agenda and an agenda for increasing arbitrary government power over people. There should be massive law suits and massive arrests of those who block effective Covid cures and impose a deadly vaccine.” – Paul Craig Roberts, Former Assistant Secretary of the Treasury under President Ronald Reagan\n\nThe Spike Protein is a “uniquely dangerous” transmembrane fusion protein that is an integral part of the SARS-CoV-2 virus. “The S protein plays a crucial role in penetrating host cells and initiating infection.” It also damages the cells in the lining of the blood vessel walls which leads to blood clots, bleeding, massive inflammation and death.\n\nTo say that the spike protein is merely “dangerous”, is a vast understatement. It is a potentially-lethal pathogen that has already killed tens of thousands of people.\n\nSo, why did the vaccine manufacturers settle on the spike protein as an antigen that would induce an immune response in the body?\n\nThat’s the million-dollar question, after all, for all practical purposes, the spike protein is a poison. We know that now due to research that was conducted at the Salk Institute. Here’s a summary of what they found:\n\nRemember how everyone laughed at Trump when he said injecting household bleach would cure Covid? How is this any different?\n\nIt’s not different, and whatever modest protection the vaccines provide as far as immunity, it pales in comparison to the risks they pose to personal health and survival.\n\nAnd did you notice what the author said about stripping-out the virus and leaving the spike protein alone?’\n\nHe said “it still has a major damaging effect” implying ‘blood clots, bleeding and severe inflammation.’ In other words, the spike protein is deadly even absent the virus. Here’s how Dr. Byram Bridle (who is a viral immunologist and associate professor at University of Guelph, Ontario) summed it up:\n\nThink about that for a minute. This is a very big deal, in fact, this is the critical piece of the puzzle that has been missing for the last 15 months. Just as the respiratory virus concealed the real killing-agent in Covid, (the spike protein) so too, the relentless hype surrounding mass-vaccination has concealed the glaring problem with the vaccines themselves, which is, they generate a substance that is “capable of causing disease.”\n\nThat is the literal definition of pathogenic. The spike protein is a disease-producing toxin that poses a serious and identifiable threat to the health of anyone who chooses to get vaccinated. Could it be any clearer?It’s worth noting, that Bridle is a vaccine researcher who was awarded a $230,000 government grant last year for research on COVID vaccine development. He understands the science and chooses his words carefully. The term “pathogenic” is not meant to whip people into a frenzy, but to accurately describe how vaccine-generated proteins interact in the bloodstream. And the way they interact, is by inflicting serious damage to cells in the lining of the blood vessels which can result in illness or death. Here’s more from the same article:\n\n“As many will know by now, the problem lies within a structure that enables the virus, originally from bats, not only to enter human cells but to deliver a toxin called the spike protein. Most Covid vaccines instruct our body cells to produce the same protein. This is in the hope that antibodies developed against it will prevent the most damaging effects of the actual virus. There is evidence that this is the case for some. But there’s also a problem, spelled out most recently by Canadian researcher Dr Byram Bridle, who was awarded a $230,000 Ontario government grant last year for research on Covid vaccine development. This is that the spike protein produced by the vaccine does not just act locally, at the site of the jab (the shoulder muscle), but gets into the bloodstream and is carried through the circulation to many other sites in the body. Previously confidential animal studies using radioactive tracing show it to go just about everywhere, including the adrenal glands, heart, liver, kidneys, lungs, ovaries, pancreas, pituitary gland, prostate, salivary glands, intestines, spinal cord, spleen, stomach, testes, thymus, and uterus. The quantities are small and usually disappear within days. But the questions arise, is this mechanism involved in the thousands of deaths and injuries reported soon after Covid vaccination, and might it set some people up for the same long-term consequences as in severe cases of the disease itself?” (‘We’ve made a big mistake’“, Conservative Woman)\n\nThis is the most important question: What will the long-term impact of these vaccines be on the population at large? Here’s more from the same article:\n\nRepeat: ” the vaccine has a device that protects the spike protein mechanism against immediate destruction by the body, in order to promote the immune response.”\n\nWhat does that mean? Does it mean that the spike protein created by the vaccine lingers on indefinitely risking a potential flare-up sometime in the future if another virus emerges or if the immune system is compromised? Will the people who have been vaccinated have the Sword of Damocles hanging over their heads until the day they die?\n\nIs that possible? Could we see an unprecedented surge in fatalities in the next few years directly linked to these experimental vaccines?\n\nLet’s hope not, but without any long-term safety data, there’s no way to know for sure. It’s all a big guessing game, which is one of the reasons that so many people are refusing to get vaccinated. Here’s more from Bridle:\n\n‘I’m very much pro-vaccine, (said Dr Bridle) but … the story I’m about to tell is a bit of a scary one. This is cutting edge science. There’s a couple of key pieces of scientific information that we’ve been privy to, in the past few days, that has made the final link, so we understand now – myself and some key international collaborators – we understand exactly why these problems [with the vaccine] are happening.’ One of these ‘is that the spike protein, on its own, is almost entirely responsible for the damage to the cardiovascular system, if it gets into circulation. Indeed, if you inject the purified spike protein into the blood of research animals they get all kinds of damage to the cardiovascular system, and it can cross the blood-brain barrier and cause damage to the brain. ‘At first glance that doesn’t seem too concerning because we’re injecting these vaccines into the shoulder muscle. The assumption, up until now, has been that these vaccines behave like all of our traditional vaccines: they don’t go anywhere other than the injection site, so they stay in our shoulder. Some of the protein will go to the local draining lymph node in order to activate the immune system. ‘However – this is where the cutting edge science has come in, and this is where it gets scary – through a request for information from the Japanese regulatory agency, myself and several international collaborators have been able to get access to what’s called the biodistribution study. It’s the first time ever that scientists have been privy to seeing where the messenger RNA vaccines go after vaccination; in other words, is it a safe assumption that it stays in the shoulder muscle? The short answer is, absolutely not. It’s very disconcerting. The spike protein gets into the blood and circulates over several days post-vaccination.’”(Vaccine scientist: ‘We’ve made a big mistake’“, Conservative Woman)\n\nThey got the biodistribution study from the Japanese? Are you kidding me? You mean, the FDA waved these experimental “new technology” vaccines into service before they had the slightest inkling of where the substance in the vaccine would end up in the body. If that isn’t criminal negligence, then what is? Do you want proof that our regulators are controlled by the industries they are supposed to monitor? Here it is!\n\nHere’s more from an article at Children’s Health Defense on the same topic:\n\nLet’s see if I got this right: The Covid vaccine was approved even though “Pfizer did not follow industry-standard quality management practices” and even though “key studies did not meet good laboratory practice?”\n\nDo you still think these vaccines are safe? And, it gets worse, too. Check it out:\n\nLike we said earlier, the vaccine was supposed to be “localized”, that is, remain in the area where it was injected. But that theory proved to be wrong, just like the theory that the spike protein would be a good antigen was wrong. There are literally thousands of fatalities and other injuries that attest to the “wrongness” of that theory, and there will be many more before this campaign is terminated. Here’s more:\n\nSo, it goes everywhere. Wherever blood flows, there too goes the spike proteins. Do young women really want these lethal proteins in their ovaries? Do you think that will improve their prospects for getting pregnant or safely delivering their babies? This is madness on a scale that is, frankly, unimaginable. Here’s more:\n\nWe hope that readers are beginning to understand how risky these vaccines really are. It’s literally a matter of life and death. As Bridle opines:\n\n“Mistake?” He calls it a “mistake”? That’s got to be the understatement of the century!\n\nLet’s cut to the chase: These aren’t vaccines; they’re a spike-protein delivery-system. Regrettably, 140 million Americans have already been injected with them which means we can expect a dramatic uptick in debilitating medical conditions including blood clotting, bleeding, autoimmune disease, thrombosis in the brain, stroke and heart attack. The vast human wreckage we are now facing is incalculable.\n\nHas there ever been a greater threat to humanity than the Covid vaccine?\n\nMichael Whitney, renowned geopolitical and social analyst based in Washington State. He initiated his career as an independent citizen-journalist in 2002 with a commitment to honest journalism, social justice and World peace.\n\nYou can actually participate in the global efforts to cripple the Deep State organized criminal cabal's ability for genocide, while enjoying healthcare freedom at the same time, by boycotting Big Pharma for good.", "opengraph": {"type": "article", "title": "“Spike Protein” The Killer in the Bloodstream", "url": "https://geopolitics.co/2021/07/14/spike-protein-the-killer-in-the-bloodstream/", "description": "“From the beginning Covid has been a conspiracy against health and life. Covid is a profit-making agenda and an agenda for increasing arbitrary government power over people. There should be massive…", "article:published_time": "2021-07-14T10:29:36+00:00", "article:modified_time": "2021-07-17T12:50:18+00:00", "site_name": "Covert Geopolitics", "image": "https://geopolitics.co/wp-content/uploads/2021/07/spike-protein.png", "image:width": "696", "image:height": "392", "locale": "en_US"}, "tags": ["pseudovaccine", "gene therapy", "covid19 coup", "covid-19 pandemic", "spike protein"], "tweets": [], "movies": [], "links": ["https://virutron.com/covid19-is-primarily-a-vascular-disease-not-respiratory-salk-institute/", "https://www.conservativewoman.co.uk/vaccine-researcher-weve-made-a-big-mistake/", "https://www.conservativewoman.co.uk/vaccine-researcher-weve-made-a-big-mistake/", "https://articles.mercola.com/sites/articles/archive/2021/05/30/covid-19-vaccines-causing-damage.aspx", "https://www.conservativewoman.co.uk/vaccine-researcher-weve-made-a-big-mistake/", "https://childrenshealthdefense.org/defender/pfizer-skipped-critical-testing-quality-standards-covid-vaccine/?itm_term=home", "https://childrenshealthdefense.org/defender/pfizer-skipped-critical-testing-quality-standards-covid-vaccine/?itm_term=home", "https://childrenshealthdefense.org/defender/pfizer-skipped-critical-testing-quality-standards-covid-vaccine/?itm_term=home", "https://www.conservativewoman.co.uk/covid-vaccines-concerns-that-make-more-research-essential/", "https://virutron.com/", "https://virutron.com/"], "authors": [], "publish_date": "2021-07-14T10:29:36+00:00"}