{"result_id": "083026", "URL": "https://geopolitics.co/2022/08/02/disrupting-this-civilizations-rise-to-common-prosperity-with-age-old-military-tactics/", "timestamp": "2023-04-25 14:51:27 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://geopolitics.co/wp-content/uploads/2019/11/cg-icon-150x150.png", "canonical": "https://geopolitics.co/2022/08/02/disrupting-this-civilizations-rise-to-common-prosperity-with-age-old-military-tactics/", "encoding": "UTF-8"}, "image": null, "domain": "geopolitics.co", "title": "Disrupting This Civilization’s Rise to Common Prosperity with Age-Old Military Tactics", "cleaned_text": "All of the ongoing catastrophes, simulated or otherwise, are meant to delay and deter humanity’s real scientific progress, which should have been the natural course of every civilization working individually, or collectively, towards its shared goal leading to a much higher quality of life.\n\nThe techniques being used today to main the status quo are all based on old military doctrines, like so:\n\nDisrupting The Enemy’s Health is An Age-Old Military Tactic\n\nThe Biden Administration is spending almost $5 billion for 171 million untested and unapproved mRNA shots this winter at $29 each to inject into the American population. It has options to buy another 600 million shot if Congress allocates more funding. The cumulative effect of multiple injections are already causing major health disruptions.\n\nAny discussions about attacks on humanity from Big Pharma, Big Government, World Economic Forum, United Nations, etc., are immediately branded as conspiracy theories with outright denial from so-called “fact-checkers.” This demonstrates that the counter-narrative is true and the “official” narrative is false. This is a harsh reality that Americans need to grasp before our nation is ripped apart at the seams. ⁃ TN Editor\n• The U.S. has agreed to purchase 66 million doses of Moderna’s new vaccine formula that targets omicron in a $1.74 billion deal.\n• The Moderna order comes on top of a U.S. agreement to purchase 105 million doses of Pfizer’s updated shots that target omicron for $3.2 billion.\n• Many public health officials and scientists believe that updating the vaccines to target omicron BA.4 and BA.5 will provide more durable protection against infection this fall.\n\nThe Health and Human Services Department has secured 171 million doses of new Covid vaccines that target the omicron variant in preparation for a fall booster campaign.\n\nThe U.S. has agreed to purchase 66 million doses of Moderna’s new vaccine formula in a $1.74 billion deal, HHS announced on Friday. The Moderna order comes on top of a $3.2 billion agreement to purchase 105 million doses of Pfizer’s updated shots that target omicron.\n\nHHS expects to receive the first deliveries from Pfizer and Moderna early this fall. The new vaccines that target omicron still need to be authorized by the Food and Drug Administration and cleared by the Centers for Disease Control and Prevention.\n\nThe FDA last month told Pfizer and Moderna to develop vaccines with a new formula that targets the omicron BA.4 and BA.5 subvariants in addition to the original strain of Covid that first emerged in Wuhan, China in 2019.\n\nOmicron BA.4 and BA.5, the most contagious Covid variants yet, have caused a wave of summer infection that has led to an increase in hospitalizations. Public health officials and scientists are worried that the U.S. faces an even larger wave of infection in the fall as immunity from the original vaccines wanes and people head indoors, where the virus spreads easier, to escape the cold.\n\nOmicron BA.5 makes up nearly 82% of new infections in the U.S. while BA.4 is causing about 13% of new cases. The U.S. is reporting at least 126,000 new infections a day on average as of Wednesday, according to data from the CDC. But the real number of new infections is likely far higher because so many people are using at-home Covid tests, which aren’t picked up by the official data.\n\nMore than 6,300 people are hospitalized with Covid a day on average as of Tuesday, according to CDC data. More than 360 people are still dying from the virus a day on average as of Wednesday, according to the data.\n\nModerna’s and Pfizer’s current shots are based solely on the original strain of Covid that emerged from China more than two years ago. The virus has mutated dramatically since then and, as a consequence, the vaccines are no longer effective at blocking infections. President Joe Biden recently caught Covid, likely BA.5, despite being fully vaccinated and twice boosted. But the current vaccines are still effective at preventing severe disease and death. The president recovered in a matter of days after also taking Paxlovid, Pfizer’s oral antiviral treatment.\n\nDestroying The Enemy’s Food Supply is An Age-Old Military Tactic\n\nFarmers have been declared to be the scapegoats of the mass formation of global warming loons and destroying food production is at the top of their list. Any nation that has bought into this madness is attacking the very means of our survival – food. The world is at war but nobody is crying out.\n\nIn America, farmers are under unprecedented attack but so also are food processing plants. The fact that the entire universe of disingenuous fact checkers have labeled all of this as conspiracy theories is proof enough that we are indeed at war. ⁃ TN Editor\n\nThe most efficient system in history of growing food and getting it to consumers, modern farming, is under attack, blamed for causing climate change.\n\nDutch Government to Farmers: Reduce Your Operations by Up to 95 Percent\n\nThe world has watched as Dutch farmers fight for their economic survival against demands that they shrink their operations to suit the government’s climate change agenda. The Dutch government has told farmers to cut ammonia emissions by 50 percent, and those near protected areas must reduce their operations by as much as 95 percent, or they must sell their land to the government and face a lifetime ban from farming.\n\nDutch Farmers have responded by spraying government buildings with manure while Dutch police shot at a 16-year-old boy at a demonstration.\n\nJos Ubels, Vice President of the Farmer’s Defense Force in the Netherlands, says negotiations are not going anywhere and a bad situation is continuing to escalate.\n\n“We are fighting for our right to produce and to live as a human being in our country,” Ubels said, “in a democracy where we have the right to go on the street to protest against legislation, and we have the right to produce, via our permits.”\n\nUbels also defended Dutch farmers’ methods. “If you check our production rates and how we work. We produce very high level, very high scale, good healthy food, traceable, all with little environmental impact,” Ubels said.\n\nFarmers from around the world who are also seeing their way of life under attack have demonstrated in solidarity.\n\nAmerican farmers, who are already subject to a host of regulations, could also find themselves facing even more restrictions. But the island nation of Sri Lanka serves as a cautionary tale.\n\nSir Lanka: A Warning to Politicians Who Want to Restrict Farming\n\nSri Lanka’s ban of chemical fertilizers in farming caused the struggling nation’s agricultural sector and economy to collapse. It ended with protestors frolicking in the presidential swimming pool after nation’s president fled the country.\n\nSri Lanka was supposed to be the poster child for modern organic farming. The World Economic Forum even proudly posted an article about Sri Lanka’s expected success, written by the prime minister whose house was set on fire by protestors.\n\nParts of the world already face famine because of a shortage of chemical fertilizer due to Russia’s invasion of Ukraine – the same kind of fertilizer environmentalists want to reduce.\n\nIs the Biden Admin About to Launch a Similar War on American Farmers?\n\nWashington Attorney Gary Baise, who helped start the Environmental Protection Agency in 1970 and now says it should be abolished, owns 11 farms in Illinois. He calls what the Dutch government is trying to do to its farming sector “madness,” and sees signs a similar movement is coming to the U.S.\n\n“Agriculture is an easy target, both from the animal standpoint and from guys like me who put a lot of anhydrous ammonia on their corn crop,” Baise said. “They’re going after methane, which is belched by cows. You know, AOC [Rep. Alexandria Ocasio-Cortez, D-NY] has it wrong. They do not F-A-R-T methane. They belch it.”\n\nBaise believes the era of cheap food at the grocery store is over, not just from inflation but because of growing environmental regulations on farming, and says Sri Lanka should be a warning to leaders who want to experiment with food production.\n\n“That’s what happens when you don’t have food,” Baise warned.\n\nNevertheless, the Biden Administration appears to be coming after farmers. Steve Milloy, editor of the website Junkscience.com, writes that a new study by the EPA claims that air emissions from farms, basically farm dust, kill 17,000 Americans per year, the same EPA standards that basically killed the coal industry.\n\n“These are people who want to control every aspect of our lives and that includes energy use and food use,” Milloy says. “They believe food production is a major contributor to global warming, a major contributor to greenhouse gases, and they’re not going to give up on agriculture. They don’t like agriculture.”\n\nWhen Farming is Attacked, the Global Food Supply Suffers\n\nFormer U.S. ambassador to the Netherlands Pete Hoekstra says if the Dutch government wins this battle against its own farmers – who are the second largest exporters of agricultural products in the world behind the United States – it will only make the global food shortage worse.\n\nHoekstra warns, “The Dutch will not experience food shortages, but there may be other parts of the world that will, because you know, this food is going to go away.”\n\nAny politician willing to risk the food supply in order to fight climate change might want to keep Sri Lanka in mind.\n\nDisrupting The Enemy’s Supply Chain is An Age-Old Military Tactic\n\nThe nation’s critical supply chain consists of ships, trucks, rail and air, all of which are suffering from failures and delays. Air transport can’t find enough pilots. Trains are faltering. Truckers are going out of business. Ships are stacked up waiting for port loading/unloading. While some of the problems are naturally occurring, the whole system is being pushed over the edge by climate insanity. ⁃ TN Editor\n\nIf you only look at Los Angeles and Long Beach — the largest container import gateway in America — you’d think shipping congestion has drastically reduced. The number of ships waiting there has fallen to 26 from a high of 109 in January. But in fact, North American port congestion has just re-entered record territory. The offshore traffic jam is once again as bad as it’s ever been.\n\nIn January and February, when North American congestion previously peaked, there were just under 150 container vessels waiting off the coastlines. Two-thirds were in the Los Angeles/Long Beach queue.\n\nAs of Thursday morning, there were 153, the majority off East and Gulf Coast ports. Whereas the earlier West Coast pileup was centralized, highly publicized and relatively easy to track, today’s ship queue is more widely disbursed and attracting less attention.\n\nPort congestion had finally looked like it was easing in May and early June. Ship queues had fallen back to double digits. There were 92 vessels waiting offshore as of June 10, led by 25 off Savannah, Georgia, 20 off Los Angeles/Long Beach, 18 off New York/New Jersey and 14 off Houston.\n\nThen things turned for the worse. The tally rose to 125 on July 8, 136 on July 13 and 140 on July 19.\n\nWith the count now rising to 153, the North American container ship queue has increased in size by 66% over the past seven weeks.\n\nAs of Thursday morning, ship-position data from MarineTraffic and the latest queue lists for California ports showed 43 container ships waiting off Savannah; 26 off Los Angeles/Long Beach; 24 off Houston; 18 off New York/New Jersey; 17 off Vancouver, British Columbia; 15 off Oakland, California; and 10 ships off other ports.\n\nOf those, 59 ships – 38% of the total – were waiting off the West Coast, where queues have climbed off Vancouver and Oakland. There were 94 ships (62% of the total) off the East and Gulf Coast ports, with counts up in both Savannah and Houston.\n\nU.K.-based data provider VesselsValue found large differences in the waiting times at the top 10 East Coast terminals, including major differences between terminals in the same port complex.\n\nIt cited four East Coast terminals with long wait times: the New York and Elizabeth APM terminals in the Port of New York/New Jersey and the Garden City and Savannah terminals in the Port of Savannah.\n\nIn contrast, VesselsValue data found relatively short wait times at the Maher and Port Newark terminals in New York/New Jersey; the Norfolk International and Virginia International Gateway terminals in Norfolk, Virginia; the Packer Avenue terminal in Philadelphia; and the Wando Welch terminal in Charleston, South Carolina.\n\nIt may be no coincidence that East and Gulf Coast congestion ramped up starting in June. That was the month new annual contracts kicked in. It was also the last month before the West Coast labor contract with the ILWU longshoreman union expired.\n\nAkhil Nair, vice president of carrier management at Seko Logistics, said during a briefing on July 20, “With all the early threats of the potential ILWU strike and labor constraints on the West Coast, there was an automatic shift during contract season for customers to actually require traditional West Coast shippers to request allocation on the East Coast as well. This was their contractual hedge that they put in place.\n\n“This has resulted now in people probably having overcompensated. The congestion on the East Coast is a result of some of this shifting in the supply chain design and hedging for potential incidents or reliable or unpredictable activity on the West Coast.”\n\nYou can actually participate in the global efforts to cripple the Deep State organized criminal cabal's ability for genocide, while enjoying healthcare freedom at the same time, by boycotting Big Pharma for good.", "opengraph": {"type": "article", "title": "Disrupting This Civilization’s Rise to Common Prosperity with Age-Old Military Tactics", "url": "https://geopolitics.co/2022/08/02/disrupting-this-civilizations-rise-to-common-prosperity-with-age-old-military-tactics/", "description": "All of the ongoing catastrophes, simulated or otherwise, are meant to delay and deter humanity’s real scientific progress, which should have been the natural course of every civilization work…", "article:published_time": "2022-08-02T11:19:48+00:00", "article:modified_time": "2022-08-05T11:12:55+00:00", "site_name": "Covert Geopolitics", "image": "https://geopolitics.co/wp-content/uploads/2022/08/beautiful-earth.jpg", "image:width": "1920", "image:height": "1200", "locale": "en_US"}, "tags": ["Climate Change", "simulated recession", "WEF", "food shortage"], "tweets": [], "movies": [], "links": ["https://geopolitics.co/wp-content/uploads/2022/08/health.png", "https://www.cnbc.com/quotes/MRNA", "https://www.cnbc.com/quotes/PFE", "https://www.cnbc.com/joe-biden/", "https://www.cnbc.com/2022/07/29/us-secures-171-million-omicron-covid-shots-ahead-of-fall-vaccination-campaign.html", "https://geopolitics.co/wp-content/uploads/2022/08/dutch-farmers.webp", "https://www1.cbn.com/cbnnews/world/2022/july/no-farmers-no-food-dutch-farmers-face-the-fight-of-their-lives-as-climate-mandates-threaten-farms", "https://farmersdefenceforce.nl/", "http://%20https//www.nationalreview.com/corner/sri-lanka-an-organic-catastrophe/", "http://%20https//www.weforum.org/agenda/2018/08/this-is-how-we-will-make-sri-lanka-rich-by-2025/", "https://www.independent.co.uk/asia/south-asia/sri-lanka-prime-minister-house-fire-protests-b2119574.html", "https://www.washingtontimes.com/news/2021/may/31/bidens-coming-war-on-farmers/", "http://junkscience.com/", "http://%20https//abcnews.go.com/International/sri-lanka-protesters-lounged-presidents-pool-countrys-government/story?id=86743582", "https://www1.cbn.com/cbnnews/world/2022/july/not-just-the-dutch-farmers-everywhere-fight-for-survival-against-the-climate-change-agenda-nbsp", "https://geopolitics.co/wp-content/uploads/2022/08/supply-chain.png", "https://www.freightwaves.com/news/traffic-jam-of-waiting-container-ships-is-now-as-bad-as-ever", "https://virutron.com/", "https://virutron.com/"], "authors": [], "publish_date": "2022-08-02T11:19:48+00:00"}