{"result_id": "083041", "URL": "https://geopolitics.co/2014/06/12/30-years-of-vaccine-scam-coverup-is-over/", "timestamp": "2023-04-25 14:51:38 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://geopolitics.co/wp-content/uploads/2019/11/cg-icon-150x150.png", "canonical": "https://geopolitics.co/2014/06/12/30-years-of-vaccine-scam-coverup-is-over/", "encoding": "UTF-8"}, "image": null, "domain": "geopolitics.co", "title": "30 Years of Vaccine Scam & Coverup is Over", "cleaned_text": "‘Tis the season to be jolly as once again a mainstream media outlet finally published the end of the Vaccine Hoax as 30 years worth of documentary evidence about crimes committed in massive scale in the area of healthcare have been revealed through the Freedom of Information Act.\n\n \n\n CDC, Big Pharma’s legal marketing arm lost the fight for the classification of damning documents about its primary involvement in orchestrating artificial pandemics.\n\n\n\nAndrew Baker ( FFN),– Freedom of Information Act in the UK filed by a doctor there has revealed 30 years of secret official documents showing that government experts have\n\n1. Known the vaccines don’t work\n\n2. Known they cause the diseases they are supposed to prevent\n\n3. Known they are a hazard to children\n\n4. Colluded to lie to the public\n\n5. Worked to prevent safety studies\n\nThose are the same vaccines that are mandated to children in the US.\n\nEducated parents can either get their children out of harm’s way or continue living inside one of the largest most evil lies in history, that vaccines – full of heavy metals, viral diseases, mycoplasma , fecal material, DNA fragments from other species, formaldehyde, polysorbate 80 (a sterilizing agent) – are a miracle of modern medicine.\n\nFreedom of Information Act filed in the US with the CDC by a doctor with an autistic son, seeking information on what the CDC knows about the dangers of vaccines, had by law to be responded to in 20 days. Nearly 7 years later, the doctor went to court and the CDC argued it does not have to turn over documents. A judge ordered the CDC to turn over the documents on September 30th, 2011.\n\nOn October 26, 2011, a Denver Post editorial expressed shock that the Obama administration, after promising to be especially transparent, was proposing changes to the Freedom of Information Act that would allow it to go beyond declaring some documents secret and to actually allow government agencies (such as the CDC) to declare some document “non-existent.”\n\nSimultaneous to this on-going massive CDC cover up involving its primary “health” not recommendation butMANDATE for American children, the CDC is in deep trouble over its decades of covering up the damaging effects of fluoride and affecting the lives of all Americans, especially children and the immune compromised. Lawsuits are being prepared. Children are ingesting 3-4 times more fluoride by body weight as adults and “[t]he sheer number of potentially harmed citizens — persons with dental fluorosis, kidney patients tipped into needing dialysis, diabetics, thyroid patients, etc — numbers in the millions.”\n\nThe CDC is obviously acting against the health of the American people. But the threat to the lives of the American people posed by the CDC’s behavior does not stop there. It participated in designed pandemic laws that are on the books in every state in the US, which arrange for the government to use military to force unknown, untested vaccines, drugs, chemicals, and “medical” treatments on the entire country if it declares a pandemic emergency.\n\nThe CDC’s credibility in declaring such a pandemic emergency is non-existent, again based on Freedom of Information Act. For in 2009, after the CDC had declared the H1N1 “pandemic,” the CDC refused to respond to Freedom of Information Act filed by CBS News and the CDC also attempted to block theirinvestigation. What the CDC was hiding was its part in one of the largest medical scandals in history, putting out wildly exaggerated data on what it claimed were H1N1 cases, and by doing so, created the false impression of a “pandemic” in the US.\n\nThe CDC was also covering up e financial scandal to rival the bailout since the vaccines for the false pandemic cost the US billions. And worse, the CDC put pregnant women first in line for an untested vaccine with a sterilizing agent, polysorbate 80, in it. Thanks to the CDC, “the number of vaccine-related “fetal demise” reports increased by 2,440 percent in 2009 compared to previous years, which is even more shocking than the miscarriage statistic [700% increase].\n\nThe exposure of the vaccine hoax is running neck and neck with the much older hoax of a deadly 1918-19 flu. It was aspirin that killed people in 1918-19, not a pandemic flu. It was the greatest industrial catastrophe in human history with 20-50 million people dying but it was blamed on a flu. The beginning of the drug industry began with that success (and Monsanto was part of it). The flu myth was used by George Bush to threaten the world with “another pandemic flu that could kill millions” – a terror tactic to get pandemic laws on the books in every state and worldwide. Then the CDC used hoax of the pandemic hoax to create terror over H1N1 and to push deadly vaccines on the public, killing thousands of unborn children and others. (CDC will not release the data and continues to push the same vaccine.)\n\nThe hoax of the vaccine schedule is over, exposed by FOIAs in the UK.\n\nThe hoax of the CDC’s interest in children’s lives has been exposed by its refusal to respond to a doctor’s FOIAs around its knowledge of vaccine dangers.\n\nThe 1918-19 pandemic hoax has been exposed by Dr. Karen Starko’s work on aspirin’s role in killing people.\n\nAnd despite refusing to respond to FOIAS, the CDC’s scandalous hoax of a 2009 flu pandemic and its part in creating it, was exposed by CBS NEWS.\n\nAnd the Obama administration, in attempting to salvage the last vestige of secrecy around what is really happening with vaccines, by declaring agency documents non-existent, has made its claim of transparency, non-existent.\n\nBut pandemic laws arranging for unknown vaccines to be forced on the entire country are still in place with HHS creating a vaccine mixture that should never be used on anyone and all liability for vaccines having been removed. Meanwhile, a Canadian study has just proven that the flu vaccine containing the H1N1 vaccine which kills babies in utero, actually increases the risk of serious pandemic flu.\n\nAmericans who have been duped into submitting their children to the CDC’s deadly vaccines, have a means to respond now. People from every walk of life and every organization, must\n\n1. take the information from the UK FOIAs exposing 30 years of vaccine lies, the refusal of the CDC to provide any information on what it knows about those lies, and the Obama Administration’s efforts to hide the CDC’s awareness of those lies, and go to their state legislatures, demand the immediate nullification of the CDC vaccine schedule and the pandemic laws.\n\n2. inform every vet. active duty military person, law enforcement people, DHS agents and medical personnel they know, of the vaccine hoax, for their families are deeply threatened, too, but they may not be aware of it or that they have been folded into agency structures by the pharmaceutical industry (indistinguishable from the bankers and oil companies) that would make them agents of death for their country with the declaration of a “pandemic” emergency or “bio-terrorist” attack. It is completely clear now that the terrorism/bioterrorism structures are scams so that any actions taken to “protect” this country using those laws would in fact be what threatens the existence of Americans.\n\nIt was aspirin that killed millions in 1918-19. Now it is mandated and unknown, untested vaccines with banned adjuvants in them that threaten the country with millions of deaths. At the same time, the CDC is holding 500,000 mega-coffins, built to be incinerated, on its property outside Atlanta. Not to put to fine a point on this, but it’s clear now that the CDC should not be involved in any way with public health.\n\nThanks to the Freedom of Information Act (FOIA), we know that vaccines are not a miracle of modern medicine. Any medical or government authority which insists vaccines prevent diseases is either ignorant of government documents (and endless studies) revealing the exact opposite or of the CDC’s attempts to hide the truth about vaccines from the public, or means harm to the public.\n\nThanks to the Freedom of Information Act (FOIA), we know the vaccine schedule is a hoax.\n\nThe health danger to American children and adults are vaccines.\n\nPlease support us by downloading our Towards Healthcare Emancipation – Premium Edition, a fully illustrated eBook about how you can implement a low cost but extensive and decisively effective healthcare system in the comfort of your own home.\n\n With this eBook you can easily defeat cancer, AIDS and all other parasitic diseases for good. Find out more about it here.\n\n The proceeds from this book will be used to fund our next project, Towards Energy Emancipation.\n\n The aim is to make the subject of free energy more understandable for the layman so that anybody could replicate and install his own power plant and be completely living off-grid.\n\n If you haven’t done so, please like our FB page to encourage others to learn more about our work.\n\n Thank you very much for your valuable support.\n\nYou can actually participate in the global efforts to cripple the Deep State organized criminal cabal's ability for genocide, while enjoying healthcare freedom at the same time, by boycotting Big Pharma for good.", "opengraph": {"type": "article", "title": "30 Years of Vaccine Scam & Coverup is Over", "url": "https://geopolitics.co/2014/06/12/30-years-of-vaccine-scam-coverup-is-over/", "description": "‘Tis the season to be jolly as once again a mainstream media outlet finally published the end of the Vaccine Hoax as 30 years worth of documentary evidence about crimes committed in massive s…", "article:published_time": "2014-06-12T05:37:20+00:00", "article:modified_time": "2014-06-12T05:37:20+00:00", "site_name": "Covert Geopolitics", "image": "http://geopolitics.co/wp-content/uploads/2014/06/vaccine-hoax-is-over.jpg?w=474", "image:width": "474", "image:height": "225", "image:alt": "vaccine hoax is over", "locale": "en_US"}, "tags": ["vaccine hoax", "cdc", "foia"], "tweets": [], "movies": [], "links": ["https://geopolitics.co/wp-content/uploads/2014/06/vaccine-hoax-is-over.jpg", "http://www.ecomed.org.uk/wp-content/uploads/2011/09/3-tomljenovic.pdf", "http://nsnbc.me/wp-content/uploads/2013/05/800px-Smallpox_vaccine.jpg", "https://www.youtube.com/watch?v=7W4tu5qgaWA", "http://savefrom.net/?url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3D7W4tu5qgaWA&utm_source=firefox-sf&utm_medium=extensions&utm_campaign=link_modifier", "http://organichealthadviser.com/archives/polysorbate-80-in-swine-flu-vaccines-infertility-in-humans", "http://www.bolenreport.com/Mark%20Geier/foiasuit6.htm", "http://www.denverpost.com/opinion/ci_19192188", "http://www.citizens.org/?p=3041", "http://articles.mercola.com/sites/articles/archive/2009/11/24/superstar-cbs-reporter-blows-the-lid-off-the-swine-flu-media-hype-and-hysteria.aspx", "http://articles.mercola.com/sites/articles/archive/2009/10/24/cbs-reveals-that-swine-flu-cases-seriously-overestimated.aspx", "http://www.naturalnews.com/030657_vaccines_miscarriages.html", "http://foodfreedom.wordpress.com/2011/07/09/bayer-and-death-1918-and-aspirin/", "http://www.naturalnews.com/023094_Monsanto_WHO_industry.html", "http://www.salem-news.com/articles/april012011/1918-flu-jh.php", "http://www.newmediaexplorer.org/sepp/2010/09/19/us_cdc_hides_vaccine_related_miscarriages_recommends_flu_shot_health_supreme_newsgrabs_sunday_19_september_2010.htm", "http://cid.oxfordjournals.org/content/49/9/1405.full", "http://www.salem-news.com/articles/may012012/aclu-flu.php", "http://foodfreedomgroup.com/2012/09/29/the-vaccine-hoax-is-over-by-andrew-baker/www.youtube.com/watch?v=QQTgv_Vs_tU", "http://articles.mercola.com/sites/articles/archive/2012/09/18/flu-shot-increases-flu-illness.aspx", "http://www.salem-news.com/articles/september242012/homeland-monsanto-wk.php", "http://foodfreedomgroup.com/2012/09/29/the-vaccine-hoax-is-over-by-andrew-baker/", "http://myeclinik.com/product/cure-for-cancer-and-aids-towards-healthcare-emancipation-2-x#details", "http://myeclinik.com/product/cure-for-cancer-and-aids-towards-healthcare-emancipation-2-x#details", "https://www.facebook.com/eclinik", "http://www.topblogs.com.ph/health-medicine/", "https://virutron.com/", "https://virutron.com/"], "authors": [], "publish_date": "2014-06-12T05:37:20+00:00"}