{"result_id": "083017", "URL": "https://geopolitics.co/2022/02/08/international-alert-message-about-covid-19/", "timestamp": "2023-04-25 14:51:20 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://geopolitics.co/wp-content/uploads/2019/11/cg-icon-150x150.png", "canonical": "https://geopolitics.co/2022/02/08/international-alert-message-about-covid-19/", "encoding": "UTF-8"}, "image": null, "domain": "geopolitics.co", "title": "International Alert Message about COVID-19", "cleaned_text": "We are health professionals of the international collective : United Health Professionals, composed of more than 1,500 members (including professors of medicine, intensive care physicians and infectious disease specialists) from different countries of Europe, Africa, America, Asia and Oceania and, on August 26, 2020, we addressed to governments and citizens of countries around the world an alert message regarding the COVID outbreak.\n\nFirst, let’s start with the conclusions of the 2010 report of the Parliamentary Assembly of the Council of Europe on the management of the H1N1 epidemic :\n\n« The Parliamentary Assembly is alarmed about the way in which the H1N1 influenza pandemic has been handled, ot only by the World Health Organization (WHO) but also by the competent health authorities at the level of the European Union and at national level. It is particularly troubled by some of the consequences of decisions taken and advice given leading to distortion of priorities of public health services across Europe, waste of large sums of public money and also unjustified scares and fears about health risks…grave shortcomings have been identified regarding the transparency of decision-making processes relating to the pandemic which have generated concerns about the possible influence of the pharmaceutical industry on some of the major decisions….unregulated or secret lobbying may be a danger and can undermine democratic principles and good governance ».\n\nKnow that the same mistakes made in the H1N1 epidemic are being repeated today in the COVID epidemic. You are the victims of the biggest health scam of the 21st century regarding the real danger of the virus, the measures to be taken, the figures, the tests and the treatments, and this was done with the same techniques of manipulation used during the epidemic of H1N1 or the Iraq war. Experts, professors of medicine as well as scientific and medical collectives began to alert others of this as early as March 2020.\n\nThe countries of the world (except rare cases like : Sweden, Belarus or Tanzania), without thinking, have only imitated and blindly followed others.\n\nThis epidemic is amplified, dramatized and instrumentalised by criminals who take advantage of it to achieve economic, political and ideological goals and agendas that are harmful to humanity and we will prove this to you. You must stop this global scam quickly (because it is a serious danger to your people and your country in terms of : health, economy, education, ecology and human rights) by immediately taking the following actions :\n\nRemove the following illegal, non-scientific and non-sanitary measures : lockdown, mandatory face masks for healthy subjects, social distancing of one or two meters. These crazy and stupid measures are heresies invented in 2020 that do not exist in medicine or public health and they are not based on any scientific evidence.\n\nThis is not how we manage an outbreak :\n\n– « The world went mad » with coronavirus lockdowns which « fly in the face of what is known about handling virus pandemics » (Dr Anders Tegnell, Sweden’s chief epidemiologist, June 24, 2020).\n\n– « The infection fatality rate seems to be about the same as for influenza, but we have never introduced these drastic measures before, when we had influenza pandemics. And we cannot live with them for years to come » (Prof. Peter Gøtzsche, December 1, 2020).\n\n– « The decision of lockdown as the decision of wearing masks…are not based on scientific data…» (Prof. Didier Raoult, June 24, 2020).\n\n– « The natural history of the virus [the coronavirus] is not influenced by social measures [lockdown, face masks, closure of restaurants, curfew, etc.]…The lockdown did not trigger the decrease in cases…As for the closure of restaurants which had very strict health protocols in place…of course, I have no way of defending it…it has not influenced the epidemic at all…The lockdown has not changed anything…» (Prof. Philippe Parola, December 3, 2020).\n\n– « There is no scientific evidence to support the disastrous two-metre rule. Poor quality research is being used to justify a policy with enormous consequences for us all » (Professors Carl Heneghan and Tom Jefferson, June 19, 2020).\n\n– « Grotesque, absurd and very dangerous measures…a horrible impact on the world economy…self- destruction and collective suicide… » (Prof. Sucharit Bhakdi, March 2020. He also sent, at the time, a letter to German Chancellor Angela Merkel).\n\nIn addition, these tyrannical measures violate the Universal Declaration of Human Rights in its articles: 3, 5, 9, 12, 13, 17, 18, 20, 26, 27, 28, 30 and the UNICEF Convention on the Rights of the Child in its articles : 28, 29, 32, 37.\n\n– « When the state knows best and violates human rights, we are on a dangerous course. The pandemic has led to the violation of basic human rights…There has not been the slightest ethical analysis of whether this was justified. It is not» (Prof. Peter Gøtzsche, December 4, 2020).\n\nForcing non-sick people to wear masks is not only a heresy but it is also harmful to health as well as to ecology and is a form of mistreatment :\n\n– « The curfew…was used during the German occupation when the militia and the Gestapo went to the houses. And now we’ll have the police making visits to see if there are more than six people at the table ! What is this madness ?! » (Prof. Christian Perronne, October 15, 2020).\n\n– « Every winter in Paris, the ICU beds are totally saturated. We transfer patients…every winter, in normal circumstances » (Prof. Bruno Mégarbane, anesthesiologist and intensive care physician, September 27, 2020)\n\n« In neither of the 2 waves… all the ICU were not saturated, it is false ! » (Prof. Michaël Peyromaure, January 18, 2021)\n\n3-Exclude your experts and advisers who have links or conflicts of interest with pharmaceutical companies\n\nThe 2010 report of the Parliamentary Assembly of the Council of Europe on the management of the H1N1 epidemic also said :\n\n« The Assembly calls on public health authorities at international, European and national level -and notably WHO-…to ensure that all persons subject to conflicts of interest are excluded from sensitive decision-making processes ».\n\nCountries’ experts who pushed for these totally heretical measures are either followers, ignorant or corrupted by the pharmaceutical industry.\n\n4-Require an international and independent investigation and that those responsible for this scam be tried\n\nOn October 1st, 2020, German lawyer Reiner Fuellmich announced that an international network of lawyers will argue the biggest fraud case ever :\n\n« The anti-corona measures have caused and continue to cause such devastating damage to the world’s population’s health and economy that the crimes committed by (…) the WHO must be legally qualified as actual crimes against humanity as defined in section 7 of the international criminal code ».\n\nHe said also that this must be called « a corona scandal and those responsible for it must be criminally prosecuted and sued for civil damages ». The investigation must focus, among others, on Bruce Aylward (WHO) and Neil Ferguson (ICL).\n\n-On January 10, 2021 : A letter relayed by The Sun and written by lawyers, a member of Parliament, human rights activists and a former US Air Force general was addressed to the FBI and MI-5 along with security services in Canada, Germany and Australia, where the authors say :\n\n« We are writing this letter to request that a federal investigation be commenced and/or expedited regarding the scientific debate on major policy decisions during the COVID-19 crisis. In the course of our work, we have identified issues of a potentially criminal nature and believe this investigation necessary to ensure the interests of the public have been properly represented by those promoting certain pandemic policies ».\n\nThe letter call which was « deliberately promulgated…to impoverish the nations who implemented it »\n\nRare countries like Sweden, Tanzania or Belarus -which can be congratulated- have refused the lockdown and have not blindly followed others and if we apply the reasoning of the lockdown defenders, the outcome must be a massacre or the saturation of their hospital system. Is this the case in these three countries ?\n\nThe answer is of course : no. Moreover, on September 15, 2020, The BMJ published an article entitled :\n\n« COVID-19 : How does Belarus have one of the lowest death rates in Europe ? ».\n\nThese three countries are living proof of the lockdown scam and since this reality might wake up public opinion and people see that they have been lied to, a corrupt press has been spreading, from the beginning, articles and even fake news, against Sweden and Belarus.\n\n« Stay home, save lives » was a pure lie. On the contrary, the lockdown not only killed many people but also destroyed physical and mental health, economy, education and other aspects of life. For example, the lockdown in the USA has killed thousands of Alzheimer’s patients who have also died far from their families. In the United Kingdom : the lockdown killed 21,000 people.\n\nThe effects of the lockdown « have been absolutely deleterious. They did not save the lives they had announced they could be able to save…It is a weapon of mass destruction and we see its health…social…economic effects…which form the real second wave » (Prof. Jean-François Toussaint, September 24, 2020).\n\n– « This country is making a dramatic mistake…What are we going to suggest ? That everyone stay locked up all his life because there are viruses outside ?! You’re all crazy, you’ve become all nuts !…we are setting the planet on fire » (Prof. Didier Raoult, October 27, 2020).\n\n– « It is a big delirium but which is instrumentalised by big pharma and also politicians…It is a fear organized for political and economic reasons » (Prof. Christian Perronne, August 31, 2020).\n\n– « It is just a global scam to make huge profits, bail out the banks and meanwhile ruin the middle classes in the name of an epidemic…made destructive by liberticidal, allegedly health measures » (Dr Nicole Delépine, December 18, 2020).\n\n– « We have medical evidences that this is a scam » (Dr Heiko Schöning, July 2020).\n\n– « Think about these two questions :…Is the coronavirus man-made ?…Have they tried to use this viral disease or this psychosis for their own ends & interests ?» (Alexander Lukashenko, President of Belarus). –\n\n« There is utterly unfounded public hysteria driven by the media and politicians. It’s outrageous. This is the greatest hoax ever perpetrated on an unsuspecting public….it should be known as nothing more than a bad flu season. this is not Ebola. It’s not SARS » (Dr Roger Hodkinson, November 13, 2020).\n\n5-No longer blindly follow the recommendations of the WHO and require that it be totally reformed\n\nAn investigation carried out in 2016 (WHO in the clutches of lobbyists) showed an edifying radiography of the WHO ; a weakened structure subject to multiple conflicts of interest. This investigation has shown how private interests dominate public health in the WHO. Another investigation (Trust WHO) also revealed these serious anomalies.\n\n6-Use the recognized measures for the management of epidemics\n\nSuch as recommendations of hand washing, sneeze or cough into the elbow, use a mask but only for patients and healthcare professionals (in specific situations), isolation of the sick, etc. The severity of an epidemic is assessed by the case fatality rate (CFR), among other things. However, the latter is very low (0.03-0.05%) and there is therefore no justification for taking measures that are not only disproportionate but also unscientific.\n\n7-Make the media aware of their responsabilities\n\nThe media must, for example, stop talking about the coronavirus.\n\nThe people who push for mandatory testing are defrauding governments and pursuing only economic goals. Nothing in this coronavirus (which is a benign virus and with a low CFR) justifies it. The flu infects one billion people each year, far more than SARS-CoV-2, spreads faster and has more populations at risk than this coronavirus and yet no test is required for travel. This is why Professor Didier Raoult called « a delirium » the claim that it is a serious illness and said, on August 19, 2020, that « it is not worse than the flu ».\n\n– « The infection fatality rate for this new coronavirus is likely to be in the same ballpark as seasonal influenza » (Prof. John Ioannidis, April 17, 2020).\n\n– « Reassure the large majority of the population that their risk of dying or getting severe disease from COVID-19 is very low » (Prof. John Ioannidis, April 22, 2020).\n\n– « Do you realize ? Today, we are destroying the economy whereas finally the figures are comparable with those we experienced with the flu ! » (Prof. Christian Perronne, October 25, 2020).\n\n9-Stop the vaccination campaigns and refuse the scam of the pseudo-health passport which is in reality a politico-commercial project\n\n– « We don’t need it [the vaccine] at all…All this is about purely commercial goals » (Prof. Christian Perronne, June 16, 2020).\n\n– « It is an old marketing principle of pharmaceutical companies : if they want to sell their product well, consumers must be afraid and see it as their salvation. So, we create a psychosis so that consumers crack up and rush on the vaccine in question » (Prof. Peter Schönhöfer).\n\n– « As a doctor, I do not hesitate to anticipate the decisions of the government ; we must not only refuse these vaccines [against COVID-19], but we must also denounce and condemn the purely mercantile approach and the abject cynicism which guided their production » (Dr Pierre Cave, August 7, 2020).\n\n– The COVID vaccine is « so, so unnecessary » (Prof. Sucharit Bhakdi, December 2, 2020).\n\n– « I have never seen in the history of medicine that we urgently develop vaccines to vaccinate millions, billions of individuals for a virus that no longer kills except people at risk that we can identify, that we can treat…I have never seen a vaccine coming out after 2 months !…it takes years ! » (Prof. Christian Perronne, December 2, 2020).\n\n– « We’re going too fast. If there was an emergency,…if today COVID-19 kills 50% of people, I will say let’s take risks…but here we have a virus that kills 0,05% and we will take all the risks ! I know there are billions behind this…Be carefull, this is very dangerous ! » (Prof. Christian Perronne, December 2, 2020).\n\nTo the question : « We do not need a general vaccine for the whole humanity with 0.05% deaths ? », Professor Christian Perronne replied : « It’s obvious ! ».\n\n-In November 30, 2020 : Professor Christian Perronne wrote a letter in which he alerted on the danger of the vaccines based on genetic engineering :\n\n« The people who promote these gene therapies, falsely called “vaccines”, are sorcerer’s apprentices and take…the citizens of the world for guinea pigs ».\n\n-On October 19, 2020, in a correspondence to the journal The Lancet, scientists expressed concerns and warned :\n\n« we are concerned that use of an Ad5 vector for immunisation against severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) could similarly increase the risk of HIV-1 acquisition among men who receive the vaccine ».\n\n-If people accept the COVID-19 vaccine, it will be :\n\n« a mistake because we risk having absolutely unpredictable effects : for example, cancers…We are playing the total sorcerer’s apprentice…Man must not serve as a guinea pig, children must not serve as guinea pigs, it is absolutely unethical. There must not be deaths from vaccines » (Prof. Luc Montagnier, Virologist and Nobel Prize in Medicine, December 17, 2020.\n\n-In Switzerland, a group of 700 doctors and health professionals called on January 15, 2021 for stopping the vaccination campaign\n\n– « I think it’s [the COVID vaccine] downright dangerous. And I warn you, if you go along these lines, you are going to go to your doom » (Prof. Sucharit Bhakdi, December 2, 2020).\n\n-On December 30, 2020 : Réaction 19 (a French association founded by lawyers with nearly 60,000 members) informed, in a press release, that it has filed a complaint concerning the Pfizer/BioNTech and Moderna “vaccines” for : deliberately endangering the life of others, aggravated deception, abuse of weakness and aggravated extortion.\n\n-Recently, several Members of the European Parliament have alerted the population because they are forbidden to consult the contracts signed with pharmaceutical laboratories. This opacity is a proof that there are compromising things they want to hide. Michèle Rivasi, a Member of the European Parliament, even lodged a complaint5. As a reminder6: in 2009, Pfizer was fined $ 2.3 billion, the largest fine ever imposed by the courts of the United States on a pharmaceutical group. It was found guilty of fraudulent commercial practices.\n\nIn 2010, AstraZeneca was fined 520 million euros for recommending unauthorized use of a drug. In 2011, Merck payed a fine of $ 628.36 million to resolve allegations of off-label marketing and false statements about the cardiovascular safety of a drug.\n\nIn 2013, a fine of 1.62 billion euros was imposed on Johnson & Johnson to resolve criminal and civil liability arising from allegations relating to the prescription of three drugs including promotion for uses not approved as safe and effective by the Food and Drug Administration (FDA) and payment of kickbacks to physicians and to the nation’s largest long-term care pharmacy provider.\n\nYou must stop this global scam where the politico-economic (even ideological) agendas of criminals are to COVID what the Iraq war was to the attacks of September 11th, 2001 (here’s a reminder of the scam of the Iraq war :\n\nThese criminals manipulate the countries of the world and want to make the epidemic last as long as possible to achieve their goals when the COVID epidemic should have been declared over at a certain period of the past year ; indeed, in medicine, the epidemic threshold from which the beginning and the end of an epidemic are declared is between 150 and 200 cases per 100,000 inhabitants. The Tanzanian president is one of the few presidents who understood this because he declared on June 8, 2020 that the COVID epidemic was over in his country.\n\n« The epidemic is over ! » (Professor Yoram Lass, July 2, 2020)7.\n\nIn this epidemic, the danger is not the coronavirus but the people who instrumentalise it and who are the real virus to fight.\n\nThe virus is completely innocent of what is happening (impoverishment, job losses, suicides, deaths, economic recession, unemployment, etc.) and the real culprits are those who have pushed the world to use these measures and the governments that continue to implement these measures despite alerts and warnings.\n\n« The World Bank has just estimated that the corona pandemic has caused an increase of about 100 million people living in extreme poverty. This is not because of COVID-19. It is because of the draconian measures we have introduced » (Prof. Peter Gøtzsche, December 1, 2020).\n\nThe discrepancy and disproportion between the level of dangerousness of the virus and the magnitude of the measures taken (which are moreover totally heretical) are so obvious that it inevitably leads to the conclusion that there are other objectives behind. You have to be really blind or naive not to see it.\n\nWith these measures which have nothing to do with medicine or science, governments are not fighting the dangers of the virus but are fighting the basic rights of their people and destroying their health, economy, education, ecology, culture and other aspects of life.\n\n« We have been living a kind of delirium from the start…We live in a world which is crazy :…the conditions that have been taken to fight this disease are conditions from another century…it is not even the level of the Middle Ages ! » (Prof. Didier Raoult, December 7, 2020).\n\nOn December 28, 2020, Randy Hillier, a Canadian MP, wrote this message on Twitter along with the hashtags : #We Are Living A Lie and #No More Lockdowns : « The lies and deceptions of Covid are over. How & why so many allowed themselves to be deceived will take years to uncover ».\n\nIt is not because the majority of countries are doing the same thing that it means that it is good or that it is the right thing to do. The number is not a criterion for knowing whether or not countries are right to apply these measures. On the contrary, many historical examples show that the majority is often wrong ; Iraq war (rare countries like France did not follow and were right), H1N1 (rare countries like Poland did not follow and were right), World War II, etc.\n\nThe charge of conspiracy theories is the response of those who have no arguments and a technique of mass manipulation because all what has been reported in this letter does not consist of theories but of truths and statements made by eminent experts including Nobel laureates for medicine.\n\nThis letter will be kept as proof that your government has been alerted. Everything must return immediately to normal and this global hostage-taking must stop because you have known that you have been the victims of the biggest health scam of the 21th century.\n\nPlease, don’t make the mistake of underestimating our letter or ignoring it. Here are 2 examples of what happens when a government makes this mistake :\n\nDespite warnings from several experts about the danger of Dengvaxia (dengue vaccine), the Philippine government decided in 2016 to launch a vaccination campaign that ended later in a public scandal. According to the office of the prosecutor Persida Acosta, 500 children died as a result of this vaccine and several thousand are sick.\n\nAccording to the prosecutor, the responsibilities are shared between the laboratory which sold “a dangerous vaccine” and the government which set up a “massive and indiscriminate” vaccination campaign, in deplorable conditions. This vaccine, however, promised to be a planetary triumph ; in 2015, Sanofi confirmed with great fanfare the marketing of a revolutionary dengue vaccine. It was a world first, the product of twenty years of research and 1,5 billion euros of investment.\n\nYet from the beginning, voices raised in the scientific community : Doctor Antonio Dans tried to warn about the inconclusive results of the first clinical trials. In the USA, Professor Scott Halstead, a world renowned specialist in the disease, even sent a video broadcasted in the Senate of the country to urge to suspend the vaccination program. The former health minister of the country has been charged in this scandal. « It’s the lure of profit that killed these children », said prosecutor Persida Acosta.\n\nThe second example is the scandal of the H1N1 vaccine which was bought by several countries despite alerts from Dr Wolfgang Wodarg, the chairman of the Health Committee of the Parliamentary Assembly of the Council of Europe, who in a motion for a recommendation entitled « Faked Pandemics – a threat for health » said : « In order to promote their patented drugs and vaccines against flu, pharmaceutical companies have influenced scientists and official agencies, responsible for public health standards, to alarm governments worldwide.\n\nThey have made them squander tight health care resources for inefficient vaccine strategies and needlessly exposed millions of healthy people to the risk of unknown side-effects of insufficiently tested vaccines ». He was totally right because, later, in Europe alone the vaccine made 1,500 victims of narcolepsy including 80% of children, so much so that on November 24, 2013, the Swedish Minister of Social Affairs, Göran Hägglund, said he was ready to publicly apologize to the victims of the swine flu vaccine.\n\nWe cannot tell you everything in this letter, that is why you must consult the following documents very carefully because everything you have been told is detailed and argued there, and because you will discover other things that you do not know and by which you will be even shocked :\n\nFor footnotes and references click here\n\nSee here for list of countries\n\nYou can actually participate in the global efforts to cripple the Deep State organized criminal cabal's ability for genocide, while enjoying healthcare freedom at the same time, by boycotting Big Pharma for good.", "opengraph": {"type": "article", "title": "International Alert Message about COVID-19", "url": "https://geopolitics.co/2022/02/08/international-alert-message-about-covid-19/", "description": "We are health professionals of the international collective : United Health Professionals, composed of more than 1,500 members (including professors of medicine, intensive care physicians and infec…", "article:published_time": "2022-02-08T03:52:48+00:00", "article:modified_time": "2022-02-16T06:04:40+00:00", "site_name": "Covert Geopolitics", "image": "https://geopolitics.co/wp-content/uploads/2022/02/nice-people.jpg", "image:width": "1440", "image:height": "966", "locale": "en_US"}, "tags": ["covid19 alert", "health professionals"], "tweets": [], "movies": [], "links": ["https://drive.google.com/file/d/1VGiArDJQC7KXjzWv0j9F5R5ONf20nsQK/view", "https://drive.google.com/file/d/1VGiArDJQC7KXjzWv0j9F5R5ONf20nsQK/view", "https://drive.google.com/file/d/1VGiArDJQC7KXjzWv0j9F5R5ONf20nsQK/view", "https://www.lci.fr/replay/video-le-brunch-de-l-info-du-dimanche-27-septembre-2020-2165685.html", "https://www.dailymotion.com/video/x7yr0oz", "https://www.thesun.co.uk/news/13718024/china-trick-world-into-lockdown-open-letterr/?utm_source=twitter&utm_medium=social&utm_campaign=sharebarweb", "https://www.illustre.ch/magazine/manquons-recul-face-aux-potentiels-effets-indesirables-vaccins", "https://twitter.com/j_bardella/status/1351932253576818690", "https://twitter.com/dupontaignan/status/1350095404474327047", "https://twitter.com/DocteurGonzo4/status/1351778258753355777", "https://www.france24.com/fr/20090903-le-laboratoire-pfizer-ecope-dune-amende-23%C2%A0milliards-dollars-", "https://www.lemonde.fr/economie/article/2009/09/02/une-amende-de-2-3-milliards-de-dollars-pour-pfizer_1235011_3234.html", "https://www.lemonde.fr/economie/article/2010/04/28/astrazeneca-ecope-d-une-amende-de-520-millions-d-euros-aux-etats-unis_1343983_3234.html", "https://lexpansion.lexpress.fr/actualite-economique/merck-debourse-pres-d-un-milliard-de-dollars-pour-solder-le-scandale-vioxx_1054000.html", "https://www.lequotidiendumedecin.fr/actus-medicales/medicament/amende-record-de-162-milliard-deuros-pour-le-laboratoire-americain-johnson-johnson", "https://www.facebook.com/261835320624052/videos/1240827799610762/", "https://drive.google.com/file/d/1VGiArDJQC7KXjzWv0j9F5R5ONf20nsQK/view", "https://www.globalresearch.ca/author/healthprof", "https://drive.google.com/file/d/1VGiArDJQC7KXjzWv0j9F5R5ONf20nsQK/view", "https://virutron.com/", "https://virutron.com/"], "authors": [], "publish_date": "2022-02-08T03:52:48+00:00"}