{"result_id": "083018", "URL": "https://geopolitics.co/2021/08/18/navy-commander-warns-of-national-security-threat-from-mandatory-vaccination/", "timestamp": "2023-04-25 14:51:21 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://geopolitics.co/wp-content/uploads/2019/11/cg-icon-150x150.png", "canonical": "https://geopolitics.co/2021/08/18/navy-commander-warns-of-national-security-threat-from-mandatory-vaccination/", "encoding": "UTF-8"}, "image": null, "domain": "geopolitics.co", "title": "Navy Commander Warns of “National Security Threat” from Mandatory Vaccination", "cleaned_text": "An officer with the U.S. Navy is warning of a full-blown “national security threat” if the military moves ahead with its planned universal COVID-19 vaccination mandate, in a paper obtained exclusively by Revolver News.\n\nIn a memorandum released on Monday, Biden Secretary of Defense Lloyd Austin announced his intention to require a COVID-19 vaccination for all service members by mid-September, or immediately should any COVID vaccines clear FDA approval (the vaccines are currently only authorized for emergency use). Servicemen who refuse to submit to the vaccine will potentially face court martials, prison time, and even less-than-honorable discharge from the service.\n\nIf that plan goes ahead, though, CDR J.H. Furman warns the results could conceivably be catastrophic.\n\n“The forced vaccination of all military personnel with the present COVID-19 vaccines may compromise U.S. national security due to the unknown extent of serious vaccine complications,” writes Furman. “Further study is needed before committing the Total Force to one irreversible experimental group. Initial reports leave more concern for the COVID-19 vaccinations than the virus itself for the (at present) exceptionally healthy military population.”\n\nFurman is a career United States naval officer, naval aviator, and foreign area officer with extensive experience advising senior military, diplomatic, and international organization leadership. The commander has spent years serving throughout Africa, Asia, Europe, the Middle East at sea, ashore and airborne. He also holds a Master of Arts in Security Studies from the Naval Postgraduate School.\n\nFurman’s paper is not long, weighing in at just two and a half pages plus an equally long list of citations. But he nevertheless hits all the key points for why imposing COVID-19 vaccines on the entire general populace is driven by hysteria, not real concern for saving lives or stamping out the virus.\n• The average member of the U.S. military is young and in excellent physical fitness, two categories that are nearly immune to the dangers of COVID. So far, only 24 people out of 2.2 million military personnel have died of COVID-19, a rate of less than one per 91,000.\n• There is reason to believe severe or even fatal side-effects from existing COVID-19 vaccines are more common than reported, and could even prove deadlier to otherwise-healthy servicemen than COVID-19.\n• There is also the outlier possibility that mRNA vaccines (the kind used by the Moderna and Pfizer shots) may have unanticipated negative effects on the immune systems of recipients.\n• Currently, the U.S. military has proven completely capable of weathering COVID-19 without any loss of effectiveness, so forcibly making the entire service a test case for a novel type of vaccine is a pointless risk.\n\nWe invite readers to read CDR Furman’s entire paper below, as brought to us by Revolver News…\n\nThe forced vaccination of all military personnel with the present COVID-19 vaccines may compromise U.S. national security due to the unknown extent of serious vaccine complications. Further study is needed before committing the Total Force to one irreversible experimental group.\n\nRecent reports leave more concern for the COVID-19 vaccinations than the virus itself for the (at present) exceptionally healthy military population, which is not appreciably impacted by the virus without vaccination.\n\nFirst, SARS-CoV-2 is unlike any other virus. We have yet to completely understand the virology and it is rapidly mutating. Second, the COVID-19 vaccines are all experimental. The world is simultaneously learning about this new technology amongst the largest vaccine rollout in human history.\n\nThe data on both the virus and vaccines are new and not yet scientifically reliable. Basic assumptions are changing with unprecedented levels of breakthrough cases in the vaccinated population. The U.S. military service member is extremely healthy compared to the general population and is not succumbing to the virus at any significant level, even without the vaccination.\n\nAccording to the CDC, “COVID overall has a 99.74% survival rate. Among young people, that number is even higher. For people aged 18 to 29, the survival rate is 99.97%.” As of August 12, 2021, only 29 (or 0.001%) of the 2.2 mil military population had expired from COVID-19.\n\nTo date, the vaccine is more seriously injuring this unique population than the virus itself. A Journal of the American Medical Association (JAMA) study finds 23 U.S. service members experienced post-vaccination moderate to severe myocarditis who were otherwise healthy and non-symptomatic.\n\nThere have been many other COVID-19 vaccine harm or death outcomes documented in the U.S. Government’s Vaccine Adverse Event Reporting System (VAERS). In fact, COVID-19 vaccine adverse events comprise a full one-third (over 500,000) of the three-decade total for all VAERS reports.\n\nPlus, the VAERS system is underreporting COVID-19 vaccine deaths by a factor of five, according to a whistleblower who is described in their court filing as a “[…] subject matter expertise in the healthcare data analytics field, and has access to Medicare and Medicaid data maintain by the Centers for Medicare and Medicaid Services (CMS).”\n\nThey attested that the 9,048 reported COVID-19 vaccine-related deaths in VAERS is more like 45,000, after reconciling the various databases.\n\nThe UK government agency Public Health England recently published a report showing that, “people who received the COVID-19 shot are more than three times as likely to die than those who have not received the vaccine.” Early signs in Israel indicate the same. Officials there recently reported that at least 85% of all severe and new COVID-19 hospitalizations are prior vaccinated individuals.\n\nThe inventor of m-RNA technology, Dr. Robert Malone, recently disclosed that “[…] new data indicates that people who have taken the Pfizer and Moderna vaccines are at greater risk of getting Covid than someone who is not vaccinated.”\n\nThe Johnson & Johnson and AstraZeneca vaccines also demonstrate significant problems as compared to the negligible military COVID-19 mortality rates. In the European Union (EU), more than 22,000 vaccination-associated deaths are now documented in the EU drug adverse events database. Which caused Doctors for COVID Ethics (an international doctors group from over 30 countries) to conclude on July 9, 2021 “[…] the benefits of vaccination are highly doubtful. In contrast, the harm the vaccines do is very well substantiated […]” Vaccine-enhanced herd immunity is in question.\n\nOn August 3, Iceland’s Chief Epidemiologist announced that their 95% nation-wide full vaccination rate, “[…] has not led to the herd immunity that experts hoped for. In the past two to three weeks, the Delta variant has outstripped all others in Iceland and it has become clear that vaccinated people can easily contract it as well as spread it to others,”\n\nThere is precedence for vaccine failure in respiratory viruses as noted in the journal Nature Microbiology last September, “Data from the study of SARS-CoV and other respiratory viruses suggest that anti-SARS-CoV-2 antibodies could exacerbate COVID-19 through antibody-dependent enhancement (ADE), resulting in failed vaccine trials.”\n\nEvidence suggests ADE could cause viral interference and along with other (influenza) vaccines alter our immune systems non-specifically to increase susceptibility to other infections. The mRNA vaccines may redirect our cells away from suppressing latent immunity issues from previous infections (e.g., chicken pox).\n\nConsider along with what Dr. Malone describes as an “entire population [that] has been trained via a universal vaccination strategy to have the same basic immune response, then once a viral escape mutant is selected, it will rapidly spread through the entire population – whether vaccinated or not.” It could mean massive problems ahead for the global COVID-19 vaccinated as they encounter variations and even simple viruses like the flu, in combination.\n\nNatural immunity already possessed by the military population recovered from COVID-19 is effective against all known variants and also likely durable over time, according to Dr. Peter A. McCullough, who is regarded as one of the most credentialed experts on COVID-19 in the U.S.\n\nThis past January, the journal Nature published that greater than 95% of COVID-19 recovered people have “[…] durable memories of the virus […]” There is precedence here, as well, with SARS-CoV-1 demonstrating 17 years of natural immunity. A Cleveland Clinic study concluded, “Individuals who have had SARS-CoV-2 infection are unlikely to benefit from COVID-19 vaccination […]”\n\nAnother recent Israeli study questions “[…] the need to vaccinate previously-infected individuals […]” after comparing re-infection rates for the vaccinated and recovered segments of the country’s national health database.” Dr. McCullough strongly asserts that the current vaccination programs have become dangerous and should be shut down immediately – that mass vaccination programs in the middle of a pandemic actually causes the variations, making the entire vaccinated population vulnerable to those same variants.\n\nCurrently, about 50% of all active and reserve service members have yet to receive a COVID-19 shot of any type. Based on recent reporting data supported by published research findings, this paper argues that instead of lumping two very large unknowns (COVID-19 virology & vaccine efficacy) into one experimental group — possibly threating U.S. military personnel combat readiness — the DOD should maintain the “unvaccinated-half” as a force protection CONTROL GROUP, thus guarantying a viable fighting force.\n\nSimilar safeguards should also be considered for the civilian DOD population to support the Warfighter, regardless of the long-term vaccine verdict.\n\nGiven the COVID-19 mortality in the military, the U.S. can presently maintain the nation’s defensive manning levels, in all critical fields. Pressing forward against these extremely large unknowns by mandating COVID-19 vaccines could potentially threaten basic military deployment assumptions, to say nothing of the long-term destruction to morale and recruiting.\n\nIf it is true that the military is, in fact, essential to national survival thereby justifying massive budgets and sweeping measures to protect the Force, then deciding to gamble the entirety of those vital forces on what little is certain, is reckless at best. To do so given such low demonstrated serious outcomes in the unvaccinated Force could prove fratricidal.\n\nWith a better than 99.74% COVID-19 recovery rate in the military population, the singular act of stopping the present vaccination drive, thus preserving a force protection CONTROL GROUP, could prove existentially critical to the country. Immediately, cease and desist all coerced COVID-19 vaccination initiatives for service members and civilians (except for any remaining co-morbidity groups).\n\nMoreover, the force protection CONTROL GROUP should commence harmless alternative and preventative protocols like I-MASK+ currently used in nations around the world with great efficacy. According to the American Journal of Therapeuticsin their May-June 2021 issue “Multiple, large ‘natural experiments’ occurred in regions that initiated ‘Ivermectin distribution’ campaigns followed by tight, reproducible, temporally associated decreases in case counts and case fatality rates compared with nearby regions without such campaigns.”\n\nBottom line, the known science does not justify committing the entire U.S. troop strength to one singular experimental group. Given the many unknowns and what we have come to learn most recently, mandatory COVID-19 vaccination may not only be rash, but perhaps become life-threatening to the nation vis-à-vis those dedicated to her defense, against very well-known strategic competitors.\n\nSimply, COVID-19 forced-inoculation could prove to be a grave national security threat at a time when the nation can least afford it. We must immediately pause and reevaluate the U.S. defensive strategic assessment of COVID-19 vaccinations for the entire Department.\n\nThere is absolutely no imperative of ‘benefits outweighing the risks’ to continue with mandating the COVID-19 vaccines to the military population who do not self-elect. Doing so could potentially trigger manning shortfalls brought on by resignations and lost enlistments from this all-volunteer armed force.\n\nAt this time, there is more than enough justification for a COVID-19 vaccination safety standdown to reconsider how the decision to mass vaccinate will critically impact overall mission effectiveness.\n\nCommander Jay Furman is a career United States naval officer, naval aviator and foreign area officer with extensive experience advising senior military, diplomatic, and international organization leadership. The Commander has spent years serving throughout Africa, Asia, Europe, and the Middle East at sea, ashore, and airborne. He holds a Master of Arts in Security Studies from the Naval Postgraduate School.\n\nYou can actually participate in the global efforts to cripple the Deep State organized criminal cabal's ability for genocide, while enjoying healthcare freedom at the same time, by boycotting Big Pharma for good.", "opengraph": {"type": "article", "title": "Navy Commander Warns of “National Security Threat” from Mandatory Vaccination", "url": "https://geopolitics.co/2021/08/18/navy-commander-warns-of-national-security-threat-from-mandatory-vaccination/", "description": "An officer with the U.S. Navy is warning of a full-blown “national security threat” if the military moves ahead with its planned universal COVID-19 vaccination mandate, in a paper obtained exclusiv…", "article:published_time": "2021-08-18T04:09:30+00:00", "article:modified_time": "2021-08-24T18:05:53+00:00", "site_name": "Covert Geopolitics", "image": "https://geopolitics.co/wp-content/uploads/2021/08/Mandatory-vaccine.webp", "image:width": "1920", "image:height": "1080", "locale": "en_US"}, "tags": ["national security", "military vaccination"], "tweets": [], "movies": [], "links": ["https://media.defense.gov/2021/Aug/09/2002826254/-1/-1/0/MESSAGE-TO-THE-FORCE-MEMO-VACCINE.PDF", "https://taskandpurpose.com/news/military-troops-refuse-mandatory-covid-vaccines/", "https://www.icelandreview.com/society/covid-19-in-iceland-vaccination-has-not-led-to-herd-immunity-says-chief-", "https://virutron.com/", "https://virutron.com/"], "authors": [], "publish_date": "2021-08-18T04:09:30+00:00"}