{"result_id": "083031", "URL": "https://geopolitics.co/2022/04/02/mckinseygate-frances-shadow-government-the-rise-of-the-corporate-state/", "timestamp": "2023-04-25 14:51:30 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://geopolitics.co/wp-content/uploads/2019/11/cg-icon-150x150.png", "canonical": "https://geopolitics.co/2022/04/02/mckinseygate-frances-shadow-government-the-rise-of-the-corporate-state/", "encoding": "UTF-8"}, "image": null, "domain": "geopolitics.co", "title": "McKinseyGate: France’s Shadow Government & the Rise of the Corporate State", "cleaned_text": "In France, consultancy firms have been paid billions of euros to advise governments on policies from the coronavirus vaccine, to climate change, and vaccine roll-out, as well as digital transformation, according to a new report released by the French Senate. While the financial sums are staggering, the real scandal is the level of influence on policy that these shadowy corporate actors wield deep inside the halls of government.\n\nThe revelations contained in this report are extraordinary, and expose the inner workings of the highest echelons of the French state, in what can only be described as the near-complete corporate capture of the bureaucracy.\n\nThe findings of the Senate report have since been adopted unanimously by committee members on March 16, and will be translated into a legislative proposal, and a trans-partisan bill which has already been announced.\n\nWhat has been revealed is breathtaking, and opens the door to what could be one of the most consequential scandals in decades.\n\nSummary report of French Senate Commission Inquiry into the Growing Influence of Private Consulting Firms on Public Policy\n\nThis article will not only examine the corporate takeover of whole governmental departments, but it will also look at the risk-benefit analysis of government in its liberal use of consultancy services, and outline the danger that lies with such Public Private Partnerships. It will also provide concrete evidence of consultancy firms’ deep and problematic business ties with the Executive Branch of the French Government.\n\nIt is important to examine how these powerful consultancy firms underpin a much larger transnational network. This raises a number of important questions: what is the likelihood of conflict of interest taking place, and do they represent a danger to countries’ national security? Are elected officials and civil servants taking a back seat to non-elected private individuals and their companies who are being allowed to steer public policy in favor of a much broader transnational corporate agenda?\n\nAfter a four-month parliamentary inquiry looking into lucrative contracts granted to consultancy firms like Accenture, Bain & Company, Boston Consulting Group (BCG), Cap Gemini, Deloitte, Eurogroup, EY, McKinsey & Company, PwC, Roland Berger, and Wavestone, the French Senate Commission has released its findings – and the outcome is rather damming. The inquiry was lead by senators and the French government opposition bench.\n\nThe use of consultancy firms by the French administration has more than doubled since the beginning of Macron’s five-year presidential mandate. According to the Senate commission report, a noticeable 45% increase in 2021 has been identified, some of which can be attributed to the Covid-19 pandemic.\n\nMany serious questions and findings have emerged from the Senate committee inquiry report, including the likelihood that Karim Tadjeddine, an Associate Director at McKinsey & Company, may have perjured himself during a Senate hearing when according to Senator Éliane Assassi he claimed under oath that McKinsey was paying taxes in France.\n\nDespite McKinsey being awarded many contracts in France, the commission investigation into this matter, with the help of the government budget department, will reveal that McKinsey has not paid any taxes in France for at least 10 years. How can this be?\n\nIn a press conference, Eliane Assasi described the government use of these consultancy firms as a “reflex” and outlined how these companies are embedded at the highest level within the government, and integrally involved in most of the major government reform projects, including the pension reform scheme, the housing benefits reform, and several key aspects of the government’s economic recovery plan.\n\nThe conclusion of the 350-page report is very alarming. Naturally, the people of France want answers.\n\nFollowing the 2007 election of President Nicolas Sarkozy, the use of consultancy companies became a phenomenon with firms like McKinsey, Deloitte, Cap Gemini, BCG, and Accenture securing deals worth about €250 million during his tenure. Firms sought to create a growth market with government growth drivers, in order to compensate for the slump in the business sector.\n\nUnprecedented levels of payments to firms like McKinsey are part of a much broader budget which was allocated by the French government to hire consultancy firms to assist in the design and implementation (including operational) of public policy projects in support of the DITP (inter ministerial directorate for public transformation) and the inter ministerial digital directorate (DINUM), and the modernization of all their departments.\n\nMore alarming is the fact that such companies were hired to work directly on legislative reforms. While these firms may claim that their quest to secure lucrative government contracts is not motivated by financial gain, but rather as an investment in a Public Private Partnership, the reality is that this is a form of lobbying which ensures that numerous high-level government officials are well looked after as they eventually return to the corporate world for a few years holding top position in French CAC top 40 companies, before returning to the political scene. This ‘revolving door’ between government and the consultancy industry is where the real money is made for consultancy firms and their directors. In reality, only 5% of McKinsey revenues are generated in the public sector, the rest is secured with large corporate accounts. However, the back and forth between the public and private sector is so well established that the French have given it a name: “Pantouflage.”\n\nThe so-called “Pantouflage” has increasingly been at the centre of many scandals in France; government officials’ constant incestuous back-and-forth between the corporate world and government has gradually eroded away at the foundations of democracy, allowing all forms of conflicts of interest to take place. Of course, we can accept the fact that politicians do have, at some stage, to go back to work in the private sector – which is not a crime in itself, but returning to the political stage afterwards shouldn’t even be an option.\n\n\n\n“Pantouflage” is where a senior civil servant leaves their post with the state and joins a private company, an example of institutional elite corruption.\n\nWithin the context of the COVID-19 pandemic, we can see governments around the world resorting to a reliance on high-powered consultancy firms to formulate and implement vaccination strategies, the controversial roll-out program, and its associated procurement and logistics.\n\nIn the United States, McKinsey secured $19.3 million worth of contracts which turned out to be a mere down payment, as 10 days later the US Defence Health Agency added more funding – bringing the VA Contract’s value to an excruciating $22.5 million, and all this in just the first months of the pandemic, according to investigative site ProPublica.\n\nAs for the United Kingdom, the bills of the Boston Consulting Group aka BCG, were amounting to £10 million – for 40 people to work on the government’s Covid testing program. Consultants’ fees were estimated at £6,250 a day over the course of four months, according to a report in the Guardian.\n\nIt’s important to note here the hundreds of millions of euros which privileged corporate suppliers netted from these unprecedented testing, track and trace apps, PPE, and vaccination programs – with foreign consultancy firms embedded at the very center of the government process for the selection and awarding of these super contracts.\n\nAmong the German market’s top performers are Boston Consulting Group and Bain & Company who posted their best years ever during the pandemic. €550 billion was allocated to protect the economy from the effects of the novel coronavirus in Germany according to DEVEX Interactive dashboard which keeps track of where such funding is going, who is supplying the money, and the strategic focus for the funding.\n\nAs reported by Consultancy.eu in March 2020, a strong growth in Europe’s largest consulting markets had lifted the continent’s consulting industry to a record high turnover of $45 billion during this period, with European consultancy powerhouses France and Germany leading the way.\n\nDuring the ‘public health’ crisis, the call for employing more consulting firms was not only limited to the first wave of the Covid pandemic, a period when the State was seen to be unprepared, and when Europe appeared to be surprised by the scale of the alleged contagion. However, the use of private consultants continued throughout the duration of the crisis. Enter McKinsey, who was drafted in to intervene by sorting out all the logistical organization and monitoring of France’s national vaccination campaign, spanning from November 2020 to February 4, 2022. The new ‘McKinsey cabinets’ were seen to have lent a hand to the State on the key aspects of the crisis, and they are still in charge today.\n\nThe Senate reports also indicate that Accenture intervened to direct the implementation of information systems such as the vaccination passport or a French ‘pass sanitaire’ (which is a version of the new EU Digital Covid Certificate), whilst consultants Citywell advised the State on the supply and management of PPE equipment like masks, from March to October 2020.\n\nAccording to a report filed by Mediapart (independent French online investigative journal) Accenture has been selected to make €800 million euros in savings on state services, for a mission whose amount is estimated at €25 million euros, according to the investigation. Not surprisingly, McKinsey managed to obtain the second part of that market whose mission was meant to achieve savings across 484 public institutions for a minimum amount of savings estimated by Bercy at €200 million euros. The Senate report discloses some 68 orders placed by the State with various consultancy firms, for a total amount of €41.05 million Euros in fees. According to the senators, based on the billing practice of five consultancy firms, they were able to determine that individual consultants were billing the French government an estimated €2,168 per day.\n\nIn 2021, more than €1 billion euros minimum in consulting expenditures for ministries and public operators was recorded (bearing in mind the Senate Inquiry investigated only 10% of the French public operators). The question remains: where did this money go, and what do we have to show for it? What was the noticeable impact on all of these supposed government cost reduction strategies?\n\nConsider the following: whilst the United States is asking McKinsey to pay a compensation of $573 million to settle a dispute over their involvement in the disastrous opiates scandal, the French government is hiring McKinsey to run its national vaccine roll-out.\n\nIt is only fair for us to question the reasons why such an astounding amount of taxpayers money has been allocated to these well-connected firms, and McKinsey in particular (taking in roughly €250,000 euros per working week, €50,000 euros per day) to do a job our Ministry of Health is more than well-equipped to undertake. Is the French state now ConsultoDependent?\n\nThe problems do not end there. Several elected officials suspect serious conflicts of interest and close ties between certain consultancy firms and members of the government, including President Emmanuel Macron himself, who is suspected of such ties.\n\nIndeed, there were links during the presidential campaign between Macron and McKinsey – as evidenced in a report from French media outlet LeMonde, which published an explosive article where we learn how Macron’s campaign program was written “for free” by 20 McKinsey employees.\n\nEliane Assassi (rapporteur) and Arnaud Bazin (President) of the Senate Commission inquiry reminded every one of their conclusion, that the purpose of their inquiry was not to question the use of private consulting firms, but to first assess its relevance, and to document any interference by private consulting firms into the formation of public policies. Their goal is to put an end to the opacity that surround the relationship between consultancy firms and our government.\n\nBreakdown of consulting expenses during the health crisis\n\n(excluding Public Health France and in millions of Euros)\n\nWhat was McKinsey’s role in France’s vaccination strategy?\n\nLogistics Organization – Study of logistics scenarios for the distribution of vaccines, monitoring of deliveries, stocks, injections and appointments\n\nIndicators & Monitoring Tools – Daily production of performance management indicators of vaccine campaign, follow-up of a register of around 250 key actions and decisions\n\nSector AnalysisRequested by the Ministry of Health – Action plan for the 3rd dose recall campaign, update on the overseas territories in the summer of 2021\n\nProject Management – Preparation of meetings, support for the restructuring of the “vaccines” task force\n\nThe Senate conclude their report by accusing the French subsidiaries of the US-based McKinsey & Company of tax avoidance, and the complaint has now been forwarded to the public prosecutor.\n\nMcKinsey’s French turnover reached €329 million euros in 2020, of which around 5% is in the public sector, and it employs around 600 employees based in the country, and yet for more than 10 years they have never paid corporate taxes in France.\n\nFrench Heath Minister Olivier Véran was interviewed in February 2022 by the Senate committee on the overuse and potential influence of consultancy firms such as McKinsey – who appear to control the key decision-making mechanisms relating to France’s vaccination strategy (and other French strategic areas).\n\nWho is McKinsey in France?\n\nThe company, nicknamed “The Firm,” apparently doesn’t like the spotlight, yet it is located on the Champs above a shopping mall, with a breathtaking view of Paris. It has long been regarded as a company that cultivates secrecy over its 100-year history following its founding in the United States. As a World Economic Forum (WEF) partner, McKinsey is a consulting firm for CAC40 French stock market bosses, heads of state, and government ministers.\n\n\n\nOn its website, the company says it is “committed to the decisive transformations of its customers” and “Improving the World.” Digital transformation is the path Macron’s government took from 2017 onward, which appears to be streamlined with the WEF agenda known as the “Great Reset,” and whose coffee table publication can be found on many world leaders’ presidential desk. It only stands to reason then that Macron’s grooming as a WEF Young Leader in Davos, Switzerland will have some influence on the direction which such sweeping government initiatives are taken.\n\nHow was McKinsey able to escape the French tax authorities?\n\n“McKinsey is indeed subject to corporation tax in France, but its payments have been zero euros for at least 10 years”, said the Senate Commission Inquiry into the “Growing Influence of Private Consulting Firms on Public Policy.”\n\nThe documents the commission reviewed relate to the period spreading between 2011 and 2020, and concern “the two main McKinsey entities registered in France: McKinsey & Company Inc. France and McKinsey & Company SAS”.\n\nMcKinsey uses a ‘tax optimization’ mechanism popular with many multinationals: the declaration of the “transfer prices” of its entities in France to the parent company based in the state of Delaware, a registered tax haven in the US. The firm ensures that many expenses such as general administration costs or the provision of personnel appear as expenses in the company’s annual accounts, and allows it to reduce its corporate taxes to zero.\n\nIn a July 2019 article by Politico, we learn that, “For the past four years, the powerhouse firm McKinsey and Co. has helped restructure the country’s spying bureaucracy, aiming to improve response time and smooth communication” at key agencies such as the CIA, the National Security Agency (NSA) and the Office of the Director of National Intelligence. In this article, an insider revealed how McKinsey’s “efforts have hindered decision-making at these agencies,” further describing McKinsey’s efforts as a collosal waste of time and money.\n\nAs for France, the question is whether or not McKinsey could also be used as a back door for the US intelligence agencies to gather political and economic intelligence, or influence or steer France’s political, commercial or foreign policies.\n\nMatthieu Aron and Caroline Michel-Aguirre co-author of the book “Les infiltrés” published a must-read in order to understand how these consultancy firms have now seized control of the State.\n\nAron recently commented, “It is this firm [referring to McKinsey] that piloted the vaccination strategy in France. Dozens of consultants arrived at Public Health France [Ministry of Health] and took the place of civil servants, and decided how to organize this vaccination roll-out across the country. This has never happened before, why now?”\n\nHe also points out how McKinsey, a US firm, has been awarded a strategic mission by the French Ministry of Defence – triggering new alarm bells from the national security community This has been an issue of great concern as it exposes our national security structure and defence strategies to completely unaccountable foreign agents.\n\nWe must question the nature of all these contracts, including why and how they were awarded. Therefore, it is extremely difficult to overlook the fact that McKinsey’s Associate Director Karim Tadjeddine, the man responsible for the public services contract – is a long time close colleague of French President Emmanuel Macron.\n\nAs it turns out, the pair have known each other for a very long time, and are likely close friends. Tadjeddine even co-wrote a book prefaced by Emmanuel Macron, and was also very deeply involved in Macron’s 2016-2017 presidential campaign.\n\nMatthieu Aron added in an interview he gave to Léa Salamé on France Inter in Feb 2022:\n\n“What we these consultancy forms fingerprints in all our ministries, including the Armed Forces, Health or Education sector, and that can no longer be ignored? How can the government justify €496 000 euros spent for a report on “the evaluation of the future profession of teacher” or €235,000 euros for “a guide to teleworking”. It has become systematic that the State can no longer do anything on its own without asking for a report.”\n\nOutcomes and takeaways from such reports are extremely arguable and rightly so. Hence, many French citizens struggle to see any benefits.\n\nBut what exactly are these consultants actually selling?\n\nBroadly, they are selling the wholesale transformation, reset and replacement strategies for ministries, under the guise of supposedly saving money and helping the administration by ‘remaining a competitive service provider.’\n\nGabriel Attal, Macron’s government spokesperson, confirmed on the 18th March 2022 during an interview on BFMTV that they were planning to reduce their consultancy envelope and create an internal government lead consultancy desk, again claiming this was an effort to reduce cost.\n\nThe ‘Consultancy Advisory Desk’ project is being led by Amelie de Montchalin, the French Minister of Transformation and Public Service, whose husband just happened to have spent 10 years in the consulting industry, at the Boston Consulting Group’s Paris offices. Another coincidence?\n\nFollowing April 2016 when Emmanuel Macron launched his political movement “La Republique En Marche,” barely two months later, Guillaume de Montchalin, then principal and now partner of the Boston Consulting Group, proposed in June 2016 to the young team of En Marche, that Emmanuel Macron take part in one of its “Office Fridays.” The exchange was organized between the staff of the firm, and prominent personalities (high-level entrepreneurs, philanthropists, and politicians).\n\nAccording to a “Consultor “article, the request was addressed to one Stéphane Charbit, a person close to the campaign and current managing director at Rothschild Bank, Stéphane Charbit, who then supported him with Cédric O, the treasurer of En Marche at the time – who is now Secretary of State for digital transformation. Knowing Macron was trained and groomed in the mergers & acquisitions branch of the Rothschild Bank, one might wonder if the bankers wanted to keep a tab on their very promising presidential candidate, or simply monitor their investment.\n\nThis is not merely a sign of interest from strategic consulting firms. Guillaume Kasbarian, then manager at PMP consultancy and former consultant at Monitor, remembers being among the “first 100 people to join” Macron’s campaign.\n\n“I was behind Emmanuel Macron from day one,” said Kasbarian.\n\nAs it turns out, in 2016, McKinsey’s Karim Tadjeddine and Emmanuel Macron were both prominent members of the Board of Directors of “En Temps Réel” (In Real Time), a high-level French technocracy think tank which was presided over by EURO NEXT CEO Stéphane Boujnah until September 2016. From August 2014 to August 2016, Macron was France’s Minister of Economy & Industry & Digital Affairs before assuming the presidential office on the 14 May 2017. Is this incredible timetable a coincidence?\n\nWho is this mysterious McKinsey firm, which accompanies Macron from the creation of his political party “En Marche”, to France’s national vaccination strategy?\n\n\n\nThe first meeting of Emmanuel Macron and McKinsey & Co in 2007\n\nThe links between Emmanuel Macron and the McKinsey firm date back to 2007. Emmanuel Macron, then finance inspector, was just 29 years old. At this point he became deputy general rapporteur of the “Commission for the Liberation of French Growth,” known as the Attali Commission, named after its leader, political scientist and economist Jacques Attali, regarded as a central actor in the French deep state, whose role was to propose economic reforms to then President Nicolas Sarkozy on how to modernise the government and make it ‘more efficient.’ Macron impressed the audience whose members included Éric Labaye, a veteran of Macron’s Promotion X(for those who know) and then director of McKinsey in France.\n\nA former member of the Attali Commission was interviewed by Le Monde who said:\n\n“We met in the evening until midnight in a room in the Senate with Attali and Macron. In the public seats, there were three or four young people from McKinsey. They were doing simulations on Excel. Their leader was so brilliant that people listened to him as if he were a full member. Their manager was a man called Karim Tadjeddine.”\n\nThis series of events was definitely not a coincidence.\n\nThe Great Revolving Door: From McKinsey to Ministries\n\nThe relationship between Macron and McKinsey go even deeper.\n\nAnother close collaborator of Emmanuel Macron is Éric Labaye (image, left), a former Senior Partner at McKinsey & Company, and chairman of the McKinsey Global Institute known as MGI; a strategic arm of the firm’s global economic research. Labaye was also the Director General of McKinsey France in 2002.\n\nÉric remained with McKinsey until the 16th Sept 2018. Once Emmanuel Macron was elected in 2017, young consultants from McKinsey were already surrounding the new President, since they had played a crucial role in putting him into office.\n\nMcKinsey partner Labaye was also Director General of Macron’s La Republique En Marche, and was eventually appointed President of Polytechnique by the Council of Ministers in August 2018 (basically appointed by Emmanuel Macron). Polytechnique is France’s most prestigious engineering school. Perhaps Éric’s job was done – McKinsey was embedded inside the government for good, and Éric was rewarded for it with this highly coveted appointment (another scandal on its own, but I am going to skip this for now as I want to stay on track).\n\nHere we have a diagram of Macron’s connection with McKinsey, but also the connections between McKinsey and other governmental institutions in France and beyond.\n\nConsidering all of this, it wasn’t much of a surprise when the French senate commission eventually decided to launch a 4-month inquiry on McKinsey’s influence in the French state’s affairs.\n\nThe diagram above is the reason why the Senate talks about ‘sprawling connections’ when speaking of McKinsey in France. It seems that if the CIA had planned to infiltrate the French government (regardless of whether or not it had done this already), it is now very clear that McKinsey would be their ideal point of entry.\n\nThe influence of McKinsey on public policy, as well as their motives – is truly in question at this stage, and the people of France are growing restless, and now they want answers.\n\nThus, McKinseyGate, along with the preliminary conclusions of the Senate inquiry is a State scandal andheads are expected to roll.\n\nAnother example of a flagrant conflict of interest is Victor Fabius, son of Laurent Fabius, President of France’s Constitutional Council, a crucial institution whose role is to shield the French citizenry from government misuse of power. Incredibly, Victor also just happened to work for McKinsey – the very same company pushing the Covid vaccine roll-out – despite a massive push-back from millions of French people, including 300,000 caregivers and medical staff coerced into taking the controversial vaccine in order to keep their job, and much more. Oddly, The Constitutional Council was a no-show during the approval process of Macron’s relentless pandemic emergency bills, despite the fact that such bills were deemed by many legal experts to be unconstitutional in France, and also in the EU.\n\nIt’s important to reiterate that none of McKinsey’s people are elected officials in France, and so the question is why should they have a say in our country’s immunization policy, or housing policies, or any fundamental public policy issues in France?\n\nWe are now seeing a vivid and highly disturbing picture emerge with McKinseyGate: under the auspices of the innocuous-sounding ‘Private Public Partnership,’ we can now see the formation of a shadow government in France – a veritable foreign corporate fifth column firmly installed inside the French government structure.\n\nBack when Macron created his political party En Marche in April 2016, that summer, working groups had already been set up with no less than a dozen McKinsey employees lined up for consideration on proposals for the economy or major sovereign issues reported journal Le Monde. At the same time, Macron was seen organising a “big march” in France to symbolize the collection of grievances of the French. A former McKinsey, Guillaume Liegey, one of the notorious “Bostonian Three” who took part in Barak Obama’s 2008 presidential campaign, was responsible for collecting and processing the data. McKinsey then formatted the report. Emmanuel Macron’s official presidential candidacy was then announced on November 16, 2016.\n\nPrior to Emmanuel Macron’s election, each ministry was responsible to organize their own tenders, but Macron didn’t waste any time in launching his ‘reform’ of the State’s bureaucratic structures, and created an inter-ministerial Directorate for Public Transformation (DITP) whose role was to supervise all missions commissioned by the State from private firms in order to prevent any dominant position of any one consulting firm. It was in this particular context that the French vaccinial strategy was awarded to McKinsey & Co.\n\nMcKinsey’s embedded operative for the DITP contract at the time was none other than Karim Tadjeddine, the leader who had so impressed the Attali Commission, and who today finds himself at the centre of a new state scandal in France.\n\nFunny how it took a Senatem Commission inquiry to find out that the head office of McKinsey & Company France is not registered in Paris – but in the United States, and in a tax haven state called Delaware. How convenient!\n\nBy now, it would not surprise many in France if McKinsey has in fact been working relentlessly in pushing along the rapid implementation of the World Economic Forum and Klaus Schwab’s “Great Reset” in France, as McKinsey was allowed by our own government to infiltrate the very heart of the French administration and judiciously placed at the helm of our vaccination strategy, as well as other strategic projects in areas like education and defense.\n\nWas it Macron who chose McKinsey, or McKinsey who chose Macron?\n\nApart from Guillaume Liegey, Arthur Muller (currently CEO and co-funder eXplain) and Eric Labaye which we have already mentioned above, we must take a look back at April 2016, the date of the creation of Emmanuel Macron’s party, En Marche, in which a dozen employees of McKinsey France were involved including senior and junior consultants who took part in fundraising dinners for Macron’s campaign in 2016 and 2017, from London to Paris, and from Madrid to Brussels.\n\nWho else had a McKinsey background?\n• Mathieu Maucourt deputy director of the secretary’s office Digital State, comes from McKinsey\n• Ariane Komorn head of the LREM project department (La Republique en Marche Macron’s political party), comes from McKinsey\n• Paul Midy general manager of LREM (La Répulique en Marche), comes from McKinsey\n• Martin Bohmert, the former youth president with Macron, joined McKinsey in 2020\n• Guillaume de Ranieri, leader of Aerospace and Defense at McKinsey & Company\n• Maël de Calan, Associate partner at McKinsey since 2018 former financial director of the biotech ManRos\n\nMathieu Maucort, former project manager at McKinsey, is undoubtedly the most significant example of this phenomenon. He was in charge of communications strategy in 2017 at En Marche before becoming Mounir Mahjoubi’s chief of staff at the State Secretariat for Digital, a position he still holds.\n\nThe relentless movement between En Marche and the state council is also a two-way street. Some who were not strategy consultants became so after May 2017. Additional proof of the compatibility between the two worlds: the arrival, announced at the end of September, of Emmanuel Macron’s former adviser, Ismaël Emelien, as a consultant in strategy, specifically in the environmental sector, with business magnate Bernard Arnault, is a shining illustration of this. I will stop here for now, as I believe I have illustrated my case.\n\nOne can only wonder about the enormous weight of McKinsey in the decisions that were, and still are, taken in the management of the Covid-19 crisis in France, all done behind the opaque corporate bunker erected by Macron and McKinsey.\n\nDuring the early hours of the COVID pandemic, the first step taken by President Macron was to set up a “Health Defense Council,” yet another layer of bureaucracy which provided the secrecy required to operate in the dark, with each participant being subject to a form of security clearance that the defense secrecy and national security apparatus afforded them. This can not be a coincidence, as it ensures all meetings will be held under a non-disclosure, and a “need to know basis.”\n\nOf course, the lifting of the defense secrecy layer can be requested, and legally speaking, the Élysée cannot veto it. However, on the other hand, politically, the Minister of Defense will seek the approval of the President of the Republic, meaning Macron would have had the last word anyway.\n\nThey were working in a completely unaccountable vacuum away from all checks and balances, unfettered and at ease to do what ever they wanted. Normally, this would be unacceptable, but under the guise of the ‘global pandemic,’ governments effectively suspended the normal bureaucratic and legal due processes, enjoying their newfound statutory and emergency powers. But this veil of secrecy needs to be lifted immediately in order to restore transparency, and to see if overreach of power has been taking place.\n\nHere we must ask a crucial question: were these consultancy firms and vaccines manufacturers allowed in these so-called “Health Defense Council Meetings”? What were the true motives behind Macron’s choice to hold these meetings under a complete veil of secrecy? What were they hiding from the public? As the fall-out from the global vaccine roll-out continues, and the clinical trial and safety data from transnational pharmaceutical firms like Pfizer comes under increased scrutiny, the case against influence peddling, corporate malfeasance, and fraud become more compelling.\n\nThe Senate Inquiry has just launched a debate we should have had 10 years ago, and certainly at the very start of the pandemic. These consultancy firms have emptied the vault of the French republic for years, and certainly have contributed to many government cosmetic requirements, but what about the people of France? What did we truly get out of this sweeping ‘reform’ of our country’s decision-making and policy formation structures?\n\nMcKinsey will likely be forced to pay the corporate taxes they have been avoiding for along period of time, but this doesn’t in any way address the real problem of collusion present in this very popular trend of erecting a Public Private Partnership.\n\nThe Senate Commission Inquiry into the influence of consulting firms on public policy delivered its conclusions on Thursday March 17, after four months of work. Senator Éliane Assassi brings to light a “sprawling phenomenon,” in her words, and reveals the support of consulting firms on “whole sections of public policy.” Incredibly, few outside the halls of power were even aware this silent corporate coup had been taking place.\n\nIn the following video, (below, English subtitled), Assassi confirms having in her possession documents created by McKinsey Australia which were used to advise the Australian health ministries, before going on to explain that these very same documents were used by McKinsey France, with the only change being that the new version displayed the French Ministry of Health logo where the McKinsey logo had been previously. She uses the term ‘cut & paste’ to describe how McKinsey documents are being perceived as the work issued by the French Ministry of Health, when in fact it couldn’t be further from the truth.\n\nThe problem doesn’t even stop here, as such documents are then forwarded to the Health Defense Council who held meeting under a strict veil of secrecy forbidding the French taxpayers to see who attends these Health Defense Meetings, and what is being discussed.\n\nBelow, Senator Éliane Assassi talks about the ethical inadequacy of this incredible farago.\n\nIndeed, the opacity of Macron’s government has become a trademark of his administration. Essentially, it’s a black box bureaucracy.\n\nMacron & Co. meets with Zelensky & Co.\n\nConsidering the evidence presented earlier, it can be said that McKinsey created the Macron phenomena from scratch, with the drafting of the controversial “Macron 2” law in 2015, and the creation of his political party En Marche. This is now undisputed.\n\nIn light of the current conflict in eastern Europe, if one was to take a serious look at Ukraine and its government, we would find none other than McKinsey & Co., reproducing the very same patterns with the government of Volodymyr Zelensky. In this way, these two “heads” of state are nothing more than actors who perfectly regurgitate prefabricated scenarios scripted by McKinsey.\n\nMany have observed the overt level of control and influence over the government in Kiev by the US Embassy in Kiev, Victoria Nuland, and the US State Department, but few have noticed where the western levers of control are installed inside the government itself. Let’s take the example of Oleksandr Danylyuk, the former Secretary of the National Security and Defense Council and Minister of Finance of Ukraine.\n\nUnder Zelensky’s leadership and Oleksandr Danylyuk’s close counsel, the Ukrainian Government spiraled into receivership by racking up an enormous debt with the International Monetary Fund (IMF), and devised a deadly strategy in the Donbass region, further inflaming the violent civil war in eastern Ukraine.\n\nIncredibly, Danylyuk had previously worked three years in McKinsey’s offices in London and Moscow. His projects included the reform of the UK tax system, as well as the development of strategies and the optimization of operations in the energy and telecommunications sectors.\n\nMoreover, Danylyuk and McKinsey developed the strategy for the Economic Reform Coordination Center of Ukraine. The firm drafted the cooperation agreement with the IMF, and it was Danylyuk who actively supported the signing of the EU-Ukraine association agreement, despite active opposition within the government from the pro-Russian lobbyists.\n\nIt doesn’t end there, as McKinsey’s fingerprints are everywhere to be seen, including their timely intervention behind the curtain to stop Germany and Russia’s joint Nord Stream 2 pipeline project.\n\n\n\nAgain, it was Oleksandr Danyliuk, Secretary of the National Security and Defense Council of Ukraine, who could be heard saying on several occasions that, “We see Nord Stream 2 as a security threat.”\n\n“Poland, the United States and Ukraine consider the North Stream 2 gas pipeline a threat to national security in the region,” exclaimed Danyliuk.\n\nWhere the EU procures its energy supplies wouldn’t normally be of interest to a country like Ukraine, but it is a central issue for realizing Washington and London foreign policy objectives.\n\nIndeed, Danyliuk’s comments echo far, and today we can see the obvious results when observing the United States and the European Commission’s new commitment to severely reducing Europe’s dependence on Russian energy.\n\nTheir last Joint statement made during Biden’s visit to Brussels is a clear indication that through the Joint European Action on More Affordable, Secure and Sustainable Energy (REPowerEU), the EU has confirmed its goal of becoming completely independent of Russian fossil fuels. As for the US, they will without a shadow of a doubt, take advantage of the situation and try to increase their more expensive LNG gas exports to Europe in an attempt to replace Russian fuel.\n\nThe White House announcement on the 26th March 2022 confirms the US intention to rapidly increase exports of liquefied natural gas to Europe, as Germany and other EU nations try desperately to diminish their dependence on Russian fossil fuels.\n\nIn many ways, this recent overhaul of European energy policy is also harmonizing with the World Economic Forum’s “Great Reset” agenda, and stakeholder governments’ “Net Zero” decarbonisation commitments. Here we can remind you again, that McKinsey & Co. is the top strategic advisor to the WEF.\n\nTheir proximity with the drug and vaccine manufacturers provides room for more conflict of interest to take place. If only it ended there.\n\nAccording to McKinsey’s website, the firm is also supporting major players in the pharmaceutical and medical devices industry to help them anticipate changes in the sector, design innovative approaches and develop the skills that will guarantee their ‘sustainable performance’ and more profitable growth.\n\nFor instance, Aamir Malik, Pfizer’s Executive Vice President and Chief Business Innovation Officer, is responsible for the company’s strategy and business development. But looking into his professional experience, we discover he was the Managing Partner of McKinsey & Company’s United States operation, and previously led the firm’s Global Pharmaceutical and Medical Products Practice.\n\nA Senior executive of McKinsey at Pfizer should trigger a lot of alarm bells, especially knowing McKinsey was appointed by Macron’s government and the French Ministry of Health to plan and implement the national vaccination strategy.\n\nWho would be naive enough to believe there isn’t any conflict of interest here?\n\nWas the COVID-19 pandemic the most lucrative Public Private Partnership ever conceived?\n\nAnd why are we left with the feeling this was all orchestrated to help us swallow another blue pill; ask yourself, how is it that McKinsey, Macron, and Zelensky are all active members of the World Economic Forum?\n\nIn the modern era, transparency and accountability in government have long been regarded as the very pillars of our democracy, and today I can say with confidence that France, my beautiful country, has been the victim of a coup d’état beginning in 2017, when a group of conspirators helped Macron ascend to the throne, and with the help of very unscrupulous individuals, consultancy companies, banks and government representatives, they promoted and implemented a pernicious agenda spearheaded by the World Economic Forum in Davos and a powerful transnational pharmaceutical lobby, and drafted by the McKinsey-Accenture corporate bloc.\n\nMcKinseyGate has only just begun.\n\n21st Century Wire serves a niche audience which we firmly believe is not being catered for by the wider western corporate and state-funded media market.\n\nYou can actually participate in the global efforts to cripple the Deep State organized criminal cabal's ability for genocide, while enjoying healthcare freedom at the same time, by boycotting Big Pharma for good.", "opengraph": {"type": "article", "title": "McKinseyGate: France’s Shadow Government & the Rise of the Corporate State", "url": "https://geopolitics.co/2022/04/02/mckinseygate-frances-shadow-government-the-rise-of-the-corporate-state/", "description": "In France, consultancy firms have been paid billions of euros to advise governments on policies from the coronavirus vaccine, to climate change, and vaccine roll-out, as well as digital transformat…", "article:published_time": "2022-04-02T12:12:11+00:00", "article:modified_time": "2022-04-09T00:23:36+00:00", "site_name": "Covert Geopolitics", "image": "https://geopolitics.co/wp-content/uploads/2022/04/McKinsey-France-Macron-McKinseyGate-1.jpg", "image:width": "610", "image:height": "410", "locale": "en_US"}, "tags": ["McKinsey & Company", "medical industrial complex", "Macron", "McKinseyGate"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"474\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/France?src=hash&amp;ref_src=twsrc%5Etfw\">#France</a> 🇫🇷 McKinsey in the Middle of a State Scandal in France. They are accused of not paying corporate taxes for last 10 years. According to Senator Éliane Assassi, Karim Tadjeddine associate director at McKinsey confirmed under oath that McKinsey was paying taxes. 🥒🥒 🤔 <a href=\"https://t.co/mP2M7phCzD\">pic.twitter.com/mP2M7phCzD</a></p>— La French ConAction..🇫🇷 🚛 (@LFCNewsMedia) <a href=\"https://twitter.com/LFCNewsMedia/status/1506700656593281025?ref_src=twsrc%5Etfw\">March 23, 2022</a></blockquote> \n", "<blockquote class=\"twitter-tweet\" data-width=\"474\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/France?src=hash&amp;ref_src=twsrc%5Etfw\">#France</a> 🇫🇷 Minister of Health Olivier Véran at a recent senate hearing, questioned about the role Consultancy firm McKinsey has played in the decisions made by his Ministry regarding the Vaccination strategy. Véran is knee jerking and refuse to admit McKinsey obvious influence. <a href=\"https://t.co/Tpy11UaP3h\">pic.twitter.com/Tpy11UaP3h</a></p>— La French ConAction..🇫🇷 🚛 (@LFCNewsMedia) <a href=\"https://twitter.com/LFCNewsMedia/status/1507408641485422604?ref_src=twsrc%5Etfw\">March 25, 2022</a></blockquote> \n", "<blockquote class=\"twitter-tweet\" data-width=\"474\" data-dnt=\"true\"><p lang=\"fr\" dir=\"ltr\">Gabriel Attal annonce la création d'un \"cabinet de conseil interne\" <a href=\"https://t.co/Z0f37faLFJ\">pic.twitter.com/Z0f37faLFJ</a></p>— BFMTV (@BFMTV) <a href=\"https://twitter.com/BFMTV/status/1494580028482465796?ref_src=twsrc%5Etfw\">February 18, 2022</a></blockquote> \n", "<blockquote class=\"twitter-tweet\" data-width=\"474\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/France?src=hash&amp;ref_src=twsrc%5Etfw\">#France</a> 🇫🇷 <a href=\"https://twitter.com/hashtag/McKinseyGate?src=hash&amp;ref_src=twsrc%5Etfw\">#McKinseyGate</a> Senator Éliane Assassi brings to light a sprawling phenomenon &amp; talks about cut &amp; paste documents used by McKinsey France but created by McKinsey Australia bearing the French Ministry of Health logo before being forwarded to French Health Defense Council <a href=\"https://t.co/28f6AsvqtD\">pic.twitter.com/28f6AsvqtD</a></p>— La French ConAction..🇫🇷 🚛 (@LFCNewsMedia) <a href=\"https://twitter.com/LFCNewsMedia/status/1508003701159604227?ref_src=twsrc%5Etfw\">March 27, 2022</a></blockquote> \n"], "movies": [], "links": ["https://www.publicsenat.fr/article/parlementaire/un-phenomene-tentaculaire-opaque-le-rapport-au-vitriol-du-senat-sur-le-recours", "https://www.senat.fr/rap/r21-578-1/r21-578-11.pdf", "https://geopolitics.co/wp-content/uploads/2022/04/SenateReporten.pdf", "https://www.senat.fr/rap/r21-578-1/r21-578-1-syn.pdf", "https://www.mckinsey.com/", "https://twitter.com/hashtag/France?src=hash&ref_src=twsrc%5Etfw", "https://t.co/mP2M7phCzD", "https://twitter.com/LFCNewsMedia/status/1506700656593281025?ref_src=twsrc%5Etfw", "https://www.vie-publique.fr/sites/default/files/rapport/pdf/124000520.pdf", "https://www.modernisation.gouv.fr/qui-sommes-nous#:~:text=La%20DITP%20est%20en%20charge,les%20pr%C3%A9fectures%20dans%20les%20territoires.", "https://www.numerique.gouv.fr/dinum/", "https://projects.propublica.org/coronavirus-contracts/contracts/36E77620C0039", "https://www.propublica.org/article/how-mckinsey-is-making-100-million-and-counting-advising-on-the-governments-bumbling-coronavirus-response", "https://www.bcg.com/fr-fr/", "https://www.theguardian.com/world/2020/oct/14/consultants-fees-up-to-6250-a-day-for-work-on-covid-test-system", "https://public.tableau.com/app/profile/devexdevdata/viz/COVIDFundingvisualisation/COVID-19funding", "https://www.consultancy.eu/news/4003/europes-consulting-industry-hardest-hit-by-coronavirus", "https://www.accenture.com/fr-fr?c=acn_glb_brandexpressiongoogle_12728073&n=psgs_1221&gclid=Cj0KCQjw0PWRBhDKARIsAPKHFGgh0Ho2f_EXDmtLFQ8sDHfSqxcn75H8B2whEK6xetBwRDpnzBHODgkaApZ5EALw_wcB", "https://www.citwell.com/", "https://www.mediapart.fr/journal/economie/090221/accenture-et-mckinsey-embauches-par-l-etat-pour-faire-un-milliard-d-economies", "https://www.economie.gouv.fr/", "https://www.cnbc.com/2021/02/04/mckinsey-to-pay-573-million-to-settle-claims-related-to-opioid-epidemic.html", "https://www.cnbc.com/2021/02/04/mckinsey-to-pay-573-million-to-settle-claims-related-to-opioid-epidemic.html", "https://www.lemonde.fr/m-le-mag/article/2021/02/05/de-la-creation-d-en-marche-a-la-campagne-de-vaccination-mckinsey-un-cabinet-dans-les-pas-de-macron_6068833_4500055.html", "https://www.senat.fr/rap/r21-578-1/r21-578-1-syn.pdf", "https://www.youtube.com/watch?v=hnQvDere0Zg", "https://twitter.com/hashtag/France?src=hash&ref_src=twsrc%5Etfw", "https://t.co/Tpy11UaP3h", "https://twitter.com/LFCNewsMedia/status/1507408641485422604?ref_src=twsrc%5Etfw", "https://www.mckinsey.com/featured-insights/world-economic-forum/overview", "https://www.mckinsey.com/featured-insights/world-economic-forum/overview", "https://www.mckinsey.com/featured-insights/world-economic-forum/overview", "https://21stcenturywire.com/wp-content/uploads/2022/03/8483.tmp_.png", "https://www.mckinsey.com/industries/technology-media-and-telecommunications/our-insights/closing-frances-100-billion-digital-gap", "http://www.senat.fr/commission/enquete/2021_influence_des_cabinets_de_conseil_prives.html", "http://www.senat.fr/commission/enquete/2021_influence_des_cabinets_de_conseil_prives.html", "https://www.politico.com/story/2019/07/02/spies-intelligence-community-mckinsey-1390863", "https://www.mckinsey.com/industries/public-and-social-sector/how-we-help-clients/defense-and-security", "https://allary-editions.fr/products/matthieu-aron-et-caroline-michel-aguirre-les-infiltres", "https://www.mckinsey.com/our-people/karim-tadjeddine", "https://t.co/Z0f37faLFJ", "https://twitter.com/BFMTV/status/1494580028482465796?ref_src=twsrc%5Etfw", "https://wikileaks.org/macron-emails/emailid/3111", "https://www.consultor.fr/articles/enquete-les-consulting-boys-de-la-macronie", "https://wikileaks.org/macron-emails/emailid/3111", "https://pmpstrategy.com/", "https://www.entempsreel.com/", "https://geopolitics.co/wp-content/uploads/2022/04/811.tmp_.png", "https://21stcenturywire.com/wp-content/uploads/2022/03/BC64.tmp_.png", "https://www.french-property.com/newsletter/2008/2/1/attali-commission/", "https://www.polytechnique.edu/incorpoX2021/index.php?p=bal-de-lX", "https://www.mckinsey.com/mgi/overview", "https://www.polytechnique.edu/", "https://www.conseil-constitutionnel.fr/en/laurent-fabius", "https://21stcenturywire.com/wp-content/uploads/2022/03/A801.tmp_.png", "https://explain.fr/", "https://en.wikipedia.org/wiki/Isma%C3%ABl_Emelien", "https://www.elysee.fr/en/french-presidency/public-health-defence-council", "https://www.mckinsey.com/business-functions/risk-and-resilience/our-insights/a-smarter-way-to-think-about-public-private-partnerships", "https://twitter.com/hashtag/France?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/McKinseyGate?src=hash&ref_src=twsrc%5Etfw", "https://t.co/28f6AsvqtD", "https://twitter.com/LFCNewsMedia/status/1508003701159604227?ref_src=twsrc%5Etfw", "https://21stcenturywire.com/wp-content/uploads/2022/03/WhatsApp-Image-2022-03-25-at-21.00.49.jpeg", "https://www.leparisien.fr/economie/reforme-ce-que-prevoit-la-loi-macron-2-09-11-2015-5261445.php", "https://en.wikipedia.org/wiki/Oleksandr_Danylyuk", "https://21stcenturywire.com/wp-content/uploads/2022/03/D0B9.tmp_.png", "https://www.euro-petrole.com/declaration-commune-de-la-commission-europeenne-et-des-etats-unis-sur-la-securite-energetique-europeenne-n-f-23622", "https://ec.europa.eu/commission/presscorner/detail/en/ip_22_1511", "https://www.scientificamerican.com/article/the-u-s-will-increase-natural-gas-exports-to-europe-to-replace-russian-fuel/", "https://www.mckinsey.com/industries/life-sciences/our-insights/winning-against-covid-19-the-implications-for-biopharma", "https://21stcenturywire.com/wp-content/uploads/2022/03/1F67.tmp_.png", "https://www.pfizer.com/people/leadership/executives/aamir_malik", "https://virutron.com/", "https://virutron.com/"], "authors": [], "publish_date": "2022-04-02T12:12:11+00:00"}