{"result_id": "083022", "URL": "https://geopolitics.co/2021/12/13/pfizer-confidential-document-concedes-there-is-a-large-increase-in-adverse-event-reactions-to-its-vaccine/", "timestamp": "2023-04-25 14:51:24 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://geopolitics.co/wp-content/uploads/2019/11/cg-icon-150x150.png", "canonical": "https://geopolitics.co/2021/12/13/pfizer-confidential-document-concedes-there-is-a-large-increase-in-adverse-event-reactions-to-its-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "geopolitics.co", "title": "Pfizer “Confidential Document” Concedes There is a Large Increase in Adverse Event Reactions to Its Vaccine", "cleaned_text": "Up until now, New Zealand GPs and hospitals have been provided with a fact sheet from Pfizer listing 21 possible adverse events as a result of vaccination.\n\nAll of these are minor, requiring little or no treatment other than rest, with the exception of severe allergic reactions, myocarditis and pericarditis (inflammation of the heart).\n\nAs a result, most of the many thousands of New Zealanders reporting adverse effects post vaccination have been sent home with little more than advice to take an aspirin and rest. Some have been told that their conditions may be unrelated medical events, psychosomatic, or due to anxiety on their part.\n\nRelying on the short official Pfizer fact sheet as a guide, Medsafe, our NZ medicines regulatory body, has only accepted one out of the 100+ deaths actually reported to them as related to vaccination. Most are listed as unrelated, under investigation, or unknowable.\n\nBy contrast, the NZ Health Forum and other groups have collected unofficial reports of adverse effects and death proximate to vaccination. Out of 670+ reports of death compiled by the Forum, 270 have already been investigated by medical professionals and closely linked to known adverse effects.\n\nFollowing the publication of the new Pfizer document many more are expected to be connected with vaccination. Reports describe symptoms such as chest pain, brain fog, extreme fatigue, neurological symptoms, tachycardia, stroke, heart attacks, and many more.\n\nCollected data suggests that as many as two-thirds of adverse event enquiries made to medical staff by vaccine recipients have not been reported to CARM—the NZ system of adverse event reporting. Medsafe itself estimates in its Guide to Adverse Reaction Reporting that in NZ only 5% of adverse events are reported. As a result the NZ public is completely unaware of the extent of reported possible risks of vaccination.\n\nThe just released Pfizer document which is being circulated widely in the public domain and can downloaded from websites is entitled:\n\n5.3.6 CUMULATIVE ANALYSIS OF POST-AUTHORIZATION ADVERSE EVENT REPORTS OF PF-07302048 (BNT162B2) RECEIVED THROUGH 28-FEB-2021\n\nTherefore the reported side effects predate the vaccine rollout in New Zealand. The report itself was finalised by Pfizer on 30 April 2021.\n\nDid Pfizer supply this information to our government during the early days of our universal vaccination programme?\n\nIf so the results should have been shared with our medical professionals, politicians, and the public. Many of the new 100+ listed new adverse event types now released by Pfizer in this 38 page document pose long term risks to health.\n\nUntil very recently, the document was being withheld by Pfizer who maintained it should be kept confidential.\n\nThere is a strong possibility that very large numbers of New Zealanders will suffer long term injury as a result.\n\nHow did this happen without anyone’s knowledge?\n\nEven though the Pfizer vaccine had undergone very short trials and had provisional approval only, Medsafe did not update its CARM adverse event reporting system to make it mandatory rather than voluntary.\n\nMedsafe did not advise GPs and Hospital staff to be on high alert for adverse events and report them rapidly and in detail.\n\nThe Government ignored the unprecedented numbers of adverse events being reported to Medsafe and circulating in the community and on social media.\n\nThe Government instituted a public relations, promotional, and media campaign advising the public that the Pfizer covid-19 mRNA vaccine was completely safe and free of serious side effects, giving the impression that there were no side effects—not even the known serious effects of heart inflammation that Pfizer had already admitted.\n\nUnaccountably, conditions imposed by the contract that our Government signed with Pfizer for the supply of vaccines have not been made public.\n\nWe suspect that the contract contains standard clauses similar to those used with drugs that have completed safety trials, such as a provision that public discussion of adverse events may only be undertaken in conjunction with the company supplying the drug.\n\nIf this is the case, it will have hamstrung Medsafe and our Government in their approach to assessment and public discussion of adverse events.\n\nWhat are the new risks of vaccination?\n\nAnyone reading the new Pfizer adverse event report compilation will be staggered. The sheer density of the technical medical terms and disease names are nevertheless broken down into recognisable and serious categories of illness—kidney failure, stroke, cardiac events, pregnancy complications, inflammation, neurological disease, autoimmune failure, paralysis, liver failure, blood disorders, skin disease, musculoskeletal problems, arthritis, respiratory disease, DVT, blood clots, vascular disease, haemorrhage, loss of sight, Bell’s palsy, and epilepsy.\n\nHow has this affected New Zealand?\n\nWhilst even the official Medsafe record of adverse effects and the unofficial lists show that the immediate risks of covid vaccination could be as much as 50 – 300 times greater than even the most risky of previous traditional vaccines (such as the smallpox jab), and whilst the long term effects are unknown, 90% of eligible New Zealanders have gone ahead with vaccination having accepted the assurances of safety and efficacy from the government, or having been forced to get vaccinated under threat of loss of employment and freedom of movement.\n\nFeeling the fear of covid that has been generated by reports in the international and local media, most people completing vaccination heaved a great sigh of relief—that is one huge worry off my mind, now I can get on with my life.\n\nThose finding that no immediate insurmountable reaction had surfaced (the majority) understandably agreed with the government: “What is all the fuss about? Why shouldn’t everyone do this, or be made to do this? It is a social good that will protect everyone”\n\nBUT there is a huge iceberg in the path of the good ship New Zealand hidden under the waves of relief. Thousands are quietly suffering debilitating illness, unacknowledged and in some cases untreated by their doctors. For those who survived vaccination without immediate injury this was not a problem because they didn’t know about it apart from one or two complaints from friends that might just be random coincidences.\n\nThis has brought about a division in New Zealand society which the government created in the name of public safety. Thousands of dedicated servants of the nation including teachers, health workers, and others are being stigmatised and forced out of their jobs in a manner horrifyingly reminiscent of the treatment of Jews in Nazi Germany. The government did this despite knowing that the Pfizer vaccine was neither fully tested, safe, nor particularly effective.\n\nJudges handed down decisions in courts supporting the government mandates unaware of crucial mRNA vaccine safety data, all because Pfizer had withheld this information, and the government had not done its due diligence. Had the true position been known, the High Court’s NZ Bill of Rights analysis may well have been different and its provision which guarantees that every individual should be able to make their own medical choices might still be intact.\n\nPfizer concludes the released document with a statement “Review of the available data for this cumulative PM experience, confirms a favorable benefit:risk balance for BNT162b2.”\n\nPM stands for the Post Marketing data set they are evaluating of 42,086 reported adverse events. Pfizer makes this bald claim of benefit despite admitting that “the magnitude of underreporting is unknown”.\n\nThis document contains no further substantive information in support of this claim of benefit:risk balance other than a mysterious reference to “the known safety profile of the vaccine”.\n\nThe benefit:risk argument is in essence saying: covid-19 is a serious illness and our calculations show that more people will be injured by the disease than are being injured by the vaccine, therefore there will be a net benefit. This argument falls over because of at least three very important factors: Firstly treatment options have improved and thereby the risk of serious illness and death from covid has been greatly reduced.\n\nSecondly the risk of covid is not evenly spread. People with comorbidities (other conditions) and the elderly are at very high risk. Most other people are at very low risk. Thus vaccination could subject people at low risk from covid to a higher risk from vaccination. Approaches to preventive health education can reduce the covid risk to people with comorbidities more than vaccination can.\n\nFor example a study published in the BMJ found that people following a plant based diet have a 73% reduced risk of serious illness. Data from the UK Biobank has been analysed by researchers from Manchester and Oxford Universities and the West Indies who found that shift workers (who typically have disrupted bioclocks) have three times the risk of being hospitalised with covid.\n\nPreventive remedies include changes in diet such as the introduction of more fresh fruit, vegetables, and fibre, and reductions in known unhealthy habits such as smoking, excess alcohol consumption, an overly sedentary lifestyle, a predominance of ultra processed foods, and many more.\n\nThe third and most significant reason the benefit:risk argument falls over is the sheer range of adverse reaction types observed by Pfizer and kept hidden until now.\n\nHow could a single vaccine have such a wide range of effects?\n\nThe technical reasons why mRNA vaccines can have such broad effects on human health are understood by those working in gene therapy. Perfectly stable DNA function is critical to life. In turn, cell function integrity is critical to maintaining DNA. Individual cells contain mechanisms to repair their own DNA as many as 70,000 times a day. From this perspective, the in vitro laboratory study recently published in Viruses 2021, 13,2056, is indicative.\n\nIt suggests a possible mechanism for vaccine harm. The study found that the spike protein localises in the nucleus and inhibits DNA damage repair by impeding access of key DNA repair proteins. The findings reveal a potential molecular pathway by which the covid spike protein might impede adaptive immunity. They underscore the potential side effects of the full-length spike-based mRNA vaccines.\n\nDespite a degree of cellular autonomy, the nervous system and the physiology must and does function as a whole. The entire nervous system including the immune system is a ‘part and whole’ network. The whole is in every part, the DNA is in every cell, but cell function is also related to a generalised and interconnected genetic network—the holistic functioning of the physiological network is critical to its efficiency. Thus physiological network stability (health) can be impaired by the introduction of pieces of active genetic code (biologic instructions) like those contained in mRNA vaccines.\n\nAn analogy will make this clear. We are familiar with computer networks. A very common backbone of most commercial systems is produced by Microsoft. Each computer contains the Microsoft system and the network also runs under its system.\n\nThe system is supported by computer code—a set of complex instructions written by Microsoft. Individual computers can perform standalone tasks and can communicate with other computers to keep the organisation running smoothly. This can be compared to our physiology. There are many systems in the body: immune system, circulatory system, digestive system, limbic system, homeostatic mechanisms, musculoskeletal structure, neural networks, and so on.\n\nThey perform apparently stand alone functions, but all run on the basis of the same genetic code contained in our DNA and communicate with one another during the process of maintaining health. Back to our analogy: office staff sometimes send messages full of spelling errors to one another but this doesn’t harm the network.\n\nIf however a computer virus written in code is sent by one computer it can overwhelm and crash network function because it affects the operating system. Some networks are protected by good firewalls and others are vulnerable. The Covid vaccine introduces a sequence of information written in genetic code into our physiology. It is no wonder that it could elicit such a very broad range of adverse effects, some of which are so serious as to be analogous to a computer network crash.\n\nSome individuals have strong immune systems and are little affected, others experience problems in one or other systems. The fact that a sequence of foreign code has been introduced into the physiology produces major risks to health, risks that those working in gene therapy for the last few decades are very familiar with.\n\nThe extremely broad range of adverse effects revealed by the Pfizer document is the physiological signature of a general control system failure, a failure of the body’s overall integration and function. It is not plausible to suggest otherwise. That is why experts in genomics, even as I write, are pondering fundamental questions about the action and safety of mRNA vaccines. They are also urging caution.\n\nThe NZ government agreed commercial terms with a single company for vaccine supply. It is possible that vital information was withheld. The public was kept in ignorance of known risks. This has divided our society and undermined our fundamental Kiwi tolerance on the basis of not only incomplete but misleading safety data.\n\nThe government is asleep at the wheel. Knowing full well that safety trials were incomplete, the government apparently accepted information supplied by multinational commercial interests at face value. This should be a ‘never again’ moment. There are huge lessons to be learned and an apology owed to the whole population.\n\nThe provisions of the NZ Bill of Rights should be given constitutional status. The vaccine mandates should be withdrawn and those affected by them compensated. The proposed vaccination of 5 -11 year olds should be stopped.\n\nOur thanks to Daily Telegraph New Zealand for having brought this article to our attention.\n\nYou can actually participate in the global efforts to cripple the Deep State organized criminal cabal's ability for genocide, while enjoying healthcare freedom at the same time, by boycotting Big Pharma for good.", "opengraph": {"type": "article", "title": "Pfizer “Confidential Document” Concedes There is a Large Increase in Adverse Event Reactions to Its Vaccine", "url": "https://geopolitics.co/2021/12/13/pfizer-confidential-document-concedes-there-is-a-large-increase-in-adverse-event-reactions-to-its-vaccine/", "description": "Up until now, New Zealand GPs and hospitals have been provided with a fact sheet from Pfizer listing 21 possible adverse events as a result of vaccination.", "article:published_time": "2021-12-13T15:06:10+00:00", "article:modified_time": "2021-12-27T18:44:30+00:00", "site_name": "Covert Geopolitics", "image": "https://geopolitics.co/wp-content/uploads/2021/09/pfizer-covid-vaccine.jpg", "image:width": "960", "image:height": "540", "locale": "en_US"}, "tags": ["adverse reactions", "pfizer vaccine"], "tweets": [], "movies": [], "links": ["http://labeling.pfizer.com/ShowLabeling.aspx?id=14472", "https://geopolitics.co/wp-content/uploads/2021/12/CUMULATIVE-ANALYSIS-OF-POST-AUTHORIZATION-ADVERSE-EVENT-REPORTS-OF-PF-0730204.pdf", "https://geopolitics.co/wp-content/uploads/2021/12/CUMULATIVE-ANALYSIS-OF-POST-AUTHORIZATION-ADVERSE-EVENT-REPORTS-OF-PF-0730204.pdf", "https://dailytelegraph.co.nz/news/pfizer-document-concedes-that-there-is-a-large-increase-in-types-of-adverse-event-reaction-to-its-vaccine/", "https://virutron.com/", "https://virutron.com/"], "authors": [], "publish_date": "2021-12-13T15:06:10+00:00"}