{"result_id": "083037", "URL": "https://geopolitics.co/2022/01/21/latest-bombshell-about-covid-vaccines-will-dismantle-big-pharma/", "timestamp": "2023-04-25 14:51:35 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://geopolitics.co/wp-content/uploads/2019/11/cg-icon-150x150.png", "canonical": "https://geopolitics.co/2022/01/21/latest-bombshell-about-covid-vaccines-will-dismantle-big-pharma/", "encoding": "UTF-8"}, "image": null, "domain": "geopolitics.co", "title": "Latest Bombshell About COVID “Vaccines” Will Dismantle Big Pharma", "cleaned_text": "International trial lawyer Dr. Reiner Fuellmich said on Dec. 31 that the latest “bombshell” about the Wuhan coronavirus (COVID-19) vaccines will dismantle the big pharmaceutical companies that have pocketed billions of dollars during the pandemic.\n\nIn a video presented by OVAL Media-Prevent Global Genocide channel and shown on Brighteon.com, Fuellmich discussed with Dr. Wolfgang Wodarg the latest game-changing findings by researcher Craig Paardekooper of Kingston University London.\n\nAccording to Wodarg, a German medical doctor and epidemiologist specializing in lung diseases and environmental medicine, the Vaccine Adverse Event Reporting System (VAERS) data shows vaccine batches are sequentially marked by varying toxicity.\n\nHe added that this has now been statistically graphed out and will prove that the COVID vaccine manufacturers have worked in a coordinated fashion with the intent to purposely kill and maim people who have taken their vaccines.\n\n“It’s not the vaccinations. It’s not true that there is the same stuff in each in each shot. And we have a very hard evidence with the batches that are different, shaped differently, have different effect,” Wodarg explained.\n\nWodarg took note of the lots and batches in the U.S. where there were no cases, while other batches showed many people dying. He explained that in some batches you can see that something is happening and this is where cases of toxicity expressed in deaths are seen. The German doctor added that the Pfizer and Johnson & Johnson vaccines have a horrible accumulation of cases in certain batches.\n\nFuellmich pointed out that once “intent” has been proven, there is no immunity or liability protection for anyone or any organization involved in these crimes against humanity.\n\n“If you look at the totality of the evidence, there’s more than enough evidence. A very recent presentation done by [former Pfizer vice president] Dr. Mike Yeadon shows precisely how they use these different batches in order to have an experiment within an experiment in order to try out what kind of dosage is needed in order to kill people and maim people,” said Fuellmich, who has successfully indicted big companies like Volkswagen and Deutsche Bank.\n\n“And it is inescapable evidence of premeditation and once you have premeditation, there is no immunity for anyone anymore. Not even in the United States.”\n\nWodarg said the vaccines were a planned, obscure trial and were made to kill thousands of people intentionally.\n\nFuellmich added that it was done in a coordinated effort and synchronized way with Pfizer taking the lead and followed by Moderna and Johnson & Johnson. He noted that these pharmaceutical companies all knew about this mass serial killing.\n\n“This is a legal problem. But this [graph] makes it a whole lot easier for any lawyer in this world to show intent. There is an inescapable conclusion from these graphs,” Fuellmich said. “You can show intent. They are deliberately using different dosages coordinated with each other so that they won’t interfere with each other in order to try and find out what kills the best or what maims the best.”\n\nDr. Sam White, a doctor from the United Kingdom who was suspended by the National Health Service (NHS) in June 2021 for raising concerns about the safety of the COVID injection, said that everything has been done to disguise the true figures and that the reporting systems were never robust enough for an outright clinical trial of millions or even billions of people.\n\n“If we can prove criminal intention, or even gross negligence, manslaughter, it may well be that those who’ve been harmed, or those who’ve lost a loved one can actually get some form of compensation,” White said.\n\n“At the moment, it’s basically impossible in the U.K. and worldwide. And that’s been the case with vaccines for a long, long time. It’s almost like unbelievable, that there’s some sort of synchronized effort.”\n\nFuellmich said that the findings will have immense legal repercussions when it is proven that the vaccines were deliberately and intentionally done to harm people.\n\n“You have to draw the legal conclusion and the legal conclusion is its intent. And from its intent, you can get punitive damages. You can go up to 21 times the actual damage, which is added on top of the actual damage. In these cases, I would think you can go up to thousand times because these people got so badly injured. I think this is going to be enough to dismantle the entire industry,” Fuellmich concluded.\n\nWatch the video below to learn more about the latest bombshell regarding the COVID-19 vaccines.\n\nYou can actually participate in the global efforts to cripple the Deep State organized criminal cabal's ability for genocide, while enjoying healthcare freedom at the same time, by boycotting Big Pharma for good.", "opengraph": {"type": "article", "title": "Latest Bombshell About COVID “Vaccines” Will Dismantle Big Pharma", "url": "https://geopolitics.co/2022/01/21/latest-bombshell-about-covid-vaccines-will-dismantle-big-pharma/", "description": "International trial lawyer Dr. Reiner Fuellmich said on Dec. 31 that the latest “bombshell” about the Wuhan coronavirus (COVID-19) vaccines will dismantle the big pharmaceutical companies that have…", "article:published_time": "2022-01-21T11:18:51+00:00", "article:modified_time": "2022-02-04T20:28:24+00:00", "site_name": "Covert Geopolitics", "image": "https://geopolitics.co/wp-content/uploads/2021/08/pfizer-executives.jpg", "image:width": "900", "image:height": "506", "locale": "en_US"}, "tags": ["pfizer vaccines", "varying toxicity", "janssen", "vaccines"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/2b36ce94-a9bc-41a1-9261-4d49a4cb23bc", "https://www.kingston.ac.uk/", "https://mizzima.com/article/lawyers-expose-alleged-covid-19-fraud-and-vaccine-danger", "https://conspiracy.news/", "http://www.brighteon.com/2b36ce94-a9bc-41a1-9261-4d49a4cb23bc", "https://www.planet-today.com", "https://virutron.com/", "https://virutron.com/"], "authors": [], "publish_date": "2022-01-21T11:18:51+00:00"}