{"result_id": "083023", "URL": "https://geopolitics.co/2021/08/11/leaked-document-reveals-shocking-terms-of-pfizers-international-vaccine-agreements/", "timestamp": "2023-04-25 14:51:25 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://geopolitics.co/wp-content/uploads/2019/11/cg-icon-150x150.png", "canonical": "https://geopolitics.co/2021/08/11/leaked-document-reveals-shocking-terms-of-pfizers-international-vaccine-agreements/", "encoding": "UTF-8"}, "image": null, "domain": "geopolitics.co", "title": "Leaked Document Reveals ‘Shocking’ Terms of Pfizer’s International Vaccine Agreements", "cleaned_text": "Vaccine purchasers must “indemnify, defend and hold harmless Pfizer … from and against any and all suits, claims, actions, demands, losses, damages, liabilities, settlements, penalties, fines, costs and expenses … arising out of, relating to, or resulting from the vaccine.”\n• A leaked document broken down by Twitter user Ehden reveals the shocking terms of Pfizer’s international COVID-19 vaccine agreements.\n• Countries that purchase Pfizer’s COVID-19 shot must acknowledge that “Pfizer’s efforts to develop and manufacture the product” are “subject to significant risks and uncertainties.”\n• In the event that a drug or other treatment comes out that can prevent, treat or cure COVID-19, the agreement stands, and the country must follow through with their vaccine order.\n• While COVID-19 vaccines are “free” to receive in the U.S., they’re being paid for by taxpayer dollars at a rate of $19.50 per dose — Albania, the leaked contract revealed, paid $12 per dose.\n• The purchaser of Pfizer’s COVID-19 vaccine must also acknowledge two facts that have largely been brushed under the rug: both their efficacy and risks are unknown.\n• Purchasers must also “indemnify, defend and hold harmless Pfizer … from and against any and all suits, claims, actions, demands, losses, damages, liabilities, settlements, penalties, fines, costs and expenses … arising out of, relating to, or resulting from the Vaccine.”\n\nVaccine makers have nothing to lose by marketing their experimental COVID-19 shots, even if they cause serious injury and death, as they enjoy full indemnity against injuries occurring from COVID-19 vaccines or any other pandemic vaccine under the Public Readiness and Emergency Preparedness (PREP) Act, passed in the U.S. in 2005.\n\nThe full extent of their COVID-19 vaccine indemnification agreements with countries, however, is a closely guarded secret, one that has remained highly confidential — until now. A leaked document broken down by Twitter user Ehden reveals the shocking terms of Pfizer’s international COVID-19 vaccine agreements.\n\n“These agreements are confidential, but luckily one country did not protect the contract document well enough, so I managed to get a hold of a copy,” he wrote. “As you are about to see, there is a good reason why Pfizer was fighting to hide the details of these contracts.”\n\nAn ironclad agreement, all on Pfizer’s terms\n\nThe alleged indemnification agreement, reportedly between Pfizer and Albania, was originally posted in snippets on Twitter, but Twitter now has them marked as “unavailable.” Copies of the tweets are available on Treadreader, however.\n\nThe Albania agreement appears very similar to another contract, published online, between Pfizer and the Dominican Republic. It covers not only COVID-19 vaccines, but any product that enhances the use or effects of such vaccines.\n\nCountries that purchase Pfizer’s COVID-19 shot must acknowledge that “Pfizer’s efforts to develop and manufacture the Product” are “subject to significant risks and uncertainties.”\n\nAnd in the event that a drug or other treatment comes out that can prevent, treat or cure COVID-19, the agreement stands, and the country must follow through with their order. Ivermectin, for instance, is not only safe, inexpensive and widely available but has been found to reduce COVID-19 mortality by 81%. Yet, it continues to be ignored in favor of more expensive, and less effective, treatments and mass experimental vaccination.\n\n“If you were wondering why #Ivermectin was suppressed,” Ehden wrote, “well, it is because the agreement that countries had with Pfizer does not allow them to escape their contract, which states that even if a drug will be found to treat COVID19 the contract cannot be voided.”\n\nEven if Pfizer fails to deliver vaccine doses within their estimated delivery period, the purchaser may not cancel the order. Further, Pfizer can make adjustments to the number of contracted doses and their delivery schedule, “based on principles to be determined by Pfizer,” and the country buying the vaccines must “agree to any revision.”\n\nIt doesn’t matter if the vaccines are delivered severely late, even at a point when they’re no longer needed, as it’s made clear that “Under no circumstances will Pfizer be subject to or liable for any late delivery penalties.” As you might suspect, the contract also forbids returns “under any circumstances.”\n\nThe big secret: Pfizer charged U.S. More Than Other Countries\n\nWhile COVID-19 vaccines are “free” to receive in the U.S., they’re being paid for by taxpayer dollars at a rate of $19.5011 per dose. Albania, the leaked contract revealed, paid $12 per dose, while the EU paid $14.70 per shot. While charging different prices to different purchases is common in the drug industry, it’s often frowned upon.\n\nIn the case of the price disparity between the U.S. and the EU, Pfizer is said to have given a price break to the EU because it financially supported the development of their COVID-19 vaccine. Still, Ehden noted, “U.S. taxpayers got screwed by Pfizer, probably also Israel.” Also, Pfizer makes a point to note that countries have no right to withhold payment to the company for any reason.\n\nApparently, this includes in the case of receiving damaged goods. Purchasers of Pfizer’s COVID-19 vaccines are not entitled to reject them “based on service complaints,” unless they do not conform to specifications or the FDA’s Current Good Manufacturing Practice regulations. And, Ehden adds, “This agreement is above any local law of the state.”\n\nWhile the purchaser has virtually no way of canceling the contract, Pfizer can terminate the agreement in the event of a “material breach” of any term in their contract.\n\nThe purchaser of Pfizer’s COVID-19 vaccine must also acknowledge two facts that have largely been brushed under the rug: Both their efficacy and risks are unknown. According to section 5.5 of the contract:\n\n“Purchaser acknowledges that the Vaccine and materials related to the Vaccine, and their components and constituent materials are being rapidly developed due to the emergency circumstances of the COVID-19 pandemic and will continue to be studied after provision of the Vaccine to Purchaser under this Agreement.\n\n“Purchaser further acknowledges that the long-term effects and efficacy of the Vaccine are not currently known and that there may be adverse effects of the Vaccine that are not currently known.”\n\nIndemnification by the purchaser is also explicitly required by the contract, which states, under section 8.1:\n\n“Purchaser hereby agrees to indemnify, defend and hold harmless Pfizer, BioNTech, each of their Affiliates, contractors, sub-contractors, licensors, licensees, sub-licensees, distributors, contract manufacturers, services providers, clinical trial researchers, third parties to whom Pfizer or BioNTech or any of their respective Affiliates may directly or indirectly owe an indemnity based on the research …\n\n“from and against any and all suits, claims, actions, demands, losses, damages, liabilities, settlements, penalties, fines, costs and expenses (including, without limitation, reasonable attorneys’ fees and other expenses of an investigation or litigation … arising out of, relating to, or resulting from the Vaccine …”\n\nMeanwhile, the purchaser must also keep the terms of the contract confidential for a period of 10 years.\n\nNot only does Pfizer have total indemnification, but there’s also a section in the contract titled, “Assumption of Defense by Purchaser,” which states that in the event Pfizer suffers losses for which it is seeking indemnification, the purchaser “shall promptly assume conduct and control of the defense of such Indemnified Claims on behalf of the Indemnitee with counsel acceptable to Indemnitee(s), whether or not the Indemnified Claim is rightfully brought.” Ehden notes:\n\n“Pfizer is making sure the country will pay for everything: ‘Costs and expenses, including … fees and disbursements of counsel, incurred by the Indemnitee(s) in connection with any Indemnified Claim shall be reimbursed on a quarterly basis by Purchaser.’”\n\nBuried in the March 17, 2020, Federal Register — the daily journal of the U.S. government — in a document titled, “Declaration Under the Public Readiness and Emergency Preparedness Act for Medical Countermeasures Against COVID-19,” is language that establishes a new COVID-19 vaccine court — similar to the federal vaccine court that already exists.\n\nIn the U.S., vaccine makers already enjoy full indemnity against injuries occurring from this or any other pandemic vaccine under the PREP Act. If you’re injured by a COVID vaccine (or a select group of other vaccines designated under the act), you’d have to file a compensation claim with the Countermeasures Injury Compensation Program (CICP), which is funded by U.S. taxpayers via Congressional appropriation to the Department of Health and Human Services (DHHS).\n\nWhile similar to the National Vaccine Injury Compensation Program (NVICP), which applies to nonpandemic vaccines, the CICP is even less generous when it comes to compensation. As reported by Dr. Meryl Nass,25 the maximum payout you can receive — even in cases of permanent disability or death — is $250,000 per person; however, you’d have to exhaust your private insurance policy before the CICP gives you a dime.\n\nThe CICP also has a one-year statute of limitations, so you have to act quickly, which is also difficult since it’s unknown if long-term effects could occur more than a year later.\n\nAs is apparent in Pfizer’s confidential contract with Albania, the drug giant wants governments to guarantee the company will be compensated for any expenses resulting from injury lawsuits against it. Pfizer has also demanded that countries put up sovereign assets, including bank reserves, military bases and embassy buildings, as collateral for expected vaccine injury lawsuits resulting from its COVID-19 inoculation.\n\nNew Delhi-based World Is One News (WION) reported in February 2021 that Brazil rejected Pfizer’s demands, calling them “abusive.” The demands included that Brazil:\n• “Waives sovereignty of its assets abroad in favor of Pfizer.”\n• Not apply its domestic laws to the company.\n• Exempt Pfizer from all civil liability for side effects.\n\nSTAT News also referred to concerns by legal experts, who also suggested Pfizer’s demands were an abuse of power. Mark Eccleston-Turner, a lecturer in global health law at Keele University in England, told STAT:\n\n“[Pfizer] is trying to eke out as much profit and minimize its risk at every juncture with this vaccine development then this vaccine rollout. Now, the vaccine development has been heavily subsidized already. So there’s very minimal risk for the manufacturer involved there.”\n\nPfizer continues to sign lucrative secret vaccine deals across the globe. In June 2021, they signed one of their biggest contracts to date — with the Philippine government for 40 million doses.\n\nMeanwhile, COVID-19 “breakthrough cases,” which used to be called vaccine failures, are on the rise. According to the U.S. Centers for Disease Control and Prevention (CDC), as of July 19, 5,914 people who had been fully vaccinated for COVID-19 were hospitalized or died from COVID-19.\n\nIn the U.K., as of July 15, 87.5% of the adult population had received one dose of COVID-19 vaccine and 67.1% had received two. Yet, symptomatic cases among partially and fully vaccinated are on the rise, with an average of 15,537 new infections a day being detected, a 40% increase from the week before.\n\nIn a July 19 report from the CDC, the agency also reported that the Vaccine Adverse Event Reporting System (VAERS) had received 12,313 reports of death among people who received a COVID-19 vaccine — more than doubling from the 6,079 reports of death from the week before.\n\nSoon after the report, however, they reverted the number to the 6,079 from the week before, indicating by default that no deaths from the vaccine had occurred that week,34 raising serious questions about transparency and vaccine safety.\n\nMany other adverse events are also appearing, ranging from risks from the biologically active SARS-CoV-2 spike protein used in the vaccine to blood clots, reproductive toxicity and myocarditis(heart inflammation). As you can see in the confidential indemnification agreements, however, even if the vaccine turns out to be a dismal failure — and a risk to short- and long-term health — countries have no recourse, nor does anyone who received the experimental shots.\n\nOne question that we should all be asking is this: If the COVID-19 vaccines are, in fact, as safe and effective as the manufacturers claim, why do they require this level of indemnification?\n\nYou can actually participate in the global efforts to cripple the Deep State organized criminal cabal's ability for genocide, while enjoying healthcare freedom at the same time, by boycotting Big Pharma for good.", "opengraph": {"type": "article", "title": "Leaked Document Reveals ‘Shocking’ Terms of Pfizer’s International Vaccine Agreements", "url": "https://geopolitics.co/2021/08/11/leaked-document-reveals-shocking-terms-of-pfizers-international-vaccine-agreements/", "description": "Vaccine purchasers must “indemnify, defend and hold harmless Pfizer … from and against any and all suits, claims, actions, demands, losses, damages, liabilities, settlements, penalties, fines, cost…", "article:published_time": "2021-08-11T06:12:23+00:00", "article:modified_time": "2021-08-15T09:46:36+00:00", "site_name": "Covert Geopolitics", "image": "https://geopolitics.co/wp-content/uploads/2021/08/pfizer-executives.jpg", "image:width": "900", "image:height": "506", "locale": "en_US"}, "tags": ["pfizer vaccines", "no liability clause", "pfizer purchase agreement", "pfizer deaths"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"474\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">PFIZERLEAK: EXPOSING THE PFIZER MANUFACTURING AND SUPPLY AGREEMENT.<br/><br/>(thread)<br/><br/>Background:<br/>Pfizer has been extremely aggressive in trying to protect the details of their international COVID19 vaccine agreements.<br/><br/>Luckily, I've managed to get one.<a href=\"https://twitter.com/hashtag/PfizerLeak?src=hash&amp;ref_src=twsrc%5Etfw\">#PfizerLeak</a><a href=\"https://twitter.com/hashtag/Pfizer?src=hash&amp;ref_src=twsrc%5Etfw\">#Pfizer</a> <a href=\"https://t.co/1JlyJzxByb\">pic.twitter.com/1JlyJzxByb</a></p>— Ehden @ TELEGRAM CHANNEL: T.ME/EH_DEN (@eh_den) <a href=\"https://twitter.com/eh_den/status/1419653002818990085?ref_src=twsrc%5Etfw\">July 26, 2021</a></blockquote> \n", "<blockquote class=\"twitter-tweet\" data-width=\"474\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">The CDC revised downward its official number of deaths reported to VAERS following COVID vaccines, but an analysis of VAERS data shows the CDC arrived at the new, lower number, by excluding reports of deaths from outside the U.S.<a href=\"https://t.co/HA2n8lkuMw\">https://t.co/HA2n8lkuMw</a></p>— Robert F. Kennedy Jr (@RobertKennedyJr) <a href=\"https://twitter.com/RobertKennedyJr/status/1418324080323870724?ref_src=twsrc%5Etfw\">July 22, 2021</a></blockquote> \n"], "movies": [], "links": ["https://childrenshealthdefense.org/defender_category/covid/", "https://childrenshealthdefense.org/defender/pfizer-vaccine-higher-risk-covid-variants/", "https://childrenshealthdefense.org/defender_category/big-pharma/", "https://childrenshealthdefense.org/defender_category/covid/", "https://childrenshealthdefense.org/defender/pfizer-demands-collateral-vaccine-injury-lawsuits/", "https://twitter.com/eh_den/status/1419653002818990085", "https://childrenshealthdefense.org/defender/pfizer-vaccine-higher-risk-covid-variants/", "https://twitter.com/hashtag/PfizerLeak?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/Pfizer?src=hash&ref_src=twsrc%5Etfw", "https://t.co/1JlyJzxByb", "https://twitter.com/eh_den/status/1419653002818990085?ref_src=twsrc%5Etfw", "https://twitter.com/eh_den/status/1419653002818990085", "https://threadreaderapp.com/thread/1419653002818990085.html", "https://threadreaderapp.com/thread/1419653002818990085.html", "https://www.keionline.org/misc-docs/Pfizer-DominicanRepublic-Vaccine-Term-Sheet-19Jan2021.pdf", "http://ti-health.org/wp-content/uploads/2021/05/Albania-Pfizer.pdf", "https://articles.mercola.com/sites/articles/archive/2021/06/24/use-of-ivermectin-for-covid-19.aspx", "https://archive.is/g11nU", "https://threadreaderapp.com/thread/1419653002818990085.html", "http://ti-health.org/wp-content/uploads/2021/05/Albania-Pfizer.pdf", "http://ti-health.org/wp-content/uploads/2021/05/Albania-Pfizer.pdf", "http://ti-health.org/wp-content/uploads/2021/05/Albania-Pfizer.pdf", "https://www.bmj.com/content/372/bmj.n281", "https://www.bmj.com/content/372/bmj.n281", "https://threadreaderapp.com/thread/1419653002818990085.html", "http://ti-health.org/wp-content/uploads/2021/05/Albania-Pfizer.pdf", "https://articles.mercola.com/sites/articles/archive/2021/01/29/pfizer-admits-vaccine-does-not-prevent-covid.aspx", "http://ti-health.org/wp-content/uploads/2021/05/Albania-Pfizer.pdf", "https://threadreaderapp.com/thread/1419653002818990085.html", "http://ti-health.org/wp-content/uploads/2021/05/Albania-Pfizer.pdf", "http://ti-health.org/wp-content/uploads/2021/05/Albania-Pfizer.pdf", "http://ti-health.org/wp-content/uploads/2021/05/Albania-Pfizer.pdf", "https://threadreaderapp.com/thread/1419653002818990085.html", "https://www.federalregister.gov/documents/2020/03/17/2020-05484/declaration-under-the-public-readiness-and-emergency-preparedness-act-for-medical-countermeasures", "https://articles.mercola.com/sites/articles/archive/2021/04/20/coronavirus-vaccine-safety-studies.aspx", "https://childrenshealthdefense.org/defender/injured-by-vaccine-how-to-report-it/", "https://www.hrsa.gov/cicp/", "https://articles.mercola.com/sites/articles/archive/2021/01/26/covid-vaccine-side-effects.aspx", "https://www.wionews.com/world/how-pfizer-tried-to-bully-argentina-and-brazil-in-exchange-for-vaccines-366037", "https://childrenshealthdefense.org/defender/pfizer-demands-collateral-vaccine-injury-lawsuits/", "https://www.wionews.com/world/how-pfizer-tried-to-bully-argentina-and-brazil-in-exchange-for-vaccines-366037", "https://articles.mercola.com/sites/articles/archive/2021/03/08/pfizer-covid-vaccine.aspx", "https://www.statnews.com/2021/02/23/pfizer-plays-hardball-in-covid19-vaccine-negotiations-in-latin-america/", "https://www.reuters.com/world/asia-pacific/philippines-signs-deal-40-mln-pfizerbiontech-vaccine-doses-report-2021-06-20/", "https://www.cdc.gov/vaccines/covid-19/health-departments/breakthrough-cases.html", "https://metro.co.uk/2021/07/15/number-of-people-catching-covid-with-at-least-one-jab-rises-40-in-a-week-14937047/", "https://articles.mercola.com/sites/articles/archive/2021/07/27/covid-vaccine-failure.aspx", "https://www.youtube.com/watch?v=Jv3Q74CLU1c&feature=emb_title", "http://web.archive.org/web/20210721040450/https:/www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/adverse-events.html", "https://articles.mercola.com/sites/articles/archive/2021/06/15/vaers-covid-19-vaccine-reaction-report.aspx", "https://childrenshealthdefense.org/defender/cdc-corrects-number-reported-deaths-vaers-covid-vaccines/", "https://t.co/HA2n8lkuMw", "https://twitter.com/RobertKennedyJr/status/1418324080323870724?ref_src=twsrc%5Etfw", "https://trialsitenews.com/should-you-get-vaccinated/", "https://articles.mercola.com/sites/articles/archive/2021/06/21/mrna-inventor-interviewed-about-injection-dangers.aspx", "https://childrenshealthdefense.org/defender/cdc-advisory-presentation-myocarditis-mrna-vaccines-flawed/", "https://ottawacitizen.com/news/local-news/increased-risk-of-heart-muscle-inflammation-linked-with-mrna-vaccines-seen-in-ottawa", "https://articles.mercola.com/sites/articles/archive/2021/08/03/pfizer-covid-19-vaccine-indemnification-agreement.aspx", "https://virutron.com/", "https://virutron.com/"], "authors": [], "publish_date": "2021-08-11T06:12:23+00:00"}