{"result_id": "083012", "URL": "https://geopolitics.co/2014/08/28/mmr-vaccine-causes-autism-cdc-datawhistleblower/", "timestamp": "2023-04-25 14:51:16 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://geopolitics.co/wp-content/uploads/2019/11/cg-icon-150x150.png", "canonical": "https://geopolitics.co/2014/08/28/mmr-vaccine-causes-autism-cdc-datawhistleblower/", "encoding": "UTF-8"}, "image": null, "domain": "geopolitics.co", "title": "MMR Vaccine Causes Autism [CDC Data/Whistleblower]", "cleaned_text": "The active participation of everyone in spreading inconvenient facts has put some courage to insiders to come out in the open and share their direct experience inside the most elaborate control mechanism that has plague the whole human consciousness with lies causing in it immeasurable injury.\n\n \n\n The vaccine scam, is just one of many devices that is so wicked it induces the public to subsidize its own demise.\n\n Finally, a CDC insider recently decided to put his knowledge and experience with how the agency, task of protecting the Americans, knowingly ignored enormous data confirming the relation between MMR vaccine and autism.\n\nAugust 27, 2014 Press Release, “Statement of William W. Thompson, Ph.D., Regarding the 2004 Article Examining the Possibility of a Relationship Between MMR Vaccine and Autism”\n\nFOR IMMEDIATE RELEASE-AUGUST 27,2014\n\n STATEMENT OF WILLIAM W. THOMPSON, Ph.D., REGARDING THE 2004 ARTICLE EXAMINING THE POSSIBILITY OF A RELATIONSHIP BETWEEN MMR VACCINE AND AUTISM\n\n My name is William Thompson. I am a Senior Scientist with the Centers for Disease Control and Prevention, where I have worked since 1998.\n\n I regret that my coauthors and I omitted statistically significant information in our 2004 article published in the journal Pediatrics. The omitted data suggested that African American males who received the MMR vaccine before age 36 months were at increased risk for autism. Decisions were made regarding which findings to report after the data were collected, and I believe that the final study protocol was not followed.\n\n I want to be absolutely clear that I believe vaccines have saved and continue to save countless lives. I would never suggest that any parent avoid vaccinating children of any race. Vaccines prevent serious diseases, and the risks associated with their administration are vastly outweighed by their individual and societal benefits.\n\n My concern has been the decision to omit relevant findings in a particular study for a particular sub­ group for a particular vaccine. There have always been recognized risks for vaccination and I believe it is the responsibility of the CDC to properly convey the risks associated with receipt of those vaccines.\n\n I have had many discussions with Dr. Brian Hooker over the last 10 months regarding studies the CDC has carried out regarding vaccines and neurodevelopmental outcomes including autism spectrum disorders. I share his belief that CDC decision-making and analyses should be transparent. I was not, however, aware that he was recording any of our conversations, nor was I given any choice regarding whether my name would be made public or my voice would be put on the Internet.\n\n I am grateful for the many supportive e-mails that I have received over the last several days.\n\n I will not be answering further questions at this time. I am providing information to Congressman William Posey, and of course will continue to cooperate with Congress. I have also offered to assist with reanalysis of the study data or development of further studies. For the time being, however, I am focused on my job and my family.\n\n Reasonable scientists can and do differ in their interpretation of information. I will do everything I can to assist any unbiased and objective scientists inside or outside the CDC to analyze data collected by the CDC or other public organizations for the purpose of understanding whether vaccines are associated with an increased risk of autism. There are still more questions than answers, and I appreciate that so many families are looking for answers from the scientific community.\n\n My colleagues and supervisors at the CDC have been entirely professional since this matter became public. In fact, I received a performance-based award after this story came out. I have experienced no pressure or retaliation and certainly was not escorted from the building, as some have stated.\n\n Dr. Thompson is represented by Frederick M. Morgan,Jr., Morgan Verkamp, LLC, Cincinnati, Ohio, www.morganverkamp.com.\n\n source »\n\n Please support us by downloading our Towards Healthcare Emancipation – Premium Edition, a fully illustrated eBook about how you can implement a low cost but extensive and decisively effective healthcare system in the comfort of your own home.\n\n With this eBook you can easily defeat cancer, AIDS and all other parasitic diseases for good. Find out more about it here. The proceeds from this book will be used to fund our next project, Towards Energy Emancipation. The aim is to make the subject of free energy more understandable for the layman so that anybody could replicate and install his own power plant and be completely living off-grid.\n\n If you haven’t done so, please like our FB page to encourage others to learn more about our work. Thank you very much for your valuable support.\n\nYou can actually participate in the global efforts to cripple the Deep State organized criminal cabal's ability for genocide, while enjoying healthcare freedom at the same time, by boycotting Big Pharma for good.", "opengraph": {"type": "article", "title": "MMR Vaccine Causes Autism [CDC Data/Whistleblower]", "url": "https://geopolitics.co/2014/08/28/mmr-vaccine-causes-autism-cdc-datawhistleblower/", "description": "The active participation of everyone in spreading inconvenient facts has put some courage to insiders to come out in the open and share their direct experience inside the most elaborate control mec…", "article:published_time": "2014-08-28T06:58:41+00:00", "article:modified_time": "2014-08-28T06:58:41+00:00", "site_name": "Covert Geopolitics", "image": "https://geopolitics.co/wp-content/uploads/2014/08/mmr-autism1.jpg", "image:width": "667", "image:height": "430", "locale": "en_US"}, "tags": ["cdc", "MMR vaccine and autism"], "tweets": [], "movies": [], "links": ["http://www.morganverkamp.com/", "http://www.morganverkamp.com/august-27-2014-press-release-statement-of-william-w-thompson-ph-d-regarding-the-2004-article-examining-the-possibility-of-a-relationship-between-mmr-vaccine-and-autism/", "http://myeclinik.com/product/cure-for-cancer-and-aids-towards-healthcare-emancipation-2-x#details", "http://myeclinik.com/product/cure-for-cancer-and-aids-towards-healthcare-emancipation-2-x#details", "https://www.facebook.com/eclinik", "http://www.topblogs.com.ph/health-medicine/", "https://virutron.com/", "https://virutron.com/"], "authors": [], "publish_date": "2014-08-28T06:58:41+00:00"}