{"result_id": "083032", "URL": "https://geopolitics.co/2022/09/05/confirmed-pentagon-unlawfully-forced-us-service-members-to-take-unlicensed-covid-shots/", "timestamp": "2023-04-25 14:51:31 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://geopolitics.co/wp-content/uploads/2019/11/cg-icon-150x150.png", "canonical": "https://geopolitics.co/2022/09/05/confirmed-pentagon-unlawfully-forced-us-service-members-to-take-unlicensed-covid-shots/", "encoding": "UTF-8"}, "image": null, "domain": "geopolitics.co", "title": "CONFIRMED: Pentagon Unlawfully Forced US Service Members to Take Unlicensed COVID Shots", "cleaned_text": "A new Freedom of Information Act (FOIA) document obtained by The Dossier proves without a doubt that the U.S. Department of Defense did not have FDA approved COVID-19 vaccines in its possession — despite top DOD officials claiming otherwise — while unlawfully forcing service members to take the shots, under the very real threat of separation, court martial, and other severe ramifications.\n\nThe Dossier has verified the authenticity of the FOIA document, which is published below. We’ve redacted personal information.\n\nReplying to a question about the Defense Department’s possession of Pfizer’s Comirnaty, which in the context of the question can be understood as the FDA approved version of the COVID-19 vaccines, the Defense Logistics Agency responds:\n\n“We began shipping Comirnaty labeled vaccine in June 2022. From the week of June 13, 2022, through the week of August 29, 2022, we will have shipped 9600 doses (160 boxes) of vaccine.”\n\nThey did not have anything with a Comirnaty label until June 2022. That’s almost a full year after the DOD vaccine mandate went into effect.\n\nThis is an admission that service members were injected exclusively with emergency use authorization products. Today, active duty troops continue to be harassed, threatened, and punished for non compliance with the unlawful order.\n\nIt remains unclear what exactly the response of “Comirnaty labeled” means. It likely is a product of legal sleight of hand, as no FDA approved shot has become available to service members. The question about Moderna’s FDA approved Spikevax was not answered directly, so unfortunately, there is no value in that portion of the FOIA response.\n\nNonetheless, the Department of Defense is now on record admitting that ZERO FDA approved shots were made available to service members.\n\nBut that wasn’t what top Pentagon officials were saying at the time of the unlawful mandate.\n\nDr. Terry Adirim, the former Pentagon official who wrote the infamous Pentagon memo attempting to justify mandating EUA shots as if they were FDA approved, has repeatedly claimed on social media and elsewhere that the licensed FDA product was indeed available to service members at the time of the mandate. We now know her statements, and those of other Pentagon officials making similar claims, were demonstrably false. In response to inquiries about this topic, Adirim, who has since moved over to the department of Veterans Affairs, has locked her social media accounts.\n\nAs The Dossier has reported, Pfizer admitted in May 2022 that it never did and never will produce the original FDA approved shots. For many months, the trail of evidence seemed to render it unlikely, if not impossible, for the Pentagon to have obtained the FDA approved ghost shots. Today, we know for certain that is the case.\n\nTop military officials misled the public, detonated readiness, and caused tremendous harm to the countless vaccine injured service members, through an unlawful order purportedly designed to “protect” them against a disease that does not threaten them. The DOD has finally acknowledged, through this latest FOIA response, that there was no legal basis for any of this. Now, who will be held accountable?\n\nYou can actually participate in the global efforts to cripple the Deep State organized criminal cabal's ability for genocide, while enjoying healthcare freedom at the same time, by boycotting Big Pharma for good.", "opengraph": {"type": "article", "title": "CONFIRMED: Pentagon Unlawfully Forced US Service Members to Take Unlicensed COVID Shots", "url": "https://geopolitics.co/2022/09/05/confirmed-pentagon-unlawfully-forced-us-service-members-to-take-unlicensed-covid-shots/", "description": "A new Freedom of Information Act (FOIA) document obtained by The Dossier proves without a doubt that the U.S. Department of Defense did not have FDA approved COVID-19 vaccines in its possession — d…", "article:published_time": "2022-09-05T03:20:18+00:00", "article:modified_time": "2022-09-16T17:53:48+00:00", "site_name": "Covert Geopolitics", "image": "https://geopolitics.co/wp-content/uploads/2022/09/201223-A-AB123-001.jpg", "image:width": "825", "image:height": "550", "locale": "en_US"}, "tags": ["military vaccination"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"474\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">‼️‼️‼️ “They were escorted to the gate like they were criminals or something,” the lawyer, Michael Rose, told the newspaper.<br/><br/>Unvaccinated cadets ordered off Coast Guard Academy campus<a href=\"https://t.co/GubUGPZCZi\">https://t.co/GubUGPZCZi</a></p>— Kristina Wong 🇺🇸 (@kristina_wong) <a href=\"https://twitter.com/kristina_wong/status/1565082696015134721?ref_src=twsrc%5Etfw\">August 31, 2022</a></blockquote> \n", "<blockquote class=\"twitter-tweet\" data-width=\"474\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">Air Force Officer Facing Court-Martial After Refusing COVID-19 Vaccine<a href=\"https://t.co/Q90T6RGkHh\">https://t.co/Q90T6RGkHh</a></p>— R. Davis Younts (@younts_r) <a href=\"https://twitter.com/younts_r/status/1514900583177756672?ref_src=twsrc%5Etfw\">April 15, 2022</a></blockquote> \n", "<blockquote class=\"twitter-tweet\" data-width=\"474\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">Remember when <a href=\"https://twitter.com/TerryAdirimMD?ref_src=twsrc%5Etfw\">@TerryAdirimMD</a> said their was enough licensed vaccine for all and that it was available to servicemembers? This FOIA request determined THAT was a lie. <a href=\"https://t.co/ioRHho9rYY\">pic.twitter.com/ioRHho9rYY</a></p>— Terminalcwo (@terminalcwo) <a href=\"https://twitter.com/terminalcwo/status/1565062518506229760?ref_src=twsrc%5Etfw\">August 31, 2022</a></blockquote> \n", "<blockquote class=\"twitter-tweet\" data-width=\"474\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">Hello <a href=\"https://twitter.com/DeptofDefense?ref_src=twsrc%5Etfw\">@DeptofDefense</a> <a href=\"https://twitter.com/SecDef?ref_src=twsrc%5Etfw\">@SecDef</a> can y’all explain what fda approved vaccine you are talking about? Colonel Tonya rans <a href=\"https://twitter.com/MilitaryHealth?ref_src=twsrc%5Etfw\">@MilitaryHealth</a> made a declaration that Comirnaty wasn’t available for the DoD prior to may 20,2022? So who is lying? And BLA compliant isn’t real so let’s back off <a href=\"https://t.co/pz1fDF3VtM\">pic.twitter.com/pz1fDF3VtM</a></p>— JanineG385 (@JanineG385) <a href=\"https://twitter.com/JanineG385/status/1556640582285549568?ref_src=twsrc%5Etfw\">August 8, 2022</a></blockquote> \n"], "movies": [], "links": ["https://t.co/GubUGPZCZi", "https://twitter.com/kristina_wong/status/1565082696015134721?ref_src=twsrc%5Etfw", "https://t.co/Q90T6RGkHh", "https://twitter.com/younts_r/status/1514900583177756672?ref_src=twsrc%5Etfw", "https://dossier.substack.com/p/biden-officials-scramble-to-escape", "https://twitter.com/TerryAdirimMD?ref_src=twsrc%5Etfw", "https://t.co/ioRHho9rYY", "https://twitter.com/terminalcwo/status/1565062518506229760?ref_src=twsrc%5Etfw", "https://twitter.com/DeptofDefense?ref_src=twsrc%5Etfw", "https://twitter.com/SecDef?ref_src=twsrc%5Etfw", "https://twitter.com/MilitaryHealth?ref_src=twsrc%5Etfw", "https://t.co/pz1fDF3VtM", "https://twitter.com/JanineG385/status/1556640582285549568?ref_src=twsrc%5Etfw", "https://dossier.substack.com/p/military-whistleblowers-dods-legally", "https://dossier.substack.com/p/new-docs-confirm-pentagon-unlawfully", "https://virutron.com/", "https://virutron.com/"], "authors": [], "publish_date": "2022-09-05T03:20:18+00:00"}