{"result_id": "083025", "URL": "https://geopolitics.co/2020/09/05/bill-gates-vaccine-company-moderna-has-a-big-problem/", "timestamp": "2023-04-25 14:51:26 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://geopolitics.co/wp-content/uploads/2019/11/cg-icon-150x150.png", "canonical": "https://geopolitics.co/2020/09/05/bill-gates-vaccine-company-moderna-has-a-big-problem/", "encoding": "UTF-8"}, "image": null, "domain": "geopolitics.co", "title": "Bill Gates’ Vaccine Company Moderna Has A Big Problem", "cleaned_text": "Pseudo-philanthropist Bill Gates, the anointed figurehead of the systematic, and breathtaking implementation of the New World Order, now rebranded as the New Normal, is experiencing a problem with his Moderna, and stockholders should divest their investments right away, as the company’s executives are now doing.\n\nAccording to an NPR report,\n\nWhether the coronavirus vaccine developed by Moderna succeeds or not, executives at the small biotech company have already made tens of millions of dollars by cashing in their stock. An NPR examination of official company disclosures has revealed additional irregularities and potential warning signs. “On a scale of one to 10, one being less concerned and 10 being the most concerned,” said Daniel Taylor, an associate professor of accounting at the Wharton School, “this is an 11.” Taylor said Moderna’s stock-selling practices appear well outside the norm, and raise questions about the company’s internal controls to prevent insider trading. Stephane Bancel, chief executive officer of Moderna Therapeutics Inc., stands for a photograph at the company’s office in Cambridge, Massachusetts, U.S., on Tuesday, Nov. 14, 2017. Moderna this week started testing a personalized treatment that teaches the body how to fight cancer. Photographer: Adam Glanzman/Bloomberg via Getty Images Since January, CEO Stéphane Bancel has sold roughly $40 million worth of Moderna stock held by himself or associated investment funds; Chief Medical Officer Tal Zaks has sold around $60 million; and President Stephen Hoge has sold more than $10 million. No clear evidence has emerged indicating that executives sold stock based on confidential internal information, which would be illegal. And as long as they don’t engage in insider trading, executives are typically free to sell company stock.\n\nIt goes beyond “bad optics”, as Moderna is overtaken by the Russians, which changes the whole ballgame.\n\nAs we’ve already known by now, the Russian Sputnik V COVID19 vaccine has received positive evaluation from The Lancet for having induced the production of antibodies in all 79 individuals tested.\n\nWhereas, Moderna became silent right after the announcement of “positive test results” from a vaccine trial in May, although those test results were also reported to be heavily “doctored.”\n\nThe May announcement obviously led to a jump in Modena’s stock price, which profited mostly its own executives.\n\nAt that point, the company’s share price jumped and official disclosures showed executives cashing in their shares for millions of dollars. “As long as stocks are sold after public announcements – and not before – one might conclude that for an executive with significant net worth tied up in the company, it’s a prudent thing to do,” said Marc Fagel, a former longtime enforcement official with the Securities And Exchange Commission (SEC). “But the optics aren’t great.” The Moderna vaccine was quick to reach a phase 3 trial, and is seen as a promising contender. But, in some ways, the executives’ stock sales have overshadowed the company’s progress.\n\nAdvocates have questioned whether it’s appropriate for executives to privately profit before bringing the vaccine to market, especially when American taxpayers have committed roughly $2.5 billion to the company’s vaccine development and manufacture.\n• Stock Sales Worth Tens of Millions: Since June 1, NPR has found, company executives have sold roughly $90 million worth of Moderna stock. Rather than put a hold on the trades after facing intense criticism in May, company executives continued to sell.\n• Questionable Modifications to Stock Sale Plans: Moderna says its executives pre-scheduled their stock sales long in advance. Those schedules – known as 10b5-1 plans – can act as a defense to charges of insider trading. But the plans have to be put in place when executives do not have confidential inside information. NPR has found multiple executives adopted or modified their plans just before key announcements about the company’s vaccine. That has raised questions about whether they were aware of nonpublic information when they planned their stock trades.\n• Selling To Zero: Generally, corporate best practices suggest that a company’s leadership should hold on to at least some stock in their company to have “skin in the game.” That way, the thinking goes, an executive has an incentive to improve the company’s performance. As Moderna has been developing its coronavirus vaccine, two executives, including the Chief Medical Officer, have sold all their stock holdings in the company. The General Counsel has sold nearly all of her holdings.\n\nWhat we need to understand though is that Bill Gates is not only after a “working” vaccine, but a fully microchipped population tied up to the AI-based control grid, either through injectable microrobots, or a mandatory RFID vaccine passport, which a sizable portion of the population are either still in denial of, or are simply ignorant about where this induced pandemic is leading us into.\n\nIn fact, some countries like the Philippines are already requiring their citizens to download a printable QR code [personal data required] that needs to be presented for scanning when shopping in a mall, or simply entering the vicinity of a public market. Each business establishment is also requiring to log-in the names and phone numbers of its patrons for more efficient “contact tracing” later on.\n\nAlthough public officials have assured that all travel data will be deleted from the system within 30 days, we know for a fact that just like the now regular inspection of personal effects when entering public places right in the aftermath of the WTC911 “terrorists” bombing, this monitoring of personal activities will linger on indefinitely, as governments rarely let go of such immense power to monitor and control the movements of its population.\n\nYou can actually participate in the global efforts to cripple the Deep State organized criminal cabal's ability for genocide, while enjoying healthcare freedom at the same time, by boycotting Big Pharma for good.", "opengraph": {"type": "article", "title": "Bill Gates’ Vaccine Company Moderna Has A Big Problem", "url": "https://geopolitics.co/2020/09/05/bill-gates-vaccine-company-moderna-has-a-big-problem/", "description": "Pseudo-philanthropist Bill Gates, the anointed figurehead of the systematic, and breathtaking implementation of the New World Order, now rebranded as the New Normal, is experiencing a problem with …", "article:published_time": "2020-09-05T03:55:52+00:00", "article:modified_time": "2020-09-12T14:09:45+00:00", "site_name": "Covert Geopolitics", "image": "https://geopolitics.co/wp-content/uploads/2020/09/moderna.jpg", "image:width": "892", "image:height": "501", "locale": "en_US"}, "tags": ["bill gates", "moderna stocks", "gates vaccine", "moderna vaccine"], "tweets": [], "movies": [], "links": ["https://www.npr.org/2020/09/04/908305074/bad-optics-or-something-more-moderna-executives-stock-sales-raise-concerns", "https://eclinik.net/gates-moderna-hiding-clinical-trial-results-for-groundbreaking-covid-vaccine/", "https://www.npr.org/sections/coronavirus-live-updates/2020/07/27/895672859/us-vaccine-candidate-heads-to-widespread-testing-in-people", "https://www.investopedia.com/terms/s/skininthegame.asp", "https://virutron.com/", "https://virutron.com/"], "authors": [], "publish_date": "2020-09-05T03:55:52+00:00"}