{"result_id": "083007", "URL": "https://geopolitics.co/2022/02/06/290-fully-vaccinated-massachusetts-residents-died-of-covid-19-over-past-week/", "timestamp": "2023-04-25 14:51:12 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://geopolitics.co/wp-content/uploads/2019/11/cg-icon-150x150.png", "canonical": "https://geopolitics.co/2022/02/06/290-fully-vaccinated-massachusetts-residents-died-of-covid-19-over-past-week/", "encoding": "UTF-8"}, "image": null, "domain": "geopolitics.co", "title": "290 Fully Vaccinated Massachusetts Residents Died of COVID-19 Over Past Week", "cleaned_text": "Nearly 300 fully vaccinated residents in Massachusetts died of breakthrough COVID-19 over the past week even as case numbers have dropped statewide.\n\nBetween Jan. 22 and 29, Massachusetts health officials reported 290 additional breakthrough COVID-19 deaths, bringing the state’s total death toll among the fully vaccinated to 1,789. The figure represents 0.03% of the state’s inoculated population.\n\nDuring the same period, health officials also recorded 27,530 new breakthrough infections and 555 additional hospitalizations. The state has now reported a total of 422,132 cases and 6,440 admissions among the fully vaccinated. The numbers represent 8.1% and 0.12% of the state’s inoculated population, respectively, according to the latest COVID-19 Vaccine Data from the Massachusetts Department of Public Health.\n\nA breakthrough case refers to when a person who has been fully vaccinated or boosted against COVID-19 tests positive for the virus at least 14 days after the last dose.\n\nDespite the rising number of breakthrough cases, public health experts still urge people to get vaccinated, noting that the shots help prevent severe illness, hospitalizations and deaths. Health experts also note that breakthrough cases are expected as no vaccine is 100% effective in preventing an infection.\n\nThe report from the Department of Public Health comes as Massachusetts has reported a 62% decrease in daily new cases over the past 14 days, an analysis of data conducted by CNN found.\n\nOn Wednesday, Massachusetts health officials reported 4,973 new confirmed cases and 87 additional deaths among the unvaccinated and vaccinated. This puts the state’s overall infections to 1,493,224 and deaths to 21,633 since the beginning of the pandemic.\n\nOver the past 14 days, the majority of the cases occurred in people aged 20 to 29. The least number of cases were reported in people aged 80 and older.\n\nAs of Wednesday, there are a total of 1,799 patients hospitalized for COVID-19 in Massachusetts. At least 298 patients have been admitted to Intensive Care Units (ICU) and 176 are intubated.\n\nThe state’s seven-day rolling average test positivity hit 6.37% on Wednesday, down from 7.13% reported Tuesday, according to the health department’s dashboard.\n\nYou can actually participate in the global efforts to cripple the Deep State organized criminal cabal's ability for genocide, while enjoying healthcare freedom at the same time, by boycotting Big Pharma for good.", "opengraph": {"type": "article", "title": "290 Fully Vaccinated Massachusetts Residents Died of COVID-19 Over Past Week", "url": "https://geopolitics.co/2022/02/06/290-fully-vaccinated-massachusetts-residents-died-of-covid-19-over-past-week/", "description": "Nearly 300 fully vaccinated residents in Massachusetts died of breakthrough COVID-19 over the past week even as case numbers have dropped statewide.", "article:published_time": "2022-02-06T03:33:40+00:00", "article:modified_time": "2022-02-16T06:04:31+00:00", "site_name": "Covert Geopolitics", "image": "https://geopolitics.co/wp-content/uploads/2022/02/9a5fa9959aaa6e7aef32ac813f242294.jpg", "image:width": "960", "image:height": "540", "locale": "en_US"}, "tags": ["vaccine deaths", "covid19 vaccine"], "tweets": [], "movies": [], "links": ["https://www.mass.gov/doc/weekly-report-covid-19-cases-in-vaccinated-individuals-february-1-2022/download", "https://geopolitics.co/wp-content/uploads/2022/02/weekly-report-covid-19-cases-in-vaccinated-individuals-2-1-2022-rev.pdf", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/effectiveness/index.html", "https://edition.cnn.com/interactive/2020/health/coronavirus-us-maps-and-cases/", "https://www.mass.gov/info-details/covid-19-response-reporting#covid-19-interactive-data-dashboard-", "https://www.ibtimes.com/290-fully-vaccinated-massachusetts-residents-died-covid-19-over-1-week-3389234", "https://virutron.com/", "https://virutron.com/"], "authors": [], "publish_date": "2022-02-06T03:33:40+00:00"}