{"result_id": "083033", "URL": "https://geopolitics.co/2021/12/06/fda-cdc-ignore-damning-report-90-of-hospitals-admissions-were-vaccinated-for-covid-19/", "timestamp": "2023-04-25 14:51:32 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://geopolitics.co/wp-content/uploads/2019/11/cg-icon-150x150.png", "canonical": "https://geopolitics.co/2021/12/06/fda-cdc-ignore-damning-report-90-of-hospitals-admissions-were-vaccinated-for-covid-19/", "encoding": "UTF-8"}, "image": null, "domain": "geopolitics.co", "title": "FDA & CDC Ignore Damning Report 90+% of Hospital’s Admissions were Vaccinated for Covid-19", "cleaned_text": "A concerned Physician Assistant, Deborah Conrad, convinced her hospital to carefully track the Covid-19 vaccination status of every patient admitted to her hospital. The result is shocking.\n\nAs Ms. Conrad has detailed, her hospital serves a community in which less than 50% of the individuals were vaccinated for Covid-19 but yet, during the same time period, approximately 90% of the individuals admitted to her hospital were documented to have received this vaccine.\n\nThese patients were admitted for a variety of reasons, including but not limited to COVID-19 infections. Even more troubling is that there were many individuals who were young, many who presented with unusual or unexpected health events, and many who were admitted months after vaccination.\n\nOne would think that after an association was identified by a healthcare professional, our health authorities would at least review this finding, right? Sadly, when Ms. Conrad reached out to health authorities herself, she was ignored.\n\nMy firm then sent a letter to the CDC and FDA on July 19, 2021 on Ms. Conrad’s behalf (see letter below), yet neither agency has responded. Even worse, when doctors came to Ms. Conrad for assistance with filing VAERS report for their patients, the hospital prohibited her from filing these reports.\n\nThat the CDC and FDA failed to respond is arguably not surprising – they have been cheerleading this vaccine for months. Admitting almost any harm now would be akin to asking them to turn a gun on themselves.\n\nThis again highlights the importance of never permitting government coercion and mandates when it comes to medical procedures.\n\nFull letter to the CDC and FDA:\n\nYou can actually participate in the global efforts to cripple the Deep State organized criminal cabal's ability for genocide, while enjoying healthcare freedom at the same time, by boycotting Big Pharma for good.", "opengraph": {"type": "article", "title": "FDA & CDC Ignore Damning Report 90+% of Hospital’s Admissions were Vaccinated for Covid-19", "url": "https://geopolitics.co/2021/12/06/fda-cdc-ignore-damning-report-90-of-hospitals-admissions-were-vaccinated-for-covid-19/", "description": "A concerned Physician Assistant, Deborah Conrad, convinced her hospital to carefully track the Covid-19 vaccination status of every patient admitted to her hospital.  The result is shocking.&n…", "article:published_time": "2021-12-06T06:48:34+00:00", "article:modified_time": "2021-12-23T15:21:43+00:00", "site_name": "Covert Geopolitics", "image": "https://geopolitics.co/wp-content/uploads/2021/12/United-Memorial-Medical-Center.jpg", "image:width": "1024", "image:height": "683", "locale": "en_US"}, "tags": ["forced vaccination", "eugenics"], "tweets": [], "movies": [], "links": ["https://geopolitics.co/wp-content/uploads/2021/12/Letter-Re-First-Hand-Account-of-Covid-19-Vaccine-Injuries-and-Underreporting-to-VAERS-1.pdf", "https://geopolitics.co/wp-content/uploads/2021/12/Letter-Re-First-Hand-Account-of-Covid-19-Vaccine-Injuries-and-Underreporting-to-VAERS-1.pdf", "https://geopolitics.co/wp-content/uploads/2021/12/Letter-exchange-with-Rochester-Hospital.pdf", "https://geopolitics.co/wp-content/uploads/2021/12/Letter-exchange-with-Rochester-Hospital.pdf", "https://substack.com/profile/32334676-aaron-siri", "https://virutron.com/", "https://virutron.com/"], "authors": [], "publish_date": "2021-12-06T06:48:34+00:00"}