{"result_id": "084024", "URL": "https://creationwiki.org/Human_papillomavirus", "timestamp": "2023-04-25 14:52:18 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://creationwiki.org/Human_papillomavirus", "encoding": "UTF-8"}, "image": null, "domain": "creationwiki.org", "title": "Human papillomavirus - CreationWiki, the encyclopedia of creation science", "cleaned_text": "From CreationWiki, the encyclopedia of creation science\n\nThe Human Papilloma Virus (HPV) is known as being the most common sexually-transmitted infection in the US.[1] Although, it has been gaining a lot of attention from the media for its role in cervical cancer, only a few HPV types have a role in that disease. The term, Human papillomavirus, actually refers widely to a group of over 100 known related viruses that cause papillomas or warts. Some of those types of HPV are transmitted sexually while others, like the common wart, are spread by touch. [2]\n\nA virus is a nonliving genetic element that mainly consists of the genome, which contains the DNA particles.[3][4] The genome is surrounded by a capsid, a protein coat formed by individual protein molecules called capsomeres.[5] The Human Papillomavirus, specifically, is a virus that is about 55nm in diameter.[6]Also, this virus has icosahedral symmetry, meaning its shape resembles a figure with 20 equal triangular faces.[7] When magnified, the HPV resembles the shape of a golf ball.[8] Its DNA, genetic information, is found in a double-stranded, circular structure with approximately 8000 base pairs.[9][10] The capsid of the HPV is composed of 72 capsomeres.[11]Unlike other viruses, the HPV is non-enveloped, meaning that there is not an extra lipid bilayer surrounding the virus's capsid.[12]\n\nThe Human papillomavirus is attracted to the epithelial surfaces of the human body and often enters after trauma to the surface of skin.[13] Of the estimated 100 types of this virus, 40 are spread through sexual contact and infect the anal and genital areas of the body. The other 60 infect other parts of the body like the hands and feet.[14] After entering the epithelial surface, the virus will enter the more mature squamous cells located deeper within the skin. There it will uncoat and insert its DNA into the nuclei. Then it will use the machinery of the cell to manufacture more copies of its viral DNA.[15] In HPV 16, the virus expresses genes that begin the cell transformation and prohibit the cell's regular cycle and the cell's response to DNA damage. This allows the infected cell to be replicated constantly. The new, infected cells can form warts and spread to the surface of the skin. There, it can find a new host by human contact.[16] Sometimes however, the viral infection will remain latent and show no symptoms. In fact, HPV is asymptomatic most of the time. If it is a latent infection, the infected cell will fail to differentiate, or change dramatically.[17] In this case, the HPV infection will fail to show any signs or symptoms, which often leads to the unknowing spread of the virus.[18] In addition, each HPV type is specific to a particular region of the body, like the hands or feet. Human papillomaviruses will not affect areas of the body that it is not specific to.\n\nThe approximately 100 types of HPV are categorized into numbered subtypes. Many people are infected by HPV, but only a few will actually witness symptoms or problems. Often times, the HPV infection will be eliminated by the body's immune system or it simply remains latent. The HPV can be an underlying cause for many diseases. [19] It affects many different parts of the body. Each HPV type is specific to a certain area. For example, HPV 1, 2, and 4 cause warts or lesions on the hands and feet.[20] Some HPV's can continue to cause recurring warts as well. HPV 6 and 11 can cause both genital warts and a rare disease called respiratory papillomatosis. This disease occurs when warts form on the larynx or other portions of the respiratory tract.[21] Other HPV's cause cancer and tumors in other parts of the body, such as the anus or the head and neck.\n\nCervical cancer is the third leading cause of death from cancer and is caused by 10-30 types of HPV.[22] The cervix is the lower portion of the uterus. When it opens, it allows for the birth of the baby to occur. Because of its unique makeup, it is more predisposed to disease. [23] HPV is known for its role in the development of cervical cancer. The types that are most commonly associated with cervical cancer are HPV 16, 18, 31, and 45. These types are considered high-risk and can lead to cervical, anal, penile, and vulvar cancer. However, these are only transmitted sexually. [24] People who develop cervical cancer have usually been infected for a long time, sometimes up to several years. The infected cells have developed permanent damage to their DNA. In the cervix, the infection causes the cells to expand, become distorted, and leave their normal order of rows and columns. If left untreated, the abnormal cells will spread throughout the cervix causing cancer.[25]\n\nThe presence of many types of HPV is usually discovered after the appearance of warts. However, cancerous or precancerous cells in the cervix are generally found by a woman's gynecologist. The doctor uses a technique called a pap smear, where they gather a sample of cells from the cervix. After examination of those cells under the microscope, the doctor can determine whether there are any infected cells. If there are HPV infected cells, the doctor can evaluate what strain of HPV caused the infection and the amount of risk that the woman faces. The treatment for early cervical cancer involves the biopsy and freezing of the infected tissue[26] When it comes to treatment of external warts or lesions, approximately 30 to 40 percent of warts will be eliminated by the body's immune system. However, the doctor can remove the wart using techniques involving freezing or laser therapy. [27]\n\nThe HPV infection that strikes the genital areas is very common. Approximately 20 million people in the U.S. can be infected at any given time. However, the type and pattern of sexual activity seems to play a major role in contracting the virus. Because of a more relaxed attitude toward sex by young people, the spread of HPV in young people has grown in the past years. In fact, about 45% of teenage women had been infected by a strain at some point in their life. Smoking also contributes to the development of cervical cancer. Regular pap smears also play a huge role in prevention of cervical cancer, because early detection of cancerous cells can aid in treatment. A new test called the digene HPV test is now recommended for women age 30 and up. This age group is more likely to develop cervical cancer. Using the same sample of cells from a pap smear, the test can give more conclusive results than the normal pap smear. [28]\n\nThe development of the Gardasil vaccine is the latest method of protection against cervical cancer in women. It is also the only vaccine on the market that prevents a cancer.[29] Gardasil is a vaccine series of three doses over 6 months. It's recommended by both the company and doctors for women age 9 to age 26. This vaccine is advertised to protect against 4 types of HPV: Type 6, 11, 16, and 18. Two of those types cause 70% of cervical cancer cases. The other two cause 90% of genital warts cases. The known side effects include fainting, vomiting, dizziness, and sometimes fever.\n\nThe use of the Gardasil vaccine in young girls is a subject of much debate in the world. Many places are beginning to mandate the vaccine, and some are concerned whether young people will be encouraged to engage in sexual activity due to a false feeling of safety. Conservatives are worry that supporting the vaccination undermines abstinence teachings.[30] Others argue that the vaccination could serve as a precaution in the event of a unplanned sexual activity or even a sexual assault.[31]\n• The HPV Vaccine: Should your daughter get this controversial immunization? O'Connor, Lindsey. Today's Christian Women.\n• Health Observances: Some Cervical Disorders and Their PreventionGreg Tyler Allison, M.D., M.Sc. Healthline.com.\n• HPV: Bare Bone Basics: What Your Doctor May Not Tell You... enotalone.com", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/File:HPV.jpg", "/Sexually_transmitted_disease", "http://www.healthline.com/blogs/health_observances/2007_01_01_health_observances_archive.html", "/index.php?title=Cervical_cancer&action=edit&redlink=1", "http://www.webmd.com/sexual-conditions/hpv-genital-warts/hpv-virus-information-about-human-papillomavirus", "#Viral_characteristics", "#Structure", "#Life_Cycle", "#Associated_Diseases", "#Cervical_Cancer", "#Diagnosis_and_Treatment", "#Prevention_and_Vaccination", "#Ethics", "#References", "/Genome", "/DNA", "http://creationwiki.org/index.php/Virus", "http://www.cliffsnotes.com/WileyCDA/CliffsReviewTopic/Viral-Structure-and-Replication.topicArticleId-8524,articleId-8448.html", "http://www.cliffsnotes.com/WileyCDA/CliffsReviewTopic/Viral-Structure-and-Replication.topicArticleId-8524,articleId-8448.html", "http://web.uct.ac.za/depts/mmi/stannard/papillo.html", "http://www.brown.edu/Courses/Bio_160/Projects1999/hpv/path.html", "http://alpha.montclair.edu/~Williamss4/virus.htm", "http://alpha.montclair.edu/~Williamss4/virus.htm", "http://www.brown.edu/Courses/Bio_160/Projects1999/hpv/path.html", "http://www.brown.edu/Courses/Bio_160/Projects1999/hpv/path.html", "/Lipid", "http://alpha.montclair.edu/~Williamss4/virus.htm", "/File:Wart.jpg", "/File:Wart.jpg", "http://www.brown.edu/Courses/Bio_160/Projects1999/hpv/path.html", "/Virus", "http://www.webmd.com/sexual-conditions/hpv-genital-warts/hpv-virus-information-about-human-papillomavirus", "/Cell", "http://www.brown.edu/Courses/Bio_160/Projects1999/hpv/path.html", "/DNA", "http://www.bris.ac.uk/biochemistry/gaston/hpv_life_cycle.htm", "http://web.uct.ac.za/depts/mmi/jmoodie/hpv.html", "http://web.uct.ac.za/depts/mmi/jmoodie/hpv.html", "/Immune_system", "/Diseases", "http://alpha.montclair.edu/~Williamss4/virus.htm", "http://www.enotalone.com/article/3576.html", "/Respiratory_system", "http://en.wikipedia.org/wiki/Hpv", "/Cancer", "/Cancer", "http://www.gardasil.com/what-is-gardasil/information-on-gardasil/index.html#three", "http://www.healthline.com/blogs/health_observances/2007_01_01_health_observances_archive.html", "/Cancer", "/Sexually_transmitted_disease", "http://en.wikipedia.org/wiki/Hpv", "http://alpha.montclair.edu/~Williamss4/cancer.htm", "/index.php?title=Warts&action=edit&redlink=1", "/Microscope", "http://alpha.montclair.edu/~Williamss4/diagnosis.htm", "http://alpha.montclair.edu/~Williamss4/treatment.htm", "/File:HPV_pap_smear.jpg", "/File:HPV_pap_smear.jpg", "/index.php?title=Sexual_activity&action=edit&redlink=1", "/index.php?title=Smoking&action=edit&redlink=1", "http://www.thehpvtest.com/HPV-test-the-pap-HPV-faq.html?ageGroup=over#whatis", "/Vaccine", "/Cancer", "http://www.christianitytoday.com/tcw/2007/julaug/2.30.html?start=1", "/Vaccination", "http://www.christianitytoday.com/tcw/2007/julaug/2.30.html?start=1", "http://www.christianitytoday.com/tcw/2007/julaug/2.30.html?start=4", "/File:Feature_star.jpg", "/Category:Featured_articles", "http://www.christianitytoday.com/tcw/2007/julaug/2.30.html?start=1", "http://www.gardasil.com/hpv/hpv-types/hpv-transmission/?WT.srch=1&WT.mc_id=GL047", "http://www.healthline.com/blogs/health_observances/2007_01_01_health_observances_archive.html", "http://www.brown.edu/Courses/Bio_160/Projects1999/hpv/path.html", "http://web.uct.ac.za/depts/mmi/jmoodie/hpv.html", "http://www.forces-of-nature.net/topics/warts/hpv.htm", "http://en.wikipedia.org/wiki/Hpv", "http://www.webmd.com/sexual-conditions/hpv-genital-warts/hpv-virus-information-about-human-papillomavirus", "http://alpha.montclair.edu/~Williamss4/virus.htm", "http://creationwiki.org/index.php/Virus", "http://www.cliffsnotes.com/WileyCDA/CliffsReviewTopic/Viral-Structure-and-Replication.topicArticleId-8524,articleId-8448.html", "http://www.bris.ac.uk/biochemistry/gaston/hpv_life_cycle.htm", "http://www.enotalone.com/article/3576.html", "/Template:Biology_navbox", "/Template_talk:Biology_navbox", "https://creationwiki.org/index.php?title=Template:Biology_navbox&action=edit", "/Biology", "/Organisms", "/Animal", "/Algae", "/Amphibian", "/Bacteria", "/Bird", "/Created_kind", "/Crustaceans", "/Dinosaur", "/Fish", "/Fungi", "/Human", "/Insect", "/Mollusk", "/Plant", "/Protist", "/Reptiles", "/File:Animal_diversity.jpg", "/Biological_scientist", "/Agriculture", "/Anatomy", "/Baraminology", "/Biologist", "/Biotechnology", "/Botany", "/Cell_biology", "/Ecology", "/Epidemiology", "/Embryology", "/Entomology", "/Biological_evolution", "/Genetics", "/Herpetology", "/Human_biology", "/Medicine", "/Microscopy", "/Physiology", "/Taxonomy", "/Virology", "/Zoology", "/Biological_system", "/Auditory_system", "/Circulatory_system", "/Digestive_system", "/Endocrine_system", "/Immune_system", "/Integumentary_system", "/Limbic_system", "/Lymphatic_system", "/Muscular_system", "/Nervous_system", "/Olfactory_system", "/Reproductive_system", "/Respiratory_system", "/Sensory_system", "/Skeletal_system", "/Visual_system", "/Biological_process", "/Aging", "/Cell_division", "/Cellular_respiration", "/Disease", "/Embryogenesis", "/Gene_expression", "/Metabolism", "/Metamorphosis", "/Parasitism", "/Photosynthesis", "/Pregnancy", "/Protein_synthesis", "/Reproduction", "/Symbiosis", "/Trophic_level", "/File:Creationwiki_portals.png", "/Category:Biology", "/Portal:Biology", "/Biology_news_archive", "/File:Creationwiki_portals.png"], "authors": [], "publish_date": null}