{"result_id": "084014", "URL": "https://creationwiki.org/Influenza", "timestamp": "2023-04-25 14:52:02 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://creationwiki.org/Influenza", "encoding": "UTF-8"}, "image": null, "domain": "creationwiki.org", "title": "Influenza - CreationWiki, the encyclopedia of creation science", "cleaned_text": "From CreationWiki, the encyclopedia of creation science\n\nInfluenza, also known as the flu, is a disease which is caused by a virus that attacks the respiratory system. Influenza viruses were probably responsible for the disease described by Hippocrates in 412 BC.[1] Back in 1918 a world-wide pandemic killed more people than the first World War. Its cause was the Spanish flu.[2] It is the most devastating pandemic that is known.[3] Other major pandemics were the Asian flu pandemic in 1957 and the Hong Kong Influenza pandemic in 1968.[4] In 1989, the United Kingdom suffered the loss of an estimated 26,000 people to influenza [1]. In Canada, every year an estimated 7000 people die from influenza.[5] In the United States, every year 5%-20% of the population becomes infected, around 200,000 people are hospitalized from the flu, and around 36,000 deaths are cause by the flu.[6] There are many different strains of influenza, but they can be separated into three main viruses; A, B, and C. A person with influenza is at risk of a serious infection of the lungs. The risk of infection or death is higher for the elderly and young children. Influenza symptoms are sometimes thought to be similar to colds but influenza ends much worse if not treated properly.\n\nInfluenza symptoms include fever, cough, runny nose, and sore throat. It can also include tiredness, muscle pain, and headache. Some other viruses such as colds can cause some of the same symptoms, but influenza symptoms tend to be worse. Symptoms start around one to four days, after a person is first exposed to the virus. The fever along with other symptoms can last seven to ten days. The cough, muscle pain, and weakness can last up to two weeks following the last of the symptoms.[5]\n\nThere are three main types of Influenza which include A, B, and C. All three influenza viruses are characterized into different strains. New strains of influenza are being found all the time that replace old strains. This is why the influenza vaccine is updated every year.[2] \n\n\n\nType A: The Influenza A virus (also known as avian influenza) infect people and animals, but wild birds are the main host for the virus. Their are many subtypes of Influenza A. The subtypes are determined by two proteins that are found at the surface of the virus, the hemagglutinin (HA) and neuraminidase (NA). The subtypes is determined by the types of these proteins. There are at least 17 ​​different HA antigens. These subtypes are named H1 through to H17. There are at least 9 NA ​​different antigens, named N1 through to N9. Influenza A is the only flu virus that will affect birds. Usually, wild birds do not get sick when they are effected with influenza. Virions have separate hemagglutinin and neuraminidase spike proteins. Undergo antigenic shift and drift. Genome comprises eight molecules of RNA ranging from 900 to 2350 nt.[7]\n\nType B: Influenza B viruses are found only in humans. These viruses are not classified by their subtypes like Influenza A. Virions have separate hemagglutinin and neuraminidase spike proteins. Undergo antigenic drift only. Genome comprises eight molecules of RNA ranging from 900 to 2350 nt.[7]\n\nType C: Influenza C only causes a slight illness in humans. These viruses also are not classified into subtypes. Genome comprises seven molecules of RNA ranging from 1000 to 2350 nt. Virions have no neuraminidase. Undergo minor antigenic variation.[7]\n\nInfluenza viruses are spread from one person to another by tiny droplets of infected fluids, which come from coughing, sneezing, or even breathing. The infection then enters the lining of the respiratory tract. The virus binds to a sialic acid-containing surface protein and enters the cell via receptor-mediated endocytosis. [8] Influenza has a short incubation period that lasts up to around five days. The illness lasts for about three to five days.[3] Adults can spread the virus after they have come in contact with it for around one week and children can spread the virus for up to three weeks. [4]\n\nThe best way to prevent influenza and spreading it to others, is by washing your hands on a regular basis. Also, eating well and exercising help prevent getting infected. The influenza vaccine (aka flu shot) can help prevent you from getting influenza and from spreading it to other people. It is best to get the vaccine at the end of November, this allows your body around two weeks to build an immunity to the virus. [5]\n\nSome influenza A viruses can be prevented with certain drugs, such as amantadine and rimantadine. These drugs have been found to be 70-90% effective in preventing influenza. [6] Infection with influenza automatically produces an immune response by the production of antibodies in the blood. These antibodies can neutralize the virus and destroy it. The next time that person comes in contact with the same virus the body will all ready know how to destroy it so the virus can not harm the body. [7]\n\nBecause of the influenza virus has eight strands of RNA, if an individual or animal becomes infected by more than one type of virus, it is possible to generate novel combinations of viruses, producing diversity very rapidly. This is called reassortment and it occurs in influenza A viruses in nature. This is important in the appearance of pandemic in human populations.[9]\n• Influenza Virus Types, Subtypes, and Strains by Commonwealth of Pennsylvania\n• Facts about Influenza (the Flu) by BC Health", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/File:Flu.jpg", "/Avian_influenza", "/index.php?title=Influenzavirus_B&action=edit&redlink=1", "/index.php?title=Influenzavirus_C&action=edit&redlink=1", "/index.php?title=Isavirus&action=edit&redlink=1", "/index.php?title=Thogotovirus&action=edit&redlink=1", "/File:Flu2.jpg", "/Disease", "/Virus", "/Respiratory_system", "#cite_note-1", "#cite_note-2", "#cite_note-3", "#cite_note-sellwood1-4", "http://www.amm.co.uk/files/factsabout/fa_flu.htm", "#cite_note-facts-5", "#cite_note-6", "#Symptoms", "#Types", "#Spread_and_Prevention", "#References", "#External_links", "#Other_respiratory_diseases", "/Symptoms", "/Virus", "#cite_note-facts-5", "/File:Flu_and_color_legend.jpg", "/File:Flu_and_color_legend.jpg", "http://www.pandemicflu.state.pa.us/pandemicflu/cwp/view.asp?a=501&q=151742", "/File:Birdflu1.jpg", "/File:Birdflu1.jpg", "/Bird_flu", "/Cells", "/Avian_influenza", "/Avian_influenza", "/Animals", "/Birds", "/Virus", "/Protein", "#cite_note-modernv-7", "#cite_note-modernv-7", "#cite_note-modernv-7", "#cite_note-8", "http://www.amm.co.uk/files/factsabout/fa_flu.htm", "http://www.bchealthguide.org/healthfiles/hfile12b.stm#E46E1", "/Immunity", "/Virus", "http://www.bchealthguide.org/healthfiles/hfile12b.stm#E46E1", "/File:Flu1.jpg", "/File:Flu1.jpg", "/Influenza_A_viruses", "http://www.amm.co.uk/files/factsabout/fa_flu.htm", "http://www.amm.co.uk/files/factsabout/fa_flu.htm", "#cite_note-9", "#cite_ref-1", "/Special:BookSources/0-78176060-7", "/International_Standard_Book_Number", "#cite_ref-2", "/Special:BookSources/0-88202-118-4", "/International_Standard_Book_Number", "#cite_ref-3", "/Special:BookSources/978-0-470-02387-7", "/International_Standard_Book_Number", "#cite_ref-sellwood1_4-0", "/Special:BookSources/978-1-84593-578-8", "/International_Standard_Book_Number", "#cite_ref-facts_5-0", "#cite_ref-facts_5-1", "http://www.bchealthguide.org/healthfiles/hfile12b.stm#E46E1", "http://www.bchealthguide.org/healthfiles/hfile12b.stm#E46E1", "#cite_ref-6", "http://www.cdc.gov/flu/keyfacts.htm", "http://www.cdc.gov/flu/keyfacts.htm", "#cite_ref-modernv_7-0", "#cite_ref-modernv_7-1", "#cite_ref-modernv_7-2", "/Special:BookSources/1-4051-3645-6", "/International_Standard_Book_Number", "#cite_ref-8", "/Special:BookSources/1-55581-259-7", "/International_Standard_Book_Number", "#cite_ref-9", "/Special:BookSources/0-12-220360-7", "/International_Standard_Book_Number", "http://www.pandemicflu.state.pa.us/pandemicflu/cwp/view.asp?a=501&q=151742", "http://www.amm.co.uk/files/factsabout/fa_flu.htm", "http://www.bchealthguide.org/healthfiles/hfile12b.stm#E46E1", "http://www.cdc.gov/flu/keyfacts.htm", "http://viralzone.expasy.org/viralzone/all_by_species/6.html", "http://viralzone.expasy.org/viralzone/all_by_species/80.html", "http://viralzone.expasy.org/viralzone/all_by_species/81.html", "http://microbewiki.kenyon.edu/index.php/H1N1", "/Acute_respiratory_distress_syndrome", "/Asthma", "/Chronic_obstructive_pulmonary_disease", "/Lung_cancer", "/Lung_disease", "/Measles", "/Mesothelioma", "/Template:Respiratory_disease", "/Template:Biology_navbox", "/Template_talk:Biology_navbox", "https://www.en.creationwiki.org/index.php?title=Template:Biology_navbox&action=edit", "/Biology", "/Organisms", "/Animal", "/Algae", "/Amphibian", "/Bacteria", "/Bird", "/Created_kind", "/Crustaceans", "/Dinosaur", "/Fish", "/Fungi", "/Human", "/Insect", "/Mollusk", "/Plant", "/Protist", "/Reptiles", "/File:Animal_diversity.jpg", "/Biological_scientist", "/Agriculture", "/Anatomy", "/Baraminology", "/Biologist", "/Biotechnology", "/Botany", "/Cell_biology", "/Ecology", "/Epidemiology", "/Embryology", "/Entomology", "/Biological_evolution", "/Genetics", "/Herpetology", "/Human_biology", "/Medicine", "/Microscopy", "/Physiology", "/Taxonomy", "/Virology", "/Zoology", "/Biological_system", "/Auditory_system", "/Circulatory_system", "/Digestive_system", "/Endocrine_system", "/Immune_system", "/Integumentary_system", "/Limbic_system", "/Lymphatic_system", "/Muscular_system", "/Nervous_system", "/Olfactory_system", "/Reproductive_system", "/Respiratory_system", "/Sensory_system", "/Skeletal_system", "/Visual_system", "/Biological_process", "/Aging", "/Cell_division", "/Cellular_respiration", "/Disease", "/Embryogenesis", "/Gene_expression", "/Metabolism", "/Metamorphosis", "/Parasitism", "/Photosynthesis", "/Pregnancy", "/Protein_synthesis", "/Reproduction", "/Symbiosis", "/Trophic_level", "/File:Creationwiki_portals.png", "/Category:Biology", "/Portal:Biology", "/Biology_news_archive", "/File:Creationwiki_portals.png"], "authors": [], "publish_date": null}