{"result_id": "084011", "URL": "https://creationwiki.org/Medical_science", "timestamp": "2023-04-25 14:51:57 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://creationwiki.org/Medical_science", "encoding": "UTF-8"}, "image": null, "domain": "creationwiki.org", "title": "Medical science - CreationWiki, the encyclopedia of creation science", "cleaned_text": "From CreationWiki, the encyclopedia of creation science\n\nMedical science is the biological discipline that deals with the maintenance of health and the prevention and treatment of disease (also simply known as Medicine). Most medical scientists conduct biomedical research and development to advance knowledge of life processes and living organisms, including viruses, bacteria, and other infectious agents. Past research has resulted in advances in diagnosis, treatment, and prevention of many diseases. Basic medical research continues to build the foundation for new vaccines, drugs, and treatment procedures. Medical scientists engage in laboratory research, clinical investigation, technical writing, drug application review, and related activities.[1]\n\nMedical scientists study biological systems to understand the causes of disease and other health problems. They develop treatments and design research tools and techniques that have medical applications. Some try to identify changes in cells or in chromosomes that signal the development of medical problems. For example, medical scientists involved in cancer research may formulate a combination of drugs that will lessen the effects of the disease. Medical scientists who are also physicians can administer these drugs to patients in clinical trials, monitor their reactions, and observe the results. They may draw blood, excise tissue, or perform other invasive procedures. Those who are not physicians normally collaborate with physicians who deal directly with patients. Medical scientists examine the results of clinical trials and adjust the dosage levels of any drugs administered in those trials to reduce negative side effects or to induce better results. In addition to developing treatments for medical conditions, medical scientists attempt to discover ways to prevent health problems. For example, they may study the link between smoking and lung cancer or between alcoholism and liver disease.\n\nMedical scientists who work in applied research or product development use knowledge discovered through basic research to develop new drugs and medical treatments. They usually have less autonomy than basic medical researchers do to choose the emphasis of their research. They spend more time working on marketable treatments to meet the business goals of their employers. Medical scientists doing applied research and product development in private industry may also be required to explain their research plans or results to nonscientists who are in a position to reject or approve their ideas. These scientists must consider the business effects of their work. Scientists increasingly work as part of teams, interacting with engineers, scientists of other disciplines, business managers, and technicians.[1]\n\nSwift advances in basic medical knowledge related to genetics and organic molecules have spurred growth in the field of biotechnology. Discovery of important drugs, including human insulin and growth hormone, is the result of research using biotechnology techniques, such as recombining DNA. Many other substances not previously available in large quantities are now produced by biotechnological means; some may one day be useful in treating diseases such as Parkinson’s or Alzheimer’s. Today, many medical scientists are involved in the science of genetic engineering—isolating, identifying, and sequencing human genes to determine their functions. This work continues to lead to the discovery of genes associated with specific diseases and inherited health risks, such as sickle cell anemia. These advances in biotechnology have opened up research opportunities in almost all areas of medical science.[1]\n\nSome medical scientists specialize in epidemiology. This branch of medical science investigates and describes the causes and spread of disease and develops the means for prevention or control. Epidemiologists may study many different illnesses, often focusing on major infectious diseases such as influenza or cholera. Epidemiologists can be separated into two groups—research and clinical.[1]\n• History of Medicine by the U.S. Library of Medicine.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/File:Medical_science.jpg", "/Biological_discipline", "/Health", "/Disease", "/Viruses", "/Bacteria", "/Diseases", "#cite_note-bls-1", "#Research", "#Biotechnology", "#Epidemiology", "#References", "#External_links", "/Biology", "/Cells", "/Chromosomes", "/Drugs", "/Disease", "/Cancer", "/index.php?title=Alcoholism&action=edit&redlink=1", "/Liver", "/File:Pills_from_medicine_bottle.jpg", "/Research", "#cite_note-bls-1", "/Biotechnology", "/index.php?title=Parkinson%E2%80%99s&action=edit&redlink=1", "/Alzheimer%E2%80%99s", "/Sickle_cell_anemia", "#cite_note-bls-1", "/Epidemiology", "#cite_note-bls-1", "#cite_ref-bls_1-0", "#cite_ref-bls_1-1", "#cite_ref-bls_1-2", "#cite_ref-bls_1-3", "http://www.bls.gov/oco/ocos008.htm", "http://www.nlm.nih.gov/hmd/", "/Template:Human_navbox", "/Template_talk:Human_navbox", "http://en.creationwiki.org/index.php?title=Template:Human_navbox&action=edit", "/Human_biology", "/Human_body", "/Appendix", "/Axial_skeleton", "/Blood", "/Human_brain", "/Cochlea", "/Colon", "/Embryo", "/Human_eye", "/Fetus", "/Heart", "/Kidney", "/Liver", "/Lobes_of_the_brain", "/Lung", "/Mouth", "/Neuron", "/Pancreas", "/Skull", "/Skeletal_muscle", "/Small_intestine", "/Spleen", "/Thyroid", "/Tissue", "/Tonsil", "/Vertebral_column", "/File:9weeks.jpg", "/Biological_system", "/Auditory_system", "/Circulatory_system", "/Digestive_system", "/Endocrine_system", "/Immune_system", "/Integumentary_system", "/Limbic_system", "/Lymphatic_system", "/Muscular_system", "/Nervous_system", "/Olfactory_system", "/Reproductive_system", "/Respiratory_system", "/Sensory_system", "/Human_skeleton", "/Visual_system", "/Abortion", "/Acupuncture", "/Anatomy", "/Anesthesiology", "/Chiropractor", "/Dentist", "/Dermatology", "/Disease", "/Epidemiology", "/Fat_reduction_procedures", "/Heart_surgery", "/Homeopathic_medicine", "/Coroner", "/Nursing", "/Obstetrician", "/Occupational_therapy", "/Pediatrician", "/Pharmacology", "/Physical_therapist", "/Physician", "/Physiology", "/Plastic_surgery", "/Radiology", "/Sports_medicine", "/Vision_correction_procedures", "/Anthropology", "/Antediluvian_civilizations", "/Human_longevity", "/Decline_of_humanity", "/DNA_and_Babel", "/Homo_erectus", "/Neanderthal", "/Paleoanthropology", "/Human_migration", "/Human_races", "/Anthropology_quotes", "/File:Creationwiki_portals.png", "/Category:Biology", "/Portal:Biology", "/File:Creationwiki_portals.png"], "authors": [], "publish_date": null}