{"result_id": "084007", "URL": "https://creationwiki.org/Mumps", "timestamp": "2023-04-25 14:51:51 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://creationwiki.org/Mumps", "encoding": "UTF-8"}, "image": null, "domain": "creationwiki.org", "title": "Mumps - CreationWiki, the encyclopedia of creation science", "cleaned_text": "From CreationWiki, the encyclopedia of creation science\n\nMumps, also known as epidemic parotitus is a viral disease that causes fevers, muscle pains and swelling of the parotid glands which are located near the jaw area.[1]This viral disease can cause many symptoms which usually become active within the first sixteen to eighteen days of infection. Symptoms that resolve in adults tend to be more severe then symptoms that resolve in children. Mumps can also cause many complications in peoples health and even in some cases can lead to death. AS infectious as mumps is, it spreads rapidly among people through contact and/or respiratory droplets.\n\nMumps can easily be prevented by two or more doses of the Mumps vaccination. Most countries in the world include this vaccine in immunizations usually given to children of young age. The percentage of the actual success of the immunization actually working in children is pretty high however, slowly decreases as you get older.\n\nMumps, also known as epidemic parotitis, is a disease that is caused by the inflammation of glands. The mumps virus is an single-stranded RNA virus that is part of the Paramyxovirus family.[2] Humans are the only natural host for the mumps virus. Mumps can be spread from person to person by respiratory fluid contact; this includes saliva, sneezing, and the touching of skin. This virus can survive on surfaces and can be transferred if the surface is used in a similar manner. A person that is infected with the mumps virus can start spreading the virus at least seven days before the first set of symptoms start.\n\nThe incubation period of this virus can range from twelve to twenty five days. twenty to forty percent of all people who receive the mumps virus do not show signs of symptoms but are still able spread the virus. During an outbreak of mumps, diagnostics can be made by finding out the recent exposures and parotitis. A physical examination of the person can show the presence of swollen glands and tests of the saliva and blood can confirm the virus is inside the patient.[3]\n\nMumps is a disease that includes a variety of symptoms. Some symptoms can include a low grade fever, a headache, and malaise.[4] Malaise is a feeling of general discomfort, uneasiness, and pain that indicates the coming of an infection or disease. These symptoms can lead up to a severe symptom of the swelling of the parotid glands, which are located on either side of the mouth, in front of the ears. This swelling most commonly lasts about one week.\n\nOther symptoms of mumps can include dry mouth, a sore face or ears, and even sometimes, people find it difficult to talk. A vaccine for the mumps has been available since the 1960's. Some rare symptoms may occur in people with mumps. Painful testicular inflammation occurs in fifteen to forty percent of men with mumps. Other rare symptoms can include meningitis, ovarian inflammation, acute pancreatic inflammation, and brain inflammation.\n\nThe most common way to prevent mumps is to get a vaccination with a mumps vaccine. This vaccine was created by a microbiologist named Maurice Hilleman. It can be given as part of an measles, mumps, and rubella (MMR) immunization which also helps prevent measles and rubella, or it can be given in a newly reformed vaccine called MMRV which helps to prevent chickenpox.[5]The World Health Organization recommends that all countries with well-functioning childhood vaccination programs should take the mumps vaccination. Around the world this vaccine is given to children around the age of thirteen months and provides a lifelong immunity. The efficacy of the vaccine can range depending on the health of the person but it is usually about eighty percent. Many outbreaks of the mumps occurs in colleges and universities, so the government has set up awareness campaigns to help prevent an outbreak and encourage students to get vaccinated.\n\nMany people believe that the vaccine contains strains that can be harmful even if the vaccine ends up being helpful at all. The MMR has been linked to certain cases of autism and inflammatory bowel disease. However, there is no possible evidence claiming that any of this is actually true. Before the mumps vaccine the virus was the leading cause of meningoencephalitis; however, this disease occurs very rarely in people with mumps. Since the mumps vaccine was introduced to the U.S.A in December 1967 there has been a gradual decrease in mumps outbreaks.[6]\n\nDescription of Mumps and the vaccinations for them", "opengraph": {}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe width=\"560\" height=\"315\" src=\"//www.youtube.com/embed/ioUi727k9JM\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "//www.youtube.com/embed/ioUi727k9JM"}], "links": ["/File:Mumps_PHIL_130_lores.jpg", "/File:Mumps_PHIL_130_lores.jpg", "#cite_note-1", "#Cause_and_Diagnostic", "#Signs_and_Symptoms", "#Prevention", "#Video", "#Viral_Diseases", "#References", "/index.php?title=Paramyxovirus&action=edit&redlink=1", "#cite_note-2", "/File:Mumps_virus_electron_micrograph.jpg", "/File:Mumps_virus_electron_micrograph.jpg", "#cite_note-3", "#cite_note-4", "/File:Headache.jpg", "/File:Headache.jpg", "/Chickenpox", "#cite_note-5", "/File:Vaccination2.jpg", "/File:Vaccination2.jpg", "#cite_note-6", "/AIDS", "/Avian_influenza", "/Chickenpox", "/Ebola", "/Gastroenteritis", "/Hepatitis_B", "/Hepatitis_C", "/Human_papillomavirus", "/Infectious_mononucleosis", "/Influenza", "/Measels", "/Poliomyelitis", "/Smallpox", "/Swine_influenza", "/Rabies", "/Yellow_fever", "/Template:Viral_disease", "#cite_ref-1", "https://en.wikipedia.org/wiki/Mumps", "#cite_ref-2", "https://medlineplus.gov/mumps.html", "#cite_ref-3", "http://kidshealth.org/en/parents/mumps.html#", "#cite_ref-4", "http://www.healthline.com/health/mumps?s_con_rec=true&r=01#ReadThisNext6", "#cite_ref-5", "https://www.cdc.gov/mumps/", "#cite_ref-6", "http://www.medicinenet.com/mumps/article.htm", "/Template:Human_navbox", "/Template_talk:Human_navbox", "https://www.en.creationwiki.org/index.php?title=Template:Human_navbox&action=edit", "/Human_biology", "/Human_body", "/Appendix", "/Axial_skeleton", "/Blood", "/Human_brain", "/Cochlea", "/Colon", "/Embryo", "/Human_eye", "/Fetus", "/Heart", "/Kidney", "/Liver", "/Lobes_of_the_brain", "/Lung", "/Mouth", "/Neuron", "/Pancreas", "/Skull", "/Skeletal_muscle", "/Small_intestine", "/Spleen", "/Thyroid", "/Tissue", "/Tonsil", "/Vertebral_column", "/File:9weeks.jpg", "/Biological_system", "/Auditory_system", "/Circulatory_system", "/Digestive_system", "/Endocrine_system", "/Immune_system", "/Integumentary_system", "/Limbic_system", "/Lymphatic_system", "/Muscular_system", "/Nervous_system", "/Olfactory_system", "/Reproductive_system", "/Respiratory_system", "/Sensory_system", "/Human_skeleton", "/Visual_system", "/Medical_science", "/Abortion", "/Acupuncture", "/Anatomy", "/Anesthesiology", "/Chiropractor", "/Dentist", "/Dermatology", "/Disease", "/Epidemiology", "/Fat_reduction_procedures", "/Heart_surgery", "/Homeopathic_medicine", "/Coroner", "/Nursing", "/Obstetrician", "/Occupational_therapy", "/Pediatrician", "/Pharmacology", "/Physical_therapist", "/Physician", "/Physiology", "/Plastic_surgery", "/Radiology", "/Sports_medicine", "/Vision_correction_procedures", "/Anthropology", "/Antediluvian_civilizations", "/Human_longevity", "/Decline_of_humanity", "/DNA_and_Babel", "/Homo_erectus", "/Neanderthal", "/Paleoanthropology", "/Human_migration", "/Human_races", "/Anthropology_quotes", "/File:Creationwiki_portals.png", "/Category:Biology", "/Portal:Biology", "/File:Creationwiki_portals.png"], "authors": [], "publish_date": null}