{"result_id": "084030", "URL": "http://creationwiki.org/Jean-claude_Perez", "timestamp": "2023-04-25 14:52:27 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "http://creationwiki.org/Jean-claude_Perez", "encoding": "UTF-8"}, "image": null, "domain": "creationwiki.org", "title": "Jean-claude Perez - CreationWiki, the encyclopedia of creation science", "cleaned_text": "From CreationWiki, the encyclopedia of creation science\n\nJean-Claude Perez, Ph.D., is a French interdisciplinary scientist born on June 26, 1947 in Bassens, Gironde near Bordeaux (France). An engineer and French scholar from Bordeaux university. Perez worked principally with IBM in both the areas of Biomathematics and Artificial Intelligence[1] (the first time, showing evidence of high level self-organization in cellular automata networks [2]and the second time creating neural networks with Fractal Chaos), his holographic-like memory system and novelty detector). Then, [3]in 1990, Jean-claude Perez published strong links between the world of fractals and numbers of the Fibonacci sequence which are based on the Golden ratio[4]. In this last area, with the \"DNA supracode\"[5], he proved that DNA coding for genes is structured by proportions related to Fibonacci numbers[6] [7] [8]. He verified this discovery in the field of the HIV genome by partnerships with Professor Luc Montagnier[9], the discoverer of the HIV virus. He has worked for 20 years in the fields of whole genome numerical analysis and numerical decoding of genes as coding or non-coding DNA sequences (as demonstrated particularly by the last publications: [10] ).\n\nParticularly, in \"Interdisciplinary Science\" September 2010 issue, J.C. Perez published a peer-reviewed paper proving that the whole human genome codon populations are managed by afine-tuned around the. Particularly, this main paper entitledshows that thenot only maps codons to amino acids, but serves as a global checksum matrix at the whole genome macro-structural scale.\n\nA complete summary of J.C Perez's research was published in Pellionisz A., Graham R., Pellionisz P., Perez J.: [14] In: Manto M., Gruol D., Schmahmann J., Koibuchi N., Rossi F. (Ed.) Handbook of the Cerebellum and Cerebellar Disorders: [15] Details in this chapter[16] and full paper available in this book [17]\n\nIn October 2013, Jean-Claude Perez published a peer reviewed major article in [APPLIED MATHEMATICS][18] entitled \"The 3 genomic numbers discovery\". This article shows - for the first time - that complete human genome single stranded DNA constitutes a WHOLE.\n\nIn July 2015 Jean-Claude Perez published his main peer-review article ... Deciphering Hidden DNA Meta-Codes -The Great Unification & Master Code of Biology[19]\n\n\n\n ==> ==> In summer 2017 and 2018, Jean-Claude Perez published about 20 major peer reviewed articles in various interdisciplinary fields like: A major paper entitled \"A proof of the unity, integrity and autopoietic autonomy of the whole human genome\",\n\n==> ==> In 2020 jean-claude perez was with indian researchers the first demonstrating the evidence of HIV inserts within the COVID-19 genome RNA:\n\nFebruary 2020 (withdrawn PREPRINT) then March 2020 Jean-Claude PEREZ. (2020). WUHAN COVID-19 SYNTHETIC ORIGINS AND EVOLUTION. International Journal of Research - Granthaalayah, 8(2), 285–324. http://doi.org/10.5281/zenodo.3724003\n\nThen a pioneer article with NOBEL Prizewinner Luc Montagnier: July 2020: Perez, J. C., & Montagnier, L. (2020). HIV Man-Manipulated Coronavirus Genome Evolution Trends. and COVID-19, SARS AND BATS CORONAVIRUSES GENOMES PECULIAR HOMOLOGOUS RNA SEQUENCES. International Journal of Research -GRANTHAALAYAH, 8(7), 217-263. https://zenodo.org/record/3975589\n\nIn 2021 other publications on SARS-CoV2 variants Jean-Claude Perez. (2021). SARS-COV2 VARIANTS AND VACCINES MRNA SPIKES FIBONACCI NUMERICAL UA/CG METASTRUCTURES. International Journal of Research -GRANTHAALAYAH, 9(6), 349-396. https://doi.org/10.29121/granthaalayah.v9.i6.2021.4040 DOI: https://doi.org/10.29121/granthaalayah.v9.i6.2021.4040 https://www.granthaalayahpublication.org/journals-html-galley/34_IJRG21_A06_5435.html\n\nPerez, J. C. (2021). THE INDIA MUTATIONS AND B.1.617 DELTA VARIANTS: IS THERE A GLOBAL \"STRATEGY\" FOR MUTATIONS AND EVOLUTION OF VARIANTS OF THE SARS-COV2 GENOME?. International Journal of Research -GRANTHAALAYAH, 9(6), 418–459. https://doi.org/10.29121/granthaalayah.v9.i6.2021.4039 DOI: https://doi.org/10.29121/granthaalayah.v9.i6.2021.4039 https://www.granthaalayahpublication.org/journals/index.php/granthaalayah/article/view/4039\n\nIn 2022 2 main articles on the OMICRON variant:\n\nMay the SARS-COV2 OMICRON Variant Signal the End of the Pandemic – A Fibonacci Fractal analysis Published On: 2022-01-07 Authors: Jean-Claude Perez, Valère Lounnas, Megawaty Tan, Xavier Azalbert, Christian Perronne\n\nthen 2nd article with ddendum by professor Luc Montagnier: ADDENDUM by Pr Luc Montagnier\n\n\"A big step towards understanding Nature. Your work gives us hope that we will soon emerge from the nightmare where the Cretinoid branch of Humanity plunges us”\n\nPerez, J. C., Lounnas, V., & Montagnier, M. (2021). THE OMICRON VARIANT BREAKS THE EVOLUTIONARY LINEAGE OF SARS-COV2 VARIANTS. International Journal of Research -GRANTHAALAYAH, 9(12), 108–132. https://doi.org/10.29121/granthaalayah.v9.i12.2021.4418\n\nPerez and Montagnier (2021) - Perez, J. C., & Montagnier, L. . (2021). SIX FRACTAL CODES OF LIFE FROM BIOATOMS ATOMIC MASS TO CHROMOSOMES NUMERICAL STANDING WAVES: THREE BREAKTHOUGHS IN ASTROBIOLOGY, CANCERS AND ARTIFICIAL INTELLIGENCE. International Journal of Research -GRANTHAALAYAH, 9(9), 133–191. Retrieved from https://doi.org/10.29121/granthaalayah.v9.i9.2021.4191 DOI: https://doi.org/10.29121/granthaalayah.v9.i9.2021.4191\n\nAn overview of INTERDISCIPLINARY RESEARCH WEB LINKS is available in the page[22]\n\nIt may be important to note that Jean-claude Perez does not consider himself a creationist: his main question is:\n\n1991: The \"DNA SUPRACODE\": Relative proportions of TCAG nucleotides within DNA Genetic coding obey the same proportions as Fibonacci's numbers\n\nIn 1991 we proposed that Golden Ratio and Fibonacci/Lucas integer numbers define strong relationships between DNA gene-coding region sequences and Fibonacci’s embedded TCAG gene sequence patterns. We also prove the optimality of these patterns in the book L’ADN décrypté (“Deciphering DNA”). See also on this discovery the book \"The Mathematics of Harmony\" by Alexey Stakhov...\n\nExamples involving evolution and pathogen analysis include genes or small gene-rich genomes, especially the HIV genome. This book explores a numerical property called the “DNA Supracode” consisting of exhaustive combinatorial research of “resonances” within gene-coding DNA sequences: a resonance is a harmonious proportion of exact Fibonacci/Lucas nucleotide numbers. For example: 144 contiguous TCAG nucleotides have exactly 55 T nucleotides and 89 A or C or G nucleotides. Then a resonance exists with an the Golden ratio as defined in the Methods section: 55, 89 and 144 are consecutive Fibonacci numbers following the Golden Ratio. Gene-rich genomes like HIV have thousands of “resonances”, where the longer ones overlap 2/3rds of the whole genome length.[27]\n\n1994: \"THE FIRST MUSIC OF GENES\" reveals in AUDIO MEDIA the super structure of GENETIC-coding DNA discovered in \"DNA SUPRACODE\"\n\nObserving this image of the dynamics of Fibonacci's DNA supracode resonances, Jean-claude Perez had the immediate intuition of showing this pattern in a different media: MUSIC... More in the Full CD audio of \"THE FIRST MUSIC OF GENES\"[28]\n\nThe question of how superconductivity emerges spontaneously from high-temperature superconductors is one of the major unsolved problems of theoretical Physics. In 2010, the famous discovery by Antonio Bianconi et al. shows evidence of fractal structure in high temperature superconductors.[30] meanwhile, 16 years ago, in 1994, Jean-claude Perez published an international patent proposing to optimize high temperature superconductors using a specific region of the FRACTALS spectrum: the GOLDEN RATIO.[31]\n\nIn fact, J.C. Perez's main investigation is about this mysterious trilogy: -Fractal worlds. -Golden ratio. -and high level structures emerging from matter (high temperature superconductors) or life (DNA). More details in the article \"Golden Ratio and Fractals\".[32]\n\n1997: \"NUMBERS in ATOMS\" - a basic NUMERICAL FORMULA PREDICTS the whole STRUCTURE of MENDELEEV's PERIODIC TABLE\n\nThe discovery of a Mathematical formula for the periodic law:\n\nDiscovered in 1997,[33] Jean-claude Perez published in 2009 in the book \"CODEX BIOGENESIS\",[34] a very simple numerical formula computing the number of elements within every period then, finally, within the whole structure: In this elementary predictive formula, \"p\" is the period number, \"c(p)\" is the number of Elements within the period layer and \"Int(x)\" is the integer whole value of real number x. More details in this image[35] and this article.[36]\n\n\"NUMBERS IN DNA\": Why are FRACTALS and INTEGER NUMBERS structuring WHOLE HUMAN GENOME DNA?\n\nIn October 2009, there were two major breakthroughs along the way to prove the FRACTAL nature of the whole HUMAN GENOME DNA:\n• The PHYSICAL FRACTAL GENOME: the publication in SCIENCE by Erez Lieberman-Aiden entitled \" Comprehensive Mapping of Long-Range Interactions Reveals Folding Principles of the Human Genome \" demonstrates that the three dimensional folding of the 2 meter long DNA molecule within each cell is FRACTAL.\n• The LOGICAL FRACTAL GENOME: the book CODEX BIOGENESIS: les 13 codes de l'ADN (the 13 codes of DNA) was published by Jean-claude Perez. This book demonstrates, principally by analyzing codon frequencies within the whole human genome, that the DNA sequence of the simple stranded DNA double helix is organized on a FRACTAL law.\n• NUMBERS \"2\" and \"3\": \"Peace symbol\" geometrical proportions between codon clusters, [38]. Then, linking the Genome with Music, a wave ratio proportion of \"2\" appears = one octave between the 32 more frequent codon populations and the 32 remaining other codon populations,\n• NUMBERS \"12\" and \"13\": When numbers 12 and 13 emerge from relative proportions of TTT+AAA codons and the whole genome single-stranded codon populations.[39]\n• the modeling of codon populations is controlled by the DRAGON's fractal paper folding curve applied to the universal genetic code map playing the role of a\n• Numerical fine-tuned BALANCE: Analysing human genome DNA sequences at the atomic mass level, the proof of the emergence of binary and undulating codes which control DNA fractally in a scale invariant way.\n• GOLDEN RATIO: evidence of the golden ratio proportion controlling globally the whole human genome both in DNA coding and junk-DNA sequences.\n\nVisit the content of the book on AMAZON here.[43]\n\nANALYSING CODON FREQUENCIES IN WHOLE HUMAN GENOME: towards long-range global scale FUNCTION of \"noncoding JUNK-DNA\"\n\nIn chapter 16 of CODEX BIOGENESIS (published in october 2009) [44], I prove that the approximately 1 billion codons of the human genome obey an organization where the universal 64 codons make a universal genetic code map… which involves another neighbouring fractal, The DRAGON curve.[45][46][47]\n\nMore details on how the DRAGON’s curve structures the human genome codon populations vs the UNIVERSAL GENETIC CODE map from the book CODEX BIOGENESIS.[48]\n\nWhen the \"Peace Symbol\" image emerges from proportions between codon populations within the whole HUMAN GENOME DNA\n\nChapter 16: “MATRIX”: the folding codes of the « human genome dragon - SUMMARY -\n\nWe offer here an amazing law which comes down to: « The respective POPULATIONS of each of 64 codons constituting the whole human genome are CONTROLLED by LOCATIONS of these same codons inside the ” Universal Genetic Code ” map ».\n\nEffectively; by analysing the distribution of frequencies in an exhaustive way for each of 64 codons of the genetic code inside the single strand of DNA which results from the end to end concatenation of our 24 chromosomes, it appears, strangely enough, that the populations of these hundreds of million of codons are controlled by their respective and definite locations within the universal genetic code table. The universal genetic code table would constitute therefore a kind of “structure”, or “frame” of the “MATRIX” among which the respective LOCATIONS and POSITIONS of each one of 64 codons WOULD D_E_T_E_R_M_I_N_E the exact POPULATIONS of these same codons! The unforeseen means which allowed us to throw into relief this relationship is a scientific result resembling more the domain of « strangeness and mathematical games » rather than that of “hard” renowned sciences such as Genetics: the “DRAGON curve”. The 6 successive embedded foldings, according to successive dichotomies of the dragon’s curve applied to the respective populations – on the scale of whole human genome – of each of the 64 codons ordered according to the genetic code map go on then to reveal the omnipresence of 2 kinds of dual attractors with remarkable values. We conclude from this therefore that each of positions of the 64 codons within the universal genetic code table WOULD DETERMINE respective population values of these same codons within the whole human genome.\n\nBinary and Undulatory CODES emerging from DNA: scale invariance in information make a level LOGICAL FRACTAL GENOME\n\nIs There \"an EQUATION of LIFE\"?\n\nScale Invariance, self similarity, and binary / undulatory language emerges from the whole human genome analysed from a DNA sequence at the atomic mass level… This shows the route of a \"great unification\" of all Biological Information: DNA, RNA, amino acid sequences, proteins, genes and genomes... [49]. More in the CODEX BIOGENESIS book.[50][51][52]\n\nMarch 2011: A synthetic conference about 20 years of research on \"NUMBERS IN DNA\"\n• Who is Jean-claude PEREZ??? on Golden Ratio and Numbers in Mathematics Blog\n• The Human Genome in 3 Dimensions on Wired\n• Genome Function of the Cerebellum: Geometric Unification of Neuroscience and Genomics.\n• Full CD audio of \"THE FIRST MUSIC OF GENES\"\n• To hear the AUDIO introduction, wait a few seconds, then CLICK on \"Télécharger le fichier tout de suite\" or \"Download Now\"\n• Evidence of a MIRROR SYMMETRY in the billion Human genome codon populations\n• the Ratio 2/3 and 1/3 emerge from whole human genome codon populations\n• Now available also on amazon.co.uk\n• visit the content of the book on AMAZON here...\n\nJ. C. Perez has published five books, registered an international Patent and made an audio CD:\n\nBOOKS: Two in the Artificial Intelligence field:\n\nOne in the field of Genetically Modified Organisms (GMOs):\n\nTwo in the field of Biomathematics:\n• Codex Biogénésis: 13 codes et harmonies de l'ADN, to be published Resurgence Editions Liège (Belgium) - 2009, [35]\n• 1994 : Perez, J.C. 1994. Method for the functional optimization of high temperature superconductors by controlling the morphological proportions of their thin layers. (PCT/FR93/00782). International Européen PCT\n• La première musique des genes (\"The first music of genes\"), CD audio by Jean-claude Perez (SACEM GEN0694) Bordeaux (1994) [To hear the AUDIO introductionhttp://k005.kiwi6.com/hotlink/g9t127ehul/01_track1the1stmusicofgenesbyjcperez1994sacemgen0694.mp3 , ] full CD available here...\n\nWEBsite dedicated to \"the first music of genes\"\n• Friedman M.D., and Cross M.K., (2017), Nature's Secret Nutrient: The Golden Ratio Biohack for PEAK Health, Performance & Longevity. Paperback – February 2, 2017, [37]\n• A. Aleksei Petrovitch Stakov, (2009), ' Mathematics of Harmony: From Euclid to Contemporary Mathematics and Computer', World Scientific Publishing, [44]\n• Carl Johan Calleman, (2009), 'The purposeful universe: The Purposeful Universe: How Quantum Theory and Mayan Cosmology Explain the evolution of Life', Inner Traditions, [46]\n• Didier Van Cauwelaert, (2005), 'Out my head', Other Press Editions USA, french GONCOURT prize,[48]", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/File:Photojcperez.jpg", "/File:Photojcperez.jpg", "http://creationwiki.org/Category:ID_theorist", "#cite_note-1", "#cite_note-2", "/Fractal_geometry", "#cite_note-3", "/Fibonacci_sequence", "/Golden_ratio", "#cite_note-4", "#cite_note-5", "#cite_note-6", "#cite_note-7", "#cite_note-8", "#cite_note-9", "#cite_note-10", "#cite_note-11", "/File:Golden_ratio.jpg", "/File:Golden_ratio.jpg", "#cite_note-12", "#cite_note-13", "#cite_note-14", "#cite_note-15", "#cite_note-16", "#cite_note-17", "#cite_note-18", "#cite_note-19", "http://www.rbchemistry.com/index.php/rbc/article/view/2", "https://www.omicsonline.org/open-access/sapiens-mitochondrial-dna-genome-circular-long-range-numericalmeta-structures-are-highly-correlated-with-cancers-and-genetic-disea-1948-5956-1000469.php?aid=90737", "http://cancerscience.chroniclepublishers.org/images/CP_Cancer_Science_007.pdf", "http://bacbl.com/index.php/bcbl/article/view/2/2", "https://plus.google.com/collection/EQjEWE", "http://clinical-epigenetics.imedpub.com/the-master-code-of-dna-towards-the-discovery-of-the-snps-function-singlenucleotide-polymorphism.pdf", "http://biomedres.us/pdfs/BJSTR.MS.ID.000209.pdf", "https://www.siftdesk.org/article-details/DUF1220%20Homo%20Sapiens%20and%20Neanderthal%20%20fractal%20periods%20architectures%20breakthrough/184", "https://biomedres.us/fulltexts/BJSTR.MS.ID.000374.php", "http://www.siftdesk.org/article-details/Symmetry%20and%20Asymmetry%20in%20the%20MENDELEEV%E2%80%99s%20Periodic%20Table%20Predictive%20EQUATION/224", "http://crimsonpublishers.com/nacs/pdf/NACS.000507.pdf", "#cite_note-20", "http://doi.org/10.5281/zenodo.3724003", "https://zenodo.org/record/3975589", "https://doi.org/10.29121/granthaalayah.v9.i6.2021.4040", "https://doi.org/10.29121/granthaalayah.v9.i6.2021.4040", "https://www.granthaalayahpublication.org/journals-html-galley/34_IJRG21_A06_5435.html", "https://doi.org/10.29121/granthaalayah.v9.i6.2021.4039", "https://doi.org/10.29121/granthaalayah.v9.i6.2021.4039", "https://www.granthaalayahpublication.org/journals/index.php/granthaalayah/article/view/4039", "https://doi.org/10.29121/granthaalayah.v9.i12.2021.4418", "https://doi.org/10.29121/granthaalayah.v9.i9.2021.4191", "https://doi.org/10.29121/granthaalayah.v9.i9.2021.4191", "#cite_note-21", "#cite_note-22", "#cite_note-23", "#cite_note-24", "#cite_note-25", "#1991:_The_.22DNA_SUPRACODE.22:_Relative_proportions_of_TCAG_nucleotides_within_DNA_Genetic_coding_obey_the_same_proportions_as_Fibonacci.27s_numbers", "#1994:_.22THE_FIRST_MUSIC_OF_GENES.22_reveals_in_AUDIO_MEDIA_the_super_structure_of_GENETIC-coding_DNA_discovered_in_.22DNA_SUPRACODE.22", "#1994:_.22NUMBERS_IN_MATTER.22_-_Optimizing_High_Temperature_Superconductors_by_Golden_Ratio", "#1997:_.22NUMBERS_in_ATOMS.22_-_a_basic_NUMERICAL_FORMULA_PREDICTS_the_whole_STRUCTURE_of_MENDELEEV.27s_PERIODIC_TABLE", "#.22NUMBERS_IN_DNA.22:_Why_are_FRACTALS_and_INTEGER_NUMBERS_structuring_WHOLE_HUMAN_GENOME_DNA.3F", "#2009:_The_book_.22CODEX_BIOGENESIS:_les_13_codes_de_l.27ADN.22", "#ANALYSING_CODON_FREQUENCIES_IN_WHOLE_HUMAN_GENOME:_towards_long-range_global_scale_FUNCTION_of_.22noncoding_JUNK-DNA.22", "#Binary_and_Undulatory_CODES_emerging_from_DNA:_scale_invariance_in_information_make_a_level_LOGICAL_FRACTAL_GENOME", "#Is_There_.22an_EQUATION_of_LIFE.22.3F", "#March_2011:_A_synthetic_conference_about_20_years_of_research_on_.22NUMBERS_IN_DNA.22", "#External_links", "#References", "#Bibliography", "#Other_collections", "#Quoted_references_from_others_books", "#Awards", "#External_links_2", "/File:ADNdecrypte.jpg", "/File:ADNdecrypte.jpg", "#cite_note-26", "#cite_note-27", "/File:Resonances.jpg", "/File:Resonances.jpg", "#cite_note-28", "#cite_note-29", "/File:KIRASoncogeneMusic.jpg", "/File:KIRASoncogeneMusic.jpg", "#cite_note-30", "#cite_note-31", "#cite_note-32", "/File:ImagePerezSupraconductorsPatent1994.jpg", "/File:ImagePerezSupraconductorsPatent1994.jpg", "/File:JcperezMendeleievFormula.jpg", "/File:JcperezMendeleievFormula.jpg", "#cite_note-33", "#cite_note-34", "#cite_note-35", "#cite_note-36", "/File:GoldenRatioInNature.jpg", "/File:GoldenRatioInNature.jpg", "#cite_note-37", "#cite_note-38", "/Genome", "/Music", "#cite_note-39", "/Golden_ratio", "#cite_note-40", "#cite_note-41", "#cite_note-42", "#cite_note-43", "#cite_note-44", "#cite_note-45", "#cite_note-46", "#cite_note-47", "#cite_note-48", "/File:ThePEACEsymbolEmergesFromCodonPopulationsProportionsInWholeHumanGenome.jpg", "/File:ThePEACEsymbolEmergesFromCodonPopulationsProportionsInWholeHumanGenome.jpg", "/File:Codexcouverturefinal.jpg", "/File:Codexcouverturefinal.jpg", "/File:Codex_perez_recto.jpg", "/File:Codex_perez_recto.jpg", "/File:TheEquationOfLife.jpg", "/File:Biobits1.jpg", "/File:Biobits1.jpg", "/File:Biobits2.jpg", "/File:Biobits2.jpg", "#cite_note-49", "#cite_note-50", "#cite_note-51", "#cite_note-52", "#cite_note-53", "/File:Im1.jpg", "/File:Im1.jpg", "/File:Im2.jpg", "#cite_note-54", "#cite_note-55", "#cite_note-56", "#cite_note-57", "http://golden-ratio-in-dna.blogspot.com/2008/08/who-is-jean-claude-perez-in-french.html", "https://sites.google.com/site/codexbiogenesis/home", "http://golden-ratio-in-dna.blogspot.com/", "http://fr-fr.facebook.com/people/Jean-claude-Perez/1265686482", "http://www.wired.com/wiredscience/2009/10/fractal-genome/", "http://www.amazon.fr/product-reviews/2874340448/ref=cm_cr_dp_all_summary?ie=UTF8&showViewpoints=1&sortBy=bySubmissionDateDescending/", "#cite_ref-1", "http://golden-ratio-in-dna.blogspot.fr/2015/04/april-2015-from-artificial-neural.html", "#cite_ref-2", "http://golden-ratio-in-dna.blogspot.com/2008/02/1988-fractal-chaos.html", "#cite_ref-3", "http://www.emeraldinsight.com/journals.htm?articleid=1663901", "#cite_ref-4", "http://ieeexplore.ieee.org/xpl/freeabs_all.jsp?reload=true&arnumber=137678", "#cite_ref-5", "http://www.podcast.tv/video-episodes/3%27%20pour%20changer%20le%20monde,%20Jean-Claude%20P%C3%A9rez%20-4185844.html", "#cite_ref-6", "http://cat.inist.fr/?aModele=afficheN&cpsidt=5221044", "#cite_ref-7", "http://golden-ratio-in-dna.blogspot.com/2008/01/1992-order-and-chaos-in-dnathe-denis.html", "#cite_ref-8", "http://golden-ratio-in-dna.blogspot.com/2008/01/1991-first-publication-related-to.html", "#cite_ref-9", "http://golden-ratio-in-dna.blogspot.com/2008/10/2008-medicine-nobel-prize-winner-luc.html", "#cite_ref-10", "http://golden-ratio-in-dna.blogspot.fr/2012/01/last-publications-and-conferences-of-jc.html", "#cite_ref-11", "http://www.ncbi.nlm.nih.gov/pubmed/20658335", "#cite_ref-12", "http://creationwiki.org/pool/images/7/71/DraftJean-claudePerezINTERDISCIPLINARYscienceIS-2010-0006WORDfinalRevisedPaper.pdf", "#cite_ref-13", "http://golden-ratio-in-dna.blogspot.com/2010/10/oct-2010-full-paper-available-codon.html", "#cite_ref-14", "https://plus.google.com/u/0/103572438711329205534/posts/AWSzDbXuBX4", "#cite_ref-15", "#cite_ref-16", "http://www.springerreference.com/docs/html/chapterdbid/310386.html", "#cite_ref-17", "https://plus.google.com/u/0/103572438711329205534/posts/DPw4yr5peTv", "#cite_ref-18", "http://www.scirp.org/journal/am/", "#cite_ref-19", "http://t.co/mPXzqFNfE8", "#cite_ref-20", "https://plus.google.com/collection/AdQ9SE", "#cite_ref-21", "mailto:jeanclaudeperez2@free.fr", "#cite_ref-22", "http://fr.scribd.com/doc/205337844/jcperezLINKSresearchs-pdf", "#cite_ref-23", "http://www.wolframscience.com/nksonline/toc.html", "#cite_ref-24", "http://golden-ratio-in-dna.blogspot.com/2008/02/1988-fractal-chaos.html", "#cite_ref-25", "http://creationwiki.org/pool/images/7/76/JcperezLiveBitsFromDNA.pdf", "#cite_ref-26", "http://books.google.fr/books?id=K6fac9RxXREC&lpg=PA111&ots=vJwpwhkO4K&dq=%22alexey+stakhov%22+jean-claude+perez+dna&pg=PA110#v=onepage&q&f=false", "#cite_ref-27", "http://golden-ratio-in-dna.blogspot.com/2008/01/jc-perez-book-ladn-decrypt-1997-dna.html", "#cite_ref-28", "https://sites.google.com/site/thefirstmusicofgenes/home", "#cite_ref-29", "http://golden-ratio-in-dna.blogspot.com/2008/01/1994-first-music-of-genes.html", "#cite_ref-30", "http://www.nature.com/nature/journal/v466/n7308/edsumm/e100812-03.html", "#cite_ref-31", "http://www.wipo.int/pctdb/en/wo.jsp?WO=1994003932", "#cite_ref-32", "http://golden-ratio-in-dna.blogspot.com/2010/09/1994-2010-golden-ratio-and-fractals-in.html", "#cite_ref-33", "http://www.laetusinpraesens.org/musings/periody.php", "#cite_ref-34", "https://sites.google.com/site/codexbiogenesis/home/resumes-des-chapitres/chapitre-2-le-nombre-2-controle-la-nature-l-equation-de-la-table-periodique-des-elements-de-mendeleieev", "#cite_ref-35", "http://creationwiki.org/pool/images/0/08/Symmetry_and_Asymmetry_in_the_MENDELE%C3%8FEV%E2%80%99s_Periodic_Table_Predictive_EQUATION.pdf", "#cite_ref-36", "http://golden-ratio-in-dna.blogspot.com/2008/01/1997-perezs-generic-predictive-equation.html", "#cite_ref-37", "https://sites.google.com/site/codexbiogenesis/home/resumes-des-chapitres/chapitre-6-3e-code-la-symetrie-miroir-des-codons-jumeaux-albert-einstein-a-dit-l-imagination-est-plus-importante-que-le-savoir", "#cite_ref-38", "https://sites.google.com/site/codexbiogenesis/home/resumes-des-chapitres/chapitre-5-2d-code-le-nombre-2-et-le-rapport-numerique-des-2-3-partagent-la-population-des-64-codons-du-genome-humain", "#cite_ref-39", "https://sites.google.com/site/codexbiogenesis/home/resumes-des-chapitres/chapitre-1-1er-code-le-nombre-13-jaillit-du-genome-humain", "#cite_ref-40", "https://sites.google.com/site/codexbiogenesis/home/resumes-des-chapitres", "#cite_ref-41", "http://www.amazon.fr/product-reviews/2874340448/ref=cm_cr_dp_all_summary?ie=UTF8&showViewpoints=1&sortBy=bySubmissionDateDescending", "#cite_ref-42", "http://www.amazon.co.uk/Codex-Biogenesis-harmonies-g%C3%A9nome-latome/dp/2874340448", "#cite_ref-43", "http://www.amazon.fr/Codex-Biogenesis-13-codes-lADN/dp/2874340448#reader_2874340448", "#cite_ref-44", "http://www.amazon.co.uk/Codex-Biogenesis-harmonies-g%C3%A9nome-latome/dp/2874340448#reader_2874340448", "#cite_ref-45", "http://golden-ratio-in-dna.blogspot.com/", "#cite_ref-46", "https://sites.google.com/site/codexbiogenesis/home", "#cite_ref-47", "http://www.amazon.fr/product-reviews/2874340448/ref=cm_cr_dp_all_summary?ie=UTF8&showViewpoints=1&sortBy=bySubmissionDateDescending", "#cite_ref-48", "http://www.amazon.fr/Codex-biogenesis-13-codes-ladn/dp/2874340448", "#cite_ref-49", "http://creationwiki.org/pool/images/7/76/JcperezLiveBitsFromDNA.pdf", "#cite_ref-50", "http://www.resurgence.be/fiche.php?p=156&t=Codex%20Biogenesis", "#cite_ref-51", "http://www.amazon.fr/product-reviews/2874340448", "#cite_ref-52", "https://sites.google.com/site/codexbiogenesis/home/", "#cite_ref-53", "http://www.bitlifesciences.com/wcv2011/default.asp", "#cite_ref-54", "http://creationwiki.org/pool/images/a/a8/JcperezBeijing032011partIA.pdf", "#cite_ref-55", "http://creationwiki.org/pool/images/3/37/JcperezBeijing032011partIB.pdf", "#cite_ref-56", "http://creationwiki.org/pool/images/b/b5/JcperezBeijing032011partII.pdf", "#cite_ref-57", "http://creationwiki.org/pool/images/5/56/JcperezBeijing032011partIII.pdf", "http://www.amazon.fr/Codex-biogenesis-13-codes-ladn/dp/2874340448", "http://golden-ratio-in-dna.blogspot.com/2008/01/1994-first-music-of-genes.html", "http://k005.kiwi6.com/hotlink/g9t127ehul/01_track1the1stmusicofgenesbyjcperez1994sacemgen0694.mp3", "http://golden-ratio-in-dna.blogspot.com/2010/09/news-on-first-music-of-genes-jc-perez.html", "/File:CDtheFirstMusicOfGenesByJCperez(1994).jpg", "https://sites.google.com/site/thefirstmusicofgenes/home", "http://books.google.fr/books?id=VyNauS4AJ18C&pg=PA220&dq=jean-claude+perez+dna&hl=en&sa=X&ei=9EK4UdDBErGa0AXz0YCgBg&ved=0CDoQ6AEwAg#v=onepage&q=jean-claude%20perez%20dna&f=false", "https://tinyurl.com/y9dxaauv", "http://cosmicfingerprints.com/evolution/", "http://fr.scribd.com/doc/93804781/Thierry-Bardini-Junkware", "http://books.google.fr/books?id=7hZDllG70OYC&pg=PA94&dq=jean-claude+perez+dna&hl=en&sa=X&ei=9EK4UdDBErGa0AXz0YCgBg&ved=0CDQQ6AEwAQ#v=onepage&q=jean-claude%20perez%20dna&f=false", "http://books.google.fr/books/about/Junkware.html?id=7hZDllG70OYC&redir_esc=y", "http://books.google.fr/books?id=uImqkVSJqIAC&pg=PA111&dq=%22jean-claude+perez%22+fractals&hl=en&sa=X&ei=uGa4Uf3lAYLfPeqHgdAE&ved=0CC4Q6AEwAA#v=onepage&q=%22jean-claude%20perez%22%20fractals&f=false", "http://books.google.fr/books?id=IhU1H969-iUC&pg=PT132&dq=jean-claude+perez&hl=en&sa=X&ei=P0K4UduNC4TY0QWdw4HoDg&ved=0CF8Q6AEwBw", "http://books.google.fr/books?id=K6fac9RxXREC&pg=PA111&dq=jean-claude+perez+dna&hl=en&sa=X&ei=9EK4UdDBErGa0AXz0YCgBg&ved=0CC4Q6AEwAA#v=onepage&q=jean-claude%20perez%20dna&f=false", "http://books.google.fr/books?id=ZlhTtTv1U0cC&pg=PA130&dq=jean-claude+perez+dna&hl=en&sa=X&ei=9EK4UdDBErGa0AXz0YCgBg&ved=0CEAQ6AEwAw#v=onepage&q=jean-claude%20perez%20dna&f=false", "http://books.google.fr/books?id=VyNauS4AJ18C&pg=PA220&dq=jean-claude+perez+dna&hl=en&sa=X&ei=9EK4UdDBErGa0AXz0YCgBg&ved=0CDoQ6AEwAg#v=onepage&q=jean-claude%20perez%20dna&f=false", "http://books.google.fr/books?id=95VguLytQ7QC&pg=PT145&dq=jean-claude+perez+dna&hl=en&sa=X&ei=9EK4UdDBErGa0AXz0YCgBg&ved=0CEYQ6AEwBA", "http://books.google.fr/books?id=QOCMHnUrI_oC&q=jean-claude+perez+dna&dq=jean-claude+perez+dna&hl=en&sa=X&ei=9EK4UdDBErGa0AXz0YCgBg&ved=0CFgQ6AEwBw", "http://books.google.fr/books?id=fvZT5TNxajYC&pg=PT315&dq=jean-claude+perez+dna&hl=en&sa=X&ei=9EK4UdDBErGa0AXz0YCgBg&ved=0CEwQ6AEwBQ", "http://books.google.fr/books?id=IMNM-oNSEh4C&pg=PA240&dq=%22jean-claude+perez%22+fractals&hl=en&sa=X&ei=uGa4Uf3lAYLfPeqHgdAE&ved=0CEQQ6AEwBA#v=onepage&q=%22jean-claude%20perez%22%20fractals&f=false", "https://plus.google.com/+jeanclaudePerez/", "http://golden-ratio-in-dna.blogspot.com/", "https://sites.google.com/site/codexbiogenesis/home/", "/Template:Biography_navbox", "/Template_talk:Biography_navbox", "http://creationwiki.org/index.php?title=Template:Biography_navbox&action=edit", "/Portal:Biography", "/Worldview", "/Anticreation#Notable_anticreationists", "/Apologist#Notable_apologists", "/Christian_apologetics#Notable_apologists", "/Creationist", "/Evolutionist", "/Intelligent_design#Theorists", "/Category:Historical_creationist", "/Category:Historical_evolutionist", "/Philosopher", "/Christian_theology#Notable_theologians", "/File:People.png", "/Scientist", "/Biblical_Archaeology#Archaeologist", "/Astronomy#Astronomers", "/Category:Biologist", "/Category:Chemist", "/Creation_scientist", "/Category:Engineer", "/Category:Geneticist", "/Category:Geologist", "/Historical_creation_scientist", "/Category:Mathematician", "/Category:Paleontologist", "/Category:Physician", "/Category:Physicist", "/Bible_character", "/Category:Angel", "/Category:Apostle", "/Category:Biblical_king", "/Category:Church_father", "/Disciple#Disciples", "/Category:Doctor_of_the_Church", "/Category:High_priest", "/Category:Israelite", "/Jesus_Christ", "/Biblical_judge#Judges", "/Levite#Levites", "/Category:New_Testament_person", "/Category:Old_Testament_person", "/Category:Patriarch", "/Category:Saint", "/File:Creationwiki_portals.png", "/Category:Biography", "/Portal:Biography", "/File:Creationwiki_portals.png"], "authors": [], "publish_date": null}