{"result_id": "084020", "URL": "https://creationwiki.org/Rabies", "timestamp": "2023-04-25 14:52:12 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://creationwiki.org/Rabies", "encoding": "UTF-8"}, "image": null, "domain": "creationwiki.org", "title": "Rabies - CreationWiki, the encyclopedia of creation science", "cleaned_text": "From CreationWiki, the encyclopedia of creation science\n\nRabies is a preventable viral disease of mammals most often transmitted through the bite of a rabid animal. The vast majority of rabies cases reported each year occur in wild animals like raccoons, skunks, bats, and foxes. Domestic animals account for less than 10% of the reported rabies cases, with cats, cattle, and dogs most often reported rabid.[1]\n\nRabies virus infects the central nervous system, causing encephalopathy and ultimately death. Early symptoms of rabies in humans are nonspecific, consisting of fever, headache, and general malaise. As the disease progresses, neurological symptoms appear and may include insomnia, anxiety, confusion, slight or partial paralysis, excitation, hallucinations, agitation, hypersalivation, difficulty swallowing, and hydrophobia (fear of water). Death usually occurs within days of the onset of symptoms.[1]\n\nThere is no cure for rabies once symptoms are apparent. The best way to prevent rabies is through certain precautions and vaccinations.[2] Rabies is a disease spread far throughout the world and over 55,000 people die from the disease every year. Nearly 95% of those human deaths occur in Africa and Asia. A majority of human deaths result from a bite from an infected dog. About 30 to 60% of those bitten by infected dogs are under 15 years old. [3]\n\nThe Rabies virus can be found in the order Mononegavirales, the family Rhabdoviridae, and the genus Lyssavirus. The order Mononegavirales contains viruses that possess RNA genomes that are nonsegmented and negative-stranded. Rhabdoviruses are bullet shaped and are about 180 nm long and 75 nm wide. Rabies virions are covered on the surface with 10 nm glycoprotein peplomers. The ribonucleoprotein is made up of RNA inside the nucleoprotein. Rabies is considered as an RNA virus.\n\nThe Rabies genome has five different proteins. These proteins are labeled as N, P, M, G, and L. The combination of the rabies virus cells wrap around the host's cell membrane. This is referred to as adsorption. This action begins the rabies virus' infection process.Following adsorption, the rabies cell breaks through the host's cell and uses pinocytosis to enter into the host's cytoplasm. The rabies virions then accumulate in the host's large endosomes. The viruses membranes attach to the host's endosomal membranes. This triggers the discharge of viral RNP into the host's cytoplasm. Messenger RNA's are required to be transcribed for viral replication.\n\nThe next step is translation. The L gene of the Rabies virus transcribes the rabies RNA genomic strand of rabies RNA into leader RNA and five capped and polyadenylated mRNAs, which are then later translated into proteins.\n\nThe next stage is translation. Translation incorporates the combination of the proteins M,P,G,N, and L. This takes place on free ribosomes located inside the cytoplasm. After translation, processing takes place. Processing must occur in order to make the switch from translation to replication. This switch is regulated by the intracellular ratio of leader RNA to N protein. Once the switch is activated, the viral genome replication starts. The viral polymerase enters the cells genome and begins replicating copies of the genome.\n\nThe next stage of the cycle is assembly. While the assembly stage is occurring, the N-P-L complex encases genomic RNA with negative strands. This action creates the RNP core and the M protein becomes a matrix which surrounds the RNP. The RNP with the M protein matrix then moves on to an are on the plasma membrane which contains glycoprotein inserts. When the RNP with the M protein matrix reaches this point, the M protein begins to coil. The RNP-M protein combination then combines with the glycoprotein inserts. The new rabies virus is then completed at this point. The new virus is now able to spread to other organisms through the host's saliva. [4]\n\nRabies can be obtained from the saliva of an animal that is infected with rabies. The most common transmission of rabies is getting bitten by an infected animal. Any warm-blooded mammal may contract rabies. [5] Only a few mammals have the ability to spread the virus. Cats, dogs, raccoons, bats, coyotes, foxes, and skunks have the ability to spread the virus.[6] There are several ways for the rabies virus to be transmitted, some of the ways are bite exposure, direct human transmission, and non-bite transmission. Direct human transmission and non-bite transmission are very rare. The transmission of the rabies virus starts once an infected animal's saliva is transmitted into an animal that is uninfected. Once the rabies virus is inside an animal, it travels from it's entrance point to the brain by traveling along nerve cells. Once in the brain, the virus replicates itself and makes it's way to the animal's salivary glands. The infection cycle is repeated once the infected animal bites another organism that can be infected. Non-bite transmissions are very rare, but still occur. Non-bite transmissions include open wounds, scratches, mucous membranes contaminated with saliva, or other tissues infected by the virus that are from an infected animal. Inhalation may be another way of contracting the virus. However, this type of infection is highly unlikely to occur. Direct human transmission is probably the most rare form of transmission. The only case of direct human transmission that is well documented took place when eight human beneficiaries of corneas received the virus. New precautions, rarity of human transmission, and new guidelines have reduced the risk of direct human transmission. Theoretically, humans infected with rabies have the potential to transmit the virus to other through bites. However, there has been no record of such an occurrence. [7]\n\nSymptoms of rabies develop between twenty and sixty days after infection. Animals infected with rabies may show aggressiveness, sensitivity to touch, and hostility. This form of rabies is the more aggressive kind. This type of rabies is usually related to rabid dogs. The other type of rabies is a more passive type. The symptoms of this type include lethargy, slight paralysis, and weakness. In both types of rabies, the host of the disease usually dies from respiratory failure a few days after the appearance of the symptoms. The rabies progression for humans is quite similar. The human symptom free incubation stage can vary from ten years to about a year. After the incubation period, the infected person may experience melancholy, fatigue, loss of appetite, headaches, and fevers. Most infected people experience pain or numbness at the area of the bite. After about two to ten days, the infected person will show damage to the nervous system by experiencing seizures, hypersensitivity and hyperactivity, paralysis, hallucinations, and disorientation. Death usually follows on account of respiratory failure or cardiac arrest. One could stay in a coma for months if sustained by life-support. [8]\n\nRabies is untreatable once the symptoms appear and death is nearly certain once the symptoms are apparent. Any treatment that may be implemented involves making the infected feel comfortable and managing the symptoms. The only sure way of being safe from rabies is by having a post-exposure rabies shot administered. [9]\n\nThe best way to prevent rabies is through vaccination. If you own an animal that gets bitten by another animal get a rabies booster for them as soon as possible to prevent the spread of rabies. Stay away from wildlife and avoid contact with stray animals to prevent contracting rabies. If bitten, wash the bite for five minutes with soap and water. [10] There are several medications for rabies prevention. Rabies Virus Vaccine, Imovax Rabies , and RabAvert are some rabies vaccines. [2]\n• by the U.S. Center for Disease Control About Rabies by the U.S. Center for Disease Control\n• Centers for Disease Control and Prevention, 2/11/2009. The Rabies Virus Centers for Disease Control and Prevention, 2/11/2009.\n• Arthur Schoenstadt, Clinaero, Inc., March 31, 2009. What Causes Rabies? Arthur Schoenstadt, Clinaero, Inc., March 31, 2009.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/File:Bullet.JPG", "/File:Bullet.JPG", "/Viral_disease", "/Mammals", "/Raccoons", "/Skunks", "/Bats", "/Foxes", "/Domestic_animals", "#cite_note-cdc-1", "/Central_nervous_system", "#cite_note-cdc-1", "/Vaccinations", "#cite_note-intro-2", "/Human", "/Dogs", "#cite_note-intro1-3", "#Virology", "#Transmission_cycle", "#Causes", "#Symptoms", "#Treatment", "#Prevention", "#Viral_Diseases", "#References", "#External_Links", "/File:Xsect.JPG", "/File:Xsect.JPG", "/RNA", "/index.php?title=Glycoprotein&action=edit&redlink=1", "/index.php?title=Nucleoprotein&action=edit&redlink=1", "/File:Rabies_cycle.JPG", "/File:Rabies_cycle.JPG", "/index.php?title=Glycoprotein&action=edit&redlink=1", "#cite_note-Rabies1-4", "#cite_note-Causes_1-5", "#cite_note-causes_2-6", "#cite_note-7", "/File:Rabid_dog.jpg", "/File:Rabid_dog.jpg", "#cite_note-symptoms-8", "#cite_note-treatment-9", "/File:Rabavert.jpg", "/File:Rabavert.jpg", "/Vaccine", "/File:Rabies_Poster.jpg", "/File:Rabies_Poster.jpg", "/Vaccination", "#cite_note-prevention-10", "#cite_note-intro-2", "/AIDS", "/Avian_influenza", "/Chickenpox", "/Ebola", "/Gastroenteritis", "/Hepatitis_B", "/Hepatitis_C", "/Human_papillomavirus", "/Infectious_mononucleosis", "/Influenza", "/Measels", "/Mumps", "/Poliomyelitis", "/Smallpox", "/Swine_influenza", "/Yellow_fever", "/Template:Viral_disease", "#cite_ref-cdc_1-0", "#cite_ref-cdc_1-1", "http://www.cdc.gov/rabies/about.html", "#cite_ref-intro_2-0", "#cite_ref-intro_2-1", "http://www.wrongdiagnosis.com/r/rabies/prevent.htm", "#cite_ref-intro1_3-0", "http://www.who.int/mediacentre/factsheets/fs099/en/index.html", "#cite_ref-Rabies1_4-0", "http://www.cdc.gov/rabies/virus.html", "#cite_ref-Causes_1_5-0", "http://www.wrongdiagnosis.com/r/rabies/causes.htm", "#cite_ref-causes_2_6-0", "http://rabies.emedtv.com/rabies/what-causes-rabies.html", "#cite_ref-7", "http://rabies.emedtv.com/rabies/rabies-transmission.html", "#cite_ref-symptoms_8-0", "http://www.healthscout.com/ency/68/738/main.html", "#cite_ref-treatment_9-0", "http://rabies.emedtv.com/rabies/rabies-treatment.html", "#cite_ref-prevention_10-0", "http://www.co.amador.ca.us/depts/public_health/index.cfm?id=8", "http://www.cdc.gov/RABIES/", "http://www.who.int/mediacentre/factsheets/fs099/en/", "http://health.nytimes.com/health/guides/disease/rabies/overview.html", "/Template:Biology_navbox", "/Template_talk:Biology_navbox", "https://creationwiki.org/index.php?title=Template:Biology_navbox&action=edit", "/Biology", "/Organisms", "/Animal", "/Algae", "/Amphibian", "/Bacteria", "/Bird", "/Created_kind", "/Crustaceans", "/Dinosaur", "/Fish", "/Fungi", "/Human", "/Insect", "/Mollusk", "/Plant", "/Protist", "/Reptiles", "/File:Animal_diversity.jpg", "/Biological_scientist", "/Agriculture", "/Anatomy", "/Baraminology", "/Biologist", "/Biotechnology", "/Botany", "/Cell_biology", "/Ecology", "/Epidemiology", "/Embryology", "/Entomology", "/Biological_evolution", "/Genetics", "/Herpetology", "/Human_biology", "/Medicine", "/Microscopy", "/Physiology", "/Taxonomy", "/Virology", "/Zoology", "/Biological_system", "/Auditory_system", "/Circulatory_system", "/Digestive_system", "/Endocrine_system", "/Immune_system", "/Integumentary_system", "/Limbic_system", "/Lymphatic_system", "/Muscular_system", "/Nervous_system", "/Olfactory_system", "/Reproductive_system", "/Respiratory_system", "/Sensory_system", "/Skeletal_system", "/Visual_system", "/Biological_process", "/Aging", "/Cell_division", "/Cellular_respiration", "/Disease", "/Embryogenesis", "/Gene_expression", "/Metabolism", "/Metamorphosis", "/Parasitism", "/Photosynthesis", "/Pregnancy", "/Protein_synthesis", "/Reproduction", "/Symbiosis", "/Trophic_level", "/File:Creationwiki_portals.png", "/Category:Biology", "/Portal:Biology", "/Biology_news_archive", "/File:Creationwiki_portals.png"], "authors": [], "publish_date": null}