{"result_id": "084012", "URL": "https://creationwiki.org/Lung_cancer", "timestamp": "2023-04-25 14:51:58 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://creationwiki.org/Lung_cancer", "encoding": "UTF-8"}, "image": null, "domain": "creationwiki.org", "title": "Lung cancer - CreationWiki, the encyclopedia of creation science", "cleaned_text": "From CreationWiki, the encyclopedia of creation science\n\nLung cancer is the uncontrolled growth of abnormal cells in the lungs. Cancer occurs when the cells in the lungs start to undergo unregulated mitosis. It forms a tumor that clogs up the lung and causes it stop functioning properly. The tumor may grow for many years without being detected simply because of the size of the lungs. The most common symptom, which is a cough, is sometimes mistaken for a cold or bronchitis. [1] There are about 170,000 new cases each year in the United States. [2] [3] In 2003, 157,200 of those cases of lung cancer ended in death. [4] In the United States, more men are diagnosed with lung cancer than women, but the rate of female cancer is rising fast and will soon tie with the men, if not surpass it. Currently, more women die of lung cancer in the U.S. than of breast cancer. The majority of people who get lung cancer are smokers. While the process of smoking does cause cancer, it is not the only cause. [5]\n\nThere are many different symptoms for lung cancer. The symptoms usually show only when the disease is advanced. [6] Certain symptoms only come with certain types of cancer. [7] Symptoms for lung cancer may include:\n• A new cough that doesn't go away\n• Changes in a chronic cough or \"smoker's cough\"\n• Coughing up blood, even in a small amount\n• Swelling in the neck and face areas\n• A change in color or volume of sputum\n\n\n\n There are also certain symptoms that are side effects to lung cancer, such as:\n• Bone pain or tenderness, as well as bone fractures not related to accidental injury\n• Neurological symptoms, such as unsteady gait or memory loss\n\nLung cancer is the deadliest type of cancer for both men and women. More people die of lung cancer than those who die of breast, prostate, and colon cancers combined each year. [17] The most common place for lung cancer to begin is in the cells that line your lungs. [18] Doctors have divided lung cancer into two major types based on their physical appearance underneath a microscope. The treatment decisions by one's doctor are based on which of the two lung cancers the patient has. One is called small cell lung cancer. [19] About fifteen percent of all lung cancer cases are small cell lung cancer. This type of lung cancer is slightly more common in men than in women. It is the most aggressive form of lung cancer known to man. It starts in the bronchi in the center of the chest, and then begin to grow quickly into large cancerous tumors. These tumors can then spread to other parts of the body, including the brain, liver, and bone. The main cause of small cell lung cancer is smoking. [20] The other type of lung cancer is called non-small cell lung cancer. The term non-small cell lung cancer is actually a term that covers many different types of lung cancers that behave in similar ways. This includes squamous cell carcinoma, adenocarcinoma and large cell carcinoma. [21]\n\nSmoking is the leading cause for lung cancer. [22] [23] [24] [25] The more cigarettes that one may smoke per day and the earlier they started smoking increases their risk of being diagnosed with lung cancer. It should also be noted that there is no evidence that smoking low-tar cigarettes lowers one's risk of lung cancer. [26] Doctors believe that the reason smoking causes lung cancer is that the smoke damages the cells that line the lungs. Cigarette smoke is filled with many carcinogens, or cancer-causing substances, that cause changes in the lung tissue almost immediately. The body is capable of repairing the damage at first, but with each repeated exposure, the normal cells that line your lungs are increasingly damaged, which causes the cells to act abnormally, and may eventually lead to cancer. [27] While people can get lung cancer from smoking directly, they can also get it through secondhand smoke. Secondhand smoke is the smoke that one may breathe in from another person's cigarette. According to the American Cancer Society, an estimate of three thousand non-smoking adults die each year of lung cancer that was caused by secondhand smoke. [28]\n\nThe lungs are filled with many blood vessels and lymph vessels, which allows the cancer easy access to the rest of the body. This may cause the cancer to spread to other parts of the body before any of the symptoms surface. It may even spread to the other parts of the body before it can be detected in the lungs. [29] There are certain things that one may want to avoid besides smoking if they do not wish to be diagnosed with lung cancer. These things include:\n• Radiation therapy to the lungs (if lung cancer has not been diagnosed)\n• Exposure to cancer-causing chemicals such as uranium, beryllium, vinyl chloride, nickel chromates, coal products, mustard gas, chloromethyl ethers, gasoline, and diesel exhaust [30]\n\nThere are several different treatments that are recommended for lung cancer. The patient's physician will usually know what kind of treatment is necessary for the type of lung cancer that they have. The three main types of treatment are surgery, chemotherapy, and radiation. [31] [32] [33] While these three treatments are the most frequently used, they do not always work. That is why new treatments are constantly being developed and tested. [34]\n\nSurgery is a unique treatment in that it actually removes the cancerous tumor from the lungs. Even though this puts the patient at great risk, it offers probably the greatest chance of survival for the patient, depending on the type of cancer that they have. It is easier to remove when the cancer is in its earliest stages of development, mainly stage one and two. Surgery is usually the first step in cancer treatment, but sometimes chemotherapy and/or radiation treatment is used before surgery. This sometimes makes it easier to remove the tumor from the lungs. The person performing the surgery is called a thoracic surgeon, and is specially trained to perform the surgery. When the surgeon removes the tumor, he also removes a surrounding margin of tissue. This tissue is examined under a microscope, and if it is found to have no cancer in it, it is called a negative margin, and the cancer has been safely removed. If there is still a trace of cancer in the skin, it is called a positive margin, and more skin is removed until a negative margin is established. [35] [36]\n\nThere are three different types of surgery: a wedge resection, which is to remove a small section of lung that contains the tumor along with a margin of healthy tissue, a lobectomy, which is to remove the entire lobe of one lung, and a pneumonectomy, which is to remove an entire lung. [37] There are also two other different types of surgery used to remove lung cancer. One is called curative surgery. The purpose of this surgery is to remove a tumor when it appears to be confined to one area, meaning that it is in an early stage cancer, as has already been discussed above. This surgery aims to establish a negative margin, which means as much as an entire lung may be removed in order to ensure that the patient is cancer free, just like in a pneumonectomy. The second surgery is palliative surgery. This surgery simply aims to make the patient more comfortable by, for example, using laser surgery for the removal of an obstruction or opening of an airway. [38]\n\nWhile the treatment of lung cancer may be a good thing, there are some side effects that one might receive after surgery. One is pain. It is one of the most common side effects to surgery because some surgery for lung cancer requires cutting through the ribs and/or cutting a nerve. This takes several months to heal, and that can sometimes cause pain in the patient after the surgery has been finished for several days. Another possible side effect is infection. During the surgery, parts of the body might have been infected around the wound or inside the body, despite the careful precautions taken by doctors and surgeons to keep everything clean in the operating room. Antibiotics give by a doctor are able to treat most infections. [39]\n\nThe second type of treatment is chemotherapy. Chemotherapy is a process that uses strong chemicals and/or drugs to kill cancer cells, stop their reproduction, or slow their growth. [40] [41] The types of drugs used depends on the cancer, and in most situations, many of the drugs are combined together for the treatment, forming a new drug. Chemotherapy drugs are also used in a combination with surgery and radiation. The drugs are usually prescribed by a medical oncologist, but they may be given by an oncology nurse. Chemotherapy drugs can be administered in many different ways, such as orally, which means through the mouth, in tablet, capsule, or liquid form, or they can be administered intravenously, as it is with chemotherapy drugs for lung cancer. Chemotherapy itself is a type of therapy called systemic therapy, which means that it treat the whole body instead of just a few organs or organ systems. This is helpful because it will seek out any other cancer cells that have separated from the original tumor and kill them. [42]\n\nThe amount of chemotherapy drugs that a person will need to treat their cancer depends on what kind of cancer that they have, as well as the drugs themselves, and the patient's overall reaction to the treatment they have received. How often the treatment is administered also depends on the type of cancer. It can be given, daily, weekly, monthly, and even further until the patient has been taking them for years. Some treatments require rest periods between doses in order for the body to recover. While chemotherapy is considered to be systemic therapy, it can also be considered adjuvant therapy, which means that it is given in addition to something, in this case surgery and radiation. The goal of adjuvant therapy is to reduce the risk of recurring cancer. It does this by traveling throughout the body and killing any cancer cells that remain after the surgery has been completed. Chemotherapy can also be used as neo-adjuvant therapy, which is given before the surgery. The goal of this procedure is to shrink the lung tumor in size, which increases the success rate of it being removed. [43]\n\nChemotherapy has side effects as well. Some of these include nausea and vomiting, hair loss, fatigue, infections, bleeding, mouth sores, loss of appetite, and diarrhea. These side effects vary depending on the type of cancer that one has. Chemotherapy has been known to cause nausea and vomiting, but that does not mean that one should stop eating until it passes. There are medications for it, and some things that the patient can do to help the process to end would be to avoid fatty foods and to eat slowly. Hair loss is very common with chemotherapy. the hair may either fall out or simply thin, but it will grow back after treatment is over. Sometimes hair can come back in a different color than before, and can sometimes come back straight in stead of curly and vice versa. The fatigue caused by chemotherapy is actually something called anemia. The chemotherapy effects the bone marrow's ability to create red blood cells, causing anemia. Ways that a patient can cure this temporary anemia is to get lots of sleep at night and rest during the day. Eating food with lots of iron can also help. Chemotherapy's effect on bone marrow also reduces the number of white blood cells that battle infection. Patients can avoid infection by not exposing themselves to people that have an illness and the washing of hands frequently. When the chemotherapy effects the red blood cells, it also effects certain types of blood cells called platelets, which can lead to easier bruising and/or bleeding. Mouth sores are caused by chemotherapy because cells in the mouth are susceptible to its effects. This causes pain in the mouth so that the patient may avoid eating. Gaining the proper protein is still possible through liquids instead is a more favorable alternative. The loss of appetite caused by chemotherapy is mainly due to the nausea and vomiting. Eating small meals and taking liquid supplements is a healthy alternative. Chemotherapy also effects the cells in the lining of the gastrointestinal tract, causing diarrhea. There are medicines available for this side effect. [44]\n\nThe last form of treatment for lung cancer is radiation, also known as radiation therapy, or radiotherapy. [45] [46] [47] [48] [49] Radiation is a process that uses high-energy rays, stronger, but similar, to X-rays, to kill or shrink cancer cells. The radiation is usually produced from an outside source, but sometimes, small radioactive seeds are placed inside the body near the lung cancer in order to try to eliminate it from there. This is called brachytherapy, and it has been successfully used to treat prostate cancer. [50] [51] The radiation is administered by radiation-delivery machines, which are designed to focus the radiation in on exact parts of the body for certain periods of time. Precision is key in this operation because it reduces the risk of damage to the normal tissues around the tumor. However, some healthy tissue cells will be damaged, despite the efforts taken not to. [52]\n\nThe radiation treatment takes a great deal of time because the amount needed to kill the cancer cannot be given all at once. It is usually spaced out over a period of weeks or months, depending on the extent of the cancer, the dosage of radiation needed, and how the patient is effected by the treatment. Radiation is the sometimes used as the main cancer treatment for patients, while in other situations, it is used after surgery to kill any remaining cancer cells. [53]\n\nThe side effects of radiation include fatigue, eating problems, hair loss, and skin reactions. Fatigue is the most common side effect of the radiation treatment. The patient should get lots of rest while receiving the treatment. Radiation can also cause eating problems, or nausea, making it difficult for the patient to eat. There are certain medicines that can be taken to help with this problem, but some patients have found it helpful to eat smaller meals more often throughout their day instead of three large ones. It is also possible for the radiation treated patient to lose their hair. Also, the skin in the area of the treatment can become irritated, dry, and sensitive, and should be treated very gently. Sometimes, the skin will begin to peal like a sunburn. The treated site should be kept out of direct sunlight for at least a year after the treatment has been completed. [54]\n\nThere are also some other treatments that are being developed in order to help with lung cancer. Chemotherapy regimens are different mixtures of existing chemotherapy drugs that are being used to try and treat the cancer. [55] There are also some different varieties of therapies being used, such as targeted therapies, which include the use of monoclonal antibodies, anti-angiogenesis agents, growth factor inhibitors, bevacizumab (avastin), and erlotinib (tarceva) to kill cancer, photodynamic therapy, lung cancer vaccines, and gene therapy. All of these are being tested to see if anyone can come up with a true lung cancer vaccine. [56] [57]\n\nFirst of all, there is no absolute, surefire way to prevent ever getting lung cancer. You can, however, reduce the risk of getting lung cancer by doing any of the following:\n• Don't smoke- If you do not already smoke, don't start if you want to keep from having lung cancer. Parents should talk to their children about the dangers of smoking early on, because it is a proven fact that most people who smoke started in their teens.\n• Stop smoking- If you already smoke, stop smoking now. By quitting to smoke, you can reduce your chance of being infected with lung cancer.\n• Avoid secondhand smoke- You can also reduce the risk of getting lung cancer by staying away from people smoke, because statistics show that secondhand smoke is even worse than direct smoke, especially for children.\n• Test your home for radon- Having your home checked for radon can reduce your lung cancer risk.\n• Avoid carcinogens at work- Protect yourself from toxic chemicals, and if you are working in an area with lots of toxic chemicals, such as a chemistry lab, and you are offered a mask to wear, take the mask.\n• Eat a diet full of fruits and vegetables- Get the vitamins you need through a healthy diet rather than in pill form, because there have been situations where researchers gave heavy smokers beta carotene supplements in order to lessen their lung cancer risk, and the supplements actually increased the risk of cancer in smokers.\n• Drink alcohol in moderation, if at all- Limiting oneself to one or two drinks a day (one for women, and two for men) is a good idea when it comes to preventing lung cancer. Anyone whose age is more then sixty-five should have no more then one drink per day.\n• Exercise- The minimum for exercise should be thirty minutes most days of the week. Start out slowly, and then add more and more as you progress. [58] [59] [60] [61] [62]", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/File:Cancerous_lung.jpg", "/File:Cancerous_lung.jpg", "/Cells", "/Cancer", "/Mitosis", "http://www.meds.com/lung/guide/u_lung.html", "http://www.meds.com/lung/guide/u_lung.html", "http://www.helpwithsmoking.com/smoking-and-cancer.php", "http://www.helpwithsmoking.com/smoking-and-cancer.php", "http://www.meds.com/lung/guide/u_lung.html", "#Symptoms", "#Causes", "#Treatment", "#Surgery", "#Chemotherapy", "#Radiation_therapy", "#Prevention", "#References", "#Additional_info", "#Other_respiratory_diseases", "http://www.mayoclinic.com/health/lung-cancer/DS00038/DSECTION=symptoms", "http://www.lungcancer.org/reading/symptoms.php", "http://www.mayoclinic.com/health/lung-cancer/DS00038/DSECTION=symptoms", "http://www.helpwithsmoking.com/smoking-and-cancer.php", "https://www.google.com/health/ref/Lung+cancer", "http://www.meds.com/lung/guide/u_lung.html", "http://www.nlm.nih.gov/medlineplus/ency/article/000122.htm", "http://www.lungcancer.org/reading/symptoms.php", "https://www.google.com/health/ref/Lung+cancer", "http://www.nlm.nih.gov/medlineplus/ency/article/000122.htm", "http://www.lungcancer.org/reading/symptoms.php", "/File:Lung_comparison.png", "https://www.google.com/health/ref/Lung+cancer", "http://www.mayoclinic.com/health/lung-cancer/DS00038/DSECTION=causes", "http://www.mayoclinic.com/health/lung-cancer/DS00038/DSECTION=causes", "http://www.nlm.nih.gov/medlineplus/ency/article/000122.htm", "http://www.mayoclinic.com/health/lung-cancer/DS00038/DSECTION=causes", "https://www.google.com/health/ref/Lung+cancer", "http://www.helpwithsmoking.com/smoking-and-cancer.php", "http://www.mayoclinic.com/health/lung-cancer/DS00038/DSECTION=causes", "http://www.nlm.nih.gov/medlineplus/ency/article/000122.htm", "https://www.google.com/health/ref/Lung+cancer", "http://www.mayoclinic.com/health/lung-cancer/DS00038/DSECTION=causes", "https://www.google.com/health/ref/Lung+cancer", "http://www.mayoclinic.com/health/lung-cancer/DS00038/DSECTION=causes", "/Mesothelioma", "https://www.google.com/health/ref/Lung+cancer", "/File:A_Lung_with_Lung_Cancer.jpg", "http://www.nlm.nih.gov/medlineplus/ency/article/000122.htm", "http://www.lungcancer.org/reading/treatment/types.php", "https://www.google.com/health/ref/Lung+cancer", "http://www.lungcancer.org/reading/treatment/types.php", "http://www.lungcancer.org/reading/treatment/types.php", "http://www.helpwithsmoking.com/smoking-and-cancer.php", "http://www.mayoclinic.com/health/lung-cancer/DS00038/DSECTION=treatments-and-drugs", "http://www.lungcancer.org/reading/treatment/types.php", "http://www.lungcancer.org/reading/treatment/types.php", "http://www.mayoclinic.com/health/lung-cancer/DS00038/DSECTION=treatments-and-drugs", "http://www.lungcancer.org/reading/treatment/types.php", "http://www.lungcancer.org/reading/treatment/types.php", "http://www.lungcancer.org/reading/treatment/types.php", "http://www.lungcancer.org/reading/treatment/types.php", "/File:Lung_cancer.jpg", "/Radiation", "http://www.mayoclinic.com/health/lung-cancer/DS00038/DSECTION=treatments-and-drugs", "http://www.helpwithsmoking.com/smoking-and-cancer.php", "https://www.google.com/health/ref/Lung+cancer", "http://www.nlm.nih.gov/medlineplus/ency/article/000122.htm", "http://www.lungcancer.org/reading/treatment/types.php", "http://www.mayoclinic.com/health/lung-cancer/DS00038/DSECTION=treatments-and-drugs", "http://www.lungcancer.org/reading/treatment/types.php", "http://www.lungcancer.org/reading/treatment/types.php", "http://www.lungcancer.org/reading/treatment/types.php", "/Sunburn", "http://www.lungcancer.org/reading/treatment/types.php", "http://www.lungcancer.org/reading/treatment/types.php", "http://www.mayoclinic.com/health/lung-cancer/DS00038/DSECTION=treatments-and-drugs", "http://www.lungcancer.org/reading/treatment/types.php", "http://www.mayoclinic.com/health/lung-cancer/DS00038/DSECTION=prevention", "https://www.google.com/health/ref/Lung+cancer", "http://www.nlm.nih.gov/medlineplus/ency/article/000122.htm", "http://www.lungcancer.org/reading/prevention.php", "http://www.helpwithsmoking.com/smoking-and-cancer.php", "http://www.helpwithsmoking.com/smoking-and-cancer.php", "https://www.google.com/health/ref/Lung+cancer", "http://www.nlm.nih.gov/medlineplus/ency/article/000122.htm", "http://www.meds.com/lung/guide/u_lung.html", "http://www.lungcancer.org/", "http://www.mayoclinic.com/health/lung-cancer/DS00038", "http://www.medicinenet.com/lung_cancer/article.htm", "http://www.cancer.gov/cancertopics/types/lung", "http://en.wikipedia.org/wiki/Lung_cancer", "http://www.webmd.com/lung-cancer/default.htm", "/Acute_respiratory_distress_syndrome", "/Asthma", "/Chronic_obstructive_pulmonary_disease", "/Influenza", "/Lung_disease", "/Measles", "/Mesothelioma", "/Template:Respiratory_disease", "/Template:Biology_navbox", "/Template_talk:Biology_navbox", "https://creationwiki.org/index.php?title=Template:Biology_navbox&action=edit", "/Biology", "/Organisms", "/Animal", "/Algae", "/Amphibian", "/Bacteria", "/Bird", "/Created_kind", "/Crustaceans", "/Dinosaur", "/Fish", "/Fungi", "/Human", "/Insect", "/Mollusk", "/Plant", "/Protist", "/Reptiles", "/File:Animal_diversity.jpg", "/Biological_scientist", "/Agriculture", "/Anatomy", "/Baraminology", "/Biologist", "/Biotechnology", "/Botany", "/Cell_biology", "/Ecology", "/Epidemiology", "/Embryology", "/Entomology", "/Biological_evolution", "/Genetics", "/Herpetology", "/Human_biology", "/Medicine", "/Microscopy", "/Physiology", "/Taxonomy", "/Virology", "/Zoology", "/Biological_system", "/Auditory_system", "/Circulatory_system", "/Digestive_system", "/Endocrine_system", "/Immune_system", "/Integumentary_system", "/Limbic_system", "/Lymphatic_system", "/Muscular_system", "/Nervous_system", "/Olfactory_system", "/Reproductive_system", "/Respiratory_system", "/Sensory_system", "/Skeletal_system", "/Visual_system", "/Biological_process", "/Aging", "/Cell_division", "/Cellular_respiration", "/Disease", "/Embryogenesis", "/Gene_expression", "/Metabolism", "/Metamorphosis", "/Parasitism", "/Photosynthesis", "/Pregnancy", "/Protein_synthesis", "/Reproduction", "/Symbiosis", "/Trophic_level", "/File:Creationwiki_portals.png", "/Category:Biology", "/Portal:Biology", "/Biology_news_archive", "/File:Creationwiki_portals.png"], "authors": [], "publish_date": null}