{"result_id": "084006", "URL": "https://creationwiki.org/American_Civil_Liberties_Union", "timestamp": "2023-04-25 14:51:50 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://creationwiki.org/American_Civil_Liberties_Union", "encoding": "UTF-8"}, "image": null, "domain": "creationwiki.org", "title": "American Civil Liberties Union - CreationWiki, the encyclopedia of creation science", "cleaned_text": "From CreationWiki, the encyclopedia of creation science\n\nThe American Civil Liberties Union (ACLU) is a New York-based organization which provides attorneys and legal counsel for legal cases in which it believes individual rights have been violated. Their website boasts that they are America's \"guardian of liberty\"[1]. The organization is a member of the non-official anticreation lobby in the US government judicial system. The ACLU claims to be a defender of the rights of US citizens, but claims exclusivity over the Constitution to define homosexuality and abortion.\n\nThe ACLU's supporters say it has been vital in preserving personal freedoms by fighting for the principles contained in the U.S. Constitution and the Bill of Rights, and while in some cases this may be true, the ACLU severely neglects the 1st Amendment, which provides free-speech for the Christian majority and instead insists on promoting that other religions are persecuted in the United States. Its critics say it has done more to promote moral decay in the United States than has any other organization, and it works feverishly to undermine the nation's Christian and moral heritage. [5] However, the ACLU has been called up to protect the rights of Christians, as well, including the freedom of religion and free exercise, the freedom of speech to speak against abortion, homosexuality, etc.[6] Ironically, the ACLU defends the rights of people to be verbal against things such as homosexuality, but it itself is staunchly in favor of it.\n\nThe ACLU also believes that black people are treated worse than white people in public schools. Their source of these claims is the Education and Justice departments in the federal government. The ACLU has advocated that the federal government enforce 'training programs' for schools that are seen racially discriminating.[2]\n\nThe American Civil Liberties Union began in 1920. It grew out of the National Civil Liberties Bureau (NCLB) that lawyer Crystal Eastman and sociologist Roger Baldwin organized in 1917. The NCLB gave legal aid to conscientious objectors (those who objected to doing military service) and to those whom the government was prosecuting under the Espionage Act of 1917 and the Sedition Act of 1918.\n\nIn its early years, the organization had close ties to the Communist Party. The General Secretary of the Communist Party, Earl Browder, said the ACLU functioned as \"a transmission belt\" for the party. [7] Even though Baldwin removed communist members from the ACLU board by 1940, the Report of the California Senate Fact-Finding Subcommittee on Un-American Activities in 1943 said in part:\n\nThe ACLU continues to have a reputation as a leftist organization because of its support for such matters as homosexual marriages, [9] abortion on demand, [10] and tax exemption for Satanists. [11] It opposes school prayer, [12] public religious displays, [13] and tax exemption for churches. [14]\n\nThe ACLU has long opposed teaching creation science in public schools. In 1925 it mounted a challenge in Tennessee to the Butler Act, which outlawed—in state-funded institutions—teaching:\n\nIn a test case, the ACLU recruited Tennessee schoolteacher John Scopes to stand trial for having taught evolution in a public school. [16] Scopes lost the trial, but the fundamentalist side, led by lawyer William Jennings Bryan, suffered ridicule that cost it much public sympathy.\n• The ACLU has opposed creation science since the famous Scopes evolution trial of 1925. In this trial, the ACLU backed Tennessee schoolteacher John Scopes in defying a state law that banned teaching Darwin’s theory of evolution in state-funded institutions.\n• In 1968, the ACLU argued in Epperson vs. Arkansas that Arkansas' ban on teaching \"that mankind ascended or descended from a lower order of animals\" was a violation of the First Amendment, which forbids official religion.\n• In the 1986 case of Edwards vs. Aguillard, the ACLU convinced the court to strike down a Louisiana law that required public school science teachers to give \"equal time\" to creation science if they taught students about the theory of evolution. [17]\n• In August 1999, the ACLU sent a letter to public school districts in Kansas and Western Missouri warning them that teaching creation science \"could lead to legal action on religious liberty grounds.\" [18]\n• The ACLU Position Statement on \"creation-science\" (March 11, 2002), which opposes teaching creation science and intelligent design in public schools. [19]\n\nThe ACLU regards the intelligent design movement as \"creation in disguise\". Its opposition to intelligent design includes:\n• On February 14, 2006, the American Civil Liberties Union of Ohio sent a letter to the Toledo public schools demanding they stop staff from teaching intelligent design in science classrooms throughout the district. [20]\n• The ACLU praised a court’s ruling on December 20, 2005 that struck down a school board’s decision in Dover, Pennsylvania, to teach intelligent design as an alternative to evolution. [21] The ACLU led the legal challenge in the case.\n• On January 13, 2005, the ACLU issued a media release applauding a federal judge’s ruling that placing disclaimer stickers warning that evolution is \"a theory, not a fact\" in public school science textbooks is an unconstitutional government intrusion on religious liberty. [22]\n\nThere is a long history of the ACLU's opposition to Judeo-Christian values representative of biblical principles, which the United States was built on.\n\nIn 1992, in the case Lee vs. Weisman, the ACLU said including a prayer at the beginning of a public high school graduation ceremony violated the Establishment Clause.[3]\n\nIn a 1989 Supreme Court case, the ACLU represented the family of Nancy Cruzan. Cruzan had been in a persistent vegetative state since 1983 and had a feeding tube. Her family wanted the feeding tube to be removed, but she did not have a living will and the state of Missouri refused to remove it. The court ruled in 1990 that it was constitutional for Missouri to require clear instructions in a living will before ending treatment on an incompetent person. Although the court did not go as far as the ACLU urged, it did recognize living wills as evidence of a patient's wishes. (Cruzan vs. Director of the Missouri Department of Health)[3]\n\nIn 1973 the ACLU fought for women's right to terminate their pregnancy. (Roe vs. Wade/Doe vs. Bolton[3]\n\nIn 1945 the ACLU opposed laws requiring prostitutes to submit to examinations or vaccinations, saying these violated the women's rights to \"medical liberty.\"[4]\n\nIn its first \"homosexual rights\" victory, the ACLU in 1996 convinced the court to squash a Colorado constitutional amendment that barred the state from enacting gay rights laws. (Romer vs. Evans)[5]\n\nIndecent speech\n\n In 1997 the court struck down Congress's Communications Decency Act, which tried to ban indecent speech on the internet. (Reno vs. ACLU[6]\n\nIn his Coral Ridge Hour broadcast on May 2, 2003, Christian leader Dr. D. James Kennedy said the ACLU was \"strenuously opposed to anything that most Americans consider good and normal.\" [23]\n\nOn June 2, 2004, FOX News Channel host Bill O'Reilly called the American Civil Liberties Union (ACLU) a \"fascist organization\". On radio the same day O'Reilly said the ACLU was \"the most dangerous organization in the United States of America right now.\" [24]\n\nIn 1990, Christian broadcaster Pat Robertson founded the American Center for Law and Justice (ACLJ), as a response to the ACLU, which Robertson said was \"liberal\" and \"hostile to traditional American values\". [25]\n\nOn September 13, 2001, two days after terrorists attacked the World Trade Center in New York, Rev. Jerry Falwell said on television that \"The ACLU has got to take a lot of blame for this.\" Next day, he issued an apology for his comments and said he believed that the terrorists alone were responsible for the attacks. He added, however, that he still believed that groups trying to secularize America have helped remove the nation from its spiritual foundations. [26]\n• \"The Successes of the American Civil Liberties Union\". American Civil Liberties Union.\n• ACLU’s 100 greatest hits Some of the cases of which the ACLU is proud\n• ACLU's document: Victory in the Challenge to Intelligent Design\n• Decades of Shame: A short history of the ACLU Center for Reclaiming America for Christ\n• American Center for Law & Justice Dedicated to fighting the ACLU\n• Is the ACLU good for America? ProCon.org", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/File:Aclu.JPG", "/File:Aclu.JPG", "/File:ACLUcardmember.png", "/File:ACLUcardmember.png", "https://www.aclu.org/womens-rights/aclu-card-mackelmore", "#cite_note-1", "/Anticreation", "/United_States", "/Christianity", "http://65.240.226.70/Pages/ACLU/ACLUhome.html", "/Abortion", "/Homosexuality", "http://www.aclufightsforchristians.com/", "/Public_schools", "#cite_note-2", "http://www.aclu.org/", "#History", "#Early_ties_to_communism", "#Opposition_to_American_values", "#Opposition_To_Scientific_Alternatives", "#Creation_Science", "#Intelligent_Design", "#ACLU.E2.80.99s_Opposition_To_Christian_Values", "#Prayer", "#Euthanasia", "#Abortion", "#Prostitution", "#Homosexuality", "#Critics_of_the_ACLU", "#Related_references", "#Anti-ACLU_sites", "#Pro_ACLU_sites", "#See_also", "http://65.240.226.70/Pages/ACLU/decades.html", "http://arar.essortment.com/acluamericanci_rmal.htm", "/Homosexuality", "http://www.aclu.org/lgbt/gen/12338leg19990115.html", "http://www.aclu.org/FilesPDFs/ACF4E49.pdf", "http://65.240.226.70/Pages/ACLU/Policy.html", "http://www.aclu.org/religion/schools/16155prs20011212.html", "http://www.aclu.org/religion/gen/16196prs20020917.html", "http://65.240.226.70/Pages/ACLU/Policy.html", "/Butler_Act", "/Human_beings", "/Bible", "/Animals", "http://www.bradburyac.mistral.co.uk/tenness1.html", "/John_Scopes", "/Theory_of_evolution", "http://www.bradburyac.mistral.co.uk/tenness1.html", "/Fundamentalism", "/William_Jennings_Bryan", "/Creation_science", "/Tennessee_vs._John_Scopes", "/John_Scopes", "/Theory_of_evolution", "/Epperson_vs._Arkansas", "/Edwards_vs._Aguillard", "/Theory_of_evolution", "http://www.aclu.org/takeaction/general/18892res20030225.html", "http://www.aclu.org/religion/schools/16121prs19990813.html", "/Creation_science", "/Intelligent_design", "http://www.aclu.org/religion/gen/16154res20020311.html", "/Genesis", "/Intelligent_design", "http://www.aclu.org/religion/schools/24147prs20060214.html", "http://www.aclu.org/religion/intelligentdesign/23158prs20051220.html", "http://www.aclu.org/religion/schools/16376prs20050113.html", "/Establishment_Clause", "#cite_note-successes-3", "#cite_note-successes-3", "#cite_note-successes-3", "#cite_note-4", "/Homosexuality", "#cite_note-5", "#cite_note-6", "http://65.240.226.70/Pages/ACLU/StoryArchives.asp", "/United_States_of_America", "http://mediamatters.org/items/200406080005", "/American_Center_for_Law_and_Justice", "http://www.experiencefestival.com/a/American_Civil_Liberties_Union_-_Critics_of_the_ACLU/id/1293079", "http://www.truthorfiction.com/rumors/f/falwell-robertson-wtc.htm", "#cite_ref-1", "https://www.aclu.org/about-aclu-0", "#cite_ref-2", "https://www.aclu.org/blog/racial-justice/race-discrimination-school-discipline-real-problem", "#cite_ref-successes_3-0", "#cite_ref-successes_3-1", "#cite_ref-successes_3-2", "http://www.aclu.org/takeaction/general/18892res20030225.html", "#cite_ref-4", "http://65.240.226.70/Pages/ACLU/decades.html", "#cite_ref-5", "http://www.aclu.org/takeaction/general/18892res20030225.html", "#cite_ref-6", "http://www.aclu.org/takeaction/general/18892res20030225.html", "http://www.aclu.org/about/index.html", "http://www.aclu.org/takeaction/general/18892res20030225.html", "http://www.aclu.org/religion/intelligentdesign/index.html", "http://en.wikipedia.org/wiki/ACLU", "http://www.stoptheaclu.org/", "http://65.240.226.70/Pages/ACLU/decades.html", "http://www.cogscreations.net/thingsonmymind/aclu.htm", "http://www.aclj.org/", "http://www.AllianceDefenseFund.org/", "http://www.acluprocon.org/", "http://arar.essortment.com/acluamericanci_rmal.htm", "http://www.holysmoke.org/sdhok/aclu00.htm", "/Anticreation", "/Tennessee_vs._John_Scopes", "/Fundamentalism", "/John_Scopes", "/William_Jennings_Bryan", "/Inherit_the_Wind", "/Creation_vs._Evolution_Trials", "/Template:Anticreation_navbox", "/Template_talk:Anticreation_navbox", "http://www.en.creationwiki.org/index.php?title=Template:Anticreation_navbox&action=edit", "/Anticreation", "/Atheism", "/Anticreationists", "/Common_descent", "/Creation_vs._evolution", "/Creation_vs._evolution_poll", "/Anticreationist_debate_tactics", "/Evolutionism", "/Humanism", "/Legal_controversy", "/Macroevolution", "/Anticreation_in_Media", "/Naturalism", "/Anticreation_in_Public_Schools", "/Sceptic_arguments", "/Talk.Origins_Archive", "/Theistic_evolutionism", "/Theory_of_evolution", "/File:Dead_Darwin_Fish_large.png", "/Creationism_versus_Science", "/EvoWiki", "/Index_to_Creationist_Claims", "/FABNAQ", "/Transitional_Vertebrate_Fossils_FAQ", "/American_Humanist_Association", "/National_Academy_of_Sciences", "/National_Center_for_Science_Education", "/File:Creationwiki_portals.png", "/Category:Anticreation", "/Portal:Creation", "/Anticreation_news_archive", "/File:Creationwiki_portals.png"], "authors": [], "publish_date": null}