{"result_id": "084022", "URL": "https://creationwiki.org/Immune_system", "timestamp": "2023-04-25 14:52:15 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://creationwiki.org/Immune_system", "encoding": "UTF-8"}, "image": null, "domain": "creationwiki.org", "title": "Immune system - CreationWiki, the encyclopedia of creation science", "cleaned_text": "From CreationWiki, the encyclopedia of creation science\n\nThe immune system is a body-wide network of white blood cells (leukocytes), tissues, and organs that was designed to defend the body against \"foreign\" invasions. The proper targets of the immune system are infectious organisms--bacteria (such as streptococci), fungi, parasites (which include the worm-like microbes that cause malaria) and viruses such as the SARS virus.[1]\n\nThe immune system includes two main responses: the humoral immune response and the cellular immune response. The humoral immune response produces antibodies and the cellular immune response kills the infected cells. [2]\n\nThe innate immune response is a part of the immune system that is not specific to any one pathogen. It includes external barriers, like skin and the mucous membranes in the nose, throat, and stomach. When this first line of defense is broken, as when you cut your finger, cytokines and complement proteins will be released. Cytokines are proteins that direct cells toward the site of infection.[3] Complement proteins assist the immune response, mainly by assisting with killing cells and by triggering inflammation.\n\nThe Humoral Immune Response is the aspect of immunity that is mediated by secreted antibodies produced in the cells of the B lymphocyte lineage (B cell), as opposed to cell-mediated immunity which involves T lymphocytes (T cell). Secreted antibodies bind to antigens (substance such as a toxin or enzyme that stimulates an immune response). Antigens may be found on the surfaces of invading microbes (such as viruses or bacteria). Binding by antibodies flags the antigen for destruction.[4]\n\nB cells and T cells are the most abundant lymphocytes. B cells are the basis for the humoral immune response. B cells work mainly by secreting soluble substances known as antibodies. It’s developed into an antibody-secreting plasma cell; a helper T cell with the same specificity must also bind to the antigen. When the B cells received a chemical signals form the T cells, it divided and differentiated the B cells and then it leads to the formation of plasma cells. As the plasma cells develops the number of ribosomes and the amount of endoplasmic reticulum in the cytoplasm will also increased. The plasma cells arising because of the antibodies that produced by the B cells which specific for the antigen that bound to the parent B cells. The antibody’s specific was maintained by the B cell’s proliferate.(Purves, p374)\n\nAntibodies are \"Y\" shaped proteins called immunoglobulins. They are produced in the blood or tissues in response to a specific antigen, such as a bacterium or a toxin. Antibodies destroy or weaken bacteria and neutralize organic poisons, thus forming the basis of immunity.\n\nAntibody consisting four polypeptide chains, two of these is called light chains and heavy chains. They were holding together by the disulfide bonds. Each of the polypeptide consists of a variable region and constant region.\n\nVariable Region is a region in an immunoglobulin molecule that shows many sequence differences between antibodies of different specificities; the part of the antibody that binds to the antigen. Constant Region is the portion of the carboxyl terminal of an immunoglobulin heavy and light chains having an amino acid sequence that does not vary within a given class or subclass of immunoglobulin. The constant region determine the class of the antibody. (Purves, p375)\n\nThere are five classes of antibody: IgG, IgM, IgD, IgA, and IgE. These monoclonal antibodies are produced by hybridomas. IgG is the most abundant immunoglobulin class. It is soluble and it make up nearly 80 percent of the total immunoglobulin content of the bloodstream. (Purves, p375) IgG could move through placenta into the fetus' blood. IgA could move through the alimentary canal and is the main reason for the mucus membranes could prevent infecting again by the same bacteria.\n\nAntigens are the things bound by the antibodies. Antigens are the macromolecules that elicit an immune response in the body, they are proteins, and polysaccharides. The antigens are a substance that when introduced into the body stimulates the production of an antibody. Antigens include toxins, bacteria, foreign blood cells, and the cells of transplanted organs. They are killing by the antibodies when they were recognized by the T cells, and the T cells will let the B cell know and the B cells will eventually produced the antigens to kill the antigens.\n\nImmunity or immunological memory is the ability of the immune system to remember exposures to foreign particles, sometimes for decades. This ability is due to a type of B cell called a Memory cell (Purves, p372).\n\nAdaptive immunity will keep developing until we die. This kind of immunity involves lymphocytes. There are two types of adaptive immunity: Natural immunity and Artificial immunity. Natural immunity has two branches, maternal, which is passive; and infection, which is active. Artificial immunity also has two branches, antibody transfer and immunization; these two are also passive and active.\n\nPassive immunity is the immunity acquired by the transfer of antibodies from another individual, as through injection or placental transfer to a fetus. This transfer protects young children so they are not affected by certain germs.[5]\n\nActive immunity occurs when the body produces long-lasting memory cells. This can occur during the course of an infection or in response to a vaccination. Immunization shots or vaccinations are designed to induce immunological memory. By exposing the immune system to either protein fragments or whole pathogens that have been modified so they don't cause disease, a primary immune response is initiated, during which memory cells are made (Purves, p372). Vaccinations are very effective against diseases like smallpox, chicken pox, etc. When we accept this kind of vaccination, we will not get the same disease as long as memory cells remain in the system.[6]\n\nIn addition to having a role in the humor immune response, T cells are the effectors in the cellular immune response, which is directed at any factor such as a virus or mutation that has changed a normal cells into an abnormal cells. There are two types of T Cells. One is called helper T cells and the other is called cytotoxic T cells.\n\nT cell receptors are not immunoglobulins, but glycoproteins with molecular weights about half that of an IgG. They consists two polypeptide chains, and each on them encoded by a separate gene. Therefore this two chains are different in their amino acid sequence, especially in their variable regions.(Purves, p378)\n\nThe most important cells among the T cells are the helper T cells. They are needed to activate many immune cells, including B cells and other T cells. [7]\n\nThere is one major difference between the T cell receptors and the antibodies. While the antibodies bind to an intact antigen the T cells bind to a piece of the antigen displayed on the surface of an antigen-presenting cell. (Purves, p378)\n\nCytotoxic T Cells recognize virus-infected cells and kill them by inducing lysis. (Purves, p378) Cytotoxic T cells will prevent those viruses infect your cell. They will kill the infected cell and keep your body healthy. And they are also responsible for the rejection of tissue and organ grafts.[7]\n\nCytotoxic T cells could recognizes and binds to the MHC I by its surface protein which called CD8. And it also releases perforin, granulysin, and a serine protease called granzyme. The perforin and granulysin are cytotoxins, they form pores in the target cell's plasma membrane causing ions and water to flow into the target cell that make the cell expand and eventually undergo lysis.[8]\n\nHelper T Cells assist both the cellular and humoral immune responses. It must binds to an antigen presented on a B cell before it become activated.(Purves, p378) Helper T cells have a surface protein called CD4 that recognizes MHC II.\n\nThere are three types of helper T cells: Th1, Th2, and Th17. Basically Th1 are the cells which could control the intracellular pathogen like viruses and bacteria. Th2 are the cells that help the B cells and are the basic of antibody-mediated immunity. And they are essential in the control of extracellular pathogens. Th17n are the prevent the inbreak of the invaders at the surface.\n\nThe Major Histocompatibility Complex (MHC) are the major proteins in establishing self-tolerance, without the possibility of an animal destroyed by its own immune system. MHC proteins are responsible for transplant rejection. The proteins produced by the MHC are specific to each individual so they act as antigens if transplanted into another individual.\n\nWhen an organ transplanted from one to the other is recognizes as nonself, it will be rejected by the immune system, but if it comes from a genetically identical person, then it is not rejected. Those rejection problem could be solved by using drugs such as cyclosporin which suppress the immune system. (Purves, p381)\n\nUsually, the MHC is divided into the class I, II and II regions, each containing groups of genes with related functions.\n\nWhen your immune system malfunctions, it can unleash a torrent of disorders and diseases.[10] If a person is born with a severely defective immune system, death from infection by a virus, bacterium, fungus or parasite will occur. In severe combined immunodeficiency, lack of an enzyme means that toxic waste builds up inside immune system cells, killing them and thus devastating the immune system.[11]\n\nOne of the most familiar immune disorders is allergy. Allergies such as hay fever and hives are related to the antibody known as IgE. The first time an allergy-prone person is exposed to an allergen--for instance, grass pollen--the individual's B cells make large amounts of grass pollen IgE antibody. These IgE molecules attach to granule-containing cells known as mast cells, which are plentiful in the lungs, skin, tongue, and linings of the nose and gastrointestinal tract. The next time that person encounters grass pollen, the IgE-primed mast cell releases powerful chemicals that cause the wheezing, sneezing, and other symptoms of allergy.[10]\n\nMost other immune disorders result from either an excessive immune response or an 'autoimmune attack '.[11] This happens when immune system's recognition apparatus breaks down, and the body begins to manufacture antibodies and T cells directed against the body's own cells and organs. Such cells and autoantibodies, as they are known, contribute to many diseases. For instance, T cells that attack pancreas cells contribute to diabetes, while an autoantibody known as rheumatoid factor is common in persons with rheumatoid arthritis.[12]\n\nAsthma, familial Mediterranean fever and Crohn's disease (inflammatory bowel disease) all result from an over-reaction of the immune system, while autoimmune polyglandular syndrome and some facets of diabetes are due to the immune system attacking 'self' cells and molecules. A key part of the immune system's role is to differentiate between invaders and the body's own cells - when it fails to make this distinction, a reaction against 'self' cells and molecules causes autoimmune disease.[11]\n\nWhen the immune system is lacking one or more of its components, the result is an immunodeficiency disorder. These disorders can be inherited, acquired through infection, or produced as an inadvertent side effect of drugs such as those used to treat cancer or transplant patients.\n\nAIDS is an immunodeficiency disorder caused by a virus that destroys helper T cells. The virus copies itself incessantly and invades helper T cells and macrophages, the very cells needed to organize an immune defense. The AIDS virus splices its DNA into the DNA of the cell it infects; the cell is thereafter directed to churn out new viruses.[13]\n\nA lack of immune system cells is also the basis for DiGeorge syndrome: improper development of the thymus gland means that T cell production is diminished.[11]\n• None 3-D X-ray crystallographic image showing the broadly neutralizing antibody b12 (green ribbon) in contact with a critical target (yellow) for vaccine developers on HIV-1 gp120 (red). Credit: NIAID\n• None Transmission electron microscope image of a thin section cut through a human leukocyte (white blood cell) of the type Eosinophil. Eosinophils contain eosinophil granules that are large (0.1-1.0micron) spherical, membrane-bound structures, containing a dense and lamellated crystalloid core.\n• by the the National Cancer Institute Understanding Cancer Series: The Immune System (Slide 1) by the the National Cancer Institute\n• Purves, et. al. Life: The Science of Biology. 2004. Sinauer Associates, Inc. W.H. Freeman and Company, p370.\n• Mandal, Ananya. What are Cytokines? News Medical. 2 December 2013. Accessed 25 May 2016.\n• by the the National Cancer Institute Understanding Cancer Series: The Immune System (Slide 13) by the the National Cancer Institute\n• by the the National Cancer Institute (Slide 26) by the the National Cancer Institute\n• Genes and Disease by the National Library of Medicine (NLM). Diseases of the Immune System Genes and Disease by the National Library of Medicine (NLM).\n• by the the National Cancer Institute Understanding Cancer Series: The Immune System (Slide 27) by the the National Cancer Institute\n• by the the National Cancer Institute Understanding Cancer Series: The Immune System (Slide 29) by the the National Cancer Institute", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/File:Immune_system_organs.jpg", "/File:Immune_system_organs.jpg", "/White_blood_cells", "/Bacteria", "/Streptococci", "/Fungi", "/Parasites", "/Malaria", "/Viruses", "#cite_note-cancer1-1", "/Antibodies", "#cite_note-2", "#Innate_response", "#Humoral_response", "#B_Cells", "#Antibodies", "#Immunity", "#Cellular_response", "#T_Cells", "#Cytotoxic_T_Cells", "#Helper_T_Cells", "#Self_Recognition", "#Antibody_Diversity", "#Disease", "#Allergies", "#Autoimmunity", "#Immunodeficiency", "#Immunity_system_diseases", "#Gallery", "#References", "#cite_note-3", "/File:Helper_T_Cell.jpg", "/File:Helper_T_Cell.jpg", "/B_lymphocyte", "/T_lymphocytes", "#cite_note-4", "/Antigen", "/File:Immunoglobulin_G_Antibody.jpg", "/File:Immunoglobulin_G_Antibody.jpg", "/Antibodies", "/Bacterium", "/Toxin", "/Antibodies", "#cite_note-5", "/Vaccinations", "/Protein", "/Pathogens", "/Disease", "#cite_note-6", "/File:T_cell.jpg", "/File:T_cell.jpg", "#cite_note-cancer13-7", "#cite_note-cancer13-7", "#cite_note-8", "#cite_note-9", "#cite_note-cancer26-10", "/Virus", "/Bacterium", "/Fungus", "/Parasite", "/Enzyme", "/Cells", "#cite_note-nlm-11", "/index.php?title=Allergy&action=edit&redlink=1", "/Pollen", "#cite_note-cancer26-10", "/Autoimmune_attack", "#cite_note-nlm-11", "/Antibodies", "/Diabetes", "/Rheumatoid_arthritis", "#cite_note-cancer27-12", "/Asthma", "/Crohn%27s_disease", "/Diabetes", "#cite_note-nlm-11", "/AIDS", "/AIDS", "/Virus", "#cite_note-cancer29-13", "/index.php?title=DiGeorge_syndrome&action=edit&redlink=1", "#cite_note-nlm-11", "/Arthritis", "/Celiac_disease", "/Chronic_granulomatous_disease", "/Crohn%27s_disease", "/Diabetes", "/Leukemia", "/Lupus", "/Multiple_sclerosis", "/Psoriasis", "/Sarcoidosis", "/Template:Immune_disease", "/File:Antibody_with_HIV.jpg", "/File:White_blood_cell_TEM.jpg", "/Transmission_electron_microscope", "#cite_ref-cancer1_1-0", "http://www.cancer.gov/cancertopics/understandingcancer/immunesystem/Slide1", "#cite_ref-2", "#cite_ref-3", "http://www.news-medical.net/health/What-are-Cytokines.aspx", "#cite_ref-4", "/Special:BookSources/1555812465", "#cite_ref-5", "http://en.wikipedia.org/wiki/Passive_immunity", "#cite_ref-6", "http://en.wikipedia.org/wiki/Immunity_(medical)", "#cite_ref-cancer13_7-0", "#cite_ref-cancer13_7-1", "http://www.cancer.gov/cancertopics/understandingcancer/immunesystem/Slide13", "#cite_ref-8", "http://en.wikipedia.org/wiki/Cytotoxic_T_cell", "#cite_ref-9", "http://users.rcn.com/jkimball.ma.ultranet/BiologyPages/T/Th1_Th2.html", "#cite_ref-cancer26_10-0", "#cite_ref-cancer26_10-1", "http://www.cancer.gov/cancertopics/understandingcancer/immunesystem/Slide26", "#cite_ref-nlm_11-0", "#cite_ref-nlm_11-1", "#cite_ref-nlm_11-2", "#cite_ref-nlm_11-3", "http://www.ncbi.nlm.nih.gov/books/bv.fcgi?call=bv.View..ShowSection&rid=gnd.chapter.51", "#cite_ref-cancer27_12-0", "http://www.cancer.gov/cancertopics/understandingcancer/immunesystem/Slide27", "#cite_ref-cancer29_13-0", "http://www.cancer.gov/cancertopics/understandingcancer/immunesystem/Slide29", "http://www.cancerhelp.org.uk/help/default.asp?page=118", "http://users.rcn.com/jkimball.ma.ultranet/BiologyPages/B/B_and_Tcells.html", "/Template:Human_navbox", "/Template_talk:Human_navbox", "https://www.creationwiki.org/index.php?title=Template:Human_navbox&action=edit", "/Human_biology", "/Human_body", "/Appendix", "/Axial_skeleton", "/Blood", "/Human_brain", "/Cochlea", "/Colon", "/Embryo", "/Human_eye", "/Fetus", "/Heart", "/Kidney", "/Liver", "/Lobes_of_the_brain", "/Lung", "/Mouth", "/Neuron", "/Pancreas", "/Skull", "/Skeletal_muscle", "/Small_intestine", "/Spleen", "/Thyroid", "/Tissue", "/Tonsil", "/Vertebral_column", "/File:9weeks.jpg", "/Biological_system", "/Auditory_system", "/Circulatory_system", "/Digestive_system", "/Endocrine_system", "/Integumentary_system", "/Limbic_system", "/Lymphatic_system", "/Muscular_system", "/Nervous_system", "/Olfactory_system", "/Reproductive_system", "/Respiratory_system", "/Sensory_system", "/Human_skeleton", "/Visual_system", "/Medical_science", "/Abortion", "/Acupuncture", "/Anatomy", "/Anesthesiology", "/Chiropractor", "/Dentist", "/Dermatology", "/Disease", "/Epidemiology", "/Fat_reduction_procedures", "/Heart_surgery", "/Homeopathic_medicine", "/Coroner", "/Nursing", "/Obstetrician", "/Occupational_therapy", "/Pediatrician", "/Pharmacology", "/Physical_therapist", "/Physician", "/Physiology", "/Plastic_surgery", "/Radiology", "/Sports_medicine", "/Vision_correction_procedures", "/Anthropology", "/Antediluvian_civilizations", "/Human_longevity", "/Decline_of_humanity", "/DNA_and_Babel", "/Homo_erectus", "/Neanderthal", "/Paleoanthropology", "/Human_migration", "/Human_races", "/Anthropology_quotes", "/File:Creationwiki_portals.png", "/Category:Biology", "/Portal:Biology", "/File:Creationwiki_portals.png", "/Template:Biology_navbox", "/Template_talk:Biology_navbox", "https://www.creationwiki.org/index.php?title=Template:Biology_navbox&action=edit", "/Biology", "/Organisms", "/Animal", "/Algae", "/Amphibian", "/Bacteria", "/Bird", "/Created_kind", "/Crustaceans", "/Dinosaur", "/Fish", "/Fungi", "/Human", "/Insect", "/Mollusk", "/Plant", "/Protist", "/Reptiles", "/File:Animal_diversity.jpg", "/Biological_scientist", "/Agriculture", "/Anatomy", "/Baraminology", "/Biologist", "/Biotechnology", "/Botany", "/Cell_biology", "/Ecology", "/Epidemiology", "/Embryology", "/Entomology", "/Biological_evolution", "/Genetics", "/Herpetology", "/Human_biology", "/Medicine", "/Microscopy", "/Physiology", "/Taxonomy", "/Virology", "/Zoology", "/Biological_system", "/Auditory_system", "/Circulatory_system", "/Digestive_system", "/Endocrine_system", "/Integumentary_system", "/Limbic_system", "/Lymphatic_system", "/Muscular_system", "/Nervous_system", "/Olfactory_system", "/Reproductive_system", "/Respiratory_system", "/Sensory_system", "/Skeletal_system", "/Visual_system", "/Biological_process", "/Aging", "/Cell_division", "/Cellular_respiration", "/Disease", "/Embryogenesis", "/Gene_expression", "/Metabolism", "/Metamorphosis", "/Parasitism", "/Photosynthesis", "/Pregnancy", "/Protein_synthesis", "/Reproduction", "/Symbiosis", "/Trophic_level", "/File:Creationwiki_portals.png", "/Category:Biology", "/Portal:Biology", "/Biology_news_archive", "/File:Creationwiki_portals.png"], "authors": [], "publish_date": null}