{"result_id": "084005", "URL": "https://creationwiki.org/Tetanus", "timestamp": "2023-04-25 14:51:48 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://creationwiki.org/Tetanus", "encoding": "UTF-8"}, "image": null, "domain": "creationwiki.org", "title": "Tetanus - CreationWiki, the encyclopedia of creation science", "cleaned_text": "From CreationWiki, the encyclopedia of creation science\n\nTetanus is an infectious disease caused by the bacterium Clostridium tetani, which results in painful symptoms that can be fatal to its victims. Previously, this infection was nearly a death sentence, but in modern times vaccinations are available and we know what measures to take to prevent its spread and manifestation. Although treatment and immunization is easily accessible in most areas around the world, in a number of third-world countries death from tetanus is more common due to a lack of supplies. The Center for Disease Control and the World Health Organization are making efforts to eradicate the disease from all areas over the globe. [1]\n\nTetanus is a severe disease that often results in death. It is distinguished by a rigidity of the skeletal muscles. Erratic and intermittent spasms of the skeletal muscles often follow. Symptoms will emerge around ten days after the man, woman, or child is infected. Yet, this is not always the case, for in some, symptoms will become apparent after a general period of four days to three weeks. In fact, months can pass before symptoms indicative of tetanus can be observed. Commonly, the closer the site of infection is located to the CNS (central nervous system), the shorter the incubation period will last. During the incubation period the tetanus bacterium will fester and grow within the infected patient. Those with lengthier periods of incubation will frequently experience more moderate symptoms. [2]\n\nWhen a patient is first diagnosed with tetanus, his or her jaw muscles are in a state of unusual stiffness which can lead to spasms. This tension will spread to the neck area, locking up the vertebrae and twisting the head into painful positions. In most cases, constraint will first form in these areas and spread out to more generalized places within the body. Complications with swallowing will soon follow, for the muscles required for deglutition are often stiff as well. This can also result in breathing difficulties. Soon after, the infected patient will experience rigidity in the abdominal area. Once this occurs, uncomfortable and often hurtful contortions will take place. The rigidity of the skeletal muscles in these localized areas will spread to other areas of the body, causing the limbs to tense and spasm. These convulsions are not a consistent, unending sensation; rather, they are prompted by slight sensory cues. Anything from a bright light, a gust of air, a sudden noise, or a comforting touch can trigger these spasms. [3]\n\nSymptoms following the infection of the Clostridium tetani bacterium manifest themselves in additional ways, such as in the form of a fever and sweating. The infected patient will experience a rising blood pressure and an abnormally quick heart rate. [4] Other symptoms include diarrhea, bloody feces, headaches or migraines, sore throats, and sensitivity to touch, sound, and light. [5] These are early onset symptoms that are not specifically indicative of tetanus, but rigidity and spasms will soon follow.\n\nIt is highly recommended for children to get vaccinated early in life. This is the most efficient method for the immunization and prevention of tetanus. Although the U.S. Centers for Disease Control and Prevention suggests getting booster shots every ten years, the first vaccination should take place at two months of age. After the first shot, the child should receive four more DTap vaccinations over the course of the next five years. Once the child is eleven years old, regular booster shots are suggested as the next course of action. [6]\n\nTetanus vaccinations come in four variations: Td, Dtap, Tdap, and DT. Children commonly receive the DTaP as their first dose. This serves as a vaccination against diphtheria and pertussis, also known as whopping cough. For those who are unable to withstand the pertussis bacteria, DT can serve as a replacement. Td is used for the booster that is administered every ten years to adolescents and adults. It is recommended for those who are older than eighteen or those from ages eleven to twelve to receive one Tdap vaccination in order to have protection from pertussis. Pregnant women should also receive Tdap during their third trimester. [7]\n\nAdditional preventative measures can also be taken besides getting vaccinated. A newborn baby should receive proper nourishment and good hygiene so as to keep the child as strong as possible during the most vulnerable stage of his or her life. Cleanliness should be a top priority during the birthing process, and the umbilical cord must be removed by via sterile methods. [8] One must always exercise caution to avoid receiving open wounds. Tetanus bacteria most likely will infect if it comes into contact below the surface-level skin. If a person is to become afflicted with a deep or open wound, they must quickly clean the area and seek out proper treatment.[9]\n\nTetanus will result after a person is infected with Clostridium tetani bacterium. Infection usually takes place in a wounded area, such as the location of a deep laceration, an animal bite, a puncture wound, circumcision, sharing needles, a separate infection, a burn, surgical wounds, etc. Clostridium tetani thrives in warm areas with little oxygen, so the deeper the wound the more likely that the infection will fester.[10]\n\nWhen the bacterium is first introduced to the body, it reproduces as quickly as it can. Cleaning the wounded area can help prevent the infection from spreading, for as soon as it enters the bloodstream Clostridium tetani will disperse throughout the body. As the Clostridium tetani multiplies it will secrete tetanospasmin. This is a poisonous substance that affects the brain and spinal cord. Tetanospasmin obstructs and manipulates signals sent from the brain to areas of the body, stiffening the skeletal muscle and causing rigidity.[11]\n\nTetanus has been well known to mankind for centuries. Although they're unconfirmed, there are records of people experiencing symptoms very similar to tetanus dating back to the 5th century B.C. Only in more recent times have any developments been made in the identification and prevention of the disease, however. In 1884, two scientists named Rattone and Carle extracted pus from a human wound infected with tetanus bacteria and inserted it into animals. By doing so, they were able to successfully observe how the disease spread, festered, and manifested itself in different victims. Five years later a man named Nicolaier followed Rattone and Carle's approach and injected animals with soil. This soil was found to have C. tetani within it. By then breakthroughs were underway; by 1897 soldiers in World War I were being treated with antitoxins in order to be passively immunized. By the Second World War Descombey had synthesized a tetanus toxoid that aided the prevention and treatment of tetanus. [12]\n\nAn informative video concerning the prevention of tetanus.", "opengraph": {}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe width=\"560\" height=\"315\" src=\"//www.youtube.com/embed/jPUQakhyPDA\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "//www.youtube.com/embed/jPUQakhyPDA"}], "links": ["/File:Tenanus_Bacilli.JPG", "/File:Tenanus_Bacilli.JPG", "/Symptoms", "/Vaccinations", "/Disease", "#cite_note-1", "#Symptoms", "#Treatment_and_Prevention", "#Cause", "#History", "#Video", "#References", "#Other_Bacterial_Diseases", "/File:Body_Rigidity_in_a_baby.jpg", "/File:Body_Rigidity_in_a_baby.jpg", "/Central_nervous_system", "#cite_note-2", "/Muscles", "/Vertebrae", "/Body", "#cite_note-3", "/index.php?title=Fever&action=edit&redlink=1", "/Blood_pressure", "#cite_note-4", "#cite_note-5", "/File:Pygmy_woman_receives_tetanus_shot.JPG", "/File:Pygmy_woman_receives_tetanus_shot.JPG", "/Vaccination", "/index.php?title=Child&action=edit&redlink=1", "#cite_note-6", "/Vaccinations", "/index.php?title=Diphtheria&action=edit&redlink=1", "/Pertussis", "#cite_note-7", "/index.php?title=Umbilical_cord&action=edit&redlink=1", "#cite_note-8", "#cite_note-9", "/File:13313828043_15f1eb1c1b_n.jpg", "/File:13313828043_15f1eb1c1b_n.jpg", "/index.php?title=Circumcision&action=edit&redlink=1", "#cite_note-10", "/index.php?title=Tetanospasmin&action=edit&redlink=1", "#cite_note-11", "/index.php?title=Immunized&action=edit&redlink=1", "#cite_note-12", "#cite_ref-1", "http://www.cdc.gov/vaccines/pubs/surv-manual/chpt16-tetanus.html", "#cite_ref-2", "http://www.medicalnewstoday.com/articles/163063.php", "#cite_ref-3", "http://www.cdc.gov/vaccines/pubs/pinkbook/downloads/tetanus.pdf", "#cite_ref-4", "http://www.mayoclinic.org/diseases-conditions/tetanus/basics/symptoms/con-20021956", "#cite_ref-5", "http://www.medicalnewstoday.com/articles/163063.php", "#cite_ref-6", "http://www.medicinenet.com/tetanus/page3.htm#what_is_passive_immunization_by_way_of_specialized_immunoglobulin", "#cite_ref-7", "http://www.cdc.gov/vaccines/vpd-vac/tetanus/default.htm", "#cite_ref-8", "http://www.emedicinehealth.com/tetanus/page7_em.htm#medical_treatment_for_tetanus", "#cite_ref-9", "http://www.medicinenet.com/tetanus/page3.htm#what_is_passive_immunization_by_way_of_specialized_immunoglobulin", "#cite_ref-10", "http://www.medicalnewstoday.com/articles/163063.php", "#cite_ref-11", "http://www.medicalnewstoday.com/articles/163063.php", "#cite_ref-12", "http://www.austincc.edu/microbio/2421b/tet.htm", "/Cellulitis", "/Cholera", "/Leprosy", "/Rocky_mountain_spotted_fever", "/Template:Bacterial_disease", "/Template:Human_navbox", "/Template_talk:Human_navbox", "https://creationwiki.org/index.php?title=Template:Human_navbox&action=edit", "/Human_biology", "/Human_body", "/Appendix", "/Axial_skeleton", "/Blood", "/Human_brain", "/Cochlea", "/Colon", "/Embryo", "/Human_eye", "/Fetus", "/Heart", "/Kidney", "/Liver", "/Lobes_of_the_brain", "/Lung", "/Mouth", "/Neuron", "/Pancreas", "/Skull", "/Skeletal_muscle", "/Small_intestine", "/Spleen", "/Thyroid", "/Tissue", "/Tonsil", "/Vertebral_column", "/File:9weeks.jpg", "/Biological_system", "/Auditory_system", "/Circulatory_system", "/Digestive_system", "/Endocrine_system", "/Immune_system", "/Integumentary_system", "/Limbic_system", "/Lymphatic_system", "/Muscular_system", "/Nervous_system", "/Olfactory_system", "/Reproductive_system", "/Respiratory_system", "/Sensory_system", "/Human_skeleton", "/Visual_system", "/Medical_science", "/Abortion", "/Acupuncture", "/Anatomy", "/Anesthesiology", "/Chiropractor", "/Dentist", "/Dermatology", "/Disease", "/Epidemiology", "/Fat_reduction_procedures", "/Heart_surgery", "/Homeopathic_medicine", "/Coroner", "/Nursing", "/Obstetrician", "/Occupational_therapy", "/Pediatrician", "/Pharmacology", "/Physical_therapist", "/Physician", "/Physiology", "/Plastic_surgery", "/Radiology", "/Sports_medicine", "/Vision_correction_procedures", "/Anthropology", "/Antediluvian_civilizations", "/Human_longevity", "/Decline_of_humanity", "/DNA_and_Babel", "/Homo_erectus", "/Neanderthal", "/Paleoanthropology", "/Human_migration", "/Human_races", "/Anthropology_quotes", "/File:Creationwiki_portals.png", "/Category:Biology", "/Portal:Biology", "/File:Creationwiki_portals.png"], "authors": [], "publish_date": null}