{"result_id": "084033", "URL": "https://creationwiki.org/Human_immunodeficiency_virus", "timestamp": "2023-04-25 14:52:31 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://creationwiki.org/Human_immunodeficiency_virus", "encoding": "UTF-8"}, "image": null, "domain": "creationwiki.org", "title": "Human immunodeficiency virus - CreationWiki, the encyclopedia of creation science", "cleaned_text": "From CreationWiki, the encyclopedia of creation science\n\nThe human immunodeficiency virus (HIV) is generally believed to cause AIDS (Acquired Immune Deficiency Syndrome). HIV infects cells in the human immune system such as helper T-cells and macrophages. As a result, the immune system of the infected person becomes deficient and death is usually the result of bacterial or viral pathogens.\n\nThe number of infected individuals is currently estimated at 43,000,000 worldwide. In 2001, 5,000,000 people were infected with HIV and 3,000,000 people died.\n\nTo determine the origin of HIV, we must start in the 1930s in Africa. The SIV (Simian Immunodeficiency Virus) had mutated to HIV. Originally, the SIV was only found in anthropoids such as chimpanzees until the 1930s. There were a few people infected in 1930s, but medical personnel didn't worry about this disease at that time. Since that time, through the growing transportation network and indiscretion of sexual contact, HIV easily spread throughout the world. In 1981, the first patient with AIDS was reported to United States medical journals. Following this, in 1983, Luc Montagnier found HIV for the first time in a laboratory. At first, the terms used for HIV were different in each country. In France, they had referred to HIV as LAV, while the United States used HTLV-III or ARV. But after a few years, researchers in both countries realized that those viruses were the same as HIV, so they integrated the terms for HIV.\n\nIn the United States, over 900,000 people infected by HIV have been reported since 1981. The incubation period of HIV is up to 10 years. Additionally, 50% of patients die in less than 10 years after the disease is established and the other 50% of patients survived over 10 years. There are many ways that you can get HIV.\n• Having sex with same gender.\n• If an infected mother becomes pregnant, the baby can become infected, too.\n\nMany infected people don't know they have the virus until 10 years from the time they got infected. Sometimes, the incubation period is short, only a month. Initial symptoms include fevers, chills, diarrhea, and weight loss. It seems the same as a cold and the HIV-infected person looks like a totally normal healthy individual.\n\nThere is no cure for AIDS so far. The only two ways to treat AIDS are to treat the complications caused AIDS or to slow down the reproduction of the HIV in cells, but this neither cures the disease nor indicates how to prevent it with a vaccine. Many scientists over the world are researching to find an effective cure. Many treatments exist, but no cure or vaccine has made it to the commercial scale yet.\n\nA number of scientists have challenged the hypothesis that HIV causes -- most notably, Dr. Peter Duesberg, professor of Molecular and Cell biology at Berkeley. He argues instead that AIDS is caused by chronic recreational drug use, antiviral drug therapy, and malnutrition. In his 2003 paper[1], he supported his assertion with the following evidence:\n• AIDS is simply a chronically suppressed immune system, and the immune system can be suppressed in a number of ways, including chronic recreational drug use, malnutrition, and antiviral drug therapy;\n• Of the 34.3M people in the world with HIV, only 1.4% contracted AIDS in 2000;\n• One study reported 4,621 cases of AIDS without HIV;\n• 100% of the AIDS patients diagnosed as of 1983 were chronic drug users; 96% used Nitrate inhalants as an aphrodisiac.\n• Since 1987, the prescription of antiviral therapies has been widespread among anyone found to have HIV antibodies in their system. Antiviral therapies work by suppressing the replication of genetic material -- as such, they also suppress the replication of genetic material in the human body, and are known to directly suppress the immune system;\n• A 1994 British Concorde study concluded that the AIDS drug AZT did absolutely nothing to prevent AIDS, and increased mortality in patients by 25%;\n• Even in advanced HIV cases, less than 1/500 of the body's T-Cells are infected by HIV;\n• Viral infections are most infective prior to an immune response to suppress the virus. However, HIV tests test for the antibody response to HIV, which demonstrates that the body has already immunized itself. The virus itself cannot be directly isolated;\n• HIV infection in the US was constant at 1M from 1985 until the writing of the article. AIDS increased from 1981 to 1992 and has declined since.\n• If viral, AIDS should spread randomly throughout the population -- but AIDS in the West remains confined almost entirely to homosexuals and drug users;\n• Under the Bangui definition of AIDS, applied only in Africa, a person is diagnosed with AIDS if they have diarrhea, lethargy over a month, weight loss of 10%, and a cough. HIV is not required for an AIDS diagnosis. Malnutrition and poverty conditions are known to have the same effects.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/File:HIV-1_SEM.jpg", "/index.php?title=Group_VI&action=edit&redlink=1", "/index.php?title=Retroviridae&action=edit&redlink=1", "/index.php?title=Lentivirus&action=edit&redlink=1", "/File:HIV_prevalence.png", "/AIDS", "/Immune_system", "/index.php?title=Macrophages&action=edit&redlink=1", "#Origin", "#Infection", "#AIDS", "#Symptoms", "#Treatment", "#Challenges_to_the_HIV.2FAIDS_hypothesis", "#References", "#See_Also", "/File:Chimpanzee.jpg", "/File:Chimpanzee.jpg", "/index.php?title=Incubation_period&action=edit&redlink=1", "/Pregnant", "/File:418px-Symptoms_of_AIDS_svg.png", "/File:418px-Symptoms_of_AIDS_svg.png", "/index.php?title=Fever&action=edit&redlink=1", "/Diarrhea", "#cite_note-1", "/Antibody", "/Homosexual", "/Bangui_definition", "/Africa", "/index.php?title=Malnutrition&action=edit&redlink=1", "/File:Creationwiki_biology_portal.png", "/Portal:Biology", "http://www.hiv.com/", "http://www.avert.org/origins.htm", "#cite_ref-1", "http://www.duesberg.com/papers/chemical-bases.html", "/Microbiology", "/Virology", "/Infectious_disease", "/Template:Biology_navbox", "/Template_talk:Biology_navbox", "https://creationwiki.org/index.php?title=Template:Biology_navbox&action=edit", "/Biology", "/Organisms", "/Animal", "/Algae", "/Amphibian", "/Bacteria", "/Bird", "/Created_kind", "/Crustaceans", "/Dinosaur", "/Fish", "/Fungi", "/Human", "/Insect", "/Mollusk", "/Plant", "/Protist", "/Reptiles", "/File:Animal_diversity.jpg", "/Biological_scientist", "/Agriculture", "/Anatomy", "/Baraminology", "/Biologist", "/Biotechnology", "/Botany", "/Cell_biology", "/Ecology", "/Epidemiology", "/Embryology", "/Entomology", "/Biological_evolution", "/Genetics", "/Herpetology", "/Human_biology", "/Medicine", "/Microscopy", "/Physiology", "/Taxonomy", "/Virology", "/Zoology", "/Biological_system", "/Auditory_system", "/Circulatory_system", "/Digestive_system", "/Endocrine_system", "/Immune_system", "/Integumentary_system", "/Limbic_system", "/Lymphatic_system", "/Muscular_system", "/Nervous_system", "/Olfactory_system", "/Reproductive_system", "/Respiratory_system", "/Sensory_system", "/Skeletal_system", "/Visual_system", "/Biological_process", "/Aging", "/Cell_division", "/Cellular_respiration", "/Disease", "/Embryogenesis", "/Gene_expression", "/Metabolism", "/Metamorphosis", "/Parasitism", "/Photosynthesis", "/Pregnancy", "/Protein_synthesis", "/Reproduction", "/Symbiosis", "/Trophic_level", "/File:Creationwiki_portals.png", "/Category:Biology", "/Portal:Biology", "/Biology_news_archive", "/File:Creationwiki_portals.png"], "authors": [], "publish_date": null}