{"result_id": "084043", "URL": "http://www.creationwiki.org/Hemophilia", "timestamp": "2023-04-25 14:52:47 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "http://www.creationwiki.org/Hemophilia", "encoding": "UTF-8"}, "image": null, "domain": "www.creationwiki.org", "title": "Hemophilia - CreationWiki, the encyclopedia of creation science", "cleaned_text": "From CreationWiki, the encyclopedia of creation science\n\nHemophilia is a blood clotting disorder in which a person's blood has a low level of or completely lacks the clotting factor. Although a woman generally cannot inherit this disease, if she is a carrier, she may still experience low levels of the clotting factor, and also have minor bleeding problems. However, a man will have the genetic mutation on his only X chromosome. He does not have another X chromosome to compensate for the defect so he will have hemophilia. [1] Currently, there is no cure for hemophilia, but there are treatments that can be administered to control the symptoms.[2]\n\nHemophilia is a circulatory disorder that inhibits the clotting process of blood. Prolonged bleeding because of hemophilia can begin from a variety of sources. For someone suffering from hemophilia, anything from a pulled tooth surgeries and injuries can cause bleeding that takes quite a long time to stop. In severe cases of hemophilia, bleeding occurs after even minor trauma, or even without the presence of an injury, demonstrating spontaneous bleeding.[3] Bleeding can occur anywhere in the individual’s body. However, common areas that experience bleeding include joints (Hemarthrosis), muscles and their gastrointestinal tract. Other areas that are prone to bleeding are the mouth, nose, urinary tract, and the brain and skull (Intracranial Hemorage).Long-term injury to joints is characteristic because of the repeated episodes of bleeding. [4] Emergency warnings of internal bleeding with hemophiliacs include sudden pain and swelling in joints, a painful and prolonged headache, severe fatigue, vomiting, pain in the neck, or double vision. Early warning signs for diagnosing hemophilia are bleeding after a vaccination shot, pain or swelling in their joints, and in babies, unexplained irritability.[5]\n\nThe severity of hemophilia varies among those who suffer from the disease. The main factor determining the severity is the specific type of mutation. The affected clotting factor level decides the degree of the symptoms. If the factor activity is greater that 5%, it is considered a mild case, while 1%-5% is considered moderate and less than 1% is considered severe. The severity determines the amount of bleeding the individual suffers. Mild hemophiliacs will only bleed in excess after severe trauma or injury. In severe hemophilia (both type A and type B), the bleeding begins at a young age and can occur spontaneously. For these severe cases, bleeding tends to develop within the first two years, with heavy bleeding following circumcision acting as the first indication of the disease. For those with moderate or mild forms, their symptoms might not develop until later.[4] These milder forms do not always deal with spontaneous bleeding, and the hemophiliacs in question might not even be aware of their condition until they develop prolonged bleeding following a surgery or bad injury. [3]In both hemophilia A and B, the amount of bleeding remains the same.[4] Both forms have similar signs and symptoms. However, hemophilia B has an unusual form that can develop, called hemophilia B Leyden, in which the person will deal with symptoms as a child, but will not face more than a few bleeding problems after they have undergone puberty.[3]\n\nCurrently, there is no cure for hemophilia, but there are treatments available. [2] The foremost form of treatment for hemophilia is replacement therapy. [6] This involves replacing the missing clotting factor in the blood, allowing the blood to clot properly.[7] In this replacement therapy, concentrates of either clotting factor VII or clotting factor IX (for hemophilia A and B, respectively) are dripped or injected into the bloodstream. [6] People can learn to give themselves these infusions, meaning that they can stop bleeding episodes and even prevent other episodes from occurring if they perform the infusions regularly. [7] There are complications from replacement therapy, however. The individual could develop antibodies to attack the clotting factor, develop viral infections, or damage their joints or muscles because they delay their treatment.[6]\n\nThere are two forms of clotting factors used, Plasma-Derived and Recombinant Factor. The plasma-derived factor concentrate is made from human blood. The blood donated is screened extensively and the sterilization procedures used to eradicate viruses and contaminants are extreme. [8] The risk of catching an infectious disease is very small.[6] Recombinant Factor concentrates are derived from hamster cells. The hamster cells are injected with the factor gene desired, resulting in large amounts being produced. The resulting factor concentrate is either stabilized with human albumin or sucrose. With either form of concentrate, the frequency of treatment is determined by the severity of the disease. The two forms of treatment schedules are prophylaxis and on demand. Prophylaxis patients infuse the concentrate on a schedule in order to prevent bleeds. It is suggested for children suffering from severe hemophilia. This form is expensive, however, with an average dose requiring 25 units per 2 pounds, with each unit costing about $1. On demand is used as the need arises, like after an injury, and the cost is significantly less.[8]\n\nThe hemophilia mutation is found on the X chromosome. Because of this, it is considered an X-linked genetic disorder. There are three different possibilities in how the disease can genetically be passed to someone’s children: Affected Mother, Unaffected Father - When the mother is a carrier for hemophilia, one of her X chromosomes possesses the genetic mutation for the disease, while the other chromosome will not be mutated. Because of this unaffected chromosome, the mutated one is essentially canceled out by the other. When a mother carrier and an unaffected father have child, four possible outcomes of equal likelihood can result:\n\n3) A daughter who is a carrier for hemophilia.\n\n4) A daughter who is not a carrier for hemophilia.\n\nEach outcome is determined simply by which of the two X chromosomes they are given by their mother.[1]\n\nUnaffected Mother, Affected Father - When the father has hemophilia, and the mother is not a carrier, there are two possible outcome of the pregnancy:\n\n1) None of the sons will have hemophilia.\n\n2) All daughters are carriers of hemophilia.\n\nThis is because all the sons will receive an unaffected Y chromosome from their affected father, but an unaffected X chromosome from their mother, resulting in them receiving no mutated chromosomes. The daughters, however, will also receive an unaffected X chromosome from their non-carrier mother, but will all receive the mutated X chromosome from their affected father.[1]\n\nAffected Mother, Affected Father - The situation in which both parents are affected is quite rare. In this instance, there are once again four possibilities, depending on the chromosomes received from the parents:\n\n3) A daughter who is a carrier of hemophilia.\n\nA girl receiving hemophilia is quite rare, and only occurs genetically through this form of situation. She must receive the affected X chromosome from both parents.[1]\n\nThere is another way in which a person can have hemophilia. This is through a spontaneous genetic mutation. This situation occurs about a third of the time someone has hemophilia. the remaining two thirds result from one of the three situations listed above. This form of gene mutation can occur in either a male or female fetus. In this instance the female baby would become a carrier for hemophilia, while the male would have hemophilia.[1]", "opengraph": {}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe width=\"560\" height=\"315\" src=\"//www.youtube.com/embed/htGjPYuR9TU\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "//www.youtube.com/embed/htGjPYuR9TU"}], "links": ["/File:442px-The_Young_Queen_Victoria.jpg", "/File:442px-The_Young_Queen_Victoria.jpg", "/Blood_clotting", "#cite_note-FortheCure-1", "#cite_note-LAK-2", "#Symptoms", "#Treatment", "#Genetics.2FCauses", "#Video", "#Circulatory_Diseases", "#References", "/File:Hemophilia_hand.jpg", "/File:Hemophilia_hand.jpg", "#cite_note-GHR-3", "/Joints", "/index.php?title=Hemarthrosis&action=edit&redlink=1", "/Muscles", "/Gastrointestinal_tract", "/Mouth", "/Nose", "/index.php?title=Urinary_tract&action=edit&redlink=1", "/Brain", "/Skull", "/index.php?title=Intracranial_Hemorage&action=edit&redlink=1", "#cite_note-MedNet-4", "/index.php?title=Internal_bleeding&action=edit&redlink=1", "/Vaccination", "#cite_note-Mayo-5", "/Mutation", "/index.php?title=Circumcision&action=edit&redlink=1", "#cite_note-MedNet-4", "#cite_note-GHR-3", "#cite_note-MedNet-4", "/index.php?title=Puberty&action=edit&redlink=1", "#cite_note-GHR-3", "/File:Ryan_White.jpg", "/File:Ryan_White.jpg", "#cite_note-LAK-2", "#cite_note-NIH-6", "#cite_note-CDC-7", "#cite_note-NIH-6", "#cite_note-CDC-7", "#cite_note-NIH-6", "#cite_note-HFA-8", "#cite_note-NIH-6", "/index.php?title=Albumin&action=edit&redlink=1", "/Sucrose", "#cite_note-HFA-8", "/File:Hemophilia_genetics_chart.png", "/File:Hemophilia_genetics_chart.png", "/index.php?title=X_chromosome&action=edit&redlink=1", "/Genetic_mutation", "#cite_note-FortheCure-1", "/index.php?title=Y_chromosome&action=edit&redlink=1", "#cite_note-FortheCure-1", "#cite_note-FortheCure-1", "/Mutation", "/Fetus", "#cite_note-FortheCure-1", "/Anemia", "/Coronary_artery_disease", "/Heart_attack", "/Kawasaki_disease", "/Porphyria", "/Sickle_cell_anemia", "/Template:Cardiovascular_disease", "#cite_ref-FortheCure_1-0", "#cite_ref-FortheCure_1-1", "#cite_ref-FortheCure_1-2", "#cite_ref-FortheCure_1-3", "#cite_ref-FortheCure_1-4", "http://www.hemophilia-information.com/hemophilia-genetics.html", "#cite_ref-LAK_2-0", "#cite_ref-LAK_2-1", "http://www.kelleycom.com/faq/cure_hemophilia.html", "#cite_ref-GHR_3-0", "#cite_ref-GHR_3-1", "#cite_ref-GHR_3-2", "http://ghr.nlm.nih.gov/condition/hemophilia", "#cite_ref-MedNet_4-0", "#cite_ref-MedNet_4-1", "#cite_ref-MedNet_4-2", "http://www.medicinenet.com/hemophilia/article.htm", "#cite_ref-Mayo_5-0", "http://www.mayoclinic.org/diseases-conditions/hemophilia/basics/symptoms/con-20029824", "#cite_ref-NIH_6-0", "#cite_ref-NIH_6-1", "#cite_ref-NIH_6-2", "#cite_ref-NIH_6-3", "http://www.nhlbi.nih.gov/health/health-topics/topics/hemophilia/treatment", "#cite_ref-CDC_7-0", "#cite_ref-CDC_7-1", "http://www.cdc.gov/ncbddd/hemophilia/facts.html", "#cite_ref-HFA_8-0", "#cite_ref-HFA_8-1", "http://www.hemophiliafed.org/bleeding-disorders/hemophilia/treatment/", "/Template:Human_navbox", "/Template_talk:Human_navbox", "http://en.creationwiki.org/index.php?title=Template:Human_navbox&action=edit", "/Human_biology", "/Human_body", "/Appendix", "/Axial_skeleton", "/Blood", "/Human_brain", "/Cochlea", "/Colon", "/Embryo", "/Human_eye", "/Fetus", "/Heart", "/Kidney", "/Liver", "/Lobes_of_the_brain", "/Lung", "/Mouth", "/Neuron", "/Pancreas", "/Skull", "/Skeletal_muscle", "/Small_intestine", "/Spleen", "/Thyroid", "/Tissue", "/Tonsil", "/Vertebral_column", "/File:9weeks.jpg", "/Biological_system", "/Auditory_system", "/Circulatory_system", "/Digestive_system", "/Endocrine_system", "/Immune_system", "/Integumentary_system", "/Limbic_system", "/Lymphatic_system", "/Muscular_system", "/Nervous_system", "/Olfactory_system", "/Reproductive_system", "/Respiratory_system", "/Sensory_system", "/Human_skeleton", "/Visual_system", "/Medical_science", "/Abortion", "/Acupuncture", "/Anatomy", "/Anesthesiology", "/Chiropractor", "/Dentist", "/Dermatology", "/Disease", "/Epidemiology", "/Fat_reduction_procedures", "/Heart_surgery", "/Homeopathic_medicine", "/Coroner", "/Nursing", "/Obstetrician", "/Occupational_therapy", "/Pediatrician", "/Pharmacology", "/Physical_therapist", "/Physician", "/Physiology", "/Plastic_surgery", "/Radiology", "/Sports_medicine", "/Vision_correction_procedures", "/Anthropology", "/Antediluvian_civilizations", "/Human_longevity", "/Decline_of_humanity", "/DNA_and_Babel", "/Homo_erectus", "/Neanderthal", "/Paleoanthropology", "/Human_migration", "/Human_races", "/Anthropology_quotes", "/File:Creationwiki_portals.png", "/Category:Biology", "/Portal:Biology", "/File:Creationwiki_portals.png"], "authors": [], "publish_date": null}