{"result_id": "084016", "URL": "https://creationwiki.org/Polio_vaccine", "timestamp": "2023-04-25 14:52:05 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://creationwiki.org/Polio_vaccine", "encoding": "UTF-8"}, "image": null, "domain": "creationwiki.org", "title": "Polio vaccine - CreationWiki, the encyclopedia of creation science", "cleaned_text": "From CreationWiki, the encyclopedia of creation science\n\nThe Polio vaccine is utilized to stimulate the body to produce antibodies capable of fighting the viral disease Polio. Polio is a highly infectious disease that causes severe symptoms, and in some cases, permanent paralysis or even death. It was considered one of the most feared diseases of the 20th century, affecting over 35,000 individuals annually in the U.S. alone.[1] The two main forms of vaccines are Oral Polio Vaccine and Inactivated Polio Vaccine.[2] There is no cure for Polio, but with the help of organizations like the Global Polio Eradication Initiative, Polio has been nearly eradicated from the world.[3]\n\nPolio is a highly infectious, viral disease.[3] It is so contagious that anyone who has even been living with someone who has been infected will more than likely become infected as well.[4] It usually infects young children,[3] under the age of five,[5] but can infect anyone, at any age. This virus lives in the infected individual’s throat or intestinal tract,[1] and is only found in humans.[4] It is transmitted from person-to-person contact, through the stool of the infected individual.[1] Although not as common, contaminated food or water[3] or oral and nasal secretions (like saliva) can also spread the disease.[1] The virus multiplies in the intestines,[3] soon invading the individual’s nervous system and, in severe cases, cause total paralysis in as little as a few hours.[5] Symptoms include fever, fatigue, headaches, vomiting, and stiffness and pain in the neck and limbs.[3] It is only in a small amount of cases, about 1 in 200, that leads to permanent paralysis. Of these cases, another 5% to 10% die because their respiratory muscles become immobilized.[5] However, for most people infected with the virus, the never display symptoms, and are rarely made aware that they were ever infected in the first place.[4]\n\nThere is no cure for Polio, but can be avoided through immunization.[3] The vaccine is given multiple times over the course of an individual’s early years, and lasts the rest of their lifetime.[5] The only option for Polio survivors is treatment to lessen the resulting symptoms. Physical therapy and heat are used to help stimulate the affected muscles. As well, antispasmodic drugs can be taken to help the muscles relax. These may be able to aid in the person’s movement, but is in no way a permanent solution to their paralysis.[2] Because of the introduction of an effective vaccine, the United States is completely Polio-free.[1] The last case of Polio was in 1979.[4] However, before the vaccine existed, like in the 1940’s to early 1950’s, Polio affected an average of more than 35,000 people in the U.S. each year, and is known as one of the most feared diseases of the 1900’s.[1]\n\nIn some cases of Polio in which symptoms develop, victims will contract Non-paralytic Polio. This form, as the name implies, does not lead to paralysis of muscles. The symptoms resemble the flu, which is common in most viral illnesses. In addition, the symptoms of Polio listed previously, there is a chance of meningitis, and typically lasts anywhere from one to ten days. In the rarer cases, Paralytic Polio infects the individual, and is recognized as the most severe form of the disease. There are multiple forms of Paralytic Polio, depending on where in the body the individual is infected: the spinal cord, called Spinal Polio, the brain stem, known as Bulbar Polio, or both, called Bulbospinal Polio. These forms of Polio often mimic the symptoms of Non-paralytic Polio, but, within a week of contraction, loss of reflexes, severe muscle aches and weakness, and flaccid paralysis (loss of muscle tone in affected muscles), generally more severe on a certain side of the body, begin to develop as well. Paralytic Polio can result in permanent muscle paralysis, disability, and deformities in an individual’s hips, ankles, and feet. In addition to this, some survivors also face something called Post-Polio Syndrome around 35 years after contracting polio. This generally consists of muscle and joint weakness or pain, fatigue after small tasks, muscle atrophy, difficulty breathing or swallowing, among others, including cognitive problems and depression and mood swings.[4]\n\nThere are two main forms of vaccinations for Polio: the Inactivated Polio Vaccine (IPV), has been used in the U.S. starting from 2000, and is injected into either the leg or arm, depending on age, and the Oral Polio Vaccine (OPV), which is much more common outside the U.S. and is taken through the mouth. The vaccine can be administered alongside other vaccines, and most individuals receive the vaccine while they are children. Because of this, the majority of adults do not require the vaccine.[2]\n\nOral Polio Vaccine is a live attenuated vaccine, meaning the vaccine is made form an altered version of the virus.[6] It is also known as the “Trivalent Oral Polio Vaccine” and the “Sabin Vaccine.” OPV is a mixture of live, attenuated poliovirus strains from each of the three virus strains. OPV works by inducing the body to produce antibodies in the blood for the three strains. If an infection occurs, the antibodies inhibit paralysis by halting the spread of wild poliovirus (polio that occurs naturally[7]) into the nervous system. In addition to this, OPV also causes localized mucosal immune responses in the mucous membrane in the intestines. If an infection invades, the antibodies will impede the replication of the virus inside the intestine.[8]In many countries, OPV is the referred vaccine for combating Polio. The Global Polio Eradication Initiative favors it because it is easily administered through the mouth, its low cost, and superior ability to confer intestinal immunity in lacking individuals. In extremely rare situations, negative reactions associated with OPV, vaccine-associated paralytic poliomyelitis (VAPP), occurs in vaccinated individuals. However, it is estimated that the risk of VAPP is 1 in 2.4 million vaccines received. Outbreaks of Polio spreading the vaccine-derived form in areas of low vaccination coverage still occur.[6] In contrast, Inactivated Polio Vaccine contains a dead strain of each of the three polioviruses.[9] IPV is an intramuscular injection.[6] It is also known as the “Salk Vaccine.” IPV causes the body to produce antibodies in the blood as well. If an infection enters the body, the antibodies will stop it from reaching the central nervous system, as well as defending the body against paralysis.[9]\n\nThe main series of vaccination is three doses of OPV and at least one dose of IPV, initiated from 6 weeks and a minimum space of 4 weeks between OPV doses. If a child receives a singular dose of IPV in addition to the schedule, it should be given anytime after 14 weeks, and can be given at the same time as a dose of OPV. This is because, after this time span, the mother’s antibodies have diminished. The WHO (World Health Organization) recommends that countries who currently use solely OPV should include at least one IPV, in addition, to the vaccination schedule. A country still combating Polio, as well as countries still considered high at risk for reinfection, are encouraged by the WHO to administer a dose of OPV immediately after birth, as well as the main series of vaccinations. Different countries may deal with variations to this base schedule based on the local health patterns.[6]\n\nAs stated before, there is no cure for Polio, but there are completely safe and highly effective vaccines. Because of this, the plan to eradicate Polio is to keep children from being infected by immunizing every child until transmission of the virus ceases. If this can happen, the world will be completely Polio-free. The Global Polio Eradication Initiative (GPEI) is spearheaded by the WHO, CDC (U.S. Center for Disease Control and Prevention), the UNICEF (United Nations Children’s Fund), and Rotary International, and their singular goal is to eradicate Polio throughout the world. There are 200 countries involved in the effort, with 20 million volunteers and US$10 billion of international investments. Over 2.5 billion children have been immunized through the Initiative’s efforts, and since the founding, the amount of Polio cases has decreased worldwide by over 99%. Twenty years ago, 1,000 new children would suffer paralysis from Polio each day (around 350,000 cases annually). In 2010, only 1349 children were paralyzed around the world,[2] and only 359 cases reported in 2014.\n\nCurrently, only two countries are still fighting Polio: Pakistan and Afghanistan. This is a remarkable drop from over 125 countries in 1988. In fact, these two countries mark the smallest geographic area to be infected with Polio in history. If Polio is not eradicated from these few remaining areas, within the next ten years as many as 200,000 new cases could develop, all over the world.[5] This is because, unfortunately, Polio does not stop at geographical borders. If a child has not received the vaccination, they are at risk. Because so many infected individuals do not present symptoms, detecting Polio can be very hard to detect or to stop from transmitting to other individuals.[2] As long as even one child is infected with Polio, all children who are not immunized face the risk of contracting the disease.[5] Because of this, the only truly effective defense is to immunize children and to fully eradicate the virus itself.[2]\n\nThis video chronicles the start of when people began to pay attention to Polio, and the effects it had on those it touched.\n\nLinks to following videos in the series:", "opengraph": {}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe width=\"560\" height=\"315\" src=\"//www.youtube.com/embed/XP2iUz4JzMY\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "//www.youtube.com/embed/XP2iUz4JzMY"}], "links": ["/File:Micrograph_of_Poliovirus.PNG", "/File:Micrograph_of_Poliovirus.PNG", "/Polio", "#cite_note-Vaccines-1", "#cite_note-Eradication-2", "#cite_note-WHO-3", "#Polio_Disease", "#Types_of_Vaccines", "#The_Global_Polio_Eradication_Initiative", "#Video", "#Viral_Diseases", "#References", "/Poliomyelitis", "/File:Girl_with_leg_deformity_from_Polio.jpg", "/File:Girl_with_leg_deformity_from_Polio.jpg", "/Polio", "/index.php?title=Infectious&action=edit&redlink=1", "/Viral_disease", "#cite_note-WHO-3", "#cite_note-MAYO-4", "#cite_note-WHO-3", "#cite_note-Fact-Sheet-5", "#cite_note-Vaccines-1", "#cite_note-MAYO-4", "#cite_note-Vaccines-1", "#cite_note-WHO-3", "#cite_note-Vaccines-1", "#cite_note-WHO-3", "#cite_note-Fact-Sheet-5", "#cite_note-WHO-3", "/Respiratory", "#cite_note-Fact-Sheet-5", "#cite_note-MAYO-4", "/index.php?title=Immunization&action=edit&redlink=1", "#cite_note-WHO-3", "#cite_note-Fact-Sheet-5", "/Physical_therapy", "/index.php?title=Antispasmodic&action=edit&redlink=1", "#cite_note-Eradication-2", "/United_States", "#cite_note-Vaccines-1", "#cite_note-MAYO-4", "#cite_note-Vaccines-1", "/Flu", "/index.php?title=Meningitis&action=edit&redlink=1", "/Spinal_cord", "/index.php?title=Brain_stem&action=edit&redlink=1", "/index.php?title=Flaccid_paralysis&action=edit&redlink=1", "/index.php?title=Muscle_atrophy&action=edit&redlink=1", "#cite_note-MAYO-4", "/File:Somali_boy_receives_a_polio_vaccination.jpg", "/File:Somali_boy_receives_a_polio_vaccination.jpg", "/Vaccinations", "#cite_note-Eradication-2", "/index.php?title=Live_attenuated&action=edit&redlink=1", "#cite_note-Poliomyelitis-6", "/index.php?title=Poliovirus&action=edit&redlink=1", "/Antibodies", "#cite_note-virus-7", "/Nervous_system", "#cite_note-OPV-8", "#cite_note-Poliomyelitis-6", "#cite_note-IPV-9", "/index.php?title=Intramuscular&action=edit&redlink=1", "#cite_note-Poliomyelitis-6", "#cite_note-IPV-9", "#cite_note-Poliomyelitis-6", "/File:Polio_vaccine_poster.jpg", "/File:Polio_vaccine_poster.jpg", "/index.php?title=Immunizing&action=edit&redlink=1", "/index.php?title=WHO&action=edit&redlink=1", "/index.php?title=CDC&action=edit&redlink=1", "/index.php?title=UNICEF&action=edit&redlink=1", "#cite_note-Eradication-2", "/Pakistan", "/Afghanistan", "#cite_note-Fact-Sheet-5", "#cite_note-Eradication-2", "#cite_note-Fact-Sheet-5", "#cite_note-Eradication-2", "https://www.youtube.com/watch?v=FjIgaswKh60", "https://www.youtube.com/watch?v=wegY13xbdi0", "https://www.youtube.com/watch?v=eTSM7daxnxs", "/AIDS", "/Avian_influenza", "/Chickenpox", "/Ebola", "/Gastroenteritis", "/Hepatitis_B", "/Hepatitis_C", "/Human_papillomavirus", "/Infectious_mononucleosis", "/Influenza", "/Measels", "/Mumps", "/Poliomyelitis", "/Smallpox", "/Swine_influenza", "/Rabies", "/Yellow_fever", "/Template:Viral_disease", "#cite_ref-Vaccines_1-0", "#cite_ref-Vaccines_1-1", "#cite_ref-Vaccines_1-2", "#cite_ref-Vaccines_1-3", "#cite_ref-Vaccines_1-4", "#cite_ref-Vaccines_1-5", "http://www.vaccines.gov/diseases/polio/index.html#", "#cite_ref-Eradication_2-0", "#cite_ref-Eradication_2-1", "#cite_ref-Eradication_2-2", "#cite_ref-Eradication_2-3", "#cite_ref-Eradication_2-4", "#cite_ref-Eradication_2-5", "http://www.polioeradication.org/polioandprevention.aspx", "#cite_ref-WHO_3-0", "#cite_ref-WHO_3-1", "#cite_ref-WHO_3-2", "#cite_ref-WHO_3-3", "#cite_ref-WHO_3-4", "#cite_ref-WHO_3-5", "#cite_ref-WHO_3-6", "http://www.who.int/topics/poliomyelitis/en/", "#cite_ref-MAYO_4-0", "#cite_ref-MAYO_4-1", "#cite_ref-MAYO_4-2", "#cite_ref-MAYO_4-3", "#cite_ref-MAYO_4-4", "http://www.mayoclinic.org/diseases-conditions/polio/basics/definition/CON-20030957", "#cite_ref-Fact-Sheet_5-0", "#cite_ref-Fact-Sheet_5-1", "#cite_ref-Fact-Sheet_5-2", "#cite_ref-Fact-Sheet_5-3", "#cite_ref-Fact-Sheet_5-4", "#cite_ref-Fact-Sheet_5-5", "http://www.who.int/mediacentre/factsheets/fs114/en/", "#cite_ref-Poliomyelitis_6-0", "#cite_ref-Poliomyelitis_6-1", "#cite_ref-Poliomyelitis_6-2", "#cite_ref-Poliomyelitis_6-3", "http://www.who.int/ith/vaccines/polio/en/", "#cite_ref-virus_7-0", "http://www.polioeradication.org/Polioandprevention/Thevirus.aspx", "#cite_ref-OPV_8-0", "http://www.polioeradication.org/Polioandprevention/Thevaccines/Oralpoliovaccine(OPV).aspx", "#cite_ref-IPV_9-0", "#cite_ref-IPV_9-1", "http://www.polioeradication.org/Polioandprevention/Thevaccines/Inactivatedpoliovaccine(IPV).aspx", "/Template:Human_navbox", "/Template_talk:Human_navbox", "https://creationwiki.org/index.php?title=Template:Human_navbox&action=edit", "/Human_biology", "/Human_body", "/Appendix", "/Axial_skeleton", "/Blood", "/Human_brain", "/Cochlea", "/Colon", "/Embryo", "/Human_eye", "/Fetus", "/Heart", "/Kidney", "/Liver", "/Lobes_of_the_brain", "/Lung", "/Mouth", "/Neuron", "/Pancreas", "/Skull", "/Skeletal_muscle", "/Small_intestine", "/Spleen", "/Thyroid", "/Tissue", "/Tonsil", "/Vertebral_column", "/File:9weeks.jpg", "/Biological_system", "/Auditory_system", "/Circulatory_system", "/Digestive_system", "/Endocrine_system", "/Immune_system", "/Integumentary_system", "/Limbic_system", "/Lymphatic_system", "/Muscular_system", "/Nervous_system", "/Olfactory_system", "/Reproductive_system", "/Respiratory_system", "/Sensory_system", "/Human_skeleton", "/Visual_system", "/Medical_science", "/Abortion", "/Acupuncture", "/Anatomy", "/Anesthesiology", "/Chiropractor", "/Dentist", "/Dermatology", "/Disease", "/Epidemiology", "/Fat_reduction_procedures", "/Heart_surgery", "/Homeopathic_medicine", "/Coroner", "/Nursing", "/Obstetrician", "/Occupational_therapy", "/Pediatrician", "/Pharmacology", "/Physical_therapist", "/Physician", "/Physiology", "/Plastic_surgery", "/Radiology", "/Sports_medicine", "/Vision_correction_procedures", "/Anthropology", "/Antediluvian_civilizations", "/Human_longevity", "/Decline_of_humanity", "/DNA_and_Babel", "/Homo_erectus", "/Neanderthal", "/Paleoanthropology", "/Human_migration", "/Human_races", "/Anthropology_quotes", "/File:Creationwiki_portals.png", "/Category:Biology", "/Portal:Biology", "/File:Creationwiki_portals.png"], "authors": [], "publish_date": null}