{"result_id": "084041", "URL": "https://creationwiki.org/Smallpox", "timestamp": "2023-04-25 14:52:44 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://creationwiki.org/Smallpox", "encoding": "UTF-8"}, "image": null, "domain": "creationwiki.org", "title": "Smallpox - CreationWiki, the encyclopedia of creation science", "cleaned_text": "From CreationWiki, the encyclopedia of creation science\n\nSmallpox is a contagious and deadly disease caused by the variola virus. It has killed countless people throughout the world - up to 30% of its victims and causing permanent damage to its survivors. Smallpox is considered a Category A infectious agent (high threat). [1]\n\nAlthough similar to chickenpox, smallpox is much more detrimental. In comparison, chickenpox lesions will appear more superficial and develop crops. Its rashes will be seen more on the trunk of the body, opposite to that of smallpox. The lesions will also develop at the same time and look the same whereas smallpox may not.[2]\n\nSmallpox is said to have originated more than 3,000 years ago. The place of birth is located in either India or Egypt.[3] When smallpox began it started a major death epidemic in Asia, Europe, and Africa.[4] It was found that by the 18th century about 1/3 of those who became blind was by this very virus. For example, in Vietnam, 1898, they recorded 9/10 of those blinded was by smallpox. Also, 95% of their teenagers were pockmarked. On the other side of the world, by the late 18th century, in both France and Sweden every 10th baby born was going to die from this virus. Even in Russia, they counted that every 7th child was going to die from the same cause. [5]\n\nSince this virus spread quickly and was a lethal killer, many people tried whatever they could to prevent themselves from obtaining it. Three most common practices were worshiping gods, variolation (infect someone with a live virus that has yet to be infected), and vaccination (animal pox-based viruses). [6] In 1022-1063 A.D., a Buddhist nun came up with a new way to immunize a person from smallpox. She took old scabs that had fallen off the smallpox victims and crushed them into a powder. With that powder she would blow it up into a non-infected/immune person's nostrils. This, along with other methods, was said to give the person a mild case of smallpox so that they would get over it with ease and become forever immune to it. Variolation was practiced in many places, including Europe in the late 1700's, but in this case it produced poor results. Thus 2-3% of those who took up variolation died, but on the other hand it decreased the death rate of smallpox by 10 times less.[7]\n\nAn even more hopeful cure of smallpox was presented when European Edward Jenner tested that when inoculated with cowpox, a person would become immune to smallpox. His first experiment was with an 8 year old boy, whom he inoculated and later exposed to the virus and no change had occurred. [8] It wasn't until around 1958 that a world-wide eradication of smallpox was called up. But since not every country put the same effort into completing this task, the virus remained at large in some areas of the world, which in turn kept everyone else at risk. Soon every country did eradicate the virus and now it is no longer a major threat.[9]\n\nAs a person becomes infected with the variola virus it will travel through the respiratory tract to the lymph nodes. There it will replicate and produce viremia (presence of virus in blood). This will then bring upon a rash. In days 4-14, the virus will continue to multiply in the reticuloendothelial system. Between that time is when it is in incubation and the symptoms will begin to appear, days 7-17. The most common symptoms include: fever, headache, malaise, chills, anorexia, backache, and vomiting. Following is the prodromal phase, this is when the mucous membranes in the mouth and the pharynx become infected. Lesions will also begin to form as the virus moves through the dermal layer of skin. Viral particles can be found in the lesions and also in urine and conjunctival secretions. Major carriers of the virus are: the spleen, lymph nodes, liver, bone marrow, kidneys, and other viscera. As the virus continues to infect the body, the production of cytotoxic T cells and B cells will limit its spread.[10] They will begin as a rash and spread mostly on the face, arms, and legs, including some in other areas. These rashes will develop into small bumps which will soon become puss filled blisters (lesions).[11] As the infection worsens the papules will grow larger. Beginning at 2-3mm in diameter, they may grow up to 4-6mm in diameter by 4-7 days after the rash has appeared. [12] Scabs will later develop on the blisters and they will soon fall off 3-4 weeks later. [13]\n\nSmallpox is such a destructive virus in that 30% of those infected are likely to die from it. Those that are lucky enough to survive will still have remnants of their illness. There are many different outcomes, such as deep pitted scars (pockmarks) in 65-80% of survivors,[14] blindness, arthritis, osteomyelitis (bone infection), and fetus infections, which will result in birth complications and possible death of a fetus. [15]\n\nIn order for the smallpox virus to spread a person comes in close contact with someone who has the virus symptoms. The most effective way for a person to become infected is through already infected saliva or face-to-face contact. Other ways are through different types of bodily fluids, or even contaminated clothing or bed linens. [16] It is rare that it will spread by simply being in an enclosed area with the virus in the air. It also is not known to be spread by any animals or insects, only human to human. [17] The major routes of which the virus uses to enter a body is through the respiratory tract, alimentary tract, and the skin. Minor routes would include the urinary and genital tracts and the conjunctiva. [18]\n\nWhen at large, this virus is very contagious to other people. [19] Though the virus is most likely to spread from person to person when the rash first appears, it will remain contagious until the last scab has fallen off. [20] It is recorded that 30% of those that were susceptible to the virus, when coming in contact, became infected during the era of endemic smallpox. [21]\n\nThere are currently no actual treatments that exist for smallpox. They do, however, have medicines that will help the symptoms of smallpox. An infected person can be given fluids and medicine for their fever and the pain. They will also be provided with antibiotics that will prevent or help get rid of any bacterial infection that may do more harm than is already taking place. Though there are no treatments, there is a study in progress for 2 different treatments. These include Vaccinia Immune Globulin and cidofovir. [22]\n\nA vaccine is the only proven way to treat against the on come of the smallpox virus. If a person were to take this vaccine they would be completely immune to receiving smallpox. This was how the world was eradicated of the virus in 1980. Though now the vaccine is not open to the general public, in case of an emergency bio-terrorist attack, we are prepared to vaccinate everyone. [23]\n\nThe variola virus is part of the family Poxyiridae. They are large, enveloped deoxyribonucleic acid (DNA) viruses. The virus particles are brick shaped and are sized at around 300 by 200 by 100 um. In order for a person to become infected it only takes a few of these virions, from 10-100 of them. [24]\n\nVariola major was the most common type of smallpox virus. There are 4 different categories in this one level of smallpox which include: ordinary - makes up 90% of victims; modified- mild case in a previously vaccinated patient; flat; and haemorrhagic-rare and severe. If a person becomes infected with either flat or hemorrhagic it is fatal, but if infected with either ordinary or modified there is only a 30% chance of death. [25] The cause of death is usually from bleeding, cardiovascular collapse, and secondary infections. Haemorrahagic also causes a quick death because of excessive internal and external bleeding. [26]\n\nVariola minor is a mild case of smallpox. The fatality rate of which is only at 1%. [27] The forming of haemorrhagic is very rare.[28]\n• The control and eradication of smallpox in South Asia UCL.\n• The History of Smallpox reviewed by Kate Grossman,MD. About.com.\n• FAQs about Smallpox: The Disease and the Vaccine U.S. Department of Health & Human Services.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/File:Variola_virus.jpg", "/Disease", "/Virus", "http://www.smallpox.gov/QuestionsAnswers.html", "/Chickenpox", "/index.php?title=Lesions&action=edit&redlink=1", "http://pathport.vbi.vt.edu/pathinfo/pathogens/Variola.html", "#History", "#Infection", "#Spread", "#Treatment", "#Virus", "#Viral_Diseases", "#References", "/India", "/Egypt", "https://archive.is/20120529141333/www.who.int/mediacentre/factsheets/smallpox/en/", "/Asia", "/Europe", "/Africa", "http://www.smallpoxhistory.ucl.ac.uk/", "/index.php?title=Vietnam&action=edit&redlink=1", "/France", "/index.php?title=Sweden&action=edit&redlink=1", "/Russia", "https://archive.is/20120529141333/www.who.int/mediacentre/factsheets/smallpox/en/", "/index.php?title=Variolation&action=edit&redlink=1", "/Vaccination", "http://www.smallpoxhistory.ucl.ac.uk/", "/index.php?title=Buddhist&action=edit&redlink=1", "http://dermatology.about.com/cs/smallpox/a/smallpoxhx.htm", "/index.php?title=Cowpox&action=edit&redlink=1", "http://dermatology.about.com/cs/smallpox/a/smallpoxhx.htm", "http://www.smallpoxhistory.ucl.ac.uk/", "/File:Smallpox_face_lesions.jpg", "/File:Smallpox_face_lesions.jpg", "/File:Smallpox_trunk_lesions.jpg", "/File:Smallpox_trunk_lesions.jpg", "/Lymphatic_system", "/index.php?title=Reticuloendothelial_system&action=edit&redlink=1", "/Anorexia", "/index.php?title=Mucous_membranes&action=edit&redlink=1", "/Mouth", "/index.php?title=Pharynx&action=edit&redlink=1", "/Skin", "/Spleen", "/Liver", "/Bone_marrow", "/Kidneys", "/index.php?title=Viscera&action=edit&redlink=1", "/Immune_system", "/Immune_system", "http://pathport.vbi.vt.edu/pathinfo/pathogens/Variola.html", "/index.php?title=Face&action=edit&redlink=1", "/index.php?title=Arms&action=edit&redlink=1", "/index.php?title=Legs&action=edit&redlink=1", "http://www.mamashealth.com/infect/smallpox.asp", "http://pathport.vbi.vt.edu/pathinfo/pathogens/Variola.html", "http://www.mamashealth.com/infect/smallpox.asp", "https://archive.is/20120529141333/www.who.int/mediacentre/factsheets/smallpox/en/", "http://pathport.vbi.vt.edu/pathinfo/pathogens/Variola.html", "/index.php?title=Saliva&action=edit&redlink=1", "http://www.mamashealth.com/infect/smallpox.asp", "/Animals", "/Insects", "http://www.smallpox.gov/QuestionsAnswers.html", "/Respiratory", "/index.php?title=Alimentary&action=edit&redlink=1", "http://pathport.vbi.vt.edu/pathinfo/pathogens/Variola.html", "http://www.mamashealth.com/infect/smallpox.asp", "http://www.smallpox.gov/QuestionsAnswers.html", "http://pathport.vbi.vt.edu/pathinfo/pathogens/Variola.html", "http://www.mamashealth.com/infect/smallpox.asp", "/Vaccine", "http://www.smallpox.gov/QuestionsAnswers.html", "/index.php?title=Poxyiridae&action=edit&redlink=1", "/Acid", "/index.php?title=Virions&action=edit&redlink=1", "http://pathport.vbi.vt.edu/pathinfo/pathogens/Variola.html", "http://pathport.vbi.vt.edu/pathinfo/pathogens/Variola.html", "http://www.smallpoxhistory.ucl.ac.uk/", "http://pathport.vbi.vt.edu/pathinfo/pathogens/Variola.html", "http://www.smallpoxhistory.ucl.ac.uk/", "/AIDS", "/Avian_influenza", "/Chickenpox", "/Ebola", "/Gastroenteritis", "/Hepatitis_B", "/Hepatitis_C", "/Human_papillomavirus", "/Infectious_mononucleosis", "/Influenza", "/Measels", "/Mumps", "/Poliomyelitis", "/Swine_influenza", "/Rabies", "/Yellow_fever", "/Template:Viral_disease", "https://archive.is/20120529141333/www.who.int/mediacentre/factsheets/smallpox/en/", "http://www.smallpoxhistory.ucl.ac.uk/", "http://dermatology.about.com/cs/smallpox/a/smallpoxhx.htm", "http://www.mamashealth.com/infect/smallpox.asp", "http://www.smallpox.gov/QuestionsAnswers.html", "http://pathport.vbi.vt.edu/pathinfo/pathogens/Variola.html", "/Template:Biology_navbox", "/Template_talk:Biology_navbox", "https://creationwiki.org/index.php?title=Template:Biology_navbox&action=edit", "/Biology", "/Organisms", "/Animal", "/Algae", "/Amphibian", "/Bacteria", "/Bird", "/Created_kind", "/Crustaceans", "/Dinosaur", "/Fish", "/Fungi", "/Human", "/Insect", "/Mollusk", "/Plant", "/Protist", "/Reptiles", "/File:Animal_diversity.jpg", "/Biological_scientist", "/Agriculture", "/Anatomy", "/Baraminology", "/Biologist", "/Biotechnology", "/Botany", "/Cell_biology", "/Ecology", "/Epidemiology", "/Embryology", "/Entomology", "/Biological_evolution", "/Genetics", "/Herpetology", "/Human_biology", "/Medicine", "/Microscopy", "/Physiology", "/Taxonomy", "/Virology", "/Zoology", "/Biological_system", "/Auditory_system", "/Circulatory_system", "/Digestive_system", "/Endocrine_system", "/Immune_system", "/Integumentary_system", "/Limbic_system", "/Lymphatic_system", "/Muscular_system", "/Nervous_system", "/Olfactory_system", "/Reproductive_system", "/Respiratory_system", "/Sensory_system", "/Skeletal_system", "/Visual_system", "/Biological_process", "/Aging", "/Cell_division", "/Cellular_respiration", "/Disease", "/Embryogenesis", "/Gene_expression", "/Metabolism", "/Metamorphosis", "/Parasitism", "/Photosynthesis", "/Pregnancy", "/Protein_synthesis", "/Reproduction", "/Symbiosis", "/Trophic_level", "/File:Creationwiki_portals.png", "/Category:Biology", "/Portal:Biology", "/Biology_news_archive", "/File:Creationwiki_portals.png"], "authors": [], "publish_date": null}