{"result_id": "084023", "URL": "https://creationwiki.org/Cancer_immunotherapy", "timestamp": "2023-04-25 14:52:16 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://creationwiki.org/Cancer_immunotherapy", "encoding": "UTF-8"}, "image": null, "domain": "creationwiki.org", "title": "Cancer immunotherapy - CreationWiki, the encyclopedia of creation science", "cleaned_text": "From CreationWiki, the encyclopedia of creation science\n\nCancer Immunotherapy is treatment that uses a person’s immune system to fight a cancer. This can be done by either stimulating your own immune system to work harder or smarter to attack cancer cells, or by giving you immune system components, such as man-made immune system proteins.[1]\n\nThere are approximately 1,500 deaths caused by cancer each day. Doctors work hard to find cures and treatments, but sometimes the cancer is too strong. A popular treatment is called Cancer Immunotherapy. This treatment uses the immune system of the patient to fight the cancer. The immunotherapy spurs the immune system to attack the tumor cells while using antigens (proteins) as targets. Because the immune system has such a good memory, this treatment could give complete, long-lasting remissions, and complete cures. Also, because of the way this treatment attacks the cells, it has been noted to have no side effects in any type of cancer.\n\nWilliam Coley is known as the father of Immunotherapy. He began with an attempt to harness the immune system of a patient for the treatment of cancer during the late 1900s. After the development of erysipelas, he began to notice many cancer patients entering into a spontaneous remission. Because of this, he started to inject his patients' tumors with mixtures of live and dead Streptococcus progenies and Serratia marcescens in 1891. The results of his injections varied, but he did accomplish durable, complete remission for his patients with sarcome, lymphoma, and testicular carcinoma. Oncologists were not aware of the actions that 'Coley's toxins' could preform, or the risk taken while deliberately infecting cancer patients with pathogenic bacteria. Because of this, they adopted surgery and radiotherapy as their standard treatments for patients in the early 2000s. [2]\n\nAt the moment that the body's immune system detects antigens(harmful substances, such as bacteria, viruses, fungi, or parasites), it begins to produce antibodies (proteins that fight infection). Monoclonal antibodies are produced in a laboratory, and when the patients take it, the monoclonal antibodies begin to function like antibodies the body naturally produces. These antibodies are given to the patient intravenously (through a vein) and function by targeting specific proteins on the surface of cancer cells or other cells that are supporting the growth of the cancer cells. Once the monoclonal antibodies are attached to a cancer cell, they are capable of achieving these following goals: [3]\n\nAllow the immune system to destroy the cancer cell.\n\nThere are times that the immune system is not aware that the cells in the body are cancer cells or that they are harmful. The monoclonal antibody helps the immune system recognize the harmful cell by marking or tagging them, attaching to certain parts of the cancer cell that are not found on healthy cells. [4]\n\nSignals are sent to cells from chemicals (in the body called growth factors), which attach themselves to the receptors that are on the surface of the cell, where they send the signal to grow. Some cancer cells grow faster than normal cells because they make extra copies of the growth factor receptor. Monoclonal antibodies can prevent the growth signal from delivering, by blocking the receptors. [4]\n\nThis is a treatment called radioimmunotherapy, which uses monoclonal antibodies to pass along radiation straight to the cancer cells. In a laboratory, they attach radioactive molecules to the monoclonal antibodies which can then deliver a small doses of radiation specifically to the tumor while at the same time leaving the healthy cells alone. [4]\n\nMonoclonal antibodies that carry radioactive particles can also be of help in diagnosing specific cancers, like colorectal, ovarian, and prostate cancers. They have unique cameras that identify the cancer by showing where in the body the radioactive particles have accumulated. Also a pathologist (a doctor who specializes in interpreting laboratory tests and evaluating cells, tissues, and organs to diagnose disease) can use the monoclonal antibodies to conclude what the type of cancer the patient may have after tissue has been removed during biopsy. [4]\n\nSome of the monoclonal antibodies deliver other cancer drugs straight to the cancer cells. The moment the monoclonal antibody attaches to the cancer cell, the treatment it contains enters the cell. This causes the cell to die without harming other healthy cells. [4]\n\nImmunotherapy is used to leave the healthy cells unharmed and fight against the cancer cells. This results in fewer or no side effects when put next to and compared with chemotherapy. A benefit from the use of immunotherapy is that is does not stop protecting the body from cancer once the treatment ends. In chemotherapy the protection typically goes away when the treatment does. More research is needed to overcome the recent limitations of immunotherapy. [5]\n\nThis treatment can be used on a variety of cancers such as breast cancer, brain cancer, lung cancer, ovarian cancer, colorectal cancer, etc. Immunotherapy shows the possibility of creating a long-term, wide-spread survival from cancer. This treatment does not cause the same negative side-effects as radiation and chemotherapy. [6]\n\nCancer immunotherapy is a more experimental treatment that is rarely known for curing. Chemotherapy is a more commonly used for treatment against cancer, but a cure using it is also rarely seen. Because of the risk of using immunotherapy, many have suggested combining both chemo and immunotherapy to work together to fight against the cancer. Chemotherapy damages your interior and with immunotherapy you take a risk because you don't know what will happen. Cancer immunotherapy has had successful trials but it is still a growing treatment and will go through many trials until people put it on the same level as chemotherapy. The vaccine that is injected to fight against a tumor also depends on the body system of the person. Each person's body may react differently according to the response their body channels. The biggest con for cancer immunotherapy is the unknown. The patient does not know if the injection will work. [7]\n\nThe video takes an audio-visual journey through the different approaches that are being investigated to harness the immune system to treat cancer.", "opengraph": {}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe width=\"560\" height=\"315\" src=\"//www.youtube.com/embed/-NNjDjXSJt0\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "//www.youtube.com/embed/-NNjDjXSJt0"}], "links": ["/Cancer", "#cite_note-1", "#Brief_History", "#Common_use", "#Benefits", "#Difficulties", "#Video", "#References", "/File:Eduard_Jenner.jpg", "/File:Eduard_Jenner.jpg", "/index.php?title=Erysipelas&action=edit&redlink=1", "/Streptococcus", "/index.php?title=Serratia_marcescens&action=edit&redlink=1", "/index.php?title=Pathogenic_bacteria&action=edit&redlink=1", "/index.php?title=Surgery&action=edit&redlink=1", "/index.php?title=Radiotherapy&action=edit&redlink=1", "#cite_note-2", "/File:Monoclonal_antibodies.png", "/File:Monoclonal_antibodies.png", "#cite_note-3", "#cite_note-CancerNet-4", "#cite_note-CancerNet-4", "/index.php?title=Radioimmunotherapy&action=edit&redlink=1", "#cite_note-CancerNet-4", "/index.php?title=Biopsy&action=edit&redlink=1", "#cite_note-CancerNet-4", "#cite_note-CancerNet-4", "/Chemotherapy", "#cite_note-5", "#cite_note-6", "#cite_note-7", "#cite_ref-1", "http://www.cancer.org/treatment/treatmentsandsideeffects/treatmenttypes/immunotherapy/immunotherapy-what-is-immunotherapy", "#cite_ref-2", "http://www.targetedonc.com/publications/special-reports/2014/immunotherapy-issue3/A-Brief-History-of-Immunotherapy", "#cite_ref-3", "http://www.cancer.net/navigating-cancer-care/how-cancer-treated/immunotherapy-and-vaccines/what-immunotherapy", "#cite_ref-CancerNet_4-0", "#cite_ref-CancerNet_4-1", "#cite_ref-CancerNet_4-2", "#cite_ref-CancerNet_4-3", "#cite_ref-CancerNet_4-4", "http://www.cancer.net/navigating-cancer-care/how-cancer-treated/immunotherapy-and-vaccines/what-immunotherapy", "#cite_ref-5", "http://www.healthcentral.com/breast-cancer/c/255251/168526/immunotherapy-cancer/", "#cite_ref-6", "http://www.cancertherapies.cc/immunotherapy", "#cite_ref-7", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3238317/", "/Template:Biology_navbox", "/Template_talk:Biology_navbox", "https://mail.creationwiki.org/index.php?title=Template:Biology_navbox&action=edit", "/Biology", "/Organisms", "/Animal", "/Algae", "/Amphibian", "/Bacteria", "/Bird", "/Created_kind", "/Crustaceans", "/Dinosaur", "/Fish", "/Fungi", "/Human", "/Insect", "/Mollusk", "/Plant", "/Protist", "/Reptiles", "/File:Animal_diversity.jpg", "/Biological_scientist", "/Agriculture", "/Anatomy", "/Baraminology", "/Biologist", "/Biotechnology", "/Botany", "/Cell_biology", "/Ecology", "/Epidemiology", "/Embryology", "/Entomology", "/Biological_evolution", "/Genetics", "/Herpetology", "/Human_biology", "/Medicine", "/Microscopy", "/Physiology", "/Taxonomy", "/Virology", "/Zoology", "/Biological_system", "/Auditory_system", "/Circulatory_system", "/Digestive_system", "/Endocrine_system", "/Immune_system", "/Integumentary_system", "/Limbic_system", "/Lymphatic_system", "/Muscular_system", "/Nervous_system", "/Olfactory_system", "/Reproductive_system", "/Respiratory_system", "/Sensory_system", "/Skeletal_system", "/Visual_system", "/Biological_process", "/Aging", "/Cell_division", "/Cellular_respiration", "/Disease", "/Embryogenesis", "/Gene_expression", "/Metabolism", "/Metamorphosis", "/Parasitism", "/Photosynthesis", "/Pregnancy", "/Protein_synthesis", "/Reproduction", "/Symbiosis", "/Trophic_level", "/File:Creationwiki_portals.png", "/Category:Biology", "/Portal:Biology", "/Biology_news_archive", "/File:Creationwiki_portals.png"], "authors": [], "publish_date": null}