{"result_id": "084002", "URL": "https://creationwiki.org/Prostate_cancer", "timestamp": "2023-04-25 14:51:45 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://creationwiki.org/Prostate_cancer", "encoding": "UTF-8"}, "image": null, "domain": "creationwiki.org", "title": "Prostate cancer - CreationWiki, the encyclopedia of creation science", "cleaned_text": "From CreationWiki, the encyclopedia of creation science\n\nProstate cancer is the most common cancer that occurs in men beside skin cancer this is especially in the United States, it can however be treated successfully. if people who have prostate cancer, know what to expect it can help you find treatment. Prostate cancer begins to grow in the prostate. The word “prostate” comes from Latin word. The Greek word prostates mean “one standing in front”. [1] Around 220,000 men in the U.S, are trying to find a treatment for prostate cancer, everyone need to make very important decisions of changes of lifestyle and diet. Most important decision would be look for knowledgeable physicians, nurses, and other healthcare providers to help you out with Prostate Cancer.\n\nProstate cancer is caused by DNA of a normal prostate cell changes. DNA is the chemical in our cells that makes up the genes. The genes regulate how the cells work. People usually look like our parents because of DNA. DNA affects a lot of things that we do not really know. Cancer can be caused by the part of DNA mutations, it turns on oncogenes or it turns off tumor suppressor genes. Prostate cancer is the second leading cause of death. Prostate cancer more often occurs to African-American. For African-American, Prostate cancer could be very deadly compared to white men. Most likely all prostate cancers are adenocarcinomas which means cancers that begin in cells that make and release mucus and fluids. Prostate cancer causes men to pee more often and have a weak flow. Prostate cancer affects old men, 60 percent of time it was men who are over 65 years old. Less than 1 percent of time it was men under 50 years old. Nevertheless Prostate cancer can be found in men who are over 30 years old or 40 years old. Because of the history of the family members. Doctors does not tell the patients why Prostate cancer causes but they tell us that diet could cause the Prostate cancer. Men who loses large amounts of fat, could have higher percentage to get Prostate cancer. The food that causes the Prostate cancer are meat, dairy products, rice, soybean products, and vegetables. [2]\n\nMost of the time, Prostate cancer grows really slow. 65 years old men with prostate cancer do not die with this disease. In the early stages of Prostate cancer there are no symptoms but most men find out after the blood test or a routine check up. These are symptoms that might occur: The patient pee more often, hard to pee, hard to keep urinating once he has started, blood in the urine, and painful during urination. If the prostate cancer is advanced, these are the symptoms occur: pain in the bone, pain in the femur, weakens the legs, and fecal incontinence. The symptoms of prostate cancer could be different for per man and these symptoms could be caused by different conditions. Doctors recommends that men should be tested for Prostate cancer, Especially men who are over 50 years old. Doctors recommends a physical exam which is PSA which stands for Prostate Specific Antigen. People are trying to avoid the symptoms because the symptoms make men to be very uncomfortable and inconvenient. Scary things about the symptoms would be men could make mistakes for something else than urination. If you neglect the Prostate cancer, this might occur dangerous symptoms or in a serious condition, this might cause the death. [3]\n\nAdvanced Prostate cancer that has grown beyond the prostate cancer is very hard to be cured with surgery or radiation therapy. Patients have to learn as much as possible about the many treatment options. They also need to make a decision what is best for them, because they will be more safe. The decisions that they should make: the need for therapy, level of risk, and benefits. There are three main treatment options: Active Surveillance, surgery, and radiation. There is other treatments options that patients consider, which is the cryotherapy, surgery, Radiation therapy, Hormone therapy, Chemotherapy, and Vaccine treatment. Before making treatment decisions, it’s really important to talk about the options like the stage and grade of cancer or any other serious health conditions. Urologists, Radiation oncologists, and Medical oncologists are the doctors who can cure the prostate cancer. [4]", "opengraph": {}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe width=\"560\" height=\"315\" src=\"//www.youtube.com/embed/MXk0TufhiM8\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "//www.youtube.com/embed/MXk0TufhiM8"}], "links": ["/File:Diagram_showing_prostate_cancer_that_has_spread_to_the_lymph_nodes_CRUK_184.png", "/File:Diagram_showing_prostate_cancer_that_has_spread_to_the_lymph_nodes_CRUK_184.png", "/Cancer", "/United_States", "#cite_note-1", "#Causes", "#Symptoms", "#Treatment", "#Video", "#Other_Cancers", "#References", "/File:150086-urinary-system.jpg", "/File:150086-urinary-system.jpg", "#cite_note-2", "/File:Prostate_Cancer.png", "/File:Prostate_Cancer.png", "#cite_note-3", "/File:Prostate-Cancer-Symptoms.jpg", "/File:Prostate-Cancer-Symptoms.jpg", "/index.php?title=Cryotherapy&action=edit&redlink=1", "/Radiation_therapy", "/index.php?title=Hormone_therapy&action=edit&redlink=1", "/Chemotherapy", "/index.php?title=Vaccine_treatment&action=edit&redlink=1", "#cite_note-4", "/Breast_cancer", "/Brain_tumor", "/Cancer", "/Carcinoma", "/Colorectal_cancer", "/Leukemia", "/Lung_cancer", "/Lymphoma", "/Melanoma", "/Mesothelioma", "/Neurofibromatosis", "/Skin_cancer", "/Template:Cancer", "#cite_ref-1", "https://www.cancer.org/cancer/prostate-cancer.html", "#cite_ref-2", "https://www.cancer.gov/types/prostate", "#cite_ref-3", "http://www.medicalnewstoday.com/articles/150086.php?page=2#causes_of_prostate_cancer", "#cite_ref-4", "https://www.pcf.org/c/treatment-options/", "/Template:Human_navbox", "/Template_talk:Human_navbox", "http://mail.creationwiki.org/index.php?title=Template:Human_navbox&action=edit", "/Human_biology", "/Human_body", "/Appendix", "/Axial_skeleton", "/Blood", "/Human_brain", "/Cochlea", "/Colon", "/Embryo", "/Human_eye", "/Fetus", "/Heart", "/Kidney", "/Liver", "/Lobes_of_the_brain", "/Lung", "/Mouth", "/Neuron", "/Pancreas", "/Skull", "/Skeletal_muscle", "/Small_intestine", "/Spleen", "/Thyroid", "/Tissue", "/Tonsil", "/Vertebral_column", "/File:9weeks.jpg", "/Biological_system", "/Auditory_system", "/Circulatory_system", "/Digestive_system", "/Endocrine_system", "/Immune_system", "/Integumentary_system", "/Limbic_system", "/Lymphatic_system", "/Muscular_system", "/Nervous_system", "/Olfactory_system", "/Reproductive_system", "/Respiratory_system", "/Sensory_system", "/Human_skeleton", "/Visual_system", "/Medical_science", "/Abortion", "/Acupuncture", "/Anatomy", "/Anesthesiology", "/Chiropractor", "/Dentist", "/Dermatology", "/Disease", "/Epidemiology", "/Fat_reduction_procedures", "/Heart_surgery", "/Homeopathic_medicine", "/Coroner", "/Nursing", "/Obstetrician", "/Occupational_therapy", "/Pediatrician", "/Pharmacology", "/Physical_therapist", "/Physician", "/Physiology", "/Plastic_surgery", "/Radiology", "/Sports_medicine", "/Vision_correction_procedures", "/Anthropology", "/Antediluvian_civilizations", "/Human_longevity", "/Decline_of_humanity", "/DNA_and_Babel", "/Homo_erectus", "/Neanderthal", "/Paleoanthropology", "/Human_migration", "/Human_races", "/Anthropology_quotes", "/File:Creationwiki_portals.png", "/Category:Biology", "/Portal:Biology", "/File:Creationwiki_portals.png"], "authors": [], "publish_date": null}