{"result_id": "084044", "URL": "https://creationwiki.org/Infectious_disease", "timestamp": "2023-04-25 14:52:48 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://creationwiki.org/Infectious_disease", "encoding": "UTF-8"}, "image": null, "domain": "creationwiki.org", "title": "Infectious disease - CreationWiki, the encyclopedia of creation science", "cleaned_text": "From CreationWiki, the encyclopedia of creation science\n\nInfectious diseases (also called communicable diseases) are diseases caused by germs. Infectious diseases kill more people worldwide than any other single cause.\n\nGerms are microbes (microscopic organisms) that are found everywhere - in air, soil and water. You can get infected by touching, eating, drinking or breathing something that contains a germ. Germs can also spread through animal and insect bites, kissing, sexual contact, blood transfusions, or by entering wounds.[1] Vaccines, proper hand washing and medicines can help prevent infections.[2]\n\nThere are four main kinds of germs:\n• Bacteria - one-celled germs that multiply quickly and may release chemicals which can make you sick\n• Viruses - capsules that contain genetic material, and use your own cells to multiply\n• Protozoa - one-celled animals that use other living things for food and a place to live\n\nMicrobes are tiny organisms—too tiny to see without a microscope, yet they are abundant on Earth. They live everywhere—in air, soil, rock, and water. Some live happily in searing heat, while others thrive in freezing cold. Some microbes need oxygen to live, but others do not. These microscopic organisms are found in plants and animals as well as in the human body. Some microbes, called pathogens, cause disease in humans, plants, and animals. Others are essential for a healthy life, and we could not exist without them. Indeed, the relationship between microbes and humans is delicate and complex.[3] For example, the Human Microbiome Project has classified skin diseases into three groups:[4]\n• Diseases that are caused by known microbes\n• Diseases that are caused by a community of unknown microbes\n• Diseases that are caused by opportunistic pathogens, which normally do not cause disease, but may cause disease if they enter the wrong part of the body or the individual becomes immune compromised\n\nMost microbes belong to one of four major groups: bacteria, viruses, fungi, or protozoa. A common word for microbes that cause disease is “germs.” Some people refer to disease-causing microbes as “bugs.” “I’ve got the flu bug,” for example, is a phrase you may hear during the wintertime to describe an influenza virus infection.\n\nSince the 19th century, we have known microbes cause infectious diseases. Near the end of the 20th century, researchers began to learn that microbes also contribute to many chronic diseases and conditions. Mounting scientific evidence strongly links microbes to some forms of cancer, coronary artery disease, diabetes, multiple sclerosis, and chronic lung diseases.[3]\n\nMicrobes have probably always caused infections and diseases in humans. Since ancient times, historians have documented some of those diseases. Present-day archaeologists and microbiologists (scientists who study microbes) are discovering evidence of infectious disease in prehistoric human skeletons.\n\nIn a fascinating find in the late 20th century, researchers uncovered evidence that prehistoric humans were troubled by microbial parasites and used natural remedies against them. Along with the frozen mummy of the “Ice Man,” who was found in the mountains of northern Italy and lived between 3300 and 3100 B.C., scientists found a type of tree fungus containing oils that are toxic to intestinal parasites. Later, in the laboratory, researchers found the eggs of a microscopic parasitic intestinal roundworm, Trichuria trichiura (whipworm), in his intestines.[3]\n\nSmallpox, which is caused by a variola virus, was described in ancient Egyptian and Chinese writings. According to some researchers, over the centuries smallpox was responsible for more deaths than all other infectious diseases combined. It killed millions of people over thousands of years before being eradicated late in the 20th century by worldwide vaccination. The last case of naturally occurring smallpox was recorded in 1977.\n\nThe protozoan parasite Plasmodium causes malaria, a tropical disease that usually is transmitted to humans during the bite of the Anopheles mosquito. In ancient times, this disease was mentioned in Egyptian writings, called hieroglyphics, and was described in detail by the Greek physician Hippocrates. Malaria ravaged invaders from the Roman Empire. Though rare in the United States, malaria remains a serious public health threat worldwide.[3]\n\nEvidence on a 1300 B.C. Egyptian stone engraving shows that poliomyelitis (polio) also has been around since ancient times. In the 1990s, public health officials launched a massive international vaccination campaign to eradicate the polio virus, which causes paralysis and can be deadly.\n\nIn the 14th century, a bacterium that modern scientists identified as Yersinia pestis caused the bubonic plague, or Black Death. Bubonic plague entered Europe and Africa through infected rodents and fleas that accompanied travelers along trade routes from Mongolia. The plague epidemic spread through Europe, Africa, and the Middle East, killing about 20 million people in Europe alone. Plague is spread to humans through the bites of fleas, which pick up the bacteria while sucking blood from rodents, especially rats. In the United States, health care providers report cases of plague even today, most of which are found in the Southwest.\n\nViruses caused two major pandemics during the 20th century. From 1918 to 1919, the influenza virus ravaged worldwide populations. Estimates of the number of people killed during the so-called “Spanish flu” pandemic range from 20 million to 40 million. HIV, which was identified in 1984, killed an estimated 3.1 million people worldwide in 2005 alone.[3]\n• Checchi, Francesco. (2009). \" Principles of infectious disease transmission: Short course on Infectious Diseases in Humanitarian Emergencies \". WHO Unit on Disease Control in Humanitarian Emergencies. Accessed 29 July 2017.\n• by National Institute of Allergy and Infectious Diseases Medline Plus: Infectious Diseases by National Institute of Allergy and Infectious Diseases\n• by the National Institute of Allergy and Infectious Diseases Understanding Microbes in Sickness and in Health by the National Institute of Allergy and Infectious Diseases\n• Welcome to the Microbiome: Getting to Know the Trillions of Bacteria and Other Microbes In, On, and Around You. New Haven: Yale University Press. p. 76.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/File:Salmonella.jpg", "/File:Salmonella.jpg", "/Bacterium", "/Salmonella", "/Diseases", "/Germs", "/Microbes", "#cite_note-1", "#cite_note-nlm-2", "/Bacteria", "/Viruses", "/Fungi", "/Protozoa", "#Microbes", "#History", "#Types_of_diseases", "#Viral", "#Bacterial", "#Protozoan", "#References", "/Microorganism", "/Earth", "/index.php?title=Air&action=edit&redlink=1", "/Soil", "/Rock", "/Water", "/Humans", "/Plants", "/Animals", "#cite_note-niaid-3", "#cite_note-4", "/Bacteria", "/Viruses", "/Fungi", "/Protozoa", "/Influenza", "#cite_note-niaid-3", "/Archaeologists", "/index.php?title=Microbiologists&action=edit&redlink=1", "/Microbes", "/Fungus", "#cite_note-niaid-3", "/File:Remembering_the_Plague_monument.jpg", "/File:Remembering_the_Plague_monument.jpg", "/Smallpox", "/Vaccination", "/Protozoan", "/Malaria", "/Hippocrates", "#cite_note-niaid-3", "/Egyptian", "/Poliomyelitis", "/Vaccination", "/Bacterium", "/Bubonic_plague", "/Rodents", "/Fleas", "/Europe", "/Africa", "/Middle_East", "/Rats", "/United_States", "/Viruses", "/Influenza", "/HIV", "#cite_note-niaid-3", "/Aristotle", "/index.php?title=Antony_van_Leeuwenhoek&action=edit&redlink=1", "/index.php?title=Edward_Jenner&action=edit&redlink=1", "/index.php?title=Ign%C3%A1c_F%C3%BCl%C3%B6p_Semmelweis&action=edit&redlink=1", "/Louis_Pasteur", "/Joseph_Lister", "/index.php?title=Robert_Koch&action=edit&redlink=1", "/index.php?title=Alexander_Fleming&action=edit&redlink=1", "#cite_note-niaid-3", "/AIDS", "/Avian_influenza", "/Chickenpox", "/Ebola", "/Gastroenteritis", "/Hepatitis_B", "/Hepatitis_C", "/Human_papillomavirus", "/Infectious_mononucleosis", "/Influenza", "/Measels", "/Mumps", "/Poliomyelitis", "/Smallpox", "/Swine_influenza", "/Rabies", "/Yellow_fever", "/Template:Viral_disease", "/Cellulitis", "/Cholera", "/Leprosy", "/Rocky_mountain_spotted_fever", "/Tetanus", "/Template:Bacterial_disease", "/Amebiasis", "/Malaria", "#cite_ref-1", "http://www.who.int/diseasecontrol_emergencies/publications/idhe_2009_london_inf_dis_transmission.pdf", "#cite_ref-nlm_2-0", "http://www.nlm.nih.gov/medlineplus/infectiousdiseases.html", "#cite_ref-niaid_3-0", "#cite_ref-niaid_3-1", "#cite_ref-niaid_3-2", "#cite_ref-niaid_3-3", "#cite_ref-niaid_3-4", "#cite_ref-niaid_3-5", "http://www3.niaid.nih.gov/healthscience/healthtopics/microbes/PDF/microbesbook.pdf", "#cite_ref-4", "/Special:BookSources/9780300208405", "/Template:Biology_navbox", "/Template_talk:Biology_navbox", "https://creationwiki.org/index.php?title=Template:Biology_navbox&action=edit", "/Biology", "/Organisms", "/Animal", "/Algae", "/Amphibian", "/Bacteria", "/Bird", "/Created_kind", "/Crustaceans", "/Dinosaur", "/Fish", "/Fungi", "/Human", "/Insect", "/Mollusk", "/Plant", "/Protist", "/Reptiles", "/File:Animal_diversity.jpg", "/Biological_scientist", "/Agriculture", "/Anatomy", "/Baraminology", "/Biologist", "/Biotechnology", "/Botany", "/Cell_biology", "/Ecology", "/Epidemiology", "/Embryology", "/Entomology", "/Biological_evolution", "/Genetics", "/Herpetology", "/Human_biology", "/Medicine", "/Microscopy", "/Physiology", "/Taxonomy", "/Virology", "/Zoology", "/Biological_system", "/Auditory_system", "/Circulatory_system", "/Digestive_system", "/Endocrine_system", "/Immune_system", "/Integumentary_system", "/Limbic_system", "/Lymphatic_system", "/Muscular_system", "/Nervous_system", "/Olfactory_system", "/Reproductive_system", "/Respiratory_system", "/Sensory_system", "/Skeletal_system", "/Visual_system", "/Biological_process", "/Aging", "/Cell_division", "/Cellular_respiration", "/Disease", "/Embryogenesis", "/Gene_expression", "/Metabolism", "/Metamorphosis", "/Parasitism", "/Photosynthesis", "/Pregnancy", "/Protein_synthesis", "/Reproduction", "/Symbiosis", "/Trophic_level", "/File:Creationwiki_portals.png", "/Category:Biology", "/Portal:Biology", "/Biology_news_archive", "/File:Creationwiki_portals.png"], "authors": [], "publish_date": null}