{"result_id": "084008", "URL": "https://creationwiki.org/Eugenics", "timestamp": "2023-04-25 14:51:52 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://creationwiki.org/Eugenics", "encoding": "UTF-8"}, "image": null, "domain": "creationwiki.org", "title": "Eugenics - CreationWiki, the encyclopedia of creation science", "cleaned_text": "From CreationWiki, the encyclopedia of creation science\n\nEugenics is the study or belief in improving the future generations of humanity by discouraging the reproduction of people with defects or imperfections. [1]. The practice involves the use of sterilization or abortion as a means of artificial selection to alter the characteristics of a species. The terms usually refers to the selective breeding of humans. It is a social philosophy which advocates the manipulation of human reproduction for the purposes of attempting to improve the human species over generations. The word Eugenics comes from the Greek for \"well born\".\n\nThe first person to use the term eugenics was Sir Francis Galton in 1883 in his book Inquiries into Human Faculty and Its Development[2]. He was Charles Darwin’s cousin and a popular British scholar. Eugenics means “well- born.” [3] Galton was influenced by the idea from Charles Darwin of natural selection. Galton’s theory was that the elite class was made up of people with a good genetic composition and he wanted to experiment with selective breeding. This plan never actually came to pass in Britain, but his studies eventually led to other countries noticing and taking action. In the late 1800s, the eugenics movement began in the USA to stop the passing on of undesirable traits to future generations, so they began to fund the studies for it. Many people took interest in these studies such as politicians, private citizens, and scientists. Even important people like Theodore Roosevelt supported it. [4]\n\nThe Eugenics Record Office (ERO) was founded in Cold Spring Harbor in New York. The ERO was in charge of tracking family histories and traits in order to find a consistent malfunctioning gene and eradicate it. Their conclusion was that people with less desirable traits came from families that were poor, immigrants, of low class, or minorities. [3] This drove them to eliminate these problems, so they decided that the best way to do so would be to use sterilization to inhibit further reproduction of people in these categories. They also released stricter immigration laws to avoid the problems of immigrants. In the 1900s, 33 states created sterilization programs which focused on things from mental illness to promiscuity. Many people were even sterilized against their will and by the end of that time up to 65,000 people were sterilized. [3]\n\nEugenics eventually stopped being as popular because of what occurred in World War II. The Germans decided to exterminate all “racially impure, physically disabled, mentally infirm, criminally minded, and sexually aberrant.” [5] They believed that Germany was being contaminated by all of these people and they justified the murder of millions of people with eugenics and Darwinism. After the horrors of World War II, eugenics became a topic of embarrassment and it was dropped from many organization names and books.[4]\n\nIt should also be noted that a number of ancient pagan cultures practiced eugenics, notably the Spartans. Plutarch wrote of the Spartans:\n\nThe reason for this practice was an emphasis on the maintenance of \"good stock,\" which led the Spartans to the following customs:\n\nSome problems with eugenics began with people's confidence in the same technique that Gregor Mendel used to experiment with pea genes. People had been using those experiments to reproduce the physically strong livestock and they believed it could work with humans.The problem, however, was that their whole basis for “fit” or “unfit” was categorized into categories like “criminality” and “feeblemindedness.” They ignored all other factors that might contribute to these characteristics, and instead blamed it on a gene. For almost thirty years information was gathered about family histories and when people could not show up for an interview, the people would just place in whatever category they thought was best or would find their information from prisons or hospitals. Therefore the research was conducted with the belief that all genes came in predictable patterns like peas, but they did not take into account that there were other important factors that played a role in those gene developments like environmental factors that Mendel discovered but chose to leave out because it didn’t all fit into his categories. [7]\n\nEugenics is also directly contrary to the teachings of Christ and the prophets, who taught that all should be treated justly, and not on the basis of strength or weakness. In opposition to the perverse human tendency to favor the strong over the weak, Jesus healed the sick and deformed, and warned the proud and powerful that they would be made low.\n\nBiblical worldview plays a huge part in eugenics. It is a very controversial topic that many people have debated and struggled over for many years. Although the Bible does not have much to say about perfecting humans it does mention in Genesis that God commanded Adam and Eve to “be fruitful and multiply” (Genesis 1: 28) there is no mention about decreasing the number of people on the Earth. In Psalms, the author writes that “children are a heritage from the Lord, the fruit of the womb a reward” (Psalms 127:3). In regards to euthanasia, God has decreed that he is the one who has chosen the day we are born and the day we die (Job 14:5). Jesus commanded his followers to defend the weak (Matthew 20:35-36), and when someone asked him about a blind man he answered that he was blind so that “the works of God might be displayed in Him” (John 9: 1-3). [8] Using the topic of abortion, most professionals say that human life does not actually begin until the baby can survive by itself outside of the womb. But God says that from the moment of conception a human life is formed. In Jeremiah, it says, “Before I formed you in the womb I knew you, and before you were born I consecrated you; I appointed you a prophet to the nations” (Jeremiah 1:5, ESV). [9] At three weeks a baby’s heart begins to beat, at six weeks they move their arms and legs and you can measure their brain waves, and at 20 weeks the baby can survive outside of the womb. [10] In Exodus, God commands his people not to murder (Exodus 20:13), and that is exactly what abortion is.\n\nEugenicists, believe disabled people and other socially undesirable groups, such as vagrants and 'moral defectives', would weaken the gene pool of the nation and reduce competitiveness. At the end of the 19th century and start of the 20th, disabled people were shut away in single sex institutions for life or sterilized. The policy was derived from Darwin's theory of survival of the fittest, which aimed to improve the quality of the population by preventing \"unfit\" people from reproducing and encouraging \"fit\" people to reproduce. Such ideas were popular in many countries, and were widely implemented in United States, the Nordic countries, and Germany. The Nazis used false scientific arguments to discourage procreation by members who they considered were 'unfit' to live in society, either physically, mentally or socially. In the famous case of Buck v. Bell in 1924, the US Supreme Court upheld a Virginia law permitting the state to sterilize mentally retarded people without their consent. The Court reasoned:\n\nHolmes concluded his argument with the infamous phrase: \"Three generations of imbeciles are enough.\" Similar arguments were made in Civic Biology, the evolutionary text behind the Scopes trial.\n\nToday eugenics is used in several different ways. Its main use is to test for heritable diseases like hemophilia, cystic fibrosis or down syndrome. [3] People will choose to undergo genetic screening so that they know if they are likely to pass down any sort of genetic disease to their child. If so, some couples choose to adopt or not have any children at all. If a couple finds out when they are already pregnant, some choose to abort the child. [4] It is also used for people who wish to use in-vitro fertilization and choose the “perfect” traits. In the future people have talked about opening sperm banks and even cloning humans. [4]\n\nOne main form that eugenics is carried out through is abortion. Abortion is the removal of a fetus from the womb resulting in death. Reasons people give for abortion are an unwanted pregnancy, risk of an unhealthy baby, the mother cannot afford the baby, the husband or father does not want the child, or the mother has health problems among other reasons. [11] Statistics say that in 2016 there were approximately 893, 000 abortions and in 2014 19% of pregnancies ended in abortion. [12]\n\nEuthansia: Euthanasia is taking an action to end a person’s suffering by ending their life. It is illegal in most countries but each state has its own laws in the United States. There are two types of euthanasia. Voluntary euthanasia is when the patient gives consent to be euthanized, and involuntary euthanasia is when a third party makes the decision because the patient cannot make that decision for themselves. Voluntary euthanasia is legal in Switzerland, Belgium, Luxembourg, the Netherlands, Oregon, and Washington. Two more categories that euthanasia is placed in are passive and active euthanasia. Active euthanasia is when the patient is given lethal substances or a different action is taken to end their life. Passive euthanasia is when treatments that could sustain the patient’s life are not given to them. [13]\n\nThis video gives a brief summary of eugenics throughout history.", "opengraph": {}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe width=\"560\" height=\"315\" src=\"//www.youtube.com/embed/gWur8Rbc3hc\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "//www.youtube.com/embed/gWur8Rbc3hc"}], "links": ["/File:Eugenics_congress_logo.png", "/File:Eugenics_congress_logo.png", "#cite_note-1", "/Abortion", "/Artificial_selection", "/Species", "/Humans", "/Philosophy", "/Human", "/Species", "#History", "#Problems_with_Eugenics", "#Worldview", "#Modern_Eugenics", "#Video", "#References", "#See_Also", "#cite_note-2", "#cite_note-Genetics-3", "/Charles_Darwin", "#cite_note-Britannica-4", "#cite_note-Genetics-3", "#cite_note-Genetics-3", "/File:Nazi_eugenics.jpg", "/File:Nazi_eugenics.jpg", "/World_War_II", "/Germans", "#cite_note-5", "/Darwinism", "#cite_note-Britannica-4", "#cite_note-loc-6", "#cite_note-loc-6", "/Gregor_Mendel", "#cite_note-nature-7", "#cite_note-8", "/index.php?title=Baby&action=edit&redlink=1", "#cite_note-9", "#cite_note-10", "/Darwin", "/Survival_of_the_fittest", "/index.php?title=Nazis&action=edit&redlink=1", "/index.php?title=Buck_v._Bell&action=edit&redlink=1", "/Vaccination", "/index.php?title=Civic_Biology&action=edit&redlink=1", "/Scopes_trial", "/Hemophilia", "/Down_syndrome", "#cite_note-Genetics-3", "#cite_note-Britannica-4", "#cite_note-Britannica-4", "/File:Baby_10_wks.jpg", "/File:Baby_10_wks.jpg", "#cite_note-11", "#cite_note-12", "/Euthanasia", "#cite_note-13", "/File:Feature_star.jpg", "/Category:Featured_articles", "#cite_ref-1", "http://www.dictionary.com/browse/eugenics", "#cite_ref-2", "https://rationalwiki.org/wiki/Eugenics", "#cite_ref-Genetics_3-0", "#cite_ref-Genetics_3-1", "#cite_ref-Genetics_3-2", "#cite_ref-Genetics_3-3", "http://knowgenetics.org/history-of-eugenics/", "#cite_ref-Britannica_4-0", "#cite_ref-Britannica_4-1", "#cite_ref-Britannica_4-2", "#cite_ref-Britannica_4-3", "https://www.britannica.com/science/eugenics-genetics", "#cite_ref-5", "http://alphahistory.com/nazigermany/nazi-eugenics/", "#cite_ref-loc_6-0", "#cite_ref-loc_6-1", "#cite_ref-nature_7-0", "https://www.nature.com/scitable/topicpage/human-testing-the-eugenics-movement-and-irbs-724", "#cite_ref-8", "https://www.gotquestions.org/eugenics-Bible.html", "#cite_ref-9", "https://www.thoughtco.com/what-does-the-bible-say-about-abortion-4077124", "#cite_ref-10", "http://www.pregnantpause.org/develop/when.htm", "#cite_ref-11", "http://www.johnstonsarchive.net/policy/abortion/abreasons.html", "#cite_ref-12", "http://abort73.com/abortion_facts/us_abortion_statistics/", "#cite_ref-13", "https://www.medicalnewstoday.com/articles/182951.php", "/Social_Darwinism", "/Template:Human_navbox", "/Template_talk:Human_navbox", "http://creationwiki.org/index.php?title=Template:Human_navbox&action=edit", "/Human_biology", "/Human_body", "/Appendix", "/Axial_skeleton", "/Blood", "/Human_brain", "/Cochlea", "/Colon", "/Embryo", "/Human_eye", "/Fetus", "/Heart", "/Kidney", "/Liver", "/Lobes_of_the_brain", "/Lung", "/Mouth", "/Neuron", "/Pancreas", "/Skull", "/Skeletal_muscle", "/Small_intestine", "/Spleen", "/Thyroid", "/Tissue", "/Tonsil", "/Vertebral_column", "/File:9weeks.jpg", "/Biological_system", "/Auditory_system", "/Circulatory_system", "/Digestive_system", "/Endocrine_system", "/Immune_system", "/Integumentary_system", "/Limbic_system", "/Lymphatic_system", "/Muscular_system", "/Nervous_system", "/Olfactory_system", "/Reproductive_system", "/Respiratory_system", "/Sensory_system", "/Human_skeleton", "/Visual_system", "/Medical_science", "/Abortion", "/Acupuncture", "/Anatomy", "/Anesthesiology", "/Chiropractor", "/Dentist", "/Dermatology", "/Disease", "/Epidemiology", "/Fat_reduction_procedures", "/Heart_surgery", "/Homeopathic_medicine", "/Coroner", "/Nursing", "/Obstetrician", "/Occupational_therapy", "/Pediatrician", "/Pharmacology", "/Physical_therapist", "/Physician", "/Physiology", "/Plastic_surgery", "/Radiology", "/Sports_medicine", "/Vision_correction_procedures", "/Anthropology", "/Antediluvian_civilizations", "/Human_longevity", "/Decline_of_humanity", "/DNA_and_Babel", "/Homo_erectus", "/Neanderthal", "/Paleoanthropology", "/Human_migration", "/Human_races", "/Anthropology_quotes", "/File:Creationwiki_portals.png", "/Category:Biology", "/Portal:Biology", "/File:Creationwiki_portals.png"], "authors": [], "publish_date": null}