{"result_id": "084034", "URL": "https://creationwiki.org/Autism", "timestamp": "2023-04-25 14:52:32 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://creationwiki.org/Autism", "encoding": "UTF-8"}, "image": null, "domain": "creationwiki.org", "title": "Autism - CreationWiki, the encyclopedia of creation science", "cleaned_text": "From CreationWiki, the encyclopedia of creation science\n\nAutism exists as a lifelong brain disorder that creates difficulty for patients to understand, communicate, interact, and connect with other individuals. These symptoms, typically begin before a child is three years old. It is a significant part of the ASD's (Autism Spectrum Disorders), also including disorders like Asperger Syndrome and ADHD (Attention deficit hyperactivity disorder). With Autism, different parts of the brain are unable to work together in accord. [1] It is typical for parents to begin noticing odd signs that their child is not developing properly. Lack of eye-contact, excessively focusing in on a single object, difficulty in engaging in social interaction, and slow speech development are all early signs of Autism. Although Autism exists without a cure, various forms of treatment exist in order to help someone with Autism better understand themselves and be successful later on in life. [2] In order to have a successful life while having an ASD, or being close with someone who is diagnosed with the disorder, it is key to understand that it forces one to take a proactive approach. It is important to learn about Autism and everything it entails: symptoms, causes, and treatments, that way one is ready to face the challenges Autism will bring. [3]\n\nThe term 'autism' was first introduced in 1911 by Swiss psychiatrist, Eugen Bleuler. The word 'autism' or 'autistic' comes from the Greek word, 'autos', which means 'self'. Originally, autism was related to schizophrenia, and was described as \"an extreme withdrawal of oneself from the fabric of social life, but not excluding oneself. [4]\n\nTreatment of autism didn't begin until the 1940s, when early-childhood development scientists, Leo Kanner and Hans Asperger, each published accounts of the disorder. Both Kanner and Asperger believed that autistic children suffered from a fundamental disturbance, explaining their highly characteristic problems. Both scientists were in agreement that autism was a disease generated at birth, and that it produced children who were unable to attain normal relationships with people. It wasn't until the mid 1900's that autistic patients weren't institutionalized for their problem.[4]\n\nAutism has a strong genetic basis, although the genetics of autism are complex and it is unclear whether ASD is explained more by multigene interactions or by rare mutations.[5] In rare cases, autism is strongly associated with agents that cause birth defects.[6] Other proposed causes, such as childhood vaccines, are controversial, and the vaccine hypotheses lack any convincing scientific evidence.[7]\n\nAlthough there are no exact causes of autism, many ideas have been both suggested and examined. Despite all the studies, researchers are still unable to come up with an exact cause of Autism and other Autism Spectrum Disorders. It is usually understood that it is the result of deformities in the brain structure or function. [8]\n• Genetic Deficiencies: Scientists have been able to identify several genes connected to Autism. Different studies have shown that people with Autism, typically have irregularities in various areas in the brain. Other studies also suggest that people with the disorder usually possess aberrant levels of serotonin or other neurotransmitters in the brain. The abnormalities with the neurotransmitters support the idea that different Autism Spectrum Disorders might be the outcome of interruption of brain development early on in the fetal development stage. These disruptions could be caused from deficiencies in genes that direct brain growth and development. It is also possible that the deficiencies come from genes which control how the brain cells connect with each other. Although this research is necessary for finding the ultimate cause of Autism, they are still exploratory and demand further research. [3] Various studies have shown that physical deformities in the brain exist in those who have Autism. Typically, the frontal lobes, cerebellum, hippocampus, and amygdala are swollen; however, the corpus collusum is smaller than usual. Axons function to link brain cells together. However, in Autistic individuals, too many axons exist with little linking to different parts of the brain. [9]\n• Emotional Trauma: It has been shown that Autistic individuals are affected more by stressful events than their normal peers. This discovery was first noticed in the early 1970's. However, recently, emotional breakdowns or \"shutdowns\" have been recognized as a result of a stress overload or social pressure. There is no direct link with stress and whether or not it contributes to Autism, however, researchers have shown that it does play a huge role in the Autistic individual's daily life. [9]\n• Vaccines: Since the 2000 decade began, an increase in vaccine research has taken place in vaccines that use thimerosal as a preservative. [9] Thimerosal is an inorganic compound of mercury that is broken down to ethylmercury and thiosalicylate. It has existed since the 1930's, and is used as a preservative to fight against bacteria and fungal contamination. [10] Many parents believe this is to blame for the rapid increase in Autism in young children; mainly because the diagnosis of Autism, is typically around the time the vaccination for the child has taken place. Although many complaints have taken place, the research is inconclusive. However, it was shown that a comparison took place, in which blood mercury levels for Autistic kids were at a ten percent increase, than normal kids of the same age. Although the number, ten percent, seems incredibly large, statistically, it is miniscule. The research is forced to be considered questionable since the research was done to kids who already were diagnosed with the disorder. If the exposure to mercury at a particular stage in a child's life made them more prone to Autism, studying children who are already diagnosed with Autism is really of no help. [9]\n• Parenting: In the 1950's, it was speculated that certain types of parenting could lead to Autism. It was thought that Autism was the result of the flawed environment provided by unloving mothers. This phase lasted until the 1970's when the theory was then discredited, after the realization kicked in that maybe the Autistic child's social deficits were a result of something other than parental flaws. After more research, it was discovered that most of the mothers of Autistic children, tended to be more caring and were extremely loving. Currently, any theories that suggest \"parental faults\" are often found to be offensive, and has lead to a decrease in research for that theory. [9]\n\nIt is common for symptoms to almost always begin before the age of three. Symptoms tend to be noticed when parents begin to note that their child has yet begun to talk and acts differently than other kids their age. It is also common for a child to begin talking at the normal age, but then later on, start to lose their language and speaking skills. The key sign of autism and something most primary caregivers acknowledge is lack of or impaired social interaction. This could start as early as infancy, when a baby might seem unresponsive or tends to steadily focus on one main object for a substantial amount of time. It is possible for a child with Autism to seem normal early on, but as development progresses, withdrawal and alienation to social engagement begins to take place. Young children with autism, might fail to respond to their name and typically avert eye contact. Social interaction for those with any sort of Autism Spectrum Disorder, is very difficult because they usually struggle with deciphering what others might be thinking or feeling. This is the result of being unable to fully understand different social cues. Things like: tone of voice, facial expressions, and lack of eye contact are various social cues that people with autism don't understand. There is a lack of comprehending \"appropriate behavior\". There are challenges in understanding their listener's perspective and viewpoint. [3]\n\nChildren with autism often take part in repetitive movements, such as twirling and rocking their body. Some also engage in self-abusive behavior such as biting themselves and head-banging. It is common for autistic children to develop speaking habits later than other children, and it is typical for them to refer to themselves by their own name, rather than by saying \"I\" or \"Me\". Some even speak with a \"sing-song\" voice and over time, usually develop a script. A script is something like a repeated phrase or a small range of favorite subjects that the child says to others to make themselves more comfortable. When this happens, it is usually displayed with little to no interest in the person they are talking to. [3]\n\nAutism causes difficulty for children in interactive play with other kids their age. [3] Younger children diagnosed with autism, when playing with toys, might possess a tendency to focus on one part of the toy, rather than playing with the toy as a whole. In older children or adults, a preoccupation with certain things is often evident; such as, a fascination for flags, license plates, and mailboxes. A need for consistency and routine is crucial to many with autism; an example would be driving the same way to the grocery store every time, or tying the left shoe before the right. [11]\n\nAn early diagnosis and immediate treatment often results in a better outcome for younger children with Autism (depending on the severity of the case). Treatment helps encourages individuals with Autism to grow and develop to the best of their abilities. The main purpose of treatment is to better the child's ability to function in every aspect of life. [11] Various types of treatment exist for those with Autism Spectrum Disorders. Depending on the symptoms, behavior, and severity of the disorder, and also considering that symptoms and behavior is susceptible to change over time, personalized treatment strategies are created. These are designed to fit each child's individual needs and family's resources. However, as a whole, young children with autism react positively to very detailed and structured treatment. There are various kinds of specialized therapies that exist for children with ASD. Treatments like speech, physical, and occupational therapy being the most prominent. [11] Other remedies such as ABA (Applied Behavior Analysis Training), RDI (Relationship Development Intervention), and Natural therapies are more uncommon. However, ABA and RDI are often used in the Occupational therapy treatment. [12]\n\nOccupational Therapy is considered expert treatment that assists individuals obtain independence in all areas of their lives. It helps people who suffer from a variety of disorders, develop the necessary skills for living independently, to some degree. Individuals with autism see occupational therapists for several different reasons. In the 1900's, occupational therapists taught children, even adults, with autism to learn how to properly button a shirt, learn handwriting, tie their shoes, etc. However, today, the range for occupational therapy for Autism Spectrum Disorders, has widened, including areas such as: sensory integration, which is the ability to process information by means of their senses, social skills, interaction skills with their peers, and more. [13] In result of individuals with autism lacking social and interaction skills, OT's spend a lot of time on techniques that involve personal skills, social and interaction skills, and most importantly the ability to be independent. The OT's create purposeful scenarios in which the child can accordingly respond to the situation by using their senses. This type of activity is called \"intervention\". These interventions can exist as things like, swinging, brushing hair, playing with toys, light sport activity, and so on. These activities are geared for helping an Autistic individual better control his or her body in different areas. [13] OT's typically create and facilitate different activities of play that assist the child in their interactive and communication skills with others. Specifically for OT's specialized in Autism, this can lead to official and structured play activities, called Floortime. This was created to better intellectual, emotional, and physical skills for individuals diagnosed with autism. The OT is also responsible for creating slight challenges or disabilities for the child to encounter, to help them improve in their social cues and problem solving abilities.[13]\n\nThis video is an example of structured play activity, called Floortime.\n\nA recent study, done by Eastern Virginia Medical School, has shown that perhaps a major advance has taken place in curing forms of ASD. A group of mice that possessed Autism-like symptoms, showed much improvement from the condition after taking a drug, that some scientists have declared safe for humans. Psychiatrist Maria R. Urbano said, \"You might have some one with a 125 or 130 I.Q. who’s un employable”\" in result of their misfortunate social flaws. Another Psychiatrist, Stephen I. Deutsch, explained that individuals with any form of ASD's, appear disinterested or dread any kind of social interaction. This comes from being unable to fully understand or comprehend other's feelings, thoughts, and emotions. It is also common to miss important social cues. Today, the numbers rise as Autism in young children begin to steadily increase. Around 1.5 million Americans are diagnosed with a form of ASD. [14]\n\n In this new study, both psychiatrists and a group of colleagues, dived into research and did confirm that a mouse group, known as BALB/c is an animal model that mirrors the limits in social interactions in individuals with Autism. The research showed that if blended with other normal mice, the BALB/c mice, would tend to draw away and did not interact with any of the other mice. Scientists were investigating if they were to add a specific drug in the mice's diet, it could possibly change specific receptors in the brain. The medication that was studied, was D-Cycloserine; a drug that was first created to try and cure tuberculosis. In the studies at Eastern Virginia Medical School, the medication was shown to help alleviate some of the sociability impairments. Leading scientists plan to start a clinical trial using D-Cycloserine on young children and adults who have a diagnosis of Autism. [14]\n• None Autistic children are often given care and taught by trained therapists and teachers.\n• None Reports of Autism have increased significantly from 1996 to 2007.\n• Unknown Author, National Institute of Neurological Disorders and Stroke, Last updated May 14, 2010. Autism Fact Sheet Unknown Author, National Institute of Neurological Disorders and Stroke, Last updated May 14, 2010.\n• Abrahams BS, Geschwind DH (2008). \"Advances in autism genetics: on the threshold of a new neurobiology\". Nat Rev Genet 9 (5): 341–55.\n• Rutter M (2005). \"Incidence of autism spectrum disorders: changes over time and their meaning\". Acta Paediatr 94 (1): 2–15.\n• By www.autism-society.org What Causes Autism By www.autism-society.org\n• By www.autism-help.org Causes of Autism By www.autism-help.org\n• By Author unknown, www.healthy-lifestyle.com Treatment and Therapies for Autism By Author unknown, www.healthy-lifestyle.com\n• By Eastern Virginia Medical School, world-science.net, December 9, 2010. Safe drug touted as able to cure “Rain Man”-like mice By Eastern Virginia Medical School, world-science.net, December 9, 2010.\n• Autism Information Center Centers for Disease and Control Prevention, Department of Health and Human Services, April 2008.\n• Autism History and Statistics The Autism Spectrum, Office of Special Education Programs, July 2000\n• U.S. Court of Federal Claims. Autism Decisions and Background Information.\n• Dan Childs (ABC News Medical Unit). Ruling Won't End Autism Debate, Groups Pledge: Medical Experts Overwhelmingly Applaud Ruling; Autism Advocacy Groups Say Legal Battle Not Over. ABC News, Feb. 13, 2009.", "opengraph": {}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe width=\"560\" height=\"315\" src=\"//www.youtube.com/embed/8LUvfWmL1kU\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "//www.youtube.com/embed/8LUvfWmL1kU"}], "links": ["/File:Autism3.jpg", "/File:Autism3.jpg", "/Brain_disorder", "/Asperger_Syndrome", "/Brain", "#cite_note-Autism9-1", "#cite_note-autism10-2", "#cite_note-autism2-3", "#History", "#Causes", "#Symptoms", "#Treatment", "#Occupational_Therapy", "#In_the_News", "#Gallery", "#References", "#Additional_Information", "/File:Bleuler05.jpg", "/File:Bleuler05.jpg", "#cite_note-history-4", "#cite_note-history-4", "http://en.wikipedia.org/wiki/Heritability_of_autism", "#cite_note-5", "http://en.wikipedia.org/wiki/Teratology", "#cite_note-6", "#cite_note-7", "/File:Autism1.jpg", "/File:Autism1.jpg", "/Brain", "#cite_note-autism-8", "/Genes", "/Genes", "#cite_note-autism2-3", "/index.php?title=Frontal_lobes&action=edit&redlink=1", "/index.php?title=Cerebellum&action=edit&redlink=1", "/Hippocampus", "/index.php?title=Corpus_collusum&action=edit&redlink=1", "#cite_note-autism4-9", "#cite_note-autism4-9", "/Vaccine", "#cite_note-autism4-9", "/Inorganic_compound", "/Mercury", "/Bacteria", "#cite_note-autism5-10", "/Vaccination", "/Blood", "/Mercury", "/Mercury", "#cite_note-autism4-9", "#cite_note-autism4-9", "/Symptoms", "/Eye", "#cite_note-autism2-3", "#cite_note-autism2-3", "#cite_note-autism2-3", "#cite_note-autism3-11", "/File:AutismKidsCamp.jpg", "/File:AutismKidsCamp.jpg", "#cite_note-autism3-11", "#cite_note-autism3-11", "#cite_note-autism7-12", "/Occupational_Therapy", "#cite_note-autism6-13", "/Hair", "#cite_note-autism6-13", "#cite_note-autism6-13", "/Humans", "#cite_note-autism8-14", "#cite_note-autism8-14", "/File:000NSCS_Elem_2008_322.jpg", "/File:Autismchart.jpg", "/File:US-autism-6-17-1996-2007.png", "#cite_ref-Autism9_1-0", "http://www.webmd.com/brain/autism/autism-topic-overview", "#cite_ref-autism10_2-0", "http://www.annualreviews.org/doi/abs/10.1146/annurev.publhealth.28.021406.144007", "http://www.annualreviews.com", "#cite_ref-autism2_3-0", "#cite_ref-autism2_3-1", "#cite_ref-autism2_3-2", "#cite_ref-autism2_3-3", "#cite_ref-autism2_3-4", "http://www.ninds.nih.gov/disorders/autism/detail_autism.htm#155623082", "#cite_ref-history_4-0", "#cite_ref-history_4-1", "http://stevens_mom.tripod.com/id49.html", "#cite_ref-5", "#cite_ref-6", "#cite_ref-7", "#cite_ref-autism_8-0", "http://www.autism-society.org/site/PageServer?pagename=about_whatcauses", "#cite_ref-autism4_9-0", "#cite_ref-autism4_9-1", "#cite_ref-autism4_9-2", "#cite_ref-autism4_9-3", "#cite_ref-autism4_9-4", "http://www.autism-help.org/autism-causes.htm", "#cite_ref-autism5_10-0", "http://www.nationalautismassociation.org/thimerosal.php", "#cite_ref-autism3_11-0", "#cite_ref-autism3_11-1", "#cite_ref-autism3_11-2", "http://www.webmd.com/brain/autism/autism-symptoms", "#cite_ref-autism7_12-0", "http://healthy-lifestyle.most-effective-solution.com/2010/10/10/treatment-and-therapies-for-autism/", "#cite_ref-autism6_13-0", "#cite_ref-autism6_13-1", "#cite_ref-autism6_13-2", "http://autism.about.com/od/whatisautism/a/OTBasics.htm", "#cite_ref-autism8_14-0", "#cite_ref-autism8_14-1", "http://www.world-science.net/othernews/101209_autism.htm", "http://en.wikipedia.org/wiki/Autism", "http://www.ninds.nih.gov/disorders/autism/detail_autism.htm", "http://www.autism.com/", "http://www.cdc.gov/ncbddd/autism/", "http://autism.about.com/od/whatisautism/p/autismcauses.htm", "http://stevens_mom.tripod.com/id49.html", "http://www.maapservices.org/", "http://images.google.com/imgres?imgurl=http://stgabss.net/SpecialNeeds/images/stories/SNinDEPTH/autism/hans%2520asperger.jpg&imgrefurl=http://stgabss.net/SpecialNeeds/index.php/learning-disabilities/autism.html%3Fshowall%3D1&usg=__WmoTh3I4Q0lu82YdKSTVPTHtNVs=&h=255&w=165&sz=14&hl=en&start=1&um=1&tbnid=yV64LFKzAEUihM:&tbnh=111&tbnw=72&prev=/images%3Fq%3Dhans%2Basperger%2Bgov%26um%3D1%26hl%3Den%26rlz%3D1G1GGLQ_ENUS306%26sa%3DG", "http://www.uscfc.uscourts.gov/node/5026", "http://abcnews.go.com/Health/AutismNews/story?id=6866077&page=1", "/Template:Human_navbox", "/Template_talk:Human_navbox", "https://creationwiki.org/index.php?title=Template:Human_navbox&action=edit", "/Human_biology", "/Human_body", "/Appendix", "/Axial_skeleton", "/Blood", "/Human_brain", "/Cochlea", "/Colon", "/Embryo", "/Human_eye", "/Fetus", "/Heart", "/Kidney", "/Liver", "/Lobes_of_the_brain", "/Lung", "/Mouth", "/Neuron", "/Pancreas", "/Skull", "/Skeletal_muscle", "/Small_intestine", "/Spleen", "/Thyroid", "/Tissue", "/Tonsil", "/Vertebral_column", "/File:9weeks.jpg", "/Biological_system", "/Auditory_system", "/Circulatory_system", "/Digestive_system", "/Endocrine_system", "/Immune_system", "/Integumentary_system", "/Limbic_system", "/Lymphatic_system", "/Muscular_system", "/Nervous_system", "/Olfactory_system", "/Reproductive_system", "/Respiratory_system", "/Sensory_system", "/Human_skeleton", "/Visual_system", "/Medical_science", "/Abortion", "/Acupuncture", "/Anatomy", "/Anesthesiology", "/Chiropractor", "/Dentist", "/Dermatology", "/Disease", "/Epidemiology", "/Fat_reduction_procedures", "/Heart_surgery", "/Homeopathic_medicine", "/Coroner", "/Nursing", "/Obstetrician", "/Occupational_therapy", "/Pediatrician", "/Pharmacology", "/Physical_therapist", "/Physician", "/Physiology", "/Plastic_surgery", "/Radiology", "/Sports_medicine", "/Vision_correction_procedures", "/Anthropology", "/Antediluvian_civilizations", "/Human_longevity", "/Decline_of_humanity", "/DNA_and_Babel", "/Homo_erectus", "/Neanderthal", "/Paleoanthropology", "/Human_migration", "/Human_races", "/Anthropology_quotes", "/File:Creationwiki_portals.png", "/Category:Biology", "/Portal:Biology", "/File:Creationwiki_portals.png"], "authors": [], "publish_date": null}