{"result_id": "084027", "URL": "https://creationwiki.org/Scott_Minnich", "timestamp": "2023-04-25 14:52:23 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://creationwiki.org/Scott_Minnich", "encoding": "UTF-8"}, "image": null, "domain": "creationwiki.org", "title": "Scott Minnich - CreationWiki, the encyclopedia of creation science", "cleaned_text": "From CreationWiki, the encyclopedia of creation science\n\nScott A. Minnich is an associate professor of microbiology at the University of Idaho[1], and a fellow at the Discovery Institute's Center for Science and Culture[2]. Minnich has a Bachelor of Science degree in Bacteriology and Public Health from Washington State University (1975), a Masters degree in Microbiology from the University of Idaho, and a Ph.D. in Microbiology from Iowa State University in 1981.\n\nMinnich is a proponent of intelligent design. Minnich supports Michael Behe's thesis of \"irreducible complexity\" in bacterial flagella as evidence of intelligent design. Minnich's research interests are temperature regulation of Yersinia enterocolitica gene expression and coordinate reciprocal expression of flagellar and virulence genes. He also focus on bacterial pathogenesis of Yersinia pestis, etiologic agents of bubonic plague[1].\n• Explore Evolution: The Arguments For and Against Neo-Darwinism. Malvern, Victoria: Hill House Publishers. p. 128-139. 978-0-947352-41-6.\n• Dustin J. Van Hofwegen, Carolyn J. Hovde, and Scott A. Minnich. 2015. Rapid evolution of citrate utilization by Escherichia coli K12 by direct selection requires citT and dctA. J. of Bacteriol. (provisionally accepted pending additional experiment)\n• Haiqing Sheng, Smriti Shringi, Katherine N. K. Baker, Scott A. Minnich, Carolyn J. Hovde, Thomas E. Besser. 2015. Standardized Escherichia coli O157:H7 Exposure studies in cattle provide evidence that bovine factors do not drive increased summertime colonization. Appl. Environ. Micobiol. (in press).\n• Kolodziejek AM, Caplan AB, Bohach GA, Paszczynski AJ, Minnich SA, Hovde CJ. 2013. Physiological levels of glucose induce membrane vesicle secretion and affect the lipid and protein composition of Yersinia pestis cell surfaces. Appl Environ Microbiol. 79(14):4509-14.\n• Seo K. S., J. W. Kim, J. Y. Park, A. K. Viall, S.S. Minnich, H. N. Rohde, D. R. Schnider, S. Y. Lim, J. B. Hong, B. J. Hinnebusch, J. L. O’Loughlin, G. A. Bohach, C. J. Hovde, S. A. Minnich. 2012. The role of intimin/invasin-like protein (Ilp) in Yersinia pestis virulence. Infect. Immun. 80(10):3559-69.\n• Sheng, H H, J Wang, JY Lim, C Davitt, and SA Minnich, CJ Hovde. 2011. Internalization of Escherichia coli O157:H7 by bovine rectal epithelial cells. Frontiers Microbiol. 2:32.doi:10.3389/fmicb.2011.00032. PMCID 3109292\n• Kolodziejek, A. M., Schnider, D. R., Rohde, N.H., Wojtowicz, A. J., Bohach, G. A., Minnich, S.A., and Hovde, C. J. (2010). Outer membrane protein X (Ail) contributes to Yersinia pestis virulence in pneumonic plague and its activity is dependent on the lipopolysaccharide core length. Infect Immun. 78:5233-5243.\n• Spinner, J.L., Seo, K.S., O’Loughlin, J.L., Cundiff, J.A., Minnich, S. A., Bohach, G.A., and Kobayashi, S. D. (2010). Neutrophils are resistant to Yersinia YopJ/P-induced apoptosis and are protected from ROS-mediated cell death by the type III secretion system. PLoS One. 5:e9279.\n• Larson, C.L. Christensen, J.E., Pacheco, S.A., Minnich, S.A., and M.E. Konkel (2008) Campylobacter jejuni secretes proteins via the flagellar type III secretion system that contribute to host cell invasion and gastroenteritis. In: Campylobacter 3rd Ed. Eds. Nachamkin et al., ASM Press, Washington, DC\n• Airhart, C. L., H. N. Rohde, G. A. Bohach, C. J. Hovde, C. F. Deobald, S. S. Lee & S. A. Minnich, (2008a) Induction of innate immunity by lipid A mimetics increases survival from pneumonic plague. Microbiology 154: 2131-2138.\n• Airhart, C. L., H. N. Rohde, C. J. Hovde, G. A. Bohach, C. F. Deobald, S. S. Lee & S. A. Minnich, (2008b) Lipid A mimetics are potent adjuvants for an intranasal pneumonic plague vaccine. Vaccine 26: 5554-5561.\n• Sheng, H., J. Y. Lim, M. K. Watkins, S. A. Minnich & C. J. Hovde, (2008) Characterization of an Escherichia coli O157:H7 O-antigen deletion mutant and effect of the deletion on bacterial persistence in the mouse intestine and colonization at the bovine terminal rectal mucosa. Appl Environ Microbiol 74: 5015-5022.\n• Kolodziejek, A. M., D. J. Sinclair, K. S. Seo, D. R. Schnider, C. F. Deobald, H. N. Rohde, A. K. Viall, S. S. Minnich, C. J. Hovde, S. A. Minnich & G. A. Bohach, (2007) Phenotypic characterization of OmpX, an Ail homologue of Yersinia pestis KIM. Microbiology 153: 2941-2951.\n• Minnich, S. A. & H. N. Rohde, (2007) A rationale for repression and/or loss of motility by pathogenic Yersinia in the mammalian host. Adv Exp Med Biol 603: 298-310.\n• Dobbin, H. S., C. J. Hovde, C. J. Williams & S. A. Minnich, (2006) The Escherichia coli O157 flagellar regulatory gene flhC and not the flagellin gene fliC impacts colonization of cattle. Infect Immun 74: 2894-2905.\n• V. Kapatral , J. W. Campbell, S. A. Minnich, N. R. Thomson, P. Matsumura and B. M. Pruess. 2004. Gene array analysis of Yersinia enterocolitica FlhD and FlhC: regulation of enzymes affecting synthesis and degradation of carbamoylphosphate. Microbiology 150: p. 2289-2300.\n• Monday S.R., Minnich S.A., Feng PC. 2004. A 12-base-pair deletion in the flagellar master control gene flhC causes nonmotility of the pathogenic German sorbitol-fermenting Escherichia coli O157:H-strains. J Bacteriol. 186:2319-2327.\n• Yoon J.W., Minnich S.A., Ahn J.S., Park Y.H., Paszczynski A., Hovde C.J. 2004. Thermoregulation of the Escherichia coli O157:H7 pO157 ecf operon and lipid A myristoyl transferase activity involves intrinsically curved DNA. Mol. Microbiol. 51:419-435.\n• Ely B., Ely T.W, Crymes W.B. Jr, Minnich S.A. 2000. A family of six flagellin genes contributes to the Caulobacter crescentus flagellar filament. J. Bacteriol. 182:5001-5004.\n• Rohde J.R., Luan X.S., Rohde H., Fox J.M., Minnich S.A. 1999. The Yersinia enterocolitica pYV virulence plasmid contains multiple intrinsic DNA bends which melt at 37 degrees C. J Bacteriol 181:4198-4204.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/Microbiology", "#cite_note-sm-1", "/Discovery_Institute", "#cite_note-2", "#Work", "#Contact_Information", "#Publications", "#External_links", "#References", "/Intelligent_design", "/Michael_Behe", "/Irreducible_complexity", "/Flagellum", "/Intelligent_design", "#cite_note-sm-1", "mailto:sminnich@uidaho.edu", "/Special:BookSources/978-0-947352-41-6", "/International_Standard_Book_Number", "/Icons_of_Evolution", "/Unlocking_the_Mystery_of_Life", "/The_Case_for_a_Creator", "http://web.archive.org/web/20050215181454/http://www.id.ucsb.edu/veritas/2003F/minnich.html", "http://lclane2.net/minnich.html", "http://sfs.wsu.edu/personnel/faculty-staff/minnich-s/", "http://www.discovery.org/p/90", "#cite_ref-sm_1-0", "#cite_ref-sm_1-1", "http://sfs.wsu.edu/personnel/faculty-staff/minnich-s/", "http://sfs.wsu.edu/personnel/faculty-staff/minnich-s/", "#cite_ref-2", "http://www.discovery.org/p/90", "http://www.discovery.org/p/90", "/Template:Biography_navbox", "/Template_talk:Biography_navbox", "https://www.en.creationwiki.org/index.php?title=Template:Biography_navbox&action=edit", "/Portal:Biography", "/Worldview", "/Anticreation#Notable_anticreationists", "/Apologist#Notable_apologists", "/Christian_apologetics#Notable_apologists", "/Creationist", "/Evolutionist", "/Intelligent_design#Theorists", "/Category:Historical_creationist", "/Category:Historical_evolutionist", "/Philosopher", "/Christian_theology#Notable_theologians", "/File:People.png", "/Scientist", "/Biblical_Archaeology#Archaeologist", "/Astronomy#Astronomers", "/Category:Biologist", "/Category:Chemist", "/Creation_scientist", "/Category:Engineer", "/Category:Geneticist", "/Category:Geologist", "/Historical_creation_scientist", "/Category:Mathematician", "/Category:Paleontologist", "/Category:Physician", "/Category:Physicist", "/Bible_character", "/Category:Angel", "/Category:Apostle", "/Category:Biblical_king", "/Category:Church_father", "/Disciple#Disciples", "/Category:Doctor_of_the_Church", "/Category:High_priest", "/Category:Israelite", "/Jesus_Christ", "/Biblical_judge#Judges", "/Levite#Levites", "/Category:New_Testament_person", "/Category:Old_Testament_person", "/Category:Patriarch", "/Category:Saint", "/File:Creationwiki_portals.png", "/Category:Biography", "/Portal:Biography", "/File:Creationwiki_portals.png"], "authors": [], "publish_date": null}