{"result_id": "084036", "URL": "https://creationwiki.org/Biopharming", "timestamp": "2023-04-25 14:52:35 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://creationwiki.org/Biopharming", "encoding": "UTF-8"}, "image": null, "domain": "creationwiki.org", "title": "Biopharming - CreationWiki, the encyclopedia of creation science", "cleaned_text": "From CreationWiki, the encyclopedia of creation science\n\nBiopharming is the harvesting of specific bioactive molecules from organisms and crops that are mass-cultured. Biopharming is also known as molecular farming, the use as the ingredients in a variety of industrial products and pharmaceuticals. In the USA tobacco, corn, and rice are grown for pharmaceutical production. In Canada the crops that are being manufactured for the public are corm, sugar beets, canola, and soy beans.\n\nBiopharming is not a new concept. For a while now, antibiotics and enzymes, by the industry, are being extracted from mass cultured micro-organisms. There are a variety of drugs that are obtained from cultivated or wild non-edible plants; such as: opium, alkaloids, digioxin, rauvolfin, reseroine, vincristine, placitaxel, campthothcin, etc. Bioactive compounds, for example, piperine, curcumin, papain, bromelin, etc., are some that are being extracted from cultivated edible plants. Biopharming nowadays is different from the conventional practices for deploying genetically engineered transgenic crop plants and domesticated animals. Modern biopharming has an important advantage, now that vaccines and antibodies are able to be produced in crop plants, without having to use embryonate eggs and cell cultures. [1]\n\n\n\n The biopharming era began in 1982, with the release of the first transgenic drug, insulin. From then biotechnology has impacted the production of therapeutic proteins, which results in a significant amount of the biologically-derived drugs. Currently there are 84 biopharmaceuticals that are on the market; which serve around 60 million patients worldwide.[2]\n\n\n\n Over the last two decades, the drug development process, within the pharmaceutical industry, has experienced a large transformation; due to advances in biotechnology. Biotechnology was a key factor in the process of expanding the large-molecule drugs, not the small-molecule drugs that are manufactured by the process of chemical synthesis. There are drugs that are known as biologics, which include any protein, virus, vaccine, therapeutic serum, and blood component. Scientist are going beyond the the simple ting they would make before and are now biopharmaceuticals are being used for genetically engineered proteins, that target major illnesses: cancer, cardiovascular, and infectious diseases; all needed for expanding the aging population. [3] The development of drugs from by using natural resources demands phytochemical, pharmacological, and clinical research on the medicinal plants, in order to verify the efficacy of the indicated traditional uses. This development is also needed to build up the public's confidence and promote global acceptance for medicines from plants.[4]\n\nPros and cons for using plants\n\nAnti-cancer Drugs From plants Available across the counter are a number of anti-cancer plant drugs, and are currently in clinical use. The most significantly important species of these plants are the Catharanthus roseus, which provides the drugs vincristine, vindesine and vinblastine are used to fight against solid and hematological malignancies. [4]\n\n\n\n Diagnostic chemicals from plants Lectin is a plant that is used as a diagnostic chemical, for typing human and animal blood. Certain plant lectins are specific to a human tissue and are useful for an early diagnosis of organ specific cancers. For example there are: Ricin, used to diagnose cervical cancer; the horse gram lectin, used to diagnose lung, prostate, and endometrial cancers; and pea nut lectin, used for colon cancer; etc. [4]\n\n\n\n Guarantee of Contamination Field growing conditions, make it impossible, for there to be 100% guarantee of zero contamination; specifically corn or rice crops. [2] There are people warning these scientist saying that the GM crops that contain transgenes for bioactive or toxic substances, have the possibility of contaminating the human food supply through the dispersal of seeds or pollen. These crops can also be posing a risk towards the useful insects, honeybees, that are consuming the pollen from those plants, and the wildlife that are eating the corn or other engineered crops.[5]\n\nBiopharming beings manufacturing from the energy the sun provides. The genes can be put into the cells of the plant, such as, tobacco, corn, and alfalfa, and the plant will do all the hard work transcribing and folding the protein. They do all of that by using the Earth's natural materials-- water, carbon dioxide, and soil. These plants are also able to be grown in large fields, which offer a much larger volume of the product that a constricted field of plants would. [6] An approach to biopharming is using a gene of a desired protein and inserting it into the DNA of the chloroplasts, the membrane-bound organelles the contain chlorophyll. The chloroplasts have their own number of genes that differs from the main genome in the cell nucleus. The leaves in higher plants have cells with as many as 100 chloroplasts, and each one of them contains around 100 copies of the genome. Because of that, when inserting a trangene into the chloroplast genome, the person is able to greatly amplify that gene and be able to produce a large quantity of the corresponding protein. [7]", "opengraph": {}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe width=\"560\" height=\"315\" src=\"//www.youtube.com/embed/Xqlyxf7GUI4\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "//www.youtube.com/embed/Xqlyxf7GUI4"}], "links": ["#History", "#Pros_and_cons_for_using_plants", "#Process", "#Video", "#References", "/index.php?title=Opium&action=edit&redlink=1", "/index.php?title=Alkaloids&action=edit&redlink=1", "/index.php?title=Digioxin&action=edit&redlink=1", "/index.php?title=Rauvolfin&action=edit&redlink=1", "/index.php?title=Reseroine&action=edit&redlink=1", "/index.php?title=Vincristine&action=edit&redlink=1", "/index.php?title=Placitaxel&action=edit&redlink=1", "/index.php?title=Campthothcin&action=edit&redlink=1", "/index.php?title=Bioactive&action=edit&redlink=1", "/index.php?title=Piperine&action=edit&redlink=1", "/index.php?title=Curcumin&action=edit&redlink=1", "/index.php?title=Papain&action=edit&redlink=1", "/index.php?title=Bromelin&action=edit&redlink=1", "#cite_note-1", "/Insulin", "#cite_note-AgBioForum-2", "/index.php?title=Pharmaceutical&action=edit&redlink=1", "/Biotechnology", "/Protein", "/Virus", "/Vaccine", "/index.php?title=Therapeutic_serum&action=edit&redlink=1", "/index.php?title=Blood_component&action=edit&redlink=1", "/Cardiovascular", "#cite_note-3", "/index.php?title=Phytochemical&action=edit&redlink=1", "/index.php?title=Pharmacological&action=edit&redlink=1", "#cite_note-FoundationforBiotechnologyAwarenessandEducation-4", "/index.php?title=Catharanthus_roseus&action=edit&redlink=1", "/index.php?title=Vincristine&action=edit&redlink=1", "/index.php?title=Vindesine&action=edit&redlink=1", "/index.php?title=Vinblastine&action=edit&redlink=1", "#cite_note-FoundationforBiotechnologyAwarenessandEducation-4", "/Ricin", "/Cancers", "#cite_note-FoundationforBiotechnologyAwarenessandEducation-4", "/Corn", "/Rice", "#cite_note-AgBioForum-2", "/Toxic", "/Seeds", "/Pollen", "/Honeybees", "#cite_note-5", "/Energy", "/Sun", "/Tobacco", "/Corn", "/index.php?title=Alfalfa&action=edit&redlink=1", "/Water", "/Carbon_dioxide", "/Soil", "#cite_note-6", "/DNA", "#cite_note-7", "#cite_ref-1", "http://www.plantbiotechnology.org.in/issue7.html", "#cite_ref-AgBioForum_2-0", "#cite_ref-AgBioForum_2-1", "http://www.agbioforum.org/v8n1/v8n1a03-elbehri.htm", "#cite_ref-3", "http://www.agbioforum.org/v8n1/v8n1a03-elbehri.htm", "#cite_ref-FoundationforBiotechnologyAwarenessandEducation_4-0", "#cite_ref-FoundationforBiotechnologyAwarenessandEducation_4-1", "#cite_ref-FoundationforBiotechnologyAwarenessandEducation_4-2", "http://www.plantbiotechnology.org.in/issue7.html", "#cite_ref-5", "http://fas.org/biosecurity/education/dualuse-agriculture/2.-agricultural-biotechnology/potential-risks-of-biopharming-in-plants.html", "#cite_ref-6", "http://www.the-scientist.com/?articles.view/articleNo/29229/title/Botanical-Biopharming/", "#cite_ref-7", "http://fas.org/biosecurity/education/dualuse-agriculture/2.-agricultural-biotechnology/potential-risks-of-biopharming-in-plants.html", "/Template:Biology_navbox", "/Template_talk:Biology_navbox", "https://creationwiki.org/index.php?title=Template:Biology_navbox&action=edit", "/Biology", "/Organisms", "/Animal", "/Algae", "/Amphibian", "/Bacteria", "/Bird", "/Created_kind", "/Crustaceans", "/Dinosaur", "/Fish", "/Fungi", "/Human", "/Insect", "/Mollusk", "/Plant", "/Protist", "/Reptiles", "/File:Animal_diversity.jpg", "/Biological_scientist", "/Agriculture", "/Anatomy", "/Baraminology", "/Biologist", "/Biotechnology", "/Botany", "/Cell_biology", "/Ecology", "/Epidemiology", "/Embryology", "/Entomology", "/Biological_evolution", "/Genetics", "/Herpetology", "/Human_biology", "/Medicine", "/Microscopy", "/Physiology", "/Taxonomy", "/Virology", "/Zoology", "/Biological_system", "/Auditory_system", "/Circulatory_system", "/Digestive_system", "/Endocrine_system", "/Immune_system", "/Integumentary_system", "/Limbic_system", "/Lymphatic_system", "/Muscular_system", "/Nervous_system", "/Olfactory_system", "/Reproductive_system", "/Respiratory_system", "/Sensory_system", "/Skeletal_system", "/Visual_system", "/Biological_process", "/Aging", "/Cell_division", "/Cellular_respiration", "/Disease", "/Embryogenesis", "/Gene_expression", "/Metabolism", "/Metamorphosis", "/Parasitism", "/Photosynthesis", "/Pregnancy", "/Protein_synthesis", "/Reproduction", "/Symbiosis", "/Trophic_level", "/File:Creationwiki_portals.png", "/Category:Biology", "/Portal:Biology", "/Biology_news_archive", "/File:Creationwiki_portals.png"], "authors": [], "publish_date": null}