{"result_id": "084038", "URL": "http://creationwiki.org/Hepatitis_B", "timestamp": "2023-04-25 14:52:38 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "http://creationwiki.org/Hepatitis_B", "encoding": "UTF-8"}, "image": null, "domain": "creationwiki.org", "title": "Hepatitis B - CreationWiki, the encyclopedia of creation science", "cleaned_text": "From CreationWiki, the encyclopedia of creation science\n\nHepatitis B, also called HBV, is a disease known for affecting the liver. It is known for scarring the liver tissue and even cancer. The disease is spread from the bodily fluids of those who are infected, but can be prevented and treated with vaccinations. In the United States, over 800,000 people are estimated to be infected by hepatitis B and 2,000 to 4,000 people are killed by the disease. However, since the vaccines are fairly new, the infections have reduced since 1991. [1]\n\nThere are numerous ways in which hepatitis can be spread from one person to another. A common way that hepatitis B is spread is through sexual contact. Unprotected sex with an infected individual increases the risk of catching the disease. This is because the disease is contained in bodily fluids such as saliva, semen, and vaginal secretions. Another common way hepatitis B can be passed is through the sharing of needles and syringes. Because blood can be infected by the disease, contact with blood is a high risk for anyone who works with blood. When a mother has hepatitis B and gives birth, she may pass the disease on to her baby. The baby, however, can be vaccinated to prevent catching the disease. Under certain circumstances, the risk of passing on or catching hepatitis B may be higher. For instance, homosexual intercourse increases the risks of spreading the disease. Traveling to other parts of the world like Asia, the Pacific Islands, Africa and Eastern Europe also adds on to the risk of receiving the disease. If an individual gets a body piercing or tattoo, the disease may spread to them if the equipment and needles are not sterile or cleaned thoroughly. [2]\n\nHepatitis B usually does not affect those who have the disease at first. They will experience flu-like symptoms, but many patients brush it off, worsening the conditions. Symptoms can vary depending on how long a person has the disease. These symptoms include overall fatigue, lack of appetite, dizziness and vomiting, stomachaches, and dark colored urine. When the conditions of the disease are worse, the dizziness and vomiting are more severe, the yellowing of skin, and the swelling of the stomach. [3]\n\nCirrhosis If anybody has hepatitis B, they may experience numerous complications with their liver. More common for those who have chronic HBV, cirrhosis affects twenty percent of those with the chronic disease. Cirrhosis is the scarring and damage done to the liver over a long period of time. Along with cirrhosis comes fatigue, smaller appetite, loss of weight, irritated skin, the swelling of ankles, and stomach pain. There is not yet a cure for cirrhosis, but there are ways to slow its progression down. If conditions become extreme, a liver transplant may be necessary.\n\nLiver Cancer Those who have cirrhosis have a five percent chance of receiving liver cancer. The symptoms of liver cancer include loss of weight, smaller appetite, feeling ill, and yellow skin and eyes. To treat the cancer, all procedures necessary will occur such as performing a surgery to remove the infected part of the liver.\n\nFulminant Hepatitis B Less than one percent of hepatitis B patients experience fulminant hepatitis B. The immune system attempts to attack the liver, causing brutal damage to it. Those with fulminant hepatitis B might experience confusion, passing out, build up of fluid in the stomach, and the yellowing of skin and eyes. [4]\n\nRecently, vaccines have been created to prevent and even treat hepatitis B. These vaccines are safe and those who receive the vaccinations can not get the disease. They are recommended to all sorts of individuals. Newborn babies and anybody that was not vaccinated at birth can be vaccinated just to prevent any chance of receiving hepatitis B. Those who work in healthcare industries and at mental development centers are recommended to be vaccinated because they might handle blood and work with blood. It is also recommended that men who have sex with other men, individuals with a sex partner who has hepatitis B, and those who have multiple sex partners are vaccinated as well. Lastly, people who inject illegal drugs or share needles and syringes will most likely catch hepatitis B if they have not received a vaccine. In order to prevent hepatitis B, numerous precautions can take place such as knowing whether or not a partner is infected. If a condom is used every time sex occurs, much of the risk of passing the disease is reduced. [5]", "opengraph": {}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe width=\"560\" height=\"315\" src=\"//www.youtube.com/embed/YzrHHTTkLTc\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "//www.youtube.com/embed/YzrHHTTkLTc"}], "links": ["/File:Liver_veins.jpg", "/File:Liver_veins.jpg", "#cite_note-1", "#Causes", "#Symptoms", "#Complications", "#Prevention", "#Video", "#Viral_Diseases", "#References", "/File:Needle.jpeg", "/File:Needle.jpeg", "#cite_note-2", "/File:Yelloweyes1.jpg", "/File:Yelloweyes1.jpg", "#cite_note-3", "/Cirrhosis", "#cite_note-4", "/File:Baby.jpg", "/File:Baby.jpg", "#cite_note-5", "/AIDS", "/Avian_influenza", "/Chickenpox", "/Ebola", "/Gastroenteritis", "/Hepatitis_C", "/Human_papillomavirus", "/Infectious_mononucleosis", "/Influenza", "/Measels", "/Mumps", "/Poliomyelitis", "/Smallpox", "/Swine_influenza", "/Rabies", "/Yellow_fever", "/Template:Viral_disease", "#cite_ref-1", "http://www.adultvaccination.org/vpd/hepb/facts.html/", "#cite_ref-2", "https://www.medicalnewstoday.com/articles/306288.php/", "#cite_ref-3", "http://www.hepb.org/what-is-hepatitis-b/what-is-hepb/symptoms/", "#cite_ref-4", "https://www.nhs.uk/conditions/hepatitis-b/complications/", "#cite_ref-5", "https://www.mayoclinic.org/diseases-conditions/hepatitis-b/symptoms-causes/syc-20366802/", "/Template:Human_navbox", "/Template_talk:Human_navbox", "http://mail.creationwiki.org/index.php?title=Template:Human_navbox&action=edit", "/Human_biology", "/Human_body", "/Appendix", "/Axial_skeleton", "/Blood", "/Human_brain", "/Cochlea", "/Colon", "/Embryo", "/Human_eye", "/Fetus", "/Heart", "/Kidney", "/Liver", "/Lobes_of_the_brain", "/Lung", "/Mouth", "/Neuron", "/Pancreas", "/Skull", "/Skeletal_muscle", "/Small_intestine", "/Spleen", "/Thyroid", "/Tissue", "/Tonsil", "/Vertebral_column", "/File:9weeks.jpg", "/Biological_system", "/Auditory_system", "/Circulatory_system", "/Digestive_system", "/Endocrine_system", "/Immune_system", "/Integumentary_system", "/Limbic_system", "/Lymphatic_system", "/Muscular_system", "/Nervous_system", "/Olfactory_system", "/Reproductive_system", "/Respiratory_system", "/Sensory_system", "/Human_skeleton", "/Visual_system", "/Medical_science", "/Abortion", "/Acupuncture", "/Anatomy", "/Anesthesiology", "/Chiropractor", "/Dentist", "/Dermatology", "/Disease", "/Epidemiology", "/Fat_reduction_procedures", "/Heart_surgery", "/Homeopathic_medicine", "/Coroner", "/Nursing", "/Obstetrician", "/Occupational_therapy", "/Pediatrician", "/Pharmacology", "/Physical_therapist", "/Physician", "/Physiology", "/Plastic_surgery", "/Radiology", "/Sports_medicine", "/Vision_correction_procedures", "/Anthropology", "/Antediluvian_civilizations", "/Human_longevity", "/Decline_of_humanity", "/DNA_and_Babel", "/Homo_erectus", "/Neanderthal", "/Paleoanthropology", "/Human_migration", "/Human_races", "/Anthropology_quotes", "/File:Creationwiki_portals.png", "/Category:Biology", "/Portal:Biology", "/File:Creationwiki_portals.png"], "authors": [], "publish_date": null}