{"result_id": "084015", "URL": "https://creationwiki.org/Lupus", "timestamp": "2023-04-25 14:52:03 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://creationwiki.org/Lupus", "encoding": "UTF-8"}, "image": null, "domain": "creationwiki.org", "title": "Lupus - CreationWiki, the encyclopedia of creation science", "cleaned_text": "From CreationWiki, the encyclopedia of creation science\n\nLupus is a chronic (long-lasting) autoimmune disease. In a healthy immune system, antibodies are produced that fight off foreign particles such as bacteria and viruses. However, in autoimmune diseases like lupus, antibodies are produced that cannot tell the difference between those foreign particles and the healthy tissues of the body (these are called autoantibodies). Therefore, they begin attacking healthy tissue, which causes pain and inflammation in many systems and organs of the body. The joints, skin, heart, lungs, kidneys, eyes, blood, digestive system, and nervous system can all be affected.\n\nThe exact cause of lupus is currently unknown. Researchers are working to learn more about this disease. However, they do know that lupus is much more common among women than among men. Additionally, African American women are the most likely to get lupus, followed by Hispanic, Native American, and Asian women [1]. Since people who develop lupus are usually women between the ages of 15-45 (childbearing age), researchers think the cause may be linked to hormones. However, men and children under 15 have also been diagnosed with lupus [2]. Other possible factors contributing to lupus include genes, environment, and some medications.\n\nGenes: There is not one gene responsible for lupus. Rather, several genes seem to contribute to an increased risk of developing the disease. Doctors believe that people who get lupus usually have a genetic predisposition for the disease. Lupus often runs in families, and people with close relatives who have lupus or another autoimmune disease are at greater risk for developing lupus themselves. However, genes are not the entire cause. Even if a person has an identical twin with lupus, they still only have a 30 to 50 percent chance of getting it [3]. Researchers think that people who are predisposed for lupus may develop lupus only if some other factor triggers the disease.\n\nHormones: Estrogen, although present in men as well as women, is found in much greater quantities in women. Estrogen production is especially high during menstrual periods and pregnancy, and many patients show worsened symptoms during these times, indicating that estrogen may play a role in triggering lupus [4].\n\nEnvironmental Factors: Certain chemical toxins, a person's diet, exposure to ultraviolet light, exhaustion, or infections are all possible contributing factors for lupus [3]. Emotional stress caused by life circumstances such as divorce, illness or death of a loved one, or physical stress, such as that caused by pregnancy, surgery, or giving birth, may also be factors [4].\n\nDrug-Induced Lupus: Certain drugs have been identified as the triggering factor for one form of lupus (drug-induced lupus), which is reversible. The symptoms usually go away when the patient stops taking the medication. The most common drugs that cause lupus are procainamide, hydralazine, isoniazid, penicillin and similar antibiotic drugs, and drugs that increase a persons sensitivity to the sun (including tetracycline drugs and sulfa drugs) [4].\n\nSystemic lupus erythematosus (SLE): SLE is the disease most commonly referred to when people are talking about lupus, as about 70 percent of people diagnosed with lupus have SLE[5]. The word \"systemic\" means that this form of lupus affects all the systems of the body. Symptoms of SLE can be mild or severe in different people. This form of the disease affects people of all ages, but mostly those between 15 and 45 years old. SLE leads to the most serious and potentially fatal complications because it affects several vital organs and body systems. Serious damage to the brain and nervous system, heart, lungs, kidneys, and blood vessels can occur as a result of SLE [1].\n\nDiscoid lupus erythematosus: People who develop the round, raised, scaly discoid lesions have discoid lupus. This form of the disease is limited to the skin and does not affect other body systems, but some people with discoid lupus may develop SLE later in life, and people with SLE can also have rashes as part of their symptoms [6]. Discoid rashes occur mostly on the upper body on the chest, neck, face, and scalp. A malar rash and rashes in the mouth, nose, and throat may also develop. Only about 10 percent of people with lupus have this form [5].\n\nSubacute cutaneous lupus erythematosus: This form is also limited to the skin. Rashes develop after exposure to the sun and do not cause scarring. People with this form often also have SLE or discoid lupus [3].\n\nDrug-induced lupus: Drug-induced lupus is brought on by certain prescription medications (see Causes section) and usually goes away after patients cease using the medication. Symptoms of this form are similar to those of SLE, except that there is rarely any damage to major organs. This form is more common in men than women because men are more likely to be prescribed the medications responsible for drug-induced lupus [4].\n\nNeonatal lupus: Neonatal lupus is a rare form in which newborn babies of mothers with lupus (or sometimes another autoimmune disease like Sjögren’s syndrome) have symptoms of lupus such as skin rashes, liver problems, low blood counts, and heart problems. Researchers believe this form may be caused by the Anti-Ro and Anti-La antibodies. Mothers with these antibodies should be carefully monitored during pregnancy to ensure that the baby is healthy and to detect any complications early on. Most mothers with lupus give birth to normal, healthy babies, and those infants with neonatal lupus tend to lose their symptoms after a few months [1].\n\nMixed Connective Tissue Disease: Doctors use this term to refer to a condition where patients have symptoms of more than one connective tissue disease [5]. This disease is also called overlap disease. Like lupus, it is difficult to diagnose because symptoms of multiple diseases are involved. The diseases usually present with mixed connective tissue disease are lupus, scleroderma, and polymyositis [7].\n\nThe symptoms of lupus vary widely in different people and can range from mild to severe. However, most people suffering from lupus experience long periods of worsened symptoms called \"flares\", followed by periods of remission with lessened symptoms or no symptoms [8]. Arthritis, which causes pain and swelling in the joints, affects most lupus patients. Other common symptoms include a persistent low-grade fever, fatigue, headaches, anemia (low number of red blood cells), weight loss or gain, chest pain, hair loss, fingers turning white or blue in the cold, and skin rashes [8].\n\nSkin rashes may take several forms, including discoid lesions and malar rashes. Discoid lesions are round, raised, and scaly, and they usually lead to scarring. These lesions appear on the upper body and scalp, and expand if left untreated. Discoid lesions on the scalp can cause hair loss by destroying the hair follicles [6]. The malar rash, characteristic of lupus, is a butterfly-shaped rash across the nose and cheeks. Another symptom of lupus is photosensitivity (sensitivity to the sun), and skin exposed to the sun may develop more severe rashes. In lupus, the skin can also be affected by vasculitis (inflammation of the blood vessels). The inflammation results in red welts, bumps, and lesions, and also can cause ulceration in the mucous membranes [6].\n\nOther possible effects of lupus are neurological symptoms, psychiatric symptoms (including psychosis and hallucinations, memory loss, anxiety, and depression), and abnormal blood clotting [9]. Lupus affects many organs and body systems including the kidneys, heart, lungs, circulatory system, and central nervous system. The effects on the body can therefore be very severe, since these systems are so important for overall health. Inflammation in the heart can damage the valves and cause heart murmurs, blood clots, heart failure, and swelling in the tissues around the heart (pericarditis) or, more rarely, in the heart itself (myocarditis). Swelling of the blood vessels has effects throughout the body (including extreme swelling as a result of blood clots) and increases the risk of having a stroke or heart attack [10]. Complications in the kidneys also have severe results as the kidneys are necessary for removing harmful toxins from the body [1].\n\nLupus is difficult to diagnose, in part, because of its rarity; doctors do not often encounter it and so do not recognize its patterns [11]. Patients may appear to recover when in actuality they are in a period of remission. In addition, symptoms vary widely in different people and often mimic those of other diseases and syndromes.\n\nIt may take months or years to identify lupus as the cause of a patient's symptoms. In addition to doing medical tests, doctors also need a thorough account of the patient's medical history and the medical history of close family members. This helps identify flare patterns and determine whether the patient has a genetic predisposition for the disease. There is no single test that can be used to diagnose lupus. However, the American College of Rheumatology has developed 11 criteria to aid doctors in detecting lupus. If a patient has four or more of the following symptoms, there is reason to believe they may have lupus:\n• butterfly-shaped malar rash on the face (covers cheeks and the bridge of the nose)\n• photosensitivity, resulting in rashes after exposure to the sun\n• arthritis in two or more joints\n• swelling around the heart or lungs\n• other positive blood tests, again indicating an autoimmune disease\n\nIf a doctor suspects their patient may have lupus, there are several ways to make further confirmation and eliminate the possibility of other diseases that cause similar symptoms. This is important because the symptoms of lupus are similar to those of other diseases, so much so that lupus has been called \"the great imitator\".\n\nANA Test: Initially, doctors perform an anti-nuclear antibody (ANA) test, which measures the level of antinuclear antibodies (those that attack the cell nucleus) in the patient. This test is effective in determining whether someone could have lupus, since 98 percent of people with lupus have high levels of ANA. However, even with a positive result, more testing is necessary. Around 20 percent of healthy women also have high ANA levels, and a positive result to the ANA test can be due to other autoimmune diseases such as scleroderma, Sjögren's syndrome, or rheumatoid arthritis [12].\n\nAnti-ds DNA test: If the ANA test results are positive, doctors perform other tests for more specific antibodies associated with lupus. One such test is for the presence of anti-double stranded DNA (Anti-ds DNA), usually found only in patients with lupus. The Anti-ds DNA often causes damage to the blood vessels and, when present at high levels, to the kidneys [12].\n\nAnti-Sm antibody test: Anti-Smith antibodies (Anti-Sm antibodies), present in roughly 30 percent of those with lupus, are also tested for. Anti-Sm antibodies, found in the cell nucleus, are present in lupus but usually not in other rheumatic diseases [13].\n\nAnti-RNP test: Antibodies to ribonucleoprotein (Anti-RNP) are found in people with Anti-Sm antibodies, and in high levels they indicate mixed connective tissue disease (MCTD), which has symptoms very like those of lupus [13].\n\nAnti-Ro and Anti-LA tests: Anti-Ro (Anti-SSA) and Anti-La (Anti-SSB) antibodies, which contribute to photosensitivity and skin rashes, often are found in patients with neonatal lupus. These antibodies may also be caused by Sjögren’s syndrome or, rarely, by a form of lupus called Ro lupus [12].\n\nAntiphospholipid antibody tests: Antiphospholipid antibodies are often correlated with blood irregularities such as clots and narrow blood vessels. The two major types doctors test for are anticoagulant antibodies (APL) and anticardiolipin antibodies (ACA). The test for APL antibodies measures the length of time it takes the blood to clot, with a longer-than-normal length of time indicating the presence of APL [12]. To test for ACA antibodies, an ELISA (Enzyme-Linked Immunosorbent Assay) test is administered. Positive results often are because the person has lupus [13].\n\nBesides testing for the presence of certain antibodies, doctors perform laboratory tests to confirm their diagnosis. These tests are also helpful in monitoring symptoms as lupus progresses.\n\nComplete blood count: In a complete blood count, many measurements are taken, including a count of both red and white blood cells and platelets, the amount of hemoglobin in the blood, the amount of blood made up of red blood cells (hematocrit), and the size of the red blood cells (mean corpuscular volume) [14]. Lupus causes a decrease in levels of red blood cells (in 40 percent of lupus patients), white blood cells (in 15 to 20 percent of lupus patients), and platelets (in 25 to 35 percent of lupus patients)[13].\n\nESR test: An erythrocyte sedimentation rate test is a nonspecific test used to measure the amount of inflammation in the body. Doctors usually perform multiple tests over a long period of time to track changes in the level of inflammation in a patient. Factors other than inflammation, such as anemia, pregnancy, infection, and even old age also cause higher ESR levels[14].\n\nUrinalysis: Urinalysis is used to detect substances in the urine indicative of abnormalities in metabolic and kidney functions, which are often caused by lupus. It also aids doctors in monitoring an individual's response to treatment [14].\n\nBlood complement test: Blood complement, a group of blood proteins, is responsible for immune responses that cause inflammation. Low levels of complement, especially the proteins C3 and C4, indicate the presence of disease and often kidney involvement as well. This test is also used to see if a patient is responding well to treatment [13].\n\nBiopsies: A skin biopsy from a discoid rash may also be taken. Doctors perform a lupus band test on the skin sample to look for immunoglobulin G antibodies, which are likely to be present if the patient has lupus [12]. A biopsy may be taken from the kidneys as well as the skin.\n\nX-rays: Doctors wanting to see how the organs are affected can take an x-ray to determine if a patient is suffering from lupus. Lung and heart irregularities common to lupus can be detected with a chest x-ray that will show areas of inflammation due to fluid buildup [8].\n\nSyphilis test: People who have lupus may also test positive for syphilis even though they do not have syphilis (called a false-positive result) due to the presence of anti-phospholipid antibodies in their blood [8].\n\nCurrently, there is no known cure for lupus. Usually, someone with lupus will be treated by their family doctor or by a rheumatologist. Depending on which organs are involved, patients may also see immunologists, nurses, psychologists, nephrologists, cardiologists, hematologists, endocrinologists, dermatologists, and neurologists [1]. Doctors treat the individual symptoms of patients using several medications. The most common drugs for lupus are NSAIDs, antimalarials, corticosteroids, and immunosuppressives.\n\nNonsteroidal Anti-Inflammatory Drugs (NSAIDs): NSAIDs reduce inflammation caused by arthritis and other rheumatic diseases, as well as treat fevers and headaches. They are available over the counter (aspirin, ibuprofen), or by prescription from a doctor [15].\n\nAntimalarials: Antimalarials have been found to help reduce symptoms and prevent flares in people with lupus, even though lupus and malaria are unrelated. These drugs, including hydroxychloroquine (Plaquenil), treat fatigue, skin rashes, and pain and inflammation in the joints. Side effects include upset stomach, muscle weakness, and eye problems. It is important that people taking antimalarials make regular visits to an eye doctor as in some cases these medications may cause damage to the retina of the eye [1][16].\n\nCorticosteroids: Corticosteroids quickly reduce inflammation caused by lupus, but often have severe side effects, such as weakened bones (osteoporosis), weight gain, high blood pressure, diabetes, and increased risk of infections. Patients often take calcium and vitamin D supplements to reduce the risk of osteoporosis. To minimize side effects, doctors prescribe the smallest dose that will have the greatest benefit. Alternatively, doctors may give a patient high doses of corticosteroids over a short period of time to lessen side effects and keep patients from having to go through withdrawal to get off the medication. Corticosteroids are available as oral medications, skin creams, or intravenously [1].\n\nImmunosuppressives: These drugs are used for more serious cases of lupus where the kidneys or central nervous system are affected. Immunosuppressives work to counter overactive immune systems, often by destroying immune cells. Immunosuppressives prescribed for lupus include cyclophosphamide (Cytoxan), mycophenolate mofetil (CellCept), and methotrexate (Rheumatrex, Trexall). These medications can have side effects such as low blood counts, nausea, hair loss, decreased fertility, and an increased risk of infection due to the immune system being suppressed [1][15].\n\nAlternative Treatments: Many patients try nutritional and herbal supplements, chiropractic treatment, homeopathy, acupuncture, meditation, yoga, Tai Chi, naturopathy, and massage therapy to relieve symptoms. Some such practices often provide relief and reduce stress in patients, but their true effectiveness in treating lupus is uncertain because they do not go through the same research and clinical trial methods that conventional medicines do. Some herbal supplements may actually worsen symptoms of lupus or react with a medication, so it is important for people trying alternative methods of treatment to discuss it with their doctors first. These methods should not be used as replacements for prescribed medication [17].\n\nCurrent Research: Current clinical studies are researching better medications to treat and hopefully cure lupus. The drug belimumab (Benlysta) finished a phase 3 clinical trial in July 2009 indicating that it may significantly improve lupus symptoms, and another phase 3 clinical study for it should be completed late in 2009. It works by imitating the function of the body's natural antibodies to aid the immune system [16].\n\nAnother treatment being studied is a stem cell transplant using the patient's own cells. Stem cells are removed from the bone marrow. Immunosuppressive drugs are administered to wipe out the person's dysfunctional immune cells and the stem cells are put back in and allowed to regrow the immune system. This treatment is intended to restart a person's immune system by regrowing healthy immune cells, but it is still highly experimental in regards to lupus. Only those with life-threatening, treatment-resistant lupus are considered for stem cell treatment at this point [16].\n\nLifestyle changes can help reduce lupus symptoms. Staying physically active, maintaining a healthy diet, getting plenty of rest, staying out of the sun, and not smoking are all choices that help manage symptoms.\n\nPhysical activity reduces muscle stiffness, increases flexibility, reduces stress, and keeps the heart and bones healthy and strong. Patients should consult their doctor before starting an exercise program. High impact aerobics may cause extra strain and damage to the joints.\n\nThere is no special diet for lupus, but it is important to maintain a well-balanced diet with plenty of fruits and vegetables. Women with lupus should make sure they get omega-3 fatty acids (found in fish), which have been shown to reduce the risk of heart disease. Also, people with lupus should not eat alfalfa or alfalfa tablets because they have been associated with lupus-like symptoms and lupus flares. Depending on which medication a person is taking, they may need to increase the amount of certain foods or vitamins in their diet as well. For example, as mentioned above, people taking corticosteroids should increase the amount of calcium and vitamin D in their diet to prevent osteoporosis [18].\n\nFatigue is a common and often debilitating symptom in people suffering from lupus. Adequate rest helps counteract feelings of tiredness, and rest is also vital to the healing process.\n\nMany people with lupus experience skin rashes after exposure to ultraviolet light from the sun or sometimes from fluorescent light bulbs. Wearing sunscreen when going outside for more than a few minutes can help reduce rashes, as well as wearing sun-protective clothing such as long-sleeved shirts and wide-brimmed hats. For people who are especially sensitive to light, sun-protective fabric is available to block UV rays, and light shields can be used to cover fluorescent light bulbs [19].\n\nSmoking can impair the body's circulatory system, clog arteries, and increase risk of heart disease, and is especially dangerous for people with lupus. It has also been linked to the development of lupus and other autoimmune diseases.\n\nPeople with lupus should take care when getting a vaccine. Although it is important to protect the immune system from disease, some vaccines use weakened but live viruses that can be very dangerous for someone with a weakened immune system. Some doctors also recommend not getting a vaccine during a lupus flare as this sometimes worsens symptoms. Patients should consult a doctor about which vaccines are safe.\n\nLupus is very difficult for people with severe symptoms and they are sometimes unable to continue working. However, with proper care and management of lupus, patients can still lead a high quality of life. The most important factors are regular and preventative health care, reducing stress and fatigue, maintaining a good support system (friends, family, medical professionals, community organizations, and support groups), and learning to recognize warning symptoms of flares in order to better treat them or even prevent them from occurring. Warning signs of a flare differ between individuals, but they often include increased fatigue, pain, rashes, fever, abdominal discomfort, headache, and dizziness [1].\n• For a video overview of lupus, visit About.com: What is Lupus?. 2009. The New York Times Company.\n• Lupus Foundation of America. 2009 Lupus Foundation of America, Inc.\n• What is Lupus? Medical News Today, © MediLexicon International Ltd.\n• Lupus reviewed by AnneMarie C. Brescia, MD, June 2008. Teens Health, © 1995-2009 The Nemours Foundation.\n• National Lupus Awareness Campaign: Could I have Lupus? 3/31/09, womenshealth.gov, the Office on Women's Health in the U.S. Department of Health and Human Services.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/File:Symptomsaffectedbylupus.jpg", "/File:Symptomsaffectedbylupus.jpg", "/Disease", "/Immune_system", "/Antibodies", "/Bacteria", "/Viruses", "/Diseases", "/Antibodies", "/Organs", "/Joints", "/Skin", "/Heart", "/Lungs", "/Kidneys", "/Eyes", "/Blood", "/Digestive_system", "/Nervous_system", "#Causes", "#Forms", "#Symptoms", "#Diagnosis", "#Treatment", "#Lifestyle", "#References", "#External_Links", "#cite_note-NIAMS-1", "/Hormones", "#cite_note-about1-2", "/Genes", "/Families", "#cite_note-emedicine-3", "/Estrogen", "#cite_note-lupusfoundation2-4", "/Toxins", "#cite_note-emedicine-3", "#cite_note-lupusfoundation2-4", "#cite_note-lupusfoundation2-4", "#cite_note-IDPH-5", "/Blood", "#cite_note-NIAMS-1", "#cite_note-UMsymptoms-6", "#cite_note-IDPH-5", "/Sun", "#cite_note-emedicine-3", "#cite_note-lupusfoundation2-4", "/Liver", "#cite_note-NIAMS-1", "#cite_note-IDPH-5", "#cite_note-7", "/File:Malarrash.jpg", "/File:Malarrash.jpg", "#cite_note-mayo-8", "/Anemia", "#cite_note-mayo-8", "#cite_note-UMsymptoms-6", "/Blood_vessels", "#cite_note-UMsymptoms-6", "/Depression", "/Blood_clotting", "#cite_note-intelihealth-9", "/Heart", "/Heart_attack", "#cite_note-10", "/Kidneys", "#cite_note-NIAMS-1", "#cite_note-11", "/Red_blood_cells", "/White_blood_cells", "/Nucleus", "#cite_note-UMdiagnosis-12", "/DNA", "#cite_note-UMdiagnosis-12", "#cite_note-lupusfoundation-13", "#cite_note-lupusfoundation-13", "#cite_note-UMdiagnosis-12", "#cite_note-UMdiagnosis-12", "#cite_note-lupusfoundation-13", "/File:Bloodtest.jpg", "/File:Bloodtest.jpg", "/Hemoglobin", "#cite_note-about-14", "#cite_note-lupusfoundation-13", "#cite_note-about-14", "#cite_note-about-14", "/Proteins", "#cite_note-lupusfoundation-13", "#cite_note-UMdiagnosis-12", "#cite_note-mayo-8", "#cite_note-mayo-8", "#cite_note-NIAMS-1", "#cite_note-cure4lupus-15", "/Stomach", "/Muscle", "/Eye", "#cite_note-NIAMS-1", "#cite_note-mayotreatment-16", "/Diabetes", "/Calcium", "/Vitamin_D", "#cite_note-NIAMS-1", "/Immune_systems", "#cite_note-NIAMS-1", "#cite_note-cure4lupus-15", "/File:Yogapose.jpg", "/File:Yogapose.jpg", "/Homeopathy", "/Acupuncture", "#cite_note-lupusfoundation3-17", "#cite_note-mayotreatment-16", "/Stem_cell", "#cite_note-mayotreatment-16", "/File:Sleeping.jpg", "/File:Sleeping.jpg", "/Bones", "/Fruits", "/Vegetables", "/Fish", "#cite_note-lupusfoundationdiet-18", "#cite_note-lupusfoundationexercise-19", "#cite_note-NIAMS-1", "/File:Feature_star.jpg", "/Category:Featured_articles", "#cite_ref-NIAMS_1-0", "#cite_ref-NIAMS_1-1", "#cite_ref-NIAMS_1-2", "#cite_ref-NIAMS_1-3", "#cite_ref-NIAMS_1-4", "#cite_ref-NIAMS_1-5", "#cite_ref-NIAMS_1-6", "#cite_ref-NIAMS_1-7", "#cite_ref-NIAMS_1-8", "http://www.niams.nih.gov/Health_Info/Lupus/default.asp#Lupus_4", "#cite_ref-about1_2-0", "http://arthritis.about.com/od/lupus/a/lupusdisease.htm", "#cite_ref-emedicine_3-0", "#cite_ref-emedicine_3-1", "#cite_ref-emedicine_3-2", "http://www.emedicinehealth.com/lupus_systemic_lupus_erythematosus/page2_em.htm#Lupus%20Causes", "#cite_ref-lupusfoundation2_4-0", "#cite_ref-lupusfoundation2_4-1", "#cite_ref-lupusfoundation2_4-2", "#cite_ref-lupusfoundation2_4-3", "http://www.lupus.org/webmodules/webarticlesnet/templates/new_learnunderstanding.aspx?articleid=2233&zoneid=523", "#cite_ref-IDPH_5-0", "#cite_ref-IDPH_5-1", "#cite_ref-IDPH_5-2", "http://www.idph.state.il.us/about/womenshealth/factsheets/lupus.htm", "#cite_ref-UMsymptoms_6-0", "#cite_ref-UMsymptoms_6-1", "#cite_ref-UMsymptoms_6-2", "http://www.umm.edu/patiented/articles/what_symptoms_of_systemic_lupus_erythematosus_000063_4.htm", "#cite_ref-7", "http://www.mayoclinic.com/health/mixed-connective-tissue-disease/DS00675", "#cite_ref-mayo_8-0", "#cite_ref-mayo_8-1", "#cite_ref-mayo_8-2", "#cite_ref-mayo_8-3", "http://www.mayoclinic.com/health/lupus/DS00115/DSECTION=symptoms", "#cite_ref-intelihealth_9-0", "http://www.intelihealth.com/IH/ihtIH/WSIHW000/9339/10276.html#symptoms", "#cite_ref-10", "http://www.umm.edu/patiented/articles/how_serious_systemic_lupus_erythematosus_000063_5.htm", "#cite_ref-11", "http://lupus.about.com/od/diagnosisandtreatments/p/LupusDiagnosis.htm", "#cite_ref-UMdiagnosis_12-0", "#cite_ref-UMdiagnosis_12-1", "#cite_ref-UMdiagnosis_12-2", "#cite_ref-UMdiagnosis_12-3", "#cite_ref-UMdiagnosis_12-4", "http://www.umm.edu/patiented/articles/what_general_guidelines_treating_systemic_lupus_erythematosus_000063_7.htm", "#cite_ref-lupusfoundation_13-0", "#cite_ref-lupusfoundation_13-1", "#cite_ref-lupusfoundation_13-2", "#cite_ref-lupusfoundation_13-3", "#cite_ref-lupusfoundation_13-4", "http://www.lupusny.org/diagnosis.php#how", "#cite_ref-about_14-0", "#cite_ref-about_14-1", "#cite_ref-about_14-2", "http://lupus.about.com/od/diagnosis/p/LupusLabTests.htm", "#cite_ref-cure4lupus_15-0", "#cite_ref-cure4lupus_15-1", "http://cure4lupus.org/information/lupus_treatments.htm", "#cite_ref-mayotreatment_16-0", "#cite_ref-mayotreatment_16-1", "#cite_ref-mayotreatment_16-2", "http://www.mayoclinic.com/health/lupus/DS00115/DSECTION=treatments-and-drugs", "#cite_ref-lupusfoundation3_17-0", "http://www.lupus.org/webmodules/webarticlesnet/templates/new_learntreating.aspx?articleid=2250&zoneid=525", "#cite_ref-lupusfoundationdiet_18-0", "http://www.lupus.org/webmodules/webarticlesnet/templates/new_learnliving.aspx?articleid=2281&zoneid=527", "#cite_ref-lupusfoundationexercise_19-0", "http://www.lupus.org/webmodules/webarticlesnet/templates/new_learnliving.aspx?articleid=2253&zoneid=527", "http://video.about.com/lupus/What-Is-Lupus--.htm", "http://www.lupus.org/newsite/index.html", "http://www.lupusresearch.org/", "http://arthritis.about.com/od/lupus/Lupus_Cause_Symptoms_Diagnosis_Treatment.htm", "http://ezinearticles.com/?expert=Scott_Rickerson", "http://www.lupusny.org/", "http://www.medicalnewstoday.com/info/lupus/whatislupus.php", "http://kidshealth.org/teen/diseases_conditions/bones/lupus.html", "http://www.womenshealth.gov/lupus/", "/Template:Biology_navbox", "/Template_talk:Biology_navbox", "http://www.creationwiki.org/index.php?title=Template:Biology_navbox&action=edit", "/Biology", "/Organisms", "/Animal", "/Algae", "/Amphibian", "/Bacteria", "/Bird", "/Created_kind", "/Crustaceans", "/Dinosaur", "/Fish", "/Fungi", "/Human", "/Insect", "/Mollusk", "/Plant", "/Protist", "/Reptiles", "/File:Animal_diversity.jpg", "/Biological_scientist", "/Agriculture", "/Anatomy", "/Baraminology", "/Biologist", "/Biotechnology", "/Botany", "/Cell_biology", "/Ecology", "/Epidemiology", "/Embryology", "/Entomology", "/Biological_evolution", "/Genetics", "/Herpetology", "/Human_biology", "/Medicine", "/Microscopy", "/Physiology", "/Taxonomy", "/Virology", "/Zoology", "/Biological_system", "/Auditory_system", "/Circulatory_system", "/Digestive_system", "/Endocrine_system", "/Immune_system", "/Integumentary_system", "/Limbic_system", "/Lymphatic_system", "/Muscular_system", "/Nervous_system", "/Olfactory_system", "/Reproductive_system", "/Respiratory_system", "/Sensory_system", "/Skeletal_system", "/Visual_system", "/Biological_process", "/Aging", "/Cell_division", "/Cellular_respiration", "/Disease", "/Embryogenesis", "/Gene_expression", "/Metabolism", "/Metamorphosis", "/Parasitism", "/Photosynthesis", "/Pregnancy", "/Protein_synthesis", "/Reproduction", "/Symbiosis", "/Trophic_level", "/File:Creationwiki_portals.png", "/Category:Biology", "/Portal:Biology", "/Biology_news_archive", "/File:Creationwiki_portals.png"], "authors": [], "publish_date": null}