{"result_id": "084026", "URL": "http://www.creationwiki.org/Polio", "timestamp": "2023-04-25 14:52:21 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "http://www.creationwiki.org/Poliomyelitis", "encoding": "UTF-8"}, "image": null, "domain": "www.creationwiki.org", "title": "Poliomyelitis - CreationWiki, the encyclopedia of creation science", "cleaned_text": "From CreationWiki, the encyclopedia of creation science\n\nPoliomyelitis is a disease affecting mainly children under five years old, which is caused by the polio virus (part of the family Picornaviridae)[1]. It enters the body through the mouth and waste, making its way to the nervous system and usually results in paralysis. Studies show that out of 200 infected people, one will develop the inevitable paralysis, normally in the legs, and among these 5% to 10% of the victims die from muscle failure in the lungs. [2]\n\nIn the beginning of the 20th century in the United States, the polio virus was rising. [3] Because of a worldwide concern for the fearful disease however, its peak slowed. Fortunately, since the 1980’s, it began to reduce. The few countries that still battle this growing force are: Afghanistan, India, Nigeria and Pakistan. [4]\n\nThe history of polio can be traced back to the time of Franklin D. Roosevelt. When he was camping in his estate, Roosevelt had been struck with polio. The disease spread until he found himself terminally immobile in his legs. But Roosevelt's determination could not be swayed, even with his hindrance, from his political aspirations and his lengthy term as the United States' president. In addition to his career, he also informed the public of polio's presence in the United States and supported medical research to find a helpful answer to it. During this time, there was no vaccine available or known to anyone for polio. [5]\n\nThe earliest known cases of polio were discovered by Michael Underwood in England in the year 1789. He labeled the disease as \"a debility in the lower extremities\" for small children. Beginning in the 19th century, polio was reported having epidemics throughout England. Similar accounts happened in the United States in 1843. Time passed and the age of polio patients rose as well as the amount of deaths occurring. [6]\n\nPoliomyelitis is spread from one person to another mainly by their excrement, especially in areas of poor sanitation. Contamination also occurs through tainted food and water or direct contact. Once a person is infected, the polio virus builds up in the intestinal tract and throat, working its way to the nervous system by way of the blood and lymph. There, it tears down the motor neurons used for communication from the brain to the muscles. Because of the damage, the cells react by growing new axons, helping the muscles, though it may end with added stress on the nervous system. [7]\n\nPolio can immobilize and ultimately cause death in a person, but the greater number of Polio victims do not show symptoms of the disease. [8] Those whose symptoms aren't seen, spread the virus to other people through their waste. [9] The polio virus affects the nerves that link us to our muscles. They hinder and ruin our connection to movement, until one is forced to submit to the illness. [10] This type of Polio is called Paralytic Polio which leads to paralysis and is the worst known form of Polio. This will feature symptoms such as stiffness in the neck and back areas, constipation, and an extreme sensitivity to touch. Less than one percent of diseased people are struck with Paralytic Polio. Another type is Non-paralytic Polio, which is found in a small percentage of infected people. It doesn't result in paralysis but it will exhibit many symptoms, sometimes lasting less than two weeks, which include a fever, a headache, fatigue, vomiting, and diarrhea. [11]\n\nAs far as medicine is concerned, the Polio virus can't be cured. Treatment, such as analgesics, can be given to lesson any pain from Polio. Antibiotics are used for minor infections, but not for the actual virus. Other treatments vary from healthy dieting to reasonable exercise. [12] All in all, a patient with Polio must consult Medical Care if their situation calls for it, but generally, the best way to be treated is to become as healthy as you can. [13]\n\nAs stated, there is no known cure for Polio. It can only be prevented by taking doses of the Polio vaccine. For a child, this method, if taken enough times, can be helpful for their entire life. [14] The Polio vaccine is the best procedure that helps avert this disease. Children should take an average of about four injections of the vaccine. The age ranges from 2 months old to 6 years old. The vaccine is made up of an inactivated polio virus which isn't harmful because the virus is essentially dead. Adults who were vaccinated when younger do not need to retake it, but people who are around Poliomyelitis for a sufficient amount of time will be in risk of receiving the virus, whether for the first time or again. [15]\n\nInitial tries for a vaccine for polio had all failed because of the lack of knowledge. There are three strains from stable viruses of the enterovirus family that cause polio. For a vaccine to work, it has to be immune to these three strains. There in lay the problem. An organization called the March of the Dimes, started by President Roosevelt, assisted in the launch of new research for polio. In 1952, Dr. Jonas Salk, by way of the March of the Dimes, was the first to come up with a working vaccine against polio. This was the beginning of the immunization of polio. [16]", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/File:Poliovirus.png", "/File:Poliovirus.png", "/Disease", "/Virus", "http://www.cdc.gov/vaccines/pubs/pinkbook/downloads/polio.pdf", "/Paralysis", "http://www.who.int/mediacentre/factsheets/fs114/en/index.html", "http://www.mayoclinic.com/health/polio/DS00572/", "http://www.who.int/mediacentre/factsheets/fs114/en/index.html", "#History", "#Causes", "#Symptoms", "#Treatment", "#Prevention", "#Gallery", "#Viral_Diseases", "#References", "/index.php?title=Franklin_D._Roosevelt&action=edit&redlink=1", "http://www.accessexcellence.org/AE/AEC/CC/polio.php", "/England", "/United_States", "http://www.cdc.gov/vaccines/pubs/pinkbook/downloads/polio.pdf", "/File:Poliovirus2..jpg", "/File:Poliovirus2..jpg", "http://www.mayoclinic.com/health/polio/DS00572/DSECTION=3", "/File:Polio_virus.jpg", "/File:Polio_virus.jpg", "http://www.mayoclinic.com/health/polio/DS00572/DSECTION=2", "http://www.cdc.gov/vaccines/pubs/pinkbook/downloads/polio.pdf", "http://www.dhpe.org/infect/polio.html", "http://www.mayoclinic.com/health/polio/DS00572/DSECTION=2", "http://www.mayoclinic.com/health/polio/DS00572/DSECTION=8", "http://www.dhpe.org/infect/polio.html", "/Polio_Vaccine", "/File:Graph_of_polio_cases.PNG", "/File:Graph_of_polio_cases.PNG", "/Vaccine", "http://www.who.int/mediacentre/factsheets/fs114/en/index.html", "http://www.polio.com/?fa=learn/polio/disease#6", "http://www.accessexcellence.org/AE/AEC/CC/polio.php", "/File:Polio_muscle_tissue.jpg", "/File:Polio_spinal_cord.jpg", "/AIDS", "/Avian_influenza", "/Chickenpox", "/Ebola", "/Gastroenteritis", "/Hepatitis_B", "/Hepatitis_C", "/Human_papillomavirus", "/Infectious_mononucleosis", "/Influenza", "/Measels", "/Mumps", "/Smallpox", "/Swine_influenza", "/Rabies", "/Yellow_fever", "/Template:Viral_disease", "http://www.mayoclinic.com/health/polio/DS00572/", "http://www.who.int/mediacentre/factsheets/fs114/en/index.html", "http://www.polio.com/?fa=learn/polio/disease", "http://www.dhpe.org/infect/polio.html", "http://www.accessexcellence.org/AE/AEC/CC/polio.php", "/Template:Biology_navbox", "/Template_talk:Biology_navbox", "http://www.creationwiki.org/index.php?title=Template:Biology_navbox&action=edit", "/Biology", "/Organisms", "/Animal", "/Algae", "/Amphibian", "/Bacteria", "/Bird", "/Created_kind", "/Crustaceans", "/Dinosaur", "/Fish", "/Fungi", "/Human", "/Insect", "/Mollusk", "/Plant", "/Protist", "/Reptiles", "/File:Animal_diversity.jpg", "/Biological_scientist", "/Agriculture", "/Anatomy", "/Baraminology", "/Biologist", "/Biotechnology", "/Botany", "/Cell_biology", "/Ecology", "/Epidemiology", "/Embryology", "/Entomology", "/Biological_evolution", "/Genetics", "/Herpetology", "/Human_biology", "/Medicine", "/Microscopy", "/Physiology", "/Taxonomy", "/Virology", "/Zoology", "/Biological_system", "/Auditory_system", "/Circulatory_system", "/Digestive_system", "/Endocrine_system", "/Immune_system", "/Integumentary_system", "/Limbic_system", "/Lymphatic_system", "/Muscular_system", "/Nervous_system", "/Olfactory_system", "/Reproductive_system", "/Respiratory_system", "/Sensory_system", "/Skeletal_system", "/Visual_system", "/Biological_process", "/Aging", "/Cell_division", "/Cellular_respiration", "/Disease", "/Embryogenesis", "/Gene_expression", "/Metabolism", "/Metamorphosis", "/Parasitism", "/Photosynthesis", "/Pregnancy", "/Protein_synthesis", "/Reproduction", "/Symbiosis", "/Trophic_level", "/File:Creationwiki_portals.png", "/Category:Biology", "/Portal:Biology", "/Biology_news_archive", "/File:Creationwiki_portals.png"], "authors": [], "publish_date": null}