{"result_id": "087005", "URL": "https://curiousmindmagazine.com/why-most-states-kick-against-the-legalization-of-lane-splitting-in-the-us/", "timestamp": "2023-04-25 14:54:09 CEST+0200", "meta": {"description": "Why Most States Kick Against the Legalization of Lane Splitting in the US. As a motorcyclist, there is always the risk of an accident, whether caused by other riders or motorists. However, certain riding behaviors", "lang": "en", "keywords": "", "favicon": "https://curiousmindmagazine.com/wp-content/uploads/2022/11/logo.png", "canonical": "https://curiousmindmagazine.com/why-most-states-kick-against-the-legalization-of-lane-splitting-in-the-us/", "encoding": "UTF-8"}, "image": null, "domain": "curiousmindmagazine.com", "title": "Why Most States Kick Against the Legalization of Lane Splitting in the US", "cleaned_text": "As a motorcyclist, there is always the risk of an accident, whether caused by other riders or motorists. However, certain riding behaviors motorcyclists may make riding even riskier for inexperienced motorists. One of these behaviors is lane splitting, also known as white-lining.\n\nLane splitting is when a motorcycle passes one or more cars in the area between two lanes. These areas are often those with white painted road-line. Lane splitting is a technique motorcycle riders use to avoid stopping in congested traffic.\n\nIn other words, lane splitting is usually an attempt to pass slower-moving vehicles by weaving between traffic.\n\nFurthermore, there are other two traffic maneuvers that motorcycle riders use that are comparable to lane splitting. They consist of Lane sharing and Lane filtering.\n\nThe essence of Lane filtering is for intersections with traffic lights. Motorcycle riders use lane filtering to move up to the front of the line at a red light by filtering their way between stopped cars.\n\nBy doing this, the riders can take up less room in the lane of stopped traffic with their motorcycle. Then, immediately after the light turns green, the quick acceleration of the motorcycles enables the riders to move ahead and re-enter the traffic lane.\n\nLane sharing, on the other hand, occurs when two or more motorcycles are moving side by side in the same lane.\n\n“Small vehicles weaving in and out of traffic can create issues for motorcyclist visibility,” says Denver motorcycle accident lawyer Amy Gaiennie of Amy G Injury Law Firm. “Because most states consider lane splitting to be dangerous for motorcycle riders, its legality has been a source of debate in the United States”\n\nEven though motorists in other nations may legally practice lane splitting, it is illegal in most US states, either explicitly or implicitly. Individual state legislatures have jurisdiction over these decisions. The rules collaborate with the state motor vehicle division, highway patrol, or state police in states where lane splitting is legal.\n\nCurrently, California is the only US state where lane splitting is legal. The California Assembly Bill 51 (AB-51) was approved on August 19, 2016, by then-governor Edmund Gerald Brown Jr. The California Highway Patrol (CHP) had long tolerated riders splitting lanes even though it was illegal.\n\nBut the AB-51 now makes it legal. The law mandated that the California Highway Patrol (CHP) create guidelines for educational lane splitting. It has been a significant win for California motorcyclists because the guidelines direct both law enforcement and education on public driving.\n\nThe Goals and Advantages of Lane Splitting\n\nAccording to a study from the University of California, Berkeley, lane splitting may be safer for motorcycle riders than usual lane riding during traffic congestion. According to this study, motorcycle riders are more likely to get hit from behind by vehicles when there is traffic congestion and no lane splitting.\n\nLane splitting eliminates the likelihood of this happening because, when motorcyclists pass between lanes, there are no cars behind to hit them. Furthermore, motorcyclists ride at slower speeds during lane splitting.\n\nThus, injuries from lane splitting are usually less severe. In bumper-to-bumper traffic, lane splitting can also help ease traffic congestion because a motorcycle occupies the same lane space as a vehicle. (1)\n\nAlthough lane splitting has its advantages, there are also risks associated with it. Drivers often switch to a faster lane in slow-moving traffic. Though these motorists signal their turns sometimes, other times, they change lanes too quickly without any signal.\n\nA sudden switch of lanes without any signal could cause harm to a motorcycle rider about lane splitting. Additionally, many motorists and passengers often hang their arms out the window while stuck in traffic on a hot day. It could be disastrous when a motorcyclist lane splitting comes in contact with the arm.\n\nThe following are other risk factors associated with lane splitting:\n• None Ladders, wood, and other items sticking out of larger vehicles such as pickup truck\n• None Side mirrors on other cars that are particularly extra-wide\n• None Rain, snow, wind, darkness, and other bad weather conditions for riding\n\nMotorcycle riders where lane splitting is legal should abide by the safety regulations to avoid accidents. The following are a few of these safety recommendations:\n• None Motorcycle riders should only split lanes that are in between the two leftmost lanes. The number of cars switching lanes for on- and off-ramps is higher in the right traffic lanes\n• None Motorcyclists should ensure they have enough space ahead to pass safely between vehicles. Motorcycles need two feet of space on either side before passing\n• None Motorcyclists should always watch out for vehicles attempting to switch lanes\n• None Motorcycle riders should always cover the clutch and brakes with two fingers to enable a sudden stop if the need arises\n• None When the traffic flow returns to normal, motorcyclists should always get ready to merge back into the lane\n• None Motorcyclists should always wear reflective or brightly colored clothing and use their high beams to be easily seen by drivers\n\nFollowing the safety guidelines associated with lane splitting will go a long way in preventing and reducing lane-splitting-related crashes. (2)", "opengraph": {"description": "As a motorcyclist, there is always the risk of an accident, whether caused by other riders or motorists. However, certain riding behaviors motorcyclists may make riding even riskier for inexperienced motorists. One of these behaviors is lane splitting, also known as white-lining. What is Lane Splitting? Lane splitting is when a motorcycle passes one or more cars in the area between two lanes. These areas are often those with white painted road-line. Lane splitting is a technique motorcycle riders use to avoid stopping in congested traffic. In other words, lane splitting is usually an attempt to pass slower-moving vehicles by", "title": "Why Most States Kick Against the Legalization of Lane Splitting in the US", "article_author": "Felicia Wilson", "article_publisher": "Felicia Wilson", "image": "https://curiousmindmagazine.com/wp-content/uploads/2022/12/Motorcycle-rider.jpg", "type": "article", "url": "https://curiousmindmagazine.com/why-most-states-kick-against-the-legalization-of-lane-splitting-in-the-us/", "site_name": "Curious Mind Magazine", "article:published_time": "2022-12-30T10:43:47+00:00", "article:modified_time": "2022-12-30T10:43:47+00:00", "updated_time": "2022-12-30T10:43:47+00:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://curiousmindmagazine.com/wp-content/uploads/2022/12/Motorcycle-rider.jpg", "https://www.tumblr.com/widgets/share/tool?posttype=link&canonicalUrl=https%3A%2F%2Fcuriousmindmagazine.com%2Fwhy-most-states-kick-against-the-legalization-of-lane-splitting-in-the-us%2F&title=Why+Most+States+Kick+Against+the+Legalization+of+Lane+Splitting+in+the+US", "https://www.linkedin.com/cws/share?url=https%3A%2F%2Fcuriousmindmagazine.com%2Fwhy-most-states-kick-against-the-legalization-of-lane-splitting-in-the-us%2F", "https://curiousmindmagazine.com/how-to-increase-safety-for-new-motorcycle-riders/", "https://amyglaw.com/denver-motorcycle-accident-lawyer/", "https://www.nolo.com/legal-encyclopedia/motorcycle-accidents-lane-splitting-29730.html", "https://medium.com/smart-turn-system/ultimate-guide-to-safe-lane-splitting-8016219d6ec6", "https://www.tumblr.com/widgets/share/tool?posttype=link&canonicalUrl=https%3A%2F%2Fcuriousmindmagazine.com%2Fwhy-most-states-kick-against-the-legalization-of-lane-splitting-in-the-us%2F&title=Why+Most+States+Kick+Against+the+Legalization+of+Lane+Splitting+in+the+US", "https://www.linkedin.com/cws/share?url=https%3A%2F%2Fcuriousmindmagazine.com%2Fwhy-most-states-kick-against-the-legalization-of-lane-splitting-in-the-us%2F"], "authors": ["", "Felicia Wilson"], "publish_date": "2022-12-30T10:43:47+00:00"}