{"result_id": "087018", "URL": "https://curiousmindmagazine.com/the-anxiety-brought-on-by-the-pandemic-was-causing-more-health-issues/", "timestamp": "2023-04-25 14:55:14 CEST+0200", "meta": {"description": "The anxiety brought on by the pandemic was causing more health issues. The Coronavirus pandemic was making a lot of changes to the way people were working. While many were willing to adapt to the changes taking", "lang": "en", "keywords": "", "favicon": "https://curiousmindmagazine.com/wp-content/uploads/2022/11/logo.png", "canonical": "https://curiousmindmagazine.com/the-anxiety-brought-on-by-the-pandemic-was-causing-more-health-issues/", "encoding": "UTF-8"}, "image": null, "domain": "curiousmindmagazine.com", "title": "The anxiety brought on by the pandemic was causing more health issues", "cleaned_text": "The Coronavirus pandemic was making a lot of changes to the way people were working. While many were willing to adapt to the changes taking place at their work, there was an air of the unknown around the virus, which was stressful for most people.\n\nThe Coronavirus pandemic was like nothing seen to this point, and people were unsure how to react. There was no cure to the virus either, with more than 2.5 million people passing away because of it. While everyone was keeping as safe as possible, there were a few challenges with the process, and there were no rules about who could catch it and how various people could react to the virus.\n\nWhat were the dangers of catching the virus?\n\nFewer people were losing their lives to the virus now, which was not the case in the initial stages when it was getting around the world. Throughout the pandemic, globally, the largest pharmaceutical companies were working on creating a cure but were not having the best luck. There were challenges with the process, and they created what would be the fastest drug in history. While many companies were running through the process to bring a vaccine to the shelves, there were challenges along the way, and they were not sure if they would work properly.\n\nThe youngest group of the population and the oldest had a higher chance of catching the virus, and without the best immune system, there was a higher chance that they would not be able to recover from the virus. When it came to catching the virus, almost everyone could catch it, but there was a lower chance of someone younger being unable to recover from it. Additionally, age doesn’t matter when considering people with morbidities like a heart condition, cholesterol, diabetes and many others since their immune systems would not be in the best state.\n\nWhen it came to the virus, people would react to it differently, so there was no solution across the board. While some had no symptoms and could be spreading it to others, others had signs of a slight cold, while others were struggling to breathe.\n\nWhat role did the media play in keeping people aware?\n\nSince everything relating to the virus was taking place in real-time, people and the media were learning about the virus as it happened. To keep everyone aware of the happenings, everything during the days of the pandemic seemed bleak.\n\nPeople were spreading incorrect information, and it was causing massive concerns and fear. To add to the change, when the number of people infected with the virus started increasing, countries were pushing for a national lockdown, making it quite challenging to leave the house. People were too anxious to go to the store, and they were spending their time indoors for the most part.\n\nMost news channels had a count of the number of people infected by the virus every day. Additionally, they would mention the numbers that were recovering and those who were not, making the process all the more challenging. Since everyone was learning and reading up on the virus in real-time, it led to massive changes with some information having to be refuted which confused the general public further.\n\nHow could the changes and more information lead to anxiety?\n\nWhenever anyone turned on the television, the first announcement they would receive would be the more than two million dead from the virus. Additionally, lockdowns, companies and businesses shutting down, people losing their jobs, transports and supplies disrupted and the vast majority of people working from home were challenges that most people had to adapt to.\n\nStaying indoors without the ability to meet people was quite a challenge for most and caused a lot of anxiety​. Even therapists were now conducting their meetings online, which was the only option that they were left with. The inability to know how safe each person was or the inability to protect oneself was quite challenging to get through.\n\nChanges in work schedules were another challenge, and many employers stated that they saw a decrease in productivity. Additionally, people mentioned that they found it challenging to multi-task since they always had errands and family commitments when they were home. The lines between personal life and work were blurred because of meetings at odd hours and meals and sleep taking the hit.\n\nMany companies dealing with the pandemic or hiring when the restrictions were lifted found it challenging to get through the process. They were now implementing changes and going through background checks to make sure the people they were hiring were a good fit for the team. While most companies were shutting down or had to close because of a spike in the number of people with the virus, there were some changes they had to get through.\n\nDuring national lockdowns, there were a series of businesses that were a value add to the public like grocery stores and pharmacies and medical stores that had to run and were not allowed to shut down. They had to keep working throughout, and people working there had to come in no matter what.\n\nHowever, most other companies were at the mercy of the authorities and could function or stop, depending on the rules and whether they were changing or staying stable for a long period. They had to keep letting their people go or keeping their staff on unpaid leave since they were struggling to meet their targets through the pandemic. However, since they were in the process of interacting​ with the public, they had to make sure that they had a background check and no criminal history since that could be challenging for any brand.\n\nThere were multiple places where people could get a check if they wanted one, and it was a wise idea to keep one ready when they were applying for a position. The test took about two weeks to a month depending on the job profiles, and getting the background check early was smarter since they would not have to delay after getting through their interview.", "opengraph": {"description": "The Coronavirus pandemic was making a lot of changes to the way people were working. While many were willing to adapt to the changes taking place at their work, there was an air of the unknown around the virus, which was stressful for most people. The Coronavirus pandemic was like nothing seen to this point, and people were unsure how to react. There was no cure to the virus either, with more than 2.5 million people passing away because of it. While everyone was keeping as safe as possible, there were a few challenges with the process, and there were", "title": "The anxiety brought on by the pandemic was causing more health issues", "article_author": "Elizabeth Williams", "article_publisher": "Elizabeth Williams", "image": "https://curiousmindmagazine.com/wp-content/uploads/2019/04/anxiety.jpg", "type": "article", "url": "https://curiousmindmagazine.com/the-anxiety-brought-on-by-the-pandemic-was-causing-more-health-issues/", "site_name": "Curious Mind Magazine", "article:published_time": "2021-03-05T13:18:33+00:00", "article:modified_time": "2021-03-14T21:16:22+00:00", "updated_time": "2021-03-14T21:16:22+00:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://curiousmindmagazine.com/wp-content/uploads/2019/04/anxiety.jpg", "https://www.tumblr.com/widgets/share/tool?posttype=link&canonicalUrl=https%3A%2F%2Fcuriousmindmagazine.com%2Fthe-anxiety-brought-on-by-the-pandemic-was-causing-more-health-issues%2F&title=The+anxiety+brought+on+by+the+pandemic+was+causing+more+health+issues", "https://www.linkedin.com/cws/share?url=https%3A%2F%2Fcuriousmindmagazine.com%2Fthe-anxiety-brought-on-by-the-pandemic-was-causing-more-health-issues%2F", "https://www.frontiersin.org/articles/10.3389/fpsyg.2020.577639/full", "https://www.medicalnewstoday.com/articles/anxiety-symptoms-increased-during-the-pandemic-google-trends-show#COVID-19-and-mental-health", "http://crbdirect.org.uk/", "https://crbdirect.org.uk/", "https://www.tumblr.com/widgets/share/tool?posttype=link&canonicalUrl=https%3A%2F%2Fcuriousmindmagazine.com%2Fthe-anxiety-brought-on-by-the-pandemic-was-causing-more-health-issues%2F&title=The+anxiety+brought+on+by+the+pandemic+was+causing+more+health+issues", "https://www.linkedin.com/cws/share?url=https%3A%2F%2Fcuriousmindmagazine.com%2Fthe-anxiety-brought-on-by-the-pandemic-was-causing-more-health-issues%2F"], "authors": ["", "Elizabeth Williams"], "publish_date": "2021-03-05T13:18:33+00:00"}