{"result_id": "087027", "URL": "https://curiousmindmagazine.com/learning-from-2020-how-to-prevent-another-global-lockdown/", "timestamp": "2023-04-25 14:55:52 CEST+0200", "meta": {"description": "Learning From 2020 – How to Prevent Another Global Lockdown. The effects of the pandemic of two years ago were epic, to say the least. The shockwaves that it sent through the world as the mortality rate grew", "lang": "en", "keywords": "", "favicon": "https://curiousmindmagazine.com/wp-content/uploads/2022/11/logo.png", "canonical": "https://curiousmindmagazine.com/learning-from-2020-how-to-prevent-another-global-lockdown/", "encoding": "UTF-8"}, "image": null, "domain": "curiousmindmagazine.com", "title": "Learning From 2020 – How to Prevent Another Global Lockdown", "cleaned_text": "The effects of the pandemic of two years ago were epic, to say the least. The shockwaves that it sent through the world as the mortality rate grew almost exponentially were palpable. Its reach was keenly felt not just economically, but also emotionally and psychologically as well.\n\nBecause of this, it’s safe to say that there is no one in the world right now who wants the events of 2020 to repeat itself. Yet, thanks to the continuing spikes in cases of COVID variants there may still be serious cause for concern. If recent studies and stats are to be believed, we inch ever closer to repeating 2020 once again.\n\nThankfully, not only are we not quite there yet, there are ways to ensure that we pull back from the brink and put all the sordid experiences of the past in our rearview!\n\nWe’ll be sharing crucial tips on how to make that happen now.\n\nWhile there are treatments in use for COVID, there’s currently no cure for the virus. And, if for no other reason than the fact that this virus has proven to be remarkably adept at mutating, the chances are high that this will remain the case for a while into the future.\n\nIn the meantime, some of the best ways that we can forestall another pandemic are to;\n\nGet Vaccinated as Soon as Possible\n\nEven though quite a lot of people have acknowledged the potential benefits of the COVID vaccine and have taken their shots, a lot more people still hold deep reservations about getting vaccinated.\n\nSome of the most common reasons that people shy from the COVID vaccine include;\n• None They believe that COVID hasn’t been around long enough for a viable vaccine to be produced.\n• None They believe the vaccine doesn’t work because even people who took it still contract COVID.\n• None They believe it isn’t worth the risk of harmful potential side effects.\n• None They believe the vaccine is defective otherwise it wouldn’t need a booster.\n\nWhile all of these reasons may be valid in their own right, it’s important to remember that, ultimately, this is medicine, and the mechanics behind dealing with a virus as deadly as the coronavirus is extremely complex.\n\nSo even though the vaccine may have some kinks that still need to be worked out, you should still consider taking it as studies confirm that it saves lives and, in many instances, prevents critical illnesses.\n\nEven though things have calmed down considerably now, it’s never a bad idea to maintain safety protocols like washing your hands and sanitizing frequently, maintaining a good distance from other people, and even wearing nose masks.\n\nThe thing about these practices is that they don’t only help curb COVID, but they can also reduce the infection rate of a host of other diseases as well!\n\nLast but not least, leveraging reliable COVID self-testing kits like Flowflex antigen test can do a lot to prevent another major outbreak. This is because, with these tools, you can monitor your health more efficiently so you know when to quarantine and, by extension, reduce the number of people you infect if you contract the virus.\n\nYou’ll also know when to seek proper treatment, increasing your chances of beating COVID.\n\nWhile there’s no disputing the fact that a lot will have to be done if we’re to stay safe, implementing these measures is without a doubt a good place to start!", "opengraph": {"description": "The effects of the pandemic of two years ago were epic, to say the least. The shockwaves that it sent through the world as the mortality rate grew almost exponentially were palpable. Its reach was keenly felt not just economically, but also emotionally and psychologically as well. Because of this, it’s safe to say that there is no one in the world right now who wants the events of 2020 to repeat itself. Yet, thanks to the continuing spikes in cases of COVID variants there may still be serious cause for concern. If recent studies and stats are to be", "title": "Learning From 2020 – How to Prevent Another Global Lockdown", "article_author": "Felicia Wilson", "article_publisher": "Felicia Wilson", "image": "https://curiousmindmagazine.com/wp-content/uploads/2022/05/stay-safe.jpg", "type": "article", "url": "https://curiousmindmagazine.com/learning-from-2020-how-to-prevent-another-global-lockdown/", "site_name": "Curious Mind Magazine", "article:published_time": "2022-05-13T08:22:13+00:00", "article:modified_time": "2022-05-13T08:22:13+00:00", "updated_time": "2022-05-13T08:22:13+00:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://curiousmindmagazine.com/wp-content/uploads/2022/05/stay-safe.jpg", "https://www.tumblr.com/widgets/share/tool?posttype=link&canonicalUrl=https%3A%2F%2Fcuriousmindmagazine.com%2Flearning-from-2020-how-to-prevent-another-global-lockdown%2F&title=Learning+From+2020+%E2%80%93+How+to+Prevent+Another+Global+Lockdown", "https://www.linkedin.com/cws/share?url=https%3A%2F%2Fcuriousmindmagazine.com%2Flearning-from-2020-how-to-prevent-another-global-lockdown%2F", "https://coronavirus.jhu.edu/data/mortality", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7906538/", "https://pubmed.ncbi.nlm.nih.gov/32813051/", "https://www.nytimes.com/interactive/2021/health/coronavirus-variant-tracker.html", "https://www.who.int/en/activities/tracking-SARS-CoV-2-variants/", "https://www.health.harvard.edu/diseases-and-conditions/treatments-for-covid-19", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/effectiveness/work.html", "https://handstations.co.uk/product/flowflex-covid-test/", "https://curiousmindmagazine.com/strong-immunity-and-health-is-the-key-to-beating-coronavirus/", "https://curiousmindmagazine.com/strong-immunity-and-health-is-the-key-to-beating-coronavirus/", "https://www.tumblr.com/widgets/share/tool?posttype=link&canonicalUrl=https%3A%2F%2Fcuriousmindmagazine.com%2Flearning-from-2020-how-to-prevent-another-global-lockdown%2F&title=Learning+From+2020+%E2%80%93+How+to+Prevent+Another+Global+Lockdown", "https://www.linkedin.com/cws/share?url=https%3A%2F%2Fcuriousmindmagazine.com%2Flearning-from-2020-how-to-prevent-another-global-lockdown%2F"], "authors": ["", "Felicia Wilson"], "publish_date": "2022-05-13T08:22:13+00:00"}