{"result_id": "088027", "URL": "https://billcam.dailyclout.io/bill-texts/CcXP8togbf", "timestamp": "2023-04-25 14:56:23 CEST+0200", "meta": {"description": "BillCam", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://billcam.dailyclout.io/bill-texts/CcXP8togbf", "encoding": "utf-8"}, "image": null, "domain": "billcam.dailyclout.io", "title": "BillCam", "cleaned_text": "SECTION 1. The Legislature finds and declares all of the following:\n\n(a) The global spread of the SARS-CoV-2 coronavirus, or COVID-19, has claimed the lives of over 5,000,000 people worldwide, including nearly 75,000 Californians.\n\n(b) Data from the federal Centers for Disease Control and Prevention (CDC) shows that unvaccinated individuals are at a risk of dying from COVID-19 that is 11 times greater than those who are fully vaccinated.\n\n(c) The safety and efficacy of COVID-19 vaccines have been confirmed through evaluation by the federal Food and Drug Administration (FDA) and the vaccines continue to undergo intensive safety monitoring by the CDC.\n\n(d) The spread of misinformation and disinformation about COVID-19 vaccines has weakened public confidence and placed lives at serious risk.\n\n(e) Major news outlets have reported that some of the most dangerous propagators of inaccurate information regarding the COVID-19 vaccines are licensed health care professionals.\n\n(f) The Federation of State Medical Boards has released a statement warning that physicians who engage in the dissemination of COVID-19 vaccine misinformation or disinformation risk losing their medical license, and that physicians have a duty to provide their patients with accurate, science-based information.\n\n(g) In House Resolution No. 74 of the 2021–22 Regular Session, the California State Assembly declared health misinformation to be a public health crisis, and urged the State of California to commit to appropriately combating health misinformation and curbing the spread of falsehoods that threaten the health and safety of Californians.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}