{"result_id": "088029", "URL": "https://dailyclout.io/strokes-what-did-pfizer-know-and-when-did-they-know-it-report/", "timestamp": "2023-04-25 14:56:24 CEST+0200", "meta": {"description": "Strokes: What Did Pfizer Know, and When Did They Know It? - Report. Pfizer failed to pause the rollout to look at these adverse events.", "lang": "en", "keywords": "", "favicon": "https://dailyclout.io/wp-content/uploads/image-2-2-60x60.png", "canonical": "https://dailyclout.io/strokes-what-did-pfizer-know-and-when-did-they-know-it-report/", "encoding": "UTF-8"}, "image": null, "domain": "dailyclout.io", "title": "Report 25: Strokes - What Did Pfizer Know, and When Did They Know It?", "cleaned_text": "Report 25: Strokes – What Did Pfizer Know, and When Did They Know It?\n\nStrokes are a serious, often life-threatening event that can result in death or permanent life altering disability. The incidence of stroke is much more common in the elderly than in younger people. A series of reports are being done to determine what Pfizer knew about any dangers with their vaccine and when did they know it. In this report, a few searches of the Centers for Disease Control and Prevention (CDC) Wonder website Vaccine Adverse Event Reporting System (VAERS) [https://wonder.cdc.gov/controller/datarequest/D8] show that strokes are a fairly common adverse effect occurring in people of all ages that received the Pfizer vaccine. This report delves into some of these cases to determine if the vaccine may be the cause.\n\nThe first report [https://dailyclout.io/what-did-pfizer-know-and-when-did-they-know-it-neurological-harms-concealed/] in this series answering, “What did Pfizer know, and when did they know it?” in regard to the Pfizer BioNTech COVID-19 vaccine, looked at the number of neurological adverse events reported in the VAERS [https://wonder.cdc.gov/controller/datarequest/D8]. It showed the incidence of neurological adverse events reported. Conclusions were startling: the Pfizer vaccine is causing great neurological harm, and this harm was evident early 2021.\n\nPfizer failed to pause the rollout to look at these adverse events.\n\nThis new report takes a closer look at just one neurological adverse event type: stroke. Strokes are due to a sudden disruption of the blood supply in the brain, usually a clot, blocking the blood supply (ischemic stroke) or by the leaking or rupturing of an artery (hemorrhagic stroke). Ischemic strokes are the most common. Brain cells will die within minutes due to a lack of oxygen during an ischemic stroke or due to damage from the pressure created by bleeding in the case of the hemorrhagic stroke. According to Statistics on Stroke 2020, Socialstyrelsen, 2/12/21, Art No. 2021-12-7644, 1(4), ISSN 1400-3511, less than four percent of the cases that occurred in 2020 affected a person under age 50, and only one percent of them died.\n\n[https://www.socialstyrelsen.se/globalassets/sharepoint-dokument/artikelkatalog/statistik/2021-12-7644.pdf, p. 3] The majority (74%) of those who had a stroke in 2020 were over the age of 70. [https://www.socialstyrelsen.se/globalassets/sharepoint-dokument/artikelkatalog/statistik/2021-12-7644.pdf, p. 3] Figure 3 from this journal article is depicted in the screenshot below clearly showing the incidence of stroke in different age groups.\n\nThis next screenshot is the first page of a VAERS database search offering an overall look at those who received the Pfizer COVID vaccine and reported having a stroke during 2021 (all ages). It shows 561 strokes. Of these, 44 were reported in January and February of 2021 alone. [https://wonder.cdc.gov/controller/datarequest/D8]\n\nA similar search for all Pfizer influenza vaccines (over 10 of them) for the years 2015 through 2019, showed not a single stroke was reported, as seen in the following screenshot.\n\nThe next two screenshots are the results of a search on the VAERS database for the Pfizer vaccine only in conjunction with strokes within three days of receiving the vaccine during the time frame of December 2020 through 2021. The search resulted in 41 stroke incidences in people under the age of 50 [https://wonder.cdc.gov/controller/datarequest/D8]. According to the article from Socialstyrelsen, this is the age group with less than 4% of the strokes. [https://www.socialstyrelsen.se/globalassets/sharepoint-dokument/artikelkatalog/statistik/2021-12-7644.pdf, p. 3] Most importantly, these 41 strokes occurred within three days of taking the vaccine, and about 44% occurred the very same day. This is highly suggestive of the vaccine being a strong contributing factor to, if not the cause of, the strokes. The search did not include the number of shots the person received, though many of the individual’s reports did include this information. The number of shots varied from person to person. Some experienced a stroke after their second shot, but others experienced a stroke after just 1 shot. Most of the strokes were equally distributed between the 30-39 and the 40-49 age categories, but several were also seen in the 6-17 and the 18-29 age groups. In general, strokes in these age groups are rare.\n\nTaking a closer look at the individuals who suffered these strokes shows that many of these people were young and healthy without much medical history. The following screenshots are a few examples. [https://wonder.cdc.gov/controller/datarequest/D8]\n\nThis screenshot details two cerebral venous sinus thrombi detected in a 27-year-old female that received the second dose of a Pfizer COVID-19 vaccine. The onset of her symptoms started the same day she received the injection. [https://wonder.cdc.gov/controller/datarequest/D8]\n\nThe next two screenshots show a 32-year-old healthy woman, with no prior medical history other than some allergies, having an immediate reaction to the first dose of vaccine. She had a stroke and was put into a medical coma, during which she coded and had seizures. She had to be intubated and ventilated but, fortunately, recovered enough to be released from the hospital eight days later. [https://wonder.cdc.gov/controller/datarequest/D8]\n\nThe next two screenshots are from a 29-year-old female that suffered a severe headache and vomiting due to a cerebral venous sinus thrombosis after her second dose. Her medical history included asthma and GERD (Gastroesophogeal Reflux Disease) and a few allergies, none of which would make her at risk for a stroke. [https://wonder.cdc.gov/controller/datarequest/D8]\n\nThis next example is a 14-year-old healthy male with no medical history. One day after one dose of vaccination, he suffered a cerebral thrombosis and a third-degree heart block. He was left permanently disabled. [https://wonder.cdc.gov/controller/datarequest/D8]\n\nA previously healthy 26-year-old male with no medical history is now permanently disabled. He noticed memory, balance and speech problems just 12 hours after receiving his first dose of the Pfizer vaccine. He was diagnosed with an acute infarct involving the left caudate head, anterior limb of the internal capsule, anterior putamen and left insular cortex. He also suffered a second ischemic stroke three to four weeks later. [https://wonder.cdc.gov/controller/datarequest/D8]\n\nA 46-year-old female experienced headache and nausea starting just 3 days post vaccination. Four days later she was found unresponsive. CT and MRI scans showed massive blood clot in the brain with hemorrhage. She died 11 days after vaccination. Her report indicates no medical history or co-morbidities. [https://wonder.cdc.gov/controller/datarequest/D8]\n\nIt is known that adverse reactions to vaccinations are under-reported in the VAERS database. It normally only reflects a small fraction of the adverse event occurrences.[https://vaers.hhs.gov/data/dataguide.html] So, if this is true, it is more likely that 410 to 4100 strokes have occurred in the United States alone within three days of Pfizer vaccination in people under 50 years of age. Bear in mind that this age group normally reflects only four percent of the incidences of stroke overall. VAERS also states that just because an event is recorded it may not be caused by the vaccine [https://www.fda.gov/files/vaccines,%20blood%20&%20biologics/published/Understanding-the-Vaccine-Adverse-Event-Reporting-System-(VAERS).pdf], which could very well be true for some. But the sheer number of these adverse events compared to adverse events for other vaccinations, the ages and health status of the victims, and the timing of the adverse events relative to COVID vaccination are all indicative of the COVID vaccine being the cause.\n\nThe next several screenshots are of the VAERS database searches for death or permanent disability due to strokes within three days of Pfizer vaccination for a 13-month period. [https://wonder.cdc.gov/controller/datarequest/D8] One death was reported in the under-50 age category, and 35 deaths reported in the 50-and-over age range. Seventeen people under 50 have been permanently disabled, and 51 people in the 50-or-above age range are permanently disabled all within three days post-Pfizer COVID-19 vaccination. [https://wonder.cdc.gov/controller/datarequest/D8]\n\nIn conclusion, the number of stroke reports for the Pfizer vaccine in its first year was 561 for all ages compared to zero strokes reported for over 10 different Pfizer influenza vaccines over a four-year period. This alone is a reason for concern. Taking a closer look at the timing of the strokes in relation to vaccination in previously healthy people adds even more credence that the Pfizer COVID vaccine is unsafe. Keep in mind that many of these people were also in an age group in which strokes are generally not prevalent. Stroke is just one of the many adverse events reported in the VAERS database for the Pfizer vaccine. These reports were occurring as early as January 2021; and the CDC, FDA, and Pfizer did not pause in pushing for mass vaccination of the unsuspecting and trusting public, resulting in deaths and permanent disabilities.", "opengraph": {"locale": "en_US", "type": "article", "title": "Report 25: Strokes - What Did Pfizer Know, and When Did They Know It?", "description": "Strokes: What Did Pfizer Know, and When Did They Know It? - Report. Pfizer failed to pause the rollout to look at these adverse events. ", "url": "https://dailyclout.io/strokes-what-did-pfizer-know-and-when-did-they-know-it-report/", "site_name": "DailyClout", "article:publisher": "https://www.facebook.com/dailyclout/", "article:published_time": "2022-06-13T18:36:04+00:00", "article:modified_time": "2022-09-29T19:13:01+00:00", "image": "https://dailyclout.io/wp-content/uploads/18.png", "image:width": "624", "image:height": "327", "image:type": "image/png"}, "tags": ["VAERS", "stroke", "pfizer volunteers", "report", "adverse events", "#Pfizer"], "tweets": [], "movies": [], "links": ["https://wonder.cdc.gov/controller/datarequest/D8", "https://dailyclout.io/what-did-pfizer-know-and-when-did-they-know-it-neurological-harms-concealed/", "https://wonder.cdc.gov/controller/datarequest/D8", "https://www.socialstyrelsen.se/globalassets/sharepoint-dokument/artikelkatalog/statistik/2021-12-7644.pdf", "https://www.socialstyrelsen.se/globalassets/sharepoint-dokument/artikelkatalog/statistik/2021-12-7644.pdf", "https://wonder.cdc.gov/controller/datarequest/D8", "https://wonder.cdc.gov/controller/datarequest/D8", "https://wonder.cdc.gov/controller/datarequest/D8", "https://www.socialstyrelsen.se/globalassets/sharepoint-dokument/artikelkatalog/statistik/2021-12-7644.pdf", "https://wonder.cdc.gov/controller/datarequest/D8", "https://wonder.cdc.gov/controller/datarequest/D8", "https://wonder.cdc.gov/controller/datarequest/D8", "https://wonder.cdc.gov/controller/datarequest/D8", "https://wonder.cdc.gov/controller/datarequest/D8", "https://wonder.cdc.gov/controller/datarequest/D8", "https://wonder.cdc.gov/controller/datarequest/D8", "https://vaers.hhs.gov/data/dataguide.html", "https://www.fda.gov/files/vaccines,%20blood%20&%20biologics/published/Understanding-the-Vaccine-Adverse-Event-Reporting-System-(VAERS).pdf", "https://wonder.cdc.gov/controller/datarequest/D8", "https://wonder.cdc.gov/controller/datarequest/D8", "https://gettr.com/share?text=Report%2025%3A%20Strokes%20-%20What%20Did%20Pfizer%20Know%2C%20and%20When%20Did%20They%20Know%20It%3F&url=https%3A%2F%2Fdailyclout.io%2Fstrokes-what-did-pfizer-know-and-when-did-they-know-it-report%2F", "https://dailyclout.io/strokes-what-did-pfizer-know-and-when-did-they-know-it-report/", "https://gettr.com/share?text=Report%2025%3A%20Strokes%20-%20What%20Did%20Pfizer%20Know%2C%20and%20When%20Did%20They%20Know%20It%3F&url=https%3A%2F%2Fdailyclout.io%2Fstrokes-what-did-pfizer-know-and-when-did-they-know-it-report%2F", "https://dailyclout.io/strokes-what-did-pfizer-know-and-when-did-they-know-it-report/"], "authors": ["Kate Melgoza"], "publish_date": "2022-06-13T18:36:04+00:00"}