{"result_id": "088041", "URL": "https://dailyclout.io/eat-your-vaccines-mrna-gene-therapy-is-coming-to-the-food-supply-this-month/", "timestamp": "2023-04-25 14:56:35 CEST+0200", "meta": {"description": "They've given up on a needle in every arm. Now they're coming for what you eat.", "lang": "en", "keywords": "", "favicon": "https://dailyclout.io/wp-content/uploads/image-2-2-60x60.png", "canonical": "https://dailyclout.io/eat-your-vaccines-mrna-gene-therapy-is-coming-to-the-food-supply-this-month/", "encoding": "UTF-8"}, "image": null, "domain": "dailyclout.io", "title": "Eat Your Vaccines: mRNA Gene Therapy Is Coming to the Food Supply THIS MONTH", "cleaned_text": "Eat Your Vaccines: mRNA Gene Therapy Is Coming to the Food Supply THIS MONTH\n\nThey’ve given up on a needle in every arm. Now they’re coming for what you eat.\n\n“I’ve got documents from the NIH – from 2002 – talking about integrating vaccines into foods,” announced attorney Tom Renz in an eye-opening interview with Dr. Naomi Wolf. “They’ve been working on integrating these [vaccines] into our food supply. They’ve been working on it for at least two decades.”\n\nMr. Renz brought the receipts in his latest Substack piece:\n\n“Here is an article published in the NIH (you know – by our government) talking about foods ‘under application’ to be genetically modified to become edible vaccines – FROM 2013,” he wrote. “The fact that food can be altered to act as a vaccine is not disputable.”\n\nAnd according to attorney Renz’s recent tweet, “lobbyists for the cattleman and pork associations in several states have CONFIRMED they WILL be using mRNA vaccines in pigs and cows THIS MONTH.”\n\n“Gates, the WHO, a ton of these universities: they’re all talking about including mRNA vaccinations as part of the food. They’re going to modify the genes of these foods to make them mRNA vaccines,” he warned in this video.\n\nBut Missouri HB 1169 seeks to counter such an effort. It’s been described as “one of the most controversial bills in history,” but all it is – is a labeling bill. It doesn’t ban anything. You have every right to know if a food product is a gene therapy product. So, if this bill gets passed, it’s a major victory for informed consent and, in all likelihood, our well-being. The entire two-page bill is available to read on DailyClout. Here’s an excerpt:\n\nAny product that has been created to act as, or exposed to processes that could result in the product potentially acting as, a gene therapy or that could otherwise possibly impact, alter, or introduce genetic material or a genetic change into the user of the product, individuals exposed to the product, or individuals exposed to others who have used the product shall be conspicuously labeled with the words “Potential Gene Therapy Product” unless the product is known to be a gene therapy product. Reasonable steps shall be taken to ensure the potential purchaser or user of the product is made aware of the presence of this label. If a product is known to be a gene therapy product, the product shall be conspicuously labeled with the words “Gene Therapy Product”. The provisions of this section shall be liberally construed in favor of disclosure of any potential gene therapy product.\n\nThe bill was written in a way “to be as easy to pass and as hard to oppose as possible,” conveyed attorney Renz.\n\n1.) “It requires labeling and disclosure of any product that has any gene therapy qualities.”\n\n2.) “It requires that if you have a product on the market that has gene therapy qualities, that anyone can call the company and say, ‘hey, how does this spread? ‘Does it shed? Is it spread through contact — through sexual contact? Or is there a way that this can spread?’ And they have to disclose it.”\n\n3.) “It requires informed consent. And informed consent includes serious events or adverse events of special interest. … And it requires informed consent before you be given anything with the gene therapy or medicinal property.”\n\n“I don’t think this is a Democrat bill or Republican bill. It’s sponsored by a Republican (Rep. Holly Jones) but should be universally supported.” However, “[t]his has become the most contentious bill in Missouri history,” he lamented. “All we’re asking for is transparency and disclosure.”\n\nNow, pharma can’t come out and oppose transparency and disclosure. So they would need the agricultural community to have their back. Remember, Bill Gates and the CCP are the two largest holders of agriculture in America. “So these guys [Gates & CCP] throw money at these guys [agricultural associations] — buy off these guys. They’re not representing the local farmers,” attested attorney Renz.\n\nBut here’s the reason this bill is so important.\n\nIf attorney Tom Renz helps pass Missouri HB 1169, “those disclosures and the ability to get that information (is gene therapy in my food?) apply globally.” he explained. “So if we can win in one state, the truth in Missouri is the truth in Iowa. So we’ve got to get everybody on the planet calling these guys, telling them you got to pass this — you got to stand for we the people. All it is – is transparency and disclosure. We don’t even ban it. They can still make their poison foods. I just need to know if I’m eating them.”\n\nAnd if they have to mark and label foods with gene therapy as such, that’s it. It kills the uptake of such food products.\n\nSo, whether you’re in Missouri, Iowa, the United Kingdom, or Australia, you need to help push HB 1169 across the finish line.\n\nBecause as Tom said, if the bill passes in Iowa, “those disclosures and the ability to get that information apply globally.” So, share this bill on social media, call your local legislators — ask your representatives why a bill similar to HB 1169 is not being discussed in your neck of the woods.\n\nThe easiest way to do so is to vote on the interactive DailyClout ‘Billcam’ below to show your support or opposition. You can send the bill through social media and tweet the bill sponsor or your representative.\n\nThey’ve already given up on a needle in every arm. Make them do the same when it comes to inserting gene therapy into your food.", "opengraph": {"locale": "en_US", "type": "article", "title": "Eat Your Vaccines: mRNA Gene Therapy Is Coming to the Food Supply THIS MONTH", "description": "They've given up on a needle in every arm. Now they're coming for what you eat.", "url": "https://dailyclout.io/eat-your-vaccines-mrna-gene-therapy-is-coming-to-the-food-supply-this-month/", "site_name": "DailyClout", "article:publisher": "https://www.facebook.com/dailyclout/", "article:published_time": "2023-04-03T14:01:26+00:00", "article:modified_time": "2023-04-20T17:46:00+00:00", "image": "https://dailyclout.io/wp-content/uploads/tainted-food-1-768x432.png", "image:width": "768", "image:height": "432", "image:type": "image/png"}, "tags": ["the vigilant fox", "Thomas Renz", "gene therapy", "vaccine", "covid19", "vigilant fox", "VigilantFox"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"500\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">BREAKING NEWS: the lobbyists for the cattleman and pork associations in several states have CONFIRMED they WILL be using mRNA vaccines in pigs and cows THIS MONTH. WE MUST SUPPORT <a href=\"https://twitter.com/hashtag/Missouri?src=hash&amp;ref_src=twsrc%5Etfw\">#Missouri</a> <a href=\"https://twitter.com/hashtag/HB1169?src=hash&amp;ref_src=twsrc%5Etfw\">#HB1169</a>. It is LITERALLY the ONLY chance we have to prevent this… NO ONE knows the the… <a href=\"https://t.co/OQ6ti0Xsww\">pic.twitter.com/OQ6ti0Xsww</a></p>\n<p>— Tom Renz (@RenzTom) <a href=\"https://twitter.com/RenzTom/status/1642229969555259395?ref_src=twsrc%5Etfw\">April 1, 2023</a></p></blockquote>\n"], "movies": [], "links": ["https://dailyclout.io/mrna-gene-therapy-is-coming-to-the-food-supply-what-we-can-do-about-it-w-attorney-tom-renz/", "https://tomrenz.substack.com/p/eat-your-vaccines-i-mean-vegtables", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7120417/", "https://twitter.com/hashtag/Missouri?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/HB1169?src=hash&ref_src=twsrc%5Etfw", "https://t.co/OQ6ti0Xsww", "https://twitter.com/RenzTom/status/1642229969555259395?ref_src=twsrc%5Etfw", "https://twitter.com/VigilantFox/status/1641990297142829056?s=20", "https://billcam.dailyclout.io/bill-texts/uNWj5bOW6b", "https://billcam.dailyclout.io/bill-texts/uNWj5bOW6b", "https://billcam.dailyclout.io/bill-texts/uNWj5bOW6b", "https://billcam.dailyclout.io/legislators/20746", "https://tomrenz.substack.com/", "https://potatoes.news/what-if-bill-gates-were-your-neighbor-now-as-farmer", "https://billcam.dailyclout.io/bill-texts/uNWj5bOW6b", "https://billcam.dailyclout.io/bills/CWDxclsTcy/g/hb-1169/creates-provisions-relating-to-required-disclosures-for-certain-products", "https://billcam.dailyclout.io/bills/CWDxclsTcy/g/hb-1169/creates-provisions-relating-to-required-disclosures-for-certain-products", "https://billcam.dailyclout.io/bills/CWDxclsTcy/g/hb-1169/creates-provisions-relating-to-required-disclosures-for-certain-products", "https://billcam.dailyclout.io/bills/CWDxclsTcy/g/hb-1169/creates-provisions-relating-to-required-disclosures-for-certain-products", "https://gettr.com/share?text=Eat%20Your%20Vaccines%3A%20mRNA%20Gene%20Therapy%20Is%20Coming%20to%20the%20Food%20Supply%20THIS%20MONTH&url=https%3A%2F%2Fdailyclout.io%2Feat-your-vaccines-mrna-gene-therapy-is-coming-to-the-food-supply-this-month%2F", "https://dailyclout.io/eat-your-vaccines-mrna-gene-therapy-is-coming-to-the-food-supply-this-month/", "https://gettr.com/share?text=Eat%20Your%20Vaccines%3A%20mRNA%20Gene%20Therapy%20Is%20Coming%20to%20the%20Food%20Supply%20THIS%20MONTH&url=https%3A%2F%2Fdailyclout.io%2Feat-your-vaccines-mrna-gene-therapy-is-coming-to-the-food-supply-this-month%2F", "https://dailyclout.io/eat-your-vaccines-mrna-gene-therapy-is-coming-to-the-food-supply-this-month/"], "authors": ["The Vigilant Fox"], "publish_date": "2023-04-03T14:01:26+00:00"}