{"result_id": "088026", "URL": "https://dailyclout.io/miscarriages-in-covid-19-vaccinated-mothers-as-reported-in-vaers/", "timestamp": "2023-04-25 14:56:21 CEST+0200", "meta": {"description": "Miscarriages in Vaccinated Mothers as Reported in VAERS If you are pregnant, you are more likely to lose your baby in a miscarriage if you rei", "lang": "en", "keywords": "", "favicon": "https://dailyclout.io/wp-content/uploads/image-2-2-60x60.png", "canonical": "https://dailyclout.io/miscarriages-in-covid-19-vaccinated-mothers-as-reported-in-vaers/", "encoding": "UTF-8"}, "image": null, "domain": "dailyclout.io", "title": "Report 48: VAERS - 76% of Vaccine-Related Miscarriages from the Past 30 Years Occurred Once Pregnant Women Started Receiving COVID-19 Vaccines", "cleaned_text": "Report 48: VAERS – 76% of Vaccine-Related Miscarriages from the Past 30 Years Occurred Once Pregnant Women Started Receiving COVID-19 Vaccines\n\nIf you are pregnant, you are more likely to lose your baby in a miscarriage if you receive a COVID-19 vaccine than if you receive measles, mumps, flu, tetanus, or any other vaccine. This and other alarming facts about risks to babies of vaccinated mothers comes from the U.S. government’s own Vaccine Adverse Event Reporting System (VAERS).\n\nAccording to VAERS, from 1990 (when VAERS was established) through March 2022, miscarriages (spontaneous abortions) were reported 4,693 times by women who were vaccinated for all diseases through March 2022 (for hundreds of women, there was a reporting delay of several months). These reports include women who received one or more vaccines for diseases like measles, mumps, flu, and COVID-19. For example, among the 4,693 miscarriages that were reported, several women received vaccines for COVID-19 as well as influenza or hepatitis or another disease. So, their miscarriages were reported multiple times, once for each disease for which they were vaccinated.\n\nTo understand the effect of the COVID-19 vaccine on pregnant women, one must separate those who received multiple vaccines from those who received a single vaccine. The number of women with distinct identification (ID) numbers who miscarried after receiving a vaccine through March 2022 is 4,505. The difference between 4,693 reports of miscarriages and 4,505 distinct identification numbers is 188 (4,693 – 4,505 = 188). So, 188 women miscarried after receiving multiple vaccines, and 4,505 women miscarried after receiving a single vaccine through March 2022.\n\nOf the thousands of miscarriages that were reported after single or multiple vaccinations for all diseases, 3,430 of those miscarriages were in women whose vaccinations, beginning in December 2020, included a COVID-19 vaccine. Of these 3,430 miscarriages, as many as 16 may have been in women who received other vaccines in addition to a COVID-19 vaccine. So, 3,414 miscarriages (3,430 – 16 = 3,414) were in women who received only the COVID-19 vaccine and no other vaccine from December 2020 through March 2022 (Fig. 1).\n\nThis means that of all the women who reported losing their babies to miscarriage after receiving a single vaccine, 76% (3,414/4,505) received only the COVID-19 vaccine. These women were vaccinated for COVID-19 from December 2020 through March 2022. So, 76% of all the vaccinations that resulted in a baby dying in miscarriage in the past 30 years or so occurred when pregnant women started receiving COVID-19 vaccines.\n\nWould these babies have died even if their mothers had not been vaccinated for COVID-19? Certainly that is possible, since we know that as many as 10% to 30% of all pregnant women lose their babies before 13 weeks’ gestation. Later in pregnancy (after 20 weeks), the number of baby deaths, which are then stillbirths and not miscarriages, drops to less than 1%.\n\nUnfortunately, VAERS does not indicate how far along these women were in their pregnancies when they were vaccinated for COVID-19. We can, however, get some information on the duration of a pregnancy from the descriptions entered into VAERS. For example, VAERS describes one mother’s miscarriage (VAERS patient 1185268) as follows: “3/15/2021—Went to my midwife for my first prenatal visit and that’s where I learned there was no heartbeat. 4 weeks along at the time of the vaccine and the heartbeat ended at 8 weeks along. This was my third pregnancy—and my first miscarriage. Estimated date of delivery was in October.”\n\nWhile this is one of many heartbreaking stories, it is not proof that the COVID-19 vaccine caused the miscarriage. Yet it does raise important concerns. Another source of concern is the data in Figure 1, which shows that about 61% (2,067/3,414) of the miscarriages were reported within 30 days (onset days) after the mother was vaccinated for COVID-19. For pregnant women vaccinated for other diseases, about 47% (597/1,279) of the miscarriages resulted within 30 days of vaccination. This difference is statistically significant with p = 0.00 using the test of two proportions.\n\nIn spite of these frightening statistics, the Centers for Disease Control and Prevention (CDC) continues to recommend that pregnant women get the COVID-19 vaccines. In the United States, these vaccines are manufactured by Moderna, Pfizer/BioNTech, and Janssen (Johnson & Johnson). Does VAERS suggest which COVID-19 vaccine is safest for an unborn baby?\n\nIndeed, for women vaccinated for COVID-19 from December 2020 through March 2022, VAERS reports that, of the pregnant women who had miscarriages after vaccination, about 75% (2,557/3,414) received the Pfizer/BioNTech mRNA vaccine. About 21% (733/3,414) received Moderna’s mRNA vaccine, and about 3% (118/3,414) received Janssen’s adenovirus vaccine (Table 1).\n\nThese figures are rough; they would be more accurate if data were provided showing the total number of pregnant women vaccinated with each of the three COVID-19 vaccines and how many of that total received only a COVID-19 vaccine. In addition, the data include those who received more than one manufacturer’s vaccine — for example, a woman may have received both Pfizer/BioNTech and Moderna vaccines. Still, as Team 5 has reported before, the Pfizer/BioNTech mRNA vaccine appears to be putting unborn babies at increased risk of death from miscarriage.\n\nThese are alarming figures, and they are even more so when we understand what VAERS data represent. The U.S. government’s guide to VAERS states, “’Underreporting’ is one of the main limitations of passive surveillance systems, including VAERS. The term underreporting refers to the fact that VAERS receives reports for only a small fraction of actual adverse events.” Some researchers have found that less than 1% of adverse events are reported in VAERS.\n\nSo, one must keep in mind that the estimated 3,414 unborn babies who died after their mothers were vaccinated against COVID-19 and had miscarriages from December 2020 through March 2022 are probably only a small fraction of the actual number of post-vaccination spontaneous abortion “adverse events.” This number may actually be 100 times greater or more.\n\nAs noted, VAERS is simply a registry of passive surveillance data. Such registries are relatively inexpensive to establish and maintain, but the quality and timeliness of the data they collect are difficult to control.\n\nThere are other limitations to data gathered in VAERS. The total count of babies who died in miscarriages after the mothers were vaccinated (4,505) varies depending on the data selection criteria, such as symptoms, vaccine manufacturer, vaccine products, and date vaccinated or reported. Indeed, if the data are sorted by “spontaneous abortion” and “death,” then only 16 events are returned. Appendix A provides further detail on the query used for the data in this report.\n\nIn addition, VAERS has data integrity issues; for example, some time intervals have no data associated with them, some vaccination dates are listed as “9999” (which were included in this analysis), the type of vaccine is often missing, the system does not collect information on how old a fetus was at the time of miscarriage (i.e., how far along the woman’s pregnancy was), and follow-up health records are not available (from the VAERS website: “amended [follow-up] data are not available to the public”), making it difficult to verify cause and effect.\n\nAt best, VAERS data can be used only as a signal that something may be wrong. Clearly, these VAERS data send a strong signal suggesting grave danger to pregnant women and their babies from COVID-19 vaccines. How many more babies will die in miscarriages before the U.S. Centers for Disease Control and Prevention and the Food and Drug Administration (FDA) acknowledge and act on these alarming safety signals?\n\na Data extracted from VAERS October 2022; data include those who received more than one manufacturer’s vaccine (for example, a woman may have received both Pfizer/BioNTech and Moderna vaccines)\n\nWe used the following query parameters in the Vaccine Adverse Event Reporting System (VAERS) database to obtain the data discussed in this report. Fig. A1 is a screenshot of a baseline VAERS request form.\n• Help: See http://wonder.cdc.gov/wonder/help/vaers.html for more information.\n\nNote that the data include only spontaneous abortions (MEDDRA code = 10000234). The scope of the data includes U.S. (45%) and foreign (55%) reports.\n\nExamples of VAERS limitations are illustrated in two screenshots of typical VAERS queries using the graphical user interface. In Fig. A2, there is no indication whether the death is to the mother or the baby. And in Fig. A3, the cause of death is noted as miscarriage, clearly referring to the miscarried baby, not the mother. For example, in the case of VAERS patient 1185268 mentioned earlier, the mother’s miscarriage was recorded as “spontaneous abortion” only. Yet clearly, this miscarriage resulted in the death of a baby, even though VAERS does not classify this as a “death.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Report 48: VAERS - 76% of Vaccine-Related Miscarriages from the Past 30 Years Occurred Once Pregnant Women Started Receiving COVID-19 Vaccines", "description": "Miscarriages in Vaccinated Mothers as Reported in VAERS If you are pregnant, you are more likely to lose your baby in a miscarriage if you rei", "url": "https://dailyclout.io/miscarriages-in-covid-19-vaccinated-mothers-as-reported-in-vaers/", "site_name": "DailyClout", "article:publisher": "https://www.facebook.com/dailyclout/", "article:published_time": "2022-12-01T15:28:51+00:00", "article:modified_time": "2022-12-01T15:38:44+00:00", "image": "https://dailyclout.io/wp-content/uploads/baby-in-the-womb.jpeg", "image:width": "800", "image:height": "642", "image:type": "image/jpeg"}, "tags": ["pregnancy", "adverse event", "pregnant women", "baby die off", "#Pfizer", "covid vaccines", "VAERS", "Covid vaccine", "mothers", "miscarriage", "baby death", "Janssen", "moderna", "JandJ", "johnson and johnson", "baby", "vaccinated mothers", "pregnant", "pfizer vaccine", "moderna vaccine", "pregnancy loss", "spontaneous abortion", "adverse events", "miscarriages", "vaers data"], "tweets": [], "movies": [], "links": ["https://vaers.hhs.gov/about.html", "https://www.acog.org/womens-health/faqs/early-pregnancy-loss", "https://www.ncbi.nlm.nih.gov/books/NBK560521/", "https://www.cdc.gov/ncbddd/stillbirth/facts.html", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/recommendations/pregnancy.html", "https://dailyclout.io/the-facts-about-pfizer-mrna-vaccine-risks-to-unborn-babies/", "https://vaers.hhs.gov/data/dataguide.html", "https://digital.ahrq.gov/ahrq-funded-projects/electronic-support-public-health-vaccine-adverse-event-reporting-system", "https://www.ncbi.nlm.nih.gov/books/NBK11770/", "https://vaers.hhs.gov/data.html", "http://wonder.cdc.gov/wonder/help/vaers.html", "https://gettr.com/share?text=Report%2048%3A%20VAERS%20-%2076%25%20of%20Vaccine-Related%20Miscarriages%20from%20the%20Past%2030%20Years%20Occurred%20Once%20Pregnant%20Women%20Started%20Receiving%20COVID-19%20Vaccines&url=https%3A%2F%2Fdailyclout.io%2Fmiscarriages-in-covid-19-vaccinated-mothers-as-reported-in-vaers%2F", "https://dailyclout.io/miscarriages-in-covid-19-vaccinated-mothers-as-reported-in-vaers/"], "authors": ["Amy Kelly"], "publish_date": "2022-12-01T15:28:51+00:00"}