{"result_id": "088019", "URL": "https://dailyclout.io/the-flu-vaccine-is-too-deadly-to-be-used-and-should-be-pulled-from-the-market/", "timestamp": "2023-04-25 14:56:13 CEST+0200", "meta": {"description": "The Medicare data that the CDC never shows the public makes this crystal clear. I wonder what public benefit there is of hiding this data.", "lang": "en", "keywords": "", "favicon": "https://dailyclout.io/wp-content/uploads/image-2-2-60x60.png", "canonical": "https://dailyclout.io/the-flu-vaccine-is-too-deadly-to-be-used-and-should-be-pulled-from-the-market/", "encoding": "UTF-8"}, "image": null, "domain": "dailyclout.io", "title": "The Flu Vaccine Is Too Deadly to Be Used and Should Be Pulled From the Market", "cleaned_text": "The Flu Vaccine Is Too Deadly to Be Used and Should Be Pulled From the Market\n\nThe US Medicare data (which the CDC hides from view) shows that the flu vaccine causes more than 1 death per million vaccinated making it too unsafe to be used.\n\nThe Medicare data proves that the flu vaccine is too unsafe to use because it kills more than 1 person per million vaccinated, which is the safety threshold noted by vaccine expert Paul Offit.\n\nThe evidence has been in plain sight but nobody seems to care.\n\nI find it really annoying that our government is hiding the safety data on vaccines. How does hiding the data protect the public from harm?\n\nOf course, I’m not a doctor and doctors don’t have any problem at all with their government hiding safety data. Have you ever seen any of them complain about the lack of transparency? Of course not! None of them want their licenses revoked or their grants canceled.\n\nHowever, since I’m not a doctor, I’m not encumbered.\n\nSo I wanted to let you in on a little secret: the government hides the data from us because the vaccines they’ve been promoting are unsafe.\n\nLet’s take the flu vaccine for example.\n\nHave you noticed that the government NEVER shows you the data from Medicare, VSD, BEST, or any other database?\n\nThe record level data we need to make a proper safety assessment is simply never made publicly available.\n\nThe reason is simple: the shots are deadly and should be pulled. If they released the data, everyone would know this. So they keep the data hidden from public view.\n\nThanks to an anonymous HHS employee, I’ve been provided with the “days after death” for the flu vaccine.\n\nI’ve already published the flu charts twice before (here and here) and nobody noticed, even though I pointed it out in my Feb 25 Game Over article, so I’m going to point it out once again now\n\nSee the spike on Day 0?\n\nAt least 375 “excess deaths” on Day 0!\n\nLast I checked, there is no need to vaccinate people for the flu right before they die because the vaccine takes time to have an effect. That’s why there is normally a reduced number of deaths on Day 0 vs. baseline: if you are about to die, they aren’t going to waste time vaccinating you.\n\nBut you can see there are a375 excess deaths on Day 0.\n\nNow consider that this is a subset of all the people who get the flu vaccine in 2021:\n• It’s only people who got the flu shot in Q1 of 2021\n\n375 excess deaths times 1M is more than the population of the US.\n\nSo over 1 person per million died.\n\nThis is above the safety threshold of a vaccine articulated by vaccine expert Paul Offit.\n\nThis means the flu vaccine should be pulled from the market.\n\nI don’t know how I can make it any clearer than that.\n\nAnd the COVID vaccine? Well, it’s killing people at a 1,000X greater rate than the flu shot. It should have been pulled long ago. Check out this analysis by Denis Rancourt that, after accumulating 100K views, was pulled from ResearchGate. It’s a quality analysis. For example, one of my colleagues who NEVER texts me on ANY papers, texted me to look at this one: “Just published. This data is really stunning.”\n\nBut the health authorities are looking the other way and the doctors just blindly do whatever the CDC says, no matter how many people are killed.\n\nPlease Help the DailyClout / War Room Volunteers Blow the Biggest Story of Our Lifetime Wide Open\n\nThe information that Pfizer and the FDA wanted to keep hidden for 75 years has been thoroughly documented and compiled into an ebook – and made available on Amazon.\n\nWe are shattering expectations, but we need your continued support to push truth up the algorithm, which is not just good for the book and the project but also for the conversation, forcing the criminals to be confronted. We already have the blueprint for prosecution; we just need enough people aware of the crime that has occurred — demanding accountability:\n\nAlso available on our website.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Flu Vaccine Is Too Deadly to Be Used and Should Be Pulled From the Market", "description": "The Medicare data that the CDC never shows the public makes this crystal clear. I wonder what public benefit there is of hiding this data.", "url": "https://dailyclout.io/the-flu-vaccine-is-too-deadly-to-be-used-and-should-be-pulled-from-the-market/", "site_name": "DailyClout", "article:publisher": "https://www.facebook.com/dailyclout/", "article:published_time": "2023-03-18T02:28:57+00:00", "image": "https://dailyclout.io/wp-content/uploads/photo_2023-03-17_22-27-08-1.jpg", "image:width": "800", "image:height": "600", "image:type": "image/jpeg"}, "tags": ["Flu Vaccine", "vaccine", "steve kirsch", "covid19", "CDC"], "tweets": [], "movies": [], "links": ["https://stevekirsch.substack.com/p/the-flu-vaccine-is-too-deadly-to", "https://stevekirsch.substack.com/p/according-to-dr-paul-offit-we-should", "https://stevekirsch.substack.com/p/a-worldwide-call-for-data-transparency", "https://stevekirsch.substack.com/p/new-israeli-moh-study-shows-covid", "https://stevekirsch.substack.com/p/game-over-medicare-data-shows-the", "https://stevekirsch.substack.com/p/game-over-medicare-data-shows-the", "https://stevekirsch.substack.com/p/according-to-dr-paul-offit-we-should", "https://twitter.com/denisrancourt/status/1625609456032616449?lang=en", "https://stevekirsch.substack.com/", "https://dailyclout.io/product/war-room-dailyclout-pfizer-documents-analysis-volunteers-reports/", "https://www.amazon.com/DailyClout-Documents-Analysis-Volunteers-Reports-ebook/dp/B0BSK6LV5D/", "https://www.amazon.com/DailyClout-Documents-Analysis-Volunteers-Reports-ebook/dp/B0BSK6LV5D", "https://www.amazon.com/DailyClout-Documents-Analysis-Volunteers-Reports-ebook/dp/B0BSK6LV5D/", "https://dailyclout.io/product/war-room-dailyclout-pfizer-documents-analysis-volunteers-reports/", "https://gettr.com/share?text=The%20Flu%20Vaccine%20Is%20Too%20Deadly%20to%20Be%20Used%20and%20Should%20Be%20Pulled%20From%20the%20Market&url=https%3A%2F%2Fdailyclout.io%2Fthe-flu-vaccine-is-too-deadly-to-be-used-and-should-be-pulled-from-the-market%2F", "https://dailyclout.io/the-flu-vaccine-is-too-deadly-to-be-used-and-should-be-pulled-from-the-market/", "https://stevekirsch.substack.com/", "https://gettr.com/share?text=The%20Flu%20Vaccine%20Is%20Too%20Deadly%20to%20Be%20Used%20and%20Should%20Be%20Pulled%20From%20the%20Market&url=https%3A%2F%2Fdailyclout.io%2Fthe-flu-vaccine-is-too-deadly-to-be-used-and-should-be-pulled-from-the-market%2F", "https://dailyclout.io/the-flu-vaccine-is-too-deadly-to-be-used-and-should-be-pulled-from-the-market/"], "authors": ["DailyClout"], "publish_date": "2023-03-18T02:28:57+00:00"}