{"result_id": "088040", "URL": "https://dailyclout.io/stanford-will-no-longer-be-requiring-vaccination-for-students-on-april-10-2023/", "timestamp": "2023-04-25 14:56:33 CEST+0200", "meta": {"description": "I am a parent of a former Stanford student and I am friends with several students who are currently enrolled at Stanford.", "lang": "en", "keywords": "", "favicon": "https://dailyclout.io/wp-content/uploads/image-2-2-60x60.png", "canonical": "https://dailyclout.io/stanford-will-no-longer-be-requiring-vaccination-for-students-on-april-10-2023/", "encoding": "UTF-8"}, "image": null, "domain": "dailyclout.io", "title": "Stanford Will No Longer Be Requiring Vaccination for Students on April 10, 2023", "cleaned_text": "Here’s the official email announcing the change. There is no rationale given for the change.\n\nBelow is the op-ed I wrote for the Stanford Daily on March 21, 2023. They ghosted me after I sent it to them. Feel free to plagiarize.\n\nI am a parent of a former Stanford student and I am friends with several students who are currently enrolled at Stanford.\n\nShortly after Stanford adopted a policy of requiring vaccination for students, on June 28, 2021, I arranged a meeting between top vaccine scientists and Stanford Medical School Dean Lloyd Minor and two of his colleagues to try to dissuade them from pursuing this policy. They let us do all the talking, did not respond to any of our points, and ended the meeting with the message which was essentially, “Thank you for sharing. Don’t bother to contact us again.”\n\nToday, it is even more clear that the evidence shows that Stanford’s current vaccine policy is more likely to be harmful than helpful and should be dropped immediately.\n\nFor example, an essay published in the British Medical Journal (BMJ) entitled “COVID-19 vaccine boosters for young adults: a risk benefit assessment and ethical analysis of mandate policies at universities” concludes that university booster mandates for students are unethical and provides five different reasons, each of which is sufficient on its own to halt the mandates. The essay was written by top scientists at Harvard, Johns Hopkins, Oxford, and UCSF. Did they make a mistake? If so, what was it so we can have the paper corrected or retracted.\n\nNone of the booster shots have a single safety study showing a net all-cause mortality or morbidity benefit for either the recipient or the community. Does Stanford have evidence that these booster shots have a positive risk-benefit ratio? If so, why can’t we see it?\n\nIn fact, from the evidence in plain sight, the opposite appears to be the case. I did a survey of college students suspected of having died from the COVID vaccine compared to the COVID virus and found over 10 times as many students were suspected of having been killed by the vaccine as from the virus. If this is not the case, can Stanford explain how they were able to determine that most of the more than 137 college students listed in that survey died from other causes?\n\nIt remains extremely troubling to me that not a single state in the United States is willing to publicly release the death-vax records for their state that can be analyzed to definitively answer whether the vaccines have reduced mortality rates or increased mortality rates.\n\nWhy are these records kept from public view? They can be easily anonymized to protect privacy. I’ve even personally publicly offered to pay the expenses to do the database merge and privacy protection for any US state or country willing to make the information available. For some reason, they all stop talking to me when I make this offer. It’s almost as if they are hiding something.\n\nWhy isn’t anyone from Stanford asking for this key source data to be made public? Are we afraid of finding out the truth about these vaccines?\n\nThere are some people who believe that the vaccines are perfectly safe and that nobody has been killed by the vaccines. Perhaps they can explain the Mark Skidmore paper, published in a peer-reviewed journal, which concluded that “the total number of fatalities due to COVID-19 inoculation may be as high as 278,000 (95% CI 217,330–332,608) when fatalities that may have occurred regardless of inoculation are removed.”\n\nThat number was for the US in 2021 alone. Skidmore estimates the number was much higher in 2022. That’s over 500,000 Americans killed by the “safe and effective” COVID vaccine.\n\nSome people would point to the 26 January 2023 Editor’s Note attached to the Skidmore paper as evidence that the result can be ignored. This is not true. I have talked to the author and the objections received by the journal are all related to details that have nothing to do with the paper’s conclusion. For example, one objection that the journal had after the paper was peer-reviewed and published was that Skidmore did not go into detail about the views of each of the funders of his study. This is something which is never done for other papers. Professor Skidmore has published over 70 papers in his career and none have been challenged like this paper.\n\nFinally, the latest study of vaccine efficacy from the Cleveland Clinic shows that the more people are vaccinated, the more they are likely to be infected. In short, the vaccines are actually doing exactly the opposite of what they were originally intended to do. As far as I know, nobody has been able to successfully challenge that study. The mainstream press ignored it. Did Stanford officials find a flaw in that paper or the methodology? If so, is there a reason they are remaining silent about it?\n\nThe bottom line is that the evidence is overwhelming that vaccine booster requirements are unethical and should be immediately halted. Stanford should follow the science and not the politics.\n\nIt remains deeply troubling to me that even respected Stanford professors such as Jay Bhattacharya are ghosted when they try to ask the Stanford administration questions about the logic behind Stanford’s inexplicable vaccine booster mandate.\n\nWho are the people responsible for Stanford’s policy, what independent analysis did they do to justify their decision, and why aren’t they willing to be challenged by Stanford experts such as Professor Bhattacharya in an open public forum?\n\nNote: Here’s the original, longer Letter to the Stanford Daily", "opengraph": {"locale": "en_US", "type": "article", "title": "Stanford Will No Longer Be Requiring Vaccination for Students on April 10, 2023", "description": "I am a parent of a former Stanford student and I am friends with several students who are currently enrolled at Stanford. ", "url": "https://dailyclout.io/stanford-will-no-longer-be-requiring-vaccination-for-students-on-april-10-2023/", "site_name": "DailyClout", "article:publisher": "https://www.facebook.com/dailyclout/", "article:published_time": "2023-04-07T13:52:53+00:00", "image": "https://dailyclout.io/wp-content/uploads/Screenshot-2023-04-07-094544.png", "image:width": "855", "image:height": "717", "image:type": "image/png"}, "tags": ["injections", "Covid", "Mandates", "daily", "mrna", "Vaccines", "student", "covid19", "stanford", "no college mandates"], "tweets": [], "movies": [], "links": ["https://twitter.com/DrJBhattacharya/status/1643780586572754945?s=20", "https://studentaffairs.stanford.edu/covid-guidance/covid-19-testing-vaccination-and-health-check-requirements/booster-shot-information", "https://jme.bmj.com/content/early/2022/12/05/jme-2022-108449", "https://stevekirsch.substack.com/p/why-arent-any-colleges-showing-us", "https://stevekirsch.substack.com/p/a-worldwide-call-for-data-transparency", "https://stevekirsch.substack.com/p/a-worldwide-call-for-data-transparency", "https://bmcinfectdis.biomedcentral.com/articles/10.1186/s12879-023-07998-3", "https://bmcinfectdis.biomedcentral.com/articles/10.1186/s12879-023-07998-3", "https://stevekirsch.substack.com/p/very-large-cleveland-clinic-study", "https://margaretannaalice.substack.com/p/letter-to-the-stanford-daily"], "authors": ["Kate Melgoza"], "publish_date": "2023-04-07T13:52:53+00:00"}