{"result_id": "088022", "URL": "https://dailyclout.io/exclusive-mother-sues-d-c-doctor-who-gave-kids-covid-vaccines-without-consent/", "timestamp": "2023-04-25 14:56:16 CEST+0200", "meta": {"description": "Children’s Health Defense is funding a lawsuit by a D.C. mother alleging a doctor vaccinated two of her children for COVID-19 without her", "lang": "en", "keywords": "", "favicon": "https://dailyclout.io/wp-content/uploads/image-2-2-60x60.png", "canonical": "https://dailyclout.io/exclusive-mother-sues-d-c-doctor-who-gave-kids-covid-vaccines-without-consent/", "encoding": "UTF-8"}, "image": null, "domain": "dailyclout.io", "title": "Exclusive: Mother Sues D.C. Doctor Who Gave Kids COVID Vaccines Without Consent", "cleaned_text": "Children’s Health Defense is funding a lawsuit by a D.C. mother alleging a doctor vaccinated two of her children for COVID-19 without her consent after falsely telling the teens the shots were required for school.\n\nThe mother of two children who were given COVID-19 vaccines without the mother’s consent is suing the doctor who administered the vaccines.\n\nAn attorney representing NaTonya McNeil last week filed a lawsuit in Superior Court for the District of Columbia against Janine A. Rethy, M.D., M.P.H.\n\nAccording to the complaint, on Sept. 2, 2022, McNeil took her two older children, ages 15 and 17, to the KIDS Mobile Medical Clinic/Ronald McDonald Care Mobile clinic, operated by Georgetown Hospital, to complete their required annual physical exam for the 2022-2023 school year.\n\nThe lawsuit alleges Rethy, director of the mobile clinic, held the children in the examination room longer than necessary for a regular check-up and vaccinated them against COVID-19 over their objections and without consulting their mother\n\nIn order to attempt to obtain the children’s consent — which they are not legally able to provide without a parent or guardian — the doctor falsely informed the children the COVID-19 vaccine was mandatory for school attendance and told them they could not lawfully decline it if they wanted to attend school.\n\nThe suit, filed by D.C. Attorney Matthew Hardin, seeks damages for false imprisonment, battery and fraud.\n\nChildren’s Health Defense (CHD) is financing the lawsuit because, according to CHD President and General Counsel Mary Holland, “CHD couldn’t just sit still and not allow this wrong to go unpunished and not bring this to the public’s attention.”\n\nIn an exclusive conversation with The Defender, McNeil explained why she is suing the the doctor:\n\n“I just feel like people shouldn’t be able to do whatever they want to do to other people and especially not to children. As a mother, I feel like, ‘You all just took all my rights away from me to do what you wanted to do to my kids.’\n\n“I do want justice to be done in this case. I feel like something needs to be done. This can’t just continue to happen.”\n\nAccording to the complaint, Rethy’s stated goal is to vaccinate all children against COVID-19. The complaint quotes her statement to the press:\n\n“Our goal is to increase vaccination rates in children here in D.C. . . . For more than 30 years our role has been to be in the community to help address the problem of health disparities, bringing families care where they are.\n\n“For this particular effort, we are glad to be partnering with DC Health to provide both regular childhood vaccines and COVID-19 vaccines to all children.”\n\nIn addition to her role as director of the mobile clinic, Rethy is chief of MedStar Georgetown University Hospital’s Division of Community Pediatrics and assistant professor of pediatrics at Georgetown University School of Medicine.\n\nMcNeil said that when she took her older children to the clinic, she stayed outside the examination room to care for her infant. As soon as the children entered the doctor’s office, she called her daughter’s cellphone to let Rethy know she was just outside the door if the doctor needed to consult her for anything.\n\nAccording to McNeil, the doctor did not ask or inform her about any vaccinations, and did not ask her to sign anything. At the end of the physical, Rethy came out to talk to her.\n\nMcNeil said the doctor explained her son’s asthma treatment plan, but that’s all they discussed.\n\nAs they were heading home, McNeil said she was shocked when her daughter complained that her arm hurt “pretty bad.” When McNeil asked her why it hurt, her daughter said she was given the COVID-19 shot, even though she told the doctor she didn’t want it.\n\nPlease Help the DailyClout / War Room Volunteers Blow the Biggest Story of Our Lifetime Wide Open\n\nThe information that Pfizer and the FDA wanted to keep hidden for 75 years has been thoroughly documented and compiled into an ebook – and made available on Amazon.\n\nWe are shattering expectations, but we need your continued support to push truth up the algorithm, which is not just good for the book and the project but also for the conversation, forcing the criminals to be confronted. We already have the blueprint for prosecution; we just need enough people aware of the crime that has occurred — demanding accountability:\n\nAlso available on our website.", "opengraph": {"locale": "en_US", "type": "article", "title": "Exclusive: Mother Sues D.C. Doctor Who Gave Kids COVID Vaccines Without Consent", "description": "Children’s Health Defense is funding a lawsuit by a D.C. mother alleging a doctor vaccinated two of her children for COVID-19 without her", "url": "https://dailyclout.io/exclusive-mother-sues-d-c-doctor-who-gave-kids-covid-vaccines-without-consent/", "site_name": "DailyClout", "article:publisher": "https://www.facebook.com/dailyclout/", "article:published_time": "2023-03-07T19:11:56+00:00", "article:modified_time": "2023-03-07T22:24:06+00:00", "image": "https://dailyclout.io/wp-content/uploads/chd-lawsuit-kids-covid-vaccine-feature-800x417-1.jpg", "image:width": "800", "image:height": "417", "image:type": "image/jpeg"}, "tags": ["children", "student", "doctors", "parental", "Children's Health Defense", "Medical Freedom", "consent"], "tweets": [], "movies": [], "links": ["https://dailyclout.io/wp-content/uploads/chd-lawsuit-kids-covid-vaccine-feature-800x417-1.jpg", "https://childrenshealthdefense.org/wp-content/uploads/NaTonya_mcneil_lawsuit_janine_rethy_Redacted.pdf", "https://www.medstarhealth.org/doctors/janine-a-rethy-md-mph", "https://rmhcdc.org/what-we-do/ronald-mcdonald-care-mobile/kids-mobile-medical-clinic-ronald-mcdonald-care-mobile-kmmc-rmcm/", "https://childrenshealthdefense.org/defender_category/covid/", "https://hardinlawpllc.com/", "https://childrenshealthdefense.org/", "https://childrenshealthdefense.org/defender/", "https://childrenshealthdefense.org/defender/mother-sues-doctor-kids-covid-vaccines-without-consent/", "https://dailyclout.io/product/war-room-dailyclout-pfizer-documents-analysis-volunteers-reports/", "https://www.amazon.com/DailyClout-Documents-Analysis-Volunteers-Reports-ebook/dp/B0BSK6LV5D/", "https://www.amazon.com/DailyClout-Documents-Analysis-Volunteers-Reports-ebook/dp/B0BSK6LV5D", "https://www.amazon.com/DailyClout-Documents-Analysis-Volunteers-Reports-ebook/dp/B0BSK6LV5D/", "https://dailyclout.io/product/war-room-dailyclout-pfizer-documents-analysis-volunteers-reports/", "https://gettr.com/share?text=Exclusive%3A%20Mother%20Sues%20D.C.%20Doctor%20Who%20Gave%20Kids%20COVID%20Vaccines%20Without%20Consent&url=https%3A%2F%2Fdailyclout.io%2Fexclusive-mother-sues-d-c-doctor-who-gave-kids-covid-vaccines-without-consent%2F", "https://dailyclout.io/exclusive-mother-sues-d-c-doctor-who-gave-kids-covid-vaccines-without-consent/"], "authors": ["Kate Melgoza"], "publish_date": "2023-03-07T19:11:56+00:00"}