{"result_id": "088044", "URL": "https://dailyclout.io/two-case-reports-of-harms-caused-by-the-vaccine-mandates/", "timestamp": "2023-04-25 14:56:37 CEST+0200", "meta": {"description": "The stress of persecution can be lethal by itself.", "lang": "en", "keywords": "", "favicon": "https://dailyclout.io/wp-content/uploads/image-2-2-60x60.png", "canonical": "https://dailyclout.io/two-case-reports-of-harms-caused-by-the-vaccine-mandates/", "encoding": "UTF-8"}, "image": null, "domain": "dailyclout.io", "title": "Two Case Reports of Harms Caused by the Vaccine *Mandates*", "cleaned_text": "Two Case Reports of Harms Caused by the Vaccine *Mandates*\n\nThe stress of persecution can be lethal by itself.\n\nI have been extremely busy with multiple projects over the past few weeks, on top of a regular job and multiple medical issues, leaving me little time to write.\n\nAn under-explored dimension of the harms inflicted via vaccine mandates is the morbidity and mortality caused by the inherent persecution levied by such mandates against those who did not wish to get vaccinated. Whereas for someone harmed or killed by a vaccine they were coerced into accepting, the link between the mandate and subsequent injury suffered is obvious, injuries caused by the economical or psychological trauma inflicted by vaccine mandates are not as readily apparent.\n\nThis does not make them any less real. For someone suffering the torment of vaccine mandate distresses – such as the stress of losing their only means of making a living, social ostracization, or the confusion and self-doubt from being relentlessly gaslit that they are crazy and irrational to have any doubts about the “safe and effective” vaccines – the pain and the burdens are often unbearable and devastating.\n\nThe following two case report studies put human faces on this dimension of evil public health policy carnage, and are worth exploring to convey a clear sense of the very tangible and violent abuse perpetrated by vaccine mandates.\n\nSpontaneous Coronary Artery Dissection [SCAD] in the Setting of COVID-19 Pandemic-Related Stressors: A Case Report\n\nThis case report describes a potentially life-threatening cardiac event suffered by a woman that her doctors attributed as most likely due to the stress caused by losing her job due to refusing to get vaccinated. The authors of this study do a fairly good job of fleshing out the link between the stress of unemployment and developing SCAD.\n\nFirstly, the authors are (surprisingly) quite blunt and forthright describing the probable connection between the vaccine mandate-related unemployment and the myocardial infarction brought on by the SCAD. This is atypical for pandemic literature, where anything critical of a mainstream pandemic policy is very gently worded to avoid portraying the mainstream narrative in any sort of negative light. (That merely stating scientific information in a clear and concise manner within scientific literature is a praiseworthy revolutionary act speaks volumes about the current state of institutional science.)\n\nThe following are selected excerpts (emphasis mine):\n\nThe authors even go out of their way to point out the existence of prior evidence suggesting a connection between myocardial infarctions due to SCAD and stress, particularly stress related to unemployment:\n\nThe authors even highlight that the American Heart Association – which seems to be wholly comprised of fanatical vaccine cultists – emphasizes the necessity of emotional support in treating SCAD:\n\nOf course, they cannot come out and openly suggest that rescinding vaccine mandates might be warranted in order to promote patient welfare, but that is the unavoidable conclusion from their analysis. The authors come as close to the line as is possible without saying so explicitly:\n\nGiven the facts of this case, by asserting that “short- and long-term management of these patients should include psychosocial interventions to address the underlying causes of their emotional stressors in addition to usual medical management”, the authors are actually arguing that stress resulting from vaccine mandates – and in particular, unemployment – requires treatment and intervention inasmuch as the medical components of SCAD do. There is only ONE effective intervention to treat this: rescission of vaccine mandates as a condition of employment. Obviously, bullying or forcing patients to submit to vaccination so they can retain or resume employment will only serve to exacerbate their already dangerous levels of stress on account of the vaccine mandates.\n\nYes, the authors also raise the specter of broadly ranging “pandemic-related” stressors. However, in light of the broadside they launched against the vaccine mandates, this ‘infraction’ is forgivable; and it also was probably necessary to include in order to get such a blunt indictment of mainstream policy published.\n\nWarning: There are extremely graphic pictures of dismembered body parts in the study discussed and linked to below, including in the PubMed abstract. Follow the links at your own peril.\n\n“Freedom and Dignity Are Worth More than Life”: The Dramatic Suicide of an Anti-Vax Man\n\nThe second case report describes a forensic investigation of a suicide by train collision committed in order to highlight the moral travesty of vaccine mandates, that occurred in Italy, and was published in a Special Issue “Old Issues and New Challenges in Forensic and Legal Medicine”. (I couldn’t find any English-language media reports of the story, which is rather odd to say the least.)\n\nSuicide note that was found in the victim’s clothing pockets\n\nHere’s the story, as described by the authors: (bracketed italics commentary are my additions)\n\nOn a cold January afternoon in 2022, the railway police alerted our Institute of Legal Medicine of the occurrence of a railway investment near a train station. The authors of the present paper had been commissioned by the local law enforcement for crime scene investigation. Upon our arrival at the site, investigators told us that a man reached the railway by his bike and remained on the spot, declaring his will to kill himself. Despite people in the station shouting at him to move away, the man was eventually hit by the upcoming train travelling at a speed of about 150 km/h. The man’s body laid across the railroad track and was extensively segmented [i.e. the train literally blew apart his body into a bunch of pieces, almost as if he’d been drawn and quartered], with the projection of blood, bone fragments, and soft tissue pieces along several hundred meters of the track itself. The judicial authority asked for the corpse forensic examination, the pieces of which were then collected and moved from the investment site [i.e. where the collision happened] to the Institute of Legal Medicine in Bari.\n\nIn other words, this fellow was a completely normal and healthy individual. However, as a consequence of standing up to the covid vaccine mandates, he experienced profound intellectual or cognitive dissonance, and then social isolation. He ultimately decided to take his own life in a gruesome manner in order to spur resistance and nullification of the vaccine mandates. He made this decision free of drugs, alcohol or other substances that can influence or muddle the clarity of one’s thoughts and perception.\n\nSuicide as a means of resistance or political defiance is not a novel tactic, such as the Tibetan monks who deliberately chose death by fire to raise awareness of the evil Chinese subjugation and genocide of Tibet:\n\nStudy analysis of the psychological impact of vaccine mandates\n\nHere is where this study goes off the rails. Unlike the prior case report, the authors here do not restrain themselves to scientific discourse. I suspect that the facing the genuine convictions of someone willing to die to expose the blatant wickedness of their own orthodoxy left them somewhat unsettled. People do not make a deliberate choice to commit suicide for light or transient reasons. Clearly, this person was sufficiently distressed and traumatized by the vaccine mandates and subsequent emotional stress suffered on account of the discriminatory persecution of the unvaccinated to conclude that suicide was warranted and perhaps even desired.\n\nAccurately describing the psychosocial influences of the vaccine mandates upon the decedent threatened the authors with severe cognitive dissonance. It would naturally follow that they would choose to belittle and malign all anti-vaxxers as a means of sparing themselves from having to grapple with the uncomfortable possibilities brought up by the specter of a protest suicide.\n\nThis study at times reads more like a polemic than anything scientific – scientific literature is supposed to be a droll phlegmatic disquisition constrained to the facts and analysis, not impassioned commentary on the dangers of political factions or movements. This study vacillates in a schizophrenic-like manner switching between flowery prose, biting philippic, and dense academic vernacular. Additionally, the authors unabashedly embrace the role of full-on propagandists, going full–Hotez with the anti-vaxxer bashing\n\nNo doubt about the *effectiveness* of vaccines (and the other equally unicorn fairy dust voodoo interventions)?????????\n\nIt is unmistakably evil to afflict millions of people with economical and emotional trauma by mandating vaccines, even if vaccination would be clearly beneficial as a purely abstract scientific matter, let alone by mandating something that confers no medical benefit and what is likely the most lethal iatrogenic intervention in history.\n\nNonetheless, the establishment has relentlessly demonized & dehumanized those who refused the covid vaccines. President Biden infamously threatened, “We are looking at a winter of severe illness and death for the unvaccinated — for themselves, their families and the hospitals they’ll soon overwhelm.”\n\nSimilarly, a Canadian study tried to insinuate that “the choice of some individuals to refuse vaccination is likely to affect the health and safety of vaccinated people in a manner disproportionate to the fraction of unvaccinated people in the population”. In other words, “Being with unvaccinated people increases COVID-19 risk for those who are vaccinated.”\n\nThe unvaccinated (and many of those who were vaccinated) rightly perceived these as abhorrent threats. People have a vested interest in their predictions or statements being perceived as accurate, which biases them to be less than fully honest about anything that demonstrates they were wrong. This is especially pronounced for proclamations made to the public with great fanfare, and all the more so regarding an issue of enormous practical and moral consequence.\n\nAdditionally, as a group, the ‘public health community’ regards anti-vaxxers with utter disdain and revulsion; and even views them as enemies who mortally imperil the welfare for the entire society.\n\n‘America’s deadly flirtation’ implies that the consequences are potentially lethal for America (and the rest of the world too).\n\nThe inevitable consequence of public denouncements of the unvaccinated is that those who made them are necessarily rooting for the unvaccinated to suffer the grim fates they had articulated, at least in part, having invested themselves and their credibility in this narrative.\n\nComing full circle, perhaps these case reports represent the aspired outcomes for the unvaccinated, in the minds of the myriad public health officials that opined about the impending catastrophe of unvaccinated morbidity and mortality. A chilling thought indeed.", "opengraph": {"locale": "en_US", "type": "article", "title": "Two Case Reports of Harms Caused by the Vaccine *Mandates*", "description": "The stress of persecution can be lethal by itself.", "url": "https://dailyclout.io/two-case-reports-of-harms-caused-by-the-vaccine-mandates/", "site_name": "DailyClout", "article:publisher": "https://www.facebook.com/dailyclout/", "article:published_time": "2023-03-21T15:19:22+00:00", "image": "https://dailyclout.io/wp-content/uploads/55679206-b76c-4c5d-87be-37fea7e883fe_1057x675.webp", "image:width": "424", "image:height": "271", "image:type": "image/webp"}, "tags": ["Ashmedai", "covid19"], "tweets": [], "movies": [], "links": ["https://ashmedai.substack.com/p/2-case-reports-of-harms-caused-by", "https://pubmed.ncbi.nlm.nih.gov/35419243/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8995053/#REF2", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8995053/#REF4", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8995053/#REF5", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8995053/#REF13", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8995053/#REF14", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8995053/#REF15", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8995053/#REF9", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8995053/#REF9", "https://pubmed.ncbi.nlm.nih.gov/36360482/", "https://www.mdpi.com/journal/healthcare/special_issues/challenges_forensic", "https://www.smithsonianmag.com/smart-news/why-have-so-many-of-tibets-monks-set-themselves-on-fire-17737485/", "https://pubmed.ncbi.nlm.nih.gov/33998265/", "https://pubmed.ncbi.nlm.nih.gov/34793741/", "https://pubmed.ncbi.nlm.nih.gov/33630759/", "https://www.whitehouse.gov/briefing-room/speeches-remarks/2021/12/16/remarks-by-president-biden-after-meeting-with-members-of-the-covid-19-response-team/", "https://www.cmaj.ca/content/194/16/E573", "https://www.ctvnews.ca/health/coronavirus/being-with-unvaccinated-people-increases-covid-19-risk-for-those-who-are-vaccinated-study-finds-1.5874632", "https://gettr.com/share?text=Two%20Case%20Reports%20of%20Harms%20Caused%20by%20the%20Vaccine%20%2AMandates%2A&url=https%3A%2F%2Fdailyclout.io%2Ftwo-case-reports-of-harms-caused-by-the-vaccine-mandates%2F", "https://dailyclout.io/two-case-reports-of-harms-caused-by-the-vaccine-mandates/", "https://ashmedai.substack.com/", "https://gettr.com/share?text=Two%20Case%20Reports%20of%20Harms%20Caused%20by%20the%20Vaccine%20%2AMandates%2A&url=https%3A%2F%2Fdailyclout.io%2Ftwo-case-reports-of-harms-caused-by-the-vaccine-mandates%2F", "https://dailyclout.io/two-case-reports-of-harms-caused-by-the-vaccine-mandates/"], "authors": ["DailyClout"], "publish_date": "2023-03-21T15:19:22+00:00"}