{"result_id": "089003", "URL": "https://www.dailygrail.com/2018/12/review-peter-bebergals-strange-frequencies/", "timestamp": "2023-04-25 14:56:50 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.dailygrail.com/wp-content/uploads/2020/12/cropped-TDG-favicon-1.png?fit=32%2C32&ssl=1", "canonical": "https://www.dailygrail.com/2018/12/review-peter-bebergals-strange-frequencies/", "encoding": "UTF-8"}, "image": null, "domain": "www.dailygrail.com", "title": "Review: Peter Bebergal's \"Strange Frequencies\"", "cleaned_text": "Magick, as it is presented in modern pop culture, is nearly always an ancient thing: dusty books, Latin incantations, secret orders of antiquity. And yet magick has always been about a quest for knowledge and powers beyond the current paradigm (which is part of the reason why Clarke’s aphorism “Any sufficiently advanced technology is indistinguishable from magic” resonates so strongly).\n\nWho needs to develop powers of mentally talking to someone in a different location when we have a smartphone, some might ask? Why invoke an infernal power to ward off sickness, when we have microbiology and vaccines? Is our god-like science and technology of the 21st century the ultimate rebuttal to an interest in occult powers, or is it a direct result of it and an ongoing place of intersection?\n\nThese questions lie at the heart of Peter Bebergal’s book Strange Frequencies: The extraordinary story of the technological quest for the supernatural. Bebergal, a fantastic writer on the place of the occult in our world (his previous book Season of the Witch: How the Occult Saved Rock n’ Roll explored the influence of magick on modern music), goes on a personal journey of exploration, in which he attempts to create golems and automatons, attends a seance, and gets his consciousness altered via a performance of stage magic.\n\nIn the first couple of chapters, Bebergal looks at humanity’s desire to mimic the power of the gods by creating life, firstly through the magical golem, and then the more modern technology of the automaton (Mary Shelley’s Frankenstein, he notes, appears to be “the location where the golem becomes technology, rather than a religious or magical device.”):\n\nAfter that, he attends a performance of Shakespeare’s The Tempest, produced by an expert stage magician (Teller, of the famous magical duo Penn & Teller). By not just alluding to the supernatural feats of the play, but performing them with professional magical skills and technology, Bebergal notes that the performance becomes something perhaps more ‘magick’ than ‘magic’.\n\n“Indeed”, the most potent magic is performance,” he notes. “Whether initiated by the shaman, witch, or magician in a chalk-drawn circle, it is in the performative moment that our consciousness is altered.” He then goes on to explore other transformative technologies of supernatural stage performances, including Pepper’s Ghost and the Llullian wheel, and the intersection of ‘maker’ culture with occult interest.\n\nBebergal then joins ‘spirit photographer’ Shannon Taggart at the community of mediums in Lily Dale to explore the topic of Spiritualism, and how technology might offer another ‘medium’ through which the spirits could manifest to us. Taggart makes for a good subject, given the huge interest – and subsequent disappointment – in the topic of spirit photography in the 19th century (where trickery that is obvious to modern eyes was used to amaze believers in the early days of photography). Initially, there was a belief that “just as the microscope and the telescope exposed the hidden aspects of the material world, it was not so implausible that the wondrous extraordinary technology fo the camera might reveal another hidden realm.”\n\nThis section, where Bebergal discusses how fin de siècle films such as Photographing a Ghost and Georges Méliès The Four Troublesome Heads demonstrated how technology allowed “the most fantastical images” to be produced on film, brought to mind the similar problem in modern UFO research, where no photographs or video can really be trusted as evidence any longer. Plus ça change, plus c’est la même chose…\n\nMoving on from the camera, Bebergal then investigates the topic of EVP (‘electronic voice phenomenon’ – also sometimes called ITC, for ‘instrumental transcommunication’), in which the spirits allegedly speak through electronic equipment (and thus can also be recorded…allowing it, as Bebergal points out, to be both the medium of communication, and the ‘proof’.) This section becomes a jumping off point into the near ubiquitous use of ‘technology’ for divinatory purposes through the ages: “Divination almost always requires an implement through which the divine (or infernal) spirits can speak”, from throwing the bones, to Tarot cards and the Ouija board. Indeed, Bebergal says…\n\nIn a later chapter, Bebergal’s investigations turn to using technology not to allow the spirit world in to ours, but to use technology to try and personally visit the spirit world. He draws on the work of ‘out-of-body experience’ (OBE) expert Robert Monroe, who found that listening to ‘binaural beats’ – “two digitally crafted tones close in frequency played in each ear via headphones, which produce an illusory third tone” – could have numerous positive effects, one of which is the inducing of OBEs.\n\nMonroe’s development of his patented ‘Hemisync’ technology based on these ideas again leads back to the intersection of maker culture and the occult – a point which is accentuated when Bebergal visits film-maker Ronni Thomas, who has merged the binaural beat system with the ‘Dreamachine’ developed by Brion Gysin, and also tells of creating his own meditation machine based on a project idea published in Make magazine in 2007 titled “The Brain Machine”.\n\nBebergal sees this use of technology to “quicken the pace toward spiritual states of being” as somewhat of an echo of a previous debate over the whether the use of psychedelics to a valid way to ‘speed up’ the spiritual journey. “The introduction of a different kind of mechanism for breaking through to altered states,” Bebergal states, “has only raised more questions about those states really are.” And those questions will continue to be raised as we enter a phase of ‘transhumanism’, in which we use technology to modify our body and mind.\n\nThese final chapters of Strange Frequencies summarise why the occult and technology are so closely entwined. Bebergal quotes media theorist Steve Collins in explaining the shared ethos between magic and technology, using the example of computer hackers: “In the instance of hacking, it is the underlying code that must be altered to exert a change; for magic, it is the manipulation of forces underpinning the state of existence that brings about change.” (For a fantastic exploration of this topic, see Mark Pesce’s article “The Executable Dreamtime: Language, magic and the universe as code” here on the Daily Grail).\n\nReaders of the Daily Grail, many of whom share Peter Bebergal’s twin obsessions with the occult and technology, will surely find Strange Frequencies to be a fun and fascinating read. The author is neither too skeptical nor gullible of the strange topics he explores (a position he puts down to the influence of his diametrically opposed mother and father), and knows the topics well. And, perhaps most importantly, the topic at the heart of Strange Frequencies is similarly dichotomous but united, and one which many of us could do with a better understanding of – the intersection of science and the spirit.", "opengraph": {"locale": "en_US", "type": "article", "title": "Review: Peter Bebergal's \"Strange Frequencies\" - The Daily Grail", "description": "Magick, as it is presented in modern pop culture, is nearly always an ancient thing: dusty books, Latin incantations, secret orders of antiquity. And yet magick has always been about a quest for knowledge and powers beyond the current paradigm (which is part of the reason why Clarke’s aphorism “Any sufficiently advanced technology is indistinguishable from magic” resonates so strongly). Who needs to develop powers of mentally talking to someone in a different location when we have a smartphone, some […]", "url": "https://www.dailygrail.com/2018/12/review-peter-bebergals-strange-frequencies/", "site_name": "The Daily Grail", "article:publisher": "https://www.facebook.com/TheDailyGrail/", "article:author": "https://www.facebook.com/TheDailyGrail/", "article:published_time": "2018-12-13T02:10:13+00:00", "article:modified_time": "2019-03-13T01:16:51+00:00", "image": "https://i1.wp.com/www.dailygrail.com/wp-content/uploads/2018/12/white-noise-EVP.jpg?fit=1400%2C729&ssl=1", "image:width": "1400", "image:height": "729", "image:type": "image/jpeg"}, "tags": ["psychedelics", "UFOs", "Graham Hancock", "afterlife", "Jacques Vallee"], "tweets": [], "movies": [], "links": ["http://www.amazon.com/dp/0143111825/?tag=thedailygrail", "https://www.dailygrail.com/2018/01/the-executable-dreamtime-language-magic-and-the-universe-as-code/", "http://www.amazon.com/dp/0143111825/?tag=thedailygrail"], "authors": ["Greg"], "publish_date": "2018-12-13T02:10:13+00:00"}