{"result_id": "089017", "URL": "https://www.dailygrail.com/2016/01/nightmares-of-the-future-climatological-horrors-the-zika-virus/", "timestamp": "2023-04-25 14:57:18 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.dailygrail.com/wp-content/uploads/2020/12/cropped-TDG-favicon-1.png?fit=32%2C32&ssl=1", "canonical": "https://www.dailygrail.com/2016/01/nightmares-of-the-future-climatological-horrors-the-zika-virus/", "encoding": "UTF-8"}, "image": null, "domain": "www.dailygrail.com", "title": "Nightmares of the Future: CLIMATOLOGICAL HORRORS - The Zika Virus", "cleaned_text": "There’s a line from the new space opera, The Expanse, that’s quickly becoming a grim shorthand for the futurepresent: Welcome to the Churn. Any doubts that we’re in the midst of a slow-motion apocalypse are being set aside as the multicausal factors behind the sudden rise of the Zika Virus and its many, apparently long lasting and dire implications become clear. But there’s another motto of equal power to meet this: the only way out is through.\n\nIf this is indeed the Sixth Mass Extinction, in the era now commonly agreed as the Anthropocene, then humanity is the metaphorical asteroid and we are in the process, not of affecting our own extinction, but – just as we effectively domesticated ourselves from savannah-dwelling upright chimps to become the ultimate world conquering, ecosystem shaping, invasive species – proving to be the selective filter that will determine the course of our race’s evolution. The goal is increasingly becoming simply “live through this,” and the Zika Virus is the first level boss we have to defeat. The best news of all, if such a thing can be said about this is – the sole ray of light in the imminent darkness – we can only do so by rapidly beginning the process of repairing the planet. Because, however you read this situation, it’s definitely sick, and it falls to us to heal it. To paraphrase once more from the comic Planetary: there’s no justice, there’s just us.\n\nWhilst this particular essay isn’t a formal part of the Plutocratic Exit Strategy (PES) series, and should more properly be considered a continuation of the themes explored in my deep reading of the TV show Fortitude, there’s definitely some overlap. The biggest point of intersection can be found in the speech from Kingsman: The Secret Service that I used to illustrate PES: Pt2. For our purposes here it’s really worth listening to again… for one part in particular.\n\nThe Kingsman film is already considered a cannon telling of the Elite’s plans in many conspiratorial-minded circles. The principal question to be answered in this exploration of the Zika Virus is who’s got the upper hand right now? Is the virus killing the host, or vice versa? Is the Zika Virus a natural – whatever “natural” actually means in the context of the Anthropocene – consequence of climate chaos, or the direct result of the covert machinations of corporate interests; specifically in this case, Big Pharma in general, and two Plutocrats in particular: Bill & Melinda Gates.\n\nExcept “or” is exactly the wrong word here, the incorrect logic… this is after all slow-motion apocalypse, which the Zika Virus is just one symptom of. Before we go any further, we need to extend our apocalyptic lexicon and appreciate just what it is to be living within the Churn.\n\nAs I’m wont to do, I’m going to lean on the words of a friend and fellow writer here, and let Cat Vincent explain the full meaning and origin of the phrase I opened this essay with, quoting at length from his recent newsletter on the subject:\n\n“Betting on the future where you survive makes more sense than the one where you don’t”. Amen brother. We need the words to describe our situation though, so we can chart our course through it. There’s a reason those old maps noted where all the dragons were. For me, as we sketch out the territory we must navigate, the Churn maps perfectly on to the overall period William Gibson described as the Jackpot Years in The Peripheral. I’m going to pull a quote from that book where he elaborates on the nature of a multicausal, feedback loop deathspiral; one that I’ve used here before, and may well do so again.\n\nWhy is this quote such a touchstone for me? Well, for one thing, it almost perfectly captures the circumstances that have given risen to what’s looking to be exactly one of those “disease that were never quite the one big pandemic”, as the result of many of the other factors. Just everything else…\n\nThe Zika Virus is letting everyone give full voice to project their eschatonic ideologies and apocalyptic mindsets to any audience that will listen. The mainstream media depiction is of the host, the planetary superorganism, Gaia, finally repelling the human infection. Dig deeper though and a far darker narrative emerges of this all being the direct result of the bleeding edge of anthropocentric activity, genetically modified organisms, industrial farming and gross negligence. A climatological horror story is one that begins merely with intersection of natural forces;a reboot of the classic trope of Nature vs Man: Nature’s Revenge.\n\nUnderstand why the Churn and the Jackpot Years are quickly becoming the shorthand to discuss the current condition? Just count up all the factors there and tell me the Zika Virus isn’t, at minimum, the worst side-effect of humankind’s continual failure to act as effective planetary custodians.\n\nThe literal geological marker of this period I hopefully characterise as being the Immature Anthropocene, implying we might actually survive to get better at all this world management business, is a world littered by plastic… the very thing the Zika Virus bearing mosquitoes are breeding in across the Americas.\n\nThe, um, kinda good news is that the Elite kicking around recently at Davos are all over this… sort of. When you’re at an economic forum every solution looks, strangely enough, economic. They look at oceans where the plastic content will soon outweigh the fish in it and just see inefficiency and potentially lost profits:\n\nI don’t think its too cynical to read this as treating the symptoms, but ignoring the disease. And as hard as I’d looked into this, whilst they talk about reducing the plastification of the planet, I could find no mention of reversing it. Instead, for hopeful narratives of a course through, we have to turn back to life on the other side of the Jackpot Years, as Gibson conjures it for us:\n\nThe patchers, their prime directive to cleanse the fouled water column, had assembled this place from recovered polymers. What shape it had taken was afterthought, offhand gesture, however remarkably unattractive. It made him want to shower. Coffee was starting to seep through the front of his robe. Now Daedra was being helped to don her parafoil, which in its furled state resembled a bilobed scarlet backpack, bearing the white logo of its makers. “Is the ’foil her placement,” he asked, “or ours?” The cams halted abruptly, simultaneously finding one another over the chosen square. Descended, above diagonally opposite corners, each capturing the other’s identical image. They were skeletal oblongs, the size of a tea tray, matte gray, around a bulbous little fuselage. Either Lorenzo or Rainey brought the audio up. The square filled with a low moaning, the island’s hallmark soundscape. The patchers had wormed hollow tubes through every structure. Wind blew across their open tops, generating a shifting, composite tonality he’d hated from the moment he’d first heard it. “Do we need that?” he asked. “It’s so much of the feel of the place. I want our audience to have that.” Something was moving in the distance, to his left. “What’s that?” Four meters tall, headless, with some indeterminate number of legs, it was that same hollow milky plastic. Like the discarded carapace of something else, moving as if animated by an awkward puppetry. It rocked from side to side as it advanced, a garden of tubes atop its length no doubt contributing to the song of the plastic island. “Have they sent it here?” “No,” she said. “They set them free, to wander with the wind.” “I don’t want it in the frame.” “Now you’re the director?”“You don’t want it in the frame,” he said. The thing went stiffly on, swaying, on its hollow translucent legs.\n\n On the upper deck of the moby, he saw, her support staff had been withdrawn. The white china Michikoid remained, checking the parafoil, hands and fingers moving with inhuman speed and precision. The ribbon on its sailor cap fluttered in the breeze. A real one, the cam with the fan absent now. “And here we are,” said Rainey, and he saw the first of the patchers, one cam shifting focus. A child. Or something the size of one. Hunched over the handlebars of a ghostly little bike, the bike’s frame the same salt-crusted translucence as the city and the wind-walker. Unpowered, it seemed to lack pedals as well. The patcher progressed by repeatedly scuffing at the avenue’s surface. The patchers repelled Netherton even more than their island. Their skin was overgrown with a tweaked variant on actinic keratosis, paradoxically protecting them from UV cancers. “There’s only the one?” ~ William Gibson, The Peripheral\n\nPosthumans healing the planet as an art project, building plastic islands and making sculptures from the rubble of the world-that-was. That’s the kind of thing that awaits the survivors of what looks more and more like a giant selective filter in motion. The Churn. Because the first real horrific element of the tale of the Zika Virus looks like this:\n\nThat’s what the next generation looks like for the Americas if nothing is done to reverse the spread of this virus, or limit its effects. 4,000 births like this were reported in Brazil last year, where this outbreak originated. Columbia has now reported over two thousand women as being infected with Zika. Government after government across the Americas are encouraging their citizens to avoid reproducing until the crisis ends and/or a cure can be found. As climate change thought leader Bill McKibben wrote in his op-ed for The Guardian on the subject:\n\nNo surprise then that people are constantly referencing the film Children of Men when discussing this online, or off. Alfonso Cuarón indeed offers a grim visage of the future that lurks over the dark horizon:\n\nAnd there is no guarantee at all that this will be limited to less developed parts of the Americas. Especially if the virus were to jump hosts to a closely related mosquito that’s already established across North America.\n\nThat we can only save ourselves by finally beginning the great project of repairing the planet is the through line of hope, the opportunity within the crisis and great takeaway from all this. It’s always darkest before the dawn… or to echo Cat Vincent again, from earlier: “betting on the future where you survive makes more sense than the one where you don’t.”\n\nWhich brings another element that can be folded in, where this can all be the grim origin tale for a Mature Anthropocene run by a Type I Civilisation. Making a rational decision about human migration. Because if there’s anyone that is betting large on their future right now, it’s the displaced persons across the world risking everything for the chance of at life under better circumstances. The people formerly of Syria, for instance. If the Zika Virus plays out as expected, and for years no one has children, the governments of the Americas have a new generation waiting to be imported from the other side of the world. A far more inviting and permanent journey for them to take, versus the temporary asylum Germany has offered to over a million and made a point of emphasising it’s temporary nature:\n\nReturning to what exactly? I see no Marshall-esque plan being set in motion, after all.\n\nImagine images of Syrian refugees being flown to the Americas from Turkey and elsewhere on our screens, instead of the constant news footage of drowned women and children. It would be a radical act to many, but the governments that do it would find themselves with a grateful injection of talented people almost certainly ready to undertake any ambitious task. Like, I don’t know, returning the Amazon rain forest to it’s former glory as a great, vast garden. If only the politicians in places such as Brazil can look past the short term consequences such as the likelihood that the Corpocratic Invasion that is the Olympics will be a complete disaster – no Westerner vaguely contemplating children will risk attending this year – and see the long game instead.\n\nThis is a far more inviting future to contemplate, versus a near future with Trump as POTUS, building a Walled America, patrolled by drones with The Gates Foundation’s mosquito zapping lasers.\n\nAs we’ll shortly explore, this might just be the least bleak reading of the future, as we continue tumbling down the Zika Wormhole.\n\nAnd so we come to consider the words and acts of billionaire philanthropists, Bill & Melinda Gates, and the rather suspect field trials of a branch of Big Pharma. Bill Gates seeded his global charity with what would to others be a large chunk of his Microsoft stock, and still sits comfortably atop the world’s richest list. His new mission in life involves such world changing goals as ridding the world of Malaria. You can listen to him talk about his bucketlist in this TED Talk, where he pulls cool stunts like releasing a swarm of mosquitoes into the audience. There’s one quote we need to pull out here though, because as we’ll shortly see, it foreshadows just what might be the real story of the true origin of the Zika Virus outbreak threatening the world:\n\nRemember that part. Bill’s wife and partner-in-crime… I mean, Benevolent Plutocratic Endeavours… Melinda Gates recently gave a TED Talk herself. Depending on how you read this – via whatever reality tunnel you view it through – it’s either an act of Noblesse Oblige, or one of the greatest recent instances of Plato’s Noble Lie. Especially once we call back again to Samuel L. Jackson’s words in the Kingsman film: “A cull is our only hope.” Seen through supervillain lens, this is one ominous speech:\n\nSince we’re essentially creating another intersection with the Plutocratic Exit Strategy series here, it’s worth pointing out the other instances where it sure looks like a cull is being effected, if not by intention, then by neglect; a consequence of the chaos caused by the looting of the world. Take Flint, Michigan and the other places in North American beset by toxic water:\n\nWe really can’t blame Gaia’s natural immune response on such things. It’s unquestionably the result of a broken civilisation, falling back into the abyss of Collapse. Whilst the Exit to Mars marches on:\n\nBut as I’ve already said, this isn’t another PES installment. Pay no attention to the wizard behind the curtain. Especially when the rest of what they’re pitching fits perfectly in with your anarchist transhumanist belief system. As Tim Maly wrote on the subject in his piece “Six Radical Life-Extension Technologies for Transhumanist Consideration”, listing Clean Water and Basic Sanitation as the top two pieces of radical tech.\n\nSo when Melinda Gates says the following, I’m almost ready to swallow the rest of what she has to say:\n\nThis has, after all, been a priority for such past civilisations as the Roman Empire and the residents of the Indus Valley during the Bronze Age. So why can’t get we it right, here in the Peak Anthropocene? It’s a pretty freaking valid question. Thankfully there are some people working on resolving this problem… again. Researchers from Standford are field testing an innovative clean water solution in the slums of Bangladesh:\n\nJust the kind of technology that might be handy for a climate chaos ridden (broken) Refugee/Favela Planet. Another regretful necessity. Maybe the Gates Foundation can help them out? That would be nice, right? A nice hopeful thought to pause on before we descend into the very depths of the Zika Wormhole. Because it seems a very different field test has been going on in Brazil, and would you just guess what might be the result? Brace yourself for Full Anthropocene Horror and please adjust your conspiratorial hats before reading on.\n\nHere’s someone on Reddit breaking it down really simply (I’ve put the maps they mention in above this quote):\n\nThis far more expansive article at AntiMedia took that post and really ran with it. It’s actually a pretty harrowing read that makes the Flint, Michigan & fellow cities seem almost benign by comparison. This is the Churn, people. The only peace we find is in the eye of the storm. Remember a few thousand words ago when we were just worried about plastic and clean water acting an ace incubator for a swarm of infectious mosquitoes? It’s so much worse than that. Maybe. (VERY PROBABLY.) Like, that little fact about tetracycline? Read on for a full elaboration:\n\nThe particular strain of Oxitec GM mosquitoes, OX513A, are genetically altered so the vast majority of their offspring will die before they mature — though Dr. Ricarda Steinbrecher published concerns in a report in September 2010 that a known survival rate of 3-4 percent warranted further study before the release of the GM insects. Her concerns, which were echoed by several other scientists both at the time and since, appear to have been ignored — though they should not have been. Those genetically-modified mosquitoes work to control wild, potentially disease-carrying populations in a very specific manner. Only the male modified Aedes mosquitoes are supposed to be released into the wild — as they will mate with their unaltered female counterparts. Once offspring are produced, the modified, scientific facet is supposed to ‘kick in’ and kill that larvae before it reaches breeding age — if tetracycline is not present during its development . But there is a problem. According to an unclassified document from the Trade and Agriculture Directorate Committee for Agriculture dated February 2015, Brazil is the third largest in “global antimicrobial consumption in food animal production” — meaning, Brazil is third in the world for its use of tetracycline in its food animals. As a study by the American Society of Agronomy, et. al., explained, “It is estimated that approximately 75% of antibiotics are not absorbed by animals and are excreted in waste.” One of the antibiotics (or antimicrobials) specifically named in that report for its environmental persistence is tetracycline. In fact, as a confidential internal Oxitec document divulged in 2012, that survival rate could be as high as 15% — even with low levels of tetracycline present. “Even small amounts of tetracycline can repress” the engineered lethality. Indeed, that 15% survival rate was described by Oxitec: “After a lot of testing and comparing experimental design, it was found that [researchers] had used a cat food to feed the [OX513A] larvae and this cat food contained chicken. It is known that tetracycline is routinely used to prevent infections in chickens, especially in the cheap, mass produced, chicken used for animal food. The chicken is heat-treated before being used, but this does not remove all the tetracycline. This meant that a small amount of tetracycline was being added from the food to the larvae and repressing the [designed] lethal system. ” Even absent this tetracycline, as Steinbrecher explained, a “sub-population” of genetically-modified Aedes mosquitoes could theoretically develop and thrive, in theory, “capable of surviving and flourishing despite any further” releases of ‘pure’ GM mosquitoes which still have that gene intact. She added, “the effectiveness of the system also depends on the [genetically-designed] late onset of the lethality. If the time of onset is altered due to environmental conditions … then a 3-4% [survival rate] represents a much bigger problem…”\n\n: They seriously built a fucking super bug! Like, they could not have fucked this up more if they tried!!! Did they?!?! This is some full X-Files conspiracy type shit. In fact, forget that, it’s now a race between reality and the new season of the televisual adaptation of 12 Monkeys to show us what near-human extinction via engineered plague looks like:\n\nRemember what Bill Gates warned about earlier with respect to the proposed engineered Malaria cure? That’s exactly what they’ve done! Instead of killing off the Zika Virus carrying mosquitoes they’ve created a stronger, tougher, more resilient version through artificially accelerating its evolution. And that’s where this all came from… they’ve been breeding in the jungles of Brazil and now they’re swarming across the Americas. Now, don’t forget how they got there in the first place, those only slightly infectious original insect population… through the holds of ships and infected passengers.\n\nDon’t worry though, it’s so much worse. A cool way to put out a fire is to pour oil on it, right?\n\nAnd since this is all super-cutting edge anthropocene horror tech, they’re not even charging people for it, but doing this all by donation. Almost like there’s a greater agenda at work, and this is just one field trial in motion.\n\nI really wish I was making this all up. It’s so much more fun to dissect TV shows about frozen mammoths carrying fictional plagues, than frantically writing to your friends encouraging them to get at least a continent away from the outbreak zone. 2016 is just getting started. Now with the best news of all, yeah, I saved it for last. According to one expert, it’s not Zika that we should really be worried about…\n\nI’m going to end now and leave the vaccine part of the Zika Wormhole to another writer. I’ll just note in passing, before concluding that some very interesting wearable tech is being developed, that might prove to have, um, critical applications in an increasingly Churning, plague ridden world.\n\nAnd such is life in the Churn, as we find a path through the Jackpot Years and seek out the seeds of a better world. In the words of King Krule: “cause if you’re going through hell, we just keep going…”\n\nSpecial Acknowledgement to my Dark Extropian compatriot, Emily Dare, for sending me much deeper down this wormhole than I really intended to go.", "opengraph": {"locale": "en_US", "type": "article", "title": "Nightmares of the Future: CLIMATOLOGICAL HORRORS - The Zika Virus - The Daily Grail", "description": "There’s a line from the new space opera, The Expanse, that’s quickly becoming a grim shorthand for the futurepresent: Welcome to the Churn. Any doubts that we’re in the midst of a slow-motion apocalypse are being set aside as the multicausal factors behind the sudden rise of the Zika Virus and its many, apparently long lasting and dire implications become clear. But there’s another motto of equal power to meet this: the only way out is through. If this is […]", "url": "https://www.dailygrail.com/2016/01/nightmares-of-the-future-climatological-horrors-the-zika-virus/", "site_name": "The Daily Grail", "article:publisher": "https://www.facebook.com/TheDailyGrail/", "article:published_time": "2016-01-30T05:53:30+00:00", "article:modified_time": "2019-03-23T03:04:59+00:00", "image": "https://i0.wp.com/www.dailygrail.com/wp-content/uploads/2016/01/_87953334_jar.jpg?fit=624%2C351&ssl=1", "image:width": "624", "image:height": "351", "image:type": "image/jpeg"}, "tags": ["psychedelics", "UFOs", "http://recombinomics.co/topic/358-dallas-county-issues-zika-sexual-transmission-advisory/", "Graham Hancock", "afterlife", "Jacques Vallee"], "tweets": ["<blockquote class=\"twitter-tweet\" lang=\"en\">\n<p dir=\"ltr\" lang=\"en\">NYC’s Flatiron building during last Saturday’s blizzard. photo by Michele Palazzo. via <a href=\"https://twitter.com/petapixel\">@petapixel</a> <a href=\"https://t.co/RY9Ei11LIc\">pic.twitter.com/RY9Ei11LIc</a></p>\n<p>— Michiko Kakutani (@michikokakutani) <a href=\"https://twitter.com/michikokakutani/status/692948134943682560\">January 29, 2016</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" lang=\"en\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https://twitter.com/hashtag/ZikaVirus?src=hash\">#ZikaVirus</a> is the logical consequence of sick ecosystems &amp; abrupt climate change in overpopulated inequitable world <a href=\"https://t.co/uDXmr2T5J1\">pic.twitter.com/uDXmr2T5J1</a></p>\n<p>— Dr. Glen Barry (@DrGlenBarry) <a href=\"https://twitter.com/DrGlenBarry/status/692922801519484930\">January 29, 2016</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" lang=\"en\">\n<p dir=\"ltr\" lang=\"en\">Apropos of <a href=\"https://twitter.com/hashtag/Flint?src=hash\">#Flint</a>: Lead poisoning as an easy-listening form of genocide. <a href=\"https://twitter.com/nytimes\">@nytimes</a> <a href=\"https://t.co/GOIGwrR2eS\">https://t.co/GOIGwrR2eS</a> <a href=\"https://t.co/hXwpKCAhzf\">pic.twitter.com/hXwpKCAhzf</a></p>\n<p>— Brent Staples (@BrentNYT) <a href=\"https://twitter.com/BrentNYT/status/693152544000991234\">January 29, 2016</a></p></blockquote>\n"], "movies": [{"embed_type": "iframe", "provider": "vimeo", "width": "500", "height": "270", "embed_code": "<iframe src=\"https://player.vimeo.com/video/92383943\" width=\"500\" height=\"270\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://player.vimeo.com/video/92383943"}, {"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe src=\"https://www.youtube.com/embed/BKm8FolQ7jw\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/BKm8FolQ7jw"}, {"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe src=\"https://www.youtube.com/embed/hRzlbh4or3c\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/hRzlbh4or3c"}], "links": ["https://en.wikipedia.org/wiki/The_Expanse_%28TV_series%29", "http://www.wired.com/2016/01/please-stop-saying-humans-arent-causing-climate-change/", "http://m1k3y.com/the-plutocratic-exit-strategy/", "https://wp.dailygrail.com/2015/04/nightmares-of-the-future-the-climatological-horror-of-life-in-fortitude/", "http://www.imdb.com/title/tt2802144/", "http://dailygrail.com/Essays/2015/10/Nightmares-the-Future-THE-PLUTOCRATIC-EXIT-STRATEGY-PART-2", "https://twitter.com/petapixel", "https://t.co/RY9Ei11LIc", "https://twitter.com/michikokakutani/status/692948134943682560", "http://www.catvincent.com/", "https://medium.com/anomalous-engineering/welcome-to-the-churn-5c201b3e9759", "http://www.mckinsey.com/insights/strategy/the_new_normal", "http://runesoup.com/", "http://https//en.wikipedia.org/wiki/Ilya_Prigogine", "https://www.youtube.com/watch?v=DHSwvtHFsOU", "http://dailygrail.com/Reviews/2014/11/review-The-Peripheral-William-Gibson", "http://dailygrail.com/Essays/2014/12/Mad-Max-Fury-Road-and-the-pre-Jackpot-Years", "https://twitter.com/hashtag/ZikaVirus?src=hash", "https://t.co/uDXmr2T5J1", "https://twitter.com/DrGlenBarry/status/692922801519484930", "http://www.motherjones.com/environment/2016/01/climate-change-el-nino-zika-virus", "http://www.sciencedaily.com/releases/2016/01/160127083854.htm", "https://en.wikipedia.org/wiki/Davos", "http://www.cdc.gov/ncbddd/birthdefects/microcephaly.html", "http://www.nytimes.com/2016/01/31/world/americas/colombia-reports-more-than-2100-pregnant-women-have-zika-virus.html", "http://www.billmckibben.com/", "http://www.theguardian.com/commentisfree/2016/jan/25/zika-virus-brazil-dystopian-climate-future", "http://www.imdb.com/title/tt0206634/", "http://www.nytimes.com/2016/01/31/opinion/sunday/zika-mosquitoes-and-the-plagues-to-come.html?", "http://www.news.com.au/world/europe/merkel-says-refugees-will-return-to-the-mideast/news-story/6a8ea99060c7f7ced31c5352216e7542", "http://www.washingtonpost.com/wp-dyn/content/article/2010/09/03/AR2010090302302.html", "http://www.ted.com/talks/bill_gates_unplugged/", "https://www.salon.com/2016/01/25/its_not_just_a_flint_problem_other_u_s_cities_are_suffering_from_toxic_water/", "https://twitter.com/hashtag/Flint?src=hash", "https://twitter.com/nytimes", "https://t.co/GOIGwrR2eS", "https://t.co/hXwpKCAhzf", "https://twitter.com/BrentNYT/status/693152544000991234", "http://www.nbcnews.com/tech/tech-news/elon-musk-says-spacex-will-send-people-mars-2025-n506891", "https://medium.com/weird-future/six-radical-life-extension-technologies-for-transhumanist-consideration-4927989f3ecd", "https://en.wikipedia.org/wiki/Sanitation_of_the_Indus_Valley_Civilisation", "http://scopeblog.stanford.edu/2016/01/25/clean-water-for-dhaka-one-pump-at-a-time/", "https://www.reddit.com/r/conspiracy/comments/42mhii/genetically_modified_mosquitoes_released_in/", "http://www.econexus.info/publication/release-gm-mosquito-aedes-aegypti-ox513a", "http://theantimedia.org/zika-outbreak-epicenter-in-same-area-where-gm-mosquitoes-were-released-in-2015/", "http://www.econexus.info/publication/release-gm-mosquito-aedes-aegypti-ox513a", "http://www.oecd.org/officialdocuments/publicdisplaydocumentpdf/?cote=TAD/CA/APM/WP(2014)34/FINAL&docLanguage=En", "http://www.moag.gov.il/NR/rdonlyres/705B62D8-B3F1-475D-91EA-E3EE6161149E/0/FateandtransportofantibioticresiduesandantibioticresistancegenesfollowinglandapplicationofmanureJEnvQual2009.pdf", "http://libcloud.s3.amazonaws.com/93/de/e/986/MosquitoDocOriginal.pdf", "http://www.syfy.com/12monkeys", "http://edition.cnn.com/2014/07/08/tech/innovation/breeding-kamikaze-mosquitoes/?iid=EL", "http://money.cnn.com/2016/01/27/news/companies/zika-virus-oxitec-mosquito-brazil/", "https://www.sciencenews.org/article/tracking-health-no-sweat-new-device", "https://twitter.com/moonandserpent"], "authors": ["m1k3y"], "publish_date": "2016-01-30T05:53:30+00:00"}