{"result_id": "089006", "URL": "https://www.dailygrail.com/2011/01/anti-vax-attacks/", "timestamp": "2023-04-25 14:56:56 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.dailygrail.com/wp-content/uploads/2020/12/cropped-TDG-favicon-1.png?fit=32%2C32&ssl=1", "canonical": "https://www.dailygrail.com/2011/01/anti-vax-attacks/", "encoding": "UTF-8"}, "image": null, "domain": "www.dailygrail.com", "title": "Anti-Vax Attacks", "cleaned_text": "Childhood vaccinations have been at the centre of a mega-controversy for more than a decade now due to claims that they sometimes cause the onset of autism in youngsters. The academic foundation stone of this controversy is a paper by former surgeon goes much further with its allegations:\n\nAn investigation published by the British medical journal BMJ concludes the study’s author, Dr. Andrew Wakefield, misrepresented or altered the medical histories of all 12 of the patients whose cases formed the basis of the 1998 study — and that there was “no doubt” Wakefield was responsible. “It’s one thing to have a bad study, a study full of error, and for the authors then to admit that they made errors,” Fiona Godlee, BMJ’s editor-in-chief, told CNN. “But in this case, we have a very different picture of what seems to be a deliberate attempt to create an impression that there was a link by falsifying the data.” Britain stripped Wakefield of his medical license in May. “Meanwhile, the damage to public health continues, fueled by unbalanced media reporting and an ineffective response from government, researchers, journals and the medical profession,” BMJ states in an editorial accompanying the work.\n\nIt’s not a subject I have taken much interest in personally, and so don’t know a lot about it and have no comment myself. Although when my children were offered vaccination, and the possible risk was mentioned, from the reading I did on the subject I remember my thoughts were simply along the lines of “a possible risk versus very real risks known to be present and waiting in the environment”. To me, there is little doubting the overall good that vaccinations have done for humanity at this stage in history – though I am more than happy to hear arguments against in any (respectable) form, having seen first hand the sometimes blinding power of consensus thinking.\n\nYou can read Deer’s new investigative article at the BMJ website.", "opengraph": {"locale": "en_US", "type": "article", "title": "Anti-Vax Attacks - The Daily Grail", "description": "Childhood vaccinations have been at the centre of a mega-controversy for more than a decade now due to claims that they sometimes cause the onset of autism in youngsters. The academic foundation stone of this controversy is a paper by former surgeon", "url": "https://www.dailygrail.com/2011/01/anti-vax-attacks/", "site_name": "The Daily Grail", "article:publisher": "https://www.facebook.com/TheDailyGrail/", "article:author": "https://www.facebook.com/TheDailyGrail/", "article:published_time": "2011-01-07T11:17:13+00:00"}, "tags": ["psychedelics", "UFOs", "Graham Hancock", "afterlife", "Jacques Vallee"], "tweets": [], "movies": [], "links": ["http://en.wikipedia.org/wiki/Andrew_Wakefield>Andrew Wakefield</a> published in the premier medical journal, the <i>Lancet</i>, in 1998. However, after an inquiry by the British General Medical Council, in early 2010 the journal retracted the paper, and Wakefield was struck-off the Medical Register in May 2010.</p>\n<p>But a new investigation by journalist Brian Deer, published in the British medical journal <i>BMJ</i>, <A href=", "http://www.bmj.com/content/342/bmj.c5347.full"], "authors": ["Greg"], "publish_date": "2011-01-07T11:17:13+00:00"}