{"result_id": "089014", "URL": "https://www.dailygrail.com/2020/06/the-five-craziest-bill-gates-vaccine-conspiracy-theories/", "timestamp": "2023-04-25 14:57:12 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.dailygrail.com/wp-content/uploads/2020/12/cropped-TDG-favicon-1.png?fit=32%2C32&ssl=1", "canonical": "https://www.dailygrail.com/2020/06/the-five-craziest-bill-gates-vaccine-conspiracy-theories/", "encoding": "UTF-8"}, "image": null, "domain": "www.dailygrail.com", "title": "The Five Craziest Bill Gates Vaccine Conspiracy Theories", "cleaned_text": "I’ve always been partial to a good, fun conspiracy theory. Trying to fit all the pieces together to find a hidden story, even if done with a hefty amount of speculative glue, is always an exciting pursuit.\n\nThe age of social media, however, is turning me into a grouchy old curmudgeon when it comes to conspiracy theories. They’re spreading like wildfire on Facebook, Twitter and YouTube, even when they’re dumb as a box of hammers.\n\nHow bad is it? Consider this: I’m now writing a post defending Bill Gates.\n\nPlease understand: I’ve been ragging on the Microsoft co-founder since way back in the ’90s. This isn’t easy for me. But after seeing post after post on social media this week attacking Gates as some sort of demonic grim reaper, poised to remove billions of people from the planet with his poisonous vaccines, I felt compelled to speak up.\n\nBecause when conspiracy theories are *not* fun, is when they are (a) literally putting people’s lives at risk, and (b) purposefully deceitful.\n\nAnd make no mistake: the impact of most of these conspiracy theories will be to have more people rejecting vaccines – an outcome which will cost many lives. Whether they’re started by alt-med grifters, true believers, or as influence operations, I can’t say – but in the end, the result will be the same.\n\nSo, here’s a sampling of the crazy Bill Gates conspiracy theories going around at the moment, along with why they’re bullshit – feel free to let your friends know the next time they share one on social media:\n\n1. Bill Gates admitted that he was going to depopulate the planet by killing people with vaccines.\n\nThis one regularly makes the rounds, usually in the form of a short clip from a TED talk given by Gates, in which he says…\n\nThere it is! Boom, not even shy about it, Bill Gates says straight up, in public, that his vaccines are going to kill billions of people.\n\nExcept that’s not what he’s saying. The actual story: Bill Gates believes that by increasing the chance of childhood survival through vaccines, that parents will decide to have less children because they feel more secure that they won’t lose them to disease:\n\nNow, you can certainly argue whether Bill Gates is correct in this assumption, for sure. But he is not saying that vaccines are going to kill off people – actually, he’s saying the opposite. He’s trusting that they will help children survive disease in their youth, and that will help lower population in future by lowering birth rates.\n\nTied in to the previous conspiracy meme, comes this one: an image that circulates regularly ‘showing’ that the Bill and Melinda Gates Foundation are behind a ‘Center for Global Human Population Reduction’.\n\nThe problem? There is no such center, and the image is photoshopped. But that hasn’t stopped it from being shared widely across social media, without anyone stopping to ask if it is real.\n\n3. Bill Gates is going to make $200 billion from pushing vaccines on to people.\n\nOne of the funnier things I’ve seen going around is the claim that Bill Gates is making vaccines so he can be rich. Okay, sure, maybe he could be richer. But still…\n\nThose pushing this line are quick to point out that Gates has said on a number of occasions that he has figured out there is a 20:1 return on investment for vaccinees – so the $10 billion he’s put into vaccines has earned $200 billion in profit.\n\nThe full video, however, tells a different story. What Gates is saying is that him donating $10 billion to global health programs results in an estimated $200 billion in social and economic benefits – as well as saving millions of lives.\n\nAs Gates notes in the part of the video that is edited out…\n\n4. Bill Gates is gleefully talking about injecting children with genetically modified organisms.\n\nYet another deceptively edited clip shows Bill Gates apparently talking gleefully about jamming a needle in kids’ arms and injecting genetically modified organisms (GMOs):\n\nIf, however, you watch the full video (Gates starts talking at 2:07), you’ll find something surprising: he’s actually advocating for careful testing before doing anything with GMOs. After his wife Melinda begins the talk advocating for the usage of GM crops in Africa, Bill Gates chimes in by saying…\n\n5. Bill Gates wants to put a microchip in the coronavirus vaccine and given to everybody in the world so that they can be tracked.\n\nIt’s the old ‘mark of the beast’ conspiracy theory, dressed up 2020 style!\n\nTo be fair, there’s some background to this conspiracy theory that makes it reasonably plausible. The Gates’ Foundation has supported research into quantum dot technology for storing vaccination records as a micro-tattoo of sorts (not a microchip though, and not trackable remotely), and also into using microchips to ‘track’ medical samples taken from patients (not patients themselves though; not ‘trackable’ remotely; and not containing confidential information).\n\nConspiracy theorists have tied this rumour in with another Gates-backed project, ID2020, which seeks to create a global digital identification system.\n\nHowever, it’s fair to ask why, in the age of ubiquitous smart phones, advanced facial recognition systems and biometric identification, Bill Gates would need to embed a microchip in everybody. And it might be interesting to find out how many of the people frightened by this conspiracy theory use Windows or Microsoft’s Office suite of products…\n\nSo, no Bill Gates is not using the coronavirus as an opportunity to build a global surveillance system. (That already exists, silly.)\n\nWe should certainly keep a close eye on billionaires and how they use their money and power to influence decision-making that affects us all. And we should be aware of how our privacy is constantly being eroded by the growth in surveillance systems.\n\nHowever, we also need to understand that in the age of social media there is an army of grifters and political operatives seeking to use fear of vaccines, and mistrust in the likes of Bill Gates, as a tool to achieve their own objectives. And they don’t care whether their spreading of misinformation ends up killing thousands of people.\n\nSo it’s up to us. Before spreading that viral conspiracy theory – and likewise, before eating up any heart-warming stories about Saint Bill – we need to look at each story on its merits, check whether it is valid, and let truth guide us, rather than our political or cognitive biases.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Five Craziest Bill Gates Vaccine Conspiracy Theories - The Daily Grail", "description": "I’ve always been partial to a good, fun conspiracy theory. Trying to fit all the pieces together to find a hidden story, even if done with a hefty amount of speculative glue, is always an exciting pursuit. The age of social media, however, is turning me into a grouchy old curmudgeon when it comes to conspiracy theories. They’re spreading like wildfire on Facebook, Twitter and YouTube, even when they’re dumb as a box of hammers. How bad is it? Consider […]", "url": "https://www.dailygrail.com/2020/06/the-five-craziest-bill-gates-vaccine-conspiracy-theories/", "site_name": "The Daily Grail", "article:publisher": "https://www.facebook.com/TheDailyGrail/", "article:author": "https://www.facebook.com/TheDailyGrail/", "article:published_time": "2020-06-20T06:51:51+00:00", "article:modified_time": "2020-06-20T07:14:09+00:00", "image": "https://i1.wp.com/www.dailygrail.com/wp-content/uploads/2020/06/centre-for-depopulation.jpg?fit=1400%2C700&ssl=1", "image:width": "1400", "image:height": "700", "image:type": "image/jpeg"}, "tags": ["psychedelics", "UFOs", "Graham Hancock", "afterlife", "Jacques Vallee"], "tweets": ["<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Obama is doing this in Africa, Democrat agenda if they won the next election to continue this killings in Africa. Please open yr eye disagree this groups who wants to depopulation u. Bill gates, Obama, Hillary Clinton, see it yourself and you failed to make sense and vote Joe. <a href=\"https://t.co/6UoDW4arul\">pic.twitter.com/6UoDW4arul</a></p>\n<p>— atatajazrinjunior (@atatajazrinjun1) <a href=\"https://twitter.com/atatajazrinjun1/status/1272519923781308416?ref_src=twsrc%5Etfw\">June 15, 2020</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Gates thinks his return on investment of fooling the entire empathetic humanity into his insufficiently tested new Anti-SARS-CoV-2-RNA-injections aka gene manipulation of guinea pigs called humans with the <a href=\"https://twitter.com/hashtag/CoronapLandemic?src=hash&amp;ref_src=twsrc%5Etfw\">#CoronapLandemic</a> will be greater than 20:1.<a href=\"https://twitter.com/hashtag/ExposeBillGates?src=hash&amp;ref_src=twsrc%5Etfw\">#ExposeBillGates</a> <a href=\"https://t.co/X0dxu6D9Mm\">pic.twitter.com/X0dxu6D9Mm</a></p>\n<p>— Thomas Binder, MD (@Thomas_Binder) <a href=\"https://twitter.com/Thomas_Binder/status/1271879108058927105?ref_src=twsrc%5Etfw\">June 13, 2020</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-conversation=\"none\">\n<p lang=\"und\" dir=\"ltr\"><a href=\"https://twitter.com/hashtag/ExposeBillGates?src=hash&amp;ref_src=twsrc%5Etfw\">#ExposeBillGates</a> <a href=\"https://t.co/Ix231B27lW\">pic.twitter.com/Ix231B27lW</a></p>\n<p>— ? (@slayersins) <a href=\"https://twitter.com/slayersins/status/1271962009156775936?ref_src=twsrc%5Etfw\">June 14, 2020</a></p></blockquote>\n"], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1120", "height": "630", "embed_code": "<iframe class=\"youtube-player\" width=\"1120\" height=\"630\" src=\"https://www.youtube.com/embed/9xHOiI5agO0?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-AU&amp;autohide=2&amp;start=120&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/9xHOiI5agO0?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-AU&autohide=2&start=120&wmode=transparent"}], "links": ["https://t.co/z628p9dX9b?amp=1", "https://t.co/6UoDW4arul", "https://twitter.com/atatajazrinjun1/status/1272519923781308416?ref_src=twsrc%5Etfw", "https://www.reuters.com/article/uk-factcheck-gates-foundation/false-claim-gates-foundation-has-a-center-for-global-human-population-reduction-sign-idUSKBN22G2E6", "https://twitter.com/DailyGrail/status/1250005933989625856", "https://twitter.com/hashtag/CoronapLandemic?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/ExposeBillGates?src=hash&ref_src=twsrc%5Etfw", "https://t.co/X0dxu6D9Mm", "https://twitter.com/Thomas_Binder/status/1271879108058927105?ref_src=twsrc%5Etfw", "https://www.cnbc.com/video/2019/01/23/bill-gates-and-the-return-on-investment-in-vaccinations-davos.html", "https://www.cnbc.com/2019/01/17/bill-gates-says-this-is-the-best-investment-he-has-ever-made.html", "https://twitter.com/hashtag/ExposeBillGates?src=hash&ref_src=twsrc%5Etfw", "https://t.co/Ix231B27lW", "https://twitter.com/slayersins/status/1271962009156775936?ref_src=twsrc%5Etfw", "https://www.bitchute.com/video/oDR8tg4LMiKw/", "https://stm.sciencemag.org/content/11/523/eaay7162", "https://ucrtoday.ucr.edu/54144", "https://id2020.org/", "https://www.snopes.com/fact-check/bill-gates-id2020/"], "authors": ["Greg"], "publish_date": "2020-06-20T06:51:51+00:00"}