{"result_id": "089002", "URL": "https://www.dailygrail.com/2008/06/expelling-sheldrake/", "timestamp": "2023-04-25 14:56:48 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.dailygrail.com/wp-content/uploads/2020/12/cropped-TDG-favicon-1.png?fit=32%2C32&ssl=1", "canonical": "https://www.dailygrail.com/2008/06/expelling-sheldrake/", "encoding": "UTF-8"}, "image": null, "domain": "www.dailygrail.com", "title": "Expelling Sheldrake", "cleaned_text": "Biologist P.Z. Myers has become somewhat of an Internet phenomenon on account of his ascerbic blog Pharyngula, on which he often attacks those who dispute the theory of evolution (generally grouped by Myers under the one heading, ‘Creationists’). Though his blog was already insanely popular, his star fully rose when he was kicked out of a preview showing of the Intelligent Design movie Expelled (ironically, Richard Dawkins attended with him, but was let in).\n\nIn a posting this week on Pharyngula, Myers turned his attention to psi research, with a diatribe aimed at Rupert Sheldrake. In it, he labeled Sheldrake as being “nuts”, going on to say “I’ve read enough of Sheldrake’s work to know what a godawful load of substanceless bollocks he can spew at will.” Apart from the personal attacks, Myers also said Sheldrake’s experiments “are exercises in gullibility, anecdote, and sloppy statistics….You can’t just simply carry out a Fortean exercise in collecting odd anecdotes and unexplained phenomena.”\n\nI spoke to Rupert Sheldrake about the Pharyngula post yesterday, and here’s what he had to say in response:\n\n[W]ith such a farrago of prejudice, ignorance and arrogance, it’s hard to know where to begin. It doesn’t really seem worth replying to people who aren’t interested in the facts but simply in venting their rage. Myers has not taken the trouble to read any of my experiments on telephone telepathy nor any of my other research on the subject and is obviously as bigoted as Dawkins himself. For example when he refers to my experiments as “exercises in gullibility, anecdote and sloppy statistics” the only thing he refers to is an attack by some sceptics on my staring research based on a fallacious argument which I’ve already refuted in the Skeptical Inquirer. He has not taken the trouble to look at the telephone telepathy or email telepathy experiments, published in peer-reviewed journals, which are based not on anecdotes but on randomized controlled tests. Then he accuses me of not proposing any theory for telepathy, which in fact I have done. But there’s nothing one can do about ranters of this kind, who are beyond the reach of science and reason. Some of the comments following his blog are equally sad and remind me of the low level of debate found on the Dawkins website where people vie with each other in their prejudice, sneering and nastiness.\n\nPersonally, I have to say I find this attack by Myers to be off-base, and in some ways, confused. Firstly, and perhaps most importantly, he attacks Sheldrake based on an article which is – quite simply – a rather shocking indictment of Richard Dawkins…and Myers doesn’t have a word of criticism for Dawkins (or, at the very least, the production company behind the ‘Enemies of Reason’ series). Additionally, it’s unclear whether Myers even read the article, as he claims Sheldrake simply indulges in “Fortean exercises collecting anecdotes”, despite Sheldrake pointing out in the article (to Dawkins) that his experiments have been published through peer-review.\n\nAlso, Myers fails to mention anything about Sheldrake’s detailed and intelligent rebuttals to criticism of his experiments, such as this one – which inspired the editor of The Skeptic to introduce Sheldrake’s response by saying “Is it possibly the case that Sheldrake is even more sceptical than the sceptics?”\n\nP.Z. Myers seems to see enemies everywhere, insidious in their attempts to overthrow science – often betrayed by the loaded language of his post (e.g. “Notice the devious twist?”). He fails to distinguish between Sheldrake’s scientific research, and his enjoyable speculations (as can be found in the ‘Trialogue’ series with Terence McKenna and Ralph Abraham). And instead of laying out his problems with the evidence collected by Sheldrake, he relies on an ad hominem attack, with plenty of straw men to boot.\n\nSheldrake has collected some intriguing evidence of anomalies in science. Whether his results will be confirmed in further tests is still to be seen (though there have been some negative and positive replications thus far). But Sheldrake – probably the most eloquent of spokespersons for research into anomalies – has faced up to attacks for the past couple of decades now, and some his previous words are probably a good response to P.Z. Myers’ post on Pharyngula:\n\nTo accept [the existence of psi] would not involve the abandonment of science and reason, and the collapse of civilization as we know it; rather it would extend the scope of science and of evolutionary understanding….I am a sceptic, but of a different kind. His scepticism is directed towards anything he regards as “paranormal”, taking as normal that which lies within the limits of current scientific understanding. My scepticism is directed towards the assumption that we know enough to proclaim what is possible and what is not.\n\nCertainly would be interesting to see a debate between Sheldrake and Myers.", "opengraph": {"locale": "en_US", "type": "article", "title": "Expelling Sheldrake - The Daily Grail", "description": "Biologist P.Z. Myers has become somewhat of an Internet phenomenon on account of his ascerbic blog Pharyngula, on which he often attacks those who dispute the theory of evolution (generally grouped by Myers under the one heading, ‘Creationists’). Though his blog was already insanely popular, his star fully rose when he was kicked out of a preview showing of the Intelligent Design movie Expelled (ironically, Richard Dawkins attended with him, but was let in). In a posting this week on […]", "url": "https://www.dailygrail.com/2008/06/expelling-sheldrake/", "site_name": "The Daily Grail", "article:publisher": "https://www.facebook.com/TheDailyGrail/", "article:author": "https://www.facebook.com/TheDailyGrail/", "article:published_time": "2008-06-13T06:58:01+00:00", "image": "https://i1.wp.com/www.dailygrail.com/wp-content/uploads/2004/07/BC_sense_of_being_stared_at.jpg?fit=302%2C475&ssl=1", "image:width": "302", "image:height": "475", "image:type": "image/jpeg"}, "tags": ["psychedelics", "UFOs", "Graham Hancock", "afterlife", "Jacques Vallee"], "tweets": [], "movies": [], "links": ["http://scienceblogs.com/pharyngula/", "http://dailygrail.com/news/dawkins-avoids-being-expelled", "http://scienceblogs.com/pharyngula/2008/06/the_sheldrake_phenomenon.php", "http://sheldrake.org/homepage.html", "http://www.csicop.org/si/2001-03/stare.html", "http://www.sheldrake.org/Articles&Papers/papers/telepathy/index.html", "http://dailygrail.com/node/5817", "http://www.sheldrake.org/controversies/Marksreply_2003.html"], "authors": ["Greg"], "publish_date": "2008-06-13T06:58:01+00:00"}