{"result_id": "089022", "URL": "https://www.dailygrail.com/2020/12/the-ayahuasca-experiences-of-neal-brennan/", "timestamp": "2023-04-25 14:57:26 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.dailygrail.com/wp-content/uploads/2020/12/cropped-TDG-favicon-1.png?fit=32%2C32&ssl=1", "canonical": "https://www.dailygrail.com/2020/12/the-ayahuasca-experiences-of-neal-brennan/", "encoding": "UTF-8"}, "image": null, "domain": "www.dailygrail.com", "title": "The Ayahuasca Experiences of Neal Brennan", "cleaned_text": "American comic & writer Neal Brennan belongs to a very exclusive niche of the modern comedy pantheon. In 2003 he helped his friend Dave Chappelle launch the highly acclaimed Chappelle’s Show on Comedy Central, and during its three years of existence Neal wrote, produced and directed many of the series’ sketches, boldly pushing the envelope on how to address the racial issue in America on a mainstream platform. Later he moved to other ventures like writing jokes for the iconic Saturday Night Live and for his close friend Chris Rock. To describe Neal as the Bernie Taupin of comedy –as Chris Ryan once did when he interviewed him on the podcast Tangentially Speaking in 2017– would be more than fitting.\n\nThat same year of 2017 Neal released 3 Mics on Netflix, which is not your typical comedy special. The show is divided in 3 parts: funny one-liners, followed by traditional stand-up, then continued by Neal’s sharing to the audience of very emotional –and painful—aspects of his personal life; such as his lifelong struggle with clinical depression, and how he had always used jokes and success to cope with the psychological scars caused by the abusive relationship with his unloving, alcoholic father (perhaps Pagliacci would also be a fitting comparison).\n\nAt one point of 3 Mics Neal says: “I believe there is a God and He hears our prayers, and most of the time He’s like “Nah fuck that!”” which –aside from being a very cynical gag– might also offer a glimpse of what his personal views concerning spirituality and the afterlife were at the time.\n\nBut notice how I wrote “at the time,” because now it seems things have changed dramatically for Neal in a different number of ways, all thanks to a chemical compound amply discussed in our website: the Ayahuasca brew created by the Amazonian shamans.\n\nOn November 3rd –the same day 81,283,485 Americans chose to change the course of their nation– on episode No. 78 of their podcast How Neal Feal, Brennan and his cohost Bianca Sia revealed how they’d participated in an Ayahuasca ceremony celebrated at Chris Rock’s residence –following safe distancing and COVID precautions as best they could– and the two of them explained the details of their personal ordeals with the psychedelic substance; which they both felt had been extremely positive and beneficial overall in different ways, despite the moments in which the introspective aspects of the psychedelic trip turned quite challenging at times.\n\nOne particularly funny moment of the anecdote is when Bianca fell into a sort of ‘auditory hallucination’ in which she thought she heard the (non-indigenous) shaman conducting the ceremony say at one point, “Um, guys, I think I messed up the dosage of the brew, and we are all dead,” and in the hallucination Chris Rock yelled “YOU KILLED CHRIS ROCK?!” while Neal Brennan simply said “Buddy, I’m gonna have to sue you!” –would etheric lawyers in the upper and lower realms charge by the hour or by the reincarnation?\n\nThis wasn’t even the most upsetting part in Bianca’s experience, mind you, but even though she was confronted with frightening visions at times, she says she always felt a reassuring ‘presence’ guiding her and telling her –in her own inner voice—that everything was going to be all right. The Ayahuasca ceremony probably took place just a few days after Neil and Bianca recorded this podcast episode, and Bianca was surprised on the characteristic after effects she was still experiencing from the brew –like a significant reduction in her levels of anxiety, compounded with an intolerance to watch the sort of true crime/spooky content she used to enjoy watching on Netflix– yet in spite of the benefits, she was clear that she wasn’t planning on having another rendezvous with ‘Mother Aya’ any time soon.\n\nNeal, on the other hand, felt the ceremony’s aftereffects in his psyche were expressed in a much deeper appreciation for human relationships, resulting in more empathy and tolerance while dealing with stressful situations in his TV commercial directing duties, which would have otherwise caused bursts of anger or frustration on him in the past. He was so surprised by this seemingly magical change in his personality, he decided to try out Ayahuasca one more time –this time, a much more intensive two-day retreat—and the results of this second experience with the shamanic compound were such that, on episode 80 of the podcast, self-confessed cynic Neal Brennan declared he was no longer an atheist:\n\nTo clarify this radical transformation to Bianca and the audience, Neal explained he still did not believe in a ‘God’ in the traditional sense of the word, but the Ayahuasca brew had convinced him there was a sort of ‘spirit force’ permeating the Universe. At one point of the 3 Mics special on Netflix, Neal confesses how in a search of a cure for his severe clinical depression he had tried it all –from years of therapy, clinically-sanctioned ketamine treatment (with mixed results) to even transcranial magnetic stimulation; but that none of these methods came even close from the benefits of Ayahuasca.\n\nAs the citizens across the globe anxiously wait for the COVID-19 vaccines to arrive to their respective countries, many health professionals are worried about the massive emotional and psychological toll the pandemic will leave in those fortunate enough to survive it: substance addiction, suicidal tendencies, increases in family violence, phobias, manias, anger, depression, and a need for closure if you didn’t have a chance to say good-bye to a loved one who died alone in an ICU. With such a grim outlook, perhaps the second-best things the governments of the world could do in 2021 –after successfully finishing the vaccination campaigns– would be to unanimously finish the futile War on the Drugs, and give a fast-track approval to alternative therapeutical treatments which incorporate psychedelic compounds like psylocibin and DMT.\n\nThe testimony of public figures like Neal Brennan or Bianca Shia help pave the way for such a possibility, and perhaps in years to come we will all be able to look back at the ‘dark ages’ when these substances were proscribed, and have a good laugh about it.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Ayahuasca Experiences of Neal Brennan - The Daily Grail", "description": "American comic & writer Neal Brennan belongs to a very exclusive niche of the modern comedy pantheon. In 2003 he helped his friend Dave Chappelle launch the highly acclaimed Chappelle’s Show on Comedy Central, and during its three years of existence Neal wrote, produced and directed many of the series’ sketches, boldly pushing the envelope on how to address the racial issue in America on a mainstream platform. Later he moved to other ventures like writing jokes for the iconic […]", "url": "https://www.dailygrail.com/2020/12/the-ayahuasca-experiences-of-neal-brennan/", "site_name": "The Daily Grail", "article:publisher": "https://www.facebook.com/TheDailyGrail/", "article:author": "https://www.facebook.com/redpilljunkie/", "article:published_time": "2020-12-18T19:13:37+00:00", "article:modified_time": "2020-12-30T15:15:19+00:00", "image": "https://i1.wp.com/www.dailygrail.com/wp-content/uploads/2020/12/nealbrennan.jpg?fit=1000%2C563&ssl=1", "image:width": "1000", "image:height": "563", "image:type": "image/jpeg"}, "tags": ["psychedelics", "UFOs", "Graham Hancock", "afterlife", "Jacques Vallee"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1120", "height": "630", "embed_code": "<iframe class=\"youtube-player\" width=\"1120\" height=\"630\" src=\"https://www.youtube.com/embed/kOM4g4Y300I?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-AU&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/kOM4g4Y300I?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-AU&autohide=2&wmode=transparent"}, {"embed_type": "iframe", "provider": "youtube", "width": "1120", "height": "630", "embed_code": "<iframe class=\"youtube-player\" width=\"1120\" height=\"630\" src=\"https://www.youtube.com/embed/I6P9GPy4I4Q?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-AU&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/I6P9GPy4I4Q?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-AU&autohide=2&wmode=transparent"}, {"embed_type": "iframe", "provider": "youtube", "width": "1120", "height": "630", "embed_code": "<iframe class=\"youtube-player\" width=\"1120\" height=\"630\" src=\"https://www.youtube.com/embed/gWdZ6pLaA5k?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-AU&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/gWdZ6pLaA5k?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-AU&autohide=2&wmode=transparent"}], "links": ["https://www.nealbrennan.com/", "https://www.imdb.com/title/tt0353049/", "https://chrisryanphd.com/273-neal-brennan-co-creator-of-the-chappelle-show/", "https://www.imdb.com/title/tt6438918/", "https://www.imdb.com/name/nm3719458/", "https://www.webmd.com/depression/features/what-does-ketamine-do-your-brain#1", "https://www.mayoclinic.org/tests-procedures/transcranial-magnetic-stimulation/about/pac-20384625#:~:text=Transcranial%20magnetic%20stimulation%20(TMS)%20is,treatments%20haven't%20been%20effective.", "https://www.npr.org/sections/health-shots/2020/11/04/931377532/rigorous-study-backs-a-psychedelic-treatment-for-major-depression", "https://www.theguardian.com/science/2020/dec/09/psychedelic-drug-dmt-to-be-trialled-in-uk-to-treat-depression"], "authors": ["red pill junkie"], "publish_date": "2020-12-18T19:13:37+00:00"}