{"result_id": "089011", "URL": "https://www.dailygrail.com/2017/10/paul-kimballs-haunted-tv-series-review/", "timestamp": "2023-04-25 14:57:06 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.dailygrail.com/wp-content/uploads/2020/12/cropped-TDG-favicon-1.png?fit=32%2C32&ssl=1", "canonical": "https://www.dailygrail.com/2017/10/paul-kimballs-haunted-tv-series-review/", "encoding": "UTF-8"}, "image": null, "domain": "www.dailygrail.com", "title": "Paul Kimball's Haunted TV Series (Review)", "cleaned_text": "They say parents lie when they claim they don’t have a favorite among their children. I’m a recalcitrant singleton, so I really can’t issue an opinion on the matter –despite how much my sisters tease me when they call me a “Momma’s boy”— but as a Fortean student I know fully well where my predilection resides: UFOs; with cryptids of both land and sea coming on second. And on a rather distant third place there’s the bump-on-the-night phenomena our grandparents –and ourselves– still identify as ghosts.\n\nWhich is probably one of the reasons I was never a fan of the shamelessly abused ‘Reality TV’ sub genre of ghost-hunting shows, so popular in American networks. The few times I tried to endure one of those programs, the cheesy abuse of suspense sound effects and theatrical thriller tricks —“OMG! WHAT WAS THAT??!”— forced me to desist in my commitment rather quickly…\n\nYeah, I chose to stick to the saucer side of the paranormal sidewalk, which is where I met Paul Kimball, the director and producer of the much-acclaimed 2007 documentary Best Evidence: Top 10 UFO Sightings. I found Paul’s opinions on the topic of UFOs to be informed and informative –albeit a tad too skeptical, and maybe a little bit cynical, at the time.\n\nWith that kind of background, I was a bit surprised when Paul ‘switched sides’ and produced a TV series about haunted places in his native country of Canada —Ghost Cases (2009-2010). The program showed Paul and his faithful sidekick Holly Stevens investigating cases of purported paranormal activity in locations over Canada and even the United Kingdom.\n\nBeing in Mexico, I was never able to watch that TV series when it was originally broadcast, but I learned about it and the huge impact it had in changing Paul’s attitude about the Paranormal, when I read his book The Other Side of Truth (2012), which I really can’t recommend highly enough: Not only is it a valuable theoretical speculation about the possible roots, the causes, and the philosophical implications behind Fortean phenomena, but it is also a deep personal journey of an honest man’s quest for the answers you and I are also in search of –who am I? what’s the purpose of all this? Is there something more after we leave this place?.\n\nReading TOSoT makes it clear Paul experienced several incredible things while he was running around with Holly in search of potential ghosts. Things that changed him profoundly. While retaining a healthy dose of skepticism, he was now more open-minded than how he used to be years ago.\n\nPerhaps they both felt a need to keep pushing at the ominous door they tried to open seven years ago, in order to widen the gap and finally pass through that other side –or is ghost-hunting some kind of thrill addiction, I wonder?– In any case Paul and Holly, like the real-life Canadian versions of Mulder and Scully, decided to reunite once again to create a new TV show: Haunted, which premiered on Eastlink TV on October 17th in Atlantic Canada and on their on-demand service across the whole country.\n\nI had the chance to watch the first two episodes, and I could immediately tell Haunted was NOT your typical cliched ghost-hunting show. Yes, there’s the use of IR footage –something unavoidable since the recordings are done in complete darkness most of the time– and yes, they utilize odd gadgetry with weird names like ‘REM-pods’ and ‘EDIs’ whose usefulness and reliability may be up for debate, although I was immediately relieved their functionality was properly explained for us ghost N00bs through screen graphics –if you’re a hardcore skeptic, you may feel it is all FX props, though– but the thing that was evident for me from the get-go was this sense of true spontaneity between Paul, Holly and the rest of their crew.\n\nEpisode 1 and 2 were both recorded at the Queen’s County Museum, in Liverpool, Nova Scotia. A small exhibition center full of History and memories, where the owner (Linda Rafuse) and the local staff have reported anomalous activity for many years. Paul is shown conversing with Linda and coming up with the somewhat strange idea of using the location as a set up to try and come in contact with his late friend Mac Tonnies –the famous author and blogger of Posthuman Blues, who unexpectedly died in the year 2009. We also see a cutscene with Holly and Kim, another member of the team, monkeying around inside a nearby cemetery, mischievously inviting whatever spirit is currently residing there to ‘communicate’ and/or ‘temporarily possess Paul’ if they so desired it.\n\n…Be careful what you wish for, right?\n\nJokes aside, the viewer seems to be initially invited to adopt the all-too-familiar cultural notion that ghosts = dead people. And this is something that I personally find discouraging, because the same way I’ve grown skeptical of the stereotypical portrayal of UFOs as extraterrestrial craft hailing from other planets, I grow weary when ghost hunters instinctively assume they are dealing with the discarnate essence of deceased individuals (we’ll get back to this). I for one, would like to see each and every member of a ghost-hunting crew participating in an investigation to come in front of the camera and explain their personal definition of what a ‘ghost’ may or may not be, or what circumstances may elicit what we deem to call “a haunting.” Because I feel adhering to a particular hypothesis may tend to skew the interpretation of whatever data may be gathered during the search –and to believe the ‘after-death hypothesis’ is the most logical conclusion leaves away many other tantalizing avenues to explore –e.g. the ‘Stone Tape’ hypothesis or the ‘Time Slip’ hypothesis, to name a few.\n\nFurthermore, in light of the events that unfold during the night of their investigation, it poses the question: Should ANYONE be allowed to participate in a ghost hunt?\n\nAllow me to explain: Let’s say you find there’s a dangerous vermin infesting your house: A snake, a rat, a nest of wasps or black widows. Who do you call to deal with it? The Pest Control Agency, or your neighbor Bob who’s a fan of Animal Planet and has sure seen a lot of programs on how to deal with those kinds of critters, y’all?\n\nLikewise, suppose you plan to make a trek into a deep, unexplored cavern full of bats. Wouldn’t you be considered irresponsible by ANYONE if you didn’t at least have the precaution to take the anti-rabies vaccine before venturing into the cave?\n\nWhat, dare I ask, is the paranormal equivalent of an anti-rabies shot? What kind of credentials and training qualifies a ‘professional ghost hunter’, who may be messing around with something more dangerous than a rattlesnake?\n\nThese sort of questions popped into my mind as I witnessed Paul, Holly, Kim –whom we eventually learn is a ‘sensitive’ and is participating on her first ghost-hunting investigation– and the rest of the crew embarking in what they felt was a communication with one or several non-human entities through a device called the REM-pod –which detects energy disturbances around its antenna, along with slight temperature changes. Indeed, it was very entertaining to watch how Paul, playing along with the idea he was perhaps contacting his long-lost friend Mac Tonnies, dealt with the electronic gizmo as a sort of ‘binary’ electronic Ouija board; when he mentioned Mac’s beloved cats, remembering one’s name (Ebe) but forgetting the name of the other one —“I’m sorry, I forgot!” the weird machine seemed to beep in reproval.\n\nTo me it was particularly interesting, you see, because the name of that cat was Spook.\n\nBut the game turned a bit darker as Kim and Holly try to have a go at interacting with ‘whatever’ may be contacting them through the REM-pod. The two seemed to get conflicting ideas of who or what they might have been dealing with, and THIS is where Haunted showed to be on a different level as the rest of the Reality TV paranormal shows: When Paul has some quiet time with Holly later in the night, and posits to her the theory that maybe they are not dealing with Mac, or any of the ‘resident’ spirits of the museum. Perhaps, Paul proposes, this is a single trickster entity feeding each and every one of them with different information according to their expectations.\n\n“But why?” asks her, to which he replies “well, why do we play with cats?”. Here I was truly delighted in seeing Paul ‘channeling’ –in a manner of speaking– the spirit of his friend Mac Tonnies, who once wrote a seminal blogpost back in 2006, in which he was using his routinary entertaining of his feline pet with a laser pointer, as a metaphor for the interaction we humans seem to be having with the intelligence or intelligences, whose manifestations we still stubbornly categorize under different labels –UFOs, cryptid sightings, ghostly apparitions, shadow person encounters, etc.\n\nWhatever it is we’re dealing with –an ultra-dimensional consciousness, ripples emanating from a ‘Time Storm’ or ‘Window Area’, semi-sentient thoughtforms spontaneously arising from a ‘Singularity’ of historical artifacts and information (perhaps that is why ‘ghosts’ don’t seem to be particularly smart) or the ‘echo’ left behind by past traumatic events, just to name a few crazy ideas on top of my head– this phenomenon seems to pick up on the ‘energy’ of nearby human witnesses, using their fear and expectations in order to model its response to each individual. “It’s like going to a Cineplex,” Paul speculates on camera, “and you get different shows on the same building.”\n\nListening to THAT kind of theorizing propels Haunted into a whole new category of TV programming in my mind, and separates it from the rest of the ghost-hunting shows out there.\n\nPaul and Holly’s conversation is cut short when they both hear an odd sound coming from another room –the sound is registered at EXACTLY 11:11, which would be of great interest for the people who pay attention to such ‘numerological’ oddities– and as they decide to get up and check out what could have caused that noise –“It’s good to be back, partner!”– the viewer is left with the impression this is a pair who have gone through thick and thin for many years, and have formed a strong bond of not only mutual respect, but also psychological dependency for one another.\n\nYou don’t risk venturing into that dark, unexplored cavern without someone you can trust holding your lifeline…\n\nAnd perhaps THAT is the only thing that disappointed me about these 2 premiering episodes: The fact that the viewers of Haunted are devoid of the CONTEXT of its previous incarnation, the Ghost Cases show of 2009-2010. 7 years is a lot of time in the unforgiving territory of TV-land, and the producers of this new program shouldn’t take for granted their audience. I feel showing small snippets in which each and every member of the team can properly introduce themselves, explain their background AND (more importantly) the reason why they are choosing to spend so much time and energy running around in search of things that go bump in the night, would be incredibly valuable –AND entertaining. We as viewers are in a way an incorporeal team member of these intrepid individuals, after all; it would be nice to know who is it we are tagging along.\n\nI will stop enumerating the other odd –and disturbing!– things that come to pass through the rest of Haunted’s initial episodes. Suffice it to say, that strong psychological dependency I spoke of is immediately put to the test, by the events that transpired during the remainder of that night…\n\nTo conclude: Does the world need another ghost-hunting TV show? When it comes to the gathering of evidence confirming the reality of paranormal phenomena, then the answer would be a resounding NO –let’s face it: no amount of weird beeps, blurry photos or recorded anomalous sounds will ever be enough to convince the most die-hard skeptic, who can point out to the many instances of deliberate hoaxes perpetrated by other reality TV paranormal shows in order to ‘spice up’ their content –even ‘professional’ ghost-hunters who DO believe in the paranormal question the veracity of what is shown on screen. With the case of Haunted, you either believe they are also fabricating their content, or you don’t –FWIW I choose the latter.\n\nA recent survey conducted by the University of Chapman found 52.3% of Americans believe places can be haunted by spirits. That’s 17.3% above of the people who believe in extraterrestrial visitation in ancient times, and 26.1% above of those who believe in alien contact in the modern era. What is it that makes phantasms more appealing –or at least more plausible– than alien visitation, despite the staggering number of stars in our galaxy alone? Could it be that, aside from the possibility than more people have personally experienced events they attribute to spirit activity, there’s something to ghosts that make them more ‘immediate’? Because of our stereotypical preconceptions, we believe UFOs are ‘out there’, far above us and away of our reach for the most part, yet ghosts are ‘right here’ with us, manifesting in the same dimensional spaces we inhabit on a daily basis. You can find that idea amusing, annoying, terrifying, or perhaps even comforting, if such paranormal activity is appraised as a sign the dead are not totally lost to us once they depart from our current plane of existence.\n\nPerhaps ghosts will forever remain ‘trendier’ than aliens and cryptids, because in a way they are more relevant to our personal lives than lights in the sky and mythical creatures. Whatever our political inclination, sexual orientation, dreams and aspirations, every human being is confronted with one indisputable fact: We are all going to die.\n\nSo-called ‘spirit apparitions’ may shed a light into that ultimate mystery of all. Then again they might not, in which case ghost-hunting shows will remain a ‘guilty pleasure’ form of entertainment for many viewers. And if that’s your case, then you could hardly do better than choosing Haunted for your weekly fantasm fix. The show’s cast members are all witty, funny, have good chemistry together, and they are going about their investigations trying to avoid the cliched pitfalls plaguing their competitors; in fact, they even let the door open for the kind of healthy speculation –and skepticism– that is sorely needed not only in ghost-hunting, but other Fortean fields.\n\nFor me, though, the biggest appeal in watching Haunted would be in following the journey of those involved in their paranormal adventures. You cannot prove the existence of a ghost on TV, but perhaps you can show the personal transformation of those who search for them in dark, creepy places.\n\nShow me that, and I’m HOOKED!\n\nHaunted airs every Tuesday on Eastlink TV and is also available (exclusively in Canada) with their on-demand service. For the rest of the world, look out for its release next year through streaming services like iTunes and Amazon Prime.", "opengraph": {"locale": "en_US", "type": "article", "title": "Paul Kimball's Haunted TV Series (Review) - The Daily Grail", "description": "They say parents lie when they claim they don’t have a favorite among their children. I’m a recalcitrant singleton, so I really can’t issue an opinion on the matter –despite how much my sisters tease me when they call me a “Momma’s boy”— but as a Fortean student I know fully well where my predilection resides: UFOs; with cryptids of both land and sea coming on second. And on a rather distant third place there’s the bump-on-the-night phenomena our grandparents […]", "url": "https://www.dailygrail.com/2017/10/paul-kimballs-haunted-tv-series-review/", "site_name": "The Daily Grail", "article:publisher": "https://www.facebook.com/TheDailyGrail/", "article:author": "https://www.facebook.com/redpilljunkie/", "article:published_time": "2017-10-22T21:42:26+00:00", "article:modified_time": "2019-03-13T01:27:34+00:00", "image": "https://i2.wp.com/www.dailygrail.com/wp-content/uploads/2017/10/paul_holly_cover.jpg?fit=1144%2C641&ssl=1", "image:width": "1144", "image:height": "641", "image:type": "image/jpeg"}, "tags": ["psychedelics", "UFOs", "Graham Hancock", "afterlife", "Jacques Vallee"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/R_1gBtcCP7E\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/R_1gBtcCP7E"}], "links": ["http://www.imdb.com/name/nm3531377/", "http://www.imdb.com/title/tt2216576/", "http://www.imdb.com/title/tt1739432/", "https://www.amazon.com/Other-Side-Truth-Paranormal-Imagination/dp/0991697502", "http://posthumanblues.com", "http://posthumanblues.blogspot.mx/2006/09/every-few-nights-i-get-out-my-laser.html", "http://www.azcentral.com/story/travel/arizona/2017/10/02/ghost-hunting-shows-fake/705566001/", "https://blogs.chapman.edu/wilkinson/2017/10/11/paranormal-america-2017/", "http://winterlightproductions.com/television/haunted/", "http://www.eastlink.ca/"], "authors": ["red pill junkie"], "publish_date": "2017-10-22T21:42:26+00:00"}