{"result_id": "089019", "URL": "https://www.dailygrail.com/2004/10/news-briefs-07-10-04/", "timestamp": "2023-04-25 14:57:22 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.dailygrail.com/wp-content/uploads/2020/12/cropped-TDG-favicon-1.png?fit=32%2C32&ssl=1", "canonical": "https://www.dailygrail.com/2004/10/news-briefs-07-10-04/", "encoding": "UTF-8"}, "image": null, "domain": "www.dailygrail.com", "title": "News Briefs 07-10-04", "cleaned_text": "I seem to have death and immortality in mind this week…\n• Divine intervention or placebo effect? The official doctor of Lourdes has a big job, recording and authenticating every cure.\n• The US Air Force is spending big money on investigations of antimatter weapons.\n• Planet under Pressure: BBC Online’s new series of articles looking at pressing environmental issues begins with biodiversity.\n• Remember that microwave weapon we reported on recently? Seems it is going in aircraft as well as land vehicles.\n• Soviet space shuttle abandoned in the desert after an exhibition is snapped up by a German museum.\n• Modern humans may have wiped out not one but two related species.\n• Peter Davenport, director of the National UFO Reporting Center, gives a lecture on UFO sightings.\n• Lights spotted in the Wisconsin sky may be military, says Air Force.\n• 2,500 recruits a month contract a potentially fatal disease because the Pentagon stopped paying for the vaccine.\n• Outsourcing the Pentagon: a fascinating look at the world of military procurement and contracting. Make of it what you will, whatever your politics.\n• Scientists at the Nobel conference ponder the ultimate limit of human ageing.\n• Girl says bones found in her home belong to a ghost that visits her.\n• Russia’s ratification of the Kyoto Protocol is a gift for Kremlin conspiracy theorists.\n• The Eden Project, an interview with the creator of the amazing experiment in a claypit on Britain.\n• Federal scientists produce DNA evidence of cougars in Canadian Maritime woods, helping confirm many sightings that were met with scepticism.\n• The new America’s Space Prize will offer $50 million to the winner, but to win competitors must reach further than just sub-orbit.\n• American bomb plutonium makes it to French plant without incident. A step forward for non-proliferation.\n• China employs high-tech to find out how much is left of the Great Wall.\n• Cosmetics were used in ancient Iran up to 6,000 years ago. Even Darius the Great wore eyeliner.\n• Indian girl baffles doctors as she bleeds stones from her eyes and ears.\n• Scientists re-create deadly flu bug of 1918 in the lab, for no good reason that I can see.\n• The ancestors of supreme tough guy, T. Rex, had feathers. Yeah, it says “ancestors” not “descendants”.\n• Russian expedition says it has found the location of ancient, mystic Shambala.\n• Academics calculate the formula for Sod’s Law. That’s Murphy’s Law if you are American.\n• Politics Warning: a website alleges that President Bush was wearing a wire during the first Presidential Debate. With pics.\n• Big News!: British scientists are claiming to have rescued patients from the brink of death by turning their blood into stem cells that can repair organs. If true, we know where next year’s Nobel Prize is going.\n\nQuote of the Day:\n\n\n\n “Do not go gentle into that good night. Old age should burn and rave at close of day. Rage, rage against the dying of the light.”\n\n \n\n\n\n\n\n Dylan Thomas", "opengraph": {"locale": "en_US", "type": "article", "title": "News Briefs 07-10-04 - The Daily Grail", "description": "I seem to have death and immortality in mind this week… Divine intervention or placebo effect? The official doctor of Lourdes has a big job, recording and authenticating every cure. The US Air Force is spending big money on investigations of antimatter weapons. Planet under Pressure: BBC Online’s new series of articles looking at pressing environmental issues begins with biodiversity. Villagers flee after mistaking disco lights for invading aliens. Remember that microwave weapon we reported on recently? Seems it is […]", "url": "https://www.dailygrail.com/2004/10/news-briefs-07-10-04/", "site_name": "The Daily Grail", "article:publisher": "https://www.facebook.com/TheDailyGrail/", "article:published_time": "2004-10-07T10:49:50+00:00"}, "tags": ["psychedelics", "UFOs", "Graham Hancock", "afterlife", "Jacques Vallee"], "tweets": [], "movies": [], "links": ["http://www.guardian.co.uk/life/interview/story/0,12982,1315591,00.html", "http://www.defensetech.org/archives/001137.html", "http://news.bbc.co.uk/2/hi/science/nature/3686106.stm", "http://news.bbc.co.uk/1/hi/sci/tech/3667300.stm", "http://www.ananova.com/news/story/sm_1128290.html?menu=news.quirkies", "http://www.wchstv.com/newsroom/oh/news3.shtml", "http://news.scotsman.com/scitech.cfm?id=1154862004", "http://www.theaustralian.news.com.au/common/story_page/0,5744,10987416%5E401,00.html", "http://www.zwire.com/site/news.cfm?newsid=13058432&BRD=1719&PAG=461&dept_id=25271&rfi=6", "http://www.wisinfo.com/newsherald/mnhlocal/285036768732903.shtml", "http://seattletimes.nwsource.com/html/nationworld/2002051692_virus03.html", "http://www.publicintegrity.org/pns/report.aspx?aid=385", "http://www.startribune.com/stories/1556/5018093.html", "http://www.ledger-enquirer.com/mld/ledgerenquirer/news/9836697.htm", "http://www.themoscowtimes.com/stories/2004/10/06/007.html", "http://society.guardian.co.uk/environment/story/0,14124,1320275,00.html", "http://www.bbc.co.uk/dna/h2g2/A545447", "http://canadaeast.com/apps/pbcs.dll/article?AID=/20041005/CPN/21932022", "http://www.cbc.ca/story/science/national/2004/10/06/lith041006.html", "http://story.news.yahoo.com/news?tmpl=story&cid=96&e=3&u=/space/20041006/sc_space/americasspaceprizereachinghigherthansuborbit", "http://news.bbc.co.uk/2/hi/europe/3717858.stm", "http://story.news.yahoo.com/news?tmpl=story&cid=1540&ncid=1540&e=9&u=/afp/20041005/sc_afp/china_heritage_041005050448", "http://www.iranian.ws/iran_news/publish/article_4014.shtml", "http://timesofindia.indiatimes.com/articleshow/874532.cms", "http://cnews.canoe.ca/CNEWS/WeirdNews/2004/10/06/658388-ap.html", "http://news.bbc.co.uk/2/hi/health/3719990.stm", "http://www.nature.com/news/2004/041004/full/041004-11.html", "http://www.mosnews.com/news/2004/09/30/shambala.shtml", "http://thescotsman.scotsman.com/index.cfm?id=1167502004", "http://isbushwired.com/", "http://thescotsman.scotsman.com/scitech.cfm?id=1166772004"], "authors": ["Cernig"], "publish_date": "2004-10-07T10:49:50+00:00"}