{"result_id": "089010", "URL": "https://www.dailygrail.com/2012/03/death-star/", "timestamp": "2023-04-25 14:57:04 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.dailygrail.com/wp-content/uploads/2020/12/cropped-TDG-favicon-1.png?fit=32%2C32&ssl=1", "canonical": "https://www.dailygrail.com/2012/03/death-star/", "encoding": "UTF-8"}, "image": null, "domain": "www.dailygrail.com", "title": "Death Star: How Our Own Sun Could Destroy Human Civilization", "cleaned_text": "Despite popular misconceptions, the Sun is not a stable, unchanging, eternal, ball of fire in the sky. Indeed, from an astrophysical and geological perspective, the Sun is quite the opposite. Fueled by nuclear fusion reactions, it is unstable, continually seething and churning, in disequilibrium, discharging not only visible light, but also a large energy array across the electromagnetic spectrum, and belting out charged particles as well.\n\nWhile the Sun may have little hiccups from time to time, it can also suffer from major bouts of coughing, spewing massive “solar storms” Earth’s way. Such storms, thousands of times more massive than anything recorded in modern times, have left their marks in prehistoric records. It is inevitable that major solar storms will hit us again, and although there is no consensus as to exactly when, the evidence taken as a whole suggests that we are in for something major very soon – in fact, we may be overdue! While experts may disagree on the details, it is clear that a major solar storm will have catastrophic consequences for our modern technological society.\n\nOn Thursday, 1 September 1859, the British astronomer Richard C. Carrington was observing and sketching an unusually large and dark group of sunspots at his personal observatory at Redhill, about 32 kilometers south of central London. Carrington, although technically an “amateur” (his family was in the brewery business), was an expert on the Sun and had devoted his time and resources to unraveling the mysteries of our star. Suddenly, on that fateful day, at 11:18 a.m. local time, Carrington observed intense white flashes of light coming from two locations within the sunspot group he was drawing. He was so startled by this unusual phenomenon that he wanted a witness to corroborate his observations. In his own words, he…\n\nThe flashes were now “vanishing as two rapidly fading dots of white light” and by 11:23 they had disappeared. Carrington had observed firsthand an incredibly intense, but short-lived, solar flare. As it turns out, there was another witness to the event. Richard Hodgson was observing the Sun at the same time from his house and observatory at Highgate (about 8 kilometers north of central London), and he too saw the white flashes.\n\nAt Kew Observatory about 16 kilometers east of central London self-recording magnetographs, owned by the Royal Society, were in operation monitoring Earth’s magnetic field. At the very time of Carrington’s observation of the solar flare a relatively small but abrupt disturbance was detected in the tracings of the magnetographs. The magnetic field seemed to return to normal, but then about seventeen and a half hours later all hell broke loose and the magnetometers went off the scale. We now understand that this is what happens when a huge coronal mass ejection (CME) – a giant bubble of ionized gas ejected by the Sun – hits Earth’s magnetosphere. Given how bright the flare was, modern estimates suggest the surface temperature of the Sun at the point of emission was close to 50 million degrees Celsius. An enormous amount of energy was released, not only as visible light but also as intense X-rays and gamma rays, that traveled at the speed of light and thus hit Earth eight and a half minutes later. A CME was simultaneously discharged by the Sun, but the charged particles took considerably longer than the electromagnetic radiation to cross from the Sun to Earth\n\nProtons ejected by the Sun were accelerated by the solar flare and CME to incredibly high energies, and penetrated our atmosphere creating what is known as a solar proton event (SPE). According to one estimate, this reduced the stratospheric ozone layer by five percent, and it took years to fully recover. Furthermore, energetic protons hitting the nuclei of nitrogen and oxygen atoms created a shower of neutrons that rained down onto the surface of Earth. In 1859 there was no technology to detect the solar proton event or the shower of neutrons and their associated elevated levels of radiation. Today, among other effects, we would likely see the widespread failure of computers and other electronics.\n\nThe CME was seen around the world over the next several days as incredible auroral displays in the night skies, and at unusually low latitudes. More importantly, and tellingly, the telegraph systems of the time were widely affected. The 200,000 kilometers of telegraph lines then in use suffered major disruptions and failures, becoming unusable as unwanted electric currents flowed through the wires. In some cases the telegraph operators found that they could disconnect the batteries they normally used and instead send messages via the induced current. In other cases the induced currents sent “fantastical and unreadable messages”. There were instances where sparks flew from telegraph receiving instruments, some operators were nearly electrocuted, and several telegraph stations reportedly burned down.\n\nThe 1859 geomagnetic storm (the general name given to a major disturbance in Earth’s magnetic field/magnetosphere caused by factors external to Earth, such as a solar outburst), which actually consisted of two separate CMEs and associated phenomena occurring over the period from approximately 28 August through 5 September 1859, is referred to as the Carrington Event. It is not just an historical oddity, but of extreme importance to both our understanding of the dynamics of solar outbursts and our ability to predict the ramifications of future solar events. In 1859 civilization suffered little more than a bit of inconvenience and damage to the telegraph system. Such would not be the case if a Carrington-level Event occurred today!\n\nIt is difficult to imagine the socioeconomic impact of a Carrington Level Event (or greater) in the twenty-first century. I believe that the clock is counting down until the next such event, and the longer the Sun retains its pent-up energy, the larger the next major solar event could be. At the same time, we as a society, with our increased reliance on ever more sophisticated and fragile electronics, are becoming ever more vulnerable to even relatively small-scale solar events. These two trends are placing us on a collision course with disaster.\n\nTo make matters worse, modern global systems have become incredibly interconnected and interdependent. This results in efficiency when everything is running smoothly, but comes at the price of extreme vulnerability relative to what would have been minor disruptions in the past. To give one example,\n\nApplying this to a solar outburst, such as a Carrington Level Event or greater, imagine if during the catastrophe the only factory producing a particular critical part, vaccine, or medicine was put offline.\n\nIn 2009 the staid British journal New Scientist published an article with the provocative title “Space storm alert: 90 seconds from catastrophe”, which opens with the following lines:\n\nIn fact, this scenario is not so ridiculous at all, as the New Scientist article goes on to relate. Indeed, if things do not change, it may well be inevitable.\n\nOur modern technological society is, without exaggeration, totally dependent on a constant supply of electricity. An immediate worry concerning a major solar outburst is the vulnerability of modern electricity grid systems – the wires that crisscross nations, and indeed the entire world. The high-voltage systems will essentially act as huge antennae picking up and channeling direct current (DC) as a result of a solar outburst. The power transmission lines are designed to carry alternating (AC) currents, and although the geomagnetically induced current may be relatively weak compared to the currents that normally flow through the transmission lines, since the geomagnetic current is a DC current it can saturate the transformers and system. Among other effects, the all-important transformers along grid lines could heat up and melt, causing massive blackouts. This famously happened in Quebec Province (Canada) when on 13 March 1989 a solar storm disrupted Hydro-Quebec transmission lines and in less than two minutes a blackout occurred affecting six million people for nine to twelve hours. In this particular case a billion-ton cloud of gas and plasma was released from the Sun with the energy of thousands of nuclear bombs exploding simultaneously and headed toward Earth at a speed of approximately 1.6 million kilometers an hour.\n\nBesides the Quebec blackout, the solar flare accompanying the March 1989 solar storm (which was nowhere near the size of the Carrington Event) caused short-wave radio signals to be disrupted, including the jamming of Radio Free Europe that was being broadcast into Russia – initially the Kremlin was suspected as the culprit. Such geomagnetic storms can affect the entire globe, especially the stronger storms (at the level of the Carrington Event and greater), but the immediate risk is most severe at higher latitudes due to the fact that the incoming electric currents are funneled or sucked into Earth’s poles. Thus northern latitude Quebec was hard hit by the March 1989 solar storm, and during the solar storms that occurred around Halloween in 2003 there were blackouts in the city of Malmö, Sweden, and transformers failed in South Africa. But, returning to the March 1989 storm, not only Quebec was affected. Spectacular aurora were seen as far south as Florida and Cuba, indicative of the strength of the storm. In the United States no blackouts occurred, but this was perhaps simply a matter of good fortune. Over 200 power grid problems were reported across the U.S. within minutes of the solar storm hitting. And there were still more direct consequences, as reported by astronomer Sten Odenwald:\n\nA May 1921 geomagnetic storm, caused by a solar outburst, was intermediate in size between the 1859 Carrington Event and the March 1989 solar storm that affected Quebec. In 1921 electrical grid systems and associated technology were neither as extensive nor as susceptible to geomagnetically induced currents as our systems are today. According to recent studies, a 1921 level solar storm could cause 300 to 350 or more large extra high voltage (EHV) transformers to fail or be permanently damaged in the United States, resulting in major electrical grid collapses with resulting blackouts for 130 million people, and the blackouts could last for years. Likewise, transformers would fail around the world. Large transformers, once damaged by overheating, burning, and melting, cannot be repaired but must be replaced. There are few crews trained to replace the transformers, and few spares of these large and expensive transformers on hand. Once the supply of spare transformers has been exhausted, new transformers will have to be manufactured. Even in normal times it can take a year or more to have a large transformer built and delivered. How will it even be possible to build transformers in areas without electricity to power manufacturing facilities?\n\nThe scenario described in the last paragraph is based on the May 1921 geomagnetic storm. A Carrington Level Event would be much worse. Plus, in either case, not only the United States would be hit, but nations around the world. Globally electrical grids would be damaged, with attendant blackouts. And it would be the most developed, technologically sophisticated, modern, industrialized countries that would be most affected. Less developed countries and regions, less dependent on modern infrastructure, would experience fewer disruptions, but given the interconnectedness of the global economy, surely they would ultimately feel the impacts too. Loss of electric power for any length of time, say more than a day or two, is not a minor nuisance in the developed world. Our entire modern societies run on, and are dependent on, a ready and reliable supply of electricity. Without electricity, such necessities as water and sewage treatment would be affected, and in short order water would stop flowing in our public water systems. Those living in high-rise apartment buildings, where water has to be pumped to reach their floors, would lose water straightaway. All electrical appliances would stop working, from computers, lights (imagine the dark nights!), refrigerators, microwaves, televisions, and just about everything else associated with our electronically based society. Battery-powered devices would last only as long as the batteries hold, and then what?\n\nOffice buildings, apartment complexes, factories, government buildings, certain small communities, and so forth have backup generators in place, but such generators will last only as long as there is fuel to power them. Depending on what measures may be in place, within days or weeks the fuel will run out. Even if more fuel is theoretically available, without electricity there may be no way to deliver it. Pumps at service (gas) stations will not work without electricity; transportation by petroleum-powered vehicles will come to a halt. Furthermore, without electricity traffic lights (so essential to keeping order in large modern cities) will stop functioning. Much public transportation in some cities, such as trolleys, subways and electric bus lines is directly dependent on electricity that will no longer be available. Underground tracks, such as for subways, may become flooded from penetrating rain and groundwater without electric pumps to keep them dry.\n\nBuildings will lack air-conditioning, which is directly dependent on electricity. In hot areas, people will die from heat stroke, especially after the drinkable water runs out. In cold regions buildings and people may freeze. Some heating systems use electricity directly. Others, which use oil or natural gas as the fuel, still depend on electricity to pump the fuel, to circulate water or air through the building, to ignite the fuel in the furnace, and to regulate the temperature through electric thermostats. No electricity, no heat!\n\nWithout refrigeration, many foodstuffs will quickly go bad. Even as peoples’ food spoils, fresh supplies will be unavailable. With most or all transportation shut down, any food in supermarkets, or food stockpiled elsewhere, will quickly run out and not be replenished. The same holds true for other items, from toilet paper to prescription drugs, which many people simply take for granted. Likewise medical supplies that need to be kept under controlled temperature conditions may be ruined, and as supplies are exhausted no more will be available. Indeed, any hospital, once the fuel supply for its emergency backup generators is exhausted, will be in very bad shape.\n\nUltimately, due to the devastation caused by a Carrington Level Event (or greater) hundreds of millions of lives could be lost.\n\nIronically, many of the very things that make our modern society so “efficient”, such as lack of redundancy (why keep old-fashioned bulky paper copies of records when they can be stored electronically?), not wasting space warehousing materials and supplies locally, and the concept of just-in-time delivery that is so dependent on steady and reliable transportation networks, make us especially vulnerable and even helpless in the face of massive grid failures and blackouts.\n\nBeyond disruption of electricity grid systems, electronic communication and satellite systems could be significantly disrupted. With a major solar outburst, satellites could literally leave their designated orbits as the density of the atmosphere they travel through changes, causing them to change speed. High-frequency (HF) radio communications, such as those routinely used by aircraft, and HF navigation signals from Global Positioning System (GPS) satellites, will be scrambled and disrupted. A major breakdown in communication systems could lead to literal anarchy. Even a government is dependent on reliable communications to govern and control the distribution of services and goods, and maintain law and order.\n\nA very specific and serious worry involves the roughly 440 nuclear power plants worldwide. As was demonstrated by the March 2011 Fukushima Daiichi nuclear power plant disaster, when electricity is lost and cooling pumps can no longer keep the reactor cool, the reactor can overheat, potentially meltdown (or explode), and radioactive materials will be released to the environment. In the face of a major solar outburst, we could have hundreds of Chernobyl type situations around the planet simultaneously, and with massive blackouts to boot, no foreseeable way to even attempt to realistically deal with the situation. It is difficult enough to attempt to address a Chernobyl or Fukushima level nuclear disaster in isolation!\n\nOne of the major results of a Carrington Level Event could be the collapse of electronic based financial and monetary systems. In the twenty-first century more and more of our financial transactions are carried out in terms of electronic money; that is in terms of simply numbers in computers. There is for the vast majority of “money” in modern industrialized countries actually nothing beyond the electronic accounting system. The money has no physical backing – certainly not gold or other valuables, and not even paper bills or token coins. Quantitative finance expert Espen Haug points out that in 1991 the United States Federal Reserve determined that 69% of all United States dollars were in purely electronic form. Over two decades later this number has surely increased; Haug estimates that 90% of the U.S. money supply currently is purely electronic, and a similar situation occurs for many other countries.\n\nIn the case of a major solar outburst, one that would overload power grids, burning out transformers, causing widespread blackouts, disrupting communication systems, and damaging and destroying computers and all sorts of electronic systems, the basis for the global monetary system, as well as national monetary systems, could be destroyed. Not only would transactions be “temporarily” impossible (where temporarily could encompass not just days or weeks, but months or years), but also in many cases electronic financial records could be severely compromised or completely destroyed, such that it would be impossible to reconstruct the system as it was prior to the impact. The only saving grace might be if financial institutions and companies had their records securely backed up in safe havens well protected from the solar onslaught. Possibly the best bet would be storage in self-contained (certainly not connected to an external power grid) secure caves and tunnels deep inside mountains with tens of meters of solid rock to provide shielding from radiation.\n\nFrying the Earth at the End of the Last Ice Age\n\nHistorically the Carrington Event is the largest such event in the last 450 years (based on nitrate concentrations in ice cores going back to 1561). However, much larger solar outbursts have occurred in the past. A record of solar activity has been reconstructed using fluctuations of isotopes 14C and 10Be recorded dendrochronologically (in tree rings) and in polar ice cores respectively. This has been done with considerable accuracy back to circa 9500 BCE (essentially the end of the last ice age), and the results are rather startling – our Sun has been more active over the last few decades (since about the middle of the twentieth century) than it has been for thousands of years. Depending on how the data is interpreted (the translation of the isotope data to solar activity is not straight-forward, but requires various forms of analyses), the overall level of solar activity is the highest it has been since about 9500 to 9000 BCE, the end of the last ice age!\n\nEarth-directed Coronal Mass Ejection (CME), recorded January 19, 2012 by the Solar and Heliospheric Observatory (SOHO)\n\nPaul LaViolette has marshaled evidence that a major solar flare accompanied by a super solar proton event (or events) at the end of the last ice age fried the Earth (to use the description of LaViolette’s hypothesis put forth in the popular Space Daily). LaViolette bases his conclusions on meticulous analyses of radiocarbon concentrations in sediment cores from the Cariaco Basin (off the coast of Venezuela) correlated with acidity spikes, high NO–3 concentrations, and rises in 10Be deposition rates in the Greenland ice record, all of which he argues are indicators of a sudden cosmic ray influx, in turn correlating with solar activity as expressed specifically through solar flares and SPEs. Additionally, there would also have been accompanying coronal mass ejections (CMEs) on an enormous scale. LaViolette dates the SPE event, which is the major focus of his 2011 paper, to “12,837 +/- 10 cal [calendar] years BP” and equates it with major faunal extinctions in North America at this time. LaViolette also notes that there may have been other SPE events at the end of the last ice age, stating,\n\nIn his paper LaViolette discusses some of the effects of a massive SPE and attendant solar activity for the Earth. The ozone layer, our protection from deadly UV rays, would have been greatly depleted with major ozone holes forming in some areas, that is if the ozone layer was not altogether destroyed completely! Increased doses of damaging, and potentially lethal, UV radiation could have posed a major hazard for organisms on Earth, especially in high and middle latitudes. Besides the increased UV radiation, high-energy cosmic rays that are part of a major SPE would penetrate the atmosphere and raise radiation levels on the ground.\n\nAccording to LaViolette’s calculations, unprotected organisms at sea level during the major SPE event he studied could have accumulated radiation doses of three to six Sieverts (a unit of radiation exposure) over a period of two or three days. Lethal radiation doses for humans are in the range of about 3.5 Sieverts, and for many large mammals in the 3 to 8 Sievert range. The best mode of protection at the time, both from the UV radiation and the cosmic ray radiation, may have been to seek safety in caves and other underground shelters. Interestingly, Austrian archaeologist and speleologist Dr. Heinrich Kusch and his wife Ingrid Kusch have documented hundreds upon hundreds of tunnel systems under Neolitihic settlements found throughout Europe and Turkey, some dating back to around 12,000 years ago.\n\nLaViolette also determined that an enormous SPE would significantly disturb the geomagnetic field of Earth and induce a partial (or possibly complete, at least for a short period of time?) collapse of the magnetosphere. Earth is surrounded by a dust cloud, composed of interplanetary debris plus particles that the solar wind blows off of the surface of the Moon. These particles are trapped in the magnetosphere, held and essentially protected there. But with a partial or complete collapse of the magnetosphere, cosmic rays, SPEs, and CMEs could heat the particles up, causing them to melt, and subsequently they would re-solidify, forming spherules. Furthermore, dust particles and spherules could be jettisoned into the atmosphere, and eventually fall to the surface of Earth – as has been found at numerous sites dating back to the end of the last ice age.\n\nI believe that LaViolette puts together a very powerful and compelling argument that our Sun was much more active, by orders of magnitude, at the end of the last ice age. The core of LaViolette’s meticulous work is that our Sun is not stable, but goes through periods of major instability and increased activity (whatever the cause of such instability and increased activity may be), and the last major (there have been ups and downs since then) occurrence of such increased solar activity was at the end of the last ice age – that is, unless we are willing to acknowledge that the Sun is ramping up right now and again going into a period of instability and increased activity after a lull of thousands of years.\n\nWill it happen again, and soon?\n\nA truism of geology is that if something has happened in the past, it can happen again in the future – and all the indications are that a major solar outburst will occur sooner rather than later! Writing in the prestigious journal Nature, S. K. Solanki and colleagues state,\n\nJames A. Marusek, a physicist and engineer who until his retirement worked for the U.S. Department of the Navy, argues that the Sun is currently undergoing a state change. That is, the inherently unstable Sun is readjusting and re-equilibrating, as it must do periodically through geological time. We may already have had a precursor of what is to come in the very near future, namely the solar storms of 1859. During the summer of 2011, there were reports that the Sun is showing signs of going into a period of low activity when just the opposite had been expected. It is not clear if this is really the case, but even if it is, it does not preclude the possibility there could be some very unusual activity of the Sun on the other extreme – that is during a period of relative dormancy or hibernation there could be an incredible solar outburst. At the end of the ice age some 12,000 years ago there were wild fluctuations in sunspot activity, wide swings between highs and lows, and it seems that during periods of low sunspot activity the energy builds up and erupts as massive solar outbursts rather than being given off as more numerous and smaller flares and CMEs. The 1859 Carrington Event occurred during an overall “quiet” period. As plasma physicist Paul Kintner (Cornell University) has stated,\n\nBeing a geologist, I like the analogy of a major active tectonic/earthquake zone where stress is building up – the stress and energy can be relieved either by many small earthquakes in succession over time, or the stress and energy can build up and continue to build up until it is finally released as one or a few major earthquakes (and the accompanying foreshocks and aftershocks). A short-term lull in sunspot activity says to me that energy is building up in the Sun and it will be released, probably sooner rather than later, in one or a few massive outbursts. My conclusion is that we better be prepared!\n\nIt seems that some governments are taking the threat of a major solar outburst seriously. During the summer of 2011 there were reports that the British government…\n\nTherefore, according to the same article, the British government is making plans to deal with such a scenario, including invoking emergency powers to shut down the electricity grid (purposefully causing massive, though hopefully temporary, blackouts) in an attempt to protect the infrastructure from the worst effects. On the other hand, it was reported that in Australia (which is at lower latitudes than Britain, and arguably therefore less vulnerable to some types of solar outbursts) “electricity experts are not convinced the solar flare will have anywhere near the catastrophic effects predicted in Britain and think any electromagnetic surge will go largely unnoticed”. One wonders, however, if the attitude expressed by the Australian officials – and the same holds true for government leaders and spokespeople elsewhere around the world – is actually a cover so as to avoid concern and potential panic among an ignorant public, even as those in the know secretly make plans to protect themselves and their institutions.\n\nRobert M. Schoch received a Ph.D. in Geology and Geophysics from Yale University, and since 1984 has been a full-time faculty member at the College of General Studies of Boston University. His books include the trilogy with R. A. McNally: Voices of the Rocks, Voyages of the Pyramid Builders, and Pyramid Quest. His most recent book is The Parapsychology Revolution: A Concise Anthology of Paranormal and Psychical Research (Compilation and Commentary by Robert M. Schoch and Logan Yonavjak, Tarcher/Penguin, 2008). Dr. Schoch’s personal website is located at: www.robertschoch.com.", "opengraph": {"locale": "en_US", "type": "article", "title": "Death Star: How Our Own Sun Could Destroy Human Civilization - The Daily Grail", "description": "Despite popular misconceptions, the Sun is not a stable, unchanging, eternal, ball of fire in the sky. Indeed, from an astrophysical and geological perspective, the Sun is quite the opposite. Fueled by nuclear fusion reactions, it is unstable, continually seething and churning, in disequilibrium, discharging not only visible light, but also a large energy array across the electromagnetic spectrum, and belting out charged particles as well. While the Sun may have little hiccups from time to time, it can also […]", "url": "https://www.dailygrail.com/2012/03/death-star/", "site_name": "The Daily Grail", "article:publisher": "https://www.facebook.com/TheDailyGrail/", "article:published_time": "2012-03-09T01:27:48+00:00", "article:modified_time": "2022-09-04T03:50:45+00:00", "image": "https://www.dailygrail.com/wp-content/uploads/2012/03/solar-storm.jpg", "image:width": "1400", "image:height": "788", "image:type": "image/jpeg"}, "tags": ["psychedelics", "UFOs", "Graham Hancock", "afterlife", "Jacques Vallee"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe src=\"https://www.youtube.com/embed/4xKRBkBBEP0\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/4xKRBkBBEP0"}, {"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe src=\"https://www.youtube.com/embed/RLdmLqzzB_M\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/RLdmLqzzB_M"}], "links": ["http://sohowww.nascom.nasa.gov/"], "authors": ["Robert M. Schoch"], "publish_date": "2012-03-09T01:27:48+00:00"}