{"result_id": "089001", "URL": "https://www.dailygrail.com/2021/01/the-twilight-zone-has-been-flooded-with-shit/", "timestamp": "2023-04-25 14:56:44 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.dailygrail.com/wp-content/uploads/2020/12/cropped-TDG-favicon-1.png?fit=32%2C32&ssl=1", "canonical": "https://www.dailygrail.com/2021/01/the-twilight-zone-has-been-flooded-with-shit/", "encoding": "UTF-8"}, "image": null, "domain": "www.dailygrail.com", "title": "The Twilight Zone Has Been Flooded with Shit", "cleaned_text": "’The Twilight Zone’ is an apt description of the landscape we navigate here at the Grail – looking into strange ideas, hidden history and ‘heretical’ science, where we are not absolutely sure what is real and what is illusion. It’s a strange place to inhabit: in covering stories at the fringes of science and history, it is necessary to be passionate about what we’re researching and writing about, while never having the fervent belief in those topics that usually engenders such passion.\n\nAs Robert Anton Wilson once wrote, “belief is the death of intelligence…as soon as one believes a doctrine of any sort, or assumes certitude, one stops thinking about that aspect of existence”. Instead, one has to be passionate about the idea that presenting theories and concepts outside the mainstream can help us grow.\n\nKeeping one’s wits is especially necessary in the ’twilight zone’ because, to be honest, this liminal space is populated with tricksters – or more mundanely put, with a host of people who are either (a) grifters looking for fame and/or money, or (b) outright deluded folk.\n\nAnyone who has looked back on the history of the subjects we cover, from ufology to conspiracies, will know there is a rogue’s gallery of unscrupulous or crazy individuals and groups who have been peddling nonsense. But in the last few years I’ve noticed the amount of bullshit out there in our space is spreading like a virus (without social distancing measures).\n\nAlt-right turd-blossom Steven Bannon famously said in 2018 that one of his strategies to avoid close inspection and criticism was to “flood the zone with shit” – in other words, to saturate a news space with misinformation so that readers no longer have the mental bandwidth to sift truth from fiction.\n\nFolks, the Twilight Zone is currently flooded with shit.\n\nI am no curmudgeonly skeptic – I’ve run a site for two decades whose express purpose is to give a voice to weird ideas and science outside the current paradigm. Last year I wrote a piece about how science should be more open to discussing anomalies (“Seeing the spaceship: why we need to pay attention to anomalies“). But in the last few years I have felt like I have a full-time job fact-checking ‘believers’, rather than challenging orthodox and mainstream ideas – and I’m sure many in the field have dismissed the Grail as ‘turning into skeptics’.\n\nHere’s the thing: all of us who like hanging out in the Twilight Zone have our own responsibilities. And first and foremost among them is to do no harm, and not profit in any way from lies and misrepresentation.\n\nBeyond that, we all must understand that the mainstream is the mainstream for a reason – because it’s a body of knowledge that has been accumulated, tested, and (at least largely) passed those tests. Any anomalous idea is a challenger, and most times we’re talking ‘overweight washed-up challenger’ coming up against Mike Tyson in his prime. As such, until that anomalous idea can go twelve rounds with the champ, it’s a massive underdog. We all love supporting the underdog, but that doesn’t mean he can box and you should be putting your life savings on him. Paradigm-shifting ideas are a rare occasion indeed, while social media in the modern world is a non-stop deluge of dubious claims.\n\nTo put it in a more serious way: if a guy on YouTube says that their research had proven that the element bismuth had antigravity powers, would you put some in your pocket and walk off the Empire State Building? Or would you demand some evidence?\n\nI make this point for a reason. The rapid flooding of the zone with shit in recent years has largely been in areas where I think there is real potential for harm, in particular with anti-vaccination propaganda, COVID-19 denialism, and the civil-war evoking QAnon conspiracy theory.\n\nModern social media makes it easy for one dissenter or ‘influencer’ to go viral, while a thousand experts are ignored – just because an authority figure such as one doctor or scientist says COVID-19 doesn’t exist, doesn’t mean we get to reject the view of thousands of other doctors or scientists who believe otherwise. The anomalous claim must have evidence to back it up – and not the “here’s a few things to stoke your confirmation bias” type of evidence while ignoring important other evidence that says otherwise. Modern bullshittery in the social media/YouTube age follows the ‘active measures’ playbook used by government intelligence agencies:\n\nWe must be more skeptical, we must be more responsible, in what we promote and how we promote it. Present the opposing sides of the debate, discuss it intelligently and with caveats, and be sure you follow reason rather trying to confirm your beliefs. Apart from avoiding doing harm to others and society, you’re also helping ideas get openly evaluated and perhaps evolve good ones forward. By promoting the shit, you simply throw the good ideas and research into the toilet with it.\n\nIn 2018 I wrote about the absurdity of the QAnon conspiracy theory, and the dangers it could pose in the future, opening with the quote from Voltaire: “Those who can make you believe absurdities, can make you commit atrocities.” I noted a particular feature in a well-known picture of a QAnon believer that had escaped much attention: he had a noose on his t-shirt.\n\nHaving looked into QAnon quite a bit, I was aware that many were enthusiastic about the possibility of Democrat politicians being publicly hanged, and the t-shirt was visual evidence of this.\n\nToday, as I was finishing writing this piece, this imagery came out of Washington D.C: a literal gallows had been put in place outside the Capitol, as a number of QAnoners stormed the building.\n\nNow, more than ever, everyone involved in exploring fringe and alternative theories of history, science and conspiracy needs to take stock of where they are at: their beliefs, their internal biases, the actual probability of all these various claims being true, and perhaps most of all – their humanity. Remember Voltaire’s warning, “those who can make you believe absurdities, can make you commit atrocities”. And to quote Robert Anton Wilson again:", "opengraph": {"locale": "en_US", "type": "article", "title": "The Twilight Zone Has Been Flooded with Shit - The Daily Grail", "description": "’The Twilight Zone’ is an apt description of the landscape we navigate here at the Grail – looking into strange ideas, hidden history and ‘heretical’ science, where we are not absolutely sure what is real and what is illusion. It’s a strange place to inhabit: in covering stories at the fringes of science and history, it is necessary to be passionate about what we’re researching and writing about, while never having the fervent belief in those topics that usually engenders […]", "url": "https://www.dailygrail.com/2021/01/the-twilight-zone-has-been-flooded-with-shit/", "site_name": "The Daily Grail", "article:publisher": "https://www.facebook.com/TheDailyGrail/", "article:author": "https://www.facebook.com/TheDailyGrail/", "article:published_time": "2021-01-07T07:02:48+00:00", "article:modified_time": "2021-01-07T12:05:20+00:00", "image": "https://i1.wp.com/www.dailygrail.com/wp-content/uploads/2021/01/The-Twilight-Zone-spiral.jpg?fit=1600%2C873&ssl=1", "image:width": "1600", "image:height": "873", "image:type": "image/jpeg"}, "tags": ["psychedelics", "UFOs", "Graham Hancock", "afterlife", "Jacques Vallee"], "tweets": [], "movies": [], "links": ["https://www.vox.com/policy-and-politics/2020/1/16/20991816/impeachment-trial-trump-bannon-misinformation", "https://www.dailygrail.com/2019/02/seeing-the-spaceship-why-we-need-to-pay-attention-to-anomalies/", "https://www.wired.com/story/uncovering-operation-neptun-the-cold-wars-most-daring-disinformation-campaign/", "https://www.dailygrail.com/2018/08/weaponizing-conspiracy-theory-the-dangers-in-priming-people-for-armed-revolution/"], "authors": ["Greg"], "publish_date": "2021-01-07T07:02:48+00:00"}