{"result_id": "089008", "URL": "https://www.dailygrail.com/2022/05/the-georgia-guidestones-continue-to-terrify-conspiracy-theorists/", "timestamp": "2023-04-25 14:57:00 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.dailygrail.com/wp-content/uploads/2020/12/cropped-TDG-favicon-1.png?fit=32%2C32&ssl=1", "canonical": "https://www.dailygrail.com/2022/05/the-georgia-guidestones-continue-to-terrify-conspiracy-theorists/", "encoding": "UTF-8"}, "image": null, "domain": "www.dailygrail.com", "title": "The Georgia Guidestones continue to terrify conspiracy theorists", "cleaned_text": "The radicalisation of politics in the United States continues apace with Georgia Republican gubernatorial candidate Kandiss Taylor making the news for suggesting that corrupt officials might face death by firing squad if she was elected (she wasn’t). It wasn’t the first outrageous thing the ‘Jesus, Guns, Babies’ candidate has said, after previously also making the somewhat backward argument that Native Americans had sacrificed their lands and lives so that modern Americans could worship Jesus.\n\nSo it’s not particularly surprising to discover that a key part of Taylor’s campaign platform is the dismantling of the Georgia Guidestones, a Stonehenge-like granite monument constructed some four decades ago near Elberton, Georgia, that has for many years attracted the attention of conspiracy theorists who believe it contains a message from [insert your evil secret society of choice] about the mass killing of the population of Earth.\n\nIn a pinned tweet with a campaign video, she promises to “DEMOLISH the Georgia Guidestones” if elected governor, due to its links to a hypothesised Satanic Regime/Luciferian Cabal:\n\n“Over four billion people have been injected with something that took just nine months to create – ask yourself why”, Taylor says, as the video shows the Georgia Guidestones’ infamous inscription “Maintain humanity under 500,000,000” – likely riffing on an anti-vaxx conspiracy suggesting that the COVID-19 vaccine has been designed to kill off a large proportion of the population of Earth.\n\nTaylor, who also ran a losing campaign for the US Senate in 2020, also makes reference to the toppling of Confederate statues, as well as perhaps to the installation of a statue of Baphomet at the State Capitol in Little Rock, Arkansas: “We’ve watched as people have destroyed our history and monuments, and in their place they have erected statues to their own gods. The New World Order is here, and they told us it was coming.”\n\n“It is a war between good and evil,” Taylor says, as the video ends with her standing before the controversial monument, with the overlaid text “Executive Order 10: Demolish the Georgia Guidestones” and a link to more information on her website. There, preceding a donation form, is the following message:\n\nFor decades, the Global Luciferian Regime has seeped its way into our Government. They demoralized us with humiliation rituals as they tore down our historical monuments, persecuted our children, locked us down in our homes, and forced us into becoming walking science experiments through a global vaccination program. They erected statues spelling out the exact plans they had for us, and today we the people of Georgia, say no more. It’s time for us to return the favor. On my first day as Governor of Georgia, I will move to DEMOLISH the Demonic plans of our enemy. The Satanic agenda is NOT welcome in our state. Support my fight by contributing, and watch as I turn the Georgia Guidestones into dust!\n\nAs I’ve discussed previously, the fixation that a number of conspiracy theorists have with the Georgia Guidestones being an advertisement for a global depopulation program is a born out of a misunderstanding about the function of the monument: rather than a billboard for a coming, purposeful extermination, it is meant as a beacon for survivors of any future apocalypse (probably nuclear, given when it was created) to guide them in how to reconstruct society, and is based on Masonic myths related to stone monuments bearing knowledge and wisdom for survivors of the Great Flood. It’s still worth being concerned about some of its messages (“Guide reproduction wisely, improving fitness and diversity” certainly has a flavour of eugenics about it – see the footnote at the bottom of this post for more on this), but the message about maintaining population below 500 million is meant as a suggestion for an already decimated civilization in the rebuilding process, not as a threat to people of today.\n\nAnd yes, it is kind of an absurd suggestion to say that a secret society would create a billboard of sorts to explicitly advertise its plans to exterminate 90% of the world’s population – but it’s worth noting that the start of Taylor’s video features a text grab of the writings of Christian conspiracy theorist Michael A. Hoffmann II (Secret Societies and Psychological Warfare) related to what he called ‘the Revelation of the Method’ – a certain point during a conspiracy, he says, where secret societies explicitly brag about/make it known what they are doing because they are no longer afraid of consequences and want to reinforce their dominance over the general public.\n\nThankfully (at least in terms of the Georgia Guidestones), there was little chance of Kandiss Taylor being elected to office, as there were two more high-profile Republican candidates well ahead of her in the pecking order. But it is just one more reminder of how conspiracy theories, from QAnon to the Georgia Guidestones, remain a major talking point in American society and politics.\n\nUpdate: in somewhat of a coincidence, at almost the same time I posted this story, Last Week Tonight with John Oliver posted one of their web specials, this one devoted to Kandiss Taylor and her Georgia Guidestones rants. In that video (embedded below), John Oliver mentions that the man behind the Georgia Guidestones was likely identified in the 2015 documentary Dark Skies Over Elberton as Herbert Kersten, a doctor from Iowa who passed away in 2005. Two things are worth noting about the late Dr Kersten:\n• He is said to have held outspoken racist views , offering support for the views of former KKK head David Duke.\n\nWhich is kind of ironic, given that Republican Candidate for Georgia and supporter of Kandiss Taylor viewed him as someone with a Satanic ideology…", "opengraph": {"locale": "en_US", "type": "article", "title": "The Georgia Guidestones continue to terrify conspiracy theorists - The Daily Grail", "description": "The radicalisation of politics in the United States continues apace with Georgia Republican gubernatorial candidate Kandiss Taylor making the news for suggesting that corrupt officials might face death by firing squad if she was elected (she wasn’t). It wasn’t the first outrageous thing the ‘Jesus, Guns, Babies’ candidate has said, after previously also making the somewhat backward argument that Native Americans had sacrificed their lands and lives so that modern Americans could worship Jesus. So it’s not particularly surprising to […]", "url": "https://www.dailygrail.com/2022/05/the-georgia-guidestones-continue-to-terrify-conspiracy-theorists/", "site_name": "The Daily Grail", "article:publisher": "https://www.facebook.com/TheDailyGrail/", "article:author": "https://www.facebook.com/TheDailyGrail/", "article:published_time": "2022-05-30T07:08:41+00:00", "article:modified_time": "2022-06-25T04:14:24+00:00", "image": "https://www.dailygrail.com/wp-content/uploads/2022/05/evil-guidestones.jpg", "image:width": "1397", "image:height": "751", "image:type": "image/jpeg"}, "tags": ["psychedelics", "UFOs", "Graham Hancock", "afterlife", "Jacques Vallee"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">I am the ONLY candidate bold enough to stand up to the Luciferian Cabal.<br/><br/>Elect me Governor of Georgia, and I will bring the Satanic Regime to its knees— and DEMOLISH the Georgia Guidestones.<br/><br/>Join me in my fight to <a href=\"https://twitter.com/hashtag/TearThemDown?src=hash&amp;ref_src=twsrc%5Etfw\">#TearThemDown</a>!<br/><br/>Contribute: <a href=\"https://t.co/nvrU2idhNX\">https://t.co/nvrU2idhNX</a> <a href=\"https://t.co/yoFWeNXUpM\">pic.twitter.com/yoFWeNXUpM</a></p>— Kandiss Taylor (@KandissTaylor) <a href=\"https://twitter.com/KandissTaylor/status/1521132865618071555?ref_src=twsrc%5Etfw\">May 2, 2022</a></blockquote> \n"], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "1120", "height": "630", "embed_code": "<iframe class=\"youtube-player\" width=\"1120\" height=\"630\" src=\"https://www.youtube.com/embed/AEa3sK1iZxc?version=3&amp;rel=1&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;fs=1&amp;hl=en-AU&amp;autohide=2&amp;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"/>", "src": "https://www.youtube.com/embed/AEa3sK1iZxc?version=3&rel=1&showsearch=0&showinfo=1&iv_load_policy=1&fs=1&hl=en-AU&autohide=2&wmode=transparent"}], "links": ["https://www.newsweek.com/kandiss-taylor-treason-sheriff-speech-viral-video-firing-squad-rally-forsyth-georgia-1709069", "https://www.thewrap.com/kandiss-taylor-jesus-guns-babies-bus-jokes/", "https://www.newsweek.com/native-americans-made-sacrifice-our-right-worship-jesus-taylor-1708855", "https://www.thedailybeast.com/kandiss-taylor-georgia-candidate-for-governor-builds-campaign-on-demolition-of-satanic-tablets", "https://twitter.com/hashtag/TearThemDown?src=hash&ref_src=twsrc%5Etfw", "https://t.co/nvrU2idhNX", "https://t.co/yoFWeNXUpM", "https://twitter.com/KandissTaylor/status/1521132865618071555?ref_src=twsrc%5Etfw", "https://www.npr.org/2018/08/17/639726472/satanic-temple-protests-ten-commandments-monument-with-goat-headed-statue", "https://www.thedailybeast.com/kandiss-taylor-georgia-candidate-for-governor-builds-campaign-on-demolition-of-satanic-tablets", "https://www.dailygrail.com/2009/09/beyond-the-apocalypse/", "https://www.amazon.com/dp/B07D624MMF/", "http://vanshardware.com/2015/09/part-1-iowa-white-supremacist-behind-the-georgia-guidestones/", "https://www.newspapers.com/clip/16057610/the-des-moines-register/"], "authors": ["Greg"], "publish_date": "2022-05-30T07:08:41+00:00"}