{"result_id": "090017", "URL": "https://dailyhealthpost.com/sugar-heart-disease/", "timestamp": "2023-04-25 14:57:48 CEST+0200", "meta": {"description": "For over 50 years, however, the sugar industry was actually funding research to discredit the link between sugar and heart disease.", "lang": "en", "keywords": "", "favicon": "https://dailyhealthpost.com/wp-content/uploads/2018/06/cropped-logo_lg-32x32.png", "canonical": "https://dailyhealthpost.com/sugar-heart-disease/", "encoding": "UTF-8"}, "image": null, "domain": "dailyhealthpost.com", "title": "How The Sugar Industry Paid Harvard Researchers to Say Fat (Not Sugar) Caused Heart Disease", "cleaned_text": "As you might have noticed, sugar has now undergone the same criticism that fat and cholesterol once had.\n\nFor over 50 years, however, the sugar industry was actually funding research to discredit the claim that high sugar consumption caused heart disease (1).\n\nIn fact, Dr. Cristin Kearns, a dentist-turned-researcher at the University of California, San Francisco, found 2,000 pages of internal documents in the basement of a Harvard library supporting these claims.\n\nThe Link Between Sugar And Heart Disease\n\nShe discovered that two famous Harvard nutritionists, Dr. Fredrick Stare and Mark Hegsted, were paid by the Sugar Research Foundation to publish two reviews in a top medical journal. Both had the sole goal of downplaying the role of sugar in coronary heart disease after the medical community had begun pointing the finger.\n\nNot only did sugar companies pay for the research, but the trade group initiated the study and hand-picked the researchers and laid out clear objectives for them. In total, the group paid the equivalent of $48,000 in 2016 dollars for their scheme.\n\nAt the time, researchers were under no obligation to cite conflicts of interest or publicly acknowledged funding. Hence, both reviews (published in 1967 in the New England Journal of Medicine) did not disclose their ties to the sugar industry. However, these rules have since changed.\n\nThrough this slight of hand, the Sugar Research Foundation was able to drown the proof that sugar had a clear connection to heart disease and instead shift the blame onto fat and cholesterol intake. Moreover, they suggested that you could cut your risk of heart disease by reducing your fat intake alone.\n\n Stanton Glantz, Kearns’s coauthor and her advisor at UCSF explains: “By doing that, it delayed the development of a scientific consensus on sugar-heart disease for decades.” (2).\n\nIt also lead to the rise of foods low in fat and high in sugar. Consequently, sugar’s market share skyrocketed.\n\nEven now, some 50 years later, nutritionists disagree on whether fat, cholesterol, or sugar consumption is the higher risk factor for coronary heart disease.\n\nFor example, Marion Nestle, a nutrition expert at New York University who was not involved in the paper, admits she isn’t convinced that sugar is as bad as it’s portrayed. Instead, she argues that a person’s total calorie consumption could matter more in terms of causing disease.\n\nHowever, Nestle did admit “Science is not supposed to work this way… Is it really true that food companies deliberately set out to manipulate research in their favor? Yes, it is, and the practice continues,” (3).\n\nThere’s also another, very vocal critic of the revelation: “We acknowledge that the Sugar Research Foundation should have exercised greater transparency in all of its research activities,” said the Sugar Association, the new name for the trade group.\n\nThey also questioned the validity of the study “it is challenging for us to comment on events that allegedly occurred 60 years ago, and on documents we have never seen.”\n\n“Sugar does not have a unique role in heart disease,” they insist. “We’re disappointed to see a journal of JAMA’s stature” using “headline-baiting articles to trump quality scientific research,” the statement concluded.\n\nHow It Came To Fruition\n\nDr. Kearns became more interested in the subject of corporate influence after attending a 2007 dentistry conference on diabetes. The key speakers insisted that there is no evidence linking sugar to chronic disease (4).\n\n Instead, they pushed forward the idea of finding a vaccine for tooth decay without suggesting the reduction of sugar intake (5).\n\nUpset by this blatant denial of evidence, she set out to uncover how deeply involved the industry was with medical research.\n\nThis is by far not the only time corporations have attempted to manipulate information. The tobacco, chemical, dairy and pharmaceutical industries are well known to play dirty. Coca-Cola, the world’s largest producer of sugary beverages, has spent millions of dollars on funding research that denies the link between sugary drinks and obesity.\n\nThanks to Dr. Kearns and her team, the federal government is now acknowledging the perils of sugar and has issued new dietary guidelines recommend less than 10 percent of a person’s daily calories come from added sugars. While this quantity is still very high, it’s a step in the right direction.\n\nIt all started after a John Hickson, the Sugar Research Foundation’s vice president and director of research, began monitoring nutrition research.\n\nAfter the medical community began examining the role of sugar in chronic disease, the trade group’s president announced in 1954 that they would attempt to shift the blame onto fat and cholesterol.\n\nIt wasn’t until July of 1965 that the Annals of Internal Medicine published a study linked sugar to heart disease. After the fact, Hegsted was approached for help. He later became the head of nutrition at the United States Department of Agriculture and collaborator for the United State’s federal dietary guidelines.\n\nMeanwhile, his co-conspirator, Dr. Fredrick J. Stare, became the chairman of Harvard’s nutrition department.\n\nResearchers actively communicated with the association throughout the review. When it came to the final draft, Hickson got to take a look before it was published. He wrote: “Let me assure you this is quite what we had in mind and we look forward to its appearance in print.”\n\nThe following year, the papers were published. Although the authors disclosed other industry funding, they never revealed their ties to the Sugar Research Foundation.\n\nFor the first time, Glantz, Kearns, and their coauthor, Laura Schmidt, have exposed undeniable corporate ties to scientific research. Their only regret is that they could not interview the perpetrators in questions, who are all now deceased.\n\n“It was a very smart thing the sugar industry did, because review papers, especially if you get them published in a very prominent journal, tend to shape the overall scientific discussion,” said Dr. Glantz.\n\nHe stresses that these papers should serve as a reminder of “why research should be supported by public funding rather than depending on industry funding.”", "opengraph": {"description": "The truth is out!", "title": "How The Sugar Industry Paid Harvard Researchers to Say Fat (Not Sugar) Caused Heart Disease", "article_publisher": "dailyhealthpost", "image": "https://dailyhealthpost.com/wp-content/uploads/2016/09/19/sugar-and-heart-disease.jpg", "type": "article", "url": "https://dailyhealthpost.com/sugar-heart-disease/", "site_name": "DailyHealthPost", "article:published_time": "2016-09-20T01:15:41-04:00", "article:modified_time": "2017-08-07T15:09:53-04:00", "updated_time": "2017-08-07T15:09:53-04:00", "locale": "en_US", "article:publisher": "https://www.facebook.com/DailyHealthPost/", "article:author": "https://www.facebook.com/DailyHealthPost", "article:tag": "sugar", "article:section": "Wellness", "image:secure_url": "https://dailyhealthpost.com/wp-content/uploads/2016/09/19/sugar-and-heart-disease.jpg", "image:width": "1200", "image:height": "630", "image:alt": "sugar and heart disease", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://dailyhealthpost.com/are-your-sugary-treats-leading-you-down-the-road-to-heart-disease/", "https://www.statnews.com/2016/09/12/sugar-industry-harvard-research/", "https://dailyhealthpost.com/statin-drugs-worthless/", "https://www.nytimes.com/2016/09/13/well/eat/how-the-sugar-industry-shifted-blame-to-fat.html?smid=fb-nytimes&smtyp=cur&_r=0", "https://dailyhealthpost.com/why-homemade-sauerkraut-could-be-your-secret-weapon-against-fat-cancer-and-heart-disease/", "https://archinte.jamanetwork.com/article.aspx?articleid=2548251", "https://dailyhealthpost.com/cinnamon-and-memory/", "https://www.motherjones.com/environment/2012/10/former-dentist-sugar-industry-lies", "https://dailyhealthpost.com/cause-of-tooth-decay/", "https://journals.plos.org/plosmedicine/article?id=10.1371/journal.pmed.1001798", "https://dailyhealthpost.com/the-real-truth-about-the-dairy-industry/", "https://dailyhealthpost.com/coca-cola-gmo/", "mailto:?subject=How%20The%20Sugar%20Industry%20Paid%20Harvard%20Researchers%20to%20Say%20Fat%20%28Not%20Sugar%29%20Caused%20Heart%20Disease&body=As%20you%20might%20have%20noticed%2C%20sugar%20has%20now%20undergone%20the%20same%20criticism%20that%20fat%20and%20cholesterol%20once%20had.%20For%20over%0D%0A%0D%0ARead More Here: %20https%3A%2F%2Fdailyhealthpost.com%2Fsugar-heart-disease%2F%3Futm_source%3Demail%26utm_medium%3Dsocial%26utm_campaign%3DSocialWarfare", "https://share.flipboard.com/bookmarklet/popout?v=2&title=How+The+Sugar+Industry+Paid+Harvard+Researchers+to+Say+Fat+%28Not+Sugar%29+Caused+Heart+Disease&url=https%3A%2F%2Fdailyhealthpost.com%2Fsugar-heart-disease%2F%3Futm_source%3Dflipboard%26utm_medium%3Dsocial%26utm_campaign%3DSocialWarfare", "https://api.whatsapp.com/send?text=https%3A%2F%2Fdailyhealthpost.com%2Fsugar-heart-disease%2F%3Futm_source%3Dwhatsapp%26utm_medium%3Dsocial%26utm_campaign%3DSocialWarfare", "https://dailyhealthpost.com/kitchen-hacks/"], "authors": [], "publish_date": "2016-09-20T01:15:41-04:00"}