{"result_id": "090015", "URL": "https://dailyhealthpost.com/covid-19-is-here-to-stay-as-it-becomes-an-endemic-disease-experts-predict/", "timestamp": "2023-04-25 14:57:43 CEST+0200", "meta": {"description": "- As countries struggle to put an end to the pandemic, scientists say the virus will stick around as an endemic disease similar to the common cold. That’s", "lang": "en", "keywords": "", "favicon": "https://dailyhealthpost.com/wp-content/uploads/2018/06/cropped-logo_lg-32x32.png", "canonical": "https://dailyhealthpost.com/covid-19-is-here-to-stay-as-it-becomes-an-endemic-disease-experts-predict/", "encoding": "UTF-8"}, "image": null, "domain": "dailyhealthpost.com", "title": "Covid-19 is here to stay as it becomes an endemic disease, experts predict", "cleaned_text": "As countries struggle to put an end to the pandemic, scientists say the virus will stick around as an endemic disease similar to the common cold. That’s what researchers from Emory and Penn State universities predict will happen once most of the population becomes immune to Covid-19.\n\nIn a recent study published in Science, scientists examined COVID-19’s closest relatives to model a “best guess” at the virus’s future. Their forecast? The pandemic will eventually come to an end. But we will never be able to get rid of COVID-19 entirely. And they’re not the only ones predicting this outcome.\n\nIn January, Nature asked more than 100 immunologists, infectious-disease researchers and virologists working on the coronavirus whether it could be eradicated. Almost 90% of respondents think that the coronavirus will become endemic — meaning that it will continue to circulate in pockets of the global population for years to come.\n\n“As long as there are people susceptible to COVID, COVID will spread,” said Dr. Anna Banerji, an infectious disease specialist at the University of Toronto. “It’s never going to go away.”\n\n“We’ve been told that this virus will disappear. But it will not,” Dr. William Schaffner, a professor at the Vanderbilt University School of Medicine, tells CBS News. “We need to control it. We need to diminish its impact. But it’s going to be around hassling us for the foreseeable future. And by that I mean — years.”\n\nA growing consensus of experts, including the WHO, predict the virus will keep existing as an endemic disease. Rather than the severe and unpredictable COVID-19 of today, endemics circulate within a particular population at a controlled rate, like the flu or chickenpox. Past pandemics like the Spanish Flu of 1918-1919 and the 2008 H1N1 outbreak have turned endemic.\n\nWhat Is an Endemic Disease?\n\nA pandemic turns endemic when a large portion of the population — the “herd” — achieves full or partial immunity through either infection or vaccination, stopping the disease from spreading like wildfire.\n\nWhile the virus hasn’t been around very long, early research shows protective antibodies in recovered COVID-19 patients last for up to eight months. In addition, immune cells are able to “remember the virus,” making them “capable of fighting potential new infections faster and better than the original cells.”\n\nThe faster the virus spreads, the quicker it transitions to a more mild, endemic state, said Jennie Lavine, postdoctoral fellow at Emory University in Atlanta and lead author on the Science study.\n\nHowever, allowing the virus to spread uncontrollably can cause high deaths and overwhelm hospitals in the short term. Ideally, most people avoid infection by following current health guidelines like wearing masks and social distancing until they can get the vaccine.\n\nMost people are first exposed to common cold coronaviruses at age three to five. After that point, people might get infected again, but they won’t get as sick. The study published in Science forecasts a similar outcome for COVID-19.\n\nLavine says it’s unlikely vaccines will provide “sterilizing immunity” — the kind needed to fully prevent infection — but they’ll reduce the severity of the disease, to the extent that once COVID-19 becomes endemic, getting it could actually be a good thing.\n\n“It seems fairly likely to me that at some point, and I can’t give you an exact time down the road, but when people have had enough exposure to (COVID-19), that getting (reinfected) won’t be a big deal and actually has the benefit of providing these sort of natural boosters,” Lavine said, which can be useful for both “generally keeping immunity up and for keeping your immune system up to date with whatever strains are circulating at that moment.”\n\n“Eradicating this virus right now from the world is a lot like trying to plan the construction of a stepping-stone pathway to the Moon. It’s unrealistic,” says Michael Osterholm, an epidemiologist at the University of Minnesota in Minneapolis.\n\nBut failure to eradicate the virus does not mean that death, illness or social isolation will continue on the scales seen so far.\n\nThe future will depend heavily on the type of immunity people acquire through infection or vaccination and how the virus evolves.\n\nInfluenza and human coronaviruses that cause common colds are also endemic: but a combination of annual vaccines and acquired immunity means that societies tolerate the seasonal deaths and illnesses they bring without requiring lockdowns, masks and social distancing.\n\nThe transition from pandemic to endemic will happen at different times in different places as infections and immunization rates vary, with a quarter of the world not expected to have access to a vaccine until 2022. The challenge now is to protect those most vulnerable to the virus, while we work toward reaching herd immunity.", "opengraph": {"description": "- As countries struggle to put an end to the pandemic, scientists say the virus will stick around as an endemic disease similar to the common cold. That’s", "title": "Covid-19 is here to stay as it becomes an endemic disease, experts predict", "article_publisher": "dailyhealthpost", "image": "https://dailyhealthpost.com/wp-content/uploads/2021/03/covid-endemic-transition-ft.jpg", "type": "article", "url": "https://dailyhealthpost.com/covid-19-is-here-to-stay-as-it-becomes-an-endemic-disease-experts-predict/", "site_name": "DailyHealthPost", "article:published_time": "2021-03-13T07:09:46-05:00", "article:modified_time": "2021-03-13T07:09:47-05:00", "updated_time": "2021-03-13T07:09:47-05:00", "locale": "en_US", "article:publisher": "https://www.facebook.com/DailyHealthPost/", "article:author": "https://www.facebook.com/DailyHealthPost", "article:section": "Wellness", "image:secure_url": "https://dailyhealthpost.com/wp-content/uploads/2021/03/covid-endemic-transition-ft.jpg", "image:width": "1200", "image:height": "630", "image:alt": "Covid-19 is here to stay as it becomes an endemic disease, experts predict", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://science.sciencemag.org/content/371/6530/741", "https://www.nature.com/articles/d41586-021-00396-2", "https://www.cbsnews.com/news/covid-19-endemic-disease-never-going-away/", "mailto:?subject=Covid-19%20is%20here%20to%20stay%20as%20it%20becomes%20an%20endemic%20disease%2C%20experts%20predict&body=As%20countries%20struggle%20to%20put%20an%20end%20to%20the%20pandemic%2C%20scientists%20say%20the%20virus%20will%20stick%20around%20as%20an%20endemic%0D%0A%0D%0ARead More Here: %20https%3A%2F%2Fdailyhealthpost.com%2Fcovid-19-is-here-to-stay-as-it-becomes-an-endemic-disease-experts-predict%2F%3Futm_source%3Demail%26utm_medium%3Dsocial%26utm_campaign%3DSocialWarfare", "https://share.flipboard.com/bookmarklet/popout?v=2&title=Covid-19+is+here+to+stay+as+it+becomes+an+endemic+disease%2C+experts+predict&url=https%3A%2F%2Fdailyhealthpost.com%2Fcovid-19-is-here-to-stay-as-it-becomes-an-endemic-disease-experts-predict%2F%3Futm_source%3Dflipboard%26utm_medium%3Dsocial%26utm_campaign%3DSocialWarfare", "https://api.whatsapp.com/send?text=https%3A%2F%2Fdailyhealthpost.com%2Fcovid-19-is-here-to-stay-as-it-becomes-an-endemic-disease-experts-predict%2F%3Futm_source%3Dwhatsapp%26utm_medium%3Dsocial%26utm_campaign%3DSocialWarfare", "https://dailyhealthpost.com/americans-gaining-weight-and-drinking-more-due-to-pandemic-stress/"], "authors": [], "publish_date": "2021-03-13T07:09:46-05:00"}