{"result_id": "090027", "URL": "https://dailyhealthpost.com/this-is-the-best-covid-fighting-food-according-to-science/", "timestamp": "2023-04-25 14:57:56 CEST+0200", "meta": {"description": "- To date, over 50 million Covid-19 vaccines1 have been administered in the U.S. Although the vaccine rollout is \"weeks ahead of schedule,\" according to", "lang": "en", "keywords": "", "favicon": "https://dailyhealthpost.com/wp-content/uploads/2018/06/cropped-logo_lg-32x32.png", "canonical": "https://dailyhealthpost.com/this-is-the-best-covid-fighting-food-according-to-science/", "encoding": "UTF-8"}, "image": null, "domain": "dailyhealthpost.com", "title": "This is the best COVID-fighting food according to science", "cleaned_text": "To date, over 50 million Covid-19 vaccines1 have been administered in the U.S. Although the vaccine rollout is “weeks ahead of schedule,” according to President Joe Biden2, we’re still a way from reaching herd immunity. Even with the FDA’s recent approval of Johnson’s & Johnson’s vaccine3, you still might not get your shot until months later. Besides following the public health guidelines established by the CDC4, what else can you do to protect yourself as you wait your turn? Better yet, what’s the best food you can eat today to strengthen your immune system against Covid-19?\n\nIt’s all about getting enough vitamin D\n\nLast year, over 200 international health, science and medical experts came together to send an open letter5 to world governments calling for increased vitamin D intake to combat Covid-19. And why wouldn’t they? Vitamin D modulates thousands of genes and many aspects of immune function, both innate and adaptive. But most people don’t get enough of it, especially during the winter.\n\nMushrooms are unique in that they are the only food in the produce aisle that contain vitamin D. According to one study published in the journal Food Science & Nutrition6, mushrooms may be the best source to get all the vitamin D that you need. The study also found that eating this common plant-based fungi resulted in the increase of several micronutrients while having minimal to zero impact on overall calories, sodium or saturated fat.\n\nOne serving of mushrooms is like taking a multivitamin\n\nDr. Victor L. Fulgoni III and Dr. Sanjiv Agarwal looked at the nutritional effect of adding 84-gram serving (⅔ cup) of mushrooms to a diet. The mushroom servings used in the study were a mix of white, crimini and portabella mushrooms at a 1:1:1 ratio. In addition, researchers also tested a scenario where mushrooms were exposed to UV-light before consumption and another scenario where only oyster mushrooms were added to the diet.\n\n“Simply adding an 84-gram serving, or what would be the equivalent of 5 medium white mushrooms, to USDA Food Patterns increased several shortfall nutrients including potassium as well as other B vitamins and minerals and had minimal to no impact on overall calories, sodium or saturated fat,” said Dr. Fulgoni.\n\nDepending on the pattern type and calorie level, key findings include:\n• The addition of a serving (84 g) of mushrooms to the diet resulted in an increase in potassium (8%-12%), copper (16%-26%), selenium (11%-23%), riboflavin (12%-18%) and niacin (11%-26%), but had no impact on calories, carbohydrate, fat or sodium.\n• The addition of a serving (84 g) of oyster mushrooms increased vitamin D (8%-11%) and choline (10%-16%).\n• Mushrooms exposed to UV-light to increase vitamin D levels to 200 IU/serving.\n• A mix of white, crimini and portabella mushrooms at a 1:1:1 ratio would be expected to add 2.24 mg ergothioneine and 3.53 mg glutathione, while oyster mushrooms would provide 24.0 mg ergothioneine and 12.3 mg glutathione.\n\nThe study found that when commonly consumed mushrooms are exposed to UV-light to provide 5 mcg of vitamin D per serving, vitamin D intake could meet and slightly exceed the Recommended Daily Value (RDA) for both the 9 -18 year and 19+ year groups.\n\nAccording to the USDA’s FoodData Central , one serving (5 medium/90g) of white, raw mushrooms contains 20 calories, 0g fat, 3g protein and is very low in sodium. Specifically, one serving of raw, UV-exposed, white (90g) and crimini (80g) mushrooms contains 23.6mcg (118% RDA) and 25.52mcg (128% RDA) of vitamin D, respectively.\n\nMushrooms are also rich in beta-glucans\n\nOne of the special components found from mushrooms is beta-glucan, which is predominantly found in its fiber. In many researches, beta-glucan effectively stimulates the host immune response to defend against bacterial, viral, fungal, or parasitic infections7. That’s why this food source is well-known in the scientific community for its immunomodulating capacities.\n\nWhile you’re waiting for your turn to get the vaccine, there’s no harm in adding a few servings of mushrooms to your diet. There are obviously other things you can do to boost your immune system, such as getting quality sleep, exercising, and keeping stress levels to a minimum. We just find adding mushrooms to your meals to be easier. Plus, you get all the benefits of getting adequate levels of vitamin D and that’s never a bad thing.", "opengraph": {"description": "- To date, over 50 million Covid-19 vaccines1 have been administered in the U.S. Although the vaccine rollout is \"weeks ahead of schedule,\" according to", "title": "This is the best COVID-fighting food according to science", "article_publisher": "dailyhealthpost", "image": "https://dailyhealthpost.com/wp-content/uploads/2021/02/mushroom-vitamin-d-covid-fighting-ft.jpg", "type": "article", "url": "https://dailyhealthpost.com/this-is-the-best-covid-fighting-food-according-to-science/", "site_name": "DailyHealthPost", "article:published_time": "2021-02-28T18:13:25-05:00", "article:modified_time": "2021-02-28T18:13:26-05:00", "updated_time": "2021-02-28T18:13:26-05:00", "locale": "en_US", "article:publisher": "https://www.facebook.com/DailyHealthPost/", "article:author": "https://www.facebook.com/DailyHealthPost", "article:section": "Wellness", "image:secure_url": "https://dailyhealthpost.com/wp-content/uploads/2021/02/mushroom-vitamin-d-covid-fighting-ft.jpg", "image:width": "1200", "image:height": "630", "image:alt": "This is the best COVID-fighting food according to science", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["mailto:?subject=This%20is%20the%20best%20COVID-fighting%20food%20according%20to%20science&body=To%20date%2C%20over%2050%20million%20Covid-19%20vaccines1%20have%20been%20administered%20in%20the%20U.S.%20Although%20the%20vaccine%20rollout%20is%20%22weeks%20ahead%0D%0A%0D%0ARead More Here: %20https%3A%2F%2Fdailyhealthpost.com%2Fthis-is-the-best-covid-fighting-food-according-to-science%2F%3Futm_source%3Demail%26utm_medium%3Dsocial%26utm_campaign%3DSocialWarfare", "https://share.flipboard.com/bookmarklet/popout?v=2&title=This+is+the+best+COVID-fighting+food+according+to+science&url=https%3A%2F%2Fdailyhealthpost.com%2Fthis-is-the-best-covid-fighting-food-according-to-science%2F%3Futm_source%3Dflipboard%26utm_medium%3Dsocial%26utm_campaign%3DSocialWarfare", "https://api.whatsapp.com/send?text=https%3A%2F%2Fdailyhealthpost.com%2Fthis-is-the-best-covid-fighting-food-according-to-science%2F%3Futm_source%3Dwhatsapp%26utm_medium%3Dsocial%26utm_campaign%3DSocialWarfare", "https://dailyhealthpost.com/covid-related-illness-robs-boy-of-all-four-limbs/"], "authors": [], "publish_date": "2021-02-28T18:13:25-05:00"}