{"result_id": "090025", "URL": "https://dailyhealthpost.com/griner-mother-covid-vaccine-video/", "timestamp": "2023-04-25 14:57:55 CEST+0200", "meta": {"description": "- Brant Griner of Lake Charles, Louisiana has posted a video of his 45-year-old mother on his Facebook account convulsing uncontrollably after receiving the", "lang": "en", "keywords": "", "favicon": "https://dailyhealthpost.com/wp-content/uploads/2018/06/cropped-logo_lg-32x32.png", "canonical": "https://dailyhealthpost.com/griner-mother-covid-vaccine-video/", "encoding": "UTF-8"}, "image": null, "domain": "dailyhealthpost.com", "title": "45-Year-Old Woman Experiences Uncontrollable Convulsions After Getting Covid-19 Vaccine", "cleaned_text": "Brant Griner of Lake Charles, Louisiana has posted a video of his 45-year-old mother on his Facebook account convulsing uncontrollably after receiving the experimental Pfizer COVID shot.\n\nThe woman didn’t experience any side-effects for several days after getting the jab until one day she woke up with a headache. On its own, this is a fairly minor and expected short-term side-effect. Unfortunately, things got worse rather quickly.\n\n“This is what the Pfizer covid19 vaccine has done to my Mom. Everyone please pray for her. She was admitted to the hospital. And be cautious about taking the vaccine. I’m sure it is good for some people but you need to think about is this vaccine worth taking? It’s not for me. Please share this post we need help finding answers,” Griner wrote on Facebook.\n\nMany initially speculated that the woman was faking her symptoms, that’s how strange and unusual her convulsions were, but Griner told RT that the side-effects were quite real and that his mother went back to the hospital to be tested for neurological and brain damage.\n\n“Mom is getting even worse today and I still don’t have any answers from doctors as to how to fix this. Please pray for her. I can’t stand to see my mom this way. It makes me want to cry. knowing I can’t do anything to help her. Please don’t take the covid19 vaccine,” Griner answered to those who accused his mother of “faking it”.\n\n“I’m not in any way shape or form an anti-vaxx person. My mom wasn’t – she was all for the vaccine before this happened,” he added. “I wanted it to be good. My mom wanted it to be good. That’s the reason she got it. Everybody wants their immunity. Everybody’s ready for Covid to go away.”\n\nGriner spoke to a reporter from Politifact for 30 minutes Jan. 15. He said his mom, 45, was eager to get a COVID-19 vaccine because she works at a medical clinic. Griner said she got the shot on Tuesday, Jan. 5, in New Orleans.\n\n“And on Friday is when she started having seizure-like sensations in her left leg,” Griner said in a phone interview. “By Saturday, she couldn’t hardly walk. And that’s when she got admitted to the hospital.”\n\nGriner said that after he posted the videos, he received feedback from many social media users, including some who he says have been harassing him and his mom.\n\nTo prevent critics from harassing the medical professionals involved in her treatment, Griner removed videos of his mom from his Facebook page.\n\nHe later texted a reporter: “My mom’s boss and (coworkers) are getting harassed and she has requested me to remove all the videos and not talk to anyone else about it.”\n\nWhat is causing the convulsions and are they permanent?\n\nThe latest update from Griner said that his mother’s doctors were still doing tests and nothing is certain. He told RT that doctors believe that metals from the vaccine could be responsible for the medical condition. However, that is only a speculation at this time.\n\nAnother theory is that this particular vaccine may have been faulty due to poor storage. Pfizer’s vaccine is notoriously difficult to store and transport properly because It has to be kept at extremely low temperatures at all times. It’s possible that poor storage conditions caused this one jab to “go bad.”\n\nAre there other similar cases?\n\nShort-lasting headaches are a fairly normal side-effect of most vaccines even though it’s unusual that Griner’s mother experienced her headaches such a long time after taking the jab. The convulsions, however, are a very rare symptom.\n\nThere was another similar case recently of a woman from Oakland City, Indiana. The woman named Shawn Skelton also posted a video of her having similar convulsions, although hers came after taking a Moderna vaccine instead. Her claims were also disputed as “probably faking it” and she too claims that she’s currently undergoing tests to determine the exact cause of the problem.\n\n“Doctors are trying to convince me this is a conversion disorder from stress! Am I stressed? Well who in this world doesn’t have stress. Is it coincidental that this happened after the vaccine? I guess anything is possible, but I know I’m a very happy, upbeat person that always has a smile. I would go out of my way to help anyone or just to make them smile! I’m the loud one that do the dumbest things just to make you laugh… And my life was normal before taking the vaccine on Monday! I am not anti vaccine as I have all mine, my kiddos have all of theirs! I’m just a normal person who’s life has been turned upside down and I’m left here to try and figure this out.”\n\nWhat does this mean for us and for the future of the Covid-19 vaccines?\n\nBoth of Griner’s and Skelton’s cases look very disheartening. And it was undeniable from the very beginning that these vaccines were not as well tested as other vaccines usually are. The normal developmental period of a vaccine is usually around 10 years and the fastest released vaccine previously took “only” 4 years.\n\nThe extreme circumstances around the Covid-19 pandemic forced the hands of many laboratories and governments. Considering the fast turn-around period, the Pfizer and Moderna vaccines seem to be made as well as possible and with minimal side-effects.\n\nDisturbing cases like those of Griner and Skelton are rare, if they are proven to be true.\n\nWe really can’t know as of now. All Covid-19 vaccines continue to be tested and every patient is monitored carefully so we can only hope that we’ll have more clarity soon. Until then, if you’re up for vaccination and you’re not sure what to do, the best course of action is to consult with your medical practitioner first and not make this decision alone.", "opengraph": {"description": "- Brant Griner of Lake Charles, Louisiana has posted a video of his 45-year-old mother on his Facebook account convulsing uncontrollably after receiving the", "title": "45-Year-Old Woman Experiences Uncontrollable Convulsions After Getting Covid-19 Vaccine", "article_publisher": "dailyhealthpost", "image": "https://dailyhealthpost.com/wp-content/uploads/2021/01/woman-convulsions-covid-ft.jpg", "type": "article", "url": "https://dailyhealthpost.com/griner-mother-covid-vaccine-video/", "site_name": "DailyHealthPost", "article:published_time": "2021-01-23T11:51:01-05:00", "article:modified_time": "2021-01-23T11:51:02-05:00", "updated_time": "2021-01-23T11:51:02-05:00", "locale": "en_US", "article:publisher": "https://www.facebook.com/DailyHealthPost/", "article:author": "https://www.facebook.com/DailyHealthPost", "article:section": "Wellness", "image:secure_url": "https://dailyhealthpost.com/wp-content/uploads/2021/01/woman-convulsions-covid-ft.jpg", "image:width": "1200", "image:height": "630", "image:alt": "45-Year-Old Woman Experiences Uncontrollable Convulsions After Getting Covid-19 Vaccine", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.facebook.com/RTnews/videos/womans-severe-reaction-to-pfizer-covid-vaccine-prompts-investigation/494406104874760/", "https://www.facebook.com/brant.griner.7", "https://dailyhealthpost.com/covid-19-vaccine-second-dose-may-trigger-additional-side-effects/", "https://www.rt.com/usa/512830-griner-mother-pfizer-vaccine-video/", "https://youtu.be/kf6NDIiE3Tw", "https://www.politifact.com/article/2021/jan/20/shaking-covid-vaccine-side-effect-videos-and-what-/?fbclid=IwAR1qi9z0AkPhAL2ZYtDHDPsYOW_07_Fw_HIyAPPp2oU-bDfGxgXAVbkxuMI", "https://www.pfizer.com/news/hot-topics/covid_19_vaccine_u_s_distribution_fact_sheet", "https://www.youtube.com/watch?v=AWuj0UwCrrQ", "mailto:?subject=45-Year-Old%20Woman%20Experiences%20Uncontrollable%20Convulsions%20After%20Getting%20Covid-19%20Vaccine&body=Brant%20Griner%20of%20Lake%20Charles%2C%20Louisiana%20has%20posted%20a%20video%20of%20his%2045-year-old%20mother%20on%20his%C2%A0Facebook%20account%C2%A0convulsing%20uncontrollably%20after%20receiving%0D%0A%0D%0ARead More Here: %20https%3A%2F%2Fdailyhealthpost.com%2Fgriner-mother-covid-vaccine-video%2F%3Futm_source%3Demail%26utm_medium%3Dsocial%26utm_campaign%3DSocialWarfare", "https://share.flipboard.com/bookmarklet/popout?v=2&title=45-Year-Old+Woman+Experiences+Uncontrollable+Convulsions+After+Getting+Covid-19+Vaccine&url=https%3A%2F%2Fdailyhealthpost.com%2Fgriner-mother-covid-vaccine-video%2F%3Futm_source%3Dflipboard%26utm_medium%3Dsocial%26utm_campaign%3DSocialWarfare", "whatsapp://send?text=https%3A%2F%2Fdailyhealthpost.com%2Fgriner-mother-covid-vaccine-video%2F%3Futm_source%3Dwhatsapp%26utm_medium%3Dsocial%26utm_campaign%3DSocialWarfare", "https://dailyhealthpost.com/daycares-finland-forest-floor-childrens-immune-systems/"], "authors": [], "publish_date": "2021-01-23T11:51:01-05:00"}