{"result_id": "090007", "URL": "https://dailyhealthpost.com/leaked-documents-reveal-quality-issue-with-some-covid-19-vaccines/", "timestamp": "2023-04-25 14:57:36 CEST+0200", "meta": {"description": "- Findings highlight the fragilities of the manufacturing process, but companies aren't willing to release information.", "lang": "en", "keywords": "", "favicon": "https://dailyhealthpost.com/wp-content/uploads/2018/06/cropped-logo_lg-32x32.png", "canonical": "https://dailyhealthpost.com/leaked-documents-reveal-quality-issue-with-some-covid-19-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "dailyhealthpost.com", "title": "Leaked documents reveal quality issue with some Covid-19 vaccines", "cleaned_text": "Findings highlight the fragilities of the manufacturing process, but companies aren’t willing to release information.\n\nDocuments leaked from the European Medicines Agency (EMA) following a cyber attack in December show that some early commercial batches of Pfizer-BioNTech’s covid-19 vaccine had lower than expected levels of intact mRNA molecules.\n\nThese molecules instruct our cells to make a harmless piece of coronavirus protein, triggering an immune response and protecting us from infection if the real virus enters our bodies.\n\nThe complete, intact mRNA molecule is essential to the potency of the vaccine.\n\nBut in a special report for The BMJ, journalist Serena Tinari shows that the EMA was concerned about the difference in quality between clinical batches and proposed commercial batches of Pfizer-BioNTech vaccine.\n\nSpecifically, EMA had major concerns over unexpectedly low quantities (around 55%) of intact mRNA in batches of the vaccine developed for commercial production.\n\nIt is an issue relevant not just to Pfizer-BioNTech’s vaccine but also to those produced by Moderna, CureVac, and others, as well as a “second generation” mRNA vaccine being pursued by Imperial College London.\n\nIn an email dated 23 November, a high ranking EMA official outlined a raft of issues. In short, commercial manufacturing was not producing vaccines to the specifications expected, and regulators were unsure of the implications on safety and efficacy.\n\nEMA responded by filing two “major objections” with Pfizer, along with a host of other questions it wanted addressed.\n\nUltimately, on 21 December, EMA authorised Pfizer-BioNTech’s vaccine and a report published on its website, noted, “the quality of this medicinal product, submitted in the emergency context of the current (covid-19) pandemic, is considered to be sufficiently consistent and acceptable.”\n\nHowever, it’s unclear how the agency’s concerns were satisfied, writes Tinari.\n\nThe BMJ asked Pfizer, Moderna, and CureVac, as well as several regulators, what percentage mRNA integrity they consider acceptable for vaccines against covid-19.\n\nNone offered any specifics, and in subsequent correspondence, EMA, US Food and Drug Administration (FDA), and Canadian medicines regulator Health Canada all stated that specific information related to the acceptability criteria is confidential.\n\nPfizer also declined to comment on what percentage mRNA integrity it is aiming for, nor would it address questions about the cause of the unexpectedly low percentage mRNA integrity in certain batches, leaving open the question of whether it could happen again.\n\nModerna declined to respond to any of The BMJ’s questions, while CureVac told The BMJ that “it is too soon to give details.”\n\nThe shortage of information may reflect the lack of certainty, even among regulators, about how to assess the evidence fully for this novel technology, suggests Tinari.\n\nProfessor of biopharmaceutics, Daan J.A. Crommelin, told The BMJ that, “For small, low molecular weight products, the active pharmaceutical ingredient integrity is typically close to 100%.”\n\nBut for mRNA vaccines? “Experience with mRNA integrity is limited.”", "opengraph": {"description": "- Findings highlight the fragilities of the manufacturing process, but companies aren't willing to release information.", "title": "Leaked documents reveal quality issue with some Covid-19 vaccines", "article_publisher": "dailyhealthpost", "image": "https://dailyhealthpost.com/wp-content/uploads/2021/03/leaked-documents-covid-vaccine-ft.jpg", "type": "article", "url": "https://dailyhealthpost.com/leaked-documents-reveal-quality-issue-with-some-covid-19-vaccines/", "site_name": "DailyHealthPost", "article:published_time": "2021-03-11T18:25:54-05:00", "article:modified_time": "2021-03-11T18:25:54-05:00", "updated_time": "2021-03-11T18:25:54-05:00", "locale": "en_US", "article:publisher": "https://www.facebook.com/DailyHealthPost/", "article:author": "https://www.facebook.com/DailyHealthPost", "article:section": "Wellness", "image:secure_url": "https://dailyhealthpost.com/wp-content/uploads/2021/03/leaked-documents-covid-vaccine-ft.jpg", "image:width": "1200", "image:height": "630", "image:alt": "Leaked documents reveal quality issue with some Covid-19 vaccines", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.bmj.com/content/372/bmj.n627", "mailto:?subject=Leaked%20documents%20reveal%20quality%20issue%20with%20some%20Covid-19%20vaccines&body=Findings%20highlight%20the%20fragilities%20of%20the%20manufacturing%20process%2C%20but%20companies%20aren%27t%20willing%20to%20release%20information.%20Documents%20leaked%20from%20the%20European%0D%0A%0D%0ARead More Here: %20https%3A%2F%2Fdailyhealthpost.com%2Fleaked-documents-reveal-quality-issue-with-some-covid-19-vaccines%2F%3Futm_source%3Demail%26utm_medium%3Dsocial%26utm_campaign%3DSocialWarfare", "https://share.flipboard.com/bookmarklet/popout?v=2&title=Leaked+documents+reveal+quality+issue+with+some+Covid-19+vaccines&url=https%3A%2F%2Fdailyhealthpost.com%2Fleaked-documents-reveal-quality-issue-with-some-covid-19-vaccines%2F%3Futm_source%3Dflipboard%26utm_medium%3Dsocial%26utm_campaign%3DSocialWarfare", "https://api.whatsapp.com/send?text=https%3A%2F%2Fdailyhealthpost.com%2Fleaked-documents-reveal-quality-issue-with-some-covid-19-vaccines%2F%3Futm_source%3Dwhatsapp%26utm_medium%3Dsocial%26utm_campaign%3DSocialWarfare", "https://dailyhealthpost.com/64-of-covid-hospitalizations-linked-to-four-conditions/"], "authors": [], "publish_date": "2021-03-11T18:25:54-05:00"}