{"result_id": "090008", "URL": "https://dailyhealthpost.com/this-oral-tablet-for-covid-19-could-allow-people-to-self-vaccinate-at-home/", "timestamp": "2023-04-25 14:57:37 CEST+0200", "meta": {"description": "- Vaccination efforts in the US have been going well since the start of the Biden administration but increasing concerns about new Covid-19 mutations raise", "lang": "en", "keywords": "", "favicon": "https://dailyhealthpost.com/wp-content/uploads/2018/06/cropped-logo_lg-32x32.png", "canonical": "https://dailyhealthpost.com/this-oral-tablet-for-covid-19-could-allow-people-to-self-vaccinate-at-home/", "encoding": "UTF-8"}, "image": null, "domain": "dailyhealthpost.com", "title": "This oral tablet for Covid-19 could allow people to self-vaccinate at home", "cleaned_text": "Vaccination efforts in the US have been going well since the start of the Biden administration but increasing concerns about new Covid-19 mutations raise the question of the need for repeated, annual or seasonal vaccines down the line. So, the news that an oral Covid-19 vaccine is being developed should bring us hope.\n\nOramed Pharmaceuticals Inc. is an Israeli-American pharmaceutical company and it’s been preparing to launch a Phase-I clinical trial for an oral Covid-19 vaccine. Based on technology developed by Hadassah-University Medical Center, the company has initiated a joint venture with Premas Biotech to develop the vaccine.\n\nIt’s Oramed’s technology that makes this endeavor possible as it enables the administration of many protein-based therapies that would otherwise require injections. In fact, the company is currently in a Phase III clinical trial with the US Food and Drug Administration for an oral insulin capsule for type I and II diabetics.\n\nAccording to Oramed’s CEO Nadav Kidron emphasize that this is about more than Covid-19 and that Oramed’s technology can help revolutionize the marketplace.\n\n“An oral COVID-19 vaccine would eliminate several barriers to rapid, wide-scale distribution, potentially enabling people to take the vaccine themselves at home,” Kidron said.\n\n“While ease of administration is critical today to accelerate inoculation rates, an oral vaccine could become even more valuable in the case that a COVID-19 vaccine may be recommended annually like the standard flu shot.”\n\nThe company has already completed the pilot animal study and the conclusion is that the vaccine promotes the development of Immunoglobulin G (IgG) antibodies and Immunoglobulin A (IgA), both of which are necessary for a long-term immunity against Covid-19.\n\nKidron also insists that their vaccine will be more effective than the ones currently on the market as it targets three separate Covid-19 proteins at the same time rather than just focusing on the single spike protein all other Covid-19 vaccines focus on. That’s why “this vaccine should be much more resistant to COVID-19 variants,” Kidron claimed.\n\nThe counter-argument is that there is a reason why other vaccines are focusing on that one spike protein – it’s unique to Covid-19 and it’s present in all its mutations. Focusing on any other protein brings the risk of this vaccine not being effective against possible future mutations of the virus. Oramed wouldn’t necessarily mind this, of course, as the very point of an oral vaccine is that it is easy to modulate and re-administer.\n\nNevertheless, the Oramed vaccine has other benefits too – it’s yeast-based, for example, which makes it much cheaper to produce than any of its already-approved competitors. It can also be shipped in standard refrigerator temperatures and stored at room temperatures which reduces the risk of improper storage leading to spoiling.\n\nBut the biggest advantage of an oral vaccine is that it requires no professional administration.\n\nKidron added that Oramed is currently applying for trials in multiple countries, including the US, Mexico, Europe, and Israel. The company is also targeting Africa where it’s absolutely essential that an easy administration method is found as soon as possible. Kidron is hopeful that a Phase I human trial data can be available within the next three months.", "opengraph": {"description": "- Vaccination efforts in the US have been going well since the start of the Biden administration but increasing concerns about new Covid-19 mutations raise", "title": "This oral tablet for Covid-19 could allow people to self-vaccinate at home", "article_publisher": "dailyhealthpost", "image": "https://dailyhealthpost.com/wp-content/uploads/2021/03/covid-oral-tablet-self-vaccinate-ft.jpg", "type": "article", "url": "https://dailyhealthpost.com/this-oral-tablet-for-covid-19-could-allow-people-to-self-vaccinate-at-home/", "site_name": "DailyHealthPost", "article:published_time": "2021-03-22T19:14:09-04:00", "article:modified_time": "2021-09-01T15:20:11-04:00", "updated_time": "2021-09-01T15:20:11-04:00", "locale": "en_US", "article:publisher": "https://www.facebook.com/DailyHealthPost/", "article:author": "https://www.facebook.com/DailyHealthPost", "article:tag": "Restrict Ads", "article:section": "Wellness", "image:secure_url": "https://dailyhealthpost.com/wp-content/uploads/2021/03/covid-oral-tablet-self-vaccinate-ft.jpg", "image:width": "1200", "image:height": "630", "image:alt": "This oral tablet for Covid-19 could allow people to self-vaccinate at home", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.oramed.com/oramed-initiates-phase-3-trial-of-oral-insulin/", "mailto:?subject=This%20oral%20vaccine%20for%20Covid-19%20could%20allow%20people%20to%20self%20vaccinate%20at%20home&body=Vaccination%20efforts%20in%20the%20US%20have%20been%20going%20well%20since%20the%20start%20of%20the%20Biden%20administration%20but%20increasing%20concerns%20about%0D%0A%0D%0ARead More Here: %20https%3A%2F%2Fdailyhealthpost.com%2Fthis-oral-tablet-for-covid-19-could-allow-people-to-self-vaccinate-at-home%2F%3Futm_source%3Demail%26utm_medium%3Dsocial%26utm_campaign%3DSocialWarfare", "https://share.flipboard.com/bookmarklet/popout?v=2&title=This+oral+vaccine+for+Covid-19+could+allow+people+to+self+vaccinate+at+home&url=https%3A%2F%2Fdailyhealthpost.com%2Fthis-oral-tablet-for-covid-19-could-allow-people-to-self-vaccinate-at-home%2F%3Futm_source%3Dflipboard%26utm_medium%3Dsocial%26utm_campaign%3DSocialWarfare", "whatsapp://send?text=https%3A%2F%2Fdailyhealthpost.com%2Fthis-oral-tablet-for-covid-19-could-allow-people-to-self-vaccinate-at-home%2F%3Futm_source%3Dwhatsapp%26utm_medium%3Dsocial%26utm_campaign%3DSocialWarfare", "https://dailyhealthpost.com/centenarian-who-survived-two-pandemics-gets-fully-vaccinated-against-covid-19/"], "authors": [], "publish_date": "2021-03-22T19:14:09-04:00"}