{"result_id": "090009", "URL": "https://dailyhealthpost.com/36-people-develop-rare-blood-disorder-after-receiving-covid-vaccines/", "timestamp": "2023-04-25 14:57:37 CEST+0200", "meta": {"description": "- Most common side effects from COVID-19 vaccines are deemed harmless by medical experts in the field. But for some people that may not be the case. At least", "lang": "en", "keywords": "", "favicon": "https://dailyhealthpost.com/wp-content/uploads/2018/06/cropped-logo_lg-32x32.png", "canonical": "https://dailyhealthpost.com/36-people-develop-rare-blood-disorder-after-receiving-covid-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "dailyhealthpost.com", "title": "36 People Develop Rare Blood Disorder After Receiving COVID Vaccines", "cleaned_text": "Most common side effects from COVID-19 vaccines are deemed harmless by medical experts in the field. But for some people that may not be the case. At least 36 people may have developed a rare blood disorder, known as immune thrombocytopenia (ITP), after taking either Pfizer and BioNTech or Moderna’s COVID-19 vaccines, according to a report.\n\nITP develops when the immune system attacks the body’s own supply of platelets or the cells that create them for unknown reasons. Platelets are a blood component essential for clotting. When you cut yourself by accident, this is what your body uses to stop you from bleeding to death.\n\nAccording to The New York Times, the cases were reported to VAERS, the government’s Vaccine Adverse Event Reporting System. Although no cases of ITP were reported during clinical trials of either Moderna’s or Pfizer’s vaccines, the recent reports show a plausible cause for concern.\n\nA Pfizer spokesperson told FOX News it is “aware of cases of thrombocytopenia in recipients of our COVID-19 vaccine” and takes reports of adverse events “very seriously.”\n\n“We are collecting relevant information to share with the FDA. However, at this time, we have not been able to establish a causal association with our vaccine,” the spokesperson added. “To date, millions of people have been vaccinated and we are closely monitoring all adverse events in individuals receiving our vaccine. Serious adverse events, including deaths that are unrelated to the vaccine, are unfortunately likely to occur at a similar rate as they would in the general population.”\n\nRepresentatives for Moderna, the FDA and the CDC did not comment on the situation.\n\nOne of the individuals affected by ITP was 56-year-old Dr. Gregory Smith, an obstetrician from Miami Beach whose symptoms appeared three days after he received the Pfizer-BioNTech vaccine.\n\nSmith’s wife, Heidi Neckelmann, disclosed in a Facebook post that he entered the emergency room with a platelet count of zero and that he was immediately admitted to the intensive care unit with a diagnosis of “acute ITP caused by a reaction to the COVID vaccine.”\n\nImmune thrombocytopenia is usually treated by platelet transfusions, with steroids and immune globulins – a treatment meant to prevent the spleen from further destroying platelets. However, Neckelmann said the treatments failed to restore Smith’s platelet levels and, after two weeks in the hospital, he died from a brain hemorrhage.\n\n“He was a very healthy 56 year old, loved by everyone in the community, delivered hundreds of healthy babies and worked tireless through the pandemic,” Neckelman added. “He was a pro vaccine advocate that is why he got it himself. I believe that people should be aware that side effects can happen [sic], that it is not good for everyone and in this case destroyed a beautiful life, a perfect family, and has affected so many people in the community. Do not let his death be in vain please save more lives by making this information news.”\n\nWaking Up With Bruises On Her Arms and Legs\n\nThe New York Times reported that 72-year old Luz Legaspi was hospitalized after waking up with bruises on her arms and legs and blisters that bled inside her mouth. And all this happened just one day after receiving her first dose of Moderna’s COVID-19 vaccine.\n\nAt the time, Legaspi’s platelet count was zero and doctors reportedly ordered her to not leave her bed for over a week, citing fears that a bump, bruise, fall or other minor injury could lead to a fatal hemorrhage. After 10 days of platelet treatments in the hospital, Legaspi was not showing any signs of improvement.\n\n“I don’t think she understands she’s like a ticking bomb,” Legaspi’s daughter, who did not reveal her name upon her employer’s request, told the Times. “I don’t use the term. I don’t want to tell her that.”\n\nHowever, Dr. James Bussel, a pediatrician and expert in immune thrombocytopenia, reportedly heard about her condition and called Legaspi’s doctor and offered to consult on her care. Within a few days, Legaspi’s platelet count slowly recovered. Going from 6,000 to 40,000 took her out of the highest danger zone. Once her platelet count was over 70,000, she was able to return home.\n\nThese cases are not a reason to avoid Covid vaccination, doctors say. The risk of serious illness from the coronavirus is much greater than the risk of developing this rare condition, and the vaccines are vital to keeping the pandemic under control.\n\nMs. Legaspi’s daughter said the last thing that she and her mother wanted to do was create fear of the Covid vaccines. Both women still believe strongly in the need for them, despite Ms. Legaspi’s illness, her daughter said.\n\nBussel and his colleague Dr. Eun-Ju Lee recently studied 15 cases of thrombocytopenia that developed after people got COVID-19 vaccines. The study, which has been submitted to a medical journal and is currently under review for publication, provides information about treatments and urges doctors to report cases, according to the NYTimes. In addition, the study reportedly notes that it is too soon to tell whether the affected patients will have lasting recoveries, or recurrences of the platelet problem.\n\n“I think it is possible that there is an association,” said Dr. James Bussel, a hematologist and professor emeritus at Weill Cornell Medicine who has written more than 300 scientific articles on the platelet disorder. “I’m assuming there’s something that made the people who developed thrombocytopenia susceptible, given what a tiny percentage of recipients they are.”\n\nPeople can have low platelets without symptoms, and it is possible that in some, a vaccine reaction could drop the level further, to a point where it becomes apparent by causing bruises or bleeding, Dr. Bussel said. “Why it happens, we don’t know.”\n\nDr. Bussel said it was important to share information about the cases, because severe thrombocytopenia can be serious, and physicians need to know how to treat it. Sometimes the condition resists standard therapies, and if very low platelet counts persist, the patient faces an increasing risk of severe bleeding and even brain hemorrhage.\n\nHealth experts from the American Society of Hematology, including Dr. Bussel recommends ITP patients consult with their hematologists before getting inoculated with COVID-19 vaccines.", "opengraph": {"description": "- Most common side effects from COVID-19 vaccines are deemed harmless by medical experts in the field. But for some people that may not be the case. At least", "title": "36 People Develop Rare Blood Disorder After Receiving COVID Vaccines", "article_publisher": "dailyhealthpost", "image": "https://dailyhealthpost.com/wp-content/uploads/2021/02/rare-blood-disorder-covid-vaccine-ft.jpg", "type": "article", "url": "https://dailyhealthpost.com/36-people-develop-rare-blood-disorder-after-receiving-covid-vaccines/", "site_name": "DailyHealthPost", "article:published_time": "2021-02-10T09:12:02-05:00", "article:modified_time": "2021-02-10T09:12:03-05:00", "updated_time": "2021-02-10T09:12:03-05:00", "locale": "en_US", "article:publisher": "https://www.facebook.com/DailyHealthPost/", "article:author": "https://www.facebook.com/DailyHealthPost", "article:section": "Wellness", "image:secure_url": "https://dailyhealthpost.com/wp-content/uploads/2021/02/rare-blood-disorder-covid-vaccine-ft.jpg", "image:width": "1200", "image:height": "630", "image:alt": "36 People Develop Rare Blood Disorder After Receiving COVID Vaccines", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.nytimes.com/2021/02/08/health/immune-thrombocytopenia-covid-vaccine-blood.html", "https://vaers.hhs.gov/data.html", "https://www.foxnews.com/us/coronavirus-vaccination-may-be-cause-of-rare-blood-disorder-in-at-least-36-people-report", "https://www.facebook.com/heidi.neckelmann/posts/10157817790183977", "https://www.hematology.org/covid-19/covid-19-and-itp", "mailto:?subject=36%20People%20Develop%20Rare%20Blood%20Disorder%20After%20Receiving%20COVID%20Vaccines&body=Most%20common%20side%20effects%20from%20COVID-19%20vaccines%20are%20deemed%20harmless%20by%20medical%20experts%20in%20the%20field.%20But%20for%20some%20people%0D%0A%0D%0ARead More Here: %20https%3A%2F%2Fdailyhealthpost.com%2F36-people-develop-rare-blood-disorder-after-receiving-covid-vaccines%2F%3Futm_source%3Demail%26utm_medium%3Dsocial%26utm_campaign%3DSocialWarfare", "https://share.flipboard.com/bookmarklet/popout?v=2&title=36+People+Develop+Rare+Blood+Disorder+After+Receiving+COVID+Vaccines&url=https%3A%2F%2Fdailyhealthpost.com%2F36-people-develop-rare-blood-disorder-after-receiving-covid-vaccines%2F%3Futm_source%3Dflipboard%26utm_medium%3Dsocial%26utm_campaign%3DSocialWarfare", "whatsapp://send?text=https%3A%2F%2Fdailyhealthpost.com%2F36-people-develop-rare-blood-disorder-after-receiving-covid-vaccines%2F%3Futm_source%3Dwhatsapp%26utm_medium%3Dsocial%26utm_campaign%3DSocialWarfare", "https://dailyhealthpost.com/this-new-oral-drug-stops-coronavirus-replication-and-prevents-infection/"], "authors": [], "publish_date": "2021-02-10T09:12:02-05:00"}