{"result_id": "090029", "URL": "https://dailyhealthpost.com/centrum-multivitamin/", "timestamp": "2023-04-25 14:57:57 CEST+0200", "meta": {"description": "If you have a Centrum multivitamin bottle in your cupboard, you'll want to get rid of it immediately. The vitamins synthetic, and harmful too!", "lang": "en", "keywords": "", "favicon": "https://dailyhealthpost.com/wp-content/uploads/2018/06/cropped-logo_lg-32x32.png", "canonical": "https://dailyhealthpost.com/centrum-multivitamin/", "encoding": "UTF-8"}, "image": null, "domain": "dailyhealthpost.com", "title": "World’s Most Popular Multivitamin Is Useless And Contains Toxic Chemicals And Artificial Colors", "cleaned_text": "“That which we call a rose by any other name would smell as sweet.”\n\nWhile this may be true for roses and Shakespeare, when it comes to multivitamins, name and quality are not intrinsically linked.\n\nIn fact, there is a huge difference in quality among the numerous commercial multivitamins, even those manufactured by supposedly reputable companies.\n\nThe American-based multinational pharmaceutical corporation, Pfizer Pharmaceuticals, makes one of the most widely marketed multivitamins in the world. This behemoth $220-billion manufacturer is actually one of the world’s largest drug companies, which is not surprising considering it has an astounding 43 percent profit margin according to Tharawat Magazine (1,2) .\n\nPfizer’s Centrum brand, which itself has upwards of 20 different targeted vitamin lines, including children’s vitamins, that are touted as being “complete” multivitamins. (3) This, of course, implies that by taking this one pill, you will get all of the vitamins and minerals your body requires.\n\nWhile this would be wonderful if it were actually true, the fact is, Centrum multivitamins not only contain inferior quality ingredients but as an added bonus, you also get a number of fillers and chemicals you didn’t bargain for.\n\nBy definition vitamins are “any of various organic substances that are essential in minute quantities to the nutrition of most animals and some plants, act especially as coenzymes and precursors of coenzymes in the regulation of metabolic processes but do not provide energy or serve as building units, and are present in natural foodstuffs or sometimes produced within the body.” (4)\n\nThere are several key words here, but “foodstuffs” stands out because in a perfect world, multivitamins would not even be necessary. We would be able to get all of the vitamins and minerals we need from the food we eat.\n\nBut not only is the food we grow today no longer as rich in the nutrients we need as it was even a few decades ago (5), much of it is now also genetically modified, which creates an entirely new set of problems (6). As a result, people need to supplement these missing nutrients somehow, which has essentially opened the floodgates for inferior “vitamin” companies that are looking to pad their pockets at your expense.\n\nWhile not all supplement companies are obviously “bad,” you have to question a vitamin line made by a pharmaceutical giant like Pfizer that has built its wealth on supplying the world with countless prescription drugs and vaccines.\n\nIt doesn’t take a genius to see that getting people healthy is simply not in Pfizer’s best interest.\n\nWhat’s Really in Your Multivitamin?\n\nThe first thing you need to know about vitamins is that there are two kinds—whole food and synthetic.\n\nAs the name suggests, whole food vitamins are made from concentrated whole foods. This means the vitamins in these supplements are the original, highly complex structure that includes enzymes, coenzymes, antioxidants, trace elements and their activators that work synergistically to enable the vitamin to work.\n\nSynthetic vitamins are not natural. They are made from isolated or synthetic nutrients.\n\nUnlike whole vitamins, because synthetics are made from isolated parts of the original vitamin, they simply don’t work as they should, and in many cases, studies even show that your body doesn’t even recognize these “vitamins” and thus treats them like any other foreign substance.\n\nThis is especially true for fat soluble vitamins like vitamins A, D, E and K. Synthetic forms of these vitamins are particularly dangerous because they ultimately build up in your fatty tissues, becoming toxic. When you take synthetic vitamins, you actually get a higher concentration of that altered vitamin compared to whole vitamins, which also work synergistically (7).\n\nHere are some of the synthetic vitamins forms to watch out for (8):\n\nNOTE: The “dl” form of any vitamin is synthetic.\n\nHere is a general list of Centrum’s ingredients as per their website, including the “dark side” of these ingredients that Pfizer does not mention.\n\nWhile there is no disputing Centrum multivitamins contain various minerals and vitamins, the real question is… what kind and what quality?\n\nAs you learned above, vitamins can come in either a whole food form or as a synthetic. Centrum’s ingredients are synthetic. The other issue is that various minerals also come in a variety of forms.\n\nA good example is magnesium, which can be an oxide, taurate, malate, sulfate, citrate, glyconate or glutamate (which is actually a component of the artificial sweetener, aspartame, proven to be unsafe) just to name a few of its forms (9).\n\nCentrum vitamins contain magnesium oxide, the most common form of magnesium used in inferior commercial vitamins. It is non-chelated and thus very hard for your body to absorb compared to some of the other forms of magnesium. In fact, magnesium oxide has an absorbability rate as low as 4 percent, according to some studies (10).\n\nHere are 5 more inferior vitamins and minerals in Centrum:\n• Calcium Carbonate—there are essentially 8 forms of calcium. Calcium carbonate, the form in Centrum multivitamins, is the cheapest and least bioavailable form of calcium. As with magnesium oxide, only a fraction of this mineral is absorbed by your body (11).\n• Ferrous Fumarate—Too much iron, especially iron that does not come from natural food sources, can be downright dangerous. Many foods contain good sources of iron, so even if you are not eating properly, you will get some iron, so when a multivitamin adds a source such as the ferrous fumarate found in Centrum, you are automatically exposed to too much iron. A 2013 report from the Physicians Committee states, “Centrum Adults Under 50 contains more than twice the RDA of iron for men and 100 percent of the RDA for women.” (12). They conclude, “Manufacturers should reformulate multivitamins to remove these metals that may be linked to Alzheimer’s risk.”\n• Vitamin E (DL-Alpha Tocopherol)—this synthetic form a vitamin E is linked to increased prostate cancer risk and other diseases (13, 14). As well, researchers at Oregon State University show that your body excretes this synthetic form three times faster than natural sources (15). Natural vitamin E is listed as d-alpha tocopherol, d-alpha tocopheryl acetate, or d-alpha tocopheryl succinate.\n• Magnesium stearate —a common component in many vitamins used to help speed the manufacturing process bypreventing other ingredients from sticking to the mechanical equipment. A Japanese study found that magnesium stearate is actually a formaldehyde-causing agent (16). Another study published in the journal Immunology shows how steric acid, a component in magnesium stearate, inhibits T cells function (immune response cells) (17).\n• Corn Starch—a binder with no real benefits, most likely made fromgenetically modified corn, which has numerous negative effects. It is specifically harmful to all of your organs designed to detox your body such as your liver, kidneys, heart, adrenal glands and spleen (18). Unless a product specifically states NON-GMO, any corn or soy components are almost certainly GMO.\n• BHT— Butylated hydroxyanisole is a chemical preservative linked to liver, thyroid, lung, and kidney toxicity and it is also shown to affect blood coagulation and promote tumors among other things (19). In an extensive multivitamin quality test by LabDoor, BHT was used exclusively over natural preservatives in 5 out of 6 Centrum products (20).\n• Gelatin –Centrum states its gelatin sources are from “bovine and poultry,”” which makes them unfit for vegetarians and vegans (21).\n• Soybean Oil —another GMO product that is also hydrogenated, a process firmly linked to cancer, heart disease and any number of other diseases (22).\n• Sodium Benzoate—”Sodium benzoate has the ability to deprive the cells of oxygen, break down the immune system, and cause cancer.” (23). Enough said.\n• Sodium Aluminosilicate—a common food additive used to prevent dry foods from “clumping, forming semi-solid or solid lumps.” It contributes to kidney failure and cancer according to many studies (24).\n\nCentrum vitamins contain the artificial coloring agent FD&C Yellow Aluminum Lake No. 6, which is actually derived from coal tar and is linked to chromosomal aberrations and increased incidence of cancer (25, 26, 27).\n\nStay away from Centrum and other cheap multivitamins. Eat organic food when you can and if you must take supplements, look for whole food vitamins. New evidence even suggests that taking synthetic multivitamins not only provides you little benefit, but they can even be harmful.", "opengraph": {"description": "Most of the vitamins you buy in stores are useless and unhealthy!", "title": "World’s Most Popular Multivitamin Is Useless And Contains Toxic Chemicals And Artificial Colors", "article_publisher": "dailyhealthpost", "image": "https://dailyhealthpost.com/wp-content/uploads/2016/11/centrum-multivitamin.jpg", "type": "article", "url": "https://dailyhealthpost.com/centrum-multivitamin/", "site_name": "DailyHealthPost", "article:published_time": "2016-11-11T01:15:04-05:00", "article:modified_time": "2017-09-02T14:22:11-04:00", "updated_time": "2017-09-02T14:22:11-04:00", "locale": "en_US", "article:publisher": "https://www.facebook.com/DailyHealthPost/", "article:author": "https://www.facebook.com/DailyHealthPost", "article:tag": "news", "article:section": "Healthy Lifestyle", "image:secure_url": "https://dailyhealthpost.com/wp-content/uploads/2016/11/centrum-multivitamin.jpg", "image:width": "1200", "image:height": "630", "image:alt": "centrum multivitamin", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://dailyhealthpost.com/the-truth-about-multivitamins-vs-food-based-vitamins/", "https://dailyhealthpost.com/bayer-monsanto/", "https://www.celebritynetworth123.com/richest-businessmen/pfizer-net-worth/", "https://www.tharawat-magazine.com/facts/10-largest-pharmaceutical-drug-companies-world/#gs.9A4gH4c", "https://dailyhealthpost.com/top-pharma-brand-of-childrens-vitamins-not-so-healthy-after-all/", "https://www.centrum.com/centrum-vitamints?flavor=group", "https://dailyhealthpost.com/ensure-hospital-food/", "https://www.merriam-webster.com/dictionary/vitamin", "https://hortsci.ashspublications.org/content/44/1/15.full.pdf+html?ijkey=RfqpDkPqP6D3rR", "https://www.geneticliteracyproject.org/2015/11/13/10-studies-proving-gmos-are-harmful-not-if-science-matters/", "https://dailyhealthpost.com/chinese-face-map/", "https://draxe.com/food-based-vs-synthetic-vitamins/", "https://www.globalhealingcenter.com/natural-health/synthetic-vs-natural-vitamins/#1", "https://dailyhealthpost.com/replace-synthetic-folic-acid-fortification-programs-natural-folates/", "https://dailyhealthpost.com/low-magnesium-levels/", "https://www.naturalnews.com/046401_magnesium_dietary_supplements_nutrient_absorption.html", "https://www.ncbi.nlm.nih.gov/pubmed/11794633", "https://www.globalhealingcenter.com/natural-health/types-of-calcium-supplements/", "https://dailyhealthpost.com/low-iron-levels-test/", "https://www.pcrm.org/health/reports/metals-of-concern-in-common-multivitamins", "https://jamanetwork.com/journals/jama/fullarticle/1104493", "https://www.greenmedinfo.com/toxic-ingredient/dl-alpha-tocopherol-acetate", "https://jamanetwork.com/journals/jama/fullarticle/1104493", "https://dailyhealthpost.com/this-vitamin-plays-a-key-role-in-the-production-of-specific-compounded-needed-for-carrying-dha-to-the-brain/", "https://www.jstage.jst.go.jp/article/cpb/57/10/57_10_1096/_pdf", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1384169/?tool=pubmed", "https://www.ncbi.nlm.nih.gov/pubmed/20011136", "https://dailyhealthpost.com/brazil-chicken-farmers-say-no-to-american-gmo-corn/", "https://davidsuzuki.org/issues/health/science/toxics/chemicals-in-your-cosmetics---bha-and-bhti/", "https://labdoor.com/rankings/multivitamins", "https://dailyhealthpost.com/banish-joint-pain-with-gelatin/", "https://www.centrum.co.za/sites/default/files/Centrum%20PIL%20final%202012_0.pdf", "https://www.naturalnews.com/010095_hydrogenated_oils_unhealthy.html", "https://www.thesleuthjournal.com/dangerous-truth-sodium-benzoate/", "https://dailyhealthpost.com/nephrotoxic-drugs/", "https://toxnet.nlm.nih.gov/cgi-bin/sis/search/a?dbs+hsdb:@term+@DOCNO+5824", "https://www.naturalnews.com/034813_childrens_medicines_aluminum_pills.html", "https://www.inchem.org/documents/sids/sids/128370.pdf", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3389580/", "mailto:?subject=World%E2%80%99s%20Most%20Popular%20Multivitamin%20Is%20Useless%20And%20Contains%20Toxic%20Chemicals%20And%20Artificial%20Colors&body=%22That%20which%20we%20call%20a%20rose%20by%20any%20other%20name%20would%20smell%20as%20sweet.%22%20While%20this%20may%20be%20true%20for%0D%0A%0D%0ARead More Here: %20https%3A%2F%2Fdailyhealthpost.com%2Fcentrum-multivitamin%2F%3Futm_source%3Demail%26utm_medium%3Dsocial%26utm_campaign%3DSocialWarfare", "https://share.flipboard.com/bookmarklet/popout?v=2&title=World%E2%80%99s+Most+Popular+Multivitamin+Is+Useless+And+Contains+Toxic+Chemicals+And+Artificial+Colors&url=https%3A%2F%2Fdailyhealthpost.com%2Fcentrum-multivitamin%2F%3Futm_source%3Dflipboard%26utm_medium%3Dsocial%26utm_campaign%3DSocialWarfare", "https://api.whatsapp.com/send?text=https%3A%2F%2Fdailyhealthpost.com%2Fcentrum-multivitamin%2F%3Futm_source%3Dwhatsapp%26utm_medium%3Dsocial%26utm_campaign%3DSocialWarfare", "https://dailyhealthpost.com/cannabis-milk/"], "authors": [], "publish_date": "2016-11-11T01:15:04-05:00"}