{"result_id": "090001", "URL": "https://dailyhealthpost.com/5-reasons-your-digestive-system-isnt-working-properly/", "timestamp": "2023-04-25 14:57:30 CEST+0200", "meta": {"description": "Find out why those with digestive issues can't often fully fix them and have to follow a very strict diet or suffer the painful consequences.", "lang": "en", "keywords": "", "favicon": "https://dailyhealthpost.com/wp-content/uploads/2018/06/cropped-logo_lg-32x32.png", "canonical": "https://dailyhealthpost.com/5-reasons-your-digestive-system-isnt-working-properly/", "encoding": "UTF-8"}, "image": null, "domain": "dailyhealthpost.com", "title": "5 Reasons Your Digestive System Isn't Working Properly", "cleaned_text": "It seems nearly everyone has digestive issues these days.\n\nCrohn’s, IBS, colitis, celiac, and dozens of other digestive disorders have made an industry out of sugar free, gluten free, and dairy free products.\n\nSo why is it that those with digestive issues can’t often fully fix them and have to follow a very strict diet or suffer the painful consequences?\n\nOne of the main reasons you are not able to digest food properly is bacterial imbalance in your intestinal system. An ideal ratio for a properly functioning gut is 85 percent good bacteria to 15 percent bad, and when this is accomplished the good bacteria flourish and are allowed to do their job of digesting and absorbing certain starches, fiber, and sugars.\n\nUnfortunately, a lifetime of habits littered with antibiotics, sugar, alcohol, toxins, and ‘dead’ food has destroyed the proper balance we require for good digestion.\n\nIn your effort to regain proper gut flora balance, consider antibacterial foods and herbs like garlic, onions, oregano, cloves, and black walnut. At the same time consider probiotic rich foods like green leafy vegetables and fermented foods such as sauerkraut, tempeh, and kefir.\n\nEnzymes play a key role in our health by enabling our bodies to properly digest and use all the nutrients we take in to their greatest potential. If we do not introduce enough enzymes through our food, we put more pressure on the pancreas to produce enzymes in order to break down waste products, which eventually can leave it overworked and unable to produce the enzymes required to facilitate proper digestion.\n\nTo maximize your enzyme production, first increase your consumption of raw, organic food like papaya, pineapples, bee pollen, kefir, and fermented vegetables. Chew your food thoroughly to properly mix them with your enzyme rich saliva, which helps the process of pre-digestion.\n\nJuicing is one way to really increase the amount of easily assimilated enzymes into your digestive system, as well as digestive and systemic enzyme supplements.\n\nPreviously, it was believed that magnesium was required for up to 325 enzymatic processes, but according to new research, that number is closer to 800. This makes magnesium very important in the digestive process.\n\nMagnesium is also heavily implicated in proper functioning of muscles, including those in the lining of your digestive tract. A deficiency in magnesium causes the peristaltic action in your digestive system to slow right down, which hinders the movement of waste, and backs up the digestive process.\n\nConsider liquid magnesium supplements, and loading up on salads rich in leafy greens and vegetables.\n\nStress creates all sorts of problems for your digestive system. It strips your body of various vitamins and minerals (B vitamins and magnesium to name a couple), tightens your muscles, slows down bowel movements, and inhibits absorption of enzymes and probiotics, as well as other nutrients.\n\nKeep your stress in check through chamomile, medicinal mushrooms, kefir, and acts of gratitude, meditation, and exercise.\n\nThere are many types of toxins that can cause digestive distress, however, one of the most gut compromising toxins falls in the heavy metals category.\n\nHeavy metals are introduced into our bodies in a variety of ways, but some of the more problematic gateways are through vaccinations and mercury amalgams. Not only does this create a great burden for proper liver, gallbladder, and pancreas function (including secreting bile to facilitate digestion), but heavy metals also kill off good bacteria to further impair the digestive process.\n\nHeavy metal detoxification is a delicate process and should be handled by a professional, but you can consider chlorella and cilantro to help bind and remove them from your system.", "opengraph": {"description": "Your gut is the doorway to a healthy body.", "title": "5 Reasons Your Digestive System Isn't Working Properly", "article_publisher": "dailyhealthpost", "image": "https://dailyhealthpost.com/wp-content/uploads/2014-02-28-5-reasons-your-digestive-system-isnt-working-properly-2-fb-2.jpg", "type": "article", "url": "https://dailyhealthpost.com/5-reasons-your-digestive-system-isnt-working-properly/", "site_name": "DailyHealthPost", "article:published_time": "2014-02-28T10:00:50-05:00", "article:modified_time": "2017-08-07T15:16:40-04:00", "updated_time": "2017-08-07T15:16:40-04:00", "locale": "en_US", "article:publisher": "https://www.facebook.com/DailyHealthPost/", "article:author": "https://www.facebook.com/DailyHealthPost", "article:section": "Wellness", "image:secure_url": "https://dailyhealthpost.com/wp-content/uploads/2014-02-28-5-reasons-your-digestive-system-isnt-working-properly-2-fb-2.jpg", "image:width": "1200", "image:height": "630", "image:alt": "digestive system", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com/044034_digestion_enzyme_deficiency_IBS.html", "mailto:?subject=5%20Perfectly%20Good%20Reasons%20Why%20Your%20Digestive%20System%20Isn%27t%20Working%20Properly%20%28No.%204%20Is%20a%20No-Brainer%21%29&body=It%20seems%20nearly%20everyone%20has%20digestive%20issues%20these%20days.%20Crohn%27s%2C%20IBS%2C%20colitis%2C%20celiac%2C%20and%20dozens%20of%20other%20digestive%20disorders%20have%0D%0A%0D%0ARead More Here: %20https%3A%2F%2Fdailyhealthpost.com%2F5-reasons-your-digestive-system-isnt-working-properly%2F%3Futm_source%3Demail%26utm_medium%3Dsocial%26utm_campaign%3DSocialWarfare", "https://share.flipboard.com/bookmarklet/popout?v=2&title=5+Perfectly+Good+Reasons+Why+Your+Digestive+System+Isn%27t+Working+Properly+%28No.+4+Is+a+No-Brainer%21%29&url=https%3A%2F%2Fdailyhealthpost.com%2F5-reasons-your-digestive-system-isnt-working-properly%2F%3Futm_source%3Dflipboard%26utm_medium%3Dsocial%26utm_campaign%3DSocialWarfare", "https://api.whatsapp.com/send?text=https%3A%2F%2Fdailyhealthpost.com%2F5-reasons-your-digestive-system-isnt-working-properly%2F%3Futm_source%3Dwhatsapp%26utm_medium%3Dsocial%26utm_campaign%3DSocialWarfare", "https://dailyhealthpost.com/how-to-stop-sugar-cravings-3-simple-action-steps/"], "authors": [], "publish_date": "2014-02-28T10:00:50-05:00"}