{"result_id": "090019", "URL": "https://dailyhealthpost.com/glyphosate-cancer/", "timestamp": "2023-04-25 14:57:51 CEST+0200", "meta": {"description": "Secret documents prove that agricultural giant Monsanto has known about glyphosate cancer link for over 35 years. What a bombshell!", "lang": "en", "keywords": "", "favicon": "https://dailyhealthpost.com/wp-content/uploads/2018/06/cropped-logo_lg-32x32.png", "canonical": "https://dailyhealthpost.com/glyphosate-cancer/", "encoding": "UTF-8"}, "image": null, "domain": "dailyhealthpost.com", "title": "Bombshell Secret Documents Show Monsanto Knew About Glyphosate Link to Cancer Over 35 Years Ago", "cleaned_text": "Roundup is the most popular herbicide on the planet.\n\nIt’s made by Monsanto, a multi-billion dollar corporation headquartered in St. Louis, Missouri. Monsanto was recently acquired by Bayer, another multi-billion dollar international corporation with questionable ethics.\n\nTogether, these mega-corporations will control almost a third of the world’s food supply.\n\nGlyphosate is the active ingredient in Roundup. Toxic in its own right, when combined with certain other chemicals, its toxicity expands exponentially.\n\nThe problem for us is that it is toxic not only to the plants it’s meant to kill, but to the soil in which it’s planted, and the animals (including humans) that eat, drink, and inhale it. It has also been found in vaccines that contain glycerine or egg protein (the animals from which these were derived ate glyphosate-treated feed) (1).\n\nMonsanto’s website quotes the U.S. Environmental Protection Agency’s (EPA) classification of glyphosate as “practically non-toxic, referencing studies that show no evidence of damage to humans or animals on any level.” The website explains that glyphosate works by inhibiting an enzyme in plants that stop it from growing and claim that the enzyme doesn’t exist in animals, making it safe for use in raising crops (2).\n\nThis information isn’t entirely false: the EPA has deemed glyphosate safe and it does work by inhibiting enzymes. But the rest is hogwash.\n• Glyphosate was found toxic to fish as long ago as 1978 and amphibians in 2005 (3, 4).\n• “Inert” ingredient POEA (polyethoxylated tallowamine) in Roundup was found to kill human cells, particularly embryonic, placental, and umbilical cells in 2009 (5).\n• In 2015, the International Agency for Research on Cancer (part of the World Health Organization) issued the statement that glyphosate is “probably carcinogenic to humans” (6).\n• Glyphosate is on California’s list of cancer-causing chemicals.\n• From the Journal of Pesticide Reform in 1998:\n\n“Glyphosate-containing products are acutely toxic to animals, including humans. Symptoms include eye and skin irritation, headache, nausea, numbness, elevated blood pressure, and heart palpitations. The surfactant used in a common glyphosate product (Roundup) is more acutely toxic than glyphosate itself; the combination of the two is yet more toxic. Given the marketing of glyphosate herbicides as benign, it is striking that laboratory studies have found adverse effects in all standard categories of laboratory toxicology testing. These include medium-term toxicity (salivary gland lesions), long-term toxicity (inflamed stomach linings), genetic damage (in human blood cells), effects on reproduction (reduced sperm counts in rats; increased frequency of abnormal sperm in rabbits), and carcinogenicity (increased frequency of liver tumors in male rats and thyroid cancer in female rats).” [emphasis added] (7).\n\nAnd That’s Not All\n• There is substantive evidence that links glyphosate to autism spectrum disorders. In 1975, 1 in 5000 children were diagnosed with autism; today, it’s 1 in 68. The frightening increase in the occurrence of these disorders correlates with geographical areas and increased use of glyphosate (8).\n• The EPA actually says: “glyphosate has low toxicity for humans” and “is no more than slightly toxic to birds”. “Practically nontoxic” goes for marine animals, which studies have shown is false (9). The EPA is holding a meeting of a scientific advisory panel to review the “Carcinogenic Potential of Glyphosate” in October 2016. The Issue Paper to be reviewed can be found here.\n\nThere is much more scientific evidence that glyphosate and the chemical composition of Roundup are toxic to animals, air, and soil in a great many ways.\n\nDr. Anthony Samsel is a research scientist and experienced biomedical consultant, with credentials in chemistry and biology. He runs his own firm in New Hampshire.\n\nSamsel has conducted extensive research in biochemicals and genetic modification, widely published in medical journals. After signing a non-disclosure agreement, Samsel recently managed to get his hands on classified studies conducted by Monsanto on the safety of glyphosate, dating back to the late 1970s. The subjects were mice, rats, rabbits, and dogs.\n\nThe EPA sealed these studies in an agreement with Monsanto that they were “trade secrets”, like the recipe for Coca-Cola. He summarizes what he read in an interview recorded in the videos below.\n\nWhy the studies are classified is made apparent by their content: they all show conclusively that glyphosate causes cancer in mammals.\n\nMost toxic chemicals work in a dose-dependent manner, meaning that the higher the concentration of the chemical, the more hazardous it becomes. Glyphosate does not.\n\nIt is shown in these studies to be carcinogenic in even small doses, with tumors produced on skin, in organs (kidney, pancreas), glands (pituitary, thymus, thyroid), breast tissue, and testes.\n\nIn one of the studies, rabbits were given a radioactive potion so researchers could watch the progress of glyphosate through the animals’ bodies. They found that it went straight to the organs and blood marrow. The marrow is where T-cells are formed—the kind that kills infection and fight disease.\n\nBy its very nature, glyphosate prevents the growth of cells until all in the affected area are dead. By impeding the growth of T-cells, the way is paved for infection and disease to take hold.\n\nThe tumor growth was linked to glyphosate in every classified study.\n\nSome showed that the kidneys and pancreas were particularly sensitive to glyphosate, even in small doses. Contemporary study shows even more extensive implications for human health:\n\n“Glyphosate substitution for conserved glycines (an amino acid) can easily explain a link with diabetes, obesity, asthma, chronic obstructive pulmonary disease (COPD), pulmonary edema, adrenal insufficiency, hypothyroidism, Alzheimer’s disease, amyotrophic lateral sclerosis (ALS), Parkinson’s disease, prion diseases, lupus, mitochondrial disease, non-Hodgkin’s lymphoma, neural tube defects, infertility, hypertension, glaucoma, osteoporosis, fatty liver disease and kidney failure.” (10)\n\nThe enzyme inhibitor that is the basis of glyphosate’s efficacy affects bacteria in the digestive system, which weren’t under scrutiny in the classified studies (11). By disrupting metabolism and growth at the microbiome level, the immune system is compromised. “Friendly” bacteria are a critical component of overall health. In addition, glyphosate works synergistically with other chemicals, increasing their toxicity (12).\n\nDr. Samsel concludes his interview with the following message, based on his understanding of Monsanto’s hidden research:\n\n“So it would be my recommendation that every government on this earth, no matter where they are, needs to ban herbicides; not just glyphosate—all herbicides—from the food supply and animal feed. It’s unconscionable to feed animals with food that’s contaminated with herbicides. It sets them up for disease and misery just like it sets us up for disease and misery.”\n\nIn light of the facts that a) humans are stewards of the animal kingdom; b) laboratory animals eat foods provided by Purina, the ingredients of which have been found to increase the toxic potency of glyphosate; and c) we eat the animals that eat contaminated feed; cancer in animals caused by glyphosate is our responsibility, too.\n\nIt’s time to face the reality that Monsanto and other giants not only put profits before people, it’s also jeopardizing the health of our entire planet.", "opengraph": {"description": "The truth has finally come out.", "title": "Bombshell Secret Documents Show Monsanto Knew About Glyphosate Link to Cancer Over 35 Years Ago", "article_publisher": "dailyhealthpost", "image": "https://dailyhealthpost.com/wp-content/uploads/2016/10/glyphosate-cancer.jpg", "type": "article", "url": "https://dailyhealthpost.com/glyphosate-cancer/", "site_name": "DailyHealthPost", "article:published_time": "2016-10-12T01:15:49-04:00", "article:modified_time": "2017-08-07T15:09:50-04:00", "updated_time": "2017-08-07T15:09:50-04:00", "locale": "en_US", "article:publisher": "https://www.facebook.com/DailyHealthPost/", "article:author": "https://www.facebook.com/DailyHealthPost", "article:section": "Wellness", "image:secure_url": "https://dailyhealthpost.com/wp-content/uploads/2016/10/glyphosate-cancer.jpg", "image:width": "1200", "image:height": "630", "image:alt": "glyphoste cancer", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://dailyhealthpost.com/exposure-insecticides-increase-risk-parkinsons-disease-11083/", "https://dailyhealthpost.com/bayer-monsanto/", "https://dailyhealthpost.com/glyphosate-in-wines-tested/", "https://dailyhealthpost.com/research-roundup-diluted-by-450-fold-still-remains-toxic/", "https://farmwars.info/?p=15100", "https://www.monsanto.com/glyphosate/pages/is-glyphosate-safe.aspx", "https://link.springer.com/article/10.1007/BF01056243", "https://www.biosafety-info.net/article.php?aid=267", "https://www.scientificamerican.com/article/weed-whacking-herbicide-p/", "https://www.iarc.fr/en/media-centre/iarcnews/pdf/MonographVolume112.pdf", "https://dailyhealthpost.com/14283-california-just-announced-it-will-label-monsantos-roundup-as-cancer-causing/", "https://www.wolf.sk/dok/pesticidy/glyphopsate.pdf", "https://dailyhealthpost.com/epa-considers-glyphosate-ban/", "https://althealthworks.com/2494/mit-researchers-new-warning-at-todays-rate-1-in-2-children-will-be-autistic-by-2025/", "https://www.epa.gov/ingredients-used-pesticide-products/glyphosate", "https://www.epa.gov/sites/production/files/2016-09/documents/glyphosate_issue_paper_evaluation_of_carcincogenic_potential.pdf", "https://dailyhealthpost.com/gmo-farming-and-food-creates-gut-flora-imbalance/", "https://youtu.be/13yO9VpjwLQ", "https://youtu.be/yPBPfWrFwuI", "https://dailyhealthpost.com/quaker-oats-glyphosate/", "https://dailyhealthpost.com/aspartame-is-linked-to-leukemia-and-lymphoma-in-landmark-study-in-humans/", "https://www.researchgate.net/publication/305318376_Glyphosate_pathways_to_modern_diseases_V_Amino_acid_analogue_of_glycine_in_diverse_proteins", "https://dailyhealthpost.com/healthy-gut-healthy-brain/", "https://www.mdpi.com/1099-4300/15/4/1416", "https://dailyhealthpost.com/gmo-farming-and-food-creates-gut-flora-imbalance/", "https://www.biosafety-info.net/article.php?aid=267", "mailto:?subject=Classified%20Documents%20Reveal%20Monsanto%20Knew%20About%20Glyphosate%20Link%20to%20Cancer%2035%20Years%20Ago&body=Roundup%20is%20the%20most%20popular%20herbicide%20on%20the%20planet.%20It%E2%80%99s%20made%20by%20Monsanto%2C%20a%20multi-billion%20dollar%20corporation%20headquartered%20in%20St.%0D%0A%0D%0ARead More Here: %20https%3A%2F%2Fdailyhealthpost.com%2Fglyphosate-cancer%2F%3Futm_source%3Demail%26utm_medium%3Dsocial%26utm_campaign%3DSocialWarfare", "https://share.flipboard.com/bookmarklet/popout?v=2&title=Classified+Documents+Reveal+Monsanto+Knew+About+Glyphosate+Link+to+Cancer+35+Years+Ago&url=https%3A%2F%2Fdailyhealthpost.com%2Fglyphosate-cancer%2F%3Futm_source%3Dflipboard%26utm_medium%3Dsocial%26utm_campaign%3DSocialWarfare", "https://api.whatsapp.com/send?text=https%3A%2F%2Fdailyhealthpost.com%2Fglyphosate-cancer%2F%3Futm_source%3Dwhatsapp%26utm_medium%3Dsocial%26utm_campaign%3DSocialWarfare", "https://dailyhealthpost.com/wireless-headphone-radiation/"], "authors": [], "publish_date": "2016-10-12T01:15:49-04:00"}