{"result_id": "091046", "URL": "https://dailysceptic.org/2023/02/13/anthony-fauci-acknowledges-the-covid-vaccines-are-deficient-but-also-says-they-have-saved-innumerable-lives/", "timestamp": "2023-04-25 14:58:09 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/apple-touch-icon.png?v=3", "canonical": "https://dailysceptic.org/2023/02/13/anthony-fauci-acknowledges-the-covid-vaccines-are-deficient-but-also-says-they-have-saved-innumerable-lives/", "encoding": "UTF-8"}, "image": null, "domain": "dailysceptic.org", "title": "Anthony Fauci Acknowledges the Covid Vaccines Are ‘Deficient’ (But Also Says They Have “Saved Innumerable Lives”) – The Daily Sceptic", "cleaned_text": "A colleague of mine sent me a copy of a recent opinion piece published in entitled ‘Rethinking next-generation vaccines for coronaviruses, influenzaviruses, and other respiratory viruses’. This opinion piece by David M. Morens, Jeffery K. Taubenberger and Anthony S. Fauci is not only interesting because of its content but because the senior author is one Anthony Fauci.\n\nI was not the only one to spot this publication and subsequently discovered that Alex Berenson had already pulled out the key findings from the paper and published them on his Substack.\n\nI would recommend reading both the paper itself (which is written in something approaching plain English) and Alex’s excellent Substack, but here I thought I would go through this paper and bring out some of the key points.\n\nSo why is this paper so interesting? Given that the senior author is Anthony Fauci isn’t it just going to be a spin piece hailing the unbounded success of the ‘safe and effective’ COVID-19 vaccines? Well, as it turns out, not quite.\n\nLet’s start with this quote from the introductory sections of the paper, which really sets the tone:\n\nOnce past the obligatory statement of lives saved in the COVID-19 pandemic, Fauci and his colleagues dive straight in with the admission that the vaccines are ‘deficient’ and only ever achieved ‘partial pandemic control’, which seems a slight oxymoronic statement as either you are controlling the pandemic, or you are not and partial controlled means (partially) uncontrolled. Putting this aside, the reason for this ‘partial control’ was because the vaccines were leaky, transient in their effect, and never produced effective levels of immunity in the population because of the evolution of escape variants. Simply put, these vaccines were not very good.\n\nA point the authors kind of make in their next paragraph:\n\nHere, of course, the implication is that the SARS-CoV-2 vaccines would have been sufficiently protective to achieve regulatory approval, but of course they did not go through the “complex process requiring years of preclinical and clinical safety and efficacy data” but were instead fast-tracked through a highly abbreviated development programme, so we’ll never know. Despite this, the authors acknowledge that these vaccines have limitations and highlight the fact that vaccines to other coronaviruses (amongst other things) have failed to satisfy the regulatory authorities that they are effective. The question of whether the COVID-19 vaccines would actually be deemed to be effective in more normal times is one I’ll come back to this at the end of this article.\n\nThe authors go further in explaining why vaccines like those developed to prevent diseases caused by respiratory viruses are scientifically unlikely to be effective at controlling these diseases:\n\nIn other words, it appears that we haven’t evolved to develop long-term immunity to pathogens like SARS-CoV-2 and so it was always extremely unlikely that the COVID-19 vaccines were ever going to produce effective long-term protection, especially as they are “systemically administered non-replicating vaccines”. Any transient immunity would wane and so were always going to get reinfected.\n\nThe reasons for this lack of “complete and long-term protective immunity against reinfection” are discussed in a section of the paper entitled: ‘Natural infections with mucosal respiratory viruses may not be fully controlled by human immune responses because the human immune system has evolved to tolerate them during very short intervals of mucosal viral replication.’\n\nIt turns out we’ve evolved to tolerate some level of respiratory infection (especially in the upper airways) rather than having our immune system going into over-drive all the time. Given the prevalence of respiratory viruses in the environment, it is easy to see why this might be the case because if our immune systems went into action at the first (literal) sniff of a viral infection, we’d be sick all the time.\n\nThis local tolerance of respiratory viruses is in contrast to systemic viral infections where we do generate a strong, long-lasting immune response and vaccination can be effective, e.g. measles.\n\nThe consequence of driving a systemic immune response to what would normally be a contained, tolerated local infection is unclear, but this is something Alex Berenson discusses in his Substack article:\n\nFinally, the authors discuss the numerous pieces of scientific evidence showing that generating a local immune response is the best way of protecting oneself from respiratory infection and that this response can be driven through T-cell immunity. Again, this calls into doubt the effectiveness of systemic vaccination against such respiratory viruses whilst simultaneously acknowledging the role of T-cells in immunity to viruses like SARS-CoV-2… something that was consistently downplayed during the pandemic itself.\n\nOverall, the authors are surprisingly critical of single vaccine approaches:\n\nEspecially those using systemic administration of agents to induce immunity to respiratory viruses:\n\nBased on prior experience of vaccines against diseases like COVID-19, it would seem to be extremely unlikely that a single vaccine would achieve what is required to prevent severe disease. So, one is left with the impression that either we were extremely lucky with the SARS-CoV-2 vaccinations, which bucked this trend, or a conclusion that these vaccinations are not actually very ‘effective’ at “controlling a mucosal respiratory virus”. Interestingly, there is no discussion of this point in the paper, and one might naively believe that it would have been a critical point of interest give the billions of doses of the SARS-CoV-2 vaccines given to people worldwide. Why are these vaccines examples of success, given the fact that they appear to have many of the features of countless other vaccine failures?\n\nBefore finishing off with a few thoughts, I thought it worth highlighting this passage:\n\nSo, repeated exposure to some viral pathogens may actually be important in maintaining immunity to them and preventing them causing severe disease. This would be consistent with the observations discussed above about the limited form of immunity such exposure gives and speaks to the concept that “a challenged immune system, is a healthy immune system”. Therefore, locking everyone up in their houses for months on end would be predicted to result in a loss of immunity to common respiratory viruses that would normally circulate through the population causing mild disease while reinforcing our immunity to them. As a result, once people were allowed to mix again one would further predict a wave of things like RSV infection causing much more severe disease in what had essentially become a naïve population. Indeed, this is what was seen in places like New Zealand post-lockdown. Not only were the SARS-CoV-2 vaccines unlikely to do what we wanted them to, but lockdowns were always likely to produce predictable viral problems. Worst cold in the world anyone?\n\nThis is a very interesting article, not just because of what it has to say about vaccinations to viruses like SARS-CoV-2, but also because of who is saying it. There are many statements in here that I suspect would fall foul of the ‘fact checkers’, not least the discussion about the transient and incomplete immunity produced by the SARS-CoV-2 vaccines and their various deficiencies and the fact that they would seem to be a far cry from what anyone might reasonably deem to be genuinely ‘effective’. One is certainly left with the impression that written by a different author the slant could easily have been something like “SARS-CoV-2 vaccinations are another example of our failure to develop effective vaccines against mucosal respiratory viruses”.\n\nOverall, I’m left with the questions as to whether the SARS-CoV-2 vaccines are really exceptions to the failures to produce suitably effective vaccines against such respiratory viruses or whether in other circumstances they would not be approved for use. Maybe in a pandemic it is necessary to accept vaccines that “elicit incomplete and short-lived protection against evolving virus variants that escape population immunity”? Perhaps one could argue something is better than nothing, but if this is the case why should we keep on taking them after the pandemic is passed, especially if “none of the predominantly mucosal respiratory viruses have ever been effectively controlled by vaccines”?\n\nBecause of exceptional circumstances, the SARS-CoV-2 vaccines did not go through the usual “complex process requiring years of preclinical and clinical safety and efficacy data” and were fast-tracked to approval. Many of the missing studies were the long-term safety studies usually required of vaccines before approval and we need to always remember that it is the balance of benefit AND risk that is important in a pharmaceutical treatment, not just whether they have some level of efficacy… something that is especially true for vaccines that will be given to healthy individuals who may never gain any benefit. Unfortunately, vaccine safety and the risks to the patient are one area that Fauci and his colleagues are strangely silent on in this piece.\n\nFinally, having comprehensively highlighted the issues and deficiencies with both the current SARS-CoV-2 vaccines and the challenges of making better ones, what do the authors suggest is the answer to this problem?\n\nTheir answer is, perhaps unsurprisingly, a lot more vaccinations. I would certainly agree that there need to be more effective vaccinations, and I am not underplaying the seriousness of some of the diseases caused by these viruses. But if we accept that immunity against respiratory viruses is somehow ‘hardwired’ to be transient, then the imagined approach here seems to be one in which we could spend our lives injecting, taking, and sniffing a stream of pharmaceutical products and . No wonder it is right to ask, “whether these approaches will be accepted by providers, regulators, and the public”?\n\nGeorge Santayana is the pseudonym of a senior executive at a British pharmaceutical company.", "opengraph": {"locale": "en_GB", "type": "article", "title": "Anthony Fauci Acknowledges the Covid Vaccines Are ‘Deficient’ (But Also Says They Have “Saved Innumerable Lives”) – The Daily Sceptic", "description": "A new article in Cell Host and Microbe accepts that the Covid vaccines have some 'deficiencies' and only offer 'incomplete and short-lived' protection. Surprisingly, one of the authors is Anthony Fauci.", "url": "https://dailysceptic.org/2023/02/13/anthony-fauci-acknowledges-the-covid-vaccines-are-deficient-but-also-says-they-have-saved-innumerable-lives/", "site_name": "The Daily Sceptic", "article:publisher": "https://www.facebook.com/LockdownScepticsFB", "article:published_time": "2023-02-13T07:00:00+00:00", "article:modified_time": "2023-02-14T00:59:46+00:00", "image": "https://dailysceptic.org/wp-content/uploads/2023/02/1200x-1.jpg", "image:width": "1200", "image:height": "800", "image:type": "image/jpeg"}, "tags": ["Cell Host and Microbe", "Anthony Fauci", "Alex Berenson"], "tweets": [], "movies": [], "links": ["https://www.cell.com/cell-host-microbe/fulltext/S1931-3128(22)00572-8", "https://alexberenson.substack.com/p/dr-anthony-fauci-now-admits-the-mrna", "https://alexberenson.substack.com/p/dr-anthony-fauci-now-admits-the-mrna", "https://dailysceptic.org/tag/alex-berenson/", "https://dailysceptic.org/tag/anthony-fauci/", "https://dailysceptic.org/tag/cell-host-and-microbe/"], "authors": ["George Santayana"], "publish_date": "2023-02-13T07:00:00+00:00"}