{"result_id": "091008", "URL": "https://dailysceptic.org/2023/01/13/fda-vaccine-committee-member-calls-for-end-to-mass-covid-vaccination/", "timestamp": "2023-04-25 14:57:59 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/apple-touch-icon.png?v=3", "canonical": "https://dailysceptic.org/2023/01/13/fda-vaccine-committee-member-calls-for-end-to-mass-covid-vaccination/", "encoding": "UTF-8"}, "image": null, "domain": "dailysceptic.org", "title": "FDA Vaccine Committee Member Calls For End to Mass Covid Vaccination – The Daily Sceptic", "cleaned_text": "Dr. Paul Offit, a member of the U.S. FDA’s vaccine advisory committee, has written in the , the world’s top medical journal, calling for an end to the mass vaccination of anyone at low risk from the virus. In an op-ed titled “Bivalent COVID-19 Vaccines – A Cautionary Tale”, Dr. Offit writes that Covid boosters are “probably best reserved for the people most likely to need protection against severe disease”.\n\n“I believe we should stop trying to prevent all symptomatic infections in healthy, young people by boosting them with vaccines containing mRNA from strains that might disappear a few months later,” he writes.\n\nDr. Offit, who is Professor of Vaccinology and Professor of Paediatrics at the University of Pennsylvania, goes through in detail the process that led to bivalent vaccines being recommended in the U.S. for everyone over five years of age with no relevant data from humans. He is clearly very unhappy about it.\n\nOn June 28th 2022, researchers from Pfizer-BioNTech and Moderna presented data on their bivalent vaccines to the FDA’s Vaccines and Related Biological Products Advisory Committee (of which I am a member). The results were underwhelming. Bivalent boosters resulted in levels of neutralising antibodies against BA.1 that were only 1.5 to 1.75 times as high as those achieved with monovalent boosters. Previous experience with the companies’ vaccines suggested that this difference was unlikely to be clinically significant. Safety data were reassuring. At the time of the FDA presentation, BA.1 was no longer circulating in the United States, having been replaced by more immune-evasive and contagious Omicron subvariants. But winter was around the corner. The FDA advisory committee, sensing the urgency of responding to these immune-evasive strains, voted to authorise bivalent vaccines with an understanding that they would target Omicron subvariants BA.4 and BA.5, which at the time had accounted for more than 95% of circulating strains. A series of rapid-fire policy decisions followed. On June 29th 2022, the day after the advisory committee meeting, the Biden administration agreed to purchase 105 million doses of Pfizer-BioNTech’s bivalent vaccine containing BA.4 and BA.5 mRNA. One month later, on July 29th 2022, the administration agreed to purchase 66 million doses of Moderna’s bivalent vaccine, intending to offer both vaccines in the fall and winter. On September 1st 2022, the FDA withdrew its emergency use authorisation for monovalent vaccine boosters and the CDC recommended bivalent vaccine boosters for everyone 12 years of age or older. On October 12th 2022, the CDC extended this recommendation to include everyone five years of age or older. At that point, no data from humans, including immunogenicity data, were available for comparing the relative capacities of the monovalent and bivalent vaccines to protect against BA.4 and BA.5. On October 24th 2022, David Ho and colleagues released the results of a study examining levels of neutralizing antibodies against BA.4 and BA.5 after receipt of a monovalent or bivalent booster dose. They found “no significant difference in neutralisation of any SARS-CoV-2 variant”, including BA.4 and BA.5, between the two groups. One day later, Dan Barouch and colleagues released the results of a similar study, finding that “BA.5 [neutralising-antibody] titers were comparable following monovalent and bivalent mRNA boosters”. Barouch and colleagues also noted no appreciable differences in CD4+ or CD8+ T-cell responses between participants in the monovalent-booster group and those in the bivalent-booster group. Neither research group found the bivalent boosters to elicit superior immune responses. The results are now published in the .\n\nThe likely reason the bivalent vaccines failed is immune imprinting, Dr. Offit explains.\n\nWhen epidemiological data did become available, they showed very poor protection.\n\nOn November 22nd 2022, the CDC published data on the effectiveness of the BA.4 and BA.5 mRNA vaccines for preventing symptomatic infection within two months after receipt of the booster dose. For people who had received a monovalent vaccine two to three months earlier, the extra protection associated with the bivalent booster dose ranged from 28% to 31%. For those who had received a monovalent vaccine more than eight months earlier, the extra protection ranged from 43% to 56%. Given the results of previous studies, it’s likely that this moderate increase in protection against probably generally mild disease will be short lived.\n\nThe bivalent vaccine had very poor take-up and the variants it was targeted against were quickly gone.\n\nIt’s welcome that Dr. Offit is breaking ranks and expressing dismay about the poor process and the lack of data, and calling for the end of the mass vaccination campaign. The intervention is particularly significant because it denotes a failure of the central U.S. biosecurity strategy of trying to use fast-track mRNA vaccines to provide a lightning response to an emerging biological threat. It is thus likely that his conclusions will be strongly resisted by those who are invested – financially, psychologically and politically – in this strategy.\n\nThat Dr. Offit is only doing so now, and not with any recognition of any safety problems, is less welcome, of course. Still, he will likely not be thanked by his paymasters, and it is in the right direction, so he should receive credit for that.\n\nWe still await the acknowledgement that the benefit of these vaccines was never favourable for people at low risk from the virus, who never needed them, and that their safety profile is far worse than the companies and regulators have led the public to believe.\n\nStop Press: CNN reports that Dr. Offit is “angry” that Moderna failed to include unfavourable infection data in its submission to the FDA last year. “I was angry to find out that there was data that was relevant to our decision that we didn’t get to see,” Dr. Offit said. According to CNN: “The data that was not presented to the experts looked at actual infections: who caught COVID-19 and who did not. It found that 1.9% of the study participants who received the original booster became infected. Among those who got the updated bivalent vaccine – the one that scientists hoped would work better – a higher percentage, 3.2%, became infected.” Does it make you wonder what else they’re not telling you, Dr. Offit?", "opengraph": {"locale": "en_GB", "type": "article", "title": "FDA Vaccine Committee Member Calls For End to Mass Covid Vaccination – The Daily Sceptic", "description": "Dr Paul Offit, a member of the FDA's vaccine advisory committee, has written in the New England Journal of Medicine, the world's top medical journal, calling for the end of boosters for anyone at low risk from the virus.", "url": "https://dailysceptic.org/2023/01/13/fda-vaccine-committee-member-calls-for-end-to-mass-covid-vaccination/", "site_name": "The Daily Sceptic", "article:publisher": "https://www.facebook.com/LockdownScepticsFB", "article:published_time": "2023-01-13T17:02:49+00:00", "article:modified_time": "2023-01-13T18:29:57+00:00", "image": "https://dailysceptic.org/wp-content/uploads/2023/01/offit.png", "image:width": "957", "image:height": "561", "image:type": "image/png"}, "tags": ["Vaccine efficacy", "FDA", "Bivalent Boosters", "Omicron", "Paul Offit", "Vaccine"], "tweets": [], "movies": [], "links": ["https://www.nejm.org/doi/full/10.1056/NEJMp2215780", "https://www.biorxiv.org/content/10.1101/2022.10.22.513349v1", "https://www.biorxiv.org/content/10.1101/2022.10.24.513619v1", "https://www.cdc.gov/mmwr/volumes/71/wr/mm7148e1.htm?s", "https://dailysceptic.org/2022/12/13/u-s-government-has-been-planning-to-lockdown-and-wait-for-a-vaccine-since-2007/", "https://edition.cnn.com/2023/01/11/health/moderna-bivalent-transparency/index.html", "https://dailysceptic.org/tag/bivalent-boosters/", "https://dailysceptic.org/tag/fda/", "https://dailysceptic.org/tag/omicron/", "https://dailysceptic.org/tag/paul-offit/", "https://dailysceptic.org/tag/vaccine/", "https://dailysceptic.org/tag/vaccine-efficacy/"], "authors": ["Will Jones"], "publish_date": "2023-01-13T17:02:49+00:00"}