{"result_id": "091038", "URL": "https://dailysceptic.org/2023/04/15/what-you-arent-being-told-about-the-whos-outrageous-pandemic-plans/", "timestamp": "2023-04-25 14:58:06 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/apple-touch-icon.png?v=3", "canonical": "https://dailysceptic.org/2023/04/15/what-you-arent-being-told-about-the-whos-outrageous-pandemic-plans/", "encoding": "UTF-8"}, "image": null, "domain": "dailysceptic.org", "title": "What You Aren't Being Told About the WHO's \"Outrageous\" Pandemic Plans – The Daily Sceptic", "cleaned_text": "Next week we’ll finally see a Parliamentary debate over the World Health Organisation’s proposed Pandemic Accord. That should reveal some of the troubling details to the British public.\n\nDespite the WHO’s insistence that the new treaty and associated amendments to existing regulations will not limit the sovereignty of signatory nations, there is evidence that, if implemented, these changes will give the global health body extraordinary powers over governments.\n\nDr. Tess Lawrie sets out her misgivings about these “outrageous plans to give the WHO power over your life” in the .\n\nYou may be aware that the unelected Director General of the WHO, Tedros Adhanom Ghebreyesus, has been on social media recently claiming that this new treaty will not affect individual countries’ sovereignty. However, what you are not being told is that in conjunction with the Pandemic Accord, amendments to the International Health Regulations (2005) have been proposed and are being negotiated. Some of these amendments would cede unprecedented authority to the WHO and raise serious questions with regards to state sovereignty. Amendments to the International Health Regulations can be adopted by simple majority vote in the World Health Assembly, the governing body of the WHO, without subsequent national ratification procedures. This means that as things stand, these changes can sail through without parliamentary scrutiny and without you, the public, being informed. Instead of being advisory, as is any guidance currently coming out of the WHO, some of the new amendments propose that WHO advice would be legally binding on all state parties and their people.", "opengraph": {"locale": "en_GB", "type": "article", "title": "What You Aren't Being Told About the WHO's \"Outrageous\" Pandemic Plans – The Daily Sceptic", "description": "We will soon have the WHO's proposed Pandemic Accord debated in Parliament. The organisation denies it is an assault on sovereignty. Dr. Tess Lawrie calls it an \"outrageous\" plan to “give the WHO power over your life”.", "url": "https://dailysceptic.org/2023/04/15/what-you-arent-being-told-about-the-whos-outrageous-pandemic-plans/", "site_name": "The Daily Sceptic", "article:publisher": "https://www.facebook.com/LockdownScepticsFB", "article:published_time": "2023-04-15T14:00:00+00:00", "article:modified_time": "2023-04-15T17:48:15+00:00", "image": "https://dailysceptic.org/wp-content/uploads/2023/04/Treaty-2.png", "image:width": "955", "image:height": "505", "image:type": "image/png"}, "tags": ["Tedros Adhanom Ghebreyesus", "COVID-19", "Lockdowns", "WHO", "Pandemic treaty"], "tweets": [], "movies": [], "links": ["https://www.conservativewoman.co.uk/what-you-are-not-being-told-about-outrageous-plans-to-give-the-who-power-over-your-life/", "https://www.conservativewoman.co.uk/what-you-are-not-being-told-about-outrageous-plans-to-give-the-who-power-over-your-life/", "https://dailysceptic.org/tag/covid-19/", "https://dailysceptic.org/tag/lockdowns/", "https://dailysceptic.org/tag/pandemic-treaty/", "https://dailysceptic.org/tag/tedros-adhanom-ghebreyesus/", "https://dailysceptic.org/tag/who/"], "authors": ["Ian Macleod"], "publish_date": "2023-04-15T14:00:00+00:00"}