{"result_id": "091037", "URL": "https://dailysceptic.org/2023/02/03/94-of-claims-to-the-governments-vaccine-injury-payment-scheme-are-rejected-many-because-they-are-not-60-disabled-mark-kerry-is-one-of-them/", "timestamp": "2023-04-25 14:58:06 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/apple-touch-icon.png?v=3", "canonical": "https://dailysceptic.org/2023/02/03/94-of-claims-to-the-governments-vaccine-injury-payment-scheme-are-rejected-many-because-they-are-not-60-disabled-mark-kerry-is-one-of-them/", "encoding": "UTF-8"}, "image": null, "domain": "dailysceptic.org", "title": "94% of Claims to the Government's Vaccine Injury Payment Scheme Are Rejected, Many Because They Are Not \"60% Disabled\". Mark Kerry is One of Them – The Daily Sceptic", "cleaned_text": "Mark Kerry was a healthy 48 year-old from Worcestershire, a father of three, grandfather of two and a loving husband to his wife Melanie. Together with Melanie, Mark loved life and lived it to the full, they socialised with friends every weekend, loved to travel and loved holidays.\n\nMark and Melanie run mobile home parks and were heavily impacted in 2020 when the COVID-19 pandemic hit. With the mobile home business being a mixture of residential and holidays, the holiday side was halted when lockdown and heavy restrictions were enforced. As with millions of people worldwide, they found themselves spending most of their time at home.\n\nLike most of us, Mark was eager to get life back to some form of normality and, knowing the business was suffering and being self-employed, the quicker the better.\n\nIn late 2020, nine months into the COVID-19 pandemic, it was announced that a Covid vaccine had been approved and was being rolled out to stop the spread of the virus and save lives, ready for use in December 2020.\n\nThis was exciting news for Mark and Melanie. Their lives and their business had been placed on hold for far too long and they were ready and eager to resume their lives as they were pre-pandemic; the vaccine was the way out. Mark waited patiently for his turn to have his first jab. While waiting, the media was full of stories of how wonderful these vaccines were and that everyone absolutely must get this vaccine. It was suggested if you don’t get the vaccine you are being selfish. The Prime Minister and Cabinet ministers were telling the public daily on TV that everyone must have it, as well as every news channel and road signs everywhere saying the same. GPs were sending letters, flyers were coming through the door, doctors were all over the TV, with some doctors even suggesting the AstraZeneca vaccine was 100% safe and effective. This of course was what we were all hoping for and most of the population believed.\n\nFinally it was Marks turn to have his vaccine. On March 2nd 2021 Mark had his first dose of the AstraZeneca vaccine. Initially everything was fine and Mark seemed to escape the mild flu-like side-effects and aching arm that people were talking about. That was until the evening of March 15th 2021 when Mark had a headache and noticed blood in his urine. Melanie called 111 and they sent them to Worcester hospital. When the doctor examined Mark he noticed that Mark had a rash on his legs and admitted him straight away. Over the next day Mark’s headache got worse and, following some blood tests, it was revealed that Mark’s platelet count was at a very low rate of 14; normal levels would read between 150 and 450, so this in itself was alarming. On top of that results from a brain scan revealed a blood clot on Marks brain known as Cerebral Venous Sinus Thrombosis (CVST).\n\nCVST is a type of rare blood clot that forms in the venous sinuses in your brain. This is a system of veins found between the layers of the dura mater – the tough outer layer of your brain that lies directly under your skull.\n\nThe clot can block the blood in your brain from draining out toward your heart. When this happens, blood cells may break from the pressure, cross the blood-brain barrier and seep into nearby brain tissue. This can cause a haemorrhage, a type of stroke that stems from internal bleeding. CVST can be life-threatening. You need immediate medical attention.\n\nVery quickly the doctors informed Mark and Melanie that they thought it was a reaction to the vaccine. The next day, on March 17th 2021, Mark was getting worse and lost some of the use in his left leg and arm. Another scan was ordered and this revealed the clot was growing. Melanie realised how poorly Mark was. This was extremely distressing as due to the COVID-19 restrictions Melanie was unable to be on the ward with Mark. The nurses brought Mark into the corridor of the hospital in a wheelchair to see her. They told each other how much they loved each other and Mark told Melanie to tell their children how much he loved them. The nurses told Melanie they would get a side room ready for when Melanie came back in the evening so she could stay the night by Mark’s side.\n\nThat evening, before Melanie got back to the hospital, the hospital rang to say Mark had deteriorated and was now having seizures. He had also gone into cardiac arrest, and they made the decision to put Mark in an induced coma and on a ventilator. Melanie rushed to the hospital along with family members. They let her and their three children, Mark, Robert and Nicole wait in the corridor to say goodbye to Mark before they moved him to Birmingham Queen Elizabeth hospital. He was in an induced coma and they were told to expect the worst. On March 18th 2021, the hospital told the family that scans were showing Mark had a bleed on the brain and even if he survived there would likely be significant damage and not to expect Mark to walk out of the hospital. Mark’s family couldn’t just leave him and go home so they stayed in their cars outside the hospital all week, but still unable to see Mark due to the COVID-19 restrictions.\n\nThe hospital called the family in the afternoon and told them they couldn’t control the seizures and they wouldn’t stop so they needed to perform a thrombectomy to remove the clot. Melanie and the family were devastated and were desperate to see Mark. Melanie was told she could see him before they did the procedure but sadly when she got to the intensive care unit doors, despite Melanie crying and begging, the doctors wouldn’t let her in and she was just told to wait to hear from them.\n\nFortunately, the thrombectomy went well and Mark survived the procedure. He was then left to rest for a few days. After a few days the medical team couldn’t wake Mark successfully so on March 25th they put in a tracheostomy and on March 26th Mark finally woke. However it wasn’t until April 3rd, when they took the tracheostomy out, that Melanie and the family could finally talk to him on the phone. Mark had lost a lot of use of his left arm and leg, but over the coming days thankfully a lot of this returned. Mark was finally discharged from hospital on April 9th 2021, 26 days after being admitted. Against the odds, Mark proved the doctors wrong and walked out of the hospital, albeit loaded with several medications and a long road ahead.\n\nOnce home, Mark had to do a lot of therapy. He has now made a good recovery, considering what was expected. However his three fingers on his left hand are not really working and he still suffers with debilitating side effects. But both Mark and Melanie feel they are very lucky that he survived and thank the doctors and nurses for saving his life.\n\nEven though when in hospital Mark was told that the AstraZeneca vaccine caused the CVST, it wasn’t until sometime after he left the hospital that they fully understood what the cause was. It was explained that Mark was diagnosed with Vaccine induced Thrombotic Thrombocytopenia (VITT).\n\nVITT is diagnosed by having all five of the following:\n• Onset of symptoms five to 30 days after vaccination against COVID-19.\n\nMark had all of these, so his diagnosis was confirmed as VITT induced by the AstraZeneca vaccine. There are approximately 444 confirmed cases of VITT in the U.K. and sadly 81 deaths. However, this number is likely to be much higher as thousands of people who suffered blood clots were not given the relevant tests to detect VITT.\n\nTo this day, Mark’s PF4 antibodies are still testing positive, so he is still on the same blood-thinning tablets and blood pressure tablets as he came home from hospital with. He now has blood tests every four weeks. As VITT is a newly identified disease there are uncertainties around the decisions on stopping blood-thinning medications and it is still uncertain what it means when PF4 antibodies are still testing positive. Also, Mark’s latest scan revealed the blood on his brain has not dispersed and he still takes 3000mg of levetiracetam a day to prevent seizures, the same amount he came home from hospital with. The doctor has said with time this will be reduced but he will remain on them for the rest of his life.\n\nSince being discharged from hospital Mark has had to go back in: his platelet levels dropped again and he needed an immunoglobulin infusion (IVIg), which made him feel so poorly he needed to go back yet again. It is now almost two years later but Mark still suffers and his life has been hugely affected. He remains extremely weak and tired; he suffers from debilitating fatigue and has daily headaches. Melanie lovingly explains he really doesn’t complain, saying he is marvellous and they know he is so lucky to be alive.\n\nFollowing almost two years of living in a nightmare, Mark and Melanie are now trying desperately to return to as much normality as possible. They are self-employed and work together so have been impacted hugely, emotionally and financially. Mark is trying to do as much as he can possibly manage.\n\nThey applied to the Vaccine Damage Payment Scheme (VDPS) in April 2021. They really didn’t get much feedback for months. In June 2022, over a year later, they were told that Mark’s claim had been sent to the medical assessors. The medical assessors are the decisionmakers and assessed Mark’s claim solely on his medical notes that were requested early on; no personal assessment would be carried out and no up-to-date medical records would be requested, so the assessment is not based on any ongoing symptoms or any disabilities that have occurred as a result of VITT.\n\nOn December 23rd 2022, Melanie and Mark received an email saying a letter had been sent with the medical assessors’ decision. Melanie asked if the decision could be emailed and on December 29th 2022 that email arrived. It said that the medical assessors accepted causation – that the vaccine had caused Mark’s illness – but did not accept that Mark had reached the 60% disablement that is required to be eligible for an award. They only took into consideration Mark’s hand; they didn’t even mention all the medication he needs to prevent seizures, now or in the future, or take into account how Mark’s life has been impacted by fatigue and daily headaches.\n\nSo after two years of living in this nightmare, a future that has now been dramatically altered, no help will be offered by our Government – the same Government that spoke on TV daily throughout the COVID-19 pandemic and the months to follow, telling us all that we must have the vaccine to stop the spread and to save lives. The same Government that told us all that the vaccine was safe and effective. The same Government that prevented us from travelling if we weren’t fully vaccinated. And the same Government that told us we were selfish if we didn’t have the vaccine. Mark had done what was asked of him by our Government, and now Mark and Melanie will have to live with that decision and the consequences for the rest of their lives. Any help from our Government has now been rejected.\n\nMark and Melanie, who are members of VIBUK, will now be asking for a mandatory reconsideration and will be supplying further evidence which was not requested by the VDPS. If this fails then it will go to a tribunal. But one thing is for sure, none of us are giving up and VIBUK will continue to fight and campaign for a reform of the current VDPS which we all agree is unfit for purpose.\n\nThe latest VDPS figures show, as of January 10th 2023, there were 491 VDPS claims rejected and only 33 awarded – a success rate of just 6%. Thousands more are still waiting for their decisions, and with the percentage of claims being rejected so high it is expected that there will be many more disappointments in the coming weeks.\n\nThis is extremely upsetting for many who are injured, who can no longer live the lives they had pre-vaccine and also for the families of the bereaved. The financial impact is enormous and many claimants and families are desperate for financial help; the VDPS was a lifeline that has now, in more than 90% of cases to date, been taken away.\n\nMany can no longer work due to the injuries caused by the vaccine and many families have been hugely impacted financially and emotionally by the loss of a loved one. Lots of these families have been told they are not eligible for a payment by our Government, some because the medical assessors believed on the balance of probability the vaccine was not the cause of the injuries or death and some because the assessors believed the claimant is not injured enough, that they do not reach the 60% threshold required to be eligible for an award. Some of those rejected on the 60% threshold but accepted on causation, such as Mark, have a range of shocking injuries that vary from brain damage, blindness, permanent seizures, loss of feeling in limbs, loss of mobility, neurological issues, debilitating fatigue and damage to internal organs including serious heart conditions, plus many more. But the medical assessors have based their decisions on their own opinions, ignoring the opinions of the specialist consultants such as neurologists and haematologists. Many of those rejected will now be appealing and asking for a mandatory reconsideration.\n\nClaire Hibbs, who was injured by the AstraZeneca vaccine, is part of Vaccine Injured and Bereaved U.K. (VIBUK), a group of individuals injured or bereaved by the Covid vaccines (with medical or coroners’ reports confirming this) campaigning for a change to the current Government vaccine damage payment scheme (VDPS) to create a bespoke COVID-19 compensation scheme that ensures the adversely affected are appropriately compensated and supported. They also want people similarly affected by the vaccines to know that help is available and for their stories to be heard and not ignored. VIBUK can be found on Twitter and contacted here.", "opengraph": {"locale": "en_GB", "type": "article", "title": "94% of Claims to the Government's Vaccine Injury Payment Scheme Are Rejected, Many Because They Are Not \"60% Disabled\". Mark Kerry is One of Them – The Daily Sceptic", "description": "94% of claims to the Government's vaccine injury payment scheme are rejected, many because they are not \"60% disabled\". Mark Kerry, whose pre-vaccine life is gone forever, is one of them – read his story.", "url": "https://dailysceptic.org/2023/02/03/94-of-claims-to-the-governments-vaccine-injury-payment-scheme-are-rejected-many-because-they-are-not-60-disabled-mark-kerry-is-one-of-them/", "site_name": "The Daily Sceptic", "article:publisher": "https://www.facebook.com/LockdownScepticsFB", "article:published_time": "2023-02-03T17:02:56+00:00", "article:modified_time": "2023-02-03T17:24:51+00:00", "image": "https://dailysceptic.org/wp-content/uploads/2023/02/astrazeneca.png", "image:width": "968", "image:height": "544", "image:type": "image/png"}, "tags": ["COVID-19", "VDPS", "VIBUK", "Vaccine injury", "Vaccine"], "tweets": [], "movies": [], "links": ["https://www.webmd.com/dvt/blood-clots", "https://www.webmd.com/brain/picture-of-the-brain", "https://www.webmd.com/stroke/default.htm", "https://www.webmd.com/first-aid/internal-bleeding-causes-signs", "https://pn.bmj.com/content/20/5/356", "https://findothers.com/campaign/families-fighting-for-a-uk-bespoke-compensation-sc", "https://www.whatdotheyknow.com/request/vaccine_damage_payment_scheme_62", "https://www.gov.uk/vaccine-damage-payment/if-you-disagree-with-a-decision", "https://findothers.com/campaign/families-fighting-for-a-uk-bespoke-compensation-sc", "https://twitter.com/VIBUK1", "mailto:admin@vibuk.co.uk", "https://dailysceptic.org/tag/covid-19/", "https://dailysceptic.org/tag/vaccine/", "https://dailysceptic.org/tag/vaccine-injury/", "https://dailysceptic.org/tag/vdps/", "https://dailysceptic.org/tag/vibuk/"], "authors": ["Claire Hibbs"], "publish_date": "2023-02-03T17:02:56+00:00"}