{"result_id": "091005", "URL": "https://dailysceptic.org/2023/03/13/mrna-vaccine-contamination-much-worse-than-thought-jabs-up-to-35-dna-that-turns-human-cells-into-long-term-spike-protein-factories/", "timestamp": "2023-04-25 14:57:59 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/apple-touch-icon.png?v=3", "canonical": "https://dailysceptic.org/2023/03/13/mrna-vaccine-contamination-much-worse-than-thought-jabs-up-to-35-dna-that-turns-human-cells-into-long-term-spike-protein-factories/", "encoding": "UTF-8"}, "image": null, "domain": "dailysceptic.org", "title": "mRNA Vaccine Contamination Much Worse Than Thought: Jabs \"Up to 35%\" DNA That Turns Human Cells into Long-Term Spike Protein Factories –", "cleaned_text": "The contamination of mRNA vaccines with DNA is far greater than initially thought at up to 35%, and the DNA’s role in inducing human cells to produce the spike protein long term has been confirmed, according to the latest research.\n\nEarlier this month, the reported on the work of Dr. Kevin McKernan and his team who had subjected the mRNA vaccines from Pfizer and Moderna to deep sequencing analysis and found alarming levels of DNA contaminants known as plasmids. These are small circular DNA molecules that in principle can self-replicate in bacterial and human cells and induce the cell to produce the SARS-CoV-2 spike protein long term. Each vaccine dose was found to contain billions of these plasmids.\n\nThe Moderna vaccine appeared to contain DNA contamination at around the ‘safe’ level set by the European Medicines Agency (EMA) at the equivalent of one part per 3,000 mRNA molecules, though it’s not clear how safe this level really is. The Pfizer vaccine, on the other hand, was found to contain DNA contamination at 10 times the ‘safe’ level, at one plasmid per 350 mRNA molecules.\n\nThe DNA is part of the vaccine manufacturing process, providing the blueprint for the mRNA, but it should have been removed to at least the ‘safe’ level, though was not for reasons that are unclear.\n\nNow, Dr. McKernan and his team have undertaken further analysis and found that the level of DNA contamination is much greater than originally reported, with up to 35% of the vaccine product being this DNA contamination. They write:\n\nMolecular biologist Dr. Jessica Rose explains that this means each dose may contain trillions of DNA molecules, 100 times greater than previously reported: “The left-over expression vectors used to manufacture the mRNAs are at contamination levels 100-fold higher than originally proposed and imply trillions of DNA molecules per dose. This has implications for integration into our genome.”\n\nThe precise level of contamination is unknown as these are estimates with a wide margin of error. It may also vary by batch. What is certain, however, is that the contamination of both Pfizer and Moderna vaccines is way above any official ‘safe’ level.\n\nIn the original analysis, Dr. McKernan had been looking primarily for RNA contamination and had used an additive that can suppress DNA amplification. By looking specifically for DNA contamination he and his team found that the amount of DNA present was far greater than the initial technique had indicated.\n\nFurther analysis by Dr. McKernan and his team has also confirmed that the plasmids are intact and capable of self-replicating, and that the relevant promoters are present that allow them to express mRNA for spike protein in human cells (and not just in bacteria).\n\nThis indicates that these DNA plasmids are likely to survive for long periods, be taken up by cells inside the body and induce the cells to produce spike protein for an indefinite period of time.\n\nIt is thought this could explain the observed persistence of spike protein in the blood of vaccinated persons for weeks or months after injection, which is believed by experts to be a contributor to adverse effects of the COVID-19 vaccines.\n\nDr. Jessica Rose notes: “It is more than likely that these adverse effects are the direct result of t he contamination illuminated by Kevin and his team.”\n\nThese findings are obviously highly disturbing. Regulators ought to be making a priority of looking into these issues for themselves and, if confirmed, taking the appropriate action including removing the products from the market.", "opengraph": {"locale": "en_GB", "type": "article", "title": "mRNA Vaccine Contamination Much Worse Than Thought: Jabs \"Up to 35%\" DNA That Turns Human Cells into Long-Term Spike Protein Factories – The Daily Sceptic", "description": "The contamination of mRNA vaccines with DNA is far greater than initially thought at up to 35%, and the DNA's role in inducing human cells to produce the spike protein long term has been confirmed.", "url": "https://dailysceptic.org/2023/03/13/mrna-vaccine-contamination-much-worse-than-thought-jabs-up-to-35-dna-that-turns-human-cells-into-long-term-spike-protein-factories/", "site_name": "The Daily Sceptic", "article:publisher": "https://www.facebook.com/LockdownScepticsFB", "article:published_time": "2023-03-13T14:21:14+00:00", "article:modified_time": "2023-03-13T15:58:01+00:00", "image": "https://dailysceptic.org/wp-content/uploads/2021/06/Q5IVT6EKQ5OUTNNAUZBKLFN6YQ-scaled.jpg", "image:width": "2560", "image:height": "1727", "image:type": "image/jpeg"}, "tags": ["Contamination", "Moderna", "mRNA vaccines", "DNA", "Pfizer", "Adverse events", "Vaccine"], "tweets": [], "movies": [], "links": ["https://dailysceptic.org/2023/03/01/mrna-vaccines-contain-dna-that-turns-human-cells-into-permanent-spike-protein-factories-study/", "https://anandamide.substack.com/p/pfizer-and-moderna-bivalent-vaccines", "https://jessicar.substack.com/p/follow-up-on-dna-contamination-of", "https://anandamide.substack.com/p/sequencing-of-rnase-a-treated-pfizer", "https://doctors4covidethics.org/vascular-and-organ-damage-induced-by-mrna-vaccines-irrefutable-proof-of-causality/", "https://jessicar.substack.com/p/follow-up-on-dna-contamination-of", "https://dailysceptic.org/tag/adverse-events/", "https://dailysceptic.org/tag/contamination/", "https://dailysceptic.org/tag/dna/", "https://dailysceptic.org/tag/moderna/", "https://dailysceptic.org/tag/mrna-vaccines/", "https://dailysceptic.org/tag/pfizer/", "https://dailysceptic.org/tag/vaccine/"], "authors": ["Will Jones"], "publish_date": "2023-03-13T14:21:14+00:00"}