{"result_id": "091023", "URL": "https://dailysceptic.org/2022/01/24/macron-says-no-vaxx-no-citizenship-as-france-unveils-new-stricter-vaccine-passports/", "timestamp": "2023-04-25 14:58:03 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/apple-touch-icon.png?v=3", "canonical": "https://dailysceptic.org/2022/01/24/macron-says-no-vaxx-no-citizenship-as-france-unveils-new-stricter-vaccine-passports/", "encoding": "UTF-8"}, "image": null, "domain": "dailysceptic.org", "title": "Macron Says, “No Vaxx, No Citizenship” as France Unveils New, Stricter Vaccine Passports – The Daily Sceptic", "cleaned_text": "We’re publishing today a piece by Josie Appleton on the introduction in France today of the beefed-up vaccine passports and how they signify the almost mystical role the vaccines have taken on during the pandemic. Josie – who is author of and – sees in this an undermining of medical ethics that only harms vaccination itself.\n\nThe vaccine passport is a citizenship test for a morally and politically vacuous age. It is entirely passive – it is the simple act of consenting to a medical procedure, after which you are crowned with a civic virtue. This is a citizenship test that occurs on the level of what the Italian philosopher Giorgio Agamben calls “bare life”; that is, it is a question of merely biological existence, rather than a question of how a life is lived. Receiving a vaccine pass is mute; there are no words, there is no oath of allegiance to party, country or leader. You offer your body and receive a QR code in return: this is the nature of the new social contract between citizen and state. “Vaccinate, vaccinate, vaccinate” is the mantra for reconstituting authority and society in an age where this authority cannot be grounded on a substantial social basis.\n\nThe vaccine is being treated as a mystical state or collective substance that incorporates people into the collective body. Vaccination now is like a sacrament, a transubstantiation ritual; through the vaccine we are receiving the body of the state into our body and therefore joining the community.\n\nOne casualty in this is vaccination itself. Considered scientifically, a vaccine – as with any drug – is not a protective talisman or means for membership of a community. It is a medical product with particular qualities and uses, and particular side effects and risks. It may be useful for some groups but not others, and in some contexts but not in others. The rational use of a drug is as important as the drug itself, to ensure that it is directed towards the appropriate ends.\n\nThe ideological weaponisation of vaccines distorts these cost-benefit judgements. The vaccine is forced upon people who have little or no need of it, such as children and those with natural immunity, while ignoring those who have need of it. (The older and more vulnerable someone is, the less they are affected by vaccine passports.)\n\nThis episode is violating the very basis of health and medical ethics. Through vaccination passports and mandates, it has become acceptable to force someone to take a medical treatment, even a treatment that is not really in their medical interest. When Jean Castex boasted that the vaccine passport led to a rise in people getting their first vaccination, the interviewer pointed out “but they were forced”. Castex shrugged. In normal times, medical force is unacceptable; medical force means the Nazis. When France began vaccinating a year ago, it insisted upon consent forms and pre-vaccine interviews to ensure that people were really consenting. Now, the use of force has become entirely acceptable, it has become ethical in fact. It is the duty of the state to get people to do their duty.", "opengraph": {"locale": "en_GB", "type": "article", "title": "Macron Says, “No Vaxx, No Citizenship” as France Unveils New, Stricter Vaccine Passports – The Daily Sceptic", "description": "Under France's vaccine passport, the vaccine is being treated as a mystical state that incorporates people into the collective body. Vaccination now is like a sacrament; through the vaccine we are joining the community.", "url": "https://dailysceptic.org/2022/01/24/macron-says-no-vaxx-no-citizenship-as-france-unveils-new-stricter-vaccine-passports/", "site_name": "The Daily Sceptic", "article:publisher": "https://www.facebook.com/LockdownScepticsFB", "article:published_time": "2022-01-24T07:00:00+00:00", "article:modified_time": "2022-01-24T01:51:39+00:00", "image": "https://dailysceptic.org/wp-content/uploads/2022/01/louvre-2.jpg", "image:width": "976", "image:height": "549", "image:type": "image/jpeg"}, "tags": ["Vaccine Passports", "President Macron", "Mandatory Vaccines", "France"], "tweets": [], "movies": [], "links": ["https://www.youtube.com/watch?v=V3KRJvkPomU", "https://www.reuters.com/article/us-health-coronavirus-france-vaccine-sen-idUSKBN29B2IR"], "authors": ["Will Jones"], "publish_date": "2022-01-24T07:00:00+00:00"}