{"result_id": "091036", "URL": "https://dailysceptic.org/2023/01/18/unequivocal-safety-signals-for-heart-blood-and-reproduction-found-in-yellow-card-vaccine-data-says-top-scientist-withdraw-them-immediately/", "timestamp": "2023-04-25 14:58:06 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/apple-touch-icon.png?v=3", "canonical": "https://dailysceptic.org/2023/01/18/unequivocal-safety-signals-for-heart-blood-and-reproduction-found-in-yellow-card-vaccine-data-says-top-scientist-withdraw-them-immediately/", "encoding": "UTF-8"}, "image": null, "domain": "dailysceptic.org", "title": "Unequivocal Safety Signals for Heart, Blood and Reproduction Found in Yellow Card Vaccine Data, Says Top Scientist – \"Withdraw Them Immediately\" – The Daily Sceptic", "cleaned_text": "Dr. Richard Ennos, a retired Professor of Evolutionary Biology at Edinburgh University, has undertaken a thorough analysis of the U.K.’s COVID-19 ‘Yellow Card’ vaccine adverse event data and found it indicates “unequivocal safety signals” for adverse reactions caused by the Pfizer and Moderna vaccines affecting the blood, the heart and female reproduction. He concludes that: “There can be no question that the mRNA vaccines should be withdrawn with immediate effect.”\n\nIn the U.K., three COVID-19 vaccines – AstraZeneca (AZ), Pfizer (PF) and Moderna (MO) – have been used in a nationwide inoculation programme aimed at preventing harm from the SARS-CoV-2 virus. All three vaccines provide the genetic code that enables vaccinees to produce within their bodies the spike protein of the SARS-CoV-2 virus, the molecule associated with the pathology of COVID-19. In the AZ vaccine the genetic code for the spike protein takes the form of DNA, and is introduced into recipient’s cells by a genetically modified chimpanzee virus (DNA, adenovirus vector). For the PF and MO vaccines, the introduced genetic code takes the form of heavily modified RNA, and is carried to recipient’s cells within lipid nanoparticles (mRNA, lipid nanoparticle). There is no control over either the tissues to which the vaccines are transported or the length of time for which spike proteins are produced by those tissues.\n\nAll three vaccines rely on novel technology that has never before been used in humans. At the time of their introduction, they lacked any long-term safety data, and therefore required Conditional Marketing Authorisation from the Medicines and Healthcare products Regulatory Agency (MHRA). To monitor the safety of the three vaccines the MHRA established the COVID-19 vaccine Yellow Card reporting scheme (C-19VYC). This collates standardised reports of suspected adverse reactions to the COVID-19 vaccines that can be analysed to detect safety signals and potentially trigger withdrawal of the vaccines. Here we show that a thorough analysis of the C-19YC data indicates unequivocal safety signals for adverse reactions caused by the mRNA vaccines PF and MO affecting the lymph system, the heart and female reproduction.\n\nThe strength of the C-19VYC reporting scheme is that it is capable of generating an enormous amount of valuable information about adverse reactions to the experimental COVID-19 vaccines. Reports of suspected adverse reactions can be submitted not only by physicians but also by the recipients of the vaccines themselves, providing valuable feedback to the MHRA based on first-hand experience. This inclusive aspect of the C-19VYC reporting scheme has proved very successful, with nearly half a million adverse event reports submitted, roughly one for every hundred recipients of the COVID-19 vaccines in the U.K.\n\nDespite this strength in terms of quantity of data, the C-19VYC reporting scheme has a number of serious weaknesses related to the nature of the data collected. These weaknesses place limits on the scheme’s ability both to detect and to measure safety signals. The first problem is that the scheme does not identify or include a control group of individuals, who have not taken the vaccine, against which to compare those who have. Other major weaknesses are that reporting is passive rather than planned and takes place at a single point in time. Thus, reporting relies on the sufferer of the adverse reactions or his or her physician making the connection between the vaccine treatment and the adverse reaction. As a consequence, many adverse events will go unrecorded, and this becomes more likely the longer the delay between treatment and the associated adverse reaction. Reporting rates of adverse reactions are also likely to represent only a fraction of actual cases because physicians or recipients may have too little time to fill out the onerous paperwork, may not have knowledge of the Yellow Card scheme, or may be unwilling to countenance the idea of harms resulting from a medication in which they have placed trust.\n\nAs well as being low, reporting rates are expected to vary substantially between different sectors of the population. Experience shows that females post roughly three times more adverse event reports than males, and the reporting rate for adverse reactions varies with age, dropping off in the elderly population where adverse reactions may be obscured by multiple forms of pre-existing chronic illnesses. In addition, reporting rates are likely to vary with the severity of the adverse reaction. Individuals are far more likely to have the motivation and tenacity to file a report if their adverse reaction is severe than if it is mild. On the other hand, if the adverse event results in death, grieving friends or relatives may be too preoccupied to file a C-19VYC report.\n\nRecognising the limitations in the C-19VYC programme is a very necessary first step in exploiting the enormous volumes of data that it has produced. In its published summaries the MHRA is at pains to emphasise that the Yellow Card data cannot be used to calculate true rates of adverse effects or to compare the safety of the different vaccines, both because of the nature of the data and the existence of many confounding factors. I view the MHRA’s statements as a challenge. In the remainder of this article, I will endeavour to show that the MHRA’s view is overly pessimistic and that the enormous efforts of those who have submitted Yellow Card reports of COVID-19 vaccine adverse effects have not been in vain.\n\nIn order to independently analyse the C-19VYC reports, it is essential to have access to the raw data. The first FOI request for access to the full anonymised C-19VYC data was made in June 2021. This, and subsequent FOI requests have been refused on the grounds that it would be too onerous to pass on the raw data, and that anyway the data would be published at a future date. However, it should be noted that the MHRA sends the C-19VYC data without delay to the companies that market the COVID-19 vaccines. Some 18 months after the first FOI request, the MHRA has at last released information gathered by the C-19YC scheme that is sufficiently detailed to allow independent analysis and calculation of safety signals.\n\nA cursory look at the C-19VYC data indicates that the rate of reporting of serious and fatal adverse events is nearly three times higher for the adenovirus AZ vaccine (3.912 serious or fatal reaction reports per 1,000 doses) than for either of the mRNA vaccines PF or MO (1.341 and 1.344 serious or fatal reaction reports per 1,000 doses respectively). Although there has been no formal withdrawal of the AZ vaccine by the MHRA, the use of the AZ vaccine has effectively been discontinued, perhaps because of this worrying safety signal. With the discontinuation of the AZ vaccine, the most important question becomes whether serious safety signals can be detected for the remaining mRNA COVID-19 vaccines, PF and MO, that are still being employed.\n\nAs I have emphasised earlier, the data available from the Yellow Card scheme are the result of passive reporting. This means that any detailed analyses based on absolute numbers of reports of adverse reactions are problematic. However, a well-established protocol, known as proportional reporting rate analysis (PRR) has been devised for detecting safety signals using passive reporting data such as those collected by the C-19VYC scheme. The principles underlying the PRR protocol are explained below.\n\nSuppose that we wish to see whether a novel vaccine substantially increases the frequency of a particular adverse reaction, say severe headache. If there is no connection between administration of the vaccine and the frequency of severe headaches, then the proportion of all adverse reaction reports that are severe headache should be the same for the novel vaccine as for the established and thoroughly tested vaccines. However, if administration of the novel vaccine does cause severe headaches, there will be a higher proportion of all adverse reaction reports that mention severe headaches for the novel vaccine than for the established vaccines. By dividing the proportion of adverse events which mention severe headache in the novel vaccine by this same proportion calculated for the established vaccines, we obtain a measure of the strength of the safety signal for severe headaches caused by the novel vaccine, the proportional reporting rate or PRR.\n\nA safety signal is formally detected if three conditions are met. First, there must be a substantial number of reports of the chosen adverse reaction in the novel vaccine database. Second, the proportion of all reports that mention the chosen adverse reaction must be statistically significantly greater for the novel vaccine than for the established vaccines. This can be established using a simple ‘chi squared’ test. Thirdly, the proportion of adverse reactions calculated for the novel vaccine must be at least twice that calculated for the established vaccines (PRR>2).\n\nTo apply this PRR methodology to detect safety signals for the novel mRNA COVID-19 vaccines PF and MO, we make the very conservative assumption that the AZ vaccine does not increase the frequency of the particular adverse reactions that we are investigating. The AZ vaccine thus takes on the role of the safe, established vaccine in the PRR analysis. Therefore, we use data from the AZ vaccine to calculate the proportion of the chosen adverse events that we would expect in an established, safe vaccine. We then calculate the proportions of the chosen adverse event reports that occur in the PF and MO data, and compare these with the figure that we have calculated for AZ to obtain the PRR. If there is a significantly higher proportion of the chosen adverse event reports in the mRNA vaccines than in the AZ vaccine, and the PRR for the mRNA vaccine is two or more, this constitutes a strong safety signal requiring investigation and appropriate action.\n\nIn December 2022, MHRA released two data files from the C-19VYC scheme for each of the three COVID-19 vaccines. The first file contains an identifier for each Yellow Card report, the sex and age of the individual involved, and a classification of the severity of his or her adverse reaction – non-serious, serious or fatal. The second dataset includes the report identifier and various medical classifications of the adverse events suffered (there may be more than one adverse event per report). Perhaps the most accessible classification for the layman is based on the tissue type affected by the adverse reaction e.g. muscle, nerve, blood. By marrying up the two datasets, it is possible to create a single file for each of the COVID-19 vaccines that includes the report identifier, the sex and age of the patient, the tissue type affected by the first adverse event listed in the report (to avoid pseudo-replication of the reports), and the severity of the adverse reaction.\n\nData in the file described above are used here for PRR analysis to detect and measure the strength of safety signals associated with the adverse effects of the mRNA vaccines PF and MO on (harm to the blood and lymph system), the system (harm to the heart), and in females (harm to the menstrual cycle). The analysis has been confined to severe adverse reactions (serious plus fatal) to avoid the possible charge that the adverse reactions we are analysing are of little consequence to those they affect. To acknowledge the fact that reporting rates vary with both age and sex, the reported PRR values have been calculated in samples that are matched for both age and sex. This allows vulnerability to particular adverse reactions to be compared between age groups, and between females and males. It should be noted that when the analysis is conducted in the manner described, it yields estimates of the strength of the safety signals because it assumes that the AZ vaccine does not increase the rate of the adverse reaction being studied. If this is not the case, the estimated strength of the safety signal associated with the mRNA vaccine concerned will be greater than we report.\n\nFigure 1a and 1b show the results for females and males respectively of PRR analysis of adverse reactions associated with the PF vaccine that affects tissues grouped under the MHRA classification (blood and lymph systems). For both sexes, and across all except the very oldest age class, there are very striking safety signals, with proportions of severe adverse event often more than eight times higher after PF vaccination than after AZ vaccination.\n\nFor the other mRNA vaccine MO, the proportional reporting rate is again very significant and well over the threshold level for safety signals in most of the female age classes and in males aged between 20 and 49. The vast majority of these severe adverse reactions affect the lymph system rather than the blood, and the diagnosis given is lymphadenopathy. It is very worrying that in its “Coronavirus vaccine – summary of Yellow Card reporting” in January 2023 the MHRA fail to mention any possible adverse effects of the mRNA vaccines on the lymph system, despite such a strong safety signal being present when the Yellow Card data are appropriately analysed.\n\nWhen PRR analysis is applied to investigate possible adverse effects of PF vaccination on the heart ( , Figures 3a and 3b), there is a clear and significant safety signal for males between the ages of 10 and 50. For females values of PRR very close to the threshold value of 2 are present for ages 30 to 80.\n\nFor vaccine MO (Figures 4a and 4b) the same pattern of safety signals for severe cardiac disorders are found as for PF: high and significant proportional reporting ratios in young males from 10 through 40 years of age, and reporting ratios close to or just exceeding 2 in females 50 to 80 years of age.\n\nThe MHRA has conceded in its Yellow Card summary that: “There has been a consistent pattern of higher reporting of these suspected events (myocarditis and pericarditis) with both the monovalent COVID-19 Vaccine Pfizer/BioNTech and COVID-19 Vaccine Moderna, and of these occurring more frequently in males.” However, it has not apparently made any attempt to use the Yellow Card data to demonstrate a formal safety signal in the manner described above. It is also apparently unaware of the safety signal in females. Its response to the high number of reports of myocarditis and pericarditis generated by the mRNA vaccines has not been to withdraw the offending products, but instead to alter the safety information associated with these products and alert health professionals to look out for these very serious adverse events after the relevant vaccines have been administered: “[T]he product information for both monovalent COVID-19 Vaccine Moderna and COVID-19 Vaccine Pfizer/BioNTech was updated to inform healthcare professionals and patients of these reports and provide advice to be aware of important symptoms for myocarditis and pericarditis.”\n\nThe final piece of analysis reported here investigates whether the Yellow Card data yield a safety signal associated with female following inoculation with the mRNA COVID-19 vaccines. Figures 5a and 5b illustrate the results of PRR analysis for the PF and MO vaccines respectively. For PF there are significant safety signals in age groups 10 through to 40, while for MO a formal safety signal is only found in the youngest (10 to 20 year) age groups. The vast majority of the adverse event reports for female reproduction involve disruption to the menstrual cycle and excessive menstrual bleeding. Again, these have been recognised by the MHRA as side-effects of the mRNA vaccines but their severity has been downplayed, and no attempt has been made to formally identify safety signals despite the relevant data being available. As before, the MHRA has done nothing to protect the public from the severe adverse reactions to the mRNA vaccines that the Yellow Card data have revealed: “Evidence from the most recent review suggested a possible association between the Pfizer and Moderna COVID-19 vaccines and heavy menstrual bleeding. … The product information for the Pfizer and Moderna COVID-19 vaccines is therefore being updated to add heavy menstrual bleeding as a possible side effect.”\n\nA number of conclusions can be drawn from the analyses reported above. The first is that by applying PRR methodology it is possible to use the passively reported Yellow Card data to detect and quantify safety signals for novel vaccines, to gain insights into particular sex and age classes that may be affected by particular adverse reactions, and to compare the safety profile of different vaccines. The second conclusion is that the mRNA COVID-19 vaccines do not appear to be safe. Glaring safety signals are apparent indicating harm to the lymph system, the heart and to female reproduction. There can be no question that the mRNA vaccines should be withdrawn with immediate effect. The final conclusion is that the MHRA has provided no protection to the U.K. public from the adverse effects of the novel COVID-19 vaccines. Its regular publication “Coronavirus vaccine — summary of Yellow Card reporting” has been an exercise in defending the COVID-19 vaccines from criticism rather than defending the U.K. public from the COVID-19 vaccines. Its reports lack any scientific rigour, include not a single piece of statistical analysis to support the conclusions drawn, and are an affront to the huge number of individuals who have been injured or killed doing what they believed to be ‘the right thing’.\n\nDr. Richard Ennos is a retired Professor of Evolutionary Biology at Edinburgh University. He writes: “This article is dedicated to two groups within the U.K. First, the many who have been killed or injured by the rollout of the experimental and untested COVID-19 vaccines to an innocent and trusting U.K. public. Secondly to the dedicated physicians who have filed Yellow Card reports cataloguing the COVID-19 vaccine injuries and deaths. I would like you to know that your suffering and endeavours have not been in vain.”", "opengraph": {"locale": "en_GB", "type": "article", "title": "Unequivocal Safety Signals for Heart, Blood and Reproduction Found in Yellow Card Vaccine Data, Says Top Scientist – \"Withdraw Them Immediately\" – The Daily Sceptic", "description": "There are \"unequivocal safety signals\" for heart, blood and reproduction problems in Yellow Card vaccine data, a top U.K. scientist has warned, saying: \"Withdraw them immediately.\"", "url": "https://dailysceptic.org/2023/01/18/unequivocal-safety-signals-for-heart-blood-and-reproduction-found-in-yellow-card-vaccine-data-says-top-scientist-withdraw-them-immediately/", "site_name": "The Daily Sceptic", "article:publisher": "https://www.facebook.com/LockdownScepticsFB", "article:published_time": "2023-01-18T07:00:00+00:00", "article:modified_time": "2023-01-18T09:16:05+00:00", "image": "https://dailysceptic.org/wp-content/uploads/2023/01/yc.png", "image:width": "989", "image:height": "643", "image:type": "image/png"}, "tags": ["Yellow Card Reporting System", "Moderna", "AstraZeneca", "COVID-19", "Pfizer", "Vaccine injury", "Vaccine"], "tweets": [], "movies": [], "links": ["https://www.gov.uk/government/publications/coronavirus-covid-19-vaccine-adverse-reactions/coronavirus-vaccine-summary-of-yellow-card-reporting", "https://pubmed.ncbi.nlm.nih.gov/11828828/", "https://yellowcard.mhra.gov.uk/idaps/CHADOX1%20NCOV-19", "https://yellowcard.mhra.gov.uk/idaps/TOZINAMERAN", "https://yellowcard.mhra.gov.uk/idaps/ELASOMERAN", "https://www.gov.uk/government/publications/coronavirus-covid-19-vaccine-adverse-reactions/coronavirus-vaccine-summary-of-yellow-card-reporting", "https://www.gov.uk/government/publications/coronavirus-covid-19-vaccine-adverse-reactions/coronavirus-vaccine-summary-of-yellow-card-reporting", "https://dailysceptic.org/tag/astrazeneca/", "https://dailysceptic.org/tag/covid-19/", "https://dailysceptic.org/tag/moderna/", "https://dailysceptic.org/tag/pfizer/", "https://dailysceptic.org/tag/vaccine/", "https://dailysceptic.org/tag/vaccine-injury/", "https://dailysceptic.org/tag/yellow-card-reporting-system/"], "authors": ["Dr Richard Ennos"], "publish_date": "2023-01-18T07:00:00+00:00"}