{"result_id": "091027", "URL": "https://dailysceptic.org/2023/01/26/the-disastrous-covid-vaccines-risk-tarring-all-vaccines-with-the-same-brush/", "timestamp": "2023-04-25 14:58:04 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/apple-touch-icon.png?v=3", "canonical": "https://dailysceptic.org/2023/01/26/the-disastrous-covid-vaccines-risk-tarring-all-vaccines-with-the-same-brush/", "encoding": "UTF-8"}, "image": null, "domain": "dailysceptic.org", "title": "The Disastrous Covid Vaccines Risk Tarring All Vaccines With the Same Brush – The Daily Sceptic", "cleaned_text": "It is the 200th anniversary of the death of Edward Jenner, who is credited with the birth of vaccination.\n\nHe was a student of St George’s medical school, which has named a major science block after him. When the Medical Research Council and Glaxo decided to jointly fund a national vaccine institute to focus on vaccine research, it was named the Jenner Institute and built in Compton before moving to Oxford.\n\nIt is worth looking at his role in the development of vaccines as it was not related to his background.\n\nHe did the definitive challenge experiment following the observations of many others. The idea of protecting against smallpox, which was a mutilating infectious disease, with a tiny dose injected under the skin from a sufferer may have been around for many centuries, although it is clearly documented from the 1400s onwards. It was first brought to the U.K. in 1721 by Lady Mary Montague, who had observed the practice in Turkey and wanted to protect her children. However, the man who brought it to Jenner’s attention was a Mr. Jesty, a farmer who made the observation that none of his milk maids ever contracted smallpox although they did all get infected with cowpox, which was a very mild disease.\n\nMr. Jesty decided, in 1774, to test the hypothesis that cowpox could protect against smallpox by variolating or injecting a small amount of cowpox under the skin of his family and children, none of whom developed smallpox. This was an amazing first as he used an attenuated, similar and less toxic agent to induce a protective immune response against the highly infective and dangerous mutilating virus.\n\nThis approach was to be adopted by the father of laboratory developed vaccines, Louis Pasteur, who attenuated several agents by passaging them through cell culture. This was the process used by Calmette and Guerin to develop the BCG vaccine for tuberculosis at the turn of the 20th century.\n\nJenner’s contribution was to do the same thing, using cowpox, to a young boy called James Phipps, and then inject live smallpox as a challenge. Fortunately, the boy did not contract the disease and this major trial of one(!) was widely broadcast due to Jenner’s eminence as a Fellow of the Royal Society for studies on bird behaviour. Its effect was confirmed and eventually taken up by Napoleon and the USA.\n\nThis approach was eventually to lead to the total eradication of smallpox by 1980. Louis Pasteur was the first to make laboratory-derived vaccines, passaging agents through cultures and using the effect of attenuation mentioned above. His first was a vaccine to prevent a cholera-like diarrhoea in chickens, and he developed many agents against diseases such as anthrax and developed a vaccine for rabies to be given post-exposure.\n\nThe technology used to develop flu vaccines following the great Spanish flu of 1918-19 (which actually started in a fort in Kansas in the USA) centred around inactivated viruses, which also formed the basis of the first polio vaccine by Jonas Salk. The so-called Spanish flu infected around 500 million people and killed 25-50 million, most of whom were fit adults and not the elderly, who were most at risk to later flu endemics. It was therefore an obvious target for vaccination. It is worth noting that many trials of two million people were conducted and no conclusion regarding effectiveness could be confirmed.\n\nThe knowledge gained, however, was effective against another worldwide scourge: polio. It is worth noting that this vaccine did not prevent transmission, unlike the later, more sophisticated, attenuated oral vaccine of Sabin, which eventually became the worldwide vaccine and is highly effective. The problem with developing flu vaccines was evident when scientists became aware of different strains and the fact that they frequently changed, so that a vaccine needed to be strain specific.\n\nIt is beyond the scope of this article to go into any detail on this, but instead to highlight a lesson learned from the famous flu outbreak in 1976 at another American military establishment, Fort Dix, when 13 soldiers became very ill (one died) and it rapidly spread amongst the population.\n\nThe U.S. Government rapidly trialled a specific vaccine (four types from four different organisations) and immunised over 40 million people. Very observant clinicians noted a small increase in the numbers of people suffering from rare neurological conditions such as Guillain-Barré syndrome (GBS)and myelitis, and wondered if this was related to the vaccine. This led to intensive monitoring, which confirmed that there was a three- to seven- fold increase in GBS in the weeks following the vaccine.\n\nBy the time this was established, the flu epidemic was dying out and a decision made to abandon the vaccine programme as it was clearly doing more harm than good. Fast forward to Covid, which unlike the previous flu outbreaks has ended up killing people with an average age of death higher than from other conditions. We have a vaccine programme which was rushed through with emergency powers that is being pushed on the population in the form of repeated boosters, even though the virus which the vaccines are aimed at no longer exists and has been replaced by more infectious but milder variants.\n\nThe AstraZeneca vaccine has been associated with so many clotting and cardiac issues that it has been quietly withdrawn and the mRNA vaccines are clearly causing an excess of cardiac and clotting issues too, as highlighted by Dr. Aseem Malhotra.\n\nWhere are the monitors and regulators assessing this today?\n\nI am sure that the 1976 FDA and regulators would have concluded the obvious, in that there are far more deaths and injuries from the vaccine programme than the vaccines are ever likely to prevent from any new Covid variant. So why are we continuing with what some have called the biggest piece of mass criminal negligence since the thalidomide programme?\n\nEver since I raised the alarm that the boosters are preceding relapses of stable cancers and the occurrences of new B cell-based cancers such as lymphomas I have been contacted daily by doctors from far and wide who are seeing the same but not being listened to.\n\nA short history of vaccines highlights the tremendous good that has been done for humanity with their development. However, the failure to monitor the Covid vaccine adverse effects and deaths risks undoing all that good work and tarring all vaccines with the same brush.\n\nDr. Angus Dalgleish is an expert in immunology and Professor of Oncology at University of London.", "opengraph": {"locale": "en_GB", "type": "article", "title": "The Disastrous Covid Vaccines Risk Tarring All Vaccines With the Same Brush – The Daily Sceptic", "description": "As we mark the 200th anniversary of the death of vaccine pioneer Edward Jenner, Dr. Angus Dalgleish says the disastrous Covid vaccines risk tarring all vaccines with the same brush.", "url": "https://dailysceptic.org/2023/01/26/the-disastrous-covid-vaccines-risk-tarring-all-vaccines-with-the-same-brush/", "site_name": "The Daily Sceptic", "article:publisher": "https://www.facebook.com/LockdownScepticsFB", "article:published_time": "2023-01-26T07:00:00+00:00", "article:modified_time": "2023-01-26T20:57:27+00:00", "image": "https://dailysceptic.org/wp-content/uploads/2023/01/jenner.png", "image:width": "1092", "image:height": "697", "image:type": "image/png"}, "tags": ["Vaccine injury", "COVID-19", "Vaccine", "Vaccine efficacy"], "tweets": [], "movies": [], "links": ["https://dailysceptic.org/2022/10/18/until-proven-otherwise-it-is-likely-covid-mrna-vaccines-played-a-significant-role-in-all-unexplained-heart-attacks-since-2021-renowned-cardiologist/", "https://dailysceptic.org/2022/12/19/i-have-tried-sounding-the-alarm-about-the-vaccines-causing-cancer-relapse-but-the-mainstream-media-dont-want-to-know/", "https://dailysceptic.org/tag/covid-19/", "https://dailysceptic.org/tag/vaccine/", "https://dailysceptic.org/tag/vaccine-efficacy/", "https://dailysceptic.org/tag/vaccine-injury/"], "authors": ["Dr Angus Dalgleish"], "publish_date": "2023-01-26T07:00:00+00:00"}