{"result_id": "091032", "URL": "https://dailysceptic.org/2023/01/25/refusing-to-discuss-the-side-effects-of-the-mrna-vaccines-or-downplaying-them-is-undermining-public-trust-in-medical-leaders/", "timestamp": "2023-04-25 14:58:05 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/fbrfg/apple-touch-icon.png?v=3", "canonical": "https://dailysceptic.org/2023/01/25/refusing-to-discuss-the-side-effects-of-the-mrna-vaccines-or-downplaying-them-is-undermining-public-trust-in-medical-leaders/", "encoding": "UTF-8"}, "image": null, "domain": "dailysceptic.org", "title": "Downplaying the Side Effects of the mRNA Vaccines is Undermining Public Trust in Medical Leaders – The Daily Sceptic", "cleaned_text": "Professor Vinay Prasad and Dr. John Mandrola have written an essay for the in which they take a detailed look at the evidence surrounding the increased incidence of myocarditis among those who’ve taken the Pfizer and Moderna Covid vaccines – particularly healthy young males. They caution against relying on non-experts to parse this evidence, but say that’s understandable because people no longer trust public health leaders to be forthcoming and honest about the side effects of the mRNA vaccines. The solution, they argue, is for these leaders to stop dismissing or downplaying people’s concerns. Here’s how their essay begins:\n\nWhy are so many people, many of them quite young and seemingly in the peak of health, dropping dead? Today, the news of such events is so inescapable that it feels like an epidemic.\n\nPerhaps the most high profile of these was the near-death, on national television, of 24- year-old Buffalo Bills football player Damar Hamlin. Hamlin went into cardiac arrest after a routine hit during a game earlier this month. He was ultimately saved by prompt medical care. But during the drive from the field to the hospital, Hamlin became a potent political symbol.\n\nAcross social media, prominent pundits and activists – most on the right but some on the Left – tied Hamlin’s injury to the Covid vaccine. “Prior to 2021, athletes collapsing on the field was NOT a normal event. This is becoming an undeniable (and extremely concerning) pattern,” tweeted Lauren Witzke, who was the Republican nominee in the 2020 Delaware Senate race. Social media was abuzz with similar speculation.\n\nA troubled, uncertain public is increasingly turning to a single, ominous explanation for such events: Covid vaccinations, especially those from Pfizer and Moderna that use the new mRNA technology.\n\nOn Twitter, an active subculture using variations of the hashtag #DiedSuddenly tracks such unexpected deaths – a teenage basketball player dropping dead; a track star collapsing on the field; a young teacher dying of a heart attack in front of her class – and implies that vaccines are the cause. A discredited anti-vaccine documentary, , has reportedly been seen by millions. And the night of Hamlin’s collapse, Fox News host Tucker Carlson, referencing a supposed study of sudden deaths among Europeans athletes, made the debunked claim that “Since the vax campaign began, there have been more than 1,500 total cardiac arrests… and two-thirds of those were fatal.”\n\nIs there truth to any of these claims? Is the public right to be concerned? Are there actually more healthy people dropping dead than usual – or is this simply confirmation bias at work? Can we dismiss anything that travels under the banner of ‘died suddenly’ as conspiracy theorising? And how should we understand why so many Americans are drawn to this explanation?\n\nAt least part of the answer to that last question is the serious information void on this subject – which is what we want to remedy in this essay. One of us is a practising cardiologist (John Mandrola). The other is a practising hematologist and professor of epidemiology (Vinay Prasad).\n\nCards on the table: We think the vaccines are an important tool for preventing severe illness and death among vulnerable people – particularly the elderly and those with certain underlying medical conditions. But we have been concerned that our federal officials recklessly continue to push for multiple Covid shots for everyone five years-old and up, despite the growing evidence that these vaccines may not be appropriate for all. We are also concerned about the way side effects of the vaccine, particularly among young men, have been downplayed.\n\nFor these reasons and more, we believe in being transparent and honest with a public that has lost trust in our essential public health institutions.", "opengraph": {"locale": "en_GB", "type": "article", "title": "Downplaying the Side Effects of the mRNA Vaccines is Undermining Public Trust in Medical Leaders – The Daily Sceptic", "description": "The reason people are turning to non-experts to discover more about the link between the mRNA vaccines and myocarditis, particularly among healthy young males, is because public health leaders refuse to discuss it.", "url": "https://dailysceptic.org/2023/01/25/refusing-to-discuss-the-side-effects-of-the-mrna-vaccines-or-downplaying-them-is-undermining-public-trust-in-medical-leaders/", "site_name": "The Daily Sceptic", "article:publisher": "https://www.facebook.com/LockdownScepticsFB", "article:published_time": "2023-01-25T17:00:00+00:00", "article:modified_time": "2023-01-25T18:37:44+00:00", "image": "https://dailysceptic.org/wp-content/uploads/2023/01/132c72f2-bc11-46ac-a25f-68aa2f1ff14f_3467x2363.jpg", "image:width": "1304", "image:height": "889", "image:type": "image/jpeg"}, "tags": ["The Free Press", "Myocarditis", "mRNA vaccines", "Sudden Death", "Cardiovascular Diseases"], "tweets": [], "movies": [], "links": [], "authors": ["Toby Young"], "publish_date": "2023-01-25T17:00:00+00:00"}